{"name": "home-bistro-chicago", "reviews": [{"review": {"des": "HB is a neighborhood favorite. It's cozy and casual enough for groups or date night, and has the best seasonal dishes. <br><br>You can't go wrong with the bacon wrapped dates app and pork entrees. Last night I had the hand cut fettuccini with pork belly and goat cheese. So good!<br><br>Its BYOB which is amazing and makes a really nice dinner with a bottle of wine a lot more affordable. They also have Wednesday deals for a 3 course dinner for $35.", "pics": null}}, {"review": {"des": "Unfortunately, Home Bistro did not live up to the expectations set by all these great Yelp reviews - or to the promise of the items on the menu.  It is entirely possible that we ordered poorly (with one exception) or that the kitchen was having a rough night.  Despite being underwhelmed, I'd be willing to try dining here again.<br><br>My sister and I started with the artichoke fritters.  We both remarked on how salty they were.  The Edam cheese sauce that accompanied the fritters did little to cut the saltiness and was too mild to add anything to the dish.<br><br>I ordered the rainbow trout, which was spectacular.  Presented in a beautiful stack and topped with fried egg, it was a beautiful presentation.  The fish was perfectly cooked and the other items on the plate were well matched.<br><br>Unfortunately, my sister ordered an angel hair pasta dish with shrimp and peppers.  If the preparation and presentation of the trout was masterful, the pasta was at the other end of the scale.  My sister hated it, so I traded dishes and gave up the trout.  Both the noodles and the shrimp were overcooked.  The dish was starchy-sticky.  The chili peppers clashed with the garlic and other spices.  There were odd pockets of creamy... something.  Maybe there were whole cloves of roasted garlic mixed in?  Whatever made things suddenly creamy - it was jolting.<br><br>We were working our way to the Metro for a show and didn't have time to wait for another dish.  Otherwise, I would have sent the pasta back.  As I stated earlier, I'd try Home Bistro again.  Based on my first meal, I'd suggest you dodge the pasta.", "pics": null}}, {"review": {"des": "Visited this place with a friend for the first time and was blown away.<br><br>We chose the prefix option and I simply loved the flavor combinations.  I had their artichoke and edamame fritters, perfectly cooked pork with apricots and a spicy kick and chocolate bread pudding. There wasn't a single thing I didn't enjoy. There were combos of things I never have seen put together before on a menu, and they made for really a surprising, yummy meal.<br><br>Service was also good, attentive but plenty of breathing room for a relaxed meal. I would definitely go here again.", "pics": null}}, {"review": {"des": "The food: 3.5/5. The apps we tried were ok, less flavorful than I expected. The main dish was great though, a very unique pairing of hot scallops and cold watermelon gazpacho.<br><br>Herloom tomatoes - 3/5<br>Shrimp ceviche - 2/5<br>Scallops with watermelon gazpacho - 5/5<br><br>The service: 4/5. Our waiter gave good suggestions but it felt that he wanted us to leave asap. Our bill got dropped off before we even finished our dinner.<br><br>Overall: 3.5/5. A good spot to check out if you're in Boystown, but not on the short list of place to go back or to make a special trip to.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/kXWIVvKN_qoyKkme_MfIvA/168s.jpg", "caption": "Heirloom tomatoes and shrimp ceviche"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/TQ2GetB3WK8xQzF_lFCXsw/168s.jpg", "caption": "Scallops in watermelon gazpacho"}]}}, {"review": {"des": "This is such an intimate place. I came here with a friend for dinner, and it was fantastic. <br><br>We came on Wednesday, which is when they offer their fixed price menu deal. You get three courses for $35, and for the amount of food you get, it is worth it. <br><br>The Atlantic Salmon was amazing. Lightly seared with great seasoning and an almost a cherry flavored side of beans, I would definitely order it again. Also, the fried mozzarella was unbelievable. Can't wait to come back soon!", "pics": null}}, {"review": {"des": "Solid BYOB place with a rotating menu. We sat up on a platform by the front windows. There we had a clear view of the 7-Eleven across the street while we watched their security guy put boots on cars that were illegally parked there. It was quite the entertainment during our dinner. There are maybe 15 tables in the entire restaurant and with the large picture windows in front there's plenty of natural lighting until the sun goes down.<br><br>Service was attentive, but not overly so. <br><br>We split the beet salad and the escargot which were tasty but seemed too small since they were served out of their shells. The roasted tomatoes with garlic were very flavorful and the escargot were not chewy. <br><br>The beet salad had a strange pistachio butter which was too thick and dry - a bit more liquid in it would would have made it a better pairing for the roasted beets.<br><br>We also had the bacon wrapped dates stuffed with almonds. Have had these many restaurants and this was probably my least favorite. That kind of a dish is already dry with a date, and almond and crisp roasted bacon wrapped around them. It screams out for some sort of a sauce. Instead this was served with some lumps of brown sugar that were baked with them. Overly sweet, grainy and just not right.<br><br>Another had the fried soft shell crab sandwich with truffle fries. The fries were perfectly seasoned. The crab sandwich was a decent size.<br><br>One of us had the chicken sausage with beans. It was very tasty - the beans had a lot of flavor and the sausage was nicely spiced. It does seem like a lot of money ($24) for a few pieces of sausage and a pile of beans.<br><br>The fettuccine with clams was solid. Our table mate had this before and enjoys the fresh clam flavor and perfectly cooked pasta.<br><br>The duck breast with Asian ratatouille was well seasoned. The duck breast was a hair over cooked to medium well instead of medium. The Asian ratatouille had a nice mix of zucchini, peppers and onions with a little extra jalapeno to spice it up.<br><br>If in the area probably return since the BYOB feature is a big money saver.", "pics": null}}, {"review": {"des": "What a cozy place!  I love the décor and the ambience.  <br><br>My friend and I started with country fried chicken livers & pan fried shishito I with sea salt.  The livers were well seasoned, both crunchy and creamy and the blistered peppers were perfectly balanced with sweet and savory.  Our main course consists of fork tender braised pork cheeks, pan roasted duck breast and mussels & frites.  All were perfectly prepared and presented.   <br><br>I was a bit ticked with a party of 4 who sat next to us.  They were loud and obnoxious.  Lucky for us, we were almost done with our dinner.  Overall, it was a very pleasant experience.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/NiajRGuSoniHC1fksATDuw/348s.jpg", "caption": "Pan roasted duck breast"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/osZ8uTtxy59_0j36DN-OUw/168s.jpg", "caption": "Braised pork cheeks"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/r79gNoF1iKzmfWHxkk-Csw/168s.jpg", "caption": "Mussels"}]}}, {"review": {"des": "Home Bistro, you get me every time. I've now had the pleasure of dining at this fine establishment two times, and both were two of the best meals I've had in Chicago. The chef is a Cincinnati native and on my first visit he was serving his own rendition of skyline chili. I was brave enough to succumb away from my Chicago superiority complex and try the chili. Best choice I made that night (other than going to the Hangge - Uppe) as it blew away my expectations. <br><br>On my second visit I had the chicken sandwich, which I know sounds casual, and it was incredible. A casual fare with a formal taste, so so good. <br><br>An absolute must is the bread pudding for dessert. They are always rotating how they make it and we were lucky enough to indulge in the challah and cinnamon roll bread pudding. <br><br>Pro Tip - Home Bistro is BYOB, pick up a nicer bottle of wine than usual and make up for the usual alcohol cost with more food.", "pics": null}}, {"review": {"des": "Very nostalgic for us to come here after many years. The artichoke fritters were lovely. The house made mozzarella was a little tough, but it was topped with a flavorful green tomato relish.", "pics": null}}, {"review": {"des": "I went here for my birthday one time with a small group of friends and we all absolutely loved the menu. While everything was delicious (I had the scallops), we were all blown away by the simple yet delectable seared shishito peppers appetizer. In fact, we regularly buy them at Whole Foods or Marianos now to make at home for a quick and healthy appetizer. <br><br>We keep meaning to go back but haven't had a chance yet.", "pics": null}}, {"review": {"des": "A staple, local style place that is consistently reliable for unique yet recognizable dishes. Creativity is a key feature with most plates. BYOB is great.", "pics": null}}, {"review": {"des": "OMG!! This restaurant is as good as it gets. I first stumbled in this cozy little restaurant about ten years ago and have never been disappointed.  I brought my gf here on our first date and I seriously think that helped close the deal on her accepting my marriage proposal.  Fast forward seven years and three kids later, we were fortunate to score a baby sitter and reservations before the Foo Fighters concert and almost ordered everything on the menu.  The fritters, bacon wrapped dates, tomato appetizer, Mussels, Pork Belly and PLEASE keep the soft shell crab over watermelon a permanent item on the menu...nothing we eat will ever be as close as this piece of heaven on earth.  <br><br>Don't even get me started on the bread pudding....TO DIE FOR!<br><br>Home Bistro I have a love/hate feeling for you.  Love the food but hate the fact I gained a few pounds after dinner.  LOL <br><br>Hands down the best restaurant in the area.", "pics": null}}, {"review": {"des": "The is the best restaurant in Boystown. The constantly changing menu offers something for everyone and the food is always amazing. You can really tell the care they put into finding fresh ingredients. <br><br>I try to make it here as much as I can afford to. Very nice owners too.", "pics": null}}, {"review": {"des": "Food was great but atmosphere was strange. We got there and were seated immediately but were told there was a reservation an hour after we were seated so we had to be done by then. Also I did not know it was a BYOB place.<br><br>The food was good, but nothing remarkably amazing. Was expecting more given how high he other reviews are at this place, probably won't be coming back.", "pics": null}}, {"review": {"des": "This is definitely a date night kind of restaurant. My husband and I went on a Thursday night and we were able to make a reservation for 8:45pm. It is byob which is awesome and there is even a seven eleven across the street where you can buy wine if you don't remember to byob. My husband got the polenta which was good and I got the burger which unfortunately wasn't to my taste. We split the crostata which we both really liked so I would definitely recommend the dessert there. I would try this place again but not a big fan that you can't make any alterations to the food and that they didn't have many healthy options. Overall, an intimate environment which interesting food menu options but unsure that they have nailed the quality of the food.", "pics": null}}, {"review": {"des": "This is a great BYOB place with a specialized menu. The Smoked Chicken Thigh Sandwich is quite a treat, and so is the Prince Edward Island Mussels.<br><br>The waitress was very friendly and helpful, showing us traditional ways of eating the Mussels.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/s3m1wSHYKy1P3TX6X4xtEg/168s.jpg", "caption": "Smoked Chicken Thigh Sandwich"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Hrx9o9PPCm9nJqATuBV68Q/168s.jpg", "caption": "Prince Edward Island Mussels"}]}}, {"review": {"des": "Delicious BYOB in a hidden storefront in Boystown. Home Bistro has a great menu of American food with a modern twist. I would recommend the Wednesday pri-fixed deals as well as making a reservation. <br><br>Need to come try for brunch!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Zpaw-zuL0Nj4lSBNK2P3Lg/348s.jpg", "caption": "fried pickles app"}]}}, {"review": {"des": "It's hard to find a sit down American restaurant with free BYOB. The place is cozy and low lit. It's not a big place so I would recommend making reservations. I was seated and set up right away with my water and wine though I was the only person from our party to arrive very early. <br><br>The menu is trendy/unique/upscale without totally breaking the bank. Their entrée menu was recently updated so it was hard to ask for suggestions from the waiter. <br><br>4 girls shared 2 appetizers. The artichoke and edam cheese fritters was rather disappointing...it was under salted and flavorless. there wasn't a lot of garlic aioli either. I don't think any of us preferred it. The garlic and escargot was pretty good. it would have been better the portion was a bit bigger for sharing. <br><br>I ordered the milk poached haddock. I didn't care too much for the lightly flavored fish itself but I liked all the accompaniments like the hearty latkas. it felt like the dish could have used some tartness to round out the taste. 1 friend got the trout which was quite crisp and tasty when I tired it. the other girls seemed to enjoy the beef heart- this was my 1st time trying it and I found it only slightly chewy but it didn't have any adverse after taste...so I guess that's good.   <br><br>overall it's probably 3.5. I liked the small intimate setting, the free BYOB policy and there is something for everyone.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/CW3al0px8SSEO5knhtwScg/348s.jpg", "caption": "Escargot"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/aaK4nsO0ButcKtGX8obbyQ/168s.jpg", "caption": "Beef heart"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/_poLntY-vsLvug1IV7dZKw/168s.jpg", "caption": "Milk poached haddock"}]}}, {"review": {"des": "We were looking for a place to eat before heading to the Tina and Tony's Wedding show. Since Home Bistro was within walking distance, we decided to check it out!  After reading some yelp reviews, I was a little concerned we wouldn't be able to get reservations because the place was small.  However, there were plenty of seats for brunch at 1230pm on a Sunday. We were even able to snag a table by the window with a view.<br><br>The brunch menu was small but I didn't mind. I prefer a small menu with lots of perfected and flavorful dishes than a large menu of mediocre dishes. Home Bistro did not disappoint. I ordered the Korean hash which was a bowl of marinated bulgogi, egg, potatoes, apples, in a sweet sauce. It was delicious! The meat was nice and tender and the potato hash was crisp on the outside and soft on the inside (just the way I like them)!<br><br>Service was so friendly and fantastic. I must have had my coffee refilled three times. Its definitely bottomless and they make sure your cup is full here.<br><br>I can't wait to come back and try the other items on their menu.", "pics": null}}, {"review": {"des": "Yelp lead us here after a Cubs game. It was still early and we had our choice of seats. Sat by the window and people watched while we ordered our food. This is a BYOB, and luckily we had two bottles that we brought with. We started with shishito peppers which were perfectly blistered and tasty, then bulogi/spatzel, this combination was killer!, I could've eaten another serving. There were four of us and we tried five courses and share them all. Also on the menu we tried the gnocchi, Prince Edward musssels, and finally doughnut holes with caramel sauce. Everything was so tasty, I want to go back and try more items on the menu. Staff is very helpful we had no issues, only a great time.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ISXObb0NJXID0tTRSC9V9g/348s.jpg", "caption": "The small dining area. Very cozy"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/zYgIrdgpIpM8aDBWJGeoEw/168s.jpg", "caption": "Dense donut holes. Enough to share. One is perfect."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/XfDU2PX4h6aA9qvb9Mo7oA/168s.jpg", "caption": "Gnocchi was ok"}]}}, {"review": {"des": "Delicious worldly menu.  <br><br>The sides are damn delicious- patatas bravas, shishito peppers, and artichoke & demo fritters.  Delicious!<br><br>Great atmosphere and it's BYOB- a winner in Lakeview.<br><br>I went back this past weekend, and the menu was still delicious.  We tried the Cincinnati Skyline, the mussels, and the burgers.  The burgers were the winners (grass-fed beef), and the mussels were delicious and salty.  The fries with both dishes were also delicious.<br><br>The one issue I have is that even though we all ate dinner ( and our party spent over $200), we were asked to leave about 5 minutes after we paid the bill.  We were all getting ready to leave anyway, but we were enjoying the last glass of wine.  The manager came and told us that the next party was getting angry at them because they had not be seated.  <br><br>Weird and it rubs me the wrong way because we did have a reservation and spent a lot of money.  We were already making plans to leave but had to be rushed out before finishing our last glass of wine.", "pics": null}}, {"review": {"des": "Holy Heavens this dinner was amazing!!! - make reservations to go here now! And remember to BYOB.<br>One of the best dining experiences I've had. Every single plate was both interesting and artful; not to mention delectable. Made a reservation for 4 here on Saturday night of Thanksgiving wknd, picked based on yelp research. Let me preface , again, with everything we tried (and I slammed my fork onto everyone's plate, cause what's family for...) was Magnifique!!! <br>We shared 3 starters: Daily Bread (rotating ingredients), Almond Stuffed Dates and the Dumplings. The bread and dumplings were outstanding. Entrée orders in magnitude of extreme deliciousness: Parpadelle, Trout, Spaghetti Squash and Chkn Thigh Sandwich. Skipped dessert since we were on a mission to get bombobar which in Hindsight, we should've continued our indulgence at HB. The food at HB was so drool-worthy that I felt like plates were just floating my way onto the table. Was so frazzled with flavors and sharing key words to describe all the \"happy-belly\" emotions with the family. Nonetheless, I must mention service by David and the table staff was great! And it is a cute- cozy spot to remember forever. Will definitely be back and recommend to ALL. Cheers!", "pics": null}}, {"review": {"des": "Pretty mediocre and highly overpriced food. I'd save your money and go across the street to the Chicago diner.", "pics": null}}, {"review": {"des": "Its hard to even make up something bad about Home Bistro.  I think just about everything about it is great from the delicious, handmade dishes to the BYOB policy.  This place is quite small, but they were easily able to accommodate a group of 6 of us on a Saturday evening.  <br><br>The menu is not big, so between 6 people and 2 apps, we were able to see a really big sample of everything HB has to offer.  Every. Single. Dish. looked amazing.  The general consensus at my table was that everyone was jealous they didn't order the mussels entree.  It is a massive bowl of mussels that comes with an equally massive bowl of fries and handmade aioli sauce.  In reality, no one was disappointed with their dish, and everyone agreed they would be back to try something different.<br><br>For appetizers we got the escargot and patatas bravas.  The escargot, while delicious, turned out to not be a great option for sharing, and the patatas bravas turned out to be both delicious and great for a group of 6. <br><br>I will say the food takes some time.  I didn't really mind because the quality is worth the wait, and there is probably a very small kitchen/staff.  I cant recommend this place enough, and its even easy to make reservations right on their website.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/nkMEkCuNklsKboz5viUXig/348s.jpg", "caption": "Mussels and beef cheek. Credit: Shannoninthecity.com"}]}}, {"review": {"des": "My friend told me about Home Bistro two years ago, he said it was one his favorite places. Maybe things have changed- it was whatever, I don't plan to go back. Sure, BYOB, which is nice, but with so many choices in Chicago why go somewhere just ok? Kind of pricy too, for a restaurant with paper over each table cloth, that jams parties of 2 against a wall at a super small table. <br><br>APPETIZERS: dandelion salad (basic, lacking flavor, basically a bowl of green with a few slices of apple,) artichoke and Edam fritters (the garlic aioli was good but not great,) the assorted bread (why it's called \"assorted\" I don't know - it's ONE piece of toast, cut up into 4 pieces with some spread and slice apple).<br><br>ENTREES: paneer (not bad, but not amazing, I do eat Indian food a lot so maybe it was a mistake to order an Indian dish at a non-Indian restaurant. Furthermore, there were 3 pieces of panner cheese...3. Then about 7 pieces of squash cut in the shape of paneer. I was hungry when I left); boyfriend ordered the special which was a burger (pretty good, but the truffle fries lacked seasoning and were cold when we got them.)<br><br>STAFF: our server was nice, but the hostess was aloof, kind of cold. As the restaurant filled up and the staff was stretched and we waited and waited and waited for our check.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/VXdshX03Dydj2kA77b6JDA/348s.jpg", "caption": "Dandelion salad. Not very good :/ sorry guys but it's a bowl of green with a few pieces of apple."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/hJOUu_VARJ7EqnQazKpQ8Q/168s.jpg", "caption": "Artichoke and Edam fritters"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/epf_-GzK_E7X9WP1dvSVGQ/168s.jpg", "caption": "Daily bread special. Aka one piece of toast."}]}}, {"review": {"des": "I got the trout which is the special.  I thought the trout was good.  Good place for date or group of 4 people. It a hidden gem in boys town and it's byob:)", "pics": null}}, {"review": {"des": "This place was TREMENDOUS! Some of us live here, some of us live in Los Angeles(who own a restaurant in LA). <br>Start from the beginning, the service is FANTASTIC! I would swear but it's not appropriate but FN is how I feel. We have a few limitations regarding ingredients however they were incredibly accommodating even when it's difficult to do so. <br>The FOOD, we all choose 5 appetizers and 5 entree's and EVERY SINGLE ONE WAS AMAZING! We are a family who shares everything because we love food so much and every SINGLE dish was fantastic! Thank you Home Bistro for making my visit to Chicago fabulous! Please go here!", "pics": null}}, {"review": {"des": "Impressive!  Tremendous menu and food was outstanding!  <br><br>Very casual atmosphere with BYOB wine. We had the duck breast, mussels along with several appetizers and everything was spectacular.  Not one dish was even just mildly enjoyable.  They all were great!<br><br>The prices were also very reasonable for the quality of the food. Don't miss this place as I am sure next time in this area, I will be sure to enjoy again.", "pics": null}}, {"review": {"des": "We were a party of five.  Seating was ridiculously tight and awkward to the kitchen and blocking flow in restaurant.  The menu seemed to have interesting selections, however the kitchen delivered very average plates all around.  The pork entree which was recommended by our waitress, was over cooked and dry....... my salmon was fresh but sitting on a huge portion of tasteless black beans that looked incredibly unappetizing.  Other entrees followed the same pattern of no taste, not properly prepared and extremely unattractive presentations.  Appetizers were avarage, small portions and also very disappointing in preparation and presentation. Everyone at our table was very disappointed...........<br><br>I would not recommend this restaurant.", "pics": null}}, {"review": {"des": "Great spot, prices are reasonable and the food is great. The chef really knows how to balance flavors, everyone loved it. It's BYOB so bring a bottle of wine if you wish. The sauce for the fried mozzarella was to die for. You won't regret dropping in here if you are in the area.", "pics": null}}, {"review": {"des": "Always a good atmosphere, great service and excellent food!  If you are looking for a neighborhood gem this is your spot!  BYOB just makes it that much better!", "pics": null}}, {"review": {"des": "My boyfriend and I came here to celebrate a promotion, and it didn't disappoint. The place is pretty small, so we had to call ahead and make reservations for sure. We went on a Friday night, and it was packed. For a quality restaurant like this, it is SO NICE that it is BYOB. Normally, you spend a ton of money on food, then buy super pricey drinks and wine. Not here. <br><br>I would say the staff as a whole wasn't very friendly, but they were fine overall. The menu isn't huge either, but you can kind of expect that when the menu changes as much as this one does. All of the menu items were different and made to perfection. We would go again once the menu changes to try more of their original recipes.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/dc34jKuB4tr27gcTFwBADQ/348s.jpg", "caption": "Patatas bravas-- not the best I've had, but still really good."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Qby_E0JJv-kc4wmTJaD_sA/168s.jpg", "caption": "Salad of chickpeas, kale, radishes, etc. really good!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/znRHR5iSUZrGSwgvHAeC3g/168s.jpg", "caption": "Sweet potato and olives over bread. Not that great unfortunately"}]}}, {"review": {"des": "My boyfriend and I came here for dinner on a Friday night, we made the reservation that afternoon and they were able to squeeze us in at 6:30. By 7pm, the place was crowded.  We took advantage of the BYOB (with no corking fee!) and our waitress immediately offered to open our bottle, then proceeded to recommend a few dishes on the menu.  The had a \"specials\" menu where we ordered a fried soft shell crab for our appetizer, as well as the homemade pappardelle pasta for my main course (with chicken pesto). My boyfriend ordered the pork cheek of the normal menu and said it was one of the best dishes he'd ever had. All in all, we had a great time at Home Bistro and will definitely be back!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/5gHTUc2x-KmgaDgyE1RLMQ/348s.jpg", "caption": "Barbecued pork cheek"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/_OfRkV9lDccRLoWTFu_FLQ/168s.jpg", "caption": "Fried soft shell crab with a watermelon, mint and feta salad"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/yoWl4tWyAeTCLTtgETGcvQ/168s.jpg", "caption": "Homemade pappardelle with chicken pesto sauce, cheddar queso, and sweet relish on top"}]}}, {"review": {"des": "My husband and I loved this small gem in Boystown! Our server David was wonderful. For starters, the fried mozzarella and dumplings were delicious. Both the entrees were really amazing: I had the rainbow trout and my husband had duck breast. Both were unique and savory. My husband loved the ricotta salted caramel donut holes for dessert, I was so-so. Lastly, BYOB! We forgot so my husband just ran over the 7/11 across the street - perfect!", "pics": null}}, {"review": {"des": "After such great reviews, I think my expectations were really high. I was shocked to see how small the place and somehow i felt like the place has a quaint seafood smell. Everything we got was sweet 9 predominant flavor was sweet - which we really disliked ) . Except the fish..all the dishes were pretty routine and normal. I still don't understand the hype around this place. Food seriously lacked flavor. I don't think i will be going back to this place. Huge letdown !", "pics": null}}, {"review": {"des": "A small group of us had dinner here.  My first impression was very positive - quaint little restaurant with a very friendly greeter/server.  We had a terrific table at the front window, so we had a nice view into the neighborhood.<br><br>The food was very enjoyable.  As a group, we decided to go with the prix fixe menu - sharing appetizers, salads, and desserts.  This was a great way to experiment.  And, my main course (butternut squash risotto) was very nice.<br><br>My only (minor) complaint - the service was a bit slow.  The restaurant got busy, and we were talking a lot, so I suspect that contributed.<br><br>Overall, I enjoyed my experience.  Recommended!", "pics": null}}, {"review": {"des": "My boyfriend & I did not have the 5 star experience that so many others seem to have had at Home. Our food was truly awful. Bacon wrapped dates appetizer were served with a random pile of charred brown sugar that wasn't remotely caramelized, or even edible. His mussels were flavorless and tough. My spaghetti was basic. All of it left us taking turns in the bathroom throughout the night after. It's like we went to a completely different, grosser restaurant than everyone else.", "pics": null}}, {"review": {"des": "Solid four star. Cozy (perfect for 2-4 people, might be less enjoyable for a bigger group because of small space and general background noise level that would make it difficult to have a conversation across a table with a large group of people), casual vibe with well-prepared food. Added bonus is the lack of corkage fee for BYOB and our friendly server - she wasn't pushy at all and I was in no rush catching up with friends I hadn't seen for a while but one could have been annoyed from slow service if they wanted to quickly eat and leave. <br><br>I was starving when I came on Friday evening at 7pm but it turned out my eyes were bigger than my stomach - very generous portions.<br><br>We tried:<br>Appetizers <br>-fried artichoke: excellent. deep-fried to golden crispy and I don't even like fried food in general<br>-Smoked butternut squash: I love anything winter squash so I seriously turn yellow in the Fall and Winter from all the buttercup squash I consume, but this dish was a meh. Forgettable.<br>-Baby beets: favorite appetizer! Perfectly cooked golden and red beets with goat cheese <br><br>Main dishes:<br>-Amsterdam style mussels: I can eat endless amount of oysters and mussels until my stomach hurts. This was the very first time I left more than 1/3 of mussels ever in my life. Maybe I was already full from appetizers but the flavor just wasn't there and mussels weren't plump at all. Fries with garlic aioli were very good though.<br>-gnocchi with lamb meatball and mustard seeds: excellent dish, hearty but not too heavy.<br>-my friend ordered pork belly (special of the day) and he seemed to like it.<br><br>I was stuffed up to the ears after the meal!! I'm still curious about escargot, pork cheek and trout but there's always a next time!", "pics": null}}, {"review": {"des": "The two of us scurried into HB on a cold-ass FRI night w/no res, and they had a table open (to our surprise).  We shared the endive salad, which i highly recommend, and i ordered the mussels & frites.  Normally, i associate bread instead of frites w/mussels, but they fried them a little crispy at my request.  Generous portion, and the broth had some interest to it. <br><br>My other half got the meatballs & pierogi, which was good.  <br><br>Great bread pudding!", "pics": null}}, {"review": {"des": "Not great.  Arrived at 9:30 pm and they said they could accommodate my dinner.  But they were already closing up and it was like eating in a work sight.  Chicken sandwich was clearly made early that day. It was not fresh.  Old chicken.  Hard bun. Squished everything else inside.  Had to ask for sauce.  And felt rushed and didn't want to bother the server.  Plus they don't serve alcohol.<br><br>Ps. I realized why the owner chef was hurrying me out of the joint.  Because he was drinking in the gay bar across the street by 10.  Apparently 10 is when they close.  But nope.  That's when the owner is drinking at the gay bar. So don't bother showing up late", "pics": null}}, {"review": {"des": "Came to Home Bistro for Easter Brunch with some of my favorite Yelpers and two other friends. Seeing how this was my first day of drinking since Ash Wednesday I don't recall two much from this brunch after the 2nd of 5 bottles of champagne. <br><br>What I do remember is:<br>1) the excellent service we received from the moment we arrived<br>2) how they kept our bottles of champagne on ice as we plowed through them<br>3) how delicious the food was (I had the HB breakfast sandwich and it was damn good)<br>4) how affordable the dining experience was (my credit card statement showed I spent less than $23 dollars)<br><br>I will definitely be coming back to Home Bistro with my bottles of booze to enjoy great food, service and friends!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/7Xa4NSGqrDSPIscVkCKKWg/348s.jpg", "caption": "Bread Pudding French Toast"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/wuHqEQ9zDm8cSHBa5kEN3A/168s.jpg", "caption": "Hash - can't recall which one :-("}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/KtHh4yuMCDztKnrV7oMe5A/168s.jpg", "caption": "Han Breakfast Sandwich"}]}}, {"review": {"des": "Yelping for the best BYOB place in the city, I found home bistro had very nice reviews and stars. I wanna to have a very small/intimate dinner party for my wedding and searching and reading I decided this was the place I wanna to do it.  I passed by this restaurant but never had the chance to go inside. When I walked in for my surprise my friends got there before me and decorated the spot the owner or manager reserved for us. <br><br>The attention since we got there was amazing, the area we got couldn't be more perfect for the occasion and Intimate the way I wanted. My friend brought a lot of booze to celebrate my wedding, definitely was A+ you could bring your own champagne and wine to celebrate since as you know this couldn't be very expensive in other places. <br><br>We ordered the food and everything was so delicious and well done. Since we were a party of 10 we had to choose one of their group deal, which it was good amount of food and came pretty fast. I which I couldn't remember what we ordered to recommend here but unfortunately I can't. Only I do remember was a beef hash or something that I couldn't stop saying how AMAZING was that plate.  <br><br>I agree with all the people with positive reviews about this restaurant, it's a great spot in boystown.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/IU7c-dZAkOIScdRSSBOyDQ/348s.jpg", "caption": "Few of our friends at home bistro"}]}}, {"review": {"des": "Delicious seasonal meal in a cozy atmosphere. Was thrilled to see that Cleveland Clam Bake offered as this was an Ohio main stay of mine growing up! The Pork Cheek was more tasty than we've had at the Purple Pig. Would come back again for that alone  The Escargot was amazing with the roasted garlic & tomatoes. Only slight disappointment was the stuffed bacon wrapped dates. They were yummy but cold. Appeared to be made ahead and not sufficiently warmed. We'll be back though. The BYOB makes it an excellent value!", "pics": null}}, {"review": {"des": "We stumbled onto this restaurant and what a surprise! The dessert (chocolate cracker thing) was fantastic!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/WJu6RwUPGf0Jc73GuhCgWw/348s.jpg", "caption": "This was great!"}]}}, {"review": {"des": "We went for a quick bite after shopping in the area for a small amount of time, it's awesome that it's byob! Me and my boyfriend each ordered a different entree, he ordered the bulgogi and also the gnocchi, we also started with the daily bread..The food was delicious, but the gnocchi was just overly salty from the use of the blue cheese, and also on top of that the actual salt...The service was nothing memorable but our glasses at least were kept full of water...for the price point I was expecting a bit more of a portion size as both of our portions were rather small and we both left feeling hungry still...The flavors were there so that's why I give it a four stars...I wouldn't come back but I wouldn't also stop any of my friends from coming as well.", "pics": null}}, {"review": {"des": "Very hom-ey. Very friendly staff who were able to get me something tasty and vegetarian. This place is BYOB which is awesome. It is definitely pricey though.", "pics": null}}, {"review": {"des": "Home Bistro was, as the three stars indicate, A-OK.  The ambiance was intimate and nice, and the service was kind.  The fact that it's BYOB is a huge plus, too.  In terms of the food, I was underwhelmed with my $24 Handcut Fettucinni; it was fine but nothing amazing, especially for the price.  My friends enjoyed their Amsterdam Style Mussels (huge portion!) and Pan-Fried Skirt Steak.  Overall, I wouldn't rush back here, but I would maybe recommend it for someone who is in the neighborhood and looking for a nice casual place for a date or to catch up with a friend.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/6SPSUnqpfkqDtwsXN8T10A/348s.jpg", "caption": "Handcut Fettucinni"}]}}, {"review": {"des": "GREAT date night spot.<br><br>Booked an 8:30 reservation on a Friday and was seated immediately at the last available table- this place knows how to run a tight ship! (When seated they let us know we should order apps/entrees together in order to keep everything expedited). Service was great- I loved our waitress who provided honest feedback about all dishes I asked questions about, and ambiance was super cute (BYOB also, how can you go wrong?)!<br><br>Food Breakdown:<br>Artichoke & Edam Fritters - Fav dish of the night. These were bursting with flavor. Would order them again in a heartbeat.<br><br>Asparagus w/ Fried Egg - This was on the specials. It was good, but the artichoke was definitely better. <br><br>Buttermilk Fried Smoked Chicken Sandwich - Came w/ fries which were fine- nothing to write home about, but the sandwich was fantastic (and had come as a recommendation from the table next to us!)<br><br>Sockeye Salmon- I don't know what was on this salmon but it was perfect. The marinade was delicious, it was cooked perfectly! It came with a quinoa side dish which I didn't love. The flavors were a bit sharp and tangy, but the ingredients were very fresh. (The salmon was so good I`d still order it again despite not loving the side)<br><br>Located smackdab in the middle of boystown, not too many bars nearby to go to after if you're on a date- but still definitely worth it!", "pics": null}}, {"review": {"des": "Stop what you're doing and make a reservation at this incredible restaurant for your next group dinner. I celebrated my upcoming wedding with a group of 13 girlfriends here and it was such a phenomenal experience. Incredible, generous portions of food served family style - great service, and an intimate table to the side of the restaurant that made it feel like our own little space. We had vegetables, duck, pasta, chocolate, meatballs - the list goes on - and each and every single dish was absolute perfection. We all felt like queens! GO HERE!", "pics": null}}, {"review": {"des": "Cute little restaurant situated in Boystown that serves up rich, delicious food. I had the ricotta gnocchi with duck meatballs--- some of the best gnocchi I've ever had, with a great bechemel sauce. The crispy oysters with polenta was good, but the oysters were more fried batter than oyster--- but what else can I expect for seafood in the midwest.<br><br>Service was decent. Overall a good spot to check out.", "pics": null}}, {"review": {"des": "Yowsa, this was one of the most delicious and flavorful dinners we have had in a while.  The flavors in every course were all so complimentary and distinctive.  To boot, we enjoyed the $33 pp prix fixe dining option on this Wednesday evening.  What was particularly nice for this prix fixe was that you pick whatever 3 courses you want from the regular menu, and it looked to be roughly a $12 pp discount.  It's also BYOB, and I brought in some FFF Gumballhead, but almost every other table had either wine or champagne it appeared (good for them, but beer was perfect for us).   So, I ordered up:<br><br>- Housemade corn dogs (not from the ballpark, but rather made of beef short rib)<br>- Braised beef cheek fettuccine<br>- Cranberry bread pudding<br><br>Wife ordered:<br><br>- Smoked eggplant appetizer<br>- Belgian endive salad<br>- Rainbow trout, which came with a fried egg (this was best course of all the very good ones we had).<br><br>The menu photo has a much better description of the courses.  The only minor knock was the fettuccine was slightly undercooked.  Otherwise, awesome meal and a charming venue.  This place is tiny (we counted 14 tables) and can get noisy when filled, but it would also be a great date night sort of place.  At regular prices, I would say it would be on the spendy side.  Server was Amy, and she was very friendly, attentive, and always had a nice smile.  She and the help were also very efficient.  The place has been around for 10 years, and it's high average 4.5 star Yelp rating for 700 reviews is well deserved.  FYI - I don't think there's any free parking in the area - it's standard metered $2/hour with the rest of the area looking to be permit parking.  Overall, great place to try at least once and highly recommended.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/piO-sXFhIxLGHIIultnWhA/348s.jpg", "caption": "Braised beef cheek fettuccine (their Cincinnati style chili interpretation)"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/g7qxR3DWmuzRNVT8Whc3fw/168s.jpg", "caption": "Rainbow trout, with fried egg (delectable!)."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/XD8muLfsQpsWrfMyozlYBw/168s.jpg", "caption": "Belgian endive salad"}]}}, {"review": {"des": "What a great place!  We had the fresh home made Mozzarella and the bacon/date/almonds as appetizers.  Both were very tasty.  Our entrees were the scallops / exquisitely prepared, mussels with frites / authentic Dutch (used to live there), clam linguine (home made)/ and a large burger / fry.  Topped it off with some dark chocolate cherry bark.  It's BYOB, which we are totally cool with.  It was nicely quiet.  The inside has that simple / rustic / chic feel.   Sit near the window if you like to people watch.  We don't live in Chicago, but if we did we'd dine there more than once - you get the feeling the chef will often have something new that you'd like to try.", "pics": null}}, {"review": {"des": "I had a nice dinner here last night!  Dave was our waiter, who was friendly and attentive.  I started with sharing the sweetbread appetizer with arugula and a nice aioli.  I also shared the escargot with cherry tomatoes, butter, shallots, garlic and seasonings with white wine reduction, yummy!  I had the trout with fingerling potatoes and I don't even remember what else, just that it was very good!  I got side tracked, as I was excited about being able to BYOB of wine.  <br><br>Make reservations, as it's a very small venue and seats fill up fast.  We went around 8:45 pm calling only a half hour ahead on a Friday night.  They did seat us fairly quickly. We weren't rushed and were able to enjoy our conversation without being pressured.  <br><br>I enjoyed our evening and will be back!", "pics": null}}, {"review": {"des": "Live in the neighborhood and had heard this place was great, so I went with 2 friends to finally check it out. The restaurant is very small and very dark and last but not least SOOOOOOOO LOUD! We could honestly not hear each other at times. It was a Friday night, so it was kinda full...but we couldn't believe how loud. The wait staff was wonderful, very friendly and helpful. They were the best part. Ordered our food and it was good, but it just wasn't amazing or anything special. Maybe we ordered the wrong items? Maybe it's not really that loud all the time? Maybe they forgot to pay the electricity bill? I'm glad I finally checked it out, but not sure I would go again.", "pics": null}}, {"review": {"des": "Today I had Easter brunch there. I can honestly say EVERY meal our table ordered was top notch ..6-stars not 5. Loved the B.O.Y.B. as our table shared two bottles of wine. I would love to eat brunch there again. Parking was still good even with a Cubs game going on.  Service was excellent. Yes some of the time it got a little loud in there with the other tables but our group was having fun and blocked it out. I am posting pictures as the presentation  was beautiful.", "pics": null}}, {"review": {"des": "Service and apps are amazing! Entrees not so much.... we loved the peppers, potatoes, and fritters. But our dinner plates were..... eh negative. The staff did take off my dinner that wasn't great. I'd try it again :)", "pics": null}}, {"review": {"des": "My girlfriend and I went to Home Bistro for my birthday dinner.  We had looked at the yelp reviews and decided the menu pictures looks good.  Upon arriving, wine and beer at hand, we sat down to a menu completely different from any that we had seen online.  In fact, nothing caught my eye.  The more I looked, the less assured I was.  I ordered a chicken chorizo pappardelle and my girlfriend ordered a lamb breast. We also got artichoke and edam fritters to start.  After no wait at all, the fritters came out and they were the most delicious appetizer that I have ever had.  We devoured them as politely as we could manage.  Once our main courses arrived, we both were absolutely astonished.  It was the greatest meal that I have had all year.  My girlfriend's lamb was melt-in-your-mouth tender and the pasta was perfectly accompanied by the chorizo.  Simple, yet elegant.  When the dessert menu came around, we picked something without even knowing what it was because of our new found confidence in the restaurant.  It was a pana coda (if that's the spelling) with plum and nectarine.  It was a perfect cap to an amazing meal.  That dinner sealed a perfect night, and I will be returning when I come back to Chicago again.  Bravo.", "pics": null}}, {"review": {"des": "Zagat writes: \"delicious\" and \"you can't go wrong.\"  The person who wrote that didn't order the steak frite.  Just left the place having been served the worst steak I've ever been served.<br>You'd have to like chewing gum to like this piece of garbage.  The potatoes and asparagus<br>were excellent. When i complained to the waiter he said to me and my companion, \"Get out of here!\"", "pics": null}}, {"review": {"des": "A friend of mine told me that if I only visit one restaurant in the ambiguously named Boystown/Northalsted/Lakeview vicinity, it needed to be HB (Home Bistro).  So off I went, on a cold and rainy Wednesday evening.<br><br>It might've been dismal outside, but the interior of HB is warm, cozy, and very inviting.  Lots of earthtones and oranges, mirrors, and candles whisk you off to a romantic villa somewhere on the Mediterranean coast.  Once I was seated, HB felt like a perfect refuge.<br><br>I lucked out by showing up on a Wednesday, since that's their prix fixe night -- $33 for 3 courses.  That's a killer deal for high-end cuisine in a high-rent district.<br><br>I started dinner with some hot tea -- perfect for keeping those Midwestern chills at bay.  (HB is a BYOB, so no booze on the menu -- sorry alchies!)<br><br>Course #1 was baby beet salad with honey ricotta, hazelnut streusel, and arugula.  I normally love beet-anything, but I didn't enjoy this salad at all.  The beets were totally undercooked (mostly raw in the middle), and all that raw earthiness clashed badly with the overly-sweet honey ricotta and streusel.<br><br>Course #2 was much better: pan-roasted Atlantic salmon with couscous, cucumber ralta, and strawberries.  The salmon was cooked perfectly, and the cool raita and sweet strawberries contrasted well with the fish.<br><br>The real highlight was Course #3 (dessert) -- bread pudding.  I get the impression that this is the specialty of the house, and for good reason.  It's moist and light and crazy flavorful, without overdoing it on the sweetness.  It's probably the best bread pudding I've ever had.<br><br>Service was very gracious and friendly.  Even though I was dining solo that night, the hostess and server made me feel like part of the family.<br><br>All in all, even though the food was inconsistent, there's still lots to like about HB.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/wuKNWRN7SeQ6RAPcLVhfog/348s.jpg", "caption": "bread pudding"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/aEArVGBwUNufLphVPDkGsQ/168s.jpg", "caption": "pan roasted Atlantic salmon"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ijvA7XZly5XYyhXd46n0MA/168s.jpg", "caption": "baby beet"}]}}, {"review": {"des": "Great food, very tasty. I had a vegan option on the menu which was delicious. The restaurant is busy and the atmosphere is great. Very good service also.", "pics": null}}, {"review": {"des": "BYOB'd on Easter Sunday. Does that make me a sinner?<br><br>I came with a fun brunch group that entailed one friend who had given up alcohol for lent. Easter Sunday he proclaimed, \"Jesus rose and so will my liver!\"  HB was the spot for this.<br><br>The space isn't very large but it's airy and quaint. The bathroom is labeled as a study or something like that, and it feels like it's antique. There's only one toilet, so don't break the seal until you really need to. The server was slightly overwhelmed and kept bringing out individual food items instead of everything all at once and forgot side item requests. Jesus forgives, so can I. <br><br>We popped champagne, bailey's with coffee, I think some vodka too. The drinks made the so/so service much easier to handle as the waitress went a little MIA when it was time to pay the bills. <br><br>As for food, the french pudding French toast is where it's at. Veggie pancake was unique and I didn't feel like I was going to get bloated from eating this, but not sure I'd get it again. Felt like it needed different seasonings. Hubby loved his breakfast burger and everyone was pretty content with their meals. <br><br>All in all, I would hit up HB for brunch or anything else again as BYOBing makes anything mediocre, holy.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/D_NsJHYhJpsjFq6QImuJ4A/348s.jpg", "caption": "Bread pudding French toast. OMG! Best thing here"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/QXN7J75-Ohl8EOHtM2R8Hw/168s.jpg", "caption": "Breakfast Sammy"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/oXljRYNxwgihRbKdU6119Q/168s.jpg", "caption": "Veggie pancake. Pretty good"}]}}, {"review": {"des": "Step into Home Bistro (HB) and you'll be met by a friendly hostess and warm dining area. It's not big at all and expect to be pretty cozy to your dining party and those around you, as well. I love BYOB places and HB is one of them. Bonus points because they let us crack our bottles while waiting, even bringing out glasses. Once seated at our table, they provided buckets of ice to put our bottles in - a much appreciated gesture.<br><br>Service is spotty. We would go long periods of time without seeing our server and it always seemed to be when we needed something. Food also took quite a long time to come out. It was a Friday night and very busy so I understand but just a heads up not to expect a quick dining experience here.<br><br>When the food came out, all thoughts of an upcoming mediocre experience dissipated as my hunger pains were satiated by deliciousness. I had the Berkshire Pork Belly for $23. The pork belly sat atop a bed of german potato salad, house bacon, rhubarb butter, and marinated lacinato kale. The elements of the dish married well together and all melted in my mouth. It was a truly delicious dinner that I'd highly recommend.<br><br>Food is amazing at HB and I would love to go back to try more. It's a cute restaurant but gets very crowded and noise levels are through the roof with hit or miss service. All in all, a great place for dinner with friends having conversations & catch-ups with your BYOBs but may not be right for a date night.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/xlKZDwRbuNhCQv25i6T1iw/168s.jpg", "caption": "Berkshire Pork Belly $23"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/DzUqm1ecXorjnSfpJvlQ6g/168s.jpg", "caption": "Housemade Chicken Sausage $22"}]}}, {"review": {"des": "This is such a quaint little restaurant tucked away in Boystown. It's BYOB so make sure to bring a couple bottles to enjoy with your meal!<br><br>I decided to come here for my boo's birthday dinner. Based on the reviews and the fact that it was BYOB, I thought it would totally be worth a try. Even though it was a Tuesday night and there weren't many people in the restaurant (4 tables including our party), it took a while for the food to come out. Other than that, the service was very attentive and I can tell that they take pride in the dishes they come out with.<br><br>We ordered two of the specials that day, which was a pork tacos (definitely had a kick to it, so if you can't take spicy, beware!) and the pork loins with creamed corn. We also ordered the mussels, which were on the main menu. We both loved the pork tacos the best, mostly b/c of the spicy kick that it had along with the complementary flavors of the kimchi and Thai mango salsa. The mussels were pretty decent, not like the most amazing mussels I've had. By the time the pork loin dish came out, we were getting pretty full, so we actually only had a few bites of it and took the rest home.<br><br>Since it was my boo's bday, of course we got some dessert. They brought it out with a little lighted candle so that he could make a wish. What'd you wish for, honey? Your wish already came true when you met me! (Barf)", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/TAWIQZgMhV6UhG2hz1I-XA/348s.jpg", "caption": "Pork lion and creamed corn"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/bCGwDt88APVKoPfbaB_8gA/168s.jpg", "caption": "Mussels"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/07Rjg3guDNLpCBvNP4NuZw/168s.jpg", "caption": "Spicy pork tacos"}]}}, {"review": {"des": "W-o-w. We had the pleasure of going to HB for our two-year anniversary brunch. As fate would had it, we had the place totally to ourselves (45 minutes before closing time). My girlfriend was excited about the great natural light near the window, which was perfect for photographing the food. (Priorities, right?) <br><br>I ordered the Chinese fried chicken hash, which was surprisingly filling and generously portioned with a big, deep bowl. I also sampled the veggie burger, which was house-made. I'm a big meat-eater, but it was honestly very tasty and definitely something even I would enjoy eating. The fries were great, as well. <br><br>They brought out several freshly-made caramel-glazed doughnuts with cinnamon sugar out--complimentary--to help us celebrate our anniversary. The doughnuts were fluffy, very fresh, piping hot, and the perfect complement to our meal. I was still salivating over other menu items because they all sounded great. We will 100% be back here and I HIGHLY recommend checking this place out!", "pics": null}}, {"review": {"des": "So years after I should have tried HB, I finally get around to it now that I've moved back.  This place lived up to the hype in a city full of overhyped restaurants and bars.   <br><br>Small little place and definitely a little loud, but that's all worth the amazing food.  We started with the handmade pretzels and the beer cheese.  Omg, the pretzels were so warm and soft, and the beer cheese was absolutely perfect.  The consistency was so soft and creamy it was almost like a mustard.<br><br>We each had the specials tonight.  I had the gnocchi with pork belly, and a sort of relish sauce of garlic and other delightful ingredients that I can't recall because I was equally enjoying the fact that HB is BYOB. (no corkage fee).  My gf had the pork loin on a bed of polenta and spinach.  Also amazing.  Finally despite being stuffed we could not pass on the bread pudding.  It was good, although not the best I've ever had.  But between the starters, entrees, and great service this place is 5 stars easy.  Oh and the portion sizes were made for humans and not mice.  Definitely a plus.  Cozy, romantic, really a perfect date night.  Worth every penny.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/duJRcNOF7VmYzBoYb5zSaA/348s.jpg", "caption": "Handmade soft pretzel and beer cheese"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/5v9Q6UxYYxLSgfeqkFjZCg/168s.jpg", "caption": "Pork loin w polenta,  kale etc"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/yi7Dt2lGLswgQWo4xyGXLQ/168s.jpg", "caption": "Gnocchi w pork belly"}]}}, {"review": {"des": "Great dinner every time we visit. The food is always consistent and the staff are so pleasant ! One of our favorite restaurants !! 5 stars", "pics": null}}, {"review": {"des": "Intimate, cozy restaurant.<br><br>Braised Duroc pork shank ($23) - 4.5 stars. Sweet potato puree, cider-braised kale, house bacon, pear butter. The meat was so tender, no knife required.  Delicious purees & mashes. The kale's sweet acidity went well with the meat.<br><br>Lamb burger w/truffle fries ($20) - 4 stars. Lots of flavors in this burger. Good, but I'd rather order something else next time.<br><br>The restaurant space was a bit small with the tables close together, but overall, I enjoyed the atmosphere & food. It was packed the night we went, but the noise level was fine for conversations. Would go here again :)", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/LUTMhLEa623cOyzb_9C4yA/168s.jpg", "caption": "Lamb burger with truffle fries ($20)"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/q8B2bkW2qQF_oo7wSRQgNQ/168s.jpg", "caption": "Braised Duroc pork shank with sweet potato puree, cider-braised kale, house bacon, pear butter ($23)"}]}}, {"review": {"des": "Such a disappointment after all the great reviews. Went with a friend for an early dinner Sunday after a matinee theater performance. We were the first diners in the restaurant ~5:15pm. We ordered a panzanella/heirloom tomato appetizer and was told there was only one left. I'm going to guess it was the last leftover from Saturday. It was a pile of mush on top of three very thin slices of tomato. Not appealing to look at or eat. For our second appetizer we ordered from the daily specials menu - escargot with heirlooms. It was a scoop plopped into a bowl. No presentation and not much flavor. My friend ordered the whitefish for her entree. She said it was tasty but again, bad presentation - very bland and colorless on a white plate. Blah. I ordered another \"starter\" for my main course - a \"salad\" of arugula, grilled corn and crumbled cheese. There was very little arugula so again, it had no appealing presentation being mostly white and yellow on a white plate. Not a lot of flavor either. Even salt while preparing would have helped! To say the B team was running the kitchen would be an overstatement. We brought a nice bottle of Rose and for three apps and a single entree paid $70. The hostess/server was cute and clueless. She knew we were sharing appetizers and brought no serving utensils and two tiny little B&B plates for us to use. She brought coffee with cream and sugar but we had to ask for a spoon. The sugar  packet holder was half filled. (No one did any side work prep for Sunday dinner?) One of our forks had rice kernels stuck in it when we sat down. We asked our server for a clean fork. No apology. She left the dirty one while she went to retrieve a new one. Sweet. Pretty. Clueless. This place has been here a long time but felt like amateur hour. Not good.", "pics": null}}, {"review": {"des": "We came here with a big group and had family style dinner.  Wow.  We had the opportunity to try different dishes. Every one of them were  delicious like a fix menu in a really expensive restaurant. plus is BYOB so we were able to bring our favorite wines.  Must visit.", "pics": null}}, {"review": {"des": "Full disclosure. My cousin works here. He is an amazing chef and awesome person, but this review is not about him (well, kind of is, but stick with me), it's about the food and ambiance. Mm-mm the food. Yay the ambiance. <br><br>I had just moved to Chicago from LA. I took a trip to HB and dined on a multi-course meal of sheer deliciousness. I begged my cousin for every recipe, but he couldn't share secrets obviously, so I have resided to return over and over and over and over again, until I'm dead and buried (or cremated, jury's out). HB is small but in a warm and welcoming sort of way. The exposed brick and lighting make you feel like you're at a friend's house with more of your friends and some of their friends. The staff is amazing and friendly, like they're your friends. This place just makes me think of friends. It's a good friend of mine. Good friend. I really love it because you can have conversations with people and not feel like you have to yell. It's not overly quiet. It's the perfect mix of peace and energy. <br><br>I'm so proud of my talented cousin following his dream. To think of him doing anything else brings tears to my eyes, but in the SELFISH sort of way because... delicious food. Without him, where would I eat? Oh, I could try and try and die trying to find an HB taste-alike, but it'd never truly be HB. Never.<br><br>Can't wait until next time. I'm coming for you cuz (and the food - mostly the food. Sorry, not sorry). I'm expanding my belly first, too, so stock those fridges.", "pics": null}}, {"review": {"des": "Decided to eat here the other night after reading the reviews.  Cute little place where you bring in your own alcohol/beverage to have with your meal, as I assume they don't have a license.  The menu looked promising with the edgy menu.  <br>It was just okay.  It's hard to rate a place when some things are great and others not so my ratings are as follows.   <br>Service - 5 stars<br>Price - 4 Stars<br>Food - 3 Stars.  Some of the more eclectic foods deserve 4 stars, but some of the less complicated choices were just average, especially the pasta and Caesar Salad - they were not good at all! Homemade Fettuccini and pancetta sounded so good, but the pasta was extremely pasty and very very Al dente! Very little flavor even with the pancetta.  How can a chef blow pasta?   Caesar about par to the Olive Garden. Dandelion salad was good.  Flap steak and spaetzle was also good.  With that said 3 stars overall isn't too bad if you are careful about what you order.", "pics": null}}, {"review": {"des": "We made reservations for a Friday evening and we had a group of six people. The atmosphere and staff was very friendly. HB is a BYOB restaurant. We brought some wine and beer. The waitress opened our wine for us. Our grouped order a variety of dinners from the main menu and a couple of specials of the evening. All the food was amazing!! The chicken sausage and wild rice was to die for. The Mint Creek Pork Burger  was one of the best burgers I have tasted and the spring chicken was melt in your mouth. The desserts are just as good. The Bread Pudding was the best I have had in a long time. I would recommend HB to anyone! Must visit when you are in town!", "pics": null}}, {"review": {"des": "I had brunch here with friends on Sunday. I wasn't sure what to think of the limited Mother's Day brunch menu, but I was blown away by the soft shell crab sandwich with pimento cheese. Sounds different, but it was so good!! I look forward to my next visit & what surprise they may have in store for me. (Bonus-it's BYOB)", "pics": null}}, {"review": {"des": "We've been going to HB for almost 10 years.  Last trip was on a chilly Wednesday night (last night).  Restaurant wasn't busy.  We took advantage of the Wednesday $35 prix fixe.  Everything was great.  Patatas Bravas, Claims and Pork, and Toast with smoked trout to start, Goulash, seafood stew and trout for mains.  All really well thought-out and executed.    We live nowhere near this place, but find ourselves coming here a couple times a year nonetheless.  Really pleasant, relaxed vibe, interesting and eclectic music in the background, always solid imaginative food, and wait staff that manage to be good humored, helpful and informative without over-sharing.", "pics": null}}, {"review": {"des": "They sponsored a five course tasting menu for a special event on Monday 8/7/17, and this was the most disappointed I have been in a restaurant in the past 5 years. Reservations are required for this event, so you would think they could manage the crowd, the food, and the service. I've been to HB before and had mediocre meals, but the BYOB keeps me coming back. This bad experience has ensured I will never return to HB. It seems like when things go bad, they go really bad...and there is no attempt to correct the problem or keep customers happy.<br> <br>The service was inattentive, cold, and not at all concerned with our experience. We were sitting there for 15 minutes with no attention from our server, so I flagged him down so that we could place our orders. I get that they are busy for a special event, but you would think they could staff it appropriately and plan in advance. The server had minimal communication with the table for the entire night.<br> <br>The first course was an antipasto with whipped salted cod, olive oil, on a piece of bread. It was basically a salty piece of bruschetta, and the whipped cod is not particularly appetizing. Our server dropped a plate of four pieces at the table, made no mention of what the dish was, and immediately raced off. We had to flag him down, ask for four small plates so that we could share the appetizer. The waiter's response: \"sure, if we have any.\" Is it too much to expect a restaurant to have clean dishes to use as sharing plates? We got another copy of the tasting menu because we realized that not every dish would be announced.<br> <br>Second course was much better. Sausage dish was enjoyed by our friends. I ordered the swordfish crudo, with lemon, pistachio, and Calabrian chili. The flavor profile was nice, and the swordfish was fresh and delicious. This was the bright spot of our night.<br> <br>Third course was awful. I ordered the tripe alla romana, with pancetta, garlic, san marzano tomatoes, and mint. I had never ordered tripe before, so this was partially my own fault for not asking more questions. Tripe is part of the cow's stomach, so buyer beware. My friend is from London, and told me that tripe is usually served tender and can be quite delicious. However HB's tripe was tough, chewy, and tasted as if it was straight out of a fear factor gross-eating competition. It also smelled like it was cow stomach. Ok, so maybe tripe is not my thing.<br> <br>I flagged down the waiter, told him that I didn't enjoy the dish and asked if it could be swapped out for another salad instead. His response: \"we're running out of food, so there's nothing we can do.\" A restaurant running out of food...hmmm. When you run out of a special dish or two, they get removed from the menu. When you run out of food, you close the doors for the night. Any other restaurant would have offered you something else, taken it off the bill, whatever. Some sort of gesture to show that they care about your dining experience. Instead the waiter immediately cleared the tripe dish away without asking me if I was finished with it. If I'm stuck with paying for the dish, I would have at least let my friend pick at the pancetta bits.<br> <br>Fourth course was the entrée, and this was mediocre. I ordered the orecchiette with wild board pancetta, rapini, chili flakes, pecorino. This dish had some much potential, but...my portion came out with 12 noodles, three pieces of broccoli rapini, and 6 pieces of pancetta. The flavor was decent; the portion was miniscule. It was so obviously under-portioned on such a large dinner plate! I didn't even bother complaining at this point, because I know I would get some absurd line about how a restaurant with pre-planned reservations was \"running out of food\". Resistance is futile, and I think our waiter may have been the manager also. On the way out we saw someone served a plate with at least double the amount of orecchiette.<br> <br>For the ending, we were served goats milk cheese with honey and figs. And also some cannoli's. They were decent, but small, and at that point we are just looking to get out of here. I was so hungry that we had to stop for fast food on the way home; this was also a first.<br> <br>Overall, the five course menu was extremely underwhelming. For $50, your money goes much further at other restaurants. You could tell HB was trying to be fancy with their menu, but a lot of the dishes were bland and boring. Perhaps the exotic ingredients were contributing to the cost, but the flavor did nothing to justify the price. Horrible service destroys the experience, regardless of the food. We will not be going back.", "pics": null}}, {"review": {"des": "I love Home Bistro. The food is always delicious, I love that it is BYOB, which makes it much more affordable, and the waitstaff is top notch.", "pics": null}}, {"review": {"des": "If I go into a restaurant happy, and come out even happier, then that place deserves 5-stars.  I had originally made reservations for a Friday night at 6 p.m. online knowing fully well that there was no way I was going to make it in time with Friday traffic, but it was the only available slot.  So, I called HB, and David picked up to inform me that they were completely booked.  I told him about my situation, and he told me that he would call me back if someone cancelled.  I thought for sure I was not getting a table, but around 30 minutes later, someone miraculously cancelled, and David actually called me back to give us a 7 p.m. table.  So my friend and I made it there with amble time and a great parking spot.  The food was good and huge portions as usual.  David even came by to say hi to us.  Such a sweetheart.<br><br>1 star for good food<br>1 star for great service<br>1 star for reasonable prices<br>1 star for byob<br>1 star for making my friend and I happy campers!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/lpef1MCzndm96KE2_d-WbQ/348s.jpg", "caption": "Caramel Pannacotta"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/9GH3tiqJUUcPHqLML3FYbg/168s.jpg", "caption": "Mussels"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/UyGL5OHpPGSTIcvXgB9FjQ/168s.jpg", "caption": "Truffle fries"}]}}, {"review": {"des": "Wow, I can't say enough good things about this place. I went for the first time last night and I'm still thinking about every single thing I ate. I'm a very picky eater, so I usually stick with things that are familiar...but I am so glad I came here. The food was amazing. Each dish was perfectly put together, taste and presentation. The dumplings! The dates! The mozzarella! THE DESSERTS! Even the service was good, a little slow because it's small and they don't have a ton of staff, so it definitely gets busy, but the staff was friendly and helpful. Also, BYOB...DOES IT GET ANY BETTER? What a gem.", "pics": null}}, {"review": {"des": "Got the artichoke fritters, almond stuffed dates and the duck for the entree. Everything was delicious!!!! Unsure about all the extra brown sugar with the dates? Duck was cooked perfectly and great flavor. Good service, good date spot, and BYOB is a plus", "pics": null}}, {"review": {"des": "Intimate atmosphere, incredible food, decidedly unpretentious. A true hidden Chicago gem, can't wait to go back!", "pics": null}}, {"review": {"des": "This place is pretty small and not eye-catching from outside. It's pretty dim and quite inside, which is good for a date dinner I feel. There are not overwhelming choices on the menu. We ordered fresh off the cod corn salad and red leaf lettuce salad! They taste pretty awesome except for they are a little bit too salty. But over all experience is positive in this restaurant:)", "pics": null}}, {"review": {"des": "The good: Great atmosphere. Dim lit and cozy, but not too cliche. Some great artwork and music to match. BYOB as well. Service was fast and friendly. The food is fantastic. The portions are a little a tad too small, but I'm a hungry guy. Still, everything was delicious.<br><br>The bad: The menu is great, but somewhat limited. All of the options are good, but there are only a handful of them. Also, the prices are somewhat high. A little bit more than what I would've liked to pay. <br><br>Overall: Great little restaurant in a great neighborhood. If you don't mind paying a little extra, it's worth it.<br><br>Atmosphere: 9/10<br>Service: 9/10<br>Food: 8.5/10", "pics": null}}, {"review": {"des": "I went to Home Bistro tonight looking for a good dining experience and was instead met with an incapable server and an egotistical owner. After waiting five minutes to be acknowledged the server came over to the table and said \"are you ready?\" and things went downhill from there. Asa solo diner i was uncertain if i wanted an appetizer salad and entree or just an app and entree. I wanted to be able to gauge how hungry i was before placing the rest of my order. i understood that this could mean a delay in my order and i expressed that understanding. The server refused to take only part of my order and after considering how rude this was i asked for the owner who also refused to meet my needs as the customer. I ended up leaving without eating a thing. It seems to me that if you arent interested in taking care of your customers and you run a restaurant then you are in the wrong business. Its no wonder the place is nearly empty everytime i walk by.", "pics": null}}, {"review": {"des": "Home Bistro serves 5-star food at a reasonable price. Taste-wise, this restaurant is probably among the best in Chicago. What's more, every Wednesday, you can get a 3 course meal for just $33 (a $50+ value)! <br><br>The interior design is very unique too. I would call it cozy but quirky. Unfortunately, the restaurant is a bit small.<br><br>But the reason why Home Bistro doesn't get 5 stars is because of the service. I counted just one waiter, and if there were more waiters, it certainly feels like there's only one waiter. If service time were to improve with an additional waiter, then this would definitely be a solid restaurant.", "pics": null}}, {"review": {"des": "third time here and HB NEVER disappoints me.<br><br>The mussel, clam, scallop and crisp crab dish is as amazing as a shell fish dish gets.<br><br>Crispy pork belly is innovative, that is a high praise from a Chinese who literally ate every possible part of a pig in every possible way.<br><br>Sipcy chocolate bar is another surprise.", "pics": null}}, {"review": {"des": "I rarely give a one star rating, but based on my visit Home Bistro earned it.  This was a major let down, because I searched through Yelp for about an hour before finally selecting this place.  The only positive was we were seated immediately despite it being pretty packed.  I love bacon wrapped dates and order whenever I find them on a menu.  Big mistake.. The dates were incredibly sweet in the worst way, not to mention topped with brown sugar.  I also ordered the short rib corn dogs.  Mistake number two..  I'm confident any freezer brand corn dogs would hold its own against these in a blind taste test.  They weren't terrible, but not distinguishable difference a standard corndog.<br><br>$25 into my meal and I was already experiencing buyer remorse, but I stayed the course in hopes of better entrees.  But wait.. Our server hadn't been to our table in quite some time, so our entrée orders weren't taken.  I found this to be odd because every other table I observed impeccable service and attentiveness.  No explanation, but true.  Rarely have I visited a restaurant where they allow water glasses to get empty, let alone sit empty for over 15 mins.<br><br>While waiting for our server to take our entrée order the busser noticed we weren't eating our apps & offered to take them away.  He also filled our water.  When our server returned, I reminded her to take our entrée order.  We opted for the trout and the short rib tacos.  After another long wait and no water, we finally received our food.  The tacos came with a side of refried beans, which were cold.  The corn tortillas were straight from the package. Not warmed.  The trout was overcooked and tepid.  My guess is our plates sat in the back for a while better coming out.  We picked at both dishes, but left 90% on both plates.  When our server found time to ask, I let her know we were disappointed and explained the misfires with each dish.  She offered no response.  No offer to remake or order a different dish..No offer to remove items from the bill.. No offer to notify the owner, who was onsite.  My friend's company hosted an event in the past and recognized him as he stopped by several tables, not ours.  <br><br>I requested the bill, paid in full (third mistake), left the food and went across the street to Wood.  In summary, HB has below average to mediocre over-priced food and inconsistent service.  In my top 3 worst dining experiences  of 2014..", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/WSdZMqcSi3rP1-R5iUX0AA/348s.jpg", "caption": "Short rib tacos (special of the day)"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/_zbXxKmhcYjQ2rJ0zBsxbA/168s.jpg", "caption": "Rainbow Trout - sweet potato & horseradish puree, braised red cabbage, bacon gastrique, fried egg"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/OmA2d6jvm4P0VbVd0wsiRw/168s.jpg", "caption": "Housemade Corn Dogs - beef shortrib mini-dogs, Cleveland Stadium Mustard, smoked tomato ketchup."}]}}, {"review": {"des": "Wow. This place is amazing. Be prepared to eat a lot but to enjoy everything. Highly recommend!!", "pics": null}}, {"review": {"des": "I went here last weekend for a friend's birthday. It's worth noting that I've been here several times prior to this visit and still keep coming back. It's a charming restaurant with a great staff and delicious food. Plus, the BYO option makes it really hard to beat. Great bang for your buck!<br><br>Do's<br>- Always order a starter. The food can sometimes take a while and the starters are all good I recommend the artichoke fritters or the bacon wrapped dates...<br>- Always ask whether they're close to running out of something, especially on the weekends. I can't tell you how many times they've told me, \"oh we just ran out of this one...\" It's devastating.<br>- Do visit the Paired Wine store right across the street before dinner and pick up a bottle of your favorite wine. It's a cute little wine shop and the staff is really friendly.<br><br>Don'ts<br>- Avoid coming here with large parties. I've made the mistake one too many times as they're a small venue and you always end up waiting 15-30 minutes past your reservation. <br>- Stick with the traditional American entrees. I made the mistake of ordering the Ramen one time and I was very much wishing I'd ordered a favorite like one of the beef cheek or pork shoulder dishes... It just wasn't quite the ramen you get at a traditional Ramen place and it wasn't as good as one of their other traditional dishes.", "pics": null}}, {"review": {"des": "We were so excited to try a restaurant in Boystown with such high reviews (hard to find GOOD food in Boystown).  We did not have reservations but the hostess said she could seat us, as there were no reservations until 7:30pm (this was at 6:10pm and there were only 3 tables occupied).  Immediately after we were seated, I ran across the street to get wine and asked the others at our table to order appetizers.  I returned to find that they did not place the appetizer order, as they didn't allow them to.  The server said that we had to order everything at one time.. very odd, but okay.  We ordered and food came out fairly promptly.  The meal was solid and we were, overall, happy with our food.  Now comes the issue..<br><br>It's now 7:23 and we ask for a dessert menu.  The server says (while still walking) that we could not order dessert because they needed the table at 7:30.  I was sure I didn't hear him correctly, but (as stated) he said this while walking away so I asked him to come back over.  I asked again about dessert and he said we could not have dessert as they needed the table for a 7:30 reservation.  Now, I completely understand honoring reservations. However, we ordered with plenty of time to be served AND there were 3 other open tables at the time!  I asked for the hostess, who told me the same thing and handed me our check.  UNBELIEVABLE!!  No matter what, they were focused on having that particular table open at 7:30.  Now, there were 3 other tables open at the time.  Plus, what are the chances that all 4 reservations will show up at exactly 7:30.  And how many times do you check in at a restaurant for your reservation and they tell you it will be just a few minutes before your table is ready.. it happens all the time!  I just cannot understand why (I don't want to say it was race, but I saw no other people of color in there, unlike our mixed party).  We left, leaving VERY upset.  <br><br>Naturally, I walked back past this place at 7:40.. 15 minutes after we were kicked out.  Guess what.. still 2 tables open!!  Needless to say, they won't take any more money from me.", "pics": null}}, {"review": {"des": "Absolute disaster. I ordered the ricotta gnocchi, which had ingredients listed as part of their special. The dish came and I thought it was dipped in brown sugar because it was so sweet. When I inquired what was making it so sweet, the waiter, a tall blonde bearded man, told me that it was the raisins. Firstly, I hate raisins. Had I known there were raisins, I would have NEVER considered the dish. Secondly, when he saw that I hadn't touched my dish, he didn't ask why I haven't indulged in my seemingly sugar coated entree. Not only this, when I voiced my concerns over not knowing that the raisins were the main component of the dish, giving it its overpowering and overwhelming taste, he said, \"Oh that makes sense,\" and walked away. <br><br>Horrible experience. I left the dish as it came and he didn't even offer to accommodate me.", "pics": null}}, {"review": {"des": "This place is amazing. We just left from our anniversary dinner and from the moment we walked in we felt a warm, joyful atmosphere. I picked HB based off of revues online and they do not lie! We both had two dished off the chefs special menu and it was OUT OF THIS WORLD!!!! Everything was seasoned perfectly! The chef got flavors out of things that I could only dream of getting out of my food at home. The bread pudding is also to die for!!!! We will definitely be back and you should make it a stop in your date night rotation!!!!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/OHc_xBU0PkrDoPivxH3xCw/168s.jpg", "caption": "Amsterdam style muscles and clams in a beer broth, roasted garlic and dried Basel. Starfish anise. Chef special!!!!!!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/0PZvZXLqQbSyjDQrIKnH6Q/168s.jpg", "caption": "Rabbit thigh confit!!!! Chef special!"}]}}, {"review": {"des": "Wonderful food, everyone I dined with said it was one of their favorite meals in Chicago. Creative (but not TOO creative) dishes, well-prepared, with a surprise flavor palate if you look for it (toasted brown sugar on the dates, anise in the mussels were particularly interesting). Solid.<br><br>Normally, this would get a restaurant a 4-star rating. However, the setup of HB is what put it over the top. Unpretentious and relaxed, it was a nice respite from the Fulton Market standard. BYOB is a plus. Service was hands-off, but there when you needed it. Pluses all around.", "pics": null}}, {"review": {"des": "Love this BYOB place in Lakeview. Food is delicious, staff is so nice and efficient. Looking forward to dining here again April 29!!", "pics": null}}, {"review": {"des": "I initially found this because it is BYOB, and was pleasantly surprised to find out just how amazing all the food is. We ordered an array of specials, including the gnocchi, Eggplant Caponata, HB Caesar and the braised pork shoulder. Everything we had was so wonderful, and the atmosphere is perfect. <br><br>I absolutely agree with others who have gone on and on about the service. Perhaps the best casual service I've ever had, anywhere. Attentive, personable - they just made it look easy. Hospitality, they has it. <br><br>We enjoyed dinner so much, and this little neighborhood is darling. My brother and his husband put an offer on a house down the street the day after our dinner here, so I'm sure I'll get to come back sometime soon!", "pics": null}}, {"review": {"des": "I had a great experience!! <br>we had trout and the smoked chicken and it was amazing the beet salad with pistachio butter was incredible!! <br>service was phenomenal thank you again see you guys soon!!", "pics": null}}, {"review": {"des": "I'm so happy to have found this (somewhat small) restaurant. We stopped by with some friends for dinner, and the atmosphere was cozy and romantic and the server was very friendly and knowledgeable. No corkage fee for the BYOB, which is always a plus! I tried the gnocchi and it was perfectly done, as chewy as I like it and the date puree balanced the richness of the sauce. My boyfriend tried the salmon, and although I can't say that it was the best salmon I've had, it was definitely above average. This is the perfect place if you're looking for somewhere cozy for an intimate dinner.", "pics": null}}, {"review": {"des": "We did not have a very good experience here on Saturday night. My friend from NYC picked this place out due to its location and the great reviews. I brought the wine. <br>Its cute and has a small dining area, but its also very loud. It looks like it would be a great date night place but maybe not for the first date because you have to scream to be heard.<br>We started with the fried zucchini that came with a soft boiled egg. It was really good. The zucchini wasn't soggy, it had good seasoning. We were excited for the good start.<br>Then we waited. And waited. And waited...they didn't seem to notice that we waited a really long time for 2 entrees that shouldn't take very long. Then they brought my friend's chicken thighs. And we sat and looked at each other for a bit....then he waived down one of the guys and asked where my dinner was. A min later he brought it out but didn't break his stride. No apology, no explanation of what we were about to eat. Nothing.<br>Our initial reaction for both dishes that they didn't look great. I had four little scallops sitting next to some carrots and two slices of parsnips. It was sitting on dry wild rice. The scallops were so incredibly salty that I couldn't eat them. Dry rice is also not a joy to eat. So I had some carrots.<br>My friend thought they were stingy with the chicken thighs. He received two and a bunch of brussels sprouts to fill up the plate. His chicken was also too salty to eat. <br>Then the bus boy took our plates away. No one took notice that they were full plates! No one asked how our meal was, or questioned why we were pretty much sending the whole thing back.<br>Then after another glass of wine one of the waiters came over and asked if we wanted dessert. <br>We did not. They didn't seem to care.", "pics": null}}, {"review": {"des": "Man, I wanted to like this place. It's BYOB as well so we brought some wine. Situated in Boystown, it's a very fun little neighborhood. Parked sort of near the ball park. Parking sucks in general in Chicago, hah.<br><br>Anyway, the food. We shared the beer battered asparagus (really good) with malt vinegar aioli and soft boiled egg and we shared a salad of the day. <br><br>For food, I got the salmon with melons and wheat berries. This was not pleasant at all. I thought I'd like the texture of the wheat berries but these flavors just did not mix well. It was just so odd...didn't like it.<br><br>My friend ordered a goat burger which was HUGE. It had a 'Mexican' flair with it but even those flavors didn't mesh so well. It was just not pleasant.<br><br>Overall, the experience was just okay, but for the price of the food, it really wasn't great. I'd go elsewhere.", "pics": null}}, {"review": {"des": "Order: Duck Meatballs. BYOB!! (. :). )<br><br>The meat balls was amazing. I have never eaten duck and I must say I might have to try and eat these cute little guys again. <br><br>I honestly felt guilty eating duck.... BUT! It was worth every bite...   :0", "pics": null}}, {"review": {"des": "It's obvious the chef knows how to cook and is passionate about what he does. These are the types of restaurants I love to go to. That being said, my  entrée, the rainbow trout, had too much going on. I order fish because I a actually like to taste the subtle flavor. All I could taste was the horseradish, egg, pickled cabbage, and a ton of salt. Each component was good on it's own, but I was not a fan of the overall combo. I also had several bones in my fish. But, the quail appetizer was excellent, couldn't get enough of the blue cheese sauce. The salad we had was excellent and unique. The potatas bravas  was just okay.. but maybe because I love the tapas version so much and had a hard time not comparing. The bread pudding was phenomenal! My date had the pork belly special and I had to stop him from licking plate... He said how great is dinner was about 10 times after.", "pics": null}}]}