{"name": "homeslice-chicago", "reviews": [{"review": {"des": "Homeslice has a great environment. When I went the place was packed but we still got seated right away on a Friday night! You share tables with people but it definitely makes the atmosphere more unique. There are fire lamps outside so you can eat out there in the colder weather. <br><br>As far as the food goes, it was delicious. We got the samilton and a taco like pizza with cream cheese as a base. The garlic bread isn't like your traditional garlic bread but it was good too. Wine is cheap and I think beer is too. I recommend getting two small pizzas to share. Also get a bottle of wine!<br><br>Great service too. Will be going back", "pics": null}}, {"review": {"des": "Great place for some fun pizza combinations and a super cool atmosphere. I came here with a small group of friends on a Friday night and we didn't make a reservation. It was packed inside but we were offered a table on the heated outdoor patio. It was a little chilly but not too bad. I was also kind of happy we ended up sitting out there because the patio is super neat. Fun decor and string lights. The Chicago sign towards the back makes for a great photo op. <br><br>Our waiter recommended a fall beer that I really liked and told us that getting a pitcher would be cheaper than getting individual glasses. I always appreciate it when servers look out for your bill like that. We started with the burrata which was pretty tasty. Soft and spreadable cheese is my weakness. And the bread wasn't too toasted or hard which often happens when you order these types of apps. <br><br>I got the mercenary pizza which was topped with blackened chicken, pepperoni, jalapeños, sour cream, diced tomatoes, green onions, mozzarella, provolone, cheddar & cream cheese. Pretty good. I wouldn't say it's the best pizza around.. It's very similar to Happy Camper pizza but I don't think anyone comes here expecting to get amazing Chicago style pizza. It's more about the fun environment and creative menu. Good service too.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/FIAWLja2X6L8eaXnXrIlnA/348s.jpg", "caption": "Mercenary pizza"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/RTW5ay7_tUrQvw_W68WJAw/168s.jpg", "caption": "Burrata appetizer"}]}}, {"review": {"des": "I stopped by Homeslice with a couple friends to grab a quick lunch. The three of us ordered the Ava-lance, Hughes Delight, and the Special-K pizzas to share. My least favorite one was the Hughes Delight--it wasn't bad, however. I would highly recommend ordering the Ava-lance since it was absolutely delicious! I loved the addition of artichoke hearts. The crusts of the pizzas here was nice and chewy with a slight crunch. I liked how the crusts were not rock hard nor were they overly soft.<br><br>Overall, Homeslice had some pretty tasty pizzas on the menu. If I came back, I would definitely order the Ava-lance again. I hope to get to try some of the other pizzas next time!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/KDRvMkc_e8fykHgMMuUw4A/348s.jpg", "caption": "Special-K Pizza"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/KeGX00jJR7jDPWxwD_kCyw/168s.jpg", "caption": "Hughes Delight pizza"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/cgpCEP8OGTomu1A5VJ0-rA/168s.jpg", "caption": "Ava-lance pizza: a must-order!"}]}}, {"review": {"des": "Really wanted to like this place as I've heard so much about it. But if I had to describe it using one word only, I'd say it is mediocre. If I had to describe it in two words, then it is extremely mediocre. <br><br>The pizza was decent, nothing special. It tasted like the dough was straight out of the freezer then thrown into the oven. Our server was okay I guess. Accommodating but very seldomly accessible. Hopefully it was just an off night, he would literally walk away (before you could finish your sentence) and then look back to acknowledge he heard. In my opinion, that's rude, but whatever. <br><br>The lighting made everything look red which was pretty cool. Everything looked kinda nice. <br><br>The first pizza we tried was the buffalo chicken one and it sucked, but they were nice enough to make it again for us on the house which got them some positive points with me. Our other pizza was the Smoke Show which was really good and I highly recommend it! <br><br>We ordered the Trifecta for dessert and we're pleasantly surprised with how amazing and delicious it was until we saw something walking on the plate that it was served to us in.... Total mood buster- but with the doors constantly opening, I guess it's bound to happen here and there!<br><br>All in all, fun place, cute decor, great aesthetic. Decent food, whatever service. Would come here again if I was with friends or a group that wanted to, maybe not on my own though.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/G0Q7rWZKWx-Zmh80VJN1RA/348s.jpg", "caption": "Total mood buster... Something was WALKIN- nope, CRAWLING in our dessert plate!!! :("}]}}, {"review": {"des": "I have been wanting to visit Homeslice since last year and I am so glad I finally did! So worth the hype. Right away from the outside you can see all of the Christmas/Holiday decorations this time of year. It is STUNNING. We found free street parking close by and got seated right away (group of 3 on a Tuesday night ~7PM), which is great. Our waitress came by and took our drink orders and later our pizza orders. She was very timely and great to talk to. She later told us there was an entire back section with more decor; after eating we took our drinks back there and thank goodness she told us that existed - it was STUNNING. Such a wonderful experience with friends. We took so many pictures and enjoyed great food and drinks. Can't wait to go back.", "pics": null}}, {"review": {"des": "THIS PATIO IS REALLY SHHWEEEET... what??....THIS PATIO IS DA Sh&T. ...whhaaTtttTT?<br><br>So that's sorta my impression... looks kewl but RIGHT ON THE L TRACK!!! Visually appealing patio turns meh with the L going by every 5 min.  And the pizza was super greasy... like wash ur hands twice greasy. It looked gourmet but tasted like an upscale dominos pizza. Service was not great either. They cater to the college crowd so their food quality and service effort is likely adequate for its patrons but I wouldn't likely make a point to go back.", "pics": null}}, {"review": {"des": "Homeslice for the win!!! I love the vibe and chill feel to this place. The menu can be overwhelming, there's so much to choose from! The menu divides the pizza into three sections...veggie, meat, and chicken. We decided to try the Sammilton which contains prosciutto, spinach, caramelized onion, sun-dried tomatoes, balsamic, and goat cheese. It was very delicious and filling, I loved the variety of ingredients! For the appetizer we ordered the burrata that include pomegranate seeds also very tasty and liked the presentation. I ordered the Gare Bear for a drink that came with the cutest bear shaped cup-- Vodka, cucumber, lemonade.<br><br>The decor of this place is soo unique and inviting! I finally got to see the infamous sign: \"I could give up pizza but I'm not a quitter!\" I wasn't able to see the outside patio since we were seated inside but this gives me just another reason to come back and soon before winter hits! It's also conveniently located within DePaul area and close to the Fullerton red line station. This is another place to add to my favorite pizza restaurants!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/rxKJIqcGxNxZkz-Mtw-TWw/348s.jpg", "caption": "All of their pizza choices!!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/MEdQSuPfPflm7Zdsz3D9OQ/168s.jpg", "caption": "Gare-Bare drink-vodka, cucumber, and lemonade"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/NtHFiGBTksxVr_XExkE9sQ/168s.jpg", "caption": "Burrata w/ pomegranate seeds"}]}}, {"review": {"des": "We were in the area, and this place had good reviews so we decided to check it out. There was a lot of space, and we wish we actually sat outside (they have a BEAUTIFUL patio area- thats heated). <br><br>The service was good- and the specialty pizzas were decent.<br>They also reheated well the next day! <br><br>I want to come back and have drinks on that patio when the weather is nicer!", "pics": null}}, {"review": {"des": "Oooooooh yes, one of my favorites, Homeslice! If you ask me for a Lincoln Park recommendation, I'll say Homeslice. If you ask me for an entire city of Chicago recommendation, I. Will. Say. HOMESLICE. <br><br>First of all, the place just absolutely reeks of charm. Not only does their logo outside feature a pine tree, but there's a woodsy theme throughout, and even their menus are made of wood. I do wonder how they clean them, though. <br><br>Then there's their extensive pizza menu. Yes, it is a pizza place, but they didn't have to give us so many options. However, they DID bless us with so many options, so thank you, my angels! I'm a big fan of the Party Boi (pepperoni, pepperoncini, mozzarella, provolone, and marinara) and the Boyler Room (pepperoni, mozzarella, provolone, and marinara). I just realized as I looked those up on the menu that they're really very similar. I have a certain taste, I guess!<br><br>Their drinks are also fabulous: If you order beer, it is served in a cool beer can-shaped glass cup that says Homeslice on it. This time, I ordered a mango mule off of their special little menu, and that was delicious as well. <br><br>If you've heard good things about Homeslice (which is owned by the same people as Happy Camper), believe what you hear. The food is fabulous, as well as the drinks, the ambience is fantastic, and the branding is so thought out and well done, it takes my breath away. 'Til next time, homies.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/4QHtrqrJpcIyBc1ufXwmww/348s.jpg", "caption": "Wooden, usual menu. :)"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/89_xDFCA348l0Uq6HYFdmg/168s.jpg", "caption": "Special lil menu"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/AG_7Ah-oNwodM3k7ESN6NA/168s.jpg", "caption": "Mango mule!!!!"}]}}, {"review": {"des": "Homeslice is everything you want in a casual, hip and fun pizza joint! The music is good, the food is delicious, and service is great too.  I like that the back patio is exclusively 21+. <br><br>We ordered the bean dip and Smoke Show pizza. The Smoke Show consists of blackened chicken, jalapeños, cream cheese, mozzarella, provolone, garlic and chili flakes. I highly recommend these two items, you won't be disappointed. <br><br>I'm not even a huge fan of pizza, but I'm a fan of everything Homeslice has to offer. <br><br>Bonus: drinks are pretty legit! Try the Mango Mule and Alotta Colada!", "pics": null}}, {"review": {"des": "This is one of those places that has been popular for quite some time and I have been meaning to get to it for about 5 years. I had the idea to meet a friend here for pizza and drinks this past Friday since it was the beginning of a long holiday weekend and it was finally getting nice outside.<br><br>I rode by on the redline and saw people walking in and could see there were tables open on the back patio. Got off at Fullerton and fast walked it on over and grab a high top against the wall. Was hot as hell outside so it was a great idea to be out there and starting off with a mezcal mule to cool off...pretty decent! Our server Andrew was a great guy and had great recommendations so when we started talking pizza he said his favorite was The Sammilton which includes prosciutto, spinach, goat cheese, drizzled balsamic, sun dried tomato, caramelized onion and a cream cheese base instead of marinara. This pizza was good as hell and we got a medium which meant 3 slices each. We decided to go for another drink to wash the slices down so we got the half bottle of rose' which was decent. Came with a twisty straw to drink out of lol!<br><br>So many delicious options for pizza and appetizers here definitely makes it worth a return or few. Inside seems really cool and there is a dog friendly outside dining area in the front of the place. Whole staff seems very nice and wants you to have a great experience. The whole back patio area is very photogenic and makes for some good IG and FB postings. Dont be like me waiting 5 years to check this joint...get up do the damn thang and get here!", "pics": null}}, {"review": {"des": "Good & fun pizza place, affordable, good for vegetarians, and good for groups. <br><br>Need to know: there are restrictions (i.e. 21+) at times, so make sure you know the rules. <br><br>Homeslice is one of the few Chicago pizza places that shies away from deep dish in a creative and fun way. There are many different varieties, good for all different tastes, and it is affordable.", "pics": null}}, {"review": {"des": "Wifey and I went here for brunch.<br><br>Food:  I had the breakfast sandwhich which came on a do-right glazed donut. It was delicious. However, my wifes dish was stunning in it's yumminess. She ordered the pork hash. The bbq pork was just the perfect balance of sweet/tang, the potatoes had the perfect crunch and the egg was cooked just right.  <br><br>Drank: Michelada had just the right beer to mix ratio. Was delish. My wife ordered some sort od iced coffee thing with a donut ontop. Instagramable and delicious.<br><br>Highly Recommend.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/x3HlOHcKjJHQXMUwRCBFNA/348s.jpg", "caption": "Michelada & Hangover coffee.  Both are frieken delicious."}]}}, {"review": {"des": "This place is pizza heaven!<br><br>If and when you check this place out go straight to the back! The patio is awesome!! They have beer vendors handing out free beer! The pizza is amazing along with their Daly Flyer drink. I loved this place so much that we are going again this weekend. <br><br>Warning: I would steer clear of the \"mozzarella sticks\"... they were okay.. but they are almost the exactly same as their goat cheese sticks. I felt that they should eliminate them and make space for a different appetizer. <br><br>Anyway, the super cool staff and food made up for it. <br><br>This place is a must see!", "pics": null}}, {"review": {"des": "If you were to ask me where my favorite place to spend a Saturday grabbing food and drinks in Chicago is, I would hands down tell you Homeslice. During the summer or on a nice weather day, you can spend hours upon hours soaking up the Homeslice vibes and indulging in delicious pizza and kookie beverages. During the winter, the inside takes on a similar environment. In December they light up the whole place with Christmas lights! <br><br>The cocktails are creative and fun! Start off with the hangover iced coffee if you're here for brunch. If you have a sweet tooth and like your cocktails sweet like I do, be sure to try the A Lotta Colada, served in a golden pineapple (see my Yelp profile pic for evidence). And as far as food goes, you can't go wrong so follow your heart and your tastebuds.", "pics": null}}, {"review": {"des": "Homeslice has been on my to-do list for a long time now. I came here for lunch when I had work off a couple of weeks ago and posted up at the bar. The place is big and has a big outdoor patio in the back, which is a great place for summer drinking. Service was solid and my Old Fashioned was good. <br><br>I ordered the Mozzarella Bread Sticks and a small Mac Diesel. The bread sticks were amazing as they were super cheesy and had an incredible cheese pull. The bread sticks were definitely big enough for 2-3 people and I finished them all. The Mac Diesel was okay. I liked the toppings, but the crust was flimsy and fell apart quite easily. The sauce seemed a little watered down and didn't have as much cheese as I hoped for. <br><br>Prices are relatively expensive for their medium to large pizzas. But most of them come with a lot of toppings on them. Overall, Homeslice is a cool place to come by for drinks and grab a bite to eat. I will have to come back and try some of their other pizzas for a better verdict.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/PBgJqSYP4fmKIDCBF_K_zw/348s.jpg", "caption": "Mozzarella Bread Sticks"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/INESZ5XCEGys8VPiZrwX8w/168s.jpg", "caption": "Zaaa"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/xHQEnAsz6u03Cah8J_9ceg/168s.jpg", "caption": "Old Fashioned"}]}}, {"review": {"des": "What a fun place! Cute decor, food is pretty good but limited options, since they serve primarily pizzas.<br><br>I can't tell if I'd categorize this as a bar that serves good food or a food place that serves lots of alcohol. Regardless, they both mean you will have a great time. The line can get long, so prepare to wait a while (especially on a Saturday, which is when I came).<br><br>Pizzas are great for what they are. Crust is nice and crispy/chewy, you know the kind where it is still doughy enough to give you something to munch on? Yum. Toppings fresh. I got one with artichoke and feta, it was really well done (if a little greasy, but that's what we all want from our junk food, right?). Was it the best pizza I've had in Chicago? No, but this was by far one of the more enjoyable locations to eat it in. We also got some sort of garlic bread starter that was okay. There was bread served with baked garlic and some sort of gorgonzola cheese dip, which didn't make much sense. There wasn't nearly enough bread for either of the toppings, and the gorgonzola was so strong it overshadowed everything else. Eh, wouldn't get it again.<br><br>Overall? A fun spot to hang out with some friends if you want the options of pizza and drinks. I'd come back!", "pics": null}}, {"review": {"des": "Get some homie!<br><br>After coming here many times, it is probably time for a review. For me, I enjoy coming back to Homeslice really because of the overall vibe and unique spin to their pizzas (za's) and drinks they offer. The neon signs, spacious indoor and outdoor seating, and the interior retro decor all make Homeslice a very trendy, 'instagrammable' place to eat some pizza.<br><br>I've come here both for brunch and dinner. The only appetizer I've gotten here is bread stix with goat cheese marinara, which is good but nothing amazing. In terms of the pizza, the breakfast za's is one of (if not) the best breakfast pizzas I've had because they do an excellent job cooking their egg on the pizza. The Special K and the Big Teve are also all around solid pizza picks here. While I'm not a fan of Hawaiian pizza, the Alo-Hot is actually pretty good, the jalapenos add a nice balance to the sweetness of the pineapple. The drinks are delicious and fun. My favorite drink here, by far, is the brunch bloody marys that come with a mini slice pizza on top of your drink as well as a beer back.<br><br>The downsides of being so hip and trendy is that, depending on the time, it can be very busy, which leads to long wait times and slight decline in service. Personally, I wouldn't wait more than an hour to go here. However, if the wait is just right and I'm looking for a fun environment to hang out with some friends and eat some tasty pizzas, I'll be here at Homeslice.", "pics": null}}, {"review": {"des": "I honestly don't get what all the hype is about with this place. <br><br>I came her with my sister and we ordered a pitcher of beer and a bbq chicken pizza. I am a person of the belief that there is no such thing as bad pizza. I really love pizza and rarely wouldn't want it. But I honestly did not like their pizza here. It's nothing special. It kind of reminds me of a pizza I made with pre-made dough from the grocery store. It's not bad, per say, but it's not worth the hefty prices they're charging or the praise I always hear from friends. <br><br>I mean we're Chicago. We know good pizza, so this doesn't reach the level of what we have. <br><br>That being said, the restaurant itself is cool. With cool neon signs and a dark, bar vibe, it's an event to come here. If you're with friends, there are plenty of places to take pictures. But I would say pass on the pizza. Not that great.", "pics": null}}, {"review": {"des": "Great pizza with great vegan cheese! Service was a little slow, but good for a busy Friday night. Christmas decor is a plus too.", "pics": null}}, {"review": {"des": "Always good, always fast, always filling. One of the best lunch spots near the DePaul campus.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/84XfykehxihfWp0y-NH38Q/348s.jpg", "caption": "Smoke Show, featuring flavorless chicken, raw jalapenos, cream cheese, chili flakes, a sprinkle of cheese and garlic."}]}}, {"review": {"des": "This place is great. I love the uniqueness of it and the outside and semi-outside seating. The service is amazing and it just has such a chill, feel good vibe to it! The theme is part camping and part hipster. There is no shortage of outdoor seating and you should expect to be pleasantly surprised by the decor out back. I love the vibe. For those of us in the #vegsquad I would not have know that they had vegan cheese if Homeslice hadn't reached out to me on Yelp! Shout out to Josh for amazing customer service! Moral of the story... they do have vegan cheese! All you have to do is ask! So ask for that Daiya cheese and 'Be Awesome' @ Homeslice!", "pics": null}}, {"review": {"des": "I've been to Homeslice a good number of times over the past four years I've been here, but tonight was the best night I could've ever asked for. Two small mistakes happened that I wasn't bothered by, yet the manager for the night decided my whole meal was on the house! I had a fantastic waiter and was treated with respect even after some minor blunders. I really love Homeslice and the way they served me tonight guaranteed that I'll always come back for more. Food is great and the atmosphere is even better. Thank you so much!", "pics": null}}, {"review": {"des": "Whenever I am visiting my friends that live nearby, this is our go-to spot most of the time. While they do have a long wait pretty often, you can always order a drink at the bar while you wait. <br><br>The last time I came here I learned about their Radler Vodkas, which are served in a Radler can without the top, and come with fun bendy stars of various colors. <br><br>I definitely love the pizza here, and usually order the Alo-Hot, which is a great combination of sweet and savory. I also recently found out about the Goat Sticks, which are breadsticks you can dip in goat cheese marinara sauce. Delicious!<br><br>I will continue coming here in the future and look forward to my next trip!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/UAvQJ4_XLhTycnhON_Ya1Q/168s.jpg", "caption": "Cookie Dough Bite"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/pTOkc14rfaFYTgV7jEV26w/168s.jpg", "caption": "Clay Bacon and Alo-Hot"}]}}, {"review": {"des": "Pizza preference varies WILDLY from person to person. If you're looking for a super flavorful, a little greasier, thin-crust NY style pizza that can hold up its toppings -- Homeslice is not the place. Perhaps the overwhelming recommendations and positive yelp reviews made my expectations too high. My three workout buddies and I shared:<br><br>AVA-LANCE (18\" for $32)<br>Artichoke hearts, kalamata olives, spinach, sun-dried tomatoes, roasted garlic, mozzarella, provolone, feta, garlic & olive oil<br><br>BENNETT'S BEAUTY (18\" for $32)<br>Pepperoni, Italian sausage, mushrooms, mozzarella, provolone & marinara<br><br>The sizes of the pizza were decent, but the flavors were not. All the toppings seemed fresh, but the flavors were rather muted perhaps due to insufficient salt. The crust/dough was also missing something...perhaps oil and salt as well. Also, I didn't like how soggy the crust got from the water coming out of the veggies. <br><br>For thin-crust, big-slice pizza - - I still recommend Dante's Pizzeria or Jimmy's Pizza Cafe.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/swfZS4NMxR2qcMbWn5dUhQ/168s.jpg", "caption": "Ava lanche"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/H5rk4ow7G_RvjD5qJgTLKw/168s.jpg", "caption": "BENNETT'S BEAUTY  Pepperoni, Italian sausage, mushrooms, mozzarella, provolone & marinara"}]}}, {"review": {"des": "I always looooove coming here. The ambiance is fun and the service is good too. I recommend getting a beer, since they have a good list. <br><br>I made my own pizza. This was a pesto base with pineapple, green peppers, sausage, pepperoni, Canadian bacon, and goat cheese.<br><br>I love their choice or pizzas too but sometimes it's fun to make your own!!", "pics": null}}, {"review": {"des": "Now, I may have only been here one time, but plan on becoming a regular like Nora who's review is below mine ;)<br><br>In my opinion, this is some of the best pizza in Chicago. I am a big fan of meatballs on my pizza and you can get that here! I typically order the breadsticks and goat cheese. I love goat cheese and the bread sticks with them are so warm and wonderful. I ordered the spinach salad which has: dried cranberries, grapes, apples, goat cheese, with a yummy cherry vinaigrette. My friend ordered pizza that was great just like at Happy Camper. The next time I go there I want to order the Meatball 'Za and I think I may need to try this homemade ranch that Nora made reference to in her review. <br><br>Just know you literally can't go wrong with whatever you chose to order. The CAKE BALLS are like cookie dough with sprinkles and it's insanely good and reasonably priced. The whole menu is reasonably priced especially for Chicago. <br>The lighting, the lit signs, the back porch, the swing, the beautiful wood bar, and the food is all A+. I hope to visit Homeslice again real soon! :)", "pics": null}}, {"review": {"des": "Went here last night for my surprise engagement party! It's a nice place for a crowd, and the pizza was surprisingly good.  I would recommend getting a pitcher of beer to go along with it. The drinks seem a bit overpriced, and I wasn't sure about the quality although I should try for myself next time. Regarding the atmosphere, it's a bit dark inside, so next time when it's not raining, I'll definitely try for an outdoor table because the patio looks sweet!", "pics": null}}, {"review": {"des": "On my list of places to hit up and it didn't disappoint. This place gets a lot of hype but it's deserving. Food was on point and the beer selection is impressive. Definitely going back", "pics": null}}, {"review": {"des": "Overall: Homeslice isn't a fine-dining Italian pizza experience, and it's not trying to be. But, it is some of the best and most unique pizza in the area.<br><br>The good: Quality, quality pizza. The crust is crisp, yet still has the flour-y dust and softness too it that not many other places can accomplish. The menu is vast and the types of pizzas that they have aren't gimmicky and all pulled off to a T. Shared the Alo-hot and funky McChicken and both were fantastic and hearty. The atmosphere for the restaurant is \"home-y\" and unique.<br><br>The not-so-good: Our server was MIA for a bit after we ordered our goat stix and beer, had to flag him down. The pizzas are a tad overpriced, but given the amount of toppings you at least aren't skimped. The TVs we were next to were a bit too big, which is rare for me to say.<br><br>Atmosphere: 9/10<br>Service: 8.5/10<br>Food: 10/10", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Fozo4DaDj4MtVUrsdZMzTw/168s.jpg", "caption": "Alo-hot"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/DlfkC6kMCCrnaq1uKJPybw/168s.jpg", "caption": "Goat stix"}]}}, {"review": {"des": "Was dragged here for Sunday Funday by my friend from NY who's obviously a Giants fan. The concept of hanging out at a bar the whole day watching football is completely foreign to me. Like...why on earth? But I was bribed by my friend saying the place is totally Instagram worthy. Alas, she knows me well. I do it all for the 'gram. So to Homeslice we went.  <br><br>Overall, the atmosphere is great! The pizza? Could be better. I wasn't impressed but then again, Chicago pizza always lets me down (sorry but true). My favorite part of the meal was the bloody mary with the pizza slice on top. So extra!! So instagram-worthy!! <br><br>I wouldn't go out of my way to come back here but it's a decent bar/restaurant if you just want to kick back with friends in your flannel shirt at a place with good vibes and watch a game while munching on sub-par expensive pizza. Yes. Live the Midwestern dream y'all.", "pics": null}}, {"review": {"des": "My friend and I came here on Sunday night and were seated right away. We ordered the mozzarella bread stix and a medium Lew-Wow (hawaiian pizza). Those breadsticks are extremely filling so I recommend getting a small pizza instead!<br><br>Both items tasted great! But what really makes this place is the ambience and their cool signs! Do it for the insta!! This place is also great for larger groups. i say that become the seatings for larger parties were so much cuter than we sat. :) <br><br>can't wait to be back!", "pics": null}}, {"review": {"des": "I have been here a few times, and it was always fine. Pizza is good I personally prefer Parlor pizza though. They don't take reservations but will take your number and text you when your table is ready.<br><br>Had dinner here last night (Saturday), arrived about 7pm and waited for about 20 min for a table for 2. So our waiter came by took our order then left....and never came back. We order an appetizer and two small pizzas after about 20 min my boyfriend and I were wondering what was taking so long for the appetizer. The waiter was talking to people at tables all around us but we couldn't get his attention, and he did not come to check on us. Eventually the appetizer and pizzas came out at the same time. I asked the girl who delivered the food for plates and napkins. She brought back exactly 2 small like cocktail napkins. So once again no one came by to check after the food was delivered, nor could we get anyones attention so eventually I just got up and went to the host stand to ask for more napkins and you know silverware so we could eat. <br><br>Finished eating, had to ask one of the busboys for our check then some other waiter who passed by. Basically the pizza is fine, as I said I prefer parlor, but the service truly sucked. <br><br>We are moving in down the street so thank goodness they have carry out, because the poor service really turned me off from dinning in ever again.", "pics": null}}, {"review": {"des": "I was wavering between a 4 and a 5 but all the instagram worthy neon lights pushed it to a 5! Came here and sat in the beautiful back patio twice. <br>My group of 3 ordered mozzarella bread sticks for an appetizer and 1 medium pizza and 1 small pizza.<br><br>We had the sammilton (subbed marinara sauce and took out goat cheese) and it was sooo good. highly rec'd! They have some interesting sauces instead of marinara like ranch which sounds weird but it works.<br><br>They have yummy sounding cocktails and drinks. Really fun vibes here and would rec'd coming here with a group. <br><br>Only downside was that the brown and red lines run frequently and can disturb conversations easily. But you can always sit inside if that works better for ya!", "pics": null}}, {"review": {"des": "2nd time 061918 had the summer salad with strawberries mangoes watermelon and goat cheese- not a fun of goat cheese but here it works I like it. My son had the zephyr pizza just ok for me", "pics": null}}, {"review": {"des": "I made the mistake of not researching homeslice before attending and damn did I regret that. Buckle in. <br><br>The food: I am not sure if they have a kitchen or a toaster oven out back. I have had better potato skins from a box, and they weren't even hot. The pork on top also had gristle in it. I got the gluten free pizza (which is a small might I add) to share and we ate a single slice. It was not cooked and stale at the same time. Beats me how they managed that! <br><br>The service: We got seated promptly and were taken care of, only reason they are getting 2 stars. <br><br>The decor: In its attempt to be trendy, this place is a mix of almost cool and straight up strange. Sparkles, industrial lights, and plastic wooden logs? Huh?", "pics": null}}, {"review": {"des": "I love this place for its pizza varieties, and of course the drink options - other reviews might help better with that. <br>What I want to point out is that their food options are so thoughtfully written and imho makes it very simple for anyone to pick the food they want to, without getting lost in the menu (I might be the only person who would have noticed this..lol). Also, don't forget to check out their bathroom if you got few pennies lost here and there... surprise!", "pics": null}}, {"review": {"des": "Excellent place to hang out in good weather. And great, reasonably priced pizza!<br><br>The outdoor seating area is very cool and usually not packed during the day on weekends. I'd recommend you get one small (10\") pizza per person so you can try a few different kinds. I think this is a better deal than just doing \"by the slice\". The Lew-Wow pizza is my personal favorite.<br><br>The service was good. The crowd is younger, but not rowdy like many of the establishments in the area.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/f-Rx7uq4yFQnISd2yZRUrQ/348s.jpg", "caption": "Cute patio area!"}]}}, {"review": {"des": "You know when you leave somewhere and are just like \"eh, it was okay?\" Well, that's how I feel about HomeSlice. <br><br>I wanted to love Homeslice. I really did. Maybe it's because it seemed to be teeming with college kids (both eating here and working here), but our server was apathetic and borderline rude. The vibe inside was cool with the neon sign and almost club-like music, but we were ignored the whole meal. No water refills, and I practically had to hunt someone down to order. The pizza itself was surprisingly really good! But was it special? I mean, not really. They definitely won points with me for the gluten free (and celiac-safe) pizza, but there's fancy pizza and then there's good-for-your-soul greasy pizza. This fell somewhere weirdly in between. <br><br>My fiancé and I agreed that if we were ever to come back, it'd be for takeout only.", "pics": null}}, {"review": {"des": "Super cool vibe and so many choices of pizza. <br><br>Came here on st paddy's day so everyone was feeling it. <br><br>The patio is awesome", "pics": null}}, {"review": {"des": "Great service, great food! Will definitely be back! You can 100% hear the train about every 10 minutes but it's part of the atmosphere and probably less noticeable on a busier night", "pics": null}}, {"review": {"des": "I am obsessed with all things Happy Camper/Homeslice. I love these two restaurants almost as much as I love pizza itself. The atmosphere is always fun, inviting. You can tell these people have a passion for pizza and happy stomachs.<br><br>There is really nothing better than piping hot goat cheese and tomato sauce. I really don't know how/why every person doesn't order this at either restaurant. It's the best thing on the menu.<br><br>Other than those goat \"stix,\" the Da Duba pizza is great. Our waiter, whose name I'm blanking on but absolutely LOVED, recommended that we dip the crust into the remaining goat cheese mix (which, funny enough, we already had that idea). He was fantastic and was smiling with every check in.<br><br>He also brought us free cookie dough bites at the end of our meal because he \"loved our vibe.\" Well, guess what, we loved your vibe, too!<br><br>Thank you to Homeslice + Happy Camper for somehow making tomatoes, bread, and cheese an even better combination than anyone imagined.", "pics": null}}, {"review": {"des": "Listen, I don't normally do this, but I need to point something out. I did not even get to eat at this restaurant. It closes at midnight and I showed up at 8 pm and never got a table. <br>When I showed up, I knew I had a large group. So when the lady helping me said it would be 25 minutes to get a table? I was like wow that's reasonable. They asked if a patio seat was okay and we said yes, and they put in my phone number to text me. <br>25 minutes later and we've been sitting next to an empty table the whole time. <br>40 minutes later and they're clearing off three other tables <br>60 minutes later they tell us they can't seat us on the patio because it closes at 9:30, when the sign clearly says it closes at 10:00. Considering we already knew what we wanted, and we were all really hungry, we weren't likely to take longer than an hour to eat. <br>80 minutes later we give up and go eat somewhere else, the Mexican place down the street. <br>120 minutes later we're walking back to the CTA and there are still people who are only a slice into their pizza on the patio and new people at one of the empties tables. <br>4 hours later it's closing and I've never gotten a text about a table being ready despite never cancelling the request for a table. Will not be coming here again.", "pics": null}}, {"review": {"des": "Staff here is super friendly and accommodating. Nothing against them. <br>Pizza has the potential to be good (crust is A+), but some of the topping combinations aren't great. <br>First we got the sammilton which had too much balsamic and a surprisingly off-putting cream cheese base. As embarrassed as we were, we decided to tell the server that we didn't like it and she happily switched it for us (like an angel). At this point I was sure that this was my fault for not thinking the flavor combination through. <br>The next pizza we ordered was the knife and forkner which you absolutely need utensils for. This one was just okay. Next time we might try something more tried and true. But I'm not terribly picky and am open to trying almost anything... i worry that some of these combinations were just not well thought out.", "pics": null}}, {"review": {"des": "One of my best friends hosted my wedding shower here last weekend. I have nothing but the best to say about Homeslice and their amazing staff. Dylan was our server that day and he did wonderfully at getting everything out and taking care of everyone. They gave us a large table for our group of 15. <br><br>The pizza was obviously delicious... but my favorite thing was the mozzarella sticks! <br><br>I had been here one other time with on a double date and I can say regardless of your party size, this is a great place to go out and have a beer and some pizza! <br><br>Also, a sincere thank you to Homeslice and Dylan for making our wedding shower a really comfortable and enjoyable experience.", "pics": null}}, {"review": {"des": "This place is dope! Definitely the coolest vibe and aesthetic we ate at during our Chicago visit. We hit this spot on our last day right before we went to the airport, which was a shame because we couldn't enjoy the full experience. <br><br>I would have loved to try their cocktails and pizza, but I was nursing a hangover and recovering from 3 days of very poor eating - so a chicken Cesar salad and large glass of water had to suffice. That being said, I still thoroughly enjoyed my visit. <br><br>Our waiter was v friendly and the service was exceptional. We sat outside and it was truly the cutest area ever. Loved all the small details, the neon signs, the sunflowers, everything! We came during the day and it was popping, I can imagine how turnt it gets at night. <br><br>This is a must visit if you're in the area!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/YvNQnnZIX39EzBY5Tih7Bw/348s.jpg", "caption": "Chicken Cesar Salad"}]}}, {"review": {"des": "Went for lunch, ordered drinks, the Bloody Mary is note worthy and I am attaching a picture for proof! Salad was large, fresh, well balanced. Pizza was outstanding, great crust, marinara sauce was the best I've ever had. Italian sausage was spicy but not too hot.<br>Pricing was extremely affordable for the quality.<br>It was topped off by service from Andrew that made the whole experience worth writing a review.", "pics": null}}, {"review": {"des": "It causes me pain that this place is as popular as it is. Lincoln Parkers love anything with an instagrammable aesthetic and strange toppings, and you will definitely find it here, but the food is just elevated DiGornio. Also, I tried to get a slice at 2 PM on a Wednesday and I got carded. <br><br>I don't want to completely bash, the appetizers I've had are very good. The goat dunkers are very tasty and their menu is pretty diverse. But like I said before, the crust is straight from the freezer and doughy the way Pillsbury croissants are doughy. All I'm saying is, if you want to wild on the toppings, the base has got to be good.", "pics": null}}, {"review": {"des": "FIVE STARS HANDS DOWN. I am in the process of moving apartments and my husband wanted pizza delivered. Since I am vegan and gluten intolerant this can be difficult. However, Homeslice had something for both of us. I got the gluten free crust with VEGAN CHEESE. Yes, they had vegan cheese AND GF crust. Not only did they have options for me, but it was delicious! My leftovers were even good the next day. I hope I have another opportunity to eat there in person again to try more!", "pics": null}}, {"review": {"des": "I have to go back for the pizza!  <br><br>Although extremely busy on a Friday night, we were seated very quickly.  <br><br>I was not incredibly hungry so all I ordered was the potato skins.  I really wanted a pizza but that would've been overkill for me.  <br><br>Their menu is quite expansive without being overwhelming.  They have pizzas that range from personal size (10'') to sharable size (18''), the prices range from $11-$32.  Apparently the dough is gluten free, which is kind of a big deal.  You can choose from meat, chicken, or vegetarian or just build your own.  They also have a handful of apps, salads, and they even have a soup selection.  <br><br>But lets get back to the potato skins that I ordered.  OMG, it was the best potato skins I have ever had, EVER.  It had pulled pork, bacon bits, cheddar cheese, sour cream, and green onion on it.  Just wow.  My hubby ordered a meat calzone and that was extremely delicious.  <br><br>Last thing to mention is the outdoor dining.  It's probably the cutest patio I have seen in Chicago yet.  I must go back and you all should check it out too!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/UhCdf_wYp0zjgVNf5kRXsg/348s.jpg", "caption": "Cute!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/JvQSPnd75WLCTWLrXP04kQ/168s.jpg", "caption": "Outdoor patio"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/5LEXKH3UifQuM7_hp5lyjA/168s.jpg", "caption": "Calzone"}]}}, {"review": {"des": "My favorite pizza delivery in Chicago! <br><br>$26 is very expensive for uber eats but I'll do it every time!", "pics": null}}, {"review": {"des": "THE GIST: You pay for the atmosphere - not for the food, and not for the service. <br><br>THE FULL REPORT:<br>I've been to Homeslice twice this summer. The first time, I was enamored by the trendy atmosphere. The food and drinks weren't bad, either. Last night was my second experience at Homeslice, and I was not as impressed. <br><br>First, we waited an unreasonable amount of time for our food - especially considering it was a week night. Our waitress informed us that although the restaurant was nowhere near full, the kitchen was experiencing an influx of carry-out orders, which slowed them down significantly. Now maybe this was just me being hangry, but it's my opinion that guests dining in should have priority service over carry-out and delivery. <br><br>We ended up receiving our appetizer just seconds before the pizza, but the redeeming quality of the night is that our waitress took the app off our check. Speaking of appetizer... Don't be fooled by the \"mozzarella sticks.\" They are actually just cheesy bread. Very redundant if you plan on ordering a cheese pizza, and certainly lacking all the deep-fried goodness of traditional mozz sticks. <br><br>My pizza this time around was also not as good as I'd remembered it, and I only ended up eating one slice. Overall, I'm disappointed to have waisted my money here last night.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/bCsIXzCk1lE8FwBeSfbh6A/168s.jpg", "caption": "Airstream for larger parties"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/mZjHw9ooDPs4NW5HwB-RDA/168s.jpg", "caption": "One of the several trendy neon signs"}]}}, {"review": {"des": "Good atmosphere and the pizza was good. Just very expensive for some za.<br><br>Pro tip: If you are getting bread sticks and like Goat cheese. I would get the cheesy bread sticks and ask for the goat cheese with those. (you can thank me later)", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/pu7rmFrC5LUYFN8jJdS2ZQ/348s.jpg", "caption": "Za!!"}]}}, {"review": {"des": "I must admit, this is probably my favorite place to go out and get pizza. I love the atmosphere, the patio and of course the pizza. The best pizza on the menu is the samilton - it's so unique with goat cheese, balsamic and of course the best part is the prosciutto but I've never had pizza like it. I like the chicken pizzas like the knife and forkner & mercenary but the chicken tends to make the pizzas dry if you tend to like more sauce with your pizza I would stay away. Definitely try a different pizza then your standard pepperoni and you won't be disappointed.", "pics": null}}, {"review": {"des": "This place is great for brunch. If it's nice out, ask to sit outside on the back patio. It's enclosed, super cute! The food is also really good and the drinks are fun. Definitely try the iced coffee, that comes w/ a glazed donut on top, if you go for brunch. And the pizza!", "pics": null}}, {"review": {"des": "I was a little concerned about getting salad, since this is primarily a pizza joint. But, my gluten sensitive friends, fear not for the super solid sheffield salad (say that 5x fast) have your back. Combine with a Stone Delicious IPA and you're in for a good time. My server, Ian, was knowledgable and friendly, offering a warmth that the chilly breeze had taken from me. Will return.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/WVPTOnD3ewOFs0UBkz_kwQ/168s.jpg", "caption": "Sheffield salad"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/y2WVeXrQPuEoPO4cQ2zUOQ/168s.jpg", "caption": "Patio"}]}}, {"review": {"des": "wow, absolutely amazing pizza! the individual is still enough food to have leftovers! the moscow mules were also good, however, little pricey if you're trying to have several drinks. great spot to grab dinner with friends", "pics": null}}, {"review": {"des": "Homeslice is the best place to grab a pie if you're looking for good pizza in a more upscale type setting. The atmosphere is still casual and comfortable, but it's a little more trendy than Lou's or Giordano's.<br>Last time I came here, I got the Smoke Show, which had chicken, jalapeño, and cream cheese. No, not a typical pizza, but damn delicious!<br>Their back room is also really cute-- it's an open patio in the summers and covered up in the winter.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/GF_m00slt5dVqIWJ1HqHmA/348s.jpg", "caption": "Outside area, covered in the winter"}]}}, {"review": {"des": "Love the Ava pizza and their salads are incredible. However--kudos to the staff for great service, giving my grandson Archer unlimited chopped tomatoes  and for finding my purse and storing it in the safe!  Thank you!!", "pics": null}}, {"review": {"des": "Had dinner here this evening, yes it's a holiday so they may have been short staffed but why open for business if you can't serve your customers?<br><br>Waited at least 10 minutes to be acknowledged once seated, another 15 for drinks to arrive. Server didn't greet us or ask if we would like appetizers or a food order, just took a drink order and disappeared. Eventually, I had to go to the bar to order a second drink because there was no chance he would return. I was hoping to get a side with my meal but was never given the chance to ask. We really didn't exist until asking for the bill. <br><br>Food is mediocre at best as well, I'm surprised they have a following given the far superior options throughout the city.", "pics": null}}, {"review": {"des": "We went back here to give it another chance and we were NOT disappointed!  We had Alissa as our waitress, today was her first day, and she was awesome!!  We forgot our leftovers and she ran after us to give them to us.  So sweet.  We will definitely be back!!  The back patio has a really nice ambience.<br><br>Food's yummy and filling.  We get a small, personal size pizza and still end up having at least 1 slice leftover!", "pics": null}}, {"review": {"des": "We started with the garlic bread, which I was quite disappointed in. It was bland toasted bread without any spices and little oil/butter. Even once you put on the roasted garlic and sour cream type sauce, it wasn't really a cohesive dish and still wasn't incredibly flavorful. <br><br>We ordered two vegetarian pizzas for dinner. They did have a really nice selection of creative vegetarian pizzas and the pizza was good, however, with Chicago's vast selection of pizza, it doesn't stand out to me as one of the best. <br><br>The atmosphere was great but the service was slow. <br><br>Overall, I would go again if I was in the area but wouldn't go out of my way to come here.", "pics": null}}, {"review": {"des": "I've been to Homeslice several times, usually for dinner, and have had a decent time. Food is pretty on point and it's a lively ambiance. <br><br>This past weekend, however, showed me a far different experience than I had expected. My friend hosted her birthday party on Saturday afternoon, with a wristband package. Now, wristband packages aren't a new thing, but I did not intend to purchase one (I was going to pay per drink if I was even going to drink that day).<br><br>So I show my ID at the door and the doorman asks me if I'm meeting a party. Here is the following exchange:<br><br>Me: \"yep, they're in the back\"<br>Doorman: \"oh you need a wristband\"<br>Me: \"I'm not drinking today, but thank you anyway\"<br>Doorman: \"you need a wristband to get back there\"<br>Me: \"but I will not be drinking with it, plus het package only lasts another hour\"<br>Doorman: \"I can't let you back without one, there's food and it'll pay for itself in just a few drinks\"<br>Me: \"so you're telling me I am forced to drink\"<br>Doorman: \"well yeah! It's fun!\"<br><br>So I purchased a $50 wristband that I did not use just you WALK IN to my friends party. <br><br>Now, Homeslice, I ask you this: what if I was someone who didn't or couldn't drink? No one should have to be forced to purchase an all-you-can-drink package (especially since you cabby be served without a wristband anyway).<br><br>This experience really soured me on this place and I'm extremely disappointed with the level of service upon walking through the door.", "pics": null}}, {"review": {"des": "Visited Homeslice for the first time and enjoyed it a lot! For two of us we ordered the goat cheese bread sticks, a salad and pizza to split and we were very satisfied. We got the barbeque pizza and it was fantastic. We finished off with the cookie dough bites and being a big fan of cookie dough it was so satisfying.<br><br>Although the food and service was good I stuck to 4 stars because I wanted to see more appetizer options on the menu that were pizza-place style. <br><br>Really worthwhile checking out and enjoying the food!!!", "pics": null}}, {"review": {"des": "Overrated to say the least. I tried the Zephy pizza; it tasted very simple and basic. Like something you could make at home. I expected so much more taste and flavor. The goat cheese they add to the Zephy ruins the flavor. Honestly, Pizza Hut and Jet's pizza make much better pizza for a fraction of the cost, haha. I don't see what the big hype is about Homeslice. Their pizza sucks and is overpriced. <br>Like one user said previously, you're not paying for the food. You're paying for the atmosphere that they have.", "pics": null}}, {"review": {"des": "Perfect! Just what I needed on a cold, dreary January day. Nick, our server, was a ray of sunshine. Positive vibes!<br><br>Teve pizza by the slice was great. We had the chicken lime soup and mushroom soup. Generous and delicious. And those Xmas decorations are off the charts. Thank Homeslice for making my birthday lunch the best.", "pics": null}}, {"review": {"des": "Great local place with a nice rustic type of feel. At Christmas time they go all out with the decorating and it's pretty impressive, especially for a local pizza place. They also have a fair amount of outdoor seating in the summer in the back and the side of the restaurant. <br><br>I've been here about 4 times in the last few months and they've been pretty good all those times. I want to make it my local spot to recommend, but for some reason that I can't quite put my finger on I can't say it's amazing. The service is usually fine, but they are sometimes slow even when it's not too busy. <br><br>So that's why 4 stars is a solid rating for me. I'd still  go back and would recommend to others to try out, but I won't swear to anyone that it's the best pizza spot in town.", "pics": null}}, {"review": {"des": "Homeslice has all the ambience. It has the L right next to it and some very fun drinks. When it is a nice night, they will open up the garage doors and let the natural air in which adds to the ambience. The environment and drinks of homeslice are 5 stars but the food fell just a bit short of 5 stars. Maybe I just ordered the wrong pizza pie. The jalapeño poppers were a solid appetizer though. <br><br>I would absolutely return or recommend Homeslice to a friend, but there has to be better pizza places in the greatest city in the world.", "pics": null}}, {"review": {"des": "Went out of my way to come here and watch football on the patio for the 2:30 game. Was told by the hostess the TVs weren't on because of rain in the forecast. There was no rain in the forecast until after 9:00 or so. Asked if they would be turned on and was told no. So we got seated in the dark dining room. Later I went to the patio to check it out and people were out there watching football on all the TVs. Pizza is average at best. People are not coming here for the pizza. They are coming for the atmosphere and the hostess was so uninterested inmeeting my needs so needless to say I am on my way to another establishment to watch football and enjoy cold beer on this beautiful day. <br><br>Update: The owner reached out and apologized. Also, he said all weather TVs were installed. I will visit again. I must say I have been visiting their new place Paradise Park in Wicker Park and have had a great experience there.", "pics": null}}, {"review": {"des": "Good pizza, good food, good drinks. the service was also good. It wasn't pack when we came , so we were sitting right away.  <br><br>I have nothing negative to stay about this place.  You won't be disappointed.", "pics": null}}, {"review": {"des": "This review is for delivery. Far too expensive for mediocre frozen-crust pizza. Overly greasy. Poorly constructed. This is Chicago, no reason to put up with such nonsense in a pizza.", "pics": null}}, {"review": {"des": "I'm lucky to have Homeslice nearby. Atmosphere alone, this is a great place to bring someone who is visiting. It has a bar-type feel and is extremely noisy, but at the same time, it makes it easier to chat with someone at one of the community tables.<br>The pizza might not be authentic to Chicago, but it's still very good. My go-to is always a veggie filled pizza that I can add pepperoni to. What I love about Homeslice is that their ingredients taste fresh and they have an insane amount of options like artichokes, different pasta bases, feta, and more! Notice how I stopped after the important toppings? ;)<br>Also, I asked for a Michelada (of course!) and even though the waitress had no idea what it was, she was patient enough in letting me explain and getting me one from the bar that I could make.<br><br>My only complaint is that this place gets really packed and they randomly do counts in the restaurant so they won't let you in. On a cold day, that is never fun.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/16m6QHABFL1_PWiizOSS8g/348s.jpg", "caption": "Small cut into 4 large slices"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/yKMbXwdPme9_trrtjC2h_g/168s.jpg", "caption": "Hugghes delight with pepperoni"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/jHOHcsMNqgoT5ZXr7UJI4A/168s.jpg", "caption": "Hugghes delight"}]}}, {"review": {"des": "We stopped over at homeslice to have a beer and try to wash the sour taste down from our not so great lunch experience from another establishment.  The place was all lit up with Christmas lights hanging from the ceiling. It was amazing and hard not to get lost as you gazed at them.  There was a good crowd inside having the grandest of times.  Our server was super friendly and did a wonderful job taking care of us.  If you like koozies then your going to love this place.  They give you a koozie with your first beer that comes in a can. I collect them and was stoked when I found out. We can't wait to come back and have a few cold ones and try out the food (it smelled delicious and made us wish we had eaten lunch here).", "pics": null}}, {"review": {"des": "Pretty good pizza, lots of different options, the vegetarian pizzas here are pretty nice. Full of flavours, also liked their breakfast pizza", "pics": null}}, {"review": {"des": "This place is fantastic! The food is great, but I really love the atmosphere.<br><br>Came here for brunch and they were playing fun music. The decor is cute and trendy, with instagram-able signs and rustic high-top tables. I started off with a Bloody Mary which came with a beer chaser and was topped with a mini slice of Hawaiian pizza. It was a really good Bloody Mary, with just the right amount of heat. My friends' drinks came in cute gummy bear-shaped cups.<br><br>To eat, we had a sesame soy salad, a Sheffield salad, and the breakfast pizza. The salads were tasty and light and had just the right amount of dressing, and were a great complement to the pizza. The pizza was DELICIOUS - the eggs were cooked to a perfectly runny yolk, and the bacon was crispy but not overdone. <br><br>Highly recommend this place!", "pics": null}}, {"review": {"des": "You can't go wrong with Homeslice! Always great at the restaurant or delivered! Fan favorite! Never thought potato skins would be good at a pizza pace but they are amazing, a must try if you go there.", "pics": null}}, {"review": {"des": "Gluten free crust that you can actually pick up with your hands, that's chewy and flavorful and doesn't leave you starving. I'm a fan! <br><br>I wish there were more unique options for vegetarians, or a place on the menu with all of the toppings listed so it would be easier to build your own vegan pie. But regardless, I really enjoy the pizza here!!", "pics": null}}, {"review": {"des": "I enjoyed the atmosphere and the pizza was pretty good as well. The crust was the best. Did not enjoy the marinara as much. The cookie dough bites were absolutely delicious. I wish the wait staff was not so busy as they were a little neglectful at keeping our water full without us stopping them and asking for a refill. All in all a good experience and we will visit again.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/gVvqBgmb3lRCAZn4KT1ybg/348s.jpg", "caption": "Atmosphere"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/9Z3Ifu79eCTV0VgQpd203A/168s.jpg", "caption": "Cookie dough bites"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/L-UXnurobdyUn5LjbSn22g/168s.jpg", "caption": "Italian sausage pizza - pineapple and spinach pizza"}]}}, {"review": {"des": "Wow this place was awesome. From the great service to the delicious food and also great outdoor seating. We got the buffalo chicken pizza which was amazing and also some appetizers. My other fdiends got the calzone and smaller pizza which they loved as well. Most definitely will be comjng back here for some good tasting food and overall good time!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/B2nSr9ZxQYKq-EmbDbwdtg/348s.jpg", "caption": "Great taste and great quality food!"}]}}, {"review": {"des": "Given a terrible table underneath a portion of the roof that was dripping (patio). Will not be back", "pics": null}}, {"review": {"des": "This is one of the best pizzeria's in the Chicago land area. I went here with a few family members and we had a blast. Our server's name was Nick and he was the <a href=\"/redir?url=http%3A%2F%2FBomb.com&s=716853a54974befb18bd2a2079d876386c9ebd876290947c699fc1e3eaccf129\" target=\"_blank\" rel=\"nofollow\">Bomb.com</a>. I have a little cousin who is 10 years old and Nick could tell that she wasnt having the best day, soo what did Nick do he sang our order and put a huge smile on her face. Not just the service was good, but the food was AMAZING!! I had the meatball pizza and the flavor and melted cheese was exquisite. 11/10", "pics": null}}, {"review": {"des": "The staff here is phenomenal. Nicole is always sweet and welcoming at the host stand. Our server, Megan W, made sure we were well taken care of throughout our meal. Super friendly and overall great place to get some quality pizza. Also def the place if you like goat cheese (I think it's disgusting but that's ok) Food is great. Drinks are great.", "pics": null}}, {"review": {"des": "Loved this atmosphere. It's full of wood log walls, hanging lights, and copper walls. The pizza was incredible and the 6-Pack cooler was a surprisingly good deal that came with a koozie. Plus they have Do-Rite donuts which was a pleasant surprise. The service was phenomenal and the amount of TVs to watch football is incredible. Highly recommend.", "pics": null}}, {"review": {"des": "4.5 out of 5, but gave the 5 since there wasn't an option for halves. <br><br>I must say, this place is a lot like Blaze Pizza but with better crust. It was good, but didn't live up to the hype. I thoroughly enjoyed the pizza though (Got the Alo-Hot). It was a nice idea, but wasn't as hot as advertised.<br><br>Customer service was great and the vibe was awesome. A nice sports bar feel, with a little touch of a rustic cabin. <br><br>I'd come back, but only to try some other items.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/PI327l2P4F-My0fSUBlzRw/168s.jpg", "caption": "Mozzarella Bread Sticks"}]}}, {"review": {"des": "This place is super cute! Their patio is one of the best ones I have seen in Chicago! The inside is like a log cabin! I assume it's super cozy in the winters! Their food was delicious! We tried their stuffed jalapeño, salad and two different pizzas and everything tasted great! Most or all I loved their staff! Each one of them were friendly and really nice the whole time.. right from the hostesses to the bartender to the server! Love to see happy faces! Will be going back real soon!", "pics": null}}, {"review": {"des": "Only reason why Homeslice got 4 was because our service was a little bit slower than I would like( super slow on the drinks).  Other than that this place is 5 stars! Such a cool, fun, hip, and IG backdrop heaven. The ambience was so lively but the food stole the show. We ended up getting the knife and forked and the sammilton pizzas. And we were left satisfied!! The breadsticks were decent as well as we had them with ranch ( their ranch is very good) and left no survivors.  Enjoy!!", "pics": null}}, {"review": {"des": "\"I could give up pizza but I'm not a quitter\"<br><br>Couldn't agree more with their slogan. After coming here with some friends, I have to say that this might be my new favorite pizza spot. Although I'm a bit bias since the owners are from Oregon (being that I'm a UO alum and was born & raised there). But mostly because the ambiance/wooden decor simply reminded me of home.<br><br>The menu here is insane, 30 different types of pizza? There's literally an option for everybody. They have gluten-free and non-dairy pizzas but if that's not enough, you can even customize your own. Not in the mood for pizza? Don't worry, they have salads too. I know what you're thinking, who goes to a pizza place to eat salad? Not gonna lie the table next to us ordered one and it looked bomb.<br><br>After facing a difficult decision of what to order, I decided on the Benny-B. It had Italian sausage, green peppers, black olives, mozzarella, provolone, and marinara. It was super tasty! I got the small and it came with 4 pieces for $12. Not a bad deal at all.  Ended up having left overs too. I also noticed that they had a few pizzas with cream cheese. Haven't seen that anywhere else before, might have to try one out next time!<br><br>Overall, this place is AWESOME. I really look forward to coming back during the warmer months to enjoy the outdoor patio seating.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/B0oQIfmWMjrnlnJA40xPNg/348s.jpg", "caption": "Party boi"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/4rYvPCQIqc273xM0Vsxxcw/168s.jpg", "caption": "Funky mcchicken"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/pHMmi7OBoq2Azb57obkw9g/168s.jpg", "caption": "Jalapeño homies"}]}}, {"review": {"des": "Service was great, atmosphere was chill and cozy, and pizza was delicious. It's not deep dish-it's pan pizza and it's yummy! The crust was buttery and the personal size is more than enough for one. Tons of beers on tap and that patio is perfect for these warm summery days!", "pics": null}}, {"review": {"des": "Awesome place with delicious food and drinks!!! Love love love! If you can and it's nice out, seat at their back patio!", "pics": null}}, {"review": {"des": "Waitress gets 5 stars. Pizza gets 3.5 stars. Burrata gets 5 stars. <br><br>The bartender who I saw pour Svedka in to my $9.00 \"Tito's/Soda\" drinks does not get any stars. I truly don't think this was the fault of the waitress, she only went to pick up the drink. I was staring right at the bar and saw him poor Svedka into my Tito's and Soda that was the drink I was served. <br><br>Not OK Homeslice! Aside from the sketchy bar service, cool atmosphere and decent 'Za.", "pics": null}}, {"review": {"des": "Great pizza options they have here. Few people have been recommending this place to me for a while now. I'm glad I tried Homeslice. Left very satisfied and full.", "pics": null}}, {"review": {"des": "I went here for brunch on a Saturday morning with a group of friends as I heard it was a popular spot. We made reservations as people said it can be quite busy.<br><br>When we arrived we were promptly seated. The hostess and servers were very friendly and welcoming and went over the menu with us. For appetizers we went with Potato Skins and Bread Sticks with Goat Cheese which were tasty. My friends also ordered Bloody Marys which seem to be one of the more popular items on the menu. They come with a small beer and a slice of pizza through the straw which is pretty creative. For the main course we went with a breakfast pizza, Hawaiian pizza, and an Italian meat pizza. The pizza was decent..the bread, cheese, and meat did the job but I wasn't wowed by it. It was definitely a step above delivery pizza like Papa Johns but nothing spectacular. The bill came to be about $20 a person for our group of 6.<br><br>I would say the food here is typical of your American Cuisine. Just don't expect any flavors that overwhelm your taste buds and you won't be disappointed. The appeal of this place seems to be its novelty drinks and social atmosphere.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/6zifauIX0dRJafuCrgJU-g/348s.jpg", "caption": "Bloody Marys"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/4B7S_DaR57e6BKdK4igPOQ/168s.jpg", "caption": "Hawaiian and Italian Meat Pizza"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/4y0HttNoE8nduBj3v7ySuQ/168s.jpg", "caption": "Breakfast Pizza"}]}}, {"review": {"des": "Best pizza (Knife and Forkner is my personal favorite). Fun drinks (especially the Grapfruit Radler). Amazing atmosphere that is always instagram-worthy. Goat sticks are life changing. <br><br>Always have great service here. It is my go-to place on a more than regular basis.", "pics": null}}, {"review": {"des": "Great food and great aesthetic. Loved the bread sticks with goat cheese marinara sauce. Pizzas were good too. Will def be back", "pics": null}}, {"review": {"des": "Great pizza. Got a gluten free vege and meat pizza and was not disappointed. Good music, a little too dark in the interior for my taste but whatever. Can't wait to come back and try more.", "pics": null}}, {"review": {"des": "Cute, hipster pizzeria near DePaul. I appreciated that we were carded at the door, I know some people are in to that kind of thing. I came here with a friend on the first NFL game of the season which was on a Thursday night. It wasn't too crowded at all and the service was great. I had the Boyler Room pizza, which is cheese and pepperoni. But the menu had several options! The small size portion is big enough to split but if you don't like sharing-that's ok too! <br><br>It's under the L so if the noise bothers you, I suggest you don't come here.", "pics": null}}, {"review": {"des": "Met a friend here while I was in town.  I didn't really know what to expect, considering it was a pizza joint. We met for brunch. The options sounded amazing. They had a brunch menu, which I ordered off of. They also had their regular menu, which my friend ordered from. Both equally as delicious! The pizza my friend got not only looked and smelled amazing, but tasted great! I had the avocado toast- if you want something other then pizza for brunch, great choice!!!! It was perfect! We order mimosas, perfect amount of champagne and oj! We ordered a round of beers/drinks after that. Each can came with a coozie! How cool! This to me was very exciting. It definitely helped me remember the place I ate at later in the day. Not only was the food good, but our service was amazing! Our waiter checked in on us as needed, but never rushed us or made us feel like we had to order or hurry up! I would highly recommend trying this place out if you get a chance!!!", "pics": null}}, {"review": {"des": "One of the best pizza spots in Chicago! Only problem is I'm not wild about the crowd. Only go if you're with a group and don't plan on socializing with other bar go-ers. Great vegetarian options and I have a friend who loves their gluten free pizzas. Decent prices and service. Also their patio is awesome !!", "pics": null}}, {"review": {"des": "This place is a must if you haven't been or are out of town! The food is pretty good, lunch specials, lots of options, and yummy cocktails. The atmosphere is fun and you'll be taking pictures while you're there. So many fun and cute signs and places to take pictures. It gets pretty packed on weekends and nights, but it's worth the wait. The staff is very friendly and if you have any allergy restrictions they'll help you out. Whether you want pizza, salads, snacks, cocktails, or just a fun place to grab drinks and get those gram pictures- this is your spot!", "pics": null}}, {"review": {"des": "Ordered through Caviar. Ingredients on the pizza were wrong. Way overpriced.", "pics": null}}]}