{"name": "honey-butter-fried-chicken-chicago", "reviews": [{"review": {"des": "Oh my gosh, wow! This food was soooo good. I was a little sticker shocked at first, but tip is included in the prices. We both got a basket of chicken strips, but one to share would have been plenty. Sides are big enough to share with two people--we tried the pimento mac and cheese and smashed potatoes. Potatoes were a little runnier than I like them, but still good. Also tried the corn bread; delicious but for the amount, I think the price is high. Honey butter is amazing and the breading on the fried chicken is just the right amount of spice. I will for sure be back and be recommending to friends. <br><br>Oh, the seating situation is a little weird. I'm not a fan of community seating, but folks are in and out fairly quickly so it's not too bad.", "pics": null}}, {"review": {"des": "All around great spot. Warm, friendly staff. Delicious food (just when I think I'm going to become a vegetarian!). Great patio and casual and fun, lively decor. <br><br>Menu has some amazing unique food. A little overpriced but worth it. Chicken tastes fresh, not greasy, pimento mac and cheese is amazing, corn bread is okay.", "pics": null}}, {"review": {"des": "Came here on a Sunday afternoon and it was pretty packed but they get people moving. If you're dining in, you wait in line to order and they'll help find you a seat. (They also have online ordering for delivery, pick up, and catering!) <br><br>Our entire order came out to about $53. I know this seems pricey but please don't get discouraged because the gratuity comes with the service. <br><br>The service was great and our food came out fast. Chicken was good; not too greasy and seasoned just right. Really enjoyed the honey butter on everything especially the corn muffins. <br><br>Wish the space was a bit bigger. You can tell people want to come here and eat but the line can get long and seating is limited when it's busy. Highly recommend and will definitely be back.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/AXzbnMulFnwLVe-l_Y-lYA/348s.jpg", "caption": "8 piece chicken came with honey butter and 6 corn muffins"}]}}, {"review": {"des": "Stopped in for dinner here. The service is really quick and we didn't have a problem finding seating. I tried the OG fried chicken sandwich. Then we split the broccoli potatoes and cream corn sides. <br><br>The sandwich was really good, I enjoyed the slaw on top of it. I also really liked the green Thai curry sauce with the creamed corn. It's definitely worth checking out!", "pics": null}}, {"review": {"des": "This is a place that I have been wanting to visit for a while now. As a foodie, I am always excited to try the latest trend. This place did not disappoint! <br><br>I was initially surprised at how busy it was when we arrived on a Saturday around 3:30pm. There is some cool, hip and unique decor in this very cozy space. The line was at the door and a regular informed us that you order and then you will be seated by the hostess. Seating is limited and you may be standing for a few minutes before for food arrives. Additionally, due to the unique seating arrangement you may sit very close to strangers, or 'new' friends, depeding on how extraverted you are.<br><br>We each ordered a two piece meal that comes with two cornbread muffins and a cup of that famous honey butter! Upon ordering I was encouraged to try the chicken with the butter, which is a must in my opinion, since it's in the name. We also ordered the whipped sweet potatoes, which are a limited time item, along with a soft drink cup which gives you freedom to try their craft, cane sugar, sodas.<br><br>The chicken was very well seasoned and juicy with a crispy exterior. The honey butter added a subtle, yet tasty contrast to the spice of the chicken. The sweet potatoes were FANTASTIC! They are the perfect fall side dish, warm and rich with a little spice and the classic addition of freshly toasted marshmallows on top. I also tried the Goose Island Spicy Ginger soda, which was delicious and smooth! <br><br>Great experience, I'm not a fan of the community table seating, but everything else was great!", "pics": null}}, {"review": {"des": "WOW! I came here after hearing all the hype and it 100% lived up to my expectations.<br><br>It's a super cute little restaurant where you order up at the cash register. I got the honey butter fried chicken sandwich and a side of muffins with honey butter... because you have to get as much honey butter as possible.<br><br>The food came out so quick. I really appreciated it! AND i picked up my sandwich, which was full to the brim, and honey butter is all over it. It was a delicious, but seriously messy meal. I can't get over how perfectly crispy the chicken was and the honey butter added a nice sweetness to it. <br><br>The little muffins- wow! I was worried they'd be a little dry, especially because the point is to dip them in the honey... it wasn't at all. They could be eaten alone or with the butter... and I dunked them all in the butter. I'd definitely tell anyone to try here.", "pics": null}}, {"review": {"des": "This place probably doesn't need me to tell you how good it was! I got a to-go order of the original sandwich BUT on a biscuit! Good lord, it was good.  I'd come back again and again for that sandwich! It was drenched in honey butter. I am convinced that the honey butter and fried chicken were previous lovers, perhaps in a different dimension, reunited here at HBFC.<br>-Oh yea, I got some other stuff too but nothing to write home about. The Mac and cheese was... different. I make a mean Mac n cheese myself and I appreciate variations of the recipes that exist but  with Mac and cheese I like to keep it simple. Their Mac n cheese wasn't my cup of tea. Regardless, I didn't come for their sides, it was all about the chicken and that chicken was BOMB! <br>Sorry about my picture, I'm always too hungry to care what the best angle was.", "pics": null}}, {"review": {"des": "I think this restaurant is a good place to try because it's different. I've been here a like three times and the most recent time, I ordered the 8 piece of fried chicken with a side of their pimento Mac and cheese. The chicken is boneless and comes with their famous honey butter spread. The honey butter adds sweetness to the chicken. It's not bad. The pimento Mac and cheese is really good.  <br><br>As you can see in the picture, they only give you one butter for my big 8pc order which I don't think is enough. It cost $2 per additional honey butter. Also the 8pc is $32 so that's $4 per piece. I don't think it's worth the price.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ps2HSl6MWw76rC5GOb8Neg/348s.jpg", "caption": "8 pieces of fried chicken & pimento mac & cheese"}]}}, {"review": {"des": "Came here on a busy Saturday afternoon and there was a bit of a line. Fortunately, it moves quickly, and since it was a nice day there was some seating open outside. The food came out in about 15 minutes. I ordered the strips with honey butter, and a side of Mac and cheese.<br><br>The strips were tasty, but I guess I was hoping for \"amazing\" because they weren't quite as good as I expected. The honey butter was really good but they barely give you any, so I had to go buy a ranch because I ran out after eating a few strips. The ranch is greenish-colored because it has some herbs in it, but it tasted a little too much like a vegetable for my taste. The Mac and cheese was interesting, as it was orange-colored and not quite what I expected, but it tasted decent.<br><br>Overall, the place was decent and reasonably priced, but I wish they'd give you more honey butter with your chicken. I won't go out of my way to go back but I would stop in if I was close by.", "pics": null}}, {"review": {"des": "The line was a bit long on a late Saturday afternoon.  There's an indoor and outdoor dining area and the food is brought out to you order at the counter. Then menu wasn't limited, but it didn't have a large variety either. You guessed it, mostly chicken. But what did you expect? <br><br>I ordered the 2 piece fried chicken, which came with a drumstick and a chicken breast. The seasoning on the fried chicken reminded me of a mixture of Cajun dry sauce. The meal came with 2 corn bread and honey butter. The honey butter was pretty good, but they gave a very small portion. The meal ran around $9 and I ordered a side of \"smashed\" potatoes, which was around $4 and some change. The gravy itself was okay, but didn't taste like much to me. <br><br>The price was pretty decent considering you're not expected to tip and they acknowledge the fact that they pay their employees a fare wage and provide benefits, which is a plus!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/VLfNuVWaov-YosPFt877Gw/348s.jpg", "caption": "2 2-piece Fried Chicken"}]}}, {"review": {"des": "Line was out the door on my most recent visit to Honey Butter Fried Chicken on a Saturday afternoon. The wait was no more than 15 minutes. I shared my order of the 4 Piece Chicken, half breast, half thigh, Hot Buffalo sauce,  Wisconsin Blue Cheese sauce, and the pimento Mac and Cheese. The 4 piece chicken order came with 4 biscuits and a generous scoop of honey butter.<br><br>Chicken breast can be difficult to keep juicy. The chicken breast at Honey Butter was on the more dry side. It needed extra love from the honey butter and/or sauce. The thigh was much juicier. Although I enjoyed the level of seasoning on the fried chicken, I felt like the coating could have been crispier. It didn't have that crunch that you could hear like some other fried chicken joints. <br><br>Mac and cheese and biscuit was good. Mac had a nice kick from the pimento. It's not a gooey, stringy, melty cheese type of mac. It was a simple, rich cheesy flavor type of mac. The biscuit was well balanced. Crisp on the outside. Fluffy on the inside. Very delicious with the honey butter.<br><br>If I were to purely judge Honey Butter on their fried chicken, I would argue that you can get a better bang for your buck for just as good, possibly better fried chicken at your nearby fast food fried chicken shop. Honey Butter Fried Chicken does offer a nicer dining experience and ambiance, especially in their outdoor patio, if that's what you're looking for.", "pics": null}}, {"review": {"des": "I've been following HBFC for years on instagram and drooled at their crispy fried chickenny goodness. Needless to say, the expectations were pretty high when I finally visited for the first time. Perhaps I built them up a bit too much?<br><br>Per the order takers suggestion, I ordered their classic 2 pieces of fried chicken with biscuits and a peach lemonade. It's set up like a fast casual spot - order and pay, then sit and the food will be delivered. We had a seat outside on their pretty and rather large patio and waited for the food to arrive.<br><br>My chicken was good. Don't get me wrong. It had a thick and crispy coating wrapping up some piping hot chicken. The biscuits and honey butter were also tasty. Maybe fried chicken just isn't my favorite thing, but I didn't feel like it was the greatest thing I've ever had. <br><br>My peach lemonade ended up being $5. $5 for a lemonade? That was a bit outrageous. Not to mention I asked one of the food runners who passed our table if I could get a refill and they told me to go inside and ask for it. I stood in the back room area that appeared to be a bar/take out food area with a line of other people and just waited as it wasn't very clear who to ask.<br><br>While I had an alright time and could see their patio as a fun summer spot, I don't know that I'd go out of my way to visit here again.", "pics": null}}, {"review": {"des": "I think the name of this place makes it obvious why you should eat here. The best way to describe this place is that they serve good fried chicken that tastes even better when you cover it in the honey butter they give you. Totally worth the run later to burn off those calories. <br><br>I usually have the chicken strips when our friends order it in. I did finally go to the restaurant and try the breakfast sandwich which was really good! I enjoy the chicken here however I do find it a little bland unless I put honey butter on it. Maybe I'm so used to eating it with honey butter that it doesn't taste right without it. Still this is a place you should definitely try!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ns8AM_hYTNBnsig4DLNTNw/168s.jpg", "caption": "Chicken strips. IG: betweencupcakes"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/LmUMJNJDKJhINlJQBtlu7w/168s.jpg", "caption": "Chicken on a biscuit! IG: betweencupcakes"}]}}, {"review": {"des": "This chicken was pretty damn good, especially with the honey butter on top!  One side that you must get if they haven't ran out of it is the mashed taters and gravy.  The gravy is lighter than most places, but it has great flavor.  Someone at our table ordered the buffalo wings which I remember being just OK and would pass on.   Their dipping sauces are pretty good, the garlic aioli and honey mustard were the favorites.   So pretty much you can't go wrong with the fried chicken w/ corn muffins and the mashed potatoes.", "pics": null}}, {"review": {"des": "Best fried chicken and mac n' cheese place I've ever had... hands down! Chicken is fried exceptionally well almost to a science! I'd like to think of this place as my secret gem, but I think people in Chicago are beginning to take note. I took 2 of my coworkers here and they stuffed themselves to a coma. The food was that good and their pop isn't from your typical big corporations like coca cola and Pepsi. <br><br>In terms of the location and space, I don't really like it. It's a small place located on an intersection   with little traffic. Best way to get there is to drive or rideshare. Not much place to sit and if you go at the wrong time you probably won't get to enjoy your meal inside. But please don't let this paragraph deter you from trying their delicious chicken. I eat chicken everywhere I go and I'd come here everyday if it wasn't located on the opposite side of the city.", "pics": null}}, {"review": {"des": "Comfort food to the max! The best fried chicken in the city with an awesome staff to match!! Ive been coming here since year 1 and theres a reason its still packed 5 years later. <br><br>All you gotta do is PUT THE BUTTER ON THE BIRD!! I love everything here from the drinks to the bird itself! <br><br>I usually order the fried chicken breast which comes with muffins & for sides smashed potatoes and creamed corn. The drinks are made so well and very unique with a separate bar area inside as well. <br>The outdoor patio is my fave and perfect in the summertime or a nice fall day. They have the majority of seating out there with cute lights for nighttime. <br>The perfect way to end a visit is with some of their yummy desserts!!", "pics": null}}, {"review": {"des": "The hubby and I tried this coveted chicken for the first time tonight. Starving at 7pm on a Friday, we opted for pick up and lasted about 5 minutes before pulling over on the side of the road to chow (we never make it home!). Lol. Anyways, my first reaction was: holy cow, why have I never had honey butter before?! This sh*t is tasty. I got the honey butter sammy, and he got a basket of like 4 wings with cornbread. We got the mac n cheese and coleslaw too. My personal advice - skip the sides.<br><br>All in all, a great chicken joint in Chicago, serving up something so distinctly unique yet simple: honey butter!!!! I could honestly slather this stuff on everything and eat it with a spoon morning, afternoon and night. It would have been fun to dine in, but I'm glad we skipped the wait.", "pics": null}}, {"review": {"des": "Amazing atmosphere and really great service from the staff! Happy to suggest and help you pick from the menu! We tried the basket of chicken strips and their chicken sandwich and their super amazing honey vanilla shake!!!!", "pics": null}}, {"review": {"des": "Came back a second time, and still agree with my original opinion. Fried chicken is a personal preference, and the flavor at HBFC, while unique, isn't my preference for fried chicken. This round was crispier than the first, so that I enjoyed. The batter is just more of a sweet rather than a savory. <br><br>We came for bunch this time. I got the chicken and grits, which was fine. I wanted the tenders to be separate, but in this dish, they come mixed in with the grits and hot sauce. The Bloody Mary has a chicken wing in it...cute!<br><br>Overall, I'm glad to see a local Chicago joint getting some acclaim. I definitely recommend trying it, because fried chicken is a personal preference!", "pics": null}}, {"review": {"des": "Well. Picked up about 20 min before closing. Everything seemed okay when we started eating. However, my boyfriend pulled a hair out in his mouth on the first bite of his chicken sandwich. The Mac and cheese was mediocre. The creamed corn was pretty good, that was my favorite part. I was extremely disappointed in the muffins, they were stale and hard. They should not have allowed anyone to pay for those. Tried calling the restaurant but it was closed. My boyfriend said he is willing to try it again but the jury is still out on that for me", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/lkVGQVeZrupvk9FUIwa4QA/348s.jpg", "caption": "The culprit that had hair in it."}]}}, {"review": {"des": "Small place to eat. Outside is bigger in the back. It was a decent system for us when we came in. Order your food to the right side of the register, they give you a tag and you find a place to sit. When I went it was super busy but even though I waited for my meal to get placed I didn't wait for a seat because usually someone was done eating and they got up and left. <br>The chicken was great. There was no pink in it, and I thought it would have bone, but it did not have bone in. The sides could have been done better honestly. But I can see why people come here for the honey butter.. it's a creamy sweet butter to each with your chicken! Not a fan of their biscuit it was very dry to me. <br>Tried this place once. A little to pricey for what it comes with but I liked it!", "pics": null}}, {"review": {"des": "my friends had told me a lot about this place, so we stopped by on a Saturday around 1. It was pretty crowded, but the staff immediately greeted our large party and told us they'd clear a table. The atmosphere is adorable, and you order first and then sit down.<br><br>We shared the fried chicken that came with honeycomb cornbread pieces, along with a side of pimento Mac and cheese. The chicken and honey butter were easily the star of the show, while he Mac and cheese was very orange and pretty good. The cornbread was decent but a little dry, but it still complimented the chicken nicely. The blueberry mojito was SO good, and they also have brunch options as well that looked delicious!", "pics": null}}, {"review": {"des": "There isn't anything I don't like about this place EXCEPT for the fact that they haven't inducted their version of the Nashville Hot Chicken! I am hoping in due time..if only limited <br><br>With my husband working in the area, he frequents this place more than I get to but I always ask for him to bring me a side of pimento Mac n cheese. Stuff is made of pure magic. <br><br>Love the collabs with Piece Pizza as well. Can't go wrong with fried chicken and pizza...like ever.", "pics": null}}, {"review": {"des": "This specialty food is okay at best.  8 dollars for a mediocre chicken sandwich and 4.50 for a single scoop of potatoes is ridiculous.  How about lowering your prices and you might actually pack the place. You'll go the way of Quiznos. <br><br>I'll go to The Roost. Better food and you get 2 sides for what I paid for the sandwich here. Won't be back", "pics": null}}, {"review": {"des": "I wish I lived closer to this wonderfulness of Honey Butter Fried Chicken - easily one of the best fried chicken spots in Chicago. <br><br>What makes the chicken unique is the seasoning they put on the chicken and of course, the honey butter!!! I literally smother it all over the chicken and the corn muffins! I haven't tried any of their other sides, but the mac and cheese looks good as well. And of course to add to my \"southern\" meal, I had to add a sweet tea (yay because they are refillable).<br><br>The line when you get in seems intimidating, but there's a nice large patio with a lot of seating area (I have not been here during the winter, so I'm not sure if the patio gets covered or not). The employees are also super nice and help you find the seat once you're done ordering.", "pics": null}}, {"review": {"des": "People rave about this place, but as someone who grew up in a southern family that was pretty much raised on fried chicken of all kinds I can honestly say this place ain't nothin' special. The secret sauce is just honey and butter which has been a known good combo by anybody who has frequented Popeyes in the last 30+ years. <br><br>Prices are just straight up ridiculous. No amount of marinading or spices justify the wallet gouging here. I spent $30+ and ended up with 4 pieces of chicken and a chicken sandwich. Not only that, but the chicken was burnt, an unedible black on some parts, the rest dry as a bone. If they're marinading or adding spices you sure can't taste it, everything is just bland.<br><br>The good reviews have to be coming from the log cabin chique dining experience since the food isn't where it's at. Other times when I encountered Honey Butter was from catering, there was always plenty of food leftover since nobody particularly cares for it. <br><br>Overall, I can't recommend this place. Food is way overpriced for pretty standard fare that could be served up in a school cafeteria. Don't know why this place is so successful considering the premise is based on a fraction of the Popeye's/Louisiana cultural experience.<br><br>2 out of 5 stars", "pics": null}}, {"review": {"des": "A fun place to chill with friends in the summer! We came here on a Friday evening and were able to get seated in the patio in the back of the restaurant. You order your food at the counter and they bring it to your table. <br><br>We ordered a pitcher of candied jalapeño margarita ($40) which was delicious! Perfect balance of sweet, sour and spicy. I ordered the HBFC salad with fried chicken strips ($12.5). The salad was definitely on the smaller side, which was unfortunate considering the price. It tasted great but just wasn't filling. We also got a muffin pack ($4.5) which comes with 5 corn muffins and their famous honey butter. All of the corn muffins are pretty small (bite sized) but still tastey. My friends also enjoyed their meals. <br><br>Food and drinks are great, but just make the portion sizes bigger!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/rTvmp7SQPsw9M71tLlIBUQ/348s.jpg", "caption": "Margarita, fried chicken sandwich with muffin pack, 2 piece fried chicken, HBFC salad, and wings"}]}}, {"review": {"des": "Freaking awesome. My wife and I came here for lunch on vacation on recommendation from yelpers all I can say is wow. The food was excellent and the staff was incredibly warm, attentive, and engaging. We'll be back.", "pics": null}}, {"review": {"des": "This place did a great job of transporting me back to the Texas favorite Whataburger, which is famous for their honey butter chicken biscuits. The chicken was fried to perfection, the corn bread was AMAZING, should have gotten more in retrospect. The honey butter is a simple concept but delicious. The biscuits were baked to perfection. Also had the pimento mac and cheese, which was good but I'm always a fan of more real melted cheese in my Mac and not pasta swimming in cheese sauce. <br><br>All in all great experience, get the chicken sandwich and the fried chicken with corn bread. Skip the Mac and cheese.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/EQnlt1LSrhU4a3SHycKfnw/168s.jpg", "caption": "Chicken Original Fried Chicken Sandwich  a.k.a. \"The OG\" and pimento Mac"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/HtuggCAfF5vmFrnF1pKDGA/168s.jpg", "caption": "Two piece of friend chicken and kimchi"}]}}, {"review": {"des": "This was our second visit; the previous time was soon after the restaurant opened.  We observed that the limited but consistently high quality menu at this fast-casual spot has won a loyal following.  The tiny dining room was packed as tight as a chicken coop and diners were opting for the spacious patio despite the oppressive humidity (where do they go in the winter?).  The counter person who took our order and the runner who served our food were friendly and efficient.<br><br>Is theirs the best fried chicken we've ever tasted?  No.  But it's unique, different from the classic southern pan-fried variety and considerably better than what I suspect passes for chicken tenders at some fast food joints (pulverized beak?).   Theirs is crisp and greaseless on the outside, remarkably juicy on the inside, subtly seasoned, and served steaming hot.  The wings have a different breading than the other parts (at least that's what our server said), everything except the drumsticks is boneless, and they provide a little ramekin of their namesake honey butter to spread on the bird.  Well, I prefer my chicken bone-in, and I spread the honey butter where I think it belongs--on their cute little corn biscuits. <br><br>But the ingredients are top quality and locally sourced.  This extends to their sides and beverages.  I've tried all of the sides and my fave is the so-cheddary-it's-orange pimento mac & cheese.  My Missus' fave is the decadent schmaltz (rendered chicken fat) smashed potatoes.  The booze list features a broad selection of trendy local craft beers and artisanal cocktails.  Instead of mass-market soft drinks, they serve 100% cane sugar sodas and house-made lemonade.<br><br>The prices, steep for fast-casual, might peck a hole in your wallet.  Their chicken costs in the ballpark of $4.00 per piece and chicken dinners include only biscuits.  Sides are an additional $4.50 each.", "pics": null}}, {"review": {"des": "The butter With the corn muffins are the real the gem. Overall everything I have had has been fine, although pricey for the portion size. The chicken itself sometimes lacks flavor so I prefer to get the buffalo chicken sandwich for more flavor.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/s-zCnK_O0Ql5dTetjh0OZA/348s.jpg", "caption": "Chicken and muffins"}]}}, {"review": {"des": "Tough for me to say this, but I think Honey Butter is a little overrated. This is one of those reviews, where I'm torn about how many stars to rate this place. Sure I do like that they pay their workers well and you don't have to tip, source their foods from local businesses and etc, but the food can definitely miss on certain aspects.<br><br>It had been a few years since my brother brought over some food from HBFC a few years ago, and the first time I'd eaten here days ago. Better late than never to finally do the latter, though. Had an A La Card cheap eats deck $5 coupon, so figured this would be a good time to try this place again. The sides were good that myself and the person I was with ordered(grits and also pimento mac and cheese), but the fried chicken was a little disappointing vs. how great I've had it at other places(i.e. Little Bad Wolf and The Roost). At least the OG chicken sandwich I got was decent, and I liked the candied jalapeno slaw that came with it. Sweet tea wasn't bad either, pretty good and standard on how it should taste like. Also I agree with another Yelper, who said the portion sizes should be a tad bigger here. And that for what it is, it is a little pricey.<br><br>The patio is really decent, and maybe might be one of those few factors that might encourage me to come back. Honestly though, I'm not going to rush and do so though. Their food feels more like 2.5 stars, but not quite good enough where I'd round up to 3. I do like their patio, and that some of the menu options look interesting(i.e. Honey Vanilla shake) if I ever came back, though. Maybe HBFC will more impress me, next time I'm here? I did really like their patio and their pimento mac and cheese, and the bathrooms were clean too. So I guess I'll do a reluctant round up to 3 stars.", "pics": null}}, {"review": {"des": "Friendly service and food came relatively quickly. The chicken was decent, but nothing special. The ranch cost $1 extra and it doesn't taste anything like ranch. It's green and tastes more like pickles, which was an unpleasant surprise. The Mac and Cheese also doesn't taste like you'd expect. The mashed potatoes are just alright. Most of the food and drinks here didn't taste like you'd expect them to taste. There were also tiny bugs flying all over the place. Overall, I think this place is overpriced for what you get. Not a fan.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/FN_ruKkhoQkKrK9buPSKAQ/348s.jpg", "caption": "Fried Chicken Strips"}]}}, {"review": {"des": "I have been to the actual location once a few years back and remembered it being amazing!  We sat outside on the patio.  <br><br>Then awhile ago, my office catered lunch so the food wasn't hot but was still great.  We ordered a mix of crispy breast, thigh, and drums with sides of honey butter.  My thighs were boneless which was nice.  We also had bacon baked beans, pimento mac n cheese, another bacon pasta, and corn bread.  I don't remember anything tasting bad.  They have vegetarian tofu sandwiches which one of our coworkers enjoyed.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Z--rfHL5h9mc3i8xvppHuw/168s.jpg", "caption": "Tofu sandwich for a vegetarian coworker"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/uHvYikfY8a4o7r0NHnXHIA/168s.jpg", "caption": "Catering"}]}}, {"review": {"des": "My husband is a huge fan of fried chicken and was so disappointed with Honey Butter. We waited about 25 minutes in line to order and another 20 minutes before we got out food. We got the 8 piece chicken with a side of man n cheese. <br><br>The mac n cheese was good. It was not OMG amazing good but I also didn't hate it. This one was creamy and the pasta wasn't over cooked but it lacked flavor. The cheese sauce felt unsalted and had no depth to it. It was very simple.<br><br>The chicken was okay. I also think it lacked flavor. It had a slight hint of something but nothing strong enough for me to even pick up what it's suppose to taste to be. It also looked a little under cooked so I didn't really eat it but my husband at the time thought it looked fine. At the time he said it wasn't his favorite but it wasn't awful either. He compared the the batter to Popeye's. Within a few hours his opinion changed. He didn't feel so well and he thinks it was the chicken. He can't definitely say it was the chicken but he strongly believes it was. <br><br>I gave it a 2/5 instead of the 1/5 my husband wanted me to rate it because of what one of the servers did for me. I was fasting that day and by the time we ordered and were told how long it'll take to get our food it would have been at least 20 minutes past the time I needed to break my fast. I was saying this to my husband and server must have order heard. He brought over some corn muffins for me and said he hopes this is enough to hold me over until I get my food. I wish I remembered his name so I could give him credit for his exceptional service. It was out fault we didn't get there sooner but he tried to be as helpful as possible. It was very sweet and kind.", "pics": null}}, {"review": {"des": "I love Honey Butter!! I came here straight from O'hare after a long flight and knew all I needed was some juicy fried chicken and mac n cheese.<br><br>Since I wasn't too hungry, I just ordered 1 piece (thigh) and the Pimento Mac. The thigh was super juicy and crunchy without being too greasy. The thigh actually came in 2 pieces, so big!! It wasn't dry at all! It came with 1 corn muffin with honey butter. Drench your chicken in that honey butter and thank me later! The corn muffin was delicious and not dense or dry at all.<br><br>My fave part was the Pimento Mac, which is a thick Mac n cheese with a Pimento sauce that packs some heat. It's a super cheesy sauce and can get heavy after a while but it's so worth it!<br><br>Service was on point here! The nice girl behind the counter even offered to hold my giant suitcase behind the counter so I wouldn't have to lug it to the table!! Definitely coming back soon.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/YKhAyhbUVUWRr5rdGqFXGA/348s.jpg", "caption": "Thigh with Pimento Mac"}]}}, {"review": {"des": "Now before I continue I wanted to say that the flavor of the dry rub on the chicken or the seasoning of the chicken is amazing. They have nice seating inside and outside but it is limited. Especially the outside get packed right away and during rush hours the line will go out the door. The procedure once tou enter would be to order first before seating down. I wasn't aware of it so I thought I'd say it here. <br><br>Now on to the food as i stated earlier the chicken was amazing. I ordered a 4 piece chicken and a buffalo chicken sandwich. The 4 piece cost $17 and the buffalo chicken sandwich is about $10. The 4 piece chicken was a mix of light and dark. I ended up getting a drumstick and what seem to be a breast that was cut into 3 pieces. Which kind of a disappointment since it was like 2 piece in general making it into 4 piece. For nearly $4 for a small piece of chicken was kind of upsetting. But there version of cornbread is delicious it was the best cornbread ever!!! The sandwhich was also a disappointment in the amount of chicken in it. But the taste was amazing. <br><br>Overall worth a try for atleast once but I doubt I'll go back again since the amount of quantity you pay for I feel is being a bit pricey but it is good in flavor.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/hbTHGKHsM3uPA4gNkkLwkg/168s.jpg", "caption": "Buffalo chicken sandwich and the smashed potato"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/-7MwzCrjy-QWrARvwJwsOg/168s.jpg", "caption": "4 piece chicken"}]}}, {"review": {"des": "Amazing chicken!<br><br>The fried chicken is boneless which was a surprise to me as it was super moist !<br><br>The flavour and breading is perfect.<br><br>The service is extremely quick and friendly!<br><br>Patio is large and cute!<br>You order at the front and sit down with your number they will bring your order to you.<br><br>The prices are a little bit on the steep end. <br><br>Their drinks were average served in plastic disposable cups. <br><br>I would definetly return!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/XiBy9NIyZdZWhs9e7zftjQ/348s.jpg", "caption": "Salad !"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/VRJtzTAFpM3Z_WKo4dOGdw/168s.jpg", "caption": "My friends chicken strips ! Yummy!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/-wB1sCLYm4F9bXvU4Jwe5g/168s.jpg", "caption": "Fried chicken to go ! I forgot to take a photo of the chicken :("}]}}, {"review": {"des": "Not impressed. I'm from Virginia and the menu here just does not compare to the fried chicken we get in Virginia. Honestly for the price I'd rather spend less at KFC for their pickle brined fried chicken, it's way better. We ordered the pimento mac n cheese, I was really looking forward to this as pimento is very popular in the area I am from, it was really artificial tasting. Major disappointment. The food photographs really nicely for social media but do not be fooled. The corn muffin is totally dry, I can make better at home. The hot chicken was not dry but it wasn't succulent and juicy. The meal wasn't bad but for the price it was just not worth it. Would rather eat at KFC 10 times out of 10.", "pics": null}}, {"review": {"des": "We came here on a very busy Sunday afternoon. This place is very tiny inside with a couple high tables in the back by the bar. Long line that took about 10 minutes to actually order my food. Once you order, they will seat you. That also took about 15 minutes to actually be seated. Once we were seated, our food came out almost immediately, and the rest is history. <br><br>I ordered their Honey Butter Fried Chicken sandwich, and it was phenomenal. Very simple sandwich that's basically the fried chicken with their honey butter poured on top in between the bread. Although this sandwich tasted great, I would have preferred they use a perfectly fried chicken breast instead of smaller pieces of chicken tenders in between. I feel like it would enhance the flavor a lot more, add some juiciness to the sandwich instead of crunchiness. But hey what the hell. Don't fix what's not broken right?<br><br>I would most definitely with out a doubt be returning and order the same exact thing again. Next time around thought, I will ask for the honey butter on the side that way it's all not melted by the time I get my sandwich.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/YouNIfA4Z8BkjN6524w-JQ/348s.jpg", "caption": "Honey Butter Fried Chicken Sandwich"}]}}, {"review": {"des": "Came here on a Sunday afternoon and sat out on the patio. The place is super cute and the patio is larger than the inside dining area. Started off with a French Toast with Fried Chicken, Chicken Strips with honey mustard and garlic aioli dipping sauce, and 2 pieces of chicken. <br><br>The place was busy but not completely full. The food came out pretty quick which was extremely impressive with the amount of people in there. My French toast and waffles were good. The butter tasted homemade and the chicken was so good and tender. The only issue (which is why it is 4 stars and not 5) is that my brunch plate was drowning in syrup that I could not eat all of the French toast as it was overwhelming. The chicken tenders and the sauce were super amazing. <br><br>Definitely will be back!", "pics": null}}, {"review": {"des": "It was over five years before visiting that Honey Butter Fried Chicken opened in Avondale and with the recent announcement that Christine Cikowski and Josh Kulp's Bird would be flying into Wrigley Field as part of the Ballpark's \"Chef Series\" the question becomes how much extra they'll charge for something already overpriced that relies almost entirely on a condiment to be better than Colonel Sanders.<br><br>Built on the ideas of \"Awesome Ingredients, Stellar Service and Strong Community,\" each part of the tripod explained by literature available on tables, it was moments after 10:00am that HBFC's door was unlocked by a woman who said nothing and walked away, her male counterpart responsible for taking orders no more welcoming as he stood aside half-asleep allowing guests to peruse the menu.<br><br>Not the red-hot location of hour-plus lines it once was, only perhaps fifteen diners trickling in over the first forty-five minutes, it was from a small counter that selections were made to a total of over $30 including tax and tip, no beverage but a small marker handed over with Food soon to follow.<br><br>Sitting with a good vantage of the Kitchen, most items expectedly ready-made so early, it was while much of the meal sat plated that a thick slice of Brioche was soaked in Custard and fried, one boneless Breast from Miller Amish Farms in Indiana plopped on top and immediately slathered in the store's other eponymous ingredient.<br><br>At this point already weighing cost to quantity but ready to find out if quality made up the difference it was immediately into one of two bite-size Cornbread that teeth sank, the crumb a little dry but good for drawing in Butter while a $4 Biscuit was apparently intended to stand on its own despite being pretty basic unless one wished to spend another two dollars for another ping pong ball of Butter.<br><br>Looking next at $5 of patriotic Cobbler put haphazardly in a cup, the bursting blend of Berries fine but Cool Whip as listed on the menu hardly \"Awesome\" and the total ingredients involved perhaps 50-cents, it was setting aside most of this that Spiral Noodles proved vastly more enjoyable thanks to tangy Pimento Cheese while Weekend-only French Toast was fairly one note as a base to Chicken that lacked seasoning but was plenty moist even once one got past all the Butter and Syrup.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/eCGUXb-uu5PHeeBR8nijeQ/348s.jpg", "caption": "07/08/18 Honey Butter Fried Chicken:  Breast Meat"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/zR3BJSJTaNH6tLnEXtKa_A/168s.jpg", "caption": "07/08/18 Honey Butter Fried Chicken:  Buttermilk Biscuit (butter is an extra $2 on top of $4 for Biscuit)"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/YDmJoLq5fbK-J-ogmsjzdA/168s.jpg", "caption": "07/08/18 Honey Butter Fried Chicken:  Buttermilk Biscuit (butter is an extra $2 on top of $4 for Biscuit)"}]}}, {"review": {"des": "First time at Honey Butter, but I was so excited...and then I was conflicted when I got to the counter to place my order. It was Taco Tuesday and they had tacos on the menu...but I've never just tried their chicken either. I can't eat all that food...well, I could certainly try. Oh, the dilemma. AND, they also had boozy milkshakes and floats.<br><br>It's right on the corner; it's hard to miss. There's plenty of parking nearby if you drove. It's a small-ish place, but there's a secret/not-so-secret backroom that has a bar you can sit at some counter seats and a table in the middle of it all. <br><br>You walk in and place your order right away and then wait for your food to arrive with your number. Think Nando's style (if you've ever been there). The service, what service they have, is very nice, friendly and fairly helpful. There's a bee theme around the whole place (think honey). Also, on Thursdays, they have a nachos special.<br><br>Back to my dilemma, after my friends ordered it was mine turn. It was too hard, I just ordered both and ended up taking an entire meal home, but worth it! Two days of fried chicken and still so good. Their chicken is boneless, by the way.<br><br>Tacos: yasssss, they use their chicken strips that are made with dark meat and so moist and juicy. The toppings are perfectly paired and pretty much there's more chicken than the other stuff and that's ok. They grill their tortillas and that's amazing. If you question whether two tacos will fill you up...don't, because it will. If you're really questioning it or are ravenous, grab a side (their mashed potatoes are pretty killer).<br><br>Fried chicken (2 piece): comes with 2 baby corn muffins and a side of honey butter. You might question if this will fill you up. Don't...because it will, but if you're about to keel over from starvation (or it just feels like that), grab some sides. Like I said before, the chicken is boneless, so if you don't want to get your hands dirty...you don't need too. Their breading is different than any other breading you've had before. It's more like a chicken tender/chicken strip breading versus your typical fried chicken breading, but can peel off like fried chicken breading. It's amazing and awesome and forever crunchily delicious.<br><br>Boozy float: so the tricky, maybe a little suspect thing is that they use soft serve ice cream vs hard ice cream AKA it melts faster and your float will likely turn into a flavored milk shake. If you get your float boozy, you'll definitely taste the booze...this is a good thing (you're not getting swindled). I got mandarin orange soda with my honey vanilla ice cream. It was like a delicious boozy dreamsicle...which later turned into a milkshake.<br><br>TLDR: definitely worth checking out. if you haven't had just the chicken, get that and maybe a side or two (if you're really hungry). the boozy floats/shakes are different, fun and delicious.<br><br>PS. Don't forget to make your mark on the calendar by the door. Represent who you are and where you come from!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/CJ14BNQilba56hjzO4PhtQ/168s.jpg", "caption": "Fried Chicken"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/lq5EWDXg-8ErGkIoonxu4A/168s.jpg", "caption": "Fried Chicken Tacos"}]}}, {"review": {"des": "Visited Honey Butter for the first time this evening.   Casual place with great food and good service.   The OG chicken sandwich was great!  Recommend pairing with the muffin pack and honey butter.   If you like kale and cabbage then order the slaw as well!<br><br>Take out is also available, but keep an eye on the status of your order . . .", "pics": null}}, {"review": {"des": "Worth the hype? Probably not. I left the place feeling underwhelmed. The chicken is decent at best. The white meat is a little on the dry side. It isn't terrible though. This place is definitely worth a try since there is a lot of hype around it. I got the 4 piece chicken plus a mac and cheese side and shared it with a friend. Both of us were still hungry after eating when typically two pieces of chicken would leave me full.", "pics": null}}, {"review": {"des": "I've heard about this place years ago and finally got a chance to check them out!<br><br>I really love the environment and outdoor eating area/neighborhood...But let's talk about the food! <br><br>We went on Wednesday (10 wings for $10 special going on that day) so we ordered a basket of the honey butter buffalo wings and the 4 pieces regular honey butter chicken and biscuits; with side of the Mac & cheese. <br><br>We also ordered the \"Peachy Keen\" alcoholic drink which was very good! The wings were delicious! Finger licking good lol and the original Honey butter fried chicken was good, but tasted best with the honey butter they provide with the chicken. <br><br>Their biscuits were pretty good as I'm very picky about biscuits & honestly the Mac & cheese wasn't my favorite like it was not very good to me... The taste is very rich in flavor as in like aged cheese. I would have loved to tase their other sides but was a bit bummed that they didn't serve fries lol! I was like what no fries?? lol but over all liked the scenery, the crowd and the food was good! I'd come back and tell others about it! <br><br>I'll say this we Uber to this place so for parking and such I'm not sure how it is but it's like a neighborhood based restaurant so I'm sure you might have to pay for parking if you were to drive!", "pics": null}}, {"review": {"des": "Yummy! There for brunch had the chicken and grits and it was delish! Not sure what they do to their hot sauce but it was super tasty had a sweetness to it. Grits and chicken were just devine- the crispiness of the chicken was perfect! The inside is pretty small but there is an outside space- guessing only usable in fair weather months. I would go back and try some other items! Can't wait! PS- they have a full service bar!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/pfAXZacb-sDVrnDvYTfoKQ/348s.jpg", "caption": "Chicken and biscuit brunch item"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/pZLadQ2vE2N759ki89yHMg/168s.jpg", "caption": "Brunch dish egg with grits and fries chicken strips"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/tRYkpnJR7R0UaFugN3Qaaw/168s.jpg", "caption": "Inside rear bar"}]}}, {"review": {"des": "Maybe I came here on an off day? Everything was great except for fried chicken... Based on other reviews here, it seems like the chicken here is juicy on the inside and crispy on the outside. <br><br>The chicken we got was jerky-like dry on the inside. The crust was too heavy on paprika and bland.<br><br>The cornbread and honey butter were fantastic.<br><br>Elote and kale slaw were very forgettable. Bland and one-note texture (just soggy and wet).<br><br>I've definitely had better fried chicken. Really hoping it was an off day for the kitchen.", "pics": null}}, {"review": {"des": "I've had a lot of fried chicken in the south, in the West, in the Midwest. Honey Butter was very decent. The chicken - we ordered the pieces, Not the bone-in - was tasty enough, and the honey butter was certainly unique and delicious. The bleu cheese sauce was also delicious; mild and not over the top. The ranch was very dill heavy. Excepting the Mac + cheese which was rich and unique, our other sides were dense and without carefully parsed out flavor. <br><br>Overall, not dying to run back any time soon. The craft sodas are fun. Fun atmosphere. I'd like to test the bone-in to see if my experience is any different.", "pics": null}}, {"review": {"des": "That saying that goes \"nothing tastes as good as skinny feels\" has never been to this place. Mac and cheese, unreal. The chicken and cornbread AND broccoli cheese potatoes tasted so much better than any kind of skinny could feel, just saying", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/dS9sP3KU-HuzARveAjAN_g/348s.jpg", "caption": "6 piece chicken"}]}}, {"review": {"des": "CA Residents here.  My wife and i discovered this spot on some social source and it did not disappoint.<br><br>We shared one of their main dishes.  3 piece with cornbread. And wow. it was amazing.  Thoroughly fried chicken and moist!  Come here if you are ready to EAT.  The cornbread was on another level.  They cook it in these hexagonal muffin size shapes that has crunchy edges to it but soft on the inside.  They were just amazing to me and i absolutely loved them.  Top that all off with their honey butter and bam. You are in for an epic journey.<br><br>Whats cool about this place is that they have SOOO many unique and different options.  Featured items on their menu change also which is cool.  That means they are always progressing and developing something for the customers.  Lines get long but its SO worth it!!<br><br>PROS: Everything really.  Just well thought out GOOD quality food.<br>CONS: .....?<br>OVERALL: I think we would come to Chicago JUST for this. So yup, we would come back lol.", "pics": null}}, {"review": {"des": "I came here at an odd time on a Tuesday afternoon. A friend recommended this place, so I dropped by and ordered the jerk wings and the pimento mac and cheese. Wow! The flavor of the wings was outstanding. Pretty mild spice, but very tasty. The pimento mac though... out of this world! If I wasn't about to fly back home, I probably would've left with a gallon of the stuff. <br><br>They also have a pretty unique soda collection. I really liked the spicy ginger one! The service was great, and the food came out pretty quickly. If I'm in the area, I'll definitely be stopping by HBFC again!", "pics": null}}, {"review": {"des": "One of my fave restaurants I've tried the last 10 months.  First and foremost, the food is simply outstanding and the service provided by the staff is stellar and most accommodating to their guests.  <br><br>I usually get the OG chicken sandwich (my fave sandwich) with the mac n cheese (the best in Chicago, yes it's that good), and the creamed corn.  I've also had their wings in assorted flavors, you cannot go wrong with any of them.<br><br>I do not drink soda, but my friend EJ assured me that their locally produced sodas are fantastic (I think its Goose Island).<br><br>I'm not a desert guy, but my dudes and dudettes please try the dump cake! Phenomenal!!", "pics": null}}, {"review": {"des": "3.5 stars but I had a hard time convincing myself that it was great enough to warrant 4 - so went with 3, which may be because this place gets uber-hyped but didn't entirely live up for our first trip here.<br><br>Arrived at 2 or 3 pm on a Friday, so there was absolutely no wait and food was ready in less than 5 min for take out.  The quality of the chicken meat was the best part of the fried chicken and you can really tell that their focus on great quality chicken shines through (yay Miller Amish farms ya'll raising some nice birds).  The crust seemed to survive the drive home pretty well (that's no small feat) - but some of the pieces felt dry and some of the pieces were significantly crispier than others.  The honey butter tastes good on everything and the corn muffins were super crunchy on the outside (LOVED) but badly needed the butter because they were crumbly dry on the inside.<br>The service was fine (guy at the front taking orders was super friendly) but while waiting for the food at the back of the restaurant the staff was less approachable and seemed intently focused on their own conversations.<br><br>If the drive wasn't so out of the way we would probably be back and give em' another shot.  The bar is quite high for amazing fried chicken in my book - it's good here, but I hesitate to say more than that.", "pics": null}}, {"review": {"des": "Maybe I went on an off night but I went and got the honey butter wings and the og fried chicken<br><br>The line was out the door so I figured I was in for quite a treat. We ordered and sat down and food arrived fast. Wings were cooked well just pretty average at best though but I did like the flavor. <br><br>The sandwich was big but the quality Of the chicken just wasn't great. Maybe I had a bad piece but it was sort of brown and rubbery for the most part <br><br>I wish I got the fried chicken and I would go back for that next time.", "pics": null}}, {"review": {"des": "A wonderful place i discovered on the north road side of Chicago .The chicken sandwiches was delicious. I tried their wing and buffalo honey sauce. The service was really good,i also got a take out of their chicken biscuit. Lovely place to be!<br>The line was a bit long on a late Saturday afternoon. There's an indoor and outdoor dining area and the food is brought out to you order at the counter. The menu was good, but it didn't have a large variety", "pics": null}}, {"review": {"des": "My favorite food from this place was the homey butter fried chicken sandwich. I would give it a 10/5 stars if I could. The coleslaw inside the sandwich went so well with it, and everything melted in your mouth. The fried chicken itself was great, but I preferred the sandwich. The staff was friendly, and the long line went by quickly.", "pics": null}}, {"review": {"des": "I like a place that knows what it does and does it well. Focus and you'll move toward mastery--If only I could teach myself that lesson. Anyway, HBFC makes delicious chicken--crispy fried, juicy, and slathered in honey butter. They also have some interesting beverage options including several colorful sodas. There is seating inside and a nice patio out back, with heaters and string lights, adjacent to an ivy-clad wall that makes for a pleasant scene. <br><br>Grab lunch or dinner here and then just go home, because you're gonna need a nap.", "pics": null}}, {"review": {"des": "Came here yesterday for lunch with my roommate and it wasn't bad, a bit overpriced, but not bad. <br><br>The chicken was overall nice and tender, a couple pieces were a bit dry, but that's not unusual. The coleslaw was good and the dried pomegranate was great on top. The mac and cheese was solid too, as were the cornbread muffins. Of. Purse the honey butter was great, per what you'd guess. <br><br>Service was friendly and atmosphere was light.", "pics": null}}, {"review": {"des": "What better way to celebrate National Fried Chicken Day than with some great fried chicken! I ordered the 2 piece and also ordered 2 sides, along with a sweet chili dipping sauce. All came out to $21.00. It's kind of pricey, but the food is delicious, so I don't mind! <br><br>The fired chicken was great! Crispy on the outside and juicy on the inside. Also put some honey butter on top making it the cherry on top! <br><br>But what really struck me were their sides. I got the creamed corn and pimento Mac and Cheese. I also shared with my sister the mashed potatoes. My favorite was definitely the creamed corn (I recommend it). I'm don't really like Mac and cheese, but the staff member said it is one of their most sold so I decided to try it. I must say it was surprisingly good! It had a nice sharp kick to it that made it very unique. And the mashed potatoes were delicious (can't have fried chicken without some mashed potatoes and gravy). <br><br>Conclusion: Go and try this place because it's good....period.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/pljbsGgnEJ16gLlc95DWWw/348s.jpg", "caption": "Honey Butter Fried Chicken Sandwich"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/oHGXV6nLN4ud9eOeZJKodg/168s.jpg", "caption": "Fried Chicken Strips, Corn Muffins, and Kale And Cabbage Slaw"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/8hwvJBMSDEL5Rx9mNGJkAQ/168s.jpg", "caption": "Fried Chicken Strips and Roasted Garlic Grits"}]}}, {"review": {"des": "I first tried HBFC when they first opened a few years back and I decided to head up north and try it again. This time around I tried the OG fried chicken sandwich, honey buffalo wings, pimento mac n cheese and the creamed corn. Boy, are the wings pretty dinky. And I wouldn't call the flavor honey buffalo since it tasted pretty plain to me. The wings were more like an appetizer sized portion, rather than an entree. The OG sandwich was really tasty, however, the chicken portion was reeeallly small. I cut the sandwich in half and one side had meat and the other side was mostly just bread (sad face). The sandwich would have been perfect if there was 1 or 2 extra chicken strips in it. The mac n cheese is decent, but on the runny side. And the curry creamed corn is a nice change up from the usual.<br><br>So much potential, but I feel like it's overpriced for what you get. I'll stick to my usual fried chicken spot.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/HiDYPnllhsfQW1jaeu-mKA/348s.jpg", "caption": "The good side of the OG fried chicken sandwich"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/5oZ9FF08S_CFog5VlVM0vg/168s.jpg", "caption": "Pimento Mac 'N Cheese and Creamed Corn (and the less photogenic side of the OG sandwich)"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/iFvQ5kkzAoRJt30W3ececQ/168s.jpg", "caption": "Pimento Mac 'N Cheese and Creamed Corn"}]}}, {"review": {"des": "I don't even really like chicken and I would eat here everyday if I could! It is hands down the best friend chicken I have ever had. The combo of the honey butter and the crispy chicken is a match made in heaven! <br><br>I usually get one of the sandwiches but want to try some of the other dishes. The mac & cheese and creamed corn are out of this world. Getting hungry just thinking about it. <br><br>If you go at a popular time the lines will be long, but it's more than worth it. In the warm weather the back patio is the perfect place to sit and enjoy your chicken!", "pics": null}}, {"review": {"des": "Their fried chicken has the perfect sweet, salty, and buttery taste matched with juicy and tender texture combo. Aside from the chicken that we ordered, we got their pimiento mac and cheese, which compliments the sweetness of the honey butter. The cornbread was ok though. You might have to just dunk it on honey butter. Lastly on our list was the OG chicken sandwich. You can't go wrong with this sandwich. It's served with their signature chicken with crunchy slaw for acid and jalapeño mayo. <br><br>PS Their outdoor patio has tons of sitting with old school lighting makes for a very relaxing ambiance.", "pics": null}}, {"review": {"des": "This was the highlight of our food exploration of the Windy City. We made it a point to uber all the way out here from downtown and it was so worth it. Our party of 3 ordered the 8 piece chicken and it was some of the most flavorful chicken I've had. Breaded beautifully, super moist on the inside and the overall flavor was just incredible. To be honestly, I wasn't a huge fan of the honey butter by itself on the chicken but when you would put on some of their hot sauce with the honey butter then that would be the winning combination. We also ordered their brunch special biscuits and gravy and that was freakin great as well. Mashed potatoes with gravy was super rich and creamy. My wife and I had to buy a couple of shirts to remember this great experience. Would definitely return if we go back to Chicago.", "pics": null}}, {"review": {"des": "Fast casual fried chicken!! We were here the first time in February and finding a spot to stand while waiting for our table but the wait was worth it. Rich flavors, perfectly prepared. I loved the pimento mac and cheese but I'm a sucker for good ol' Wisconsin cheddar. <br><br>Fried Chicken sandwich was filling, crispy and the roll was buttery and soft but held together well. I would definitely come back the next time we're in town but I'd probably do carryout and save the long wait to order/get a table.", "pics": null}}, {"review": {"des": "The chicken was moist although somewhat flavorless. The breading was crispy and well-seasoned - finished with decadent honey butter.<br><br>Although the chicken on its own was a bit rich for my taste, the OG Fried Chicken Sandwich perfectly contrasted the richness with crunchy slaw and jalapeno mayo.<br><br>The sides were just okay. Tried the corn muffins, pimento mac 'n cheese, and the mashed potatoes in chicken fat gravy.. Each side felt properly Southern, but ultimately left something to be desired.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Ci3GCR_WRLYhWk4Bzq3U5g/348s.jpg", "caption": "The OG Perfectly contrasts the richness of the fried chicken with crunchy slaw and candied jalapeño mayo"}]}}, {"review": {"des": "I love you HBFC. It's so terribly bad for you but oh so delicious. I went on a Sunday and it was busy, luckily we just missed the \"out the door\" busy and we had to wait a bit to be seated. <br>I've never been there for brunch and we were  tempted by the chicken and French toast, so we ordered that, Mac and cheese, and a normal chicken sandwich with honey butter. They asked us if we wanted it on a biscuit so we decided to try it rather than their deliciously soft normal bread. Mistake. The biscuit was SO hard, so they instantly switched and gave us a new sandwich. The French toast was DRENCHED in syrup so it was a way too sweet for my liking. Could probably do one or two bites/splitting was more than enough. Mac and cheese is always delicious but again can only do a couple of bites of it because it's kind of heavy.<br><br>Can't wait to keep eating healthy and ruin it all on one meal here. Drooling til next time.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/VPiFIMsIW6-sTe-s3WyWQA/168s.jpg", "caption": "The Clam and the Honey Butter Fried Chicken!"}]}}, {"review": {"des": "I've been here countless times and their food will never get old. HBFC is phenomenal. <br>I always order the original sandwich with their Mac and cheese. Just their Mac alone could receive a whole review. It is so creamy and delicious and unlike others I've had before due to the pimento cheese. <br>It is a little pricey for a fast casual but 100% worth it. I bring friends, family, everyone here as I have yet to find someone who has been disappointed. <br>If you go in the summer they have a great outdoor patio - indoors is smaller and can get tight with seating during the cold months.", "pics": null}}, {"review": {"des": "NOTE: this is not a review for the food, as their food is absolutely delicious. BEST mac 'n cheese I've ever eaten.<br><br>This review is for the two times I've had it delivered. The first time I had it delivered, my order was completely wrong. The second time I ordered, all of the delivery fees nearly doubled my order. As I don't live close, it's a shame I can't won't be ordering from here in the future. Simply put, I wish they would use a cheaper delivery service.", "pics": null}}, {"review": {"des": "Chicken and honey butter is amazing as always! It was baes first time and he looooved It. The smashed potatoes were ok but the Mac and cheese was on point! Good selection of beer. Patio is one of my favorites.", "pics": null}}, {"review": {"des": "Chicken was tasty, loved the buttery biscuits. Love the concept of not having to tip since they pay their employees well. Yeah you pay for it in your food it's a bit pricey for fried chicken but at least you know they used farm raised chicken and farm based products for their ingredients so it's a win win. Staff is very friendly and I got to pin the yellow pin over yemen on the global map!", "pics": null}}, {"review": {"des": "Amidst the chaos and congested layout of the restaurant, stands a delicious staple of Chicago: Honey Butter Fried Chicken.  My fiancee and I have been a few times, and although I'm usually a stickler for trying something new, I keep finding my way back to the Original Fried Chicken Sandwich - a.k.a. \"The OG\".  <br><br>The chicken is perfectly cooked and thrown on what appears to be a butter roll with candied jalapeno mayo (tiny kick) and crunchy sweet slaw.  The price point I would say is a bit high ($8.5), but after you have a bite of the sandwich, you completely forget it.  <br><br>We both partook in the sandwiches with two sides (Schmaltz smashed potatoes for her, pimento mac'n'cheese for me).  I feel like something's missing out though with the ability to make a meal out of the options, rather than dump out $12-$14 for the total package.  The corn muffins are also a great addition to any plate, but note that if you want some honeybutter to go with it, it'll be an extra $1.5.<br><br>Honestly, the prices are the only thing keeping this from a 5.  The service is fantastic - everyone's been ridiculously pleasant when you walk in and seem to genuinely enjoy what they do, the food is great, the beer selection is random, which I love.  <br><br>Definitely going to go back to check out some of their daily options!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/-9thUrxwG8JJJFQSNJaVlA/168s.jpg", "caption": "OG sandwich with muffins and smashed potatoes."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/VV0rUKV63C-p305-IG_ePA/168s.jpg", "caption": "The OG sandwich"}]}}, {"review": {"des": "Honey butter Fried Chicken is a place that everyone should try at least one time. But that's about it. The chicken is really tender and juicy. But they only give you one serving of the butter so you will have to ask for more. I do not understand why they give you such a small portion of butter when that is their main event. I ordered the standard chicken and some drinks. The reason I only give it 4 stars is because of the price. Simply if you knew how much restaurants paid for the wholesale price of chicken you would be severely upset. The cost is almost $4 / chicken. I ordered 8-piece Fried Chicken which came out to be $32. Who in their right mind would think this is worth it. Honestly you should just go to Popeye's and stop by here on the way home and just pick up the butter. You'd get a better deal and more flavorful chicken. On the plus note the service is pretty good. I would say this place is good to try once every 5 years or so the. Maybe if they reduce the price it would be worth it.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/PkdRLDtOn54-hwYut8HRDg/348s.jpg", "caption": "8 piece chicken"}]}}, {"review": {"des": "A hidden gem on the north side of Chicago. <br><br>Food- As I continue to seek out the best wings in Chicago, I stopped in while in the area. They are known for the their chicken sandwiches but I had to go with the wings! They only offer one sauce for the wings which I thought was weird but, they did not disappoint. The sauce is a buffalo honey which is a great blend of sweet and spicy. <br><br>Service- The vibe is really cool, but the inside is small which is the reason I got take out my second time around. However, they offer a nice patio area for small or large groups. <br><br>Overall a great place to try if you are in the area. I look forward to coming back to try their famous chicken biscuit!", "pics": null}}, {"review": {"des": "I was tempted to rate Honey Butter two stars, but added a star because of the friendly service. <br><br>I recognize that a large percentage of Chicagoans never venture South of Roosevelt except for the occasional Sox game, but better chicken can be found at just about any chicken shack on the South and West sides. I suspect this unfamiliarity has skewed the Yelp ratings. Now I will concede the service may not be as friendly, but the fried chicken undoubtedly better and more affordable.<br><br>The Mac n' Cheese was ok. The cookies were cool. The coffee was actually really good. If I were to go back, I'd stick to a chicken sandwich. Not worth going outta your way to try, but an ok option if you can catch a daily special.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Re5D-GyIHlEW9FvGbqEoSw/348s.jpg", "caption": "Toffee Chocolate Chip Cookie"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/lKotObpm0pcOeSrbruiOMg/168s.jpg", "caption": "10 Wings"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/JV4kdcU3LIX-vlbjqK8AAw/168s.jpg", "caption": "Buffalo Chicken Sandwich"}]}}, {"review": {"des": "Good chicken  and grits not worth $50 ! Mac & cheese has a spice to it that I didn't like. Over priced I think for what u get as well as paying for extra for sides. We were the only people in the place and I had to track down a waitress to get my tea ( never was checked on after) waited a while for our food considering there were no other people in front of us.  If the staff had been more attentive and helpful instead of spending all the time next to the kitchen talking it would have made for a much better experience.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/F3DOprblM6RxFsM1aquY6w/348s.jpg", "caption": "Good chicken & grits, some of the worst service and wait time for food since there was no one else in there."}]}}, {"review": {"des": "I'll start with the pros. Love that they have non meat options. The fried tofu tasted very good. The grits were a little weird, but they be because I just don't care for grits? Anyways, on to the cons. I ordered 1 order of the fried chicken strips and 1 order of the fried tofu strips. Each cost the same amount and I assumed each would be the same. No. There was way more chicken and barely any tofu! If this is the norm then something needs to be said about it. I was furious because my meal was the tofu and my husbands was the chicken!", "pics": null}}, {"review": {"des": "I was impressed by the boneless honey fried chicken but the tandoori wings were a total bust.<br><br>The grits is really, really creamy.", "pics": null}}, {"review": {"des": "It is been a while since I have been here and I need to get back.<br>I hate the fact that this app makes you write more and more because it says that you are currently too short. I think I said enough", "pics": null}}, {"review": {"des": "AMAZING chicken!!!!! I was blown away by this place! The chicken, the sides, and the dessert was all amazing! My reiew literally cannot do it justice. Get in there, buy the chicken, smother it with honey butter, and you'll see what I am raving about. The chicken is perfectly seasoned and crispy on the outside while staying extremely juicy and tender on the inside.", "pics": null}}, {"review": {"des": "This place has been on my list for a while so I was pretty excited to find it rather empty when we showed up about 7 pm on a Sunday night. We ordered strips, a 4 piece chicken, caeser salad, pimento mac and cheese, kale slaw, creamed corn, and corn muffins. <br><br>Skip the strips. They aren't seasoned like the rest of the normal chicken and are rather dry. The chicken comes with a honey butter that when melted on the chicken gives you a tiny bit of a sweet, salty, spicy flavor for the chicken. While the chicken was good, I would not say it was the star of the show. At the top of my personal list was the creamed corn, which is rich and dressed with a small dollop of green curry and garnish of julienned basil. This is a combination that makes me thank whoever they stole the idea from (as in it's so good there's no way a normal human invented it). My groups favorite was the pimento mac and cheese. It's swirly noodles and slightly sour/ spiced cheese make it one of the best mac and cheeses we've ever had. <br><br>We tried 3 different sauces: the Wisconsin blue cheese (too salty), honey buffalo (reminiscent of Burger King buffalo sauce), and sweet chili (our favorite). The sweet tea is not too sweet so don't feel the need to water it down right away. <br><br>I'll be back to try the kimchi and the grits.", "pics": null}}, {"review": {"des": "I just came to a life changing realization. I dont really care for Fried Chicken. For years and years I tried to just tell myself that their just are not that many places that do it very well. Or maybe Chicago was just not the right town. But I have had fried chicken from many of the outsider spots coming to the city and from many spots in the south. Just like with Honey Butter (HB) I just did not love it. The honey butter that you put on doesnt help as I dont like sweet stuff on my Chicken. <br><br>They seem to have a great business model. A simple menu and a small restaurant that creates buzz. A duo that passionately cares about their food and their employees. I also do kind of like the paprika touch on the chicken. So its not really them its me. I just do not like fried chicken. Rotisserie style or baked chicken is my more preferred method of chicken. It just took HB to make me realize it. Im not sure HB is happy to have such a distinction. But we will both go on to lead the lives that we are headed toward and my guess is we will all do just fine.<br>3.8 stars for the professionalism and business model.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ODIWyNsDJK14yBjDcDo-ew/348s.jpg", "caption": "Chicken"}]}}, {"review": {"des": "Portion sizes are small, chicken is juicy and crispy, and honey butter dip/spread is an acquired taste. All in all, not super impressed with this place considering much hype from my friends in the area. <br><br>2-piece chicken with 2 cornbread muffins and honey butter spread<br>I expected larger pieces of chicken considering the price, but at least it came with the two corn muffins. The chicken is incredibly juicy, and the skin is breaded and lightly crispy. The corn muffins were a little too dry for my taste, and the honey butter is exactly what it sounds like. For those of you who already are not huge fans of butter, don't expect that to change by coming here.<br><br>I would only come back here in a pinch, and likely order only their fried chicken. Two gender-neutral bathrooms are available. Order at the counter and your order will be brought to you. A sink for washing hands is located next to the seating area. Very small interior, maybe 7 small tables.", "pics": null}}, {"review": {"des": "I was excited to try this place out because I love fried chicken. But it was just OK. My boyfriend said that it didn't taste as good as he's had before and that maybe it was an off day. The honey butter that comes with the chicken was just a slab of butter . he said it typically is more melted. I did however really enjoy the corn.", "pics": null}}, {"review": {"des": "This is one of my daughter's favorite spots to grab a bite to eat.  The food is great, but the key to this place is the ethics regarding their ingredients, such as; \"antibiotic-free, cage-free, humanely-raised chickens\".  My son loves the chicken but neither my daughter nor myself order it. We stick to the sides. Her favorites are the creamed corn, mac and cheese and corn bread. I look for the gluten free options, which is so much easier now with their gf categorized menu. <br><br>HBFC always has an interesting cocktail menu, the three of us are always pleased with the choices we have to choose from. <br><br>Employees are always very friendly and happy!  They make sure that the place is immaculate.", "pics": null}}, {"review": {"des": "Spectacular! Midwest does southern cooking right! This is the perfect place to come if you are looking for fast, casual, and delicious. You order at the counter and sit inside or outside. I've never had a problem finding a seat even though it gets quite busy. <br><br>Food: Everything was fantastic. I'd eat here everyday if I could. <br>Fried chicken - Crispy, juicy, spicy and sweet. I don't know how they do it. Ask for honey and they will give you a stick!<br>Corn muffins and butter- Not the best I've ever had but delicious nonetheless <br>Honey buffalo sandwich- Fantastic! Buffalo anything is my favorite and this did not disappoint. The honey buffalo was amazing and unlike anything I've ever tried. I love spicy meets sweet. <br>Buffalo Mac and cheese - Top 5 Mac and cheese. It was buffalo and pimento cheese flavor. Creamy and decadent. You need to get this. <br>Kale and cabbage slaw- It was a nice balance to all the heavy food I ate but still want delicious. I wanted it to be a tad less tangy and more creamy. <br>Chocolate Soft Serve- Was actually better than most soft serve ice cream places I've been to! You could actually see specs of flavor in the ice cream. <br><br>Ambiance- Casual, hipster, family oriented. You can also get beer here! <br><br>Overall I adore this place. Food like this gives those fancy steak houses and lobster joints a run for their money !", "pics": null}}, {"review": {"des": "HOLY MOLY! This chicken is on the level of Gus' Fried Chicken. It is so crispy on the outside and juicy on the inside. The chicken texture and flavor was just amazing. The seasoning on the skin was just perfect, with slight overtones of spiciness and a delectable melange of savory and hot.<br><br>I was so surprised by this chicken. But once you add the honey butter it gets even better!! The honey butter is so rich and sweet and creamy. And the CORN BREAD!! It is so delicious I could eat it all day. Oh my goodness, this meal was just perfect. It is a little pricey, and I was skeptical at first, but now I see the light. Holy moly holy moly. <br><br>Okay. One caveat, this place is expensive. Comes out to around $3 per piece of chicken, which is pretty darn pricy since you get either drumsticks or boneless pieces that are about the size of a tender. <br><br>The restaurant is really tidy and service was nice and super fast. There are a ton of other menu items that I want to try next time. Apparently the chicken sandwich is good too. Wowee!! He! He! He! Amazing!", "pics": null}}, {"review": {"des": "We fought afternoon traffic from the south side to visit this restaurant. There were plenty of seats once we arrived (230pm). So we ordered chicken tacos and wings( canjun and buffalo). The tacos were great, good sauce,tortillas,breaded chicken and veggies, four stars easy. However the wings weren't that great. Especially if you're a restaurant specializing in chicken the wings should be on point, but that's my humble opinion. My advice would be to batter the wings and serve a sauce on the side. Anyway if I'm up north I'll definitely come back a try the chicken sandwich which looks terrific.", "pics": null}}, {"review": {"des": "For a place that has \"Fried Chicken\" in the name, their fried chicken could be improved. I found it to be mostly dry and not flavorful enough for me. <br><br>The reason why I give it 4 stars is that everything else other than the chicken here is phenomenal. The biscuits and the honey butter is my favorite thing here to get, along with the creamed corn and the tacos on the menu. Most of the time, I get the OG sandwich for my meal - the topping sauce can be a little bit much at times, but it's still so good that I used to get it at least every other week.<br><br>The atmosphere is cozy and hip, and I appreciate that the restaurant pays more than minimum wage for their staff (this is stated in the reason for why no tip is needed on the tables).", "pics": null}}, {"review": {"des": "Yessssss. Best fried Chicken I had. Global contender for best. I had the wings and the burger and walked out with a cap and a t-shirt. I'm down to open one in Amsterdam", "pics": null}}, {"review": {"des": "Went here for Sunday brunch but still got seated in a short amount of time (it was packed), served good food, and was given excellent service by their friendly staff. I don't understand the confused reviewers here saying to lower the prices when they don't accept tips to support staff wages, I guess basic economics is hard for some. Props to an establishment that cares for their employees. Solid 10/10.", "pics": null}}, {"review": {"des": "Yes, it's Honey Butter...yes that is good. The Fried Chicken...now that is something amazing. <br>Juicy center with crispy skin...seriously tasty stuff!<br><br>They had a honey beer on tap that was perfect for the hot summer afternoon. <br><br>I need to try a Honey Vanilla Milk Shake next time!", "pics": null}}, {"review": {"des": "Why do people like this place? the chicken is dry... I'm from the South.. maybe my expectations are too high...", "pics": null}}, {"review": {"des": "Lines out the door even during Chicago's cold tundra like weather for very good reason! Completely worth the wait for even just their honey butter alone! The staff there do their best to accommodate the large crowd and they are very efficient. With a stocked bar inside as well, you can't ask for a better time.<br><br>We ordered the 8 Piece along with their Creamed Corn and their seasonal Soy Ginger Sweet Potatoes.<br><br>The Chicken itself was undeniably delicious. The dark meat pieces were actually dropping onto the platter with every bite. The Honey Butter is magical and would be completely unacceptable to not smear Butter on each bite. The warmth and seasoning of the chicken really brings out the sweetness of the Butter. The combination is the perfect combination.<br><br>The corn bread is quite tasty as well, not as mind blowing as the chicken, but also paired greatly with the honey butter!<br><br>The Soy Ginger Sweet Potatoes were savory and gave a sort of break from the sweetness of the Butter. The potatoes were the perfect texture and each bite had us wanting more, definitely recommend this one!<br><br>The Creamed Corn was good but not amazing. It could've had more of the Thai Green Curry taste. It was just overall more creamy in texture and not all that flavorful. Nonetheless, delicious, but just tasted like regular cream corn without the Asian spin.", "pics": null}}, {"review": {"des": "Delicious! My husband and I love some great delicious chicken. The chicken has a great taste and its crispy. They have great corn bread that come with the chicken. We also order a small order of mac and cheese. It wasn't the best but this is a great neighborhood stop to get some great chicken. <br><br>They also have a Perfect patio sitting area. to enjoy the weather outside.", "pics": null}}, {"review": {"des": "Service was great. I tried the Buffalo and didn't love it so the manager swiftly changed it out for The OG for me.<br><br>Kids meals were generous but really not sure what 3 year old will eat pimento cheese Mac- and I did even have a picky kid. <br><br>The biscuits and plain chicken strips were my jam. We'll be back.<br><br>One star off because I just felt like the sandwiches should come with a side- kinda overpriced.", "pics": null}}, {"review": {"des": "Umm...yeah...I don't get it. I have never been as throughly underwhelmed before by somewhere I ate. I researched and saw this place was on the top restaurants in Chicago lists...and figured I'd try it. <br><br>I ordered the two piece meal...and the special pickle they had on the menu. The chicken was horrid...I don't know how you mess up fried chicken but they did. I'm not from Chicago, but I'm guessing any Asian food place in south side Chicago had better chicken than this. No seasoning...no taste...just awful in my opinion. The grits were pretty damn good, and that's the only reason I'm giving them two stars. And the pickle...ha...I love pickles and expected an actual pickle. What I was served was a pretty bad relish in a plastic cup. <br><br>So yeah...this is not on my places to revisit while in Chicago list.", "pics": null}}, {"review": {"des": "Honey and butter is simply a genius combination that we didn't know we needed. The fried chicken here is quite gourmet - think thin, crispy skin with moist and fall-off-the-bones meat. Then imagine smearing the indulgent, sweet honey butter all over it. You're pretty much in fried chicken heaven. I recommend getting the chicken piece-set over the sandwiches - I thought the OG chicken sandwich was too dry and masks that wow-factor from the chicken. As for the sides, out of the mac and cheese, elote salad and corn bread sides, the elote salad is easily the winner. Too bad it's a seasonal side because it was so delicious. <br><br>This place is counter service, so there might be a line by the cashier. A server brings the food up to your table after you placed the order. Service is really friendly and efficient.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/YoFvB15YtyFZ-3JYg-QYrw/348s.jpg", "caption": "The OG chicken sandwich, 8 piece fried chicken, mac n cheese, elota salad"}]}}, {"review": {"des": "Oh no... I was really excited for this spot. Something about \"honey butter fried chicken\" alludes to that 'so-good-the-heart-attack-is-worth-it' kind of status. It makes my mouth water, thinking of that Boondocks episode, where everyone gets \"the 'itis,\" there are couches in the restaurant to take an obligatory nap after 2000+ calories in one sitting, and you can only wonder what \"the Luthor\" really tastes like...<br><br>i digress.<br><br>Basically, it's like I walked into the joint, wanting to give my arteries a challenge. Get that soul food, good feel. like the feels are worth the calories, and this is the cheat meal everyone dreams is worth having.<br><br>Instead, I got a yupped up, version of fried chicken, and I'm sure kale was hiding somewhere in the menu. Their cornbead was small and drier than I would have liked. The chicken skin wasn't what Cartman and Kenny would approve of. The pimento mac and cheese was... omg. 70% pimento with 30% macaroni. not a big fan. The sides were all more \"clean,\" but not especially flavor punching for me. <br><br>Parking was rough. It's counter-service. They offer the Jones real cane sugar sodas, off a typical soda machine. Idk. I want to love this place, but I sadly, don't think I'll come back any time soon. It felt pricey for the eh kind of satisfaction I got out of it.", "pics": null}}, {"review": {"des": "Buttery flaky goodness in a wonderful hand-sized bite!  I had the \"OG\" fried chicken sandwich with candied jalapeno may and crunch slaw.  Every bite was designed to make you want more.  The flaky biscuit, the crispy chicken, crunchy slaw and spicy mayo make for a wonderful combination.  My only complaint was that the sandwich is too small for the price you pay for deliciousness.<br><br>A definite place to check out with original flavors.", "pics": null}}]}