{"name": "hoosier-mama-pie-company-chicago", "reviews": [{"review": {"des": "Had to write a review after a fantastic experience at Hoosier Mama Pie Company yesterday. <br><br>I came in to get some pie for a friend's birthday and was delighted with the customer service I received from the man behind the counter. In addition, the pies were delicious (I recommend Chocolate Chess + Sugar Cream!). I'll be back to Hoosier Mama in the future for desserts.", "pics": null}}, {"review": {"des": "My friend and I stopped here after brunch on Sunday because we were in the mood for something sweet. Plus this place is next to our brunch restaurant. <br>The decor reminds me of being in an old fashioned kitchen. The tables are very 1950's-esc and the wood paneling on the wall is very early 20th century. A water container is on the counter for guests to sip with their pie. <br><br>There's various pies to choose from such as chocolate creme, chocolate chess, confetti, pumpkin, Apple, Apple sour cherry, and maple pecan. <br><br>I had the maple pecan pie, which was fantastic! I love how the pecans are chopped up and not whole like most pies are. There is a good spoonful of chopped in every bite with the sticky, sweet filling. The pie crust is very flaky and buttery. <br><br>You definitely must stop in!", "pics": null}}, {"review": {"des": "I went Hoosier Mama yesterday for lunch and split the Chicken Pot Pie with a friend.  I was disappointed in the CPP it didn't have chunks of chicken you would expect and no white sauce.  The chicken looked like shredded chicken similar to pull pork.<br><br> The ingredients were moist and tasty but without any sauce. Usually when you put your fork in a pot pie you immediately see chunks of chicken and sauce but not in this case. I wanted to send a private email to HM but they don't have a contact email, just a phone number so I had no choice but to post a review on Yelp.<br><br>On the brighter side the apple pie and I believe it was the coconut custard pie were a big hit.  I mentioned to the young lady behind the counter how good the coffee is and she said we sell coffee in bags. I was going to buy a small bag I think it was the 12 oz. bag of the Metropolis Coffee Co.\"Schweik's Blend\" but they only had the large bags. All in all, I would go back again for the pie and the coffee but take a pass on the CPP. Sorry HM, I seldom write negative reviews.", "pics": null}}, {"review": {"des": "Pie perfection!<br>The hubster and I had a dinner reservation in the neighborhood, so we decided to stop by Hoosier Mama for a little pre-dinner dessert. (As a side note, dessert before dinner is always a good idea.) <br>When we arrived, I was excited to see how many different flavors of pie were available-- chocolate, coconut, lemon strawberry, banana... there was no option that sounded bad to me!<br>We went with the ol' American classic: apple pie. The guy at the counter was super nice and gave us TWO slices! (He explained that the first one was on the small side and didn't want us to feel cheated. So considerate!)<br>First off, the pie was beautiful and smelled yummy. Luckily, it lived up taste-wise, too! Lots of big, cinnamon-y cubes of apple inside which was fully cooked but still had a firm texture, no undercooked or mushy apples here! The crust was moist and buttery.<br>The interior of the restaurant is also cute and comfortable, with retro-decorated booths and counter stools.", "pics": null}}, {"review": {"des": "EXCELLENT pies... fresh, light, and unencumbered with sugar/syrups.<br><br>Picked up 3 pies ($54- one large sized (cherry), and two small ones- only two sizes available that Sat morning) from the Green City Farmers Market for the Air and Water Show. Just for reference, the \"large\" one is the size of a standard salad plate, and the smaller ones are the size of a small dessert plate/large coffee saucer. Steeply priced...<br><br>Michigan Sour Cherry Pie- 5<br>Seriously, I hate all kinds of cherries BUT fresh cherries. But, these freshly baked tart cherries in the latticed-top pie were DELICIOUS. The crust was also tasty! <br><br>Nectarine Pie- 4<br>Not a big fan of nectarines, but wanted to try it. Again, not sugar-loaded, and very light/fresh. Very good, but I'm sure it would be a solid 5 for all nectarine lovers.<br><br>FAVORITE of the three<br>Apple/Blueberry Pie: 5+<br>The crumble on top was delicious, and the fruit inside was very flavorful and light. I love that the sugar is next to none, especially compared to your standard pie.", "pics": null}}, {"review": {"des": "I'm a sweets person and have pretty high expectations when it comes to desserts. I felt like previous reviews mention the same thing over and over and it's odd that they don't address the issues of pie filling/crust ratio. In addition, I'm almost positive that they use shortening as opposed to butter which yields a not so flakey crust. I ordered two slices of pie to try out and was disappointed in both, simply because of the crust. It's kind of like a sandwich, the bread is the vessel and has to really shine in order to make the sandwich amazing. <br><br>There was a lot of open seating, it only took a few minutes for me to decide, but I overall just left feeling very underwhelmed.", "pics": null}}, {"review": {"des": "Umm... they have pie flights on Fridays how can you go wrong? Actually I didnt order that had a coffee and chocolate cream. They would have gotten 5 stars if it were not for the assumtion i wanted to take it to go. Its ok i still unpacked it and enjoyed it there. Coffee was strong. Pie was rich but not too sweet. I would revisit if in the area.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/s3QHlJg2aGyDdGSxfpNTEg/348s.jpg", "caption": "Mini chocolate cream!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/fAeOjAlUbK657DW0UAWTvw/168s.jpg", "caption": "Pie flights!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ejDLhCMQY9bVMevPj5UvJg/168s.jpg", "caption": "Sweet and Savory"}]}}, {"review": {"des": "Providing a quick update to my most previous review...<br><br>My hubby dropped into Hoosier Mama this past Sunday, and I was a little disappointed in the pie selection that we got this time. Now, I'm only downgrading my original review by one star to four stars total, because I still believe that their passion fruit meringue pie, my favorite pie in the entire world, is absolutely magical, and generally speaking, their pie crust is phenomenal. But, I've got to share feedback on what I recently experienced:<br><br>Hubby got the banana cream pie, and I got the chocolate cream pie. The thickness (rather, thinness is a more accurate way to describe it) of the pie crust was truly upsetting. I began biting into my pie and noticed that I was barely getting any of that lovely flaky pastry pie crust with each forkful. So I peered at my pie and realized that my pie crust was so exceptionally thin, literally as thin as a millimeter, even less. Of course, once I got to the edge of the pie, much was forgotten because again, their pie crust is so good. But I was sad that the pie crust/filling ratio was not there for me on this pie slice.<br><br>My husband's banana cream pie had a better thickness of pie crust, maybe about 2-3 millimeters thick. That said, I took a little taste of his pie filling (just the filling sans fresh bananas), and didn't taste any banana flavoring in the filling. Puzzled, I tried another bite and still got nothing - just a muted, neutral, maybe you could call it vanilla-esque flavoring of pie filling. I think how they make their banana cream pie is that they use a neutral, vanilla custard flavor, and then throw thick, fresh banana slices into the filling to deem it \"banana cream pie.\" I feel a little bit cheated; I wish that the filling itself would also be banana cream-flavored versus just adding whatever side accompaniment to label the pie a new name.<br><br>Having said all of this, one of the best pie places in the city, but I have some other favorites. Again, I would love to see Hoosier Mama explore with different pie crusts; they are known for their \"traditional\" flaky butter crust. I would love to see a chocolate, or graham cracker, etc. crust from them at some point down the road.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/dZXM9Xv7qlHUlzMCdP46cw/168s.jpg", "caption": "Chocolate cream pie. Such incredibly thin pie crust. So saddened by this. :("}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/7TOnE_s7ltQw3YKL4xV7hA/168s.jpg", "caption": "Chocolate cream pie, banana cream pie (that's a white chocolate curl on top of the banana cream pie)"}]}}, {"review": {"des": "First of all, I'm really upset at my experience here. <br>To start, the service is incredibly slow. I was in the shop for about 10-15 minutes and the people that were at the register when I got there were still being helped. All they ordered was two slices of pie and a whole one. It felt like everyone in the establishment was moving in slow motion.<br>When it was our turn we ordered a dutch blueberry pie slice and a slice of the broccoli cheddar quiche. They asked if I want the quiche warmed up - sure. 12 minutes. What? Why so long? Whatever. We waited for our quiche which was a very small slice. The quiche itself was underwhelming. Could only taste the broccoli which did not seem to be seasoned. Very bland. Not a trace of cheddar to be found.<br>Next was the pie. I LOVE blueberries and this pie was very good. However, half way through eating it, I noticed there were walnuts in it. I'm allergic to walnuts. Now you may be saying: \"you should have asked\" and maybe I should have, but all the bakeries I've been to around the city have allergen warnings on their products. Nowhere on the signage did it say \"contains nuts or walnut crumble.\" In addition, the person at the register didn't ask if I had any allergies which would compensate for the lack of signage. Lastly, dutch pies don't ordinarily contain nuts in the crumble. <br>Anyway, the dutch blueberry pie was awesome until I realized I couldn't eat it anymore. <br>I popped an allergy pill and sat in discomfort for 20 minutes as my lips swelled (luckily it's not a terribly life-threatening allergy). One of the staff members asked if I was allergic once I asked if the pie had nuts. After confirming I would not go into anaphylactic shock, he left. No apology.", "pics": null}}, {"review": {"des": "My favorite place to get pie in Evanston! It's great how they have a collection of both seasonal and staple pies year-round. We always get the chocolate chess pie and chicken pot pie. The quiches are delicious too. A great place to study, mingle and relax.", "pics": null}}, {"review": {"des": "The Earl Grey Custard Pie is AMAZINGGGGG. it was an insane crowd pleaser! Very flavorful, not heavy at all. I would definitely buy two more pies in a heartbeat if I lived closer. <br><br>This place also draws a flower next to items that contains nuts, which I appreciate. <br><br>Please please please try the earl grey. It's a MUST!", "pics": null}}, {"review": {"des": "I still stand by my previous review from 5 years ago.<br><br>Since then, they've expanded their space. It's still by no means huge but there's a bit more seating but still feels cozy. My go-to pie here is their ginger custard. The custard is perfectly baked so that it's just set and a little jiggly, and it's not too sweet, and tastes perfectly gingery, without being too much. If you like dreamsicles, you must try their orange cream pie when they have it in the summer, it is divine. I feel like I've tried so many of the pies here and I've enjoyed them all. The whipped cream IT'S SO FLUFFFYYY, and not too sweet, just the way I like it. Their pie crust is allll butter and no lard so it is extra flaky. Their savory pies are delicious too. Just get one of everything.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/cBuxbXq38b6jChlsuddiEw/348s.jpg", "caption": "New counter that overlooks the kitchen."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/RC0ORDZmIIOUp_bJN4OISA/168s.jpg", "caption": "New ordering area"}]}}, {"review": {"des": "This place is Legit!<br><br>It start with, they have a very extensive menu with tons of options. You want to eat everything. Their pies, as their name suggests- are beautiful and yummm. I had the fruity one- plum, cherry and something. <br><br>Also had their quiche. Very tasty and very filling. <br><br>They have great coffee options as well. <br><br>It is so popular that getting a table could be hard. Plus many people are there to study or work. So they won't be moving any time soon. <br><br>It's yet another gem in Evanston. Worth traveling from downtown.", "pics": null}}, {"review": {"des": "Was a long-time customer because I love pie and they're close to where I live, however in recent months, they've become complete A-holes. I've tried calling in and ordering one single pie, 2 days in advanced, and the guy on the phone smugly told me \"That's not possible. We need more notice.\" My wife called then to ask for Thanksgiving pie flavors a week in advanced, and was told by the girl who answered \"Check the website\". <br><br>Spinning J makes a better pie AND their workers are so, so nice and grateful to their customers, as they should be. Please consider Spinning J for their Chicken Pot Pies and Sweet Pies. It's on California and Augusta. you'll love it.", "pics": null}}, {"review": {"des": "Was in the area for an event and was looking for a place to hang out. This place is vey unique and sells drink s, delights and pies. I had the chocolate pie, which was outstanding and my guest had cherry turnover and it was great. My guest reminded her of times with her grandma. Parking is difficult, but it is worth the trip!", "pics": null}}, {"review": {"des": "The pies are really not that great. So many people kept saying try it. Now that I have, yuck! <br>Over priced, the crust not that good, fillings were average or a little below. I purchased the apple, banana cream, chocolate cream, and a quiche. The staff had personalities of rocks. Extremely disappointed given the hype.", "pics": null}}, {"review": {"des": "This review is more so for the pie book -<br>I've gone pie crazy. After tasting a slice of their chocolate chess pie and banana cream pie I was sold. My boyfriend was gifted the Hoosier Mama Pie Book one christmas and I've made it my personal mission to make every single pie listed within the book. <br><br>I am by no means a baker. I once made muffins instead of cookies (It was the recipe's fault! Probably...). The book is thoughtful without being too verbose (I.e. No long winded background stories that are present on seemingly every recipe blog). The instructions are clear and super easy to follow. It's also super practical - case in point - telling you straight up it's just not worth it to use fresh pumpkin and to go straight for the canned stuff. <br><br>Every single pie produced tastes like a treasured pie recipe passed down from generation to generation. I am addicted to their beautiful pies! I have a special fondness for the desperation pie section, because they are truly 3-4 ingredient pies that taste like you toiled away for hours. The Vinegar Pie is my go to favorite!!<br><br>And if you're too lazy to bake then yourself, just go buy yourself a pie from Hoosier for pete's sake!!", "pics": null}}, {"review": {"des": "The pie is so delicious. Sure, it's a little pricey, but the portions are generous and I sampled several things my friends ordered and all were great! They were out of the sour cherry I was first thinking about, so I went with triple berry. It was EXCELLENT!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/7O4waWNUJqCOKONOV1A5wQ/348s.jpg", "caption": "Triple berry pie - SO delicious!!!"}]}}, {"review": {"des": "I got to try the chocolate cream and Hoosier sugar cream pie (bc obviously you have to order the pie with the store name in it). Personally I wish the pie crust was a little thicker on the bottom but the flavor was on point. The sugar cream pie was likened to a mix of creme brulee and caramel goodness. For a slice of pie, you can expect to drop around $8-10 which I think is a bit too much. The store itself has a the cute retro diner feel which is adorable.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/foOcY0iudF-kf1VzVeaDpg/348s.jpg", "caption": "Chocolate cream and Hoosier sugar cream pie"}]}}, {"review": {"des": "I'm not sure what I expected going to Hoosier Mama Pie Company, other than some great pies.  For some reason I didn't read as many reviews as I usually do.  I was excited to try a pie flight as advertised but really had no idea what we were walking in to.  <br><br>What I walked into was one of the smallest store fronts ever.  Or maybe it just seemed that way because there's very little space partially occupied by two tables (and a third in the window) where only a handful of patrons can enjoy pie on the premises.  My friend and I were lucky enough to grab a table because eat-in is the only way to get the pie flights.  For $7, you get a smaller slice of 3 different pies from a designated selection.  This is available all day on Fridays or until the pies are gone.  <br><br>My friend and I tried Chicago Sunrise, Chocolate Chess, Fat Elvis, Sour Cream Apple, Apple and Sour Cherry.  I was pleasantly surprised by the Chicago Sunrise, a refreshing pie made with grapefruit juice and Malort.  The Chocolate Chess was a chocolaty rich delight.  The Apple was good but I liked the Sour Cream Apple was better.  I didn't think I would like the Sour Cherry as much as I did.  And I think there was agreement that the Fat Elvis with chocolate and banana cream featuring pieces of actual bananas was our favorite.  <br><br>The pies were close to if not 5 star worthy.  I'm definitely interested in returning to try some of their savory offerings though I wouldn't recommend eating there since it gets crowded as soon as there are 3 patrons inside.  The hipster pretentiousness also pulls it down a star.  But the slice of Fat Elvis helped me forget that part.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/NPQNTsIkTRD407ChQ4q8kg/348s.jpg", "caption": "Interior"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/9I_BA2Bl18wkXQVk28ytrQ/168s.jpg", "caption": "Friday Pie Flight"}]}}, {"review": {"des": "Came back today with a friend and was very happy with the service and the Mexican Chocolate pie! Will definitely need to take a new route home since I'm on a technically supposed to be on a healthy diet...", "pics": null}}, {"review": {"des": "Who's my Mama?!<br><br>Well, I know and love my Mama, but I can cheat on her desserts a little bit since I don't live at home. Instead, I've got access to one of the best pie spots you can find here in Chicago. (Shout out to my friend Brian W. for the recommendation)<br><br>This small shop was cute as hell. You walk in and your senses become overloaded with curiosity as you wonder what they are baking into these pies. There is very little seating inside minus a small table near the window that makes you feel like you're putting on a show. However, dine in or out, this place will get you going with their pies.<br><br>We tried a slice of their grapefruit pie and their Pulled Pork Pot Pie. Both were less than $10 and came out quickly after being heated up. <br><br>Having never tried grapefruit pie, I was skeptical at first. However, one bite into each of these and we were sold. The pies here were BOMB. The grapefruit itself was AMAZING and wasn't overly sour or bitter at all. Flaky crusts and tantalizing fillings filled our bellies and we couldn't stop enjoying each and every bite.<br><br>As we were dining, folks would pop in and out requesting certain pies. They take orders for whole pies of many variations at least a day or two in advance. I definitely want to come back and try their Earl Grey Pie as I eavesdropped over... it sounds fabulous,<br><br>Definitely will be back for more in the future.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/YFbjU1uh6__RRBQtAV7WyQ/348s.jpg", "caption": "Pulled Pork Pot Pie"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/hd7IF44X1UFA1sWPLmP8Ig/168s.jpg", "caption": "Grapefruit Pie"}]}}, {"review": {"des": "#PiDay<br><br>A must on 3/14 but everyday is more likely. I had the coconut cream pie and the banana cream pie and both were great. My son especially like the banana cream pie. He said next Saturday he wants another one....<br><br>Back again on Saturday 3/17", "pics": null}}, {"review": {"des": "A place that only sells pies, what's not to love!! I really wish this place wasn't so far away, or that I was able to bring home a whole pie. Just sitting here writing this review, I'm already missing the pies. They make their pies fresh, daily. There seating inside but of course you can take your pie to go, and if you do, they come in these cute little pie containers. We had the bourbon peacan pie, chess pie and confetti pie. My honest favorite was the confetti pie, which surprised me because I really came for the chocolate chess pie. There was something about the layers of the pie and the combination with the crust that made it perfect. The bourbon prcan pie was the next fav and although I was there for the chocolate chess pie, it wasn't what I thought. I guess I should've ordered the chocolate cream pie instead. Nonetheless the place is fantastic and definitely warrants a visit. My husband had to limit me to only 3 pie choices, but given the opportunity I would have ordered one of everything on the menu!!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/T1IhjkGQpZ72WcwoqtIALw/348s.jpg", "caption": "Sorry it's half eaten, but this was the confetti pie. Just look at those layers of goodness!!"}]}}, {"review": {"des": "I usually don't write reviews but this is pretty ridiculous. Stopped in to get a slice of quiche before heading into work. I didn't bat an eye spending 7.50 for one slice because I figured it would be worth it. What I got was the tinniest slice! The filling was barely half an inch thick and barely any actual quiche filing, just mostly broccoli and cheese. Seriously? The slice is so small it's comical. Like two bucks a bite small. <br><br>Save your time and money and get your quiche fix elsewhere.", "pics": null}}, {"review": {"des": "My sister and I were in Chicago for a day and Hoosier Mamas was one of our food crawl destinations. We were so glad with our choice because the pies here are incredible!<br><br>Staff was super friendly and helpful with recommendations. We decided to split a slice of lemon chess because we had burgers and ice cream just a few hours before, heh. The lemon custard was super smooth and the perfect balance of sweet and tart. The crust was incredibly flaky and buttery! I wanted so bad to buy a whole pie of this to take with me on the flight home. Instead, we went with a classic and travel friendly one -- apple rhubarb. <br><br>I took it to work with me today and it was a hit! Wasn't overly sweet and I loved the crumble topping. <br><br>Next visit to Chi-town will also be a visit to Hoosier Mamas.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/W54QJPzeIk7i4thSV3nRag/348s.jpg", "caption": "Lemon Chess"}]}}, {"review": {"des": "One word. Amazing. One sentence. It Knocked my socks off! I have dreams about this pie constantly. The passion fruit merengue will make you wanna smack yo mama and yo grandma. I came in on a Thursday to meet a friend and enjoy some pie. Everything looked and sounded amazing so I had a very difficult time deciding but I love a good tart pie so I had my decision affirmed with the employee and decided to give it a whirl. My friend ordered a chess pie which was tasty. Mine comes out, and first of all, let me just say shout out to the employee that made my week and blessed me by giving me an additional slice on the house (because it was the end of the day and the last one). Words can't express my gratitude! Thank you so much!!! So my pie comes out and it's beautiful! Thick, fluffy merengue that looks like a huge roasted campfire marshmallow on top. The inside of the pie was this beautiful yellow custard that was so smooth. And let me say when you cut it, you can smell the passion fruit. Now when I tasted this thing, I was in awe. The merengue tasted indeed like a roasted marshmallow and it's everything you want a merengue pie to taste like except even better! The custard was so tart and sweet but very special because of the passion fruit taste. The crust was so buttery and flaky. Omg! Please just go and have it. It is everything.", "pics": null}}, {"review": {"des": "In love with the all the pies. This spot is cute too. Perfect place for eating your feelings or for stress eating while getting stuff done.<br><br>They have delicious scones too! I'm a fan of the everything scone :)", "pics": null}}, {"review": {"des": "The problem with following Hoosier Mama on Instagram is that every morning you drool all over yourself from all the enticing possibilities they're serving up that week. Each day, your need for pies builds and builds until (blessedly) Sat arrives and you find yourself exiting the shop, carrying $90 worth of pies. I mean, choose one or two pies? Surely you jest. <br><br>You're not going to buy \"a\" pie, but you're not going to let $90 worth of pies go to waste either. Of course not. So for three days straight you're going to eat those pies morning, noon, and night. Until you're digging out your elastic pants to make more room for pie. <br><br>Out of ALL the pies I've had now, I've consistently gone back to my favorite. -the Sugar Cream. It almost has the flavor of vanilla ice cream in a perfectly buttery crust. I always find myself inexplicably wondering if another bite will taste as good as the last one I just tasted. It always does. But I'd better have one more bite just to make sure. And then another. And then one more again. <br><br>PS: Don't be silly and pass on the pot pies. They're freaking delicious.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Kb9ZbS3LihiNXGhVjSbL2Q/348s.jpg", "caption": "A perfect chicken pot pie baked at home for 1 hr @400 degrees."}]}}, {"review": {"des": "If it's a Friday, I'm going to encourage you to run over to Hoosier Mama the second you finish reading my review. I'm all about their pie flights. Three \"small\" pieces of pie for $7? SOLD. <br><br>They typically offer five to six different pies to choose from, but be beware that when they're out, they're OUT! When we rolled up around 5:00pm, they were down to four options. I opted for the Apple & Sour Cherry, Chocolate Chess (described as a brownie filling) and Maple Pecan. I can't even begin to pick a favorite because they are all perfection. <br><br>It is a very tiny shop with only three tables, but it appeared that most people take their things to go. We sat at the big sunny windows and enjoyed being in the shop though! I might have to start stalking their Friday pie flight menu and make this a weekly trip. Hoosier Mama is the type of place that will convert anyone into a pie lover!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/vQniO_XYSjGxIdkSB4boVA/348s.jpg", "caption": "Top, going clockwise: chocolate chess, apple & sour cherry, maple pecan. Pie Flight Perfection."}]}}, {"review": {"des": "I always enjoy a slice of pie from Hoosier Mama! I love going there in the am when the pie is still warm from the oven. Yum! Got a slice of the apple today which has a pleasantly salty crust and tender apple filling. It was gone in no time at all. Brought an Agnes pie (peach and blueberry) into the office and it was demolished in literally minutes. I can't speak to the cream pies as I haven't tried them, but the fruit pies are delicious.", "pics": null}}, {"review": {"des": "Not only do they have amazing pie, they have pot pie and quiche. This is a place you can come in for dessert and a meal. You can beat that. Everything is freshly made and tastes like it was made with love! OMG if you haven't been here, Idk what you're waiting on. I tried the Jeffersonville (maple bourbon pecan pie with a taste of chocolate) and my husband got the chicken pot pie. Both were absolutely delicious. I will surely be back... probably next week.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/8I6UtFEBYOTsmxx5HO0iIA/348s.jpg", "caption": "Chicken pot pie"}]}}, {"review": {"des": "I have been a faithful customer of Hoosier Mama Pie for as long as they have been opened.  I frequent them at least 12 times a year, and purchase the chocolate silk pie, or banana cream pie, those are my favorite.  I tried the chicken pot pie, but would not try that again, as it was dry, and tasteless.  While, I like their pies, I am done with them as their service is horrible and their practices doesn't make sense.  I visited them twice in September, and maybe early October, and asked if I could place an order for Thanksgiving, and I was told I could not because they were not taking orders at that time.  Didn't make sense, but I said ok.  I can't remember if they told me when to come back, but I decide to go today, thinking this is a good time to go before November, and guess what:  THEY ARE NOT TAKING ANY MORE ORDERS!!!!  Can you believe that.  I wasted my morning driving from the south side to the north side only to be told no.  Then, she tells me I could come during that week and try to get a pie, as they will be making a limited amount of pies to sell to customers.  Now, I would like to preface, I tried this last year to get a pie only to arrive 10 minutes after the store opened for them to only have savory pies left.  So, no, I will not try that again.  I was told I could come and wait in a line before the store opens to hopefully get a pie.  Yea, but no, the pies are not that good to wait in line for.  But if someone can explain to me why a company would prefer for me to come and wait in a line to maybe purchase a pie when I can place an order that would be fantastic!!!  It makes no sense.  I understand you can only make a certain amount of pies, and since you're so busy during the holidays, you should only be making pies for orders and not for walk-ins.  Although, my little $200-$300 a year may not mean much to you, it means a lot to me, so with that, I will not be spending another dime with Hoosier Mama. Guess, I will make my own pies and save some calories.", "pics": null}}, {"review": {"des": "A cup of bottomless coffee, a HUGE piece of Apple Pie and a warm and friendly atmosphere!<br><br>I was on my way home after visiting with my friend HaleyBeary and her brand new beautiful baby girl.... I was a little hungry and decided to explore the neighborhood.  I went left instead of right and found my way to this place. I looked into the window while passing by, but was compelled by how the place looked; like someone's actual kitchen, complete with mugs, Kitschy table and tablecloths...and the guy up from behind the counter all smiles as I passed.....<br>So I walked in. The warm and awesomest aroma of pies filled the air. Savory, sweet, cream, rhubarb, and my favourite-APPLE!<br>Geez Louise!!! Did you people know about this place??? I didn't. With all the construction, and noise going in outside it's the best place to be. <br>And the guy behind the counter, his name is Neko. His smile as I passed by continued  to shine as he went about his duties.  Really rad and cozy digs. <br>PLEASE come and get a slice or 2 of pie. It's a jewel in the hood that needs to never EVER close down as businesses do in Chicago because if high rents or lack of patrons. Come write a novel here or just read one while you sip a cuppa and nosh on a savory pie.<br>So much for my carb free, sugar free diet. Absolutely Adorbs and fucking delish. I love it here and I'll be back soon!!<br>Thanks Neko<br>..", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/YosuAbHfffEUy5eEdWTMkA/348s.jpg", "caption": "Enough said!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/3xrH2RAkaX-L2wbfgcaXxQ/168s.jpg", "caption": "Convenient Hours for pie!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/DBJoo9mPg7O4CRizhHGsDw/168s.jpg", "caption": "Got a BIG ol' piece of Apple Pie 'n Coffee!"}]}}, {"review": {"des": "Cute little place with excellent pies in East village.  I had a slice of salted caramel banana pie. Would definitely come back to try other flavors.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/UsmYfyFPlaHnz82DdHaczw/348s.jpg", "caption": "A very slice of sales caramel banana pie!  Recommended."}]}}, {"review": {"des": "Quiche slices are 1/8 of a 8-9 inch pie - appetizer portion for entree price! Far too dear for us retirees although very tasty. I had the spinach goat cheese quiche on 3/2/2018 - a slice was $11. The filling was very tasty and light. The crust was solid and sturdy, not flaky, okay but not great.<br>The husband had a mushroom quiche. The filling was light and tasty, sturdy thick, not flaky crust. He was still hungry and angry about the size of his slice and its price.<br>We also tried the passion fruit meringue pie. The slice was about 1/6 of a 8-9 inch pie. The meringue was soft and not too sweet, just enough to perfectly accompany the tart filling. There was only about 3/4inch deep layer of the passion fruit filling to about a 3 inch layer of the meringue. I would have enjoyed more of the passion fruit filling in the slice. Again a very sturdy, not flaky, hard to cut with a fork crust.<br>Three slices for over $20 and still hungry.<br>Paid street parking.", "pics": null}}, {"review": {"des": "I was very disappointed with my pie from here. I love pies and I've been wanting to come here for so long. I may have hyped myself up a little too much. I would probably rate this a 1 star but I don't like giving those out unless I've been somewhere twice and have tried a few different things.<br><br>To start, my slice of pear apple & cranberry was $6. That's really expensive for a pie but I'm willing to pay if it has good flavor. It really, really didn't. The biggest disappointment was the crust. The crumble on top wasn't a dough crumble, it was just cinnamon sugar, which tasted really weird with the pie. The crust on the bottom was really thin and barely noticeable. The filling was fine but I would have liked it to have more cranberries for the tartness. Whole foods has a better (seasonal) Cranberry Apple pie for a quarter of the price. This was just not good!<br><br>That's not to mention the girl at the counter who served me. She was rude and uninterested in answering any questions (there was no one behind me). Just not a good experience overall.", "pics": null}}, {"review": {"des": "SUGAR CREAM PIE. It's my personal favorite but honestly, all of their pies are amazing. Enjoy a slice with a cup of coffee and take a small pie for the road. Get a pie for the office, get a pie for your next gathering with family/friends-everyone will love you. I especially love getting these pies for the holidays, but make sure you have reservations about a month+ prior to the holidays. Bang bang who? Jk. Support all your local businesses.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/YYM9jx6ujgmnqqZy28_4RA/348s.jpg", "caption": "Sugah Cream Pie"}]}}, {"review": {"des": "Holy mother of passion fruit, Batman! This is some dangerously tangy and fluffy meringue pie. The passion fruit literally jolts your palette and the meringue brings you back down to Earth. The combination is out of this world! Do yourself a favor and get yourself some pie from this joint. It's worth it!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/0qWGZuGiuHT7cm52wOdH7A/348s.jpg", "caption": "Passion fruit meringue"}]}}, {"review": {"des": "Home made apple pie and hot black tea. <br>Sounds good doesn't it ? <br>$10 for the two sound good?<br>I didn't think so. <br>My opinion of this place is that it has certain amount of pretention with it's down home local staff, home made everything, and pricey nosh.<br>My standard for good apple pie is not too sweet<br>or spiced. Somewhat light flaked pastry you can cut with your fork. You shouldn't need a knife as well.<br>They failed my expectation.<br>Yet this place is constantly filled with munching yuppies and students. It boggles the mind.<br>There are at least three locations now and I've only been to the one in South Evanston. <br>And they are expanding. <br>But I dont think I'll be coming back soon.<br>Not when I can get pie ala mode and and endless coffee at most Golden Nuggets for around $8 bucks w/tip.<br>And I won't have to bus my own dishes.", "pics": null}}, {"review": {"des": "I am giving it only four stars, not because of the pie, which made me weep with joy, but because the space is too small, and crowded. For those wanting to try this, you are better off taking your pie to go. The interior is charming but the space is awkward and as a small business, I am sure they are doing the best that they can for now. But once you bite into that beautiful crust...all will be forgiven. Be prepared for pie off the charts and the long awkward line to get it. Patience is a virtue in this instance. P.S. there are women in this kitchen!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/F6V3jcioYAFPMJmWtrv8lQ/348s.jpg", "caption": "This is what you will see relatively quickly..."}]}}, {"review": {"des": "Very friendly customer service, s'mores pie was incredible, meringue topping, delicious graham cracker crust, smooth chocolate filling and a ganache beneath that. Really cute place, old fashioned diner feel. Go for the pie not the coffee. Would like to go back to try the fruit pies.", "pics": null}}, {"review": {"des": "We tried the chocolate cream pie and it did not disappoint. I'm a chocolate lover so it was heavenly for me. I've been here before and had it at a friend's house once as well and thought it was some of the best pie I've ever had. <br><br>The whip cream is so soft and light and the chocolate has a very mousse like texture that I love! Definitely worth trying.", "pics": null}}, {"review": {"des": "Been here many times, but recently service has gone down. Last time I stopped by to get some slices to go, all of my slices were smashed and there was whipped cream all over the plastic container (was bringing this as dessert for a friend). They also forgot a slice I had ordered (she didn't apologize at all) and I had to reorder it--no biggie but as I watched the woman cut the slice it's as if she was upset I had reminded them about the slice I had ordered. As I got my bag, I asked if I could have some forks and she definitely wasn't in a good mood as she gave me 1 fork (I had three slices of pie) and I asked for one more fork and she rolled her eyes. I get it, everyone has bad days but you don't have to take it out on a stranger or a customer.", "pics": null}}, {"review": {"des": "Was very excited to try this place because well 1) pie.. and 2) ..........pie. Nuff said. I love my sweets. But I was pretty disappointed with my trip. <br><br>I walked in on a Sunday after brunch around 2/3pm, and saw only a few pies laid out. It was SCORCHING hot in there, so all my friends opted to wait outside while I was determined to try some of this pie. I was confused by the layout, there was nothing labeling any of the pies, and the menu was hard to read. No one offered to assist me as I stared looking very confused at the display case. The two ladies just kind of looked at me until I pointed to a pie and asked which flavor it was. It seemed like I was wasting their time, although there was no one else in the store. I pointed to one that I assumed was a Coconut Cream, and told her I'll take that one. Without saying anything, the lady starts packing up a small full round pie. I quickly let her know I'm just looking for a slice. Again without saying anything, she repackages another slice. I pay and leave.. it was weird and I was honestly ready to get out of there. <br><br>With the awkward encounter and not a lot of options to choose from.. I don't see myself coming back. The pie itself was good, but I don't think there was any crust on the bottom of the pie (maybe she accidentally scraped it off?). I don't know.. but what I do know is for $6.06 for one slice of mediocre pie... I'm probably not going to make another trip to Hoosier's.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/wNwXzD4AEeQQGlQSFC0HxQ/348s.jpg", "caption": "Coconut Cream"}]}}, {"review": {"des": "I have been meaning to go to Hoosier mama for a while and I am so glad I finally did. They had quiche and a few pies available which made me sad because I didn't know they sold out early in the day. SO AS A WARNING GO EARLY IF YOU WANT LOTS OF OPTIONS!<br>That said I was very happy to have their take on pecan pie. It was chocolatey, caramelly, and nutty. A delicious treat that had enough weight to qualify as almost a meal replacement instead of just a dessert. Stop in for a slice or grab a whole pie if you have an event to go to.", "pics": null}}, {"review": {"des": "A great bakery right next to the El stop! The decor is really cute and it's a great place for getting work done. When you first walk in you're hit with the best smell in the world. I've had the chocolate chess pie and it is so rich and fudgey like a brownie. The crust is perfectly flaky. I only have had sweet pies but my friend got the chicken pot pie and loved that one as well.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/uK1I3GHxv0DATxkcPU9Cow/348s.jpg", "caption": "Chocolate chess pie"}]}}, {"review": {"des": "This is a cute little shop. There aren't many places to park on the street. I was lucky someone was leaving just as I was pulling in, so I didn't have to park too far away. The guy who rang me up was friendly, and the girl was helpful in giving me instructions on how to reheat the pies. I bought 3 pies from here: a large pork apple sage pie, a small frozen chicken pot pie and a small coconut cream pie.<br><br>The chicken pot pie was good, not great. The crust is really the best part, the filling was no better than any other pot pie I've had. I also felt like the filling could have been seasoned better, I had to add some salt and pepper. <br><br>I did not try the pork apple sage pie, but my family did. They said that it was good, but too dry. It needed more juice or gravy or something in it. They weren't overly impressed. <br><br>I really wasn't a fan of the coconut cream pie- I thought it was bland. My family thought it was just okay. Outside of the shredded coconut, the filling really didn't taste like anything to me. It needed more flavor and more sweetness. And on the first slice I cut, the bottom crust was so hard that I couldn't even eat it. <br><br>Overall, I think the pies I got were good, not great. And it's kind of overpriced for average tasting pie: I spent almost $60 for the 2 small pies and one large pie. I expect greatness for that price lol. I wouldn't go out of my way to go here again. If I happen to be in the neighborhood, it's possible that I'll stop in and try a slice of a different pie to see how it is. But it won't be my first choice.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/s8jK0mXcL7b2_go3pLXGEg/348s.jpg", "caption": "This is the small coconut cream pie."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/G3xBQIqDN1K1pBxAaWUXXA/168s.jpg", "caption": "Large Pork apple sage pie"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/F7VWlbdGtz4n_ljl22LBew/168s.jpg", "caption": "Small chicken pot pie. I bought it frozen, and baked it at home."}]}}, {"review": {"des": "Ordered 2 pies for Father's Day. Good thing I arrived to get in line before they opened as when i left there 15 people behind me. Key lime pie was very good. The bourbon pecan chess pie was all crust and filling with a handful of pecans on it. Quite dissapointing. Maybe this how it's supposed to be but I was expecting a Pecan pie loaded with tons of pecans. All in all,   not really worth the $46 imho", "pics": null}}, {"review": {"des": "One of the best pie shops in Chicago. Handmade and fresh. I love their special passion fruit pie but my list of favorite lies is much longer. <br>Prepare to stay in line on busy day. The pies are worth to wait. <br>They accept cards so it's convenient. Some shops don't.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/WxHduKQO73mb-6C1hp2e8w/348s.jpg", "caption": "The bag full of goodness"}]}}, {"review": {"des": "I could smell this place about 100 feet before the the entrance. As soon as our Lyft driver pulled up to the street and I opened the car door, my nose was like, \"That better be pie.\" Ohhhh it was pie alright. Hot and cold pie. Sweet and savory. Classics yet creative spins on classics. <br>My husband and I were lucky to stroll in on a Friday during their Friday pie flights. 3 small slices of pie for $7 or 4 for $8. They have a selection of about 5 pies to choose from. We were lucky to try: Dutch apple, honey apple courant, bourbon pecan, and chocolate chess. Everything was incredible. <br>The Dutch apple was served cold with a sweet cream tucked under the crumble topping. I have no idea what was in there...but it was spectacular.<br>The honey apple courant was reminiscent of a sweet iced tea. So unique and tangy on the back of your tongue. Would be delicious served warm with some vanilla ice cream. <br>The bourbon pecan was as good as all the others. It was surprisingly light. Generally pecan pie is dense and heavy. This one was sprinkled with pecans rather than packed with it. An interesting take for sure. I would've appreciated more pecans but I will not complain about the taste!<br>The chocolate chess was the last we tried and we were not disappointed. To me, it tasted like a flourless brownie. Soft, chewy, with some crunchiness from the buttery crust. It was lightly dusted with powdered sugar. Again, I'd suggest that be served warm with some vanilla ice cream. So, SO good.<br><br>It does not end there. We also devoured a small chicken pot pie, and it was the BEST I've ever had. The vegetables and chicken were fresh and roasted and the potatoes still had the skin on which made for an amazing pie. It was rib-sticking and packed full. The definition of comfort food.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/hPa6XJBMuK3ZkY_45OsVRA/348s.jpg", "caption": "Amazing"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/3a061mIbZJnBWpNz_b0cjw/168s.jpg", "caption": "Chicken pot pie is out of this world"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/yoiOOMFhqECaikbMhG62kQ/168s.jpg", "caption": "Shortly after receiving delicious pie..."}]}}, {"review": {"des": "Not a huge pie person, but that chocolate chess pie is a game-changer.  I would be delighted to try other flavors but if I only had the chocolate chess from now til I die, I would honestly be okay with that.  :)", "pics": null}}, {"review": {"des": "This is a strange review to write. The pies are very good, some of them are better than good; the concept is great; the ambience is, generally-speaking, a good one; many of those that work HMPC are fairly friendly. It's pricey -- but that's even OK, if you've got the cash to spend, because it's pretty good. But when this place get's busy they just don't deliver. I stopped in to get an apple pie for a dinner party and waited 25 minutes in line just to order, paid almost $40 dollars for the pie, and then waited another 20 for them to give me the pie. They run only one register no matter how long the line and they treat pie purchase like meal purchase. Even though the pie you ordered is already beaked and ready to go they make you wait for every meal ordered in front of you to be prepared before they'll give you the pie. That is, they won't put your pie in a box and hand it to you until everyone eating-in and getting take-out gets their items that have to be prepared. And when things get backed up customers start getting aggravated and the HMPC team members start to snarl. I observed one berate a customer with \"Can't you see we're busy?\" while casting a scornful look. One guest suggested a second cashier, to which the cashier said, \"Yeah, but we'd need another cash register,\" which was harmless enough, but did demonstrate just how clueless these folks are about customer service. I know you're thinking that I should just relax and hang out patiently in a situation like this, but I was just picking up a pie. And, while the pie is good, it's not that good. I might go back, but I wouldn't wait in line again.", "pics": null}}, {"review": {"des": "I took a week off work to come back to Chicago and visit family this winter. Late review from 1/4/17.... Definitely had to make a stop at Hoosier Mama Pie. It's not cheap by any means, but you just can't stop coming which means, at least for me, the pie is worth the dough (ha haaa) I fork over (see what I did there).<br><br>Missed the ginger pie that I had back in 2015 but nevertheless it's always a pleasure coming back! Highly highly recommend the Hoosier sugar cream pie to any newcomers. Hopefully I'll be back soon.", "pics": null}}, {"review": {"des": "The pies are decent here above average I would say it's not worth the money $15 for pie is ridiculous while I understand it's a specialty item it's a once in a while place.", "pics": null}}, {"review": {"des": "I decided to give up sugar for awhile, but this specific day  I needed a fix fast and for some odd reason I wanted pie. I googled best desserts in Chicago and Hoosier came up. I was intrigued by the pics and types of pies, so I wasted no time and got there. I was initially going to leave, because my idea of a of a pb&j pie was different than what was presented. However the young lady at the register was very patient with me and well informed on the pies, and how they should be eaten, and there intricate tastes. I eventually after much deliberation decided on the Hoosier sugar cream pie, which was really great and the right amount of sweetness. I never had anything like it, and as I'm writing I would love to have it again.  The pie was nothing but cream brown sugar and a flacky crust... Mmmm.  <br>So FYI, there are a good number of pies available daily and if you are the pie and coffee type this could be a new haven for you. For me, I have found a new treat that tickles my taste buds. Happy eating!!", "pics": null}}, {"review": {"des": "Cozy, authentic retro digs. Fantastic coffee, pies that are out of this world and the best spot in the area for breakfast muffins, quiche and the like. Absolute gem.", "pics": null}}, {"review": {"des": "I have loved every single slice of pie I've had here. Fear not--just about everything here is good! The chocolate cream pie was better than I could have hoped. Rich, chocolatey, smooth, and dense in the best way. The sugar cream is a specialty of theirs, and is lovely. The buttermilk pie is tangy and surprisingly complex. The chocolate chess is melt-in-your-mouth delicious. And savory pie? Don't even get me started! I'm particularly fond of their pork and apple, which is rich and moist but not at all greasy. I'd come here every week if I didn't fear for my waistline.", "pics": null}}, {"review": {"des": "In the running for some of the best pie I've ever had. You can tell as soon as you enter from the decadent buttery aroma that this place has high output and quality of their namesake. The have a rotating variety of 12-5 pies or so a day, and of the ones I've had they generally nail the crust and filling, down to small details like the delicious crumble topping for their fruit pies. Don't miss Fridays, where you can get a flight of 3 flavors for $7.", "pics": null}}, {"review": {"des": "We ordered a passion fruit meringue pie for my birthday, we order one ever year. However, this year there was more meringue than the actual pie. It's still very delicious but we were mostly eating meringue. especially for how expensive it is I don't want to just be paying for more meringue than the actual pie, disappointing this year.", "pics": null}}, {"review": {"des": "Very cute, vintage/retro looking cafe! Came here after brunch for dessert. Tried the banana cream pie and the lemon pie. Both were super delicious! Hard to say one was better than the other due to the difference in taste, but I would definitely go back for the banana cream pie! Didn't try any of the savoury pies, but most people looked like they were going for the sweet ones.<br><br>Brought some back for the roommates and they both really liked both pies, but demolished the banana cream one.<br><br>Worth trying!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/4x-2V3FU5KwjtXo8d6tpuA/348s.jpg", "caption": "Banana cream pie and lemon pie"}]}}, {"review": {"des": "I was able to try:<br>-chocolate pecan pie - rich, but very tasty<br>-passion fruit merenge - very good<br>-coconut creme pie - nice and light! yumm!<br><br>AND THE TWO BEST FOR LAST:<br>-cranberry/apple/pear walnut crumble<br>-chicken pot pie<br><br>The walnut crumble and chicken pot pie were to die for! Seriously the best. Best of the best. The 5-star rating goes to these two.", "pics": null}}, {"review": {"des": "Stopped by after having brunch at Beatnik and picked up 4 slices of pie to go.  Chocolate Cream was my favorite!  I thought the Apple was nothing special.   $24 and change for 4 slices is pricey.  Took my pie to go, but the place is cute with plenty of open tables around 1:30 on a Saturday.  I'll be back to try the passion fruit pie that another Yelper mentioned.", "pics": null}}, {"review": {"des": "I have very mixed feelings about this place.<br><br>On the negative side:<br>-the food is a tad overpriced <br>-they are slower than snot, forget calling ahead and placing your order...they wont take it.  You are forced to wait for at least 10 minutes, once even 25 minutes...for your food.<br><br>On the positive side:<br>-Some of the pies are really good...including the blueberry and fat elvis.<br>-The blueberry tea is phenomenal<br><br>All in all, I wont be coming back this winter...maybe this summer on a weekend, when I have loads of time to wait for my order and can sit outside at one of the many tables.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/wCRowd0n7DAz_xVltfoNMA/348s.jpg", "caption": "It tasted as good as it looks!"}]}}, {"review": {"des": "There's nothing better than great pie. Correction, there's nothing better in this world than Hoosier Mama Pie. Why else would I wait in line, in rain sleet or  snow? Think I'm kidding? Look for me any random Sat or Sunday waiting for  slice. <br>The pies are made fresh, and they are seasonal based on local ingredients. I literally call in advance to see if Maple Pecan is available. As sad is it sounds, sometimes you need to keep a guilty pleasure like pie in your life.", "pics": null}}, {"review": {"des": "I haven't actually been here, but I was gifted a chicken pot pie and it was awesome. Perfect size for one person. I just put it in the oven for 15 minutes and it turns out so good. The crust is always the best part. It was golden, crisp, light, and flakey. The flavors inside the pie complimented each other so well and I'm dying to have another one. Viewing their website makes me want to eat all of them because visually they are phenomenal and I know they have to be great.", "pics": null}}, {"review": {"des": "Wife wanted lemon meringue pie for mother's day and sent me into the city with a mission to find the best one. <br><br>I asked a few friends as well as doing standard internet diligence and came away with Hoosier Mama as the place to go.<br><br>Of all the things we did that day she said that this pie was the best part of her mother's day, so either I am bad at executing everything else, or this pie is really really good.<br><br>I'd prefer to believe it's the latter.", "pics": null}}, {"review": {"des": "Finally tried the pie from this establishment and it lived up to all of the hype. I am obsessed with Peanut Butter, so of course the Elvis sounded like something I needed to consume. For $8, I received a mini pie that could have been crushed in one sitting, but easily lasted me several days.<br><br>Like most sane people, I understand that there is no better combo then PB and Banana. The Elvis throws chocolate into this mix as well, along with pretzels and the taste is unreal. Is this the best pie I have ever consumed in my life? Yes. Yes it was. <br><br>I am quite lucky I live far away from this pie shop, as I would be a much larger person otherwise. Look forward to trying a fruit pie on my next visit. I can only imagine how hood those most taste.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/bt9N8kyENUIWdqNPk4bTmg/348s.jpg", "caption": "The Elvis"}]}}, {"review": {"des": "Nice selection. Helpful staff who also packaged pies nicely. Pies are a bit cheaper than Bang Bang. Purchased a small espresso pie and a regular sized cranberry pear for $34 total. Pie was full of large pieces of fruit and crust was delicious. All was impressed and we will return.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/UDdbxI-4bDL7VZ4iKaMkXQ/348s.jpg", "caption": "Pear cranberry"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/uIIKqoeUDtDwZcrTzUMkCQ/168s.jpg", "caption": "Pear berry pie"}]}}, {"review": {"des": "Not necessarily a pie person but had to stop in on our West Town Art Walk.  <br><br>Tried the lemon cream pie and it was definitely worth it! Sweet and tart with a flaky crust this pie delivered on spot.<br><br>They were generous enough to give us the last sliver plus a bit extra since it would have been hard to cut.  We were easily able to split this piece amongst 3 of us with enough for all.<br><br>I wouldn't mind trying another slice next time in the neighborhood.", "pics": null}}, {"review": {"des": "NEVER AGAIN! I ordered online and chose an Apple Sour Cherry with Oat Crumble pie and a Broccoli/Cheddar Quiche. We went to the store to pick up the pies and had lukewarm hot chocolate while we waited to get the order. We didn't open the boxes until the next day and what a SURPRISE.  <br><br>We received the Luanne Quiche instead of what I ordered!  It has bacon or ham or some kind of meat, so unacceptable!!!!!  The \"fruit\" pie had very little fruit, a lot of sugary syrup and at least 2 inches of an oatmeal (granola) type topping.  These were supposed to be two special pies for my husband's birthday. UGH!!!<br><br>I have photos and wish I could share them.", "pics": null}}, {"review": {"des": "Hoosier mama on any given day seems to be busy all the time! Which I guess is a good sign because it just means that they're obviously doing something good. I ordered a banana creme pie and thought it to be meh. I should've ordered an expresso pie (I had it at a friends place which turned me on to this place!) Now lemme tell you... that pie was the bomb!!!! Or next time I'd like to try a chocolate chess or savory chicken pot pie. <br><br>The other reason for the 3 stars is due to the lack of a pick up window. I arrived on a busy weekend afternoon and despite 2 people behind the counter I had to wait 25 minutes in line for a pick up order.  I was in a hurry and had to make my next appointment so waiting in that line was inconvenient  It would have been nice to have a separate window for that. I' m still willing to give this place another try though for their awesome pies.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/X5FLzLfsbF78Q9BO0Tn5Cg/348s.jpg", "caption": "Employees at work"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ibXsRDWOlw-BY1dQho0R6g/168s.jpg", "caption": "Banana creme pie. Not a big fan but to each's own"}]}}, {"review": {"des": "Hoosier mama really does have the best pies. Their chicken pot pie is amazing, but surprisingly their vegetable spinach one knocks that one out of the park!!! I also LOVE their coconut cream pie and chocolate cream pie. Their coconut cream is #1! I had a large order about a month ago for a work party. They didn't tell me they weren't going to cook the pies, so I found out half hour before the work party.... luckily jewel was around. so just know they do not cook full pies there!! GREAT FOOD", "pics": null}}, {"review": {"des": "My friends put in a strong recommendation for this place so I was in the neighborhood so I thought I'd give it a try!<br><br>All they pies sounded really interesting--chocolate cream, chocolate chess, almond joy, banana cream, horchata, apple, and more--and I wanted to try them all. I ended getting the chocolate cream and it was pretty good! It was smooth and rich and satisfying. The slice of pie was large and I couldn't finish it in one sitting. The only thing I wished was that the crust was more substantial.<br><br>The pie shop itself is really small and has only a couple of seats. But it's cute and the staff were friendly. I hope to come back and try all the other flavors.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/guEd3HYE0KMwU3bQM_Y4fg/348s.jpg", "caption": "Chocolate cream. Very rich and smooth."}]}}, {"review": {"des": "A gem of Chicago Ave, hoosier mama, serves up insanely delicious pies--both savory and sweet. Beware, you might end up ordering additional slices. The sour cherry slice was heaven.", "pics": null}}, {"review": {"des": "This place is simply the best! Cute, quaint, intimate interior. Makes you feel like you are out in the country somewhere right in the middle of west town! The ingredients are fresh, the food is delicious, the staff is friendly and helpful. It's extremely risky living dangerously close to Hoosier mama! I really need to find a spin class to work off all the treats ASAP! Highly recommended!!!", "pics": null}}, {"review": {"des": "So disappointed in my first pie from Hoosier. Sunday morning I got there at opening, 10am, ready to buy a pie for a family barbecue later that afternoon. I purchased the Apple Rhubarb and the Chocolate Cream. I'd give the chocolate cream 4 stars - light and airy with a rich dark chocolate flavor. However, the Apple Rhubarb was like goop. The crumble on top was crisp and delicious, but the inside was liquid-y goop. You could not even cut a piece and instead needed a spoon to get it out of the pan. Disappointed as I was expecting a gorgeous result.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Jrtu1YQd9aiRREcdgXq9RA/348s.jpg", "caption": "Chocolate cream (good) and apple rhubarb which I would not recommend."}]}}, {"review": {"des": "Mammoth awesome Apple pie. Impress your guests by bringing one to a party or bbq or toga party.", "pics": null}}, {"review": {"des": "If you haven't been to hoosier mama yet , get you girl, get your guy or kids and get your butt over here for some Pie!! Not just pie, but the best damn pie you'll find! Omg banana custard yum, taste just like banana baby food! Passion fruits meringue is my fav! The chocolate cream is Devine, it's like a cross between milk and dark chocolate! All I can say is it is amazing! Go on a Wednesday when you can get a frankenpie! Yes an entire pie of different slices of pies!! Hand pies are delish and the chicken pot pie is bomb digity!", "pics": null}}, {"review": {"des": "Been driving out of my way more or less for two weeks straight to get the Mexican Cayenne Mocha.  This thing is at least twofold better than anything available at Starbucks.", "pics": null}}, {"review": {"des": "This is an absolutely magnificent establishment. I have always enjoyed pie a little more than cake but because the USA doesn't really have bakeries exclusive for pies, I usually just opt for cake. <br><br>I have tried the peach pie and banana cream. The peach pie was decent, however the banana cream was absolutely divine. What makes the pies amazing is the crust. You can taste the butter and they are actually moist while being crunchy at the same time. I can't wait to return.", "pics": null}}, {"review": {"des": "Walked down to Hoosier Mama this morning to try their quiche. I didn't know what to expect since we were first timers. The interior is very small (3-4 tables max) but it's cute and the workers are nice. We just grabbed a slice of Feta & Pepper quiche and it was really good! They had a ton of full pies displayed and I'm eager to order and try one for my next event! They also had scones and muffins, as well as three choices of \"savory pies\" aka quiche. I was taken back by the almost $7 slice of quiche (seems pricey) but I'd rather support local. Definitely a neighborhood gem. I will be back for pie!", "pics": null}}, {"review": {"des": "Kind of bummed! Was super excited you guys expanded your shop, just in time for fall weather-complete with coffee & espresso! My boyfriend and I walked in with a sign advertising coffee, espresso and pie to warm up, only to be turned down on making a latte at 3:20pm. We also ordered two slices of pie & a coffee to go. Don't advertise being open until 4pm and shut your espresso bar down early, when you are telling people they can come on in to get it! Super disappointed. Went across the street and spent my money on coffee elsewhere.", "pics": null}}, {"review": {"des": "Hoosier Mama Pie Company is my favorite neighborhood pie shop.  I picked up a banana cream pie for a small gathering of friends at my home the other day.  The pie was big & hearty.  While it was a little more expensive than a pie I might find at the grocery store, it was so good that every one of my guests commented on how delicious the pie was.  The pie was well worth the little extra cost, so Hoosier Mama is now my go-to pie shop when I am looking for a 5-star tasty experience.", "pics": null}}, {"review": {"des": "Bought a banana custard pie today and brought it to a dinner party. Everyone loved it. Can't wait to try other pies of theirs.", "pics": null}}, {"review": {"des": "We walked by and stopped in for a pie...well actually two as we took one home.  Cute spot and really homey.  I would stop by again.  The savory pies are yummy.", "pics": null}}, {"review": {"des": "Excellent! I made a very large order for Mother's Day. They wrote the names on all the pie boxes, wrote the cooking directions for the pot pie and quiche, and packaged everything perfectly so none of the pies got damaged. Bonus: you can order by the slice, 6 inch pies, and 9 inch pies.<br>My order:<br>Passion fruit meringue (my absolute favorite!)<br>Coconut cream<br>Peanut butter pie<br>Orange cream<br>Apple and cherry crumble pie<br>Chicken pot pie<br>Gruyere and mushroom quiche<br>Every pie was fantastic. <br>Best meringue topping ever. The passion fruit was deliciously tart and sweet.<br><br>I also bought their cookbook and Chef Paula autographed it for me!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/dlogp9bVB7fMTqi9aILpTg/348s.jpg", "caption": "Passion fruit meringue pie- delicious!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/M7rirAzVdCbSWqdClzg_hw/168s.jpg", "caption": "Peanut butter pie"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/v_5CfzqhnZLeFVuJyp_xRg/168s.jpg", "caption": "Orange cream pie"}]}}, {"review": {"des": "If you are a pie lover, this is a great place for you to indulge. The menu is extensive but the most popular items are sold out by midday. Meaning, if you are going, it is best to order ahead or get there early. <br><br>The pies are offered in two sizes which I fully appreciated. Eating there is not an option, but it seems to serve them just fine. During busier times, free coffee or treats are available for guests on a table near the entrance. <br><br>My favorite is their chicken pot pie. That said, generally, I am not of chicken pot pie but buying one to try was a good call. Their chocolate cream pie is very good! Definitely worth a trip over and the small is enough for a few people without major sweet tooths to share. <br><br>Service is decent enough and works given the limited amount of contact. Walk up, place your order, pay, and leave.  If you desire their recommendations on favorites, questions about any dietary content or anything beyond what is available or sold out, you may be out of luck. <br><br>It can also take a while to pick up or place an order so be sure to feed your meter.", "pics": null}}, {"review": {"des": "Best pie shop in the WORLD!<br><br>Momentary bliss in 5 easy steps:<br>1) Stop thinking, <br>2) Throw that stupid diet out the window, <br>3) Get in your car and drive here,<br>4) EAT THE BEST PIE ON THE PLANET!<br><br>I am not kidding. We have tried several of their very creative recipes and they are all capable of creating addiction equal to opioids. Their crusts are crunchy and light, not heavy and doughy.<br><br>I especially liked their namesake \"Hoosier\" pie which is nicknamed Sweet Cream Pie. OMG, just saying the name brings it all back!<br><br>I give it a six star but Yelp currently only allows five. So anyone who has read down this far knows I gave it a six.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/xmAsiKGA3WzhvJD5oC469g/348s.jpg", "caption": "Peanut Butter Pie"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/XJMwcz9W4GHIbbCfefxLGg/168s.jpg", "caption": "Tray of pies"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/eUvasl8lKc-xilwMqcYfNA/168s.jpg", "caption": "Outside"}]}}, {"review": {"des": "I don't even know why this place is so overrated. Their pies are not good at all. Every time I go there hoping I would like something I end up disappointed again and again and again.", "pics": null}}, {"review": {"des": "They have the best pie in town, kind of expensive but worth every penny. Their passion fruit meringue pie is delicious, always have to get a piece of it or order the whole one online. Their menu changes everyday, check their website to see what they will be offering that day. It is first come first serve so make sure to get there early or there may not be much to choose from. Did not have a pie that i did not like from them. Also their chocolate creme is nice and rich and chocolatey, if you like chocolate you will love this pie. Its a small bakery so be prepared to take your slice to go, since they only have about 3 or 4 tables to sit at. And because its Chicago its metered street parking.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/VRKAf_mSB2ZI1Vai_ujYfg/348s.jpg", "caption": "Passion fruit meringue"}]}}, {"review": {"des": "Very catchy name, but even catchier with the smell of all the baked fresh pies, as soon as, you step foot out of your car.  <br><br>The shop's signage is very faint, so it's not that noticeable.  It's a small storefront with 1 booth and table.<br><br>Aside from that, it's like walking in to Pie Heaven!  They sell small pies, large pies and also by the slice.  Just too many to choose from.  <br><br>No special recommendations, you'll just need to try them all.  I know I will!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/_RFXNRHYlLY0S0Rz0EFa_Q/348s.jpg", "caption": "More fresh pies"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/3Ff67FkL7qYo6pfqQOHGqA/168s.jpg", "caption": "Menu for the day"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/9PfoYQTTb4vGXtdOofhMWQ/168s.jpg", "caption": "Pie Heaven"}]}}, {"review": {"des": "I picked up a few pies for an Easter gathering and they were AMAZING! The Key Lime was absolutely perfect.<br>I actually left without one of my pies and didn't notice until we looked in the bag the following day. I called the bakery and they remembered! They had set aside a sour apple cherry for me so that I could come pick it up! That's what I call 5 star service. <br>The daily inventory can go pretty fast (especially near a holiday weekend), so I'd recommend planning ahead and ordering in advance if you want to make sure to get the pie you want.", "pics": null}}, {"review": {"des": "Banana cream pie is the BEST, they are always welcoming & kind when I walk in. The tiny pies are so cute.", "pics": null}}, {"review": {"des": "Today was National Pie Day.  So, where else would one go but a dedicated pie shop?  Hoosier Mama seemed to fit the bill perfectly so we came by.<br><br>First impressions: tiny sign so it's easy to overlook.  Tiny inside - 3 tables.  And packed with people.  Packed like you can't even get in the door at times.  That's a good sign, I guess.<br><br>They have savory pies, sweet pies and quiche.  Unfortunately they were really low on pies today.  So we got a piece of their chicken pot pie and their fruit chili pie.  And a couple of cups of coffee - free refills, nice.  Sadly no passionfruit meringue.  It took about 10 minutes for them to heat up the pies, and we managed to share a table with another very nice couple.<br><br>While we waited, we marveled at the line of people coming in.  It was non-stop.  The place would kind of clear a bit, and another wave would hit.  But the staff did great and even managed to bring us our pies and more coffee, pushing their way through the crowd to do so.  Pretty cool.<br><br>The pies were awesome.  Flavorful and full of tasks fillings.  I definitely want to try their sweet pies now!!", "pics": null}}, {"review": {"des": "The passionfruit meringue pie is amazing - so much better than a normal lemon meringue. The egg & cheese biscuit sandwich was really good, but a bit dry.", "pics": null}}, {"review": {"des": "We ordered slices of the key lime pie and Hoosier sugar cream pie. The key lime pie was authentic and sour, the cream on top was phenomenal, and the crust was fantastic. The sugar pie was also very delicious. I recommend checking out this spot and I look forward to going back to try more flavors.", "pics": null}}, {"review": {"des": "Quiet little place with excellent pie.", "pics": null}}, {"review": {"des": "I've been waiting a while to come here. I think for a first trip, we bought way more than we can handle. By 'we', I mean my boyfriend and I. Let me continue by listing what we got: one slice of Lemon Chess Pie, one large Chicken Pot Pie, and one large Coconut Cream Pie. <br><br>It's been 4 days, I'm still working on the pies. <br><br>The Lemon Chess Pie was very good. Usually, I'm not a fan of lemon desserts, but this one was different from the others. It tastes like real lemon, not the overwhelming taste of sour lemon juice.<br><br>The Chicken Pot Pie is by far my favorite. There are real pieces of chicken packed in the pie - by real I mean not frozen. Honestly, the pie was probably a good 5 pounds. I love the red potatoes in the pie too.<br><br>Coconut cream pie is my favorite pie. I love coconut. I love how they layered shredded coconut on the bottom.<br><br>In general, the crust here is amazing. Flaky and buttery goodness.", "pics": null}}, {"review": {"des": "Cute decor.  Old nostalgic setting with antiquey tables and tables.  Only three tables in small shop, one being a picnic table adorned with picnic gingham cloth.  The Bourbon pecan chess pie.  Sugary flaky top, roasted pecan streusel top.  Crust is good, flaky and buttery.  Joyous almond is a big pile of mush due to a large amount of slightly underwhipped whip cream, creamy filling of shredded coconut atop a chocolate hard cookie crust that has to be stabbed with a fork intensely.  Very very tasty concoction, but poor design resulting in a pie blob.  FYI, call ahead... Sign states two day notice on pie orders.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/jEbe3vnZTlPhs3Kn4pW7-w/348s.jpg", "caption": "Sticky, sweet, flaky crust, topped with toasted carmelized pecans aka the pecan bourbon chess pie"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ynKWKCxGdELaP7ZpIJNUdg/168s.jpg", "caption": "Refrigerated pies"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/3I8hHkiUgl-E93CO9jurmw/168s.jpg", "caption": "Room temperature goodness with flaky crust"}]}}]}