{"name": "hopleaf-chicago", "reviews": [{"review": {"des": "My husband's favorite bar in the city is Hopleaf as an avid beer drinker (snob I say), and I can see why. I myself love Hopleaf for the following:<br><br>It's an older crowd, so less obnoxious<br>Great selection of drinks, beer and otherwise<br>Their duck reuben is to die for, and affordably priced<br>Also, their truffle fries are out of this world<br>We've had good service every time we've dined<br>We'll be back to try the mussels since we have never gotten that before", "pics": null}}, {"review": {"des": "My husband and I have been enjoying Hopleaf for years now. The draft selection is top notch! They even have some delicious ciders and meads on tap. <br><br>Our favorite entree is the  duck Reuben with shoestring fries. The reason I gave Hopleaf 4 instead of 5 stars is because it never allows children, just let us come for lunch, and the prices can be a little steep.", "pics": null}}, {"review": {"des": "Hopleaf has a super cozy vibe. It's a great choice in the winter months. I like the small upstairs area especially.<br><br>I'm not sure how long it's been around, but to me it feels like one of the originals in featuring a large craft beer selection. The only food I've had is the mussels and it was delicious, obviously a great one to pair with beer.", "pics": null}}, {"review": {"des": "Hopleaf has a great beer selection! My favorite items on the menu are the mussels for two and the DUCK REUBEN IS AMAAAAAAZING, so good!! The fries with the aioli are also delicious.<br><br>A couple things to note: 21 and over only, so no children allowed and don't forget your ID, they take it very seriously.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/yyQ_TdWYI0Wl6VZ4b-dyzA/168s.jpg", "caption": "Kwak beer"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ei2EagcMuZ6vJMXJFJh4nQ/168s.jpg", "caption": "Mussels"}]}}, {"review": {"des": "I really wanted to love Hopleaf, and still feel like it has so much potential, but the experience I had was a bit of a let-down. <br>My boyfriend and I came here looking for a casual bite and we ordered mussels for 1 of both styles available.<br><br>I love the décor. The much larger than you would expect and offers several different ambiences. It's got a very cozy feel to it in the dimly lit back areas, feels really hip near the bright open windows up front, and like a modern diner near the viewing windows of the kitchen.<br><br>The wait was reasonable. The flavors of the Belgian style mussels was very buttery and rich but a little flat. <br>I forget the other flavoring, but it included corn and cherry tomatoes, and the broth was a bit more citrusy and vibrant. I preferred this one. The mussels were relatively small, but work well with light broths.<br><br>The mussels each came with 2 bread rolls, aioli, and frites (fries). The biggest problem I had was with the portions. There was probably a 3:1 ratio of frites to mussels. The bread soaked up the broth nicely, and complemented the mussels much more than the frites did. The frites were tasty, but there was such a large portion of them that I felt like I was getting full more from the side dish, than the main dish I had wanted. I wouldn't have minded had the dish come with more bread, or different-flavored, warmed breads to eat with the mussels.<br><br>We didn't want to order another dish since we had so many remaining frites that it seemed like a waste to eat something other than them, so we figured we would just take them to go and enjoy dessert to fill us up. The problem was that we waited a very, very long time between finishing our food and seeing the next server. When our server finally arrived, she gave us the check without offering dessert although we had seen her offer what sounded like a really delicious dessert menu to our neighbors. We already had waited so long for our server that we didn't feel like asking for the dessert menu and called it a night.", "pics": null}}, {"review": {"des": "Love their CB&J (cashew butter and fig jam) sandwich!  They made me fall in love with pb&j's all over again. It also comes with fresh made chips which are delicious. They also have a great selection of beers. The atmosphere is cozy and a nice place to hang out. But everyone who comes here must try the CB&J!", "pics": null}}, {"review": {"des": "Came for a brew with friends around 7:30 on a Friday and found a pretty packed, lively space. There was some room at the bar, which is deceptively large (there's a second one in the back). Reallllly extensive list, honestly something for everyone but lots of Belgian types. We didn't eat but the food looked good (especially the fries!) <br><br>Fun, chill vibes", "pics": null}}, {"review": {"des": "If I were a Chicago resident this would be my go-to favorite bar, without hesitation.  I absolutely loved my visit here!  I unfortunately didn't arrive in time to try any of their food, especially those amazing looking mussels and frites, but the beer was sensational.  Great, varied list.  Knowledgeable bartenders.  Creative space.  Well worth going a bit off the beaten path.", "pics": null}}, {"review": {"des": "Not just for the beer lovers. Tho if that's all you want -- you will be in heaven then.  Their menu is comprobable and super tasty.  Andersonville gem and city's very own.", "pics": null}}, {"review": {"des": "One of the best restaurants in the city. All the bougie chefs who work at places with 6 month waitlists come here. TRUST.", "pics": null}}, {"review": {"des": "Tons of craft beer to choose from!  Also lots of local ones which was a plus!  Food was a bit eccentric, so decided not to eat here.", "pics": null}}, {"review": {"des": "Probably wouldn't give them 5 stars if my girl didn't love this place so much (maybe 3 or 4 depending on the visit). <br>They have a zillion beers, as well as all the hard liquors. She's addicted to the CB&J sandwich (I like them too). We've gone there multiple times and never had a good old fashioned no matter who made it. <br>This place is always busy and the other patrons are usually pretty cool too. It's a really big place, with lots of separate rooms/areas.  Worth a visit if you're in the area!", "pics": null}}, {"review": {"des": "Stopped here on a Saturday night for dinner and beers and boy is this a great spot. Love beer? You will be right at home. <br><br>Pros<br>-Great Belgium Beer selection (Lambics, Tripels etc.) <br>-Loads of top beers from the US (Allgash, Maine Beer Company, 3 Floyds etc.) <br>-Tons of bottles from all over the world -take some time to look through this list, its really high quality and extensive. <br>-Have untapped to check out all their beers in one easy spot<br>-Duck Rueben was outstanding<br>-Highly recommend Bitterballen<br><br>Cons<br>-Too many beers to enjoy in one visit?", "pics": null}}, {"review": {"des": "Plenty of beer on tap - too much to choose from and all enjoyable. I did not drink all of them but I felt like I did. Plenty seats at the bar - no plugs, but what do you expect, it is not a coffee house. Bartender was great and plenty of free tastes. <br><br>Seats fill up fast if you want to eat and sometimes they line up along the bar waiting for a table. I have not tried the food but plenty of choices to drink from.", "pics": null}}, {"review": {"des": "Pretty laid back bar. Staff was helpful and friendly.  They have a big selection of beers to choose from.  I ordered the virtue cider which I really enjoyed. For an appetizer we ordered a side of Mac and cheese and the bitterballen which I wasn't too crazy about. My friend and I split the brisket and duck Rueben. These sandwiches come with an insane amount of fries and an awesome aioli. Both sandwiches were delicious. I did feel that the brisket sandwich has too much mustard on it. The duck Reuben is delicious, I recommend it.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ynfUSMgySFXuXvgb5Qz4HA/168s.jpg", "caption": "Brisket"}]}}, {"review": {"des": "This is a true northside treasure!  I always bring my friends here after seeing live storefront theatre, which is prominent in this area. The Belgium style menu will leave you full and satisfied. From my dining experiences here I have had the steamed mussels and the CB and J. <br><br>The CB and J is phenomenal, the combination of fig, cashew butter, and raclette cheese is a match made in heaven. The side of macaroni and cheese and homemade chips will leave you feeling like you've had a home-cooked meal. <br><br>The ambience is also a memorable trait of this establishment. You can choose to dine in a number of uniquely themed rooms. I enjoy dining in the room where you can see the chefs put in work preparing the meals. Seeing how the dishes are prepared makes me appreciate it more.  <br><br>It a true Chicago gem.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/fmUqNMZbWwUqhbPBsh7y1A/348s.jpg", "caption": "This CB&J is divine!"}]}}, {"review": {"des": "Loved this place, first time here. There are multiple different rooms to sit in. We chose a table by the window and you order everything from the bar I think. We only ordered beer. The selection is quite large. Also, I love collecting the tulip beer glasses, they cost $5 each, a steal.", "pics": null}}, {"review": {"des": "Ugh. So good. Discovered this place after a show at the Neo-Futurists. Busy on a Thursday night, but we got immediate table seating. <br><br>Beer list is extensive and varied, though (logically) focused on Belgians. The cider list is fairly small, and the offerings keaned towards straight ciders, but I had a dry rosé cider on tap and a basil mint cider (can) from Seattle Cider. Both were excellent. <br><br>I ordered the mushroom toast and a side of Mac and cheese; together, it was plenty filling as a meal. The mushroom toast was so beautifully seasoned and the mushrooms were interesting - not just sliced cremini or what have you. The mac and cheese was a bit of a let-down; it didn't have a particularly notable flavor and despite the browned top, lacked texture and crunch. <br><br>My partner got a stew, which he praised for it's manageable size (we we're visiting from Indiana where portion sizes are often 3x as much food as you want to eat) and we split a cone of fries, which was enormous - we only managed to finish half of it. The fries came with mayo, which I'm not usually a fan of, but this one tasted homemade (or at least of a much higher quality than most mayo). <br><br>I went back the next day with another friend to grab a drink before another show, and I'd happily return on my next visit to the city.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/66mjtDLY5SFLFRWip7AiSg/348s.jpg", "caption": "Mac and cheese (okay, but lacked flavor and crunch, despite crispy-looking top)"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/DwjSw_bwY6n9xn7tCqcZyw/168s.jpg", "caption": "Mushroom toast - genuinely a great meal paired with a small side"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/AerWIW-Xrz2X1P6plmgXbg/168s.jpg", "caption": "Cone of fries is enormous!"}]}}, {"review": {"des": "High quality and well-known craft beer bar. I've been here several times now and always have a new beer each time. I've never been disappointed. Plus they serve food as well, I've never gotten a full meal, but the fries are good. I've been on Saturday nights and has thankfully never been TOO packed. Not far from the red line, and parking isn't too bad in this area. Lots of other bars/restaurants nearby on Clark so one can make a full night of it. They also have wine/liquor for those not wanting beer. My friend lives nearby, and they rotate their beer frequently so I'll definitely be back in the future.", "pics": null}}, {"review": {"des": "One of my favorite places in Chicago!! I'm not one to go back to the same restaurant more than once since I love trying new places, but I had to make an exception for Hopleaf. <br><br>I came here last Saturday night around 7PM, and while I was expecting a wait (it's first come first served), I was surprised that we got seated immediately in a cost spot on the corner. This place is famous for their Belgian Brews and being not a huge beer drinker, I always come back for the mussels. Their mussels for two ($24) are some of the largest and freshest I've ever had. We chose the miso broth with kimchee butter, which had a nice (but not overpowering) kick. The mussels come with bread for you to dip into the broth and a large serving of fries with aioli. We also ordered a beef brisket sandwich and substituted the fries with mac and cheese ($17). The sandwich had a generous portion of meat and the mac and cheese was solid. <br><br>Along with many different beers, Hopleaf also serves some unique ciders and meads! The service here is consistently prompt and attentive.  <br><br>TLDR; great food, great service, and great booze. Definitely try the moule frites!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/qAuKimRVyp9SgLrLOBrIRA/168s.jpg", "caption": "Mussels for two ($24)"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/65T6bvJMOSXHoGK4oGhKTg/168s.jpg", "caption": "Beef brisket sandwich with mac & cheese"}]}}, {"review": {"des": "The Hopleaf is such a classic, and with 1900 reviews... well. But I'm writing this anyway, cause I get it right. Here's the breakdown:<br><br>You come back because the craft beer selection large and so well curated. Specialities in both American Craft and Belgian beers, but it's the latter that puts Hopleaf on the map as a beer aficionado destination. I live in this neighborhood, so it's hard to remember that people come from far away just to visit this place. I'm told Mike the owner writes many of the detailed beer descriptions himself.<br><br>Staff are often rude or frustrating. Culture of staff here isn't particularly friendly. Expect condescension from some bartenders--asking for a taste of something you may get a flat \"no.\" Doorman barks at people. Hosts will ask questions fishing for how much money you intend to spend if you want table service. So many odd stories. The other day they refused to seat me because I wasn't with my \"full party\" - meaning the one other person who was meeting me for dinner. Empty tables everywhere. I can't sit for 5 minutes and order a drink? Other staff can be nice and efficient, but locals know this place has curmudgeonly hospitality issues. Has for 10 years.<br><br>No burger on this menu. This is true upscale gastro-pub with entrees and cloth napkins in the non-bar areas. While it has some more inexpensive sandwiches and fries (all tasty), folks also come for the Belgian White steamed mussels or the Maple-Brined Duck Breast. <br><br>Vibe and decor is great here. From the original half with low ceilings and tight booths, to the summer-time candle-lit back patio, to the bricked-addition with antique beer signs, this place the perfect bar atmosphere. And not one TV. Thank you. Vibe suffers a little bit if you are tucked into the upstairs in some less descript corners.<br><br>Definitely check it out, although choose a weeknight for best experience. Weekends can mean shoulder-to-shoulder in bar area and hour-long wait for a table.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/GAkFTempCaxzmk1kDKEwsw/168s.jpg", "caption": "Jan 2018 tap list from table page 1"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/CaCsLD4zzg_G3Ka9g0MxNw/168s.jpg", "caption": "Jan 2018 tap list from table page 2"}]}}, {"review": {"des": "Amazing beer list. Affordable wine on tap (generous pour pictured) and delicious mussels. Have had several of their apps that are always rotating to keep the menu fresh and interesting. A staple on the Andersonville strip!", "pics": null}}, {"review": {"des": "3.5/5. It's a great space and way bigger than it looks from the outside; lots of room for dining on the entry floor as well as an overhang with tables on the second story but also an isolated room where it's all about the beer. And when it's warm outside, they've got a spacious patio in the back. Beer selection is large with lots on top and even more in bottles; Do not skimp on any belgium brews or whatever specialty they're offering that week.<br><br>Everything's looking good so far. However, the thing I was looking forward to the most ended up being the most disappointing: the food. The food is not bad, in fact, portions are pretty darn good. But overall I think two of their claims to fame, mussels and CB&J, were pretty hyped up and ultimately tasted average to me.<br><br>The mussels come in portions for one or two at $14 and $25 respectively. They are paired with bread for dipping, as well as a side of fries with garlic aioli. The fries are excellent; crispy but not super greasy, and pair perfectly with the strong flavors of the aioli. The mussels portion was a little small for the $14 I paid for it, and while each mussel was fresh, there just weren't that many of them. I also wasn't the biggest fan of their classic belgian beer broth. I think it leaned too much on the beer that the other flavors from the celery, thyme, and shallots didn't come through.<br><br>Onto the CB&J; I enjoyed this more actually, and it also came with fries, home-made crispy potato chips, and mac n'cheese. The mac n'cheese had good flavor, though I think would have benefited from a higher cheese:macaroni ratio. After being baked I think some of the sauce dries out, so you didn't get the satisfying cheese pulls or cheese permeation through the ramekin. The sandwich by it's components was great: very savory buttered bread that has a satisfying crunch from being toasted on both sides, and the sweetness of the figs pairs well with the earthy cashew butter. The big issue? Not enough inside the bread; it could have used more of both the CB & the J, not to mention that I don't even think I registered tasting any of the raclette cheese(Which was what I was looking most forward to).<br><br>Still a great spot for beer selection and hanging out, and I do like their fries. Will be back to give the mussels another shot(maybe try a different flavor this time), and maybe check out the duck reuben.", "pics": null}}, {"review": {"des": "Like an old comfortable pair of shoes, The Hopleaf just feels like home for me.  From the big hunk of steak slathered in butter, the ham sandwich, mac & cheese, not to mention the specialty items on the menu....this is the place to be for a good time.  From the selection of beers to the bubbles, this place has it all.<br><br>They also do great parties.  You can rent the room upstairs and they do wonderful catering.  We have had several events there and it was always a great time", "pics": null}}, {"review": {"des": "Beer, atmosphere, location & service yes! Food? Eeehhhh did not live up to online hype imho, especially the cashew butter fig cheese sandwich. Totally not conducive to a beer venue. I had a bite of my wife's duck sandwich and still eh. When my wife read the menu to me on the way down, I was like, wow! These guys are trying really hard to be outside the box, and they are, I'm just not sure it is working.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/KkRJupLgC9DME76kulztVw/168s.jpg", "caption": "Cashew fig cheese sandwich"}]}}, {"review": {"des": "This place has sooo many different beers and ciders to try. There are 3 different areas to sit when you are not dining in. You can sit in the front bar area, the upstairs area, or the  south bar. I love coming here and trying something new and different. <br><br>The food here is excellent. I love the mussels and frites. The brownie dessert had a nice spice to it.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/kK5lj-fCDR11IJBSW6P0Uw/168s.jpg", "caption": "Cherry cider"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/QuFkotLUnADOMb1r8CCiNQ/168s.jpg", "caption": "brownie"}]}}, {"review": {"des": "Great ambiance, tons of beers to choose from, and AMAZING duck rueben sandwich!!!!!! ALL of their sandwiches are so good! And their fries and dipping sauce is SOOOO delicious. I always go in thinking that I'll save some of my food to enjoy as leftovers.... It never happens that way. I generally stuff myself because the food, fries, and sauce are unbelievable. They have atomium beer which I don't frequently find other places. Overall, a stellar spot to hang, eat, and drink. I have also only ever had friendly service. Highly suggest!", "pics": null}}, {"review": {"des": "Hopleaf has one of the best beer selections in the city and their mussels are delicious. If you're a big fan of imported craft/trappist beers this is the place you want to check out. It can get pretty packed depending on when you go so be prepared for that possibility. The service can be quite slow when it's packed too but usually they're pretty good.", "pics": null}}, {"review": {"des": "Hopleaf is unexepectadly cooler and bigger inside than what you might expect from a street view...and it is for this reason that one of my co-workers (who knows how completely obsessed I am with Yelp and trying awesome local joints) suggested that we celebrate my last day at our company/the start of graduate school by coming here.  So, we made a hop, skip and a jump over to Hopleaf...I assume it's gotten it's name from from the hoppy leaves that make up the composition of their many beers...<br><br>For a beer lover, this definitely is a bar that should be a stop along the drinking route.  There are several beers on tap here - I might be slightly off in this assessment, but I'd say that half the selection is a mixture of pale ale's and IPA's  (with a fee other random, married beers thrown in the mix) and the other half being Belgium beers.  There's a fair mixture, but I know some of my co-workers left being slightly dissatisfied with the selection.  I enjoyed all my beers, especially because they seemed slightly more affordable than those found at bars in the same Andersonville area.  (For those that are not beer drinkers, there is a full bar and wine options).<br><br>Out of the many things on the menu, only one thing stood out to me and that was the CB&J sandwich (which has fig and some sweet aioli with cheese)...it was scrumptious.  My mouth is watering now just thinking about it.  The fries that came with it were pretty good, but the Mac n' cheese was gross...as my co-worker put it: \"it tastes like the iron skillet it was made in\".<br><br>I spent a lengthy amount of time here, partying it up with my co-workers and friends...it is easy to hang here for a while, especially if you get there before the rush and find good seating.  Now, to have the best experience you don't want to sit in what my friend says is the \"bougie\" side (the side where you walk into), but rather walk to the other open area that connects to the beer garden!  Granted, that's the side that gets busier and it's the side where the bartender lost my friend's credit card, but I still liked that side better. <br><br>But yes, the bartender lost her card and couldn't find it anywhere...thankfully her drinks and meal were comped, but my question is, \"how the neck did they lose the card?\".  Though this bartender was friendly, some of the other staff were not so friendly and that's always a no-no for me.  If I could, I would give this place a 3.5 - it's good, not great but you could probably find me wandering back inside at some point.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/t0OzwBrKx0TYUcPwCF7xdQ/348s.jpg", "caption": "CB&J Sandwich"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/O763k5R62j49JrABDuX8lQ/168s.jpg", "caption": "Rosé wine"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/4f4Q8J0igx3hqaAmiLlDmA/168s.jpg", "caption": "Mango jungle boogie"}]}}, {"review": {"des": "Try the mussels and the duck Ruben are great. Wide variety of beers and cocktails at a decent price. Great service!", "pics": null}}, {"review": {"des": "What bar serves mussels as its big draw? Hopleaf does, and they're amazing. The place can get insanely busy so I'm sure it's not always fun if you're in the wrong mood, but when you're down for Hopleaf it's a good time.<br><br>Tons of rare taps. If you only want to sample, let's say small Belgian brews, you're in luck. They have it all. The mussels and fries are great. The gastropub food is almost always more than the sum of its parts. They put real love into the food. They don't just toss fancy things on a plate like some lesser attempts at gastropubs. Portion sizes are right on.<br><br>It's usually busy, it's usually crowded, it's usually loud. It's also totally worth it.", "pics": null}}, {"review": {"des": "The Hopleaf was like entering a little restaurant. You have to show your ID card when you come in the front door. There were endless unique rooms, multiple bars, indoor and outdoor seating, and the place seemed to go on and on. Service was wonderful and the drinks were good and the food was delicious. <br><br>The menu is impressive and I had a really it all. It was very good, but the fries which came with were out of this world. All in all, a great night out too.", "pics": null}}, {"review": {"des": "If you're looking for a selection of beers that veers towards Belgian, and food from a scratch kitchen, look no farther than Hopleaf.  <br><br>The tap list has a variety of Chicago staples, Belgian standards and unique brews from all over the world.  You can get lost in the beer menu, but the service will be helpful and guide you towards what you're looking for.  <br><br>The food: It's amazing.  Get the mussels.  The head cheese is made in house.  The sandwiches are delicious.  Everything tastes good.  The menu changes often and has vegetarian options if you're into that sort of thing.<br><br>What I really love about this bar is the service.  Even after moving away and only coming to Hopleaf when I'm in town (several times a year), I recognize friendly faces and am welcomed like an old friend.  <br><br>It used to be difficult to get in, but the expansion made it much easier to get a seat.  There are no TV's and the music selection veers towards jazz and down tempo.  I can't think of a better place to spend an afternoon or evening.", "pics": null}}, {"review": {"des": "Hopleaf has to have the best beer selection on the north side. I'm personally a fan of the zombie killer cherry cider. They have so many beers on tap, it's amazing. Even if you're like me and you don't like beer you'll find one. <br><br>It's a great place for a group. Last time I went I came with a group from work and we had a blast. It was a Saturday night the place was, wait for it, hopping, and we couldn't find a place to sit. But guess what. We didn't care! <br><br>The food is great too. The mussels are a must try. A great entree or an awesome app for a group. That's all I've ever eaten there but everything on the menu looks great, and i promise I time I eat there I'll try something else. <br><br>It's loud, fun drinking in Andersonville. I love it.", "pics": null}}, {"review": {"des": "Tried Hopleaf on the recommendation of a friend. Didn't have a lot to eat but had the charcuterie tray, it was delicious and got to taste our friends brisket sandwich. Very tasty", "pics": null}}, {"review": {"des": "Entering Hopleaf was like entering a little bar Narnia. There were endless unique rooms, multiple bars, indoor and outdoor seating, and the place seemed to go on and on. Service was wonderful and the drinks were good. <br><br>The menu is impressive and I had a really innovative duck rueben sandwich. It was very good, but the fries which came with were out of this world.<br><br>Being a Chicago bar, it was a bit pricy, but you probably shouldn't be going out in Chicago unless you're ready to shell out a few tens. <br><br>All in all, a great night out.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Pi8Hdo3UjUHn2LFmui3Ffg/168s.jpg", "caption": "Dual floors"}]}}, {"review": {"des": "The food came out so quick, damn! I really enjoyed the food, beer, and atmosphere of this place. It just kept going and going and going. <br><br>As much as you enjoy IPAs or pale ales, I really think that the European beers are the strong point. It may sound obvious but there's a very alluring American craft selection on tap...but my IPA just wasn't very fresh/carbonated. The German ale though...was exceptionally crisp and on point. I don't believe the fries lived up to hype either. I really need to visit again for the onion straws!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/zFsS5kUmZ97aIoLKCIGjNQ/348s.jpg", "caption": "A delicious goat cheese + raspberry puree + almonds and toasted bread"}]}}, {"review": {"des": "I came here for a birthday celebration so we had a table reserved... thank goodness because this place was packed! Obviously based on the name, it's a beer lovers heaven. However, if you don't drink beer (like myself) you will find yourself as a \"fish out of water\" with not a lot of options for other drinks. They do have some wine selections but it's scant and somewhat disappointing. But again, you should expect this based on the name. Since I didn't try the beer I can't review but I will say everyone I was with found beers that they loved and the menu for beer was extensive! So if you are a beer lover and in the area you must make this one of your stops.<br><br>Now onto the food - this is a gastropub so the food is a definitely a bit unique and it's all very good. The food was the highlight of the night for me that's for sure! I got the mussels - which can be hit or miss at a bar but this place is also known for them. It's their \"specialty\" and they lived up to it. It's amazing and comes steaming in a pot... they have 2 styles and I tried the Belgian-style. If you come here for dinner I would recommend ordering these as your main dish but if you're hungry get the dish \"for two\" and you could probably eat most of it with sharing a little with a friend or loved one.", "pics": null}}, {"review": {"des": "Went one night for a drink and was shocked by the vast beer selection - tons of options on tap and a great vibe! The open windows in the summer beckon you in. However, I would think twice about eating a meal here because they don't invest in their food menu like a restaurant should. I would recommend the frites with aoli though. They come out quick and are consistently good. Other than that, the food menu is quite small and up in the air. If it's crowded or you are with a group, prepare for service delays.", "pics": null}}, {"review": {"des": "Great Place for Afternoon Chill with Friends. Great Atmosphere, love the patio area. Great Beer and Food", "pics": null}}, {"review": {"des": "Second time I have been here. Their grilled cheese is a must try. <br>Mushroom flatbread appetizer was great.could of you aten a few more pieces of that.  Nice atmosphere <br>Will definitely go back again", "pics": null}}, {"review": {"des": "A very cool pub that me and my friend visited yesterday. It's a huge place with a lot of draft beers and no TVs which is cool. We came mainly just to grab a bite and have a beer.<br><br>I got the ham sandwich while my friend got the beef brisket. He seems to enjoy his while I thought the ham sandwich was OK, I probably wouldn't order it again. It came with a lot of fries and an aioli dip that was good. Half the fries were soggy which I hate, but they load you on the fries.<br><br>Service was pretty quick and we got our food in a reasonable time. I don't live around the area but I'd probably come for the booze and not the food if I were to come back.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/RLmo1v62TkWcmfli7ZHuug/348s.jpg", "caption": "Toasted Nueske Ham sandvich"}]}}, {"review": {"des": "Fast service and great selection of beers! Parking a little hard some times in the Anderson area but this area is the place to be for a fun night out and this place is usually my go to spot.", "pics": null}}, {"review": {"des": "Honest review: theres alot of beer, the food is really good. Its a really big place with an outdoor patio which equals lots of seats. The service is alright theyll clean plates but dont give recommendations or describe menu items they prefer to gossip instead so train them better must orders: charcuterie/ brisket sandwhich/wings/ cb and j/ duck Rueben/ goat cheesecake <br><br>Chicken wings 13$ amazin these were so flavorful u could taste all the spices they put on it i liked the addition of cilantro for freshness and the lemon for acidity just combine the two and make a salad instead. My only complaint is plz make them crunchy they were soggy best wings at dos urban cantina these were still amaizin though <br><br>Duck rueben 15$ amaizin one of the best dandwhiches i ever had. The bread was supper buttery and toasted the duck was supper tender and flavorful. The sauerkraut was really acidic to cut through the richness. My only complaints is to put more condiments inside dont be cheap after a couple of bites filling is gone <br><br>Pomme frites: ask for extra aioli youll thank me. The fries are so crispy without being creasy their not over salted or under salted. Only complaint is to use a unique seasoning or some truffle oil to give it pop. The aioli is so rich and decadent i have no complaints these fries would be my last meal you guys should add some cheese to it too!<br><br>Cbj  (picture like a cheese plate in a sandwhich) the bread was supper buttery but not toasted as good as the rueben.  The inside is a combination of sweetness from the figs  richness from the ricilite n cashew butter adds savoryness and the mac n cheese adds that funky cheese plate flavor. Only complaint plz dont skimp put more of the ingredients in the sandwhich<br><br>Beet cake $8 good not great tasted like a carrot cake. Cake was a lil dry. I was expecting more complexity but it was very one dimensional jus sweet and acidity and some wow factor to this still a good fish but u guys can do better <br><br>Goatcheese cake $8 best cheese cake ever. The cheese cake was supper smooth like a mouse had the perfect balance of acidity and sweetness. The bottom was supper crunchy and salty so it added texuture the salt cut through the sweetness the blueberry sauce was amaizin adding acidity and sweetness. I loved the basil flavor adding freshness just making it to an icecream instead", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Eie7LzT753AXgr9y3a_sGQ/348s.jpg", "caption": "Beetcake 8$"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/1DdJ_az4hUMWcZlB54zyIA/168s.jpg", "caption": "Bill"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/aGQgIXWiDEwSQRjMNkJ8rg/168s.jpg", "caption": "Goat cheese cake $8 amaizin one of the best cheesecakes i ever had"}]}}, {"review": {"des": "We've been to this neighborhood spot a few times and the prices and quality are on par for a nice meal in Andersonville. The food was decent this time around but the reason I won't be back was the service. <br>It's been hit or miss in the past but this time our server was ambivalent and then rude. <br><br>I guess our server thought I was being annoying when I told her that my water had a strange metallic taste. At least that's what eye-rolling meant to me. After She dropped off our beers, my husband noticed a chip in his glass. When we pointed it out, we got the eye roll again. When she finally brought the replacement beer it was obvious she had just dumped it in another glass (FLAT). <br><br>She never checked back in with us and someone else brought us our check. It was really weird bc her section was not that full and we could see her being friendly and accommodating of other customers. I don't know why or how we offended her but it ruined our dinner. We couldn't order a second drink or dessert bc our server didn't offer it. <br><br>Writing this out seems weird but management did not respond to my email - I'm an easy going diner but I won't be returning to Hopleaf and neither will my friends.", "pics": null}}, {"review": {"des": "It is a staple in the area with an amazing beer list and great food. <br><br>If you like Mussels give theirs a whirl.", "pics": null}}, {"review": {"des": "I have been to Hopleaf a gazillion times.  So, if you are a beer person who really gets into import beers from all over the world, there is no better place.  It is overwhelming if you are not familiar with the beer selection; however, the bar staff will do a good job pointing you into the right direction based upon your beer tastes.  <br><br>Food wise - it is pretty good too.  I have had many sandwiches and various items from the kitchen. I have never had anything I have not enjoyed.  Sometimes, I have had too much to drink so I don't remember what I ate but I do remember that I liked everything and ate everything. :)<br><br>My only complaint with the place can be the clientele.  I have been in the men's bathroom on a few occasions where I am blown away at the way the guys talk about the women in the bar and what they hope to do with them.  I would expect such a thing in those douchey bars with frat boys and not at Hopleaf.  <br><br>That said, there is nothing that Hopleaf can do about this.", "pics": null}}, {"review": {"des": "Love Hopleaf. This might've been the first bar I ever really went to in the Chicagoland area when I was just a young lass. <br><br>The beer menu is extensive. Though it does get busy on some days, the space has multiple rooms and you are sure to find somewhere to sit. I also feel like each room and the upstairs area all have a slightly different feel. There's also a patio. <br><br>Keep in mind that the upstairs beer menu is slightly different than downstairs (less expansive, but still expansive none the less).<br><br>This is a good spot to explore exotic beers you've never tried before or may be intrigued by. You can get a 24+ oz speciality bottle and share as well (if you and your comrades can agree on something that is). Food is very good as well but I would advise keeping it minimal. Have gone overboard before and ordered way too much for two people because I was curious. Portion sizes are on the larger size and we ended up with plates of fried food and it was absurd. I like the mussels and the way they are served!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/UffiAOitnkjDAGPRYyfAGA/348s.jpg", "caption": "Duck Reuben dif angle"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/bnrwC2_z6Z1qCRbKp4l7Hg/168s.jpg", "caption": "Catfish sammy"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/yZjMJy6I0u-4_48LpCO5Cw/168s.jpg", "caption": "Duck Reuben"}]}}, {"review": {"des": "Another great Chicago restaurant.  Great service, very chic atmosphere & fantastic food!!!!  We started with pork sausage croquettes breaded with panko, heirloom tomato salad & creamy corn.  They were all so freeking good.  Then 2 people had pork schnitzel sandwiches, 1 had a duck breast Reuben sandwich & I had mussels steamed in Belgium beer.   3 of us drank Belgium beer also.  Had a delicious Belgium hiefenweissen.  He food was out of this world.  I truly love this place.", "pics": null}}, {"review": {"des": "Finally went here with the bf and had amazing kriek on tap, charcuterie with chicken liver mousse/pork belly rillete/smoked duck breast, and of course the moules fries for two. Really amazing food, great vibe, and excellent service!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/HAdJ7MFio9W5NsPSanMNgw/348s.jpg", "caption": "Fries with garlic aoli"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/6EQ9RQvrqM6lnzzzfpOIkw/168s.jpg", "caption": "Mussels"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/yncrq7JOtb4bchpwV20aGA/168s.jpg", "caption": "Charcuterie Trio"}]}}, {"review": {"des": "We're here from out of town doing some bar hoping. Walked into Hopleaf. Door guy asks for ID but with complete attitude. We sat at the bar and ordered our beers. Bar tender was short tempered. Asked the other bartender for napkins and you would of thought I asked for them to wash my car. Customer service is slack. Attitude quick to be given.", "pics": null}}, {"review": {"des": "food was pretty good, menu is a bit small, not many options.  but the beer was good.  <br>no TV's in the back bar to watch the NFL game?  not cool.  every bar should have TV's for games.", "pics": null}}, {"review": {"des": "mon dieu, hopleaf now has montreal style smoked meat sandwiches?<br><br>that's it. i'm moving in.i'll be very happy living in the new room.", "pics": null}}, {"review": {"des": "Such a fun bar with a great atmosphere. I would come here over and over again if it was closer to me. <br><br>The upstairs and downstairs are very different imo-- draft selection is limited upstairs and most of the beers are bottled. Upstairs is also a lot more crowded and h<br><br>I ordered the mussels because it was all the rave, and while I thought it was good it wasn't great. Didn't have as much flavor as I was expecting. But they tasted fresh and portions are great.", "pics": null}}, {"review": {"des": "Amazing selection of drinks! Friendly waiters. The fries were AMAZING with that aioli. Some of the dishes had random pairings. Like fried sandwich, fried potatoes, and mac and cheese? What? Interesting flavor profiles, but a little jumbled. I would recommend the heirloom tomato salad and duck reuben.", "pics": null}}, {"review": {"des": "Until February 2013, I really never visited Chicago much; I was attending school downstate and didn't have any reason to visit until a close friend of mine moved to Ravenswood. Those first couple of weekends were surreal to me: being a newly-minted 21-year-old, I fell completely in love with Chicago's neighborhoods, a welcome relief from only visiting downtown while growing up.<br><br>There are memories that you recall, and then there are Memories--with a capital \"M\"--which are hard to describe, only remaining in your mind: the smells, temperatures, lighting, mood, everything that you can't quite place on paper, but can re-live infinitely in your head. For me, an east-bound walk on Winnemac from Ravenswood, at night, in the winter five years ago to meet up with a random group of friends who texted \"Hey! We're at Hopleaf!\" is one of those, and why Hopleaf remains a sublime, special place for me.<br><br>Sure, get the famed mussels to start with; it's really about the broth--the delicious, rich, heartwarming broth that tastes like coming home to a warm fireplace after a long, cold adventure and snuggling up with your dog--and the quality of frites, which create a dish to the quality of what I remember eating in Marseilles or Lyon many, many times. I know I'm not the only one, but I always make sure to spoon a ridiculous amount of this broth on the frites since it's just so exceptional. The bread served alongside it is rigid, dense, and perfect for absorbing the broth; split it in half, and let it sit in the pot while you finish the mussels. If I'm coming in for dinner by myself, which I do frequently, this is all I'll get along with the obligatory beer, of course.<br><br>The thing I love about Hopleaf is how versatile it is for a majority of social situations; first Bumble date, just drinks? Hopleaf. What if that Bumble date becomes longer than anticipated and you're needing some nourishment so you're both not wasted the next morning? Hopleaf, and share mussels for one or a charcuterie board. Everything from a casual dinner, with their exquisite grass-fed brisket sandwich, to a more special occasion revolving a delicious strip steak frites, Hopleaf is rustic, fun, relaxing, and dare I say, sexy--a true utility tool of restaurants, a feat many other Chicago establishments would kill for.<br><br>I've been on four first dates here, and one second date which was far more special to me than most things I've experienced in my life. And, because Hopleaf didn't kick us out for mildly, drunkenly making out in a corner, that second date became something more permanent; we're now together, and I consider our mutual love that night of whiskey, beer, and Hopleaf a big factor in her sticking around. (Well, I'm an exceptional cook as well, but why cook when you could get those mussels? I'm obsessed, but they bring beautiful Memories.)", "pics": null}}, {"review": {"des": "6 months of living here listening to the hype about Hopleaf had me excited to check it out.  Sadly I was a little disappointed in my experience.<br><br>3 stars is immediately deserved due to the great beer selection and decor.  More obscure Belgian beers and many rooms and levels, all decorated appropriate to the Andersonville neighborhood.<br><br>We were seated quickly without reservation on a Friday night, which was nice.  Though our spot was right next to the kitchen, leaving us a little neglected by our server, and secluded from people in general.<br><br>Try the sausage sampler, it was the most positively memorable thing we ordered.  Other than that, service was slow and the food all left something to be desired.<br><br>The Cashew PB&J is popular, it comes with mac and cheese and pub chips.  The sandwich was overgrilled, leaving black char marks along most of the crust, and there really wasn't enough cashew butter/jam/cheese to get a real sampling of the intended flavor.  Mac n cheese was cooked alright, but a little bland.  The chips were simple and tasty but didn't come with any dipping sauce.  The aioli provided when we asked for a dip helped a lot.<br><br>We were told the pork chop normally comes medium rare, but we asked for medium instead.  When it arrived, the cut through the middle was clearly raw, with blood draining out.  They replaced it with the previously mentioned sausage platter, though it took a while to come out as a result.<br><br>To make up for it, they offered free dessert, and we ordered the brownie w/ icecream.  It came in a glass bowl, and normally you would expect a nice warm brownie with cold ice cream.  Instead it came out in less than a minute and the brownie was room temperature, and not soft like you'd expect either.<br><br>Regardless of the food issues, I'd still recommend this spot for some beers and maybe an appetizer.  Not the dinner I was expecting after all the hype.", "pics": null}}, {"review": {"des": "Patio filled with loud obnoxious table of drunk under 30 girls. Couldn't enjoy dinner nor could anyone else on the patio. Manager said \"they were here before you\" and \"why did you stay on the patio if they were too loud?\" Disrespectful manager horrible loud and proud crowd doing shots and ruined what once was a lovely establishment. Never going back and plan to let everyone know the quality of food and handling of customers is horrendous!!!!!!! Stay away - too many patios too many restaurants with better food in Chicago.", "pics": null}}, {"review": {"des": "Dinner 11/17/17<br>Mussels: 3/5<br>House-made sausage plate: 2.5/5<br>Brussel sprouts: 4/5<br><br>Way too hot by the fireplace<br>Nice cozy place overall", "pics": null}}, {"review": {"des": "This place was a fun and ok experience. The restaurant itself is nice and clean. There is indoor and outdoor dining. The service was nice as well. The food was pretty good too. It's a nice place to go if you are looking for a place to chat with a friend and enjoy nice food and drinks.", "pics": null}}, {"review": {"des": "They've got a fantastic beer selection, solid food and it's a really cool space too, all for average Andersonville prices. <br><br>For the beer, I always try a new beer they have on tap, and 90% of the time it's fantastic. I've been there with massive beer snobs who have been consistently pleased with their selection. And it's pretty modestly priced. It's a great place to grab a drink with a couple friends, or with a date, though if you go on Friday or Saturday you might have to wait a little while. <br><br>Something to note, the place is massivr: the front room only orders through the bartender; there are two rooms and a porch that are waited on, and these would be the place to go for a date. I'd recommend the porch if the weather permits, it's a great atmosphere, with really nice, subtle lighting.  There's another bar in the third room that you can sit at also, which is great for drinking with friends or a casual night out. <br><br>Also, the food is good, but only about 3/5 good. It's solid, but nothing special about it for Andersonville...except for the mussels. They are prepared two ways, and both are fantastic. Everything else is decent, but the mussels are legitimately good. <br><br>All in all, it's a very good place to go for a dinner-then-a-couple-drinks night: a good vibe, decent food and great beer.", "pics": null}}, {"review": {"des": "This used to be my old watering hole when I lived in Andersonville for 7 years. It has since been through a beautiful renovation that includes an outdoor patio where they grow some of their own herbs. <br><br>Beer. Tasting. This gets dangerous! I love being able to try so many different types of beers before committing. The beer menu is overwhelming, extensive, and probably as close to heaven as you can get if you're a beer lover. If not, they have great decently priced wines on tap. <br><br>The Belgian Prince Edward Island mussels... Le sigh. So good. I've never had a bad batch in 13 years. The chef is also great with vegetarian and vegan items. I once had a really interesting mushroom main that I think was a bear's tooth mushroom (wild, unusual, delicious). Other standouts are the cashew butter and fig jam grilled cheese with Stilton Mac and their excellent charcuterie options. I've never been impressed by any of their duck options, whether confit or Reuben but mostly you can't go wrong at this place.", "pics": null}}, {"review": {"des": "Best bar in Chicago. LOADS of drinks with knowledgeable bartenders, superb food, fantastic music, and lots of seating. Backdoor patio, too!<br><br>My absolute favorite place to go to in the city.", "pics": null}}, {"review": {"des": "I recently moved from Wrigleyville to Andersonville. In Wrigley I had Mystic Celt, which was my go-to bar for comfort and bar food. In Andersoville I had yet to find a place that I could call my go-to bar... and I found it in Hopleaf!<br><br>Hopleaf caught my attention because I have fond memories of a trip to Belgium where I ate mussels and frites in excess... and drank copious amounts of beer. And well, Hopleaf's sign outside says Mussles, Frites, Bier. BAM!<br><br>We had brunch in the patio as it was a perfect early Fall day. Drank a carafe of Malbec and had 2 wonderful and savory sandwiches with frites on the side. Wow.<br><br>Wait service was awesome and attentive, food delicious, price was about right. I will definitely come back. Soon.", "pics": null}}, {"review": {"des": "Zombie dust on Tap?  Check. <br>Great ambiance?  Check.<br>Great food?  Check.<br><br>Can't beat that folks.  Came here after finding some other bars near Furama is closed.  After walking 50 (felt like) blocks in snow, we get in, get some zombie dust from the tap and just talk about how awesome 2017 was.<br><br>As you can read from other reviews, this place has all the attributes of a great neighborhood bar.  Other than being packed on nights and weekends, you won't regret visiting one of the greatest bars in Chicago.", "pics": null}}, {"review": {"des": "Love this place. Huge beer selection, great environment, and the dishes are well designed and delicious. A great place to get a quick drink, meet a friend, or have a full on dinner date.", "pics": null}}, {"review": {"des": "NO KIDS ALLOWED!!!<br>It's their actual policy!! A craft beer bar after my own heart, finally a place for us to spend our money & enjoy adult company without fussy screaming kids being foisted on us in a place they shouldn't even be allowed. Hop Leaf gets it. We need more pubs like it. Much love to them. (And this place was absolutely PACKED on a Thursday night at a very late hour so clearly those of us who wish to be free of the company of other people's unruly kids, we are legion.)<br>We worshiped at the shrine of amazing beer & enjoyed excellent food in a cozy European cafe atmosphere. 4 stars instead of 5 for two misses-- the guy at the door checking IDs on 12/1 was a total dick & the single cheese on the pricey cheese plate was rubbery & the wrong temperature (very cold), rendering it utterly tasteless.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/7tr2VS9gKoj8PL7Dzv-4Qw/348s.jpg", "caption": "Cheese was pretty but served far too cold- rubbery & tasteless on 12/1."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/9Uocy2PA_axkX735ZhX6jA/168s.jpg", "caption": "Autumn in a bowl, excellent."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/PsiEhTWQY1Ou9C7Ea7iXsA/168s.jpg", "caption": "Celery in the mussel aromatics-- genius!"}]}}, {"review": {"des": "My girlfriend likes this place, I'm not a fan. This may be due to the available beers and also the food. Don't get me wrong, the place has a big beer selection, it is just not something I enjoy drinking. This is strange, since I like Belgians beer a lot. Pretty much stuck drinking Temperance all night. Regarding food, I had headcheese the first time around (small and basically the taste of soy sauce was overwhelming) and the pork-chop. I like head cheese, not a fan of eating soy sauce thought. Second time around I went for a sandwich (see picture). I'm pretty sure the sandwich was a mix-up order or one meat sold as something else. It was edible for what it was and I ate it because I was hungry.<br><br>Service: The service is really good and friendly. It also hopes that they are open late night. I just wish the food/beer was more agreeable to my pallet. I'll be back, but only if the GF requests it.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/qjcFi0vB92PYV5-MEPjYcw/348s.jpg", "caption": "Wings"}]}}, {"review": {"des": "Great beer, good food, and chill atmosphere. One bartender was kinda rude ... don't leave barstools in the \"well\" if you don't want people sitting there. I'm talking to you, beanie-wearing guy.<br><br>**Taking my review from 4 stars to 1 after \"Ron H\" (probably the bartender in question) sent me the following message after I posted the 4 star review:<br><br>\"The bartender, being separated by the bar, is physically unable to control chair placement. Maybe next time just be kind and stay out of the well so servers can do their job. I'm talking to you, passive-aggressive hat aficionado.\"<br><br>Funny thing is, we told him all of this in person. Twice.  Because he kept being rude when we pointed out the chair was in the well when we arrived. We counted six employees that could have moved this chair if it was such a big deal.", "pics": null}}, {"review": {"des": "Another amazing gastropub located in Andersonville that has also been featured on travel shows and food blogs.<br><br>There's certainly a great ambience once you walk inside and experience either the bar or dining area. Plenty of small tables and open seating if you're simply grabbing a drink, and a larger seating area in the back with high ceilings and wall art.<br><br>Hopleaf certainly demands that you consume some drafts while inside, but that's not the only thing they're good at. Let's talk about some of that food too!<br><br>We ordered the House-made Sausage Plate, Mussels and Frites for one, and a Trio platter of their Country Pate, Chicken Liver Mousse, and Spicy Smoked Duck Breast.<br><br>The sausages were amazing and the variety of spices was on point. Even though we only ordered the mussels \"for one,\" it was enough to feed an entire party of three. As for the trio platter, the duck and chicken liver were both on point. My mouth is salivating just writing about it. The pate was also good, but definitely a lot considering the small amount of pita chips we had that accompanied the spread. I'd pass on this next time.<br><br>Grab another extra round of beers and really enjoy the variety and tastiness of all the different flavors each plate has to offer at Hopleaf.", "pics": null}}, {"review": {"des": "Saw all the yelp reviews. Don't get all the hype, I can here to eat. Food was very okay, nothing special for me.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/BUEaUmrnyAw_tzIie6klAQ/168s.jpg", "caption": "Ham sammy"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/jDdJbVr--y477KPVHiPZjw/168s.jpg", "caption": "Mac n cheese"}]}}, {"review": {"des": "First impression is good, nothing fancy, upscale or pretentious. Doorman didn't card me, finally. It's kind of ridiculous to card a 60 year old man. Even if I looked 10 years younger than my age I would still look 50. Anyway I love Belgian wits, my favorite kind of beer. I started with the Babar, a sturdy blonde wit, very nice citrus and flower notes. Now for something to go with it. I ordered the sausage plate and the onion strings. The sausage plate came with kinda of sausage, spicy mustard and  sauteed onions. They were all good, but the kielbasa was my favorite. The strings were hour and plentiful and messy. Good times. The second beer I ordered was the Brune 8. It was smokey and a hint of soureness that I enjoyed. The staff here is smart friendly and funny. Never overhearing, but always there when you bed them. I can't wait to go back.", "pics": null}}, {"review": {"des": "The mussels are the biggest, juiciest mussels I've ever had. So delicious. The fries that come with are perfectly cooked and the garlic aioli is out of this world.<br>They have a huge taplist and we enjoyed a few different beers.<br><br>The bouncer has the best laugh I've ever heard. <br><br>Would definitely recommend.", "pics": null}}, {"review": {"des": "Such a great bar in Andersonville. Their food menu is not what you would expect for typical bar food, but the atmosphere is fun and the drinks are too notch. This is one of my go to spots in the area!", "pics": null}}, {"review": {"des": "Everything was great! My favorite out of everything were the huge mussels ' omg they were very tasty! The Mac and cheese was good too but it could be a bit more cheesier! The frys were good too ! I the sandwiches were too ! My drink was my favorite too our servers were very nice except of one chick who gave me a very bad attitude ! I asked her a question and she rolled her eyes and just didn't want to talk or answer me :( idk her name but she was a young short white chick with short hair ' she just needs to have a better attitude towards people", "pics": null}}, {"review": {"des": "SUPER TERRIFIC! If you love beer and incredible food, come here! Came on a Saturday night around 6:30 on a date night. We were seated around the glass encased kitchen area and it was super interesting watching the cooks. They were amazing. This food.... A.MA.ZING. We started with the beet and brussels sprout salad, very tasty, with a few slices each of red and golden beets, so if you're excited about beets, you might be disappointed with the mound of shredded brussels sprouts. In any case, it was delish! We shared the order of mussels for one. I don't know how many came in this order, but i feel like I ate 10!!! Sooooo good! They come with frites which are served with a delicious garlic crack mayo. So yum. On to the entrees - hubby had a beef brisket sandwich with a side salad and i ordered the special of the night, which was a vegetarian dish - masa cake on a bed of collard greens with an amazing spicy sauce with sunchokes and sunflower seeds. Soooo good. Even though it looked like a small dish, i couldn't finish it.... so delicious! Beer: i ordered a 5 Rabbit La Protesta. Really nice golden ale.  Light and just right!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/-6M1Fnketiw6WJPFC8dNJQ/168s.jpg", "caption": "Masa cake special tonight. Vegetarian dish,  super yum. Cooks making magic in the background!"}]}}, {"review": {"des": "Great timing! My wife and I wanted a late lunch and arrived around 4:00pm. She had a CB&J (their signature dish) and it was delicious. I enjoyed the fried catfish hoagie, delicious as well. The fried fish was crispy with a Panko crusting, tasty aioli's and sauces all around and very good fries  Back to the CB&J which is cashew butter & jelly for all of those ladies and gentleman out there who are allergic to peanuts like myself. Yay . <br><br>Service was good, very friendly servers and a very cool venue with a patio and a multi room multi bar restaurant area with an interesting brick repurposed warehouse feel. <br><br>The beer list was on point with 30+ beers available ALL ON TAP! Awesome. Beers from all over the world  and a nice local representation they even serve Kwak in the glass it's made to be served in with the wooden holder. <br><br>I forgot to mention this place has a Michelin designation: Bib gourmand. Which it lived up to.", "pics": null}}, {"review": {"des": "The place was very cute and the food was good. Not sure if the food was worth the price tag though.", "pics": null}}, {"review": {"des": "Having been to this place twice now, I think it deserves huge props for all the beers and spirits they house. Having gone just for a couple minutes on a bar crawl previously, they had awesome specials (5$ delirium tremens on draft) and other great beer selections. Having gone there on a slower day, we had a chance to enjoy looking through the menu and even had a chance to explore he back bar they have on the other side of the restaraunt. They had over 20 taps as well as a wide selection of bottled beer. Though we didn't eat, the menu looked amazing and smelled great from surrounding guests. <br><br>HIGHLY recommend for all people, not just the beer snobs ;)", "pics": null}}, {"review": {"des": "Love this place!  Tons of great beer on tap and I had a duck Rueben that was amazing!  I'll be dreaming about that Rueben for a long time!!!", "pics": null}}, {"review": {"des": "Beer selection seems good. Fairly priced, they had some gluten free options which was great for me. The Fries are the real star of the show here, thin and crispy! Saw them come out and I had to order! The portion was large too, which is fantastic for a good snack with a couple of brewskis with buds. <br>Gets loud and crazy busy on the weekends, so not ideal for a date, though I believe there's also a back room with plenty of extra seating.", "pics": null}}, {"review": {"des": "We stopped for a bite before a concert on a weeknight & were seated right away. <br>The atmosphere was nice, the fireplace was going and we were REALLY interested in some drinks and a little food. <br>For a bar, the food was pretty good. We had the mussels in white wine, the duck ruben & the sausage plate. Absolutely no complaints about the food or service, but I feel it was a bit pricey for the amount of food that was given.. I was teetering on 5 stars here but I'm going with 4 for the price factor only.", "pics": null}}, {"review": {"des": "Hopleaf is a very popular beer bar and restaurant... and for good reason! I went to Hopleaf for the first time a few weeks ago. They have a pretty large space, but it's segmented in smaller rooms, creating a more intimate feel in each area. We had a beer upstairs while waiting for a table. There are limited beers on draft upstairs, but plenty of bottles to choose from. There are so many options, you won't have any problems finding a beer you like!  <br><br>The food was amazing! We had the mussels for two with white wine and fish broth. It very nice and mild, not too fishy. I loved the frites and the accompanying aoli was yummy! My date and I also shared the herbed polenta cake, which was smaller in size, but very savory and flavorful. I loved the mushroom ragout and all the ingredients were very well balanced. We weren't starving and wanted a small and light meal. What we had was absolutely perfect. I definitely want to come back and try the rest of the menu!", "pics": null}}, {"review": {"des": "Ok so I've been dying to try this place forever. I'll start by first saying once you get past the old bar room this place is really cute. But if we're talking food. Ehh not worth it. We had the mussels with the Belgium beer first. They claim the are known for the mussels. Don't do it!  Broth completely lacking in flavor and had 2 that were just plain bad. If you've ever had bad mussels you'll know what I'm talking about. If you don't let's just say like a gerbils ammonia tasting urine. Also got the grass fed steak. For $35 I've had way better. Smothered in herb butter and was extremely salty. All in all nice place to get a drink and the fries were tasty but I'm sure you can find that almost anywhere.", "pics": null}}, {"review": {"des": "I'm not into beer, but a friend invited me to a fundraiser and I was already in the area so I stopped by. The server asked me what I wanted and there were so many options that I was slightly intimidated. I explained my non-beer situation and he made a couple of suggestions. After more hemming and hawing on my part, he basically said get the blossom blend cider. So I did. It was really good! Clean, light, and refreshing. I'd have to try more things before this becomes a 5 star review but I'm definitely a fan so far.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/V363NOmKBrkXx7cDcXOYqg/168s.jpg", "caption": "Blossom blend cider"}]}}, {"review": {"des": "Hopleaf is one of those bars that make me optimistic about the future of the country. Good beer, knowledgeable bartenders. Options for people on draft,bottles. Never eaten here. It's a comfortable place to have a beer or two.", "pics": null}}, {"review": {"des": "Reference place for beer (especially the Belgian ones). <br>That said, food prices have increased, and amounts decreased. Indeed, $13 (excluded of tax and tips, of course) for 10 mussels (yes! A 10-count) seemed a little bit overpriced. Mussels were not exceptional, and the beer sauce was mostly oil.<br>Sandwiches also have shrunk and price increased. No hopleaf, we are not cash cows, sorry!", "pics": null}}, {"review": {"des": "WOAH man! From the outside, this place was very unassuming. What we thought was a small, cozy, and hip little bar opened up into a vast, multi-dimensional haven for beer and pub food. There's a ground floor with two areas - each with a separate bar - but also an upstairs section with a balcony eating area as well as an upstairs 'patio' (which is just another room).<br><br>Being from the west coast, I was surprised at how plentiful Zombie Dust was at various local bars. Hopleaf certainly had plenty of this liquid gold of a pale. And it doesn't stop there. Their bottle list was also exceptional. You'll find bombers of rare and limited releases along with some other goodies. My boyfriend and I were pleasantly surprised to see a bottle of Bourbon County Rare just chillin in the [locked] fridge. Too bad we didn't have anyone to share it with because while it's wonderful to discover these rarities at bars, BCBS Rare was $70. <br><br>Food wasn't too bad. The mussels for 1 at $13 served as a great appetizer between the two of us. The meat board was different with all the various kinds of meats, but scrumptious. The salmon for $25 though seemed like overkill especially for the portion.<br><br>Whether you want to sit back and enjoy a brew with friends in a casual and social setting or scope out rare bottles maybe while pairing them with great food offerings, Hopleaf has it all. More than anything, I was surprised at the mere size of the place and all the great beer on tap. That in and of itself is enough to satisfy someone like me!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/9oL8ZlIPoaId_iOxe3V2Ow/348s.jpg", "caption": "Locked special bottles fridge"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/bBwpDHCiwE4cn2_KCzu7bg/168s.jpg", "caption": "Oh just some Rare chillin in the fridge, nbd"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/X-KjziRYVshWNoKMN-PukQ/168s.jpg", "caption": "Mussels for 1 ($13) - reminds me of mushrooms"}]}}, {"review": {"des": "My partner and I had never been to Hopleaf in Andersonville. I knew the place was known for being a great beer drinking spot in the neighborhood and the new expansion of the space impressed us enough to go and give it a try. <br><br>No one on the staff was particularly welcoming or friendly. No wait staff here, one has to order food from a bartender at the bar and someone brings your food out to your table. We ordered a wedge salad ($9.00), brisket sandwich ($14.00), and a pork belly BLT ($13.00). The salad was covered in way too much dressing and mediocre. The sandwiches were both the worst we've ever eaten. Both were small sandwichs on a bland (nothing special) bread, the pork belly was hard and the brisket meat was mushy, no firmness to the meat at all. The BLT came with homemade chips, again just ok. The brisket came with ok french fries and a pickle spear. The pickle tasted like straight vinegar and nothing else. <br><br>Hopleaf might be a good spot to hang out and have a few beers, but we will not be back for even that. I would definitely skip Hopleaf for the food. There are also many other great bars with impressive beer selections and friendlier staff. I wish we would have just gone to Subway! We would have been a whole happier and saved a lot of money!", "pics": null}}, {"review": {"des": "Great food, crazy list of Belgian beers. Looking forward to round 2 with that duck Reuben and making my way down that list", "pics": null}}, {"review": {"des": "Excellent food, fantastic beer, great atmosphere.  Whenever I'm in the area, I find an excuse to come here.", "pics": null}}, {"review": {"des": "This gastropub was a welcome addition to Andersonville years ago when it only had one store-front.  Now that it has expanded into the space(s) next door, it has only gotten better.  What's not to like about a neighborhood bar (with an expansive selection of beer, wine & cocktails)  that serves top notch food?  <br><br>Their moules frites, are some of the best.  I've had them prepared with white wine,  or with ale, Belgian style.  The fries are cut in house, and are usually crispy on the outside and served with garlic aioli.  (Truth be told, I love Hopleaf, but sometimes the fries can be soggy...beware...and don't hesitate to send 'em back for some fresh ones).  <br><br>This visit, I tried the Duck Leg Confit.  The duck was extremely flavorful, redolent of fresh herbs and spices. It sat  on a sweet potato \"waffle\" of sorts.   Crispy on the outside, perfectly melt-in-your-mouth tender inside.  The duck leg/thigh combo and a duck sausage were accompanied by Brussels sprouts, and a root veg puree and a maple flavored sauce.  You couldn't have done better at a Paris bistro.  <br><br>Service is always courteous, without being overbearing.  Its a perfect place to sit at the bar and grab a bite, or have a dinner at one of the tables (inside (or outside in the summer) . Hopleaf is a place you will return to time and time again.", "pics": null}}, {"review": {"des": "Gastropub with a boundless drink selection, and a great food selection as well. The grass fed brisket sandwich was delicious, but had a prominent mustard flavor (clearly fresh ground though). The drink menu is helpfully broken down into styles, and should you be curious, the wait staff is knowledgeable and able to give small samples. Everything is high quality and you will not be disappointed with your experience.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Caro7aRqx-_lb_j3x3982Q/348s.jpg", "caption": "Grass - Fed Brisket Sandwich with fries"}]}}, {"review": {"des": "One of my favorite places in all of Chicago. Great beer, excellent food, good prices, fantastic ambience. Often, they even support local charities and non-profits. Thank you for existing, Hopleaf!!", "pics": null}}, {"review": {"des": "I'm in between 3 & 4 stars but decided to round down because my experience this time was sad compared to all the other times I've been here over the years. My dining experiences at Hopleaf have always matched my expectations and I didn't think it would be any different when we decided to come here last Friday. I was definitely wrong about that! To sum up our dinner here: they were out of basically every bottle of beer, their draft beer list has been the same for the past 4 years without any new craft beers that are popular these days, the beef stew literally contained 2 small meat cubes with some veggies, and the brisket sandwich was half the size that it normally is. Didn't feel the love coming here last week and definitely think Hopleaf and I need a break.", "pics": null}}, {"review": {"des": "Between the unfriendly bouncer at the door that made us feel like we were coming into a low rent bar, to our disconnected and slow server, I certainly wish I would chosen a different restaurant to impress a client with. Disappointing. The food is always good, but that is quickly becoming not enough to keep me coming back.", "pics": null}}, {"review": {"des": "Simply put, they have the best craft beers on tap. You won't find another bar in Chicago with a beer selection like theirs. The staff there are incredibly welcoming as well. <br><br>They also have Zombie Dust on tap. Game over. There's nothing more to say about this place. Period.", "pics": null}}, {"review": {"des": "Overall, I REALLY love this place....knocked a star off, because of inconsistency in food and service. <br><br>PROS: Mussels and fries are consistently great; it's without a doubt my favorite dish at the restaurant. Fries are really good...crispy, and a good-sized portion. Beer selection is always extensive, and it's decent service at the bar.I really like the feel of the place, too. It can get very lively and very crowded when it's in full-swing, but it has a really nice intimate pub feel when you sit up front. It's also a huge place, so when they have the whole place open, it's good for busy nights.<br><br>CONS: Table service has never been spectacular...it's really slow to get drinks, and hit-or-miss in terms of friendly wait staff.While I enjoy ease and speed of service at the bar, the bar tenders can be a bit aloof, and they're either really helpful, or don't care when it comes to recommendations. Anything i've had on their menu outside the mussels hasn't been consistent. I've had the duck ruben a couple times; it's either been good, or completely forgettable. They don't have a ton of vegetarian or vegan options for anyone with dietary restrictions. <br><br>If you go for just drinks, it's a great spot for a terrific variety of beer. Dinner can yield some inconsistent service and food.", "pics": null}}, {"review": {"des": "An unassuming bar from the outside, but it hides a lovely dining area in the back and even lovelier patio in the backyard. The wait staff is friendly and know the menu so well that they can make great recommendations. <br><br>I had the Mussels in the Sweet Corn & Tarragon Broth by my their recommendaton and it was perfect. The slivers of sautéed fennel, sweet pops of corn and steamed mussels in a tarragon miso broth. It comes with two little loafs of crusty bread to soak up all the flavor, but the broth was so delicious that I just drained the whole pot after I ran out of bread. There is also a large funnel of fries that I was barely able to make a dent in. The mussels goes perfectly with a cold glass of their Hopleaf Patio Tree Cider, made from their own apple trees!!  A definite recommendation if you are in the area.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ulojhLimsMNc3Eruwar64g/168s.jpg", "caption": "Tarragon and Fennel steamed Mussels with crusty bread for the delicious broth!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/rpdXypx5o7s_anAFxIbf_g/168s.jpg", "caption": "Steamed mussels paired with Hopleaf Patio Trees Cider"}]}}, {"review": {"des": "Returned for another wonderful late lunch. I had the fried catfish sandwich which was absolutely fantastic. It comes with a bucket of crispy fries. <br><br>I also had the Kwak beer which was amazing. Sweet Amber colored extremely tasty beer. <br><br>I love this place.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/WLV-ENRuC4423pMvUy0ZBg/168s.jpg", "caption": "Kwak beer totally wonderful."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/oMRM1upP3pRsEGmM0xhfsg/168s.jpg", "caption": "Fried catfish sandwich a killer sandwich! Huge portion size not skimpy with great crunch factor."}]}}]}