{"name": "hub-51-chicago-2", "reviews": [{"review": {"des": "Visiting Chicago during Thanksgiving and wanted to have a nice, traditional Thanksgiving dinner with the family. Hub 51's buffet was perfect, and exactly what we were looking for. They had all the traditional elements (sides were delicious) as well as some extra items like salmon (just okay) and what seems to be their specialty, the short rib (amazing). <br><br>I was slightly disappointed in the variety of desserts, but the butterscotch dessert with homemade caramel on top was the perfect ending to an awesome meal.", "pics": null}}, {"review": {"des": "Ate brunch here on a Sunday afternoon. Drinks and food were excellent. Service was too. It was not busy, about half full.<br><br>Get the French toast. Wow.", "pics": null}}, {"review": {"des": "Love this place. Only had dinner here a few times but stop in every visit to Chicago for the dessert. The brownie and carrot cake are amazing. Literally the best carrot cake I have had. <br><br>The location is great and it is a bit trendy inside. They always have great cocktail specials and a local selection of drafts. <br><br>If you are looking for carrot cake you have to stop in here.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/dgjNZ6jjqA45HPAsQFhu_Q/168s.jpg", "caption": "Amazing carrot cake"}]}}, {"review": {"des": "Hub 51 has always been my go to brunch place in the city; and it's safe to say that I will be there even more now due to their new Bottomless Bellini package!! Bottomless Bellini + one entree + one side for $40!! Can you believe it?! What a steal!<br><br>Another new discovery was the spiked coffee with do-rite donuts. I absolutely am obsessed with do-rite and I am so happy I can get one at Hub 51 now with my spiked coffee. I don't think it can get any better than this. <br><br>After all this time, I still love the breakfast nachos. I think it's the perfect dish to share (or not!) and it's loaded with breakfast goodies and the chips are just so thin and crispy but hold up to all the fixings. <br><br>For my birthday last year, my boyfriend got me a whole hub 51 carrot cake and that was honestly the best present ever. <br><br>TLDR; just go for the bottomless Bellini!! It won't disappoint.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/kxsTEWz_d4mNInrDqvI34w/348s.jpg", "caption": "Hash Brown Benedict"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/a2nryzhQLztfchSM_aUAsw/168s.jpg", "caption": "Pancakes"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/QumwM0fTWPCzCqIFPrfe3w/168s.jpg", "caption": "Breakfast Nachos"}]}}, {"review": {"des": "Came here for brunch with my extended family.  Overall, service is good, but the food is atrocious. The menu is not well thought out and poorly executed. <br><br>Chicken nachos: good concept and flavor but badly executed. We had a few orders of these and some of portions were HUGE while some were half of the big ones. Seemed like there was lack of consistency. Also, after 5 min the nachos end up getting soggy and so everything just turns to mush. <br><br>Cinnamon pancakes: TEENY TINY portions. Didn't make sense as everything else was massive. Good flavor bough. <br><br>Avocado toast: it had the potential to be awesome but it was very bland. The ricotta cheese could have been interesting but it was just flavorless and did nothing to add to he dish. Not worth 15 dollars. <br><br>Chicken spring rolls: over filled with disgusting chicken mash. The chicken mash needed salt and looked like chewed up chicken that some one had thrown up on a plate. No thank you. <br><br>Breakfast burrito: originally served with SHRIMP in it. My cousin's husband got this and he's  allergic to shellfish. What BREAKFAST BURRITO HAS SHRIMP?! We were shocked because it wasn't stated in the menu. Turns out this dish wasn't served with shrimp but our server made an error in writing down the order. It's a little odd, but no big deal it happens. Anyway, they were nice about it and re made the burrito but that took so long that my husband's cousin ended up just eating her chicken nachos. When the real burrito came out, it was nothing special. <br><br>Turkey sub: fine. My father in law ate all of it. <br><br>Skinny Lemon Pancakes: pretty good. The flavor and sauces with this were good. They were crepe-like and light pancakes. Wish they would incorporate more food like this.  <br><br>Brownies: I've had better brownies at chain restaurants like Applebee's. Brownie was baked to the point it was brunt on the sides and relay hard to dig into with a spoon. If I hasn't been with my family, I seriously would have just sent this back. It was just bad. <br><br>Blueberry cake: the saving grace of this meal. Soft, creamy, and delicious. Would recommend. <br><br>Mexican hash browns: these had pico De gallo and cheese and looked awesome. However, the potatoes were not crisp and seemed under done. <br><br>Maybe their dinner menu is better but I would say this brunch is not worth your time. Seriously avoid at all costs. You can better food at Chili's in the suburbs.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/xzk1pQQavyEL1OaezikoCA/348s.jpg", "caption": "Burnt brownie edges. You can imagine how hard and dry the rest of the brownie was."}]}}, {"review": {"des": "Came here on a random Saturday mid-afternoon. The place was pretty quiet but I believe it gets pretty crowded for dinner and evening. Their menu is very unique - they offer dishes from sushi to mac and cheese to chips and guac. We split some dishes and really enjoyed everything we tried. <br><br>The Bang Bang cauliflower is out of this world! My fiance, who hates cauliflower, even loved this dish. We would come back here again just for this cauliflower! The hummus with the toasted naan was also a hit. <br><br>The service was very quick and friendly. Knocked down 1 star as the prices seemed a bit high for what it was.", "pics": null}}, {"review": {"des": "In the mood for sushi but your S.O desperately wants Tacos? Or maybe you're looking for a nice night out but worried about your kids finding something on the menu? Hub 51 is the place for you! Their menu ranges from sushi to tacos to salads to burgers to meatloaf and more and it's all executed beautifully. And don't even get me started on their desserts. I loved this spot! Everything from their awesome \"oldies but goodies\" playlist to their clever namesake (located at 51 Hubbard). <br><br>I started off with their off menu cocktail feature the \"Basic B\". It was pretty much a chai latte in martini form and it was delicious. However it was a bit heavy so I opted for their Award Winning Hub Punch next... I can tell why it's won awards!! A delicious (and potent) combination of grey goose, tequila, orange and lime. <br><br>My boyfriend and I order a few plates to share and we were glad we did. We started off with the chips and guacamole and were amazed at the portion size! SO much guac! And totally worth the $12. We then ordered the Spicy Shrimp and Crab Roll and the Filet Mignon Tacos. I'm not much of a sushi person but he really liked the rolls. And the tacos were also quite good... they came with an excellent salsa verde and delicious side of black beans. We also ordered a side of the Hub Fries because what's a night out without French fries?!<br><br>When our server brought us the dessert menu she recommended their Blueberry cake so we ordered one of those and the Chocolate Pudding Pie (essentially a s'mores pie... yum!). But man that blueberry cake. I'll be thinking about that for the next several days. It was the most moist and flavorful cake I've ever had and I can tell why everyone who works there favors it!<br><br>Hub 51 will provide you with both a fun night out, and a happy and full tummy. It's great for any occasion and they even have private rooms available for events!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ZQF4Y6V9HW_x9KBrL4C8ww/348s.jpg", "caption": "Filet Mignon Tacos"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/9YiB0dGV-S8goUSK9j9Ejw/168s.jpg", "caption": "\"Basic B\" cocktail"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/HjhrniCtsCY3ab4wJQBNdg/168s.jpg", "caption": "Chips & Guacamole"}]}}, {"review": {"des": "The food here was simply outstanding. We came with a fairly large group for a friend's birthday and sampled a ton of appetizers like the bang-bang cauliflower (which people gobbled up quickly), the Oktoberfest special pretzel and beer cheese (one of the best Bavarian-style pretzels I've ever had), and the chips and guacamole. <br><br>I had their famous chicken Tinga tacos and split one of the tuna sushi rolls and both were fantastic. I think everyone in our group was completely stuffed by the time we left.<br><br>Btw, try their special house punch, to me it tasted kinda like an orange creamsicle (though I don't think there was any orange in it). Regardless, it was delicious.", "pics": null}}, {"review": {"des": "Overall: A great option for a team lunch or meal before a night out<br><br>The good: One of the best things about H51 is the varied menu. There's a lot to choose from, whether it's a salad, sandwich, taco, sushi, or some sort of hybrid. The portion sizes were well-sized but not overwhelming, and the brussels sprout/chicken salad that I had was cooked well. The pairing of the cheeses, dates, and chicken created interesting flavors. Lastly, the place is professional, clean, and inviting.<br><br>The not-so-good: Prices are a little too high (but, River North), lunch shouldn't cost $18. Also, our server was aggressively attentive during ordering. I understand the need to flip tables, but she needed to give us more time after coming over several times before we were ready. <br><br>Atmosphere: 8.5/10<br>Service: 8/10<br>Food: 9/10", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/TmEEqtjbkQev6n2rRfXGaQ/348s.jpg", "caption": "Brussel sprouts salad with chicken"}]}}, {"review": {"des": "My coworkers and I came here for lunch, and got the sushi. Everyone liked their sushi rolls, and I got the crunchy tuna. It was good sushi, but nothing amazing or worth going out of my way to visit. While the food didn't wow me and I wouldn't go out of my way to come here again, the service was very friendly and the place was very stylish and on brand with the River North neighborhood.", "pics": null}}, {"review": {"des": "Service outside was excellent!  The server had the greatest temperament, remained attentive, and made great suggestions!  He needs to be duplicated for every other restaurant.<br><br>The location was great for people watching.  I gotta high five from a newlywed.  Funny thing...he didn't know where his wife was.  That's another story!<br><br>The food looked great.  The beef on the French dip was hot and moist.  The sushi was sushi.  I do want the Sunday Night Chicken Egg Roll again!!<br><br>That salad is always just perfect, no matter which Lettuce Entertain You restaurant serves it. <br><br>The chicken nachos looked delicious, but the chicken lacked flavor.  I'll pass on that next time.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/F-zIcNd12m_U8rYGe0XBpg/348s.jpg", "caption": "California Sushi Roll and Beach Club Salad."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/E7w_Kml3GrR5r893t0hCbg/168s.jpg", "caption": "Pulled Chicken Nachos"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ibsPdFYzdCO5arGkBbNSnw/168s.jpg", "caption": "Classic French Dip with fries"}]}}, {"review": {"des": "Came here with a large group for a friend's birthday last night. We were so pleased with the food and the service.<br><br>Dealing with larger groups can be a pain sometimes but our waitress was awesome. She checked in on us often and everything came out correctly.<br><br>The food itself was fantastic. We ordered a bunch of appetizers including the new pretzel they have for Oktoberfest and the bang-bang cauliflower which I would eat every day of my life! The guac was also pretty good but the tortilla chips were a little thin and kept breaking apart. It would probably be better with a slightly thicker chip.<br><br>All of our entrees were tasty as well. I had the tempura sweet potato roll and bites of the chicken nachos and one of the tacos. Everything was amazing. <br><br>Oh, and I highly recommend pitchers of the Hub Punch! Will definitely be back.", "pics": null}}, {"review": {"des": "Stopped in here on a Wednesday night with some girlfriends for a quick drink. The women at the front greeted us and asked if we'd like a table but we told her we'd just grab a table near the bar. The server came over with a few minutes. We ordered the rum punch and Moscow mules. The rum punch was exactly how I remembered it. Sweet and tangy but also pretty strong. My friends enjoyed their Moscow mules. One of them mentioned it had too much ice but otherwise good. We did have to wait quite awhile for our check but the place was getting busier and it was Halloween. Overall much better service than the past few times I've been there.", "pics": null}}, {"review": {"des": "Brunch at Hub 51 was great! I would recommend the French toast - it was huge and so sweet. the day break egg white omelette was also light and delicious.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/M0U0zZnuYkKq4wje6l4Baw/348s.jpg", "caption": "Thick-Cut Brioche French Toast"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/DK8C3GdeKeMI_u2eJp2LaQ/168s.jpg", "caption": "Spiked coffee and donut"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/_2G541UeubNkH5-GLIM5Ew/168s.jpg", "caption": "Day The Day Breaker Omelette"}]}}, {"review": {"des": "Great spot for brunch. We were a party of four and had a good time. Great ambiance with out door seating. We ordered cheese burger, the highly recommended pulled chicken nachos, lemon skinny pancake and cinnamon roll pancake which all had great flavor. The pulled chicken nachos comes in a big portion to share with and is indeed delicious. A must try when you visit. <br><br>Overall great vibe and atmosphere with some good quality food.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/xt4io1qSd7TUIANSspBRwQ/348s.jpg", "caption": "Drinks menu"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/N-5-VMUrPvlQGHNwk_K1zw/168s.jpg", "caption": "Drinks menu"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/mifnGh5nMyTXWFTUk7tlFg/168s.jpg", "caption": "First - Rate Prime Cheeseburger"}]}}, {"review": {"des": "Seems like a staple in downtown Chicago. I took some clients here for lunch and as a typical lunch meeting goes we ordered salads all around. <br><br>It's a nice diverse menu, something for everyone. Breakfast food, salads, tacos, sandwiches and ready for this - sushi. That was unexpected but he sushi was very good. Highly recommend. <br><br>I also ordered the Brussel sprout salad. It was fresh but s little bland. Has the bite of a Brussel sprout too. So not sure if it needed more flavorful dressing or more toppings? <br><br>My colleagues ordered it with shrimp and salmon and said both were delicious. <br><br>They have a great looking brunch and dessert menu. Would come back to try both. <br><br>Pros:<br>Very friendly staff<br>No wait or reservation needed for lunch <br>Nice variety in the menu <br>Very good sushi rolls - I had king crab California roll<br>Fresh brewed iced tea <br>Fresh food <br>Very fast service <br><br>Cons:<br>None really. Good food and nice staff, food did not overwhelm me. But I do recommend for lunch. <br><br>Very good option.", "pics": null}}, {"review": {"des": "Great lunch place after taking in the Architectural Riverboat tour. Our group fined on fish tacos, filet mignon tacos and sushi. I shared an Asian chicken salad and turkey sandwich with the hubby. Two argue dining areas, two bars and patio seating provides plenty of tables and a short wait. Attentive and courteous service made for a pleasant dining experience.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/IWxW90HE55XxFPspochh-A/168s.jpg", "caption": "Asian chicken salad made w/ground chicken."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/AZi9ZytzsNDi6s_-6ViKSQ/168s.jpg", "caption": "Turkey sandwich and fries"}]}}, {"review": {"des": "Hubbard street in Chicago is filled with brunch places but Hub 51 really caught my eye with the ambience of the restaurant. This place is nice! <br><br>The mimosas are not bottomless during brunch but they are really good. <br>Highly recommend the breakfast nachos!! Perfectly crisp chips, soft well scrambled eggs, creamy seasoned cheese that melts in your mouth topped with a nice tasty salsa!", "pics": null}}, {"review": {"des": "I was craving a burger and wanted it fast. lol<br>So I walked in on a Saturday around 6 and the place was fairly packed already. It was a bit lout and very lively. They had a few seats open at the bar. So I headed there. I was greeted right away by the friendly bar tender.<br>Ordered the Cheeseburger and a glass of Malbec. Food came fairly quickly, burger was cooked right and although not the best I've had, it's actually pretty decent. Fries were crispy and lightly salted. Bartender checked on me and the other patrons periodically to see if we needed anything. <br>I was pretty stuffed and was disappointed that I didn't have anymore room to try their carrot cake which I hear is pretty darn good. But <br>So have to make another visit soon for the carrot cake.<br>But I would recommend this place for the  lively ambiance, good food and the great service.", "pics": null}}, {"review": {"des": "I really like this place. It's near my office so I've been here a few times, always for lunch. They have a rather eclectic menu with excellent tacos (filet mignon, chicken tinga, fish, veggie), sushi rolls and I like all of their salads.<br><br>Today I had the crushed pistachio Caesar salad, and it was amazing! It's a different take on a classic Caesar with arugula and romaine with migas, shaved Parmesan and a tasty yogurt dressing. I added grilled salmon and loved it! They have a few specials daily and every time I've come my colleagues have enjoyed their entrees as well. If I could make one criticism it's simply that the music can be kind of loud, making it hard for conversation. Yet it's a nice, lively place and from what I understand they have a nice vibe at night.", "pics": null}}, {"review": {"des": "This place surprised me. Looking at the menu, it felt like standard fare, but once the food hit the table, I was a happy camper. <br><br>We had a group dinner with about 30 people, so we selected Hub 51 because it has a private room and is easy walking distance from our office. When I arrived, the host told me to head to the back and take the stairs. As I was walking down the stairs, I felt like I was going into a speakeasy. The decor was really cool and while we were in a basement, the mirrors kept it from feeling closed in. <br><br>Since we had a large group, we preordered appetizers and salads, and each attendee selected from 3 entrees and 2 desserts. Appetizers were the chicken nachos, which are completely addictive and so good. We also had hummus, which paled in comparison with the nachos. <br><br>Salads were the kale and grains salad and an Asian chopped chicken salad. Both were terrific, but I preferred the kale. <br><br>I left it up to my server to pick my entree and dessert and she didn't disappoint me. She selected the braised short ribs with cauliflower and for dessert the chocolate s'mores pie. So good. The short rib was so rich I couldn't finish it. Excellent!  <br><br>I'd love to come try the regular menu sometime. Maybe I'll walk over the next time I'm in town. Definitely give this place a try if you haven't yet visited Hub 51.", "pics": null}}, {"review": {"des": "I had a gift card from a charity event to this location. I ended up going with my brother since it's close and I had the gift card for so long.<br><br>Service was great, even with my brother's unusual drink request for a razzmatazz in a Moscow mule mug- maybe make a menu staple? Seemed like a great idea! <br><br>The food here was good. I had a beach salad which was exactly what I thought it would be, bigger potions than I expected but that was perfect. We had the chips and guacamole which were good and got more chips for free. (Service was great!) The Steak Tacos were definitely stand out of the food. <br><br>Check it out if you are near by! Try the razzmatazz fo sho.", "pics": null}}, {"review": {"des": "Holy Heaven on this Earth Carrot Cake lovers!!! If you haven't been to Hub51 or you have but didn't leave room to splurge on dessert, I would urge you to live on the edge & put a fork into PERFECTION! <br><br>Yes the food is good and quite plentiful but this review is ode to the splurge!! It's definitely enough to share at the dinning table, but why would you? The cream cheese frosting is light and fluffy, not overly sweet, and has a dash of cinnamon.The cake itself is moist but holds a firm texture and could stand on its own as the best carrot cake I've ever met! Oh and say yes to taking home any leftovers... I confess, it paired perfectly with morning coffee:)", "pics": null}}, {"review": {"des": "We came here on a Sunday for Easter Brunch around 10AM. They were serving a variety of classic brunch dishes and desserts buffet style for $36 per person. Luckily it hadn't gotten crowded yet so the buffet lines weren't too long. Some of the food items I tried were:<br><br>Bagel and Lox: They have people behind the counter who can toast your bagel for you! The veggie cream cheese and smoked salmon combo was to die for. <br><br>Short Rib Eggs Benedict: The short ribs and runny eggs were good; the English muffin however was stiff and hard to chew.<br><br>Pancakes: A bit dry and dense, needed to be covered with a substantial amount of maple syrup to soften them up. <br><br>Sushi: Pretty average of an American restaurant<br><br>French Toast: These were served tableside, and were perfectly crunchy on the outside and soft on the inside. They were also incrusted with cinnamon sugar, which tasted amazing. <br><br>Bacon: Covered in a hardened layer of fat ): <br><br>Dessert: Carrot cake bites were amazing probably one of the best things Hub 51 makes. The caramel pudding was overly sweet and decadent. The Oreo rice crispy was average. The cookies however were generously filled with chocolate chips; just how we like them!<br><br>Pretty solid brunch buffet with good service. There was also a mimosa and Bloody Mary bar, which looked fun but did not partake since we had a 20 mile long run afterwards :)", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/zmT4bO_NA2DLaCmJ18KI1g/348s.jpg", "caption": "Our Mom's Special Buttermilk Pancakes with Carrot Cake bite"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/FIB4kqfiYMtn03KDhv9Szw/168s.jpg", "caption": "Short Ribs Benedict with Guac and Pico"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/u88elQM7b6YXtgZFw0O1gA/168s.jpg", "caption": "French Toast"}]}}, {"review": {"des": "Thanksgiving at Hub 51 was awesome!<br><br>There are no words for the buffet.  The food was amazing.  If I were to select my favorite dish, it would be impossible.  <br><br>I enjoyed the following:<br>Tillamook Mac and Cheese - excellent<br>Corn bread soufle (I do not recall the precise name, but it reminded me of polenta - similar texture - GREAT flavor)<br>Stuffing - totally awesome.<br>Mashed potatos<br>Beef - amazing with the au jous<br>Turkey and gravy - turkey was organic and cooked to perfection<br><br>I also enjoyed the kale and graines & brussel sprouts salad - both unique and very, very tasty.<br><br>For desert, I had butterscotch pudding and mixed berries and cream, the perfect ending to a perfect meal.<br><br>And the staff - very friendly and happy to be there on a holiday, to make our holiday awesome.  I was so impressed with the food and the staff.<br><br>Thank you for a great Thanksgiving Hub 51!", "pics": null}}, {"review": {"des": "Really enjoyed the food when I came here last week with my family for brunch.  We got several orders of the pulled chicken nachos which were delicious!  The portion sizes were large as well.  We also tried several of the other dishes as well and they were hit or miss.  At the end of our meal, we were given 3 complimentary desserts as we were celebrating 3 birthdays at the time.  Very thoughtful of the restaurant.  <br><br>Our server was also great and was very kind.  The only thing I would change is that the music was pretty loud and distracting at times, but otherwise things were great!", "pics": null}}, {"review": {"des": "4 years later, this remains a lunch favorite for me. The food is consistently good, service is always on point and the patio in the summer is a huge bonus!", "pics": null}}, {"review": {"des": "I love to eat out when i am visiting different cities and I was so glad i found this place.  I could smell the delicious food a block away.  Once i got thru the door, the atmosphere was very lively.  They had the best pop music from the 80's and today playing in the background.  The space had an industrial warehouse feel with plenty of space for guest with garage doors that open to allow a view of the street scene.<br><br>Now lets talk about food. During brunch i had some of the best tasting breakfast ever! First lets start with the cinnamon roll pancakes that came with cream cheese and maple syrup.  It was so heavenly delicious that i had to thank God for leading me to this place. Each bite made me my soul smile.  The chicken sausage and eggs complimented the pancakes perfectly.<br><br>I will give this place five stars because service, food and location was great and i look forward to<br>returning soon.", "pics": null}}, {"review": {"des": "Food was good but the restaurant was short staffed for a Sunday brunch. Kind of surprising for a Lettuce restaurant in Chicago on a Sunday. As a result, the service was sub par and the waiter was rarely around, causing us to ask for things several times. No issues with food. Everyone enjoyed what they ordered (breakfast tacos were great).", "pics": null}}, {"review": {"des": "The food here is very good.  We started with the pot roast ( I think that's what it was?) nachos, and they were HUGE, and very good.  They were more than enough for 4 people.  We also got the burrata and it was good. For dinner, my fiancee loved the short rib with cauliflower mac and cheese. Very unique and tasted great.  I had the pistachio cesar salad with shrimp and LOVED it.  I thought this was an interesting take on a Cesar salad so would definitely recommend.<br><br>Would come back- highlights were the nachos and cesar salad!", "pics": null}}, {"review": {"des": "Came into town for the Thanksgiving weekend and we were looking for a brunch spot downtown. Got in Saturday morning with no wait. Nice bar area with great TVs if you're trying to catch a game.<br><br>Food was exquisite. Our group had chicken nachos which were massive, amazing French toast and fluffy pancakes, and awesome bacon and apple sausage. Everything was great including the spicy bloody Mary's and hub punch.<br><br>We experienced amazing customer service with the manager personally coming to our table to have a chat with our group.<br><br>I'd definitely recommend this brunch spot if you're looking for great food and above all amazing customer service. You won't be disappointed.", "pics": null}}, {"review": {"des": "Absolutely never disappoints.  Hub is a great choice for any reason, with any group.  The food is truly delicious and the menu offers something for just about anyone and any taste from standout sushi, salads, burgers and heavier dishes like meatloaf.  Normally places thats do a little bit of everything don't do them really well - this is not the case with Hub.  From nailing classics to providing delicious twists on favorites, you'll always be wowed.  Atmosphere is trendy, but not off putting and the staff is always attentive and on their game.  Always a win, lunch, brunch or dinner!", "pics": null}}, {"review": {"des": "Hub 51 has a great selection of brunch dishes to choose from. We stumbled in on a Saturday afternoon because we couldn't get a table at our original choice, but still enjoyed the meal here. The service was prompt, friendly, and professional.<br><br>I got the day-breaker omelet with some coffee to wash it down. I was able to sub the toast with a side of fruit, which was great. The berries were refreshing with the omelet. Nice big portion and well cooked- a little lacking on the flavor but yummy overall. <br><br>The space here is big, and the atmosphere was great. Not a bad second choice at all for brunch!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/C7Y5L1tKLjuDoPjjd28cfg/348s.jpg", "caption": "Day breaker omelet and benedict"}]}}, {"review": {"des": "4 Stars because the chicken nachos and hub punch are both awesome. I can't say much else about the rest of the menu. Everything else is pretty basic.", "pics": null}}, {"review": {"des": "Hands down best nachos I've ever had! Every time I'm in Chicago, this is a must eat. Huge portion, could feed probably 4-5 people. The chicken is seasoned perfectly, great cheese, onions, guacamole, I could keep going. It's a must order when visiting the restaurant!", "pics": null}}, {"review": {"des": "A friend was able to reserve a table before we were all able to meet up, which was super convenient! Very busy once we all showed up, but not overly so. I ordered the brussel sprout salad and would recommend to somebody wanting something a little heartier than a regular salad! The riesling also paired great with it. <br><br>Driving and parking is a little crazy around here so I would recommend taking an uber/lyft!", "pics": null}}, {"review": {"des": "I love their brussel sprout salad.  I've been getting it for years!  It's not raw but blanched so it still has a crunch.  The almonds, manchego cheese, and medjool dates also adds well to the texture mix.  I'm not usually a mustard fan but their mustard vinaigrette is not too strongly mustardy.  The portion size has unfortunately shrunk over the years.<br><br>Their cornbread is a must order! It features pieces of corn and comes in a iron skillet with a bit of butter on top.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/mxNKQN_1r5LoEw18wwsCpw/348s.jpg", "caption": "Brussel sprout salad!"}]}}, {"review": {"des": "I made reservations for this place at 11:30 am but my friend was running late. I was able to change my time on open table to 12 pm. So I just waited for him to get to the place to be seated. The decor in the inside is really nice with great ambiance. When you walk in, there is the bar where you can seat and enjoy a drink or two. My friend and I ordered pulled chicken nachos for an appetizer which is very popular dish and it was really good. My friend had the turkey sandwich with fries and he enjoy it a lot. I had the tuna poke which was good except for the rice cracker because I had it before and it didn't taste like anything. I ordered more rice and the waitress didn't charge me for it which was nice of her. I must say the menu I saw online is differ from the menu I look at. When I go again next time I have to ask him about it. This place is right in the heart of river north right by other restaurant and shops.", "pics": null}}, {"review": {"des": "As a loyal LEYE member, I have always loved my visits to Hub51 but was really disappointed during my meal there last night. Came to Hub 51 to celebrate a friend's birthday. Had the Salty Dog (grapefruit, lava salt, vodka) which was great. As an appetizer we had the Three Green Things which was underwhelming- edamame, flavorless tempura green beans, shisito peppers. For dinner I had the rainbow row which was very disappointing for the $15 price tag for one roll of plain sushi. Finally I wanted to surprise my friend with a little birthday candle so I got up and asked my server if they did anything complimentary for birthdays. She said she'd take care of it and brought over a small carmel pudding dessert- and then charged me for it! Very tacky- if I was going to be charged I would have rather picked out a dessert. I noticed in another yelp review that this happened to someone else!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/j-E-wHZ2K6D34JkKTeAZag/168s.jpg", "caption": "Salty Dog"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/fzjOmJn5swbtqjsZN51LDA/168s.jpg", "caption": "Three Greens - tempura green beans, edamame, shisito peppers"}]}}, {"review": {"des": "Was told the wait was 45 minutes for 2 people...ended up waiting over an hour. People who came in after us got seated before us even though they had the same amount of people in there party. Very unorganized staff<br> <br>Ended up walking down the street to Portillos <br>Thanks for the outstanding service", "pics": null}}, {"review": {"des": "This place is sooooo basic! You won't hate it but you won't love it either. I got the hummus (this was one point!) and the shrimp and crap...I mean crab roll. The sushi was dry. Like eating seafood flavored cotton balls! (Not cute) <br><br>The feel of the place was cool. The food just kinda missed the marked for me.", "pics": null}}, {"review": {"des": "Wait was a bit long even though I had a reservation. Still delicious food, had the chicken tacos, had a couple Moscow mules as well and they were made well.", "pics": null}}, {"review": {"des": "Checking out some reviews, I saw that this place was pretty broad/cross function. People were calling out there nachos, burgers, sushi, flat breads, cake, tacos and freaking classic meatloaf. Do you have a picky audience? Go here. <br><br>Now a bad decision on my behalf was to order it all. I saw good reviews all around and was alone on business. \"F*** it\" I said. \"Let's expense it and order everything\". Wow what a food coma. I don't regret sticking with there dotted food items. That might have been the waitress' way of saying \"just pick something ass****\" but their dotted or chef chosen items froze not only in time but in my mouth. What flavor!!!<br><br>Don't tell my boss or accounting. So delish.", "pics": null}}, {"review": {"des": "I usually love this place--been here at least 10 times. Sadly my Uber Eats order yesterday was a complete debacle. It took over an hour and the food arrived cold and soggy. I contacted Hub and they told me to contact Uber who told me to contact Hub. So now I sit between a rock and a hard place over a $15 inedible burger which Hub nor Uber will take responsibility for--frustrating. With that said, don't order for delivery here, just dine-in.", "pics": null}}, {"review": {"des": "Hubby and I had a great dinner here Friday night. We booked a table about 2 hours before and managed to get a 7pm seating, which seems like we got lucky as when we left at 9pm the place was still packed and every table had been turned over and was full!<br><br>I wasn't sure what to make of this place, the vibe isn't the type we'd usually frequency (trendy / bar style) and the food is quite eclectic (sushi and burgers are both on menu...) but we had been lucky enough to win a gift voucher at a charity raffle so we decided to use this this weekend.<br><br>Boy, were we pleasantly surprised! our waitress was really friendly and great service and the food was excellent.<br><br>We had to get the nachos to start given they are \"famous\" for them and all the rave reviews. Luckily our waitress said we could do a half portion for 2 to share.... even that was HUGE. I have no idea how big the main one is, but if you wanted a cheap meal for sure 2 people would be very happy on the full size for only $16!<br><br>Then we both got an entree I splurged given we had a gift voucher and got the most expensive thing on the menu, the filet mingnon with onion rings... it was cooked perfectly and they were probably the best onion rings I've had! Hub got the spare rib with cauliflower mac and cheese, which was a real winner, he practically licked the plate clean!<br><br>We of course HAD to get the carrot cake, I had read about it and I LOVE carrot cake so I was very excited and it did not disappoint, it was delicious!<br><br>We rolled out of there very happy and content!", "pics": null}}, {"review": {"des": "The restaurant is very nice, good music, right volume. Excellent service, food is served fast and it is delicious. Guacamole and chips are bomb! They bring you a slice of cake when specials days  so sweet !", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/NOV53AabbegEyNPafTgm1A/348s.jpg", "caption": "Brussels Sprouts Salad (Dinner Menu) First - Rate Prime Cheeseburger"}]}}, {"review": {"des": "So much to like! Ahi Tuna Poke is wonderful, like a deconstructed sushi roll. The cornbread is perfect, tasty, moist, corny, not too sweet. Salads promise to be outstanding (report later) and we're saving room for the famous carrot cake. <br><br>Update: the salads were terrific, both the fabulous Brussels sprouts salad and the tasty kale and avocado.  The carrot cake - sounds wholesome - was decadent and delicious.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/IJiiDp1qfMWP2oNtPZNW5Q/168s.jpg", "caption": "Ahi Tuna Poke - tasty appetizer, very good."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/mijDdPVc80Lm4oHa3A5Ggw/168s.jpg", "caption": "Yum, cornbread!"}]}}, {"review": {"des": "I would best describe Hub 51 as being a great \"safe\" option for brunch, lunch, or dinner in the River North area.  Almost everyone can find something on the menu that they will like. Due to their location and popularity, this place gets super busy.  Booking a reservation online or by phone is something I would suggest in order to avoid long wait times.  I've been to Hub 51 about 5 or 6 times over the last few years, and I've generally had positive experiences with the food and service.<br><br>The burgers and sandwiches are good choices to get when you come here.  The pulled chicken nachos are also delicious, but some of the tacos aren't as exciting as they sound on the menu.  To drink, I typically stick with their Hub Punch (really good btw), or one of the wines from their menu.  Carrot cake lovers should make it a priority to try the carrot cake.  I can honestly say that the Hub 51 carrot cake is one of the best I've had from any restaurant in Chicago.", "pics": null}}, {"review": {"des": "If you are looking to do a nice dinner for a birthday or bachelorette party this is the place to go!<br><br>If you have a party over 11 people they encourage you to order the family style meal. You get 3 appetizers and 3 entrees for $36 per person. The pricing is similar to other places in the city for this type of meal. The coordinators were easy to work with and extremely helpful. <br><br>For dinner we had the cauliflower, pulled chicken nachos, sushi, chipotle chicken salad, pork tacos, and cheeseburger sliders. They give you so much food! You will not run out of anything and all your guests will be insanely full. I've done the family style meal twice now and we were never close to finishing our meals. The food was fantastic and the service was great!", "pics": null}}, {"review": {"des": "Stopped in for a quick glass of wine and some wonderful Ahi Tuna Poke and sushi. Place was pretty full so we grabbed a quick seat at the bar. Atmosphere is great. Staff is accommodating and very friendly. They are extremely knowledgeable regarding the menu.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ovGQntpIh_QvmV9QnDuOAg/348s.jpg", "caption": "Ahi Tuna Poke!......Excellent!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/928J_0tJCfGPkKQTgHZahQ/168s.jpg", "caption": "Cabernet"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/tmmY942vZMj6dCOhaFMYSg/168s.jpg", "caption": "Spicy Shrimp & King Crab!!"}]}}, {"review": {"des": "Last stop of my Happy Crawl before Christmas. We sat at the bar and was pretty much ignored while the two bartenders laughed and joked with a couple of their friends who were somewhat intoxicated and basically being obnoxious. After saying excuse me at least three times, we ordered a Sauvignon Blanc, a Rose' and side order of cauliflower Mac and Cheese.<br><br>The wine was pretty good but the cauliflower Mac and Cheese was just steamed cauliflower with cheese sauce poured on top of it! What a disappointment; it didn't resemble anything like Mac and Cheese. It wasn't baked, it wasn't rich, it didn't even have breadcrumbs or anything to convince me that I was substituting pasta for cauliflower! Sorry it was an epic fail and a waste of calories.", "pics": null}}, {"review": {"des": "Well, slowest service I've had in Chicago. Sat at the bar for nearly 20 minutes and the bar man never came. All while serving the others seated. Perhaps I look like an asshole. Who knows? I decided to ask for a table and was served almost immediately after being seated. Haven't had the food yet but when you're thirsty you're thirsty, and a near 20 minute wait isn't ideal. <br>Hopefully the food will make up for the bar service.", "pics": null}}, {"review": {"des": "Just left dinner and had to gush. I walked in for dinner at around 9 pm and was greeted and seated promptly even though I didn't have a reservation. The server was very attentive without being overbearing and made sure we were always taken care of. Rob, the manager, came by to introduce himself and make sure that we were having a great time. Overall great experience!", "pics": null}}, {"review": {"des": "Dined here during my lunch break earlier this week and ordered the 1/2 priced sushi. <br>We arrived at 4pm, were greeted by one server who took our order, then were served by a different person. We didn't mind so much at first until about half way through our meal when I noticed the other girl was still there finishing up her side work. She was still there working when we left........it was a bit weird.<br><br>The Tempura Sweet Potato was the most flavorful with the creamy combination of avocado and potato;  the Spicy Tuna had good Tuna, but the sesame seeds completely overwhelmed the roll; the Spicy Shrimp and King Crab was  messy as the roll easily fell apart and the crab and shrimp on top slipped off. <br><br>I'll try here again, but not for the sushi.<br><br>---<br>p.s.  There is a single red stiletto on a high beam above the booth where we sat- not sure where it came from or why it was there, but it's odd.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/kOgu_QqzdW0n6GtQuwSEOw/168s.jpg", "caption": "SweetPotato - Spicy Tuna - King Crab & Shrimp"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/mIUsp6ktmqeBExa45lekmQ/168s.jpg", "caption": "Our three rolls"}]}}, {"review": {"des": "The nachos... oh the nachos! <br><br>I recently was on a trip to Chicago and in between being a tourist walking the city and heading out to dinner we needed a drink and a snack so we popped into Hub. Great snacks, great drinks, and fun atmosphere! I would have liked to gone back to test out the actual \"real\" food menu but will save that for a future trip!", "pics": null}}, {"review": {"des": "Show up and tell them you're in charge of the plumbing.  Wear something a Plummer might wear.  <br><br>No one asks a Plummer for ID.", "pics": null}}, {"review": {"des": "I really enjoyed my time at Hub 51. My friend and I had a reservation for 4 pm, and we showed up at 3:30. They were able to take us right away which was great. I had the chicken tinga tacos and let me tell you, they were DELICIOUS! You assemble your own tacos and it comes with a side of rice and beans, as well as guac, pico de gallo, and salsa. My friend got the burger and fries. The burger was your typical burger but the fries were delicous! Were all gone within 5 minutes of getting our plates. Must try! Only downside to the restaurant, is that the bathrooms are in the basement but its not a huge concern for me. They are just tricky to find.", "pics": null}}, {"review": {"des": "Average food for $$$ the price. <br><br>TL;DR go for pulled nachos, brownie, carrot cake. Stay away from cheeseburger and Thai curry. <br><br>Ordered meatloaf, broiled salmon, Thai curry chicken (not pictured), cheeseburger (not pictured), pulled chicken nachos (not pictured), big brownie and carrot cake.<br><br>The nachos is a large portion best for sharing among 4. Chips at the bottom were soggy because everything is piled on top of each other. I don't mind it soggy just an FYI. The BEST dish among the ones we ordered. <br><br>Thai curry and meatloaf were a bit too salty. <br>Brownie was the best! Very dense and rich. <br>Carrot cake was good too! Not too sweet. <br>Cheese burger taste like McDonald's burger. too much pickle. <br>Salmon was decent. <br><br>Not worth the price for the taste and amount of food.", "pics": null}}, {"review": {"des": "Always consistent great waitstaff,  service and quality food. Great Bloody Mary. Their Brussel sprout salad is phenom! <br>I had been craving a hamachi roll that I custom order and the chef prepared it perfectly <br>Carrot cake made me weak, so so good.", "pics": null}}, {"review": {"des": "Had a great time! Sat at the bar area to grab drinks with a friend. She didn't like the \"award winning\" punch. So I decided to get a pitcher of margarita. Well, that was a mistake! It was too sweet so the bartender added more lime juice. Then it was too tart. So bartender gave me some extra agave to mix with my drink. It was a complete failure. I attempted to drink more, but I just couldn't. Asked her if she could just charge me 2 glasses of margaritas instead of entire pitcher and then switched out to glasses of wine. Even tho the cocktails weren't good, their service was good so I'll give 4 for now. Bar area was filled, but not crowded with people standing around. Was able to conversation with a friend rather than yell.  Downstairs is Sub 51 & was closed for private event and then opened up to public later on.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/BQeGF6WGlyyc47Z1GNYY5A/348s.jpg", "caption": "Nachos (sorry too dark)"}]}}, {"review": {"des": "The location and atmosphere is cute. We had the avocado toast and river north mimosa. The mimosa was delicious but I'll have to pass on the toast.<br>We were part of the brunch bites experience where we sampled food from different restaurants", "pics": null}}, {"review": {"des": "I'm giving Hub 51 three stars because the bang bang cauliflower was delicious and so was the carrot cake. Other than that, the food was just average. <br><br>The atmosphere...was nonexistent. There were a few tables full when we got there, but it quickly petered off. I came with a group of co-workers at around noon. After this, the occasion went downhill. <br><br>No-Nos<br>-- We were seated in the back. The service elevator was DIRECTLY behind our table. Two people had to keep getting up to let the busboys through with the huge prep trays. Annoying. <br>--My food (spicy shrimp and lobster sushi roll) was small and dry. The rice was sticky, but dry...weird. I'm no sushi connoisseur, but it just was not all that hot. <br>-- I mean, I didn't eat anybody else's food, but it didn't make me wanna climb over the table to get to it either. <br><br>Pluses<br>-- As I said before, the carrot cake was superb. It comes with two massive scoops, one of ice cream and one of whipped cream. I could eat the whipped cream in a bowl all by itself. All day. Every day. <br>-- Also, the bang bang cauliflower was sooooooo good. It was sweet with a kick and the right amount of sauce. DID NOT TASTE LIKE CAULIFLOWER. I've had bang bang shrimp so many times at one of my favorite restaurants out-of-state and they tasted better! <br><br>I may give them another try again someday, but it'll be awhile.", "pics": null}}, {"review": {"des": "Came to Hub 51 because I had a Lettuce giftcard and wanted to try something new. I feel similar to other reviewers in the sentiment that it is basic- didn't love it and didn't hate it. We came on a Friday night and it was busy, we were able to get a table right away in the dining area kind of near the bar. It was very very crowded, especially in the winter with everyone and their big coats- so not the most comfortable experience. Noise level was also very high- not great for a date. As far as that part of the experience I'd give it a 2. <br><br>Food- The burger and onion rings were really good. Burger was cooked perfect. Nachos I've heard and seen look fantastic although I did not try them. Wine and beer were good. <br><br>I just felt like for the price it wasn't really worth it. There are a million restaurants in the city and this one just lacks the oomph. Not much of an identity. Probably won't be back. <br><br>side note: they have a nice looking party room in the basement that I noticed on my way to the bathroom (which was very nice and clean and had an attendant). Might consider this for a small event location although parking would be a nightmare. <br><br>Overall: just okay.", "pics": null}}, {"review": {"des": "Came here to celebrate my birthday and it was an overall enjoyable experience. Their website describes their cuisine as \"Eclectic American\", but there really isn't much eclectic about it? The ambience is nice, but the food selection isn't impressive for a River North restaurant. Prices are reasonable.<br><br>I had the pulled chicken nachos as my entree. The portion was MASSIVE and is probably better shared among 3 or 4 people. Great marinade on the chicken and quality toppings. <br><br>The carrot cake left much to be desired, lacking in spices and overcompensating with frosting. I was so disappointed to find that the two scoops of white stuff plated with the cake was just more cream cheese frosting and not ice cream. Who needs that much extra frosting for an already frosted slice of cake!?<br><br>The Award Winning Hub Punch had a nice zing to it and was strong enough that I had to nurse it throughout the evening. <br><br>Worth a return visit for the space, drinks, and apps.", "pics": null}}, {"review": {"des": "Great atmosphere AND food. If you're looking for suggestions, I highly recommend the nachos as an appetizer. Feeds 5-7 people - maybe even more. Friendly and professional staff. I enjoyed my evening here.", "pics": null}}, {"review": {"des": "Ate here for Mother's Day, and we were not disappointed. They take reservations at this Lettuce Entertain You restaurant which is great. It is a nice modern bar atmosphere, but large and with high ceilings to feel open.<br><br>I had the greek lamb schwarma pita sandwich, and it was great. A ton of lamb meat on it with all of the fixings (tomato, cucumber, onion, and tzatziki). Comes with Greek fries which were also great topped with feta.<br><br>Had carrot cake for dessert which was also amazing and highly recommended.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/n8BWZARE5svsCRSSdBgLqQ/348s.jpg", "caption": "Greek Lamb Schwarma Pita sandwich with Greek fries"}]}}, {"review": {"des": "Really cool set up downtown. Maybe it was the fact that I was there on the 4th of July but the service was subpar and the food took way too long to be served. I ordered the fried chicken meal ($24) which was very overpriced and underwhelming. I left very disappointed with my meal. The chicken was dry and had no special flavoring. I'm not exaggerating when I say KFC chicken is way better. Definitely not a place that I will be visiting again and absolutely will not recommend to anyone.", "pics": null}}, {"review": {"des": "I really love the selection of food that they have here. You want sushi? Tacos? A sandwich? Well they've got it all! <br>With such a wide selection of food I enjoy coming here because even my friends who are the pickiest eaters will find something to eat. <br><br>Let's take a second to talk about their nachos. The portion size for their nachos is no joke! Two people can easily split this as a meal and be full. <br><br>Their Hub Punch is also super delicious. If you are with a friend or group the pitcher is the way to go if you are going to have more than one drink.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/oluVYG7fLr4yb5aB8qATgw/348s.jpg", "caption": "Their Famous Pulled Chicken Nachos"}]}}, {"review": {"des": "Very cool setting.  Very friendly staff.  Place was busy but the food was awesome.  The humus appetizer was perfect along with the tuna.  You will be happy with this place.", "pics": null}}, {"review": {"des": "Good place for a group. Food menu is limited and not many good options for vegetarians. We had several appetizers- Bang Bang cauliflower, nachos, burrata, and guacamole. All were good. I wasn't a fan of the salsa & the chips were a bit stale. I also got the Brussel Sprout salad with filet. The filet was delicious, wasn't a fan of the salad. My friends got the curry and they didn't really like it.  So many good options in Chicago, I probably wouldn't come back.", "pics": null}}, {"review": {"des": "Overall a pretty solid joint! I've been here twice and had a good experience. Their menu is broad and has a lot of different options. I've gotten sushi both times and it was pretty decent! <br><br>We really loved the nacho special. It was a huge plate and we had leftovers with a group of three. I'd definitely get it again!<br><br>A little on the pricey side, but that's what you'll get for downtown.", "pics": null}}, {"review": {"des": "First, I love when a restaurant I want to try is on OpenTable, and Hub 51 is. This used to be one of my fiancé's favorite haunts when he lived in Chicago, and he really wanted to share it with me. So, it was wonderful to quickly reserve a table for us to meet his local friends. <br><br>Second, the atmosphere was a good mix of small-town cozy restaurant and scaled-up bar. There is a mix of booths and cozy tables on one side and tall tables and bar seating on the other. Our waitress was also patient, friendly, and easy to work with as our party tried to decide how best to share orders and try new things. She even split one of the larger entrees into heaping portions on two separate plates to make sharing even easier.<br><br>Finally, the drink selection was good (good craft beer), the cocktails weren't too sweet or overpowered by liquor, and the food was as tasty as it was appealing. I recommend the Shaki-Shaki with its uniquely crunchy rice pats and the chicken tinga tacos, if you are particularly hungry.", "pics": null}}, {"review": {"des": "This place is good! The lightly fried cauliflower with the orange sauce is amazing!!! The rainbow sushi is amazing too! This place is really good!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/CZAnW6ibSy3d5GE8MySWYA/168s.jpg", "caption": "Nachos"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/CA91dV6PkxWoYqvYZdIVZg/168s.jpg", "caption": "Rainbow Sushi"}]}}, {"review": {"des": "Both times I have come here, I've been really underwhelmed by the food. It's really not flavorful.<br><br>Their two saving graces: pulled chicken nachos and sub 51", "pics": null}}, {"review": {"des": "Worst service ever!!<br><br>We went for a Fathers day brunch buffet and received the worst service to date. Once seated it took about 15 minutes before a server came over, she then walked away, and we waited longer.  then another server came over and gave us water and 2 tokens and explained that our server would be over shortly and we are to order kitchen food from her (gave a name).  We then waited and another server came over and said there is no set server and that they are sharing tables.  So we went and got some food (had to figure things out ourselves as no-one knew what was going on).  Back at the table and cannot start eating as no one gave us silverware, we had to get up find the nearest server and ask.  We then got a plate of french toast from the kitchen, no syrup given... <br><br>Once, we had finished (rushed as we was over it) we then waited another 20 minutes to get the bill and finish up.<br><br>Was very disappointed with this restaurant to say the least, luckily the food was good...", "pics": null}}, {"review": {"des": "Creative and stylish, with a few real gems on the menu! I love that they feature sushi, burrata, street tacos, and fried chicken on a one-page menu. Our favorites were the bang bang crispy cauliflower (!) and the burrata swimming in yummy pesto. The carrot cake at the end was a perfect decadent finish. The butternut squash tacos were surprisingly complex, but even more important: tasty! Great service, even though we did end up waiting a few minutes past our reservation.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/-4-INrldAoaGBASYTNwj7g/348s.jpg", "caption": "They treated us to this yummy, decadent dessert as first timers! The 2 boules are extra frosting and whipped cream, a dessert in themselves!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/vMJFC37pWAK8OXpfdkZWYA/168s.jpg", "caption": "Butternut squash tacos were surprisingly complex and very tasty. The roasted tomato salsa was great, but my fave sauce was just lime juice."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/jlyJvAQ3zbN4Dj-7GxGTRQ/168s.jpg", "caption": "Turkey meatloaf was pretty good, with some interest to the flavor mix."}]}}, {"review": {"des": "I was really pumped to try Hub51 on a girls trip to Chicago. The menu declares a lot of variety from sushi to tacos to vegetarian. To start we got the chicken nachos. Perfect for sharing between 6-7 people. Tons of yummy toppings and plenty of chicken. I didn't love my entree- the Brussels sprout salad with chicken added. Not much flavor overall.. but it was my bad choice that gets their rating a 4star. Other peeps in the group ordered tacos and were much happier with their decision!", "pics": null}}, {"review": {"des": "Hub 51 maintains a high level of excellent food, cleanliness, and superior servers. My family dines out a few times a month and Hub 51 is a must. <br><br>Our server was attentive and courteous. She anticipated our needs and had the patience of a saint. We had a few children with us that made last minute changes and she delivered without missing a beat. <br><br>Hub 51 is one of the few restaurants that not only uses cleaner but also disinfectant on each station once the patrons leave. Love that touch.", "pics": null}}, {"review": {"des": "The food here is exceedingly average - although, what else would you expect from a place that serves sushi and Mexican and everything in between? In fact, I disliked my sweet potato tacos so much that I didn't eat them. It's also expensive (comparable for the area) for the quality of food. The only redeeming qualities allowing me to give Hub 51 two stars rather than one are that, a) its diverse menu means it's an easy restaurant pick for a group, and b) the \"Basic B\" seasonal cocktail was good.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/tKpBXyAulNmgpRgEAESo2w/348s.jpg", "caption": "\"Basic B\" cocktail: pumpkin spice vodka"}]}}, {"review": {"des": "Stopped in here with some girlfriends before heading to an event. This place is huge. It has a really large bar when you walk in with several high tops and a more formal eating area. We opted to sit down and eat together. The waitress provided great service and quickly got our drinks. I am pretty particular about old fashions and theirs was pretty good. We started off with an 8 piece crunchy tuna roll. It was quite tasty. It is served with some sort of mayo type dipping sauce that was really great. We moved on to entrees. I ordered a burger medium rare with lettuce, tomato and ketchup. The waitress was really great as that wasn't exactly how I ordered it...it was more like I will take the burger, are the onions grilled? Oh they aren't? then minus the onions, oh and minus mustard...oh wait and minus pickles. She rolled right with it and was really kind to me despite what a pain I was. Food came out promptly and as ordered. The French fries are the real winners. I love a really thin and crunchy French fry that is perfectly salted...and that is what I got there. <br>The biggest pain here is the bathrooms as they are downstairs, we were really dressed up (for our event after) and had some mega heels on. Stairs are not our friends in these types of situations. The bathroom also has an attendant. I personally find them really annoying as I am very capable of putting my own soap on my hands and generally don't need hairspray, mints or other \"goods.\" I usually stash these in my purse. I then feel bad that I don't have a dollar handy to tip. Pro-tip: Take the elevator if your wearing heels...or just don't feel like going down stairs.", "pics": null}}, {"review": {"des": "Back for another great meal. It's not a big menu but everything they cook is great. We like to work the appetizers some nights. We started with the guacamole which is fresh and has corn on the bottom of the bowel. Great combination. The ahi tuna poke is one of the best I've had. Beautiful red tuna ! We shared the chicken tacos which they split for us. It had so much flavor I combined all the beans, rice, tomatoes, etc in the juice of the pulled chicken bowl. Last time we were here the salmon I had was far better than Shaw's. <br><br>I never get a bad meal here. First look of the menu looks like bar food with sandwiches and tacos. If you look closer there are some real food gems. <br>The guacamole and chips are a good start. We tried the shaki shaki tuna which was small tuna chunks on rice cakes. Delicious! We always like the 3 green bites with edamame, shishito peppers and tempura green beans. <br>The sushi rolls are good, I had the salmon special and it had a nice outside char with a wonderful moistness inside. The fish tacos are construct your own with mahi mahi. <br>We shared the big brownie with homemade vanilla ice cream.", "pics": null}}, {"review": {"des": "This place was subpar. The line to get into was over 30 mins long and the downstairs entry was a minimum of $500 which is outrageous. The drinks were not that amazing and the crowd did not have must diversity at all.", "pics": null}}, {"review": {"des": "I've been religiously getting the pulled chicken nachos and the brownie since 2013. BEST. NACHOS. EVER. <br><br>I've always recommended these to everybody I know and ALL of them said the same thing- best nachos they've ever had. Big enough for 2 or 3 people to share as a main course AND be super full afterwards, without even getting an appetizer.<br>The chips are not greasy and there are actually LAYERS of chicken, cheese and guac (Most places will serve you a bunch of chips with ingredients ONLY on top, so once you finish those, you are eating they chips).<br><br>The brownie is fantastic too, huge. You'll need 2 or 3 people again to take it down!<br><br>Their signature hub-punch is fantastic too.<br><br>Recently we tried out the filet mignon tacos, AMAZING, and you can have them with lettuce cups if you want.<br><br>Hands down one if my favorite places downtown.", "pics": null}}, {"review": {"des": "Good tacos with a cool twist on a regular burger! I enjoyed the meal overall but it wasn't anything new. My friend ordered a tuna sushi roll for $14 dollars and it sucked! This place is definitely not the place to go to for sushi, a $5 roll at a grocery store would have looked and tasted better!", "pics": null}}, {"review": {"des": "\"Meh\" really hits the nail on the head for Hub 51.  It's not so bad I wouldn't go back if others wanted to go there, but I certainly would not seek it out.  Especially not in the middle of River North where so many great places are just a hop skip and a jump away form Hub 51.<br><br>The only dish I've had here that was \"good\" was the Asian chicken salad.  Literally everything else I've ever had here either wasn't as described on the menu, not at the right temperature, or just not good.  The service is always subpar too.  Almost like the servers are also thinking \"meh\".  <br><br>I think the only redeeming quality for Hub 51 is that the menu is so diverse, if you're in a group and everyone wants a different type of food.  But don't expect the food to be good.", "pics": null}}, {"review": {"des": "I've had pretty much everything on their menu.From their fish of the day tacos to the Cesaer salad. The sol burger and fish are my favorite thing on the menu. You can never go wrong with anything on the menu. I also heard their ice cream was delicious", "pics": null}}, {"review": {"des": "Great for work lunches, drinks, or work dinners. excellent service (our server Mariah today was awesome), plenty of healthy options on the menu.<br>Favorite dishes: fish tacos, tuna burger, Tuna Thai basil sushi roll, Brussels Sprouts & Kale Grains salads, & carrot cake is delicious!", "pics": null}}, {"review": {"des": "Went here after hours, as we were staying in a close hotel for business. One bartender there, they were 15 minutes til closing but had atleast 15 people still in the bar area. The bartender was extremely rude. If you are stressed out and don't want more folks coming in, simply tell them you are closed. but making us wait with a credit card in our hand at your bar to be acknowledged and order a beer for over 5 minutes is just unacceptable. there were other places very close by we could've gone to instead, and wouldn't have minded. then we tried to get out the front door and they were locked- again no help from the staff,  we figured out how to make our way out the other side of the place using the \"exit\" signs.", "pics": null}}, {"review": {"des": "The menu is very extensive, and ranges from sushi to nachos. We were seated right on time for our reservation on a Friday night. There were a lot of people hanging out by the bar, not a whole lot of people eating dinner at 5:30 just yet. Water was immediately placed down, and our server made sure that our glasses were never more than half empty. For starters we got the hummus and pita, which was good. Nothing amazing to speak of, but the pita slices were hot, and the hummus had a slight kick to it. I ordered the veggie burger, which was so good! I don't think that I took a breath while scarfing it down! Fries were salty, but also good. My mom ordered the nachos, and WOW we were not expecting so much food! She couldn't finish it all and had leftovers for days. The salsa was unexpectedly very spicy but other than that they were good too. My dad ordered the asian chicken salad, and he said there really wasn't any flavor to it at all. The chicken was ground instead of grilled which was odd. We had a good time, and if I came back I would definitely get the veggie burger again!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/-Al3qkRuFpRvZsADnFHi8g/168s.jpg", "caption": "veggie burger"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/YeBnoEw-L9LfkdvQbe_A5w/168s.jpg", "caption": "nachos"}]}}, {"review": {"des": "Hands down, one of my favorite restaurants. It's got the perfect date night vibe. It's perfect for a birthday dinner with friends. It's great as a starter for a night out on the town. and oh. PERFECT dessert.<br><br>My picks:<br>Nachos: massive, but perfect for sharing. They have to be eaten quick, though, or they're sure to get soggy.<br>Filet mignon tacos: why? because Filet. Mignon. Tacos. and yes, you can choose your level. Rare, med, well, etc. What is there not to love. Ok, maybe the portion isn't the biggest, but damn.  Get yo fancy, but also get yo taco on.<br>Carrot cake: it's only the best carrot cake i've had in my life, EVER! a perfect semi-sweet, moist, dessert. I'd have to get it every time. If I'm in the area with a sweet tooth, i'll even go so far as to order it to go, drop my car on hazards, and run in to get this sweet fix. You really can't pass it up. <br>Hub punch: an award-winning favorite. Super delicious, and strong without affecting the taste. It's easy to get sauced off of this one. And honestly, just get the pitcher if you're with a group of friends.", "pics": null}}, {"review": {"des": "Good place to try especially with a larger group as it can accommodate a panoply of tastes. They have indoor and outdoor seating and it's a good happy hour location!", "pics": null}}, {"review": {"des": "Good food, good atmosphere and drinks. Just need some veggie options for dinner and not just carrots and cucumbers on the side. Would recommend it. The filet was really good.", "pics": null}}, {"review": {"des": "Bang Bang Cauliflower, Yes please.  <br>Spicy Shrimp and Lobster Sushi, ah huh.<br>Fish taco's well, if you insist....<br>Food was very impressive.<br>Service was, meh.  <br>Long story short, we'll be back!", "pics": null}}, {"review": {"des": "Came here to get away from the party scene while staying in the River North Area. Average experience overall. Drinks are decent. They had a club on the lower level called Sub 51 with $20 cover for guys- which is why we didn't go.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ZNoXT5wAnRi9mApYkZpG4Q/168s.jpg", "caption": "Cocktail list ft Margarita"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/i5KRIuxBNWv-8TiKKFf4EA/168s.jpg", "caption": "Menu: House Rules"}]}}, {"review": {"des": "We visited on a Saturday night around 8pm. The food was excellent but the service was poor. I could have overlooked the longer wait times but our waitress was rude.", "pics": null}}, {"review": {"des": "What made this meal the best was getting to share it with my cousins. We made a reservation an hour in advance and was seated immediately upon arrival! The atmosphere was really cool and hip--even on a Tuesday night! The most amazing part of our dinner were the chicken nachos layered with shredded chicken, guacamole, incredible cheese, jalapeños, salsa, and a great sauce. Definitely order this although be aware because they are FILLING. I ordered the kale + grain salad which was very delicious but a tad overpriced. Come for the nachos :)", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/_VtpXQMqbAU3vWL_J7bPEg/348s.jpg", "caption": "cauliflower was AMAZING but also $13"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/6xw1YIcEv-bzqiOP0UIbhQ/168s.jpg", "caption": "Salty dog :) with a cute icecube"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/PtbL8LR4LyZGntm8ka3okw/168s.jpg", "caption": "amazing carrot cake for dessert"}]}}, {"review": {"des": "Hub 51 is one of those places that does a little bit of everything cuisine wise - but they do it so well. I came here for brunch and all the dishes I ordered were not only tasty but huge in portion - this was great for sharing with my friend. They have fun brunch themed cocktails of corse including an adult chocolate milk which was a fun concept but could but a little strong if you're not used to alcohol. One dish I absolutely loved was the breakfast nachos, they're absolutely loaded and the perfect combination of breakfast and lunch all in one. I ended up taking them home as leftovers for later in the day because they were so huge! For dessert, the stand out dish to me was their carrot cake. BEST CARROT CAKE I've ever had...I'm not sure what made it so different and why it tasted incredible but as a fan of carrot cakes - this was the best one I've ever tasted. I honestly would recommend anyone to get this if they come to Hub51! I hope to come again soon to try their other menus!", "pics": null}}, {"review": {"des": "The service was incredible, our server was so sweet and on top of everything. That's #1 for me or I can't even begin to relax. The ahi sandwich was delicious (though we both agreed it would've been better seared instead of grilled), and all of our drinks were perfect. Great ambiance, overall really amazing experience.", "pics": null}}, {"review": {"des": "Do not eat breakfast at Hub 51.  Eggs and hashbrowns were literally so bad I did not eat my breakfast.  The english muffins served were stale.  Public house on a nearby corner serves a much better breakfast for less money.", "pics": null}}, {"review": {"des": "A friend recommended this place.  Service was excellent A young woman with an unusual name Rajash was polite and interesting.  We loved her.  It was Sushi Happy Hour.  What a deal on rainbow and hamachi/chili maki.  Loved it.  Music was oldies.  Loved the Brussel sprout salad with chicken.", "pics": null}}]}