{"name": "hugos-frog-bar-and-fish-house-chicago", "reviews": [{"review": {"des": "Let me just say this: you won't have a better date night or family meal anywhere else in the city. This place is as good as it gets.<br><br>The Quality of the meat and fish is top notch- I literally go here every time I stop in chicago (which is almost every month) because this is my favorite place. Be prepared to spend a little, because everything comes at a price obviously. Their cocktails are strong, their meat is tender, the fish is succulent. There really is no other place to go.<br><br>My favorite menu items:  <br>*Hugo's house salad (I have no idea why, but this hits the spot every time- I think its their ranch dressing..)<br>*Lobster bisque<br>*Frog Legs (I know what you are thinking- you'd never eat them, but trust me in saying they are so well prepared they are light, flavorful, and a perfect starter.)<br>*Escargot (melts in your mouth- just the right amount of garlic and sauce. steaming hot)<br>*Bay Scallops (giant scallops, seared perfectly)<br>*Chilean Sea Bass (this is the mother of all entrees- PREPARED TO PERFECTION. I get it every time now. Literally marinated in a sweet miso sauce, and seared perfectly. On a bed of peas -which I hate peas- but I love these...)<br><br>You probably will not be hungry for desert if you order dinner right :) We never spend under $150 for the two of us including tip and tax... but that is also because we get starters and nice entrees.<br><br>Go eat here, you will NOT be disappointed!", "pics": null}}, {"review": {"des": "To be honest I am pretty disappointed in this restaurant. I heard about the great seafood and steak from a coworker, and I was going to see a comedy show not far from here last Saturday night, so I figured it would be the perfect opportunity to check it out.<br><br>My boyfriend and I made a reservation far in advance for 7pm (it was also our anniversary which we made them aware of). We arrived at 6:55pm and promptly checked in. Our comedy show began at 8:45pm, so we were prepared to have a 1.5 hour meal and then head over to the club which was about 6 minutes away. First of all, the foyer where you check-in is very small, so if their is a large group of people waiting to be seated, it feels quite claustrophobic. This would've been fine had I only had to wait for the 5-10 minutes they promised, but we found ourselves still inquiring about our table at 7:30pm to which the hostess replied, 'they are setting it up right now!' (and then we still had to wait another 5 or so minutes). To top off the overly claustrophobic feeling, there is no coat check at all, so you just see all of these people awkwardly bumping into each other with their oversized winter coats, and everyone waiting just looked extremely uncomfortable. <br><br>While waiting, we were also disappointed as groups (including a group of 2) who arrived after us were being seated before us, even though it was well past our reservation time. My boyfriend thought it was possibly because it was our anniversary, and maybe they were preparing a special table or something, however when we were finally seated it was apparent that was not the case. The candle at our table was burnt out, and my boyfriend had to light it himself and we were at a tiny table shoved up against a wall. <br><br>We ordered the mussels as an appetizer and they were good, however extremely fishy tasting, and we like fish and order mussels at French and Spanish restaurants, but these just tasted almost like aquarium fishy. We also ordered steaks, brussel sprouts, and creamed spinach which were all great, but by the time our food arrived, we had to literally inhale our steaks in order to make it to our show in time. Even after being seated, it felt like our server must've had one too many tables or something, because it took a very long time to even place our order. I was also a little disappointed as they did not even acknowledge our anniversary, and when they called the day prior they made it apparent that they were aware of our anniversary. <br><br>I know Hugo's is known for their good quality food, and I do not doubt that, but I would not at all recommend this place on a Friday or Weekend night as it seems they are not equipt to handle the rush.", "pics": null}}, {"review": {"des": "The location of this place is awesome.  It is around so many other restaurants and bars.  There is also a lot of stores around as well.<br><br>Came in during $1 oyster hour.  The bar area is where we had to sit to take advantage of this deal.  The bar is a lot more chill where people can come in, have a drink, and hang out.  The dining area is very classy and upscale, perfect for a date.  <br><br>Ordered 2 dozen of oysters at the bar.  The bartender was cool and knows the different types of oysters they have.  They have 5 different types, 2 from the west coast and 3 from the east.  We tried all 5.  Hands down, the east coast oysters were way better.  <br><br>Pretty cool place.", "pics": null}}, {"review": {"des": "This place is amazing. The service and attention to detail is five star. The Miso Marinated Chilean Seabass is delicious. Also the Filet Medallions with King Crab is a home run.  Lobster Bisque is. Dry creamy. If you dining for two, order the calamari but do the 1/2 order, as it is plenty. Ordered the LemonDrop Martini that had a nice kick. One drink is plenty as it is very strong and packs a punch.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Mh2ayxcP7BLehjO2PYPA9Q/348s.jpg", "caption": "Filet Medallions with King Crab & Asparagus"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/wimwSyPv3OURh3jqFKsL2A/168s.jpg", "caption": "Lemon Drop Martini"}]}}, {"review": {"des": "I had dinner at Hugo's the other night - something I do pretty often. I wanted to give 5 stars but sadly it is only 4 because of the less than gracious management staff. <br><br>The hostess was very friendly and welcoming. Two Managers stood at the check in desk but neither acknowledged us. We were seated promptly and amazing service began. Bob said he had only been a server for 1 month and did a fantastic job from beginning to end.<br><br>One of the Managers I had seen at the desk earlier stopped by to ask about our food. As I was introducing myself he cut me off and started speaking to the man I was dining with. I spoke again thinking it was noisy and he did not hear me but the same thing happened. Hmmm... NOT a good customer interaction, especially from a Manager. Upper management might want to address this with their floor management staff.<br><br>The Chef and the Server Bob saved the evening by providing exceptionally prepared entrees and personable yet professional service.<br><br>I'm going to call it an off night and return again to one of my neighborhood spots. Hopefully the Managers will be a bit more customer focused. I will be watching to see...", "pics": null}}, {"review": {"des": "By now surely you have heard of Gibsons and Hugo's Frog bar the gibsons big sister right next door that shares the same kitchen.<br><br>But there is always a possibility that you have been living on a remote island with no access to the world wide web and your cable TV has been broken since 2002. <br>i have experienced awesomeness on the previous 25 visits and the one i had the other night truly that pales on many other scales as far as people who know what they are doing in the business or what you just want to eat.<br><br>i will give you 3 examples of the things i have ordered over time that blow the measuring stick over what you are supposed to keep measuring sticks at.<br><br>the chopped salad: it is awesome. sometimes there comes a time in life where you just cant or dont want to have steak. it can happen :)<br>It is huge. you wont be able to finish it. i usually tell them to take out the fish, no cheese and want them to have some extra cucumbers and instead of the fish put in avocados. This is the healthy option that i can recommend.<br><br>The hamburgher: this staple of Americana is very tasty when made here. I often liken it to basically a steak on a bun because the texture of the burgher is so tasty. I order it medium or medium well because I trust the kitchen staff to make it be very tasty so if you are one of those people who like their burgher well done I urge you to live a little and see what medium tastes likes. Plus the fries are just very tasty. you should not pass those up.<br><br>The skirt steak: This is just on another level. I had this the other night and it felt like this was one of the best skirt steaks you could ever have. It was seasoned with Garlic and other items. Although I got a side of katschup, you could ask for other things and get it. It was very juicy and tender and that is how it usually is. The staff seemed very knowledgeable and nice and understood how I liked the steak as you would suspect they might.<br><br>Just in case you have any room left have the cake or share it with the person or people you are with.", "pics": null}}, {"review": {"des": "Classy, fun, yet affordable. Service was excellent as was the food. Simply close to magnificent.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/5gH9uL9aCeN3w7O9yHgl3w/168s.jpg", "caption": "$1 Oysters (blend of Pacific and Atlantic) during Happy Hour!"}]}}, {"review": {"des": "Recently celebrated a birthday dinner at Hugo's. Neither of us had been before, but we've had dinner next door at Gibson's. <br><br>I booked the reservation and called the day before to confirm and request a table next to the windows. We arrived a few min before our 8pm reservation to check-in and waited a few min for our table. We were lead to a booth in the middle, not near a window, but still an okay seat. The restaurant was packed with a busy, vibrant atmosphere for Saturday night. The crowd is pretty mixed with lots of families and smaller groups.<br><br>Bread was brought to our table before we even ordered so I nibbled on what seemed to be a raisin-nut bread and a crusty white bread. For dinner, we ordered the escargot, halibut, stuffed flounder and sides of Brussel sprouts and mashed potatoes. Our server was great and assessed that half orders of the sides would be plenty filling for the two of us (he was correct). The escargot was so good and the butter sauce was nice and surprisingly spicy, which tasted great when sopped up with the side of bread that come with the dish (yay, more bread). We got a choice of soup or salad with the fish entrees. We both picked the clam chowder, which came with nice pieces of clam and was just so comforting. The stuffed flounder came stuffed with crab meat and sat in this rich butter sauce; it was good but the halibut was more my preference. Sides were good and the perfect amount for us. <br><br>Our server, Pete, was fantastic. He helped us pick out a white wine bottle and checked-in frequently throughout dinner service. Pete stopped by after we finished eating and told my bf to pick out a dessert since it was his birthday. We got the ice cream sundae but all of the desserts sounded amazing. I had an idea of how huge the cake slices were from yelp and Instagram pictures so we knew that'd be too much for us to eat.<br><br>Overall, Hugo's was good service and food in a non-pretentious atmosphere. Definitely, try it out for dinner!", "pics": null}}, {"review": {"des": "Frog Bar is easily one of the best places for seafood in all of the city in my humble opinion. Service is always top notch and they will cater to any dietary restrictions or preferences even if that means modifying a dish on the menu or catch of the day special. <br><br>Foodie tip: if you happen to love crab cakes as much as I do, these babies are insanely good and plentiful enough to call a meal (although it's considered an appetizer). Also their happy hour is worth its weight in gold if you enjoy $1 oysters... but they only offer it in the bar area so I would suggest you get there early & hungry:))<br><br>One cool thing is a fresh menu is printed daily so you won't have the same choices each time you go. I personally have never left without my palate fully satisfied and some leftovers for lunch the next day especially if you order up sides to share across the table like the massive shrimp tails or lobster Mac & Cheese which is so incredibly filling but worth the sinful splurge!<br><br>This time I tried the Miso Chilean Seabass which came in a buttery sauce with mushrooms and peas (as pictured) - it was one of those melt in your mouth where has this been all of my life moments!<br><br>Only thing I forgot to snap a picture of was the ahi tuna steak but I can assure you it was equally as delicious as every other picture looks:)", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/veiuIbqFc2JxmVlOkOq_jQ/348s.jpg", "caption": "I'll take them all for a $1 each!!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ciM2fG3vAePF4gHYwIaz6g/168s.jpg", "caption": "Lobster Mac & Cheese... not what you had as a kid. This dish is highly indulgent but necessary!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/24DTJKDSS6qZGWpXzBQpJQ/168s.jpg", "caption": "Lump Crab Cakes are legit!!"}]}}, {"review": {"des": "RJ had a dinner next door at Gibson's and the idea was I would wait at the bar. We walked in and the bar was completely packed, so we went next door to Hugo's, not realizing it was Gibson's sister bar. I sat at the bar and watched a Blackhawks game. I started with the best New England clam chowder I have ever had. It was thick and sweet, fresh and flavorful. I ordered filet medallions with asparagus and crab. RJ said it was better than what he had next door. It came with fresh bread. The filet literally melted in my mouth, and it was cooked perfectly. I didn't get the bartender's name, but he made me a fantastic pear martini with pear purée, and put the Blackhawks game back on for me when they turned it off. Hugo's ended up being a pleasant surprise!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/M-8ssZAht_yWuSfy3Hb6_w/348s.jpg", "caption": "The best pear purée martini ever!!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/x0pWIY-XjFbZqNIWtHEaBQ/168s.jpg", "caption": "Peach something"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/q7hN0DB1IyTg3XLcPNTqYQ/168s.jpg", "caption": "Filet medallions with crab and asparagus"}]}}, {"review": {"des": "I tried this place because they were able to accommodate large parties. I called other \"top-rated\" steakhouses in town & no one could accommodate 10 people, but Hugo's could and I'm so happy to have tried them.<br><br>The ambiance was nice, could be romantic but also could be super casual for a dinner with family or friends. The service was prompt and very accommodating. It's also awesome because the waiter brought out the fresh fish of the day to the table & we were able to see the sizes of the portions before ordering (this is always hit or miss with fish in my opinion).<br><br>For appetizers, we got frog legs. I am not a fan (trying them for first time), but those at the table who liked frog legs said they were the best they ever had.<br><br>We had salads (house & Caesar) amongst the table, as well as soups (gumbo & chowda) - everyone loved it. (Bonus points: one person didn't order either & the waiter brought a sample for him, so he felt included - very nice gesture)<br><br>All the entrees are as is, with a la carte sides. We shared the porterhouse steak, so we could try the filet & NY strip. It was melt in your mouth delish! I asked the waiter if they could cut it off the bone for us (creeps me out) and they did that for us before bringing it out to table - very accommodating. We got a side of mashed potatoes, they were alright, but the loaded baked potatoes looked to be where it was at. <br><br>Somehow - we saved room for dessert. I saw lots of Yelpers raving about the Key Lime Pie, so I tried that. Honestly, not the best I had ever had but definitely the biggest (I think that's what they're going for). Waiter said the portion was big enough for 4 people, I'd say enough for 8 easily. <br><br>The only complaint I heard from our table was how tight they had larger parties squeezed in backroom; however, we were all very happy to have gotten to dine together, since many steakhouses weren't accommodating. <br><br>Highly recommend!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/W6_bLsVSaUACcOnFWDVYHw/348s.jpg", "caption": "Sautéed Frog Legs"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/rvTaaDxRULTTOlKfcyGkfQ/168s.jpg", "caption": "Key Lime Pie"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/pu4JVV6t7LjzTbRDtOEsjA/168s.jpg", "caption": "Seafood Plate - brought to table before ordering"}]}}, {"review": {"des": "Daily 3-6PM happy hour with $1 Oysters and 1/2 Glasses of White Wine is really great (Bar seating only). We came at 3, got a prime seat for our group of 4 and ordered 4 dozen oysters right off the bat! <br><br>Our favorites were Sweet Jesus and Blue Point oysters. We also ordered the frog legs, which are a must get!! Super tender and the butter seasoned drizzle on them is sooo delicious. Save it and dip it with the warm bread. Lastly, we ordered the crab cake - it was jumbo, juicy and the Tartar sauce was great. <br><br>Will be back!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/AfT_OcmwS7UXTBrwgPoGuw/348s.jpg", "caption": "Crab Cake"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/gt1Bwm7bLrY_ecnPsIW59g/168s.jpg", "caption": "Frog Legs - So good!!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/4Wip1lffygTHWCJKw5IxAw/168s.jpg", "caption": "Daily HH $1 Oysters! Favorites are Sweet Jesus and Blue Point!"}]}}, {"review": {"des": "This restaurant is 5 star all the way around!!! <br><br>Service = Impeccable<br><br>Food = A+++<br><br>Overall Experience = Great. <br><br>The waiter raved about their frog legs so I said heck, let's do it!! I was scared to bite into it, but WOW!!! So succulent. My first frog legs experience was a positive one lol. My lunch date loved his steak. Said it was the best steak he's had in a very long time. The clam chowder was so damn tasty. I couldn't get enough!!! Speaking of not getting enough ... that raisin bread for the table is like crack!!! I ate so much of it AND took some to go lol. My favorite thing of the day ... the Chilean seabass. HO-LY SMOKES!!!! First of all, it's a nice healthy portion AND the miso isn't overwhelmingly strong. The fish is succulent and buttery, just the way I like it. I can't say enough good things about Hugo's. So glad I decided to try it for lunch!!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/oEw8cCN9-P1fRyXWT-JU4Q/348s.jpg", "caption": "BOMB Miso Chilean Seabass !!!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/xvCMTrPr2EcrJVAYwcjSTg/168s.jpg", "caption": "Steak!!!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/2S86ZyifH5IeeOWql9xG1A/168s.jpg", "caption": "Steak!!!"}]}}, {"review": {"des": "Update: I absolutely love their food but the last 3 times I've been here the service has been awful. One time the waiter was so rude and gave the impression that our money wasn't good enough. (We we're dressed appropriately so I don't know what his deal was...). The next time our server pretty much forgot about us. And the third time - it's like they overcompensated. Literally the moment we sat down the waiter asked us for our orders. Felt so rushed (even though the place wasn't crowded...). I love their food but the service has consistently been bad.<br><br>Previous review:<br>Went here last night with my family. Really delicious and top quality seafood. The sea bass was the best sea bass my husband has ever had. Both shrimp dishes are delicious. My mother had the king crab legs which were also great, although I'd say overpriced given the portion size. We took a cheesecake to go and it was excellent! <br><br>Service and ambience were good, even though it was PACKED. <br><br>I look forward to going again for a special occasion!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/v1QdBGq1HN2uLpOj4vPuGg/348s.jpg", "caption": "1.5 lbs crab legs"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/UIdZ9LAcYdhHKhlHbAOhEw/168s.jpg", "caption": "Shrimp dejonghe"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ADeiAGoy29GxgJc2G-VOLA/168s.jpg", "caption": "sea Bass"}]}}, {"review": {"des": "We came here to celebrate two birthdays, and what a celebration it was!  <br><br>I suggest that you come before dinner and enjoy a drink in the bar area.  Great Chicago atmosphere with televisions and local professionals all in good spirits.  I enjoyed a dirty martini while marveling at the pulley system used to operate the ceiling fans.   <br><br>Upon your arrival you will spot a giant lit up sign outside which will draw you in like a moth to light.  Once inside you will find it to be dimly lit, with a dark wood interior - we came when it was cold, so I was happy to see that they had a coat check.<br> <br>Classy place with white tablecloths and wonderful service, old school style, including assistants in the restrooms.  I would highly recommend this place for a date night.  The dress attire ranges from formal/well-dressed professionals to casual tourists.<br><br>Most of the appetizers are fish or shellfish derived and they are all delicious.  I love the crab cakes and also enjoyed the calamari, I regret not getting oysters which looked delicious, next time I guess!  We did all try the frog legs, and they were really good, taste like super tender chicken - JUST DO IT!<br><br>For my entrée, I had the rib eye Chicago cut which was maybe one of the best steaks I've had, it sounds cliché, but it melted in my mouth.  Fantastic!!!<br><br>For dessert the birthday crew had a piece of cake which was the size of a football.  One piece circled our table a few times and we still cold not finish it.  <br><br>This was a special night which was enjoyed by all!  I will caution that the bill is not for the faint of heart, granted we had a few bottles of wine, and a variety of cocktails, just make sure you enjoy yourself because you will pay for it.  LOL.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/XecN8EfvabiHSe9La6AUHg/348s.jpg", "caption": "The birthday boys - note the GIANT piece of birthday cake!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/uGxhc2A7D98MFNqDDnTKvg/168s.jpg", "caption": "The bar area is fun - note the HAND STUFFED blue cheese olives swimming in my dirty martini. #DELICIOUS"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/gp7vWPcJoQ_yTvck92UM6Q/168s.jpg", "caption": "Bar area has a fun atmosphere and cool fans, note the pulley system."}]}}, {"review": {"des": "Huge, fun, pleasant place, didn't feel at all crammed in. <br><br>Half shell oysters were nicely cleaned, attractively presented and very fresh. Crab cake appetizer was perfect; about the best crab cake I've ever come across.<br><br>Bookbinders soup was delicious. Not a lot of big chunks of fish, but thick and rich with great flavor. <br><br>Miso crusted sea bass had a perfect bed of peas and mushrooms, and the miso made a gentle pleasant crust. <br><br>Shared the mashed potatoes as a side and it was silly huge. The two of us made only a tiny dent in one small corner. <br><br>Wife impressed enough to put this on her birthday shortlist.", "pics": null}}, {"review": {"des": "This place has a great oyster happy hour from 3PM-6PM Monday through Friday. <br><br>The oysters are top notch and are served with ginger/cocktail sauce and mignonette sauce.  For just $1 per oyster, you are sure to get your oyster fix! The happy hour consists of half off their wine selections as well.<br><br>After the oysters we were pretty stuffed and ordered the white fish and crab mac and cheese. Our server split our meal into two and let us pick two apps instead of one since we couldn't decide. I got the lobster bisque and it was quite delicious.<br><br>The fish tasted very fresh and was accompanied with a side of mashed potatoes, grilled tomatoes and onions. <br><br>The best part was when our brought out a vanilla ice cream in honor of my birthday last month. My friend hadn't mentioned anything to him so I think he saw my ID and was sweet enough to bring it out for me!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/rqXVV_rqNZmld8Zj0LStkQ/168s.jpg", "caption": "Pan Roasted White Fish"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/tGaYUwBQ2f6ZA3NOTtM_NA/168s.jpg", "caption": "Mac and King Crab Mac & Cheese"}]}}, {"review": {"des": "I have walked past this restaurant so many times and thought I need to try this the next time. Well we finally did and it was great in all aspects. The appetizers were great as well as the meals. Our table had the Frog legs, escargot and crab cakes. The frog legs are a \"must try\" here although the crab cakes were of the best I have tried as well. The entree's were equally as great. See pics. The service is what you would expect at a restaurant of this price range. The only negative thing I would say about the experience is that they pack you in pretty tight. I would definitely return or recommend Hugo's to anyone.....I almost forgot to mention the deserts. They are huge so be careful how many you order as 10 of us couldn't finish 2 key lime pies.", "pics": null}}, {"review": {"des": "When it comes to service, this place never disappoints.<br><br>There were 8 of us and the restaurant was packed. I absolutely love the energy of a packed restaurant.  Everyone laughing and having a good time.<br><br>From Steaks to Seafood, everyone enjoyed their delicious meals.  I ended up having the Sea Bass which came with a miso glaze and peas.  Simple and delicious.<br><br>Service is always outstanding.  I love it when servers take their job seriously and are always giving their customers the best service.   Because we end up having a good time and a great experience and it's all because of the servers.  <br><br>Bravo to all the servers and the kitchen staff at Hugo's.  Each and everyone of you made our experience very special.", "pics": null}}, {"review": {"des": "Popped in for some $1 oysters during happy hour as we saw the sign indicating it started at 3PM and we had finished our Rush/Oak St. shopping.<br><br>Grabbed a bunch of seats at the bar and put in an order for a couple dozen and some clam chowder. The oyster selection was a good mix of east and west coast so we picked the briniest options from each. The shucking left something to be desired as there were bits of shell in some and others had half an oyster with no liquid. They were served with a decent mignonette and some bottled horseradish and ketchup. <br><br>The beer list was pretty good and we opted for local brews as they had plenty of Goose Island beers to choose from.<br><br>Service at the bar was very good and our bartender was engaging and funny.", "pics": null}}, {"review": {"des": "I came here for a work dinner so this review is mostly on service and food. The other times I have come here before I only ordered a drink and tried their enormous dessert pies at the bar area. The service and staff runs like any nice steakhouse - knowledgeable, accommodating and on point. Their menu also offers Gibson's steaks and I believe they share a kitchen. if Gibson's next door is packed, just come next door and order of the Gibson's menu. We ordered many sides and the stand outs wear the brussel sprouts, creamed spinach, broccolini. Their clam chowder was pretty good - quite indulgent as it had bacon it it. OMG - they have the best melt in your mouth Chilean sea bass. I don't like peas so the staff was kind enough to not include it. The accompanying Asian mushroom in a light wine sauce was delectable! I will still reminisce about this weeks later.", "pics": null}}, {"review": {"des": "The front desk here was a bit surly, so not a good start. I had a party of 4 and she asked if all of us were here (only 3) so far. I mean what's the F is the difference with 3 or 4 as it takes up the same effing 4 top table?! So I said we're all here all 3 and the hostess nearly had a hissy; well she did give me the side eye. Anyway lighten up! But bad training indeed. <br><br>Food wise we started with oysters and shrimp cocktail. Shrimp cocktail was the bomb! Oysters were meh. <br><br>I got the Chilean sea bass in a soy miso sauce and it was superb! Flavorful, delicate, and luscious. Can I say more?<br><br>Others at my table got steaks and man were they what we expected and why wouldn't we, it's the same steaks from Gibson's! <br><br>Overall this is a must go to place. Yeah it has lotsa tourists but who ever said tourists don't have taste? <br><br>Go!", "pics": null}}, {"review": {"des": "Gentle flavors!  <br><br>A busy place with gentle flavors!  Bordering on too gentle?<br><br>Definitely should make reservations. The people are jammed in there!  Staff is friendly!  Nice variety of offerings. Same steak offerings as Gibson's Steak House. Here you can have a variety of sea food and frog legs. <br><br>We did not have the frog legs. Tempted, but I can never resist escargot. The escargot was unlike I have ever had before. Tender and very delicate. Served in a traditional sectional \"tray\". Light butter and spice flavor. The spice was evident. Garlic was not evident. They were not greasy. Again a mild flavor that highlighted the escargot. <br><br>Had the crap bisque soup. Again a very mild flavor with a dollop of fresh crap on top!  Split their 22 oz bone in rib eye. A fantastic charred crust and perfectly medium rare. Again lightly spiced. The char was perfect. The meat was the the highlight!  Had the double baked potato. Nothing special here. But huge!  The skin was very good.  <br><br>Manager was very gregarious!  The place was very clean. <br><br>I could go for that rib eye right now. I need to go again before I leave town. Yum.", "pics": null}}, {"review": {"des": "We were used to coming once a month to this place. After our two last visits we won't go there anymore.<br>Food went downhill my Salmon was super dry. We were also overcharged for white wine during happy hours. <br>I would recommend go somewhere else. There are so many good restaurants in the area.", "pics": null}}, {"review": {"des": "Beautiful architecture and lots of great history. My wife and I enjoy coming in here from time to time to grab a cup of coffee and sit by the water fountain in the back and just admire the beauty in the architecture and interior design. <br><br>We also e joy the Michael Jordan's Steak House and their bar. So close to our building it's just a few blocks away.", "pics": null}}, {"review": {"des": "I would highly recommend this restaurant. The service, the atmosphere,  the food, and in general the entire experience is top notch. Our waiter Ron was so personable, just all around very friendly. He was very busy, but he gave us the right amount of attention and provided with excellent service. We started with frog legs as the appetizer. This was the first time I have had frog legs, they were so tender and the meet just falls off the bone. My sister and I shared Halibut and the grilled asparagus. My mom enjoyed the shrimp. We ended the meal with an amazing Mousse cake that could easily feed 8-10 people. I hope you have an opportunity to enjoy this amazing restaurant.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/2FXVWgV5WXTUvWx7-WYVCQ/168s.jpg", "caption": "Frog legs"}]}}, {"review": {"des": "I absolutely love everything about this place from the white linen tablecloths, impeccable service, ah-mazing food,  perfect drinks.  <br><br>I highly recommend the steak sliders with shoestring fries and Moscow Mule.  I am not one to drink hard alcohol (more of a wine drinker) but you really can't beat the PERFECT way they consistently make them with the crushed ice and served in copper mug.", "pics": null}}, {"review": {"des": "I hadn't been here in quite a while. Decided to treat my son Nick to a nice dinner. First thing he noticed was the service. We hadn't even ordered our food yet and the service was outstanding. We started with calamari. It was fried correctly, crispy coating, and tender squid with lots of lemon slices and yummy marinara. I ordered the medallions. They were so good, cooked medium just the way I like them, and seasoned. So many times when I eat it, the food is bland. Not here, you don't need to add any seasonings. I had a great time here and look forward to coming back.", "pics": null}}, {"review": {"des": "Clam chowder is awesome, and so is everything else on the menu. Sat at the bar and the bartenders are very good, and very busy. They still took the time to talk to all the customers even though they were swamped. Fun place, noisy and full of energy for a restaurant. Would love to get back there again soon.", "pics": null}}, {"review": {"des": "We came here for the Sunday Happy Hour. We were not disappointed. The $1 Happy Hour oysters were amazing. They had a good selection of east coast and west coast oysters. The oysters were clean and not gritty. They also have a great menu of appetizers and food. We left full and satisfied. Our server was great as well. The sides are also amazing. The crab macaroni was delicious and so was the Brussel sprouts. They also have amazing soups!", "pics": null}}, {"review": {"des": "Came here after the Opera, for a late night dinner, and this place is still fantastic. Everything from parking the car to the receptionist to getting the table was perfect, and no wait. Our waiter was fantastic, gave a small story about everything, and even brought out little taste samples, he made the entire meal entertaining and perfect. The fish was perfect, the crab cakes excellent, and the dessert was , well I better say it, it ruined my diet. He picked out great wines with each course, truly a great evening. This will be my go -to place for now on when downtown, the newer places can wait,, this place shows you why they are still in this city 20 years later.", "pics": null}}, {"review": {"des": "My friends and I came here for happy hour 4-6. They had half off white wines and vespers. We also ordered tons of oysters. They weren't the best I had ever had but I have no complaints either. Three to four rounds later our checks were only $30 pp! The waitress was very nice too.", "pics": null}}, {"review": {"des": "Awesome place - tuna ribbons starter a must - cocktails fantastic, the steaks we had were well cooked, but they have that blackened open flame out crust that is not too my liking, stick with the great seafood. Service was great, tables and ambiance perfect.", "pics": null}}, {"review": {"des": "Came for a work event during the NRA, place was mobbed. They supposedly have high rated steaks with Gibson's next door.<br><br>The 10 of us started with a few dozen oysters, calamari, fried shrimp, which were good. Average. The frog legs were really good, sautéed in butter, couldn't even tell they were frog.<br><br>A few of us got the $114 surf and turf, lobster tail and 10 filet of beef. It came as i expected for a place that busy, tough and tasteless lobster and just a grilled filet, no salt/pepper or pan sauce. Just meat on a plate. After the first bite I was reaching for salt and pepper and any condiment available.<br><br>The service was very good, 5 stars to the staff.<br><br>I wouldn't return outside of a work trip, couldn't bring myself to pay for subpar food with exorbitant prices with my own money", "pics": null}}, {"review": {"des": "The atmosphere is energetic and relaxed. The staff is also incredibly friendly. Kieth  the bar tender was not only super friendly and charming but makes a fantastic sidecar. Additionally our waiter Costa was fabulous. Our 4th person was running about 45 minutes late so they wouldn't seat us till she arrived even though we'd of had the same size table since 3 of us were already there.  So when we got seated I was a little annoyed. Well Costa turned my mood right around. Such a fun positive happy vibe along with a reasonable explanation and assurance that the night was about to get fun lol. I was smiling quickly.  The food was awesome. The tuna ribbon appetizer was fantastic. And the sea bass that other yelpers recommended did not disappoint. We had a great time can't wait to go back.", "pics": null}}, {"review": {"des": "PROS:<br>- Fresh seafood<br>- Best whole lobster in the city. Better than Shaw's lobster <br>- Love the king crab bisque<br>- Calamari is very good. 2nd favorite after Carmine's calamari<br><br>CONS:<br>- Had awful bday experience with new waiter<br>- Their prices significantly went up in the last year. The whole lobster used to be around 33-35. Now, it's close to 50<br>- Really dislike their last menu change. King crab bisque is off the general menu. It's only on Fri now. I used to come here all the time for this<br><br>---<br>1-star bc bday service was awful. Otherwise, 5 stars. <br><br>Came here for my birthday, and this year, Hugo's charged us for the birthday dessert and didn't do the Hugo's happy birthday chant. Meanwhile, many other people had birthdays and got the birthday chant and cake. <br><br>Very disappointed.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/2DJ3i54cYnNPagTQzMOO_A/348s.jpg", "caption": "Whole Maine Lobster"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/MjfM52KbAwYHAnxtQt1Aqg/168s.jpg", "caption": "Whole Maine Lobster"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/7Rn4ctUHbPdfIUMMrk3SPw/168s.jpg", "caption": "Whole Maine Lobster. a favorite. get it all the time"}]}}, {"review": {"des": "Awesome place!!! Reasonable prices!! Fish is fresh! <br>Bartenders are awesome!!! I love the decor! Ask for John <br>Maybe the best bartender in Chicago he is awesome!!!", "pics": null}}, {"review": {"des": "This was my sons 29 birthday dinner and we did not disappoint. While trying to reserve for Gibsons the host also mentioned Hugo's shared Gibsons kitchen and served Gibson steaks. So we decided for Hugo's. The Alaskan king crab was to die for. The butter made it so much better. I had the W.R Chicago cut and was made to perfection! The mac n cheese was deliciously cheesy, the mushrooms were just as good but the key lime pie!?? OMG! The best key lime pie I have ever tasted. I usually dont order key lime bc it is way too sweet but this was a perfect dessert. The meringue was a mile high, the crust was buttery, nutty and tasty, and the key lime filling was so delis!! Be prepared to drop some $$$ here if you are a visitor but well worth it!!", "pics": null}}, {"review": {"des": "It was meh. I heard a lot about this place, but it didn't keep up to its repute. I dined alone and got a handful of apps - escargots, frog legs, crab cakes. Plus an old fashioned. <br>Server was not rude but lacked warmth albeit it was extremely busy on a Tuesday evening. He explained the menu well but when asked for suggestions kind of shied away. <br>The house bread was mediocre at best. The renowned frog legs were sort of okay. Crab cakes tasted exactly like the one you'd get elsewhere. And I hated the escargots. Thankfully I didn't get any of the main courses. <br>In the end, I was given the check without anyone asking about dessert. <br><br>Bottom line - ambiance good, food quality - medium high, service okay, price - overpriced, and value - low", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/yrMzIqdiNUbYXR5DdPAKVA/168s.jpg", "caption": "Seafood portion"}]}}, {"review": {"des": "We found Hugo's by chance and we absolutely loved it! They have a great happy hour! We liked it so much we came back a few nights later with the rest of the family. The service, drinks and food were all excellent. The next time we are in Chicago we will be back for more. <br>I recommend the oysters, the New York Sirloin and the clam chowder", "pics": null}}, {"review": {"des": "Best crabcake and best dessert!!<br>We visited with friends. The place was busy but with reservations we got sat immediately. Our server immediately took our drink orders and brought us a bread basket with a nice selection of warm breads. The appetizers and salads were delivered very quickly to the table  The blue cheese dressing was yummy and the food portions were generous. We tried scallops crabcakes and salmon<br><br>Best of all was their dessert. Layered chocolate cake with vanilla ice cream chocolate chips macadamia nuts marshmallow and chocolate sauce - enough for 4 servings!!<br><br>We loved it and will be back!", "pics": null}}, {"review": {"des": "Came here a second time, and it honestly pretty average. For a place that focuses on its seafood (although it shares a kitchen with next-door Gibson's), the seafood was only okay. <br><br>The place is crowded, popular and bustling. Perhaps to a fault. The lobby is small and often crammed with bodies, and the bar is always so crowded we've never even attempted to get a drink on our visits. <br><br>The service is outstanding. From the hosts to the servers, the place has professional, informed and engaged employees. <br><br>I just wish the food was as good.  On our two visits, the salads and steaks were standouts, but the seafood was really mediocre.  My wife was disappointed with her salmon (as she was with the swordfish special on our last visit) and our friends opted not to finish their tuna steak. The deserts are famous for being large, and they are quite good.<br><br>This is a seafood restaurant that gets almost everything right except the seafood. Everything else is very good, including the steak. Problem is, if you want great steak, there are plenty of options in the River North and Near North neighborhoods.", "pics": null}}, {"review": {"des": "The old fashion's here are \"the bomb\".  Came in for dinner with friends while visiting Chicago.  Art was our waiter- very knowledgeable, attentive and spot on with the service.  He kept us from getting in trouble with our ordering.  The garbage chopped salad was huge and 4 of us shared it for an appetizer.  I had the walleye pike which was absolutely delicious and heartily recommended by Art.  The lobster tails were perfectly cooked.  Even though it is a fish house, they had the Gibson's steaks available and my husband had the Chicago cut.  It was really tasty.  Could compete with other food steakhouse fare.  Overall a great experience and will definitely come back when in the city again.  Word of warning...desserts are huge and I do mean it. Definitely a shareable serving.", "pics": null}}, {"review": {"des": "At the prices charged the standards of management and staff are lacking.  A forgotten appetizer manager lounging at front desk reading his phone not greeting and thanking guests, chef in the back on view eating wait staff with collars and ties undone.  Bearnaise sauce served cold mushrooms not sautéed correctly $7.00 baked potato served with just soured cream. Halibut over salted on one end nice crust but a good 10 degrees over cooked.  All at a price of $330.00 wish all the staff were as attentive as the Oyster shucker and bar tender, busser did a excellent job. Great decor, wine and cocktail list at this price point all should be excellent each and ever time.", "pics": null}}, {"review": {"des": "What a fun place! I recommend coming for happy hour- 1 dollar oysters & 1/2 off white wine! Had to try the frog legs and escargot. The frog legs were delicious... I would order these again if I were in the area. Service is friendly & the mood lively.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/-cnXtUJUyWEzFvoG4xrdtQ/348s.jpg", "caption": "Happy hour oysters"}]}}, {"review": {"des": "Great atmosphere. Giant lit up sign outside, dimly lit, dark wood inside. White tablecloths. Wonderful service, old school style, including assistants in the restrooms. We lucked out, walking in on a Friday night, and being able to secure one of the last few tables available for the three of us. We were dressed very casually, and were slightly embarrassed by the fact we didn't appear to fit in with the well dressed crowd. However,  we were made to feel like royalty nonetheless and  experienced excellent service. <br><br>Most of the appetizers are fish or shellfish -derived( and my son is allergic), so our waiter secured us a  plate of beef carpaccio from Gibsons next-door. The whitefish with mashed potatoes was Both beautifully presented and delicious. My two other companions loved their burgers and fries.<br><br>It was a great surprise. We just stumbled into this place and it turned out to be a place and I will go back to many times. I definitely need to try the frog legs !!!", "pics": null}}, {"review": {"des": "I've been to this restaurant probably 20 times or more.  Service us always top notch.  Sometimes it's a bit crowded, but, I've never had a problem getting a table.  I usually sit at a table on the bar side.  <br><br>The food is all great, although it is pricey.  I've tried most things on their menu; from their lower priced appetizers to their most expensive steaks.  If you want to not break the bank, but get awesome food, I'd suggest the frog legs, crab cake appetizer, and oysters.  All so good!<br><br>Never had a bad experience here so 5 stars it is!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/EhMbfWjaCH-rtiiSiEa5ww/348s.jpg", "caption": "Crab cake appetizer.  I cut it in half to show the inside.  Lots of crab meat here!"}]}}, {"review": {"des": "What can I say. Eaten at literally thousands of restaurants in my life prior to retirement. Eaten at the top in this country and a few others. <br><br>Best food, best atmosphere, and the ultimate waiter- Ron. <br><br>This is a MUST if you want the top in all categories.", "pics": null}}, {"review": {"des": "Now a Chicago institution like its sister restaurant the world famous Gibson's. The bar is classic Chicago, very comfortable with generous pours. The dining room was pretty crammed the night I was there but our server was top notch and delivered impeccable service. I had the 7 ounce filet mignon - butter tender and delicious! I also had a side of creamy mashed potatoes and their spicy charred broccolini grilled and seasoned to perfection - it was simply unbelievable tasting. The only disappointment of the night were the desserts we all shared. Although the desserts are ginormous I found that they lacked many distinguishing flavor profiles, especially the banana pie which was bland and tasteless. However, in the end I highly recommend this establishment on your next Downtown visit!", "pics": null}}, {"review": {"des": "Delicious dinner to celebrate a visit from my mom & sister, a first for the three of us! Had the WR Chicago Cut, the 8oz Filet and the melt-in-your-mouth Chilean Sea Bass - it was fantastic as always, paired with a bottle of Meomi Pinot Noir, one of my faves. We finished dinner with the Creme Brûlée, which was also delicious! Service was top-notch, thanks to Ron, Adam & the rest of the staff there. One of my favorite places for sure. Thanks Hugo's!!", "pics": null}}, {"review": {"des": "Hugo's is one of my favorites for a night out on the town, Probably best for dates, but I'd meet friends there after work or even just come in alone for a martini at the bar. To be honest, I'm not certain what makes Hugo's a favorite. Customer service appears to be a priority, but I'm not certain that filters down to the wait staff and bus boys. They do make sure that a manager comes and checks on you though.<br><br>My favorite foods from Hugo's are oysters and the King Crab Bites. I have not ventured into the steaks or chops. I try to be there for the $1 oyster happy hour whenever possible. I think that's what keeps me coming back. Also, the Gold Coast location can't be beat if you have enough money in your pocket and self respect to lose along rush street.<br><br>Once, during a phenomenal date, we were lucky enough to have the power go out during our oyster meal. The staff was ready with candles and lit the place quite romantically, for what could have been a bit of a disastrous evening. A friend commented that this was not the first recent power outage, and opined that Hugo's may have some infrastructure issues... but for me, it was a delightfully unexpected turn of events that the staff transformed into an impressive win.<br><br>Come find me at the bar between a martini and some west coast bivalves.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/x0NR7GeLgmfVbHryV5OS8A/348s.jpg", "caption": "A great oyster happy hour at Hugos!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/B6BVwP0Vglt7SVeR2p1R6A/168s.jpg", "caption": "The Vesper martini (shaken, not stirred)"}]}}, {"review": {"des": "Busy place with fresh sea food.  While everyone in my party chose the Chilean sea bass, I selected the local perch.  bad choice: the perch did not taste like perch from Lake Superior and was essentially uneatable.  There are far too many god eating options in Chicago and I won't go back", "pics": null}}, {"review": {"des": "Great atmosphere and a god happy hour. The few times I have been, the lines have not been too long to get in (if there even was a line). And during happy hour they've got $1oysters! What a steal! Round it out with some drinks and a few burgers, and we had a great time. <br><br>PS. The bookbinder's soup is amazing, would recommend", "pics": null}}, {"review": {"des": "My husband and I recently chose to dine at Hugo's Frog Bar and Fish House based on all the positive comments we read on Yelp and I'm really sorry that we did! From beginning to end the experience was disappointing. We were celebrating my birthday and had just been to Shaw's Crab House on Hubbard for their Happy Hour oysters and drinks, choosing to have our main meal at Hugo's. Upon arrival we were seated in a booth towards the back of the house where waiters were continuously whisking trays back and forth from the kitchen, creating a very distracting environment that was not at all conducive to conversation. We soon realized that it was also the path to the restrooms, increasing the amount of traffic whizzing by our table to a constant bustle. This was a Sunday evening and there were many empty tables, so I don't understand why we were seated at this particular table. When we requested another table and explained our reason, the waiter told us that there would be similar activity at any other table in the place, which was a ridiculous and untrue comment. However, they did accommodate our request and moved us to another table which I concede was quiet, but a bit cramped and very dark. Strangely, there was a lovely vacant table right next to us that was quiet, well-lit, and had a view of the street. For the life of me I don't understand why they shoved us into that dark corner instead, but by this point I just did not want to make another \"scene\". <br><br>Before we moved to table #2, our original waiter had brought us the fish plate displaying the raw fish selections and explained the different seafood dishes that they were offering that evening, all the time waxing poetic about how Hugo's had the best and the freshest fish in Chicago. He especially played up the Chilean sea bass (admittedly one of my favorites), claiming that we had \"never had Chilean sea bass prepared as deliciously as theirs\". My antennae were already up by now, wondering why the waiter felt the need to resort to such hyperbole. After the waiter left, and before we moved to table #2, my husband actually asked me if I wanted to leave, because we were already recognizing the red flags of a less-than-satisfactory experience. Alas, we stayed. Live and learn, and pay attention to your instincts!<br><br>I ordered the Chilean sea bass and my husband had the halibut. We did not order a side dish because they only come in huge portions meant to be shared by a group and we were only two people. The fish dishes came with soup or a salad. We both chose the salad, which was an ice-cold and insipid basic salad of mostly iceberg lettuce (come on, really???), a few leaves of romaine, a few slices of cucumber and a couple of grape tomatoes. At almost $50 a plate for my sea bass, I found this salad to be an insult. I requested some thinly sliced red onion to spice it up a little, and the waiter eventually returned with a monkey dish of soggy diced onion, apologizing that they had only \"purple\" onion. Both fish dishes were ok, but in no way did they live up to the superlatives heaped upon them by the waiters. <br><br>Upon originally being seated we made the mistake of confessing that we were celebrating a birthday, which resulted in a strange ritual at the end of our meal in which three waiters came to our table carrying a goblet of melting vanilla ice cream with a candle stuck in it and barked a weird and alarming Happy Birthday greeting which sounded more like being accosted than being celebrated. When I say melting, I mean the ice cream was already dripping all over the plate on which it was presented. It was complimentary but really sort of gross. <br><br>As for desserts, most of them are again huge and designed to be shared by a group so we didn't even bother considering a piece of pie or cake. We saw cakes ordered at other tables and the portions were frankly gluttonous even by a glutton's standards, and a table of four near us seemed barely able to eat half of the behemothic piece of carrot cake that arrived at their table with much fanfare. To me it just seemed like conspicuous excess. <br><br>We will never return to Hugo's Frog House. The food was acceptable but not extraordinary as we were led to believe, and the prices are high for what you get. We felt that the service was for the most part attentive but strained, like they were all trying too hard or maybe following some sort of script. We also sensed a certain arrogance on the part of the waiters. In short, we did not feel comfortable in the restaurant and by the end of the meal we really just wanted to get out of there. We regretted leaving Shaw's Crab House, where earlier that evening we had had such a great experience with the service and the food. Like I said before, live and learn.", "pics": null}}, {"review": {"des": "An okay place for day drinking and dollar oyster. If you come here for happy hour (3pm onwards) on a sunny Chicago afternoon, you are confined to the bar area, which is dark and gloomy. The dollar oyster is a good deal that had a good variety of my favs: miyagi and blue point. However, I can't speak to the freshness of the oyster as I found a few (out of 2 dozens) to be excessively briny and did not taste fresh. I have yet to try other things on their menu besides the happy hour Oysters.", "pics": null}}, {"review": {"des": "TLDR great happy hour oysters. <br><br>Came for the oysters. Got some crab bites. Had a gin and tonic. Totally awesome.", "pics": null}}, {"review": {"des": "Met my girls here for dinner but I arrived an hour early. Sooooo what do you do while wait? Order appetizers and drinks of course. I ordered the fried Calamari  and glass of Kim Crawford, Sauvignon Blanc.<br><br>The Calamari was blah, mediocre at best. I think I got them confused with Carmines calamari. My service was awesome as always. When my friends arrived I THINK I ordered crab legs, the snow ones...they were good. By that time I had several glasses of Kim Crawford. <br><br>Although I didn't really care for the calamari on that day, this is my 2nd favorite seafood restaurant, of course I'll return.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/FLg3jySe5OFdC4HKFQv7tA/348s.jpg", "caption": "The lunch menu"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ZCpoCFN1BVakFbnHe1kLaA/168s.jpg", "caption": "The homemade cocktail sauce is great live the added horseradish."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ISi9N7U0HqNXVpXO-KIAUQ/168s.jpg", "caption": "The So-so calamari"}]}}, {"review": {"des": "Absolutely a must go to when in the Windy City.<br>Oysters on the half shell, Gravax, Prime Steaks, if you're looking for it, come here. The staff is wonderful and top notch service make this a must. Ask for a small slice of their chocolate layer cake, made fresh daily. It's the best.", "pics": null}}, {"review": {"des": "Come for the dessert, but maybe skip the food. My fiancé came here with his brother and of course, they both ordered their famous steaks. Unfortunately, they really missed the mark. His brother ordered a steak medium well and when it came, it was incredibly underdone. When he pointed this out to the waiter, the waiter agreed and brought the steak back to the kitchen. In a nice steakhouse like this, we just assumed they would fire a new steak off to the right temperature. Unfortunately, they came back 10 minutes later with the same steak (cut mark through it and all) that was just thrown back on the stove and was, of course, inedibly dry.<br>I did get the crab cakes, which were pretty good and standard. And the biggest redeeming part of our entire meal was definitely the dessert. The muddy bottom pie was, as advertised, delicious, huge, chocolatey goodness. <br>Compared to other steakhouses in the city, I'd eat steak elsewhere and come back here for the pie.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/_m0DqhGrv_quqqhl028-CA/168s.jpg", "caption": "$1 oysters!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/idtm8VWoOnKg6BHoWyYLtA/168s.jpg", "caption": "Crab cake appetizer"}]}}, {"review": {"des": "Had an excellent dinner here on our first day visiting Chicago. Great food and great service!<br><br>Bookbinder's Soup: very flavorful soup with small tasty chunks of fish inside. (Fun fact is the very original recipe of bookbinder's soup used snapper turtle, which was later substituted by snapper fish.)<br><br>House salad: as good as expectation.<br><br>Shrimp Dejonghe: I learned from Wikipedia that this is one of the specialty dishes of Chicago and I was very excited to try this. Love it! The jumbo shrimps had great texture and the buttery sauce had a very unique taste. Though the tangy flavor was slightly overpowering to me when I ate too much of it.<br><br>Pan Fried Walleye Pike: a flaky, moist fish paired perfectly with the lemon butter sauce. Simply satisfying! (Especially if you are a fish lover like me)", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/gWQZRPI126CdjDG6LWmP3Q/168s.jpg", "caption": "Frog!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/qDodRhbUzuh47H8vyFbNWg/168s.jpg", "caption": "House salad as a side dish"}]}}, {"review": {"des": "We recently stopped at Hugo's Frog Bar for a celebratory dinner and was not disappointed. Our party of 6 arrived ~15 minutes before our 8:30 reservation, and even though the restaurant was absolutely packed, we were seated early. <br><br>Between the 6 of us, we ordered the porterhouse, walleye pike, crab legs, and lobster, among other things. Each member of the party was pleased with their dish. In terms of sides (which are large; we only needed 2 for the table), we especially enjoyed the chipotle roasted corn. <br><br>It's safe to say we were NOT prepared for dessert. Feeling pretty full, we decided to order only one dessert to split 6 ways. The muddy bottom pie was absolutely enormous, easily 10-12 slices. We didn't come close to finishing it. However, it was absolutely delectable and we were ultimately happy we ordered it.<br><br>The only downside to our dinner was that Hugo's was out of several entree options for the evening, which we were only told after a member of our party had to re-order several times. Given the price of the entrees, it's somewhat of a bummer to have to settle for your third choice.", "pics": null}}, {"review": {"des": "The service at Hugo's is noticeably polished. The kitchen is shared with Gibson's, so you're able to order to order a steak or surf and turf in addition to the seafood menu.<br><br>The crab cake appetizer is filled with lump crab and minimal filler. The exterior is crusty and the interior is soft and warm. <br><br>The Chilean sea bass is tasty, but the real highlight for me were the mushrooms underneath. I was impressed by the flavor and texture of the bed of mushrooms. The sea bass was a bit firmer than I was expecting, as I was hoping it would be as soft and buttery as the server suggested.<br><br>The brussel sprouts are pretty sweet and sprinkled with pieces of bacon. I liked that the sauteed mushrooms were whole, miniature, baby bellas.<br><br>The turtle pie is nearly a quart of vanilla ice cream over a spice cookie crust, covered in macadamia nuts and caramel sauce. This could easily serve 10 people, so make sure you either come hungry or with a large group in order to finish this monstrosity.", "pics": null}}, {"review": {"des": "Yo Yo Yo: Grade A <br>Here is the deal - don't sit down go to the bar and have dinner so much better. don't be a typical American and order individual entrees - order one appetizer crab and avocado or  crap cakes   With wedge salad split for 2 and then split steak. Filling and awesome. I don't feel like hell. Go for it. Live large.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ujFi_TftEeas2IAmxfWWiA/348s.jpg", "caption": "Good drinks! Great atmosphere !"}]}}, {"review": {"des": "Another fantastic dinner here. <br><br>I was a little sad to see the menu changed slightly. I didn't see Lobster Bisque but no biggie. We decided to go here for my birthday and it was nothing but amazing. The wait staff, managers, etc... everyone kept checking on us to make sure everything was going great. <br><br>For dinner, they sat us in the back in a round booth. I appreciated this because it was a little quieter before the big groups arrived. Plus, we could sit next to each other and talk. I got the stuffed Lobster and my girlfriend got steamed Crab Legs. Plus 1/2 dozen oysters. Somehow we were able to finish it all by helping each other. <br><br>Finally, since it was my birthday, I got a free ice cream. I'm looking at my phone when all of a sudden I hear some chanting. Looked up and they were singing happy birthday. <br><br>Another great dinner experience here and we will surely be back soon.", "pics": null}}, {"review": {"des": "Excellent service / had water and warm bread with in 3 min of being seated. Very professional staff / seafood excellent /excellent stake.  Get here before 7 for a seat or make a reservation.  Fun noisy excellent .  Prices are good for what you get without drinks plan on 50 per person. / Well worth it. / Had the sea bass melted in my mouth / died and went to food heaven", "pics": null}}, {"review": {"des": "We sat in the bar and had full dinner and it was great!  TV's around and nice upscale environment with a low key feel.  Ask for Chloe, she was great.  Other than running out of the Whole Maine Lobster, the crab legs were a great replacement along with the filet medallions.  Started with some oysters and had to order double once we got the first round, so good!  Less busy than the neighboring restaurants and the food was just as good and service top notch!", "pics": null}}, {"review": {"des": "Totally overpriced for terrible food. This gets two stars only because of the bookbinders soup, which is only pretty good at best. We ordered frog legs, the tuna steak, and the mussels. The frog legs were fine because they were covered in butter and garlic. The mussels were abysmal. There was a weird licorice taste to the watery broth and absolutely no flavor. Many were closed, meaning they were dead and probably bad before cooking. The tuna was just sad. Stringy and did not taste fresh. A dry mix of things smashed on the outside without flavor. Some tiny smudge of sauce on the plate to try to make up for it. The clam chowder had literally 3 clams in it and was all cream and zero flavor. Then one of us got food poisoning at the end of the night and was vomiting all night. <br><br>Don't be fooled by the location and the price. This was a total waste of money.", "pics": null}}, {"review": {"des": "Had a great night with some girlfriends after seeing a movie premier. We each ended up having steaks, but it was much quicker to get in here than to wait for Gibson's, and they serve the same steaks. My filet oscar was incredible, and the drinks were pretty potent!", "pics": null}}, {"review": {"des": "Last night in town. Recommended by our concierge we had dinner at Hugo's. We walked to Rush street and were seated right by the window. Waiter was very friendly and helpful in explaining the menu. We had Cesar's salad and crab cake as starters. Followed by Planked Lake Superior Whitefish and Togarashi crusted Tuna steak (hot!).<br>Our meal was delicious and we enjoyed a bottle of Fumé Blanc.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/4_zsOeI8vY9ZA0vKsDyW0g/348s.jpg", "caption": "Menu"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/xl8fsWSkDkwMkr6lrAF9LA/168s.jpg", "caption": "Outdoor tables, Chicago downtown"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/FDV4kHtI4BxDhfzCr7tizg/168s.jpg", "caption": "Planked Lake Superior Whitefish"}]}}, {"review": {"des": "I had an amazing experience here! The service is so good!!<br>And the food! THE FOOD. <br>Definitely get the frog leg appetizer! And the crab cakes. <br>I ordered the sea bass and it was cooked perfectly. I also got brussel sprouts on the side and they were delish. I wish I could've ordered the king crab too but I was absolutely stuffed! I couldn't even fit room for dessert!!<br>Pro tip: come here on your birthday or just say it's your birthday! Huge pieces of cake!!", "pics": null}}, {"review": {"des": "Hugo's frog bar was a memorable experience for me and worth a trip. The décor/ambiance is elegant. Keep in mind, we only came for drinks at the bar so I cannot speak to the restaurant with any accuracy. <br><br>I always appreciate and make it a point to mention bar tenders who make an effort to make your drinking experience special. I didn't get the gentlemen's name who crafted our drinks, but he was well-dressed, well-spoken and seemed to really want us to have a pleasant experience, which we did. <br><br>We got old fashioneds made with Maker's Mark bourbon. They pre-make the mix, but it's a homemade mix so do not be dismayed by this. The mix leans a bit heavy-handed on the brown sugar for my taste (I prefer less sweet old-fashioneds), but it tasted fresh and clean while allowing the flavor of the bourbon to come through, this is important to me. Some in my party even went so far as to say it was the best old fashioned they'd ever had. I won't say that for myself, but just know that it was said amongst my party. <br><br>As it was in the heart of Chicago, it didn't come cheap. I get it, though, we didn't expect to pay less than $9 for our drinks. Additionally, I don't prefer having a bathroom attendant. Was the attendant bad in any way? No, he was perfectly pleasant and made fine small-talk, it's just that an attendant in a restroom is awkward to me. <br><br>Overall, I would recommend, try the old fashioned.", "pics": null}}, {"review": {"des": "I like the laid back feel at Hugo while also having a nice meal.  They have a huge selection of drinks and if you want, you can dine at the bar too! If you do order their mash potato, one order is good enough to feed four people.  Just keep that in mind.  Hahaha... I was too busy with my coworkers chatting so I forgot to take photos of our food.  But their dry aged steaks here really good and a must order.  All in all, we ha a great time, service was good and ambiance was fantastic.<br><br>Until then, be kind to one another and Cheers! ~ :p", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/K9xmoSat92D-vBs12EKg9A/348s.jpg", "caption": "Salmon"}]}}, {"review": {"des": "Just back after five years. Still amazing. Bartenders are attentive but not overbearing, kind, thoughtful, and everything you are looking for.  Came in around midnight and they still had the kitchen open.  Delicious surf and turf.", "pics": null}}, {"review": {"des": "Last night my husband and I celebrated our 3rd Year Anniversary of when we First met. Thanks right! We celebrate every little thing. After all, life is a BEACH and we ALWAYS find ours. We had dinner and cocktails at The famous Hugo's Frog Bar located in the Gold Coast of The Greater Down Town Chicago. <br><br>It was fantastic from the moment we walked in the door. As we were asked to follow the beautiful hostess, there was a server in each booth as we walked by we felt like celebrities. They all opened way and greeted us with a warm and firm \"hello\", followed by \"Enjoy your evening\". It was fabulous.<br><br>We started the night with hand crafted cocktails, Manhattans on the Rocks to be exact! They were made to perfection. One of my favorite appetizers is their Shrimp Cocktail. They manage to have an exquisite home made cocktail sauce that is adorned with their special horseradish sauce. I tell my husband that if the cocktail sauce does not mange to make go  \"ooooh\" and break a little sweat, then it needs more horseradish! The shrimp are JUMBO, well cleaned, fresh flowed daily from fresh water areas and with the right amount of crisp in every bite! <br><br>We toasted the night away to a bottle of Champagne. For dinner we had their famous known for Crab Cakes and garden salad. We ordered grilled cauliflower as a side dish, and let me brag about the taste of it! The charred areas of the cauliflower were very tasty... Mmmmm it just added all kinds of flavors to my mouth. <br><br>For dessert we had the Crème brûlée and the top was nicely torched to perfection and did not give me a burned flavor, it was just right! As I took my first scoop, the creamy taste was melting on the tip of my tongue. That was a very tasty dessert if I do say so myself! <br><br>As the night greeted us with another delightful evening, we exchanged a million smiles, laughter and many many great memories that have been a part of the great marriage we both have. I remember when selfish people used to tell me when my husband and I first met, \" I give you guys 2years max!\" I can honestly say that frightened me, but now, NOW I am glad I can just laugh about it and enjoy what I do have. <br><br>Life has its ups and downs, but I am grateful and bless to be able to say that we have had MANY MANY MORE UPS than downs. Which I can also say I have NOT taken it for granted. I cherish and appreciate my husband to the fullest and show him everyday of how grateful and thankful I am of him. <br><br>We probably exchange dozens and dozens of \"I LOVE YOU\", \" THANK YOU\", \"I MISS YOU,\" as corny as it may seem to others, we don't care what anyone else has to say, because at the end of the day, it's us that we have to satisfy and not others. After all, we are the only 2that lay heads in our sanctuary. <br><br>With all this my dear readers, I leave you for today is another beautiful day and we will make the best out of it. We are hoping you do the same as well. Remember, LIVE, LAUGH & LOVE A WHOLE LOT! <br><br>Kahrla Cast'Joby*", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/od_5uL85jYczied7IeK8vw/168s.jpg", "caption": "Frog legs"}]}}, {"review": {"des": "Gorgeous restaurant- food not so much<br>Go to Shaw's Crab House- better food, nicer staff & just as gorgeous (if not more so) surroundings", "pics": null}}, {"review": {"des": "NEVER disappoints! This is the 2nd year, we've returned, during our annual conference. Food is fresh and amazing and service is very attentive. The Chilean sea bass is melt in your mouth!! Sides and desserts are also spectacular! Get the strawberry shortcake!!", "pics": null}}, {"review": {"des": "Tony was an absolutely wonderful waiter!! With all of the constant changes in orders and neediness of our table this night, he was grrreatttt!!!!!<br><br>Husband and I had the Hugo lobster - it's worth the money and you get a wonderfully sized lobster with lots of protein.<br><br>Father in law had the scallops and he could not stop raving about them.<br><br>Mother in law had the crab cake appetizer for her meal and it was a huge jumbo size. She was prefeftly contempt and in good heaven as she ate her food. <br><br>We had the Alaskan crab lakes for an appetizer and it was wonderful. As sides we had salads, brocollini, asparagus and the loaded twice baked potato. Everything was wonderful. The twice baked potato is seriously big enough for a table of four to share.", "pics": null}}, {"review": {"des": "Dinner was exceptional . They were very busy yet took us at 6:30 our reservation Time . Seated us directly to our table . Our Waiter was fabulous and friendly . The halibut was delicious. The key lime pie & strawberry shortcake was yummy and huge. I would definitely come back here again. , one of my Chicago favs!!<br>And of course our hostess Priscilla was so friendly and sweet ! A great front person for the restaurant !!<br>Kudos to Hugo's", "pics": null}}, {"review": {"des": "We had a great time here. We ate outside and watched all the nice cars go by. We got the whole main lobster that was stuffed with crab. The drinks were sub par, very watered down and didn't taste of anything. Don't bother with the $14 cocktails just get beer or wine.", "pics": null}}, {"review": {"des": "The meal was lackluster, the waiters got several orders wrong, and one of the patrons at our table had a hair in their soup. Despite all of that, we would have been happy to pay our bill and leave. <br><br>However, when it came time to pay our bill, we encountered the rudest, most unprofessional, and borderline harassing behavior I have ever received from a waiter. We brought a moderate size party so we knew mistakes could have been made. The mistake in this case was that the waiter had misplaced $100 we'd given him and then overcharged us for our meals. However when I brought the mistake to the waiter's attention, he yelled at me that I was wrong about the discrepancy and then in the midst of a crowded restaurant with the table and several other tables looking on proceeded to count the money we'd given him very loudly to prove we were wrong. Never once did he extend an ounce of politeness or courtesy or offer to more discretely handle this matter. I'd hate to think he treated me this way because I'm a woman or not white or younger, but <br>based on the extremely polite way I saw him handle other guests, I must say the thought crossed my mind. <br><br>Of course as soon as he began counting the money, he realized the mistake was indeed his. Instead of apologizing for his rudeness and his behavior meant to shame us, he instead thanked us for catching his error because it would save HIM a lot of time and NOT because he assumed we were lying and was rude to us. His behavior was inappropriate and hurtful. And then to make matters worse he began to fondle my arms and attempt to hug me as consolation. I immediately asked him to stop touching me because he never apologized for his brusque and insulting manner. It was even more insulting for him to begin touching me in that manner when it was clear he did not respect my patronage or my business in the first place. I'm in my mid- twenties and I look younger and throughout the whole interaction it was clear he didn't care about our experience--he only cared about our money. Since he thought we didn't have enough money, he was extremely rude to us.  It was also incredibly insulting to have him hug me because I am certain he would not try that with his older clientele. I am not a person who gets emotional easily, but his behavior caused me to start crying right there at the dinner table in front of family and friends. After he left to straighten out our bill, another kind and attentive waiter did come over and try to mitigate the situation and even called for the manager. I regret we did not remember his name because he provided excellent customer service. We spoke to the manager but he simply listened to the complaint in an effort to send us out of the door and offered no recourse or remedy. I left Hugo's unsatisfied, unhappy, with a bad taste in my mouth and tears in my eyes. Never have I had a waiter try so blatantly to embarrass their patrons. <br><br>I get it--you have a busy restaurant. But if you're too busy to treat your patrons with respect, maybe you shouldn't be in the restaurant business at all.", "pics": null}}, {"review": {"des": "We had a great time at Hugo's. The server was amazing and I'm sorry I did not get his name. I had the 10 oz filet and my husband had the porterhouse. It was probably the best steak we have had in years. We also enjoyed the salad and the homemade dressing.  The asparagus was big enough to share we weren't crazy about the sauteed mushrooms they didn't have much flavor at all. We didn't get dessert because we were so stuffed but the dessert looked like huge portions the only thing I can say is the atmosphere was very loud and crowded and. If you are looking for a quiet romantic evening it is probably not the place", "pics": null}}, {"review": {"des": "Stopped in for lunch & had the lobster bisque & Shrimp DeJonghe. The bisque was extremely creamy, rich & decadent. To be honest it could've used more lobster but I haven't had a bowl to satisfy that complaint ever. The shrimp were good as well, breadcrumbs were toasted just right. There's a better version of this dish served at Bavette's but overall Good lunch!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/GvQ9CQioFf-mLyvSiQl0rQ/168s.jpg", "caption": "Lobster Bisque"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/xIJFK8-dYkLErCm-h31oQg/168s.jpg", "caption": "Shrimp DeJonghe"}]}}, {"review": {"des": "This Restaurant was VULGAR ! All they care about is the MONEY ! We ordered Scallops that were AWFUL with a strong smell and not even cooked inside they were RAW ! It was OVERLOADED with salt and no real veggies came with it !, we ordered French fries we had to pay extra 8 USD so the 4 Scallops not even cooked properly and the greasy fries : 50 USD : A COMPLETE RIPOFF . At the end of the meal the Manager on Duty never even removed them from the bill ! A Cheap minded and vulgar Restaurant we ll never go back to", "pics": null}}, {"review": {"des": "Ron is the most fantastic server! So knowledgeable about the menu but also wonderful at engaging his table! He really created an experience opposed to just a meal. He gave us lots of laughs. If you go to Hugo's, you should definitely request him! And tell him we say hi.", "pics": null}}, {"review": {"des": "Hugo's was adequate in most aspects. Service is old school and professional if a little sloppy. Our waiter at the bar had a big reddish stain on his uniform, I'm assuming it was wine, that was somewhat unsightly. He made a strong margarita and a somewhat decent martini otherwise a bit on the warm side for me, not chilled enough. However, he grabbed the olives with his bare hands, dropped one of the olives - not on the floor but by the service area behind the bar - picked it up and managed to keep manipulating the olives with bare hands until he managed to get them on the stick. Thank god they were going into alcohol and my immune system is not that weak. Best part were the happy hour oysters for $1. Fried calamari and shrimp dishes were good. I found the shrimp a bit too salty though over unseasoned rice. Now, the music selection was extremely off putting and did not match the atmosphere at all. More like a kiss fm or a 1019 radio station you listen while driving. Some jazz or Frank Sinatra would have been more adequate and enjoyable.", "pics": null}}, {"review": {"des": "Possibly the best place in Chicago to eat dinner.  We had the Crab Stuffed Lobster, Newfoundland Scallops, Brussels Sprouts, and Twice Baked Potato.  Most amazing meal we have eaten in quite a while.  The waiter explained the entrees very well and was so attentive.  We will be back for sure.", "pics": null}}, {"review": {"des": "Walking in here was like walking into a Humphrey Bogart film. The bar area is absolutely awesome, but was a bit crowded, so we opted to sit in the other part of the restaurant. Our waiter was amazing and very patient, and brought me my own teapot for the tea I ordered. My aunt and I split this GIANT creme brûlée that was absolute perfection, and the manager walked over to our table to chit chat with us. My aunt and uncle and cousin always go here, and the one comment my aunt made was that they no longer are serving the pear martini she loves, and had to settle for a lemon drop.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/XYV_ryi1Sjt6AEinfMLROw/348s.jpg", "caption": "Outside"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Kn0cZFv5SIpueQYDGezI1g/168s.jpg", "caption": "Whoa"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/KEbJAHRcYyafnhQnzqSpoQ/168s.jpg", "caption": "Table ambiance"}]}}, {"review": {"des": "Came here for my birthday and had the best experience. The management treated me so well and appreciated. Loved it for a date night and great for family dinner too! Fish is amazing!", "pics": null}}, {"review": {"des": "Omg I regret not taking a picture of my yellow tail tuna. It was just that it looked so good and I couldn't wait to taste it. After I did, I couldn't stop eating. And before I knew it, it was all gone. I'm Mexican and I love spicy food. I came here with a business associate (he picked the place). When the server explained how the tuna was prepared I was sold. It comes with these spicy, kick your butt, little circle sauce dots arranged around the plate (don't worry they don't touch the tuna if you don't like spicy and you can choose to not eat that) and I was in heaven at first taste.", "pics": null}}, {"review": {"des": "Loved coming here! The atmosphere was wonderful - they had a piano man who sounded just like Stevie Wonder belting out hit tunes. The restaurant was packed but we were able to find a spot at the bar. Our bartender Keith was great! He gave great recommendations and was frequently checking on us.<br><br>We enjoyed a couple glasses of red wine and fresh oysters. Some of the best oysters my boyfriend and I have ever had. The sauces served with oysters were excellent. Hugo's is attached to Gibson's which is also a famous hot spot on Rush St. Loved the vibe here and would definitely recommend it to others. Especially if you love fresh seafood!", "pics": null}}, {"review": {"des": "Frank M was our server. He was beyond cool!!! Friendly, knowledgable, and very personable. Loved the service. Loved the food. It's a lot of food - so definitely Aleut share. Great atmosphere.", "pics": null}}, {"review": {"des": "One of the best steaks in the city. Always crisp on the outside and tender and juicy on the inside. Very consistent over many visits. Side dishes are hit and miss, but the steak is excellent and well worth the visit (and the price).", "pics": null}}, {"review": {"des": "Ho. Lee. Crap. <br><br>Well, first of all, make sure you have a reservation. It's apparent the day of the week really has nothing to do with how packed this place may or may not be - IT ALWAYS IS! My dining partner and I happened to luck up on a table in the bar area, which was not bad at all and quite close to the live music. <br><br>Service - Great. Our waitress was very attentive and constantly checked on us. I was hoping I didn't embarrass myself as she brought out others food and I drooled while trying to stick my finger in their plates. Everything that came out of the kitchen looked like it had been created with love and fresh ingredients.<br><br>Food - I hadn't had frog legs in soooooooo long. The last time I had them, it was at some random buffet in some random part of town. Not a good experience. However, with frog legs being one of their specialities, I decided to go for it. What a heavenly combination between the taste of chicken and crab  meat (hey, leave my comparison alone!). I then had the Cajun Chicken and Crab, with Andouille sausage and garlic butter. I could've asked the chef to marry me. Male or Female. I only had a French Martini and didn't indulge in any other libations since I wanted to leave room for the stuffage of my face. Next time, I will definitely get desert! <br><br>Parking can be a hassle, so the valet is totally worth it.  Or carpool/uber if you can. Try and get a reservation or show up and take a gamble in the bar area. Try the frog legs and snail!!!! Enjoy!<br><br>#WhoNeedsLoveWhenYouHaveFood", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/mpqcQrnzl1XhpWNF-7ycxg/168s.jpg", "caption": "Frog legs"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Xj7niBwhzeIwbzaRdPe9Aw/168s.jpg", "caption": "Cajun Chicken and Lobster"}]}}, {"review": {"des": "Delicious dinner with impeccable service! Festive & fun atmosphere- seafood or steak were outstanding! The bathroom attendants are unnecessary & outdated. We had a round table for a group of 8 and it was a wonderful dinner! Wine list is incredible. Our server Carl was the best of the best!", "pics": null}}, {"review": {"des": "Very classy, luxurious environment. The salmon was very good! The ribeye was excellent! Don't even get me started with the clam chowder soup, it was phenomenal and the lobster bisque was out of this world! It was wonderful! The wine options are amazing and the chocolate mousse pie was so good! The waiters were also very nice and very attentive! I highly recommend stopping by for a bite! You won't be disappointed!", "pics": null}}, {"review": {"des": "Lively River North spot with good food, great service and plenty of atmosphere.  Everything we had was very good, the oysters on the half shell, the calamari, the oysters Rockefeller, and for my entree the Lake Perch, which I haven't had since last time I was in Chicago.  Our server was friendly and the kitchen had our orders out quickly despite the fact that they were pretty crowded on a Friday evening.  Prices on some items are a bit high ($100 surf and turf) but everything we ordered was fairly priced and quality very good.<br><br>A good bet if you are in town for a long weekend or out on business.", "pics": null}}, {"review": {"des": "The food was delightful (calamari, steak and crabcake, Brussels sprouts) but our server, Ron, made it such a great experience. He served us with terrific recommendations, was friendly, quick, and delightful to work with.", "pics": null}}, {"review": {"des": "Service was great and loved the area.  Issue was surprisingly the steak.  Got the bone in ribeye and it was lukewarm to cold when served.  Should have sent it back but I had a flight out early next morning and didn't want to wait further.  I assume it was an off night, but there should be better quality control when you order a 65 dollar steak.", "pics": null}}, {"review": {"des": "Went there for a night out with my girlfriend. Food was amazing. The 7oz Filet Mignon was spectacular, as were the potatoes and veggies. Service was great. Couldn't ask for a better experience! Definitely worth the drive from Milwaukee!", "pics": null}}, {"review": {"des": "We came to celebrate our 41st anniversary! We were treated like royalty! The food was fabulous, and beautifully presented. The restaurant was clean and classy. Reservations are a must, and we were seated immediately. Valet parking is the way to go.<br><br>We enjoyed shrimp cocktail, clam strips, crab cakes, clam chowder, crab bisque soups, Brussels sprouts, spinach with mushrooms, seasoned corn, the tuna (mouth watering), and Alaskan crab with drawn butter. For dessert, a giant strawberry shortcake. Everything was phenomenal. <br><br>Our server was Pete, and he was top notch in every way. Friendly, knowledgeable, funny, and made our evening out complete. Ask for Pete, you won't be disappointed!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/9E5H0Nn2CcUFFoh4ukMlhA/348s.jpg", "caption": "Our server Pete and me, hubby took the pic."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/YrrxJsey0oNyBbiVwiy9ug/168s.jpg", "caption": "Strawberry Shortcake"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/MmsMXz-iUjWsVw10nE5s9A/168s.jpg", "caption": "Crab like you never tasted before! Delish!"}]}}]}