{"name": "iguana-caf%C3%A9-chicago-2", "reviews": [{"review": {"des": "Came in on a Thursday evening -- I love the hours of this place! Open late enough to grab a quick bite for dessert. I've only ever come here for dessert treats so not too much input on what the savory crepes are like, however I've always left satisfied with my sweets! <br><br>This time I got the Chocolate Monkey Crepe and was not disappointed! Serving size is decent for a crepe and the price is pretty in line with what a crepe will cost you in Chicago. My friend got the Sweet Sin (apple w/ caramel + walnuts) and she was quite happy with her dish too!<br><br>Overall, the ambiance of this place is great for conversation and super cozy. It's always a top choice I recommend for just grabbing dessert and chatting since we can usually find a parking spot on the street right outside (quite rare in the city!)", "pics": null}}, {"review": {"des": "UPDATE:  We just had brunch here.  They are just as fabulous for brunch as they are for dinner.  The Crepes are FAN-TAS-TIC!! ... <br><br>The Pasta Carbonara (without green peppers) is to die for!!! The wine is priced very well (not many places in Chicago where you can get a decent brand nice sized glass of wine for under 10 bucks).  The service is consistently fantastic.  <br><br>I have to say that I have never had a bad experience here and I have been coming here about 12 times per year for 4 years. <br><br>I highly recommend this place if you like good food, good service and good wine.  Two thumbs up here!!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ZZzSRwuNzRP1OSFmHgVrRg/348s.jpg", "caption": "Beets and burrata are absolutely delicious!"}]}}, {"review": {"des": "Have you ever tried its 'Carbonara' pasta?<br><br>If not, <br>I highly recommend to you this as my life pasta ever.<br><br>This is very rich creamy carbonara pasta covered by abundant cheeses. <br>Don't worry, even though this is not like light dish as Italy's cuisine, it is not a heavy too much. <br>This is perfectly balanced pasta with plentiful fresh ingredients such as mushroom, bacon, etc.<br>You may fall in love with it! <br><br>Waffle also very delicious if you are chocolate lover!<br><br>Also, <br>servers are all very nice! <br>They give you comfortable moment all the time, care of you carefully, kindly, politely.<br>You can enjoy your dish at your time.<br>Happy moments-", "pics": null}}, {"review": {"des": "I feel like this is highly under-rated. <br>I feel like writing this in Haiku form.<br>Then again I may not.<br><br>When I just want to get away from everything and just vegg out this is my spot. That being said Its also a good first date place, a 3 date spot.<br><br>I found that the staff is interested in what you want to eat.<br>I have basically tortured them with my requests to mix up the salads and put in different items from other salads and they abide by my requests and dont give me that weird vibe like i have just asked them to sacrifice my first born son or something.<br><br>My favorite is the smoked salmon AKA \"lox\" salad. I added the AKA. <br><br>They have a chard for $5.50. For those of you winos out there you will understand that this is a good thing.", "pics": null}}, {"review": {"des": "Decided to stop here for breakfast Saturday morning as it is a short distance from the metro stop. Large restaurant with almost no one inside, so easily was able to get a table for two near the window.<br><br>Large menu with customizable options and add-ons. Between two people, split the Amsterdam Crepe w/spinach ($10ish) and Strawberry/Banana Waffle w/Nutella ($10ish). The crepe is a well toasted exterior, stuffed with gouda, muenster, tomatoes, peppers, and oregano. Wonderfully cheesy and plenty of tomatoes, albeit the ingredients are not mixed in well. The Belgian Waffle is also made perfectly, and topped with ripe bananas and strawberries. Nutella was an overkill for sweetness, which we used in place of the syrup provided. To drink, ordered the Iguana Special ($4) - an iced blend of espresso and coffee that was okay.<br><br>Food comes out fast and the server was patient with us as we asked a few questions. Quaint spot for a relaxing breakfast/brunch.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/a8QWK-BztVwBHUEWrzslBA/168s.jpg", "caption": "Amsterdam crepe"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/w5T6D-WHiYDsDBASs7uUOQ/168s.jpg", "caption": "Strawberry Banana waffle"}]}}, {"review": {"des": "LOVE. One of my favorite dessert places in the city and was a go to spot in undergrad (right by UIC). The waffle and crepes are recommended and definitely filling! It's a good place to bring a date too because the lighting is low key and romantic. The ambience and decor is modernistic and there is an iguana cage but have never actually seen one so not sure what is up with that....<br><br>Service is a little slow but still giving five stars because the wait is worth it. I have heard the coffees give a good \"taste of Europe\" so will have to try that next time. Another plus is that there are outlets available and they are open late.", "pics": null}}, {"review": {"des": "Reliably open. Hit/Miss.  Stay with European Basics - i.e. hot/cold frappe, bougatsa, tomato soup.<br><br>With today's coffee standards, $2.75 warm generic HOUSE BLEND COFFEE (1 refill only) is unacceptable. Have you seen Starbucks or Dunkin serve WARM COFFEE?  Server was confused why I wanted HOT COFFEE, so I suggested to microwave it.  Its the same cup with my lipstick on it, my guess... hot water was poured on existing coffee.<br><br>SKIP the flour tasting crepes.  Crepe color and feel says UNDERCOOKED.<br><br>CAUTION:   SUGGESTED GRATUITY on the receipt is based on TOTAL (with tax), NOT before tax!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/B0mXbwUUao6Zsrfx6iNSvw/168s.jpg", "caption": "Suggested Gratuity is based on TOTAL/AFTER TAX, not Pre-Tax."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/quAA28kuHr8aoGLUdIXvCQ/168s.jpg", "caption": "Undercooked Cannoli Crepe"}]}}, {"review": {"des": "This is a nice find that's easy to miss just north of the bustling center of West Loop, but it's well worth a visit. Aside from a wide selection of cafe drinks and some alcoholic cocktails, the mainstays here seem to be their crepes(savory and sweet) and waffles. Have yet to try a sweet crepe, but the savory ones taste pretty good and are a surprisingly large portion(hard to tell from pictures but it's actually folded over so you get twice as much as what you're seeing). Crepes and waffles, aside wanted to mention their selection of pastas and appetizer dips. They have a few different ones on the menu which seem popular, but quite enjoyed the cheesy crab dip, which was a filling portion with plenty of crispy croutons and pita. <br><br>Prices are affordable with most things sitting at less than $10. Service was great. Iguana has a very clean and contemporary ambience, with darker lighting, red accents, and interesting though not distracting paintings which create an intimate atmosphere that doesn't feel like it's trying too hard. This place is suitable for a date, a casual dinner with friends, a late night crepe or waffle, or just stopping by for a coffee and sandwich in a nice atmosphere. You make of Iguana Cafe what you want to.", "pics": null}}, {"review": {"des": "Yum, yum & more yum. Worth the walk from our hotel-great/beautiful atmosphere, wonderful menu options for breakfast/lunch, and super fast & kind service. Will def be back. We had savory crepes, and girls split the dessert crepe, Creamy Caramel Creations after (see pic).", "pics": null}}, {"review": {"des": "A friend recommended this spot for a lunch date. It was the perfect place to catch up with your girls. I loved the ability to order late breakfast. We enjoyed the salmon pasta, banana nut waffle, and crepe with chicken, cheese, mushrooms and spinach. The grapefruit mimosas were fantastic. Our waitress was attentive without smothering us. I'm nitpicking, but I would have preferred a cooked salmon option. Just a really nice cafe overall.", "pics": null}}, {"review": {"des": "Stopped in here after the Dawson in search of some food. We got the burrata and beet salad which was good and the cheesy crab dip which just eh. Prices are decent for the area and service was fine. It's small spot but its nice and clean. I'm on the northside so I wouldn't make a special trip but if you're if I'm in the area I might stop by and try some other food.", "pics": null}}, {"review": {"des": "I've been here dozens of times in the past and I've never had an issue splitting the bill. We had a party of 8 and wanted to split the bill 3 different ways. We told her to charge 4 people's orders on one check, 2 people's orders on the second check and the other 2 on on a separate check. She comes back and gives the 4 people their check then comes back and hands the rest of us one check instead of 2 like we asked for. We noticed she charged us for two items the other party of 4  had so we nicely asked her if she can take it off and charge them and also split our bill for what we ordered like we asked. I was going to tell her how much to put on my card and she interrupts me mid-sentence, says she's not allowed to do that because there's a lot of us and she can only split the bill 50/50 then walks away quickly. This server was being lazy and didn't feel like doing the work and fixing her mistake. Like I said, I've been here plenty of times before and I was able to split the bill with how much I wanted on my card and how much I wanted charged on the other persons card, never have I been told, \"I can only split it 50/50\" AND refusing to take off two wrong orders that she charged us incorrectly. Ridiculous.", "pics": null}}, {"review": {"des": "This was a great place to get together with friends. Service was good, prompt and friendly. Prices were very reasonable. The volume on the music was spot on and also the type of music was great (kind of a light Euro dance music). It was upbeat music but not pounding loud - we could hear each other but still have background sound. The food was tasty and very imaginative without being weird. Lots to choose from on the menu. The cocktails were also delicious. I'm definitely going back and bringing friends and family. <br><br>Only one issue I had was that there were wayyyyy too many roasted red peppers in my savory crepe. My sister had wrap that had almost nothing but jalapeños. Again..  way too many and she ended up not eating more than a few bites. <br><br>I do want to go back and have every single one of their desserts though - they look amazing! Also - they actually know how to make a crepe unlike many other restaurants that just think it's a thin pancake.", "pics": null}}, {"review": {"des": "Excellent European style cafe in the West Loop. The restaurant has a very relaxed and modern artistic ambience, and was not too busy around lunch time on a Sunday. The food came fairly quickly, perhaps about ten minutes.<br><br>The crepes - highly recommend! They are very fresh and they have such a wide selection. The  creamy caramel creations was such a treat, you must try it if you like caramel. The Venice was also very fresh and had a distinct taste of red peppers.<br><br>The Napolitan was an excellent carbonara dish, and is a good dish for sharing. They also had a special of an egg soufflé which was delicious, as there was potato on the bottom and seemed quite gourmet. Overall, very high quality food and would recommend!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/TaoeH6C4I3WeIwYY3vD6Gg/348s.jpg", "caption": "Creamy caramel creations crepe"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/BfeVNEyxL_MZpAZM-copKQ/168s.jpg", "caption": "Napolitan"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/_7JK41u93tI9hFJ9Aw6b6A/168s.jpg", "caption": "Egg soufflé"}]}}, {"review": {"des": "Ordered a few items for delivery the other day. The carbonara was a hit pretty good portion size. The Nutella and banana crepe was also delicious, it did however get hard and stale but that probably because it was delivered. Biggest disappointment was the fresh mozzarella tomato salad, what a rip off barely any cheese, terrible quality of tomatoes and basil, charging $9.25 is a robbery not worth it. The grilled Caesar wrap had good flavor but wrap was wet because of the delivery aspect or because they make the wrap and then press it which creates moisture from the sauces and veggies when heated. Overall I would order some items, but others they need to seriously re evaluate upgrading them to fit the price point.", "pics": null}}, {"review": {"des": "I've been meaning to write this for years- I can't say enough about Iguana Café. I've lived in this neighborhood for three years now and Iguana is still one of the only places I can go by myself and feel completely comfortable. <br><br>My go-to is the acropolis crepe- add fresh or sautéed spinach. It comes with salad or strawberries, both are lovely. <br><br>I've spent too much time at \"swanky,\" pretentious cafés with staff that couldn't care less about you. Iguana is the opposite: welcoming, warm, never overwhelming, and always a comfort like home.", "pics": null}}, {"review": {"des": "This is a cute cafe tucked away in the river west area. I came here for brunch on a Saturday, mostly because I was tempted by all the great Yelp pics of their dessert crepes. I ordered a cannoli crepe which was pretty good. It was stuffed with the cannoli filling quite generously. My friends ordered savory breakfast crepes which are huge portion sizes. I liked the dessert crepe but probably wouldn't order it again. I wanted to try something different so I opted for the cannoli crepe but realized that I prefer crepes with Nutella, fruits, etc. The prices here are very reasonable. I was able to find free street parking just a block away.", "pics": null}}, {"review": {"des": "Dessert crepes are amazing. I always get the banana foster when I'm in town. Service can be in slower side but the staff is so nice.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/3yVQL54M4IcCJZrrQM2C0Q/348s.jpg", "caption": "Banana Foster dessert crepes. Yummm"}]}}, {"review": {"des": "I'v been meaning to try this cafe since I always drive by it on my way to work. When you walk in the cafe is very cute and intimate great place for a date. The service was on point the staff was very friendly. They have a huge menu selection. As a coffee lover I definitely recommend you try the caramel cappuccino here it's so good and also the crepes here are delicious! Definitely will be back to try more on the menu!", "pics": null}}, {"review": {"des": "Really great spot. Cute and comfortable, with a wide selection of tasty treats and drinks. I always order a crepe, either sweet or savory, when I visit, and it never disappoints! I have my eye on so many more items on the menu that I can't wait to come back and try! Service is friendly and professional.", "pics": null}}, {"review": {"des": "My go to spot for breakfast! They have both sweet and savory options, all of which are delicious. The Zurich crepe is my favorite hands down!", "pics": null}}, {"review": {"des": "I feel like my review won't do this place justice considering it is receives such high praise. I will say I didn't get what the cafe is most well known for - it's desserts. I ordered one of their savory crepes and it was disappointing. It had tomato, spinach, chicken and cheese. The crepe dough was good! Very delicious and perfect consistency. However the insides left a lot to be desired. Take my advice, don't order  their savory crepes! The chicken was dry and the spinah old and wet. The drinks were decent, we got a Moscow mule and it was average. <br><br>The service that day was not horrible but our waitress was a little pushy. We asked for some time to think about what we wanted to order because we were socializing given it was a group of us. She came back every 2 minutes and almost seemed annoyed we weren't ready to order. <br><br>I feel bad because this place is loved by many apparently. I must have come on an off day.", "pics": null}}, {"review": {"des": "I tried their Greek crepe, jalapeño Mac and cheese, and white chocolate mocha. The crepe tasted great and was a big portion, though they could've distributed the big chunks of feta into smaller pieces. The jalapeño Mac and cheese had a lot of jalapeños to add a solid kick, but I thought the dish was lacking a flavorful cheese that could've added more depth. The white chocolate mocha was delicious, but tasted more like a caramel latte to me. <br><br>The highlight was definitely the service though! The waitstaff was super attentive, and constantly refilled my water. <br><br>We originally came here for lunch and to study, but there is only one outlet and the noise level can get pretty loud around lunch time, so I would suggest not treating this place as a cafe but more as a lunch or drink spot.", "pics": null}}, {"review": {"des": "Great spot for either a date or friendly brunch .  The  mango mojito is so refreshing , you won't be disappointed. I also had the Banana Nutella crepe which surely was a treat!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/EYG_lithhoRQd6QnhpaCXQ/348s.jpg", "caption": "Mango Mojito"}]}}, {"review": {"des": "One of my fav cafes for coffee and/or food! Iguana cafe is located in river west area of downtown chicago and definitely offers a \"taste of Europe\" as they claim. I've tried their raspberry mocha, Nutella crepe, and jalapeño cheese dip and all items have been delicious and leaving me wanting more. All items are reasonably priced which is a plus. I'm looking forward to coming back and trying more on the menu as the pasta dishes sound phenomenal! <br><br>It does get quite busy during lunch hours, however, if you come in the morning or after lunch- there's tons of spots and availability. Lots of outlets as well and the wifi works great. I know some of the reviews say it's more of a sit down restaurant - which I agree, but the laid back vibe makes it a cool spot to get work done at as well.<br><br>Another big plus is the hours!!! They are open 7 am - 12 am which is unlike most coffee shops and they have a full bar so it definitely offers the best of both worlds.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/VZkuTqZsMEBFK30MUqW28Q/348s.jpg", "caption": "Jalapeño dip with raspberry mocha"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/v4iH9DkPfuVeRydp_gXj1Q/168s.jpg", "caption": "Post 2 PM- pretty empty"}]}}, {"review": {"des": "This place is a hidden gem for sure.  Wanted to find a place to chill and have good coffee, and this place nails that.  The décor and atmosphere reminds me of the easy going and nicely designed Italian cafe's in Rome.  And then I tried the food, which was great!!  Best Crepes in town.", "pics": null}}, {"review": {"des": "A great place for coffee and brunch! This cafe is reminescent of coffee houses in Europe, very dimly lit with interesting decor. I ordered the raspberry mocha to start. I's absolutely delicious! There is a light fruity taste that isn't overpowering. Then we shared the carbonara pasta in clay pot. WOW this is amazing! The cheese is soooo melty and the pasta is super savory with the perfect amount of bacon bites. We devoured it within minutes! We also shared a savory crepe- we got the Lyon crepe. Since we just finished the carbonara pasta, we weren't feeling the cheese in the Lyon crepe very much. I'm sure if we had eaten the savory crepe before the pasta, it would've been a different story! <br><br>The prices are very affordable. Service is great!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/wzzyxTNuTpcEXfkXJMLy9A/348s.jpg", "caption": "Cabonara baked pasta in clay bowl"}]}}, {"review": {"des": "This is a hidden gem in the city and I love everything of this place. The food was good, the service was awesome. This place is prefect for Saturday brunch. Or if you want a quiet place for a couple drinks with friends this would be good choice too.", "pics": null}}, {"review": {"des": "I got a Carmel iced coffee with almond milk. The coffee was ok but the atmosphere was meh. The lighting was very dark and I would usually be ok with that but for some reason it seemed off at this place. I also felt like I was being judged when ordering coffee. My friend and I both felt a weird vibe here. It was an ok spot, maybe just the workers that day.", "pics": null}}, {"review": {"des": "Love this place! Hidden gem for sure. Delicious salads and crepes. Next time I want to try a sandwich. The coffee is incredible. The iced mocha latte is life changing, trust me. Wifi is reliable too and the waitstaff doesn't hover but are always nearby if you need something. Very friendly, relaxed neighborhood vibe. It honestly doesn't feel like you're in Chicago, it feels like a European cafe (which it is). I've gone about three times in the past week and I honestly can't get enough! Highly recommend for a weekend brunch or late afternoon boost.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/aPKxeoUKujq6D5UcyZGAFQ/348s.jpg", "caption": "Greek village salad with smoked salmon added."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/y5txgdMu9-oq7mqAeUCCng/168s.jpg", "caption": "Roasted beets salad with walnuts. So satisfying."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/SetGPD7Cp7oiutBakDix3w/168s.jpg", "caption": "Chicken Caesar salad- so good!"}]}}, {"review": {"des": "They advertise that they have gluten free crepes in the menu. We asked the server before ordering if they were gluten free, she insisted they are.  When she brought it out, we again asked if it was gluten free, she said it was.  The crepes are 100% NOT gluten free.  My boyfriend isn't \"cross contamination\" sick, he's super \"this is gluten\" sick.  Don't eat here. Honestly, if you don't know what gluten free is, don't put it in the menu that way.", "pics": null}}, {"review": {"des": "Smoked salmon was delicious, tuna sandwich was decent. Smoked salmon was the perfect amount of smoke, and had a good taste to it. Tuna sandwich was decent, tasted like a basic tuna sub.", "pics": null}}, {"review": {"des": "One star because of a policy they have to charge $5 for every non ordering customer. I went with four of my friends for dessert and we ordered two items and a cup of coffee and were to share. The server told us that we needed to order two more items to avoid the $10 charge. I asked to speak to the manager because it seemed crazy to me but he pointed me to their menu that clearly stated this (picture attached). We canceled our orders, finished the coffee and left. Don't go here expecting to share.", "pics": null}}, {"review": {"des": "The carbonara is worth the hype. Almost told them to hold the bacon, but thank God I didn't. Napoli sandwich [sp?] was nothing extraordinary. Lava cake was tasty but not worth $9 bucks. Ambiance is relaxing and intimate, and I spotted the iguana cage but did not see the actual iguana. Maybe next time?", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/yNKhohdhubjJ5mbCbQH6aw/348s.jpg", "caption": "Carbonara and Napoli sandwich."}]}}, {"review": {"des": "Best tomato basil & chai latte ever!!! I'm a picky chai drinker but this won my heart", "pics": null}}, {"review": {"des": "I love coming here! The wide selection and all-day breakfast are god-sends and I'm always fully satisfied every time I come in. The service is always extremely pleasant and accommodating. I especially like that they have a full café and bar -- those go a long way in my book! Definitely a bit of a hidden gem, but I like it that way", "pics": null}}, {"review": {"des": "My wife and I only live less than a half mile from Iguana Cafe for over a year and we only have ordered delivery or take out about a dozen times but finally had the chance to dine in and loved it just as much as we LOVE the food!   The interior decor is very warm and comfortable and the wait staff were excellent<br><br>Now onto the food!   While we were not the biggest fans of the crab dip which is the only item we thought wad just okay, my wife is obsessed with their chicken caesar salads and i have always felt you really need to have a solid and unique taste for a general caesar salad to really stand out.  And i myself am OBSESSED with their pasta selections.   Unfortunately its so good that as much as i wish i could stop eating halfway and save a little bit of pasta heaven for later i continue to eat past the point of overeating and regret it later.   That last part was for sure a compliment FyI.  Most of the pasta selections are cooked and then baked.  This is really now the only way i cook my own pasta.   I have also heard their breakfast is amazing but we have yet to try that yet so looking forward to it!", "pics": null}}, {"review": {"des": "I gotta admit, this place sorta kicks some arse in a Euro Chic-ish way. Love the look, feel and vibe of the place and the service was completely on point.  Excellent drinks, great sandwiches in generous portions with quality ingredients.  <br><br>The gf intro'd me and the boy to this place on that semi-nondescript stretch of Milwaukee Ave and we will def be back.  Check it!", "pics": null}}, {"review": {"des": "Love this place. Food was great and staff was attentive and helpful. They have a great selection of lighter fare (hummus, artichoke spreads) and entrees (pastas, sandwiches, crepes, etc.). We've been coming here for years, and the quality of food has stayed consistent. The restaurant was recently renovated, but still has its charm. We will definitely be coming back.", "pics": null}}, {"review": {"des": "A small Chicago hidden gem ! I was with my boyfriend and mom and we all wanted some late night coffee (around 7:00 pm). I couldn't find any small coffee shops within the downtown area (aside from Starbucks) that were opened late. I used the Yelp app to search for a late night coffee shop and surprisingly enough, Iguana Café did not appear in my search! The only reason I ended up here is because I visited the place before and I remembered they have late hours of operation.  Whoever is reading this from Iguana Café- please make sure to list this out as a Late Night Coffee place because if I didn't remember, I most certainly would have ended up at Starbucks. Anyways, it was my boyfriend's first time here- he was absolutely taken aback by the atmosphere.  Lighting is incredibly important in any setting, as it sets the tone of your restaurant. Iguana Café is edgy yet romantic so their dimmed lighting is ideal for creating an intimate yet enjoyable experience. I can't recall if there are chandeliers but I do recall that every table had small plastic candles that really added flair to the table. The one thing I didn't like is that our server joined two round tables near the bathroom entrance and the main walkway as opposed to a more intimate corner. I had mentioned to them that we were coffee \"toasting\" a special occassion and I most certainly felt disregarded in that sense- if they wanted to, they could have placed us at a more intimate table. Not to mention, it was a tight squeeze, I could tell the people sitting behind me were annoyed by the distance between us as we were sitting down. The waiters had plenty of room to place us somewhere else but I hope this review will serve as a reminder that customer's seat preference (when seating is available) is extremely important to a great dining experience. The music was not extremely loud and you could actually hear the people you were with talk without screaming or shouting. I had a double shot cappuccino and my boyfriend had a strawberry smoothie and we shared a nutella, banana and strawberry crepe.  The crepe was so good- it had plenty of nutella, strawberry and banana. The crepe itself was cooked to perfection- not too thin but not too thick either with just the perfect serving size of nutella. I loved it! The cappuccino wasn't that fantastic- it had more foam than actual coffee- it may appear that you're getting a lot of coffee but then you realize it's just foam. I would go here again just to try the various other coffee selections available!", "pics": null}}, {"review": {"des": "Not a bad place for a date. Dessert crepes are the jam!<br><br>Been here twice now, once one a date (the veggie crepe, yessir) and most recently for a sweet bite with the man after dinner at the Dawson down the street. Service was a little slow, she seemed kinda ambivalent and then looked surprised when we asked for the check so soon. I dig the decor, although idk what the little shop area is in the front of the store. There's a tank above the bar area in the rear corner - what is it filled with?? Daresay an actual iguana?<br><br>Only 1 bathroom stall - must make for a huge line in such a small establishment.", "pics": null}}, {"review": {"des": "Excellent place for a quiet fantastic dinner. Salmon salad was outstanding!!! Ambiance was so peaceful. Not allot of seating but worth the wait.", "pics": null}}, {"review": {"des": "Lattes with a kick of alcohol, crepes with nutella, ice cream, sweets, I mean nothing but great things here.<br><br>I am from Los Angeles and we don't have anything like this out here or not that I know of. I've always enjoyed lattes with alcohol and they are pretty good here. I got to taste about three different ones and they were all good. I ordered the rum chata latte and loooved it!<br><br>Great place for sweets and hot drinks in cold weather!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/HxMNW8vbief4cPHu6zA4Iw/348s.jpg", "caption": "Yes!!!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/k3NKplInL6SolErCA-s8Mg/168s.jpg", "caption": "Latte with rum chata"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/kfZvsMFWHSH34A7L43quhw/168s.jpg", "caption": "Nutella, strawberries and banana with a side of vanilla ice cream"}]}}, {"review": {"des": "This place was a little hard to find. We were headed to the spa and wanted to grab some lunch beforehand. My fiance found this place and we decided to try it out. The food was so good! Also got a few drinks to go with lunch. We aren't always out in this part of Chicago, but next time we are, we'll be back!", "pics": null}}, {"review": {"des": "So while visiting Chicago after dinner we ( group of 6 ) were debating what to have for dessert. Well we Yelped locations and found this place. <br><br>Showed up to this place, as you walk in it looks very intimate, quick, low key dinner/cafe type place. We would soon find out they had more than just dinner and dessert. So we the menu showed us that they had \"hot\" alcoholic drinks which I have had before and have been very tasty. I ended up choosing the rum latte which was nicely soft and not to strong. We also tried their crepes which were very tasty and not too sweet. I would definitely recommend this place.  Their place is not large so smaller groups would be easier to get seats but we were 6 and they were able to accommodate us. <br><br>I will be back to this place whenever i am back in Chicago.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/dS30iC4P0-ex8noBKWfk1g/168s.jpg", "caption": "Rum latte"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/9XTqCdmC_I0lOl2VERAzYQ/168s.jpg", "caption": "Crepe"}]}}, {"review": {"des": "Iguana Cafe is an ideal Europian Cafe with cozy charm and welcoming atmosphere. Their hot chocolate is to die for! Their sweet crapes are the main reason I try to visit Iguana Cafe as much as I can. Tempting Trio is my absolute favorite! Savory crapes are also delicious, however crape portions are pretty sizable. I cannot finish both a savory and sweet crape in one visit, so I try to be strategic about what to order. If I'm not too hungry I usually order hummus and fresh vegetables, followed by one of sweet crapes. Sweet crapes are a must for me each time I visit Iguana Cafe. I have to mention that their pastas are also delicious! Food prices as well as drink prices are more than affordable for a place this close to downtown Chicago!! I strongly suggest you visit Iguana Cafe next time you are in the area, you will not regret it!!!<br>PS. There is a live iguana in the built-in wall cage.", "pics": null}}, {"review": {"des": "Want to break your diet with style? Come here! <br>They have healthy options but also great cheat food options.<br>We were by the area, saw the reviews, and decided to stop by. We had some iced-coffee with us, they don't allow outside drinks but let us keep ours as long as we emptied them in one of their glasses. <br><br>Napolitan and Carbonara pasta were both creamy cheesy deliciousness goodness. Tasted a lot like Mac and Cheese but with spaghetti. Worth a try, especially the Napolitan!<br><br>Bougasta with Nutella was amazing! There were three and we practically fought over the third. It was soft in the centre and covered in phyllo dough topped with syrup and Nutella. <br><br>The service was very friendly and service was quick, prices are also amazing for the quality and amount of food that you get. You will leave full and satisfied with no regrets!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Ac_u6VyHlx7PvHHbfV2-RA/348s.jpg", "caption": "Bougasta with Nutella"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Zcq7URrPQ4cMNyGdbsi_jw/168s.jpg", "caption": "Carbonara pasta"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/316Wy7OmYC879gqC5OnA9w/168s.jpg", "caption": "Napolitan Pasta"}]}}, {"review": {"des": "I stumbled upon this place when I had an intense craving for crepes. I guess I could say that I have a small obsession with them so I am always on the lookout for places that serve great crepes.<br><br>I got the classic Tempting Trio crepe (Nutella, bananas, strawberries) and my friend got the Tropical Pleasure waffle. The portion sizes are huge here so you are sure to get your money's worth. The taste, however, was pretty mediocre. Normally, I am able to scarf down crepes larger than the size of my face (this one was as large as my face) with ease, but I found myself having a hard time finishing my crepe here. The ingredients were pretty run-of-the-mill and I found the presence of Nutella to be a bit overwhelming, especially towards the end. After finishing the crepe, I was left feeling a bit nauseated due to the overdose of sweetness I had just consumed. My friend felt the same after consuming his waffle (he even added ice cream to it...big mistake).<br><br>If you have a huge sweet tooth, perhaps you should check out the Iguana Cafe. Otherwise, be prepared to experience an unpleasant overdose of sugar.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/hDuIJ-h6611i4WvtyZc_yA/168s.jpg", "caption": "Tropical Pleasure waffle w/ice cream"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/HZLX_hIh_nEnIZdJgNKqOw/168s.jpg", "caption": "Tempting Trio crepe-Nutella, bananas, strawberries"}]}}, {"review": {"des": "Okay place for morning drinks & breakfast. Service was pleasant. <br>Prices reasonable.<br>Crepe was large for $6.95, was able to take half home. It included spinach, omelet cubes, cheese, and tomato. <br>At this price point, I feel it was a fair deal. <br>I wasn't expecting to be wow'd, just a straight forward, no surprises crepe, which it was. <br>Boyfriend had the ham & cheese wrap. Again for $5.50 not expecting to be amazed, it was a solid no thrills wrap and for that price felt it was more than adequate.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/zFRpEqAuiCtg9d0EdLPs9w/168s.jpg", "caption": "Chai latte & regular coffee"}]}}, {"review": {"des": "This is me and my boyfriend's favorite late night spot. They're mimosas are divine!!!!!!!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/yHHGhFY64MTklUyptizp7w/168s.jpg", "caption": "Nombomb"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/TbozlS7Bg7di-1t7Vj6VKg/168s.jpg", "caption": "Best place for a date night."}]}}, {"review": {"des": "Great ambiance cool and close to the bus and train!!! Great Moscow mules and low key Greek style cocktails...", "pics": null}}, {"review": {"des": "I met some friends from grade school for brunch at Iguana Cafe yesterday afternoon and we had a great experience! Each of us ordered one of their breakfast or dessert crepes & we all enjoyed our meals.  I had the Coliseum breakfast crepe, which comes with eggs, spinach, provolone cheese, and tomatoes in a wheat crepe.  It had great flavor without being greasy and came with a small salad of mixed greens with vinaigrette on the side.  My friends got the Pantheon crepe and the Tempting Trio crepe and they enjoyed theirs as well!  <br><br>In reading other Yelpers' reviews prior to coming here, I would definitely agree that this restaurant/coffee shop has a European feel.  The staff was friendly and accommodating, giving us time to enjoy our meals and each other's company.  We never felt rushed and, as a result, spent more time than we typically do catching up when we meet up to go out to eat.  I think the quaint and relaxed vibe of this joint is reason alone to stop by!  <br><br>I would definitely recommend Iguana Cafe for a weekend brunch or lunch with friends.  They have a wide variety of fare on their menu, their drink menu provides something for everyone, and they take reservations.  I hope to be back with friends sometime soon!", "pics": null}}, {"review": {"des": "A cute little cafe on north Halsted! We went for a friend's dinner party there with a party of 10 and they were more than accommodating. The staff was friendly and the decor was cute but a little hard to see as the lighting was dim. A bonus point is that they're open late!<br>We had the baked goat cheese for appetizers, which was a bit dry and bland with a hint of tomato basil sauce. I ordered the spinach pesto pasta which was really good, but the highlight of the whole night was the dessert waffle! We ordered a European Dream and Sweet Addiction; both were heavenly and shareable. I'd definitely order this, even if you're just getting coffee.<br>All in all, a nice place if you're looking to chill with some friends or a date and share a waffle or two :)", "pics": null}}, {"review": {"des": "Seems like a nice cafe but it's not a good spot for getting a coffee and getting some work done with your laptop. It's more of a sit down restaurant.<br><br>I have no reason to mark it down for that though, I'm just removing a star because the speakers are very bad quality so the music they play sounds like a lot of clicks and it is a little annoying.  The wifi is also quite slow, but again, it's not a good cafe for working.<br><br>The coffee was dank though!", "pics": null}}, {"review": {"des": "Thanks to Iguana and DoorDash, I had a savory chicken crepe and a decaf ice pumpkin spice latte delivered straight to my door at 9 PM on a Saturday night. Food was delicious. Drink was yummy. I was lazy and totally comfortable binge watching Preacher. Priorities. it's the little things in life, folks. <br><br>The food was a decent portion. I actually had some left over for breakfast and a mid-morning snack. The coffee was really delicious. Probably one of the best pumpkin spice lattes I have ever had. The delivery was on time and the driver was friendly. Hey, if I can get that meal delivered to my door, and it was tasty, I have no complaints. Give it a try.", "pics": null}}, {"review": {"des": "Generally when I here the word café I think of a women's light lunch with dessert and coffee. This place does have dessert and coffee, along with a variety of light to medium eats, crepes, salads, wraps and sandwiches. In addition to the food, they serve alcohol, wine/beer and the harder stuff. <br><br>I had the Sparta, and it was perfect, in general I like any combination of spinach, feta and mushrooms. Add chicken and a crepe or eggs as an omelette and I'm a happy camper. Everything in this crepe was fresh and the chicken wasn't salty, which is a usual complaint of mine. I also didn't need to put any salt or pepper on it, as I said, perfect. I also enjoyed a a tasty white sangria, it was just the thing for a hot day, when the last thing you need is too much alcohol. <br><br>The vibe is bar like, dim with wood tables, not what I don't think about when you hear the word café. Perhaps, this is why there were more guys then women when I was here, this place had a different feel than Lutz or Selamarie for instance. <br><br>I wish I had stumbled upon this place sooner, but now that I have I definitely will be back.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/NmqEdbZPY_DlH2gmgISDWg/348s.jpg", "caption": "The Sparta"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/EdtWd43su5zdqgzNM6Mv1w/168s.jpg", "caption": "White sangria"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/R-uK4_R8JlmouRCT9bcGhw/168s.jpg", "caption": "Crepes"}]}}, {"review": {"des": "Me and my husband have visited this place more than once. The food variety is great. The portions are large and tasty so you always want more and try different things.", "pics": null}}, {"review": {"des": "Came here late on a Saturday nite and found the vibe to be relaxed and lounge-y. It was mostly groups and even a couple families. The menu featured beer, wine, cocktails, coffee, food, and desserts. The hours are 8am-2am and it seems like they were well equipped to serve all three meals plus cater to the late night crowd. <br><br>I had the hot chocolate with baileys, European Dream Belgian waffle, and the caramel crepe (can't remember the exact name). Everything was delicious, flavorful, and very rich. In my opinion, the portions were generous considering the price. My friend and I easily could've shared one dessert instead of getting two. <br><br>The service was fairly good although it took the waitress a little while to come to our table initially and then to take our checks at the end. This seems like a place that people tend to stay at for quite a while so perhaps the staff doesn't want to usher customers out. The waitress was very friendly and more than willing to recommend items on the menu. Someone would also come around and refill my water if it was even half empty. Overall, this place was great and I plan to return! Also, if you look toward the left on the back wall, you'll notice they have a pet iguana :)", "pics": null}}, {"review": {"des": "A cute and affordable European cafe open late! There is plenty of seating and good for bigger groups as well (try to make reservation) I love the ability to create your own crepes (sweet or savory) but I stick to my usual nutella, strawberry and banana! The pasta dishes are great portions and are a fair price, especially cheesy! The tomato basil soup is a perfect pick me up on a cold day. The frappe is authentic (Greek) and perfect to compliment your crepes. The sandwiches are also tasty. A big draw for me is the big menu and almost everything is customizable. The service is usually excellent and the servers are friendly. A cute spot for a quick bite to eat or a few hours catching up on homework/work or with friends!", "pics": null}}, {"review": {"des": "This place is amazing. I always get the pasta carbonara!! I ordered it for delivery late one night because it was the only restaurant delivering and I fell in love. <br><br>Definitely recommend! Try any of the pastas .. you can't go wrong!", "pics": null}}, {"review": {"des": "This place is pretty dope. Classy and relaxed. Food is really good too. Good show. Jolly good show.", "pics": null}}, {"review": {"des": "Great food friendly people but more than anything I love the atmosphere.<br>This is my  fourth time here in the last couple weeks and i becoming a regular.<br>Must try a chocolate delight crepe, and the blood orange infused old fashion.<br>The pastas are pretty good also.", "pics": null}}, {"review": {"des": "This place has a good vibe but we were not impressed by the food or the service. We ordered a wrap to split and it was basically just a mayonnaise wrap. I would not recommend eating here.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Kr5gbKmana_v-x2rKvcn5A/168s.jpg", "caption": "Food is full of mayonnaise...would not recommend this place."}]}}, {"review": {"des": "The decor is amazing. It such a cute little cafe. But upon arrival, we took the hostess a moment to sat us down. That should have been a trigger that everything else was going to be a wait. It took awhile for our crepe to come out when we ordered it the same time as our other food items. Then afterwards, the waitress too so long that we didn't even bother waiting on her to ask for our check so we just paid at the counter instead. It could have been a 4-star if their service was a bit better. <br><br>I had a croissant sandwich with sausage, egg & provolone. Nothing out of the ordinary. Simple and savory. <br><br>The table got a hummus plate to share and the hummus was really creamy so it was pretty good. I would recommend sharing this as an appetizer. <br><br>We also had the creamy caramel creations and the dulce de leche ice cream was what made it stand out. Really good crepe just wish there was more ice cream dab on top. <br><br>Can't wait to try other crepes!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/S_gXGrz0BsM-qCbaAG6ALQ/168s.jpg", "caption": "Croissant Sandwich with sausage, egg & provolone"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/80vDd_uB4V3lyoi-FBu3gA/168s.jpg", "caption": "Creamy Caramel Creations"}]}}, {"review": {"des": "What a great breakfast/lunch spot!  <br><br>Met up with some friends on a Saturday morning.  Huge menu...tons of breakfast crepes.  Fantastic coffee.  My only compliant was our server never asked to refill our coffees.  We kept having to wave her over.  The Acropolis crepe was phenomenal!  It had a fluffy texture with a great fresh mix of veggie & cheese.  YUM!  Hummus plate was HUGE!  Ton o hummus with pita and veggies...yummy!!!!<br><br>I would definitely go back here.", "pics": null}}, {"review": {"des": "Every time I'm craving something sweet I go here. This is hands down my favorite place to go!  Their savory food is awesome too! I would definrntly recommend trying one of their sweet crepes if you're going to stop in here! And the service is always great as Well!", "pics": null}}, {"review": {"des": "Best crepes in the city. I also really like their blood orange old fashioned cocktail, served with a large ball of ice. All the other food I've had has been really good, too. I highly recommend this place for breakfast, lunch, dinner, and drinks. They do it all! My favorite local place.", "pics": null}}, {"review": {"des": "Great food. Service was fast and appetizer were amazing! Really cool atmosphere too. Come back for sure!", "pics": null}}, {"review": {"des": "Crepe themselves were ok, but clearly made hours ago, the ingredients were all frozen/reheated with no taste except the Parma Ham which was very salty and more ham you would buy in Walmart.<br><br>The drinks were generous on the alcohol", "pics": null}}, {"review": {"des": "I'm definitely a fan!<br><br>We've seen IC many times and just thought of it as a coffee hangout which didn't really appeal to us.  Boy, were we wrong as it is so much more!  In fact, it has quickly become our go-to spot for good food, good cocktails, great service and awesome ambiance.<br><br>I highly recommend the key lime martini but my absolute favorite is the french martini.  If you are a fan of Chambord then you will be saying OOO La La in no time flat!  For food, they are very accommodating to their vegan friends.  I have had the hummus and the pasta with tomato sauce and neither of those disappointed me.  I look forward to many, many trips in the future so I can try some of the other menu items such as the veggie sandwich.<br><br>I think the two things that really keep us coming back are the amazing prices and amazing service.  I am remiss that I have not gotten our server's name yet but look forward to updating this review with her name.  She is on top of it and always friendly and knowledgable.<br><br>I highly recommend giving IC a shot (I hear the crepes are divine) because I recommend it to all my friends and family.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/XpM1wfyjj--Keqn1ZpeuHg/168s.jpg", "caption": "Pineapple sorbet!  Mmmm"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/qqr4ZZZsDMMHOplccfR8bA/168s.jpg", "caption": "DRINKS!!  Strawberry margarita and French martinis"}]}}, {"review": {"des": "The best place for crepes. I've had their sandwiches and savory items before they're not as good as their crepes but they're still very delicious. Their staff is really friendly and accommodating.", "pics": null}}, {"review": {"des": "The staff was quick to greet me, my waitress was very friendly and accurate, but most especially the food was fast and extremely delicious. I had the egg soufflé, definitely will be back for another soon. Plus the prices are good too. 10/10", "pics": null}}, {"review": {"des": "Best crêperie in Chicago! Service is great and fast, Nadia is the best of the best! Tip her well ;) Coffee is always great, food is delicious. Monte Carlo crepe, salmon salad and Sparta crepe are must try! Reasonable prices, cool atmosphere.", "pics": null}}, {"review": {"des": "This place is chill, low key and pushed off from a busy intersection (including the subway that runs below)<br><br>Sandwiches are simple and delicious<br><br>Cheap prices <br><br>Literally, a giant iguana cage (I assume?) about a story above the dining room<br><br>Will return", "pics": null}}, {"review": {"des": "Affordable cafe that provides late night options. Definitely a casual date spot - that dim lighting, close seating, a large iguana watching you from one story up... But really, it's definitely a date spot.<br><br>I had only been for coffee before, but I stopped by on a Saturday with two friends and came in for a late lunch/early dinner and found ourselves waiting... A little too much time passed before we were able to order, and a little to much time passed before we could get the bill (even when we had asked for boxes already). Eh.<br><br>We all got crepes, and they were affordable (sub $10!) and good portions. I love that they offer alcoholic coffee options!<br><br>Really cozy spot with decent food at decent prices. I will return!", "pics": null}}, {"review": {"des": "Cute spot with good atmosphere and decent food.  The Pasta was really good and my chicken sammy was average.  I found the staff to be a little salty but the food came out pretty quick.  Good late night spot if you are in the area but probably not worth a special trip there.", "pics": null}}, {"review": {"des": "Euro Cafe-- Great atmosphere, open late(!!). All kinds of crepes and various Espresso/Coffee drinks! Many other cafe and dinner options-- Haven't had a bad menu item. Perfect date spot. (Just hoping too many people don't find out about it!! It'll be our secret, ok?) ps. They actually have an iguana", "pics": null}}, {"review": {"des": "Came here for dessert after dinner (Velvet Taco) around 9pm Saturday. Our group of three was seated promptly, as there were a few open tables. Soon after though, the place filled up. The space is quite interesting. It's dark and intimate but with a fun eclectic vibe as well with the art and décor. This place seemed perfect for a date night.<br><br>I ended up getting a cup of the creamy tomato basil soup, a scoop of vanilla and dulce de leche ice cream and a hot pomegranate green tea.<br><br>Note that their portions are quite large. I thought my cup of soup was really the bowl size. Def not complaining. The soup was delicious and loved the texture as it had chunks of tomatoes in it and wasn't quite your standard tomato basil soup. The ice cream was alright, nothing special there. The tea was perfect and also came in a giant tall mug. It had the perfect note of pomegranate and was definitely brewed with loose leaf tea.<br><br>I tried my friend's 'Sweet Sin' and that was yummy. Those caramelized apples were perfect. My other friend's brownie a la mode (with mint choc chip ice cream) was good too.<br><br>Our server was great, even though she appeared to be the only one for the whole place. <br><br>Definitely need to come back for dinner and try some food and more offerings. Everything seems super fresh and affordable. Also great that they are friendly to those with dietary restrictions.<br><br>Location seems a bit odd but right by the Halsted #8 bus and the Grand Blue line stop and also walking distance to the West Loop-Randolph and Fulton Market areas.", "pics": null}}, {"review": {"des": "Pleasantly surprised! On the walk to this location, I was a little nervous about how the quality of the food would be- but all in all great experience. We ordered a couple glasses of champagne and the goat cheese, sun-dried tomato pasta. It was very good, but very cheesy! Definitely enough for 2 people. I wanted to come here specifically for the crepes and they did not disappoint. We had the banana foster with a side of Nutella. Perfectly caramelized bananas and the crepe was perfectly made and folded. More than enough for 2 people!", "pics": null}}, {"review": {"des": "This place has delicious food from the amazing and savory salmon pasta with large bits of it within the pasta. The actual sauce was delicious and not too thick. The waffle was huge both the sinful one and the tropical one were delicious and were not overpowering in taste. I love the food here and its not too expensive for the amazing taste.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/NHIGGJQtTEaZZ7MC0IfdiQ/348s.jpg", "caption": "Sinful waffle"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/WeRlokw_wNunKkj820I9YQ/168s.jpg", "caption": "Salmon pasta"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Ow6oo4I9OOeATIbzmPSdaQ/168s.jpg", "caption": "Waffel"}]}}, {"review": {"des": "This place never seizes to delight me with their European Dream (Belgian waffle with a diabetics nightmare drizzled all over).  I've been here a few times with friends, and we can all agree that their dessert menu is a force to be reckoned with.<br><br>As for their service, the server that brings the water out is very pleasant, but the one who takes our order is a bit rude.  She is so impatient with taking our oder.<br><br>The specific experience I'm referring to is when I came with a friend once and ordered promptly.  The server came out with our dishes, and I very politely and gently said \"oh wait this is actually his dish\" as she placed the wrong plate in front of me.  The moment I said that, her eyes opened up wide as if I had delivered some horrible news to her.  She stared at me for a good 5 seconds, and then switched the dishes and walked away quickly. <br><br>A few moments later, I requested for her and said that they had made a mistake.  I nicely explained that I had asked for extra nutella on my waffle and not my friend because they stuffed his crepes with an excessive amount.  She apologized and came back out with a whole jar of Nutella.  I was baffled as to why she had done that.  I told her that was way too much, and her remark though rude made me giggle \"don't worry you can take that home with you, I'll pack it.\"  <br><br>All in all, that was a very odd experience, but I do highly recommend this place.  I hope that lady really sees this review and gets a laugh out of it but also treats us more properly next time.", "pics": null}}, {"review": {"des": "If you like spinach, then their spinach salad is perfect for you! I literally mean that as it is almost entirely only spinach. It is advertised as having goat cheese, strawberries, and walnuts. This is true so much as maybe 2-3 cut up strawberries total and a light sprinkling of cheese and walnuts. But it was like they walked into a grocery store and simply bought an entire bag of spinach to resell at $10+. Would not recommend.", "pics": null}}, {"review": {"des": "Cool atmosphere, big portions, delicious crepes-- this has become a favorite date night spot for me! The two times I've been here for dinner, I've opted for pasta (oven baked in a clay bowl with a nice layer of cheese on top!) and crepes, and I definitely recommend both! The first time we came, my date and I were overenthusiastic and ordered a pasta bowl and crepe each-- oops! Way too much food! This past time we shared an appetizer (crab dip- yum!), the carbonara pasta, and a crepe. Even that was too much food! <br>It looks like everything on the menu is delicious, but I'd say order conservatively-- you can always tack on a crepe or five at the end if it's not enough food ;)", "pics": null}}, {"review": {"des": "Such a cozy cafe! Our server was super attentive and prompt with our order. They have an extensive drink list and the coffee was excellent. I loved the ambience of the place. My wrap was a little mushy, however, the pasta and crepes looked delish! I also love that they are open late in case people want to hang out or study. Definitely recommend:)", "pics": null}}, {"review": {"des": "ordered the salmon sandwich and the spinach pesto noodles, both were horrible. worst thing i have ever eaten.", "pics": null}}, {"review": {"des": "I love their dessert crepes! Chocolate delight is always a go to. Pasta's were ok, probably would eat before and come only for dessert and coffee. I tried their Canoli crepes and it was a nice change in taste. Service however is not good. I went with a party of 5 and the wait staff charged 20% gratuity. The wait staff weren't too polite and they didn't come around to check on us. I got the feeling that our waiter was annoyed with us. Would probably go again though because they have good dessert.", "pics": null}}, {"review": {"des": "This is my favorite neighborhood restaurant. Service is always great and food delicious. I love their hummus,wraps and crepes are to die for.If you sit at the bar you can clearly see how your crepes are being prepared.They have full bar and prices are unbeatable.Danka is my favorite server but all the employees are very friendly.", "pics": null}}, {"review": {"des": "Felt I was transported to a Europe . Nice little cafe spot . I went for brunch and had a savory and sweet crepe . Good crepe . Nice service .", "pics": null}}, {"review": {"des": "It was late night and I was our craving something sweet so I decided to check the place out based on the reviews and I was not disappointed at all. Service was friendly and helpful and the food and drinks were amazing. I definitely want to come back for breakfast when I'm in the area", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/bs_rI41UrgP6mksjlVdKHQ/348s.jpg", "caption": "Bougasta with ice cream and nuttella"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/S3gbW7v9RVTk_UJzif8hAQ/168s.jpg", "caption": "Almond joy crepe"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/HNOcdnSpiOaZ1HhOX8embg/168s.jpg", "caption": "Chai latte"}]}}, {"review": {"des": "Really cute place with a great atmosphere. <br>The server was a little abrupt and I don't think she smiled at all but the crepe was good. We had the chocolate delight which comes with Oreos. It's fantastic. <br><br>Also, there are actual iguanas in here which I did not expect. Definitely recommend.", "pics": null}}, {"review": {"des": "Have been coming here since they opened and agree with the reviewer that it can be hit or miss.  The food is pretty reliable - we commonly order a table full of apps and dig in.  This past weekend was bruschetta, hummus platter and spicy mac & cheese.  All is priced very decently for the portions and neighborhood. Oddly the staff (really...all the staff??) always seems kinda spaced out but mostly in a funny way.  Worse case you just have to up to the counter to get your bill.  I'll keep going....its convenient, decent enough and rightly priced.  I'll also admit I have a soft spot for them just because I've been there since the beginning.", "pics": null}}, {"review": {"des": "Awesome breakfast! They have a giant menu, literally pages long, with everything from sweet and savory crepes, to waffles, to insanely delicious looking fruit salads, and so on. They even have a bar and I noticed an apple mimosa that caught my eye. I fully intend to try it next time. <br><br>Yelpers raved about the crepes so I already knew that's what I would be ordering. Good luck deciding which one because they all sound wonderful. I picked one called the Tempting Trio, made with strawberries, bananas, and nutella. It was the size of my head and under $6. I think I was able to eat a quarter of it before calling quits. You can't beat that much delicious for such a small amount. Would be a great place to share food with friends and try a little of everything without breaking the bank. <br><br>I also ordered a sugar free vanilla latte that was creamy and fabulous. You would never guess it was sugar free. This is one of the coolest breakfast spots I've been to in the city. The inside is welcoming, and you leave in a high of sugar and caffeine. Is there any better way to start the morning?", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/cQZw1e0pZ9_N67JxULHSgg/168s.jpg", "caption": "Tempting Trio crepe! Strawberries, bananas, and Nutella"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/86h6DrdNZAl-0KZIKtxz1Q/168s.jpg", "caption": "Sugar free vanilla latte"}]}}, {"review": {"des": "Good food okay service.<br><br>Delicious gluten free chicken and pesto pasta. Hot and warm bread with fresh house made cheesy spinch and artichoke dip. Ok chicken wrap but not enough chicken. Fresh house made raspberry lemonade.<br><br>Customer service 1 star. No one greeted us upon entering establishment, server did not introduce herself, ask if we had been there before, or offer any information about the restaurant or their menu, and  rushed us to take our order.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/x8jelSaCoUQE_MOh0MlVkw/348s.jpg", "caption": "Gluten free chicken and pesto pasta"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/WnV-2AcSNJZxq0py-E51FQ/168s.jpg", "caption": "Raspberry lemonade"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/_wAVyZjpXoNuD_fUviCjrw/168s.jpg", "caption": "Spinch and artichoke dip"}]}}, {"review": {"des": "I would recommend 11/10, best pasta I have ever had in mahhhhh life. Everyone should definitely come here more often, I know I will be!!!!!! Dis is my new favorite place to go to", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/QW2JlFJx7VS4HWwhMD9zWg/348s.jpg", "caption": "Chicken pesto pasta!!!!! 33(:(:"}]}}, {"review": {"des": "The Good<br>This is one of our favorite post-dinner spots for my husband and I.  Open late-night which is nice when you are looking for a place to go after 10PM (and when most other places are closed)<br><br>The Better<br>Prices are reasonable especially for entrees - their Tuna Sandwich on french bread is always so good and filling.  Crepes are big enough to be shared, and coffee is always good.<br><br>The Best<br>Hands down the Chocolate Monkey, Chocolatey Delight and Nutella Peanut Butter Cup are always great choices if you are big on chocolate crepes.  My personal favorite is the Nutella Peanut Butter Cup crepe with a scoop of their chocolate ice cream.  It will not disappoint!", "pics": null}}, {"review": {"des": "I've been to Iguana MANY times and absolutely love their pastas and desserts. Never had an issue and the staff is always friendly. I'm giving it two stars because recently I planned to surprise my best friend there with a cake for her birthday. We planned to all have dessert and then have her blow out candles and cut her cake. A few of us got there early so that we could have the staff hide the cake for the time being, that's when the manager told us there's a $20.00 fee for bringing in an outside cake and cutting it. We were taken aback. The birthday girl was on her way and it was too last minute to change dessert spots. I didn't understand why that is the policy, I've never heard a restaurant with that policy. We planned on ordering food, so we really weren't trying to just take advantage of them to cut the cake. We had the waitress ask the manager again since we weren't aware of this policy, and he gave the same response. By this time the birthday girl was here with another friend. We decided to order hot drinks and coffee instead. Outside of the restaurant I handed her the cake in a box with unopened candles and explained the situation-what a way to end a birthday on an awkward note. Do I plan on going back to iguana? Absolutely, as long as it isn't anyone's birthday. But am I upset at the way they handled the situation? Yes.<br><br>Update on my comment: George, I was never told that if I ordered food I can bring in a cake. If I had been, we would have definitely ordered a few dishes. I think there must have been miscommunication. It really came off as we don't allow any outside cakes on any condition. So yeah, we decided to order hot drinks instead.", "pics": null}}, {"review": {"des": "It was my first time visited this place and I like it. If you wanna try something new and delicious you should visiting this place )", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/MS6dfpnK6R40CeshlbU8aA/348s.jpg", "caption": "And the dessert) with Nutella , banana and strawberry) so delicious"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/qsIfQ_qprXgzhqI3B6vPPQ/168s.jpg", "caption": "Pasta with marinara sauce"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/5l5we6epnkLXpllWFWWiRg/168s.jpg", "caption": "Appetizer Mozzarella cheese and basil"}]}}, {"review": {"des": "Moved to River West a year ago, and this is my new go-to place to meet for coffee.  They make one of the best lattes in Chicago, steaming hot with lots of foam, served in an oversized stoneware cup.  I pair it with a half-serving of bougatsa, a custard wrapped in phyllo , topped with Nutella, dusted with powdered sugar and served warm.  Sure beats the boring pastries at Starbucks.<br><br>  <br>But the main attraction here are the crepes.  I'm trying to cut down on gluten, so I split a  gluten-free desert crepe with bananas and strawberries, and it was yummy.  (Leave your carb counter at the front door.)  Lots of Mediterranean influences like spinach pie, fresh wraps and sandwiches, and a good selection of dinner entrees.  My favorite salad is the smoked salmon, which doesn't look like much when it arrives, but is light with fresh ingredients.  Love both the Mediterranean cafe ambience and the affordable pricing.  There's an okay wine list (the reds are better than the whites), and a tiny stand-up bar.  Good selection of bottled beer, including my favorite Guinness.  <br><br>Some reviewers have commented on the slow service, which has occasionally been a problem when it's busy, but I prefer it to being rushed to make way for the next diners.  Plenty of paid street parking.  One suggestion to the owners:  add  an omelet to the menu... took a family group here for brunch a few months ago, and there were no egg choices for the protein lovers.", "pics": null}}, {"review": {"des": "If this neighborhood cafe we're going swimming it'd definitely wear a speedo. From the crepes and coffee to the ambiance and atmosphere it certainly has a sensation of a European spot. <br><br>It's kind of a cross between a sit down restaurant and a coffee shop. There's free wifi and the menu is very cafe-like, but you don't seat yourself and you have an assigned server so I'm not sure how cool it is to post up for an entire day with your laptop. <br><br>Regardless of whether I overstayed my welcome or not the service was great filling up my water five minutes and being super friendly. The food was awesome and affordable, but I wasn't thrilled on the coffee which is the only reason I wouldn't give them 5 stars. <br><br>If you're in the area I'd definitely give them a try.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Qb37fAak2oGshOitg3YitA/168s.jpg", "caption": "Chicken Pesto Sandwich"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/0zVq11ogAHluynjhKT7jFg/168s.jpg", "caption": "Coffee"}]}}, {"review": {"des": "This place has a relaxed and casual vibe.  They offer a ton of different items, but my friends went for the crepes.  While I'm usually not a crepe person, these were actually pretty good.  They have a nice menu since there's a ton to choose from and there's enough to keep everyone happy.<br><br>Very reasonably priced as well!", "pics": null}}]}