{"name": "imperial-lamian-chicago", "reviews": [{"review": {"des": "Made this a part of my to-eat list for Chicago when I visited for the first time back in June. I've seen Imperial Lamian appear on several food-related FB pages, like Insider Food, so it was def hyped up for me. <br><br>We were conveniently seated next to the cooking area so we could see the chefs make all the food which was really fun to watch!<br><br>For food, my friend I ordered these:<br>- Combination XLB, including Original/Shanghai, Spicy Szechuan, Gruyere, Crab, Truffle, Duck (6 pieces)<br>- Fried Platter - Pumpkin Puff, Crispy Wonton, Spring Roll (6 pieces)<br>- Flight of mini egg tarts for dessert<br><br>Also a little disappointed that we weren't able to order everything we wanted... there were some items that apparently were only available as brunch or lunch items and we didn't know beforehand :( <br><br>Unfortunately both my friend and I weren't feeling super well that day so our experience wasn't the best. Nothing on the food or restaurant at all though, our immune system just sucked that day :( <br><br>I also called quite a few times back-and-forth with management to schedule and reschedule my reservation, which was very accommodating of them!! :)", "pics": null}}, {"review": {"des": "Came to Imperial Lamian twice now. Must have to say the service is the main reason for the mediocre rating. Food is unique and decent, but definitely overpriced.<br><br>Both times coming to Imperial Lamian, we made our reservations on OpenTable and had no problem with seating once we arrived. However, the dining room wait staff was lacking in the service department. <br><br>During our first visit, the staff were fine and the experience of trying fusion Asian-Western dishes was definitely interesting. The waiter did a great job of explaining the dishes and getting us excited to try different things. I very much enjoyed the cheese and truffle XLB's, though my friends didn't quite appreciate it. The beef noodles were very comforting to eat as well. Unfortunately, there were really long periods of time between each item we ordered but we were a group of friends catching up who hadn't seen each other for a while so it didn't bother us that much.<br><br>During our second visit, upon being seated at our table it took more than 45 minutes before we had our orders taken by our waitress after she greeted us when we sat down. We were contemplating leaving our table due to the extremely long wait but once we started to pack up our waitress came hurrying by (seemed like we were forgotten and packing up prompted the staff to realize we were waiting for a long time). She didn't apologize for the wait but acknowledged that we had been waiting for a long time by staying \"Just wanted to make sure you guys had A LOOOOOT of time to look at the menus. Wow, all your waters are empty too! Are you guys ready?\". My friend was quite upset and notified her that we've been waiting for an overly long period of time and that we tried to get her and the other staff's attention for more than 25 minutes. She sheepishly just took our orders and was never heard from for the rest of our meal. She only reappeared to hand us the bill. No apologies were made nor was there any effort to rectify the long wait before our orders were taken. Additionally, like our first visit, the food took a long time to come out initially and there was a prolonged period between each dish coming out.<br><br>Bottom Line: Personally, I wouldn't come back on my own accord after my second experience here. If a friend planned a group outing here, I would still attend but after voicing my experience of long waits (wait times aren't as bad when you're with friends but 45 min to order is pretty ridiculous). Food was decent (worth trying the unique dishes once) but not worth the hefty price tag (inflated by at least 200% than other great Asian restaurants in the Chicagoland area) and the slow service leaves an abysmal impression.", "pics": null}}, {"review": {"des": "Please go for a great experience and a more fancy take on Chinese food!<br><br>We were luckily seated right by the noodle pulling station and was able to watch the head chef cook! It was very cool to see! We ordered the beef brisket lamian ($16), char siu and wonton lamian ($16), combination XLB ($12), gua bao ($10), and salted egg buns.<br><br>The beef brisket was v tender and easily pulled apart. Both noodles were good and filling! It tasted much better seeing how it was made. However, the broth was p bland (I'm used to more flavor); I'm guessing the focus was meant on the other elements of the dish. For the soup dumplings, they were actually v flavorful and great; my favorite was the spicy Szechuan! The gua bao was a good balance with the crispy cabbage to the pork belly and steamed bun. Finally, the egg buns were my favorite!!<br><br>I ended up taking away a star only because my family did not enjoy the meal as much. I really think this restaurant is great because nothing is oily, the service was good, and the decor was pretty. The ability to see the chef making the noodles really made our meal special.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/yGounb_88gp_Q3csmtbk6w/348s.jpg", "caption": "Beef brisket lamian + egg ($16+1)"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/B9VO8eAN_EJExMhCUQHf1Q/168s.jpg", "caption": "Gua bao ($10) and combo XLB ($12)"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/SLjsQpTP9gdbe4f9MMFQ2A/168s.jpg", "caption": "Char siu lamian ($16)"}]}}, {"review": {"des": "crazy seating arrangements. not good for big parties as mentioned in this yelp page!!!! We have reservations for 7:30 pm but was told we were here being early at 7:15 pm. But the party for 9 behind us was seated already before 7:30 pm were  seated and they are NOT even complete.<br>We even asked for the 9-table seat coz we are a big party but they said they can't coz it's reserved for another party which never came and they have to separate the table for the 9. Just disappointing.", "pics": null}}, {"review": {"des": "We stopped by here last night around 5:30pm for a quick dinner.The host quickly seated us and gave us the happy hour menu and the dinner menu. The dinner menu is a lot. Each page is a different category of food which take a bit of time to get through it all. The happy hour menu is a small paper and easier to follow. Soon after were seated the server came over and asked if we had an initial questions or food allergies. I don't each pork and asked her to point out some of the non pork items. She was happy to do so and explained each of the items in enough detail for me to get an idea of what they are. <br><br>Only negative comment I had about the menu is that I wish it was more clear as to which items were pork based and which were not. The Xiao Long Bao were all pork based but that was not as all clear on the menu. I was slightly disappointed because I was looking forward to trying some of those and if i had known ahead of time I wouldn't have gotten my hope up to try them.<br><br>We decided to try things off the happy hour menu. It's was co cheap and so good. We got the shrimp dumplings, beef brisket la mian and crispy chicken buns. <br><br>The shrimp dumplings were fantastic. It was full of shrimp and very flavorful. <br><br>The beef brisket la mian was good but different. All the ingredients come out in separate bowls and you mix it together to make a big bowl. The brisket was so tender that I was easily able to break it apart but i wish it came shredded rather than one large piece. I ended up having to shred it with my fingers. The noodles were cooked to the perfect consistency and the bone broth was hot and light. I asked for hot peppers on the side and added those to my broth. It gave it the perfect heat. It's a smaller portion than dinner menu option but it was more than enough for me.<br><br>My husband was a fan of the crispy chicken buns. The chicken is fried and buns are a little thinner than what you usually get but it still worked. The aioli wasn't as spicy as we thought it would be but the server brought out a hot sauce for us.<br><br>From the dinner menu we ordered the fried platter. It comes with 2 veggie spring rolls, 2 shrimp dumplings and 2 pumpkin shaped dumplings filled with duck. The pumpkin dumpling was unlike anything I've ever had before. It was filled with duck and very soft. They give you a sweet and sour sauce that compliments it well. I did notice the spring rolls had a little more mushroom than what you usually expect but I love mushrooms so I didn't mind it. The shrimp dumpling was very simple but good. In all of these dumplings they put a huge quantity of ingredients inside the dumplings so when you bite into them you get a mouth full of ingredients unlike other places that are very light and barely filled. These items were 100% deep fried so they can be happy. I'd recommend sharing it.<br><br>We had a really good experience and definitely want togo back to try other items. I still wish some of the soup dumplings were not pork based but the other items made up for it.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/lTeSZBj-4AhoK4CHxnjxSw/348s.jpg", "caption": "Beef Brisket La Mian"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/zew4pXRbNLZwVp05_9Mj0A/168s.jpg", "caption": "Fried Platter"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/oCMpJPtjq-T7CPFx8DzvOg/168s.jpg", "caption": "Hot peppers"}]}}, {"review": {"des": "Came here to check out the unique twist on XLB but it was ok.  The ratio of dough to soup was off and the dough was dry.  Maybe I was spoiled with my experience in Beijing but this place was nice to get my XLB fix as there aren't many places in the Midwest that serve it.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/tWLrOQcLUFblMLJ0I0U5aQ/348s.jpg", "caption": "The regular soup dumpling"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/BeObM0mO7eu03_lJiiLsFg/168s.jpg", "caption": "Hainanese chicken was delicious"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ysPgo7lYsPnRRTFOkuItfA/168s.jpg", "caption": "The noodles were ok.  The broth definitely lacked flavor."}]}}, {"review": {"des": "Wow this food was pretty good. The host staff seemed a bit confused on how to manage tables, but once we sat down it wasn't too bad. I was intrigued by all the fancy xiao long bao, but it the end just kept it simple with the Shanghai. It was good, but the skin was a little too thick on the top and it felt like the insides suffered as a result. <br><br>We also got the calamari and the crispy prawns, both of which were actually amazing and well worth the money. The crispy prawns are coating in this wasabi aioli that was actually the best interpretation of an aioli I think I've ever had, and since the shrimp/prawns were crispy, the entire experience was just enlightening. The calamari were good too, though I could argue for them to be a little crispier.<br><br>This place is super easy to find, so if you're in the neighborhood (and probably should make a reservation), definitely check this place out. It -is- a little pricey for this kind of food, fair warning.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/CQf_3nYI4Z7tTzQzPwP3VQ/348s.jpg", "caption": "Crispy Prawns"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/CFdSXzeiGdnrU3Le31dnOw/168s.jpg", "caption": "Calamari"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/BvB6ZdnD5JcUu4maJXbtwQ/168s.jpg", "caption": "Shanghai Xiao Long Bao"}]}}, {"review": {"des": "While there are other places that may have better dim sum, if you ever want dim sum and great hand pulled noodles, Imperial Lamian is worth checking out.  The kitchen has a large glass window, so you can see the chef (who's actually Chinese!) hand pull the noodles.  You can definitely taste the difference when you try the noodles, and we had the char siu pork and wonton noodles.  The broth is light, and the noodles are perfectly springy and chewy.  The pork and wontons are a nice salty addition to the noodles, and I would be satisfied with just the bowl of noodles. <br> <br>But wait there's more!  We also ordered a few dim sum items - the sew mai with pork and shrimp, the combination xiao ling bao, and the scallion buns.  The sew mai were pretty standard and comparable to other dim sum places.  However, it tasted fresh since there are no dim sum carts here and everything is made to order.  The combination xiao ling bao had a few interesting flavors - such as cheese and truffle, so it's not your traditional dim sum.  However, the ones I tried were pretty tasty, and the unique flavors were at least worth a try.  The scallion buns were light and fluffy, and the steamed dough creates a slightly sweet, satisfying flavor.  This was a nice contrast to some of the other saltier items, so I'm really glad we ordered the buns.  The XO Chicken fried rice - chicken, xo sauce, bean sprouts, scallion, was surprisingly one of my favorite dishes!  It's served with a unique rice tortilla/cracker on top, and the flavors of this fried rice just work very well together.  The chicken in some fried rice dishes can get dry, but this chicken was tender and delicious.  The xo sauce had just the right amount of saltiness, and it was great to eat this fried rice with the other items.<br> <br>If you're looking for traditional, old school dim-sum, look elsewhere.  However, if you can open your mind and be open to a trendier place that incorporates modern flavors (and décor) into its dim sum menu, then Imperial Lamian is a great place to try!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/VCtmj4FprMwprs-5wD-yIw/348s.jpg", "caption": "scallion bun - fluffy pillows of yum!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/8Mx00Aj169Od9zeRfEBgBw/168s.jpg", "caption": "Cool looking menu"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/d901PdmCe4aHvM8BH_UVFw/168s.jpg", "caption": "Char Siu and wonton la mian --- hand pulled noodles of goodness!"}]}}, {"review": {"des": "This place is pretty good just not their noodles. I had good chewy pulled noodles before so that's the only thing that's disappointing. The XLB is pretty good but the skin is a little thick compare to DTF but I still enjoyed the flavors in it. XLB mix of cheese, duck, truffle, crab, regular and spicy. The pumpkin was ok but love the presentation. Their cocktails good. The spicy wonton is good. <br><br>The best part was the dessert! So beautiful. Well presented! My aunts and uncle loved the mini dessert surprise. Inside is a pandan sponge cake with cream and almonds topped with ice cream. It feels like Christmas when you open your gift to see what's inside.  Oh and service is great! 4 Star!", "pics": null}}, {"review": {"des": "Had an excellent meal at Imperial Lamian with my husband. Our server Kenny was very attentive and made excellent suggestions. We started out with the Fried Platter Dimsum. It was delicious, came with pumpkin puffs, crispy wontons, and spring rolls. We liked all three, but the pumpkin puff was especially excellent. I ordered a Hibiscus/spring flower drink, with mezcal and the rim sugar was so good, really complemented the drink. We then split two entrees, the wok fried la mian with shrimp and the char siu & wonton la mian. Both dishes were very flavorful and amazing. They make their noodles in house everyday so they were very fresh, never knew how much of a difference that could make. Will definitely be coming back!", "pics": null}}, {"review": {"des": "Not the cheapest place, but the quality is great.  Specialties are xiao long bao and hand-pulled noodles but there are many other dumplings and more typical Chinese dishes.  Decor is nice, service is excellent, and there is an army of people making food including the dumpling line that's on one side of the main dining room.<br><br>Definitely worth a visit.", "pics": null}}, {"review": {"des": "Props to the host seating us and the server for being very forthcoming about the happy hour which was just closing at 6 even when I walked in 5:52. A lot of places like to pretend that they don't have a happy hour and then I feel so awkward asking about it, but that wasn't the case here. <br><br>As many have mentioned, their happy hour is an amazing deal to sample different foods. The best part I think is the drink list which is limited but much cheaper than their normal drinks. I highly recommend the siewmai - so good!!! For the lamian.. The broth was super tasty, but the noodles were just OK. The happy hour portion was good. <br><br>Of course we got the infamous rainbow XLB. I'm not the best judge but they seemed pretty good. Our favorite was the spicy szechuan. I thought I would like the truffle but didn't much. <br><br>Great service despite the fact that our server also had to work as the bartender (poor guy) and the ambiance was nice. Want to come back for the cool looking lunar dessert!", "pics": null}}, {"review": {"des": "I recently went back and was surprised to see some new items on the menu.  They added salted egg fried string beans and squid ink pulled noodles, both of which we ordered.  <br><br>Likes<br>+ it's always great to add new items to the menu, especially unique dishes that others <br>+ we were seated next to the kitchen and could see the magic happening. Did you know that they weigh out the meat in the soup dumplings?<br>+ squid ink noodles with shrimp has a nice al dente chewiness to them and a slight kick to the XO sauce<br><br>Dislikes<br>- salted egg fried string beans were a little to eggy that it overpowered the appetizer. Also, the batter and string bean was softer/soggier than I had expected. It was the first time that I've ever had this dish. The salted egg flavor reminded me of the mooncakes with yolk. I enjoyed it but wouldn't reorder<br><br>Overall, while this place has some unique dishes like the combo soup dumpling and squid ink pulled noodles that are worth the price, most of the dishes are overpriced and better in Chinatown.", "pics": null}}, {"review": {"des": "Wonderful experience celebrating my husbands birthday. <br><br>The reservation was super easy to do through open table. We arrived a few minutes late due to uber rides but they were super nice about it.  <br><br>It took a bit for us to decide what we wanted because there were so many options to choose from. We shared everything - which I highly recommend. <br><br>Started with the dumplings sampler and the crispy appetizer (cant remember the name but it was all the crunchy things) the dumplings were pretty but the flavor was just kinda okay. A few bites were better than others but it wasnt bad. The crunchy tray was fantastic and I couldn't get enough of it. <br><br>We also split the pork belly buns (specially made for us), ramen and chicken. <br><br>Everything was so good. The service may have been the best part really. The waitress was attentive and nice and they served everything as it was made which was super fast. <br><br>They surprised us with the fancy chocolate desert and it was heaven. The chocolate was phenomenal. <br><br>I'd recommend this place for groups or dates for sure.", "pics": null}}, {"review": {"des": "Probably walked past here a boatload of times and nothing drew me in but I recently heard they offer a modified Dim Sum menu on Sundays so on impulse, decided why not? It was not very crowded and was promptly greeted by the hostess and soon after by my cheerful waitress. Also the ambiance inside was much ničer than the street view into it. <br><br>Upon reviewing the menu, 3 baskets of Dim Sum were ordered: a 6 piece combo Xiao long soup dumpling ($12), a 3 piece pork belly Gua Bao ($10), and a 4 piece shiitake mushroom steamed bun ($8) which came out one by one in cute steam baskets on bamboo platforms but that's about where the positive review ends unfortunately... asked the food runner and two other waiters to bring plates/utensils and some hot mustard to dip into... meanwhile the manager came to the table asking if I was enjoying my meal. Well to avoid awkwardness, I said \"this is a first time here. Are we supposed to eat with our hands over the baskets or would it be possible to get plates, napkins and some utensils?\" (Really I had to ask FOUR separate times for this very basic need!) grrr!<br><br>Granted he seemed annoyed at my comment, he did send some over right away with those. I asked this person for hot mustard. Without a seconds delay, \"sorry, no hot mustard\" was the response and dashed off... not even offering any other sauces that might be available. Uhm ok. <br><br>Then the busser came by to clear my table and I had to inform him I was still eating. He gave me the most odd expression then started to laugh. No idea why but he must have thought it was funny enough to tell his busser-buddies because suddenly I had three šets of eyeballs fixed on me all chuckling... just so awkward! <br><br>Then because of the SOUP dumplings, a soup spoon was proving necessary (yeah eating soup with a set of chopsticks just was not working out for me lol) so I waived down my waitress and she had to go all the way to the back of the Kitchen and came out appogizing that they were just coming out of dishwasher. Hey, its all good & maybe it was an \"off-day\" but restaurants should offer two things: (1) Good Food (2) Decent Service... otherwise y'all may as well eat home! <br><br>Honestly, the Dim Šum was only so-so as compared to other plačeš accessible in the City. Not a ton of filling but they had decent flavor/špice. Just a bit salty. The presentation of them though were really pretty - especially the multi-colored soup dumplings (see in picture). I admidt, I might not have rated at 2-stars but the service basics were so neglected its hard to award more stars!! <br><br>I did glimpse at their standard menu and it looks as though they have a lot of things worth trying so perhaps I'll give it another chance.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/9B6aiO3fsvBeE1dxuTGYHA/348s.jpg", "caption": "Decor between tables..."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/PE3t31Ye_TXXsH3KLQxs7w/168s.jpg", "caption": "Sample all 6 soup dumplings"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/CznXq1mqrZRSBrKVjrtktg/168s.jpg", "caption": "Dim Šum menu..."}]}}, {"review": {"des": "I sat in the bar area and from the moment I walked in the manager and my server were really attentive. <br><br>I went with the soup dumpling combo and hot and sour soup. The latter was so very distinct and I'm glad I got it...the latter standard but still yum. I love how creative they got with the soup dumplings and I was not disappointed. <br><br>Pro Tip: Stick with the proven method for consuming soup dumplings.... let them cool a tad bit, pick one up with your chopsticks from the tippy top of the dumpling, dip in your vinegar sauce, bite a tiny bite to let the delicious broth out into your spoon, then enjoy!!! Otherwise, you burn yourself and/or spew the broth everywhere.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/aLWmwdTut_SZn2xwDK3uQw/348s.jpg", "caption": "Yes. Money! Delish."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/qFYkLEVTJLZHo8m6jl5zhA/168s.jpg", "caption": "Thought tamarind would make for a great drink. It was ok but could be stronger."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Mj0yVjTtzT6-0WOGFJWuTA/168s.jpg", "caption": "One of each please."}]}}, {"review": {"des": "I was really excited when I saw the Lamian restaurant near our hotel. But after trying it, I was disappointed. Although it has undoubtedly great location and decor, the food itself was upsetting. <br><br>Starting off with the Jasmine Milk Tea, I have never tasted a worse milk tea in my life. It doesn't have tea, or even disappointing too sweet of a flavor. It is simply undrinkable. <br><br>The Soup Dumplings were just okay too. Given how they brag about this item, I had a high expectation. But let me tell you, it's about 1/3 good as DingTaiFeng, the real soup dumpling MVP. The wraps are sticky and too floury like, with the meat inside diced too much, hard to tell what it is. We had the combination, and it is a shame to say that it's hard to tell one from one another. <br><br>The Lamian is just okay. If you had Lamian, it is hand-pulled very stretchable and smooth noodles. But unfortunately, the noodles here are too thick and breakable, with the undefinedness. The flavors and soup base is good, but I don't think it's worth $15.", "pics": null}}, {"review": {"des": "This place had great vibes but shit food. Rather eat fermented garbage. Everything that came highly recommended was absolutely disgusting. We tried about 8 different dishes and only enjoyed the Reese's that we found in one of our bags at the end", "pics": null}}, {"review": {"des": "Came here for dinner during a downpour. This place has a great atmosphere and awesome food presentation. Grabbed the Shanghai XLB, steamed Basket and braised pork belly. While not the best XLB I've had, it was still pretty good. The steamed basket was standard fare and the braised pork belly lamian was tasty. Would come back again on my next visit.", "pics": null}}, {"review": {"des": "My husband and I stopped in for a late dinner on Sunday and the restaurant was still pretty busy, which is always a good sign. I've never had dim sum so we started with the steamed variety bao and they were delicious! My favorite was hands down the truffle. At the risk of over ordering we winged it and got wok fried sea food Lamian dish, chicken fried rice, and jasmine tea ribs. <br><br>  The least exciting dish was the chicken fried rice. Honestly we ordered it trying to play it safe in the event we didn't like the other stuff, and we probably wouldn't order that again. Everything else was delicious! Like amazingly good. The ribs were hands down the best part and I regret sharing with my husband. For dessert we ordered the blossom cake which is visually dope, but it tasted even better than it looked. <br><br>  The prices were super fair considering the location too which made us so happy. Overall we will keep going back over and over again. I can't say enough about how good the food was. Also, the waitress was super nice and attentive and the manager kept doing rounds and checking in. Really what more can you ask for.", "pics": null}}, {"review": {"des": "I was here for brunch this morning and I'll preface this by saying that I was hesitant from the start about paying $$$ for dim sum in River North. The best dim sum is usually found in a styrofoam container in Chinatown for $5. That being said, I was looking forward to seeing what their xiao long bao was all about. <br><br>I hate to say it, but the pictures are better than the real thing. I got the combo xiao long bao (the rainbow ones you've prob seen in the pics) and they were lukewarm and stuck to the bottom of the basket so 5/6 of them broke before I could put them on my spoon. Flavorwise, the crab and duck were the best by far. The char sui was unlike others I've had anywhere- usually it's soft and fluffy- this was crunchy and sweet which I didn't love. The best thing we had were the szechuan wontons although the consistency was off. The first order was also lukewarm and the second order was significantly hotter and spicier which we preferred. <br><br>Overall for $140 for 3 people I would have expected a lot more, and it took a really long time to get hot tea refills.", "pics": null}}, {"review": {"des": "The food, ambiance and service are excellent. The restaurant is nicely decorated with clean and airy space. We're seated by the window where we can watched the Bao, dumplings and noodles are made.   We ordered the Xiao long Bao combo, Fish of the day and the squid ink noodle with beef. All of the dishes are delicious. Each Xiao Long Bao is tasty. I especially like the truffle and crab ones. The skin of the Xiao long Bao has perfect thickness and they're very juicy. <br><br>The squid ink noodle were cooked perfectly al dente and nicely flavored. The bean sprouts add. Ice texture and a squirt of lime juice surely brighten the dish. <br><br>The fish was grilled and charred nicely. It's has a nice flavor of sweetness and a hint of cardamom.<br><br>We ordered the Lunar blossom for dessert. The presentation was impressive. The pandan cake itself is nice and light. Unfortunately the chocolate sauce overpowered the pandan flavor. You have to eat the cake without the chocolate to enjoy the pandan flavor.", "pics": null}}, {"review": {"des": "The Char siu la mian at this restaurant is literally one of the best things I have ever eaten. Char siu is Chinese barbecue pork and la mian is a traditional hand pulled noodle similar in thickness to ramen but with a more mild taste and softer texture. The dish at Imperial Lamian has a good serving of pork, bokchoy, cilantro, scallions, and the most flavorful wontons In the city. Add a soy egg (soaked in an anise or Chinese 5 spice soy sauce) and a good spoonful of chili paste to increase the flavor, add a creamy texture, and up the umami factor. <br><br>Best noodles I've had outside of China. Easily. That said, it definitely caters to American tastes.<br><br>For example, the Szechuan wontons are just ok. They're tasty, yes, but there's nothing Szechuan about them. I was expecting wontons in chili oil and crusted with chilies but instead they arrived in a soy and rice wine vinegar sauce that had no heat. <br><br>I really shouldn't have expected much heat to be honest as it's definitely not a Szechuan restaurant. The restaurant seems to be painfully aware of American palates and goes easy on spice whether from chili or ginger or even onion. <br><br>Jasmine, my server this evening, was fantastic. Great to chat with and helpful. Her timing was fantastic throughout my meal as well, which I appreciate. <br><br>Is it bad that I'm thinking about canceling tomorrow night's reservation to eat at IL again?", "pics": null}}, {"review": {"des": "Meh. Had been wanting to go here for a while because I had heard great things from food magazines<br><br>I thought the prices were inflated but, I am not one to complain about price if I feel the food is worth it. Felt the food was good, just a little underwhelmed. The dumplings were smaller and less filling than I have had at other places<br><br>Left a little underwhelmed, maybe I hyped it too much", "pics": null}}, {"review": {"des": "I am so incredibly happy with my experience. Went with a colleague for a bite after a conference. Made a reservation as I went on a Friday around 6 and didn't want to wait. <br><br>First of all- great atmosphere. Trendy but not in your face but still feels authentic. <br><br>Second- service was EXCELLENT. Morgan was wonderful. Attentive but not all over us, gave great suggestions and guided us through the menu. <br><br>Third- two words. SOUP. DUMPLINGS. Drooling. <br>We ordered the Shanghai and Szechwan dumplings, the pork belly noodle dish and the red pepper beef. Also ordered a pot of tea.<br><br>Honestly I'm so full and I'm so content with this meal. After a windy rainy day, my soul was warmed with soup dumplings. Didn't take any pictures as I totally dove in. Well worth the stop!!", "pics": null}}, {"review": {"des": "Best soup dumplings I've ever had in the states! Will return every time I'm in Chicago", "pics": null}}, {"review": {"des": "Fiance made reservations for us to have dinner here after he proposed :) It was a place that I've been excited to check out for awhile because I love soup dumplings and their menu looked of interest.<br><br>Nice interior, was busy, loud noise levels. We were seated at a high 2-top with very high chairs next to the bar. Not the most romantic atmosphere and seating.<br><br>If you go here, know that it's on the pricey side for the food you get because there are better places for soup dumplings, Chinese food, ribs, etc. <br><br>If you do go, I recommend their xiao long bao ($18) and jasmine tea smoked ribs ($26). Pass on their char siu and wonton noodle soup ($18); the broth was good, but was bored by this noodle dish. Also ordered a dessert that, while fun, wasn't repeatworthy.<br><br>Knowing what we know, I don't think we would go here again because there are better places that do what Imperial Lamian is trying to do; it didn't succeed in standing out or meeting conservative expectations. Fiance had mentioned when making reservations that it would be a special dinner after proposing, but the service didn't make any mention of it so he wasn't pleased about that part.<br><br>3 stars.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/sCw9uIPefl-PNNZkMkh-iA/348s.jpg", "caption": "Jasmine tea smoked ribs ($26) - wok smoked baby back ribs, jasmine, imperial bbq sauce"}]}}, {"review": {"des": "I'd return, even though I gave it two stars. It seems like a very nice place, and I think I just had a bad experience.<br><br>The atmosphere is lovely - so classy and so detailed! The service was slow for how not-at-all-busy it was, but it was friendly.<br><br>I liked my hot and sour soup, and my friend liked her noodles, but my combination BBQ bowl was awful. It was plain rice (didn't eat much of it), and then a bunch of steamed, plain meats. They were full of fat and gristle and basically inedible. It was honestly disgusting. The items here are ridiculously overpriced, ostensibly because of location.", "pics": null}}, {"review": {"des": "(4/5) environment: nice and clean environment.<br><br>(3/5) pricing: a tad bit overpriced for the taste/quality of food<br><br>(3/5) food: for the Xiao long baos, the crab, spicy and pork were the best. The rest were very different or overwhelming in flavor. The bbq combination platter was not that flavorful. The wok fried lamian was not that impressing either. The pumpkin appetizer is definitely overrated. Not much flavor.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/mLBp6VstFx8kKUVIb07-eg/348s.jpg", "caption": "Crab xiao long bao. Delicious."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Ll0nvwrDnZ_EA0YVyKkYdQ/168s.jpg", "caption": "Duck xiao long bao. Very strong taste."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/zVvOR5KcgCSBuDq_F4y2vg/168s.jpg", "caption": "Black truffle xiao long bao. Overwhelming."}]}}, {"review": {"des": "Went here for a date night and love it! Everything is great, the ambiance, the service and of course the food. Our favorites are combination XLB, Peanut lamian with pork belly and Lunar Blossom (love that pandan cake!). Definetly will back again for another date night!", "pics": null}}, {"review": {"des": "I've been itching to try this place out for a while now because it's such a modern and trendy take on Chinese food.<br><br>I arrived early with my guest about 15 minutes before my reservation and the host told me it would be closer to my regular reservation time. No biggie, we headed to the bar and sipped on some beers while we waited. I had a Japanese pale ale which was quite light and refreshing.<br><br>We were sat at smaller two top table in the corner which was nice and excluded so we could have decent conversation without having to yell at each other!<br><br>The waitress was kinda rather awkward but still sweet at the same time. The food was delicious as well. We started with the combination dumplings which were delicious, but also very tiny. I ended up getting the chicken ramen and my date ordered the pork belly. They were delicious but we also noticed that the portions were very tiny.<br><br>Overall the experience was great, the flavors were there and the food was delicious but I sadly ended up leaving hungry and for the price that was slightly disappointing.", "pics": null}}, {"review": {"des": "I was in Chicago on business and was in the office late. I was starving and in the mood for Asian so I went to my trusty Yelp app and found this place...and I was glad I did!<br> I was able to walk right in and get a table in the bar area on a busy Thursday night. There were a lot of good choices on the menu, but I settled in on the Szechuan wontons and two types of xiao long bao (crab and gruyere). Everything I had was absolutely amazing! I would definitely go back so I could try other things on the menu!", "pics": null}}, {"review": {"des": "We came on a Thursday night just in time to catch the end of happy hour! The ramen choices and portions are great. <br>We tried cha siu wonton ramen, spicy mushroom ramen, gua Bao from happy hour menu. Highly recommended the cha siu ramen and gua Bao! <br>I can't imagine if we had to order regular size ramen, because we won't be able to try anything else. <br>We had hot and sour soup, green beans, and Shanghai Xiao long Bao from dinner menu. The soup was too salty. Hence the four stars. <br>Shanghai Xiao long Bao is hands down  the best in Chicagoland. <br>Green beans are so flavorful and cooked with spice and minced pork. We almost licked the plate! <br>Overall, the happy hour menu is a great value. The dinner price is average for the area.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/knA3imTXDU8JIyxX717t7Q/168s.jpg", "caption": "Spicy mushroom ramen from happy hour menu"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/BKBeODH948jWesJaXoK-FQ/168s.jpg", "caption": "Cha siu wonton ramen from happy hour menu"}]}}, {"review": {"des": "This is an interesting concept for a Asian restaurant in the middle of downtown Chicago. Reading the menu, I guessed that this restaurant has a lot of Southeast Asian influences. Then I found out that the owner is from Indonesia. The XLB are interesting since they have nice fusion varieties. The truffle is a good fusion combination, however my taste cannot agree with the cheese one. The black ink noodle was really tasty. A little more XO would enhance the taste. I would definitely recommend the grilled fish since it was garnished with tasty spices.", "pics": null}}, {"review": {"des": "I'm gonna have to change my review due to a bad experience. BAD SERVICE FROM A FLOOR MANAGER. Came here for my birthday. My whole family came here to surprise me. I had no idea they were coming. Our tables were separate, which was fine with us. Even tho there was a table unoccupied next to them. We had the rest of the party just come to one table to surprise me together. The floor manager was very rude to my family. Telling them they couldn't stand there and that they had to leave. They were only there for a few minutes. I get it, you're doing your job, but you didn't have to be rude to my family. The whole night really, he would just give a bad vibe to my family. Didn't make them feel welcome. I believe the managers name is WESLEY. We're still paying customers. No need to be rude. NOT A PLACE FOR LARGE PARTIES. They charge minimum $1500 for private dining. And don't bother bringing a cake. They charge $2 PER PERSON TO CUT YOUR OWN CAKE. Ridiculous. <br>THANK YOU WESLEY FOR THE UPSETTING BIRTHDAY DINNER.<br><br>Reply to lee -<br><br>Like I said, I understand the minimum for private party. Also, we were fine with separate tables as discussed. They just came to surprise me. That's all. BUT, the point was the rudeness of your floor manager. The entire night. Food was great don't get me wrong, but that's only part of it. Service is the other half. We just did not appreciate the attitude he gave my family. Almost made them not enjoy the dinner. We wouldn't have a problem if he just had simple kindness. <br>Thank you though.", "pics": null}}, {"review": {"des": "Love the noodle soups. Our favorite is the chef recommended peanut noddle soup. The noodle is hand made and the texture is so soft. The desert lunar blossom is must try.", "pics": null}}, {"review": {"des": "I came here for dinner on a Saturday night, the place was quiet busy. We left our name/phone number and after 30 minutes we were able to seat at hour table. We didn't like the table they first gave to us but the restaurant manager was very kind and immediately moved us to another table when it was available.<br><br>I love the style and the atmosphere of this place. I decided to came here for their famous colored dumplings. We had 3 platter of different kind of dumplings/ appetizer and all of them were really good. I highly appreciated the pumpkin one! As a main course we got the noodles with lobster and seafood...I just wished there was more seafood, but still a great dish.<br><br>The best thing of this meal was the dessert!! Ice cream and a very soft cake under a sphere of white chocolate...which is melted by some hot chocolate poured over the it.  couldn't get enough of it even though I was full! <br><br>An extra point goes to the kindness of the manager cause my friend forgot his parking ticket in the restaurant and the manager waited for us to get back there even if the closing hour was passed!<br><br>HIGHLY RECOMMEND!!", "pics": null}}, {"review": {"des": "Tried this place while visiting for a conference, and my coworker and I were interested in trying this place when we saw they have xiao long bao.<br><br>Per dish that we ordered:<br>Pork and shrimp XLB - 4<br>Shanghai XLB - 3.5<br>Chinese pork lamian - 3<br>Green beans with ground pork - 5<br>Salted egg bun - 5<br><br>Server was kind and talkative with us. It was sweet that she was looking to improve her chopstick skills and offered to split our lamian for us, and we didn't mind as we weren't in a rush. Waters were always refilled.<br><br>I'd recommend trying this place during happy hour so you can try different dishes for a lower price, to help determine if you'd want to splurge on more items or try this place again in the future.", "pics": null}}, {"review": {"des": "Tried this place for lunch because we walked past it. The interior is beautiful, and we got sat next to the cooks making various items such as dumplings. It was so fascinating! We tried dumplings which you can see in the photos. Both were good but small servings. Pro tip: ask for their chili paste. Now this is probably my favorite thing here! It has anchovies in it. I wish could buy this in a bottle.", "pics": null}}, {"review": {"des": "The food are so cute and unique in their own ways. I want to try more food but we cannot finish it so will definitely come back a few more times  So far my favorite restaurant in Chicago", "pics": null}}, {"review": {"des": "I expected more... I went during happy hour to try their Lamian (noodle soup) -$6 and Shanghai xia lang bao (soup dumpling) - 4pcs for $7. First, the server was nice but the guy who seated me was pretty rude. Second, food presentation was decent. However, the soup was too salty for me. I wanted some good warm noodle soup on a rainy day, but I couldn't even enjoy the soup because it was too salty :( and the noodle texture wasn't that great. I usually expect handmade noodle to be chewy and have great texture, but this one wasn't that great. Soup dumpling was average... I had some better ones. <br><br>Interior and atmosphere was good and food came out rather quickly so I'll give them points for that.", "pics": null}}, {"review": {"des": "1. Go with a group of friend so that you can share several food items.<br>2. Definitely get their unique, colorful soup dumplings - you get 6 of each type for $12 which is a pretty good deal. One downfall is that they are quite small, but you do get the instagram worthy photo. My favorite were the duck (green) and truffle (purple). <br>3. Get the Har Gao and Char Su! It's a good balance - steamed and baked, shrimp and pork, sweet and savory. <br>4. Interior: modern with Chinese influence. Try to get a seat by the cooks so that you can see the dumplings being made!<br>5. Dress code: pretty casual I'd say", "pics": null}}, {"review": {"des": "If you're craving soup dumplings, this is the spot for you. They have everything from your traditional Shanghai Xiao Long Bao to gruyere and truffle. While I can't speak to the more out there flavors, the Shanghai XLB were incredible.<br><br>Followed it up with the Vegetable La Mian, which was also delicious and a ton of food! The atmosphere is very trendy and cool -- having an open kitchen is a plus. I love to watch the process behind making dumplings.<br><br>Will definitely be back to sample some other items off the menu!", "pics": null}}, {"review": {"des": "My first time at Imperial! The waiter was beyond amazing. Was able to explain the entire menu in details, went during happy hour! I tried the wontons for an appetizer. They were perfect a little hint of spice and the sauce just right. The chicken broth was great as well. Wasn't out of the box, but presented well. To end my meal I tried to lotus buns! Just enough cinnamon in the inside for your sweat tooth. Loved how the place was decorated very modern, rustic, contemporary", "pics": null}}, {"review": {"des": "On my way here, I was super excited because I saw pictures from a friend who went a few nights ago. We came in on a Tuesday night and the place was already crowded. Thankfully we were seated right away. Our waiter's name was Yesenia and she was very nice and cute. While ordering, I told her that I have a shellfish allergy and I wanted chili oil on the side. The beef brisket noodle soups that we order tasted great but I didn't get my chili oil and I even asked for it when she brought out the food. Several minutes later, still nothing. I made long eye contacts with her several times but it seems like she was trying to ignore me??? Overall, the food was good but it could have been better. I highly recommend the salted egg bao. It was the only dish that met my expectation.", "pics": null}}, {"review": {"des": "Was searching for noodles close to Michigan ave for carb loading prior to Shamrock shuffle run. Found this place and called to ensure they could have a table for 7 of us.<br><br>Very impressed with decor which was  pretty trendy and unique. <br>We ordered a bunch of stuff for the table. Started with Shanghai xiao long bao and the colorful combination xiao long bao: shanghai, truffle, duck, crab, cheese and spicy Szechuan. The winner was traditional Shanghai which were wiped out quickly by kids. <br><br>Next wave came with noodle soup. We have mushroom, pork belly, and Chasu with wonton noodle soup. The winner is Porkbelly which came with nice pork broth and big chunk well cooked pork belly. Noodles tasted like fresh made. <br><br>Entrees are whole fish and Shanghai style chicken. Both are excellent. Shanghai style chicken won slightly. Whole fish was grilled nicely with cumin flavor. First time trying this.<br><br>The dessert round was definitely the highlight. We were debating Pandan cake in Lunar Blossom for a while and trying to figure what is Pandan.  All Chinese at the table had no clue on Pandan neither in Chinese nor English. So we consult our awesome waitress who highly recommended this dessert. It came as a full moon on a huge plate. With the hot chocolate pulled over the moon, it opened up and showed the cake and ice cream inside. It was such an unique \"Wow\" show for kids and adults. And it tasted great too. <br><br>We have already talked about this and plan to come back to take a video for the moon opening process.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/j6uJHuk8xUipIznlGZUfMA/168s.jpg", "caption": "Luna Blossom after"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/XxKk3lLEPdI4bNrl6RmlfQ/168s.jpg", "caption": "Lunar blossom before"}]}}, {"review": {"des": "Visiting Imperial Lamian was one of the highlights of my recent trip to Chicago. It was everything I wanted it to be and more and it was a destination experience. <br><br>I chose Imperial Lamian because it was reputed to have the best XLB / soup dumplings in the city.  The XLB did not disappoint (other than the fact that one came to the table having already popped).  I tried the combo with 6 different flavors and it was impossible to pick a favorite.  All had a delightful broth, all were juicy and tasty when eaten.  <br><br>I also tried the char siu Lamian (soup with hand-pulled noodles).  Actually we split one dish among 3 people and that was perfect.  The soup and noodles were absolutely delicious and reminded me a bit of the noodle soups I had in China.  The pork in the dish was less appealing as it was chewy and difficult to eat with chopsticks.  <br><br>Last, we tried the Lunar Blossom dessert and the salted egg bao (based on positive reviews here on Yelp).  Unfortunately, the Yelp check in offer no longer applies for a free bao.  The bao was interesting, but an acquired texture and I wouldn't necessarily order it again.  The Lunar Blossom on the other hand was a work of art (culinary, visual and performance art) and an extremely tasty dessert.  The Lunar Blossom could easily feed four people and is quite an experience in itself.  It's a must to try at least once.<br><br>The service we received was also great - from the waitress who helpfully made recommendations and explained the dishes to the man who frequently refilled our water glasses and expertly served the Lunar Blossom.  <br><br>I LOVED my experience at Imperial Lamian and I know I'll want to go back every time I visit Chicago.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Wy2W5-OM8sHf2ot8BuYNTg/348s.jpg", "caption": "Salted egg bao"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/U7xDoDum3ap_nE_uZWRGWw/168s.jpg", "caption": "Lunar Blossom dessert - opened"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/P_9EB8ehwXL9-JtcKqnsbQ/168s.jpg", "caption": "XLB combo"}]}}, {"review": {"des": "I had a wonderful experience here this last Monday! I came specifically for the beautifully colored xiao long bao and they did not disappoint. <br>They came out quite quickly and steaming hot in their bamboo steamer. They were so pretty!! Each color was a different flavor and I can't even tell you which was my favorite. They were so flavorful! <br>I wasn't too hungry initially so I didn't order anything more but their happy hour menu looked really good. It included some good dim sum options as well as drink options. I would love to come back and try them out!<br><br>So happy I was able to stop here!", "pics": null}}, {"review": {"des": "Imperial Lamian has been on my list for a long time and last Sunday I finally had time to check this place out with my friends. We are all from China so we were very looking forward to this brunch. We had the xiao long bao, shaomai, Lamian, and some other small dishes. The Xiao long nap was pretty good and beyond expectation! Love it! The Lamian was also very delicious, and we all liked it. I will definitely come back and try more dishes!", "pics": null}}, {"review": {"des": "Slid in here for lunch was looking forward to some good eats.  The restaurant wasn't crazy full, which was nice.  Service was just ok, a little on the slow side given that the place wasn't crowded.  We did a few different types of soup dumplings - with the original being our favorite, and we ordered some other dim sum pieces as well.  They were good but definitely not up to the caliber of a Din Tai Fung or other XLB places that set the bar.  We did do a bowl of noodle soup with the pork belly.  Noodles were pretty good (hand-pulled and cooked well) and the broth was thankfully not overly salty.", "pics": null}}, {"review": {"des": "Was in the neighborhood and decided to give this place a try. I was skeptical at first because I am a frequent Chinatown patron. It's hard to compare the authentic Chinese food in Chinatown with a more \"touristy\" feel Asian fusion restaurant as this one is. You will get good customer service, English speaking waitstaff, and clean bathrooms, in addition to modern Americanized Chinese food. It is much pricier,  though, but it is not fake like PF Changs. We were impressed by perfectly cooked sweet and sour pork and Shanghai chicken. The XLB was colorful, but the texture was not as perfect as I've had at other dim sum places. I like to think of it as a place with a different angle on some traditional Chinese dishes without extending too far out of the box. I was pleasantly surprised and will definitely return to try more.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/kBFsE5F1G2E8jOwMZoWphw/348s.jpg", "caption": "Sweet and sour pork"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/u62HtakBLCBuYl1gGvdB7Q/168s.jpg", "caption": "Duck fried rice"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/tACOv4HpXgva4kAfdnRlbQ/168s.jpg", "caption": "Assorted XLB"}]}}, {"review": {"des": "On the outside, this restaurant looks quite grand and spectacular. Unfortunately, I cannot say the same about their food. I am always wary of places that charge high prices for Chinese-style foods. My friends and I ordered the Shanghai and Truffle Xiao Long Bao to share along with the Steamed Basket of dim sum goods. At $7.99 for an order of only four pieces, the Xiao Long Bao were pretty damn expensive. The truffle ones were not bad, but I could also go to Chinatown and pay the same price for double the amount of Xiao Long Bao. Not impressed. The steamed basket tasted like normal dim sum but had a much steeper price tag attached. I am definitely willing to pay up for food, but there was nothing special about this dish that made the price feel justified. For my main dish, I ordered the Beef Brisket La Mian. The broth was average at best and the meat was so hard and tough I could barely chew it. Unfortunately, the noodles tasted soggy and didn't have that \"bite\" that I was looking for. <br><br>Overall, I was pretty disappointed by what I had at Imperial Lamian. To me, it was just another overpriced meal under the guise of the hip and trendy atmosphere.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/UHHKITbNxvBmZN0Dpn3XUA/168s.jpg", "caption": "Steamed Basket Dim Sum"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/MuwbW-N2EUl7BxDlTr9DeQ/168s.jpg", "caption": "Truffle Xiao Long Bao"}]}}, {"review": {"des": "Easily made a reservation online same day and got to sit at a table alongside the open view kitchen which was great watching them hand pull noodles and make wontons by hand. We enjoyed the soup dumplings and la mian noodle bowls but from what I could see leaving the kitchen you really can't go wrong with anything at this place. Magnolia blossom tea was great on a cold day. I would definitely come back.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/OUDgbo98YPzQqDzHURTqjQ/168s.jpg", "caption": "Soup dumplings"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/flUzCmXMKkc9JuzjLFDlmw/168s.jpg", "caption": "Pork belly Lamian add soy egg add char sieu"}]}}, {"review": {"des": "This is a nice-looking restaurant, but sadly, for a meal that ended up costing me around $60, the food was pretty underwhelming. I ordered some tea, 2 appetizers (steamed basket and fried platter), and a bowl of beef brisket noodles. All items were sub-par. <br><br>The beef brisket noodles lacked flavor - from both the brisket and the broth. Texture-wise, the beef was very dry and the noodles seemed to fall apart very easily, as if they were not freshly cooked. Considering it was $16, the toppings were also very sparse - pretty much just a few greens and some cilantro. I'm willing to pay more in this type of setting, but perhaps not twice the price for half the usual quality. <br><br>The appetizers were a bit finicky - they looked really cute, but everything lacked substance. Portions were pretty small for $12 each. The spring rolls were sparsely filled with veggies and almost everything lacked flavor (even the dipping sauces!). <br><br>If you really want to try this place, it's the type of place where you want to go on a date that you're not paying for and you also don't really want to commit to that person cuz they probably don't have taste buds.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/N_dlJCvbJ9FdjrL7oKobzQ/348s.jpg", "caption": "Beef brisket noodles"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/0FJ2-o0HRAsbCNvqsO7q_Q/168s.jpg", "caption": "Fried platter"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/o54kvkOmClxp3_EJDCBUfQ/168s.jpg", "caption": "Steamed basket"}]}}, {"review": {"des": "Imperial Lamian was on my list for places to visit in Chicago, and I couldn't be more excited. <br><br>I love the interior design and the decoration of the place. I thought it was genius. I love the view of the bird cages light fixture when you first walk in. Furthermore, the restaurant used the design of a abacus as a divider between booths. <br>Our waiter was friendly and very caring. He took care of our table very well and I did not have any complaint. <br>The food were delicious! As someone who LOVE dim sum, this place definitely did not disappoint. I ordered the combination soup dumplings along with the duck and truffle soup dumplings. They were full of flavors. From the first bite to the last, I was able to fully get all the decadent flavor of the soup and the meat were perfectly seasoned. I also ordered shrimp siu mai and har gow. I am really happy with how they turned out. Everything were just so delicious. <br>Overall, I really enjoyed my time at Imperial Lamian. I would definitely come back here with my friends next time.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/SGjq2z0kPSqzUgs_BGzhug/348s.jpg", "caption": "Interior"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ByXSsdBT2dqwGDO5RI7HNA/168s.jpg", "caption": "Interior"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/TVARtvkthQacxtO6xoNQZw/168s.jpg", "caption": "Truffle soup dumplings"}]}}, {"review": {"des": "We came here for lunch because warm noodle soup was called for thanks to the 45 degree rainy weather. We order the char siu and wonton noodle soup, truffle and szechuan soup dumplings.<br><br>We were told that all of the dishes are made for family style meals, so the portion sizes were large enough to share. While there were plenty of noodles in the dish, I wish there was more broth to make it seem more of a soup dish. The dumplings were also not quite as 'soupy' as I was expecting, but they were tasty and held together well. Service was great which is always a plus!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/sOF3B3KfwMG4hRwdITK1fg/168s.jpg", "caption": "Truffle soup dumplings"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/-Xw-SOTV5wVSJvsFG6n3_Q/168s.jpg", "caption": "Szechuan soup dumplings"}]}}, {"review": {"des": "Came here during happy hour after work with some friends. The decor is really upscale and it is certainly more \"fancy\" Chinese food as compared to any other place I've been to in Chicago that I can think of right now. The happy hour is essentially half off of select foods which makes it pretty good value. <br><br>I got the Szechuan wontons, beef brisket hand shaven noodles, pork belly gua bao and the typhoon as well as a saketini (which wasn't on the menu!). The Szechuan wontons I definitely wish had thinner wonton skin and was a bit spicier, but was good as a dish if they weren't one of my favorite dishes in Asia. The pork belly gua bao was surprisingly good, the guabao was thin and kind of came apart when you tried to pull it out of the steamer, but the pork belly was flavored really well, thick and delicious and just fatty enough. <br><br>Both of the cocktails were good as well, the saketini being surprisingly strong, it tasted mostly like cucumber and I enjoyed it despite not liking sake too much. The beef brisket noodles were a very small portion to my surprise, but the happy hour menu calls it \"a bite of noodles\" in Mandarin anyway so it is true to form. The noodles were well made and tasty and to my surprise it was clear bone marrow soup instead of braised soup which is the more common form of beef noodle in the States. The beef I felt could be braised longer so the taste really permeates, but overall not bad. <br><br>I've heard the seasonal fish is pretty good, and I would love to try that if I were to visit again!", "pics": null}}, {"review": {"des": "I'm not fond of the colored dough, but the traditional xiao long bao (soup dumplings) at Imperial Lamian are the real deal. I've had both the traditional pork and the crab version here, and they've been perfectly balanced and very flavorful. I highly recommend both.<br><br>With the exception of the string beans with minced pork and olives (a fine version, but tiny portion), and the Hainan Rice (which is very hard to find and excellent here), you can really pass on everything else at Imperial Lamian. The lamian (hand-pulled) noodles are fresh, but the broths and wok-fries in which they are served are disappointingly pedestrian. Same for everything else I've tried from the dinner menu.  <br><br>Stick to the XLB. I will defintely come back for the xiaolongbao, but probably wouldn't order anything else here again.", "pics": null}}, {"review": {"des": "The chef recommended squid ink Lamian was less than stellar. The noodles were somewhat irregular and stiff, not chewy or bouncy in a good way. A good amount of shrimp and bok choy though and the broth had a solid shrimpiness that wasn't fishy or overkill. See the pictures <br><br>The xlb weren't great either. The skin was an okay thickness, we can't all be din tai dung. However the broth within was missing a sweet porcine note. It had flavor but I could have believed it was a chicken broth inside.", "pics": null}}, {"review": {"des": "Ambiance=Cute.. Service=Great.. Food=MEDIOCRE AT BEST especially for the price. This is why you am never really trust yelp reviews for Asian places.. I knew better but wanted to try it out.", "pics": null}}, {"review": {"des": "Simply good eating! Great place for a date night culinary adventure, everything from dinner to dessert was phenomenal and flavorful. I highly recommend the lunar dessert for something new and exciting for your tastebuds.", "pics": null}}, {"review": {"des": "We came here because my gf was really craving Asian Food on a cold Chicago day. <br><br>It's very interesting when you enter the restaurant and you can see everyone working to make your food. The women that work in the back look like they are constantly busy and moving. But you can see everything come out fresh and it's very eye catching. The amount of effort these ladies put into making the food makes you really excited to put it in your mouth.<br><br>I will say that I was very satisfied with the food and the service. We ordered the assorted dumplings, the chicken lamian noodles, and the chocolate lunar blossom. The dumplings tasted great, the noodles were fresh, and the dessert was out of this world. I think we surprised our waiter when the 2 of us finished the entire dessert.<br><br>It's great we came at happy hour because you can get a lot for a little. If I come back to Chicago, I'll be sure to pay this place a visit once more.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/OEJIIx5WBd_7Ab47WMyacQ/348s.jpg", "caption": "Lunar Blossom After"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/WUjo5vxot9zWxM6QK1E2-w/168s.jpg", "caption": "Lunar Blossom Before"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/tZt0UG4bKN3CfSFd6fRs7w/168s.jpg", "caption": "The shu mai dim sum"}]}}, {"review": {"des": "Soup Dumplings!!!!! They have been a favorite for a number of years so I truly enjoyed them! All of the soup dumplings have some pork, so be aware.<br><br>The food was great!<br><br>Staff was friendly and helpful.<br><br>The space is beautiful. <br><br>Pro tip: Make sure to ask for individual sauces for each person in your party.", "pics": null}}, {"review": {"des": "Went here for HH yesterday. The food knocked it out of the park. We ordered a variety of things - I should have taken more photos but I was way to into eating to remember to snap a pic!  I would highly recommend them for their cuisine and the prices can't be beat.<br><br>I am knocking them down a star based on their drink choices for HH. The house red was just so so. However at $5 a glass I probably shouldn't complain. They also offered a pitcher of Sapporo for $15. I guess my main complaint is that there just wasn't enough beverage choices at HH prices. Isn't 80% of the point of HH the drinks?? Maybe that's just me?", "pics": null}}, {"review": {"des": "I was a little skeptical because this place seemed a bit Americanized but the food was actually tasty. It's a little pricey and the portions aren't that big but I would come back again because I thought the food was delicious.<br><br>Not the drinks. The drinks were pretty bad. My friend got a pumpkin boba tea and it tasted super sour. The boba was also rock hard. She got another drink, some orange mystery, but she thought that didn't taste so great either. There was a weird after taste.<br><br>The food:<br><br>-Truffle xiao long bao: good! The truffle oil smell really hits you in the face. The soup was not that hot though.<br>-Duck xiao long bao: I don't know why the outer skin was green. It was green and it looked kind of gross. However, I thought the duck meat inside was quite rich though.<br>-Gan bian si ji dou (green beans): I liked it! The portion size was so small though. The green beans were cooked enough that they were on the drier side which is how it should be. It was the tiniest bit of spicy.<br>-Pork belly noodle soup: decent. I'm not a huge fan of noodle soups so while I did think the noodles were fresh, this isn't a dish I'd be clamoring to get next time. I am curious about the la mian (dry) so I'll try that next time.<br><br>It was about $18/person (not including the drink).", "pics": null}}, {"review": {"des": "Decent place. I've walked past this place hundreds of times but finally decided to stop by and to get out of the rain.<br><br>Service wasn't the best. Waitress forgot my order after taking it and forgot sauce for my appetizer. I asked for a drink with a slight modification and she told me it couldn't be done. Huh? Then she considered the possibility of modifying if I had an allergy. Huh? I think using a simple syrup instead of a flavored syrup shouldn't be a big deal. I guess she reconciled it in her mind after much introspection, then brought it out by the time I had finished my appetizer and was midway through my meal. She apologized for that and that's cool, but I'm still uncertain why she was being weird in the first place.<br><br>Mixed Mushroom Lamian was OK. Is it miso broth? Is it veggie tomato broth? Is it both? The flavors are kind of a mindf^ck. <br><br>Veggie Basket was delicious. I'd come back for that. <br><br>If you're looking for something different than your usual eats, this place provides that.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/n8ZhYnrUITyQoxfwZnmK5A/348s.jpg", "caption": "Veggie Basket 2 spring rolls, 2 buns, 2 XLBs. 2 Yummy!"}]}}, {"review": {"des": "Table for 4, walk-in on a Tues eve around 7PM, and promptly seated.<br><br>Nice decor, dimly lit, good ambiance<br><br>Wonton soup was super salty - had to add 5 cups of hot water. Wontons were decent.", "pics": null}}, {"review": {"des": "Placed an delivery order through Yelp which had an ETA of 40 mins. After over 90mins of waiting I called the restaurant and was informed it had been picked up 40 mins ago and for me to call grubhub in regards to the delivery status. After calling grubhub their customer service rep informed me that it is another 15mins. I was only 2 blocks away from the restaurant which is less than 5 min drive. I had cancelled the order<br><br>Although I had not eaten anything from the restaurant and can't critic about the food, I gave it a 1 star because the restaurant should also take responsibility as they chose to use an  unreliable 3rd party company such as yelp and grubhub to sell their product.", "pics": null}}, {"review": {"des": "Seriously? All my XLB stuck to the bottom of the liner which was not paper (which it should be) but a plastic liner. The skins were also very thick. Come on, this is something so basic. <br><br>The mushroom baos were cute but the use of cinnamon was odd and off putting. <br><br>Nothing was exceptional, including the service for the price.", "pics": null}}, {"review": {"des": "UPDATE: After our negative first impressions with Imperial Lamian, we were invited back for a second meal. This time around, we were truly blown away by the service and the quality of food.<br><br>My favorite dishes were definitely the Fried Dimsum Platter, the Char Siu Wonton Lamian, and the Lunar Blossom.<br><br>The Fried Dimsum Platter contained 2x Pumpkin Puffs, 2x Crispy Wontons, and 2x Spring Rolls. It was hard picking out one as my favorite because all three were so unique, so I would just recommend getting two of each kind. You won't be disappointed with any of them.<br><br>The Char Siu and Wonton Lamian was a marked improvement over the bowl of lamian I had two weeks ago. Just as before, the hand-pulled noodles were very firm and chewy. This time around however, the bok choy was actually really good and the soup was umami.<br><br>The Lunar Blossom was the most extravagant desert I've ever had and something that I've previously only seen on Facebook videos. Basically, its piece of cake topped with gelatto inside of a white chocolate shell that blossoms open when your server pours hot dark chocolate on it. The presentation and taste blew me away.<br><br>We will definitely be back for more.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Uu8-TfQx1ERG62Dvlax34Q/348s.jpg", "caption": "Lunar Blossom: beautiful presentation and taste; definitely try it especially if you have a sweet tooth"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/hS1tvY7T4BoQec-w-EEr4Q/168s.jpg", "caption": "Jasmine Tea Smoked Ribs*: although they were very good, they kind of just tasted like normal ribs to me (I'm not sure where the jasmine was)"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/7VS_PiBVR7pjiYzxzUmQ7Q/168s.jpg", "caption": "Shanghai Xiao Long Bao (white) & Spicy Szechuan Xiao Long Bao (red): my favorites from the Combination Xiao Long Bao"}]}}, {"review": {"des": "I enjoyed. I'd say the atmosphere and decor was upscale/trendy which I found unusual but welcome for a Chinese place. Lots of marble everywhere- which I love. <br><br>The Szechuan Wontons are an amazing starter if you enjoy spicy foods. That dish alone was 5 stars. Very succulent with just the right amount of spice. <br><br>I ordered the Duck Fried Rice for my main meal and it was just okay. I've had many better fried rice dishes so I don't think I'd ever order this again. <br><br>Overall, I had a great experience and would go back to perhaps try the La Mian noodles next time!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/zKX0A9gDBjU3JH1YTOnG_A/348s.jpg", "caption": "Szechuan Wontons... So yummy."}]}}, {"review": {"des": "Food is great, SERVICE IS HORRIBLE.<br>Waiter is very pushing, cold face all the time. Asked us to order when we just seated and brought the check when we hadn't finished our food. We asked them to clean the soup from dumplings on the table, but they never came. The two stars are all for their service. I would give five stars to the food.", "pics": null}}, {"review": {"des": "Definitely check this place out!! I heard about it from fellow Eliter Denise when she was raving about this place. I had it bookmarked for a month before I went. My friend and I went for happy hour and sat at the bar. Happy hour is until 6pm on weekdays and includes four dumpling options and $12 create your own la miam bowls and some adult beverage options. <br><br>We got the pumpkin dumplings and they came out like little pumpkins!! Didn't even look edible they looked so much like descriptions! They were delicious too. We got the shrimp and one other dumplings as well. Those came in 4 while the pumpkin had 3. <br><br>We went with the beef brisket la miam and hand pulled noodles. Yummmm!!! We split all of that and we were good in terms of feeling full from the portions. <br><br>My original intention was to come in to try the lunar blossom dessert which I saw a video of on Instagram but was feeling too full so I've made it my mission to try it so I will absolutely be back!!", "pics": null}}, {"review": {"des": "I came here for happy hour a couple of weeks ago. I ordered the shrimp dumplings (fresh and tasty) and bbq pork noodle soup (why is the bowl concave? It makes it harder to eat from the bowl. Why are the noodles separate? The noodles are cold and clumped together by the time it arrives in front of you. Try dumping a bowl of clumped together noodles into a bowl that can barely fit everything. My dumpling was raw and I had to ask for a new one). <br><br>It was pretty quiet and the happy hour deal is good but only until 6PM.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/CEAzLIb5cUAtyRlMWEuVJQ/348s.jpg", "caption": "Char Siu & Wonton Noodle soup"}]}}, {"review": {"des": "During my trip to Chicago, their Combination Xiao Long Bao was probably my favorite food that I ate. I remembered from a Facebook video that there was a rainbow soup dumpling place in Chicago so I had to use Google to find this place.<br><br>Their XLB were so juicy but I think the experience of eating them was probably my favorite. Say you order something from a restaurant--it's most likely a large portion of the same things. For this, each bite is something different and you get to experience these unique flavors. Although a bit pricey ($12 for 6), I think it was well worth it for the experience. Keep in mind that it will not fill most people up.<br><br>The flavors--gruyere cheese, duck, traditional Shanghai pork, truffle, spicy Szechuan​, and crab--were pretty spot on of what it was supposed to be. The gruyere cheese was surprisingly​ good and not a bad combination at all.<br><br>The pumpkin puff, which is butternut squash and duck, wasn't all that great and I could have done without it.<br><br>I think because I like to excite my taste buds but also because they were actually very tasty, it was a 5-star experience in my book!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/fqt4WncfpGqLMYgERTomsg/168s.jpg", "caption": "Pumpkin Puff"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/mkbO_sAwcAVO09oKzHPXhA/168s.jpg", "caption": "Combination Xiao Long Bao"}]}}, {"review": {"des": "WOW!  Brittney has great recommendations and explained the menu well. Easy to make reservations and the food was amazing. Can't wait to go back and try more! We ordered three things to share and it was perfect!", "pics": null}}, {"review": {"des": "This place has an amazing vibe. I really loved the interior of the restaurant. Low lighting, downtown atmosphere--pretty chic. However, don't let this atmosphere fool you.<br><br>This place desires to be a high end Chinese restaurant, but it's missing the mark with the quality of food being served to its patrons.<br><br>The prices are pretty steep for the dishes, so we thought dishes would be perfect for family style (there were four of us). WRONG. What a tease! The dishes might be best for two hungry folks and maybe a third person who eats small portions.<br><br>I didn't find the food to be that great, either. The rice was dry, the beef was over cooked, and the noodles were meh. <br><br>Service was great. Our waiter was attentive, and the manager was walking the restaurant. <br><br>If and when I return to Chicago, I'll be on the hunt for a better Chinese food experience. I like to eat, so I'm going to need way more food for these prices!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/SXkHqVm6FaS9NR_oohOSiA/348s.jpg", "caption": "Beef Fried La Mien"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/YDvxYwmBhDfGHA7U4oCaGA/168s.jpg", "caption": "Steamed Platter"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/PsfUc3DA-P0SjrzB71kuNg/168s.jpg", "caption": "Combination XLB"}]}}, {"review": {"des": "I thought the food was hit or miss and over priced.<br>Good: shanghai Xiao long Bao, properly soupy on the inside with proper sauce.<br>Bad: beef noodles and pork noodles. For having lamien on the restaurant name, the noodles were a joke.  The texture was not chewy at all. The taste was bland. The meat was at least tender and flavorful.<br>Shenjian bao was mushy on the inside which made it gross to eat. Definitely not worth it. <br>Overall would not come back.", "pics": null}}, {"review": {"des": "Imperial lamian was fairly decent, I'm a harsh critic when it comes to Chinese food and I decided to come here with two girlfriends seeking \"Instagram worthy\" food after seeing their soup dumplings all over the web. <br><br>We ordered:<br>Salted egg yolk green beans: good portion for $9,<br>Fairly standard.<br><br>Soup dumplings:<br>These were disappointing. Very little soup for XLB, the crab one didn't taste like crab; the Szechuan peppercorn one had some spice but otherwise was just pork. Would not get these again especially since 6 are $12.<br><br>Half glutinous pumpkin bun and half fried wonton with shrimp: this was delicious, I enjoyed the pumpkin shaped bun stuffed with mushrooms and pork as well as the big shrimp wontons. <br><br>Pork belly la Mian: this was good, but nothing to write home about. $14 for a bowl of soup, one of their cheaper dining options. <br><br>Their pandan cake globe dessert is hefty priced at $15. However it is a showstopper for sure. Waitress pours chocolate and the shell dissolved before your eyes revealing pandan cake with almonds. You won't be able to eat the white chocolate shell, it is too sweet. Just eat the vanilla ice cream with chocolate syrup and pandan. I would get this again to impress guests, otherwise skip out on it since very few parts of the dessert are actually edible unless your sweet tooth is big. <br><br>We spent $25 per person, which wasn't too bad, the decor is classic and nice, good date spot, and service is decent as expected for a high class downtown establishment.", "pics": null}}, {"review": {"des": "I recently attended a Yelp Event with Denyce M and she told me and another friend about Imperial in which I have worked not too far from for about 5 years and never thought about going in. She mentioned a happy hour menu that caught our ears. <br><br>Me and my lovely friend came by recently and got seats at the bar. Looked around and checked out the really nice atmosphere with exposed brick and dim lighting which is always my favorite look in a restaurant. There was even an awesome mural of a woman in the bar area. We were there for the $5 each dim sum happy hour menu so we shared 3 sets of dumplings; pork soup dumplings (my favorite), butternut squash/roast duck pumpkin puffs and shrimp dumplings. They were all very good. We then shared a Lamian in which it was build your own. We had hand shaved noodles, beef brisket and beef broth...very good! <br><br>My friend actually saw an IG post of one of their extravagant hot chocolate cakes but we were too full to order, but def next time around. Pretty good drink menu as I had the East Meets West which is an asian old fashioned as described to me by the guy behind the bar. It included Japanese whiskey which is my favorite. They also carry my favorite Japanese whiskey here, Yamazaki 12 year. Good spot and as I said I would like to come back for that cake as well as their normal dinner menu.", "pics": null}}, {"review": {"des": "My family and I were in the mood for some asian deliciousness and this was close to our hotel. The staff was super friendly. Everyone we interacted with was polite, smiling, and helpful. The atmosphere was casual and a bit hip. We tried the dim sum sampler, salted egg fried beans, and the beef brisket lamian. With a hot tea, bill was $50.<br>Food came super quick. The reason for only 4 stars was that the food didn't meet my expectations. It was good but not super good.<br>Jasmine took amazing care of us and patiently answered our questions.<br>We would definitely try it again.", "pics": null}}, {"review": {"des": "The food is awesome and the server, Danilo does a great and get us very good services. Will return more often.", "pics": null}}, {"review": {"des": "Wanted to try some soup dumplings, reserved on open table for a Sunday night. Tad bit wait for our table but the Manager was very compassionate and sent over 3 appetizers which were on point. The food choices and our selections did not disappoint. I have had better soup dumplings but the restaurant had a great homey feel. The waitress Britt was amazing and on target with her recommendations. We kept seeing a large ball being served for dessert and it peaked our curiosity and it did not disappoint. Great price for the amount of food we got. Highly recommended.", "pics": null}}, {"review": {"des": "I came here with a few friends after winning an Instagram contest for a cocktail making class. We met with the beverage manager, Gerardo, who set everything up for us. After getting to know all of the tools and ingredients needed, we got our drinks on. I was excited that the lineup included 2 traditional then 2 variations of those traditional drinks: an Old Fashioned, East Meets West, a Manhattan, and a Tokyo Manhattan. I appreciated that Gerardo not only walked us through everything but was teaching us so much history about the drinks, Imperial Lamian, as well as getting personal with us too.<br><br>The reason I appreciated the drink selection was that I'm not much of a whiskey drinker, simply because I didn't know HOW to drink it (I can't order drinks neat. I'm sorry, I wish I could). I'm happy to say I'd confidently order a Manhattan all by myself now!<br><br>Obviously if I had drank all 4 of my drinks in the early afternoon, I would have been carried out. My friends and I feasted on some dim sum pairings with our drinks (Thanks Gerardo!) - I'd have to say the XLB (aka xiao long bao aka soup dumplings) have been calling my name for over a year now and I'm so happy I finally got to try them! I also truly loved the Imperial Lamian version of \"shrimp toast\". And the highlight of our experience was the cute little piggy bao! So cute, but not TOO cute to NOT eat. <br><br>I'm definitely coming back, specifically for the dim sum menu. But then again, everything at Imperial looks great.. I'll need to ensure the flavor matches the eye candy ;)", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/9ByyH0xBBG2V-ZGq7omRrQ/168s.jpg", "caption": "Old Fashioned"}]}}, {"review": {"des": "I have been on a quest to find the best soup dumplings in Chicago, and so far Imperial Lamian is hands down the best!<br><br>Not to forget that the service was actually amazing. Jasmine knew the menu inside out, and was so incredibly friendly. Jasmine gets 11/10 stars.<br><br>Will definitely be back!", "pics": null}}, {"review": {"des": "Imperial Lamian was recommended to me after a friend found out I was on a food trip in Chicago.  And although it's on the pricey side, it really did fix my Asian cravings! The service was prompt and friendly and the decor in the restaurant is awesome. We went for happy hour on a Friday night. <br><br>I got the combination xiao long bao (rainbow colored soup dumplings), calamari (not pictured) and pumpkin puffs.  <br><br>The calamari was delicious! I'd highly recommend it as an appetizer.  The pumpkin puffs were just okay in my opinion but my fiancé really enjoyed them. They just reminded me of a meat pie to be honest. <br><br>Now the combination xiao long bao comes with six different types. And if you're like me you will want to save the best flavors for last when sampling them!  <br><br>I ate mine in this exact order: <br><br>1. Shanghai pork<br>2. Gruyere <br>3. Spicy Szechuan <br>4. Crab <br>5. Duck<br>6. Truffle (Save the truffle for last or order more! It's delicious)<br><br>I'd also recommend the lunar blossom for dessert. The presentation is pretty cool so get your phones out and start recording.", "pics": null}}, {"review": {"des": "The Chinese food here cannot be defined as authentic, but the food is absolutely palatable.<br>We tried pork belly noodles, London Duck and 6 different Xiaolongbao.<br>The pork belly in the noodle is well stewed and the skin on the pork belly is gently fried which provides a rich flavor.<br>Although the it is called London Duck, the duck is cooked based on Peking duck style. They use pulled duck meat instead of sliced duck. They provide sliced onions and cucumbers on the side. The dish is successfully Americanized.<br>Xiaolongbao is not that outstanding but they let you try six flavors in one dish which is nice.", "pics": null}}, {"review": {"des": "Wait : they accept rsvp <br>Service : not very friendly with Chicago standard, as I used to live in New York, that's okay. One annoying thing is the girl keep asking to take the dish away while we haven't finished eating. <br> xiao Lao bao is worth the try, I wish the wrap dough be thinner n more broth inside. <br>I tried Szechuan la Mian : broth is tasty but noodle is on the harder side. <br>Vibe : great decoration with lots of rooms between each table. <br>Price : a little overpriced for the food <br>Tip : I won't try the noodle again, might go there to try some other things.", "pics": null}}, {"review": {"des": "Trendy-upscale Chinese cuisine. Accessible location. <br><br>Good:<br>- Calamari - amazingly good. I would get again.<br>- Crab soup dumplings were the best of the lot. I still prefer the more authentic variety in Chinatown. we ordered a couple of different ones (shanghai, kimchi, duck, crab). I wasn't too impressed with the other soup dumplings as they were either uncooked or doughy. (pro-tip: eat it while it is hot or else the dumplings can get sticky and break leaving you with no soup inside). <br>- Free egg custard buns with a Yelp check-in. Score!<br><br>Okay:<br>-Short rib lamian - each bowl was shareable among 2-3 people. <br>-The fried rice with asparagus - we all liked it but it was not awesome for the price. <br><br>The meh:<br>-Chicken thigh in claypot- didn't like anything in this dish for the price. the flavor was not appealing and it was douched in a brown sauce that felt very salty(msg?).  <br>-generally speaking the food seems rather salty and we needed more water.<br>-The high top seats by the wall were awkward, it felt like the table was too far from the seat and too far from your friends.<br>- Service was par to sub par. I don't find it useful when the waiter basically reads the entire menu to us page by page. I had to prompt him to get the highlights which involved more page turning.<br>- the staff was almost too eager to clear plates and they forgot to box some leftover fried rice. <br><br>Overall, it's not likely I would return in the near future...plus I love the places in Chinatown way more to pay these prices.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/B7-c-G82oDIY0Dpiiz5_qQ/348s.jpg", "caption": "Dessert - egg custard yes!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/iduS2reKx_SFVU1dDZgpdw/168s.jpg", "caption": "Short rib lamian"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/DxcS_2mwNnxtPl83zA09vQ/168s.jpg", "caption": "Chicken thigh-meh"}]}}, {"review": {"des": "This restaurant lost 2 stars due to their rude waitress. The food was really good but service makes a big difference to the dining experience. I even gave the restaurant a chance to handle this situation before I took to my Yelping, but they just ignored me.<br>I'll get the bad part out of the way first. My boyfriend and I were here on a weekday for dinner, got seated at the bar area, waited a solid 5 minutes before our waitress, even came to our table. When we got seated the restaurant wasn't that busy. She comes to us but only looks and talks to my boyfriend, as if I'm invisible. I have never had any wait staff at all multitude of restaurants I've gone to talk only to my boyfriend. I was initially shocked but of course my boyfriend didn't notice. She only looked at me when I spoke up to put in a drink order. Later when she came back to see if we (or rather my boyfriend) had any questions about the menu, she was so shocked (even my boyfriend, a not very observant guy, noticed how stupidly shocked she was) that we had no questions. (Well, maybe because I'm Chinese?) so my boyfriend orders the food and I chime in to force the waitress to even acknowledge my existence. Later when the food comes out she pops in by the table, looks directly at my boyfriend, and asks how the food is. Then she comes by again later, asks only him if he's good on drinks. I'm really angry about this because it's really sad that a Chinese female gets treated like this at Chinese restaurant of all places. I've dealt with racism and sexism enough but seriously? At a Chinese effing restaurant and being purposely ignored by a Latina waitress. There's really no excuse for her behavior. It's basic etiquette to speak to the entire party that you are waiting on. In no way did I feel like she was hitting on my man, I just think that she was fine ignoring me because I was either Asian, female, or both.<br><br>Later on my boyfriend wanted soy sauce so I tried flagging down another waitress. She had this bitchy attitude that we had asked her to do something and she came back and kind of just threw it on the table and left.  <br><br>Well on to the food. The xiao long bao (soup dumplings) had lots of soup in them! It would have been nice if we got spoons when the soup dumplings were brought out though. We had to ask for spoons and the bus boy seemed to think it was an odd request. The dim sum platter was a nice variety of foods... Mostly seafood based. The fried platter was good but we could have done without it.", "pics": null}}, {"review": {"des": "Overall good experience! The only reason I'm giving 4 instead of 5 stars is because the service was a tad slow tonight, maybe they were just busy. Make a reservation! You won't regret it. Otherwise you will be waiting upwards of 2 hours for a table for 2! Such good food!", "pics": null}}, {"review": {"des": "I had an absolutely exquisite experience. We were looking for a nice dinner to end our girls night on and we were curious of the colorful xiao long bao pictures we've seen. <br><br>Presentation was a big part of this dining experience, I was wowed by each dish that was placed before us. However taste falls flat on some of them. Service was attentive, but I felt our waitress lacked knowledge on some of the food. <br><br>Combination xiao long bao - a great way to sample their offerings, the combination included traditional Shanghai, spicy Szechuan, gruyere, crab, truffle, and duck. I expected savory dumpling juice to spill out when I bite into them, only some did... definitely disappointed by that. Flavor-wise, after sampling all of them, i am only willing to order spicy Szechuan and gruyere again.<br><br>Salted egg yolk green bean - a special of the day. Lightly tempura battered green bean cooked with salted egg yolk. I love it! <br><br>Pumpkin puff and crispy wonton - Very cute presentation and taste followed through. Crispy wonton had a shrimp filling, delicious. The pumpkin puff was the most memorable bite I had that night. The black pepper pork filling was so good and all that goodness was stuffed inside a crispy on the outside, chewy on the inside rice flour dough. Very similar to a fried salty dumpling. <br><br>Braised pork belly la mian - their house made noodle, A++. The pork belly you could tell was braised for hours to get that depth of flavor. All served in a clean light broth. <br><br>Lunar blossom dessert - what a show! Very fun to end the meal on. The white chocolate shell \"blossomed\" open to reveal a light pandan cake with toasted almond and rich vanilla ice cream. Very sweet and rich dessert, but nevertheless delicious. A pricy dessert I would only save for special occasion.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/g817jkgg-2Y97lxe2SrQQg/348s.jpg", "caption": "The lunar blossom reveal!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/_rIYvq4bDRumOKMooRvEsQ/168s.jpg", "caption": "The reveal!!!!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ZBGM03N_L_Qqu0NOZ0GvSQ/168s.jpg", "caption": "Lunar blossom dessert."}]}}, {"review": {"des": "Interesting take on Dimsum. Came by around 7 pm on Friday and did not have to wait. Plenty of empty tables still empty. The interior decoration and stuff was all very cute and would a great date spot. Food was a little pricey for what you get but everything was delicious.", "pics": null}}, {"review": {"des": "Location: 5-star<br>Service: 5-star<br>Food: 3-star<br>Price: 2-star<br><br>A nice addition of upscale Chinese spots in River North. You really can't beat the location, right off Michigan and close to all the shopping and night life around River North. Indoor decor is like a 20th-century Chinese dining room, very traditional and beautiful. Service is very attentive. Added bonus that you can almost always get a reservation. A very well-run establishment.<br><br>Food wise, many dishes are very photogenic, but quite average tasting, and overpriced. My favorite is the pumpkin puffs; they are cutely shaped just like pumpkins on the ground (even with arugula vines, lol), and filled with pumpkin cream. The assorted (rainbow) Xiao Long Bao is a feast to the eye, but tastes meh. The lobster fried rice is also very ambitiously plated, but very overpriced for the amount of lobster (and just food in general) you get. And the entree noodles I don't quite care for either.<br><br>But will I come back? For the convenience, most likely yes.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/eqawCDYfIYKLtZ-VBFytWA/348s.jpg", "caption": "Lobster fried rice (those lobster shells are empty, display only ;))"}]}}, {"review": {"des": "Extremely disappointed with the service last night. They served us soup dumplings but didn't give us spoons to eat them with because they ran out of spoons! We couldn't eat them and when our waitress finally brought out the spoons the dumplings were cold and unenjoyable. Very sad night.", "pics": null}}, {"review": {"des": "Yeah yeah, I was just there on 10/23.  Guess what, me and La J went back again.  Those damn shrimp dumplings were calling me.  These are not your typical shrimp dumplings...they have actual whole shrimp in them and they are soooo good!<br><br>We got there in time to do the Happy Hour, which again, is a really good deal.  For drinks I started with the Jackson Estate Flight (Chardonnay).  You get two 3 oz pours of the Santa Maria Valley (2014) and the Camelot Highlands (2014).  Both were nice.  I then switched over to the Happy Hour white selection, which also was not bad, especially at $5 a glass (Scarpetta, Frico Bianco, Italy).  Me and La J laughed at the thought of an Italian white wine with Asian food, but it worked.  There was also a selection of non-alcoholic drinks.  La J got a drink called Shaman (cranberry, grape, mallorca melon, lime and ginger beer).  It was very good and I mentioned that it would be great mixed with a little champagne.<br><br>In additional to the shrimp dumplings, we got the Gua Bao (Braised pork belly, spinach steamed bun).  There were three pieces in the order and they were of a nice size.  The pork that was in each bun was a nice size.  We also got the Duck Xiao Long Bao and the Pumpkin Puffs.  Both were great and what was nice was the amount of duck in each dish.  Not sure if the Pumpkin Puffs are just for this month...I am going to call to find out as they are good.<br><br>Honestly, you can do dumplings and bao at this place and never hit a ramen bowl, it is that fillings.  For dessert we got a free order of the Salted Egg Bao (Steamed Molten Egg Custard Bun).  It sounds like a combination of flavors that would not work, but it does.  Light and refreshing, i could totally do these with champagne as a brunch item.  You will get this free once  you check in on Yelp and it is work it.<br><br>La J and I have decided that this is going to become our regular monthly Happy Hour place for dumplings and bao", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/MWnIIvSQG0KAiL-L7xHVHQ/168s.jpg", "caption": "New item on Happy Hour Menu: crispy chicken buns.  There was a wasabi aioli, but it wasn't spicy."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/UVhxNYYbKZvF9WLtTvIP4Q/168s.jpg", "caption": "Pork belly bun...nice ratio of fat and meat, which melted in the mouth"}]}}, {"review": {"des": "My family and I went here on a whim one evening while we were visiting Chicago because it was right across the street from our hotel. It turned out to be an excellent decision because I LOVED Imperial Lamian! Since we were going for light bites, we ordered several small plates to share: the combination xiao long bao (soup dumplings), calamari, rojak tofu and Lotus (or was it Lunar?) Blossom dessert. The xiao long bao is a must because it comes with an assortment of different flavors: shanghai, spicy Szechuan, crab, truffle, Gruyere and duck. Our favorites were the truffle, crab and duck. On a side note, this dish makes for great food pics since the dumplings are all different colors and you don't see that at a lot of places lol. The calamari was surprisingly really good too. I normally consider calamari a basic dish that tastes similar at most places, but the one at Imperial Lamian was tossed in a sweet sauce and had the perfect amount of crunch. <br><br>I have a huge sweet tooth, so when our server mentioned dessert, I jumped on the opportunity to stuff my face. She recommended the Lotus Blossom, which was pandan cake with almond slivers and strawberries baked inside a giant white chocolate shell. If you're unsure what pandan is, it's a sweet, light flavor similar to vanilla, but it's green. She drizzled hot chocolate on top until the chocolate shell melted to reveal the cake inside. It was a truly beautiful experience and probably my favorite dessert of all time. I ate every single bite! This is saying a lot considering the Lotus Blossom dessert was large enough to be split among at least four people. But hey, it was a steal at $15. Can I go back now?", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/twE-ixJXDFnXT7AdHcYgww/168s.jpg", "caption": "Lunar Blossom"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/b8xJIW6S0Ugpied-Odl4-g/168s.jpg", "caption": "Assorted soup dumplings"}]}}, {"review": {"des": "A cold, windy day in Chicago had me wanting some hot soupy comfort food. Stumbled on Imperial Lamian because of Yelp and had a hit the spot meal.<br><br>The pork and shrimp dumplings (Siew Mai 7$/4pc) are tasty. The dumplings are topped with masago and comes with a ponzu like dipping sauce. If you want some spice, ask for chili oil a.k.a sate.<br><br>Char Siu & Wonton (16$) LaMian caught my eyes. Fresh hand pulled noodles in pork broth with bok choy, char siu, wonton, cilantro, and green onion. The pork broth was light but flavorful. The char siu (bbq pork) was okay, I had better. The wonton, also ok. I added the left over chili oil into my bowl for some needed heat.<br><br>Dining companion had the Mince Pork (14$) LaMian. This was way better than my choice. The truffle oil truly enhanced the pork broth. It was so flavorful.<br><br>We also tried the Oxtail Fried Rice (16$) and Green Beans (9$). The fried rice was good. The fattiness of the oxtail makes the dish. The green beans were meh. The ends weren't cut off, which made the green beans difficult to swallow. Also, it was over cooked and mushy-like.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Ct0TlI7cRDUIqyYNB_ITOA/348s.jpg", "caption": "Green beans with mince pork and Chinese olives 8$"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/2yT4UAqv9lzGa6hnHwl4nw/168s.jpg", "caption": "Char Siu & Wonton (pork broth, bok choy, cilantro, crispy leeks, green onion) 16$"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/fts-MGCHPZiOuReehEFScw/168s.jpg", "caption": "Mince Pork Lamian (spicy pork broth, truffle oil, shiitake & wood was mushroom) 14$"}]}}, {"review": {"des": "The only thing great about this place is the ambience. I've never been to a restaurant where the server knows nothing about the food they serve and I've never had such poor service in the city. My waitress was a hot mess, it was Labor Day so I knew she was short handed but the wait for our food was not the issue, our service was so bad. Our waitress failed to tell us that the food comes out as it's prepared so we had two meals come out and my meal came when everyone had finished eating, I honestly think she forgot to put in the order. I asked what was in the truffle soup dumplings and she said \"truffle\" I also asked if there was any pork in them and she said no but since she knew nothing about the menu I asked her to ask the kitchen and they confirmed there was pork. It's pretty disappointing when your server can't even tell you the ingredients in popular dishes on the menu. Why would you lie about ingredients when people could have allergies or even religious views that prevent them from eating certain things. The food was overpriced for taste, I had a shrimp noodle stir fry, I think it was called wok fried lai man and it tasted no different than Chinese takeout. There were only 2 pieces of shrimp in my whole dish. I also ordered a bubble tea and the tapioca pearls were hard. My friends ordered la mian which were the noodles in broth, both of them said it was nothing special. For soup noodles or authentic Chinese food, don't go here! You're better off sticking to china town :)", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Fc4BW7GaGWsJaR8uyqMR8Q/348s.jpg", "caption": "Where is the shrimp? \"Shrimp\" Wok fried La Mian"}]}}, {"review": {"des": "Been here twice, both for happy hour. Overall, the happy hour menu is a great deal, esp for the area. Each bao order comes with 3-4 so its easy to share and the portion size for the noodles is generous as well. I've tried the pork and mushroom hand shaved noodles and both were delicious. I love that you can watch the chefs make the noodles right in front of you as well!  <br><br>Only caveat, the pumpkin bubble tea and it was disgusting. It was not pumpkin flavored at all, was sour and the bubbles were mushy and gross. Definitely do not get it.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/kJIWqtM_55mpg1_0Y3c3Og/348s.jpg", "caption": "Non-alc drink list"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/l0VcS1jDzQuAaGJHuvaOMQ/168s.jpg", "caption": "Salted egg yolk bao"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/V9ZYH_4AEqLIirfxV2rMmA/168s.jpg", "caption": "Mushroom bao"}]}}]}