{"name": "india-house-restaurant-chicago-2", "reviews": [{"review": {"des": "Had to pee so badly here.<br><br>Really great service -- our waiter continually refilled our water glasses and the food was great. <br>I peed twice. The bathroom smells like a wonderland. <br>Come here.", "pics": null}}, {"review": {"des": "I had a terrible experience here. The food had a bug<br><br>There was water dripping from the ceiling<br><br>I would only take my worst enemy here because his company would be better than the dog food they serve here<br><br>Afterwards, would loan out your stomach to Elon Musk's SpaceX given that their food will fly out of your behind faster than one of his combustion engines<br><br>Gross", "pics": null}}, {"review": {"des": "Overpriced, mediocre food.<br>I ordered lamb biryani. Came boiled rice with lamb and spices in it. Also I asked for spicy but it was very mild. <br><br>To the chef - Biryani is supposed to have each rice grain separate from each other with its own distinct taste and flavor.<br><br>It's not pulao! Hope you improve it.", "pics": null}}, {"review": {"des": "I've grew up eating food every single day. I've tried a few places in the city but India House is my favorite. I've had at least 10-15 meals from here. <br><br>I've tried almost half the menu. The food is always fresh and not oily like many other places. The dishes are a pricy but it's comparable to other restaurant in the area. I do cringe every time I have to pay $5 for naan. <br><br>The buffet is a great value if you want to try a little of everything. It's stocked with a large selection of always fresh food.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/BYIWirlaOwn7YDGAi_3KzA/168s.jpg", "caption": "Buffet!!!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/D1dtjYMYzlE1o6akG3Oluw/168s.jpg", "caption": "Rasmalai"}]}}, {"review": {"des": "Delicious food with great service. The menu is thorough and offers a wide variety of vegetarian, chicken, seafood, and lamb options. They even have goat for those who fancy that. Highly recommend the Shrimp Masala with garlic naan. Full bar and spacious seating. I'll<br>Definitely be returning.", "pics": null}}, {"review": {"des": "This restaurant is located in a prime part of the River North neighborhood.  There are several hotels, stores, bars, and attractions all within blocks of this restaurant.  The interior of this restaurant is beautifully and tastefully decorated. <br><br>My friends and I started with the lamb samosas. There were no potatoes mixed in with the lamb, so almost all of the filling instantly fell out.  The flavor from the lamb samosas was pretty bland and I wouldn't really recommend ordering them.  <br><br>The naan and dipping sauces were good.  For my main entree, I ordered the Hyderabadi Style Lamb Curry.  The flavor of the sauce wasn't bad, but the lamb was on the tougher side.  I probably wouldn't order any lamb dish from here again.  <br><br>Overall take on India House:<br>Nothing I had tasted horrible, but nothing tasted that exciting either.  I've visited Indian restaurants in different areas of the city and suburbs. Based on my past experiences at other local Indian restaurants, I would definitely rank this place low.  The prices for most of the items on the menu are also higher than most Indian restaurants, so that is another unfortunate aspect.  If you don't mind going to Streeterville (less than a 15 minute walk away from this restaurant), I would suggest visiting Indian Garden instead.", "pics": null}}, {"review": {"des": "I came here for lunch to check out the lunch buffet. I was impressed! They offer a salad station, a large entree station with many options including vegetarian and meat. I love vegetable curry and they had a few dishes with just vegetables and one with cauliflower that I loved. I also appreciated the shrimp, it was good!<br>With the buffet they serve you naan (bread) and tandoori chicken (as much as you'd like). It was good! They surprised me as they bring to your table as soon as you sit down, my first reaction was \"I didn't order this\" but the server stated \"this is part of the buffet \". That was cool!!<br>They also have a dessert station in which I absolutely love the mango ice cream!<br>Their fountain drinks are pretty expensive at $3 and I had to ask for refill (that eerks my nerves when eating at restaurant ).<br>With the Yelp! 10% check in, this is taken off the amount of buffet (14.99) before tax is added.<br><br>All in all this was a very pleasant experience and the food was outstanding !!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/78Zxh14ip68WLqfX5OiwdA/348s.jpg", "caption": "1 buffet with drink and 10% yelp discount for check in!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/99UhDR0QnV7HfbO1I5to8Q/168s.jpg", "caption": "My dessert tray"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Q3Om5Z-fUxXT8afMFOAPtg/168s.jpg", "caption": "Dessert"}]}}, {"review": {"des": "We took Uber to reach this spot all the way from magnificent mile to taste Indian food seeing top reviews in yelp and am totally devastated. Ordered goat biryani ! Request to chef : plz learn how to make biryani and add in menu. Biryani is all about flavor and taste of meat which is absolutely zero. It was like some mixed variety rice and with rarely seen meat pieces. I have to dig and search for meat piece. And it was so sad I had to pay $20 per plate. Coming from Houston where I have tasted great biryani in matter of $10. God, this place only to feel sophisticated ambience  and not for food. I don't recommend  and my review is to alert the outside tourists who is fond of Indian  food.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/AinlmqGURNOAVinjPbKJHQ/348s.jpg", "caption": "Worst biryani - don't order"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/1BgQtKOiRB1AgT3pmNBKyg/168s.jpg", "caption": "Worst biryani"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/bJQURsfWl5dXhmfu69gWng/168s.jpg", "caption": "Chicken samosa - good one"}]}}, {"review": {"des": "The food is delicious and fresh.  I have come here several times and the price point is a little more than other Indian restaurants in the metroplex.  However, the curry portions are larger than your average restaurant.  I love the tikka paneer, matter paneer and the palak paneer.  The naan is fresh and they have a wide range of different Indian tortillas.  The ambiance seems to be a little more on the high end side but the wait staff are generally very pleasant and down to earth.", "pics": null}}, {"review": {"des": "In a business trip to Chicago for a week, I went to this restaurant twice - once with an American colleague, and once with an fellow Englishman - and both times were wonderful. The first time was as much about explaining the food as it was about enjoying it, the second time was an English curry-fest!<br><br>The food is probably the most authentic Indian food I have had in the 20 years I have been here. When asked to spice it up British style it was fabulous. It gave both us Brits a work out. Full flavored, with subtle flavors abounding. The poppadum's were light and crispy, with a decent selection of chutneys (although no lime pickle - shame). Onion bhajis were well fried, with good caramelization of the onions and a solid coriander and cumin taste in the background, just like they are supposed to be. Spicy Chicken Makhani with a side of Aloo Gobi and a Keema Naan (with Riata or course), all spiced up to give a very satisfying \"burn\". Just like the old days in the home country.<br><br>Service was very attentive, with everyone we met having a  smile on their face, you really couldn't ask for better. The atmosphere was fun and busy both times I went.<br><br>Food is the best curry I have had in two decades of living in the States, travelling all over the country. Try this place out I implore you especially if you are an Englishman over here for any period of time.<br><br>Yet another wonderful restaurant in Chicago. I think I want to move here now!", "pics": null}}, {"review": {"des": "This is one of my favorite Indian spots in the city! That being said, I'm not an Indian snob. I thought I should clear that up immediately. But I'm a huge foodie, so don't lose faith in me just yet!<br><br>You cannot beat the lunch special here. $15 for all you can eat! Just FYI, the Chicken tikka Marsala is bomb. They also have lots of delicious vegetation options (obviously). Three desserts are included in the buffet; the mango ice cream is absolutely amazing. It's the stuff of dreams. <br><br>Staff interaction is very minimal. Our waitress only stopped by to drop off bread for the table and refill our water cups. Usually this would really bug me but it feels appropriate here, for the buffet at least. I'll be back India House, don't doubt it for a second.", "pics": null}}, {"review": {"des": "So I would've given this place 5 stars, but my husband (who knows a lot more about Indian food) said he'd only give it 3, so I had to go with the average!<br><br>I ordered the paneer makhani and loved it! The portions are large and make the price worth it! The naan was also very good, but then again, I've never had bad naan! <br><br>Also, this place is like the only place in downtown (besides TGI Friday's) that sells a frozen pina colada! Might not be a big deal for anyone but for me it was huge! I'm unapologetically obsessed with pina coladas and finally I found a place!!<br><br>My husband said he's give it 3 stars because it was just okay. He didn't particularly like his dish and was disappointed by the spices. <br><br>So in summary, if you are an Indian food snob, maybe this place isn't for you. Otherwise, come here!! Don't let the prices shock you because the portions are huge!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/JOaVuJW2_t7jj-BvUbuIKQ/348s.jpg", "caption": "Pina Colada! One of the only places you can get one in downtown!"}]}}, {"review": {"des": "Today was my first visit to this place, it was not bad except for the lintle soup which was unforunitely presented with green bean and white rice in it ! <br>It was the worest lintle soup I tried in an Indian restaurant. My main course was lamb biryani, which was not realy bad but done instantly by mixing the biryani spices with white rice !<br>The vegi samousa was fine fresh and well presented.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/tmWGTcydcZ2fLwpffcEx_w/168s.jpg", "caption": "Lamb biryani instantly done by mixing white rice and biryany spices. Means it was done as white rice first and then converted to biryany !"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/KpRjKZ-XCumQkdyUa27CTg/168s.jpg", "caption": "Lintle soup unmeaningly mixed with white rice and green beans !"}]}}, {"review": {"des": "This restaurant is in downtown Chicago <br>& there is no dedicated parking that I could tell.<br>Good service and the ambience is cozy<br>Waiters were attentive<br>I came her for lunch to check out the lunch buffet.<br>The restaurant has a good option for vegetarians <br>With the buffet they serve you naan (Indian bread) and chicken tandoori on sizzling plate( if you're non vegetarian )<br>They have three varieties of dessert I absolutely love the mango ice cream.<br><br>It was good experience.", "pics": null}}, {"review": {"des": "I ordered a food for my parents visiting from India and the spices level was requested as medium (attached). But after having 2-3 bites of curry it was uneatable. The spicy level was way more high. I am in US from last 6 years and this is the maximum spice i have ever eaten. We finally end up bringing food from other place.<br><br>I am very disappointed.<br><br>Thanks,<br>Anshul", "pics": null}}, {"review": {"des": "Your chicken biryani can't even be remotely called biryani. What you serve is chicken and rice. Please don't insult the delicacy !", "pics": null}}, {"review": {"des": "I have had a 5 star rating dinner at this restaurant so a bit torn for giving it 3 stars.... but it represents the Lunch buffet, that's it.  <br><br>Pros-<br>1. Appetizers- Cocktail samosas & vegetarian tawa fry- both were mediocre. <br>2. Plenty of vegetarian options- the Methi malai corn is out of this world! A dish I'm dying to recreate at home.<br>3. Non-veg options included Chicken tikka masala ( ahh ok), Fried fish ( I wouldn't call it 'Amritsari fish' but close), Chicken curry (redundant on the menu), and a full tandoori chicken which is served on the table (Do note, you cannot take that home) <br>4. Desserts- Walnut halwa ( very rich, not too sweet, delightful), Mango icecream (which they were restocking by the time I reached and was ROCK SOLID- bummer), Gulab jamun- awful, please skip!. <br><br>- Off the menu we got the Bhelpuri- decent but I'd not order it again. Paneer bhurji - which my face lit up hearing the name of- quite delicious, a tad bit too spicy. <br><br>Drinks-<br>Brownie points, Love creative cocktails and this place incorporates home flavors- Tamarind Whiskey Sour, Cooling Calcutta etc. <br><br>Ambiance- <br>Buffet time is a bit chaotic but overall could get away with being tagged Trendy/Classy for Dinner. <br><br>Service- <br>Took a while for us to be seated. Service was ok, a bit communication gap with our server which I think this place could totally work on. <br><br>I'd highly recommend this place for a custom meal but unfortunately not buffet.", "pics": null}}, {"review": {"des": "This was our first time trying out this restaurant. Food was absolutely delicious and service was great. We were in an out within an hour on a Saturday night. Reviews on the food: <br>Garlic naan- so good it was fresh out of the oven. wish we had ordered two, one order is not enough for two people. The sauce with it was so good I could have drank it like a soup ! <br>Chicken 65- flavor was great and a large portion for an appetizer. Highly recommend <br>Tikka masala- really good sauce and chicken and enough to share between two people. We ordered saffron rice with it and it was great. The rice was a smaller portion, so will order two next time. <br><br>Overall great restaurant, great food, great service, and you get a lot of food for your money. We will back next week to try out the lunch buffet !", "pics": null}}, {"review": {"des": "We just ordered some food from this extremely overpriced and low quality Indian restaurant and I must say I'm beyond disappointed. To all the Americans and other Indians - please do not waste your time and money as for the most part these people do not even cook their food- they said add spice and call it Indian food<br>We ordered peas pulao And it was as follows: it was just their plain rice with frozen peas which wasn't even boiled - no salt / no spices or cumin/ nothing.. so basically they just added frozen peas to their free plain rice and charged us 7$ for that.. for the chef who made it.. peas pulao has some jeera/ salt / saffron in good restaurants and cardamom - please go to culinary school before you continue cooking<br><br>My husband ordered chicken and it was just like eating my dogs chew toys./ actually even my dog wouldn't eat it<br><br>Our parathas were not cooked- I didn't know cooking parathas or Roti was optional in Indian cooking<br><br>Only aloo tiki was good and edible./ we are left hungry and I will make sure I tell everyone I know to not order from here.. I'm sure anyone can cook better than this", "pics": null}}, {"review": {"des": "We catered food from here for a small family get-together. We talked to Poly and made all the arrangements. He was very helpful. He told us all the available options and combinations of the food that we can use.  <br>We picked up the food, it was properly packed (including daal and an entree with gravy). The Aloo jeera was especially good and everyone loved it.  Gulabjamun were perfectly sweet and soft. We liked the food and will think of this restaurant for our next function.", "pics": null}}, {"review": {"des": "My cousins and I wanted Indian street food but didn't want to trek all the way to Devon. India House was the next best place.<br><br>We ordered: Aloo Tikki Chaat, Paneer Pakora, Vegetable Samosa, Papdi Chaat, Bhel Poori. We shared everything tapas style.<br><br>Each was about $7.50, so definitely pricier than Devon, but I feel like the ingredients were definitely a lot better than what we get at Devon.<br><br>The other entrees on the menu were $18-23. Probably way over priced, but I definitely think the taste was on point.", "pics": null}}, {"review": {"des": "Good service for chicago downtown. But only 2 stars cause the did was horrible and for sure there thali was not at par. Our order was mutter paneer with India house thali and 2 paneer khulcha and one tandoori roti. <br><br>For matter paneer peas where rock hard and no 2 paneer pieces in total. And for thali they gave no roti with it you have to pay extra for it. Plus this food was super mild when we asked for spicy. Plus there dessert was khere and the server said it would be rasmalie. <br><br>Appetizer was good for paneer pakora. <br><br>Overall if you don't care about how the food taste then sure go here but for the cost this is not a good place to visit. <br><br>Our bill was $86 with tip and for the quality it should have been free.", "pics": null}}, {"review": {"des": "Not many five stars given by me but the food at Indian House Restaurant  deserves it. Really great food. Large portions in my opinion so you might be able to share. Large appetizer selection and main course menu has an incredible selection of Indian food from all the different regions in India. I left this place feeling like a stuffed tick that had been on a dog for two days. I really could not stop eating. I was with 7 people and everyone was stuffed. Not a complaint from the group other than feeling very full. Highly recommend the food.", "pics": null}}, {"review": {"des": "Paneer kadhai is really nice, you may need to ask for spicy else they normally make it mild. Good option for vegetarian,<br>Good service, ambiance is really nice. <br>We have orderd malai kofta, chily naan and paneer nan it was gr8", "pics": null}}, {"review": {"des": "I came here for the lunch buffet on a Saturday.  It's very reasonably priced at less than $20 per person.  There are so many options on the buffet.  There's samosas, salad, soup, chicken, fish, paneer, vegetable options, and desserts.  Fresh naan and tandoori chicken are brought to your table as part of the buffet, too!  It's all very good, comforting, and filling.  Come hungry!", "pics": null}}, {"review": {"des": "If you are an Indian you won't like this place as much. <br>Palak paneer- tastes weird, not delicious at all.<br>Hyderabad veg curry- good amount of veggies, but taste was super bland .<br>Chicken tikka masala - average. The masala had not seeped in the chicken.<br>Kadi- not worth even mentioning.<br>Tandoori chicken - good <br>Naan- good<br>Rabri- bad, more like milk . <br>Gulab jamun- not rich at all, didn't taste like how it is supposed to. Couldn't even eat it.<br>Hariyali Chicken kabab- low on flavor again<br><br>Not sure how can they serve such low standard Indian food here? It's a disgrace.", "pics": null}}, {"review": {"des": "I came here for dinner and I had a great meal! My expectations were low and I wanted to enjoy an Indian meal. <br><br>Service was great and the ambiance cozy; Waiters were attentive and I had the feeling that they wanted you to enjoy the food.<br><br>I ordered naan and a cauliflower curry which was a little spicy for my liking. Mind you, I have a very low tolerance for spice levels :).<br><br>I left happy at the end of the night!", "pics": null}}, {"review": {"des": "Descent Food and Spread. It's one of a few Indian Restaurants around Streeterville. Slightly overpriced for an Indian Buffet.", "pics": null}}, {"review": {"des": "I have been here before and it was a good experience. The food this time was good except the sheekh kebab and the Tandoor chicken. Both of them were just too dry to eat. All the other dishes were great. The service was good. I would recommend this place - choose your level of spicy/heat for the dishes.", "pics": null}}, {"review": {"des": "This is my favorite Indian restaurant in the Windy City!!! Great food, great service, GREAT PRICES!!", "pics": null}}, {"review": {"des": "After extensive menu exploration, the formula to success here is to order the Papdi Chaat, and the chicken tikka masala with Saffron rice and one of the many varieties of naan.<br><br>Upscale ambiance and pricing for an indian joint, though their food doesn't disappoint.  Great for fancy date.<br><br>The place to go for indian food if you are downtown and don't feel like making the trek to Devon.", "pics": null}}, {"review": {"des": "Had dinner with 9 co-workers and a client. The service was amazing and the food was equally excellent. I had the Chicken Tikki Masala and it was great. Everyone at our table really loved the food. I think older reviews about service are a thing of the past.", "pics": null}}, {"review": {"des": "Amazing Indian food! The restaurant's ambiance was fantastic. The interior was classy, unlike most Indian restaurants. Our waiter was a sweetheart. We ordered onion bhaji, bhel puri, samosas, tawa paneer, paneer makhani, aloo palak, and garlic naan. Everything was delicious! The naan was perfect.", "pics": null}}, {"review": {"des": "Very disappointing weekday buffet....it was a milestone b'day for my mom-in-law and we wanted to treat her, bad idea!! The vegetarian options were limited to legumes and potatoes, that shows a poor menu choice. The naan and tandoori chicken took forever to get to the table. I don't think we will be coming back anytime soon.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/rZMpY3cOeLYz758coXQ22A/348s.jpg", "caption": "Lunch buffet"}]}}, {"review": {"des": "Can't believe I ate so much for just $16. Wednesday seems to be my Indian food craving day , so decided to come here instead of my usual Logan square hangout. The menu is very nice . They have interesting dishes such as Palak Chana and pacharangi dal. 3 Options for meat also . However the Awesome Gulab Jamuns totally blew my mind. Need to sleep now after all that food ;).", "pics": null}}, {"review": {"des": "Always good. My first experience with Indian food was here and they helped me thru their massive menu. Don't forget to ask for the chutneys to dip your naan in", "pics": null}}, {"review": {"des": "Went here yesterday. Its a great looking restaurant,  great ambiance, great service. We ordered 3 entrees, 4 naan and a chicken shorba for 4 people. The shorba came first and the minute I tasted it it made me fear the food about to come... grainy, under-seasoned, just not a \"shorba\" at all. I ended up sending it back and dared not replace it with another soup. And It was very nice of them to not charge me for the soup, which was unexpected. <br>Then the food came and it tasted good, portions were okay too, and the naan were huge! Seriously huge. Also they bring you naan pieces with a nice dipping sauce at the beginning of the meal, which is nice. And a special mention to our server who was really great. <br><br>Now for the cons... as mentioned before, the shorba was a big con. Then, the prices are ridculous. I mean 19-20$ for a veggie entree each, and the taste was nothing extraordinary. I dont mind high prices but the food should justify those prices, which it totally did not. Also at an indian place every entree comes with a naan or rice, which it didnt. The rice that came \"for the table\" was barely enough for two, let alone 4. I understand the place is in the heart of chicago downtown but the food needs to live up to the prices. They earned the 3 stars only because of the service and ambiance, would hav given them 2 otherwise.", "pics": null}}, {"review": {"des": "I went twice to this restaurant in the last 30 days after I stopped visiting their Schaumburg location due to inconsistent taste for various dishes and especially pretty bad Tandoor items.<br><br>Superb location for an Indian restaurant in Downton location. Valet parking is good for that price of $15, considering other parking garage fees nearby.<br><br>Great Ambience & good service. Service could have been better; but I few Indian origin servers had bit of bad attitude (may be only with Indian customers ). <br><br>Tawa Shrimp from Appetizer menu is very good; for which I went back again. Variants of Naan were good; but very disappointed with Rumali Roti. It became so hard and not chewable in few seconds.<br><br>Most terrible part of our order was their Tandoor items. (same reason why I stopped visiting Schaumburg location). I ordered Mixed tandoor Grill meal. Every piece except Chicken Resmi Kabab probably had been recycled multiple times. They were so rubbery, not well cooked and not so great tasting marinade. Whereas those 2 pieces of Resmi Kabab in that platter were made with fresh chicken, very soft and tasted good. So, I assume, they can and know to make it good, but they are cutting corners by recycling items.<br><br>Mixed grill comes with a Naan and an option of either soup/salad. My family ordered Chicken soup which was so pathetic. So, they gave tomato sup which is more terrible than the chicken soup.<br><br>Pros: Tawa shrimp, Garlic Naan, Butter Naan, Paneer Burji, Resmi Kabab and fresh stock of Taj Mahal Beer. Good location; Reasonable valet parking rate.", "pics": null}}, {"review": {"des": "This was one of the most terrible dining experiences I have ever had in over 20 years. I came here with my family (table of 4) for dinner and we were seated in the back room directly under an air conditioning vent. On a below freezing night outside, we asked to be reseated because the temperature was uncomfortable. The manager said it should be no problem as he would turn it off from his phone, which he did. After 10 minutes he returns and says he will turn it back on for a few minutes because other guests are complaining about it being too warm. My family continued to eat in the cold temperature, to the extent at which I was wearing my Canada goose jacket (meant for arctic weathers) inside and was still shivering. Our meal was done and the manager was still no where to be seen. We then asked our server if we could speak to the manager, and when he came over, he first acted oblivious to the whole situation. He kept on repeating that he needed to consider the other table of 8 next to us. Then we asked why he did not reseat us, and he said no seats were open, when clearly the restaurant had empty tables throughout. Finally, he accepted his mistake that he forgot to turn it back on. He apologized but knew he was losing money wasting time talking to us and proceeded to leave to attend other customers. Treating us as second class citizens because of our choices of food or our smaller table size does not mean you can treat us like animals. There is no customer service here and I would not recommend anyone to come here.", "pics": null}}, {"review": {"des": "This is just Ok place. They have a mellowed down version of Indian cuisine.<br><br>The servers are professional and courteous.<br><br>The food was just ok. We ordered -<br>Tandoori PLatter - This was bit better than OK, it was a platter with different tandoori items. - 3.75/5<br>Dal- It was good -4/5<br>Karhai Chicken- This was bland , there was less or no spice level. 3/5", "pics": null}}, {"review": {"des": "They seated us near the restrooms and when we asked for a different seat, the manager was rude. The least they can do is treat customers with respect.", "pics": null}}, {"review": {"des": "Came here on a Sunday night around 9 and this place was surprisingly packed. The India house in Schaumburg is on my 'Do Not Go' list but we had heard the one in the city is better. They start you off with....nothing. Thats unusual for an Indian restaurant. Usually they have complimentary Papad or something similar. We ordered Veg Cutlet for appetizer, Paneer bhurji with Onion Kulcha and Roomali roti as entree. Paneer bhurji also came with plain rice. Quantity was more than enough for 2 people with some leftovers for next day. Cutlets and Paneer bhurji were nothing special but I got really excited when I saw Roomali Roti on the menu and I had to get it. Unfortunately my excitement didn't last very long. Roomali roti should be soft and melt as soon as you put it in your mouth but instead this was like a regular roti made on stove. Overall, Service was nice but food lacked flavor.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/XYny97FGU6z3zq6PRUF39Q/348s.jpg", "caption": "Interior"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/QWo6ZNNq4BhAvodTybRSUw/168s.jpg", "caption": "Paneer bhurji"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/wv3N8BBvFb0p-mnOOGixyA/168s.jpg", "caption": "Roomali roti"}]}}, {"review": {"des": "India house deserves a 5 star review. I am a big fan of their lunch buffet. The best part about their buffet is that fresh nan and tandoori chicken are served at your table. Its has a good mix of vegetarian and non- veg dishes and equally balanced flavors. Mango lassi is a must try <br><br>Service is commendable and the ambiance is perfect for any kind of occasion.", "pics": null}}, {"review": {"des": "This review is for the service..not the food. We arrived here 30 min before close yesterday to celebrate our 5 year wedding anniversary, and I have to say it was probably one of the worst dinner experiences we've had in a long time. We were super excited to arrive here, and upon arrival was greeted with an attitude that we were inconveniencing the staff by being there near close. Our server rushed us to order our food which we were okay with, but as we were eating our appetizers she came up and told us she was taking our plates away because the mains were coming out(we had our appetizer for 5 min and my husband was mid bite as she swiped his plate from under him and left.) After several comments that they were closing soon, and after being rushed with our plates literally grabbed out from under us, we decided to get the rest of the food to go and leave. <br><br>Both my husband and I have worked many years in the service industry in the past, and could have never imagined treating a customer as we were treated. Sad because the food was relatively good...", "pics": null}}, {"review": {"des": "Yummy Indian Restaurant in River North.  I'm a big fan of their lunch buffet, which has a ton of different vegetarian and meat dishes, and then fresh naan and tandori chicken brought to your table.  As Indian buffets go, it's a solid spot! Especially with regards to convenience from work.  Also not usually too crazy that you can't get a table at lunch.", "pics": null}}, {"review": {"des": "Very tasty fine Indian restaurant. Service was Impeccable!  Was a little pricy for some of their items but not totally out of line with downtown Chicago. A very nice casual atmosphere.", "pics": null}}, {"review": {"des": "Very nice Indian buffet. Lots of varieties, good ambience, excellent service. Loved the food and staff there.", "pics": null}}, {"review": {"des": "I really liked this restaurant. The food came hot, which is a must for Indian cuisine. I ordered the Vegetarian Thali, where I could pick 2 dishes with Dal makhni. They readily accepted my request for my choice of items, as I did not wanted to choose from their suggested ones. Which was great!! The Thali came with Soup (u can select ur soup too) I had Tomato Soup, which was super tangy. I loved it! The Thali came with fresh salad, Dal Makhni, Paneer Makhni, Methi Malai Corn, Naan, Rice, Kheer. The corn is a must try if you love corn ( I do). Paneer was soft and tangy and tasty. Dal Makhni was okay, could be better. The Kheer was good! The coke came flat, even after asking to change once, which turned me off. But Overall a good experience in terms of food. Would love to come back here.", "pics": null}}, {"review": {"des": "EXCELLENT SERVICE!!!!! Amazing food, our server was WELL Educated on the restaurant and what they offered. The food was incredible and they continued keeping us a priority, we were over the moon with our experience here!", "pics": null}}, {"review": {"des": "It was a Wednesday night and we made a reservation, and the restaurant was very busy ( usually a good sign). We asked for recommendations and Chicken Tikka masala ( which we were thinking of ordering anyway) and a cauliflower vegetable dish was suggested, so we ordered both. For appetizers, we had some chicken samosas. The samosas were delicious--filled with chopped chicken and just the right amount of potatoes and peas. The chicken tikka masala was medium spicy and delicious. We also ordered garlic naan--not as garlicky as I would have liked,but warm and tender nonetheless. I would go back again --food was good.", "pics": null}}, {"review": {"des": "food was ok. We ordered malai kofta which is supposed to be a sweetish curry, but it was spicy instead. Overall taste wasnt bad but they charged us 18% service charges on the bill and then the bill still had an option for gratuity. <br>Maybe this is something common in the area but we were not informed about it.", "pics": null}}, {"review": {"des": "I enjoy Indian food. I have been to my fair share ofIndian restaurants in several cities. This is the first Indian restaurant in which I was charged for naan. No, not specially naan with additional ingredients. I was charged for standard nan which came complimentary with an entree (at every other Indian restaurant in which I dined).  The rice was extra too. There are better options in this city.", "pics": null}}, {"review": {"des": "The food, ambience, and service were excellent. It is pricey, but that is to be expected for the location. The Hyderabadi lamb curry and lamb biryani were both great. The garlic naan and onion kulcha excellent.", "pics": null}}, {"review": {"des": "Food is great. Loved there masala soda and onion bajji. Service is amazing.However, felt bit expensive.", "pics": null}}, {"review": {"des": "We had lunch buffet. You will lot of options to choose from. Dahi wada, egg curry and malai kulfi ice cream was the best I had for long time. Enough space to fit in. Server's were very active to ask for water and providing naan.", "pics": null}}, {"review": {"des": "This might Not be one of the nice places to have buffet. Almost everything was messed up. Biryani had unnecessary amount of turmeric, pav of pav bhaji were hard even when they heated it. Curry didn't taste as they were supposed to be. I haven't tried their a la carte yet but definitely wouldn't recommend it for buffet.", "pics": null}}, {"review": {"des": "I tried their lunch buffet. They have lots of options but no biryani - disappointing.<br>The best part were the desserts.<br>Also, the receptionist will ask you to put your coats in the coat check by yourself - ughh!", "pics": null}}, {"review": {"des": "Gorgeous ambience! The decor is amazing! The food for the lunch buffet is good but come early before noon. It fills up fast. The staff is very efficient and always busing and cleaning. Well oiled machine! They look professional and I love the cultural nods in the unique uniform with the elegant stitching and vibrant Indian colors! Great place to come for lunch or dinner. I am sure the place is gorgeous at night with the chandeliers and lighting. First class!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/3sCPFf83sPIWjuKYd6wswA/348s.jpg", "caption": "Love the lighting and ambience"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/K7h-MCILnmk_WxPSo18Byw/168s.jpg", "caption": "They have a bar too if you want to not be at a table:)"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/OksfHxWoxkIJdNL1TbjGAA/168s.jpg", "caption": "Good for large groups too! Love the wall paper!"}]}}, {"review": {"des": "A bit overrated Indian cuisine, but not worth the money you are spending. The ambiance is overall okay, we went on the weekend. It was a little bit over crowded. Now lets come to the most important part: the food. We went for the buffet. They have a good collection if you are a vegetarian. You will get at least 6-7 veg items. I wouldn't say the food was good. It was not tasty either. The only non veg item they had were two chicken dishes, and they were terrible in taste. But I must say they appetizers in the beginning and the sweets and mango ice cream were the best part of it. <br><br>Tips: mix the mango ice cream and the rice curd, and thank me later. <br><br>Notes: The checks come with a 18% service tax.", "pics": null}}, {"review": {"des": "First time to try the Indian lunch buffet, it was way beyond my expectation! The tandoori chicken is juicy and the corn methi malai is creamy.", "pics": null}}, {"review": {"des": "We loved the choices at India House. Some simple without a lot of sauce and others with traditional Indian spices and sauces. Everyone was happy with their meals - Tandoori shrimp, chicken kabob and the naan. The service was great too!", "pics": null}}, {"review": {"des": "This is a very nicely decorated restaurant with about 150 different dishes on the menu. Unfortunately the staff isn't very good, and the food is just average.<br><br>It's odd browsing through the menu, because it seems to have little organization with multiple sections devoted the similar categories, and very few of the standbys like korma, saag, and so on. <br><br>We tried Papdi Chat as an appetizer, and the flavors were good, but it wasn't enhanced by the sturdy wafers mixed into it.<br><br>Mahi Mahi Fish Tikka was good fish, but the seasoning on the fish skin wasn't my favorite flavor.<br><br>Bhuni Gobi was extremely overcooked cauliflower; it resembled something that had been sitting on a buffet for hours.<br><br>The best dish was Channa Palak, chick peas in a garlic, onion and spinach sauce. Garlic naan bread was also okay.<br><br>The service staff seems to be mostly Russian, and wasn't strong on communication. They were out of all the juices, and couldn't produce a beer list.<br><br>There aren't many Indian restaurants in River North, but even so, I wouldn't bother to return here.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/QlH5llugkq_6udFzyElRfA/348s.jpg", "caption": "Papdi Chat"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/oHFPpMAL0KLejiThIZQS1Q/168s.jpg", "caption": "Cauliflower, chickpeas, mahi mahi"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/2REVz_xr_zUCm0PY4Bc3Sg/168s.jpg", "caption": "Interior"}]}}, {"review": {"des": "Best tandoori chicken I have had in the Midwest. Sizzling, succulent, juicy, well marinated (could taste the spices and marinade all the way in) and cooked perfectly to be really tender. <br>Loved the fact that the gulab jamuns were not over the top sweet like most other places. <br>Although I really liked the food, for the price, and from what I had heard from friends about this place, I was expecting a bigger buffet. <br>I really liked that they have a nice big wine list on their menu, including Indian Sula wines. <br><br>I would like to put in a recommendation to add 'chaat' items like pani puri, sev puri and/or dahi vada for at least the weekend buffet. <br><br>Overall, great authentic Indian food right in the heart of the city! Don't need to go all the way to Devon for it!", "pics": null}}, {"review": {"des": "Loved the cocktails and food. The restaurant is very nicely laid out with beautiful decor. The ambiance is romantic in the booth seating. My butter chicken was my favorite dish I can't say enough how flavorful and delicious it was.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/09I9zGdejwhwCUOQ2NJgCg/348s.jpg", "caption": "Veggie samosas with sauces"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/CPdi7JWUcjW1MDBKBRhXQw/168s.jpg", "caption": "Cocktails, mango and lichee martini"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/xIyK3RAMFb7z6itB9IL44w/168s.jpg", "caption": "Lobster curry, butter chicken, rice and naan. My favorite was the butter chicken, so delicious and perfect spice level."}]}}, {"review": {"des": "Great lunch buffet- served with tandoori chicken for the table.  Delicious!  Very attentive servers.", "pics": null}}, {"review": {"des": "Good meal but it was an expensive meal. Four of us shared two appetizers, four entrees and two sides, we each got one beer and our check was a little over $200. Eh.<br><br>To start off our dinner, we ordered two types of samosas: <br>*Chicken Kheema Samosas (2 pcs ) - Deep fried pastry cone stuffed with minced chicken.<br>*Lamb Kheema Samosas (2 pcs) - Deep fried pastry cone stuffed with minced lamb.<br><br>Four our entrees we shared:<br>*Chicken Tikka Masala - Chunks of chicken roasted in a clay oven and then folded into a cream sauce.<br>*Chicken Makhani - Chicken pieces roasted in a clay oven and folded in a creamy tomato sauce.<br>*Chicken Vindaloo - Chicken marinated in a blend of vinegar and hot pepper spices.<br>*Matar Paneer - Fresh Indian milk-cheese cubes prepared with green peas.<br>*Saffron Rice - Basmati Rice cooked with rich saffron.<br>*Garlic and regular Naan.<br>All descriptions are off of India House's menu. <br><br>My favorite is the Chicken Vindaloo, I just love spicy things. The Chicken Makhani \"butter chicken\" is also an item that I would order regularly. I just need to learn how to make these things so I don't have to spend the money. haha<br><br>Our waiter was nice but very VERY hard to hear. The interior is gorgeous. Deep purples, dark wood and chandeliers all around. I would recommend this place to anyone that is looking for a place to host an event. <br><br>Overall, the food was good, the prices..not so much. I'd like to go an try the buffett once, the prices seem better but are the food choices good? We'll see.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/V5TTznzOXOsLVXbGCFTqfQ/348s.jpg", "caption": "Chicken Vindaloo"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/BToobv3Wge0cprY_aBhReA/168s.jpg", "caption": "Chicken Makhani"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/0tDT41VvoMHejj5PdP1USA/168s.jpg", "caption": "Matar Paneer"}]}}, {"review": {"des": "I went to India House this past weekend and was a pleasant visit. We decided to try the chicken tikka and the tandoori lamb chops and a regular naan and it comes with rice. The taste was good but some how when we got it was kind of cold which makes the food loose a bit of the taste. <br><br>I order a glass of wine since I didn't want to be risky. The service was great. Overall ok food but a bit pricey for what you get.", "pics": null}}, {"review": {"des": "I love Indian food and as Cincinnati resident, I have to say that the Queen City has Chi-town beat. The environment of India House was good but issues with air conditioning (on a night with a high of 26 brrr) and some fairly flavorless food was- eh. Not the worst, but we had a craving and didn't feel like combing the far reaches of the city. For a tourist, it's fine but for a true die-hard, doesn't cut the mustard. Toned down food is true to a bland tourist palate not to the country of origin.", "pics": null}}, {"review": {"des": "I really like this place.  I will admit that some items do not always hit the mark, but overall the food is great.  The lunch buffet is usually good.", "pics": null}}, {"review": {"des": "Here we are from Florida. This place was great. Had the lunch buffet! Loved that they brought the fresh tandoori chicken to your tablet. Great and spicy food but not overly spiced. Great place! You should make it a point to try this place out Chicago people", "pics": null}}, {"review": {"des": "Surprised to find an Indian restaurant at downtown who served decent food. We went for the buffet that's 14.95 but I would say it's worth it. My favorites on the menu are tilapia fish curry and most of the veg dishes. Since I had only veg and fish this time  . The ambience is pretty decent and upscale. I would go back anytime", "pics": null}}, {"review": {"des": "Yeah...not good. We went with a group of 6 and ordered dishes this share. Of course the food was overpriced-it's Chicago, but there was nothing about the dishes we had that blew me away. The food was FAR too salty and it was definitively the least spicy Indian food I've ever had. I'm not wild about spicy food by any means, but I expect at least a little heat from a good Indian dish.", "pics": null}}, {"review": {"des": "Extremely overpriced Indian food, so-so quality. A solid 2.5 place but I'll round up. <br><br>I would say it's a great spot for date night if you're willing to spend more than necessary. The garlic naan hit the nail in the head so it gets an extra star for me. We shared the baigan bharta and the chicken palak. The baigan bharta dish was different than what I was accustomed to, but I really enjoyed it but the chicken palak was way too salty for my taste. It also really bothered me that they charged extra for rice - is this common practice in Chicago? Service is fine and the ambiance is good, but I think I just really prefer the authentic, mom-pop shops when it comes to Indian.", "pics": null}}, {"review": {"des": "Lunch buffet is great!  $15 about.  Fresh naan was great. Very busy with most tables full.  Nice to try some new dishes without risk.", "pics": null}}, {"review": {"des": "The weekend lunch buffet is super solid. Consistently features North Indian classic dishes. For the options available in River North/downtown, this restaurant hands down has the best variety, taste, and ambiance.", "pics": null}}, {"review": {"des": "This place is my \"go to\" when I'm in Chicago. <br>I am learning/tasting that there are at least two flavor types for Masala(chicken tikki). One creamier and one more tomato ee. If your from Appleton it would be Sai Ram vs Darbar. Green Bay's Taste of India is like Sai's. Creamier. This is the way I like it. I personally choose Sai Ram and Taste of India over Darbar(still really good).<br>So! Just a heads up, if you are like me and you happen to be in Chicago and are hungry for Indian, this is the place. Spot on! Delicious. Great atmosphere.", "pics": null}}, {"review": {"des": "Came here with 7 co-workers. We had lunch buffet. It was only $16, but you hey tons of food. Everything was delicious. Such a wide variety of foods, from carnivores to vegans, everyone can be satisfied  Even though we ordered the buffet, the server was very attentive, made sure if we were done before he attempted to take our plates. I'm definitely coming back here, I loved it.", "pics": null}}, {"review": {"des": "Let's just say that the leftovers still satisfied my tastebuds the next day. <br><br>I started out by ordering a delicious Mango Lassi - it was pure bliss. I also ordered the Papdi Chat and Malasa Papad. The Papdi Chat unfortunately did not seem to have that \"sweet and sour\" taste that it usually has. The taste just felt overpowered the yogurt. Oh well. However, the Malasa Papad was on point. The spices and the tomatoe/onion mix on top worked so well together.<br><br>After the appetizers, I ordered the Paneer Bhurji, Chicken Makhani, and the Vegetable Biryani. The Paneer Bhurji was delicious as fuck and devoured it the next day for dinner. It was flavorful, spicy, and much more. The Chicken Makhani was average - no real taste to it but usually, it's due to its cream base. However, I found that by mixing it's sauce with the vegetable biryani catered to the needs of my taste buds. <br><br>In addition to the food, the service was impeccable. Our server was amazing. He was nice, genuine, and asked if he needed anything in a timely fashion. Overall, I highly recommend this place. It's costly because it's \"fine dining,\" but definitely worth the experience!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/RxpqJm7tz3OeVhyGIIaE6g/348s.jpg", "caption": "Vegetable Biryani"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/hjDXt2s6nF9Gg-mSHYUTZQ/168s.jpg", "caption": "Yummmmmmm. My favorite dish this evening was the Paneer Bhurji!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/GogtW4yq_opGLM2faZhccg/168s.jpg", "caption": "Chicken Makhani"}]}}, {"review": {"des": "I got it by Uber eats. It came in fast and food quantify and price are both good.  Dahi aloopuri was ordered but something else is delivered, paneer kulcha was decent  and Veg-Biryani  below average and pretty bad raitha.", "pics": null}}, {"review": {"des": "Loved the food. Ok I wouldn't chose Indian when going to Chicago yet a friend wanted to go. I would say if you like to experience your taste buds. Try it! Service was also equally great.<br>We enjoyed lamb, samosas, chicken, spinach and way too much bread that a small group of women should have been eating.<br><br>I'd go come back again!", "pics": null}}, {"review": {"des": "Used to be good. Came for buffet - several people eating at the buffet by the food and reusing their dirty plates. I complained to the manager and the bartender who did nothing - most unhygienic - management is non existant - come here if you want to get sick. Where is the health department??", "pics": null}}, {"review": {"des": "Ohh India House how you lure people with your wise selection of sumptuous curries only to fill them up with endless supply of tandoori chicken and naan. I see your devilish plans...and to top it off with delectable desserts.<br><br>I dragged my fiancee to India House earlier today because I wanted good curry. We found this gem on Yelp and fought the freezing, wind chil Chicago weather after sleeping in. <br><br>We were quite impressed with the newly renovated decor. It was very modern with an Indian flair. We were seated in a tucked away spacioua corner of the restaurant where it was quiet and peaceful. The waiter came and filled our waters and then explained that we could start the buffet at any time and that it came with tandoori chicken and naan. <br><br>We headed to the buffet and were greeted by the delightful aromas of Indian curries. There were at least seven different type of curries all very tasty but nut favorite being the tender goat curry.<br><br>My fiancee normally doesn't like desserts, but she thoroughly enjoyed the mango ice cream and kheer. She said she would come solely for the chicken tandoori and desserts. However, there was a small concern of the tandoori chicken being undercooked, but we weren't sure if that was because we didn't leave the chicken on the hot plate long enough.<br><br>If you're in the area and craving Indian food, this place definitely will not disappoint!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/btRuhJ0P6EUoGY47SNVIkQ/348s.jpg", "caption": "Desserts"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/68WI8V41DWNu6j7Zz4h7_g/168s.jpg", "caption": "Free refills of complimentary chicken"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/dZOhlaskBYHKMBZkHecUbA/168s.jpg", "caption": "Complimentary naan"}]}}, {"review": {"des": "Owning the dutches title to this place places me in the position to tell you that this place is not consistent. You can order the same dish twice and it will come out different. As happened to me with aloo tiki chat, the first time I ordered it - it was perfect and thus I ordered it again to find no chickpeas in the dish as written in the menu. The server added some bland and boiled chickpeas after I pointed it out. Food tastes good so that's a plus and the service is decent. Ambience is welcoming and set up a nice dinner mood with chandeliers, window seating and leather booth setup. But definitely pricey as expected from a downtown restaurant. And yes they have a valet parking!!", "pics": null}}, {"review": {"des": "I absolutely love this place after the renovation. It was nice before but the renovation definitely upgraded it. I took my Mother here for a Mothers Day lunch (yes, I am behind on my reviews) and we had the buffet. <br><br>Yum, yum, yum! I prefer the buffet because it offers so much and I would not be adventurous enough to try off the menu. It's not super cheap at $15.95 during the week but its reasonable considering it's all you can eat of super yummy foods and learn what you like.", "pics": null}}, {"review": {"des": "When for the lunch buffet. I would definitely recommend. Once I'm someone that could eat samosas all day, I thought the price for the buffet wasn't bad. They also brought tandoori chicken to the table whenever we wanted it so it was always hot and sizzling. We came to the buffet late, so we didn't get a chance to eat any desserts, but I'll update of I go back!", "pics": null}}, {"review": {"des": "This is my favorite restaurant. I went there twice. First time with my husband and friends and second time we celebrated my mother's birthday. My parents don't like spicy food but they said it was very delicious. Nice atmosphere, reasonable prices, very friendly people and amazing food. I love this restaurant.", "pics": null}}, {"review": {"des": "I was in the mood for Indian food so I came to this place, and I didn't get disappointed. The food is tasty and the service friendly and fast. Really good option for Indian food in downtown Chicago.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/yJIWoRy-tu648p7VFnApEg/348s.jpg", "caption": "Chicken vindaloo...really good!"}]}}, {"review": {"des": "Just a fantastic place.  The buffet is excellent and the people are very friendly.  Plus the tandoori chicken is made to order and it is included in the price of the buffet.  This is the best Indian restaurant I have found in Chicago!", "pics": null}}, {"review": {"des": "Good Indian restaurant--but there's better food Indian food in Chicago.<br><br>I have been to India House several times, and I just feel like I shell out more money than I need to for the amount and quality of the food. Dinner for 2 almost always $50. They have a nice thali deal for dinner that I would recommend. I have always enjoyed their lunch buffet; though, it is also pricey. I think I like the lunch buffet more than the dinner options--maybe because I feel like I am getting more of my money's worth.<br><br>The location and atmosphere of India House is really good though. In the summer, they make it open air so it's really nice in the morning or for lunch.", "pics": null}}, {"review": {"des": "Everything about this place was good. Things were a little expensive, considering how small the portions are. But it was very tasty and the ambience was really nice. <br>Of course the best way to dine is family style, so we got a little of everything. We got lamb Rogan josh, dal, buttered chicken, a fish dish, and an okra dish. And of course a basket of naan.<br>If you're willing to spend a little more money than usual in order to have a tasty meal, definitely check this place out. And be sure to bring friends.", "pics": null}}, {"review": {"des": "Food was delicious, service was awesome! Definitely recommend this place for Indian food lovers. Enjoyed the added layer of ginger in all of meals, which I hadn't experience before.", "pics": null}}, {"review": {"des": "I'm giving this restaurant 3 stars because the decor and ambiance is amazing and you really can't fault the chef on anything, the food was spectacular. <br>However....<br>I left here with a bad taste in my mouth and I'm certain it was from the awful cocktails they mix up. The place seriously needs a new bartender. On the plus side, if you suffer from alcoholism, the drinks are so bad that it's certain to cure it.<br>Seriously though, after taking a sip I asked he waiter if they could add something to change the awful taste, he took it away and brought it back and it was still awful. My brother got the pomegranate martini and same story with that, awful drink, taken away, same awful drink brought back. After complaining about it and just sending the drinks back and deciding to go for a safe beer that the bartender can't ruin low and behold, they've still charged us $28 for the 2 drinks that were sent back. <br><br>Once again I'll be fair and say that the place looks great and the food's delicious but stay away from the cocktails.", "pics": null}}, {"review": {"des": "Good ambience and even better food. <br>Wait times are always reasonable.<br>Mango ice cream is yummy.<br>Can't ask for more .", "pics": null}}, {"review": {"des": "Loved the food, the presentation, the ambience... everything. We were there for a lunch buffet, and it was absolutely awesome.", "pics": null}}, {"review": {"des": "I went here with my friends from India and they tell me it is very close to being authentic. The chicken marsala and frozen drinks are yummy. I also had the dolma which is hard to hate anywhere.", "pics": null}}, {"review": {"des": "It's hard to find good Indian food in the city and I usually find myself going out to the suburbs for it. Turns out India House was better than I expected, albeit definitely more on the expensive end. <br><br>Favorites: <br>- Mango lassi - Super delicious, creamy, and tastes like real mangoes. Just a warning that my drink was slightly sour which I enjoyed because it meshed with the sweetness of the mangos.<br>- Onion Bahji Appetizer - Loved the three sauces it comes with, they were perfect dipping compliments to the fried vegetables.  <br>- Chicken Makhani - Butter chicken in a tomato based sauce. Great spices, a lot of chicken - most pieces were tender though there were a few that seemed more dry.<br><br>Skippable:<br>- I wasn't a fan of the garlic naan which is sad because I love garlic naan. It's a must-get for me at every Indian restaurant. This one here just wasn't fluffy :( and was rather stiff. <br><br>The lunch buffet seems like a great option and if I were to come back, it would be for that! Dinner can add up to be way pricey!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/fqjvyG1AYOVwTwk6Fs_5Xg/348s.jpg", "caption": "Mango lassi"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/7jX2KLVk7JPc0glkKUQxOw/168s.jpg", "caption": "3 dipping sauces"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Pi38VNRonzEP3D2FeP944A/168s.jpg", "caption": "Onion bahji"}]}}, {"review": {"des": "Consistently good food and cocktails. Just 1 star off for being totally overpriced. I actually had my wedding catered from here a few years ago. The valet parking is convenient.", "pics": null}}, {"review": {"des": "Good service and excellent ambiance. Would make an excellent restaurant for business meetings as noise level is low. <br><br>Food is authentic and the use of spices is perfect. The regular Spice amount is not too spicy. <br><br>Music, candles on tables, and ambiance make the restaurant also nice for date night.  <br><br>I would not say the restaurant at dinner time would be child friendly as the environment is quieter. <br><br>I would recommend for dinner", "pics": null}}, {"review": {"des": "This was my first time having Indian food and I'm glad it was here vs a small fast food kinda spot. The food had a very unique taste, but really good. I tried this one bread, it had cherry, coconut, and almonds, I believe, and it was jaw dropping lol. I have never had a bread so amazing...jeez. I was happy with the food. It was very tasty.", "pics": null}}, {"review": {"des": "One of the best North Indian buffets .<br><br>Good buffet over weekend. Little pricey but it's downtown.", "pics": null}}]}