{"name": "intelligentsia-coffee-chicago-8", "reviews": [{"review": {"des": "I'm a big fan of Intelligentsia and this is one of my favorite locations of theirs. Tucked into a historical Chicago building it has awesome old timely ambiance. That is until you go to order and are met with all the latest trends in artisan coffee. <br><br>They certainly don't disappoint with their beverages. A beautifully crafted coffee, an oat milk chai, iced tea, and other treats. You can't go wrong.", "pics": null}}, {"review": {"des": "Anytime I come to Chicago, usually a stop to an Intelligentsia happens. While it is one of the larger 3rd wave coffee chains, I still find they produce a great cup of coffee and are consistent. <br><br>Stopped here for a quick cup to go and was not disappointed. They have a two pour over options and only one brewed ahead of time. Good variety of beans, Ethiopian, El Salvador, and a Kenya.", "pics": null}}, {"review": {"des": "Excellent coffee, good atmosphere. <br>Quality food.. what more does one want before they start the day:)<br>Will be back. Thanks for great service", "pics": null}}, {"review": {"des": "Was in Chicago for a conference and went to Intelligista in the mornings for a coffee and pastry (3 visits).  I've been to other outlets mainly in Los Angeles and intelligista is one of my favorite specialty coffee chains.<br><br>My rating is based on the following: <br><br>Coffee: 4.5 stars<br>Coffee beans: 3.5 stars<br>Service and atmosphere: 5 stars<br>Food: 4 stars<br><br>I tried the chocolate croissant as well as the ham and cheese pastry. Of the two I would recommend the ham and cheese pastry. <br><br>I am a black coffee drinker and had the pour over with what ever beans they were brewing on hand that day.  During that time period it was mainly beans from the South American region. I prefer African beans with more acidity and fruit flavor to the smooth and nuttiness of a Columbian coffee. <br><br>Coffee as in other locations was good and the staff is friendly and helpful with recommendations. Given <br><br>I purchased beans both the Peru and Persephone blend.  Can't really recommend these beans. They aren't bad per say but nothing special and was a bit disappointed when I started using these at home.", "pics": null}}, {"review": {"des": "Great latte. They don't have the super comfortable furniture probably to keep folks from sitting there all day. <br>It's clean and in a good part of town. I would definitely make it a meeting spot if I were more local.", "pics": null}}, {"review": {"des": "I don't get what the hype is about. Cappuccino was average at best (it was pretty though). Milk foam was nice but not that velvety. Temperature was good. That average cappuccino with above average price tag took about 10 minutes to be made. I thought the staff had gone to the pasture to milk the cows or something. Maybe I should mention that there were no other orders ahead of me. Regular brewed coffee came out fast (already brewed, duh)  but way too sour. Would not recommend.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/GNp0PIMtHmO60GGEtglSNg/348s.jpg", "caption": "5oz cappuccino. Pretty, but taste and flavour are underwhelming and it took way too long to be made."}]}}, {"review": {"des": "People are always raving about how good the Intelligentsia cafes are, so, since I had time to spare downtown today, I parked myself in one of them for a couple of hours. What a disappointment! While the baristas act like they are Tom Cruise in Cocktail, dressed like they are ready to hit the trendiest night club in town at a moment's notice, my matcha tea was not even close to the temperature it should have been (even after they made it the second time as, when they handed me my tea in what looked like a glass of water for infants, I had to ask them to transfer it to a container more adequate for warm drinks like, one with a handle!), all the pastries available were covered in either a thick coat of granulated sugar or some form of strange dry-looking glaze (which I do understand is what most Americans are attracted to, but, come on, give me some other options!), and the seemingly day-old dry and cold croissant I was served, without butter (!), certainly did not hit the mark either. So, thank you very much for the heat and shelter you provided, but Never Again!!!", "pics": null}}, {"review": {"des": "Stopped by after coming in on the train, looking for some yummy coffee to warm me up. This place delivered! The art on my mocha was beautiful and the mocha tasted delicious! The taste is a perfect balance between chocolate and coffee!", "pics": null}}, {"review": {"des": "TLDR: Was great for a quick coffee.<br>_______<br><br>Waiting for breakfast a block away dropped in here for a coffee while I waited<br><br>I'm basic, so I always go with a vanilla latte. I actually forgot to add vanilla to it and they were kind enough to add it later and didn't up charge me. Super cool of them. I think they make the vanilla in house - it was a super good and well done latte.<br><br>Nice wooden shelves (bar) with wooden stools. Cool decor. They had really cool art . The posters were like a maze where you have a start and finish and also snapshots of famous sites around town.", "pics": null}}, {"review": {"des": "We came here because we had time to burn before Halal Guys opened for lunch a couple blocks away and I'm glad we picked up coffee at intelligentsia. My vanilla latte was perfect--no complaints. Baristas here know their stuff! The interior is also really cool--a lot of people chilling here with laptops or reading books. <br><br>Only downside is that it's expensive! But...it is truly well-executed coffee..", "pics": null}}, {"review": {"des": "I think the staff are really nice and knowledgeable. That brought me from a 3 Star to 4 Star experience. I had the La Tortuga, which was smooth and not too acidic. Almost a hint of chocolate taste? I could be totally wrong, but it's what I personally taste. Was it phenomenal? Not really... Would I come back? Maybe if I was in the area and needed a casual coffee fix. It's a chic place with a nice ambiance.", "pics": null}}, {"review": {"des": "This matcha latte was $8 (& some change) :( yes I get it, it was probably good quality matcha and they encouraged me to try it with oat milk but I just cannot justify $8 for a SMALL portion of matcha. I would prefer an extra large steaming hot cup that I can sip on for an extended period of time, not this shooter glass. Also because of this price I was discouraged to get a pastry and to be completely honest I walked straight into Dunkin' next door after this and got my usual wake up wrap and iced coffee because I felt so unfulfilled. Got a good insta story tho!", "pics": null}}, {"review": {"des": "Very good coffee but the barista take his job very seriously leading to long waits for your drink", "pics": null}}, {"review": {"des": "Got the cold brew. It was good, but not great.<br>I am nitpicky with my cold brew. For me, it needs to be smooth without much acidity while having nutty caramel notes.<br><br>The acidity of the cold brew left an unsatisfying aftertaste in my mouth.  The coffee just needed some more milk before I could enjoy it. If cold brew require's milk to ease the acid, then cold brew is not the best IMO.", "pics": null}}, {"review": {"des": "Consistently great coffee at all Intelligentsia Coffee cafe!<br><br>Rich, intense, aromatic and smooth flat white. Just the right balance of milk and coffee. Their barristers never failed to make my day with their coffees! Beautiful in execution, balance and presentation.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/k-ym_cQnwk5URKixO0_Vlg/168s.jpg", "caption": "Flat white. Try it and fall in love with it! Smaller cup, milky, creamy but stronger coffee flavor."}]}}, {"review": {"des": "Great place to get a coffee and snacks. I was super curious about the name. I had a butter croissant, Havana cold brew and chai mata latte. I loved taking a little break from exploring the city. The coffee was good and was much needed. Stop by if you see one :)", "pics": null}}, {"review": {"des": "I was visiting Chicago for work and decided to try this place out on Saturday morning. I heard they have a Geisha coffee, which is rare to find, so I walked the two miles from my hotel to try it out, only for the barista to tell his manager that he doesn't feel like making it.  There was no explanation as to why he didn't want to do it, and there wasn't a line, as I know that pour overs can be a time consuming process. They fumbled to make an alternative suggestion, but I simply left in frustration.  Plus one star for the unsuccessful attempt.", "pics": null}}, {"review": {"des": "If you are looking for good coffee but willing to pay a pretty penny for it, come here. The menu offers your staples and some more adventurous drinks. The only milk alternative available is oat milk, first I was scared but actually was pleasantly surprised. There's an assortment of treats and pastries that taste as good as they look. Overall this place feels as smart as the name makes it sound.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/tGNduUSSrd15MRcmwF4dsQ/168s.jpg", "caption": "Iced coffee and matcha cake"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/6m_6XbTf_ET_dYjSe65ftw/168s.jpg", "caption": "Inside"}]}}, {"review": {"des": "I got the tea which tasted great but over all there weren't many options and it seemed a bit over priced. It's cute, but it's not much.", "pics": null}}, {"review": {"des": "I absolutely love their Limelight! It is a seasonal drink, but boy does it have a nice tangy kick to it! Never knew coffee and lemon could be a great combination. The cafe is small and inviting. Noticeably great for work/studying as it was quiet and had several tables. Will be back for my limelight when I'm in the area!", "pics": null}}, {"review": {"des": "I think Intellegentsia is the best coffee in the world. The spaces are always so cool and the baristas are beyond knowledgeable. This location is no different! The cool vibe inside matched the baristas. It may seem a little expensive but in my opinion its totally worth it. Once you try the vanilla latte, it'll be hard to go elsewhere....", "pics": null}}, {"review": {"des": "I was so impressed with this coffee joint. My friend and I came here while waiting to be seated for brunch close by, and I wanted a coffee. There was a fairly long line when we got in, and the store itself isn't too big so there's not much moving room. <br><br>My usual order is a vanilla soy latte, but the cashier recommended me oat milk so I decided to try that instead. Their coffee is SO good. I could definitely tell the difference in quality and the vanilla added the right amount of sweetness. My friend got a hot tea which came in a mini pot and a bowl to pour it in. It was so cute!<br><br>The only negative thing was that my coffee came out to $6 which is quite steep, but I didn't mind too much since I was on vacation. I don't know about spending that much on coffee on a regular basis though.", "pics": null}}, {"review": {"des": "It has become tradition for me to visit an independent coffee shop in any city I travel to. I'm a big fan of Chemex/pour-over coffee, and I absolutely love third-wave coffee roasters and independent coffeeshops. I've had all the \"Big Three of Third Wave Coffee\" coffees - Stumptown, Intelligentsia, and Counter Culture - but this was my first time visiting a standalone Intelligentsia Coffee shop.<br><br>This Intelligentsia was only a mere block from Millennium Park, so it was very conveniently located. I like the industrial feel which didn't diminish the coziness of the shop. There's a large coffee bar, behind which the baristas work their magic. There's a handful of seats available, but it can definitely fill up quick. <br><br>If you are a fan of Chemex, V60, Siphon, and Cafe Solo, you will be satisfied with Intelligentsia's offerings. They also have espresso, cold brew iced coffee, chai, loose leaf tea, iced tea, matcha latte, and hot chocolate. I had their Chemex and their matcha latte, and both were fantastic. The baristas take great care in crafting the perfect cup for you. I like that for Chemex, they'll give you a cup of the brewed coffee and an additional decanter of extra coffee on a wooden tray. <br><br>Free WiFi too!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/9w5XwaSFsruTGuCnMP_O3A/348s.jpg", "caption": "Matcha latte"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/bw-NbilcZwvoiR3raTEBbQ/168s.jpg", "caption": "Chemex coffee"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/XcYHIvcCB8IiWQ6kk6Nmvw/168s.jpg", "caption": "Chemex coffee and matcha latte"}]}}, {"review": {"des": "Solid coffee shop with a cool vibe. Open space with room for studying or reading--it probably seats around 25 people. Outside seating is available. Overall good experience. The coffee itself was pretty good--they roast their own beans which is always a plus, considering they have control over their flavors. The only reason I gave it four stars is because I've had better coffee from other roasteries. With that being said, if you're just looking for a good cup of coffee, this will be a good experience.", "pics": null}}, {"review": {"des": "Ordered a mocha \"for here\" and it came in a great big cup, had some fun latte art, and was just the right amount of chocolate and coffee. Since visiting Chicago, my palate has definitely changed and I am not in desperate need for there to be a sweet component to my coffee anymore. With that said, the bittersweet of this mocha hit the spot, and anyone who may want to hit that chocolate and coffee fix in one go, this is the way to do it.<br><br>The coffee shop has bar seating as well as lower sitting tables to meet a variety of needs, whether you just need a place to stand or if you're wanting to spend the afternoon there.", "pics": null}}, {"review": {"des": "I was in need of a good cup of coffee. I knew Intelligentsia was the place I wanted to go. Quiet little place. Only a few people with their laptops out.. a few tables of friends catching up.. ya know like how grabbing coffee used to be. Countertop areas for the solo coffee Connoisseur.. light pastries to accompany your coffee or tea.. brightly lit. <br><br>As for the explanation of the type of coffee used in my latte... it didn't happen.. only reason for the 4 star review.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/-mltPJVhtrSyZ7El23iSCQ/168s.jpg", "caption": "Latte has my heart.. calming atmosphere"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/wpY5wvJcQP_Mdm2xGzhIrg/168s.jpg", "caption": "Latte Love"}]}}, {"review": {"des": "INTELLIGENTSIA! I've finally made it! <br><br>I first heard about Intelligentsia while watching the documentary \"Barista\". I immediately knew that this was one of *the* places to go if you want legit coffee from legit baristas (I'm sorry Starbucks, I promise I'll return to basic once I get back home!). <br><br>The Black Cat cappuccino was absolutely divine! Perfect ratio of espresso, milk, and foam and beautiful presentation. I also tried just the Black Cat espresso and it was smoooooth! This location is a short walk from Millennium Park and the baristas were very professional and friendly. Seating is limited and the place can get pretty packed during peak hours, but don't let that deter you from trying Chicago's best coffee!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/-YBgTwM6GaOPc_kPkkDcJw/348s.jpg", "caption": "Black Cat Cappuccino - $3.50"}]}}, {"review": {"des": "The oat latte is what people search for their entire lives. It's a latte so perfectly crafted it deserves to be in sears. Get it? Craftsman? No. Okay. But seriously, try it iced. It's just so yum.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/KKFSAE3SWksmq0eNF-xOGg/348s.jpg", "caption": "Iced Oat Latte"}]}}, {"review": {"des": "I honestly can say that the customer service is awesome and the meals are great.<br><br>My buddy tried black cat cappuccino and I purchased mocha latte which I find very good. I had a little sip of what he purchased and think it is average.<br><br>Had a good time! I likely will return.", "pics": null}}, {"review": {"des": "Had a Chai Latte, which was perfectly balanced. Delicious foam. Savory scone was nice and tasty.", "pics": null}}, {"review": {"des": "A couple of coworkers brought me by Intelligentsia recently and I really enjoyed myself. The highest marks belong to the ambiance and just overall style and class of the venue. Otherwise, I have never really been a fan of the coffee at Intelligentsia, it just has some weird, put-off kind of taste to me; hard to explain.<br><br>Otherwise, I would come back in hopes to find a tea I could enjoy in the cool, modern space that is Inteliigentsia. A definite plus is that the staff members are really nice and helpful.", "pics": null}}, {"review": {"des": "This place is the WORST. One of their employees is pissed off all the time, refuses to make eye contact or be pleasant, and literally scowls at patrons. How does someone like this remain employed? Additionally, everything takes forever and a day. And the drinks are gross. The cream is subpar, the coffee itself is bitter and reddish colored, and their specialty drinks are even worse. My iced mocha had clumps of chocolate in it. Wtf? Avoid this place at all costs.", "pics": null}}, {"review": {"des": "Intelligentsia is a really nice cosy place in loop. Highly professional staff and great coffee quality. <br><br>I ordered the almond cappuccino made from Kunga Maitu, Kenya beans. It has the typical berry/black current flavor of Kenya beans. Overall profile is very well balanced and smooth. It smells woody and nutty with a consistent beauty-berry-sour taste. The finish is bitter and neat.<br><br>Enjoyed the visit. Will try out the New York location too. Congrats intelligentsia on making the 20 year anniversary! May the goodness continue for another 20 years!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/axJAwgxduDaRxt0fi8B0gw/348s.jpg", "caption": "Kunga Maitu, Kenya beans made in cappuccino"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/jInutZ6OM79eJufbxer3XA/168s.jpg", "caption": "Menu"}]}}, {"review": {"des": "Affordable High Quality.  Love and Loyal to Intelligentsia since Lakeview and Day 1 of this location.<br><br>MENU -- I love options!  Sophisticated than ever.  Quality beans.  Generous standardized Art Latte.  MACCHIATO automatically came with lightly fizzy water.  The ANGELENO with 4 shots of espresso for $5.5 is an excellent value.  You can have 2.5 shots for half the price.  How hard does your heart palpitate?  *wink*<br><br>VENUE -- plenty of comfortable seating that easily gets crowded.  2 unisex bathrooms.  Due to limited space, this cafe is not meant for hours-and-hours of lounging.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/S_V0Q3ciadqoefK6UFKJ1w/168s.jpg", "caption": "FLETCHA ROJA Macchiato.  The tulip could also look like a vibrating/palpitating heart."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Kb4L2q8NL3p2hkMZTT-Q6w/168s.jpg", "caption": "Menu (7.2016)"}]}}, {"review": {"des": "Why does this place exist is my question. The prices are outrageous.<br>The staff is very rude. This place really could use diversity training.<br>In my opinion, any coffee shop beats this place.  What does it cost to have some customer service and a smile? They remodeled the store but not the attitudes of the staff. Re do everything not just one thing.", "pics": null}}, {"review": {"des": "Unknown to me, I walked in one minute before the registers closed down for the night.  Whoops.  I was in Chicago for a conference and stopped here because it was on my list of coffee places to visit.  When I got to the register the barista said there was one minute left before it would close.  I really wanted a coffee and they looked as if they were just finishing cleaning up their equipment.  The manager saved the day by offering me a free drip coffee, which was brewed only 20 minutes prior, and we were all happy :)", "pics": null}}, {"review": {"des": "My latte was pretty good. The latte art is always a nice bonus. I wish they had almond milk as a milk substitute.", "pics": null}}, {"review": {"des": "They made me an excellent Flat White, despite it not being a menu item :)   Bit of a wait but the place was pretty busy.  Found a seat ok and jumped on the WiFi to do a little work before grabbing another Flat White to go.  Nice ambience and friendly staff with the Hipster vibe", "pics": null}}, {"review": {"des": "$4.46 for a medium cup of coffee? LOL!!!<br>Why on earth would anyone return? <br>Is the coffee that great? Nope.", "pics": null}}, {"review": {"des": "The pour overs and espresso need no additional reviews - all has been said about how delicious they are - I had an oatmilk cappuccino. I must add that the rooibos tea was a surprisingly fantastic selection on a rainy, dreary evening. If you are looking for a non-caffeinated option, order the rooibos. Enjoy!", "pics": null}}, {"review": {"des": "It was a really bad experience! I don't recommend drinking espresso coffee, the test was the worse that I never had before! Besides It is really expensive, more than 5 dollars! The service was crazy, I waited for more than 15 min for just one coffee! <br><br>Guys, maybe if you chose another drink you will have different experience! Good luck! But my husband and I won't return here!", "pics": null}}, {"review": {"des": "This Intelligentsia location is by the entrance of Manadnock building on the corner of Jackson and Dearborn.  For those who work at the downtown Loop area, this shouldn't be too difficult to find.  However, if you're new or visiting Chicago, \"Dearborn\" is a north-south running road, roughly speaking in between \"State\" and \"Michigan,\" the commercial, touristy street names that most of us are familiar with.  <br><br>I happened to be in the area this afternoon and wanted to grab a cup of latte to-go before hopping on the Blue Line Train for work.  This place seemed to have enough baristas on duty since people working in the office buildings should be tempting enough to load up some coffee in their useable cups or thermals.  <br><br>I should bring mine as well to reduce the amount of paper cups we humans use daily.  <br><br>Obviously the prices on the menu already had tax included.  It doesn't necessarily make it easy for me since the \"numbers\" is really Rosa J.'s middle name.  Surely some of us like to see some integers and view any zero to nine on the right side of decimal as enemies!  <br><br>I'm not sure if this is a good sit-down coffeeshop, for the business primarily caters to the downtown working professionals.  Leaving the place with a quality cup of coffee to-go then heading to your final destination is always a choice!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/MHFtQ-zjOuGVqW0sbouoXA/348s.jpg", "caption": "Another latte at intelligentsia"}]}}, {"review": {"des": "Awesome coffee.  Had a soy latte.  So smooth, so strong.  So delicious.  The croissants with almond are quite delicious, too.  Well worth the price/the trek if you aren't nearby.  Just stock up on their bags of coffee!", "pics": null}}, {"review": {"des": "As far as top notch coffee goes, this place when's the award. They were along small farmers and growers to produce exclusive coffee for their stores, which are located in Chicago, L.A., and N.Y. C.. The coffee may only be available for limited times, because they work seasonally with growers to ensure the best quality and fair trade agreements.<br><br>The coffee is brewed so every note and flavor comes through.  If you're drinking good coffee, sugar shouldn't be necessary because of the fruity, sweet flavors of the bean or cherry coming through to the end of the process.<br><br>The atmosphere at this cafe is relaxed and friendly. The baristas and roasters do a wonderful job explaining the brand and assisting with questions.", "pics": null}}, {"review": {"des": "Matcha latte almost makes me cry! As a big fan of the real coffee and tea, I was fed up with the Starbucks style super sweet something. And here I am! Love it, love it, love it! Takes me back to Kyoto!", "pics": null}}, {"review": {"des": "Loved studying here during my visit to Chicago! The coffee was really rich which took me a little bit to get used to, but in the sense that I was usually used to Starbucks drinks. I got the vanilla latte which wasn't too sweet and was great for the cold day when I visited. The wifi was fast-- but it can slow down when it gets crowded. I got a seat the booth, but you should try to visit early as it gets crowded really fast.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ePU-HLrlmT3r6h4C401MNw/348s.jpg", "caption": "vanilla latte!"}]}}, {"review": {"des": "It took me four years of college until I finally got to Intelligentsia. To be honest I didn't want to go. I always pictured Intelligentsia as snobby because I know of a couple places in Indy that serve it and I thought \"hey now, why not serve an Indy roaster you uppity poots\"<br>Maybe these folks in Indy just know good coffee because this was GOOD coffee. The cold brew was so smooth that it could have played a mean saxophone solo. The loose leaf tea came in an awesome cup that warmed your hands and your heart. There was ample seating, good lighting, and opportunity to Instagram (follow djeccles for my adventures) with Popular Pays for a free coffee. I wish I would have gotten over my Intelligentsia fears and had this earlier. Don't make the same mistakes I did my friend.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/KKwLZIIJxCd8XaQCXAAGIQ/348s.jpg", "caption": "Cold brew and a jasmine tea."}]}}, {"review": {"des": "A cozy coffee shop near the bean/michigan ave.<br>I came in just to get a coffee in the morning. However, their foods look awesome! They have a great selection of pastries and drinks.<br>Love the place, and the people!<br><br>I am pretty sure i will come back!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/iR1LagFWz1TfleiSJ2zxkg/348s.jpg", "caption": "Espresso and a soda water"}]}}, {"review": {"des": "I LOVE Intelligentsia coffee, so I was very excited to visit their cafes on my recent Chicago trip. This location is a real looker, with marbled counters and tiled floors, and its street side location in the historic Monadnock Building. The baristas are as dapper as can be with their bowties and Newsie's caps. Necessary? No, but it's an aesthetically pleasing touch to this already classy place.<br><br>We lingered a bit to get charged up for a long visit to the Art Institute, and enjoyed the buzz of the place. The Paris bombings had happened a day or two before, and there was a community feeling with people getting together, discussing current events in French and English, and surprisingly not a lot of people tippy tapping on their computers or tablets. <br><br>Can't go wrong with any of their drinks. I had a classic chai, which was a warm treat on a windy day. I almost filled my suitcase with bags of beans, but bought just one, their Ethiopian Yirgacheffe, whose light and floral notes make me happy. <br><br>Would I have to choose just one Intelligentsia location to patronize, this would be it. So much to enjoy just steps away, but a caffeinated oasis and shelter from the wind inside.", "pics": null}}, {"review": {"des": "Visiting from out of state and we happened to walk by. Stopped in for a coffee and chai (really good). Cool place, great quality.", "pics": null}}, {"review": {"des": "I love everything about this place except its location...need to pick this up and move it along the route of my regular commute.  Great Art Deco lighting, white marble tables, and the baristas here are artists.  I have yet to come across a better cappuccino in Chicago.  This place makes me long to be called again for jury duty...", "pics": null}}, {"review": {"des": "A delightful cup of Joe and a cool place to hang out. I wish I discovered this place on day 1 of my trip to Chicago.", "pics": null}}, {"review": {"des": "Delicious coffee in an amazing area! No better place to start your day than here! <br><br>Cafe pastries are offered here along with their drink options for a great light meal.<br><br>My boyfriend and I ordered the 20th Century Blend and the vanilla latte. The Blend Coffee was very robust and strong. The Vanilla Latte was incredibly creamy, smooth, and had the perfect amount of sweetness! Both were really really delicious! <br><br>The space itself had a lot of standing space but the seating and tables were full. This is a great place to grab and go coffee but I would have loved to have sit down and enjoyed my drink. Being in Downtown Chicago, this is to be expected, but walking around was no problem at all!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/EYGeekpZAIdggC4-UnMLNQ/348s.jpg", "caption": "Vanilla Latte-Delicious!!"}]}}, {"review": {"des": "Great fast coffee with an atmosphere that is welcoming to linger in. I'll often get my coffee and brioche (GREAT brioche) and change my mind about running back out the door into craziness.<br><br>The patrons are lawyers and students so people watching isn't as much fun (because of the liability of being caught) but it's still a safe fun crowd of the priveleged who gather to self-caffeinate.<br><br>I come here because it's close to the Federal Detention Center (MCC) where I volunteer.", "pics": null}}, {"review": {"des": "Shining example of the coffee-as-theatre flagship. Gorgeous, with carefully composed drinks. The best coffee experience I had in 4 days in Chicago.", "pics": null}}, {"review": {"des": "Why is so difficult to find a decent espresso in this city? :(  I've tried Intelligentsia at a few different locations and this one was no exception. Their espresso is everything it's not supposed to be - some times bitter and other times sour. I don't know if the issue is with over-extraction or the temp, but I'm not dying to go back. Also tried a cheese scone, which was underwhelming.", "pics": null}}, {"review": {"des": "Good place to come for coffee. It has a mix of seating.. counter space, a couple of small tables and a larger community table. <br><br>The coffee bar is large. Takes up most of the store. They had 6 people working there, which seems like a lot for a coffee place, but it was super busy there, popular; they actually needed the volume of staff.<br><br>I got a latte. I asked it for it skim, they only had 2% milk. It was creamy, subtle earth flavor. The espresso almost had no flavor. You can taste the milk and feel the caffeine but the espresso is super soft to taste. <br><br>I also got a tea cake. It was like a pumpkin muffin with sugar crust and toasted pepitas on top. The difference between the tea cake and a pumpkin muffin was its softness. It was more fluffy than a muffin.. almost like a pumpkin flavored angel food. Delicious. Paired lovely with the coffee.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/zdvfZvp1UrtVLzyrNnO0aQ/348s.jpg", "caption": "Latte and tea cake"}]}}, {"review": {"des": "This coffee shop is amazing! I tried their cold brew iced coffee with oat milk and I never want to drink any other coffee after tasting this! It's a small upscale shop. But beware they are not open on Sundays. I will definitely be back!", "pics": null}}, {"review": {"des": "I love visiting here everytime I'm in Chicago. Fantastic experience every, single time! Pour overs are always with the wait! Some locations evening feature artisanal chocolates. Be sure to grab a bag of black cat espresso to go and try the candies :-)", "pics": null}}, {"review": {"des": "I'm a West-coast coffee snob and NEED great espresso when I'm on the road. My day is rough until I get great coffee. Thanks to this Cafe Intelligentsia, all my Chicago days are wonderful. <br><br>The staff is professional, chipper, great-looking, and fun. <br><br>The coffee is real, delicious, and effective. <br><br>The atmosphere is fabulous. Clean and upscale, the patrons are mostly hip, high-performing looking people that range from business to artist to student. <br><br>I love it here!", "pics": null}}, {"review": {"des": "My Go-To coffeeshop in this part of the loop. Partly because there's not many other options. Although there's usually a 2-5 person line around 10a most days, it moves quickly enough.<br><br>It's a warm refuge on those windy winter days when you need to get out the office because your manager is micro-managing you. Or the office coffee still tastes like metal.", "pics": null}}, {"review": {"des": "black cat classic latte $4 (dark chocolate and ripe cherry). good coffee at the perfect warm temperature that doesn't burn your mouth. adorable latte art. super hipster. <br><br>i usually come here when i'm waiting to eat at wildberry. it's a good way to kill some time.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ZeSN1MOcim8fniFcX99sng/168s.jpg", "caption": "Black cat classic latte"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/5jBi-ukMM5PHoSF5nj0sMQ/168s.jpg", "caption": "Black cat classic latte"}]}}, {"review": {"des": "I finally had an opportunity to try Intelligentsia Coffee at their place of origin - Chicago. This is one of the six Chicago locations (as of October 2015) and it is also conveniently located right next to the Millennium Park. <br><br>I've visited Intelligentsia Coffee once before (in Pasadena, CA) and their Black Cat Organic Latte was really good; however, I wanted to try something else and I decided to stick with the ONLY available cold coffee drink on the menu - cold brewed coffee.<br><br>***<br><br>Cold Brewed Iced Coffee + Almond Croissant: Cold brewed iced coffee tasted slightly acidic (sour), but it wasn't overwhelming enough to interfere with the overall flavors. Almond croissant tasted pretty good, but nothing too spectacular.<br><br>***<br><br>Hey Intelligentsia Coffee is Chicago's signature coffee shop, so you should definitely give it a try. <br><br>P.S. - Intelligentsia also offers public roasting works tours once a month for $30 per person (<a href=\"/redir?url=http%3A%2F%2Fwww.intelligentsiacoffee.com%2Fcontent%2Fpublic-tours&s=aa4315936a918c1d245525a042c8a98d503a41f6428f65095875ae98734a3453\" target=\"_blank\" rel=\"nofollow\">intelligentsiacoffee.com…</a>).", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/-pnh5gOn2Ia3vgSXD0IovA/348s.jpg", "caption": "Cold Brewed Iced Coffee + Almond Croissant"}]}}, {"review": {"des": "Intelligenista is the perfect place for a splendid cup of coffee for your morning. Having a lively and hippy atmosphere, this coffee shop is designed to make you feel relaxed but at the same time, productive. <br><br>Their latte art is extremely on point - delicate and clean. The latte itself is foamy, creamy and has just the right amount of sweetness enhancement. What we found behind each cup of coffee is the coffee bean served here has been roasted locally. That is the most important thing which gives the taste of Intelligenista's coffee strong, fresh, robust yet extremely fragrant. The unique flavor remains in every sip, which is impressive. When you walk in here, you're in for a treat. They also have a small variation of pastry in case you crave something simple for breakfast.<br><br>Recommended : Mocha Cappuccino, Almond Croissants, Vanilla Latte<br><br>For more, visit us at: <a href=\"/redir?url=http%3A%2F%2Fwww.thecoupleeats.com%2F5-must-try-dining-places-in-chicago-for-first-timers%2F2%2F&s=285fc637c4df7685b2e982d508a9a29973b38f5fe245bc0640c5dc773f412c01\" target=\"_blank\" rel=\"nofollow\">thecoupleeats.com/5-must…</a>", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/UHFlhuAiGgK3ZBMZCxrqQg/348s.jpg", "caption": "Tea shelf"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/XWN6oLc4zAZuyywYOtsbCg/168s.jpg", "caption": "Inside"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/aTDrtsYIYbFWbGc-k2Bhiw/168s.jpg", "caption": "A nice treat of almond croissant, lattle and hot chocolate"}]}}, {"review": {"des": "Stopped here on a recent trip and ordered a black coffee.  The staff was friendly and the coffee was delicious.  It has a little something extra to it.  I would definitely go back!", "pics": null}}, {"review": {"des": "I have traveled a lot, and I have to say this is probably one of the best coffee spots I've visited in Chicago. Try the unique #Chemex.<br><br>With success comes popularity, so be prepared to wait.", "pics": null}}, {"review": {"des": "Surprisingly affordable prices for a hip place like this in downtown. I had a cappuccino that was well prepared, in a nice mug that went down smooth.  A pleasant break from the monotony of Starbucks. Well done", "pics": null}}, {"review": {"des": "I know that Intelligentsia Coffee isn't exclusive to Chicago, but I like to think it is since it originated there.  Whenever I visit Chicago, I try to grab a cup of coffee from here.  The coffee is strong but quality.  Also, the coffee shop is nearby many attractions like Millennium Park, The Bean, and the Chicago Art Museum.  Try their iced coffees and lattes if you can, they're very strong and tasty.  It'll go straight to your brain!<br><br>overall: great coffee spot in Chicago", "pics": null}}, {"review": {"des": "I almost feel like I wasted my order here since I only got a plain ole drip coffee and an oatmeal chocolate chip walnut cookie. But, no regrets! It was an amazing cup (actually more, since they serve it you in a mug + a tiny pitcher on a tray) of coffee with a mellow flavor. The cookie was moist and full of chocolate chips. Which is the only way I like my oatmeal cookies. I spent some time inside catching up on work, and it was constantly buzzing with activity, even up until an hour of closing. If I lived in this city, I would definitely come back and try everything on the menu!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/4W5WwnF937FFUqD8CsGIXg/348s.jpg", "caption": "regular drip coffee and an oatmeal chocolate chip walnut cookie"}]}}, {"review": {"des": "Came here while on a business trip for a conference at the McCormick. After trying a sample I ordered the cold brew carbonated turmeric tonic. It was refreshing and settled down my traveler's belly. The staff even moved a table for me so I could recharge my cell phone.", "pics": null}}, {"review": {"des": "I never expect to find good coffee in Chicago, to be honest. Chicago is never known for its coffee as compared to Seattle, Portland or San Francisco but Intelligentsia Coffee was pretty impressive. I came here for 2 consecutive mornings for breakfast since it's less than 50 meters from my airbnb apartment on East Washington Street. <br><br>Had latte on the first morning and soy chai latte the second day. Both were smooth and not acidic at all. What makes Intelligentsia coffee shines is their pastry from Floriole bakery. I tried a couple and chocolate almond croissant was my favorite. The Pain au chocolate and butter croissant were good too. Besides coffee, they have an impressive list of teas available and wished I have more days in the city to try them. Sparkling tea on tap. How cool is that? <br><br>The space is beautiful and very hipster. The baristas do dressed up in suit with tie or bow. Don't get too intimidated with their dressing, they are all very friendly and could recommend some blend if you're not familiar or first timer to their coffee. Morning crowd consist of office workers as well as those who came back after a good workout in the city. If you're cycling, just drag your bicycle in with you!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/8ApoR16YWnAVeGtVTo2Lmw/348s.jpg", "caption": "That famous almond choc croissant from floire bakery and a latte"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/626nMtCatpbitNOFLobw0Q/168s.jpg", "caption": "Beautiful space"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/27PGbBu_dhVR4AyaWeUegA/168s.jpg", "caption": "Cycling? No prb. U can just cycle into the shop and buy ur coffee.."}]}}, {"review": {"des": "I really wish I liked this place better.   Intelligentsia is Chicago's foremost coffee roaster, and their beans always smell amazing.   I don't think there's anywhere else in town that takes coffee brewing more seriously.<br><br>GOOD:   Always imaginative and sophisticated coffee to choose from.   Nice to have the option to get pour-over.   I don't think I know anywhere else that does that.   Good service.   Nice cafe atmosphere.   Great place to meet co-workers or clients.   I'm in here every now and then for that reason alone.<br><br>MEH:  I may be alone on this, but I don't find the beans to be sufficiently roasted, and this impacts the quality of the eventual pour.   Could just be a matter of taste.<br><br>Also, the price -- my goodness.   $22 for a bag of coffee (and $5 for a cup, with tip) is just too danged much, thank you.   I make a comfortable living, and this still feels like an indulgence.   I am left feeling like I don't get enough for my money, in spite of everything.", "pics": null}}, {"review": {"des": "Probably the best coffee I had in Chicago! I love the clean upscale vibes that were given off by the high tables, bar seating, and the baristas all dressed in vests and ties. Very cute & definitely left an impression.<br><br>Their espresso was rich but not overpowering, and the lattes were beautiful & smooth.<br><br>Apparently, there are several Intelligentsia's in Chicago, and other places use their beans as well, so if you're in town I recommend checking it out.", "pics": null}}, {"review": {"des": "This place is located a few minutes away from Millennium Park. It's a small coffee shop located in a busy area. I ordered an iced soy latte and it was strong. Caffeine was necessary that day, so much appreciated. I think the drinks are around $4-6?<br><br>If you need a quick caffeine fix while visiting the famous Bean, stop here for coffee!", "pics": null}}, {"review": {"des": "Can you ever go wrong here? All of the coffee and Kilogram tea choices are the right choice. They have a very tasty chai tea latte. <br><br>At times the line is quite long but, depending on what you get, it goes pretty fast. There is a large variety of fresh coffee beans (and when I mean fresh I mean a day or 2 old). We also got $3 off of our drink for each bag of beans we bought. If you're lucky they will also have a discounted roast available.  They do have some pastries available.", "pics": null}}, {"review": {"des": "They make good coffee. I just wish their specials of the day didn't cost so much a cup. $6 cup of brewed coffee, ouch.<br><br>*Note* They apparently give you more coffee if you sit in and drink! Coming back for sure then!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/n-clTIPsU7H86BrV1woiWg/348s.jpg", "caption": "Fresh brewed coffee!"}]}}, {"review": {"des": "Very clean. Decent coffee. I had the Almond Croissant and it's by far the best Almond croissant I've ever had. Even if you don't like coffee, come for a pastry.", "pics": null}}, {"review": {"des": "Small store, busy location. But staff was nice and the coffee came quickly so what's to complain about? <br><br>Also even though it's a city coffee shop (hence small size) and not a lot of sitting room, there's a lot more space in the front of the store (waiting area), which helps it feel more open/not as claustrophobic.", "pics": null}}, {"review": {"des": "Arrived here on a Saturday at 11am before heading to see the bean. <br><br>Let me tell you, there was a line already. There is always a wait it seems. I ordered the the angelino. It's a cold iced drink. <br><br>It was a good coffee. I would've preferred a caramel frap from Starbucks though. <br><br>I hear there's a version of this in Los Angeles too!<br><br>Probably won't be back. I didn't experience anything that wowed me. <br><br>Ps. You need a key from the person behind the register to use the restrooms!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/52hiFjclGP6QUFx_QlOhOw/348s.jpg", "caption": "Angelino. Cool cups"}]}}, {"review": {"des": "This location is close to Millenium Park so you can get all of your Chicago must dos in one swoop. Intelligentsia is one of Chicago's best known roasters, so if you are a coffee person, you should definitely check it out. Coffee here certainly wont be $1-2 as most are about $4-6 so if you are not willing to pay more for higher quality coffee, this is not the place for you. <br><br>Most recently I got the cold brew and my friend got an iced matcha...both refreshing...though the matcha was extra light so some simple syrup was needed.", "pics": null}}, {"review": {"des": "- I'm working my way down a list of top coffee places to try.  There is a reason why Intelligentsia has been ranked so high year after year.  The coffee is amazing.  We ordered two different coffee varieties because we wanted to taste the difference between the two.  Both were smooth but different in flavor.  The coffee I ordered had a slight sweetness.  The other coffee had a more bold and earthy taste.  I then decided that wasn't enough caffeine so I ordered a latte which was beautifully made.  The baristas are extremely knowledgeable, friendly and passionate about coffee.  My only complaint is the location seating fills up quickly.", "pics": null}}, {"review": {"des": "I had a terrific Americano. But it was served in a paper cup :(. Everyone else had mugs...  <br><br>In summary, this is not a welcoming place. It is pretentious. Any coffee shop in Oregon has better coffee.  And it  won't  make you feel the need to schedule a therapy appointment to repair your self esteem after you visit.", "pics": null}}, {"review": {"des": "Normally I get coffee, but today I decided on chai tea. I'm trying to cut back on the sugar so I requested less sweetness; however, it's already mixed with the chai. I decided to bite the bullet and opt for less chai syrup. To my surprise, it was as flavorful, spicy, and bold as I had expected. It was a refreshing break on a hot day.<br><br>In other news, this location is large with plenty of seating. The line moves quickly and so do the drinks.", "pics": null}}, {"review": {"des": "Really trendy coffee shop. Basically the Starbucks of Chicago but much better. Prices are high but they are more worth it than Starbucks. The chai lattes are fantastic, but I would also highly recommend the Angelino.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/I3_W6JTCKWjd5USixnMwYw/168s.jpg", "caption": "Iced chai latte"}]}}, {"review": {"des": "When I first walked into Intelligentsia, one of the baristas was telling a patron that the coffee he was about to drink came from a species of bean that was new to the West. There was a pause... and then a \"wow that was really unique.\" The conversation then shifted to genetics and how this is impacting the taste of coffee.<br><br>This is the level nerdy science that permeates out of Intelligentsia. And, simply ordering a gluten free muffin and latte involved a wealth of information. These people are super super super friendly and extroverted. I'm not sure where the owner finds these science-loving/coffee/chatty geeks... but I want to hire them.<br><br>The coffee was fantastic. I'd expect nothing less from people to live, breathe, and think in coffee. Beware... the lineups can be long.", "pics": null}}, {"review": {"des": "Nice place, but alway crowded with lots of white collars. Nice a choice if u just need to find a place to sit down and read. Nice coffee !", "pics": null}}, {"review": {"des": "Ordered a black tea and after a little while was handed a drink with the barista prattling off whatever fancy name it was. I turned around and looked at it, turned out it was a coffee so I set it back down and said I ordered a tea. A moment later a flustered businessman walks over and sees I was given his coffee by mistake. He gets fussy, clearly upset somebody touched his wake-up juice. I say \"it's fine, I just picked it up\" and he muttered some bad language, I replied \"seriously? It's fine, I didn't drink it\" and he goes off mumbling and swearing \"are you kidding me?\", \"prick\", etc. The barista profusely apologizes, offers the man a free coffee noting he comes in every day, a drink token and more apologies. The guy takes another coffee and storms off. I muse to the barista that people can sure be cranky before their coffee and he just says \"well, you know...\" in a way that says \"I hope the big businessman returns again tomorrow\". Okay, great. So I come in once in a blue moon and get cussed out by an entitled suit, get no apology or acknowledgement. But Mr. daily customer gets coddled because somebody else touched his big boy dwink. Pathetic. I'll just get my coffee at Dollop or Starbucks or whatever from now on.", "pics": null}}, {"review": {"des": "Really liked the coffee flavor. Hip but vintage kind of atmosphere and spent an afternoon working here. Clean, bright, and bustling with people. High recommend for a study spot or place to catch up with friends.", "pics": null}}, {"review": {"des": "I want to apologize to any Yelpers that read my prior review.  It was posted to the wrong location.  Intelligentsia is a wonderful tea connoisseur - it got me through much of law school.", "pics": null}}, {"review": {"des": "Do yourself a favor and STOP drinking Starbucks and start drinking this/local coffee once in a while. Intelligentsia is a treat, help yourself to it. The West Coast has Blue Bottle and the Midwest has Intelligentsia. The coffee is always flavorful and so well made with the integrity coffee and the coffee farmers deserve. The staff take their coffee seriously and while they turn over a lot of drinks throughout the day, each drink is tentatively made. They're not so bored of making coffee that they need to purposefully mess up your name to entertain themselves. Every barista makes a proper and flavorful drink every time. This place does get busy but if you're there when the crowd is small, it's a very relaxing place. If you sit at the counter, the baristas pouring drip coffee are always happy to share a conversation. Get over the \"hipster vibe\", they make damn good coffee.<br><br>-Order with a smile", "pics": null}}, {"review": {"des": "The vanilla latte is delicious! And the latte art was done really well.. Typically, I'm not a latte drinker but was slightly pressured into it from the other Yelp reviews :p glad I got it! Not too sweet, just the right balance. <br><br>I did also try a Kenyan blend coffee.. Not sure how I felt about it. I do typically drink/prefer South American coffee, so it's probably just a personal preference. Wanted to try something different is all! <br><br>The ambience is very \"hipster\", which I personally liked. It's also great location (right off of Millenium Park), and I actually stopped by during my wait for Wildberry Pancakes up the street :)", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/1dUTc-gaI2iQib5J1qJf9w/168s.jpg", "caption": "Latte art!"}]}}, {"review": {"des": "Great ambiance, and delicious coffee. The mocha was smooth and rich with just the perfect balance of coffee and chocolate. Will be back to try other drinks and the chocolate croissant (which they were sold out of the last time I came).", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/HQ-KjMdOd9wmel5KUboJjA/168s.jpg", "caption": "Professionals at work"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/BdyORBLXZO6-3iNPi0uJwg/168s.jpg", "caption": "Beautiful, clean artwork"}]}}, {"review": {"des": "Their icon reminds me of a flight attendant's badge.<br><br>Their drip coffee is as smooth as you can get!  Ordered up their Kenya coffee and it was surely swell.  Their Oolong tea was aye okay.  Didn't care for it.<br><br>It's a pleasant coffee and tea shop, but more for their coffee!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/hf9f8Z3bFO_gxy0u_Rjj5Q/348s.jpg", "caption": "Drip Kenya Coffee"}]}}, {"review": {"des": "Really enjoyed the pour overs I had here. Lattes looked amazing also. Nice location and good service.", "pics": null}}, {"review": {"des": "If you haven't been, I recommend for anyone looking for a premium coffee shop. Is it expensive? Sure. But at least the coffee is worth it. I had the Karyenda Burundi via the Chemex. It was great. Just the right amount of acidity and citrusy notes. I also recommend some of the other varieties they have. They usually do a great job. <br><br>The shop itself is pretty cool. The whole industrial look with a decent amount of seating for a small shop. The other draw was also the bakery. I had a buckwheat scone with fruit preserves and it just sweet enough but filling. Good stuff<br><br>My only complaint is the price. I know it's all about convenience I get that. They make it for you, but I can do a Chemex too. It isn't very hard and getting premium beans is easier than ever. I even do my own roasting so a cup of premo coffee that is over $5 bucks just isn't worth it, frequently. I still think they will do fine but if you look at a simple V60 or Chemex and go online for good beans, you can do it on the cheap and get almost as good coffee. If that is too much work, then these guys are definitely your answer!", "pics": null}}, {"review": {"des": "Yes!!! Intelligent coffee and tea.  They carry organic coffee and tea selection. I had the Organic Sencha following their recommendation. So yummy and delicious.   Kilogram tea is the brand that they carry. Never heard of it but I am quite impressed with the quality.  They even carry proper clay Japanese tea pots.  I was super close in buying the cute little pot except I thought it would be too delicate to travel.  They have so many useful accessories showcased and very useful looking.  I must say that my partner also enjoyed his latte and was very happy with the rich and bold flavour.  <br><br>The servers are happy and passionate and inasmuch as there is a hipster vibe, in the end I think everyone just loves the beverages and seriously enjoy their drinks.  I am glad I tried it and the good thing is that Manic coffee apparently carries their coffee so I know we have a bit of it's magic here in TO.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/o_vDkO-Gc5mXGgqyL1NEkw/348s.jpg", "caption": "Unique and cunning tea and coffee accessories!"}]}}, {"review": {"des": "Dis place be dank.<br>We have them in LA, but I've never gone. Apparently Chicago came first.<br>I ordered an Americano ($2.75) and it was just fine.<br>Why I'm giving this place a 5-star review is because I sat at the bar and chatted it up with the barista, Yes, I was probably distracting and annoying, but he was chill about it. I learned a tonnnnn about cofffeee and would DEF kick it here again.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/StnJ30JCAd0sc-52pmwkOQ/348s.jpg", "caption": "Busy!"}]}}, {"review": {"des": "As I mentioned in my check- in, no trip to Chicago would be complete without a stop at Intelligentsia. The Chicago coffee scene is akin to this coffee chain, you can tell just from the widespread availability of this particular coffee brand.<br>My initial plan was to visit the original location, but I was a ways away, so I chose to stop by this location since I was in the immediate area. Luckily, it was a good location and the store set up was awesome.<br>The neon light wall creates a vibrance that adds spunk to an already bustling store. I also like the fact that they have a counter top right by the espresso bar, allowing you to watch the baristas while at work. <br>I dropped in for an espresso paired with a decadent brownie from their pastry counter, and that was the perfect pairing. The chocolatey flavor went well with the robust espresso finish. <br>Intelligentsia was the perfect coffee finish to an already great Chicago trip. The staff was friendly and worked fast, and this particular location is placed amongst some of the best attractions in downtown Chicago.", "pics": null}}, {"review": {"des": "My favorite coffee places in Chicago - I visit there every single time I'm in Chicago. Why? Good location - by the Bean ;) or inside the Museum. And also delicious coffee!<br><br>It is pretty busy almost all the times I've visited, but the turnover rate is also pretty good. I usually don't wait for more than 10 minutes to get seats for two. At some point, there was also student discount! Show your student card! <br><br>Remember to try - angelo (4 espresso shots) in a sweet ice coffee; coffee flight (somehow not as acidic as general pours); single-origin espresso shots (my honey's fave). Be patient, but if your drink doesn't show up in 10 minutes, ask them about your order. If they forgot, they are truly apologetic and give you your next drink free! <br><br>Thank you for super charging my visits to Chicago! Love your coffee!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/NdO0XEhep3Sv49TWpueDfw/348s.jpg", "caption": "Hot cider"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/f73aQ64Gj2C4p6G7aKQ9Xw/168s.jpg", "caption": "Mocha"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/u1ERWU3OMlRJ8mvjMtil_w/168s.jpg", "caption": "Croissant ham and cheese"}]}}, {"review": {"des": "Very great coffee and cake, it is definitely worth your money and it was packed. We sat bar table which was also nice.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/VXb1LHk_DLuxvxhg9lzwSQ/348s.jpg", "caption": "Great coffee!"}]}}]}