{"name": "ipsento-chicago", "reviews": [{"review": {"des": "Guys, this coffee place is no joke. <br>Try the Ipsento. You won't regret this namesake coffee. <br>Seriously, my favorite coffee shop in all Chicago. <br>(And the locations? Perfect for working, catching up with friends or just grabbing a cup of coffee by yourself. The one off Western is my favorite.)", "pics": null}}, {"review": {"des": "Roasted: I've been to the other Ipsento on Milwaukee Ave but this was my first visit to this location. Visited here at open on Black Friday and was pleasantly surprised with the friendliness of the baristas working. The location looks small as first blush but has additional seating up the back but it's hard to know there is seating at first glance. Store was clean and only slightly decorated for the holidays. Needs some updating to the decor and paint - lacks a modern feel. The only downfall to my visit was the barista misheard my order and made us the wrong latter. Although the wrong latte was tasty - it was lucky that it was still a low carb drink for us to enjoy. He seemed very confused when we tried to explain the wrong drink but he was friendly and offered to remake it. Latte was delicious but was lacking latter art <br><br>Unroasted: small eclectic coffee shop with friendly staff. Looks dated and could use some touch ups. Completely opposite fr their second location in Milwaukee. Disappointed with no latte art and even though our order was messed up - it still tasted great. No sugar added.", "pics": null}}, {"review": {"des": "Wait... $8 for two small/baby Red-Eyes? Don't use the, \"We give our employees health benefits\" excuse. That's ridiculous! <br><br>So many places in the area selling out due to the \"Culinary culture\" circles going on in the area that push for prices to be so high, if anything has craft or creativity stemming from it.<br><br>The \"Culinary culture\" is seeming as if the motto is, \"Take an old tradition, do it yourself, be slightly inovative or creative, and then price it obnoxiously higher than the others do!\"<br><br>This then creates a, \"Domino effect\" which is ruining fair pricing in cafes and restaurants.<br><br>It's happening in Logan Square, Bucktown, etc. and all across the map.<br><br>Humble yourselves businesses!<br><br>2 STARS given just because it's made rich and has flavor.<br><br>The servers were kind but cups sat for a few because no one mentioned they were ready.<br><br>Back in the day they were fair. Things have changed. Speak up people or you'll find yourself eating a $20 salad and $10 drink!", "pics": null}}, {"review": {"des": "Found the coffee a bit too weak for my taste. I went for the cortado and though it was ok, I have had better in other establishments.", "pics": null}}, {"review": {"des": "Good coffee. Delicious breakfast sandwiches! <br><br>However everything is on the pricey side. And the employees here seem to move in slow motion. No sense of urgency whatsoever. My friends and I waited nearly 20 minutes for our breakfast croissants. And it was not busy.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/RZwtIM7ZmwC2Q_ONq_urRQ/348s.jpg", "caption": "Henry David Thoreau"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Q6VQ2Blm5_MIlc_Bfbhl7g/168s.jpg", "caption": "Quaint little upstairs area"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/QsLWoTnJDlwqa6T6kfgPOA/168s.jpg", "caption": "Menu"}]}}, {"review": {"des": "I prowl the city in search of the perfect mocha. Will it be too sweet? Will it be too expensive? Will it come with whipped cream art that I swish to the side as I slurp? These are the risks of my quest.<br><br>I came to Ipsento doubting that this tiny coffee shop could provide anything beyond over-priced brown water and inadequate reading space. I was wrong on both counts. The Ipsento mocha was, to date, Chicago's most delicious combination of hot chocolate with espresso. Clutching it in both hands, I ventured up the crooked steps of Ipsento (a fire code violation, perhaps?) into the tables at the back. There, I found adequately padded seats, sensual wood tables, and small lamps. I sat, reading, flirting with the man across the table from me through a series of shared looks that escalated into eating his croissant, and drinking the rich, rich mocha. It was a cold winter's day outside, but in Ipsento, I was warm.", "pics": null}}, {"review": {"des": "Cherry scone, nuff said<br><br>Great small business that just opened a second location by the 606!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/-qv4qHWwhLPEyiN_ACxRnA/348s.jpg", "caption": "Coffee at ipsento, yum!"}]}}, {"review": {"des": "Lovely little joint! Ordered a cappuccino and it was made perfectly. The environment and surroundings are conducive to both chatting with friends and also plopping down to get a little work done if you want.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/BmhGVaJtQk2mWc-VWFkXUQ/168s.jpg", "caption": "Delicious coffee in a quite little coffee house."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/GJxZuAc8d-5F_07i-vFWQA/168s.jpg", "caption": "Excellent cold brew"}]}}, {"review": {"des": "I visited Ipsento for the first time on a weeknight the Fall of 2015. (Yelp is like my food diary.)  My friends absolutely love this spot and were excited for me to try it.  We rushed over after dinner in the area and arrived about ten minutes before closing. They close at 6pm all days of the week. The barista was kind, friendly, and patient while queuing up 4 lattes. <br><br>The word Ipsento was invented by the founder and is a combination of 2 Latin words: \"ipse\" meaning self and \"sentio\" meaning to discover. I love a good origin story, as much as knowing the origin of my coffee which Ipsento staff knows all about.  They emphasize micro-lot single origin beans and the variety will change seasonally.<br><br>I had an 8 oz Ipsento Cardamom Rose, listed under their Signature Lattes.  Since then, I have ordered purely from that list.  I alternate between the Cardamom Rose (espresso, rose water, spice, milk) and the Ipsento (espresso, coconut milk, honey, cayenne, milk) to be exact.  I have no hesitation sticking to this list for the rest of eternity - they are SO good - and perhaps rotate in a seasonal latte once in a while.<br><br>Their signature lattes are the highlight.  If you're ever in the Bucktown neighborhood, Ipsento is the place to grab coffee.  Stay and linger by grabbing a seat in the back where there's an eclectic collection of vintage furniture.  Or better yet, grab a coffee to go to stand in line for Margie's Candies in the summertime, or make your way to the 606 Trail (where you will find their other location on Milwaukee that also serves booze).<br><br>They even offer coffee classes like \"Barista Basics\" to steam milk and pour espresso, plus classes on brewing and cupping. Check their website. I hope I get the chance to take one in the future and enrich my coffee wisdom.  In any case, you absolutely cannot go wrong with Ipsento!", "pics": null}}, {"review": {"des": "*** Workspace ***<br>A different vibe than the flagship 606 location. There are 6 window bar seatings, and a single table with outlet in the front of the store and a more tables, some benches in the back. Free Wi-Fi with great music when you come in on weekdays, but like other coffee shop it quickly gets crowded on weekends.<br><br>*** Coffee ***<br>They have great selections like ipsento 606, as well as a slow bar with great single origin beans to choose from. From the classic ipsento, nutella or rose latte to the seasonal lychee green tea latte, each lattes has depth and a unique flavor profile.<br><br>***Coffee Class***<br>They have monthly coffee classes that takes place after closing time. You can find deals on groupon but make sure you sign up early (they post around mid month) as classes get filled up super quickly. I thoroughly enjoyed my Coffee 101 class as well as the Basic to Latte Art class. It's a fun date idea or great way for casual coffee buffs to spend their free time.", "pics": null}}, {"review": {"des": "Really cute coffee shop that comes up just a bit short in the flavor department.  For the prices, I was anticipating more robust tasting drinks but they fall a little flat, however, they boast a beautifully decorated ambiance.", "pics": null}}, {"review": {"des": "Overall cute coffee shop, only 6 seats inside though so it gets crowded really easily. A lot of outlets for doing work if you're lucky enough to get a seat. Iced coffee was really strong. The Mark Twain was REALLY good - croissant was delicious and flaky. the Henry David Thoreau was okay but a little overpowered by the cheese", "pics": null}}, {"review": {"des": "Major advice: read the menu board.  They've got some brews that smack of uniqueness.<br><br>I had their Ipsento latte which featured cayenne, honey and coconut milk.  Spiced heaven (equally described as a hellacious brew)! <br><br>It may be out of the way, or maybe Ipsento is the center of the world and everything is judged as the distance from there.<br><br>I guess it's clear.  I really enjoyed my first visit.", "pics": null}}, {"review": {"des": "I really liked this place. First, the decor - super-relaxed, small, and cozy. The service was good. The croissant is from Floriole and was heated nicely. Their avocado toast was so good.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/YoUdaB1-Sg3ZxQi5ecyoiw/168s.jpg", "caption": "Croissant from Floriole"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/plcDN7F007sW64foWq8KyQ/168s.jpg", "caption": "Avocado toast"}]}}, {"review": {"des": "Stopped in here for a bit of quiet time since I was in the neighborhood. I ordered a regular drip coffee (good, but nothing amazing), and a plain croissant (not bad, it was flaky and buttery). The front room is well lit and has some tunes going - I was highly amused by the 90's throwback music, I'm talking TLC and Maya. The room up the stairs in the back seems like a cozier place, somewhere to go for less noise although some of the patrons didn't seem to pick up on the quieter atmosphere. I settled into one of the two comfy chairs and tried to tune out the noise while reading my book. Not a bad place, but I don't understand the hype. Seems like a pretty standard coffee place to me, but with nothing particularly special about it.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/aW_1TLPfh-8yWob4J9KX2A/168s.jpg", "caption": "Starting on 'Crime and Punishment' in this cozy living room setting."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Xv2mVCIKIZnKAj5EzSLlwA/168s.jpg", "caption": "Croissant and drip coffee"}]}}, {"review": {"des": "I grabbed an ipsento latte from here, and I can proudly say that I am hooked. The ipsento consists of a really unexpected combination of ingredients (coconut milk, espresso, honey and cayenne pepper) that work surprisingly well together. I haven't tried any of the other specialty latte's but I can only assume they are just as good.<br><br>Also, unlike most coffee places, Ipsento has 1 thing that any customer will really value and that is consistency. The drink you get on a busy Monday morning will be as good as the drink you get on a quiet Saturday afternoon.", "pics": null}}, {"review": {"des": "Hanging out in the back room of Ipsento. Listening to some old blues music and enjoying soy vanilla latte and the Ipsento- a drink with coconut milk, cayenne, soy milk and espresso- no honey makes it vegan. They use really cute mugs for their drinks from ceramic mugs with the logo to mason jars. This place is so laid back and cool and grunge like. Absolutely love it! You can pick up a super cool t-shirt, mug, hat or travel mug. They have nitro coffee on tap. Not sure what that is but we will have to go back to try it. Will definitely be back to hang in the grungy back room.", "pics": null}}, {"review": {"des": "This is one of my favorite coffee shops in Chicago! I used to live a block away and came here several times a week, and now whenever I visit the city I make sure I stop by here. Their staff is genuinely kind and interested in getting to know customers. They can sometimes take a little longer to make their specialty drinks or breakfast croissant sandwiches, so just know that if the line is out the door and you're in a hurry, it may not be the best choice for you. They're also very good about always asking if conventional dairy milk is okay or if you prefer something else (which just allows me to proclaim my love for dairy each time).<br><br>I often get their iced coffee (though sadly it's only available in the warmer summer months) and when I want something special I get the ipsento latte or one of their specialty lattes that seem to change about every month. They also have nitro coffee on tap, which I definitely recommend trying just as something new if you haven't had it before. It's served in a smaller cup but without ice (so the coffee content is probably just the same as an iced coffee if not more), and looks a bit like a draft beer. In my opinion it's smoother but a bit stronger than traditional iced coffee. <br><br>Their ipsento latte is SO SO GOOD and so unlike anything else I've had. It has honey, cayenne pepper, coconut milk, dairy milk, and espresso and you must persevere past whatever impulse you get after the first sip because it will grow on you. Definitely try this place out and treat yourself to an ipsento latte! <br><br>If you're on the 606 or closer to Wicker Park, check out their other location on Milwaukee just off the 606. I've also seen them selling coffee at the Wicker Park farmer's market, and if you're at this location on Western and walking back towards the blue line, you can see their shop/coffee lab where they come up with their newest concoctions!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/fwMzYRNfUm6El1zyvlmM5A/348s.jpg", "caption": "Iced ipsento latte"}]}}, {"review": {"des": "Haven't been here for a while. Still - the way espresso's supposed to be served!<br>Blueberry scone it's a gem", "pics": null}}, {"review": {"des": "A cozy coffee shop with original and tasty drinks.<br>We ordered a regular drip coffee, and the ipsento latte (with almond milk instead of regular milk). The coffee was good and the latte was great.<br>The ipsento latte is: espresso, coconut milk, honey, cayenne, and your choice of milk. I never would have put honey and coffee together -- but this flavor combination was really fun.<br>As far as seating goes, it is pretty small, with maybe around 15 seats in the whole shop. (There are also a couple of benches outside.) <br>Unfortunately, many of the guests there took up a lot of space, even if they were by themselves. So while there are a couple of tables with 2-4 chairs, I wouldn't count on group seating being available. There were just two of us, and we had to borrow a chair and move it to an end table that probably wasn't meant for more than one person. <br>All in all, it is a cute and comfy place I recommend to anyone looking for lovely espresso drinks, and a little bit of public-but-quiet time.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/m541hvxNnRwMT0OVrYA_rw/348s.jpg", "caption": "A closeup of the signature lattes (and ingredients) on the menu."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/KY7sDvV07goKNkiARz6mHw/168s.jpg", "caption": "Our little cozy corner inside (and upstairs)."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/8G27w7PWNJaoVYbHrYA5Jw/168s.jpg", "caption": "Ipsento, almond milk latte -- espresso, coconut milk, honey, cayenne, and milk."}]}}, {"review": {"des": "Neat little hole to study in, or drop by for a little caffination station! This is actually the original Ipsento (not the one near 606 surprise!) and the staff are always courteous, can get a little warm in the summer in the back/upstairs area, and there aren't many seats, but it's a nice nook to hunker down in!", "pics": null}}, {"review": {"des": "Drinks - great, recommend the Ipsento... I go easy on the honey.<br><br>Food - pretty good!  Croissant egg sandwiches<br><br>Staff, super friendly.<br><br>Patrons... A little judgey of humans below the age of 13.  I don't blame them, I was not always thrilled to have children around before I had my own.<br><br>If you are a parent, ipsento best enjoyed without your children... when I'm in this situation, I really enjoy it.", "pics": null}}, {"review": {"des": "Recently attended a coffee class here and will be returning sometime soon. <br><br>The Cafe itself has a nice balance with a  bar area and small table up front with expanded seating a few stairs up in the back with tables and chairs. Could be served with a sofa or reading chair. Overall the interior has a great wooden design interlaced with some varied paint jobs and scattered art. <br><br>The main attraction of this spot, however, is the coffee itself. These folks really care about every step of the process, from their direct farm partnerships to their roastery down the street and brewing methods in house. They are committed to fair pay and conditions for people at every step of the process and transparent about what goes into it. I got to try a  few different pour overs and a seasonal cold Latte. All of which had strong yet balanced flavors that presented a solid buzz. <br><br>The particular class I attended, their \"coffee 101\" was originally a birthday gift I received from a friend. After finally clearing a Thursday night to attend I got to meet some classmates of varying familiarity and learn quite a bit alongside them (while enjoying some mini Donuts baked down the street) . The instructor does a fantastic job of disseminating a lot of fun facts along with history and key components of what goes into each cup. They covered country of origin, processing methods, roasting techniques, grinds, and brewing. Then it all finished with a demonstration and tasting of a few different roasts and approaches. <br><br>Whether you are stopping by for a quick cup or a whole class, this place is certainly worth checking out!", "pics": null}}, {"review": {"des": "Incredible coffee and a cozy gathering area. Was greeted right away and the staff seemed informed.", "pics": null}}, {"review": {"des": "This place is AMAZING!!!!!!! We made a special trip into Chicago just to get this coffee on the way home during our road trip. We got the same thing the only two times we've been here, because we loved them. I got the Nutella latte and Alan got their specialty drink. Bring your own coffee cup and enjoy!", "pics": null}}, {"review": {"des": "This is one of my favorite coffee spots! There's a coffee I order evreytime now which contains coconut milk (or oil or something) and cayenne pepper, and probably other good stuff. It's my drink of choice, but it's pretty much like a g'zillion calories I'm sure, and I think it may be the most I ever pay for a coffee drink. But it's worth it! Sorry I don't even know what it's called. I say, \"Can I have that house specialty coffee with the coconut?\" and they know every time what I'm talking about. They should just call it Ambrosia because it kinda is.<br><br>Also, the atmosphere in the place is cozy and warm. The baristas are always friendly and cool, too.", "pics": null}}, {"review": {"des": "I love the Ipsento signature drink. There cayenne and honey! Super tasty and perfect for my taste buds. The people are nice too. This place is not boogey at all also", "pics": null}}, {"review": {"des": "Atmosphere and mood is great, antic, and cozy. Coffee and croissants are decent. I recommend to ask them to heat croissants up in the oven in advance.", "pics": null}}, {"review": {"des": "It was like visiting someone's private living room. There's definitely a total hipster vibe and it's super busy for the neighborhood. Limited seating that can be hit or miss. The crowd is young and good lucking in a fashionable Wicker Park way. <br><br>The coffee was on point and fits into the class of your top notch urban coffee shops. I ordered up a house blend coffee and it was an excellent cup of coffee--bold rich flavor. No need to sweeten it like I do at the everyday coffee shop. Note: My friends ended up getting a pressed coffee, and it took 15 minutes. Coffee is taken very seriously here.  Whether you order up a drip coffee, pour over, or press, coffee is king!<br><br>Walk upstairs and they have a back room with communal tables. This is a great place to gather with friends or meet new ones. If you come alone and expect to sit alone, you may wait a bit for a table. <br><br>Note: They do have sandwiches and a small nosh, but I came for the coffee.", "pics": null}}, {"review": {"des": "This is definitely one of my favorite coffee places to visit while I am in Chicago. Great coffee, almond croissants and more with a nice laid back vibe. Has that neighborhood feel to it as well. The prices won't make you go broke either. I just wish it was a little bit larger in size but heh, it's Chicago and it's a great little coffee shop!", "pics": null}}, {"review": {"des": "The Ipsento is amazing. <br>Great cute shop, a bit slow since everything is made on the spot but you're there for the uniqueness of the drink - wonderful layers of flavor. Definitely a treat.", "pics": null}}, {"review": {"des": "Any coffee shop that can serve up a delicious latte where cayenne pepper is a significant igredient gets a round of applause.  My hat's off to Ispento for coming up with an original idea that really does work, despite all of my doubts.  What am I talking about anyway?  Well, of course I'm taking about the appropriately names Ispento Latte which is made with coconut whole milk, honey and...cayenne?  Yes, cayenne pepper.  Ispento provides a new meaning to \"sweet and spicy\", and yes, it's weird but it's really very good once you can get past the oddity of this combination.  Granted, this gem of a latte is a little on the pricier side, but then again so are all the other offerings.<br><br>I ordered a jalapeño and cheddar scone which I suspected to be around $2.50, but it was almost twice that much...and I'm still confused as to why, especially when the scone was almost as a dry as a piece of leather that's been laid out in the sun.  Even with the latte to wash it down, eating thar scone was a challenge.  Granted the flavor was alright, but overshadowed by it's unfortunate texture.  I would have been a little more upset with this, but because the cashier found out it was my first visit he put my order on the house.  I don't think this is to be expected for every first-timer, but this was definitely appreciated.<br><br>For that and the generally welcoming attitude, the service at Ispento gets an A+, but they didn't exactly pass my test on the atmosphere.  It's not that I didn't adore how cute it was inside the cafe, but I couldn't get past the fact that I felt extremely over-crowded.  What had initally drawn me into Ispento was a work meeting, but it was nearly impossible for me to finding seating, much less find a seating near an outlet.  The majority of the seating is located in the backroom, but it's so conjested back there, and believe me - on those hotel Chicago days it feels like a sauna in there.  <br><br>I did like Ispento and I would most likely come here again, but only for some coffee since their snacks-<br>/pastries didn't astound me.  Yes, some of the sandwiches sounded very good, but a tiny bit pricey as well.  It also helps that Ispento is in a good location; speaking of which, there's parking in front of it (though I don't know if you have to pay), but there's free parking in the neighborhood to the right of the cafe.  I'm always looking out for that free parking!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/P0t0JKuKFd0W-tmpLwj44Q/348s.jpg", "caption": "Jalapeño cheddar scone"}]}}, {"review": {"des": "Tiny neighborhood hipster café, with specialty lattes to swoon over -- rose cardamom & nutella, anyone? Yes please. But note: the to-go drinks are practically double the \"for here\" size. As much as I love drinking out of a proper cup, my latte only lasted about 5 sips (which breaks down to about $1 per sip). When I ordered to-go the next day, the same size drink was a good 10 sips bigger. Such a dilemma. <br><br>Food-wise, they have croissant sandwiches, fancy artisan yogurt, and pastries for breakfast. Also, some gluten free bars and oatmeal. <br><br>If you're planning to stay awhile, seating is quite scarce with a little room in the back and a few counter seats up front. I visited on a weekday afternoon, and a weekend morning, both times they were positively packed. Great people watching, and apparently legit coffee.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/C8-PZa83zqRvC7iMQTbzdQ/348s.jpg", "caption": "Poppin on Sunday morn"}]}}, {"review": {"des": "Probably one of my favorite Chicago coffee shops. People are friendly, drinks are consistently well made, creative, and worth the hipster-cafe-price tag.<br><br>The Ipsento is my favorite thing here (that coconut milk and cayenne...) and is the perfect pick me up when I need to get myself pumped to study. There's extra space to study in the back (warning: if you are lacking in butt cushion or have a bad back, there's mostly an eclectic mix of furniture back there. Just saying) but I love the stools by the window.<br><br>Ambiance is pretty great for a light conversation or studying.<br><br>They also make a pretty killer sandwich, and host cupping classes for caffeine fiends!", "pics": null}}, {"review": {"des": "We visited Ipsento every morning while vacationing in the area and were pleased with the consistently great coffee.  We didn't have to wait in a line, it was easy to find a place to sit and service was quick and friendly.  I would certainly return the next time I'm in Bucktown.", "pics": null}}, {"review": {"des": "So the space is really small, but the hip vibe, and even better, amazing bold rich coffee with an absolutely refreshing coffee smell that hits you right in the pleasure cell receptors of your brain before you even drink it, giving you a coffee high.", "pics": null}}, {"review": {"des": "I love coffee and I love this place!  Their space is simple but their coffee menu is beyond simple.  Their signature coffee is delicious and like nothing else you have tried.  Go ahead and give em a try.  You won't forget their coffee beans ever!!", "pics": null}}, {"review": {"des": "The signature Ipsento coffee!!!  Absolutely delicious- tastes like a dark chocolate Samoa in drink form for all you Girl Scout cookie fans!", "pics": null}}, {"review": {"des": "Folks I  really like this place.  I want to keep coming back. The coffee is excellent.   The workers are nice.  I like the environment.  But, I am having an issue with the cost of the coffee.   Today I went into the shop and bought a medium coffee, nothing special,  just a drip coffee and the cost on it was $3.58.  <br><br>I understand that I sound like my grandmother...'It is how much????'  .....I know.  <br><br>Here's the thing my friends, we have come to a place where we should not be.  It is called coffee insanity.   That's just too much money for a regular cup of coffee.  Now it's good coffee and it's way better than many other options, but it's still a medium cup of drip coffee and it's still $3.58.   I'm sorry but that is coffee hysteria    And, unless my coffee beans are being eaten by squirrels and crapped back out, well, that kind of pricing is just too high.", "pics": null}}, {"review": {"des": "The nutella latte from Ipsento is what dreams are made of. I've since moved to California but every time I am back in Chicago visiting, a stop at Ipsento is mandatory. The staff has always been friendly and although you may have to wait a bit for your order, it's absolutely worth it! Highly recommended.", "pics": null}}, {"review": {"des": "The drinks are so perfectly smooth. Would 100% go back here! We are from ND and had a short stay in Chicago area, otherwise this would be my daily shop!", "pics": null}}, {"review": {"des": "This is one of my favorite coffee shops in Chicago.  You might spy a hipster here and there, but Chicago PD was also seen stopping in for a brew.<br><br>The Ipsento (honey, cayenne, espresso, and coconut milk) was worth the wait.  Don't be fooled by the cayenne - the drink has a slight bite but the honey and coconut override that.  I tried this hot and iced, you can't go wrong with either one.<br><br>I was intrigued by the Cardamom Rose latte, but I had a sip of my friend's and was glad I went with the Ipsento.  It was good but not as unique as I thought it would taste based on the name and ingredients.<br><br>The drinks took a painstaking amount of time to prepare and reminded me of my first Intelligentsia experience in the Loop.  But if you have time, it's worth the wait.<br><br>There are seats available if you walk up 4-5 steps.  There are no large areas to study, but a few nice benches, sofas, and a mishmosh of furniture.  The temperature in the front part of the shop was blazing hot while it was only in the 60s outside, but it was more comfortable in the seating area.<br><br>Some of the patrons here aren't so friendly.  One girl working on her laptop barely noticed we were there, while a guy sitting on a bench interjected himself into our conversation more than once and was trying to start a fight about discriminiating against carnival workers.  I swear, some people are offended by everything...", "pics": null}}, {"review": {"des": "I love this coffee shop!!! The Ipsento latte is phenomenal!! The best part of it is the Cayenne which gives it a unique flavor.", "pics": null}}, {"review": {"des": "Yes, their Ipsento latte is very yummy. Very rich and smooth. I love a coffee shop with coconut milk, since it's the best milk!<br>There's not much seating here, so it could be hard to plan to stick around. Better to take it to go! Very nice staff too.", "pics": null}}, {"review": {"des": "ipsento will NEVER disappoint you with their signature lattes and coffee beverages. Their unique blend of ingredients in lattes are truly a magical experience. (Experiment?) Plus, the espresso is strong! I've been a regular for years. <br>-Judy", "pics": null}}, {"review": {"des": "Im sure your other drinks are good but I cant pull myself away from the ipsento latte. The mix of sweet and spice is awesome. The food is really good but it does take a little bit of time to get it, worth the wait. Is it pricy, yeah but I treat it as a weekend treat and not an everyday expense. And the staff is always incredibly nice, like oddly nice :)", "pics": null}}, {"review": {"des": "Excellent espresso drinks, long wait on the weekend mornings but that's to be expected.", "pics": null}}, {"review": {"des": "The Ipsento latte is divine, and they have great options if you're vegan. The pastries are yummy too! Lots of spots to sit and hang out or do work. One of my favorite coffee shops in Chicago.", "pics": null}}, {"review": {"des": "The original Ipsento is a treasure. It's my favorite coffee shop in the city and it's not even close. The house drinks are incredible! Their freshly roasted beans are top notch.  Oh, and their sandwiches are actually really good.", "pics": null}}, {"review": {"des": "Ipsento is the best of the best. The only thing that could take this place to the next level would be a parking lot. Lol I know I'm asking for too much, but they really got everything else going on.<br><br>For starters, the women that operate Ipsento are truly a pleasure. I mean honestly, I've probably been to every independently owned coffee establishment south of Fullerton to grand avenue and east of California all the way to the lake front and I have never seen such an awesome group of cheerful employees like this in my life. They all work seemlessly together, with the perfect amount of playfulness with each customer while still getting their assigned task accomplished. I love it. Super professional, yet approachable and efficient. <br><br>While most of my reviews tend to be service driven, with Ipsento I can comfortably say they exceed in both the product that they offer as well as experience. I frequent intelly for my morning cortado and scone, but definitely prefer Ipsento's cortado now. The espresso didn't have as much bite to it, which made it easier for me to drink at 8am and had the perfect milk to espresso ratio. <br><br>The space is well put together, not overwhelmingly recycled-chic like many other shops and they have a cute little back area for studying. They seem to have a consistent line throughout the day, but don't be intimidated they flow through it quickly. <br><br>Love it.", "pics": null}}, {"review": {"des": "My favorite neighborhood coffee shop. It's very cozy inside. This is the original Ipsento location and it has excellent coffee and food.", "pics": null}}, {"review": {"des": "Highly recommend to try this place. Cute and cozy inside. Good coffee and nicely formed latte makes a great texture! <br>I like more intensity of coffee, but it may be great for those who dislike Starbucks' drip coffee feeling like super dark. <br>My friend got a chai and it was good, too :) Even though they have a tiny space with lots of people, I had a good time with my friend.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/OT0tZYoqGpRBJZBqrxd3rg/348s.jpg", "caption": "Inside"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/1zHJ2mPkVHVhgZxCinJa6g/168s.jpg", "caption": "Inside"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/B3vUsS5pehBL8aXduXDXHQ/168s.jpg", "caption": "Regular latte beautifully formed and designed"}]}}, {"review": {"des": "Really great coffee, staff, but only if there was more space inside to chat and enjoy the drinks and different foods.<br><br>My boyfriend and I ordered the London Fog 12oz and the Cardamom Latte 12oz. The London Fog was a mix of Earl Grey Tea and some spice. Upon sipping this one, you get the wonderful tea flavor then the spice comes up to warm your mouth and soul, really delicious. The Cardamom Latte had that kick of floral flavor with the rose water and the spice to kick it up a notch. Both drinks were very delicious. We just wished we had more time and less pressure to finish up our drinks, because the seating space is very limited and with the frequent flow of customers, there was some pressure to just finish our drinks and leave to open our seats. <br><br>Overall, we would for sure be back again to try the other drinks!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/vZW4yShwSZG3re2UMk_5xw/348s.jpg", "caption": "Top: London Fog, Bottom: Cardamom Latte"}]}}, {"review": {"des": "This review is for the Barista Basics: Pulling Espresso & Steaming Milk class. At $98 it was not worth the money and I wouldn't recommend it to anyone. The girl teaching the class was very nice, but the material itself could've been learned for free on youtube. We each got to practice making latte a few times, but at this price I expected them to offer some water, snacks or at least a coffee drink of your choice to enjoy while there.", "pics": null}}, {"review": {"des": "Always a treat when I stop by. The Nutella coffee mixture is so delicious. Friendly staff, who are knowledgeable and glad to give recommendations", "pics": null}}, {"review": {"des": "Fantastic, unique drinks. They also have the best chai latte in town. The space is cozy and beautiful. My favorite part of ipsento, however, are the people. It only took them a couple visits to remember my name, and they are all so friendly.<br><br>Recently I was sexually assaulted minutes before I walked in (like I said, they have the best chai in town and I needed it more than ever at that point!) I was sobbing when I went in and the baristas listened, gave me my drink for free, and wrote me a comforting message on my cup that I found after I got home. These folks are a class-act. That plus fantastic drinks have made me a forever customer.", "pics": null}}, {"review": {"des": "Upon entering -<br>To the Left: Straight filter, purist, don't mess with my coffee beans, aeropress.<br>To the Right: I want something different, coconut milk, cardamom, crazy concontion.<br><br>Food - a small and great selection of delicous baked goods and the perfect chocolate donut. Croissants named after writers are hot and hits the spot.<br><br>Ipsento is the best and my favorite coffee shop in Chicago. There's something for everyone. Great service, nicely staffed and love the ambiance and colors here.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/yrNVrZEl-ht8U6bZG7bqrw/168s.jpg", "caption": "In the early hours"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/DITaNPObnBRKV3R5oy5Ydw/168s.jpg", "caption": "Pick a side"}]}}, {"review": {"des": "Cute spot but the staff is very snobby, extremely overpriced and unwelcoming. Not the best the best experience, needless to say that I won't be returning.", "pics": null}}, {"review": {"des": "I love the coffee here!  It is smooth, rich and creamy.  It warms the soul.  The food is good... if you want sandwiches and chips.  They have a variety of coffee options such as pour overs and drip coffee.  They have variations from all over the world.  Ipsento is definitely one of my favorite coffee shops.", "pics": null}}, {"review": {"des": "Ipsento, you definitely surprised me. I was looking for a good cup of coffee, but I don't like the strong bitter stuff. I like the ones with different flavors and on the sweeter side. At first the description of coconut milk, honey and cayenne was a turn off but after reading the reviews, I decided to be adventurous and order it.<br><br>First sip, I was hooked!! I don't know how these flavors work so well together but they do. At first, you taste the coconut milk, which is creamy and sweet. Then the caynenne kicks in and gives it a spicy taste. Sounds weird, but somehow magical!! <br><br>I hgihly recommend it, you'll be thanking me.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/RBfv3rK9vwdNk4p7RK5oAw/348s.jpg", "caption": "Ipsento iced"}]}}, {"review": {"des": "Amazing Cafe with a back room designated for studying! I had a Nutella Latte and the 16oz cup was definitely enough to be able to enjoy while getting in a 2 hour study session. I am looking forward to coming back very soon! So far, one of my favorite spots now.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/8chJShpCH9k-lhmemGRPaw/348s.jpg", "caption": "16oz Nutella Latte! Amazing!!"}]}}, {"review": {"des": "I met up with a friend who was back in the city for the holidays. The line wasn't too long. I got the mocha and it was good. It wasn't too hot...more lukewarm. However, it did its job. The chocolate and the espresso definitely got me wired for the whole day. <br><br>Seems tiny when you walk in but there is another room in the back. <br><br>I loved the tiny T-Rex on the top of their hanging menu.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/0D0uLG6wG2s0GnNnuCUHtQ/348s.jpg", "caption": "Mocha."}]}}, {"review": {"des": "Loved this place! I had the cardamom rose which was sooooooo good! I love spices in my coffee and this had such a unique taste!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ljWbAUUrU6zohuxwRsPAIg/348s.jpg", "caption": "Cardamom rose"}]}}, {"review": {"des": "While waiting for a table at Wasabi, my friends and I did a quick trip to Ipsento to grab a drink before the meal. We arrived there about thirty minutes before closing and converse with the barista a bit before making our trip back to dinner. The baristas here are super nice and knowledgeable in the art of coffee. <br><br>I try the ipsento coffee while my other friends got the nutella coffee and the espresso. Like any other store, the espresso came with a sweet biscuit and a glass of water so you can wash down your palate after. For the ipsento and nutella, the barista drew latte art on ours. If the place isn't busy, you can definitely request a specific image like a fern, leaf, or heart.<br><br>Besides the front part of the store, there is a back part that is intimate and cozy. This area offers a homey aspect and you can read a book or study here since it is pretty quiet and there is free wifi. I will definitely come back!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ia0j1GxtbDe0AqJ4Cb2nSQ/348s.jpg", "caption": "Espresso"}]}}, {"review": {"des": "I was here everyday for breakfast during my trip. It was so good I know I needed to eat it everyday before I go back home. <br><br>I just happened to pass by on my way to the train station so I decided to go in and give them a try. First time had the Mark Twain croissant with egg, tomato, cheddar, and basil. I got a hot chocolate with soy to drink. THEY WERE SO GOOOOD!!!!! (caps lock because thats how good they were) it was the perfect combo! The croissant was crispy and flakey like how a croissant should be. I've never had it with eggs and basil before so it was new. I was pretty happy I found this place. <br><br>I came back the second day and had the same thing. <br><br>Third day of my trip and you guessed it!!!!! I came back again hahahha. But instead of the Mark Twain, I had the Henry Thoureaux croissant this time. I wanted to switch it up! :D That was better than the mark twain imo! I sub the goat cheese and bell peppers for basil and cheddar. Not a fan of goat cheese or bell peppers. They were happy to comply :) yay! <br>My friend had the Jane Fonda for all three days and she loved it! It had apple, cream cheese, honey all hot and melted in the sandwich. <br><br>I also tried their Nutella espresso drink on the third visit. It was the best drink ever!!!! nutella with espresso equals happiness if you ask me! it was delicious!!! They have a little bit of room in the front but more seatings in the back! Lines are out the door during Saturday morning so be prepare!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/MhQE0hhZoIx9G4RN0_xYaQ/168s.jpg", "caption": "Mark twain"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/isJhBCq3R3bB9jQAIG_FSA/168s.jpg", "caption": "Hot choco"}]}}, {"review": {"des": "Came in after seeing all the hype on yelp (thank you fellow yelpers), such a great environment. Very similar to filter, in wicker park, smaller, but the perk is street parking nearby (free and no permit needed)!! <br><br>Great workers, walking to the back grabbing some stuff stopping by to talk to regulars and willing to take dishes away. So kind! <br><br>I got the 16 is. Nutella latte with skim and it was awesome, don't mind the $5.45 charge because the caffeine was needed today and because it was the best latte ever!! <br><br>Place was tiny, but if you go early enough, you won't find trouble finding a table or a retro arm chair to settle down in. I got there before 9am, place was busy with a line, but found spot in the back and claimed it for 6 hours :)", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/RzsvV0r6gbTWfsGG-FM8XA/168s.jpg", "caption": "Calm before the storm. Cute and quaint coffee shop"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/2D1J4rWjbFDg-DPpVsDI6Q/168s.jpg", "caption": "Nutella latte . $5.45 for a 16oz, well worth it!!"}]}}, {"review": {"des": "Nice little coffee shop in the Wicker Park/Bucktown area! The place has a layout of a house so you seriously feel like you are working from someone's living room!! The featured espresso drinks were good and at par as far as price with other coffee shops in the area. I will probably be back again to work from there since they also had some bomb music playing the entire time I was there!", "pics": null}}, {"review": {"des": "Favorite coffee in the neighborhood! Good pastries and always solid coffee. Nitro in the summer is also good!", "pics": null}}, {"review": {"des": "Their coffee is great, their beans perfectly roasted, and their staff is friendly and skilled. Seating could be better for groups but there is plenty of space.", "pics": null}}, {"review": {"des": "Love this place for everything that it is!  Thank you @ishakur for introducing me to this amazing place that has a slayer machine that pulls the most amazing shots!  The cortado is to die for and I love the fact that they serve organic milk that is locally sourced.", "pics": null}}, {"review": {"des": "Super small place. The pastries at 606 are usually gone early so I checked here instead and they don't have the mini donuts which was disappointing. Also they don't sell cold brew but instead recommended a tiny (12oz) nitro coffee that was nothing special and extremely overpriced.", "pics": null}}, {"review": {"des": "Ipsento Western is like a 2nd Home. The staff is excellent and the Coffee amongst everything else on the menu is top quality! Iced Nutellas are the best and I co sign them if you ever find yourself here! 5 stars every visit.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/P1VTxNEWOiAH5pJmxAR8TA/348s.jpg", "caption": "If you live in Chicago or visiting Chicago Ipsento should be on the priority list. Great People and Great Quality drinks and food"}]}}, {"review": {"des": "Ipsento coffee- has a spicy flavor. It was very unique and different, but i did not enjoy it. <br><br>London fog- tea with steamed milk. It was okay and i enjoyed it. <br><br>This is very tiny, crowded place. Not the best place if you want to work at a cafe.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/SQyLhBhoznpPeL2WAeBB5A/168s.jpg", "caption": "Menu"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/XC9lT2CaX8hnQoipjoV9OA/168s.jpg", "caption": "London fog"}]}}, {"review": {"des": "4.5 stars<br><br>So glad i found this spot! Landed in Chicago really early and this was my first bite and coffee in this culinary city. It did not disappoint. It was a charming coffee shop with friendly staff, a wide menu, and quality products. I initially ordered the avocado toast but they ran out. The staff suggested the Mark Twain croissant. The coffee was nicely brewed. The space in the back has additionally seating and filled with what looked like yard sale finds. It's also nice to know they support artists...art work on the back walls were for sale.", "pics": null}}, {"review": {"des": "GREAT COFFEE but really slow hippie service..... can we get a worker a real coffee maker ?<br>you have slow very very slow baristers coffee makers who talk to everyone BUT the paying customer !<br><br>stop this great coffee but if there is a line 20-30-40 mins to get a coffee  <br>cool people making coffee is not real. US in the real world have children jobs and don't ride a bike and sit on a coffee for 3 hours but will spend $20 and we are in and GONE....<br><br>week after week you are getting worse..... fix this or i will video the VERY VERY SLOW COFFEE MAKERS  and post to you tube so the world can see.....", "pics": null}}, {"review": {"des": "The Ipsento latte is hands down my favorite coffee. Probably ever.  After experiencing it for the first time a few years ago, I have quickly made it a regular part of my weekend routine.  Every Saturday & Sunday, I need it.  It's consistently good and the baristas are always very friendly.  Yes it is a $7 latte (after tip) but you know what? It's worth it.  If I could justify it, I would get it every day. <br>This location is my favorite. The 606 is more modern, however the service at the original is always faster.  And I can bring my dogs in with me while my latte is being expertly crafted.  What's not to love??", "pics": null}}, {"review": {"des": "I just happened to walk by on my way to get a sandwich from the grocery store, and saw that they had sandwiches here. Boy, do they! I just had the most amazing turkey/apple/cheese/avocado deliciousness ever. And the delieghtful ladies working made waiting for it to be made a pleasure. I will be back!", "pics": null}}, {"review": {"des": "Cozy eclectic coffee shop. Coffee is excellent. Service and selection better. Food was fresh. Love the seating options.", "pics": null}}, {"review": {"des": "I had a Nutella Latte that was so yummy and it came in a beautiful flower heart format .<br>The decor of this place is so cool! It is very alternative and the staff are very friendly.<br>It is a nice place to chat with friends.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/7uCLxZYQ0DIVV972VC-z-Q/348s.jpg", "caption": "Nutella Latte with a piece of chocolate from Margie's Candies.  Walking distance between places. Worth it, isn't ? :)"}]}}, {"review": {"des": "I've gone to most every specialty coffee shop in chicago and ipsento is by far the best there is. hands down.", "pics": null}}, {"review": {"des": "This is my fourth time here, and I will have to say that this is probably my favorite coffee shop in Chicago. The coffee is so bomb (they have clever and aeropress options) and the ipsento latte is one of the best lattes anyone can ever make. The ambience is quaint and dainty. <br><br>I had an experience here where I ordered a clever, but the grinder broke shortly after I placed my order. It took roughly 30 minutes for my coffee to come out, but the staff was ridiculously nice and apologetic for the mishap. They eventually brought out a card for a complimentary drink for my next visit, and gave our group two lattes on the house. The staff here went above and beyond to satisfy the customers, and I am forever grateful for wonderful people in this world. <br><br>We live in a crazy and degraded world, where humans are for the most part out for themselves, putting their own needs above others. It is encouraging to experience from time to time where people express ardent concerns for one another. It is experiences like these that make life shine a bit brighter.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/K3U4bNdmANw3iXIvxbF9eA/348s.jpg", "caption": "Colombia clever pour over"}]}}, {"review": {"des": "Ipsento, Ipsento, Ipsento!  Get this!  You will have a great start of your day!<br><br>The atmosphere is relaxing.  The seating area is quite limited, so come early if you need a table and an outlet.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/3kWhrgX5j0CA-5Kdy0iucA/168s.jpg", "caption": "12 oz. Ipsento"}]}}, {"review": {"des": "I had the namesake beverage, the Ipsento. Delicious balance of creamy but subtle coconut flavor with a hint of cayenne spice. One of my favorite coffee drinks ever!", "pics": null}}, {"review": {"des": "Came here hoping to take advantage of outdoor seating on a beautiful day, but sadly, there was none :( Hopefully they set up the front patio area soon! There are two tree stumps in front, so we took advantage of that, and I saw someone bring a stool outside and set their coffee on the window ledge. Not ideal, but it worked. The inside seating is pretty limited, too, though there is a back section with cozy-looking benches.<br><br>The Ipsento -- coconut milk, (I got almond) milk, honey, and cayenne -- is a must-try. Next up on my list are the Nutella and Cardamom Rose. There's a chocolate hazelnut cookie that's pretty good. Food, with the exception of any late-in-the-day pastry stragglers, is served until 3pm.", "pics": null}}, {"review": {"des": "This is a really cute cafe with great baristas and delicious bagels from The Bagelry. The cortados are alright--a little milky but the espresso is decent. The food options, though a little on the pricy side, looked great as well. <br><br>We brought a game and posted up for a few hours after our 5:15am flight was cancelled, but it would also be a great place to study/work if it stayed relatively quiet. I would definitely return!", "pics": null}}, {"review": {"des": "It's a coffee lab where they do it all in house. Not one to be outdone they recently installed a nitro tap to ensure that they were ahead of all the trends. A wide selection of coffee beans and skilled baristas ensure a good experience each time, albeit a litlte more expensive than your average. <br><br>The latte offerings are great w/ non-standard options of rose and cardamom. <br><br>Love that morning after pastry bin.<br><br>Great space in the back to sit down and get some work down. Cozy/library feel to it.", "pics": null}}, {"review": {"des": "After long-awaiting to try Ipsento, I finally had the chance!  I had read about Ipsento from many articles rating Chicago's best coffee shops and knew I had to come here. <br><br>It was an extremely tough decision on which latte to try.  I wanted to order both the Nutella and Ipsento lattes but decided not to be greedy *sigh* and chose the Ipsento.  It did not disappoint and was a delicious blend of flavors in my mouth.  This latte has coconut milk, honey, cayenne pepper, and your choice of milk (soy for me).  The coconut milk is fairly strong so if you aren't a fan of coconut, you may not fully enjoy this latte.  However, the coconut milk makes the latte smooth and VERY creamy since it has a higher fat content than other milks.  The addition of honey lends the latte a slight sweetness without being sickly sweet and the cayenne pepper adds an interesting warmth.  YUM.<br><br>I also tried a sip of my sister's Nutella latte and it was superb as well.  Creamy, chocolate-y, and rich.  I can't say which one I prefer more since both were awesome in their own ways.  I highly recommend trying both at some point.<br><br>I also had the chance to try their chocolate chip scone and boy was it good!  I am fairly picky about scones since some are too dry and crumbly for my liking.  I prefer mine with a slight crisp crust but a moist, flaky center.  Their scone was perfect and made even better since it had chocolate chunks rather than chips.  <br><br>Ipsento is as good as everyone raves about and you should get your tuchas over here ASAP to try their coffee and baked goods.  If not, your loss!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/jqyJMqf1jNkwaveKD1Rj2Q/168s.jpg", "caption": "Ipsento latte with soy"}]}}, {"review": {"des": "Visiting from out of town, someone recommended this coffee shop. Great lattes ! Tried the ipsento latte. The flavors were great. Nice twist between sweet & spice. Also tried the Nutella latte, it was the perfect sweetness. Def recommend if you're a coffee addict like me", "pics": null}}, {"review": {"des": "I am a coffee addict and am pretty picky about my coffee, but I LOVED Ipsento. I'm not usually bit on flavored/specialty drinks, but their \"Ipsento\" drink is one of my favorites. It has cayenne, coconut milk and honey. Only downside to this place is that there isn't much seating, so not ideal for staying to read/study.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/sfre6uhTiCIvF11z-K3m3A/348s.jpg", "caption": "Ipsento latte"}]}}, {"review": {"des": "I've been wanting to try this place for quite some time and for some reason I thought that the coffee shop itself would be bigger. They have a little room in the back but not much other room to sit in the main room where you order. That was kinda a bummer since I was waiting for my coffee it would have been nice to have some more tables in the main area. It was a super hot day in Chicago so I definitely wanted to get one of their iced concoctions so I went with the much talked about Nutella iced drink. I asked for the small but they told me that the ice drinks come at a minimum of the 12oz portion. Also, not the end of the world. I asked for them not to make it overly sweet since I know nutella is very sweet on itself and I wanted a mix of coffee and something sweet so I was hoping they would make it quite to my liking.<br><br>And they did. The drink was wonderful, super super tasty and I would definitely want it again. However, the price point for that tiny drink came to about $5 which may compete with Starbucks prices. So all in all, I thought the drink was very good and I would spend that much if I was having a coffee date or a meeting with a friend but the atmosphere itself has to be a little better and more upscale for me to spend that amount. It's a little rustic, barn like which is great for the look they were going for but the prices are a little over the top for me for the amounts that they serve. Plus, my drink wasn't filled to the top making it like closer to 10oz, also a little bummer.<br><br>Overall super tasty drinks, nice staff, didn't love the atmosphere nor the price tag. But if you live in the area then I can see you coming a lot, but I wouldn't make the trip from the burbs since Starbucks is everywhere.", "pics": null}}, {"review": {"des": "Nutella latte is phenomenal, hot or iced!! I went light on the Nutella and it was still sooooo delicious!!!", "pics": null}}, {"review": {"des": "KABOOM, KBLAM, POW, ZING, ZAM, POW!<br><br>Can I leave my review at that.  We had a few of their signature drinks and loved them.  I want more, I want one right now.  <br><br>The food is ok.  But its a coffee shop.  Know your role, order a coffee, maybe the Nutella late, and have a great day.", "pics": null}}, {"review": {"des": "This place is a unique little gem with drinks like the ipsento made with cayenne pepper, coconut milk and honey. This is not a fancy coffee shop but definitely one of the best. This is a small place with old sitting area with coffee nothing short of a work of art!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/dnMKZfrVkJ5ueno8rKklMA/348s.jpg", "caption": "Ipsento (coconut milk, honey and espresso)"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/IhnRCgkjpT8FRVvlk7VDmQ/168s.jpg", "caption": "The barista making the world class ipsento coffee"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/BAZa0R8cFuSRcuTsxve1zQ/168s.jpg", "caption": "Ginger bread tea"}]}}, {"review": {"des": "Absolutely love this place and take all of my visitors to Chicago here during their stay. The Ipsento with soy milk is absolutely delicious! The staff is always very friendly and fast. The interior is cute and relaxing. Definitely recommend!!", "pics": null}}, {"review": {"des": "Not much of a workspace, but they do serve delicious lattes.  The ipsento latte has this perfect balance of spice and sweetness, and it's the only time I ever get anything fancier than a plain latte or black coffee.  Definitely in my top two coffee spots.", "pics": null}}, {"review": {"des": "THE BEST coconut cappuccino I ever had! No kidding :) my bf saw this place before while he was driving. Never been there till this Sunday. Coffee- AMAZING. Food not so GOOD :( but this is a COFFEE shop so I think still deserve 5 stars. Plus the atmosphere there is COOL. Few seats outside. I love that! Also there is a cute tiny room upstairs. Reminds me my collage years.... Just FEELS GOOD to be there :)<br>P", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ZEcfJbL77MYV8Y1CFWPI1g/348s.jpg", "caption": "The best coconut cappuccino ever"}]}}, {"review": {"des": "Bookmarked this place prior to coming to Chicago when I found it on a Best Coffee Shops in the US list- tried their signature Ipsento (coconut milk, soy milk, honey, and cayenne) and Cardamom Rose (\"middle-eastern inspired\") lattes, enjoyed them both. The unusual spices and seasonings used in the lattes make them stand out from other generic coffee shops in the city, and the super-friendly service was a nice perk too.<br><br>There's a small outdoor area in front of the shop, and only a few seats in the main dining room, but they have a back room with comfortable couches and chairs, as well as local featured art. I especially enjoyed the photography project with the ballerina. There are puzzles and games available for those who want some entertainment while they linger over their beverages, too.", "pics": null}}, {"review": {"des": "I came to Ipsento in the morning on a weekday with the intention of getting work done, but after trying an amazing breakfast croissant and the signature Ipsento latte, I was so impressed that I'm writing my review right now in the Ipsento wifi (password wonderland). I immediately liked this place after walking in due to its hip ambiance and as soon as I took a look at the menu. There are a ton of awesome sandwiches named after authors! The English major in me totally geeked out. I knew I had to order the Jane Austen, which was a croissant breakfast sandwich with cream cheese, honey, and apple. It was. Absolute. Perfection. This is one of the best breakfast sandwiches I've ever had! It wasn't even anything particularly complex; all the flavors just worked together really well. (And I promise it's not just my Pride and Prejudice nostalgia talking.) It was so filling that I managed to count it as my lunch, as well. <br><br>For my drink, after some hemming and hawing (the drink menu looks stellar, too, with plenty of appealing-sounding options), I decided on the signature Ipsento drink. GET THIS! If you're reading this review and you've never been to Ipsento, you absolutely must get this signature latte. The cayenne and honey just work so incredibly perfectly. To this day, the Ipsento was the best latte I've ever had. I'm not much of a \"coffee person\" and you can barely tell this baby is coffee. (But trust me, it has plenty of it, as my racing heart told me after I downed the whole thing in 20 minutes.) The flavors work perfectly. Don't be scared off from the cayenne. Trust me, the honey has the sweetness taken care of on this one!<br><br>I enjoyed sitting at one of the many diverse tables in the back, filled with books on the bookshelf, framed pictures, candles, etc. It really felt like I was in someone's personal nook in their home. Perfect work space! <br><br>Plus: Ipsento is located really close to the Western blue line stop. If you're commuting, you really have no excuse not to drop by before or after work.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/wTYGLZBxIg-68xaVp8xRpw/348s.jpg", "caption": "Wifi info"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/EmCPJ6u_WyZa1mjjyTl3XQ/168s.jpg", "caption": "12 oz Ipsento"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/7dW0qTnv72TLmxO866M9uA/168s.jpg", "caption": "12 oz Ipsento"}]}}, {"review": {"des": "Ipsento is the home of my new favorite drink of all time. Oh, dirty chai, you had a long favorite streak. But Ipsentos makes this AMAZING coconut milk, cayenne, and honey latte that is beyond perfection. Not only was the flavor spot on, but they did a latte art masterpiece that I'd never seen before. <br><br>Pair a perfect drink with a home-like, comfortable atmosphere and you've got yourself an exceptional coffee shop.", "pics": null}}, {"review": {"des": "Two Words - Nutella Latte. I don't even feel like I need to go on with a review . . .  those two words should suffice. :) <br><br>Friendly staff, awesome atmosphere, in house roasted beans, yummy food, fabulous Chicago neighborhood. Go. Check it out. You will not be upset that you did.", "pics": null}}]}