{"name": "iraz%C3%BA-costa-rican-restaurant-chicago-7", "reviews": [{"review": {"des": "I recently had my engagement party at Irazu in their private event space.<br>The whole night was terrific. The host (Alicia) was wonderful she was very attentive and made sure everyone had what they needed.<br>The food was delicious and there was enough for everyone plus leftovers. The plantains are some of the best i've ever had!<br>The recent renovations made to the private event room look great, it's much more open and perfect for the amount of people we had (which was around 25).<br><br>I highly recommend hiring out this room for any private event you might want, you won't be disappointed.", "pics": null}}, {"review": {"des": "Constantly craving Irazu and have to go there or order delivery at least once a month. My all time favorite is the Casado w/chicken- comes with rice, sweet plantains and cabbage slaw-so so good. <br>Other notables: <br>Chips and Guac <br>Chips and the hot green salsa on the tables (OMG) <br>Potato Taquitos<br>Veggie Platter with daily vegetables <br>Oatmeal milkshake<br>and I recently tried breakfast from them - I believe it was just the \"Costa Rican\" breakfast which was really yummy. <br>If you dine in- expect a bit of a wait as they are ALWAYS busy. The dining experience is casual (nothing fancy) but the food does all the work. The service is always friendly. Just go here, k?", "pics": null}}, {"review": {"des": "This spot is delicious, but some of the dishes are a little off from what traditional Costa Rican food is.<br><br>It's the only Costa Rican restaurant in Chicago (that I know of) so I'll take it. My review is definitely a little particular. I have family from Costa Rica and having spent quite a bit of time there and in NYC, I was hoping for the recipes to be on point AKA I'm being a food brat, lol. <br><br>The food was delicious though! Definitely worth a visit. I'll be back.", "pics": null}}, {"review": {"des": "Came here to celebrate my boyfriend's 30th bday earlier this year in August. They were very flexible with the amount of guests invited. They can take up to 20 people or so. <br><br>They gave us nice lime mixers to go with the tequila and other liquor that we brought. As they provide mixers, they ask that you do not bring your own. <br><br>There was no Cake Fee charge for the birthday cake, which was really great! They also helped me store the cake on the fridge when I first arrived. The service was excellent especially considering what a large group we were.<br><br>Important Tip: CASH ONLY  & BYOB (hard liquor  is okay )", "pics": null}}, {"review": {"des": "There isn't a ton of Costa Rican restaurants in Chicago, but all you need is Irazu. The food is made to order, the staff is knowledgeable, and the taste does not dissatisfied. Even better is that they are BYOB, so you can make it a great night out even if on a budget. <br>Their dining room is lively, so don't expect an intimate experience. Also, take advantage of their efficient kitchen and order to go if you don't wanna sit in the dining room. You can always walk up to the 606 and eat al fresco.", "pics": null}}, {"review": {"des": "I was going to do some Cuban food, & then Irazú popped up! They have nearly 1500 reviews at the time I'm writing & they were still over 4 + stars!l :O <br><br>I had to take a nap after that meal, it was glorious! Yes the nap. The meal was, too haha the steak sandwich with hot peppers, avocado, cheese & side of plantains hit the spot! I think I used about half that bottle of hot sauce/salsa on my chips & sandwich, such a good level of heat. Everything went so well together & I was really happy to get everything so quickly, I was starving! The free oatmeal shake with Yelp check-in was an added bonus on this hot September day!<br><br>I was sitting between 2 Spanish speaking tables & really enjoyed it. I got a few smiles from the abuela at the table to my left & the señorita to my right, everyone was so friendly! Other than the table of hipsters in the middle of the restaurant, I got friendly smiles from everyone I made eye contact with. Unfortunately I won't be back anytime soon because I leave town tomorrow, but who knows what the future holds for my tastebuds...", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/zXGNv7SFoipBrtC4qb-JwQ/348s.jpg", "caption": "Corner signage"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/OmA2AAEkXNgBhttFI5VOXw/168s.jpg", "caption": "Chips & Salsa"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/0uBEQwHr8SaXEf9g3x3HxA/168s.jpg", "caption": "Awesome interior colors"}]}}, {"review": {"des": "We came here because of Diners, Drive Ins, and Dives and honestly I'm happy we did! They only take cash, but there is an ATM inside. It is pretty loud when they have all of the windows open, especially when a train goes by because the restaurant is close by to it.<br><br>This was our first time having Costa Rican food. Everything we tried was delish and generous in its portions. It was definitely worth it and it's on the list to go back whenever I visit Chicago.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/GMVkJS800OnA1gp-j1XiYA/348s.jpg", "caption": "Yuca Fries"}]}}, {"review": {"des": "CASH ONLY... from entering the place to the greeter sitting you down. Service is attentive and welcoming. The menu has plenty of variety from regular food to seafood. We ordered a surf and turf and steak sandwich. Food was cooked well, tasty, and good quality. The steak sandwich bread came with a butter smear all over. Not my thing but didn't know it was like this. Toasted French bread no butter I prefer, next time. Surf and turf was awesome. One con that really got to me was the wobbly tables. Next time I get sitters I will be checking for that. It's aggravating the whole time trying to eat. Thank you Irazú", "pics": null}}, {"review": {"des": "Wow! Great flavors all around. No wonder why this place has 2000 reviews. So goooood! I got the potato tacos and they were delicious! Even the rice and beans were perfect.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/0m5s8a27V3V8aSYtsY6LpQ/348s.jpg", "caption": "Potato Tacos and Tilapia Tacos"}]}}, {"review": {"des": "If you want good Costa Rican food or just good food go to Irazu. I always start with the oatmeal shake. Not something I would normally get so excited about but it's amazing. I've never had something I didn't like there but my go to is the veggie burrito with plantains. It's a good portion size and so delicious. <br><br>Tips: they don't take reservations so be prepared to wait and they are CASH ONLY and BYOB!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Y93qtnGNZZegc0FqPumwcw/348s.jpg", "caption": "Veggie burrito!"}]}}, {"review": {"des": "Food was excellent and service was awesome. It's BYOB with no cork fee. Cash only also. You really can't go wrong with the menu, there are so many options. Even the pickiest will find something he/she can eat. The sweet plantains were perfectly cooked, there was a nice crust around it. I order the surf and turf, both the steak and shrimps was marinated and cooked perfect. Flavors were on point! Love love this place!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/voqlRa1LaoEDpJixUH5y1Q/348s.jpg", "caption": "Surf and turf"}]}}, {"review": {"des": "Can't even elaborate. I sit here stuffed with nachiticos and paella.. just eat here if you're even entertaining the idea.", "pics": null}}, {"review": {"des": "I'm a Costa Rican living in Elmhurst and Irazu is my goto place when I'm craving home. The food is amazing and Herry and the entire staff are great, demaciado pura vidas todos.", "pics": null}}, {"review": {"des": "Delicious, casual and affordable. I really enjoyed the Casada with beef, as well as the black bean and mushroom empanadas. Just wish I lived closer!", "pics": null}}, {"review": {"des": "Checked in on yelp for a free oatmeal shake and it did not disappoint. Also ordered the Costa Rican sandwich which was delicious and very filling. BYOB and cash only so make sure you are prepared before going but they do have an ATM if you didn't bring cash.", "pics": null}}, {"review": {"des": "Overall: Great food is marred by mediocre service at this Tico spot.<br><br>The good: The food is hot, fresh, and authentic. Having been to Costa Rica 4 times in the past few years, the flavors and offerings here are the same found down South. The menu is perfectly balanced with what you can find there (plus huge), and everything on the plate was delicious. Definitely upgrade to the steak. Oh, and BYOB.<br><br>The not-so-good: I've heard the prices have gone up exponentially recently. Our waiter was absent for the majority of our time there, including when we had to pay for the check. We had to take it up ourselves and left. We were there for 2 hours, which shows the delay between ordering and food service. Refills never came and our waiter wasn't invested at all emotionally.<br><br>Atmosphere: 7/10<br>Service: 5/10<br>Food: 8.5/10", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/NL2yieS9RZxrUc_7XOqzJA/348s.jpg", "caption": "Tico meal with steak"}]}}, {"review": {"des": "We barely left Woodridge only to find my wife hangry.  She's been whining about going back to Irazu since our dating years when this mostly outdoor venue was a favorite after a night of drinks.<br><br>Irazu has since enclosed the open space - perfect for the wet weekend weather.  Prices were as remembered.  Low cost, high quality Costa Rican.  The flavor translates through flavor passed down from grandmother to grandson.<br><br>I absolutely love this place and rank it consistently among Chicago's things to do.", "pics": null}}, {"review": {"des": "This place is fantastic! Had the Palmito salad and skirt steak dinner. Great flavors, fresh ingredients and perfectly seared meat. The roasted bulb onions are a lovely touch and perfectly well done, too. The way they caramelize their roasted plantains to bring out all of the natural gooey sweetness is  incredible. Even the beans are lip smacking good! Try the oatmeal shake, don't be afraid of the green sauce. I love the open window design, on a sultry night it feels like you might actually be in Costa Rica!<br><br>Magic!", "pics": null}}, {"review": {"des": "An institution in the neighborhood, Irazu cranks out consistent Costa Rican fare at extremely reasonable prices.  Bonus point for being BYOB, which is always a plus.", "pics": null}}, {"review": {"des": "Really good food for a really good price.  It's not as big on the inside as it looks from the street but the cozy atmosphere and friendly service make you feel at home.  Their oatmeal shake is incredible - definitely splurge some calories on that treat.  Cash only but the portions are big and the price is very reasonable.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/HKQ-mxBrb9vG9tqUOtwFHg/348s.jpg", "caption": "Steak quesadilla - big and tasty for only $5"}]}}, {"review": {"des": "I'm a bit bothered at the fact that I'm just finding out that the oatmeal shake from Irazu is FREE with a yelp check in and bill over $25 bucks...I mean-- I love the food here, but there really is no cold beverage on Milwaukee Ave that beats their legendary oatmeal shake. Sometimes they're a bit heavy handed with the cinnamon, but that aint no thang! <br><br>During my last visit I had the surf & turf. Fire! The steak was cooked perfectly and the shrimp had real good flavor. Also the black beans with the little pieces of plantains was the perfect sweet and savory combo. <br><br>I really love the new build out and am happy to see a neighborhood staple continue to thrive in this ever-changing neighborhood. Irazu is owned by a local dude who's been in that space for over 15 years! Hats off my friends!", "pics": null}}, {"review": {"des": "Had a great bday dinner here! I had about 18 ppl. I contacted the restaurant weeks in advance to book the party room. Since the party room was already taken, they offered me group dining in the regular dining area. The group had to be split between two long tables. The menu was prefixe. There were some apps like chips, salsa, guac, a light salad. The main meal was the traditional casado. They brought out platters of chicken, steak, rice and beans, plantains. There was plenty of food for everyone and it all tasted great. Only minor complaints: the steak didn't come out until later in the meal and the tables aren't huge so we ran out space on the table to set the platters. At the end they gave us all a shot of their oatmeal shake (tastes like frozen horchata) and gave me everything I needed for the cake I brought. It's also byob! I give this place 2 thumbs up. The managers made it easy to plan, food is great, the atmosphere is fun and casual.", "pics": null}}, {"review": {"des": "I really appreciate the customer service that Irazu offers. They unfortunately did mess up my order but got in touch with me immediately to remedy the situation. Overall the food was great and would recommend it to others.", "pics": null}}, {"review": {"des": "Been coming here for years and will continue to do so.<br><br>Very charming place.<br><br>Very low key.<br><br>The food is delicious so don't fill up on chips!", "pics": null}}, {"review": {"des": "I contacted Irazú to cater my husband's 50th birthday party on September 29. We called Irazú after another restaurant we had lined up fell through. <br><br>Justin, the manager at Irazú was amazing from the minute he picked up the phone. He was so friendly and professional. He knew exactly what he was talking about and how much to order. Another great part was that he worked with the venue where we were having the party so finding the place and setting up the food wasn't going to be a problem. It was a great experience from the get-go!<br><br>Justin helped me through the catering order and steered me toward what would be a good option for our guests and we finalized on the casado package - beans and rice, meat, steak, veggies, and sweet plantains! We also ordered 4 dozen empanadas (2 dozen cheese and 2 dozen potato and beef) which were the hit of the party. On the day of the event, Maricella came and set it all up with chafing dishes. It was completely effortless. <br><br>I ordered quite a bit of food and we had a lot left over (we expected 50 people and ended up with about 38) but fortunately so many people took food home with them! Our guests loved it and many wanted to know where the restaurant was for future dining.", "pics": null}}, {"review": {"des": "Upon being seated, you're greeted with chips and salsa, including a delish spicy variety. Pepito sandwich is off the hook. Meaty, saucy, delectable. Great service as well.<br><br>Came on a weeknight at 6ish and didn't have to wait but I imagine it's pretty popular on weekends.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/TrkAoS22J2mbqXOXUqppJQ/348s.jpg", "caption": "Pepito"}]}}, {"review": {"des": "Not super familiar with Costa Rican cuisine but I love this place!!! It's nice having a different type of cuisine than I'm used to. Their sandwiches and oatmeal shakes are awesome! Also got a veggie burrito and added shrimp and it was great!", "pics": null}}, {"review": {"des": "Walking up to Irazú....<br><br>\"Is it open?\"<br><br>At first glance it looks closed and the sign isn't very noticeable. I've passed by this restaurant plenty of times and have decided against eating here because I could t tell if it was open. <br><br>Walking in is when your mind will be changed. The decor is so colorful and bright! The music will make you feel like dancing. The sweet plantains are a MUST! <br><br>If you can, visit the restrooms! Super authentic", "pics": null}}, {"review": {"des": "Irazu has always been one of my go to spots whenever I have friends and family in from out of town. The food, the service, the atmosphere has always been absolutely solid. <br><br>I did some catering for my warehouse crew during Black Friday. Irazu nailed and I had some really happy employees. They all ate too much so everyone was a little sleepy afterwards but I'll take that over hangry people. <br><br>Go for their empanadas, the pepito sandwich, and the oatmeal milkshake. <br><br>Super thumbs up!", "pics": null}}, {"review": {"des": "My boyfriend and I met another couple at Irazu last Thursday night for some Casado, empanadas and wine (BYOB!). I had been a hand full of times before, but it was the first time that the couple I was with had been. We were able to get a seat as soon as we arrived at 7:30pm, and we quickly uncorked the wine and dug into some guacamole. The restaurant itself isn't anything too fancy, but they certainly do not disappoint with their Costa Rican fare. <br><br>I ordered the Casado with skirt steak which comes with black beans, plantains and a fried egg. It was the perfect blend of flavors and spice, I would definitely recommend. Among the table we split the large guacamole and a sampling of different empanadas, all of which were delicious. <br><br>Everyone loved their entrees, and we even checked in on Yelp for the free oatmeal shake to share (which we all could have had our own even though we were bursting). It was an amazing shake! Cinnamon-y and delicious, I would definitely get one to go!<br><br>Overall, it's a simple joint with a menu full of all your Costa Rican favorites. BYOB (with no corkage fee) doesn't hurt, so if you're ever in the Bucktown area stop by! Be aware there is usually a wait, but you can always wait it out at the wine bar across the street.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/gG2czNWtNY-01BwbdV305g/348s.jpg", "caption": "Skirt steak casado, guacamole and BYOB wine!"}]}}, {"review": {"des": "THIS PLACE IS CASH ONLY**** and BYOB (they do have an ATM in the restaurant.)<br>Very authentic Costa Rican restaurant. Not much of a fancy place, but their food is very high quality. We ordered the fish tacos and a beef sandwich. The tacos came with rice, salad and other sides. But the beef sandwich did not. Both dishes were very tasty!<br>Totally would come back if in the area.", "pics": null}}, {"review": {"des": "I used to come here almost weekly, especially since my then bf lived above the restaurant. It was always crowded, cheap and delicious. Now i feel it's sightly less of those. The food is still good but not like when the mom used to cook in the small kitchen before the restaurant expanded. Their chips and salsa though were almost exactly the same. I had the steak sandwich and the steak seemed precooked, a bit tough and cold. My horchata was delicious as ever. The empanadas were fresh and tasty, light and crispy. <br><br>No, you can't freeze time but you can still be nostalgic about it. I think this is a still a very solid Cost Rican restaurant. The food is still satisfying and the ambiance is charming. I will still come here when I'm in town and enjoy the food. I'm glad they expanded, the restaurant looks very nice.", "pics": null}}, {"review": {"des": "Three points to note about Irazu:<br>1. It's BYOB<br>2. It's cash ONLY (ATM located inside though, with fee)<br>3. Be prepared to wait on the weekends.<br><br>The restaurant itself is a very unassuming place, very tight inside and very loud when it's full. Looks like they have a lovely patio area for the warmer months. <br><br>Menu was authentic and served hot and on time! I was very happy to see some vegetarian alternatives offered too.<br><br>Thankfully we have a local friend know knew about this spot. Seems to me that this is one of those neighborhood places that stays hidden from the list of places to visit in Chicago for out-of-towners.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/jYWr2ZPAEwDDxyHj-in4_A/348s.jpg", "caption": "Irazu"}]}}, {"review": {"des": "Great Costa Rican spot in bucktown/humboldt? I had the Casado, and was very impressed with how tasty this meal was. I felt very nourished after eating here, they use fresh ingredients, nothing is greasy or overly salted - no odd flavors.<br>Also make sure you check in with yelp, and try their oatmeal shake for free!", "pics": null}}, {"review": {"des": "This is one of my favorite restaurants! My favorite things to order from here are the oatmeal shake (have to get it every time) and their skirt steak dish.  Their plantains are so perfectly sweet and delicious.  Their food is so yummy that I just crave it every once in a few months.  <br><br>I had to take 1 star off just because... since their remodeling, they changed their menu, which I noticed the food went up in price.  I understand that this has to happen but still made me sad.  I'll get over it eventually.  It is also an inconvenience that they only take cash.  Also of all the 10+ times I have been here on 3 occasions it have taken them like 40 minutes to bring the food.  Also they don't open on Sundays. <br><br>Regardless of their little flaws, I love love love Irazu's food.  If this doesn't change I will be back!", "pics": null}}, {"review": {"des": "I have been to Irazu countless times and they never disappoint.  Everything on the menu is superb.  On my repeat list is the chifrijo which is fried pork layered with whole black beans, white rice, pico de gallo, topped with avocado and Lizano sauce.  I could go over everything that I have had but that just too much work.  You can't go wrong with any items on the menu, EXCEPT the chicken empanada.  Refrain from ordering that because it's crazy bland. <br><br>And an absolute must is definitely the oatmeal shake.  The shake is free with a YELP check-in and if you spend over $25 (dine in only).", "pics": null}}, {"review": {"des": "Awesome place! Free chips and salsa when you sit, relaxed atmosphere, Good prices for the portions, and BYOB!! Will definitely be back!!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/oezVXwy8DF1l6iUusOsTrg/168s.jpg", "caption": "Chicken tacos and tacos tico- loved the chicken!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/fFYo-VLr6sjrncRugNYqMw/168s.jpg", "caption": "Casado with tilapia- delicious!!"}]}}, {"review": {"des": "~Vegetarian friendly~<br>~Bring your own any type of alcohol~<br><br>Pro tip: make a reservation on Monday if you're planning to dine over the weekend! Ask for Logan, he's great to work with to get a reservation.<br>- One thing about the reservation is that even though we made one, we were seated almost 40 minutes after our reservation time. I imagine the problem is that people sit around for a while because they're drinking their alcohol and \"camping out\". Confession, even my group did that and we sat there for almost 2 hours. <br><br>Nevertheless, place is wonderful! The food is reasonably priced and delicious. I had never had Costa Rican food before and this seemed pretty authentic. <br><br>I ordered three empanadas: spinach & cheese, black bean, and jalapeño & cheese. All good but the jalapeño & cheese was my favorite.<br><br>My friends ordered: Vegetarian burrito, Chile Relleno<br><br>I had the chance to taste the sweet plantains and those were really good too.<br><br>Definitely worth visiting and enjoying great food with BYOB!", "pics": null}}, {"review": {"des": "The food was delicious. There Guacamole is perfectly made. I ordered their Surf and Turf. The meat was Skirt Steak. It was very well seasoned and tender. One of the best skort steaks I have had in a restaurant. The shrimp was grilled and also very well made with lots of flavor. The rice and beans were very good. The rice was perfectly cooked. <br><br>This place is BYOB- a great plus<br><br>The only bad thing that I was not very happy about was the service. Our waiter was not very attentive. We had to constantly ask other workers who came by to fill our water or other workers tending to other tables  to get our waiter. Service was truly terrible. Plus our orders were messed up. They did not come out all together. The longest wait was for a chicken sandwich, which you would thing would be the easiest dish to make. It's too bad the service brings my rating down for this place, since the food here is exceptionally great. <br><br>Once this place works on their lack of service, it will be a five star restaurant in my book.", "pics": null}}, {"review": {"des": "I came here for a surprise birthday dinner recently. The interior for Irazu is perfect for a BYOB meal! The people there are very rowdy, and the food is reasonably priced and relatively authentic! They were very accommodating in regards to storing and bringing out a cake, lit with candles. And they opened my friend's wine - so polite!<br>The chips that they brought out were a bit bland, but the chicharron was delicious, as was El Tico, a plate of rice, beans, plantains and mixed veggies and beef. The Pepito sandwich was also full of flavor and a lot more sturdy and filling than it looked!<br>I loved this place and will definitely be back to try more!", "pics": null}}, {"review": {"des": "On a beautiful Chicago afternoon, Irazu is definitely the place to be. They have all the windows open and it literally feels like you're eating outside. The interior is beautifully decorated. The staff was very friendly and welcoming. <br><br>I ordered their Pepito sandwich which was IMO fairly priced. Where did you get is when they off you skirt steak instead of the ribeye for an additional $3. But who can say no to skirt steak? I love it and thought it was absolutely worth it. The skirt steak was very tender and grilled to perfection. It also comes with black beans, cheese and the Lizano sauce. The sandwich was very flavorful and the toasty bun added some additional flavor. Of course I just came here for lunch, and I will without want to come here for dinner and try a couple of other entrees.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/kb1TBzlfKAbiZyTdF9F8Bg/348s.jpg", "caption": "Pepito sandwich"}]}}, {"review": {"des": "The Food at Irazú is quite tasty however the employee phone etiquette needs some looking over. <br><br>I always make sure to give places a 2nd or 3rd visit before reviewing so this was not a \"bad day\" type of issue. They have serious problems with phone orders. <br><br>1st time-called a lunch order in-asked what kind of 'white cheese' is in your sandwiches... their reply:<br><br>\"white cheese lady\" to which I challenged, do you know how many types of white cheeses there is?! His response: I don't know what to tell you. I later asked what is in your Lizano sauce?  The man then says,  \"lady I'm really busy here just give me your order.\" I was appalled!. Had I not been placing orders for coworkers I would have not even placed the order!!!  Nonetheless, since he refused to answer the question I asked can the sauce please be put on the side. <br><br>We get there to pay- and gentlemen takes care of Two customers in front of me and walks away. Comes back a few minutes later talks to a cook for about a minute and then comes to greet us; mind you our food had been sitting there packed this whole time. I was utterly annoyed because 'where's the rush now?!' <br><br>The kicker: our order was not made correctly-sauce on everything! (Insert eye roll!) <br><br>2nd time same poor phone etiquette.   Ordered a chicken soup- I'm asked what size. Well, I asked what sizes do you have? <br>Their reply: \"don't you have a menu in front of you?!\" I said yes I do BUT YOUR MENU does not specify size!!! She responds, well small or large.  I ask for rice on the side and after a few other orders hesitantly asked what type of oil do you fry in? She replied with I don't know I'm very busy here.  I explain I have someone with a nut allergy I will need to know before proceeding with the order and she hangs up! <br><br>Did not pick up the order and have not returned since! In conversation with a group of friends we realized that sadly their bad phone etiquette is quite common.", "pics": null}}, {"review": {"des": "Six of us came here for a small birthday dinner, and while the food was decent, it was the service that really rounded off the experience. A popular, mom-and-pop BYOB restaurant, the atmosphere was great, and the place was packed on the Saturday night we went. Many tables had some sort of alcohol going on and so naturally the entire restaurant was pretty loud and buzzed. The waiters were all very patient, friendly and efficient despite the environment being a little rowdy, and were so accommodating with storing our birthday cake in their fridge (and putting in our candles and bringing the cake out at the right time). Each waiter had a warm smile on his face when we interacted and we felt very welcomed throughout the entire night. <br><br>I got back from Costa Rica several weeks ago, and can attest that the food here is pretty authentic. You can never really go wrong with some hearty rice and beans, plantains and meat. I got the Casado dish with rib eye beef, and my only complain is that the meat and onion were on the greasier side. But I love everything else - the plantains, rice, beans, salad. The portions are also very substantial - a great bang for the buck!", "pics": null}}, {"review": {"des": "Best restaurant in the city. I've been here dozens of times and have never encountered a single instance where someone at the table walked away I satisfied. <br><br>Everything on the menu is delicious, but the Pepito sandwich is where it's at. <br><br>This is a BYOB place and the fruit shakes as a mixer elevates this place from amazing to the GOAT. Mixes best with rum but it'll work with anything. <br><br>Some important notes: this is a cash only place with long lines. The staff is super friendly though and the excellent service helps make up for the long wait times!", "pics": null}}, {"review": {"des": "Really good food, friendly service, and a cute atmosphere! <br><br>To drink, we got the oatmeal shake (free with Yelp check in!), and it was incredible. Perfectly creamy and sweet and super refreshing for a hot day. We also started with the fried plantains with a garlic mixture for dipping. They were really well cooked and the garlic was great! <br><br>I got the vegetarian plate which came with rice, beans, veggies with cheese, plantains, and a cabbage slaw. Everything was great, but I wish the salad had a dressing or sauce to go with it. <br><br>Otherwise, I would definitely go back! My friend lived in Costa Rica and said their breakfast was super authentic too!", "pics": null}}, {"review": {"des": "So. Good! I always bring people here from out of town. Never had an OK meal here. Super quick and delicious. The yucca, ceviche, burritos and gallo pinto are my go-to eats. Do yourself a favor and grab a bottle of Lizano for your house on your way out and an avena (oatmeal) shake too.", "pics": null}}, {"review": {"des": "Located a few blocks from the CTA Blue Line my parents and I stopped here to experience authentic Costa Rican Cuisine.  I have always wanted to go to Costa Rica and my parents went there over 20 years ago...and could not remember what they ate while traveling there...so it was a good \"pit stop\" on the way back from O'Hare Airport midday!<br><br>The art on the wall upon entering describes the Volcanic Mountain of Irazu which by the way is an \"active\" volcano!!!! Located near Cartago City in the central mountain range and is part of a national park area....(now I MUST visit!)  See: <a href=\"/redir?url=http%3A%2F%2Fcosta-rica-guide.com%2Fnature%2Fnational-parks%2Firazu-volcano%2F&s=064b8ff4155d96ad1e61ca5fddac7489c852313360041c3ccde2b94be828ea6b\" target=\"_blank\" rel=\"nofollow\">costa-rica-guide.com/nat…</a><br><br>The name Irazu means..\"ara=peak of tzu=thunder\"...see above link for more information and pictures...<br><br>Anywhoo...the restaurant was pretty busy during lunchtime and there seemed to be a group enjoying shakes which appear to be very popular and include wheat, milk, or soy based flavored shakes from Oatmeal, Passion Fruit, Snickers, Strawberry, Mango, Mamey...the list seems endlessly delicious in terms of options!<br><br>We were served a basket of housemade tortilla chips upon being seated and proceeded to order guacamole.....it was fresh and a huge serving with chopped tomatoes mixed in.<br><br>We ordered:<br>COSTA RICAN SANDWICH<br>Thinly sliced beef served with cheese, lettuce, tomato, mayo, mustard & Lizano sauce.  Lizano sauce is a thick smokey sauce similar to BBQ sauce..the meat appeared to be a bit on the \"tough side.\"<br><br>CASADO<br>An authentic Costa Rican dish! Choose the thin rib eye steak, which was served with white rice, black beans, sweet plantains, an over easy egg & cabbage salad.<br><br>Yuca Fries which were thick and nicely salted...absolutely my favorite!<br><br>and <br><br>VEGETARIAN BURRITO<br>Black beans, yellow rice, cheese, lettuce, tomato, avocado and sour cream.  Which was absolutely colossal in size and only half could be eaten!<br><br>It was nice to eat with the windows open and the sun shining through the restaurant.  It was a fun place to eat even if Costa Rica is miles away...it is nice to experience the food for a Chicago Minute!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/xB0UL-3zGdr-GVNPChNtnA/348s.jpg", "caption": "Costa Rican Signature Sandwich with a side of smokey Lizano sauce that is BBQ sauce thick"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Nen8JdfvAcmkGnbO1nIUEQ/168s.jpg", "caption": "Casado Plate!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Z_-ek5buekWm9s4W8BzS7A/168s.jpg", "caption": "Yuca Fries..nicely salted and tender!"}]}}, {"review": {"des": "Maybe a little better than a 2-star, but definitely not a 3-star.<br><br>I really don't understand what is the hype with this place. We tried their tacos, which were really bad, and their grilled steak sandwich, which was ok (after you take out the cheese from inside), but nothing to brag about. The service was also slow and inattentive - our food was brought out so late you'd think they slaughtered the cow for the steak in the back room while we were waiting.<br><br>Will not revisit.", "pics": null}}, {"review": {"des": "The oatmeal soy milk smoothie is EVERYTHING! You HAVE to order one! You gotta. I've tried making it here at home and I can never get it as good as theirs. It's cash only in person but you can order through Grubhub if you don't have cash  (I never carry cash) the potato tacos are yummyness. The pepito sandwich is hella good too.", "pics": null}}, {"review": {"des": "I tried this place for the first time and got the Casado and Chifrijo. I split those with a friend. I also got the oatmeal shake.<br><br>Over all I thought it was good. The Chifrijo has really good crunchy bits of fried pork. We got the steak Casado and it was well seasoned and I liked the egg with it.<br><br>It's not too pricey and overall a laid pack atmosphere. I'll definitely be back!", "pics": null}}, {"review": {"des": "I came to irazu with high expectations but was quite disappointed. After reading all the great reviews I was really looking forward to visiting irazu but thought the food was so below average. We came here for dinner and started off with chips and guacamole. I have to say their guacamole is wonderful and a good portion size. From the dinner menu we ordered the el tico and the chicken tacos, both of which were recommended by our waiter. I really wanted to like both of these dishes but they both lacked flavor. The tacos were some of the most flavorless tacos I've ever had in Chicago. They price them at 3 tacos for $6 but to get toppings such as guacamole, cheese, or sour cream, you pay $1 extra for each. We ended up adding a ton of their green hot sauce to add flavor. The portions here are quite large. It just felt like you pay only for quantity rather than quality.<br><br>Also if you check in through Yelp, you get a free oatmeal shake. I didn't like this either - it was just watery and I wasn't a fan of the taste. <br><br>Overall I was pretty disappointed with irazu. On a more positive note the ambiance is nice, airy, and energetic. Some of my friends mentioned that their sandwiches are really good so if I do come back I'll likely get one of those.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/-c2rLpJJKcOJt98CXsiQLQ/168s.jpg", "caption": "Chicken tacos"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/YVubtQzAo2pw6iS4goyOFQ/168s.jpg", "caption": "El tico"}]}}, {"review": {"des": "This restaurant was amazing!!! I went to Costa Rica a few months ago and the food from this restaurant taste so much better. The chicken tacos were amazing and so was the el tico. And to top it off the chocolate rum cake was thee absolute best.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/stayAYR5GWpWuzgC8JBQJw/348s.jpg", "caption": "Menu"}]}}, {"review": {"des": "It's a solid go to place for take-outs, but I wouldn't say the food is anything to write home about.... it's on the cusp of something great, like a word a tip of your tongue that you can't quite retreive... but nothing comes out when you move the lips, just a bunch of gibberish.<br><br>Irazu- add some depth of flavor for a longer lasting punch, otherwise you'll be my backup plan when my favorites are closed.", "pics": null}}, {"review": {"des": "Note: CASH ONLY! <br><br>We loved our experience at Irazu! When you first walk in, you might think it's a super small restaurant, but there's actually another dining section behind the kitchen for bigger parties! <br><br>We started our meal with the chifrijo. This was so good! It's pretty much a large portion salsa with pork belly! I repeat, pork belly! It much more filling than I expected it to be. <br><br>We then shared the much-loved pepito sandwich. The meat was immensely tender, juicy, and flavorful! The bread was perfectly crispy and everything in between was just perfect. We also got the Tilapia tacos which could have been more flavored but still good!<br><br>Don't forget to check in on Yelp to get your free oatmeal shake (pretty much a horchata smoothie-- so good!!)", "pics": null}}, {"review": {"des": "Friendly staff and delicious food. My friend and I had the Pepito, one sandwich and one romaine wrap. The steak was very good and flavorful, excellent onions. Menus were a little sticky and it wasn't clear where to pay but totally recommend.", "pics": null}}, {"review": {"des": "Irazu is such a fun and unique spot.  It's BYOB which makes it a hot table on a weekend night, and we had to wait a little over an hour with no reservation.  <br><br>Costa Rican food so they have the classic plantains, rice and beans, and different chicken, meat and veggie dishes.  They also cater to the classic American taste and serve chips and salsa, tacos and burritos, all of which aren't really inherently Costa Rican, but tasty nonetheless!<br><br>Fun for groups if you can get a big table, and awesome in the summer when they have their big patio open.  If you are in the area and looking for a cool change of pace, check this place out!<br><br>Oh- and it's cash only so plan accordingly if you want to avoid ATM fees.", "pics": null}}, {"review": {"des": "ultimate comfort food! i always get the vegetarian plate:::: the plantains are perfectly roasted and melty, the familiar rice and beans encapsulate me like the gravity blanket (that one that claims to relieve anxiety and promote sleep), and the veggies and salad are a light but still flavorful complement to the heavy meal. <br>but...the oatmeal shakes are.. what the angels drink...i have tried to recreate the oatmeal shake... to no avail! they offer you three options to make it with- water, milk, or soy milk, and in many different flavors. try it- it is free if you check in on yelp", "pics": null}}, {"review": {"des": "Wow what I can say that hasn't already been said about Irazu? First off the need to knows: you're going to wait for a whileeee. Granted we were with a group of 9 and it was a Saturday night at 8 but still it took 2 hours and us bugging the guy we checked in with to get seated finally. Cash only (ATM inside) and BYOB. <br>Also another place great to do family style type of meal sharing dishes so you can maximize your time and try as many things as possible. I can't recall every dish we ordered because it was so much and so many people. But plentyyyy of food! You will not leave hungry. <br>If you check in on Yelp you can get one of their infamous oatmeal shakes!! Highly recommend mmmm.", "pics": null}}, {"review": {"des": "Having lived in Central America (Guatemala) for quite some time, and then spending extended periods of time in Belize & Panama, you could say that Central America has a special place in my heart. I've never been to Costa Rica but I was too excited to find Irazú through Yelp. <br><br>Now, let's start with the cons:<br><br>In the year of our Lord, 2018, I need for this fantastic place to not be just cash only. I had to make a specific trip to the ATM just to prepare for coming here. Come on now... I understand cash is king but give me some options please. Can I Venmo or nah?<br><br>Now to the pros:<br><br>The pepito sandwich is straight fire! I upgraded it to skirt steak and added on avocado. Definitely do the avocado people. It's phenomenal. Very well seasoned and filling. <br><br>The customer service! Super attentive and kind! I didn't get the name of my server, but thank you so much. You made my solo dining experience worthwhile. <br><br>And for the mediocre:<br><br>The horchata. Tastes like the Klass mix. <br><br>I look forward to returning and bringing along some friends. Definitely a great atmosphere. Buen Provecho!", "pics": null}}, {"review": {"des": "I've been debating between 3 and 4 stars here.... we wanted to LOVE this place so badly!!!! But it just totally fell short. We didn't have to wait long for a Saturday night-- maybe about 20 minutes or so. Long enough to go and pick up some alcohol and make it back, so no problem there. The interior of the place is SO GREAT. all of the windows open up and the place is just super airy and it's like you're outside but you're not. There's a clear view into the kitchen from the end that we were sitting on, which was also pretty cool. <br><br>We weren't waited on very quickly, but it's understandable because the place was packed. Our waitress was fine-- nice enough and quick enough. It's the food that was really the demise! We all ordered and were just SO EXCITED for what we ordered and EVERYONE thought their food was a little lackluster.... for how great the ingredients sounded, the flavor just wasn't there. Two burritos, steak, chicken, and the big pepper was ordered. I'd say the pepper stuffed with cheese was probably the best. The chicken I got was not super warm, so it seemed like they waited to bring it out and it just was not exciting. <br><br>We all agreed-- between a 3 and 4, but we'd go again for the atmosphere.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/pESSxAKIhv6wiA70ojqEkw/348s.jpg", "caption": "Chicken & Veggie. The egg on top was a nice touch but it wasn't runny at all unfortunately"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/f6Yq0fudgJk6NUAHgoxs1w/168s.jpg", "caption": "Stuffed pepper"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/CAX00T8e77ddmyrmY6ejZg/168s.jpg", "caption": "Grilled Steak"}]}}, {"review": {"des": "The food was alright. <br>The food and veggies were not fresh. <br>The chips were old. <br>We got sick immediately after eating. Also when going to pick up our food, we were getting stared at. Obviously not a POC friendly neighborhood.", "pics": null}}, {"review": {"des": "My wife and I are not vegetarians, but eat more veg than we do meat these days. Irazu delivers a wonderful variety of flavors in all the vegetable dishes we have tried. Exactly what we look for- variety, spice, and creativity in dishes. Irazu is a gem. And they deliver! We have had no problems with the food orders being wrong or cold when they arrived. 5 stars all around.", "pics": null}}, {"review": {"des": "Irazu is one of Chicago's finest experiences. With a decades long history of serving authentic Costa Rican food in a casual setting, they have recently updated and enclosed their now year round front patio section. Consider the quick takeout if you are in the neighborhood. While there are many traditional plate dishes that aren't can't miss, two you can't go wrong with are the veggie burrito and the one and only oatmeal shake. <br><br>The veggie burrito is toasted perfectly and filled with black beans, yellow rice, cheese, lettuce, tomato, avocado and sour cream. You can substitute for their well known Costa Rican rice, marinated overnight with black beans and Costa Rican spices. Vegans go no diary. Carnivores add meat. And everyone consider any of the extras for a $1 on top of the $7 price- sautéed mushrooms, spinach, zucchini or sweet plantain.<br><br>This place is the best.", "pics": null}}, {"review": {"des": "This is one of my favorite Costa Rican places and is one of my go-to restaurants. The food is usually pretty good and so is the service. I stumbled upon this place a few years ago and I do not regret stopping by. Definitely worth the try.", "pics": null}}, {"review": {"des": "This is place is only 8 minutes from me. Since I'm at work I decided to order for delivery. It took over 90 minutes for my food to arrive. I called the restaurant and they claimed my order was not listed. They hung up on me while trying to sort this whole thing out. They withdrew the money out of my account yet, they couldn't find my order. The driver showed up and my food was extremely COLD! So disappointed. It was my first time ordering from this place. As a pregnant women who is hungry, I didn't want to call to have this sandwich returned because that would mean I would have to wait another 90 minutes for a sandwich that would most likely be cold again. Not happy. First and last. I feel bad as I really wanted to like this place.", "pics": null}}, {"review": {"des": "Great veg options, including non dairy milk option for shakes. Love the black bean soup.", "pics": null}}, {"review": {"des": "One of my New favorite Latin restaurant. Open concept that is fun and family friendly. The service was great, they offer suggestions and prompt. The food is aesthetically pleasing and tastes amazing. I recommend getting a few items to share. This place is BYOB but the beverages they sell, including their shakes, are delicious.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/advSJoQLwEhW1iL7XRAWXg/348s.jpg", "caption": "Oatmeal shake"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/PVsbyArrxdciinDyQWNK2w/168s.jpg", "caption": "Appetizer- very tasty"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/f_ve2E_e5Mm0Qcf0ZnZ-nA/168s.jpg", "caption": "Pepito Sandwich"}]}}, {"review": {"des": "We stopped on our way back to Milwaukee from Chicago, an annual tradition.  Wish this restaurant was closer.  The food and service are amazing!!", "pics": null}}, {"review": {"des": "I had an event catered for a rehearsal reception for 75 guests.  Justin the catering manager helped me pick the menu!!  We ordered extra empanadas and not one left over!!  The spinach and feta were out of this world.  They did the set up and take down and I had a server keep the dishes warm and full!!  The comments were amazing from all the guests!!<br>Use this restaurant for you next catered event!!", "pics": null}}, {"review": {"des": "I did not have a good experience here. We were seated immediately after arriving which was good, but my god this place is LOUD. Like a high school assembly. My husband ordered the steak sandwich with yuca fries and I offered the steak dinner. My steak was warm and the rest of my food was COLD. We were waiting for at least 45 mins so I have no idea how this happened. The rice I got with my meal was hard and not cooked all the way. The beans were cold, and the maduros were cold. I didn't even bother complaining to the waiter, just lesson learned. Food is mediocre at best, I won't be back.", "pics": null}}, {"review": {"des": "The oatmeal shake is a must. I ordered the shrimp veggie plate and it was so flavourful! Need to return and try more.", "pics": null}}, {"review": {"des": "What a fun BYOB atmosphere. I absolutely love Spanish-culture and loved that this Costa Rican restaurant was different than the typical mexican cuisine that is offered everywhere else. We came in right at 5 pm on a Saturday, and it was pretty busy already! The chips were delicious, and the fresh fruit shakes are an amazing concept. We had brought a tequila bottle so we mixed that with a pitcher of mango and pineapple fruit shake. Best drink ever.<br><br>My friend and I split the small Chifrijo for an appetizer. Fresh, flavorful, and hearty- who even knew there was such a combination? The fried pork shanks are tasty- probably all fat, but that's what made it so delicious! Our friends were all eyeing our plate and trying to take some pieces to eat with their chips.<br><br>I got the palmito salad with shrimp as my entree, and I'm glad I didn't get a heartier dish. This and the appetizer was more than enough to leave me with a very very full belly. The shrimp was excellent, and the salad was great. I also tried the empanadas, though we couldn't tell which was which, and they were all delicious. The quesadillas were great too, though the cheese wasn't quite melted thoroughly.<br><br>To finish off the amazing and filling dinner, we had a bread pudding slice- complements of the restaurant for a birthday- and the oatmeal shake. The bread pudding (or maybe it was flan?) was scrumptious, warm, and melt-in-your-mouth tasty. The oatmeal shake was like a very sweet horchata-like milkshake. So basically, even though we were overwhelmingly full, we couldn't resist on the desserts that this awesome place had to offer. <br><br>Service was to the point and accommodating. Not the quickest, but got the job done. Thanks for a fun time Irazu!!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/y2d81ebHK4KUqSSEssU8XA/168s.jpg", "caption": "Palmito w shrimp"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/aX9A8NzJNHUXsYJ7eBfyBQ/168s.jpg", "caption": "Chifrijo and mango pineapple shake for the tequila!"}]}}, {"review": {"des": "There should be an extra star for catering that I wish I could award this business! I often feed large crews of people, locals and out of towners. And the consensus is always the same: this food is AMAZING! Time and time again- these guys provide excellent spreads. Always on time, always fresh with on point presentation. 6 stars from me and all of the hundreds of peeps I have fed with your help! Thanks heaps Irazu!", "pics": null}}, {"review": {"des": "I really enjoyed the atmosphere and food tonight. <br><br>I have been wanting to come and eat here since last year. After I read some great reviews I was anxious to witness this place myself.<br><br>Well this evening I got a chance and it was amazing. It was a bit busy but the wait was well worth it.<br><br>Me & My Bestie made plans after a wine event to come dine here. The menu had so many selections to chose from and it was hard to decide.<br><br>We both just ordered chicken burritos with a side of yellow rice. P.S The waiter brings you a basket of nachos chips with the green salsa.<br><br>It took the waiter awhile to come to our table so that we can place our order. But when he finally made it over to us. He politely apologize and stated that he would bring us out a piece of Rum Cake on him. So Sweet<br><br>The music is very relaxing and the food is so yummy. Everytime the waiter came by with a plate. We kept turning around because every plate that came out looked amazing and yummy.<br><br>Just a few FYI's.... 1. Pls make sure you bring Cash for your meal. They don't accept debit or credit cards<br>2. It's BYOB... Yessssss. You can bring any beverage that you may like with your meal.<br><br>Also, make sure to check-in and get your Free Oatmeal Shake. Which is also a delicious treat.<br><br>I will be back to try the other dishes on the menu. Great Customer  Amazing Tasty Food and the atmosphere is nice and relaxing", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/UJD1xASWxIogJkNMcJzdfA/348s.jpg", "caption": "Rum Cake"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/10auhh-OrI4gRlE_uoukBw/168s.jpg", "caption": "Decor"}]}}, {"review": {"des": "The Food...<br><br>As a Costa Rican I had high hopes for this restaurant, but found it to be the equivalent of what Chipotle is to authentic Mexican food... disappointing. Don't get me wrong if you like Chipotle that's fine, just don't try and compare it to authentic Mexican cuisine. The menu options contained a limited amount of true Costa Rican dishes, the few limited authentic menu options were  were watered down versions of what true Costa Rican food should taste like. I suppose this was done because the chef is attempting to appeal to people who like to think they're eating something authentic, while not offending them with bold and authentic flavors. Again, Chipotle vs. authentic Mexican food. <br><br>The Service...<br><br>The service was \"ok\". The customer base for this restaurant are soccer moms, and middle aged hipsters so I'm sure the servers get their share of abuse from these over privileged hipsters, so I'll give them a pass on this.  While I was eating I witnessed a group of soccer moms with their middle aged hipster husbands repeatedly talk down to staff.", "pics": null}}, {"review": {"des": "JUST YUM!<br><br>This is my favorite restaurant in the entire city (try their bean dip that's not on their menu).  Anyhow, my family just threw a couples' shower for me and my fiance and Irazu delivered all the way out to Glenview.  It was so delicious and people are still talking about their food.  This is just seriously the best!<br><br>#irazuchicago you are the best!", "pics": null}}, {"review": {"des": "AMAZING!!! This is our go-to neighborhood spot. It's the kind of place you really don't want to write a review about because you want to selfishly keep it all to yourself. The food is always and I do mean always great. My favorite dishes are: the pepito sandwich, the tacos, the steak quesadilla, and the casado. You HAVE to get guacamole to start your meal but don't forget to get a side of plantains because yum. They have a patio area in the front of the house that has some really massive windows and if the weather is nice, the windows will be open. The back of the restaurant is cozy and a great place to gather. The waitstaff is great. They always seem to be there when you need them and deliver your food quickly. They make you feel welcome and try to get to know you if they see you there often. The menu is extremely affordable and if you need another reason to go, it is BYOB without a corkage fee. An oatmeal shake is a great dessert choice as well as the flan (what do they do to make it taste so amazing??).<br>Pro-tip: Order a steak quesadilla to go. The next morning, scramble and egg, heat up the quesadilla put the egg on top and you have an amazing breakfast.", "pics": null}}, {"review": {"des": "These empanadas are savory! Try the spinach and cheese and you might as well get two because one just isn't enough. The chicken is always a safe option and you could try the plantain one if you're feeling adventurous. Sad I didn't try any of the vegetarian options, but there are a plethora. <br><br>Our waiter was really kind even though they were short staff. I hope to come back when I'm back in the city AND I'm bringing my other amigos.", "pics": null}}, {"review": {"des": "OMG, this place is awesome. I've only been here once, but I already cannot wait to go back. It's BYOB, which is dandy enough. So bring some bevies and grab a seat. The food is not to be missed. They have wide open windows so that even though you're inside, you feel like you're outside.<br><br>Great atmosphere. Good service. So onto the food I was talking about. <br>-Chifrijo - (fried pork layered with whole black beans, white rice, pico de gallo, avocado, Lizano sauce) it is amazing. It was so good we ordered a second. The flavors are out of this world and if you have pork issues, there is a vegetarian option<br>-Patacones - (double fried green plantains with roasted garlic oil on the side) also, super delicious. I was iffy since I don't always like plantains, but these were awesome. They give you a lot.<br><br>Note: they may be cash only, I didn't pay so I wasn't really paying attention.<br><br>TLDR: get there, try some food, bring some beer, bring cash", "pics": null}}, {"review": {"des": "Great food. <br>Love the fact that it's BYOB. <br>Cash only but oh well no big deal. <br>I wasn't a big fan of the empanadas but the Casado was great and so was the rum cake. <br>Others got the surf and turf and said it was delicious. <br>The oatmeal shake was good too, tastes just like Horchata to me but with a thicker texture. <br>It gets crowded so avoid prime time, even though we had a reservation we had to wait about 30 min for our large party to be seated.<br>We will definitely return", "pics": null}}, {"review": {"des": "My daughter, her 4 week old son and I had an amazing experience at Irazu!   We came here for lunch.  Ben was our server and he is wonderful!<br>We brought a bottle of wine, ordered the pepito sandwiches and listened to the Latin music.  We all loved it!  My grandson Noah loved the music!<br>We'll be back.  Thank you.", "pics": null}}, {"review": {"des": "So so so so good. So good that I got pulled out of Yelp review hibernation. Just come here and be prepared for some taste bud euphoria. We had the pepito sandwhich and the chifrijo, as well as the oatmeal shake-- everything was phenomenal.", "pics": null}}, {"review": {"des": "Updated patio. Still delicious.", "pics": null}}, {"review": {"des": "I really enjoy the sandwiches, empanadas, and sweet plantains here. The only reason this place doesn't get 5 stars from me is that they messed up our order and gave us the wrong empanadas.", "pics": null}}, {"review": {"des": "This is a great place to come in and grab a quick bite. I have lived in the neighborhood for years and it is one of our regular spots. I recommend any of their sandwiches along with their yuca fries.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/bobLy3QBPQ-nC23dssnJmg/348s.jpg", "caption": "Ceviche"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/sJwJ78wIqcmErjG9jKQ_Lw/168s.jpg", "caption": "Yuca fries"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/90eR3I-beTu1lBqYkUat2g/168s.jpg", "caption": "Milanese sandwich"}]}}, {"review": {"des": "I have been trying to make my way here for at least a decade but the stars never aligned.  It finally did today.  We had almost every empanada, the chorfrijo, Casado and oatmeal shakes.  <br><br>I was a bit let down because the chorfrijo was heavy salted and the Casado was extremely greasy.<br><br>I left with a bit of heartburn and was extremely thirsty.<br><br>Maybe it was an off day and perhaps will be back in the future.", "pics": null}}, {"review": {"des": "Wish I could give more than 5 stars!<br><br>I recently organized a birthday dinner at Irazu for my fiance + 20 family and friends. Henry could not possibly have been more accommodating for us. Everything was truly outstanding - the food, the service, the ambiance, and even the price which was very reasonable - and I'm a tough critic!<br><br>Many thanks to Henry and the rest of the outstanding Irazu staff for a special birthday dinner. We'll see you again soon!", "pics": null}}, {"review": {"des": "Food is good overall. But the steak is over seasoned. Too salty! Delivery is good. Will not order the steak again", "pics": null}}, {"review": {"des": "Beware of overeating!! This place is AMAZING and the portions are HUGE!!! Don't be like me and get so full that you slip into food coma. Don't even know where to begin...I've been having \"food dreams\" about this place since I left.<br><br>General Info:<br>I was in town and this was our first food stop. BYOB and cash only is an important tidbit to keep in mind. We did not have a hard time finding parking (Thursday evening) The seating has a nice indoor/outdoor feel with the windows. Staff was very friendly and attentive. We were there for awhile chatting but they never rushed us, which was nice. Service was quick and restaurant was very clean. My only complaint is that the tables were a bit tight for a group of our size (5) - they were shallow and tall persons in the group had knees bumping below the table. We're all friends though- so not a deal breaker. The restaurant was family friendly with a variety of age groups, which was nice as well.<br><br>Now the best part...the food!!<br>They start by giving you homemade chips and some salsa. The salsa is rather spicy, and I am a person who has a VERY high spice tolerance. That being said, use the sauce sparingly. We started our meal with the large Chifrijo (perfect size for our group). The dish was great with the homemade chips - the pork within was THE BOMB!! My husband and I both ordered the Steak Casado for our main entrees. The only complaint that I had is that the dish was draped with onions - neither of us are onion people. I wish that this had been disclosed on the menu so that we could have ordered without. We just pushed the mound onto a side plate and proceeded with our delicious meal. The fried egg on mine was overcooked a bit (more of a \"hard boiled\" style) and not runny as expected which was disappointing, but my husband's was done perfectly. The plantains were out of this world. All in all the food was great and I cannot wait to go back and get the same meal - with a runny egg! The servings were HUGE and we had lots of leftovers.<br><br>Everything was reasonably affordable - our portion of the bill with 20% tip (2 entrees and the appetizer) was about $50. Not bad at all, especially given the location. Notably, we just drank water. Our friend brought a bottle of wine but I do not believe they charged her for it.<br><br>**FUN FACT** this restaurant was on DDD!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/wQctnJ5Sq6oA6WerHUpMWA/168s.jpg", "caption": "Chifrijo aka Costa Rican heaven in a bowl"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/FTCXyxs811-1pQvexCOwNg/168s.jpg", "caption": "Steak Casado *note the onions not included in the menu description*"}]}}, {"review": {"des": "Food taste great, love their empanada and breaded steak. <br><br>The service is excellent as well. My smoothie came melted bc it was in the car and they offered various solutions to it (no puns intended). Not a fan of their smoothie to be honest, it's just all so watery. But flavor is good.", "pics": null}}, {"review": {"des": "Let me start off by saying I've never actually dined in.  I've had delivery from here and most recently attended an event in their private party room down the street.  I know that the restaurant itself can get very busy and is always on a wait.  I typically am not a big supporter of going somewhere that doesn't take reservations, hence I will likely continue to get delivery when I want Irazu.  <br>That being said, they have a huge menu that can really accommodate anyone's tastes and dietary needs.  They offer a lot of veggie focused dishes which I love, and OMG the plantains.  I don't know how they make them taste like that but they are like candy to me.  I also recently tried a sample of their oatmeal shake that everyone raves about and it is borderline life-changing.  Especially given that it can be made dairy free with soy milk! <br>The private party room was just re-done and it is a super cute space with a little tiki bar.  The service we had there was wonderful as well.  I would definitely recommend it if you were hosting an event.  <br>The food is inexpensive, fresh and tasty.  What more could you ask for in a neighborhood place?", "pics": null}}, {"review": {"des": "Great atmosphere, sevice and even better food. My friend and I had never been to a Costa Rican restaurant the floor and decided to try this place, we are very happy we did. We are going to the empanadas as an appetizer which I highly recommend. We both ordered the Casada as our entree which was great as well. If we are ever back in this are of Chicago we'll be back.", "pics": null}}, {"review": {"des": "This is one of my favorite restaurants in the Bucktown neighborhood. Everything about this restaurant is so authentic it's family owned. The remodeling is so nice too. All the detail put into it, makes it have such a homey atmosphere. I usually get the steak dinner but today I switched it up and got the Pepito sandwich absolutely delicious! I always get the agua de horchata because it's the best. It really is guys try it ! I love the chips and green salsa! Definitely check it out if you like costa rican food. Oh yea and it's BYOB!", "pics": null}}, {"review": {"des": "I ordered the Chile Relleno and a salad, and the food was alright. You get a lot of food for the price, but didn't taste as good as I was expecting based on existing reviews. Maybe would have been better if we ordered one of the more traditional dishes on the menu. <br><br>The ambiance is the main reason why I rate this 3/5. It was very noisy inside and with the trains also going by every few minutes, it was very difficult to have a conversation.", "pics": null}}, {"review": {"des": "I was surprised and dissapointed by the food quality here. I have been making my own gallo pinto for 20+ years and thought it was time for me to try this place out since I now frequent the neighborhood regularly.  A simple breakfast plate of gallo pinto, scrambled eggs and friend platanos from a local soda is almost always fresh. This wasn't. It tasted old. The platanos weren't too bad, I do realize everryone makes them a little differently. I could tell that I'd come in right after a big party had left - the wait staff was a little frazzled, but fairly good natured about it. <br>I'll still give this place another try - I want to try the ceviche, but I think I'll stick to my own gallo pinto recipe which was passed down to me ( while I lived there ) from my former mother in law, a Costa Rican native.", "pics": null}}, {"review": {"des": "Great Place, great food and prices.<br>Restrooms are Mint and well decorated, same as the entire restaurant. <br><br>(Cash Only ! But they have an ATM inside)", "pics": null}}, {"review": {"des": "Having heard about irazu from my fiancé plenty of times, this place was hyped, especially knowing Guy Fieri made a visit. Luckily, it's for good reason. Since we were starving after a long afternoon, we wasted no time and ordered the Chifrijo. If you've read other reviews, they'll probably mention this app. You have to try it! It will not disappoint! It's fried pork, black beans, white rice, pico de gallo, topped with avocado and a Lizano sauce. It was incredibly tasty and savory, really hitting the spot for us!<br><br>The entree was overwhelming but I'm not complaining since I love leftovers! I went with the casado with chicken. It was accompanied by white rice, black beans, sweet plantains, an over-easy egg & cabbage salad. Generous portions much? Again not complaining at all! I personally enjoy throwing an egg on things (burgers, bibimbap, etc) so the egg was perfect. Plantains? Don't mind if I do! This is quite typical for many Latin American meals but still, it's just a really great way to get a sweeter flavor into the meal which I've always appreciated.  The cabbage salad was just right too, refreshing, not too much vinegar and tasty.<br><br>Besides the fact that they only take cash and it was a bit chilly inside (some windows were left open), I really enjoyed my first visit to Irazu. I wouldn't think twice about eating there again if we're ever in the area", "pics": null}}, {"review": {"des": "I just love this place! Its so convenient for me so I always do pick up! <br>Food is so delicious and full of flavor! I loved pretty much everything I ever ordered from there! My favourites are Quesadillas, fajitas, chifrijos ( its rice , beans and fried pork , similar to chipotle burrito bowl but so much flavor), yuca fries, pepito sandwich. <br>And You must get a oatmeal shake!!!! Its a MUST!!!<br>You wont regret it!<br>The place has been renovated and they did such an awesome job!!! You have a feeling like U are on vacation!!!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/FCbSuOLkicbbqNZoLTCrdw/168s.jpg", "caption": "Oatmeal shake is a Must!!!"}]}}, {"review": {"des": "So far, I have only had take out from this restaurant, but I have had takeout from here probably 5 times in the last 2 months! The food is AMAZING! I always get the grilled steak which is served over grilled veggies. The steak is moist and has amazing flavor. I love mixing the steak with the cabbage salad. The cabbage salad is sooo good. Im not sure what the dressing is, but I could eat it all day. The sweet plantains are great. <br><br>For appetizer, I recommend the empanadas. They have a variety so you can choose what fillings you want. I like the chorizo and potato as well as the mushroom fillings. <br><br>The portions are huge! I always have enough to bring for lunch the next day. <br><br>I will definitely be ordering from this restaurant in the near future, but do hope to visit the actual restaurant one of these days.", "pics": null}}, {"review": {"des": "We love eating at the restaurant (especially so after the renovation) so when it came time to plan a wedding rehearsal dinner, they were our first choice. Their event space is across the street and down half a block, and looks amazing. As of September, 2018 the space was recently rehabbed and sharp. Staff on site was attentive and the food was SO GOOD. It's BYOB just like the restaurant, and they'll tend bar for you before the buffet gets going.  The sound system is great and easy to Bluetooth your phone to, so you can really personalize the tone of the evening with your own playlist. I think it came out to $30 a head and there was food to spare. Bonus is that if there are any leftovers you can donate them straight to a halfway home nearby.", "pics": null}}]}