{"name": "isla-pilipina-chicago", "reviews": [{"review": {"des": "Disclaimer that this review is only for the lumpia shanghai, which I got for takeout one evening I was in the neighborhood and craving a snack. Given how much I love supporting both my people and eating food that tastes like home, I'll definitely be back here for a sit-down meal at some later date.<br><br>The lumpia shanghai was less than $5 for 10 pieces and exactly what I needed. Crunchy, yummy, and comforting. It also took them about five minutes to get my order ready, and just a generally positive experience.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/L81VdGiTGKlGcaJR73xFzA/348s.jpg", "caption": "10 mini lumpia shanghai for  $5."}]}}, {"review": {"des": "Love the space, super quaint and like many great casual, authentic Asian joints placed smack dab in the middle of an unassuming strip mall.  Love the quirky shower curtain at the front door/entrance, extra point for that!<br><br>Lumpia small but great taste, ordered what seemed like a hundred but our group polished them off post haste.<br> <br>The gf's BIL is Filipino so let him take control and ordered pretty much everything on the menu. I won't bore you w the details of every dish but rest assured, everything was excellent, as was the service...(and by bore you w the dish details I mean, I cannot recall as this visit was like a month ago).<br><br>Highlights: Pancit everything and the Crispy Chicken. Both sensational!", "pics": null}}, {"review": {"des": "Like other reviewers have said, this would be in my top 3 filipino restaurants I'd recommend to Filipinos and to non Filipinos who visit Chicago. It's Filipino enough and Americanized enough to balance the slight upscale with paying homage to Filipino roots. In my opinion, typical Filipino eating etiquette not only calls for delicious balance in taste but also quantity is always bountiful - the smaller platters are a bit shocking at first, but the taste does offset this a bit. <br><br>The place is not too small, but small enough to result in a wait on certain days/hours, but they have a waiting area. From dinuguan to sisig, everything so far is delicious. The only thing I'm disappointed in is the halo-halo... I can't quite pinpoint what's wrong with it.. the beans? Too much ice? I'll try again during my next visit to update. <br><br>I always give credit to fantastic service, and despite being busy and packed, the servers are ALWAYS eager to help and check in on you and how your food is. <br><br>I deducted 1 star because the food quality/taste is inconsistent and the halo-halo is not great. Still, overall food is generally better than others. <br><br>They have parking available.", "pics": null}}, {"review": {"des": "Review # 33 out of 365<br><br>I've been told this is a rare restaurant. This is the ONLY Filipino restaurant and it's the best. My nail girl warned me to go on off times. Did I listen? No. We had to wait for 15 minutes, which I was told was small compared to the normal wait. I think they have 12 tables. They are packed and I was excited.<br><br>Lumpia was spot on. You can order two sizes, we were told me had to order the small. No problem. They were perfectly crispy and the spicy thai chili sauce was excellent. 10 out of 10. <br><br>Beef Steak Tagalog was made of tender meat, maybe a chuck roast. The sauce was delicious and made of a rich soy sauce gravy. Served with rice, I felt like adding it to my Pancit was probably wrong, but it was awesome. Pancit was just what I wanted. Noodles were cooked perfectly and the chicken was perfect. <br><br>Bravo. If this is it in Chicago, I'll be a member for life.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Ib2BNu66U3ptN_yKruJ6nQ/348s.jpg", "caption": "Lumpia Shanghai (eaten)"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/cNAT4fCzqfKeMdSu9dIyaA/168s.jpg", "caption": "Beef Steak Tagalog (eaten)"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/VOrul1cTvSKOWSJFUmxZqw/168s.jpg", "caption": "Pancit Bihon (eaten)"}]}}, {"review": {"des": "I love Isla!! They have such good Filipino food at a decent price. Atmosphere of the restaurant is comfortable. The food is delicious and I can't get enough of it :).", "pics": null}}, {"review": {"des": "Let me begin by saying that I am Filipino but I am not a big fan of Filipino cuisine.   However, after seeing many great reviews of Isla Pilipina, I thought I'd check it out.  <br>I brought my Mom here for Sunday lunch. It's a small place and most tables were already taken or had \"reserved\" on them. If you're planning on bringing a group, make a reservation. <br><br>The food.....YUM!<br>The waitstaff.....EXCELLENT!<br>The ambiance.....COZY. <br><br>We ordered based on the recommendations of our waiter. He was very friendly. Maybe he was the owner?  <br>Anyways, to my surprise, I really liked everything:  egg rolls, garlic fried rice, fish, and pork dish (see photos).  Thumbs up", "pics": null}}, {"review": {"des": "The food is DOPE. Service is DOPE. The People are DOPE I have been here many of times and I have never been disappointed. They give you a lot for the price and the staff is just so DOPE! That Garlic fried rice thooo", "pics": null}}, {"review": {"des": "For someone that lives for carbs and fried food, Filipino food is my ultimate weakness. Isla Pilipina gives you no nonsense good food that's super affordable. It's just not good for your waistline haha.<br> <br>A group of us 5 got the following and had plenty of food to take home:<br><br>- Lumpia Shanghai (10pc): My one regret was not to get 20 pieces. \"Love\" is listed as an ingredient. Must-get.<br>- Kare-Kare (beef and oxtail in peanut gravy/sauce): TO DIE FOR. I could drink the sauce. Oxtail was so tender.<br>- Tocino (fried cured pork): Reminds me of Cantonese style BBQ. Perfect combination of sweet and savory.<br>- Inihaw Baboy (grilled pork strips): Nicely cooked but not extraordinary. I feel it's not easy to mess up grilled pork.<br>- Guinataang (green beans, eggplant, squash and shrimp in coconut milk): Smooth and flavorful, but not a must-get imho.<br>- Grilled vegetables: A weak attempt at making the meal a bit healthier. We ate the veggies with the kare-kare sauce lol.<br><br>I am still dreaming about the lumpia Shanghai and the kare-kare. On my next trip here I'll definitely try the lechon kawali. If you are looking for some fun things to do after, the Half Acre brewery is only a 20-minute walk away.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/xjmhcG1B82EDcu_4lNHExA/348s.jpg", "caption": "kare-kare (beef and oxtail in peanut gravy) - must get"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/WhuPJI3CnPqvh_2JKnH49w/168s.jpg", "caption": "tocino (fried cured pork) - delish"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/UivF-9X9HghWDKOl_ZzOdQ/168s.jpg", "caption": "Guinataang (squash, green beens, and shrimp in coconut milk)"}]}}, {"review": {"des": "This is my go to for Filipino Food in Chicago. The service is good, they have lots of options on the menu and it's BYOB. My favorite dishes are the chicken bbq and the kare kare and daing na Bangus. My only issue is that sometimes, especially with the kare kare, it lacks meat and is more veggie heavy (my personal preference is to have more oxtail)", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/CHtBZyrTbxbvT8WlNBvRjA/348s.jpg", "caption": "Calamari and daing"}]}}, {"review": {"des": "This review applies to delivery only, though based on our order last night, I might actually be willing to dine in. This place is the real deal in terms of authentic Philipino food. The garlic rice alone? That may sound odd to those not in the know, to rave about rice, but if you are in the know, then. You. Know. Worth it all! The barbecued pork was cooked perfectly. A great meal. This was the perfect meal delivered promptly to the house on a night when I had a cold and needed some good home cooking. Looking forward to trying this place again!!", "pics": null}}, {"review": {"des": "Stunning and Thougthful Food <br><br>Isla Pilipina is an absolutely fantastic experience, and one that more people should know about. <br><br>Before I start raving about this restaurant, I first have to shine some spotlight on the almost criminally underrated cuisine of the Philippines. Filipino food absolutely should be more popular, and it is endlessly shocking to me that it is not so.<br><br>In a time where so many Western restaurants are trying to add Asian flair and spice to their food, and vice-versa Filipino cuisine exists are a natural synthesis of the two. The Philippines' colonial history has ensured that their cuisine has a unique fusion of Spanish, American, Filipino, and Japanese influences. This spectacular marriage has created some unbelievable flavors, ones that Isla Pilipina boldly serves. <br><br>Our Longanisa (A Traditional Filipino Sausage) was both sweet and delicious, and was perfectly fried. Our Tocino (A Fried, Cured, Pork Belly) had one of the most crispy skins that I've ever encountered, but was still tender and juicy on the inside. Finally our garlic rice had just the right amount of garlic to be delicious. <br><br>One amazing thing about Isla Pilipina though, was how thoughtful its dishes were. In an age where garnishes are seemingly more about aesthetic than taste, Isla Pilipina stands out as an exception. Our Longanisa was cut with small shavings of leek that served as the perfect compliment to the fattiness of the sausage. Our Tocino was served with a gravy that was a nigh perfect compliment to the crispiness of the exterior. Finally, our garlic rice walked the incredibly fine and narrow line between overpowering and underflavored, having just enough garlic to keep you coming back for more.<br><br>Overall Isla Pilipina serves as a proud and beautiful example to Filipino cuisine. <br><br>Protip: Do NOT kiss anyone after the garlic rice.<br><br>Update: I was back two days later. Still worth it.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/dpiS5EIXYBZaQz7omcxzYA/348s.jpg", "caption": "Tocino"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/dUhJC4aeGMNVmHkHQC_iEg/168s.jpg", "caption": "Garlic Rice"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/kNbapcVTdsecA_WhdGWvDw/168s.jpg", "caption": "Longanisa"}]}}, {"review": {"des": "Visited this place with friends! Had the beef kaldereta and halo halo. The beef was well cooked and well seasoned! The price is definitely worth the quality and for the beef portion, though the rice is on the smaller serving size. The halo halo is bomb! I like the combination of everything. It's got chunks of jackfruit on the bottom + red beans + jelly served with flan and ube ice cream. Would highly recommend getting the ube ice cream too!!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/RgJt7Sq7CSePyxsW0WgSRg/348s.jpg", "caption": "Halo-halo - If you still have space in your stomach, you should totally try this.  It has everything from the dessert menu and more !"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/8mgad6nPUIvYN9oURuvjSg/168s.jpg", "caption": "Beef kaldereta. The dish is so well seasoned, beef is tender and soft. The flavors from the tomato and pepper gravy is amazing !!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/snm-pXaBua3KxPbteSpByQ/168s.jpg", "caption": "Pancit palabok."}]}}, {"review": {"des": "The last time I went here was when the owner fixed the place and was really nice. I was disappointed that they did not keep that ambiance. We ordered ordered the lumpia shanghai, calamari and pancit palabok. The lumpia was very tasty and crunchy and so was the calamari. I love the pancit. It looks different from my usual palabok since they put too much sauce but i really love how it taste. The wait staff were really nice and the service was fast. The food is 5 stars but the place is 3 to 4 stars just because i wouldnt like that the smell sticks to your clothes after you went out of the resto.", "pics": null}}, {"review": {"des": "I love their crackly-crisp lumpia shanghai. Have tried other items on their menu, but that is a must-order every time. So good that I get cravings for them randomly.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/B3meMnjli8whznk_GkbipQ/348s.jpg", "caption": "still crispy even delivered"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Y0pqfVvNsjVAuXqGeoIG5Q/168s.jpg", "caption": "Coconut drink, too sweet"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/c0qM7DjXF2T8PPeeLAad4Q/168s.jpg", "caption": "Bbq"}]}}, {"review": {"des": "Came here as a group of 5 and we all made it family style, ordering a bunch of dishes to try out and sharing along the way.<br><br>Ordered to share:<br>10 pcs lumpia : $4<br>Vegetable eggroll: $6<br>Tocino: $11<br>Crispy Chicken: $10<br>Kare Kare: $16<br>Garlic Rice: $7.<br>Palabok: $12<br>Guinataang Gulay at Hipon: $14<br><br>Lumpia - they gave us like 13 pieces! which worked out since one of the pieces dropped on the floor when they delivered it. Pretty good lumpia and good deal for only $4.<br><br>Tocino was a little too sweet for my liking but they definitely got a lot of flavor on<br><br>The garlic rice was NOT worth getting as there was hardly any garlic flavor :( this was pretty disappointing. <br><br>Everything else was good and a lot of food! I'm glad we went we a bigger group so we could try a little bit of everything. The portions were huge an definitely yummy filipino food that tasted like your friend's mom cooked.", "pics": null}}, {"review": {"des": "I came here on a Saturday for a bday dinner for 8 people. We called ahead and booked a reservation and preordered.<br><br>The mini lumpias are a must. I enjoyed the ox tail, mixed adobo, lechon, filipino sausage, and mussels, and garlic rice... I would pass on the pancit bihon, fried whole fish, and chicken teriyaki. <br><br>All the portions were a good size so be ready to eat. The place is BYOB and is next to a liquor store. It is also nice that they have a parking lot.<br><br>The service was friendly and attentive.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/lb8T0ARVqXqaPeCeLU8RKA/348s.jpg", "caption": "Teriyaki chicken"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/p8UT5egcgOiu7PMaMK5WuQ/168s.jpg", "caption": "Lechon"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/uyT2fg3-8do3C1l-Y-Z9cg/168s.jpg", "caption": "Garlic rice"}]}}, {"review": {"des": "Exotic meal. <br><br>Should call reserve your spot. They are usually packed up. <br><br>Try their garlic rice. Blends well with their curries", "pics": null}}, {"review": {"des": "So I normally don't take the time to write reviews but as an American married to a Pilipina, I've fallen in love with pagkain sa pilipino(pagkain = food). <br><br>Thus I write to advocate for the food that most Americans would love if they only new it existed! So why don't most Americans know about this food that takes elements of Chinese, Spanish, and pan-Asian cuisine and blends it so well that it's become its own authentic first rate cuisine? Because most of the dishes are a bit more labor intensive....so many Pilipina restaurants cut corners and use sub par ingredients which leads to there quick closing.<br><br>Not Isla Pilipina though.....know way! The Kare Kare....Whoa!...was some of the best I had with a peanut broth/sauce that I could put in a mug and drink on the train to work yums!  The Calderta was delicious as well and I would write more but Yelp is limiting the size of reviews! If you are looking to try Pilipina food for the first time this is the place to go!", "pics": null}}, {"review": {"des": "Do you ever just crave halo halo? Well I do! This was a hidden gem I came across near Ravenswood, and the halo halo was perfection. Lots of people seated for dinner, so I will definitely be back for a meal.", "pics": null}}, {"review": {"des": "Ordered delivery via Grub Hub. The Lumpia was very tasty. The Adobo  combo was plentiful, but way too salty. I don't know how they can serve something like that. If I had read more reviews, I would have seen that it was not a choice I should make. I doubt I will order again.", "pics": null}}, {"review": {"des": "Dear Isla Pilipina, <br><br>Thank you for your unwavering commitment to excellence and cleanliness. It has been a pleasure and a privilege sharing The Family Plaza with all of you. Since 2013 I've had the privilege of meeting a majority of you. Each individual staff member at this restaurant is exceptional and unique. Thank you for upbringing Chicago. <br><br>Sincerely, <br>N.B.", "pics": null}}, {"review": {"des": "first time trying filipino food and it was pretty good. had the fried egg roll looking things and the pork belly. really good. fruit juice was also great. nice service", "pics": null}}, {"review": {"des": "This was our first visit to this place it was recommended by our friends . Visiting Chicago for 3 days so might as well try some Filipino food . The food tastes good , the lumpia is perfectly fried and served with great sweet sauce. Great price! It's a good stop before heading to the airport .", "pics": null}}, {"review": {"des": "I asked a friend of mine from the Philippines where I could get the most authentic Fillipino food in Chicago and he pointed me here. I wasn't disappointed.<br><br>Ambiance sometimes first impressions can be wrong I walked into the place which looked very unassuming and wondered if the food will be any good. The style is very basic minimal small tables with a little space between them.<br><br>Staff they were very enthusiastic and helpful. After I told them this was my first visit here they gave me a run down on what is popular what would be considered traditional Fillipino dishes on the menu.<br><br>Food everything I had I really enjoyed from the perfect Lumpia which was crunchy and paired well with the dipping sauce. Kare Kare which if you are adventurous is a traditional Filipino dish consisting of oxtail in a peanut sauce I know it sounds weird but was a gastronomic delight. It is served with a shrimp brine but add it sparingly. The Kare Kare was the piece de resistance and one of my favorite dishes I have ever had. I will be coming back for more. The Kare Kare was $15 but more than enough to serve 2.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/CGCh9WHn8BCkTGJlfgaC3g/348s.jpg", "caption": "Kare Kare served with Eggplan and green beans so hearty and flavorful"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ijKYHWxlDcAkGl_3HrqQOg/168s.jpg", "caption": "Lumpia was delicious"}]}}, {"review": {"des": "They were out of adobo and lechon kawale!!?? Nooooooooo!!!! They did have fantastic lumpia, and crispy pata! Very good and I can't wait to come back soon.", "pics": null}}, {"review": {"des": "The wait was long, the place crowded & hot, the food oily & salty... But WOW!! AMAZING!!!! <br><br>The food was bursting of flavors and absolutely delicious! It's our first introduction to Philippino food and we love it. Man I wish I knew how good their food was earlier!<br><br>Pork is definitely their specialty, you can't go wrong ordering something that makes pork THE STAR! <br><br>Get in early though as we came at 1pm and the most popular pork knuckles are gone. Guess I just have to return here again! But happily.<br><br>Reservation highly recommended.", "pics": null}}, {"review": {"des": "Super busy and Lichon sold out so I settled for Pata and lumpia. Worth the wait. They're quick on their feet and attentive to service. Great food and service.", "pics": null}}, {"review": {"des": "If you looking for hospitality, this isn't the place. Everything was fine in the beginning, we were here for a friend's birthday, an 11 top, with a reservation. The food was fine, not particularly special, and they were kind enough to split it 3 ways for our large party. I left the restaurant to help the birthday girl put her gifts in the car and went back inside to ask to use the restroom. It was 9:50pm and I think the kitchen stops serving at 10pm. When I asked to use the restroom, they denied me because they said the kitchen was closing and they were cleaning. I was confused by their answer so I asked to use the restroom a second time. They still said no. Our party spent a good amount of money on this establishment and they did not allow a paying customer to use the restroom. I had to drive a couple blocks down and go to the restroom at a gas station. Shame on them.", "pics": null}}, {"review": {"des": "Their lumpiang Shanghai is probably the best lumpia I've tasted in the US. Nice staff, too!", "pics": null}}, {"review": {"des": "AMAZING food!!!! I've never had Filipino food before, but now I'm in love! It's family style, so we were able to order lots of different dishes and pass them around. I highly suggest anything seafood and anything pork. Oh and bonus, the black tea is amazing.", "pics": null}}, {"review": {"des": "I love kare kare, it's always been my favorite Filipino dish. It is so good here, with a rich sauce and plenty of fresh vegetables. I order this often through DoorDash. My kids love the pancit and lumpia Shanghai and my husband loves the BBQ chicken. <br><br>What to get if you're not familiar with Filipino cuisine: BBQ chicken, lechon, pancit bihon, crispy fried chicken with that sweet spaghetti, halo halo <br>For more adventurous eaters: kare kare all day, pinakbet, diniguan<br>What to skip: adobo, sorry but it's way too salty, doesn't look appetizing and definitely not as good as mom's (or even my own)<br><br>I've also ordered catering for parties and they provide lots of food which makes it well worth the cost.", "pics": null}}, {"review": {"des": "At first you would think, is this the Isla Pilipina restaurant everyone is raving about? The place has very limited space. I found it to be the typical \"carinderia\" as would it be in Manila. But this Chicago , Pinoy restaurant certainly attracts people.  The interior design is simple. Accentuated by some Philippine inspired wall arts or symbols, which I find quite nice. It added character to the place.<br><br>Now, let's go to the food. My friends and I ordered Sinigang na Baboy, which was really good. Though I wish there is more soup to it.we also ordered Kare-Kare Beef, which was also good. Lastly the Krispy Pata which really is the literal Crispylicious! I say that these food we've ordered are really good, very close to the taste and flavor I've grew up with. <br><br>Try to eat at this place, experience authentic Filipino cuisine only found here in Chicago!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Tx209xDWBx1wgyx-ZE7hVw/348s.jpg", "caption": "Krispy Pata"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/y4s2e-lUO8ISgyqzgwGcKg/168s.jpg", "caption": "Rice pa-more"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/sx4is3c3pd6u4JuLYHQ-8w/168s.jpg", "caption": "Sinigang na Baboy"}]}}, {"review": {"des": "I have never in my life wanted pork knuckles, but that's what we had. Very crunchy with a ton of flavor, something I was not expecting. I enjoyed everything we had including the service. We had Pancit, and lumpia and we were stuffed and had a ton left over for lunch the next day. Huge portions, tons of flavor, friendly service and we didn't have to ask questions about the menu because everything was explained in detail, calls for 5 star rating.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/-etRuVgQ_cFbp6h6HLcddg/168s.jpg", "caption": "Even though this place is a bit on the tiny side, the food they serve has huge flavor. Everything was delicious and finger licking good."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/z1CDGakj6NCCk3S582rUUQ/168s.jpg", "caption": "Unfortunately, these photos are after we had to have a bite."}]}}, {"review": {"des": "Thanks to Door Dash and a free delivery promo code until Sunday, I finally ordered from Isla and I'm so upset with myself that I haven't been sooner!<br><br>Despite eating probably a whole lechon on Sunday, I can never get enough Filipino food. So we ordered the adobo, lumpia shanghai, and longanisa. The lumpia was crispy and delicious. The longanisa was juicy, flavorful, and just enough sweetness. And the adobo was sooo goood with all the meat being so tender that, in true Filipino fashion, I didn't need a knife. <br><br>The only reason why I'm taking off a star is because rice wasn't included in the delivery though on the regular menu it is. I know that's petty of me, but damn that adobo sauce would taste amazing on some white rice. Can't wait to come back for sisig and pancit!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/qtEsft6ly0nlkv3ifJ10KA/348s.jpg", "caption": "Adobo, longanisa, and lumpia shanghai :)"}]}}, {"review": {"des": "Finally checked out this gem located in a dumpy strip of stores. <br>Their food is so yummy such as lumpia and all of their noodle dishes. <br>Very unique and great tasting food", "pics": null}}, {"review": {"des": "I could eat pancit canton forever. It's like a less greasy chow mein, and isla pilipina sure does it right!<br><br>2 tips: 1) make a reservation, 2) BYOB.<br><br>Friendly service, but not the biggest restaurant so plan accordingly. I could see groups 6+ having a hard time eating here.<br><br>prices are reasonable. My go tos: bbq pork, mixed adobo, pancit canton, lumpia shanghai, and the fried pork knuckle. I make a point to go out to here at least once a month.<br><br>Parking is easy and there's a liquor store next door.", "pics": null}}, {"review": {"des": "I was introduced to this place via a yelp Summeriest party back in 2009 and I always said Im gonna have to try this place as I liked what I tasted and their menu was quite interesting. I have come here since then multiple times with different groups of people and everyone seems to love it! Its a small mom and pop joint thats BYOB (liquor store is next door) and has awesome Filipino dishes. <br><br>Starting out with Lumpia is a must...they are basically delicious little egg rolls that you can't stop eating. It comes with a very good sweet and sour sauce. The crispy chicken that comes with banana ketchup is really good and a very nice portion. The mixed adobo which is chicken and pork marinated in a sauce that includes garlic, vinegar and peppercorn...meat heaven and very good! The Inihaw Pork is simply amazing as its basically tender strips of grilled pork served with a vinaigrette thats pretty good. Definitely one of my favorite places in the city.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/v9RKmrysPRykz8vfrEwSdw/348s.jpg", "caption": "Inihaw Pork"}]}}, {"review": {"des": "This is literally my favorite Filipino restaurant in Chicago. The food is very very delicious and the service is amazing. I just became a loyal customer and it's my first time eating here.", "pics": null}}, {"review": {"des": "Stopped by on a Sunday afternoon and the place was definitely busy!  There was a tiny wait for our group of 4 but if you have any more than that I'd recommend making reservations.<br><br>The food was delicious, service was super friendly but a little slow (it seemed like she was handling the whole restaurant!).  We ordered the Lumpia, Mixed Adobo, Beef Steak, and Pancit Canton.  Prices were reasonable for the amount of food you get and the flavors were excellent.  I haven't had much Filipino food so I can't say how authentic it was but it sure tasted good!  I definitely want to come back to try some of their desserts too!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/TWYVlOZdGltmfDIQHIFAdA/168s.jpg", "caption": "Beef steak"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/xUTTpHvleOW7Ns7R1Qcq-w/168s.jpg", "caption": "Pancit canton"}]}}, {"review": {"des": "Absolute DEELICIOUS Filipino food. Reservations are highly recommended by the restaurant, as the place doesn't sit that many people and was packed when I went on a Thursday night for dinner. A down-to-earth, cozy place with friendly service. Between the three of us, we shared the following dishes:<br><br>- Pork BBQ  (appetizer) <br>- Pancit palabok (egg noodle dish with scrambled eggs, calamari and tofu sauce)<br>- Sizzling sisig (miscellaneous pork bits served on a sizzling platter)<br>- Mixed Adobo (chicken and pork marinated in a special garlic sauce) <br>- Garlic fried rice (jasmine rice pan fried with garlic) <br>- Halo halo (dessert; a medley of shaved ice, ube ice cream, and fruit and beans preserves) <br>- Leche flan (rice and milk custard pudding) <br><br>Yes, it was a lot of food for 3 girls but no regrets. The highlights are definitely the pancit palabok, sizzling sisig and garlic fried rice. Bold and generous flavors, and big portions. The garlic fried rice is aromatic and bursting with garlic freshness; the pancit palabok is a delicious mess of noodles mixed with moist, stew-like tofu sauce and crispy calamari; the sizzling sisig is literally sizzling with the fat from all the pork bits that give the dish its unforgettable flavors. <br><br>That being said, this is not a meal for the faint-hearted. But greasy food = best food (well, once in a while at least). The only dish that didn't quite deliver is the mixed adobo; it is overly salted and tastes meh overall. Both my friends are Filipino and they approve of the taste and authenticity of the food overall. <br><br>TL;DR Authentic comfort food cannot get better than this!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/4w0c1zca-lnaqymkGbk-fw/168s.jpg", "caption": "Sizzling sisig (top left), garlic fried rice (top right), pancit palabok (bottom right)"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/sMysi8eA7TYqJemxaVvKPQ/168s.jpg", "caption": "Halo halo"}]}}, {"review": {"des": "My feelings are mixed about this place. Can't say I love it or hate it, but I do order from there a lot when I am craving Filipino food and too lazy to cook. I guess you would say I'm just in between. <br><br>Pros: love their bangus, lechon, lumpia Shanghai, and a few other dishes (nilaga, pinakbet, sinigang), and especially their halo-halo. I also love that they deliver through Grubhub, their decoration is cute, and that they poke holes in their to-go boxes to keep the crispy foods crispy.<br><br>Cons: the place is small, the food is pricey, they are stingy with their rice, and the dinuguan is nowhere close to tasting like dinuguan. <br><br>Overall, I would say Isla is okay... the majority of their food is good, but not really an ideal place if you want to take a big group.", "pics": null}}, {"review": {"des": "It was busy on a Thursday night. Thought it'd be a real ethnic restaurant but there were a good combo of Filipinos & non-Filipinos dining there. Tried this place w a Filipino friend about 4 years ago and was looking forward to returning after seeing many photos of food on Yelp. It's a very casual restaurant but has the potential to be a romantic restaurant. Didn't get the vibe that people dining were on dates; they were all groups of friends. Servers are really nice & even had allergen information for the food. Don't let the walkway to the bathroom scare you! You literally walk through the kitchen and get a 1st look at what happens in the kitchen. I also saw a pot of oil that they probably deep fry food and never throw the oil out, but only refill. It's brown in color. I mean, that's what probably makes it taste good, right(?) I am no inspector; just making my assumptions here.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ZhfzbZDQ8HzJkzbwhQlbhA/348s.jpg", "caption": "Crispy Pata (already ate a piece)"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/HtFcvzImVUUhceMxDWhrbg/168s.jpg", "caption": "Crispy pusit (calamari)"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/h7OfUi6qKAWbm_uA35kiTQ/168s.jpg", "caption": "Pork BBQ"}]}}, {"review": {"des": "Best place for Filipino food period!  It's always worth the drive to get my Filipino food fix at Isla.  The quality of the food is always top notch; I don't think I've ever had a bad dish here and at times better than homemade (sorry Dad, bro and sistahs!).<br><br>Isla is located on Lawrence in a small strip mall; it's really small and most of the times you will have to wait as it's always crowded.  I love the vibe of the place; it's hip and always has cool artwork from local artists.  They always play great music, today it was 80's alternative, oh yeah!! I LOVE the staff here;  they are always friendly, fun and very accommodating.  Another thing I love, it's BYOB! <br><br>Below are my favorite dishes; but keep in mind they do all Filipino dishes well here!<br><br>-Lumpia egg rolls, believe the hype about these yummies; they are that good.  20 pieces go fast!<br><br>-Pinakbet, my favorite Filipino dish and they make the closest version of my Dad's. It's a dish with squash, string beans, bitter melon, eggplant,shrimp paste and pork. This dish is like home for me :)<br><br>-Sinigang: Sour tamarind soup with veggies; we always choose the milkfish-so comforting on a cold day!<br><br>-Bangus: Fried boneless milkfish; always so good<br><br>-Bicol Express: New discovery for me!  My parents never liked coconut milk in their food so I was deprived this awesome dish growing up!  This a slightly spicy dish with shrimp, squid, meat, mussels cooked with coconut milk.<br><br>-Lechon Kawali: Fried pork belly with special gravy for dipping, everyone's favorite!<br><br>-Halo Halo:  Have to finish my meal with this classic Filipino dessert!  Purple ube ice cream with shaved ice, flan, jelly coconut pieces, jackfruit.  Mix mix and it is the perfect ending for a Filipino meal!<br><br>The downside to Isla is the small space and the bathroom situation is odd as you have to walk through the kitchen to get to their one bathroom.  Don't let that stop you though; the food is that good!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/dIwRgnyJRrnbJTGZspkOEw/348s.jpg", "caption": "BBQ Pork Appetizer"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/cDyWIg5Z4aiMDzYeqY6xWg/168s.jpg", "caption": "Halo Halo"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/-DmJUQYC04sFnegVBCgy2Q/168s.jpg", "caption": "Shanghai Fried Rice"}]}}, {"review": {"des": "This is the second time I am eating here.  I love the service, the staff was friendly and pleasant...The food was delicious served hot and full of flavor. We had Lumpia Shanghai, Pancit Bihon, and Lechon Kawali.  Overall, enjoy our lunch...", "pics": null}}, {"review": {"des": "You must get the Lechon! I had a great experience here and all the food was very tasty. I would say that you have to they the Lechon, by far the best thing that we tried. It is also BYOB with is nice.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/hlcixwQFgJKioTT9OpibOQ/348s.jpg", "caption": "Lechon. MUST GET"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Io629KytvDmFyv3NejJ3Tw/168s.jpg", "caption": "Bicol Express"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/D-F8gC41tg3yyhLOARwD5g/168s.jpg", "caption": "Halo Halo!"}]}}, {"review": {"des": "This is the only Filipino food I've ever really had, but DAMN is it good.<br><br>The Lumpia Shanghai appetizer ($6 for 20) is basically the Filipino version of an eggroll. These mini rolls are filled with pork, egg, chopped veggies and soy sauce. They're then deep fried and served with an irresistible sweet & sour sauce.<br><br>The Pancit Bihon ($9) is one of the most authentic Filipino entrees out there. It's rather simple, just chicken and shredded veggies sauteed with pan fried rice noodles. However, it's hearty and also makes for awesome leftovers the next day if you add in extra vegetables or an egg.<br><br>\"An unmistakable Filipino delicacy\", Mixed Adobo ($9) drowns chicken and pork chunks in a garlic vinegar sauce infused with black peppercorns.<br><br>Check out my blog Cat the Critic! <a href=\"/redir?url=https%3A%2F%2Fcatthecritic.wordpress.com%2F2017%2F08%2F07%2Fdrive-me-crazy-3-places-worth-the-drive%2F&s=c3d56e98a40175103c361b29f2400820dad633df30d2d64ab13f5d64bbd57048\" target=\"_blank\" rel=\"nofollow\">catthecritic.wordpress.c…</a>", "pics": null}}, {"review": {"des": "Been here a few times when I am in the area ..and is the only place I go for Philippine food ..taste wonderful", "pics": null}}, {"review": {"des": "I love Isla from the bottom of my heart. The lumpia is to die for. The chicken adobo, grilled veggies, ube ice cream and mango juice are musts. The service is always great here!<br><br>I go here every two weeks...and I'm broke.", "pics": null}}, {"review": {"des": "Food is good and pretty affordable; most dishes are between $9-14 and are definitely filling for one(with leftovers), possibly splittable for smaller eaters. It should be no surprise that it benefits from family style eating so you can order a few different bbq meats and stews and pass everything to and fro. Filipino food is sort of like the soul food of asia; it's generally inexpensive and serves hearty and usually unhealthy dishes in large portions, and to that end you will get what you ask for here. Tocino, Longanisa, Tapa were hits. Adobo a bit vinegary for my tastes. Unfortunately sometimes they'll be out of some of their popular dishes, but if you're lucky you can get your pick. The restaurant is clean and service is nice, and they have a parking lot so if you have a car then dining in is easy.", "pics": null}}, {"review": {"des": "This is my first time coming here. I like their food very unique and tasty. We order different dishes to share. Chicken, pork, egg rolls, and pancake. I forgot to take the picture of the dishes but I would say very delicious. There is a parking lot for people to park but very limited.", "pics": null}}, {"review": {"des": "A great Filipino restaurant that is BYOB.  Get here early as they get busy or call ahead for pickup.  It's well worth the wait.", "pics": null}}, {"review": {"des": "I'm in town for 6 weeks from DC and had to get my Filipino food fix.  Google lead me here today and I loved it!  Very unassuming spot in a strip mall, but home cooking all the way.  The lumpia was crispy, and I ordered Kare Kare, my all time favorite since I was a kid, and it was perfect!  Huge portions, meaty oxtails, and of course the bagoong.  Super friendly service, and everything on the menu you could ever want.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/1fWBWLxQeY56QH9DpUFE0A/168s.jpg", "caption": "Crispy lumpia"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/uz4jwkmHyXKKDLO-gM9CZA/168s.jpg", "caption": "Kare Kare"}]}}, {"review": {"des": "I was the lone sistah holdout who has not been to Isla.  Well, today I joined the fold.  In my defense, 709 miles separates me from being a regular. <br><br>It's sad that distance prevents me from being a regular here.  Eating here is like coming home to my best childhood memories of Filipino weekend parties.  The same type of dishes served back then are served here at Isla. <br><br>Lumpia, dinuguan, pancit and adobo are really well made here.  The lumpia is crunchy but not too oily, the dinuguan although slightly different than what we had as children still has the basic ingredients of what we fondly called chocolate meat soup.  The Pangasinan version just had freshly chopped chili and had more tripe than pork meat. The daing bangus is nicely done and very delicious.  The fish fat just begs to be dipped in the garlic vinegar sau-sau sauce.  And last but not least the Filipino version of pork belly, Lechon Kawali, is hands down the best in the world.   In my opinion, if you don't get slightly dizzy when biting into the crunchy skin fat goodness,it is not worth your while. If you are not into this nirvana like experience just dip the lechon Kawali in either their version of sarsa sauce or again the ubiquitous garlic and vinegar. Either will do the trick to tame the greasy artery clogging goodness. <br><br>The staff at Isla are attentive and are knowledgeable about every single dish that they serve.  If you can, try to come during the weekday when they are less crowded.  Based on my sistahs long time experience, you will experience long wait on the weekends.  Isla is very popular with both the Filipino and non-Filipino patrons.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/eEn-3R9DgNPfGToCcVaz_g/348s.jpg", "caption": "Perfect ending to a perfect meal.  Halo Halo heaven"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Nn4r_rMssg9rjYJbLieVEA/168s.jpg", "caption": "Husbands ultimate favorite-Crispy Pata."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/v3Gnk_QbAwsAub6BQqcVPQ/168s.jpg", "caption": "Dinuuguan. My favorite Flip dish"}]}}, {"review": {"des": "Overall: Cheap, hearty, and tasty Filipino that leaves an overall great impression and feel-good vibes.<br><br>The good: A lot of different items to choose from, with pork, pork, and more pork. The fried rice was da bomb, as was the BBQ chicken (which was surprising, I was expecting boring-ness), and surprisngly the Loganisa. Cheap items overall, and the portion sizes are hearty. Service was very friendly and helpful. BYOB. Great music and cool wall art.<br><br>The bad: Two of the entrees we wanted were out, on a Wed night at 7 PM. The order that the entrees came out was sporadic and slow at times. Some of the items were disappointing, such as the lechon and lumpia. Pretty small place (plus kitchen bathroom).<br><br>Atmosphere: 7.5/10<br>Service: 7.5/10<br>Food: 8/10", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/aD5VwEqaOjTaPP_X1lLDJQ/348s.jpg", "caption": "Loganisa"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ddyET4E64Nc1mrYMAikxFw/168s.jpg", "caption": "Grilled Veggies"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/fiaDi_6l_DlaNVrb-S2mUg/168s.jpg", "caption": "Lechon Kawali"}]}}, {"review": {"des": "First Filipino spot I've been to out in Chicago with quite the extensive selection of some favorite dishes that will make you miss home. They offer everything from lumpia to bbq to lechon to kare kare to pancit to dinuguan... Whatever Filipino dish you're looking for, you'll find it here. My only regret was I wasn't too hungry and only was able to eat a little bit when I came by here.<br><br>I had the Crispy pusit (calamari) ~ super generous portion and delicious with the garlic vinegar sauce, the Pancit canton ~ yummy & just as good as mom's cooking, and the Beef kaldereta ~ overall pretty good and meat was nice and tender but still prefer my dad's. Their portions are pretty generous so I definitely had a bunch to take home. Even though this place is a trek from me, definitely would not mind renting a car to drive out here and come back again. <br><br>This spot sits in a strip mall with it's own lot, and when we pulled in and there happened to be a spot right in front. I could imagine it being a hassle to find parking as it's not the biggest parking lot. I have to say the staff here was super friendly and service was great. Oh yeah, this was a first for me, a BYOB Filipino spot. Now if only they had a karaoke machine here, this place would be too lit.<br><br>'Til next time, cheers!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/IiGMP6-T0eWoztZI9wa__g/348s.jpg", "caption": "Pancit canton"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/9gwdfLnR6E0OzFzfcMR5Ag/168s.jpg", "caption": "Crispy pusit"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/xQi4HsIo5q0UnXqMoHrZKg/168s.jpg", "caption": "Beef caldereta"}]}}, {"review": {"des": "Authentic Pilipino food . We even ate with forks and spoons! Which I miss doing ! Family portions and was so yummy! Must try if you are a Pilipino food fan or fan of food!", "pics": null}}, {"review": {"des": "I brought a couple of friends here last night for a celebration dinner and it could not have been more delicious! First of all, finding a BYOB that also has incredible food is not easy in Chicago, so here's one to add to your list.<br>We started off with a 20 piece Lumpia, which were scarfed down in record time. They are perfectly crispy and wonderful. Our entrees consisted of the Sweet & Sour Red Snapper (divine), Guinataang Gulay at Hipon (sublime), Crispy Chicken (YUM), and Tocino (TDF pork belly). The 3 of us ate until we couldn't eat any more and the bill was less than $65 before tip.<br>I highly recommend making a reservation if you plan to go. It's a small space located in an easily overlooked strip plaza, but there was already a line forming by the time we were seated at 7pm.", "pics": null}}, {"review": {"des": "It was my first time trying Filipino food, and it was quite enjoyable.  We had a large group that took up a good portion of the restaurant (it's not that large to begin with), but the staff was very accommodating.<br><br>We got some apps to share, and each person ordered an entree and we passed around so everyone could try a bit of each.  I'm not going to attempt to list everything we tried, but we did have a little bit of everything it seemed.  Some dishes were better than others, but none were bad and everything seemed prepared well.  Dessert was good, too, and very different from normal fare (purple yam ice cream?!).<br><br>It's BYOB, and there's a liquor store next door that's convenient for that.  The servers were very helpful in explaining what different dishes were and making recommendations since we were all Filipino food newbies.<br><br>The couple downsides were that the restaurant is small and the bathroom isn't very accessible (in/through the kitchen).  The entrees for our table came out very scattered (minor issue since we had a large group, and since we were sharing plates it worked out alright).  <br><br>The food, while not particularly outstanding, was very enjoyable. I'd go back to try some things again.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/mKmIF0tboxNw8CxFIxAaNA/168s.jpg", "caption": "Spaghetti Delight (yes it comes with fried chicken)"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/koiIOetsHK9ouxZvAx0-VA/168s.jpg", "caption": "Purple yam ice cream (don't remember actual name)"}]}}, {"review": {"des": "Food was really good.  Lumpia was on the greasy side so don't plan on scarfing a ton down. I was told they had great lunch specials; maybe that was in the past because they no longer have any. Prices are still very reasonable however.", "pics": null}}, {"review": {"des": "+ Byob<br>++ liquor store next door<br><br>There is no such thing as a \"Filipino Comfort Food Dish\" because Filipino Food IS comfort food. :) Expect food that are mostly porky, sweet, fried, heavy, saucy, and flavorful (thus the mandatory side of rice.) In my experience, this resto tends to tone down on the fattiness/oiliness and thus keeping freshness and quality - this is why I count it as the best here in Chicago/Chicagoland - my Filipino and non-Filipino friends agree. <br><br>If you are new to Filipino food, I would like to recommend the following as a guide:<br><br>*= always order no matter what! :)<br><br>Beginner:<br>Lumpiang Shanghai*<br>Lechon Kawali* (this or the Crispy Pata)<br>Chicken Teriyaki (not Filipino, but unique take)<br>Ginataan Gulay<br>Inihaw na baboy (don't skimp on the vinegar)<br>Adobo<br>Ube Ice Cream<br><br>My Personal Recommendation:<br>Crispy Pata * (call ahead if they have it)<br>Sisig * (matches well w/ beer)<br>Sinigang<br>Bicol Express<br>Sweet and Sour Snapper<br><br>Unique Flavors:<br>Dinuguan (not all would like this)<br>Kare-kare * (Eat w/ shrimp paste in miniscule amounts and rice)<br>Pansit Palabok * <br>Spaghetti (filipino-style has a sweet, different take)<br>Pinakbet<br>Halo-halo<br><br>Note: Food portions are always for sharing. Most, if not all dishes (non-noodle/soup based) come with a cup of rice. Spoon and fork combo makes eating a lot easier. Pour some sauce on your rice and experience the magic. :)<br><br>Call ahead and try to reserve if you are going on busy hours - it's a fairly small place that pack a punch! Share the secret about how good this place is, but not too much -- I still want to eat here and not wait for too long :) Enjoy!", "pics": null}}, {"review": {"des": "I consider this spot a bit pricey for Filipino food because our food is definitely cheap, but I think it's worth! Especially if you haven't had it before <br><br>So far I've had their:<br>- Lumpia <br>- Kaldareta (so tender, must try)<br>- Kare kare (also tender and flavorful! It's scary to non Filipinos because it has peanut butter. But TRUST ME. GET IT)<br>- Shrimp sinigang (sour and delicious)<br>- beef steak  (basic but tasty)<br>- Bicol express (something my parents get, pretty good)<br>- BBQ pork (basic but tasty)<br>- Spaghetti (comes with fried chicken)<br>- halo halo!!! (This is the dessert, try!)<br><br>Trust me. Get any of the above and u will not regret it. DONT BE AFRAID TO TRY NEW \"WEIRD\" FOOD, it's my favorite part of life", "pics": null}}, {"review": {"des": "LUMPIA! When I miss home and need some comfort food. This is my go-to. :) <br><br>My office isn't too far from here so we order in quite a bit. Tonight my husband, cousins and I ate at the restaurant for the first time. <br><br>Definitely order Lumpia to start. Go ahead and get the 20 piece. It is only $2 more and well worth it. We ate family style and boy did we order too much food. We ordered garlic rice, tapa, lechon kawali, pork BBQ, pancit bihon, and adobo.  Pork BBQ is awesome!!!!! <br><br>The adobo was a bit salty and the tapa was almost too much to tackle (I guess that's not a problem) <br><br>My mom is such a great cook and I know that nothing will satisfy my Filipino food cravings like her cooking, but this is really high up there. <br><br>The restaurant is kinda small, so make a reservation if you want to eat here. Or.. Take puris always a great option! <br><br>Ps. This place is BYOB. :)", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/e0XEyr7blj9TozkEBsOm3w/168s.jpg", "caption": "Tapa :)"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/LFGEH5ap_R2CrIMzqEr0-w/168s.jpg", "caption": "Pork BBQ!"}]}}, {"review": {"des": "This was my first time with Filipino food outside of Jolibee. I actually liked it! My whole table shared our plates by passing around! The lumpia was the highlight. I actually disliked the spaghetti, but I think that might be on me! There were plenty of other dishes to try! <br><br>The problem that I had was that they told me that they didn't want anybody to go  into their restroom because they just cleaned it. They made me go next door into the liquor store and had the uncomfortable conversation with the shopkeeper in there about using their restroom.", "pics": null}}, {"review": {"des": "My boyfriend and I love this place. We came in a few days ago for a late lunch/ early dinner on a weekday and ordered the Kare Kare, Chicken BBQ, and halo-halo. I thought their portions were meant for one but no, it's family serving size --which is great because you get a lot for the price! <br><br>However one problem we had was that the Kare Kare only had two pieces of meat in it and just mostly vegetables so it just wasn't satisfying for us<br><br>The chicken bbq was amazing though!!! <br><br>Overall, the servers and their service were good, they were very nice and personable and quick when we needed something. The atmosphere is relaxing and chill. We enjoyed the food so much that we wanted to go back the following day.", "pics": null}}, {"review": {"des": "My family and I were very excited to go to this place because of the good reviews they have online. However, we were greeted poorly upon entering the restaurant - no 'hi' or 'hello' which I understand since it's very casual restaurant (also observed sticky floors, dirty tables, dirty kitchen, and awkward bathroom location). This place has bad customer service and waiters have a bad attitude. I don't care how 'good' their food is but we won't be coming back here again.", "pics": null}}, {"review": {"des": "I like it. Its fry rice, pork Bbq are good. Definitely will love to come here again soon", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/nVujrw1CtaT3T53mE96djw/168s.jpg", "caption": "Very nice like these a lot"}]}}, {"review": {"des": "Went to this small little storefront restaurant in a strip mall on a Sunday around 12:30. Very tiny, but cute. They have about 7 tables. Ordered the vegetable egg rolls, the garlic rice, and beef caldereta. Everything was pretty good. My only complaint would be the beef. Although some pieces were very tender and just as I expected. The larger pieces were not. Taking the leftovers home to slow cook a bit longer. Service was fast and friendly. Will definitely come back to try the milk fish.", "pics": null}}, {"review": {"des": "Place is amazing! The serves is good! and the food is great! If you are coming in on a weekend. The place get pack fast. So hope you get reservation ahead of time.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/aRWL5V_1iv5MWfPjb0LIsQ/348s.jpg", "caption": "Lumpia Shanghai"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/1cWBHhkYmHMEjUkymn4wsg/168s.jpg", "caption": "Crispy Pata"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/XuYMEhaa4-MnGX0DGvJVCw/168s.jpg", "caption": "Singigang Baka (beef)"}]}}, {"review": {"des": "After a coworker asked me to name some of the types of food I had tried she mentioned food from the Philippines and lo and behold... It was one of the few I had never tried. I immediately asked for suggestions about things to try, and came straight to Yelp afterwards to figure out where to get it! Yelp led me to two maim places that everyone seemed to rave about.. Ruby's and Island Pilipina! It was a close race, but the pictures here won me over! <br>Fast forward to the actual experience.... It was a suuuuper snowy night, but I was determined to make it here to see what food from the Philippines was all about. I walked in and was immediately greeted by several staff eager to find a seat for me. The place was pretty crowded as there we're only two tables left and everyone seemed to be loving their food and generally enjoying themselves. So I look at the menu, see the items I was recommended, and start ordering!<br>Within minutes the first dish was out! Lumpia Shanghai(think crispy mini egg rolls filled with deliciousness). I was obsessed! Literally could NOT stop eating them, and they seemed to be magically refilling themselves after I would take one. Maybe 5 or 10 minutes later the next dish was out and boy did it look good! I ordered the Chicken Adobo which came with white rice. They gave very generous portions and the rice seemed to be cooked perfectly! I mixed the two together and they nicely balanced each other. At first I thought the chicken adobo was a little salty, but the white rice toned it down nicely and made for a good meal. After that, the final dish came out... The monster... The Crispy Pata! This thing was HUGE! A giant deep fried pork knuckle with lots of crispy goodness. Having already eaten basically half of the restaurant I decided to slow down and just taste a little(plus I wanted to leave room for dessert). The pata was nice and crispy like expected, but to me could've used a little more flavor. It was also kind of fatty which is perfectly fine with me, but could be a turn off for others! <br>So the time had come where the waitress asked the famous question \"Did you leave any room for dessert? \". Now I normally say no, but having seen the pictures on Yelp I was determined to try at least one. I ordered the Halo Halo and eagerly waited for them to bring it out. It consisted of a purple yam ice cream, maraschino(ck spelling) cherry, shaved ice, leche flan, sweet beans, condensed milk and maybe a few other things. I tried everything individually first and then mixed it all together to make it like a smoothie. I will say that it definitely had a unique but good taste! <br>Overall I had a great experience here, and I would go back to try some other items. The wait staff were super attentive and didn't mind assisting other tables which I thought was nice. Prices were reasonable and portions were plentiful which is always a plus for me! So get out and try some food from the Philippines haha", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/aw04ZKpck_u7Y0wd2b94MA/348s.jpg", "caption": "Crispy Pata"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ofgwFofwwxQ1HtNsp-wtyA/168s.jpg", "caption": "Chicken Adobo"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/9-iw_EecKBSqk5I3s-AmiA/168s.jpg", "caption": "Halo Halo"}]}}, {"review": {"des": "This is the best place in the city for Filipino grub. It is a bit far out there but trust me, the trip is worth it. The calamari appetizer is a good size portion to start. Also the lechon kawali and longanisa are my favorites. Service is always prompt and friendly.<br>It is also byob!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ebHDAiIts-yRD5JStUQi4Q/348s.jpg", "caption": "Lumpia shanghai"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/WULdacTVZBWLSfsGPF6zwQ/168s.jpg", "caption": "Beef tapa"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/r7gFv9HPS5rXfxFHBBPmDg/168s.jpg", "caption": "Crispy Pata"}]}}, {"review": {"des": "So amazing! Try the Halo-Halo, it was an ice cream lover's dream! <br>The eggplant tower was really tasty too~ I love everything about this place!", "pics": null}}, {"review": {"des": "This place is exactly what you want when you are in the mood for Filipino food. It's delicious, good portions, friendly staff and has parking. On my first visit I ordered the garlic rice, BBQ pork, mixed adobo and lumpia. I was not disappointed by anything! It was all sooooo good. I'm looking forward to my next visit.", "pics": null}}, {"review": {"des": "Excellent food, service and experience.  Top quality all around.  We had the small egg rolls, an amazing seafood and a beef dish, everything just perfect.<br><br>Located in a little strip mall so convenient parking and right next to a liquor store with a very serious beer selection for the BYOB aspect of the restaurant", "pics": null}}, {"review": {"des": "This was my first time eating Filipino food, and this restaurant seemed like the start of a great new friendship. <br><br>We ordered a ton of food for our group - started with the lumpia and pork bbq which were really good. <br><br>Some other highlights - the Longanisa was a standard sausage dish. My favorite dish was the Bicol express - a combination of meat, shrimp and squid coconut milk that was really flavorful.  We also tried the Kare-Kare: a beef oxtail in peanut sauce, which drew mixed opinions from the peanut gallery (ha!). The peanut sauce was more savory than the typical type you might get at a Thai restaurant.<br><br>Our waiter, Laki, was super attentive and excited to introduce us to Filipino food - for most of us, this was our first experience. We also told him that our group is trying a variety of different ethnic cuisines - and he promptly told us some of his favorite restaurants in the city, which I will definitely check out! One thing that kinda irked me though was he let us order way too much - we had probably 3 huge plates full of rice, and 2 full plates of meat dishes left over after the meal. And we are not picky or light eaters either. Sometimes you need your waiter to tell you when you've ordered too much, you know? <br><br>If you're in the area and looking for great Filipino food, check this place out!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/KmgJvYDtOnnJgUQPN4mhYA/348s.jpg", "caption": "The aftermath"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/vBvPv4sbmE-NXSKeLl6uhQ/168s.jpg", "caption": "Longanisa"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/JYcKG6z1yTfCRe1MHNzuzQ/168s.jpg", "caption": "Lumpia"}]}}, {"review": {"des": "Love the Kare Kare, Filipino spaghetti is great with the chicken. Just wish the bathroom accommodations were little more customer friendly", "pics": null}}, {"review": {"des": "Walking home on spur of the moment I decided to check out Isla Philipa. <br>Greeted as soon as I walk in.  Always a nice feeling. <br>Menu was full of good looking and sure good tasting items. But for some reason the Grilled vegetables caught my eye. Key word: GRILLED. <br>Nice char, crispy yet soft.  Did not come close to finishing. <br>Plus...always room for dessert.  Flan. Soft, dense yet light. <br>Will definitely stop by again.", "pics": null}}, {"review": {"des": "Ordered delivery from Isla. DoorDash extended the delivery time beyond the original time, app said it was delivered when it wasn't, the food arrived cold...like some parts frozen. And the restaurant had things in my bag that I didn't order at all. Also cold. And the one part I wanted cold, the drinks, were missing.", "pics": null}}, {"review": {"des": "Came here with a large group, and boy was I glad I did, because I got to sample most of the great dishes here.<br><br>Started with the Lumpia Shanghai, which I dont have to tell you is incredible - there might not be a finer thing in the world to eat than lumpia and Isla makes some of the best. <br><br>Then tried the Tapa, the Chicken BBQ, the Garlic rice, the Tocino, the Kare-Kare, the Bicol Express, Pancit and Inihaw Pork.  I dont even know which one was the best - I would get a sample of one, declare it my favorite, and then get another sample of something else and it would be better. So basically, just close your eyes and point to the menu - whatever you land on is going to be a winner.", "pics": null}}, {"review": {"des": "Absolutely delicious Filipino food. My favorites: lumpia Shanghai, pancit palabok, daing na bangus, beef steak Tagalog,  mixed adobo and the garlic rice. The entrees are meant for sharing, but in my husband's case, he can eat the whole serving of beef steak Tagalog. Me as well. This is one of the best Filipino restaurants to go to.", "pics": null}}, {"review": {"des": "This review is for catering services 6/7/17.<br><br>I inquired about food options back in May. I requested to see pictures of the trays before deciding to go with half or full tray orders for a party of 30. Email and communication was prompt. Invoice and paying was an easy process. <br><br>On the day of delivery. The food was late by 25 minutes. I kept calling because at this point our guests had arrived. I spoke to Shelia and she apologized for the inconvenience and informed me the driver from door dash lost his way and went in the opposite direction. She ended up refunding the delivery fee which we appreciated as customers.<br><br>Anyway, on to the food. Everything we ordered was fresh,hot, and super delicious. All of our guests loved the food. We're glad we decided to go outside of the box and order something different. <br><br>Thanks, Isla Pilipina for the great food and customer service. We will be ordering again from you.", "pics": null}}, {"review": {"des": "I liked them. The lumpia was really good and we didn't have to wait that long for our food once seated. The food was fairly priced (about $8-10 a plate), and you will definitely be bringing home extra. It was also a mixed crowd when we went in. The only thing I wasn't thrilled about was the 10-15 wait (it was a Saturday afternoon we went in) and the limited space. Wish they expand in the future or move to a more spacious location.", "pics": null}}, {"review": {"des": "Incredible food, great service, authentic flavors! The prices are totally reasonable, and the portions are quite large.", "pics": null}}, {"review": {"des": "The folks working here couldn't be nicer; interactive, friendly.  Food was good, albeit a bit rich; however, was surprised how we were served.  after the appetizer, my daughter-in-law got her meal; then 13 minutes later, my husband's dish was served; 15 minutes later they brought mine out and we had to remind them about my son's meal which came out 22 minutes after mine (think they forgot to place that order and they did comp us the meal which was very gracious).  <br><br>we are water drinkers and it was like getting blood from a rock to get any ice with the water; it was warm in the restaurant so the few slivers we had melted in a very short time.<br><br>would absolutely recommend this place and hopefully, upon our return, the food can be served in a more timely manner", "pics": null}}, {"review": {"des": "Man, there are some really tough reviewers on here! I give Isla Filipina 5 stars without any hesitation. <br><br>First of all, the amazing SMELL of the food is bursting out of the doorway seams a full block in advance, before you arrive. That's gotta be worth a star alone. It's always packed (a good sign), but the staff is energetic, friendly, and responsive-- totally chill. Another star. The menu is broad with tons of fresh choices of various meats and veggies, so plenty of selection. Oh, and BYOB with chilled glasses? Yes please, and another star for you! I honestly have to try something new each time (with the exception of the lumpia-- that's a staple for every order. Delicious and inexpensive. I'd add another star just for this menu item alone, but I'd run out), and it has ALL been fantastic. The food portions, flavors, cooking styles, and presentations have all been knockout. I traveled to the Philippians, and was hard-pressed to find food this great. Another star.  Finally, my last star will go for value. In the heart of Chicago, I was able to take 3 friends out, and order 2 full protein dishes, a huge order of garlic rice (amazing), the stir-fried pancit noodles (also amazing), and of course the lumpia AND bring plenty of leftovers home for under $50 (more like $40), with tax included. <br><br>This has been my favorite place so far, especially for the price range, since moving to Chicago. I can hardly wait to try more!", "pics": null}}, {"review": {"des": "I probably come to this restaurant five times a month which explains all the points that we have on the rewards that they offer which is amazing by the way! Got a free halo halo and a free entrée out of it! Thank you very much Isla! Portions are absolutely shareable, I try to not to order too much but I fail every time. Everything is great and reasonably priced. The restaurant itself has its own character I do wish that one day they expand the square footage of the restaurant itself. I will definitely be back here probably tomorrow", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/gaY-BpzmzH5c8a7_nJvLJw/348s.jpg", "caption": "Kid friendly restaurant"}]}}, {"review": {"des": "Small place, slow service, good food but quite expensive. This restaurant is too small for its own good. Came in around 2pm on a Sunday and was lucky to be seated promptly, however others that followed had to wait a long time. The owners should consider expanding, and perhaps hiring more servers because it took longer than usual to be seated (considering there were a few available tables) and to get our drinks. <br><br>The food that we got was great - especially the lumpia and lechon kawali. Though it's pretty expensive, considering that I've had better Filipino food at home. However, this is a great place for Filipino food in general, especially if you've never had it before. <br><br>Another complaint about this place is the bathroom, which was accessible by going through the kitchen. It's a bit awkward walking through the hot and humid kitchen where all the chefs are to go to the bathroom... It also does not seem fair for this place to simply close their restaurant because they are catering for someone else's party. My family came here the day before, only to be disappointed about it being closed to customers. Absolutely NOT professional. <br><br>Will NOT be coming here again.", "pics": null}}, {"review": {"des": "Highly recommend this little Filipino gem! It's a small, very busy restaurant; so make a reservation if you can.<br><br>Some of the dishes we ordered were the Lumpia Shanghai, Inihaw Pork, Longanisa, Garlic Rice, and Halo-Halo for desert. The Lumpia was a delicious starter of deep friend egg rolls and sweet and sour sauce. You can either order 10 or 20 and they are little; so they won't fill you up too much before the enteees. This is a must order!<br><br>I really enjoyed the Inihaw Pork, which was char-grilled strips served with a tasty vinaigrette. They give you a pretty big portion, which is nice if you are sharing dishes. The longanisa sausage was really good too, and also came with the vinaigrette. All these meals were served with white rice, and we also ordered the garlic rice as well. The garlic rice was a little heavy on the garlic, so I would stick with the white rice instead. <br><br>If any room for desert, try the Halo-Halo. It's very refreshing and tasty, and the combination of crushed ice, fruit, and ice cream was a great treat to end the flavorful meal. Will be returning to try the Mixed Adobo next time!", "pics": null}}, {"review": {"des": "Isla has been so good for so long. I really hope my last visit caught them on an off day but it will be a while before I return.  There were multiple serious service issues, room temperature soup, piece of over cooked pork (charred to death,) entrées missing a key item and cold lumpia. The eggs missing from the entrées were brought out later. <br>A table of 9 were sat after our table of 2, ordered their food after us, and received their food prior to us receiving room temperature soup. There was a lady who had to wait for a table while we were already sat and was told that, \"we aren't going to tell you (her) to leave but it would be a while\" before she got her table. I appreciate that open communication. She was sat, ordered, and also received her food before we received our soup. <br>We ordered a couple lunch specials and made no substitutions but if we had, the wait would have been acceptable. Later on in the meal, we were asked how everything was. I responded that it was just ok. We left our standard 25% tip and went to Little Caesars for some hot food.", "pics": null}}, {"review": {"des": "I had never really had Filipino food so I didn't have any expectations. I am a fan of Isla Pilipina.  We came here for a Friday night dinner with a large group. It was great to go with a big group who were all good with sharing to be able to try so many different things.<br><br>To start, we had several orders of lumpia - mini fried eggrolls.  They were addictive and I loved the sweet and sour sauce that came with it. Of all the main courses, my favorite was the crispy pata (deep fried pork knuckle).  The meat was so tender and moist that you didn't even need a fork. I also really enjoyed the fried chicken and the fish and quite frankly, everything else (I just didn't necessarily know what it was). My least favorite was actually the dish that I ordered (can't remember what it was called; it was the pork or beef cheeks). It fell flat particularly in comparison to the other dishes. However, there was so much food and sharing that it didn't matter. The prices are cheap and the portions are enormous. <br><br>The restaurant is very, very small and gets busy.  I'd highly recommend reservations during peak times and even more so for a group. Note that they do not serve dinner very late (Kitchen closes about 8:45).  It is also BYOB.", "pics": null}}, {"review": {"des": "It looks like a hole in the wall but you'll be pleasantly surprised. We had the calamari (which was crispy and not chewy) the lechon kawali and my favorite the beefsteak Tagalog. Give it a shot if you are in the area and looking for good Filipino food.", "pics": null}}, {"review": {"des": "COST:<br>$3 (Lumpia Shanghai 10 PIECES, WTF! A monster deal)<br>$8 (Pancit Canton)<br>$13 (Bicol Express - highly recommended!)<br>$8 (Mixed Adobo - pork and chicken)<br><br>Los Angeles definitely has more accessible Filipino food for two obvious reasons: greater Filipino population and driving. With only public transportation as my driver here in Chicago, I pretty much just have Isla Pilipina close to an L stop (Brown).<br><br>I had high expectations coming in because of the sheer number of great ratings and reviews. I thought for sure it couldn't be that good. Well I was proven wrong. It was THAT great and more.<br><br>You know big ups to them for pricing the food so incredibly low. I almost feel like the food is too cheap, but that's a good thing to you, the consumer! BYOB too so that's a plus.<br><br>Definitely get the bicol express if you're only getting one thing. But I plan to come back multiple times to try more of their food. Definitely tasted way better than Maxx's in Los Angeles and definitely tasted gloriously homecooked!", "pics": null}}, {"review": {"des": "You have to be patient or make a reservation. It's a quaint little place. The waitstaff is very friendly. The food is good. We had lumpia. They were small but wasn't too hot.  Because of the size there wasn't much filling. <br>Then we had pancit bichon. It was hot and the chicken pieces was tasty. The longanisa was very good and the serving was a nice size. <br>My niece wanted the spaghetti delight. It was a sweet sauce with hot dogs. The Asian style spaghetti sauce. It came with 2 pieces of chicken which was so crispy and flavorful. <br>If you like garlic then you have to get the garlic fried rice. It's very strong in garlic but it's good. But if you can't take much garlic be ware. <br>The last dish was dinuguan which is a pork stew. It was delicious. It took a long time. They discounted our check cuz of he wait. It was worth it. <br>Our waitress kept checking up on us. It's a small place of 12 tables or so. But you must be patient. Each dish comes out at different times.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Dtfl1hEdfZJV3RoUI2v8xA/348s.jpg", "caption": "Lumpia Shanghai"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/bNLvjAdwdProbwTGLmBLhA/168s.jpg", "caption": "Longanisa"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/cQDeKpkGaP7Qu__jD1szNA/168s.jpg", "caption": "Spaghetti Delight"}]}}, {"review": {"des": "Went here a while ago, great food , warm and friendly service. Super in expensive food packed with flavor. Beware high caloric deliciousness. Loved the le chin? Fried pork oozing with an outer golden crispness and very moist succulent  meat. <br>Mmmmm I think I'll have to return to this little hole in the wall. So lucky to live in Illinois and having such a diverse selection of ethnic delights.", "pics": null}}, {"review": {"des": "Isla Pilipina is a cute little place in Lincoln Square with an unassuming storefront, really good food, and friendly and attentive service! I had the pleasure to go for dinner this past Saturday night and would definitely recommend you do the same in the near future ... just be sure to make a reservation, as it's a small place and fills up fast.<br><br>We had the 10-piece Lumpia Shanghai - delicious little mini eggrolls - as an app and two main dishes, the Guinataang Gulay at Hipon (mixed vegetables and shrimp in coconut milk) and the Kare-Kare (beef oxtail and green beans in peanut sauce with a side of shrimp brine paste). The portions were BIG, so we ended up taking home a lot of leftovers. We probably would have been more than OK splitting just one main dish ... but I'm not complaining, as the leftovers were just as tasty the next day. :)<br><br>Our servers were friendly and helpful, offering tips on what we might like to try, giving us a heads up that \"a very little bit of shrimp brine paste goes a long way,\" and just being very nice and welcoming overall.<br><br>Bonus: This place is BYOB - wahoo!!!", "pics": null}}, {"review": {"des": "Simply amazing! First time trying Filipino food and it set the bar high. The staff is supper friendly and enthusiastic. The place smells delicious as soon as you walk in. Our meals were perfect. Position sizes are big and filling. Will be back!", "pics": null}}, {"review": {"des": "A few years ago, I gave Isla pilipina a try and was disappointed. This month, I went twice for dinners with friends and I had amazingly better experiences! <br><br>The food is really special. Everything is homemade, hearty, and bursting with flavor. My favorite dish is undoubtedly the oxtail in peanut sauce with green beans. The garlic rice is worth the extra cost - it's delicious. And of course, I love that it's byob. I'll be coming back here many times in the months to come.", "pics": null}}, {"review": {"des": "So having a Filipino brother in law who can really throw down, my standards are pretty high when it comes to Filipino food. My boss also happens to be a strong independent filipina & by the grace of God she brought me to Isla. I can say that I need to look no further for amazing Filipino food in the city. No brother in law required. There isn't a single dish I wouldn't recommend & I've tried just about all of them. They're all so delicious & have the taste & comfort of home cooking. The staff is also extremely friendly and very attentive. Be wary of going here on the weekend night without a reservation, it's a pretty small place so reservations are recommended. It's also BYOB & prices are very reasonable. My favorites are the lumpia, mixed adobo, the beef tagalog, longaniza with fried egg & garlic rice. Go here people. Trust me, you won't be disappointed.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/hmqi00xEhJ8wIC-zfs2B6g/348s.jpg", "caption": "Longaniza"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/hTq_MterZjJdDa_GHcE1dA/168s.jpg", "caption": "Mixed Adobo"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/YSrecWtfBC7FXdtvdgyuJQ/168s.jpg", "caption": "Garlic Rice"}]}}, {"review": {"des": "This is my first time eating here; I'm so grateful they were able to accommodate my reservation of 25-30 people today for my mom's bday! It's a nice little spot. Ray advised me to have a menu ready a week ago so they can prepare ahead. And boy, was he right! They had all the food I pre-ordered ready when all of my guests arrived. They were very patient with us. They attended to everything we needed. I preordered the calamari, lechón kawali, kare-kare, beef caldereta, pakbet, bicol express, pancit cantón, palabok and their special fried rice. Everything tasted super delicious! All of my guests loved them all! Will definitely be back again!", "pics": null}}, {"review": {"des": "Had lunch here today with a good Brother.  Wow what a great lunch. We both ordered 2 different plates.  I ordered the bar b que chicken thighs and he had some pork steak meat.  Both meats were grilled to perfection. We both got rice with our plates.  The amount was so much that we were able to share our plates and take some home. The price was very affordable and well worth it.  The staff was great and the owner is a pretty cool guy. Highly recommended!!", "pics": null}}, {"review": {"des": "Fantastic Filipino food! Everything was great and my girlfriend and I will definitely be coming back here in the future. I think my favorite dish we had was the pancit, which I highly recommend. Everyone was great, waiters and waitresses were really nice and on top of everything despite it being busy. I really recommend this place!<br><br>Just a tip, make a reservation. We went to this place because we found it by chance and we had to wait for a bit because it was busy.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/KmN_4F-iangTKzmQQwOW4Q/348s.jpg", "caption": "Our fantastic meal."}]}}]}