{"name": "j-p-graziano-grocery-chicago", "reviews": [{"review": {"des": "I've eaten here twice and always feel welcomed. There is a LOVELY woman who's the cashier and she just is pure awesome sauce!! Very kind and generous in her conversation with you. Makes you feel like your patronage is valued. <br><br>The sandwiches are great, too! Make sure you get the sub card.", "pics": null}}, {"review": {"des": "The Mr. G - I would come back just for this flavor bomb. The ingredients are in perfect harmony. Nothing overpowers the other and it's just so so delicious. Prices are slightly inflated compared to my favorite deli shop but might be since it's in the We$$t Loop area. Thus, I would prefer to go to my other spot for regular deli sandwiches. But once again, the Mr. G is unique to JP Graziano's so I would come back for that sandwich. <br><br>#RefereEats<br>\"I call it like I eat it.\"", "pics": null}}, {"review": {"des": "Great traditional Italian sandwiches with no frills.<br><br>Not much on atmosphere but with it for the food and fair prices.", "pics": null}}, {"review": {"des": "Incredible, authentic Italian deli on Randolph st in the West Loop. One of my favorite places in the city! The Italian sandwich and tuna are also great. Highly recommend the cannoli. Staff is very friendly.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/7p79nYTnh-Uo0C5y-iSiRw/348s.jpg", "caption": "Mr.G special"}]}}, {"review": {"des": "Came here on a quiet Wednesday after lunch rush. Its right by all the big names on Randolph, Girl and the Goat, Au Cheval etc. This place has been here for decades, and glad they are still at it. Its a family run place, and everyone here is super nice! <br><br>I got the Mr. G with hot peppers.  Its kind of like the Italian bmt or #9 Italian Night at Jimmy johns. Although since it is a deli everything is fresh of course, and filled with quality ingredients. The sandwich was good, loved the giardinera. I gotta give this place credit for going strong all these years, especially in the hot location they have #respect, but for me this is just a italian deli/ sandwich shop slightly better then Jimmy Johns. If you your in the area its a good lunch. But nothing worth coming from far to try.", "pics": null}}, {"review": {"des": "Easily the best Italian sub spot in Chicago. Old school family that knows how to make sandwiches. They have been around since before the neighborhood was bumpin. Reasonable prices for the neighborhood.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/jQnr1bGVLKstdFQ-r9_ELg/348s.jpg", "caption": "muffaletta"}]}}, {"review": {"des": "Why would you get food from a grocery store that doesn't actually make any of their food except their sauces? That defies the notion of restaurant.<br><br>When I went to J.P. Graziano's Grocery for the first time, I was a man on a mission. A recent YouTube video covering how some of Italy's finest porchetta was made spiraled me into Rome flashbacks, and instilled one of the strongest cravings I've ever had. (If you want to torture yourself with food that you can't access, please watch: <a href=\"/redir?url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3Do5qJ3MAPxS8&s=7048fedbfc88ad10670cb69559736e316c867e0ad315d60a7facd6c5c9a65284\" target=\"_blank\" rel=\"nofollow\">youtube.com/watch?v=o5qJ…</a>) <br><br>This craving was so strong, I immediately began searching for the best porchetta sandwich in Chicago. Some forums pointed me to J.P. Graziano's. The experience I had here though, put me off from ever returning. <br><br>The porchetta sandwich they served me was a simple cured meat, it had not ever been cooked, it wasn't warm, and it absolutely was not worth the $15 I paid for it. When I inquired about the origins of their porchetta, J.P.'s simply replied that they acquired the meat from some producers that they know. If a majority of the sandwich was made of cold ingredients that J.P.'s inquired elsewhere, why on earth would you eat here. Your simply paying extra money for someone to assemble ingredients for you and overcharge you. It also left me deeply unsatisfied, and by the end of my sandwich I was still desperately craving porchetta. <br><br>Essentially my sandwich was subpar, and I desperately wanted a delightful porchetta sandwich so I'm mildly bitter at J.P.'s for not being better.", "pics": null}}, {"review": {"des": "The people are incredibly nice. Sandwiches made to order. Quick. Fresh. Great meats and ingredients. BF had Mr G...very flavorful. I had the tuna salad on a hefty hunk of crusty bread...delicious. 2 sandwiches was $25. Ordered and out in maybe 5 min at lunch hour!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/hE4v4hXT54-RFCoNM8xSjQ/348s.jpg", "caption": "Homemade tuna salad -$10"}]}}, {"review": {"des": "Now that's a damn good sandwich!!! Being from NJ and near NYC my whole life, I'm hard to please when it comes to sandwiches, especially Italian ones but this place did not disappoint. We split the prosciutto mozz and the Mr. G. They come on 9in subs so splitting two sandwiches was perfect for us. If you aren't huge eaters splitting one might be fine! It's a pretty small shop but there's ample tables between inside and outside. Could definitely see it crowded during the lunch rush though (we came around 2pm on a Saturday afternoon). <br><br>What stood out the most to me was the impeccable service and friendliness from legitimately everyone who worked there. So refreshing to see some good ppl in this world. Hands down will be back next time I'm in Chicago!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/_E7BjbsvLtdAb_HLBLK29g/348s.jpg", "caption": "Half prosciutto mozz half Mr. G"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/GiUZA9FZ7eWBupWO2rou8w/168s.jpg", "caption": "Prosciutto and mozz"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/G3RrOqWrdhelTgROU6ShPQ/168s.jpg", "caption": "Mr. G"}]}}, {"review": {"des": "This is such a cool place! We stopped here to pick up some subs on our way out of town as we were relatively sure that the food here in Chicago would be much better than anything we could pick up for lunch during our travels. <br>J.P was easy to find and had parking right in front. We went in to place our order as we had previously done our research and knew what we wanted to order. As much as I love to try new places and things, when it comes to subs, I almost always order a turkey sub. The same is true with my wife. Well this day I broke the mold and decided to go with their special which is the Mr G,<br>This may be one of the best ordering experiences that we have ever had. When we walked in we were greeted by a nice older Italian gentleman. I could have been Al Capone walking into this establishment. This gentleman was very friendly as we placed our order. We were then directed towards the end of the counter where we were to see \"mama\". Really?!?! How cool was that! So we went over to see mama who we paid for our sandwiches. Felt so authentic and old school.<br>The sandwiches. The Mr G was as good of a sub as I have ever had. The Mr G just bursts with flavor. Imported sharp provolone, salami, sopressatta, marinated artichokes, basil, oregano and truffle mustard balsamic vinaigrette to name a few of the tasty ingredients. It's savory, salty, a little sweet, some sour, fresh bread, its what a sub should be. The bread is nice a chewy and holds up perfectly to this masterpiece. <br>My wife got the turkey sub with sundried tomatoes which was also good, but the Mr G is where it is at.<br>J.P Graziano is the real deal. For a fantastic sub, check out the Mr G!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/fMt40VffrIj6nTroOfdvJQ/348s.jpg", "caption": "Turkey sub"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/K5sSPZDDKnaZv4milz-_HA/168s.jpg", "caption": "Damn great sub"}]}}, {"review": {"des": "If you have lived in Chicago for a while, it would be hard to have missed this place. Having been importing and supplying Chicago with quality Italian goods for 80+ years, it's no surprise that the sandwiches are top notch.<br><br>No need for a lengthy review. The folks here are great, the sandwiches are insanely tasty (especially the bread), and the prices are affordable. Best sandwich in Chicago.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/YQhIFdBAMFDGDkbxVdLMbg/348s.jpg", "caption": "Mr. G sub after a couple of bites"}]}}, {"review": {"des": "I'm from a region with heritage partially defined by an ever-shrinking number of classic Italian grocers. J.P. Graziano tastes like home. Some might find it odd that it is able to toss the (fabled) pretentiousness of West Loop out the window while serving high-quality food. It's one of those places that is just silly to sit down and write a review about and even more ridiculous to review critically. One of the last holdouts from a bygone era, it defines the character of West Loop that has mostly disappeared. The presumption that the family owns the building makes what they're doing even more significant and heartwarming.", "pics": null}}, {"review": {"des": "Overall, the sandwiches were very good. The bread had an interesting crispy shell and fluffy interior and the ingredients in the sub were prepared in a balanced proportion. <br><br>It was good enough that I would go there again if I was in the area, but not good enough to necessitate a trip solely dedicated to getting sandwiches.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Sz4PA44v3GGol52aH7pdJg/348s.jpg", "caption": "Menu of subs"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/fNLqQXa3E3aV-oOFldveMA/168s.jpg", "caption": "Alternate shot of Spicy"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/e44evGffjMJQ3xs0diD7QA/168s.jpg", "caption": "Spicy sandwich: good sandwich although not particularly spicy"}]}}, {"review": {"des": "They never disappoint. Friendly and DELICIOUS. We find the subs are still good a day later--sort of a miracle when it comes to subs.  So delicious. This place can never go away!", "pics": null}}, {"review": {"des": "Deli sub sandwich shop. I ordered the Italian and it was good but not the best. I believe these sandwiches would be better if they put more meat in the sandwich. The bread is crusty, the ingredients, and deli meat are fresh, and it's good, but I think it would be way better if they added more meat to their sandwiches. Otherwise you taste more bread than the meat. <br><br>The clerk and the deli workers are all very nice. That they do not lack. They have a very friendly staff.", "pics": null}}, {"review": {"des": "Holy geez, this place has absolutely amazing sandwiches. I had  been thinking about their sandwiches since the last time I had one, and that was a couple of months ago.  I was seriously dreaming of their spicy Italian sub. The meats here are stupefyingly good, and their giardiniera is ridiculous. <br>My home fry and I shared the porcetta sandwich and the spicy Italian and kept muttering  \"are you kidding me?\". That's how great it is.", "pics": null}}, {"review": {"des": "Today I was walking by the West Loop looking for a place to have lunch.  I was not craving anything particular and I had no plans to meet anyone. Fortunately, I bumped into this amazing jewel. I have  read about JP Graziano before but I had no idea where it was located so when I saw it, I knew I had to go in. <br>My experience there was beyond the expected. Not only was I welcomed by Jim, the very own grandson of the founder, but I was also able to appreciate how it is still a family business. <br>Although yes, the most popular sandwiches are the Italian and the Mr. G, I decided to go with the prosciutto. I do not regret it. The sandwich was huge, delicious, filled with good quality cheese and meat, and, on top of that, CHEAP!! I am definitely a fan and I am looking forward to go back and be pleased by another Graziano great experience.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/3dVLiugIFeYHGcON7kHwxw/348s.jpg", "caption": "Prosciutto Sandwich and the Deli counter on the back"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/YouQvd_IMvewUchiMcyHIg/168s.jpg", "caption": "Prosciutto Sandwich"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/wJgkUMWBufykghmPaT39bg/168s.jpg", "caption": "Inside the deli"}]}}, {"review": {"des": "My Favorite Sandwich and Cannoli in the City of Chicago has been found at J.P. Graziano Grocery! It is the Mr. G. sandwich! It will blow your mind. Every bite is an explosion of flavor! The crunch of the bread, meat and cheese ratio perfection, marinated artichokes and the truffle-mustard vinaigrette take this sandwich to the #1 spot! Oh their Cannoli! I have been thinking about it every day since my last bite. Your taste buds won't even know what to do! Also order Jim's riff on the Muffuletta sandwich, it is amazing! Get here now! They are located at 901 W Randolph. Subscribe to my You Tube channel here, <a href=\"/redir?url=http%3A%2F%2Fyoutube.com%2Fc%2FABikerDude&s=d849c07b3fa9c77321c2df68ae238c992307b644d20a4b06ad60c8afc6c924b8\" target=\"_blank\" rel=\"nofollow\">youtube.com/c/ABikerDude</a>", "pics": null}}, {"review": {"des": "The Mr. G is the best sandwich, period. Get it with everything, even if you don't like a particular ingredient. The combination is too good! Italian sub is a close second. <br><br>The meats and cheeses here are a little more pricey than regular markets, but the quality surpasses those and makes them worth the price. They're so fresh and delicious.", "pics": null}}, {"review": {"des": "What more can I say about a neighborhood institution that hasn't been said already. Jp Graziano, perhaps as one of the oldest true Italian shops it has held its own for years. Before even the redevelopment of its Randolph St location. Away from the other mom and pop Italian shops and restaurants  (,Grand Ave, Taylor St, Cicero), it's managed to create it's own spin on the Italian deli experience. <br><br>   A true family run business, kids running food, daughter calling out the orders and making sure everyone coming through the door is getting the treatment. Then, in true \"Seinfeld\" style, with money in hand you make your way to the register line. This is where \"Mama\" resides. Inside her office, with a smile on her face, asking if you were taken care of, an eye over the entire operation. <br><br>    As you pay and turn around, you hear your name. SUBS UP! <br><br>   I got an Italian, it was delish! What do you want i only got two thumbs! Next time the \"Mr. G.\" , I thought about it, perhaps I was scared. BUT, Next Time is soon. <br><br>A super +", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/6DD5-CzX-e-3es3wE9Yv2g/168s.jpg", "caption": "The calm before the storm."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/sK7C75nfhQlG7w3CBZfAcQ/168s.jpg", "caption": "The craving for Graziano's is real!"}]}}, {"review": {"des": "An excellent italian sandwich shop with fresh ingredients. The Mr. G is my favorite, I almost exclusively get it every time and never get tired of it. It's just that good. The quality of the ingredients is excellent and the customer service is superb as well. I always feel welcomed. They also have a customer loyalty card which they are more than generous with.", "pics": null}}, {"review": {"des": "This is a quality place. Definitely recommend that you try it. <br><br>I ordered the spicy. I could tell that all the ingredients on the sandwich were fresh.  Bread was good and fresh too- not too hard and not too soft. <br><br>My sandwich was delivered quickly. <br><br>Best customer service I've ever had at a sandwich shop.", "pics": null}}, {"review": {"des": "Love this place! Really tasty and filling sandwiches, and the prices aren't bad. I didn't work in the west loop for a few years so it's been hard to come back. But now that I'm back, I'll be back soon! So good!", "pics": null}}, {"review": {"des": "Solid sandwiches, though I wouldn't say they are phenomenal Italian subs by any means. Tried out the Mr G with all the fixin's, and the bests parts were the bread, the prosciutto, and the truffle mustard + oil. I like how they sliced the lettuce and arranged the sandwich, though I think it could have definitely benefited from a higher meat::bread ratio. Being in West Loop, you can expect the prices slight marked up but given that we aren't that far from west town, with it's plenty of Italian options, I still think it's a bit on the higher end. Verdict? This is a good sub, and they do tend to use both fresh meats and produce. But when it costs upwards of $10 after tax(My Mr. G was $12.07) for essentially a 9\" sub, it's a bit hard to justify when you can get very comparable sandwiches at half the price from d'amatos or Bari just 12 minutes or so north.", "pics": null}}, {"review": {"des": "My dad and I frequent this area a lot due to his doctor appointments at Rush so it's always a treat when I get to stop by JPG. Today, I was greeted with smiles and ordered an Italian and Muffuletta to go. As soon as I got home, I dived into my sandwich and ohmygosh was it so tasty. I love their red wine vinegar and seasonings, really makes the Italian so great. Dad was very happy with his muffuletta. So big, that my brother ate some too! <br><br>Aside from the food being so delicious, folks here are so friendly. Family owned and run - you can tell they really care about their product and service! I will definitely be coming back! Thank you JPG for an awesome lunch!", "pics": null}}, {"review": {"des": "I've never written a Yelp review before but finally felt inclined to do so...This place has delicious, fresh, homemade sandwiches that are reasonably priced for the size and quality. It's owned and operated by kind family that is clearly passionate about their product and customers. I always leave the shop with a smile on my face. One of the last remaining jems in a neighborhood that is under a rapid transformation. I hope they stick around as they are an asset to the neighborhood!", "pics": null}}, {"review": {"des": "Terrific Italian subs, this place never disappoints. Family-run business that knows how to do food and customer service right. Graziano is my go-to for catering client work lunches, and have ordered the past couple years for my fantasy football draft. The sub party platters are a great deal. Highly recommend.", "pics": null}}, {"review": {"des": "We came here on our 1st day of our 4th trip to Chicago , after we had a terrible lunch at Roister. We ordered Mr. G (house specialty - imported sharp provolone, hot sopresatta, Prosciutto di Parma, Volpi genoa salami, truffle mustard balsamic vinaigrette, hot oil, marinated roman-style artichokes, fresh basil, lettuce w/ red wine vinegar & oregano)<br><br>Sounds great, but coming from NY/NJ we have the best breads and sandwiches. This was alright... the bread wasnt crusty enough on the outside and wouldve been better with double the meat.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/j2uWO3u3MSTA0xiARcJYBQ/348s.jpg", "caption": "Mr. G  imported provolone, hot sopresatta, Prosciutto di Parma, Volpi genoa salami, truffle mustard balsamic vinaigrette"}]}}, {"review": {"des": "I love J.P. Graziano. It's my favorite place for Italian sandwiches. It's also a family-owned neighborhood gem. Everyone that works here is so nice! <br><br>The Prosciutto is my go-to order. Thin slices of prosciutto di parma, fresh mozz, fresh basil, tomato & lettuce w/ red wine vinegar & oregano. They also sell other items you can find in an Italian deli, but I pretty much just go here for the subs. Perfect spot for lunch on the go in the West Loop.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/43B25SAFOAjcDajxNoqtHw/168s.jpg", "caption": "Prosciutto sandwich"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/umkbW31Q7FQC6Nw1glcu-g/168s.jpg", "caption": "Leave the gun, take the cannoli"}]}}, {"review": {"des": "This deli is a Chicago staple.  I go there once a week and look so forward to it. Best sandwiches in Chicago hands down.  Definitely worth the trip.", "pics": null}}, {"review": {"des": "Woke this morning with a craving for a great italian sandwich. I couldnt decide between Bari on grand or JP Graziano. Well i eventually picked the latter, and am I ever glad I did! I got the 'Mr G', a spin on a normal italian sub with their addition of marinated artichokes and some truffle mustard balsamic vinaigrette. The truffle isnt overpowering as some oils can be, the artichokes are mellow and bring a richness that meat and cheese alone cant provide.<br><br>I'll be back!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/8vWlNCcHVwZT20f4CE-AfQ/348s.jpg", "caption": "Delicious artichokes!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/SNUnzWv-ZdIgq330wVmoGA/168s.jpg", "caption": "The 'MR G'"}]}}, {"review": {"des": "Whenever I'm asked, \"What's your favorite restaurant in Chicago?\" my immediate answer is always, J.P. Graziano. This place practically writes the book on quality, Italian subs. Their bread is exceptional! It's crusty and chewy, but it doesn't upstage the meat! Everything they put on their sandwiches is fresh and high-quality. <br><br>My go-to order is the spicy Italian sub with hot peppers (swap out the red wine vinegar for truffle mustard--you won't be disappointed!). Amazing. Their hot peppers are out of this world. I love how the sandwich is served too....nothing special, just wrapped up in butcher paper; something about it just makes the sandwich feel that much more Italian deli.<br><br>It's a cute little grocery setup, too. They have some nice imported drinks, and deli-style snacks, desserts, etc. Nothing to write home about in terms of the service; it's a pretty no-frills, order at the counter (pay at the window) joint. That system confused me a bit the first time I came here; you order your sandwich at the deli counter, and then move 5 ft to your left, recite your order to the person in the window and pay, and then you pick up your sandwich. <br><br>For a great, no fuss lunch and an exceptional sandwich: J.P. Graziano is your place!", "pics": null}}, {"review": {"des": "So DELICIOUS! This's by far my favorite gourmet sandwich place. We came here on our last day of our first family trip to Chicago. Very friendly staff!<br>Very lovely family owned shop! If you want a really good sandwich, then check this place out for sure!<br>Our personal favorites are Spicy and Italian!<br>HIGHLY RECOMMENDED!", "pics": null}}, {"review": {"des": "Having passed by more times than I can even count I finally decided to stop over to J.P. Graziano for lunch and I'm glad I did - they certainly make a solid sandwich.<br><br>Upon entering, the first thing you'll notice is that this is a sandwich shop masquerading as a grocery store. Sure they have a few shelves and sell meat/cheese by the pound but they are in the sandwich business. And for good reason, they make a good sandwich! Being my first time I went with the Mr. G (the \"House Specialty\") and I wasn't disappointed. While I do think it needs a bit more meat the flavor combination was fantastic. Also, I added Dijon mustard and mayo and am so glad I did, the mustard made the sandwich a cut above. At first I thought it was a bit small, and while I prefer massive meals, it turned out to satisfy me. However, the price is a bit steep: for a sandwich and a drink I walked out $15 lighter...<br><br>The experience and the sandwich are certainly worth stopping in for lunch. It's a bit far from The Loop to fit into my normal rotation, and pricey to boot, I will be remembering JPG for a while (and recommending it too).", "pics": null}}, {"review": {"des": "Great sandwiches and fast friendly service. I always go with the Mr. G.  Also have great soup too. Definitely a goto spot when i am in the area. <br><br>With all the transformation of the West Loop, I pray to little white baby jesus that this place sticks around and not sell out to developers", "pics": null}}, {"review": {"des": "The best, all around. Amazing, fresh, delicious Sandwiches, deli items, and more. The Graziano family runs it with care and love not often seen today. My 3yr old requests the spicy giardiniera and we often stop after preschool, per his request. Thanks for being awesome Graziano's, we'll be back soon! <br>Oh, also, order anything, it's allllllll good", "pics": null}}, {"review": {"des": "Come once for the giant sandos and come back a million more times for the giant sandos AND the best mom and pop feel. The food is fresh. There's something for everyone on their menu. But the people are what makes it even better. They make you feel right at home and they're all so sweet and you'll want to be part of their family every time you visit!", "pics": null}}, {"review": {"des": "Graziano's is a Chicago classic, don't let anyone from NJ tell you otherwise. :)<br><br>Stopped in for subs over the weekend and they were perfect as always. The Mr. G and prosciutto/fresh mozzarella were both delicious, well stacked on fresh bread. The bread itself is very soft in the middle with a thin crispy outer layer that almost shatters with each bite. <br><br>The decor is nice with antique architectural details and cool paintings on the walls. Deli counter is small but they have the goods. A half dozen different imported olives if that's your thing, and a couple of dry cured sausages. Small selection of imported dry goods, and interesting sodas.<br><br>Service was very conscientious and genuine. The subs came out fast, and we sat out on the patio under the shaded awning to watch the world go by. Good spot for people watching, as there are lots of trendy restaurants nearby. Twice we were asked how the food was, and they basically waited on us which wasn't expected. <br><br>Bari's is great too, but if i'm in the west loop/Randolph St. area, I always make a beeline here.", "pics": null}}, {"review": {"des": "So DELICIOUS! I'm writing this as I sit here eating my sandwich. Found this place on Yelp as I had time between appointments in the neighborhood. 2pm on a Saturday: walked right in and had my order taken immediately. They bring out your food to you quickly if you're dining in (they have 4 tables). Loved the woman working (kind, quick and accommodating) and that it's a family run place. Can't wait to try other sandwiches. I went with my usual turkey and it did not disappoint. They are big so for me it makes 2 meals.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/1MljFjLYitaJkxeV0O9zRw/348s.jpg", "caption": "Turkey sandwich  enough to make 2 meals out of."}]}}, {"review": {"des": "Sooooooooooo AMAZING! Never change. I love the simplicity of it all. Having limited options is everything. My favorite is the ... well everything.", "pics": null}}, {"review": {"des": "Somehow I've lived in Chicago for over 7 years, eaten all over, and never been here before. It's been on my list for awhile but I always kind of pushed it aside for other places.<br><br>It is a no frills Italian sub shop that also sells some meat, olives, and spices (like oregano) by the pound. I love sandwiches and bread, but I tend to actually shy away from some of the more loaded Italian subs because they load up way too much meat on them and it overpowers everything, or some of the other stuff overpowers it.<br><br>I ordered the Mr. G - even though it sounds like one of those subs I usually shy away from. I'm really thankful I ordered it because it was really, really good. There are a handful of different types of meat, but it's not one of those sandwiches where it's a meat overload. Not even the artichokes overpowered the sandwich (they do on most). I can say it's one of the best balanced sandwiches I've ever had and would recommend it in a heart beat. Of course any sandwich connoisseur knows that the bread makes the sandwich too. Their bread? Awesome. Just the right kind of balance of hard and soft. <br><br>The people who work here are cool and personable too. Not that I'd recommend you driving an hour just to get a sandwich from here, but if you are in the area and want a really good sandwich, then check it out for sure.", "pics": null}}, {"review": {"des": "Great place to pop into for a quick deli sandwich. Great crispy bread, delicious meat, good flavor combos with the toppings.", "pics": null}}, {"review": {"des": "This place made my recent trip to Chicago. I got the Tuna with all the fixings and it was something special - to this date The Best Sandwich I have ever eaten. The oil is Incredible and every ingredient was Fresh. I came back on the way to my hotel and ordered two more for my dinner it is so good. Very nice folks behind the counter that welcome you and thank you for coming. There was a line but it moves fast as the staff hustles your order out according to your request. Will return next time I am in the Windy City.", "pics": null}}, {"review": {"des": "I enjoyed walking in and feeling like I was back to an earlier and simpler time. J.P. Graziano doesn't try to be anything it's not. Good sandwiches, fresh groceries, and staff members that work hard. My only wish is that my sandwich had a little more meat on it. The bread was tasty but outnumbered the meat 2:1.", "pics": null}}, {"review": {"des": "The sub sandwiches were spectacular and very tasty. There is something for everyone on the menu. The place is very inviting and everyone was so warm and friendly. We will be back again for sure!", "pics": null}}, {"review": {"des": "Excellent sandwiches and excellent service. They have mastered the forgotten art of greeting customers when they enter and exit the business. Combine the customer service with a great Italian sandwich and Dr. Pepper like specialty drink and you have a winning combination.", "pics": null}}, {"review": {"des": "I grew up in New York with a local family owned deli that was a favorite in our small town.  They had the best Italian subs and I've missed them since they closed shop 20 years ago.  That was until I discovered the Italian sub at Graziano's.  It was total food deja vu.  The crisp, flaky crust on the soft bread....the balance of meat, veggies, and cheese...the combination of oregano and other Italian seasonings.  It's not to be missed.  I get the spicy Italian and am in heaven.  The shop is as old school as it gets.  And the family that runs the place is awesome.", "pics": null}}, {"review": {"des": "It might be authentic but I dont think it's THAT good. Had the Mr. G, tasted like an average sandwich to me. Now i dont mean avg like Subway avg, i mean like they can do alot better avg, if ur gonna be authentic. I've had Bari & even that place wasnt outstanding to me but better than here. The sandwich consisted of hard bread & tasted like nothing but oil. But Hey, what do u expect when they only put two thin slices of meat??", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/RJvGyH8gyUOcdIRkSNUo_Q/348s.jpg", "caption": "Seating area outside on Peoria St"}]}}, {"review": {"des": "Wow!   What nice people good food and fast service!   I let the fellow taking my order know that i couldnt eat bread.   His response.   Any of our sandwiches can be put in a bowl.   Thank you !", "pics": null}}, {"review": {"des": "I've been to JPs only one time several years ago and I'm glad I stopped by for lunch again. The bf always get's the tuna sub and I decided to try the Mr. G sub. The bread was perfect.. light and crusty with a soft interior and a good amount of chew. I really enjoyed my sub. I asked for mine with easy sauces and I'm glad I did. The Mr. G sub was full of flavor from all the different meats, sharp provolone, marinated artichokes and the fresh basil leaves. Don't be fooled by the pictures, there is actually just one large artichoke heart placed right in the middle of the sub. If you are looking for a ton of meat, I'd try one of their other offerings. The sub was large enough to make 2 meals for me. My bf, on the other hand, devoured his entire tuna sub. I also had a cannoli for dessert. The menu description says \"fresh filled,\" but they fill it earlier in the day. When you look at them through the display glass, you can see the juice from the marinated cherry bleeding into the ricotta filling. Despite the not so fresh appearance, it still tasted great. And fyi, there's some little chunks of unknowns mixed into the ricotta.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/NPJ1m7mWUMEm_bjyQVCmOw/348s.jpg", "caption": "\"Fresh-filled\" cannoli"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/RixJemnDh5iIJLQJX1SkYg/168s.jpg", "caption": "Mr. G sub"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/4k2V_ryEIAx5TWrHGmXHxQ/168s.jpg", "caption": "Tuna sub"}]}}, {"review": {"des": "Hands down greatest grinders of all time.  My boy Wilbon and I go here every Wednesday and grub hard AF.  Will be a lifelong customer!  Gotta go with the Italian for sure!", "pics": null}}, {"review": {"des": "Dear JP, I heard alot about your sandwiches from people and even watching Chicago's Best and I must say It wasn't what I expected I ordered 3 Mr.Gs for my friends expecting the best from the rumors in the city  unfortunately didn't quite reach my taste buds.<br><br>Mr.G was OK taste full of veggies and a slight taste of prosciutto lots of herbs and spices a hit of provolone it's a good sandwich for vegetarians not sure for meat lovers I recommend Luckys near Wrigleyville that place had me speechless.. literally", "pics": null}}, {"review": {"des": "Got the Spicy; it was as good, and almost as spicy, as I was hoping for, with quick service and fair prices for a sammie/chips/drink combo.<br><br>As much as I loved it, it's really difficult to distinguish the quality at JP Graziano's from places like Vinnie's, Fiore Delicatessen, Bari, Nonna's, or other local sub shops.  If you are in the West Loop and want a cold sub, this is the call...but if I'm in Wicker, I'll have a different answer!", "pics": null}}, {"review": {"des": "Make no mistake: the sandwiches are fresh, flavorful, and damn good. Both the conventional and the spicy version of the Italian are pretty perfect, and the Mr. G is dank: the superior cheese, the fresh basil, and the rich truffle mustard combine to produce a rare complexity of flavors and textures (because let's be real, plenty of places produce subs that taste like bedsheets because there are plenty of people who are glad to eat them). <br><br>But I go to Graziano's for the love. The ladies who ring you up in the back are all \"Sweetheart\" this and \"My love\" that, and they remember your face. : ) Even the guys who make the sandwiches have pretty sweet dispositions! The snug and cozy atmosphere seals the deal. The trek to Fulton Market is worth it for the salami and the ego boost alone!", "pics": null}}, {"review": {"des": "This is hands down the best sandwich in Chicago.  Everything is so fresh.   The meats are so good and the bread is always super fresh.  I can still remember the first time I had J.P. Graziano's.  It was life changing. I ALWAYS order the Mr. G.  The truffle mustard vinagrette on the sandwich will knock your socks off.  I tell everyone I can about this place.", "pics": null}}, {"review": {"des": "I dont know how they take basic sandwich ingredients and make something that tastes this good. For sure a hidden gem in the west loop. I eat here as often as I can when working from home. <br><br>Personal favorite is the turkey with hot peppers. Also really good soup options seasonally. <br><br>Always the same folks working - very friendly and great service.", "pics": null}}, {"review": {"des": "Awesome no frills sandwich shop. An Italian sub like it should be!<br><br>I ordered ahead thinking I would skip the lunch rush which worked well as no one was there when I walked in before noon. But I'm not sure how this works if it is busy as apparently the line wraps all the way around the store. I will be back to try their grocery items.", "pics": null}}, {"review": {"des": "Loved the atmosphere of Italian deli where they slice the meat and sell huge olives and fresh cannolis.  Had the mr g sandwich which is good but a bit salty for my taste.  Will try porchetta next time and skip the mustard.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/9ZFtMTtqmUmqMEFQ5Pa5aw/348s.jpg", "caption": "Mr g"}]}}, {"review": {"des": "Sandwiches here are pretty solid, and I have been here a couple of times. The atmosphere is enjoyable, and is a great place for lunch, either take out or dining in. I thought that the sandwiches were reasonably priced and the quality is great. The sandwich combinations are really great, and I would also recommend grabbing a cannoli for some desert.", "pics": null}}, {"review": {"des": "I stopped here for lunch today, as it was close to my hotel and I couldn't resist a good Italian style sub. (In Atlanta, these are pretty much non-existent) I went with the classic Mr. G's with hot peppers and a cannoli. <br><br>The sandwich was really good! Nice and savory with a spicy kick from the hot peppers, and fresh bread soft on the inside and crisp on the outside. The cannoli was great, and I especially loved the cherries on each end. The staff have me a family-owned feel, nice and comfortable. If you dine in, you pay at the end of the meal -- in case you feel like grabbing extra goodies. My only wish was for drink options other than bottled. <br><br>I will definitely return the next time I'm in town! Looking forward to trying some of the other items on the menu.", "pics": null}}, {"review": {"des": "Our company ordered food from here for our monthly staff meeting. The sub sandwiches were outstanding! We got a mix of prosciutto, Italian, tuna, veggie and a few other types of sandwiches. BUT...I have to say my favorite item we received were \"cannoli chips\". They were pre-made, pre-fried empty cannoli shells that you could fill with Graziano's own homemade cannoli filling!! Soooooo delicious! Also...this place is a family restaurant to boot! I think it's been in the family for 3 generations!", "pics": null}}, {"review": {"des": "This is the essence of a family run store/restaurant. It has some of the best Italian meats and I adore their sandwiches and their staff. The proportion of bread to cheese to meat to toppings is spot on! Whenever we're in the area we try to stop in. Would definitely recommend! One of the best sandwich shops!", "pics": null}}, {"review": {"des": "I came here today with a few colleagues and we could not have been happier.  The service, ambiance and food were spot on!  I had the Tuna Sandwich with the giardiniera.  The tuna was made to order- not canned and you can tell.  It wasn't drenched in mayo which I appreciated and the bread was perfect- soft on the inside and crunchy on the outside.  We also ordered a few cannolis for the table and they were divine.  The service was friendly, helpful and professional, I pray this doesn't fall victim to the rising rent prices in the west loop becuase J.P. Graziano's MUST stay.  I will most definitely be back, 5+ Stars!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/xLTSaFrtD-SGYvzJOaPndA/348s.jpg", "caption": "Deli counter"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/KZ011er_TN6-laQi2C_6Sg/168s.jpg", "caption": "Tuna with giardiniera"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/r2PPSAptnUTq5-Rw0qlLyA/168s.jpg", "caption": "Inside view"}]}}, {"review": {"des": "Respect. <br><br>Gotta respect a family run establishment that can hold their own on West Randolph street with the Chevals, Goats and whatever up and comer that has real estate here. So if you love the newer guys on the block, you should still pay homage to a classic.<br><br>I love the friendly feel of the place. <br><br> \"What can I get you sweetheart?\"  Anyplace else a line like that would be super corny, but not here.  I studied the menu beforehand and opted to get a Mr. G and Porchetta to split with my husband. <br><br> \"Everything on it?\"  Why mess with what works.  <br><br>Both sandwiches were delicious.  I would say the Porchetta was my favorite of the two.  I loved the Arugula and the Lemon Caper Aioli--it really enhanced the flavors of the porchetta.  The Ciabatta was a litte too much crusty bread for me, so I made it into an open face sandwich instead.  I wonder if they'll make the same sandwich on the D'Amato Italian Bread...because that bread on the Mr. G was fabulous. The bread was a little crunchy on the outside, but then bit down to a soft chew.  Super fresh and smelled so good.  <br><br>Also, do yourself a favor and try the Italian Cherry Soda drink from their cooler.  It was so tasty and refreshing.  I would love to have bottles of that at home on hand for a pick me up. <br><br>Like others have said, order at the deli counter, grab drinks from the cooler and pay at the \"office window\".   Parking is a bear, but I didn't mind the walk from where I parked a few blocks away.   Tuna.  I think the tuna is the next one I will try.  Thanks JP!", "pics": null}}, {"review": {"des": "Delicious. The team there are always nice, and helpful. Whenever I am town, its my go to lunch location. YUM!", "pics": null}}, {"review": {"des": "Great spot for lunch. Awesome subs. Well worth the price and the wait (at rush lunchtime tine). Can even buy gallon jugs of gardinera.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/yZqzz1CV6tyij_6Am7iq-A/348s.jpg", "caption": "Turkey!"}]}}, {"review": {"des": "Great quality sandwiches. From the meat down to the bread, everything is fresh and high caliber. Relaxing atmosphere. Service is incredible. Owners are super personable and make sure you're happy with what you ordered. Will be coming back again and again.", "pics": null}}, {"review": {"des": "I've been to J.P. Graziano a couple of times and always liked it, but it wasn't until my last visit that I fell flat out in love. Why? Four syllables...giar-din-er-a.<br><br>They make their own and It's pretty undeniable that this pepper mix makes everything better. After I had it on their tuna I was stunned. It adds the perfect spicy kick to any of their sandos and even if it doesn't normally come that way you can custom add. It does come on their house made tuna though, and it's incredible. It ups the status making it about the best I've ever had. <br><br>Also, definitely try Diana's salad. It's a fantastic mix of artichokes, chickpeas, sun dried tomato, and some other seasonings. Prepared in the atmosphere of a super friendly mom and pop shop this place is everything you'd ever want in a quick little lunch.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/TRBvief3m-hqcyGVyn4BfA/168s.jpg", "caption": "Deanna's salad"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ZJPkCnyOO5PKYcVKyAyYBA/168s.jpg", "caption": "Mr. g"}]}}, {"review": {"des": "I just started working in the West Loop and my coworker insisted we grab sandwiches here for lunch yesterday. Oh. My. LAWD. As a native New Yorker, I take Italian delis VERY seriously and this was outstanding. I got the Italian with mild giardiniera and nearly weeped tears of joy at my desk while I ate it. The bread, the meats, the cheeses, the spices, everything was perfect. I will go back and I will run in and scream \"take all my money\" because this is the best italian deli sandwich I've had since I left New York.", "pics": null}}, {"review": {"des": "I went here for my lunch today and I meet the daughter of the owner. Everyone was nice mom was on the register and daughter was taking orders. I was told to ask for Dina when I call in my orders. Loved the sandwich. #Thewindowguy", "pics": null}}, {"review": {"des": "The sandwiches are good but the setup of the space / how you pay is a bit odd and really bottlenecks the whole experience.<br><br>The people who work there are very nice and helpful. <br><br>I would go for lunch again but it's not the best sandwich I've ever had!", "pics": null}}, {"review": {"des": "Great Italian subs! I got the house special and it was perfect, add the Dang soda and I was a happy girl! The customer service was also great, I was waiting on my husband to park and they told me that they would put bread aside for our sandwiches as they were down to 5 loaves and didn't want me to miss out. How considerate!", "pics": null}}, {"review": {"des": "This place is everything that I hoped it would be and more!<br><br>Think amazing assortment of Italian meats, super fresh breads and homemade giardiniera. Combine those all together and multiply the awesomeness by 100.<br><br>Really, really, really fresh ingredients!<br><br>I tried the Spicy which is hot capicola, pepperoni, hot sopresatta, provolone, tomato & lettuce w/ red wine vinegar & oregano. Don't forget to add the hot giardiniera to top it off!<br><br>Really Loved this sandwich and already planning on going back to try the Mr. G (since I've read so many positive reviews about that sandwich on Yelp)", "pics": null}}, {"review": {"des": "I've eaten here a lot, can't count how many times- im sure i have tried almost everything on the menu. Delicious!! This place in my opinion has the best authentic Italian Sub's in Chicago. Yes there is Bari- which is also my favorite- but Jp's is like going home for lunch- the people that run this place are the best, they make you feel like family. I'm a life long customer!", "pics": null}}, {"review": {"des": "Happy time! Sometimes you just want a good Italian or Proscuitto on crusty bread.  This place delivers.<br><br>Small time feel, walk in, order and the counter, pay at the back.  VERY good sandwiches.<br><br>I have each of them on the menu.  I keep going back, I have had the desk at work order here.  <br><br>Their spicy isnt that spicy... and sometimes I would like a touch more meat.  But otherwise, I love it.  Will keep going back happily.", "pics": null}}, {"review": {"des": "We were in the area and stopped in for some sandwiches. Last time we had them for our family picnic and everyone thought they were tasty and unique.<br><br>I wanted to try a different sandwich, so I got the antipasto while my Pops got the classic Mr. G.<br><br>I really liked this sub. Definitely a little lighter than a Mr. G but filled with all the fresh ingredients that combined quite nicely. The peppers, cucumbers, olives and meat combined into a really flavorful sandwich. The D'Amato bread is also quite good. You feel it and think \"Ugh this is going to be way too crunchy!\" But the inside is softer and gives a crusty outside that adds texture to the sandwich.<br><br>The staff has been helpful and very nice to us both times we have been in. Customer service here is stellar.<br><br>Still a little expensive, but definitely a quality sandwich and a unique store.", "pics": null}}, {"review": {"des": "Manna from heaven!! As a kid, growing up in a family that had its own restaurant on Taylor Street, I took great Italian food for granted. Finding good - let alone great, or even excellent - Italian food in the last ten years has been shockingly difficult to find, even in my beautiful city, known for its great Italian fare.<br><br>There are few places in town now that would live up to the high standards of my Aunt Annette, the captain of our family restaurant, and one of the best cooks I've ever known. For big summer family get-togethers, she would supervise the making of giant Italian submarine sandwiches, which would then be cut into smaller servings and everyone would grab a big napkin and a sammie and eat standing up. Each ingredient was carefully curated by Aunt Annette, and everything was the best quality. I've never tasted anything close to this great sandwich... until now.<br><br>From the very first bite, I knew that Graziano's Itallian sub would meet with Aunt Annette's approval. Top-quality Italian deli meats, the freshest tomatoes and lettuce, the perfect blend of Italian herbs and just the right amount of red wine vinegar, all presented on the queen of Italian breads from D'Amato's Bakery, make for the perfect Italian Submarine sandwich.<br><br>Its perfection brings a tear to my eye and a rumble to my stomach. When I make the pilgrimage out to the suburbs, where my dad - a cross between Joe Pesci and Paul Sorvino, and a true Taylor Street Italian - currently resides, I always try to bring him a Graziano's sub. They are the very best of their kind in our fair city, and you'd do yourself a favor to get over to Randolph Street and pick up one - or ten - of these perfectly balanced, top-quality ingredients, amazing Italian sandwiches. There are lots of places that have Italian subs on their menu, and some are pretty good. But none of them - NONE - stand even close to Graziano's in terms of quality, flavor, and superior craftsmanship.<br><br>Graziano's has other subs on their menu, which are also delicious, made with top-quality ingredients, perfectly balanced flavors and lovingly crafted, and I've enjoyed several of them. They also have some great desserts, of which the raspberry bars and cannoli are my favorite.<br><br>Ahhh, now I need one! Gotta go get me one-a them Graziano's subs! See ya there! ;)", "pics": null}}, {"review": {"des": "I've had the sandwiches from Graziano's before and they're great, perfection, actually. The ingredients are all so fresh and high quality. I recently ordered off of the catering menu for a birthday party though, and was super impressed with absolutely everything, from the ease of ordering (with Deanna's help) to pick up, to how literally everyone loved the antipasti tray and sandwich selections!! The sandwiches are cut into a great little size so that people could grab one or two and vegetarians in the group loved the veggie sandwiches and the meat eaters demolished the rest, the Mr G was the biggest hit!! The antipasti tray was overflowing with meats, cheeses and artichoke hearts, olives& roasted eggplant, which were my selections, but I don't think you could possibly go wrong!!! Thx for making my party a success!!!", "pics": null}}, {"review": {"des": "Ordered an Italian sub on uber eats and was exited to try it based on Yelp reviews. I need to agree with the other reviews that are a bit critical of the quantity of meat being delivered and the general tommy satisfaction delivered. <br><br>The reminded me more of a Nola po-boy than a hearty Italian. The bread was crusty but really airy and didn't have much substance. Some like this kind of bread but I like a denser dough. Meat was good but you do only get a single layer of each type of meat and honestly it's not much- see the pic. <br><br>The price is good but definitely not my favorite and I would say this place probably isn't worthy of the 4.5 star rating. Maybe because there just aren't many of these types of joints here in chicago?", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/4i1spNnHJ8-Z1ErswnyMuw/348s.jpg", "caption": "Meat the bread ratio seams off to me. Bread is fairly airy and you will bite right through."}]}}, {"review": {"des": "Amazing subs<br><br>Prosciutto is fresh <br><br>Fresh cannoli with a cherry<br><br>Nice family owned business, friendly staff <br><br>If wanting lunch or a sandwich good quality and quick service I would go here if in west loop", "pics": null}}, {"review": {"des": "Got there 25 minutes before closing. The clerk   said we ran out of bread, no sandwiches.", "pics": null}}, {"review": {"des": "I was blown away by their hospitality, food was also good. Glad we didn't pass them up while we were waiting for our reservation @ a diner down the road.", "pics": null}}, {"review": {"des": "I was not blown away by the 5 star rating.<br>We ordered a four-platter, with a Mr. G, Proscuitto, Artichoke, and Italian. <br><br>3.5: the artichoke was a well-balanced sandwich, with too little meat and the bread was hardly filling. Despite eating a sandwich and half, was starving most of the afternoon. <br><br>3: It tasted too similarly to the artichoke, which quite dampened my enjoyment. Mr G: \"House Specialty! Sharp imported provolone, hot sopresatta, Prosciutto di Parma, Volpi genoa salami, truffle mustard balsamic vinaigrette, hot oil, marinated roman-style artichokes, fresh basil, lettuce w/ red wine vinegar & oregano ...\" <br><br>4: Proscuitto, now this one I would get again. It is definitely the most flavorful of the combination, with the fresh mozzarella and basil really delighting the tongue. Mmmmmm...<br><br>3: Italian, forgettable.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/KRnl-Ol-MN3HbvzMLu54_w/348s.jpg", "caption": "The samplee - Italian, artichoke, Mr G, Proscuitto"}]}}, {"review": {"des": "This is one of those places that is as good as everyone says it is!<br>I noticed it had been in my bookmarks for quite awhile and its only a 3 stop green line train ride from the office. I've always heard about the awesome 9 inch Italian sub so thats what I chose to get. It was very good...actually one of the best Italian subs I've ever had. Didn't take them a long time to prepare even though they had a nice line inside as over 50% of the people waiting had ordered the Italian.<br>They sell cheese and other things here as well hence the term grocery store. They have outside seating on the side of the building so you don't have to order and dash.", "pics": null}}, {"review": {"des": "Wow! From their mouth-watering subs to friendly employees, this place is the real deal. Quality atmosphere  too! I would recommend giving this place a try, would recommend 10/10. I wish there were more locations because it would be an everyday thing but for now I have no problem with making the hour trip for the best Sandwich spot in Illinois!", "pics": null}}, {"review": {"des": "The sandwiches were amazing. However, my entire office ordered delivery, and the handwriting that told us what was what on the sandwich wrappers was completely illegible so we had an interesting time with that. Besides that it would be 5 starts.", "pics": null}}, {"review": {"des": "Probably the best Italian sandwich in the city. Great old school feel in here you order at the counter then pay at a little window that looks like you should be placing a bet at the horse track not buying a sandwich. Everything is made to order which means it's all fresh. We had the Italian and the Mr G, the Italian was packed with meat great balance of lettuce and dressing all served on a real piece of bread crusty on the outside and  soft and chewy on the inside. The Mr G had more condiments artichokes, truffle mustard  it was more about the overall flavor then the meat plus there did not seem to be as much meat. My fav was the Italian Prices are great too big sandwich for 7ish bucks for the Italian and 9ish for the Mr G about the same prices as Jimmy Johns, Subway kinda crap but you get a real sandwich at J.P. Graziano.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/jCOek_SgEVA5Yr0r3ZZxSg/168s.jpg", "caption": "Mr G"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/d2klgflxYPYKy_sCiSxQHA/168s.jpg", "caption": "The Italian"}]}}, {"review": {"des": "I got the spicy sandwich. It's good but a bit expensive for 9 bucks. Nice people though. I might go back but I wouldn't go out of my way for it.", "pics": null}}, {"review": {"des": "Perfect at what they do. Basic sandwiches. No frills. But the bread and meat and cheese is just perfect. Efficient family owned place. Authentic Chicago vibe. Just wish they also offered some chips not made in peanut oil.", "pics": null}}, {"review": {"des": "I love artichokes! So pickled baby artichokes on my Mr. G sandwich definitely made me happy.<br><br>And cannolis.<br><br>My mushroom and sausage soup was better than I expected and hit the spot at the time.<br><br>I don't think you'd go to J.P. Graziano for the ambiance. It's kinda rough. Like, it reminds me of an Italian version of Shameless (Showtime). <br><br>It seems like a family business and everyone works hard.<br><br>You don't really sit down there, but I did. They have two (maybe three) small tables.<br><br>Just to be clear: there's no waiter service.<br><br>1) You order from the manly guys at the sandwich counter.<br>2) You pay at the window in the corner.<br>3) You return to the many guys for your sammy.<br>4) You either sit or go.<br><br>They can take Level Up payments (an app) which definitely caught me off guard. You pay at a window. Like the ticket counter at a movie theater. Or a bookie. There's glass between you and the mother of the place.<br><br>I'm not sure how the grocery store part works. The sandwich part dominates.<br><br>And rightly so because the sandwiches are good. Mine was huge and lasted for two meals.<br><br>It was history. And culture. And yumminess.", "pics": null}}, {"review": {"des": "this is my favorite italian sammie place.  i have been to most of them & i have good reasons.<br><br>-family owned for generations-3 of the ladies working it now.  it's so nice to see them.  they treat you like family too.<br>-all the subs are amazing & fairly priced.  i really like their turkey & imported provolone.  it just does not taste like any other one-it's the cheese & the love.<br>-they have great swag!-i cherish my Mr. G. well fitting t-shirt so i can represent.<br>-the best on every level.  the bread is super fresh.  the meats are amazing.  of course there's the cheese, the giardinara, the simple selection....<br><br>and the love.", "pics": null}}, {"review": {"des": "I was born in Chicago so I always come back. Delicious sandwiches, humungous portions and unbeatable price!", "pics": null}}, {"review": {"des": "Classic Chicago sandwich shop that has been in the family for more than 50 years. I liked my sandwich but it was not hot so I did not love it. I'm rounding up from 3.5 stars because my girlfriend is a huge fan!", "pics": null}}, {"review": {"des": "Pretty good! Full disclosure.......they're not trying to flatter you with ambiance in here, so don't have your expectations too high in that regard. <br><br>However, if you're looking for a solid sandwich and maybe a cup of soup, you're in the right place. They have a couple unique sandwich options and everything is really fresh. I had the Italian and it was very tasty. Not the best I've ever had, but very solid.<br><br>There are only 2-3 small tables if you want to eat there, but this place is really setup for you to get your sandwich and scram!<br><br>You pay for your purchase in a corner at a bookie type booth thing. <br><br>This seems to be a family owned establishment and everyone was very nice and friendly. I would definitely return when I'm in the area.", "pics": null}}, {"review": {"des": "Drove over an hour to come here after seeing them reviewed on Check Please!  Wow!<br><br>Amazing sandwiches! Large and excellent prices - quality and quantity! Try the Italian! Or the Porchetta! Perfect balance of meat, freshest bread, and dressings.<br><br>Service was so friendly and engaging! <br><br>We will be back soon! Thanks for a great lunch!", "pics": null}}, {"review": {"des": "Awesome subs and awesome service! This is staple in the west loop and has been here well before all other restaurants. I recommend  the Italian sub! Happy eating!", "pics": null}}, {"review": {"des": "I consider myself a sandwich connoisseur and I had the best sandwich of my life here! Go with the Mr. G, it's the house specialty for a reason. My boyfriend got the Italian, which is also great! The people who own the place introduced themselves to us; it was awesome and personable. Highly recommend!", "pics": null}}, {"review": {"des": "If I could give this 3.5 stars I would. It's better than average but I wasn't as wowed as I thought I would be given the Yelp reviews and the spot on Chicago's Best awhile back.<br><br>I grabbed a sandwich to go from JPG's - a prosciutto sandwich specifically. Now, not being a fan of tomatoes, I asked them to substitute giardinere instead. But when I got home and dug in, I didn't really notice it - in fact, I think they forgot it altogether (though the sandwich was sans tomato, which was a good thing!). <br><br>The bread was good, the prosciutto could have been a little more robust. I plan to try the place again - I honestly feel a bit like an outcast with the three star review, but I've had better sandwiches at Capri in River Forest, Alpine and Al & Joes.", "pics": null}}, {"review": {"des": "What a great little spot in the heart of some expensive restaurants. Their sandwiches are what jimmy johns should taste like. All their meats and cheese are bursting with flavor. I would like the bread a little softer, but its definitely authentic. they serve these focaccia rolls with cheese and meat stuffed in them. they were an absolute treat and would highly recommend them. I wish they were open a little later than 5, but its more of a lunch place anyways.", "pics": null}}, {"review": {"des": "It was ok nothing out of this world sandwhixh was  have had in Pittsburgh were much better and the bread was hard and didn't seem fresh. Maybe I should come in and eat instead of delivery if I ever go there to eat.", "pics": null}}]}