{"name": "jake-melnicks-corner-tap-chicago-2", "reviews": [{"review": {"des": "Where to start?  Aside from me trying to maintain my \"duke-dom\" this place has a special place in my heart.  Hands down....these are the best wings i've ever had. <br><br>If you intend to be wow'd, do not get anything other  than the FIRECRACKER wings. All flats. Ranch. Carrots.  You're welcome. <br><br>This place has slowey but surely became my favorite dive spot in River North.  Im sure some groovy-hipster will challenge me by saying that some dump in Logan Square is better, but he can take his beanie and mustache and get lost.", "pics": null}}, {"review": {"des": "Great, busy casual large bar ambiance. Said wait would be 35 min. And it only ended up being 20 min. Super!<br><br>Got BBQ nachos. Tasty! A lot of cheese smothered on top. Not a whole lotta pork on the bottom, but twas still good.<br><br>Had traditional medium wings and fireworks (?- Sweet Thai chili and siracha flavor) wings. The fireworks was yummy! The traditional was okay. The recovery burger was decent tasting and huge.  Couldn't finish it all. <br><br>Service was good.", "pics": null}}, {"review": {"des": "I am a hot wing addict and Jake Melnick's is my go-to place. They serve a perfect, classic buffalo wing. The atmosphere inside is spacious, chill, and very conducive to rapid consumption of hot wings. The loaded fries are pretty good and are nice to have alongside your hot wings, especially with the sriracha mayo dipping sauce. The service is sufficient to allow you to eat your hot wings. <br><br>HOT WINGS.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/m89qgcAfAtxrxVBvAiStaQ/348s.jpg", "caption": "Poncho's wings ... a touch of smoky grill flavor. Really solid."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/YeCEF4zLhECjtjf28H1DKw/168s.jpg", "caption": "Traditional Buffalo, Spicy. Classic goodness."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/LM0gRawQJLAVRYqqBVt8iA/168s.jpg", "caption": "Parmesan garlic fries. Ask for sriracha mayo to dip... trust me."}]}}, {"review": {"des": "I am a fan of Jake Melnick's, big time. The place has personality, the food is good and the beers are fantastic. We came in on  a Sunday to stuff our faces really quickly and leave but that is hard to do there. Be prepared to wait as it gets busy, apparently even when the bears are not playing. <br>We had the loaded tater tots, the veggie burger and the boneless wings. Everything was to die for. The food could have been warmer and that is the reason why I took off a star but it was good so I will oversee that flaw. Do I plan on returning? For sure, because the food is good. I just need to make sure that I don't eat for days because the calories will go straight to my tush.", "pics": null}}, {"review": {"des": "Great place to watch a sporting event but it gets really busy. Great bar feeling with lots of televisions. <br><br>We did get a meal but the wings and some other sides.  They are apparently know for their wings but I wasn't a fan. They are battered which isn't my favorite but the problem was they were not crispy at all. The sauces weren't too bad but the buffalo was so greasy from the butter i guess that it was a bit off putting. We also go the fried pickles which were very unique. It appeared to be stacker pickles which were thin and honestly great. <br><br>Over all this isn't a bad place and maybe because of the crazy busy day the wings weren't up to par. I would definitely go back to check it out.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/fmLNr9vW8Kucf0x8HQzlpg/168s.jpg", "caption": "Fried pickles."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/yTId2srM1psm80KJdPTV5Q/168s.jpg", "caption": "Wings"}]}}, {"review": {"des": "A group of us stopped in to have some wings around 3pm Saturday, they were packed.  They gave us an estimated 45 minute wait with 10 parties in front of us. But it's my friend's favorite wing place so we were willing to wait.  On our way to finding somewhere to wait we got our text saying our table was ready. We didn't have to wait more than 15 minutes. <br><br>They have a good sized menu, and basically everything sounded good. I asked for a gluten free menu which was a lot smaller, but still had a good selection. <br><br>I shared an order of 10 boneless wings and ordered sauce on the side.  Thank goodness I did!  I had the Nashville hot chicken, I have a high heat tolerance, but dang these were spicy.  Really good, just a little too much heat for me.  I tried the bbq sauce, it was okay.  I also got a cup of tomato basil soup.  I ate all my soup, but couldn't finish my half of the wings I was so full.<br><br>If you're looking for a good sports bar this is the place to come.  Good food, service, and TVs all other the place.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Ox9m228CB39fhMbif1swSg/168s.jpg", "caption": "Tomato basil soup"}]}}, {"review": {"des": "Minding my business in the cold Windy City! Let me tell you, I'm minding my business and man!!! I see BBQ then I see something about wings. So right away I went into this place, it was late too which was awesome! This place is lively! I mean it's definitely a place you go to have a good cold<br>Beer, wings and BBQ. Needless to say the  wings were absolutely good!!! I enjoyed the various flavors !<br><br>I had the Nashville Hot and that combination was soo damn spicy yet good! The street fries were also excellent, not too mention I also ordered smoked wings that were also soo damn flavorful! I mean off the bone, flavorful!", "pics": null}}, {"review": {"des": "Was up in Chicago for some work training and decided to stop here since it was the nearest sports bar to my hotel. Walked in and was seated immediately, however it took about 10 minutes after being seated for a waiter to come up to the table. Good atmosphere in the place, however every single TV in the place had the exact same game playing. I'd understand if it was showing some Chicago sports team but these were two random teams. I've never been in a sports bar where every TV was playing the exact same thing. In regards to the food, I ordered the \"famous hand breaded tenders\". I'm not sure who claimed these to be famous as they were just your normal chicken tenders. They were pretty large, but for the price I would hope they would be. Fries that came with it had good taste. I was full by the end, so there was plenty of food. Overall, the experience was pretty mediocre.", "pics": null}}, {"review": {"des": "This place gets packed after 7-8pm but absolutely would love to come back and try other delicious food on their menu. The waiter was super friendly and explain things on the menu well when I asked question about the jakes special sauce. <br><br>I ordered the Jake's cheeseburger without the cheese. It was absolutely delicious and full filing with the side of cut fries. I added the jakes special sauce to the burger and damn it is delicious. I also ordered the corn bread and it's delicious. They actually have real corn pieces into the bread would makes it delicious and it's not too sweet but it's too much butter on top in my opinion. The tater tots are not my favorite because there so greasy and it's all I taste in my mouth, grease. My friend got the batter chicken (buffalo) and it's omg heaven. <br><br>Definitely want to come back and get the wings.", "pics": null}}, {"review": {"des": "When you want to eat greasy comfort food, good bbq, drink a beer and watch a game, this place is perfect. After my Wally World-esque adventure at the shitty Harry Caray's we needed a beer....and stat. We got a table pretty quickly even though it was crowded. The guy helping us out was able to switch a couple of tv stations on the monitors facing our table and we were happy campers within minutes. <br><br>A good selection of beers, bbq selections, tater tots, burgers, etc.. you could find lots of things to scratch your itch. Service was excellent and Chicago friendly. <br><br>Killer spot to scream at the tv, get your buzz on and chow down on great comfort food.", "pics": null}}, {"review": {"des": "Salad was good and a large portion.  Brisket was very salty, as though soaked in brine.  <br><br>Our server was extremely grouchy.  Had a perpetual scowl on her face until close to the time to get our bill.  At one point my husband turned to me and says \"She never smiles, does she?\"  I commented that she looked really unhappy.  Maybe she needs a new job if she can't smile at her customers and makes them feel like they're bugging her by being there.  Management needs to do a better job with training her to make her customers feel welcomed there.  Sheesh.<br><br>With all the great restaurants in the area, we'll pass on this one in the future.", "pics": null}}, {"review": {"des": "Came here on a random weekday with my boyfriend! Walking in we noticed it was a cool spot with lots of seating, a large bar area and lots of T.V's. <br><br>I ordered the bone in wing platter (8 wings). Half Nashville Hot and half Traditional Buffalo (spicy). The wings were brought out pretty quickly! The wings were pretty good and I loved how tender the meat was. Also, the wings are fairly large, meaning that they have a lot of meat! The Nashville Hot was pretty good, but I didn't really like how they added pickle slices to the top of it. The pickle juice transferred over to the wings, which I did not like. The Traditional Buffalo Spicy was A-aaamazing! Just the right amount of spice and the sauce was great!<br><br>Now my boyfriend ordered the Ponchos, but they brought out the wrong platter. They gave him the same wings I had ordered (Nashville Hot and Buffalo Spicy). We did not notice the mistake until our waiter came back and handed him the Poncho wings at no cost. He was very apologetic for not having caught the mistake, but made it up by bringing out the right ones at no charge. <br><br>Finally we ordered the Parmesan Garlic Fries. NOT A FAN of these fries. The fries were very overcooked, they were way too hard. Neither my boyfriend or I enjoyed these. <br><br>However, because the wings were great we would probably come back if we find ourselves in the area.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/EWYkbly32eSGiVNTW4dxNg/168s.jpg", "caption": "Parmesan Garlic Fries Not a fan, the fries were overcooked and way too hard!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/EFDdSYQuotPOJhLWM9d3NA/168s.jpg", "caption": "Nashville Hot with pickle slices (left) and Traditional Buffalo Spicy (right)."}]}}, {"review": {"des": "As I continue my tour of Chicago wings, I was excited to try this place.<br><br>Food: The wings are veg meaty here which I like, but the sauces could use improvement. The bbq is not very sweet, but the Buffalo was solid. Also the wings could have been more crispy, but overall I enjoyed them. <br><br>Service: The reason i enjoyed this place and would return is the service was very good. I came with a larger group and there was a party blocked off for half the restaurant. The hostess did a good job of helping get out party sat and our server was on point.<br><br>Overall wings are good but there are better places in Chicago, but a solid place to go with friends to watch sports.", "pics": null}}, {"review": {"des": "Jake Melnick's has been our neighborhood favorite for wings and beer!  My boyfriend and I have been 3 or 4 times now to watch the NBA finals, and now NFL/College football. Huge beer list including one of my favorite breweries (Surly) plus yummy cocktails.  Our most recent favorite items on the menu: Poncho wings, PB&J Thai wings, skillet corn bread, Buffalo Bloody Mary (the regular Bloody Mary tasted a little too shrimp cocktail-y for me). Huge portions for the prices.  You WILL leave stuffed or with leftovers.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/MAL7Zw-6o-PWyKs4qediFg/348s.jpg", "caption": "The bar gets really crowded for Bears games. But I've found it easy to get a table/spot at other times."}]}}, {"review": {"des": "This is our go to place for wings. They are a little pricey but they are located in a pricey neighborhood. <br><br>I always get the poncho wings coated in firecracker sauce. The grilled wings are amazing. They're like nothing I've tried before. They have a subtle smokey flavor. The firecracker sauce is a spicy sweet sauce that pairs perfectly with grilled wings.<br><br>We've dined in and done take out. Both times the wings were amazing. If you're doing take our for a big game they have a really nice system where they set up all the take our orders in the back room. It's very efficient and organized.", "pics": null}}, {"review": {"des": "We arrived into Chicago late on a train ride but it wasn't too late to call it a night just yet. Wanted a quick bite to eat so we wandered over to this place. I don't know about \"best wings in America\" or whatever they claim but they were definitely good. There were more flats than drums, they were large and coated in lots of sauce and came with a good homemade ranch. The spinach dip was just meh. Chips needed some seasoning. Good drink selection but extremely pricey on the cocktails & beers. Service was good. I'd probably come back to eat off the lunch or dinner menu.", "pics": null}}, {"review": {"des": "Really fun nice place casual but nice area. Amazing beer selection, some really unique selections. The food was surprisingly delicious! I thought it was going to be some crappy bar food but the tater tots I ordered were out of this world! You could taste the truffles and it was also very fresh. The skillet corn bread was also very good! <br>The waitresses were super nice and didn't keep bothering us constantly. <br>We sat outside and it was nice and intimate with our group and quiet for good conversation.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/hIfrejXdTYIBshERbpPAjA/348s.jpg", "caption": "Wit bier delicious and citrusy"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/k6AFXGbVEuaK6WDvCkCaWQ/168s.jpg", "caption": "Good wings"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Ug0EZI_vgZs-hr-U0upGMw/168s.jpg", "caption": "Corn bread amazing!!!!!!!"}]}}, {"review": {"des": "We were a party of 6   The beer menu is limited which was a disappointment. We all ordered dinner and various drinks. Server was ok. Nothing spectacular,<br>I ordered a grilled chicken sandwich with blue cheese. Chicken was dry. The fries were bland. The condiments left at the table with the silverware and napkins didn't include salt.  This was a work function for my spouses company. His boss asked everyone about their meals and the answer was a unanimous meh.  Can't  recommend.", "pics": null}}, {"review": {"des": "This is a pretty good spot for chicken wings and 3 Floyds on draft in Streeterville. They have two sidewalk cafe-style patio areas for outdoor eating and drinking, and a full bar and dining room inside. The service was a little slow, but the food came out pretty quickly and everything tasted great. We had boneless chicken wings and a buffalo chicken salad, and a few rounds of 3 Floyds Alpha King.", "pics": null}}, {"review": {"des": "We came here for the Wall of Flame challenge! Luckily it was tax day and they had a few items for $4.17! We started with some fried pickles, which were amazing. The main show was the wings, though! <br><br>I got the combination wings, which included traditional buffalo and cayenne garlic. These were totally fabulous. The cayenne garlic were soooo good. Highly recommend. <br><br>The bf did the flame challenge. Now these were the hottest restaurant wings he's had, but he crushed the challenge in about 10 minutes. Don't take the challenge lightly, though. He eats above and beyond any normal level of spice. He did come out with a cool t-shirt and fireman's helmet! <br><br>4 stars is because the service was pretty slow and the restaurant wasn't super busy.", "pics": null}}, {"review": {"des": "This was our first stop once we landed and got to our hotel. Hungry and thirsty quickly looked up something near by and boom Jake's popped up. <br>Made our way here and got a table for two and started off with some delicious beers. I think I ordered a revolution IPA while my girl grabbed a pineapple something. Both very good. Up next wings!! Their sauce is delicious and the wings so fat a juicy. Very friendly staff and clean. Highly recommend.", "pics": null}}, {"review": {"des": "Best Wings in town. Absolutely excellent. Poncho and spicy buffalo are my fav. The fried Oreos are TO DIE FOR. Parmesan garlic fries delicious.  The only reason I didn't give 5 stars is because the last time I went my poncho wings were overcooked and hard. But other than that I've never had an issue. Will be back again.", "pics": null}}, {"review": {"des": "This was a great sports bar to watch college football games. Had great character and delicious food. Definitely recommend the buffalo chicken sandwich w/ the sweet potatoes fries. Will definitely be back next time in town. Service was excellent!", "pics": null}}, {"review": {"des": "Solid sports bar.<br>My s/o and I popped in here while exploring Chicago for the weekend. We sat at the bar, had a few beers, and tried the ranch fries. Probably not the healthiest choice we made, but they were worth it! If we lived near here I'd bet we'd be regulars. Our bartender was also excellent and very attentive. <br>We'll have to try these world famous wings next time.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Dp4mfOcbIasUgTdfrd050w/348s.jpg", "caption": "Ranch fries"}]}}, {"review": {"des": "To get down to it, really wanted to like this place and the reviews seemed pretty positive for the most part, but it was a let down.  We were there last night for the first time and the vibe of the place was nice but the food was not.  To sum it it, it tasted like microwaved food.  That simple.  Will never go back nor recommend it.", "pics": null}}, {"review": {"des": "Sooooooooo, the wing flavors are no joke and out of this world. If I were only rating the wings, this would be a 5 Star review. <br><br>Traditional wing Flavors ordered at our table: <br>PB&J - Thai peanut served with raspberry jelly<br>Citrus Special - grilled with citrus <br>Poncho's - Grilled Garlic & Cayenne<br>Firecracker - Sweet Thai Chile & Sriracha <br><br>All were delicious, the PB&J was very unique and tasty. Loved the Poncho's too! <br><br>We also ordered a garbage salad which was great. We ordered sweet potato fries and they were served ice cold. <br><br>The reason for the 3 stars was that the service was pretty bad. Took forever to take our order, then forever to get our food. Our waiter must not have submitted the order. To their credit, they did remove the iced tea and the 9.95 order of boneless wings from the tab. . . (I didn't review those because I didn't taste them, but the recipient of those boneless wings was very pleased win his as well)", "pics": null}}, {"review": {"des": "Best wings in Chicago. I've come here so many times and I have treasured every single experience.<br><br>My wing ranking (I've only ever tried traditional bone-in):<br>1. Super Hot. Warning: these are very spicy. Yes, they make my nose run, and yes, I can feel it in my esophagus and stomach but yes, they are oh so delicious. The spiciness doesn't taste artificial: it tastes like they actually chopped up some habaneros in back.<br>2. Traditional Buffalo. A classic. What I get when I'm not quite emotionally and physically prepared for Super Hot.<br>3. Traditional BBQ. If you're in the mood for something sweet.<br>4. Poncho's. Don't remember this one being that flavorful. Maybe my tongue was just numb from Super Hot.<br>5  XXX. Habanero, Ghost Pepper, Scorpion. Perhaps I was also numb, but this one tasted similar in heat to Super Hot. I couldn't taste the flavors though, just the burn. Note that you can order just one wing.<br><br>My fry ranking:<br>1. Parmesan Garlic. I'll give you that they're on the oily side, but I think that's part of what makes them so good.<br>2. Buffalo. I can never get enough Buffalo sauce in my life.<br>3. Breakfast. Eggs, bacon, and cheese. How could you go wrong?<br>4. Street. Spicy BBQ. The heartiest variety.<br><br>If you're wondering about portion sizes, I usually split one order of wings and one order of fries with another person (and don't end up finishing the fries unless we're famished).<br><br>Expect a wait on weekends and, since it's a sports bar, when a big game is on.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/wwy-xvxfy8yWC_a88rE5TQ/348s.jpg", "caption": "super hot wings and buffalo fries"}]}}, {"review": {"des": "I've been hearing a lot of good things about these \"Chicago famous\" wings and when better to give them a run for their money but on a football Sunday. In the first moments on entering, the energy was on high as sports fans were fixated on the TV's all around. They were not very big TV's, but there were plenty of them to make any seat in the restaurant/bar a good spot. The crowd, predominantly male in their 30's-40's is my best guess. Most all decked out in fan gear. Gotta love it!<br><br>I came about 30-min pregame. I should have guessed every seat would be taken! I would have given 5-stars but the hostess was extremely off-putting! Part of the overall restaurant experience in my humble opinion starts the moment you walk in the door (yeah, I'm the person who will walk right out if there is no acknowledgement within the first 5-min or so of getting there) anyhow.... I asked the hostess what my chances were of snagging a solo seat at the bar. Literally her response was \"yeah, good luck at least 4-hours. No one will move until after the games\" ok ok, she might be right, but isn't it her J-O-B to take my name and number and see if there's a seat to accommodate a guest? Hmmm!!<br><br>Well I decided to take my chances and walk around the restaurant. I was able to find a spot that was just waiting for an empty glass and rumpled napkins to be cleared. The server was really sweet and friendly. She promptly got me water and a menu. When I told her I wanted to order up these \"Chicago famous\" wings she directed me to the seasoning options then offered to bring a sample of of a few sauces I was torn between. I decided to go with a split order of Spicy Buffalo (Special Request, Grilled) and the Firecracker which I thought could be too hot but it was more sweet and tangy. They were both on the $MONEY$ excellent!! <br><br>The order only comes with 8 buffalo wings which was a little disappointing because most places seem to come with 10 or 12 to an order but they were still worth the $12.95 price tag. Also, I asked if they can do half orders... the real answer is no, that's not usually something they do but I knew I couldn't eat another full order. I was thrilled that she took my request to the kitchen and they made it possible! It's the things like this that make gals like me want to return, and I most definitely will for more of those firecracker wings! <br><br>As a mere suggestion to management: maybe half orders on wings can become a thing? Please and thank you.", "pics": null}}, {"review": {"des": "Came here for wings, was not disappointed. They have some of the best in Chicago. Big place, so you shouldn't have to wait very long for seating. Okay beer selection too. A bit pricey, but that's to be expected for Chicago.", "pics": null}}, {"review": {"des": "Fun sports bar in river north/Gold Coast area of Chicago. Known for their wings, and they didn't disappoint. We started with the BBQ pork nachos and fried pickles. Would recommend them both. Fried pickles are big pieces and comes with a side of ranch. The nachos have a good ratio of toppings and cheese.<br><br>For wings, we got the buffalo (half spicy, half medium) and the Ponchos seasoned wings (garlic and cayenne). All were good again, but I think I would say the Buffalo medium was the best!<br><br>Fun sports bar atmosphere. Extensive beer list.", "pics": null}}, {"review": {"des": "I came here for lunch during the week. One of my coworkers had suggested it. I ordered the wings and split the flavors 50/50 KC BBQ and  Nashville Hot - Not bad at all.  I also ordered a half order of fries (the portions are huge, good enough for one person). <br><br>Also, I asked the bartender to peel me a lime. That was pretty cool.  No one peels limes, but they did. Check out the photo!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/wiWxdYIyV60EF42UdkSc9w/348s.jpg", "caption": "My peeled lime."}]}}, {"review": {"des": "I'll fill you in on some of the other parts of jake Melnicks Bar, but let's be honest, you're reading this because you hear Jakes offers amazing wings and bbq. <br><br>Atmosphere<br><br>Jake Melnicks is one of those neighborhood hangouts where it's clear that mostly everyone knows everyone else, and the bartenders and waitstaff treat customers, both familiar and unfamiliar, as if they were part of their family. The bar/restaurant is huge and offers multiple tv's great for watching sports. <br><br>Food<br><br>Here's the part you've all been waiting for... the poncho wings are to die for. These wings are grilled and not fried, which makes them more flavorful in my opinion and healthier. These wings are seasoned with love & perfections and are amazing fall off the bone wings. <br><br>There Bbq is here is pretty decent as well. Not the best, but great for bar food. I tried the ribs and pull pork which was very good. Ribs weren't tough and the meat was tender.  Now on the other hand the pull pork was really good. Seasoned well and very tender & moist. Overall i highly recommend the the poncho wings. These wings are hands down the best wings i ever ate. Make sure you get a side of fire cracker sauce to dip them in with a crankshaft beer. Awesome combination. <br><br>Service<br><br>Service at Jake Melnick's is great. The waitstaff is extremely friendly and accommodating. I have no complains at all. Bartenders were awesome. <br><br>The VERDICT.....is in<br><br>Jakes is a quintessential neighborhood hangout and I could easily see myself heading here every Every-time i visit Chicago for a few beers and some killer wings. Jakes is on the right path here. Awesome food selection and amazing beer selection. They have beers we don't have up here in NY and I can't wait to come back and visit again. Jake Melnicks, I'll see you again very soon.<br><br>MUST TRY if you visit Chicago!!!!", "pics": null}}, {"review": {"des": "A great bar right near Michigan Ave, it has a huge bar with good seating and a great beer selection. A large selection of food but everything I've had there has been great!", "pics": null}}, {"review": {"des": "Stopped in to watch some of an NBA game - found the bar full which was to be expected, but was slightly annoyed to see a lot of guests pulled the seats out and we're just gathering in pockets instead of sitting. Put my name down to get a table by myself and was given a 20-30 minute wait but was seated in less than 10 minutes, which was nice. <br><br>I was hoping to grab a bar but while there was a decent mix of options, found the beer list to be underwhelming so I got a mule instead, which was served in a mason jar rather than a regular copper mug. The mule was pretty good, nice ginger beer choice. <br><br>I originally ordered the boneless wing combo. About 20 minutes later, when I would have probably expected my entree to come out, the waiter came to tell me they just ran out of boneless wings  I thought this was a little odd since it was relatively early on a weekday night and everyone raves on wings here, bone in or otherwise. I made a quick switch to the Chinese chicken salad. I didn't have high hopes for the salad originally but thought it was DELICIOUS. The portion was huge, I took half home for lunch. It was fresh, the lettuce was crisp, and the dressing was very tasty - it had a wasabi flavor to it.<br><br>Service here was very slow. Jonathan was the server waiting the section I was in. I sat with an empty glass of water for about 15 minutes after I had asked for a refill, it took 20 minutes from when I ordered for the waiter to let me know they were out of wings, and was not checked on after I got my food until I had been done with my food for quite some time and was waiting to get a box. Even after I asked for a box, I waited another while for him to bring my check. I was here for almost 2 hours from just ordering one drink and a salad - my meter almost expired. <br><br>Overall, I found this place to be ok but was let down in very slow service and original ordering issues. I'd probably lean closer to a 2.5, but my salad was really good. I'm not sure that I'd make any real rush to come back in.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/wwoUw6MOWaO7tA8Ew4uS_A/348s.jpg", "caption": "Chinese chicken salad - surprisingly delicious!"}]}}, {"review": {"des": "THE BEST WINGS EVER! It was crispy on the outside and juicy on the inside. I got the medium buffalo and the garlic wings and they were divine. I loved how the wings were perfectly sauced and not drenched. The flavors were on point and you can wash it down with an ice cold drink with their fully stocked bar. The vibe is super casual and you can watch the game and hang out.", "pics": null}}, {"review": {"des": "Just a neighborhood bar that's super busy around 8p on a Friday, but dies down around 9:30p. Still bursting with energy, but better for finding a table. <br><br>The bartenders Sarah and April are super sweet. Polite, friendly, attentive, but not in an annoying way.<br><br>Got the wing combo which comes with traditional buffalo and poncho flavors; the ponchos are very delicious. Slight kick due to the cayenne, but not excessively spicy. They're very flavorful (asde from the spice). I was told the key is to squeeze the lemon on them. Yum!<br><br>I got a smaller than usual side of mac n cheese for just $2. It's good, could use a bit of salt and I had to send it back to have the cheese melted,  but it was still good.  With the wings you can order other small sides at a lower price (cornbread, fries, beans, onion rings....)<br><br>Came alone, sat at the bar and found folks to be friendly....willing to chat. The couple that was next to me, to my surprise ordered a dessert for me (was the day before my birthday). <br><br>Will definitely return next time I'm in town.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/g1A_qDKN7HKoUZez5qZQbQ/348s.jpg", "caption": "Ice cream & chocolate chip cookie"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/a_WxcPVWEk8p3Fii96ci_w/168s.jpg", "caption": "Mac and cheese. Sent it back to have the cheese melted."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Ygc-Jh3vww_qCrAXFUPgmQ/168s.jpg", "caption": "Combo wings (half traditional, half poncho)"}]}}, {"review": {"des": "FUN, FUN, FUN! What a busy bar. It has such a great atmosphere. We were walking around the city and ended up there for the first time.<br><br>I had the BBQ and Sweet Thai chicken wings - they were good but not the best but it's great that they have boneless option - and shared the Titanic Tots. The titanic tots were so tasty and crunchy and delicious!! The garlic aioli and the truffle oil really takes it to a different level. It is worth a try!<br><br>Our waiter was very friendly and attentive!<br>I'd go back!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/93TjFufhzJnjUvCgEQ4KKw/168s.jpg", "caption": "BBQ boneless wings"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/TMAuqWirmfJqQhhAKxKBtw/168s.jpg", "caption": "Titanic Tots - great to share"}]}}, {"review": {"des": "Fantastic selection of foods and they are proud of their wings which are available in over half a dozen flavors.<br><br>My favorites include:<br><br>1. The loaded baked potato-with chives, cheese and bacon in a large potato;<br>2.  The pig skins..which are HUGE potato skins filled with pulled pork, cheese, scallions...plus BBQ sauce; and<br>3.  The burger is colossal and well dressed!<br><br>The staff is professional and positive and the crowd is always positive, friendly, and interesting.<br><br>FYI-Near the entry way they have a corner area where they sell their swag and BBQ sauce!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/sagqReTdUYB3uhIeFJogpA/348s.jpg", "caption": "Close-Up of Pig Skin=potato skins with cheese, scallions, pulled pork and BBQ sauce!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/7y8gfsgC7dYcapuRYcJisA/168s.jpg", "caption": "Take Out Pig Skins....potato skins with cheese, scallions, pulled pork and BBQ sauce!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/-b4Bqi1m7O7uOu70fra5mA/168s.jpg", "caption": "Included with take out"}]}}, {"review": {"des": "We have enjoyed Jake Melnick's on most of our visits, and I'm definitely willing to write off the one somewhat negative experience in terms of waitstaff attentiveness.  Melnick's is famous for their wings, and has become our favorite place to watch football on Sundays.  We love the Garbage Salad and generally have a difficult time deciding among their wing choices, but have mostly settled on a half order of Poncho and Firecracker.  Both are amazing.  We've also enjoyed the nachos, which come loaded and are almost overwhelming in size.  Of course they are also known for their bbq, but attempting to be at least somewhat healthy, we have yet to explore too much of the BBQ menu.  They have an ample selection of beers by the bottle or on draft, and there's something for everyone.<br><br>I'd like to give a special shout out to April, our favorite server at the bar.  We actually seek her out, as she's incredibly friendly, attentive, and great all around.  Geoff, the General Manager, actively addresses issues and makes sure that things are operating to a high degree of excellence.", "pics": null}}, {"review": {"des": "Food is good, including some of the best wings around - if you're not looking for hot sauce definitely get the Poncho's.  Everything is pretty good, but safest to stick with typical bar food - the BBQ and pizzas are fine but nothing to write home about.<br><br>Lots of TVs to watch sports, though they don't have the MLB package so don't plan to watch baseball if it's not the Cubs or Sox.  Service is friendly and reasonably efficient, but also note that they don't bring your food in \"courses\" so if you order two things - say an appetizer and a main course - they're coming out at the same time.<br><br>Not perfect, but still a good casual option for wings, burgers, and drinks in River North.", "pics": null}}, {"review": {"des": "Everything was so good. Highly recommend, great service, food and beer list. Me and one friend split a cob salad and Wings with a side of titanic Tator tots and bbq chips. Wings are incredible super meaty we got boneless and perfect amount of sauce.", "pics": null}}, {"review": {"des": "It's a great little place to try some fun bar food with a twist. Prices are on par as expected for downtown. <br><br>I got the pbj wings. It wasn't as peanut buttery as I would have hoped but I still finished it all. I wanted to try the breakfast fries but I'm glad I didn't order them. I don't think I would of enjoyed them. <br><br>He got a loaded burger. It was modified to a plain bun since he wanted a something less carby w bacon and an egg on top. Fries were a bit burnt (other reason why I'm glad I didn't get the breakfast fries) but we still devoured it all! We were really hungry and it was one of the few places open that late. <br><br>There were some other fun items on the menu that I wouldn't mind trying next time. Bottoms line is we were hungry. Food Hit the spot. Service was fast.", "pics": null}}, {"review": {"des": "If you're looking for a restaurant with some bomb food and an impressive list of drinks, Jake Melnick's is the place for you! They have a superb food menu, with some of the best wings and burgers in town!! We tried the Poncho's and Firecracker wings which were both sooooo delicious! The Poncho's is a dry wing but it's flavor is so decadent and savory! The Firecracker wings are saucy and spicy! You can't go wrong with either one. We also tried the impossible sliders, Jake Melnick's take on the ever so popular \"can't believe it's not meat\" burger. There is a huge array of taps available as well as some cocktails. All very reasonably price! <br><br>Tip: bring your Northwestern Wildcard for discount on food!", "pics": null}}, {"review": {"des": "Update: I went back to Jake Melnick's today to give another try- and had some of the best chicken wings! They were so juicy, tender, and fresh that I thought I should update my review rating to 5 stars. The wings were just as perfect as I remembered. We ordered traditional spicy buffalo and firecrackers, as well as tator tots. The portions were generous and everything tasted great. The pineapple cider was spot on as well! Much thanks to Geoff who went out of his way to make sure I had the best experience at Jake Melnicks! I will be back before too long for sure.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/XATLH5IImLcwggr8eZev5A/348s.jpg", "caption": "Nachos, wings (firecrackers), and sweet potato fries!"}]}}, {"review": {"des": "If you're in a hurry, don't bother. This place is your quintessential example of sit down, relax and enjoy yourself. Food comes when it's ready and service, at times, serves when its ready too. Not the other way around. I don't mind. When I come to Chicago, my go-to is Jake Melnick's. Not Giordano's, Lou Malnaties or Portillo's. I've never had anything other than their wings. They are out of this world and awesome XXX wings!", "pics": null}}, {"review": {"des": "Walking around aimlessly in Downtown Chicago looking for grub? This is a safe place to stop if you're down for some wings with good flavor, and tasty sides with a small but nice patio to boot. <br><br>This was me, and when I saw Jake Melnick's, I decided to give it a shot.<br><br>There are quite a few different choices to order here, but they're known for their wings. Each order of bone-in wings comes with 8, and you can choose 2 flavors. They have a flavor of the month, but for my first time, I decided to give the Poncho, and Nashville Hot a go. I also opted on my server's recco to get some ranch fries - only issue was there was no way in you know what that I'd be able to eat that whole order. <br><br>Back to the wings - they came out in decent time. They were decent sized wings and the sauce was very flavorful. The Nashville hot came with pickle slices, and the Poncho with a lemon wedge. I appreciated the nice touch and used both with their respective flavors. It didn't disappoint! Fries were ok, just too much to really enjoy lol - but the mayo based sauce was delicious with them. <br><br>If I found myself in Chicago walking around aimlessly for food again - or if I just wanted some good wings - I'd definitely stop back in!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/9_1CRQ3jSOxhfu5TMKWdEA/168s.jpg", "caption": "Ranch Seasoned fries. Tasty sauces on the side."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Rdp5lyOjPDlS1B9SF5mRNw/168s.jpg", "caption": "Nashville Hot and Poncho's Garlic & Cayenne Grilled Wings - both were hits. Would make it hard to try another flavor by passing on these."}]}}, {"review": {"des": "The servers are friendly and helpful. The establishment is clean. The wings are DELICIOUS! And, it's a great atmosphere to watch the game!", "pics": null}}, {"review": {"des": "FOOTBALL!! This bar had every single Sunday football game on each TV. We were afraid we weren't going to find a good place to watch the eagles game on Sunday but Jake Melnicks did not disappoint. <br><br>We walked in and got seated right by the tv that had the eagles game. The waiter was super friendly and accommodating! Since I didn't have my morning coffee, I was really craving some to get my day started. The waiter was more than happy to bring me a fresh cup (surprising at a bar) <br><br>We order the garlic parm fries with the ranch sauce and they were literally the best French fries I have ever had! Perfectly seasoned and crispy and went well with the ranch sauce! Not to mention the portion was HUGE!! <br><br>The bar was super lively since the bears were playing and that made my whole experience even better!! <br><br>I will be back when I'm visiting Chicago again!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/MvShKv4S4aopsXu7lmi14Q/348s.jpg", "caption": "Garlic parm fries"}]}}, {"review": {"des": "Few times am I actually very impressed in restaurants any more. If we go to a high-end spot, we expect good service. If we go to a bar or diner, we expect to get what we pay for.<br><br>I had no idea what to expect when visiting Jake Melnick's for the first time while at a conference downtown recently. To say I came away more than pleased would be an understatement.<br><br>Upon entering, I sat at the bar, was promptly greeted (by Mike and Jake), and offered both water and a bar menu immediately. +1<br>Beer selections were clear, well described, and plentiful. +1<br>Recommendations were made that were friendly, appropriate, and spot on. +1<br>Questions were answered in the same manner about their food offerings and, again, were spot on. +1<br>The food came out quickly, and was hot, fresh, extremely well seasoned and superbly tasty. +1<br><br>I ordered the classic wings combo (spicy buffalo and Pancho's) and couldn't have been more impressed. I'm a buffalo wing aficionado and was extremely excited for the highly touted buffalo wing experience. Boy, was I mistaken! The Pancho wings were so much better and I see why they say they're the #1 seller! Perfectly cooked, supremely seasoned, and stayed hot throughout my dining.<br><br>I also got the buffalo & blue cheese fries and the cookie sundae. The fries were crispy, delicious, and again: seasoned perfectly! The cookie sundae might have been the best part, however! It was warm, cooked to perfection, and the fudge, whipped cream, and vanilla ice cream complemented the cookie so well... yurm.<br><br>The beers were the perfect complement to the meal, and the service remained quick, efficient, and friendly. Next time I'm in Chi-town and want a good bite and service, I'll be back by Jake Melnick's. Great job fellas!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/aGufmSKmZWw2OV0W14Ez4Q/348s.jpg", "caption": "Cookie sundae... just get it"}]}}, {"review": {"des": "This place is really solid! I honestly had a hard time trying to choose what I wanted cause so many things on the menu sounded so good. <br><br>In the end, I went with the broken egg BLT and it was suhhhhhhh good. Guacamole, fried egg, bacon... what's not to love? The tarragon mayo made it even better. The hash browns on the side were awesome as well. <br><br>Overall great place. Would return.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/s_piHoUpdq1q7zlq6jTbGQ/348s.jpg", "caption": "Broken egg BLT"}]}}, {"review": {"des": "Chicago's Best Wings<br><br>Once I walked in I was greeted and seated by the host right away. The server directed me on the right type of wings to choose. The firecracker and the Parmesan Garlic fries. The wings came out five minutes after I ordered them and I was impressed with the time because it was the dinner rush. Overall great customer service and food. When in the Chicago area stop by!", "pics": null}}, {"review": {"des": "This place met my expectations for the wings and nachos. Nobody can top my hometown wings, Memphis, but Jake Melnick's did just THAT!! The traditional buffalo \"medium\" sauce was on POINT! When in Chicago again I will most definitely be visiting this bar. Great atmosphere. Did not disappoint.", "pics": null}}, {"review": {"des": "Chill place with a real laid back vibe. Lots of TVs to watch multiple games. The food was cool . I got the Detroit dog and the loaded baked potato they were decent but not something I would order again. If I do go back I may try the pulled pork it looked good.", "pics": null}}, {"review": {"des": "The wings are decent, but I think it's a bit overhyped.  I also ordered to-go on the Superbowl, so maybe the quality was diminished from the time it was cooked til when I got to eat it.  I'm not a fan of 'jumbo' wings, i'd rather have more normal sized ones, it is usually always crispier.<br><br>Flavors are good, but the texture and crispiness is not.<br><br>We got the following (ranked from best to worst):<br>-Nashville hot: pretty sweet but not terribly spicy as other nashville hots i've tasted, i wanted spicer<br>-Traditional buffalo: it is very traditional nothing special but still solid<br>-Ponchos: grilled with a little kick, it's a 'healthier' alternative<br>-Firecracker: it's very sweet and flavorful, similar to all the other thai wings you taste around the city", "pics": null}}, {"review": {"des": "So what I really wanted was the monthly special of a bacon covered hot dog with a bunch of sauces and other stuff on top. It was 12.95 so I'm sorry, but a hot dog I did not eat and a star has now been lost. <br>I was pleased however to see that there were happy hour specials which included a bunch of five dollar appetizers. I ordered the spinach dip which was OK, the chips weren't particularly great but they weren't terrible either. We also ordered wings, medium and Buffalo and I thought those were fantastic. <br>Cute spot, decent service, and outdoor seating on this pleasant afternoon. But I will go to bed dreaming of that hotdog....", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/cWC7DCj8ExmUSQjhHqz7RA/348s.jpg", "caption": "House Made Spinach & Artichoke Dip"}]}}, {"review": {"des": "The bar is often packed and has a lively atmosphere. If you come during peak hours, prepare to wait a bit.  This is one of the places I take all wingovers when they visit. The wings are large and juicy. My favorite flavor is the firecracker (sweet Thai). I could probably eat these everyday of my life, and even though I'd probably weigh 312lbs, I'd have no regrets. If you are a spice lover, try the XXX wing challenge. They'll give you a fireman hat; if you finish, a free shirt. I cherish my shirt. <br><br>The street fries are a must. Fries topped with pulled pork, cheese, and guac. Heavenly. In fact, all the BBQ is tasty. <br><br>My only gripe. How about a happy hour special every now and then? The beer list is always rotating and they feature some rarer brews, but that perk raises the final bill considerably. To maintain my Jake habit, I had to stop ordering beers with every meal. But that shows my dedication to Jake's.", "pics": null}}, {"review": {"des": "It's all about the wings and fries here, I wouldn't come back for anything else besides these two!<br><br>To get down to the basics, you cannot come here and not have the firecracker wings! I ordered two batches, each for $12.99, and each batch came with 8 wings total. Yes, the wings are pretty expensive for the amount you get- but the taste makes it totally worth it! The firecracker wings had a combination of peanut mixed with honey Thai glaze (one of my favorite combinations). I also tried the Poncho wings which I did not like really, it was more of a simple burnt BBQ taste- with barely any garlic or herbs. <br><br>Although the wings are on the expensive side, the fries and sides totally make up for it. They are super cheap compared to other places and they taste amazing. We tried the sweet potato fries, as well as the buffalo fries with bleu cheese. They were so different and unique, and the buffalo sauce complimented the bleu cheese perfectly.<br><br>The reason why I wouldn't rate this place a 5/5 is because the first batch of wings were sort of cold. Also, although the wings tasted good- they weren't the best I've ever had. I did not enjoy the Poncho wings and I don't think the other flavors on the menu are as enjoyable as the Firecracker. Also, the chips with dip wasn't really good- definitely would not order if I come back. <br><br>I also think it's important to mention that I came with a group of 4 people total, and we ended up only getting 24 wings. Compared to other wing places, usually a group of 4 people needs approximately 7-10 wings each person (because they are smaller). However, with Jake Melnicks that wasn't the case- the sides and wings were more than enough for the entire table.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/tSTG_v2eFh74iyNHLH2emA/168s.jpg", "caption": "Firecracker wings!!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/PDDeLIjxC8gHVe96csvnkQ/168s.jpg", "caption": "Buffalo fries with Bleu cheese! They were delicious, I would highly recommend."}]}}, {"review": {"des": "As of this moment, I think they have the best wings in Chicago. I got the buffalo boneless wings and the bbq boneless as well as garlic Parmesan fries and corn bread. Everything was delicious and all I could ask for in a down n dirty American meal. Seasoning was great and I particularly liked the corn bread with honey butter. Definitely would order again.", "pics": null}}, {"review": {"des": "Quite a solid beer bar with a comprehensive food selection. While there's just about anything you might want, whether burgers, sandwiches, salads, meat platters, apps, or fries, the big draw here is the wings, which come in a number of fiery varieties in addition to your choice of a number of sauces on the side. I especially appreciated the fact that they had boneless wings, as I'm a wimpy type who doesn't like to get my fingers sticky and dirty.<br><br>In addition to the food, the beer selection is extensive and very well-curated. There are about 20 brews on tap and another 20 in cans and bottles. I enjoyed how they had fruity and sour beers when I visited, including the Belgian Meadjito from Crafted Artisan. <br><br>Service was very friendly, helpful, and prompt, and there's a good amount of room to spread out, whether at the bar or at communal tables. It might look like an average pub on the surface, but there's a lot more going for it than meets the eye.", "pics": null}}, {"review": {"des": "I've eaten at Jakes before and have been blown away by their meaty and moist wings. I decided on Sunday I was too tired to walk over and get wings so I used Postmates to place an order. My lord will I never do that again. Absolutely disappointed in the wings delivered. I'm not sure what was going on, but I legitimately received the driest, burnt wings I have ever seen in my life. Pretty much inedible. Could someone please contact me about getting a refund on this delivery because it was terrible.", "pics": null}}, {"review": {"des": "I went there mainly to try the wings and watch some college football.  The wings were, well, fantastic!  Had the buffalo medium's and they were meaty and tasty.  But you know what was better than the wings... the service.  They were \"on point\" all afternoon!  The service was probably the best that I've seen at a busy pub!  On my list of \"must\" go-to's when I'm in Chicago.", "pics": null}}, {"review": {"des": "It's all about the wiiiiings here! Especially the FIRECRACKER. <br><br>So it's been a while since we've been to Jake's and decided to walk in on a Friday night. We were quoted about a 35-45 minute wait for 2 people, and we went to grab a beer at the bar. 15 minutes later, we got a text saying our table was ready. Score!<br><br>It was a nice evening out so the outdoor seating was perfect. The hanging string lights created a well-lit comfortable atmosphere, even when it got darker out. Our waitress, Johanna, was an absolute delight! She was super attentive and friendly. <br><br>As for the food, we ordered the ranch seasoned fries, firecracker wings, the wing of the month (peach bourbon BBQ), and a side of mac & cheese. The bone-in wings come with 8 per order and even though it might not sound like a lot, they're very meaty and filling. Both of the wings  had a ton of flavors! The fries were also solid choice, loved the Jake's secret sauce and sriacha mayo that came with it. And their mac & cheese was a winner. Super cheesy goodness. Our eyes were definitely bigger than our stomach and had to take some of the food home, which we were obviously more than happy to do.<br><br>Nothing bad to say about this laidback spot. Great food & service.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/u0kF6yzhweYcq5i6LKgc1Q/168s.jpg", "caption": "Firecracker wings"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/1rSemOOuYKDflQYJcHwwBQ/168s.jpg", "caption": "Mac & cheese"}]}}, {"review": {"des": "We came here for wings last time we were in town, and we were not disappointed! April was our bartender, and that gal deserves props! She was awesome. She recommended the firecracker wings (sweet Thai chili and sriracha) which are absolutely amazing! We also tried the Poncho's for something different. These were good but the firecracker is hard to beat.<br><br>This is a great sports bar in a great neighborhood. I'll be coming back here every time I'm in town!", "pics": null}}, {"review": {"des": "Jake MeInick's was billed at the greatest hot wing spot in Chicago, and I while I have no authority to make a declaration like that, the wings were some of the best that I have had. Large buckets of very flavorful wings satisfied about every craving that we had and garlic fries were divine. The wings had a great balance of spice, vinegar-bite, and zing all while having crispy skin, moist flesh, and just enough sauce to be tasty but not sloppy. <br><br>We came on a busy night while the Cubs were playing in the playoffs, but we still got excellent service. The decor is exactly what you would expect for a hot wing bar and that makes it all the more inviting. <br><br>Definitely recommend checking it out for anyone looking for wings in Chicago. I look forward to returning myself for another helping of \"Chicagos Greatest Wings\"", "pics": null}}, {"review": {"des": "This is my 3rd time coming to Jakes but my first time doing a review. The wings here are amazing. This time around I tried the Nashville and my friend had the pb & j. I also had a loaded baked potato. The food was once again really good and our waiter was wonderful  and attentive. I will continue to recommend this to my other friends that visit Chicago and I am looking forward to eating here again next month!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/nvS6c3BN9OqithbvNl5Kew/348s.jpg", "caption": "Loaded bake potato"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/6hiWo5GBv_uh0-ShmVCJ9w/168s.jpg", "caption": "Pb and j"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/a4AfGzPzzAXDWyHVGqkJ0g/168s.jpg", "caption": "Spicy and Nashville hot"}]}}, {"review": {"des": "Count me as a regular, my husband & I love this place! We were there on the 2nd of June of 2018 & were thrilled with our waiter & delicious food. 10 out of 10. Jake's will always b a favorite.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/P7xvheJGJrrQIkhSZrqRng/168s.jpg", "caption": "5/11/18"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/VUM2G_KkD8l1yeO2FPmTsQ/168s.jpg", "caption": "06/02/18 Perfect Dining."}]}}, {"review": {"des": "This is a very good place for wings. Service was good. I loved the atmosphere and the outdoor seating area. It isn't without some flaws, the fries were kind of cold and hard to chew, perhaps sitting in the window too long. It really wasn't enough not to recommend this place to anyone who loves Wings and bbq. The XXX sauce is not for green horns. It was very hot...", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/mEAKvg-87PWL8OMKOKYwfg/168s.jpg", "caption": "Nashville hot wings with a side of XXX sauce and Mac Mac Daddy Mac N' Cheese of the Month - BBQ Spaghetti"}]}}, {"review": {"des": "Been here multiple times, most recently after a movie late night. I ordered the bbq stadium nachos and a well drink, and my BF ordered a cheeseburger and beer. Service was great, and food and drinks came out fast. The nachoes were huge, and I took half home for leftovers. They even heated well the next day! It's a great centrally located corner bar that I enjoy frequenting, and I'll be back!", "pics": null}}, {"review": {"des": "Hostess gave us some grief when we wanted to move from the separated room into the main room where all the games were on. Outside of that the rest of the experience was great! <br><br>Rainy dreary Sunday afternoon spent shopping with my girlfriends and needed to refuel. My friends had both heard of Jake's before and had been wanting to come so worked out well. No specials on Sunday. Our server Adam was fantastic very attentive (despite being so busy) and very professional while being friendly. <br><br>My girls got the wings which they loved and I got the turkey Cobb sandwich which is served with fries. You can swap out for the ranch, sweet potato, etc for $2 up charge. Sandwich is cut into four and served on a massive bed of fries!", "pics": null}}, {"review": {"des": "The chicken tender platter is awesome- ask to toss the wings in Buffalo or you'll get sauce on the side. <br><br>The chicken is the best in the city- awesome upscale and not greasy bar food! <br><br>They have delicious and consistent food! The place is very clean and I love the community tables in the bar area!", "pics": null}}, {"review": {"des": "Been here a few times and always pleased with the food, drink, and atmosphere. Three of us stopped on a Saturday night and wanted to sit outside, so we got on the list and found a spot at the bar to wait it out. Bartender introduced himself and his cohorts and our drink order was filled. Friendly staff and plenty to pick from at the bar. After about 20 minutes our table was available, so we settled up at the bar and headed outside.<br><br>We were seated at a good-sized picnic table and our server quickly arrived to get our food order. Two of us got the steak salad with blue cheese vinaigrette. The steak was tender and prepared as ordered, and the vinaigrette is a very interesting light, but zingy flavored dressing. the salad was massive and was a decent mix of greens. My wife got the trio of pork sliders and opted for 1 each of the Carolina, Kansas City, and Georgia style. The Carolina and Georgia are similar, so it might be a good idea to mark them for patrons that are unfamiliar, but I'm a fan of all the types of BBQ, and my wife likes almost all of them as well and these were no exception - all of them were good!<br><br>Big place with a variety of patrons, decent bar food selection, sports bar atmosphere with lots of TV;s, and plenty of drink options. Definitely worth a visit.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/IObzMO7wtxlasKVdajjXGQ/168s.jpg", "caption": "BBQ Pork Sliders"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/yGfDrrNwlQ8m1Iegtn0B2w/168s.jpg", "caption": "Steak Salad"}]}}, {"review": {"des": "My boyfriend and I went here last night in search of the best wings in Chicago!  This place did not disappoint.  We sat at the bar and ordered a few beers, wings, and potato skins.  I loved their great draft beer selection.  They had a lot of seasonal beers which was awesome.  Also looked like they had a lot of fun seasonal cocktails too.  <br>On to the important part, the wings!  I got the traditional wings and they were delicious!  My boyfriend got the poncho wings and wow the flavor was perfect!  I will probably get the poncho wings next time.  The potato skins were yummy as well!  I loved that all the food came out piping hot.  <br>Lastly but just as important, our servers were so nice and attentive.<br>Can't wait to go back here!", "pics": null}}, {"review": {"des": "UPDATE: so I gave this place another shot since it's so close to home. And I'm glad I did! The waiters and waitresses were great! And the food was a lot better! This has become a regular place for me and my husband due to the proximity, late hours, and good food!<br><br>Original review: Other than the wings, food is just okay and I wouldn't go back other than for the wings. Our waitress was clearly not happy to be working that day, so that made things awkward. I have heard good recommendations from this place, so maybe it was just an off day.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Q10IPsRp2lhAzuyGFRCVtw/348s.jpg", "caption": "Bread pudding - really good!"}]}}, {"review": {"des": "The Firecracker and Poncho wing flavors are my favorites! Prices are decent but they do offer a lot of variety of food and drinks for you to choose! the place is pretty spacious and Jake Melnick's Corner Tap is basically a sports bar type of vibe! <br><br>Though it is located downtown, parking can be very hard to find. It is definitely a great place to catch up with friends! the tots were also very delicious! definitely a recommended place to check out! it definitely beats most wings place!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/5ggsH8sK4ThJobY2w0Dnkw/168s.jpg", "caption": "Thai chicken"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/PpYDsquUXRbgnQkf3ZbzoQ/168s.jpg", "caption": "Loaded Titanic Tater Tots"}]}}, {"review": {"des": "Awesome food every time we come! Since we lack a good wing place around the neighborhood, this place is our go-to when we're craving good hearty food. We always order the wings here -- BBQ and garlic are the best flavors. Their Breakfast Fries is delicious, wish we found out about it sooner! I don't know what kind of sauce they drizzle on the fries, but we couldn't put it down. Their ciders and bloody mary's are great. The only thing is it often gets so busy that sometimes it's hard to get your server's attention, and the air can get a little stale if you're deep inside the bar (could use more windows). Otherwise no complaints!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/xOFbnq5biYaWH--1SkZaog/348s.jpg", "caption": "Combo wings on the top, breakfast fries on the bottom (really good!)"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/vLVr2dsQiU7fG6JF_we01w/168s.jpg", "caption": "Happy hour"}]}}, {"review": {"des": "This place is Ahhhmmaaazingg!  Our waiter was very personable and the service was freaky fast!!!  I had the best turkey burger I've ever had.  It was so juicy. The regular fries were just meh, but the ranch fries.......wowwww!  So good!  My fiancé had the wings and they were wings on steroids!  They were huge!!!  My fiancé and I both had leftovers for another meal and prices were very similar to other bbq joints in the city.", "pics": null}}, {"review": {"des": "Fantastic Panchos wings...smoked and then finished on the grill. A bit of dry rub spice for a slow burn. Delicious! And that's quite a compliment, seeing as I'm from Buffalo! <br>Also had the pork sliders with three different types of BBQ sauce. Yum!", "pics": null}}, {"review": {"des": "Jake's is by far my favorite place to eat wings. Though a bit pricey, I feel like they're well worth the money. The poncho wings are absolutely delicious; a bit of garlic and some heat with some ranch/bleu cheese makes them among the best wings I've ever had. One other wing that deserves a mention is the PB&J wing. It's like a peanut satay sauce on a wing with raspberry chipotle. It sounds odd but I think they taste really good together.<br><br>There's also a wing of the month that I make it a point to try often. It's a nice way to experiment with wing flavors while not having it be a permanent fixture on the menu. Most of the times the wings are pretty good but every now and then they get a home run. A while ago they had these Jack and Coke wings that I thought were amazing but haven't been able to try since the month was over.<br><br>The garlic parm fries are also really good and my friends and I get that every time. The drink selection is really large here so there's always something for everyone to drink. If you're looking to try some good wings in Chicago, definitely check this place out.", "pics": null}}, {"review": {"des": "The chicken wings are delicious. However, I've ordered from here twice and been disappointed both times. <br><br>The first time I came in and sat at the bar. I was unimpressed with the service - someone got me water and pointed out who my bartender would be, but she walked past me several times and I ended up being served by two other bartenders. I was really hoping to engage with them about the menu, as this was the day after I moved to Chicago and I was there alone, so I had lots of questions, but I was met with one word answers. One of them got me a sample of a draft beer, then set it down without saying anything and walked away. I had to flag someone down to order a drink and my food. I also had to request my check when I was done. Since I was sitting at the bar, I was just surprised that no one really checked in with me the whole time I was there. (To be fair, I did have a short conversation with a bartender who was doing dishes directly in front of me, but no other engagement.) <br><br>I just placed a delivery order for chicken wings and was very disappointed. Two of the wings were covered in either blue cheese or ranch, even though there was none in the container. They were obviously contaminated before being packed and no one cared. Also, there was a feather on my chicken wing. I am sure that's what it was because I was able to pluck it out. <br><br>I'm sad to say I will likely not return because while the wings are great, both these experiences did not make me feel good about ordering there.", "pics": null}}, {"review": {"des": "I am honestly between a 3 and 4 star rating for Jakes. They got bumped up to 4 stars because they put the Miss Universe pageant on one of the TV's for me to watch during the NFLPro Bowl (which was absolutely awesome). <br><br>We came in here for wings because my friend insisted it is the best she has ever eaten. We ordered the firecracker wings. They were good but not the best ( sorry- not sorry). I did enjoy them but not sure if I would order them again. <br><br>On the other hand HOLY BURGER! We ordered the Jakes Burger of the month which was literally a Big Mac but not just any Big Mac THE MOST AMAZING $16 Big Mac you will ever eat. Not joking ( I was ready to order a second one) MAKE THIS A MENU STAPLE!!!!!! I also requested to sub out the fries for mac and cheese (also phenomenal)  We finished dinner off with fried oreos ( why? I have no idea. we took them home- great for left overs)", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Png9-2TA1tYpgb3Pf4Jgug/168s.jpg", "caption": "Jakes burger of the month (grown up Big Mac )"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/YhgCY68dFbqgCxKMWx00SA/168s.jpg", "caption": "Firecracker wings"}]}}, {"review": {"des": "Ordered Jake's for delivery at work. <br><br>Yep, it's true! They have really good wings. AND salads! I ordered the garbage salad and it was delicious and very filling. We also ordered the buffalo wings and barbecue wings, which were great. Not soggy but a good juicy crisp, which is what I like.<br><br>My coworkers loved their food too. They had the turkey club, barbecue pork sandwich, flatbread and Parmesan fries.<br><br>Order the Parmesan fries, they were amazing!", "pics": null}}, {"review": {"des": "This may be a \"tourist trap\" but I live in Chicago and had the best experience last night. My bartender was April and she was fantastic. Super attentive and all over it, but not pushy or annoying. Food was also great, their wings can't be beat!", "pics": null}}, {"review": {"des": "I enjoyed my experience at Jake Melnick's! I went in with my husband and a couple of friends on a Saturday evening and the wait wasn't too bad. The bar area was a bit stuffy...felt like a window needed to be opened. The hostess was awesome...super friendly! Exactly what I like to see when I enter a food establishment! :) <br><br>For an appetizer, we ordered the Titanic Truffle Tots...omg...those were amazing! They had parmesan, truffle oil, giardinera, and a garlic aioli. SOOOOO GOOD!!!! I would go back for this alone! Haha. <br><br>OK, I am super picky about wings and I kept hearing about how they have award winning wings. We ordered a couple of different flavors. Although the flavors were good, I don't find myself craving these wings. Were they bad...no. Were they my favorite? No. I still hold an establishment on the north shore to be one of my favs and having the best wings. :) <br><br>We also ordered some mac n cheese and chicken tenders. Both really good. The mac and cheese was so yummy!!! <br><br>I loved the ambiance...the service was good...and the food was tasty! Look forward to going back sometime.", "pics": null}}, {"review": {"des": "Hands down the best wings in Chicago. I go here on a regular basis and always get the buffalo jumbo wings. I pair those with the garlic parmesan fries which are a must. <br><br>Only reason I am giving it 4 stars instead of 5 is because I ordered takeout twice and the wings were cold and freezer burnt. Lacked sauce and just not as good as they are when dining in. Every-time I have dined in however, the food was fantastic.", "pics": null}}, {"review": {"des": "We live very close to here so decided to come for some wings since they advertise themselves as having some of the best wings in the city. I got the super hot wings which have a habanero sauce in it. This was decent but grossly overpriced for what you get. They also call them \"jumbo wings\" but truthfully they're just normal sized wings.<br><br>The poncho wings were a serious disappointment though. They're grilled and while I like a good char on my grilled meats as much as the next guy, these were flat out burnt as you can see in the picture.<br><br>The atmosphere of the bar seemed nice for sporting events but go elsewhere for wings. The drinks are relatively expensive too although they do have a big selection of beers.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Rs5EaWsxmjNdQTGfXRS5Qw/348s.jpg", "caption": "Burnt poncho wings."}]}}, {"review": {"des": "I saw Jack's featured on a foodie channel.  Bookmarked it as I knew we were coming to the Windy City for a getaway.  What made it ideal was that Jake's was two blocks away from our hotel.<br><br>Choice of indoor or outdoor seating.  We decided indoors.  <br><br>The three of us went with the combo wings - traditional buffalo wings & the poncho; the BBQ triple play combo platter; the Jake cheeseburger; and the mac&cheese pizza.<br><br>So much food that we took a doggy bag with us even though we didn't have a kitchen.<br><br>Ate the leftover mac&cheese pizza the next morning for breakfast.<br><br>Great friendly service and the food came quickly.", "pics": null}}, {"review": {"des": "A good place to watch NFL on Sunday, especially if your group wants to watch different games. I recommend calling ahead to make a reservation and to specify which game(s) you want to watch. They were very accommodating to our needs. <br><br>We split garbage salad (a surprisingly healthy option for pub food with gigantic portion) and wing combo (Firecracker and Poncho's) between two people and were happily stuffed. Poncho is the only grilled option for wings, which is delicious, although Firecracker is my favorite. <br>Service was attentive. Will definitely be back to try other items on the menu.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/HM_puT45Kyllm3JWj94EVQ/168s.jpg", "caption": "Wing Combo - Poncho's Garlic & Cayenne Grilled Wings and Firecracker"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/h7XDX-OYrVnRWDgYz2-jAw/168s.jpg", "caption": "Garbage Salad, turkey instead of salami with dressing on the side"}]}}, {"review": {"des": "I've been stopping in on Monday's oon my way home from the office and found this to be a great a happy hour spot. I'm a huge fan of the poncho and firecracker wing combo but am looking forward to trying out the new happy hours specials. I like coming here because the staff is super welcoming and knowledgeable of beer and food. My bartender is usually Ashley, who is super nice and I usually find myself hanging out a little later then usual cause she's easy to talk to and always getting me to try new beers! Great atmosphere, great food and a great staff!", "pics": null}}, {"review": {"des": "My husband and i stopped in for dinner was a very nice clean restaurant staff also very friendly and prompt. Good Food Drinks. Nice place For BBQ. Pulled Pork and The Beef Brisket was very good <br>Nacho with Pulled pork Very good.", "pics": null}}, {"review": {"des": "We discovered this place on our last trip to Chicago (our 4th trip in 4 years), and our hotel was nearby. We had a volleyball team of middle-school girls to feed, along with their exhausted hungry parents, and it was our turn to do the coordination and reservations. Everyone was SOOOOO happy with this place. They were able to see 29 of us (yes 29), comfortably. We shared two 8 pound burgers, which were AMAZING. I was not expecting much with a giant burger, but it was surprisingly juicy, moist, and flavorful. And the WINGS...delicious. Next time we're in Chicago, we'll definitely be back, and we've already raved about it to friends heading that way.", "pics": null}}, {"review": {"des": "Monster tator tots are a must get but the portion size is a little small. <br><br>I got the impossible burger sliders as an entree. It was a bit overcooked and dry.", "pics": null}}, {"review": {"des": "Came here with coworker's for a drink, and had a pretty good time! <br><br>DRINKS: I asked the waitress to surprise me with her favorite non-IPA beer, but I don't remember the name of her choice. She described it as a \"light Belgian ale, with a boozy finish\". She promised it was delicious, Which it absolutely was. A coworker ordered the mystery beer, which is a menu gimmick where they bring you a canned beer in a brown paper bag. <br><br>FOOD: We had the pepperoni pizza, some tots, and the super hot wings. We also tried an xxx wing, for good measure ($3 to order just one). The wings were as hot as promised, like super hot. Like don't do it unless you are a real spice person or have lost all feeling in your mouth. And keep in mind, those wings will come back with a vengeance and you will have fire booty. A quick text with my coworkers confirms that this is a universal effect. <br><br>ATMOSPHERE: Affordable place in the area, which we all know is rare. There was a car alarm going off the whole night, and anytime it would stop, the entire outside area would begin to clap and cheer. <br><br>This is a reasonable place that doesn't take itself to seriously.", "pics": null}}, {"review": {"des": "Food was amazing.. Chicken wings were juicy and tender. Place was happening.. Fun place to dine with groups over the weekend. Waitperson was very pleasant in manner.", "pics": null}}, {"review": {"des": "Their claim to fame is their wings but, to be honest, everything I've tried on this menu is delicious. I've been here twice in one week and everything was so satisfying. <br><br>What I've Had:<br>BBQ Pork Nachos - deliciously flavored pork with loaded nachos. What's not to love? Definitely makes an amazing appetizer to share.<br><br>Street Style Fries - again, deliciously flavored pork and loaded French fries. The cheese sauce was so gooey and perfect. Every fry was covered in something delicious and amazing. <br><br>Wing Combo - the traditional wings had just enough heat to make me melt with happiness. I love a good buffalo wing and these hit the spot. So perfect. So yummy. The standard all buffalo wings should be held to. And the Poncho's were also delicious. The garlic and cayenne made for a great flavor combination. <br><br>Mac and Cheese of the Month: Go for it! When I went, they had a Pizza Mac. So it was a pizza with Mac and cheese on it. So good. The cheese was so cheesy. And it reheated well because I took home leftovers. Because the portion was huge! <br><br>Grab bag beer: for $5, you can't go wrong. The waiter just grabs a can of beer and sticks it in a brown paper bag. I got to try a new brewery which was fun!<br><br>Overall, I definitely think this place is worth it. Great food. Great location near the Mag Mile. And great vibe. They have TVs everywhere to watch the game (whatever game is on!) but they're not too loud so you can still talk to whoever you're with.", "pics": null}}, {"review": {"des": "Jake Melnick's was such a great place to stop and grab something to eat after going to the Christkindl Market downtown! I got the barbecue sliders which were yummy because each one is a different style from a different region of the country. My favorite was probably the Carolina! <br><br>My boyfriend got some of their wings and fries, and the fries were oh so good. We finished off our dinner with their cookie sundae dessert pictured below, and there were no words for it  but YUM.", "pics": null}}, {"review": {"des": "Jake Melnicks is amazing. The service is excellent and the food is superb! <br><br>Started off with the street fries as an appetizer. What's a more perfect starter than fries right? They had so many different flavors I didn't know which ones to try our server was very helpful in my decision the street fries were perfect! Cheesey and the right amounts of all ingredients. At first I was hesitant because it had siracha but it was a great choice not too spicy. Then we ordered a chopped salad it had a tomato vinagrett it was huge. Me and my boy friend shared the salad and we ordered wings fire cracker and traditional. The wings were perfect the seasoning and texture was right.<br><br>After we ate all that food I talked about earlier lol... our waitress asked us if we wanted desert. I was hesitant because I didn't think I could eat anymore. She recommended the fried Oreos they sounded good so I say why not! The fried Oreos came in 6 pieces with ice cream it was a hit! It was nicely presented and a satisfying portion only ate half the ice cream was excellent and it was drizzled in chocolate! <br><br>As I said earlier Jake Melnicks is amazing! The food is superb and the customer service is excellent. I will come back and I recommend Jake Melnicks to any of my fellow wing lovers!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/eZRJUOrBWA05eiqxnY4VUQ/348s.jpg", "caption": "Pork Nachos"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/P-ZNOTancpBLq-VQsjYACw/168s.jpg", "caption": "Cobb Salad"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/KRmvSdKxImKTWnNmbGa-UA/168s.jpg", "caption": "Wings"}]}}, {"review": {"des": "House made black bean burger patty? Check. Thai peanut sriracha wings? Check. Rustic, house made fries? Check. Asked the chef to make sriracha mayo for me... He exceeded my expectations. House made shandy? Check. My first sampling of mead. A proper Belgian trippel. Favorite discovery in YEARS. I will be back.", "pics": null}}, {"review": {"des": "Honest review:not my fav i love wings and honestly thought the wings at bdubs was better because the wings here were ok there wasnt any i would be like wow amaizing idc that their more expensive but bdubs is more cheaper though if u have any recommendations for a wing place tell me n ill try it ( u can do a wing combo to try different kind of wings). service: the service was amaizing. Our waiter was really knowledgeable and really nice. She checked up on us often, and gave good recommendations. Ambiance: its really homey in side even though its a bar doesnt look like a cheap one. Its a good hangout spot.<br><br>Street fries 10.95: not my favorite. The actual fries werent seasoned, and werent crispy. There was alot of pulled pork, the taste of it was okay i had better. There was guac that was nice and acidic which cut through the richness. The cheese sauce was amaizin so rich plz put more n melted cheese on top would be nice to. I liked the jalapeños jus needed more had to put hot sauce on it <br><br>Panchos 12.95$ these were good. I liked that it was grilled, loved the smokey flavor that it adds. I liked the lemon that cut through the richness. Only thing is the wings didnt have much seasoning on it which is a bummer a jerk seasoning on it would make these amaizing<br><br>Pb And J $12.95: these were really interesting. The wings are coated in this savory peanut sauce which makes it really tastey. You have to mix it with the jelly to get that perfect sweet and salty combination! The jelly was so good only thing wish there was some heat in it <br><br>Supper hot 13.95$ (be warned these are spicy) i loved the heat!! Its sneaky like u dont get it right away then it hits you and ur like dieing. Only thing which there was more flavor besides just being spicy<br><br>Bbq duck 14.95: werent cripsy at all. I love duck but these wings werent that good. I could taste the subtle beer flavor, but these just really tasted like normal bbq wings. There was no wow factor.<br><br>Apricot siracha 13:95 amaizing! Best wings of the night i love sweet n spicy amaizin combination. There not supper sweet. I loved the addition of the blue cheese makes it even better only complaint is that it needed to be spicyer<br><br>Wing texture: i love really crispy wings and none of them were that crispy that is sad", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/M5lxT0wiJfcCfOwupdBNBg/348s.jpg", "caption": "Front"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/92iP0hZbY_jKMup9HBtbbQ/168s.jpg", "caption": "They do valley"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/MuzCiR47oq6iPCCrJJu3yQ/168s.jpg", "caption": "Specials"}]}}, {"review": {"des": "Food was a 4, service was a 2. Hubs had the PB&J wings and I had a bowl of chili. I probably should have gone with something else. We started with the onion ring appetizer and they were very greasy. It's so close to our place, we will come back. Will sit at the bar next time as I think the service is better there.", "pics": null}}, {"review": {"des": "We stopped in here cause the sign says best wings in Chicago. Can't go wrong with that?. Well they are definitely damn good wings and I'm am wanting more. I had the orange bourbon wings, and they were the best wings I have had. So juicy and full of flavor. I made quit a mess of myself destroying these jumbo meaty wings. <br>We were here a little after 1 on a Tuesday so it was quiet, the staff were very attentive and the service was great. <br>The selection of craft beer, along with some very rare choices made this visit perfect. It's a shame we waited to the last day of our trip to drop in. Next time I'm up that way, I will make a point to get back for some wings and beer.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/1HZMOg405UxgEmvIhDLvow/348s.jpg", "caption": "Lost Abbey Angels share 2015 reserve."}]}}]}