{"name": "janiks-cafe-chicago-2", "reviews": [{"review": {"des": "This is a great diner with a lot of delicious dishes. The variety of what they offer is very surprising, but I would try anything there, because they really know what they are doing in the kitchen. <br>And there's something for everyone on their amazing menu! <br>The service is excellent and it's a very comfortable spot.<br>They deliver too!! <br>Plus, I'm proud to eat there because they care very much about the people they hire! <br>You should definitely try Janik's! You won't be sorry!", "pics": null}}, {"review": {"des": "Verdict: really good food and good prices<br><br>Atmosphere / decor - 4<br>Service - 3.5<br>Food - 4<br>Value - 4<br><br>Overall 4<br><br>I LOVE the chilaquiles. The huevos rancheros are also good (they even earned approval from my picky mother). They have such a wide selection of food that it's great for everyone (from Nutella stuffed pancakes, eggs Benedict, polish sausage hash, and breakfast bowls to lunch). My dad never had eggs Benedict before-he got the latin style which came with plantains and black beans. Delicious! <br><br>Mimosas aren't great, I wouldn't get them again. They have other drink specials that are good though!", "pics": null}}, {"review": {"des": "The reviews are so misleading. I've been planning to try this place it was a miss for me. The staff was okay the overall experience was mediocre, nothing special. The food was definitely not to impress. That waffle was eggy or not fully cooked, I asked for over medium eggs seems like they made them over easy. Bacon was over cooked hard not crispy. I liked the menu prices not bad but the food wasn't good to me and I ordered something safe. My bf had an omelette and potatoes he enjoyed it.<br><br>Overall, I do not recommend and I will not return.", "pics": null}}, {"review": {"des": "Janik's is a great neighborhood dinner for classic breakfast/brunch.  Service was prompt and friendly, and it has a homey vibe - reminds me of home cooking.  Food was enjoyable, just missing something distinguishable from other places that serve similar types of food.  It's a perfectly safe, everyday spot for locals, and you can see that with the crowd.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/EEz-lqBK5V-SCJu_nJBszQ/348s.jpg", "caption": "Belgium Waffle and Chicken Lime Soup (bowl)"}]}}, {"review": {"des": "Ordered the chilequiles w/ chorizo, was good & very flavorful but a little on the salty side but didn't mind it too much. Maybe next time I'll get it with a diff protein. Also, would suggest more chips. It was a good portion, shared with my BF. We then ordered the Nutella banana French toast which was soooooo good. I also got a mocha latte which I was delighted it tasted like hot chocolate.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/D7wfls6nhCxHr21xK-CQIw/168s.jpg", "caption": "Chilequiles"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/aoW0Oqus9my0CcVuoGrnhQ/168s.jpg", "caption": "Banana Nutella French toast"}]}}, {"review": {"des": "Without a doubt this is the best breakfast I've eaten while In Chicago. I am so blown away by how delicious everything on my plate has been. Blown completely away. I got the meat lovers omelet and substituted the ham for shrimp and the shrimp is so big and fresh and sets the entire omelet off!  I'm enjoying this so much I'm sad about leaving town tomorrow. The coffee is great, strong and hearty and the custard Nutella stuffed croissant is so goood too! Wow", "pics": null}}, {"review": {"des": "Such a cute cafe, a bit divey in a good way. We came for brunch, started with a bloody marry which tasted great. I do wish they had better garnish for the drink instead of just one celery stock. <br>I got the crab cake gourmet Benedict and my boyfriend got the fried chicken and gravy Benedict. Both were delicious, the fried chicken Benedict was better. The chicken was cut thin, very juicy and the gravy is just perfect. <br>We had a great time, definitively a perfect place for breakfast/brunch.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/OGMexIZ8pK8GrYPGaLm7eA/348s.jpg", "caption": "Crab cake gourmet Benedict and fried chicken Benedict!"}]}}, {"review": {"des": "I loved the customer service here. I visited this nice place on a Saturday morning for brunch with a good friend of mine. Upon waiting, I was greeted four times by four different individuals checking on me. The staff is well knowledgeable about the menu and if the pricing isn't right, they'll be sure to let you know. I ordered the Latin Benedict and it was sure not to disappoint. My friend and I also ordered the large Pitcher of mimosas for $20 which can make 5-6 glasses worth. <br>The Latin Benedict is a large dish. The black beans were overly sweet and that caught me off guard. The rice was bland but together they encompasses a nice flavor. The Benedict itself outdid itself. It was a nice portion size and the layers fit well together. There was beef topped with peppers topped with a plantain, egg and hollandaise sauce. It was so good I finished the entire dish in one sitting which normally doesn't happen when I get a Benedict. The aesthetic of the place gives off a home vibe. There is lots of space both inside and out. The staff is sure to please and make sure you're not left without.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/hjgf0zHWh_2jL3PnLI-gcQ/168s.jpg", "caption": "Latin Benedict"}]}}, {"review": {"des": "Ordered the Belgian waffle combo and a brownie through Amazon restaurant. <br><br>The over-medium eggs were cooked to order and the brownie was delicious too. The waffle, while not crisp due to it being a delivery, very good. <br><br>You get what you ordered. Not much else to say. <br><br>Oh, crispy bacon. :)", "pics": null}}, {"review": {"des": "Mike was great. Attentive, professional and clean.  Very sweet to my dog too. A pleasure to meet during our breakfast.<br><br>Breakfast bowl was full of potatoes ...a bit too much and too little of other things...the eggs were not impressive. The pancake, OK.<br><br>Coffee fine. lately i'm getting tired of the snobbery and poor execution of espresso making at most shops...refreshing to have a normal barbershop type of coffee.", "pics": null}}, {"review": {"des": "Best waffle I've ever had! I added Nutella and bananas to it, and I was in heaven. <br><br>I wasn't a huge fan of the seat yourself approach when the place was packed to the rim. The server noticed we were having trouble finding an actual open seat, and pointed to seats at a table with another couple, which was a little weird for me, but whatever. <br><br>I'll come back just for the waffle!", "pics": null}}, {"review": {"des": "I've never heard of or seen this place before today. I was sitting in a meeting hungry. Ordered on Door Dash because the picture of the breakfast burrito bowl looked tasty. Added crab cakes. This is so good and comfy bon this chilly day! Wonderful chance I took on this food today! The order arrived in 25 mins. Not bad at all! I will find this place and add it to the dine-in date experience!", "pics": null}}, {"review": {"des": "I love Janik's. They do a great job with a standard breakfast but have lots of interesting options. Hint: add bacon and avocado to the breakfast quesadilla- it's delicious and plenty for two. I recently had lunch there and it was good too. Prices are extremely reasonable. I think this is the best breakfast place in Wicker Park", "pics": null}}, {"review": {"des": "Great diner-type menu on Division with patio seating. Today I got the breakfast bowl (eggs your way, potatoes, black beans, pico de gallo, onions, peppers, and jack and cheddar cheese) and my boyfriend got the Greek salad in a wrap with chicken (served with pasta salad). Then we shared the Pancake Combo (two buttermilk pancakes, 2 pieces of bacon, a sausage patty, and eggs your way). Everything was delicious and inexpensive. Wonderful service!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/rgDuXcyVpOFH0q3Hf7Fs7g/348s.jpg", "caption": "The breakfast bowl (eggs your way, black beans, potatoes, onions, peppers, jack and cheddar cheese, and pico de gallo)"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/C8QLerWeC60skYF2xuWk2Q/168s.jpg", "caption": "The Pancake Two Buttermilk Pancake Combo All Day Breakfast"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/0-9CVl5_O5toq6HgMHnPPQ/168s.jpg", "caption": "Greek salad wrap with chicken and pasta salad on the side"}]}}, {"review": {"des": "Great food, best g menu, super reasonably priced! Mimosas and bloody marys are $6 and big. Pancakes and eggs are amazing, didn't love the parfait but it was worth the money if you're into a more tart taste - they really give you a lot of yogurt and toppings, not enough granola. It's a bigger restaurant so you'll get a spot but it's very popular and always crowded. The service is slow, totally polite and they try to be attentive but it seems like they never have enough staff working. Maybe that's how they keep the prices good. Worth a visit for sure overall", "pics": null}}, {"review": {"des": "BEST PLACE TO EAT BREAKFAST IN WICKER PARK! From Virginia and visited Chicago back in November 2017. Ate breakfast here about 3 times it was so good! Belgian waffles breakfast was my favorite! 10/10 recommend.<br><br>Walk-in seating. As a southerner, it's a little crowded but was expected being in the city. Pricing was fair. Friendly staff, great food, and fast service!", "pics": null}}, {"review": {"des": "I had a really great takeout experience here not too long away while I was visiting my girlfriend who moved here for work. While my girlfriend was at work, I ended helping her apartment mate move in and needed to grab a quick lunch. Freaking amazing decision if I don't say so myself.<br><br>I ended up ordering their Honey Sriracha Fried Chicken On A Biscuit, but I was really conflicted between their pasta salad and mac & cheese. The woman manning the counter was super nice though and gave a sample of their pasta salad after I chose mac & cheese. Honestly should have gone with the mac & cheese because that shiz was the best pasta salad I've ever had!", "pics": null}}, {"review": {"des": "Goregous Saturday 10ish am, so of course majority of the people also dinning were sitting outside. <br><br>We were told we could pick a seat anywhere. As you show up, they have a \"tent\" area in front of cafe with tables for people to sit. <br><br>- Cute decor/atmosphere <br>- speedy service <br>- I liked how they brought out waters and came by to refill.<br>- Coffee was being refilled constantly. I ordered a regular coffee but they also had the option to add syrup flavors. They offered 1-2 sugar free flavors. <br>- Pancakes are nice and fluffy and big and thick.<br>- Nice size menu options <br>- Prices are reasonable <br>- They picked up any unused plates which I appreciate.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/NWhSwGx-KX-4a-_gNUWYPQ/168s.jpg", "caption": "Nutella + banana Pancakes. With a side of 2 eggs"}]}}, {"review": {"des": "My husband and I have been going here for almost 4 years. We love this family run brunch spot. Lots of yummy variety for lunch and breakfast. Plus great prices. The staff remembers us and is super friendly. <br>We will miss this gem!", "pics": null}}, {"review": {"des": "Have been for lunch and breakfast many times but just tried catering for my daughter's second birthday and I was so impressed. We usually get goddess and grocer for parties but this was truly \"made to order\" with more variety and price points than G&G; and I placed order and got all updates on line! Food was just as good as when you dine-in and Felipa and team were helpful. Will use again for larger parties too.", "pics": null}}, {"review": {"des": "I always have Janik's delivered to my work! I love their salads and also lately have tried the buffalo chicken wrap which comes with pasta salad! Not the fastest delivery option but it has become my go to! The freshness has motivated me to order it again and again! I hope to actually stop in to the cafe sometime soon!", "pics": null}}, {"review": {"des": "My out of town boyfriend wanted brunch with fluffy waffles. So I turned to yelp and found this gem. Just looking at the Belgium waffle pictures, you can tell this place will deliver on the fluff.<br><br>My group ordered<br>-Belgium waffle combo $9.something<br>-Ham Benedict $9.25<br>-Veggie scramble<br>-Breakfast bowl<br>-Coffee $2.50<br><br>All in all, a solid place for brunch. Service was fast and attentive for coffee refills. Food came out pretty prompt. And you can easily split checks at the end! Can't ask for anything more.<br><br>I thought the ham benedict would come like canadian bacon - but it was legitly ham. Was surprised but it was still tasty. Can't complain. And the boyfriend was very happy with the waffles.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/KMOOoZjYN9ONLpeZ0ydgwQ/348s.jpg", "caption": "Ham benedict $9.75"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/hbNOMOWfBVIPwfSsReOKpA/168s.jpg", "caption": "veggie Scramble"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ds7H_5WGSG79mIcP0HaKIA/168s.jpg", "caption": "Breakfast bowl"}]}}, {"review": {"des": "My brother raved about this place. Meh! Go to Yolk more food less costly. And not sitting at Card Tables. Now to the food it was good banana pancakes and huevos ranchero both tasty. And art work on the walls captures your attention. Three stars for cost good but not great food. And sitting at a card table.", "pics": null}}, {"review": {"des": "Great food - generous portions. My husband has the chorizo omelette and paid $1 extra for a side pancake. Completely worth the up-charge if you see in the mood for something sweet. I had the breakfast bowl and added polish sausage. Delicious and there is enough food for two more breakfasts this week. <br><br>Mimosas and bloody Mary's are $6 each. I'll be back to try the Bailey's milk shake. Neighborhood gem!", "pics": null}}, {"review": {"des": "Service has improved greatly and food continues to be of high quality. Great place for lunch or brunch.", "pics": null}}, {"review": {"des": "This place wild af. The corn beef hash dank.<br><br>My only complaint is that they give u way too much food...I had to unbutton my pants as i left", "pics": null}}, {"review": {"des": "Duuuude. Right after my doctor's appointment yesterday, I was craving eggs benedict and suddenly opened yelp to help me find a very nice breakfast place that is still open. Finally Janik's cafe popped up and with hundred of 5 star reviews, i finally found my feet rushing to this restaurant. I know we came in around 3:15 and restaurant is already closing in 45mins but that's no excuse to give us lame service like servers dont wanna check on us anymore. But I understand. Anyway, I ordered eggs benedict and Good Lord the english muffins were hard as a rock. Like you can't cut it in half hard. You can't even chew it hard. I even bended the fork while trying to cut it! So i ordered a side of english muffins to change the one that I had on my benedicts. But by the time they gave me the side muffins, I already lost my appetite cos it took them 8mins to toast it. The waffles were amazing! Like really really good if only it wasn't served to us cold. It's so frustrating.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/TvWWCsfakKlVfGXqgGNHXA/348s.jpg", "caption": "Yeah. Couln't finish it anymore. But it was good tho."}]}}, {"review": {"des": "Janiks is the best place to get breakfast hands down. Me and my girlfriend come here often enough for the waitress to recognize us!<br><br>The corned beef hash is delicious and super filling for the price. My girlfriend always gets the eggs benedict and you know a breakfast place is good when they can master eggs benedict. Last but not least, Janiks potatoes are delicious! Especially with the spicy ketchup they have.", "pics": null}}, {"review": {"des": "Found this place thanks to Yelp as I had wanted a late breakfast/early lunch.  <br><br>Decided to order something different so had their eggs, polish sausage, sauerkraut, and potato platter.....really good!<br><br>Bottomless cups of coffee too....<br><br>Do check this place out if you are looking for a locally-owned place in one of the trendy neighborhoods of Chicago.<br><br>I also noted they serve mixed drinks too so even more of a reason for one to go.", "pics": null}}, {"review": {"des": "This is my favorite place I recommend all the food on The menu So much to choose from and everything is so good service is great very friendly and professional they deliver fast and very reasonable prices i've been eating here often for a long time I love everything keep it up I highly recommend this place over any other place in the area", "pics": null}}, {"review": {"des": "Waiter always check up on you for your needs. Ordering was fast and came out fast.<br><br>The food is really seasoned and full of taste. It made my mouth watery and how often can one say that to the food they're going to eat? Will definitely come back.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/-GcH2YUCTbHJrDKDATdwwA/348s.jpg", "caption": "Breakfast bowl"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/5a5spIiV-jP17BgWqmSpcQ/168s.jpg", "caption": "Chocolate brownie vanilla ice cream mini celebration"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/y1e89P5vxmYZzdIHVgNEvQ/168s.jpg", "caption": "Two eggs and Steak! It's delicious."}]}}, {"review": {"des": "I ordered the veggie omelet ! It was very filling . Place was pretty good &  customer service is great . Our server was very attentive and answer all our questions about the menu.", "pics": null}}, {"review": {"des": "How I long for warmer weather and a pitcher of mimosas on the patio in front of Janik's!<br><br>They have an ENORMOUS menu with basically all kinds of classic American diner food, mixed with Mexican favorites. The crab cake Benedict is so good, as is the chicken tortilla soup, the chocolate chips, and the DRINKS!!! Everything on the menu is super affordable and huge portions, so come hungry but don't stress about your bank account.", "pics": null}}, {"review": {"des": "Have eaten here twice and and have enjoyed my meal both times.<br><br>The first time I had the chicken and waffles and they were good. The chicken was nice and crispy but also tender and moist. <br><br>The second visit I had the Latin Benedict. This was awesome because it has a nice combination of flavors. The sweet plains really add to it!<br><br>Service is standard, prep time is normal, food is good, prices are fine. I can only make it there I'm working from home or not at work as they close by the time I am leaving the office. Definitely worth a visit if you havent tried.", "pics": null}}, {"review": {"des": "This review is for a delivery order. <br><br>I was really excited to try Janik's, when I finally got some time to order in, this was the first place on my list. I ordered the turkey, bacon, avocado sandwich on sourdough bread ($9.50) and the Nutella and custard croissant ($4.50). I initially ordered the two egg breakfast sandwich but the restaurant said they were out. This was rather confusing since I assumed it was a very popular choice at a mainly breakfast/brunch cafe. However, no biggie, I was still excited for my TBA sandwich. <br><br>I absolutely LOVE sourdough bread, it is always my top choice for sandwiches. This place gives you a whole bunch of choices for bread, including, croissant, brioche, english muffin, etc... The first thing i noticed about my sandwich was that it was not on sourdough bread. It looked like basic white sandwich bread you buy packaged in the bread aisle. It was also a bit stale/dry, like it has been sitting around for a while. Furthermore, they did not toast the bread, which was a bummer to me. The filling of the sandwich was decent. Everything was in a good ratio and I was able to get a bite of all the ingredients in each bite. The bacon was crispy and the avocado was fresh. However, I thought there was too much mayo and mustard, as it was dripping out of my sandwich with every bite I took. The sandwich came with a choice of side (pasta salad, potato salad, or chips), I choose potato salad. The potato salad was probably the best part of the meal. It was chunky, creamy and well seasoned. <br><br>Maybe it was because I ordered delivery, but the Nutella custard sandwich did not come warm. The description said that it came with strawberries, but there was only one strawberry in the box. The croissant was not as flaky or buttery as I would expected but it was a generous portion for less than $5. The custard comes on the side (more like a dip) which was also a surprise to me, I thought it would be with the Nutella in the sandwich. <br><br>I am not sure if I will order either of these items again. However, I am hoping to have better luck with their breakfast items, if I decide to order from them again. They definitely fell short of my exceptions, mediocre at best.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/u7V7xHtAiPcePZCcJd4nLg/168s.jpg", "caption": "Nutella Custard Croissant"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/CWVjiUVe72qSTTcAPyMgLA/168s.jpg", "caption": "Turkey Bacon Avocado Sandwich"}]}}, {"review": {"des": "The waitress at this location female Hispanic approached our table in the most nastiest ,rude distasteful way and her skills lack that of professionalism therefore I will not visit this establishment again .", "pics": null}}, {"review": {"des": "No frills here people, and that's completely okay. Sometimes all you want is your casual neighborhood brunch spot for bacon and eggs. That's exactly what you'll find here. Not necessarily gourmet--but everything I've had has always been fresh, hot, and fulfilling. You get exactly what you'd expect. <br><br>They also have a nice outdoor patio in the summertime with a lot of tables!", "pics": null}}, {"review": {"des": "I have never once had a bad experience at this place. The food is always, without exception, delicious, hot and perfect regardless of what I get. The prices are phenomenal considering the area. I've taken my parents here who are pretty picky when it comes to eating in the city and they have zero complaints. Parking is usually pretty easy which is a plus if you're driving. Sitting outside during the summer is also a big deal to me. Staff is always friendly and accommodating with requests. I'd make this a weekly thing if I lived super near.", "pics": null}}, {"review": {"des": "I recently moved back to Chicago and decided to try out this cute little cafe for a late breakfast. The reviews stand well and do the place justice. I came in with the intent of ordering chilaquiles but saw \"Latin Benedict\" on the menu and just knew I had to try. It was a super creative plate with an English muffin, huge serving of meat, cheese, and a  manduro which was a nice touch and added to the diverse blend of flavors with the poached egg. My boyfriend ordered the chilaquiles and they were excellent as well. The salsa verde sauce  was amazing, sweeter than most other places, but no complaints, it added to the dish. The rice and beans didn't stand out but were good as well. Our waiter wasn't particularly engaging but he just let us do our thing which I respected. The place itself is adorable with beautiful art and photography on the walls paying homage to the city and to the Latin roots of the cuisine. Will definitely return and highly recommend you try.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/3X0Y-LTTAuzQ2X2Uxenr1g/168s.jpg", "caption": "Latin Benedict"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/EpNqpMcQgI49sKAYl80fRg/168s.jpg", "caption": "Side note that we already dug in to the chilaquiles"}]}}, {"review": {"des": "This is a really place to eat and to get stuff for small amount of a charge. I came here with a friend. It was actually really comfortable ,the vibe and people were great. The good was really stuffing which is good because they are not that pricey ! I did come here again just because it is a bus away from my house. The coffee is also is really good. ! Definitely would recommend!", "pics": null}}, {"review": {"des": "This is one of my favorite brunch spots! They have a bunch of fantastic food options and it's more affordable than most other brunch spots in the area. The menu covers a lot of options, so you'll definitely find something you're in the mood for. Plus a cute little patio for when it's nice out.<br><br>But the best part?<br><br>They have a VEGETARIAN SOUP of the day EVERY DAY!!<br>It's incredible! I mean, I think there's also a daily meat soup, but like, where isn't there a daily option for meat soup, am I right? (#abundantandlowvalue)<br><br>It's so hard to find places that have vegetarian soups at all it seems, and this one has a different every day and they are all FANTASTIC. Cream-of-any-vegetable here is the best. Half the time I'm here for breakfast/brunch and will get a bowl of soup and then an egg on the side so I can have the best of both worlds. (In love with the soup, yet still doing something mildly breakfasty. + Mimosa.)<br><br>Much love to Janik's for being vegetarian-friendly!", "pics": null}}, {"review": {"des": "The sandwiches and salads are excellent. Now if your looking for a sandwich with 2lbs of meat Janick's is not for you. The meat portion on the sandwich is a sufficient amount of protein and the taste is off the chain fanastic. The lime soup is by far the best broth base soup I've had ever and for sure gets a Yum Dinger rating.", "pics": null}}, {"review": {"des": "Came here for breakfast. Food was okay and prices were decent. Fast and friendly service...would come here if I want a fast breakfast.", "pics": null}}, {"review": {"des": "This place is the <a href=\"/redir?url=http%3A%2F%2Fbomb.com&s=bb4f996415a9c2f21137e27cfb68f439a48cec2652b53e9b50dd7e766dbe177e\" target=\"_blank\" rel=\"nofollow\">bomb.com</a>! Amazing food, decent amount of seating, cheap drinks (6$ bloodies and other cocktails) and friendly staff. I always go with breakfast but the lunch menu looks delish too.", "pics": null}}, {"review": {"des": "Coffee and omelet for $13 total??!?! Awesome. Also on the patio you can bring your dog and chill watching people walk by on Division. Inside is super eclectic art. In the back is a book trade so you can bring a book and leave a book. Staff is very friendly, food comes quickly. Overall solid place!", "pics": null}}, {"review": {"des": "\"One morning I shot an elephant in my pajamas.....how he got in my pajamas, I'll never know.\"  --Captain J. Spaulding<br><br>Where else can you find commissioned pieces of art**, delicious breakfast potatoes, and the world's best banana smoothie?  If it's somewhere other than Janik's Cafe then I'd really like to know.<br><br>On the heels of a couple very unpleasant breakfast experiences, I was more than a wee bit hesitant to try this Ukrainian Village hangout.  But Anna T made a handful of claims that this spot was the bombdiggity, and after eating here on 3/19/16 I'm inclined to agree with her.<br><br>Once we got seated at the only unoccupied table, a waiter came by and I immediately decided on the banana yogurt smoothie.  HOLY LORD was it good.  Fresh, fruity, and fantastically filling.  Sitting there and gradually sipping away at it (I didn't want the goodness to end!), I felt that it was the tastiest smoothie I've ever had.  Sitting here and typing this all out, that still holds true.  Best.  Smoothie.  Ever.  #nobull<br><br>In no time at all the food arrived and I feverishly ate my order.  The ham & cheese omelette wasn't much different than one I'd make at home, but it had plenty of meat, so that's something.  It came with toast and breakfast potatoes that were masterfully seasoned and almost didn't need hot sauce.  Almost.  But with so many choices of stuff in the condiment caddy--2 types of salsa picante (green & red), 2 types of ketchup (regular & spicy), along with butter, sugar, and an assortment of jelly--it seemed rude *not* to use them.  Major kudos for the variety.<br><br>If I'm eating before 11am, it's going to include bacon.  So I was a little taken aback when my side order of bacon came out all meager-looking.  But then I realized I'd asked for 'extra crispy' (contents may shrink by 80% during cooking), and they delivered just that.  Anna T's Belgian waffle was superb, I wouldn't hesitate to order that on a future excursion.<br><br>Bread = 4.5<br>Circuses = 5<br><br>**You're probably wondering why I leadoff this review with a Marx-ist quote (Groucho, not Karl).  I was inspired by a piece of art hanging on Janik's wall of the 2nd-most well known Marx brother, Harpo (the mute one with the top hat and curly hair, always doing sightgags).<br><br>There were landscapes, surreal paintings of eyeballs, other random stuff, but a portrait of Harpo Marx instantly caught my attention.  I said to myself....\"I absolutely have to have this.  This is going in my apartment.\"  Our waiter gave me the guy's business card, and a few hours later the artist and I negotiated a price (his name is Brett Whitacre, for those that are interested).  As of this writing, I now have a 1-of-a-kind piece of painted glass pop art proudly displayed in my entryway!   :)<br><br>BIG thanks to Janik's Cafe for a wonderful breakfast (especially the smoothie and potatoes), Anna T for the outstanding suggestion, and Brett W for being a gifted artist in his own right.  Don't worry my man, your work went to a good, appreciative home.  I figure since I started this one off with a Marx brothers quote, I might as well end it with one:<br><br>\"I could dance with you 'til the cows come home. On second thought, I'd rather dance with the cows 'til you came home!\"  --Rufus T. Firefly", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/yQwss_8_Qp7q6Pov1e9AvA/348s.jpg", "caption": "The interesting and fun collection of art on the wall **note the Harpo Marx portrait at top center** (currently hanging in MY apartment!)"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Vim4Y5X5L2Jek5yW1SvcLA/168s.jpg", "caption": "Ham and cheese omelet with white toast and extra crispy bacon"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/HQD0WdgXUPRnG2VakB1kXw/168s.jpg", "caption": "Belgian waffle! Nice dusting of powdered sugar, too"}]}}, {"review": {"des": "In town for the weekend and was looking for a quick breakfast spot in Wicker Park area...this place is a gem. We split the chorizo burrito and biscuits & gravy which had the perfect amount of kick. Tons of food for a great price. Service was fast and very friendly!", "pics": null}}, {"review": {"des": "Perfect brunch spot with nice patio. No pretentiousness at all. Just good value, reliable food and tasty. Consistently good.<br>Very nice neighborhood to walk as well. Get there early to avoid wait. (Pre 10:30am)", "pics": null}}, {"review": {"des": "This restaurant is amazing! It's a fairly simple, diner-like type of place that doesn't appear to be anything special but honestly is one of my favorites in the city. My boyfriend and I live about 4 blocks away and go to Janik's at least once a week. The menu is enormous, serving breakfast all day long in addition to sandwiches, salads, burgers, awesome soups, and a plethora of other entrees. The servers are all so friendly and attentive. We definitely have become somewhat of regulars and have gotten to know a few of the servers who are all awesome.<br><br>The place can get packed at peak times but, even if there's a line, we've never had to wait more than 10 minutes for a table. The kitchen is well run so they still get the food out very quickly even when they're packed.<br><br>(Settle in. This is when the review gets long but I always want to know what reviewers have eaten so I'm getting into some extensive detail.)<br><br>As far as breakfast goes, I almost always get the Belgian waffle combo with eggs, sausage, and bacon. I'm obsessed with it and can't bring myself to order anything else when I'm in the breakfast mood. My boyfriend switches it up more often, having tried the Denver omelet, pancakes, and the breakfast bowl, all of which he's loved. The best he's gotten there by far is a special that's been around for a few months now, chilaquiles rojos and adds steak. Their rojo sauce is absolutely fantastic. The Nutella and custard croissant is delicious and worth a try but is extremely rich. The lox and bagel platter is humongous! It's essentially got a huge salad on the side that I usually end up taking home for lunch.<br><br>Outside of breakfast I have a few standards that I rotate through because they're amazing. The turkey and avocado sandwich (get it on a croissant!) sounds so simple but I love it and crave it constantly. The southwestern salad is perfect when I'm trying to be \"healthier,\" although I douse it in that chipotle ranch and typically get fried chicken on it which is amazing. The cream of chicken and rice soup is pretty rich but awesome! I've only had the bacon and grilled onion burger, which was enormous and great, though people I've gone with have tried and loved many of the other burgers. <br><br>Their potato salad serving is small but worth it. I only recently tried their side of mac and cheese, which is fairly standard but also somehow amazing with a little added salt and pepper. To be honest, the only thing I really haven't loved were the beef empanadas which were too bready for me, although my boyfriend is Cuban so I may be used to a different type of empanada. <br><br>The drinks are pretty good, although not usually too strong. They're cheap though so if you want a strong one, just order a side shot to put in and they'll bring you a pretty large shot that's more likely a double.<br><br>The day that we do end up moving away from the area will be a sad day since I doubt I'll ever find a diner/restaurant that I'll love as much as Janik's.<br><br>Pro tip: if you shop at Mariano's, or at least the one in Ukrainian Village on Chicago ave., the back of the receipts have 10% off coupons for Janik's. We have a stack of probably 25-30 at any given time.", "pics": null}}, {"review": {"des": "Wonderful little cafe!! Was headed to another restaurant and was enticed by Janik's full outdoor patio. Best decision ever!! Their menu is extensive and they offer the full menu all day, no breakfast or lunch restrictions. The 'Salmon Bowl' was excellent!! The Venezuelan  style black beans were soooo good!! I definitely recommend Janik's for good vibes and great food!! Janik herself came to our table and spoke with us. She was very warm and welcoming!! Janik's Cafe is definitely a neighborhood gem.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/9uLF0npZsO1qjmKUO0739g/348s.jpg", "caption": "Salmon Bowl with fried sweet plaintains and Venezuelan style black beans. It was amazing!!"}]}}, {"review": {"des": "Stopped in for a quick bite on a weekday afternoon. I was quickly greeted by a very friendly waitress with a cup of ice water and a menu, she was very attentive. I was in and out of there within 30 minutes. I had an amazing Santa Fe salad and a side of their Janik potatoes, and an ice cold Coca-Cola. My meal cost me $20 with tip not bad for a table service lunch.<br><br> I will definitely be back for their brunch menu looks amazing as well. I think they're dacor is out of this world I will definitely have to spend more time at this little gem in Wicker Park.", "pics": null}}, {"review": {"des": "Came here for brunch (which they serve till 3!) and had a great time! We were seated right away even though it was almost noon, and the service was very nice, didn't pester us to leave/finish. The portions are perfectly sized and not overwhelming, prices are very reasonable, and food is delicious! Definitely will be going back!", "pics": null}}, {"review": {"des": "In the modern day society, brunch isn't quite right unless foisted with crabcakes, lox, duck eggs, etc. You're not getting with the trend until you start downing those bottomless mimosas and discussing what's the next best brunch place. That would be the least of your concerns at Janik's, your typical community cafe with the unpretentious breakfast and lunch entrees. Grab any available table, seat yourselves, and order.<br><br>With five famished adults and a ridiculously inexpensive menu, we recklessly pointed our fingers across the menu like children, \"I want that...and that...and this...and that!\" <br><br>1) My corned beef sandwich was served on rye with lettuce, tomatoes, pickle, mustard, and Swiss. For less than $6, my sandwich was packed with generous slices of corned beef. To complete the meal, I also had a small side of standard potato salad. <br><br>2) For $2, you can have a plump piece of french toast served with powdered sugar and condensed milk. This can easily be shared between two people, especially if you want to have enough capacity for other items.<br><br>3) A good portion of the menu is composed of Mexican-inspired items. Our chicken tostada had two sunny side up eggs with a pile of shredded meat, lettuce, tomatoes, rice, and sour cream. It was served slightly warm but the flavors were standard. <br><br>4) I like how a lot of breakfast items can be easily turned into a dessert. The pancakes with nutella and bananas are a perfect example. This platter had three thick pieces of pancakes that were crispy on the edges and fluffy in the center. In between each pancake was a generous spread of nutella and the whole stack was decorated with banana slices. <br><br>Overall, I think Janik's was well worth the visit. We ordered over 10 items in total and it didn't even damage our wallets. If you want to keep it simple, Janik's is the place to go.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/HJaqh2GAmaO3vZaPUeVSjg/348s.jpg", "caption": "Pancakes with banana and nutella"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/xwT2CNrWRx6lWhmv2N350w/168s.jpg", "caption": "Corned beef sandwich on rye with swiss and mustard"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/X2JbDW87Cg2PXQnDig9YKg/168s.jpg", "caption": "Chicken tostada with sunny side up eggs"}]}}, {"review": {"des": "This place is an amazing star in wicker park with a little bit of everything all day long. I had this special that was so delicious it would make you wanna smack your mom: Chilaquiles with he made crispy tortillas underneath a bed of scrambled eggs, chorizo, green sauce, with avocado #basicandidontcare, rice, beans and Pico on the side. The boy had a tuna melt w avocado #hesbasictoo and it was fab. Oh yeah... And Irish coffees. It is St Patties  weekend after all.", "pics": null}}, {"review": {"des": "I came here for brunch by myself. I ordered the crab cake Benedict. It is difficult to describe what was \"off\" about them.. the breading seemed to absorb a lot of grease. I felt rushed by the server, and it was clear they wanted the table to push together with another for a group. It's hard not to notice when you are barely halfway through a meal and presented with the check without a refill of water, while the table next to you has been dining for a longer period of time and are being asked if they'd like more drinks, etc. Im not coming back for the food, and absolutely not coming back for the service.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/SDmNsKVNFCLXR1sIqRVu1g/348s.jpg", "caption": "Crab Cake Eggs Benedict. Good, but I wouldn't go back for a second time for it."}]}}, {"review": {"des": "I cannot say enough about how wonderful Janik's Cafe is. Not only is their menu filled with great eats (and so cheap!), but it's a family-owned restaurant that makes you feel like family. When I first moved to Chicago 8 years ago and didn't know anyone, I went to Janik's Cafe given the great reviews and prices. Felippa Janik (one of the owners) came up to me and was so welcoming, kind, and generous. I told her I was new in town, and she treated me like her own kid. From then on, every time I go back, she greets me with the same warmth as before (even though she's running around) - and I always leave having eaten a great meal. Their food hits the spot and has become my go-to home away from home. My favorites include the lime chicken soup (never had anything like it before, and I always order it) - and frankly any of their sandwiches (especially the roasted veggie sandwich). You also can't beat the price for the quality and quantity of food you get. Side note, it does become busy so get there early - or hang around Division, since they are worth the wait for a solid, home-cooked meal of all your favorite comfort foods. Janik's will always be one of my most cherished restaurants in Chicago for all that they offer - and 10% off on delivery if you order from their website! Thank you, Janik family!", "pics": null}}, {"review": {"des": "My 2 yr old grandson loved the French Toast.  I had the fried chicken sandwich with avocado and spicy slaw - delicious.  Good service, friendly staff.  The usual problem was finding a parking space.  We will definitely go back.", "pics": null}}, {"review": {"des": "I am actually very sad to have to write this review because they have very good soups but the service is horrible! I have been eating here almost everyday since i work in the area (9 months) . I have ordered this almost 10x and had no issue with it so far because i love pasta. I am lactose intolerant so i order my pasta with NO CHEESE because i do not enjoy a day in the bathroom because of it. <br><br>First encounter: I order it on the Eat app and i wrote the kind of soup i wanted with my pasta combo then followed said NO CHEESE.  I got my pasta back, it has cheese. I called them immediately and tell them. She is there arguing on the phone with me that I need to say no cheese on pasta because the cook thinks it is for the SOUP. The cream of chicken soup DOES NOT HAVE CHEESE, how would it make sense for a customer to write NO CHEESE for the SOUP?? She then says well if you are lactose you can't eat this because it is creamy. EXCUSE ME? i have eaten this dish at least 10x and had no issue. You are not going to tell a customer what to eat, I am buying food from you WTF?!?! She did not even offer to REMAKE IT? i said well i need you to remake this because I CANT EAT IT. She annoyingly said is that what you want us to do? then we will. <br><br>I had taken a break from Janiks because of this issue. My coworkers got me a gift certificate to Janiks for my birthday couple days ago because they know I love their soups. I decided to give them another chance. I reordered the same exact thing but mentioned clearly NO CHEESE ON PASTA.<br><br>Second encounter: I get the pasta back and there is cheese on it. I tried to keep my calm and called them to tell them AGAIN. She is on the phone arguing with me AGAIN saying that she GUARANTEE (3x) that there is no cheese on it (because he remade it twice) while i am staring at it and unless she does not know what cheese look like but it is melted on the pasta. I said well do not guarantee something you cant back up, i will bring it back and SHOW YOU. <br><br>I asked who i was talking to on the phone, showed it to her and she did not know what to say besides he is remaking another one for you. I said well i do not want another one and i want a refund and i also want a refund for this gift card that i received on my birthday because i am not eating here again. <br><br>I am in the customer service world as well and this was handled SO wrong on 2 separate occasions. Especially that the person is a regular, this should of been avoided as it is a very simple EASY fix.", "pics": null}}, {"review": {"des": "This place is just okay.  It is very average but the benefit is that it's cheap, which is rare in this part of town.  The bloody marys and mimosas are only $5, which is a great deal.  I find their food to be mediocre but they serve generous portions.  I mainly went here because my friends like it but I just don't really enjoy spending money on brunch that is something I could make at home and be more flavorful.  The first time I came here I had a smoked salmon eggs benedict and the hollandaise sauce was cold and flavorless.  The second time I came here, I shared a Mexican breakfast bowl and huevos rancheros.  Both were better than the benedict, but not a lot of flavors going on.  I think this is the kind of place you can go with someone who doesn't really like spices.", "pics": null}}, {"review": {"des": "Flew in from Orlando and was in the mood for hash browns, Yelp suggested Janik's.<br>Unfortunately, when I arrived, I was informed they don't have hash browns but have seasoned fried potatoes called Janik's potatoes. I got it as a side order with Avocado toast and was pleased with the taste and flavor.  Place was very busy and every seat was taken, food arrived quickly and service was good. Would recommend to anyone looking for an off the beaten path quaint place", "pics": null}}, {"review": {"des": "Went there for the first time on what was supposed to be a nice Sunday breakfast with my family (my wife n 2 kids)As soon as we walked in we were seated w a shared table w 1 other person. I wasn't too excited but ok I'd give it a shot. About 20 mins sitting there and no service, we were completely ignored. Another table who came afterwards were greeted and orders were taken by a waiter. Then after waiting all that time a server came by and finally dropped off menus, didnt ask if we wanted anything to drink etc.....I gave it another 5 mins.....and he didnt come back. We then decided we'd given enough time for them to acknowledge their lack of attention-service. so we decided to politely walk out. The restaurant wasn't even busy/packed. I've worked in the restaurant industry for years prior to my current job and I know how difficult serving people can be but this is a plain case of POOR SERVICE. Wouldn't recommend this restaurant.", "pics": null}}, {"review": {"des": "This is a no frill place, just your basic breakfast food, so do not come here if you're wishing for some new innovation and different ways they can add quinoa to your breakfast hash.  I got the veggie omelette which was fine.  The b/f  had the ham benedict, both dishes were fine and came with potatoes and toast.  We weren't too fond of the potatoes.  They weren't crispy as they cook them differently, so they were a bit more mushy and soggy and were a bit polarizing and they seasoned it with some spices that were spicy and to top it off, they did not have ketchup available, but rather spicy ketchup.  That would have been fine if the potatoes weren't spicy to begin with.  On a side note, the wait staff was super friendly, always asking and checking up on us and even asked us if we wanted a to go cup for our coffee.", "pics": null}}, {"review": {"des": "My favorite brunch place in WickerPark! Theres a vast variety of foods on the menu, breakfast dishes and delicious Mexican dishes as well. The prices are affordable and the amount they give you is very filling. The service is quick and the atmosphere is casual yet cozy. I had the fried chicken benedict and it was amazing. I will definitely be visiting again and try their delivery service soon too!", "pics": null}}, {"review": {"des": "Sandwiches and more. Bigger, better, and way less expensive than the rest of the hood.", "pics": null}}, {"review": {"des": "LOVE Janik's. My favorite lunch spot in the neighborhood. I do think it's slightly overpriced, but I can't help myself from continuing to go back. My favorite is the turkey and avocado sandwich on a croissant, YUM!", "pics": null}}, {"review": {"des": "This place is wonderful. Their menu is HUGE and prices are dirt cheap - especially for the location. Service is on point too. I usually switch up what I order but always get the lime chicken soup - it's amazing! The other fun thing that I like is that you can order a single pancake. I know it's a bit silly, but I like to order both sweet and savory breakfasts but can barely eat 1/2 of a single portion so this is a huge bonus for me. <br>Plus, they have outdoor seating!!!!", "pics": null}}, {"review": {"des": "Janik's has done a bit of a re-concept recently, and it's better than ever! They have upgraded their toasted sandwiches, and my husband enjoyed the most delectably toasted Cuban yesterday. They also added empanadas to the menu which are SO GOOD! The breading is probably a little thicker than other empanadas I've had. But they were the perfect compliment to the soup of the day, which I get every time I go to Janik's.", "pics": null}}, {"review": {"des": "Janik's rules. The only issue I have with this place is that they're only open until 4, so if I'm craving some of their amazing breakfast at like 6 pm, I'm outta luck. I'm moving away from this neighborhood in a couple weeks, & I will miss this place terribly. There's nothing like waking up still drunk from the night before & ordering a Janik's feast to sober you up! I  Janik's!!!", "pics": null}}, {"review": {"des": "This is for delivery! 9/10 times (we order a lot of food) our order has always been super fast and food has been great. <br><br>Some times they include some extra pieces of bacon which is awesome! <br><br>The only thing I would ask is for when people are ordering delivery to include silverware and syrup/butter (especially if they are ordering waffles and pancakes). Sometimes we didn't get syrup or any silverware with our orders.", "pics": null}}, {"review": {"des": "I don't get the hype for this place. The food tastes okay, but the presentation is lazy, and the service is horrible. We were never brought an item we ordered, had to ask for water twice before getting it, and the place wasn't even busy. I would not come back for the food, and would definitely not come back for the service.", "pics": null}}, {"review": {"des": "Great, go-to place after a night of drinking (or the morning after a night of drinking).  Great 'greasy spoon' joint in the neighborhood.  <br><br>The menu is very large and there is something for everyone and every taste.  I especially enjoy that the burgers offer non standard sides.  Mac and cheese, cheesy potatoes, or fries.  All the sides are the tasty and the burgers don't taste like standard patties.  Though, I cannot confirm, the patties taste home made. <br><br>Good, go-to greasy spoon after a night out.", "pics": null}}, {"review": {"des": "All my friends who live in Wicker swear by Janik's and it lives up to the hype! So refreshing to dine at a spot where you aren't disappointed by small portion sizes and huge prices for brunch. Quite the opposite at Janik's. Came here on Lois R's famous tour of Wicker Park and our party of 7 waited about 15 minutes for table. There isn't a ton of room to wait inside, but the patio provides ample space for waiting in the warmer months. <br><br>After we were seated, our waiter came over promptly and took drink orders. Throughout the meal, coffee refills were always close by. For brunch, we ordered a plethora of items, but the Breakfast Bowl is definitely the star. Tasty breakfast potatoes, black beans, pico, eggs, what else could you want? Add some turkey sausage or avocado and you're all set. Also can't go wrong with their omelets, parfaits, and I've heard the salads are great! Even the fruit bowl my friend got was robust. Upon getting the check, we split it and the grand total was...$11.50. Seriously cheap for a brunch dish and coffee these days. Highly recommend stopping by Janik's!", "pics": null}}, {"review": {"des": "So here's the issue: <br>Some of you mofos are giving bad ratings, because you're coming on a weekend, and mad because it's busy and it takes a bit to make food for you and 100 other people. Sit down, shut up, and enjoy your company. Theyre not overly friendly, but they don't ignore you or be a dick to you. <br><br>This food is fresh, it's good portion sizes, and for how much you have and how much Chicago normally costs, it's reasonable. <br><br>Best time to go? In the morning on a week day around 10. No one is there, they give you appropriate privacy, and it's not packed and loud.  <br><br>Is the food good? Yes. Is it fresh? Hell yes. Did the guy give me tilapia instead of chicken? Yes but I shut up and eat it anyway because fish is already expensive and I'm not gonna bust someone's balls, because they put the wrong meat in a still delicious wrap.<br><br>Shut up, sit down, eat your food, and enjoy life.", "pics": null}}, {"review": {"des": "Janik's is such a great neighborhood breakfast/lunch spot! One of my favorite memories was visiting Janik's for the first time on a cold February morning when I introduced by then girlfriend (now wife) to my future best man. I have only been to Janik's for breakfast and I would describe it as no frills, delicious food served by courteous staff. The food may look \"basic\" but its delicious and won't have you're wallet or purse crying foul. I have ordered the biscuits and gravy and french toast and have never been disappointed.", "pics": null}}, {"review": {"des": "I actually order from Janiks Cafe a lot and the food is always on point but the items I ordered today were unacceptable. I ordered a chicken Cesar salad and a side of fruit salad. My greens were withered and brown but that's not the worst part. My fruit bowl was rotten and had bacteria fuss growing all over it. This is  HUGE health risk. People can get very sick!! Please Janiks I love you guys but becareful and double check your food!", "pics": null}}, {"review": {"des": "On a busy morning, we got in under our quote time of 30 minutes and got seated in their covered outdoor area. Was very nice. The service was a bit slow due to the busy nature of the restaurant. <br><br>Food was excellent. I had the Greek chicken wrap with macaroni salad on the side. I loved that they had so many options for breakfast and lunch. Something for everyone. I also had an iced chai latte that was great - would have preferred an additional espresso shot for added caffeine. My friend got their baileys shake which looked AWESOME. <br><br>Overall, a pleasant experience and a menu that I would love to order from again. Many options and fairly priced.", "pics": null}}, {"review": {"des": "Awesome food. It can get crowded here at times but the wait and the crowds are worth it. I ordered the breakfast quesadilla and it was delicious. Quite reasonably priced too. I would skip the coffee and go for the fresh squeezed juice instead.", "pics": null}}, {"review": {"des": "Janik's is a basic, relatively affordable option in a neighborhood that's often pricey and fancy when it comes to breakfast and lunch options. The menu has a mix of breakfast and lunch standards, plus a variety of Mexican options. It's all pretty decent, but nothing special, particularly compared to the blockbuster dining options nearby. <br><br>It's good to have this alternative for people with more straightforward tastes, but I personally prefer some of the neighborhood's other options.", "pics": null}}, {"review": {"des": "Awesome place,  always great service, very friendly, delicious food and staff are always nice. Usually find free parking down Damen and lots of local shops near by to explore.", "pics": null}}, {"review": {"des": "Simple breakfast/brunch spot in the Ukrainian Village.  I think the draw here is just that: simplicity.   You can get a nice breakfast for 8-9 dollars. <br><br>From a quality standpoint, it's pretty good.  My only knock is the portion size is a little on the small side.  But if you aren't looking to spend a bunch of money on breakfast, it'll work.  It's not BYOB but they serve alcohol for those looking for bloody marys or a little spike in their coffee.", "pics": null}}, {"review": {"des": "I dare you to find a more reliable breakfast establishment in the neighborhood. There's a reason they've been around for so long and routinely feature long wait times. If your party can't find something they like here, they are snobs; one of the largest menus I've seen in Chicago. Regardless of whether you're in the mood for a sandwich, an omelette, a sweet breakfast, or something a little exotic (they feature delicious Tex-Mex cuisine in addition to their traditional breakfast and lunch food), there's bound to be something for everyone. <br><br>My personal favorite is the hangover beater; chicken-lime soup! You can order a cup on the side, or a bowl for an entree. The caesar salad is great. Sandwiches are awesome, especially now that Jerry's is closing (RIP). <br><br>They also have a great patio with friendly, efficient service. Pro tip: call ahead for a table!", "pics": null}}, {"review": {"des": "All I have to say is: eat the Latin Benedict. It will change your life!!!! It has certainly changed mine. Amazing unpretentious delicious cafe :)", "pics": null}}, {"review": {"des": "Janik's is OK.  The coffee needs a serious update!<br><br>Breakfast was average- in this area, you've got to up your game to be competitive.<br><br>I'll give you another try to see if anything has improved.", "pics": null}}, {"review": {"des": "This is a busy, bustling place that has an extensive breakfast menu. Service was good and my eggs Benedict with sausage tasty, but the side potatoes that we all asked for well done came out a little soggy. Overall, there are a lot of breakfast choices with ethnic eggs--Lox's, even Polish sausage with sauerkraut and Mexican style chorizo with eggs (my husband's order) that should please any palate. If you want to talk, the place on a Sunday morning is quite loud and congested, so a little tough to hear but the service was strong and my coffee cup never sat empty.", "pics": null}}, {"review": {"des": "Service was speedy and tasty. With the very affordable prices, especially in Chicago, I'd be challenged to recommend another spot for a late breakfast/early lunch.", "pics": null}}, {"review": {"des": "I had the Breakfast Bowl with Chorizo and it was SO good (and huge- I could only finish 1/2 of it). Hubby had the chorizo omlett and also said it was delish. Good coffee too. Great breakfast spot that opens at 7am every day.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/OWf_uGSavEwZyPyqNlgk-Q/348s.jpg", "caption": "Breakfast bowl"}]}}, {"review": {"des": "Absolutely love this family restaurant. I took my dad here (who has specific foods that he eats), and he and I both loved it. We ordered salmon bowls, and the salmon was cooked perfectly. Also, one of the family owners came over to chat with us, and she was super friendly and sweet. We finished off the dinner with a coconut flan, which was delicious. I will definitely be returning.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/RlNoun_4ZOUzMewgCZA55w/348s.jpg", "caption": "Coconut flan - perfect taste"}]}}, {"review": {"des": "Ordered for pick up, food was ready when I got there! It was sort of slow seeing it was Monday,  the hostess/waitress was polite and the two waiters had manners, when having to maneuver around me, while I paid in the small cashier space. I ordered their parfait which was yummy and my friends had pancakes and a Denver omelette, I didn't hear any complaining and everything was gone! Wouldn't mind dinning in next time!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Z2TPgu81DsZuc9a8e7LF1w/348s.jpg", "caption": "Parfait was also wrapped like the orange juice, no leaks!"}]}}, {"review": {"des": "Delicious Greek Omelette. The feta is amazing. I didn't enjoy the center of the omelette being under cooked. There was a good amount of egg white that was clear and uncooked, but I just ate around it since it still tasted bomb. Perhaps some prefer their eggs like this, so I'm not hating, it's just not for me.<br><br>The fried potatoes that come with the eggs are amazing. A great cajon type flavor. <br><br>The toasted croissant was bomb as well.<br><br>The lattes here are a joke. Just get regular coffee, and don't expect much. <br><br>Overall, this place is about their food. The rest is soso.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Eug6fA0dhj5Ij2ivxHOSIg/168s.jpg", "caption": "Caramel Latte"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/_8YeeYhmN9CwdNUfHljOHQ/168s.jpg", "caption": "Greek Omelette"}]}}, {"review": {"des": "Simple but good eats and cheap beer. Wish they stood open later.", "pics": null}}, {"review": {"des": "Arrived at Janik's Cafe before 4pm and we were turned down because they close early. We had just walked there in the rain with a baby and arrived before they closed and they refused to serve us. Extremely disappointing. They should say they close at 3:30pm if that's the case. What a waste of time and very inconvenient.", "pics": null}}, {"review": {"des": "We decided to come to Janik's Cafe on a Sunday morning to celebrate gaining an extra hour from daylight savings. This is a decision I absolutely do not regret (even if we did try milk & honey first, which had a 40-minute wait). We walked into the cafe and were immediately greeted and seated. The place was happily bustling with people, but they still found a place for us. I abhor waiting, so Janik's immediately left a good impression on me. <br><br>The menu is filled with a lot of really delicious options, so it was hard to choose. I knew I could not ignore the banana Nutella pancakes, so I gave into fate and ordered them! The wait was pretty short, so again, I was a happy camper. My banana Nutella crepes were really delicious. There were three substantially-sized pancakes with a healthy topping of bananas and Nutella with powdered sugar on too. The part that impressed me the most is that there was a spread of Nutella and banana slices between each later. I had leftovers (yay for big portions!). <br><br>The only thing keeping me back from five stars is that service wasn't particularly attentive and my water was empty for the majority of the meal. I'm forgiving, of course, because I know it was busy. Perhaps they were able to bring the food out so quickly because servers weren't filling waters and making small talk. <br><br>We noted that they also have milkshakes and fresh-squeezed juices. These definitely will be on our to-try list for the next time we're here! What a wonderful local cafe to have so close to the boyfriend's apartment and prices are very reasonable for what you get. I look forward to returning, especially with the knowledge we won't be left waiting!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/R15PpRJwj8QagVAMRJFmsA/348s.jpg", "caption": "Banana Nutella pancakes"}]}}, {"review": {"des": "How I felt about Janik's cafe: meh. I had a buffalo wrap that wasn't spicy nor had bleu cheese that I could detect. Was served with an underwhelming pasta side salad instead of fries, which was disappointing. Did I have a bad experience? No. But will I be back? Probably not.", "pics": null}}, {"review": {"des": "LOVE LOVE LOVE this place.  they serve quality homemede food and the service is always great.  The biscuits and gravy are amazing and I believe totally from scratch.  they make their own granola which is delicious and almost better than mine :)<br>drinks are affordable and where else can you get a grapefruit mimosa?<br>I have brought so many friends and out of town guests here for breakfast, brunch or lunch and everyone always loves it.  just a really good solid place.", "pics": null}}, {"review": {"des": "Whether it be breakfast for breakfast, breakfast for lunch or breakfast for dinner this is the place to go. It's usually very busy but tables free up and service is quick.", "pics": null}}, {"review": {"des": "I'm a sucker for breakfast food and this place does it well. You can always tell a good breakfast place by their coffee. My husband and I both had the biscuits and gravy with eggs and potatoes. I have to say-- having been born and raised in the south-- the gravy was surprisingly good (and that's a big deal, y'all). Couldn't speak much to the biscuits as they were thoroughly drowned in gravy and that is not a complaint. We also split a single piece of French toast (breakfast dessert) and it was also very good, it came with a side of some custard type sauce, I don't know what it was but it was amazing-no syrup necessary. Also, the service was excellent, attentive, preemptive, quick, and polite. Good coffee, solid gravy, and nice fast breakfast service. Would love to go back and try their waffle.", "pics": null}}, {"review": {"des": "I've been wanting to try this place for a long time. We got there and before I could say anything, the guy was like seat yourself. I understand they are busy but why the attitude <br><br>Took awhile for our server to come. Once he came around he dropped off waters and walked away. I said hi when he approached us and he didn't respond. <br>So I thought maybe he didn't hear me?<br>We got our food. The food was mediocre. My latte was delicious. <br>The food took forever but it was busy so that's fine. <br>Our waiter never came to check on us. Once we finished, he came over to pour more water. <br>I said can I get my check? He didn't respond. He came back later with the check and dropped it off and left. <br><br>He barely even spoke to us but I saw him speak to other tables. Was it cause we are minorities? I'm not sure but it sure felt like we weren't welcomed", "pics": null}}, {"review": {"des": "Good food although a little pricey for the portion size. And, come on, my requested toast was not toast but warm bread. How simple is it to make toast?  Ordered the Denver Omelette with potatoes. Both were good, nothing special, nothing wrong. The grapefruit mimosa was excellent.  Chilliquiles were again good, not great. Super small side of beans.  If I was walking by, which is what we were doing, I might stop in again. But I would not make an effort to go again. Toast people, toast!<br><br>P.S. If you and your bf just came back from a run, could you possibly shower before going out to breakfast and sitting next to us?  You really do stink, no matter how much you think you don't", "pics": null}}, {"review": {"des": "Came for LUNCH!<br><br>-LOVE the casual patio outside, comfy and neat inside<br>-BEWARE of slow service, yet friendly <br>-CHOOSE quickly, and enjoy reading the large menu<br>-SURPRISED by portion sizes, and quality, delicious caesar salad with grilled chicken<br>-HAPPY about the cheap prices<br>-PERFECT location in Wicker Park<br>-ENJOY taking your time", "pics": null}}, {"review": {"des": "2.5 Stars<br><br>I met a friend here for brunch yesterday around 12:30 and of course since they have outdoor seating it was a little pack. Luckily we only had to wait about 5 minutes and we were able to score an outdoor table. Side note: this area is perfect for people watching :)<br><br>Service and price point are great, but food is pretty mediocre. I ordered the French Toast. Tasted like I could have made it from one of those frozen food packages. The eggs were also really bland. Although I wasn't impressed you did get eggs, French toast, sausage and bacon...all for $8.95. Not too shabby on the wallet. However it left me craving good French toast I'm use at other places. This is where quality over quantity comes into play. I probably won't be coming back here. I would rather pay a little bit more and enjoy a really good savory brunch.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/NWHYbmtQtWgQExJsVsOCOQ/348s.jpg", "caption": "French Toast"}]}}]}