{"name": "jenis-splendid-ice-creams-chicago-3", "reviews": [{"review": {"des": "One of the best ice creams in town. Plenty of seating indoors, lots of amazing flavors to choose from, and they give you samples with metal spoons! Way more eco friendly and makes ice cream taste better anyways. <br><br>I like the orange theme color, it makes winter feel brighter and warmer.", "pics": null}}, {"review": {"des": "Perfect spot for ice cream<br><br>I get the same thing every time, gooey butter cake in a waffle cone, and it's always a 10/10<br><br>Don't hesitate to come here after a meal!", "pics": null}}, {"review": {"des": "Hands down our favorite dessert spot in Chicago. Jeni's just never disappoints. The flavors are always unique and scrumptious, and they have a few rotating flavors so there's always something new to try. We usually opt for the rotating flavors. This last trip consisted of a buttercrisp waffle cone with \"Popcorn! Peanuts!\" (Think pralines and cream but better) and \"sweet potato with torched marshmallow\" (by far my favorite season flavor). The waffle cones are the best I've ever had. Super buttery, crunch, and the perfect amount of salt to balance it out. <br><br>Jeni's is pricey, about $13 for two waffle cones, but 100% worth it. <br><br>Bonus? You can order online and have pints shipped to your home. Yes, please!", "pics": null}}, {"review": {"des": "I cannot get enough of Jeni's Ice cream!! OMG Jeni is a genius! <br>My favs: Brown Butter Almond Brittle and Wildberry Lavender. This location is always packed, I mean 99% of the time. But the smell just gets you...you know you want some ice cream. I always get the standard, that will get you 2 half scoops so you can try out a couple of flavors each time. The store made waffle cone is on the savory side, they're pretty generous with their salt in the batter. If you get it in a cup, they'll throw in a little wedge for you to taste. Seatings are limited, but usually people take to go. I will never pass on Jeni's. Love it!", "pics": null}}, {"review": {"des": "Dropped in for some mid-afternoon sugar and cream fix. The shop is airy, well lit, clean-looking, and 'cheery'. A very conducive atmosphere which would possibly enhance the ice cream buying and eating experience.<br><br>The flavor selection is not what I would call extensive, but the flavors offered would satisfy just about every discriminating ice cream foodies (and amateurs!).<br><br>Our group of 4 had three different selections. Jeni's ice cream has nice flavor, but is not what I would call rich and decadent. Sorry, Bi-Rite Ice Cream in San Francisco has broken my palette for any other ice cream to measure up to. My bad.<br><br>The employees are pleasant and helpful. They are a happy bunch too. I guess you would too if you served out quality sweetened & frozen milk products that make their customers swoon with delight.<br><br>If you're ever in this Wicker Park neighborhood, and are in the mood for some ice cream to scream about, I guess Jeni's just might be the place to go. <br><br>Getyerbrainfreeze on!", "pics": null}}, {"review": {"des": "I knew this name sounded familiar as they sell their pints at Whole Foods, but their store-front has won me over. This ice cream shop out in Wicker Park is super cute, bright, and clean. As soon as you walk in, you can smell all the sweet aromas of the ice cream and waffle cones.<br><br>The workers were extremely nice and patient with me trying multiple flavors before deciding what I wanted. I had a lot of trouble deciding, so decided to go for the Flight of Minis ($6 for 3 half scoops). I'm so happy they add in a waffle wedge because I'm a huge sucker for the waffle cones! (but wish I could have more than just one wedge) I settled for Sweet Potato with Torched Marshmallows, Brown Butter Almond Brittle, and Sweet Cream. The combinations of flavors they offered were beautifully done and something you wouldn't have thought of. Of course there's some classics as well too. My absolute favorite that I'd totally come back for is the Brown Butter Almond Brittle though. Next time, I'm definitely getting a cone of just that!<br><br>Jeni's Splendid Ice Cream is splendid indeed. They offer some of the best flavors of ice cream I have ever had! And of course there's always room for ice cream, so it's hard to say no.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/4ioOUM7O5XSW0Y12aPWb0g/348s.jpg", "caption": "Flight of Minis: Sweet Potato with Torched Marshmallows, Brown Butter Almond Brittle, and Sweet Cream."}]}}, {"review": {"des": "Indeed some splendid ice cream. Braved the Chicago weather during one of my short weekend trips and visited Jeni's for satisfying some ice cream cravings. <br><br>The place is clean, open, and very welcoming with decors of Jeni's ice cream pint prints all over the walls. The smell is all the more inviting since they make their waffle cones fresh. I settled for an ice cream flight since that'll help me enjoy a few flavors at once. I tried a bunch of flavors, both regular ones as well as seasonal ones before I settled for my 3 scoops.<br><br>The staff who helped out was very friendly and patient despite the crowd. <br><br>What I got:<br>* Brambleberry Crisp<br>* Wilderberry lavender <br>* Pumpkin 5-spice<br><br>OMG! They were all splendid and $6 for 3 scoops is such a sweet deal. The flavors are unique and rotational. Can't wait for my next visit!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Wyrpih1utT1mAk9hzsHsvw/348s.jpg", "caption": "Fresh waffle cones"}]}}, {"review": {"des": "I first discovered Jeni's in Columbus, Ohio and was thrilled when one opened up in Wicker Park. Great ice cream shop with very unique flavors. The cones are wonderful, you can smell the fresh baked batter from blocks down the street. I do wish that it wasn't as expensive as it is, and it can sometimes be extremely busy, creating large lines that stretch out the door. <br>Overall, if you're looking for heavy, tasty and satisfying ice cream, definitely consider Jeni's!", "pics": null}}, {"review": {"des": "Love this place! The sweet smell of fresh waffle cones, the amazing variety of flavors of ice cream....<br>Seriously, the ice cream is great! Very creamy and full of flavor! Try samples to see which one you'll like, and trust me you'll find a flavor you love. Best part is they don't skimp on the scoops as well. And you can watch them make the fresh waffle cones as you wait in line (big line but not a long wait!)<br>Stop in and have a sweet treat!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/IRHu_m7gQR9eUgh-dHPm9w/168s.jpg", "caption": "Waffle cones"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/s72wqXgFU24R3AN9a3wcIg/168s.jpg", "caption": "Inside"}]}}, {"review": {"des": "Jeni's ice cream is average. It's nothing special but it's alright. They have a ton of different flavors and offer a good variety but none of them wowed me when I sampled them. I like the atmosphere and I like how they display the calorie content next to each ice cream flavor (although its huge range that's most likely inaccurate). I didn't care for the ice cream I had here but I just don't think it's for me.<br><br>I say try it atleast once and see what you think. I'd give them a second try in the near future.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Ug1-yrkkFrhN8A_6Eo9WUw/348s.jpg", "caption": "Darkest Chocolate & Salted peanut butter"}]}}, {"review": {"des": "This ice cream shop has so many options!  There's something for everyone - classic flavors and really out there, flavors.  My favorite was the Bankok peanut with coconut, peanuts, and cayene.  They incorporate a lot of fun ingredients into their ice cream, and you can even get a sampler of 3 small scoops!", "pics": null}}, {"review": {"des": "Brown Butter Almond Brittle. Welcome to heaven, a place that smells like warm crisp waffles and sweet summer days. Also available in pint size.<br><br>Want to indulge in your sweet tooth and have your childhood comfort dessert at the palm of your heart? Go to Jeni's. Take all your friends and family. Win extra brownie points by introducing them to a Chicago staple. For extra brownie points, take your kids or nieces and nephews and watch them bounce off the walls with happiness.<br><br>Every time I go to Jeni's (which is four times a month- no shame), I acquire a new favorite flavor. This is made possible by the unlimited samples allowed before purchasing. So... yes, the line gets long and dreadful and almost a tease as you are standing there peering over at the creamiest of ice creams. But, patience in ice cream is a virtue.<br><br>Another favorite of mine Goat Cheese with Cherries because what better ingredient to go with milk than cheese. Crowd favorites are the Frose, Lavender, and also the Brambleberry Crisp. I just recently tasted the Watermelon and was instantly reminded of candy. SO SWEET.<br><br>You're so \"cool\", Jeni's!!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/1rTWd5YF3qNWY7l72KlBnw/348s.jpg", "caption": "BROWN BUTTER BRITTLE!"}]}}, {"review": {"des": "You truly cannot go wrong with Jeni's Splendid Ice Creams. Everytime I have visited Jeni's I am always in awe of the delicious flavors and fresh ingredients. <br><br>I have had to pleasure to visit the Jeni's in Lakeview and now this one in Wicker Park. I great thing about the franchise is that they make sure they offer the highest of quality service. When I first walked in all I could smell was the freshly made waffle cones they were preparing. It was unbelievable. I normally just get my ice cream in a cup but I had to try the waffle cone because the smell is what made me float into the ice cream shop. <br><br>The ice cream is definitely on the higher end of what you would normally pay for when it comes to ice cream but it is hands down worth every penny. You can tell that Jeni's uses fresh ingredients for all of their ice cream and cones. My favorite absolute favorite is the Brown Butter Almond Brittle. I only get that flavor because it goes well with every flavor combination that I have tried. <br><br>I would highly highly recommend stopping by Jeni's whenever you have a desire for delicious ice cream.", "pics": null}}, {"review": {"des": "It's always a pleasure to have ice cream at Jeni's and definitely worth the wait! I typically share a trio, but this time, I got my own. Goat cheese with red cherries, coffee with cream & sugar, and frosé. I chose these 3 flavors in particular because each of them had a unique taste and I've enjoyed each flavor separately. <br><br>Went in on a Thursday around 8pm. The line was close to the entrance of next door Beach House, but by the time I left, the line was toward the end of the block. Considering the long line, it moves fairly quickly as one server takes care of one group of people. You can try many flavors and choose what you like- hence the long line. <br><br>I love that they have new limited edition flavors for the season. I also like that they have the signature ice cream as well. I wish they still have Riesling poached pear ice cream. That is, by far, my favorite. <br><br>Oh, I totally didn't like their new buttermilk waffles. I wish they went back to the old waffles. It tasted kinda funky; not for my taste.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/_pdb86xcgL-ys0DZAehBDw/168s.jpg", "caption": "July 2018"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/MdB2Z2K44GDmyR3kOWF_UA/168s.jpg", "caption": "July 2018"}]}}, {"review": {"des": "Jeni's is an ice cream brand with a big reputation. On a Sunday afternoon, this Wicker Park location was positively packed with children and adults alike looking to grab admittedly pricey scoops of flavors like Bangkok Peanut and Brambleberry Crisp. The space is modern, though hectic, with peppy branding about their organic ingredients.<br><br>I sampled quite a few, and for me, most of them sounded more exciting than they ended up tasting, though by no means were any of them bad. It just fell short of that \"something special\" for me, as when I looked at a picture of it a couple months later I couldn't remember what flavors we got. The ice creams are pretty rich and heavy, though there are quite a few lighter sorbets.<br><br>Give it a spin if you're in Chicago. Expect a 15 minute wait for your ice cream. It shocks me that they don't have an NYC store yet.", "pics": null}}, {"review": {"des": "Three words: Gooey. Butter. Cake.<br><br>Went with some friends to Jeni's for the first time a few weeks ago on a Saturday afternoon. The line was out of the door but moved super fast. The staff was so friendly and let me try five or six flavors before I decided on the gooey butter cake. I can see why this place is so popular! I was so tempted to buy a pint to take home.<br><br>On top of the great ice cream, the location was super cute and very clean. Can't wait to go back!", "pics": null}}, {"review": {"des": "I knew I was at the right place when I saw a line out the door and down the street for this place. We finally made it in, and the smell of freshly-made waffle cones was amazing. While we were waiting, we watched the waffles get made right in front of us. <br><br>After sampling a few flavors (cream puff, goat cheese and cherries, brambleberry crisp) I decided on the lemon blueberry frozen yogurt. Ah-may-zing. Amazing. I actually almost went back the next day for the goat cheese and cherries, but decided to somewhat control myself and come back in 2 weeks.<br><br>You just don't see flavors and ingredients like that anywhere! I highly recommend.", "pics": null}}, {"review": {"des": "Wait: 20 Min for Wednesday night. We were having dinner across the street and there was no line but 15 Min later, ppl lined up up to the corner<br>Service: super friendly and super nice. You can try all the flavor if you want <br>Taste: go try. You won't regret. Tons of flavor and most of them r great.", "pics": null}}, {"review": {"des": "The flavors they offer is truly unique but based on a bad customer service experience, I will not be returning to support bad business. <br><br>A flight of 3 half scoop is priced at $6, but if you request one of the scoop to be placed separately then  it automatically counts as a kids scoop. That's just simple outrageous especially after I clarified the reason is due to my toddler's nut allergy. Please note, a kids scoop is $4 without anything additional.", "pics": null}}, {"review": {"des": "No better way to celebrate a nice warm sunny day in Chicago than with variety flavors of Jeni's Splendid Ice Cream. This was my first visit here at the Wicker Park location.  Tip... Street Parking is very difficult to find on nice days in this area. It's a very popular area with other businesses along the streets. It is also Meter Parking.<br><br>I was lucky to go around the corner and bam there was a parking space with my name written on it. LOL Ok Joking but there was an empty space.  <br><br>I wasn't the only one thinking of ice cream the line was quite long but I was willing and determine to get some good tasty ice cream. To my surprise it didn't take me long to be next up in line. I like the fact that you are able to taste as many flavors of ice cream before making your decisions. Its just so many flavors to choose from that you are caught up in an ice cream coma.  Here is another Tip... Jeni's have a tasting flight for only $6.00 where you can pick 3 flavors in a bowl or on a cone.<br><br>Thanks to Hudson for being so patient with me while I was deciding on which flavors to get. It was a hard decision for me. But Hudson was professional and kept me focus on the prize of some great quality flavors.<br><br>Jeni's Ice Cream is pricey but well worth every coin. Many unique flavors and the quality of taste is soooo good.", "pics": null}}, {"review": {"des": "Absolutely​, hands down, the best artisanal ice cream in the city.  I love the seasonal flavors and currently loving the watermelon FY.  So tart and cool but creamy because of the froyo.<br><br>Prices are steep but you know, this is bougee ice cream.​", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/QU6vLy-Ebu271O-QY2deuA/168s.jpg", "caption": "Delicious ice cream!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/W_cYYWKyOdJbbskx548xtg/168s.jpg", "caption": "Always has a very long wait."}]}}, {"review": {"des": "Okay this may be my favorite place I visited in Chicago! I was visiting a friend who has tried many ice cream places here and insisted this was the best, so off we went!<br><br>When you arrive at Jeni's, the line is deceiving in that it looks long - but you're in for an experience! The line is long because the employees encourage you to try as many flavors as possible! They want to make sure you get exactly what you want! We each sampled about 10 different flavors, which is nearly half their menu! The employees are also extremely knowledgeable and give you a little rundown on each flavor, how it's made, etc. when you ask to sample! <br><br>For a first-timer who couldn't narrow down her choices! The bowl of minis was perfect for me. Three scoops of different flavors with a piece of waffle cone in the middle! It was so hard to pick but I landed on the popcorn & peanut, butter cake, and the brown butter almond brittle ice cream. I literally can't tell you which one was the best because each bite was an ice cream lovers dream. I can't wait to come back and try more flavors. The experience was so pleasant from start to finish!", "pics": null}}, {"review": {"des": "Come satisfy your sweet tooth here! I don't even have one, and I am obsessed with this place. If you want to smell a little bit of what heaven smells like, walk on the same block as Jeni's (or you will smell it while waiting in line a block away)! With their freshly made waffle cones that are made to order, you will not be disappointed. Some people might scoff at the idea of a large group of people waiting in line outside of a small ice cream parlor, but once you try it, you would understand.<br><br>This place seriously does have some of the best ice cream I have ever had. I HIGHLY recommend the Cream Puff flavor, as well as the coffee flavor. I also love the Brown Butter Almond Brittle. The ice cream is so damn creamy and fresh, and the waffle cones are to die for. They have other cone choices, but if you pick those over the freshly made cones, something is seriously wrong. You can get full scoops, half scoops, multiple flavors, bowls, or pints of ice cream. <br><br>This place gives an unlimited amount of samples per customer. So even if you are nowhere near sure what the heck you want, the unlimited samples are a life saver. The workers are also very helpful in choosing a flavor you may like, as well, and they will also help you out on flavors that won't kill you due to an allergy you may have.<br><br>You know this why this place is so special? Because I never write good reviews on places that are popular, because I normally think they aren't worth the hype and extremely overrated; however, this place is extremely popular and it would be my choice for ice cream every time! Can't wait to come back!", "pics": null}}, {"review": {"des": "I cannot express how much I love Jeni's Ice Cream. The first time I have ever stepped into Jeni's ice cream was probably 3 years ago and ever since, I haven't gone back. But recently, I stopped by with couple of my girlfriends and I died inside. I just love the fact how unique Jeni's ice cream is and how delicious. <br><br>I definitely recommend trying the strawberry buttermilk and wildberry lavender. I tend to like the bowl with a waffle on the side. Two scoop is perfect amount for myself but if your a ice cream lover, go crazy and try as much as you want. I would say it is pretty pricy but worth it. <br><br>Brambleberry Crisp pint at your grocery store. If you don't like toasted oats, then you probably won't like it but other than that, its bomb dot com.", "pics": null}}, {"review": {"des": "Always bought Jeni's at my grocery store in California but when I saw that there was an actual store front when I was in Chicago, I knew I had to stop in. <br><br>This shop in Wicker Park is super cute, very aesthetic and in a great location. My brother and sister-in-law who live in Chicago were telling me that there is always a line coming out of Jeni's but I was very lucky since I came in around 1PM on a Thursday and there was no wait. It was true Ice Cream Heaven! Jeni's has the most unique and decadent flavors out there and quite honestly, I was very overwhelmed with the unique flavors as well as how many they have available, but again, I came in at a good time so I took my time tasting different flavors. The workers there were very sweet, nice and welcoming and were very patient with me since I did not know what to chose. After trying a couple flavors I decided on Wildberry Lavender and the Frose. WOW! It was soo good and the perfect combo between the two. <br><br>Wildberry Lavender had such a nice and creamy consistency and did not taste overly lavender. It had a sweet taste to it with coming from the berries, yet had that hint of aromatic taste of the lavender. It was soo yummy!<br><br>But my favorite had to be the Frose Sorbet! As soon as I saw Frose on the sign I knew I had to get it! As it says on their website, it is a \"Sangria-style frozen rosé with pear, strawberry, and watermelon. Refreshing and bright with a tinge of tartness\" that description is extremely stop on! It was super refreshing and helped me clean my palette from post meal. <br><br>Will most definitely come back!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/lj90ktG4u6o18LSbYLfvNw/348s.jpg", "caption": "Wildberry Lavender on top & Frosé Sorbet on bottom with a waffle cone!"}]}}, {"review": {"des": "(English)<br>Jeni's Splendid Ice Cream really takes its name literally. Their ice cream is really splendid, with many different flavors to choose from and the smell of fresh-made waffle cones its simply delicious. <br><br>Arriving to the store there was a large line outside, but it was moving really fast and without a doubt, it was worth the wait.  <br><br>The service is really nice and patient, you can try every flavor you want. I recommend trying the almond brittle, and goat cheese with red cherries, this may sound odd but the combination of sweet and salty is delicious, and in addition, the wild berry lavender is a must!<br><br>Definitely go to Jeni's is an amazing experience with delicious seasonal flavors.<br><br>(Español)<br>Jeni's Splendid Ice Cream realmente toma su nombre de manera literal. Su helado es realmente espléndido, con muchos sabores diferentes para elegir y el olor a conos de waffle recién hecho es simplemente delicioso.<br><br>Llegando a la tienda había una gran fila fuera de la tienda, pero se movía realmente rápido y sin duda, valió la pena la espera.<br><br>El servicio es realmente agradable y paciente, puedes probar todos los sabores que quieras. Recomiendo probar la almendra quebradiza (Almond Brittle), y el queso de cabra con cerezas rojas (Goat Cheese with red cherries), esto puede sonar extraño, pero la combinación de dulce y salado es deliciosa, y además, la lavanda de bayas silvestres (Wild Berry Lavender) es algo que tienes que probar.<br><br>Definitivamente ir a Jeni's es una experiencia increíble y con deliciosos sabores de temporada.", "pics": null}}, {"review": {"des": "My new favorite ice cream place of all time!<br><br>Firstly, their Wicker Park location is very cute with a bright wooden interior with small marble tables and a pretty neon sign (for those of you looking for a good Instagram photo).<br><br>As for their ice cream, they have so many unique flavors with a combination of both creamy and fruity flavors which is perfect for someone like me who usually prefers sorbet. After trying a few different flavors I got their Gooey Butter Cake and Brambleberry Crisp which were both delicious. I'll definitely be back!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/XzdPL34bsnAgw6530UxxWQ/348s.jpg", "caption": "Gooey Butter Cake (top) and Brambleberry Crisp (bottom)"}]}}, {"review": {"des": "I love the variety of flavors you can get at Jeni's. And each flavor is so unique! They let you try samples before choosing. My favorites are the strawberry buttermilk and brambleberry crisp. They also have calories listed out for each flavor which is appreciated! (But really not necessary because we all know dessert calories aren't real :D)<br><br>I love watching them make the waffle cones- and it also smells absolutely amazing! If you ask for the scraps that they cut off, they'll usually give it to you! I usually get the kid size (which is a half scoop) but honestly is already so much ice cream! The lines are usually pretty long but the workers are really good at keeping the line going and they work pretty quickly. <br><br>Love love love Jeni's, worth the line every time.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/UZu_x6bdmTk0YXfTsC2bBQ/348s.jpg", "caption": "So many unique flavors!"}]}}, {"review": {"des": "Jeni's is an absolute favorite! There's such a variety in flavor and the richness and quality of their ice cream is truly splendid! I was introduced to Jeni's through a Yelp ice cream tasting event from last year (my first Yelp event ever) and I've been a fan ever since. There are several locations in Chicago but I often frequent to this location in Wicker Park. My two favorite flavors are the lavender and bramble berry crisp. I'll usually order the trio, to get a combination of my two favorites and to try the seasonal flavor. Also another great thing about Jeni's, you can sample as many flavors if you are unsure of what to order. The service is always great here, the staff is very accommodating and will take time to explain any of the flavors and provide recommendations. You also have the option to purchase a pint of the flavors at their locations. Definitely give Jeni's a try, you won't be disappointed!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ArIFUQf0Syi1Tz64t0RpQA/348s.jpg", "caption": "Lavender, Brambleberry Crisp, and Sweet Potato with Torched Marshmallows"}]}}, {"review": {"des": "In a sea of sub-par Chicago ice cream, this place is quality. Always fresh and unique, you can't go wrong sampling three half scoops for $6.00.  Go with a friend and split, you get to try 6 different flavors. <br><br>It smells like heaven. <br><br>People in Chicago are not used to waiting in line for ice cream, so prepare for a wait, and enjoy!<br><br>Lots of great places for dinner in that neighborhood as well!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/HPYrQFbDUeH6Y7E9Cu70Ww/348s.jpg", "caption": "Line out the door...as usual."}]}}, {"review": {"des": "A huge selection of exotic and unique flavor blends served up in freshly homemade waffle cones.  Some of the flavors seem like odd pairings but most everything comes together surprisingly well, so don't be afraid to try something that seems a bit out there.  Decent sized scoops and even though the line can often be out the door it moves quickly.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/M53OHkMkWX_O1AjAvo5fiQ/348s.jpg", "caption": "A trio flight with a waffle crisp, great way to try a few different flavors at once."}]}}, {"review": {"des": "Oh my goodness yes! Their ice cream is DELICIOUS! My cousin and I ordered a flight of minis with 4 flavors. We ordered the brambleberry crisp, the dark chocolate truffle, the rainbow buttermilk frozen yogurt, and the frose sorbet. The server told us we would have to wait for the dark chocolate truffle so she gave that scoop to us for free. How awesome! We got the flights and omg they were all delicious. The frose really tasted so much like rose. The rainbow flavor was a little sour but was super creamy. The brambleberry crisp had some nice crunch to it. The dark chocolate truffle flavor was my favorite though. I love dark chocolate and this was just so decadent. I highly recommend these flavors if you also enjoy these too. The flight of minis is worth it!", "pics": null}}, {"review": {"des": "When the door opens to this place, all you can smell is heavenly ice cream cones. The famous frose sorbet did not disappoint. <br>Although in a dog friendly neighborhood, there's no dog friendly seating here -- so although the frose was Frenchie approved -- plan accordingly.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/7SSwwIKFGL5bDnIovNwO-g/348s.jpg", "caption": "Frose & Frenchies"}]}}, {"review": {"des": "I'm strictly writing about the most generic item you can get on the menu: the vanilla sundae. Of course, all of the fancy flavors will be incredible and I'm sure I would give them 5 stars, but to me, if an ice cream place can get the most basic flavor & sundae down, its got my vote. And this one did not. <br><br>A few months ago I was in Portland at the Salt & Straw, which is identical to what Jeni's concept is... same deal, I got the vanilla sundae. Except that one was phenomenal and Jeni's fell flat.<br><br>At Jeni's, the vanilla ice cream itself wasn't anything to write home about. It didn't leave me wanting more. It's almost if they were trying too hard. The chocolate fudge was great, whipped cream was alright. The nuts, well they threw everything off. Instead of being chopped up, they were whole, shelled peanuts. And they weren't tiny either. So each bite you took, if you had a nut in there, it was a mouth full of nuts! (And I know how that sounds...!) <br><br>I don't know, at the end of the day, it wasn't anything special.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Kn8yJ3E5D8N9tYLntZcaFQ/168s.jpg", "caption": "Vanilla sundae."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/HlqUP8w-19Ajfb1R_Fd5GA/168s.jpg", "caption": "Saturday night @ 8pm, packed!"}]}}, {"review": {"des": "This ice cream! This place! I traveled all the way from Rhode Island and refused to leave town without at least one trip to Jeni's. Jeni is one of my biggest inspirations in my own business, and I've been a fan of her pints for a while. Had to get to the shop while I was here! And it lived up to all the hype, and was worth the wait in line. Everything was perfect, and the service was fantastic.", "pics": null}}, {"review": {"des": "I'm going to be honest with you all and admit that I am not a big ice cream person. However, I am definitely a big Jeni's Splending Ice Creams person for sure! <br><br>The line is definitely long during the summer, but that's not a problem because you need all of that time to read the extensive menu and narrow down which flavors you'd like to try. I had an out of town guest and I think she sampled about 21 flavors while the attendant smiled and gave amazing descriptions of the ice cream. One time when I went I asked if they'd give me the scrap waffle pieces that they were throwing away and they put them in a bag for me! I was in heaven. Those things smell and taste incredible. <br><br>My favorites have been the brambleberry crisp, goat cheese with red cherries, and a lemon buttermilk frozen yogurt. I like having a balance of sweet and tart in my ice cream. <br><br>It's also the little things such as a sticker station, water readily available, and cute decor that make this my favorite ice cream shop in Chicago.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/eooAcPdmOTWbyiz_m6LjIQ/348s.jpg", "caption": "I love sprinkles!"}]}}, {"review": {"des": "I absolutely love this place!! I truly loved trying all of the flavors and luckily the girl helping me was nice about all my sampling. The line was pretty long so I can understand why employees might get irritated when people sample for a long time.. but also they need to understand that the people waiting in line are willing to wait and will probably take their time sampling as well. Another thing is, their ice cream is expensive so i mean I would really want to know my options before committing to a $6+ ice cream cone. The Pumpkin 5 spice seasonal flavor was my favorite, but i love anything and everything pumpkin so I am definitely biased. But I also got a second half scoop of the Buttermilk Almond Brittle which was one of the most popular flavors, and I can see why. The reason why im giving this ice cream a 4 star is really because of the waffle cone. It has the perfect amount of saltiness mixed in and that just did it for me. I even bought a second one after finishing my cone because it was so delish. There isn't much seating but we were able to find seating so couldnt really complain. Overall, this ice cream is delicious but nothing extra special from other ice cream parlors i've been to because i just really love LOVE love ice cream. Thanks Jeni for creating amazing flavors and the best waffle cone evarrrr.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/JAbQbZLZMJ5Jbb-1ydNWRg/348s.jpg", "caption": "Seasonal flavors for Fall 2018"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/gO57MF5D1-1ljoeEAk6Bkg/168s.jpg", "caption": "Store front"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/QVkbvQh-0vRslANnT0xUlQ/168s.jpg", "caption": "Pumpkin 5 Spice and Buttermilk Almond Brittle on the borrom"}]}}, {"review": {"des": "Yum! I got the trio with the waffle chip. My chosen flavors were goat cheese & cherry, salted caramel, and peanut butter with chocolate flecks. The goat cheese & cherry was an unexpected hit, and I'd definitely buy a pint of the peanut butter. At least go for a smell--the store smelled of delicious waffle.", "pics": null}}, {"review": {"des": "Love Jeni's and love that they come up with interesting flavors! <br><br>It's super decadent IMO, so a half scoop does it for me!", "pics": null}}, {"review": {"des": "I have been told so many times to go here. And having lived in Wicker park for the last 2 years, it was about time that we actually made it here. Everything was absolutely delicious, and to be honest, less expensive than most traditional specialty ice cream places (coldstone). I also really enjoyed the different flavors a lot. One that surprised both of use was the vegan Chocolate truffle. Seeing as both of us have become less tolerant of dairy lately, it was relieving to find some ice cream that wouldn't hurt our stomachs more so down the road. lol. I'm excited to come back again soon!", "pics": null}}, {"review": {"des": "This ice cream is very creamy and perfect for a hot humid day. There are a ton of fun flavors here and they're generous with sampling! <br><br>Their coffee with sugar tasted exactly like coffee. It was not bitter at all! I also got the milkiest chocolate to pair with it. I thought that one was decent too. The cream puff one was okay, not what I was expecting.<br><br>Their sugar cones went well with the ice cream.<br><br>Interior has plenty of seating as well!", "pics": null}}, {"review": {"des": "Hands down my favorite ice cream shop in chicago. There are so many locations now! I love the vibes and aesthetics at Jenis but more importantly the ice cream is incredible. The \"bouncy\" texture is great and it's great how there are always new flavors to the each season in addition to the classics.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/7NKKhJE_7jerkaGwEa2o6g/348s.jpg", "caption": "Goat cheese and cherries, coffee and cream and chocolate truffle"}]}}, {"review": {"des": "If you walk by Jeni's and think \"is there seriously a line out the door for ice cream?\" then my friend, you have never experienced Jeni's before. I don't think I've ever come here when the line isn't out the door, but it is 1000000% worth the wait (and the line moves fast anyway).<br><br>First of all, you sweet smell of waffle cones while you're waiting in line will make you want to stay there forever, so you won't complain while waiting in line. And the wait allows you to contemplate which of the huge selection of flavors you want to try. And yes, you can sample as many as you want. It's a dangerous game though, because they're all phenomenal. <br><br>2 scoops (technically 2 half scoops... but they're full scoops) in a waffle cone is more than enough to fill you up and leave you with a HUGE smile on your face. What I really like about Jeni's is that they ask you which of your 2 flavors you'd like on top. It may not sound like a big deal, but you'll be thankful when you finish your first flavor and realize you saved the best for last.<br><br>Long story short, eat this ice cream always.", "pics": null}}, {"review": {"des": "They're expensive but so worth it. <br>The quality: Thick, dense creamy ice cream; take small bites, because it is intense. The cones are fresh and a highlight.<br><br>The flavours: So creative, more ice cream parlors need to take a page from them.<br><br>The customer service: Excellent, I was given as many samples as I wanted with little pressure.<br><br>If Chicago was a more boring town with less to do, this would be a top ten attraction for all tourists.", "pics": null}}, {"review": {"des": "Really good ice cream! They make fresh waffle cones -- you can see one of them cutting the cones up right as you stand in line. <br><br>The brown butter almond brittle flavor is a standout. I love the chunks of brown butter within the the creamy ice cream. I thought I would love the lavender flavor, but it was little too strong for my liking and tasted a bit odd / strange after the brown butter almond brittle.", "pics": null}}, {"review": {"des": "Yum! As soon as I walked into Jeni's, I felt like I was in ice cream heaven. About four years ago my husband and I traveled to Portland where we tried our first hipster/gourmet ice cream at Salt and Straw. The ice cream we had there was pretty great, and I didn't think anything could top it. Jeni's proved me wrong.<br><br>I love the decor and homey vibe, and the girl behind the counter was friendly and knowledgeable. I'm pretty plain as far as ice cream goes; my favorites are cookies and cream or strawberry, and I very rarely stray from these two flavors. My husband is more of a daredevil when it comes to trying new things. My husband and I tasted a few different ice creams, and I settled on the almond brittle and the buttercream. I got the standard order ($5 for two half scoops) on a waffle cone ($1). My husband got a flight of ice cream, and while I can't remember the exact flavors one was eggnog, another was dark chocolate, and the final one was peanut butter.<br><br>WOW. The ice cream was CREAMY, smooth, tasty, and just all kinds of amazing. I kept hoping I didn't have to stop eating!<br><br>Sadly, all good things must come to an end. I'll be headed back to the San Francisco Bay Area this weekend, and I'm hoping there's a Jeni's nearby. If not...Jeni, we need you in the Bay Area!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/hLsFHM-hn7GXOdBjIO12bQ/348s.jpg", "caption": "Fresh waffle cones $1 extra"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/jEsycs668NvwWo--Eqb8cw/168s.jpg", "caption": "Ice crrrream"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ouq90A58HnEtNYiHAU2JIQ/168s.jpg", "caption": "Menu"}]}}, {"review": {"des": "OMG, this waffle cone blows all other waffle cones out of the water. So good! I got the brown butter almond brittle. A little salty and not overly sweet. Delicious and unique!", "pics": null}}, {"review": {"des": "Yummy! Jeni's Splendid Ice creams is headquartered in Cleveland, Ohio. I hadn't tried Jeni's until my Chicago visit. Delicious. You can sample their flavors in cute metal scoops. There was a very long line! It's understandable why! The ice cream is delicious! So rich! I'm not sure I can say what my favorite flavor is. They're all delicious!", "pics": null}}, {"review": {"des": "Cutest Ice Cream shop! Decor is so simple and inviting. Was able to taste quite a few of the flavors. Tried Lemons and Blueberries Buttermilk which was a little to tart/sour. The Cream Puff flavor was a really good one - sweet but not too sweet. I ended up ordering a kids scoop in a cup of the Dark Chocolate Truffle because it was dairy free. Yay thank you Jeni's! It came with a small piece of waffle cone which is a nice touch. They even have an ice cream flight option which is very popular. We got here before the rush because when we walked back by an hour later there was a line to go in. A must when in Chicago!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/DqbHuSGCVFTzeE9DFAfU2A/348s.jpg", "caption": "All for the love of you"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/PAib4urRjyJFbN7Mv3C4aQ/168s.jpg", "caption": "Cream Puff and Dark Chocolate Truffle (Dairy Free) kids scoops in cup"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/6dn3jFAHkHzPRaN_deietQ/168s.jpg", "caption": "Inside"}]}}, {"review": {"des": "Big fan of Jeni's! They never disappoint with the inventive and rich flavors! And their waffle cones are delicious. <br>There's never been a time when there wasn't a line through the door, so obviously they're doing something right! It's a staple wicker park establishment and I cannot imagine not going there for a fixing to my sweet tooth! That being said they are a bit pricey and I do sometimes wish they had my childhood staple flavors such as straciatella and Nutella. But overall this is a great dessert spot.", "pics": null}}, {"review": {"des": "Love me some Jeni's!<br>Who wouldn't love an endless offering of samples before you indulge in one of the many beautiful flavors? <br>My personal and current favorite is their dairy free dark chocolate truffle option. Wow! It pairs well with a cake cone and is just the right amount of sweet and chocolaty. <br><br>Other favorites are their street waffle, salty caramel (not too salty like myself), intelligentsia espresso and brambleberry! Yum.<br><br>I will say that their Frose is unreal but way too sweet for my liking. I always make sure to get a sample so I can pair it with whatever I choose.", "pics": null}}, {"review": {"des": "The rumors are true. The ice cream is so good and also unique. Flavors that you really can't find in too many other places. I enjoyed the sweet potato and the Matterhorn. I definitely intend on coming back and throwing more money at them to try their other flavors.<br><br>Not only that, the service is super cool and knowledgeable. They'll totally help you find complimentary flavors.", "pics": null}}, {"review": {"des": "The customer service, unique flavors and fresh waffle cones speak for themselves. I remember when I first visited a Jeni's I was almost offended at the price ($5 for 1 scoop????). Since then I've fallen in love with their amazing ice cream (oh that flavor and texture that I can't find anywhere else), and I've also learned how to order to get the most bang for my buck: get a Trio (3 half scoops), then get additional half scoops at only $1 each!! It's perfect if you want a lot of variety (hey the half scoops aren't as small as they sound) and great to share. <br><br>I love that no matter how long the line gets, the employees are trained not to rush through each customer. They treat every customer with so much energy and respect, explaining the flavors and not rushing you through sampling. I think that's the true Jeni's difference - and the reason why people gladly wait 20-30 min in line for it! <br><br>If you want to avoid the lines then avoid post-meal times. In the middle of the afternoon is generally a safe and calm time to visit!", "pics": null}}, {"review": {"des": "Jeni's splendidly pricey ice cream was decent but not my fave. Very interesting flavor combinations and I sampled a few to narrow down choice for Flights of minis (3 mini scoops). Blackberry Buttermilk was too much like sour milky w/ bitter berry flavor. Brambleberry crisp was decent, but the Gooey Butter Cake was the best surprisingly since I don't care for butterscotch nor Carmel which are in the mix. For the price $6 the trio wasn't priced bad since one scoop was $5.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/LduRcawv6dEw2IBs_mnD2g/168s.jpg", "caption": "Menu board. Good waffle cone."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/PGT4SwfWW0ZmykElNo4RKA/168s.jpg", "caption": "Trio = 6$. Brambleberry Crisp, Blackberry Buttermilk & Gooey Buttercake."}]}}, {"review": {"des": "My fav ice cream place in Chicago! My fav flavors are the goat cheese and bramble berry. Love love love. <br><br>Pro tip: if you want to be economical and are willing to share with your friends, get the flight of minis - it's 3 scoops for $6 and you can add as many scoops as you want for $1 each. My friends and I got 6 scoops for $9 so we each got 2 scoops for only $3 each.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/W4SBIVvE8z76MYYz2Z8I2A/348s.jpg", "caption": "Flight or 6 minis!"}]}}, {"review": {"des": "The best quality ice cream in the area! With that said it's $5 a scoop, may seem pricey but it is worth it. My favorites are the dark chocolate truffle and cookies and cream - the frose was good too! I usually never see a line, but I did once on a Sunday evening. I definitely recommend ice cream lovers to try this place out.", "pics": null}}, {"review": {"des": "Heard so many great things about Jeni's so we decided to come after our dinner next door. The line wasn't around the block as it usually was but was still crowded inside. It was a little disorganized for me, since everyone was hovered around trying to order or get a tasting. The people working weren't asking people like how they were lined up. They were asking who hasn't been helped so people behind us would cut us in line. I got the frose, which was great, but strong, which i didn't mind. All the flavors looked very unique and different. I'll have to come back try a different the next time!", "pics": null}}, {"review": {"des": "I love Jeni's and I've been here twice this past week. I love coming here.  I love smelling the sweetness before you walk through the door. I love getting three scoops of ice cream on one cone. I don't even mind the long wait on line. My current favorite flavors are brambleberry, watermelon frozen yogurt, and wildberry lavender. This ice cream is like heaven in my mouth. There are so many flavors to choose from and from sampling a bit of everything I feel like they can do no wrong when it comes to ice cream. <br><br>But what happened to the original waffle cone?! I do not like this new buttercrisp waffle cone, it's too salty. And the sugar cone just doesn't do it for me. I was really disappointed when I found out that they discontinued the old waffle cone, it was perfection. My favorite part about getting Jeni's used to be getting down to the last scoop of ice cream and bitting into the waffle cone with the remaining bit brambleberry ice cream that melted to the bottom. Now I just don't want to do that. I don't want to bite into the new salty waffle cone. And the sugar cone isn't wide enough for the ice cream to melt down to the bottom. <br><br>Just please bring back the original waffle cone flavor. It's not the same without it, Jeni's.", "pics": null}}, {"review": {"des": "Been to different location of jeni's icecream. I would say nothing different. Icecream is delicious! I always feel happy when I enter the store. The sweet smell of freshly made waffle cones and the sight of seeing large amount of different homemade icecream. I would highly recommend this place for my family and friend to come to grab something sweet to end the night or even start the afternoon.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/EvHZhA0d1qoz4DJVgV0Whg/348s.jpg", "caption": "Dark chocolate truffle, peppermint chocolate, wild berries lavender and lemon butter Sweet Cream"}]}}, {"review": {"des": "The Best Tasting Ice Cream I have had in a long time.   4 stars because nobody there seamed as excited about ice cream as I was.   Not rude in any way, just not ice cream shop vibe coming from them.   Again... stop in and enjoy a scoop ($5), or three scoops there, lard butt!   You won't be disappointed, it is great ice cream.", "pics": null}}, {"review": {"des": "A million (ok maybe closer to 30) unique, amazing ice cream flavors served by ultra friendly staff. Staff that doesn't get mad at you when you try a bunch of different flavors. Yes, they will provide you a small silver spoon worth of any flavor you'd like to sample. On my most recent trip, I ordered a cup of Riesling Poached Pear Sorbet (really just tasted like pear) and Rainbow something or other (it was a really tart and fruity one) - both were refreshing and amazing.<br><br>Warning that you will ALWAYS have to wait in line but it usually goes by pretty quickly. The line was just out the door when I got there (shorter than it usually is) and think I got my ice cream within 15 minutes. Plus I've typically been able to find seating afterwards.", "pics": null}}, {"review": {"des": "Not gonna lie. I had a Jeni's problem. Thank goodness I don't live within vicinity of one currently, and I've been more sensitive to lactose as of recent.<br><br>But next time im near one.<br>GAME OVER.<br><br>There are a crapload of amazing flavors. Don't be afraid to try! I've tried everything practically, and probably pissed off the huge line behind me. Beware, the lines for this place can get soooooo freaking long. But the workers are pretty good about being timely and efficient. <br><br>My favorites are the brambleberry, brown butter almond brittle, wildberry lavender, black cat expresso, buttermint and one of the chocolate peppermints flavors<br><br>i do get a bit overwhelmed  as there are so many flavors.<br>but if it helps, i've never tried a flavor i didn't really like. there are just certain ones i prefer to the others.<br><br>this place is pricey, so if you feel like treating yourself, definitely go here.<br><br>i tried to make full use of mailing a million postcards when they were doing this write a postcard/and they'll mail it thing<br>which i hope they bring back because they were cute gourmetish looking cards of their flavors, and my friends were delighted to receive these postcards!", "pics": null}}, {"review": {"des": "Jeni's Splendid Ice Creams was very splendid! The ice cream flavors were unique, fresh and exquisite! I loved them so much, we tried to go twice on our week long trip to Chicago. Alas, there was a power outage, so we only got one taste.<br><br>For that wonderful day, we lined up outside on a perfectly sunny summer day. The line stretched out the door and bent around the front of the store. Once you get inside the store, the aromas were heavenly. It smelt of waffles and fresh baked goods. This was thanks to the freshly wrapped waffle cones. <br><br>The line is long, and moves slowly but the customer service was excellent! You get to taste the ice cream prior to deciding. My friend strongly encouraged that I taste the flavors prior to committing. I tried the Riesling Poached Pear and the Wildberry Lavender. I ordered the flight of Minis (3 mini scoops) plus one extra scoop (total= $7). The flavors were: Riesling poached pear, wildberry lavender, Intelligentsia black cat espresso and the Brambleberry crisp. <br><br>The Riesling poached pear was a sweetened intensely-beautiful pear flavor. You can taste the gritty-granules of pear skin. The Wildberry Lavender was a fragrant semi-sweet bite of very-lavender ice cream. The espresso coffee ice cream was amazingly addictive and tasted like an affogato. I loved eating this! The Brambleberry crisp was my favorite: blackberry creaminess with chunks of crisp, it tasted like eating a soft blackberry pie. <br><br>One of the best ice creams that I've ever had! Thank you Jeni's!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/WuGN9CgWlN5fZepvSKtHRw/348s.jpg", "caption": "Bramberry crisp"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/1lSTVvMB583KGsDZPKsQlQ/168s.jpg", "caption": "Starting at the left, clockwise: Bramble berry crisp, Wildflower lavender, intelligentsia  black cat espresso, Riesling poached Pear"}]}}, {"review": {"des": "First off, you need to know, ice cream is my Thing! And Jeni's completely delivers. I didn't try a flavor I didn't like. I landed on a buttermilk and blackberry flavor. It. Was. Everything! The staff was nice and extremely knowledgeable. It's a must try.", "pics": null}}, {"review": {"des": "Not life changing ice cream, but definitely a nice treat when you want to be kind to yourself. Jenis has a lot of unique ice cream flavors, like pear sorbet, but I'm more hesitant about paying $5 for a single scoop on a regular basis. I'd actually opt for the ice cream flight - 3 half scoops for only $6, and the portion size is definitely almost double that of a single scoop. Also, you get free ice cream on your birthday! My friend and I coincidentally came here on her birthday so she was able to enjoy free jenis, which was such a sweet way to end a special day.", "pics": null}}, {"review": {"des": "Never a disappointing moment at Jeni's! Love their creative flavors and would always be down to come here any time of the day.<br><br>Really awesome perks of this place include unlimited tasting of all their flavors, seasonal selections, a free waffle piece that comes with ice cream in a cup and complementary cucumber water to clean your palette. My all-time favorite flavors are the lavendar, ylang ylang (seasonal) and the black cat espresso. I'm not a big fan of the creamier flavors like pistachio & honey, but have heard other friends rave about it. I would think any ice cream lover will find their niche in at least one of the flavors here!<br><br>The only downside is the often long wait that trails out the place. There's also limited seating and it gets crowded--but I think these are just things to expect from a popular place.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/GXU-kjf5Q9UrVVcHX-E1CQ/348s.jpg", "caption": "Waffle piece with flights of minis: Wildberry Lavender, Pistachio & Honey, Intelligentsia Black Cat Espresso, Lemon Buttermilk Frozen Yogurt"}]}}, {"review": {"des": "This is by far some of the best ice cream I've ever had.  They have unique and yummy flavors.  The place is clean and comfortable and the employees are extremely friendly.", "pics": null}}, {"review": {"des": "First, I love ice cream. Second, I love GOOD ice cream. Third, I LOVE AMAZING ICE CREAM.<br><br>Jeni's definitely an amazing ice cream place where I can fully enjoy every bite or lick of my ice cream. This is not heavy as Ben&Jerry nor as thick as gelato, so I love coming to Jeni's. <br>Also, this is the only place I can find unique flavors like LAVENDER! <br>You might say, ewww flower flavor? doesn't that taste like soap? <br>Nope, it does not. It tastes so soft, mild, and delicious; the color is so pretty too. <br><br>The staffs here were really nice. Even tho they were busy, they kindly recommended us flavors and let us sample at least 3 flavors! They were so patient with my indecisive friends. <br><br>Menu Recommendation:<br>1. Lemon  & Blueberries <br>2. Wildberry Lavender<br>3. Pistachio & Honey", "pics": null}}, {"review": {"des": "Mmmmmmm Jeni's Splendid Ice Creams is aptly named, though if it were called Jeni's Magnificent Ice Creams or Jeni's Mind-Blowing Creative Ice Creams, that would also suffice. Although the line was long, it moved pretty quickly, and while I was there, the length of the line remained the same (read: out the door). The fragrant aroma of freshly made waffle cones wafting through the air was the most tortuous part of the wait, but man these ice cream flavors are amazing!", "pics": null}}, {"review": {"des": "You have my heart, Jeni.<br><br>Each time I've been here there has been a line out the door. However, it moves fairly quickly and be sure to keep that door shut or else they will yell at you (read the sign, peoples). They have a great variety of seasonal flavors! I try to be adventurous and get a sample of something new but I still keep on coming back to their brown butter almond brittle. It's to die for. The sweet cream is also amazing. I have yet to try their other signature flavor, bramble berry crisp. It's been crossed out both visits :/<br><br>You can see that their waffles cones are constantly being freshly made so that's a plus. Can't go wrong here! High quality ingredients. Great service. Best ice cream in Chicago. It's worth the journey.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/CGYYAFdn8Zdm2AWP00ELHg/348s.jpg", "caption": "Trio: sweet cream, brown butter almond brittle, & ndali estate vanilla"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/EswKHNHaq0F8LupKuOmiMw/168s.jpg", "caption": "Hard cider sorbet (seasonal)"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/a__99Zc_aFkJgcOj_ZU7zA/168s.jpg", "caption": "Lemon and blueberry bfy"}]}}, {"review": {"des": "They had really good ice cream.  the cones are like butter and melt in your mouth.  very good place for ice cream", "pics": null}}, {"review": {"des": "Went here with a group of friends and man did we make the right choice! The line was long but the staff kept it moving while also allowing many to taste test the flavors. <br><br>Food: There is a wide variety of delicious flavors from dairy free options to classic favorites with a twist. I had a flight of three different flavors, as did many in our group, and I was ecstatic with my choices. Brambleberry Crisp to get my ice cream/pie combo going, Cream Puff for the delicious cream taste with flecks of cream off dough, and cookies and cream to enjoy a classic favorite of mine. Each ice cream had a great balance of ice cream to addition; there were gooey streaks, crumbs of crust, and bits of cookies in the respective flavors which was a wonderful mixture. I especially enjoyed the piece of fresh waffle cone that was included. <br><br>Consensus: I've been to many boutique ice cream shops and this is in the group at the top. A great selection of flavors and delicious concoctions of classic and crafty scoops leaves you wanting more after you've finished.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/7gQyvlvCqH6X7Ncuzy0QYQ/168s.jpg", "caption": "Brambleberry Crisp and Cream Puff!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/9gd-OkusRF4PGp3_HowzBg/168s.jpg", "caption": "Wonderful Menu Selections"}]}}, {"review": {"des": "This place is so expensive but worth it because it is just the best ice cream in Chicago. Lots of creative flavors, plus the classics. Often a very long line. Decent service though", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/7By9sQjs-FqLbhYHmsjfkw/348s.jpg", "caption": "Frozé, brambleberry crisp, salted caramel,"}]}}, {"review": {"des": "How can you not love this place? Endless samples before you choose from their what seems like endless flavors. Not to mention their 3 (!!!) vegan flavors. This is actually the second one I've been to. The first being in Ohio near OSU. But this location has a non water based dark chocolate vegan ice cream so I had to go again and I'm so glad I did. It has a coconut base so if you're not a fan of that you may not like it. However... I adore it. I could have ate a pint of the thing but I held back. Came with one vegetarian & one omni and they both got a scoop of it too. I think it's a best seller tbh. Also this place is considered to be Joe Bidens favorite ice cream shop so if my review doesn't sway you to try it out hopefully that will! Only downside is that there's not a lot of space to sit but they do the best with what they have. I only wish they were a bit cheaper (5$) per a cone is kind of pricey even for vegan ice cream. <br>Overall I would definitely come back. 5/5", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/PD0ZW1YYW1ePGnkrUklvwQ/168s.jpg", "caption": "Great sign for instagram"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/7oZTiA0JvrRPxWoWbHJzDA/168s.jpg", "caption": "Dark chocolate truffle has us in love"}]}}, {"review": {"des": "After hearing rave reviews of Jeni's, I tried a few flavors to get a good sample. The prices are kind of difficult to reconcile, but the product is decent. We had 3 scoops and tried bumble berry crisp, chocolate peanut butter, and cookies and cream. All were good and rich and came with two slices of waffle cone. My all time favorite is Graeter's, so I think Jeni's still falls short.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ojRcLL7gs301JewNisstQQ/348s.jpg", "caption": "Yum"}]}}, {"review": {"des": "I came here last night for a late night treat with some friends while attending a BBQ in Wicker Park.  The smell of the waffle cones being freshly prepared was amazing.  The line moved pretty quickly and we were able to enjoy our ice cream in the park on a beautiful summer night.", "pics": null}}, {"review": {"des": "Located in a pretty hip neighborhood, jeni's was packed on a hot Saturday afternoon. We bought into the hype and went in. The ice cream shop offers an overwhelming number of flavors. Some of them were unique like sweet potato and berry crunch. <br><br>I wasn't particularly impressed with the ice cream after sampling a few of them. The texture was good but I didn't like the sugary aftertaste. The ice cream is also pretty overpriced - $5 for a single scoop! The place is well decorated and looks instagrammable, but I was just disappointed with the ice cream itself.", "pics": null}}, {"review": {"des": "This place is amazing and I love coming here. During the summer months and sometimes throughout the year I stop by for this treat. <br><br>Ambiance it has a cozy feel with table that are very close together. I think it has a relaxed vibe to it where you can just hang out or even bring a date for ice cream. <br><br>Staff  I love how they were always ready and willing to answer any questions. The amount of spoons they give you for free samples is also another bonus. I pleasantly enjoyed my interaction with the staff.<br><br>Food/ice cream The ice cream was sweet and creamy. One of the best ice creams that I've had. I like the wide selection of flavors.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Q677S_WAgc_A85WzIm-UKQ/348s.jpg", "caption": "Great Ice Cream"}]}}, {"review": {"des": "The moment one of my friend's mentioned Jeni's, everyone else bandwagoned and insisted that we all go there for dessert last night. And I can see why the place is so hyped up. Half of their menu are signature flavors and the other rotating limited edition flavors, but don't think that they're the \"typical\" flavors you'll see at an ice cream shop. There's anything from Wildberry Lavender to Middle West Whiskey and Pecans. A group of 4 of us split a trio + extra scoop for $1, with 3 signature flavors and 1 limited edition flavor.<br><br>You can have unlimited samples with these long metal spoons that are recycled in a container at the end of the counter. Staff were pleasant, as much as they can with an ongoing line to the door. The ice cream is generally rich and VERY creamy, which means they melt quickly so dig in! <br><br>Signature Flavors<br>Brambleberry Crisp - Perhaps the most mind-boggling of all the options we picked. Oat streusel, brambleberry jam, and vanilla ice cream. I guess brambleberry pie in ice cream form. But I don't think that description begins to do it justice, you just have to try it for yourself!<br><br>Intelligentsia Black Cat Espresso - This one has a kick to it! Holy espresso! What you'd think coffee ice cream would taste like but boosted with 3 shots of espresso. <br><br>Churro - Think horchata and graham crackers in ice cream form. By far my favorite. Possibly due to my love of cinnamon and sugar and nostalgic craving for cinnamon-infused Mexican hot chocolate and horchata.<br><br>Limited Edition Flavor<br>Roasted Strawberry - I was trying to figure out the \"roasted\" part of this. The menu says that it is \"Intensely flavorful Ohio strawberries and tangy buttermilk.\" Again, maybe there's roasting either of the strawberries or the buttermilk, but this one was perhaps more aligned with the usual ice cream fare of other locations.<br><br>Would come back here if I'm prepared for a line and some crazy good ice cream flavors. Not my absolute favorite ice cream textures, but their flavors have got me hooked.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/wYL62TNBIRwNmF8V4JfyQA/348s.jpg", "caption": "Side view of the trio + 1 extra scoop for $1!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ehP5RsD2kcrT2vvzMsWD1Q/168s.jpg", "caption": "Paper menu and clockwise from the top: Churro, Roasted Strawberry, Brambleberry Crisp, and Intelligentsia Black Cat Espresso."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/5AGifuCIbNpTBHN_zjoB1A/168s.jpg", "caption": "Some of the signature flavors."}]}}, {"review": {"des": "I'm not a huge fan of ice cream - mostly having one kid sized scoop and I'm done, but here at Jeni's I couldn't stop myself from devouring a trio-sized portion of the delectable flavors they offer.   It's started a newfound love in me for ice cream which is the only downside since there are no Jeni's shops near me.  :(  WIll be back!!", "pics": null}}, {"review": {"des": "I can't believe this was my first time at Jeni's! I've absolutely been missing out on some slightly over priced but totally worth it ice cream! I tried the butter rum cake and peanut butter with chocolate flecks and both were great! They have a wide array of super interesting and unique flavors, and they're willing to let you try many of them before deciding. Despite the steep prices, if you're an ice cream lover you should definitely give this place a shot!", "pics": null}}, {"review": {"des": "Great ice cream, but line is kind of long but it goes pretty quickly.  The staff here are all very nice.  I saw the girl making the waffle cones and she offered samples to these younger child er show we're watching her make them.  The little things make such a big difference ! <br><br>We did the flights of minis so we were able to choose 3 different flavors.   We got the green mint chip, salted peanut butter and the orange sorbet.  <br><br>Yummy is all I have to say!  The flavors were exactly how you would imagine and more tasty.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/U6k6qjcisNOaeycLZF3sLA/348s.jpg", "caption": "Menu!"}]}}, {"review": {"des": "Where do I start? Jeni, you don't know me but I love you.<br>This is the best ice cream I have ever had and I have been places people.lol<br>Fresh, unique, every scoop is worth it. I try to try seasonal flavors but my all time favorites are sweet cream, darkest chocolate, milkiest chocolate,brown butter almond brittle , espresso and pistachio& honey.<br><br>If you're a chocolate lover go with the darkest chocolate,'I bet you a scoop that you'll like it. <br><br>Service<br>Very patient servers who allow you to try samples and give good recommendations.", "pics": null}}, {"review": {"des": "The line here was ridiculous, basically down the block and almost felt like a social experiment where people were just lining up to line up to see what the fuss was about. But once we were in line it went fairly quickly, and the few flavors I tried were great. <br><br>I got their supermoon flavor which tasted like some childhood cereal I can't quite place, and my sister got their espresso flavor which might be the best coffee ice cream either of us have ever had.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/mJvuHwij5zo-HVlGUdBIcA/348s.jpg", "caption": "Supermoon + sprinkles"}]}}, {"review": {"des": "Brown Butter Almond Brittle. Best. Flavor. Ever.<br><br>Their homemade fresh waffle cones are delicious. Omg you can smell everything as you wait in lines! The Line is extremely long at peak times so plan ahead and try to beat the rush during off times. <br><br>I can't deny how delicious their ice cream tasted but I was disappointed at the lack of variety of flavors. When we went, Cream Puff was already sold out and so was another one. I heard from locals that they use to have more flavors..... I don't know why they shortened the list. The ice cream is great, I would go back for the Almond Brittle any day. I am glad they sell pints in certain grocery stores! I will be keeping an eye out for them.<br><br>Tip: Go for the Flight of 3 half scoops of ice cream. it gets you the best bang for your buck (unless of course you want a full giant cone to yourself!)<br><br>Birthday Club: For $200, you can get pints of Jenni's ice cream shipped to you 4 times a year! Perfect gift for yourself or your favorite ice cream lover!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/eSbODdBkI0WFdjfQzDmjEg/348s.jpg", "caption": "Fresh waffle cones. Delicious!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/IinCf-GMu2D4L7vZQI9bpw/168s.jpg", "caption": "Metal spoons for tasting! No waste from the plastic spoons!"}]}}, {"review": {"des": "I didn't know this place was so popular, came at 10:30 pm and the line started outside the door. It didn't stop until closing time. They have pretty unique flavors. Tried a few, they're all delicious!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/iuzCG4qZy5GNJZNC4ZoTBQ/168s.jpg", "caption": "Honey pie on the left and goat cheese and cherries on the right. Delicious!"}]}}, {"review": {"des": "First time here me and my sister both sampled brambleberry crisp and loved its unique taste. I ordered a single scoop of brambleberry which is a pretty large scoop . She had a trio with lavender (so good), sweet potato pie, and brambleberry. Can't wait to try more flavors.", "pics": null}}, {"review": {"des": "HOLY mackerel. First of all, the service here was AMAZING. The girls behind the counter were friendly and helpful, answered questions, described the flavors, and made suggestions for yummy flavor combinations.  I went with one scoop watermelon and one scoop frosé on a waffle cone. The waffle cone is made in house - you can watch them being made - they are super duper fresh and the flavor is so good. The frosé tasted a little bit like sangria meets rosé, frozen into a pretty dark pink ice cream. It was pretty delish, but the watermelon?  Definitely get the watermelon. Super refreshing and light on a hot day. I can never finish a regular ice cream cone, but I ate every last bit. I can't wait to go back.", "pics": null}}, {"review": {"des": "My friend's wife claims to know Jeni personally. Apparently she's a meticulous and exacting craftswoman, not at all given to bouts of sentimentality. Her ice creams are, simply put, sublime. I seriously doubt a man could do it better.", "pics": null}}, {"review": {"des": "Right when you walk in it smells like heaven. It's the waffle cones they make there.  I got the darkest chocolate ice cream and it was delicious! $5 for 1 scoop, which is a little pricey but it won't stop me from coming back to try more of these super cool flavors! Got a taste of frose and it literally tastes like a glass of frose  I tried cream puff, too. Which also literally tasted exactlyyyy like a cream puff. So amazing! <br>Also, all of the employees were so kind, helpful and very patient!", "pics": null}}, {"review": {"des": "I stopped going anywhere else for ice cream when I found this place. They have the weirdest combinations in flavors but somehow they just work! My personal favorites are lavender and goat cheese/cherry. Who knew goat cheese ice cream can taste THAT good? This place is open super late and there is always a line, even when it's snowing and your thermometer screams \"get some cocoa and blanket!\". Unlike some of their other locations in Chicago, here you can actually see the ice cream you are choosing from, I know some location up north only lets you read the menu.", "pics": null}}, {"review": {"des": "I'm a HUGE Jeni's \"fan\" beginning in Los Feliz in LA. The quality and culture is consistent across the country here in Chicago as well.<br><br>Sun-Popped Corn + Goat Cheese with Red Cherries. Sigh.<br><br>I don't understand how it's always so good. I'm certain there's some kind of wuduhoodoomojomagicritual involved in the process of making these splendid ice creams.<br><br>Jeni you are the Queen  of Ice Cream.", "pics": null}}, {"review": {"des": "A little on the disappointing end... I prefer Jeni's in Atlanta by far. The ice cream lacks that convivially creamy delectableness that I am used to. It is less flavorful, not all that sweet at all, and although still tasty, the flavors do not stand out from one another, failing to scream in my mouth for a true dessert foodgasm. Hopefully, I went on a bad day because I truly love this chain.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/PDB7TVNaSQu_7A6pAJVUKA/348s.jpg", "caption": "Salty caramel, chocolate, and salted peanut butter with chocolate flecks"}]}}, {"review": {"des": "The ice cream was good, especially on a hot day. They let you try any flavor you want and don't judge when you want to try multiple flavors.  They also use reusable metal spoons for the taste tests, which is refreshing given the waste it could produce.  The ice cream was good, with some strange flavors (yuppie flavors, that is).  There were dairy free, gluten free, vegan options.  I tried a vegan ice cream, didn't realize it, and it was good. I ended up with a classic chocolate ice cream, and the kids size was plenty for me!  If I was near by, I would recommend.  It was crazy over priced, like some hip ice cream places.  It was not cheap, but not 10 dollars for an ice cream cone either!", "pics": null}}, {"review": {"des": "Great ice cream! The honey pistachio and gewy cake are my favorites. You can get a flight trio, just like beer. Any 6 scoops on a plate with a waffle piece for $6, I think.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/QgH0ZjnPp2YI2ugxt7Bpkw/348s.jpg", "caption": "Closest dish: cookies n creme, honey pistachio, and peanut butter with chocolate chips."}]}}, {"review": {"des": "I scream, you scream, we all scream for ice cream! With Chicago being 65 degrees and sunny, it brought a ton of people to Jeni's ice cream where the line stayed outside the door the whole time I was there. Immediately, you can smell the waffle aroma just filling the air. Once inside the store, there's a wall on the left displaying their various items on sale (shirts, chocolate, ice cream toppings) and then the fun begins.<br><br>First of all, they have a process to keep the line going and they are pretty darn efficient about it. Just like how there's a line of customers, there's a line of workers each taking a group of customers. They're super friendly and allowed me to taste all the flavors I wanted to.<br><br>What I admired the most about Jeni's was their versatile and unique flavors along with the option of half scoop. I know that whenever I get ice cream, I always want two flavors but since I can never finish two full sized, I usually settle for one sad flavor. Here, I was able to get 3 half scoops for only $6. While they had crazy flavors like brown butter almond brittle and sweet cream biscuits and peach jam, I decided on wildberry lavender, roasted strawberry and brambleberry sorbet. <br><br>Overall: This experience was such a delight and I'm so glad I decided to wait. If you're ever debating, just eat dessert, you'll regret it less if you eat Jeni's.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/trBv1Hm20rz4FBdKocuIqw/348s.jpg", "caption": "Menu"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/2C8BphrRK0ZSBSW-4ovpvQ/168s.jpg", "caption": "Owners philosophy"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/J6AoCB9J5h9UqRtVFGthLA/168s.jpg", "caption": "Flight: wild berry lavender, brambleberry sorbet, toasted strawberry"}]}}, {"review": {"des": "Completely overrated and so OVERPRICED.  Do not understand why people stand in line for extremely average ice cream.  Paying $6 for a basic ice cream cone that you can get anywhere is something I will never understand.  Different strokes for different folks, I guess.", "pics": null}}, {"review": {"des": "Came by for some after dinner sweets and the line was almost out the door. Luckily the service is fast and I got through it all pretty quickly. Jeni's offers some more unique rotating flavors but also some more standard ones. There isn't much seating at this location but there are a lot of cute shops around that so you can walk and eat ice cream at the same time.<br><br>I got the following flavors:<br>-Peach Lassi: Slightly tart which is perfect for me. <br>-Yazoo Sue (Cherry Porter with rosemary bar nuts): I loved this combination but my scoop was mostly nuts which was not as fun to eat. <br>-Cream Puff: My favorite flavor out of the three. It tastes exactly like a frozen cream puff but with bits of the puff scattered throughout. It pairs well with almost any flavor or by itself and I'm honestly surprised more places don't have this flavor because it's simple and delicious.<br><br>All the flavors had a rich smooth consistency. No complaints there!<br><br>Overall I really enjoyed my visit here and I would definitely love to try out some of their other flavors.", "pics": null}}, {"review": {"des": "HANDS DOWN my favorite ice cream spot. Who can resist the glorious smell of FRESHLY BAKED WAFFLE CONES wafting as soon as you enter?? Every time I visit the bf in Chicago, I ALWAYS make a stop for my Jeni's fix. <br><br>Recommend/Personal favorites**: <br>-- Intelligentsia Black Cat Espresso**<br>-- Wildberry Lavender**<br>-- Roasted Strawberry Buttermilk**<br>-- Brambleberry Crisp<br>-- Brown Butter Almond Brittle<br>-- Pistachio & Honey**<br><br>Sample as many of their creative flavors as you wish, the servers are super attentive & knowledgeable about all the flavors. If you decide to get your ice cream served in a cup (~$5 for a small, up to 2 flavors), you also get a piece of waffle cone, maybe even 2, with every serving! Don't be intimidated if you spy a line (especially after dinner on a nice day), it moves pretty quickly and just means everyone else has the same idea as you to end the night with a sweet treat. ;)", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/kIwx33zSL3tdpEz8oPzWbQ/348s.jpg", "caption": "Wildberry Lavender & Intelligentsia Black Cat Espresso *MUST TRY, YOU WON'T REGRET*"}]}}, {"review": {"des": "I had Jeni's ice cream while it was 10 degrees outside. It sounds crazy, but it was totally worth it! I loved their pear sherbet. They have tons of flavors you can choose from, and their friendly staffs are more than willing to help you try as many samples as you want so you can get the best scoop of ice cream! Whether it's cold or hot (probably will taste so much better when it's hot outside), swing by to grab a cone! Make sure you get their complementary waffle! It's tasty and they make them fresh in house.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/YrvbOeKblEbxO5lLTLwxyg/348s.jpg", "caption": "Menu - January 2018"}]}}]}