{"name": "jenis-splendid-ice-creams-chicago-2", "reviews": [{"review": {"des": "YUM!<br><br>I always love their unique flavors and their cute patio around the side. It's also great that you're able to sample as many flavors as you'd like (not that that makes it any easier to decide). <br><br>Favorites include the brambleberry crisp and pear riesling. So refreshing and delicious! Also, you can buy pints to take home!", "pics": null}}, {"review": {"des": "Oh Jeni's... If you've never tried Jeni's before, it definitely lives up to the hype. With locations popping up in all the neighborhoods in Chicago it seems, we'll be able to get Jeni's just about anytime and anywhere soon!<br><br>I'll say I seem to find myself craving Jeni's once a month or so. Their ice cream has this really unique creamy consistency throughout and doesn't seem to melt very fast. HOW DO THEY DO THAT?!<br><br>Being a purist, their vanilla is always one to make it into my trio sampler. While I've never had a bad flavor from here and they seem to consistently offer different flavors depending on the season, you're truly in for a unique treat each time you visit. Way to keep things fresh! Other flavors I love are the salted peanut butter with chocolate flecks and just about any chocolate or coffee variation they offer at the time.<br><br>Definitely worth a stop if you're craving ice cream!<br><br>'Til next time, cheers!", "pics": null}}, {"review": {"des": "This is gonna be short.  Ice cream fans... this is a place you have to stop if you are near this area or any one of their other locations.<br><br>Walk in, try your favorites and make sure you try flavors you wouldn't think of trying.  Jeni's has an awesome staff, extensive selection of ice creams and enough seating for your comfort, if you are lucky enough to find a seat inside.  That goes for any day of the week as well.<br><br>if they are busy, you can order outside and go straight to the register for pick-up.  More times than not, you can get in and out when it's crowded - faster than standing in line (even if you know what you want).<br><br>Keep up the great work Jeni's!!", "pics": null}}, {"review": {"des": "5 stars every time! The consistency in excellence is real. I'm making my way around the board slowly and every flavor so far is so amazing.<br><br>Tried: honey comb, rainbow buttermilk frozen yog, brown butter almond brittle, and brambleberry crisp.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/hfgojr4kBGvVzpj8vwD0BA/168s.jpg", "caption": "Brambleberry + rainbow buttermilk FY"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/lQlmOfUrf8H6gjGRASOeCw/168s.jpg", "caption": "Brown butter + brambleberry"}]}}, {"review": {"des": "I checked Yelp to see what the closest ice cream parlour was to me and luckily it took me to Jeni's Splendid Ice Creams! This place is pretty large and offers a ton of different seating options (both indoor and outdoor), merchandise to pick up, and of course, ICE CREAM! It was pretty busy when I walked in and I knew from the minute I saw the menu that it was totally worth the wait. I ended up getting a scoop of mixed chocolate/vanilla (I totally forgot the actual word that was used) and had it served in the cone that is made in house. When I took my first lick of this magical ice cream, I fell in love. It's super  creamy, super flavourful, and super delicious. <br><br>I don't always have a ton of words to say about a place that just serves ice cream, but this place serves some incredible ice cream and it's definitely a must stop if you are in the area.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ISOpULGijWVrtoe1x9Ghpw/348s.jpg", "caption": "YUM"}]}}, {"review": {"des": "Simply put, incredibly delicious ice cream. You won't be disappointed stoping at Jeni's. I love the \"Brown Butter Almond Brittle\". I would down a whole gallon of it if I could and die in a blissful diabetic coma, completely satisfied with life. What more can I say here? If you love ice cream, this is your wet dream.<br><br>Pro Tip: Sample as many flavors as you want to ensure you pick the one you like most! Don't be shy! As this ice cream treat isn't cheap!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/tfiGJsMaKiTYzGDgbD09qw/348s.jpg", "caption": "Folks waiting in line for their own personal scoop of heaven."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ONe4v-3AR1Ym4CN-bXwSfw/168s.jpg", "caption": "Mmmmm delicious!!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/iGRvIcir9HH7nG7zcAf5Kg/168s.jpg", "caption": "Another shot of the menu. Customer service here was also excellent!"}]}}, {"review": {"des": "So many unique ice cream flavors. So little time.  I feel like a sophisticated ice cream connoisseur when I'm eating ice cream from Jeni's. There is always a line here and for good reason. I got half a scoop of the brambleberry crisp and half a scoop of the wild lavender on a waffle cone this time. It was so good and probably enough for two people to share. The inside is small but cute. Definitely coming back for a pumpkin spice cone next time while it's still in season. (I'm that basic b)", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/6IYDYjoyCsrWj-65blm4iQ/348s.jpg", "caption": "Left: Brambleberry Crisp with wild lavender on a waffle cone. Right: I forgot. Sorry!"}]}}, {"review": {"des": "WOW!!<br>Well let me just say this is a must try if your in the Chicago area. Their ice cream is off the chain if I could have stood their and tried every flavor I would have because they all made my tongue do a happy dance!! <br><br>It's a quaint little ice cream shop right under the train it has that old school creamery feel when you walk in and all the staff had a smile on their face. They have a ton of spectacular flavors not your traditional boring ones lol. <br><br>The flavors I tried were:<br>-Salted Peanut Butter with Chocolate Flecks; an elevated peanut butter cup so creamy and rich!<br><br>-Coffee with Cream & Sugar; one of my favs bc I love coffee it truly tastes like you are having an amazing coffee that was frozen so creamy!<br><br>-Gooey Butter Cake; wow it's like having cake and ice cream at a Birthday party delicious<br><br>-Frose; similar to a sorbet so refreshing on a hot day and truly has a great Rosé flavor!<br><br>You can get it in a cup served with a waffle piece or in a waffle cone. I would recommend any of these flavors and can't wait to return to try some more.", "pics": null}}, {"review": {"des": "This review is going be short, sweet and simple. It's just down right freaking amazing ice cream. Which was well worth the wait in a long line that is sometimes out the door. I ordered the 3 scoop plate that consisted of darkest chocolate, coffee with cream and sugar, and the frose which was seasonal at the time I went. It also comes with a piece of waffle cone which was a delicious touch. I'd have dessert here every day if I could!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/I3xw3XEckeqXVU1kBwR5OA/348s.jpg", "caption": "Darkest chocolate, coffee with cream & sugar, and frose (seasonal)"}]}}, {"review": {"des": "Wow just wow. If you like sweets or ice cream you must come here. Lots of fresh and unique flavors to choose from and you can sample as many as you want. This months special is sweet potato with toasted marshmallows and it does taste like Thanksgiving. I also love the gooy butter cale full of cake pieces and the bangkok peanut that has an extra kick. The place is a bit more expensive at 5 USD for a large scoop or two large half scoops. Very friendly staff who are knowledgable in helping you pick out the best flavors!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/IIimwTBX1uThztPLNsXczA/348s.jpg", "caption": "Sweet potato and butter cake"}]}}, {"review": {"des": "LOVE THIS PLACE. Amazing homemade ice cream with a creamy texture and unique flavors. The consistency is perfect and the flavors are on point. Can't say enough good things about this place. Also, you have to try the waffle cones or at least a waffle piece...they're to die for! P.S. darkest chocolate is my favorite flavor!", "pics": null}}, {"review": {"des": "I really love the variety of creations every time I come in!  There are so many unique flavors. It is so awesome how the staff always are very accommodating about letting me try some of the different flavors that I'm trying to decide on (I pretty much always have to get two so I can try a couple of varieties). Ocassionally I choose combos that may not be the best together, but they are always really good.  There are often lines, but they usually go very fast.  This is a treat I always enjoy!", "pics": null}}, {"review": {"des": "This is the place if you want to go for a late night ice cream run. Love that this pace doesn't close until 11pm. The lemon blueberry is one of my favs, very tart and a nice mix of flavors. The banana cream brûlée taste exactly like the dessert it's amazing. Butter cake is pretty good and it has bits of cake which is really nice. <br><br>If you haven't been you should definitely go, be warned you'll be hooked like me.", "pics": null}}, {"review": {"des": "I honestly think Jeni's is overrated. It's good but not amazing...and definitely not worth a crazy wait out the door.<br><br>Years ago, I tried their macaron ice cream sandwiches which are better than their regular ice creams!  I'm not sure if they still have them.<br><br>Also, I know of friends who have ordered Jeni's as a gift with dry ice.", "pics": null}}, {"review": {"des": "i've heard about jeni's for a while and i'm glad i came! the flavors here are super delicious, and it is super creamy but isn't heavy or leaves a milk film aftertaste. i HIGHLY recommend getting your ice creams with a waffle cone! the cup comes with a piece of waffle in it, but i wanted more, so definitely getting the cone next time!<br><br>got the watermelon and lemon sorbet, and it was a refreshing combo for a hot summer's day! i was super sad they didn't have the lavender (ran out as soon as we stepped in line :( darn it), but i will definitely go for it next time.<br><br>ample parking on the streets, and the line is pretty long but goes by really fast!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/mDYCJuZsNg6gaCyWgESxTg/168s.jpg", "caption": "bramble crisp"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/DBJLlK4P0QT0rj2Hmtcl5w/168s.jpg", "caption": "watermelon and lemon half scoops"}]}}, {"review": {"des": "The best. I've probably sampled every flavor that they've offered in the last year and all are unique and amazing. They range from (slightly) savory to tart. Love the variety and new flavors that rotate through.", "pics": null}}, {"review": {"des": "Great flavors! Pricey but worth it!!<br>We got cookies and cream and brown butter almond brittle. They were both delicious.<br><br>We went there on a Friday night at 9:30pm and it was packed! Around 30 people!<br><br>Everybody was friendly and we had a great experience!", "pics": null}}, {"review": {"des": "I finally, finally made it to Jeni's!! I'd never had ice cream with such strong flavors before <br>I tested out a lot of flavors coz everything I looked at was so unique! The guy was very patient with me and my friend as we tried out several samples. We finally decided on half scoops each of: Milkiest chocolate, brown butter almond brittle, Intelligentsia black cat espresso and spiked eggnog. <br>I can't pick a favorite, everything was too good!", "pics": null}}, {"review": {"des": "I loved Jeni's ice cream!! I couldn't believe I had never had it before. The flavors are incredibly unique, the service is fast, and the ice cream is delicious. I am not big into ice cream, but after having Jeni's, I was craving ice cream everyday after. I got the wildberry lavender (LOVED IT), the Peanut butter with chocolate chips (LOVED IT) and the blueberry lemon (LOVED IT). I can't wait to try the other flavors! I just wish I lived closer to Jeni's.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/TNvQeeyEbEmF67LjQ_0_jQ/168s.jpg", "caption": "So good"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/zApsoELJPJlN_bIjjXcgbg/168s.jpg", "caption": "Loved their ice cream!"}]}}, {"review": {"des": "Jeni's has some great ice cream flavors, you'll probably find something for everyone from their milkiest chocolate, to cream puff, to brambleberry crisp, to pickled mango. You've got the different options of how to order, too - sugar cone, cake cone, fresh waffle cones, skip the cone and get a bowl - single scoop, two half scoops, or 3 mini scoops. They really have all your bases covered.<br><br>Jeni's is PRICEY. You get up to almost $8 for a scoop in a waffle cone, which is a little ridiculous. Their waffle cones are delicious, though - soft and fresh but still hold up. Jeni's ice cream itself is dense with strong flavors. Many flavors have pieces in them which gives a great texture.<br><br>This place also gets pretty packed and the layout isn't great to flow through.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/e0snEYy_BhE8j4C4yyEW6w/348s.jpg", "caption": "Supermoon and cream puff half scoops in a waffle cone."}]}}, {"review": {"des": "Holy cow, what amazing flavours!<br><br>I discovered this branch whilst on the Southport Stroll. A lovely idea where you shop and explore local stores and devour holiday treats in each one :)<br>Many of the stores had special offers. At Jenni's this meant we got three scoops for the price of one!!!<br><br>This branch was confidently located right next to Belmont station and is filled with very friendly staff. Even the one employee who didn't smile very much didn't ruin the general happy holiday vibe of this place. The holiday flavours are as delicious and impressive as you would expect. My husband had buttered popcorn and eggnog. I had black raspberry buttermilk, pistachio and honey and almond brittle. There were much more exciting flavours on offer but we went for the classics.<br><br>The store was very clean and tables were cleared immediately. They also had very clean bathrooms despite the high turnover of families with small children. <br><br>Looking forward to going back and bringing visiting friends and family along so we can circulate twenty or so flavours between us. <br><br>Don't miss a chance to drop by!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/wP0Scta-PPNiwtTLTDgP5Q/348s.jpg", "caption": "Eating so much ice cream!!!"}]}}, {"review": {"des": "They make their cones fresh. There is ALWAYS a line out the door. They have such creative flavors! The buttermilk flavors have more of a tart taste to them which isn't something I prefer but were really light and yummy.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/gtGUA6L8zu-KssSheY0Frg/168s.jpg", "caption": "Sweet Cream"}]}}, {"review": {"des": "Meh. I didn't find anything special about this place's ice cream other than the waffle cones, they were pretty good. The ice cream was pretty pricey too. When I buy ice cream with my family, I do not expect the bill to be almost $20 for six small scoops. Yes the quality was good, but to me it didn't match the price.", "pics": null}}, {"review": {"des": "This is my favorite ice cream shop in all of Chicago.  The price is fair and the ice cream is even better. I love the salted Carmel and the butter cake ice cream.  The walffe cone is so buttery.", "pics": null}}, {"review": {"des": "Where to begin!! If I had the hacker skills I would change these 5 stars to 10 and give Jeni's all! <br><br>They do have classics but now if you're anything like me and always attracted to the weird, fun, out of the box flavors...this is paradise! <br><br>I was introduced to this place on a chilly March evening and have been going there ever since. <br><br>My first experience was with the Tart berry, Dark chocolate and lavender scoops in a single cone. Apart from it dripping and making me look like a fool, It was every letter of the word splendid!!!! <br><br>Rich, deep flavors....the dark chocolate is crisp on the palate but oh soooo good! The lavender and orange blossom flavors!! ahhh kill me....<br><br>Every flavor is a stand out- creative as f....! (sorry but it is). Something as simplistic as Vanilla is oh so delightful. <br><br>Sometimes I get the pints of salted caramel, dark chocolate or vanilla at home... sparks some beautiful memories!! Other days I like to go and eat in store and consume as many tastings as I can. <br><br>Highly recommend!!! - smiling just thinking about it. :)", "pics": null}}, {"review": {"des": "This is good ice cream. Is it worth waiting in line for 30+ minutes and shelling out $5 a scoop? No. I'm from Wisconsin, so my standards for dairy are high. As I said, this is good ice cream, but it's certainly a hyped up place that for me, simply isn't worth going out of your way to enjoy. <br><br>If you go, I recommend bringing a pal, splitting the ice cream flight, and add one scoop (the flight comes with 3, but you can pay to add a 4th). You'll get the same amount of ice cream as two individual scoops, but you'll get to try 4x as many flavors, and it's cheaper!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/-rKuXtfKaln43Y5NdhpLUA/348s.jpg", "caption": "Ice cream flight with 4 scoops"}]}}, {"review": {"des": "If I could only give ten stars! YUMMY ice cream and super service! <br><br>Thankfully, I don't live in Southport. I would eat ice cream at Jeni's every day for dinner if I did.", "pics": null}}, {"review": {"des": "I go to Jeni's on Southport a LOT and I've NEVER received bad service. Everyone working is so knowledgable on all of the flavors, give great recommendations, and are so kind when you want to sample a bazillion flavors. I love how innovative the flavors are and there's always new ones to try so you're bound to find something that tickles your tastebuds! The trios (3 half-scoop flights) are totally worth the $6. I always opt for wildberry lavender (best flavor ever!!!) and two other flavors. Everything from the waffle cone aroma to the friendly staff, IG-worthy aesthetic, and unique flavors is all very inviting. My boyfriend lives in Evanston and we always drive the half-hour with no regrets to get a taste of Jeni's :)", "pics": null}}, {"review": {"des": "I recently visited Chicago and went for Jeni's ice cream almost everyday, despite the many other choices. But when you got it right to perfection, why go elsewhere. The unique flavor creations adding pie crust to Cayenne pepper to lavender or salted peanut butter! <br><br>Now--for the good news, I live in Florida and God help me, but Jeni's is coming to Publix! And they will carry Brambleberry Crisp or salted peanut butter with chocolate flecks! Now I'm in trouble!", "pics": null}}, {"review": {"des": "The ice cream was worth waiting in the long line. <br>We tried burnt butter almond brittle, lavender, salted caramel and dark chocolate - all four were worth dying for! It was a perfect palette balancer for my family where everyone has different taste and they enjoyed eating their fav flavor.", "pics": null}}, {"review": {"des": "IF there's any downside it's that this location is way too small and needs to expand because of the perpetual lines out the door.  Jeni's could also do with better signage about flavors that are available in the cases and what is lactose free and what isn't...but honestly, these are super minor issues because at the end of the day the ice cream here is truly some of the best I've ever had and the options are plentiful for everyone's tastes. I love coming here,especially on a hot summer's day, though I'm sure my belly hates it....", "pics": null}}, {"review": {"des": "#1 ice cream place in the city. The ice cream is absolute perfection and the flavors are always unique and delicious. My only complaint is that their limited edition flavors cycle randomly so you never know what you'll get (but it also makes it exciting!). My favorite flavor today was the sweet cream biscuits & peach jam. Other favorites include the darkest chocolate, brambleberry crisp and reisling poached pear. <br><br>The staff is always super friendly and let you try as many flavors as you want! The ambiance is super modern and cute. 4 half scoops is $7 which is a little pricey, but 100% worth it in my opinion.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/kNrNztdy7ogzIae_d-zkvQ/168s.jpg", "caption": "The menu"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/RRTeW2tcKSajs1c5vbulww/168s.jpg", "caption": "Yummm"}]}}, {"review": {"des": "Jeni's has some of the most unique and interesting ice cream flavors. <br><br>The brambleberry crisp tastes like a blueberry crumble pie. So many flavors have chunks of \"stuff\" in them which surprised me for some flavors like the golden cake . Cream puff, golden cake have chopped up pieces of pastry mixed into the ice cream giving a pretty distinct texture, a little too jolting for me. Salted caramel is good. The lemon blueberry fro yo is extremely lemon-y. The brown butter toffee has huge chunks of toffee.<br><br>Good flavors, not the most creamy ice cream, but robust and tasty. Can get 2 flavors in a small serving priced just over $5. Fun to try if you love weird and creative flavor combos.", "pics": null}}, {"review": {"des": "My only qualm with Jeni's Ice Cream is that there is such a vast array of unique flavors that choosing just one or two was a nearly insurmountable feat. After five samples and much deliberation, I chose the brambleberry crispy and the gooey butter cake. My friend went for the goat cheese with red cherries and the ricotta toast with red berry geranium jam. All four flavors were exceptional. Our ice cream was served with a crisp shard of waffle cone, which added a satisfying crunch. If I had to offer a suggestion to Jeni's, I would recommend that they offer a flight of one tiny scoop of every single flavor. If this is not a feasible endeavor, I suppose I will have to return 17 more times to sample each delightful flavor.", "pics": null}}, {"review": {"des": "We had just finished dinner and we're craving something sweet so we decided to go to Jeni's Ice Cream. I've heard a lot about it and thought I'd give it a try. <br><br>They had a wide verity and I honestly forgot what we all got. But I can remember one that we got was vegan friendly and tasted exactly like Motts apple sauce. It was so good and yummy. I had gotten salted caramel, Mint chocolate and one that had jam in it that was my favorite one. Best part about all this was I got my ice cream for free because it was my birthday!<br><br>If you're craving something sweet. Give this place a try you won't be disappointed.", "pics": null}}, {"review": {"des": "I had Jeni's for the first time on a trip to Ohio and now I am on a mission to try every location in Chicago. This location is super close to the CTA stops so that's always a plus. I honestly get the same flavor every time I come (the vegan coconut dark chocolate) and it's so worth it. They really know how to make some darn good vegan ice cream here. I do wish they would branch out into more vegan options but at the very least it is always nice to be able to have ONE option. That is the only reason for 4 stars rather than 5 They also let you have unlimited samples on METAL spoons (hellooo environmentally focused and friendly) Everything in the store is nicely and neatly labeled while also maintaining the \"cute\" aesthetic that this neighborhood is known for. On a typical day, you can grab some ice cream, take a nice stroll and do a little shopping all in one area. Also lots of dogs in the area. They also have pints that you can buy on the go and if you buy enough they'll give you a \"keep cool\" bag to go along with it. <br>4/5 would return again to this location or any other Jeni's.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/sqIMVoTXBDOj5DQTaV-12w/168s.jpg", "caption": "Quaint neighborhood"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/TzjzSpNjxReXSfK6yOxqRw/168s.jpg", "caption": "Vegan dark chocolate"}]}}, {"review": {"des": "Now this is a line worth waiting in! There's usually a line but it moves pretty fast. All the employees are really friendly for starters. There are so many great and unique flavors. Don't come here for your standard vanilla ! <br><br>Come are made fresh.", "pics": null}}, {"review": {"des": "Jeni's never disappoints. Warm summer night + chicago = jeni's ice cream. Of course this location always has a line out the door, but it moves fast. They've got about four or five new summer flavors and you can sample however many ice creams you want! They also make their own waffle cones in house, which are amazing. <br><br>This time around, I got 2 mini scoops in a cup. I got their summer flavor, yazoo sue with rosemary bar nuts and cookies in cream. Both were great. I love how Jeni put a spin on her own flavors. Like Jeni's cookies in cream was unique with flecks of whites chocolate, very different from other places where it's typically always the same. <br><br>Definitely will continue to come! Check it out, you will not be disappointed.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/kRl4SY4h9trxj_79h4-9nQ/348s.jpg", "caption": "2 mini scoops: Yazoo Sue with Rosemary Bar Nuts (left) and cookies in cream (right) with Waffle Wedge in a cup"}]}}, {"review": {"des": "Extremely good but also extremely pricey. Good for an occasional treat but it's about 3 times the price of other \"gourmet\" ice cream brands. Staff and location are great but taking one star off because of the price.", "pics": null}}, {"review": {"des": "I think the high ratings threw me off as I had high expectations. This was extremely pricey and I honestly didn't enjoy it much. I tried a few flavors, but unfortunately they were a miss for me.", "pics": null}}, {"review": {"des": "I love Jeni's ice cream! Salty caramel is one of the best ice cream flavor I've had! I think what really set them apart from the rest is the texture of the ice cream. It's the perfect consistency and you can tell the ice cream here doesn't sit around for long. It taste fresh every time. On a hot Chicago summer, the line gets pretty long and they will run out of some of the more popular flavors.", "pics": null}}, {"review": {"des": "Conveniently located right next to the subway, I came here with a friend on Memorial Day and it was great! There was a line but it moved quickly, and there were a lot of flavors. The people working there were quite friendly; they were really patient as they let me try a lot of the flavors and told me to take my time deciding what I wanted. So many choices to make! It was quite a difficult decision but in the end I got the brown butter almond brittle and the salted peanut butter with chocolate specks. The quality of the ice cream is definitely quite good as it's smooth and not icy. The ice cream melted really quickly though! It's also a bit expensive at $5.51 including tax for two half scoops (same price for one full scoop) and a waffle cracker on top.", "pics": null}}, {"review": {"des": "This was my first experience of the highly known Jeni's Splendid Ice Cream. I was overwhelmed by how many flavors there were plus having dairy free options. I had to try many many flavors (the girl who helped me behind the counter was just as excited as I was that this was my first time so allowed me to try 6+ flavors!). I committed to the Gooey Butter Cake, it was just like eating cake, and yes I had it in their homemade waffle cone. Looking forward to going back to try another delicious flavor!", "pics": null}}, {"review": {"des": "Probably one of my favorite Chicago ice cream places. Started out eating Jeni's by buying tubs of it at a local place that sold it, but finally visited the actual store by Paulina. We had an hour to spare before dinner reservations (yes, dessert before dinner! :) ) so we came in here to eat some ice cream and chat. My favorite ice cream flavor has still have to be the Black Cat Espresso flavor, but that's because I like the flavor of the espresso itself already. I also like the winter Peppermint Chocolate flavor, cookies and cream flavor (not oreos, but some delicious dark chocolate tasting cookie!), brown butter almond brittle and many others. <br><br>The staff is always nice and willing to let you guys sample their wide array of flavors. My first time trying the poached pear riesling flavor which I ended up really liking. Nice and fresh tasting with just a tinge of the wine and really good with their waffle cone! Great atmosphere and great little trinkets to look at too.", "pics": null}}, {"review": {"des": "My friend brought me here on the whim, during one of our brunch dates, and everything is so good. They give you samples on a silver spoon, and the array of flavors is pretty impressive.", "pics": null}}, {"review": {"des": "Jeni is a freaking GENIUS.<br><br>Talk about some of the best ice cream I've ever had. Jeni has assembled the perfect ice-cream shop for us. Don't let the line scary you away, if anything, it should validate how good this place really is. <br><br>Sweet Cream, Lemon Blueberry and Salted Caramel are among some favorites. If you're in Chicago you can't leave without finding one of the many locations around town. I'm pretty sure they freshly make their cones everyday, which if you know ice cream, is an extremely important  aspect. <br><br>an added bonus:: the metal sampling spoons<br><br>update (12/17): There will be a new Jeni's coming to Wrigleyville soon", "pics": null}}, {"review": {"des": "I seriously cannot go a week without having ice cream...twice at least...and of course Jeni's is a staple chicago experience that I never got to try until this weekend! Not gonna lie, trying to pick from the abundance of extravagant flavors was very stressful. So obviously I had to pick more than one. I got the three scoops (half scoops so like they're small right?), and after trying many weird flavors this was my consensus:<br><br>-I tried the genmaicha marshmallow. Ehh not my flavor<br>-I tried the moonshine. Ehh too boozy for my taste<br>-I tried the wild lavender: Ehh too flowery<br>-I decided on the following combo: Brown Butter Almond Brittle, Brambleberry Crisp, Salted Peanut Butter with Chocolate Fleeks. Add the waffle cone crisp to the cup for a nice touch.<br><br>My conclusion was that every bite was lovely, flavorful, rich, delicious, and I wanted more. But my stomach wouldn't have been able to have more. So I was content. I even left with some stickers to accessorize my outfit for the night. Yay! Will be back soon.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/dW9IeJ7FviPEmt1sTb1_5w/168s.jpg", "caption": "Salted peanut butter with chocolate double scoop"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/uWaeVQDAqombZ8n3t1pbHQ/168s.jpg", "caption": "Brown butter almond brittle, brambleberry crisp, salted peanut butter w chocolate"}]}}, {"review": {"des": "To me, Jeni's is just one notch below Salt and Straw, but you really can't ask for better. For your money, it pays to get a waffle cone - the portion size is a bigger than a regular cup, and you're going to want more of this ice cream to savor. Who'd have thought such a great thing could come out of Columbus?!", "pics": null}}, {"review": {"des": "The staff here is what makes it excellent. They're patient and even if the line is out the door, you're not waiting FOREVER! Jeni's allows you to try as much as you want to ensure you're going to enjoy your purchase. It's hard to go wrong here - they rotate the flavors pretty frequently, so there's always something new to try. And make SURE you get your waffle slice! It's the highlight!", "pics": null}}, {"review": {"des": "Walking up to the brown line, I see the train I need juuussttt start pulling away. So what to do with an extra 15 minutes? Pop into Jeni's of course! <br>I noticed the space looks a little smaller than the wicker park location, with only a few tables in the front and one long one in the back. Even though the weather had not warmed up yet, and it was 8:30 at night, the shop was still a little busy and there was a bit of a line. Luckily I already knew what I wanted - brambleberry crisp and wildberry lavender in a small cup with a slice of waffle cone. Yum! Costs about $5. And you pretty much can't go wrong with any flavor. If you don't have time to wait, you can also grab a pint or an ice cream sandwich to go!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/QiIGpouo3TRRKJOBFvcGGQ/168s.jpg", "caption": "If an ice cream shop sits right under a train line, it's pretty much required to stop and grab some for the ride"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/fcQpzI9XClMvHCXOyo5izw/168s.jpg", "caption": "Cute string lights decorating the inside of Jeni's"}]}}, {"review": {"des": "I'll be the first to admit that I assumed this place was just a bunch of hype. I had no idea about Jeni's until I passed the location in Wicker Park during the summer and saw droves of people lined outside. Who waits in line for ice cream, I thought? Anyone who loves and respects themselves apparently. <br><br>So, flash forward a few months and I finally venture into Jeni's on a Saturday afternoon and it's a miracle I didn't give them all my money on the spot. I tasted just about everything but eventually settled on espresso because it tastes just like coffee smells in the very best way imaginable. I did, indeed, cringe at paying $5 for one scoop but seriously debated going back for another before I even finished my cup so that speaks for itself. <br><br>I'll be back soon to buy a pint of the Sweet Potato with Torched Marshmellow because it tasted like a holiday pie party in my mouth and I deserve all the nice things the world has to offer.", "pics": null}}, {"review": {"des": "So glad we decided to stop by for ice cream during our trip even on a rainy night in Chicago! The shop is so cute and spacious for an ice cream spot. When we first came in, there was no line and so we were able to take our time and try many of the flavors. I ended up choosing the wildberry lavender (wonderful flavor without being overwhelming) and the brown butter almond brittle which was rich and absolutely delicious. They were nice enough to give me both the cone and the cup, and the free sprinkles are in such cute colors! We sat at a table in the front to enjoy our ice cream, which unfortunately melted quickly as the shop is very very warm inside. Good thing we came when we did, because the line was out the door when we left!", "pics": null}}, {"review": {"des": "Jeni's originated in Columbus - the boy is from there. When he spotted a Jeni's in Chicago, I was introduced and that's how the story goes! <br><br>I have been to a couple locations in Chicago and one in Columbus. This one is close to my apartment, so from thus forth it shall be my go to Jeni's. It's next to the Southport Brown line. <br><br>One of my more fav flavors is the Peach Riesling Sorbet. I used to love the Brambleberry Crisp but on one occasion I basically ate the whole pint while sitting on a couch staring off into space. Me and that flavor aren't friends any more. <br><br>The Intelligentsia Black Cat has a mean coffee flavor. Real mean! Check it out if you dig the bean. Coffee bean.", "pics": null}}, {"review": {"des": "Long line to get ice cream.  Who can complain though on a beautiful night.  The wait was worth it for sure.<br><br>The ice cream itself was sweet, flavorful and tasty.  I did feel as if the waffle cone was lacking a little flavor.<br><br>Great place to swing in and grab some ice cream and walk around.", "pics": null}}, {"review": {"des": "Jeni's is hands down my favorite spot for ice cream. Between the quality of the ingredients to all the unique flavors and combinations, it never let's you down. Sometimes the line can be out the door and down the sidewalk but trust me it moves fast and it's so worth it. <br><br>Some of my favorite flavors include:<br>Atlantic Beach Pie-tart lemon pudding and saltine gravel-whatever that is<br>Brambleberry Crisp-oat streusel and tart blackberries and blackcurrents<br>Juniper & Lemon Curd<br>Wildberry Lavender <br>Ultramarine Blue Buttermilk - tart yogurt with wild blueberries", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/36bPk8txif8kSVZwdySgEQ/348s.jpg", "caption": "Southport Storefront"}]}}, {"review": {"des": "I hate to say it, but I'm not a sweets guy...But every so often, I have a craving for ice cream and I've heard Jeni's is one of the best in Chicago. I ended up getting a scoop of milk chocolate and a scoop of peanut butter with carmel topping. <br><br>I thought the ice cream was delicious and it was very rich. This was my first time having gourmet ice cream in Chicago so I don't have anything to compare. But it definitely beats Baskin Robbins, Dairy Queen, and Ben & Jerry's.  <br><br>The only downside about Jeni's is the scoops are small for the price, but the ice cream is very rich. I will definitely come back to try some of their exotic flavors!", "pics": null}}, {"review": {"des": "This is a really cool place if you like to try different ice cream places. They had s ton of unique flavors and combinations. This place is a little expensive but I would come here over cold stone/oberweis any day of the week. The blueberry lemon was to die for!!!!", "pics": null}}, {"review": {"des": "I love ice cream... like most people in the world and I think Jeni's offers a modern and creative swirl to the industry. The ice cream was delicious and they had a lot of unique flavors. I went with a scoop of lavender and a scoop of espresso. <br><br>They also didn't mind you tasting and asking for samples of the flavors.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/yHYK3MWkCV2OGZMgYhZhSA/348s.jpg", "caption": "Ice cream!!!!"}]}}, {"review": {"des": "First, I love ice cream. Second, I love GOOD ice cream. Third, I LOVE AMAZING ICE CREAM.<br><br>Jeni's definitely an amazing ice cream place where I can fully enjoy every bite or lick of my ice cream. This is not heavy as Ben&Jerry nor as thick as gelato, so I love coming to Jeni's. <br>Also, this is the only place I can find unique flavors like LAVENDER! <br>You might say, ewww flower flavor? doesn't that taste like soap? <br>Nope, it does not. It tastes so soft, mild, and delicious; the color is so pretty too. <br><br>This place got more seating areas than Wicker Park location, so you can take a small group here. <br><br>Menu Recommendation:<br>1. Lemon  & Blueberries <br>2. Wildberry Lavender<br>3. Pistachio & Honey", "pics": null}}, {"review": {"des": "I have been to Jeni's in Columbus but sadly hadn't been since I moved to Chicago.  Decided to go to their ice cream for breakfast event (best event ever right?).  I got a sundae with pretty much everything you could ever want on it!  Under all the toppings was their gooey butter ice cream...yummo.  Everything was super fresh tasting.  They have the best hot fudge sauce, it's a bittersweet chocolate not overly sweet.  The space is nice and clean.  The service was good too!  I think my only thing was with ice cream this good, I need a bigger sundae ;-)", "pics": null}}, {"review": {"des": "The ice cream here is indeed good and I like the variety (definitely some more exotic flavors on the menu) but I'm not totally convinced if it is worth-waiting-30/45-minutes-in-line good. $6 for the 3 half-scoop sample platter with a waffle corner is a decent deal though. I was a fan of the salted peanut butter chocolate and wildberry (nice texture) but the dark chocolate was average. The staff here are very friendly and nice and let you try however number of flavors you want but at times the line just moves soooo slow.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/r4uNi22UG4Fnc6AUvK2VIQ/348s.jpg", "caption": "Salted peanut butter chocolate = amazing. Dark chocolate was ok"}]}}, {"review": {"des": "Gotta love Jeni's. It's the best ice cream we have in the Chi when it comes to unique and inventive flavors with style. Is it pricey? Yes. Is it worth it? Always.", "pics": null}}, {"review": {"des": "Why do I lose all control when I see this place?  I could be on the best diet ever and the minute I get near Jeni's, I'm lost in the mesmerizing scent of freshly made waffle cones.  The smell brings me to the sign, and I'm already through the door trying to decide which flavor to pick that day. <br><br>My usual favorites... Intelligentsia Black Cat Espresso, Brambleberry Crisp, Salted Caramel, Goat Cheese with Cherries, and Vanilla (its a weird name that I can't remember but its Vanilla Flavored).  This recent visit, I went crazy and broke away from the usual flavors mentioned above.  I tried their SEASONAL flavor!  Whoa!  Not only was it a seasonal flavor... but it wasn't an ice cream.  I tried their buttermilk frozen yogurt.  Flavor: Lemons and Blueberry BFY<br><br>To be honest... I picked the flavor because I didn't know what BFY was.  I was not disappointed!!!  This is going up into the list of favorites.  <br><br>The store will always let you try flavors, and as many flavors if you're torn.  The flavors here is next level!  Ice cream for us foodies with complex flavor profiles.", "pics": null}}, {"review": {"des": "Ice cream was very good. Can't remember the name of what I had one half scoop of vanilla and other half with something with donut pieces in it. The ice cream here is very expensive. I didn't like the seating here either. It was so small and not many seats. I will go here again but not to eat in.", "pics": null}}, {"review": {"des": "My family tried Jeni's for the first time tonight.  Between 2 flights, we got 6 half scoops:   Salted Peanut Butter with Chocolate Flakes, Salty Caramel, Milky Chocolate, Brown Butter Almond Brittle (?), Mocha something, and a Berry one.  <br><br>The first 4 were our favorites.  The Mocha had shards of coffee bean, giving it an odd mouth feel. Same for some skin in the berry ice cream.  The other four flavors made us very happy.  The waffle wedge was a nice touch.  So were the metal tasting spoons and biodegradable plates.  <br><br>We are looking forward to coming back, before or after a trip to the Amazon store across the street.", "pics": null}}, {"review": {"des": "Hands down all time favorite ice cream place! The flavors are so unique and the ice cream tastes so fresh! You can get as many free samples as you want and the staff is very very friendly. The ice cream is a reasonable price around $6 for three half scoops of ice cream and a waffle piece which is the trio. I would recommend getting the trio because it's the best deal. Since Jeni's has ice cream shops all over the city I recommend going to one!", "pics": null}}, {"review": {"des": "It's the other \"Jeni's\" location in Chicago.  Our first visit at the Jeni's in Wicker Park was very positive, so we determined to head over here even though it wasn't an ideal \"ice cream consumption\" temperature today (approximately 25 degrees Fahrenheit).  <br><br>The most memorable flavor we had this afternoon was the wildberry lavender.  One of the characteristics of Jeni's unique concoctions and creations is that the flavor is super on-point; I can precisely tell what it is with the a slight tongue-lick.  With that being said, you should like this flavor if you're a fan of lavender aroma.  <br><br>I believe I've mentioned in my other Jeni's review.  They provide stainless steel spoons for sampling.  Sometimes I felt wasteful asking for samples because there would be another plastic utensil thrown into the garbage.  \"Jeni's\" is the only place I don't have this type of guilt when it comes to sampling.  <br><br>This location is literally feet away from the CTA Southport Brown Line station.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/lUXEKqDrQs5r0r9mpkKzDg/168s.jpg", "caption": "Wildberry lavender is a must try"}]}}, {"review": {"des": "Overall: Great ice cream option, but a little pricey and pretentious vs. other local options<br><br>The good: Very humble and friendly. The flavors are fantastic, the very dark chocolate was rich and wonderful, and the salted caramel was tasty. The waffle cones are crispy and not overly-sweet. There are a ton of flavors to choose from, far more than other shops. Service was friendly and the environment of the restaurant is cheery and inviting.<br><br>The not-so-good: Smaller portions than other nearby ice cream joints. Some of those load it up, while Jeni's is conservative. The fruitier and more simple flavors are top notch, but the more decadent items can't match the likes of Bobtail or Oberweis. Overpriced compared to competitors<br><br>Atmosphere: 8/10<br>Service: 8/10<br>Food: 8/10", "pics": null}}, {"review": {"des": "I tried really hard not to like Jeni's but even a stubborn brat like me has to admit that it's great. I got annoyed with the hype and everyone constantly saying Jeni's this and Jeni's that when it wasn't even a local mom and pop shop. Now I understand why people just can't shut up about it. It's amazing! <br><br>The crew takes the time to tell you about their flavors and guide you through the samples. You don't ever feel rushed and they are happy to help you. And then there's the ice cream. Man oh man are those flavors good! The staple Brambelberry is delicious and the seasonal Cookies n' Cream I had was impeccable. I now regret my stupidity and wish I would have come much much sooner.", "pics": null}}, {"review": {"des": "One of the best ice cream spots in Chicago! Recently discovered it and I feel like I should be a gold member by now - shut up and take my money. The goodies are so unique and the quality of the ice cream itself sets a new standard. <br><br>As I write this review, it's 50 degrees outside - which is basically summer for us natives, and they still get business. During hot summer days you must be prepared to wait in line but I promise the wait is worth it.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/_SH9xob4CWqhf-lKHW6z7w/168s.jpg", "caption": "Dark chocolate peppermint"}]}}, {"review": {"des": "I honestly didnt think ice cream could be this good until i tried jenis. To be honest if you told me i wouldn't have believed you. Well, let's just say... Ice cream is now my favorite dessert. Some of the out-there ice creams arent for everyone, but the classic flavors like chocolate, peanut butter, caramel, coffee, etc. Are amazing. All I ask is that you keep an open mind and try the goat cheese and red cherries. You might be pleasantly surprised...", "pics": null}}, {"review": {"des": "Delicious! We went on a Thursday night, and it was super busy. We waited in line for about 15 minutes, but it was worth it! I got milk chocolate and salted peanut butter and it was an awesome combo. <br><br>I'll definitely be back!", "pics": null}}, {"review": {"des": "Jeni's is a pretty cool place (no pun intended).  They have a selection of classics (vanilla, chocolate, strawberry) but all with a twist.  Their chocolate is actually a seriously kicked up dark chocolate overload type of concoction that I could eat a gallon of.  It's the kind of chocolate that you have to be ready for.  Not just prepared to taste, but I mean in the right frame of mind, the right place in your life.  Because this shit is gonna change everything for you!  So good!  And all of their flavors are like that.  Okay, maybe not life changing.  But they all have something else going on that adds a unique and very welcome twist to the standards.<br><br>But it's not just changes to classics, they have a bunch of unique flavors as well.  Big scoops, or a duo or trio of small scoops to let you try more flavors without killing your diet.  Bowl or in-house made waffle cones.  Even toppings are available, though I'm not sure why you would want to adulterate the pure flavors of the ice cream with toppings...<br><br>Jeni's is not necessarily the best ice cream I've ever had, but it is right up there!<br><br>Get in there and give it a try.  You will not regret it.", "pics": null}}, {"review": {"des": "I decided to get ice cream with my friend after dinner and we decided to go here. The moment we stepped into the store, it immediately smelled wonderful and sweet. One great thing about this ice cream shop is the variety of flavors. We ended up getting a flight of ice cream (3 flavors for $6) and had the Matterhorn, intelligentsia espresso, and sweet potato with toasted marshmallow. My friend and I both decided that our favorite was the espresso flavor, so definitely try that if it's still available. I wished that the sweet potato one was a bit less sweet and had more sweet potato flavor. Overall, it's a great spot for grabbing ice cream with friends and there are so many different flavors that everyone is bound to get one they like!", "pics": null}}, {"review": {"des": "I love love this place for dessert...it's a must for everyone to try. They have limited flavor of ice cream. You can try or before purchasing the ice cream. I would definitely recommend this place for family and friend to come.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/aALVG5GXpa8OmPsIj1Aevw/348s.jpg", "caption": "Darkest chocolate and brambleberry crisp"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/8F4ts1Bmj29he7wUTRB8jg/168s.jpg", "caption": "Blackcurrant and orange blossom"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/CxW4xnQkspf3_K7ioOLhrw/168s.jpg", "caption": "Juniper&lemon curb, bankgkok peanut, holiday note, Roxbury road"}]}}, {"review": {"des": "i try scoop of jenis ice cream was pretty good<br>i was looking for churro flavor but was not available", "pics": null}}, {"review": {"des": "Absolutely splendid indeed! The line was long but it goes by fairly quickly if you're with friends and can just pass the time hanging out and chatting. You are free to sample any flavors you haven't tried and can then put your order in. We got the darkest chocolate, which was my fav out of the four. And then the almond brittle is fantastic, I'll probably get that again as well. The vanilla was interesting but not interesting enough for me to get it again. And then last but not least, we tried the salty caramel. I love anything salted caramel so this was the perfect amount of sweet and salty.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/bykW7GL2MRrkPAcr2iekmQ/168s.jpg", "caption": "The \"study\" 4 scoops: almond brittle, darkest chocolate, lavender vanilla, salty caramel"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/BxFvmzPATiGrtO8XF152UQ/168s.jpg", "caption": "Busy workers"}]}}, {"review": {"des": "This place is usually so busy in the summer that the line is out the door. I came on a Friday night at around 9 PM and the wait was about 10 minutes. I split the trio with another person and it was just the right amount of ice cream without feeling guilty. There isn't much space to sit, so be prepared.<br><br>The wildberry lavender was my least favorite ice cream flavor. It resembles the taste of rose water.<br><br>The next thing I tried was the brambleberry crisp. This tasted like vanilla and raspberry ice cream with crunch. I highly recommend this one, definitely my favorite!<br><br>The dark chocolate was also rich and delicious. It was the perfect balance between sweet and bitter.<br><br>The only downside that Jeni's is \"bougie ice cream\", i.e. it is really expensive for small portions.", "pics": null}}, {"review": {"des": "I hate having to give such a low star count, but it was due to an experience I had at the shop last night while purchasing a few pints of the delicious, delicious ice cream Jeni's offers its patrons. <br><br>It was 7:30pm, the height of ice cream treat time, and as usual the shop was packed! I was happy to see all the folks in their supporting the company. I knew that I was just there for a few pints (as I usually go into this location for), and so I scooted straight to the back of the space to look into the cooler for the options available. The wonderful staff member working the register was kind and courteous offering to answer any questions I had while she rang up a very happy couple munching on their cones. <br><br>I made my decision, opened the cooler door, and snatched out two pints: salted honey pie and ricotta toast with red berry jam. Two of my favorites. The young woman at the counter commented on the good choices I made. I was not done yet! I kept peaking at the cooler. My partner was in the car, and I know she would want one more option. The cooler was fogged on the inside, and I couldn't read many of the labels (some hand written, many with differing fonts). I opened the cooler again to check out one turned around pint to see what it was when another staff member SLAMMED the door I was holding open. This left me in shock. He then told me in an extremely condescending tone that it was not a \"SELF SERVICE\" cooler. He then immediately returned to the line where he had been scooping cream for the ever growing line of patrons waiting on him. <br><br>The woman at the register immediately apologized as she could tell I was shaken and made others around the counter stare at me. I was embarrassed as he made me out to be some terrible rule breaker. There was no posted sign. The employee at the register never told me to tell her what I wanted as she saw me standing in front of the cooler. He continued staring me down until I finished my $36 purchase. I had no idea what I had done to deserve his extreme ire. UNTIL...my partner pointed out that it was likely my appearance. I am a person of color. I had come in from the gym wearing jogger pants, a straight brimmed baseball cap, and a hoodie sweatshirt. This employee, also a POC, was giving me a look as I have seen given to me by staff retail establishments all of my life. The look not given to the white cis gender patrons doing the same shopping. I pray that is not the reasoning he had. I pray he just was having a rough day, and I just was the straw that broke the camels back in this moment. It does not make it any better, but either way as a result I will now be avoiding this location of Jenis.", "pics": null}}, {"review": {"des": "Tried 3 different ice cream places during my Chicago trip and this was by far my favorite. <br><br>The quality of the ice cream is amazing. Extremely fresh, creamy and flavorful. I fell in love with lavender flavor ice cream after trying it at San Francisco's famous Bi-Rite. <br>Jeni's is now my #1 for lavender ice cream. I sampled a few flavors and opted for the lavender and honey pistachio combo. <br><br>Go here! You won't be disappointed.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/xgsWO7s_GrIiA9_HCkhCag/348s.jpg", "caption": "Lavender w/ honey pistachio. Great combo!"}]}}, {"review": {"des": "First time I ever encountered this ice cream chain was in Chicago ... and boy am I glad I did. Located near a metro stop, this ice cream shop serves up a littany of all different kinds of ice cream flavors to boot. Some of the flavors are available year-round & others are seasonal. Decor/ambiance inside this place is mad cute - decent amount of seating available & the lights here make this a most pleasant & pretty place to enjoy your ice cream. I came here to get a couple scoops & a waffle cone and was amazed at how good the ice cream tasted. Many flavors available here, be sure to try before buying, and don't hestitate to get a waffle cone to complement. This place also serves up Intelligentsia coffee, which is quite on point (great coffee). Prices are most reasonable in regards to quality of ice cream & amount received. Overall, a most worthy ice cream scoop shop to visit in order to satisfy your ice cream craving. Highly recommend to all.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/YMAPQEvHM3ytwHGmcIbGpA/348s.jpg", "caption": "Cute interior. So on point"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/V15EYoQki1SP8kFp8YlVwQ/168s.jpg", "caption": "Samplings available. Some flavors available all times, others seasonal"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/aYEg2T8OvqGmZph5FFSQ6w/168s.jpg", "caption": "Scoops on scoops. Waffle cones made in house, too!"}]}}, {"review": {"des": "Errrrbody loves Jeni's! My friends and I joke that anytime someone mentions Jeni's, we then have to go that day. Ice cream on the mind doesn't just fade away- especially this premium stuff! It's smooth and creamy, the flavors are unique and robust, and the best part is: you can try any of them! You might not find typical flavors like oreo/mint chip on the regular here- there will be crazy specials like cream puff, rosé, ricotta & jam, dark chocolate, Bangkok peanut, coconut cacao and my personal favorite: lemon buttermilk. It might have to be one of the best ice creams I've ever had. The lemon flavor is SO tart, but the rich creaminess cuts it perfectly. One bite turns to many and I end up sitting there, wishing I had the entire container in front of me. While seating is pretty minimal at this location, there's usually at least space to stand while you enjoy your treats! Plus, in the summer you can grab some cones and stroll around Southport. Pro tip: get flights to save $$$!!! Anyway, the bottom line is that Jeni's Splendid Ice Creams ARE splendid, and I'll be back over and over again.", "pics": null}}, {"review": {"des": "I've been waiting to try Jeni's ever since a friend of mine told me about it four years ago. Finally tried it today and it did not disappoint!! <br><br>Someone compared it to Bi-rite in SF ... Maybe because of the unique flavors and the long lines but the similarities stop there for me. I think the biggest difference is texture. <br><br>Have you ever tried freshly churned icecream before? It's hard to articulate but it tastes lighter and fresher than the standard rich and creamy consistency at many icecream places. I also really loved the extra crunchy waffle cone and appreciated how it stayed crunchy till the very end. Definitely worth the long drive to get there. Went in around 2 pm on a Sunday and no line!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/DsIjdsMX7IFwI709rglehQ/348s.jpg", "caption": "Jeni's is now in my top 3!"}]}}, {"review": {"des": "Perfect Ice Creamery to cure your sweet tooth before you head to the ballpark and root on the Chicago Cubs (Jeni's is about a mile from Wrigley Field). The minute you step into the door, it hits you.  The delicious aroma of fresh waffle cones being prepared.  Instantly, I knew what I wanted.  I had to have that darn cone!  But first things first, Operation: Ice Cream Flavor.<br><br>This wasn't an easy decision.  They have roughly 20 flavors to choose from.  After trying a couple of unmemorable flavors, I was stuck.  \"What about the Brown Butter Almond Brittle?\" a cheerful, meek voice asked from behind the counter.  I took a break from skimming through ice cream flavors and looked up to see the most pleasant smile.  \"It's super popular.  I'm sure you'll like it,\" the ice cream expert added.  Without further ado, I tested this so called Brown Butter Almond Brittle.  <br><br>ANYONE WHO VISITS JENI'S MUST ORDER THE BROWN BUTTER ALMOND BRITTLE!!! Even if you don't like nuts, butter, brittle, the color brown... WHATEVER, JUST ORDER IT!!!!!!!!!!!!!!!!!!!!!!!  Creamy, rich, decadent, mouthwatering, buttery, deliciousness all in one bite.  You know I had to get a couple of scoops on the waffle cone.  The Brown Butter Almond wasn't even the star....<br><br>OH EM GEEEEEEEEEEEEEEEEEE!  That waffle cone though?????!!!!!!!! Simply the best I've ever had.  HANDS DOWN! Crunchy, crispy, fresh, sweet, savory, etc.  Not only am I still lost for words, but I'm out of adjectives too.<br><br>All this to say, I'm glad I don't live in Chicago.  I'd be pushing 650LBS going to Jen's every day.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/B9XCTJbtqJ5kYAn5jgYwMw/348s.jpg", "caption": "I'm always game for a clean bathroom."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Cyr0wj2-e-BJn3CDUqwx8g/168s.jpg", "caption": "Perfect for a Netflix and chill."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/yDyqNNZZw8D1bCl0C7_wPg/168s.jpg", "caption": "Cute sitting area."}]}}, {"review": {"des": "Best ice cream in the city. Staff was friendly, informative, & passionate about ice cream (Ice cream tattoo? Hell yes).  Today I got a scoop of wildberry lavender & a scoop of ultramarine blue in a waffle cone and it was the perfect spring treat.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/IiFgJnSNsLBx7TR4AaVt6A/168s.jpg", "caption": "Top to bottom: Salted Caramel, Milkiest Chocolate, Brown Butter Almond Brittle."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/_BBrpfaNlVsJOhs9TCUuHg/168s.jpg", "caption": "Ultramarine Blue & Wildberry Lavender"}]}}, {"review": {"des": "This is some serious ice cream. Clearly based on my amount of check-ins, I'm a big, big fan. <br><br>Whether I'm coming here after enjoying empanadas at Tuco and Blondies or enjoying a mid-afternoon snack, Jenis is the place to go. <br><br>Today my combination was salted peanut butter with chocolate flakes + Queen City cayenne. An A+ combination if I do say so myself. It was like a spicy Reese's cup. I got it in a cup so I could enjoy bites of the flavors together as they melted to become one amazing ice cream soup. Not to mention the free waffle chip which is the perfect size for dipping!<br><br>I scream, you scream, we all scream for (Jeni's) ice cream!", "pics": null}}, {"review": {"des": "Honestly didn't know what the hype was with this ice cream parlor until I stepped in myself on a slower afternoon. Come around 4pm for no wait rather than spending 30 minutes in line on a summer evening. <br><br>I was struck by a whirlwind of excitement after taking a look at the menu. They make artisan unique flavors! Reminds me of \"Salt & Straw\" in Portland. According to the staff, the top three most popular flavors are ooey gooey cake, salted peanut butter with chocolate flecks and brown butter almond brittle. <br><br>Since seasonal flavors are temporary, I went with the goat cheese and red cherries. It was quite a smooth creamy body nicely paired with a piece of crunchy waffle. I'm an official convert. Gonna come back to try more flavors.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/d02q2A0RgL6JvgfpkGCybQ/348s.jpg", "caption": "Le menu circa 9/2016."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/IE_xq3PgqQD8qhN4aaEF4g/168s.jpg", "caption": "Goat cheese with red cherry + salted peanut butter with chocolate flecks."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Et9SL8qkm6K2ZRye9ZXhMw/168s.jpg", "caption": "Goat cheese with red cherry + salted peanut butter with chocolate flecks."}]}}, {"review": {"des": "I came here with my nephew because he wanted ice cream after picking him up from school and I didn't want to buy it at a generic location. <br><br>They have a lot of different, interesting options. I gave the vanilla and pear Riesling (I love Riesling) a go, as it was busy and I didn't want to hold up the line too much. The vanilla was good, the pear Riesling was not my cup of tea. <br><br> I'm BIG on customer service(in my head haha), but I am never difficult with employees as I know that sometimes they're simply not having a good day or other people may be difficult. I always try to smile and say hello, never raise my voice or give them an attitude - I try to be understanding. With that said, I don't quite understand why they seemed so much more energetic with the other customers and were somewhat lacking with me. If they were having a bad day in general, it happens, and I tend believe in 2nd chances. However, I don't get where the distinction was coming from with me...was not feeling the vibes....so I'll avoid them and take my business elsewhere.", "pics": null}}, {"review": {"des": "Plenty of special ice cream flavor I never even heard of before! Definitely worth a try if you have a sugar tooth :)<br><br>Line was long! Took like 20 minutes before I got my ice cream but it's because many customers were tasting the samples. <br><br>Paid street parking only.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/xZEi6J_vG7upJFJumTHLXw/348s.jpg", "caption": "Obviously it was too hard to resist waiting for a photo"}]}}, {"review": {"des": "The best ice cream in the galaxy!<br><br>So bummed that they don't have a chain in California.  I hope in the future they consider mailing me a pint of \"Salty Peanut Butter.\"", "pics": null}}, {"review": {"des": "I had the Wildberry Lavender ice cream. I love lavender. A lot. And this ice cream was incredibly fruity with a touch of lavender in the finish. But the sweet orange was overpowering, a bit imbalanced really. <br><br>I would definitely go there again, but unless they change he recipe, I wouldn't get that flavor again. The berry was great, but I wanted more lavender, as it is in the name. The orange was a bit too like sherbet.", "pics": null}}, {"review": {"des": "BEST. ICE. CREAM. <br><br>Came here randomly as my friends and I were looking for a dessert location in the area. We were on vacation and took a taxi here and it was definitely worth the drive. The line was a bit long but it went by fairly quickly. The interior is very cute and they sell ice cream in pints to take home. <br><br>They have a great list of flavors and it was absolutely delicious! They have a card program where you can earn stamps to get a free trio.<br><br>If you're ever in town, make sure you pay a visit!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/N_YTgE7rA2QPC-us9wuXbQ/168s.jpg", "caption": "Summer menu!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/4lXMT102tqhG2E7DWJjklg/168s.jpg", "caption": "Trio!"}]}}, {"review": {"des": "Too many flavors to pick from! They all tasted good too! <br>Salty caramel was good<br>Loveless Biscuits + Peach Jam - tasted very fresh and peachy but didn't notice the biscuit aspect much<br><br>I really wanted to check this place out because I love Black Dog Gelato.<br><br>One thing I found out about Jeni's is that it's all made fresh in their kitchen.... all the way in Columbus, Ohio :( <br>The ice cream is good but it's shipped in and not made on the premises.<br>This makes me view this more as a big corporate chain and not a local business.<br><br>Really good ice cream but I don't know if it's amazingly delicious ice cream.", "pics": null}}, {"review": {"des": "Jeni's is superb. I love the rotating flavors which are always delicious and unique. Additionally, my girlfriend can't have large amounts of dairy and therefore tends to avoid ice cream. However, she can have Jeni's without any real issue.<br><br>Some of my favorite flavors have included Savannah Buttermint, Gooey Butter Cake, Churro, Watermelon, and a handful of others. <br>Darkest chocolate is my favorite of the regular flavors. <br>All the ice creams are incredibly creamy but yet somehow still feel rather light.<br><br>The one downside is that Jeni's is a bit pricy, three scoops (which aren't huge) runs you $6.<br>High end ice cream with a high end price and totally worth the occasional treat.", "pics": null}}, {"review": {"des": "Was in the area and never tried Jeni's before. Went in and good thing we beat the long line, because it seriously wrapped along the window outside. <br><br>They have flavors that change and the dark chocolate flavor she raved about wasn't there. In the end I ended up with the Brown Butter Almond Brittle and Salty Caramel with waffle cone in a cup. Tried the Poached Pear thinking that it would be a refreshing flavor but nope, not for me. I will definitely come back for more!<br><br>Tip: if you are sharing with someone and don't want the cone and they do. Ask for the ice cream in a cup and add the waffle cone on top. Then you can take the cone off and scoop the ice cream into the cone while you eat out of the cup. Win win situation!", "pics": null}}, {"review": {"des": "Always new flavors and if your like me and have no clue what half of them should taste like you appreciate them letting you taste test. I also recommend the 3flutes for $6 as best value.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/i1ou3dddz70MXr9y2gyCrA/348s.jpg", "caption": "Pumpkin role on left and oohey gooey buttercake, pistachio hunny and some chocolate with jalapeno smoked paprika concoction on right."}]}}, {"review": {"des": "This is my first time visiting this particular Jeni's location but Jeni's is Jeni's regardless of where it is. I am a huge fan of the huge selection of delicious flavors that are available. Right now, the limited edition flavor that I am obsessed with is Juniper & Lemon Curd--it has an intense lemon flavor and a hint of herbal flavors which make it refreshing with every bite. Normally, I am not a huge fan of waffle cones but the freshly made ones at Jeni's are worth getting for sure. They are perfectly crispy and not overwhelmingly sweet. I will continue returning to Jeni's every so often to try their new flavors!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Cxllrp8i-O5hqePK5cKIDw/348s.jpg", "caption": "Juniper & Lemon Curd (bottom) and Brambleberry Crisp (top)"}]}}, {"review": {"des": "In a nutshell: <br>Very good ice cream.<br>Pricey for portion size.<br>Customer service failed.<br><br>Details: <br>Very, very good tasting dark chocolate ice cream, salted peanut butter ice cream, and goat cheese ice cream. <br><br>Also, seems like a good selection and well thought of flavors.<br><br>Would of been a higher rating but although the ice cream was very tasty the negatives outweighed the positives.<br><br>Requested the Intelligentsia ice cream but they didn't have it and no customer service apologies were made. At least say, \"Sorry, we are unfortunately out\".<br><br>Also, the server should apply some proper social skills, he is definitely not an \"ice cream shop\" quality type server... He seemed very impatient and too serious (unfriendly). Irregardless of him doing his job he isn't a good server for the business.<br><br>The experience was not welcoming, was rushing, and they didn't care to show customers interest regarding  the flavors. The employee was definitely overwhelmed, in his character, by the long lines...<br><br>When one wasn't sure where to steer, after they didnt have a flavor, the employee didn't ask, \"What do you like?\" or \"Maybe you might like this\". Which should then lead to steering one into the right direction of flavors. He made no attempt to assist customers who were not familiar with all the flavors offered.<br><br>He also seemed not to easily understand or even try to easily understand what people were pointing at. Almost seemed snotty about even having to understand where one is pointing towards. A truly proper server would say things like, \"Which one, the first or second one? Or things like this one is this flavor and the one next to it is another flavor..\"<br><br>It's common courtesy.<br><br>Next time the server may literally be told by customers to at least attempt to try before acting confused and to never act snotty.<br><br>Ice Cream shops should be happy places!<br><br>Others also recognized this about the server.<br><br>Maybe a board of the flavors being served should be placed on a blank wall so people waiting or first time customers could have an idea of what to order and also the servers should steer customers into what they may like or want to try... Not everyone could try or see flavors when the line in front of them is so cramped so therefore the server should assist in a helpful way.<br><br>Also, the scoop of half and half, which should = one scoop in total, was the smallest scoop ever encountered, so far. This place really could be 5 stars (due to their excellent ice cream) but it needs some fine tuning and crowds shouldn't effect scoop size or service. <br><br>Again, price for portion is at an extreme fail - at least speak up on this Yelper's!<br><br>It seems like the pictures and reviews of 2015, 2016, seem to be more fair than what was given and encountered.<br><br>To be clear it is some of the best tasting ice cream around... Will return for another try... Hope they don't take the heavy crowds as an excuse not to apply some fixes in those areas.<br><br>It would be worth the fix.<br><br>Hope to upgrade the rating and not lower it.<br><br>The next return will be with a group of people and I really hope the changes are made.", "pics": null}}, {"review": {"des": "Just walking in to this place and smelling the freshly baked cones is already enough. Amazing ice cream and you have to get a waffle cone. I usually order the Brambleberry Crisp and/or the Brown Butter Almond Brittle, though they do have seasonal flavors that are constantly changing. Always ask for samples, they're extremely friendly and the service is always great. Definitely a go-to ice cream place.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/XIDkgDydM9oAXC_4Zdwmrw/168s.jpg", "caption": "Brambleberry Crisp and Brown Butter Almond Brittle"}]}}, {"review": {"des": "I have been wanting to try this place out for months now. We finally went last night. PHENOMENAL! <br><br>We got there at around 9pm and there was a bit of a line, but it went fast. And an employee was outside giving people menus so you can choose ahead of time. When we were leaving around 9:45p the line had almost doubled! <br><br>When you get inside you can instantly smell the sweet and delicious ice cream! Luckily, they let you sample before you commit to anything. The decor and lighting is warm and inviting. Very clean too! <br><br>You can choose two flavor a for $5 or 3 favors for $6. I had the bramberry crisp and the brown butter almond brittle on a waffle cone. There are so many delicious flavors. I can't wait to go back!! <br><br>It's super close to the brown line Southport stop. But there is metered parking nearby too.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/YVQDNdZPrldj-PtBKz6YQQ/168s.jpg", "caption": "2 flavors, brown butter almond brittle and brambleberry crisp on top!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/r1BDopgp8j_ZyOL0rKmZHw/168s.jpg", "caption": "Beautifully scooped! From top to bottom: wild berry lavender, brambleberry crisp, and birch and marshmallow!"}]}}]}