{"name": "jimmys-pizza-caf%C3%A9-chicago-2", "reviews": [{"review": {"des": "Stopped in on a recent Friday night for a 16\" half pepperoni, half sausage, for take-out. Wow was this a treat. Handmade sausage was my clear favorite of the two topping choices, but the clear winner was the awesome New York style crust that catches a bit of char from the bottom of the oven. Outstanding New York pizza in a city dominated by, well, Chicago-style pizza. <br><br>The funny thing is I never even knew this place existed. I've driven by it without noticing it dozens of times, but was told about Jimmy's by a friend who asked me if I'd had it and then encouraged me to try it. Glad I did.<br><br>Friendly customer service, order was ready by the time I was quoted, and taste exceeded expectations.", "pics": null}}, {"review": {"des": "I ordered delivery, which was then transferred to Grub Hub.  The delivery time that was promised was pretty close.  It took about 1 hour and 15 minutes from order to delivery.<br><br>I got the whole pie with pepperoni and sausage.  The crust was NY style and very good.  Perfect combination of chew and crunch, just the right amount of cheese.  The meats were outstanding and really made the pizza special.  The pepperoni was old-world style that cupped when it was baked and had crispy edges.  The sausage was extremely flavorful.  Neither meat was too greasy.  Not sure what kind they used, but it really tasted great.", "pics": null}}, {"review": {"des": "I couldn't wait to try this place after reading all the raving reviews. We ordered the signature white pie  and garlic knots. Don't get me wrong; the pie was good but it wasn't anything mind-blowing. It's had a mozzarella/garlic taste to it and it's topped off with ricotta cheese. Definitely not something you would find at a typical pizza parlor so it's a refreshing experience. But, to me and my pizza obsessed husband, it tasted like we were eating garlic bread topped off with cheese. Don't get me wrong, it was very tasty but nothing out of the ordinary! The garlic knots tasted like your average garlic knots, just as you would expect. The price is a little steep; $3 for 3 small and ordinary garlic knots just isn't worth it. <br>The service was friendly, we picked up our pizza on a Friday night when it was packed. It took them about 25 minutes to make it after ordering, we went to the Tony's grocery store across the street to kill time. The lady that took our order was the same one that gave it to us after it was ready, she forgot about the garlic knots and was confused when I told her that we order garlic knots as well, she went back and checked our receipt to confirm that we did have that on our order so we had to wait a few minutes extra for the knots. No biggie, the place was busy and no one is perfect. <br>Overall, I did enjoy the signature white pie but it wasn't amazing. It's worth a try! Skip the garlic knots, they're average and not worth the price.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/8HzzaePR7mjd1nfLOURjsg/348s.jpg", "caption": "Signature white pie and garlic knots"}]}}, {"review": {"des": "I've said it before, I'm a NY pizza snob.  There's a few places in Chicago that come close but jimmy's comes the closest. On the corner of Lincoln and Foster parking can be tricky but there is parking. <br>The secret to NY style pizza is the crust.  It's got to have character and body and that's why it can hold up to the triangle cut. <br>As always, to get the pizza 'done right' make sure to get a slice that's sitting out waiting for you and have them heat it up, real hot. It's always better heated a second time.", "pics": null}}, {"review": {"des": "A small, local corner shop that specializes in NY pizza- a rarity in Chicago! <br><br>Heard some pretty good things about this place and was looking forward to giving it a try. We stopped by around lunchtime on a Saturday. It wasn't jam-packed busy, but all the tables were filled, including a larger party that made it a little difficult to get seating. <br><br>We ordered the white pizza, truffle mushroom and sausage. Only 1 of them came out of the oven very warm crispy- the other two was a little cold and chewy. <br><br>We waited around a couple minutes to hopefully grab a table for two but didn't get lucky enough so we just ate in the car. <br><br>Overall- not bad! I'm hoping to try this place another time when it isn't so busy.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Ubt_y7C3x4HEydlNGfOfVg/348s.jpg", "caption": "Quattro funghi (truffle mushroom)"}]}}, {"review": {"des": "Easily my favorite slice joint I've been to. Everything here is amazing. My favorites have to be the margarita and white pies", "pics": null}}, {"review": {"des": "This was a good slice of pizza. The staff were nice and friendly for my first time visiting. I received a hot slice of mushroom cheese pizza a few minutes after ordering. I enjoyed the toppings a little more that the crust. There was not a real strong presence of tomato sauce. I only wish there were more of a selection of meat to choose from for individual slices as I don't eat pork. Parking is available in the rear if you drive.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/6qx_iEJfsH9TYoFee4Q6iw/348s.jpg", "caption": "Quattro mushroom and cheese"}]}}, {"review": {"des": "Their pizzas are huge! Seriously, we got their biggest size and had to tip it to fit in the door. <br><br>NYC Style pizza in Chicago - it's very solid thin crust pizza. We went with Pepperoni and it was seriously loaded with round meat discs. Very tasty to boot.<br><br>We got delivery to Revolution Brewery on Kedzie and they had no issues delivering to us there.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/dix8t35UAyxaRn_p5D2Eqw/168s.jpg", "caption": "They deliver to Mouse Trap/Off Color"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/wPs3XhVWRXmHeDqAmL16Hg/168s.jpg", "caption": "Pepperoni"}]}}, {"review": {"des": "This is the absolute best for NY slices in the midwest. I lived in Lincoln Square for 8 years, my friends and I would order from Jimmy's weekly, and I'd pop in in between for a slice fix.<br>Now I'm in Milwaukee, and there's only one place that comes close, and they give Jimmy's a run for it's money, but I still prefer Jimmy's. <br><br>Jimmy's just gets it. The sauce, the cheese, the dough. New York. Honestly, I'm only reviewing the cheese pizza here because that's how New Yorkers get pizza. Just dough, sauce, and cheese, a big floppy slice, fold, eat pizza. Perfection.<br><br>I'm not critiquing their other pizzas because a true NY slice has only sauce and cheese.<br><br>Don't skip the garlic knots or beignets!", "pics": null}}, {"review": {"des": "I honestly never write any reviews because im too lazy but I just wanted to say that the pizza I had at this place was THE BEST pizza I ever had in my entire life. The dough was very chewy and the crust was perfect!! The one I had was a meat lovers pizza and a greek pizza. I can really say that its really different from other pizzas. Its a next level. I now understand why it's so highly rated. Once you eat it, youll know. <br>And also, the beignets were amazing too. It was so fresh out of the oven. I had it with a hand dripped coffee. And it was just amazing!! Plus, the lady was really nice and always welcoming", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/8z6s9sS16f_vFodVbutaUA/348s.jpg", "caption": "Fresh out of the oven beignets!"}]}}, {"review": {"des": "LOVE the thin crust! The mushroom pizza is my favorite.<br>Space is very limited, so if you come around 12pm, you might be standing around with your hot pizza for a few minutes until a table open up.", "pics": null}}, {"review": {"des": "Don't get slices unless they have just come out of the oven. At that point, the slices have fantastic balance of chewiness and crunch. The reheat for slices that have been sitting there makes the dough super crunchy and lacking in flop a good NY slice should have.  There are times I'll go in and pizza is already browned or burnt before they even reheat it. It's not horrible pizza when it's good but for the price and lack of consistency, I'd rather go somewhere else for lunch. <br><br>Pies to order have been generally far more consistent when I have ordered them.  However, I'm only in the area for work during the day so I seldom order a whole pie, so I can't comment with confidence on that aspect.", "pics": null}}, {"review": {"des": "Can you say yum? Had this place bookmarked for a long time and so glad I got to try it out! Drove it past it too many times and had friends tell us how amazing their pizza is. I totally doubted it and didn't believe them. But oh boy, was I wrong. I've read about the cheese pizza with the white cheese center. O m g! I don't get to eat white sauce pizza frequently but love it so I was a happy camper! Only has one slice with white sauce and wished I had more. :( <br><br>I did the whole NY pizza eating rule by folding the pizza in half. Had the Brooklyn deal with 2 slices of pizza & a drink for $8.95. I didn't want to get 2 of the same slice but when I return, I would order 2 of the white sauce with ricotta cheese. They have pizzas sitting on counter & reheat it when you order. I didn't get to try garlic knots or beignets so I'd want to try them as well. <br><br>Sign states free parking in rear but it was too packed so I opted for street parking. The servers were very friendly. There were many pick up and delivery orders. I would totally order a whole pan next time. Perhaps it'll taste even better when it's freshly made. Definitely a return!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/7hDekAtYe8qKDcXq5YDJJQ/168s.jpg", "caption": "May 2018"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/riK58_Ld9dmFqRSDAD3ywQ/168s.jpg", "caption": "May 2018 Sorry for the glare due to reflection"}]}}, {"review": {"des": "As a New England transplant, I can say hands down this is the best thin sliced pizza in Chicago. <br><br>The cheese is well balanced not too salty, and gripplingly savory. The crust is thin, crunchy, and well seasoned with just the right puff.<br><br>The variety and assortment of favors go very well together.<br><br>I highly recommend this place if you have the chance!", "pics": null}}, {"review": {"des": "This is probably one of my favorite, newly discovered pizza places in Chicago. My recommendations:<br>Thin crust cheese pizza<br>Garlic knots<br>Beignets <br>Strawberry Nutella fruit crepe shaped pizza", "pics": null}}, {"review": {"des": "As Davey Pageviews says, \"One bite, everybody knows the rules.\"<br><br>Although I love Chicago Style Deep Dish Pizza, every once-in-a-while, I get a craving for a New York slice. Enter Jimmy's Pizza Cafe.<br><br>The pizza here is the best New York slice I have had outside of the Big Apple. Everything is balanced, from the creamy saltiness of the mozzarella to the tangy, tomato-y zip of the sauce, to the chewy, foldable crust that has a nice crunch once you bite into it.<br><br>So why 3 stars and not five? The latest Friday evening I went, I literally had to wait 20 minutes for two slices of pizza. Yes, they were packed. But c'mon -- two slices of pizza, 20 minutes? I would also be a little more forgiving if I got my slices ahead of the people who ordered theirs after I did. That was a little annoying.<br><br>I'll return because the pizza is super delicious, but maybe not on a Friday night again.", "pics": null}}, {"review": {"des": "NY pizza in the midwest! We found this place a few years ago by accident, and had to return while visiting this area. Displaced NYers 40 years ago, and havent been happy since leaving our favorite foods behind. This place has the closest crust we've tasted outside of the east coast. Sauce is a little different, but all in all we really enjoyed our pie!! Definitely worth a try.<br><br>They also have very good garlic knots... and fabulous beignets!<br><br>We'll definitely return when we're in this area again.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/JrYeDOkxbpS2Fbdb4c-uUQ/348s.jpg", "caption": "NY pizza pie!"}]}}, {"review": {"des": "Probably the best New York style pizza in Chicago. The bread is the best part. They could put in a little more cheese and sauce though. The owner seems like a great guy as well and is passionate about what he does. I highly recommend this place", "pics": null}}, {"review": {"des": "Meh. The pizza is honestly okay. Nothing memorable. Got the smaller pie with ham, pepperoni and jalapeño. Vaguely similar to NY pizza but it's very clearly missing something. <br>Not a bad pizza, but they missed the mark.", "pics": null}}, {"review": {"des": "My son was interested in learning the difference between New York and Chicago style pizza. We stopped by Jimmy's based on Yelp reviews and our slices exceeded expectations. The fungi pizza offered four kinds of mushrooms on fresh, crispy crust. The pepperoni was not as meaty, juicy or spicy as the gourmet version at Patellies in Three Oaks,MI but it was certainly excellent, according to my son. We highly suggest that Chicagoans  who want to sample NY style pizza try Jimmy's and we also suggest that homesick New Yorkers can visit there without being disappointed. Enjoy!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/6DPeSR_x1BZ1Q-1ST-6vOQ/168s.jpg", "caption": "Jimmy's takes New York style pizza seriously in Chicago. Zoom in on glass case to see pizza offerings on a weekday at lunchtime."}]}}, {"review": {"des": "I was born and raised in New York City, and yes, LOVE New York Style Pizza (with a nod and MUCH respect to Chicago's deep dish/stuffed spinach pizza in particular for me, whoot whoot! But not here!). This place, IMHO, makes a darn good NYc style pizza: (1) Great crust & sauce, (2) large slices, and (3) very prompt delivery time. *Just one note, figured out over time. They're ARE getting better, but sometimes the condiments are less than one might expect. I now just order extra of each condiment, and it's all good.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/7gk5vL_y_Qwy4_BZKDFYFQ/168s.jpg", "caption": "1/2 pepperoni & garlic, 1/2 mushroom & sausage..."}]}}, {"review": {"des": "This is my go-to for NY-style pies in Chicago. Their large pepperoni reminds me of this spot  in Hell's Kitchen that I would frequent on business travel. My problem with Jimmys is that it's too good and I tend to overeat. The crust is perfect. Great balance between sauce, cheese and real pepperoni that actually tastes and chews like meat bs filler. It's a little pricer than the competition but hey you get what you pay for", "pics": null}}, {"review": {"des": "Best NY style pizza in Chicago that I've had so far. Not thin crust, not deep dish. Honest NY pizza.", "pics": null}}, {"review": {"des": "In the spirit of constructive criticism - I am leaving a 1-star review but I will say that we will give this place another try.  They do get decent traffic coming into the place so obv they must be doing something right besides having an adequate location.<br><br>#1 - Customer Service:  The last 2 times I have picked up takeout, I come inside and the staff does not make eye contact.  Just totally aloof.  I had observed in both times that even when there are multiple ppl behind the register that one often just stands around and doesnt even approach the next customer in the queue.  I will say that both times in the evening they are staffed by young millennials and perhaps this is just our new culture in 2018.  But in the effort to provide any level of customer service, you would hope they would want to do better.  Someone asked me milling around if I was waiting (which I was standing around not sure whether I was going to get my takeout).  I explained if I knew that I was waiting that would be an improvement.<br><br>#2 - Lack of Cheese on the pizza:  We ordered the whole pie.  It comes with some cheese on the pizza.  There are blank spots where its just bread or bubbles.  Kind of a shame but next time we just ordered extra cheese and paid the penalty to compensate for their lack of quality.<br><br>#3 - Bad Beignets:  We decided to try out their delicacy.  This is the whole reason / motivation of why I am even taking the time to write this review.  Any of us who decided to taste this got instant diarrhea.  Disgusting.  Oh yeah its $4.50 for 3 little powdered un-delights.  At least I had heard they tasted good.", "pics": null}}, {"review": {"des": "I don't always crave thin crust, NY style pizza but the other day i had a hankering for it and stumbled across Jimmy's. <br>After reading reviews and looking at some pictures, we decided to check it out for a quick bite.<br>We got a slice of the white pizza and a slice of the pepperoni pizza along with the garlic knots (to be fair we thought we were gonna get the ones wrapped in bacon)<br>After you order they put your slices in the oven to heat them up and to get the crust nice and crispy. I would really recommend eating your slices there so its nice and hot!<br>I would pass on the garlic knots, it would've been a bit more enjoyable if the marinara sauce was warm/hot.<br><br>I would totally recommend Jimmy's if you're looking for a good NY style pizza!! There is street parking along Lincoln, we were able to get a good spot.", "pics": null}}, {"review": {"des": "Hands-Down the best New York Style Pizza Illinois! The crust is crispy and chewy, the sausage is homemade and you can tell the difference!  My wife had the margarita pizza and she was blown away at the taste.  I was able to meet Jimmy and he was nice enough to talk to us about the process and the quality ingredients that they use.  Thanks, Jimmy for a great experience and we will definitely be back!", "pics": null}}, {"review": {"des": "Best New York style pizza in chi! There is not much to this place but that's what makes it great. It seats about 15 ppl I'd say. The white pizza here is my favorite. The garlic knots could be a little bit more buttery and the marinara sauce is cold and there isn't much flavor to it, but other than that this place is solid. The sausage pizza is also great and they say the sausage is made in house- yum!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/vRrDrjdBYEQifinUtkMIig/348s.jpg", "caption": "White pizza and sausage pizza"}]}}, {"review": {"des": "Really great pizza and a couple of neat toppings. I had the artichoke, spinach, pepper. It was VERY good and when I go back I'd probably have that again. I've wanted to come here for years and pass it all the time. Now after trying it it's going to be hard to go passed and not stop in for a slice. Parking doesn't seem to be an issue either. Great place to stop in for a quick but tasty bite.", "pics": null}}, {"review": {"des": "Hubby and I were in the Lincoln Square area recently and decided to check this place out. Considering he doesn't care for Chicago-style deep dish pizza, the slices on display looked promising. They are large, NY style slices.<br><br>They have many varieties and pizza is basically all they do. We chose a meat lovers and an artichoke/sun-dried tomato/feta. They were excellent! Chewy yet crispy crust, right amount of toppings, and just delicious. <br><br>They have a few seats but we prefer to order carry out and go. The lady at the counter is very friendly and helpful. If you order slices, they heat your slices in the oven behind the counter. A whole pizza takes about 20 minutes. They have cheese, sausage and pepperoni daily, and two specialty pizzas daily. Credit/debit purchases must be at least $10. The 1st and 2nd time here, we got 2 slices and a drink for about $12. The most recent time we came, we ordered one of the special pizzas, which was chicken, bacon and their sriracha sauce. It would have been $35 for a large, but thankfully we only needed a medium for 3 people. That was $28 or so. Not cheap! But it was very good. My daughter likes their garlic knots. <br><br>I wish they had better parking. On the street can be tricky, but you can park in the seedy looking parking lot in the back if there's a space. Minus one star for the prices and parking, yet I'm happy that we discovered this place. We really like it!", "pics": null}}, {"review": {"des": "There pizza is really good I ordered the Brooklyn deal which was 2 slices of pizza and a medium drink. The only problem was the \"medium \" drink looks like a kiss size drink other than that the pizza was really good it made me think I was in New york .", "pics": null}}, {"review": {"des": "OMG THIS PIZZA IS EVERYTHING. The crust is chewy and crispy in equal measure. Red sauce is a little sweet but balanced with the cheese. THEY SELL PIZZA BY THE SLICE OMG. So many wasted nights trying inferior pizzas in Chicago. NEVER AGAIN WILL I WASTE MY TIME AND MONEY ON RANALLIS! I wanna cry and shout from the rooftops the glory that is Jimmy's Pizza Cafe! BEST NEW YORK STYLE PIZZA IN THE MIDWEST!!!!!! I will be back soon.", "pics": null}}, {"review": {"des": "I love this place.  I stop in every so often to get a slice of pizza and some beignets.   The slices are huge, I love that when they warm it up, the crust is thin and nice and crispy.  I recently tried the mushroom pizza with truffle oil and an assortment of wild mushrooms.  Delicious!   I have also enjoyed the garlic knots and their other varieties of pizza.   It does a lot of carry out and delivery too.   Another local little gem!", "pics": null}}, {"review": {"des": "Having grown up in NYC we both feel this is the closest we've come to NYC pizza outside of the city. The crust is thin and manageable yet hard with a doughy inside. The regular slice is slightly off but meets necessary criteria. I do wish the cheese was more salty and the sauce sweeter but it's close enough. Most importantly though, in true NYC style, extra oil that drips all over your plate when eaten. The white pizza was made with ricotta, has no sauce and tasted impressively close to home. The pizzeria gets extra points for having oregano and granulated garlic readily available to season the slice.<br><br>They loose points in a couple areas first, the pepperoni is of a consistency we've only found in the Midwest whereupon the meat curls up at the edges and looks like a small hat. I'm not sure what causes this but it reminds me of take and bake pizza found at the grocery store which is disappointing in and of itself. <br><br>They also loose big points for the garlic knots. They were impressively bad and sloppily made with extra dough without the garlic backed in and served with cold! mariana sauce eww. Small disclaimer here... we have yet to find a pizzeria anywhere outside of NY that has good garlic knots and no for you NY readers we will not be revealing out garlic knot spot. If you feel like hunting though it's in the Bronx.", "pics": null}}, {"review": {"des": "Yes! This spot made my day and made me miss home(nyc) lol they make a good pizza and you can get it by the slice. Ordered the Brooklyn which you get 2 slices (ny style) pizza and a medium drink! They also have some dessert pizza and some other unique combinations i will definitely be trying. Also they earned my repeat business by having the simple yet DELICIOUS garlic knots wrapped in BACON!!!!", "pics": null}}, {"review": {"des": "Love it for thin slices. I've tried the sausage and the arugula. The arugula was interesting, but I wasn't a huge fan of the sweet balsamic glaze or whatever was on top.<br><br>Friendly and fast service.", "pics": null}}, {"review": {"des": "Hubby and I had a cheap night-out, and we went back to our old hangout \"hood,\" Lincoln Square for some N.Y. style pizzas.  <br><br>I personally passed by here a number of times, yet I never took the initiative to come in for a slice or two.  As soon as we walked in, we began to figure out what pizzas they had on the displays.  The young lady behind the register was very sweet and immediately gave us a run-through.  We then picked out a slice of pepperoni, creamy garlic, spinach feta, and buffalo chicken.  The total was $18 and some change, with a can of ginger ale hubby added on.  <br><br>The wait was very short.  Within two (2) minutes, our pizzas were re-heated in the oven and handed to us.  I know it was merely a neighborhood pizza joint, but the service was absolutely wonderful!  The young lady informed us about the \"missing piece\" on the spinach feta after it was sent to the oven.  I couldn't even tell if that was so-called \"defective.\"  Nevertheless, she volunteered to re-heat another slice for me and still let me have the \"bad one.\"  She said she would rather give it away instead sentencing the pizza to the \"death row.\"  Haha, my stomach was definitely a better garbage disposal.  <br><br>\"Jimmy's Pizza Cafe\" certainly has gotten lots of love from the residents and working professionals nearby.  While many patrons chose to dine in, they were a plenty of phone-in, take-out, and delivery orders.  There were three (3) or four (4) delivery men coming in and out of the door.  <br><br>The \"buffalo chicken\" left me a great impression.  It was delicious and I SO could devour another one.  I liked the creamy garlic as well.  They also serve Intelligentsia coffee, garlic knots, salads, and desserts (the chocolate pizza rolls looked quite appetizing...but we were beyond full)!  <br><br>Jimmy's is accessible via CTA #11 (Lincoln) and #92 (Foster) busses.  They do require a minimum $10 for any card (debit/credit) transaction.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/vxx4LvHfsqyHba03B9Hn0g/348s.jpg", "caption": "Marghrita"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/qb2WMsMQCGR0KXF3uC6a-w/168s.jpg", "caption": "Meat ball pizza"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/_3yX-Xa_0YJ6zpaNEXf9Jg/168s.jpg", "caption": "Spinach feta"}]}}, {"review": {"des": "Finding Jimmy's was like finding gold! Best NY pizza I've come across in Chicago coming from a tough critic! No need to go anywhere else..", "pics": null}}, {"review": {"des": "The only true AUTHENTIC New York style pizzeria in Chicago. Others come close, but this one would hold up against any in New York City itself...", "pics": null}}, {"review": {"des": "Great pizza place in Chicago! Don't sleep on the mushroom! The garlic knots were nice and doughy as well. Very nice staff and pretty clean place although a bit small if that matters to you.", "pics": null}}, {"review": {"des": "Sorry if this makes me a traitor but I'll take the floppy New York style pieces over square cut Chicago thin crust any day. This might be my fault for going to the wrong places but I have been largely disappointed in all the thin crust pizzas I've tried here. So, at this point, I don't really care about being a traitor to my city. I just want something delicious. <br><br>I'm happy to report that Jimmy's is WORTH the hype. It is pure New York style pizzeria- the white pie is garlicky and has a huge blob of ricotta on it- to die for. I also tried the plain cheese which had a nice zesty sauce. Easily the best pizza I've had since moving to Chicago two years ago. If you're a fan of New York style, head down Foster and give Jimmy's a try!", "pics": null}}, {"review": {"des": "Looks like NY pizza and tastes like it. Raised in the Bronx, I know a good NY style pizza. The pepperoni was off but other than that it was on point and it was delish. Will definitely be back when I'm in Chicago!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/o-fTFB9u_tYEM3GQwA_1mw/348s.jpg", "caption": "The pepperoni is not NY style but everything else was on point!"}]}}, {"review": {"des": "It was fine. The order was a little off, a bit cool, and a bit bland. <br>I added some onions, garlic powder, salt, pepper, and basil to my white pizza and stuck it into an my pre heated to 450 oven for 8 minutes and the result was a delicious pie for myself and my fiancée. <br>I'd order from them again, everyone has an off night, but I wasn't super impressed. <br>As a base to build from the pie was solid though. <br><br>All in all I was mildly disappointed but not enough to write them off completely. <br><br>Oh right, the order. I'd asked for a white pie with basil and spinach added to the whole thing and olives on one side. They sent basil and spinach on one side and olives on the other. It's an understandable mistake, and I just added stuff and made it my own thing, so no big deal, but I can't give better than 3 stars. Like I said, I will give them a second chance. :-)", "pics": null}}, {"review": {"des": "Wow! Surprisingly good pizza. I pass by this place allllll the time, but I never was really pulled in. After reading some reviews, I figured why not.<br><br>The pizza was really good, especially the white! He only downside to the great taste was how salty the pizza slices are. I was parched and needed constant rehydration with the amount of sodium I was consuming. <br><br>Unfortunately, they have $10 minimum for credit cards.", "pics": null}}, {"review": {"des": "Uh, amazing. Someone was asking for recommendations on the best NY style pizza in Chicago, and maybe 20 people all recommended Jimmy's and for good reason. Now that we've found it, my husband and I are having a hard time getting pizza elsewhere.<br>Their white pizza is amazing, and randomly they have beef pepperoni, so if there's no pork on your fork, check this place out. Seriously the pizza has been amazing. Next I'm going to try the calzones. Also, for those of us too far for delivery, there's parking so you can pull up easily and grab your pizza to go.<br>RUN RUN RUN. This place is legit. Pizza by the slice but we've been doing whole pies. Because, you know. Pizza.", "pics": null}}, {"review": {"des": "I'm from NJ and a total snob when it comes to a good slice. I appreciate Chicago style pizza but sometimes you just want a slice. This place is legit. We got the white pizza. The pizza was foldable with a nice crunch that was not overdone. It was one of the best white slices I've ever had. Will definitely be back.", "pics": null}}, {"review": {"des": "Authentic NY pizza!! It is AMAZING! We are so glad we found this place! I had my friend over who grew up in NY and she could not believe there was a place in the Midwest that made pizza that tasted authentic. This is definitely our new pizza spot! No more deep dish for us.", "pics": null}}, {"review": {"des": "Hands down the best NY style slice you'll find in Chicago and probably the Midwest. I'm chicago born but I lived in North Jersey for a time and came to love this style of pizza (almost) as much as my beloved native traditions. This place deserves 4.5 stars, and it's sitting at 4 currently, so I am giving 5. Delicious counter served pizza, no frills, no complaints for service and the price is only slightly higher than I'd like, but really is completely reasonable. Brooklyn special (2 slices and a drink for $9, I think) is a great deal.", "pics": null}}, {"review": {"des": "I love the pizza here!! The chefs are creative and the prices are reasonable!  They also have a pizza special of the day!  I've eaten here about five times, and I've always been impressed!  The only downfall is that the space is small! All together, this place is definitely worth checking out!", "pics": null}}, {"review": {"des": "My first bite into the Garlic Knots and I actually said \"Holy Shit!\" They are so good. The Buffalo Wings were cooked well, not really spicy, buy very good. The pizza is awesome. Very New York style thin crust with big slices you can fold up to eat. And they have beingets, which is actually kind of wierd, but they were cooked well and tasted amazing. My only complaint is something I read in another review...For 3 plus dollars to put any topping on the pizza, and it's the same price if you put different toppings om each side which makes no sense since less should cost more, they really should give you more than one piece of pepperoni per giant slice. Other than that it is really amazing. I highly recommend this.", "pics": null}}, {"review": {"des": "I follow the universal standard of pizza reviews set by the legend Davey Pageviews. One bite, everyone knows the rules. <br><br>Delicious. It all starts with dough. I cannot say anything wrong. Second. The crust was perfectly done with that crisp bit. Third I had the white pizza. Wow. Taste buds exploding all over the place. I also had a sausage slice. The homemade sausage is excellent. <br><br>In honor of Davey this would be a 8.6/10", "pics": null}}, {"review": {"des": "Jimmy's is good, don't get me wrong. But with all the articles about it being the best NYC pizza, expectations got deflated. <br><br>The pizza is thin and tasty and has the potential to be extremely good if it's a fresh whole pie. Ordered a pepperoni pizza with garlic knots and beignets. Was so excited about getting beignets but these were my least favorite. The beignets are huge, order is 3 large squares. The crust hardens rather quickly and has this plastic like texture. The garlic knots were the clear winner- 4 stars for the knots on flavor, softness, and liked they they were jumbo aspirational. I'm tempted to come back and order a whole pie to see if a fresh pizza reminds me pizza back east.", "pics": null}}, {"review": {"des": "Worst pizza I have ever seen in my life. Cartoon pizzas look better than this. It shouldn't even be called pizza. Manager was kind and gave me a refund and this pizza is going in the trash where it looks like it came from. Jimmys step it up. New York style pizza is not cardboard it's cheesy and delicious. I mean come on your pepperonis look like mini fried Bologna's it's disgusting. Very disappointed, I was looking forward to try a new place I was told would be delicious. Such a let down.", "pics": null}}, {"review": {"des": "I ordered delivery. The pizza and knots were good but it was clear that none of the food that I had ordered for delivery was fresh. Knots and pizza slice tasted reheated and the salad had a sticker with yesterday's date. On top of that it was clear that the salad dressing , which has an oil base, was refrigerated and not fresh since the oil was congealed. I would not order delivery again unless it was for a whole pie. Maybe then it would be fresh. For a $15 delivery minimum I would hope for fresh food.", "pics": null}}, {"review": {"des": "So sad to write a bad review as we were so looking for a good experience as we find New York style pizza in our new neighborhood. We ordered their signature white pizza and I added spinach, an absolutely necessary addition IMO. Slice of cheese, and chicken Caesar salad and garlic knots . It was a little over an hour for the delivery despite them being within a couple of miles but, that's not a big deal. White pizza arrived barely warm, slice of cheese was room temperature, and the chicken Caesar salad had no dressing.  We were really hungry so I just put a couple of slices of pizza in the oven then called the restaurant about dressing. Even though I didn't ask for the manager, person on the phone put them on and the manager offered to either send the dressing OR offer a credit for the salad. ( we paid cash ) . I even mentioned the temperature of both pizzas to which he offered nothing. At that point I did request he send a fresh slice of cheese. Around 45 minutes later my salad dressing arrived with the slice of cheese. No apology from the manager on the phone. No compensation offered! Chicken from the salad was particle board ham tasting grossed processed microwaved garbage. Garlic knots were dry and hard as rocks. Cheese pizza had no flavor. White pizza was really good.", "pics": null}}, {"review": {"des": "One of the better slices of NY style pizza in Chicago, and while the price can be a bit high at $4 per specialty slices, biting through them is satisfying enough that forget about it. Also satisfying enough to forget that the owners aren't Italian, but actually Korean. I guess it's not that surprising in retrospect, given the many other Korean dining establishments in the surrounding area, but hey I was caught of guard. But as long as they're nice and make good food, I'm not complaining. The Classic Margherita, White pizza(if you're a fan of garlic then you'll be in for a treat), and reg. sausage are all great options. Also shout out to the beignets, which are decadent, but definitely worth it if you're a fan of warm, fluffy, powdered sugar deliciousness.", "pics": null}}, {"review": {"des": "Fabulous place. My go to \"I've had a bad day and need pizza asap\" spot. It's ready for me when I get there and the slices are flavorful and inventive as heck. Good service and vibes too. Everyone needs a casual 'za spot like this!", "pics": null}}, {"review": {"des": "There are so many good places to get pizza in Chicago, and fortunately we have Jimmy's in Lincoln Square. The New York style pizza is delicious, priced reasonably, and isn't covered in grease. Jimmy's may not have the atmosphere of a Homeslice or a Parlor Pizza, but they make up for it with everything else. You have to try it!", "pics": null}}, {"review": {"des": "This place reminds me of the pizzerias in New Jersey where I grew up.  The smells, music, and spartan ambiance lend authenticity and familiarity to anyone who grew up in the NY/NJ/CT area, and it's something I've truly missed in all of my years in Boston and Chicago.  The only thing missing were the coin-operated arcade games.<br><br>We went with 2 slices apiece on our visit tonight, and ended up with both their veggie (artichoke, goat cheese, sun-dried tomato) and meat (bacon and pepperoni) special slices, as well as a slice of their white pizza with ricotta.  Four solid stars for excellent slices that we could fold up and eat, but one star off for the cashier overcharging us and then arguing with me when I pointed out her error.  Also love that they have parking behind the building just off Foster<br><br>We'll be back!  Just a suggestion to the management to try not to doubt the customers when they point out obvious errors.", "pics": null}}, {"review": {"des": "Outstanding New York style pizza. From a displaced New Yorker (Queens/Long Island), this is really good!!  Been in Chicago over 4 years and this is the only place I've found that compares. <br><br>Also, friendly note to my fellow Chicagoans: Please don't call New York style pizza \"thin crust\".  Just call it \"pizza\".", "pics": null}}, {"review": {"des": "Can't get any easier or yummier for a flyby slice pickup or a whole pie pickup.  Delivery is nice - but best to enjoy the slice at the cafe in the winter, the added warmth and toasty cafe feel add a nice quality to the experience, and the staff are wonderful.  Ingredients make the pizza and these are high quality, flavorful morsels of meat and veggies that standout on an NYC thin pie.<br><br>The beignets are super, and they even pour a great cup of coffee to boot!<br><br>Glad to see this pizza joint thrive, they've earned it!", "pics": null}}, {"review": {"des": "Seriously, just got a slice of veggie pizza and it was the best I've ever had. Thin crunchy crust, spinach tomato cheese. So good.", "pics": null}}, {"review": {"des": "Pizza is so yummy! Great atmosphere, wonderful customer service, the white pie is my personal favorite although I was so pleasantly surprised at how delicious their marinara is as I am very picky about red sauces. Everyone should visit! Thank you for the great spot!", "pics": null}}, {"review": {"des": "Came in after grocery shopping yesterday! Iv'e always passed this place multiple times and never went in. I was craving a good slice of pizza and this did the trick! It was delicious and very thin. Very tasty and crunchy! Will definitely order a whole pizza next time", "pics": null}}, {"review": {"des": "NY style pizza! so yummy! thinnest crust and nice crispness", "pics": null}}, {"review": {"des": "This place is the most solid spot for thin slice. Legit, Brooklyn thin slice. The sauce, it's amazing. The toppings, they're incredible. The price, it's outstanding. And above all else, they're consistent. <br>They also have maple bacon garlic knots. <br><br>That alone should be enough. Do it.", "pics": null}}, {"review": {"des": "Thin...NY Style...cheese melts/bit greasy  (which means its real)..awesome spot at Foster and Damen. Recommend.Also daily slice and drink deals.", "pics": null}}, {"review": {"des": "Mother's Day at Jimmys ! We drive 90 min to get the BEST NY style pizza in all of Chicago! <br>You must try it & oh so yummy Biegnets with Chicago's Intellegentsia coffee.", "pics": null}}, {"review": {"des": "Trust and believe this is one of the closest things to NYC piece you're going to get in Chicago. Even when Chicago pizza places aren't selling \"Chicago style deep dish,\" most of the pizza in Chicago is just not pizza. The ratio of crust to sauce to cheese to other toppings is way off. Usually the crust is way to thick, too soft, too much cheese, too many other toppings. And who every thought it would be a good idea to cut pizza in squares? People in the Midwest are confused about a lot things, and pizza is one of them.", "pics": null}}, {"review": {"des": "Comparing  (and/or contrasting) Chicago to NY pizza is not unlike trying to compare apples to oranges.  They're two different entities and everyone has their own preference.  If you prefer thinner crust pizza ( like it's frequently served in Italy and NYC), Jimmy's is your \"go to\" place. Have passed this joint for years, and had I known it was this good, I would have stopped in long before.  <br><br>The crust has just the right amount of elasticity and the perfect crunch .  Getting both of these things right at the same time is the key.  Toppings were ample and freshly prepared. Just the right amount of tomato sauce painted on.  Would I opt to eat there.??? ....no, I think not.  Pick up ur pie.  The free parking they advertise sucks.  U got blocked in.  (Next time, I will park on Foster with the flashers on.  Run in...run out ) .", "pics": null}}, {"review": {"des": "I'm originally from Boston and this is my favorite pizza place in Chicago. Either you love deep dish or you don't (I don't) so these nice big foldable thin New York style slices hit the spot. The ingredients are good quality. I can never eat a slice AND three beignets so I am either visiting this cafe for pizza or beignets but never at the same time :) <br><br>Instead of three beignets, I wish they were available individually or as two, because then I could eat them with my pizza.", "pics": null}}, {"review": {"des": "I ordered the plain cheese from here and it tasted like bland cardboard.  I don't get what the hype behind this place is about.  I will not come back here.  I've given them two chances and both times the pizza was extremely bland.", "pics": null}}, {"review": {"des": "This pizza was just meh, for me. I stopped to get myself and a co-worker a slice one day after craving pizza. The slice size was average and they had a good amount of choices for toppings available. I had sausage but, wasn't overly impressed with it within my first bite. My co-worker wasn't so thrilled with it either. My crust was a little soggy, chewy, and wasn't very hot although, the diff put It in tnt oven. It had very little sauce on it and the sausage was not very flavorful. Nah, I probably won't return, again in the future.", "pics": null}}, {"review": {"des": "Oh man, this pie rocks! Stopped in for a couple slices mid-afternoon. Small place with a glass case full of beautiful pre-baked pies with a variety of toppings greets you when you walk in. The house made sausage was delicious. The crust, cheese, sauce, everything to make it the perfect NY style slice. Choose your slice and they put it in a super hot pizza oven for a couple minutes. Fantastic. Service was very good, friendly folks. I can't wait to visit again.", "pics": null}}, {"review": {"des": "Update: beignets are killer.<br>Yelp won't let me write that short of an update, so I'm typing more words into this box to fulfill their crazy demands.", "pics": null}}, {"review": {"des": "Nothing about this place is NY, except it's ridiculous prices!! $4 a slice for overcooked, tasteless, sauceless, cheeseless pizza???!? Give me a break! <br><br>We literally tasted nothing as we ate this garbage \"pizza\". You're better off going to Pizza Hut or Dominos.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/vARKxtwMTr3egJ2i2EOunw/168s.jpg", "caption": "And it's too thick!!"}]}}, {"review": {"des": "Deep Dish will always be #1 in my heart, but Jimmy's always makes me question that statement. As a resident of Lincoln Square, I'm glad to have found this place because it always fulfills those cravings of New York pizza. The white pie is my personal favorite (though I haven't tried any other type of slice), and their beignets end the meal perfectly. The people who work at Jimmy's are kind. I can't complain about much whenever eating here but if you're using card be aware of the $10 minimum.", "pics": null}}, {"review": {"des": "Fantastic Pizza!  Very friendly staff and especially the owner Jimmy :)  My girlfriend and myself are vegans (for health reasons) and they did EVERYTHING to accommodate our dietary wants and needs on the spot.  As for the pizza...WOW, SO DELICIOUS!  We ordered 3 different 20 inch pizzas and each was so very delicious and very much  to our satisfaction. Being from Chicago I am used to \"Chicago Style Pizza\" but this place being NYC style pizza, besides the in depth flavor of the toppings it was fun to fold the pizza and eat.  My favorite  of the 3 we ordered had red onion, roasted red pepper, kalamata olives and jalapenos with extra sauce since we ordered vegan and DELICIOUS.  My family members who have to have and love cheese ate this and the other 2 up before they ate up the other pizzas with cheese (from another location on the south of Chicago).  We and our families will definitely be going back whenever we and they go into the city and are in or even a distance from the neighborhood.  If you are or even if you are not vegan and enjoy pizza this is the place to go...even if just for a slice, and they have a large and delicious looking variety for you to choose for just a monster size slice (I thought I would miss having cheese on a za)...usually pizza joints have just a couple of the basics types of pizza single slices where here they had at least 6+ to select for on the spot fresh and large single slices of pizza pie.  As for all said above, I do not know how many slices I had BUT I could not stop eating. YUM!  The only thing I would want to see changed about this place is that they would have other locations near my house in the northwest suburbs but definitely worth the 25 mile drive into the city to visit family and eat at your establishment. Jimmy, YOU AND YOUR PIZZA ROCK! Keep up the great  work and hope your business continues to thrive and stays there for years to come :) Thank you again for accommodating our dietary wants and needs. If we ever go off our vegan eating we look forward to trying your beignets as I see have been given top awards.<br>Cheers and Rock on!<br>Cliff and Tina", "pics": null}}, {"review": {"des": "Just moved to the area, love NY style, keep your deep dish! My regular spot for a slice or two.", "pics": null}}, {"review": {"des": "Best New York style pizza in Chicago! I'm from Jersey and I LOVE pizza. Been eating my weight in pizza throughout Chicago for the past 6 years and was never satisfied with the thin crust pizza offered at other pizza shops that CLAIM to serve NY style pizza. Nope nope nope, they all failed miserably. I literally gave up on ever finding that special pizza joint until a new co-worker told me to try this place. <br><br>Of course I was quite hesitant, but sucked it and spend the money on a slice of plain and white pizza. VERY impressed with the size of the slices. The counter help was amused by my skepticism and assured me that I will enjoy Jimmy's pizza. <br><br>I took the slices home and ate them both without warning them up. WOW, I AM IN LOVE!!! I cannot wait to go back and try their other pizza. I am not a religious person, but I pray Jimmy's never closes. <br><br>Thank you Jimmy for making me so happy on a very stressful day. I'm very happy.", "pics": null}}, {"review": {"des": "This place is awesome. The pizza is great and tastes pretty close to a NYC pizza slice. The dessert donut things are pretty great too. The delivery is fast and the service is really good. I loved their garlic knots and meatballs. Totally recommend this place", "pics": null}}, {"review": {"des": "Our go-to Chicago slice place. The space is small but there are always open seats, the staff is friendly, and the slices are tasty and sizable. No frills just delicious za.", "pics": null}}, {"review": {"des": "Delicious pizza warmed up in the oven the next day. The only problem was that it was a little luke warm when it arrived.", "pics": null}}, {"review": {"des": "It's nice to have NY style pizza in Chicago, yet even better that they are offering beignets. The pizza itself is almost always good UNLESS you're taking it by the slice. It's a bit of a gamble on how dry it'll be if it's been sitting out, and will have lost it's signature NY foldability. Garlic knots are great. As for the beignets, I've lived in Baton Rouge and New Orleans for the past 10 years, they're as close as you'll get to Café du Monde's quality although it's not exactly hard to screw up beignets.", "pics": null}}, {"review": {"des": "I'm a Chicago guy who likes NYC style pizza. Before you blow your stack know this off the bat. So I walked into my local coffee joint and expressed this, I don't remember why, but no less than 3 people told me to go to Jimmy's.<br><br>Jimmy's is not what I expected it to be, instead it was something better. A family owned pizza parlor where the owner wants your actual opinion and cares for your feedback.  Not only will I go back for pizza by the slice, but when my snobby NYC friends come to visit, I'll take them to Jimmy's.<br><br>Apparently they also have famous Beignets! We didn't get them this time, but I'll be back to try them. Look, we all need our own place to get a slice, know the owner, and have it the way we like it. For me... I think this is gonna be Jimmy's. if you don't like it, less of a line for me. If you do, my name is Erik, I'll be the fat guy sitting in the corner, say \"hi\".", "pics": null}}, {"review": {"des": "It's been a few days and I am still thinking about this pizza.<br><br>*Chicagoans, please don't hurt me. I have a special place for Deep Dish in my heart (and my stomach), but something about this NY style, thin crust...was.... AWESOME.<br><br>It's sort of a hole in the wall. $4 a slice. 12 kinds of San Pellegrino. Beignets (we didn't have any, but they also looked awesome. HUGE). Garlic Knots. Caprese salad that came with this amazing dressing that was probably laced with...I don't know...awesomeness?<br><br>Credit card for purchases over $10 only.<br><br>After we each got a slice of margherita pizza...and by got, I mean inhaled, we split a slice of the white pizza with garlic and ricotta cheese.<br><br>Hold on, while I wipe the drool off my keyboard. I want this pizza again so much.<br><br>$18 for 3 slices, and a salad (one piece was to go), and then we literally gave them $4 in change so that we could get another piece. I'm so glad we did.<br><br>It's small. Seats maybe 15. But so so so good. Totally hits the spot when you want a piece of pizza that's as big as your head.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/JGZPV3EDR8aX24KESmU5hg/348s.jpg", "caption": "White pizza, with garlic and a lump of ricotta. Days later, I'm still thinking about it."}]}}, {"review": {"des": "We were introduced to Jimmy's by family who live right across the street and now we make it a point to drive there to get pizza and beignets!  Beignets with my morning coffee is a special little treat some mornings when I'm working in the city! They're to die for! And all the other reviewers have nicely captured the pizza! The point at Jimmy's is that you're getting a traditional New York style pizza in Chicago and that's pretty hard to come by! So if that's what you crave, you will not be disappointed with Jimmy's!", "pics": null}}, {"review": {"des": "I've had New York style pizza in New York that wasn't nearly as good as this!  If you know and love New York pizza like I do, Jimmy's Pizza Cafe will not disappoint.  Jimmy and Alex are both passionate and knowledgeable about their product.  Because of this, their pizza is a real winner in my book.<br><br>Thanks to Amanda W. for the tip on Jimmy's...love the place!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ahgMFCiAbughK3mCj18lxg/348s.jpg", "caption": "One slice...some of the sausage is hidden under the cheese.  There was no skimping here. :-)"}]}}, {"review": {"des": "Delicious pizza, and plenty of interesting selections to choose from. In my opinion, best New York style pizza hands down! Located in the Lincoln Square area, corner of Lincoln Ave and Foster Ave.<br><br>Stop by, you'll be glad you did!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/QZACUBkxJ3hokS_dUurwng/348s.jpg", "caption": "Pepperoni pizza time!"}]}}, {"review": {"des": "This place has the best pizza in Chicago if you like New York Style pizza. It is the perfect balance of saltiness, chewy crust, and excellent sauce.  BUT they are sooooooooooooo slow if you order pickup. They say \"30 minutes\".   I have learned that NEVER happens. I have built in an extra ten minutes to my arrival, showing up in 40 minutes. Last time that wasn't good enough. I was standing around another 15 minutes. 55 minutes for a pizza?! I'll keep coming back because it's so good, but they need to correct  whatever is taking forever back there.", "pics": null}}, {"review": {"des": "Great New York style pizza. Fresh ingredients, consistent quality. The best that I have had in the city.", "pics": null}}, {"review": {"des": "This place magically combines two things I love: NY Style pizza and beignets. I think it's strange that I found my two loves in one heavenly place, but I am not complaining. The sausage slice makes my tummy smile, and then I accent my joy with an order of beignets. Yes, please! These are some pretty damn tasty beignets that can only be topped my Cafe DuMonde's. <br><br>Highly recommended.", "pics": null}}, {"review": {"des": "This place has the best beignets in the country.  I've been to New Orleans and tried the beignets there but they were soaked in grease. Jimmy's beignets are soft and fluffy and so delicious. As for pizzas, I recommend the white garlic. It is tasty, flavorful, and original.", "pics": null}}, {"review": {"des": "UPDATE: Decided to try ordering a pizza, rather than slices this time. We called to order carry-out and they told us 20minutes. We show up and the pizza is ready. $20 for a large pepperoni, not bad!<br><br>We take it home. I wasn't expecting it to be amazing, since the last time we had slices they were just ok. But boy, was I wrong!<br><br>This pizza is freaking amazing!!! The crust is sooooooo good. And I love the cheese & pepperoni they use.<br><br>Seriously, try this place. Yum yum yum yum.", "pics": null}}, {"review": {"des": "Great NYC style pizza, service is truly remarkable, above and beyond!  Susan and group are awesome!", "pics": null}}, {"review": {"des": "Chicago has great pizza but it doesn't have the \"slice culture\" that New York has. If we had a few more spots like Jimmy's Pizza Cafe, that might change. <br><br>I had two slices (the white pie with ricotta and the pepperoni) plus a garlic knot and a maple/bacon (!) knot. Everything was great but that white slice was probably the single best slice I've had this year - perfect crust, proper balance of garlic and cheese and that creamy dollop of ricotta.<br><br>The locals know - there was a steady stream of foot traffic at 2 in the afternoon. They even have parking!<br><br>If you are an ex-pat New Yorker or a curious Chicagoan wondering what the fuss is about \"New York style\" pizza after eating bad imitations, run, don't walk, to Jimmy's!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/nCrxUfAA-MmfBxyr82p-5w/348s.jpg", "caption": "A garlic knot and a maple/bacon knot. Who can say no to bacon?"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/RpqtyYWtegq94rbprqmDMA/168s.jpg", "caption": "The pepperoni pizza. Look at those curls - pepperoni here is properly cooked and cupped!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/uuDGIEKZQJFe8zw_Y3815Q/168s.jpg", "caption": "The white pie with ricotta. Garlic oil base, mozzarella and then ricotta. Easily the best single slice I've eaten this year"}]}}, {"review": {"des": "Love the white pizza here. I haven't tried any others, to be honest. It's hard to stray! The pro move is to spread the ricotta out on the piece before you eat it. We've done both delivery and take out, and both are good. The prices are reasonable, given how delicious this pizza is. It's not Chicago-style, but it is very good.", "pics": null}}, {"review": {"des": "BELIEVE THE HYPE!!!<br><br>Full disclosure: I have never had a TRUE New York slice. However, please believe that I have eaten my way through, probably, a literal ton of good and bad pizza of every style and topping variation in my lifetime, and Jimmy's sits comfortably in the winner's circle. If you don't believe me, read some of the reviews from actual New Yorkers that love Jimmy's, and you'll see it's the real deal.<br><br>I usually dine-in and do the Brooklyn special, which is two big slices and a drink for $8 and change, which is perfect to satisfy my weekly pizza craving. I usually go with one slice of white and one pepperoni or sausage, but some days I'm just feeling plain-ole cheese. Nothing wrong with that. They slide it into the mini-oven behind them while you pay, so they come across the counter to you piping hot. Garlic knots here are cheap and awesome, as well. The girls working the counter are always super-friendly. <br><br>I feel so lucky to have this North-side gem right here in the neighborhood. Of all the different pizza I've had, I honestly can't think of a single other spot in town that holds a candle to Jimmy's. I could absolutely see them eventually opening up more locations elsewhere in the city.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/sBgkVmAl7mP-IVfd6DUAbw/348s.jpg", "caption": "Sausage & white"}]}}, {"review": {"des": "My go-to for NY-style pizza in Chicago. Slightly overpriced, yes, but honestly it's so tasty, you quickly forget what you've paid.", "pics": null}}, {"review": {"des": "Recently saw their feature on Chicago's Best and had to try the thin crust.  The place is small with only a few tables, definitely heavy traffic for carry-out and delivery.  In fact, there was a big group of pizza delivery guys waiting on standby for their orders.  The line was steady and went up to the front door, but continuously moving.  It looks like a family-run business.  <br><br>Hubby and I split an order of garlic knots (3 pieces/order) and each had a slice, sausage and pepperoni, respectively.  The crust was thin and crispy.  The slices were a decent size.  Nice amount of cheese and not too greasy.  They offer a variety of San Pellegrino sparkiling waters, in addition to the staple soft drinks that go well with the pizza.  Glad to discover another decent thin crust joint near our neck of the woods!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/AEQbszBHYwj4_DR6BkZB4Q/348s.jpg", "caption": "Garlic knots, sausage and pepperoni pizza slices oh my!"}]}}, {"review": {"des": "This is my go to pizza for sure. Their pizza is absolutely amazing. Great garlic knots too. I've never dined in, but we regularly get their deliver or take out and I am never disappointed.", "pics": null}}]}