{"name": "jims-original-hot-dog-chicago", "reviews": [{"review": {"des": "This is the often imitated, never duplicated Maxwell Street Polish Sausage. I can literally eat this sandwich morning, noon, and night (because they are open 24/7 including holidays) but also because it's just one of my favorite sandwiches. <br>The simplicity of the sandwich (bun, sausage, mustard, onions) in relation to the quality and deliciousness beats just about any sandwich I know. It's also one of the cheapest, most filling sandwiches you can get anywhere. The blend of spices in the sausage pairs so well with the sweet, caramelized onions and mustard. I also enjoy the hot peppers that accompany the sandwich to give that acidic kick that I'm always looking for.<br><br>I've tried polish sausages at various establishments around the city, baseball games, etc., but nothing compares to the sausages and fries you get at Jim's. You also get the nostalgia of a true hot dog stand. Literally no where to sit. You just walk up and eat at an outdoor countertop or in your car, or take it home. Jim's Original is a true Chicago classic.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/EXMIb0YXQhdG9lqUTdkZ0A/168s.jpg", "caption": "Line on a Saturday night before midnight"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/XOkr_J_qaXWXiBB0YkC00A/168s.jpg", "caption": "Polish Sausage Sandwich"}]}}, {"review": {"des": "First, thanks to Jim's for being open Thanksgiving<br>Day - 11/22/18. I had really wanted to go up to<br>Jimmy's Red Hots on Grand & Pulaski but since I<br>was in the area I knew I'd do fine at Jim's.  There<br>was no one in line at 3:00 pm so I was able to order<br>and receive my food quickly. Two dogs, with fries<br>of course, and mustard & onions. I've been coming<br>here long enough to not expect the garden on a bun.<br>I guess newbies figure every Chicago dog house makes<br>them that way and that's far from reality. The tall young AA<br>fellow I dealt with was friendly and polite. That made my<br>meal that much better.<br><br>The hot dogs had just the right amount of snap, I didn't<br>have to try to rip them apart. Too many places serve<br>dogs that have no body to them, basically mush dogs.<br>Not here. The sport peppers are almost as long as the<br>dogs, and the dogs are the length of the bun.<br><br>While I wonder if Jimmy's has regular chopped onions I<br>always forget to ask, so I end up with a pile of grilled (or<br>however they prepare them) onions. I have to remember to<br>ask them to go easy on the onions. Still, I wish I could<br>make those at homes.<br><br>I'm wondering, did they change the fries? They seemed<br>to have a coating like the seasoned fries you get at some<br>places. They're not bad but I'd prefer the long (slightly greasy)<br>double fried ones. It's too bad you can't get your \"Chicago style\"<br>dog here but give them a try anyway.", "pics": null}}, {"review": {"des": "Went here cause I was told YOU HAVE TO TRY IT or It's a Chicago must, but sadly I was not all that impressed. The dog was not bad just wasn't what it was hyped up to be. Bread, a billion grilled onions, and mustard. Frys were not that great either. <br><br>Stand in line eat at the counter next to the store. <br><br>Whether you pick Express grill or Jim's doesn't matter they are basically the same. Same menu, same food, same price, same look. I think it's just a fun thing to argue over which is better. That's my two cents, been there done that, won't be back in future trips!!! But don't take my word for it, taste it yourself.", "pics": null}}, {"review": {"des": "I went to go buy two hot dogs this past weekend. The person I was with was craving a Chicago-style hot dog and I wanted to satisfy her taste buds. I asked for two Chicago-style hot dogs and the cashier said, \"we're from Chicago so they will be Chicago-styled.\" At least something along those lines. In my head I am thinking a Chicago-style hot dog would be topped with yellow mustard, chopped white onions, bright green sweet pickle relish, a dill pickle spear, tomato slices, pickled sport peppers and a dash of celery salt. The man who was preparing the hot dogs asked if mustard and onion were okay. I said, \"yea everything on it.\" My friend then said they only put onion and mustard on both our hot dogs and she no longer wanted hers. She told me she will eat it but not to make it a big deal. So I asked the cashier, \"just for future reference, next time I order a Chicago-style hot dog should I be made aware that you do not prepare it that way.\"  His response is what even triggered me to leave a review. He basically said, \"We are the original Maxwell and ALL our hot dogs are only prepared with onion and mustard since 1939 (now read that with attitude and sass please). <br><br>Honestly a simple, \"yea we do not do that here,\" would have been much appreciated at the time. The thing is the menu they have hanging up shows a Chicago-style hot dog (picture and all). If they want to be transparent to the consumer they should probably consider putting a picture up of the hot dog preparation they use. Maybe also work on being polite with customers. You literally have customers forming a line in the rain to try your food, you can at least try not to sound condescending while you are ringing me up.", "pics": null}}, {"review": {"des": "My number one hot dog place in Chicago! <br>I usually don't even eat them, but I crave Jims. They're open 24/7 and they make the food quick. If you're around downtown you can order it from postmates too. I order the polish sausage and cheese fries every time I go. They have some of the best fries from a fast food place, always crispy and hot. I order an extra cheese and pour it on my polish sausage sooooo good, perfect drunk food.", "pics": null}}, {"review": {"des": "The short and sweet of it review....solid hot dog and fries.  Pass this place all the time and see the lines and cars and have been curious.  Definitely worth a visit as the food is hot, cheap and good.  Fries were hot and crispy and the dog was a true Chicago Dog.<br><br>This is not a sit down restaurant, but they do have standing tables.  Staff is very nice.  Service is quick and fast.  Due to the level of hunger, me and The Heiress Apparent dug in before we could get a photo.  Next time....yes there will be a next time.", "pics": null}}, {"review": {"des": "If the lights are too bright, make them DIM<br>If you say Duncan, I say TIM<br>I suck at basketball, I'm nothing but RIM<br>But at 4am for hot dogs, go see JIM<br><br>If you go to war, you might lose a LIMB<br>If your hair's too long, you might need a TRIM<br>If you like a guy, get your loving from HIM<br>But at 5am for hot dogs, go see JIM<br><br>Jim's is really good but it definitely isn't as good as I remember. In the folklore of my mind it was one of the highlights of the Chicago food scene, but now I can see why I don't go there very often.<br><br>The Chicago dog is not a real Chicago dog. It's just a hot dog with some onions on it. \"Maxwell Street Style\" if you will. The sign clearly shows that if you order a hotdog you'll get all the Chicago stuff on it but no you won't. I have no idea if you will get it if you ask for it but it was too late after waiting in line for f***ing 20 minutes.<br><br>Not to mention all the abuse and the panhandling that you have to deal with at 4 in the morning waiting for food. There were some guys trying to start a fight and then there was an older blonde girl who kept trying to get me to buy her something. She was dressed expensively. There are homeless people all over here, starving. She should gtfo. If she was super attractive maybe. Just kidding. Kind of kidding.<br><br>I also got their burger which is pretty good but nothing to write home about unless you're using snail mail.<br><br>The highlight of the agenda is the Polish - mainly because of the excellent Polish sausage that they use on it. It's hot and juicy and crunchy and reminds me of the one at Ted's Hot Dogs in Buffalo.<br><br>But despite this being an institution that's been around for nearly a century, I can't really give it 5 stars. I love that it's open at 5 in the morning but now that they've jacked up their prices to nearly $5 per item and now that I realize there is so much superior Chicago food, I'm sticking with four.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/guH0jfNwFV8ky21Ne2gGqQ/348s.jpg", "caption": "Omg..... what have you done to me......"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/_l3VQ_ctfZCPAMCRXuJumA/168s.jpg", "caption": "Iceburger.... dead ahead!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/P8Yy8DZDoKln1xFkvsslvw/168s.jpg", "caption": "Don't get onion yourself"}]}}, {"review": {"des": "Bumping it up a star for the fries and cheese sauce!<br><br>Still quick and fast!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/4thNuPES60bKggPTuKZzmQ/348s.jpg", "caption": "Hot Dog"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/WktHnjIdKkH722YwwO9lAQ/168s.jpg", "caption": "Cheese Fries"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Tqj6CTJ9S5ZJPmoWyB0MEA/168s.jpg", "caption": "Polish"}]}}, {"review": {"des": "The food is fast, service is attentive and fries are delish!! This the second time I've had Jim's and I don't remember the first time. <br><br>I was not impressed. I ordered a double hamburger, cheeseburger and 2 polish sausages. Now I've been craving a polish so I was looking forward to it. <br><br>The food was so dry and hard to eat. Not sure if it was because it was late. The meat patties on the hamburger was thin and dry. My nephew could barely eat it. Though we had to get it plain, even dabbing it in ketchup didn't help. My niece thought the cheeseburger was dry as well. <br><br>As for the polish sausages. We ordered them with mustard only. They were crisp and had a nice crunch but I was not impressed. I like the polish sausage from another place in Bridgeport. Though theirs doesn't have a crunch when eating, it wasn't dry.<br><br>The fries are the best. I like my fries well done and with a crunch. If I only want fries I would come here. <br><br>Who knows maybe I will give it a try again.", "pics": null}}, {"review": {"des": "Brings back old memories when you stop at this spot if you grew up in Chicago. It's not a sit down restaurant. You order and you have to eat out in the street. Right next to the ordering spot, there's a standing table where you can stand up and eat. Loved the polish dog but I was more impressed by crispy French fries.", "pics": null}}, {"review": {"des": "I ordered the 100% Beef Polish and the Cheeseburger totally excellent and worth the drive downtown. The fries were standard But the Polish and Grilled onions on the Cheeseburger will make you overlook this.", "pics": null}}, {"review": {"des": "When I went to UIC, many a nights would end here with me getting a hot dog. It was cheap. The hot dog had a snap. Fries were so great. I'm sure I went here over 100 times as a college student.<br><br>I went last night when in the area and in need of some fast, cheap, alcohol-soaking-up food. It did the job once again like the ol' days. The guys working were all nice and respectful plus really quick in giving me my order.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/1fv02Iq9sWHY8uAV-mN3Yw/348s.jpg", "caption": "Doesn't the inside of their chicken sandwich look appetizing?! Hahaah"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/VckwDgHEFstpXrnXRxixNw/168s.jpg", "caption": "Pretty much the definition of drunk food"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/te3hVw7cTCqSjAQ0JXhtYQ/168s.jpg", "caption": "Fries for days"}]}}, {"review": {"des": "This small yet 70 years old hot dog stand has been selling authentic Chicago hot dog and Polish sausage ever since, with fresh, never frozen fries which I could taste it right at the first bite. The grilled onion was cooked perfectly and flavorful, and the fries were crispy outside but soft and moist inside. Pretty delicious. I could eat tons of their fries alone. Polish sausage, grilled onion, and mustard (no ketchup) combined in one hot dog bun merely making it one of the best Chicago hot dogs. As for the reasonable price to get such tasty meal, this place has quickly become my favorite.", "pics": null}}, {"review": {"des": "After trying this place, I understand why this is a Chicago institution. It's not just the cheap food or the free fries. It's the whole experience that you get from walking up to the counter, ordering, and taking your food to the side of the restaurant and eating it right then and there. As you're eating the food and basking in the light being emanated from the building, you feel like you went back in time to a bygone era when life moved at a slightly slower pace and you had time to enjoy the simplicity of delicious food. This place is a testament to how simple things done right can help an establishment stay rooted in a community and neighborhood for years and years to come. But let me dive specifically into the food now. This place is known for 2 things: Polish dog and pork chop sandwich. I decided to try both because when the opportunity presents itself, I say grab hold of it. The Polish sausage was fantastic. Thick and meaty, it was incredibly juicy and flavorful when you bite into it. You are also met with the most satisfying snap and pop as your teeth break through the natural casing of the sausage. The richness of the sausage is cut through by the onions that cover the top of the hot dog. Holding it all together was a soft bun that just soaks and drinks up all the juice and grease from the sausage and onions. The pork chop sandwich was fantastic as well. Although done in the same way as the polish sausage, it holds its own as a unique item because of how meaty the chop is. The chop has a great bite and texture to it and mixed with the mustard and onions, it was oh so satisfying. To top it all off, you get gigantic amounts of free fries with each purchase. The amount of fries you get puts the large size of most fast food places to shame. I really hope this place lasts for another 100 years and beyond. This place truly shows that we should support our local shops and restaurants because they offer stuff that will never be duplicated in mass produced chain stores.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/_JZuiTk-oyYou8yOJ_R5Ig/348s.jpg", "caption": "Storefront"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/_OyreibKV0i_M2I2MU6aJw/168s.jpg", "caption": "Half eaten polish sausage. Sorry, was too hungry lol"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/4LHNLH7HGMyfu53vBECGtg/168s.jpg", "caption": "Pork Chop Sandwich with hot peppers"}]}}, {"review": {"des": "One of our Lyft drivers was promoting the h*ll out of this joint!  He said they served the best Chicago style hot dogs & is a spot where locals like to go.  Count us in!<br><br>Located just a few minutes outside of downtown.  This place is off the beaten path because it is next to a few store & a residential area.  It is a small restaurant, no seating, order at the window, get your food to go or enjoy it at a standing area at the end.  No bathrooms.  They serve hot dogs, burgers, fries, & more.<br><br>Hot Dogs:  For the price, this is a steal.  Good.  Has all of the Chicago style toppings.<br>Fries:  Make sure to get cheese fries because their cheese is bomb!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/664G3T5YR2Zeys9JSLCDTA/168s.jpg", "caption": "Cheese"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/9re4hO2iZ1kHYkF4v_U9IA/168s.jpg", "caption": "Hot Dog"}]}}, {"review": {"des": "Update:<br><br>Just wanted to add that I finally tried their pork chop sandwich and it was also tasty. They onions and the mustard compliment the pork very well. I will probably still stick to the polish though. <br><br>This is definitely the place to go for a polish. Although any believe they taste just lie their neighbors, there's with out a doubt a different flavor within the polish itself. It felt more cooked and little bit more of a crunch when you bit on the dog. Onions were grilled to perfection making this Maxwell the best in the city.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/9UqK2hpQvuBtN0LkcLQEjQ/348s.jpg", "caption": "Pork chop sandwich"}]}}, {"review": {"des": "I don't know if dis was da original name but dey had da same menu, good old cholesterol fat laden, artery clogging food when Maxwell Street was in its hey day before Dey tore it down & built University Village.  Back in Da day many years ago when I was a Ut I use to come here when it was part of Maxwell street @ 3 or 4am in Da mornin.  I had many a drunken nights where only da grease from this food seemed to satiate my hunger, absorb the alcohol and reduce my hangovers the next day.  <br><br>After a night on the town we use come and have a polish sausage wid Da grilled onions & mustard or Da pok chop Samich wit da same grilled onions & mustard.  Ahhhh dos wer Da day my friend we thought they never end, but alas all thing come to an end.<br><br>I picked up my wife late one night from St Bernard Hospital as she worked the 2nd shift.  We were headed home up the Dan Ryan expressway when I got dis brilliant idea.  I said why don't we stop off and get a Polish Sausage.  Well just like the old days we got it wit da grilled onions & mustard, but unlike the old days I couldn't finish eating this greasy sausage.  I don't mean to be snotty, but I guess I evolved to a higher level.  It's time to retire the sausage.  I tried to relive the glory days like Al Bundy and give da sausage another shot, but alas it was not to be.", "pics": null}}, {"review": {"des": "Cheap and fast . A piece of juicy fat polish sausage on a bun with mustard with a ton of grilled onions comes with tasty fries.all for $5 A must if you are late after partying in downtown  is 5 minutes away.", "pics": null}}, {"review": {"des": "I came here last year and I completely forgot to write a review for this place.My boss brought me here along with a few others to give this place a try because he's been wanting us to try this place out. Best recommendation ever. Great hot dogs, great food, great everything. I felt satisfied and happy that I came here. There ain't many places like this at all but i'm glad I came here. Staff definitely knows what's up.", "pics": null}}, {"review": {"des": "first time<br>here<br>was really good<br>nice people they treat you  nice<br>i order the polish sausage<br>a can  of coke  i order extra peppers they put 3 omg i barely can eat one to spicy<br>i take the other 2 to go<br>leave a tip <br>this ppl work hard<br>thanks see you again", "pics": null}}, {"review": {"des": "I have only been to Jims after midnight. I wonder why. I don't know if the food is as good as I think it is cause I've never been sober when I eat hear. But, it always hits the spot. I run into so many people I know every time I'm there. I love this place", "pics": null}}, {"review": {"des": "Who doesn't love going down on a nice, warm, thick, juicy sausage? Jim's offers oral pleasure galore with its authentic Chicago-style dogs.<br><br>I got the 100% beef Polish sausage which was delicious and nicely sized - if size matters to you - and came topped with lots of sweet onions and some really hot peppers. It came out super fast, and the price was quite decent. <br><br>There's little ambience here, as it's just a stand without any seating, but you could eat at the counters along their outside walls, and, as most folks seem to do, you can also get your grub to go. Well worth it for the authentic, old-school Chicago experience - especially if you like sampling the local beefcake, err, beef.", "pics": null}}, {"review": {"des": "There is no polish sausage as amazing as what you will find at Jim's...PERIOD. At any time of the day or night, you can get that piece of Chicago tradition.. P.S. Ditka.. sausage..Bears!", "pics": null}}, {"review": {"des": "Ok wow this place is a joke. Has Chicago dog pictures on menu but clearly has no idea what a Chicago dog is. No matter what I said to him he just heard mustard and onions. Very poor attitude or I wouldn't have even left a review. Little bit of a language barrier.  Half a block down has real Chicago dogs.", "pics": null}}, {"review": {"des": "Stopped by after a Blackhawks game based on a friend's recommendation. Jim's was operating at full speed at 10:15pm on a Monday night! It's famous for the polish dog, but I opted for a cheeseburger. You can't beat the price- $3.55 and includes French fries! Order it with everything- yellow salad mustard on both burger buns, melted cheese, and grilled Spanish onions. It'll satisfy the late night greasy fix you crave!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/PtTl1DoLuuUprYt_bbN6yw/348s.jpg", "caption": "Cheeseburger- $3.55 and includes fries."}]}}, {"review": {"des": "Greasy goodness right here!! Walk up to the window place your order and 3 minutes later your food is ready.  Parking is not that great but possible.", "pics": null}}, {"review": {"des": "Great service!!! Not matter what time of day. Perfect Chicago south side dog. Always hits the spot.", "pics": null}}, {"review": {"des": "Here's another place that makes the case for Yelp to have a zero star rating available!<br><br>I had heard about this place's polish and pork sandwich in glowing terms, so I went out of my way to give it a try. It was awful. Definitely one of the worst tasting polish sausages I've ever had. I'm not sure what the sport peppers were spiced with, but I found those to be inedible too. The pork sandwich was edible, but it had no seasoning or flavor that would make it remarkable. Meh.<br><br>This place won't get my business again. There are far too many great places in the city to get a good polish -go to any of those instead!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/oE6bCF-I9-OrvFak3Hm7iQ/348s.jpg", "caption": "Steve Dolinsky! You steered me wrong yet again!"}]}}, {"review": {"des": "The fact that they are open 24/7 is clutch. Jim's is a solid stop after a night of drinking. I ordered a pork chop sandwich and a polish, based off of the recommendation from the gentleman in line in front of me. The food was definitely average, but it hit the spot. Super messy, super greasy, and fits the definition of drink food to a T. <br><br>If you're looking for some food when most places are closed, give Jim's a try.", "pics": null}}, {"review": {"des": "Trash. They don't sell good Chicago dogs. Skip it, and go to Gene and Judes or the original Jimmy's on Pulaski and Grand.", "pics": null}}, {"review": {"des": "Update: The peppers have again changed to some kind of pickled jalapeno. I really wish they would bring the appropriate sport peppers back.<br><br>I tried the fish sandwich for the first time and it was mush.<br><br>We asked for cheese fries and they said they'd throw in a cheese cup since we already had 4 sandwiches with fries, but nonetheless we were charged for a cheese cup and it wasn't in the bag. We also only appeared to have 2 bags of fries with 4 sandwiches. Maybe they consolidated the fries of the 4 sandwiches into 2 larger bags? Didn't seem like it, though.<br><br>The fries were really good this time, crispy and fresh.<br><br>Line at 2am on a Saturday was moving much slower than usual for some reason.<br><br>What's happening??", "pics": null}}, {"review": {"des": "Fries with every order you choose. <br>Really good fries. <br>Spicy jalapeños. <br><br>Sausage, hot dog, and pork. Definitely get the sausage. Pork was different but nothing too special.  Hot dog was good but it wasn't the tourist hot dog I wanted. <br><br>If I come back it's for the sausage, convenient, and late night eatd", "pics": null}}, {"review": {"des": "I got a cheeseburger n hot dog. It just tasted like a cheeseburger with nothing but onions. Same thing with the hot dog. The fries are pretty good. Reminds me of burger kings. My hamburger but had some grey spot on it...not mold...not sure. Consider this 3.5 stars...might go back...not sure", "pics": null}}, {"review": {"des": "Watch any Chicago food documentary and you'll come across Jim's Original in University Village. Tucked away in a little corner, it's a bit hard to find when driving - best to tackle the trip on foot. The service is super fast and you get much bang for your buck. The cheese fries and burger are some of the best in the city, and I hear it's open late - perfect for late night munchies!", "pics": null}}, {"review": {"des": "This is a good polish. It comes with fries and grilled onions are a nice touch. There's a place down the street that copies them. I figure they would taste about the same.", "pics": null}}, {"review": {"des": "This is a hall of fame institution, the standard bearer of the infamous Maxwell Street Polish Sausage. The Polish is outstanding but my favorite sandwich at this iconic stand is the equally famous Pork Chop sandwich. Order this with everything which includes grilled onions and mustard, peppers on the side. At $5.25, I can't think of a better value. All sandwiches come with consistently great french fries.  I'm a regular here, love that you can stop in here anytime of the day and grab a sandwich within minutes. Miss the old days when Jim's sat in the heart of the old Maxwell Street Market but enjoy the convenience of this location. A must stop, love the greasy pork chop sandwich, careful there is a bone in there.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/jdNQo1YKdlbsQHONid78Ew/348s.jpg", "caption": "Pork Chop sandwich, there is a bone in there."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ZNyKe7u37NkU1GYY4FEiAw/168s.jpg", "caption": "Pork Chop sandwich."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/LbVa32qd5azs72egvv3J8A/168s.jpg", "caption": "Pork Chop sandwich comes with some grease!"}]}}, {"review": {"des": "So good. I was never a hot dog person. So naturally, i never knew why people would pay to eat hot dogs. So after living in Chicago for 12 years, I finally tried Jim's hotdogs for the first time and it completely changed me!<br><br>If you're in down, please give this a try! There's no place to sit down and eat. But you can park your car temporarily and eat in your car if it's cold! Or there s a place where you can stand and eat!", "pics": null}}, {"review": {"des": "10 stars! Just sooo dang good! We have been here a million times over the years,love that it's 24/7! I literally always get the same thing every time,PORKCHOP SAMMICH,no mustard,comes with fries (that are prob my fav fries too) cheese dip,and hot peppers. Makes my mouth water. Everything is good though,the fish sandwich,the polish,but pork chop will always be my ride or die!! Super fast service,you park,walk up,2 minutes later you're back on the road. Such a classic Chicago spot.", "pics": null}}, {"review": {"des": "The hot dogs were honestly great, but the (male) cashier was heckling my friends and me, saying \"you want my dog?\" It was really gross and inappropriate. I will not be coming here again.", "pics": null}}, {"review": {"des": "Great Chicago style hot dog right off the expressway. Friendly staff. Didn't love the fries, but that's not why I was there, so I'll definitely be back!", "pics": null}}, {"review": {"des": "We always bring our family and friends from out of town here.We consider this place a Chicago classic. The staff is friendly and the food is the best.", "pics": null}}, {"review": {"des": "I've driven by here so many times, but never thought of stopping by. Until last week, when I had the time, and I was hungry for a quick bite of junk food.<br>Granted, it is junk food, but if it is going to be junk, let it be this. Quick, good, and cheap food. <br>Who wants to go to McD with this around the hood?<br>Thanks!", "pics": null}}, {"review": {"des": "Love this place awesome hotdog mixture never imagined putting frys on my hot dog ,place is in the ghetto but food so good it's worth the risk , no sitting area this is a grab and go place . Right of the highway.", "pics": null}}, {"review": {"des": "For anyone who doesn't know, Jim's is a classic Chicago fast food restaurant. Perfect for anyone who attends UIC(since it is so close) and for anyone looking for something to warm them up in Chicago's Windy City. Customer service is friendly and food comes out faster than any other fast food you can imagine. The \"Polish\" is by far the go to at Jim's. This place has a great hot meal ready for you fast and is right off Union Ave giving you a perfect view of the city.", "pics": null}}, {"review": {"des": "There's something about the polish sausage at Jim's Original Hot Dog stand. It's not the polish sausage itself because it tastes just like any other kielbasa at the grocery store. <br><br>Maybe it's the fact that they have been serving it for 70 years and there's a hint of Chicago history in each bite. On top of the grilled onions and smear of mustard, there's added flavor from eating outside standing with fellow Chicagoans from truck drivers and UIC students along beside you. The food also somehow seems to taste better if it happens to be 1am on a Friday night. <br><br>No frills or vegan options. Just a straight up dog served in a brown bag. Tastes kind of like... Chicago.", "pics": null}}, {"review": {"des": "This place is as good as it gets for chicago late night food.  Their polish dogs are sooo good!  And surprisingly their fish sandwich is also very delicious!  Def give this place a chance for a late night snack!", "pics": null}}, {"review": {"des": "This place basically OWNS Chicago hot dog stands. The Ruler, the King, the God, the Lord, the Master, CREME DA LA CREME! <br><br>No way you can say you LIVE in Chicago, say that you know good polish sausage but you've never been here! This place is consistent, tasty with reasonable prices. My go to is the polish sausage (you can get the one that's all beef too but I just go with the cheaper one). They put on top caramelized, grilled onions that literally melt in your mouth. They also put a touch of mustard on the bottom served with a steamed soft bun. <br><br>What also makes these guys good is the french fries! They are really good and you get them free with every sandwich you purchase. Upon request, you can also get Serrano peppers on the side. But beware, those peppers are not for the faint of heart. Those things will blow your SOCKS OFF! They pair great with the polishes but are overwhelmingly spicy.<br><br>Other honorable mentions on their menu include the cheeseburger and hot dog. But make no mistake, this place is all about the polish sausage. You'd be crazy to go here and not buy at least one of those. <br><br>The prices are fair, about 5 bucks for a nice sized polish with fries. They have 24 ounce sodas, bottled water, and canned soda also. There is no place to sit, (typical Chicago hot dog stand) but they have a long counter against the building where you can stand and eat if you wish. If you are transporting these buns of goodness, I'd recommend either putting the paper bag in a plastic bag (if you have one) and closing it tight or put them in the truck if you don't want the smell in your car. It's strong and will last for days.They also take cash and credit card which is so convenient especially when typically these types of places in Chicago don't. <br><br>My wife works not far from here and I make it my duty to visit every time I go to her job. It's a stand that has been in Chicago for years and I expect it to last much years more. THE BEST!", "pics": null}}, {"review": {"des": "Cheap. Delicious. What else do you need?<br><br>The polish dog was really good. Loved the onions and great meat to bun ratio. <br>I thought the pork chop sandwich was ok. Thought the pork chop could have used more char to add depth to the flavor. <br>The hidden gem of this place was the fish sandwich. Think of McD's filet-o-fish, but the version that's about 100 times better (I'm not a fan of the FOF at McD btw. I always preferred the other chains' fish sandwich). But here, every single ingredient in the fish sandwich is perfect. <br><br>I love that every sandwich comes with fries. And the fries are excellent too! Probably some of the best fries I've had from a fast food stand/chain. <br><br>I would come back here again.", "pics": null}}, {"review": {"des": "Well. The Polish Sausage is OK. Need grilled onions and chili peppers for flavor which did not excite me but The fries was actually good. Had the right size, taste and texture. Not sure if it holds good for leftover food. Being more classy when it comes to food this is the only Judgmental comment I can say about them. I just wonder how they compete with the other place next door? LOL. Old school Street food. It is something I would not think of 1st to grave but co-workers rant this is good. It is just OK. 3 stars for the fries. Take the side away and  I would have given just 2 stars.", "pics": null}}, {"review": {"des": "BEST HOT DOG I'VE EVER HAD. if you visit chicago, this is a must have!!! super local and delish. i got the regular hot dog and fries even though i usually don't like mustard and onions, but honestly that hot dog changed my mind. BOMB. oh, and those chiles that come on the side??? cherry on top. hella good. i wonder where they're from!", "pics": null}}, {"review": {"des": "As someone that grew up eating a lot of hot dogs in California, ranging from Costco to gourmet hot dogs, I began to hate hot dogs for their greasiness and that shitty feeling that it gives you.<br><br>However, this place completely changed my mind.  THIS is a hot dog that I don't mind.  <br><br>The texture was perfect.  The toppings complimented the hot dog very well!  All the flavors combine into 8-10 (for me at least) awesome bites.  <br><br>And for the price?  EVEN MORE WORTH.", "pics": null}}, {"review": {"des": "Simple and great. Enough said. Funny that there is a place that looks like this next door.", "pics": null}}, {"review": {"des": "I could probably eat this everyday. There's been late nights when I have eaten here several  nights in a row. 24 hrs of delicious-ness", "pics": null}}, {"review": {"des": "Only eat here when you're drunk after the club. I came here with my brother sober and I got a stomach ache 15 mins after eating it.", "pics": null}}, {"review": {"des": "What can you say about Jim's Original Hot dogs that everyone else hasn't said about this place over the years.<br><br>I mean one its cheap eats and is great when you are hungry after coming back from a party.  They are quick and the food taste good.  I mean its a similar place right next to it and the line wasn't nearly as long and chaotic as the one at Jim's.  <br><br>I got the fried polish which you have to request if you want it that way.  I like it that way because it gives it a little crunch on the outside and it is still juicy on the inside.  They don't just sale polishes they have hamburgers, pork chop sandwiches, chicken sandwiches and I also believe they have something for the vegetarian but don't quote me.<br><br>This is just a great late night run but that's my opinion I'm sure they get customers all day and night.<br><br>Check it out for yourself but it is an experience especially late at night so be ready!<br><br>Enjoy!", "pics": null}}, {"review": {"des": "I heard about this place from a youtube video and definitely HAD to check it out.<br><br>Obviously everyone comes here for the porkchop sandwich and the polish dog.  So thats what I ended up getting and I wasn't even hungry! <br><br>The porkchop sandwich was bread, grilled onions and mustard.  Its the same toppings with the polish dog. Each order came with fries.  The porkchop sandwich was pretty good, wasn't your typical dry chop, but watch out for the bone! Don't be mistaken and bite into the bun thinking there aint no bone.  The polish dog on the other hand, hands down the best. I'm sorry costco polish dog, you got nothing on Jim's. FRIES FRIES, i think they lace it with crack cause however they make it it is delicious!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/guo8HT_ipiM4jmhTrG8fjA/348s.jpg", "caption": "Menu as of 5/5/16"}]}}, {"review": {"des": "I've probably passed by this location at least a hundred times, looking at it from the Dan Ryan Congestway, wondering if it was a good place.  When I stopped there, I was amazed.  It is probably one of the best values that you can get in Chicago.  All of their sandwiches include fires and tax, so it's difficult to get over five bucks for a meal. <br><br>The place is also lightning fast.  From your order time to having your food takes at most a minute and though you don't have the convenience of a drive through, you still get your food pretty quickly.  The grilled onions are the best and are the perfect complement to both the polish sausage and the cheeseburger.  Everything is done simply with a quick slather of mustard and those sweet onions.  A pepper or two on your sausage is also a nice touch.  The buns are soft and steamed and this outpost being open 24/7 makes it a great spot for a late night.", "pics": null}}, {"review": {"des": "This is horrible place  to eat nasty omg never again Jim tighten up your dogs !! I don't see how you receive all these reviews  Florida food way better", "pics": null}}, {"review": {"des": "Hit up Jim's on our way out of Chicago back to Michigan. Got the Polish, Porkchop Sammy, and a dog! Polish was bomb wit da mustard n onions. Dog was tasty and had good snap. Porkchop Sammy would've been better if I was \"Shitfaced\". Good greasy grub for a good price", "pics": null}}, {"review": {"des": "Had this delivered through post mates and I had to throw most of my order in the garbage. I asked for no peppers and no mustard on my dogs and they were put there in abundance anyways. Never ordering from here again. Seems it doesn't matter if I make specifications.", "pics": null}}, {"review": {"des": "Jim's polish is amazing - perfect blend of beef, pork, and spices, light smoked, then charred on a flat top, smeared with mustard and piled high with carmelized, sweet onions, all wrapped up in a perfectly steamed bun. It's also less than $5 AND it comes with a pile of fries, that were pretty delicious as well! You can't beat this deal and there's nothing I'd crave more after a long night of drinking (or it's equivalent: a long, delayed United flight from San Francisco). I'd suggest \"easy mustard, easy onion\" so you can really enjoy the amazing polish sausage.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/uB0zQ9qi_0AH1snSLNoYVw/348s.jpg", "caption": "Polish sandwich - the lightly pickled peppers were surprisingly hot!"}]}}, {"review": {"des": "I used to come here almost everyday at 3am as a UIC student. I still enjoy their polish sausage and fish sandwich. It's probably the best late-night and 24/7 hot dog joint in UIC area. If you're a UIC student, bring your student ID and get your order with a free can of pop. Fries are always free. I love it when they accidentally add extra fries in the bag.", "pics": null}}, {"review": {"des": "Ok so, aside from people mentioning that Chicago's pizza is a must try we were referred to this Hot Dog place a few times. <br><br>So this place sits in somewhat of a sketchy part of Chicago by their University and along side a freeway. Nevertheless, we came and ordered and then were surprised with the tasty meal we got from this place. The location gets busy and apparently their is a \"imposter\" location just down the street. <br><br>The food itself was very tasty and worth the stop. Luckily we were a group so we felt ok coming here but we were told many people do avoid it because of the area. <br><br>This is not a sit in place and just an order-to-go place so dont expect to eat here. Also the staff are pretty straight to the point, they need quick answers etc but that's how Chicagoans are we were told. <br><br>Either way I would definitely recommend this place and would return on another Chicago visit.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/23-WwhX87bnk1LgdhXpR5g/348s.jpg", "caption": "100% polish dog"}]}}, {"review": {"des": "Jim is original, and normally their food is good. Today however we got the wrong order with a side of sass!", "pics": null}}, {"review": {"des": "A definite must when visiting Chicago!! Fast and delicious food that you won't regret eating. Polish sausage dogs are the <a href=\"/redir?url=http%3A%2F%2Fbomb.com&s=bb4f996415a9c2f21137e27cfb68f439a48cec2652b53e9b50dd7e766dbe177e\" target=\"_blank\" rel=\"nofollow\">bomb.com</a> and orange pop is a great drink. Personally would recommend and i'll definitely be visiting again...", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/8cacxEAIAViTVLbV3S6HoA/348s.jpg", "caption": "awesome spot!"}]}}, {"review": {"des": "This is Chicago's version of the Pat's/Geno's cheesesteak debate of Philadelphia.    I think Jim's was first.   Order yours with everything (grilled onions, mustard, hot peppers) like a local.    All sandwiches come with fries.   All for under $5.   Drinks are in cans or bottles.<br><br>Park on the street and step up to the window and enjoy a true Chicago original.   Jim's is open 24 hours a day and there is no seating.", "pics": null}}, {"review": {"des": "Great for when my friends are a little tipsy and (me being the sober friend) need a quick pick me up to get some food in their stomachs! However personally I think the food itself could be a little more authentic? The cheese from the cheese fries doesn't really taste like anything, and all the food here is quite greasy.", "pics": null}}, {"review": {"des": "Sloppy wet bun that knows who everyone really came to see, onions that carmelized longer than Kim and Kris's marriage, pickled jalapeños on the side that let you know they don't give a F**k what you THINK Chicago style is (no gard, zomg!) and a kielbasa like sausage with so much snap it slaps you in the face. <br><br>And some pretty damn good fries.", "pics": null}}, {"review": {"des": "Man the beef polish is to die for. Their fries I believe are deep fried in the same grease from the polish which gives it flavor. With the grilled onions and mustard, it's super delicious. I always come here when I'm driving since they are open 24/7. I can't wait to come here again. A definitely must if you are from Chicago!", "pics": null}}, {"review": {"des": "Five stars for the pork chop sandwich. Three stars for the polish sausage. <br><br>Pork chop (with bone) was awesome- was expecting it to be really fatty and chewy but it was surprisingly tender and was complemented well with a heap of sautéed onions and mustard. Would definitely go back out of my way for another one. <br><br>Sausage wasn't bad, it just wasn't anything that great.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/J-H2Eo14vF06IkACkXnCLw/168s.jpg", "caption": "Polish sausage"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/UbJwgjG6NEbIWVbRY6rnkg/168s.jpg", "caption": "Pork chop sandwich"}]}}, {"review": {"des": "If you want some good fast food, go here! Polish sausage \"with everything\" (yellow mustard and sauteed onions) was sooo good. Comes with a free small bag of fries--nice and crispy. No seating in the area (the food comes out of a window, like a walk-up drive thru, and you're on a service road), but if you walk a block or two away from the highway/service road, there are benches.", "pics": null}}, {"review": {"des": "my friend recommended this place to me. they supposedly have the best polish dog in the city. I haven't tried any other polish dog here yet so I can't confirm that statement but it smells amazing and was pretty darn good! apparently, this place is a Chicago staple and has been around for decades.<br><br>the description of the polish dog on their website says :<br>A Proprietary Blend of Just The Right Spices. A Juicy, Crunchy, and Sweet Smoked Polish Sausage Served the Same Way Since the 1940's, on a Hot Bun with a Layer of Yellow Salad Mustard, Topped with a Mountain of Sweet Colossal Spanish Onions Grilled to Perfection and with an Abundance of Spicy Hot Sport Peppers. A Bag of French Fries Is Included FREE. <br><br>it's $4.50 for a polish dog which includes French fries (win). not much to say other than that it's flavorful and well executed! order at the window and get your food pretty much immediately. they take card but sometimes their machine takes forever to work.", "pics": null}}, {"review": {"des": "Cheap, quick, and delicious. What more could you need for a polish sausage? Also the free fries are great haha. Glad we stopped by to check this place out!", "pics": null}}, {"review": {"des": "I Love Jim's original hot dog , they are the greats food to go , check it out guys taste like Jew town food ,  hamburgers, hot dogs , Polish with grill onions on them and ht peppers", "pics": null}}, {"review": {"des": "Ok, it's time to throw my hat in the ring for Jim's Original. Once again, however, I must begin by digressing for the sake of context.<br><br>As a kid growing up in Chicago, the different elements of city life peaked my curiosity... as it does for natives and visitors alike. The endless buildings downtown were like a playground waiting to be discovered, but the bustle of the more industrial neighborhoods was of interest as well. Among the more well known areas such as this, was the Maxwell Street Market. Fond memories of my dad er... \"negotiating\" at these open air bazaars for anything that caught our eye, helped shape the man who writes this review today. The energy of hardworking \"merchants\" peddling their wears was palpable, and made for a wonderfully unique Sunday morning experience. Later in life, as I started running the streets myself, friends and I could shoot to this area at all hours, to satiate a craving for the now famous, Chicago polish. This taste memory is synonymous with visuals of the shacks from which these delicacies were served. Made mostly of ribbed sheet metal, the structures were designed to be cheap and easily struck.  <br><br>If you enjoyed that, we gotta go back even further. Most people are aware that a Chicago Hotdog is a somewhat specific bit of tasty nostalgia. Like all cultural staples, this delicacy originated for reasons unique to it's place of origin. By the 1930s, Chicago had distinguished itself as a shipping and distribution hub.This both facilitated and demanded access to superior livestock and food production. The operation of the infamous stockyards became a booming business that attracted high numbers of Polish immigrants. In a city with an unrelenting work ethic, cold winters and lots of beef byproduct, the hotdog stand that Jim Stefanovic took over in the 1940's was a lifeline for working Chicagoans. <br><br>Having worked at a bazaar in Romania, following an escape from a Russian invasion of Yugoslavia, Stefanovic built his hot dog stand into a small empire. Since the youthful days of this Yelp Reviewer, the City has pushed the Sunday morning markets along Roosevelt and Halsted clean out of existence. True to our current homogeneas gentrification patterns, a Whole Foods, Home Depot and Best Buy, all stand proximate to where these unique open air marketplaces once dominated.<br><br>Jim's Original Polish Sausage stand is more substantial than the temporary shacks of my memories... but not by much. About the size of a large trailer, you're served some of Chicago's most delicious street food, well, right on the street. There's a ledge there that gets some use, but for me, a polish is best enjoyed in your car with the radio tuned to NPR. The best part of the experience is how connected you feel with this part of Chicago's history. For the (very) brief time you're in line, your fellow patrons hail from all walks of life. Tourists, law enforcement officers, construction workers, criminals... and people from every economic strata, all swing through to enjoy a great Polish Sausage.<br><br>I love that it's cheap and fast. Open 24 hours a day, 365 days a year, it's a comfort not thinking about availability or parking... cause  you barely leave your car. My cravings for this Dog run very high and are sated perfectly by a five minute stop overlooking the expressway. The peppers they give you, upon request, are very hot. I usually ask for only two, and tend to eat them along with bites of the pork sausage. The caramelized onions are a satisfying way to go, though they can be overcooked. I wouldn't mind Jim's offering more conventional accoutrement such as pickle, sport peppers and neon relish, just to shake things up a bit.   <br><br>I would have a very adverse reaction to this institution closing it's doors.<br><br>I can't recommend anything on the menu other than the Polish. Ive branched out a little to taste the hotdog, burger and fish sandwich (I think), but they're not great. I keep coming back to the Polish, which scratches an itch i've gotten periodically since childhood. There's more about Stefanovic's story on the Jim's Original website. Even if you're not a history buff, though, for the sake of all that is tasty in Chicago, get in line at Jim's and order yourself a Polish!   . <br>  .", "pics": null}}, {"review": {"des": "Stopped by for lunch yesterday, and I got the Polish, the free fries, and a diet Pepsi.<br><br>The casing on that Polish was great, and the bun was also solid.  But the actual flavor of the meat was only so-so, certainly nothing to write home about...that said, I'm not an expert in the sausage field.  Just didn't register the way I was hoping it would.<br><br>That said, Jim's is still dirt-cheap; the food above cost me $5.70 and it was plenty of chow for a normal person's lunch.  And they turn customers over fast here, so even if the line looks long, you won't wait more than about 15 minutes to have food in your gut.<br><br>A Chicago staple...glad I finally hit this one!", "pics": null}}, {"review": {"des": "OK so I'm sorry if I offend somebody, I know this is an institution in itself but my review is different. <br><br>I got the pork sandwich bone in. <br><br>I also got the Vienna sausage. <br><br>So the pork sausage was good, it was more soggy they I would prefer. But the onions were tasteless no salt, pork was not cherry but it wasn't tender either, out was OK. But it had no salt,  no flavor. <br><br>The Vienna sausage, well it was OK, had a nice snap to it, the bun was OK, nothing to write home about, the onions again disappointment, no flavor or salt. <br><br>The best thing was their fries, they were awesome amazing crunchy and soft at the same time. <br><br>I'm not sure what the fuss is all about, I won't go there again. <br>I think people go and get influenced by how old this place is, but I don't care how old this place is, the good was mediocre at best.", "pics": null}}, {"review": {"des": "This is a pretty good place to get a bite. <br>Food is pretty good and cheap too, not to mention the fact that just about everything comes with free fries!<br><br> Favorite thing I've gotten here is the Polish, it's juicy and comes loaded with onions that were grilled and caramelized  to perfection. <br><br>Burgers are very good and not too greasy, hotdogs are good as well but even though it's a hotdog stand, not my first choice. <br><br>As far as lines and speed of service goes, you have to be mindful of when you go. Lunch time is pretty packed most of the time. If you wait about 30 mins or so after the \"typical\" lunch time, you should be in n out pretty quick . <br><br>Parking is the biggest issue, street parking only and lots of people double parking makes it a bit of a hassle. <br><br>Other than that, this place is awesome for a quick bite.", "pics": null}}, {"review": {"des": "Famous polish hot dogs in Chicago. It takes only one minute to get a hot dog. The green pepper with it is delicious. The fish burger is also a good choice.", "pics": null}}, {"review": {"des": "Yes I know it's open 24/7 and is dirt cheap and I shouldn't expect anything other than what I get and I should rate 5 stars and shut up. <br><br>But no. There's many other places in the city open late into the early morning, that cost less and are tastier and not poison for you. Trust me.<br><br>Also poison is harsh. I've probably been to Jim's 40+ times. My pick is the fish sandwich.<br><br>*FOR NOOBS*<br><br>It's located on the south of the UIC dorm called JST. The entrance is on Union St which can be accessed from Roosevelt Blvd. you can park on the left of the street and you'll have your food in about 5 mins. They take all major credit cards and fries are free with all sandwiches. Get the grilled onions on your sandwich!", "pics": null}}, {"review": {"des": "It is what it is. When you're searching to recreate a memory, the awesome scent of the grease, onions and pork chops/Polish will bring you to a different time in your life. A time when you would laugh at finding yourself at Maxwell and Halsted, watching all of the action on the street at 2 a.m. Will always cherish those memories of working night shift at Rush and running out for a \"Jew-town!\"", "pics": null}}, {"review": {"des": "Classic Chicago polish and pork chop sandwich! I've had way too many polishes and pork chop sandwiches in my life, and this place is on point. Even the fries hit the spot.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/mMXD1abyq3NG_d-EYQDCug/348s.jpg", "caption": "Polish and fries."}]}}, {"review": {"des": "Get the fish with extra onions. Also, all sandwiches come with fries. Make sure you get yourself a side of the hot peppers to cut the greasiness of the sandwich.<br><br>I think this is my favorite food establishment in Chicago", "pics": null}}, {"review": {"des": "Best polish hit dogs ever.  Finally able to bookmark this place.  Their beef dogs are good too but get the polish.", "pics": null}}, {"review": {"des": "WOooooooooo finally got to hit up Jim's. I've heard so many good things about Jim's and it definitely did not disappoint. A place open 24/7, cheap meats, awesome fries, what else can you ask for?<br><br>You pay 5-10 bucks for pretty much a full meal, I got to try the Fish, Polish Sausage, and the Pork chop, with their fries. All were extremely flavorful and worth every dollar you pay. <br><br>Can't go wrong, if you are ever in the area, need a quick bite, go to Jim's. Dont be expecting any 5 star restaurant food / presentation, but this place is definitely one of the best bang for the buck in terms of price vs portion vs taste", "pics": null}}, {"review": {"des": "Open 24/7? Yes please! Such a great spot for a late night snacm. Service is super fast. Order and your food is ready in less than 5 minutes.<br><br>We got the polish w/ fries and filet of fish w/ fries. Both are amazing. Fries are also very delicious.", "pics": null}}, {"review": {"des": "This is the real deal folks! Jim's is located next to the I-90 and UIC.. and in a sketchy neighborhood for my standards. Nevertheless, they are known for their polish dogs / pork chops, as recommended by resident Chicago food critique Steve Dolinsky!<br><br>The original polish was grilled for a nice snap with a juicy interior, saddled onto a fluffy generic bun and topped with sweet grilled onions and mustard. What's not to like? It's done very well, so it gets my recommendation for quick, cheap eats in the South Loop!<br><br>It's funny that there seems to be a discrepancy with Jim's and another store. From what I understand, Jim's is the original, and an imitator set up shop exactly one block south.. with the same lighting, colors, and menu! Just so people understand, this is the one located north. If you went to the other place and was disappointed, you probably went to the wrong one :)", "pics": null}}, {"review": {"des": "My friend and i had dinner only a few hours before but wanted to check this joint out because it was recommended by another friend... whew. even though we weren't very hungry, as soon as we bought the food and got into the car............. the smell of the hotdog and fries KILLED US.<br>SO GOOD. <br><br>We got the polish w/ fries. and WOW. maybe it's because i've never had a polish hotdog from chicago before, but that was one of the best hotdogs i've had. <br>Fries were great too but not too special. <br><br>anyways. stop wasting time reading this review and go over and get yourself a polish.", "pics": null}}, {"review": {"des": "A Chicago institution.......<br><br>This place is sure as hell not fancy but in this case who cares? We have been enjoying these incredible polishes for decades here in Chicago and the fact that it's open 24 hours is a life saver on those nights that I need a blue collar fix,<br><br>Here is a tip: order two polishes with all the traditional works and eat them  as you would but then I advise you to get some peanut butter ice cream from anywhere........for some reason this combination just works! Trust me you will never look at these polishes the same again!<br><br>I just wish they hired only Americans....<br><br>James......", "pics": null}}, {"review": {"des": "Childhood favorite for a \"Jewtown\" polish. I will NOT patronize any other knock off Maxwell polish stand! It's this Jim's or NOTHING! I love the Polish with extra onions, mustard, and hot peppers w/a seven up. I also love the bone in porkchop with their infamous onions and peppers. This was actually my 1st restaurant of 2016  to get food from at 4am after I got off work 1/1/16. Not much more to say than if you haven't tried this you're not living!", "pics": null}}, {"review": {"des": "If you want an original Chicago hot dog experience, this is your spot. Locals will all agree that Jims is your go to for that perfect greasy hot dog. Ordering from a window is as real as it gets. This was a perfect last minute quick stop for my friends touring Chicago and wanting the true food experience. Sensitive stomachers beware though, it's as greasy as the place looks. All combos come with fries also!", "pics": null}}, {"review": {"des": "Not sure if I was really hungry or if Jim's is just that great! My friend brought me after my flight landed at 1am. It was so freaking cold and we were just standing outside eating our polish dogs!<br><br>The polish dogs are good, especially since they add carmelized onions. I don't normally like mustard, but I didn't mind having them in this. The polish dog also comes with a side of fries that are piping hot! They are so fresh and yummy. Especially when it's so cold outside!<br><br>The best part is that the polish dog is $4 and Jim's is opened 24/7! Very satisfying and inexpensive for a late night meal.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/XOgyU7R4XdwOHeETkEkt6Q/348s.jpg", "caption": "Polish dog"}]}}, {"review": {"des": "Been here before, but nothing like it use to be. <br>Wasn't impressed anymore. Won't be back. Sorry Jim", "pics": null}}, {"review": {"des": "For a late night joint, Jim's is awesome. They are open 24/7! It's a fun place to go with friends when you need a late night snack. Parking is a little hard, and a lot of people park illegally, but I personally wouldn't risk it. Just drive a little further down the street and there are usually spots open. Even though the lines are very long, they move very quickly because the workers are so fast and efficient! You order at one window and they assemble the food in front of you, and then you pay at the next window. <br><br>We really enjoyed the 100% beef polish and the fish sandwich. They both come with grilled onions! The construction of the fish sandwich was kind of sloppy but it's easy to fix yourself. All sandwiches come with fries, which were actually my favorite part of the meal! They are so crispy and delicious. We ate at the standing counter and enjoyed our meal before driving off.<br><br>Definitely a must-try if it is late, you are hungry, and want to enjoy some yummy polishes and fries with friends!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/SQeBangMgddIJ0O6nkqb_Q/348s.jpg", "caption": "(Sloppy) fish sandwich"}]}}, {"review": {"des": "I've heard it said by many, that Jim's serves the Original Maxwell Street dogs. So, of course it was on my list of \"must eat\" on my trip to Chicago. Now, I have something to compare it to the places here in California that claim to serve authentic Chicago style hot dogs. <br><br>First, from what I could tell, parking can be a pain. Learned that the no parking sign, or the limited time parking is just there for show. Cars were parking and parked there for what seemed like forever and the Chicago PD just drove by. My group's car was among those in the timed parking. <br><br>Second, there are multiple building so just know that they're all the same. Just get in line behind someone and wait your turn. Order, pay and take your order away. No calling names or numbers. Take it and eat there - but just know there's no seating or tables. Or do what my friends and I did - drove to a Chicago landmark (Fields Museum) and ate  our meals there. <br><br>Had a Polish Sausage and a Pork Chop Sandwich. Sausage was okay, but the Pork Chop Sandwich was killer! The Pork Chop was tender, juicy and went surprising well on a bun with the grilled condiments. I wish I had ordered two of them instead of the Polish Sausage but at least now I know better for the next time. <br><br>Nothing wrong with the Polish Sausage but it just seemed to lack the \"BAM\" factor for me. it was tasty and went well with the onions and mustard; and the bun was nice and soft. Just didn't knock my socks off like the Pork Chop Sandwich did. <br><br>Overall, five stars for the Pork Chop Sandwich alone. Knocked it down for what I actually went there to try; the Polish Sausage.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/z44DHooK8etzwdrHeQS2BQ/348s.jpg", "caption": "Polish Sausage"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/TfYz_r74wQ108j6TYCpBPQ/168s.jpg", "caption": "Pork Chop Sandwich"}]}}, {"review": {"des": "Yessssah!!! This polish hot dog was the bomb! Ok let me say first off that I am NOT a huge fan of mustard. So when I heard this dog would be dressed with mustard, I almost said forget it. Then I was told that it has grilled onions (love 'em) & hot peppers. Annnnd they sold grape soda (a childhood favorite).  Helloooo nostalgia! <br><br>First (second, third...) bite = fantastic!!  I love that this dog has s rich flavor but not the weird flavor that gives the diner heart burn. Not even with the mustard, onions & peppers. Now that's a feat!<br><br>The staff was fun & encouraging. They need was traveling and do joked about getting the works. That's what I got. Their best polish dog. Definitely worth the trip. <br><br>Speaking of trip. Know that to get to this place you've gotta go to the end of Maxwell St, (pass the Indian, Japanese & breakfast restaurants, check out the signs & sculptures about the history of this street) go under the brick awning that says maxwell st. & turn left on union. NOTE:  there are TWO hot dog places about 6 steps away from each other. Be sure you go to Jim's. THAT's the one THIS<br>Review is based on. Enjoy!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/VB1nP1aZqW83nywu5IprZw/348s.jpg", "caption": "$5.50 gets you all this!"}]}}, {"review": {"des": "Was in the area and my friend was hungry and craved a burger so we stopped by this place to get 2 hamburgers and a polish hotdog. <br><br>The hamburgers were not the best, we basically just got a bunch of mustard, on a patty and bun. There was no flavor but the mustard. My friend didn't even want to finish hers but I did since I don't like to waste food. <br><br>The polish hotdog was better and the friend were also very good. <br><br>I don't think we will come back, I'd prefer to go to Wendy's since it seems their junior bacon cheeseburger is the same price and has more toppings and flavor. <br><br>The staff was very friendly and so I will give them 3 stars.", "pics": null}}, {"review": {"des": "worse food poisoning ever from the burger<br>threw up like 10x<br>all i could taste or smell in grease", "pics": null}}, {"review": {"des": "Awesome hole in the wall. I ordered the Polish dog all the way and it was delicious. Took a bite in the Polish dog and juices just bursted.. fries were crispy and hot and fresh.. a must go when I come back and visit.", "pics": null}}, {"review": {"des": "This is the spot for late drunk food!! Never fails that after leaving Lalos I stop here for a polish or a burger! Food is always on point and the service is really fast!! You're barely ordering when they are already packing up your food.. it's insane! I always ask for the hot peppers since they are really good and truly have a kick!<br><br>The area is a little shady but just eat in your car or take the food to go. Just typing up this review got me hungry!! Lol", "pics": null}}]}