{"name": "joes-seafood-prime-steak-and-stone-crab-chicago", "reviews": [{"review": {"des": "Definitely a repeat customer over at least the last 5 years! <br>Service is always top-notch here; as presented through reputation!<br>Experience exceeds any expectation!<br>Looking forward to going back!", "pics": null}}, {"review": {"des": "My family and I are regulars at Joe's. I am very disappointed in the quality of our food tonight. Five of our steaks were charred a ton on the outside. The char taste is a taste that is hard to get rid of. <br><br>Service was exceptional as usual- only plus. <br><br>$60+ steaks should not be charred.", "pics": null}}, {"review": {"des": "As out of towners, My friend and I really wanted to try a steak restaurant that is unique to Chicago. We only had a short window amount of time and decided to drop by without a reservation.<br><br>The venue was beautiful and we were seated almost immediately thanks to Tito, who kindly pointed to the group that was leaving. <br><br>Andrea was very friendly and patient when she took our order. The steak was a very good quality beef and the crab stuffed shrimp was exceptional. <br><br>All in all, I recommend this place and the crab stuffed shrimp!", "pics": null}}, {"review": {"des": "Come for happy hour! Couple good food specials, especially their oysters! 6 for $6 and you can have it mixed. Really fresh and good. Happy hour drinks are limited but with beer, wine, sangria, and Moscow mule, it's enough. <br><br>We came here for the stone crab which isn't on the happy hour unfortunately but worth a try. Expensive but really delicious", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/SFgMFR9wE3aG27OTwaDfKA/348s.jpg", "caption": "Oysters $6 for all that during happy hour"}]}}, {"review": {"des": "Joe's is by far my favorite restaurant in Chicago! Make a reservation here ... IN ADVANCED!! They are always booked up and sometimes even up to weeks in advance. <br><br>The atmosphere is very charming! The service is great. All of the staff is incredibly knowledgeable and friendly. If you don't know what to order, they have many suggestions! <br><br>If you've never had stone crab, that is a must. They are delicious and always a fun experience. Joe's has great steaks and seafood. I cannot say I have had something I've been disappointed in. <br><br>If you still hungry for desert, the pies are homemade and highly suggested!!", "pics": null}}, {"review": {"des": "This is a \"Premier\" restaurant in Chicago. The food is excellent, the service is fantastic and our server Tim was top shelf! <br><br>We were here for lunch and there were some great lunch items that were reasonably priced considering the level of excellence at this restaurant. There is a large range of options on the menu to suit anyone's taste. The deserts we amazing... you must try the HAVANA DREAM PIE for desert. The name speaks for itself. You cannot go wrong with anything on their menu.<br><br>The only thing wrong with this place is that it is hard to get a reservation, but I can clearly see why... Plan far in advance or come in for lunch on the weekends.<br><br>We will DEFINITELY be back! Thanks Tim!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/RQViOX9AWhTt9-FjZh8dsA/348s.jpg", "caption": "Domaine Serene Pinot Noir"}]}}, {"review": {"des": "Dropped in for an early-ish dinner one day, but we did not sit inside the dining room.  We sat at one of the many high top tables in the bar area.  The bar area has a lot of windows and was bright.  Our server was really nice, but was slightly overwhelmed by the number of people eating at the bar.  <br><br>We hit up the bar menu and got a seafood trio (it's just one shrimp, a crab claw and an oyster) for $7, then supplemented that with a shrimp cocktail and a few stone crab claws, a crab bisque and a BLT wedge.  It was quite a bit of food and was all very good.  You can keep the cost down if you stick to the happy hour menu but we deviated which push the prices up.  For a seafood fix, this place is worth it.", "pics": null}}, {"review": {"des": "What's not to like bout this place. Great starters great steaks and great seafood and great deserts. Well I have one issue: the wine list as extensive as it is is way too overpriced. There just weren't enough good selections for wines under $100 bucks. Heck I'm not payin $250 for an American Cabernet, well not unless I'm on an expense account that is. <br>My New York was delicious, tender, juicy, beefy, perfectly cooked but just didn't have that needed char to push it off the edge. My dining companions had a bone in ribeye and that was delicious as well but again not enough char. Also ordered at our table was the bone in filet. Our friends loved it. I'm not a filet guy but it looked good though. <br>Deserts were  a good finish: key lime, coconut crepe pie were standouts. The peppermint ice cream with hot fudge was delicious too. Yeah I'd come back for sure!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/mluehTBSPbAoayovDm8aaA/348s.jpg", "caption": "Chocolate Brownie Pie"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Rke9Pw1r-Z2FywPwVUfVlA/168s.jpg", "caption": "Key lime pie"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/U2pxFZybhwtEEIzUdYtftA/168s.jpg", "caption": "Coconut Cream Pie"}]}}, {"review": {"des": "Stone crab!!!!love love love this place expensive but good food crab is amazing and steaks are also fantastic. Prepare to spend a lot but it will be a great meal", "pics": null}}, {"review": {"des": "Great restaurant downtown.   Fun place, very busy but very warm and good feeling place.  Excellent service, excellent food excellent place.  You cant order anything bad here.", "pics": null}}, {"review": {"des": "Went here for dinner, 9pm on a Sunday. The place was full at the time. They had plenty of good seafood choices. <br><br>We started with the mushrooms stuffed with spinach as an appetizer. They were delicious given they were covered with cheese. For main dishes we went with the grouper and the Alaskan crab legs (1lb). And got broccoli as a side. The grouper was a bit tasteless. The crab legs were good. Overall they were light and would recommend ordering a side with carbs, maybe potatoes.<br><br>For dessert we went with golden brick sundae and the peanut butter pie. Both were good. The sundae reminded me of magnum ice cream. <br><br>Overall a decent restaurant for dinner.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/F9IO034AVQS8a-1-8Ghz5A/348s.jpg", "caption": "Peanut butter pie"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/FggA-5aMTu52XOPlThuQjw/168s.jpg", "caption": "Golden brick sundae"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/EXlJjFcfe4nKOF9N1Ee3Ig/168s.jpg", "caption": "Sauteed Broccolini"}]}}, {"review": {"des": "One of the best dining experiences I've ever had. I had lunch here with some family members over the weekend and from start to finish it was one of the best meals I've ever had. Our waiter, Tim, was incredibly friendly, funny, and obviously very knowledgeable and passionate. He really sold the John Dory special I ended up getting and every bite was as astounding as he conveyed when we ordered. The Old Fashioned was the best I've ever had so kudos to the bartender as well. The stone crab was very fresh and the desserts were both generously portioned and delicious. I wish I could eat here more frequently. The service was excellent (I can't commend Tim enough), the food was delightful, and the atmosphere was classy and enjoyable.", "pics": null}}, {"review": {"des": "This place was great! Great service and food. Make a reservation in advance because they are really busy. They have a lounge and bar area that is first come first serve seating for those without a reservation.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ZZ3ahnZU_UNxSc2ozU43mg/168s.jpg", "caption": "Spinach stuffed mushrooms"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/VvGFeZsmXjaGa0CtJKniMA/168s.jpg", "caption": "Crab stuffed shrimp"}]}}, {"review": {"des": "Joe's is my favorite, all-around restaurant. I have been in love with them for 15 years and the service, food, quality and drinks NEVER dissappoint.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/IC1OUxAvUnF243gV5KP4qw/348s.jpg", "caption": "24 oz Dry Aged Ribeye"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/cDKCloQkAvGTxwj-ZsOB_Q/168s.jpg", "caption": "24 oz Dry Aged Ribeye"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/G0Ug8xNcyCUB8lN2uDBZYg/168s.jpg", "caption": "Grilled Halibut with Charred Lemon Vinaigrette and Peas"}]}}, {"review": {"des": "Update: so I've come here two more times (family and friends wanted to give it a go) and I've had meh experiences both times. The seafood has been lukewarm (temperature-wise) and over cooked. The Brussels sprouts were horrible in my opinion, so stay clear of those. The prices aren't bad though and the service is always wonderful! I would t come back. With so many seafood and steak places in the city, why settle?<br><br>Old review: <br>As a Florida girl, I have to say this place is pretty good! Reservations are SO hard to come by but the bar area is really large so I feel like it wouldn't be that hard to just drop by and grab a seat there. <br><br>Ambience: formal, but pretty packed, making it not very intimate. Wasn't my f<br><br>Prices: the seafood dishes are pretty good prices. The steaks on the other hand are pricey (not any more so than the other fancy steam places in the city). The people next to us got steaks and they looked really good (and they seemed to enjoy them) but it still just doesn't seem worth it. The desserts seem reasonably priced given the portions. <br><br>Drinks: YUM! Granted, they are also pricey, but I have the sangria and it was one of the best drinks I've ever had. HIGHLY RECOMMEND. Almost all the people around me got one. <br><br>Food: I'd say 4/5. I got the grilled seafood platter (shrimp, scallops, lobster). The shrimp were a bit over cooked and the lobster were a bit undercooked. The scallops were just right! The Mac and cheese side was super tasty but the seasonal cauliflower side was bland. My husband got a seafood pasta dish and he said it was good but he regretted not getting what I got. The waiter gave us a free half slice of meh lime pie and it was ALMOST as good as the key lime pies homemade in South Florida. Serious nostalgia. <br><br>Service: excellent! Our waiter was super accommodating and he gave us free dessert. He let me taste the sangria before I ordered it which was also awesome!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/SlZ-lef41rX7OiiA5uH_xw/348s.jpg", "caption": "Seafood Pasta"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/zRF5mPIDcUgiW30-AneISQ/168s.jpg", "caption": "Macaroni and cheese"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ljQJNX-BXn9RozxVQYLQhw/168s.jpg", "caption": "Cauliflower"}]}}, {"review": {"des": "Our go to restaurant in Chicago. We've had our best meals here every visit for years. If you're an oyster lover, you must have their preparation which includes a cup of shaved ice meniour so your oyster is truly ice cold with a touch of tang and pepper. Another favorite is the seafood salad, and ask for both the creamy Italian and Louis dressings so you can compare which you like best with the large pieces of lobster,  crab, and shrimp.<br>My favorite entree continues to be the miso glazed Chilean sea bass. I've had this dish at many different restaurants across the country, and the Joe's prep is still #1. You also can't miss with the soups either. You'll order a cup but wish you'd ordered a bowl. <br>It's hard to save room for dessert, but if you can share the banana cream pie with foster sauce. The first time I had this I couldn't believe noone had thought of this before. So creamy and luscious with the brown sugar sauce and pecans for a bit of texture.<br>I hate to write such a rave review because this place can already be hard to get into.  I guess I'll have to make sure I've got reservations for all my upcoming trips to Chitown.", "pics": null}}, {"review": {"des": "Food is pretty good, but the service is really inconsistent.  I stayed a couple blocks away so in the last week I ordered from Joe's about 5 times.  First time, I ate lunch there and the service was great, the food was pretty good also. I love their key lime pie, so light yet so creamy.  It was probably one of the best key lime pies I've ever had.  Subsequently, I utilized their carry-out service and things were just all over the place.<br>Occasion 1: I asked for medium cooked steak and got medium-rare, I asked for extra bread and got none (although the ladies working the carry-out counter were super nice and got me the replacement no problem).  Occasion 2: Got a salad and a manhattan clam chowder and it was probably the worse MCC I've ever had from a restaurant.  I was watered down and basically tasted like water and tomatoes with a few bits of fatty bacon floating on top.  I don't think I tasted ANY clam.  I was very disappointed.  Occasion 3: I decided to order what they are known for.  Stone crab claws.  And the meat was sweet and claws were easy to eat since they come precracked.  Occasion 4: Finally I ended with a porterhouse steak which was cooked medium (correctly this time).  So they definitely serve some good food, and when you're there the service is great, but otherwise it was a bit inconsistent and for the $$$ they charge I expect them to get things right every time.  I would not recommend their carry-out.  And if you plan on dining in, definitely get a reservation and try their key lime pie.", "pics": null}}, {"review": {"des": "Joes seafood, prime steak absolutely sucks in every aspect. The host is Pompous snob, I forgot his name but it's a tall man. The waitress was laidback and not concerned about serving my girlfriend and I. Their menu is outdated. It's Smelled like a fish market", "pics": null}}, {"review": {"des": "Definitely one of my new favorite special occasion restaurants! Came for restaurant week and had an amazing experience. The food was amazing. I had the restaurant week option with stone crab claws that came with creamed spinach and hashed Browns and my husband had the ahi tuna filet mignon off the regular menu! Everything was delicious. We didn't try the steaks, but they looked really good at the table next to us. <br><br>The service was top notch, which made the experience even better. Our server made great food suggestions, and even threw in a free slice of key lime pie for my husband since my restaurant week meal came with banana creme pie and his didn't coming off the regular menu. In his words: \"I can't let you leave without trying our key lime pie\". <br><br>This is a place I would make reservations for since they seem pretty busy, but there is a really big bar area out front with the full menu. I can't wait to come back and try some of the options off the regular menu!", "pics": null}}, {"review": {"des": "I came here with my boyfriend one evening. The food was pretty good!! It is definitely at the top of my list. The service was great ! From the stuffed mushrooms to the refreshing beers and the amazing steak and seafood platter and henny shots to the yummy desserts.. I just don't know where and how to start to talk about how good it all was ! I totally recommend to anyone who is looking for a good steakhouse/seafood spot all in one. The experience was just so darn good and I'm definitely coming back when I'm back in Chicago !", "pics": null}}, {"review": {"des": "This place is amazing. Everyone is so pleasant. The pre-cracked crab legs and filet are the best I've had! Asparagus was our side and was shaved on the bottom pieces, perfect. Happy hour menu at the bar is a terrific deal and has great quick bite options", "pics": null}}, {"review": {"des": "First time at Joe's. Our server, Kelly, was an absolute joy. She was attentive, engaged the kids (5,7) and kept us focused as we were exhausted and has no idea what to order. <br><br>Service -  love it! Kelly was amazing! <br><br>Food - oysters were ok. Nothing to write home about. The boneless ribeye was delicious!! Yum! <br>Their pumpkin pie was amazing :)", "pics": null}}, {"review": {"des": "Best seafood in the city! This is my go to spot whether it a casual or fancy dinning scenario. The bar area is very casual and first come, first serve so you can usually get a table pretty easily. For a nicer occasion I would recommend making a reservation in the dinning room area. <br><br>Joes makes a fabulous martini of all varieties. You can't go wrong with anything on the menu but a few of my favorites are the oysters Rockefeller, scallops, stone crab, fried chicken, and Brussels sprouts. Save room for a piece of their delicious pie at the end! <br><br>Thanks Joes for the wonderful food and service over the years.", "pics": null}}, {"review": {"des": "First time I was here (for my anniversary), I was so blown away with how good everything was that I came back for my birthday dinner! I would recommend getting a reservation ahead of time since this place gets pretty packed for dinner time.<br><br>To start, we ordered the crab cake appetizer, the shrimp cocktail, and the oysters. We opted to get a mixed selection, getting 4 of each type (dozen total). The oysters come with lemons, cocktail sauce, champagne mignonette, and a tiny little Tabasco bottle. I recommend using the mignonette, it makes the oysters taste less briny. The shrimp cocktail was okay, you get about 4 jumbo shrimp and cocktail sauce but like all cocktail shrimp..it's just cocktail shrimp. The crab cake is amazing!! I would eat it by itself as a meal! <br><br>For our entrees, we ordered the king crab legs and the bone-in rib eye (not dry aged) and the fried green tomatoes as a side. I will be honest, I've never had fried green tomatoes before and I thought these were pretty good! They were bigger than I expected but they were nicely fried and not too heavy. <br><br>We've previously had the stone crab here but we decided we liked the king crab legs better (plus they were running out of some sizes by the time we were there) we ordered the 1lb of the legs and it comes chilled with butter on the side. They are SO GOOD and meaty, you can't really go wrong with the crab legs <br><br>Lastly...the steak. I have dreams about this steak because of how good it was!! I would come here all the time to eat the rib eye steak if I had the money! It comes with a salt seasoning mix to sprinkle on top but you honestly don't need it because it's so well seasoned and amazing the way it is. I wanted to gnaw on the bone just to keep the flavor in my mouth hahaha<br><br>They also gave us a complimentary dessert (flourless chocolate cake) for my birthday! Which was very nice of them and really great end to the dinner! Overall, extremely pleasant experience and would recommend 100%!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/lvQ2hKKgKpJ8yyrdtCy-tQ/348s.jpg", "caption": "Flourless chocolate cake as a complimentary birthday dessert :)"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/eZt1NitwbvFNI0Uhb3N8tw/168s.jpg", "caption": "Jumbo Alaskan King Crab Legs (1 lb), Bone-In Rib Eye  24 Oz., Fried Green Tomatoes"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/p34-XvmYyFCJmjzj9RgRuA/168s.jpg", "caption": "Oysters on the Half Shell(mixed dozen), Colossal Lump Crab Cake (appetizer), Jumbo Shrimp Cocktail (missing 2 of the shrimps!)"}]}}, {"review": {"des": "Went there for a function so were seated in a private room.  The service was excellent and attentive but not overbearing. <br><br>Menu included salads to start with shared platters.  The shrimp were firm and juicy with a choice of dips.  The crab claws were a hit.  Tasty in their own sweet way, accentuated by the accompanying sauces.  The ceviche was subtle but had a nice zest to it.  Really enjoyed that.  What a terrific thing to experience the gifts of the sea.  <br><br>My entree was the salmon.  Cooked perfectly with accompanying greens.  The salmon was ultra fresh and juicy.  I asked for the chef to decide on cooked level and it was the right call.  <br><br>I highly recommend this place.", "pics": null}}, {"review": {"des": "Delightful! We celebrated our first Anniversary here this past Saturday... We were treated with \"The Whale\" as an appetizer, it was wonderful, the seafood was sweet and fresh, paired with Prosecco. I had the filet \"oscar style\" which came with plenty of crab meat and my husband had a 60day dry aged bone in rib eye, the crust on the meat was delicious! We shared a bottle of red with dinner and we were again treated to a brownie sundae and a piece of key lime pie for dessert! Service and food were impeccable.", "pics": null}}, {"review": {"des": "My spouse and I are making this restaurant one of our regular spots whenever we are in the River North area of Chicago.<br><br>The stand-out, best deal is the lunch. Two people can get stuffed (a dozen oysters, two entrees like filet beef or Alaskan crab, two veggies, two desserts, lots of bread, water and coffee) for $125 including tax and before tip. <br><br>Liz A. is a superstar server.", "pics": null}}, {"review": {"des": "Went to Joe's for a business meeting and had a nice meal.  The highlight was the service - superb!  <br><br>The menu is what you would expect, and sides are family style.  We started with crab claws, calamari,  and tuna tartare - the claw was good but really nothing special, calamari was as expected.  The tartare was good and I wished I had ordered it for my main course.  Unfortunately I ordered the special - sockeye salmon - and it was just ok.  It's a seafood restaurant- how do you screw up salmon????  The waiter talked about how amazing the salmon was and when it arrived it was over cooked!  The sides were typical.<br><br>The meal was nice - it just wasn't special.", "pics": null}}, {"review": {"des": "Loved this place: I made our reservation for my birthday, the place was packed, but very friendly service staff- the food was excellent, we ordered 24 oz dry aged ribeye, chopped ribeye, Jeanne mashed potatoes, baked potatoes & creamed spinach.  The dry aged ribeye steak was a little pricey ($90.00) but it was so worth it!!! The waiter made out night a memorable experience- he was very attentive &, very accommodating!!! Thank you... best experience in Chicago!!!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/rh5LpBnHojWfsbU1RKg9sA/168s.jpg", "caption": "The ambiance was wonderful, food was excellent- a little pricey for the 24 oz dry aged ribeye steak but it was so worth it."}]}}, {"review": {"des": "Place is beautiful inside. The waiter was friendly. The food was cooked perfect. Atmosphere is good along with the drinks.", "pics": null}}, {"review": {"des": "My husband and I split a bone in ribeye. It was delicious. We also chose the brussels sprouts and macaroni and cheese sides which were also delicious. I mostly appreciate that none of the employees raised an eyebrow or scoffed at us that we brought our three-year-old and eight month old children.  It was nice to be able to share a delicious meal and not have to go to the typical children's type restaurant.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/GZBnJtMFkVXGQv7APhv7UQ/348s.jpg", "caption": "Delicious crab bisque."}]}}, {"review": {"des": "All I can say is fabulous! Impeccable service and great food! Had the Stone Crab Claws for starters...so good! Then, the Petit Filet...cooked medium to perfection! Pair that with roasted cauliflower in a brown sage butter? Mmm STUPID good! And last (but certainly not least) we had the Old-Fashioned Apple Pie with Vanilla Ice Cream! That knocked this dinner out of the park! <br>When you go, ask for Colleen! She's the best! Thanks Colleen for the on-point recommendations!", "pics": null}}, {"review": {"des": "First time trying stone crab and I am hooked. There is really nothing like it and the claws here have so much meat. At the advice of the waiter, we got the Select size (6) claws to share between 2 people, which was perfect. Would come back just for these guys alone. The 30oz porterhouse was also great for sharing; the tenderloin was amazing. <br><br>Nice ambiance inside. It's hard to get a table at times but the bar/hightop seating is free for all. We came on a holiday at dinner time and there were plenty of open tables - we'll probably do that next time rather than wait for a reservation.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/faN1bNeLmU8vMPdhcUMb_A/348s.jpg", "caption": "Stone crab"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/oud0xbZ0hjT0TA22k35Hxg/168s.jpg", "caption": "Manhattan Clam Chowder"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/HqPt5k9i0oqB1Ps8iDjZCg/168s.jpg", "caption": "Porterhouse"}]}}, {"review": {"des": "This place is every bit as good as advertised. MAKE A RESERVATION. It is the only way you can get to eat at this very busy place.  From the host to the servers to management everyone is professional and treat you like your royalty. The food?  FANTASTIC!  The crab claws and crab legs are sweet, they crack them for you so it's easy to eat.<br><br>We had steak, fish and seafood at our table; all was great. Can't go wrong here.", "pics": null}}, {"review": {"des": "My mom was in town and wanted a good steak. There are (of course) lots of options, but I was looking for somewhere that I knew would come through so we ended up at Joe's.<br><br>I know what I like at Joe's, and we pretty much stuck to that plan. We started with the stuffed mushrooms, which were just a little too salty this time around though we ate them anyway!<br><br>I had the petite filet and mama had the NY strip; they were both very good. We also shared jennies potatoes, which again, were good. We somehow made room to share the apple pie. It was a generous portion of pie but only a small scoop of ice cream...that's a surprising thing to scrimp on. <br><br>But those are minor complaints. On the whole, I wanted to take my mom somewhere nice and this fit the bill.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/TQo8Jxa9DeG3PG5sLOKG8g/348s.jpg", "caption": "Apple pie a la mode"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/o2ApRNC6iFUfDov9wStL8A/168s.jpg", "caption": "Jennie's potatoes"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/0g_WodSx7EIM9AAYWcb5tw/168s.jpg", "caption": "Petite filet"}]}}, {"review": {"des": "I have written a review of Joe's in Las Vegas. I have also been to the original Joe's in Miami South Beach, but apparently the chain of locations outside the original location is different ownership. <br><br>Frankly, I like the chain better. I've been to the Las Vegas location in Caesars Palace many times, and always love it. 5 Stars. <br><br>Last night was my second trip to the Chicago location. It is just a good. Despite downtown Chicago being very quiet last night (10/31/17), Joe's was relatively busy, but not packed. I was by myself so had hoped to just get a spot at the bar, but every seat at the small bar was taken. There are seats at a counter along the exterior windows so I grabbed a seat there as there were several available. <br><br>Service was prompt. I ordered the Select size claws which is 6 claws in the pound. $49.99. If you are not familiar with stone crab, this price is fair. Same you would get at the original location in Miami. I have found a place here and there that does them for less like in Tampa, but it is few and far between you will find them for much less than $50 for a pound of decent sized claws. <br><br>As always they were cracked well, easy to eat, and with their awesome Joe's mustard sauce. If you like shellfish and have never had stone crab, you need to try them, and get them at Joe's to make sure you get an authentic experience. Also, make sure you get them between October 15th and May 15th. Outside of those dates the stone crab season is closed so you would be getting claws that had been frozen. Once frozen the meat gets stringy and very hard to pick clean off the claws. When fresh it is an amazing delicacy!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/7Rn1iYmabKZxYMDIbFcXMg/348s.jpg", "caption": "October is here. Stone crab claws are back in season and Joe's does it better than anyone!!!"}]}}, {"review": {"des": "I need another meal here. I decided to go with the safe option and chose a steak over seafood. I should have known better.  Steak was good, but I always try to have the house specialty..and now i have to come back to give better feedback. <br><br>For sides,  we went with fried asparagus and layonaise (sp?) potatoes. Sides were perfect,  especially the asparagus.  Really fresh and the crust was super crunchy.<br><br>Also ordered the seared scallops. They were made with a whole sunflower including some petals and a paste they rested on. Delicious <br><br>The reviews are so good here because the food is great, but the staff is outstanding. Really knowledgeable and friendly. They know a lot of local history and can help make other local suggestions if you're from out of town.", "pics": null}}, {"review": {"des": "If you want consistent deliciousness without it being stuffy and pretentious, this is the spot to go. We went here for our anniversary because you know, stone crab claws and enjoyed a really great meal. <br><br>Our waitress Emilie met us at our table with two complimentary glasses of champaign to help us kick off our anniversary. She gave us great recommendations, knew exactly when to check in with us but gave us space to enjoy our dinner. She was assisted by a man named Fluffy who was also awesome but we are unsure how he got that name. Anyway, we got excellent service.<br><br>We ordered additional drinks. I went with an old fashioned and my husband ordered a moscow mule. Drinks came off fast and the drinks were perfectly balanced. We kicked off dinner with some Kumamoto oyster and, of course, stone crab claws. Do yourself a favor...get these claws. They are beautiful, precracked and DELICIOUS! <br><br>I always laugh at myself when we come here because they have amazing seafood. They currently have a Halibut special that I was extremely tempted by BUT, I keep going back to steak. It is just so good here. I went with the Filet Oscar this particular evening and had zero regrets about it. Steak was cooked perfectly and I got to control how much how much bearnaise sauce I put on it (but let's be honest, all of the sauce ends up on the plate...so maybe that should just say the pace of the sauce). The crab and asparagus...again a delicious part of what makes filet oscar so amazing. My husband went with the strip steak and was extremely happy as well. We shared an order of fries. The fries came out piping hot and managed to get the salt to fry ratio perfect. We wrapped up this indulgence by sharing a slice of key lime pie. The meal and service we just excellent. If you are here in Chicago for a visit, make sure you make this place a part of your trip. You won't be sorry.<br>PRO-TIP: This restaurant is part of the LEYE group. Make sure you sign up for their loyalty points so you can redeem for free meals.", "pics": null}}, {"review": {"des": "Had a fantastic lunch at Joe's this past Saturday...<br><br>Service is top notch. Not sure I've ever experienced such friendly and helpful service before.<br><br>Ambiance is nice and the location is great. The restaurant was busy on a Saturday afternoon so definitely make a reservation.<br><br>Food is overall excellent. I recommend the King Crab Louis salad, which is delicious, even without the dressing (which I didn't eat). The baked sweet potato was also delicious, and my husband enjoyed his Mahi Mahi. The only thing I didn't enjoy was the bread basket, which was lacking in freshness and taste.<br><br>Overall Joe's was great and we'll definitely return if we're in the area.", "pics": null}}, {"review": {"des": "Food was amazing! Service was wonderful! We came here for a business dinner, and it was Father's Day, boy was it PACKED!! I've had raw oysters once before, and did not car for it at all, but decided to give it another shot-- I'm so glad I did! I probably could've have had at least 3 dozens!! Their corn was delish, and I usually don't care for anyone's corn except my moms! I ordered the bone in rib eye, the seasoning was just right, I do wish I would've ordered the filet instead. Their portions are pretty big, their side dishes serves about 3-4 people. Our waitress was wonderful and very knowledgeable, she kind lost me at one point though lol definitely a must for any special occasion!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/jp0DNdlyO9ZquQD5Xc7TJg/348s.jpg", "caption": "Nine in rib eye, medium rare"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Co0kMq40kaQeMYomPpJD6g/168s.jpg", "caption": "Oysters"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/kEfJIQ15w3y1wSH-L81dmA/168s.jpg", "caption": "I forgot the name of the wine but it was great"}]}}, {"review": {"des": "This place is one of the highest end places you can go to for steak and seafood. Very traditional looking inside which gives off aroma of luxury. Great feel. Great place. Great food. Went here after seeing the food on people's Instagram and had to try it out. Wasn't disappointed as I had high standards for this place. The waiters were very friendly and knew there stuff. Would recommend if you're in the Chicago area.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/evGWsSkEXYkszxgiS11BcA/348s.jpg", "caption": "Seared Sea Scallops"}]}}, {"review": {"des": "5!! 5!! 5!! 5!!  There is nothing much more to say.  If you're looking for a real TRADITIONAL,  classy, professional service, restaurant: LOOK NO MORE. <br>Our waitress,Denise,  was a true PROFESSIONAL: makes the visit so much more worth it than other places. <br>The wine list is outstanding, the food was perfect, the ambiance is from a time that is slowly being forgotten. This place isn't about stainless steel,glass, and modern fashion statements....this is about stodgy, woodsy, beefy, white tablecloth CLASS!!  <br>Easily my favorite restaurant in Chicago.", "pics": null}}, {"review": {"des": "A true classic!!!<br><br>This has been the restaurant of choice for many a celebration!<br><br>The Stone Crabs are wonderful and just the beginning.<br><br>The service is top notch so just ask fo whatever you need.<br><br>The pies are extremely rich and travel well.", "pics": null}}, {"review": {"des": "I had a delicious octopus appetizer and a taste of the famous stone crab. Its classy, friendly, and tasty.", "pics": null}}, {"review": {"des": "I had the baby mama screaming down my neck that I don't take her to nice places anymore!?!...I mean I took you to Joe's Crab Shack a few months ago and they even put an adult bib on you, wasn't that enough?...Women there's no pleasing them!?!<br><br>Now when I told her we were going to Joe's she thought this was probably some beat down American diner or some raggedy burger joint...it's far from that playas!  This restaurant is elegant and upscale, so I couldn't walk in here with my sweat pants on.  Reservations are a must as it gets crowded real quick even during lunch time.  Joe's is known for it's seafood, steak, and stone crab, we tried 2 out of the 3 (steak and seafood).  Here's some of the items we chowed down on:<br><br>Crab Salad - King Alaskan Crab highlighted this dish, so delish!<br><a href=\"https://www.yelp.com/user_local_photos?select=M8BtBculPmdSH0955J52Vg&userid=h4V9maImHWJfFVN7pktuFw\">yelp.com/user_local_phot…</a><br><br>Seafood Pasta - Yes so flavorful, all the seafood was really fresh to death.<br><a href=\"https://www.yelp.com/user_local_photos?select=oJq1NoVs7qGP0VtKUEI8Bw&userid=h4V9maImHWJfFVN7pktuFw\">yelp.com/user_local_phot…</a><br><br>Filet Minon - 6oz cut cooked to medium well perfection.<br><a href=\"https://www.yelp.com/user_local_photos?select=-9It_Y0PHBGr06tyC-czNA&userid=h4V9maImHWJfFVN7pktuFw\">yelp.com/user_local_phot…</a><br><br>We came here for our anniversary and what a memorable experience it was from the service to the food.  They even brought out a complementary dessert for our anniversary.  They also cater to kids as they provided us a high chair and a perfect room table to sit at.  So if you ever in downtown Chi-Town or walking along the Magnificent Mile, don't forget to swing by and peep this place out yo!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/M8BtBculPmdSH0955J52Vg/348s.jpg", "caption": "Alaskan Crab Salad"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/51ADZ2wzI_drIhTiAUxPiA/168s.jpg", "caption": "Patiently waiting for his food!?!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/1Z2RIGVRmuQ4AsQ9xa7ZqA/168s.jpg", "caption": "He was too busy checking out hot girls at the next table to help daddy blow out the candle!?!"}]}}, {"review": {"des": "My son and left Drumbar, and wanted to go to Rosebud. Stupid GPS kept giving us the incorrect directions. Soon we were more hungry and in need of a restroom. We walked by Joe's, and I said let's eat here. Normally you need a reservation, but the maitre'd was kind enough to send me us anyway, and I didn't even have to tip him first. We started with the crap bisque. It was good, creamy but not too creamy, and the crab flavor was abundant. We both ordered cocktails, I had an old fashion and my son had a Manhattan. They were both excellently crafted. For dinner he ordered the crab cakes and I ordered the seafood sampler. That came with 3 small lobster tails, grilled shrimp and scallops. Oh my. This was amazing. My son said the crab cakes were awesome. All crab, no filler. The service was impeccable, they were there when you needed, never intrusive and always happy to do whatever you need. The meal prices were better than I thought they would be. I have no complaints about anything.", "pics": null}}, {"review": {"des": "My husband and I waited several weeks for this reservation.  To keep this short and sweet I'll stick to point.. our waitress, Michelle, was very very knowledgeable about everything on the menu.  She was fantastic when it came to service..My food, Dover sole, baked sweet potato, sautéed spinach,. The presentation was awesome but my food was not hot.  The manager,Matt, after hearing of my problem, stepped right in and solved the problem with the quickness.  Again, thank you Matt.  I appreciated it.  However, it was my 44th wedding anniversary, I was hungry and was looking to forward to enjoying this meal that I'd waited so many weeks to get too.  In any case I won't venture back here.  My first impression of what I was served was not impressive.  I'll keep my sights and appetite for Eddie V's, directly across the street.  Same great service and food, just a tad less expensive.  Nothing personal.", "pics": null}}, {"review": {"des": "Best Filet Mignon my wife and I ever had. Melted like butter in our mouths! The king crab legs were legit and the stone crab claws with mustard sauce was awesome! Lobster bisque and the oyster rockerfeller for appetizers were also the shiz!", "pics": null}}, {"review": {"des": "This place is operated by the Lettuce Eats group, which operates more than 100 restaurants mostly in Chicago and some other major cities. I have been a Lettuce Eats member for the past year, where I can earn dollar credits for future application to my visits.<br><br>I was lucky to get a 7:30 dinner reservation for two here on a Monday, which I reserved on Friday. I was here for the first time in early February 2018 when it was snowing with about 1 inch of snow on the sidewalks already. I walked from my Warwick Allerton hotel. It was treacherous.<br><br>When I arrived the place was packed with patrons. I arrived a bit early. I felt lucky to be here in this cold snowy evening. I checked our coats. They were not ready to seat the 7:30 reservations. I enjoyed my $14 El Diablo special cocktail at the bar high top. See my special cocktail menu pic for further info. Isabel was effective to serve my one round of cocktails. <br><br>Promptly at 7:30 they started the 7:30 seating. I was impressed that this place is well run like clockwork. I was one of the first couples to be seated. All servers are dressed in formal attire. I enjoyed my seafood pasta, which was quite filling with my prosecco. <br><br>See my pics. Chas was also very knowledgeable and accommodating to our table needs. <br><br>Every year I receive a $15 birthday credit. I had received two birthday credits of $30, which I applied to my bill. My total bill was $152 less my $30 birthday credits so my final bill was $122 less gratuities. I also received triple points due to the triple point promotion. With my triple point award I was able to receive $30 additional reward dollars. I will definitely return here and other Lettuce Eats restaurants. More to come, when I have some more free time.  <br><br>I would definitely rate Joes as one of my top ten restaurants in Chicago. Check out my Windy City list.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/JGYIPi7-OSLFHZZJHPVK6g/348s.jpg", "caption": "My seafood pasta"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/iK0vfjqcjK8bKSek66bK1w/168s.jpg", "caption": "My prosecco"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/LNswrtqM11MRUepwmc8Nzw/168s.jpg", "caption": "My oysters"}]}}, {"review": {"des": "My boyfriend and I came here for the first time three days ago, to celebrate his birthday. We really enjoyed our meal and the service. There were just a few reasons why I didn't give Joe's a full 5 stars.<br> <br>First, I had made us a reservation 3 weeks previous and the day of I called soon after they opened and asked for a table in a nice location that wasn't in a high traffic area. They said they would make note and seat us in a booth. They didn't, we were at a regular table in a HIGH traffic area and staff and patrons were whizzing past my boyfriend the entire time. <br><br>Second, I know this is a personal preference, but we weren't blown away by the Stone Crab, we ordered some as an appetizer, bc they're known for it and didn't want to miss out. But they are not very sweet and served with mustard. I thought once dipped in the mustard, they tasted like a hardboiled egg. <br><br>Third, I wasn't a fan that all of their crab is served chilled! You can special request your King Crab to come out steamed and hot, but otherwise they don't. <br><br>Lastly, they forgot to bring our coffee out with our dessert. We politely asked them to take it off of our bill. <br><br>Otherwise, we were sat right at the time of our reservation and our waiter was phenomenal. The wine, oysters Rockefeller were great, along with my boyfriend's grilled seafood platter and my swordfish. We really liked the cheesy mashed potatoes and the steamed asparagus too. AND THE KEY LIME PIE IS TO DIE FOR!<br><br>Before the tip, pur bill came to be $234.00, as expected. It was totally worth the price and we'd definitely recommend Joe's.", "pics": null}}, {"review": {"des": "I've dined here twice now. Fantastic steak and seafood, impeccable service, great ambience both times. Everything about Joe's is five stars! I love the Crab Louie salad, the grilled seafood platter, and the Havana dream pie (I think that's what it's called). Their signature key lime pie is also yummy, and I don't typically like key lime pie. And of course, the steaks are cooked perfectly.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/sarK0e_VYseMb9RmqwriDA/168s.jpg", "caption": "Grilled seafood platter"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/W6B6Xvt7v9SLKB1A8DfTPA/168s.jpg", "caption": "Crab Louie salad and clam chowder"}]}}, {"review": {"des": "Amazing food! If in Chicago you definitely need to try this place!!! Husband had steak sandwich and loved it. I had petite filet and it was delicious!! Will come here again on next trip to Chicago!", "pics": null}}, {"review": {"des": "5 stars for the service from Bridget & Maggie. We had a work event with customers in one of the private dining rooms. Maggie had great wine recommendations. Bridget very on point with dinner recommendations. Their service was incredible. At the end of the night Bridget went above and beyond to with our team and customer guests ensuring everyone had an incredible experience at Joe's. Thank you ladies!", "pics": null}}, {"review": {"des": "I brought members of my team from work here to celebrate one of their recent promotions. This was the perfect atmosphere with terrific food and exceptional service from all members of the wait staff. This is definitely a nice place and most of the people here were dressed relatively well, but there were others, including our group, that were dressed more casually. Whatever the case, we were treated the same and everyone that came over to our table were extremely friendly and made us feel comfortable the entire time. <br><br>The food was equally as great as service. In terms of my meal, the chopped salad was delicious!! Perfectly dressed and very fresh. My Steak was cooked medium rare and the side of broccoli was crispy and delicious! <br><br>Ultimately, I would highly suggest this place for a celebratory occasion, date night or casual dinner. It serves all occasions and I will definitely go back again soon!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/zC227adZAINUVwF4xvJHSg/348s.jpg", "caption": "Bread basket"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Qx2gJf2ybuGy3saOymVQRg/168s.jpg", "caption": "Perfect medium rare NY New York Strip  16 Oz.*"}]}}, {"review": {"des": "Attended a company Holiday Party at this establishment a few years ago & have been a fan ever since. Surf and turf doesn't get much better than at Joe's. The stone crabs are a perfect accompaniment to any steak. My go-to is definitely the bone-in New York strip, perfect when ordered charred medium-well. And while seafood is the specialty, their fried chicken is probably the best secret in town.", "pics": null}}, {"review": {"des": "My wife and I have been doing our rounds at the Michelin starred restaurants and renown steakhouses in our area, Joe's Seafood and Steak was one of our favorites! Excellent service from start to finish, we ordered a variety of appetizers with the calamari being one of the more memorable dishes. I went with a prime rib cut which melted in my mouth upon contact. The brussel sprouts and potatoes complemented our meal well, with a signature key lime pie to conclude our culinary experience. One of the best steaks I've had in the Chicago area, looking forward to another visit in the near future!<br><br>Best,<br>Charlie", "pics": null}}, {"review": {"des": "Walked in and the tall hostess with the bald head did not give me eye contact at all and acted is if he was completely enamored with scrubbing the floor with water from a water bottle and cloth with his foot. I waited about 120 seconds and he continuously wiped that floor like he was rubbing a genie lamp and his wish was for me to disappear. I finally said hello and he then began his adaptation of Helen Keller. I will never frequent this establishment. I don't care how the food taste nothing can outweigh the lack of hospitality and respect this eatery lacks at the door. Canceled!", "pics": null}}, {"review": {"des": "A wonderful experience. Excellently organized, great recommendations by our hostess and memorable food. The rib eye IS all that, absolutely succulent from beginning to end. We started with some cold crab and there was an abundance of tasty meat throughout. We had great wine for both courses. Of course it is pricey though I will certainly like to head back there for a special occasion at some time in the future.", "pics": null}}, {"review": {"des": "Came to Joe's for a team dinner around 10pm on a Monday night and was able to get seated right after they set up the table. The ambiance is classy and \"old-fashioned\", and has a slightly formal atmosphere to it. We ordered THE WHALE as appetizers, individual entrees, and desserts.<br><br>The Whale (4/5): seafood was fresh, but some of the portions were not very meaty (ex. crab legs and lobster). <br>Stone crabs (4/5): this was great and fresh as well, but was not as \"amazing\" <br>Grilled seafood platter (4/5): I really wanted to like this, but the shrimp and lobster were grilled a little too much that it was a little dry/ not as tender. The scallops were great tho.<br><br>For dessert, we asked the server for the \"dessert version of the whale\" --which was basically 6 slices of the pies on the dessert menu. My favorite was the coconut cream pie--really delicious!<br><br>The cocktails were great and the service was very attentive.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Q1DIRPAELcbPfmIXCsyqzQ/168s.jpg", "caption": "Grilled seafood platter"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ZDfKhmEmmhE6uXjYEtWomA/168s.jpg", "caption": "THE WHALE + stone crab + oysters"}]}}, {"review": {"des": "We went to Joe's for our Anniversary - we left extremely happy. We checked in and were seated promptly. We booked on Open Table and checked the Anniversary category as the reason for dinner. Our server, Justin, was fabulous - always there, but never hovering over our heads. Two glasses of champagne were presented to us for our anniversary. This was a very nice gesture to start our meal. Stone Crab to start, Crab Bisque and Caesar salad after and then a great seafood entree with lobster, shrimp and scallops. Too full for dessert. We had a spectacular evening....great food and great service. Thanks, Joe's and particularly Justin for making our evening a great time and now a great memory!", "pics": null}}, {"review": {"des": "Joe's Seafood, Prime Steak & Stone Crab is the quintessential steakhouse -   <br><br>it's classy.  White table cloths and waiters dressed in black vests & ties - the whole place is dressed to impress. <br><br>it's comfortable.  The staff makes you feel like family coming over for dinner as soon as you sit down.  Our waitress, who's name I've lost, was the nicest and every single question our group threw at her.  I think she told us she'd been there for 15+ years - and it showed.  The woman knew her stuff. <br><br>it's boisterous.  The dining room was packed and I would have expected nothing less from one of the best steak houses in Chicago.  If you're looking for a quiet romantic dinner for two - this may not be the place for you.<br><br>it's delicious.  My filet mignon was perfect, and the the mac/cheese and mashed potatoes were each amazingly creamy.  Portions were totally fair and easy to share among the six of us too.<br><br>it's dessert menu is top notch.  To put is simply - the peanut butter pie was incredible. Order it, don't argue with me on this. <br><br>it's run like a machine.  There seemed to be a constant circling of waiters, runners, and bus boys.  Need another drink or some house-made steak sauce?  You won't need to wait long - there was always someone close by to make our requests to.<br><br>Dinner at Joe's was one of the best meals I've had in Chicago - if you have the opportunity to go for dinner - you've got to go!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/dBL5z7Ja4yFOiVFatq6Sdw/168s.jpg", "caption": "Berry Cobbler"}]}}, {"review": {"des": "After a very long day of traveling, I was super hungry by the time I got to the hotel. Thankfully some coworkers suggested this place and we made the quick walk across the road to try it out.<br><br>I ordered the skirt steak medium and we got the mashed potatoes and brocollini for the table to share. Absolutely mouthwatering. My skirt steak was cooked perfectly and my chimmichuri sauce on top really added a nice herby flavor. I finished my whole plate.<br><br>This place was really busy when we got there but we still managed to find a spot at one of the high top tables. They also have coat check services for that cold Chicago weather. <br><br>The service was good, albeit a bit slow when we requested our check. The price is a bit on the higher end but totally worth it.", "pics": null}}, {"review": {"des": "This place was AMAZE FOR DAYS! It was one of my first experiences at a high end restaurant and it was a really wonderful time. The New York strip was TO DIE FOR. As was the filet Mingon and the lobster tail. My friends who came with me got some crab legs and it was the best they've ever had !<br><br>The service was wonderful! Table side wine with hot clothes in between courses as well as wonderful conversation with the server. I could not have enjoyed myself more ! Highly recommend .", "pics": null}}, {"review": {"des": "Have been here several times over the years starting way before Yelp. Sometimes great martinis at the bar and sometimes kinda stuffy atmosphere in years past when there were not as many great steak houses in Chicago and the steaks were not that great. Came here for lunch last weekend on a whim and the place has seemed to really improve, maybe because of the stiff competition now. Had a NY strip for lunch which was really good, pretty large and a little bit tough. Cooked exactly as ordered medium rare. Wife had a steak salad which was very delicious and fresh with what seemed to be flank steak. The oysters were not the best. Have had better many other places including Kinzie Chop House. Did they put some kind of vinegar dressing on some of the oysters to make them appear to taste fresher?? Some places have done this (and I won't name names). Wine by the glass was very reasonable and in line as to quality and cost with \"most\" of the other notable steak houses. Beautiful inside with nice white table coverings. Became very lively and busy for a Sat afternoon lunch, but the service was still absolutely terrific which really turned the scale north. Can be expensive for lunch, but this is River North Chi-Town so you expect it. Anyhow, I was drinking pretty high end wine. I would definitely come back here and bring clients and friends et al. You can sit at a high top in the bar area and watch the Big 12 lose their playoff chances while sipping a martini or watch the Bears try to win! Next time I don't need a steak for lunch, but want to try one of their great burgers which I heard were great and looked great, and would probably go great with the high end wine. This is a go.", "pics": null}}, {"review": {"des": "Simply amazing. They even had a select vintage wine from Washington State my parents love - nice surprise!<br><br>Food was delicious and the service was fantastic. Very accommodating. My folks were in town to visit and we had never tried stone crab before. The restaurant offered to have us order as an appetizer. I also love how the crab is already cracked and ready to eat here.", "pics": null}}, {"review": {"des": "This was a very last minute spot for dinner that we looked into and it turned out to be great!! Both steak and fish in the menu so the whole family can enjoy a nice dinner. <br>Upon arrival you are greeted by the hostess who was a very dapper. The staff all wear tuxedos, with tuxedo shirts and bow ties, even the women. Makes the place even more elegant. (Side note, I wish the manager was also dressed as elegant as the rest of the staff was not in a gray suit) <br>Our waiter was Matt, a little dry on the humor and short with words but overall knowledgeable and kind. <br>To start had the crab cake appetizer. It's one crab cake but mostly crab no cake which is perfect. My entree was the Dover. Wow! Highly recommend anyone to get this dish. <br>They bring the whole fish and take off all the bones before they serve you it. Sides are all a la carte, the Brussels were one of the best I've had. Crunchy and sweet! Definitely a nice compliment to the fish. <br>I will for sure return to this great place and leave room to try the dessert next time.", "pics": null}}, {"review": {"des": "Holy moly, this place is the real deal. It's definitely your traditional, classy steakhouse (white linen tables, servers in tuxedos) so avoid casual wear as much as you can. My husband, parents and I came here this past Saturday (the beginning of Restaurant Week) and it was PACKED. Highly recommend you book a reservation, especially on the weekends. <br><br>We were seated and our server, Denise, came by and introduced herself and then proceeded to ask all of us what our names were. I can safely say that has NEVER been done before when I've dined at a restaurant. I thought that was so classy and respectful to ask our names; not to mention, she remembered them the rest of the night and addressed us all individually by our names. Claps for you, Denise! <br><br>The food was absolutely outstanding and I'm pretty sure we all rolled outta there afterward. My husband and I decided to go for their Restaurant Week menu of an 8 oz filet mignon (order it with a side of béarnaise sauce), grilled tomato (which was fabulous by the way - had pesto spinach and cheese on top of it), and mashed potatoes. We also added on mac and cheese and brussel sprouts, because why not? Everything was incredible and cooked to perfection. My father ordered the grilled branzino and my mother ordered the seafood platter. Needless to say, we were all stuffed by the end of our meal. <br><br>But....who goes to a steakhouse and leaves without trying dessert, am I right?! My husband's and my meal automatically came with a slice of pie (key lime for me, banana cream for him), so obviously my parents were a little jealous and decided to order some pie too. What's great is that Joe's does half slices of pie so you can try more than one. My parents each got a half slice of two different pies so they could get a taste of everything. Let's just say, half slices mean full slices to the people at Joe's. They were HUGE. I had my key lime pie and tried the banana cream and chocolate pies and I have to say the key lime knocked it out of the park. Probably the best I've ever had. That graham cracker crust though.....<br><br>Anyways, if you're looking for a nice steakhouse but aren't afraid to drop some serious ca$h money, make your way to Joe's!", "pics": null}}, {"review": {"des": "Absolutely fantastic! Amazing management and staff. Jim took our reservation and it was a full evening. Once he heard why we wanted to dine at the restaurant as a tribute to a recently deceased family member who loved the restaurant, he understood and made everything possible. Thanks! <br><br>Our server was Martha, she is the best. Are true professional who knows what she is doing and how everything has to be. She is extremely knowledgeable, genuinely friendly and welcoming. And during our meal, Paul (manager) stopped by. We had a wonderful conversation and had much in common. <br><br>The food is the best. Stone crab claws unsurpassed. The Joe's chopped salad is delicious, fresh and with just the right amount of dressing. <br><br>Steaks included a filet, a filet Oscar and I had the bone in rib steak. I have to say the best rib steak I have had, and I've had many. I saw Joe's fried chicken on the menu. I'm a New York guy and have not seen that on a steak house menu since Ben Benson's. We asked Martha and she said it was a menu sleeper but excellent. So what the heck! We ordered some. 4 piece, half a chicken fried to perfection. Great recommendation Martha!!<br><br>If your going to be in Chicago don't miss Joe's. Make a reservation ahead of time and make it part of your city visit!", "pics": null}}, {"review": {"des": "The place is an institution. Exceptional service. Knowledgeable and friendly. Fabulous old school ambience. <br><br>Oysters Rockefeller was perfect. Creamy deliciousness topped with brown chewy cheese. 4 to an order not som stupid odd number. <br><br>Fish an chips fed two easily. Chrispy golden fried fish. Perfect fries. Coleslaw tossed with the tarter sauce was the best ever. <br><br>Really nice lunch with a corner table in the bet = perfect people watching. Great time.", "pics": null}}, {"review": {"des": "Chicago is one of my foodie heavens. They take quality to another level here. This place is no different. We all had seafood and the quality of each cut was amazing! The only tough part was portions. My friends ordered the snow crab (good but not my favorite), the sea bass (tiny, tiny portion), the ahi poke (excellent quality) and I got the fish and chips. The cod was good, the fries were unique with this malt seasoning. But overall, I've had better, esp in Chicago. Also, we finished off with the key lime pie and apple pie.... both good but again, you can find better desserts in Chicago. This gets a 3.5 stars from me. Service was also slightly lacking (no one greeted us when we entered, I had to hunt someone down to find us a table).", "pics": null}}, {"review": {"des": "I really wanted to like this place more than I did, but it just didn't happen. Sadly.<br><br>We called a couple of weeks in advance of our visit to Chicago, and all dinner reservations were booked already. That was a good sign for me, and luckily we were able to snag a bar table in the front shortly after we visited. They serve the full menu and while I don't think you get the full restaurant experience, it sufficed for me. Just come in ready to hover and snag a table when they open if you don't have a reservation.<br><br>That's not the reason this was only okay. The food just wasn't what I was expecting. I got the classic ribeye, and I'm still trying to figure out whether it was actually ribeye. A good majority of it didn't taste as one. That's not something one should be guessing at a prominent steakhouse nor for a $50 piece of meat. The sides we had were okay. My drink (some beach cocktail) was fantastic, and the assorted breads were quite good. But the meat of the meal (no pun intended) just didn't cut it (no pun intended again).<br><br>Admittedly, the price of the snow crabs steered me away from getting them, but perhaps they were better than the steak. Nonetheless, the steak here should have been phenomenal and it wasn't close to that.", "pics": null}}, {"review": {"des": "You have to go to Joe's if you are in Chicago and want some seafood. The bread basket is one of a kind, each bread has a different flavor. We started off with Beef Tartare. It is the classic kind of Beef Tartare, but the taste is solid. Then, we had the Stone Crab Claw the waiter recommended. We ordered select size, which is medium size, and the medium size you see on menu is basically small size. The claw is extraordinarily fresh, and the sauce is very flavorful. We were not the type of people who like to eat cold seafood, but we finished  all of it.  For the entree, We had the grilled seafood platter and new york stripe. The platter is amazing, the lobster is the best of the three, the scallop is not enough flavorful, and the shrimp is a little too salty. The new york stripe is good, and the price is reasonable, but in Chicago, this is not the place for Steak.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/y5Zig0pD-L-fckAT76jxrQ/348s.jpg", "caption": "New York Strip  12 Oz."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/7pMkeFTeuvXS6AYGRSOgdA/168s.jpg", "caption": "Grilled Seafood Platter"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/0uQ2G9yr7KvLEKYWMa10zQ/168s.jpg", "caption": "Manhattan Clam Chowder"}]}}, {"review": {"des": "I got the surf and turf here and it was spectacular !!! honestly one of the best I've had and I'm from Florida so I know good fish. Totally recommend coming here it wasn't hard to get in because it was the middle of the day but you might want to make a reservation", "pics": null}}, {"review": {"des": "Got turned away at 9:38 with a 9:30 reservation. Hostess lied and said my reservation was at 9. Service with a smile!!!!!!", "pics": null}}, {"review": {"des": "I've only gotten delivery from here so I can't comment on the in person experience. However, the food was incredible! I ordered the seafood chopped salad. It was so fresh with perfectly cut radishes, green beans, asparagus, and much more. The seafood was also very fresh and generous in size. I was very impressed with how everything came packaged neatly and nicely. <br><br>You have to try the havana pie! It's like a tres leches cake with ducle de ledge sauce. Heaven!", "pics": null}}, {"review": {"des": "Advance reservations required. We ordered the crab bisque which was excellent. My fiancé and I split a meal which was not frowned upon but rather our excellent waitstaff offered to cut steak in the kitchen and brought out the baked potato in two plates. We ordered the 16 Oz ribeye and it was perfectly prepared. Half sized desserts were welcomed and we selected the Havana Cream pie. Yummy. Will return to Joes next time we are in Chicago.", "pics": null}}, {"review": {"des": "My 5 Star Review! Celebrated my sons graduation and his fiancée graduation, last night! <br>Everything was exceptional, from service, appetizers, entrees and desserts! We started with stuffed mushrooms and ordered stone crab, INCREDIBLE! <br>My son and husband got the seafood trio, it was all perfection! Succulent Prawns, scallops were incredibly delightful, and of course the stone crab stole the show! My other son got Joe's fried Chicken, so crispy and tender! The flavor was the best I've ever tasted!  Do not under estimate this item on the menu! My to be daughter, and I both got the beef filet, it was cooked perfectly, and very flavorful! Lemon asparagus, baked potato, and crispy Brussels sprouts were all equally amazing! <br>Our complementary Key Lime pie slices we were given at the end of our meal were scrumptious! I don't think I've ever had Key lime pie so perfectly balanced! The pastry chef must be a genius! Even the Peanut Butter Pie my husband ordered, was a light and airy cloud of pure heaven, for peanut butter lovers! We all can't wait to go back and try other menu items! But I guarantee, fried chicken will be ordered again, and again and again!!!", "pics": null}}, {"review": {"des": "Had lunch here last Sunday. We came here to celebrate my husband's birthday. There were seven of us. 4 adults and 3 kids.<br><br>I was pretty reluctant to go here just because I have three kids (under 6). Even though this place is a kid friendly restaurant, If you have kids, you know how they are. One minute they are happy and the next minute they can act like little monster. <br><br>The server was really nice. Since this was our first time here, he gave us a little background about the place. He also recommended us about what food to order. <br><br>To cut things short, we ordered:<br><br>Appetizer:<br>Dozen oysters<br>Fried Calamari<br>Tuna tartare <br><br>Entree:<br>Sea bass<br>Halibut<br>Roasted chicken<br>Salmon<br><br>Entree for kids:<br>Grilled chicken with fries (came with ice cream as a bonus!)<br><br>Everything were extremely good. Super tasty. Even for the kids entree.<br><br>This place is definitely going to be our new hang out place.<br><br>*no pictures because I was too busy with the kids*", "pics": null}}, {"review": {"des": "Went tonight to celebrate our anniversary.  Food and service were excellent as usual.  Both are why we always make Joes our go to place for special occasions.  Thanks to Jose for helping make our dinner and anniversary a night to remember.", "pics": null}}, {"review": {"des": "I have passed by here many times but never been inside until today. It has a traditional and formal atmosphere. The food is absolutely fabulous - we ordered steaks and seafood. It was all delicious. Service was good and the wait-staff was very friendly. Can't wait to go back!", "pics": null}}]}