{"name": "joy-yee-noodle-chicago-2", "reviews": [{"review": {"des": "Joy Yee's has the best fresh fruit smoothies and tapioca in Chicago. They have so many drink options on the menu and you can even customize it yourself. I think their milk teas taste too sweet so I don't usually order their milk teas. <br><br>My usual favorites are:<br>Strawberry banana freeze w/ mango jelly<br>Avocado freeze w/ tapioca<br>Banana coconut freeze w/ green tapioca<br>Vietnamese iced coffee freeze w/ coffee jelly<br>Strawberry/banana/passionfruit freeze w/ mango jelly", "pics": null}}, {"review": {"des": "Ordered off Grubhub! My food came fast and the delivery driver was very nice. I ordered Kimchi beef fried rice, Mongolian Beef, Fried Shrimp Shumai, Orange Chicken, Crab Rangoons and Steamed Chicken dumplings and smoothies. <br><br>The Mongolian Beef was very tender I just didn't get enough of the steak. It was more of a Mongolian peppers and onions. The Orange Chicken was good. I just wish it wasn't room temperature. The Crab Rangoons, Fried Shrimp Shumai and Chicken dumplings were delicious. The Kimchi Beef Fried Rice was just ok. It was a little dry and had teeny weeny pieces of beef in it. We had Raspberry and Peach Berry smoothies. The Peach Berry smoothie tasted like Zeus made it!! It was very good!!", "pics": null}}, {"review": {"des": "I hadn't been to Joy Yee in years but decided to check out out with a friend of mine. We walked in and were seated immediately despite the restaurant being near full capacity. I found the environment loud and a bit chaotic but we made the most of it. They could use some soft surfaces to help absorb sound. <br><br>I ordered the mongolian beef and my friend had the Korean BBQ ribs. My dish arrived within 10 minutes after we ordered but my friend's food didn't come for an additional 10 minutes. I found it odd that the food didn't come out at the same time. <br><br>The mongolian beef was tasty but it wasn't the best I've ever had. The waiter said it was spicy but I didn't think it was spicy at all. It was good but that's about it. I don't have much to say about it other than there were way too many onions. My friend loved the Korean ribs though. I tasted them and didn't care for them.<br><br>Meh. Joy Yee is still on my list for acceptable restaurants for Asian cuisine but I wasn't that impressed this time around. The service was good though and I enjoyed the overall experience so it wasn't all bad.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/RvQy2YPaAGbQ92kosy5l3g/348s.jpg", "caption": "Mongolian beef"}]}}, {"review": {"des": "Came here for the first time with a groups of friend-- there were more of us than expected and the servers were very accommodating of our very large group. My friends highly recommended the beef cubes and raaaved about it, so naturally I ordered it (as did the majority of my table). <br><br>I mean it was good, but honestly it was just ok. It was like $13 or something like that and I thought it definitely was not worth that price range. Basically you get a giant plate of rice topped with the beef cubes and a few pieces of veggies on the side, and I looked at it and realized I was paying ~$13 (not including tip and taxes) basically for a bowl of rice. The beef cubes are pretty much just sprinkled on the top. Don't get me wrong, the pieces you do get are very flavorful and have a spicy kick to them. It's just...not a lot. Certainly not enough for what you're paying. But the boba here is ok and I hear the smoothies are good. Overall an ok place.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/wE-dBhuONjvxIWdWfTwZ8A/348s.jpg", "caption": "Beef cubes"}]}}, {"review": {"des": "I have walked by past this restaurant many times when I lived in chicago, but never went in to go eat because it always looked so crowded inside. <br><br>This time since I was with a larger group, and we weren't sure what else to eat I suggested this restaurant.  We went around 4 pm and were starved since we hadn't eaten since 10 am.  They had alot of people waiting in line for drinks but luckily we didn't have to wait for food. <br><br>We ordered way too much food, the portion sizes here are huge and you can easily split 1 order between 2 people and be super full.  We ordered the korean spicy noodle special, a large pho with everything, spicy green curry chicken fried rice, and a plain thai noodle.  My favorites were the spicy green curry chicken fried rice, and the pho!! The chicken fried rice was a massive portion and the flavor was great! It had a great curry flavor, and was actually spicy. <br><br>The spicy noodle did not have any korean flavor and was pretty disappointing, it was chock full of seafood but wasn't tasty to me. <br>The pho had a very generous portion of tendons, beef, tripe, etc. <br><br>You won't go wrong sticking to the basic here, but if you order stuff that looks special prepare to be disappointed.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/bPu5SZeDN5QVRlJCn_3fNw/348s.jpg", "caption": "Korean noodle"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/aAqppEzpAGYamymcezBVwQ/168s.jpg", "caption": "Pho"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/jtJgqKDKfzvs_zVS6cu3mg/168s.jpg", "caption": "Spicy green curry chicken fried rice"}]}}, {"review": {"des": "I love Joy Yee as a option for asian cuisine in Chinatown that is not specifically Chinese. Although I do not consider Joy Yee to offer any traditional asian cuisine, I do enjoy coming here from time to time. <br><br>If you are in Chinatown with a group of people who are not too familiar with traditional Chinese food, Joy Yee is a good choice. They have sooo many items on the menu that it's quiet over whelming.<br><br>My favorite things to order are the green thai curry chicken and the most popular item on the menu is the beef cubes with tomato sauce (almost everyone I know that has been here has tried this). I also enjoy the Korean BBQ short ribs although they are not the best short ribs I've had they are sufficient if you are having a craving for them.<br><br>The drinks here are the BEST. Hands down always a go-to for bubble tea. My favorite drinks to get (I do not like things that are TOO sweet) are either the red bean freeze or avocado fresh fruit freeze. <br>If you are looking for something sweeter, my boyfriend enjoys the honey dew with mango.", "pics": null}}, {"review": {"des": "I always come here for the drinks. They have an assortment of different drinks that range from fruits, vegetables, and coffees! The best part is you can mix them up! Their bobba is always the right texture. I come here food as well. They have all types of Asian dishes. This place is good to bring guest and tourist as their menu has pictures for people that are not sure what they are ordering. Good for large groups! Most of the dishes are reasonably priced. I'd highly recommend this for a variety of different foods!", "pics": null}}, {"review": {"des": "Pretty solid food and drinks overall! Options for every type of Asian cuisine, so it's a great place for groups especially if everyone wants something different. We had the pho and sesame chicken, both were made well with a great taste. There are a number of Joy Yee, and this one matches up with other locations Ive visited!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/UkI3x_in0ZxeU3o3Ke3cMQ/348s.jpg", "caption": "Beef pho and sesame chicken (sorry couldn't help myself!)"}]}}, {"review": {"des": "Seems like 1/2 the folks walking through the Square in Chinatown have a Joy Yee Boba drink in hand so after an amazing dim šum lunch at MingHin's (I'd highly recommend it) we treated ourselves and I was really impressed at the extensive freshly made on the spot drink menu options - see picture below.<br><br>I ordered a 25oz traditional milk tea with boba and it was very good. Really liked the ćup with spillproof seal. With so many unique options, its easy to see why they are so popular!! If Boba just isn't your pijam, they also have fresh fruit or coffee bean smooties that looked really delicious. Plus I also loved that you can order with red or black Boba or various fruits like pineapple, mango, pomegranite or lychee which would definitely be refreshing on a warm summer day and for approx $5 USD (could go up depending in what you decide as add-ins) its not a splurge to treat yourself:)) <br><br>Now I just wish they had a Riverwalk location so I'd get them more often after work!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/VnY2-Yyd8v8DT79OmKZbyw/168s.jpg", "caption": "Matcha Milk Tea, Berry Freeze & Kiwi Tapioca and Lychee Jelly Freeze ... all yumzo! Treat yourself:)"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Y4yxQlxs3gaMXHfpctpPTA/168s.jpg", "caption": "Traditional Milk Tea"}]}}, {"review": {"des": "Food: This place is a great place to eat in Chicago Chinatown. The menu is huge and there is a plethora of options from Chinese food to Thai to Vietnamese. The food is not necessarily amazing but everything I tried was really great. They have a lot of bubble tea options as well. <br><br>Atmosphere: pretty open space with a relaxed fast food like atmosphere<br><br>Price: price was fair<br><br>Overall: I would definitely come here again if I lived in the area. I would love to try more things on their menu!", "pics": null}}, {"review": {"des": "Joy Yee Noodle is everywhere on social media and a must go kind of bubble place. This rave made it to the top of the list when I was in Chinatown. My expectations were met when I saw how big ​the space was. The service was good and the food came out pretty fast. It gets really busy so I would stop by early lunch or dinner. It closes at 2:00 AM so it is great for the late night cravings. <br><br>I ordered the udon noodle and fried rice (I forgot the specific names) but they had the perfect hit of spice to it! <br><br>A lot of families and dates come here which is really cute. Friends with huge groups also come by for that bubble run. If you never went to Joy Yee and like boba... this place is the next boba run to go to.", "pics": null}}, {"review": {"des": "I really wanted some Asian food on my last day in Chicago and this place came recommended to me so we decided to drive over here. There is a parking lot just up the street that you can park at and I think it was $2 with validation, which is great!<br><br>Walking into this place it looks a little more modern than some of the other places. I wasn't sure if I was going to like this place, but my friend ordered the curry and I ordered the chow fun. The food came out extremely fast and the portions are HUGE. We would've been good with just one plate, but we had a ton of leftovers. We both ordered boba and it was nothing special that I would order again. I would definitely be back for some noodles though, they were really soft and chewy. The flavors to the curry were also really good. Overall I think I'd come back and I think like another reviewer mentioned, I'd probably stick to the basics here and you'll be fine.", "pics": null}}, {"review": {"des": "I used to like this place a lot, until I realized how expensive it is for a subpar bubble tea. I ordered oolong milk tea with Nata jelly, they don't carry that so they substituted it for something else like peach jelly or litchi jelly, which was awful. It was super sweet and it completely masked the subtle taste of oolong. <br><br>Interiors looked great but I walked in the floor had water on it at some places and the restrooms were terrible. <br><br>On the whole, I didn't like the experience because it was expensive, they do only one size and the interior of this place is not clean.", "pics": null}}, {"review": {"des": "There is a huge menu and we decided to go fruity and got smoothies. For 3 drinks it was over $20, which is pricy for where I'm from. The drinks were huge though. I don't know how anyone could possibly drink all of the smoothie on their own without getting extremely full. I ordered lychee and it was perfect. I tried my friends mango smoothie though and I definitely liked that one better. It's made with real fruit which I like.", "pics": null}}, {"review": {"des": "This is my go to boba place when I am in Chicago. It's so good. And I always try something new because there are so many options. Literally so good. The last time milk tea with boba and milk pudding and they put it a bigger cup. I was shocked. But honestly, so good. There's other boba places around but Joy Yee is the place to go in China Town. With so many options, I don't think you can be steered wrong. I haven't had the food here but boba is a must! I like that there's a separate area to order your drinks from the restaurant.", "pics": null}}, {"review": {"des": "Review is only for their bubble tea. <br><br>We stopped by after lunch at Bonchon. 2nd Joy Yee location that I've visited. Trademark extensive bubble tea menu with pictures. Tried black tea with cheese for the first time, something that's been on my bucketlist ever since being sent the buzzfeed feature on that intriguing flavor combo. Unfortunately, the ratio was off because we ran out of tea super early and was left with only cheese foam and ice. When melted, no. Recommend ordering with light ice and/or stirring it all together (though drinking it stirred isn't as much fun).", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/am4XI6-YCAfD8PuW5W-Ydg/348s.jpg", "caption": "Black tea with cheese. Fun to try, but needs balancing"}]}}, {"review": {"des": "Let's talk Joy Yee. Wildly successful with the youngins, an INSANE bubble tea menu. If bubble tea were a sport, Joy Yee would be in the olympics for sure. <br>Portions are ginormous, seriously, not kidding.<br>The atmosphere depends on the location you go to, but for the most part is open hall type of atmosphere. <br>The food I have had to date has been mediocre at best, granted, they have a ginormous menu, so I have not tried everything on it. <br>The Pho bowl alone is big enough to wear on your head (no lie).<br>Somehow we always end up going home with a suitcase of food as leftovers. <br>I have been to two locations to date, Evanston and China town. To be fair, Evanston was on a Friday night I think. The place is small & severely packed. Cafeteria style tables and chairs and you have to crawl over each other to get in and out. You like stress and anxiety with your meal? Look no further.<br><br>China town on the other hand, I went to late afternoon on a Tuesday and it had plenty of room but was still doing a decent business. Much more relaxed dining experience compared to Evanston. <br><br>At the Evanston location I ordered some type of seafood noodle thing; but the bummer was it was more noodle than seafood, so I really just ended up eating my seafood out of it because I'm not big on noodles. WTH was I thinking, lesson learned.<br><br>At the China town location I got smart and was like \"I'm not going to order anything with noodles.\" So I ordered the Thai basil jalepeno shrimp fried rice. <br><br>I was with guest so the party ordered accordingly and I posted pictures of each dish diligently. As I mentioned earlier, we took a suitcase of food home. No issue with any of the leftovers I might add until I got to the red curry, which was not the dish I ordered, but looked good. <br><br>Here is the issue. When I went to consume the red curry, it looked good, it smelled good, it tasted good, but when I tried to consume the meat in the dish, it was flat out inedible. Even worse, every single piece, I mean not one piece of 'meat' was edible. It was all gristle and cartilage, every bit of it. We make our own stocks and soups at home so I get parts for flavor, but no place for it in this dish. In fact, I am shocked they even serve it that way. I feel like I need to be prorated for whatever amount they charged me for the meat, because you cannot call that meat, sorry. <br><br>This is the only dish I have had an issue with at Joy Yee, so perhaps a one off? Let's hope, but two stars until then.<br><br>Also a general note regarding something I noticed at both locations, the dirty dish bins and wasted food lined up by the bathrooms is fairly disgusting. I fully realize America has a food waste issue, so perhaps take a page from Cheesecake Factory's experience (not a fave of mine either) and introduce a reduced portion/small plates menu to help reduce waste and eliminate the need for the line of nastiness by the bathrooms. <br><br>In summary, is Joy Yee sustained on bubble tea alone? I don't think so. There is enough of both, non-ethnic and ethnic traffic combined, occurring in the establishment, that they must be doing something right. And back to that Pho bowl, it literally is big enough to wear as a hat!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/V69wDZeAnLiysBwZjUVb8A/348s.jpg", "caption": "Not 1 edible piece of meat in the dish, not even edible, it's all gristle and cartilage, horrific. I'm shocked they even serve it."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/G3PWHdBNEQhqIZDIOszX1g/168s.jpg", "caption": "How it looks as leftovers"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/_EvIhs_hQew1GYe5h3Gcow/168s.jpg", "caption": "How it came out, looks good"}]}}, {"review": {"des": "Extremely fast service for the amount of food we ordered. We can around lunch time during the week and we were able to be seated right away! Boba is served in large portions and you can order your own food or go family style like we did!", "pics": null}}, {"review": {"des": "Always delicious! One of my favorite places to eat Asian cuisine! Huge menu of drinks and smoothies! Tom Yum Soup & Spicy Malaysian String Beans are awesome!", "pics": null}}, {"review": {"des": "The staff was very welcoming and had very exceptional service, but for me, one of the most important qualities of a restaurant is their food!<br><br>The Salted Fish, Ground Pork and Egg Stone Bowl smelled and tasted like dog food.  In the beginning, the fish was a bit salty and as the meal continued, the fish became unbearable.  My friend had the Japanese Garlic Pork and Egg Stone Bowl, which smelled and tasted much better, but didn't have enough meat for the portion of rice given.  It was like you gave someone a bag of chips and one spoonful of dip, expecting them to enjoy the chip and dip.  It tasted good, but the proportion was off.<br><br>We also noticed that the staff mixed short grain and long grain rice. Maybe this was to make the rice cheaper, and in return, compensate for texture and flavor, but it was a little stingy on rice quality.  The outside edge of the stone bowl was hot, but it did not crisp the inside layer of rice touching the bowl. This crispy factor is one of the best parts of a stone bowl, and it was lacking.<br><br>I always got exceptional customer service along pouring me water.  But it was because I needed something to wash down the $13.32 fish.", "pics": null}}, {"review": {"des": "After seeing all the reviews about this place, we decided to come here for lunch. The place was packed and busy that we had to wait 20 min for a table. Half of the restaurant is a dine in food service and the other half is a boba shop with to-go windows. <br><br>We finally got seated and were handed the menu. I was overwhelmed with the many selections on the menu for both food and drinks. I wasn't quite sure what to order so I just got a durian smoothie ($5) and the beef brisket chow udon noodles ($12). My bf got the avocado shake with boba and the cubed beef tomato rice. <br><br>The durian smoothie was good! But the avocado shake was tasteless and watered down. The boba were hard and not chewy. We were quite disappointed in the avocado shake. The beef cubes and tomato rice had too much pepper and the taste was very repetitive after a couple bites since all we tasted was pepper. The dish was not memorable. The udon noodles were alright! The beef brisket was a bit fatty but it was cooked until tender. But the taste was also a bit repetitive. We were tired of our dishes after a couple bites. <br><br>I am starting to think the many reviews here is for the boba shop only. I wouldn't recommend coming here for the food since we thought it was Chinese food based. The menu had a mix of shabu shabu, Korean food, Chinese food, and thai food! I am completely amazed of their menu options but was fairly disappointed in the quality and taste of the food.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/U3UT0ABaMNR7s5TlVOGnKQ/168s.jpg", "caption": "Beef brisket udon noodles and beef cubes and tomato rice"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/DQ8n2bXJvKm_KP18nqptdg/168s.jpg", "caption": "Avocado shake (yuck) and durian shake (yumm)"}]}}, {"review": {"des": "I've been here twice and have only had the bubble tea each time. No complaints on the bubble tea itself - I'm a huge fan! I absolutely love that they have so many variations and toppings available. I've stuck to my fave taro milk tea with bubbles at each visit and I can't complain. <br><br>The reason for 3 stars is the service. The cashier and staff were very friendly on both visits, but there seems to be some large gap in communication between the cashier and those preparing the tea. I had an issue on both visits where my order was not communicated to those in the kitchen and I waited while people who ordered after me received their tea. <br><br>Other than that, it's a great spot. They serve food also, but I haven't had a chance to try it yet.", "pics": null}}, {"review": {"des": "While visiting Chicago my Uber driver decided to put me on to some food gems.. joy yee being one of them. He got this one RIGHT!<br><br>In one weekend I visited this place twice. Once dining in and the other takeout. Both were great! Takeout actually might have tasted better which rarely happens.<br><br>I visited Chicago a couple of weeks later and again went to joy yee! It's that good!<br><br>The portion sizes are huge! <br><br>The menu is huge! A large selection of things that includes writing and pictures. I actually found this overwhelming every time! Almost worse than going to a jersey diner  (too many options) so I did use yelp to help me pick what to eat.<br><br>The bubble teas and smoothies are made with fresh fruit and tapioca! Strawberry/pineapple taste like candy lol<br><br>The wait staff was overall friendly not too pushy but just right. It tends to be crowded but their turnover is pretty good because the food does come out quick!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/OevvQM9eMHBoNcMYbLWBQQ/348s.jpg", "caption": "Stir fry"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/TJ9-kYRxOzRwYipkdQongw/168s.jpg", "caption": "Eel and beef over tomato rice (enough for two ppl)"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/uK6t3cPSS3JTDbwptpqJXQ/168s.jpg", "caption": "Shrimp rice"}]}}, {"review": {"des": "The food was okay just okay! My expectations were so much higher. The beef and tomato rice dish with okay, the rice was sweet the beef was chewy! My son had the beef bone soup which I thought was good but he didn't like. <br>My other son had the Orange chicken and crab ragon with he loved.. The best thing was the bubble tea! First time trying it and I'm hooked!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/wG4hrafwHRN7m6TktDhm-w/348s.jpg", "caption": "Forgot the name of this tee my son. But I promise you taste just like buttered popcorn"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/l48kcA54IEQGVThs0AqdrQ/168s.jpg", "caption": "Pineapple green tea, with bits of pineapple at the bottom. They're bomb.com"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Hkx8rni91bTERlp5XOSqDw/168s.jpg", "caption": "Beef bone noodle soup, good flavor!"}]}}, {"review": {"des": "Disclaimer : I am not a Chinese food connoisseur and besides my strong passion for crab Rangoon's I don't enjoy getting Chinese. <br><br>My little brother on the other hand loves Chinese food so I used his expertise for this review. <br><br>Service- The gentleman who took care of us was fast and efficient. Food came out quickly with a nice presentation. One of the other waitresses that wasn't helping us also was very kind to bring us napkins when she saw me spill all over myself (guilty). 5 stars on the service <br><br>Food- We ordered crab Rangoon's (of course), Spicy veggie fried dumplings, sesame chicken, teriyaki chicken hot plate, and Korean beef. First of all... best Rangoon's ever, for sure best I have had in Chicago. Everything else was good except the teriyaki chicken dish which was very dry and lacking flavor. Maybe it was a fluke? Not sure but everything else was great will defiantly be returning for another plate of those delicious crab Rangoon's soon. <br><br>Ps. Pineapple coconut freeze is so good, I felt as if I was sipping a piña colada somewhere on a beach.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/S471uw-hHJr2FN6aLOFqxw/348s.jpg", "caption": "Korean Beef"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/P0tyxy_veArZgvZddgDyng/168s.jpg", "caption": "Sesame chicken"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/fws5G_xLM34y5mv1Rm3ipA/168s.jpg", "caption": "Teriyaki chicken"}]}}, {"review": {"des": "GREAT BUBBLE TEA, NOT SO GREAT FOOD. <br><br>This place was packed on a Friday night, just like pretty much every other place in Chinatown. I have always loved the bubble tea from here and wanted to try the food as well. <br><br>I got the milk tea with custard and my friend got the honeydew with tapioca. Both were quite delicious! <br><br>For food, they have a wide selection of cuisines, ranging from Korean to Chinese to Vietnamese dishes. I first I was quite impressed by their vast menu but I now realize this is a \"jack of all trades, master of none\" type of situation. We both ordered the spicy beef brisket noodles. It looked delicious when it arrived but I was quickly disappointed with my meal. There were a lot of pieces of beef that were hard to chew, and the seasoning of the noodles/broth were not at all what I expected or authentic. <br><br>Sad to say but I will probably not be back for the food (unless tells me there's something that I have to try here) but I will 100% come back for the bubble tea because while it seems like they haven't gotten the food quite right yet, they've definitely gone right with their boba.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/iT0LA9DsqE76Z64CPHn0ZA/348s.jpg", "caption": "Spicy beef brisket noodles"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/hcYQTQRYlRdwbXSzDFdzxA/168s.jpg", "caption": "Milk tea with custard"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/1VFJbeFyCmMEsD2mhgcYtg/168s.jpg", "caption": "Honeydew"}]}}, {"review": {"des": "Joy Yee Noodle should be called Joy Yee Boba because a lot of their customers order drinks over food. In my first trip to Chicago's Chinatown, I wanted to buy a good cup of boba. There's a bunch of restaurants along the alley but Joy Yee stood out to me because they have an outside drink order station & a bunch of people were waiting for their drinks. <br><br>3 stars because of various reasons. <br>The drinks are SO expensive. I'm probably accustomed to the cheap & good drinks in LA. But Joy Yee drinks range from $5-7. I can buy a meal with that money..<br>The boba was not very good. The boba was stuck together in clumps.<br>I ordered a lychee black tea with boba. The tea tasted very herbal. (I cant say that's a bad thing)", "pics": null}}, {"review": {"des": "I have to say as a Chinese I nearly like all the food and drinks here!<br>If you come to Chinatown you see a lot of people waiting in a line for some drinks! Don't surprise! Yes! They are pursuit the wonderful drink here! Every fruit drink is so good that can't express by words. In summer days order a drink make of fruits and ice is a very very good choice!<br>For food here, I think it's mix. I mean not only Chinese food but also Thai and Japanese. But whatever the food is all delicious and yummy! They are big, so one dish for two people is suitable!", "pics": null}}, {"review": {"des": "Not much to say about this place. The food wasn't very good. I would pass on this place. Had the chicken noodle soup. Gave me all white meat which made the soup even more bland then it already was. The noodle itself was not too bad. I liked the texture of it. <br><br>My bf order some sort of sweet sour soup noodle. It was way too sour. <br><br>Definitely wouldn't not come back here.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/kHUi5h_YyRqL4WwlKDfHlA/348s.jpg", "caption": "Chicken and seafood noodle"}]}}, {"review": {"des": "Joy Yee to the world<br>All the boys and girls<br>Joy Yee to the bishes getting Bubble Tea<br>Joy Yee to you and me<br><br>There are two of these places, it's confusing. One serves waffles and drinks. The other serves lots and lotsssss of drinks. This is the original, with the massive drink menu. It's about a 1 minute 12 second walk from the other location. More like 37 seconds. I guess it depends who's walking.<br><br>The brown sugar milk tea is a decent effort and comes in a huge weird sealable plastic container that makes putting the straw in and taking it out again a little problematic. I don't usually have a problem putting it in, what can I say.<br><br>The egg waffle is a little dry but I'm sure it's better if you get it with the ice cream and other toppings. I much prefer it by itself, but only when it's moist and tasty, not dry like this.<br><br>Honestly - It's just great that they have brown sugar. Although it's not really great tasting.<br><br>The service is nice except that if you don't keep your receipt then it will cause a real problem because they might not want to give you your stuff. They said that someone else had taken my stuff, but after much deliberation and discussion they were willing to give it to me anyway. They were perfectly nice about it which is something. <br><br>Four stars overall is about right. Lines can be long, unlike your boyfriend.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/GdFlgMBd-A0C80fZmIAUvg/348s.jpg", "caption": "All the boys and girls"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Yhx75DFMjhvv5Bo45-GEHg/168s.jpg", "caption": "Joyyee to the world"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/oiVVRMof5JCJjAgjmTRbbA/168s.jpg", "caption": "Now that's what I call Joyyee"}]}}, {"review": {"des": "Came here on a Saturday night, no wait... ordered a spicy wanton appetizer and the Japanese pork egg bowl. Both tasted very mediocre. The pork was very thin bacon pieces but consisted of 90% fat and 10% actual meat. Onions were pretty much raw. The rice was weirdly grainy. Just overall did not taste good... very disappointed. ALSO, the water they served us was in unclean cups. We told them to take it back. Attached is also an unclean fork they gave us. Just overall a very sad experience for date night.... <br><br>TLDR: there are so many good restaurants in Chinatown. Pick any of them. Don't come to this one..", "pics": null}}, {"review": {"des": "Joy Yee's has always been a necessary stop every time I'm in Chicago, but it seems like the quality of the food has gone way down. The restaurant is known for its massive menu of all types of Asian items. Looking through the whole thing itself can take up half the time you're at the restaurant.<br><br>I ordered the \"Korean Spicy Tofu and Beef Soup\", which I assumed would be a soondubu-type dish. It was not. Instead, I got this watered-down spicy broth that I feel like they just poured a cup of oil in. We got a Beef Japchae for the table which was okay. My friends ordered the Sea Eel with Beef and the Korean Scallops Stone Hot Plate which were very salty. <br><br>Overall, pretty disappointed with this latest Joy Yee's experience. Their food has definitely gone down in quality and I think I will be checking out other Chinatown options next time I'm in Chicago.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/dDII7T-8X-4si_tlBFmHbQ/348s.jpg", "caption": "Beef Japchae"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/FAT54rjvm2P8shSDG7CzFA/168s.jpg", "caption": "\"Korean Spicy Tofu and Beef Soup\" - thought I'd be getting soondubu. Definitely didn't."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/RThu06ZMt_vnMOXFGmASng/168s.jpg", "caption": "Scallops and meat over rice"}]}}, {"review": {"des": "The worst customer service and on top of that we found a nasty hair in our food.  When I confronted the waiter, he didn't care and when asked about the manager, his reply was : oh, he went to his car and won't be back for a while. <br><br>Please do not eat here.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/AK4hkF1i9ZUAUMIp6Tu1ZQ/168s.jpg", "caption": "Check out the disgusting hair in our food.  Do not eat here!!!"}]}}, {"review": {"des": "My favorite thing about Joy Yee's is the massive variety of dishes they offer. Their menu is HUGE (quite literally...it's physically very large) and has food from all over Asia: Chinese, Thai, Vietnamese, Malaysian, Korean, you name it. The variety makes it great for groups that have different preferences, especially if they're not feeling particularly adventurous.<br><br>I've been here numerous times (but I've only skimmed the surface of their menu) and these are my favorites:<br>1. Salted fish fried rice<br>2. Beef cubes in tomato sauce<br>3. Salted fish, ground pork, and egg rice<br>4. Singapore rice noodle<br><br>Yes, I'm really into salted fish and yes, #1 and #3 are on the salty side but they're delicious. #3 gets me because I'm a sucker for the half-cooked egg on top. #2 is a crowd pleaser; I know several people who love this one.<br><br>For drinks, you'll always see a ton of people getting fruit smoothies and bubble tea. If you were to choose between them, choose the smoothie. I've had the bubble tea a couple times and it was just so-so. What disappoints me is the tapioca itself - not sweet and not the right chewy consistency.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/YmbKXGb8Zx7wq1LmKyGCPQ/168s.jpg", "caption": "beef cubes in tomato sauce"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/3yRQysDGpdwmbkY5-Kp9iA/168s.jpg", "caption": "salted fish, ground pork, and egg rice"}]}}, {"review": {"des": "Joy Yee is a franchise Chinese restaurant, so each Joy Yee have the same menu but don't expect the same taste and quality. <br><br>The Joy Yee at Chinatown however, two thumbs up! Today I came for the bobo tea only, and though I had better, but for $5 and a GIGANTOMOUS cup, I will compromise my expectations and down this cup with now qualms! <br><br>We had dinner here before which I did not comment before and it surpassed expectations. Again, for the price, it's value for money, generous portion, and very decent food. Something that I was really pleased with last time was their fried fish dish. It was fried really well, balanced with great flavors and not too oily.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/tBUXb8zVBUEUgURatR6TTA/348s.jpg", "caption": "Note the size of the cup. I don't have small hands! $5 for this is a STEAL!"}]}}, {"review": {"des": "Service is ok, like any typical Asian restaurant  it is hard to flag down a waiter. <br><br>We came for the drinks, definitely try the durian! It was delicious and made with real durian. <br><br>The food was not the greatest,  the beef and tomato rice looked delicious  but was very salty. <br><br>The beef udon was too sweet. <br><br>The calamari was the only thing on the food menu that we loved. Good portion for the buck.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Qt7T3PuE1xtnI7wJ0QbToA/348s.jpg", "caption": "Best thing on the menu!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/0lmHUJKML3SV9s1EIvNVuw/168s.jpg", "caption": "Beef udon too sweet"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/nJnzfsfBiirARD7aXIUgzQ/168s.jpg", "caption": "Delicious drinks"}]}}, {"review": {"des": "The selection of food here is unreal. It's very hard to decide what to get because they have so much food. Their menu had almost any Asian food you could think of. We got the Beef Cubes with Rice, and I would highly recommend it. It really resembles a Vietnamese Shaken Beef dish. We also ordered some of the fruit drinks that were well done. The mangos were fresh and the drinks weren't overly sweet.", "pics": null}}, {"review": {"des": "In regards to their bubble tea, Joy Yee is a Chinatown staple; they use fresh fruits for their smoothies and their tapioca is always perfectly cooked.<br><br>Even on a winter afternoon and a relative full restaurant, service was efficient. We stopped in after lunch and ordered a taro black milk tea with tapioca. I had actually never had their warm teas until today.<br><br>For two people to share, the quantity was plenty and the tea was the right temperature--not too hot for cold.  It also wasn't too sweet either although they do use taro powder like most, if not all, bubble tea shops.<br><br>I know I'll be coming back the next time I'm in Chinatown!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/CkVLqsPe-o_S9eTTGXaICg/348s.jpg", "caption": "The container and size of their warm milk teas"}]}}, {"review": {"des": "Pretty cool pan-Asian restaurant in Chicago's Chinatown!<br><br>For a restaurant with such an expansive menu, you'd think there would be many flaws in their dishes. Fortunately that was not the case, and the portions were huge! Even the lunch portions were plentiful!<br><br>I wish there was Joy Yee in Houston!", "pics": null}}, {"review": {"des": "Conveniently located in New Chinatown, Chicago, this restaurant is more known for its boba tea.<br><br>We had ordered their pho and also rose and taro milk tea that we enjoyed. The dishes here were huge so definitely well worth the price if you're on a budget. Food was decent, and we both enjoyed their drinks.", "pics": null}}, {"review": {"des": "They have all available toppings appropriate for a smoothie or bubble tea at an add-in price.  Once the healthiest smoothie made with real fruit.  Now, it's a hit/miss as the menu expanded with sugar-loaded smoothie especially the coffee and chocolate menu.<br><br>NO SEATING area for just smoothie/bubble tea.  :-(<br><br>As for FOOD, they are decent but overpriced compared to the just-as-good nearby specials in Chinatown.  Other Locations are reliably decent and better/best in its neighborhood.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/8nbtYZzr4B8Sijru2sk9ZQ/348s.jpg", "caption": "Vietnamese Ice Coffee with Add-in Coffee Jelly"}]}}, {"review": {"des": "This is my favorite place to eat whenever we visit China town. So much selection from real fruit smoothies to mouth watering dishes! Prices are a little pricey and adds up quickly. Portions are okay. Exterior is scummy but interior is neat and clean. Service is fast. Can't wait to be back!", "pics": null}}, {"review": {"des": "Joy Yee is undoubtedly famous for their boba drinks. I can agree that their drinks are delicious and the food was okay. The wait time and service need a lot of improvement. Have you ever sat at a restaurant so long that you're no longer hungry? Yea, it kinda happened that way, so it killed the entire experience, but overall it wasn't too bad.  The menu has sooooooooo much food it can be a little overwhelming.", "pics": null}}, {"review": {"des": "It's been a while Chicago. Joy Yee's holds a special place in my heart when growing up, I'd come to Chicago to visit my brother and we'd always swing by Joy Yee's for a nice order of boba. <br><br>FOOD: Boba. SOOO many options. Taro Milk Tea with Boba. The menu is extensive, so I wouldn't really worry about the lack of options. As other reviewers mentioned here, they do use fresh fruit and higher quality tea that can be easily tasted through the boba itself. <br><br>SERVICE: Mediocre, but I don't expect much with these types of establishments. <br><br>I've only eaten at Joy Yee's once and that was probably over 5 years ago. This time around passing by Chicago, we only got boba. I can't wait to come back to Chicago!", "pics": null}}, {"review": {"des": "Review only reflects drink orders. <br><br>What I like:<br>- Friendly cashier<br>- Can request for sweetness adjustments (for example, less or more sweetness)<br>- Real fruits<br>- Lots of options (extensive menu)", "pics": null}}, {"review": {"des": "There are some deciding factors of restaurants - namely, serving your clientele and serving delicious food. Joy Yee does serve large quantities of delectable goodies quickly. I've never been disappointed in their Malaysian green beans, their various attempts at fusion and representation of several different countries, and, of course, their boba.<br><br>However, today, I brought with me two people of unlikely company for whom I wanted to be gracious towards. Because they were of a different class, I saw heads turn, eyes open wide, and whispering commence. The manager proceeded to seat us 3 different times, as far away from the windows as possible because, I'm guessing, he didn't want possible patronage to see my guests. Their names are Pedro and Francisco. They stumbled upon a hard bit of luck, and I had the means and funds to support them. <br><br>Suffice to say, I asked for the bill early (and yes, I tipped the requisite amount so that people would stop staring and know that I had paid the bill). I tipped, in fact, over the service fee, because I could not stand the way people were treating two patrons just because of what they were wearing and how they looked. Servers seldom made eye contact, and there was maybe one server who kindly asked if everything was okay. I believe as human beings we all deserve respect. That was not served today at this restaurant, and I was very much disappointed. <br><br>I can not speak on behalf of my family, but I will not be frequenting this restaurant again. The food is decent, but the attitude? Not so.", "pics": null}}, {"review": {"des": "Was reallllly excited to this place cause I'm a boba addict. The menu was so extensive I had a really hard time choosing what I wanted to get! The line was really long so that's how I judge if a place is bound to be good or not.<br><br>I ended up getting watermelon slush with lychee jelly and it was bomb. My cousin got taro milk tea with boba. Her's was good too! I love the size of the cup and I had to take a picture!<br><br>They know what they're doing. Will def come here when I return to Chicago!", "pics": null}}, {"review": {"des": "Dropped by here for a quick boba run, their menu is extremely extensive. I ended up just sticking to a classic Taro Milk Tea. I didn't get boba because I was still full from lunch. I would probably recommend something else, the drink had too much ice and I couldn't really taste too much taro. I felt it was definitely a bit priced in comparison to what I have at home too.", "pics": null}}, {"review": {"des": "My friend and I happened to stumble on this place as we had planned on going to Mongolian hot pot but couldn't find parking....our second choice was Lao Sze Chuan but they were closed for re-construction. So we ended up here. I am so glad we did because they seated asap and the service was fast. I found odering off the menu so overwhelming... So many things to choose from and the menus was bigger than out tiny table. Lol<br><br>The food was good and the service was superb. I honestly do not recollect the name of what my girl friend and I ordered but it was good. <br><br>What i was most excited about were the smoothies we got at the end of the meal... they were delicious. I did think that were a bit expensive... $12 for two. Hmm <br><br>Will def be returning.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/JxxFU_C6WhZQlHTtMwSUQQ/168s.jpg", "caption": "Strawberry and Mango with tapioca. Love it $12"}]}}, {"review": {"des": "This place is good for Chinese dishes. I would not recommend getting any other Asian cuisine here except the Vietnamese dish - bo luc lac - aka shaking beef cubes and tomato rice. I recommend the seafood udon stir fry or the Malaysian fried rice.<br><br>Their menu is quite huge and overwhelming. Literally it's the size of my arm. They don't have ice in their water, which is quite annoying. I don't recommend their milk tea at the normal Joy Yee Noodle restaurant. Joy Yee Plus has better boba but is quite pricy.", "pics": null}}, {"review": {"des": "I wish I could give Joy Yee Noodle a 4/5 however, they've been increasing the prices of their smoothies and food. It's definitely not worth the money. <br><br>I can buy 3 entrees at Chi Cafe similar to the entrees at Joy Yee and it would cost less. I would not spend so much money on entrees I can get elsewhere. <br><br>However, I love their smoothies. There's aren't any other smoothie places I really like. They're one of the few restaurants that use real fruits to make their smoothies. Last summer, their price for a smoothie with bubbles was $5, but now it's $6 (just rounding). It's not worth spending that much money. <br><br>People love going to Joy Yee cause the smoothies are super sweet and addicting. However, I believe the smoothies can get too sweet since it's already sweet from the fruits itself. <br><br>Whenever I do visit Joy Yee for their dine in, I would order Beef Cubes over Tomato Rice and Korean Short Ribs. The Beef Cubes are $13 and the Lorean Short Ribs are $16. These are the only items I would ever really spend money on. The rest of the food there isn't worth the $13+. <br><br>Overall, if they lower their prices for the smoothies and some of their food items, I would go back.", "pics": null}}, {"review": {"des": "This place was so good that we had to come back twice during our 4-day trip. We only waited about 5-7 minutes to get our food after ordering (which is a great thing after a long day out and about in the city). <br><br>Food ordered: spicy basil fried rice (4.5/5), sautéed green beans (4.5/5), Korean BBQ short ribs (5/5), and stir fried seafood noodles (5/5). <br>*the spicy basil fried rice was a bit oily at the bottom on our visit, but was a lot better with less oil during our second visit*<br><br>The drinks we ordered were a bit watered down and bland. <br><br>Overall, we really enjoyed the service and food. Will definitely be back next time we are in town!", "pics": null}}, {"review": {"des": "Came in for a work related lunch. <br>This place handles large parties very well. <br>Service was great, food was good, you definitely get plenty, and get your moneys worth. <br>Menu is extensive, sure you'll find something you like. <br>I got a fruit lemonade which was very good. <br>Have to come back once I decide on what kind of smoothie I want because it's that many to choose from. They validate if you park in the lot as well. <br>I'm happy!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/XC_waypKnJ4CsXn4thWgWQ/168s.jpg", "caption": "Pineapple Lemonade"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/UY4A2pzXlku7zjXGhfUNZA/168s.jpg", "caption": "Teriyaki Chicken Hot Plate"}]}}, {"review": {"des": "11 dollars Pho with tons of beef. Cannot complaint about it. The only thing I dislike is the noddle, not chewy at all.", "pics": null}}, {"review": {"des": "You cannot sit in if you only order a drink! It's an order at the counter service and go. The cashier woman wasn't friendly but the service was pretty quick. <br><br>I only ordered an oolong milk tea. Even requesting for little ice and less sugar, I still got about half a cup full of ice and the drink was pretty sweet. There was actually no oolong taste either..it was like drinking diluted milk + sugar. Maybe I should have gone with a regular milk tea? I don't see myself going back anytime soon.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/OkPHjw124_HWcU3rcAAhow/168s.jpg", "caption": "Interior which you can't sit at if you only order a drink"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/D5WBtmBmZXBnPyL8SXKUww/168s.jpg", "caption": "Oolong black milk tea"}]}}, {"review": {"des": "MMMMMM more boba from Chicago! But this time it's from @joyyeenoodle. We ordered the Lychee Berry and the Passion Butterfly. My drink was pretty good, but I couldn't finish it in one sitting because it was too sweet I did, however, finish it the next day", "pics": null}}, {"review": {"des": "If you want cheap but big portion dishes, especially if you are hungry, I recommend going to Joy Yee's in Chinatown. The food is ok. You won't be impressed but you won't be disappointed. It's definitely better than Panda Express, but you won't say Joy Yee is the authentic Chinese restaurant. It's a fusion of Korean, Japanese, Vietnamese, and Chinese.  <br>It's super crowded all the time, especially if you are trying to get the bubble tea. In summer, the line outside for the drink is 15 to 20 minutes for a drink.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/8t5NbVzDUvp3nrTUFV0MxA/348s.jpg", "caption": "Mango"}]}}, {"review": {"des": "Disclaimer: my review is only for the bubble tea/boba. I can't speak for the food.<br><br>Bubble tea here only comes in one size - a short, obnoxious cup that you cannot comfortably grasp or fit in a traditional car cup holder. Yeah, they look cool at first glace and for pictures I guess but the novelty dies off fast. The \"mini pearls\" here are actually basil seeds. Mini pearls are a totally different thing - I'm not sure why Joy Yee calls basil seeds \"mini pearls\"... I opted for the passionfruit green tea and it was awful. The flavor was totally off. Not good tea at all.  It was so bad that I did not finish it. I practically threw $5 in the trash.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/7XSaGRAiKUdahnsPk7I8gQ/348s.jpg", "caption": "Passionfruit green tea with \"mini pearls\" aka basil seeds..."}]}}, {"review": {"des": "I am rating this strictly based on my experience getting a freeze from the window. Some friends and I stopped here spontaneously. It was a pretty steamy summer day, a cute girl was playing violin in the square, and there was a huge crowd outside of Joy Yee at the walk-up window. We saw Joy Yee had a huuuuge menu of various boba/bubble teas. They have fruit flavors, coffee, chocolate, matcha, green tea, lychee, and on and on. <br><br>Despite the crowd, the ordering system was extremely fast. I recommend deciding on what you want before you get in line because it does move deceivingly quick. We ordered a green tea freeze and two mocha freezes with boba. The cups are as tall as a Starbuck's grande cup and two or three times as wide. Large size for a reasonable price.<br><br>This is definitely a great summer treat. We drank all of ours up. I will be returning.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/94BizHOSfXhG3-ft-pFfxw/348s.jpg", "caption": "Mocha w/ boba: great for a toasty summer day"}]}}, {"review": {"des": "The boba tea we got was not very good. We asked if we could exchange it. The guy at the counter said he could adjust the drink we had. He adjusted it. It still was not good. We asked him to switch it again. He said he would remake the first drink. He remade it without our confirmation. He just handed us the drink as if he was tired of us. <br><br>Not sure why he couldn't just switch the drink instead of going to all that wasted effort resulting in an unhappy customer. <br><br>Not very accommodating for the the price. <br><br>Bad customer service. <br><br>Not a good experience. <br><br>We threw the drink away and went to Hello Jasmine. <br><br>Hello Jasmine tasted so much better and had much better customer service", "pics": null}}, {"review": {"des": "This review is solely on the milk tea I had from Joy Yee. I am a regular visitor to ChinaTown on every trip to Chicago and I have always seen huge lines at their tea and smoothie counter. I am not a big fan of the bubble tea and hence always passed by this place thinking it is just another bubble tea place. But I stand corrected. After having a rather spicy hot pot, I longed for something sweet and I finally made my way to this place. They have a wide variety of teas and smoothies. I settled for the Lavender Green Milk Tea. Service was prompt. And the drink was heavenly and very refreshing. The best part was they ask if you would like tapioca or not in your drink which just let me have the tea. I will be back for trying the other milk teas on my next trip.", "pics": null}}, {"review": {"des": "Joy Yee's was one of my favorite places to eat while visiting Chicago because this place just hits home! First, this place is located in Chinatown (which is much smaller and cleaner than any Chinatown I've ever been to). There's metered parking around the block nearby which is free after 10pm, but Joy Yee closes around 10:30pm so.. I don't recommend coming at 10.<br><br>The space is big, they have cushioned booths which I appreciate. The interior is well lit and surprisingly clean. For those who come only for their famous bubble tea in the stubby cup, you could either come in and order immediately at the counter or they have a window outside where you could order. The drink menu is extensive and so is the food menu, BTW did I mention the menu ITSELF is jusT HUGE?! They have everything from combo dishes (meat & rice) to noodle dishes (with and without soup), to fried rice dishes, and basically anything Chinese you could come up with. During my stay in Chicago, I came here twice.<br><br>I tried the beef brisket pho here, the mango fried rice, and pan fried noodles with chicken. I also tried two of their bubble teas which I forgot exactly what they were but I attest they were both delicious. The beef brisket pho is probably the best pho here (though I've only had two to compare). The soup base is flavourful without srircha or hoisan sauce and the meat is tender as well. The mango fried rice was very unique and probably my favorite. The mix of salty and sweet left me watering for every bite! The pan fried noodles were a little on the dry side, but not terrible. The price here is really cheap, all four items costing less than $30 (I would say the portions are generous) so it's really hard to be picky when the food isn't \"PERFECT\"<br><br>I wish I was able to go to Joy Yee's one last time before leaving Chicago.. but, :( Until next time ...", "pics": null}}, {"review": {"des": "This is one of my favorite bubble tea places in Chicago but their service is disappointing. First, we asked to add tapioca to our orders. The cashier then told us they didn't have anymore.  Little did they know that we speak Cantonese and we heard one of the workers tell her that there was a tub of tapioca left. Ok fine, first offence I'll let it go. <br><br>Second, they charged us a few extra dollars for our orders, which we only saw when we saw the receipt. We asked the cashier about it and they refused to refund us the money, claiming that the teas were actually more expensive than we saw on the menu because they didn't change the menu prices to reflect the new prices. Another worker claimed that prices can change without notice. UM WHY DON'T YOU TELL US  WHEN WE'RE PAYING??? This is blatant bs. <br><br>Guess I'll have to find another place.", "pics": null}}, {"review": {"des": "Trust me, I like their food and I love their smoothies but a lot of these restaurants in this plaza practice very poor hygiene. I went to use the bathroom and happened to notice this afterwards. This is just not okay. This place<br>looks like they make enough money to address this issue so I'm going to assume that they just don't care. Fix it Jesus!<br><br>Literally three huge roaches and plenty of babies were right under the light fixture in the women's restroom. <br>Do the employees not use this restroom? I'm so glad I didn't order any food because the kitchen is literally right across the hall.", "pics": null}}, {"review": {"des": "I was bummed when I got to Chinatown and found that MingHin was already closed for the day. The hours on their Yelp page are incorrect! With the help of the Yelp app, my friend and I decided to go to Joy Yee.<br><br>It seemed like half of the time we spent at the restaurant was dedicated to looking through the menu. It's huge! I had been wanting noodles for a while, so I eventually picked one of the Thai noodle dishes. It looked so good when the server brought it out! It was hot, and there were veggies mixed in with the beef and noodles. Unfortunately, I thought it tasted pretty bland. It definitely could've used more flavor. And I thought it was a bit overpriced.<br><br>However, I'd return for the drinks! I don't think I'd ever seen such an extensive menu for boba before. It's a bit overwhelming, but I like having options. Since it was a hot day, I picked one of the freeze drinks. I didn't want one that was going to be overly sweet, so I got lychee watermelon. It was just what I was looking for! It was refreshing and light. My friend got a mango freeze, and she loved her drink too.<br><br>Go here for the drinks, but skip the food!", "pics": null}}, {"review": {"des": "My friends and I stopped by here for lunch twice in 2 days after hearing about the famous drinks that they serve at this place. We later noticed that they also serve Pan-Asian food so we settled here for food as well. <br><br>The service here was fast and efficient as our food were out relatively quickly despite the fact that we had a party of 11 on our second visit here. Be warned that the portion sizes here are humongous and they even use pushcarts to deliver your food to you! <br><br>For drinks, I had the strawberry milk tea with regular black bubbles and popping bubbles and the jackfruit freeze with mango pudding. The strawberry milk tea was a bit on the sweet side and I was overwhelmed by the taste of the strawberry syrup. The jackfruit freeze on the other hand, was delicious. I'd definitely order it again and highly recommend it. <br><br>Both entrees that I ordered was absolutely delicious as well. The Korean seafood noodle soup had just the right amount of spiciness to it, while the jumbo pho was on-point.  <br><br>Would I be back in the future? Definitely.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/htA5sx6N7lm2fgEyCCSW9Q/348s.jpg", "caption": "Jumbo pho- demolished!"}]}}, {"review": {"des": "We were visiting Chinatown and wanted a nice, sweet and cold smoothie and decided on this shop. We loved this little place! We had a delicious peach mango smoothie. Great atmosphere with unique, delicious smoothies.", "pics": null}}, {"review": {"des": "Every one I know who goes to Chicago has to hit this place up when they are there. I wanted to see what all the hype was about.<br><br>The restaurant was really crowded so I thought it would be good, but for me the food was too salty. There were so many choices it's really hard to choose, but I ended up going with the Garlic Shrimp Soft Pasta. The bubble was really good though. <br><br>I would go again for the bubble but not so sure about the food.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/1Hxq6gLGZUf8u1hwReA9sA/348s.jpg", "caption": "Pho"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/mbTmkGRW_3aL_Zhrv3M5Ow/168s.jpg", "caption": "Tomatoe Beef Cubes"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/iO73rmV5FfZtAcvd4DD_QQ/168s.jpg", "caption": "Garlic Shrimp Soft Pasta"}]}}, {"review": {"des": "I would rate this Joy Yee's as 3/5 for the food and milk tea, and 5/5 for the service and short wait time. The menu is super overwhelming, with more options than you could ever ask for in a single restaurant. Don't be intimidated, just go by the pictures for menu items if you want to narrow down what you want to eat. They stay true to the \"Pan Asian\" in their name, with dishes from Vietnamese, Korean, Japanese, and Thai cuisine. By virtue of the restaurant being Pan Asian, they don't do any particular cuisine spectacularly well, but they can impressively get the gist of the dish and bring it out in the time it takes for fast food restaurants to prepare your food.<br><br>As you walk into the revolving door, you'll be greeted by an employee who will ask you the number of people in your party and have you seated at the corresponding table. The interior is bright and very much modern, with lots of yellow decor. The crowd is on the younger side, predominantly Asian because this is located in the heart of Chinatown Chicago. Our server was very attentive, providing us water, refilling it, taking our orders, and giving us a to go box and the check all promptly. <br><br>I ordered the Chinese chicken thin noodle soup and my friend ordered the pork fried rice. There was so much chicken breast in my soup, and the noodles were delicious, but the broth could have been more flavorful. I was impressed with the fried rice though, because it had the smoky flavor of having been fried in a wok and was reasonably seasoned. The oolong milk tea that I had was good, wish the tea was a little stronger since it tasted watered down, but I appreciated that it wasn't made from powder, unlike other places I've tried near Chicago. Also the boba size here is ginormous. <br><br>While this place is relatively cheap, I think that it should be a little cheaper considering the casual nature of the restaurant, but overall a nice place for lunch, dinner, or a quick bite in Chinatown!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/2fuDUFeRUe7V3NeCCDC1RA/168s.jpg", "caption": "Chinese Chicken Thin Noodle Soup."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/FfJfXJuRAJQePLVykYKKDA/168s.jpg", "caption": "Pork fried rice."}]}}, {"review": {"des": "The Manager May Assume because I am White But i speak fluent Cantonese that i didn't know a certain fruit drink was which was badFung Shui!!!!!!!!! She should of offer me a free drink..and or a discount!", "pics": null}}, {"review": {"des": "What can I say about Joy Yee that hasn't already been said? They changed the cup shape for bubble tea recently and now it's fatter but squatter and shorter, it doesn't fit in the traditional cup holder in a car anymore :( still at 24 ounces, I wish they offered a half size. We got the honey dew freeze, mango passionfruit, and strawberry. They use real fruit which is good considering the hefty $5 price tags! I have also dined in before, and the following are good: beef cube tomato rice, kalbi, French style beef, curry soft shell crab stone bowl rice with chicken. <br><br>My friends and I always said, joy yee is the expensive pan Asian option that you go to when your group can't decide on what type of authentic Asian cuisine you want in Chinatown :P", "pics": null}}, {"review": {"des": "Whenever I'm in Chicago, I find myself in Chinatown eating at Joyee and sipping on one of their bobas. It's in the heart of Chinatown and they have two floors. If you're just lookin for some boba they have an outdoor window people can order from. Inside they decor is abstract and simple. The menu is very, very large and sometimes it's hard to choose what you want. The lunch menu is very easy to narrow things down and pick.<br><br>The green curry is delicious and the fried rice is also tasty. If you want to stop for a quick and simple chinese meal, this would be the place to do it.<br><br>Tip: Park at the metered spots and get a validation ticket from the restaurants. It's only $2. Saves you trouble from looking for spots to park.", "pics": null}}, {"review": {"des": "Okay so first impressions go a long way with me. Not a very busy night as far as tables go and me and my daughter (6) walk in and wait to be seated. Several servers are standing around watching tables and I can see three open clean tables. So we continue to wait as staff avoids eye contact. Que the white couple walking in maybe 10 mins after us all of a sudden the servers can see they didn't have a full chance to get in the door before the server tried dragging them to a table.... I speak up and we are seated... waiting again no one to take our order....we get up to leave aha there he (no name given) we order anyway this is my daughter's first time to Chinatown I don't want her to be upset as she doesn't understand..... basically if your black you probably won't get treated well here. There was more but that's enough for me.", "pics": null}}, {"review": {"des": "Just went for Boba and wasn't disappointed.  The drink area is a little crowded but the drinks were yummy and made quickly.", "pics": null}}, {"review": {"des": "This place is inconspicuous and one day, we just happened to bump into it as we were searching for a place with noodle soup. We got the spicy lamb noodle soup, which medium thickness noodle. They claim they make their own noodles- and I tell you, Boy, was it REALLY good ! The soup was VERY flavorful, portion was HUGE but trust me, you can finish it as you just cannot stop shoving the chewy, bouncy, soft noodle into your mouth as you greedily slurp on the broth. <br>The milk tea also comes in a HUGE serving but I didn't think it was that exceptional. The xiao long bao that is hand made by the restaurant (visible from the window) is a miss. The skin is thick, and it isn't that flavorful. Unless you are dying for xiao long pao, I suggest you skip it and just go for the noodle dishes.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/2q2zFJYQZdHk6K_MxjLpzA/168s.jpg", "caption": "Large portion of yummy delicious noodle soup"}]}}, {"review": {"des": "Today was my first time eating at Joy Yee Noodle in Chicago's Chinatown, and we were all very satisfied after our lunch here. Let me start by saying this menu is HUGE!! I don't think I've ever been to an Asian restaurant with as big a menu as this place. The foods range from Chinese, Vietnamese, Thai, Korean, Japanese, and all kinds of tapioca drinks. Our table ordered family style so we could try a little bit of everything, and luckily we came during their lunch specials time. The lunch special plates are huge and enough to feed 2 people each plus they come with soup and an eggroll. We tried their spicy garlic Japanese pork on hot plate, shrimp basil fried rice, beef cubes over tomato rice, chicken teriyaki rice bowl with an egg, red curry chicken, stir fried shrimp in garlic sauce, and their beef lo mein. Even though there were 5 of us at the table, our eyes were definitely bigger than our stomach. But we gladly took home the leftovers for dinner. My personal favorite was the beef cubes over tomato rice, otherwise known in Vietnamese as Bo Luc Lac. The beef was very tender, juicy, and full of umami. Then the tomato rice was the perfect compliment to the succulent, tender cubes of beef. Normally whenever you find a restaurant with as big a menu as Joy Yee Noodle, you'd expect the quality to suffer because they have so many dishes to master. Luckily this restaurant proved me wrong, and is one of the best restaurants in Chicago's famous Chinatown. I will most definitely come back here again from Houston.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ppeuv5hoXDU_8vgnrtegpQ/348s.jpg", "caption": "Huge portions are a plus here"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/bRILMChgo7VxMxlzp4mc5g/168s.jpg", "caption": "Spicy garlic Japanese pork on hot plate"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/3Tq0m2RiKPZfXlO3QTcQKw/168s.jpg", "caption": "Garlic shrimp stir fry, beef lo mein, and red curry chicken"}]}}, {"review": {"des": "Visiting from Texas and there are too many restaurants to choose from in China town, but I'm so glad I chose this place! Everything my boyfriend and I ordered was delicious! (Mussels, rice plate, lo mein, hot and sour soup). The foods come out in cute dishes. I ordered a passion fruit green tea with lychee jelly and the lychee tasted fresh! There are hundreds of food items on the menu and one thing I really liked was that they had photos for every food item! I've never seen that anywhere<br><br>Our waitress wasn't friendly. No smile or greeting. Made us kind of want to leave being out first time there. I felt rushed when trying to figure out what to order but glad we stayed because everything we ordered was delicious anyway :)", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/40o11hjrngUq01jrfcOXCw/168s.jpg", "caption": "Passion fruit green tea with mixed fruit jelly and lychee jelly"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/GyhOpO1zKrQAAhfl_YP2qw/168s.jpg", "caption": "Mussels"}]}}, {"review": {"des": "I've been coming here since the original location (where the Shabu Shabu is located) and I can honestly say the place is decent. From the drinks to the cuisine. If I have friends or guests coming from another place, this is a \"staple spot\" that I recommend. I let my friends give their own opinion on the spot rather than my own bias and the rest of the city's bias.", "pics": null}}, {"review": {"des": "Anothaaa great spot in Chinatown. The menu here is INSANE. I've never seen thiiiiiis many options in my life. Spring rolls? Kung pao chicken? Lo mein? You name it, they have it. Not only do they serve Chinese food but they also have a variety of other Asian dishes including pad Thai and Korean BBQ short ribs. The best part about their menu is that they include pictures!<br><br>We ordered the:<br>- Fried gyoza (10 pieces)<br>- Vietnamese B platter (came with sugar cane shrimp, chicken wings, lemongrass pork, rice noodles, and some pickled vegetables)<br>- Stir-fry udon w/ beef brisket<br>- Schezwan beef<br>- Pho<br><br>The stir-fry udon w/ beef brisket was SOLID. My favorite out of all the dishes we ordered. The fried gyoza and Schezwan beef were pretty good as well. However, I'll pass on the Vietnamese platter next time. It's enormous but I didn't think it was really worth $18. I didn't try the pho, so can't really say anything about it except that I thought it was kind of weird that they put radish in it.<br><br>After our meal, we decided to get bubble tea. I chose the taro (my go-to flavor at any boba shop) and instantly regretted it after I took a sip. It wasn't good at all, and I ended up throwing the rest away. I'm usually not too picky but the flavor was completely off. Waste of $6. On our way out, I noticed that they used fresh fruits like strawberries and mangoes, which I wish I would have known so I would have ordered one of those flavors instead. The tapioca however were great. Chewy and soft. I will be back to try a different flavor!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/hTtwkgG2bxJGmxwxWH4EUg/168s.jpg", "caption": "Vietnamese B platter"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/xNfgkvveRp0--282_MgBsA/168s.jpg", "caption": "Beer brisket stir fry udon noodle & spicy Szechwan beef"}]}}, {"review": {"des": "Situated in Chinatown, Joy Yee provides a plethora of options to chose from. Ranging from rice platters to noodle soups, Joy Yee has it all. There is an upstairs and downstairs, both of which were packed by the time we started eating. <br>I ordered the chicken seafood noodle soup which had nice and thick noodles that were very soft. <br><br>For the price point, I would say Joy Yee is pretty worth.", "pics": null}}, {"review": {"des": "Usually when I come to Chinatown, I go for dim sum at MingHin, but it was so crowded I just sat down at Joy Yee. I was pleasantly surprised by my eel stone bowl! They could definitely stand to add in some more veggies but for the price I was happy with the flavor and portion size!<br>The whole establishment is very clean and modern, so it doesn't feel like it would deliver a non commercial, authentic flavor, but I thought the food was great. I'll come back if I want a quick eat.", "pics": null}}, {"review": {"des": "This review is for bubble tea only: <br><br>Whenever my family and I end up in Chinatown, our post dim sum or dinner will always be Joy Yee bubble tea! Their drinks menu is expansive, and they use fresh fruit which often edges out the other competition as most use bubble tea powder. My personal favorites are the strawberry, taro, or avocado w/ boba! Don't let the avocado bubble tea weird you out. It's fantastic: very rich and smooth but also sweet. <br><br>This location is fantastic for warmer weather as they have a walk up drinks window. However, during the colder months, there is an unfortunate lack of seating if you are only ordering drinks. <br><br>Overall, Joy Yee is a personal favorite and will always be a family tradition. While I can't speak for the food, their drinks are large, tasty, and definitely worth the $5!", "pics": null}}, {"review": {"des": "Large portions, but only ok flavor. We got pho and bun cha gio, plus rose milk tea. Would not recommend the rose tea. We were excited to try based on a friend's recc, but too much rose and very sweet. Felt like we were bothering our server. For example, tossing the check on the table despite not being busy. For a place that looks so authentically grimy,  it was not very good.", "pics": null}}, {"review": {"des": "I have gone here every time we spend a mini vacay in chi town, and it's usually a hit or miss on their drinks. I felt when we first arrived and dined in, we had soups and drinks were awesome. I had the apple cooler lychee, to me it was a apple jolly rancher spritzer. Honestly phenomenal for a hot day. We had a soup very close to pho except I was confused when the server ask for traditional noodles or rice noodles. I asked for rice and I got vermicelli noodles, just a heads up. We got the salt and pepper squid, the tentacles were HUGE and I mean fat on steriods. The salt and pepper seasoning was so bad for you but omg so goooood. <br><br>Came back on our last day of our trip and ordered drinks through their outside window, waited maybe 5-10 mins and I swear all of our groups drinks were gross. We all had everything from milk tea to smoothies and it lacked the fruit flavor. I ordered a strawberry sprite, thinking it was an infused flavor sprite, nope. Watered down FLAT sprite with some chunks of sour ass strawberries. Cmon!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/E5OmUwIpZYiN4GOafW-tmg/168s.jpg", "caption": "Apple cooler lychee, you won't regret it"}]}}, {"review": {"des": "Thanks to my friend I've finally experienced another bubble tea spot in Chicago! The bubble tea I got was in a giant form and I love how I can personalize my level of sweetness. I also love the convenience of ordering from here!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/VvmhSUmWyiubw8vipTS1Sw/348s.jpg", "caption": "Rose green milk tea with tapioca bubbles!"}]}}, {"review": {"des": "I have only enjoyed their tapioca freezes.  Everything is made with fresh fruit and I usually get the mango, or strawberry.  I tried a kiwi one once and the seeds were more problematic than I would have imagined.  There is usually a long line for the drinks, but it moves pretty fast.", "pics": null}}, {"review": {"des": "I'm never disappointed when I order from Joy Yee! Delivery or dining in- I frequent this establishment because the prompt customer service and of course the delicious food! Order now, my favs are the Mongolian beef, mango chicken fried rice, beef and chicken/pork dumplings, and the strawberry banana fruit freeze with tapioca!", "pics": null}}, {"review": {"des": "A friend recommend this place and I LOVE it! So many options to choose from! I went ahead and went for my first choice since the selections were getting me overwhelm. I order the watermelon soda bomb and at first sip, it made me feel so refresh! I couldn't believe how delicious it was. This is probably the best way to drink water with some sparkling fizz and also eat your fruit at the same time. This place by far is my FAVE. It just sucks that they're only located in Chicago. If you get stuck choosing what you want to drink, my tip is go with what catches your eye or do the familiar drink.", "pics": null}}, {"review": {"des": "I would give this place a try.<br><br>Service: The service was good and they were very tentative. It was a little awkward when they are standing there watching you eat waiting for you to need something, but it was overall good service. They were even nice enough to offer a young gentlemen an outlet to charge his phone (I know, who doesn't have a portable phone charger).<br><br>Food: I would recommend getting a noodle dish and NOT a rice dish. In addition, grab a drink...it's really good and refreshing.", "pics": null}}, {"review": {"des": "I love their bubble tea here! Their oolong tea wirh brown sugar boba is just the best! Make sure you get no sweetener bc boba is already sweet! The lines vary but if long, goes fast.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/K9wKW_yDyjStuCzJga8M-A/348s.jpg", "caption": "Bubble tea"}]}}, {"review": {"des": "Great smoothie combinations with exotic fruits and amazing boboa.<br><br>Love the seaweed salad, Korean dumplings, chow funn noodles,", "pics": null}}, {"review": {"des": "BEWARE OF THE MENU. If you haven't been here before, please brace yourself before looking at the menu. I truly believe that this will be the downfall of this place.  They should really cut the menu in half, literally, as in the menu physically is so big, but also they just have too many items. Instead of trying to have every item on the menu they should focus on perfecting more of them. Quality over quantity!! <br><br>With that being said, I ordered the brisket chow udon. It looked delicious when it got to my table but after tasting it, it was really mediocre. The beef was overcooked and there was an overload of onions. The only good part was the noodles and there was so much that it was difficult to even pick up since they were all stuck together.  Drinkwise I ordered a passion fruit green tea with tapioca (boba) and mini  tapioca (basil seeds). I don't really know why they refer to the basil seeds as tapioca. For those who don't know what basil seeds are, they're a bit like chia seeds but more chewy. The drink was delicious and they use fresh fruits so I would suggest ordering something with fruit in it while you're here!!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Pi3aNmKIqMr-du1p4rpQXQ/348s.jpg", "caption": "Beef Brisket Chow Udon"}]}}, {"review": {"des": "Food was great. Very delicious, but service was way too lack luster. I was there with two others and we asked for water and more napkins and no one attended, not even our server which we politely asked. It wasnt till we were done with our food that they brought us napkins and water. I tend to tip accordingly to service always. Good service=good tip. Bad service=Bad or no tip. We decide to leave a bad tip.  And the server got upset because we didnt want tip at least 20%. If she would have attended politely and brought us our request it would have been an easy 40% tip. But nope.", "pics": null}}, {"review": {"des": "Best bubble tea and fruit freezes around. They use real fruit, have tons of flavor combos and add-ins such as jellies or tapioca pearls, and the tapioca/boba is always perfectly saturated-never too dry or soft. As for food, it is fairly americanized but portions are large and it's pretty good. <br><br>When I come to Chinatown I typically prefer to eat somewhere else but stopping at joy yee for boba is a MUST!!", "pics": null}}, {"review": {"des": "Okay food I guess.  I ordered the beef brisket pho and never got it. Drinks are good.  Lots of other options in Chinatown", "pics": null}}, {"review": {"des": "Joy Yee is a must try if you are in Chicago.  They have a diverse selection of drinks and they have the jumbo pho which is extremely good and filling.  Keep in mind that they say it can serve 2-4 people.  Don't try to get the jumbo pho for each person.  The restaurant also has a nice yellow-ish theme to it, if you're into that color.  You can also get take out.", "pics": null}}, {"review": {"des": "One of the best bubble tea places, you can taste the real fruits. The food here was good as well", "pics": null}}, {"review": {"des": "Joy Yee's food is definitely difficult to find fault with, and their flavors are pretty on point. <br>Ordered the beef pho and the beef shabu shabu the other day, and was surprised to find out that their soups tasted...very similar (not sure if that was done on purpose or not), but I definitely did miss the vietnamese pho experience of placing your own jalapeños, bean sprouts , and lime into the soup yourself. <br><br>Was probably the busiest place to eat in all of Chinatown that night (every single seat was filled and there was a huge line outside for their bubble tea).<br><br>Very non-offending place with huge quantities, only issue I had with this is they clearly cater to the Americanized taste - not saying its bad, but it just misses that authentic feel (and flavor) to their foods (this comes after visiting this place several times and trying some of their other vegetable/chicken dishes on the  menu)", "pics": null}}, {"review": {"des": "Love coming here.  I always stop in when I come to Chicago.  The location in Evanston isn't bad either.  <br><br>The food is pretty good, but I come for the boba tea.  I always get two.  One while I eat and one to go.  I like the lychee watermelon freeze!  It's so refreshing during the summer.  I like to get it with the popping boba.", "pics": null}}, {"review": {"des": "Food was excellent. Large quantities. Definitely able to share. Busy. Downtown stairs appeared to be recently updated. Upstairs was nice just not as updated. Overall, great experience and great for families. Smoothies were amazing!", "pics": null}}]}