{"name": "kai-zan-chicago", "reviews": [{"review": {"des": "16!!! That is the number of times I've enjoyed the Kai Zan experience. <br><br>I am blown away that I've never posted a review. It seriously makes no sense. <br><br>From my very first visit, top notch, absolutely divine service and taste. <br><br>After 16 visits, I can safely say I've tasted everything offered on the regular Omakase and standard menu and nothing disappoints! That is not hyperbole, nothing here disappoints. <br><br>The early bird (tues/wed) special is a great way to sample some of the standard Omakase's highlights. <br><br>For those in your party that don't LOVE sushi, there are a number of delectables on the menu. Think Karaage, Yakitori-style skewers (Yum mushroom!!!)<br><br>Because the ingredients and menus change (especially the Premium Omakase) I have never once been bored, underwhelmed or felt like I could have passed on any given bite. <br><br>Service: One of my favorite servers/waiters is usually in the building, being dope. <br><br>Seating: Cozy and cute. Two to Three person booths to the right, large group booths (GORGEOUS) to the left. Extra fun sitting at the sushi bar watching the Chefs make magic. <br><br>Gotta end this ramble to book Sweetest 17!", "pics": null}}, {"review": {"des": "This establishment has been around for about 6 years, recently expanded the property by occupying the space next door. It is has a very fun and intimate setting. A bar that sits about 6-8 guest comfortably, a few tables, and on the other side, private intimate tables that sit about 6 guests comfortably, probably up to 8 if necessary. <br><br>The food here is good, but I'd like to say that the experience I had here, was much more like a Kaiseki meal rather than omakase sushi, in which they choose to call it. Kaiseki is traditional multi-course Japanese dinner, and this is more like that than sushi. A variety of appetizers and fish dishes. They did offer soy sauce, which we declined. <br><br>There are two levels of the meal, although we originally booked for the higher one, after seeing the menu, we determined it was way too much food for us to consume.<br><br>First Dish: Madai Carpaccio<br>- Japanese red snapper with toro, tobiko, dressed with olive oil and basil. Very delicious, I almost asked for extra, but I needed to be patient respectful of our meal. <br><br>Second Dish: Escolar Maguro Pearls <br>-Seared tuna and escolar dressed with scallions, truffle oil, and spicy mayo. Cute bite, alot of rich flavors going on<br><br>Third Dish: Angry Crab<br>- Spicy crab rapped in tuna, topped with tuna and spicy mayo. I wasn't a big fan of this one, I wanted to see fresh crab meat<br><br>Fourth Dish: Shooters<br>- two shooters with oysters, scallpops quail egg and tobiko. Cold and refreshing. Fiance loved, and he usually does not like shooters <br><br>Fifth Dish: Orange Rush<br>- Seared scallop, seared salmon with a dressing (orange?). This was delightful. The scallop was sweet and yummy. <br><br>Sixth Dish: Tuna Dashi<br>- Warm dashi broth with tuna, shiitake mushroom, little neck clams. Warm and delightful<br><br>Seventh Dish: Main one!<br>- Shrimp, Char Sui(like pork belly), Tako Yaki, Tako Wasabi. I did not like tako wasabi at all, but my fiance loved it, so we traded aha, the other dishes were unique <br><br>8th Dish: Fiesta Maki <br>-Salmon tuna avocado chili oil. This was like... a sushi roll. wasn't expecting that ...<br><br>9th Dish: Dynamite mussel<br>- your usual (single) grilled dynamite mussel with masago and spicy mayo <br><br>10th Dish: Sashimi<br>- Assorted fishes, Tuna, Salmon, Yellowtail, Nothing japanese imported or that exquisite.<br><br>He tossed in a few extra dishes on the house, but nothing highlighted to me.<br><br>It was a decent dinner, quite full, but wouldn't return. I would say it is a wonderful establishment, great pricing, and good to try. But I have traveled and always seek for omakase OR Kaiseki. I think they should reconsider that they are implying if they are going to say that they are serving Omakase, I understand omakase means leave it up to the chef, but this menu was pretty pre-set. Omakase shouldn't be pulled from the menu or preset, should always be seasonal. <br><br>Now this place is good, indeed. But when it comes to omakase, I would like the food to seem exceptional.", "pics": null}}, {"review": {"des": "Oh my goodness.  This is the second time I've been here and this is hands down the best sushi I've experienced in Chicago.  Even though I don't live in Chi-town anymore, I did for 6 years and I eat sushi like a fiend.  It is not cheap here but you have to pay to play and the raw fish will dance with you like you've never danced before.<br><br>This combines the best of extremely fresh, elegant fish, with amazingly skilled chefs and creative fusion concepts.  <br><br>Live a little and go for the New Omakase. Trust me you won't regret it!<br><br>Protip: even though they serve liquor they are still BYO and at a $15 corkage for 2 bottles it is very reasonable for the caliber of the place.  The liquor store across the street carries craft large bottle beers (e.g. Delirium or Unibroue) and a chilled sparkling Hitachino sake.  That makes an awesome compliment for the awesome food.", "pics": null}}, {"review": {"des": "So. Good. Took my husband here for his birthday recently and had the chance to try their premium omakase--definitely worth it. And for the amount of (quality) food you get, the price point is really not bad at all! Take note that this is not a traditional/authentic omakase--felt more like a prix fixe menu centered around raw fish/meat (nothing to complain about here though). Every course was perfection and super unique. Our favorites were the wagyu & toro nigiri.", "pics": null}}, {"review": {"des": "Wow! This was my first time experiencing Omakase style sushi dinner. This was also my first time dining at Kai Zan. I was looking for a really good sushi restaurant to celebrate my birthday. At first I couldn't get a reservation but called the restaurant to add my name to the waiting list. They called me asking if I was still interested for a table or 5 for 7:15 pm. I was so excited and reserved the table with a credit card. Kai Zan will charge your card if you cancel. <br><br>The service was excellent. The servers did a great job explaining the menu. Being that my party was new to Kai Zan our server recommended we do the Omakase at $65 per person for 10 courses. We agreed. They did a great job explaining the dishes. <br><br>I really enjoyed all the courses. I enjoyed the Asian fusion flare added to the meal. I really don't know how to explain it but omakase is NOT the sushi dinner consisting of orders a spicy tuna roll, shrimp tempura roll and few salmon and tuna nigiri. We did order a salmon roll afterwards bc some of us were still hungry. <br><br>We also ordered a bottle of champagne and I ordered sake. Can't remember the name of the sake but I really enjoyed it. We also ended the meal with in house made Ube Mochi, strawberry mochi, and mango mochi. <br><br>I'm very glad I got the chance to try Kai Zan and I highly recommend.<br><br>The only disappointment I had was our server didn't acknowledge my birthday at all even though it was noted on our reservation. The hostess did greet us and said happy birthday but when we ordered dessert there was no candle or anything to wish me a happy birthday. Also the bathrooms were a bit dirty which was a disappointment. For those reasons I couldn't give 5 Stars", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/n6qMCWWjbBBsZzq3i5dzrQ/348s.jpg", "caption": "Ube, Strawberry, Mango Mochi"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/fkvlC2px7YU4lYj3RsclIA/168s.jpg", "caption": "We asked for a salmon roll and chef prepared this"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/OkbBnfjgzHnENcOU02Ne0g/168s.jpg", "caption": "Omakase - 10th course Sashimi"}]}}, {"review": {"des": "I was in love with this restaurant when I was living in Indiana and was starved of decent sushi for months. Return visit had me come back down to earth.<br><br>Unfortunately, they were out of our absolute favourite menu item with the eskimo clouds. The regular omakase is roughly the same. Not really an omakase, treat it more like a tasting menu.<br><br>It's a lot of food at a reasonably high quality at a reasonable price. You can't go wrong with Kai Zan, but at the same time it's lost its magic for me. Though, I was never a big fan of fusion sushi in the first place.", "pics": null}}, {"review": {"des": "Best sushi in Chicago for the price or not. Better than Momotoro or Roka Ankor. Don't waste your money at those places when you can go to Kai Zan. Hands down freshest fish and most creative omasake! But of course if you can't get a reservation here because it is small and cozy you can try for one of those other \"hip\" places ;)", "pics": null}}, {"review": {"des": "My partner and I did a late anniversary dinner here and had the Omakase. We both generally liked about 75% of the menu. I could've done without either one of the shooters and without the tuna dashi, which was kind of tough and definitely fishy. For $65 per person, I expected to like all of it, so I was slightly disappointed, but the rest of the dishes won me over. <br><br>If I were to come here again, I would see if I could sub out those two courses as they just weren't up to par with the rest. <br><br>Other than the food, the ambience is great and the staff is very attentive. The place is cute and cozy, not too loud.", "pics": null}}, {"review": {"des": "This place is simply amazing. The service is top notch and the food is amazing. We did the 12 course omakase and already want to come back and get the upgraded omakase. This is a must try for any foodie.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/HZACQCGc1Hy9gD6_9yKzdQ/348s.jpg", "caption": "Omakase"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/pEtD0gL-PLsVEPGrszCDuA/168s.jpg", "caption": "Omakase"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/AtZToM9aLHMO07HKxsIp6A/168s.jpg", "caption": "Omakase"}]}}, {"review": {"des": "Took my parents here for their 30th anniversary. Everyone had a wonderful time :) Loved the interior and the private booths. Great service and enjoyed all the food we ordered, omakase and a la carte. Both of my parents commented praise for certain items throughout the meal. Highlights were uni toro tartare and escolar pearls. Mum also enjoyed the unagi; Dad enjoyed the akami tuna. And we'll always remember Kai Zan as the place where my dad, with a not-so-secret secret sweet tooth, said he didn't have much room for dessert, but dove in for a giant bite once he saw it arrive to the table lol.<br><br>I also went here for our 5 year anniversary with an early dinner res. Unfortunately they didn't have the uni toro tartare and informed us of an uni limit on how much we could order, but friendly service and overall had a lovely meal :)", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/-d3vLFEsb5dcbr5VUCsSSg/348s.jpg", "caption": "Loved this!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/68VBPQXbKD71eTF1Z_E8Ug/168s.jpg", "caption": "Toro tartare with Santa Barbara uni"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/JPg8Ve4BcOPYNa_ZN6gnvQ/168s.jpg", "caption": "Unagi"}]}}, {"review": {"des": "One of the best and most affordable omakase in the city. Comfortable setting, with a great combination of classical technique with modern surprises. My only complaint is that the menu hasn't really changed much over the years I've been coming here - try new things, do new menus! That would take Kai Zan to the next level.", "pics": null}}, {"review": {"des": "Incredible Omakase with really good service. Their Uni shoot is one of my favorites.", "pics": null}}, {"review": {"des": "Came here for my husband's birthday and we weren't disappointed. You HAVE to get the omakase, the $65 per person option is MORE than enough food. We were so stuffed at the end, and we can eat! You definitely get your money's worth and more! A lot of the a la carte menu items are actually in the omakase, so you get to try a bit of everything and is the best bang for your buck.<br><br>Service is very helpful and attentive to any allergies you may have. I have a shellfish allergy and the server and chefs expertly substituted any shellfish tastings with a non-shellfish version. When it got too cold for us in the booth (there was a vent directly above us), they even increased the temperature for us! It's great for a date, especially when you get your own private booth... it feels both romantic and intimate, like you're in your own personal sushi world.", "pics": null}}, {"review": {"des": "This is a small & cozy restaurant with delicious food! I made a reservation through Yelp and they called the day before to confirm. When we arrived, we waited about 5-10 minutes for our table. They served us alcohol while we waited. <br><br>We ordered the $65 omakase. We didn't think it would be enough but the portion was huge and everything had such a unique flavor! It is definitely different from the omakase I'm used to eating, but I had fun trying everything they brought out!<br><br>The seasoning they use for their food is different from the traditional soy sauce. They have so many different flavors for everything and we thoroughly enjoyed it. The omakase had a wide variety of food as well- it was a nice mix between raw & cooked dishes. The nigiri was seared and seasoned, the oyster and scallop shooters were slightly spicy, sashimi was fresh, and everything was cooked perfectly. <br><br>It didn't come with dessert but we ordered the matcha creme brûlée and it was yummy! It had a strong matcha flavor, which I appreciate. <br><br>The omakase menu is going to be different every time but I personally enjoyed my menu and recommend it! Our reservation time was 1.5 hours which was more than enough time since they bring out each dish very quickly.", "pics": null}}, {"review": {"des": "I love love love this place. My friend told me I should go try sushi here. I looked at her like fish in Chicago where the ocean doesn't exist?!? I trusted her since, she used to live here and she knows what good food is. So thank god I got a reservation here on time (made it two days prior) at 945PM on a Friday night. <br><br>My boyfriend and I recently got into omakase, and when we saw the menu, we noticed they have omakase and premium omakase. At the time, the premium omakase was ~$120. This included items off the menu and is seasonal. We decided to opt for the premium since we were visiting Chicago and its not like we can just come back next week. NO REGRETS were made. Oh my god their omakase was amazing. It's not a traditional omakase, so everything was very modernized. The fish here were fresh. The uni, amazingly sweet and creamy and so plump. The server asked us if we wanted their last appetizer. It was the DIY uni toro hand roll. That appetizer was to die for. If I were put on death's row, that would be one of my top two dish I would eat before I get outed. The omakase also came with wagyu sliders, which melts in your mouth when you bite. There was a dish where the fish was smoked, so when you open the lid, a bunch of smoke came out and the smoke flavored the fish. I can go on forever, but this place is a must. <br><br>We also had a bottle of sake. They let us try a little bit of the sake before committing to the bottle, which I thought was super nice!<br><br>I walked out so full, and so many happy dances were had. I would definitely come back!", "pics": null}}, {"review": {"des": "Always a good time! This is my favorite Japanese restaurant in Chicago : the sushi is fresh and delicious. The ambience is intimate and relaxing. You won't regret getting the premium omakase! It's worth the price. <br><br>Outside of the premium omakase I love the uni/tuna hand roll (though you do have to make it yourself) and the dynamics mussels!", "pics": null}}, {"review": {"des": "Been wanting to come here for quite awhile and finally did on a Friday evening to treat ourselves. To note, this place books fast - I was looking close to two months prior and the earliest res I got for Friday was 8:45 pm. We arrived maybe 10 minutes earlier, and given their strict 1.5 hr allotments, we were seated close to our scheduled time. It is a little intense having to scarf down your omakase in that amount of time, often with dishes coming out on top of one another, if not at the same time, but to be fair, they at least are transparent about the timing at the forefront, so I guess that should be expected. I personally didn't mind as much, as it was an efficient use of my time.<br><br>I really enjoyed the space - on the small side, but not too much. There were nice nooks of seating. We were seated at the chef's bar, which I enjoy, but the separate booths certainly are more intimate.<br><br>Boo and I opted for a regular and premium omakase. Service overall was fantastic. We were regularly checked on and given a run down prior to each dish. All the staff were very friendly, waters were refilled and plates were consistently cleared. It was fun seeing the chefs in actions, and they certainly were very well organized and devoted to their work. It was nice that one of the brothers even asked how we were doing at one point.<br><br>I thoroughly enjoyed both omakases. I do have to say while the premium is more creative with higher quality ingredients (A5 wagyu and the fattier cuts of fish), the overall value wasn't quite there and was only marginally better for me. The dishes could have been more memorable. I found for both, that similar notes were often used for various dishes - e.g. I thought the basil lemon microgreens enhanced one dish while not the other and I don't know if the consistent use of edible flowers were necessary, except for a nice IG shot. There was a deep fried prawn, noted to be completely edible with the shell, except that I found it not as easy to go down as the more common, soft shell crab. Nonetheless, I still enjoyed the dishes, as they were tasty. We had two soups, and both the broths were clean and tasty. I also enjoyed the scallop dish and all the quality sashimi. <br><br>Overall, I definitely enjoyed Kai Zan and would come back. Don't expect an authentic experience, as yes, you are on a time limit and the omakase is essentially pre-set (although they will cater to your needs). You def can be relieved that you at least won't have slow service here. Also, the chefs do fuse modern and traditional flavors here, so expect that and overall, good quality food. The chef's choice omakase certainly is a good value and the premium is nice to mix things up.", "pics": null}}, {"review": {"des": "Everything was fresh and prepared wonderfully. Our interaction with the chef behind the sushi bar was enjoyable and they even gave us a complimentary dish!  The ingredients were high scale and tasted amazing. This contained stuff such as wagyu beef, blue fin tuna, applewood smoked yellowtail, and etc. As for the regular one it was more tasteful since it contained more fish for half the price. Overall worth trying each one first.", "pics": null}}, {"review": {"des": "One of the best sushi I have ever tasted!  It's a small but quaint restaurant.  Service is very accommodating and friendly.  I ordered the Premium Omakase for $120 (but prices range on what they are serving that day).  They were also offering a regular Omakase for $65 with some alternative options to share.  But I must say, the Premium Omakase was impecable.  My favorite was the sashimi and nghiri platter.  The fish was so fresh and flavorful.  You can taste the quality and detail put into each dish.  Also, their uni was on point and also delicious!  <br><br>Overall:  Amazing sushi and a wonderful dining experience!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/uJtWzfUeu4stKcKDqRxCAg/168s.jpg", "caption": "Miso"}]}}, {"review": {"des": "Step 1. Call for reservations.<br>Step 2. Order the Omakase.<br>Step 3. Thank me later.<br><br>You might skim through the specials and find there are a lot of good items.  Trust me, just order the Omakase.  You will most likely get those items anyway and get a better deal cost wise.<br>Only downside I'd say to ordering the Omakase is if you have a small stomach. You get a lot of dishes, so you better be ready for it.<br>Service is really good with timing. They give just enough time in between dishes which makes the whole experience flow together really well.  <br><br>Location is definitely in a place you would never expect. It doesn't stand out and if you drove by you were never know it was even there.  <br><br>I have yet to order the premium Omakase, but I am excited to try it in the future.<br><br>Love love love this place!", "pics": null}}, {"review": {"des": "Our favorite sushi spot in Chicago. We always get the omakase and order the green monster. It is the freshest sushi I've ever had. The servers are always very attentive and will give you suggestions as well. The best thing is they allow you to split the omakase for an additional fee. It's also BYOB so that's another huge plus! The only downside is that it's hard to get into, you need reservations far in advance, but it is so worth the wait!", "pics": null}}, {"review": {"des": "I appreciate the creativity and care that go into a lot of these dishes. It elevates them a few notches above the neighborhood.", "pics": null}}, {"review": {"des": "My dinner experience here has left me speechless. Everything was so amazing and it has definitely ruined sushi for me since Kai Zan is now my new standard. If you get the chance I HIGHLY recommend you make a reservation here and have dinner here at least once. Reservations fill up quick! <br><br>My boyfriend and I ordered the Omakase. The regular Omakase is $65 for one person which is so affordable compared to omakases at other restaurants. One omakase is a lot of food! If you don't want to get 2 separate omakase, you can just order one and tell them that you want to share between 2 people for an extra $15 so that they can give you extra portions to share. This is what we did and this is what I'd recommend you do as well if it's your first time here! This gives you a chance to try out the omakase but also leave room to try out some other things on their menu if you want!<br><br>I was a bit skeptical about the omakase because some of the items on the menu sounded a bit boring. But I was SO wrong. The flavors that they add to everything is amazing. My favorites was the ESCOLAR & MAGURO PEARLS. Both fish is lightly seared and the spicy mayo and truffle oil makes these so savory and so delicious.<br><br>We also ordered some additional items:<br><br>* WAGYU BEEF NIGIRI - my first time trying wagyu beef and this was really good. it was seared and had such a strong beefy flavor but it had such a soft texture that it melted in your mouth<br><br>* SEARED FATTY TUNA - I forget what kind of tuna cut it was but it was very fatty and melts in your mouth like butter! AMAZING<br><br>The waiters did a good job at timing the dinner. They cleared out our plates when we finished, and within a few minutes, a new plate would come out.<br><br>For Dessert we tried:<br><br>* LAVA CAKE w/ BLACK SESAME ICE CREAM - Like your typical lava cake but with black sesame ice cream. Great dessert but nothing out of the ordinary.<br><br>* UBE MOCHI - get this!! This is not your typical mochi. They make this in house. The outer mochi shell has yuzu sauce infused into it to give this slighty tartiness to the ube ice cream. It is so good!", "pics": null}}, {"review": {"des": "This is without a doubt the greatest restaurant in the city and I'm pretty damn picky and critical. The food was beyond what I could have expected in both flavor and presentation.  I generally try to avoid ogling and photo documenting my meals but I couldn't even believe how unreal these dishes looked and I wanted a momento! The service was very attentive and beautifully orchestrated.  We were literally depressed when the last dish of our omakase was brought out but we will be back very very soon I hope.", "pics": null}}, {"review": {"des": "I was a little hesitant about this place seeing as I don't trust sushi that is so far away from...well...an ocean. But this place is an excellent ode to refrigerated transport.<br><br>The hubs and I opted for the omikase/chef's tasting menu based on a trusted foodie friend's rec. There is so much I can saw about how delicious and fresh every single course was, but I would end up writing a novel.  As experiences go, this has the makings of Chicago Bucket List status. Our server was so in tuned with us, he was informative and helpful every step of the way. We sat at the sushi bar and I loved that the chefs were friendly and interactive. <br><br>I would love to go back to Kai Zan and try some of their menu options the next time I am Chicago.", "pics": null}}, {"review": {"des": "Went there with my dad for the Omakase (Chef's choice 10-course meal): $65 each. Considering this is in Chicago, what a great deal for the amount of food and quality you receive! Reservations were easy to place online (open table) and we had a private dining nook that looked like it could fit up to 6 people! <br><br>We also got the wagyu beef which was partially seared with heart leaf, scallions, wasabi, spicy ponzu, black tobiko and jalapeño.  This was by far my favorite. <br><br>The 10-course meal definitely fills you up! Trust me, I'm a girl who can EAT! The only thing I wish I suggested, was for the sashimi to come out first. By the end of the meal, the beautifully cut pieces of fish were served like an afterthought and my palate was saturated in all the other flavors by then. <br><br>As a small restaurant in Chicago's Ukrainian Village, this is definitely somewhere that you need to try.  I'm definitely returning when I get the chance!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/M2GrZWHDg2etfApm_0oM_w/348s.jpg", "caption": "Omakase: Escolar and maguro pearls. Delicious!!!!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Xwf9KgmesbOgE6pZgIjoyA/168s.jpg", "caption": "Wagyu beef: partially seared with heart leaf, scallions, wasabi, spicy ponzu, black tobiko, jalapeño. My favorite!!!"}]}}, {"review": {"des": "I came back here for dinner with a group of 5. I didn't notice this before, but on the left side of the restaurant are many large booths that can hold groups of 6. We were seated in our own little nook, which gave us a bit of privacy and allowed us to let loose and laugh a lot without disturbing others.<br><br>We ordered a bottle of warm sake and the chef's choice omakase for 5. There was more than enough food in the omakase. A few people were thinking about adding a dish or two before we started and I'm glad we held off because I was about to explode by the end of our dinner. Everything was delicious, really. The sashimi is super fresh and melts in your mouth. Besides the sashimi, my favorites were probably the escolar and maguro pearls and the orange rush. We also got green tea ice cream  with red bean paste and purple yam mochi ice cream for dessert. The green tea ice cream was delicious and the purple yam ice cream had a lot of floral flavors infused in it, not my thing.<br><br>Overall, we had a great evening. We ate a lot and laughed a lot. Everyone enjoyed the food. Their chef's choice omakase menu is a great option with a good price point. I've had both the chef's choice and premium omakase. It seems like the chef's choice omakase stays relatively the same, so once you've had that and you are looking for something different, it seems like the premium omakase is the way to go. It's a great restaurant and a reliable option for good food!", "pics": null}}, {"review": {"des": "Some really amazing sushi here. Great little personal seating rooms that can make for a romantic night. Very original. The Omakase 10 course dinner is to die for and an amazing choice. The timing on all of the courses was almost perfect. The fish served was over the top in quality and not a hint of fishy taste at all. <br>My boyfriend had the wagu beef fried rice and I thought it may lick the bowl clean. He said he never had fried rice like that before. <br>We came for a special night and it felt like a special night.", "pics": null}}, {"review": {"des": "I came here to check out the omakase with a fellow foodie friend, and we were blown away by the incredible food. I was watching the Tokyo episode from Parts Unknown recently (RIP Tony) and was inspired to experience an omakase menu. After reading great reviews on Kai Zan, I booked a table for two on a Thursday evening (no need for credit card with booking unless for 3 or more guests, I believe). <br><br>We were given a menu for the Chef's Choice and decided on this set (we added uni to some of our courses for $5 per person), rather than the premium set. There wasn't a specific menu for the premium choice, but the main seafood ingredients were listed on a chalkboard next to the kitchen. We started out with the Escolar and Meguro Pearls which were delicious. I also really enjoyed the Madai Carpaccio (delicious red snapper with basil miso), Angry Crab (crab wrapped in tuna (I know, it's insane)), Dynamite Mussels, and Fiesta Maki. I wasn't a huge fan of the Scallop and Oysters shooters but appreciated the freshness of the ingredients. I also expected more from the main course but by the time that came out (course #6-7?), I was extremely full. The plate of sashimi came at the very end which was unfortunate because I had no more room in my stomach at this point. I managed to take a bite of each of the different pieces and as expected, everything was super fresh. <br><br>The only downside to the experience was the time limit of 90 minutes. At times, I felt like we were being rushed and towards the end, our bill was sent to us before we even received our last course. I understand the turnover that has to happen but wished they gave us a little more time to relish in the flavors more. Overall, I was thoroughly impressed with the food and would love to come back to try the premium omakase.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/6mMO8M25AZi1z5DU0_rkCA/348s.jpg", "caption": "Sashimi"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/j3r7IOUnlKvAfPKCEyihJw/168s.jpg", "caption": "Fiesta Maki"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/xdr4b2IdYRHoOOodmqSPWw/168s.jpg", "caption": "Main course"}]}}, {"review": {"des": "I would absolutely recommend the chefs tasting! $65 for 10 delicious and creative courses! I was expecting maybe one or two bites per course, but they were actually pretty big and filling! We didn't even have room for dessert after. <br><br>This is definitely the best deal in town! Worth every penny and we will be back! <br><br>The place is very small and cramped, but we were comfortable! Make sure you make a reservation!", "pics": null}}, {"review": {"des": "Wow!  I love sushi and most things Japanese (Hello Kitty...I'm still not sure).  Carlo, Melvin & crew create dishes that are edible poetry.<br><br>In San Diego, there is Tanaka.  In Vegas, Roku.  San Francisco has Akiko.  And finally, Chicago has a restaurant that competes and excels.<br><br>Make reservations, and just go with the Omakase, if you are uncertain.  But really, you can't go wrong.  It's just magic for your eyes and in your mouth.", "pics": null}}, {"review": {"des": "Love this place. It's one of the few places I'd go and eat by myself. Because the food is so good that I think talking to a friend while eating is a waste of time. <br>Service is awesome, great ambience. <br><br>There are hundreds of Japanese restaurants in Chicago, Kai Zan is the only place that masters almost every dish on the menu, except their soup is a little bit salty. <br><br>If it's your first time visit, go with omakase, you can almost everything popular from the menu. The individual dish size appears small, however, with 5-6 dishes combined, it's really filling.", "pics": null}}, {"review": {"des": "Delicious fusion Japanese omakase, very reasonably priced ($65), food comes out fast, and I felt full by end of meal.", "pics": null}}, {"review": {"des": "I came here a few years ago and had the regular omakase. This time around I got the chefs special omakase- more expensive, but definitely worth it. Great food, service and atmosphere!", "pics": null}}, {"review": {"des": "If I could give more than 5 Stars, I would. What a great birthday dinner experience from the service to every bite of food. My fiancé and I both went with the $65 omakase. Blown away with the first bite and every bite following that and I got surprisingly full by the end of the meal! You're able to add sashimi, nigiri a la carte so of course we had to get some fatty tuna ($7) added on. We were also able to sub a protein because my fiancé is allergic to shrimp. Servers explained every dish as well. <br><br>Ugh I could go on and on and rave about this place. Totally brought us back to our travels in Japan! <br><br>If you're looking for amazeballs sushi, this is it and get the $65 omakase.", "pics": null}}, {"review": {"des": "Some of the best sushi I've had in Chicago! Their uni and toro appetizer is to die for, I literally dream about it! Their omakase dinners are amazing and very affordable for sushi. I also recommend ordering off the menu or sitting at the bar. The servers are always very nice and attentive. I still come back here when I am in town from LA because it is totally worth it so make sure you get a reso ahead of time!", "pics": null}}, {"review": {"des": "The omakase is the way to go. I had the standard omakase ($65) and my husband had the premium omakase ($120). Both meals were amazing and each dish was fresh and flavorful. We completed our dinner feeling it was just the right amount of food, without feeling stuffed or deprived. Service was fast and knowledgeable. Street parking was easy to find on Chicago ave.", "pics": null}}, {"review": {"des": "Tasty sushi but I feel like it's for more first time sushi eaters. <br><br>I recommend making reservations because this place fills up fast. We decided with the $65 omakase with the $5 uni toppings. <br><br>I thought all the sushi and sashimi were amazing and loved everything from it. The shooters were the best part! The carpaccio was flavorful and bomb. The cooked stuff was just aight and nothing memorable. I also didn't like how fast our food was coming out for an omakase experience! <br><br>The service was excellent and very attentive. <br><br>For my next visit, I'll try the premium omakase!", "pics": null}}, {"review": {"des": "Love love love this place! I've been about 3-4 times and love all the things On the menu. I also love that the chefs are accommodating with special orders. It might sound weird, but my favorite thing has got to be their tamago. So light and fluffy with some sweetness. Almost like a dessert!", "pics": null}}, {"review": {"des": "If I could afford to eat here every day I would. The menu is refined and the atmosphere is surprisingly relaxed. I've been 3 times now and was never once disappointed with the service or the food. I'm a big fan of sushi and can wholeheartedly say this is my favorite restaurant in all of Chicago. If you're going on a date or just taking a friend out and want to impress them this is the place to go.", "pics": null}}, {"review": {"des": "The bf and I came here for the $65 omakase. Man the chef really knows how to pair flavors together. Everything we had was amazing. From the first course to the last, everything was delicious and well worth it. I'd have to admit, I thought I was going to leave hungry so I did eat a snack before going to Kai Zan and by the 3rd course, I was already feeling full. That was a bad idea to snack beforehand. I would definitely recommend this place and you cant beat that price!", "pics": null}}, {"review": {"des": "Splendid experience, 100% recommend! We ordered the Chef's Choice Omakase & it is definitely the way to go!<br><br>You will have a perfectly coursed out meal that is truly DELICIOUS, diverse & so, so fresh! The $65 price tag seems fair (and maybe even cheap) considering the quality of food & thought put into the creation of the meal!<br><br>After every course, my husband and I had a new favorite dish! It got better and better as it went. While each dish is a smaller-bite sized portion, there are enough dishes & spaced out nicely that you really do leave satisfied. <br><br>Pair your meal with some of the plentiful sake or wine options & you have the recipe for a great night out! I absolutely plan on coming back and trying out the Premium Omakase!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/iCPjguYqnPJGgP-77l7LPA/168s.jpg", "caption": "Shooters"}]}}, {"review": {"des": "Oh my! Oh my, oh my, oh my! So 5 friends & I had an Omakase (leaving your food selections for the evening up to the chef) experience here last night and it was other-worldly. The decor was simple, yet elegant, and I was loving the privacy of the reserved dining booths. Definitely make reservations WELL in advance for this glorious gem! <br><br>We all (6 grown adults) found ourselves doing the happy, delicious, yummy food dance several times throughout the night here. Yep, imagine 6 30-*mer*-something year olds swaying & bouncing in their seats like they're a pack of 6 year olds that have just successfully chased down the ice cream truck, with their first allowance, & they've just had a taste of their very first Dreamsicle. <br><br>Each succulent bite here packs more umami than the next! The sauces, the flavors, the quality of the sea fare & how it is prepared; all an expertly well-composed ballet of a uniquely palette-pleasing experience. Ok so you can continue to sit there reading about me gushing about this place....or you can go experience it for yourself.<br><br>Well....what are you waiting for?", "pics": null}}, {"review": {"des": "Let me start by saying how amazing every experience has been!!  You will not be disappointed!! Our favorite is the Escolar pearls but be sure that Chef Melvin and Carlo will surprise you with their talent!!!", "pics": null}}, {"review": {"des": "I've had the pleasure of coming here 3 separate times, and each time kept me convinced it was my favorite restaurant in the city of Chicago.  I ordered the standard omakase each time, which is a series of mostly single bite items.  Everything is described by staff in detail as it's delivered to the table so customer's aren't kept guessing what has arrived (it's not always obvious what you're eating).<br><br>Every single course is like magic.  It's unlike any sushi/sashimi spot I've ever been to.  The standard omakase never leaves me stuffed by the end, but always sufficiently satisfied.", "pics": null}}, {"review": {"des": "You know that a restaurant is good when you book a table almost as soon as you get home. Like a lot of people, we got the \"regular\" omakase, which is the $65 standard. (The premium is market priced, I believe.) Unlike a lot of tasting menus, which can be hit or miss depending on when you go, they brought out their greatest hits for theirs. <br><br>The Maguro Pearl might be one of my favorite bites I've ever had in a Chicago restaurant, and I loved how much variety you got. I was afraid that I was going to be a little hungry, but the boyfriend and I were both STUFFED after the meal. We can't wait to come back and order off the regular menu, now that we've gotten a little taste of everything.<br><br>All in all, this is one of the best deals I've seen. Run, don't walk, to Kai Zan!", "pics": null}}, {"review": {"des": "Last week was my 3rd time coming to Kai Zan for their omikase menu and once again, they did not disappoint. This is probably one of the best Japanese cuisines in Chicago. <br><br>First, I cannot stress enough to make reservations. The restaurant is quite small so if you walk in, it may not be possible to get a table. When you do make a reservation, they only allow for your party to sit for 1.5 hours. This allows for them to turn the table over for the next guest. If you make a reservation with a larger party, they will likely take your credit card information.<br><br>Now the food. You can order the omikase menu or you could choose to order off the regular menu. I definitely have to come back and order the normal menu. Do not fear the omikase. The chef/staff will work with you if there are certain things you don't like or have allergies. They were able to tailor the menu for me so that I didn't miss out on the goodness. Out of the 10 items, my favorite were the escolar pearls. They will render you speechless. They lightly torch the escolar and give it a smoky flavor. To top it off, the pearls are accompanied with an amazing truffle soy sauce. I could just order a plate of those. The crab wrapped in raw tuna, sushi, sashimi and hot dishes were also amazing. Some of the 10 dishes may be small, but don't let that fool you. I could not even finish my 10rh course!<br><br>Needless to say, you don't have to twist my arm to come back here!", "pics": null}}, {"review": {"des": "Favorite sushi bar in the city/ suburbs. Just so happened to move across the street.... been there once a week since . Chefs special recommended.", "pics": null}}, {"review": {"des": "Holy moly wagyu! We did the premium Omakase here tonight and it was delightful! It was $120 per person for the premium Omakase and it was worth the price tag considering the quality of ingredients. My favorites definitely were the nigiri composed of the fatty tuna (otoro), smoked lobster with fish roe, hamachi and then the wagyu. Each piece progressively got better with each bite. I also enjoyed the salmon, tofu and truffles with the shiro miso and dashi stock poured over it. The sashimi platter was amazing, I couldn't figure out what piece I wanted to savor last! Overall it was a great experience. Im curious to see what the chefs choice Omakase entails since it seems like it was such a great value at only $65. I might have to come back for that one!", "pics": null}}, {"review": {"des": "The quality of the ingredients, the spectacular presentation of the dishes, and the relaxing atmosphere makes Kai Zan one of the best restaurants in Chicago. <br><br>I went with a group of four and we were seated in one of their private booths.  Our server was friendly and made some great recommendations.  The 10 course Omakase is around $65 and is well worth it.  I'm personally new to seafood and didn't want to commit to my own Omakase so our server had suggested that I join my husband's for an additional $15.  We shared most of the courses and the courses that were meant to be enjoyed as single bites (ex: angry crab), they brought out an additional \"bite\" for me.   <br><br>In addition to the Omakase we also ordered all three of the daily specials.  If you're there and they have Wagyu, go for it!   It was $10 per piece but it was well worth it.   Their taro chip special was great too, it reminded me of ceviche. <br><br>If you like seafood, I suggest the Omakase.  If you're on the fence like me, skip the Omakase and order à la carte.  Although I enjoyed most of the courses, I couldn't stomach the oyster shooters and didn't enjoy the orange rush (sushi scallops wrapped in salmon).   Again, I didn't enjoy these dishes because I don't love seafood, not because they weren't good.   <br><br>If you only get one thing, let it be the Escolar pearls.  It's quite easily one of my favorite dishes of all time! <br><br>Tips: It's BYOB (limit of 2 bottles)<br>         It's popular (make your reservations in advance)<br>         Go with a group (So you can be seated in a private booth)", "pics": null}}, {"review": {"des": "Hands down this is one of the best sushi restaurants I have eaten at in Chicago. We had the premium omakase and the regular omakase for my birthday dinner. Everything was really fresh and nothing tasted off. In fact, this is the only sushi restaurant that has made me like uni and I've had it twice before this restaurant. I think that the restaurant also does a good job at pairing various flavors since everything came together really well. <br><br>Not only was the food good but the service was excellent. Everyone was super nice and helpful. We originally planned to go with the premium omakase with doubled up portions however within 15 minutes of the meal we decided that it might not be enough food. I was scared that we weren't able to order another omakase seeing as the omakase is timed however the waiter was very accommodating and was able to put in the order for another omakase. Not only was the waitstaff very nice but one of the chefs at the end of the night had acknowledged and talked to us as well since we were sitting at the sushi bar.<br><br>Unfortunately the only con I had about this place was that the cleanliness is questionable. At the end of the omakase I had eaten a piece of sashimi and it made my stomach hurt and cramp immediately. However, my boyfriend had the same thing and he was fine so I think that my stomach is just sensitive. <br><br>With that said I would go back again to the restaurant and try the regular menu instead but I do recommend the premium omakase over the regular omakase if you were to choose between the two.", "pics": null}}, {"review": {"des": "This is hands down the BEST sushi restaurant in Chicago. I made a reservation through Yelp for a party of 2 at 6:45PM yesterday night. We arrived half an hour earlier and we were seated around 6:15/6:20PM. We had our order customized by Justin :) (Thank you! You're the best!) Our server Allan was extremely accommodating and was able to help us out throughout the night! My friend and I were so excited to splurge last night and we have no regrets! The ambience is casual/trendy and it's perfect for date nights with your friends or significant others. <br><br>Here's what we ordered: escolar pearls, polenta bites, orange rush, green monster, smoked zuke, 2 salmon, dynamite bites, toro gunkan, matcha crème brulee, and strawberry mochi. We had another custom item but I forgot what it was called (all these fancy names... I can't keep up!) I fell in love with the toro gunkan - it's a dish with fatty tuna that literally just MELTS in your mouth (MUST TRY!) Their truffle oil makes everything taste that much better - but my all time classic favorites are the escolar pearls, green monster, and the smoked zuke.<br><br>I can't get enough of this place and I can't wait to go back for round 2 soon! :~)", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/8IqrJwr548_BXoodYuqzIg/168s.jpg", "caption": "Strawberry mochi"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/SLuIP3Er8t5jbmqcf-qknA/168s.jpg", "caption": "Matcha creme brulee"}]}}, {"review": {"des": "Probably one of the more fun, inventive restaurants in Chicago. I have literally never had one bad meal there.<br><br>Get the tasting menu your first time, then order off the regular menu... they take uni especially serious here, and it shows.<br><br>Highly recommend the pearls and the carpaccio!", "pics": null}}, {"review": {"des": "One of the best sushi restaurants in Chicago in my opinion. It is a small restaurant so I suggest making a reservation far in advance but it is totally worth it. The Maguro pearls and polenta bites are two of my favorites! The chocolate lava cake is also something not to miss. Service is always fast and attentive. Not a spot to be missed!", "pics": null}}, {"review": {"des": "Took my husband there to celebrate our anniversary because he loves Japanese food. He got the tasting menu and I got ala carte dishes. He loved a few dishes from the tasting menu and I loved the tofu in broth and the noodles. A nice cozy restaurant and excellent atmosphere for a date night. I took one star off because the server could not suggest good sake options.", "pics": null}}, {"review": {"des": "Dinner with my boyfriend for my 2_th birthday! He did lots of research on all types of restaurants all over Chicago, and finally landed on Kai Zan. I'm happy to report that his hard work paid off...this place was great! We got seated right away after checking in for our 7pm reservations, and knew what to order immediately. We each asked for the 10-course Omakase menu ($65) and added uni to select courses for an extra $5. <br><br>1. Madai Carpaccio: Loved how delicate and fragrant this dish was. The red snapper melts in your mouth! Great way to open the meal.<br>2. Escolar & Maguro Pearls: The sear and truffle oil were very good, but not super unique. Very well executed though.<br>3. Angry Crab: Uni makes its first appearance here, and it was SO buttery and delicious.<br>4. Shooters: 1 Oyster shooter (with Uni) and 1 Scallop shooter, each with a quail egg, and topped with tobiko. Yum!<br>5. Orange Rush: Again, great sear on the scallop.<br>6. Tuna Dashi: Okay. The tuna was a touch overdone, but due to being submerged in the hot dashi.<br>7. Main entree: My least favorite - did not care for the char siu or tako wasabi, but that's just my preference.<br>8. Fiesta Maki: Tasty, but not super unique.<br>9. Dynamite Mussels: Same as Fiesta Maki.<br>10. Sashimi: Beautiful, fresh cuts of fish. However, I was too full at this point to completely enjoy this, so I handed most of this off to my boyfriend.<br>*11. Mochi - complimentary birthday treat!<br><br>If you're looking for a fresh, well-executed approach to sushi (and a wonderful Omakase menu), Kai Zan is the place to be. I'll definitely be back!<br><br>TL;DR: Stop what you're doing, make a reservation online, and order the Omakase menu as soon as you get seated. Don't forget to add on uni to select courses for an extra $5. You can't beat this deal for the amount of food and quality you receive!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/olcjSB8vdHZcZ_x0l9zXOw/348s.jpg", "caption": "Sashimi"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/cIFf4V3c7fCysTc79eoalA/168s.jpg", "caption": "Fiesta Maki"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/c8oFb3u7XgLDbmAR7WPemA/168s.jpg", "caption": "Dynamite Mussel"}]}}, {"review": {"des": "This was my actual  first dinner restaurant here in Chicago, IL. <br>My girlfriend and I were here on vacation and my gf's brother recommended this place. We have never been here, but it was a very pleasant and decadent evening. We tried the Premium Omasake, which is a 10 course meal. The last dish was a dessert. <br><br>The inside of the restaurant is really nice, dimly lit with enough light to make it romantic but not too dark where it would be difficult to navigate around. Every decor matched the Japanese theme and presented itself as a fancy restaurant. My gf and I loved it.<br><br>The waiter and waiteress were very knowledgeable about each meal because they introduced each dish like it was it's own. They presented the dishes with a very good explanation of what we were eating. Even to the simplest thing as refilling our water, they were watching ti make sure we never go thirsty. Our group enjoyed it and we would recommend any tourist (like ourselves from California) to any locals.", "pics": null}}, {"review": {"des": "Absolutely delicious, everything on the menu(s). 10/10 would go here again, 5 stars for both the food and service. Worth every penny. Fairly large selection of both sushi and non- sushi items. Definitely make a reservation.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/sQGlseEFdGkoc3bFQ6QcCQ/168s.jpg", "caption": "Quail egg + scallop shooter"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/U05qTH72gqBUTHD9QkeQgw/168s.jpg", "caption": "Oyster & scallop shooters, part of the omakase menu. Delicious!!!!"}]}}, {"review": {"des": "One of the best sushi places in Chicago. Hands down. We order service the Premium Omakase and was feasted with beautiful and fantastic food. I normally would enjoy more selection of fish in my omakase but this one (with less fish and more other stuff- beef, truffle, etc.) really blew me away. <br><br>The restaurant is small and intimate. Atmosphere is not really very fancy but nice. We had our own little booth and the waiter is so fun explaining to us each course and very tentative.<br><br>Will come back for the standard Omakase which I think focuses more on fish.", "pics": null}}, {"review": {"des": "Great spot for wonderful sashimi with good service... Had the chefs choice omakase which was a really great value considering the quantity and quality of fish.  All the courses were imaginative and /or beautifully presented, but in terms of flavor the first couple courses were definitely my favorites (madai carpaccio & escolar/maduro pearls).  <br><br>We also had the full dessert menu (hey it was a group, stop judging- even though the waiter totally did :).  The mochi cake was the only one I didn't care for, the rest ranged from yum (chocolate cake) to interesting (matcha creme brûlée)<br><br>We had one of the private booths that was really roomy for a group of 4 and the service was efficient...  <br><br>Overall definitely plan to head back, perhaps try the premium omakase or other items off the menu...", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/6O_zsFjbn3MyTUrTz4cG-Q/348s.jpg", "caption": "Creme brûlée"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/eZ-FaIFTUaBCkc_E8xJPVg/168s.jpg", "caption": "Sashimi"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/zSHwn0DI7ldWXtLCV5krEQ/168s.jpg", "caption": "Dynamite Mussels"}]}}, {"review": {"des": "Fresh fish. Unorganized reservation staff/hostess, had to sit and wait to be seated even after making reservation. Excellent server - always attentive, knowledgeable and 2 steps ahead. Incredible sushi. Will take pics next visit. I'm craving more!", "pics": null}}, {"review": {"des": "Considering I love nothing more than raw fish it's a shame it took me so long to get here. Small restaurant + melt-in-your--mouth sushi = difficult to get a reservation. However, my friend put our names on a waitlist awhile ago and got a call the day before they had a table free up. And so we traded in our original Italian plans for for sushi. <br><br>They had a perfect table waiting for us- our own little secluded area. It seems like most of the tables in the restaurant are this special with the exceptions of a few regular tables up front. Our group of 4 was quite comfortable in there, but 6 would have been fine as well. <br><br>We ordered some much needed cold sake (long day with the little ones) and our very informative waiter told us about the specials. They all sounded good- the soft shell crab special at the top of the list. We decided to order the chefs choice (there was a fancier name for it) and there was some sort of deal where you could share as a couple. Fortunately, my husband shares my taste in sushi. We also added a few specials. <br><br>Our 10+ course meal of small bites could not have been more delicious. By the end we wanted more, but mostly cause the food was so good. We added a sushi roll which was probably the most disappointing part of the meal but still good. And then of course dessert - green tea ice cream and creme brûlée. <br><br>Highly recommend booking a res (or at least putting yourself on their waitlist) soon!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/FQymVrFWrfGgp9UIvRQImA/348s.jpg", "caption": "Our own personal booth"}]}}, {"review": {"des": "Highly recommend the chef's choice omakase! I've been back for the same thing, three times now, it's truly worth every penny.<br><br>When you make a reservation (& you HAVE to make a reservation!), they warn you that any seat requests can not be honored, but I tried it out anyway. I asked for a private booth, the day before Valentine's day... the private booths are big enough for 6 people, so I didn't really expect them to seat 2 there, but they did! <br><br>The bar is fun to sit at because you can watch the chefs do their thing. It's just kinda difficult, with big coats and bags. Even with the cramped quarters, this place still gets 5 stars.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/z0AXWpa420YUS6wHAfjudw/348s.jpg", "caption": "Madai Carpaccio"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/miAj9pzmA7mC0xdGx_SEcQ/168s.jpg", "caption": "Escolar & Maguro Pearls"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/YTutj8x73Z485qpFWJntKg/168s.jpg", "caption": "Uni and Oyster Shooters"}]}}, {"review": {"des": "I don't really do reviews unless it's bad, and I'm not a big sushi eater. <br><br>But it all changed when we ate here. Everything was so good, melt in your mouth freshness. <br><br>We went crazy with the orders,<br>4 escolar pearls (truly life changing)<br>3 polenta bites<br>2 orange rush<br>2 wagyu nigiri (another favorite)<br>2 angry crab<br><br>And Justin recommended a REALLY good Japanese craft beer - the Yuzu Salt Ale, didn't plan on drinking either, but it got me drinking 2 cans ;)", "pics": null}}, {"review": {"des": "Worst place. Total rip off. White hostess tries to sell Asian food as fast as she can. They rush you and charge a lot more than I pay in San Francisco. Pls stay away unless you want to throw $$ away.", "pics": null}}, {"review": {"des": "Hands down my favorite Japanese place in town. Having been in Chicago for four years, somehow I have never been to Kai Zan, but this visit completely wowed me. <br><br>We sat at the bar seats and got to see how the chefs prepared for each course. I would highly recommend getting the omakase (or the premium one if you have tried the original omakase but wanted more high end / sophisticated raw materials to start with). Food is served to you in a super organized structure, and you won't experience a long gap or need to wait between two courses for sure. <br><br>My favorite dish would probably be the uni tartare that's off the omakase menu. The uni has a super rich, satisfying texture - wrapping the tartare in the crunchy seaweed adds another layer to it! Within the omakase menu, the first couple of appetizers are simply amazing. The last couple of main dishes could be a bit salty. <br><br>Overall, great experience and I'll be back again! This restaurant is definitely on par with momotaro, if not better. Also, remember to get the lava cake!! I love Japanese desserts and the lava cake here paired with black sesame ice cream will wrap up your dinner pretty well, and send you home with a happy tummy. :)", "pics": null}}, {"review": {"des": "Best sushi experience in Chicago! Definitely get the omakase for $65. Add $5 more for uni if you are into that. I actually think you can share two omakase with three people. Pace yourself - The sashimi comes at the end and by then I'm always so full! <br><br>Make reservations ahead of time and enjoy!", "pics": null}}, {"review": {"des": "4.4<br>Month: June 2018<br>Day and time: Tuesday evening<br><br>Food: 4-5 stars<br>We ordered escolar pearls, maguro pearls, oyster shooters, karaage (fried chicken), braised octopus, the mushroom medley, hamachi collar, and various nigiri. The oysters were refreshing and cleansed the mouth between the competing tastes of the other dishes. All of the fish nigiri were outstanding - the tuna and hamachi were smooth and silky, but the salmon belly rose above them both with its richness. I was a little disappointed with the wagyu beef, both when served on its own and as nigiri. The juices caramelized on the surface of the meat, providing a promising first bite, but the flavor held little longevity. The karaage was ordinary, despite the hope offered by the marinated chicken meat. The hamachi collar was the most popular dish among our table of four, though I preferred the salmon nigiri. It took little encouragement for the white fish to fall from its frame, and even less so for it to melt in the mouth. It was accompanied by a ponzu-scallion sauce and grated daikon radish which brought a welcome salty kick to the otherwise unassuming hamachi. The braised octopus - a special of the day - was lightly-charred and its toughness changed up the texture profile of the evening. We finished our meal with mango mochi, lava cake, and matcha creme brulee. Most dessert lovers could find satisfaction somewhere across the selection, and indeed this dessert skeptic enjoyed sampling all three.<br><br>Setting & Atmosphere: 4-5 stars<br><br>We were lucky enough to be seated at one of several large booths along the left wall of the restaurant. We had the utmost privacy - we neither saw nor were seen by other customers during our meal - but the chatter in the air reminded us there were plenty of other lucky souls enjoying their meals too.<br><br>Drink: 4 stars<br>We each took a beer, and were pleasantly surprised to find the Asahi offered was not the Super Dry but instead the Select amber lager.<br><br>Service: 5 stars<br>I have nothing but compliments for our server, Brian. He knew the menu inside out, offering sensible alternatives where our first choices were unavailable. We ordered several off-menu items on his recommendation, including the show-stealing salmon belly nigiri. Service was attentive, comically so at one point when replacement chopsticks were provided within seconds of a pair falling to the floor.<br><br>Value: 4 stars<br>The a la carte menu varies in its value-for-money - the daily collar offers an entree-sized amount for cooked fish for ~$14, but you would need to spend 2-3X that on appetizers to feel full. You should go to Kai Zan expecting to spend well for some of the best raw fish in Chicago. With such an approach, the omakase at $65 a head looks outstanding value.<br><br>Return: Yes<br>I could return and eat exclusively fish, as the tuna, salmon, and hamachi were the freshest I've tasted in Chicago. I would like to check out the chef's omakase too - while the chicken and beef play second fiddle to the fish here, they would still be upper quartile across Chicago restaurants.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/hruK6-HidFflYMtjRYJEjw/348s.jpg", "caption": "Tuna and hamachi nigiri"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Vdj725B-zqxFOKiDQjfyEQ/168s.jpg", "caption": "Hamachi kama"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/pX__R2z0_beBpIfV1gUv2A/168s.jpg", "caption": "Karaage"}]}}, {"review": {"des": "Amazing experience at Kai Zan for a birthday celebration! The service was top notch before we even set foot into the restaurant, with the hostesses being accommodating about our wanting to celebrate a birthday as well as reminding us to reserve a premium omakase set if we were interested. <br><br>We shared one premium and one regular omakase, and it was a perfect way to try the many, many, many amazing things that Kai Zan had to offer. The flavors were excellent and ingredients were so fresh, with the fish and meats just oozing the perfect fatty flavors. The wagyu nigiri from the premium omakase was at the top of our favorites list, along with the \"chip and dips\" and the raw shooters. <br><br>Thank you to the Kai Zan staff for a wonderful experience to taste the incredible flavors you guys have created!", "pics": null}}, {"review": {"des": "As many reviews already stated, \"Best sushi ever\" given the ingredients that we had it was the best quality ever. We ended up having both the premium and regular omakase. Both were amazing but wouldn't be something to be doing all the time. Both Omakase was a 10 course meal each and both had amazing ingredients. But each shined in its own perspective. Starting with the premium we had to reserve it ahead of time along with put reservation to ensure we get one. The ingredients were high scale and tasted amazing. This contained stuff such as wagyu beef, blue fin tuna, applewood smoked yellowtail, and etc. As for the regular one it was more tasteful since it contained more fish for half the price. Overall worth trying each one first.", "pics": null}}, {"review": {"des": "This is probably my favorite sushi place in Chicago. Not only is the presentation amazing, but it it is delicious. The    Omakase menu doesn't seem to change often. I've been there in 3 times in year (August 2017, September 2018, and August 2018) and only one or two things changed on the Premium Omakase and Omakase menu. This place is definitely worth trying.", "pics": null}}, {"review": {"des": "We have been here twice and are excited to return for a special occasion again sometime! Everything they serve is perfection. The only downside is the small space and reservations/ wait. But it is well worth the wait. The best sushi in Chicago for sure. Also the best sushi we have ever had. The wait staff is super kind and informative. They support local breweries. The Hi Kitty Kitty is yummy.", "pics": null}}, {"review": {"des": "Wow this place is awesome! No wonder it takes weeks to make a reservation here. My boyfriend and I were celebrating our anniversary Saturday night and were seated at the sushi bar. Our sever was informative and attentive. He right away walked us through the menu since we were new. My boyfriend ordered the Chefs Omakase. It was pricey at $125 but each course blew us away. I ordered the fiesta roll and mushroom medley at our servers recommendation. Everything was fresh and prepared wonderfully. Our interaction with the chef behind the sushi bar was enjoyable and they even gave us a complimentary dish!<br>I would absolutely go back and order everything we had again minus the mushroom medley (it was okay but not great.) The fiesta roll was one of the best rolls I've ever had and the polenta bites are a must try. The Kobe beef slider on the tasting menu was heaven. <br>They have a $15 corking fee so we ordered drinks off the menu. Great experience we will be back!", "pics": null}}, {"review": {"des": "From quality to presentation, this restaurant was phenomenal. We had the premium omakase and the regular omakase to compare, and the premium one was definitely higher quality. I loved how not only do the dishes taste good, their creativity really shined through as well. Service was great too, our server explained every dish in detail, and even the sushi chef would ask us from time to time how we liked everything. There are 10 dishes to each omakase and I listed the prices below. We would return in the future... <br><br>Price: Premium omakase is $120 <br>Regular omakase is $65.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/H3QYlrRMiwi4h83DrvBmcA/348s.jpg", "caption": "Salmon and scallop"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/NvqRal1KcTbHfXOBYWMHjg/168s.jpg", "caption": "Wagyu steak also premium"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/tvZCjGQtOwAxptkOT8163A/168s.jpg", "caption": "Truffle and scallops - the best and part of the premium"}]}}, {"review": {"des": "This is one of those places I have yearned to try for a few years and I have either had plans canceled or was just plain lazy or could not find a reservation within the time frame I would like to eat. Well that has all come to an end now!!!!<br><br>I got the chance to come by this past Tuesday with a 7pm reservation with my very good friend. Not the biggest place but very nice looking and a bit fancier than your normal sushi joint. We were lucky enough to get one of the booths which was awesome. Our server was pretty much on point and basically walked us through the best option which was about 10 courses for $65 each...done!!!! To try so much for $65 at this place is a helluva deal!<br><br>Started out with the Madai Carpaccio (Japanese red snapper, basil, olive oil and black tobiko) and it was a nice starter and we both enjoyed.<br><br>Next up was the escolar and maguro rolls with truffle oil which were very good..actually we were like wow we should stop here if it gets better than this. <br><br>Angry Crab was next as its basically spicy crab wrapped in tuna  with spicy mayo and tempura...pretty decent.<br><br>The Shooters were pretty nice as they came in the form of a shot and they included oysters and scallops, quail egg, black tobiko, ponzu sauce, scallions and tobasco....woooo that was good. Probably the best 4 shots I've ever taken.<br><br>Orange Rush was next and it was seared scallops and salmon which was good<br><br>Tuna Dashi was amazing and a break in the action. It was a broth with shitake mushrooms, little neck clams and tuna....It was very good and flavorful AF<br><br>Main Dish was tako wasabi, shrimp and pork belly on a stick...good...the wasabi was nice!<br><br>Fiesta Maki was good and had a bit of a spice to it<br><br>Dynamyte Mussels were definitely dynamite as they included scallion mayo, black tobiko and masago...very good flavor...probably the best mussels I've had!<br><br>Assorted Sashimi closed out the courses and it was very good.<br><br>I washed it all down with a 2016 Summer Water rose'...2 glasses did the trick. My buddy had a blanc and he said it was one of the best he has had. <br><br>This place was well worth my 5 year wait to try it out and is now my favorite sushi place in the city! Multiple visits will probably be made within the next few months!", "pics": null}}, {"review": {"des": "3.5* The food was good, but don't expect any wild surprising ingredients.<br><br>I went for the omakase and was seated at the sushi counter. The chefs are a bit too busy so they don't interact with you at all, which is fine but I wasn't expecting that.  Each course was solid, but didn't seem to have a logical progression all the time (eg: seared wagyu beef served nigiri style was followed by salmon/tuna sashimi).<br><br>I also felt rushed by staff by the end of my meal although two thirds of the restaurant was still occupied by customers. They also forgot the dessert because they were trying to close down the kitchen.", "pics": null}}, {"review": {"des": "Absolutely incredible food! I actually do not recommend the Omakase, instead go al a carte so you can pick the types of flavors you like (I tried both options). Favorite dishes:<br><br>The escarole pearls <br>Wagyu beef sushi - to die for <br>Belly salmon <br>Polenta bites <br><br>Only down side is the place is super small and can be tough to get comfortable. But overall the service is good and they have the best sushi in Chicago!", "pics": null}}, {"review": {"des": "I would definitely give the omakase a try if this is your first time here. The two of us tried the chef's choice omakase $65 and the premium omakase $115 (both were 10 courses each). The menu didn't overlap at all and really gave us a well-rounded tour of what they had to offer. Next time, I would probably order a la carte now that we know what our favorites are!<br><br>I'd say the best part of the premium omakase was the plate of fatty belly sashimi towards the end - omgosh fatty tuna belly, fatty salmon belly, fatty sea bass belly. SO BUTTERY. Also, the fatty imported Japanese wagyu nigiri. See photos - really top notch! The Madai carpaccio with basil was also solid.<br><br>The chef's choice omakase was printed on a menu, so it was much easier to remember what was what. Anyways, here are some of my favorites from the chef choice omakase:<br><br>Tuna and escolar pearls - the escolar pearls were better than the tuna ones<br>Scallop shooters - very fresh scallops and bright tasting!<br>Orange rush<br>Fiesta Maki - lots of fresh fish crammed into the roll, very yummy<br><br>What we would NOT get:<br>Tako yaki - such a disappointment, the outside was not crispy and the inside was very chewy.<br>Dynamite mussels - was ok but not great.<br>Angry crab - bland, no taste, I couldn't even tell there was crab inside!<br>Probably all of the skewers. The pork belly one was dry and meh.<br><br>Overall, we'd come back and order just our favorites and the uni! They didn't have any the night we went, so we'd definitely order some uni shooters or handrolls.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/k0ZbxO0NdXxjEUS_sZ7BWg/348s.jpg", "caption": "Fatty belly everything! Tuna belly was the best by far!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/DBzDIPnTEC2GYpGclYDXwQ/168s.jpg", "caption": "Salmon was so buttery!"}]}}, {"review": {"des": "This place is great. Small and intimate. Great service and great food. We sat at the sushi counter which was cool to see the food being prepared. We tried the chefs tasting menu for $65 a person. Honestly it was too much food. It was ten courses, so I expected it would be literally a taste for each course -- one piece of sashimi or one piece of sushi roll per course. For half the courses they were giving two or three \"servings\". I was uncomfortably full by the time we were halfway done, and I didn't enjoy the second half of the tasting menu because of it. Several of the items on the tasting menu are on the regular menu so if so went back I would figure out what looks good from the tasting menu and then order a couple of those plates individually.", "pics": null}}, {"review": {"des": "This place is pure amazing ness. There is nothing else like it. I always do the Chef's tasting menu and am never disappointed.", "pics": null}}, {"review": {"des": "Had an early reservation. Everything was great. Did the omakase as suggested by our server. Added the uni with the $5.00 addition. The meal did not disappoint. We left happy and satisfied. The only thing I can mention is that towards the middle of our meal, we felt they were rushing service as they obviously had a second seating after us. <br>We were also seated by the bar which was awesome as we had the culinary view. It would have been nice if we could have lingered but I do understand that they have to flip  tables.", "pics": null}}, {"review": {"des": "The folks at Kai Zan are family...and they happen to be the best chefs in the city as far as we're concerned. We are longtime lovers of everything Kai Zan has to offer. The classics remain consistently top notch. There are always new dishes to entice and keep us wanting more. It was our best kept secret, until the rest of the city caught on. We only extend a Kai Zan invite to our most \"deserving\" friends. Treat your palate to Kai Zan, or don't...in which case I have a better chance of getting a reservation for myself.", "pics": null}}, {"review": {"des": "A cozy little Japanese restaurant in Logan Sq.  The Omakase menu showcases the breadth of their menu so it is worth to try.  For a few additional dollars they will upgrade the Omakase with Uni - definitely go for it! We sat by the bar fronting the kitchen so apart from the decadent array of delicious seafood, we get to watch Melvin & Carlo perform their craft. What a great experience overall!", "pics": null}}, {"review": {"des": "This was one of the best sushi restaurants I have ever been to. Omakase was the spectacular. And amazing service. A neighborhood gem!", "pics": null}}, {"review": {"des": "Now I know why people are always raving about this place! We were finally able to snag a table here for my birthday dinner. The area is pretty quiet and from the outside at night it's a bit hard to find. I was told it's small and no joke it is. <br> <br>Our reservation was on a Saturday night at 8pm. Got there on time and only had to wait 4 minutes four our table. The restaurant gives you an option to either buy drinks from them or bring your own bottle for 12 dollars corkage fee. We opted to drink the wine we brought. The hubs was a bit reluctant to do the omakase thinking it might be too much food. The omakase was 10 dishes so like 2 from each section of the menu. Either way, I was dead set on doing the tasting. Needless to say he realized his wife is right. <br><br>We ordered the regular omakase instead of the premium one. I believe the premium has uni and foie gras. We noticed the omakase was a popular option. It doesn't hurt it only costs 65 bucks. Much cheaper than other places would charge. Each dish was delicious! If you're a slow eater like me beware since the dishes come out fast! We were impressed by their efficiency. I could've done without the Angry Crab. It just didn't stand out. The sashimi was like butter in your mouth. The red snapper carpaccio was a dish I would order 20 times over. We really enjoyed the oyster shooter and how the flavors complimented each other. All of the dishes were great just minus the angry crab. <br><br>The service was wonderful and on point. We were lucky to sit in front of the kitchen allowing us to watch each dish come together. We did order the chocolate lava cake as our dessert. The black sesame ice cream blew us away. The flavor of the ice cream was just a tad sweet but had a great berry flavor as well. Skip the cake and just get the ice cream instead. Overall, my high expectations for Kai Zan was met. We are already planning to come back for the premium omakase.", "pics": null}}, {"review": {"des": "What a great find here! Came here for an early dinner with my husband and the restaurant became packed really fast so make sure to make a reservation. It's a cozy atmosphere. Service got a little wacky at times cuz our server would disappear or get held up at another table but no big deal because in the end the taste of the food trumped everything. Out of our drinks the yuzu salt beer was memorable. Refreshing and taste just like it says. <br>My husband and ordered the premium omakase which was such a great experience. We got to first enjoy the food with our eyes cuz the food is so colorful and plated so nicely. But tasting the food was amazing. My husband got a couple extra dishes from the main menu which tasted fine but we highly recommend the premium omakase. The components of each dish went really well together and it never felt like they tried too hard or too much.  It all just tasted perfect. We will miss this place when we go back to NYC.", "pics": null}}, {"review": {"des": "What can I say...after living a block away from here for years (sadly no longer) and having been here five times, I am not sure why it took me this long to write a review. Let's just say: Kai Zan is top notch. The quality of the food is stellar, the atmosphere is intimate, and service has always been outstanding. I have heard people come in and complain they have to sit at the bar and it always baffles me: 1.) it says on their reservations page this may occur 2.) they tell you this when they call to confirm your reservation, and 3.) it is actually pretty cool to watch the guys at work prepare your food.<br><br>Some highlights from the menu for me include the Orange Rush (I could probably get 10 orders of just these and be very satisfied), the maguro pearls, and the Madai carpaccio (absolutely outstanding). We tried Potato Ohitashi this past visit for something different and it was SO good, plus a little more filling. For dessert, their green tea ice cream is very good (creamy, not very sweet) as are their mochis (love the Japanese pumpkin flavor they had during our most recent visit)<br><br>My only complaint is the 1.5 hour time limit (we tend to make later reservations so we don't feel rushed), based on the space and the popularity, I understand why they do it; however, the one time we chose to do the Omakase I personally felt a bit rushed. <br><br>That all said, I can't wait to get my next five visits on the books!!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/CQOZX9jAfKahI2PHwYkffA/348s.jpg", "caption": "Nice table decorations"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/bTmuSCy8pqSSqlFoh7wDUQ/168s.jpg", "caption": "Maguro Pearls-absolutely delicious"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/-TWi15_yTQfjA5XA6YaqLA/168s.jpg", "caption": "Potato Ohitashi-very good!!"}]}}, {"review": {"des": "Kai Zan was on my list for almost two years and finally got a chance tonight. First of all, make a reservation, at least 2 weeks in advance. This is not a big place, and full of people all the time. We planned to order both regular premium omakase to get a full experience, unfortunately they didn't have premium. So we got a regular omakase, uni wrap(special for that night), scallop and cha siu skewers, stir fried soba.<br> <br>Omakase: a 10 course chef choice. A great way for those new to KaiZan to try their highlight dishes. Lots of food, so be prepared. <br>Uni wrap: $28 night special, uni+tuna+egg+nori= worth every penny! <br>Skewers: Both Hotate and ChaSiu are good. ChaSiu is a must try! I usually don't like fatty stuff, but the pork fat here tastes just like heaven. <br>Stir fried soba: The only dish I didn't enjoy. Taste bland and not in good presentation. The dish came out without edge being cleaned, it was really not a pleasant thing to see onions and sauces all over the plate. I understand it must be a busy, but people eat with eyes. <br>Overall we had a great night in KaiZan, looking forward to try their premium omakase.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/GiOcAY3TO-xaC4rVCQTptA/348s.jpg", "caption": "Omakase 4th&5th: OrangeRush and AngryCrab"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/5wIk2mxNPyC3uiPTowRu1Q/168s.jpg", "caption": "Omakase 1st: Escolar&Maguro pearls"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/290nmn5DeolBuPIbTCRVhQ/168s.jpg", "caption": "Night special: uni wrap. Uni+tuna+egg+nori=worth every penny"}]}}, {"review": {"des": "It wasn't before long till I had to come back for the Omakase. It was as good as last time, if not better. The chefs also gave us a complimentary piece!<br><br>One thing I would highly recommend - pay $5 to add uni to some of your dishes. In our case, it was the the scallop shooter, the angry crab, and the dynamyte mussel. The angry crab was sooo mindbogglingly delicious with the uni added on top. We were going to get the uni toro tartare appetizer, but ended up being too full by the time we moved to the dashi on the Omakase menu. <br><br>We also did not mind eating at 4:30pm. We chose to sit at the sushi bar and had so much fun watching the chefs work their magic, especially when they were cracking 30 quail eggs into those shooters. It was such a great dining experience for an unbeatable price. I am already planning my next trip there.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/FWXu2xA3PuN8WW7xTe9HOg/348s.jpg", "caption": "Dynamyte mussel w/ uni added"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/JptJgYOP1lF-iXV2bx9-pA/168s.jpg", "caption": "Shrimp and mushroom in the main course"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ThzJfj5z4gP6OjMalcJ2xA/168s.jpg", "caption": "Oyster and scallop shooter w/ uni added"}]}}, {"review": {"des": "The WORST restaurant experience I have had in a long time. Now service, as a whole, in Chicago restaurants has been lacking but this place takes the cake.<br><br>After refusing to honor a reservation request for the reservation we made months prior, we were sat at the sushi bar and hurried into deciding on the omakase menu.<br><br>Each dish was rushed from the start. After barely taking the last bite the next course was dropped in front of us. Food was fine, nothing you can't find at the million other sushi restaurants in town. Fish was fresh but they kept deciding to cover it with spicy mayo or even worse burning it with the  torch that gives everything a bitter butane flavor. A couple dishes were so bad we didn't even finish them (defrosted New Zealand mussel course & squid salad - I'm talking to you)<br><br>Finally halfway through the final course we are brought our bill and told our time was up. Excuse me?! YOU set the omakase menu, YOU set the pace of the courses and then IM told I need to leave before I'm finished?!<br><br>Don't offer a 10 course tasting menu if YOU can't serve it in the 90 min. time limit YOU set.<br><br>Kai Zan can get bent. I'll be taking my money elsewhere and never recommending this place to anyone.", "pics": null}}, {"review": {"des": "Great service great food nice atmosphere - will be back! <br><br>We tried the omakase and enjoyed majority of the courses! The server was very knowledgeable and accommodating of food allergies.", "pics": null}}, {"review": {"des": "How have I not already written a review of Kai Zan!<br>This is hands down my favorite sushi and fancy dining restaurant in Chicago.<br><br>This is the Uchi of Chicago with it's quality and artful dishes. A very intimate and personalized eating experience. You MUST get the omakase for $65 (one day, I'll splurge for the premium omakase!!) and treat yourself to the chef's delights. I've even took the omakase menu home so I can occasionally reminisce on these tasteful bites. NOTE: You have to make reservations which quickly fill up well in advance.<br><br>My most recent experience at Kai Zan, my boyfriend and I were seated at the bar right in front of the chefs for dinner and a show! Service is very attentive, friendly and happy to answer questions, explain each dish in detail or make accomodations. Also offered is an uni upgrade to the shooters dish<br><br>The omakase included the Madai Carpaccio, Escolar & Maguro pearls, Angry Crab (sushi bite)<br>Oyster and Scallop shooters (yum!), Orange Rush (scallop bite), Tuna Dashi (subtle but delicious soup), Main (bites of shrimp, char siu, tako yaki octupus ball, and tako wasabi salad), Fiesta Maki (sushi roll), Dynamyte Mussels, and a Sashimi assortment - my kind of dessert!  <br><br>Literally no complaints. Even as a repeat customer, I'm consistently impressed with their creativity and commitment to the art of sushi. Perfect for special occasions for your loved ones.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/VE5y57DLgOIt5mf9Pc8a5A/348s.jpg", "caption": "Sashimi for dessert? Yes please! Quality, quality, quality"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/9cWpOFZG6S8TFAqiVwfgmw/168s.jpg", "caption": "Dynamite Mussels - such a small but perfectly crafted and textured balance of flavors!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/5JYH7wCnWh5rGDw0AAD7iw/168s.jpg", "caption": "A well balanced fiesta Maki sushi roll - yumo!"}]}}, {"review": {"des": "No words to describe <br>Just the best ! <br>Really enjoy everything from great service to amazing food !<br>Thank you for being here in CHITOWN!", "pics": null}}, {"review": {"des": "I absolutely loved it here! I did the omakase and for $65, it's one of the better deals. Everything was so full of flavor. The portions are tiny but it's that kind of place so if you're looking for a hearty meal, don't come unless you plan to order a lot and spend more. If you appreciate fine dining though, to have to come! Some of my favorites were the orange rush, the maguro and escolar pearls and the fiesta roll.", "pics": null}}, {"review": {"des": "This is literally the best sushi in Chicago! I recommend EVERYTHING! The sashimi is so fresh and sweet! The chef choice is definitely a must-have. If you love uni, this is the right place for you! <br>The only thing that can be better is the restaurant is too small. People are very close to each other and tables are small.<br>Tips: try to arrive as early as possible. Their chef choice and uni sold out very soon!", "pics": null}}, {"review": {"des": "Hands down my favorite sushi restaurant yet!!!<br>I've been to Kai Zan a hand-full of times and each time I felt very well taken care both because the service was so great and because the sushi was Amazing!!!<br>Twice I've sat at the sushi bar, which was really fun because the chefs would surprise us with dishes they thought we must try along with our original order! I've also had the omakase, which was incredible especially in a larger group because then you can see how everyone else experiences each dish!<br>From the pearls to the orange rush to anything on the secret menu is to die for!!!<br>And...while this isn't the cheapest meal...it is worth every penny!!!", "pics": null}}, {"review": {"des": "I'd give 4 or 5 stars for flavor of dishes.  Went to 2 for the service. Waitress didn't know anything about the menu or ingredients in the food and didn't bother to ask the chef but just made up answers.  She told us that we didn't need soy sauce after we asked for some and we had to ask for wasabi even though all our food was raw fish sushi and dishes didn't have wasabi in them. Hopefully she was just having a bad few moments. The other staff were attentive and accommodating.", "pics": null}}, {"review": {"des": "Food and service is amazing. I went with some friends and got the omakase course. All servers/food runners were very knowledgeable about every dish that came out. The flavors were all there and shocked your taste buds each time. I was informed that all their desserts are made in house also including their amazing green tea ice cream. Definitely will be returning soon.", "pics": null}}, {"review": {"des": "Incredible! I surprised my husband with a midweek dinner and they did not disappoint. We enjoyed it immensely, everything was wonderful from start to finish. Staff was kind and took good care of us. Anyone that says they don't like sushi, needs to come here and taste how sushi should be!", "pics": null}}, {"review": {"des": "Made a same week reservation and secured a 4:30pm dinner reservation for Saturday. I was a bit put off by the time we were given. I was thinking to myself is that considered dinner or a late lunch? But I really wanted to treat my bf to omakase for our 4 year anniversary so took it anyways. After all, it's my fault to making the last minute reservation. We tried the chef's menu and premium menu. The chef's menu is $65 for 10 courses. The premium menu is double the price with the same number of courses, but not twice the quality. For some reason, they don't print out the premium menus either. I would stick to the chef's menu. Food was fresh and delicious; a great value for omakase style. It's easily one of the better Japanese restaurants in the city. My favorites were the escolar & maguro pearls (2nd) and fiesta maki (8th). On the premium menu, the most memorable items were the fresh wasabi where the wasabi is cut up in tiny chunks, and the dessert which was ice-cream with passion fruit pure and crumble. If I'm paying $120 for a multi-course meal and stating the most memorable items being a condiment and ice-cream, I think it's safe to conclude it just didn't blow me away. To sum up the experience, we were running 5 minutes late, and when I called to let them know, I was told we had 90 minutes to finish and we might not get seated if we don't get there soon. A friend of mine who went recently said she had 2 hours to eat, so it's not the case everyday. Perhaps it's just a Saturday thing since there're more diners so they have to be rigid in sticking to the schedule. The staff choreographed beautifully in bringing out the dishes and taking them away promptly, but we felt rushed. The bill was handed to us at 6pm sharp. They asked if I was celebrating a special occasion the day before when they called to confirm my reservation. I told them my anniversary. When dinner was done, we ordered a dessert (additional one outside of the omakase meals), but there was no effort put into decorating the dessert, and we ended up paying for it. I'll admit that I'm used to restaurants now waving the cost of the dessert for special occasions or at lease decorating it, but either way, why ask me if I'm celebrating anything if they don't plan on doing anything for the guests? We walked out a little after 6pm and it was still bright. It was the strangest feeling since that's normally when dinner starts. <br><br>Warning: make your reservations a month early for those coveted weekend dinner seats, or get stuck with a late lunch time like what I had.", "pics": null}}]}