{"name": "kai-sushi-chicago-4", "reviews": [{"review": {"des": "This place serves very high quality of sushi! We ate here on our vacation in Chicago. Fish was fresh and so yummy. The restaurant was small but nice and cozy.<br><br>We will definitely be back the next time.", "pics": null}}, {"review": {"des": "Let's start with the great stuff...it's BYOB, the lunch special is a great value (especially the two rolls and miso soup for $9.95), and they take orders via text!<br><br>Is it the best sushi in the city? No. But it's pretty damn good and the service is always prompt. Mostly I get it to go in the winter and they provide a ton of soy sauce, ginger and wasabi which I really appreciate. Don't know that I've waited longer than 15-20 min for my order to be ready. In the summer they have a wonderful dog friendly sidewalk patio.<br><br>I'm more of a simple, purist sushi eater, but I've seen the more elaborate rolls and they look good as well. Huge bonus points that they don't use a ton of rice on their rolls and the spicy tuna isn't all mayo . Solid choice and a local small business I'm happy to support.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/wmMIE15GHUT_eixm8uWu3A/348s.jpg", "caption": "Two roll lunch special (spicy tuna and salmon/avocado)"}]}}, {"review": {"des": "Stopped here on the way to Midway because of its convenient location. Overall, I thought it was a nice spot for quick bite of solid sushi at a very reasonable price. <br><br>Ordered the edamame and the Sushi Platter which was a perfect amount of food for a semi hungry individual. The rolls were all super tasty with good quality fish across the board. <br><br>Would revisit again and hopefully enjoy the outdoor seating next time.", "pics": null}}, {"review": {"des": "This place is just OK. I've been here a couple times with my husband. If your looking for a really good sushi and nigiri place, this is not it. But if you just want to have quick meal just to have something in your tummy, then go ahead.", "pics": null}}, {"review": {"des": "Not real wasabi!!!! Ok so what keeps this place from me giving it more stars is the fact that they try to pass off the horseradish stuff as real wasabi and charge extra for it.  I've had real wasabi before at several restaurants but most sushi restaurants just pass off a horseradish paste that has been flavored with wasabi as wasabi.  When you get real wasabi it isn't a paste it looks like a finely chopped root and has liquid in it.  It also isn't as strong as horseradish but has great flavor.  The stuff they try to pass off as wasabi tasted exactly the same as the horseradish paste that was on the other plate.  <br>The rolls however were delicious.  I had a dragon roll which was good and a roll that had salmon with fresh lemon slices on it that just was so clean and fresh tasting it was wonderful.  The yellowtail was nice and tender as well.  They have great lunch specials and deliver so that is also a plus. I will definitely be back but will pass on paying extra for what they think is real wasabi.", "pics": null}}, {"review": {"des": "This is my go-to spot in the south loop for sushi. I usually order rolls from here. I've had the udon special which was tasty. It has a pretty standard menu with a couple of daily specials. You can text them your order and they will text back letting you know when it'll be ready.", "pics": null}}, {"review": {"des": "I went to kai after the riverboat architecture tour! we were pretty hungry so we ordered an appetizer and three rolls. between our appetizer of squid salad (delicious) and our rolls (delicious), they Brought us a complimentary cucumber salad (delicious). They have much more of a variety of rolls than the one near my house in Lakeview, which is still really (delicious). It tasted super fresh and was followed up by a complimentary half of an orange as a sweet treat. definitely a bang for our buck!", "pics": null}}, {"review": {"des": "We were starving. Seated right away. It was really busy and really hot in that restaurant. <br><br>It took a long time for the waiter to take our order and for the food to come. When they get slammed both inside and outside (on the patio) and there are only 2 waiters/tresses, then it gets hard to manage. <br><br>We had the tartare, Toro, salmon roll, and sashimi. The sushi was good, very fresh! It was beautifully done. The tartare sauce had so much flavor. I'm not sure I'm a fan of it being served on chips.. But every restaurant does chips so that's okay. The Toro was fatty and I loved it! <br><br>Overall, I wish the experience of waiting and being boiled inside didn't ruin our dining there. Not sure if I should give them another try.", "pics": null}}, {"review": {"des": "I think this place is alright. Don't expect to be blown away or anything, but if you need an ok sushi fix then go for it. I would come back but I wouldn't immediately think of this place.<br><br>I went with three people and we ordered 3 rolls, 5 orders of nigiri sushi, and 2 orders of sashimi. Total came to about $36 per person, which is decent. I wasn't full by the end of it though.<br><br>To begin with the rolls are very eh. They're not bad but there was nothing about them that made me think \"OMG this is the greatest place ever and I have to keep coming back.\" <br><br>The sashimi and nigiri were both good. I'm obsessed with yellowtail, and if you are too, they have reasonable rates for nigiri and sashimi so I recommend that you come here for this and not the rolls. The fish used tasted quite fresh and didn't have too much of the \"fishy\" taste finicky sushi eaters hate.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/yNmxBLwlBlv04g10yFDoCg/168s.jpg", "caption": "Rolls at Kai"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/hYygNDiSTjr_M7bWrMtl1Q/168s.jpg", "caption": "Yellowtail Sushi, highly recommend"}]}}, {"review": {"des": "Decent sushi. I came during lunch hour on a weekday and the place was about half full. Nothing extraordinary to report, and especially for the price I don't think I'll be returning. It's a good spot for your sushi fix if you're in the South Loop overall though. I did like that they had 6 veggie rolls but the quality wasn't anything to gush over. I got the avocado, cumcumber and sweet potato tempura. My favorite was the tempure by far. Our waitress was incredibly friendly and sweet. Wish I got her name. One thing to note is that they give you cucumber salad in the begining so that was nice. <br>Good enough to go to if youre craving sushi, not somewhere for anything amazing.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/5iV71Upn927hKPXj7-PL9A/168s.jpg", "caption": "Sushi rolls"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Zvz4szkUdA8beVEp7Ju_QQ/168s.jpg", "caption": "Miso soup and cucumber salad"}]}}, {"review": {"des": "Whenever I'm in a sushi mood, I hit this place.  Spicy tuna hand roll, w/ some extra spice is definitely worth getting.  also the Dragon Roll and the Sakura Blossom Roll...can't go wrong with those.  Last couple of times, the wasabi is a little too mild...they need to punch it up a bit.<br>The place is clean, everyone is friendly...can't miss with this place.", "pics": null}}, {"review": {"des": "Just moved to the neighborhood and had to try out the closest sushi. This place has great service and very fresh fish. Great prices and can't wait to try more rolls.", "pics": null}}, {"review": {"des": "In the summer they have a small terrace that can be nice to sit in. The sushi is really well priced. They have some good specials.", "pics": null}}, {"review": {"des": "Delicious sushi and appetizers at this tiny south loop gem. The menu is simple with a handful of unique rolls that have all been delicious. The Chicago Fire seems to be everyone's favorite, but the sushi appetizer and shrimp shumai are also delicious. <br><br>Inside is tiny, seating only 30 plus 4 seats at the sushi counter. It's BYOB and has amble sidewalk seating in the summer. Dog friendly too!", "pics": null}}, {"review": {"des": "I was intrigued by the photos of the fresh looking sashimi and sushi so I decided to give it a try. <br><br>:: service & experience::<br>Service was extremely attentive. The Cubs were playing that night so I shamelessly asked them to turn on the TV. Turns out the TV was there for decoration only haha. Other than that, the restaurant felt extremely intimate since they were playing some romantic love songs. Can be a bit awkward if you come here with a friend.<br><br>:: food ::<br>Even though uni is not in season right now, they have it. Our waitress told me that they get them in fresh everyday. It was good (too chilled/cold) and certainly hit the spot, but not sure if it was worth $10 for two pieces. The sweet shrimp was fine, although I'm not sure why they put some sauce on the fried shrimp heads. The sashimi platter was a decent value, with the yellowtail being the best one. A lot of their menu items have escolar, which I try to avoid. So if that's not your thing either, keep that in mind.<br><br>For the price, it was actually pretty good. But if I want quality, I'd rather spend a little bit more and get something more fresh. Or if I am just craving that irresistible combination of vinegar, rice, and fish, I'd rather go somewhere cheaper. Kai Sushi is in the awkward mid-range position that does neither exceptionally well.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/J_BK6ijYYMCrWge4EHKPiQ/168s.jpg", "caption": "{clockwise} uni, sweet shrimp, chicago fire roll (salmon, tuna, and escolar), and fried shrimp heads"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/OvoQsNEt1EI1AsVjmcx92g/168s.jpg", "caption": "sashimi platter deluxe"}]}}, {"review": {"des": "Stopped by Kai Sushi after work with a co-worker who received recommendation from our boss on an affordable sushi spot. It's kind of hidden but definitely worth finding. Right on 13th and Michigan!<br><br>We sat on the patio since it was such a warm summer night. Before we got our main dishes we were served this fresh cucumber salad as a complimentary appetizer. I loved this because I was super hungry! (Pictured) <br><br>I ordered an unagi roll and spicy crab roll. (Pictured, left-unagi, right-crab) Each plate was no more than $5-$7. Also each plate came with 8 rolls! The rolls were huge too. The rice on each was nice and sticky, exactly how I like it. The unagi roll was my favorite, I've never tried eel before but now that's definitely going to be my go-to. The spicy crab could have been spicier but it was mild enough to satisfy me. <br><br>Our dessert was a beautifully cut orange that my friend and I shared, this was also complimentary :) Love places that serve free food! <br><br>Service was sub-par. Didn't have to wait long for our food either. Server checked in on us once but we were there near closing so that's a bit understandable. <br><br>Some folks sitting next to us didn't finish their wine so my friend and I shared more than half full bottle <br>of pinot gris. (Pictured) Surprisingly nice pairing with the sushi! Kai Sushi also serves some drinks so that's if you're liking then I'd say check this place out!", "pics": null}}, {"review": {"des": "Conveniently located in the south loop, the location is small but cozy.<br><br>Service is fast. The cucumber appetizer that they give everyone is yummy!<br><br>I ordered the chirashi bowl ($21) which comes with a bowel of miso soup and 10 slices of sashimi and 2 eggs. The fish is very fresh and delicious but I was expecting more! Pricey but good.<br><br>They've got some pretty good lunch specials here it seems like, will be back then!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/nYaZ346Fw8rbdfjll__kCw/348s.jpg", "caption": "Chirashi bowl"}]}}, {"review": {"des": "The Dynamite & West Town rolls were amazing!  Found my new south loop sushi place!  :)", "pics": null}}, {"review": {"des": "I've never had anything bad here, but I do have a few favorites: the chicago fire roll has four types of fish and is fantastic. their green turtle roll has mango - it adds some sweetness to the roll that you didn't expect to be as welcome. They do take a little long to serve everything, which isn't necessarily bad seeing that I'd assume it's because things are fresh and made to order.<br><br>The place is fairly small, so not the best place to go during the winter when the patio is closed. It is BYOB, so take advantage of that. Super convenient spot in the south loop.", "pics": null}}, {"review": {"des": "I thought this place was ok fish and mediocre service.<br><br>I went at an odd hour around 3:30PM so there was only one other table there. A ton of staff working though and it was impossible to get their attention to order...<br><br>I ordered the squid salad and tried the cucumber salad / miso they give you with the chirashi bowl. Most of the stuff tasted like Korean cuisine, was a bit pickled and not usually what you'd get. Squid salad didn't taste too fresh and didn't care to finish it. When I got my chirashi bowl I thought the fish to rice ratio was off (wasn't much rice). The rice wasn't the usual sweet vinegar taste. It was very salty and I had to drink a lot of water to down the taste which was a bummer.<br><br>I think I would try other places before considering coming back.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/jeuXIhNdoU7udExYj_RuVw/348s.jpg", "caption": "Chirashi bowl"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/VZmUwZPel546emsYZj3lCg/168s.jpg", "caption": "Squid salad"}]}}, {"review": {"des": "Spotted on my drive back from work, ended up going there for a random dinner during the week. Fantastic seating arrangements outside with nice decor friendly wait staff. Ordered the Chicago Fire Roll, the Green Turtle, and Sweet Potato veggie roll. Very cheap in comparison to other sushi restaurants and it's BYOB. Total bill came out to be under 40 dollars and we were stuffed. Would recommend but be warned it's nothing crazy fancy. If you are looking for a solid sushi fix this is it!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/tFpNzzwKTy5Tnol2teRjCw/168s.jpg", "caption": "Green Turtle Roll"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/AYq_rZj1r6vVpeiUYnk-iQ/168s.jpg", "caption": "Chicago Fire Roll"}]}}, {"review": {"des": "The service is pretty good but the sushi itself is typical \"meh\" American sushi. All of the special roles have WAY too much going on and way too many sauces on it... the fish is kind of mushy in texture as well so the food is not the greatest. <br>However, it is fairly cheap and is a cute atmosphere", "pics": null}}, {"review": {"des": "This was my first time here as I was craving sushi and my fave place in Wicker Park was closed. Not bad, the rolls (lobster, crab) weren't bad at all. They've a fairly large selection. I'll probably visit again once their patio opens up.", "pics": null}}, {"review": {"des": "I like kai. <br>I like their food, and simplicity. <br>One of my casual go-to place. <br>But my experience past week was not acceptable. <br>The server was referring me and my sister obviously in our 30s as 'girls'....... I don't care how old we are, you never refer your customers as girls, or boys.... <br>She kept calling us, and using slangs...<br>We were very UNCOMFORTABLE....<br>Please train them properly...", "pics": null}}, {"review": {"des": "That's an updated review based on my experience today.<br><br>I ordered on the phone for carry out. I was told to pick up after 15 minutes which is what happened. Found my food ready BUT the system is down and they only accept cash which I didn't have on me. I wasn't told that on the phone) I drove all the way to pick up the food) I was told to wait until the system gets fixed. Waited for 15 minutes then asked how long do they need more and they didn't have an answer. so I gave up and decided to leave. <br><br>One of the waiters told me to go to Jewel osco and get cash back if I want my food. <br>No thank you, I will go to another restaurant and get my dinner. I'm not wasting more time to get cash to eat raw sushi with crunchy stuff that's been sitting around for 45 minutes and pay for it.<br><br>I am a regular customer, I come here at least once a week. <br><br>Apparently, for only $20 they prefer to throw my food and lose a regular customer and have a bad review, than ask me to pay it on my next visit. <br><br>Or have it complementary for my patience when it's their fault, and when they wasted at least 45 minutes of my time without even a single apology. <br><br>Very disappointing.", "pics": null}}, {"review": {"des": "Great, tasty, no frills sushi place with a nice outdoor patio. <br><br>The first time I went here I wasn't too impressed. Then I learned about the lunch special and realized the place is actually pretty great. The crunchy crab roll was great, the spicy salmon was just okay but the presentation was great, and the ocean roll was great (but that's not part of the lunch special). Also I've never been a fan of miso soup but their version of it is fantastic.  <br><br>The server was polite and attentive even though she was busy, and overall the bill was very reasonable for a sushi lunch.", "pics": null}}, {"review": {"des": "Kai was great. Went for the first time to meet up with some friends and brought along some first time sushi goers as well. Everyone was really pleased. The staff was friendly and the wait for the food was short. Pricing was definitely fair as well.", "pics": null}}, {"review": {"des": "It was my first visit today, we came for dinner. When the two of us sat down and were handed paper brochure menu, to be honest I was a bit skeptical at first. But when the food came I am pleasantly surprised by the portion and the freshness of everything on the plate. I ordered sashimi appetizer and the simple salmon roll, aiming for a lighter dinner----and I ended up being so full. The rice:salmon proportion for my roll is like 1:3. And my sashimi set came with thick cut pieces of delicious, fresh tuna, salmon, white tuna and albacore. Our server also brought complimentary cucumber salad, which ended up being so necessary for all the rich flavors from my food. Later I decided to get additional squid sushi and the squid was so fresh--you knew it when you can taste the natural sweetness of the generous cut. I would definitely visit again :) BTW I apologize for not taking pictures of my food in entirety, too good that I forgot to take pictures before I almost finished everything", "pics": null}}, {"review": {"des": "Had a really good dinner :) the reviews have it. The fish is fresh, the service is great, the atmosphere is lively. The restaurant is small and intimate and the wait was fast.<br><br>The chirashi don is layered with two pieces of variety of fish. My favorite was the white tuna and the salmon. I had to eat the salmon last (the best for last) because it was packed with omega 3 fatty acids. The only thing I will say is the rice was a little sour/vinegary. <br><br>The other two rolls we got was the ocean and flaming VIP. I'm not a super fan of smoked salmon on sushi but the flaming VIP had a slightly seared salmon draped on top with spicy crab . The sauce was sweet soy. The ocean also lived up to the hype. Crunchy shrimp tempura, avocado, tempura crumbs. <br><br>Overall, it was good service, good portion, and complementary cucumber appetizer and fruit dessert completed the visit. Very good.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/3LwVErROdRoMjwRjZMLUKw/168s.jpg", "caption": "Chirashi. Salmon is SO GOOD."}]}}, {"review": {"des": "This is my absolute favorite sushi restaurant in all of Chicago. The Chicago fire, ocean roll and miso soup are my three must haves. The staff is fantastic and always remembers our order and will deliver in less than an hour  just after a simple text message. Highly recommend", "pics": null}}, {"review": {"des": "It's shocking that a place like this have such high review. Either the other reviews are done by fake accounts or chicago just really have no idea what is a decent sushi place. I would give this negative stars if I could. <br><br>The sashimi was NOT fresh, especially the SWEET SHRIMP. We had to eat RAW SHRIMP HEAD, yes you heard me. Kai Sushi, everything you put on the plate should be eatable, don't give me fried shrimp head with the sweet shrimp sashimi if you don't cook it through!!<br><br>If this isn't bad enough, the manager's reaction is asking if we want more shrimp head... I mean seriously??? Like 2 raw shrimp head with nasty organs inside is not bad enough, and you are offering us more shrimp head?? Oh and she said maybe give us ice cream for free.<br><br>Lady, you just served us RAW seafood that could cause diarrheal and easily upset our stomach. <br><br>The dry tuna, salty mackerel are not even worth mentioning comparing to this nasty shrimp head. We left the store extremely angry, and now 4 out of 6 of us are having upset stomach.<br><br>Let's also not forget we ordered fresh wasabi for $3, and it was never served. <br><br>Terrible, just terrible experience.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/sGOVCFYup7IcECJsVQVg9A/168s.jpg", "caption": "Dry tuna, no moisture and you can see the fish meat is falling apart"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/vc-42NHQ4hjcV9fSA5S54A/168s.jpg", "caption": "Yes, the nasty liquid from the shrimp head... nasty, just nasty...."}]}}, {"review": {"des": "We ended up here bcos of the kids but always lacks something.., I am not crazy about their sushi!", "pics": null}}, {"review": {"des": "TLDR: the rolls here are absolutely delicious (5 stars) BUT they charged me more than what I signed for and will not respond to my follow-ups which is why I give it 2 stars. Please doublecheck your receipts and credit card statement to see if it matches up. <br><br>When going through my credit card statement a couple weeks after eating here, I noticed they charged me $50 flat which is weird because my food + tax + tip was $41.91 (I have receipt evidence). I'm pretty sure restaurants are not allowed to round up? I contacted them multiple times but was ignored. I'm not upset about being charged 9 cents more but moreso upset at the principle of them charging more than what I signed for. If they rounded up for other customers, imagine how much extra money they're making. <br><br>This place is right next to my apartment so I finally decided to give it a try after seeing the great reviews on Yelp. I came here with a group of 4 and we sat outside which was perfect for the breezy cool summer night. It's BYOB so we brought beer from our apartment upstairs. My boyfriend and I ordered 3 rolls to share - Flaming VIP, Volcano & Super Crunchy. Holy moly..everything was delicious and we devoured everything! The only downside is that it's a bit pricey since the special rolls are $12.95-$13.95 per roll so it came out to be around $25 per person.", "pics": null}}, {"review": {"des": "I've been here a few times and the food has always been good. I really want to give this place five stars, but today when I placed an order for pick up, I was told it would be ready in 15 minutes. 30 minutes later and still no food. I'm still sitting here while I write this. The restaurant isn't full. Lots of empty tables. Why am I waiting for my food?", "pics": null}}, {"review": {"des": "Even though we live 2 blocks away, we hadn't been back for a while. We decided to do a Monday night dinner at Kai and I was disheartened by how far they've fallen. <br><br>First the place needs a good cleaning. Floors were dirty and cobwebs were visible in ceiling corners. The tiny menus had been reused so many times, mine was splattered with soy sauce. Second, the sushi isn't that great. The Chicago Fire roll was missing something. Tasted boring.  All the rest of the rolls were bland and mushy. The special Tuna Tartar was decent but would have worked better as a poke.  It also was mushy. I guess the only saving grace was the meal was relatively cheap but it's obvious you get what you pay for.<br><br>Personally I think sushi should be unique and flavorful. And unfortunately Kai is going for boring and mushy in a setting that needs to buy a Swiffer.", "pics": null}}, {"review": {"des": "Nice little sushi spot! We enjoyed the complimentary cuke salad and orange sections. The edamame was really fresh, as was the white tiger special roll. Check out the lunch special 2 roll menu choice for a good deal.<br><br>Service was friendly and prompt, and it's easy to get here from the train.", "pics": null}}, {"review": {"des": "Kai Sushi is my go-to sushi spot in Chicago. It's BYOB, has reasonable prices, quality fish, and nice servers. It's a small space, so during the winter months it can be more crowded (you might have to wait for a table). However, when the weather gets nice, they have outdoor patio seating which effectively doubles their seating area and makes for a great experience sipping on chilled white wine (they provide an ice bucket) and feeling the sunshine. We usually get the ocean roll, and I also recommend the green turtle. They often have food specials which might include a seasonal / unique sushi roll or food item (they had udon soup last time I was there). After you are done with your meal, they bring small pieces of sliced orange with the check. It's a great way to end the meal.", "pics": null}}, {"review": {"des": "So, sometimes you walk in to a Sushi restaurant in a city your are just visiting and you take a chance. Tonight was the biggest surprise for me.<br><br>I asked the Sushi chef to feed me, oh my god what a surprise.<br><br>Every plate was out of this world.<br><br>I will be eating here for the rest of the week every night", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/svtUwtjh9vgXSpWZPp88gA/168s.jpg", "caption": "Yellow tail"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/2xQnLiunq1XHkNtZ64KNwQ/168s.jpg", "caption": "This is an amazing place. Every item is out of this world. I have never had Sushi this good."}]}}, {"review": {"des": "Great food! The location is really nice too. Both indoor and outdoor service. I've been here a couple of times already.", "pics": null}}, {"review": {"des": "I'm a fan!  Loved their service and the Sushil was amazing.  We ordered miso with edamame as usual... What really got my taste buds excited was their specialty spicy tuna. <br><br>Staff was very friendly, and the ambiance was casual.  We loved the corner table right behind the structure pole, BYOB made our experience even more enjoyable without worrying about a hefty $$ bill.  Chef stays in touch with his guest by sending something very special; ours was ice-cream.  I think that's a very good quality of any chef who typically doesn't get to see their guest but yet makes a connection with small gestures.  <br><br>overall a must try - little gem of a place!", "pics": null}}, {"review": {"des": "I appreciated and loved every little detail in this small restaurant. I dropped by for an early dinner and the place was pleasantly chill. The waitress was very kind and helpful - I was asking stupid questions like is Chirashi big enough and she did her best to come up with an answer. I ended up getting Chirashi + 2 pieces of salmon sushi. <br><br>The food really hit my sushi craving. All the fish pieces were very tender (and fresh enough), and the portion was reasonably satisfying. I'd love to go back soon and try the rolls that others recommend.", "pics": null}}, {"review": {"des": "Friend and I came here on a Friday evening at 6:30 - it was probably half empty and we were seated immediately.<br><br>We were given menus, but once we had decided our order, had a bit of a hard time trying to catch the eye of a waiter/waitress (sort of a free-for-all). We shared the sashimi appetizer ($12 for 6 pieces of fish - salmon, tuna, and whitefish), which was alright. The fish was okay, but the salmon was quite buttery!<br><br>Salmon Avocado Roll - lots of salmon, and quite worth it<br>Chicago Fire Roll - BEST BANG FOR YOUR BUCK $9 for fresh fish and some avocado!<br>Dynamite Roll - This was baked scallop topped with imitation, and definitely not worth the $13<br><br>Again, took a long time to get their attention to get the check and then process the payment.<br><br>This is conveniently placed, but the quality of the sushi and service matches the price.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Q73nElN8GLtuwkkbLegbGA/348s.jpg", "caption": "From left to right, close to far Chicago roll, dynamite roll, sashimi app, salmon avocado, Chicago roll"}]}}, {"review": {"des": "Ordered delivery from here and the food arrived fresh and on time.<br><br>Sashimi Platter (5/5): the slices of fish were large and fresh<br>Crab/ Scallop Roll (5/5): delicious, love the combination of flavors<br>Eel Nigiri (2 pieces)--fresh and great flavors.<br>Seaweed salad: good, but my complaint would be that the portion size is very small.<br><br>It was very nice that the restaurant gave me 2 spring rolls for free with a happy face written in mayo sauce--cute gesture!", "pics": null}}, {"review": {"des": "I have always been curious about this place as my ex gf lived in the building that this place resides. I recall smelling the raw goodness almost every time I set foot in the building; not to mention the place always seemed packed. <br><br>I decided recently it was time to finally check it out. I realized the place is BYOB as I noticed there wasn't a bar...I obviously stuck with water due to this fact. I ordered a couple of pieces of eel and it was very good. The spicy tuna was very good as well. There was another roll on special that we ordered that included orange chunks...was pretty meh. Outside seating available for all the summertime al fresco fans.", "pics": null}}, {"review": {"des": "Ate quite a few rolls there and took some to go. It was semi crowded but I felt like I was taken care of I even filmed some for my YouTube channel", "pics": null}}, {"review": {"des": "This was our first time trying this spot and the sushi was delicious. Very friendly waitstaff and wonderful atmosphere with outdoor dining. I would highly recommend and plan to return.", "pics": null}}, {"review": {"des": "A pretty good sushi place. It's chill and quiet but everyone is friendly. <br><br>We got the sashimi platter, ocean roll, rainbow roll, and the blue tuna special (or something like that). <br><br>The sashimi platter and ocean roll are things that i definitely recommend. The fish is really fresh for the platter and the ocean roll is just a good roll in general. Definitely worth getting. <br><br>The rainbow roll was alright. Nothing to go crazy over. It was a pretty basic roll that is more on the safe and simple side of the menu. <br><br>Finally, definitely keep away from the blue tuna special thingy. On the original roll, it was supposed to have seared tuna, but since my friends and I don't particularly like it, we just got regular raw tuna. The roll's filling is crab meat and it did not go well with the tuna. It made everything really heavy and thick in texture. It definitely needed a sauce or just something sharp or crunchy to cut through the monotonous texture and flavor. <br><br>Lowkey feel like this place is more on the bougie end of the scale. The prices aren't too crazy but are still up there. (I didn't want to be the fatass of the group so I didn't order more when I definitely could've eaten more) <br><br>Give it a visit if you want fresh sushi and don't mind spending at least $30.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/nSYWD2lV8eWD0UCsMKo72A/348s.jpg", "caption": "Ocean roll with 2 unagi nigiri. Get this."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/VmFsHjrTLKpnuZKIbnyCXA/168s.jpg", "caption": "Rainbow roll with salmon sashimi. Pretty good."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/miSWud93Ms3ulZJ_IfMGRw/168s.jpg", "caption": "Blue tuna special roll. Just avoid this."}]}}, {"review": {"des": "Fresh fish, excellent service! The sushi chef (Marcos) made a special santa Barbara uni with quail egg and red tobiko. it was absolutely DIVINE! Super affordable pricing,go try!", "pics": null}}, {"review": {"des": "I live a block from Kai and have gone here for majority of the time for my sushi fix.  They have a nice outdoor seating area as well during the summer months and a friendly staff.  <br><br>I always get the sashimi appetizer, for some reason I think it is a really good deal especially because the pieces are like two pieces and tasty.  <br><br>Then I always try something on their specials board or order any of the variety of rolls.<br><br>The complimentary salad and fruit at the end are great as well.", "pics": null}}, {"review": {"des": "very good and tastey!!! I got the kai veggi twice!!! my partner enjoyed his sushi delux", "pics": null}}, {"review": {"des": "Love their sushi! They offer special rolls, which are amazing! We got the Ocean roll, the green turtle roll, and the volcano roll! Perfect combination of sweet, crunchy, fresh, and spicy!", "pics": null}}, {"review": {"des": "Their delivery wasn't so great but I came to try it out in person and my experience was much better!<br><br>Service was accommodating and the waitress was very sweet and nice when we wanted to switch to indoor seating halfway through our meal.<br><br>Lunch special is a good value at $10 for 2 rolls and miso soup. The rolls are tasty.<br><br>Good neighborhood place not too far from the Loop.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/-5YS0dFPtwToefEfoAhdjA/348s.jpg", "caption": "Ocean roll and volcano roll"}]}}, {"review": {"des": "Service was great.<br><br>The sushi was beyond average but not close to great. We ordered the sashimi appetizer the fish was not very fresh. We also ordered 3 special rolls, there was too much rice. The rice made the whole roll taste sour because of the vinegar. If they could reduce the rice to just one layer, that would make everything just perfect.", "pics": null}}, {"review": {"des": "After a terrible experience at sushi sai a month or so ago, it came time again where I had a hankering for sushi on a week night after work meaning not energy, desire or time to travel too far north.<br><br>I picked like 3 places for my girlfriend to meet me at and since she forced me to choose I picked a location closest to me commuting home. Lucky for me it was a great choice!!!<br><br>I loved that this place is BYOB with no fee for parties w/less than 5 ppl. The sushi really is prepared with fresh ingredients! You can tell the fish is not days old. Because of this it doesn't come to your table right away, but it is worth the wait!!<br><br>I think it's a good place to come for a super casual dinner in a small group or catching up with a friend. This place isn't for frills, however the seating is quaint and the lighting is DIM. <br><br>They are definitely reasonable for their price and I'll be back! Everything I had was yummy! <br><br>1 star taken away because of the tight ass of seating & lightening that felt accidentally dim and not romantic like I'm assuming the goal is. <br><br>I'll be back! I told all my co workers about this place, my boyfriend, and even my friends that live out of a state. Good causal sushi spot!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ND_dr3zKTk5aniKKBCfzEw/348s.jpg", "caption": "More than enough to share for up to 4 people! I would definitely get this again."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/hXdVpFr3jP_PpDfuw95iKQ/168s.jpg", "caption": "Couldn't even finish a whole order and it was 2 of us!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/OsgDkUpGEIk4m2XwGZXo-Q/168s.jpg", "caption": "Volcano & Dragon Rolls...good as hell. Dragon Roll ( sesame seeds on top) was my personal fave of the 2"}]}}, {"review": {"des": "Generous portions of unbelievably fresh fish; very attentive service. While I was there, I actually overheard a conversation between the owner and a fish supplier, talking about what's best in season -- a neat behind-the-scenes look at the care that goes into serving good sushi, before the fish even gets to their fridge.", "pics": null}}, {"review": {"des": "One-time delivery review: <br>This is a hidden gem! I don't find myself in South Loop often so it's nice that they deliver. The sushi was very fresh; we tried a variety of rolls including tuna, salmon, crab, and scallops. The shrimp tempura in the rolls was amazing and I wish I knew why...it was almost sweet or just super fresh, not sure...<br>It wasn't a perfect experience - the miso soup seemed a little processed/overly concentrated, and I didn't love the spicy stuff they put on my scallop sashimi, but overall: two thumbs the F up!", "pics": null}}, {"review": {"des": "Stumbled upon this place by the amount of high reviews it has on yelp. To my disappointment the sashimi wasn't fresh. The texture was good, however the taste was off. The fish seemed to have a hint of sourness to it. It wasn't so bad that I would consider the fish bad, but it wasn't fresh. As for their rolls, they were okay. Either heavily sauced or had something like mango, avocado, or another potent fruit that would mask the fish. <br>Their menus aren't Japanese like at all. It's very Americanized if anything.<br><br>The service was so-so. We came in during a rush, the host seemed to be frantic and the server  seemed rushed too.", "pics": null}}, {"review": {"des": "Great service. Small and quaint location. I enjoyed the VIP and the OCEAN. I'll be back to try more of the menu. It was great for a night without cooking. Lots of locals came in, there was GrubHub and even a group from out of town. I enjoyed watching them make every thing fresh with genuine care for their craft. I highly recommend you check them out. It's worth giving them a shot.", "pics": null}}, {"review": {"des": "Good rolls. Had to try the special rolls and a \"regular\" so I ordered a Chicago Fire and a Spicy Tuna. Liked the Chicago Fire. Never had a roll with fried tempura batter on the outside before. Spicy sushi was good (fresh) I was hoping for more spice but that's just me.", "pics": null}}, {"review": {"des": "It was a quick stop on the way back to the suburbs and  evem though we found out it was byob a little too late, this place is still delicious!  We just stuck to the pieces rather than the rolls but even without their fancy sauces,  it was still delicious!", "pics": null}}]}