{"name": "katherine-anne-confections-chicago", "reviews": [{"review": {"des": "This adorable little cafe is as cozy as it gets. Vintage bright green furniture and a few little tables and twinkly lights greet you as you walk in-- where you can immediately see a crew hard at work making chocolates, hot chocolate, marshmallows, and all the vibrant flavor options they include on their menu. I can't believe I haven't reviewed them yet!<br><br>Last week Sarah S. and I had a flight of 3 hot chocolates each-- one was the fancy signatures (salted caramel, Mexican, hazelnut) the other were special/seasonal (Earl Grey lavender, shoo fly pie... and something else!). Amazing. You can get a regular or a flight, and they have a ridiculous amount and range of homemade caramels and truffles every single day, including a few vegan options! :D <br><br>This is my happy place.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/N2ERzpWoXFUmExF-A5gUgA/348s.jpg", "caption": "Hot chocolate flights!"}]}}, {"review": {"des": "A speciality chocolate shop with an added dose of familial comfort. <br><br>Truffles are around $2.50, caramels $0.75 and marshmallows $1.00. They have the most amazing flavor combinations that change OFTEN, so you can tell they are creative, innovative and dedicated to their craft. Don't get me wrong, their \"basics\" like a salted caramel marshmallow and honey vanilla caramel are amazing. But then they get your tastebuds dancing with rose & rosè marshmallows and cherry balsamic truffles. <br><br>Let's not forget their staff. Being a family owned business, their tot is running around back with a huge (sticky!) smile. SO CUTE. Last time I went they threw in a few free treats of their new flavors-- just because! <br><br>I love Katherine Anne's; I truly, truly do. :)", "pics": null}}, {"review": {"des": "The hot chocolate at Katherine Anne is SO good. Up until recently, I thought the only place to get hot chocolate in the city was Mindy's, which is good, but I don't always want to pay $8 for a slightly better version of my homemade hot cocoa. The drinking chocolate at Katherine Anne is extremely rich. They come in many flavors and two sizes, but I think the smallest size (I believe 7 oz) is more than enough for me. I had the award-winning Salted Caramel flavor with a Mexican Hot chocolate marshmallow. The caramel flavor was perfect, and the marshmallow flavor blended nicely with the caramel. One of the servers was also kind enough to give my friend and I a couple of Rosemary Caramels to try. Will definitely be back from more chocolatey goodness!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/TOnheBiGB5r5SVpNc6VX7w/168s.jpg", "caption": "Salted caramel hot chocolate with Mexican chocolate marshmallow!"}]}}, {"review": {"des": "absolutely amazing. Katherine called directly and consolidated my order to save me money and packing. Best choco in the world. What an absolutely splendid human being.", "pics": null}}, {"review": {"des": "The people here are so nice! They're very friendly. The place smells amazing like cocoa. This place definitely has the best hot chocolate I'll ever have, and I can't wait to come here in the winter time. I wish I tried some of their truffles but I will next time. The drinks come either in a 7oz cup (or maybe 9) or a 13oz. It's the most rich hot chocolate with the mocha added. I hope they add the lavender flavor again! My friends really enjoyed the blueberry cheesecake flavor since it was really light. Can't wait to come again!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Ns0AwKiufypklA-4imCtOg/348s.jpg", "caption": "Hazelnut mocha with a vanilla bean marshmallow The left one is salted caramel The right one is blueberry cheesecake"}]}}, {"review": {"des": "Katherine Anne!!!! Are you channeling Meredith Brooks' song \"Nothing In Between\" (censored title)? Just wondering because it's running through my head while I'm writing this. But girl... It's so true!<br><br>This is a chocolate cafe and that's just about it. Don't go expecting tea, coffee or a scone. Walk yourself to Bang Bang if you want pie. Katherine Anne Confections is a great spot for catching up with a friend, a special parent-child outing, or maybe a casual (yet memorable) first date. It's perfect for gifts or to-go. You can also order it online!<br><br>This is what you can get from Katherine Anne Confections in SO MANY AWESOME FLAVORS:<br>* Drinking chocolate<br>* Iced drinking chocolate<br>* Truffles<br><br>There are a few other things too. There are caramels (pretty dope), sandwiches (not a fan - I've tried two and both were epic fails), and soup (I haven't tried it). My eyes are always bigger than my stomach and I order far too many items. I've gotten flights of drinking chocolate and many truffles and could hardly finish all of them. I've also gotten iced drinking chocolate, truffles and a sandwich and the struggle was too real! These delights look small but they are surprisingly filling!<br><br>The people who work at Katherine Anne Confections are down-to-earth, friendly and helpful. They eagerly make recommendations of popular items, staff favorites and their assessments of new creations. The last guy cut each of my truffles in half so that I could share with my friend.<br><br>The space is pretty huge, but most of it is an open kitchen. The adorable seating area has a loveseat, some plush chairs, two two-person tables and one four-person table. There is a chandelier and fresh flowers on the tables.<br><br>Anyway, back to the song, \"Nothing In Between.\" Katherine Anne Confections is a chocolate genius and has created a space that really honors that talent. It isn't anything else.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/xVqbwG9nrO7JJWzPP8f9vg/348s.jpg", "caption": "Inside a corn truffle"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/69VbvTy0jOPRL5qKntFn5Q/168s.jpg", "caption": "Mexican chocolate"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/bQ1sUxl4cOTEg98UrK23Cw/168s.jpg", "caption": "Strawberry and butterscotch chocolate"}]}}, {"review": {"des": "Amazing hot chocolate!!! I ordered hazelnut hot chocolate. I got to choose two homemade marshmallows, from which I chose vanilla bean and chai. So so yummy! Highly recommend! Come support your local small business.", "pics": null}}, {"review": {"des": "My absolute favorite place for hot chocolate especially during the harsh winter. I love the semi sweet and salted caramel, they're my top 2 when choosing the flight", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/hvp1EgCFoMIbIjDbVatJ0Q/348s.jpg", "caption": "Flight"}]}}, {"review": {"des": "Katherine Anne Confections is a cute, small cafe in Logan Square that has a fabulous assortment of chocolate truffles, candies, hot chocolates, and surprisingly sandwiches.  After being gifted a box of chocolate truffles from here, I can't go back to eating truffles that can be found at Walgreens even though that makes me sound super bourgie.  These truffles are fresh and heavenly.  They have unique combinations like goat cheese walnut, which literally melt in your mouth.<br><br>I came here for the hot chocolate though so I wasn't going to ruin my hot chocolate appetite with anything else.  They have an excellent variety of hot chocolates and have an extensive vegan menu.  They are really great about customizing options so even if you are okay having milk chocolate but don't want regular milk, they can make it with Almond milk.  Their vegan options were not an after thought and I was impressed at how they took great care with presenting truly great options for vegans and people who are lactose intolerant.  Many hot chocolate places don't let you customize so this was refreshing.  The service was exemplary.  Upon walking in we were greeted by a few friendly faces and it didn't feel fake.  They were very receptive to any questions we had and checked on us after we had the hot chocolate to make sure we were happy.<br><br>We ordered from the vegan menu and got the Mexican Hot Chocolate and the Mocha Hazelnut Hot Chocolate.  They also let you select which marshmallows you'd like in your beverage so I picked the cinnamon for the Mexican Hot Chocolate and vanilla for the Mocha Hazelnut Hot chocolate.<br><br>The Mexican Hot Chocolate had a refreshing spice to it.  It was thick and decadent, but not as guilt-provoking since it was vegan and made with Almond milk.  The chocolate was sweet but it complemented the spice really well.  They also sprinkled some peppercorn on there to add even more of a zest on top of the cinnamon marshmallow.<br><br>The Mocha Hazelnut Hot Chocolate was a nice companion to the Mexican Hot Chocolate because it was milder so if the spice was too much, you could take a break with the Mocha Hazelnut.  This hot chocolate was also vegan and not super sweet but still thick and decadent.  The hazelnut flavor was prominent but everything was very well balanced.  The vanilla marshmallow melted perfectly in the hot chocolate and was served with two candied walnuts, which added a tasty crunch to the soft marshmallow.<br><br>The portions are pretty large and you might either want to split it with someone ($7 for the smallest size, which is what we had) or do the tasting menu ($9, which includes 3 hot chocolates of your choice).  One of these can feel like a meal!<br><br>Maybe hot chocolate isn't your thing?  They do have three sandwiches here and one of them is a vegetarian option.  The Bahn Mi looked intriguing and if I do need something savory to balance the sweetness, I just might try it.  Their cafe curates a warm, neighborhood feel where you can sit and talk to a dear friend or sit alone, observe and/or read as you sip on delicious hot chocolate.  I will definitely be back here to try more of their hot chocolate.  It has a true neighborhood feel to it.", "pics": null}}, {"review": {"des": "My fav cafe/hot chocolate place in chitown<br>Food: solid five star: they have a wide selection of hot chocolate (and they can make it iced too). As for plain chocolate they have 4 scale from sweet to dark. I ordered 85% dark chocolate, but it's a bit too much for me. Def try milk chocolate or bitter sweet next time. Salt caramel is their most famous one tho. And you and ask them to add coffee in it if you needed that caffeine boost<br><br>Space: super cozy. Only have 4 tables and a couch area. People come and go all the time so you can still find a place to study/work if you are lucky. <br><br>Service: they have the most friendly staff ever! 5 start for that!<br><br>Will come back again fo sure!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/TsH8hB3ItygYb6cpXlBpJw/168s.jpg", "caption": "85% dark chocolate iced. With a shot of caffeine woooooooooohoooooo"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/fM64Yo3jnsL7IlIFOS5UwA/168s.jpg", "caption": "Truth"}]}}, {"review": {"des": "This place is so amazing! The chocolate drinks will take you to a place in your childhood that you never imagined. It's that good! As I enjoyed my Mexican chocolate drink, I kept thinking that the next taste could not be as good as the first,  but each drink left me wanting more. By the time we were done,  I was looking at the menu, trying to decide what to get on our next visit. Highly recommend it!", "pics": null}}, {"review": {"des": "I looked this place up before my visit to Chicago looking for the best hot chocolate & Wow it surpassed my expectations. Hands down this was an amazing experience both my mother and I had the sipping chocolate flights witch they pair each one with its own custom marshmallow. * my personal favorite was the Butter Beer Flavor*  The prices I thought are extremely reasonable considering back in Colorado I pay $8 for just one sample size sipping chocolate with no marshmallow and not near as good. The cute little shop gives it just a perfect touch as well, the attention to detail in everything really shows and gives a touch of magic, even down to how its served in little cups on a wood pallet. I will be back before my visit ends and will be recommending this place to everyone as I think its a must in Chicago!", "pics": null}}, {"review": {"des": "If you like chocolate just go here.  You will have no regrets.  My only regret is that I got plain marshmallows to take home instead of something more interesting. You should be prepared that this is a small space with few places to sit, and people tend to hang around to enjoy their chocolate (of course).", "pics": null}}, {"review": {"des": "Honestly, dropping by here was one of the highlights of my Chicago trip. Honestly, I never even knew what drinking chocolate was before coming here. Honestly, I don't know how I lived my life without having this knowledge previously. Honestly, I know this is a lot of honestlies. <br><br>So we got a drinking chocolate flight [insert airplane emoji's here]. When it was served to us I was like, whoa why are the cups so small, but after one sip I knew exactly why. So. Damn. Rich. Some of the richest chocolate I've ever had; so thicc. Definitely can't drink these like normal hot chocolate. My mind was blown. My personal favorite has to have been the Hazelnut, but legit all the flavors I had were awesome. Like, I'm genuinely thinking about ordering some off their website and having it shipped to California here so I can make their drinking chocolate drunk. <br><br>One of those rare must try places. Like, what are you doing sitting here reading this review? Get your butt on over to Katherine Anne's and make their chocolate drunk.", "pics": null}}, {"review": {"des": "Best creamy, tasty hot chocolate in Chicago. Omg! Homemade marshmallows to die for. Support this neighborhood gem and you won't be disappointed. Everything they make, is made with love. Great customer service too! Please don't leave this place without their homemade chocolate truffles. My favorite is the salty caramel and anything dark chocolate. I wish they would have made that recent Yelp list for liquid hot chocolate places to go to. They should have been mentioned!", "pics": null}}, {"review": {"des": "Very cute confectionary, comfortable seating and nice ambiance to enjoy a coffee and something sweet.  Truffles, caramels, marshmallows - I tried a few of all 3 and they were delicious.  Nate, the guy behind the counter, was very knowledgeable about the products, and passionate about the business.  Many unique flavors to try including curry, rosemary, basil, creamed corn & cilantro (although the flavor on that one didn't seem to come through for me).  The marshmallows were big and soft!  They offer seasonal flavors so there could be different options next time you stop in.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/dH_PVVSv0GPlRT5iK9wsGA/348s.jpg", "caption": "Beautiful presentation"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/PGxvxyIhQDsFa9reN7Q2Cg/168s.jpg", "caption": "Interesting flavors"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/iQd9W5Rh6Zzro3Rd0YcEIw/168s.jpg", "caption": "Some seasonal selections"}]}}, {"review": {"des": "Here is where you learn that \"hot chocolate\" and \"drinking chocolate\" are not the same thing.  Drinking chocolate is not for the faint of heart.  Katherine Anne feels like home to chocolate and dessert lovers.<br><br>I had the salted caramel chocolate, the most popular flavor, and topped it with two cinnamon marshmallows.  It tasted like real, quality chocolate made into lava.  You can pluck out the marshmallows and eat them, but I let mine melt into the chocolate at the bottom of the cup and then spooned them out when I was finished.  You won't find anything like this anywhere else.<br><br>There are a variety of flavors to choose from.  The truffles and marshmallows for sale make a great gift or treat for yourself too.<br><br>This adorable shop is tiny though, so seating could be minimal when it's busy.  Go during the week, in the middle of the afternoon, and it shouldn't be a problem.", "pics": null}}, {"review": {"des": "I stumbled onto this adorable shop after dinner last night. My friend and I excitedly perused the many, many options in this shabby chic shop complete with sparkly chandeliers. I left with a Mexican spicy chocolate marshmallow, a goat l cheese and walnut truffle, and the truffle of the week (I think it was a brown butter hazelnut?). All were lovely. <br><br>The part I'm most excited for is the drinking chocolate flights. That's right, FLIGHTS! I don't need to decide. I can have it all! <br><br>I'll most definitely be back.", "pics": null}}, {"review": {"des": "Super cute mom and pop run place that serves up what might be the best hot chocolate in the city! The best part is you can get a flight of 3 different mini hot chocolates (I got the Mexican, Salted Caramel, and Pumpkin Spice), each paired with their own mini marshmallows (which were also outstanding, and you can purchase them separately too if you want!). They were all AMAZING, though the pumpkin spice was my favorite.<br><br>Also, their chocolates were out of this world! The Manhattan cocktail truffle in particular was unique in that it was filled with bourbon and cherries!!! <br><br>Note: the place is TINY. Two tables and a couch area, but that's it. Super cute though!", "pics": null}}, {"review": {"des": "Having French pressed coffee after ages. They make tonnes of hand made chocolates and confectionery right there in the shop. very nice staff. Lots of Paris and French memorabilia on their walls. Found this place by accident while roaming around Armitage . Drop by sometime", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/_9VkfemZBN8zLVYDAnamMw/348s.jpg", "caption": "Life lessons on a cloudy Chicago summer"}]}}, {"review": {"des": "I love love love this place. It's so charming, warm and inviting. The guy at the front taking orders and making drinks was awesome! Very nice and helpful. Ever since I tasted the salted Carmel hot chocolate at the renegade craft fair this summer and I was hooked from the first sip. I'm sooo glad I was able to finally come to the shop and I ordered he flight. It's $9 and you can choose 3 different mini versions of the larger cups. I picked the semi sweet, salted Carmel and the bourbon. All were aaahmazing but the bourbon is my new favorite. You can taste the bourbon with the silky smooth hot chocolate. The flight also comes with mini marshmallows and the presentation is the cutest. I can't wait to come back.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/-HIhQzwsKacauYwQIvTH-A/168s.jpg", "caption": "Cute little cafe"}]}}, {"review": {"des": "Best hot chocolate in Chicago, and I'm a hot chocolate snob. It's pricier ($5 for a 7 oz cup) but it's well worth it. It's super rich, as it's basically drinking melted chocolate. Plenty of cool flavors, and the different marshmallows are a treat. Super nice staff, nice place to sit around and sip some chocolate. Also has delicious tasting truffles.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ybL3fnaNfxH9f2Nyo-_RAg/348s.jpg", "caption": "Just look at this: salted caramel drinking chocolate with a cinnamon marshmallow."}]}}, {"review": {"des": "Maybe I just don't understand artisanal hot chocolate.  I'm just a pleb in love with da swissmiss.  Call me low class...you'd just be stating the obvious...<br><br>K.A.C. had been on my radar for many months.  The build up of excitement was getting too hard to contain.  So we did it.  Traversed for 3 long minutes via motor vehicle.  <br><br>...and it was just...meh.  My husband and I agreed that it was too rich for our taste buds.  All the flavors in the hot chocolate were too overwhelming.  <br><br>I ordered a flight consisting of Mexican hot chocolate, salted caramel hot chocolate, and some kind of lavender tea hot chocolate.  My husband just got a regular hot chocolate.  He's so basic.  <br><br>There was a salty after taste to all the drinks in my flight.    The sweetness, the saltiness, the char from the marshmallows, the tea, the pepper or peppermint flakes (can't remember), was just wayyy too much for me.  <br><br>So why the four stars.  Well I don't want to be an outlier.  Obviously this place is great with 4.5 stars overall.  I can't definitively say that the drinks weren't good, I just think I don't I have the taste buds for them.  Another reason for the four stars is because the staff were so friendly, patient and knowledgeable.  And the decor was stinkin cute!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/vO2phwSwRjMaXXPDxyeA6Q/348s.jpg", "caption": "Truffles"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/g5-7aMo_Lhghph5EqLUPSw/168s.jpg", "caption": "Hot chocolate flight"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/1qi3h9Q23xYoRWvXCtegkw/168s.jpg", "caption": "Hot chocolate flight"}]}}, {"review": {"des": "Drinks: 5<br>Staff: 5<br><br>What a cozy little cafe. We went in 30mins before closing and the only staff working was super helpful. Our first time and he explained the populars and different flavors of chocolate, all made in-house. Each hot chocolate had its unique flavor. <br><br>Must try: Salted Caramel is their winner", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/fJX5Xw7wQA7D9gn1cO0JcA/348s.jpg", "caption": "We got the flight of 3. Darkest chocolate, Salted Caramel, Mexican. All so unique."}]}}, {"review": {"des": "I've heard nothing but great things about this confectionery which is why I had to appease my curiosity. When it comes to the topic of hot chocolate, it's hard for me to find a cup that's praise worthy because most places make hot cocoa with powder or chocolate sauce. Katherine Anne's is the complete opposite! Thank God! Katherine Anne's takes the time to melt the chocolate into chocolate ganache then mixes it in with warm milk and tops it with a homemade marshmallow. Every cup is hand crafted and to die for! <br><br>We ordered: <br>HOT CHOCOLATE FLIGHT- you can choose any 3 of 12 different flavors they offer. I chose the Lavender Mascarpone, Salted Carmel, and Mexican Hot Chocolate. These come in tiny adorable white mugs. Do not be fooled by the size, these little babies are DECADENT! It took me a while to finish them because they were sooo chocolatey. Lavender Mascarpone was a little sour but packed with floral flavor. Salted Carmel is their award winning flavor and def triumphs over all! Mexican flavor was personally disappointing bc it's not like your average Abuelita brand and lacked the traditional cinnamon touch. Instead, they tried to spice it up by adding  chili flakes to the top as garnish. Not my fave and prob won't order again, however still good. What I appreciated most is just how distinct each flavor was. I never had to refer back to the name tag card to know what I was drinking. Achieving distinct flavoring was impressive. Also, I really appreciated the garnishes that sat on top of the fluffy mallows. Lavender had small chocolate candies, Salted Caramel had miniature pieces of toffee, and  Mexican had red chili flakes. Brilliant is this Flight! <br><br>BITTERSWEET HOT CHOCOLATE- apart of the classic flavors family this cup is what I imagine Santa Clause to be drinking in that movie Santa Clause during the scene when his elf Judy brings him a cup and says, \"Not too hot. Extra Chocolate. Shaken. Not stirred!\" This regular size was hard to finish. My guest took the rest home. <br><br>MOLE TRUFFLE-one of the most complex pieces of chocolate I've ever tried. I'm not exaggerating when I say this, when you go for the first bite, make sure it's a tiny bite! This truffle will make your eyeballs pop out and your taste buds go bizurk! It's loaded with cayenne pepper, cloves, paprika, chili powder and walnuts. !Ayi Chihuahua! If you want to try something exciting and out of the ordinary, go for this! To be eaten slowly!<br><br>Can't wait for the colder months to arrive bc I know where I will be going to hibernate! Nom nom nom! Find me in Chocolate Heaven!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/i4W2KNNE-45PfAg5G7NaYA/348s.jpg", "caption": "Hot Cocoa Flight: Lavender Mascarpone, Salted Carmel, & Mexican. Solo cup of Bittersweet and Mole Truffle!"}]}}, {"review": {"des": "The hot chocolate here is phenomenal. Great staff, very passionate as well. We had a flight for $9 where we chose to have the bourbon Carmel hazelnut, semisweet, and the seasonal ginger snap. Great place for the holiday season with excellent holiday themed drinks!", "pics": null}}, {"review": {"des": "Just came here for the first time after moving nearby four months ago. I was thrilled with our hot chocolate flight! If I could give them more stars I would!! Nathan was working when we came in and he thoroughly explained everything and was very engaging. Will be back many many times.", "pics": null}}, {"review": {"des": "On a freezing Saturday in January, the hubby and I ventured out of the warm into the cold, to explore Logan Square. A stop into the small cute confines of Katherine Anne Confections for hot drinking chocolate was just what we needed to chill our freezing bones!<br><br>We had the Mexican drinking chocolate which had a nice spicy warmth to it, and the salted caramel- both were excellent! Since we were eating soon, we carried out a few treats for later. <br><br>The Revolution Brewing Stout marshmallow and Caramel Stout truffles were rich and decadent. And went well with our morning coffee. I think I've seen their stuff at Green City Market and other farmer's markets too, and I'm glad places like this are thriving in Logan Square.", "pics": null}}, {"review": {"des": "Seriously, and without any exaggeration, the BEST and i mean BEST hot chocolate I have ever had in my life. This was the tastiest, most decadent, chocolate drink you can possibly imagine drinking. It is super rich and I honestly can't stop thinking about it other than that I wish they made a second location in the suburbs, please!!!!!! <br><br>Okay, it was a cold wintry night in Chicago as most nights here are and I stumbled here around 6pm on a Saturday night and there was only one other girl calmly drinking her hot chocolate. The barista was super sweet and I got the bitter sweet hot chocolate, I think it was the 70% cocoa one and she had it ready for me in a few minutes. Oh and you get to pick a complimentary marshmallow with it that is also divine. Seriously, this place is magical. It truly is. <br><br>I honestly didn't want my hot chocolate to end. I got the smaller cup and I'm happy that I did because it was definitely filling enough. It's not a cheap cup of hot chocolate, but you get what you pay for as this one was definitely worth it. I will never drink Starbucks hot chocolate again as that is not the real thing. This is it. <br><br>I was over my chocolate and sweet limit for the day so I didn't get to try any of their truffles but maybe next time I'm in the area as I will definitely be back. The people working here are super nice so no complaints, just wish they were a little closer to me.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/T9olJiZkGxL_OMXlfxLwnw/348s.jpg", "caption": "Amazing"}]}}, {"review": {"des": "Heavenly, heavenly chocolates. Katherine Anne truffles amaze me with their creativity, subtlety, and luscious perfection. This is the only thing I ever want for Valentine's Day... or really ever, in life. Thank you for lighting my chocolate world, Katherine Anne!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/bjZoOeSZcFM59A9MQZXWWQ/348s.jpg", "caption": "Strawberry lavender truffle"}]}}, {"review": {"des": "I came in on a HOT day, so there wasn't going to be any drinking chocolate for me. (Had I walked past in January, it would have been a very different story.)  Instead, I opted for six truffles (many of them cocktail-inspired) and nine caramels.  Shout out to the gentleman at the register - he was a gem to chat with and assist in the selection process.<br><br>I brought my treats home to share with family, and the four of us delved into our confections.  After tasting both the truffles and the caramels, I think I'm a bigger fan of the caramels overall.  While both sweets had inventive flavors, I leaned toward the taste of caramels.  Also, the caramels are the cheaper of the two, so you can take all of the flavors with you to try.<br><br>If you're walking past Katherine Anne and wondering if you should pop in, this girl says yes as long as you try a rosemary sea salt caramel!", "pics": null}}, {"review": {"des": "If you have never tried genuine \"drinking chocolate,\" come to Katherine Ann Confections and get one of the \"Flight of 3.\"  <br><br>It's located in between Logan Square and Bucktown neighborhoods on Armitage.  The day hubby and I came happened to be the Mother's Day, so there were a few last-minute shoppers picking up their home-made, rich, and luxurious truffle gift sets on the shelf by the entrance.  <br><br>We went straight for the chocolate.  We each chose three (3) different flavors of chocolate flight (classic, specialty, and seasonal).  These total of six (6) mini cups of drinking chocolate were no joke!  They also paired up with the house-made marshmallows.  <br><br>Here's the summary and reflection on each kind: <br>1) slightly dark: this wasn't your ordinary store-bought, Miss \"that-country\" chocolate powder.  Oh no, we were hooked once we took a sip.  <br>2) hazelnut: the aroma of hazelnut was very intoxicating.  If you are a lover for anything \"nutty,\" try this one out.  <br>3) basil: that was hubby's favorite.  It was refreshing considering we're drinking something that was bold and intense.  In other words, it truly complemented the sweetness chocolate rendered.  <br>4) super dark: it had a high cocoa content (close to 90%).  However, it wasn't bitter and I enjoyed it...A LOT!  <br>5) Mexican hot chocolate: don't ever compare this to the N*est*e Abuelita.  Officially my taste has gotten more expensive.  <br>6) grapefruit maple coconut: it was a seasonal flavor, but would you guys make it onto the regular menu?  I tended to like the fruity things more, and it was absolutely delicious!  <br><br>Nathan at the FOH and Katherine (the owner) were great people.  I could also see the kitchen actions and knew Nathan and Katherine really loved their jobs!  <br><br>\"Katherine Ann Confections\" though isn't attached to a major \"L\" station, CTA California and Western (O'Hare) Blue Line stations are approximately twenty (20) minute walking-distance away.", "pics": null}}, {"review": {"des": "Excellent!!! The best drinking chocolate around. Quaint, casual place; check out the Sofi specialty food awards on a side table. Small tables, sofa and chairs for seating.<br>Discoved this shop at Logan Square Sunday Market.", "pics": null}}, {"review": {"des": "AWESOME!!! Had the salted caramel drinking chocolate with the Salted Carmel and Hot Spicy Chocolate marshmallows and a croissant a la truffle (pumpkin pie truffle). They were both excellent! The place is very quaint and cozy with great decor. It was very busy that night but Eve, the best chocolate wench ever, held it down by herself with no problem. The service Eve provided was unbelievably extraordinary given the potential stress of the situation. Will definitely be back. Highly recommended.", "pics": null}}, {"review": {"des": "This is our second time here.  Staff is super friendly and very helpful.  We had the flight and also a 13 oz hot hazelnut coco.  Every option is delicious.  Salted caramel hot chocolate is my favorite but you can't go wrong with any of their flavors", "pics": null}}, {"review": {"des": "I want to take this moment to thank every deity that exists for imparting a piece of heaven on this earth called Katherine Anne Confections. Whenever my friends visit Chicago and ask for recommendations, I will always point them towards this place first. No wonder it has won so many accolades!<br><br>From the moment I walked into the confectionery, I felt like I was having a spiritual experience. This dainty little shop is so cute with its décor and its cheery barista, even though it was close to closing time. He helped me and my boyfriend navigate the sweets menu, including hot drinks, cold drinks, truffles, and caramels.<br><br>To be completely honest, my boyfriend is the chocolate lover, and I told him that I was just going to have a sip of his hazelnut hot chocolate because I don't have much of a sweet tooth. Once I heard about the iced bourbon caramel and hazelnut drinking chocolate, I changed my mind. We each had our own drinks, and both were absolutely amazing. My iced hot chocolate was not too sweet and had the consistency of a milkshake. My boyfriend's drinking chocolate was thick and paired perfectly with the marshmellow he selected.<br><br>This has become one of my favorite dessert places, and perhaps eateries in general, in the entire world. I'm so moved by how good this confectionery is. I'm glad that my boyfriend bought some drinking chocolate mix to take home. I should have gotten one for myself! Locals and visitors alike should add Katherine Anne Confections to their list of Chicago landmarks because it's totally worth the trek to try any of their sweets!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ePWHVYMWT7OcpYBjtwwt3A/168s.jpg", "caption": "Iced Bourbon Caramel and Hazelnut Chocolate"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/qnln_gkPQ5k7QzIqgK-shg/168s.jpg", "caption": "Hazelnut Hot Chocolate"}]}}, {"review": {"des": "The staff was very passionate about their jobs which made it an even more special experience.  Best hot chocolate I've ever had.  Interesting mixtures that tasted great.  Definite  out if the way spot that is worth the drive.", "pics": null}}, {"review": {"des": "I love good hot chocolate!  <br>The hot chocolate flights here are the perfect size!  Not too big to get sick of the hot chocolate and not too small to be wondering why you bought this.<br>I tried...<br>-Milk: My favorite!  Not too sweet and perfectly chocolate!<br>-Salted Caramel:  Taste exactly like it sounds.  Very sweet and salty!<br>-Hazelnut:  So good!  Perfect chocolate nutty taste!<br><br>Perfect little shop to get some hot chocolate and talk with friends.  <br>Not a big fan of the truffles but I've never been much of a truffle person.", "pics": null}}, {"review": {"des": "I lovedddd it here. So cute and cozy. One thing though, it's really small. So you might have to end up taking your hot chocolate to go. It's sooo cute. My boyfriend and I got two different hot chocolates and we were lucky enough to go early to get a table. I got the caramel chocolate and they even give you a choice as to what kind of marshmallow you want in your hot chocolate. I got the toasted salted caramel. It was really deliciously sweet and you get that little bit of saltiness. It could end up being a little too sweet though if you drink it till the end. People with a sweet tooth I would totally recommend it. Also, when you go inside, you can see the entire kitchen and how their cute little family is making all the chocolate and mixing the hot chocolate. The lady that was at the register was soo incredibly helpful with our order and recommendations. She was funny too! H", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/XY7o8o-KC2S9PS6eY_YlNg/348s.jpg", "caption": "Salted caramel"}]}}, {"review": {"des": "My favorite place & the best hot chocolate I Ever had <br>I all the way travel fr 8 miles only to hav a cup of bittersweet hot chocolate <br>I wish they open up a branch in downtown too", "pics": null}}, {"review": {"des": "One of my favorites for hot chocolate! <br><br>This place is just darling. The staff always seems genuine, even got to see the owner once with her family....so sweet! <br><br>My favorite are the hot chocolate flights. Usually I have the staff surprise me and they usually have rotating special flavors! the marshmallows are HUGE and made in all sorts of flavors...you can even purchase them to go !<br><br>must try !!", "pics": null}}, {"review": {"des": "Went here around 5pm on a Thursday evening. No one was there, it was probably because of the nice weather in Chicago. But that doesn't stop me from getting hot chocolate!! <br><br>There's free street parking in the front of the place! <br><br>The place was small but could be a place to have a cute little date. The employees had a friendly attitude right when I walked inside. They didn't take long to make the order.<br><br>I didn't know what flavor to get so I decided to get the flight of 3 hot chocolate $9! The flavors I got were peanut butter, hazelnut, and lavender earl grey! They were super rich in flavor and delicious!! Each hot chocolate had marshmallows topped on them. My favorite was the the hazelnut out of the three.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/9XYvBFyYeku4OfzikNZtAg/348s.jpg", "caption": "Flight of 3 hot chocolate: earl grey, hazelnut, & peanut butter"}]}}, {"review": {"des": "Are you ready for a sugar rush? If so then Katherine Anne Confections is the place to visit. Their drinking chocolate is a welcomed surprise and rivals that of Mindy's Hot Chocolate which is the best I've ever had.  Fear not if you can't finish the whole thing because taking it home and reheating it for a couple of minutes is a great option (especially if you have some ice cream to accompany it).<br><br>The truffles are another treasure.  Each one that I tried was absolutely delightful. From standards like the salted caramel to interesting delights like the Curry truffle that I tasted.  It's almost as if Willy Wonka grew up settled down and got really sophisticated.  If you're looking to give chocolates, this is the place to go.", "pics": null}}, {"review": {"des": "Such a great find!!<br><br>Atmosphere is very cozy<br><br>Service is friendly<br><br>It's a total neighborhood spot with the right mix of cool and fun.<br><br>The hot chocolates are awesome, my favorite is the semi sweet hot chocolate. <br><br>I give it 5 stars bc of its uniqueness", "pics": null}}, {"review": {"des": "Just wow!  Easy to get to, easy to park, and oh so delish!  This is not an American-style hot chocolate made with sugary powder-flavored Chocolate!  This is a delight straight from quaint chocolate shops found in Italy.  To top it off, you have the option of choosing from a delightful array of homemade marshmallows for your chocolate concoction, and then it's sprinkled with some type of .. maybe sugar, giving it it a fabulous crunch, which takes the sipping over the top! Only order a small, bec it is so rich! Or share a large!  You will never forget!!", "pics": null}}, {"review": {"des": "Phenomenal! The liquid hot chocolate drinks are my favorite. Friendly staff and delicious dessert. They have vegan options as well", "pics": null}}, {"review": {"des": "I cannot begin to tell you how amazing this little gem of a place is.  My girlfriend took me here and said it was great.  She was understating it.  This place is PHENOMENAL.  I got the salted caramel hot chocolate with some chocolate beads and a warm toasted marshmallow melting in it.  This had to be one of the best hot chocolates I have ever had.  There are a wide variety of other confections.  If you are in the mood for something sweet, Katherine Anne has something for you.  There are also flight offerings of desserts for individuals who cannot choose just one dessert.  The setting of the place is intimate as well.  There are only a handful of tables and you can see desserts being made in the open kitchen behind the counter.  Definitely a go to any time of day; although caution for those who go later in the evening...you will definitely be wired for quite some time after coming here; hence, plan your evening accordingly.", "pics": null}}, {"review": {"des": "Crazy awesome! I had the classic dark hot chocolate with a salty Carmel  marshmallow. It was like a taste of heaven. We bought 6 chocolates too and Carmel's. A must go to...", "pics": null}}, {"review": {"des": "The marshmallows were AMAZING! Both the strawberry butterscotch and brown butter lavender drinking chocolates were great!", "pics": null}}, {"review": {"des": "This place is insanely good. Having gone to a fair amount of chocolatiers... Katherine Anne's is an absolute gem! I have taken a few different people here and they are blown away. It's better than Mindy's Hot Chocolate, and that's high praise.<br><br>I'd recommend taking a friend and getting a flight of coco. :)", "pics": null}}, {"review": {"des": "We just happened upon this place while walking around looking for a coffee place. I was charmed by the homey atmosphere the moment we walked in. I got the bittersweet drinking chocolate, then was told I could pick out a house made marshmallow - bonus! The flavors were intriguing and I picked the Earl Grey, which was infused with orange. They toasted it and put it in the warm bittersweet drinking chocolate. OOMMGG!!!! The taste of this concoction was the among the very best thing I have ever had in my life! It was otherworldly, not too sweet, crazy delicious, heady, thick and creamy and made me feel very happy. I will seek out this place anytime I'm in Chicago. Love!", "pics": null}}, {"review": {"des": "Chocolate and sweetness heaven!<br><br>Everyone who works there is just as sweet as the Drinking Chocolates, caramels, and truffles! <br><br>Came here on a brisk Sunday, and ordered the Flight of Drinking Chocolates. The Flight consists of 3 adorably smaller cups of Drinking Chocolates and homemade marshmallows to pair! The name Drinking Chocolate is honesty so perfect. <br>My boyfriend and I ordered the Caramel and Bourbon with the Hot Mexican Chocolate marshmallow, Hazelnut with the Salted Caramel marshmallow, and Salted Caramel with Vanilla Bean marshmallow. We let the woman who took our order choose the marshmallows and she of course did such a great job! <br><br>The Bourbon in the Caramel and Bourbon drinking chocolate definitely have the drink a kick that warmed your throat and chest as it went down. It was very rich and the marshmallow was such a great pairing. The Salted Caramel drinking chocolate was define org salty and thick with caramel flavor, the Vanilla Bean marshmallow added a sweetness that paired well with the salty. The Hazelnut drinking chocolate, our favorite, was smooth and creamy! The Salted Caramel marshmallow that it was paired with had a slight caramel crystallization which added some crunch to the drink, absolutely wonderful!<br><br>The marshmallows were so good, we decided to try the Earl Grey, Cinnamon Sugar, and Champagne ones as well! For just $1 each, we couldn't resist! The Earl Grey was very light and floral, not too sweet either! The Cinnamon Sugar had the most flavor and was perfectly sweet. The Champagne one was surprising with the sweet and slightly alcoholic flavor. <br><br>We seriously enjoyed everything so much and will definitely be back!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/-ts_H922h_SQkUwvEKXE6Q/168s.jpg", "caption": "Great Decor"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/DMdoNsWR7Mh56UrRwruEJQ/168s.jpg", "caption": "Fantastic Menu as of 2/21/16"}]}}, {"review": {"des": "This place is a cute little shop nice for a morning sip and baked goods. I got the sampler and my favorite was the hazelnut. It was so creamy and rich, savory and perfect sweetness. The bourbon wasn't my thing but some people who enjoy that taste would probably enjoy it. We tried a few marshmallows on their own and it wasn't our favorite. They're much better left in the hot cocoa. <br><br>Get the croissant. It was so flakey and buttery. Perfect combo with the the hot chocolate. A nice place to visit to hang out and have a conversation.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/aWBxbbf0Y5LsgUNKNYAmvw/348s.jpg", "caption": "The croissant is so good"}]}}, {"review": {"des": "4 years since my first visit to Katherine Anne's and it is still the BEST hot chocolate I've had. The quality and flavors have simply gotten better with every visit (and I have been back at least every winter in 3 years).<br><br>This time around, we tried everything recommended: Salted Caramel (with a spicy marshmallow), Lavender Earl Grey (one with vanilla bean and another with salted caramel marshmallow), and the Mexican Dark (with vanilla bean). It was delectable. Every sip was delightful, with the smooth rush of velvety cocoa. I had the Earl Grey - it being my favorite tea - and loved the light scent of lavender in my steaming cup of cocoa. Sipping a little water every few minutes allows you to cleanse your palette and appreciate the chocolate.<br>The Mexican chocolate definitely had a hint of coffee to it, which was perfect for my coffee-loving mum.<br><br>It is an indulgence for sure. But you will delight in it every single time. Can't wait to go back!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/g-GsHJ_T6GPNQUUWZjXsIQ/168s.jpg", "caption": "Lavender Earl Grey(s), Mexican and Salted Caramel drinking chocolate"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/7ZG3OyO7DUHTk3-VRh0zAQ/168s.jpg", "caption": "Lavender Earl Grey drinking chocolate with a vanilla bean marshmallow"}]}}, {"review": {"des": "The people here are some of the nicest owners I've come across. Everything is made in house, from the marshmallows to the truffles. The lady grey truffle was definitely one of the best truffles I've had. The first hot chocolate wasn't to my taste and they switched it out for a different one without a problem.", "pics": null}}, {"review": {"des": "When they say \"sipping chocolate\" they mean it. The hot chocolates are flavorful and each one is very different from the other, so getting the flight of 3 is highly recommended if this is your first time. Don't miss out on the melt-in-your-mouth flavor-bursting marshmallows too! The place is rather tiny, but we were there near closing so we has the beautiful place to ourselves and a handful of other people.", "pics": null}}, {"review": {"des": "I had an unexpected afternoon to myself so I decided to search for the best hot chocolate in Chicago. I went to this adorable café and indulged in a drinking chocolate flight as well as a truffle trio. While I may have wanted to lie down afterward, it was well worth it, and I was able to \"work off\" two sips of the peanut butter drinking chocolate by walking on the nearby 606. Well worth the trip!", "pics": null}}, {"review": {"des": "The dark chocolate hot chocolate was so good and sooooooo rich that I couldn't drink it all. :(   Next time, I may ask them to cut back a bit on the chocolate so that I can finish the drink in one sitting.  The flavored marshmallows were tasty too.", "pics": null}}, {"review": {"des": "Best hot chocolate (or sipping chocolate) I've ever had.  Definitely will become a standby place for me and my family.  Really cool marshmallow flavors too.", "pics": null}}, {"review": {"des": "Was really excited to try this place out after reading about it.<br><br>The cocoa tasting is very good. My favorite has to be the basil - WoW.<br><br>The salted caramel while popular was way too sweet. <br><br>If they could tone down the sweetness, it would be perfect.", "pics": null}}, {"review": {"des": "Short and simple: if you like chocolate, you have to try this place.<br><br>My friend and I stopped by a few nights ago, having heard good things about it. We arrived about 20 minutes before closing time (yes, unfortunately, we were *those* people). The employee we talked to was very friendly and inviting despite how late it was. The place is fairly small,  but the decor is simply adorable. Truly the perfect atmosphere to enjoy hot chocolate. But on to the food:<br><br>We both ordered flights, both with milk chocolate and salted caramel, but my friend got a lavender mix as her third flavor while I opted for hazelnut. We also purchased one marshmallow each (salted caramel) to chew on while we waited for our drinks. They were fairly large marshmallows, but they were gone just seconds after the first bite. Absolutely delicious. <br><br>Our flights arrived, three little cups each. Now, here's where you might think \"ok, maybe they're overcharging for this stuff. 9 dollars for three shot-glass sized mugs? You could get a regular-sized hot chocolate from any other coffee place for less than half the price!\" But oh, friend, you underestimate the hot chocolate Katherine Anne serves. The stuff in those tiny cups was richer than bill gates. We actually struggled to get through all three cups, despite how much we loved them, because they were so dense and fully flavored! If I had to pick a favorite, it would probably be the hazelnut. The salted caramel was really good as well, but the hazelnut was a bit thicker and probably the creamiest of the three- qualities I like in a hot chocolate. It's definitely what I'll be ordering when I come back- and I certainly will. <br><br>Since we arrived so late, we were the only ones there, so I can't say whether or not it's crowded during the day. But it seems like a wonderful place to go to relax, read a book, or just sit back and enjoy the wonderful drinks they offer. Life is too short not to try a place as good as this.", "pics": null}}, {"review": {"des": "During my first visit, I was enthralled by the Mexican hot chocolate that I got. Because the first time was a bit of a rush, I returned for a proper sit-down earlier in the day. Again, I had the Mexican hot chocolate and a sandwich. The hot chocolate was better the second time around; threw out the old cliché that it's never as good as the first time. And the turkey sandwich was delicious.<br><br>I went back a third time recently and had a cup of hazelnut hot chocolate and I bought four chocolate truffles for take-away. I'm in love. There really isn't much else to say. Once I come down from my high and get a moment, I shall have to add a post to my food blog about Katherine Anne Confections.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/l6fVcJJscXKWXqwg41m2iQ/348s.jpg", "caption": "Mexican Hot Chocolate"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/-3-tk6_2Vung5gxZbx2g5Q/168s.jpg", "caption": "Hazelnut Hot Chocolate and Chocolate Truffles"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/K-maYWhcyMYcDpBPaVmyvg/168s.jpg", "caption": "Turkey Sandwich"}]}}, {"review": {"des": "This is a cute high end confectionery that specializes in chocolate, and lots of it!  My GF wanted a hot chocolate to warm up while we waited for our reservation at table donkey stick.  The chocolate came with a cute homemade marshmallow that sweetly melted into the drink, adding a soft vanilla milk taste to the delicious velvet heaven that it was swimming in.<br><br>I stole a couple sips, as you might imagine.  I had a small cup of their coffee while we waited.  It was a little too hot for my taste, but in a minute or two it was good to go.  The coffee was nothing special, it was a plain french press brewed Columbian medium dark roast that warmed me up enough to brave the half block walk to dinner.<br><br>TL;DR:  Amazing hot chocolate, okay coffee, need to try their chocolate next time!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/TAHIGjIQu9xJsPrcz1Ianw/348s.jpg", "caption": "Have a seat on this cute repurposed outdoor furniture?"}]}}, {"review": {"des": "After sampling some KAC treats at the Good Food Festival and seeing a friend's photo of hot chocolate flights, I knew I had to make a trip here ASAP. With free street parking on parts of Armitage, my husband and I had a late lunch at 90 Miles Cafe just down the street, and walked pathetically few of those calories off by the time we reached Katherine Anne for dessert. <br><br>The shop is small, with just a few tables; luckily we were the only ones there this particular late afternoon, so we chose the largest sofa area to spread out and play cards I brought while we enjoyed our drinks. I had the flight ($9 for 3 mini mugs) with Salted Caramel, Super Dark, and Hazelnut drinking chocolates, each with their own homemade flavored marshmallow. They're thick, rich, and filling, so bring your sweet tooth! Usually I love all kinds of dark chocolate, but I have finally met my match and have to admit that this 85% cacao was too bitter even for me and couldn't finish it. The other two were decadent and delicious. My husband also had the Salted Caramel, but opted for Peanut Butter with white chocolate and the Bourbon Hazelnut for his other choices. I'm not big on bourbon anyhow, but my husband loves dark liquor and reports that it was too heavy on the bourbon taste for him with the chocolate. The Peanut Butter was scrumptious, though! <br><br>We also chose a handful of loose caramels (.75 ea) to take home because they all sounded too yummy: honey vanilla, rosemary sea salt, salted bacon, sesame blood orange, citrus wheat, and a banana hefenweizen - MmMmM. The truffles and homemade marshmallows also all looked wonderful; it was a real Sophie's choice deciding between them! Thanks to Nathan for the great service on Wednesday as well; we definitely recommend a Treat Yo'Self trip here!", "pics": null}}, {"review": {"des": "I live across the street from Katherine Anne Confections. A full year passed and it finally walked in and fell in love! Everything is made there. Their marshmallows, truffles and  hot chocolate are divine. Oh, did i mention they make soup? Every couple of days is a different soup and I have loved every single one.", "pics": null}}, {"review": {"des": "The drinking chocolate (available hot or iced) is decadent and delicious, with too many great flavors to choose from. Really helpful and friendly bakers! This place is the best!", "pics": null}}, {"review": {"des": "I can't believe I was wasting my dessert allowance (and calories) at the Tastee Freeze down the street...idiot! Katherine Anne is incredible. The tasting flights of drinking chocolate are perfection in small, adorable mugs. This is on my current list of neighborhood favorites -- perfect for picking up a gift, stopping in for a quick treat, or a fun date.", "pics": null}}, {"review": {"des": "Nathan is the coolest guy ever. Very helpful. This chocolate is amazing. Holy freaking god come here and buy stuff", "pics": null}}, {"review": {"des": "Want an indulgence? Get yourself a cup of thick 'n creamy hot chocolate here! Almost suffocating thick, you're literally drinking melted chocolate!Their Mexican packs an interesting spice to an otherwise traditional hot chocolate.  Combination of ingredients are not short of intrigue. Will come back to try their salted caramel and hazelnut flavors.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/wtE3qtPuM2Dv9MbgHIcrtw/348s.jpg", "caption": "Salted caramel + Bourbon caramel and hazelnut hot chocolates."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/-ScbNH2ytZPuLt02VzBZeg/168s.jpg", "caption": "Small salted caramel + bourbon caramel and hazelnut."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/IlEW1hrbJCbNnTJHE15mQA/168s.jpg", "caption": "Few bourbon caramel + hazelnut hot chocolate. A punch of spice with spicy chocolate marshmallow."}]}}, {"review": {"des": "Go here and get a flight of drinking chocolate. Don't eat first or plan to eat after. This is a chocolate shop, so they're melting the confections they make in-house with milk or dairy substitute and it is the richest, best hot chocolate you will ever have. They have standbys like milk, dark, Mexican, salted caramel... and then some that switch out like Bourbon, brown butter, and others. And then, as if that wasn't good enough, they make their own marshmallows in house that come in a variety of flavors that you can mix and match with your drinking chocolate flavors. My favorite is milk chocolate + a cinnamon sugar marshmallow. The flight is the best if you have never been there so you can try three. Then you can get truffles to go, kits to make drinking chocolate yourself at home and even packages of marshmallows. Do. It. Go.", "pics": null}}, {"review": {"des": "Best sipping chocolate out there! <br><br>Truffles, carmels are top notch but expect to spend a pretty penny if you want to enjoy more than 1 per person or take some home.", "pics": null}}, {"review": {"des": "YUM! The salted peanut butter drinking chocolate (the January special, I believe) was phenomenal. It was like drinking a Reese's cup, only with higher quality ingredients. I was absolutely in heaven. <br><br>That settled, the big question is flight or cup. We went with a big group, and after having people go both ways, we decided flight was absolutely the way to go. Why? First is obviously that you get to try more combinations. But the cups are also enormous and it's so rich many members of our group left their half-finished. The tiny flight cups (which perhaps they should sell individually?) were perfectly sized. The only problem was the cups also cooled faster, so I had one warm drinking chocolate, one lukewarm drinking chocolate, and one cool drinking chocolate, even though I made a point of trying all of them when they arrived at the table. That's the only reason this isn't a five-star review. <br><br>We loved it, from the sweetness of the chocolate to the sweetness of the staff (and the adorable couches!).", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/FX2GziTUGhURkmYK3J_8Dw/348s.jpg", "caption": "Hot chocolate flight (labeled on paper, which was super helpful!)"}]}}, {"review": {"des": "Simply amazing. I would definitely come back to try their truffles and hot chocolate. Had the semi-sweet hot chocolate with salted caramel marshmallow and a spicy chocolate marshmallow. They added some crispy chocolate stuff on top. It was SO good!<br><br>The chocolate was decadent. The service was good too. Admittedly, I wanted to try the flight of hot chocolate but the worker was running behind and noted that she couldn't accommodate it because she had to clean other things. She was really apologetic and nice about it. I understand trying to close up on time so I appreciate her honesty.<br><br>She did a great job with my sipping chocolate. Smooth, rich, and the flavors were intense and delicious. I've tried Mindy's Hot Chocolate which I also love, but gotta say, the hot chocolate here beat the cake! The marshmallows added a great touch.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/x5mCL3O8UfK8HnjeYJ0VzA/348s.jpg", "caption": "Semi-sweet chocolate, salted caramel marshmallow and a hot (spicy) chocolate marshmallow. Divine."}]}}, {"review": {"des": "First-timer from the suburbs. Salted Caramel was perfect. Would go into Logan Square just to have a flight of drinking chocolate. Will be back!", "pics": null}}, {"review": {"des": "Mmmmmmmm, chocolate.<br><br>On a recent visit to Chicago, we stayed in a hotel on the North side of town, and each day, as we left our hotel, we were treated to that smell of chocolate from a nearby factory one only gets in Chicago.  And thus, the hunt for a chocolate fix began.<br><br>Enter Katherine Anne Confections.  A Yelp find we feared was too beloved to be true.  A cold November night brought us to her doorstep...a lengthy train ride, a substantial walk from the train, and finally, we arrive.  Heady with the possibilities, we opt for a flight of hot chocolate, and wow. Just wow.<br><br>The browned butter hot chocolate was truly the best cup of hot chocolate I've ever consumed. The best. Incredibly rich, carefully prepared, the perfect portion.  All three combinations (because they come with a marshmallow as well, which imparts another note to each cup) were truly heavenly. I don't think you could make a misstep, except to leave without trying at least one cup.<br><br>We left Chicago wishing we had bought some truffles to take with us, because although everything was on the pricey end, it was clear that they were made by hand, with love, and with extremely high quality ingredients.  I'm sure there will be an order in our future, and despite the distance from the heart of Chicago, when we return to the Second City, we'll definitely be back.", "pics": null}}, {"review": {"des": "Wandered in here while walking along the street. We had a croissant, some caramels and a fancy hot chocolate with a fancy marshmallow and loved it! It was a nice treat in the cool October weather. We also got a little bag of caramels to give as a gift. The staff was very friendly.", "pics": null}}, {"review": {"des": "Rich decadent amazingness! Great customer service and chill atmosphere with the perfect tunes. Eve even accommodated me by  thinning my hot chocolate out so I could take it to go. Can't wait to return.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Wb2ciAer9S4GiXZxnZjY2g/348s.jpg", "caption": "Hazelnut and Salted Carmel were deliciously decadent!"}]}}, {"review": {"des": "3 sizes of hot chocolate with a variety of choices to choose from.. 7oz. was a good serving. Got the Mexican hot chocolate (Chicago style-30% melted chocolate vs. 10% w hot cocoa) which is topped with pink peppercorns. 1 complimentary toasted marshmallow. Grapefruit was tasty.<br>They also make unique flavored caramels (i.e. Earl Grey, Miso Ginger, Rosemary Sea Salt, etc.) and dark chocolate walnut. I'm not big on caramels, but these were easier to chew fresh than other store bought caramels I've had which are usually very hard. Not sure if I like the savory sweet flavors, but they are definitely worth trying if you like those flavors.", "pics": null}}, {"review": {"des": "Yes PLEASE!  Mexican Hot Chocolate, w/a handcrafted cinnamon sugar & vanilla bean marshmallow, in a perfectly cozy location with wonderful humans working inside.  DO IT!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/YTWzoQGa0HPlJRgThoXwOw/168s.jpg", "caption": "Mexican Hot Chocolate"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/S3PBe-CeandP6aWe_l5G-A/168s.jpg", "caption": "Flight"}]}}, {"review": {"des": "This past Sunday afternoon I stopped off at Katherine Anne Confections to try their housemade hot chocolate. I wanted to compare it to XOCO. I must say, they are both excellent and super different. The Mexican hot chocolate I had at Katherine Anne was rich (milk-based) with a heat that builds slowly, both from chile in the chocolate itself and also from the marshmallow I picked.<br><br>The cost per cup is twice as much at Katherine Anne but you get to choose 2 house-made marshmallows to add to your chocolate, and its a 12oz serving where XOCO is 8oz. I chose the black pepper vanilla marshmallow and a spicy cocoa marshmallow. The hot chocolate is topped with pink peppercorns. The sweet and salty, the rich velvety chocolate and the chew of these amazing marshmallows: I love XOCO's hot chocolate but I got to get back to Katherine Anne for more!<br><br>I bought a bag of marshmallows for my house.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/y721i_lqZRfSnGvsO1k7dw/168s.jpg", "caption": "back alley sunset, winter 2014"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/LT5oK4e_UCHZA9NQH6DzCw/168s.jpg", "caption": "Mexican hot chocolate"}]}}, {"review": {"des": "Very nice rich hot chocolate ...<br>Semisweet hot chocolate is best <br> Chicagos must try place", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/YF82ELsj7aEog8JVFilHsA/348s.jpg", "caption": "Semisweet hot chocolate and bourbon hotchocolate"}]}}, {"review": {"des": "I found this GREAT establishment off of yelp and am really glad I did. Katherine personally made sure my girlfriend got her box of truffles on time for valentines day, making it some of the best customer service I've ever encountered. To top it all off the chocolate was delicious. Huge supporter of Katherine Anne Confections!", "pics": null}}, {"review": {"des": "So good! They make their own marshmallows.<br>The Mexican hot cocoa is highly recommended.", "pics": null}}, {"review": {"des": "I am not a big chocolate person but I enjoyed this place !<br><br>I was having a crave for something sweet and I found the perfect spot.<br><br>I bought:<br>A walnut caramel<br>A bacon caramel <br>A goat cheese chocolate truffle<br><br>All were fresh and worth it<br><br>I know where I am buying my grandmother her birthday present !!!", "pics": null}}, {"review": {"des": "I love the house made marshmallows & the s'more chocolates. Wish they had a longer drink menu but it's a cute little place.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/LCntfoEdc7CGdiP1CZ1-Bw/348s.jpg", "caption": "S'more from the chocolate case.  Very tasty."}]}}, {"review": {"des": "The chocolates and hot chocolate mix are the best I have ever had in all my travels.  The way they package the truffles is just beautiful and they are perfect for customers.  I can't say enough good things about the products or quality of the service!", "pics": null}}, {"review": {"des": "Loved this place. I came here with a friend and got a Mexican hot chocolate, and a salted caramel hot chocolate. Very decadent! I'll be coming back. :)", "pics": null}}, {"review": {"des": "Found out about this place about 2 years ago when I went to fix my iPhone in a shop next door.. I noticed that they sold coffee and I love coffee so went in and it was such a pretty little place. I felt in love with everything they sold. I ended up purchasing coffee and truffles. And since then I love this place!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/uKm7hwnZnWeYHV8Zu3vUcw/348s.jpg", "caption": "Truffles"}]}}, {"review": {"des": "Thank God for Yelp because we would not have found Katherine Anne otherwise. When we walked in, we were asked how we found this place while deciding what to order. We also were treated to some info about Katherine Anne. I appreciate that they use local, organic ingredients. Just another reason to love this place. <br><br>Hot chocolate flight. $9. Worth every penny. My best to \"worst\" (scare quotes because, come on...it's all good): salted caramel, hazelnut cheesecake, Mexican. The salted caramel was so incredibly rich. If I had to choose a big mug of a flavor, that would win, hands down. However, there are so many flavors yet to try! Hazelnut cheesecake had an amazing taste, but it was maybe 50% thinner than the salted caramel. Mexican hot chocolate with red pepper garnish was good, but not as good as the other two. All of the homemade marshmallows were outstanding. <br><br>They have truffles. I am a chocoholic, so I absolutely need to come back here and try those truffles. Also, I need to try as many types of hot chocolate and marshmallows as I can. I will recommend Katherine Anne to friends. Or maybe not. I want it to be my secret!", "pics": null}}, {"review": {"des": "This place is so cute! And the guy who served us was really kind and helpful (Nathan). I loved all of their truffles and their almond croissant was UNREAL. I wish they made more types baked goods!", "pics": null}}, {"review": {"des": "Absolutely delicious!  We stopped by after seeing a recommendation in TimeOut magazine and were delighted by all of the drinking chocolate options!  Hubbs chose bittersweet and I chose salted caramel...both were iced and absolutely amazing!  We also chose a couple of truffles from their mouthwatering selection.  Whatever you choose, you simply can't go wrong.  The customer service is also great and the vibe of the shop is very welcoming!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/7dK_CSVGMx6FyDY4tW-jAQ/348s.jpg", "caption": "Salted caramel drinking chocolate...iced!"}]}}, {"review": {"des": "I finally had something other than the samples this visit.  <br><br>I tried the Hazelnut hot chocolate with a hot chocolate marshmallow.  This was some of the best hot chocolate that I have ever had.  Very rich and thick for a warm fill on a cold wintery day.  They say that only 7% of the people that have the hot chocolate can finish it.  Others take it home and mix it with other things to finish it off.  I only had half a portion but I would like to think that I would be a part of that 7%.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/C46pEgA46eGsGayGke_aoA/348s.jpg", "caption": "Salted caramel hot chocolate with vanilla marshmallow"}]}}, {"review": {"des": "There are so many aspects about Katherine Anne Confections that I really like and would rave about. Yes, it's a bit pricey, but you'll never ever have better hot chocolate in your entire life. It's thick and luscious -- a warm indulgence on a cold day (and don't we get enough of those in Chicago?)<br><br>First of all, their hot chocolate is so decadent without being overly sweet. It is pretty hard to finish a cup so pick a friend to share it with. The Mayan hot chocolate is my favorite. <br><br>I also really love their premium marshmallows. They have seasonal marshmallows, and currently my obsession is with their BROWN BUTTER SAGE. You could really taste layers and layers of flavor. Now, the most overlooked part of the hot chocolate is celebrated!<br><br>They also are very present at a lot of farmers markets and such. So, if you do run into them, please support this business! It's a great group of gals who run it, and the quality is superb!!!", "pics": null}}, {"review": {"des": "Cute inside, friendliest staff and yummy drinks. What more could you ask for? This place would be a perfect nightcap to a first date or a great place to meet old friends and talk. It's quiet, dimly lit and oh so cozy. The drinking chocolate is quite possibly the richest food I've ever put in my mouth (in a great way!). This is NOTHING like Swiss Miss. Thick, rich and creamy -- not overly sweet but incredibly satisfying. I could eat about a million of the homemade marshmallows. This is a definite must-visit and is perfect on a cold winter night. Try the hazelnut hot drinking chocolate.", "pics": null}}, {"review": {"des": "Wonderful little shop. The chocolates are delicious, and you can see them making them right behind the counter. Super-friendly service. <br><br>I put together 12 truffles as a gift, in four little 3-truffle boxes, and the woman behind the counter patiently let me pick out 12 different flavors. And I'm not going to lie, the gift boxes themselves are adorable.<br><br>Plus, I stayed for lunch on an impulse and had a delicious ham sandwich on a baguette.", "pics": null}}, {"review": {"des": "What a great little spot! We were just looking for somewhere highly rated to check out, and this little spot earned it! The \"drinking chocolate\" was great, and there were a few unique flavors that worked well together. The handmade marshmallows that were suggested went very well with the suggested drink pairings. The service was great, and the décor was pleasant. While there, our little son spilled my wife's drink everywhere, and the girl working the counter was very helpful to get us and everything around us cleaned up without making us feel uncomfortable. She remade the drink, which was nice because it was not their fault at all. I would definitely recommend this spot to anybody.", "pics": null}}, {"review": {"des": "Love this cute little place. We ordered the hot chocolate flight each and brown butter hot chocolate to go and they were out of this world! Definitely coming back again.", "pics": null}}, {"review": {"des": "Omg,  this is the best thing to do on a rainy day!  We got a flight of drinking chocolates instead of getting hot chocolate and once we saw that they have flavored marshmallows and very creative combos on flavors for their truffles. Amazing! Culinary Delight!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/y239ynqocEUHEtH362JdiQ/348s.jpg", "caption": "Flight of drinking chocolates!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/sGMNRp9us7ciCnmiu9HLHw/168s.jpg", "caption": "Cozy location,  treat yourself!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/3etGI9DNurAUh21fK3JHnQ/168s.jpg", "caption": "Flavored marshmallows!  Whaaaaat?!"}]}}, {"review": {"des": "Came driving here through one of our craziest snow storms yet this year.<br><br>The decor is to die for- absolutely elegant! A little smaller than I thought, but thankfully the place was empty, hence the weather outside. <br><br>I ordered a hazelnut truffle which was delicious, but a little pricy for the size. I also purchased a regular milk hot chocolate, which was very thick, rich and topped off with their house made cinnamon-sugar and peppermint marshmallows. Was a little disappointed that they didn't have a white chocolate option for anything at the moment. And if your not a fan of cinnamon, steer clear of the cinnamon sugar marshmallow. The cup is also huge so your bound to get full off the hot coco alone.<br><br>Overall, I wasn't too satisfied with my drink- that could be due to my personal pickiness with hot coco (I know crazy right?). I would have also gone with a different choice of music, whiny rock n roll- not my thing. <br><br>But the place itself was a quaint atmosphere that my friends and I enjoyed during the raging storm that was right outside the window.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Qv2XF0ULA9eaTZo_tKxBrA/168s.jpg", "caption": "Hazelnut truffle with a regular milk hot coco, topped with their house made peppermint and cinnamon sugar marshmallow"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/r3ciTx2UMKQ-UBcsZuGchA/168s.jpg", "caption": "Elegant decor"}]}}, {"review": {"des": "By far the best drinking chocolates I have ever tried. I only wish I was in Chicago long enough to try all the different flavors and combinations. I tried the flights of Semi sweet, Mexican and Malted Milk with whipped cream on my first visit and settled with the full cup of Semi Sweet with Hazelnut, with one Cinnamon and one Spicy Cocoa Marshmallow on my second visit. For me, Katherine's homemade marshmallows are the only way to go over whipped cream...the only downside with marshmallows is waiting for them to melt, so I end up chasing them around and dunk them with my spoon because I can't wait :)<br><br>Katherine is a sweetheart to meet and she spent time going over the many drinks and truffles she has. Left with a variety of truffles to try later along with a container of Salted Carmel Chocolate mix. Yum!<br><br>A definite \"must return to place\" on my next trip to Chicago!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/fSVm8tUjON4Kf3F2AK02vQ/168s.jpg", "caption": "White Chocolate Chia on the left and Semi Sweet with hazelnut on the right. Both were Delicious"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/wmoEhUmw4Y9c49EZw_k8Vg/168s.jpg", "caption": "I now know what heaven taste like!!!"}]}}]}