{"name": "kinzie-chophouse-chicago-23", "reviews": [{"review": {"des": "Great small steakhouse with all the classic Chicago cuts. I had the dry aged Delmonico and it was cooked perfectly medium rare. A colleague had a cut none of us had seen - a ribeye filet. Both wet and dry aged options. Shared several sides, but the creamed corn with bacon was the clear favorite. Nice bar area with the baseball playoffs and Monday Night Football on. Great place for a post trade show wind down.", "pics": null}}, {"review": {"des": "One of the better steakhouses in Chicago. <br><br>The Interior = Classy and charming<br>The Service = Absolutely on point<br>The Food = Very good<br><br>This evening, we dined in the private room where we were greeted with crab cakes, scallops and ahi tuna tartare appetizers. They were all delicious. <br><br>My cut of choice is a bone in ribeye. This trip to Kinzie, I chose the filet. It was a bit under seasoned but I requested the soy beurre blanc on the side which knocked it out of the park. There are several sauces you are able to choose from. Ask your server about them. <br><br>As for the sides, the creamed corn and sausage is amazing. Mac and cheese was on the dry side but tasted good. Garlic whipped mashed potatoes were ok. <br><br>Kinzie makes a mean old fashioned. However, if you are a wine drinker, they have a robust selection. <br><br>I ended the night with a Tawny port and a dessert trio of carrot cake which was ok, the creme brulee that was good and the chocolate hazelnut terrine HOLY DANG it was tasty. <br><br>Onto the next!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/AtrNxEx-U59_y0r0yZ5y4A/168s.jpg", "caption": "Dessert trio carrot cake, creme brulee, chocolate hazelnut terrine"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/4k4OpahB1PnmIygGAcX-Hg/168s.jpg", "caption": "Filet with soy buerre blanc. That sauce is boss!"}]}}, {"review": {"des": "Smaller steakhouse with an extensive menu. Excellent service even though I was barely 21 when I first ate here. Wonderful date spot and great wine list. Look forward to returning soon.", "pics": null}}, {"review": {"des": "Was just walking around the city and wandered into this place. I really wanted a steak so my friend and I headed right in. We were dressed rather casually but on the inside was upscale and a little fancier than I had expected. We were seated right away by the hostess and almost immediately a server came over to greet us and give us our menus. Our waiter was Chase, he was a nice younger guy and he was knowledgeable about the menu. I even asked him if the rare beer selection was worth it, he said yes and I ordered it straight away. I ordered the filet mignon and onion rings with the rare beer from Ballast Point the High West Barrel Aged Victory at Sea. It was a dark porter which I normally don't like but it was very good. The steak was cooked just how I liked it, medium well, and the onion rings were a huge mountainous portion! It was all fantastic.", "pics": null}}, {"review": {"des": "Glad I was able to give this place a try, but for my first time there, I was not blown away.<br><br>Came here for our annual Christmas party for work.  I ordered the NY strip steak cooked medium.  It was deliciously flavored and filling that I had to take the other half home with me.  For appetizers, we had the crab cakes which were really tasty, along with the bruschetta.  I'm not really into bruschetta but I have had them before.  There was nothing special about the one that we had here.<br><br>For sides, there was the grilled brussel sprouts and the mashed potatoes.  The brussel sprouts actually tasted really good.  It was sweetened with something - almost caramelized, but also had that roasted taste which made it a delight to eat alongside my steak.  Never had Brussel sprouts cooked that way before and I do recommend trying it!<br><br>For dessert, I had the mini trio of creme brulee, carrot cake, and chocolate cake.  The creme brulee was my favorite.  I didn't really care for the other 2.<br><br>We also had a private room and it was beautiful.  Very secluded from the rest of the restaurant so there was tons of privacy.  There were about 20 of us there and it was more than enough room for all of us to sit and eat comfortably.  <br><br>The wait staff was also very patient with us as we were all a bit tipsy and loud.  My drink was always full - can't complain about that.<br><br>Knocked off 2 stars as I we had a limited menu due to the private party.  Not really the restaurants fault, however, I wish that they had more food options that included chicken, along with other forms of seafood.  Don't get me wrong I am a complete carnivore - but I gotta look out for my friends who don't eat red meat.<br><br>I'm conclusion - would I come here again on a whim?  Probably not.  I've been to other steak houses that have left more of a lasting impression on me as far as their menu.  Main courses are indeed important, but the sides also matter.  And that is something that Kinzie is lacking.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/juhp6MZD1Y5abs2CXPIydg/168s.jpg", "caption": "Mini dessert trio - chocolate cake, carrot cake, creme brulee"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/9QmzArI7PeHtpN4nm4MjEw/168s.jpg", "caption": "NY strip steak"}]}}, {"review": {"des": "Extensive wine list and top notch service set the Kinze Chophouse apart from certainly any chain steakhouse and many of the local competitors in the Chicago market. We had a group of 70+ and they handled it like pros - drinks served in a timely manner and all courses came out together. For a group this size, that takes a lot of coordination with the bar and kitchen.", "pics": null}}, {"review": {"des": "So my steak wasn't anything to write home about. It was a Delmonaco (or something that sounded like that). I usually order medium rare and it appeared beyond medium. I assume that the principal chef takes Mondays off. Our variety of appetizers was delicious though. <br>The real winners were:<br>- Wine list! The Gigondas was fantastic. I am not sure though that we got the 50% off. It was a Monday afterall. <br>- Grappa (second on the list) was fantastic. <br>- Service was super relaxed, friendly and efficient. Great experience. <br><br>So next time a small filet may be a better meat choice.", "pics": null}}, {"review": {"des": "4.5 Stars! I was in town entertaining 5 clients.  We were looking for a chophouse in proximity from TheWit Hilton Hotel.  The place is on a corner and very charming.  The table service is probably some of the best I have incurred in awhile.   The staff seems trained very well, and good job hiring employees that are quality people.  Oysters were good, ribeye was praised at the table, the lamb chops was very good, decent craft beer selection, and wine menu was robust.  We shared a bunch of laughs, and I was told I hit it out of the park picking this place for supper.", "pics": null}}, {"review": {"des": "This was our second visit to Kinzie. (April 2017)<br>Our first visit was soooo terrific, we had to go back! <br><br>We got lucky and went when they had a James Beard week spring menu<br><br>For an appetizer we started with the Mushroom and goat cheese tart .. full of delicious flavor perfect size for two.<br><br>I did the wine pairing menu for $69: <br>Here's the deets:<br><br>Artichoke soup - really good but could have a tad more seasoning.<br><br>Napoleon - Had a ton of flavor but was hard to eat.  <br><br>Duo of filets -  OMGoodness they were cooked perfectly and & seasoned just right. <br><br>Banana creme tart - so good! <br><br>Service was terrific and I cannot wait to go back!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/5KISYMdIBvBgNsU8W5vLhA/348s.jpg", "caption": "Banana cream tart"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/dbKI2z4IofXtrSo15Dds2Q/168s.jpg", "caption": "Medallion duo"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/hM8rEygDhYnS_lzJRH2MLQ/168s.jpg", "caption": "James Beard week menu"}]}}, {"review": {"des": "Hands down one of the best restaurants in Chicago. The staff is always upbeat and friendly, the libations are exquisitely prepared and the food...the food speaks for itself-absolutely incredible. My partner had the salmon and I naturally sprung for the red meat...Both were triumphs! Do yourself a favor and experience Kinzie Chophouse.<br><br>Below is a photo of the desserts we ordered! Delicious !", "pics": null}}, {"review": {"des": "I was looking for a date night restaurant in Chicago and stumbled upon Kinzie Chophouse. They were one of the few restaurants that took last minute reservations on a Saturday night. The ambiance in the restaurant was romantic. There were two sides you could choose from. One side was darker and more candle lit. The other side has more lights and was very elegant. Unfortunately, it takes more than just pretty decor to impress me. As far as food goes, Kinzie Chophouse is okay. I wouldn't recommend this place and probably won't be coming back but the experience wasn't the worst.<br><br>To start the night, I ordered the fall sangria. It smelled wonderful and definitely reminded me of the season. Off to a good start. For my entree, I ordered the DUCK BREAST PASTA. I was craving duck so I was excited. Unfortunately, the duck was very dry and there weren't that many pieces. The pasta itself was also a tad dry. The sauce didn't help and it just tasted mushy in my mouth. There was also a very strong \"game-y\" smell to the dish that made it difficult for me to finish. I was not a fan of this and do not recommend this dish.<br><br>My date ordered the RIBEYE CAP STEAK. There was nothing special to this dish. The steak was okay; it wasn't spectacular or flavored incredibly well. It was very mediocre. The pineapple mango salsa did add a nice fruity touch. <br><br>After our entrees, we just decided to get dessert somewhere else. There was no point spending more money on mediocre food. Kinzie is okay but nothing spectacular. It wasn't memorable and I wish I had gone somewhere else for dinner.", "pics": null}}, {"review": {"des": "Delicious date night. We split the goat cheese salad, 24 oz porterhouse and mashed potatoes. So delicious! Our server, Max, did a great job explaining the different cuts of meats to us and giving us all our options. We enjoyed tasting the different options of sauces.   They also sliced our shared steak which made it much easier to eat. Overall- great service and a delicious meal. We're going to have to come back more often. We had a table near the window with a view of a light-colored tree and softly playing Christmas music- very festive!", "pics": null}}, {"review": {"des": "Ordered the dry-aged steak at medium well. When it came to the table, the first bite is terrible. Obviously over cooked and it's bitter. Not worth the price and wait. Not recommend!", "pics": null}}, {"review": {"des": "I ordered the prime rib today, 11/3/2018. This place is overpriced considering the lousy service and only average quality of the meat. If you are going to spend the kind of money they charge, your money is better spent at a place like Gibson's or Chicago Cut. There are even cheaper places like Wildfire that will provide better service and a superior dining experience. DO NOT WASTE YOUR MONEY!", "pics": null}}, {"review": {"des": "Very good restaurant with Good service and food.. not spectacular food, but good. I would go elsewhere in the same price range if you can get into the really good places, but this will do nicely if you can't.", "pics": null}}, {"review": {"des": "Though the food was absolutely delicious, the service was atrocious.  For starters, we had a 7:15pm reservation.  We arrived at 7:00 and checked in.  After checking back with the Hostess 2 times, they finally sat us at 7:55pm.  Of course they apologized and sat us at wonderful cozy booth.  When making the reservations we said we were there celebrating our Anniversary. <br>Our waiter, Troy, came by to take our drink order.  He then disappeared for so long that my husband was going to get up to grab our drinks that were waiting at the bar.  We ordered our appetizers and again he disappeared.  When we got the appetizers I asked for more crackers so I can spread the feta/olive dip bc it only came with 4 crostini's.  By the time Troy showed up again, we had to ask for the crackers again.  Then finally he took our dinner orders.  We had asked for a side of mashed potatoes, and they never showed up. Thankfully he even forgot to charge us for them.  Whenever he'd resurface, he'd apologize as if he really meant it.  The problem was you could see him be overly attentive to the 2 tables behind us and completely ignore our table of 4.  When dinner was over, we asked to see the dessert menu, but nothing caught our eye.  We also had to ask for more water because our cups had run dry.  I would have thought he would have brought us a little something sweet for our Anniversary, but we didn't even get a \"Happy Anniversary.\"  At any rate, the food was delicious, the service from the time we got there and had to wait way too long for having had a reservation, to the time we left, was below par. Not sure we will return.  We did leave Troy a note saying, \"It would have been nice if you would have paid attention to us!!\"", "pics": null}}, {"review": {"des": "A group of 4 of us came in here for a Friday night dinner during restaurant week.  <br><br>All four of us decided to try the restaurant week menu and a bottle of Spanish wine. Our choices from the menu were a beet and goat cheese salad, a creamy corn soup, 10oz New York strip, and the pistachio ice cream and the cookie pie. <br><br>Not one of the options disappointed.  The soup and salad were good, but the highly was obviously the steak. I don't order a ton of steak, but this was by far one of the best ones I've had. It was seasoned perfectly yet simply with salt and pepper and cooked to a perfect medium rare. The side of whipped garlic potatoes were also great and I even stole about half of my wife's since she was full from all the steak. Lastly, the desserts were also amazing. I mean, even at its worst, dessert tends to b pretty great. My wife got the cookie pie and I ordered the pistachio ice cream. I fully expected to like her cookie pie better, but I was surprised that mine was better. <br><br>Overall a really great meal. It's not a cheap place, but definitely worth it.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Y7uhuD4bv2bJX13fx5qDXQ/348s.jpg", "caption": "10oz New York Strip. Credit: Shannoninthecity.com"}]}}, {"review": {"des": "My wife and I came out for date night to Kinzie Chophouse, conveniently located a few blocks from our condo. Certainly has a great ambience for an evening night out amongst friends or a significant other. Our waiter greeted us with menus and drink lists, then brought out a tray of their cuts of meat to distinguish the differences in marble between them which was actually pretty neat, considering I kept telling him we didn't need to see them but he insisted. My wife ordered the seared salmon and I went with my go to for any steak restaurant, the rib-eye (or in their case called the delmonico). Beautifully cooked and seasoned, our top two favorites sides that complemented our dishes were the cream corn and mushroom risotto with bacon. Great food and attentive staff, can't wait to return to try some other items on the menu!<br><br>Best,<br>Charlie", "pics": null}}, {"review": {"des": "Everything about our experience was fabulous! Our waiter, Rob, was superb. He had extensive knowledge and perfect suggestions. We were there celebrating a special event so we started with champagne. Rob brought out a meat board and explained all the different cuts of meat. I found that extremely helpful. We had the crab cake and the bone in filet appetizer ~ both were wonderful. The bread brought to the table was perfect also. For dinner we had an 8 ounce filet with blackened scallops, the Del Monico, the cowgirl, and a golden cut ribeye filet. We tried the Mac n Cheese, the garlic mashed, polenta, and onion rings. We tried several sauces and each item was perfection, so delicious! The cocktails were delicious too. The chef surprised us with a dessert plate~ we usually don't eat dessert; however, it was just too tempting and we ate everything! I highly recommend this restaurant and if you are lucky enough to get Rob, he will ensure you have a great dining experience;)", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/pKU_xqtbMhIG83NCjGjLDg/168s.jpg", "caption": "Inside seating"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/emY-qz2RQBvBK154E2FjEg/168s.jpg", "caption": "Surprise dessert plate"}]}}, {"review": {"des": "Dined here a few weeks ago with my girlfriend as a way to celebrate the Christmas season. We started our meal with a calamari appetizer, it was very good. For dinner I ordered the filet oscar style. The steak was very good, the bernaise sauce and cab meat was an excellent compliment.  However I didn't exactly like the chopped green beans in the sauce.  My girlfriend ordered a penne pasta dish with a 3 oz cut of Filet on top.  Hers was pretty good as well.  The service was definitely some of the best I've seen.  The food was good overall with a few minor adjustments.", "pics": null}}, {"review": {"des": "Whoa! How have I never reviewed Kinzie Chophouse before?!?! It's a River North Steakhouse without the River North Steakhouse pricing. Almost every cut of meat is under $50, and we're talking pretty similar steak as such places like Gene and Georgetti, or the Chicago Chop House. <br><br>If you're not doing steak, I have to suggest their meatloaf sandwich. So moist it melts in your mouth and served with a beef gravy that will leave you licking the plate clean. At about $14 it's even more of a bargain than the steak and to get a meal like it across from the Merch Mart is definitely a find. <br><br>Classic in ambiance and you always have service a smile. I'm all about Kinzie Chophouse even though I'm not all about River North.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/GHvI683_Tibk8d2wPTHqVA/348s.jpg", "caption": "Meatloaf sandwich"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/f3zEJBUz5_EBNhqVLt43zg/168s.jpg", "caption": "Meatloaf sandwich"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/TtojGnN0w0jwOcQ_yVU78g/168s.jpg", "caption": "Meatloaf sandwich"}]}}, {"review": {"des": "Had the lamb chops,they were ok,the garlic mashed potatoes were excellent.The appetizer sampler was fantastic. My buddy had the Salmon stuffed w/crab special,he said it was great. Our other buddy had the steak special,he's picky & said it wasn't rare enough? It was perfect,but they brought him a new one anyways,and he liked it.", "pics": null}}, {"review": {"des": "Whenever in doubt - go to Kinzie! <br>For some reason it's been already 10 times since we were going out to some other place but then was just coming here because this restaurant never ever disappoints us. <br>Amazing, cozy, beautiful atmosphere and interior! Lost of room and a dimmed light! <br>The service is one of the bests in the area! Employees are always striving to make you feel wanted as a customer, they do their best to meet your needs and turn your dinner into a wonderful experience! <br>I don't have enough words to describe how delicious their food is! My absolute favorite is a meatloaf with mashed potatoes! A m a z i n g <br>At the same time they have some off menu martinis that are a must try such as \"truffletini\" - it is a very tasty drink that reminds me of my favorite \"White Russian\" cocktail, but has a very smooth finish. <br>Overall, I am happy to recommend this place to everyone I know and be sure this restaurant won't let them down! <br><br>Ps. They have just created a nice rewards system through Kinzie app! For every 250 points you have you'll be able to get $25 off you check! Plus there is a rewards wheel that would add a nice bonus to your dinner - like last time we \"won\" a free glass of wine just by clicking a button in this app. Try it out - very cool", "pics": null}}, {"review": {"des": "I've gotta hand it to this place for an excellent *marked* vegan option (Beyond Meat burger) in a difficult area of Chicago, at a steakhouse no less. I came in late after a long day of travel and couldn't find anything vegan around my hotel. Kinzie's came to the rescue, with a fantastic burger to which I added grilled mushrooms and avocado. It was the end of the night and they also gave me some fantastic complimentary potato wedges. Who does that?! I would definitely hit up this place again when on a work trip in the area.", "pics": null}}, {"review": {"des": "The Kinzie Chophouse is the Steakhouse you want to dine at when you want something different than the national chains (Morton &Ruth) or show places (Gibson & RPM). The locations looks like it was lifted from a old mobsters flick, right by the L and Merchants Mart. The interior is elegant and cozy with enough dark wood for ambiance and light enough to avoid the cliche.<br><br>Cocktails were served up promptly and our waitress recommended us a great Tuna tartar app. The tuna was a nice contrast to our pending jump to the carnivore side of the menu. My wife went for the smallest steak cooked medium while I had a great strip steak in the rare-midrare range. <br><br>Both steaks were cooked perfectly, so nice to have a steak just the way you want it done. The side almost stole the show, risotto with mushrooms and some asparagus with béarnaise sauce. I appreciated having the sauce on the side, a little goes a long way. <br><br>If you are looking for a great Chophouse with out the pretensions of some of the usual suspect check out the Kinzie. Great location, cozy feel and a excellent done steaks.", "pics": null}}, {"review": {"des": "I struggle with this one.  Restaurant, ambiance, and service were great.  We were visiting the steak capital of the country so we were expecting to be wow'ed.  We decided to share a dry-aged dominico, lobster tail, mushroom risotto, and the blackened scallops for an appetizer.<br><br>Appetizer - scallops were very flavorful but a bit too small.  Main dish - the lobster was amazing, the risotto was incredible - I wish I could eat more.  Great texture and great flavor.  The steak was disappointing.  We got a steak that was very thin - less than an inch.  We asked our waitress and she claimed that some steaks are thinner and wider.  We weren't thrilled with the steak at all so that was disappointing.<br><br>They didn't offer to replace the steak but got us desert instead.  Would be back and would give this restaurant another chance.<br><br>This is a low 4 star because of the steak experience - saved by everything else.", "pics": null}}, {"review": {"des": "This is one of my favorite steak-houses in Chicago. When my family had a special event like a graduation, or anniversary, and we were looking for a high-end steakhouse, this was always our go-to restaurant. This place is a classic steakhouse with amazing cuts of meat, great sides, and generous cocktails.  Also great for a nice date night.", "pics": null}}, {"review": {"des": "I like this clubby steakhouse, which seems more like a place for locals to hang out than one for traveling businessmen to impress their friends. <br><br>The place is divided into a number of rooms, so noise levels are better than some other places, although we unfortunately had a loud party of alpha males next to us, an occupational hazard of steakhouses, I suppose.<br><br>In addition to a broad assortment of steaks they also offer pasta and more salads than most of the competitors. My companions thought their New York strip was so-so, but I loved my \"Cowgirl\" which was like a lean bone-in Delmonico. I would definitely have that cut again, and I've not seen it elsewhere.<br><br>The Brussels sprouts and mac & cheese sides were good. I liked that the mac pasta was al dente.<br><br>To me the highlight here is the wine list, a Wine Spectator award winner. There are a lot of interesting selections, and the pricing is much more reasonable than at many of the other places in town. There's even an entire page of exclusive lots bought at the annual Premiere Napa Valley Auction, something I haven't seen anywhere else. That alone is reason to go back.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/UzaCJKMAGbdANqa2Rj47XA/348s.jpg", "caption": "One of the exclusive Premiere Napa Valley auction selections."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Tb9U7Cf6CnxN7YtAkRdVKg/168s.jpg", "caption": "Cowgirl"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/4GTIiFQn1AaRv8YK30jDfw/168s.jpg", "caption": "Wedge salad"}]}}, {"review": {"des": "Came here with a group of 6 on a Friday night, having made reservations ahead of time.  We were seated promptly, and had a great experience!<br><br>Food:<br>We were here during James Beard Eats week, and ordered off the prix fix menu.  The value of the prix fix menu was great, though I think the regular menu prices are worth it for the food we had.<br>The first course, a cream of artichoke soup was amazing.  It was very rich, creamy and had a really savory side to it.  Never thought cream of artichoke would be so damn good.<br><br>The second course was a crispy goat cheese napoleon.  The cherry tomato vinaigrette was perfect with the rich goat cheese.<br><br>For the main course, I chose the pan fried lamb risotto.  OH EM GEE, was it amazing!  Soft, tender, and full of flavor, the lamb was just perfect.  I never thought to pair lamb with risotto, but it just went together so well.  My wife had filet, which was cooked well, but just not a very flavorful filet.<br><br>For dessert, I had the banana cream tart, and my wife the lemon custard pie.  Both were good, but I ended up liking the lemon custard pie more.  That may be because it felt lighter, and I was absolutely stuffed after my meal.<br><br>Service:<br>We joined our friends an hour late, and quickly caught up with our friends in time for the main course.  The servers were very attentive, and checked in just enough, without hovering.  We weren't rushed out the door despite how busy they were.<br><br>Facilities:<br>Dimly lit, and cozy.  Tables are bit packed together, but I didn't feel too crowded in.  This would be great for a date night or even with a group of friends or coworkers.", "pics": null}}, {"review": {"des": "As far as fine dining goes, Kinzie Chophouse is good but not great. Some of the cuts seemed overpriced for size and ordinary flavor. In particular the $99 tomahawk steak, costar of many selfies, was not worth it.", "pics": null}}, {"review": {"des": "I took my boyfriend here for his birthday. I've been wanting to go here for awhile so I'm glad we finally went. Super easy to make a reservation on Yelp which is what we did. From the moment we walked in, the service was excellent. I told them it was his birthday in secret and they planned accordingly. We ordered oysters and the crab cake to start, and then both got different cuts of meat for our entree. My steak was little undercooked for what I normally like and my boyfriends was cooked perfectly. We ordered the mashed potatoes and cream of spinach as our sides which were both decent. What really stood out (especially for my sweet tooth) was the chocolate chip cookie slice of pie they brought out for his birthday. It was literally incredible and I couldn't stop talking about it. Great steakhouse in Chicago!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/RvKjOYV2mtH-TdJThyDCTg/348s.jpg", "caption": "Birthday chocolate chip cookie pie... amazing"}]}}, {"review": {"des": "Saturday night reservations at Kinzie Chophouse (unsure why anyone would want to eat out on such a busy night but there we were). <br><br>Front room is nice but tables are crammed in--like NYC restaurant crammed. Strong smell of seafood in the air and room temperature was very warm. Spoke to hostess and A/C was activated (we were cold by the time we left). Staff was unable to navigate between tables without bumping into patrons or tripping over chair legs. <br><br>Waiter pounced on our table and seemed to be rushed. Nice wedge salad, good entrees including the steaks. Not as good as Bavette's but what could be? Dessert was not ordered. Extensive after dinner drink selections.", "pics": null}}, {"review": {"des": "I stopped here after teaching one night during finals week. I was here once before for a business dinner. I sat at the bar and it was somewhat empty, but a Monday night. Nice decor for the holidays.<br><br>I had mushroom & asparagus risotto with a few scallops, in addition to a Makers old fashion. All were super good and hit the spot. It met my expectations for a Midwestern steakhouse. Bartender was friendly and seemed to enjoy working there.<br><br>Seems like a solid date night of business lunch/dinner spot.<br><br>A little pricey, I'm somewhat frugal, if you are looking to splurge on yourself or go out for a special occasion this seems to be the place.", "pics": null}}, {"review": {"des": "I am getting older a trying to experience different things and this is definitely top five favorite restaurants in the city. I loved the atmosphere thought, it was a little chilly. Also, I had my first glass of wine ever. I'm not a fan of wine but the food was exquisite!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/P9gNAWqVvywd7sBLQhztMg/348s.jpg", "caption": "Herb Chicken Breast with Creamed Corn Without the Sausage"}]}}, {"review": {"des": "I had the Kansas City and it was fine but nothing amazing.  The meat was properly cooked and decently seasoned but it wasn't as marbled or as dry aged tasting as I was hoping for.", "pics": null}}, {"review": {"des": "The food was delicious, but I did not get a fork, knife or spoon to eat my delivery order. Good thing I was in a hotel that provided me with a fork and knife.", "pics": null}}, {"review": {"des": "I was looking for a great restaurant for date night w/ the hubby. A friend suggested it, so we went. Lovely ambiance, wonderful hosts and nice servers. The food was good. Babe had the herb chicken and bell pepper risotto and I had the special-blackened salmon. Loved everything about my meal w/ the exception of the gravy. <br><br>Oh, the wine--absolutely divine! <br><br>Won't be a go-to date night spot, but I'll def be back again.", "pics": null}}, {"review": {"des": "We came here to celebrate my friend's birthday. There was 14 of us and we had 3 babies. I was worried at first because this looks like a very nice sit down restaurant and we werent sure if our babies are going to cause chaos for the other customers. They placed us in a room near the back (smart!) and had high chairs and kids menu ready for us (Colleen Morris had it set up for us before arrival and it was great because being a mom and having not to worry about this makes it so much easier!). The service was really good - I'm glad our servers were patient and friendly with us.. I know with a big group and with babies it can be crazy but they handled us like a pro. My son threw his spoon on the floor and  one of the servers showed up behind me and asked if I wanted to have the spoon washed.. love it! Most of the people on the table ordered steak - they all loved it. I had the short rib over rissoto - it was just okay for me which was why I gave it a 4 stars. The kids enjoyed their meals. <br><br>They also validate parking from Mart Park across the street $10 for 3 hrs!", "pics": null}}, {"review": {"des": "My husband and I visited Kinzie Chophouse on Father's Day.  It was a disappointing experience. The loud, contemporary, gym type music was annoying and obnoxious.  It cheapened the entire experience.  The inside of the restaurant is less than elegant.  It is definitely nothing special.  Entering and leaving the restaurant can be dangerous.  There is a sloping step on which anyone can trip or slip.<br><br>The meal was uninspiring.  My husband ordered a rib eye steak.  It was small and looked more a filet mignon.  It definitely was not worth the price.  He did not like the mac and cheese.  The dinner roll basket was ridiculous.  In the basket were two, very small sweet bread rolls that would normally be served at breakfast or at a tea party along with large, flaky crackers.  I asked the server if they offer real dinner rolls and he said no.<br><br>On the plus side, if you are a vegetarian, they do offer appetizers, sides, and entrée options.  I ordered the Beyond Meat burger and it was good.  I didn't appreciate the $1.00 extra for substituting mashed potatoes for fries.  I have never been charged extra anywhere for this type of substitution.  Also, the service was good.<br><br>I would recommend trying other steak restaurants in downtown Chicago and its suburbs.  We will not be back.", "pics": null}}, {"review": {"des": "Great food, but tables are so close to each other... our chairs were bumped into by other patrons and servers a few times... plus if families bring their kids (and they do), forget about having a date or an adult conversation there.", "pics": null}}, {"review": {"des": "So, not a good way to start dinner.  Nothing like one roll for a table for two!  It's all in the details!!", "pics": null}}, {"review": {"des": "We love this place and always stop in every trip to Chicago! We love sitting in the Bar area and Michael D. is one of the best bartenders in Chicago! On our last visit he recommended the mushroom tart appetizer and its now one of our must eat dishes every time we visit! We will keep coming back as long as we visit Chicago!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/WTK6-zH70xh7YusEFRAybg/348s.jpg", "caption": "Don't miss the mushroom tart!"}]}}, {"review": {"des": "The lamb and filet were amazing! Everything else was average at best... Doughy pastry, overcooked sides, etc. But the worst part was the service... We sat outside and we're 1 of 3 tables our server had... He walked past us countless times with out acknowledgement... We waited 5 minutes AFTER we finish our appetizers to order our entrees... Definitely not worth the $150 spent for the two of us...", "pics": null}}, {"review": {"des": "Certainly not the best steak ever but cooked to order at Medium Rare. Basic seasoning of salt and pepper. The Dry Aged Delmonico boneless usually commands a higher price but i don't feel that $44 was justified. The NY strip, 10oz prix fixe was at least as good (for a strip cut). Side dish garlic mash was excellent. Creamed parmesan spinach was not. It was basically soup!<br><br>Overall, Ruth Chris is still a superior joint, for a few bucks more. However, i do appreciate the wait staff's knowledge here and attempt to impress patrons by bringing out sample cuts of meat trying to explain which is which. But if you come to a place like this planning to drop this kind of coin, i would hope one of two things for you. You or your date know enough about steaks to know what to order, or you would be wise enough to take a suggestion from the staff. Seriously, looking at a plastic mold of meat and hearing 10 adjectives to describe the location to where the cut comes isn't that helpful. Also, when every cut is considered 'juicy', i don't know how constructive it is. But it is showy and fun as an experience, so im not knocking the fact that they do it. <br><br>In conclusion, there are endless steakhouse options in Chicago, and without hesitation, i will move onto others for exploration.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/gyigopOJjiBGUY1qyv62vQ/168s.jpg", "caption": "Dry Aged Delmonico 16oz"}]}}, {"review": {"des": "This steakhouse has been in my top 3 list since I first discovered it about 5 years ago. I've made multiple group birthday dinners here and recently came for a dinner for 2. If consistency is important to you I can tell you the food has top notch and just as I remembered everytime I've come. If you pay good money for a steak you want the experience to match and kinzie chophouse doesn't disappoint. Not only are their steaks amazing but the sides compliment perfect. I can't comment on the dessert because I've never tried them.. the edible ones that is. The liquid desserts are GREAT. Best lemon drop martini and chocolate martini. <br>You really won't be disappointed with choosing this one over the many great steakhouse options Chicago has to offer", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/WO0ybINokGXg0UUi7OJOAw/348s.jpg", "caption": "Chocolate martini and the white martini. Great for dessert"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Zp1d34aXYvT5HQZlpgYfsQ/168s.jpg", "caption": "Parmesan crusted 8oz filet -medium of course"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/tI8mv2OTCAZfISqaUNrKQg/168s.jpg", "caption": "2 perfectly  cooked  parmesan crusted filets, Mac and cheese, and asparagus with hollandaise"}]}}, {"review": {"des": "A very nice, pleasant atmosphere. The food was good, especially the mac and cheese. Also, our server Rob was awesome!", "pics": null}}, {"review": {"des": "We were looking for a great steak meal and found it here. Wife loved the filet on her steak salad. My Delmonico was flavorful and the side sauces very good. Potato sides were big and good as well. Staff was friendly and attentive and atmosphere cozy. Not inexpensive- 3 are for $200 but that's not out of character for steak in Chicago.", "pics": null}}, {"review": {"des": "Came again for my dad's birthday with the family. I chose it because I'd enjoyed it previously and it's more affordable than some of the other steakhouses we've wanted to try! <br><br>We were once again very impressed! The servers are very knowledgable and give you a brief introduction to all their cuts, so you can make an informed decision about what steak you want. The servers are very attentive and even caught onto a few hints about it being my dads bday, and brought out a beautiful, rich (complimentary) chocolate cake! <br><br>The steaks are so flavorful and cooked perfectly! I always stick with the Filet, but the Delmonico (ribeye) is also really great (more flavorful, but not as tender). I ordered mine with a horseradish crust, which was delightful. You can have your steaks served with any complimentary sauces, as well. The steak by no means needs the sauce, but the Gorgonzola cream and Soy Beurre Blanc sauces were great to add to a few bites! <br><br>We ordered the Mushroom Risotto and Broccoli Fondue for sides to split between 5 people. It was definitely enough and both of those were delicious. I would highly recommend those sides.<br><br>Definitely recommend and I will plan on coming back!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Y3BoXkmMe7qCcDSUHktChA/348s.jpg", "caption": "Birthday cake"}]}}, {"review": {"des": "We ordered delivery this evening. Food arrived 30min late and was cold. Not due to the driver but due to the restaurant. Sadly we ordered it over an hour and half before (with a preset delivery time) and it still arrived late and very cold. After spending over $110 on delivery; we won't be ordering again from here.", "pics": null}}, {"review": {"des": "From start to finish a great meal, amazing service, and unique drinks. The night started with a cute girl who immediately greeted us as we entered.  They allowed us to sit immediately without that typical \"wait for your whole party\" garbage which was appreciated.  <br><br>Our server Craig who looks like George Clooney gave us perfect recommendations all night. He did a fantastic job. I had the Mule drink, not Moscow, another variety that was delicious.  He also recommended a wine that was good enough to take a picture of to buy at home. <br><br>Steak was as good, if not better, than the more popular Chicago chop houses.  Sides were even better with the cream corn and Brussels sprouts were my fav.   I highly recommend this place for groups or special outings.", "pics": null}}, {"review": {"des": "Solid selection of steak cuts to choose from, delicious food, good wine list, great service and an intimate, authentic space, among a sea of chain steakhouses. Would def go back.", "pics": null}}, {"review": {"des": "Dinner and drinks with friend there recently....very impressed with the beer / wine selection, quality of the menu and reasonableness of the prices given the former and the neighborhood.  Will be back.", "pics": null}}, {"review": {"des": "Great restaurant! Had the Delmonico steak which was PHENOMENAL!! The staff is very friendly and sat us at a table on Valentine's Day without reservation and minimal waiting time! Would highly recommend it to anyone... Best steak I've had in a while (medium-rare)", "pics": null}}, {"review": {"des": "Sit in the bar area and place yourself in the care of Craig. If you check a Wikipedia page for \"hospitality\" his photo appears. The consummate host, he introduces the unparalleled fare regarding the various meat cuts and suggests ideal vintages to accompany. Just had the lamb chops upon his suggestion and learned the Second City is more than ideal beef cuts, fantastic seafood (Joe's) and miserable pizza (tomato casserole ain't pizza) - but a true food town with hosts and guides who are proud to show off the other cuts, the alarmingly substantial sides (Get. The. Brussel. Sprouts), and the perfectly paired wines. Walk past the dining room, settle in to the bar area, and lose yourself for an evening. You will not be sorry.  Especially if Craig is working the bar, fending off the encroachment of the white shirts.", "pics": null}}, {"review": {"des": "I tried the aged Kansas City cut, my wife tried the Ribeye filet.  We tried the brussels sprout and macaroni as sides, the sampler as an appetizer, and the toll house pie for dessert.<br><br>Service was reasonably prompt but not impeccable.  Steaks were well prepared but a bit overseasoned.<br><br>We left feeling like it was a fine evening, meeting our expectations, but not one of those dinners where you look back and say it's in your top five steakhouses.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/n7S7obTN4qF7w8GFnr78JA/348s.jpg", "caption": "Mac & Cheese, brussels sprouts, ribeye fillet"}]}}, {"review": {"des": "The only problem with our visit to Kinzie's, was that they couldn't find our Yelp reservation and we had to wait an additional 15 minutes after our reservation time. Once we were seated, everything was great; excellent service, fantastic food and a great atmosphere in a busy steakhouse. Remember to download the app and Jon the VIP club to spin the reward wheel, we won a 50% discount off our bottle of wine.", "pics": null}}, {"review": {"des": "Very under-rated steakhouse in the loop. Cozily tucked away near the Brown line, this classy old school joint will not disappoint carnivores searching for delicious meat. I had the filet encrusted with aged gouda. My friend had a Kansas City strip, which he let me try. They were both cooked perfectly. Great wine list. Great whiskey selection. <br><br>Tourists and millennials go elsewhere for glitz and glamour. Real Chicagoans choose Kinzie when all they want is a great meal.", "pics": null}}, {"review": {"des": "Wife and I went for dinner tonight and had a exceptional meal. My wife had the beef short ribs and I had the sesame crusted ahi tuna. Both meals were fantastic. Not to mention the crab cake we had for an appetizer. That sauce that the crab cake came in was so good. Then we finished of the night with the toll house cookie and a decedent chocolate cake. Chocolate cake was good but the toll house cookie was definitely much better. Service was on point too and we went during the dinner rush.", "pics": null}}, {"review": {"des": "My fiancé wanted a good steak and chose this place for his birthday dinner. We were lucky to get a last minute reservation! We arrived a few minutes early and had a drink at the bar. Our table was ready on time which was good since we were starving! We started off with a half dozen oysters and another round of drinks. I had a lemony elderflower cocktail which was refreshing and tasty, but switched to wine afterward. I really like how our waiter brought out a tray of the different meat cuts and explained them all. He didn't miss a beat!<br><br>I'm not a big steak eater and originally planned on seafood, but he sold me on the gold cut!  I ordered it medium rare with a size of bourbon peppercorn sauce. The steak was perfectly cooked, juicy and flavorful. Those sauces really aren't needed but are a nice touch if you want to add a different flavor. I tried fiancé's porter house and it was excellent. He loved it. We had garlic mashed potatoes and Brussel sprouts for sides. Our meal was pretty simple, but the preparation and taste brought the food up a few notches. Kinzie Chop House is definitely the place to go if you want a solid steak meal that won't break the bank. We've dined at a few other steak houses in the city an this was the most affordable. The restaurant is on the fancy side, but not pretentious. I saw people wearing Cubs gear and I'm pretty sure the lady at the table next to us just came from the gym . She was smart to wear yoga pants though cause you'll be stuffed!", "pics": null}}, {"review": {"des": "Went to Kinzie Chophouse on the recommendation of the concierge of the hotel we are staying at.  The three of us had lunch and ordered the Delmonico steak and lamb chops, along with a side of mushroom risotto.  Since we were going to eat \"family style\", the steak was sliced for us.  It was by far the best meal we have had in Chicago.  Both the steak and lamb chops were tender and very flavorful.  The risotto was the best mushroom risotto I have ever had.  Our lunch there was definitely a highlight of our visit to Chicago.", "pics": null}}, {"review": {"des": "Had a great time with a group of friends! The atmosphere was open and the food tasted amazing! Would definitely recommend to a friend but there's so many places to try, I'm not sure I would HAVE to come again. Staff was nice and courteous and the prices weren't too outrageous. You can expect to spend much more at other steakhouses in Chicago. Try the white halibut, that was an amazing dish!", "pics": null}}, {"review": {"des": "Thank you so much Kinzie chophouse for offering a vegan fall menu! Everything was absolutely delicious. Service was top notch and the atmosphere was classy and elegant.", "pics": null}}, {"review": {"des": "Kinzie has become our [incredibly] reliable, go-to spot in the city for a nice dinner.<br><br>3 total friends, 2 Kinzie virgins. Saturday night. Welcome back from college dinner.<br><br>Split a Caesar and nicoese salad, I loved the nicoese, good feedback on the Caesar as well as the rock shrimp cake.<br><br>I told myself before we sat down I would try something new, so I got the apple wood smoked pork chop. It was really tasty, juicy, and cooked right. I particularly enjoyed the BBQ sauce that came with it and the small portion of side risotto was delicious too. Two filets, one Oscar style, both came out perfect, the virgin Kinzie friend said his was definitely one of the best he's had. <br><br>After a bottle of pinot, rose, a couple glasses of moscato, a sample of grappa, and a glass of scotch, our group was collectively liquored up. We got a carrot cake, as well as an ice cream before we left, and of course those were just lovely.<br><br>Rafael is basically my designated server, such an awesome dude who really knows his stuff.<br><br>Every time I come in I try really hard to find something wrong here and each time I am overwhelmed by how tasty the food is, how stellar the service is and how it makes for such a fantastic dining experience to some of my first-timer friends who are a little weary about spending the $. Sure, it's not necessarily cheap, but there are definitely more expensive places that aren't as good.", "pics": null}}, {"review": {"des": "I can honestly say this was the BEST filet mignon I've ever had. It was cooked exactly how I asked for. It was juicy and oh so flavorful. I paired it with the broccoli fondue which was excellent. My friends both ordered salad and they were massive. Serving sizes are exceptional. <br>Did I mention that the servers are awesome? Everyone was extremely nice and attentive. Such a relaxing, awesome meal!<br>If you are ever in the in the theatre district while in Chicago, you should do yourself a favor and eat here.", "pics": null}}, {"review": {"des": "4.5 stars. I came here for my birthday and my boyfriend and I both got the petite filet. They were very good and the garlic potatoes were fantastic! The bruschetta starter was also delicious. Service was absolutely outstanding (we had Chase). We also received a delicious chocolate cake. The Brussels were too salty, but everything else was fantastic. A great experience", "pics": null}}, {"review": {"des": "Always a fantastic experience! I take clients here on a consistent basis and it never disappoints. <br>The array of steak choices and sides are endless, the salmon is to die for and a wonderful wine selection make this a  in my book.", "pics": null}}, {"review": {"des": "In the crowded and abundant Chicago chop house scene to choose from, this one is a sleeper pick in a good way.  This was recommended to me by a hotel concierge as a solid chop house with reasonable prices and great quality.  We Uber'd here but I suppose a walk from the Mag mile from the south side would probably be about 15 minutes. <br><br>It's a smallish restaurant with a calm quiet non-pretentious ambiance.  No frills, straight to the point but not lacking of personable and impeccable service. The food was not lacking either. Standard starters and all the cuts of meat you'd imagine. I'm not a steak aficionado (getting into grading) so it wouldn't be fair to me to opine on that aspect of quality.  We had the Delmonico in both forms - the dry aged cut as well as the bone-in.  It was easy to taste the difference in the two.  While the bone-in satisfied that primal instinct of eating off of a bone, and provided all the succulent juiciness of the cut, the aged version was all the better.  Dry-aged did bring out that extra level of grass fed beef flavor.  Fuller and richer in flavor it was indeed. <br><br>I liked the feel of this place.  Not casual, but can be. Not overly formal, but can be as well. I came in slacks with a buttoned down shirt which was not out of place. Other men were in blazers and or suits.  I look forward to my next visit to Chicago for another visit to this restaurant.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/FMlsvRAaC5XtYrT1DQJ9Tw/168s.jpg", "caption": "Dry-aged 16 oz. Delmonico"}]}}, {"review": {"des": "When I think of Kinzie Chop House, I think upscale date night!<br><br>On this night, I ordered a Riesling and steak cut salad (cannot even begin to think of how high the margins must be on this one... it's maybe 4 oz of steak on a bed of lettuce with a couple cucumber wedges).  Husband thoroughly enjoyed his Delmonico rib eye steak.<br><br>Service was attentive.  The table tops for 2 are a little small and cramped.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/VGcUA32QjZKohRL0qekjOA/168s.jpg", "caption": "Sautéed spinach and mushrooms and Delmonico steak in the back"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/B7TIs73R9ZG3OIXGZLxNFw/168s.jpg", "caption": "Steak cut salad"}]}}, {"review": {"des": "Me and my boyfriend came here for our anniversary. Our waiter (rob I believe) was absolutely amazing!! Friendly, upbeat and knowledgeable. I'd go back just for that type of service. Although the food was for sure a star. I ordered off the lunch menu at dinner service and it the waiter was accommodating. We had the mushroom tarte and the goat cheese. DIVINE!! The meatloaf was homestyle but refined. They even brought us a dessert to celebrate !!", "pics": null}}, {"review": {"des": "I wandered in here one night for dinner before a meeting and ended up eating one of my new favorite meals in Chicago. I got their goat cheese salad and it was out of this world, I can't wait to go back and eat it again.", "pics": null}}, {"review": {"des": "I recently visited Kinzie Chophouse on Valentine's Day! I wanted to try out one of the older steakhouses of Chicago. I am so happy I did! <br><br>This little Gem is worth trying! For Valentine's Day they gave us complementary champagne! They ended up giving us 2 glasses each because we had to wait for our table. I was pretty happy about that! <br><br>We first started out with some oysters! They were ok nothing too special about them. Next, we had the jumbo crab cake and the mushroom& Gorgonzola tart! I highly recommend both of these appetizers! Especially the tart! <br><br>As for dinner I had the bone-in Delmonico! They cooked their steak just right! <br><br>Wine list has many options to choose from and the ambiance is romantic! Highly recommend coming here with a significant other if you are looking for one of the older establishments of Chicago!", "pics": null}}, {"review": {"des": "Really disappointed in this place. It was 100% average. While the Gorgonzola sauce was nice (and free!), the steak was underwhelming and under seasoned. The cocktails were awful- I had a pomegranate gin cocktail that was so syrupy. The wine list was overwhelming- and extremely over priced. It should have been organized better. Beautiful atmosphere, however.", "pics": null}}, {"review": {"des": "Service-2<br>Our waitress was so clueless. She overcharged us for dessert, took forever to take our order, and did not know the menu. <br><br>Ambiance-4<br>Decor is nice. Lighting is dim and intimate.<br><br>Food-3.5<br>My steak was cooked perfectly, medium rare with a warm, red center. My husband ordered his medium-rare too, but his was slightly more overcooked. The flavor was good, but not outstanding. It doesn't stand out among the countless other steakhouses in the city. Winter chowder soup was lacking seasoning. Caesar salad was underdressed. Cookie cake for dessert was too dense and not sweet enough. Wine selection was basic.", "pics": null}}, {"review": {"des": "Met a friend at Kenzie Chophouse for dinner last weekend.  Our fillet, wine and entire meal was excellent.  Beyond great food, the restaurant setting was elegantly appointed and intimate and our waiter Rob, was outstanding which made the meal memorable.  Rob was knowledgeable, attentive and personable.  5 stars to Kinzie's for great food, ambience and wonderful service.", "pics": null}}, {"review": {"des": "Situated at the corner of Wells and Kinzie, Kinzie Chophouse was always in sight while heading in and out of the Merchandise Mart as a mysterious steakhouse. I've always been tongue tied coming up with reasons to try it out and finally jumped at the opportunity to finally check it out during Chicago Restaurant Week. Kinzie Chophouse surprised my expectations as a local brick and mortar establishment. Quite cozy. Smart and clean interior design. What reeled me in most was their '17 Restaurant Week menu. Featuring a 10 oz. strip loin steak and bourbon maple syrup coated pork chop as their entrees we were in for a treat! Our server, Jim, was very friendly and insightful about the complimentary steak sauces, too. As the most popular steak sauce in the house, the soy beurre blanc does not disappoint. It's got one of the most unique taste profile I've ever tried! Soy, mirin, white wine vinegar, white wine reduced down to a quarter and reconstituted with white butter--a sure winner that'll keep me coming back! Ugh, I'm in love with these flavors! Highly recommend this unassuming steakhouse for all to try!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/FTT551d3qLxQ2ig6J7nT9A/348s.jpg", "caption": "Private dining area."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/DuizfAT8Hj1E_av2gWQcqA/168s.jpg", "caption": "The bourbon bacon maple syrup glazed pork chop with risotto."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/bntuXA27DgORno6Q0k3yWA/168s.jpg", "caption": "The chocolate chip pie a la mode."}]}}, {"review": {"des": "We were in Chicago for a trade show and I needed to find a quality steak house close to my hotel.  <br><br>After looking in Yelp, I found this place and decided to give it a shot and boy did they deliver.  <br><br>The steaks, appetizers, wine, atmosphere and service all delivered big.  I was entertaining our largest customer and wanted to make sure I took them somewhere to impress.  Everything about this place was nice and I love the character and feel you get when you walk in.  <br><br>They do have outside dining during the nicer months so if you want that, be sure to ask when making reservations.  <br><br>I will definitely stop in again when I'm in town.  <br><br>Enjoy!", "pics": null}}, {"review": {"des": "The 2 stars are just because the server was good. <br>The food kinda ... well... it was terrible. I had the French onion soup and the blackened scallops. The soup was ... fine. At least editable. The scallops on the other hand.... gross. <br>Separately- you have this beautiful wine system, why put cheap wine in it??! The whole point of the system is that you can sell high priced wines by the glass but you have these cheap commercial brands?? I would have ordered wine but what's the point?", "pics": null}}, {"review": {"des": "Went here this past memorial day weekend and took my soldier boyfriend and my son and cuzzo... We had a great time. We were a little under dressed and that was not a problem. <br><br>The waiter had his hands full with our group however he did not blink an eye. Very curteous and professional. The food was outstanding. They bring you a plate with all the steaks and describe each one to you. The different choices of sauces and additions were so glamerous and tasty. <br><br>Do your mouth a favor and try this place! Our bill with drinks for four people came to $350 with tip!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/HqUdSEZTKoZflSAx66tcCA/348s.jpg", "caption": "Filet with blue cheese cream sauce... Yumm"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/luodq3RbTcqSZ0JcWc_Qcw/168s.jpg", "caption": "Chocolate covered banana drink. Very tasty#"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/A9gVgfzN8ZQe5kmPRbHjkg/168s.jpg", "caption": "Setting"}]}}, {"review": {"des": "Great tasting food. The thing that made it the best for us was our server. He went above and beyond to make our experience a memorable one!! Thank you Kinzie Chophouse for a great environment, great service, and excellent steaks!<br><br>This was our first time in Chicago. We will definitely plan another trip there, if we visit again.", "pics": null}}, {"review": {"des": "I brought my parents to this restaurant and the cost of the food is not worth it. I ordered their gold cut steak and was served the wrong steak. They happily brought it back and served a bloody cut of meat. I asked for medium and neither steak was like that. Very disappointed. I ended up just bringing the steak home and cooking it myself. It was a great cut of meat, but the overall experience at the restaurant was not what I was expecting.", "pics": null}}, {"review": {"des": "Found this place after trying too late for reservations elsewhere and could not have been more pleased. Wonderful decor with perfect lighting.  Great staff.  Ordered prime rib and garlic mashed.  Meat was cooked perfectly and was very tasty. Potatoes were also very good.  Entrees are served ala carte so you have your pick of 8 or so sides. Others in the party ordered surf and turf, filet mignon and the meatloaf with gravy.  All revived big thumbs up from my guests. I sampled the meatloaf and it comes in a close second to only my wife's meatloaf which is not on the menu.  .  Great place that will be a primary selection for dinner next time I'm downtown.  Can't wait to try the other meat selections on the menu.", "pics": null}}, {"review": {"des": "Right across the street from Merch mart where I go frequently for work, I've seen this place a dozen times and heard about it 3x that but never had the chance to check it out for myself. Boy was it a treat! Meatloaf, prime rib, calamari, brussel sprouts, everything here was perfection. I'd come again when I feel like splurging on another steak", "pics": null}}, {"review": {"des": "We had the famed Broccoli fondue and found it to be cold and boring.<br><br>We had the tomahawk steak - which I have not had in years.  It was seasoned well and cooked perfectly.<br><br>We also had some awesome Blueberry bourbon drinks that were amazing!  We loved our dining experience!", "pics": null}}, {"review": {"des": "From the menu, to the food, to the staff, to the service, this place deserves 6 stars!!! <br><br>While in town for a conference and wanting a Chicago Steakhouse dinner that was different from the chains at home we asked some locals and man they were right. HANDS DOWN THE BEST! <br><br>Amazing macaroni and cheese with Italian cheese that should be a food group. Had the dry aged Delmonico with the blue cheese topping and I know I will be dreaming of that steak tonight. Superb non-pretentious genuine staff who know their business, wines and cocktails reccomended and prepared by true professionals. Beautiful inside and a true experience from taste, flavor and knowledge this has to be the best chop house I've ever gone to!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/hEmJO08L_88efo24XJm1tA/348s.jpg", "caption": "14oz Delmonico with blue cheese and the amazing spinach and mushroom side."}]}}, {"review": {"des": "Wonderful steak dinner. One of the best mushroom rissotto ever. Steak was prepared exactly as we ordered Service was excellent. Next time we are in Chicago this will definitely be a stop", "pics": null}}, {"review": {"des": "RACIALLY PROFILED!!!!This was THE WORST dining experience I have ever had! My husband, myself and another couple  (all African American) were asked to show identification of we wanted to pay with a credit card. I thought this to be very odd. I've been to many steakhouses  (Del Friscos, Steak 48, Mastros...to name a few) and have never been asked to show identification unless I was drinking. I asked the server why this was th case and he said it was policy. Giving the benefit of the doubt, I decided to fact check by asking two other tables of guests (Caucasian) if they were required to show identification using their credit card and the response in both cases was NO! HOW DARE THEY!!! I left the restaurant in tears! Just devastated. This has never happened to me. I was truly disappointed.  Needless to say, I cannot patronize this establishment ever again and if you believe in equality, neither will you.", "pics": null}}, {"review": {"des": "The mushroom risotto is to DIE for. Excellent service and delicious food. What a great combo. I definitely recommend this place", "pics": null}}, {"review": {"des": "First time Chicago and went for a birthday dinner,this place is EXCELLENT and very reasonably priced. Appetizers were huge waiter and other staff very  attentive very nice atmosphere. Excellent choice in cuts of meat and my steak was perfect.", "pics": null}}, {"review": {"des": "Our service was great! Our server knew in detail to the cuts and type of meat and what wine paired well with everything<br><br>The food was delicious, although the veal chop we ordered was a little over cooked it was still flavorful <br><br>we got the mushroom risotto and asparagus as sides, the risotto was good, the asparagus was anything you could cook at home. Just depends on meat cut preference you can not go wrong with a steak.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/F9sxwQktXy8RrcrDnKA3oQ/348s.jpg", "caption": "Veal chop"}]}}, {"review": {"des": "A great steakhouse in Chicago, and my husband and I are pretty biased about steak.<br><br>Went out with my husbands cousin and his SO for dinner while they were in town from MN. He recommended it so we decided to give it a chance! <br><br>We started out with drinks, the Georgia peach tea was ok but the sangria was awesome! We had the mussels and crab cake for appetizers. The crab cake was delicious but the mussels we're not that great. They were the tiniest mussels I've ever had and for the price they just weren't worth it.<br><br>We both split the tomahawk steak (was the special) which was a bone in rib eye (our favorite) and it was very good. Cooked perfectly with just the right amount of char on the outside. Since we were splitting it they cut it into slices for us which was nice.<br><br>We had the bleu cheese potato gratin and the creamed spinach. Both were exceptional. The creamed spinach was definitely the best I've ever had at a restaurant and the bleu cheese potatoes were to die for!<br><br>For dessert we had the chocolate cake which was really rich and delicious. <br><br>The place is a bit pricey but overall it was a great dinner. We will definitely be back for more!", "pics": null}}, {"review": {"des": "It might be a corner restaurant in an unusual spot, but oh my goodness what an amazing place. My boyfriend lives in the suburbs and is a frequent visitor to the city so he absolutely knows how to choose restaurants. It was my first trip to Chicago and this was our first dinner out and I couldn't have been anymore impressed with Kenzie Chopshouse! <br> As stated Kenzie sits in a corner and could be passed up without realizing it. Very simple outdoor building, but one step through the doors and you are immediately in a cozy, classy, and inviting enviroment. The walls are a creamy white, the linens are creamy white with black accents to them beautifully set. Accompanied with low cozy lighting, it makes for a very romantic experience.<br>  My boyfriend made reservations with Rafael because he has been there many a times before and Rafael is his, now our, go to guy! Rafael stopped and said hello and caught up with my boyfriend and indroduced himself to me. Recommended wines for us and even let us sample a few to make sure we would be happy with our choices. Seeing as it was my first experience he wanted to give me the official learning experience of their menu and meat cuts and selection. <br> We were brought a seasonal pumpkin soup with crutons and oh my goodness, it was so good. The texture was a little thicker than tomato soup and the taste was mouthwatering. It was sweet enough to be identified as pumpkin but savory enough to not be a dessert. <br> My boyfriend and I had decided to split a 10 oz strip steak I believe, cooked medium well with a side of broccoli fondue. And the steak was probably to most tender and flavorful steak I've ever had. Perfectly cooked and so juicy. The broccoli fondue was very good as well steamy broccoli covered in cheese, how could that ever be bad? We also split the southwest chicken salad. The salad was YUGE! could easily have had just the salad and been fully satisfied. Usually dressing are either put on too heavy or too thin but the semi spicy dressing they used was perfectly paired with the salad and added just the right amount of flavor. <br> We finished our meal with a dessert duo, beautifully presented to us on a plate covered in strawberry sauce whipped cream and fresh fruit, we had a pistachio gelato and a chocolate dessert that was so rich it literally gave me goose bumps. I'm not sure exactly what the desserts were due to them being complementary from Rafael since my boyfriend has been so frequent. But I'm sure if you inquired you could easily find out. <br> Over all Kenzie Chopshouse was hands down the most enjoyable date night dinner I've experienced. With the romantic ambiance and the wait staff being above and beyond fantastic and the food being incredible, I highly recommend it to anyone and everyone. And if you want an incredible server request Rafael!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ib47AVw4kGaMBLV5ifOXag/348s.jpg", "caption": "Dessert duo"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/2ItNbwvrIRzPiEVaQqTXyA/168s.jpg", "caption": "Southwest chicken salad with avocado added."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/-ZZk-Q_Lnsvy66CBSgFjmw/168s.jpg", "caption": "Strip steak perfectly seasoned and cooked! Served with 4 dipping sauces."}]}}, {"review": {"des": "Loved this place.  Our bartender/server Craig was FANTASTIC.  He took great care of us and made wonderful recommendations.  Our goat cheese appetizer was TOO DIE FOR, and my arugula and pear salad was awesome.  It was huge though, and two people could definitely share it.  Same with the bowtie pasta dish-delicious, but absolutely big enough to share.  We would come back again for sure when next we are in Chicago.", "pics": null}}, {"review": {"des": "I had the pleasure of visiting Kinzie again. I mean it when I say pleasure. From stepping into the warm entrance (seriously quite thankful for the heat given Chicago decided to be bipolar and freezing in October) to the amazing dessert, I can't say enough good things. The service I had today was a 180 degree turn from that I last experienced.<br><br>Something to note: there is no corkage fee for the first bottle (if your bottle isn't offered on their wine list), but the second bottle is $20.<br><br>As for the meal, we were greeted by a wonderful server named Jim, who lucky for me was from Seattle and lived in SF for a bit so could empathize with my Californian distaste of the cold...but I'm getting off track! He noticed we had brought a bottle of white vino and immediately whipped out white wine glasses and an ice bucket. +1.<br><br>We started with the shrimp cake appetizer (I'm not sure this is the exact name but close enough), and the lobster sauce was so good I found myself dipping the starter bread into it! <br><br>We opted for the following: a dry aged delmonico, a porterhouse, and a medium rare prime rib.<br><br>Man, the dry aged was phenomenal. If you're a fan of David Burke's, you should definitely give Kinzies dry aged a try! The porterhouse was awesome (although at 24 oz, I definitely had some to take home), and the prime rib was surprisingly good!! I'd choose this prime rib over Lawrys any day!<br><br>For the sides, we got creamed corn and sausage, spinach and mushrooms, and the mushroom risotto. All were spectacular. My favorite part though? You can add mushrooms to your steak for $2!<br><br>The deserts were also phenomenal and not too sweet :)<br><br>Thank you Susan- you truly know how to host a guest and it is no surprise that there are as many good reviews about your success posted on your walls !", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/wSBpdRF01z-HcgZAQU8K0w/348s.jpg", "caption": "Dessert"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/7XCDcnZwaWQ-VhACKajKfQ/168s.jpg", "caption": "Daynmmmm porterhouse"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/2H67aksKX8SyX0546dHfuw/168s.jpg", "caption": "Prime rib"}]}}, {"review": {"des": "Surprisingly, I didn't order a steak here. I guess my recent trip to NYC left me craving something lighter...<br><br>I ended up ordering the risotto, which was superb. Hot, savory with a lot of mushrooms and asparagus in it. I tried a bite of my friend's Dry-aged delmonico and it was fantastic! Perfectly seasoned, juicy and tender. What a perfect bite to taste. I also tried some of the brussel sprouts, and the seasoning is delicious.<br><br>They were able to accommodate our large group without any reservations, which is a huge plus because our group was HUNGRY after all the traveling, jet lag, and full day's work they had to do.<br><br>Our server was so informative and described all the different types of types and cuts of meat (with actual samples of the raw meat wrapped in plastic...interesting), as well as the suggested way of cooking them. The next time I'm in the mood for steak, I'll have to come back to try one of the ribeyes or something. I just love the marbling, where it's a perfect blend of meat and fat. Yum!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Wpwh25tAaUPPRqyExdiQWw/348s.jpg", "caption": "Brussels sprouts"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/esWL40aTosABr3fgtEnYTw/168s.jpg", "caption": "Delmonico"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/vBBWy6vppW-R0jjlD_tahQ/168s.jpg", "caption": "Risotto"}]}}, {"review": {"des": "We are in Chicago a couple of times a year at a trade show at the Merchandise Mart. This is a terrific steakhouse right out the back door of the Mart on Wells. Perfect for snowy winter nights.....you just cross the street and no need for a cab. So....this is how we found the place. And we were not disappointed ! <br>We usually sit in the bar area at one of the tables.........and we split some things. Everything we have ever had has been delicious.<br>Great atmosphere and friendly staff.", "pics": null}}, {"review": {"des": "I recently took a trip to Chicago to meet up with some college friends that I haven't seen for a while.  They urged me to try a steak and Kinzie and I obliged.  Now I'm not normally a fancy sit-down restaurant kind of guy, I prefer tacos and street food, but I absolutely loved Kinzie.  My friends who showed me around took me during lunch time as to avoid the dinner rush and what we got was great food and great service. <br><br>As part of a younger generation of restaurant goers, we were obviously under-dressed for a place like Kinzie, flip flops, t shirts and cargo shorts, but the restaurant staff couldn't have been more welcoming.  We were promptly seated and brought water to start.  After looking at the menu we all went with the 14 oz. Delmonico, the cheapest steak on the menu.  We also had an order of the mac and cheese and some sort of sauteed mushroom.  <br><br>The first bite of the steak was heavenly.  I had gotten the steak with some horseradish on top, but I made sure my first bite was pure steak.  I've always been a firm believer that a store bought, home grilled steak can go toe to toe with a steak from a fancy steakhouse, but the Delmonico was better than anything I could have made myself or any steak I've had so far in my life.  We were also given four different house made steak sauces to try and my favorite was their cheese sauce, not sure exactly what was in it.<br><br>Overall the experience at Kinzie was fabulous and I can't wait to go back again.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/V8-tx2EYQTztXqyMQ4E9jQ/348s.jpg", "caption": "Delmonico Steak with Horseradish Rub"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/JTHG6lr9cbffS7bdTEfMTA/168s.jpg", "caption": "Sauteed Mushroom - Pretty great stuff."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/eHZ6iRxkDWly1agnx8n9oA/168s.jpg", "caption": "Mac and Cheese - Not the best I've ever had."}]}}, {"review": {"des": "Made reservations for our anniversary here last week. We were running a few minutes behind and called in they were able to push our time 15 minutes later which was really accommodating. Our server was Rob he was great and genuine. The menu was explained well and we decided on platnuim cut cow girl. Unfortunately we hit a few snags with the preparation of our meals, but the manager was great in making sure everything was right. Overall our experience wasn't a common one but we understand that mistakes can occur, we really appreciate the way the situation was handle and the solution. Thank you! We will be here again.", "pics": null}}, {"review": {"des": "12oz filet was just ok. Creamed spinach side was not good; it tasted like spinach leaves with sauce poured on top. The four cheese Mac and cheese was ok, tho a bit dry. I expected to be wowed, but was not impressed.", "pics": null}}, {"review": {"des": "Best Steak we ever had!!! Get the steak and you will not be disappointed. The waiter knew<br>About all the types of steaks", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/dB2NOHaIkeCviL_q42Pzaw/348s.jpg", "caption": "Porterhouse Steak with broccoli and Fondue"}]}}, {"review": {"des": "Amazing Lamb Chops, Filet Mignon and the POPOVERS are to die for. Super delicious. Great venue and location, very friendly, super clean and very enjoyable spot to dine. I love they deliver to the Mariott Residence Inn.", "pics": null}}]}