{"name": "la-cocina-boricua-de-la-familia-galarza-chicago", "reviews": [{"review": {"des": "This authentic puerterican place located near the heart of chicago has to be one of my favprate places to go when I need a real taste of culture. When you first walk in, you can immediately get a feeling of the culture. The walls are overwhelmed with authentic decor and enjoyable art taste. This creates a homey feel, like you are in Puerto Rico.<br>    The food is slightly expensive, but totally worth it. You start up with a soup that has little bits of sausage, noodles, and an amazing broth. Then you can move on to a variety of options, a jibarito, pork chops, and much more. On one visit, I ordered the steak jibarito, to find out that the proportions were larger than expected. The steak jibarito comes with two medium sized sandwiches, which can come with tomato, lettuce, mayonnaise, and cheese. Mine came with a side of PR Rice (Puertican Rice), which I enjoyed as much as the sandwich. <br>     The service here can be pretty slow, depending on the day and the fact that it is a small shop. The service staff here was very nice. I will continue going here.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/81KSQdWE6iuin-lzhpucwA/348s.jpg", "caption": "Sauce on the side."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/gsGTS2yPsy41S1SCYX9FOQ/168s.jpg", "caption": "Good dish."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ENsyNKHgm4fpjV0FYeRkxA/168s.jpg", "caption": "Puerterican Rice."}]}}, {"review": {"des": "The food was amazing!! We had the bistec encebollado and the lechón platillo, which is not on the menu.  Each entree was delicious!  The arroz con gandules was fabulous!  Definitely try their salsa and chimichurri!!  The complementary chicken soup was a very nice touch.  Restaurant is also BYOB!!  <br><br>Cozy restaurant. Friendly service!! Great location in Logan Square!  Don't miss it!!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/sHD6SGoHvjZpj33hgbkHHA/348s.jpg", "caption": "Bistec encebollado, no flash, but just as delicious!!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/1r3LcQHRK--vjmBi9cyxQw/168s.jpg", "caption": "The bistec encebollado!! Yum yum yum!!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/jl4t-vRyqZBMCoqPe8U4SQ/168s.jpg", "caption": "The lechón platillo... stupendous!!"}]}}, {"review": {"des": "Very friendly staff/owner, very welcoming.<br>Small but clean.<br>Good appetizer/salad choices but would have preferred more entree choices on the menu.<br>The crispy plantain & garlic sauce appetizer was fantastic, the guacamole was delicious. <br>The chicken with grilled onions was very flavorful, the fried pork was ok, could have used a sauce, the beef stew was flavorful. <br>Portions were good.<br>Prices were fairly reasonable for the entrees, a little high for the appetizers. <br>Over all, we would go back.", "pics": null}}, {"review": {"des": "A wonderful family owned restaurant! The menu offers about ten items max, so it shouldn't take to you to decide what you want to eat. They are known for their jibaritos so that is what I decided to get. I'm glad I did... it was so good! Also, very inexpensive. All of the dishes come with a small chicken noodle soup on the side. I look forward to returning again.", "pics": null}}, {"review": {"des": "Yelped puertorican food with good reviews in the area and came to this place. On fullerton being a busy street i have passed this place a dozen times. Lets start off on how the place is decorated. Def love that island feel. We came on a Friday at 1:30 and place was seemingly full. The place had natural lighting which made it great! The waitress greeted us immediately and gave us menus. She was very welcoming and pleasant. While we waited for our food we received a complementary house soup and bread. Soup was delicious! We ordered as an appetizer an alcapuria, a papa rellena and a shrimp empanada. They came out within minutes and omg were they delicious! Everyone here had such great attitudes and great hospitality. Our food came<br>Out shortly we ordered jibarito of steak and carne guizada. AMAZING!!!! omg best i have had! Meat tender and juicy, everything so flavorful! And the people here are so great constantly checking to make sure you are ok! I will recommend this  establishment to anyone! By far 5 plus stars!!!", "pics": null}}, {"review": {"des": "We came here last night after the mass for my father in law.  Every year my wife and her family have a mass for their deceased father and mother.  Yesterday was 25 years since their father passed away.  Afterwards we go out to dinner with the family.  <br><br>La Cocina Boricua is located @ 2420 W Fullerton Ave just west of Western Ave.  I bookmarked La Cocina & had been looking forward to coming here based on the reviews of a couple of my Yelp friends & the fact that I love all things jibarito.  La Cocina is a smallish restaurant.<br><br>We had a group of 8 people and sat down and perused the menu even though I had already decided what I wanted before we were seated.  We all had our orders<br><br>     1). 1 steak jibarito w/Puerto Rican rice<br>     2). 2 pork jibaritos w/Puerto Rican rice<br>     3). 1 Chicken jibarito w/Puerto Rican rice<br>     4). 1 dinner w/steak & grilled onions w/PR rice<br>     5). 1 dinner w/chicken & grilled onions w/PRrice<br>     6). 1 Chicken in a bowl cooked in a sauce w/PR rice<br>     7). 3 beef empanadas w/PR rice<br><br>I made a deal with my niece and said if you order the steak I will order the pork so we can try both.  The steak was better than the pork as it was a little dry, but still tasty.  I added the green garlic cilantro sauce w/hot sauce on the jibarito.  This definitely made it taste better.  It was a good sandwich, but I still think Caribbean Corner in Downers Grove has a superior jibarito.<br><br>The owner brought 2 green bowls of a sauce that I thought was pesto as it was the same color.  She said it was cilantro, garlic, olive oil & spices (ahh ha secret spices).  This was very good I spread it on the soft bread and it was delicious.  <br><br>A little bug named Michelle kept telling that I needed to order the Cafe Con Leche (that it was better than anything Starbucks's had).  It was tasty, but a little too much cream as I prefer my coffee a little darker, but it was good (Thanks Michelle).  My niece also ordered a plate of Maduros (sweet plantains) which she shared w/the table<br><br>The servers were all friendly w/good service.  Just one tip they have a note on the menu that they charge a 15% gratuity for parties of 3 or more.  They added 20% on our bill so just keep an eye out so you aren't double tipping (unless you want to)", "pics": null}}, {"review": {"des": "The food here was incredible! I chose this restaurant during our trip to chicago because i love Puerto Rican food (plantains especially) and we dont have many options for this in Detroit. My boyfriend and I ordered the plantain chips which are served only on the weekends (guess we came on the right day!) and we also tried jabarito's for the first time which were amazing! Very authentic food and exceptional customer service. The owner was also so kind and friendly and made us feel welcome.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/HlDQKPU1Z_He-vwBMRvgbA/348s.jpg", "caption": "Plaintain chips with chimichurri sauce"}]}}, {"review": {"des": "Ok, from someone who has had the best Puerto Rican food living for 18 years in Miami, I can tell you this Puerto Rican Restaurant in Chicago is absolutely delicious. If you are looking for the type of flavor in food that every bite makes you say mmmhhhh you must eat here. <br>I highly recommend the carne guisada, the meat is super soft, and of course rice and beans and fried plantains. Also, the customer service is phenomenal and you feel as though you went to visit a relative and they are happy to see you! <br>Patty and Frank took care of us and the atmosphere is very cozy.  We will be returning again. Absolutely delicious Puerto Rican food!", "pics": null}}, {"review": {"des": "This is my Abuela's favorite place... and let me tell you, she makes the BEST Puerto Rican food in the whole entire world, so if she thinks La Cocina Boricua is good, IT'S GOOD. <br><br>Everyone is given complimentary soup and bread to start. We ordered everything from Alcapurria (fried balls of taro & green banana), Chicken Empanadas, and Platano Chips for appetizers, to Bistec Jibaratos and Pollo Guiso (chicken stew) for entrees. We even ended with flan! Everything was fantastic and the portions were HUGE!<br><br>The one downfall is it is a very small restaurant, so wait time can be a little high on weekends. Service is also very familial, and thus EXTREMELY slow, and they were actually out of a lot of ingredients / dishes on a Sunday afternoon. <br><br>Again, all of the critiques are small prices to pay for fantastic food, and I personally think it's worth trying!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/piiVjlUnpPfY1f3SHwBe1w/348s.jpg", "caption": "Flan"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Be3dnnAqjCJ8HBhGfIXocQ/168s.jpg", "caption": "1/2 Bistec Jibarito"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/hFRCmbnt10VlULb9rnmatA/168s.jpg", "caption": "Platano chips"}]}}, {"review": {"des": "This place is an absolute treasure. I have been sure to come here several times before but at my most recent visit the Host/Owner could not have been more welcoming, accommodating, and gracious.<br><br>The Jibarito here is beyond belief. I have never tasted plantains prepared/served in this way, with this degree of freshness and tenderness. But of course the meat, cheese, and garlic sauce is what makes these sandwiches one of my most favorite meals in the city. The arroz con gandules is amazing but don't sleep on the red beans and rice either. So tender, so flavorful. <br><br>All sandwich options are amazing and I am an asada guy but trust me the Casa Jibarito cannot be beaten. Gracias a la gente de Puerto Rico.", "pics": null}}, {"review": {"des": "Pretty good Puerto Rican food. <br><br>We came here on a Saturday night, and it is quite busy inside the little restaurant, with a lot of takeout orders on the counter. We were lucky to be seated right away.<br><br>When we got there, a lot of the appetizers and desserts are sold out. There were only empanada and maduros left (that's how popular this place is!).<br><br>The shrimp empanada is really good! With lots of shrimp in there and very flavorful too<br><br>The jibarito is really good and filling! Loved the steak one! It is not too oily. The Puerto Rican rice is also very flavourful especially when it's still hot.<br><br>The stewed pork is very tender and juicy. And the tamales thing is good.", "pics": null}}, {"review": {"des": "Such a quaint little family place. Really yummy jibaritos and it's a byob place. Meals typically come with chicken noodle soup. And their garlic sauce: oh my goodness. <br><br>On top of everything else, the staff is super friendly. This is a repeat place of ours; we love discovering these cute little gems in the city!", "pics": null}}, {"review": {"des": "We loved everything! BYOB!? Whaaat!! Best food and great staff! Definitely recommend the Jibaritos and the tostones.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/LDFBo_zpKLN8WNgKRlDCUA/348s.jpg", "caption": "They start you off with this delicious bread and soup"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/W2cKHwzQ9BLGJwAPz0E8NQ/168s.jpg", "caption": "Omg! Big portion! This is one Jibarito"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/LZp_rZde5JU3HhWmHMcDUQ/168s.jpg", "caption": "Papa rellena ! Amazing"}]}}, {"review": {"des": "Oh my gosh is the food here delicious! Not only is everything here to die for but the service is top notch. We came here with a group of 4 to eat dinner for a friend's birthday. The owner Patty came by our table numerous times to make sure we were okay and to ensure our birthday boy was having a great time. They even surprised him at the end with flan and a candle to blow out for his birthday. This place has been run by the same family for about 30 years. You can tell they love what they do by the care they take to cook their food and look after their patrons. You won't be disappointed!", "pics": null}}, {"review": {"des": "We live close by and this has been on our list for awhile. We came in between lunch and dinner. There were a lot of people there for this kind of in between time so you know this place is good. We were surprised to get soup and bread before our meal. The garlic oil that's on the table was phenomenal.  We love sweet plantains and got the maduros to start. They were hot and fresh, very good. $5 gets you a lot! <br><br>We both had jibaritos. I am happy I got the half sandwich because I was very full and the half sandwich is basically the size of a normal sandwich you'd get anywhere else. You could tell the meat and plantains were also fresh. We had steak and pork, both were very good!  We cannot wait to go back and try some more things!<br><br>Also, the front of the house were very kind and welcoming. We really enjoyed our time there.", "pics": null}}, {"review": {"des": "Delicious, quick, and affordable. The staff is so friendly and warm. The complimentary bread and soup at the start of the meal are declines. I go with a friend and get a steak jibarito, plantains, and chicken and shrimp empanadas to share. I will keep coming back.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ZD4qnOxsXpX1gxqQHOEpyA/348s.jpg", "caption": "Steak jibarito and sweet plantains"}]}}, {"review": {"des": "The food was delicious and affordable, my order came out relatively quickly, and the staff was really pleasant.  You can't ask for too much more.  <br><br>I ordered a chicken empanada, a steak empanada, and a steak jibarito with Puerto Rican rice: that was my lunch and dinner and I spent under $20.  I enjoyed both empanadas, with maybe a slight preference for the chicken.  I went with the server's suggestion of the steak jibarito, and she did not steer me wrong.  I ended up eating the jibarito about 4 hours later and loved it.  I think Papa Cache's still has my favorite jibarito, but the overall experience is better here.  Go!!!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/KEVsjGquADcpquqZ42zzmQ/168s.jpg", "caption": "Steak jibarito with rice"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/2arKzWAcS-9M4nSwwqmdTg/168s.jpg", "caption": "Beef and chicken empanadas"}]}}, {"review": {"des": "I absolutely love this place! My friend has his mom cook authentic Puerto Rican food all the time, and he said it's as close to his mom's cooking as he gets. The place is surprisingly spacious and you get seated right away. The staff is absolutely amazing! The owner is so kind and everyone who works there is extremely attentive and helpful. I couldn't choose a dish so the waiter helped me out, and was super nice and familial about it. <br><br>On to the food, the soup was great and you get bread to start off your meal. The steak jibarrito I got was huge and a total highlight for me though! There was so much steak inside the plantains and the plantain was thick as well. It came with rice which I couldn't even finish because the sandwich was so filling. The best part was their garlic sauce though. So good. We even asked for some to go. The prices are super reasonable. Definitely coming back here.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/DsTOcOMTHKoETTQmDLCgTQ/348s.jpg", "caption": "Jibarrito with Spanish rice"}]}}, {"review": {"des": "I was looking for a PR place last week and my usual spot was closing at 8pm...after googling and reading reviews I came across this place. <br><br>Decor is cute with a homey feeling and the fact that it's BYOB was a major plus!! I was just ordering for myself so I got takeout. <br><br>I ordered the steak jibaro, it comes w rice and I chose arroz con gandules. I also ordered an order of maduros because I always do....they're my fave!! JIBARO- the steak was soft/ tender but didn't have any/much flavor. I was not sure what cheese they used as I've always had cheddar/American but this one was white. It was good. I ordered it with everything ( lettuce, onion, tomatoes, cheese). I'm also used to having jibaros with garlic on top but this place gave me a little container of what appeared to be sofrito with garlic. Could be wrong that it was sofrito as it's was green. That def made the jibaro spark with lavor! The arros was not as yellow/orange as most so I questioned it's flavor, however it definitely had flavor! Yummmm!!!  Lastly, the maduros....I wish they were better but will certainly try them again in case this was a fluke.  There were some that were not cooked all the way through and not all were sweet. I've had better but like I said, I'm game to try again.  <br><br>PRICE- I thought it was a bit more pricey than most places I've been to. I paid almost $20 which I normally pay that for two orders ( for my daughter and I). However when I got home I noticed the portions were large. The jibaro was more like two of them. Yes, I'm aware they're usually cut in half but this was like two whole ones....not complaining one. Bit. I ate the second half for lunch the next day . My order also came with soup ( which sadly I didn't even make it) and some slices of bread w butter. <br><br>Overall good joint, large portions and BYOB. I hope my next visit to this place is eating there.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Me9odOQyBrM-G83sXzdw-A/348s.jpg", "caption": "Maduros"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/GDO9k_WyJ3nZB3ThEKrmpA/168s.jpg", "caption": "The garlic sauce to spread on top of jibaro"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/4vHp3avFd8zVLSSY8ICX_Q/168s.jpg", "caption": "Steak jibaro w arros con gandules"}]}}, {"review": {"des": "Finally had the chance to try the place that supposedly serves \"the best jibarritos in town.\" My overall experience was no less than perfect. <br><br>Their hours stated they opened at noon so I arrived a quarter after noon. As soon as I walked in I knew I was in for some good food. It was a gloomy Wednesday afternoon and the restaurant was almost full house. We were greeted and seated immediately by an energetic waiter who I assume was the owner of the restaurant. <br><br>The food - Delicious. I started off with an order of their Canoa which is sweet plantain filled with beef, great starter. My main order consisted of a steak jibarrito and steak cubano. The jibarrito was definitely the highlight of the meal. Plantain was crispy and steak was full of flavor. The cubano on the other hand was just meh, nothing spectacular. All orders come with puerto rican rice and soup. <br><br>The price - Very affordable and big portions. An order of appetizer ranges from $3-$6 and entrees range from $8-$12. <br><br>The service - Great service, our server was always attentive and checked up on us just enough. She was also very friendly and seemed to know everyone in the restaurant. <br><br>Decor & ambiance - Plenty of seating, pictures and decorations everywhere for visual appeal. The atmosphere was very family like, our waiter seemed to know everyone and lots of regulars were dining in the restaurant. <br><br>Overall - Great establishment, great service, delicious food. I will be back again very soon.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/jwyALfeb7ogItOLwv19-Lw/168s.jpg", "caption": "Canoa appetizer. Sweet plantain with beef."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ZTXn8vvkLmfXMBjiH_bQiA/168s.jpg", "caption": "Steak jibarrito and steak cubano. All orders come with a side of Puerto Rican rice."}]}}, {"review": {"des": "Loved everything about this restaurant place!!!  Service was wonderful... They make you feel at home. <br>The steak jibarito was the best I've ever had! It really is Chicago's Best! <br>Shout out to Patty! Great service", "pics": null}}, {"review": {"des": "Small Puerto Rican family run restaurant. They give complimentary fresh bread and soup, which was very good.  My wife had an appetizer with sweet plantain,  cheese and ground beef, which she found delicious.  My alcapurria was fresh, not sitting under a light like some places. My carne guisada wasn't bad, but could have used a little more salt for my taste.  My wife and sister enjoyed their Jibaritos.  The two best things were the wonderful service and the absolutely delicious mojo garlic sauce! This place is one of the better PR restaurants in Chicago.", "pics": null}}, {"review": {"des": "Love this place for authentic Puerto Rican food. Always coming for the jibarito sandwich and tostones. Amazing garlic sauce.. yum. Occasionally I try other things on the menu all good as well. Manager there is a cool and sweet respectable lady and treats people like friends and family . It's actually very addicting coming here .<br><br>It gets a little crowded sometimes as the place is a little smaller than usual resteraunts.", "pics": null}}, {"review": {"des": "Had the mofongo dinner and jibArito de lechon. <br><br>This place was the most delicious ever , everything is fried fresh , top quality meats . <br>The food was not greasy or did it have the after taste !! I was amazed and blown out !", "pics": null}}, {"review": {"des": "I only been here a few times, maybe about 4 times and each time I get presented with something new that they are out of. The first time there, they were out of Flan and I still came back because of the food. I have to admit the food is good and the portions are generous, but  all that comes at the risk of being told that they are out of something. This was the case this past weekend when I went with my family and a close friend of ours. <br><br>It was his first time experiencing Puerrto Rican food outside of our home and I was embarrassed when we asked for a pork chop dinner and we were told that they were out of pork chops. We settled for something else on the menu since we had our daughter with us and she was hungry. As dinner went on, I would admit that the food was good, but wouldn't you believe it, we asked about dessert and they were all out. It was only 8 PM. How do you run out at 8 PM on a Saturday? Makes no sense to be honest. We finished up and took off to Margie's Candies. <br><br>Cocina Boricua is a nice place, but only good when you show up early enough to get what's on the menu. Anything after 8 PM is a crap shoot and you better off asking before your seated as to what they do or do not have left on the menu for the night.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/NoR_mIfSFeL8BX0Fx1iKmA/348s.jpg", "caption": "Tostones.... Mmmmmm"}]}}, {"review": {"des": "First time having dinner here. Everyone was super nice they came to our table many times to check on our table. The food was great and the staff was amazing!!! Really enjoyed the atmosphere and the food. Will defiantly come to eat some food here again.", "pics": null}}, {"review": {"des": "I have been eating here since back when half of their current customers were still afraid of the neighborhood (for more than ten years). I even used to have a gathering there every couple of years because everyone loved the place. Then last spring* I tried to reserve a table/the terrace for 15 people and for the first time ever, they refused to take a reservation. <br>This was never a problem before, but now they have gotten too big for their britches and apparently don't need their old customers anymore. <br><br>This place has tasty food but there are other similar delicious and inexpensive restaurants in the neighborhood. I am afraid they won't be getting my business anymore. Their food is still 4 stars but the way they treated us left a bad taste in my mouth. <br><br>In a nutshell: Delicious and inexpensive food made by people who don't care about their old loyal customers anymore.<br><br>*This happened last May. Normally, I would normally be having another gathering there now and that just reminded me of this bad experience, hence the late review.", "pics": null}}, {"review": {"des": "OMG! ! ! ! Yass yass yasssss!!! Give this spot a try, we had Carne Guisada- to die for. Jibarito de Lechón- \"Best in Chicago\". Mofongo con Carne Frita- Scrumptious! Yuca al Mojo- Wow! Tembleque and Flan- Mama mía! Service is great, elevated your dining experience overall. The owner, Patty is super attentive and has a beautiful personality. Her staff makes you feel welcomed and are also super nice. <br>#authentic #delicious #musttry", "pics": null}}, {"review": {"des": "Great PR food!! The Jibarito's sandwich is the BOMB, of course put some of the garlic sauce on that thing..", "pics": null}}, {"review": {"des": "This is my first time and I would come back again. The food is very good. And the service was great.  The my water glass never got empty that's how good the service was.", "pics": null}}, {"review": {"des": "We came a few minutes before closing. After a long afternoon touring the beautiful city of Chicago, this restaurant was the highlight of our trip!! The food was truly authentic Puerto Rican cuisine !!!! The taste was just like eating food in Puerto Rico's mountains ... The food was so fresh , and Patty the owner was very friendly, professional and accommodating. She made sure we were comfortable and served well !!! The service was amazing and the facilities were extremely clean.. <br><br>Thank You Patty for taking us back to the island with your authentic food..<br><br>Sincerely, <br>Herminio and the NY Ricans...", "pics": null}}, {"review": {"des": "Delicious Puerto Rican food at a good cost. Sit down meals come with their house soup which is really good. Alcapurrias have a crunchy outward shell and are rectangular shaped (at first I thought they brought us a strange looking pastel by accident). Nevertheless, the alcapurrias tasted pretty good. <br><br>The arroz con gandules here are AMAZING! I love the arroz con gandules that I make and these put me to shame. Mofongo has a soft doughy texture and tastes great with the garlic sauce. <br><br>Next time we come I will be sure to try their flan.", "pics": null}}, {"review": {"des": "Where do I start? Delicious food, reasonable prices and EXCELLENT service. I went yesterday for the first time and it was amazing. Restaurant looked clean, food came quickly and the waitresses were very attentive! Do yourself a favor and go, you won't regret it.", "pics": null}}, {"review": {"des": "Simply thee best Puerto Rican food in Chicago.  Small place, however, every dish packed with flavor and HUGE portions!<br><br>BTW, it's a BYOB place with a liquor store conveniently located next door!  It's a win-win situation!!", "pics": null}}, {"review": {"des": "Must say the food here was delicious! The service was phenomenal!!! I came here with 4 friends to eat lunch on a Sunday afternoon. The owner Patty came to introduce herself to our table and kept passing by our table numerous times asking if we needed anything else. She was VERY sweet and always with a smile on her face! Also did I mention the restaurant has \"BYOB\" which is a great perk! They provided a complimentary soup with bread! Best place ever!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/6R35bLLx6jPA-xmV4ZLbWw/168s.jpg", "caption": "Flan and Tembleque !!!!"}]}}, {"review": {"des": "Fantastic service by the family who owns this place. The food is always fresh and delicious- you can really taste the love and care they put into their food. If I didn't live so far, I'd come here pretty often, but I'll be back soon!", "pics": null}}, {"review": {"des": "I make the best jibaritos known to man but this is a good runner up. They could work on their lechon...it's a little dry and I'd like them to offer some cuerito on the side. The Morcialla ( blood sausage) is the shit. The platano is cooked to perfection though. Won't be returning because I make all this food at home better, but If youre unfamiliar with Puerto Rican cuisine this is a great<br>Restaurant to try.", "pics": null}}, {"review": {"des": "New go to place for Puerto Rican comfort food. I had the Carne Guisado and my bf had the Bistec Encebellado with a side of their garlic sauce (mojo sauce) .... both were yummy and flavorful. I also had something I used to have as a kid in a Chinese restaurant... pina colada .... mmmmm... Service was good, especially the greeter/waiter who brought over the drinks and food . The lady who took our order was decent.  Environment was homey and inviting. We went there around 12 something in the afternoon and was plenty of parking in front. Only got a little packed after we ordered our food. Also, we were served with a complimentary and yummy /flavorful soup along with some bread & butter... that made me happy . We would definitely come back!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/SdribAPJlekgh58Z9-ALZw/348s.jpg", "caption": "Bistec Encebollado"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/9Bn7Wi8ZX-uaQu-qa1nsDQ/168s.jpg", "caption": "My Carne Guisado.... yum o!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/a1R3L34Y_C3lApwWsa327g/168s.jpg", "caption": "Madurros (fried plantains)"}]}}, {"review": {"des": "Best jibaritos in Chicago! I honestly cannot think of 1 thing that would make this delicious crispy sandwich any better! I love the pork jibarito with everything (lettuce, mayo, tomato, cheese) and it's a big size portion as well. Comes with Puerto Rican rice or white rice and beans. They bring you a nice unexpected surprise of chicken noodle soup to start with some bread and their garlic chimicurri sauce...there are no words to describe that garlic sauce. I considered just dumping it in the chicken noodle soup at one point! Highly recommend this place!", "pics": null}}, {"review": {"des": "Customer service was great.  Jibarito was missing the most important thing, garlic!!!  A jibarito is not a jibarito without the garlic.  They had a green puree as a substitute however it didn't cut the mustard.  I give them props for staying open later than most Puerto Rican Restaurants that I know.", "pics": null}}, {"review": {"des": "My mom and I sent into the city and had a craving for some authentic Puerto Rican food and this place was perfect. The food was delicious and had great flavor. The portions were huge and the environment was great. They staff was very attentive and took great care of us. Definitely going back!", "pics": null}}, {"review": {"des": "I came here with a friend because he's been meaning to try it out for some time now and it was literally the highlight of my day.<br><br>As soon as I walked in, I already knew that my stomach was going to be happy. We were greeted and sat as soon as we walked in. The atmosphere of the restaurant felt so comfortable - like home. Our waitress (assuming she was the owner) was attentive and took care of us as if we were family. <br><br>After we ordered, we were brought out soup. The soup was really tasty. We ordered the Canoa as an appetizer, which is a sweet plantain with ground beef. The plantains were the perfect amount of sweetness for me and it was an amazing way to start off our dining experience. For our meal, we ordered the steak jibarrito and the steak cubano. The steak cubano was decent, but the steak jibarrito was AMAZING. I loved the crunchiness of the plantain and the flavors of the steak combined was just wonderful. The sandwiches came with a side of Puerto Rican rice - also amazing. <br><br>My overall experience here was great. I loved the family feel of the restaurant, it made me feel really warm and happy. The food was just the cherry on the top. Everything was amazing and I cannot wait to go back soon! I loved it!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/-N181tXRid2C__Iqeqvh4A/348s.jpg", "caption": "Steak Jibarrito and Steak Cubano with PR rice."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/H6bDQGT6p0uURBkeNLWL7g/168s.jpg", "caption": "Canoa."}]}}, {"review": {"des": "Ever since going vegan, I've been searching for a jibarito fix and this place surpasses my expectations! So delicious with excellent service to match.", "pics": null}}, {"review": {"des": "<a href=\"/redir?url=http%3A%2F%2Fbomb.com&s=bb4f996415a9c2f21137e27cfb68f439a48cec2652b53e9b50dd7e766dbe177e\" target=\"_blank\" rel=\"nofollow\">bomb.com</a>!!!<br>empty plate, full stomach, beautiful <br>got the jibarito and maracuya (passion fruit) drink<br>staff was very friendly and welcoming :)<br>def reccommend", "pics": null}}, {"review": {"des": "This place was recommended for my mother's birthday dinner by my brother. It is a small restaurant with a very warm and friendly feel as soon as you walk in. Patty's hospitality was the best that we have seen in a very long time at any restaurant. The place is BYOB and there is a liquor store next door so it was super convenient. The appetizers, free soup given, and main meals were all delicious. There wasn't anything on the menu that we tasted that disappointed. My family will definitely be back for more very soon! <br><br>If you're looking for great Puerto Rican food and good ambiance, this is your place!", "pics": null}}, {"review": {"des": "Wow!  What can I say. My girl is Puerto Rican and she approves. I was in mofongo heaven. Alcapurria ; tostones ; arroz con gandules was very good. Definitely will return. Thank you to the two ladies who served us. Made us feel very welcomed.  Nice touch", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/RrwFPRE6dpNh4q2Xt9ETZA/348s.jpg", "caption": "Mofongo con carne frita."}]}}, {"review": {"des": "Excellent spot! I never had Puerto Rican food before, but found myself here while in the area and eager to try something new. The great reviews are very much warranted.<br><br>The staff is so incredibly welcoming and friendly that that alone would bring me back. The steak jibarito was delicious and incredibly filling. The portions are pretty large so I had to take half of it home. Amazing cuisine for a great price!", "pics": null}}, {"review": {"des": "Sazón! This place has unbelievably authentic food. This is a small family owned place and the care shows. Jibarito de bistec, arroz con gandules and flan .", "pics": null}}, {"review": {"des": "I can't say enough good things about this place. I've been here on several occasions and can always count on great service and even better food. I have had the chicken jibarito which is actually more like two small jibaritos (great for splitting or taking leftovers), the pasteles which are perfectly salted (this is rare), the relleno the papa and the vegetarian jibarito. I recommend them all and am sure that everything on the menu is delicious. Each entree comes with soup and bread with butter which is a HUGE plus and the service is prompt and attentive. There's also a really great familial atmosphere that isn't present in a lot of restaurants. Definitely recommend.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/DEc-2uGvtZWNWCffi66v1w/348s.jpg", "caption": "Close up of the chicken jibarito (get it)!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/LnKngOZn-2YzlO3oCoAHTw/168s.jpg", "caption": "Chicken jibarito with arroz con gandules and bread in the background!! So good"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/-e0-rMBGhd6SL6BV1CQjSw/168s.jpg", "caption": "Chicken jibarito with arroz con gandules"}]}}, {"review": {"des": "Super fantastic food here!  We went to Irazu first only to find out the wait was too long so we drove here and it was such a much better vibe.  We ordered the guac and chips and empanadas and rellanos de papas -- all yummy.  I had the mofongo con carne, my hubby had the pollo guisado. I don't remember what our friends had but we all loved what we ordered. The garlic sauce was one of the best parts too. This place is BYOB too so we enjoyed our beers (guys) and rose wine spritz (gals).  Hope you enjoy this place as much as we did.", "pics": null}}, {"review": {"des": "This is the place to go to!!!! Authentic Puerto Rican food and the service was perfect. Enjoyed everything!", "pics": null}}, {"review": {"des": "This place is delicious! Servings are huge and I ate my entire plate plus soup and the drank the passion fruit in one sitting!", "pics": null}}, {"review": {"des": "The jibaritos are the best!!!! The soup is delicious too and comes free with every meal.", "pics": null}}, {"review": {"des": "I have spent the last few days visiting Chicago and was craving authentic Puerto rican food and was not disappointed. The carne frita was one of the best I have ever had! The whole meal was simply amazing. The ambience is really dope and the staff goes above and beyond and are super friendly. I will definitely be coming here everytime I visit Chicago. Now that's how you make Puerto rican comida!", "pics": null}}, {"review": {"des": "Its 7:30 PM tried to sit down to eat at a restaurant full of people and Im told they are closing early get lost. Thanks!", "pics": null}}, {"review": {"des": "Delicious and authentic food.  Best known for their Jabrito sandwich (tostones used instead of bread), the mojito dipping sauce was very delicious. Restaurant is small and decorated with PR history and photos", "pics": null}}, {"review": {"des": "Stumbled upon this place while in the city, and it was nothing short of amazing. Authentic, delicious, fairly priced, and such great service!", "pics": null}}, {"review": {"des": "This place is awesome and one of my favorites for the jibarito plate. My partner and I often get these for lunch and you get sooooo much food for like $12. The best thing for me is the garlic sauce that they make. I ask for extra every time because it's that good that I want to drown everything in it.", "pics": null}}, {"review": {"des": "This restaurant is my top 3 for PR food. It's very homey, casual and no fuss. I like that I get a good amount of food to satisfy my craving as well as it not being salty as hell. I've brought most of my friends from out of town here and all left full and satisfied. I didn't know it was BYOB for a long time lmao. So my next trip I'll bring some rum and sprite or something and maybe toast with the lovely lady hostess there (who's probably the owner).", "pics": null}}, {"review": {"des": "I have to say that the place has changed. Once upon a time it was an establishment that seemed to of been taken very seriously, but for some reason it has downgraded with not only service, but more importantly food. I am not a fan of food that is reheated and sits at the counter for more than ten minutes before coming to the table, especially when there are only about 5 patrons in the whole restaurant. <br><br>I was once a regular here but know for a fact that since owners have changed, the downgrade is evident. What ever happened to down home cooking and just plain and simple howdy you do when you come into an establishment. I just think that the aura of the place has changed. Mind you, the food at best was mediocre compared to what it use to be. Did they change chefs and/or since the other people working here are no longer here, did it just completely change altogether? I would hope that it would stay the same but alas, it is most indubitably different. (Insert sad face here) <br><br>Chicago has always been welcoming to the Latin cuisine and for that I am happy due to my culture always being represented with food and seasonings, but this time around I can't say it is so. The change is evident and the food has suffered tremendously. I shutter to the fact that although it was not crowded, it took forever to even get a glass of water (and did I mention the glass of water had pink lipstick stains, heck I don't use that shade of pink). <br><br>I think that was definitely the last time I come here due to the fact that there are way more Latin inspired restaurants to try instead of coming to a place that has since lost its fizzle. Oz has spoken and well, good luck.", "pics": null}}, {"review": {"des": "Hands down The Best authentic PR food in Chicago.  It's a precious jewel.  My favorite dish is called La Isla. I wish I could give them 10    Very cosy location.  BYOB", "pics": null}}, {"review": {"des": "Came here with the boyfriend and two friends who had a budget of $35 for their meal. Happy to report not only did we come well under budget but full and happy!!<br>I had the pork mofongo with Puerto Rican rice (yellow rice with veggies). The pork was tender and lightly fried and came with a buttery garlic sauce. The mofongo tasted as good as any in Puerto Rico. The bf had a chicken jibarito (which is a sandwich made from plantain) with a side of rice and a beef empanada. Our friends had half a jibarito and the chuletas. The jibaritos came with a fantastic garlic sauce that set off the already fantasy flavors. Our food came quickly and our waitress was sweet, she even helped give us tips during our Heads Up game!<br>They're BYOB so we made ourselves some rum and cokes to go along with our delicious meal. And for $55 for our group of 4, this family owned spot is the place to be!", "pics": null}}, {"review": {"des": "Just perfect!! Everything I've had is just great. Arroz is the best! Carne guisada and lechon is delicious.", "pics": null}}, {"review": {"des": "I don't know at lot about Puerto Rican food, but I know what's good to me. I just returned from the Island and I had some delicious mofongo. I wanted more, so I did a search and found this place. The mofongo was good, but the steak jibarito sandwich was very tasty. I will definitely return.", "pics": null}}, {"review": {"des": "Great hidden gem on Fullerton. Enjoy a jibarito - sandwiches made with fried plaintains instead of bread - and the fast and friendly service. Casual and down to earth. Love coming here every time I drop the dogs off for grooming at Salon Dog.", "pics": null}}, {"review": {"des": "Food was amazing for the price and the service was great!!!  Patty was awesome and had great recommendations.", "pics": null}}, {"review": {"des": "Small Puerto Rican restaurant with delicious food, reasonable pricing, & good service.", "pics": null}}, {"review": {"des": "If you want to be taken care of like you're one of the family, this is the place. Multiple employees were constantly filling waters and checking to make sure that our delicious and totally authentic Puerto Rican food was satisfactory. <br><br>...And it was- beef and chicken empanadas were melty and savory on the inside with a crispy outer shell. Then we got slow roasted pork with rice, both tasted familiar and yet very new. Chips were above average and the guacamole was too. Salsa was hot, just the way it should be.<br><br>Great food, better service, authentic recipes and ambiance. Will recommend and will return.", "pics": null}}, {"review": {"des": "The owner Patty waited on us and treated us like we were friends. Explained some menu options to us. We had  Plantains with the special garlic sauce on the side and it was delicious. Our meals were very good too.<br>Amazing fast service, loved every second.<br>I'll be coming back for sure", "pics": null}}, {"review": {"des": "Hands down the best Jibarito in Chicago. Portion size is a lot but I love it because I can always take it home for the next day! I've tried their: yuca, tostones, platanos maduros, arroz con condulez, pasteles, papa relleno, they're coffee (which is better than anything Starbucks has to offer), and it's all phenom! When I'm in need of homemade comfort food, this is the spot I go to!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/KT37KwKIGf4qy2Pk5qtneQ/348s.jpg", "caption": "The best Jibarito in Chicago!"}]}}, {"review": {"des": "Muy Sabroso! La Cocina Boricua de la Familia Galarza is one of the most legit Puerto Rican restaurants around. As many have said, it is family-owned and, as a result, is very homestyle, cozy, and comforting. <br><br>Stopped by here the other day with my S.O. As soon as we arrive, there is a full table of 10 unvested, on-duty Chicago PD detectives and police officers. All of them packing heat and staring intensely at us. If that ain't true Chicago-style, I don't know what is. You know the food is good when all the cops roll up to eat at the joint.<br><br>And NO DUH... The food is good here, dummy. Their jibaritos -- a Puerto Rican x Chicago sandwich made of two pieces of flattened, fried green plaintains as the bread with some type of meat filling, sliced tomatoes, mayonnaise, melted white American cheese, and lettuce -- is seriously so darn juicy and honestly almost flawless. Not too greasy, not too salty, not too anything. The arroz con gandules (aka P.R. Rice), that comes with it, is a perfect blend of rice, sofrito, tomato sauce, Sazon, and pigeon peas. If I can get real for a second, I will say that I like it even better than the one at the original source, Borinquen Restaurant (now El Nuevo Borinquen) on California ave. <br><br>We also shared one alcapurria and one pastel as an appetizer. Both of them had a nice, well-seasoned, not-too-dry chicken filling. I've never had an alcapurria before, but theirs was pretty good. It was like a large, green plaintain-based croquetta. And the pastel? Damn... I love me some pasteles. Theirs was flavored with the banana leaves they wrapped it in, and the mashed green plaintains that made up the masa base was soooo mouth-melting soft. I often wish that pasteles would be available at other times other than Christmas. But if you come here, you don't gotta wait. You can have it year-round, baby!<br><br>Note: The only bummer was that they seemed to have taken the mofongo off their menu. C'mon! Where is my mofongo? Bring that back!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/VCCM7MVen3j3JCs-5fwNHg/348s.jpg", "caption": "One serving of a steak jibarito"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/chjUt15K4le6K3RE1E9gmA/168s.jpg", "caption": "Close-up of a steak jibarito"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/4f1Gqwrn5gD43o0dXaAVcg/168s.jpg", "caption": "Puerto Rican tamale and alcapurria"}]}}, {"review": {"des": "Came here on Sunday afternoon looking for some authentic PR food. Did not disappoint!! <br><br>Food was amazing and authentic. Service was also amazing. The servers were very nice and attentive. <br><br>Had to take some food back to Ohio!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/7jtCUpwyVbHimCjLNCMfXg/348s.jpg", "caption": "Steak encebollado with PR rice"}]}}, {"review": {"des": "The food was awesome!!! I felt like i was back home in Miami.   The music the food the atmosphere was worth the hour drive.", "pics": null}}, {"review": {"des": "I really need to come back to this place! Although not a recent review, but the food is so good, it makes me wish I can go back. Very affordable, tasty eats. And I also remember soup with every meal. Definitely another place I hit up fpr jibaritos", "pics": null}}, {"review": {"des": "Visited from Kansas City, I found this place on Yelp. I was not disappointed. I loved the food and the service was fantastic. From the tostones, jibarito, to the mofongo....the food was to die for. I only wish they were a place like this in Kansas City. I will definitely come back when I visit Chicago.", "pics": null}}, {"review": {"des": "Food was delicious! Defiantly what I expected! Fresh and fast! The place is small, but nice atmosphere. Salsa not to spicy, empanadas were okay, need some more seasoning, bistec sandwich & pr rice DELICIOUS! Will add to go to for dinner.", "pics": null}}, {"review": {"des": "The chicken jibarito with PR rice was great. Cozy, affordable, good quality Puerto Rican food.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/OfwzuWVb6xchzXYs4uaqTg/348s.jpg", "caption": "Jibarito"}]}}, {"review": {"des": "Delicious and really great service! Love coming to La Cocina! We had steak jibaritos and a steak and shrimp empanada. So good!", "pics": null}}, {"review": {"des": "Whenever a business advertises their hours but proceeds to close its doors 30 minutes early, well it's just frustrating.  When their excuse is they ran out of food and shut down their kitchen, then that's seriously bad business and warrants a bad review.  Business is business, especially when you as a Puerto Rican customer visits a city for the first time and makes it a point to visit and support a Puerto Rican restaurant! Don't say 8:30pm if you mean 8pm, please! You guys ruined my night.", "pics": null}}, {"review": {"des": "DELICIOUS - 100% authentic Boriqua food. I felt like I was in an old school PR kitchen! I'll be back and La Cocina has a new customer.", "pics": null}}, {"review": {"des": "Great place! Stumbled upon via yelpers. I was greeted right away with one foot in the door. Friday night 8pm no problem getting a seat but soon after it was jammed packed.  Our waitress was amazing she was very very hospitable.  We tried alcapurria(great), rellene de paps(good), pastel(great), jibarrito(lechon) w/everything (garlic always comes on the side(big plus) (AMAZING JIBARRITO) and bistec encebollado(AMAZING). Arroz con gandules tasted great not dry and not too moist.  White rice and beans also very accommodating.  The waitress checked on us periodically. It is a small restaurant so not much room and they can be alerted asap.  I will definitely be a returning customer.", "pics": null}}, {"review": {"des": "Came here around 8pm on a Saturday.<br><br>I'm Asian but used to date a Puerto Rican with a family back in Puerto Rico that always made us <a href=\"/redir?url=http%3A%2F%2Fbomb.com&s=bb4f996415a9c2f21137e27cfb68f439a48cec2652b53e9b50dd7e766dbe177e\" target=\"_blank\" rel=\"nofollow\">bomb.com</a> food.<br><br>I've never ever seen such an authentic puertorican menu in Chicago, let alone taste such goodness.. oh my yummmmmm. SO GOOD. <br><br>Amazing service, loved every second.<br><br>Just four stars cause they didn't have pasteles, or any of the three desserts left :( <br><br>I'll be coming back for those 1000%", "pics": null}}, {"review": {"des": "What a great surprise. First time coming to this place and we were very pleasant surprised. The food was very tasty and came out fast. No wait, good food and reasonable prices. We are coming back for sure. Glad we tried this place out .", "pics": null}}, {"review": {"des": "I love the food here, and love that it's a family owned place! I got the pork jibarito, and was NOT expecting it to be as big as it was - two sandwiches are in the full portion, so if you're not that hungry, try the half portion.<br><br>We ordered:<br>-lechon plate: My partner was a HUGE fan of this - it's a pile of tasty roast pork, with rice and tostones. What's not to love?<br>- pork jibarito: As I already mentioned, it was a LOT of food! Very tasty, though. I'll get the half portion next time. I also enjoyed the rice and pigeon peas.<br>- alcapurria - really tasty fritter patty, and at the price, easily a quick and cheap meal on its own.<br>- tostones - Obviously delicious and crisp, but we shouldn't have ordered it, given our main dishes. I love the mojo that came with it.<br><br>Next time I really want to get the guachitos! Tostones, guac and sausage? Yes, please.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/bjsteEr9QJtfkf7HMjf2jQ/168s.jpg", "caption": "Lechon plate"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/VF8bPjZEmnC35VfXTwa1Ug/168s.jpg", "caption": "pork jibarito with PR rice"}]}}, {"review": {"des": "Delicious Puerto Rican food! Service is friendly and fast. You can sit wherever you want when you enter, and they immediately bring out water, and complimentary bread and soup. The bread is nothing special but the soup is delicious and will definitely whet your appetite. <br><br>I highly recommend the pork jibarito. You get two small ones, which is perfect for sharing. They do not skimp on the meat and I actually had so much that it was falling out of my sandwich!<br><br>For the steak with sauce, the steak was cooked very well and was tender. The sauce was amazing and the onions and red peppers almost melted in my mouth. The rice and beans were okay.<br><br>Easy street parking (pay to park) and plenty of seating inside! Plus, it is BYOB.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/LgQxFU1K7a9XaPLe5MCYbA/348s.jpg", "caption": "Pork jibarito ($8)"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Prd7X5XPyrZlha5A8L5-8Q/168s.jpg", "caption": "Steak and sauce ($12)"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/PhtupIzx41kQBOPyRxF9fA/168s.jpg", "caption": "Complimentary soup and bread"}]}}, {"review": {"des": "Used Yelp to find a good Puerto Rican restaurant other than the few in the area I've been to, and found this place! The owner is amazing! She is super welcoming and bubbly. The environment is homey and honestly tasted like a home made meal. You can definitely tell the difference between their meat and style of cooking, as oppose to the near by restaurants.<br>My fiancé and I ordered 4 different appetizers and two Jibaritos and coconut custard for dessert. They were all delicious! This is my new spot and excited to return for more!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/hJJKUc2aGvk1yeK96CgCDg/348s.jpg", "caption": "Full Jibaritos and tostones."}]}}, {"review": {"des": "This has to be one of the better caterers we've worked with.  The food is amazing. Authentic Puerto Rican food full of flavor.  Their delivery is punctual and reliable.  Customer care is excellent.  Patty always takes care of all our office events.", "pics": null}}, {"review": {"des": "I just read an article yesterday morning on the worst kind of people when it comes to eating.  Apparently being the person who always wants to share, even when the other party isn't planning on it, is frowned upon.  I wouldn't know.  I pretty much always get my way.<br><br>Anyhow, that article made me think of all the wonderful dishes I would have missed out on if I didn't always SUGGEST sharing.  I mean, I would never flat out say \"you get that and I'll get this and we can share\".  Alright, I would, because that's typically how it goes down, but it almost always pays off.<br><br>I tried half a steak jibarito and half of the lechon and both were exactly as I'd hoped.  I don't like to give Mark G credit for pretty much anything, but his review where he describes the cheese as a chihuahua/mozzarella type is spot on.  It's creamy and thickish, yet melts wonderfully, and I have no clue what it actually is.  While jibaritos are one of my favorite foods, the American cheese they put on it typically makes me gag.  Way to switch it up La Cocina!  Way to switch it up.<br><br>Even though it wasn't my special day, I ordered like it was.  That means when I heard \"I want guachitos, you'll like them,\" my mind was thinking \"blahblahblah, papa rellena\".  Look, you either need to come here starving, or come here looking for two meals from one.  The portions are pretty big, especially when you consider the prices.  Additionally, they give you chicken soup and bread.  Before the jibaritos even came out, I was basically full and ready to go home and put on sweatpants.  I didn't though.  We still had beer to drink and it would be a travesty to have two types of jibaritos placed in front of you and not try them fresh from the kitchen.  Both meats were very tender and very flavorful.  The nice thing about La Cocina is that instead of making one giant jibarito and cutting it in half, they make two smaller (and I use that word loosely) ones.  <br><br>The only thing I wasn't crazy about was their arroz con gandules.  I might be spoiled from growing up with a Puerto Rican best friend whose grandma makes the best rice I've ever had, but theirs had a weird taste I couldn't put my finger on.  It wasn't bad, it was just too noticeably different for my liking.<br><br>La Cocina is definitely one of my top spots for jibaritos, and the fact that it's byob is pretty sweet too.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/9EDEeRgpx7FfKj4c9-8K4A/348s.jpg", "caption": "Look at the cheese!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/5m-WCdnQ-7iiVEmJhkZ0zw/168s.jpg", "caption": "Steak jibarito & lechon jibarito"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/YmNkzaoNmSffScFk1ChA5A/168s.jpg", "caption": "Papa rellena"}]}}, {"review": {"des": "This place is outstanding, great service great food.  And there not lying when they advertise best jibarito, they really do have the best Jibarito!!! Place is nice and very clean I recommend it to anyone in the area.", "pics": null}}, {"review": {"des": "Sandwiches are delicious. Introduced it to friends and they all love this place. Easy parking is a plus. Definitely will come back often!", "pics": null}}, {"review": {"des": "My first time here with the besties and niece. Wow!!!  As we walked in we were greeted by the friendliest lady ever (Patty you certainly are the best)- she walked us through the whole menu and made us feel welcomed like we have never before.  We agreed to her recommendations (after asking her) and couldn't be more satisfied. Guachitos to start were delish, and then came heaven to our table - succulent carne guisada, scrumptious mofongo con carne frita (crispy and juicy) - jibarito de lechón to die for...seriously to die for and yuca fried to perfection with mojo so delicious you want to eat it by the spoonful. Patty recommended her home made flan and tembleque...they were fire...so good!! This is definitely our new favorite Puerto Rican spot!  We will definitely be coming back. Some spots have great food, some spots have great service - this spot has both and they are good at what they do!  A CULINARY ORGASM! Felicidades to the whole staff!!!", "pics": null}}, {"review": {"des": "Not sure what happened here... this used to be a place that was our to go spot when wanting some good old home cooked Puerto Rican food... we have ate here countless of times before and loved every experience on top of our favorite savory dishes... it has been a while since we dined her last about 5 months... and was told by someone whom i recommended this place that they were disappointed and the food was far from what I suggested it was... So we decided to try for ourselves to make sure they werent just having a bad day.... what we found was disappointing. The food was dry, lacked flavor, jibarito tasted bland, lechon was dry and even the rice left little to be admired.  Not only have their prices gone up exponentially but where has the taste and quality gone?! I reached out to my friend to apologize as it was never like this before. My only hope is that they can somehow rediscover what seems to be now lost.", "pics": null}}, {"review": {"des": "I think I've found a new favorite!!!<br>I love this place!<br>Great food, comfy atmosphere! <br>Great guacamole<br>Loved the food!!", "pics": null}}, {"review": {"des": "Good food, family friendly, cozy, no frills environment. free Byob is a plus. Steak Jibaritos were pretty good. The steak and onions were awesome....the hubby ate in silence so he must have liked it...he vocalized his approval later. The garlic sauce is potent... it may linger in your breathe to the next day. There are some menu items that didn't have translations or descriptions or pictures so we had to ask what some of those were.", "pics": null}}, {"review": {"des": "authentic grandmas kitchen type of food. where do i start ? the ingredients were fresh. the arroz con gandules was delicious. the jarbrito was tasty and the garlic sauce made the sandwich even better. the serving sizes were plenty i had a doggy bag for later. prices are reasonable for what you are getting. the place could use a makeover but that has nothing to do with how well the food taste and the good service this business provides. staff was warm and inviting very friendly. i loved the soup as appetizer.", "pics": null}}, {"review": {"des": "One of my favorite restaurants! The steak jibarito is my favorite and I get it almost every time. The Mofongo is a close second, and I also love the guachitos, their chips and salsa and this yummy potato stuffed with meat(can't remember the name)! I love that it's BYOB. Patty, the owner, makes me feel like I am at home every time I go. We recently had a party with 20 people and they were so accommodating and entertaining. I LOVE IT HERE!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/NOk1-kr1b3DjLP3RPgO5LA/168s.jpg", "caption": "JIBARITO."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/LGUAn6k4wZw9WPRk1VD3uQ/168s.jpg", "caption": "Steak jibarito. I switch it up between white rice and beans and arroz con gandules. Both awesome!"}]}}, {"review": {"des": "Great customer service! Family oriented. Great tasting food. Family business. I tried different plates and all of them were delicious. Would come back to visit.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/yL7Odn9_f3BR2BOIhFQtSw/348s.jpg", "caption": "Jubarito with white cheese and yellow rice"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/JZy9J8-ksGuZ-86RTaknsg/168s.jpg", "caption": "Bacalao guisado with yuca"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/TiNl6nXn9t0Xx6QuwsfI_Q/168s.jpg", "caption": "Appetizers. Guacamole and alcapurria"}]}}, {"review": {"des": "BEST PUERTO RICAN FOOD HANDS DOWN!!! Everything on the menu is delicious especially the deserts. Great place to enjoy a meal and be treated like family.", "pics": null}}, {"review": {"des": "So last night my mom and I were in the city and wanted to have some good Puerto Rican food...so we stopped in here...when we entered the lady was very welcoming and friendly...the food was excellent...we are making plans to go back. Keep it up...DLB", "pics": null}}, {"review": {"des": "This is a small and inviting restaurant that serves dishes packed with flavor. Such great Puerto Rican food and the restaurant has been in the neighborhood for a long time. If you are looking for great Puerto rican in a cozy and comfortable place this is it. Service is great and food is even better. Family friendly because of course! A neighborhood gem.", "pics": null}}]}