{"name": "la-fournette-chicago", "reviews": [{"review": {"des": "I love this place. Cute little french bakery on Wells street with amazing food. Very nice staff, the place is always clean, and it has a really cool rustic feeling to it. <br><br>Definitely get the croque madame, and try their loaf of cheesy bread. You can't really go wrong at this place.", "pics": null}}, {"review": {"des": "This spot has the definition of excellent customer service. Michael, the one attending me, immediately went above and beyond to explain everything and give me recommendations. He had such a positive and friendly attitude, and even gave me some history to the place. Turns out, the owner won the World Baking Championship in the 90's and went on to open this cafe and bakeries around Chicago. I got the Hazelnut Beignet and an Iced Mocha (homemade mocha at that!) and both were super delicious. I mentioned that I had recently moved here and they told me Old Town residents get a little discount... Sweet! Definitely returning soon.<br><br>Update: I've returned a few times and haven't been upset yet. I still get the mocha and now I have been getting the almond croissant. Oh. Em. Gee. First of all, the thing is huge and has toasted almonds and powdered sugar on top. There's a sweet almond rum paste/filling on the inside that is to-die-for. Get it warmed and you're set.", "pics": null}}, {"review": {"des": "My husband and I stopped here on a Friday morning before walking around Lincoln Park. The staff were super friendly (and French).<br><br>It was very quiet and spacious inside, and there was no wait. He got one of the quiches of the day and said it was the best quiche he has ever had. I got a blueberry danish and it was so buttery, light, fresh and basiaclly amazing. <br><br>Everything was moderately priced. This would be 5 stars but I wish they did more with their coffee menu, as we were just given small mugs to self-serve out of a container, which is fine, but I wasn't expecting it. <br><br>I'd be here a lot if I lived in the area!", "pics": null}}, {"review": {"des": "If there's anything for which I have a weakness, pastries are on the top three list.  Thanks to other Yelpers, this place comes with very high reviews, and I was on a quest to find it.  The storefront is very narrow, and despite what GPS was telling me, I must've walked by this place at least a half-dozen times trying to find it, and felt really stupid when I finally did--it had a cute little awning inviting me in and made it more obvious.  In my defense, there is a lot of construction going on next to and in front of the store, so it made it a little tricky--that's my story; I'm sticking to it!<br><br>First thing you notice when you walk in is how warm and inviting the place feels--a warm greeting from a staff member, the charming cafe feel that just beckons you to sit and stay a while and enjoy a croissant and coffee while you read the paper (remember those days?) and hopefully not a cellular device.  I took a few moments to peruse the display.  I think they noticed my drooling, because several workers behind the counter were helpful to offer service.  I chose an almond croissant, which was super-flaky, light, airy, and not just \"good,\" but \"OMG-good!\"  I had to save my two little macarons for later, but trust me--I was dying to get into them.  I opted for a lychee and--?? (one other fruit that I can't remember), and a cassis. They were so good that I think I'm going back.  Okay, I'm lying.  I'm DEFINITELY coming back!  Where can I buy bigger pants?", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/7A0c-CEByROJxanx7JHChw/348s.jpg", "caption": "The flakiest almond croissant and my two little macarons were sheer perfection!"}]}}, {"review": {"des": "Even though it says dog friendly on Yelp it is not. There is a sign at the door saying no pets allowed. Only service animals are allowed.", "pics": null}}, {"review": {"des": "Can't recommend this place enough!! <br><br>We had the meat crepe and a couple iced coffees and it was perfect! The crepe was delicious and a good sized portion. We haven't even thought about it yet, but I'll bet we'll be back tomorrow based on how good it was today! <br><br>Do yourself a favor and go!", "pics": null}}, {"review": {"des": "Cute french bakery with friendly french staff. This is the kind of cafe that reminds you of sunshine:)<br>Def try their croissants: they are buttery on the inside and flaky on the outside. If you like sweets, try the almond croissant: powder sugar with sliced almond on the outside and almond cream on the inside. Nom!<br>Raisin roulade is a good alternative to croissant too: its made with croissant dough, but the pastry cream made it sweet. I'm not a huge fan of raisins though. <br>Love their crepe too!! Even the plain butter and sugar one tastes super good! <br>Will def come back to try their bread and sandwiches.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/KE28T79iZBd6wzLjsJuV5A/168s.jpg", "caption": "Almond croissant"}]}}, {"review": {"des": "Really good and authentic macaroons. They're always fresh and have a pretty good selection of them. If you sign up for their reward, you get a free one on you're birthday!", "pics": null}}, {"review": {"des": "Whoa baby, La Fournette you rock my world. Right across from Second City, this is my new go to after class snack. Side note: everyone should take an improv class at Second City once in their life! Anyways, the server greeted me in French and seemed genuinely excited to be there, which was refreshing. The case was pretty well staked around 2:30pm, and the almond croissant was crying my name, \"Eat me Megan. Eat me!\" I happily obliged and devoured it while walking to the train. Let it be known this is the best almond croissant I've had in my life thus far. It is a good size (possibly enough for two), and the almond filling is exquisite. It tastes like there may be some cointreau in there or some other liquor, maybe triple sec. Point is get the almond croissant and your tastebuds will sing for more!", "pics": null}}, {"review": {"des": "Very nice French bakery and cafe in Old Town. Great interior that feels very country French with wooden floors and tables. The veggie quiche was nice. I really liked the tuna salad sandwich. The multi-grain sourdough bread was very good. Nice croissant. Close to the el stops.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/HLt2po6nBp6t5LEHJMWdtw/348s.jpg", "caption": "Tuna on multigrain baguette"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/L9dQHPJ5jrmrUDCTaL1vFw/168s.jpg", "caption": "Vegetable quiche and plain croissant"}]}}, {"review": {"des": "Amazing sourdough bread and price is competitive. Haven't tried their pastry yet but looked good! Great service as well.", "pics": null}}, {"review": {"des": "In the mood for a great Croque Monsieur?  If so, La Fournette is the place to go. We visited during a walking food tour, and it was easily my favorite stop.  The authentic French cafe vibe is present from the moment you enter.  There's an impressive selection of soups, sandwiches and pastries to meet everyone's needs. The breads are the highlight.<br><br>Chef Pierre Zimmerman has put together something truly special. Check it out!", "pics": null}}, {"review": {"des": "This place is a gem. I've gone a couple times on Saturday mornings. They have a great window for people watching. You'll want everything, but I recommend you get the quiche.", "pics": null}}, {"review": {"des": "What a little gem! Not only is the atmosphere authentically French, but so is the food. From the croissants, to the roulades, and the fantastic breads, La Fournette is one of my favorite cafés anywhere. <br><br>I recommend starting your day with a café au lait and a pastry. I almost always take home one of their signature Miche bread loaves. The sourdough flavor is incredible. <br><br>Intelligentsia coffee is served here.", "pics": null}}, {"review": {"des": "Authentic French Patisserie in Old Town. Definitely worth a visit from a morning coffee and croissant to soups, sandwiches, salads and quiches for lunch.", "pics": null}}, {"review": {"des": "Loved it.  Had an apple danish, almond croissant and a delicious cup of coffee.  The interior, the servers all added to the French cafe feeling.  <br><br>Would absolutely stop here again.", "pics": null}}, {"review": {"des": "Came in on an early Friday morning and it wasn't super busy but busy enough that there was a wait for our coffee and crepes. They have sweet or savory crepes. I got the veggie crepe which had spinach, cheese and egg. My husband got ham, cheese, and egg in his crepe. Both were very delicious. We also got a chocolate croissant which was also tasty. I'm not the biggest coffee connoisseur but I enjoyed my coffee just fine. The space isn't very big but there's plenty seating including some al fresco seating during warmer months.", "pics": null}}, {"review": {"des": "Get the bread! In fact, get two so you can snack on one and save one for later. Got the Olive Fougasse Bread and it was dynamite.<br><br>Macarons all look fabulous. 1 free macaron for first Yelp check-in! Salted caramel was my choice and boy was it a good one. Just the right amount of sweet/savory flavor and consistency.<br><br>Unfortunately the breakfast crepe missed the mark for me. It was overly loaded with diced up ham and bacon. Kudos for packing it all in, but it was overkill for me. Crepe was cooked nicely and paired with cheese and peppers. I picked it apart and ate it, but would go with a tartine next time.<br><br>Beautiful looking pastries. I wanted one of everything!", "pics": null}}, {"review": {"des": "Great macaroons! Also if you check in on yelp you get a free macaroon which are priced at $2. Could also be a nice spot to study or get work done during the day since they have a decent amount of seating.", "pics": null}}, {"review": {"des": "I live more north of this location and really miss having a La Fournette right on Clark! I love this place's quiche, baked goods, and of course their macarons, which are cheaper than other French patisseries in the area. <br><br>Service & atmosphere: the place has counter service and the staff yesterday were very friendly, warm, and informative. The place has a French countryside rustic vibe, and we sat outside in the small patio, which was perfect for the one of 5 sunny days this spring. <br><br>Food: Between three people, we shared coffee and chocolate madeleines, a chicken and spinach quiche, a nicoise salad, and an almond croissant. I got a free espresso macaron with Yelp check-in, it was so delicious and perfectly baked, and I obviously wasn't going to share it with anyone. The madeleines were dense and fluffy, and the chocolate ones were especially flavorful. The nicoise salad was fine, but the quiche was creamy and had a buttery flaky crust. The almond croissant was the BEST I've ever had. Crispy, flakiness on the outside with soft, light insides and a generous amount of sweet almond paste. It was so good that I will absolutely be back just for macarons and croissant the next time I'm in need of French baked goods.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/oBMzMM1CuqiNwsR2r6SM7w/348s.jpg", "caption": "Spinach and chicken quiche with Niçoise salad, chocolate and coffee madeleines, HEAVENLY ALMOND CROISSANT"}]}}, {"review": {"des": "This place is a gem. I was walking through old town and just had to go in when I saw this adorable shop.  I love the chalk board menu and beautiful display of desserts and breads. I decided to order a couple of macaroons since I've never tried them before - I got the pistachio and earl grey ones, they were amazing!!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/D3yUbplsYZIL-4nNH__t3g/348s.jpg", "caption": "Earl grey and pistachio macaroons"}]}}, {"review": {"des": "Was treated to really great coffee & delicious almond croissant after hitting up a farmer's market. Cute decor & ambiance. Will definitely need to come back.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/NoRxdPvrsTEOZBtKmQNxBA/348s.jpg", "caption": "A nice hot dark roast with a Strussel Brioche for breakfast. Nom nom"}]}}, {"review": {"des": "These are your perfectly average set of macarons, but far from outstanding. The first three macarons were decent in texture, however the last two of the macarons were missing that fluffy, airy, and lightly crisp exterior, weightless interior/softly smooth luxuriousness I crave, resulting in an sticky, overly-chewy sensation in each bite. Flavor wise, I did enjoy the Nutella and caramel macarons, it is accurate in one-dimensional flavor description, however it was not addicting nor something to rave about compared my favorites Laduree or Lolly & Pops. An easy pass for me, I am left despondent as I think this cafe has potential. I hope they will continue to improve and expand their flavor collection.", "pics": null}}, {"review": {"des": "I admire very much the French cuisine, so this place was a real breakthrough for me because it brought me a lot of joy. I really love French pancakes and croissants, these desserts take a special place in my heart it might seem funny but it's true. If your dream is to visit France then this place is exactly what you need, absolutely all desserts can virtually teleport you in France through amazing taste and aroma.<br>I also dare to advise this place for those who want to make a romantic dinner. I'm sure the loved one will be pleasantly surprised.<br>Best wishes!", "pics": null}}, {"review": {"des": "Authentic and delicious! We started out with just breakfast (pain aux chocolate, almond croissant, pain aux raisins, and crepe \"Suzette\") and got lunch too (croque monsieur, quiche, and onion soup) since it was so good.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/yA5XOk5bQmpvOJoOy48rOw/348s.jpg", "caption": "Delicious French food!"}]}}, {"review": {"des": "I took my Mom here when she was in town and we got fresh bakes bread and a six pack of Macarons. Needless to say-- we ate ALL macaron in one sitting. It's so cute inside and the guys working the counter were so helpful! If you've never been, I highly recommend it.", "pics": null}}, {"review": {"des": "Visiting Chicago for the weekend and found this cute spot to duck in and grab a little snack. Service is friendly and their trays are super cute! I think it would be a nice spot to grab a drink and a dessert, but not sure about having a full meal here.<br><br>I ordered a quiche and a macaron.  The macaron was pretty delicious (mango flavored) and was not too sweet or too soft.  The quiche was a little less than what I was expecting. The flavor was good, but the crust needed help.  It was a little too thin and didn't support the filling. I suspect that it sitting out and being reheated doesn't help. I really wanted to love this place, as the atmosphere is cozy, but I couldn't.  Maybe I just ordered the wrong thing?", "pics": null}}, {"review": {"des": "I live in Old Town and i'm glad to visit this place every day. <br>Very friendly staff, great prices and AMAZING almond croissants. Also recommend to try baguette and coconut cookies.<br><br>Guy from Ohio is very good, he provides the best customer service i've ever had.", "pics": null}}, {"review": {"des": "Tres Bien!<br><br>So there are these cookies I brought home from Paris, they were so good that I didn't give away my last box like I had planned. (So they got chocolate instead).  When I visited La Fournette, I asked them if they made cookies and the friendly folks said that they really focus on pastries. But as I described the cookie, with a nod to each other, they said I must try their Vanilla Spritz cookie.  I think there was an extra spring in my step that day because even though they looked totally different from my Paris cookies, they had the same great buttery, mildly sweet taste.  <br><br>The croissant was also divine. Buttery, flaky and perfectly made. Not my favorite in the city, but definitely a close second.  <br><br>My son and I also sat in for lunch the same week and we shared the Quiche and Croque Monsieur.  We both decided the quiche was just ok--it was weirdly crumbly, but tasted good. The Croque was delicious and wonderfully cheesy. <br><br>The space is very homey, reminiscent of France. I overheard who I assume is the owner speaking in rapid French over the phone. Too bad I'm not in the area often; this would be my go-to boulangerie for sure.", "pics": null}}, {"review": {"des": "It's a little pricey and the food is alright. The service has always been very hospitable. We went there after we got home from Paris and went back again after the French election.<br><br>It's a great place to meet a friend for coffee and a sweet treat if you're already in the neighborhood. I wouldn't recommend it for anything else. It always leaves me wanting more.", "pics": null}}, {"review": {"des": "Excellent crepes great atmosphere 5 star service! Large menu! Great for a afternoon snack, or breakfast. Opens at 7 am everyday!", "pics": null}}, {"review": {"des": "This place makes me happy just walking through the door. Their breads and baguettes are amazing. They even won the \"best baguette in Chicago\" award. They also have really good coffee, sandwiches, quiches, crapes and many other baked goods. During holidays they make specialty cakes, like the chocolate log cake, which of I have to get two of since all of my family loves it. <br>The stuff is always super nice, the place is cozy, and they have outdoor seating when it's warm. It's worth a visit.", "pics": null}}, {"review": {"des": "Looking at the pictures on Yelp made the pastries look so good.<br><br>I got a few macarons and a couple beignets as well as a latte.  The macarons were good- matcha, mango passion fruit, coconut and one other flavor I can't remember.  The beignets were not light and fluffy like the ones you'd get in New Orleans.  These were dense and chewy.<br>The latte was pretty bad.  The milk was steamed improperly so I basically had a cup full of foam and a little bit of super hot milk.  <br><br>Service was great but it can't make up for the disappointing pastry & latte.", "pics": null}}, {"review": {"des": "I decided to visit this place last Saturday as it was nearby the area I had to go to pick up my gear for the Color in Motion 5k run. First time being in a French bakery, there were so many options to choose from in terms of sweets-like macarons, danishes,  beignets(which honestly seems like a pricer version of Pączki!), sandwiches and breads. The server was very helpful in pointing out what macarons flavor was which! Prices seem reasonable for portion! Service was excellent! I enjoyed getting a box of 12 assorted macarons, apricot danish, and raspberry and hazelnut beignets! I would go back here but may skip on the beignets and try the sandwiches and other macarons flavors.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/lgprHRoAhRJP-H2uw8Bm2Q/168s.jpg", "caption": "Apricot danish"}]}}, {"review": {"des": "I ate here twice.  The macaroons, at least the lemon, are worth driving for.  The breads were good but I prefer the more chewy baguette (the French have both the light crispy more more American like bread and the more chewy and slightly more salty baguettes).  I prefer the latter.  Overall probably 4.5 stars.", "pics": null}}, {"review": {"des": "Love this place!  I go every week to get a latte and a pastry or crepe.  Delicious!  I've also enjoyed their soups and a ham a cheese croissant.  Prices are fair, service is friendly.  Highly recommend!", "pics": null}}, {"review": {"des": "Reasonably priced, delicious food, and a great atmosphere! We did not wait long to order or get our food. You can dine in or carry out. (Summer they have porch seating to eat outside). I used the Yelp check in deal to try their macaroons and it was very tasty. Staff was friendly and helpful with recommendations and questions. I would recommend this place.", "pics": null}}, {"review": {"des": "A lot of people think The Publican has the best bread. It's great but I think La Fournette is a shade better.  Their pastries are excellent.  Order some espresso get a croissant and close your eyes. You could be in France", "pics": null}}, {"review": {"des": "A delicious French bakery in the heart of Old Town! They have all the classic baked goods, plus a delicious, if limited, selection of sandwiches. A great place to grab a coffee and a croissant! Nice staff and decent prices.", "pics": null}}, {"review": {"des": "We came in 10 minutes before the bakery closed looking for a pastry to buy to eat the next morning. The guy behind the counter was rude and condescending when we asked him to help describe the remaining pastries left. He was rushing us and didn't seem to care about customer service. We bought 3 things and then left. The guy rushed to the door and locked it (closing 5 minutes early) as soon as we left. Terrible service, atmosphere, and overall experience!!", "pics": null}}, {"review": {"des": "I love La Fournette's food. I used to go to the one on Clark street all the time until they sadly closed down, but I just moved to Old Town so I'm so excited to be back in La Fournette land!  My absolute favorite dish is the quiche, I love love quiche and La Fournette's is probably some of the best I've had.  Really buttery and the crust is flaky.  The macarons are also really good, they have good flavors and they are like the best dessert ever.  I like their Niçoise salad as well and the dressing is yummy. <br><br>I've got to knock off a star for service.  It's not that the service is slow, it's just like, so blah.  Every time I walk in here (both locations), I feel like the people behind the counter look at me like I'm from another planet and they don't know what a human is.  Straight deer in headlights look! No \"hey!! Welcome to La Fournette! What can I get you???\". Like zero excitement or even acknowledgment that I just walked into their place of business and would like to order something.  <br><br>Overall La Fournette is a great little cafe, the owner is usually around too which is great. Don't be phased by the weird service, the food is great.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Mh5YxKKxPKEDZcbyinRmPQ/168s.jpg", "caption": "Macaron beauty"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/AQPGgYNHz5tJSThadS0nxA/168s.jpg", "caption": "Quiche Lorraine"}]}}, {"review": {"des": "Yummy is all I can say. My favorite old town bakery.  Try the delicious croissants and Home made soup. I can be a coffee snob (not a Starbucks fan). The coffee here is very good. <br><br>A great way to start your day.", "pics": null}}, {"review": {"des": "Authentic French bakery. Delicious chocolate eclair and raspberry beignet. Absolutely wonderful bread. I had a ham and cheese baguette and my daughter enjoyed her tuna salad sandwich. Excellent collection of french macarons-- mango passion, pista. Cointreau, chocolate and pina colado. Heavenly", "pics": null}}, {"review": {"des": "We loved it here! The croissant and beignets were good and not too pricey. There are many other options, both savory and sweet.", "pics": null}}, {"review": {"des": "Incredible pastry. Best croissants I have ever had. Flaky, not greasy, not too sweet. Always recommend it to anyone visiting Chicago.", "pics": null}}, {"review": {"des": "MACAROONS HEAVEN!!! Omg selection galore! Incredible service! The selection and service at this bakery is outstanding! The coffee is fresh and delicious! Adorable  cafe! Large seating area good for groups! Macaroons have great texture to them!", "pics": null}}, {"review": {"des": "My favorite place in Old Town. Family-run, authentic French bakery with the most friendly staff and the best almond croissant I've ever had. <br><br>Good place for a light lunch as well: quiche, croque madame, and tarte flambée are all on the menu", "pics": null}}, {"review": {"des": "We had the ham and cheese croissant and wanted a crepe too but we were too full!!!!  Croissant was flaky and buttery and the ham/cheese balance was just right.  We liked this so much that we went back but they closed at 6PM.  So sad...", "pics": null}}, {"review": {"des": "They just made my day. Their mastery is in every pastry they made. If you wanna taste how the French bake, you visit this shop as early as possible before they are sold out.", "pics": null}}, {"review": {"des": "Average French pastries marketed as a classic French bakery.  Beignets lacked the density and richness of the best I've had, and the quiche was too moist.  Atmosphere fun with lovely staff.", "pics": null}}, {"review": {"des": "I love this twist of the macaron. As if macarons weren't already amazing, filling the center with gelato is genius and delicious. I wish there was a cafe in my hometown that sold these decadent treats  (I would probably be there every day).<br><br>The cafe had plenty of seating and the guy working the counter was incredibly sweet and patient. I loved what I ordered even though I was totally skeptical because they didn't look that good in the case because they are cold they break easily. I will definitely be back during my next trip.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ysJvZpG_ZM8FAjlGOup_bQ/348s.jpg", "caption": "Yum!"}]}}, {"review": {"des": "Lovely authentic french bakery. This is one of those spots where it's hard to pick out one item from behind the glass. Every time I walk into La Fournette I'm split between which croissant to choose. Naturally, I talk myself into getting two :) a chocolate and an almond. I also highly recommend the beignets. The best I've ever had.<br><br>The only thing keeping La Fournette from 5 stars is the amount of seating. Quiet and relaxing space, but I've never been able to sit down. Perfect to-go option though!", "pics": null}}, {"review": {"des": "Super welcoming and helpful staff! Stunning pastries. We most enjoyed the raspberry and chocolate hazelnut spread filled beignets, and, the star of the day, the croque monsieur. Spongy bread with crisp crust lavished with toasted gruyere, salty ham, and addictively nutmeg-rich bechamel. I could eat this sandwich every day.", "pics": null}}, {"review": {"des": "Cute little bakery. Had macaroons and a cappuccino here. Same price as chain coffee places but I'd rather come here for the aesthetic-- and theres a perfect spot by the window to people watch. Wasn't crowded at all.", "pics": null}}, {"review": {"des": "Coffee and chocolate are fantastic! Pastries are wonderful. <br>Macarons are great, and if you check in from this place for the 1st Time you get one for free ;)<br>Don't forget to buy some madeleines for home.", "pics": null}}, {"review": {"des": "How can you go wrong with carbs and coffee? Great service, cozy atmosphere, and delicious bakery items, sandwiches, quiches, and macaroons.", "pics": null}}, {"review": {"des": "Dynamic bread.... their sour dough is to die for...<br>Coffee is fantastic. Cappuccino is wonderful...<br>Pastries are great", "pics": null}}, {"review": {"des": "Everything is yummy and the people are really nice. What more can you ask for? Fresh bread, flaky croissants, and more! I might move into this neighborhood just to eat here every day.", "pics": null}}, {"review": {"des": "We were really disappointed. We wanted to stop for a coffee and pastry pick-me-up. We yelped this place ahead of time and thought it was worth going slightly out of our way.<br><br>The pastries in the display case looked beautiful. I got a beignet and my boyfriend got a brioche with streusel ($10.63 for the snacks and two small coffees, reasonable). They were not great. They tasted like yesterday's leftovers. I think that they probably could have been good if they'd been refreshed even in a toaster oven (or, ideally, baked the same day). Either that or they were just truly over done.<br><br>After paying to park at a $4/hr meter we were not happy.<br><br>We went across the street to get a croissant for comparison at Le Pain Quotidien and that was considerably better, which was disappointing because LPQ is a chain.<br><br>The coffee (Intelligentsia) was very good, at least. La Fournette wasn't the worst but we were annoyed.", "pics": null}}, {"review": {"des": "If you like authentic French, you will like this. I am overweight so I have a rule that I can only eat a desert that I have never had before. If I say no deserts it would be a burning desire that I carried with me. I cannot pass a new bakery. I went in here and found one of those magic deserts. They have one called \"Uncle Hansi\" cake. It is a their family only recipe. It is an Alsatian hazelnut-almond pound cake. I spoke to the brothers that own the bakery. They are French and they bake all of the traditional French pastries. I was full so could not try the croissant but they assured me that it is right. I am excited for the next time. They also serve food but I will get to that next time.", "pics": null}}, {"review": {"des": "The most amazing vegetarian quiche, and ham and cheese brioche sandwiches.  Founding baker won the World Cup of baking in 1994.  Can't miss this place.", "pics": null}}, {"review": {"des": "OK - If I am in the neighborhood, I come here.  If I was closer, I would be stopping for macaroons more often.  The pumpkin flavor was amazing...well, I haven't found one that I didn't like :) The earl gray is surprisingly tasty.  I missed the straight raspberry but that just means I need to come back by during the summer.  <br>The cost is high by grocery store standards but the taste makes it seem like you are purchasing a hand-crafted creation instead of just a cookie.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Pa3RB0EdmhmSRH8LOgYnag/348s.jpg", "caption": "Pumpkin and Lord Bergamot!"}]}}, {"review": {"des": "Coffee is good, pastries tasty but unfortunately their employees are rude and disrespectful to customers.  It was only I spent $30 in coffee that dude told me they're closing in 15 minutes and I needed to leave soon<br>5 minutes after closing he came by and told us in rude tone 'we have been closed for 5 minutes you need to leave'.  Really? I'll leave to never come back!", "pics": null}}, {"review": {"des": "The cafe is comfy and inviting, and the quality of the baked goods here is really top notch. I might have just eaten an entire package of chocolate spritz cookies in a single sitting.... <br><br>Really delicious, to-die-for croissants. So flaky, buttery, and just sheer perfection. Already plotting when I can return to buy more.<br><br>My only quibble is they seem to use quite a bit of plastic packaging. La Fournette has lovely packaging design (i.e., logo) and of course the clear plastic allows potential customers to easily see the product within. I get that. But I would really prefer that these items were, well, biodegradable for obvious reasons. On a more superficial note, all the plastic detracts from the classic French bakery vibe. So: La Fournette, I am one customer in love with your tasty breads and pastries, and I hope you strongly consider switching to biodegradable packaging in the near term!", "pics": null}}, {"review": {"des": "Their crepes are amazing and the iced coffee is delicious. I'm not sure why but it's better here than other places that serve the same brand. Also staff is wonderful and nice. I wish they had a vegetarian sandwich, but I survive with the vegetarian crepe :)", "pics": null}}, {"review": {"des": "My favorite bakery in Chicago! <br><br>Thank you for the best croissants in the world!<br><br>Amazing and very friendly staff! Thank you for the great service!", "pics": null}}, {"review": {"des": "Very friendly service, fast, and food was fresh! I got the chocolate croissant and it was amazing, melted in my mouth. My friend got the croque monsieur and it was also very tasty. Iced coffee was good. Nice, cozy atmosphere--would definitely come back for coffee, snack, or meal. Prices were fair and the selection was good.<br><br>The macarons were just okay--lacked some flavor.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/bDdKh26Adbq_7T5ktCcODg/348s.jpg", "caption": "Free macaron with checkin!"}]}}, {"review": {"des": "La Fournette in Old Town is a wonderful place to go. It is a French café where you can get excellent Intelligentsia coffee, tea, bakery goods, and tasty french menu items. The menu is small but everything tastes great, you know what is said, \"Everything tastes better with butter.\" In addition they serve the best bread in Old Town, even the croutons are \"magnifique!\"  it goes great with La Fournette's hearty soups or salads. Make sure that you do not forget to purchase some of the bakery goods to take home, they have the best macaroons in the city, along with wonderful croissants and beignets. <br>Customers, order at the counter and all orders are brought to the table by a cheerful server.<br>I recommend La Fournette to everyone and give it 5 stars.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/rLYjKmqV-oQciKe9nBTuZA/348s.jpg", "caption": "Happy Easter Baby Chick"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/-s2joaI6nIdybWFTy9Klow/168s.jpg", "caption": "A tray of  delicous macaronis"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/yrCmHUx1E5cWYIPeJy7zpA/168s.jpg", "caption": "Blueberry danish"}]}}, {"review": {"des": "Absolute must go to place for baguette in the French community. Never disappoints. Neighborhood discount available.", "pics": null}}, {"review": {"des": "Love this place. French cuisine in perfection. Feel like im in Paris. Michelle helped me to placed an order for my bridal shower, of course, first thing that came to my mind are the macaroons. Michelle was very helpful and genuine with her service. <br><br>Will also recommend their Quiche Lorraine. Never had one like theirs. I must say a really \"Authentic French Bakery.\" Merci Michelle.", "pics": null}}, {"review": {"des": "Cute little place in Old Town! My husband ordered the meat crepe and I ordered the veggie crepe with coffees. The crepes were absolutely fantastic as well as the coffee. The crepes were made with good quality ingredients, which made for quite the tasty breakfast. Will definitely be going back to try more items on the menu!", "pics": null}}, {"review": {"des": "I would have given them 5 starts for their superior, TrueType French pastries but their service is questionable.  I walked into the shop wearing my painting clothes.  Another woman walked in behind, with her exercise outfit.  The young cashier acknowledged me, and I walked over to the glass cases.  The cashier then acknowledged the other customer behind me and server her.  I stood and waited.  Then, after the cashier was finished, she did nothing l, just stood at the register.  I then asked twice if I could be served, to which she finally responded.  By the way, the cashier didn't apologize.", "pics": null}}, {"review": {"des": "Found this place today morning on our way to our bike ride along the Lake shore trail. Had not been in Old Town in years. The ham and cheese Croissant made the day. Flaky enough and so flavorful. The place feels like a spot in Northern France. Coffee was just right. Loved the down to earth feel and genuinely good service. Will come back even if it is a bit of a drive.", "pics": null}}, {"review": {"des": "What can I say delicious!!<br> the best baguette in the city, that I know of and I love baguettes.", "pics": null}}, {"review": {"des": "I have been dreaming of a sandwich from here since I started working in the neighborhood 2 months ago, but I was Very Disappointed with my purchase today.<br>I arrived at La Fournette around 1pm today and ordered the Saucisson Sandwich: Dry-cured salami on freshly baked baguette. <br>After I placed my order, the guy behind the counter produced my sandwich in record speed, and when I commented on this, he said the sandwiches were pre made. I was suprised and wondered to myself how long the sandwiches sat there before they are bought. <br>I took my sandwich to go, and I should have looked at it before hand, because when I got home, my heart sank.<br>The sandwich came with mustard, hazelnuts, and micro-greens, and to my dismay, the portion itself was Micro-sized. The flavors of the salami, mustard, and hazelnuts were lost in the oversized bread- but I did enjoy the baguette.<br>This was the lightest, thinnest sandwich I have ever had! For $9.95, I feel really let down and couldn't even finish the second half of the sandwich, I was so sad.<br>The top-rated stars and reviews lured me in, but the build of my sandwich disappointed and saddened me.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/WMIg5KHhaKjWneEujPITUw/348s.jpg", "caption": "The micro-greens were really micro  :("}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/0_HgMm0KQcJZs3ZgO3iIKw/168s.jpg", "caption": "The mustard packet created more filling than the 3 super slim salami slices"}]}}, {"review": {"des": "La Fournette is such a hidden gem on Wells. I pass by this place all the time and only recently decided to stop in with my mom. The staff is so friendly and they speak French. <br><br>There are so many authentic food items and breads to order. I had the croque monsieur and mushroom soup. The croque was better than ones I have had in Paris. Hard to believe, I know. The mushroom soup was amazing as well. The soups are different everyday I assume but if you catch the mushroom soup, definite get it.<br><br>My mom had quiche lorraine (with bacon) and it was so light and the crust was flaky. The portion is very generous and the bacon isn't too salty.<br><br>We got some macarons to go because we were both stuffed after eating our mains. I ordered a pistachio macaron and ate it 3 minutes after we left. The macaron was so light and subtly sweet. A great end to the meal.<br><br>I love this place and will be coming back.", "pics": null}}, {"review": {"des": "C'est delicieux! <br>The Croque Monseieur melts in your mouth, the quiche is superb, and the Macarons... Oh lord. <br><br> This French bakery has a lot of heart and you can tell they put it into their flavors!", "pics": null}}, {"review": {"des": "Not sure why this place has so many great reviews. Perhaps because it was part of some French tour. Nothing French about this place other than the employees' cold attitude.<br><br>We ordered a piece of quiche, a savory crepe and a macaron. Quiche was not memorable. Crepe was really bad. The whole thing, from skin to filling all actually tasted rubbery. Raspberry macaron was very dense and super sweet. I didn't taste any raspberry. Price was over the top for strange tasting, luke warm food. <br><br>We will not be back.", "pics": null}}, {"review": {"des": "Great croissants, macaroons, and baguettes.  Their croissants and baguettes are world class!<br><br>Mariano's in west loop has their croissants and baguettes in stock at the bakery.", "pics": null}}, {"review": {"des": "I've been dying to come to this cafe for weeks now but I just haven't had a chance. I was on my way to the Yelp Elite Cocktail Competition and while I waited for my friend to pick me up, I stopped by here. Oh my goodness- I thought I had seen the best cafes in Chicago- I was wrong! This beautiful French cafe is absolutely beautiful from the outside and in. I arrived really late, around 6:24 and they close at 6:30 so I was relieved to see that they are not the type of place to close extra early just because they may not have as many customers. I literally squealed from joy when I walked in and told the employees I had rushed here from water tower to try their delicious macaroons! I had two- the chocolate and lychee. I also spied a raspberry beignet. When you check in, you get a free macaroon so for the two macaroons and French beignet, the total was $5.56? Pretty good deal if you ask me. I was blown away by the ambiance, everything is wooden and cute. My only regret is that I didn't get a chance to stay longer and explore. I ate the raspberry beignet on my way out- I've made beignets before and they are best straight out of the oven so I wasn't completely disappointed when they had lost some of their freshness by 6:30 at night- they had probably been out for almost twelve hours anyways. The raspberry jam was very delicious, it tasted very organic and the dough of the beignet was not thick. It was cooked perfectly and the dough did not overpower the filling! I would HIGHLY recommend coming here for Saturday morning coffee or mid afternoon break! From all my excitement, forgot to take a photo", "pics": null}}, {"review": {"des": "I'm a sucker for almond croissants and macarons, so whenever I'm traveling, they're always on my hitlist. La Fournette had a good selection and prices were reasonable, but their baked goods just didn't have that x-factor. The shop is cute though, and the surrounding area is very walkable, so it could be worth checking out if you are already in the area.", "pics": null}}, {"review": {"des": "This place has awesome French macarons and when you check in on Yelp, you get a free one, how awesome is that? Parking is damn near impossible and I came here mid-morning on a Thursday. The staff is very friendly and the place smells amazing.", "pics": null}}, {"review": {"des": "This place was pretty great. The food and coffee were excellent, and the macarons were my favorite. The menu had a lot of selection and there were a lot of pastries to choose from. We sat on the outside patio, which is beautiful on a nice day. The only downside was standing to wait for our meal to be ready for about 15 minutes, partly because they had to brew a new pot of coffee and it seemed to take forever. The restaurant setup requires you to stand while waiting and then bring your food out to your table, and this can be difficult when you have to carry your tray through the door and down the steps outside. I think it would make more sense to have table numbers and a table runner system instead.", "pics": null}}, {"review": {"des": "Update:  UGH. Looking at my previous review, I don't know why I came back here AND ordered another sandwich. I wanted to give them a second chance because their baguettes really are good.  When I arrived, in their case were a few of each variety of sandwich.  I asked what condiments were on the ham and cheese and they replied mustard.  I asked for a fresh sandwich because I cannot stand mustard.  They told me that they could not make me a fresh sandwich and continued by singing the praises of their sandwiches, saying that the mustard is really light, and you can barely taste it at all, and one of them just had one last night and couldn't even tell, blah blah blah.  Bottom line, they refused to make me a fresh sandwich.  I got the ham and cheese, and the mustard was the only thing I tasted.  I ended up ripping out the inside layer of baguette because the taste was overpowering - kind of like when you tell someone who doesn't like fish not to worry because it doesn't taste fishy...if you don't like something, it's the ONLY thing you can taste, am I right?<br>For a $9 sandwich, ripping out the insides and leaving still hungry is unacceptable.<br>The best part, however, is when I got up to leave, I saw that the display case contained at least 6 FRESH ham and cheese sandwiches! I had been willing to forgive the inability to make me a sandwich, thinking it might have been due to lack of ingredients, but NO...they were just unwilling.<br>Stay away from La Fournette, they LIE!", "pics": null}}, {"review": {"des": "La Fournette was a life saver for me while staying nearby. Thank god for WIFI! <br><br>Iced lattes were fantastic. I wouldn't say this is the best coffee I've ever had, but this was fantastic nevertheless (La Fournette over Starbucks any day!). <br><br>I would skip the almond croissant (they smear almond paste between the sliced croissant which is way too sweet for me!) and go for the apple danish. Entirely decadent, not too sweet, and totally worth it.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/26nLWM39psUXjNQwptiwcQ/348s.jpg", "caption": "Apple danish! Very good!"}]}}, {"review": {"des": "Stopped here before seeing The Secondy City show nearby. Received a complimentary macaroon with my check in and ordered a hot chocolate for myself. <br><br>The hot chocolate was very watery and not sweet. I have to admit I like a sweeter hot chocolate (not too sweet, but enough to be hot chocolate rather than black coffee). So that was a bummer. But the chocolate macaroon was delicious and the service was very friendly. Definitely a nice local cafe to stop at if you're in the area.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/QrlUUiqfnXRga0NnVcUDVw/348s.jpg", "caption": "Check-in offer = 1 free macaroon (chocolate was delicious)"}]}}, {"review": {"des": "Baked goods seem pretty good, but they offer a lot of other stuff that is pretty mediocre.<br><br>The meat breakfast crepe was a joke.  It was all watery, with very low quality ingredients.<br>The mocha was also pretty lackluster, kind of burnt and bland.<br><br>I would stick to the baked goods and macarons here.", "pics": null}}, {"review": {"des": "The best, officially absolutely the best croissants in the city. As perfect as in Parisian La Grande Epicerie de Paris. Took me a year of trials to find a perfect ones! <br>On macaroons - very good too!", "pics": null}}, {"review": {"des": "This is how a bakery should smell - like butter. Not sugar.  <br><br>I explained to the lovely lady behind the counter that I would have one of everything, and she laughed.  I was only half kidding, but reason took over and I settled on a bowl of mushroom soup and a tarte flambée baguette.<br><br>I was unimpressed with the soup, which was missing that rich mushroom flavor and brothiness of a good mushroom soup.  Though to be fair I sort of make the best mushroom soup myself (combined from a recipe from America's Test Kitchen, a Japanese cooking show, many trips to farmer's markets and Mitsuwa, and a great deal of trial and error) so maybe it was unfair of me to hold those same standards to this cute little bakery that bakes first and probably sells soup as an afterthought.  <br><br>The tarte flambée was phenomenal - just fantastic, and was the one of the best things I ate all week.  The macaron I had afterwards was pretty great too - not too sweet.<br><br>This s my kind of bakery, and I'll definitely be back.", "pics": null}}, {"review": {"des": "Absolutely am in love with this place, their earl grey tea macaron is delicious. Will always be my go to.", "pics": null}}, {"review": {"des": "Great spot for a pastry and coffee in the morning. La Fournette is a French style bakery offering breads, croissants, etc and also some lunch options (sandwiches, quiche, etc).<br><br>Came by for breakfast and tried a streusel brioche and a danish. Also had to get the free macaron with Yelp check-in! Both breakfast bread options were good as well as the coffee. Between streusel brioche and the danish, I would get the danish again as it was lighter and had more flavor. The Linzer macaron shell was a little bit too crunchy (seemed like it may have been borderline stale) but the filling was their excellent jam which I now want to buy a jar of!<br><br>Will definitely be back for a fast casual breakfast. Also love that they serve your selections on cute chalkboards or in break baskets for the table, very nice presentation while eating in.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/AkjcrZ7YuSHL52TZhH-XxQ/348s.jpg", "caption": "Half of a streusel brioche (dug in before I thought to get a pic!) and a Linzer macaron served on a chalkboard."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/fIX2Fu7rbETiu0rc3gYgQw/168s.jpg", "caption": "Macarons, ready made sandwiches, and more fast ready-to-go options."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/0dJ9B67PA0EIQkdaYfAnug/168s.jpg", "caption": "Great assortment of croissants, Danishes, etc."}]}}, {"review": {"des": "If you're in Old Town Chicago, <br><br>You have to stop by for The B E S T Cappuccino and the greatest homemade desert. <br>(Cookies and cakes).<br><br>They also make delicious crunchy Sandwiches.<br><br>The only thing I didn't really like was the filling for their hazelnut Crapes..", "pics": null}}, {"review": {"des": "Macaroons aren't usually my dessert of choice, but I was actually in the mood for one or two or three :)<br><br>The store front is pretty small so you gotta look out or you might miss it. Service was friendly and I didn't feel rush as I eyed the bakery offerings. <br><br>With plenty of options I limited it too 3 macaroons (hazelnut, raspberry chocolate, and pumpkin). Make sure you check into the yelp app for one free macaroon. Yes these things were small, flaky, sweet, and delicious! The pumpkin was my favorite. I will definitely be back to try the other flavors and more bakery offerings.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/2HD94Ve1bzaHDe_NORU4Rw/348s.jpg", "caption": "Hazelnut, raspberry chocolate, and pumpkin macaroons"}]}}, {"review": {"des": "Wonderful French bakery! The fare is authentic and the staff is delightful. I had a vegetable quiche and cappuccino. Both were fantastic! I also got a baguette and Madeline cookies to go. Everything was fresh and delicious. I'm so happy I found this gem! Highly recommend!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/TVzToMN3FBBjQ-nl5NyVLQ/168s.jpg", "caption": "Lovely selection of French treats"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/vy6Yg4fccpO_TfiW2ttfYQ/168s.jpg", "caption": "Vegetable quiche and cappuccino"}]}}, {"review": {"des": "Love this coffee shop. I used to go to the Lincoln park location all the time. Their pastry items are made in house and out of this world. They make bread for many local resturants in the area.", "pics": null}}, {"review": {"des": "Come for the macarons, stay for the madeleines. <br><br>The great macaron search on Yelp centers on three Chicago area bakeries: La Fournette, Vanille Patisserie, and Pierrot Gourmet. Of the trio, I liked La Fournette's the best. It makes the tastiest macarons, with the crispy yet airy exterior cookie combined with the deft texture and taste in the filling.<br><br>That said, La Fournette's macarons come in a distant second place to the wonderfulness of its madeleines, an underrated French patisserie undoubtedly easier to make but no less delicious. La Fournette's madeleines come in one size but many flavors. And since madeleines are not Paris' pastry du jour in the States, finding a good one is a find in itself.<br><br>And if La Fournette wanted to follow that up with pain aux raisins or eclair au cafe, two Parisian prominent constants that are hard-pressed to find in the States, I wouldn't be averse to being the taste tester.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Kr8KlKRUJXQc4BkV9qD9cA/348s.jpg", "caption": "Box of madeleines"}]}}, {"review": {"des": "This is a wonderful, authentic french bakery!<br><br>When you walk in you'll be greeted with a \"bonjour\" and friendly faces. There's a large display case with the bakery items, but there's also other items you can order off the menu, like crepes and salads. So far I've stuck to the bakery items, with the exception of a saucisson sandwich. The dry-cured salami was delicous, but I would have preferred the sandwich without the pickles and other toppings they added. I just like the traditional salami and butter. <br><br>The bakery items take me right back to France! The baguette is crusty on the outside and soft on the inside, just the way I like it! You know it's a good loaf when your jaw is sore from chewing the crusty outside! The beignets were also delicious, and you get a choice of plain, raspberry or hazelnut. I personally like the raspberry the best. Another favorite of mine is the apricot danish. It's so flaky and buttery! <br><br>The atmosphere here is also great, and I especially like the little outdoor seating area. There aren't too many tables out there, but people usually circulate in and out pretty quickly, so I've never waited too long to snag an outdoor table.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/cVn9FMZqb-g5MTgM8mKyJQ/348s.jpg", "caption": "Baguette, beignets and an espresso macaroon"}]}}, {"review": {"des": "I came here after seeing that their yelp reviews were so great, unfortunately their macaroon werent!<br><br>Pistachio is my favorite flavor and usually the only flavor I get. The pistachio macaroons here were brown, unlike other places, green. It didn't look as appealing, so I decided to try other flavors. Lucky I did because after purchase a dozen of macaroons.<br><br>I tired the pistachio and it was stale! I thought that maybe they all just taste like that, so I tired another flavor and the others were fine, but not great like the ones I've tired at other places.<br><br>The macaroon are cheaper here, and if you check in you get one for free. But what is the point if they aren't even good.", "pics": null}}, {"review": {"des": "Wonderful delightful people working there,  fabulous breads and pastries,  delicious coffee and a cozy Euro patisserie ambiance.  We need one in every neighborhood.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/qU1cA14A5FGCGAzcQtBuJw/168s.jpg", "caption": "Can't get much more delicious and authentic bakery than La Fournette, mustaches and all!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/J0KMnPeEMEjt1rY_-L6h6g/168s.jpg", "caption": "There goes the benefit of my Sunday 7 am bike ride, but it's so worth it!"}]}}, {"review": {"des": "One of the best cafes in town, <br><br>My favorite item is the tuna sandwich, but everything about this cafe is amazing, from the great service, awesome friendly staff to the delicious and fresh food.<br><br>If you want to surprise your partner with a box of tasty and beautiful macaroon box, La Founette is the place. <br><br>Prices are affordable comparing to  competitors.<br><br>It's a family business, you can see the owner at the cafe greeting and talking to customers. <br><br>Finally if you want to feel Paris vibe you have to come and try this amazing cafe.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/U6XCTR_CjKrmwtHNcB2A2Q/348s.jpg", "caption": "Bûche de Noël (Yule Log) Chocolate flavor."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Dex1Cty-GOJ-7P7XUyN9NA/168s.jpg", "caption": "Bûche de Noël (Yule Log) Chocolate flavor. This cake is super delicious, make your order for your holiday table"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/otsQFCvTDjafBHhbyW0VZQ/168s.jpg", "caption": "Blueberry tart & Pistachio macaroon"}]}}]}