{"name": "la-nonna-chicago", "reviews": [{"review": {"des": "La Nonna is charming as it's tucked away in the middle of the Avondale neighborhood. The staff has always been friendly and the empanadas are amazing. <br><br>Other highlights:<br><br>- the coffee! nice and strong<br>- the pastafrolas are a delicious little jam pastry to enjoy with their coffee <br>- the chimichurri sauce that comes with the empanadas and on some of the potatoes<br>- the surprising amount of vegetarian options!<br><br>I personally love the beef empanada, but vegetarian friends I've taken loved the veggie cheese empanada.", "pics": null}}, {"review": {"des": "Argentinian food for lunch. The empanadas were delicious and adorable; the fact that the restaurant imprints their name in them is a great touch. Many in our group tried a varietyof their \"strong\" iced coffees. All were impressed. Of the six of us, 4 of us tried out different sandwiches. They were huge and yummy. Mine was a little rich with real butter, arugula, cheese and prosciutto. The papa rotas were amazing. The other two members of our party tried a steak and a breakfast plate. Even the presentation of the eggs was pretty. <br><br>The nice touches continued throughout the restaurant. The bathroom was quaint. The lights above the bar were made out of cheese graters. There was a rope map of Argentina on the wall and the music was Argentina as well. It was overall, a great start to our day.", "pics": null}}, {"review": {"des": "This place looks awesome, very cozy!! Picked up the chicken pesto panini w side of potatoes....delicious!  Menu had some great dinner options toThe lady who took care of me told me it's a BYOB place too.  She was very cool too.  I will need to return when time permits!! I can even walk to the place :). <br><br>Returned to the restaurant again with the family.  We ordered various entrees and sandwiches and all were happy with the their meal!! We got to the restaurant at around 8:30, places closed at 9, but the staff was really cool and patient w out party.  Every one enjoyed the decor and coziness of place!!  The chimichurri was excellent!!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/JfbsUgJHOJhNgZ9RbFO3JQ/348s.jpg", "caption": "Another view of restaurant."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/A55sEravPwREfVY_OaJWzQ/168s.jpg", "caption": "Our party.  We were last customers.... past closing time!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/hc7MXkcxbyRxoYlMfN0lOA/168s.jpg", "caption": "The Milanesa dinner, delicious!!"}]}}, {"review": {"des": "First time coming to La Nonna and I will definitely be coming back! The food was delicious! The staff was amazing (Viviana was wonderful).", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/llHtIymjwzzBxXImB7OhAw/348s.jpg", "caption": "Chicken borracho! This dish was absolutely delicious! Highly recommend!"}]}}, {"review": {"des": "nice establishment of the beaten path.looks like this place would be along the strip of chicago ave restaurants,but it is deep in the neighborhood.walked in and there was a few seats.attention and water came right away.waitress was very <a href=\"/redir?url=http%3A%2F%2Fnice.menu&s=74501ad5223492cc4bbe8f9e0bb345fd9af314c8a0bb7f090caeb1c2cc96aa54\" target=\"_blank\" rel=\"nofollow\">nice.menu</a> is pretty concentrated with not to much clutter.i had the steak breakfast sandwich,it was loaded came wiyh seasoned potatoes which were good to.cappuchino was on point.will return here.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/D68TLR3zbsoTTmBRPP1HTQ/168s.jpg", "caption": "steak sandwich..very good"}]}}, {"review": {"des": "Enjoyed having a minimal menu executed to perfection. The empanadas are a must, beef was my favorite. The homemade hot sauce could have used a little more heat for me but loved a made in house option was what was presented when asked. We dined-in and the local 'on-the-corner' vibes were delightful, walking distance from our air bnb. Could easily be your morning routine coffee stop. <br>Husband had the burger & I the skillet- eggs over easy adding sausage w/ a side of avocado. Hearty, healthy breakfast for my Paleo soul. Will return whenever we are back in Chicago!", "pics": null}}, {"review": {"des": "Are you into absolutely outstanding, affordable brunch food + empanadas? If yes, then you need to come to La Nonna! I heard so many good things from friends and people on Yelp, so I was coming in with pretty high expectations. And honestly, they were exceeded!<br><br>I'm going to walk you through my whole experience:<br><br>Finding this place was a little hard because it's in a residential area and blends in with all the other houses around. It didn't really help that it was surrounded by narrow one way streets (which also makes parking a little difficult). Despite all this, I found a parking spot and got to the restaurant relatively quickly.<br><br>My sisters and I were immediately seated. In line with the home-y exterior of this corner joint, the interior decorations make you feel at home. Pillows, benches, cute little light bulbs hanging from the ceiling, etc. Cozy stuff. <br><br>The menu is relatively small, which is great. I don't usually need an extensive selection of options as long as the restaurant has a few things they can make really well. My group collectively got a crudo sandwich, the triple chicken sandwich, the chicken burger, and the steak sandwich. It took about 30 minutes between the time we sat down and when we actually got our food. And the wait was so worth it.<br><br>The food blew my mind. The potatoes were perfectly seasoned and the sandwich was so crisp and flavorful and warm and good and wow. I tried everyone else's food and it was just as magical. Also, you MUST ask for the salsa. It is genuinely the best salsa I've ever had. And I've had a LOT of salsa. I don't say this statement lightly.<br><br>The service was really great! Servers were all very nice, attentive, efficient, refilled our water frequently, and were generally pleasant human beings. <br><br>I'm coming back here. Again and again. I was too full to try the empanadas and dessert, but I'm 100% getting both when I come back.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/-eE8sbJVjC82CJp4tNZ7hA/348s.jpg", "caption": "Chicken burger"}]}}, {"review": {"des": "I absolutely LOVE the atmosphere.  Small neighborhood restaurant with HUGE flavor.  <br>The service was excellent, considering there was about 6 tables and one waitress.  <br>The Choripan was delicious, as well as the steak Milanesa. <br>We also had three of the empanadas, one beef, one veggie and one ham and cheese.  All fantastic. <br>A hidden gem! Very cute place, right around the corner from me!! <br>We will definitely be back!", "pics": null}}, {"review": {"des": "Another great find in a small neighborhood.  You would never know it existed unless you were seeking it out.<br><br>We went for dinner and so glad we did.  It's a small place but was not overly crowded on a Saturday night.  We started with the appetizer - Picada Criolla - which was 2 empanadas, Italian Sausage, slices of cheese and salami/ham, bread, and a olive/red pepper/cheese salad.  It was large!  But it allowed us to sample many things.  We liked the flavor of both the beef/chicken empanadas and the sausage, but all definitely would have appreciated a sauce.  People raved about a spice/olive oil sauce that came with their empanadas, but we had nothing.  Maybe it doesn't come with this appetizer?  Definitely - you should ask for it.<br><br>For our meals, we got the Lomito special - steak sandwich with ham and egg and the Choripan - Sausage sandwich with salsa and chimichurri.  Both dishes were really good - especially with the homemade hot sauce they brought us.  Both sandwiches also came with fries that were nicely double cooked.  <br><br>I actually brought half my sandwich home and most of the fries for the next day's lunch.  To me, the Choripan was almost better the next day!  The bread is so great - not too hard that you can't eat the sandwich - just perfect.<br><br>La Nonna is perfect for any meal, and we would go back.", "pics": null}}, {"review": {"des": "This a cute, quiet little cafe with pretty good food, so if I was close by, this may be something I would choose. Also, it's BYOB!! However, it's not a place I would actively go out of my way to go to in Chicago. <br><br>I went as a party of three on a Friday afternoon for lunch, and there were plenty of tables open. We ordered three empanadas, two skillets (one with steak, one without) and one choripan sandwich, and it totaled about $60 all in. <br><br>The veggie skillet was good, but I didn't think it was anything special compared to other breakfast and brunch places. The potatoes were diced pretty large and were mushy, and I personally like my potatoes crispy. The garlic bread that it came with was more like toast that had garlic powder on it. The sandwich was delicious though, and the sausage in it was very well-seasoned. The fries that came with the sandwich were super crispy. The waitress also offered us the house-made hot sauce, which I thought was delicious, although it could use a little more heat. <br><br>The one thing I would change about my experience is the movie that was playing on the screens that I was facing. It was the movie Apocalypse, and when we were eating, I was watching people commit human sacrifices. To say that it put a damper on my experience is an understatement - I don't really want to watch people being tortured and thrown off a pyramid while I'm having a casual lunch.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/MeM--4skmgNWfft5iTFprA/348s.jpg", "caption": "I faced these two screens and the movie Apocalypse was playing. I watched humans being tortured and killed during the entire meal. Not cool."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/xYSLvdaROo33yfKWgkPLSQ/168s.jpg", "caption": "Choripan sandwich ($14.25)"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/RQBTKJCUXGJv1fvVLSxTgg/168s.jpg", "caption": "Veggie skillet ($12)"}]}}, {"review": {"des": "Super cute BYOB space for brunch or dinner. Ham and cheese empanadas with chimichurri are to die for and go with any meal. The pepper and egg sandwich is great and big enough to split between two, and the olive pizza was top notch with a unique flaky crust. Not sure why this place isn't more slammed on the weekends. The only suggestion is to dim the lights in the evening - it feels a little sterile but some mood lighting could do wonders.", "pics": null}}, {"review": {"des": "While visiting Chicago, my wife and I tried La Nonna and we're glad we did. We were told by our waitress Alejandra, that they've been open about a year. It's a small neighborhood restaurant and I can see why they're ratings are so high. <br>We started with the Proveletta (which is mozarella cheese fried in a cast iron skillet). It was fantastic.<br>We ordered chicken millenesa for our entree, it was unbelievable. The portion was so large that we took more than half of it to go.  <br>If you're ever in Chicago, go here for sure!", "pics": null}}, {"review": {"des": "Delicious place, large portion sizes and everything is made fresh. Had the lomito sandwich with papas rotas and my husband had the milanesa sandwich, everything was great and want to come back to try the media lunas and alfajores and the pizza for dinner.", "pics": null}}, {"review": {"des": "Veggie skillet was out of this world delicious with house made hot sauce! My girlfriend had the veggie omelette and thought it was pretty good too!! Great garlic toast and decent coffee! Service was a little lack luster but it was busy.", "pics": null}}, {"review": {"des": "My pic is of takeout, but I just ate there, and it reminded me that I need to write this \"ode to La Nonna\" (also, this is my first in a series of #foodandcomics reviews):<br><br>The chicken burger at La Nonna is the stuff off dreams. <br>I want you to remember the first time you remember thinking \"damn, that's delicious\" and just dig into that feeling.<br>I'm talking about, the first time you were able to appreciate a hot dog off the grill,<br>Or the first time you licked the ice cream that melted into your knuckles,<br>Or when you realized that melted cheese was a gift from the heavens, <br>THAT is the chicken burger at La Nonna.<br><br>Oh and the service is great, too.<br><br>Pictured: Chicken Burger and Drawn Together  by Minh Lê and Dan Santat. Drawn Together is a beautiful story about a young boy and his grandfather who overcome a language barrier, and connect through their shared love of art. Easy 10/10 for ages 6 and up.", "pics": null}}, {"review": {"des": "One of the best lunch experiences I've had in the area. My veggie panini was delicious, & the empanada was on point. <br><br>Update: 4/10/18<br><br>I had to come back to check out their veggie burger. God daaaaaaaaayum, that was the BEST veggie burger I've ever had in my entire life. It was an explosion of flavors. Everything went so well together. I also tried the flan, & it was delightful. This is officially my new favorite spot for lunch.", "pics": null}}, {"review": {"des": "Took the train here on our way to the airport since it  was an easy walk from the blue line. I had bookmarked this place after the rave Yelp reviews about the empanadas and steak sandwiches.<br><br>Came around 6pm on a Wednesday and was seated at a table by the stairs to the basement. We ordered one of each of the meat empanadas (chicken, beef, and ham & cheese). <br><br>Knew we wanted a steak sandwich but wasn't sure if we should get the lomitos or the milanese sandwich (they're the exact same thing except the Milanese is steak or chicken and is breaded, while the lomitos is just steak). After consulting with the waitress, Alejandra, who was super sweet, we went with the lomitos and a chicken Milanese sandwich.<br><br>The empanadas came out quickly, and came with this olive oil dipping sauce with basil (?). They were warm and crispy and flaky, and had a decent meat to crust ratio. They were good, but not the best I've ever had. Wasn't a fan of the sauce, since it was basically oil with clumps of the herbs.<br><br>The sandwiches came out shortly after. Each was served on a wooden platter/cutting board with a side of fries. Cute presentation. Both sandwiches were pretty tasty. The meat was well cooked and juicy for both. Neither were omg amazing to me, but my husband really liked both sandwiches (with the chicken Milanese being his favorite).<br><br>The fries, however, did not seem fresh. They were nice and crispy, but was a deep orange/light brown color, so at first we wondered if they were sweet potato fries. Nope, just regular fries that had maybe been fried before and then fried again.. or just left in the fryer for too long. But still tasty. <br><br>Overall, a good meal. Wish I could have raved about it (given that it has 5 star rating with over a hundred reviews), but I did enjoy everything.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/8Ud-mfWpXtm_j3LWzcToQw/348s.jpg", "caption": "The chicken Milanese sandwich"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/d0JQ_qkeRIM5b_0xOSKWgg/168s.jpg", "caption": "The lomitos sandwich"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/fBzGGnAtNSzQNqJQ6eEodQ/168s.jpg", "caption": "The empanadas.. steak, chicken, and ham & cheese"}]}}, {"review": {"des": "Food was okay, atmosphere was great. :) Friendly service, intimate vibe, and set right in a neighborhood. BYOB & will definitely be back! :)", "pics": null}}, {"review": {"des": "Excellent simple Argeninean Food!!!!<br>Great service with delicious food. If you are craving for a fantastic tostado de Miga or a milanesa sandwiches or a lomito.... this is your place!!!!", "pics": null}}, {"review": {"des": "Now for real people need to show up for this place. It's great food off the beaten path (a phrase I despise) and then you still have to walk a block over. A lot of thought and love went into this place from the décor to the concise menu.<br><br>It's sandwiches. It's burgers. It's pizzas. And it's a few entrees. The flavors are fresh though and Argentinian. Visited twice now and had the Lomitos, Choripan, and Cheeseburger. Be sure to make it all Especial meaning it comes with ham and a fried egg cause why not. Right? The empanadas too are pretty bangin' and in general I kind of don't really sweat them, from anywhere. Recommend the veggie and say pass on the chicken. Also don't play yourself and not order the Provoleta as an app. You'll never forgive yourself and neither will I. Basically just try everything. <br><br>The place itself is another solid date night spot. Nonna could easily be thrown in the mix in a hipster neighborhood like Wicker or Logan but appreciate where it stands. On its own no doubt. Visited a Saturday night thinking it would be jumping but really wasn't. Fine by me but I would like to see more life in there for the business's sake. <br><br>Great service. Great bites.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/LwNyYKmLaDfd3QAo5ARn9w/348s.jpg", "caption": "Burger Especial."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/bp3kHnLJJFmjLVs8CoQbhw/168s.jpg", "caption": "Provoleta."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/OwArLlhTt6Tk8KrF3BsyxA/168s.jpg", "caption": "Lomitos Especial."}]}}, {"review": {"des": "Nice restaurant.  I'll like to try more of the menu. My gf loved the Veggie burger. Said it was the best veggie burger she ever had. I took a bite out of it, delicious.  Definitely coming back.", "pics": null}}, {"review": {"des": "I don't like writing bad reviews because I know that sometimes restaurants just have off days. But after our experience here, I just cannot recommend La Nonna.<br><br>I went for dinner with a group of family members here because it had great ratings and sounded like a cool combination of flavors. We came towards the end of the dinner rush, so we got lucky and grabbed a small table in the front. We then proceeded to wait about 20-25 min for a waiter to come to us. I know they were busy, but we didn't even get water until I had to go up and grab one of the servers to get them to come to our table.<br><br>We finally put our order in for empanadas and main courses. We then had to wait almost an hour for the empanadas, followed by ANOTHER 30-35 min for food. So we wound up spending about 3 hours at dinner, of which over 2 hours was just waiting. I get that restaurants are busy and sometimes mistakes happen. But I just don't expect to go to dinner at 7 and be there almost until closing.<br><br>The food itself was good, but I would warn future eaters that the kitchen can get overwhelmed, even when there are only a few diners. If you don't have the time to wait, you probably want to look elsewhere for a meal.<br><br>Food: 4/5<br>Service: 0/5<br>Pricing: 3/5<br>Atmosphere: 3/5", "pics": null}}, {"review": {"des": "Pretty good brunch spot. Loved the empanada, it has the name \"la nonna\" embedded on it. The steak skillet is pretty good. The chicken milanesa is great too, the breading is crispy and flavourful.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/4DyuWVdfzuo4qEanqSokBA/348s.jpg", "caption": "Milanesa"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/kzlboPz5gWC6_wIiKZnDEg/168s.jpg", "caption": "Steak skillet"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Ov3Hk6WXWqC1EbeiAgg03w/168s.jpg", "caption": "Empanadas"}]}}, {"review": {"des": "Friendly staff, quick service, and great inexpensive food! This is definitely a hole in the wall restaurant. It is hidden off the main street and is the restaurant in that neighborhood block.<br><br>I really enjoyed the atmosphere. It had a chill,rustic look with all the wooden fixtures everywhere. For $2 you can get your choice of beef, chicken, ham, cheese, or veggies. The empanadas are amazing! So much flavor and not overcooked!<br><br>They also have various sandwiches and burgers if you are looking for something more American. I ordered the chicken pesto panini with fried potatoes. I would give this a thumbs up over the same sandwich i order at panera all the time", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/B_XYW4WavBtMUI0CsdGfeQ/348s.jpg", "caption": "Such a cool spot"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/KiVyqQV4DNuAzMx39MPrDg/168s.jpg", "caption": "Chicken pesto panini! Better than panera!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/99sw78kctBFNLauDLnmZcg/168s.jpg", "caption": "Beef and chicken empanadas! So delicious"}]}}, {"review": {"des": "This little corner nook has so much to offer in terms of flavor and service! The staff was very attentive and friendly; they kept waters topped off and asked if we needed anything often (without being overbearing). <br>The menu here is pretty simple- mostly sandwiches, burgers, and empanadas. No fuss here! I got the steak sandwich that was also stuffed with egg and peppers, and it was AMAZING. The only thing that can make this better is the homemade hot sauce that comes along with it. The sandwich was served with potatoes on the side which were also delicious. This is a really good item to try if you're a savory breakfast type person. <br>I will DEFINITELY be back to try their empanadas!", "pics": null}}, {"review": {"des": "INCREDIBLE! The food is amazing and the atmosphere is great. Laid back and relaxing. The best part? BYOB! Definitely recommend this place. Try the sandwiches, they're the best!", "pics": null}}, {"review": {"des": "I loooooove this place!!!!! Everything is soooo good! Definitely recommend the dulce de leche crape", "pics": null}}, {"review": {"des": "SO. GOOD.<br>I have been wanting to try this place out for a while and it was better than I expected.<br>The space is very warm, cozy, and comforting to be in. Lots of wood is involved throughout the decorations, and you can tell a lot of thought went into the design of everything. <br>There is a single restroom, which is small but very clean.<br>We went around 12:30pm on a Friday for brunch (which is served until 4pm), and there were maybe four other guests inside. The entire place is pretty small, and maybe would seat 20-25 guests max. <br>Food-wise, I got the Veggie Skillet with no cheese, my boyfriend got the Steak Omelette with Sweet Potato Fries, and my friend got a Clasico sandwich with Papas Rotas (which basically means amazing potatoes). <br>The food was out to us in a good amount of time, and it was delicious. I was particularly impressed by the spices and the sauces in the dishes. They make their own chimichurri (spelling?) and hot sauce, and brought it to the table. I put it on everything.<br>(Side Note: If you are sensitive to spicy, go easy. While the taste was amazing, I did unfortunately have a bit of a tummy ache after because of how much spicy sauce stuff I used.)<br>The service was wonderful. We were brought our check and told to take our time and hang out as long as we liked. When we did finally head out, we waved goodbye and the whole staff of the restaurant said goodbye back.<br>The menu is fairly simple, and provides many options for all eaters. Vegan, vegetarian, gluten-free, Paleo-friendly -- all can be accommodated. <br>I highly recommend La Nonna. Brunch was fantastic, and I look forward to going back for other meals in the future.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/_s_Jvf4vEKpM8T7R8heJKA/348s.jpg", "caption": "Restaurant front"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/b8fsuEyArf-o-OGoHZPBvA/168s.jpg", "caption": "Menu"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/L0NapNzKRshW94As-aKXcg/168s.jpg", "caption": "Another shot of my Veggie Skillet"}]}}, {"review": {"des": "Because we live a mere block away and this is the closest restaurant, we go to La Nonna at least once a week. Wait, that's not the MAIN reason!<br><br>We sometimes go first thing in the morning for a latte (and a heavenly croissant, which they only have on weekend mornings, if you want one you can't get there first thing (unless you are willing to wait) but also not too early but not too late or you'll miss 'em!), sometimes with relatives or friends. They know us by name, so friendly. <br><br>The food is always good. The empanadas and sweet potato fries are especially fresh'n'fabulous. Milanesa - steak or chicken - is marvelous. The salad is huge and the dressing subtle and mysterious, better with grilled chicken. Pizza, as you might expect, takes a little while but is lovely and tasty; one size sufficient for two people.<br><br>Although the surrounding blocks are residential-zoned parking, there is seldom a meter maid around. Maybe they have parking passes?", "pics": null}}, {"review": {"des": "Welcome to Avondale, La Nonna! Very friendly service and some of the best eats I've had in a long time. Some friends and I went this weekend for brunch and were all so pleased with the price point and just loved the food.<br><br>The recipes come from the chef's Argentine Grandma and his Italian mother-in-law, truly passed down with love. You can definitely feel some fusion mix in the dishes. La Nonna just opened last month in the 'hood and everyone is clearly enamored with this tucked away new spot.<br><br>This past weekend, I had the Clasico Sandwich with papas rotas for $7.50. I can't even put into how words just how good this sandwich was. Ham, cheese and mayo on toasted crust-less bread honestly never tasted this good. I don't know what kind of magic they put into their food but goodness! I have been craving the sammy ever since I had it. The potatoes it came with were so flavorful, they needed no ketchup or even their house-made hot sauce. Everything I had was so incredibly tasty...it's left me dying to try more.<br><br>Empanadas at La Nonna are better than 5411 (and better than my Argentinean Bro-In-Law's but shhh, don't tell him) and have cute branding for the restaurant right on them. They have 4 staple flavors- Beef, Chicken, Ham & Cheese and Veggie. I had the ham & cheese which was generously filled with good ingredients and a tasty shell. They also had a special empanada of the day- Caprese flavor. It was filled with cheese and tomatoes, open face, just fabulous flavor.<br><br>The restaurant was very accommodating of the baby in our party which is always nice. The only negative is that food took ages to come out (a couple that came in after us was finished eating before we even got ours), but everything was so good, all was forgiven when we finally bit into it. I'm interested to see if the quality keeps up at this newly opened spot.  Really loved the sleek look of this modern space - completely unexpected for a neighborhood spot. I will absolutely be back and hopefully VERY soon!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/BzoifJEVy7OO9rC4wYv4YQ/348s.jpg", "caption": "Cocido is bomb!!!!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/_iFD_QS2p_c7wMJdXbJJrg/168s.jpg", "caption": "Ham & Cheese Empanada ( with adorable branding)"}]}}, {"review": {"des": "This place is awesome , the food was great and in all honesty I wanna was surprised by how full of flavor the crepes were at the end , it put a smile on my girls friends face so what else can I say , it pleased me", "pics": null}}, {"review": {"des": "Such good food at this quaint little neighborhood restaurant. The veggie burger and sweet potato fries are my favorite and keep me coming back for more.", "pics": null}}, {"review": {"des": "Great spot! BYOB!! Great food. The empanadas and croissants are amazing. Highly recommend the beef, which is what I had, but I'm sure the others are just as good!", "pics": null}}, {"review": {"des": "My first Yelp review ever.  I love this place.  It's residential neighborhood setting, nice decor, warm hosts, music and noise level that means actual conversations can happen are all 5 stars.   And the food:  always delicious.  The BYOB factor means the cost is always modest.  We live 2 1/2 hours away from here but it is close to where our daughter lives and it is pretty much my first choice every time we visit Chicago.", "pics": null}}, {"review": {"des": "We live down the block and so come here a lot! It's the one of the best hidden gems. I love how low key and perfect it is. We always get the skillet with steak and a cappuccino along with the empanadas. The empanadas with the chimichurri sauce are a great appetizer. They're hot and the ham with cheese melts perfectly. I like to tuck in the chimmchurri sauce inside of it. The skillet always comes out hot and ready for deliciousness. The peppers are super flavorful and the meat nice and tender. Also the cheese adds an amazing flavor. I'm salivating thinking of it right now. The service is always helpful, kind and sweet and they're bilingual! I've come here with my bf and alone and the experience is always great. I highly recommend it :)", "pics": null}}, {"review": {"des": "Amazing...amazing...amazing! Great people, service, prices, portions, quality, decor and most of all food. Business very clean! We will be back soon! Highly recommend veggie burger and coffee!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/NNprskEfpg4IyldM7t9nUw/348s.jpg", "caption": "Empanadas. Ham and cheese shown and chicken. Chicken my pick!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/X3TH4OFkuXPLuj8bktUMDg/168s.jpg", "caption": "Crepe. Delish!"}]}}, {"review": {"des": "Empanadas that are yummy pockets of heaven, change your life level sandwiches, and Alfajores the size of hockey pucks.  It deserves every one of it's 5 stars.", "pics": null}}, {"review": {"des": "Cute little local place with good but not mind blowing food. BYOB, so that is a plus for people who like to drink on a budget when going out.", "pics": null}}, {"review": {"des": "Fist time here and I got a sausage skillet. Flavor was great and their homemade hot sauce was delicious. Skillet included fresh veggies (onion pepper,mushroom, tomato, spinach). Portion was very generous!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/7aCMSFqa9ji2gg9bWrCqzA/348s.jpg", "caption": "Sausage skillet: it was amazing!!"}]}}, {"review": {"des": "Was searching for a quick breakfast in the area and found this place. It's a very cute little cafe with awesome food. <br><br>I saw someone complain about \"too much seasoning\" in the breakfast skillet in a previous review, which BLOWS my mind! Lol! I'm not sure what the hell that means but I ordered the skillet and it was the MOST flavorful skillet I have ever had. The potatoes were cooked nicely with a little crunch to them, and the veggies were seasoned perfectly. <br><br>At first sight I thought it looked pretty small but it actually filled me up nice and it came with a side of like 4 or 5 little pieces of toast. I would definitely go back and try more and I'd definitely recommend for people who love FLAVOR!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/4G0wgvHcqTaFGCkIqWQO7A/348s.jpg", "caption": "Veggie skillet with toast! Sooo yummy"}]}}, {"review": {"des": "This place is 3 stars at best. From the mediocre service to the employees eating at the counter. Eggs over cooked and veggies cooked to hell. Coffee only comes around when your about to leave for refill. Don't understand the hype cuz I'd rather go to Denny's!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/EGFGWdAKOrqL_DKODVUycg/168s.jpg", "caption": "Steak sandwich"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/w1PoHb6jz50tBnsiXx4VXA/168s.jpg", "caption": "Sandwich was missing something, maybe a pinch of salt. Potatoes were perfect!"}]}}, {"review": {"des": "Come here if you want a tasty brunch that's not the same as every other brunch place. <br><br>I got the English style bread sandwich and the bread was so light and fluffy and so unique! The potatoes were very nicely seasoned too.<br><br>The argentine style croissant was sweet and delicious. Everything made in house!<br><br>I tried their ham and cheese empanada and it was just okay, but I usually don't like empanadas.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/KHspa3Z-jPS19IX7oY66EQ/168s.jpg", "caption": "Sausage omelet"}]}}, {"review": {"des": "Wow, food here is delicious!!! My mother is from Uruguay & I love milanesas.  Theirs may be the best one I've ever had.  The shrimp empenada was beyond good too.  It's out of the way, but well worth the drive!", "pics": null}}, {"review": {"des": "This place is amazing.  I have been here a few times and everything I have had was awesome.  The place is also very well done inside and they spent so much time making sure every detail is unique and perfect.  Anything you get here with steak is amazing.  BYOB.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/mv57Jbv-MZqBvdyo52KpfA/348s.jpg", "caption": "Steak sandwich. Minus the egg"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/KMzzz9XWMZUubwHSZJ3-PA/168s.jpg", "caption": "Steak sandwich"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/gYID2Z96oPM5QdwwrRXz8A/168s.jpg", "caption": "Steak skillet"}]}}, {"review": {"des": "Get the steak sandwich! Papas rotas are delicious too. So much flavor. The rustic industrial interior decor is lovely.", "pics": null}}, {"review": {"des": "I recently came here for lunch and it was amazing. The service is above and beyond excellent and the food was outstanding. I highly recommend coming here for lunch and I will be back again.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/NhausHsKG1U57clDUDXXGQ/348s.jpg", "caption": "Amazing hamburger with Fries. Just delicious and cooked to perfection!"}]}}, {"review": {"des": "Great to see another great restaurant in Avondale. This one is tucked into a residential area, so you'll have to work just a bit to find it, but you'll be well rewarded for your efforts. <br>This place has a distinct family run vibe to it that I love. It seems all the staff is very invested in the success of the business and proud of what they're serving. <br>My wife had the skillet, I had one of the paninis, and we shared an empanada. Everything was excellent, but the empanada (served with incredible chimichurri sauce) shined the most. I think next time I go back, I may just get several of those!<br>For the quality of food, the pricing was very reasonable. <br>I think the place could benefit from about 40% less decor. It looks a bit like someone's slightly scattered Pinterest became a room, but aside from that, my experience at this restaurant was tops. Check it out!", "pics": null}}, {"review": {"des": "Friendly and helpful staff. Cool decor. I couldn't decide between the Argentine sausage and the steak, our waitress recommended steak. The Lomito is steak, ham, egg, lettuce, and tomato with mayo on garlic bread. It was very good. You should eat this.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/oFAe2IpbJhC_N8fXcL6e_A/348s.jpg", "caption": "The lomito sandwich has so much going on I had to use a knife and fork."}]}}, {"review": {"des": "Amazing off the beaten track little bistro.  Hipster decor and very friendly. Food was great especially the sweet potato fries.  It BYOB so bring a few yummy beers with you.", "pics": null}}, {"review": {"des": "This is a small breakfast spot we found. It seats about 40 people. Friendly and comfortable place. Breakfast was good. Waitresses was very attentive to us.", "pics": null}}, {"review": {"des": "Disclaimer: I am Argentinian.<br><br>Came for some authentic Argentine food and was not disappointed.<br><br>Started our Sunday morning meal with a cappuccino and a factura. Facturas are traditional Argentine pastries typically eaten in the morning (we love our sweets). The factura I had was a media luna rellena con dulce de leche (croissant filled with dulce de leche), it may or may not be part of the menu but the Owner, also Argentinian, accommodated my request :) The factura was on point, true to what I remember eating in Buenos Aires, buttery, sweet, and filled with a quality dulce de leche). So good I forgot to photograph it. I highly recommend it.<br><br>Continuing with our sweets, we had the panqueque con dulce de leche (rolled up crepe with dulce de leche). The panqueque is accompanied by caramelized fruits (strawberries, pears, pineapple). La Nonna delivered.<br><br>We finished off our meal with some empanadas. We tried all three options (beef, ham and cheese, and veggies). The empanadas are fried and by the taste it seems to be fried in lard (Argentine style). The beef empanada is tasty and goes well with chimichurri. The ham and cheese empanada is also good. The veggie empanada is spinach and cheese, this was my wife's favorite.<br><br>Overall we enjoyed our meal and it's authenticity. We met the owners, had a good chat, and the place seems very homey. We look forward to trying out the various other options they have. Their menu changes after 4pm to a dinner menu with some classics like milanesa and grilled favorites like chorizo (Argentine chorizo in a baguette). The owners also mentioned they will be adding other grilled meat items in the near future.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Y2asViSTb7cfXS8Q0VwvYg/168s.jpg", "caption": "Empanadas and panqueque."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/8xdjp7wB5coHLencrzHyCA/168s.jpg", "caption": "Panqueque con dulce de leche"}]}}, {"review": {"des": "Dropped by on a Saturday morning for breakfast. Really cozy space and friendly wait staff. The service was really quick and the food was amazing. We had the steak skillet and the omelet along with some empanadas. Can't wait to go back to try out their dinner menu!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Dnhm2ePaQF-y7409F1L27g/348s.jpg", "caption": "Steak skillet"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ke4j3mB7p8KaRb8Udoy-zw/168s.jpg", "caption": "Omelette"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/bhO3xDAKzWvOXlK2LxnmjA/168s.jpg", "caption": "Empanadas"}]}}, {"review": {"des": "This place is delicious and a diamond in a neighborhood setting. You have to have the Lomitos sandwich (especial style.) plus, great service! I love it also because we live in the neighborhood and I feel like I found a golden spot!", "pics": null}}, {"review": {"des": "We came at about 11:30am on a Sunday, and had no wait for a table. You can tell that the owners put a lot of thought in the decor, with very nice results. To start with we had the beef and chicken empanadas, which were delicious especially with a bit of the chimichurri. Both fillings were very flavorful. For my plate I had the chicken pesto panini, and I loved it.The chicken was moist and the bread was nice and toasty, not soggy at all. My mom had the steak omelet, and the bite I had was fantastic! I will probably order that for myself next time I come. I absolutely loved the potatoes and the way they were seasoned. Staff was very nice and attentive. Now that I know they are BYOB I will have to come back with friends for dinner.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/QYr9eF-8_Y6yG0k-W_SIIA/168s.jpg", "caption": "Delicious beef and chicken empanadas"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/rFTpD3QBSz7X3jSg-ZfJUQ/168s.jpg", "caption": "Chicken Pesto Panini"}]}}, {"review": {"des": "Good first impression by this Argentinian place in the NW side. Good flavors and atmosphere to hang out. Try the empanadas, any panini, and tilapia sandwich with the roasted potatoes. <br><br>Service is a little slow although food did come out fast after ordering.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/GtbyiSLYxw6BBKThfrcoWw/168s.jpg", "caption": "Tilapia sandwich with papas rotas (chorizo potatoes)."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/s1BAgAqm2msmNqBPVk1AwQ/168s.jpg", "caption": "Empanadas."}]}}, {"review": {"des": "Great vibe. Smaller place but very comfortable. Has a new age cafe feel to it. Lots of light wood and low lighting. <br><br>Extremely clean.<br><br>Fresh squeezed juice is the best OJ I have ever had, no exaggeration. They had to have sacrificed 5 oranges to make this one glass.<br><br>Decorations are very suiting.<br><br>Food is great.<br><br>Menu is slightly limited but, for a smaller place and the quality of everything..... it actually is suiting. Fresh options on the menu. Unique options as well.<br>Service is great, very friendly staff, very attentive and accurate as well.<br><br>Give them a try!", "pics": null}}, {"review": {"des": "Wow, absolutely blown away with how delicious everything we ordered was. Flavors hit close to home. Loved the French press Maté and miga sandwiches! Wonderful service too! Super happy, will be back soon!", "pics": null}}, {"review": {"des": "1 of the best burger in Chicago the empanadas are wonderful and the service is very good <br>Coming at leastonce a week", "pics": null}}, {"review": {"des": "This neighborhood sandwich restaurant delivers great service and tasty food. Try the empanada was delicious. I don't think you can order a bad sandwich from this place. Everything I ordered was succulent and packed with flavor. The ambiance is appealing as well. Try it for yourself. Let me add that the service is good to.", "pics": null}}, {"review": {"des": "Had to try this place based on the yelp reviews and the fact that I am a serious sucker for empanadas. I was not disappointed. We ordered one of each empanada, and they were all very delicious, however the ham and cheese was my favorite. The pastry is just the perfect balance of salty and sweet, and bonus points for the stamp that labels the type of empanada on the pastry dough. <br><br>We also got the steak milanesa sandwich, which had great flavor and texture. I would definitely order that again.<br><br>The ham pizza we got left a little to be desired. I prefer a bit crispier crust - theirs is pretty soft. Also, they leave the green olives whole, which was kind of confusing because they just roll off the pizza and it could really use the salt in the olives to balance it out. So I ended up cutting up the olives, and that made it a pretty enjoyable slice. <br><br>I will definitely be back for the amazing empanadas and a sandwich in the near future.", "pics": null}}, {"review": {"des": "I discovered this place on Yelp! I'm always on the lookout for small, local business that serve homemade food. What made it even more enticing was the overall stellar, 5 star rating! <br><br>Upon entering, we were warmly greeted by a young lady. Their rustic and clean environment was a plus! Because we were in a rush, my sister and I decided to place a take out order.<br><br>My sister ordered a Clásico panini and one beef empanada. I ordered a Veggie skillet, one chicken empanada, and alfajor. We paid almost $30. <br><br>When we got to our destination and opened our take-out boxes, we were devastated! My sister's panini was charred, black on the outside and hard. My toast was also burned from one side and the veggies in my skillet were beyond greasy and mushy. What a disappointment! <br><br>Overall,<br>5 stars for service<br>5 stars for ambiance<br>0 stars for food", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/1dvB5cZm-SHV6j9rUR2JUA/348s.jpg", "caption": "Burned toast and greasy, mushy veggies"}]}}, {"review": {"des": "I am so excited that this wonderful place just opened up!!! I live nearby and there isn't anything like La Nonna in the neighborhood. It's tucked away on Roscoe, away from all the hustle and bustle of Belmont and Addison. The vibe is rustic and welcoming. I had coffee with a friend and then stayed after because I just had to try to the food as well... and it's DELICIOUS. I had the Chicken Pesto panini today and I can't wait to come back and try everything else on the menu. The owners are super nice too! <br><br>La Nonna is such an amazing addition to Avondale! It's a bit dangerous... but only because I will probably eat here 3 times a week. Hopefully they'll add some sort of frequent customer rewards program ;P<br><br>Check this spot out immediately!!!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/CUaA77lJnE3i0ovA0--Bgg/348s.jpg", "caption": "This is the Chicken Pesto panini and it is DELICIOUS"}]}}, {"review": {"des": "He food is delicious and it is so fresh. The empanadas and the veggie burger was a hit. It's a very cute rustic decor and you feel very welcomed. It a neighborhood gem and the service was great too. You can't go wrong, it was an amazing experience.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ag4sBSIm7XDww1Mn4tR3jQ/168s.jpg", "caption": "Beef"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/va4mOHdqo91Zi8arwSag8Q/168s.jpg", "caption": "Coconut latte"}]}}, {"review": {"des": "Wow - so pleased to have a place in the neighborhood! But, more than that, the quality is excellent! The empanadas were the best I have ever had, and our breakfast sandwiches were terrific (especially the side of potatoes). <br><br>Also - the restaurant decor is lovely. And their pastry case is filled with things I can't wait to try. <br><br>Highly recommended. But, like Chris R says, i also hope it stays low-key enough that there's always a table for me.", "pics": null}}, {"review": {"des": "This new restaurant truly defines what it means to live in Chicago ... La Nonna sits on the corner of a city block with neighborhood charm and appeal. The decor is awesome and the food is .... Freaking amazing , had the empanadas , the chicken burger and the tilapia sandwich. Simple ingredients done so perfectly , if you haven't been , please put this restaurant on your list !! Oh ,and they are byob which is always a plus !  I can't wait to try their pizza !!!", "pics": null}}, {"review": {"des": "The best pizza in Chicago!<br>The place is nice, the service is excellent and the food amazing. <br>Since the moment we arrived, there was a smile for us, the Margherita pizza was like being in \"San Telmo\" (BsAs) Argentina (I just went once, but it was the same marvelous taste. <br>One of the beat places I have been in Chicago.", "pics": null}}, {"review": {"des": "We've been waiting for this place to open and so glad it finally did! Went for dinner and tried a few fried empanadas (that came with chimichurri and were super tasty) along with the provoleta (which was delish and a far larger portion of cheese than two people can take down!). <br><br>For the mains we had the chicken milanesa napolitana and steak milanesa a caballo. Both were very generous portions accompanied by hand cut fries. All so good and walked out with leftovers. BYOB, charming atmosphere, friendly staff, and can't wait to return!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/brpcYGjgnBEP47EntDvmFA/348s.jpg", "caption": "Their current \"soft open,\" slightly smaller menu."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/RPlgK1p6RdMvess7ZdyhQA/168s.jpg", "caption": "Their current \"soft open,\" slightly smaller menu."}]}}, {"review": {"des": "Great service. Friendly staff and the food is great as well. Empanadas are a great start and actually the burger is solid!", "pics": null}}, {"review": {"des": "Super nice staff very helpful always checked up on during our meal and made sure everything was okay. Delicious food for the price! Great restaurant and super lowkey!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/0SrwlZqeM-faaP8H8xrOQg/348s.jpg", "caption": "Skillet!"}]}}, {"review": {"des": "Authentic flavors in the Argentine Empanadas in this very cozy neighborhood spot. Loved the chicken pesto sandwich with a distinct South American flare. The chimichurri was a delicious treat. Tried their semiluna or sweet pastry delIcious. Great cup of cafe con leche. The kind and attentive service was great. Loved the place.", "pics": null}}, {"review": {"des": "The most pleasant, quiet and friendly place to have breakfast. If you are looking for media lunas, or other Argentine delicacies,, call a few days ahead. The natives do not even know what they are.", "pics": null}}, {"review": {"des": "Ordered a pizza here. I use to live in Buenos Aires (Recoleta). Thus going into the restaurant I was curious to know would this pizza be (Italian or Argentine). It's 100% Argentine! The pizza really does taste authentic. The empanadas were very tasty as well. Great spot for dinner. Can you guys get Quilmes? ;)", "pics": null}}, {"review": {"des": "Sweet staff and very good food! So convenient because it's across from my sons elementary school", "pics": null}}, {"review": {"des": "This place is definitely one of my favorite places my husband and I and two kids went here for brunch. Empanadas were amazing! We got beef, chicken, ham and cheese. So yummy! I got the Milanesa cabello I think that's what it was called lol  it was delicious!!!! It came with over easy eggs on top with a side of fries geeeez! So good! The service is awesome very nice place over all! If I could I would give  6stars! This place is a must!", "pics": null}}, {"review": {"des": "It doesn't matter what time of day, La Nonna is absolutely incredible. Never have had a bad meal here. Breakfast, lunch or dinner the food has been on point. There's a reason this place still has 5 stars!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/_d0eWgItu5eCPNzSV8nd6g/168s.jpg", "caption": "Provoleta. So good you could solely come to this restaurant for it and it would be worth it. This pic was taken a bit ago but still good!"}]}}, {"review": {"des": "I been there in multiple occasions and La Nonna delivered time after time! From the thoughtful decor, to their outstanding service this is sure to become  a winner through word of mouth. I like the secluded, neighborly location in a quiet residential street. Menu offers great Argentinian café fare, but lacks salads & beverage options. Its short menu needs to be extended and I suggest their best selling items to be served all day. Currently good options overall but with some room to excel. <br>Food is always fresh and presentation very well- executed. Amazing empanadas, great locally resourced coffee , BYOB and free Wifi are some of the extra perks. Will keep coming back and most importantly recommending , as long as they keep their awesome service and improve their carte a bit.", "pics": null}}, {"review": {"des": "Had an amazing dinner at La Nonna this weekend. Its location is deceptive, well hidden from the more popular foodie cross-streets that have cropped up around the Avondale area. As a general comment, all portions except dessert are sizable, making this a great value on top of it being a BYOB restaurant! Such a cozy ambiance as well! Reminds me of what a typical restaurant in Buenos Aires feels like from our travels there. <br><br>We ordered an appetizer plate that included cheese, sausage, bread, olives and empanadas that in and of itself can serve as a main course. I've always favored baked over fried empanadas but those served here with the appetizer were wrapped in such delicate and crispy outer layer that made their taste and texture so pleasing in the mouth. That and a glass of Malbec was a great segue for my main course of chicken vesuvio that's one of the most flavorful I've ever tasted!", "pics": null}}, {"review": {"des": "Nice little cafe the empanadas napolitanas guauu delicious. The burgers are awesome  facturitas to die for with coffee. Choripan is also really good.  It's pricey though once and while I stop by with my family and share meals . My once a month stop because it's pricey. But worth it something different.", "pics": null}}, {"review": {"des": "Stopped by for lunch for the first time. The chicken burger was good. Let me tell you I'm a very picky eater overall. Chicken was tender and ingredients made the burger flavourful. Service was friendly and interior felt cozy. The bathroom was very nice and cool. Will be back!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/-A4B77mgHvUxaUqSnYwCZg/168s.jpg", "caption": "Cool sink"}]}}, {"review": {"des": "I moved in the neighborhood and been waiting for a good opportunity to eat there.  Well, my bestie came in from California and it was perfect timing indeed! We took a bottle of wine with us and were seated right away by a friendly waitress (who commutes from the south side everyday) .  She was patient and sweet describing all the things on the menu and we ordered the breaded steak plates.  Then a waiter came over to open up my wine and pour it into the glasses.  I asked him if the owner is Argentinian.  He says, I am he.  I felt like I was in someone's house having a great meal and a good time.  My friend who you may call a foodie had a fabulous meal. The breaded steak was super flavorful and hit the spot.  The empanadas are done so well.  You must try this place out!", "pics": null}}, {"review": {"des": "Hey everyone. Please go to this place. The food is good, the service is great, the decor is nice, and it's a real neighborhood place. We really must support cafes like this. <br><br>Last night Maria had the Chicken Vesuvius and I had the veggie burger. Both were delicious and so big we had to take some home. In addition we had the cheese appetizer which is amazing. Go just for that. All this plus BYOB.", "pics": null}}, {"review": {"des": "La Noona truly impressed me in the quality and taste of the food.  I ordered the chicken pesto panini, which came with a side of roasted potatoes and absolutely loved it!  All the ingredients were fresh and flavorful.  The bread didn't seem like mass produced bread, more like the ones from actual bakeries.  I was pleasantly surprised by the generous portion, too.  The restaurant is beautifully built, with a rustic and sophisticated feel - great place to eat in.  Can't wait to return and try other things on the menu.", "pics": null}}, {"review": {"des": "Our dinner here was excellent.  We got empanadas, prosciutto pizza, a large dinner salad, steak milanesa dinner to share with 2 adults and 2 kids. The empanadas were amazing-we tried one of each. The pizza was excellent, the salad was very good, and the steak milanesa was pretty good (and ridiculously huge).  We would have had enough food without the steak.  <br><br>We also had a crepe dessert that was phenomenal.  <br><br>The service was very good, and they even texted me menu a few minutes after I requested one through their FB page!!  <br><br>I'm so glad to see a restaurant at this location (walkable for us) and such a good one.", "pics": null}}, {"review": {"des": "Our first time at La Nonna.  It a wonderful neighborhood find.  The service is friendly and the food prepared very well. Definitely worth the trip!", "pics": null}}, {"review": {"des": "The traditional tea, the empanadas, the omelette and the super friendly waitress. This is a must for everyone who goes to Chicago and to this part of neighborhood.", "pics": null}}, {"review": {"des": "I've only been here for brunch, but let me tell you, this food is damn good. Plus the restaurant is BYOB! So you can bottomless whatever as you please.", "pics": null}}, {"review": {"des": "The reviews are spot on!  Amazing menu and the food is incredible. We had a steak sandwich, pizza and empanadas. Everything was amazing.  I found my new local spot. So Unique and delicious!", "pics": null}}, {"review": {"des": "Our first time at this new place and omg so good! We were their earliest customer for breakfast and the wait wasn't too bad. They gave us empanadas on the house! They were so good we had to order another one. I got the sausage omelet and my friend a pepper, egg and steak. Everything was really good, quality neighborhood food!", "pics": null}}, {"review": {"des": "We've been twice and the food is incredibly flavorful! I don't want others to know about it because it's just the right amount of busy now. We never have to wait. Our 15 month old loves the food too!! We will definitely be back and can't wait until it's warmer so we can walk!", "pics": null}}, {"review": {"des": "Happened to be in the neighbourhood when we got hungry and Yelped closeby restaurants. So glad that we chose this one!! Absolutely delicious. Very rarely do we find that everything we ordered (we ordered 5 things) is so flavourful! Discovered a new gem today :)", "pics": null}}, {"review": {"des": "We recently move to the area and were pleasantly surprised to find this amazing place. Superb spot for breakfast or brunch, with excellent empanadas, great coffee and smart service. The chicken panini was delicious. This is food made by human hands filled with love.", "pics": null}}, {"review": {"des": "First time there today and it was so comfortable and welcoming. The food was amazing and the service was very very good. The food tasted delicious and they have a really good selection of not only food but drinks including coffee and tea. I really enjoyed my experience. Great prices as well, which is just the icing on top of the cake. I recommend this place!", "pics": null}}, {"review": {"des": "Delicious. My co-workers and I have been here several times, and the staff and food are always consistently good.  I love meat, but their veggie burger is one of the best I've had. The empanadas, chicken pesto sandwich, and dessert pastries are also especially good.", "pics": null}}, {"review": {"des": "Great food and service. Interesting decor. Small restaurant with limited seating. Good coffee. Want to go back soon.", "pics": null}}, {"review": {"des": "Best Argentinian food around ! Love the empanadas  and tasty dishes all around ! Will be coming back often :) the service is amazing as well !", "pics": null}}, {"review": {"des": "Today was my first time here and I plan on returning next time I'm in town.  If you're in the area, you should definitely stop here.  I had the Chicken Pesto Panini and my mother had a hamburger. Both were great and the panini had a lot of flavor.  The seasoned potatoes had good flavoring but the fries were a little too salty and soggy.<br><br>The decor looked nice and service was very good.  I hope La Nonna stays here for a long time.  What a great addition to the neighborhood!", "pics": null}}, {"review": {"des": "A great little hole in the wall. Authentic stone baked pizza and a great chicken sandwich. <br><br>Definitely recommend if you're in the area. It's a small little quaint restaurant with a very relaxed vibe. The decor is very modern which is very much to my taste.", "pics": null}}, {"review": {"des": "First time having some Argentinian food and I was not disappointed. La Nonna is a cute little spot and had plenty of street parking nearby when we visited. I came here for a weekday dinner with my husband and had the milanesa while he had the milanesa a la napolitana (his was better) and some beef and chicken empanadas as appetizers. The fries that came with our meals was well seasoned and the empanadas were flavorful. All of the food we ordered was delicious and the portion size was pretty decent. I took about half of my meal home. <br><br>I've heard that the brunch here is terrific and I can't wait to come back and try it!", "pics": null}}, {"review": {"des": "Skillet was delicious, friend enjoyed their veggie burger. The place is so cute and cozy despite being in a slightly odd spot. It's surrounded by mostly residential buildings and a couple of schools which makes parking a bit tricky. It was mostly empty when we went so our food came out super quick, the server was so nice! Will be going back to try more of the menu!", "pics": null}}, {"review": {"des": "Everything there is just amazing, good service!!! I love chimichurri and home made hot sauce with empanadas. Definitely I'll be back!!", "pics": null}}]}