{"name": "la-scarola-chicago", "reviews": [{"review": {"des": "This is hands down my favorite Italian restaurant in the city, and that is coming from an Italian girl with a pasta obsessed family. La Scarola doesn't look like much from the outside but don't be fooled. It serves old school Italian favorites that have mountain-sized portions and delicious flavor. <br>I came with a friend on a weeknight thinking it wouldn't be too crowded and wouldn't need a reservation-nope, 45 min wait. As we were sadly figuring out where else we could go for dinner (we didn't have time to wait) Armando the owner came over and said he would be able to squeeze us in right now. We were thrilled to say the least!<br>They start you out with complimentary bread (and olive oil and cheese) delicious and fresh. I had a cup of the minestrone, which was so flavorful and full of veggies. <br>For my main course I ordered the penne with vodka sauce and meatballs. The vodka sauce here is amazing, rich and creamy. The meatballs come close to rivaling that of my grandma's-so so good!<br>The service is always amazing here and always crowded so make a reservation regardless of the day of the week. Will definitely be back again!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/PHV6w0xmi0sGJRLwx4bHXA/168s.jpg", "caption": "Penne alla Vodka with (best) Meatballs (ever)"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Lq89A3dQwrfblB-yeX5MGQ/168s.jpg", "caption": "Minestrone Soup"}]}}, {"review": {"des": "Dined here a few times about ten years ago and remembered it as being a cozy neighborhood Italian restaurant with a fun bar and good food. Visited recently with three friends, and it reminded me of the last time I was stuck in a middle seat on a 4-hour flight.<br><br>Whatever charm and authenticity La Scarola once had is finito. We waited 30 minutes for a 6:30 reservation, in an area so packed I could hardly turn around. Finally seated  in the main room where tables are so close my friend had to ask a guy at a table next to us to physically get up and move his chair so she could use the loo.<br><br>And if this wasn't enough, management ignored an unwritten rule: once you're seated, IT'S YOUR SPACE UNTIL YOU LEAVE. We were asked to move our table over to make way for more diners... not just once, but twice during our meal. (They don't even ask you to move at Chuck E. Cheese.) <br><br>Now on to the food. I'm Italian, I cook Italian, and most of the dishes on this menu are not made in a traditional way. Which would be okay if they were an improvement on the originals, but most are not.<br><br>Here's some of what the four of us ordered. Bruschetta and baked clams (okay). Steak Vesuvio, which arrived swimming in gravy (not topped with a sauce). Capellini Fra Diavolo (not spicy enough and the shrimp were overcooked). Goat Cheese and Broccoli Pasta (the clear winner). Sausage and peppers (good mix of flavors). Pasta portions are huge, and I think that's a big part of the draw. <br><br>The service was adequate, but the goal seemed to be getting us in and out as quickly as possible. I wasn't half way through my dirty martini when the appetizer plates were removed and the entrees arrived (even though we'd asked not to be rushed).<br><br>We were so uncomfortable at the table, we left without having coffee and dessert (my favorite part of most meals). So we walked across the street to The Dawson and had leisurely desserts, coffee and after dinner drinks in the bar area.<br><br>I can see from other reviews that a lot of people are fans. I can only add that if you're looking for faux Italian, huge portions, uncomfortable seating, rushed service and a slightly claustrophobic dining experience... you'll probably love La Scarola.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/f8-SbapI7HGB_jMhWurNPA/168s.jpg", "caption": "Sausage and peppers."}]}}, {"review": {"des": "My wife and I came in for the first time after one of our customers recommended La Scarola.<br><br>Didn't disappoint at all! <br><br>From our Baked Clams and Pasta Fagioli soup (Amazing) to our Chicken Parm and Veal Chop Dinner. Everything was delicious. Old school Italian food served with big portions and plenty of flavor. Had enough to take home for another meal.<br><br>Armando and his staff are superb and very knowledgeable and friendly.<br><br>Highly recommend and will be back for sure !<br><br>Mike and Vicki", "pics": null}}, {"review": {"des": "Classic!!!! Old school Chicago style Italian restaurant. A gem. Must go if you want to avoid fancy. But love food", "pics": null}}, {"review": {"des": "Four stars for the food, three for service.<br><br>We were seated quick and able to order fast. Served complimentary bread but it's nothing special and not as fresh as I would've hoped. <br><br>The menu items however were amazing! We got two orders of penne pasta with plain vodka sauce and the pollo a la man cow but with fish instead of chicken. Appreciated the accommodation great as I am pescatarian but the fish sounded delicious, as it was. Portions are giant! The piece of fish was about the size of the whole plate and the leftover pastas were enough to have a whole entire. This is definitely a place where sharing is a good idea.<br><br>The service was quick but nothing great. The fish fish was missing almost all the ingredients like olives and artichokes which is why the meal was ordered. They did bring out the missing ingredients eventually but I had to ask a couple different waiters until it was ultimately brought out between 5-10 minutes after being served with no apology which was kind of a bummer for me. Luckily the fish was super fresh but it would've been nice to have the full effect with it being cooked with all ingredients!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/dOeLym3FDtOzalrfjZpffw/348s.jpg", "caption": "Menu"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/6nPCFeays9Pb-8PJ1tX14A/168s.jpg", "caption": "Menu"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/zDhIUO1Od-vc0aFQCVIrsw/168s.jpg", "caption": "Pesce a la man cow, missing many ingredients listed on menu"}]}}, {"review": {"des": "Loved this very old style italian place. I had the shrimp fra diavlo which had just the right amount of spice and nice tomato sauce over angel hair, very big portion, i couldn't finish the whole dish. The wines by the glass were decent and that server suggested an italian varietal that was quite good. I felt as if I had stepped into Italy with some Chicago flair thrown in :)", "pics": null}}, {"review": {"des": "By far my favorite Italian place in the city that I've been to! The restaurant is a little cramped and smaller than I expected, but the owner and waiters take care of you so well. A friend and I were at a table by the bar where people were waiting to be seated. Who I think is the owner or manager, came by and told them to move away from our table. It was something small but I really appreciated them making the effort to make us comfortable in a tight space. How for the food, I had burrata which is my favorite. It came with tomatoes and balsamic dressing as well as some arugula. It was perfect. For dinner my friend and I split the ravioli and a risotto. We were so pleased with our food we had no complaints and were definitely in a food coma after. This is now my favorite place. Definitely somewhere you need to make a reservation so you don't wait to long! I went on a Tuesday night and it was packed!", "pics": null}}, {"review": {"des": "This place is more than just your average mom-and-pop Italian restaurant. It has that authentic homemade Italian ambience and I love that about this place. The food does take long to come out however once it comes out you know that it was made fresh and that's the reason why it took so long. All the ingredients in the recipe taste fresh and everything is piping hot. I was so greedy that I didn't even get a chance to take pictures of my food I only got A chance to take pictures of my appetizers, although it is a little ways out from the Chicago city center if I'm ever in Chicago I would definitely go back to this place for dinner the food is impeccable and the service is great as well.", "pics": null}}, {"review": {"des": "An absolute classic!<br><br>This is what my friends refer to as \"old school Chicago\"<br><br>The food is delicious and directly to the point.<br><br>There can be a wait so make a reservation.<br><br>The seafood pastas have always been a favorite!", "pics": null}}, {"review": {"des": "This is an awesome restaurant with outstanding food. After dining here on Friday night i was speechles. HUGE portions of awesome italian food. Motiff is Sinatra/ratpack heavy. Also rumored to be the hangout and favorite restaurant of the chicago outfit.  Reservations most certainly recommended. Very popular and busy!", "pics": null}}, {"review": {"des": "Website says open til 11. Tried to come in, was told they close at 10 \"sorry, we really need to fix that\". Yeah man, ya do.", "pics": null}}, {"review": {"des": "Great food and just a gem of a place!   Owner was so kind and everyone friendly.  Food was great.  I had the eggplant Parmesan and broccoli salad.  Yummo!", "pics": null}}, {"review": {"des": "Yeah, La Scarola still sucks.  Or I just have very different standards for \"fine dining Italian\" in Chicago.  Either way, I won't be going back.<br><br>I assume La Scarola was once a nice restaurant, but it's not anymore.  The food is not great, or even good really, and for $25 an entree it better be good.  Neither of us had eaten even half our food when the server came by to clear our plates.  Which shouldn't surprise me, they probably had two or three other reservations for this table at the same time.  Plus, we weren't going to finish the not so great food anyway.  <br><br>Make a reservation?  That doesn't matter, you're still going to wait a long time (45 minutes past our reservation time this go-round).   But is there plenty of space at the bar to wait comfortably?  If you mean at the bar next door sure, but Richard's probably isn't what you had in mind when you decided to go out for a \"nice\" dinner.  <br><br>The overstuffed chaos of this place really pushes me over the \"meh\" edge.  There is nothing enjoyable about having your chair bumped into every couple of minutes.  That was after we were asked by the staff to move our table over.  They asked *us* to move our table over.  <br><br>To be clear, I have no problem with a hectic, cramped, fast moving environment....but not touted as fine dining or a nice restaurant.  All I can think here is they are ripping people off with high prices, fast turnover of tables, overbooked reservations, and not great quality food.  It just rubs me the wrong way.  I'll gladly pay a lot of money for great (or even good) food but not when you keep me waiting, make the experience uncomfortable, then rush me out.  This was my last time giving La Scarola a chance.", "pics": null}}, {"review": {"des": "5 star reviews?  Really?  Total let down. Expected SO much more being everyone and their mother has raved about La Scarola and I've had it bookmarked for a few years.  Old school Italian spot with history and charm sounded good to me...until.....<br><br>We came here Sunday (after an opera) at 5:30pm.  I called to check if reservations were needed and guy who answered said I needed to talk to hostess but never transferred me.  Ok, no big deal.  We arrived with no reservations and were seated immediately. Not the best table as it was right off the entrance in middle of room, but hey, at least we had a table.<br><br>I'm gonna sound like an Italian snob here, but I have to say this is not traditional Italian and its nothing to brag home to your Italian mother.  In fact after browsing the menu and noticing preparation and ingredients of most dishes I was baffled.  It was a mish mosh of ingredients. Think we were better off with familiar, more simple dishes..who knows.<br><br>Our order was taken immediately.  Server was nice enough but you could tell they want to get people in and out because everyone in the city thinks this place is the Italian bomb. Food came promptly.  Appetizers:  Steamed mussels in white wine broth.  Best thing we had.  Mussels were very fresh, plump and cooked just right.  Broth was mild but good enough to dip your Italian bread in.  Speaking of this bread it was excellent.  Dark crust, exactly the way it should be.<br><br>Next up:  Escarole and sausage in a light tomato sauce. Very mediocre.  Didn't care for quality or texture of sausage and it was greasy.  You can go to a dozen Italian restaurants and taste the difference.  Grilled calamari was dry and completely unimpressive.  Don't waste your money on this.  Their house specialty: Pasta Fagioli (which I absolutely love) was very creamy / thick and somewhat salty.  Traditionally this is more brothy.  Good enough flavor, but not authentic in my opinion.<br><br>Deciding on an entree was tough.  I asked our waiter if the pastas were house made and he said no.  Only the ravioli.  Eggplant parmigiana was also a house favorite and I love this dish but wanted something more exciting so I went with the Pollo Italiano.  Sauteed chicken breast with sausage, diced eggplant, fresh chopped tomatoes, garlic and melted mozzarella cheese.  I should trust my gut more.  While the chicken was tender and cooked properly - this dish had absolutely no flavor.  Zero.  None.  You get a hearty portion but I only took 2 bites, couldn't eat any more.<br><br>He had the Vitello di Franco.  Breaded veal scallopini with asparagus, chopped tomatoes and a mound of arugula with melted provolone slapped on top.  When this was served, it looked so unappetizing.  It was as if they just threw a bunch of ingredients in the pan and called it a day.  Another very bland dish.  He couldn't eat any more of it.  <br><br>On the bright side, prices weren't outrageous. They took both entrees off our bill without hesitation.  Very nice gesture on their part and also the reason for my 3 stars. We weren't looking for anything free since we barely touched our entrees. <br><br>I think the main reason people come here is for the ambiance and old school charm.  Granted this restaurant has all of that, I'm just not sure why you'd return.  Food did nothing for me.  I could think of a few great spots with same ambiance for excellent Italian.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/m39HY4XWIDAwFQW_p9ThCg/348s.jpg", "caption": "Vitello di Franco - breaded veal scallopini, asparagus, tomatoes, arugula, melted provolone (bland). Served with side of risotto"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/CBooDJj2-ECItS9gxjRKRQ/168s.jpg", "caption": "Pollo Italiano - garlic, diced eggplant, tomatoes, roasted sausage, white wine sauce, melted mozzarella  (very bland dish)"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/SuOmOfQkN9CZw6maClJqFw/168s.jpg", "caption": "grilled calamari (not great, dry)"}]}}, {"review": {"des": "Well what can I say about this place , first of all I love all the pictures on the wall of all the famous people who have been there and the Italian music playing in the background makes you feel as if your in a scene of The Godfather movie .. <br><br>I found this place through Chicago's best .. and while the service is absolutely outstanding I feel that the food to be honest is just average , not bad ,but just average . I love Italian food that does not lack flavor ,this one didn't but I just feel that they have the potential to do better I know they can I want them too actually . <br><br>For example I ordered the penne a la vodka with shrimp which was like 25 $it was tasty but I feel that the shrimp was a little over cooked and I don't think it was necessary to really add asparagus as well as mushrooms I feel that it compromises the flavor so I just took all of  them out. But I'll tell you this much the other half that I left tasted delicious the next day .. my husband had a dish with chicken and pasta which was like 20 bucks in which he said it needed more garlic ,more sauce, or just a little more flavor and really for such prices you can spend less money making it at home .. but on the positive side the calamari was cooked well but just ask for marinara sauce . The sauce that came with it tasted funny . But the sausage with potatoes and peppers were delicious .. but hey it's a pretty cool place I say still go and create your own opinion on this place .. the owner who's name I forgot is a pretty nice guy .. and our waiter Mauricio was very attentive ..", "pics": null}}, {"review": {"des": "This place never disappoints from their great food to the exceptional service that is provided. The atmosphere is always great and you are treated like family. If you have a special occasion or want to bring out of town guests, this is the place.", "pics": null}}, {"review": {"des": "This place is truly amazing! While on a work trip in Chicago our friend, who lives in the area made reservations here. His family has been a patron at La Scarola for over 20-years. The wait staff was very nice, lovely atmosphere and the food is out of this world delicious. 10 of us at the table opted to share appetizers and entrees so we could try a lot of the different dishes. Everything I had was so flavorful and authentic. Oh! If you are too full after eating all the amazing food (all of us were) you still need to get a piece of tiramisu.  We had one piece and 10 of us shared it so we could each have one bite (we were so full). Their tiramisu is incredibly light and fluffy, the best I've ever had.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Tvbjm_hlLFCw9-dCdFcwlA/168s.jpg", "caption": "Yummy soup"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/6UQmFhwhPtWo1P7XzYQFEw/168s.jpg", "caption": "Clam linguine dish"}]}}, {"review": {"des": "Get the Chicken Vesuvio! Delicious! The only thing I would change about the dish is fewer potatoes. Over half the plate is potatoes! <br><br>The pasta is also solid and they have a nice wine list. The atmosphere is quite loud and very busy even on a Wednesday night, but it's an old school Italian place so it comes with the territory", "pics": null}}, {"review": {"des": "Amazing food, great atmosphere, a true Chicago classic! I have only had delicious meals here and have tried several dishes.  The fish entrees are my favorites but their specials are great too. One of my favorite restaurants in the city!", "pics": null}}, {"review": {"des": "Great comfort Italian food.  Although they take reservations it really doesn't mean much as this place is small and always crowded (rightfully).  It's nice to be able to go to bar next door to wait which they will come and get you when a table is ready for your group.  Have been coming hear for over 10 years when in town and have time available and free evening from other business obligations.  <br><br>The portions are large and prices very reasonable. Wine list limited but appropriate for the food and environment that has a \"local feel\" and not a tourist trap.  About $10 Uber ride from the loop.", "pics": null}}, {"review": {"des": "Wow. Was recommended to visit when we came to Chicago and what a huge disappointment. The owner was friendly although the service was below standards. 2 stars for the owner greeting us and for the cleanliness of the establishment. I will K.I.S.S this (keep it short n simple) the server had no personality and was unfriendly. I ordered the pasta with sausage and when my food arrived the pasta was cold/hard and sausage over cooked. I had to ask for more meat sauce and all that was brought to me was a bowl of tomato sauce (maybe I'm wrong although no meat in the sauce) my wife was not a fan either of her dish. We were disappointed in our overall experience. The establishment was packed which was great to see for business. We won't be visiting again. I posted a picture of my dish, not an attractive or mouth watering presentation. Hopefully the next guest has a better experience. SYOY", "pics": null}}, {"review": {"des": "This is thee best place for Italian food in Chicago, period. It's got that Brooklyn ma and pa hole in the wall and tough guy hangout feel but once inside, everyone in the La Scarola family has a heart of gold.<br><br>And Chef Armando has that touch of gold as his recipes has not waivered to trends or cost cutting but is as consistent and value minded as when I discovered L.S. 15 years ago. The bottom line is everything I've had here has great flavor and I know this is because you just want to keep on eating. Even when full, you wanna just keep nibbling and picking at the bread or something... <br><br>No one makes a better fried calamari with bits of garlic and parsley at the bottom of the plate. Or their grilled octopus where you actually get more than a few tentacles to leave you very satisfied before diving into your entrée.<br><br>My wife loves their Vodka sauce and I always get the white clam sauce linguini. Other hits are the Veal ala Gabe, chicken vesuvio with linguini, and any of their pasta dishes. They truly have this down home family small batch cooking technique down and I'm sure what's in their secret sauce is lotsa love.<br><br>Thank you LaScarola and may you bless us with another 18 years!", "pics": null}}, {"review": {"des": "This place is one of those old school Italian restaurants that makes you wonder why you go to the fancy ones too. The menu is simple and straightforward offering you a ton of noodle choices and traditional Italian fare. <br><br>My gal pal and I went during the week last week. We ordered the fried calamari to start. I'm sometimes hesitant to order calamari since it doesn't seem to vary too greatly from place to place, but I really enjoyed it here. For dinner, I ordered the plain 'ol pasta (I chose spaghetti noodles) with tomato basil sauce. The serving was absolutely enormous--definitely enough for 2-3 more meals. Overall, the experience was really enjoyable! My only complaint is that the area we sat in (the second room near the back) smelled pretty badly of cigarettes. Not sure if this came from the bar next door, but it was unpleasant nonetheless.", "pics": null}}, {"review": {"des": "There is such a charm to La Scarola. We came in on a cold winter night and were seated close to the door. I asked the waiter if we could sit further away, and right away the owner took us to a wonderful table near the back. Most importantly, they were happy to please us, not making us feel like we were making an annoying request. We had buratta, tortellini, and penne vodka. These portions were amazing- we had 2/3 for dinner and the rest is lunch for tomorrow! Within the restaurant, you can tell everyone wants to be there and truly adores the place. Now that I've had my first time, I can easily see myself being a regular. Felicia, our waitress, was great. overall we had a wonderful date night at La Scarola!", "pics": null}}, {"review": {"des": "We originally made our reservations at 5:30 on a Saturday night. They booked really quickly as the next available reservations was at 9pm. Our group got held up and we were able to manage to get all our group people to the restaurant by 6PM. They almost gave our table away. Luckily, they were very kind! <br><br>Our table was round but able to fit 11 people. We ordered very quickly as their specials sounded very delicious. The portion were very large. Many of us had to go our food. The staff was very attentive. The staff often will check up on us to fill our water or to see if everything was okay.<br><br>I ordered their special gnocchi alla Joe. I really enjoyed it. It had red/green pepper, red onion and sausages. The gnocchi was perfectly soft !<br><br>I would definitely come back here. If in a large group, reserve for sure.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/7OqpyAchqWXW2GB0n2IpzA/348s.jpg", "caption": "Gnocchi"}]}}, {"review": {"des": "The best in Chicago great home cooking, Sausages was delicious, Bake clams fantastic. Shrimp dish off the charts", "pics": null}}, {"review": {"des": "A perfect Italian restaurant... I came here with my husband. He insisted that it was one of his favorite Italian restaurants; with good reason. We've been here twice together so far, and each time was quite similar. We sat in same seats near the windows which had a bit of a draft. The same impatient waiter rushing us through our order at both visits. <br><br>Appetizers:<br>Octopus - one of my favorite dishes to order from restaurants... Very bland and chewy. I wouldn't order it again from here. <br><br>Entrees:<br>Eggplant Parmesan - first time eating. I was pleasantly surprised. I liked everything about it. It came with a side of pasta with marinara sauce which was also great. Only i wish the waiter had told us while we were placing our order because we ordered a side of pasta smh. Wasted money. <br> <br>Penne Alla Vodka - Very Good! No regrets. Order it it. Trust me. <br><br>Cool place. I would go back for the Penne but I'm not in a rush. 3 stars because the service was spotty and the octopus was a total miss.", "pics": null}}, {"review": {"des": "This little Italian restaurant was the best thing I've ever had. Kind of a wait and it's in a small place but so cozy and tasty. I usually give stars in service and food but this review is all about the food. The service was mediocre and we were sat waiting to order for a while and never got checked on for refills. The food was outstanding. Definitely recommend!!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ictS5QdH4IH80yka1iaVlQ/348s.jpg", "caption": "Pasta e Fagioli"}]}}, {"review": {"des": "I can't even believe I have never written a review for this place. (thanks for the reminder, Yelp). <br>A good friend of mine used to work here and I've been going here forever.<br>This is a  tiny and kinda shady looking hole in the wall that you would NEVER guess is so amazing. It's next door to Richard's Bar. (if you know, then you know). Don't let the exterior fool you, this place has been around forever and for good reason.<br>My favorite dish is the linguine and clams.  Absolutely ridiculously good.  The vodka sauce is also rich and filling and amazing.  Any pasta dish they serve, whether it be lasagna, bolognese, etc ; is perfection.<br><br>I have from time to time, branched out and ordered the fish special of the day and it's also been on point.<br><br>This place is TINY so I'd suggest calling ahead or be prepared to wait. Go next door to Richard's and have a drink. (but don't say I didn't warn you)", "pics": null}}, {"review": {"des": "Amazing pasta. This place is one of the best places I have been. Everything we tried was so good. I really liked their gnocchi.", "pics": null}}, {"review": {"des": "Absolutely love this place . I am a regular customer and always have the best service and best Italian Food. The Veal and chicken dishes are all fantastic <br>The pasta fagioli is the best around .  It gets crowded so best to make a reservation . Armando is the best", "pics": null}}, {"review": {"des": "Huge dishes for a great price. One of the best value Italian restaurants in the city. The food isn't just a great value though, it tastes great too. We had the pasta vesuvio (enough food for two meals) and the eggplant parmesan. Both were delicious. We also really liked the decor and ambiance of the place.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/TpU7tgTaHic0Ha4RrX9Chg/168s.jpg", "caption": "Eggplant parmesan."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/gFTmFuu2ZvQldms1NPreiQ/168s.jpg", "caption": "Pasta Vesuvio. Tasty."}]}}, {"review": {"des": "It was our 2nd time here and not as good as the first.<br>Overall, old school Italian and a good location before a Blackhawks game.<br><br>However, this time the GF pasta was underdone - chewy and a little grainy.  And the tables were so packed together that the staff kept bumping chairs as they were trying to squeeze between.  Finally, for some reason, several people in our party noticed it smelled like cigarette smoke, separately from each other.<br><br>Given the location and that we enjoy Italian, I will probably give them one more try.  Perhaps it was just an off night.", "pics": null}}, {"review": {"des": "This place is a dining experience! The Italian food was out of this world and I live near the North End in Boston. One of the best pasta dishes I have ever had! If you are visiting Chicago, I would highly recommend eating here!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/OacY3nxA5Nkvdb-n_xFTxg/348s.jpg", "caption": "Penne Alla Vodka and added shrimp!"}]}}, {"review": {"des": "Everything we had was fantastic! I had the gnocchi with chicken breast and Shelley had the Sea Bass - phenomenal!! This is an old-school Italian place. The portions are huge! All of the wait staff is also old-school Italian. Highly recommended! Thanks to our friend, Kathy, for the recommendation!!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/zawUM7lGt6Xh00DkyQlXqQ/168s.jpg", "caption": "Gnocchi with chicken breast!#"}]}}, {"review": {"des": "If I could give 0 stars I would. Called to change my reservation from 4 people to 5 people showed up at the restaurant and the man was nothing but rude from the minute I walked in. He told me to go outside and asked me why I was here and said he wouldn't take us even though I called and confirmed for 5. Told me to leave otherwise he would seat me an hour later. His attitude was so terrible I didn't even want to give them my money. What a terrible way to run a business. Can not believe the way they treated us.", "pics": null}}, {"review": {"des": "the vodka sauce here!! oh man these people aren't lying to you. GET IT! <br>I came here on a saturday evening with 2 of my friends, we had reservations for 5 PM and i'm so glad we did! the place was poppin' by the time it was 5:30 and we almost felt rushed bc there were so many people waiting to be seated! <br>This is a classic italian restaurant - italian food isn't my favorite so naturally i'm really picky about my italian food and la scarola did not disappoint! It's authentic and cheap compared to what you might pay at a not-so-authentic Italian place in the city! <br>They bring you bread to get you started, I ordered the chicken vesuvio for my myself and added the vodka sauce instead of whatever it comes with, and i'm so glad i did! the chicken and pasta were great and the sauce was creamy and delicious! it comes in big portions, definitely enough to share between two people. I would definitely getting a couple appetizers and sharing a pasta! I'll definitely be back!", "pics": null}}, {"review": {"des": "terrible treatment from the owner of the establishment. great food and have been before, but sadly will not be returning after the way we were treated. I wish I could say otherwise, but I won't give my business to a place that treats their customers with disrespect.", "pics": null}}, {"review": {"des": "I have wanted to go here for years. I have probably passed this restaurant well over a 100 times. My mother went here and liked it with friends during a visit years ago. We called and had a reservation. We showed up a little early even and had to wait 45 minutes passed our reservation time to be seated. This is good Italian food - not fantastic though. I am glad I finally went but am not in a massive rush to go back. Maybe, we will go back with our two young girls and do an earlier seating. I could see bumping it up to 4*", "pics": null}}, {"review": {"des": "This is a wildly popular Chicago institution and can be a great place to dine if you accept and enjoy the La Scarola experience on its own terms and ambiance. As another reviewer said, \"It's got that New York hole-in-the-wall and tough guy hangout look.\" The food is great. The portions are huge. The tables are packed in as close as a sardine tin and the noise level is deafening. The waiters are super efficient and have a great sense of humor. The walls are covered with photographs of visiting celebrities and politicians who have patronized the place over the years. Especially recommended -- the Eggplant Parmesan and the Penne alla Vodka.", "pics": null}}, {"review": {"des": "A great Italian restaurant which serves all the traditional classics in a very  gaudy photograph of celebrities on the wall environment.  I just love it.  I feel like I am actually eating in a movie sequence either in the Godfather or Goodfellas when I am here.  The food is great.  The service can be sometimes inconsistent depending upon how busy it is; however, the experience is always great.  The owner or main manager runs the operation like a professional corporation.  Everyone is treated with respect and there is a strong sense of collaboration and congeniality between the staff, which makes for the entire dining experience a pleasant one.", "pics": null}}, {"review": {"des": "We went here about 2 years ago, I couldn't remember the name of the restaurant to write a review! This place was amazing!!!!!!<br>  This is defiantly old school Italian! We walked right in and we're seated immediately. Service was perfect and food was absolutely divine!<br>  The clam and pasta dish was the best I have ever had, my husband got chicken piccata and he loved it. I can not remember what my kids ordered but we all left full as ticks and very happy! I would order to split, portions are very generous!!<br>  I would highly recommend this bustling, eclectic, Italian gem that appears to be frozen in time.  Enjoy! Ciao Bella!", "pics": null}}, {"review": {"des": "No reservations accepted and we had to wait until our entire party was there to be seated but it was WELL worth the wait! The gnocchi was delicious as was the asparagus salad. We were there with three people, ordered two pastas and still had<br>Plenty of leftovers. Really great vibe too with all the photos of everyone who had been there but very unassuming from the outside! Don't be fooled though, it's absolutely worth a visit !", "pics": null}}, {"review": {"des": "Great place. The staff are very friendly and the food is delicious. We were there last night (Wednesday) and it was PACKED - on a Wednesday!! The food was authentic and awesome. La Scarola is a staple on Grand. If you like great Italian food, this is your place!!", "pics": null}}, {"review": {"des": "The food was excellent and the service was even better! You will be treated with the utmost respect as if you are in a five-star restaurant but the catch is, the place doesn't truly look like much. Without the frills that fancy restaurants have, La Scarola makes the best pasta hands down if you are looking for something authentic and true to taste. <br><br>I recommend making a reservation since we had to wait about an hour before we were even seated (and yes, we did have a reservation). If you're going with a group, I recommend bringing cash because they are not able to split the bill unless it's evenly split. So the person in your group who only had the ravioli, will still be paying for everyone else's dish as well. Make it easier on yourself and bring cash. Overall, great atmosphere and great food. Definitely recommend this to anyone who has not tried it before!", "pics": null}}, {"review": {"des": "This is a hidden gem (seriously we had to figure out which door it was) but was a lovely place for my friend and I to have dinner. It's a tight squeeze in the seating so expect to sideways shuffle to your table, but it's an authentic neighborhood type place with photos of all the presidents and celebrities who have visited. The kitchen is flexible on orders as well, want chicken instead of veal? Just ask. The portions have leftovers for a couple more lunches, and the freshly made cannoli was a great ending to our meal.", "pics": null}}, {"review": {"des": "Food was pretty good and service was quick. It was a bit salty but maybe that's how people like it. Even in the middle of the week it fills up by 6pm so make sure to call ahead and get a reservation. Ventilation in the kitchen could be improved. We left smelling like the restaurant on our way to see a show in nice dress clothes.", "pics": null}}, {"review": {"des": "Couldn't say enough great things about this place!!! <br>If the food wasn't enough, the service was AMAZING! We were treated like family and everyone was so friendly and attentive. They put us in a great mood! <br>We started with the escarole and beans, mussels, and grilled octopus. All 3 were DELICIOUS! <br>The spaghetti and meatballs tasted like a real authentic recipe and the linguine with clams was the best I've ever had! <br>We ended with tiramisu and it was wonderful!! It wasn't too heavy at all. It was very light and I could eat it all the time! HIGHLY recommend this place if you visit Chicago!", "pics": null}}, {"review": {"des": "This is the Italian restaurant that all other Italian restaurants try and become. Walls are lined with an eclectic mix of photos of patrons of the restaurant mixed with old school photos and posters. I felt like I was back in the early 1900s in the restaurant an Italian immigrant would have opened just after arriving in the US, and it felt like home. <br><br>This place is small, yet warm and inviting. It's bar section is about as long as I am tall, and tables are placed in every free space in the place, which they need to do because this place is busy. All the time. So if you want to dine here make a reservation. But don't look at OpenTable or Yelp, you have to call in and will likely talk to the owner to book your table for the best Italian meal you've had in a while. <br><br>Armando Vasquez is the owner and he is front in center when you walk in, greeting the onslaught of regulars and welcoming new customers like you walked into the front door of his home. <br><br>But enough about the location, let's get down to the food. <br><br>We got the lasagna and the penne alla vodka. The lasagna is a huge portion, towering over the plate smothered in marinara sauce that you will want a loaf of bread to sop up anything leftover with. They get the balance of cheese, pasta and sauce right here. No one wants dry lasagna or a giant ball of cheese in between sheets of pasta. This lasagna is something you will make a special trip here just to get again. Perfectly seasoned, and piping hot it's the best lasagna we've had. The penne alla vodka comes heaping on a plate that you would think is impossible for 1 person to finish, but you were wrong. Filled with huge shrimp, asparagus and mushrooms in what I can only describe as a heavenly vodka sauce I found myself cleaning the plate before I knew what had happened. <br><br>Please make sure you save room for dessert. A legitimate cannoli (not the overly sweet Americanized version chain locations are peddling) and the spumoni ice cream will end with you asking them if you can get a pint to go. <br><br>La Scarola is beyond a restaurant, it's an institution, and one you need to seek out and see for yourself.", "pics": null}}, {"review": {"des": "Great service, amazing food and a pleasant environment. Also a great value. Coming back soon.", "pics": null}}, {"review": {"des": "Finally, I got to experience one of the infamous Italian restaurants in Chicago, La Scarola. After hearing about La Scarola multiple times as a legendary Chicago restaurant that delivers huge/classic Italian dishes, I eventually had to experience this for myself. I am also a big fan of the food shows, especially Food Paradise on Travel Network. La Scarola was recently featured for the best chicken dishes episode with their Chicken Vesuvio. Home to a handful of original dishes such as deep dish pizza, Chicago hot dog, Chicago mix popcorn, Chicago is also home to the creation of Chicken Veusvio. After seeing La Scarola's Chicken Veusuvio on TV, it left me drooling and craving this dish.<br><br>After careful consideration and multiple other reservations, my girlfriends brother decided enough was enough and chose La Scarola for his birthday dinner. After hearing we were going to La Scarola I was thrilled because I could try another new restaurant, which also means another Yelp review!! I was also excited that we were going with a large group of 10, and ordered family style which means you can try more items on the menu. I was surprised that we were able to squeeze in a party of 10 as La Scarola does not have too many tables. My girlfriend has two brothers whom both have girlfriends and we were also joined by their Cousins who just moved to Chicago from New York. With some of the best Italian food in the world in New York, the bar was set high to inpress the NY transplants. I can confirm that they were both happy with the end result and said La Scarola compared with some of the best Italian in NYC! <br><br>As you can see from my pictures, La Scarola defines an old school Italian restaurant. With the 50+ year old sign outside and pictures littered throughout the restaurant, La Scarola delivers a memorable  experience that many people have enjoyed for generations. I am a huge fan of the famous photos of diners and La Scarola has some of the best pictures around town. I believe that even Frank Sinatra and the old Chicago mobsters used to enjoy their fine Italian wine, cigars and meals here and it was their go to Italian.<br><br>Let's get down to busienss and talk about the meal. Everything was pretty good but was not the best Italian that I have ever enjoyed. What I enjoyed the most was the bruschetta wih the homemade bread. The bruschetta apprtizer was the best that I have ever had. I also really enjoyed the Tiramsu as I ate about half of the huge picture that you can displayed with my review. I thought the rest of the appetizers and entrees (pasta, chicken) were all pretty good but I would not be running back here for. I definitely thought thay the pasta would be my favorite dish here but it did not impress. The chicken vesuvio was also good but I thought the dish would be incredible. The go to for chicken Vesuvio is at Erie Cafe.<br><br>I am going with a 4 Star Rating, rounding down from 4.25 stars as everyrhing was very good but I am not sure if I would go back. If I was going to compare La Scarola with other Italian restaurants in Chicago, I have to say that I prefer Monteverde, Topo Gigio, Viaggo and Piccolo Sogno. The bottom line is that La Scarola is a must try and go to Italian restaurant in Chicago!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/8-4vbmvJ6wsS0TcKaDSVPQ/348s.jpg", "caption": "Penne a la Vodka w/shrimp England Parm"}]}}, {"review": {"des": "Oh man, loved this place.  We showed up a little early for our reservation.  We were asked to come back sbout 10 minutes after our reservation time which worked out great as there are a couple of cool bars right next door.  Came back and were seated immediately with  a great table for my wife and i and my son.   Great host, gave both my wife and i a shot of bourbon as we were seated for the little wait we had i guess. Terrific food, terrific service.  Super fun atmosphere.  My teenage sons first experience at a fun Chicago italian restaurant and he really enjoyed it.   Would recommend to anyone who likes to have good time.", "pics": null}}, {"review": {"des": "if you want authentic pasta, are very hungry for a great price this is your place!!! We were visiting Chicago for the weekend and had been recommended to eat here. Very impressed with our dinner. We had a late reservation and this place was very packed and loud (didn't bother us). My husband and I very much enjoyed our dinner.The bruschetta was perfection.  <br><br>MUST NEED A RESERVATION! <br><br>ORDERED:<br>Bruschetta<br>Pasta Lorenzo -sans shrimp <br>Spaghetti Loquercio <br><br>*I found out after I could have added cheese to the Lorenzo and baked it - I probably would bake it next time*", "pics": null}}, {"review": {"des": "~~~DON'T GO~~~<br><br>My hope is that this review saves many other people from the experience we had. Quite frankly, this restaurant does not deserve the patronage it receives. <br><br>After over a week, I am still disgusted with how we were treated. We were a party of four, in town for the Chicago Marathon. I made the reservation over three weeks prior. The process is simple. You call in and someone writes down your name/time. Unfortunately, there is no paper trail. <br><br>We arrived about 15 minutes early after having trekked across town in the pouring rain after seeing Hamilton and were anticipating a good meal. The person who greeted us at the door stated that he was the owner, Armando Vasquez. I let him know that we were a little bit early and expected them to either accommodate us or let us know that we needed to wait until the appointed time. I never expected to be denied entry, which is exactly what happened. <br><br>As if that weren't bad enough, he was extremely rude about it. He said that we didn't have a reservation and I shared with him again that we did. I attempted to show him where I had confirmed with my friends that the reservation was made via text and he told me that anybody could have written that. I said that was true, but why would I send my friends a text over three weeks earlier just so that I could pretend to have a confirmed reservation on that day? It made no sense. He said that my name wasn't on the clipboard and I asked if I could view it, thinking that maybe there had been a communication error and my name was not recorded correctly. He pulled the clipboard to his chest as if we were up to something nefarious. <br><br>Things continued to go downhill from there. All we wanted to do was eat before running the race in the morning. He treated us like we were scum off of the street, as if our money wasn't good there. Completely ridiculous and offensive. Who treats customers this way?!<br><br>Please spend your money elsewhere. That's the only way to show people like Armando Vasquez that service matters. There are plenty of other reviews that share similar situations. Take heed!", "pics": null}}, {"review": {"des": "Wonderful place with lots of local flavor, great food and a fantastic staff.  Highly recommended by others and now I saw why .", "pics": null}}, {"review": {"des": "As an Italian-American from New York, I felt very at-home at La Scarola because of it's tight quarters, packed tables, and the amount of people at the restaurant who knew each other and were mingling across tables while dining- it felt like a hub for those in-the-know. I ordered spaghetti in white clam sauce and it was tasty! A little garlic-heavy. My boyfriend ordered ravioli and he devoured it. Other members of my party ordered the daily special, which was a pasta full of seafood. Everybody had rave reviews for their food!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/K-5sd1hKa66YSa8hVUF0jw/348s.jpg", "caption": "Partially-eaten spaghetti and Clams in white sauce!"}]}}, {"review": {"des": "O my gosh yum! We met friends here for dinner Sunday night and it was amazing! An amazing family run resturant, that is cozy and delicious. I had the linguine with white clam sauce and they brought me bread for dipping. It was so declious and super fresh! The flavor and spices were amazing.  <br><br>My husband had the lasgana, our friends ordered the chicken special and the penna alla vodka which they loved. There was some silence at the table when the food first arrived.  We will definitely be back and a great neighborhood gem in a new area of the city we don't explore much.", "pics": null}}, {"review": {"des": "This was such a great dinner, we loved every part of it. As a visitor, this was well worth it. A Chicago bartender we had elsewhere had recommended La Scarola, and I'm so glad we went. <br>The place was packed on Sunday night, but our reservation was made and they graciously sat us right on time. Now it's a crowded restaurant, and so old school in decor. Check out their web site and look at pics there and on Yelp. We had a nice 2 top next to another table, and every other table was filled with many boisterous, happy customers. A liitle loud, but hey it's part of the charm. <br>The food was OMG good! I had read other reviews about the grilled octopus appetizer, and having tried octopus only once before we had to order it. We also started with fried zucchini. Both dishes were served hot and pleased us. But that grilled octopus, damn good, just close your eyes and enjoy. Meaty, tender, moist, with a perfectly grilled texture.<br>For entrees we had the veal marsala and the penne alla vodka. Both were huge servings, and served perfectly hot from the kitchen. Winner - penne alla vodka!!! Wonderful creamy sauce, with large shrimp, mushrooms, asparagus, and arugula. Wow! Just amazing!<br>We ended with a moist, creamy cheesecake and tiramasu. A sweet ending to our Italian feast.<br>Loved La Scarola!  Service was good, with friendly,  attentive servers. But the food was all that made it outstanding. This was the most authentic Italian food we could hope for, and the experience was really good. Definitely recommend to all,  and if we ever returned we would go back.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/EfPEY-K6oJtC_xGACy4a7w/168s.jpg", "caption": "Fried zucchini."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/RqQWuGKYupmpduDpG9yC4Q/168s.jpg", "caption": "Grilled octopus,  try it,  you'll like it."}]}}, {"review": {"des": "everyone that i've ever taken here has enjoyed this place.  if suggest asking for menu recommendations from the staff.  they haven't steered me wrong yet.  great people.  delicious food.", "pics": null}}, {"review": {"des": "La Scarola came highly recommended from a couple of food junkies I know. One of them truly swears by the place and is one of his favorite places to dine. I introduced the idea of coming here to some friends of mine for our monthly dining series and it was a go!<br><br>We had a 7pm reservation on a Friday night and the place was expectedly packed. I was told to stand near the bar area, (which was very tight due to spacing) until our table for 5 was ready. It took them maybe 15 mins to get an open table ready as I mentioned it was packed as hell in this joint. Once seated me and one of my friends ordered a bottle of Cab Sauv to start off. Menu looked awesome, but one of my buddies that recommended the place told me its always better to order from the specials menu here. I took his advice and ordered a seafood pasta dish that included mussels, shrimp and scallops and it was pretty good. Was one of those dishes that was very filling but you couldn't stop eating. One of my friends got the lasagna and while it sounds like a basic thing to order, it was awesome and huge! Everyone enjoyed their meal. Portions here are very big so you may want to consider sharing especially if you are on a date. <br><br>The place itself is very old school Italian as I think everyone that worked here was truly Italian. I know our server had a very thick accent...he was a very nice guy. Not a lot of standing space inside so if you are waiting, it may make more sense to stand outside. I'm definitely coming back here to try more stuff.", "pics": null}}, {"review": {"des": "This is the best authentic Italian food in the city. I came here for my birthday and it did not disappoint. We started with the calamari which was excellent and cooked to perfection. I had the penne vodka which was out of this world. Portions are huge, so I was able to take it home and of course eat it the next day since it was just as delicious. We had dessert, chocolate cake and cheesecake that were wonderful. I will continue to come back here as it is one of Chicago's best restaurants!", "pics": null}}, {"review": {"des": "Unfortunately this place doesn't offer a cocktail menu, but the food makes up for it. Hands down to the best Spaghetti Amore I've ever had!!! If you are in a mood for GREAT Italian food, La Scarola is definitely the place to go to!", "pics": null}}, {"review": {"des": "We came here for dinner on a Friday night. We had a party of 2 and I had made reservations about 1.5 months ahead.  We walked in and told the person at the door we had reservations, and he kind of just laughed at us and told us to wait by the bar. We waited another 20 minutes and then were offered literally the worst table in the restaurant--next to the bar and in the hallway where all the people walk and where people's jackets are on you as they wait and while you're eating. As first timers, we didn't know better but I would NOT sit there if I were you. Wait even longer...even though you have a reservation...<br><br>Service was rushed. We ordered the calamari and bruschetta. The calamari was lukewarm and super rubbery--straight up bad.  The tomatoes on the bruschetta were very finely chopped, so they tend to spill everywhere as you bite into a piece, and overall the dish was bland. While we were still eating the appetizers, the waiter brought out the pasta, so we had to cram all 3 dishes onto a small table that seats 2. We were rushed in and out in about 40 minutes--guess they were eager to seat another pair of people at the newbie table.<br><br>There were only two good things about this experience. We shared the penne alla vodka, which was tasty. The olive oil they provide with the bread was good. That was literally it. I could tell this place was popular, but I just don't get it. Spend your hard-earned money somewhere else.", "pics": null}}, {"review": {"des": "My go to place for Family style Italian food. Everything is so good here. I really like their grilled calamari, egg plant parmigiana, rigatoni add sausages to name a few. I gave it a 4 star is because of the service. Even with a reservation and arriving to the restaurant on time, expect to wait at least 15 mins or more for a table. Even so, I will be back!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/-Tci69H3Z7EJcrYMFZGwLg/348s.jpg", "caption": "Grilled calamari. So good!"}]}}, {"review": {"des": "Just what you would expect great food, old school Italian atmosphere with with an incredible staff.", "pics": null}}, {"review": {"des": "Had been meaning to come here in like the longest time.La Scarola was bookmarked for like 2 years on my Yelp after one of my Yelp buddies recommended them.So naturally as a seasoned Yelper I started doing my homework.Read all the reviews and history as well as asked around.Heard alot of great things.Im soooo sorry it took me so long to come here.It was all that and then some!!!!! The food was outstanding.I went all out!!! Had appetizers,entree and dessert.That shrimp armani was just PERFECT.I dont know where the hell they get their shrimp from but these shrimp were HUUUUGE!! Big,plumb,juicy shrimp!! I was in absolute HEAVEN.The place itself is not a fancy upscale place but Trust me,its a classy place.Not a dive at all.What struck me the most was the service.I didnt have just one waiter.Its like I had a WHOLE FAMILY of servers attending me.It was my waiter,the busboy,waiter #2,waiter #3 and waitperson #3 all making sure I had everything I needed.My wine glass was ALWAYS full.lol.I sweeeaaar I was expecting to pay about $150.Noooope.My bill was only about $80 and I ate like a king(and drank lika' fish.hahaha!!!) It was like EVERYONE was attemding me.I had bread,wine,food,EVERYTHING!!! It was like a family taking care of me at their house.I absolutely LOVED my visit.And Im DEFINITELY telling EVERYBODY!!!!", "pics": null}}, {"review": {"des": "Excellent! Great food and fun! Armando is the best! Highly recommended. Been coming here for a long time. Best Italian food in Chicago.", "pics": null}}, {"review": {"des": "La Scarola is one of the better Italian restaurants in Chicago. Their food's pretty good. They have a diverse menu and their portions are big.", "pics": null}}, {"review": {"des": "This is the type of place that you hear about from a Chicagoan while you're in town.  They say, \"Oh, if you want good Italian, you gotta try La Scarola's.  Now, it looks bad from the outside...\"<br><br>I love those places.  I love spots that look like a total dive from the street, but inside it's all about the food.  Sure, the tables and chairs could stand to be updated.  Yeah, the pictures and paintings and murals are hand-done, fading, and outdated.  Okay, so it's cramped and crowded inside.  Trust me, once you start eating, none of that matters anymore.<br><br>I had the lasagna, as it's my litmus test dish of any Italian place.  I was floored.  It was a symphony of flavors and architecture.  Each layer is given complete attention, and the end result is nothing short of perfection.  This was comfort food to the tenth degree.  <br><br>Pair that with amazing wines, incredible appetizers, and attentive service and you have an experience well worth repeating.  I'm glad we were there with a large party (managed to fit nine of us, believe it or not), so we all go to try other dishes.  The veal saltimbocca was incredible, as was the calamari.  None of us had a bad dish, honestly.<br><br>I would definitely go back here if I had the chance.  If I lived in town, I would definitely be a regular.  Mille Grazie!", "pics": null}}, {"review": {"des": "Searched for a real old school Italian restaurant for our visit to my hometown, Chicago. Found it at La Scarola. Food, Service, Atmosphere,Everything was well worth the visit. Highly recommend!!!", "pics": null}}, {"review": {"des": "Best plate of pasta I've had in my lifetime. Penne Alla Vodka with the octopus to start, didn't want to the meal to end. Nice joint good atmosphere great service. Anyone who gave this place a bad review is clearly a spoiled idiot that needs to go back and eat at Olive Garden. Had an awesome dinner and Richards right next door is another great spot to chill at. Thanks La Scarola!", "pics": null}}, {"review": {"des": "I had the penne alla vodka. The sauce was good but the ratio of penne to mushrooms asparagus and shrimp was literally non-existent. I had to fish for my shrimp and only located three - what the hell????? I guess one of the waiters could tell I wasn't impressed because I was stirring away at my dish looking for shrimp when he asked me if everything was okay. I asked him if it was normal to only have three pieces of shrimp on the dish (mind you I didn't eat any yet) and he said it was not and I should have gotten at least 5. Well, needless to say off he went to the kitchen to get me more shrimp. <br><br>The bread they serve is yum, but really hard. They also completely forgot my husbands salad. <br><br>The eggplant appetizer was great - that's a plus and the portions are huge - so it's not necessary to order your own meal. My father in laws dish was yum but it was lacking protein as well - he said he only had one scallop in his dish - grrrr!!! My husband said his chicken was to die for and my mom in law was happy with her appetizer entree. <br><br>Out reservations were for 745 pm but we didn't get seated until 810 pm or so - I get it, they are busy, but c'mon. A reservation is a reservation. <br><br>They get busy, so be prepared to wait!!!!", "pics": null}}, {"review": {"des": "Come here every year during a work trip. Always very good. My Italian friend always orders the spaghetti and meatballs Calabrese style. I order various things to try. Haven't been disappointed. Don't let the exterior or cramped quarters detour you. It's worthwhile! Mangia, Mangia! Salut!", "pics": null}}, {"review": {"des": "This place is amazing. Came here with family to celebrate my birthday and we couldn't have picked a better place. Food was incredible, but the staff is why I'm writing this review. Would highly recommend this place!", "pics": null}}, {"review": {"des": "When it comes to Italian food and affordability, nothing else competes with this place! <br><br>I would strongly recommend having reservations, but even with them you may be looking at an additional wait on weekends. We waited an additional 30 minutes after our 9pm dinner reservation, but the host made it go by more quickly with tequila shots! <br><br>The place looks tiny from the outside, but it keeps expanding back with additional dining spaces. The interior has a very historic, old-timey feel with pictures covering the walls of famous customers and happy diners! <br><br>Our group of four ordered a bottle of wine, three appetizers and 2 entrees. We all left stuffed with plenty of leftovers and a total bill of under $130! <br><br>Appetizers: <br>- Gnocchi bowl is phenomenal! Cheese-y, gooey gnocchi served overflowing a small bowl is large enough to be an entree. <br>- Shrimp Francese has a splendid white sauce which you can rightly assume that I soaked up ALL the additional sauce with bread. Even the spinach it is served atop can't be left behind<br>- Mussels are huge! Each individual mussel is so large and the sauce (we got white sauce) is perfect!<br><br>Entrees:<br>- Penne alla Vodka sauce is a huge portion of creamy penne with large shrimp, mushrooms and asparagus. So memorable and rich! <br>- Pasta Natalie is a heavier dish with the sausage but just as delicious as everything else and an equally large portion size! <br><br>All in all, I was so impressed with the quality of food and the prices that I'll be guaranteed to come back again!", "pics": null}}, {"review": {"des": "One of the worst dinners in Chicago. The ravioli was not edible. We got it taken off the bill. Everything was too salty. The room smelled moldy when we sat down. The bread was so dry, you couldn't eat the crust. Why is this place popular? Please don't waste your time and money.", "pics": null}}, {"review": {"des": "This place has delicious food and reasonably priced bottles of wine. Pasta w vodka sauce & jumbo shrimp and the Malbec bottle was perfect. Very cozy interior. The owner is so nice and came by and asked how everything was. Great dinner place with friends or a date.", "pics": null}}, {"review": {"des": "Traditional Italian eatery that is pretty small, but still somehow makes you feel like you can own the place. Bread on the table was phenomenal. Our waiter was really nice and attentive. I got the Vesuvio Pasta even after being told to get the chicken vesuvio. I am glad I did. Essentially they are a similar dish, but mine was served on pasta with an amazing garlicky sauce whereas the other dish is with potatoes and peas (also looked really good). We also got grilled calamari which was very tasty. Would definitely recommend and doesn't break the bank either.", "pics": null}}, {"review": {"des": "Easily some of the best Italian food I've had. I came here on Saturday night and ordered the grilled octopus and penne alla vodka. It's was fantastic. The portion sizes are gigantic. <br><br>Our server was very attentive and friendly. The food was excellent and the cost was pretty reasonable.", "pics": null}}, {"review": {"des": "Old school Italian food!<br>Amazing service.<br>Food is top notch!<br>And this will be your new must go to for Italian .", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/X-Mln4uw7yeE6_u1w7JTpw/348s.jpg", "caption": "Steak vesuvio is outstanding. I need this again soon!"}]}}, {"review": {"des": "Amazing food. Old school Italian ambiance. Great friendly service. Brought my parents here for their 39th Anniversary. Ordered the mussels in white wine sauce. That sauce like crack. Also got the Penne alla Vodka (to die for), Pollo Ponzio, and Broiled White Fish. Everything was amazing, huge portions, and had tons of leftovers. My new go to spot for Italian.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/J3c3TXGhiI_wIlwmwkMCaQ/348s.jpg", "caption": "Penne alla Vodka, white fish, and pollo ponzio plated."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/WkBNrq0ncBg4q5B-MnpFiQ/168s.jpg", "caption": "Broiled white fish."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/qno7qMpEjlp4lYkRCN-2fA/168s.jpg", "caption": "Penne alla Vodka. So damn good."}]}}, {"review": {"des": "10/10 would recommend. <br><br>I've been here once before and it doesn't disappoint. We had sausage and peppers, amazing and I don't usually like sausage. The calamari was so tender and delightful. I'm always a sucker for bruschetta and the tomatoes were cut to the perfect size and dressed beautifully. <br><br>I was already full so just ordered the cheese ravioli which ended up being a huge portion (at least I'll have lunch for tomorrow!!) the pasta was the perfect el dente. <br><br>My boyfriend had the chicken florentine and could not stop saying how amazing it was. <br><br>We finished the night with a cannoli which was so great. The shell was fresh and crunchy, and the cream was the perfect texture. <br><br>The service was amazing! Their staff is all so nice and helpful. <br>Such a great experience and I love coming here.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Uw_AFcHJK1TQHqkN6d0COQ/348s.jpg", "caption": "Sausage and peppers, as well as the calamari. Both absolutely fantastic."}]}}, {"review": {"des": "Food is amazing. Very Chicago feel and the servers hustle. What more could you ask for? Also order the chicken, any chicken dish. I don't usually like to order chicken but it's amazing", "pics": null}}, {"review": {"des": "Big portions, BYOB (i believe), old school Italian vibe, welcoming service, and did I say big portions? La Scarola checks all those features off the list. Food was good. Nothing mind blowing but the portions are seriously for at least 2 people. So the food is actually quite the bargain. I would return again but with a bottle of wine in hand. :)", "pics": null}}, {"review": {"des": "Outstanding restaurant pleas make your reservation it's a real special place... ask for the owner and Tony's Castañeda Special Menu", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/aM5numCmm4hG-F_CUh5IKA/348s.jpg", "caption": "The best Italian rest in town by trip advisor and ME"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/cyoErhrhlivHbflYRaj8aw/168s.jpg", "caption": "Outstanding"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/UHR5oif0-Jy4Hbu8xh4WYw/168s.jpg", "caption": "Outstanding"}]}}, {"review": {"des": "I went to eat here again and it was just as great as the last time! The owner is so nice, and everything is so delicious and authentic.", "pics": null}}, {"review": {"des": "The best.  Great pasta, very good steak, very good wine.  Cap it off with a lemonciello", "pics": null}}, {"review": {"des": "Great hole in the wall Chicago place. Love the atmosphere, great food. Offered the pasta special and the sausage and peppers. Thursday night at 9:00 totally packed.", "pics": null}}, {"review": {"des": "This place was absolutely fantastic! I ordered one of the daily specials and it was amazing. This was the perfect spot for our group. One of the best Italian meals I have had since my visit to Italy.", "pics": null}}, {"review": {"des": "Visited on Friday night with couple friends.  They had made a reservation but when they arrived their name wasn't on the list, so we were told to \"go next door\" until about 7:50 (had made 7:30 reservations).  Too bad we didn't get there first because I would have chosen to go over to The Dawson or even Piccolo Sogno instead of Richard's.  I've been to Richard's a gazillion times, but never before midnight! Was odd to be there with people smoking at 715pm.  I digress.... back to La Scarola at 7:50 and he told us it will still be a few minutes, so we went in and crowded ourselves at their little bar and got a glass of wine.  When the owner came by to seat someone he apologized and gave us a shot of tequila.  So at least it was acknowledged.  In this particular night, I wasn't (and neither were the other 3 in our party) particularly annoyed about the wait, we had a drink, we had good company so it was fine.  However, that shouldn't really happen that they don't have your reso then you keep waiting.  <br><br>We were seated and the plates, cutlery and napkins were kind of thrown down on the table.  They obviously are very busy and crowded and their staff works quickly.  It was a bit abrasive, but again, I think I gave it a pass because we were in good moods and you're at La Scarola, an old school Italian place, not a 5 star super high end restaurant.  But still, they should have been a little more careful in not throwing our table settings down.<br><br>We ordered fried calamari and once again, it was delicious.  It's not a huge portion and we had no problem finishing it.  I ordered the chicken milanese which was a special and loved it.  I was trying to decide between a pasta and that and I always love a good chicken milanese so went for it.  The salad on top was dressed well and had tomatoes. The chicken wasn't super thin like you find at other places but thin enough.  It had a ton of garlic on it.  I'm a garlic lover so it was ok with me but might not be with others.  My husband and our friend ordered a veal dish and both loved it.  My husband's had SOO much garlic on it, it was kind of ridiculous.  And our friend's didn't, so we're not sure what happened there!  Our other friend ordered the pasta with scallops, mussels and shrimp in a red sauce that had a touch of cream.  It was rich and delicious.  I had some of the scallop and shrimp and thought it was excellent.<br><br>We were too full for dessert.  I've never had a bad meal here, it's always delicious and I always struggle with what to get.   Service at the table was great with our server--just wish the other staff setting our table up had been a tad more gentle, if that's the word!   But I'll forgive it because it's La Scarola!", "pics": null}}, {"review": {"des": "Portions are huge and the service is on point! This place is my go to spot for bringing out of town guests. It has that old Chicago feel, great food and reasonable prices. <br><br>Everyone that we've taken here has raved about it to the point that it's where they ask to go back to! One of the big pros besides the delicious spaghetti and meatballs is the staff. You never want for water or for anything because there is always a waiter nearby. Their speed and efficiency is even entertaining to watch. La scarloa is a real deal Italian restaurant - never change!<br><br>Also making reservations is a must if you don't wait to wait for a table.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/cdFaI-PJI-HsaCLKtbKwjw/348s.jpg", "caption": "Spaghetti and meatballs"}]}}, {"review": {"des": "La Scarola is the perfect place for a simple, good Italian meal. I came with some friends on Saturday night. We had called earlier for a reservation and they told us to come at 9. Really, they don't have a list or anything when you get there, they just seat you when a table frees up around the time they told you to come. We stopped by the bar first and got a round of drinks. The Manhattans were fine but not special by any means. The Chianti I got by the glass was ok, but not great. We were seated quickly and our server was helpful but didn't hover too much. We started with the fried zucchini and calamari. Both were fresh and flavorful. One came with a ketchup-like sauce that wasn't very good, but the other came with some nice tomato sauce. We split a couple of bottles of wine as a table. We got a tuscan red for $45. I thought it was a fantastic bottle for the price. It was dark and peppery and perfect for our meal. I had the gnocchi special, which was in a garlic white sauce with onions, olives, and chicken. It was flavorful (very garlicy but I don't mind) and the gnocchi were cooked nicely. It also came with a ton of chicken. A friend got the penne a la vodka and it was also delicious. My husband had the eggplant parm and really enjoyed it. All the portions are huge, more than enough for 2 leftover meals. We were still sipping through our second bottle of wine so the table split a tiramisu. It was light and exactly what a tiramisu should be. This place is no frills but is solid, simple Italian food. It's more like going to your Italian mother's than to a restaurant.", "pics": null}}, {"review": {"des": "Went to this place on a Monday night after a boat ride with my parents and wife. From outside the place looked small but when we went inside it gave a very authentic Italian feel. There walls were filled with Italian people ( i guess the people who started the restaurant) and framed all over. <br><br>My dad ordered the Minestrone soup and it was just awesome, very thick and creamy. My wife and mom shared the brochette and I ordered the chicken gnocchi. We finished the dinner with a Tiramisu and it was complete. The place gave a very homely feeling.<br><br>My only concern was that I smelt cigarett smell inside the restaurant, may be I could be wrong. But other than that they served some good food with very good service.", "pics": null}}, {"review": {"des": "This is an old-school classic!  I had the Veal Marsala and it was great!!!  The baked clams were great too as was the octopus! The pasta tasted great but needed to be more al dente, good but could have been better.  Over all, this place is definitely worth going to.", "pics": null}}, {"review": {"des": "Too good for its own skin.......your typical , less tasteful, Italian joint. We told asked to leave5 minutes from our reservation time because they didn't have enough room for a party of 5 to stand around as we were walking up to their bar. The server was fast to get us out and no help at all when asked for recommendations. For as many celebrities they claim to have on their walls, their tastebuds must be off the day they visited. They can't accommodate more than 2 credit card per table which is ridiculous for large parties. You can see how many Italian restaurants I've been to and compare.", "pics": null}}, {"review": {"des": "This is the perfect place for an Italian Family to celebrate a birthday and keep everyone happy.  It has the old school vibe that the older folks like and the menu has a nice variety and keeps up with the times that the younger folks will enjoy.  The atmosphere is wonderful as is the traditional service that you would expect in a place like this.  If you get bored with your family, there are lots and lots of pictures on the wall to check out.  (We sat next to a nice picture of Jason Beghe from Chicago PD.) The wine list is great and we had tried a couple of different Red Wine selections, my favorite being the Napa Valley Silverado Vineyards Sangiovese which was smooth and delicious and lead to a 2nd bottle.  <br><br>We had an antipasto plate to begin which satisfied all (good, but didn't really set it apart from other places).  For the main course, I opted for the Eggplant Parmesan, which was not the breaded kind (which is why I ordered it) and came with a generous portion of angel hair pasta.  The sauce is what makes the meal for me and the marinara was perfectly done.  <br><br>We all shared the Tiramisu for dessert (birthday treat) and it was good but nothing out of the ordinary.  The Cappuccino was adequate and the fact that they were very attentive in serving makes this a great place to bring your family or a date.  If this restaurant was in a city that did not have so much competition, I would have given it a 5, but ... it's Chicago, with Italian on every corner.  My only suggestion is to find items to set you more apart from the vast amounts of competition.  (I'd still have yet to find a place that makes the traditionally fried Zucchini Blossoms on a regular basis.. hint, hint.)<br><br>Will definitely be back!", "pics": null}}, {"review": {"des": "Has to be my favorite restaurants.  Great food!  The place is small and very out dated but the food is amazing.", "pics": null}}, {"review": {"des": "This is my all time favorite Italian restaurant.  Unfortunately, I'm in the far NW suburbs and can't get there enough.  Exceptional food and service.", "pics": null}}, {"review": {"des": "I cant believe I waited this long to try La Scarola out! Went on Monday night, not super crowded. I'd made a reservation over the phone, but didn't really need it when we arrived. They brought out bread right away, which was okay. Wish they warmed it a little and brought out freshly ground pepper or parmesan with it as well. <br><br>I got a glass of cab, which was decent for $8. Then we started with the bruchetta which was pretty cheap! $5.50 for 4 decent size pieces. Perfectly toasted and garlicky. Yum!<br><br>I couldn't pick between the pasta and chicken dishes, so the server said they could throw some pasta in with the chicken dish. SCORE! Such great service. I ended up getting the Pollo Florentino with angel hair. It was so freaking delicious. HUGE portion, I barely ate half, but so worth it. Its basically 3 lightly battered chicken breasts with cheese and spinach in between them. It's all in a wine/lemon sauce that the pasta absorbed. My mouth is watering just thinking about it again.<br><br>My friend got the chicken parm and also really enjoyed it. <br><br>We didn't end up getting dessert because we were SO full, but I cant wait to come back and try more things here!", "pics": null}}, {"review": {"des": "What. The. Hell. Chicagoans, have you never have good Italian food??? This is embarrassing. I can't believe you think this is the best Italian food in Chicago. Whatever. Jesus. <br><br>Look, if you've ever eaten great Italian food outside of the midwest, then you will not enjoy this establishment. <br><br>If you love Olive Garden, you'll probably love this place.", "pics": null}}]}