{"name": "las-palmas-chicago", "reviews": [{"review": {"des": "What a pleasant surprise we had at Las Palmas this past weekend. Everything we tried was great. You know sometimes you really lock yourself into a certain mindset, or in this case, certain menu items and then you keep seeking the same thing. So when we got to Las Palmas, we checked out the menu and didn't see some of your traditional Tex-Mex type items, like enchiladas, tostadas, etc. We hesitated on what we'll be able to eat there, especially as vegetarians. I asked the guy in the suit (assuming he's the owner or at least the manager) as much, and he pointed out a couple of menu options, but was a bit abrupt in the end - instructing me to read the menu on my own to figure it out. I was a bit taken aback by that... but we were already there and had waited 10 minutes so we stayed since at least they had something.<br><br>We started off with some margaritas and chips/salsa. The margaritas were fine - nothing too extraordinary and the salsa was good. Chips were also good. You have to pay for the chips/salsa (like $4), but once you get them, they'll bring you more.<br><br>For the mains, we shared all 3 vegetarian menu options across our table. First, the Enchayotadas - basically these are enchiladas. I'm sure they have a reason for calling them something else, but that's what they are. They come with smothered in a delicious tangy green sauce. Loved the sauce. The filling was a blend of grilled vegetables. Honestly, I usually don't like grilled veggies (I know, that's strange to hear from a vegetarian, but I like your regular cheese and onion enchiladas), but they had this blend so we went with it. It was GREAT. It had all kinds of flavor and boom. Love them as we all tasted one of them (comes with three enchiladas, although there are no sides).<br><br>Next, we had this pretty amazing risotto entree that's served in a \"bowl\", which is really just a half squash filled with risotto. It was really unique and special. Again, something completely different from what I've ever had at a Mexican restaurant. Good stuff.<br><br>Lastly, we had the veggie fajitas, which were good. I mean, this was probably the least unique of the entrees. You know pretty regular grilled veggies, beans, pico, sour cream, and an assortment of tortillas. Decent option on the menu.<br><br>They had a tres leches cake on the menu, which I love, but we were all way too stuffed after dinner to even try it. Will have to get some of that next time. I don't know why more places don't carry tres leches - it's so amazing.<br><br>By they way, the service (other than the suit) was fine. They were pretty attentive and came by a few times. The busboy and water lady were helpful in getting us the salsa refills. Oh, they have this super-hot salsa, which we got. It's too hot to eat on it's own, but I was enjoying it as a mix with the regular salsa. Good stuff.<br><br>We were sitting back in the covered patio area, which is really nice. Essentially, it's a sun-room, and it was well-insulated, because we didn't feel the chill from outside. It is mid-October, afterall and it's starting to get chilly in Chi-Town. Well, I'm so happy we gave Las Palmas another shot after so many years. What we found was expected and it turned out to be better than we could've hoped for. I highly recommend the Chicago Las Palmas.<br><br>By the way, we've been to a couple of Las Palmas out in the burbs, and I always remembered this one to be similar to that. Maybe I mis-remembered, but based on the menu, it was totally different. So anyway, good stuff - good find.", "pics": null}}, {"review": {"des": "Above average Mexican food.  I really enjoyed the steak fajitas but found the tacos a bit boring, but still good.  Prices were reasonable for the quality and I will definitely be going back.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/RK5taJ5iNkL8BRHKpE9dTQ/348s.jpg", "caption": "Guac, decent flavor"}]}}, {"review": {"des": "Horrible experience. Our waitress completely ruined our first visit here. We were so excited to try this place, but it's honestly not worth coming back to at all. When we got seated, the waitress kept coming back every 10 seconds to take our order. When we finally decided what we wanted to order, she took our order and then disappeared. Our drinks came quickly, but our food took 45 minutes, and it wasn't busy AT ALL. We had to ask a different waitress to check in on our food because our actual waitress never showed up and people who came in after us with bigger groups, got their food before us. When our food finally arrived, it was cold. The food is very mediocre and extremely overpriced for what it is. The margaritas were good, but you can probably get that (and better) at any other Mexican restaurant with better service.", "pics": null}}, {"review": {"des": "My favorite Mexican/Latin inspired restaurant in the city. Hell, my favorite restaurant in Bucktown. <br><br>I always start with the Queso fundido (minus the chorizo for me) and whatever seafood is on special (their scallops dish over black rice is insanely good). My friends or dates rave about the fajitas. <br><br>The service is amazing. Attentive and helpful without being overbearing. <br><br>Cozy fireplace in the front room or gorgeous atrium/lights in the back room. You can't go wrong here.<br><br>While I rarely come here with kids, the one time I did, they were super accommodating / had kids cup ready.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/pSnaLlqhqQ0MmM3bC4-nyg/348s.jpg", "caption": "Scallops, black rice, and yuzu-habanero-butter sauce."}]}}, {"review": {"des": "Good solid Mexican food. The guac was not exactly made table side (as the menu stated) but was still fresh and delicious. Of the mains, the steak fajitas were absolutely incredible. The cochinita pibil was not as good but still decent. They also had a really good looking chocolate dessert, but we were too stuffed for that one.<br><br>The service and vibe were both good. I really liked the fireplace near the entrance - added a nice homey touch to the whole experience.<br><br>Oh yeah, forgot to add - definitely get one of their cocktails - you won't regret.", "pics": null}}, {"review": {"des": "Their guacamole and margaritas were both great. I also really enjoyed their fajitas and honestly a fajita + guacamole was enough to feed 2 people. I love the fireplace when you walk in it creates a good atmosphere.", "pics": null}}, {"review": {"des": "Went here for dinner. They were very courteous with reservations, calling about 1-2 hours before reservation time, to be sure the reservation was being kept.<br><br>We sat towards the front.. I'm sure I would have liked to see the back dining area. but towards the front, it seems a little more casual, with white tiled floors. It was nice that there was a fireplace, for ambience. <br><br>Drinks: Fresh ingredients, and their spices add more of a flavorful kick, rather than be on the stupid hot side. I think I ordered the pepino, which features cucumber. I asked them to make it sweeter, which they happily obliged. I also ordered a drink with vanilla and pineapple, I believe? also really good. Sweeter, did not require extra simple syrup.  The bartender does know his drinks, knows his product, and the waiter did a great job selling/relaying the drinks, based on preference.<br><br>We opted to share all food. Definitely a plus, since entrees and even the calabacita was easily shareable for two.<br><br>Appetizers:<br> Guac: fresh and made to order. We got medium, and it was perfect. More on the mild side, which I definitely don't mind. <br> Complimentary salsa; also good. the red kind, and can even be paired with the guac on your chips. YUM!<br>Ceviche: I'm not too big on fish-type ceviche, but this was good. refreshing and flavorful.<br><br>Entrée<br>Although it's technically an appetizer, I got the la calabcita. It features scrimp and scallop on a small pumpkin (think calabasa squash style).  Omg this blew my mind. Perfect combo of sweet and savory (maybe a hair on the salty side for me), but this was crack. It definitely helped, having the ceviche and chips and salsa or guac on board to help cut the salty/creaminess of the dish.  But honestly, I would order this again and again and again every time coming here. I'm salivating, remembering how great this dish was. I love my seafood, and this was perfect. I'd honestly almost want to just order this and double the portion, add some rice and plantains, and this would happily make my meal. <br><br>La casa borracha: omg this did not disappoint. the waiter told us that this menu has changed many times, but this is the one favorite that's kept its #1 spot on the list. We shared it, and it was easily divided for an even split. haha a good thing, too! this was soooo delicious. the skirt steak was cooked to preference (we chose medium). then with a potato, and with some plantains. Mmm this was yummy. every thing about it was good. Nice and savory for any guy, with the pretty presentation to please any girl. <br><br>my only slight flaw, was that the menu online didn't accurately reflect the menu in the restaurant. Some dishes were on the online menu, but not in the restaurants, and vice versa. However, it made me pleasantly surprised because I was able to try the la calabacita dish that looked liked it wasn't being served anymore.<br><br>I like that this spot was lowkey, and not in the heart of wicker park. Parking was easy on a Friday night, and side streets were an option. definite hidden gem.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/kcy4Df4Dg8lDM9QczkjN7g/348s.jpg", "caption": "La casa borracha"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/vhZUAORiajJq65VIk3P96g/168s.jpg", "caption": "La calabacita"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/rV8TgygoSPfnXDcdWbRjDQ/168s.jpg", "caption": "Ceviche"}]}}, {"review": {"des": "MARGARITASSSSSSS, is all i'm going to say first...so delicious! comes in different sizes, definetely get the biggest one they have...and i do have to mention the GUAC too...freshly made by the workers at a guac cart, impressive. the chips that accompany the guac, is also to die for (taste like whole foods tortilla chips :) ). Service was always good the two times I've come. Ample seating in the front, middle (glasses in area), and outdoor patio (so cute at night). <br><br>Food wise, it's a little fancy. won't get your simple tacos..they are all in meals and small in portion, the fajitas were disappointing, the amount of beans and rice just didn't cut the price after a sunday funday and i needed some substantial base of food to carry on the night. <br><br>So this would be deserving of 5 stars, but the food portion was on the smaller end.", "pics": null}}, {"review": {"des": "Great service. Feel that a lot of places in Chicago have lost touch with what it means to have good service. Food was absolutely delicious. Well priced. Nice vibe. 4.5 stars no doubt.", "pics": null}}, {"review": {"des": "This place is fire <br>I went with my boyfriend on a Tuesday and it was pretty empty, but the atmosphere was great. We got a table near the window and had a good view of the street and the restaurant. It was so cozy inside and even had a fire place. <br>As for the food, like damn. I ordered the salmon and my boyfriend ordered the fajitas. Both were amazing and the portions were huge. I'm trying to go back as soon as I can to get it again.", "pics": null}}, {"review": {"des": "Excellent Service and food!!The waiter was courteous and had the main entree prepared as my wife wanted !", "pics": null}}, {"review": {"des": "Really fresh food and great ambiance.  The back garden is really nice to sit in the evening and it's dog friendly!  The queso fundito and fajitas were a hit when I brought my friends.  The staff is also attentive and friendly. Highly recommend and parking isn't to difficult in that area either!", "pics": null}}, {"review": {"des": "This is the best modmex I have had. They custom prepared me a vegetarian version of a stuffed squash dish. It was plated beautifully. The table side guac was also a nice surprise. <br><br>There was a hair in my drink, and the waitress was very kind about replacing the beverage. They then proceeded to give us the entire meal free as an apology for this.", "pics": null}}, {"review": {"des": "Nice people.<br>OK service.<br>Delicious guacamole.<br>OK chicken molle.<br>OK other dishes.<br><br>Appreciate it that they let my gorgeous dog to join us in their yard.", "pics": null}}, {"review": {"des": "Stopped in last night to grab dinner.  Food was delicious, service was good and the atmosphere is intriguing.  I'd definitely recommend this restaurant and can't wait to come back to try brunch!", "pics": null}}, {"review": {"des": "Live right near and have been here now 5-7 times. One of my favorite restaurants in Chicago. Yes, they do table side guac. But their menu is extremely creative and always reinvented. It's a joy to try something new, because you know it will be great. Also, I adore their margaritas. This is a perfect spot for groups or date night. Staff is great and they have an outdoor patio as well with heated lamps for chilly fall times.", "pics": null}}, {"review": {"des": "We were in on a Saturday right before it got filled up..reservations are a good idea.  We sat out in their garden.  Everything was wonderful!  The crab cake was very possibly the best I have ever had...flavorful & moist.  We are pescatarian so obviously went right for the fish.. both the scallops and octopus were done to perfection.<br>They were tender & the sauces for both were delicious!! Definitely will return.  Service was very good & friendly but not intrusive. Loved it!", "pics": null}}, {"review": {"des": "Honestly one of my favorite weekend brunch spots in Chicago. $5 margs, free chips and salsa, $9 brunch dishes - pretty cheap for how much food you get.<br><br>The service is always good, the food always delicious. And the best part - you never have to wait!! Seating is always immediate. They have a green house room in the back that always lets in so much sunlight which is nice to sit in when it's cold af outside. <br><br>I always get the chilaquiles without meat and a fried egg. It comes out a little soggy but the sauce is so good I don't care. I branched out this time and got the veggie fajitas, and I'm so glad I did. If you're vegetarian I recommend those two dishes. <br><br>Also ask for the spicy sauce on the side, it's actually ridiculously spicy and always leaves me sweating. <br><br>I've also been for dinner on a Friday night and I didn't enjoy it as much - it was crowded and their dinner menu is much more expensive.", "pics": null}}, {"review": {"des": "THIS IS MY HAPPY PLACE!<br><br>Not only is everything on the menu amazing but we come for the service. I started coming to Las Palmas 4 years ago. i was really excited to bring my boyfriend here a couple years ago since he has great taste and shares the same love and enthusiasm as I do in experiencing different restaurants! HE WAS SOLD!<br><br>This is now OUR happy place! they have amazing appetizers, steak, seafood, deserts and OF COURSE margaritas! Do yourself a favor and order yourself a straight up passion fruit margarita, you're welcome!<br><br>We always start with the table side guacamole (spicy) which is so fresh and delicious! My favorite entree is La Casa Baracha (medium rare) so yummy! <br><br>Maria, the manager, is so lovely, friendly and accommodating! Tino, is our all time favorite server! We are always so beyond happy with the customer service! It's great for date night, friends night or family night!", "pics": null}}, {"review": {"des": "We went for brunch. Not enough people know about this brunch. It's great, the service as always great too.  Food was delicious.  Our waiter was so nice about the 2 babies that we had in tow... will definitely be going more especially when the weather turns and the patio is open more consistently.  Only negative is I wish they had more of a mimosa / michelada deal for brunch...$5 even would bring in a better crowd.  Definitely not a deal breaker as people and food outweighed that.  We will be back!", "pics": null}}, {"review": {"des": "This is my all time favorite restaurant for mexican fusion. I love the la casa boracha. It's a nice combination of flavors with the steak and plantains and potato's. Even the side of mango jicama pico is delicious. I also highly recommend the guacamole which they make fresh to your tasting. The salsa is also one of my favorites. So fresh and bright. I absolutely love this place", "pics": null}}, {"review": {"des": "Been here for brunch on the weekend and dinner on a weeknight and have been thoroughly impressed each time. The fresh guacamole is a mouthgasm, don't hesitate, Karen. Don't let me hear about you hesitating. Also side note: there's a super intriguing doormat when you walk in that has a pleasing texture and it's fun to walk on when you head out and you're all buzzed. It's like dessert for your feet. The brunch taquitos are a thing of beauty. The margaritas are DOPE and so are the glasses they come in. The staff is attentive and sooooooooooo friendly. The food is top notch with a side of pizzazz. The patio is gorgeous, feel like you're not even in Chicago. It's like taking a 2 hour vacation. The Molé? Forget about it, it will change your life and send you on an endless vision quest and nothing will compare and it will torment you the rest of your life. I will be taking all of my guests here. And should they breed, I will take their spawn here too.", "pics": null}}, {"review": {"des": "Great food and amazing service, love the outdoor patio area and always such a fun atmosphere!", "pics": null}}, {"review": {"des": "This place deserves five stars, but I'm giving it four stars because of the 15 min wait we had before someone finally noticed us and came to take our order..<br>I came here last night for dinner around 9pm and it wasn't too busy. We were greeted kindly and seated right away in the sun room. The decor makes you feel like you're in Mexico or somewhere in South America. It has a very cozy feel to it. <br>I ordered the Mar Y Tierra which came with a super juicy filet, shrimp, carrots/spinach and mashed squash which was very interesting! To me, it tasted strong on its own, but when you eat it with a bite of the fillet, everything blends so well together.<br>My boyfriend ordered the Asada, i believe that's what it was called. I don't see it on their website.. It was a skirt steak on tomatoes topped with goat cheese and chimichurri. Not a fan of goat cheese, but according to him, it was amazing (:<br>And for dessert we shared Tres Leches, which isnt on their website either. The cake was so spongy and full of flavor. It was topped with fresh strawberries and hibiscus syrup. My mouth waters as I'm typing this. haha <br>Overall, amazing experiencing and already looking forward to going back! Highly recommend it", "pics": null}}, {"review": {"des": "Just an extremely mediocre meal. My friend had the tofu tacos. I had the chicken breast in mole. Everything was just bland. It was boring. I didn't even finish my chicken,  surprising the waiter that I didn't box it up to go. The restaurant was cute and I remember liking it about five years ago. But last night, I was rather disappointed.", "pics": null}}, {"review": {"des": "I really do want to love this place but it's just ok. The food was mediocre, it lacked flavor and depth which was super disappointing. I ordered the shrimp with coconut risotto which didn't really taste like coconut and resembled an asian dish rather than Mexican. My hubby ordered the asada which was kind of dry. The margaritas were good though! And the atmosphere was kind of cool. Nice fireplace for the winter. I know in the summer there is a sky room in the back which we'll try again. I wouldn't necessarily travel a great distance to come here though.", "pics": null}}, {"review": {"des": "Place is great. Service is good, food and drinks are great. I recommend place. The la casa borracha is cook to perfection.  Meat is tender.", "pics": null}}, {"review": {"des": "I am a native Californian and a Mexican American chef. I cook gourmet regional Mexican cuisine almost nightly. Las Palmas is outstanding!! Really five star gourmet . It destroys the taco/burrito myth. Please go there !!<br><br>The cocktails are authentic and creative. Hard to do. I don't live in Chicago but this makes me want to visit", "pics": null}}, {"review": {"des": "Great atmosphere, food, drinks and service!  We sat on the glass covered patio on Friday night, what a cool spot!  The ceviche was phenomenal.  Also tried the fish tacos, which were pretty good, but the spicy pineapple margarita is a MUST.", "pics": null}}, {"review": {"des": "Stopped in here for brunch on a whim after walking the 606. Everything we got was spectacular. Wait staff was friendly and helpful. Crab Benedict is highly recommended.  Flautas was delicious! Would definitely come again!", "pics": null}}, {"review": {"des": "I enjoyed my meal here, but it's not worth the price if you order the \"standard\" Mexican food options. I had the fajitas and guacamole. Both were decent, but pricy compared to what you can find at any good, cheap Mexican restaurant. I'll come back in the summertime though and give it another try because I've heard their back patio is awesome. Next time I'll try one of the \"modern\" Mexican dishes.", "pics": null}}, {"review": {"des": "Wow, this place was such a pleasant surprise. Not your average Mexican restaurant.. In a really good way.  A hidden gem with an amazing back patio and even better food. Highly recommend the guacamole... We ordered it spicy but it wasn't spicy at all. Still delicious and creamy so no complaints here. The tamarind shrimp were so flavorful and unique. The coconut risotto it was served with was really spectacular as well. Overall 5 star place with a great atmosphere. Can't wait to come back and try some other dishes", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/2Y0DCa8Kj0CVhKEjUioPNQ/348s.jpg", "caption": "Tamarind shrimp with coconut risotto"}]}}, {"review": {"des": "Drawn to Las Palmas for the patio and drinks. Both did not disappoint. But at 7:30 on a Thursday night, the service was incredibly slow. Despite the fact that there were only 8 tables dining in the entire restaurant, someone didn't even come by our table for a good 15 minutes after we were seated. After we got our food, we didn't see our server for another hour. I will say it's possible our experience was not typical though, judging from the other yelp reviews.<br><br>The food itself was decent - we ordered the chicken fajitas with corn tortillas to split. I did feel the portion size was a bit small for the price but we both liked that the dish seemed to be on the \"healthier\" side, served with fresh ingredients and not greasy at all. If I'm in the neighborhood again, I would come back for the patio, drinks, and guac.", "pics": null}}, {"review": {"des": "A little pricey for Mexican but it was good and seemed authentic. Meat seemed good quality too", "pics": null}}, {"review": {"des": "Best. Mexican. In. Chicago. PERIOD.<br><br>This place is the hidden gems of all hidden gems. You will rarely have to wait and you will have stumbled upon, yes I'm saying it again, the BEST Mexican food in Chicago.<br><br>The entrees are almost an elevated Mexican - the veggie enchayotadas and risotto stuffed acorn squash holy GOD it's unreal. Margaritas are strong and authentic. Has a great outdoor patio for the summer, but this place is the bee's knees in any season. LOVE Las Palmas!", "pics": null}}, {"review": {"des": "Excellent (fresh, well crafted, masterful, delicious, beautiful) food. Excellent service. Sunny patio. Killer spicy pineapple margarita.", "pics": null}}, {"review": {"des": "My friends and I had a great time here - it was an awesome find! Although at first seemingly empty in the main room, we were brought into the sun room, where we saw majority of the guests were enjoying themselves outside on the beautiful patio. The sun room made the dinner such a lovely dining experience. The atmosphere was classy but casual and the staff were very attentive and friendly. We shared a pitcher of the house margarita and ordered the following (all of which we recommend): guacamole, empanadas, costillas (pork ribs), borrego (rack of lamb), and pato picoso (duck breast). Everything was delicious and well worth the price.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/w7F83CQezHdsO3tgstgeNA/348s.jpg", "caption": "Appetizer is plenty for a meal"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/_e5NRZqHZwgwB3h5E0W_FA/168s.jpg", "caption": "Lovely atmosphere"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/FGHpvWOoFxZLCWBR__6g0A/168s.jpg", "caption": "Chips and salsa, house margarita"}]}}, {"review": {"des": "Fresh guacamole made with avocado, onions and tomatoes. Tastes so good with chips. We get some beef tomato stew with beans and rice and tortilla (traditional choice) and it taste great;) <br><br>The environment is also nice. This place looks very small from outside. But it he has open space in the backyard and nice decoration in the room.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/IEi_cOa4avpe-MkSZ53EIw/168s.jpg", "caption": "Guacamole"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Ymw4IToh15ntAFHZzjXQMg/168s.jpg", "caption": "Beef stew"}]}}, {"review": {"des": "Good tasting food<br>Nice staff <br>Fresh guac <br>Good tasting mojito <br>Strong Margarita <br>Tab came out to $125 with 3 adults <br><br>Overall I would back for intimate ambiance and patio but it will be a while.", "pics": null}}, {"review": {"des": "Quick service, excellent good. More than a few vegetarian options. Make sure you try out one of their margaritas!", "pics": null}}, {"review": {"des": "I'm giving this restaurant a 2 star review because the food was delicious but the service was atrocious.<br><br>I was with a small group (4people) we waited easily 15 minutes before our drink orders were taken, another 10 for our drinks to make it to the table. We ordered Guacamole and salsa which were really good but no refills on chips or drinks were made while we ate the appetizer. Our food arrived about 25 minutes after we ordered (reasonable timing), but we had no silverware at our table. We asked the server who brought the food for silverware and he brought two forks and a knife which obviously left three people at our table with no utensils or with just a fork.  One of our guests had to get up to ask a second server and he brought everyone a silverware setting. <br><br>I had asked the server who dropped off the food for a refill. My acknowledged my request but forgot to bring my refill.  So again, had to ask another server for a refill. Once we had our food no one came back until we were done. Forget about refills or if you needed extra napkins or sauce, etc. luckily we didn't but this was still obnoxious. <br><br>It might sound like I'm complaining to complain since the food was good - I get it. But there is an expectation that when you go out to eat you'll have silverware at the table when your hot food comes out and when your drink is empty it will be replenished so you can enjoy your meal with a drink.  I'm not high maintenance and have rather low expectations of service since I used to wait tables but this experience just got under my skin.", "pics": null}}, {"review": {"des": "Very good spicy margaritas! Make sure to get it in the head shaped gauntlet! Had a great dinner out in their green room patio area. Great service too. Highly recommend this place!", "pics": null}}, {"review": {"des": "Amazing service of all the crew. However this is Not A Mexican restaurant,  it is a kind of latin sort of fusion.  First they don't have Aguas Frescas  (hello!) They have duck and serve bananas  and potatoes on the dishes..what that's not 'Mexa'. Drinks are so nice. Meat was okok, the reason of 3 stars is because they said they are mexican,  food is ok, drinks are nice and the service is so amazing.", "pics": null}}, {"review": {"des": "We walked in at 5:30 for dinner to an empty restaurant with our table of choice. We immediately chose the greenhouse-esque room. I ordered the pomegranate margarita, perfectly sweets and tart for my taste. I'd suggest on the rocks. Then we ordered two apps, one guacamole and the other chicken taquitos. Good, nothing special about the guac. Little kick to the medium level. As the other reviews say, try the la casa borracha.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/_xNBbyTII621quplRjVWnQ/348s.jpg", "caption": "Atmodphere"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/UpFV_XlrIIBvoEeX3hzIzQ/168s.jpg", "caption": "La casa borracha"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/F13kZDe0d7WYN7EdwG7RWg/168s.jpg", "caption": "Taquitios"}]}}, {"review": {"des": "The food: 4/5. I've been here twice. The first time I went I got some fish special, which was absolutely delicious. The second time I got salmon which was a little dry for my taste. <br><br>The service: 4/5. The service is always good, the waiters are friendly and the last time I went they had live music on the patio, which made it pretty romantic. <br><br>Overall: 4/5. Very good Mexican food, although not very authentic. I'll be back", "pics": null}}, {"review": {"des": "Holy crap. That was an amazing meal. We came and ordered 3 entrees between me and my friend. Of course we had some to take home, but I regret nothing. Get. The. Duck. A little on the pricey side but worth every, every penny. Everything was delicious and well plated.", "pics": null}}, {"review": {"des": "My friend and I tried Las Palmas for the first time last night, and we loved it! I didn't realize there was so much seating, and we were able to sit outside under strung lights and outdoor heaters. The music, service, and drink suggestions were on point. I was about to get a margarita, but my waiter suggested I get the Fresca (Lunazul Reposado, Gran Gala, & fresh lime juice). It was delicious! <br>We both decided to get guac and fajitas. I went for the veggie option, which was satisfying. Personally, my favorite part was my tiki glass, and the wooden, divided plate for the fajitas. I cannot wait to sit on this back patio all summer!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/rZo2Wee0C_H2SOedPFZmoA/168s.jpg", "caption": "Perfectly divided veggie fajitas (loved the artichoke!)"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/mNUWwT3L1urv8mZI6cl-uQ/168s.jpg", "caption": "Veggie fajitas, chips/guac, and my Fresca (Lunazul Reposado, Gran Gala, & fresh lime juice) were all on point"}]}}, {"review": {"des": "How have I managed to pass this place - 1 hundred million five hundred thousand  eighty two times in my life and never stopped here? Well I'll tell you how, it's on the corner, kind of always looks empty and dead when you look into the window from the street, but don't be fooled this fancy schmancy little hideaway has an entire back room, and THAT my Yelp friends is where the people have been hiding! <br><br>Started off with the Spicy Pineapple Margarita and the frozen Mango margarita which were both exceptionally good. While the Spicy pineapple trumped the mango on any given day, id give them both two thumbs up. <br><br>Next, we had the guac and traditional ceviche which were screaming in flavor and tastes straight from abuelitas's kitchen to the restaurant table! <br><br>Our final course we decided to split the Pollo Relleno, and I'm glad we did because the appetizers let us stuffed. Cooked to perfection the dish was drenched in tangy tomatillo salsa and cheese, couldn't have asked for a more delightful twist on chicken. <br><br>We will definitely be back here soon. Thank you Las Palmas for a wonderful meal.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/dnckWHYHsiOveuWQgVO1eA/348s.jpg", "caption": "Pollo Relleno"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/8BNScdqAUEKcr0Lsk-uuAg/168s.jpg", "caption": "Fresh Guac and Traditional Ceviche -to die for fresh! So good!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/tEw-isoqZPiUVZRhaBXSUw/168s.jpg", "caption": "Spicy Pineapple and frozen Mango Margarita's"}]}}, {"review": {"des": "Love this place, one of my favorites. Period. The menu, cooking, and presentation are always great. Service is good and ambience is nice.", "pics": null}}, {"review": {"des": "Nice casual place.  One of the best tofu tacos I have ever had, very flavorful", "pics": null}}, {"review": {"des": "I came back here with a few friends and our visit was much better than the last! Great service, but they still tried to clear our plates while we were still eating. Not sure what the rush was, there were plenty of open tables. Regardless, the food and drinks were just as delicious as the last time I came in. Definitely a must try.", "pics": null}}, {"review": {"des": "If u could I would give this restaurant negative stars. The service was horrible! It started with a Coke in which was flat and asked to switch to something else asking another waiter who was not attending us but never came back with. Then we received part of our order, never received tortillas. The waiter I only saw when he took our order and at the end when we were ready to check out. Horrible experience and the food was not so great for the price. Never ever going back or do I recommend this place.", "pics": null}}, {"review": {"des": "Went for dinner with two friends. Had a very good meal of shrimp fajitas. The service was quick and the restaurant was quaint. <br><br>Our order:<br>Guac- 4 (made to order in front of you)<br>Shrimp fajitas- 4.5 great flavor. Kinda strange there was no rice<br>Fish tacos- 5 was told they were great from my friend <br><br>Unfortunately, I did not have any drinks to benchmark.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/V7loej3k7qjIPxmdt3AkcA/348s.jpg", "caption": "Shrimp fajitas and fish tacos"}]}}, {"review": {"des": "This place is the bomb if you're looking for upscale-ish Mexican food. We popped in here during Wicker Park Fest thinking it was just another typical Mexican joint with your standard menu of burritos and tacos. Boy, were we wrong.<br><br>Firstly, this place is HUGE. They even have outdoor seating in the back. Secondly, they have an out-of-this-world cocktail menu. I ordered the lemongrass caprinha. Yum. <br><br>Service is a little slow, but the wait was well worth it. All of our food was amazing. I had some kind of delicious salad. Sorry, I cannot remember the name nor can I find it on their menu. The guacamole was great. I also had one of my hubby's taquitos and a bite of my friend's vegan entree (rotating). It was all delicious. Vegans and vegetarians will not be disappointed!", "pics": null}}, {"review": {"des": "Unbelievably inexpensive and absolutely delicious. Possibly the best meal I've ever had in Chicago", "pics": null}}, {"review": {"des": "The prices are reasonable and the food is on point.  I had the Mar y Tierra(Surf & Turf) which consisted of a filet, which I usually don't enjoy because they are usually too lean and not enough flavor.  The filet had just the right amount of marbling to make it very flavorful.  It also had a touch of char but not overcooked.   For the Surf, included pan seared tiger shrimp, which were tender, sweet and flavorful.  My wife had a an appetizer as a meal, the Calabacita which is pumpkin stuffed with shrimp, mushrooms, scallops and spaghetti squash covered in a white wine cream sauce. That was also surprising satisfying.  I believe we visited on a Tuesday evening.  I thought the service could have been better, seeing that restaurant was very slow.  Overall a good experience and I would recommend it.", "pics": null}}, {"review": {"des": "I've dined here many times before and my last experience wasn't as great as I've come to expect from here. However, my faith was completely restored this past weekend when my husband and I decided to give it another go. We were seated right on time for our reservation and started with the ecomargarita for me and the coconut mojito for him. Both drinks were awesome but next time I'd definitely order the coconut mojito!! It had coconut milk and wasn't too sweet like a lot of others can be. We can't come here without getting the ceviche, and we also tried the crab cake which was recommended by our server as one of his favorites. <br><br>For main entrees I got the filet which comes with grilled shrimp and sweet potato purée. My steak was cooked to perfection and literally melted in my mouth. There are no other words for how good it was. Hubby tried a special of skirt steak with cilantro pesto served with yuca and plantains. It was spicy but he loved it!! <br><br>Our service was fantastic.  Everyone is so friendly there. We actually got the opportunity to speak to Rick, the manager there, and give feedback about our previous experience. Las Palmas is a family run business and you can tell how passionate they are about it. Rick was so open to our feedback and how to make the dining experience better. Not a lot of places will do that and I think that help to set Las Palmas apart. <br><br>Can't wait to go back and drink a coconut mojito on the patio!", "pics": null}}, {"review": {"des": "The food is really delicious, and that's why I give this place two stars. <br><br>On the service side of things, I can't even begin to tell you how disappointing and unhappy my experience made me. <br><br>If my date and I died in our seats, without a shadow of a doubt, our waiter would not have cared. He was an angry fella, so I bet he would have gotten really pissed. <br><br>I had to make a decision based on my principles, so I refuse to go back to a place that has some of the worst service I have encountered. It doesn't matter who good the food is, I am sticking to my strongly held beliefs.", "pics": null}}, {"review": {"des": "I dined here with a bunch of new friends on the patio on a nice summer night and had a wonderful meal. We all ordered the margaritas and they were generously sized and delicious! Mine was mango and it was really good. For my main, I ordered the tamarind shrimp with coconut risotto and again, also delicious. Great meal overall with good service and they didn't blink when we split the check seven ways.", "pics": null}}, {"review": {"des": "I am reposting this Review because i can no longer find it!<br>After dining at Las Palmas on North Ave in Chicago we felt compelled to leave a review.     <br>      My wife and I, are always searching for a great place to dine. Although we make it a point to experience somewhere different each time, it's always nice to have a favorite especially when it's local. In all the 15 years living in Chicago we constantly struggled to find the whole package, great food, great service and always a warm welcome. Then there it was, a quaint little restaurant with murals on their outside walls, strutting the Art of local talent located in the heart of the Wicker Park.<br>     What was truly remarkable was the fact that this restaurant has been around for quite some time, and it was located only 4 blocks from our house. Tough to believe that the restaurant that was right under our noses would be the answer to all our aspirations, becoming our favorite place to dine. Our only disappointment was not discovering this restaurant sooner. I can only depict with little certainty that I will be able to give proper merit to this establishment that undeniably deserves.Here, a meek attempt at best to sum up what I experienced and what anyone can expect<br>       To start off the evening, although the restaurant was busy as we entered, a most gracious host with a charismatic smile cordially greeted us, wasting no time leading us to a quaint little table to sit. The hostess made friendly gestures at my three year old as she welcomed us, getting the evening off to a good start. Shortly there-after the owner of what seemed to be a family owned business, personally took time out of his busy agenda to greet us, offering us an array of tropical drinks to get us started, one of which was the special of the house called \"The Coconut Mojito\", which was nothing short of delicious!<br>        Having tried many Mexican restaurants, we thought we had an idea of what to expect since none of them manufactured their own original or unique tastes. Boy were we in for a ride. <br>     Well as you can probably predict, we didn't have to wait long after our drinks were served, to promptly place our order. Unaware of what we were about to feast upon, we picked out 2 starters.The Empanada, (cornmeal turnovers stuffed with fresh shrimp and crab with an accompaniment of a variety of cheeses gently placed on a plate with a tangy sauce) and Costillas (oven roasted pork ribs served in a tamarindo salsa garnished with mango),  the most memorable thought as the meat fell right off the bone.<br>        It was now time to pick a main, which in my opinion only spiked my curiosity of what to expect. Since we were still raving about the starters, l expected nothing less than truly superb going forward. As we waited my wife ordered some guacamole of which I was never a fan, but when my wife asked me to taste it, my thoughts were non-hesitant since everything so far was fantastic.  I am now a big fan.<br>        Now, for the entrées. My wife ordered Mar Y Tierra (a 4 oz fillet mignon tender as butter, grilled to perfection served with pan-seared shrimp, alongside was sweet potatoes and sautéed baby spinach).  I ordered La Casa Borracha -(a pineapple and tequila soaked skirt steak on a stack of rum-cured plantains),  a taste like nothing to be found anywhere in the City, which was  consistent to the appetizers. In my wife's own words \"FABULOUS\"<br>Every dish was prepared and served to perfection.My kudos to the Chef!<br>       The whole meal was incomparably delicious, and impeccably timed, while the service was equally amazing, completely professional, and yet warmly welcoming. Can't say we didn't expect that, since great food usually goes hand in hand with great service. The waitress Jenna was splendid and delightful. Just when we thought we couldn't eat anymore, it was still hard to resist as we were presented with a fascinating selection of desserts. We were advised to try a salted caramel ice-cream with whipped sour cream on top some very fruity crumbled pistachios with a salted caramel taco shell. DELICIOUS and exquisitely unique to say the least!!!  Keep in mind we are tough critics being from the Capital of Great food,New York.    More importantly, given the quality of food and service at Las Palmas, the whole dinner was at the very least modestly priced.  Las Palmas now holds our favorite spot for great food with the ambiance it bestows, engenders a warm and inviting atmosphere sought after by so many looking for a pleasant dining experience when out with the family or on a romantic date. The most significant part of a great dining experience you may expect at Las Palmas is every bit from soup to nuts and from entry to exit.<br>They hold the secret to what every restaurant strives for \" True achievement in every aspect of the industry\"  <br>Summation: The food & service varied from great to exceptional. This food was in all our Opinions immensely  flavorful & brilliantly creative!<br>M. Denigris", "pics": null}}, {"review": {"des": "Love this place - the staff, the food, and most importantly, the tequila. I can't say enough, they take great care of their customers and cook some awesome food. Highly recommend the Carne Asada, the sauce is sensational.", "pics": null}}, {"review": {"des": "I had a dinner reservation here on a Thursday night and I was surprised at how empty the place was. I'm sure it gets more crowded on the weekends because the dinner and service I had was excellent. <br><br>I was seated in the front room next to the window and it had a nice dark but cozy and authentic feel. I ordered the steak Fajitas and they were delicious. The beans, veggies and meat were all very fresh and very nicely flavored. It was presented in a nice palette-shaped serving dish and was quite generous in terms of quantity of meat. I also found the prices to be reasonable too. The service was also great! Our server was very attentive to our requests and explained everything in clear detail. It seemed like everyone working there took great pride in providing an authentic and comfortable experience. I really want to try some other dishes they have on the menu as well as some of their specialty drinks so I will certainly be back there soon.", "pics": null}}, {"review": {"des": "I've been coming to Las Palmas my whole life.  I grew up going to the one in Highland Park but this one is just as good.  Best margaritas in town and I've never had a better chile rellano.  I really need to come here more often.", "pics": null}}, {"review": {"des": "Great margaritas and the wait staff was efficient and attentive. We had the queso fundido app which was delicious if a little greasy. I had the La Casa Borracha which was amazing! The mango pico de gallo with the rum-cured plantains and pineapple soaked steak made for a delight with every bite. My husband got the chicken fajitas, which, while what we expected for fajitas, were also delicious. <br><br>We will definitely be back. The Ecomargarita is calling!", "pics": null}}, {"review": {"des": "Went there to celebrate an employee who was leaving us after 12 years.  We were a party of 4 on a Friday night and there were plenty of tables available.  There is a front room with a few (8 or so) tables and a back atrium with about 14 more.  There was also a garden area for outside seating that was closed.  We sat in the atrium and had very good service and food.  Had a pitcher of the delicious and refreshing house margaritas that gave us about 5 glasses full.  The  Guacamole was just okay.  We asked for spicy but maybe because we had 3 gringos and a homey, they eased up on the spice.  The chips were good and tasty and hard to resist.  The salsa was good but they needed to give us a bigger bowl.<br><br>I ordered the braised pork shoulder for an entree and the guys ordered a few other dishes.  There were no leftovers and everyone loved the food.  The food is not typical Mexican but what you might expect if you had a seasoned chef who used Mexican flavors.  The guys ordered steak and they loved it.  The service was attentive and price was fair for the quality of the food.  Don't expect to have leftovers if you are average to hungry.  Portions were not huge and my only complaint would be no sides like beans and rice.  Although one of the entrees came with it.  I think it was the steak tacos but that was before the Margaritas hit me.  <br><br>The atmosphere was okay but would have been a little better had the music been louder and there were more people.  All in all, the place is a hit.", "pics": null}}, {"review": {"des": "Quite possibly my favorite restaurant in Wicker Park.  Great food, vibrant cozy atmosphere, and reasonably priced.  I like the casa borracha (skirt steak) best, but the pork shoulder, fajitas, pulpo (octopus) and shrimp have all gotten high praise from my friends.  Also get the guac and margs.", "pics": null}}, {"review": {"des": "Not your typical Mexican place.  It's nice but no tacos and the guacamole is different.  Medium is spicy!!! Waiting for my brother so needed a place to wait.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/1W7Gf46VdsSsRKUHjHeg_Q/348s.jpg", "caption": "Wonderful margarita"}]}}, {"review": {"des": "Hey girl, hey -- we may have met at Jefferson Tap but I got all hot at Las Palmas. It was you and not the salsa. After finding out you were an Aquarius I've spent the entire morning listening to The 5th Dimension albums and even the closing credits of The 40 Year Old Virgin. You judging / staring at couples on dates made me wonder why you and I weren't on a date judging one another. I wouldn't even take my coat off. Again, I would be hot. Food was good, too!<br><br>PS. I want to see your kitties.", "pics": null}}, {"review": {"des": "One of my favorite restaurants in the neighborhood. The brunch menu is where it's at. I pretty much always get the Cuban Lemonade and the Enchiladas. They are a little spicy but ssooo good. Their guacamole is made to order and it is very good too! Highly recommend this restaurant.", "pics": null}}, {"review": {"des": "Great Mexican Inspired dishes. My GF and I wrongly have ignored this place for too long and finally paid it a visit with a mailed in coupon for free guac. The guac was spot on and the their patio was great for the summertime weather.<br><br>As I said before, this place has delicious. Their special of the night was a perfectly charred grilled red snapper which I settled upon a polenta cake. My girlfriend had a stuffed the most delicious risotto stuffed squash - at a mexican restaurant! Unbelievable.<br><br>You just gotta go and see it for yourself!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/bdbRXeDXcXIgWLTSnvdIQw/168s.jpg", "caption": "Red Snapper topped Polenta cake! Delish!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/hc5CHkB1XehsKNh0B7H50A/168s.jpg", "caption": "Stuffed Squash with Risotto! Yum!"}]}}, {"review": {"des": "I'll keep this short and bitter. <br><br>Very attentive staff that was extremely polite, but I felt they hovered and I could not engage comfortably in conversation.  Fresh guac is always nice, but I don't want to hear you mashing it for other customers on a wobbly, tiny table a few feet from me for the duration of my *entire* meal. Irritating as all hell.  Insanely overpriced. I'm sorry, but it's nearly $20 for chicken fajitas that consist of ONE bland, sliced chicken breast and veggies.  My filet was good and seemed on point for price, but I've had much less expensive/tastier Sangria elsewhere. Was told a $28 carafe would provide 4 glasses. Catch is, they aren't wine glasses, but instead highball glasses.  I just didn't feel anything here was a standout..despite a dinner bill for 2 in excess of a $100, plus tax & tip.  For just a LITTLE more, I could have dined at a Fogo de Chao.  How they stay in business is beyond me. Yes, they smile. I would too if I was getting almost $30 for a carafe of cheap wine...just sayin'...<br><br> In summation, I dined in a nearly-empty, noisy sun-room with a sad view of tarp-covered patio furniture that piped in Top 40 tunes..while sitting beneath several burned out ceiling bulbs. Blah.  Honestly, I felt robbed and was bummed about the entire experience.  Quite the racket, Las Palmas. Never again.<br><br>Update:  Management contacted me with a far more personal reply to address some of my particular concerns..in a refreshingly kind and sincere manner. Reaching out to your customers demonstrates heart, and for that ..another star is certainly due. I'll keep you posted...", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/IPXZY-GeZhgq08472aMvUQ/348s.jpg", "caption": "$28 carafe of lackluster Sangria."}]}}, {"review": {"des": "One word. WOW! <br><br>We were planning on going to Big Star, but the wait was 40min and we were both very impatient and starving. So we ended up looking up similar cuisine on Yelp and Las Palmas showed up. Perfect! We decided to come here instead and were VERY pleasantly surprised. <br><br>The owner/server welcomed us right away. We ordered guacamole, some rib special on their special menu, tilapia taco, and pork loin. Their guacamole was freshly made (I saw someone standing at the guaca station and made it from scratch). It's definitely one of the best guacamole I've had. The rib special (don't remember the name) was AMAZING! The meat fell right off the bones, seasoned very well, and the sauce added a bit spice to it but not overwhelming. More importantly, it's already a lot of food and we haven't even had our entrees yet. <br><br>Then here came the entrees. My fish tacos were tasty and BIG, and there were three of them. One bite and I couldn't stop eating. My husband's pork loin was very moist and tender, which is really hard to achieve as most places have dry/tough pork loin. We think this was the second best pork loin we've had, behind Ruxbin (which is really nothing to be ashamed of, Ruxbin's pork loin is unreal). <br><br>In summary, this is one of the best Mexican places we've been to. And personally. I think it blew Frontera Grill out of the water.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/IZTtR9fwcVwi0fq85OKPdA/168s.jpg", "caption": "Tilapia taco"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/mcUzOiTX-JN6ynh9e3pFnw/168s.jpg", "caption": "Pork loin"}]}}, {"review": {"des": "First time at Las Palmas. Since Mixteco closed I was looking for a replacement-a place with not just rice and beans, tacos or burritos. Recommended by a friend. Cute little place, food was great-duck, pork and beef equally. Margaritas were potent and guacamole was freshly made a few feet away from our table. Nice music and atmosphere. The only minus-and this lingers in every review-is the customer service. One waiter for the whole restaurant on a Friday night. We felt a bit rushed when he was at the table and ignored when he wasn't. Definitely room for improvement. It wont stop me from going back!", "pics": null}}, {"review": {"des": "How I get through winter!  I'd probably be living back in Texas if it weren't for Las Palmas.  Perfect guacamole, and just really great food all around.  The staff is so sweet, it feels like I'm home every time.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/m67ZXsRiaKSLe1d38M6TFQ/348s.jpg", "caption": "Try an Ecomargarita!"}]}}, {"review": {"des": "Excellent margaritas, food is great, will be back!<br><br>Reading some of the other comments about poor or inattentive service, we certainly didn't have that experience.<br><br>Will be back!", "pics": null}}, {"review": {"des": "Modern Mexican food and spirits in a neighborhood spot catering to locals.  The scene is dark and boutique with amazing art that is instagram worthy.  if that's not your vibe then enjoy your time on the back patio aka sunroom.  Everything was vivid and festive.  The menu gears to be exotic but gravitates more to comfort food.  You can tell every recipe is somehow related to the family who owns and operates this Gem.  I loved every moment spent here.  Would def do it again.", "pics": null}}, {"review": {"des": "Las Palmas was a last minute destination, but our party lucked out on a Saturday night!  For starters, excellent salsa and frozen mango margaritas.  The delicious salsa had a slight kick but this didn't mask the other flavors.  My entree, the mar y tierra was immensely enjoyable.  The steak, jumbo shrimp, sauteed spinach and sweet potato purée offered a balance of sweet and savory, and everything was cooked perfectly.  I also had a taste of my boyfriend's enchayotada - corn tortilla stuffed with veggies covered with queso cheese and it was a delectable vegetarian option.  The icing on the cake was live mariachi music, which started around 7:30.  Great food, and the lively atmosphere at Las Palma's sets the scene for a fun night!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/l6WFDigf9RIA3IEE6LxRKg/348s.jpg", "caption": "Mar Y Tierra"}]}}, {"review": {"des": "Loved this cozy little gem! Had my birthday dinner here and ordered 2 guacamoles (at different spice levels) which was fresh and delicious. The coconut mojito tasted like a piña colada which was fun. The chicken fajitas were perfectly cooked and was nice having a side of beans cheese and pico de Gallo. Was disappointed the guacamole wasn't made in front of you because I heard it was. Otherwise friendly staff great experience.", "pics": null}}, {"review": {"des": "We went here to celebrate a special occasion. The waiters and staff were friendly, helpful, and attentive to any request we had. My husband and I come here often and always enjoy the consistency in the quality of food we receive. Their drinks are always well made and delicious. This is a great date night spot! Love the back room!!!", "pics": null}}, {"review": {"des": "Familia Rivera, Thanks for a great dining experience! I had dinner at this great restaurant on a Friday evening.  I met some friends there and from the moment we walked in it was a great experience.  It's family owned restaurant and the family is there to greet you and serve as well.  We walked and in decided to have dinner in the back patio.  It was a beautiful summer night and there was a guitar player singing boleros in the back. The music added to the relaxed but romantic mood of the restaurant. <br><br> We immediately ordered some margaritas.  I had the Jarochita margarita, it was a vanilla bean and pineapple infused tequila with a little rum.  My friend had the pepinada, also great.  <br><br>For dinner I had the camarones al mojo de ajo and and my friends had La Calabaza. The entrees were delicious! We even had a Chicago Star show up and sit next to our table.  Ozzie Guillen had dinner right next to us! He let us take his picture and even took a picture with us!<br><br>We really enjoyed dining here and I hope to go back many times for lots of special dinners!", "pics": null}}, {"review": {"des": "Visited with some friends for dinner a while back. Unassuming store front, but really nice when you walk in. We were seated immediately in the rear seating area. The rear seating area feels like sitting in a greenhouse, an enclosed glass room. Very nice as you can see the sky (someone posted a picture of the rear seating area). <br><br>Ambiance was laid-back, white table clothes, and low-lighting. Service was attentive and pleasant. <br><br>We started off with a pitcher of the premium margarita. It was decent and kept us jovial. We also ordered queso fundido appetizer, very good! I ordered the Tacos De Pez , which is 3 pan seared tilapia tacos topped with jicama and mango slaw. They were served on corn tortillas. Fish was flaky, seasoned well, and light. <br><br>Overall, great service and delicious food. Although the tacos were great and I would eat them again, I don't know if I would pay $17-$19 for 3 tacos. - 1 point", "pics": null}}, {"review": {"des": "We love Las Palmas! Must get appetizers and save up your appetite for a lot of food! I had the fish tacos- very mild Talapia with a sweet relish on top! Yummy! My husband had Fajitas and they were great too! Oh and don't forget the premium Margaritas! Yummy! Try the back patio- it's so cute.", "pics": null}}, {"review": {"des": "The best kept secret for a great Brunch place in Bucktown! I have visited Las Palmas several times for brunch and have never been disappointed. Great, clean, flavorful and fresh food combined with friendly service makes this a favorite of mine. Plus they have an amazing back patio as well as a green house. The decor isn't super hip or modern but they're not trying to be. The vibe is casual and the attitude relaxed. Go here for the best brunch cocktails and some mean eggs cooked up<br>Mexican style. <br><br>Added bonus- lots of seating and usually no wait time! Great place for brunch for all seasons.", "pics": null}}, {"review": {"des": "Las Palmas is a modern Mexican restaurant located on North Ave amidst all of the high energy happenings in the Bucktown/Wicker Park neighborhood of Chicago. They have a hopping back patio and a large dining room in the rear of the restaurant.  So, size can be deceiving from the front.  <br><br>The decor is a bit dated in the back dining room and it's awkward getting from the front of the restaurant to the back passing through a \"working area, \" but you will get over all if that when you taste the food.  YUM!  Averaging $17-22, all entrees from the scallops, to the pork chops, the fish tacos, skirt steak and rack of lamb were cooked to perfection for our group of 12 with interesting sauces and sides. That's hard to do!  <br><br>The only thing that's missing is tres leche for dessert.  The dessert menu was just ok.  <br><br>Thanks for a great meal Las Palmas!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/WOMXz-3Aa11QscaYlyub7Q/168s.jpg", "caption": "Pork chop"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/9jhOPuzbZbZ0GXIIENdV2w/168s.jpg", "caption": "Rack of lamb"}]}}, {"review": {"des": "I gave Las Palmas a try for a recent early weekday dinner prior to a show at the Hideout, and I was glad I discovered this upscale Mexican bistro. The menu features amp'd up Mexican favorites as well as new interpretations of bisto dished from other cuisines. Good menu choices, compact wine list, fairly priced.<br><br>VIBE:  Pleasant room, cozy, cute décor but not trendy. Eclectic Latino-tinged music at conversation-friendly level. It was nearly empty when I was there, so noise was not an issue.<br><br>SERVICE:  Cordial, attentive but not rushed. The proprietor circulated and warmly greeted a few regulars while we were there.<br><br>LIKED:  Someone in the kitchen knows what they're doing -- nice menu, well executed. Good flavors all around. Amazing molé (chocolaty, nutty, chili-kissed) on the lamb chops (borrego). Tender (and not stringy) cochinita pibil (pork shoulder) in a superb sauce. Corn tortillas and tortilla chips were very fresh & tasty, not greasy at all.<br><br>This was a real find for me. I don't often dine in the Bucktown neighborhood, and this is a great choice (as is nearby Cumin). I'll make it a point to be back.", "pics": null}}, {"review": {"des": "First of all, order the shrimp fajitas because the shrimp here is seasoned to perfection. Let me know when you guys decide to launch cooking classes because I'm game. Also, my service here is always great. The waitstaff is always super friendly & super quick. It can get pretty busy on the weekends so definitely call in advance to make a reservation. Oh, & if you're a fan of Mezcal, then make sure to ask for Mezcal margarita pitchers & take the up charge because it's worth it.", "pics": null}}, {"review": {"des": "Best Mexican restaurant and food in town!! My favorite place and I highly recommend it! The staff is great and always takes amazing care of us. The food is magical. The drinks are delicious.", "pics": null}}, {"review": {"des": "We got delivery from Las Palmas and had a fantastic experience.<br>We got the La Calabaza and the Enchayotadas (both vegetarian). Both were absolutely delicious. I will 100% be eating here again!", "pics": null}}, {"review": {"des": "After a few hours of shopping at Akira, we asked for a recommendation for food closely and the ladies told us that Las Palmas was delish, so me and my visiting CO gf stopped in. We were greeted kindly by a gentleman who allowed us to first view a menu to see if what they had to offer was what we wanted to eat. We decided Yes and sat down.<br><br>We had fresh made guac, which was delightful, the seafood empanadas with peanut sauce...oooohhhh eemmmmm geeeee, the crab cake, which was fantastic with the little cubes of avocado and onion (nice touch) and some sort of other seafood thing. All I can remember about it is...more please!!!! I even took food to go for my sweetie, which he loved!<br><br>Thanks, Akira, for the delicious recommendation!!", "pics": null}}, {"review": {"des": "This is a beautiful little nouveau Mexican establishment that takes your classic Mexican dishes and elevates them to something new and unique. <br><br>The atrium is a gorgeous space in the back of the restaurant that is essentially a greenhouse with ample space and lots of sunlight. It's always fun walking through the front section to just open up into this gorgeous green space.<br><br>The chips, salsa, and guacamole are tremendous. They make the guacamole at a central table--so it's not quite table side, but you pretty much watch them do it. The service is also excellent, so those chips never run out.<br><br>The menu is an absolute gem. The Casa Barroacha is essentially their house steak, and I'm not usually a fan of steak, but this is steak that is essentially soaked in a flavorful tequila all day and served in absolute marinated perfection. La Calabaza is essentially a saffron risotto that is packed full of flavor and incredibly savory. The taste lingers, and it's definitely divine.<br><br>Las Palmas offers some American favorite dishes too, like steak/chicken/veggie fajitas or queso fundido, but I wouldn't necessarily recommend these staple items since they really thrive in their creative masterpieces.<br><br>I will definitely be back for more!", "pics": null}}, {"review": {"des": "Stopped in for breakfast/brunch on a Sunday morning right when it opened.  Service and food was phenomenal!  Very attentive and got a great family/caring vibe which I think many restaurants don't have.  We sat on the patio and the second it started to drizzle the servers came to assist in helping us move inside or under the umbrella (per our choice) The fresh made guac was so fresh and delicious- they even accommodated my low tolerance for spice and my boyfriends non existent tolerance by giving him side of diced jalapenos.  Can't wait to come back here for lunch or dinner.", "pics": null}}, {"review": {"des": "Las Palmas North Ave deserves 6 stars. My wife and I are big fans of the one in Naperville, so having moved to the city we had to try this one. Starting off, I've never had tequila that actually tasted good, until the manager Rick welcomed us with some of their home made blend, it was fantastic. The margaritas were incredible as well. The chips and guac were out of this world. I asked or waiter for his favorite menu item with pork, and whatever he brought me was by far one of the best meals I've have in Chicago, bar none. <br><br>As a side note, I've known the manager Rick since college. He was a very hard worker in college and he is a very hard worker today. He really does a great job with the restaurant, it has a perfect Wicker Park vibe. It's easy to tell when someone is passionate about what they do, and Rick is very passionate. <br><br>I'll be going back to Las Palmas at least once a month if not more!", "pics": null}}, {"review": {"des": "The food I tried at Las Palmas is not what I would have expected, but was absolutely amazing. Each plate we ordered was thoughtfully made and executed to perfection with beautiful presentations. The calabacita appetizer blew me away, I could eat that every day. The drinks were pretty good, but not as amazing as the food.  The service was friendly, although slow; worth the wait in my opinion.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/o1DzPhY9Uq_RRG4vdVSDxg/168s.jpg", "caption": "Pollo relleno"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Vph-hmVnweREFgUrEH7EfA/168s.jpg", "caption": "Calabacita"}]}}, {"review": {"des": "Outstanding selection and presentation of entrees. We had a large party so I tasted the squash, fajitas, bbq  & all were excellent. Loved their custom made guacamole too.<br>Have sat out & inside - like both.", "pics": null}}, {"review": {"des": "Las Palmas is a great restaurant with great food and service!<br><br>I came here for date night a few weeks ago, and was glad to have done so! We were seated right away in the back room which had a great ambiance. The waiter was very attentive, and our food was ready very quickly!<br>We started off with chips and salsa, and my only complaint was that they were so yummy I was halfway full before my entree was ready! <br>My SO had the skirt steak, which was delicious. But the garlic shrimp... I had the garlic shrimp, and it was AMAZING. My SO kept trying to trade me some of his steak for my shrimp, but I wasn't having it!<br>One of the impressive things about Las Palmas is the way all of their dishes come together with flavors that perfectly compliment each other. Many restaurants add sides or garnishes just for presentation, but the Las Palmas chefs really pay attention to how each flavor will work together. <br>I really recommend this place for great Mexican food!", "pics": null}}, {"review": {"des": "Family owned business...always feel at home when i do e there. Service is top notch, very accommodating. Kid friendly. The margaritas there are the best! Foox has a unique healthy twist to it, excellent quality food.", "pics": null}}, {"review": {"des": "Tried this place for the first time today for brunch. Didn't know what to expect as I didn't read any reviews beforehand. Tried the crab cake w/ avocado & jicama, Mexican hot chocolate, huevos verdes, and huevos con chorizo. The crab cake was delicious! Very well done. The jicama added a nice crunch texture to the dish. I was sold. <br><br>The huevos were good too. Came with warm fresh tortillas. Mexican hot chocolate was yummy also. <br><br>I'd come back to try their regular menu. Everything we ordered was done very well. Not your average Mexican joint.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/UAYhFUogZmpyJCi7tWqMpQ/348s.jpg", "caption": "Huevos verdes"}]}}, {"review": {"des": "Met the owner and his son and I have to say that they know how to run a business. My group came here for a birthday party but people came about an hour late. Despite this, they held our table and treated us with utmost respect.<br><br>As for the food, the skirt steak is <a href=\"/redir?url=http%3A%2F%2Fbomb.com&s=bb4f996415a9c2f21137e27cfb68f439a48cec2652b53e9b50dd7e766dbe177e\" target=\"_blank\" rel=\"nofollow\">bomb.com</a>. Well marinated and packed with bold flavors. Also, if you think that the standard salsa isn't spicy (I sure as hell didn't), ask for their special HOT ones. Seriously....I'm Asian and I thought that 'ish was spicy. First couple of bites I felt brave and kept getting larger and larger portions until my tongue decided to shut down on me. Too manly to ask for milk either so I just accepted my hot and spicy fate. <br><br>Oh yeah, Sangria is good to boot. Waiting staff here is funny too as we asked them for slang translations in Spanish and they laughed along with us. Definately come give this spot a try.", "pics": null}}, {"review": {"des": "OMG the best Mexican enchiladas I have ever tried!!! And the watermelon monitors!! Delicious, I usually try to go there once a week and never disappoints me! Great food, great drinks and great customer service!! If you go you have to try the enchayotadas!!!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/jrbQktPATNGRGUF2TH_CAw/348s.jpg", "caption": "Watermelon mojito!!!"}]}}, {"review": {"des": "Love this place! Always great, attentive service and the food is amazing. <br><br>In summer I love sitting out the back, in winter the fireplace at the front of the restaurant is really cozy. <br><br>Would definitely recommend.", "pics": null}}]}