{"name": "laschets-inn-chicago-2", "reviews": [{"review": {"des": "Great food - visited Chicago from Australia and was craving something that wasn't a chain or made big bold claims.<br><br>This German place is authentic, of quality and tasty. <br><br>During my 3 day visit, I came twice despite being based downtown.", "pics": null}}, {"review": {"des": "Pretty excited we finally found an awesome German restaurant not far from where we live. It looks like you've literally stepped into a restaurant in Bavaria -if they had a mural of Neuschwanstein Castle on the wall, you might be convinced you were indeed there. <br><br>I've been craving Weiner Schnitzel, Spaetzle & Red Cabbage. If you peek at my attached photo, you'll see my dreams came true and everything was pretty perfect. Their German Beer List gave detailed descriptions of the flavors you could expect which was very helpful. Everyone at the table was very happy with their selections and we all left stuffed.<br><br>They had many Octoberfest specials as well as daily specials that all sounded great and 2 portion sizes are available on many dinner options - we all ordered the smaller size which was more than sufficient. This lovely little restaurant will be added to our regular rotation.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/mTvMYSY2GzeedxHtOxL4rA/348s.jpg", "caption": "Wiener Schnitzel with Red Cabbage & Spaetzle - YUM!!"}]}}, {"review": {"des": "If you're craving German food, Laschet's will satisfy the craving. If you're a German cuisine connoisseur, you might be disappointed.<br><br>Came for dinner during prime time on a Saturday night and didn't have to wait. :D I ordered the Wiener Schnitzel's \"small\" portion, to which our waiter said I might be disappointed with its size. I was not disappointed with the size - it was perfect, granted I do eat less than most people. The small portion is one slice of veal about the size of a slice of bread while the regular size is two of those slices.<br><br>The schnitzel is thin, though not the thinnest wiener schnitzel I've ever had. As always, best when doused with lemon juice! Accompanying the meat is potatoes and red cabbage or sauerkraut. Potatoes had a nice bit of a crisp on them but weren't seasoned so I suggest requesting some salt (or tough it out to be healthy, which is what I did). I found the red cabbage to be extremely sweet and quite tart. Not sure if that's how it's supposed to be but I'm not a fan.<br><br>Prior to the meal, they also give you a small loaf of that delicious dark brown German bread. Usually not big on it but I am when it's served warm with butter on the side. The schnitzel (and I assume all entrees) was also served with a soup or salad. I got the mixed greens salad with bacon vinaigrette but found the dressing to be too sweet as well. Didn't help that it was a ton of dressing.<br><br>Other than the food, atmosphere is exactly what you'd expect from a German restaurant: wooden tables, minimal lighting (but still bright if that makes sense), and German decor. In a word: rustic.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/j42zcxjlucxhub42tUNs9g/348s.jpg", "caption": "Wiener schnitzel (small)"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/wktYlUZvRdwicJdJELgqnw/168s.jpg", "caption": "Wiener schnitzel (regular)"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/1-ccP1f4Cs3LscIUn2fjww/168s.jpg", "caption": "Mixed greens with bacon vinaigrette"}]}}, {"review": {"des": "I love Laschets. Great German food and a good beer selection.  The appetizers are all good, but my favorites are the Hackepeter and the Crab Cakes. I tried a new beer, for me anyway, the Stiegl Goldbrau (very smooth with body to it). The main course is my go to, the Wiener Schnitzel , which is the breaded veal, absolutely delicious. I like to have it with the Red Cabbage and Spaetzle. Great German food, with great service and atmosphere.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/9MMo7LN7MJeXYp-ht4HNWg/348s.jpg", "caption": "Apps + Beer  = Prost"}]}}, {"review": {"des": "I can't figure out if this place changed or I did. It's been almost six years since I moved out of Chicago, and when I lived here I considered this my favorite restaurant.<br><br>I hyped the place up to my girlfriend and was super excited to visit, but I was pretty disappointed. The pretzel was good, but I've definitely had better. It only comes with mustard so you have to specifically ask if you want the superior cheese dip as well. The spätzle was okay, but pretty bland. The potato pancakes were also just sort of okay, but the sour cream that was served with them tasted off somehow so we didn't eat it. We wound up bringing most of the pancakes home and eating them the next day with store-bought sour cream and they were much better.<br><br>Our server was also a little awkward; he mumbled a lot and made some jokes that didn't really land. There was also a weird vibe in the restaurant that night. The best way I can explain the vibe is just to tell you that there was an approximately 11-year-old boy using a kick scooter riding around the restaurant and he scooted past our table at least four times. His mom didn't seem to care, nor did any of the employees of the restaurant. It was a strange experience.", "pics": null}}, {"review": {"des": "Came for my birthday after wanting to visit for some time. Shared the pretzel (delicious) and I ordered the reuben (okay but lacked meat-less than half sandwich had any). Bf ordered pork and the creamed cabbage was exceptional! Sauerkraut was also wonderful. Took a piece of apple strudel home and it was 5 star. Super buttery, flakey and loaded with apples...highly recommend and I never order deserts! Nice small family restaurant/pub.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/zjquVsq9AUNVQGO5IBqdJA/168s.jpg", "caption": "Reuben"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/cw3vSPLSo_R6PvxqWM4P2A/168s.jpg", "caption": "Pretzel. 5 star!"}]}}, {"review": {"des": "Driving down Irving Park Avenue you could easily miss this summer lace. Looking at the history, this picture lace was a former Schlitze Beer Bar. When you walk in you walk through the bar area. We came as a group and ordered three appetizers, cold sausage sausage tray and the potato pancake, all were good. I ordered the duck special, it was good, goo Lisa was good and Wiener schnitzel was good. The only complaint was the cucumber salad was not to our liking.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/a-DThZU3SvE4Id_mD0Fxdw/348s.jpg", "caption": "Beer menu page 2 of 2"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/swR2-BjnDu_T06SQi-PFeA/168s.jpg", "caption": "Draft beer list page 1 of 2"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/BqQmYigRowWbbsmdhw33Zw/168s.jpg", "caption": "Menu page 7 of 9"}]}}, {"review": {"des": "Fun, fun place to be drinking at! I keep coming back here coz of two reasons- my friends live across from here and Scott!! He's the best bar tender you could ask for! I walk in and and don't even have to tell him what I want, my beer is always ready for me by the time I sit down! He remembered me and what I drink right from my very first visit. <br>I know they have good food (according to my friends), even if I haven't had the chance to have any yet. They also have live music on certain days of the week.", "pics": null}}, {"review": {"des": "We had an amazing time at Laschet's and we're so happy that Erika from Rare Dirndl (<a href=\"https://www.yelp.com/biz/rare-dirndl-chicago\">yelp.com/biz/rare-dirndl…</a>) sent us there after our visit in her shop. We always sit a the bar in drinking establishments and the bartender was amazing to us. She served us some great bier in authentic German glasses. She was even a good sport when we tried to buy them off of them for $50 bucks a pop and then some-those glasses are priceless gems guys!! While we didn't leave with German glasses we did leave with full tummies!<br><br>All the food is authentic German food and that means a lot of meat and potatoes as well as hefty portions. We shared a meal and were more than stuffed after finishing. The potato pancakes were great but the Spatzle was AMAZING! (Highly suggest getting spatzle!) the meat was so tender and flavorful and you could tell everything was made with love! <br><br>If you haven't tried Laschet's yet you definitely should. Grab some great German bier and bring your appetite. If we had more time to explore Chicago we definitely would have made Laschet's a repeat adventure. Prost!!", "pics": null}}, {"review": {"des": "Let's talk about these potato pancakes. LET'S JUST TALK A MINUTE ABOUT THESE HERE POTATO PANCAKES, OKAY? I ordered the dinner, which comes with three potato pancakes and soup or salad, because I figured, \"Hey, I like potato pancakes, and I could definitely eat three.\" Wrong. So wrong.<br><br>First of all those things are huge. Second, they are dense. Third, they are... not what I expected. When I think of potato pancakes, I tend to think of those hand-formed, crispy-on-the-outside, slightly-soft-on-the-inside messes you get at delis. These... weren't. That's not to say they weren't pretty good, for what they were. They were just... different. And hard to eat with a fork. I ended up using my hands, ripping them to pieces, and dipping them in the sour cream and apple sauce. I also ended up taking one whole pancake home. <br><br>The house salad dressing is a warm bacon vinaigrette, which ain't bad at all.<br><br>Atmosphere is low-key and authentic- either the hipster assholes haven't found it yet, or they've skipped over it. <br><br>Service was a little uneven and harried when I was there, but the place was also pretty crowded that night. One of my dining companions couldn't finish her meal, and planned to take some of her food home, but a busser swept her plate away before she could ask for a container. (Lose one star.) She told a server about this, and he brought her a container with another full serving of the dish, free of charge. (Add star back.)<br><br>Front entrance is not 100% accessible for the mobility-challenged, as there is a step up to get inside, and a narrow turn once you enter. <br><br>Street parking. <br><br>They have outdoor (sidewalk) seating, when the weather allows.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/85zI9pmPj8kYnv2JEATIAw/168s.jpg", "caption": "Poor Bambi."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/PgP7SHVaKxvgObO-h8aRyQ/168s.jpg", "caption": "Potato pancakes dinner. The appetizer is 2 pancakes. The dinner is 3 pancakes, plus a soup or salad. Each pancake is about 6 inches across."}]}}, {"review": {"des": "We LOVEEEEEE this place!!! A MUST go German restaurant/bar. The sausage platter is awesome & service is wonderful!!!", "pics": null}}, {"review": {"des": "A nice old world atmosphere in the heart of Chicago. The service was good and the food was good, for the most part. We started with a jumbo soft pretzel. It comes with a Dusseldorf type mustard and we added their cheese dip, which was okay, but nothing special. If I had it again, I'd stick with the mustard.<br><br>My hubby had the Stroganoff special and liked it. It came with egg noodles and veggies. The portion was huge. I had the mushroom goulash. It came with really good red cabbage. Now, I LOVE mushrooms, but I found this had a slight bitter aftertaste. I don't think I would order that again. We both had soup and they were okay. <br><br>I liked Laschet's, but I didn't love it.", "pics": null}}, {"review": {"des": "The German pub scene is solid here in Chicago. Laschet's contributes greatly to this, possibly having the best kitchen of them all. Beer, good. Liquor, sure. But what can a restaurant/pub do that separates them from the rest? Laschet's has 10+ items on their menu that can answer that question. <br><br>Oh, you get a free shot for \"dessert\" after your meal, too.", "pics": null}}, {"review": {"des": "Pretty awesome German environment. Amazing roast chicken as part of their Oktoberfest menu!! The cucumber salad was nice, the jumbo pretzel pretty great too. The mustard tasted very nice as well honestly. It's not the most posh area or location, but it adds to the pub ambiance. Portions are really large so make sure to share entrees if you have a small stomach like me.", "pics": null}}, {"review": {"des": "Found Laschet's about 3 weeks ago in a yelp search. Went to the CHICAGO Brauhaus in Lincoln square to find it closed its doors. My yelp search showed Laschet's and I am so pleased!<br><br>The food is great. And the waitstaff friendly. First visit pa a Saturday and got the roasted pork shank special. Outstanding. Here today on a Sunday for the roast duck. A full meal with soup or salad. A great value and truly good food. Probably one of the last bastions of German food. <br><br>The menu is well balanced with sausage platter options, schnitzels and other<br>Specialties. The crowd seems to be regulars and families that have probably come here for years. <br><br>Great job by the owner (whoever he is)!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/1CLpyGJh5A3Rb6hsCkKRPw/168s.jpg", "caption": "Roasted pork shank. Saturday special dinner"}]}}, {"review": {"des": "Free shots!!!!! Who wouldn't come for that?!?! The mushroom dish is amazing and very filling.<br><br>The potato pancakes are a must to start. Great beer selection, go for the large!<br><br>Fun atmosphere wife a large group of people. Food comes out quick, service is great and you can't beat the prices.<br><br>I'll be back to try the shrimp dishes!!!!!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/C1pM_nU8906iQPTZKFH3CQ/348s.jpg", "caption": "Heaven on a plate!"}]}}, {"review": {"des": "Laschet's Inn does everything right. It's an unassuming, family-run and family-friendly German restaurant and bar in Old Irving that serves truly terrific food, has some of the best beers I've ever tasted, and serves everything with a smile. Every dish we've had here is a winner, with the beef rouladen and the spaten and red cabbage a personal favorite. German food is the very definition of hearty, and this is no haute-cuisine type of place, but for a great meal at a terrific price, it's at the top of our list, and we return time and again. Kudos to the owners. Highly recommended!!!", "pics": null}}, {"review": {"des": "Felt rushed the entire time we were there, on a Friday night. The pretzel showed up after our soup. The food was ok but the server seemed in  a hurry to get us out, even though there were others coming in as we finished our entree.", "pics": null}}, {"review": {"des": "I'm only writing this review as a public service announcement. Chicago used to be filled with German restaurants and now there's hardly any to be found.  I noted Laschet's had 4.5 stars and the menu sounded really good.  My sister and I went to check it out.  I'm not even going to talk about the outdated decor.  My sister ordered the chicken paprikash and I had the chicken schnitzel.  We both had spaetzle and red cabbage.  Unfortunately nothing was really edible.  The food had no flavor but still left a bad taste in my mouth.  The red cabbage was so tart.  <br><br>On top of everything it was not cheap.  Maybe they have good beer but I don't drink so I wouldn't know.", "pics": null}}, {"review": {"des": "My favorite place for German food in Chicago since 2008! Never disappoints. Great traditional food, amazing service, and perfect beer selection in a home like atmosphere. Love it. Prost!!", "pics": null}}, {"review": {"des": "Interesting ambiance typical neighborhood Chicago German pub, good food, great beers and service, terrible potato pancakes.", "pics": null}}, {"review": {"des": "Authentic German food and taps. Enjoy potato pancakes, Spätzle, Schnitzel, and finish it off with a shot of schnapps. Amazing food, great staff. Restaurant is in two halves. The entry is a bar, the back is the restaurant. Just walk up to the stairs and wait for a waiter to seat you if you want food. Love this place.", "pics": null}}, {"review": {"des": "Have been coming to this institution of an establishment since I moved to the northside 28 years ago. Had a hankering for German food and despite the warm weather went and filled up on their delicious potato pancakes, bratwurst, sauerkraut & german potato salad, sauerbraten with spaetzel and red cabbage. <br><br>All delicious! Love their potato pancakes! <br><br>Great beers served cold and in various large steins.<br><br>Great Friendly service. Relaxed atmosphere after work. Had some games on and just regular folk hanging out. Wish I still lived a block away.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/6T8XiWDQxPL33NpJUk3_eA/168s.jpg", "caption": "Bratwurst, German potato salad and sauerkraut"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/e-dQdhITQ3l-OF1apemV9Q/168s.jpg", "caption": "Potato pancakes with sour cream and Apple sauce"}]}}, {"review": {"des": "Excellent German food priced right.   We were about 40 for a party and the two servers handled everything courteously, efficiently and smoothly.  The décor some complained of was not relevant; this was not a date or night out; we don't eat décor and the outdated motif suited me just fine.  The restrooms were clean and on the same floor.  Water, soda, drinks were taken care of promptly and correctly.  Children got their special orders quickly, and the chicken fingers and fries smelled and looked great.  The seating was in a long L-shaped configuration and was roomy enough.  Pretzel appetizers were a big hit and the mustard was a perfect complement--not too much horse radish, not too little.  Everyone could've eaten more pretzels. Pumpernickel was on the tables as well.  Then, there was a choice of garden salad or cucumber salad; liver dumplings, split pea soup or a pineapple salad.  The mains were served family style:  chicken schnitzel, frikadellen, meat goulash and mushroom goulash with tons of red cabbage and sauerkraut. I chose the cucumber salad which was outrageously good; slight kick, not as sweet as some versions, and amazingly a good sized portion.  The frickadellen was pan fried crisply and the ingredients were very fresh and in proper ratio.  Both versions of goulash were hearty and tasty, sauce was rich and thick, meats were plenty and devoid of gristle or fat. The schnitzel was very plain and bland, but this was an order for those with simple tastes who might not want anything tart, saucy, spicy, sweet or too salty.  The red cabbage was on the tart side but very edible, as was the sauerkraut. We might've overstayed our time but as no one was using the area, management never bothered us.  The oodles of leftovers for the guests were placed on a table with stacks of takeout containers and plastic bags; still there were a week's worth of food for the host and hostess.  A truly fine dine.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/d7XYZcqMNaOI1eSVzezf4Q/348s.jpg", "caption": "Fine reasonably priced German food"}]}}, {"review": {"des": "Delicious draft beer. Cozy feeling. Authentic German food. Everything was good.<br>Relaxing atmosphere. Hole in the wall gem. Grandma's man cave German Pub.<br>Sports on TVs. Large glasses. Prost! Cheers!<br>Large portions. Warm. Satisfying.<br>Cold day? Warm up here.<br>Nice foreign staff. Happy people everywhere.<br>All food Authentic German. Oktoberfest everyday here.<br>Will be back for sure. Sunday afternoon was perfect!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/HXDfWYO2wAGMt2FlB-Q_sg/168s.jpg", "caption": "Hofbrau Original 1.0 L"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/TZPGzG6_e13l3LYxHv5k4g/168s.jpg", "caption": "Interior shot of bar with TVs."}]}}, {"review": {"des": "Fabulous meal! We visited in part from a friend's recommendation and in because Chicago Brauhaus has proved impossible to visit as their days come to a close.<br><br>The beef stroganoff was to die for, as was the Wiener schnitzel and the sausage plate. The portions are huge - come prepared to take food home afterwards.", "pics": null}}, {"review": {"des": "Authentic German food.  The portions are big like the beers!  Started with the pretzel which was perfect.  Three different people could not finish all their food.", "pics": null}}, {"review": {"des": "Theee best German place in Chicago. Head there on Tuesday for the chicken paprikash meal (if they still have it... otherwise everything else is amazing!!) and let your mouth water! Service is wonderful and they all make you feel like family when you're there.", "pics": null}}, {"review": {"des": "Come here for beer and colossal sized pretzels to share. I thoroughly enjoyed my julius weisse (man that was good) and my carb-loaded, salt-laden as-big-as-your-head pretzel. Something was up with the food though. The schnitzel was breaded perfectly yet lacked flavor. The spaetzel was a tad too crumbly and also had no flavor. The red cabbage was pretty good but the rest of our dishes just were missing something. It's a step up from pub grub that's for sure. But let's not get carried away here. When you come wear jeans and root for the home team.", "pics": null}}, {"review": {"des": "The sausages are good here.  The beer is great-or should I type bier?  The atmosphere is really great too.  Old time German place-Chicago style.  Service is great and the people that habituate the place there are nice.  The warm bacon dressing on the salad is authentic.<br><br>Here is my beef.  I want them to raise the quality of the sauerkraut and potatoes.  I'd like them to use something other than a Ritz cracker.  I want better dill pickles on the sausage plate (and more of them) I'd appreciate high quality butter with the loaf of warm rye bread which tastes oh so good.  I'd like the kitchen to have a bit more of a refined touch-not high end, just refined.", "pics": null}}, {"review": {"des": "HUNGRY???<br>Then Laschet's Inn is the solution!<br>Generous portions of mouth-watering, satisfying CARBS, PROTEIN & SAUERKRAUT.<br>Cold German beer in big, tall glasses.<br>Delicious dark rye bread.<br>Choice of 2 house-made soups of the day or salad with warm bacon vinaigrette.<br>Menu is large: daily specials, something for everyone -- even vegetarians (e.g. mushroom goulash with spaetzel & red cabbage).<br>Save room for dessert: choice of house-made apple strudel or apple crisp, also Lutz' German chocolate cake.<br>Complimentary after-dinner shot of schnapps or brandy.<br>Decor & ambiance is classic: dark wood, mounted deer heads & antlers, lots of booths & tables, German polkas.<br>Great, professional service! <br>Our first time to dine at Laschet's Inn.<br>Cannot wait to return!<br>A gem!", "pics": null}}, {"review": {"des": "Best German schnitzel ever. The red cabbage is also awesome! All the bartenders/staff are friendly and fun. My husband's and I's favorite bar by far. :) fun late conversations about Star Trek to sports are the norm.", "pics": null}}, {"review": {"des": "Lace me up in one of those traditional dirndls and put an Oktoberfest beer in my hand...then I will be the German lady fit to dine at the wonderfully authentic Laschet's Inn.  It was so very charming on the inside that I felt as if I had just turned off of the Autobahn and waltzed right into a regular ole neighborhood hang-out.  I sure felt like I was welcomed with open arms - I wonder if they could tell that I was German?  As if my Hans Gruber-like wit and height didn't give it away?  <br><br>Anywhooo...I have been dying to come here for over a year since my first attempt hadn't panned out the way I wanted to, to no fault of their own.  When walking up to the restaurant I could smell all of those super delicious goulashes and chicken paprikashes.  In fact, they smelled so good that I had to order that in addition to a boatload of other things to satisfy the German monster roaring in my stomach.  The special of the night (Tuesday) was Chicken Paprikash which of course came with spaetzle (the tastiest spaetzle ever) and red cabbage.  On the other nights of the week they offer different specials, all of which are probably to-die-for, but if you're able I would recommend coming here on a Tuesday night for this particular dish.  A bonus is that it's quiet during this night so you can stuff your face without feeling watched by judgmental on-lookers.  <br><br>In addition to the Chicken Paprikash - a truly spectacular dish, done exactly the way it should be done (round of applause!) - we ordered the Hackenpeter (aka steak tartar), Bavarian pretzel, goulash soup, a small order of Rouladen, two Oktoberfest beers and the densest German chocolate cake from Lutz's bakery.  The meal was perfect from beginning to end, but then again when is German food not the most perfect meal for any occasion?  Just as a sidenote: we came on a warm summer night, but this food would be best enjoyed during a winter night (preferably within a cabin).  In other words, I will be coming back to Laschet's Inn during the winter time to test my theory, especially since it does feel like a cozy little cabin in there.  <br><br>Back to the food - I've never had steak tartar before this, but after trying it here I don't think I'd ever want to order it from elsewhere.  I simply don't think that another place could make it as well as they did here.  The steak tartar was very pastey (as I am told it should be) and SWEET!  But wowza, when served on the rye bread and with capers it was stupendous.  I'm a steak tartar convert thanks to Laschet's Inn.  This was coupled with our order of the Bavarian Pretzel which was served with the best spreadable beer cheese!!!  I was already getting full at this pont (yikes) but persevered to indulge in the goulash soup (yum!) and both the Rouladen and Chicken Paprikash.  I don't need to obsess more over the Chicken Paprikash, but I must give a shout-out to the Rouladen which was interesting, but good.  Both of the entrees came with a choice of certain soups, but for an upcharge you can get the goulash soup.  Definitely choose that option.  We rounded out the food with the chocolate German cake which was so filling that I ate about 3 bites and saved the rest for later.   I actually saved about 3/4 of my meal for later...us Germans like our comfort food and we like our leftovers.  <br><br>Aside from the food we each got a pint of their freshly tapped Ayinger Oktoberfest beer.  Boy, it was delicious as ever.  Oh, and I almost forgot!  After our meal we were offered complimentary Schnapp's and we were able to choose from three different ones.  Go with the apple cider liqeur!  I had asked the waiter, Greg, where to get these delicious little buggers and he said they could be found at Gene's Sausage Shop in Lincoln Square.  <br><br>Speaking of our waiter, Greg - he was a very nice gentleman who was both attentive, but not overbearing.  I'm telling you - the Germans do it right.  I would go back for the food without a doubt, but I'd go back for the service as well.  Not only was the service great, but as I eluded to earlier, the atmosphere of Laschet's Inn is one that is very comfortable and homey.  <br><br>A tid bit that our waiter told us: Nick Floyd of Three Floyds frequents this place often...so for all of you cult followers, if he is a frequent flyer of this place then you know it must be good.  Truly, though, this place is one of my new favorite restaurants in the city.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/wr3NWzMMQcJnF1EfkSmvgQ/348s.jpg", "caption": "Complimentary schnapps for after the meal..get the apple one!  Mmmm"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/a9evtbuFVsAPLdG6JURKzg/168s.jpg", "caption": "German chocolate cake from Lutz's bakery"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/1myywA9Jv1WbtEQkorRapA/168s.jpg", "caption": "Chicken paprikash with spaetzle - special on Tuesday nights!  Go for this entree"}]}}, {"review": {"des": "The food is great, the beer is great, and the atmosphere is fitting to the German culture. Grab a liter of HB and some shnitzel! Not sure on how good the seating is, be sure to call ahead and beat the crowd, this place is poppin. <br><br>Potato pancakes are an awesome safe app to get, enjoy!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Uve3BVKhgdU5OJg5OR4GLQ/348s.jpg", "caption": "HB, on draft, the best german beer and food in the north side of Chicago."}]}}, {"review": {"des": "Great food, great service, great beer!<br><br>Personally I prefer Asian food any day over German food but there is something that intriguingly works well here. They were easy with substitutions and helpful. Since I wanted to try the sausages and goulash, my friend and I  ordered the sausage plate and regular goulash to share. Note to self: thuringer and knockwusrt were better than bratwurst. <br><br>The pretzel cheese was pretty awesome too.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/J4IrXRcqUP3eATnN3UamYw/168s.jpg", "caption": "Sausage appetizer"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/QFEdAmIQRjmtuJHBOCztcw/168s.jpg", "caption": "Goulash"}]}}, {"review": {"des": "Kitchen is not open on Mondays just the bar.  Yelp needs to update their info but they can't seem to get it together.", "pics": null}}, {"review": {"des": "Excellent German cuisine. The weinerschnitzel is the best in Chicago. Great German beer selection. I'll be back.", "pics": null}}, {"review": {"des": "Best German food in Chicago, hands down. I've been coming here for over 15 years, they also have a great selection of imported beers!", "pics": null}}, {"review": {"des": "Gosh, we love this place.  Great German beers on tap. Each gets served in it's own glass--always with the correct name.  The food is always really good.  Portions are huge. We often share and still take things home.<br><br>Friendly service.  The bar is very ecumenical--one TV has the  Cubs and the other the Sox :)<br><br>Goulash is always a good choice, rouladen is good.  Spaetzle is done perfectly.  I love the sweet red cabbage; hubby likes the sauerkraut.  The cucumber salad is always refreshing.<br><br>Can't beat the free shot after dinner, too!", "pics": null}}, {"review": {"des": "Excellent service , waiter is knowledgeable, friendly and told us his favorite dish! I went with hot sausage .love pretzel <br>Go there anytime <br>Enjoy awesome food", "pics": null}}, {"review": {"des": "My favorite German place in Chicagoland. Ever since college, when the guys would go out for wurst on Friday before boozing, I've had a thing for German food. Despite living in one of the largest German populations outside Germany, I couldn't seem to find a place that really gets me excited. There is a number of decent places, but I couldn'd find a clear winner. Until yesterday, when I tried Laschett's, which happens to be in my back yard. <br><br>The food was excellent, the portions large, and the service was good. The environment is a bit old and dry in the back dining rooms but the bar up front is cozy. Our waitress was so nice and attentive. It's really hard to find people like this. She was so enthusiastic about their food and even noted that she would come by on her day off to eat there. That's awesome. <br><br>Regarding food, we had the hot sausage appetizer, the goulasch with barley mushroom soup, and my wife had the potato pancakes appetizer as an entree. The hot sausages and accompanying bread and sauerkraut were very tasty. It was also served with hot mustard and horseradish. The portion was enough to be a dinner for 1-2 people. The accompanying bread was also very tasty.<br><br>The goulasch is some of the best in town. It's got a real zip to it. It was served with red cabbage with an intense (great) flavor and very good home made spaetzle. Again the portion was just enormous. I have more goulash at home in my fridge than I know what to do with. I'm also very excited for lunch as it was very good. I preferred the smaller chunks of meat to the bigger ones but that might be a personal thing.<br><br>Finally, the potato pancake appetizer as dinner. It's essentially a half-size order of the entree, which must only be ordered by Paul Bunyan or Andre the Giant. There was something like 8 large pieces of potato pancake. The taste and especially the crispy texture were fantastic. We also have a lot of this at home. <br><br>Anyway, please bless these hard working people with your business. They work really hard and provide a very tasty meal.", "pics": null}}, {"review": {"des": "I've lived in the city for years and have been wanting to come here. <br><br>Nice selection of Deutsche drafts, unfiltered too<br><br>The patio was pleasant and waitress was fun<br><br>Viennese schnitzel, spätzle, sauerkraut, thuringer and pâté were delicious<br><br>Will return sooner than four years!", "pics": null}}, {"review": {"des": "Service terribly slow.  Could not even get bread to start.  Salads took forever the come out.  Server not very friendly.  Probably will not return", "pics": null}}, {"review": {"des": "Such a fun and relaxed bar! Awesome place to grab some great drinks with some good company!", "pics": null}}, {"review": {"des": "Great beer, amazingly delicious fresh food, very nice staff, and perfectly German decor. While places like Hofbrauhaus are corporate and feel very fake-German, this place is nothing like that and is truly a little piece of Germany here in Chicago. I say that as someone who has spent some time in Germany eating and drinking at a lot of local bars in Munich, Stuttgart, and Fussen. This place feels as close to the real thing as it gets, minus the German speaking waiters. The food is always good with a great selection of sausage dishes and a wonderful soft pretzel. The prices for food are always higher than I'd expect them to be, but I guess that's due to fresh and high quality ingredients. On the other hand, the beer has always been affordable and there is of course an amazing selection of German beers. Please avoid the fake chains and go to a real German Inn like Laschet's.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/_denIfhoEFAskPkJfMBEzQ/348s.jpg", "caption": "Great beer, pretzels, and sausages for all!"}]}}, {"review": {"des": "We are from Columbus and love German food.  Saw the positive reviews and went outside the typical tourist spots. So glad we did. Great selection of German beers and huge food portions.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/zo1BgxqszY3925KO6-L4yw/348s.jpg", "caption": "Beef Rouladen"}]}}, {"review": {"des": "This place has great food and offers a very warm feel and atmosphere.   I came here over 25 years ago with a couple friends hitting some German bars and restaurants and when I walked through the door the place had not changed.  Bar up front and dinning in back.  Food is very authentic as this was the place we came with my friends brother from Austria.  It was his recommendation for authentic beer and food in Chicago and he was a chef. So you can't get any better then that.  Great experience again.  I won't wait 25 years to come back.", "pics": null}}, {"review": {"des": "This was the best meal I've had in a long time. It was busy Saturday at 7:00 (duh) but were able to sit outside thanks to a mild October evening. <br><br>We had a very hard time narrowing down our choices but chose the pretzel and crispy rolls to start. We were expecting more of a cabbage roll but it reminded me of a pork egg roll. Still delicious. The pretzel was like nothing I'd ever had. Crispy on the outside and sought on the inside. Great with mustard but we realized after that it would've been great with just butter too. This was followed by cream of potato soup, which was almost just like a bowl of buttery mashed potatoes. Heaven. <br><br>For entrees I ordered the small Wiener schnitzel which still had me wishing I was wearing maternity pants by the time I was done. It was fantastic. Exactly what I wanted. <br><br>My husband had the regular rouladen dinner. It was unbelievably good. The spatzle was to die for. My dad had the mushroom goulash, which I didn't try but he loved it. <br><br>We were too full for dessert but upon hearing it was my Canadian dad's birthday, our server (I think Gregory?) brought out an apple crisp with a candle for us to share, to show how the United States does birthdays right. If it wasn't the best apple crisp I've ever had, I would've regretted it. We finished with the complimentary shot of schnapps. <br><br>The whole meal warmed my heart and reminded me of my German family, the red cabbage tasting exactly like my Grandma's kitchen used to smell. I'll definitely be back!", "pics": null}}, {"review": {"des": "I'm being a little generous with the rating, but given how unique this place is (not what I would have said 20 years ago when there were plenty of restaurants like these), I'll give the benefit of the doubt.<br><br>Classic city tavern as one walks in - moving toward the restaurant, you can see it goes back away. Interesting decorations around the place - a deer head on the wall near the only 8 top I saw. Definitely an older place, but pretty well kept all in all.<br><br>But as I walked in to sit down and wait for the rest of my group, what I was noticing was the food. Large plates of good looking German food with generous portions. As I sit down and glance at the beer menu (didn't have my reading glasses, so had to wait until my brother showed up for the rest), I see numerous draft options. I go with a Pilsner which was perfect for my taste that night. All arrive and we order - for appetizers we get potato pancakes and the hot sausage plate which included bratwurst, knackwurst and a third one (thuringer?) that is escaping me right now. All were outstanding - the sausages surrounded a pile of sauerkraut. Now about the only time I'll eat kraut is when it's on a Rueben - but this stuff was amazing.<br><br>Our table had two rouladens and two sauerbratens. Personally, I like the darker gravy version of sauerbraten, but this stuff still passed. Good red cabbage... GREAT spaetzle - some of the best I've ever had. Dinners come with soup or salad (I had a liver dumpling soup that was good). For dessert, we had an apple crisp and an apple strudel at the table. Outstanding - perfectly done. One came with ice cream that was really good - thought it was a homemade brand, but come to find out, they buy it from GFS in bulk. Gotta go there and get me some ice cream!<br><br>Finally, the dinner ended with an offer of complimentary schnaaps - which 3 of 4 of us accepted. We ended up taking half of our entrees home. And what was nice - no sticker shock with the check - all of this is reasonably priced.  <br><br>After having driven by for years, I finally tried this spot - my only regret is that I didn't try it sooner.", "pics": null}}, {"review": {"des": "A friend and I arrived to a crowed bar/ restaurant and were seated within a few minutes. The waitress had a good sense of humor. Bread came first which was very warm and hearty,  my friend order up a cup of navy bean soup which he related it was above his expectations! The ghoulash soup I ordered was very good. Another great experience.", "pics": null}}, {"review": {"des": "When you want great German fare, huge servings, and cold beer this is the place to go.<br>Their food is pretty amazing, especially when you see that their kitchen is almost as cozy as my own kitchen at home. Great customer service and ambience, this is a place where you don't have to worry about loud music and have a great family conversation.<br>My favorites here are: the schnitzel and hakpeter. I mean seriously, you almost can't go wrong with any order here.", "pics": null}}, {"review": {"des": "The food took 1 and half hours to come because the owner decided to take in a to go order which pushed back everyone's orders in the restaurant. For the food, the potato pancakes were dry, but the pretzel was actually good. The main entrees were very dry and bland. Finally, the waiter we had barely talked to us and only told us that our food take a long time after we had already been waiting for about 45 minutes. Overall, i'm disappointed with the restaurant because it has so many stars. In part the mismanagement of the owner is too blame for rushing their cooking staff, but at the same time they should know how to accommodate their in house guests.", "pics": null}}, {"review": {"des": "Yes it's old and dark, but there's a place for such nostalgic places, especially if the food is good, and that's the case here. We ordered the chicken paprikash and thuringer. I really enjoyed both, especially the sauerkraut that came with the thuringer. Not so much of a fan for the German potato salad which I thought was a bit bland. Both were served with a choice of salad/soup and bread. Portions were humongous and the food was hearty, I got 3 meals out of my thuringer, so it's a steal. Service was efficient but not the overly attentive type, which is the way I like it.", "pics": null}}, {"review": {"des": "The portion are ENORMOUS. The pretzel is great with the cheese or mustard, and the herring has a really bright flavor. But so far, the most surprising menu item is the mushroom goulash. Meaty, rich, and all around yummy. Even if you're a meat eater, get it. It's a substantial meal and you will not be disappointed.", "pics": null}}, {"review": {"des": "We had an excellent experience at Laschet's Inn.  My smoked Kassler ribs (smoked pork chops) were excellent and cooked to perfection.  My friend had the wienerschnitzel and was equally as pleased.  The sauerkraut and German potatoes, excellent.  The herring appetizer was a bit too tart but OK.  Cucumber salad was a tad soggy and uninspiring.<br><br>The waitress on duty was super nice, attentive and very accommodating.  A++<br><br>Liver dumpling soup, only on Sunday?  What?!?!   My favorite German soup!  <br>Serving German chocolate cake?  <br>.. .... An American concoction never to be found on German soil!  OMG!<br><br>Very pleased and will return but...... it's not like the late +Zum Deutschen Eck Restaurant and that was my favorite.   <br><br>Highly recommended!", "pics": null}}, {"review": {"des": "Erin, the bartender, was our server and she is fantastic.  She recommended their signature goulash soup.  It was delicious, albeit a little heavy on the chunks of beef.  I know, who doesn't appreciate a lot of meat in their soup? It's simple really - The broth was so crazy good that the meat was secondary, hanging out filling up the bowl unnecessarily, damn it.<br><br>Ordered the steak tartare, which was served spread very thinly on dense bread.  Took us four pieces of choking dry bread down before I suggested we scrape the tartare off the bread with a spoon and scrap the bread entirely.  Much better.<br><br>The sauerbraten - one of my all time favorite German dishes - was disappointing.  Unlike traditional sauerbraten, the gravy was light in color and not very rich.  The meat was cut thicker than I'm accustomed to and it was really dry, despite being covered in gravy.  The spaetzle wasn't soft, it was pan fried and crispy, not lightly sautéed.  It was hard to find anything I like there, and after two bites, I gave up and set my plate to,the side in defeat.<br><br>Sausage plate appetizer wasn't even that flavorful.  Too bad really.", "pics": null}}, {"review": {"des": "This reminded me of German homecooking.  Huge portions.  Excellent quality.  I started with potato pancakes.  The pancakes could use more onion but we're still good.  I ordered the day 's special of Chicken Paperickash which came with Spaetzle, red cabbage, and a side salad.  My plate of food could feed a family of 4.  Everything was delicious.  Definetely will return.", "pics": null}}, {"review": {"des": "I've been going to Laschet's regularly since 2002. Without hyperbole, it is one of he best German restaurants/bars that I have ever been to. <br><br>Why is it so good? Why should you plan on spending four hours on Saturday night here? Here are a few reasons.<br><br>1. The beer. The selection of perhaps 12 different German and Austrian beers on tap has to be the best in Chicago. This place concentrates on Lagers -- good, easy-drinking Lagers. What about a Stiegl from Salzburg, Austria or a König Pilsener (ein Köpi, wenn du willst) from Duisburg. Don't come here expecting American craft beers -- this is about German beers! And with the high volume of drinking, all the taps are fresh.<br><br>2. The Food. Just as important as the beer. Everything is fresh and made to order. Portions are enormous. And guess what? German food has vegetarian options, too. Ja, wirklich. Die Deutschen essen auch vegetarisch! Of course you can have great Schnitzel, Rouladen, Sauerbraten, and duck, but there's also a tasty mushroom Spätzle on the menu. And here's my Geheimtip -- an insider tip of sorts. Order the Hackepeter which is a raw, minced beef, served with onions, capers, and bread. It's the best I've ever had outside of Germany.<br><br>3. Ambiance. An incredibly comfortable place to sit, talk, drink, and have fun. Plenty of regulars and plenty of beer lovers. Great for all people, including kids. A bit kitschy with its decorations, but that part of the attraction. <br><br>This is a neighborhood bar that has lots of appeal on the North Side. No live music here and a band playing polkas.", "pics": null}}, {"review": {"des": "Wow, what a happen gem!  I went here for dinner with my 22 year old son and really enjoyed it.  We started with a couple draft beers, as it is a German!  Lorises were responsible and select was solid.<br><br>As for the food, make sure you come hungry, as the portions are big!  The food was really good and a nice treat, since I hadn't had German fair in awhile.  I ordered the roulade which was served with pickled red cabbage and homemade spatzel.  It really was good and brought me back to my Mom's homemade German food.  <br><br>My son ordered the Goulash, which was served with the same sides.  His was even better than mine, and would recommend it for anyone looking for a good creamy hearty stew with lots of meat and all the fixings.  Oh, I almost forgot, their bread is awesome!  It's like a sweet pumpernickel, I think, but delish!   They said a local south side baker makes it for them, yummy! <br><br>I'll be back!", "pics": null}}, {"review": {"des": "If you want to step back into a time machine that skirts the era in Chicago (during the 50s to the 80s) when pro-German unity neo-Deutsche-Reich-ers would meet and drink then this is the place. It has since been remodeled and upgraded and mostly neutralized -- but every once in a while you can smell the German-ness - and I don't mean the touristy German-ness of a good Bavarian restaurant --- I mean the German-ness of mid-19th Century German community that belonged to the Lincoln-Turners and maybe even the 3rd Reich Supporters prior to the War - who continued to meet here for decades after in order to be with some like minded members or one or another private groups of secret believers.<br><br>The first half dozen times I came here it was on the invitation of some very pro-German friends of mine - and I don't mean pro-DDR or pro-BRD. I mean that there was an old map on the wall of Germany including Pomerania and Silesia and a Frederick the Great map of United Germany - and this map was still up in 1983. Once I came her to meet my pro-German-unification friends and I found out that we were there because it was Hitler's birthday. This has nothing to do with Laschet's itself (it had to do with my friends) - but I have to tell you - the place had a lot of people in it - and most of them were pretty darned old. So - back then at least - \"this weren't no tourist joint\".<br><br>That said - I came here - even under those circumstances - because it is a great authentic German Bar with real Germans in it - and it serves good German Bar Food (not only plates but you can buy a meat stick, aka. \"Landsjager\" from behind the bar. Of ya - and has good German Beer too ;-) . <br><br>Another good thing is that there is always someone here to practice my German with. And German is a language that will pour out of your brain onto the floor if you don't pratice it (unlike Spanish which will stick with you forever pretty easily).<br><br>I love German food & drink - and like Germans (despite their history - because they have good history too - and we have bad history too - so we just don't talk about it) - and I love the German language (it expresses ideas and concepts and sensations more clearly than any other language that I know) - and I love Germany (traveling there and being there and seeing the great art and hearing the amazing music - from Bach to Rammstein).  Yes - I love all this - and I really like going to Laschet's - (even if I am not-a Neo-N).<br><br>Come here and try it. Eat - drink - and be merry - or should I say \"Du must einen grossen Bier jetz in Laschet's trinken, dann du glucklich habst\"", "pics": null}}, {"review": {"des": "Fantastic. I've been coming here for years and will keep coming back. Amazing food, the pork shank special on Saturdays is a must-try for lovers of hearty cuisine. Great sides too, excellent spaetzle, potato salad, and cucumber salad (vinegar/dill). Beef stroganoff is excellent, the fried chicken is surprisingly tasty, and the Thüringer is good for lunch. When I miss Olga's cooking (RIP), this is where I go for the best German food.<br><br>Service is excellent, the bartenders are friendly and Jo is a one-of-a-kind hostess. If it's packed, expect the food to take a little while, so enjoy their plentiful selection of German biers. The selection rotates with the seasons, and occasionally features a special keg tapping. If it's late and the kitchen is closed, you can always get Landjaeger sausage and pretzels at the bar. <br><br>Atmosphere is cozy with the requisite gemütlichkeit, plenty of esoteric knick-knacks and an admirable beer stein collection. It has a pleasantly dated feel, time-warping you back to the old country. Truly a unique gem in the North Center neighborhood.", "pics": null}}, {"review": {"des": "If you've ever been to La Scarola, Laschet's is the German version. It's tasty, authentic food served in a somewhat noisy, yet fun atmosphere. I'd call it an excellent place to have a family dinner or chat it up with one of eight regulars sitting at the bar. <br><br>The menu is quite large so there's something for everyone even if you're not into schnitzel or sausage. After reading the reviews I went with a mushroom goulash that certainly did not disappoint. <br><br>There's great beers that simultaneously work out your biceps while getting you guttentag-ed. They have about 40 bottles and several drafts that they serve in those ginormous glass mugs which way about 20 lbs each. You'll be looking and slurring like Hasselhoff in no time!<br><br>There's live music too. Personally I can only tolerate an accordion in small doses, but it's definitely a fun mood setter nonetheless. Overall Laschet's is a great spot. If you enjoy good food, great beer, and lively atmosphere I think you'll enjoy it too.", "pics": null}}, {"review": {"des": "I've been almost religiously coming to Laschetts for the better part of three years. I've never had a bad meal or experience. Tuesday Paprikash is something my wife plans her week around and the Klopse on the weekend is fantastically supple with a nice bit of acid. The hackpeter I would rank with some of the best raw beef dishes in Chicago. At Laschetts you'll always find smiling faces, hot food, cold beer and a sea of \"Hey 'insert name of regular here',\" while you dine. Everyone feels like family, it's like Cheers with delicious German Food and the occasional Krampus sighting.", "pics": null}}, {"review": {"des": "This place is so weird and so amazing.  I love it from the band up front to the riff raff of waitstaff.  Everything is mismatched and it's quite alright.  All I can say is spatzele.  Go on the night they have the chicken paprikash special or the beef stroganoff.  I can't remember which nights those are but I'm sure you can look it up or call.  Those with the spatzele and the red cabbage are so f-ing good.  Expect everything to be strange as I said, drop ceilings, weird paintings, loud live band, but it's quite alright!  Chicago has so many gems like this it's unbelievable.", "pics": null}}, {"review": {"des": "We are not sure what took us too long to check this place out. The German is better than old places that have closed (Zum Deutschen Eck or Golden Ox and much better than Edelweiss).  Check out the daily specials when you go as we long the beef stroganoff on Wednesday with noodles or spaetzli. The food is always hot and we take home the leftovers for another meal. The wait staff is attentive and always has a smile.<br><br>The beer on tap is great. Street parking.", "pics": null}}, {"review": {"des": "Simply fantastic! From the wide and interesting  selection of German beers to the delicious sausage appetizer sampler. The sausages come with sauerkraut, German potato salad, good quality mustard and horseradish.  Great combination of flavors. Service is very attentive and the server will sing you happy birthday like no other in the city. Another gem to add to my list.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/El1jbjv32I4nwPRGSASHcQ/168s.jpg", "caption": "Nice selection of German beers"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/-kbEqN0572MmRkZfP1iclw/168s.jpg", "caption": "Sausage sampler"}]}}, {"review": {"des": "Great beer selection.  I started with a tasty Stiegl Paracelsus.<br><br>Enjoying Oktoberfest with friends, we shared a plate of hot sausages to start.  Three different sausages with very different flavors, they made the perfect starter.<br><br>My dinner came with soup or salad - I had an interesting cup of goulash, tasty, lots of meat, and no noodles.  Not quite what I expected but very good.  My main was roast duck with schnitzel and red cabbage.  It was a huge portion of sweet moist duck, decent schnitzel, and fabulous sweet red cabbage.<br><br>Our server's fun and conversational attitude added to the evening.  It's not a huge place, but very German and with good menu selections.", "pics": null}}, {"review": {"des": "Tried Laschet's with a group of 6. It's a good experience. The service was a little odd. I think our server was a bit overwhelmed with a large party in the back room. Overall it was a fun experience. Good beer and German eats. Hachapeter, Pretzel, Spaetzel, pork Shank, mushroom goulash.", "pics": null}}, {"review": {"des": "Laschet's was a perfect breath of fresh air after an underwhelming start to my Oktoberfest celebrations the previous Saturday at the overpriced and commercialized Hofbrauhaus chain in Rosemont. <br><br>Laschet's is everything that the Hofbrau chain in America is not. It's a local, family-owned dive, of sorts, that is hard to find if you haven't been to the neighborhood. It looks like an established little social club that's been here for decades. Partially true, as my grandparents dined here while my grandfather was still alive. <br><br>The space itself is actually much larger than it looks from the outside. The bar area is very narrow, but welcoming. Further back you'll find two separate spacious dining areas. Plenty of German brews on tap for reasonable prices. I had a Spaten Optimator, a Weihenstephan Oktoberfest, a Ayinger lager. Can't go wrong with food here, either. I had the leberkase and my friend had the rouladen. After sampling both, I can say that this place features some of the best German food I've tried outside of Germany. If you like bacon, this is your kind of place. The sauerkraut AND potato salad both have small chunks of bacon tactfully inserted in the recipe! You can't beat the prices, either. I have never seen such reasonable prices on such huge German meals anywhere in Chicagoland. I definitely had to take home half my meal for lunch the next day. <br><br>The oompah band (particularly the guy playing the bells!) and the complimentary shot of schnapps at the end of the meal were the icing on the cake, and capped an excellent experience. I'm normally a regular of Edelweiss in Norridge, but this place is closer to me. Will definitely be back to this classic, neighborhood gem!", "pics": null}}, {"review": {"des": "I have visited this establishment several times. Each time has been a let down. It's not the service, but the quality of the food. I've had German food in Germany , and also the USA. I will say that the chicken paprikash is tasty. As as always , half of our order is over cooked. The potato pancakes look like they have been triple fried. We've even had take away. They've forgotten half of our food. It could be so much better. I wonder if the cooks are even German ? Probably not. This is not a restaurant I would recommend.", "pics": null}}, {"review": {"des": "For German food it was just average but the beer choices were amazing! JoJo, our waitress was phenomenal and really good at what she does!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/HoYM9QJlZPlLHf_JBq8lBw/348s.jpg", "caption": "Roulodon,signature dish was amazing. Ask for JoJo as your waitress, she is awesome!!!!!  The food was crazy good and the beer tremendous."}]}}, {"review": {"des": "This place is really quite good. I ducked in here to escape the downpour of rain and the inevitable gridlock rush hour traffic that awaited me.<br><br>Atmosphere: Looks like an old german neighborhood bar with a back area that accommodates a few more tables. Looks like a number of regulars with ages across the board. Everyone seemed friendly. Bar area has a few flat screen tv's. The place looks old but well kept. 4 stars.<br><br>Food: They start you out with warm pumpernickel bread and soup. I had a potato soup which was very good. I wish I tried the goulash. I also started out with a 1/2 pint of Maibock (German spring bier). I  had the Chicken Paprikash with spätzle and red cabbage. Fanfrickentastic!. Lots of flavor and a huge portion of chicken. It was so good that it's hard to stop eating even after you are full. Absolutely no room for desert but was offered a complimentary after dinner schnapps. They give you a choice between 4 or 5. Five stars.<br><br>Service: Very welcoming. They great you as you come in and get you set up quickly. My waitress was super nice and attentive. She guided me along the menu items, instantly talked me into a Maibock and I was happy with her direction. 5 stars.<br><br>I need to come back a few more times to work my way through the menu and the bier list.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/00zn5oZhXp6x7tw_xrH90g/348s.jpg", "caption": "Mai-Bock :-)"}]}}, {"review": {"des": "EVERYTHING is fantastic! Good food, huge portions, Nice variety of German beers, wonderful service. LOVE IT!!", "pics": null}}, {"review": {"des": "I was fortunate to be in the company of eine schöne Frau that I had classes with at the Goethe Institute.  We came to Lachet's on our usual German night, the first week where we didn't have classes.  This will definitely not be the last visit!<br><br>One visit is all I needed to give this place an all-star review.  I absolutely love it here!  It seemed like a lot of the clientele there were regulars, probably pretty local.  The atmosphere was very friendly and there were no signs of rowdy loud let's have another bud light types.  The exterior and interior decor really does tap into that Germanic feel.  Our server was an absolute sweetheart, very friendly and really brought a smile to our faces as well.  I could tell that all of the staff was friendly and helpful as they really knew the menu well and were helpful with making selections.<br><br>We had a late supper here, I went for the classic Bratwurst (veal wieners w/ potato salad and sauerkraut) while my date had the Liver Sausage on Rye w/ Coleslaw And Pickle.  We both sampled each others meals and found the food to be very traditional, rustic, and tasty.  The portions are quite large, and we finished the meal totally satisfied.<br><br>More gold stars for our server who asked about dessert, but then offered us three free samples of some of the Schnapps she recommended.  So sweet, and a nice after dinner treat!  The beer selection is also quite good, an overwhelming number of them are German... they have my favorite, Gaffel Kölsch.  <br><br>Great place, really looking forward to coming back and trying more of the menu.", "pics": null}}, {"review": {"des": "This is my love letter review to Laschet's.<br>Dear Laschet's,<br>Your old school, boho, supper club atmosphere makes my heart flutter with the warm memories of my childhood and going to Bubbi's house for Goulash & Dumplings. Though you have no dumplings, I couldn't stop eating your Goulash. Thinking about it now, my heart tingles with delight. The Rouladen was delightful as well, and the cabbage could have been my whole meal. Sloshed back with some refreshing beers, 'twas a meal to remember. Your staff are wonderful and I can see myself making this a regular stop in my winter diet. <br>Keep up the good work so I can keep getting that delicious goodness from your kitchen.", "pics": null}}, {"review": {"des": "Amazing German Pub. Great draft selection. The waiter was very helpful and I would definitely be coming back for their delicious food.", "pics": null}}, {"review": {"des": "Took my husband here for his birthday because we both love traditional German fare and old-school dining. This spot sort of delivers. The atmosphere is on point if you are looking for throwback tavern experience. My husband ordered a pilsner on draught and it was crisp and delicious. i had a nice dry white wine. We started with bismarck herring, which I highly recommend if you are into pickled fish. You get 3 giant fillets, dill pickles, onions and a little loaf of pumpenickle bread. <br><br>For billing itself as a traditional German spot, our dinners were less than traditional. My husband went the Wednesday special of beef stroganoff which he raved about. I am not a huge fan of the dish, but I sampled some of his and it was really good! The dark brown gravy came out with a tiny dallop of sour cream on it, which surprised me, as most stroganoffs I've tried are much light in color due to the large amount of sour cream mixed in. Conversely, I ordered the sauerbraten. I am obsessed with sauerbraten, so I was super excited to try it here. Unfortunately, when it came out, the gravy was very light looked like it had a good amount of cream in it -- so much so I thought it was beef stroganoff. I asked our server (who was very nice) if there was cream in the sauce and she said, yes, they added sour cream to it.<br><br>A traditional German sauerbraten doesn't include sour cream -- I've never seen or tasted a version that has it. I wish they would have noted that it contained sour cream on the menu, especially for those who are lactose intolerant. While I typically do ask if unfamiliar dishes have cream in them, it wasn't even on my radar to ask if this dish had it because it typically doesn't include it. The red cabbage was delicious though while the spatezles were greasy and sort of tasted like mini donuts. Sadly, I was disappointed with my meal.<br><br>Like I said though, service was great and we were offered a shot of schnapps at the end of our meal to digest. In the future, I hope they consider noting that the sauerbraten gravy had sour cream in it, since it's not a traditional take.", "pics": null}}, {"review": {"des": "A nice, intimate restaurant with a unique beer selection.  <br><br>The food was good, maybe not the best I've had but I also decided to be a little adventurous with my meal selection.  We started off with the pretzel with cheese dip and that was good enough.  I ordered the mushroom goulash and wasn't too impressed- but again, this was a meal that was outside of my comfort zone.  I did enjoy the spaetzel, so if you can order a side of that, please do (you won't regret it)  I would usually order a schnitzel. My friend ordered the pork shank and I had a piece of that and it was delicious.  Not to self, order the shank next time.  My other friend had the potato pancake and she enjoyed it well enough.  All of our meals came with a a salad or soup (clam chowder was the soup of the day) and finished with a shot of apple Schnopps.<br><br>Overall, this place is worth visiting for the beer.  If you come for the food, I would recommend the pork shank and definitely get a side of the spaetzel.", "pics": null}}, {"review": {"des": "Stopped in after recently moving into the neighborhood. What a great old world place. The vibe was awesome. The food was outstanding. We had chicken and salad. The staff was courteous and prompt.", "pics": null}}, {"review": {"des": "Dined here in May 2014.<br><br>Overall Rating: 5/5<br><br>//////////////////////////////Rating Breakdown//////////////////////////////<br><br>Atmosphere: 5/5<br>Lots of wonderful German-themed items. <br><br>Food: 5/5<br>Great food for the price paid.<br><br>Service: 4/5<br>Took a while for the waiters to get to me, but they were really nice.", "pics": null}}, {"review": {"des": "Uuuum can I live here? This place was fantastic from start to finish. We've been dying to check it out ever since we found it highly reviewed on Yelp, and my fellow Yelpers did not disappoint! <br><br>The first impression was very casual and cozy. They have a smaller bar area in front and restaurant seating more in back so whether you're after their craft beer selection or stuffing your face with German magic, they won't do you wrong.<br><br>Our server was incredibly sweet and knowledgeable and spaced everything out perfectly. We shared a giant pretzel for an appetizer which was delicious, then an order of potato pancakes (HUGE!), sausage plate and spaetzle with gravy. The spaetzle is the best I've ever had! The meal portions are huge and come with a soup or salad, so if you're not interested in leftovers the next day or wearing your fat pants, you could probably easily get away with sharing an entree. They have specials every day- I can't wait to go back on a Wednesday to try their stroganoff. Plus, at the end of the meal they offer complimentary Schnapps. We'll be back. Prost!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/r6Bb57UTqqyTXxF9HcC5zw/168s.jpg", "caption": "Holy potato pancake batman!"}]}}, {"review": {"des": "To give you an idea how much I love this place - I live in LA now, and this is 1 of maybe 3 places I have to eat at when I'm back in Chicago.<br><br>Our order is almost always the same:<br><br>- Giant Pretzel<br>- Delicious Beer<br>- Sourbraten with double spaetzel instead of red cabbage<br>- OR Rouladen, also with double spaetzel instead of red cabbage<br>- Wife usually gets the fish and chips<br>- We both go for the side salad with warm bacon vinaigrette<br><br>Was just back there last month and it was as good as always!", "pics": null}}, {"review": {"des": "We have driven past this place so many times and never ventured in to check it out.  We originally went to another German pub only to find the kitchen closed.  This seemed like a nearby alternative.<br><br>It is very German and not just a restaurant that has a few half-ass Germany type meals, THIS IS THE REAL DEAL.   Our server was friendly, although not quick to help with some honest feedback when asked about making choices and I wish the wait staff would have been a bit more attentive to the table with refilling water or ordering another cocktail.  It was not a deal breaker because I was enjoying time with my family...<br><br>The hot bacon vinaigrette house salad was amazing, the right balance of sweet and sour.  The roulanden was so perfect-tender , flavorful and a delicious gravy.  This is probably the BEST spaetzle I've ever tasted.  The same can be  said for the red cabbage, which was  again a perfect blend of flavors.  My husband and son had the thuringer plaste and it was delicious, perfectly cooked and still moist.  The complimentary shot of schnapps was a pleasant surprise.  <br><br>I would have no qualms recommending this restaurant as a trusted place for authentic German food.", "pics": null}}, {"review": {"des": "Excellent food. We tend to come here after Cub games, which is really neither here nor there, except for the fact that heavy food is required after a few hours of Budweiser. It's also a great place to relax and wait out traffic, if you aren't from the immediate area. So here are a few notes:<br><br>1. I'm so happy that I can get Hackepeter here. <br>2. Veal. Wiener Schnitzel. So good. So rare. Most places use pork. <br>3. Spaetzels. Boiled and then sauteed until nicely browned. Oh so good.<br>3. Very kind and professional servers.<br>4. Excellent beer. Not Bud. The beer here cancels out the Wrigley stuff.<br>5. A free shot after dinner. All good, whatever you choose. And a nice close to a fine meal.<br><br>5 stars and a smile.", "pics": null}}, {"review": {"des": "My husband and I eat there all the time! This is a nice German resturant.  I love this place. The food is incredible. Plus they give you big sized portions.  The beer is great as well.", "pics": null}}, {"review": {"des": "Fantastic German food, closest thing I've found to actually eating in Germany. Spaetzle is great, my favorite thing on the menu probably being the goulash. We make the drive from the suburbs every couple months for it. The service has always been great, and you even get a complimentary shot of schnapps after dinner! Great rotation of beers as well. Now if only they made German style doners...", "pics": null}}, {"review": {"des": "I had a great experience there last night. Excellent food and excellent service. Everything is top notch at Laschet's Inn. The staff are welcoming and pleasant, fast, efficient, and courteous. The food is phenomenal and delicious. Nothing bad to say about this amazing German restaurant/pub.", "pics": null}}, {"review": {"des": "Still eating at Laschets, Food is still good, Beer is still cold, Scnapps is still offered free after dinner. <br>We like the Hackpeter appetizer (Steak Tatar)", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/9cQ4zBo7d37eI6uDSqaVBQ/168s.jpg", "caption": "BOOT DRUNK"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/KB4xVfT5y6OWoAlSzWXHXA/168s.jpg", "caption": "BOOT!"}]}}, {"review": {"des": "Excellent authentic German brauhaus!  Unique list of German beers on draft by the liter or half-liter. Fried smelt and pickled herring appetizers are especially good with a nice hefewiessen!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/uVd_np805cT0Ud2-6D1v7g/348s.jpg", "caption": "Try the fried smelt!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/RdjGbXKWANBm20MZ-dX73g/168s.jpg", "caption": "Outdoor seating makes for Summertime fun at Laschet's!"}]}}, {"review": {"des": "Was recommended by some colleagues, Great food and beer.  Try the chicken paprikash!", "pics": null}}, {"review": {"des": "Never disappointed in my visits over the years to this charming neighborhood German pub and restaurant.  Good selection of food and beer.  Fun and friendly staff.  Love the massive pork shank I had yesterday from the Oktoberfest menu they are offering now.  The skin was crackling crisp while the meat inside was fork tender. Street parking is easy nearby.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/GLz-cE7LqItvpXqMrQ7wuA/348s.jpg", "caption": "Massive pork shank, red cabbage and spaetzle"}]}}, {"review": {"des": "Always always always have the spaetzle.<br><br>The thuringers are gold. The veal bratwurst I substitute with knackwurst. Potato pancakes - another draw. Start with the Bayreuth and sausages. Don't listen to anyone and get the weiner schnitzel. <br><br>I swear the place is a bit addictive :).", "pics": null}}, {"review": {"des": "Excellent German beer selection. One of the best I've encountered. <br><br>Food was very good, albeit not the best German food I've had. I had the Sauerbraten, which was good but a little less tender than expected. <br><br>Atmosphere is legit and the place has a great, old school neighborhood bar feel.", "pics": null}}, {"review": {"des": "It's great to see the German-American culinary tradition alive and well.  A recent Friday evening brought me to Laschet's for dinner.  The receptionist was nice and a table was procured in the small bar area, as requested. The server was the sit down & chat type, but guess what--she did it well.  Really well. She was truly friendly, a delight.  <br><br>The beef goulash soup was nicely spiced, gravy-like in consistency, beefy and the meat was melt in your mouth. The cucumber salad was refreshing, although it would have benefited from more dill.  The sliced veal was a nice entree, accompanied by terrific spaetzle. The only miss of the evening was red cabbage. It was cloyingly sweet mush with no crunch and no relation to cabbage.  The apple cobbler had some nice crunchy almonds mixed in.<br><br>I should say a word about the drink before dinner.  My martini craving was strong at that hour.  The imported beer list was a potent draw, but I ordered a martini anyway, with some trepidation.  I've been in dive bars where they pretended not to know how to make one, not to have the right \"ingredients,\" and outright refused to serve one.  At Laschet's there was no problem at all, and the martini was great.  So cocktail fans, yes, you can dine here.", "pics": null}}, {"review": {"des": "I should have known from the moment I walked in and witnessed a server scurrying across the floor, hollering to her table behind her, \"Just a minute, Hun! I'm so busy!\"<br><br>I should've known this was going to be a poor experience.<br><br>Upon being seated, myself, my significant other and my 2 1/2 year old sat waiting for at least 10 minutes before being greeted by an SA delivering water. Where was our server? Who knows? When he finally arrived, I knew I wanted him to immediately put in the food order for my 2 year old, and expected (as any server who knows anything about serving would do) he would come back to take our order and deliver drinks.<br><br>This is not what happened. The next HOUR was filled with what can only be described as the WORST service experience I've ever had. The server delivered the food for my 2 year old and walked away. I then took my son to the restroom, while my partner sat, prepared to place our food order, the server approached the table then walked away. Upon my return to the table, I notice tables around us receiving service and FOOD (we still haven't placed our order). We finally flagged him down en-route to table in the back corner delivering shots (which he enthusiastically participated in consuming) and placed our food order and asked for the check.<br><br>Another extended period of time passed and the SA came back to fill our water glasses, at that point I asked if he could find our server and tell him we need our check immediately and our food to go. My 2 year old had long since finished eating and was getting extremely restless.<br><br>I have been a server, I understand things get busy, but if you're a server with any sense, you understand the importance of timing. I wish I could tell you the server's name, but, alas, he never told us. So, there's also that.<br><br>Poor service, mediocre food (that was probably made worse because it was lukewarm by the time we got home) and an overall horrible experience. I wish I could say I'd give Laschet's another chance, but why lie?", "pics": null}}, {"review": {"des": "What can I say? This place blew my mind. My oh my are the portions generous and the beer delicious. I got the pork butt over creamed cabbage dinner and for appetizer the hot sausage platter. Both had saurkraust, which although was a bit too much in quantity was amazing in taste. Definitely a place to recommend for some authentic deutsch food.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ng5NqCLMB6HAyG2hn0gRgw/348s.jpg", "caption": "Pork Butt over creamed cabbage, saurkraut and potatoes."}]}}, {"review": {"des": "This is one of my favorite places in the city. It feels like a neighborhood place and the people treat you like family. The food and beer are great, not to mention free liqueur shots after dinner. I would highly recommend!", "pics": null}}, {"review": {"des": "Delicious food, great beer and wonderful service. I would suggest calling ahead for reservations, they aren't currently on Open Table. We arrived early on a Saturday evening and sat in the bar area<br><br>Our server was very attentive, chatting with us when he brought food or drink. I had the rouladen with spätzle and red cabbage-so food. Unless you are a big eater, I would suggest a small portion, which is only one rouladen instead of two. On the flip side, I have delicious leftovers.   <br><br>Someone else ordered the appetizer potato pancakes (2) for dinner - each pancake is the size of a dinner plate. Another person ordered sauer braten-also delicious!!  We mentioned that it was my birthday and  were served \"free\" apple crisp. <br><br>If you are only in Chicago for a short time, put this place on your list!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/k5T70_ds6qSb7IXkkwVe9w/348s.jpg", "caption": "A full order of beef rouladen!"}]}}, {"review": {"des": "Laschet's is definitely LaShit (or I guess it would be \"Die scheiße\")!<br>If you saw my 11-letter last name, you would know right off the bat that I'm as German as they come.  I would be Hitler's poster child of the 'perfect' Arian child---blue eyes, blonde hair. Too bad I don't speak a lick of German, or am out to reproduce children.  Now let's get back to what we're interested in, the food...<br><br>I always steered away from this family-style, Black Forest decor restaurant due to the dark, dive-bar facade.  Yet, I'm glad I finally stepped foot inside.  The food is pure perfection, and not overpriced like the BrauHaus or Berghoff!  They offer everything my tastebuds desired:<br>-Giant German Pretzel (with their homemade cheese and horseradish mustard): Check!<br>-Potato Pancakes (of course, with apple sauce and sour cream): Check!<br>-Spaetzle (fried crunchy yet soft interior, with a pad of butter on top): Check!<br>-Red Cabbage (sweet, sour, and a ride for your tastebuds): Check!<br><br>They've got all your classic German breaded/fried/pickled specialties, and a European beer to pair.<br>Their daily specials will make you drool:<br>~Tuesday: Chicken Paprikash--Cubes of chicken dressed with a sour cream paprika sauce served with spaetzle and red cabbage.<br>Kassler Ribs--Two large, smoked pork chops grilled and served with roasted potatoes and sauerkraut.<br>~Wednesday: Beef Stroganoff--Cubes of beef smothered in a mushroom and caramelized onion gravy, topped with dollop of sour cream, served over egg noodles with a fresh vegetable medley of broccoli florets, cauliflower and carrots.<br>~Thursday: Smoked Pork Butt--Thick slices of smoked pork butt served on a bed of creamed cabbage with roasted potatoes and sauerkraut.<br>~Friday: Steamed Cod--A thick filet steamed and lightly seasoned served with lemon wedges, drawn butter, roasted potatoes and a fresh vegetable medley of broccoli florets, cauliflower and carrots.<br>~Saturday: Königsberger Klopse--Four veal meatballs draped in a lemon caper sauce served with boiled potatoes and a fresh vegetable medley of broccoli florets, cauliflower and carrots.<br>Pork Shank--Roasted pork shank served with sauerkraut, roasted potatoes and gravy.<br>~Sunday: Roast Duck--A half of duck baked until crisp and served on a bed of stuffing with an orange sauce, roasted potatoes and red cabbage.<br>Roast Pork Loin--Thick slices of roast pork draped in brown gravy served with spaetzle and red cabbage.<br><br>Portions are a decent size and can be ordered in both Small or Regular sizes: Perfect for us light eaters and senior citizens, or those who chow down and dependingenjoy leaving with a full stomach.  I split the regular sized chicken schnitzel with my mother and it was just enough.  My partner had the veal that was soaking in a light gravy.  Both were outstanding and came with a variety of sides to choose from.  If you still have room, they either homemake all their German desserts, or they are ordered from Dinkel's Bakery on Lincoln Ave.<br> <br>I'm sorry to say, but I'm happy there is no umpa-dumpa Polka band playing in the corner.  Instead, all the families and men sitting at the bar create background noise.<br>Note: The kitchen is closed on Mondays!  You may want to avoid or join in during both Lincoln Square's and the German Oktoberfest due to crowds, depending on what type of person you are.  If your waitress likes you, you may get a free shot of Schnapps.  My favorite is the cherry, while my partner sipped on the potent apple brandy.<br><br>As Heidi Klum would say on Project Runway, good luck and \"Auf Wiedersehen!\"<br><br>Awarded Review of the Day in Chicago, Illinois on 06/22/2013!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/KURNYuK75zIdDahtn5rZBQ/348s.jpg", "caption": "Complimentary schnapps shot!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/RRkSUiq-ur5_S4Glut3yog/168s.jpg", "caption": "Chicken schnitzel with potato pancake"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/0CCGkfnExuBNAyIYWK2dcQ/168s.jpg", "caption": "Giant pretzel with spreadable cheese and horseradish mustard"}]}}, {"review": {"des": "Great German restaurant and pub. What sets this place apart from the 2-3 others nearby is the draft beer selection which was extensive and outstanding, and the food which was very good. <br><br>Go and try the Andechs lager (brewed by Bavarian monks) before it's gone. Once of the best I have had in a very long time. Will certainly return every time I'm in Chicago", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/WWn4iX72NGW6NRYzLD5uBw/348s.jpg", "caption": "Possibly the best beer on earth!"}]}}]}