{"name": "lawrence-fish-market-chicago", "reviews": [{"review": {"des": "The prices for the quality is truly the best there is out there. I grew up in Boston, so fish was plentiful, but I have never seen such high quality fish in the middle of the Midwest for such low prices.<br><br>When you walk in, it is a lot smaller than you would expect. There are a few pieces of fish on the right hand side that you can order per lb, but there is also a menu at the counter that has SO many options for sushi, sashimi, maki, etc. I was so overwhelmed since there were so many great options. <br><br>They prepare it for you and present it in a way that looks very appealing and provides ginger and wasabi. You can also call in ahead of time and pick up. <br><br>I would not recommend eating in, since there are only a few seats available. <br><br>Cash only!!", "pics": null}}, {"review": {"des": "Review update: just picked up another order. We were charged for 2 orders of uni, as you can see in the receipt, there's only 1 order. We called and they argued that we're wrong. I only see 6 items in the order and they charged for 7 items. Now the place just over charges for items they don't even provide. These new owners are absolutely dishonest and horrible. <br><br>How disappointing. Our family's been going to this place for over a decade and it's gone down hill. The owners recently changed, quality and size of sashimi has gone down significantly but more expensive. We ordered a modified rainbow roll (shrimp tempura instead of the artificial crab) 1 toro, 1 uni and 1 hirami sashimi. The sashimi size is half of what it used to be. the fish was not fresh and had horrible fishy taste. And they used to serve 2 of each fish on the rainbow but now it's only one of each. This USED TO BE a place our family always went to, the original owner was awesome and I used to tell my friends about. Definitely not worth the money or quality it once was.", "pics": null}}, {"review": {"des": "Woah! Long overdue on the update here.<br><br>Craving sushi on my most recent visit to Chicago, my friend and I both knew we wanted Lawrence Fish Market.  Not much has changed there, and I'm totally fine with it.<br><br>I think they may have gotten a new mini van seat to sit at while waiting for your take out order, but other than that--it's the same old hole in the wall.<br><br>We got a total of 4 rolls and shared our loot.  For less than $20 we had an awesome lunch and it was everything we had remembered/longed for.  We also made a pact that whoever moves back to Chicago first needs to throw a sushi party and order a platter from Lawrence Fish to celebrate :-)", "pics": null}}, {"review": {"des": "Stopped here for dinner - the interior is pretty small. This is the type of place where you pick up the food and take it out. There is a couch and 3 2-person tables so not good for big groups to dine in. I love this little shop! It's so cozy and has that mom-and-pop vibe. The Korean lady working in the front is so friendly and kind.<br><br>Please note that there is only street parking and payment is cash only, so you'll want to make sure you stop by the ATM before you come here. <br><br>Now onto the food - I LOVE this place. The prices are so reasonable and the fish is really fresh (with the exception of the cut of tuna in the bottom left hand side of my photo. Not sure exactly which one this was, but as you can see in the photo it's noticeably frozen). The sashimi cuts are thick; they don't short you. I love raw fish and I can honestly say that this is one of my favorite spots that I've tried so far. If you're in the area and love sushi, you have to stop by Lawrence Fish Market :)", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/zXqqby98M2Nfwyz-1aLVdg/348s.jpg", "caption": "Assorted fish $33 - tuna sashimi, salmon sashimi, tamago sashimi, spicy salmon roll, rainbow roll. Beautiful presentation!"}]}}, {"review": {"des": "Chicago's spot for sushi on a budget.<br><br>Tried once when my uni cravings were bad. Pass on gummy rice. Not the worst uni I've had, but overall, what we ordered did not satisfy my uni/sushi cravings. Instead, it made the cravings bigger. You know the feeling.", "pics": null}}, {"review": {"des": "This place really is a hidden gem for sushi! Located in Albany Park, it is quite a stretch from downtown but totally worth the trip. Lawrence fish market offers nigiri sushi, sashimi, simple makis, creative rolls, and lots of variety of sushi platters. The sushi/sashimi is very good value for money and the rolls are very filling. Most of the sushi/sashimi are only $1-2 PER PIECE, which is a lot cheaper than what you get at the fancy sushi restaurants in the city... The quality of the fish? Unexpectedly good and fresh. Other than ika nigiri (texture a little too firm), I would recommend any other nigiri, especially the salmon and scallop. There are $100 sushi/sashimi platters that could easily serve 5-6 people (so that's only $16 per person for a filling amount of sushi, pretty good deal right?)<br><br>Note: This place is cash only (they have an ATM by the door) and to-go only. The shop is super tiny and there is no seating for customers. You can call to order for pick up since they usually take around 10-15 min to prepare your order.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/HopmWn9Sge9ErXFCtIPJAA/348s.jpg", "caption": "Sushi & rolls combo set A with some extra sashimi"}]}}, {"review": {"des": "This is my new favorite place.  Carry out only, cash only, no frills but fresh, tasty, affordable sushi!!!!!!  Who knew it was possible!!!???  I have had numerous rolls, special rolls, and just sashimi.  The super white tuna is delicious.  You can get it for $1 per piece.  It is like $6 in a normal restaurant!  I cannot wait to get a platter.  I was in last Friday and there were platters everywhere!  I was so envious!", "pics": null}}, {"review": {"des": "For any sushi lover, ballin' on a budget, this place is a solid choice. I will preface this review by saying, I am NOT a sushi snob. So, my expectations are probably lower than a true connoisseur. However, I've eaten enough sushi (and seen enough gas station sushi) to know when the fish is just plain bad. Don't let the storefront fool you, this place has fresh sushi, that's not only cheap but actually delicious.<br><br>I got carry-out on a Saturday night. FYI, getting to go is your only option here. I read enough Yelp reviews to know this place gets busy, so I opted to call ahead. <br><br>I got 4 rolls: Mexico roll (highly recommend!), spicy scallop, tuna, and salmon. I also got 6 pieces of sashimi (get the tai! so buttery and good), and a seaweed salad. The total came to a whopping $26. Quite a steal and well worth it. I also asked for extra ginger, because why not?!<br><br>This place is worth the the trek. But pro-tip...sushi doesn't keep well when traveling via bike.", "pics": null}}, {"review": {"des": "Yum! Haven't been here in years but this was my go to for individual or large party orders. So, so worth it not just because of the price, but because the quality and the options.", "pics": null}}, {"review": {"des": "Though far out of the city and not necessarily the prettiest of places, this is definitely a good spot to satisfy a casual sushi craving. They specialize in party trays, and the price is well worth it compared to dining at a restaurant. The fish is of great quality, and the wait time is minimal. For around $35 we were able to have a nice sushi lunch for two with the perfect amount of nigiri and maki rolls- we ordered the party tray for 2-3 people. I've been wanting to try this take-out spot for a while now, so I'm really glad we spontaneously did on this Saturday afternoon!", "pics": null}}, {"review": {"des": "Best deal and freshest sushi you can get in Chicago.<br><br>That sashimi cut for $1 each, you can't find a better deal anywhere else.", "pics": null}}, {"review": {"des": "The taste and quality of the sushi here is probably 3/5. It's not the best I've ever had but it satisfies a craving.<br><br>The best part is probably the great price combined with the variety available.<br>It's incredibly affordable- I ordered over 8 different rolls which ended up being about $60.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/S7M93yFZHo5cg9fTb_S3KA/348s.jpg", "caption": "Sushi platter"}]}}, {"review": {"des": "I'm not going to repeat what everyone has said. But I did place an order here once around an hour before closing. Got there about maybe 2 mins till closing...I know douche move on my part, anyway, I walk in and she looks annoyed that I come in so late, again, my fault. But she couldn't find my order. And she remembers placing it. And I'm all confused and this place is a 45 min drive for me. The staff in the back already cleaned up so she has them make my order while I stand there awkwardly. I mean theres fault on both sides but I appreciated them staying behind to make my order. I did contemplate just leaving...", "pics": null}}, {"review": {"des": "OMG I found my new favorite sushi place in Chicago.  A little off the beaten path for most people I know but if you have a car it's worth the drive to pick it up.  Amazing prices, amazing quality and the staff is super friendly.  I can't even tell you what everything was (see photos) but we got 8 rolls from basic to special and it was $65 with tip-- cash only so keep that in mind but you won't regret trying this spot!", "pics": null}}, {"review": {"des": "I really like this mom and pop sushi shop. We ordered sashimi - salmon, yellowtail, white tuna, and fatty tuna. I only ate the first three and they definitely satisfied a craving I was having. This place is not meant to be a dine-in restaurant. They did have tables, but the owners took up the main table and had all their paperwork/phone/supplies on it. The other table had boxes on it and in the chairs - they must have just received bulk supplies that day - because boxes were all over the place. It is cash only. It's better to call your order in and pick it up.", "pics": null}}, {"review": {"des": "This place is on my way home so I like stop in for some cheap eats sushi whenever I can. The place is crazy cheap with most sashimi only a $1 and rolls equally low priced. I hate grocery store sushi which has generally been prepared hours before so I do give them credit for making everything fresh But to say that this is amazing or on a par with the top end sushi places is nuts, the sushi is good not great. If you are looking for a freshly prepared huge platter for a very reasonable price then definitely this is the place.", "pics": null}}, {"review": {"des": "Long time customer. The sashimi has always been pretty fresh and decently priced. We started by getting hooked on the Godzilla because guessing by the name...it is huggeeeee. My sister is in love with the ninja roll and I am pretty fond of a basic dragon roll. They also have ameobi (sweet shrimp) that we don't find this cheap anywhere else. Rolls and sushi's are just decently priced in general. They usually get the order right, and we typically order a giant platter. The service depends on who answers the phone. Sometimes they appear very busy and flustered and other times they get it ready before the pick up time. $$$Cash only$$$.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/o_v1wda6t7naG2ZHuPhzPg/168s.jpg", "caption": "Today's haul"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/UItam0Nb88UjDiz9XEjRtg/168s.jpg", "caption": "Under $100 1.5 lb sashimi"}]}}, {"review": {"des": "TO-GO ONLY. CASH ONLY. Came here with my brother since he loves sushi and heard about how cheap it was. We walked in and it's a tiny shop with the owner taking calls and orders at the table. He's super friendly and gets to you as soon as he can. We ordered and waited about 10 minutes before they came out with our food on a small platter. The only place to sit there is on a couch to wait. So once we got our food, we went elsewhere to eat. The fish was not super fresh, but decent enough considering the price. The white tuna was eh for me, but the salmon was very fresh! While it's cash only, they do have an ATM right by the door for your use!<br><br>Summary would be it's good sushi for a cheap price. Definitely worth the trip out!", "pics": null}}, {"review": {"des": "I'm now an LFM sashimi convert. Phatty, Phatty slices of sashimi. My recent order was 2 pcs Salmon Sashimi($1.25ea,) 2pcs Tuna Sashimi($1.25ea,) and 2pcs Super White Tuna Sashimi ($1ea) along with a California maki ($2.70) and Spicy Tuna Maki ($3.45.) My total was just under $15.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ygjqnfbFLCdZHJAh-pxWeQ/168s.jpg", "caption": "Fatty Sashimi-2 salmon, 2 tuna, 2 super white tuna, too good. California and spicy tuna maki which had tempura flake on it for some reason."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/2weuzFATYcPmJfDotpCV_Q/168s.jpg", "caption": "Spicy tuna Maki with extra spicy mayo. 2pc super white tuna nigiri & 1 pc salmon nigiri. Under $7"}]}}, {"review": {"des": "This is literally the most amazing hidden gem in Chicago. The quality of the sushi is on par with the best fancy sushi restaurants in Chicago. (Crafting of the sushi and temperature of the fish is a little less consistent than fancy sushi restaurants) The price is AMAZING. You are essentially paying grocery sushi prices for premium fish. The variety of rolls and fish choices is also very very good.<br><br>This is a MUST try place for any sushi lovers living in Chicago. Also a perfect option for anyone having a sushi dinner party (they offer sushi platters).<br><br>Not sure if it's great for Chicago visitors or for dates as the ambiance isn't exactly what makes this place outstanding. While you do have the option to eat there... the store is very small with just 2-3 small tables pushed together. The sushi comes in styrofoam boxes.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/7kDD5m4mdbobFNW2P_Zpag/348s.jpg", "caption": "Scallop roll, Mexican roll, salmon/yellowtail/tuna/escolar sashimi for $23 total."}]}}, {"review": {"des": "Yummy sushi. Good price !<br>Good to  call and book so you don't have to wait too long after the order coz it's made there and then .", "pics": null}}, {"review": {"des": "This is my favorite sushi place! It is not a restaurant, but more of a to-go place. I always call-in our order and they are very prompt. Fish is always fresh and prices are reasonable. I always order their large platters for family parties and they're always a hit! I'd rather go here and pick up sushi than go to a restaurant!", "pics": null}}, {"review": {"des": "The BEST value for sushi in the city! <br><br>This place is truly a hole in the wall, we almost passed it on the way there. It's takeout and cash only. No worries if you don't have cash since there's an ATM right inside. <br><br>In summary: nigiri and sashimi range from $1-3, the only exception is the fatty tuna, which costs $4.50 a piece. That's crazy amazing value! The sashimi are good size and super fresh. All rolls are anywhere between $3-10, thought most stay in the $4-8 range. They also have 3 special rolls when I got there today, all cost $7.95 each. For bigger parties, you have the tray options, which include simple rolls and sushi/sashimi pieces. Depending on how many people you're feeding, the tray can go from $21-100! It's as economical as sushi gets. <br><br>The owner is friendly and polite! All staff are nice, and don't mind explaining to you the different kinds of fish they have. I highly recommend this place to everyone, it's worth the drive from the city and if you don't want to wait to eat at home, there's Labagh park right next door for a sushi picnic!", "pics": null}}, {"review": {"des": "We came here on a whim one night while craving large quantities of sushi. We placed our order at the counter and got a mix of sashimi and rolls (spicy tuna was our favorite). For about $25 we got about 5 rolls which is unheard of for quality sushi. There is decent street parking, and it's cash only! The best part about this experience was sitting down with the owner on a couch in the middle of the storefront watching soccer, while waiting for our food - super friendly and nice people!", "pics": null}}, {"review": {"des": "Let me just start by saying this is some of the best sushi I've EVER had. It also is a great value - it's just a little out of the way and it's definitely a hole-in-the-way gem. You wouldn't think it if when you walk in to the store but the quality of fish here is incredible especially for the price, I believe you get more than your moneys worth. I actually love just getting straight sashimi here because the fish is so fresh but they do offer rolls as well. <br>Something to note is that they don't have any seating so you can come in and order and pick it up to go. They have platters so if you order enough sushi you can just pick up the platter! Another big thing to note is that it is CASH ONLY so make sure to stop by an ATM before you go! It'll be worth it for sure.", "pics": null}}, {"review": {"des": "I am in love!  My brother's best friend's dad owns Lawrence Fish Market and their sushi and sashimi rocks!  My husband is a big sushi fan, and when we fly into Chicago from San Francisco, this is one or two stops for us.<br><br>We usually order a large amount of tuna and salmon sashimi, a few ama aebi, spider rolls and uni.  We have a whole platter good for four people, but eaten by two, lol. <br><br>The fish is fresh, and the price is really good for the quality.  If you order what we order in a sit down Japanese restaurant you will spend twice or three times the amount.<br><br>Some of our friends recommended we go to Dempster fish in Skokie, since it is closer for us, NO comparison!!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/yEHJ5ylCY3wvBSZU9d6BtQ/348s.jpg", "caption": "Grocery area!"}]}}, {"review": {"des": "I got three delicious sushi rolls for $10, which would usually cost me $15-25 anywhere else. The cost alone is enough of a reason to give it a try.<br><br>My friend and I are visiting chicago and wanted some to go options for dinner a few nights. After running around the city all night we just wanted to crawl into our hotel beds with some take out and Netflix and this hit the spot. I ordered a california roll, a sweet potato roll, and the shrimp tempura roll. The rolls were not as complex in flavor as some places I've been to, but honestly they are far better than some \"fancy\" places I've been which ended my night with a $50 bill. My rolls ranked comparable (or higher) to a Whole Foods takeout roll, but at half the cost. Each roll had a distinct taste, they required no soy sauce, and I was totally stuffed afterwards.  <br><br>I'm personally not a sushi snob, but I do have standards and I don't just eat the cream cheese, tempura battered, crab filled specialty rolls. My best friend on the other hand regularly visits high end sushi restaurants and said her order (which came out to $17) would easily cost $35-45 regularly, and was absolutely delicious. Just trust me, she's not the type to be polite. If this place sucked we would have been ordering pizza which was not the case that night. <br><br>If your skeptical, just get one roll. Worst case, you wasted $3.", "pics": null}}, {"review": {"des": "We took an Uber there because the reviews and pictures looked great.  It's a pick up and go type of place so because we didn't realize that we ate at a tiny table that isn't even for dining in.  Once our food came out it looked amazing but we all agreed the sushi was not as great as the reviews.  It's presented very nicely and looks appealing but did not taste fresh. We also ordered the uni and I thought I was going to be sick.  I gave two stars for the rating only because I didn't get food poisoning the next day.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/0V2zqwM-yxhqnX8YdHb6qw/348s.jpg", "caption": "Not as tasty as it looked"}]}}, {"review": {"des": "Awesome and fast service here! I come here pretty often for the great deal and low prices. I forgot to order the scallops but toro and uni are my go to. The rolls are cheap compared to other places so you can't really go wrong with that. The fish is fresh. They do allow you to order a big platter and I believe it's $50 for plenty of rolls that feeds around 5-6 including California, tuna, Godzilla, veggie roll. You can also get it in Nigiri platter as well. If I want to order take out, I usually come here.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/X-QV4vLaHpkf5S8b5GaUnw/348s.jpg", "caption": "3rolls, toro, and uni"}]}}, {"review": {"des": "Fresh, high quality sushi for a great price! There's a lot of options and most rolls range between $3 to $5. I must say that their \"simpler\" or smaller rolls, like spicy tuna for example, taste much better than their bigger rolls, like the Godzilla and the dragon. My friends and I agreed that the bigger rolls lacked in flavor and we enjoyed the smaller rolls much more.  It's cash/takeout only. Staff is friendly, great customer service. One of the times I came here my order wasn't ready and still needed 10-15 minutes and they added a seaweed salad for free. Try the Mexico roll, it's incredible!!!", "pics": null}}, {"review": {"des": "Update: Their party platters are great quality sashimi and sushi, but their specialty rolls are subpar. I ordered to-go their rainbow dragon roll, kamikaze (spicy tuna) roll, California roll, and salmon and avocado roll. The spicy tuna in the kamikaze roll was overpowering. The sushi rice was too soggy, and they mash their avocado which blends in the avocado flavor too much with the sushi. Some of the avocado had browned, even after eating it right after picking it up. So in the future, will only opt for their party platters that highlight sashimi over rice.", "pics": null}}, {"review": {"des": "Small place but full of flavor.....I've been ordered from here many times. They have several kind of sushi that you can order and in the cheap price! Unit for $2.95 and toro for $4.50. I pretty much believe that no body can beat their prices! With all the quality sushi and with this price! I would recommend you to come to try.....", "pics": null}}, {"review": {"des": "it was worth it for the price...but I found a cockroach on the bottom of one of my salmon nigiri and that's all I have to say. I want to return for more sushi but I am cringing when I remember that there was  bug in my sushi rice.<br>Nasty shit", "pics": null}}, {"review": {"des": "Wow.  Fresh Sushi, Good Service, and Incredible Price! Lived up to the Hype.  Highly recommend it for take-out as there is limited seating and you are not paying for ambience.", "pics": null}}, {"review": {"des": "$30 for a sashimi meal for two? Yes, please!! I ordered $30 worth of sashimi (thanks to the pictures of the menus posted online) for pickup on a Saturday night. Reading the previous reviews I knew that we would get good bang for the buck but I didn't think the two of us would be so stuffed for $30! We got about 12 nigiri and sashimi pieces, and 3 rolls: Mexican, spicy tuna and rainbow. Rainbow wasn't anything special but still good. Unlike the spicy tuna you get from other sushi restaurants where the fish and sauce is grinded, these rolls actually had chunks of tuna, with just a smidge of the spicy sauce. The Mexican was by far my favorite because I loved the flavor of the cilantro with jalapeño and hamachi. <br><br>The fish was fresh and the rice was just the right texture. There are a few small tables but this is pretty much a take out only place. It is a small hole in the wall but don't let that scare you away. I heard from a few people that other sushi restaurants actually get their fish from this place so it's not a bad idea to go straight to the source.<br><br>Wish I lived closer so I can frequent this place.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/mI07nMrWRqqFscEc0ZGw6A/348s.jpg", "caption": "All this for $22.50!"}]}}, {"review": {"des": "Quality, affordable fish. Ordered 6 rolls and 8 sushi/sashimi pieces for 4, costing under $60. Ordered around 5pm on a Sunday night at the shop and waited for only 15 minutes. If I lived closer I'd definitely come more often!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/opvHziDDN5FDtYzicldfoA/168s.jpg", "caption": "Spicy tuna roll, spicy salmon roll, dragon roll, spider roll, 2 rainbow rolls, 4 salmon sushi, 4 salmon sashimi, 4 tuna sashimi"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/TPlL9J4oeAxANcz5X9azUg/168s.jpg", "caption": "Menu as of 7/15/18. Cash only."}]}}, {"review": {"des": "This place has the freshest sushi in town. And they offer great prices on sushi rolls. They offer catering services as well. The only caveat is it is not a sit down restaurant but more of a walk up counter. There is also very little space to wait inside. Maybe order ahead and pick up. I can't wait to get back here.", "pics": null}}, {"review": {"des": "Are you hungry is it late and you need something to soak the booze up then take a lil trip here If your up for an awesome late night seafood munchies place. I've never had anything bad as long as I can remember coming here. Always get the catfish with wings or something else.", "pics": null}}, {"review": {"des": "No frills at it's best describes LFM; literally, cash only.  That being said, the fish is solid.  I'm a sashimi fan, and for the price it can't be beat.  Scallops, maguro, sw tuna, mackerel, salmon, and the yellowtail have all been ordered and happily consumed.  I'm not a raw fish snob, but I've eaten at some swanky sushi joints; I fully understand sushi grade fish can be costly.  I'm not sure how these guys do it and was skeptical at first, but after loads of pick up orders, I'm not going to question it.  Fresh fish and not having an empty wallet after works for me!", "pics": null}}, {"review": {"des": "For $225 including tax I served 3 trays of rolls + sushi at a party for 20+. Together with some side dishes and dessert I got separately, everyone was fed and I even had some leftovers. The food was delicious and really made an impression on the guests. <br>Here's what I ordered: 4 salmon and avocado, 2 unagi roll, 2 spicy tuna, 2 turtle roll, 2 E.T. roll, 2 crunch roll, 4 philadelphia, 4 spider roll, 2 dragon roll, 1 rainbow roll, 2 rainbow dragon roll, 2, tataki salmon, 8 tamago (sweet egg), 8 tako (octopus), 8 ebi, 8 inari (fried tofu), 8 tuna, 8 salmon, 6 unagi (eel), 2 tobiko", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/9AbAPBozYLEdgglzL98GKQ/348s.jpg", "caption": "I served trays of rolls and sushi at a party for 20+. Together with the pictured side dishes and dessert I got separately, everyone was fed"}]}}, {"review": {"des": "Go to place to get sushi to go, there is no seating and cash only. The Sushi is reasonably priced, and not loaded with so much rice, a perfect balance!<br><br>We like to order multiple rolls for a party, which they put in a big platter. They have sushi platter combos with nigiri pieces and rolls. <br><br>The prices has changed over the years but understandable since ingredients rise in cost. It's still affordable.", "pics": null}}, {"review": {"des": "While the interior of the place seems a bit sketchy, I'm always pleasantly surprised with the quality of the sushi. They even had some of the expensive cuts, like fatty tuna. I would highly recommend anyone nearby to stop by and try out some sushi because it is definitely worth it compared to the price!!", "pics": null}}, {"review": {"des": "MUST READ! All I can say that this is the best sushi you'll get, especially considering that the quality of the fish is excellent and their prices are unbeatable. I got a whole tray of sushi for such a cheap price! Best sushi in Chicago by far and I was able to get from downtown to here pretty easily. It might be hard to see the place when you arrive, but look for the pictures of sushi displayed on their window. <br><br>Will come again!", "pics": null}}, {"review": {"des": "I hate that I have to write this review because the staff was so nice and I really wanted to live this hole in the wall. <br><br>That's why this next part pains me...<br>nothing seemed fresh - All the fish was firm or fishy. <br>Tamago (egg) was even fishy<br>Avocado brown/mushy. <br><br>Just not a good experience waste of my time to drive there and ($40) money. Also when the cashier was handling the money he kept his food prep gloves on was touching the cash register. :(", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/dSAu2MVLAKzjVxqHnibKfA/348s.jpg", "caption": "Throwing all of this away and it breaks my heart because I will eat almost anything but suspect sushi."}]}}, {"review": {"des": "Lawerence Fish Market has phenomenal sushi platters which I have enjoyed on multiple occasions usually for a celebration. They are perfect for large parties and this fresh sushi will make your guests very happy and full! Located on the city limits, you might drive past their tiny location but given the small size of the restaurant, these large sushi platters pack a ton of flavors!!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/NYFslR_DdRlJv5VptWj-kA/168s.jpg", "caption": "Sushi platter perfection"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/4Mbpl407OnMB4jWLk9cqKA/168s.jpg", "caption": "Close up Sushi platter"}]}}, {"review": {"des": "If your looking for sushi at a good price this is your best bet. I've had other sushi places in the area but nothing beats this place's price for quality. I ordered manyyyy rolls which amounted to around 40 dollars and fed 6 people till they were full.", "pics": null}}, {"review": {"des": "TLDR: CASH ONLY!! The shop is located about 30 minutes away from O'hare airport, Inexpensive price for really good sushi, while waiting to get into the concert, ate sushi while people starred, and handling fish with bare hands and wiping on the same towel that is used to clean the benches/cutting board.  <br><br>With the request of my cousin wanting sushi on our trip to Chicago, I turned to Yelp.  Perusing through Yelp I found this place, Lawrence Fish Market.  This place wasn't exactly close to our downtown hotel or the venue we were headed to in Rosemont, but from reading all the reviews and looking at all the pictures, we went out of our way to try this place.  When getting dropped off by, we were wondering if we were in the right place, the neighborhood looked a little sketch, but walking into the store, a sense of comfort and home rushed over me. I never got the name of the nice guy who helped us, but he was super kind and attentive.  I ordered one salmon avocado roll, two salmon rolls, eel roll, spicy tuna roll, spicy scallop roll, tuna roll, 6 pieces of Hamachi sushi, scallop sushi, and an uni sushi.  The total was a $40, which to me was an amazing deal!!  In Virginia, for $40 I would be lucky to get 7 rolls and each roll being about $5-$6 if it's the basic salmon/tuna.  <br><br>This place takes CASH ONLY, so keep that in mind when ordering.  They have an ATM in the store if you absolutely don't have any on you.<br><br>The rice was nice and seasoned and the fish was really good and fresh.  The fish had no odor, it held together beautifully when bitten into, and it tasted delicious.<br><br>Due to us being on a time constraint the day we came here, the guy was amazing and got our order ready in 15 minutes when there was an hour wait.  We got our order on this huge party platter for sushi and took it with us to the Rosemont Theatre.  As we waited in line to get into the Concert, we ate the sushi.  The platter was a little flimsy but luckily we had asked for small containers to be used as plates, and we just out of that while waiting in line.  I'm pretty sure we everyone was staring at us eat, but we didn't care, the sushi was too good. <br><br>The one downside as mentioned by others was how they handle their fish.  When they were making the rolls, I saw them just picking up the fish with their bare hands and then packaging the sushi up for an order.  Afterwards they wipe their hands on a piece of cloth, wipe the cutting board and bench and continue on to handle the fish to make more sushi rolls. When my cousins and I ate the sushi, we felt fine, and a couple days has passed and we are still fine, so it's not really a big deal.  Just something to watch out for.  Besides that one thing, I would come back again if I ever find myself back in Chicago!", "pics": null}}, {"review": {"des": "Best sushi platters and price.  They are a staple of the korean community.  If you ever been to a korean event and see a sushi platter it's usually from here.", "pics": null}}, {"review": {"des": "I cannot say enough good things about this place. It's takeout. There's not really anywhere to eat there. Do not let that deter you. My friends and I once walked home carrying an enormous tray of sushi. Like seriously more sushi than me and 2 hungry guys could eat (and I can eat a ton of sushi!) For only $78. The fish is super fresh. The nigiri has large portions of fish on it and most is $1-$2/piece. The rolls are also super inexpensive and the portions there are generous too! There isn't a ton of fried things or fancy fancy rolls, there doesn't need to be. The fish is so flavorful. <br>Pro tip: get your hands on a menu and call in your order before you go. The waits can get long during peak hours. But it's so worth it.", "pics": null}}, {"review": {"des": "The sushi here is objectively pretty good. I'm a huge salmon lover and while the nigiri doesn't taste as good as fresh made nigiri from a chef directly, it's on par with how good grocery store sushi is in Japan (which is to say better than your average mid tier American sushi restaurant). <br>Also for the price point it's A+!!! <br>Even though it's only takeout, the value for sushi makes this place great :)", "pics": null}}, {"review": {"des": "I've tried pretty much all the nigiri here and the Mexican roll and love this place to satisfy my sushi cravings. It does suck that it's carry out only and cash only, but this is my go-to spot for the Thanksgiving binge (instead of turkey). The only thing I don't recommend is the sake (salmon) and the mackerel (Saba) which always tastes a bit off to me. Why you might ask, why don't I just eat at all-you-can-eat (ayce) sushi buffets? But sushi buffets don't offer as much variety of seafood as Lawrence Fish Market such as uni, amaebi, fatty tuna, and variety of roes in their AYCE price. Additionally at AYCE sushi places, the fish to rice ratio is obnoxiously low -- which is a total rip off.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ff5--mwU07Ds7cnF8dwVrQ/348s.jpg", "caption": "$60 worth of assorted nigiri, sashimi, and Mexican roll for my DH and I. Perfect for date night dinner at home!"}]}}, {"review": {"des": "Funny, years ago I was pregnant and all I thought about was their fried shrimp.  But I couldn't get my ex husband to go get me some!!  All these years later, I still think about that fried shrimp, and when I'm really, really lucky, I get out there to have some.  Still as good as ever.", "pics": null}}, {"review": {"des": "I came here yesterday and I really enjoyed my sushi. However, I am not sure if the sushi was not fresh or what happened. I have a severe case of Food Poisoning. This was the only place that I had food from yesterday, other than a packaged Kind Bar, I was able to narrow down that this Sushi/ Fish Market caused me food poisoning. The service and employees at the establishment were nice and that is the only reason they are getting two stars. My advice is to proceed with caution with this business. I, however, will not be getting sushi or fish from this place in the future.", "pics": null}}, {"review": {"des": "Love this place. It's close to the office and we get lunch from there every week. It is soo affordable but very good quality. The fish is always so fresh", "pics": null}}, {"review": {"des": "This is the best place to order a fabulous sushi platter on a budget, the sushi is high quality well priced. Highly recommend this instead of going to an all you can eat sushi place because you could potentially get more for your money. Also great for a party platter but my boyfriend and I eat so much sushi we can eat the whole platter to ourselves, shamelessly!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/tD9lcY-_1Tm_U09uy7ROqA/348s.jpg", "caption": "Around $40 of sushi!! Ate the whole thing with my boyfriend"}]}}, {"review": {"des": "What is this place!?!? Moving to Chicago from Seattle, I was pretty disappointed when trying to find good sushi places. That was, until I came across Lawrence Fish Market.<br><br>H.O.L.Y.C.O.W. <br><br>Can I just say - what an amazing value for the amount of sushi that you get!!! We got a platter (YES - 4 rolls, 6 pieces of nigiri) for $30. The salmon nigiri was soft and buttery, and the rolls were just the right amount of spice. <br><br>There isn't any space to eat in the restaurant, so I would suggest taking it to the lake or a brewery on the way home.", "pics": null}}, {"review": {"des": "Me: Yeah, apparently we just say how much we want to spend and then they give us a platter.<br>Boyfriend: Oh nice.<br>Me: I was thinking we could do maybe $40-$45?<br>Boyfriend: lol<br>Me: What?<br>Boyfriend: We're doing $70.<br><br>We called in our order for as soon as possible, drove over, and it was ready when we got there (~20 minutes)<br><br>The man ringing us up asked if we were going to a party. My boyfriend said, \"No, it's just the two of us.\"<br><br>The man laughed.<br><br>And that's how we ended up with over 100 pieces of sushi. <br><br>Wow. The spread is outrageous. And really, it doesn't seem like that much sushi. BUT IT IS THAT MUCH SUSHI. Trust me. <br><br>I'm not even sure what rolls we had, but it was a perfect mix of a bit of everything. Some of the spicy ones were a little *too* spicy for me, so I let the bf take care of those.<br><br>Overall, I will 100% be doing this again. In fact, I'm doing it again this weekend!<br><br>The bang for your buck here is ridiculous, and I may never go out for sushi again (not likely). But this is perfect for a night in with a loved one, a movie, and a ton of raw fish.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/yMJ0mqr0TGaXWwY40EQy_Q/348s.jpg", "caption": "$70. Rolls only.  100 pieces."}]}}, {"review": {"des": "This place is fantastic. The sushi not only tastes great, but is super cheap. We were able to get a platter for such a reasonable price. This location is out of the way, doesn't deliver, and only takes cash, but it is still five stars. I will definitely be back.", "pics": null}}, {"review": {"des": "Great place to order to go. Lots of variety and sushi/sashimi is FRESH!! You can call ahead to order and save time instead of waiting on site.", "pics": null}}, {"review": {"des": "For your dollar, you really cannot beat this place.  They don't have a large variety of fancy and creative makis, but what they do have is some of the best tasting fish at a very good price point.  They have all of your traditional makis, a few complex makis, and great nigiri and sashimi.  We love this place.  <br><br>Be forewarned, it is cash only", "pics": null}}, {"review": {"des": "Best bargain sushi in the city. If you're like me where you run into the problem of having a large appetite and not trying to spend a fortune on sushi then you're in luck. Lawrence has excellent prices for good sushi. My favorite rolls are the following: <br><br>1) Scallop rolls<br>2) Orange Sunshine roll<br>3) Crunch Rolls<br><br>I love the nigiri as well. Once again, bargain sushi that will satisfy your sushi cravings. Take out only and Cash only. They do have an ATM on the spot though. Very friendly service as well. Call ahead to place your order!!!!<br><br>I won't knock the rating but the one flag I'd throw is on the fried pieces. i.e. soft shell crab, shrimp tempura, etc.. The fried shell is soft/kind of stale texture which is the opposite of what I'd expect to be a crunchy and light texture. <br><br>#RefereEats<br>\"I call it like I eat it.\"", "pics": null}}, {"review": {"des": "Friendly staff.  Good prices, tasty sushi ... what more do you need to know.  This is basically takeout.  Cash only (they have an ATM right there in case you are short a few dollars - yes, there is an atm  fee)<br><br>They are quick in making up your order.<br><br>Go there!", "pics": null}}, {"review": {"des": "This my go to cheap and tasty sushi joint. The quality and flavor is next to none for the price. Might not be the best rolled up rolls of sushi, but good are they tasty. This is the place that provides the sushi places with their fish, so you can imagine the quality of the product.<br><br>Yum. Yum. Yum. Yum.", "pics": null}}, {"review": {"des": "Best cheap and fresh sushi that I've found in the Midwest. My boyfriend loves the Mexico roll, dragon roll, caterpillar roll, and salmon skin roll. I usually get salmon nigiri or sashimi and a salmon and avocado roll.<br><br>I just wish they would provide little cups for the soy sauce packets, but that is literally my only complaint. You can take a ketchup cup from McDonald's if you get desperate.<br><br>We try to visit every time we're in Chicago, and we usually get $30-60 worth of sushi for the two of us. It's worth it every time. Make sure to call ahead at least 30 minutes and bring cash. If it's dinner time, try to call 45 minutes-1 hour ahead of time.", "pics": null}}, {"review": {"des": "Such a hidden gem!! This is not a sit down restaurant, hence the reason why they're so affordable. And it's also CASH ONLY. There is an ATM machine inside but just come prepared so you don't have to pay that extra transaction fee! <br><br>We ordered a variety of their sashimi and the turtle sushi roll. The order was prepared in less than 15 minutes! Everything was super fresh and very delicious! I will say that I was not impressed with the toro-- you should probably get this at a more fancy dine-in Japanese restaurant. They also sale a variety of party platters! So much to choose from! Def will be coming back here!", "pics": null}}, {"review": {"des": "Excellent sushi and quick service. It's hard to find good fish here in the midwest and Lawrence is second to none. The fish is fresh, and the rolls are well crafted. Come here if you want excellent sushi at an even better price! 10/10 would recommend.", "pics": null}}, {"review": {"des": "This place doesn't look like much from the outside, but do yourself a favor and do not pass up an opportunity to order from them. I love maki, and all of their maki is incredibly affordable and wonderful quality. Perfect and affordable platter trays for parties, potlucks, or even pigging out while binge watching Netflix. My favorites are the spicy shrimp and the ninja rolls, but I also frequently get the spicy tuna, california, and avocado rolls as well. They always include enough ginger and wasabi, but don't forget your soy sauce and chopsticks on the way out. Cash only, and they have an ATM inside. I usually order ahead of time and pick up. Street parking only.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/HPwEiFcB4U0riO8LzxxEDA/348s.jpg", "caption": "Top, clockwise-- California roll, avocado roll, and ninja roll"}]}}, {"review": {"des": "Dang. Legit. I like this place for very cheap sushi in Chicago. It's a bit of a drive outside of downtown but totally worth it. It is also located in a sketchy sort of area without any real seating. The place is cash only (which basically screams every solid Chinatown ever). You can order in advance by calling ahead or place your order at the store with an estimated wait time of 20-30 mins. My friend and I went crazy when we saw lobster rolls for $4.50 so we ordered 4 rolls and a gajillion pieces of sashimi. At only $1 - $2 per slice of sashimi it is very cheap. Only the o-toro was $4.50/piece. <br><br>The sashimi are cut super thick so they are really good value. Our salmon sashimi were $1.25 per piece. Most of the pieces were super buttery and thick. A handful of pieces tasted a little different from the rest. That might be from using other parts of the fish that aren't normally used for sashimi. Regardless, the majority of the pieces were really, really good for the price. <br><br>The rolls were also really good. I liked the orange sunshine roll with its slices of oranges. I've had strawberries on rolls - which I don't like that much but the oranges were really nice. The lobster roll was delicious and so was the unagi roll ($3.50!!!). <br><br>Definitely come here if you are looking for good, cheap sushi. Call ahead to order, pick up and eat somewhere scenic", "pics": null}}, {"review": {"des": "I love getting sushi from here. Pieces run about $1.00 each, and the rolls are Bella inexpensive. I just purchased 5 rolls for $20. The fish is super fresh, and they sell it so you can make your own rolls. They also have all the ingredients you need to make your own sushi at home. They are usually very busy, so be patient, is worth it. The only drawback is there is not a lot of room inside to wait.", "pics": null}}, {"review": {"des": "Been going here for years! <br><br>Always been the best value for sushi. This is the family's go-to when we're ordering sushi for take out. <br><br>Definitely will have my business for the years to come.", "pics": null}}, {"review": {"des": "My favorite hole in the wall sushi place :) They've got the best deals on sashimi (by the lb. or by the piece) with rolls that are more reasonably priced than most places in the city. To top it all off, there's no tipping required here because this isn't really a place where you sit, eat, and be waited on. <br><br>Here's a guide to the best sushi here:<br>1) Check out their menu from the latest pics posted by Yelpers here. They don't have a fancy website so Yelp will have the most updated menu.<br>2) Call in and place your order (time varies for pick up from 30-over 1 hour sometimes during rush hour so beware). The woman taking the order will repeat your order at the end with final price so pay attention in case there are any errors. She's NEVER messed up my orders. <br>3) Hit up an ATM because they're CASH ONLY<br>4) Make your way there. Plenty of street parking with $2/hour meters.<br>5) Literally put in $.50 into the meter because they're pretty good at estimating the time your order will be ready. No need to waste extra money on the City of Chicago parking. <br>6) ENJOY AND FEAST on delicious sushi at your preferred location...sometimes it's in my car cuz I can't resist...other times I actually make it home haha!<br><br>My favorite rolls and sashimi to get here are: salmon skin roll, dragon roll, salmon sashimi, hamachi sashimi, and white tuna sashimi. Uni can be decent here depending on the season. <br><br>**Their spicy sauce is not super spicy but you can easily buy some kewpie mayo and sirracha and make it to your liking at home - super easy. Fish are fresh here and I will even just buy their sashimi to make my own sushi at home when I'm feeling ambitious. They're really hospitable and will even offer ice bags in your carry out sushi if you have a little longer to travel - just to keep the fish as fresh as possible. Yea...that's right...they're AWESOME.", "pics": null}}, {"review": {"des": "The best sushi I have ever tried. Everything was fresh and well done. And the prices are super accessible! Will be coming here again!", "pics": null}}, {"review": {"des": "Fresh sushi!!! The rice is really well cooked -- not too sticky or too loose. They give a large amount of wasabi, like more than you actually need so that's a win. I got Party Tray D and it was a good size for 5 people without making us way too full. They are fast too! We ordered by phone and it was ready in 20 minutes on a weekend night.", "pics": null}}, {"review": {"des": "Cozy place with very nice and friendly staffs. Fast service even in peak hours and come with fresh fish and good taste. This is absolutely my favorite to go place as always!", "pics": null}}, {"review": {"des": "Very fresh sushi for a good price. I don't think you'll find cheaper high quality sushi anywhere. They have some specialty rolls that aren't on the actual menu but are listed in the store so be sure to check those out because they're pretty good as well. Nothing bad to say about this place, just order your sushi and pick it up (cash only).", "pics": null}}, {"review": {"des": "How did I miss writing a review of this place! If I am ever remotely close to the area, I almost always wonder if I have time to grab some sushi takeout (they close at 8pm). They have grown in popularity so they are more busy these days. I have yet to try the sashimi as I have only ordered rolls. My favorites are the spider roll, Mexican roll, spicy salmon and other basic rolls. Some of the fancier rolls may not be worth the extra charge.<br><br>It's solely a take out place. Call your order in 1st so you don't have to wait as long. It's a busy road so parking or crossing the street is a pain. However, once you get you order in your hands, you become so happy that you forget about it.<br><br>I posted a pic of the menu (you're welcome!)", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/gIYPlwr8Xb_X35P0K_ISyw/348s.jpg", "caption": "Menu as of 5.8.16 (you are welcome)"}]}}, {"review": {"des": "Fresh and delicious sushi at ridiculously cheap prices. A bit of a hike if you live in the city, but absolutely worth it.", "pics": null}}, {"review": {"des": "Haven't eaten such good quality sushi for a while. The shop itself is a bit ghetto from the outside. Owned by a nice Japanese guy who told me he has been running this store for 30 years.  Since they have only take out, the sushi and sashimi were presented nicely with a bag of ice to keep them fresh. We ate right away inside our car, it was fun.", "pics": null}}, {"review": {"des": "It is not very often that I think \"I wish I knew about this place sooner\" but Lawrence Fish Market hits the spot. I only discovered it about 6 weeks ago (thanks to Yelp) and have already been in at least 3 times. It has quickly become one of my go-to spots for takeout sushi fulfilling my sushi cravings.<br><br>Great place for take out sushi. It is fresh and delicious. There is also a good variety and great presentation at an amazing price.  I love the rolls and the nigiri is a nice thick cut of fish.  While I loved everything, my favorites so far are: tuna, salmon and ebi for nigiri and the rainbow, spider, spicy tuna, and shrimp tempura rolls. <br><br>We've tried several different options.  On our first order, we had a $35 combination platter (1/3 rolls, 1/3 nigiri, 1/3 sashimi) to get a good taste of different options.  It was delicious.  The only downside is you don't get to pick what you want and there were a few pieces of fish that we didn't exactly know what it was although tasty. Since then, we've done the build-your-own platter to get what we want in the quantity that we need.  Most recently we picked up a large order for a family gathering (8 rolls and some 25 pieces of nigiri for about a total of $75).  They were impressed with the quality and price comparing it to sushi that they've had on the coasts. This is now my go-to party platter. <br><br>Tip: Call in advance to place your order and arrive at that time.  Cash only.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ob6oQ8UNmYEjGsMrzuCrPw/348s.jpg", "caption": "About $75 in sushi in a self-designed party platter (8 rolls and several pieces of nigiri) - all amazing."}]}}, {"review": {"des": "Delicious, fresh sushi and a price you can beat! A hidden gem on Lawrence Avenue. No in house dining, i believe it's only takeout but I've never tried delivering. they have a very simple menu you order from and then watch them prepare your order. there is a little bit of a wait but that's worth it and you can also order ahead of time if you don't want to wait. they have awesome like party platters if you cant make up your mind.", "pics": null}}, {"review": {"des": "Always dependable, fresh, and the best sushi value in Chicago hands down.   <br><br>I've been to Lawrence forever and it is the go to spot for sushi takeaway. There's no seating, and cash only.   <br><br>The prices are beyond compare as nigiri and shashimi pieces are $1-1.5 (these are really quality pieces too so don't worry about that aspect of sushi!).<br><br>Spider roll is just $5.50!  <br><br>Call ahead, order the sushi set to start and then become a loyalist.  Enjoy!<br><br>Lawrence fish market should open right next to a maternity ward in a hospital.   It definitely settles the 9 month fast for sushi!  (its the first thing we think of doing right after our children are born \"great awesome, now let's have some Lawrence Fish Market sushi!!\"). This time around the nurse's eye bugged out when she saw the prices on the menu.  She made 6 copies for all the other nurses.   Safe to say, that they will be loyalists as well.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/yeyU7fihQcTFuuqUOQVknQ/348s.jpg", "caption": "sushi combo set"}]}}, {"review": {"des": "This place is awesome! Cindy and Jose were so nice and the sushi is really fresh. I am a avid sushi eater and this place amazes me. Fresh toro for $4.95!!!??! Salmon belly! Rolls under $4 you'd think they weren't fresh but they are! There wasn't one piece of fish that I ate and didn't like. The place isn't much to look at but if you're wanting some. Inexpensive fresh sushi I'd go here any day. I also enjoyed meeting Cindy and Jose. Jose made my sushi extremely fast and Cindy served us and cleaned up after we left. I will definitely come back here again.", "pics": null}}, {"review": {"des": "Super fresh sushi at reasonable prices!  We ordered Party Tray C for $42 plus tax.  It was the perfect amount for 4 people.  We called ahead, so it was ready in 20-30 minutes.  Cash only.  <br><br>The tiny storefront was bustling with activity between the phone calls, the customers waiting for their orders, and the sushi chefs working as fast as they could.  The old minivan bench seat has been replaced by an actual couch!  Who says they aren't making improvements to the store?!<br><br>All the fish was very fresh with wonderful textures.  Next time, we're going to order a la carte.  We loved the salmon and the super white tuna.  Not fans of the sweeter pieces like inari and tamago.  The california rolls and spicy tuna rolls were excellent.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/fpaOEUdSEnyBQulwWoyJlQ/168s.jpg", "caption": "Combination C.  Yum."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/21CIHom15TU1oP3Vb6WGgA/168s.jpg", "caption": "Combination C.  Excellent!  So fresh. Serves 4.  Reasonably priced."}]}}, {"review": {"des": "I first checked the reviews of this place rating the quality of the sushi. Which i am very impressed with, i came here last week to place a togo order and the place is PACKED. Once i walked in i knew from the start this place is a hit. Prices are very affordable, portions are very generous. Quality of fish is A for me. I recommend the spider roll and bbq eel, this sushi place is one of the fewest places i have been to that has eel that tastes right. Definitely will be back here once i come back to Chicago.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/FwskmhXYBHwQMF6ldDPynQ/168s.jpg", "caption": "SUSHI"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/QaQ9LkY1lL9O28dYQMcSPA/168s.jpg", "caption": "ALL OF THIS FOR UNDER 60$ VERY FAIR PRICE"}]}}, {"review": {"des": "Local gem. Amazing sushi, to-go only, and have an empty stomach!", "pics": null}}, {"review": {"des": "The food was outstanding - fresh and tasty. The atmosphere is lacking. This really is a fish market where they make and serve Sushi. The Spider Roll and Tuna Roll were both great. There is one table with six chairs. It was covered with papers and there was someone (I assume the owner) working there. When we said we wanted to eat there, they looked surprised. The person at the table cleared us a spot, which was very nice.<br><br>Food I would rate 5 stars. If you are planning take out - 5 stars all the way. But, if you plan on eating there, be prepared for the lack of ambiance.", "pics": null}}, {"review": {"des": "Over the last 10 years, I've seen Lawrence Fish Market add a menu, change their menu, and change their prices. They are still the most affordable carryout sushi place that also does nigiri (sushi) and sashimi orders for ~$1 a piece! Their quality is also great, taking into account their prices. Sushi isn't something you really let sit out or want to plan on eating after multiple days in the fridge anyway, so eat the order the same day and all is good!!<br>The inside, as seen in other reviews and pictures, is obviously a \"no frills\" type of location, but that isn't a concern for a place you're just running in and out of for a pickup order anyway. <br>Lastly, the service there is quick and efficient. For a tray of about 8-9 rolls and 6 pieces of sushi, the wait from order to pick up was about 30 to 35 minutes and ended up costing $52. Not bad, at all. <br>Lawrence Fish Market will always have a spot in my heart for making my sushi binges afforable.", "pics": null}}, {"review": {"des": "Don't be shy about ordering sushi from here. You won't be dining in anyway -- just picking up sushi deliciousness to go. We've been coming here for a few years now and the quality and price can't be beat! Where else can you get a California roll for $2.50 and dragon roll for $5.95?! Be sure to place your order over the phone (see menu attached) and bring CASH money 'cuz they're not down with plastic. -1 star for scary interior.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Q32uVkbyyxrZ0Qu2rB1Q6Q/168s.jpg", "caption": "This is what $35 worth of sushi rolls looks like."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/PNk0id5qJlysKDV16Z6JDA/168s.jpg", "caption": "Menu from today 2/11/17"}]}}, {"review": {"des": "Best bang for the buck. Sushi is good for the price. And everyone I've introduced this to loves it. $40 is more than enough for two. I usually spend $80+ for two at any other sushi place. When it comes down to it this is the better choice. Carry out only. Better to call in your order so be sure to keep a menu at home. Cash only.", "pics": null}}, {"review": {"des": "Decent spot- Hole in the wall sushi joint.  Good for takeout. Quality is hit or miss.  I give this place three amd a half stars.  3-5$ per roll.  Try the white tuna sashimi when its fresh melts in your mouth. Tray below cost 50$", "pics": null}}, {"review": {"des": "Number one Sushi in Chicago! <br>Must know about Neighborhood Gem! <br><br>Eliminate the restaurants get it fresh from Lawrence Fish Market. <br>Customer service amazing efficient. Absolutely great people. Family owned. Local. Been around for many many years.<br><br>Seems Their main business is to supply  Chicago lands Finest Fresh Fish restaurants with fresh fish.  They will make Sushi to Go Cash only At Fractions on the Costs pennies on the dollar compared to restaurant premium. And Even Better. No over the top decorating,,  just delicious mouth watering taste. Freshness you won't get anywhere else. Frequent this place.", "pics": null}}, {"review": {"des": "I found out about this place from a local and I thank him for the recommendation. As a SF/Bay Area native, it's hard to find good sushi in a new town, but this is the place for simple nigiri to fun & tasty sushi rolls for a reasonable price. It's easy to miss this place because it's so unassuming. I recommend calling ahead of time to make your order and then pick up. The line can be long . . . enjoy!", "pics": null}}, {"review": {"des": "To be very honest with you guys, I was super hyped about this place because of the reviews. The girl in the front desk was nice and she showed me the food before hand. The food looked great and I was super excited. However, once I took a bite in the California roll, I was like wtf??? Why is the rice so sticky (like super sticky) and it was sour. Either they put a lot of rice vinegar or something isn't right. Also, the sushi was very salty. I couldn't taste any of the fish flavor. It wasn't like wow but it wasn't bad for its price.  I think you could find a better place than this if you are willing to pay a little more.", "pics": null}}, {"review": {"des": "Oh my goodness does this place have some really good sushi at wholesale prices!  Most of the single sushi strips are only $1!  I walked out of there with enough sushi to feed an army.  The quality is very good for the price.  The only thing I don't like is they use that fake crab in their California rolls, but it seems like just about every sushi joint does that now except for the high end restaurants.  It would be nice if they had an option to get real crab and just pay a little more.  This place is only two miles from my apartment which I think is going to be trouble for me!  Lol", "pics": null}}, {"review": {"des": "The owner is the nicest man! Staff friendly and helpful! Quick services and fair prices! Had 21$ party tray,  orange sunshine roll, salmon avocado and spicy tuna. All rolls great but would probably not get party tray again as the rolls included aren't the best. Delicious and fresh...will be back!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/T__ihlOydOrI_rQ8vodBbg/168s.jpg", "caption": "Highly recommend the kamikaze and spider!"}]}}, {"review": {"des": "Had a taste for sushi and finally tried LFM after noticing it driving past a few times. Wasn't sure about it until I checked Yelp and it was a go! I paid attention to the reviews and ordered 20 min ahead and it was ready when I got there. I cannot believe I have lived down the street from this place for 3 years and never ordered!!!<br><br>It is fresh, delicious AND cheap! I ordered the spicy salmon, Mexico roll, philly roll and sweet potato roll. The rolls were huge, they were NOT cheap with the fish and ingredients and they were right on point with the amount of rice they used. $18 w/ tax for all of that! Don't forget to grab your chop sticks and soy sauce on the way out! <br><br>The owner was a very sweet, humble man. I will definitely order again. It is cash and carry out only. They have specials so be sure to ask about those, I didn't and seen a roll I would have ordered.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/qFaPSvtIsgZ6kZn9HGnskg/168s.jpg", "caption": "Back at it again with the sushi!"}]}}, {"review": {"des": "This has always been my favorite sushi restaurant in Chicago. The variety is great and can get great sushi for under $10 that is fresh", "pics": null}}, {"review": {"des": "This is my go to place if I ever want good and cheap sushi to carry out.  Its not the most appealing looking place but it doesn't really matter since you are taking it togo anyway.  <br><br>Make sure to bring cash and call in early to keep you from waiting when picking it up.  <br><br>**If you are in Skokie, another comparable place would be Dempster fish market.", "pics": null}}, {"review": {"des": "I've been on the lookout for affordable sushi places that is still relatively fresh and doesn't break the bank. After being introduced to this place, this is one of my staples.<br><br>I really enjoy the spicy tuna/salmon rolls, unagi nigiri, tuna nigiri and salmon nigiri here. I usually get a party platter of 6 rolls and a few nigiri for myself. <br><br>I've come here around 6-7 times now, and only had 1 kind of off experience. Some nigiri pieces weren't super fresh. I chalked that as an off experience, since the next time I went it was great. <br><br>The owner is really friendly and always says hello and inquires about your order when walking in. It's a pickup only, cash only place, so make sure to have cash on hand and order ahead.<br><br>They usually quote me around 20 minutes-30 minutes for pickup, but from experience it usually takes 10 minutes longer than the estimated time.<br><br>Overall, come here for yummy, cheap sushi.", "pics": null}}, {"review": {"des": "Amazing price for the sushi and quality! It's a small mama and papa shop so isn't really a sit down Resturant!", "pics": null}}]}