{"name": "le-colonial-chicago", "reviews": [{"review": {"des": "of course it's good...<br><br>it's a chicago mainstay. it looks pretentious upon entering - especially with the dress code signage and old fashioned dining room look. however, i would describe it more as relaxed fine dining.<br>hard for me to pay double digit prices for vietnamese food but they do get it perfectly there. we got 2 types of spring rolls and i enjoyed the only \"true\" vegetarian dish listed on the menu - mango/asparagus/eggplant curry. it was pretty divine but again, i'm fairly sure i could find the same on argyle for a fraction of the price. <br>service was good...a little too good; the niceties were a bit over the top annoying!<br>we overhead that they are moving spaces in a month?", "pics": null}}, {"review": {"des": "We went out with a bunch of my friends last Sunday night. The place is located in one of fancy areas in downtown. Parking is tough to find, I would suggest Spot Hero or just ubering there.<br>The ambiance is very nice, romantic, intimate, colonial, white building with carpets and chandeliers. The food is supposed to be French Vietnamese, it tasted like Vietnamese to me. Couldn't really appreciate the twist in the flavors. Nothing wrong in that though coz the food was amazing through and through. We had a mix of vegetarians and meat eaters and every one had a good selection to pick from. We had a few salads, rolls and the Shrimp appetizers to begin. The rolls- vegetarian were really good and so was the salad. The shrimp fried appetizer was so-so.<br>I had the Bun Thit Nuong that had BBQ pork on a bed of steamed noodles that was absolutely delicious!!! My friend ordered the Ga Xao xa ot- chicken which she loved and to be honest I think that might have been better than the pork I had. The mi xao don chay was a hit with the vegetarians. The salmon - Ca Nuong was yummy too. The beef bo bitter tom nuong was yummy according to my friend as well. I did not taste that personally.<br>They have a bunch of cocktails and wine to choose from but I wasn't really impressed by them. <br>The dessert was awesome on its own. I tried the creme brulee, the richest I've ever had, absolutely loved it. The raspberry chocolate cake was yum as well. The coconut macaroons was not really my flavor but others enjoyed it with ice cream. The chocolate cake was delicious.<br><br>Overall impression lovely place for a special night out. The food was the highlight. Not a fan of the drinks. Will take my hubby there soon coz he loves Vietnamese food.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/p8qyuCfeHnhnlXbCK8jtkA/348s.jpg", "caption": "Raspberry chocolate cake"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/L5h3DSviIM50bvY9E0Cd-A/168s.jpg", "caption": "Coconut macaroon with ice cream"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/hfrR4dD9UwFbtVgMfwKzWQ/168s.jpg", "caption": "Ga xao xa ot"}]}}, {"review": {"des": "Really beautiful Vietnamese/French colonial restaurant in the posh Gold Coast neighborhood in Chicago.<br><br>Came here for dinner a month ago with my mother during our short stay in Chicago. The interior is quite beautiful, with French-styled building facades alongside numerous tropical plants. Even though it was a weekday night, the place was quite crowded, so I was relieved that I had made a reservation earlier.  They have an extensive wine list, along with specialty cocktails.<br><br>My mother and I shared an order of their bo bia (vegetarian summer rolls) to start. For our entrees, I opted for their mi xao don chay, while my mother got their pho. I also got one of their cocktails, and we shared their passion fruit entrement for dessert. We enjoyed everything, and the service was amazing and super attentive. No, it wasn't the absolute best Vietnamese food that I've ever had, but the food was far from being bad. You're not going to go to a restaurant like this in hopes of getting  cheap Viet eats, and if you're going to do that, yeah, you're going to be disappointed. Instead, this is the kind of place you'd go to for a special occasion.", "pics": null}}, {"review": {"des": "The French Vietnamese food is flavorful and spiced to perfection. The restaurant is also beautiful inside with black plantation shutters and white walls. We had the fish wrapped in a banana leaf with coconut flavored sauce and it was delicious. I also ordered the Japanese eggplant and shrimp dish which was amazing but not as tasty as their fish. The service is impeccable and it's easy to see why this restaurant has stood the test of time. Highly recommended--a Chicago favorite!", "pics": null}}, {"review": {"des": "This was our first stop getting into town. We had lunch here 3 years ago and coming back it is just as good as we remembered. <br>The appetizer rolls are a great start, so is the tuna tartare. <br>The stir fry chicken and tofu are so savory and filling. The rice noodle and beef dish is my favorite! (Number 49 maybe?!)<br>We saw several orders of Pho come out and that looked great too.", "pics": null}}, {"review": {"des": "Just wooooow. From the ambiance, to the service, to the food, it truly was amazing. I went with a larger group and they were able to accommodate our needs very well. Our server was very courteous. <br><br>Drinks wise, they have an extensive wine list ranging from different whites to different reds, and from $$ to $$$$. You can also buy by the glass or bottle. They have a good cocktail list too.<br><br>The food menu is good size too, filled with different appetizers, pho, and entrees. The menu is a French Vietnamese twist so it's very interesting to read. <br><br>I highly recommend the beignets, calamari, sesame ribs, and the salad rolls for appetizers. They were very fresh and flavorful. Entree wise, I had the sea bass that was a good portion and came with a side of rice. It comes in a great ginger sauce. The duck is also very flavorful. Also, if you're a Pho fan, please try it here! It was delicious and was packed with flavor.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/SaOFU0Ny_OYAezNV7uwTDA/348s.jpg", "caption": "Pho"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/o8gyfxBHsmn5AXhsKdUXaA/168s.jpg", "caption": "Sea Bass"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/V9nmJux4h3fSG_S2XIjO_A/168s.jpg", "caption": "Sesame ribs rolled in flat noodles"}]}}, {"review": {"des": "BLUF: A classy Vietnamese restaurant with a French twist that portrays Asian cuisine in a new light. <br><br>This restaurant gave me a new experience on Asian food that I have not had before. The restaurant is ornately decorated on the inside, taking you back to a townhouse feel back in Vietnam with the window panes and palm trees. The dim lighting and candles made for a very romantic environment. Customer service was excellent throughout our experience as waiters checked on our experience, but were not overly intrusive. <br><br>We ordered the shrimp beignets as an appetizer, filet mignon strips and grilled pork for entrees, and the mango sundae for dessert. The shrimp beignets were just so perfect with every bite. The flaky crunch, shrimp, and filling that melted in your mouth made for the combination that prepped my body for what was to come. Rich sauce enveloped the filet mignon paired with the sweet potatoes that just was so tender and a delight for the tongue. The meat was so delicate and soft. The pork came with these rice noodles that were shaped in squares that allowed you to wrap the pork with sprouts and greens. Each bite was so fresh, one could taste the hint of lemongrass often noted in Vietnamese cuisine. Finally, our journey came to an end with the mango sundae, and it definitely fulfilled my sweet tooth. Fresh mangoes with vanilla bean ice cream made for the perfect ending of this experience. <br><br>Overall, I was intrigued and pleasantly surprised to see what Vietnamese food with a French twist was like. It offered a new perspective that left my palate wanting more with each bite. Thank you for such a great experience, we'll be back again!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/C5VaUBRc85F1-P_x1lGhFw/168s.jpg", "caption": "Entrees (left to right): Filet mignon, grilled pork"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/gIlGwz_DYBSlPPM1yCi-xg/168s.jpg", "caption": "Appetizer: Shrimp Beignets"}]}}, {"review": {"des": "Second time visiting this location Le Colonial.  We were in the mood for pho and didn't feel like driving.  This location is in the heart of Gold Coast and was convenient enough to drop in.  We were seated promptly but took some 20 minutes for us to place our order.  Shrimp on a sugar cane was tasty and interesting.  Chicken salad however was very gamey.  I couldn't eat it.  The fish sauce and the game taste from the cold chicken pieces were overwhelming.  We asked for a side of pickled radish which was not fulfilled until we asked for a third time. Pho was a small serving which was perfect for lunch but nothing memorable.   Service was Slow and inattentive.  Probably won't visit again.", "pics": null}}, {"review": {"des": "Food (5/5): Between me and my boyfriend, we ordered the pho ($10), goi bun so (grilled sea scallops salad) ($14), and bo bitet tom nuong (filet mignon and sautéed shrimp with tomato rice pilaf and mesclun greens) ($32). We also ordered a pot of green tea and got the banana tapioca pudding ($8) for dessert. Everything is delicious. I would not change a thing. By the way, even if you aren't a fan of salads (my boyfriend isn't), don't be afraid of their salad selection. As you can see in the photo below, their salads are more of light noodle dishes complemented with greens.<br><br>Service (4/5): The service is standard for what you would expect for this type of restaurant.<br><br>Ambience (5/5): We came in on a Friday evening and were seated on the second floor. Lovely ambience - with the wooden ceiling fans and dimly lit lights, it feels appropriately French-Vietnamese. Noise level was above average but that's because every table was filled.<br><br>Highly recommend!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/VBIkIKmXXL3_E8s2067ppQ/168s.jpg", "caption": "Goi bun so (grilled sea scallops) for $14"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/yE1eoalxJMBOOLsBJBrZ2A/168s.jpg", "caption": "Bo bitet tom nuong (filet mignon & sautéed shrimp with tomato rice pilaf and mesclun greens) ($32)"}]}}, {"review": {"des": "I am traveling to Chicago on business, and looking for some warm soup to please my stomach and homesick soul. I find this cozy restaurant within a 10min walking distance from the Omni hotel. <br>The Restaurant setting is very Frenchy, simple and elegant, the wall was covered with some old pictures that I would like to see more details in my future visit. It has two floors, and I was on the first floor.<br>Naturally I ordered the Pho, the oxtail soup based rice noodle with thinly sliced tender beef, and covered with lots of baby green onion. It fixed my homesick stomach immediately. The second dish I ordered was the Japanese's style eggplant dish. It tasted just like how  my childhood housekeeper prepared. It brought me back to the moment that I was deeply fond of.<br>The price is very inviting, $10 each.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/179btYoVzSUqpRqzLSKTqA/168s.jpg", "caption": "The very authentic PHO"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/7kBeTgzP5VqVwpHtnf2JAA/168s.jpg", "caption": "Japanese style eggplant with garlic and baby green onions"}]}}, {"review": {"des": "I think Le Colonial is supposed to whisk you back in time, to a less complicated era of being a French colonizer in Vietnam, oppressing the locals, committing the occasional human rights atrocity. The black and white photos lining the wall gestured menacingly in that direction.<br><br>The chicken was juicy here. And Le Colonial certainly doesn't phone things in for dessert. No, you're getting a full platter of crémé brúlee to stuff your face after the meal. Your mother did not raise a quitter.", "pics": null}}, {"review": {"des": "One of my least favourite restaurants in San Francisco, but comparatively decent compared to the Vietnamese food available in in Chicago. <br><br>Unlike more expensive meals, I think its fair to adjust perspective in comparison its surroundings for a place like this. Is it still overpriced? Yes. But the food isn't bad, and has its highlights. Their Banh Uot, for example, is something that I would order again elsewhere, provided that it was much cheaper of course.<br><br>Though not typically to the extent that Le Colonial takes it, Chicago in general typically has heavily inflated prices for Asian cuisine compared to other Alpha cities in the world, so I think Le Colonial can be partially forgiven for their menu prices here.<br><br>There are some genuinely good dishes here. And I don't think anything really stands out as much better or poorer compared to the typical \"big city\" Vietnamese restaurant. Most Vietnamese restaurants, regardless of price, use the same rice paper you can find at your local supermarket, for example. <br><br>Don't come in here expecting French fusion. French influences have already integrated itself into modern Vietnamese cuisine enough that its perhaps more accurate to say Le Colonial plays up those influences rather than being what most would consider to be fusion. <br><br>I'm not at all an expert in Vietnamese food, but the few friends from Saigon I've dined with didn't have great impressions of Le Colonial. My standards were much lower, and to me, Le Colonial tasted roughly the same as restaurants in Southern California for roughly double the price.<br><br>This would be decent, sometimes good if its prices were 35% lower, but as it is its very hard to recommend.", "pics": null}}, {"review": {"des": "I'll start by saying, I love their food. I'm subtracting one star tonight because my guest and I walked in at 9:15pm and the first words the host spoke to us were \"You need to hurry up and order.  We're closing.\" Embarrassed and uncomfortable, we asked if they close at 10, not 11pm (which is listed online), to which the host snapped back, \"No.  But order quickly ok?\" <br>The restaurant was more than half full still bustling with patrons. Why we were rushed? I'm not sure. <br>In any case, the food was still good. Our waiter was pleasant, I guess.  Not too eager to return any time soon.", "pics": null}}, {"review": {"des": "In one word - Underwhelming! <br><br>I was actually quite shocked because it's very popular amongst the 'Gold Coast scene'. I wanted to love it; It looks so charming from the street with a French flair and right in the center of Chicago's most renowned retailers. <br><br>Alas, the host was an arrogant prick! We walked in shortly after they opened and in the lower level all but one table was totally empty. He shook his head and said in a huff \"I'm sorry all of our tables are taken. You can TRY the upstairs bar, but you must check your coat and shopping bags before you go up\" (dramatic hand gesture). Whaaat? It suddenly felt like that scene from the movie Pretty Woman in the retail store. Bahhh.<br><br>After checking our things, we headed up the stairs. The bar had one couple sitting at it, but otherwise empty. The bartender was at the register and said \"I'll be with you in a minute\", but he disappeared as soon as he was done at the register. I walked up to the podium at the top of the stairs, I explained to the host that we would like a table for two. He looked at his watch and said \"do you think you can be done in an hour and 20? All my reservations are confirmed tonight\" Whoa...that's when we should have just left the place but we sat down anyhow. <br><br>Enter the darkest dinning room I've ever sat in! No exaggeration, I had to turn on my phone flashlight just to read the menu. Turns out it's Vietnamese cuisine (not French like the decor would suggest). The table was tucked in a corner with a giant palm tree hanging over it. I'm not a big person but I had to climb my way into the chair and had to move the table out slightly to fit. The waitress seemed annoyed by that. She put the menus on the table and walked away.<br><br>Soon after the water glasses were filled and the candle at the table was lit. I heard the restaurant was popular for dates but IMO this was less romantic and more awkward. A mood killer you could say! I digress...<br><br>I ordered an oxtail pho soup, which was mildly flavored and lacked the side fixings typically part of a pho soup (basil & mint leaves, peppers, lime, hoisin sauce) and was about 1/2 the size of most Pho bowls I've ordered elsewhere. I asked the waitress where the oxtail was because my soup didn't seem to have any and she smirked and said \"well it's just oxtail broth, not the meat. You get only flank steak. It says that on the menu\" well ok then!! (My fault, I probably didn't catch that since I read the menu in a very dark corner of the room).<br><br>Next course, was shrimp sugar cane skewers over vermicelli rice noodles and sizzling beef with papaya. Both were decent, nothing spectacular. Any mom & pop shop could have done it just as well for 1/2 the price. <br><br>Ok enough of the negative review. There were a few distinct positives. The water glasses and our drinks were continuously full. In one klutzy maneuver, I dropped my fork and the busser was swift to pick it up and get me a new one, the room quickly filled up and most guests were dressed to the nines! The check came very quickly with no pressure to see a dessert menu (pretty sure that's because our time was up and they needed the table back) and the music was hip for the scene. <br><br>Not sure I'll be back to dine, but I'm happy I got to see what it was all about after passing by many times and being highly curious.<br><br>**all pictures were taken with an iPhone flash. I know, I shouldn't have but I'm committed to complete Yelp reviews:)", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/HenRFiz0wZSigsDKFxSOcg/348s.jpg", "caption": "Authentic 'candlelight dinning' experience..."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/LguhIZ4d6DBAeDwe3PSxLw/168s.jpg", "caption": "Shrimp sugar cane skewers..."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ypV0e5CNtlTXit_AG9oX4Q/168s.jpg", "caption": "Menu part 2..."}]}}, {"review": {"des": "We had dinner at this place unintentionally on Valentine's Day. (This was a routine group dinner for a visiting guest at our work place.) We were not able to order from the normal menu: there was this special prefix menu for Valentine's we were required to use, which, funnily enough, just rearranged the items from the normal menu. <br><br>Given the special day, the atmosphere of the restaurant was squirmingly full of love. I think all the tables were occupied by couples except us. In this awkward setting, we had prefix dinner as if we were celebrating Valentine's (...). The food was good but not good enough to justify the price point, but then it was Valentine's so it was perhaps our fault. My rice noodle (basically Pad See Ew) was tasty, and the pretty chocolate cake was as delicious as it looked. <br><br>I'll drop by again (not on Valentine's) in the future.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/-2O5gUvolKi6Cuqg2KESqw/348s.jpg", "caption": "One of the prettiest chocolate cakes I've seen"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ySttDIr_OnCQJsD7As83rw/168s.jpg", "caption": "\"Rice noodle\" (Pad See Eiw)"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/4wX-q4WtwzFkeWnjuktCRg/168s.jpg", "caption": "Salmon appetizer in the prefix: it was probably the best part of the meal"}]}}, {"review": {"des": "Love this place-hands down the BEST Cha Gio (pronouned Jah Ya).<br><br>The Cha Gio at Le Colonial are composed of-<br>\"crisp, fried spring rolls of shrimp, pork & asian mushrooms, with chili lime dipping sauce.\"<br><br>Cha Gio are a typical Vietnamese spring roll..sometimes filled with pork or chicken-depending on who is making it.  They are customarily eaten during special occassions.<br><br>The Wrapping of the Cha Gio-<br>Ususually the rolls are cut up into smaller bite sized pieces and wrapped in Bibb lettuce with pickled carrots or daikon, cilantro and mint leaves.  They are then dipped into nuoc cham.  Nuoc cham is a dipping sauce made of fish sauce, chili, garlic, water, lime juice, vinegar and sugar.  Absolutely divine to give a salty, sweet, and savory mouthful of flavors.<br><br>The Restaurant-<br>Le Colonial is composed of two floors with a small bar at the top of the second floor.  Upon entry you feel like you are entering someone's home aka an elegant and sophisticated mansion of sorts.<br><br>The Bar is known for its signature Lychee Martini as well as its signature Saigon Sling as well other tropical infused cocktails!<br><br>FYI-The food here is NOT fusion-it really is authentic Vietnamese Cuisine.  It will NOT disappoint.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/wBg0ftsTQEqxbejjH-ZD4g/348s.jpg", "caption": "Signature Cocktail- Saigon Slinger...."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/LV4TqPvoDRWiiomgNTfenQ/168s.jpg", "caption": "House Special Lychee Martini"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/7PtkRBWGdSND8p1j7RsyEw/168s.jpg", "caption": "Garnishes for wrapping the Vietnamese Spring Rolls-Cha Gio-Pickled Carrots and Daikon, cilantro, mint, lettuce leaves and dipping sauce."}]}}, {"review": {"des": "What a disappointment! I was really looking forward to taste the advertised Vietnamese/French cuisine. Everything at this restaurant is excellent, expect the food. The location is prime, the decor is beautiful, the cocktails were good (the only reason I didn't give 1-star).<br><br>The food though was just bad. We got the trout and one of the curries and both were left unfinished. They were simply bad. The trout in particular had a very unbalanced taste combination - I don't know what they put in it, but the flavors did not go together well at all. It was overall a tasting disaster.<br><br>Will not return.", "pics": null}}, {"review": {"des": "From the moment I opened the door and found myself instantly transplanted to French Indochina, I knew I was in for a memorable experience.<br><br>I did not have reservations and it was busy night. The host suggested I go upstairs and ask for Michael who was amazing. He offered me a warm smile and a lovely seat on the covered terrace. The weather was pleasantly mild so the location of my table was perfect. I told him it was my first time and he recommended I pick the brain of my server for suggestions. I did and here is what she advised and I enjoyed:<br><br>I Stared with the lychee and mango martini <br>Chai Tom (Grilled shrimp wrapped around sugar cane, with angel-hair noodles, mint, cilantro & lettuce, with peanut plum dipping sauce)<br><br>Bang Uot (Grilled sesame beef rolled in flat rice noodles, with cucumber, lettuce, basil & lime garlic sauce) paired with Stoller Dundee Hills 2016 Pinot Noir<br><br>Ca Song (Tuna tartare with tomatoes, cilantro, & cucumber, tossed in a ginger soy dressing, served with wonton crisps) paired with Justin Cabernet 2016<br><br>Crispy Banana Wonton (With crème anglaise & dark chocolate sauce) paired with espresso<br><br>Overall, the experience was authentic, flavorful and impressive. I would highly recommend.", "pics": null}}, {"review": {"des": "I hate when this happens, but my experience dining here on Monday night was not good. <br><br>It was unseasonably warm out and we were sitting upstairs for a business dinner. <br><br>Our server had to be new. She was very curt, not warm or friendly. It was off-putting from the get go. I always run cold but I was burning up and the two men I was with were also feeling the heat. When we told her how warm we were, she replied, \"Oh, I'm okay\" or something along those lines. Very awkward. We asked one of the other staff to please turn on the air. Unfortunately, it never really got to a comfortable temp and we left quickly after our dinner and caught dessert down the street at M&A.<br><br>I guess the 3 stars here are really for management. I am surprised by the quality of service that management has hired into. I'm hoping things are better on my next visit.", "pics": null}}, {"review": {"des": "Le Colonial is awesome. <br>Love the shimp and pho. <br>Just a note, the pho is not that big so you can order othe food if you were planning on ordering pho.<br>You can also ask the server to have it divided in to two and they'll bring out two mini phos :)<br>The shrimp..... so good .. just really good.", "pics": null}}, {"review": {"des": "Most people know how much I like Vietnamese food, but this place is just far superior than any other Vietnamese restaurant I have been to.<br><br>Not just the food is amazing here (from appetizers to wine list to entrees to dessert), but also de atmosphere and the service are amazing (they have the best waiter in the world: Francisco).<br><br>You won't regret coming here, really an excellent place.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/RXYv58LMXGBuLwsZQPbVRw/348s.jpg", "caption": "Amazing place. Just excellent."}]}}, {"review": {"des": "Here I am again, on the other side of the country, in search of The best Pho Ga to go. Welllllll,.... I know the flavor wasn't going to be disappointing, based on the comments I read. But I was a bit surprised with the size and the prices. The Pho is only a pint, while normally most restaurants offer a quart size and sometimes larger for that price 8$. What really surprised me was the price of spring rolls 11$, for veggie spring rolls, I expected to peanut sauce to be out of this world for the price,...euh not really! just regular thick sauce with Sriracha.<br>The interior is very nice, classy, stylish, lots of old Vietnamese History on the walls. Will I be back, maybe, to impress somebody, with the food, not the bill ;)", "pics": null}}, {"review": {"des": "I enjoyed Le Colonial's decor and service, but found the food to be pretty average. I scoured through seemingly countless Yelp reviews and picked the brain of our server before ordering. We started with the highly touted Cha Gio and Tom Cuon Ram appetizers. Cha Gio are fried Spring rolls filled with shrimp, pork and mushroom.  Tom Cuon Ram are beignets stuffed with chicken, shrimp and vegetables.  They were ok, but I found them both to be too dense.  The flavors weren't bad, but I'd rather have a good ol' egg roll from the local chinese take out. The Spring rolls at your run of the mill Thai restaurant are probably better and cost less.<br><br>We shared the Ca Hap (steamed sea bass) and Goi Bun So (sea scallop salad) entrees.  The Ca Hap was steamed perfectly, but the flavors didn't work well for me.  This dish desperately needed acidity, maybe a little lime.  The Goi Bun So was the highlight of the meal, but in the end it's just a salad.  Our meal was about $120 after tax and tip with one glass of wine. Service was particularly attentive and friendly.  I understand sea bass is pricey, but considering the final bill I was disappointed with the overall value.  At this price point I was expecting a memorable meal.  Bummer. ..", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/l6eThMwLHi2IsZLgIgtOng/348s.jpg", "caption": "Ça Hap - Steamed Chilean Sea Bass, with cellophane noodles, oyster mushrooms, tomato, scallions and fried ginger with a light ginger broth"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/SJTLXcrMUFyg1P9vaNjCig/168s.jpg", "caption": "Goi Bun So - grilled sea scallops salad with garlic noodles and lime vinaigrette"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/MBu0xWi9bIYElUgdQKJPTw/168s.jpg", "caption": "Cha Gio - Crisp, fried spring rolls of shrimp, pork & Asian mushrooms with chili lime dipping sauce"}]}}, {"review": {"des": "Pro:<br>This is my ultimate favorite restaurant in town! With nice atmosphere, delicate delicious dishes and warm welcoming service, this is definite go to place in Chicago. Try monk fish appetizer and egg plants for side dish! And for the entree, choose anything. You won't regret.<br>Con: <br>Totally agree with others' opinion, name of the restaurant with its concept made us feel very uncomfortable. My family and I were talking about its name too and spoke about how insensitive this restaurant is. Please consider rename it and change the concept, in more 'right' and 'correct' way.", "pics": null}}, {"review": {"des": "I came here Saturday night with my fiancé to celebrate our anniversary.  We ordered an array of items most of which I cannot remember but everything was delicious-- see photos.  Our server was great, food was great and ambiance was unique and romantic.  I highly recommend this spot and will definitely be back!", "pics": null}}, {"review": {"des": "We were visiting Chicago from South Florida, and we want to try some vietnamese food. It was so far, the best vietnamese food that I ever had! My husband is vietnamese and he was amazed by the flavors! It is really worthy! The decor is nice! <br><br>For dessert, the passion fruit mousse is the best! I cannot wait to try it away!", "pics": null}}, {"review": {"des": "Le Colonial was delicious, especially when we followed our waitress' expert recommendation. I also managed to leave my purse in the haze of a food coma and was very pleased to find it 10 minutes later fully intact at the hostess stand.<br><br>Stand out food included:<br>Goi Cuon (summer rolls) - great noodle consistency<br>Banh Uot (grilled sesame beef) - tender with great flavor<br>Bun Thit Nuong (barbecued pork) - my favorite entree", "pics": null}}, {"review": {"des": "We went back to celebrate our anniversary and everything was as amazing as I remember it. The host was very welcoming, we were seated on the balcony again as I had requested. The food was incredible. We got the beef short rib appetizer (Bo Nuong) and it was sooo good, super light too. We also had the scallop salad  (Goi Bun So) which I've been dreaming about since, it was also super delish and really light (been trying to eat a bit healthier lately!) for our main course we shared the Beef Bahn Pho Xi again and tried the Cari Tom (shrimp curry) and they were both excellent! I don't think you can go wrong here! Dessert was an awesome chocolate cake, dense and rich, really good!", "pics": null}}, {"review": {"des": "More like 3.5, but I rounded down to 3 because of the name :-) Food is quite good, and I would recommend Le Colonial if (1) It didn't call itself French Vietnamese fusion. To me it's just Vietnamese, and I hardly found any French Fusion element, except those that had been fused in Vietnamese cuisine for the last century; (2) not so overpriced. I'm willing to pay more for a nice setting but to justify the price the ingredients need to have high quality too, and it's not the case here; and (3) what's the deal with putting mint leaves in almost every dish, including desserts (for decoration, I get it, but still!!!)<br><br>The one dish I always recommend to my friends is Banh cuon (steamed Vietnamese ravioli). Although it has an untraditional filling (chicken instead of pork), it's probably the best Banh cuon you would ever find in Chicago area, not that this one is so good but because other restaurants simply don't know how to make this dish right! And this is the only reasone I keep coming back to Le Colonial.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/2sCig-krJXn6EDPX6pT6Qg/348s.jpg", "caption": "Banh Cuon (steamed Vietnamese ravioli)"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/zchBMT9s4BEwIMpKU0g8cg/168s.jpg", "caption": "Crispy Banana Wonton - their best dessert."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/F05m56h4SAyMIPogYqiQDw/168s.jpg", "caption": "Creme Brulee"}]}}, {"review": {"des": "Got to say, I am weirded out by the decor here - it is a little bit weird to be in a place whose visual and musical aesthetic is evoking a colonial period of Vietnam under French rule. It is also weird for this aesthetic to be in a relatively rich part of Chicago... I am always kind of uncomfortable in such visual aesthetics. That aside...<br><br>The food is quite good. I guess the best way to describe it is it's close to what you will find around Argyle Red Line Station, except there are some french influences, I assume. And it's about twice or three times as expensive. Luckily we got sort of a restaurant week deal. I had what is heavily sauced/marinated chunks of steak. Really well done (er, well-executed, not cooked to a rock-hard crisp) and easy to eat. It's almost like the Hawaiian BBQ Beef at Aloha Eats. Except in River North... I wish Aloha Eats was in the Loop... but I'm digressing...<br><br>We also had some sort of nachos thing. OK it wasn't nachos. It was like, some kind of... crisp rice cracked and ground chicken stuff you could eat with it. I think there was a lot of cumin in it. I can't remember.<br><br>Vietnamese coffee was good. The fried banana thing was just okay.<br><br>I came here for a special day but I probably wouldn't otherwise due to price stuff. But if you're dying for some good Vietnamese, ok with paying, and can't make the trip up to argyle , you probably can't go wrong here. The waitstaff were all nice and friendly.", "pics": null}}, {"review": {"des": "Not crowded for a weekday work lunch and the  service was fast and efficient enough to get back to the office on time. We shared the fresh spring rolls with shrimp and the monk fish appetizer. Both were great especially the monk fish. I had the trout wrapped in banana leaf- which were tastier and a larger portion than anticipated. My co diners had the pho which was warming for the cold Chicago weather.", "pics": null}}, {"review": {"des": "I ended up at Least Colonial twice in the same week. Once for my birthday and then a work dinner. Normally that would be kind of a bummer but I was so happy to go back to Le Colonial. They have a separate vegetarian/vegan menu that I includes multiple entrees, apps, salads, and desserts. I was really pleased with the selection and the clearly marked menu. <br><br>The first night our service was a little slow but the second time it was excellent. Both nights the server was very knowledgeable and polite. <br><br>The only weird thing about Le Colonial is the bathroom is so heavily perfumed it was almost too much to bear. But the food, service, and ambience we're great! Love having other \"fancy\" place with good vegan options.", "pics": null}}, {"review": {"des": "One of a kind restaurant with a wonderful atmosphere, welcoming service and tasty, light food! All of our dishes were great, but pho did stand out! What a rich , flavorful broth! Recommend it to everyone , especially when the fall is coming and we all need some warm delicious bouillon !", "pics": null}}, {"review": {"des": "I dined her on Saturday night.  I was very very well pleased.  I haven't been there in a while, but wanted to return because I remember the FANTASTIC cocktails and food.  The service was fast.  Staff very friendly.  Several people to servie each table.  I had the Trout with noodles wrapped and steamed in banana leaves.  Peanut sauce on the side to pour on top.  I wanted to pick up the plate and lick every drop.  We also had a shrimp dish with eggplant. The sauce was amazing.  Can't wait to go back for another relaxing dinner.", "pics": null}}, {"review": {"des": "I really liked it here the couple times I went. Today I ordered the Goi Dudu. It's a green papaya salad with dried beef and shrimp. There are only a couple little pieces of beef. It definitely wasn't the same thing I've ordered at the restaurant. If the deliveries aren't gonna be as good as the product u serve at the restaurant then u shouldn't charge the same price or call it the same thing. The customer is gonna be very disappointed as I am.", "pics": null}}, {"review": {"des": "Visiting a friend in Chicago and she mentioned this as the one place we have to try out. First impressions - really unique decor and a smell of coconut curry wafts through. <br><br>Service was great, had two folks taking care of the table, and suggestions for wine from one of them turned out to be quite good actually. <br><br>Started off with this monkfish appetizer Ca Bam Xuc Banh Trang, and it was amazing. I've never had monkfish, so didn't know what to expect, but that was delicious. I loved the texture and the peanuts in there really made it unique. <br><br>For the main course, my friend had the Bun Thit Nuong, and I got the Ca Nuong La Chuoi. Her pork was tasty, but my trout wrapped in banana leaves with peanut curry sauce was just unbelievable. The flavor was good, the sauce was yummy, but the fish, oh the fish was just perfect. Would strongly recommend trying that if you visit this place.<br><br>Finally, dessert was a creme brûlée. It was good, nothing extraordinary, but good. Overall, ambience is great, food has some real show stoppers, and service is very friendly too.", "pics": null}}, {"review": {"des": "Pros:<br>- Decor, design, & atmosphere. Very French colonial + tropical. Dimly lit. Wish an entire bar in Chicago was like this<br><br>Cons:<br>- Not bad, but also overpriced for the quality and quantity. Because of this, I usually just come here for drinks & desserts. But if you live too far from a Vietnamese restaurant and don't have transportation, then this is an ok spot. <br>- Love the bar area with sofas. But it's tiny. Wish it was larger", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/91FDvlKm5gvDs5P534k-Aw/348s.jpg", "caption": "spring rolls. they put mint in... dislike"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/_6wNSuhc4cWc_I1Obij3hw/168s.jpg", "caption": "salmon. unmemorable"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/7JJdljenpko60gr94lYM2g/168s.jpg", "caption": "tiny pho"}]}}, {"review": {"des": "My husband and I came in for my birthday and it lived up to expectations. I am glad we made a reservation because it was very busy. The menu was large but not overwhelming. My complaint is that I couldn't eat more. We got the whole snapper which had a great sour/sweet/spicy flavor and the lemongrass chicken. The Pho was a great thing to start with and was flavorful with tender flank. Pho is my favorite food and it did not disappoint.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/0gLO8Zr6kT5Z6oKyDOZ_9A/348s.jpg", "caption": "Pho ordered on a 90° day, thats how good it is"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/euezVJcpVw5QgwgbIl70_A/168s.jpg", "caption": "Bun Thit Nuong -awesome, would order again"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/RoGfB0mnaf_GD3KcDnNhoA/168s.jpg", "caption": "Lemongrass chicken"}]}}, {"review": {"des": "i had been wanting to go to this spot forever. it was a beautiful day so i finally decided to go. we sat outside on the patio, which was lovely. i got the sangria that had an asian spin. it was super fresh. my husband got the guava martini, which was tasty as well. to start with got the vegan spring rolls. they were light and tasty, perfect to begin with. for my entree i got the vegan curry. oh my gosh it was delicious, great quality and flavor. it is a little pricey, but definitely for a reason. i recommend for a weeknight date when the weather is nice!", "pics": null}}, {"review": {"des": "Le Colonial is a great dinner spot, wonderful for groups, and a nice ambiance, given the colonial era French-Vietnamese theme. We had out of country (UK) family and city-based family and had reservations for a Thursday night. We had a short wait after checking in and were seated in the main floor (while tight, this is where you want to be if you are a group). The service was attentive, quick, and helpful in menu selection.<br><br>For a group of 6, we ordered Banh Cuon (Chicken Ravioli), Ca Bam Xuc Banh Trang (Monkfish - the best appetizer), and Salad Rolls. For entrees, we ordered the Mi Xao Don Chay (tofu and veggies), Ga Xao Xa Ot (Lemongrass Chicken - delicious), Crispy Duck, and a Beef Filet Noodle dish. This was enough for a group of 6, and we had leftovers to boot. <br><br>We did not order dessert given the proximity to Mariano Park and Whisper's Café, so we opted to walk and take in the summer night to grab gelato thereafter (a good option given the location).", "pics": null}}, {"review": {"des": "I dined at Le Colonial recently for a work outing. The restaurant was very compact, and we felt quite in the way of other diners and the servers throughout the meal. Our servers were extremely attentive and did a great job. We had a delicious rose wine with our meal and some interesting appetizers such as sugar cane shrimp, monk fish, and tuna. For my main course, I had the filet and shrimp. The filet itself was cooked to perfection; however, the tomato rice side and abundance of leafy greens both left a lot to be desired. One of my teammates had the pho, and it smelled wonderful. The meal was good but not great for the price.", "pics": null}}, {"review": {"des": "Wonderful dinner and evening for our anniversary! Le Colonial's interior is lovely and makes you feel like you were transported to the Saigon of another time. We had a window table overlooking the bustle of Rush Street with pretty window boxes of Spring flowers framing our view. <br><br>Our server Samuel could not have been better! He patiently answered my questions and made inquiries on my behalf regarding cilantro. The Bo Bia appetizer of soft salad rolls with a plum peanut dipping sauce was fantastic! We both enjoyed our Ca Nuong (salmon) and Ban Pho Xao (shrimp) entrées, each served with perfect noodles and vegetables.  We shared the rich chocolate mousse cake for dessert.  <br><br>We both are eager to return.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Kt44vDCfEgZfxfIf_upaLg/348s.jpg", "caption": "Bo Bia Appetizer"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/B05eyDkl5jWFOSFQsLcKmQ/168s.jpg", "caption": "Window table, Rush Street"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/YsyWEMgWbNbGFXLBenjc2g/168s.jpg", "caption": "Dining Room, Le Colonial"}]}}, {"review": {"des": "Okay so...this place is really just super expensive Viet food and don't get me wrong, I love my dining experience here but it's one of those \"just try it once and never again.\" My friends and I (party of 4, all Vietnamese btw) made reservations for dinner here on a Friday night. Best to make reservations for this place.<br><br>We ordered chao tom for appetizer (comes in 4 small grilled shrimp rolls). It was delicious and the sauce was addicting.<br><br>We shared an order of pho (the famous viet beef noodle soup), ca nuong la chuoi (grilled trout wrapped in banana leaf), mango chicken salad, and bo bitet tom nuong (filet mignon & shrimp). They were all fresh and perfectly flavored. I cannot say anything bad or negative about the food. I would skip the grilled trout though..a bit unique taste but my friends and I loved the pho & filet mignon/shrimp dish. The only issue here is the pricing...honestly, if you go to Argyle/Uptown area for the same viet dishes, your bill would be 1/2 the price (if not, even cheaper). But..you are paying for the fine dining experience and freshness of the quality of the food.<br><br>A cool thing that happened was our waitress was so kind to give us complimentary dessert for the birthday girl after we inquired if there was any specials for birthdays (they normally don't have complimentary desserts).<br><br>Upstairs has full bar that you can order drinks from if you are waiting for your table. Street metered parking wasn't too difficult to find since it's located a bit off the Mag Mile area. They do enforce dress code so definitely dress up a bit when you dine here!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/jvoJZ9-aFVysr0-EXsDqlw/348s.jpg", "caption": "Chao tom appetizer $13"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/YYCsSeWCXR3_8VXA3wu3Nw/168s.jpg", "caption": "Chicken mango salad $14"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/YnYfVglDx1qzAHMxWUwyaw/168s.jpg", "caption": "Bistek with shrimp and rice $38"}]}}, {"review": {"des": "Having read a lot of great reviews and a friend who has been here on several occasions who really raves about it (it happened to be her birthday when we went here), we were expecting to have a wonderful experience.<br><br>Right off the bat, their service needs a HUGE improvement.<br><br>As I entered the establishment, there was a hostess at the bottom of the stairs.  We had reservations but each of the 5 of us was arriving separately.  With an absolutely lifeless and \"I don't care\" attitude, the hostess said to go upstairs and ask for \"Bianca\"...<br><br>I went upstairs and two from our party were waiting in the bar area for the table there so I didn't need to ask for Bianca.<br><br>We got our table and the shortly later the two others arrived describing the hostess episode exactly how I experienced it.  Funny thing is when they got upstairs and asked for Bianca, they were told she didn't work today. I noticed them from afar and went to get them.<br><br>Our server (she seemed European or maybe Eastern European) was one I'd fire on the spot if I was the owner of this establishment that claims to have the 1920s vibe.  She was clearly providing an indifferent service to our table as compared to others.<br><br>Towards the last half hour or so, we suddenly had a different server and the original one was nowhere to be found.  Fine by us as all of us appreciated the new server.  We actually wished why on earth wasn't she our server.<br><br>The gentleman clearing the table; not sure if this should matter or not but I think it does.  Literally quiet with almost a mildly angry expression on his face.  He was clearing our table and helped pack the left overs.  Felt a little uncomfortable.<br><br>The food?  Hmmmmm, I've had much much better and can confidently say the price ain't worth it here.<br><br>I ordered #30 (I requested medium rare on my sirloin pieces half of which were really overcooked.)<br><br>My wife who is a vegetarian ordered a vegetarian entree but didn't care for it much either.  Quite \"Bland\" is what she said it was.<br><br>The person whose birthday it was ordered the salmon which was fantastic.<br><br>Their vegetarian fried rice is truly one of the best I've had as are their spring rolls.<br><br>I strongly doubt I'll ever go here again.", "pics": null}}, {"review": {"des": "The pho was delicious.  Very small portion for the price though.", "pics": null}}, {"review": {"des": "One of my favorite places to eat in Chicago (Gold Coast area). You really can't go wrong with anything on the menu. <br><br>Le Colonial is a lovely, very dependable upscale French-influenced Vietnamese restaurant and most of the experiences I've had here have been rather good.<br><br>It has a quiet, classy atmosphere with colonial-inspired decor and fantastic, quick, and courteous service.<br><br>The prices are pretty reasonable around lunch time (for the quality of food)! Great place for dates, place to take your parents, business meetings, etc. the ambiance is always on point. <br><br>Most recently, my mom and I went there for lunch. We ordered two appetizers and each had a bowl of pho - this is the perfect amount for us. The Bahn Cuon was delightfully  flavorful, with a nice citrus-y after-taste, and the Banh Uot was also really nice, with a bit of a darker flavor (in comparison to the light Bahn Cuon) that compliments the sesame beef very nicely. <br><br>The pho also reliably good :)<br><br>We've ordered entrees in the past, and they've always been wonderful. Decent, shareable portion sizes! Your waiter should be able to give you an excellent recommendation! :)", "pics": null}}, {"review": {"des": "I went into my dinner at Le Colonial with high expectations as several people in my party claimed it as their favorite restaurant in Chicago.  While I can't echo the same high praise, it was an enjoyable experience overall. <br><br>The ambiance inside the restaurant is wonderful. Upon walking in you are immediately transformed into a French inspired Vietnamese world. The staff was very attentive and flexible when we added an additional guest to our reservation. At any moment in time our waiter could be found nearby and taking care of anything we needed. <br><br>Our group ordered several appetizers to share before the meal. Each dish came with plenty of garnish and a delicious homemade sauce. After hearing rave reviews, I ordered the scallop salad as my entree. It was tasty, but definitely not my absolute favorite. In fact, my scallops were slightly undercooked. I'm sure they would've fixed this for me in an instant, but my entire party had their food and I didn't want them to wait for me once they were done. <br><br>Overall, cool place to try. It was expensive though, and the food wasn't worth it to me. There are plenty of more authentic restaurants where you can get cheaper food in the city.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/udlObhPqpZdUUojjs60VAA/348s.jpg", "caption": "Bun Thit Nuong: BBQ pork"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/5ayf2-1Vejp7g7WusNRl4A/168s.jpg", "caption": "#14 Goi Bun So: scallop salad"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/CT2vaawTctxBIwo0nvQl9g/168s.jpg", "caption": "#4 Chao Tom: Grilled shrimp"}]}}, {"review": {"des": "This is an amazing restaurant!!! Definitely the best Pho I have ever had and I didn't even have to put in extra things to make it tasty. In addition to the food, the service was amazing and we really enjoyed the atmosphere. Also has a very calm and relaxing lounge experience.", "pics": null}}, {"review": {"des": "I fell in love with this restaurant.<br><br>As you walk in, you are transported into this colonial looking home with plants everywhere.  There is a downstairs and upstairs (we sat at a corner table downstairs, but the upstairs did look just as nice).  <br><br>We came here for date night; perfect option for that.<br><br>They have a gluten free menu which made things really easy for me.<br><br>The food was delicious.  I had the shrimp with asparagus, and my date had the roasted chicken (which was a huge serving).<br><br>Excellent service.<br><br>I would definitely come here again!!", "pics": null}}, {"review": {"des": "This restaurant had a very chic feel with a very intimate setting. My boyfriend had placed reservations for our anniversary prior to our trip to Chicago. Upon arriving we were greeted and escorted to our table upstairs - our server was okay, not the greatest service. I felt as if we were being ignored most of the time and towards the end a little rushed, almost as if they wanted us to finish up and leave. We had given her a chance to, \"redeem, \" herself but she was not as accommodating towards us as she was to others dining there. She was either having a bad night or so, but I wish she could have been a little more friendlier. <br><br>I had a lovely time with my boyfriend. Food overall was delicious. Portions were good, just enough to share for 2 people. We did order a lot of food, and keep in mind dining upstairs can be a little tricky - due to the fact that it is a very tight space, and tables are very small (not even an arm's length). Cocktails were just as good as well. <br><br>Customer service could be better in my opinion. I wouldn't mind coming back here just for the food.", "pics": null}}, {"review": {"des": "I had the CA HAP which is steamed fish in English. The steamed fish was Chilean Sea Bass and it was de-licious. It was so good that once I had a bite I couldn't stop to take a picture until it was all gone. The sauces and spices of this dish were blended to perfection. The sea bass was so tender and moist not dry. EVERY bite was delicious. I also ordered my dish without tomatoes.<br><br>Le Colonial takes French Vietnamese pretty seriously but not consistently. I have been there a couple of times before and haven't been pleased with my meal OR the meal will be good but not the dessert.  However, when they're having a good day the food is really good!<br><br>If it's nice outside they have tables on the sidewalk but the sidewalk is so narrow that the passerby can be distracting. There's an upstairs patio with tables which is very quaint overlooking Rush Street.<br><br>I have found the service to be consistently good and have appreciated those working at the host stand and coat check.<br><br>Le Colonial is a nice place to have a meal for business or pleasure. The noise level seems fine even if diners are sitting at the table next to you.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/S_aWaKqiDRCwFSXBmmSNcw/348s.jpg", "caption": "Caramelized Lemon Tart. It was ok."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/aa3PIWLp4miBKEobDPtUZw/168s.jpg", "caption": "Crispy Banana Wonton with ice cream."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/1RSlYG-igzcdX2Y2XOCmzA/168s.jpg", "caption": "Crispy Banana Wonton."}]}}, {"review": {"des": "one of my favorite restaurants in Chicago with a great Vegan menu! I love the coconut curry please never take that off the menu I come for that once a month. the service is great too, they are always super nice, the GM older guy that is always there is very nice and will always get us seated! Thank you guys!", "pics": null}}, {"review": {"des": "Ordered takeout from Le Colonial for dinner and felt that the food was overpriced and sub-par to say the least. I can get better Vietnamese food in Chinatown for half the price! I ordered a pho for $9 that fit in a plastic pint. That is literally what it was stored in, no exaggeration. For that kind of money, I could've purchased an extra-large bowl of better pho. Likewise, I paid $12 for a banh cuon that didn't taste half as good as ones I purchase from more authentic Vietnamese restaurants, AND for half the price. I understand that this is a fancier establishment, but prices should reflect quality and I didn't think that was accomplished.", "pics": null}}, {"review": {"des": "My partner and I hold this place in high regards. The staff is so kind. We made reservations on open table for the wrong Saturday night but were still able to accommodate us.   <br><br>If you are a fan of  desserts, their lemon tart dessert hits all of the right notes. The crust is flaky and the in house made whipped cream is worth talking about.  The cream is light and not overly sugary.", "pics": null}}, {"review": {"des": "This place is phenomenal. I've never had a meal here that wasn't wonderful. The depth of flavors are wonderful and nothing is greasy. The ambiance is quinitssential Viet Nam. Service is always attentive and pleasant.", "pics": null}}, {"review": {"des": "What a great experience!! I was having a business meeting with my partners from California so I was a bit nervous when I choose the spot. Michael the host sat us in a very comfortable table and being our first time here I didn't know what's good to choose so I let my server to order for us . The food was phenomenal, Lorissa, I think her name was, made the perfect choices paired with a a great wine, not too overwhelming or too much. Such a great dinner.", "pics": null}}, {"review": {"des": "Le Colonial transports you into classic vietnamese cuisine. The interior is very, colonial. There are plants everywhere that make it seem like your in the jungles of Vietnam. There are large ceiling fans and the inside is romantically lit. There is a fabulous bar upstairs that serves a myriad of excellent house cocktails, albeit I found mine a bit on the sweet side. <br><br>I had the Ban Pho Xao, which was exquisite. It the noodles were soft, long, and greasy, the toppings (I had beef) were cooked perfectly and the dish was totally a pleasure fest. I would recommend Le Colonial to anyone. I will be back to try more of their dishes. <br><br>SIDE NOTE:Wow they had festival style big room/house edm blasting at the bar. Terrible taste come on...", "pics": null}}, {"review": {"des": "I haven't written a review in years but feel compelled to do so after such a disappointing meal.    Heads up that we had our food delivered, so our experience may not be representative of an in restaurant meal.<br><br>The gist is that we splurged on this super expensive take-out meal (paying $22/entree plus the delivery fee) in hopes of getting something remotely similar to the authentic bright, fresh Vietnamese flavors we were used to at hype-free neighborhood places in NYC and so far have not been able to find here in Chicago (though I have no doubt it's out there--readers, any tips are welcome! Maybe on Argyle?) <br><br>Given that the price at Le Colonial was 2x that at most Vietnamese restaurants in the city, we were expecting something notably different and elevated from the usual-- complex flavors, lots of fresh herbs, thoughtful presentation, and high quality ingredients. The first thing we tried was the Goi Ngo Sen, a fresh, tangy, herby tofu and lotus salad which was not incredible, but was interesting and tasty enough to give me hope for the rest of the meal. Sadly, everything else we ordered was small portions of bland mushiness. The bun pho xao noodles were heavy and limp with a few small pieces of broccoli and tofu with a faint soy flavor and was in no way distinguishable from $9 carryout from any local Asian place (plus you only got half as much). The Mi Xao Don Chay was seriously lacking in flavor and just tasted like unseasoned steamed vegetables. I feel really silly for dishing out so much cash for such lackluster food. I'd be really curious to know if the quality of the Le Colonial has deteriorated with time or if it's always been just hype because of the location and decor.<br><br>(In case you're wondering, yes, we're vegetarian, so maybe that was the problem. But, in this day and age, I don't think it's unreasonable to expect that a restaurant be able to produce meat free food at the same level as the rest of their menu.)", "pics": null}}, {"review": {"des": "Great experience here last Saturday night. We called that afternoon about reservations for three which of course we were not surprised to hear they didn't have. We were told they have a bar and lounge on a first-come-first-serve basis. We arrived around 7:00pm and settled in at the bar to wait for a table as it turned out that information was half correct: 100% of the tables were reservation only. Thanks to Michael, we only had to wait 20 minutes for him to seat us. The service was excellent, food fresh and delicious. My friends and I shared fresh rolls, roast duck and a curry dish. They were all complex in flavor and cooked perfectly, also presented beautifully. Would definitely return and recommend.", "pics": null}}, {"review": {"des": "I ordered through Door Dash for lunch on a weekday.  <br><br>The food came sooner than estimated which was a plus.<br><br>I got cha gio and pho.  The cha gio came with 4 spring rolls...they were really good and pretty authentic to me.  The pho was bland.  The broth barely had any flavor and the portion size was smaller than bowls of pho in Argyle.  <br><br>I don't think I'll order delivery from here again.  I might order carry out of just the cha gio next time.", "pics": null}}, {"review": {"des": "I have mixed feelings about this restaurant.  I've eaten at Le Colonial five times and sometimes the food is very good and others it's...well just bland.  They used to have a rice dish that was divine, full of flavor, and I don't understand why they took it off the menu. The last entrees I tried were a coconut curry shrimp dish and a yellow curry with chicken.  Both were good although could have been excellent with some more spices (flavor) added.  Service has always been great so far.", "pics": null}}, {"review": {"des": "This spot was good. I was in a bit of a funk that day so I would like to try it again for sure with some friends. It strikes me as more romantic place than a group dinner spot with the close quarters and darker atmosphere. The food was good but I did not get much help on what to pick from our server, which was disappointing. This is not cuisine I know well and could have used some guidance on what to order. <br><br>I will work on the husband to try it with me or suggest it for a double date so I can try it again. The space is beautiful so please try it because it is on a great street with a cool outdoor space.", "pics": null}}, {"review": {"des": "Somewhat Disappointing<br><br>We were looking forward to this Vietnamese fusion restaurant because of some great reviews and we were disappointed. The food simply was somewhat dry and lacking in the flavors that we expected from this type of cuisine. For appetizers we had the Chao Tom (shrimp wrapped in sugar cane) and Tom Cuon Ram (shrimp and chicken beignets). Then we shared the Lemongrass Chicken Breast which was somewhat dry and the Chilean Sea Bass which simply wasn't seasoned to be special. This is an expensive restaurant and the food simply wasn't outstanding.", "pics": null}}, {"review": {"des": "This is my new favorite. We came for an early dinner 5:30 while staying across the street. Our server was very helpful band friendly. He has been working with them for over 20 years. We had the spare ribs and spring rolls for appetizers, chicken with lemongrass, duck and side of fried rice for dinner. Banana Tapioca pudding. Everything was delicious! Will definitively come back and highly recommend. The decoration is very beautiful as well. Too bad that it's so far away from home.", "pics": null}}, {"review": {"des": "Let me premise by stating clearly that some of the yelp reviewers should stick to the neighborhood Asian takeout places instead of writing a negative review. <br>The location is pristine; right in the heart of the Gold Coast. The restaurant itself is beautiful with large exotic plants, white tablecloths and uniformed staff. <br>The cha gio was served exactly as it should be and was full of flavor, not greasy. I loved the cari tom as a main course which was shrimp with Japanese eggplant in a delicious curry sauce. <br>Service was friendly and not overwhelming. Drinks were great too. I will be back.", "pics": null}}, {"review": {"des": "From a Vietnamese person's point of view some of the flavors were a little lacking. While the food was good quality, the sauces either needed to more spices or there just needed to be more sauce. We came here for Restaurant week. I started off with a French martini which is pretty tasty if you prefer a floral sweeter drink. For appetizers we had the banh uot and tuna tartar. Our table had 2 banh uots and one definitely had more sauce than the other. The tuna tartare was one of the most bland tartars I've ever had. Entree we got the tofu cari, ca nuong, and bo sate. The ca nuong was by far the best out of the three. It was good but nothing stand out. The bo sate was pretty bland and usually anything sate packs a flavorful punch. We didn't get to try any of the dessert because they ran out. Overall it was a nice ambiance and beautiful restaurant. The food wasn't up to par of the price. The service was mediocre.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/8vyosVvZMt0QIdyKIqusHA/348s.jpg", "caption": "French martini. Delicious!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/OSFk9X9yDWnEtlmB9Lj3NQ/168s.jpg", "caption": "Ca Nuong"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/zEEbKYeIeFalMkrsV89zPg/168s.jpg", "caption": "Banh Uot"}]}}, {"review": {"des": "We sat outside on Friday evening, weather was perfect and people watching is always fun. We enjoyed the food, trout with cellophane noodles and shrimp in coconut curry sauce were good. Unfortunately service is what you could expect at an Applebee's not as an \"upscale dining restaurant\"<br>Our waiter ( not sure he ever shared his name but he had a foreign accent) was very short and was very un-personable.", "pics": null}}, {"review": {"des": "I have now dined here twice and have never been disappointed with the food that is served. Amazing Asian fusion taste. Great drinks and great appetizers to choose from. The atmosphere is more of a mellow relaxing setting. Great for romantic dinners or having  a get together.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/TKTzgiVa0IGT-IyTKSjSgQ/348s.jpg", "caption": "Apps"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/S57EWQO9GlGcjYfmETA6rw/168s.jpg", "caption": "Appetizers were on point!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/wPStH0ERuHPtBI5PjX34_g/168s.jpg", "caption": "#25"}]}}, {"review": {"des": "Charming, attentive and polite service, and delicious food.  I was craving a flavorful bone broth so I ordered the Pho--made from oxtail stock, it was deeply flavorful and delicious.  The trout was light and accompanied with a cream curry sauce that I couldn't get enough of.  Top it all off with a Le Colonial Macaroon (ice cream on top of a macaroon) and this gal had a good mile walk back to the hotel in an attempt to walk a bit off.<br>Looking forward to visiting again.", "pics": null}}, {"review": {"des": "What an awesome restaurant? Upscale, high fidelity service in a beautiful atmosphere. The menu was easily navigated and the choices were varied. Even accommodation for vegan and gluten free were possible, as well as substitution of protein food in some dishes. <br><br>The food was delicious and well proportioned. We tasted a number of appetizers and enjoyed their pho offering. <br><br>Highly recommended if you are in Chicago and the rush street scene.", "pics": null}}, {"review": {"des": "This is my FAVORITE PLACE IN CHICAGO. I come here every time I come home to visit family. The noodles are to die for, the service is kind and attentive, and the aesthetic is classy beyond words.", "pics": null}}, {"review": {"des": "There are a few things to like and dislike about this place. We came here for restaurant week and ended up being slightly disappointed. The pros were the atmosphere and the host who sat us. The quality of the food was also pretty good. However, The dear girl friend is Vietnamese and the flavors were very lacking on this day compared to home made Vietnamese food. I ordered the tuna tartare which again tonight was good quality but the flavors were not at all. It was pretty much poke but lacking the flavors. The filet mignon dish again great quality steak but not very flavorful. The disappointment was the restaurant running out of dessert. I understand that they are probably busier because of restaurant week but I thought it was a little bizarre that they run out of one of the main dishes. They were very nice about comping us one glass of wine and obviously deleting the price of the desserts, but I really wanted to try the desserts and was disappointed as a result.All in all, I probably wouldn't come back. Being in the Gold Coast and having the reviews it does I just expected a little bit more. If you come here you'll enjoy good quality food, but you might be wishing for a few more flavors", "pics": null}}, {"review": {"des": "Seriously the same food you can get in china town or at Argyle with the price tag multiplied by 2. I had heard good things but clearly those people never got off the red line at cermak or argyle. Food was still decent but the noodles were so dry I choked. You are paying for the experience of eating between Dior and Hermès, nothing else.", "pics": null}}, {"review": {"des": "Wait time:<br>We had a reservation, so not sure about walk-ins. Got there around maybe 9pm and it was packed to the brim! <br><br>Ambience:<br>Really liked the ambience and decor of the place. The bar area upstairs, where the bathrooms are was cute and staff members were pretty friendly.<br>We were a group of 12 and boy was it a tight squeeze, good thing we're all close$ like each other. They accommodated one more seat without any problem. <br><br>Service:<br>Service was good, our server was attentive and nice.<br><br>Food:<br>Had a salmon dish, which was okay. The calamari and spring rolls were pretty good.<br>I had a vodka drink, don't remember the name, it was okay too.<br><br>Nice place in general. Liked the ambience better than the food. Would go back to check out the upstairs area. In all, worth checking out, it's really cute inside.", "pics": null}}, {"review": {"des": "This place is a gem!! The atmosphere is quaint and chic. The food was appealing to the eyes and the palate. We ordered multiple appetizers which were small but filling. If you don't have a reservation, try the bar upstairs! You will enjoy this place.", "pics": null}}, {"review": {"des": "The bartender named Mehdi is fantastic with recommending cocktails. He also makes a delicious lychee margarita. I'm loving the romantic vibe of the restaurant. I recommend this place for a first date or a casual Sunday with your significant.", "pics": null}}, {"review": {"des": "Beautiful place and environment. The food was good but nothing worth the prices. Was a tad better than your local Thai/ Vietnamese spot. $12-$14 apps, $14 cocktails, $24-$38 main dishes.", "pics": null}}, {"review": {"des": "Flavorful appetizers, great wait staff and cool cocktails. Lemon tart with a Vietnamese coffee for dessert was a perfect ending to an excellent dinner.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/6sIvLFctddUcF1fh3Xwxvw/348s.jpg", "caption": "A delightful French martini!"}]}}, {"review": {"des": "The flavor was ok. Not the best. I ordered the pho to go. Very small portion. Will not go again.", "pics": null}}, {"review": {"des": "Came here last night with a party of four for dinner. Overall, we had an amazing experience. We were seated on the top floor which had a great ambiance, wish the weather had been better to sit outside!<br><br>For starters, we ordered the spring rolls and the tuna tartare. Both were delicious!<br><br>For entrees, I ordered the bbq pork which was great, although definitely didn't need half of the greens. My boyfriend had ordered the duck, but the waitress misheard him and brought the filet mignon dish. He settled for the filet mignon, and it was very good. The meat was cooked very tenderly.<br><br>Best dish by far was my cousin's who ordered the fish in the banana leaf wrap with peanut sauce...wow I wish I had ordered that!<br><br>We topped it off with the mango sundae for dessert. This place isn't cheap, but worth a visit for a special occasion with friends who are a bit more adventurous with their food.", "pics": null}}, {"review": {"des": "Wow!!!!!  The food is delicious and the chef managed to bring authentic flavors to the dishes!!!<br><br>I was skeptical when I checked out the menu and saw how expensive the dishes were. However, i LOVE Vietnamese food and I wanted to try; for better or worse. In this case, it was for the best!!!! I was not disappointed at all. (Keep in mind the costs of operating such a restaurant in such a hot spot in Chicago, money well spent.)<br><br>I ordered several dishes; Pho, goi dudu, bo bia and banh pho xao. Plus lychee sangria. Each dish kept with traditional delicious flavor.  Most often, to order these dishes (that tasted this good), I traveled to places like Little Saigon in Los Angeles, San Jose in Northern California or Houston, TX to have such an experience. So to have this available here in Chicago is such a treat!!!<br><br>My compliment to the chef(s) to put these dishes together with authenticity. My compliment to the waitstaff, especially Francisco! Delicious food plus fabulous Francisco equal successful dining experience. <br><br>Besides the fantabulous food, you get to experience the Indochine period with the restaurant design.", "pics": null}}, {"review": {"des": "Great location right downtown! I ordered the ox tail pho- the portion was a good size, the meat was tender, the broth had good flavor of star anise (the way pho broth should taste), however, it was slightly on the saltier side. I still enjoyed it very much! I also ordered the fresh spring rolls, and yes, they were very very fresh! I could taste the mint in every bite, very refreshing! All in all, 4/5 stars! I will be back!", "pics": null}}, {"review": {"des": "An old Chicago favorite.  The food, decor, and atmosphere are all outstanding.  A nice place for dinner or perhaps a few drinks at their upstairs bar.  Love it and will keep coming back.", "pics": null}}, {"review": {"des": "We came here with a big group and they took good care of us- coat check was nice for the winter.  I got a spicy pineapple tequila drink which was really fresh and good.  My husband and I split a pork dish and fried rice- I wasn't amazed by the food, but it was good overall.<br><br>The ambience of the restaurant is nice, and they took good care of us.", "pics": null}}, {"review": {"des": "Excellent service! We were a group of 12 and the staff was pretty accommodating. The only reason why I gave 4/5 is because we got seated about 20 minuets later. Food was EXCELLENT!", "pics": null}}, {"review": {"des": "This restaurant has excellent food and service. Try the pho and the steak salad. Reasonably priced and I would like to try it here again. Thanks for the nice dining experience!", "pics": null}}, {"review": {"des": "The best experience ever, we got sat on the beautiful terrace from their second level, the food was phenomenal, the decor is similar to an exotic place. We ordered cocktails and let me tell you the tamarin drink is giving you the perfect buzz! Our server was able to give us some great guidance , and her suggestions and service were top notch, and made us, and our taste buds feel very pampered. Don't skip dessert, the passion cake is amazing, and also our blondie server had the kindness to put a candle for our anniversary. We will definitely come back.", "pics": null}}, {"review": {"des": "4 stars for the pho because the beef is top notch quality. I come here only for the pho because the rest of the menu is overpriced. I'm not interested in paying for ambiance. As a Viet, I can't justify paying more than 2x for dishes I can get elsewhere or make at home.", "pics": null}}, {"review": {"des": "Ummm yes please...<br><br>Amazing. French influenced Vietnamese food. I have been to many Vietnamese restaurants- this is by far the best. My sister had not had Vietnamese food before; she loved it. My friend Kelli recommended this place. <br><br>Our waiter Madhi was French and morracan. He helped us with the wine choice and food choices<br><br>Started out with the #1 egg rolls appetizer. Oh my- have had egg rolls before but not like this.they showed us how to wrap them in lettuce, herbs and dip in fish sauce. Scrumptious!<br><br>I had the #23-shrimp-Tom Sao sate- Sayers jumbo shrimp, asparagus, onions, scallions in a light sauce of sate spice, chili and garlic. My sister had a shrimp dish with eggplant in it- it was great too!<br><br>For dessert I got the Lemon tart- very  good. My sister got a tapioca pudding. It was good but I like mine better!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/iI7zw_6gdu29hqOOnrFYxQ/348s.jpg", "caption": "tapioca pudung"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/rM894UQUFz-1wiKHPCvDdQ/168s.jpg", "caption": "lemon tart"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/5Y8TolWdiaC5kV72FHiWCg/168s.jpg", "caption": "pretty!"}]}}, {"review": {"des": "Very unpleasant experience, during the whole dinner we had on the patio, we were being surveilled by 2 angry not happy looking eyes of the guy who for some reason waits at all times at the patio door, my son's high chair was removed immediately when him and his grandma were gone outside for a short walk. My 2y old son was very, very unwelcome there and they made us feel it in every way, which is quite a discrimination in my opinion towards parents who don't have much of an option sometimes... Our server was friendly however food wasn't really even close to what I would have for half-price elsewhere, after all I believe this place is really overrated, would not recommend!", "pics": null}}, {"review": {"des": "Not only the food (nice fusion of Vietnamese and French), but also the environment was amazing. The pho is good to start with. It is authentic and not heavy. Among all the food we ordered, our favorite was steak and grilled shrimp. They were served on top of really good fried rice and mixed of salad. The Vietnamese coffee is good to finish with.", "pics": null}}, {"review": {"des": "Wish we found this place sooner. Overall excellent! The Goi Cuon, Pho, and Tom Xao Sate were fantastic! Would not get the Chao Tom. Top-notch attentive team service. Highly recommended.", "pics": null}}, {"review": {"des": "A rare  dining experience. This place was recommended to us by a friend brought me back to colonial Vietnam when the French were the occupying country. The restaurant was elegant and comfortable. The food was quite good and we enjoyed the quality of the service. I had a lovely Decour and we enjoyed our time there.  I look forward to returning soon", "pics": null}}, {"review": {"des": "Not bad at all, but it was slow to get seated (waited 15 minutes standing in a cramped lobby) with a reservation and a bit slow on the service for our first visit. Otherwise, the staff were very friendly and enjoyable for the rest of the meal.<br><br>My hubby really loved the beef salad, but I was underwhelmed with the whole fried snapper. I did appreciate their initial presentation and separate filleting but the batter was not crispy and the sauce was not quite outstanding in any way. It was quality fish but I've had it prepared much better, for much less.<br><br>The server said that the snapper is the standout on their menu, so it wasn't too impressive. Our other family members had gotten the pho and they seemed to enjoy it a lot, although the bowl is on the smaller end of portion size. <br><br>Interior is very atmospheric and beautiful, imo. Would love to check out their bar if I ever frequent here again.", "pics": null}}, {"review": {"des": "Totally won over by this place! So many reasons to love it: it's way more upscale than any other vietnamese restaurant you've ever been to, the menu is very diverse, the service is on par with an upscale restaurant, and it even has linen on the tables (which you rarely ever find in vietnamese restaurants). Let me preface this review by saying that I had to listen to two college-age girls at the table next to me talk endlessly about their bad dating history. Seriously these two girls had too much drama.<br><br>Back to the important stuff. The restaurant decor is so nice with the white table linen, staircase, and decorative plants and mirrors around the dining rooms. The food presentation was great, the quality of the food was excellent, and the service was very attentive. I ordered the Chao Tom which was grilled shrimp wrapped around sugar cane. It came with angel hair noodles and peanut dipping sauce. I also ordered Pho. Both were full of flavor. FYI: the pho is not served in your traditional size bowl you find at other vietnamese restaurants. It's a rather small bowl but it still fills you up. <br><br>This is now one of my favorite restaurants in Chicago. I will be back every time I'm in town! Great service and wonderful food! Highly recommend.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/z74clVKghWsO675Rm-ATqw/348s.jpg", "caption": "Inexpensive too!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/8Dxy4m2RrSJTHwZo4Br2Mw/168s.jpg", "caption": "Siracha and hoisin sauces served in a tiny dish"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/UqwLiV4ojbBW0NLOq67YZQ/168s.jpg", "caption": "Pho"}]}}, {"review": {"des": "Love this place. Great calm and romantic atmosphere. Huge plus is the separate vegan menu. AMAZING! Small variety, but more options compared to other non vegan restaurants. I ordered the tofu curry with spring rolls. Great flavor and everything tasted so fresh. Exceptional service. I dropped my fork and a waiter rushed over to pick it up and gave me a clean one. Constantly checking on you, but not too much where it is annoying. Definitely returning. 4 stars instead of 5, just because the food was good, but not great.", "pics": null}}, {"review": {"des": "6 long years. That's how long I've been waiting to get back to this restaurant. Without looking at their menu online, I secretly wished that the red snapper meal was still available. I've been to Chicago many times since the last time I ate here, but tonight was the first time I had the chance to come back here for dinner.<br><br>One of my favorite things about Le Colonial is the atmosphere they have created. I haven't been to Vietnam, but this is what I would envision without ever being there first hand, complete with spinning fans hanging from the ceiling. The staff has been wonderful on both visits from the manager, to the hostess, and everyone else in between. You won't have an empty dish on your table long and you will never run out of water.<br><br>Long story short, the red snapper. Order it. It's delicious, and quite frankly, one of my favorite meals I've ever had. It you're adverse to some small pin bones, well, I can't help you much there, but I do prefer the table-side filet option to save myself from the effort. The sauce is wonderful, not too sweet, not too spicy - and perfect with the side of rice.<br><br>For dessert, I highly recommend the banana tapioca pudding along with a cup of Vietnamese coffee.", "pics": null}}, {"review": {"des": "One of my very favorite restaurants in all of Chicago let alone the Gold Coast.  It's vibes have held strong for nearly 50 years and the quality has not faltered even one bit.  It's a very romantic setting perfect for couples or big parties.  Every dish has a diverse set of flavors and cultural flair that will not leave you disappointed.  The waiters are usually quite eccentric and willing to go into detail about what they recommend.  <br><br>If I were to make any dish tips I'd say you absolutely MUST order the monkfish to start.  It's a white fish minced and diced with veggies served with incredible crunchy \"chips\".  Perfect for the group to share and try something a bit more outside the box!<br><br>As for main courses, I can't say I've ever disliked any of them but the basic lemon chicken dish (Ga Xao Xa Ot) is absolutely delectable and if you're a brave eater tell them to make it spicy, further enhancing an already fantastic dish.  <br><br>Outside of these few tips you really can't go wrong with this spot.  Me and my girlfriend tried it several months ago and have been back last least 3 times since.  Going back this Friday for her birthday!! You simply cannot fail with this particular eatery!", "pics": null}}, {"review": {"des": "If I was merely critiquing this place on the food it would get 5 stars hands down. The red snapper was phenomenal. It was one of those things that you taste that is so delicious it makes everything else stop. The flavorful sweet and tangy sauce with the garlic and ginger notes intertwined with the crispy skin and moist succulent flesh of the red snapper, it was just divine. I would come here just for the red snapper. The lettuce wrap crispy spring rolls are a hit and the dipping sauce with orange and fish sauce was very well balanced. The filet and shrimp dinner was very well executed and seasoned to perfection. The lychee sangria was exactly what you want in a cocktail, not too sweet and dry enough to whet your appetite. Desserts were good but nothing mind blowing.  So why does this place get 3 stars? For two reasons. First the area we were seated in had two really dirty rugs, and unfortunately the rugs had a very off putting smell reminiscent of wet dog.  My wife wanted to leave when the smell got her, but we decided to play through the pain. Second the service was extremely slow this night. Dinner for 2 people took 2 hours. Our drink orders weren't taken until 15 minutes after we were seated. Another 15 before our food orders were taken and we sat with the dirty appetizer plates on our table for another 15-20 minutes. When they have larger parties in there, service to the smaller parties suffer.  I get it, the place was packed and it was a busy night, but I can't give 4 or 5 stars for service that slow, and the rugs need to be burned.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/g0jKZ9cuWc080ddhKuhNhw/348s.jpg", "caption": "Red Snapper (GET THIS, YOUR STOMACH WILL THANK YOU!!!)"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/oEA8dEUNjTnwWUgYsqBmig/168s.jpg", "caption": "Lychee Sangria"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/tUooSPHrDFETShtPmZq7_w/168s.jpg", "caption": "Passion fruit entremet"}]}}, {"review": {"des": "One of best noodle dishes i have ever had. Do not forget the tuna tartare. Great price points and Great atmosphere!", "pics": null}}]}