{"name": "lickity-split-frozen-custard-chicago", "reviews": [{"review": {"des": "Cute, fun, and oh my gosh the custard was so creamy I don't think I'll ever eat ice cream again!<br><br>Friendly people, cute decor and fun old-time candy items. So glad places like this still exist!", "pics": null}}, {"review": {"des": "This is a place where you can feel like a kid with the old fashioned candy aesthetic and sweet tasting custards and shakes! I have been here a few times and the best deal is the Crazy Cake Shake. Here are the steps:<br><br>1) Pick the cupcake of your choice that are in their display case..Triple chocolate delight, Red velvet, and Chocolate cookie dough are some that remember<br><br>2) Pick vanilla/Chocolate custard<br><br>3)Wait for the cupcake and custard be blended together<br><br>4)Enjoy an amazing cake shake<br><br>However, Lickity Split offers other custard mixers and shakes, along with scoops of ice cream. They only 3 flavors of custard- vanilla, chocolate, and the 3rd flavor be on rotation of a different fruit. This time was blueberry-which is pictured. Last time I was there was peach. So the mystery of the featured flavor draws you each time. <br><br>Great place for your family, sibling, and a date. 10/10", "pics": null}}, {"review": {"des": "Out of all the Frozen Custard shops I can honestly say this is one of my favorite spots. The staff is always so friendly and patient. The flavors are immense and they always make it easy to try something new or give a good recommendation. I've been back twice in the last two weeks<br><br>Strawberry Cheesecake. This one was amazing and full of flavor. The sweetness level was just right and had cheesecake bits broken along with strawberry flavored custard. I had the large size and was able to finish.<br><br>Pride. I don't remember the exact name for this one but it was for pride month. It had cake batter and sprinkles inside. I'd say this one was pretty sweet after the first few bites and I had a regular size and almost couldn't finish.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/_uNeCRhteErFeNtN1xBGAw/348s.jpg", "caption": "Strawberry Cheesecake (Large)"}]}}, {"review": {"des": "Just get the red velvet cupcake ice cream, see my picture, it says it all. Worth the calories.", "pics": null}}, {"review": {"des": "When the weather is warm and nice, cravings for ice cream! I had a wonderful SCARLET'S LAST FALL- red velvet cake topped with vanilla custard, marshmallow creme sauce, red raspberries and whipped cream. It's $6.50. <br>The ambience: great-cute, fun, amusing<br>The custard: great.<br>The price: high <br>The service: ok", "pics": null}}, {"review": {"des": "I had no idea that this treasure was here! So many treats to choose from! Chocolates and ice cream and so many other things I couldn't even take it all in! I went for a turtle sundae and it was such a wonderful way to spoil myself - completely worth it! We did have to wait in a line for our order, but on a warm evening hat is just part of the experience. I definitely plan to go back!", "pics": null}}, {"review": {"des": "I absolutely love this place! Best custard in Chicago. So glad that the Broadway location is open with regular hours during the winter because when you want Lickity Split, you get Lickity Split. <br><br>The seasons specials are the hot chocolate affectionado which was delicious! They also had cake batter custard as the special flavor.", "pics": null}}, {"review": {"des": "Such a cute, fun and happy store to be in. I have been eyeing this store for a hot min and planned to go there in the summer time but I thought to myself that is forever away. lol <br><br>Glad I finally checked it out. The customer services is great. They were very helpful in helping me choose. The menu options was actually very extensive for an ice cream shop which I found a bit overwhelming. But the service made up for it. I also liked all the music that played while I was in there... it was happy summer music which gave me the illusion it was summer and not the actual 26 degree weather it was. <br><br>The cost for the portion was great. I actually wished I went with a friend as I pretty much had to force myself to finish the sundae. <br><br>My only suggestion is to have them provide calorie estimates for their selections. Otherwise, everything was great.", "pics": null}}, {"review": {"des": "Came here a couple of weeks ago on a hot summer day after visiting a festival. This place almost reminds me of visiting the Plush Horse in my area. It's very cool and accommodating inside. The custard was definitely delicious. We even had no problem finding seats and it was very crowded. Will return in the near future.", "pics": null}}, {"review": {"des": "I'm so glad I don't live close to Lickety Split. <br><br>This place is incredible. It also reminds me a lot of Andy's in Evanston. They have similar menus and a keep it simple attitude when it comes to dessert.<br><br>The atmosphere is cute, retro, and fun. Nothing pretentious and just the right amount of kitsch. They have tons of old fashioned candies and chocolates. If you're not in the mood for custard, there is definitely something for you in the glass case full of chocolate. <br><br>I ordered the Thirsty Turtle sundae and it was to die for. It only comes in one size, which is pretty large, but hey, if I'm going to eat an ice cream sundae -- go big or go home. It was delicious.", "pics": null}}, {"review": {"des": "I love anything that makes me feel like a kid again, and this place is one of them! Very charming and brings back sweet nostalgia with their retro candies and vintage vibe. Many treats to choose from- frozen custard, sundaes, concretes, malts/shakes, chocolates, cupcakes, cookies, sodas and coffee. If you're with a date, forget about sharing. You will want your own.", "pics": null}}, {"review": {"des": "Charming, wonderful appealing old fashioned custard shop. Absolutely worth the wait if there's a line. They have vanilla, chocolate and a rotating flavor which when we visited was strawberry. <br><br>They also have an insane amount of toppings to choose from if you make your own creation. I went with the tasty turtle and was in heaven. The custard was creamy and rich in smooth flavor. The hot fudge and caramel were perfection and the salted pecans were sublime. <br><br>They also have loads of old fashioned candy to choose from. I picked up a zagnut and was nearly tempted by the fruit stripe gum. <br><br>This place is an absolute gem.", "pics": null}}, {"review": {"des": "I've only been to the actual location once! But me being the super fatty I am I order from their Uber eats religiously. The cool thing about this place is that they don't only offer Custerblends but they also have delicious fudge, cupcakes, and even candy as well. The interior was super retro and the staff that works there is super helpful!<br><br>The custard is your standard vanilla or chocolate and they usually have a rotating flavor as well(I'm basic and never shy away from the vanilla.) I usually end up getting the s'mores blend which is amazing with all of the marshmallow fluffiness that they put into it. Or since I'm a huge fan of mint I'll go with a grasshopper because man is it delicious. I need to stay away from places like this because it makes it easier for me to gain some love handles!", "pics": null}}, {"review": {"des": "Amazing frozen custard! Truly a gem in Edgewater. I tried the Scarlet's Last Fall and was blown away by how delicious it was. All my friends enjoyed their treats as well. I highly recommend checking this place out to satisfy your sweet tooth. I also heard they have doggy treats available here too!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/S4T8YKYA_n3olXmeSWgSbQ/348s.jpg", "caption": "Scarlet's Last Fall"}]}}, {"review": {"des": "No idea how I've never heard of this place even from my foodie friends... Lickity was definitely a great find, especially while wandering aimlessly through Broadway. I'm usually not the type who wait like 30 minutes especially for desserts, but I had plenty of spare time that Sunday night I visited. I was there around 9pm and the place was jam packed! The line went all the way back to the bathroom and I legit spent almost half an hour just gazing at their all-inclusive list of menu from milkshakes to sundaes. <br><br>After a tough decision, I went with OMG (yes, that's the name of the dessert) with vanilla custard, which was filled with fudge brownies, glazed with chocolate fudge, topped with a dash of peanut butter. It was incredibly tasty and surprisingly not too sweet. The combo of all those blended together really well, and I finished the whole medium sized serving in less than 10 minutes... No regrets waiting for this frozen custard and I'll definitely come back again to try the Mocha Madness!", "pics": null}}, {"review": {"des": "First, I would like to thank my Yelpers for guiding me to this place. It was a hot day in Chicago and I was craving ice cream and pulled up my Yelp to see what was nearby. Reviews seemed good and pictures appeared promising. We quickly headed over to waited in a semi long line inside, which we were not surprised. The line moved quickly and we were able to order in less than 10 minutes. There is only 1 registered, which is why there is a long line, but right after you order, they made it right away in under a minute! I went with the Peanut Butter Blowout Concrete because I love anything peanut butter, especially in ice cream. This was amazing. I devoured this with my wife in like 1 minute. Will definitely come back if I am around the area.", "pics": null}}, {"review": {"des": "The owner is a weirdo...<br>Really bad service when you're rude to your customers for apparently no reason", "pics": null}}, {"review": {"des": "I first went to Lickity Split years ago when working at Loyola. It quickly became my favorite custard spot in the city. The fact that I could mix in a cupcake into my custard was delightful. I usually don't do cold desserts in the winter but I make an exception here. Their OMG is my favorite. Peanut butter, fudge, and vanilla custard is mixed to pure joy. Going to Ethiopian Diamond for spicy food on a cold night followed by a stop here is one of my favorite traditions each year.", "pics": null}}, {"review": {"des": "This place is really fun! It's a sweet shop with all different variations of frozen custard. They don't have ice cream, but after spending a day at the beach, frozen custard definitely hit the spot. They also have every topping you could imagine. <br><br>You should know, this is a popular spot. When friends and I went there wasn't a long line, but I can see it getting packed during peak times.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/2FChrUFafqlQPShFzOTBUQ/348s.jpg", "caption": "Old timey soda pop for sale, with very interesting flavors"}]}}, {"review": {"des": "LOVE this place. Very throwback old timey wimey candy store on one side, with a bomb diggity glass display case full of awesome things like jumbo peanut butter cups and mint logs, and a custard shop and espresso bar on the other side. The line was out the DOOR when I pulled up 30 minutes before close, but the employees didn't shut the door and flip the sign to \"closed\" until 9:58, allowing everyone that had been in line to mill around inside.<br><br>There's tons of seating inside - alumnium chairs next to giant slats of wooden tables, painted seaside-cheer white - as well as a lot of wooden benches outside.<br><br>I got a scoop of their blueberry custard and a small of their Bing Crosberry concrete. The blueberry custard was prettier than it tasted (I wasn't a huge fan; it kinda tasted like soap, but my mom (a lavendar lover, so) LOVED it). But omg the Bing Crosberry is where IT IS AT. Vanilla custard + real cherries + real raspberries + cheesecake + crumbled up graham cracker crust - HOLY SHIT, it's fabulous. Get it get it get itttttt. (Prices were v reasonable; those two and a 12 oz. Americano cost less than $15.)<br><br>The ladies sitting next to us had root beer floats - giant cups of vanilla custard along with bottles of old school root beer, to top and mix to their heart's content - which I neeeed to try soon. <br><br>10/10 would recommend. It's vintage, it's a throwback, it's delicious, and it's got a real neighborhood feel to the whole joint which I am a huge fan of.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ThvJixNrDanGDe1-mAf6NQ/168s.jpg", "caption": "Bing Crosberry"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/fffwauvzEH42Z1YlQ_iLXw/168s.jpg", "caption": "Wall of candy and glass display of treats"}]}}, {"review": {"des": "This is by far the best ice cream shop we go to!! Right after eating tons of Ethiopian food we stop by the shop because it's RIGHT NEXT DOOR!! Also putting a cupcake into a concrete changed my life and I can never go back!!! Will continue coming back and bringing friends from outside the city to check it out.", "pics": null}}, {"review": {"des": "Came in for a standard chocolate shake on a day that wasn't great. Phenomenal staff. Phenomenal service.  Thank you", "pics": null}}, {"review": {"des": "This is one of my favorite local dessert shops! It's so cute inside, the front window is style like and old general/candy shop. They have many unique candies if you have a sweet tooth, but my favorite snack is their custard concrete. They have a nice selection of toppings. I rarely get a pastry, but the brownie Al la mode is great on a warm spring day! They also have some unique brands of soda if you're looking to try something new.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/yYjvcrIcpbTw1b0ozkEwPw/348s.jpg", "caption": "Art on the walls."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/KsY-D2atyvY2HrjVx_Pfrg/168s.jpg", "caption": "Unique candy found."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/I_B8Cozuh71uIwXuHZnt_Q/168s.jpg", "caption": "Red velvet sundae."}]}}, {"review": {"des": "Meh. It was ok. I had the OMG and she had a small chocolate cone. It wasn't expensive, and the decor was cool. They had a lot of old school candy and soft drinks in glass bottles.", "pics": null}}, {"review": {"des": "I love the custard here! The price isn't high, the topping options are abundant, and the quality of the custard is very high! You'll love this place & it's really hard to go wrong with anything you get here, custard or milkshake wise.", "pics": null}}, {"review": {"des": "What a fabulous frozen frozen custard spot within walking distance to Loyola's lakeshore campus! I like the vanilla custard and ask for some cookie dough thrown in. The flavors and toppings are pretty basic but delicious. I didn't have a fun place like this when I was going to Loyola, but now that my sister is going there we like to come here to catch up and relax. I think this place definitely has that classic \"malt shop\" feel. Bonus points for having a huge poster of Mickey Rooney and Judy Garland hanging up, depicting them at the soda fountain--one of my favorite promotional shots of them.", "pics": null}}, {"review": {"des": "As a Chicago native I can't believe it's taken me this long to try Lickity Split.  On a Sunday night the line was out the door but we waited!  I had vanilla with pretzel, peanut butter and Oreos and it was amazing.  I wouldn't recommend the pretzels unless you plan to eat it in one sitting as the next day they were a bit soft.  Will definitely be back!!", "pics": null}}, {"review": {"des": "I used to love it here. I was there today in line for almost an hour and 1 cashier open. There was a woman who cut in front of me and kept on touching me and smiled at me. She also kept on staring at me. The jerk being me didn't stick up for me and she was not handicap she was just plain white bitch. The place has lost me as a customer service too slow, 1 cashier, and customers push, shove and touch u to cut in front of you.", "pics": null}}, {"review": {"des": "Lickity Split is one of the few ice cream shops that still has a steady stream of customers no matter the weather. I visited the shop yesterday and it was in the single digits! I've literally seen people hop out of their cars just to rush into the ice cream shop before it closed at 11pm. 21<br><br>Lickity Split has a way of taking you back to your favorite childhood memory from the moment you walk into the ice cream shop. They have very kind of candy that you can think of in the multiple candy jars and boxes of candy near the entrance. Lickity Split also offers a random assortment of flavored sodas which can range from delicious sounding to gag worthy, i.e. hot wings flavored soda.<br><br>During my first visit, my boyfriend recommended that I try the drum stick concrete. It was hands the most delicious custard that I've ever had. They combine a crushed up sugar cone, peanuts, hot caramel, and chocolate syrup together to make the most delicious treat you'll ever eat. <br><br>I would highly recommend visiting Lickity Split at least once if you've never been. Its delicious no matter what time of year you go!", "pics": null}}, {"review": {"des": "It's been a while since I hiked up here and tonight I had other things to do in the area... so, I just had to have some more Lickity Split!<br><br>This time I got a \"Scarlet's Last Fall\" which is a red velvet cupcake (sans frosting, as far as I can tell) covered in vanilla custard, coated in marshmallow creme sauce and normally it's sprinkled with raspberries (but I don't care for them, so I got tart cherries as a substitute) topped with the prerequisite whipped cream and maraschino cherry.  I thought it was perfectly delightful.  <br><br>The place itself was more crowded than I'd ever seen it.  So, apparently I wasn't the only person needing some frozen comfort tonight!", "pics": null}}, {"review": {"des": "Wow - the collection of both penny candy and long forgotten candy bars!!<br>Then there is the soft serve ice cream - we root beer and peach. Super yum!!!", "pics": null}}, {"review": {"des": "Came here from a suggestion from a patron at Tank Noodle. <br>Parking might be difficult to find but I was able to snag the one (and only) parking spot right out front. <br>The queue was massive and it cornered round and round like a snake. At this point, my fingers were crossed that the hype was worth it. <br>At the register, I ordered the Scarlett sundae (not the exact name but it has your choice of custard, red velvet cake, marshmallow fluff and raspberry). <br>IN LOVE WITH IT. Red velvet was perfectly soft (moist) and paired well with the raspberries and creamy (vanilla) custard. My only gripe is that the marshmallow was way too sweet for my palette (Jeni's ice cream is too sweet for me if that's a helpful reference). I'll be back but order sans marshmallow fluff and extra raspberries!", "pics": null}}, {"review": {"des": "LSFC Review #400.   Yay!<br><br>I've had Lickity Split Frozen Custard on my bookmark bucket list for a while now.   Even though I gone next door to Ethiopian Diamond several times over the years, it's always either been too late in evening to go or I was so full from ED that I had no room to even entertain the thought of going to Lickity Split.<br><br>I told myself next time I go to ED, I'm going to make an effort to stop at LSFC afterwards.   That time came on a cool November afternoon.   I was motivated to revisit Ethiopian Diamond after a less than stellar Ethiopian restaurant experience in Las Vegas.    Of course my intention was to eat a little less at ED but somehow that didn't pan out.    So to burn off some space we first stopped at a vintage store down the block and then walked several more blocks before stopping at LS.<br><br>So we finally get to the main event.   We walked into LSFC and was greeted by displays of various sweets.   It did have that sweet shoppe diner feel to the place.    Our server was very friendly to D and I and was patient in explaining the offerings.   In the end we both decided to go for the frozen custard sundaes which included as standard ingredients peanuts, whip cream, and a cherry.<br><br>We parked it on a couple stools near the window and waited patiently for our Sundaes, D's being a chocolate fudge one and mine a pumpkin one with the addition of heath bar.   So rich.  So yummy.   So tasty.    The other dessert options on display looked so tempting as well but we resisted.   I definitely need to make my way back here.   It was worth the wait.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/yYVbNDe_yOgq2ZaiUzCbdQ/348s.jpg", "caption": "Pumpkin heath and chocolate fudge sundaes.   Yum."}]}}, {"review": {"des": "Truly the best frozen custard in the city period !! I've been meaning to yelp this place for a while now!  Custard is always perfect , the flavors are spot on and the service is so freaking friendly ! They also have a huge candy section , cakes and cupcakes !! Thank you Lickity Split for serving custard that doesn't melt as soon as you bring it to your table , unlike that other frozen custard place on Belmont and Paulina ... you know who I'm talking about folks !!  Nothing , I mean nothing beats this custard !!!!!!!", "pics": null}}, {"review": {"des": "Really good frozen custard. A bit firmer than Scooter's or Culver's. Peanut Butter Blowout was great. OMG with chocolate was a bit much, would be better with chocolate vanilla mix next time.", "pics": null}}, {"review": {"des": "Frozen custard is an awesome treat whether it's 85 degrees outside or 58 degrees. This place has scoops of frozen custard, shakes, sundaes, concretes, candy and even treats for your dog. There really is an option for everybody. <br><br>When I came, I knew I wanted a concrete, but with so many mix in options, it was hard to decide which one. Ultimately, I choose the coffee butter crunch and was mostly pleased with it. The concrete was not lacking in ingredients and had good potential. <br><br>One of my criticisms about Lickity Split is that their prices are higher compared to most (not all) other frozen custard places in the city/suburbs. I also wasn't impressed with the quality of the custard/freshness of it on the evening I was there. I've had better frozen custard at other places and this wasn't much of a step up from Culver's. I personally don't know if I would come back, but I wouldn't discourage others from trying this place out because there might be better menu options. I also hope that the freshness of the custard is better earlier in the day when they first open, vs. 8pm when I was there.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/56UBVf_dL_X_JDxGqJRGDw/348s.jpg", "caption": "Coffee butter crunch"}]}}, {"review": {"des": "I have never been here, and have nothing to add except, I think I will have to go here in honor of my current favorite TV Series, Ozark. Lickity Split is a great name for a Frozen Custard place and a strip joint/gentlemen's club. If for no other reason, this is the reason that I gotta give them a try.", "pics": null}}, {"review": {"des": "I love good custard! They have good custard but I wish they would have more than 3 flavors. Sometimes they'll run out of flavors quickly. <br><br>Their sundaes are classic and really hits the spot on a hot day. I love that they sell international candies that are not so easy to come by.  I love the rustic decor! Not as many seats/tables and the line can get really long so expect the eat outside.", "pics": null}}, {"review": {"des": "Tasty, indulgent, rich soft-serve ice-cream like desserts. They always have chocolate and vanilla and then two seasonal or guest flavors. I didn't grow up with frozen custard but it's tasty. You pick flavors, candy and even whole cupcakes to blend in with your dessert. I am a fan of chocolate custard with peanut butter swirl and peanut butter cups. This is an adorable neighborhood spot, with friendly service, and a nice \"old time candy\" atmosphere.", "pics": null}}, {"review": {"des": "I am officially a fan of frozen custard!!!!!!!! Seriously so so so good. I thought I might be disappointed and it would taste exactly like frozen yogurt or like that Costco soft serve, but this is definitely better than that. I got a sundae with vanilla and chocolate soft serve plus Carmel sauce. I'm tempted to place a second order for the cupcake concrete but I'll show some self control I suppose....", "pics": null}}, {"review": {"des": "Thanks to my Pastor's Rich, and Dori from New Story Church, i had to try Lickity Split. I drove pass Lickity Split quite a few times; never stopped in, but always wanted to. During a table set up at Swift Elementary as part of Pivot Arts Festival, that was my opportunity to try Lickity ice cream, and of course i loved it. Made me a happy camper, and the employee in the picture was very sweet. Im officially sold, and now a new customer of Lickity Split.<br><br>Enjoy!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/A7JpQnGczLGTBtN12QqXnA/168s.jpg", "caption": "PB & Fudge Sundae"}]}}, {"review": {"des": "I actually very much enjoy the actual establishment and all of the candy it has to offer. I wish I could say the same about the custard. I have only been twice and perhaps It is my ordering that has me disappointed. The first time I went I got a concrete with vanilla custard, fudge brownies and hot caramel. I was disappointed with the lack of ingredients and the amount of spoonfuls of plain vanilla custard. I gave It a second chance and got chocolate custard instead, again with the fudge brownie and hot caramel.  They got my order wrong and put hot fudge instead of caramel which was very disappointing. Also, the brownies were very stale tasting.  Both times I have thrown out my concretes without finishing. Very disappointing.", "pics": null}}, {"review": {"des": "This place is right by campus, which is kind of dangerous because I end up coming here quite a bit. The frozen custard here is SUPERB. the choices are either vanilla, chocolate, and the given seasonal flavor. There are concretes, regular scoops, shakes--you name it!!! I love doing the make your own concrete because I can choose my own flavor of custard along with your own toppings. The place itself is adorable and scenic, with vintage photos & decorations everywhere. There are cute little knick knacks to buy as well. This is a great place to hang out with friends, and it is never too cold for Lickity Split, so I will still venture out in this winter weather for it!!!! If you are ever in Rogers Park, it is a MUST. It's an extremely popular place, especially on weekends, so there may be a bit of a line.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/yI3D0U8_Yk_byFGNEdiqKg/348s.jpg", "caption": "vanilla custard with cookie dough vanilla custard with chocolate sauce and caramel"}]}}, {"review": {"des": "All I've been hearing from co-workers and clients at work is, \"oh my gosh, Lickity Split is so good\" or \"have you tried Lickity Split?\" or \"you need to go to Lickity Split\".  Okay, okay - I get it, Lickity Split is the bomb diggity...they weren't lying though.  Lickity Split really is something special.  I walked into Lickity Split and immediately I wanted to start singing \"you ain't got that jazz if you don't have that swing\" while doing a little hop, skip and a jump.  They just have the good ole vibe going for them and I love that!  <br><br>Obviously, they have the decor set up just right but what about the sweets and treats?  Oh they're on the top of their games with those too.  Lickity Split has baked goods ranging from brownies and cupcakes to full blown cakes.  But then you look to your left and they have a whole bouquet - a very, very large bouquet - of every candy you could dream of.  Then you look to your right and you see custard galore...can a girl ask for more?  <br><br>My partner in crime that day ordered a Dark Cherry Fudge Brownie which she couldn't get enough of and I settled on the Crazy Cake concrete - I was able to choose my own flavor custard and flavor cupcake (which they mix in with the custard).  The result was crazy...crazy delicious.  When I was in high school I had the ingenious idea to mix birthday cake and ice cream together, but this was 100x better than that (and it was still pretty damn good in high school).  I would love to go back and try some of their other concretes or even make my own, but for now I'm gonna cool it on the calories.<br><br>Besides the food which is obviously the main reason people come here, it seems to be a great gathering spot for families or for people on dates...there's also plenty of seating for all the patrons so that's a great bonus.  What els is a great bonus?  The fact that you can have coffee or espresso while you smother your face in custard.  Yes, they serve espresso and if you're not a fan of that they have a  complimentary water jug that you can use to wash down all those sweets.<br><br>I'll be back in no time...or in other words, I'll be back in lickity split.  See what I did there???", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/NilpNGJoTnptlsDUxUi_Zg/348s.jpg", "caption": "Root beer float...so good"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/rgJ7K3onnrIgOztTwC5YYQ/168s.jpg", "caption": "Crazy cake concrete"}]}}, {"review": {"des": "This is my go to place year round for frozen custard treats! The concretes are delicious and I always get double m&m's in vanilla. There is always vanilla and chocolate custard available but the third flavor changes each week and while I still get what I always do, the free samples of the third flavor are always tasty.", "pics": null}}, {"review": {"des": "My rating for Lickity Split is 100% based on two things:<br><br>1) Its uber adorable atmosphere.<br>2) Its Crazy Cake concrete.<br><br>The Atmosphere: The wall is lined with cute glass jars filled with chocolates for sale, nostalgia-heavy candy on display in the front corner and the glass cases are filled with delicious delights such as cupcakes and seasonally themed frosted sugar cookies.  The entire place has an old timey vibe that is sure to bring a smile to your face. <br><br>The Crazy Cake!: I'm crazy about the Crazy Cake!  You choose your custard flavor (I'm a vanilla gal) and then choose one of the cupcakes in the glass case (when available the oreo cupcake is a solid choice).  Now, here's the kicker: They take the ENTIRE cupcake and mix it up into the custard to create the most amazing concrete you'll ever have.", "pics": null}}, {"review": {"des": "They have a wide variety of toppings which is nice. You can get the ice cream in many different forms: sundae, milkshake, and concrete. <br><br>I lvoe this place but the lines are always long and it basically is really confusing. You don't know where the line starts when you come in. Also there is very limited seating which is hard when there's nothing nearby to go sit at.", "pics": null}}, {"review": {"des": "Came here for dessert after dinner with a friend. It was nice to see customers sitting outside on the bench enjoying their frozen custard. There was a line inside, the wait wasn't too long.", "pics": null}}, {"review": {"des": "If you are looking for the old malt shop with Archie, Veronica (the pretty one,) Betty and Jughead, you might find them here in the summer. It was hot and sunny outside and inside was some kids enjoying malts. They have 3 kinds of custard each day. Today's special was blueberry. It was verry blue berry and I liked it. They have pastries a plenty and some boxed stuff by the counter like ginger candy. The kids were well behaved . I spoke with a grandmother and she was pleased with it too so it is not just your chubby buddy here. I had one scoop, no cone, no pastry and no boxed treats. I hate being fat but love food and this is a place I can only rarely go as it is tempting.", "pics": null}}, {"review": {"des": "We came here for dessert after Ethiopian dinner at nearby Ras Dashen. The chocolate Oreo cookie vanilla and Mocha Madness custards were delicious. I especially loved the sea salt caramel chocolates and peanut butter ritz chocolate. The caramel cashew chocolate patty is mind blowing amazing!!!", "pics": null}}, {"review": {"des": "First time trying frozen custard ... today was a great day for this treat too! First day in the 80's and this was great!", "pics": null}}, {"review": {"des": "lickity split frozen custard has all the charm of an old school ice cream parlor and pumps out spectacular, non pretentious frozen custard and delicious sounding concretes and sundaes. when i passed by lickity split, i just ordered up a chocolate and vanilla scoop as all the concretes just sounded a little too heavy at the time. however, the chocolate and vanilla scoops, despite sounding plain, were luxurious, smooth, and creamy and just had such a clean milky taste that is uncomparable to any popular ice cream brand. the custard itself was so thick and fulfilling, and the vanilla and chocolate flavors tasted very natural. lickity split makes out of this world custard, and i can for sure see it becoming a summer regular for me :)", "pics": null}}, {"review": {"des": "Started exploring areas close by and was recommended to try this place by a friend.  Just one warning.... they are good, so expect a line.  On the other hand, they have great people working there and the line does move quickly.<br><br>Good product, lots of choices.  Nice area in which to hang out in.  Only one suggestion.  Maybe have a print out of the menu (which is on the wall in the back) at the front giving people an easier way to see what is offered before getting all the way to the front of the line where they can read the board more easily.<br><br>My stomach is still 12 years old, but my eyes match my age.  Boo.", "pics": null}}, {"review": {"des": "Tried this for the first time today! Super cute inside, great custard! I had peach custard with dark chocolate chips and it was heavenly! Highly recommend if you are in the Edgewater area looking for a sweet treat! Has a historic feel with a modern twist.", "pics": null}}, {"review": {"des": "This place is adorable! They serve up the best custard, from behind a counter full of retro candy, homemade chocolates, locally made cupcakes and cookies, and quirky sodas. If you are ever hankering for a birch beer in the city, stop in here.<br><br>I've been a regular at Lickity Split for a few years now, as has most of the neighborhood from what I can tell. There is often a line out the door around closing in the summer, but it moves really fast.<br><br>As far as the custard goes, they have chocolate, vanilla, and a rotating third flavor (which is generally something awesome). For those unfamiliar, their concretes are the equivalent of a DQ blizzard. I have yet to go wrong with choosing the concrete recipe they have on special using the rotating flavor. <br><br>They do really good seasonal flavors in the winter. Last year around the holidays they did an apple pie concrete and a pumpkin pie concrete. Each had a small slice of pie mixed in with the custard and was well worth venturing out in a Chicago winter to eat ice cream.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/97Bo9tEyBQFJB44X0dO_Wg/348s.jpg", "caption": "Birthday cake concrete"}]}}, {"review": {"des": "OMG with vanilla<br>Mint with chocolate<br>Both were awesome.  Absolutely no complaint.<br><br>Selection of candy brought back so many childhood memories.<br><br>Cute environment.", "pics": null}}, {"review": {"des": "The service is helpful, inviting, and sweet. They offer samples to try their custard. Customer service is on point.<br><br>Interior is just like a candy shop. Lots of candy, custard, cupcakes, chocolate. I probably can feel the diabetes running through my bloodstream just walking in there.<br><br>Custard is rich, flavorful, and creamy. It is better than any ice cream I have ever had.", "pics": null}}, {"review": {"des": "This is such a cute little place and I love the vintage feel of it! There are a bunch of old school candies, toys, and beverages to purchase. I love the chocolate custard so much and the customer service is phenomenal. I feel so respected and my order is always ready very quickly. I like how you are able to see the custard being made by the machine and I really like the decorations inside. This is so convenient for me because it's right by School and it's a perfect after school treat(obviously not daily but it could be)", "pics": null}}, {"review": {"des": "Best custard ever! A notch better than Culver's. We got two scoops of vanilla in a waffle cone with cheesecake bites toppings and the Scarlette's Last Tale (i.e. red velvet sundae w/raspberries). <br><br>This reminded us of the little soda shop down in Galena, Il. This place has the magical ability to wisk you away to a charming small town. Everyone was nice and friendly - I mean the place has an American flag on the wall and Judy Garland sipping a soda-pop. It's worth a special trip. Enjoy!!!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/i_dKs5qLdrrwmnMnqUNIug/348s.jpg", "caption": "Two scoops of vanilla in a waffle cone and the red velvet sundae. Yum!"}]}}, {"review": {"des": "After eating a giant meal at the BBQ joint a few doors down. My pregnant self couldn't help but to stop in for a \"small\" dessert. Best decision EVER! My husband grew up in this area and he was telling me how Lickity Split used to be his local Baskin Robbins where he would walk to. That old Baskin Robbins died and reimurged into a beautiful creation which is Lickity Split. <br><br>The place is has an old fashioned ice cream parlor decor with some modern twists. There is a wall along the counter with specialty sodas flavored in the regular and bizarre flavors. My bizarre I mean: bacon, buffalo wing, red hot, etc. They use custard as the base which makes for an extra rich treat. Not for the faint of heart. I got myself the nutella and chocolate custard. They used the vanilla base with mixins to make other flavors too like my husband's favorite, birthday cupcake. The people who work there are great at helping you create a flavor that would work best for you and lots of custard creations they can do are also on the menu board. <br><br>They also sell candy to add to the old retro look. Very clean and with seating for 15 or so. Prices weren't bad. A perfect treat for the summer heat! Can't wait to get back here.", "pics": null}}, {"review": {"des": "I'd like to start my review by stating that I'm lactose-intolerance & have a mild allergy towards daily products.<br><br>Now then, having said that, I both love & hate Lickity Split because of its superbly delicious custard, yet it's so addictive that I can't stop myself from craving it every now & then even though it's not good for my body.  T~T<br><br>So in any event, for those lucky enough to not be afflicted with this same ill-fated condition, I'd highly recommend going to Lickity Split for your ice cream / custard-craving needs.  You'll only be doing yourself a disservice if you don't try out this ice cream store at least once.", "pics": null}}, {"review": {"des": "I literally cannot resist this place. I'm not a huge sweet-tooth, but this place is definitely my sweet spot. We got a Kit Kat Vanilla shake and Cheescake and Pecan custard delivered by UberEats yesterday (being lazy AF), and OMG.<br><br>That BYO Cheesecake and Pecan vanilla custard was the best thing I've ever had, hands down!", "pics": null}}, {"review": {"des": "I got the malt custard with malt balls! Absolutely loved it!! It's so creamy and not all sweet or overpowering. There always a line when you go there but it's worth standing in line for. I've been here three times and I stood in line all three times but the line always moves fast. I plan on going again very soon! Loved it!!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/S8aKjS34emrmn31cm5BBsA/348s.jpg", "caption": "Malt concrete with malt balls"}]}}, {"review": {"des": "They have everything to satisfy your sweet tooth. Candy, Chocolates, Ice Cream and Cookies. Ask for a sample of the daily special flavor. Many old school candies and soda on hand to give you a nostalgic feeling of a soda fountain. Fun place for the whole family. Not many places to sit inside. It was cold when I went there so everyone was huddled inside eating ice cream.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/_6y69Z57JyfjpNawrZWKNg/168s.jpg", "caption": "Candy selection"}]}}, {"review": {"des": "I went here with the wife and her 16 y/o nephew and a friend of his. I was not impressed, but the custard was okay.  I ordered a chocolate shake and made the mistake of having coconut put in it.  The menu encourages people to order a shake with one topping added at no additional cost.   The problem is that the topping I got did not break down very well.   I shouldn't have ordered coconut with the shake as every mouthful required me to chew pieces of coconut.  <br><br>The nephew ordered a root beer float that was truly delicious.  I recommend it to anyone.  <br><br>The wife had a chocolate malt that she said was good.  Overall this place is good, but not outstanding.  If I have 16 year old kids in my charge again, I might return.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/xvG1H1NA2oY7ApbCJuZQbw/168s.jpg", "caption": "Choc shake with coconut"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/EGFhJFlB-wZFIMsX1td-6w/168s.jpg", "caption": "Shake"}]}}, {"review": {"des": "Clerk: \"Sorry. We're out of raspberries.\"<br><br>Me: \"There's a Whole Foods across the street. They have raspberries.\"<br><br>She really didn't know what to say to the mean old man who challenged her manager's decision not to send someone across the street for raspberries. <br><br>I could have been more understanding. Or they could have gotten some raspberries. It was a draw. <br><br>Go on a day when they have stuff. The Bing Crosberry concrete is heaven on Earth.", "pics": null}}, {"review": {"des": "There are sooo many things to choose from!! The menu has endless possibilities ! but I kept it simple and had the vanilla frozen custard and chocolate chip cookie . It was splendid !!! the customer service is awesome ! <br>the funniest thing about this place is that it is right across from the la fitness .", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/JNQBU9Hxu3P4nCGFctU1QA/168s.jpg", "caption": "Old school candies"}]}}, {"review": {"des": "This place is fun and nostalgic, but pretty pricey. The ice cream is great, rich and flavorful. The service is decent, and bathrooms are well kept despite heavy traffic. The decor and general ambiance are delightful and entertaining.", "pics": null}}, {"review": {"des": "Great selection of toppings and sweets and custard is amazing! Plenty of seating and cozy ice cream shop atmosphere. I got Scarlett's last fall which I recommend!!", "pics": null}}, {"review": {"des": "I don't know about the ice cream but the peanut butter cups? I walk 45 min to get here to buy them! Yum!", "pics": null}}, {"review": {"des": "This is where you go for sweets, but beware, be prepared to stand in a 20 minute line so that the staff can take their time joking around and treating their shift as the easy-going summer job that it is. You, as a customer, are not a priority.  But the custard is excellent. It's one of those situations where you'll put up with nonsense to get something yummy because we are all gluttons on the weekend, and lazy high schoolers and management don't care about your time.", "pics": null}}, {"review": {"des": "One of my favorite spots, even when it's cold outside! It's not the cheapest spot, but it's definitely comparable to all other ice cream/dessert shops in the city. There are lots of options if you want something small/inexpensive, or something other than frozen custard.", "pics": null}}, {"review": {"des": "I have driven by Lickity Split for the longest time.  When I really wanted ice cream in Summer, there is an almost constant line to get in here.  It's packed!  Luckily, it's January, cold and empty.  So, I happened to be with a friend shopping in the area and decided to stop in.<br><br>Wonderful!  Fabulous! Cozy and original ice cream parlor that is exceptional through and through.  Creatively designed and put together with my favorite late, greats Judy Garland, Mickey Rooney and Bette Davis enhancing this lovely space.  LOVE IT!<br><br>My sundae was to die for.  The ice cream was top quality and came with all the trimmings. I felt so nostalgic as it brought me back to years gone by.  <br><br>I definitely will return!  Ukrainian Village needs a Lickity Split on Chicago Ave! <br><br>Loved my experience at Lickity Split Frozen Custard<br><br>*****", "pics": null}}, {"review": {"des": "Delicious, fun, with old fashioned undertones. You can get a custard concrete and add any topping you can think of. Also have a bunch of candy and pastries. Cute, friendly place.", "pics": null}}, {"review": {"des": "After years of friends telling me about how good Lickety Split is, I finally got my sweet treat on.  And let me tell you something, Lickety Split is amazing.  Hands down the best concrete I have had in Chicago, and in the top three I have had in my life.  The damn custard is round in the mouth, not too sweet, so smooth, I was not able to stop eating despite being in real physical danger of exploding.<br><br>My girlfriend got cheesecake ground up into concrete, Jimmy Hoffa-style. It had semi sweet cream cheese custard, berries and crumble, very refreshing.  My big male friend got a petit looking red velvet cake sundae, with raspberries and vanilla custard, the quality of the red velvet cake brought it all together.  I bought 2 peanut butter cookies (rich, salty, soft) for a midnight snack as well as a corn cob and black rooster sugar cookie for the next day.  Excellent, excellent (rubbing hands together, Mr. Burns-style).<br><br>For my sweet treat, I got the Peanut Butter Blowout.  I was in a custard trance for the first 3 quarters of eating it, and then I realized I was about to blow out.  I continued to nibble all the way until I had one or two little bites left, and then I had to stop (all this after an epic feast of Chicago-style thin crust pizza) and let the sweats take over.  Let me just say this: if I was Mr. Lickety Split (and I'm not) I would not put Butterfingers in the Peanut Butter Blowout.<br><br>Butterfingers is not peanut butter, but that's just like my opinion, man.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/wNODQSWHeKZYIFWKG02dhA/348s.jpg", "caption": "red Velvet sundae"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/gTDQlRG9iqtPk0JYcJXOwg/168s.jpg", "caption": "peanut butter blowout- the \"problem\" I had is that butterfingers is not peanut butter"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/OlnLFbrz3en0kWzsd_g1ug/168s.jpg", "caption": "rounded corner"}]}}, {"review": {"des": "I ADORE this place. Every sort of classic sweet imaginable! I always go in for custard and a baggie of salted caramels. I also get a mixed box of the cupcakes for my room mates when I fee like spoiling them. Always clean! Always friendly. Always fast! Usually always busy too but that just means it is a great place to be!", "pics": null}}, {"review": {"des": "Went on a Sunday evening for frozen custard. Was a busy place. Prices are way to high for amount of custard we ordered for our sundaes. Was not impressed but if your looking for nostalgia candy than you might enjoy it.", "pics": null}}, {"review": {"des": "The ice cream was really good, but my friend left her number for an employee and he never texted her. Probably won't go back for that reason, but might go back for ice cream", "pics": null}}, {"review": {"des": "I stopped by Lickity Split somewhat randomly after having dinner nearby with a friend. The interior had a somewhat old-fashioned candy store feel, which was kind of cool and nostalgic. I got a simple order of a small scoop of the chocolate frozen custard on a cone. The only other frozen custard that I have had was at Andy's and I would have to say that Andy's frozen custard is a bit richer and thicker (this can be good or bad depending on your taste buds). For me, the flavor of the frozen custard at Lickity Split was not as strong as I would have liked, but my order definitely satisfied my craving for sweets for the day.", "pics": null}}, {"review": {"des": "The frozen custard is a hit. A little bit of chocolate, a little bit of vanilla, some hot fudge, and some caramel on top. I was totally digging that scene.<br><br>And then there was the salted caramel cupcake. Hmm. Maybe I had eaten too much already and was going overboard. There was a hint of very moist cornbread with caramel in the filling. All good, but there was the \"still\" factor.<br><br>But I see another bowl or cone of that frozen yogurt in my future. I'll be at Lickity Split for that instead of waiting in long lines at Oberweiz and Cold Stone.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/_rsx2Dtwy6xkGQktdnAXXQ/348s.jpg", "caption": "Banana Split"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/dOi6-8Zs7QJBh2LojMdEoQ/168s.jpg", "caption": "Chocolate and Vanilla with Hot Fudge and Caramel"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/YJx7y3WHL7tCWIaYrbnzAw/168s.jpg", "caption": "Salted Caramel Cupcake"}]}}, {"review": {"des": "Another shop that lives up to the hype. I always get the peanut butter blowout half vanilla half chocolate custard with brownie bits instead of butterfingers. Sweet. Creamy. Delicious. And this place has the cutest little vibe inside. Love this place.", "pics": null}}, {"review": {"des": "I am not exactly sure what took me so long to check this place out seeing as how I am a big sweets girl.<br>Needless to say, I am glad that I finally had the opportunity to try this custardy goodness!<br><br>My first visit, I decided to try a My Way concrete with chocolate custard and cheesecake bites. <br>I love having something to munch on with my ice cream and I love cheesecake so why not?  <br>Let me tell you. .. this custard is the moat creamiest custard I've ever had! The chocolate and cheesecake bites were just amazing and I immediately knew I had to come back ASAP.<br><br>After a week (I know ) I came back and had a My Way Sundae with, again, chocolate custard,  cheesecake bites,  crushed peanuts,  whipped cream and a cherry. ..<br>Again , the same experience from my first visit repeated itself and I found myself in custard heaven once again. ..<br><br>Overall, if you have not tried this place out yet and want to find a cute place for your sweet cravings, this is most definitely the place to go to!!!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/FNmWG-O6YGl7gtzW6eLGFA/348s.jpg", "caption": "My Way Concrete with chocolate custard and cheesecake bites... LOVE!"}]}}, {"review": {"des": "this is the cutest vintage-ish ice cream place I've ever seen! they have loads of candy and desserts. the cake batter custard is delicious! very friendly service. 10/10 experience", "pics": null}}, {"review": {"des": "Lickety Split is what I imagine entering into a Willy Wonka store would feel like but with lots of frozen custard. The daily special was peanut butter frozen custard - delicious, and I got it mixed up with an Oreo cupcake and hot fudge. So good. So rich. Could not finish my junior-sized Crazy Cake even though it tasted delicious.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/bFyAGGNqPHWMJmNfDfbkaw/348s.jpg", "caption": "Vanilla custard affogato w/caramel sauce"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/M5ugixMbCZyUN-3-x4OnOA/168s.jpg", "caption": "Peanut butter frozen custard junior crazy cake with oreo cupcake, hot fudge, and whipped cream - om nom nom"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/OHtk3w13YHjaJmgpwQir0Q/168s.jpg", "caption": "A magical place"}]}}, {"review": {"des": "My brother and I got custard here tonight as they were closing. We'd walked three blocks south on Broadway when we heard someone yelling his name. It was the guy working at Lickity Split, running full speed to catch us because my brother forgot his credit card at the register. He really went above and beyond! And last time I was in, a young woman working there asked me to taste the shake she made because she was afraid she put too much milk in it. <br><br>The custard is delicious, the space is welcoming, and the employees are friendly and competent -- you can tell they take pride in their jobs.", "pics": null}}, {"review": {"des": "Charming , friendly service, frozen custard is yummo!. Vintage candy is fun too!  A happy place.", "pics": null}}, {"review": {"des": "This is our favorite place for a treat. They serve amazing hand made frozen custard in all sorts of fun flavors. The flavor of the week changes, well weekly. ;)  And they usually always have chocolate and vanilla which are also devine.  Then you can mix it up with a bazillion different delicious, mouth watering toppings. They also serve cupcakes and cookies, along with fun sodas and a large variety of candy you don't find anywhere else. Many of the candy choices bring me back to growing up and going to the candy shop in our small town. <br>The service is always top notch, kind, friendly and prompt.  A+  <br>Visit it today- and then go again and again cause you won't be able to get enough of this place. :)", "pics": null}}, {"review": {"des": "Come for the frozen custard, stay for the unique concretes! There's a bevy of quirky root beer flavors, baked goods, and candy. I found the candy to be a hit or a miss and minuscule, but that shouldn't stop you for checking this place out!", "pics": null}}, {"review": {"des": "This was a step back in time to my days spent at the ice cream parlor when I was a kid. The atmosphere was a time warp, with old time candy here and there and service that was to match what used to be done - when caring about customers was what you did because they were your neighbors and friends. AND the custard was great! Hubby got old time sodas from when he was a kid - that was back around the dinosaurs - they had soda back then you know. This is a must stop for any kid, old ones, and new ones.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/cRW3cBzbRg1yJkK8ZAVIyg/168s.jpg", "caption": "A memory"}]}}, {"review": {"des": "A fabulous neighborhood spot. Friendly staff, a cute vibe. The custard is delicious!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/b2uFDU-ZMJZGT91wfNr7Gw/348s.jpg", "caption": "Strawberry Sunday"}]}}, {"review": {"des": "They have an amazing collection of old school candy that you just never see any where. Awesome custard and concrete. This is a place everyone must come on a summer night to hang out", "pics": null}}, {"review": {"des": "THE BEST custard on the North Side, hands down! You can choose between vanilla, chocolate, and a limited special which is usually a fruity flavor. My go to is chocolate with cookie dough mixed in and it's amazing!! It's true creamy custard that will make you incredibly happy. They even have an option where you can put an entire cupcake in the middle of your concrete. Everyone I know that has gotten that has raved about it. In addition to custard, shakes, sundaes, etc., they have a large selection of candies and sweets. There are some candies that you can't find elsewhere that will remind you of your childhood. Prices are very reasonable considering the sheer deliciousness of their products. The customer service is always friendly. As with any frozen treat place, lines can get incredibly long when the weather is nice. The place doesn't have too much seating so plan accordingly. I highly recommend Lickity Split to anyone with taste buds.", "pics": null}}, {"review": {"des": "I have had this place bookmarked for quite some time and my husband and I finally decided to go after having a burger at Moody's. This place is so cute inside-definitely like an old fashioned ice cream shop complete with candy, homemade chocolate, and different kinds of bottled pop. I had the strawberry custard with crushed oreos on top which is one of my favorite strawberry/chocolate combos. It was sooooo good. My husband had the O.M.G. Concrete filled with peanut butter and brownie bits. You can choose your custard and he selected chocolate. If you're into that kind of stuff it was very good-I personally tend to keep my ice cream more plain. I can't wait to go back!!", "pics": null}}, {"review": {"des": "Did you know they have a kids cone? <br>Well they do and we love it!<br><br>Also love the raspberry concrete.<br><br>It's not Ted Drew's, but it's also not 6 hour drive!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/51o2KGFsCeRk7gD8qokoyA/348s.jpg", "caption": "Kids cone, blueberry the flavor of the month for July!"}]}}, {"review": {"des": "Choosing the right rating was difficult for me because the overall quality of the custard is great. Smooth and creamy, but I was pretty disappointed to see that there were only 3 flavor options. Maybe I just misunderstood what this place was about. I thought there would be a lot more to choose from. They do have many toppings, and sundae styles to choose from so I guess you can do a lot with chocolate or vanilla custard. <br><br>They have a ton of retro candy for sale and a good amount of bakery items to choose from as well. They try to have a lot of variety, but not the kind I was hoping for - custard. My husband ordered the mocha madness cup and he was severely disappointed with it. Coffee flavored ice cream is his favorite and he said his tasted mostly like strong espresso and there were too many chocolate chips ruining the texture. I ordered the temporary flavor peach on a sugar cone and it was pretty good. It tasted mostly like vanilla ice cream with a hint of peach. I got my son a kids cone with vanilla custard. They definitely give you huge scoops so I'd stick with one unless you're wanting A LOT of custard. <br><br>Overall I'd say this place is worth the try.", "pics": null}}, {"review": {"des": "Nice 50s/60s vintage vibe. It's usually crowded. Tasteful custard only wish the had more than 3 varieties of custards, Also THEY asked if i wanted sprinkles i said sure & THEY still didn't give me any smh but overall very good ice cream", "pics": null}}, {"review": {"des": "Great setup for a corner shop.  Plenty of toppings and candy options.  Parking is limited to non-existent. Most likely an option if you live in the area or are walking by.<br><br>In terms of taste, nothing spectacular, we get about the same at Culver's closer to home.", "pics": null}}, {"review": {"des": "Greeted immediately upon entering by friendly staff and a fun candy wall!! We got the Tasty Turtle sundae with vanilla custard and it is absolutely delicious!! Perfect blend of hot fudge and caramel and creamy custard. Will definitely be coming back!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/_-5UoPft2G3XsYihBBHyvg/348s.jpg", "caption": "What cute decor! One of everything please!"}]}}, {"review": {"des": "We walked in 15 minutes before close, there were already a couple people in line waiting but we were told we couldn't be served. Had made a 20 minute trip to get there so very annoyed.", "pics": null}}, {"review": {"des": "If my memory serves me correctly i went here years ago one time for an ice cream cone.I don't remember the exact flavor of the ice cream,but i do remember how toxic and gassy the otherwise tasty GMO ice cream is.It produces \"bubble guts\" if you eat too much of it especially.I also remember the faux personality and faux content of character of one or more of the employees there too.", "pics": null}}]}