{"name": "lincoln-park-conservatory-chicago", "reviews": [{"review": {"des": "It is my go-to place in Chicago.  It is in the city, but it is so quite that I feel I escape to a forest.<br><br>The most amazing thing here is the orchids.  It has different varieties in various sizes and colors.  I think it is one of the top 3 orchid gardens I have visited in US (the other two are the National Botanical Garden in DC and the Atlanta Botanical Garden).<br><br>The admission is free.  This is even better.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/sYt5UpsSayhZLFA7XkTn-g/348s.jpg", "caption": "Bleeding heart"}]}}, {"review": {"des": "Really lovely place worth the visit, and best part is it's FREE (the best word in the English dictionary....), open every day of the year, and right next to the zoo (also free)- so you can make a full day out of both of these places. Stop by here and (literally) smell the roses and take in all the colors, fauna, and greenery this beautiful place has to offer. <br><br>It's a peaceful oasis in the bustling Chicago city. I love strolling through here and taking my time through each section. It's not just random flowers and plants here and there- each plant and each flower was specifically put where they were for a reason, whether it's for temperature reasons, growing reasons, space, and even aesthetics. And that's exactly what this place is- aesthetically pleasing to the eyes, nose, and even ears when you get a break from all the noise and find yourself in this place surrounded by life's quieter things.", "pics": null}}, {"review": {"des": "September we made a trip to Chicago and decided Saturday to go and explore. A beautiful botanical garden. Open at 9am and a lovely place to stroll the gardens or just sit on a bench and be at peace or people watch.. <br>The staff will tell you about the more than 40k annuals and just beautiful and nice that you get through for an hour.  Did I mention Free?!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/vDCiVhpGSDloMZvDR2ML_A/168s.jpg", "caption": "Peaceful and beautiful colors"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Nzlph41kmzJZ5R_lkRba0A/168s.jpg", "caption": "Nice find  and free.. bonus gorgeous day"}]}}, {"review": {"des": "If your in Chicago and want to take a tropical vacation you don't have to go far, and it's free! The Conservatory is one of the most relaxing places you can go in Chicago to get away from the city, or if the weather is on the cold side this destination is truly a tropical paradise to take in all of the wonderful variety of plant creations. You'll feel like your in a tropical climate as the plants are kept to specific temperatures year round. I loved every room from the fern room to the orchid room. We visited the conservatory on a very cold weekend and as soon as we entered the building we had to shed our jackets. I also loved the turtles in the fern room. We will definitely be back!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/CtzUcbRIM3JAU-a2QDgcJw/168s.jpg", "caption": "I loved the tree with giant bean pods"}]}}, {"review": {"des": "Nice place to visit when wanting to escape the city. It is free which is really nice and also located right next to the zoo so you can do two things at once. There is a large amount of different Flora from all around the world. My favorite part is the orchid garden, I just wish there was slightly more! It is also nice and warm which is great on a cold day, only thing is you have to carry your heavy coat around.", "pics": null}}, {"review": {"des": "So beautiful! The gardens with the views, so amazing! I was on my way back home and saw this and had to stop and check things out. LPC was very similar to my conservatory at home (as you could imagine I'm sure they're all pretty similar) but it did have this extended room with hanging sculptures of humming birds, they looked so amazing. Awesome spot for some photo ops!", "pics": null}}, {"review": {"des": "One of the best FREE public greenhouses I've ever visited and it's located right next to the zoo (also free). We spent about 25 minutes in here, but you could easily stay in it for longer. This would be great to visit in the winter time, as an escape from the frigid Chicago weather! It's much larger than it looks from the outside. The orchid room was my favorite.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/WYL5jfSvMLfTGbHhU5d9lw/168s.jpg", "caption": "Sausage tree!"}]}}, {"review": {"des": "Pretty, and the hummingbird sculptures were beautiful. Not too humid like most conservatories and a large, lush variety of plants. However, a few large chunks of dirt were empty, left untended. Definitely should've been filled to round out the vegetation.", "pics": null}}, {"review": {"des": "Located next to Lincoln Park Zoo's Lily Pond, Lincoln Park Conservatory is a year round (!!!!) greenhouse, home to countless plants and gorgeous scenery. Overlooking gorgeous gardens in the spring, fall, and summer, you truly cannot miss this grand, gorgeous structure, and when you're surrounded by all of this nature, it's hard to remember you're even in a city. The calm and beauty of this space really does serve as a safe haven when things feel hectic.<br><br>The conservatory, owned by the Chicago Park District, is open from 9-5 and is a really lovely addition to the Lincoln Park Zoo's charm, though I'm not sure if it's officially a part of the zoo itself. Oh, and the fact that it's free as well just makes it all the more swell.<br><br>I've also seen quite a few engagements happen in here, which is a great idea because all of the plants make for a lovely backdrop! Just a thought, folks. If you're ever at the beach nearby or visiting the zoo or even just taking a stroll by, stop in! It's definitely worth it.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/zUhyfQ5FoCoITFKfPHKfEw/168s.jpg", "caption": "Thank you, Lincoln park conservatory, for a good photo background!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/zR6USkMPvKzMpHKbA2J0QQ/168s.jpg", "caption": "The plants in the conservatory make for a good photo background."}]}}, {"review": {"des": "He sidled up to me rather quietly and I'm still not quite sure why, since he calls himself shy at the end of our conversation when I asked him if he wanted to be in a photo. He's never been west of the Mississippi. A lifelong Chicagoan, having worked here for 30 years - actually,  eight years at Garfield Park's Conservatory - he knows a lot about the place. Like that this \"Palm House\" (first room as you enter) was built for the 1893 Columbian Exposition. The \"Fern House\" followed a few years later in 1896 and then came the \"Orchid Room\" in the early 1900s. <br><br>My favorite part is when he points out one of the architectural details just overhead - one of the original decorative scroll works on an original column. I've been coming here all my life and never had taken notice. <br><br>I've also never been here at Wintertime! Mind you, really the IDEAL time to visit - when it's freezing out! At holiday time, the place is decked out in lights, with trains running through many sections of the Conservatory, aka \"The Train and Light Show.\"<br><br>That's a lot of work! There are a total of twelve caretakers here and the Conservatory is open every single day of the year. It's no fee to enter - awesome. But donations are greatly appreciated. <br><br>I'm glad this person who's been here so many years had thought to strike up a chat with me, and in turn...I was so inclined to share via review. Long overdue as it is!<br><br>If you can get there this Holiday Season for the \"Train and Lights Show,\" do. I think you'll enjoy.", "pics": null}}, {"review": {"des": "Every time I'm in Chicago I stop in here. It's free and I'm the Lincoln park area next to the zoo. <br>This place is amazing. So tranquil but humid so be sure to take off your jacket upon entering.<br>Each segment takes you to a different part of the world/climate and features floor to ceiling plants. <br>You could spend a lot of time here. They have benches at most segments you can just hang out and enjoy the beautiful surroundings.", "pics": null}}, {"review": {"des": "This is such a cute area to visit if your a nature lover! It's located by the zoo so if you have kids you can head over there. This is perfect to sit and observe the beautiful flowers or even a picnic! Once you go inside the conservatory it's a little hot i there so might not be in there long but it's perfect for pictures as well", "pics": null}}, {"review": {"des": "There's a reason they call it a conservatory...it's where you get to release all that negative energy you've been storing up and breathe in all things positive to conserve until your next visit. <br><br>I haven't been back for awhile, and it was time for a much needed visit to garner some positive energy--and enjoy some fresh clean air after a skunk made itself known outside our house recently ;-)<br><br>The conservatory is a free (suggested donation) sanctuary where you can get lost and explore plants and trees of all kinds from all around the world. You'll see totem poles tucked away, koi fish ponds, random dinosaurs (see for yourself), orchids, and you can even take in a really cool sound installation while you wander through. It's toasty warm, so it makes for a great resting place during the winter. <br><br>Visiting the Lincoln Park Conservatory reminds me of why I love and miss certain aspects of the city so much. I am so grateful to the donors that keep this place free for all.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/j4GNamamx1WqxBpR-sZg2Q/348s.jpg", "caption": "Really cool sound installation."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/afDi9qJsioJwO4b9-QC1Gg/168s.jpg", "caption": "About the koi pond"}]}}, {"review": {"des": "Love this conservatory! Great location-just north of downtown. Beautiful plants and nice surrounding park for walking around.", "pics": null}}, {"review": {"des": "Nice little asset to the Lincoln Park area. I am somewhat biased as I am a big fan of the Como Park Conservatory in St. Paul MN and found that to be a little bigger and more diverse than here. <br><br>But hey, its free and it is still a nice little walk through a tropical climate to see the palms and orchids. I suggest making a side trip here if you are at the zoo or go to the zoo if this is your main destination.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/zcvFnutpwKhmH4uof0LERQ/168s.jpg", "caption": "Bread Fruit!"}]}}, {"review": {"des": "The Lincoln Park Conservatory is meticulously maintained by the Chicago Park District and is conveniently located next to the Lincoln Park Zoo.<br><br>A fantastic FREE place with ancient ferns and tropical plants.<br><br>The conservatory has four sections the Palm House, the Fern Room, the Orchid House, and the Conifer Garden.<br><br>The Palm House is the first room that you step into and has dozens of different types of Palms as well as many food plants such as bananas, grapefruit, oranges, papaya, Etc.<br><br>Next you will step back in time as you enter the Fern Room. You can just imagine Jurassic Park in this room in fact if you look down into one of The Small Ponds you will actually see some dinosaurs.<br><br>The Orchid House has hundreds of orchids and also holds a number of tropical carnivorous plants. It is very humid in the Orchid House, and you will be able to see some giant koi fish in here.<br><br>The Conifer Garden is outdoors and surrounds the west and south sides of the conservatory. The garden includes more than 150 trees and shrubs including a number of dwarf varieties.<br><br>They are open everyday of the Year from 9 a.m. to 5 p.m. . Admission is FREE except for special events. There are also docent-led tours you can call the Lincoln Park Conservatory at 773-883-7275 for more information. They also have seasonal flower displays, for a current schedule you can call 312-742-7736.", "pics": null}}, {"review": {"des": "I use to love this conservatory. That was all before I found out how gigantic Garfield Park conservatory is. This one has some flowers, ferns, ponds other vegetation different kind of trees. It's nice that it's extremely close to the zoo. Also free like the zoo. Rooms are climate controlled based on plants in the room. If you have the time I'd recommend checking out the Garfield Park conservatory and compare the 2. This isn't a slight by any means. It's exemplary the CHicago park district operates such high quality facilities and a vareity of beaches, field houses and other entities.", "pics": null}}, {"review": {"des": "I really love this place. It's never too crowded. It's nice and peaceful. Every room is filled with gorgeous things to look at (and learn about). The staff/volunteers/guides are super knowledgeable and friendly. I can spend hours here just wandering and snapping photos. Oh yeah, this is my absolute favorite place to come and practice my photography skills. You can learn, you can wonder, you can get warm from the cold... There are just so many things to enjoy about this spot.", "pics": null}}, {"review": {"des": "Located next to the Lincoln Park Zoo this is a true gem in Chicago. This year round greenhouse is the perfect place to warm up on really cold winter days after a visit to the neighboring zoo. This beautiful structure is home to countless plants and flowers from all over the world. My favorite place is the Orchid house were hundred of different kind of orchids, in different stages of blooming called it their home.<br><br>Owned by the Chicago Park District, it is open from 9am-5pm year round and it's access is free, A unique place downtown Chicago that makes you forget that you are actually in a big city.<br><br>Several engagement happen here all year and it is a favorite destination for special event photography.", "pics": null}}, {"review": {"des": "One of my favorite places in Chicago. Parking can be a bit hard to find on busy days but this place is worth it. It's a nice way to relax in a green scenery in the city and the zoo is a quick walk away.", "pics": null}}, {"review": {"des": "Such beauty found in the city! i.e., Lincoln Park. This conservatory is part of the Chicago Park District, and has free admission. There's paid parking ($26), but there's public transit, or you can try your luck at finding street parking.<br><br>I can't believe I didn't visit this place sooner, but my mom visited from out of town. It was the perfect opportunity to show her the less urban side of the city, and this was such a nice discovery and experience for the family. Don't rush through, and take the time to take in all the different flowers and vegetation. The park district put in a great deal of work, and you get to take in all that hard work!<br><br>Flowers, ponds, koi, and lots of space to just walk and even sit to bask in nature. I find it amazing that all these different plants can co-exist. My wife loved the Orchid Room, but my favorite was the Show House, home to the annual flower shows.<br><br>The Lincoln Park Conservatory is a must visit for tourists and city folk alike. Take a break from the grind, and soak in all the good vibes from this exquisite sampling of nature from around the world right in your backyard!", "pics": null}}, {"review": {"des": "This is a nice little conservatory in the heart of Chicago. It's a piece of calm amidst the noise.<br><br>Check it out and you won't be disappointed. Plus, I proposed to my fiancé there as well :-)", "pics": null}}, {"review": {"des": "Conveniently located right next to the Lincoln Park Zoo, the conservatory is a nice little addition to the area. It's not the biggest conservatory, but it's free and I can't complain. After I walked around the Lincoln Park Zoo (which is also FREE!), my friend and I decided to check out the conservatory. It's well maintained and some of the signs throughout the place are pretty funny to read.", "pics": null}}, {"review": {"des": "Great little Oasis next to the Zoo.  Super place to go in the dead of winter when you want to feel some humidity!", "pics": null}}, {"review": {"des": "Having grown up in Chicago's north side I never had been to the conservatory until recently. It is an amazing treasure of history, Chicago culture and botanical prowess that should be required viewing for any Lincoln Park Zoo go-ers or Nature Museum patrons. The greenhouse itself takes twenty-thirty minutes top to make your way through. If you stop and admire the smells and unique plants, there's no shortage of volunteer docents or gardeners who will stop to point out something you wouldn't have noticed. I love the succulent room, but the fern room is a sight to see- wow, it's like your transported millions of years ago and you'd expect to see a dinosaur munching on the leaves. If you haven't visited yet, this is a must see institution!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/bo2gzZi3edaInMVWKbXhlg/168s.jpg", "caption": "The orchid room- my favorite! It was empty on a Thursday afternoon."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/lnZdf3NeIy_yYqVHZrXmCg/168s.jpg", "caption": "A Venus fly trap! Much smaller than I expected!"}]}}, {"review": {"des": "Pretty spot in the city for a quick garden tour. Palm and fern rooms per the norm. The orchid room was pretty cool but not a ton in bloom this week. IMO I was expecting more for how fancy their website is. Especially compared to Garfield Conservatory outside the city. Took about 30 minutes for a meandering and that was it. I guess I was expecting more species? Everything was clean and well maintained with friendly volunteers.", "pics": null}}, {"review": {"des": "We stopped in the conservatory as part of our trip to the Lincoln Park Zoo (its an easy walk).  The staff were doing some maintenance at the time, so we didn't get to see all the rooms, but from what we could see, they seem to have done a great job creating a miniature tropical environment for a lot of plant life (none of which lives anywhere near Illinois :) ) to survive. <br><br>I'm not sure what it'd feel like in the summer, but on a chilly morning in Chicago, the warmth of the greenhouse was a pleasant change of pace!", "pics": null}}, {"review": {"des": "The Conservatory is kind of attached to the Zoo and both are completely free to visit. It's a really nice break from the zoo - and it's great if there is bad weather as the entire Conservatory is covered. <br><br>There are a lot of interesting flowers to see and I particularly liked the orchids. Whoever is in charge of the displays also has quite the sense of humor! They put miniature dinosaur figurines in the ferns exhibits - I suppose to show the age when these ferns were on the earth? <br><br>It's a nice little side trip if you're in the Lincoln Park area and it being completely free doesn't hurt either! I don't think it has as much as other Conservatories, but it's great for a quick visit.", "pics": null}}, {"review": {"des": "The Lincoln Park Conservatory is a small botanical garden filled with plants from all over the world and fun for the family! <br><br>The horticulture collection consists of three houses (Palm, Fern, & Orchid) a Show room, and a Conifer garden along the parkway. <br><br>The walkways inside are wide, but not wheelchair accessible from the main Palm House, unless there is an entrance I could not see.<br><br>The courtyard has tons of benches and open grass to lounge on, the Bates fountain, and Schiller and Shakespeare monuments. <br><br>It's also $free$", "pics": null}}, {"review": {"des": "After going to the Garfield Park Conservatory, I felt rather excited to try this conservatory. But, I was somewhat disappointed as Garfield in my opinion is much better. <br><br>There were only 3 rooms available and one was chained off as they were prepping for an exhibit. <br><br>Overall, the plants looked like they were taken good care of and the overall experience was pleasant. <br><br>I thought the Dino displays were a bit tacky and detracted from the overall experience. <br><br>If I'm wanting a conservatory experience, I think I'd rather go back to Garfield Park.", "pics": null}}, {"review": {"des": "Chicago wins so many points for having the Lincoln Park Park system and the Conservatory is a great asset to it! I walked in unexpectedly and loved the atmosphere. I sat on a bench in complete serenity, and honestly wanted to take a nap right then and there! There are lots of plants that you can read and learn about. <br><br>There weren't too many people on a Monday morning so feel free to tour around! There was a very nice gardener who was extremely helpful.", "pics": null}}, {"review": {"des": "Another great spot to take the kids and explore the wonder and beauty of plants of all kinds. Great to visit in all seasons. <br><br>Parking can be a pain, but it's not too bad if you park a few blocks away and use a stroller. <br><br>Right next to the zoo, so easy to combine in one trip if you have some plant lovers, but others that prefer polar bears and such.", "pics": null}}, {"review": {"des": "This is a great 120+ years old piece of Chicago History for a solid day out standby, especially on a cold day. Popped in for a slow walk and visit with my nephew and brother when they came into the city for a few hours.<br><br>At  you can still enjoy. Oodles of plants from all around the world. Bring the kids, or your pals, and look for the dinosaurs in the fern room.", "pics": null}}, {"review": {"des": "Beautiful place to speed all day long. <br>Im definitely im come back<br>Planta of all continent. <br>All color i can imagine.", "pics": null}}, {"review": {"des": "Plants are fun! No, really! <br><br>The first time I visited the Lincoln Park Conservatory the wife and I breezed through. Not sure why we didn't take time to look at the plants and flowers but we didn't soak up the conservatory. Fast forward a few months and we took the my mother and father in-law thinking it would be a good place to kill some time as we play tourists in Chicago. The parents loved it. They took their time to look at all the odd, weird and fun looking plants from all over the world. This caused my wife and I to also be patient and point in awe of all the colorful and oddly shaped plants we would never see unless we visited the other continents not named North America.<br><br>Great place to take beautiful photos or take seat at their many indoor benches to just relax, read a book and clear the mind and soul. Outside you can enjoy more gorgeous landscaping. Oh and its free. Thank us Chicago tax payers for it.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ubeN4h2qS9W7NoK61kyD0g/168s.jpg", "caption": "Not making this stuff up. No photo edits. Called a Croton"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/EZvqQCqwpIwoR2c9n2Bb3w/168s.jpg", "caption": "Japanese lantern from East Africa"}]}}, {"review": {"des": "Definitely an interesting visit and well worth it, considering it's free. Beware of the leaky ceiling on rainy days though. Overall, it was a bit smaller than I thought it would be since it only took us about 30 minutes to survey the whole thing, but it's definitely interesting!", "pics": null}}, {"review": {"des": "We did one of our elopement shoots here after having visited a few times over the past few years. The space is so photogenic and a great green space in the fall or winter.The show room was closed for the set up of the Christmas Village but we found plenty of other spaces to work in.<br><br>You do need to apply for a media permit through the Chicago Parks District which took a few weeks and ended up being about $70. No one asked for our permits on sight but it was worth it to support the conservatory's efforts and know we wouldn't be sent away if someone asked.", "pics": null}}, {"review": {"des": "What a beautiful sight in the midst of a rainy winter day. I think I enjoyed it more considering how grey and wet it was outside.<br><br>Free admission & located right outside of the Lincoln Park Zoo, I passed by on my way out of the zoo and went in 10 minutes before closing - just enough time to walk through. The conservatory isn't too large, but it is filled with a spectacular of plants and flowers. They have a room dedicated to just orchids and another one for ferns, but the colorful, full blooming azaleas were my favorite part.<br><br>One of the rooms is really humid so watch your phone so it won't get water damage.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/jXxr6QsTlbJADdvtKapGVg/168s.jpg", "caption": "Orchid room"}]}}, {"review": {"des": "While all of the conservatory is a must-see, the orchid room is the best.  <br><br>This is a great place to admire plants and relax.  Lots of benches, soothing music, warm temperatures, and bathrooms by the front entrance.  During Chicago's bleak winters, this is one of the few places where everything is alive.<br><br>It's much smaller than Garfield Park Conservatory, but still worth a visit.  I wish it got more funding, so they could add on more space and longer hours.", "pics": null}}, {"review": {"des": "really cute conservatory. love that it is free. smells incredible. a great little escape.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/5Abu2al-6NNGx2TXQy_tIg/348s.jpg", "caption": "I turned the conservatory into a runway lolol *face palm emoji"}]}}, {"review": {"des": "Totally free to everyone:) I didn't even need to show my Illinois ID.<br><br>I came here on a weekday and was able to find some solitude. It was just me, a handful of tourists, and very fancy old ladies. Best Monday ever!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/E-yTmimHBbbfNqgx0l0fpQ/348s.jpg", "caption": "The flower room with lots of beautiful art installations."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/wTeDafMWA7bP5UIhNIvFQA/168s.jpg", "caption": "A whole room just for ferns... unleash your inner dinosaur!"}]}}, {"review": {"des": "It has nice walk through all the lovely flowers and plants that can't actually grow well in Chicago. Their orchid section is very pretty and you can smell the flowers. It's a great place to take engagement photos or wedding photos too. I really like I wish I could've purchased some of the orchids.", "pics": null}}, {"review": {"des": "A friend and I were visiting Chicago and looking for an inexpensive way to kill time- this place was perfect! It's warm and inviting, the plants and paths are well kept and labeled. Different music plays in each room of the greenhouse, which really sets various pleasant moods. There are several fountains and ponds, all of which add to the charm. I'm not exaggerating when I say that I would spend hours reading on a bench in the fern room. Also, this place is free, which is a huge bonus.", "pics": null}}, {"review": {"des": "My girlfriends and I took a vacation to Chicago at the end of August 2015, and we decided to visit this conservatory before heading to the zoo on our last day. <br><br>We arrived early around 9AM, right as they opened. It was empty and we practically had the entire place to ourselves. The best thing about it is that it's FREE! I'm not a botanist and I don't know anything about plants except that they look nice, but I was able to appreciate the upkeep and educational signage. It was refreshing to see all of the plants in the huge greenhouses and fun to walk around and take it all in.", "pics": null}}, {"review": {"des": "My oh my!! This is an incredible oasis of flora diversity and tranquility in the midst of the hustle and bustle of the third largest city in the US.<br><br>This free indoor botanical garden is just steps from the Lincoln Park Zoo. We visited on a warm June day, and the zoo was filled with children. Just a few steps into the conservatory we were greeted by lush foliage, cooler temperatures, and peace and quiet. There are several different rooms: the tropical Palm House, the exotic Fern Room, the gorgeous Orchid House, and the Show House that features seasonal plants. Some rooms have little streams rolling through, which adds to the peaceful ambiance.<br><br>This is not something you want to rush through. There is a lot of stunning plants and beautiful flowers to take in. The dinosaurs in the fern room is ridiculous and funny; the curators are probably attempting to make this slightly more entertaining for children. I know most children would find the conservatory \"boring.\" However, if you are a gardener, botanist, ecologist, photographer, or have a general appreciation of plants, this place is captivating.<br><br>Speaking of photography, an amateur photographer can practice their skills (I know I took a lot of photos!) or a professional can easily try out new techniques. The Conservatory is part of the Chicago Parks system and can be reserved for professional photos. I can imagine there have been some incredible wedding photographs taken here.<br><br>This was only my first visit but will not be my last. I would love to take others here and share this little slice of urban paradise.", "pics": null}}, {"review": {"des": "Not many attractions are free when you're on vacation but the Lincoln Park Conservatory was. This place is a short walk from the zoo.<br><br>Since many of the rooms are climate controlled, it could feel a bit muggy at times. Overall, the conservatory had a beautiful collection of orchids, palms, and seasonal flower displays.", "pics": null}}, {"review": {"des": "Right next to the Lincoln Zoo, the Conservatory is really cool. There are a lot of plants, and though it's quite warm and humid inside, the variety of plants make up for it. The conservatory isn't super big, but it's a nice place to walk around if you like plants!", "pics": null}}, {"review": {"des": "what a fun place to go with the family - it is free and lovely to go to on a nice summer afternoon - easy to get to by foot  or car - we especially liked the Fern Room, the Orchid House", "pics": null}}, {"review": {"des": "Gorgeous place with beautiful gardens! I especially loved the orchid section. A nice place for plant lovers!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/xzHWYIHpXxdGxj0dfjpXSQ/348s.jpg", "caption": "We went there and it was free!!!"}]}}, {"review": {"des": "Such an amazing, FREE, treasure, in Lincoln Park, next to the FREE Zoo.   You can tell this building is old but kept up well.  Ferns, Orchids, Flowers, and seasonal changes.   Even has clean rest rooms.  Friendly staff people and gardeners will answer your plant questions..  When you leave there is an AWESOME view of Lincoln Park and Downtown Chicago.  Make sure you bring your camera!<br><br>Follow Stockton Avenue, both sides to find street parking.   Try the street that parallels Stockton to find a spot.", "pics": null}}, {"review": {"des": "One of my favorite places in Chicago, it's only a 120 yrs older than I am. The indoor portion is like a hideaway from all the traffic, pollution and noise. The outdoor portion is just as beautiful and peaceful \"botanical garden\". It's nice that it's free and right next to Lincoln Park Zoo. So you can spend time at both locations in the same day. <br><br>I suggest you park on Stockton for free! People are always in an out so it shouldn't be too difficult to find.", "pics": null}}, {"review": {"des": "Walking through the door the smell of a vast forest hits you, something especially welcome during the winter. <br><br>There a guides there who are happy to answer any questions you have and who can beat the price of free. <br><br>It's a bit small and maybe not something I'd go out of my way for, but if you're in Lincoln Park it's definitely worth a visit.<br><br>Parking is $5 in the lot but there's a lot of free street parking on Canon.", "pics": null}}, {"review": {"des": "Loved this little nature corner in Chicago. It was perfect for us considering outside it was a whooping temperature of 9 degrees. Inside is so warm and cozy.  You can sit down on their several benches through  out the trail. The staff was watering all the plants and trees so it smelled like a tropical forest after a summer rain. <br>Free entrance,  go warm up for few minutes inside ! It took us about 20 minutes to finish it all, not so big but gorgeous ! <br>Thumbs up for the staff for keeping this nature Gem clean and free for us!", "pics": null}}, {"review": {"des": "Beautiful.  Amazing ambiance.  Relaxing.  Calming.  Great photo opportunities.  Free!!  Not to be missed.", "pics": null}}, {"review": {"des": "Who doesn't love a completely free attraction?!<br><br>Seriously though, the Lincoln Park Conservatory has loads of lovely plants you can view and they're all laid out in a relaxing and enjoyable way. It was nice to see so many people visiting and taking time to read a book, draw, or paint while visiting.<br><br>I highly recommend visiting (and donating to support the conservatory!). We spent about an hour here before heading to a tour at the Frank Lloyd Wright House and Studio.", "pics": null}}, {"review": {"des": "One of my favorite things I went to in the city! It's right across the street from the Nature Museum and around the corner from the lily pond. Hitting all three of those up will surely be a healthy dose of nature for the day.<br><br>I think the most important part of the Conservatory is that it's free to the public, so come on in!<br><br>I love plants a lot. It says not to touch them, but I do anyway. They need to be told that they're loved! When you breathe in, they're just fulfilling your oxygen needs and they don't even ask for anything in return.<br><br>Seriously though, plants are wonderful. In this Conservatory, there are a couple different rooms you can go in and check out. They're pretty similar in the types of plants shown, but the setup is slightly different between the rooms. There are a couple of places where you can plop down and look at the plants, while \"meditative\" (slightly creepy, jurassic park music) plays in the background. Got to love it. <br><br>Final thought: Keep an eye on your child, please. The plants aren't meant to be clambered on, or the koi fish disturbed in their habitat. It's exciting to see all the wonderful plants, but staff shouldn't have to yell at your child for leaning into the koi pond.", "pics": null}}, {"review": {"des": "I love walking they the conservatory. Seeing the sausage tree up close and enjoying being in the midst of orchids and ferns. Just lovely.", "pics": null}}, {"review": {"des": "I love this place, I really do; but they need to update on plants, I see most of the same plants every year. Or maybe I should come less often? But... :/<br><br>Also, they didn't have soap in bathroom, so I told one of the workers there, an elder woman. She replies with, <br><br>\"there's another dispenser there. Did you see?\" <br>Me: there is no other dispenser <br>Her: there is <br>*goes to check, and sees nothing. <br>Oh ok, it's not there. <br>*goes out and back inside the conservatory and resumes back to walking around, waiting for plant inquiries from visitors. <br><br>Are you kidding me?!!! Ok twerp breathes, calm down-- just remember, the conservatory is a beautiful sanctuary, regardless of incompetent workers.", "pics": null}}, {"review": {"des": "First, it's free. There are conservatories all over the country that cost money and are not as good.<br><br>Second, it's a great 30-60 minute diversion if you are in the Lincoln Park Zoo area. Lots of unique plants and ecosystems that are impossible to find in most of the contiguous 48 states.<br><br>This is one of those attractions that may not be worth a trip by itself but it's an essential stop if you are at the zoo. So is the nearby Peggy Notebaert Nature Museum. Why not? You probably already paid $30+ for parking.", "pics": null}}, {"review": {"des": "We came to Lincoln Park Conservatory for the 'Christmas Flower Exhibit'. What a beautiful place! Walking through the Conservatory is a bit crowded, however seeing all the different plants and flowers is so worth it. I brought my 1 year old daughter along with me and she loved it. All the vines, colorful flowers, indoor fountains, and exotic plants amazed her. We will definitely be going back for their upcoming exhibits!! Also admission is free, this place is so worth it!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/_VkupyX3o9_b9jeeTbJyAA/348s.jpg", "caption": "Lincoln Park Conservatory"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/-MVBlv1KQzft3cDM7FfTXw/168s.jpg", "caption": "Lincoln Park Conservatory"}]}}, {"review": {"des": "Beautiful conservatory in Lincoln park. Free of charge, this is a wonderful activity for tourists and locals. The conservatory is clean and well-maintained. Lots of parks nearby if you want to pack a picnic to make a day of it.", "pics": null}}, {"review": {"des": "I would put this in the category of really neat places that make Chicago a great place to live.   Unless you love conservatories, this is probably not a destination, but it is located right next to Lincoln Park Zoo (it could easily be considered part of the zoo as its front door is probably 50 feet outside an entrance to the zoo).   If you are at the zoo or for some other reason in the neighborhood, this is worth checking out.   You can't beat the price (free).  The place is meticulously maintained (at least as viewed through the eyes of somebody who doesn't have a lot of experience with conservatories.)   My boy (1 and 1/2 years old) can probably spend a good hour in the place walking around and not get bored and being engaged by the diverse plants.   Same issues with parking for this place as the zoo.", "pics": null}}, {"review": {"des": "We visited the Conservatory today during an extensive visit to Lincoln Park and it was a real highlight.  Not only is the Conservatory quite lovely, but admission is *free*.  It's beautifully-maintained, too.", "pics": null}}, {"review": {"des": "I grew up just a few blocks from here - and in the 1960s, 1970s, and even the 1980s, this was THE only place to experience jungles and forests and rose gardens all at the same time during every season.<br><br>It is free - it smells fresh and green - and it is warm and lovely in the winter.<br><br>This is a wonderful public space - that all can enjoy. And it is half a block east from the Shakespeare statue, half a block north of the Lincoln Park Zoo - and two blocks west of the beach and east of Clark Street where there are restaurants and shops.<br><br>So it is very much centrally located.", "pics": null}}, {"review": {"des": "Similar to other conservatories, the Lincoln Park conservatory is filled with a wide variety of plants. It's a quiet place to walk around & be surrounded by nature, and a place where you can take a bunch of beautiful pictures. It's right by Lincoln zoo as well.", "pics": null}}, {"review": {"des": "Hidden gem! Everyone always goes to the zoo and rarely makes it here. It's free and surprisingly large. A bunch of smaller rooms filled with different plants and flowers. Great place to go with your mom on a Sunday afternoon!", "pics": null}}, {"review": {"des": "There are not many things that are free in Chicago, but this is one of the few. It should get 5 stars just for that fact alone.<br><br>But beyond that, it is actually a really nice conservatory. I have been to a few botanical centers and conservatories in my days, and this is definitely one of the nicer ones (especially for being free!). I love stopping in randomly just to check out the flowers and feel the warmth for a while, and to pretend I'm not in Chicago. It's very warm and humid. There is a fern room, nice waterfalls, a koi pond, and an orchid room. All around it seems very taken care of. A lovely getaway all year round!", "pics": null}}, {"review": {"des": "Check this place out! It was relaxing and nice for a gloomy-ish day.<br><br>The people who work here certainly have a sense of humor. In the fern room, there were small dinosaurs \"hiding\" throughout the ferns. It was really cute/funny!<br><br>The orchid room is beautiful. I wish I could live in there. I want to check out the Conservatory at another time of year, because the exhibits/types of flowers/plants change throughout the year -- could be interesting!", "pics": null}}, {"review": {"des": "Lincoln park is such a great place to spend the day! It has a zoo and a conservatory that's FREE!", "pics": null}}, {"review": {"des": "The conservatory is very well kept and the plants inside are gorgeous. I loved the fern room and the orchids they had. For a free experience I had an amazing time gazing at all the gorgeous plants. Thank you Chicago for showing a Bostonian this incredible conservatory!", "pics": null}}, {"review": {"des": "Went here recently for the Spring Flower exhibit. Such a great conservatory - meticulously kept facilities, beautiful plants and flowers, knowledgeable staff for those who have a question or two regarding their favorite plant/tree/flower and a great experience overall.", "pics": null}}, {"review": {"des": "I wanted to go here for a long time but I was pretty disappointed. This place is smaller than I thought. I wasn't too amazed by the plants too. I guess I've been spoiled by botanical gardens so this was boring in comparison.", "pics": null}}, {"review": {"des": "Peaceful, beautiful, free, well maintained. We are lucky to have such a lovely Conservatory in the center of Lincoln Park.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/v2bYu5Vd5YvzcYnvS78ZeA/348s.jpg", "caption": "Pink Star Cryptanthus December 2015"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/0Wejs4EKrMuq0sDNTEPhpw/168s.jpg", "caption": "Two 12/15/15"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/EizznFYS1a_tPkGKklK2Gg/168s.jpg", "caption": "Vase Plant 12/2015"}]}}, {"review": {"des": "Free admicion<br>All donation are welcome<br>Flowers<br>All over <br>Trees<br>Orchids<br>Koi fish<br>Too look around<br>My son loves the garden the section w/ dinasours on it", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Bjj7543-o0AmWjsm8Eyezg/168s.jpg", "caption": "Koi fish"}]}}, {"review": {"des": "Lovely refuge from the hustle and bustle of downtown! The volunteer docents are wonderful and will answer any and all questions you might have, silly or not. <br><br>The soundscape in the fern room rotates every month and is supposed to sound (appropriately) \"prehistoric\". The main building has never been renovated and the architecture is beautiful - not to mention it's open every day of every year.<br><br>the gardens outside are beautiful (especially in Chicago's mild summers!) and a perfect place for picnics and frisbee!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/p4cAs0V1IfrOPQ2PQOo8Ig/348s.jpg", "caption": "Fern room!"}]}}, {"review": {"des": "So beautiful and WARM on this cold winter day! It was really interesting looking at all the different plants and the atmosphere was so relaxing. Definitely recommend stopping here if you're nearby, combining it with a trip to the Nature Museum, Zoo, and History Museum made a perfect day trip to Lincoln Park for me.", "pics": null}}, {"review": {"des": "Another fabulous free find! We at first thought it was part of the zoo but realized after it just kept going and going that it was totally its own thing. I'm not super well versed in conservatories but this really wowed me and left me feeling inspired to find and learn more! My dad has been to many conservatories and botanical gardens and really enjoyed himself. My baby had a great time checking out all the flowers and listening to the recorded bird sounds. There weren't any real birds - I know sometimes places will have that but it didn't leave us feeling like something was missing. It was so peaceful, my vibe just completely changed once we got in there. I also thought it was cute how they had little dinasaur toys on different things - a fun scavenger hunt for kids. Lots to look at, smell and learn about here!", "pics": null}}, {"review": {"des": "The Lincoln Park conservatory never fails to  impress. When entering, I feel like Alice being transported into Wonderland. This place really is Wonderland... Or Narnia. <br><br>If you time it correctly, you can take a guided tour, but walking around yourself is just as nice. <br><br>The orchids are not to be missed. For a treat go see the holiday display!", "pics": null}}, {"review": {"des": "Beautiful indoor botanical garden.  The Conservatory is right next to the Zoo, so it's great place to pop into before or after your visit as well. I was happy to find out it was Free, which is something I am not used to seeing in Chicago. I recently took my mother here and we had a fantastic time.  Well I had a mostly good time but she had a blast.  She is a true botanist and I've barely got a green thumb, but I can enjoy beautiful flower and plants all the same.", "pics": null}}, {"review": {"des": "We encountered this place walking across Lincoln Park on a cold, grey November day, a little wind-blown and a little harassed by indecision. And then we stumbled in here.  It is warm, welcoming, and easily lures you in, where they have room upon room of interesting and beautiful plants.   I now have a real visceral understanding of the word \"oasis.\"  <br><br>Our thirty minutes here felt like a time warp.  Hopefully some day it will appear for you just as you need it, just as it did for us.", "pics": null}}, {"review": {"des": "I am not much of a plant or flower person but I have to say this place is very beautiful! I always avoided this place when I was in the area but one day I had time to kill and went in and I am glad I did. Now I go there often. There are various different rooms in this large place and the way they are done is simply amazing.  And during the holidays when they add in various model railroads within the forests it is a must see! Plus it is free!", "pics": null}}, {"review": {"des": "Worthwhile if you're already taking in the zoo and park.  The conservatory isn't huge, but it is a decent size and it packs in a lot of stuff within its limited space.", "pics": null}}, {"review": {"des": "A great place to come year-round but especially in the winter. When I walk in the winter, I often walk through the Conservatory and the zoo for a quick warmup. It's a great place to feel the heat and the views of summer in winter. If you're next door at the Lincoln Park Zoo, make sure you stop in for a picturesque (and free) treat.", "pics": null}}, {"review": {"des": "I was so glad to have had the chance to visit here! We had such a difficult time finding a spot. Luckily, the last parking sweep we went on we found a spot finally! Many of the plants are familiar to me as I am from south Florida. BUT the Orchid room. I died. Absolutely, in love with the orchid room. It was so a plus that this visit was free and the caretakers are so nice, informative, and funny. It was so relaxing to be inside... everyone kind of goes on library mode when they entered the main portion of the conservatory and you could hear all the waterfalls and ponds bubbling. It was such a beautiful escape from the hustle and bustle outside and it smells like Florida after the rain, it may not be a welcome smell, but that damp, dirt, earth, cut grass smell is like home. Definitely recommend a visit, it can take as long as you want, but if you're an orchid lover like me you'll easily spend 10+ minutes in the orchid room alone (taking pictures of every orchid in lens reach!) Otherwise, you can just take a few minutes to pause life and relax and walk through nature.", "pics": null}}, {"review": {"des": "Visiting this place is free!! Had I known that sooner, I'd probably have come here a lot more often. It is quiet, peaceful, and beautiful. The structure lets a ton of natural light in and it is just like you've escaped chilly Chicago and gone to a jungle-y paradise. There was a gentleman that came by and had us smell some of the flowers, make sure we looked at certain other ones, and was obviously a wealth of knowledge about all plants in there. <br><br>I can't wait to go back!", "pics": null}}, {"review": {"des": "Free, beautifully maintained. Very clean and featured many varieties of plants, ferns, exotic interior trees. Labeled well. Benches to sit on.   Separate fern house that is to die for!  Cycads, sago palms, mosses galore.", "pics": null}}, {"review": {"des": "I loved this more than the botanical gardens. Enthusiastic and knowledgeable volunteers, impressive variety of plants.", "pics": null}}, {"review": {"des": "On an already hot day, we thought we were going to die inside the Conservatory. Avoid during the high heat of the day in the summer, and you'll probably be all right.<br><br>However, there's really not all that much to see. It's mostly a dud of a place. There's just a few good plants worth seeing. If you have limited time in the area, head to the zoo instead.", "pics": null}}, {"review": {"des": "It's free!! This is a relatively small conservatory, but it's free to go in, and there is a lot to see here. I'm a huge nerd when it comes to plants and flowers, so this was a little slice of heaven for me. There are so very many varieties of plants and flowers packed in here. There are a few separate rooms off the main conservatory for ferns and orchids. I knew there are many types of ferns and orchids, but seeing them all together in one place is a sight to see with your own eyes. I could literally spend hours here exploring and taking pictures. Outside the conservatory is a great green space with a huge fountain. You can sit and enjoy the day, people watch, or have a picnic. It also doesn't hurt that you can see the city skyline over the trees at the edge of the green space. Also, if you walk to the end of the green space there is an entrance to Lincoln Park Zoo. You can really make a day of it if you want to see the Conservatory and then head over to the Zoo. The Zoo is also free to enter just in case you didn't already know.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Zr-j2hoa-VWD3xGbaO7vRQ/348s.jpg", "caption": "Inside"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/tAGPgBwrIy6SzHLgD_QQ6w/168s.jpg", "caption": "Entrance area"}]}}, {"review": {"des": "Loved the diversity and the size of the park. The Alfred Caldwell Lily Pool was a favority.", "pics": null}}, {"review": {"des": "Went to the Conservatory with my wife.  This is a wonderful place in the city.  Many, many, exotic botanical plants.  The best part is that it is technically free.  It is worth going and seeing.", "pics": null}}, {"review": {"des": "This place is beautiful and I think my family would really appreciate visiting here. I would definitely return here to see more and enjoy more of what the zoo has to offer. Chicago is a beautiful place and there is so much to do when it gets warm. Also the zoo entrance fee is free so get out and explore.", "pics": null}}, {"review": {"des": "One of my goals when visiting a city is to find the fun and free things to do around town. We spent two days in and around Lincoln Park and the conservatory was certainly one of the highlights. A tropical and lush oasis just minutes from downtown. <br><br>We were blessed with unseasonably warm weather during our visit, but I still enjoyed the warmth and beauty of The Observatory. If the weather was cold and blustery, I can't imagine anything finer than a little escape here in the middle of winter. <br><br>The Observatory is quite large and divided into four separate rooms: the Palm House, Fern Room, Orchid House and Show House.  Between the whimsical Halloween decorations in the Show House and the pond stocked with large koi fish, this would be a nice spot for the kids. It is located next door to the FREE zoo, so it is a fantastic two-for-nothing outing.<br><br>They call the Fern Room 'prehistoric' so you can imagine walking with the dinosaurs. The orchid house was vibrant with color and they warn you about raising them at home, \"They are like peanuts and you can't have just one.' I guess people tend to get a little obsessed.<br><br>Another favorite conservatory in the U.S. is the Botanical Building in Balboa Park in San Diego. This one is just as lovely, although it probably isn't quite as grand in scale. It somehow seemed more intimate since you wandered from room to room. It was immaculately maintained and I love the diversity of plants and species. I found it downright romantic.", "pics": null}}, {"review": {"des": "Was it Colonel Mustard or Professor Plum that did it in the conservatory? <br><br>There's nothing sinister about this conservatory...it is bright, beautiful, lush, humid, and quite serene. It's small enough that you can take your time and see everything in about half an hour, so plan to stop in here before or after visiting the Lincoln Park Zoo next door. Admission is totally free. <br><br>Leave the lead pipe and candlestick at home, but don't forget to bring your camera.", "pics": null}}, {"review": {"des": "Definitely a must see in chicago. It is right beside the free zoo and it is also FREE!", "pics": null}}, {"review": {"des": "I mean, sure, it's beautiful but it's not worth looking at all the pretty cacti and flowers because of the humidity. If it's already hot outside, don't go in the conservatory because you'll sweat even more.", "pics": null}}, {"review": {"des": "It's such a nice place to go if you're in the Lincoln Park area, and it's free to get in!  Even though it's kinda small but it's beautiful inside!", "pics": null}}, {"review": {"des": "A wonderful place to go and enjoy an incredible variety of plants and flowers. It is a small conservatory, but incredibly rich  in textures and colors: tropical plants, flowers, ferns, orchids, etc.The exhibits are always beautiful, and well designed. I go there with my camera to take pictures of the flowers. In the winter it feels like a mini tropical vacation. The staff is incredibly knowledgeable, helpful and friendly. They work constantly at keeping things in good shape: watering, cleaning, adjusting, removing debris, etc.<br>I love being there. it is also easy to reach on public transportation.", "pics": null}}, {"review": {"des": "Extra star for free, and a wonderful respite from the cold in the windy city. a fair variety of fauna, well displayed. I do suggest swinging by to check it out and enjoy the plants, or even bring a book and find a nice place to enjoy nature... but not in nature... yeah...", "pics": null}}, {"review": {"des": "Such a beautiful place! Had a mini photoshoot there. Be awarded that it's very human inside!", "pics": null}}]}