{"name": "lincoln-park-zoo-chicago", "reviews": [{"review": {"des": "This is my absolute favorite place to visit anytime I'm in town. Leaving the car at home and walking to this gem is your best bet, as parking is a little pricey for this free zoo. But that's Chicago, amiright? <br><br>Lincoln Park Zoo is absolutely stunning. The smaller size of this place leaves so much room for the animals here to have the most stunning, well-kept exhibits I've ever seen. There's a lot to look at, so bring your walking shoes and plan to spend the day. <br><br>I always recommend this place to friends visiting the Windy City, and make time to stop by each time I'm in town. In fact, I've probably been here 10 times since I moved out of state, and I haven't found myself bored yet!", "pics": null}}, {"review": {"des": "Of course only brewskies would bring me outside in December to the zoo! That and no children, but also no animals. (we saw a couple of apes in the ape house but they were asleep). The zoo had a Brewlights beer tasting with local beers offering sampling for tickets. There was music timed to lights (same 4-5 holiday songs but it's fine) and live music inside. Food was for purchase at the Lion House (the beef taco was ok, nothing special, should have had a bigger lunch). The lines were long but moved quickly, especially since we could only get 1 sample at a time. This was not 'chit chat weather' either!<br><br>The layout was ok but could have been better: the high alcohol beers, the Goose Island Bourbon county beers, had only ONE BOOTH and was way at the end of the park! By the time we ate and found it, only 2 kinds remained. I preferred the Alaskan Winter ale and Shiner Beer anyway. <br>The bathrooms in the Lion house were ok, but 1 stall was out of order, 1 had no hooks, and one of them didn't lock. I held it closed for my sister. (really, LP Zoo? Humans aren't THAT close to animals!)<br><br>I enjoyed a free carousel ride too! Not sure how much it normally costs, but I didn't feel the cold as I rode. I must have been 10 or 12 last time I rode one of those.<br><br>If we are blessed with one more 45 degree day, I would like to go again to see the animals.", "pics": null}}, {"review": {"des": "I enjoyed myself at the LP Zoo.  <br><br>People give \"free\" zoos a bad name, like they aren't good enough, but this zoo... this zoo right here? It was dope.  I enjoyed myself.  I couldn't tell the difference between the LP Board Walk or the Zoo honestly, since they are interconnected, but the animals look well taken care of and for a zoo, they seemed content. <br><br>It's not the largest zoo I've been to, but I did feel like I did a lot of walking that day.  The types of animals at this zoo were different than at the zoos in my state, so I enjoyed the variety displayed of  one particular animal.. like the monkeys! LOL  <br><br>I enjoyed a lot of the indoor areas (since it was a chilly, rainy, Chicago day) and boy were they warm. LOL  <br><br>I actually would like to visit again, because I feel like there were things I missed, since we got hungry.  #foodislife #foodrunsmyheart<br><br>Beautiful zoo..", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/SpoE3HDnO4Xr9SW_WrLSdQ/168s.jpg", "caption": "King of the jungle"}]}}, {"review": {"des": "This may not be the biggest park,  but it is beautiful and it's free. <br><br>It was chilly, so we kept going indoors to see the animal. I got to see a sloth, so my life is now complete LOL. But also lots of monkey. We saw a gorgeous cheers! She was breath taking. <br><br>We were a little lost trying to find the polar bears and the zoo staff was really friendly and helped guide us to the correct area. Unfortunately, when we got there the polar bear had just gone back inside and out of sight. <br><br>Again, this isn't a big zoo, but for the size, they have a good variety of animals to go check out.", "pics": null}}, {"review": {"des": "My boyfriend and I were in Chicago for a long weekend and were told we had to go to the zoo. It's free! I'm really glad we listened because it was a great experience. We were in town the weekend before Halloween and the zoo had a trick-or-treat event around the zoo where you could get candy and food and kids could participate in activities. We didn't know that this event was happening and although we weren't dressed up kids we still enjoyed getting candy and seeing all the animals. It was very crowded but we were still able to enjoy the animals. We often got confused where we were and I think the zoo would benefit from more maps around it or more signs pointing things out.<br><br>Walking to the zoo is a very pretty stroll. We were on Michigan Ave right in the heart of the city and our 20 minute walk along Lake Michigan was beautiful. As you get closer to the zoo you walk through a nice park where plenty of dogs are playing and then walk over bridges on a little lake/stream type body of water. It's a very pretty entrance to the zoo.", "pics": null}}, {"review": {"des": "Amazing zoo for family and children, plenty of animals and spectacular view of city! Best of all, it is free. <br><br>There are also lots of great food options around the area, so this is a favorite weekend spot for our family to hang out and dine.<br><br>When you come to see the animals, don't miss the bridge where you can oversee downtown Chicago, a great area to snap some selfies or family portraits.", "pics": null}}, {"review": {"des": "We took our newborn to Chicago for our very first trip - we were prepared to not leave our hotel room if it came down to it so we didn't really plan any specific itinerary and just went with the flow. I had this place bookmarked since it was FREE (!) and we made every effort to make sure that we at least visit this place before we left.<br><br>There are many exhibits and even though we were there on a weekday, it was still really packed with school tour groups and other families/tourists. We enjoyed hanging out here for the day and definitely would come back again on our next trip to Chicago (hopefully our baby will be older and actually enjoy the zoo much more)!", "pics": null}}, {"review": {"des": "Great zoo and it's free!  Parking rate is also reasonable: up to 30 minutes free,  $20 up to 2 hours, and $35 for 4+ hours.  They have tons of animals on display and you can see them pretty close.  The lions were sunbathing when I came and were a delight to watch.  I also enjoyed watching the seals and the monkeys.  There's a conservatory filled with flowers and plants that is also free.  I saw a ton of tropical palms and ancient ferns.<br><br>The restrooms are big and clean.  There is a cafeteria and snack stands throughout the zoo.<br><br>....| \\      _  , , , - - , ,  _  ,      <br>.../  , ` . - ' ` '             . _   \\ -  ;  ;  ;  , _    <br>..| ,  a  -   )   ) _         . ; .  (   ` - ` -  ' - '   <br>'  - - - ' ' ( _ / . _ ) - ' ( _ \\ _ )   2018", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/1sNQhipvpJO0lukFfM3_1A/348s.jpg", "caption": "Conservatory"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/B3ONHkhRr7l8iNpO8cKv7w/168s.jpg", "caption": "Conservatory"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/IQQi4vySuLiPVzCKlv_50g/168s.jpg", "caption": "Conservatory"}]}}, {"review": {"des": "Considering that this zoo is free admission, I am giving it four stars! Enrich your Lincoln Park Zoo experience by attending different events or start a conversation with the staff members to learn more about the animals and wildlife. Lincoln Park Zoo is a fun time, but not just because it's free admission.<br><br>Some fun events are Fall Fest, Adults Night Out, Daily activities with the animals (my favorite is the seal feeding time), Holiday Market, ZooLights, Donut Fest, Lebowski Fest, Summer Wine Fest, Music at the Patio, and much more! Some of these events are family and kid friendly, and some are adult only events. I just went to Fall Fest, and it was cool! There are staff members everywhere! They would love nothing more than to give you some insightful facts about specific animals! Ask them!<br><br>The animal selection is smaller because this is a free admission zoo. However, there is no shortage of primates or birds!! I was sad that I did not get to see the polar bear because it was getting relocated. Other than that, I loved learning and watching the different animals. These animals looked healthy and active. <br><br>Lincoln Park Zoo is a great place to learn and relax. This zoo is full of activities. I can't wait to go to another event!", "pics": null}}, {"review": {"des": "For my 600th review, I'd like to dedicate it to the Lincoln Park Zoo. This zoo is not only free, but easily accessible by foot or bus through multiple entry/exit points.<br><br>Since I visited the last week of July, MANY families were out and about during the weekday afternoon. Quite a few animals were hanging out. Thankfully, the weather was lovely in the high 70s with little humidity. <br><br>The zoo included many indoor exhibits for people to seek A.C. or to sit down. Restrooms were clean and orderly. <br><br>I was thoroughly entertained by the black bear who paced back and forth continuously for at least 20 minutes. Yes, I stood and watched for that long!<br><br>I also got a flat penny souvenir with the zoo's logo. There were many machines around the zoo to choose your print. Small souvenir carts were also seen throughout. One part of the zoo allowed for a wonderful photo of Chicago's fluffy clouds and city skyline. <br><br>I can't say enough good things about this zoo! Looking forward to coming again!<br><br>#48/2018", "pics": null}}, {"review": {"des": "The highlight of my trip to Chicago! I seriously cannot believe admission is free! The zoo is so well maintained and has such great exhibits. I went on a Thursday afternoon and it wasn't crowded at all. <br><br>We started off at the gorilla exhibit, and ended up going back before leaving because they were so interesting and entertaining to watch. I probably spent a good 45 minutes total in that exhibit haha. There were sooo many of them and it was awesome to get so close to them.", "pics": null}}, {"review": {"des": "free zoo  mid sept great time to visit .. not too hot or crowded.  I took the bus her and a girl got off the bus at the same time .. we got to chatting and made a new friend. She was from Italy visiting for the first time. I think this was my second visit to this zoo. We ended up sticking together throughout the zoo and the whole day. <br>        Love the primates .. we didn't have great luck for the cats .. everytime we walked up they hid. The animals don't have much space .. it's an small and old zoo. But It's another free thing to do in Chicago.", "pics": null}}, {"review": {"des": "Amazing zoo!...plus its all Free!, just pay for parking.<br><br>Park is huge and there's is plenty of animals to see. I think my feet was already hurting after the first hour. There is so much to see, great place to take the kids. My fav exhibit would have to be the gorillas, they were huge...and also the giraffes.", "pics": null}}, {"review": {"des": "This is a must-do when in Chicago because it has free entry AND there is quite a lot to see/do in there! Definitely recommended if you have kids but also recommended for adults to enjoy! I particularly enjoyed watching the monkeys, polar bear and giraffe. There is a variety of animals for you to see (from African safari animals to leopards/other cats to snakes/other reptiles)! I had a blast here!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/f9Uk1rLQE7sbTIICdccANQ/348s.jpg", "caption": "Penguins"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/-UVMK1EaJXlbEzPOeR8fJw/168s.jpg", "caption": "Rhino"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/pdUCXWTsmv16OHgfb7qicw/168s.jpg", "caption": "Flamingos"}]}}, {"review": {"des": "There's not much I can add that hasn't already been said about this place. Lincoln Park Zoo is a Chicago staple, and for good reason. It's a free Zoo, but this doesn't mean it is crappy. The zoo takes its' reputation very seriously. They have a good mix of exhibits, kept in good condition, easy to get to (tough parking though) and will keep you entertained all day. The holiday lights during winter are definitely worth checking out as well.<br><br>So whether you're a Chicago native, or a tourist, this place is worth checking out at some point, and there are reasons to return as well.", "pics": null}}, {"review": {"des": "Great little free zoo in the heart of Lincoln Park. Ive been spoiled by the huge amazing other zoos ive visited over the years, so at first it didnt seem like too much was here, however you have to appreciate this zoo is free and barely gets any funding. They work really hard to keep up the exhibits and enrichment for the animals with what they have and that shows. There is so much history here and they were celebrating the 150th anniversary with many cool nods to the past. The only downside is if you drive here, parking is $20 (unless you visit for 30mins to which its free). When we came it was a heatwave, so a lot of the animals were sleeping or inside, but the seal was sure enjoying itself in the water! Would love to come back when its not so hot!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/NxERe9qWxdaKulQwx4bpBw/348s.jpg", "caption": "Cool water sculpture"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/t39HPk3_kDpBYCNeNdiSfA/168s.jpg", "caption": "Giraffe baby"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/tgECcQyObKm9ju1bNQUqzw/168s.jpg", "caption": "Polar bear"}]}}, {"review": {"des": "The zoo is free, which is nice. There was a lot of construction when I visited, and it was hard to find the entrance that was open. That was annoying since I walked there. I also couldn't find a zoo map. So I only saw a few things and needed to go get lunch after a day of walking 8 miles around the city. I enjoyed the exhibits I did see, but would have seen more if I had quick access to a map.", "pics": null}}, {"review": {"des": "So I have to rate this 3/5 stars, because other times I've gone it's been nothing but an amazing time but this one occasion wasn't so pleasant. First off, i can't yell at the zoo for the weather but the next time I do zoo lights I'm going to to do it when it's a tad bit warmer because Lincoln doesnt supply heated lamps throughout the zoo. Number 2, I was really upset all the animals were not out. Unless they were inside an exhibit, which if I'm spending $20 bucks I wanna see SOME animals. Lastly I was upset about the lack of beer tents and how long the lines were. If I'm spending $20 I wanna have the opportunity to try the beers. They should've managed the lines better so everyone got to have a beer. I DIDNT GET ONE. Not happy probably won't go back during the rest of this winter but I'll definitely come back in summer. And I most certainly won't be back for the brewzoo lights", "pics": null}}, {"review": {"des": "Nice to go to in the summer when the animals are out. In the winter of course is a different story, because the animals are inside, and the buildings can become crowded. Parking is a pain, but it is free!", "pics": null}}, {"review": {"des": "There weren't that many animals out on the day that I went that is the only reason I took a star off. I love the Lincoln Park Zoo.  I have loved this zoo since I was younger.<br>I am going to enjoy taking my grandchildren and I hope they have the same joy I do when I experience the zoo.<br>When I go back with them I will update my review but you can't complain to much because it is free and there aren't many Zoos that are Free anymore.<br>So, I do say thank you for that!<br><br>As always folks...<br><br>Enjoy!!!", "pics": null}}, {"review": {"des": "Automatic 5 stars because Lincoln Park Zoo is huge and FREE! I'm used to paying at least $30 for zoos all over the country, so I was happily surprised that the zoo in Chicago is free! I expected a pretty small zoo, but this was actually a really nice and well-maintained zoo with a variety of exhibits. The zoo is open 365 days a year so it's a great weekend activity with friends or kids! The Lincoln Park Zoo is pretty vast, so definitely wear walking shoes! My favorite exhibits were the Seal Pool, Lion House, and Regenstein Center for African Apes.<br><br>Though I didn't try any of the food options offered at the zoo, I saw different places offering sandwiches, burgers, and salads. All throughout the park, vendors sell ice cream, drinks, and candy as well.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Kz5VB4zW07l-zJ09td7JsQ/348s.jpg", "caption": "Lincoln Park Zoo"}]}}, {"review": {"des": "Such a great zoo for being absolutely free! There are so many animals- zebras, rhinos, gorillas, and so much more. I love the otters here but they were unfortunately not there the last time I visited. It's a great place to go with a family (kids would love it here) or with a significant other for a day date. The park is pretty big too and a really nice stroll on a nice day. They have a few concession stands around the zoo where you can order popcorn, cotton candy, and snacks. They have places with benches and tables where you can order burgers and sandwiches.<br><br>I also love that they have adult only events here at night and the zoo lights are also super fun at night too! <br><br>Lincoln park is also a great area to explore after you're done at the zoo. Super close to the beach, restaurants, the garden and conservatory.", "pics": null}}, {"review": {"des": "Lincoln Park Zoo is one of the best free activities in the City.  This large, outdoor zoo is situated just north of the city and can entertain your kids for a whole day if you check out all the habitats.  There is a large pay parking lot, but you can usually find meter parking in the nearby neighborhoods.  It is also accessible via the red or brown lines when you stop at Fullerton and walk towards east towards the lake.<br><br>The zoo has a ton of animals for all over the world.  Some of the highlights include the giraffes, zebras, hippos and gorillas.  There is a large bird aviary along with a huge primate exhibit.  The lion den is under renovations, but was always a highlight.  There are many zookeepers doing exhibitions and teaching visitors about the animals and their habitats.<br><br>Food options are pretty basic, but there are plenty of vendors.  They offer standard hot dogs, sandwiches and salads.  Nothing is a stand out, so I suggest you grab lunch across Lincoln Park West at RJ Grunts.  Sadly, the zoo only offers Pepsi products so you can't get a Coke there.  Bring your own and save the $4 price tag for a 20oz.<br><br>Any trip to Chicago during the warmer months should include a trip to the zoo, so be sure to stop by!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/HLT5kC_cpB2jSYy4Gjdyog/348s.jpg", "caption": "A brief history of the camel toe - very educational"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/SR0nVXzQwtbaLAyX6YEcNA/168s.jpg", "caption": "Flamingos aplenty"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/4DMyDx983XLZrXpCpCH_EQ/168s.jpg", "caption": "Up close and personal with gorillas"}]}}, {"review": {"des": "Had an awesome time coming to this zoo on Labor Day weekend on Saturday. It was not packed at all and it is FREE beautiful zoo within a nice walking park. They had an assortment of animals and the layout was cool with most animal enclosures having multiple views from different sides of the park. All the animals were awake and hanging around their enclosures so there were lots to see. We saw everything from a sea lion, penguins, polar bear, giraffes, zebras, rhinos, monkeys, primates, gorillas, and much more. Only thing we didn't see were the lions, apparently they were inside, it was a hot day but we still had a great time. I definitely recommend stopping by the cafe at the entrance to grab a beer and some ice cream to walk around the park with. A great way to stay cool and see all the animals. Such a nice place to visit.", "pics": null}}, {"review": {"des": "You get what you pay for... and then some! It's free but awesome. This was one of the best zoo experiences I've ever had. Growing up in San Diego, the zoo was always so busy and it took a whole day to see everything. The Lincoln Park Zoo is in the smaller side but you get to see a lot! It took amount an hour and half to see everything I wanted. There were a lot of kids so it's perfect for those visiting Chicago with kids.", "pics": null}}, {"review": {"des": "It's been over 8 years since my first review of this place, and about 6 years since the last time I visited, but my feelings have not changed with this new visit. In the time since my last visit, I have visited several other museums (all of which charged for admission!) and none of them could hold a candle to the Lincoln Park Zoo.<br><br>This is an attraction that is not to be missed by visitors of Chicago. There's really no excuse when it's free--even if you can only go for an hour or two it's worth your while. They have all three of my favorite animals (red pandas, klipspringers, and bats, in that order) and some of the coolest exhibits I have ever seen.", "pics": null}}, {"review": {"des": "The Lincoln Park Zoo is a fine, small (35-acre) zoo that is an especially amazing experience given it's free. The place gets a bit crowded (because, you know, it's free), so if you plan to visit on a nice summer day, I'd recommend arriving earlier. (It opens at 10 am seven days a week.)  <br><br>Parking rates range from $20 to 35 per day, so I'd recommend you consider arriving by bus. The #151 and #156 stop right at the zoo's West Gate, so the CTA is a convenient option. <br><br>Plan to do some walking. I'm sure there's an optimal way to get through the park, but we didn't find it, and we ended up exerting a lot of effort for very little animal viewing. At the west gate, I'd recommend you head into the building with giraffes, rhinos, and ostriches rather than doing what we did, which was to walk outdoors north from the macaque monkeys. We ended up walking the better part of a half mile while seeing almost nothing. We strolled past empty rhino pens, then walked down a hill to find an empty polar bear pen and some \"exit only\" doors, and then retraced steps and continued the loop, only seeing a couple giraffes and a sad-looking polar bear pacing back and forth in apparent distress. If we'd had kids, that would've been an awfully long hike for very few animal sightings. <br><br>So, do a little planning ahead of time with the zoo map. As of 7/29/18, the map on the website isn't working (either on mobile or desktop), so you may want to find a paper map or print/download one before you leave: <a href=\"/redir?url=https%3A%2F%2Fwww.lpzoo.org%2Fsites%2Fdefault%2Ffiles%2Fpdf%2Finfo%2FVisitor%2520Guide_Web.pdf&s=4083626ef47c14c1ab81d1ba56bfa8d394f555a30ec5a0763ae9926c875b87ce\" target=\"_blank\" rel=\"nofollow\">lpzoo.org/sites/default/…</a> <br><br>Luckily, the rest of the zoo was a bit more accommodating and pleasant. The apes and monkeys were fun to watch. The wall of African cockroaches will make your skin crawl (in a good way). And the birdhouse had a lot of interesting and colorful species. <br><br>The Lincoln Park Zoo isn't as spacious and doesn't offer as much diversity as larger zoos, but the price is right and the place is fun, easy and well-maintained.", "pics": null}}, {"review": {"des": "Can somebody please explain to me how this zoo is free? Because the only other free zoo in the US that it rivals  is the national one in DC. I loved that it managed to exhibit animals from all continents and that there was staff present throughout the park to answer visitor's questions. What a fantastic resource for the city of Chicago! If only the parking situation were easier to navigate.", "pics": null}}, {"review": {"des": "Impressed that the Lincoln park zoo is free. We have been visiting Chicago for a long weekend and decided to check out. Gorgeous day and many families here and lots of animals to see and lots of exercise walking the zoo.   They had beer and wine for adults and snacks for purchase.  Plenty of animals and sitting areas to just relax and enjoy them moving around.  There is even a carousel that you can purchase a ticket and a children's train. Definitely a must do when visiting Chicago", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/8tnlQF7vubJLuOJS6yOK1Q/348s.jpg", "caption": "Welcome to Lincoln park zoo.  Pretty impressive as free to walk around"}]}}, {"review": {"des": "FREEEEE.<br><br>Just an introduction: zoos are sad, and animals look sad, and this may make you sad.  It's not humane society sad, or circus sad, but it certainly can make you question things.<br><br>Now - it's winter.  My husband didn't even believe me that the zoo would be open.  But, it was 7 degrees (Celsius) outside, and that's enough for me to want to unzip my jacket and look at some zebras.  This place was totally empty (Thursday during the day, in February).  Which meant we saw all the shows (gorillas, seals) easily, we could walk up to any exhibit with no one else around, and the zoo keepers in each area talked to us and answered any questions we had.  It was so much fun! They even have a free water station in the cafe, so it was truly, honestly all free.", "pics": null}}, {"review": {"des": "Why 5 stars? Because I just kept wondering how it was free.<br><br>   ---   ---   ---<br><br>I assume there's some kind of logical explanation as to why this zoo is free - it's probably paid for by the local tax payers, which makes it not actually as free as it seems. Or maybe there are plenty of generous donors that keep things running smoothly. I'm sure I could Google it and have my answer within seconds, but I'd prefer to live in a world where it's a mystery. It's more fun that way.<br><br>My Dad and I were in town for a couple of days and needed to kill some time before visiting Wrigley that night. I saw that the zoo wasn't too far away and that it was free, so my search for things to do ended pretty quickly. <br><br>The only bummer is that we made the mistake of visiting in the latter part of the afternoon, which meant that a decent amount of the animals weren't out. But we definitely enjoyed seeing the ones that were out. My Dad and I both love animals and being active, so walking around the zoo was the perfect activity to add to our day!", "pics": null}}, {"review": {"des": "Great way to spend the day, and for free! Went here while on a mini bae-cation and wandered to the zoo after grabbing lunch nearby in Lincoln Park. Spent a few hours exploring and seeing all the animals. Got to see a lot and see a couple animals put on shows for us. Very nice zoo!", "pics": null}}, {"review": {"des": "Great zoo! Amazing that it's free, so that's a plus! It's a small zoo, we got through it in about 90 minutes. <br><br>Personally my favorite exhibit was the gorillas, just watching them in awe on how smart they are. <br><br>The zoo is open daily at 10 am, and you definitely can't miss it when you are in Chicago area!", "pics": null}}, {"review": {"des": "First off, it's free so that's already a huge plus! It's open every day, so weather decides whether some of the animals are out or not. They have animals that are outside - lions, lynx, snow leopard. They also have buildings with animals inside - reptiles, primates. This is such a great place for a day adventure. You can have a date here, you can take your kids here, and you can stop by just to kill some time. If you don't want to pay for parking, there are so many buses that stop nearby (151, 156, 22, 36)<br><br>In addition, they have a bunch of fun events including adults night out<br>also have adults night out, donut fest, fall fest, and zoo lights!", "pics": null}}, {"review": {"des": "Such a clean and beautiful place. <br>This is a must for anyone coming to Chicago. First of all admission is free for everyone 365 days a year. What do you have to lose ?<br>I've been to many zoos and this one is the cleanest. It also seems like the animals are really being taken cared of. <br><br>There are different zones. And you'll have the chance to see all the animals at one point. <br><br>I came in April but the weather is still cold (40-50F). So at first many animals weren't out there. But some eventually were released out or came out. Not sure how it's handled. <br><br>I saw the polar bears, lions, panther, and many more. They were all pretty relaxed, no signs of being mistreated (that I can tell). Also the place wasn't too crowded which gave me the peace to walk around without squeezing between people to see the animals. There was plenty of space for everyone. <br><br>I saw lettuce planted everywhere on site. I'm assuming it's for the wild rabbits I see hoping around. <br><br>This place is just well designed. <br><br>Watching the animals interact is just soothing as well. I'm sure it will be a fun place for families with children.", "pics": null}}, {"review": {"des": "A free zoo that's better than most paid zoos! What's not to love?<br><br>Every time I visit Chicago, I make a point to come back to the zoo. They have all of the animals you'd expect to see at a zoo, but a few things really stand out to me. For one, the polar bears are incredible. We were able to watch when they got fed, and it was so cool!! There were 2 polar bears about 3 feet in front of us tearing into whatever weird animal meat they had. But watching how powerful they are was something I've never had a chance to see anywhere else! We had a similar experience with the monkeys, too. I'm no monkey expert, so I have no idea what we were looking at... maybe a gorilla? Or an ape? Either way, he was actually interacting with us through the glass, and that was SO neat to experience.<br><br>The only downside here is that it is always flooded with large groups of kids on school or camp trips. I can't get mad about it because it is a zoo, and zoos are typically made for children and not 30 year old men. But it can get very irritating when you get surrounded by 50 kids with no cares in the world....everywhere.", "pics": null}}, {"review": {"des": "The zoo is free! We went in the winter so not all the animals were out and about. They all can roam out if they choose but it may have been too cold that sunny day. <br>Still if you plan on going to the conservatory then it's worth a pop into the zoo next door. Both are free and make for a great day.", "pics": null}}, {"review": {"des": "I came to the Lincoln Park zoo with my family from the suburbs against my better judgment. But they wanted to see the animals.<br><br>This too is not my favorite for many reasons however today had some problems. Many of the exhibits were closed without any explanation. The problem with this is that you would walk for five minutes in a direction hoping to get to see the cats and only to find out that it was closed. This was the same for multiple exhibits.<br><br>I understand that this is a public zoo and that it should not be compared to other zoos. But when you pay for parking. $25. I think that you should have a decent experience of seeing some animals.<br><br>That said the polar bears were putting on a beautiful show for us like usual. That is always something worth seeing.", "pics": null}}, {"review": {"des": "One of the best zoos in the country. Also it's absolutely free admission, thank you Chicago.  Tons of animal exhibits from gorillas to lions to bears, etc.  You can easily spend 5 to 6 hours here next to lake Michigan.  Plenty of shade and indoor exhibits as well.  Awesome classic zoo animal carousel $3 per ride.  Great gift shop and food court.  Tons of play space, interactive experiences, and things to climb for kids.", "pics": null}}, {"review": {"des": "A great destination for anyone looking for something to do for a half day for FREE! I was expecting a really small place since it was free but it was pretty big with lots of twists and turns...we probably didn't even see all of it! The exhibits are pretty spread out so there was never a time where we had to wait our turn to see animals.", "pics": null}}, {"review": {"des": "Aside from attending the ZooLights 2016, my daughter and I rarely go to this zoo. Finding free parking is a challenge, and if you don't have a zoo membership, parking is over $20. The plus side is always about free admission any day of the week.<br><br>The children's zoo area has a climbing structure which my daughter enjoys.  This climbing structure, (which is suspended by wired protected around plastic) starts from one end of the room, to the ceiling, and ends at the other side of the room; not for children who have a fear of heights. Also, sea otter tank each of the opposite ends, and small reptile tanks to interest my daughter. Around this building is a an outdoor play structure and animal dens. Unfortunately there's no animals outside! (For example, bears are hibernating.)<br><br>Farm in the zoo area has 4 barns: 1.) Livestock barn was closed. 2.) The dairy farm: we were able to see a cow demo. 3.) Maim barn which is another play area: replica of John Deere tractor, tires to pretend plant 4.) Cracked chicken shell which my daughter and her father were able to be inside it 5.) Children's pretend play theatre. 6.) Bee and chicken exhibit was closed.<br><br>There's 5D simulation inside the information center building which is $6 per person, which we will go back for another day.<br><br>Although most of the animals were inside their respective buildings, it was still a fun time esp the primates and tiger areas.<br><br>There were a few areas which employees were taking apart to ZooLights during the day. That didn't spoil our fun!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/j4NUwvXKUdNJRqlz9W8blQ/168s.jpg", "caption": "Inside the primate area"}]}}, {"review": {"des": "This zoo is in the perfect place for a family day out. Plenty of animals to see and very clean environment. The kids love coming and its eazy on the pocket. You can bring a lunch or buy a bite to eat here. Very affordable and plenty of parking.", "pics": null}}, {"review": {"des": "This place is great mainly because it was free. It's a decent size zoo with a bunch of animals to look at including lions and a polar bear. The staff I encountered was helpful and friendly. If you're looking for something fun and cheap to do in Chicago, I would recommend coming here. It also has great views of the downtown skyline.", "pics": null}}, {"review": {"des": "Their zoo lights during the holiday season are just mindblowing! I came here with few friends yesterday and was in love with the lights. Idk how I didn't know about them before. <br><br>This is a perfect place especially for kids. Also there is no entrance fee or anything. <br><br>Also a great place for some social media pictures!!", "pics": null}}, {"review": {"des": "Zebras, camels, polar bears, oh my! Admission is free and snack kiosks are plentiful.<br>The polar bear swimming was most memorable. The giraffes peered at us through windows like WE were the caged animals. <br>It's tough walking around on a hot day though! Some animals weren't available to be seen when we visited. Many drinking fountains were not in use either, unfortunately!", "pics": null}}, {"review": {"des": "I drove an hour to visit here and it was worth while doing it. The place is large enough to enjoy several hours. They have great exhibitions for gorilla and monkeys that I can't see them closer than here at anywhere else. Gorillas and bears here were  playful to come very close and I enjoyed a lot. <br> They have indoor  and outdoor playground, carousel and small train for kids too.", "pics": null}}, {"review": {"des": "For some reason, I always expect my visit to the zoo to be familiar and the same, but our last family visit was incredible! We came to the zoo with only a couple hours before closing time, and instead of turning right at the far entrance gate, we turned left and the magic happened for us. We discovered so many nooks and crannies and hidden hot spots. And...so many new exhibits! <br><br>First and foremost the new penguin exhibit is fantastic, and the zoo has certain times of the day where you can actually \"play\" with the penguins up close and personal. Instead of the them being down in the dark, they are now out in the open, and I loved seeing all their little houses (caves). <br><br>Perhaps my most favorite stops was the African Journey Exhibit. Honestly, I was speechless and couldn't wait to see what was next and up ahead. I have no doubt this is one of their more expensive exhibits, and I am so grateful to the donors for making it possible...and free! From crocodiles to giant cockroaches (creepy), to spiders, to love birds, to fish, an African hutch, and the opportunity to see the giraffes up close and personal. I mean they are right there. Honestly, we will make this a regular stop the next time around.<br><br>There is a new outdoor monkey exhibit that we also loved...and how about the end of the day ending with a lions roar? <br><br>I am so grateful for the Lincoln Park Zoo.", "pics": null}}, {"review": {"des": "It's hard to beat this zoo. While most zoo's now a days cost you 20 bucks to get in, Lincoln Park zoo is free. The park has a new penguin exhibit that's really nice. But besides the penguins, they have pretty much every animal you want to see. The zoo is really clean and plenty of restrooms and benches around the park. The food and soft drinks are way out of price so bring your own. But overall I really recommend this zoo.", "pics": null}}, {"review": {"des": "I'm torn because I love animals and free admission, but in all honesty a lot of the animals seemed unhappy.<br><br>The Lincoln Park Zoo is an \"old\" style zoo with small enclosures. There was a good variety of animals (elephants, camels, giraffe, aardvark, African birds, chimps, gorillas etc), but most of them seemed rather depressed, whether it be that they didn't have enough space to frolic, the lack of personal space from tourists tapping on their glass, or the chilly Chicago weather.<br>For example, I was able to view the tiger just 3 feet away (through the glass), but even with a huge hunk of meat next to it, it seemed quite disinterested and sad.<br><br>I know space is limited for this zoo, as it's located in a big city, but I'm hoping someday it'll be more like San Diego Zoo with more space that better mimics the animals' natural habitats.", "pics": null}}, {"review": {"des": "How is a zoo smack dab in the city of Chicago not going to get five stars esp when it is free.<br><br>I came in ready to pay an entrance fee. I felt like a lucky fool. Unfortunately, most of the animals were not about the weather during my visit. I don't blame them, it was freezing cold. Anyways, the zoo lights are just an added bonus during the holidays and I thoroughly enjoyed my stroll around the park. I enjoyed being a kid for a day and i'd do it again.", "pics": null}}, {"review": {"des": "FREE! HUGE! Lots of cute animals. How awesome is this. Besides viewing animals, the zoo had a handful of other fun attractions like a $3 carousel, pumpkin patch, face painting, and a mini Ferris wheel- but it looked out of order. <br><br>Unfortunately, the zoo closed at 5pm and I arrived at 4 to find nearly all of the animals hiding and taking naps, so I missed out on the lion houses, zebra dens, ape sanctuaries, and a variety of different monkeys. However, I did manage to catch a glimpse of some flamingos and beautiful tiger enjoying a steak. <br><br>The zoo houses a selection of mammals, reptiles, birds, amphibians, and spectacular exhibits showcasing naturalistic habitats. Apparently this is one of the largest zoo-based conservation and science programs in the country! Though I wasn't able to see much, I had a great time and would recommend it to families that are able to visit earlier in the day.", "pics": null}}, {"review": {"des": "The Lincoln Park Zoo is so great! A big zoo that is free and available to the public. I was amazed it could exist, let alone be so clean, well-kept, and having a wide variety of animals.<br><br>We loved the birds and the macaques the best but the gorillas and all of the other critters were fun also. It wasn't as packed as I thought it would be for a weekend day, which is always nice. But I guess if the zoo is always free it helps thin out the crowds. My boyfriend and I have a tradition where we like to hunt for Mold-a-Rama, and we grabbed a gorilla from the primate house.", "pics": null}}, {"review": {"des": "What's better than a piece of wildlife, located so close to concrete jungle?<br><br>I am personally against the whole ideology behind a zoo but then I haven't done anything to change it either. So we are all at the same place. <br><br>Been here so many times now..sometimes in my solitude, other times with family and loved ones. <br><br>It's a lovely place. Peaceful and fun! During winters, sometimes the animals are kept in...but this place is all buzzing and in its full glamour during summers. <br><br>They keep coming up with different events- adult night, zoo lights etc.. be sure to check the Calendar online. <br><br>- Have a farm section including tractors and some fun activities <br><br>- Have carousel ride<br><br>- Have a cafe inside- starbucks, some eating joints. Good to keep you warm. <br><br>- Also have skating during winters...the whole place transports into a romantic wonderland at night. Skip millennium skating and come here. Highly recommend!!", "pics": null}}, {"review": {"des": "This is one of the best Zoo visits I've ever had as far as animal activity. It isn't a big zoo but they have some pretty exotic animals.  It was very close to our hotel and the admission is free.<br><br>You would think that aside from Smithsonian zoo, any zoo that has free admission would be little more than a a petting zoo, but is not. They have lions, polar bears, Siberian tigers, red pandas, meerkats, penguins just to name a few. We didn't have that much time to spend in here, since we had to check out by noon, so we did the main attractions. I just cannot believe how happy and active these animals are. We were very fortunate to be able to watch polar bears play! Their enclosure is very close to the public so we actually were able to see them swim up close and personal. It was amazing. <br><br>Then the male lion was very active, pacing back-and-forth. I think it was close to his feeding time so he was a little antsy, there is also a window for people to watch which the lion walked right up to, and got all up in our faces. He was awesome! I can tell he was a young one .I got the best video I have ever recorded. <br>We didn't get to see the tiger because they were cleaning his  enclosure and preparing it to leave his food. We also saw seal training and feeding. So cute!<br><br>I can go on and on how amazing this place is. I am sorry we left it for the last day and weren't able to spend more time in here.  This is The first place I will visit on my next trip to Chicago. it is also a very nice track for walking and jogging. Although I don't know how much jogging you would get done because you would keep getting distracted by all the animals. Amazing!!", "pics": null}}, {"review": {"des": "The only zoo I have ever been to that is completely free to enter! On top of that the employees/volunteers are so helpful. The Zoo is clean, accessible, free near by parking, and many different animals to see. In addition, there are other great activities near by.", "pics": null}}, {"review": {"des": "If you're in Chicago visiting, this is a FREE must see. The zoo is rather small, but it is clean, and easy to maneuver. There are often seasonal activities, too. <br>It is rather secluded from navy pier, but if you use the Parkwhiz app, there's really cheap parking three blocks away. <br>You can tell the animals are well cared for, and their habitats are well kept.", "pics": null}}, {"review": {"des": "Wow, we have been to Chicago multiple times and yet I have never been to this zoo, what a hidden gem. My family is an avid zoo and aquarium family, so usually when we are in a city we look to see if there is a zoo or aquarium nearby. <br><br>Upon planning for my last trip, I discovered our hotel was within walking distance to the Lincoln Park Zoo. We decided to take one day to walk through the Gold Coast and go to the zoo. It was a beautiful walk passing by old brownstones and the beach of Lake Michigan.<br><br>First positive, the zoo is absolutely free to the public. This shouldn't be a free zoo! The quality of the exhibits and the diversity of the animals is awesome for a free zoo. The location is also great. You have the zoo, a park, and a conservatory all in the same location. You are also across the street from the beach on Lake Michigan. <br><br>This zoo has large animals staples like giraffes, lions, tigers, but one that many zoos do not include are rhinos. It was cool to see something that you usually don't see at other zoos. There were other animals as well, especially in their more specialized exhibits that focus on the Amazon and African regions. All of the buildings are neatly put together to help put you into the surroundings of the animals. <br><br>We did and stop to eat lunch here and it was actually pretty good. I didn't mind paying a little more since I got into the zoo for free and the food was actually pretty good. After we got through the whole zoo, we walked down the coast of Lake Michigan and went to Navy Pier. A wonderful day indeed.", "pics": null}}, {"review": {"des": "A FREE zoo. Let that sink in for a moment. <br><br>.... Still sinking in?<br><br>Lincoln Park Zoo is a FREE zoo that still contends with many zoos around the country. And it's located downtown -- a quick L or bus ride will get you and your family there. <br><br>I still remember when I first moved to Chicago, I was waking along the shoreline and discovered the Rookery (now replaced as a garden I believe). As I wound my way through, I was funneled (unbeknownst to me) into the Lincoln Park Zoo. One minute I'm admiring Lake Michigan and the next I'm standing next to a couple of elephants. Talk about an out of body experience!<br><br>This moment has defined the Zoo for me ... an amazing resource, educational outlet and escape for the people of Chicago. <br><br>Say what you will about it. As a FREE place you can go any day and expand your horizons while supporting the education of others and helping children understand the world beyond the city streets, this place deserves nothing less than 5 stars.", "pics": null}}, {"review": {"des": "Adults night out event. <br><br>We had a blast at this 18 and older event. Drinks food and lots of cute animals. We got a chance to go to the pumpkin patch, corn maze, ride the carousel and Ferris wheel and even do a boogy on the dance floor. <br><br>The cute animals made the night from penguins to large cats we saw them all. Some were napping for the night which was a bummer but overall great night.", "pics": null}}, {"review": {"des": "Such a nice zoo! It's free admission which is awesome so you only pay for what you drink and eat. I enjoyed it visit to this zoo and recommended to visitors and families.", "pics": null}}, {"review": {"des": "This is an awesome FREE zoo! Perfect for kids and adults. There is a great family zoo within the LP Zoo for younger children.<br><br>Zoo Lights is such a fun winter activity. The zoo opens at night during the holiday season with... you guessed it!! AN EPIC LIGHT SHOW!! Definitely an awesome attraction to see if you're in Chicago for the holidays!<br><br>Get yourself over to the LP Zoo and check out the free fun!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/gTlUFpnxFzucN317g9xQtQ/348s.jpg", "caption": "Sleepy lion"}]}}, {"review": {"des": "As many times as I have visited Chicago I had never been to Lincoln Park Zoo.  My son really wanted to go so we made it happen.  I must admit I am not a big zoo person.  Makes me sad to see animals in cages.  I wasn't expecting much being free and all but it was a really good zoo.  The zoo wasn't too crowded and most of the animals were out.  We spent several hours exploring the park.  My ten year old son did not want to leave and asked to go back again the next day.  Def a must visit if you have kids.", "pics": null}}, {"review": {"des": "I mean, come on. This is the best free, city zoo I have ever been to.<br><br>Zoos, for the most part, depress me. It's like a sad no kill animal shelter. <br><br>Lincoln Park Zoo is such an exception. The keepers and directors seem to really care about the wildlife and the exhibits. I love the old and original architecture. It's truly the gem of Chicago. <br><br>Because it is free and exponentially easier to get to using public transpo, we visit LP Zoo way more often than Brookfield. <br><br>We became members last year and that has been worth it so far - with a sneak peak at Zoo Lights (even though it was monsoon raining).<br><br>Food prices are a little high - but you can bring in your own food, so pack smart.", "pics": null}}, {"review": {"des": "It is a city benefit to keep this Zoo free for young and old. It does rejuvenate the city with many residents use it as their morning jogging routine. It joined together with the Lincoln park and make this huge area of recreation. The park included the zoo, park, north adventure beach, nature museum, Alexander Hamilton Monument, chess pavilion, and history museum. <br><br>The collection is not the rare animal but it is a beautiful collection. The animals classified as family zoo, African animals, Arctic, Bird House, Monkey Forrest, reptile house and more. I enjoy the most are the reptile house an bird house. The reptile house has some colorful animals crawlers. The bird house simply bird roam freely inside the house. <br><br>The feedings time make the animals lively. The monkey is the most active among the animals. Thank you for keeping this Zoo free and accessible to public.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/aHoTsevR44XywpZXMdDcMA/348s.jpg", "caption": "Can you see me now"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/AJ2P6uy1rKzHr4Y9QS5vYg/168s.jpg", "caption": "This snack look like sun glasses on top of the head."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/hLjVUdfw8Ml8rXu97XUrBQ/168s.jpg", "caption": "Leopard"}]}}, {"review": {"des": "A FREE zoo? That's practically unheard of these days.  Lincoln Park Zoo is awesome!<br><br>The zoo is free, but you do have to pay for parking.  There is some free street parking available nearby, but you will have to get there early and search for it.<br><br>The zoo is open 365 days per year and the hours are:  weekdays from 10 a.m. to 5 p.m April to October,  and 10 a.m. to 4:30 p.m. from November through March.  On weekends from 10 a.m. to 6:30 p.m. The only exceptions being Memorial Day and Labor Day when their hours are 10 a.m. to 4:30 p.m.<br><br>There are several entrances to the zoo, however, my favorite way to enter is through the nature Boardwalk where you can stroll through native plants and see native birds, fish, turtles Etc.<br><br>Lions and tigers and bears oh my!<br><br>You will see animals from Africa to the Arctic tundra.  Giraffes, rhinoceros, zebras, polar bears, penguins, monkeys, gorillas and apes.<br><br>My favorite part of the zoo is the waterfowl Lagoon and the McCormick bird house.<br><br>With exhibits both indoor and out, you have an excellent view of the animals.<br><br>They also have options for food anywhere from snacks to a full service menu at The Patio at Cafe Brauer.<br><br>Don't forget to stop in at one of the stores where you can choose from a selection of wild things that you can take home with you.<br><br>Plan on spending at least a couple of hours so you can take your time and enjoy your day at the wonderful Lincoln Park Zoo.", "pics": null}}, {"review": {"des": "First of all, this is a free zoo... Yes, free admission - you read that right!  They get you elsewhere, but how amazing is that?  In addition, it's one of the cleanest zoos I've been to...<br><br>I was recently in Chicago with my 4 year old daughter, and our visit to Lincoln Park Zoo was definitely a highlight... we headed over with my sister and bro-in-law, my infant niece, and my cousin.  Once there, we met up with the one and only Colleen C + her son who became instant BFFs with my daughter!  So - needless to say, we were in great company all around!<br><br>In addition to that, we were somewhat limited on time but made the most of the visit, which included some time at the petting zoo, feeding the cows, plenty of play in the indoor barn including \"eggsploring the nest,\" tractor, wind tunnel, theater, etc... After that, we walked to the main area for a train ride and snack (popcorn and pretzel), and then saw plenty of other animals including polar bears, zebras, monkeys, rhinoceros, penguins, giraffe, and more!<br><br>It was a beautiful morning during our visit, but it wasn't too crowded.  As mentioned above, the grounds are well kept, and we found all of the employees and other guests to be friendly.  Whether you've got kids in tow or not, this is a great place to check-out.  I look forward to returning on future Chicago trips!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/W5yYWw_LgiYPjMKk5q2kQg/348s.jpg", "caption": "Choo choo- fun on the train with Megan K"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/x4cPMnidAwMBi9bH87MlFQ/168s.jpg", "caption": "Nothing like connecting with new friends at the zoo!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Xc2dbI5e8NUkX_tQc_SSVA/168s.jpg", "caption": "Tractor fun at the barn"}]}}, {"review": {"des": "This is probably one of my favorite favorite places to not only take visitors, but also myself when I have downtime and want to be outside. The zoo is open year-round everyday and is FREE. It is nicely spread out and well-kept, especially for being free. <br><br>There are several entrances/exits throughout. Not to be missed (personal favorites): snow leopard on the backside of the big cats building, sea lions (near the main entrance off Stockton) and penguins. <br><br>I never see the polar bears :( there are several exhibits in the big cat building currently under renovation.", "pics": null}}, {"review": {"des": "Love this place! It's more and more beautiful every time I come. It's extremely clean for being so busy and the staff is kid friendly and patient!", "pics": null}}, {"review": {"des": "While LPZ isn't what I'm used to (Milwaukee County Zoo) it has its own charm and significance.  It's much smaller than a lot of other big city zoos but it's free and they do a lot of zoological studies and preservations.  It's definitely worth spending some time in.", "pics": null}}, {"review": {"des": "Five stars for a free zoo. I've been here a couple of times over the span of about 10 years. Each time has been enjoyable. The fact that it's free for people in the middle of a big city is fantastic. I would highly recommend visiting at least once.", "pics": null}}, {"review": {"des": "One of the best attractions in Chicago! The zoo is free! It is well kept. We saw quite a few animals despite how cold it was. It's well laid out. The polar bears were walking around. The monkey exhibit is amazing!!!!! Some animals were not available (lions, seals), but it's ok. We saw the wolves up and walking around. The red panda is ADORABLE. The Macaque were hilarious. We did not visit the barn. It was a quick visit, but we enjoyed it! The staff was very friendly and offered a lot of information. We really enjoyed it. I'd love to see it on the summer with all the trees green.", "pics": null}}, {"review": {"des": "Free year round. When we went this time around there was a fall festival going on. All the activities for this was fairly cheap. $3/ticket. Each activity had it's own cost. 1-3 tickets. Corn maze, bounce house, slide, train ride, etc. All the proceeds goes to the zoo.<br><br>It's pretty far from the train station but well worth the walk if not take the bus. Once you arrive the entrance is not noticeable. You have to pass the main building and there's an entrance to go in. <br><br>The exhibits were very nice. Some indoor some out. There's a bird exhibit where you get to interact with them. They fly around you. Pretty cool. <br><br>Very stroller friendly and family friendly.", "pics": null}}, {"review": {"des": "Looking for something to do for little to no money? Why not head to Lincoln Park Zoo! It's absolutely free for entrance. You just walk in and enjoy!<br><br>I've been here twice already and it's nice and clean. Everything looks well kept for a free zoo. There are animals held inside buildings and then there are some outside. I was surprised that they had a lot of cats, i.e. mountain lion, bobcat, tiger, etc. I think the best part about the zoo (besides the giraffes) is the primate exhibit. The monkeys and gorillas are so fascinating.<br><br>It's a fairly large zoo and you really can't complain since it's FREE. Definitely check it out if you're looking for something fun to do in Chicago!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/NqobeBzjiBA0mjUm1ECTgQ/348s.jpg", "caption": "Pretty sign at the front"}]}}, {"review": {"des": "Honestly, who doesn't love the zoo?! <br><br>The Lincoln Park Zoo is smaller than others that I have been too, but it is pretty impressive in terms of the animals that call it home. <br><br>Admission is free! <br><br>It's a great place for adults who don't want to spend money and kids who want to see some animals, but that part is fun for the adults too. Parking is easy, as it has it's own parking lot. <br><br>In the winter they decorate with Christmas lights which adds a nice holiday touch. <br><br>I totally recommend coming here! And once you're done in the zoo you can explore the rest of Lincoln Park or wander around the nearby downtown.", "pics": null}}, {"review": {"des": "Me and The Bestie came here on Saturday for a fun girl's outing. The zoo lights were so beautiful. I was so excited to see that Lincoln Zoo had made a few new changes. There were more lights and changes to the set up from the previous years. The weather was amazing which explained why it was super jam packed. But overall, it was excited to see the beautiful colorful flashing lights throughout the zoo. Why not come out and enjoy a fun fill night with the family or friends. FREE ADMISSION", "pics": null}}, {"review": {"des": "It's a free zoo. Find watching the animals relaxing when zoo isn't crowded. Some of the indoor exhibits are a bit dated looking and some of the animals habitat areas are undergoing rennovation. I think it's interesting how it's within a larger park and neighborhood. Buses and other businesses are not far away. Experience fluctuates a lot on the season.", "pics": null}}, {"review": {"des": "It's a jungle out there!  Simply the best!<br>Even many homosepians could be seen on the grounds.<br><br>With 35 acres of land, over 1100 wild animals  & free admission, this is the best deal in town. <br>Even on a cloudy day, Lincoln Park Zoo can brighten up your day.<br><br>I never get tired of this place & often come for a leisurely walk.<br><br>A walk around the nature Boardwalk will lead  you along the dairy Farm, before arriving at Cafe Brauer, and the South entrance to the zoo.<br>Take a look south to be rewarded with one of the most picturesque views of the city skyline.<br><br>On the east side of the lagoon,  a lace like structure where you can practice yoga, doubled as public art.<br><br>As the name implies, the Zoo is located in Lincoln Park, next to the lakefront. <br>Having no admission fee and multiple entrances, gives the illusion to be one and the same; it is easy to not notice when leaving the park and entering the Zoo.<br><br>The garden and lagoon by the flamingos display is an awe inspiring sight.<br>Walking through the ape house brings a smile to everyones face. The birds house is a must and big cats gives every one a hard time picking their favorite.<br><br>One of the best ideas of Chicago's founding fathers and one every visitor will remember.", "pics": null}}, {"review": {"des": "This place is pretty fun and it's free ! <br><br>My favorite was the Lion and Gorilla exhibits.  You are able to get pretty close to them and see them in action!   The lions were eating and the jaguar was roaming around in its cage.   The gorillas were very entertaining...  I think I could of spent over an hour just watching them. <br><br>The rest of the zoo consists of zebras, giraffes,polar bears, rhinos.  It is a pretty big zoo and if you walk a little further down to can see an amazing view of Chicago!  Great spot for photos on the bridge. <br><br>Kids will love the carousel area and face painting.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Bcb6psXyEDhhVkdS_qRTIA/348s.jpg", "caption": "Puma"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/jNBbmif2E_U71bCg5hpcxw/168s.jpg", "caption": "Lion"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/wykc50EqUF-Dx95uaV2oQQ/168s.jpg", "caption": "Monkey"}]}}, {"review": {"des": "Great free activity for walking around and looking at the animals.  Decent sized park and was super surprised that it cost nothing to get in.  Great places to sit down and have a bite to eat or chat.  Will definitely be coming back with my family next time I come to Chicago", "pics": null}}, {"review": {"des": "My besties and myself came here for Adult night at the zoo, adults 21 and older can purchase alcoholic beverages (wine, champagne or beer only) and drink and eat and hang out with the zoo animals. We danced in the rain, listened to awesome music. We thoroughly enjoyed ourselves. Parking was $30, we did not appreciate that.", "pics": null}}, {"review": {"des": "Such an awesome zoo with so many animals to see. It's hard to believe it's free considering how much it has to offer. My wife and I have been here twice, and it hasn't disappointed. The grounds and enclosures were very clean.", "pics": null}}, {"review": {"des": "4.25/5 polar bear!<br><br>so i've kinda disregarded this in my brain every time i've visited..like, oh, it'll be a dinky zoo. when in fact, i should have though oh! it'll be a dinky zoo! and that's a good thing!<br><br>first, free99. so if you have little humans with you, you have a little time to spend in between other things, you just want to go for a walk because it's not all frozen, it's a good spot to consider! you quickly realize how small a space it is, but also it's chicago, not the savannah so you just have to manage your expectations. i actually really liked it, i was able to spend about an hour before my lunch spot opened up. you can get pretty close to some apes (not being super specific here), and then also up against the glass with what seemed to be a pretty active polar bear. hello to you too, buddy. <br><br>the day i went there were all kinds of field trip groups happening too, so i'm happy that folks are really putting the space to good use. and don't miss out on the plants as well - the greenhouse space has a small section that tries to present a little \"jurassic\" experience!", "pics": null}}, {"review": {"des": "What can I say - my all time favorite destination in Chicago and it is FREE. I love that it is close to downtown Chicago, a true gem of the city.<br><br>Usually Zoos make me sad but this one is an exception. Keepers and directors seem to really care about their animals and the zoo is kept in really good shape.<br>I really like the mix of old and new architecture and it's easy access to public transportation. I strongly advise to use it as parking can be really difficult especially during the weekend and holiday season. Keep in mind this is a residential area close to one of the few public beaches in the Chicago area so a lot of visitors come to this part of town.<br><br>One of my favorite times of the year is the holiday season and the Zoo lights are displayed.<br>Food and drink prices are a little bit high but you can bring your own food, so take advantage of it.", "pics": null}}, {"review": {"des": "What a nice zoo. Not too big. Very well kept with beautiful horticultural displays throughout. <br><br>The zoo itself is free but the parking ranges from $20 to over $30. Still a good deal. The staff is very approachable, friendly and knowledgeable. <br><br>We were super entertained by the family of gorillas where the youngsters put on a twenty minute show of non-stop antics to the squealing delight of the summer camp visitors. <br><br>The display mixed old school historic buildings with modern zoo layouts. This place felt very doable. <br><br>Worth the trip into the city!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/X13a2I09NGgmaWI7mNHbpQ/168s.jpg", "caption": "Close to the city center"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/yifV4GXOhlxm-5ifRZiMIw/168s.jpg", "caption": "Great apes"}]}}, {"review": {"des": "So I grew up in Chicago and didn't even know the Lincoln Park Zoo was free till just now! It's situated between downtown and Lake Michigan and kinda hard to get to on foot if you're like me and haaaate driving through Chicago traffic (not to mention nightmare parking anywhere you go!). You can take the Brown Line CTA L train to Sedgwick and you'll have to walk about 15mins before reaching the zoo but it's well worth the extra steps! Not entirely sure where you would park if you decided to drive, there's street parking around the area but may be hard to find especially with how crowded it can get. There's also the option to ride your bike through or take the bus (there's a bus stop on the side close to Lake Michigan). <br><br>For a free zoo, there's not much I can complain about, especially since the location itself is kinda limiting. The zoo is missing a lot of popular animals like elephants and my personal favorite the leopards and jaguars, but besides that, this is a superb zoo! There's plenty of shade so you're not walking in sweltering heat the entire time. The free zoo makes up for its cost in food. The cafes we stopped by averaged around $9 for a meal and $4 for drinks (milkshakes, floats, sodas). We had a very enjoyable experience and was able to see all the animals under 3hours and hit up the gift shop which was also beyond compare. The highlight of our trip were the polar bears who were out in the heat (sadly) but they had a huge block of ice with fish in it that they were trying to get at which was pretty cute to see; also seemed like the main attraction when you see the crowds these bears attracted. <br><br>If you're looking for a cheap activity (I mean, it's free, what more could you ask?) I highly recommend the Lincoln Park zoo! It may be underwhelming compared to other zoos, but you can't ask for much all things considered. Very accessible for those with strollers and wheelchairs with plenty of places to rest up and take breaks. May be more packed than one would like, but a great experience overall.", "pics": null}}, {"review": {"des": "Wasn't sure if I should stop by the zoo since we had been to so many zoos before but I'm glad I did. It's big and it is free. Plus it is so fun to be up and close with the animals.", "pics": null}}, {"review": {"des": "This zoo is free and has many animals to see. When I went, many of the animals weren't out and the ones that were didn't seem too happy. They were hiding from people facing the walls or pacing back and forth a lot. Please donate to these animals to help ensure they receive the necessary care! They have an awesome 'Adopt an Animal' program. I 'adopted' the two animals that stood out to me the most.", "pics": null}}, {"review": {"des": "This zoo was awesome. We had very close animal encounters that we've never had. Glass and inches was all that separated us from them several times!! Oh, and it's free!!", "pics": null}}, {"review": {"des": "It's free and entertaining for everyone of all ages to enjoy. It's nice to plan out the parking however as it's difficult in this area which is the downside. Then start somewhere so you can see everything without going back and forth unless you don't mind the walking in circles to see everything in the zoo. Bring snacks and drinks with light baggage to help along the way.", "pics": null}}, {"review": {"des": "Lincoln Park Zoo is such an excellent zoo. I was so shocked that they do not charge for entrance. All of the exhibits are high-quality and such a treat to see. My absolute favorites were the gorillas, seals, and tigers. I'm sure it varies by day and time, but all the animals in these exhibits were very active. <br><br>My friends and I were also able to get our pictures taken in the zoo with a free print out. This service is very unheard of for free and really brings great value to the zoo. You can find the picture station in the lion building of the zoo. <br><br>There are several additional activities that you can pay for once in the zoo. A few of these activities include: restaurants, ice cream stand, gift shop, and face painting. In regards to the gift shop, I found their prices very reasonable compared to most zoos. You can purchase a medium sized stuffed animal for $7.50. A good value knowing that most zoos charge $20-$30 for similar products.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/8VpEypq1q95-jtL3JNzKcA/168s.jpg", "caption": "Zebra"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/_zlhD-yLmfi-v4jSgZK_NQ/168s.jpg", "caption": "Tiger"}]}}, {"review": {"des": "Zoo is free. Parking is $25/vehicle. Heard parking lot can fill up so keep that in mind. <br><br>Beautifully maintained grounds with the usual zoo animals and plenty of picnic pavilions and a bunch of scattered food options (typical stuff--hot dogs, ice cream, etc.) We saw the lions, snow monkeys, rhinos, bald eagles, snow owls, penguins. Some of the animals were MIA, bummed to not see the polar bears. Skipped the indoor buildings (reptiles, birds).<br><br>The zoo flowed into the botanical gardens (also free), a greenhouse building with three different climate rooms. <br><br>Really nice way to spend a few hours in nature.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/dIzln9Se4S1roYkc-q05JQ/168s.jpg", "caption": "Biggest lillies I've ever seen!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/97A3dwmn9NQAj89U5mbb5Q/168s.jpg", "caption": "Rhino"}]}}, {"review": {"des": "If it wasn't free, I'd give it one star. Visited on a Saturday during the summer when the zoo is open until 6:30, however most of the indoor exhibits were closed by 4:30. The primate house is empty and under construction. More than half of the outdoor exhibits were empty. The African section of the zoo was only three rhino cages. Did a ton of walking with my 2 year old who was really disappointed every time we'd walk up to an empty exhibit. The only cool exhibit was the monkeys, but it was also the most crowded one and viewing was difficult.", "pics": null}}, {"review": {"des": "Its amazing that this zoo is remaining being free. I have been here many times but still want to come back again and again, and I want my kids to appreciate that they live in such a great city. We are so lucky to have this zoo. I don't understand all these people who are complaining, please take your negativity somewhere else (hint politicians), but leave this amazing zoo alone. We will enjoy it!", "pics": null}}, {"review": {"des": "I came here to see the new baby camel, Alexander Camelton!  <br><br>Seriously that is his name!   <br><br>Unfortunately he did not hail the curtain call to shimmy his two humps and take center stage in his large outdoor fenced in area.  His mother (or father) not sure of the gender was on site eating some hay and wandering around..s/he grunted a few times-maybe calling his name-who knows...so I will return in search of Alexander Camelton on May 9, 2017-HIS FIRST BIRTHDAY!<br><br>Zoo was peaceful with plenty of shade and nice paths that circle around different areas of animals.  <br><br>A woman with a satchel full of maps at the entrance spoke to me a bit about Alexander Camelton and how to get to his location. (Ironically she had recently seen the play \"Hamilton\" in Chicago!)  Anywhoo...<br><br>Lots of wild animals to see-zebras, hot pink flamingos, lions, kangaroos, gorillas, swans, primates aka monkeys, etc.<br><br>Kids can get face painting and tattoos henna style or regular waterproof stick on, popcorn and candy for sale in an old Model T Ford (I think), cotton candy, lunch at several places or bring your own and use the picnic pavilion.<br><br>FYI-The Patio at Cafe Brauer is NOT open until April 29, 2017.  According to the training manager who I spoke with today when trying to get lunch there. He stated that they will have cocktail specials and live music including jazz every Wednesday from 5:30-7:30 pm.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/AEXD-KVRDT_ArFYpoCUx-A/348s.jpg", "caption": "All about the two humped camels"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/SX2jBiPsoahVwhOJ10-5mA/168s.jpg", "caption": "View of Chicago Skyline from the Patio at Cafe Brauer Cafe"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/7XjkTTrgL4XkdugscN2SNQ/168s.jpg", "caption": "Henna Tattoos"}]}}, {"review": {"des": "Nice zoo especially for free. Laid out good with great site of most animals. Make sure you check out the bridge right outside the South Gate of the zoo for great sky line views of the city.", "pics": null}}, {"review": {"des": "A world class zoo in the city and it's free! I used to visit here quite regularly when I lived in Lincoln Park. It's in a nice area with an amazing view of the city skyline. There is a large green belt area on the west side entrance that is great for picnicking during the warmer months. Depending on which entrance you go through will dictate the route you follow; I recommend the north entrance as you can hit up the conservatory and see an array of flora. I'm partial to certain animals so I tend to spend more time in certain area than others but there is a lot to see here and you can easily spend a day plus some walking around and soaking things in. The large cats are awesome; lions, pumas, leopards, and lynx are among the most crowded pens. There is an African area with rhinos, zebras, and a giraffe. The mammal exhibit of gorillas, chimps, and monkeys is also a fun place to spend time. The winter is obviously cold but they usually have an ice sculpture installation. When it's said and done no review will suffice you just need to visit and get the experience first hand.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/aJIMzvHcLrKSHGLzw6ELyA/348s.jpg", "caption": "Polar bears"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/EW2Kyddg-uoieBrqqedE9g/168s.jpg", "caption": "Tawny frogmouth"}]}}, {"review": {"des": "Big zoo and it's FREE. I saw lions, gorilla, monkeys, birds, snakes, spiders etc. that's great place to spend time with kids", "pics": null}}, {"review": {"des": "Free entrance which makes Lincoln Park Zoo a must go place for tourists. Parking was $20 for an hour so that I must usually find some free street parking spots nearby. The zoo was pretty big, primarily when it was a city zoo. However, I personally thought the zoo still had many things that could be improved. Frankly, there were not so many animals to watch as I wished there was elephant, crocodile, or bison. I also preferred Polar Penguin to the Madagascan Penguin living in the zoo. Despite all of that, I believed this zoo could please everyone, from Orchid lovers with Lincoln Park Conservatory to bird lovers with McCormick Bird House to even reptile lovers. There were also polar bears, sea lions, rhinos, tiger, lions, zebras, and camel. One thing which reminded me of the Southern ranch was the Main Barn where I could pretend to hatch from eggs, harvest vegetables or steer the tractor at the heart of the exhibit.", "pics": null}}, {"review": {"des": "Okay, parking isn't cheap, nor is food, drink, carousel & train rides, etc., yes.  And I've never visited when there was no construction and no closed exhibits, granted. But it is kind of amazing in this day and age that the zoo itself is entirely free.  If you take public transportation or find street parking along the west side of the zoo/park even better.  The nearby conservatory, nature house and arboretum could easily fill an entire lazy day with an unwired, healthy, dare I include educational, outing (writing a review on Yelp is a wired activity I know but that is not the Zoo's fault). [Turns out there is a virtual submarine \"ride\"] When you go with kids and see the excitement and magical twinkle in their eyes of an experience sans screens, you feel a magical twinkle in your own eyes.", "pics": null}}, {"review": {"des": "This place is great mainly because it was free. It's a decent size zoo with a bunch of animals to look at including lions and a polar bear. The staff I encountered was helpful and friendly. If you're looking for something fun and cheap to do in Chicago, I would recommend coming here. It also has great views of the downtown skyline.", "pics": null}}]}