{"name": "little-bucharest-bistro-chicago", "reviews": [{"review": {"des": "A gem of a local restaurant with interesting Romanian and other European offerings.<br>We started with the calamari which were not quite as crisp as we would have liked, the oil might have been a little colder than it should have been but they did have a good flavor and were tender.<br>Tried tripe soup for the first time in my life and it was quite interesting, sort of the texture of very soft calamari but it had no hint of off flavor as I have heard tripe can often have. It was in a light yellow almost creamy type of broth but not thick. Very traditional Romanian dish as I understand.<br>One of us ordered the beef goulash which extremely tender pieces of beef, lots of pearl onions potatoes and carrots. It was quite rich.<br>Two of us had Metitie (sp?) The traditional Romanian lamb (and maybe pork or beef) casing free sausages. They were well seasoned with a fair amount of spices and garlic flavor. They were served with either french fries or roasted potatoes but could have used a softer side dish like polenta to bring some creaminess to the plate.<br>My order was the paprikash half chicken. It was extremely tender to the point where small bones were hard to remove from the meat itself, but it had tremendous flavor, very creamy with lots of sour cream, pearl onions and other vegetables. It was served with the traditional polenta with crème fraîche and feta on top.<br>The owner greeted everyone coming in and we saw him giving the traditional warmed and flaming fruit spirit to people at the end of their meal. One of our party was celebrating a birthday and he brought us a free bottle of Romanian wine to take home.<br>Highly recommend if you want some well seasoned and interesting fare with touches of home cooking and family atmosphere.", "pics": null}}, {"review": {"des": "Being Romanian-American (from LA) I couldn't wait to check this place out. My expectations were completely satisfied. <br>We ordered the mititei plate, a side of mamaliga (polenta) and Romanian red wine. For desert, Romanian crepes. The food was tasty, fresh and  authentic. <br>At the end of the meal, the owner came out with Romanian plum brandy and sour cherry liquor (on the house). What a great way to end an amazing meal. My boyfriend speaks Serbian and I speak Romanian and the owner spoke to us in both languages. Such a sweet man. I am really looking forward to coming back, not only for the food, but to hang with the owner and have a shot of Romanian liquor with him.", "pics": null}}, {"review": {"des": "This restaurant used to be on my route from work to home for years and every time I'd pass it I wanted to make plans to go there. There was something very authentic about it just looking from the outside (is know, I'm from that region) but it was never to be. Kids, work, you know how it gets... <br>so years later my wife and I started restaurant hopping with another couple, trying out all different cuisines in the city and this one popped out of my memory. We made reservations and went one weekday evening and it was as good as I imagined all these years driving by it.<br><br>This is a family owned and operated place with mom doing the kitchen duty and dad and daughters busying around serving and entertaining the customers. They're from a border region between Serbia and Romania so if you speak those languages you'll feel especially at home but everyone is welcome and treated as a guest in a place where that still means something.<br><br>Food is fantastic and very authentic. If you're from this region I suggest you try their sarma and tripe. If you're not, start with Gypsy Platter which contains a little bit of everything so you can sample dishes and make up your mind in what you like. For drinks I highly recommend Romanian beer or wine.<br><br>I haven't tried their pork and lamb roast days but will definitely come back to this place!", "pics": null}}, {"review": {"des": "We had dinner here and it was great! This is the place where you can find delicious homemade traditional dishes and a nice atmosphere. Highly recommend for a nice dinner, special occasion or the holidays!", "pics": null}}, {"review": {"des": "Great family restaurant, yummy hearty meals, sausages Mitetei were amazing, Meatball Soup, Chicken Soup, Cabbage Rolls, Polenta, Goulash, Drinks all was great and the owner/host was very friendly and fun.   Highly recommended.", "pics": null}}, {"review": {"des": "On a busy Saturday night on Randolph street, we decided to go off the beaten path and check this place out. The food was amazing and the staff was warm and welcoming! At the end of our meal the owner came to our table and gave us a true Bucharest experience. Would definitely recommend for a great meal and a memorable experience.", "pics": null}}, {"review": {"des": "Came in for my mom's birthday on a Sunday and it was perfect! Delicious and huge portions of food. Authentic music set the mood and kept everything upbeat from the get go. We had the beet salad, saganaki, lemon chicken soup, and beer soaked sausages to start. I could have that soup every day it was so good. Then we had the chicken parikash, salmon, cabbage rolls, stuffed chicken, steak, schnitzel, and sausages. Everything was so good and filling we all had to take some home. The waitress was hustling hard and on top of her game. Super nice. Drinks were mixed well, cold, and none of us ever had an empty glass. They gave my mom some delicious cake with coffee mixed in. Can't wait to go again! They have a pork and lamb roast special on Sundays that I'll have to fast for before coming next time.", "pics": null}}, {"review": {"des": "My family came in from out of town and i tried to take them to a swanky restaurant on Randolph street to no avail. Those places are 50% hype and 50% wait. After being turned away at a few places my wife and i remembered this awesome place! We took our family here and were NOT DISAPPOINTED! The food was fantastic and we thoroughly enjoyed the atmosphere. As an added bonus, the owner of the place loves to have a good time and never leaves a group feeling underwhelmed. There was flaming cheese, flaming booze, homecooked entrees. We loved everything and we will always return for a crowd pleaser!", "pics": null}}, {"review": {"des": "This was a fun place. The food is good and different. It was my first time trying Romanian food. The bread is different, tasty and very soft. The mititei was good but unlike any sausage I have ever had. The mamaliga was also good, if you like polenta, very smooth and creamy. They serve it with a cream sauce and cheese. My husband had the samarle, which was very good. The portions are huge. They also have ribs and burgers on the menu. What stands out for me was the palinka. There is this traditional plum brandy they serve. The owner, who is very welcoming and enthusiastic, will come around and offer a taste of this, however he wants to stand behind you and pour it into your mouth. I declined as did most people at our table, even though I did want to taste it. I ended up ordering it flaming for dessert and I was not sorry. It was so delicious I dreamed about it for days. Oddly, it was served by the owner standing behind me pouring the flaming brandy into a glass in front of me. I'm not sure why and perhaps some people might be uncomfortable with this. I would definitely go back for this drink alone, it was that good but I'd also like to explore more on the menu. The place is nice and cozy for cold Chicago winter dinners.", "pics": null}}, {"review": {"des": "We had such a great time here. We drive by all the time and finally decided to pull the trigger. No ragrets. When we walked up to the establishment, they were roasting a suckling pig outside. We ordered the pig and lamb special. It was pretty great. Very tasty and the meat was tender and succulent with just the right amount of seasoning. The roasted vegetables were great. It came with a side of corn that I feel like I could have lived without. They should really consider roasting the corn amongst the meat. When we were 1/2 done with our meal the proprietor asked us if we wanted to be blessed with holy water. We were like, \"WTF, yes!?!\" and figured we were in for an interesting life experience. Plot spoiler: it's not what you think (hint: it's totally booze). On the way out we were taking a picture of the pig and Branko (the dude that makes all this weird shit happen) handed me the mop and let me baste the pig. Until this moment I wasn't 100% sure I was living, but now I know I've got the volume turned all the way up. I applaud Little Bucharest for offering both a wonderful dining experience as well as a high level of revelry that only folks outside of the U.S. can fully digest. Keep on keepin' on, y'all.", "pics": null}}, {"review": {"des": "In my 28 years in Chicago, this restaurant is one of the absolute best that I've ever eaten at. Every aspect of the experience was perfect. <br><br>All of the food was astoundingly delicious and authentic. The environment was authentic too. The service was spot-on and fast but pleasantly hands-old. <br><br>Can't wait to return.", "pics": null}}, {"review": {"des": "Amazing authentic Romanian food, had a great experience! Friendly staff and great presentation. We will definitely be back!", "pics": null}}, {"review": {"des": "After driving past this nice little place for years and wanting to go, I finally decided to take a group there for my birthday.  We all had a blast and the food was so delicious.  The owner made his rounds to our table and gave us some libations and made us feel at home.  The staff was super friendly and attentive.  We all agreed we need to go back often.<br>If you live in the area and have been driving by, I suggest stopping the car and heading in for some great food.", "pics": null}}, {"review": {"des": "I had an amazing meal and wonderful time. Everything was top-notch. I had the meatball soup and then the goulash. Both were fantastic and I will definitely be back again for more. <br>The patio is a big selling point for me. On a nice evening, you can't beat that patio. This is a gem in the city and I plan on visiting again soon.", "pics": null}}, {"review": {"des": "Little Bucharest Bistro is a Romanian restaurant in Irving Park. No reservations were needed around 2pm on a Sunday afternoon as the dining room is quite spacious and have plenty of seating. Aside from Saturday, LBB offers a great value price fix menu with choice of salad or soup, entreé, and dessert for $28. <br><br>Their menu offers a variety of ethnic East European food. I really enjoyed the house salad and goulash short ribs dish. It had an even mixture of greens, gnocchi and braised short ribs. Their apple strudel is one of a kind, as the coating is not a typical flaky pastry. It's more of a chewable phyllo dough if I got that right. Interesting take on an apple pie.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/jpjUs3K0ZLx7f0LsVR7B6Q/348s.jpg", "caption": "Braised short ribs goulash."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/frfpkbdf6YsxlQhG1oLayA/168s.jpg", "caption": "A tidy and cozy dining room。又整齐又温暖的餐厅。"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/eAknr87xan_Kjis5RbeRSQ/168s.jpg", "caption": "Apple strudel with vanilla gelato and caramel syrup."}]}}, {"review": {"des": "SO GREAT!! I found this place on eat 24 and ordered for my whole family. We got delivery and unfortunately it ended up coming pretty late, and I called the restaurant and they were aware and told me they put a bottle of wine in my bag for free! How considerate and just a great \"surprise and delight\" for us. <br><br>The food was also BOMB so it made everything even better. We got a TON of food and got a free app as well and everything was just perfect. We got the meat platter, stuffed peppers, the veggie stew, and the polenta and feta appetizer. <br><br>The stuffed peppers and veggie stew were two of my favorite food items I've had in a long, long time. And the polenta app was just great as well. I can't wait to order from here again!", "pics": null}}, {"review": {"des": "What a great experience.  From the moment you walk in you feel welcomed.  The owner (A Chicago small business owner for over 30 years)  greats you the way you'd expect from a long time friend. And the rest of the staff follow his lead and provide warm, friendly and prompt service.  <br><br>The dishes have distinct Romanian flavors but they still have neutral staples like burgers, grilled chicken or even tenders for the picky eaters. <br><br>The restaurant is clean and spacious with subtle, elegant decor.  <br><br>So happy we decided to give this place a try.", "pics": null}}, {"review": {"des": "Never have I witnessed such hospitality from the owner Branko and his team. Funny how restaurants always say, come to my place and feel like family. It never happens. At Little Bucharest it's the focal point of your evening. <br><br>The food is very comforting and flavors are full bodied. Was blessed with \"holy water\" by owner, don't ask just come in and see for yourself. <br><br>This is a phenomenal place to become a regular at!", "pics": null}}, {"review": {"des": "Both my boyfriend and I went here for dinner and it was amazing , we had the lamb and metitei,  with homemade mujdei . Everything was so so good . Branko was so kind and gave us his \" holy blessing \" strong palinka.  Want great eastern european food ? This place is deftintly worth it", "pics": null}}, {"review": {"des": "Owner and Ivanka, our server,  were attentive and made us feel right at home. The food was delicious! Expect to stay, take your time and  enjoy your meal!<br><br>We ordered fire roasted pork (their specialty on Sundays), beet salad, stuffed cabbage, tripe soup and crepes for dessert. The pork was moist and served with corn, potatoes and green beans, which were also tasty!  The beet salad was served with greens,  drizzled with sweet dressing and candied walnuts. The stuffed cabbage had more meat than rice,  which I prefer (some places put more rice than meat). The soup was well balanced (broth was creamy and meat was tender).<br><br>This is a hidden gem in the city that offers a taste of Europe!", "pics": null}}, {"review": {"des": "Mici i ciorba de burta au fost perfecte. Am fost cu trei ali prieteni i toi suntem de acord ca au fost Porii fără repro. Atmosfera e plăcută, mâncarea foarte buna i autentica! Dacă mai vizitam oraul in viitor, ne întoarcem de sigur!<br><br>EN: tripe soup and mici are really authentic and delicious! If you're looking to try out a new ethnic food you won't go wrong here! Atmosphere and service are great and food is VERY good! There's even Romanian beer on the menu!", "pics": null}}, {"review": {"des": "Had an amazing experience here. First time trying Romanian food...definitely coming back!  Food was delicious, atmosphere was comfortable, service was excellent and owner was charming!", "pics": null}}, {"review": {"des": "This is a lovely, quaint restaurant in Avondale. The decor is authentic and the restaurant is impeccibly clean. The staff is friendly and very welcoming as is the owner, Mr. Podrumedic. Based on the reviews, we gave it a try with great anticipation. <br>2 in our party had the roasted lamb and the other had the goulash. We also tried the skinless sausages. The lamb for both parties was drastically overcooked. The potatoes, carrots, and green beans it was served with were like the lamb, over salted and unfortunately non-edible. The polenta however was perfect. The sausages were excellent. The goulash was good.<br>Mr. Podrumedic came over at the end of our meal and shared with us some homemade brandy, which was delicious! <br>Being that the roasted lamb and roasted pig were the featured items, I expected a better outcome.", "pics": null}}, {"review": {"des": "I've been here five times over the last 18 months and have never been dissapointed. I come here for special occassions with friends from out of town to show off or with family from the rural hinterlands to celebrate. We even took a birthday party of 14 people here and no one was dissapointed (except the vegan person, duh). The mici aka mititei is excellent and now I buy that from a local butcher after being introduced to it here. The apple strudel is always great. Gnocci, schnitzel, stuffed cabbage, goulash. All so delicious and flavorful and consistent.", "pics": null}}, {"review": {"des": "This place was absolutely amazing! The Saganki was so flavorful, highly recommend. The man (who I believe was the owner) was extremely friendly and made us all feel so welcome! Definitely check this place out if you're in the area!", "pics": null}}, {"review": {"des": "If you want to eat great food this is the place. If you want Romanian food even better. Great service must try..!!!", "pics": null}}, {"review": {"des": "This place is gorgeous. very nice ambiance going on, from the table flowers and small candle, it definitely elevates the whole experience. I finally got around to trying out this place and will be coming back soon. The bistro burger was delicious, amazing flavor but not overpowering. There was little to no wait for my food and the service was great. Definitely recommend!", "pics": null}}, {"review": {"des": "As soon as you walk in you feel like family! We had the Romanian Pinot Noir, the Taste of Romania platter and Nutella crepes for dessert. Everything was amazing!", "pics": null}}, {"review": {"des": "Overall:Fantastic Romanian dining experience that's as entertaining as it is delicious. <br><br>The good: Fantastic service. The owner was in the house (probably usually is) and treated our large group like family, including the complimentary shots of some strange liquor . The food was all great, from the sausage apps to the pig or chicken specialties or the desserts. Hell, even the free bread was amazingly soft and tasty. Everyone left full and happy. The atmosphere is great, with stain glass windows and interesting decor, plus it's large and open. <br><br>The bad: The price points for some of the \"highlight\" options (pig roast, lamb, \"must-haves\") were a bit too high. Also, the owner was a bit too pushy on the \"sign up for our newsletter, check into facebook and yelp, take pictures\", etc. <br><br>Atmosphere: 10/10<br>Service: 10/10<br>Food: 9/10", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/OL6dx3_yW655YXHtOD5Lnw/168s.jpg", "caption": "Pig roast"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/0ROXdRop7Wo69hLYusY8wA/168s.jpg", "caption": "Stuffed chicken"}]}}, {"review": {"des": "Great service and hospitality. We sat outside with two younger children and got right in on a Saturday night. We will definitely go back. They make you feel like family!", "pics": null}}, {"review": {"des": "Well, it took me 55 years but I am a Little Bucharest Bistro virgin no more. I dined here last Sunday night with a friend. The restaurant is small but cozy and intimate, Immediately the owner Mr. Branko made me feel welcome. For appetizers, we tried the fried calamari. Perfectly cooked, came with a dipping sauce which I think was thousand island. Complimented the fried calamari but not needed. For the main course, my friend chose the salmon which he polished off in no time. I was going to try the sausage platter but being Sunday the restaurant had roasted lamb or pig cooked on a spit. I chose the lamb and was brought out a quite large plate of lamb, roasted potatoes, and a cup of spicy corn with a barbeque sauce for the lamb. Also not needed but a nice touch. All the items paired very well together and after about 15 min I gave in and chose the takeout container. For dessert, I had the apple strudel which really hit the spot and complimented the meal as the final entree. But no being a first timer Branko insisted I try the holy water which I obliged and had a smooth brandy from his personal flask. Now that's a meal. And Mr. Branko is an owner who loves his life, his restaurant.and his customers. There is a large menu to choose from with a full bar as well and a vibe like your eclectic uncle invited you over to his house to eat. So if you haven't checked out Little Bucharest Bistro by all means do. You'll get a homecooked mealand also  like being at a family gathering.", "pics": null}}, {"review": {"des": "My family and I have been going to little Bucharest Since 1992 and  Still  enjoy the food and the owners  that is a family owned restaurant. This restaurant has specialized menu and is not a fast food resturant.Prices are not too high for the type of food they service . They have a variety of different foods such as saganki  love it !!!! They have homemade Romanian sausage and home<br>Are stuffed cabbage with really great mashed potatoes .We will definitely go back .", "pics": null}}, {"review": {"des": "Little Bucharest really is a delicious little slice of Romanian cuisine. My boyfriend and I went with the goal to find a good taste of Romania, and received delicious food and wonderful service. The manager/owner is really passionate about his work and is so kind and friendly to everyone. The waitstaff is attentive and efficient. They accommodated us even with a huge party that reserved most of the place, and got our food out quickly without loss of presentation. The mamaliga is bomb, and if you like gnocchi, I'd highly recommend any dish that mentions it. It's all great, atmosphere is cozy yet classy, and we will definitely be back for more great eats.", "pics": null}}, {"review": {"des": "This bistro serves up amazing  Romanian and ethnic foods. The owner welcomes you and is a most generous host. My dinner of pork schnitzel was superb with spaetzel, bacon and spinach. Also our party had a tasting of appetizers with Romanian sausage and saganaki. Everything was delicious. If you want to try something different try Little Bucharest", "pics": null}}, {"review": {"des": "One of the best Romanian food I had .. the chicken paprikas and sausage stuffed chicken was just the way i like it. Would definitely recommend it. I had been here many times and it has consistently exceeded my expectations... well done Branko  for all your hard work, awesome food and ambience,great value for .Thank you!!", "pics": null}}, {"review": {"des": "Lovely atmosphere. Extremely hospitable ppl.  delicious food. Mititei were just unbelievably tasty. Baby ribs were amazing. Amazing service of our sweet waitress added the final touch to a lovely dinner. Mr Branco was extremely warm and welcoming. His \"wholly water\" was a great surprise.", "pics": null}}, {"review": {"des": "We came on a Saturday night when they had 3 huge parties going on.<br>But they accommodated us and we were served quite fast-- Food interesting and varied. <br><br>Owner very communicative and we loved looking at all the photos of him on the wall with politicians as we left---particularly those in jail or who had recently gotten out-  and some honest ones as well!  (movie stars too). <br><br>High recommended restaurant.<br>(we used the yelp promo which saved $10)", "pics": null}}, {"review": {"des": "This place by far exceeds expectations!  We drove two times from Minnesota to Chicago and each time the most looked forward to part of our trip is to enjoy the food at Little Bucharest!  Coming from Romania and living in New York most of my life, where there are many Romanian restaurants to enjoy, I have to admit this one is my favorite and most like my mother's cooking.  Everything we have tried so far is absolutely delicious!  The dining experience and especially the cozy outdoor seating with Concord grape vines (soooo Romanian!) is beautiful.  Aside from the delicious food, the other best part is the very friendly and full of life owner.  I say try this place a thousand times even it it means driving from a thousand miles to get to it. Bravo!", "pics": null}}, {"review": {"des": "Incredible food and wonderful service. Felt like family the moment we walked in. Accommodated a party growing from 6 to 10 without a second thought. Can't wait to come back!", "pics": null}}, {"review": {"des": "This was a very friendly and satisfying experience. We had great service and were well entertained by the owner. The food was delicious, especially the mici and perisoare soup. I will definitely come back next time I am in Chicago.", "pics": null}}, {"review": {"des": "Excellent service. Excellent food! The owner is amazing. I really enjoyed my visit to this restaurant. I would recommend this to anyone visiting Chicago.", "pics": null}}, {"review": {"des": "Wonderful atmosphere- even better people! We were very happy with the lemon soup, goulash and schnitzel. Even got \"blessed\" by the owner! We will definitely be returning", "pics": null}}, {"review": {"des": "I saw the word Goulosh while looking for something new to eat near Old Irving Park, and had to try it. I was going to order takeout, but the owner (Bronco) was really nice and hospitable and offered (my fiance and I) a seat.<br>The Goulosh did not disappoint. Remind me of something similiar my grandma used to make. If you don't know what our is, it's a stew, but the meat is much more tender, and the food is suprisingly not greasy.<br>Highly recommend for nice couples night out. My Fiance had the chicken thighs, which she let me taste, and those were also very good.<br>I didn't feel like I would explode at the end of the meal, so very well portioned. TL:DR come for the European grandma's cooking and hospitality.", "pics": null}}, {"review": {"des": "By far ex spectacular service, food that will have your mouth melting and wanting more. If you stick around until closing you will be blessed with a warm feeling and shot of fine alcohol.", "pics": null}}, {"review": {"des": "Such a great spot!  Incredibly talented violinist who can play anything upon request, fantastic food, lovely people, and warm lighting.  Ask for the holy water!!!", "pics": null}}, {"review": {"des": "I had a wonderful experience at Little Bucharest Bistro for dinner. The food is delicious and a you get the feeling you are in Romania . I had the braised ribs and gnocchi and a Romanian Cabernet dry and it paired well with the main course. Try it, you will not be disappointed.", "pics": null}}, {"review": {"des": "As a first timer in Chicago along with my companions we tried different restaurants. So far this place has been the most tastiest and charming place to dine in. They're Moldovan and I'm Mexican, wanted to come and have an amazing experience and great food. We weren't disappointed at all. Ivanka such a beautiful and amazing server along with Branko made this experience the best in Chicago. I totally recommend this place to anybody from anywhere . Every cent spent was well worth it.", "pics": null}}, {"review": {"des": "Best saganika, mamaliga, goulash (kind of an adopted dish, granted!), and schnitzel (another adopted dish) you'll get outside Bucharest.<br><br>Fresh ingredients abound here -- don't go in expecting a meal out of a can and a freezer.<br><br>Amazingly kind, attentive wait staff, too -- seriously. <br><br>I almost felt as though I was eating in someone's home in Romania, not a restaurant. (HINT: Your waiter will likely give you gentle instructions about how to best enjoy a Romanian meal. LISTEN TO HIM. He means well, and wants you to have the best repast possible.)<br><br>On a budget? Try the fixed price menu.<br><br>Oh, and one more thing . . . prepare to leave this place stuffed to the gills. (Romanian food is many things, but light and airy aren't two of them.)<br><br>P.S.: Tuică (the Romanian equivalent of slivovitz, a fiery plum brandy) will likely kick your ass, so go slow on the stuff. TRUST ME ON THIS ONE.  :)", "pics": null}}, {"review": {"des": "Great experience, went late on a Sunday and there was only one other table seated and a few people at the bar, so the atmosphere was kind of dead but the setting was very intimate. The host was excellent from the second we walked in very welcoming, enthusiastic, and friendly I'd come back just to see him again. The food was great had the roast pork & roast lamb even egg plant salad was on point. Nice place off the beaten path", "pics": null}}, {"review": {"des": "All I can say was a amazing experience ! The food it's amazing authentic and the experience since we got into the restaurant was very pleasant , staring with very friendly staff and also the owner Branko comes at every table making  sure everything its perfect ! I live in Beverly Hills but I can't wait to come back to Chicago again for this amazing experience", "pics": null}}, {"review": {"des": "This place is so amazing, not only is the food delicious and complex but the ambiance and the owner really make it fantastic. We had saganaki which is so delicious, plus I love anything that is served on fire. Everyone's food was great, I had the shrimp goulash and it was so so so good. The owner really makes you feel welcomed and appreciated as a customer, Can't wait to come back!", "pics": null}}, {"review": {"des": "The empty seating area worried me but wooooow! I've never had goulash before. What a great setting. The interior really adds to the Romanian ambience as well as the table side fiery cheese .", "pics": null}}, {"review": {"des": "Ordered for pick up this evening and I just can't say enough great things. <br><br>I live right down the street and have been meaning to try this place for awhile. I'm so glad I finally did! To start, the restaurant itself is really nice inside! They have a great little bar and a nice atmosphere. After the initial impression, you will be greeted by some of the friendliest restaurant staff in the neighborhood. They were just lovely. Everyone we spoke to was super accommodating and inviting. As if this wasn't enough to rave about, THE FOOD IS INCREDIBLE! Seriously, incredible. You can tell everything is fresh and made in house, and the flavor is great. The menu is really unique and I'm tempted to go back and try everything. I highly recommend the sausage stuffed chicken thigh. We almost didn't order it, since it seems a little pricey, but it is well worth the cost. I've never had anything quite like it. And to top it all off, our order was ready promptly. <br><br>Will definitely be back and telling all of our friends!", "pics": null}}, {"review": {"des": "This place was on my list for a while. It was  recommended by our friends that live in the area. The food was delicious and the staff friendly. We had \"mititei\" , \"sarmale\" and appetizers. Everything was tasty and fresh. I highly recommend this restaurant for everyone who likes or wants to try romanian food and Eastern European food.", "pics": null}}, {"review": {"des": "We came here last night for a small anniversary outing and we are glad we came! They have a great cocktail menu, a nice selection of wine, and great food. The food and drinks are clearly made with care and the fantastic service and hosting make for a really exciting experience. Don't miss the schnitzel or the paprikash! Couldn't ask for a better place in the neighborhood - will definitely bring friends, this is a great place for a group!", "pics": null}}, {"review": {"des": "Legitimately my new go to spot for taking any visitor from out of town. I've driven past this place so often as it was on my route to work.  Always liked its look, but hadn't gone in. Had my mom in from NY, so we gave it a try.  The first thing when you walk in it smells of fresh bread and long simmered sauces.  The entry is wide open and leads into a dining room just past a small bar area.  It looks like a European Bistro.  Long tables off to one side, with smaller tables around the exterior.  Service was very fast but never pushy.  The timing between the appetizers and our meal was spot on.  The 5 of us all had different amazing entrees, but the clear two winners were the stuffed cabbage leaves and, oddly enough, the salmon over roasted leeks and couscous.  When my son ordered salmon in a Romanian restaurant, we looked at him like he was nuts.  Hands down the best salmon three of us at the table had ever had. <br>    We had 3 desserts.  One was a super moist cupcake with ganache, another was crepes with Nutella, and the last was a seven layer cake where they had bruleed the frosting.  All were delicious.<br>As for drinks, there was a nice cocktail list, many wines to choose from, and an extensive local beer list.  <br><br>Then there's Branko........<br><br>The owner is like the coolest uncle you know.  He's all over the room, picking his spots to make sure everything is perfect.  Always available, never intrusive, and if he offers you his Holy Water, just go with it.<br><br>Ill be back for sure, and I cant wait to sit at the outdoor area and people watch", "pics": null}}, {"review": {"des": "I would've given this place 5 stars if it wasn't for our waitress. We went here because my significant other's parents are good friends with the owner. Branko is awesome. He's super nice and he creates a great environment. The food is pretty good, definitely one of the better Romanian places we've been to. Romanian food tends to be a little bland for my taste, but it was all very well seasoned here. <br><br>Our waitress might have been the most annoying person I have ever met. She was either too present or she wasn't there. While we were waiting for the rest of our party, we decided to order appetizers and she immediately told us that we shouldn't order the dish because it wasn't \"Romanian\" enough and it was a dish children would order. Girl, be quiet and let me order what I want. She just rubbed me the wrong way and honestly kind of ruined the dining experience for everyone except my significant other.", "pics": null}}, {"review": {"des": "Very nice and clean restaurant. The music and the food were awesome. The service was really good, in Chicago where you can find all kind of restaurants, this one impressed me with the service.<br>The waitress took the time to talk to us about what we were eating and made great suggestions. The owner stopped by an engaged with us as well.<br>Loved the food, the Romanian beer was light which I liked very much. If you have kids, this is definitely family friendly and very relaxed. <br>At the end of the dinner, the waitress suggested a traditional Romanian drink, which is a shot of home made plum brandy called palinca  and bisinata which is sweet brandy, and even told us the story of how they make here in the USA with the help of her grandmother. I  loved the experience and will definitely be back.<br>They have a patio too for a nice summer night!!", "pics": null}}, {"review": {"des": "I lived in Cluj for about a year and was so happy to find a great Romanian restaurant in Chicago, since I missed Romanian food so much!  The servers were fantastic with their recommendations, and the atmosphere was casual and clearly a local favorite. The highlight for me was the sarmale and the vinete salad, and my friends who had never eaten Romanian food before also loved it!<br>Highly recommend to everyone. Pofta bună!", "pics": null}}, {"review": {"des": "This restaurant  5 stars from me. Excellent service great chef definitely I recommend anyone to come to this location. Understand knows how to treat customers.  Open window to let you see how your food is prepared and served really be list.", "pics": null}}, {"review": {"des": "Delicious food and an entertaining experience to go along with it!<br><br>Came here with a group, since it was snowing we had almost the entire place to ourselves.  The owner gave us extra-special attention, not sure if it was because of that or not but I'm guessing that's his normal behavior.<br><br>At the recommendation of the owner and the waitresses, we got a bunch of food and shared it among the table.  My favorites were the pork schnitzel, the goulash, the saganaki, and the pig roast (which they do every Sunday).  <br><br>Also enjoyable was the \"flaming tea,\" which isn't tea, but rather plum brandy, but does indeed come flaming.  And the owner delivered it himself and pours it right in front of you (a little unnerving at first, but entertaining).  He also set the saganaki on fire right at the table, which was a sight to see.<br><br>The desserts were also good, our group did shared plates for that as well.  It can get a little bit pricey, especially with the pig/lamb roasts, but all the food was delicious and everyone left full, as well as highly entertained.", "pics": null}}, {"review": {"des": "This was the best 100 bucks I have spent at a restaurant ever. The owner and the staff are top notch second to none and the food is exceptional. The flaming cheese, the beet salad and the entrees are magnificent. Right from the time they bring the bread until they give you the dessert menu it is with a true investment in customer service and satisfaction with every plate that they serve. Job well done !!<br>I will spend my money here again.", "pics": null}}, {"review": {"des": "Just had an outstanding meal!! The Sunday pig and Lang roast is delicious. For $30 a person you get a healing mound of succulent meat, two sides, bread& butter, and a bottle of wine. Service was perfect. I can't recommend it enough. Go now. Or next Sunday.", "pics": null}}, {"review": {"des": "I went here knowing it would be good but it exceeded all expectations! I was in a group of 9 people with 2 kids and everyone had a great time and thoroughly enjoyed their food. Our server was amazing, and the owner was super fun. When we got our bill we were pleasantly surprised how reasonable it was considering all we ordered. I'll definitely be back and if you're reading this review I recommend you check out this place ASAP!!", "pics": null}}, {"review": {"des": "It was surprisingly great! <br><br>We came on a Sunday so that we can try the pig and lamb roast. They were cooking it outside the front door! It was a snowy evening so we were really the only table there, but I think I saw quite a bit of takeout. <br><br>The menu is pretty large and you can get everything from a burger to goulash. We got the sausage appetizer and flaming saganaki. Both are excellent! For dinner we got the lamb and pig roast along with goulash and schnitzel. Everything was tasty, but the roasts had a little bit too much bone to meat ratio. Still, the sauces were amazing and the sides were plentiful. <br><br>We also got all the deserts except the strudel. They were also outstanding! <br><br>The customer service was also top notch! Like going to somebody's house!", "pics": null}}, {"review": {"des": "An absolute Chicago gem.  I'm only upset that it took me 10 years living in Chicago before finally trying this place.<br><br>I went here last night with my family.  Little Bucharest hit on all cylinders - food, service, and ambiance.  The menu has all the classic central European favorite - steak goulash, chicken paprikash, schnitzel, stuffed cabbage, etc.  <br><br>We started with an eggplant spread and beef and vegetable soup.  Both were amazing - home made, fresh, and delicious.  My wife got the stuffed cabbage and loved it.  I had the goulash, which was AMAZING!  Portions were generous, and my normally picky kids loved their chicken schnitzel and even their green beans!  <br><br>They have a full bar, extensive wine list, and a great great beer list.  Service was tremendous.  This would be a good place for large parties, since they have plenty of space.  There was also plenty of street parking right outside the entrance.<br><br>This is the kind of place I would eat every night if I could.  This will definitely now be a part of our regular restaurant rotation, and I will take my family here when they come in town.", "pics": null}}, {"review": {"des": "Little Bucharest is unassuming from the looks on the outside but they are cooking up delicious homemade Romanian food. The meatball and vegetable soup was truly outstanding. It had a generous amount of vegetables and the pork meatballs were tender and lean. The stuffed cabbage was also exceptional. Prices are on the high side, but they don't skimp on serving size and the service was great (family owned and operated).", "pics": null}}, {"review": {"des": "i love this place. the owner branko and his wife and daughter are very nice people. they treat me like family and like i am in their own home. i went on a sunday with my friend and i had the roast lamb dinner with corn red potato & a steak sauce. the lamb was tender juicy flavorful with nice spices as were the veggies. my friend had the romanian sausage plate and that was good also. i also had the cabbage rolls with the polenta. cabbage roll was real good nice meat filling and was nicely spiced with the paprika tomato sauce. polenta was very good also. we also had the saganaki, very good the saganaki was good, it was nutty salty tender flavorful great. great place to take a friend or date. great place to have a family or private party also. please tell branko elvis sent you. check out my youtube channel elvis travels for my videos food reviews of this great place!", "pics": null}}, {"review": {"des": "For a magical evening straight from old Europe, this is the place to go. We had my wife's birthday here - 20 guests, wonderful food, great service - really good music, complete with happy birthday sung in Romanian.<br><br>The owner was checking every few minutes to make sure everything was perfect - and it was! Definitely try the Ciorba ... absolutely delicious.", "pics": null}}, {"review": {"des": "Never had Romanian food? Me either but now it's definitely on my list! When we got to Little Bucharest Bistro we were greeted by a kind and attentive owner who really cares about his customers. <br><br>As Romanian music played quietly in the background, we got our own music in the form of authentic Romanian food, wine, and sweets. Heck, it tasted so fresh I kept looking out the window expecting to see Herăstrău Park!  <br><br>The owner even gave us an after dinner drink made by his Mom back home in Romania!!!  Try something different and fresh for dinner...  and have a drink with Branko! :)", "pics": null}}, {"review": {"des": "We came here on a Sunday and the place was half capacity. The clientele was a mix of Eastern Europeans and others. There is an air of authenticity to the place and the food. Service was good and very friendly. <br><br>They have an extensive menu with a good variety. Their \"CIORBA DE PERISOARE\" MEATBALL SOUP is absolutely delicious. So was the saganaki. 2 of us ordered the roasted meat special, lamb and pork. It was pretty good. Vegetables were cooked properly, too. I tried the salmon and it was done well, but nothing unique about it. The bread was nice and soft. I really appreciated the soft and delicious bread. I'd like to go back and try more of the traditional dishes.", "pics": null}}, {"review": {"des": "My fiancé took me and our two boys here and we enjoyed the environment to the fullest! We liked the fact that the owner was doing as much work as the waitresses. We went on a Wednesday night. We shared the Mititei sausage appetizer. It was so pleasant and I had to fight my fiancé to eat it! I ordered the Skirt Steak and it was so delicious. My fiancé ordered the Award winning sausage stuffed chicken thighs. He did not want to stop eating it! We also had the pleasure of trying the apricot crepe and it was so tasty. The scenery of the restaurant was so cozy and felt like we were at home. The owner even let my son make a kiddie cocktail and most places wrinkle their noses at kids. So the fact that they were interactive with him was a breath of fresh air. And watch out to be \"blessed with holy water\" it's not water haha!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/LPh_z0oe1JTkFskH35eRKg/348s.jpg", "caption": "Very interactive with my son. Let him make a kiddie cocktail !"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/FGIAWZBFoo9QtK3KOe2Wlg/168s.jpg", "caption": "The holy water"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/5oqERtqpu3R8325nTrkRwQ/168s.jpg", "caption": "The skirt steak! So tasty"}]}}, {"review": {"des": "Stumbled upon and so glad I did. A very different dining experience in Chicago. Culturally authentic, warm and inviting, delicious and fresh food. Bread tastes locally baked. Vegetables are fresh. Sausages are delicious and the Signature Braised Short Rib Goulash was out of this world.", "pics": null}}, {"review": {"des": "Amazing!! Gem in the city to find an authentic Eastern European restaurant with a Romanian twist. Incredible smoked eggplant spread and chicken paparikash. The Romanian wine was lovely. <br><br>Why we live in Chicago to enjoy places such as this.", "pics": null}}, {"review": {"des": "This place is the full dining experience.  The owner is incredibly enthusiastic and welcoming, he amplifies the experience and makes you feel like you're part of a super fun family.  This isn't to downplay the food because the food is delicious.  Our group of 6 left with full bellies and lots of laughs, a truly enjoyable experience.", "pics": null}}, {"review": {"des": "Wow, we just left this place, and it was THE BEST experience we've ever had at a restaurant. <br><br>We started off with the flaming cheese app, and Branko (the owner) had one of us pour some oil over the cheese while he lit the cheese aflame, which provided a fun photo opp. Our party of 7 ordered the salmon, skirt steak, sausage-stuffed chicken, goulash, stuffed cabbage, and tocanita, and all were delicious. Our desserts, crepes and some sort of cake, were spectacular. <br><br>What really made this experience special for us was the one-of-a-kind service. Branko made us feel like family from the moment we walked in. He was so helpful and fun (even giving us some free shots of \"holy water\") and our party of 7 had a great time. After our meal, we sat outside in the patio area chatting for some time, and Branko checked to see if we wanted any water. We got to chatting with him, and my 13-year old asked him where he was from. She was really intrigued, and he graciously answered all of her questions. Then he invited my kids to learn how to make kiddie cocktails, and we all had a great time talking with him. <br><br>While this would seem like a unique experience, so many of this restaurant's reviews describe this same great, personalized service. This restaurant is a rare gem, and we will definitely be coming back here anytime we're in Chicago.", "pics": null}}, {"review": {"des": "If you are Romanian and want traditional Romanian  food, you've chosen the right place. If you're not Romanian and you want to experience good Romanian food, you've also chosen the right place. <br><br>The owner, Branko, just helped plan and organize the best 40th Birthday party for my best friend's husband.  Branko made sure each detail we wished for was present.  He and his wife, Veronica, provided the best service and ambiance for our party of 60 people.  The food was delicious  and served in very large portions. Even the bread was freshly made that morning for our party!!!  We also added a pig roast onto our party menu. You could smell the pig roasting blocks away as we began walking towards the restaurant. Branko was very attentive to all of our needs and accommodated every single person to what they had needed.  Thank you to Branko, Veronica, and their AMAZING team of servers for hosting a memorable event!   Emma", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/w8Qoaqfc_DEhYNHNXgvjNw/168s.jpg", "caption": "The pig roast made its entrance halfway through our meal.  Everyone wanted selfies with it!  So tasty!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/erCUNaXUmxQNSHQQs6Y7YA/168s.jpg", "caption": "Delicious Romanian sausages \"mititei\""}]}}, {"review": {"des": "I've lived by this place for a very long time, but it amazes me why I never tried it until last night. My boyfriend tried making reservations upon reading about how busy it can frequently get when they host parties, but thankfully we didn't need any. <br><br>We were seated immediately and inspected the one-sided menu, and right away I knew it'd be a tough choice deciding what entree I wanted. While we decided on calamari as an appetizer, for my entree I chose the village salmon dinner and my boyfriend the sausage-filled chicken thighs. I'm an avid cocktail lover, so I was thrilled to see mojitos, sangria and margaritas on the drink menu. Craving something minty and refreshing, I went with the mojito, which came in a generously sized glass and filled to the brim with spearmint leaves and slices of lime. <br><br>The calamari was superb, if you don't mind it to be a little more doughy than usual. Still, we loved it, as it was a tasty alternative to the super fried calamari you normally get at fast food joints. My salmon came surrounded in couscous and veggies and was divine; though he wished he had gone with the burger, my boyfriend ate every last bite of his chicken. <br><br>The best part of the night, honestly speaking, was the wonderful violin player. He went to each table and played a song that he felt matched their vibe, so for us he chose romantic Spanish ballads and a salsa song after we told him my boyfriend was Puerto Rican. The owner was a truly funny little guy, checking up on us regularly and even giving us a free crepe and shots of what he called \"holy water.\" Hilarious! (I was so surprised he spoke fluent Spanish, too!) Our waitress was also extremely helpful and sweet. <br><br>We loved every second of being here, and the food was just a huge bonus. I can't wait to go back and try the other dishes that sounded mouth-watering on the menu--AKA everything!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/WHJ9c7kwpvQs68IB6vIE4Q/348s.jpg", "caption": "The Village Salmon Dinner"}]}}, {"review": {"des": "The other reviews provide a great deal of detail about the dining area, the selections, and the menu, so I'll just take a moment to echo this is a great place.  The food was excellent, the ambiance wonderful, and the stuff super friendly.", "pics": null}}, {"review": {"des": "This place is AMAZING!!!! the food is awesome! You have got to try their creamy polenta, it was like my favorite. The owner, Branko was the nicest guy ever. They have excellent beer options and it's got a really beautiful patio. It's the perfect place to go with family or friends and suitable for a date as well.", "pics": null}}, {"review": {"des": "Dined last night at Little Bucharest for third time and really enjoyed the Eastern European fare. Girlfriend loved the homemade sausages and the house specialty short rib goulash. Paired with a tasty, budget-friendly Romanian Pinot, the meal was fresh and delicious.  \"Surprise\" shot of mystery liquor was added treat -- we WILL go back with friends!", "pics": null}}, {"review": {"des": "Going to this restaurant was a year in the making. We were initially supposed to go see 2001 on the big screen and go to this restaurant last year. Tickets were not secured so we held off on the restaurant until 2001 camelback this year. So, the build up to this restaurant had extra time to marinate. It did not disappoint. <br><br>First off, the cast of characters greeting and serving us were phenomenal. Everyone was so friendly you got more of a family dinner atmosphere. Our waitress, a charming young lady, snickered at our attempt to order fries we saw in a picture for the restaurant. She said something in Romanian? Which my friend later said to be translated as \"oh gosh\". She then steered us away from the fries. Now, that may normally seem weird but not in this case. She knew. She knew the difference between knowing and thinking you know. She knew. <br><br>So, we all got soups, ordered some apps, and all got entrees the share. What a great fuckin meal! It was a meal you will gladly over eat even if it means you have to deal with something later. I got the short ribs with gnocchi. We had a sausage appetizer. There were these scoops of feta and polenta. Someone got a chicken dinner. Stuffed cabbage. Just all kinds of junk. It was ALL so tasty. <br><br>The experience was so fun and left me calling it a must return restaurant very early in that process. Everything about the night seemed to go perfect. We talked about women turning into lesbians (I was with 3 heterosexual girls) ((maybe it for long?)), we had some nice drinks, and we left wishing we could eat more. <br><br>Just a fantastic place.", "pics": null}}, {"review": {"des": "Without a doubt the best meal / experience my husband & I have had practically ever!! <br>Little Bucharest is deserving of Michelin stars.<br>Fabulous presentation, fresh, generous portions.<br>Our server was beyond excellent, cordial, efficient.<br>The owner is a remarkable gentleman, human being & restauranteur. <br>The food-welll--- thank goodness, we had a variety of <br>delicious take home that we enjoyed today....I had to resist not finishing all of my schnitzel - tasted perfect just now. We look forward to retuning very soon.", "pics": null}}, {"review": {"des": "Had dinner here a week or so ago.  I think I found a new favorite spot!  The restaurant is warm and inviting.  I got a comfortable vibe right away.  The service and hospitality was great.  We felt like we were at a family member's home.  They really take care of you and truly care that you're having a good time.  THE FOOD WAS EXCELLENT!  So much flavor!  They pour a solid drink too! ;)  <br><br>My only criticism is minor.  We had to ask to have our water glasses refilled and I had to ask to have another drink.  For me, attention to detail and little things like that go a long way.  I would have given 4 1/2 stars but unfortunately I couldn't.  <br><br>Bottom line...would I come back...ABSOLUTELY!", "pics": null}}, {"review": {"des": "This place was interesting. 3 of us came on a weeknight, and the place was empty. Their credit card system was down, and they told us that at the end of the meal, which made it challenging, as none of us had cash. We had 2 other friends join us, and we had to have them stop and get cash on our behalf. The food was all right, and the owner kept coming around the table making jokes, and brushing up on people. I wasn't a fan of getting touched by him repeatedly while he made crude jokes. I'll pass next time.", "pics": null}}, {"review": {"des": "Absolutely tremendous! Food was great! Bronco and his wife are excellent cooks!<br><br>Eat here!", "pics": null}}, {"review": {"des": "Very courteous and delicious food! The staff was friendly and made me feel like home, I'm from Romania. It was the first time when I went to an European restaurant since I'm in the USA, I had a great experience. I loved the tripe soup. The prices are good too, I totally recommend it!", "pics": null}}, {"review": {"des": "Little Bucharest is a hidden gem in Chicago. I have been to Romania many times, and my wife is Romanian. The food and atmosphere is authentic, but take note the food you are eating is high end, at the class of the five star restraunt your would find in Bucharest. Our waitress was very attentive, and the owner was a blast.", "pics": null}}, {"review": {"des": "I stopped in for dinner on my way home from work, and I'm happy I did. From the moment I walked in I was greeted and got a table with in moments. <br>If your looking for the best authentic European food in town you owe it to yourself to come check out Little Bucharest Bistro! The food was absolutely delicious and the owner is super nice, he came to my table and introduced himself. Great place to come in for lunch or dinner. <br>Definitely coming back!", "pics": null}}, {"review": {"des": "Such a fun place to eat! I will definitely be back again. The food was very tasty. We had the mitetei, vinete salad, sarmale, and goulash. They were all very good and easy to share. Everyone was very kind!", "pics": null}}, {"review": {"des": "Gave it a try with a Groupon we purchased, but we had such a great time we forgot to use it. A great excuse to go back. <br><br>Food was wonderful, however the staff made it a great experience for a friend visiting from out of town. We will definitely bring our folks in when they come for a visit.", "pics": null}}, {"review": {"des": "The food was excellent. Mititeis were very smoky and tender. Goulashes were flavorful. More importantly, the service was the best I've ever had. The owner was very humble and fed us \"holy water\" at the end of the meal. Turns out the \"holy water\" was a plum brandy made by his mother. Highly recommend Little Bucharest Bistro.", "pics": null}}, {"review": {"des": "Little Bucharest Bistro was wonderful! It is a homey family restaurant with wonderful Romanian fare. More than anything this family cares so much about their guests and sharing their culture through their food. We had saganaki (yes, Greek not Romanian, but still amazing!), the polenta appetizer, and the mititei homemade sausage dinner. Everything was INCREDIBLE. The sausage had so much flavor and came with really crispy fries and grilled vegetables. The saganaki was fun and traditional (flaming cheese is always awesome)! I loved how creamy the polenta was. I would 100% recommend!", "pics": null}}, {"review": {"des": "We had an amazing time at this restaurant!  The food is delicious and service is amazing!  One of the best places I've been to in Chicago for food and all-around atmosphere.  The owner treated us like honored guests!  He gave us shots of \"holy water \" and let the kids try making their own kiddie cocktails!  He sent us on our way with a final round of free wine and shots of Johnny Walker.  We ate indoors which was very clean and nicely decorated and then spent time on the outdoor patio while enjoying our beverages.  Everyone in our party of 5 adults and 2 kids loved their meal.  A++!!", "pics": null}}, {"review": {"des": "We had the place to ourselves and the food and service was good.  The menu is as eclectic as the decor with some Romanian specialties.", "pics": null}}, {"review": {"des": "I have mixed feelings about this place. I had been here about 7 years ago and thought it was so-so and wanted to try Nelly's but I didn't have cash so I tried little Bucharest again. Being from Bucharest, I really appreciated the atmosphere. I think the food was a little off- I treated my friends to vinete, mamaliga, sarmale, chicken schnitzel, and clattite. The sarmale and clattite were very good. If you go here, be prepared to spend some money since it's pretty pricey. Just a little tip as well- in our culture we take our time eating and talking so your server is not ignoring you, just not in a hurry. (So you may be there a while.) The owner comes by your table at the end and says he needs to bless you with holy water, he actually pours Tuica down your throat which is a really strong Romanian liquor. Thought I should warn you since he will not tell you.", "pics": null}}, {"review": {"des": "The freshest most flavorful food I've tasted in a while. Charbroiled sausage had a slight crisp on the outside and very juicy on the inside, mixed greens that it came with had a sharp vinegarette, paired well. My bf had the stuffed cabbage, well executed especially with the creamy feta sauce! The volcano goulash was perfect, grilled eggplant and veggies with a yummy red pepper sauce. Thank you for a great evening!", "pics": null}}, {"review": {"des": "Home-cooked fine dining! Wonderful Romanian favorites -- mămăligă, borsht, sarmale -- in a romantic atmosphere. Borsec at the table. They do a Sunday pig / lamb roast as well which i haven't checked out personally.", "pics": null}}, {"review": {"des": "My friend is from Romanian and she introduce me to this place.  The owners treated us like family.  I felt like I was right in there dining room.  Can not wait for another delightful dinner at this restaurant.", "pics": null}}, {"review": {"des": "My favorite Romanian end European restaurant,  I love coming here food is always amazing,  great atmosphere and amazing staff. Everyone that I bring to this place they always want to come back after we leave I highly recommend it for anyone that loves great food.  I will definitely keep coming back. A+++++", "pics": null}}]}