{"name": "little-bad-wolf-chicago", "reviews": [{"review": {"des": "I'm obsessed with this place. Cute, cozy, cool. Amazing food with a variety of choices on the menu and great service. You really can't go wrong here.<br><br>It's a little tough to get a table on a busy night but it was worth the wait for me. They will still offer you a drink as you wait which is nice. <br>My fiancé and I ordered the crab cake for starters. By far the best crab cake I've ever had. It's perfectly golden and crispy on the outside, meaty and full of crab on the inside. I also loved the little fried capers. It added such a nice pop of salt to the entire plate. Yum. There are so many tempting things on the menu that it's easy and fun to get a bunch of individual items to try. We ordered the shrimp bao (my first bao ever), the shrimp taco, the steak taco and the fried fish taco. First of all, I loved the bao!! The steamed bun was so fluffy and the shrimp was cooked to perfection. All of the other tacos were really tasty as well, the fish taco was huge!<br><br>Our server was so friendly and came by regularly to replace drinks and see if we wanted to order more food.<br><br>I wish my stomach was bigger because I wanted to try everything on the menu. I'll definitely be back for more soon :)", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/J6KYIJx8bLTTyBYThTyUVg/348s.jpg", "caption": "Top: Shrimp bao Middle left: steak taco Middle right: shrimp taco Bottom: fried fish taco"}]}}, {"review": {"des": "Really great burgers. I mean really, REALLY great. The appetizers here are amazing too. The only problem is trying to get a damn seat most nights. They expanded into the store next door, but it's still hard to get in most nights for dinner. <br><br>If you can, get in and grab a spot at the bar. Order your drink, and the elotes. While you're eating that, order the burger, medium, eat half, and then take it home for later. <br><br>Amazing burger, seriously.", "pics": null}}, {"review": {"des": "Little Bad Wolf is a-ok. I recommend it for 1-3 people, absolutely do not recommend it for groups<br><br>For some reason, Little Bad Wolf is determined to not take reservations. I don't get it, but I'm trying to respect it. Whatever they tell you when you arrive for the wait time, double or triple it. <br><br>The food is really nice- one of the tastiest spots in northern Andersonville. I love the tacos (the Poke Taco, while confusing, is surprisingly awesome). The fries are excellent. The service is ok (sometimes not great), and the drinks are delicious and special. I love a good seasonal cocktail, and they do a great job with this. It's also a cute environment with a nice date-night vibe. I dig it!<br><br>The problem is, if you come here with a group especially, you need to expect a very long wait and inaccurate wait times. Expect weird orders of seating, with similarly sized groups that arrived after you being seated ahead of you, and expect illogical seating choices that don't make sense when people are waiting. Hope to see them work on this issue and over time, maybe they will become the 5 star hot spot I know they could be!", "pics": null}}, {"review": {"des": "My former flatmate had told me months ago that I should have Little Bad Wolf on my list. Only recently did I follow through on her recommendation and that was because she wanted to go their for her birthday celebration. So we did and I'm glad of it.<br><br>We had elotes and brussel sprouts. Loved the elotes and I swear brussel sprouts are becoming the \"it\" vegetable. Because I was hungry, I ordered the Wolf Burger. That was a monster: three beef patties, onion rings, pickles, sauce, blasted tasty. Loved that the fries were crispy without bordering on burnt. They got it right.<br><br>Good service and I will say that the service was also good. Looks like a very lively spot, especially in the front room. I do understand why. I shall return.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/R1YVIR-GD01EWD7GvmA0jg/348s.jpg", "caption": "Wolf Burger"}]}}, {"review": {"des": "We went here late one night after we attended a concert.  We were welcomed and seated promptly.  This place has been recommended by a few friends and I was eager to try it out.  <br><br>We all opted for burgers.  I am currently following a keto regimen so I requested no bun and a ceasar salad replaced my fries.  <br><br>The burgers were super tasty and I finished the entire thing.  My ceasar was spot on.<br>My friends chose burgers with buns and fries accompanied by elotes.  The elotes was topped with deep fried avocado....it was interesting.<br><br>Drinks were tasty and poured well.  There were also a number of beers to choose from. <br><br>The servers tag teamed tables nicely and engaged with the patrons.  It was a great vibe.<br><br>Finally, the bathrooms are clean and they even have a lotion that makes you smell and feel refreshed.<br><br>I will definitely be back.  Bike parking on street.", "pics": null}}, {"review": {"des": "The food was okay- the fries and baos are definitely the best items. We were recommended the Mac n cheese over the elotes and personally felt like it lacked flavor. The burger was a bit bland and in the mini, the patty was way bigger than the bread and made it awkward to eat. The portions, however, are pretty big which are nice.", "pics": null}}, {"review": {"des": "Excellent food. Started with the mussels, crab cake was okay. The bulogi boa was excellent with picked radish. The mini sliders were delicious had added fried egg and upgraded to Mac n cheese.that was perfection nice chewy cork screw noodles with an oniony cheesy flavor with prices of bacon. Elote was ok. The grilled romaine had a beautiful presentation was more showy then taste. Our server was sweet. <br>Decor was really funky and cute. They had great music. Outdoor eating. We ate inside at a long community high top right by the kitchen window so we could see all the magic happening. <br>I would highly recommend coming here. <br>Great service delicious food and you can feel the love.", "pics": null}}, {"review": {"des": "Came for a late lunch ... food amazing , drinks delicious. We had some dietary restrictions and it was no problem. Had the tacos lettuce wrap style and corn  tortillas. Grilled romaine salad kicked ass. Mac and cheese and Brussel sprouts.  Vegetarian and meat lovers are welcomed.  Just go here. Cheers .", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/AOcbEAenlEQ1qDSwJCNtwg/168s.jpg", "caption": "Grilled romaine order this"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/fUUZ7nsSTvj-bqSPOPo5oQ/168s.jpg", "caption": "Tacos fantastic"}]}}, {"review": {"des": "This is the coolest spot West of the East Village. I'd call it a gastro-pub but it's way cooler than that. The lighting is dim, the decor is relaxing and the sound track is perfect. Service by Brian at the bar was top-notch. Cocktails are inventive and the beer list is massive, but the wine choices are limited. <br><br>For a cocktail I went with the Wolf in Sheep's Clothing. This tequila based drink is everything you want in a craft cocktail and more--balanced, tart and complex. Highly recommended! Have several! Followed by a glass of prosecco. Good fries in a basket came with aoli. The only miss of the night was a crab cake. It was too undistinguished for this place and too heavy on salt. But no-one comes here for crab cakes, and in future I won't either.", "pics": null}}, {"review": {"des": "Great food and drinks definitely our go to spot late night for some burgers and good drink. Love the music and atmosphere great place.", "pics": null}}, {"review": {"des": "Burgers are my weakness and LBW did not disappoint! Ended up getting the wolf burger, a side of the mac and cheese and the fries. Safe to say we could not move afterwards but it was the good kind! I also ended up getting the Zombie Killer cider and I would definitely recommend it! It's cherry flavored and It DOES NOT taste like medicine! <br><br>I will definitely be back to try more items off the menu!", "pics": null}}, {"review": {"des": "I've been wanting to try this place for a while and finally did so. Little Bad Wolf has an eclectic menu contains Asian, Latino and American fare. Even a picky eater would be suffice. <br><br>The Interior = Very nice. Hipster classy sheik. <br>The Service = Good. Very friendly. <br>The Food = Good. My fries were cold though. <br><br>I was feeling dainty and opted for the bad burger which had two patties versus the wolf burger that had three. Of course I topped it with an egg and bacon. It was very tasty and cooked well. <br><br>We also got the Mac and cheese which was also good and the elotes. The fried avocado was great!<br><br>In the end the question is, would I return? Heck yeah!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/nptz5U3Kht6F8pQSWSZe2w/348s.jpg", "caption": "Bad burger and fries."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/zUTd31ST_WLk4CnRZcJYDA/168s.jpg", "caption": "Inside is classy"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/VByomhpsHHKZ52oJ7e4qow/168s.jpg", "caption": "Love the mural of the bad wolf and little red!"}]}}, {"review": {"des": "Great menu selections for food and drink. Cool laid back environment. Great outdoor and in door seating. Very attentive & friendly staff!<br><br>Now to the burgers, whewwwww i don't know what the season there burgers with, but they are out of this world. I highly recommend! Great cocktails and beer selection as well, awesome salads, and appetizers! <br><br>Great ambiance and decor in the inside with the dim lights that gives it that trendy laid back vibe! Waitresses and staff are very polite and all around great! <br><br>I highly recommend this spot if you live in the area or visiting chicago! You wont be disappointed! The Bao buns here are awesome!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/uLDX-sl6jAeUu_8PWxCXyg/348s.jpg", "caption": "Best burger"}]}}, {"review": {"des": "WOW WOW WOW!!!!<br>This place has changed my life when it comes to Burgers!!!<br><br>First off this place has a very hipster but at the same time grown and sexy vibe. Lots of different seating available even communal tables. So if your dining by yourself you can get to know others easily. The bar is small but quaint and the bartenders are awesome to watch and chat with. <br><br>The drinks are all mixology concoctions, you can tell that someone has really but thought and time into creating these drinks. I would come hangout just for the cocktails because they are that good. <br><br>The food:<br>I was lucky enough to try a couple of different things on the menu with my husband. We tried two tacos the shrimp and the pastor. Both were AMAZING so much flavor in every element of the dish. Then we split the pork bao HOLY MOLY my taste buds were tap dancing as the flavors exploded in my mouth. The the final dish the Sliders that I now have dreams about. They use the best meat on the planet and flavor it with CRACKKKKK. I will never be able to have a burger somewhere else again that's how amazing they are. <br><br>This place gets two thumbs up and is a must try if your in Chicago. You will not be disappointed by the drinks or food here. The staff is very quick and friendly. You should be able to find street parking if not there is a small parking lot in the back of the restaurant.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/DLQSpPrUShRBr29syKPH1Q/348s.jpg", "caption": "El Chupacabra"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/xDAJoInRvaWRs779T5tK-w/168s.jpg", "caption": "Little bad Mule"}]}}, {"review": {"des": "Update here.<br><br>Stopped by yesterday to grab a burger on a work trip, and it was good as usual but I did have to remove two stars from their rating for two different reasons.<br><br>Burger cook temp - We were asked what the cook temp should be on our burger, and my colleague even went the extra mile to understand what they used for definitions of cook temp. Apparently Medium is actually medium rare. Blah blah blah. Realistically the patties are too thin to time any of that and I'm quite tired of places asking the cook temp when they just aren't going to deliver. I almost laughed at the server when he asked us how we wanted them cooked but didn't want anything happening to my food before it arrived. Anyways, I asked for Medium, got Well. My colleague wanted rare, got Well. JUST STOP ASKING!<br><br>Fries - Got the bottom of the bag for sure, most fries were smaller than one knuckle on my finger. <br><br>Pretty pricey for being let down.", "pics": null}}, {"review": {"des": "I'm so unbelievably happy K, T, and I went here. Let's just dive right in, shall we?<br><br>Ambiance: Small, cozy, rustic location. Has a few tables and a bar. We came on a Monday around 2pm so it wasn't packed...<br><br>Service: Since it wasn't packed, it was weird service was slow. This was when our food was arriving and when we wanted the check. It could have been because our table was in the corner with the velvet couch and there was a wall partially blocking us, but we were super hungry. Our waiter was friendly and checked up on us enough times during the meal, though. <br><br>Food: <br>Mussels- The broth was good, definitely unique and tastes good when you dip the bread into it. Mussels had a nice texture. <br>Jumbo Fried Shrimp- We ordered the half pound. It was enough as an app for the 3 of us. Like the twist with the cocktail sauce. It has the texture of ketchup. <br>Crab Cake- Good size and meaty. Tasted real and not like imitation crab. But worth $15? I don't think so. <br>Pork taco, Shrimp taco, Steak bao- This was my order. Allll of them were delicious! The amount of meat inside each wrap was so filling. I'm so glad they didn't skimp on this like some other taco places do. <br>Chicken, Fish, Pork baos- K and T ordered these. They loved them! <br>Elotes- AMAZING. One of the best parts of the meal. Salty and savory, just how we (especially T) likes it. People rave about the fried avocado but personally I like it better raw. <br><br>TL; DR- If you're reading this and thought we ordered too much food.....you'd be right haha. We were so full! All of this cost about $90. Worth. It.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/HvG4lDEzbWb81Epv9o8EPQ/348s.jpg", "caption": "From top left (clockwise): chicken bao, pork bao, fish bao, pork taco, shrimp taco, shrimp bao, steak bao"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/O7eY6fQcB68HZFxBzi2dHw/168s.jpg", "caption": "1/2 pound Jumbo Fried Shrimp, Mussels, Crab Cake"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/FZUHseHF2gxP6TePeRfPgg/168s.jpg", "caption": "Elotes - ahhhmazing"}]}}, {"review": {"des": "Ehhh. It is a good neighborhood restaurant not worth a drive though. We had the Bad Burger, Waldorf Salad and Chips with Salsa and Guacamole. My favorite was the salad, but I took issue with the burger. It had a strange consistency - its buns were very....sticky? Every bite was kind of gooey and it didn't have enough pickles.", "pics": null}}, {"review": {"des": "Came here on a whim with a coworker a few weeks ago.. everything we had was fantastic!! The service was great.. drinks, food and music was as well.. lots of drinks to choose from.. great atmosphere.. I'll be back!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/VRuOsk8FaklqiMeANmMtNQ/348s.jpg", "caption": "Steak!! I subbed fries for mac.. a very delicious decision"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/xf0Ernmq4z76ktfCzDZcJQ/168s.jpg", "caption": "Don't remember the name but it was a delicious fish dish"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/YWqoY-jEpwP4m35OhYh0Ug/168s.jpg", "caption": "Elotes app with fried avocado"}]}}, {"review": {"des": "Wow. <br>I'm not sure why Little Bad Wolf doesn't get more publicity for their burger because damn that thing was good. There's a lot of things you can add too (I had an egg while my wife enjoyed some onion straws). Good bun, two patties, perfectly cooked, my god I'm drooling again...<br><br>I didn't love the ambiance - it was way too loud for a place that's more of a restaurant and the left hand side is just all black with no character. However, the service won me over when they comped our drinks because they felt we had to wait too long for our food. It did take a while, but that was a really nice gesture!<br><br>Go get the burger and everything else will take care of itself.", "pics": null}}, {"review": {"des": "Ate dinner here when we were visiting my best friend about a month ago.  What a lovely little spot!  <br><br>We were seated right away about 5pm on a weekday.<br><br>My cocktail (El Chupacabra, I believe) was both beautiful and well made - win win!  Interior is very cute and hip... fresh flowers on the tables and cute/funky lighting.  Lots of high-top seating and some booths, too.  Small patio with seating for those precious spring weeks after the snow has melted and before it becomes WAY too hot. :)  <br><br>I ordered the sliders and they were actually pretty large and way too much for me to eat.  Great quality - and very tasty salad on the side.  Delicious.  Our server was attentive, friendly and informative.  We had a really lovely time while we were there.  Would recommend!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/5ZnRO_lKZTYEfmldM-CHnw/168s.jpg", "caption": "Delicious cocktails!"}]}}, {"review": {"des": "Wow. That's about all I can say. My wife and I came here at around 6:30pm on a Friday and were told the wait could be about 50 minutes. It didn't seem that busy, but our hostess told us she had to say that in case people stayed a long time to talk. They do not take a reservations, but do write down your name and phone number. We went on a walk around the area, which is very nice to walk, and they called us in about 15 minutes. We sat at a shared table with another nice couple. Our waitress was very attentive and friendly. She took our orders quickly. We had the tuna poke to start with. This was the only disappointing thing about the night. It was lacking in flavor and the portion was rather small. I think next time we would do a salad or the guacamole (although the jumbo shrimp looked good too!) Finally on the the most glorious part: the burgers.<br><br>My wife ordered the classic burger with two patties and added an egg. I ordered the Wolf (three patties of heaven topped with cheese, onion strings, pickles, and everything else good in this universe). When I tell you that the first bite into this burger had me lost for words, I literally could not think for about 25 seconds as I savored every second it was in my mouth. For $17, you get the most flavorful and amazing burger I have ever had, plus a very generous portion of their tasty fries (or a nice salad if you are somehow kidding yourself that it's going to make up for the heart attack burger you are about to ingest). It definitely stomped on Au Cheval in my opinion. We have yet to try the Loyalist or Kuma's Corner yet so we will see, but either way we will definitely be back here again!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/J-Nzn9WrEEkumqidCOLaqA/348s.jpg", "caption": "The Wolf Burger, best I have had in my 24 years!"}]}}, {"review": {"des": "LBW is a stellar whiskey bar that just happens to serve one of the best burgers in Chicago.<br><br>The Wolf Burger is slightly absurd. Three perfectly-cooked patties, thick-cut bacon, a fried egg, cheese, onion straws, mayo, and topped with house-made pickles. Fair warning.. You may need a knife and fork.<br><br>Unsurprisingly their sides are equally impressive.. The bacon mac & cheese is baked to perfection. The elotes is taken to the next level by the addition of beer battered avocado. And the fries.. Well you'll just have to get them to find out.<br><br>All of the above accompanied by friendly service and a reasonably-priced pour of Weller Antique 107.. Doesn't get much better than that!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/mIUOdllCi7SZzxuDBu9Vxg/348s.jpg", "caption": "The Wolf Burger; Medium Rare."}]}}, {"review": {"des": "TL;DR - the Bad burger holds its own to Au Cheval's and the tuna taco is AMAZING! <br><br>This was a phenomenal dinner. To start off, Kevin, our waiter behind the bar was amazing. You'll have excellent service if he's taking care of you! <br>We sat at the bar since it was the only spot without a wait and had no problem with it. Service was a tad slow, but it was a full night, so it's understandable. We got the bad burger, elotes, chicken bao, fish taco, and tuna taco. <br><br>Burger - delicious. I'm a huge Au Cheval fan and think it's the best in Chicago, but this burger stood up to the challenge. From the bun to the patties down to the gooey texture of the cheese, every flavor and texture of this burger stood out and were spot on. We got the onion straws on top - a must have. They were awesome. <br><br>Elotes - very good. I love the big chunks of corn cut straight from the cob. I thought it was a little spicy for my taste, but great nonetheless. The fried avocado on top is a really fun addition!<br><br>For the tacos/baos - these are in order from my most favorite to least:<br>Tuna taco - wow, beyond delicious. As fantastic as the burger was, this taco was the star of the show. The fish was super fresh and it was such a light and refreshing dish. It was so great that as full as I was eating all this food, I ordered a second one cuz it was just THAT good! It's a must have! I'll definitely be back to try the tuna poke appetizer!<br> <br>Chicken taco - I liked the peanut sauce and the bun was exactly what I pictured it to be. It was good, but didn't blow me away as much as the tuna taco is all.<br><br>Fish taco - this one was okay. I think it was just had the least amount of \"wow\" factor. Nothing bad about it though! <br><br>Excellent meal and we will 100% be back!!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/S8FUQicFDu_rvU2qnrxFBg/348s.jpg", "caption": "Tuna taco. So outstanding that I ordered a second one after I stuffed myself with all the other food! Get this!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/G4DuqC1runpU09_hc1BM8w/168s.jpg", "caption": "Bad burger"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/KHqII-XV5YpPxgm5z5mVGA/168s.jpg", "caption": "From top - chicken bao, tuna taco, and fish taco"}]}}, {"review": {"des": "Definitely one of the best burgers in town. The only letdown I have is that they don't serve sweet potato fries (sigh).<br><br>For your convenience, here's a grossly biased (i.e., I prefer soft buns, flavorful sauce, cheesy, generous portion - good beer and sweet potato fries are a plus) verdict of  burgers in Chicagoland so far: <br><br>Best: Bluebird, Mott St, Little Bad Wolf, Burger Bar  <br>Great: Kuma's Corner, Au/Small Cheval, Grange Hall Burger Bar<br>Okay: Umami Burger", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/cyfhY3S7iM3drsBbUIO2_g/348s.jpg", "caption": "Bad Burger with everything"}]}}, {"review": {"des": "Loved this place!  It's such a hidden gem with not only delicious and a variety of drinks but their burgers are amazing. They are so simple but full of so much flavor! <br><br>If you do go, I recommend you guys try the Mac and cheese and for sure the elote. I promise you won't regret it!", "pics": null}}, {"review": {"des": "A must visit in Andersonville: what i mean by that is this place intrigued me with its hype and no-reservation policy, and i came here and loved every bite of their food, but not somewhere that makes me come back again and again.<br><br>Food: we got fish and shrimp tacos and pulled pork bao (the bao is taiwanese gua-bao style bao, not the traditional Chinese Bao, still tasty tho). Since taco and baos are of the same price, i would recommend go with bao since the soft buns mix well with the flavorful fillings. I liked pulled pork better than fish and shrimp. <br>I came here because i have a thing for burger, have been on a mission to hunt for chicago's best burgers, their little wolf burger is pretty hearty with the triple meat patties. It tastes good but nothing special about it, taste like a good cookout grilled burger with mayo, bacon, and fries onions. I loved the thin cut fries tho! And the red pepper aioli (or whatever red sauce they added to make the aioli spicy) tastes good. They used the same sauce for their huge crab cake too. I love the giant one crab cake! (Or maybe just any food with a good amount of mayonnaise in it).<br>Cocktails: unique and fun! Super pretty too! We tried three and you wont go wrong with any of them.<br><br>Service: attentive but def took a while for the food to come. Outside seating is dog friendly too! Loved that!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/xBeWdEweG5Xz8SGWXXeA8Q/348s.jpg", "caption": "Red Grotto"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/cfYlS90N1DLKkw5AXvCLEw/168s.jpg", "caption": "Outdoor seating"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/s7Ri8oZomi3aKrDU6i9vZA/168s.jpg", "caption": "Green Eyes"}]}}, {"review": {"des": "Update: <br><br>Honestly, I LOVE the food and drink but service was pretty bad but they DID make up for it at the end. Trust me, I'm patient when it comes to service but this was excessive and I wasn't the only table blatantly annoyed. <br><br>1) We were seated at our table, not greeted for ~10 min<br>2) Our STARTER side salad came out 50 MINUTES after ordering<br>3) I asked 3 different people for our server<br>4) My drinks were left empty<br>5) Manager had to come out and talk to a different group due to disappointment<br>6) Server finally came out and defeatedly blamed it on the kitchen (kitchen likely didnt help but she could have done a lot more than she did) She honestly made me feel bad for my simple requests. <br>7) Food came out more than an hour later<br>8) We literally never saw our waiter after the 1st drink and an apology at the end. <br><br>They comped our meal which I was pleasantly surprised with. Must have been an off day, but I WOULD STILL RETURN because management was able to take care of us and food is phenomenal", "pics": null}}, {"review": {"des": "Little Bad Wolf is the spot everyone has bookmarked because it's known to be amazing. And guess what? It IS, in fact, pretty amazing.<br><br>My fiancé and I shared a bunch of dishes, including:<br>-Bad Wolf: double patty, American cheese, pickles, mayo and the works. Delicious! Best burger in Chicago? No, not in my opinion, but still great nevertheless. <br>-Steak Taco: SKIP. Quality meat, but SO tiny. When they brought it to the table I laughed. Not worth $5. <br>-Elotes: the corn of my dreams. Tasted like we got it off an authentic street cart, but with a twist of fried avocado. <br>-Mac&cheese with bacon and scallions: rich and sinful. Not overwhelming, just perfect. <br><br>It's a teeny tiny restaurant, especially for the amount of foot traffic they have. We sat at the communal table, which was totally a-okay. <br><br>Solid 4 star experience. We would definitely come back :)", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/8X4yortPq9llJaq6lHiPVg/348s.jpg", "caption": "Bad burger $13 with crispy onion added for $1"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/-T4Vc2ktYvQIR2jBl-vjww/168s.jpg", "caption": "Macaroni and cheese with bacon and scallions $6.50"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/mtekNBmylbY6ryp3rg0srw/168s.jpg", "caption": "Elotes with beer battered & fried avocado $6.50"}]}}, {"review": {"des": "Amazing. Seriously one of the beat burgers on the city.<br>I also love the tacos -- the fish tacos and vegetarian taco is amazing!!!", "pics": null}}, {"review": {"des": "I was so excited to try this place. SO EXCITED. I love burgers. I love alcohol. I love bars. I love bar food. I was SO EXCITED to try this place, I cannot emphasize that part. I read the reviews that the burger here was better than the Au Cheval burger. Au Cheval is my favorite burger so I was looking forward to it. <br><br>However I was disappointed. Don't get me wrong. The burger was good. But to compare it to Au Cheval? Me thinks not. I got the wolf burger. It was a messy burger. The bun support was not strong enough and the egg yolk, cheese, grease from burger destroyed the bun easily. I was eating small pieces with my hands. Lol. The bacon wasn't anything special. It was just regular thin crispy breakfast bacon. No thick cut so don't expect that. Don't get me wrong, it's not a bad burger but for the hype it got, it was a bit disappointing. The Mac and Cheese was good. If you pay an extra $4 you can substitute your side with it which I did. <br><br>Also got an old fashion. I think the bartender was new or in training. Very nice friendly lady but the old fashion was awful. Tasted nothing like an old fashion. It was just bourbon or whiskey. Lol. But she was nice so it's all good. Service again was fantastic here. Very friendly engaging servers/bartenders. It's a small space, much smaller than I thought so luckily we were able to get a seat at the bar on a Sunday afternoon but I would not want to know what it's like on a Friday/Saturday night.", "pics": null}}, {"review": {"des": "My family and I came here early on a Saturday and it was very slow in there, maybe 2-3 other tables had people. That said, our service was not what I would have expected for there being so few people. We only saw our server once after we ordered food and that was to bring us the bill. No refills on drinks that weren't water and had to flag down one of the other servers to bring us some condiments. Normally I wouldn't have minded slow service, but I could turn around and see our server standing at the bar talking with other staff for the duration of our meal. <br><br>Food was pretty decent though, the fries and aioli especially, so it gets points for that, but definitely not $50 for three burgers and no service good.", "pics": null}}, {"review": {"des": "The spot is smaller than pictures insist, but it's only a problem cause the place is popular and busy. My wife and I visited tonight, a beautiful Wednesday night. Outdoor seating was a half hour wait. Our seat took fifteen. We were told to grab a drink at the bar, which was crowded, but it wasn't uncomfortable. Just busy. <br>       The decor was hip and chic. It was dark, walls black, and lights glow by very warm above. He bartender took our drink orders quick, and made them just as swift. I had an old fashion and Jacky had a Green Tea infused vodka, mint, and cucumber type drink. Hers was better than mine. I thought my drink had a bit too much bite for an old fashion. <br>         Once seated, our order was taken quickly. Service was attentive, not over bearing, and prompt. The crowd was a mix of young hipsters, middle aged chic parents, and older retired couples that look cooler than I could ever imagine to be. <br>      I got the Bad Burger, which was 2 patties of beef, cheese, house made pickles, and I added onion strings. You pay extra for those by the way. Jacky got an el pastor taco, and a shrimp taco. Both were tasty, but you'll get better at Antique Taco. The side of elotes we got was delicious though and the highlight of our meal. <br>        Overall it was a very fun experience and it's always nice to go to a place like this considering I have kids and it's nice to get away. Drinks were solid and they have an amazing bourbon selection including Pappy. Food was good not great, so I felt it over priced. Service and ambiance were top notch. Solid neighborhood spot, if you got the cash to spend.", "pics": null}}, {"review": {"des": "Everyone brags about the burgers, but I can't just get lost in the food alone. Little Bad Wolf is an intimate venue where you need to arrive before the dinner rush if you plan on dining at one of their spacious tables. I was catching up with my friend, so I wanted to spread out. I almost had to bully the hostess into claiming the last table. She was reluctant to seat me because my friend's train was running 10 minutes behind. I tried to make up for it by ordering my drink and appetizers right away.<br><br>We got the lumpia and the mussels. Both were perfect, but I tend to like saltier foods. The lumpia dipping sauce and the broth for the mussels were both too sweet. Don't get me wrong, despite the sugary vibe, they were delicious. I ate most of the mussels on my own. I really enjoyed the bruschetta-type bread that instantly absorbed spoonfuls of the broth, yet still stayed crispy with every bite. <br><br>My dining companion read the reviews before arriving, so right away he ordered the burger. So boring! Everything looks good on the menu and for some reason, just sitting in the restaurant for 10 minutes leaves you with the feeling that whatever you order is going to taste good. I went with the steak and frites and the meat was perfectly pink on the inside, seasoned to suit my savory palate on the outside. So juicy! My only criticism of the dish would be that there was no way to cut into the meat without pushing half of your french fries off of the plate. Thank goodness my +1 left his appetizer plate on the side of the table. I was able to wipe the stray fries onto the plate so I didn't have to stare at a mess. <br><br>The atmosphere has an old-timey pub-style feel, and the light fixtures appear vintage. The low lighting is just what I look for when I dine out. I'm not interested in feeling like I'm in a spotlight while dine. The music is perfect for the dark atmosphere. I'm not sure if this genre is played every night, but if you're into the goth scene, get ready to rock out to classics like Morrissey, The Smiths, New Order, and Depeche Mode. It's just a shame that everyone eating there gets loud. I really wasn't able to exchange too much conversation with my friend until the drive home.", "pics": null}}, {"review": {"des": "I had the Wolf Burger from here and it was pretty good! However, I thought my burger had a little too much black pepper in it. Other than that, very satisfying. Is it worth the trip up north - DEFINITELY. Will I be back again - FOR SURE. <br><br>Additionally, I got a side of the mac and cheese, fries, and elotes. All of the sides were AMAZING.<br><br>One thing I'd recommend is getting rid of the beer battered avocados on the elotes. It is not a good touch. <br><br>I loved the little curtain you need to open in order to get inside the restaurant.", "pics": null}}, {"review": {"des": "After seeing all the good reviews I had to check this place out for myself! I went with a few girlfriends on a Saturday night. It had a super nice night out vibe with a bar, dim lights, and great music. I'd say this is more a place to chill out and have a few drinks with some friends, or a date.<br><br>We sat at a table but I believe there were high tables to stand around and mingle. Also, I noticed seating out front. <br><br>I had the baos, which were good, but I was hoping they were more saucy. Felt like I needed to add hot sauce for flavor. The Mac and cheese though, hit the spot. BEST Mac and cheese I've ever had. It had a very unique taste to it... you just have to try it for yourself! And I recommend the Green Eyes cocktail! They also had a selection of beers to choose from! <br><br>I'm definitely planning to come back here to try more of the dishes with my boyfriend. From seeing what everyone else was getting, the food presentation was on point. <br><br>Go here if you like good drinks, good food, and a night out vibe without the huge crowd.", "pics": null}}, {"review": {"des": "Boy it takes such a trek for us to get to this place - I'm happy to report that it was a worthy trip. Best burger ever? Not really. Good burger, no wait, great sides, and tons of other options? Absolutely. <br><br>We each got the Bad Burger with two thin-ish patties, pickles, and mayo. The first few bites were heavenly. The buns were extremely fluffy, perfectly lightly toasted, and oh so greasy. The beef was fresh, and very nicely cooked to medium with some pink visible. Other burger places often overcook the thin patties, so the doneness of their burger was spectacular IMO. After I got over my initial starving stage though, I realized how salty but not beefy the beef was. They went very light on mayo which was good, but honestly without the pickles and mayo, the beef would not have been impressive. On this point, Au Cheval outshines LWD. The sides - fries, brussels sprouts, and mac n cheese - were all pretty good. <br><br>Burgers aside, I am so intrigued by their tacos and baos. Great food selections coupled with extensive drink (beer, wine, and whiskey) menus make this place repeat-worthy. Did I mention no wait?", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/wOuKpQoLENcCcUuAfZZ6fA/348s.jpg", "caption": "subbed fries for brussels sprouts and mac n cheese as sides"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Nd4N6nHEiR2Q52z_Wa3NbQ/168s.jpg", "caption": "bad burger w/ fries"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/T_8laywAywL94QIC2O1uCQ/168s.jpg", "caption": "empty restaurant at 11am"}]}}, {"review": {"des": "One of my top 2 favorite burgers in Chicago! The battle between Little Bad Wolf and Au Cheval continues...<br><br>The burgers are IMO the highlight of LBW. If you wanna go big (or go home, ya know), get the wolf burger with a monstrous three delicious patties. It's hard to describe how big the wolf burger is until you see it for yourself (though I speculate it's mostly the onion straws that add on so much volume). Perhaps the most logical way to tackle the beast is by cutting it in half. <br><br>If you're not up for the challenge, opt for the two patty bad burger instead - the beefy flavors are more prominent since there's less toppings compared to the wolf burger. This is your more typical burger, but made to absolute perfection. The bun is buttery, soft, and lightly toasted. The beef patties slightly salty but with delicious flavor. The 2 slices of American cheese delightfully melted between the patties.<br><br>Burgers come with a side; you can choose from fries, mac & cheese (+$3.50), or brussels sprouts. Brussels sprouts come with bacon and a lot of onion straws, so #lifehack you can put those on your burger instead of ordering the topping separately.<br><br>Can't vouch for anything else on the menu since I come here solely for its burgers. But seriously, if you come for the burgers and beer (they have such an extensive collection), you won't be disappointed.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/I3cNhcvPtynrCoTdr1FukQ/348s.jpg", "caption": "Ohmygawd the wolf burger was so amazing"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/yeoClO58377VE8QQZMsTHw/168s.jpg", "caption": "Wolf burger and Mac & cheese!"}]}}, {"review": {"des": "We came in for a quick bite on Saturday before dinner rush.   What a great little place.   Food was amazing!!!!! We had a burger and the fried chicken.   OMG THAT CHICKEN sooo good, and the burger was right up there with perfect bun and homemade pickles.   The type of burger that just melts in your mouth.    Cocktail list and beer menu on point!  Will be back if we are in the area.", "pics": null}}, {"review": {"des": "This is one of the strongest five stars I've doled out in quite some time. It's so strong that I am currently trying to think of an \"excuse\" to go back really, really soon. <br><br>Little Bad Wolf has a practically non-exist presence from the street. We missed it the first time and ended up circling the block before we saw it. Their reputation precedes them and they don't need a flashy storefront. We walked in shortly before 1:00pm on a Saturday afternoon. We were quoted a 20 minute wait with the promise of a text message when there was room for the two of us. So we walked around the neighborhood, found a fantastic pie shop and wandered back toward the restaurant. While we were standing out from (for maybe a minute), the host came outside and welcomed us inside to take a seat. No text necessary when you have a fabulous host paying attention to the details. <br><br>We sat at the end of a communal table which worked out perfectly for us. Our server was tuned in to everything. He made appropriate suggestions when requested. He spaced out our food as requested since we were tasting a wide variety of items. He was attentive and never disappeared for any length of time yet he was unobtrusive. He was a stellar server!  All of the wait staff was very attentive. Before I could finish my water, it was being refilled. Every time. And I drink a lot of water. The atmosphere is a little loud and the tables are deep so this is not an ideal spot to carry on a deep, private conversation. But we had a great time!  <br><br>I had a nice sweet hard cider. No idea which one as our server made the suggestion, gave me a sample and that was a done deal for me. It was very yummy. My husband tried a couple beers our server  had suggested throughout our visit. One was a little too hoppy for him, but overall they were good suggestions. <br><br>We started with 1/2 pound of fried shrimp and cocktail sauce. Funny enough, we were actually planning to go to a shrimp in a paper bag sorta joint and changed our minds today. Needless to say, I'm so glad for the changed minds. The shrimp were huge, clean, lightly breaded and piping hot when they hit the table. Two small bowls of cocktail sauce accompanied them - one with a fair amount of horseradish. I mixed that horseradish into the sauce and I was feeling the heavenly effects of Little Bad Wolf. <br><br>We moved on to split a burger and fries. My husband rocks and agreed to skip the cheese. So our burger arrived with pickles and mayo on the side as well as a very hefty portion of fries and a cup of maybe chipotle sauce to dip them in. This burger lives up to the hype. No exaggeration. This was one of the very best burgers I've ever had in my life!  My \"eh, whatever you want\" husband even fawned over this burger. The fries are really tasty, but were kinda bits and pieces and hard to eat. We knocked a few of them out, but brought the rest home for our son to enjoy. <br><br>Finally, we completely overdid it with the following...<br><br>Mac N Cheese - complete with bacon and love. I'm sure that was love in there. And thankfully this reheated well at home. <br><br>Chicken Bao - Don't walk, run to Little Bad Wolf for at least one of these bad boys. Our intuitive server suggested this one. I'm thinking we were eating tender chicken thigh with carrots, red bell peppers, a little cilantro and a fantastic Thai peanut sauce. The bao bun was so fresh. This was a memorable combination of flavors!<br><br>Fish Taco - yes, the fish is bigger than the tortilla. And yes the corn relish adds to the Taco Joy. <br><br>Shrimp Taco - These shrimp were awesome!  And the sauce was sweet yet tangy. I could have skipped the cojita cheese, but that's just me. We skipped the tortilla on this one. <br><br>Al Pastor Taco - By this time, actually finishing the tacos was looking unlikely. Thankfully, this portion was reasonable and we just ate the filling. Their pork was bursting with flavor!  The pineapple pieces were appropriately sized. The onion wasn't overpowering. We'd both eat these again without a doubt. <br><br>Even pacing out the food, got us out of there pretty quickly, but I did check out the washroom before we left. The soap smelled so good that I took a picture of it and I'm going to hunt this stuff down. It's just one more example of Little Bad Wolf paying attention to the little things that create the full experience. Go - experience Little Bad Wolf. You'll be glad you did.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/qkHyCj4NuIfk4OCKEy35ag/348s.jpg", "caption": "Ah yes...the al pastor."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/sKvOa61G_iUtvYt5emwvIA/168s.jpg", "caption": "There may only be two shrimp in there, but they're large and in charge!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/SdHIfjs2iWnr3ZSfbe77Kw/168s.jpg", "caption": "Check out this fish taco!"}]}}, {"review": {"des": "The burger is so succulent and full of flavor. My son and I ordered the shrimp and sliders. It was delicious. Our fries weren't as good though. They were really greasy but overall, we were satisfied. We'll come again. I didn't mention it before but the customer service at First was a little slow a really got good towards the middle in the end. I forgot my wallet and they accommodated me. My son really wants to come back for the sliders.", "pics": null}}, {"review": {"des": "We live in the neighborhood and used to come here often. Here is the scoop: Burger - yes. Greasy and gross looking, but tastes perfect. And the fries are beyond beyond beyond perfect, always. Waldorf Salad if you're into that- yes. Delicious, every time. <br>Tacos- yes. Great, but we have a place for tacos already that we prefer. Mac and cheese - yes! But get the family portion and you'll love it so much more than the side (maybe the side is too dry??). <br>And now the bar: amazing selection. A couple of the bartenders are skilleD! It's loud so conversation can be tough unless you sit next to each other. <br>And now for the bad: why is the wait staff always angry? Or at least the last handful of times that was our impression. Haven't been back in a couple of months for this reason. Cheer up dudes- your place is just right", "pics": null}}, {"review": {"des": "The food and service was great!!! I got to say they play the jamz!!!!! Only thing I didn't like was the chairs they high chairs kind hurt my legs after 10 min and no place to hang your bags under the if it's kind of small....food came fast and hot which is very important. <br>Didn't have a drink but the Milk Stout was pretty good!!!!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ZAnmTklEzPTzZtTJDu4ejw/168s.jpg", "caption": "Elotes and Fire chicken bao!!!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/VWwZoadHpvbdTUR15PXv3Q/168s.jpg", "caption": "Milk Milk Stout , Left Hand Brewing Company , Colorado , Milk/Sweet Stout"}]}}, {"review": {"des": "The service was amazing. My mom isn't too sure about what kind of drinks she likes and our waitress was so kind and went to great lengths to explain each of the cocktails to her and made sure after she chose one, that she was happy with it. She was wicked sweet! The food is great as well. Good atmosphere and nice dim lighting. Enjoyed my experience for sure!", "pics": null}}, {"review": {"des": "I love that is it open late night. So I go after I get out of work. How ever it is soo loud and playing club music. The servers are attentive but most of the time seem to have been drinking. Enough that I notice. Saluting or inappropriate. But is usually in a good manner. The food is real good though. I love the burger, beef bulgogi boa and the poke. The elotes are hit or miss. Twice the corn was not fresh and tasted sour like it went bad. But when it is good it is real good. The cocktails and beer  selection so always good as well.", "pics": null}}, {"review": {"des": "Burgers, Beer, & Bourbon... need I say more?<br><br>OK I'll say a few more words about this amazing Lil spot. So..I found myself in the neighborhood and starving. I did a quick Yelp search and plotted my course to LBW.  Street parking was easy but it was probably because it was mid afternoon on a Monday.  The outside of the place is very low key and on the side of the block.  <br><br>Once I walked in I was immediately greeted and I grabbed a spot at the bar. The place has a cool vibe and not very big. The bartender Kevin was very helpful and nice. All I asked was what is the best thing on the menu and he said the Burger. And boy o boy was he right. Perfect seasoning; nice and juicy; thinly sliced pickles and lastly a good piece of bacon.  The thin fries were also very good and are crunchy and not oily. <br><br>On to the Beer... the draft selection is always rotating and the bottle list is crazy. So if you are looking for a good craft beer spot then this is the place. <br><br>And the Bourbon... the most impressive list of bourbons that I have seen outside of Kentucky. This place even has the ever elusive Pappy's. <br><br>The other items on the menu seem great and I can't wait to go back and try them. That is probably when I'll have to update this review for the 5th star. Cause I definitely wanna check out the tacos and some of the mixology creations.", "pics": null}}, {"review": {"des": "This place is a local<br>Favorite! Everything from corn to their salads to Mac n cheese it's all delicious! Their cocktails  are great too my favorite is the lychee one. There's a wait during dinner especially weekends. It's pretty loud inside but who cares you'll barely be talking since you'll be eating all the good food! I haven't had the burgers but my husband says it's the BEST BURGER he has every had (he's a burger junkie). <br><br>Usually like to grab a drink at the bar if there's a wait and there's aren't many VEGETARIAN options but I usually get a salad (they're huge) and a side of Mac n cheese or corn!", "pics": null}}, {"review": {"des": "This place is super cute, classy, friendly, small, quaint and has extremely tasty food that will add to your waistline.<br><br>We discovered Andersonville and LIttle Bad Wolf on the same late fall Wednesday afternoon and fell in love with both. It is a very small place, so on a busy evening or day you might be sharing a table with someone. If this is something you struggle with try to go at a less crowded time. We arrived just before 1:00pm for lunch and the timing was perfect. There was a good lunch crowd and just enough room for everyone...my husband and I were able to sit at a lovely corner booth and enjoy the atmosphere. If needed there was room at our table for another couple and I think it would have been ok.<br><br>There were two servers working the bar and room. They were super friendly and good at their job. Our waitress was so patient with me as I browsed the draft beer list trying to decide what might be a good pick for me. She brought me three different samples and gave me helpful feedback on the selections. I was impressed with the variety and her knowledge. <br><br>My husband and I chose the Big Bad Wolf Burger. An amazing burger with three medium patties oozing with cheese and a sunny side up egg - also topped with onion straws. It was a messy and fabulous experience that my husband and I shared. So wonderful. The only downside is that the fries must have gotten done just a bit before the burger because they were a bit cool---I like piping hot fries. <br><br>We loved the beer, food, staff, atmosphere, and the music. Looking forward to going back!", "pics": null}}, {"review": {"des": "If you're looking for decent customer service, this is not the place for it!!  <br><br>Servers had really bad attitudes. During conversation, one would walk away before you're even done talking. Everything is very \"matter of fact\" - so expressing things you might like in addition to your food or the desire to have something prepared a certain way is almost unwelcome. <br><br>Food was ok. Would have been better if the food order was prepared right to begin with. There were a lot of errors. A LOT. <br><br>Im definitely scratching this place off my list. My experience was bad. The service was horrible. And we left annoyed!", "pics": null}}, {"review": {"des": "I had their biggest burger on my birthday and it was super delicious.<br>I'd recommend the place to anyone who likes burgers.<br>Their appetizers aren't their strength, although customer service and great environment definitely uplift that.", "pics": null}}, {"review": {"des": "A consistent favorite in my hood. Tiny food menu - and that's fine. The burger is solid (several friends call it one of the best), but it's the bao that are great. Any of them.<br><br>Bao, baby, bao.", "pics": null}}, {"review": {"des": "Great place for a good food.<br>Also stuff is friendly and polite.<br>A truly gem in  Andersonville area. <br>Thumbs up.", "pics": null}}, {"review": {"des": "I had the Bad Burger with a side of Mac and it was great.  I love the atmosphere, and the whiskey list was about as good as it gets.  It was a little too early to get crazy but I had a pour of the William Larue Weller for dessert and couldn't be happier about it.  I'll be back again, without question.. as often as my wallet allows.", "pics": null}}, {"review": {"des": "The decore and atmosphere is cool. Tried Baos here and it's really great.<br>Bar looks nice and bartender was friendly and informative. <br>99% will be back", "pics": null}}, {"review": {"des": "This one has been on my \"go-to\" list for a while. So glad I went. My boyfriend and I arrived around 7:30 on a Friday night with no reservations. We had to wait an hour, but it was a nice evening and there were benches outside. The restaurant itself is really small so there's nowhere to stand and wait. We were seated with another couple-  some tables are community-style. The drink menu is huge so anyone can find something they'll like. We were starving so we went straight to the entree. <br>I ordered the Bad Burger, my boyfriend with the bigger appetite ordered the Wolf Burger. Both were AMAZING. They're served with fries- very crunchy, small ones. Staff was very kind and the food was great. I'll be back when I'm due for a good pub burger. Might be sooner rather than later, my mouth is watering as I write this.", "pics": null}}, {"review": {"des": "This place is one of my favorite restaurants in the area. You cant go wrong with any of their drink or food options.  It can get pretty packed so best time to go is for early dinner or during the week.<br><br>Some of my favorite menu options:<br><br>Chopped Salad- Enough to feed 2-4 people depending on if it's for appetizer or main dish<br><br>Corned Elote- UHHHHHMAZING. Comes with fried avocado on top. This is an absolute must try dish!<br><br>Truffle fries- because if your ordering a salad it's all about balance.<br><br>Their burgers are huge and just as amazing.<br><br>Must try this place -you won't be disappointed", "pics": null}}, {"review": {"des": "Wow. This place is awesome. Don't be impatient; good chance there will be a wait. We did the Poke and chips with salsa and guacamole for apps. Really delicious. Friends had fish tacos and an enormous chopped salad. I trusted the server and went with the double cheeseburger and fries. So awesome. Fantastic flavors of beef and an interesting dressing. Fries are thin cut and fresh,  served with a slightly spicy aioli. Eat them fast as they cool off rapidly. More than enough on that plate to share or take home for a late night munchie after more drinking games. Staff is engaging and knowledgeable. The space is very unique with bar, communal seating, private tables and a vibrant patio. Definitely on the short list for return visits. Check it out!", "pics": null}}, {"review": {"des": "Found my place. Lighting, food, music was too loud but waitress was nice about it. Lived in Rogers Park for 2 months and have dined in twice", "pics": null}}, {"review": {"des": "For whatever reason Yelp is always directing me to this place.  The pics of their food and high ratings made me anxious to try this place.  <br><br>The service was outstanding.  The server recommended a cocktail and she could tell I didn't care that much for it and brought another (2nd best) one out at no charge.  Nice touch. <br><br>The food is as delish as the photos look.", "pics": null}}, {"review": {"des": "I was recently lured by my galpal to dine with her at Little Bad Wolf.  This venue is located on a block of Bryn Mawr between Clark and Ashland.  I was running late due to good ol' public transportation, so when I arrived through the door I burst past this heavy curtain that seemed to act as the Elizabethan vestibule or windbreak for this cool looking establishment.  Somehow my friend snagged a table for us, so I rushed over and did not have a look around at the colorful interior until we were leaving.  I think my friend must have culled the playlist while spending the few minutes waiting for me, as a heavy rotation of cuts by The Smiths and Depeche Mode was blasting throughout our dining experience.  I can almost imagine the dining tables being pushed aside in the late evening to make way for an underground dance floor scene.<br><br>Now on to the food.  I was hungry (like the wolf??) when I arrived, so fortunately my friend had already ordered appetizers for us.  LBW proclaims that it serves \"upscale bar food\" and indeed looking at the beautifully presented bowl of mussels that proclamation seems to ring true.  I'm no mussels expert but the one I tried was A-OK.  The tubes of lumpia (what - mussels and lumpia on the same menu?) were crunchy and enjoyable with the sweet and sour dipping sauce.  I wanted to try a burger here, so I went with the Bad Burger.  It was a hearty and juicy ensemble, with two meat patties, cheese, pickles and mayo.  The side of deliciously crispy fries were presented in a cutesy little fryer basket.  You can also opt for a side salad instead of the fries, but I'd say definitely go for the yummy fries!  My friend enjoyed her order of steak and frites, and the heaping pile of fries on her plate was so substantial that they could barely stay on the plate!  Have a drink or two as you may have to speak rather loudly to / at your server and / or dining mates.", "pics": null}}, {"review": {"des": "It was a good burger!!! Honestly, this would be my go to spot if I'm not close to Au Cheval. The only reason I gave 4 stars is because the fries were extremely salty and the bacon was pretty basic. Otherwise, great vibe, great service, and the burger was badass!!!", "pics": null}}, {"review": {"des": "We came year last week, but I was too busy to write a review.  Stopped by here today because I have a real F*cked up breakfast at Taco Hell, was on my way home and needed to wash the stench of over-fried flavorless food from my palate.<br><br>Last week and this week I ordered the Bad Burger.  Last week I split it with my husband...and there is enough there for two.  Michelle T mentioned that she and her guest split the Wolf Burger...can't even see that as the Bad burger is big enough!  Didn't get it with the onions, but got it with the egg.  We got the burger with a side of mac and cheese and that alone is enough for an entree.  Fries are good, but I would do the mac and cheese before I would do the fries.  We also got the appetizer Lumpia, which is a pork spring roll with water chestnuts, onion, and minced garlic.  Served with sweet and sour citrus sauce...very good.<br><br>My primary reason for going was to get the Bao as I love them and will try them any chance given.  At $4.25 a pop, a little on the steep side compared to what I get on Argyle, but they were very tasty.  I would recommend the Pork, Chicken, Shrimp and Steak.  DIdn't try the Fish because of the Wasabi Mayo...not a fan of wasabi.  <br><br>For a place this size, it has an impressive selection of whiskeys, wines, and beers.  And they have a very lovely sparkling rose by the glass that I am in love with.<br><br>Today was a take out order and I have to say that they do a nice job of packing the burger.  I got it with the mac and cheese and an egg.  It was very nice to see that they put the egg on the side to maintain the integrity of the egg before it went on the burger.<br><br>While waiting for the burger, I had a drink at the bar.  The bartender who took my order, Troy, was very nice and personable.  The staff overall seemed to be genuinely like each other...they were calling out drink orders and seemed to be having fun.<br><br>Overall, the place is small, which explains why there is always a long wait depending on what time you go.  There is one large communal table where you can sit and have dinner.  I honestly liked sitting there better than at the tables.  The tables are too close together for my taste.<br><br>Overall, this is a good burger joint, the only thing missing is an adult chocolate shake.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/QalWbdklwR56j-mgdmBedA/168s.jpg", "caption": "The Bad Wolf Burger at home.  They put the egg on the side"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/LoF7PvsyZmqcDHz6pu52Cg/168s.jpg", "caption": "The main bar"}]}}, {"review": {"des": "It's small and the wait can get long but the food is definitely worth it. <br><br>They have a large selection of beer and whiskey and the best burgers I've ever had.", "pics": null}}, {"review": {"des": "The food was great and so was the environment. Meryl was a great waitress she went above and beyond to help us decide on our food.", "pics": null}}, {"review": {"des": "This place is small.  A table can be hard to come by.  You're probably better of as a small party.<br><br>BUT... turns out a good friend seems to have an 'in' so the wait for a larger table was not too terrible... at 5:30PM :) <br><br>Little Bad Wolf has been here a while, and it's been on my list for years, but somewhere we just haven't tried it.  What a shame... it was so good!<br><br>I indulged in only one cocktail - the Manhattan.  The bartender knew what he was doing - it was exactly what I needed.<br><br>The menu is pretty varied - salads, tacos, burgers... for being a fairly small menu, there is quite a bit to choose in.  I was laser-focused on the bao tacos.<br><br>It's not like baos are a new thing.  Baos have been around since the beginning of time.  There were several options but I found the favorites to be the peanut chicken and the pork, with the chicken being the overall winner.  A plate of three was surprising substantial for a meal.  So good!<br><br>And while not a part of my original meal plan, we need to discuss the real show stealers, which were the brussels sprouts and the mac and cheese.  The brussels sprouts were roasted and seasoned perfectly, and full of greasy bacon.  The mac and cheese was full of gooey cheese and - you guessed it - more bacon!!  If I were to create my next perfect meal it would be one chicken bao, one mac and cheese, and one bowl of brussels sprouts.  ALL FOR ME!<br><br>The one thing I would have appreciated is that the burgers/sliders, while delicious, came only with American cheese.  I don't really feel like American cheese is actually cheese, so it would be nice to have a different option on that.<br><br>Overall pretty affordable; I think we ran about $40 or so with tip.  That was with one cocktail though; had I felt like imbibing more, I would have easily been a couple more deep.<br><br>Great find, new fan, definitely will be back!", "pics": null}}, {"review": {"des": "and 5 stars is honestly not even CLOSE to how perfect this place is. Parking was easy to find. We went on a weeknight around 7:00 PM. Our waitress was attentive, charismatic, knowledgeable when it came to the drink AND food menu. She was awesome. LBW is dimly lit with music  playing at a perfect volume . We ordered a chicken taco, steak taco, and a burger. Ok let's just say the steak taco was by far the best steak taco I've had. I couldn't finish my burger but it was also amazing. I have recommended this spot to several people already and I can't wait to go back.", "pics": null}}, {"review": {"des": "I really like the food, drinks and staff. It's always busy which is great because I want them to do well. My biggest complaint is the music is incredibly loud, always! When there are 5 people or 50 (capacity) the music is blaring. When it's that crowded it makes it difficult to even speak to the person next to you and the staff can't always hear me. Again love the business but the music volume is just unnecessarily loud. More people + louder music makes for a bad atmosphere.", "pics": null}}, {"review": {"des": "Love this place.  Everyone in here is so welcoming! The ambiance is so laid back. Good vibes. Everyone belongs!<br><br>Is this a bar or a restaurant because the food is so freaking delish.. yummmm<br><br>Brian makes the best drinks.  I always get sidecars and it's the best sidecar I've ever tasted but all their drinks are so nice.<br><br>Tuna poke or chips and guacamole for appetizer<br>I've had the half fried chicken and steak frites... EVERYTHING is so tasty. <br><br>Don't miss out! <br><br>Oh and I love the hip hop music. Love the mix of music they play. <br><br>Oh and please let me have a bday party here :)", "pics": null}}, {"review": {"des": "Great fresh cocktail place, mixology speakeasy oriented. Good food surprised to see that this place was mainly Mexican food w a mix of Korean and Burgers, not mad about it at all I adore tacos. Our server was super bubbly.  Drink was Mescal based Chupacabra (Spanish myth creature,like bigfoot who)", "pics": null}}, {"review": {"des": "Love it hear. Great beer and bourbon selection, awesome atmosphere, great staff, and one of the best burgers in town.", "pics": null}}, {"review": {"des": "This is going to be a bold statement but I believe Little Bad Wolf has the best burger in Chicago. I've been near and far & still think Kuma's is the best in terms of toppings & madness they put on top. But when it comes to a straight forward burger, this is a total Drake Best I Ever Had.<br><br>Aside from that, I fell in love with Little Bad Wolf last night. We sat at the bar and had the best bartender ever - Troy. So personable and friendly, he was amazing. It was such a nice feeling to see all the staff interacting with each other and they all seemed genuinely happy to be there. To me that signals this must be a great place to work which makes me all the more pleased to patronize them.<br><br>If you don't already know, I'm a total beer chick. I was so impressed with Little Bad Wolf on their brew offerings, it was insane. They must have had 15 beers on tap and I had not tried a single one of them! I can't explain how rare of a feat this is. I was impressed. Plus they had a bottle list of over 100. Pure insanity. I loved each beer I tried, but the awesome bartender was always making sure we liked our drinks which is again, such a rarity. <br><br>Then the food. My +1 convinced me to get their burger and boy am I glad! To circle back to the beginning of this write up, it was THE BEST BURGER I've had in the city. I had the Bad Burger ($13) which came with twp patties and American cheese, house made pickles, and mayo. Even the bun was the bomb. Something magical is in this burger, folks. Their other 2 burger options come with 3 patties if you're feeling hungry. <br><br>The burger comes with fries or salad, or you can upgrade your side and that we did. I got the Elotes as my side and holy goodness, I'm glad I did! It was a huge portion and so delicious! Just enough spice from the chili aioli, tons of super fresh corn, clearly skinned right from the cob, cotija, togarashi and if as if that's not enough, it was topped with a couple of beer battered avocado pieces. Um. Yes to all of this. <br><br>Little Bad Wolf is exemplary in their service, atmosphere and most importantly food & drinks. I haven't had such an all around fabulous time at a restaurant in quite some time. I can't recommend them enough and will absolutely be back with a quickness.", "pics": null}}, {"review": {"des": "Had the burger, tuna, chicken, steak tacos. <br>All good! Excellent really! <br>Service was great too<br>Total bill was about 60 for 6 tacos and a burger. <br>Would definitely return and the device is uber friendly!", "pics": null}}, {"review": {"des": "First time in Chicago for Market Days! Best \"Bad Burger\" I've ever had!<br><br>Ordered the Lumpia to start paired with a delicious mule. Shocked that they had a Philippino staple! Delicious.<br><br>Bad Burger ordered with bacon and a fried egg, flipping amazing.<br><br>The atmoshere was cute, hipster and comfortable.<br><br>Definitely a must if your looking for a place to eat!", "pics": null}}, {"review": {"des": "A somewhat hidden gem that sports a tastier burger than Au Cheval. <br><br>Little Bad Wolf's Bad Burger is the exact opposite. It is the best burger in Chicago for me, barely beating out Au Cheval's. The deciding factor here comes from LBW's Burger's simplicity. The only ingredients of the burger are two parties, cheese, pickles, and mayo nestled between a soft potato bun. The quality shines and creates a burger experience that is greasy, savory, and downright mouth watering. <br><br>We arrived at 5:10 on a Saturday night and waited 30 minutes for a table while getting drinks at the bar. <br><br>The atmosphere is super fun. The place buzzes with energy. Music the night we went included Kanye West, Justin Timberlake, and that Havana song. Quite a mix!<br><br>Excellent burgers, a unique atmosphere, great selection of drafts, what more can you ask for? Go here if you get the chance.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/oJ5CjhH1PfieJcpKwKkK9g/348s.jpg", "caption": "bad burger - news flash, it isn't bad"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/RSmcAV96gifAXhPjS-ktSw/168s.jpg", "caption": "the food taunts us"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/eVqb5pZE8BTGxSgKux2vQg/168s.jpg", "caption": "little burgers with big taste"}]}}, {"review": {"des": "LBW is our go-to in the neighborhood, and I say that knowing it's a 20-minute walk from our place. You would think that any place that offers tacos and cheeseburgers can't possibly do both well, but everything I've ordered here has been decent to amazing.<br><br>The vibe of the restaurant and menu is something more akin to what you'd find in Wicker Park with elevated bar food offerings, tons of craft beer and whiskey and great cocktails, but it's exactly what Andersonville needs. Some of my favorites are the tuna poke appetizer, chicken bao, elotes, and mac 'n cheese. I need to get the cheeseburger again, but it's a classic-style burger close to Au Cheval levels. The salads are also huge and great for sharing. Pescatarians do really well here.<br><br>Of course, LBW had no idea how amazing it would be, so the space is smaller than the demand for seating (especially in non-patio season), leading to long waits at popular meal times most days of the week. Now that they expanded into the former Subway space, it's probably a little better, but they use the new space as more of a lounge, not just packing it with as many tables as possible. We are usually strategic about eating here at off times, or if we bring friends here on a Saturday night, putting our name in an hour before we want to eat. If the weather's nice it's easy to kill time around Clark Street, or you can stand around the bar, it's just a little tight.<br><br>The prices are not a steal, but you will pay the same or more for New American food of lesser quality in trendier areas. Aside from one experience I had with a new hostess working her first Saturday night, the service has always been impeccable. BONUS: They stay open until 2 a.m. most nights, as does the kitchen, when almost all of Andersonville shuts down way earlier.", "pics": null}}, {"review": {"des": "Friendly staff, good service and amazing food and cocktails. We tried various whiskey cocktails and beer. The chips and salsas were awesome. All three of us split the chop salad (which is huge). It filled us all up.<br>Best salad we have ever had!", "pics": null}}, {"review": {"des": "First of all, what a SUPER COOL name!<br><br>I've been here a few times and it has always been really, REALLY good!!!<br><br>Terrific beer, wine and cocktails. The Guacamole is an AWESOME starter. They fry their chips to order and will refill the chips upon request. The salsas that accompany the guac are fresh 'n tasty.<br><br>The burger is amazing. Served with fresh cut skinny fries and a yummy dipping sauce. That burger is super juicy at the medium temp. Fish tacos are super fresh. The grilled romaine salad is creative and tastes great with the cherry tomatoes, roasted corn and blue cheese crumbles. <br><br>And, if you are a die-hard pescatarian you will certainly want to indulge in the Sea Trout. At first, I had thought it were salmon. The color of the fish was an amazing orange color. It was pretty rediculous. <br><br>I'm not sure if the Mac n cheese is vegetarian, but I do know it's super creamy and rich. It's terrific paired along with the roasted Brussels sprouts. <br><br>Take note that it does get really busy and loud at night and on the weekend. LBW has outside seating and a small parking lot behind the building, off of Clark.<br><br>The last time I was there, they were preparing to expand into the space on the corner. I can't wait to see the end result!!!<br><br>Damn... now that I've written this and re-read it, I want some LBW Mac and a Burger!!! <br><br>Go get you some!!!!! You'll thank me for the recommendation.", "pics": null}}, {"review": {"des": "I have been here several times with the hubby and family. They have really good burgers and tacos. In order for me to eat a burger it has to be something special, because I'm not a burger person. I've had the wolf burger which was juicy and delicious. (Too much meat for me, but good) I also had the shrimp taco and the al pastor taco both of these are my favorites. The steak taco was ok, but I was sold with the other two. I also love the guacamole and salsa trio which is extra tasty. Just be aware they will charge for extra chips if you run out. I really enjoy the food and service here and always looking for a reason to return.", "pics": null}}, {"review": {"des": "Quick dinner on our last night in town. We were tired and cranky and Little Bad Wolf turned it around. I had the sliders with macncheese; which were almost full sized burgers with enough macncheese for two. My husband had the steak frites - another large portion. Somehow we managed to eat it all and roll out of there. I would recommend it and definitely come back even if it's for that macncheese alone.", "pics": null}}, {"review": {"des": "Food was great. Service was okay, but it was unbelievably loud. I felt like we were eating dinner in a night club.<br><br>Ordered a good sampling of the menu and really enjoyed everything we ordered. Shrimp tacos were by far the best item we had. Would recommend going, just don't plan on having a conversation due to the noise level.", "pics": null}}, {"review": {"des": "Sigh. You know the feeling when you talk a place up to someone you know, and then when they finally go with you the food doesn't live up to the hype? Yeah, that's where I stand with LBW after tonight. I had two AMAZING burgers there over the last several months. I've sent other friends there based on my rave reviews, and they were also pleased. But tonight, a fellow burger aficionado finally joined me for what was supposed to be my favorite burger in Chicago thus far: LBW's Bad Burger. Sadly, the Bad Burger (as it's called on the menu) lived up to its name instead of the reputation I had been touting. <br><br>Note, the service was great. The cocktail I had was as delicious as always. But the Bad Burger--the reason for the visit--was a total disappointment. Though it's always a tad greasy, it's a good thing we had planned to split the burger since neither of us was starving. The grease was at an 11 tonight...maybe a 12. And when it arrived at our table, the bottom bun was a soggy mess, practically non-existent after disintegrating underneath the grease and mayo. (Also, why was the mayo below the patties? Doesn't it typically go below the top bun so it doesn't dissolve into the bottom bun?) The patties had very little flavor compared to the ones I've had here before. Honestly, the only flavor I could taste was the grease. And even the grease lacked the flavor of what my mom always calls \"good grease.\" There was no sear to the patties, so the overall texture was mush. Ugh. The pickles didn't add or subtract to the overall situation, so I guess that's a plus? The fries were good, although not exactly piping hot. We also ordered the brussels sprouts. They were decent, but they definitely could have spent a couple of extra minutes roasting in the pan. The centers were hard and undercooked, and overall the flavor didn't really have a chance to cook into the dense vegetable. We weren't in a hurry, and it's generally a good thing when the chef isn't either (note, we were there at 8:30 or so, well ahead of closing time). The best thing on the plate was probably the aioli they serve with the french fries. I think we both ended up using it with the burger and the sprouts. I love a good aioli as much the next person, but it should never be the star.<br><br>So now I'm torn. Do I give it another shot because the first two were so good? Is it even worth it in this city full of options?", "pics": null}}, {"review": {"des": "Solid cocktails, burgers more flavorable than the place in the West loop and community tables. What more can you want. <br><br>Had the chips, guac and salsa - all was homemade and solid. More whiskey and bourbon then I would have expected. Burgers came out perfectly medium with tremendous flavor. My only negative is the fries that were on the soggy side. <br><br>Next time we are coming back to try the salads (they are huge and look great) and tacos.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/aLH3dSiC_7anv4kCzPj96g/168s.jpg", "caption": "Burgers in the window"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/RZcrMee2rtwskhTPKFAx2w/168s.jpg", "caption": "Solid cocktails"}]}}, {"review": {"des": "Look I didn't have any mixed drinks or beer here so I can't speak to that. And the ambiance was whatever - seemed like there was sort of a sexy vibe they are going for with the metal decor ok who cares. The point is, all that matters here is the burger. The Bad Burger is one of the best burgers in Chicago. It just is. The Wolf burger is outrageous, and over the top, and memorably reckless in a \"I can't believe we had sex in a church what were we thinking\" way. But the Bad burger is the better burger. It is obscene yet beautiful: an oozing almost pulsating mass of juicy beef and melted cheese that is also composed, proportionate, self-contained, and elegant.", "pics": null}}, {"review": {"des": "This place deserves more notoriety! The mussels and the burger are absolutely to die for. Find yourself snuggled up at the bar, grab a whiskey based cocktail and chatnup the bartenders or the chef (who does come out to check things out), and you'll be in for a great evening.", "pics": null}}, {"review": {"des": "Best burger in the city, hands down. Always an amazing beer selection. Arguably my favorite restaurant in Chicago.", "pics": null}}, {"review": {"des": "I got the Bad burger for $13. It comes with fries and two sauces. I normally don't like fries but I love how theirs was thin and crispy. I finished the whole thing! The burger was so good. It's two patties with two American cheese slices. It was juicy all the way. You'll find yourself constantly having to wipe off your mouth and hands. The cheese was perfect. It didn't harden right away. It was still cheesy to the last bite. It'll definitely fill you up. It's like a good old regular cheeseburger. <br><br>The venue is pretty small. They have the bar, a couple high tops, a few booths, and a communal table. I went on a Thursday night around 9 pm and there were still a good amount of people going in and out. It's dark in there. I actually saw a couple guys using their iPhone flash to read the menu lol. The music is loud so you'd have to talk a bit louder with your company.<br><br>The service was great! The people were so nice and accommodating. They were attentive and came by often but not too much to check up on you. I really loved it! They were dancing a little and just having a good time.<br><br>I recommend this place to everybody! I would try other things on the menu for sure.", "pics": null}}, {"review": {"des": "Awesome seasonal cocktails! The steak and shrimp tacos are really fantastic! Other favorites include the Waldorf salad and the elotes. And the bartender is super personable. This place never disappoints.", "pics": null}}, {"review": {"des": "Love this hidden gem in Andersonville! Great for a first date and many more! Food was fabulous and the music playing in the background was so catchy and up beat it created a great environment! I couldn't stop dancing eating my pork tacos! Which I highly recommend! Also had the chips and guacamole appetizer! Omg by far the best I've had in a hot minute! Drinks are great cocktail menu is relish! Service has never been bad and the wait staff is supper helpful and quick but not to quick they catch your vibe! Defiantly will be going back for more! P.s bathrooms are clean.", "pics": null}}, {"review": {"des": "Oh yes!  I almost don't want to write a review for this place because I don't want to to draw anymore attention to it.  We already have to go at off hours just to have less than an hour long wait.  The benefit is they make excellent cocktails at the bar when that happens.<br><br>I've been here a few times and enjoyed everything I've had.  The half pound basket of fried shrimp is a staple, along with their assorted tacos, which I'm always impressed with.  The burger and fries, and the bao are all excellent as is the beer selection.  Really, everything I've had to eat or drink here has been stellar.", "pics": null}}, {"review": {"des": "I don't know what the food is like. I had been wanting to try them forever so I was starving and in the neighborhood (not far from my home) and stopped by. Used the restroom first. It's a small place. It was packed. Super loud. But not a single person that worked there asked if I was there to eat, etc. And yes..all the tables were full and most of the bar, but it would have been nice to be acknowledged. I mean, I had to wander through the limited tables to get to the restroom and then back to by the bar. <br><br>An example of treating people properly...<br><br>A well known, jam packed all the time, pizza place is always busy but they at least acknowledge people walking through their front door and tell them times. This pizza place isn't a chain. They just care about their potential customers. And there's no way the staff could miss me coming in. It's freezing and windy as hell and they have curtains to block the wind from the door and they were blasted wide open and towards the room as I came in. You'd have to look when someone comes in so they chose to ignore me.<br><br>I doubt I'll be back to give them another chance cause there are plenty of other great restaurants in this city for me to go and enjoy. I guess I'm not cool or trendy enough to rate noticing there. <br><br>(There are other hipster places that don't discriminate and ignore people that don't look like their regular clientele and treat people great. No snootiness.)<br><br>Peace out and have a nice life.", "pics": null}}, {"review": {"des": "This review is for the service, not for their food or drinks as I am a big fan of their salads, baos, and impressive selection of drinks. It's a shame as I've always raved to friends about how great this place is. <br><br>About 2 weekends ago and it happened to be lolla weekend, me and my boyfriend went in midnight starving wanting to have a nice meal with decent drinks. Our waitress came to us and asked us how we are doing, my boyfriend responded and asked her how her night has been and was making small talks. We told her we had some drinks at home before coming here. Then, as we were about to order our drinks and food, she refused to serve us alcohol. At this point, everything was kept lowkey and friendly and by no means we were acting like 2 drunkies who were falling all over the place. We were surprised and told her to give us some time. <br><br>She walked back to other waitresses and the hostess, whispered something, then we noticed all of them started eyeing on us. It was super uncomfortable and unpleasant, so we decided to walk out and leave. <br><br>I wanted to talk about this experience as it affected how I felt about my favorite local spot in the neighborhood. It would be another story if we were acting stupid and drunk and screaming, it was nothing like that; based on our friendly small talk conversation and the fact that we had some drinks before we got here, it became a problem for her and all of a sudden we were being looked upon and judged. Perhaps it had something to do with the weekend being lolla weekend, being a loyal customer whom has been here many many times, this was a super unpleasant experience encountered at LBW. and nobody should ever feel this way when people are just trying to have a nice Saturday night out.", "pics": null}}, {"review": {"des": "A friend turned us onto Little Bad Wolf a while back but we never made the trip until recently.  Both of us craving burgers, we headed to the little restaurant on Bryn Mawr and Clark Street (easily accessible by CTA).  To be honest, it was a little difficult to see though as the tree in the front blocked the signage.  Drove by it once not realizing it.<br><br>Since we hadn't eaten for the last 10 hours both of us were starving and their menu is pretty expansive.  We started with the Lumpia.  If you're used to a traditional Filipino lumpia, don't expect that here.  This is more on part with a Chinese egg roll than what i'm used to.  That being said, it was still tasty. <br><br>My fiancee picked up the bad burger with bacon and I got the Wolf burger, and we got a side of elote(s).  The burger is enormous.  One of the few ways to describe it.  I've read other ratings prior to visiting and I have to disagree with some comments of the burger being \"bland and tasteless.\"  I took the burger apart as I was eating it to try each of the different pieces and I can assure you, it's definitely seasoned.  At first I thought there might be a bit too much pepper, but when you combine the saltiness of the burger with the sweetness from the bacon, it all works VERY well.  <br><br>A direct comparison with Au Cheval - You get more for your money with LBW.  The burger comes with a side (salad or fries) whereas Au Cheval is by itself.  There also isn't a 3 hour wait.  We walked in on a Friday night at 9pm and had no wait at all.  Service was friendly and knowledgeable.  <br><br>Definitely check it out if you get a chance, it's worth the trip.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/8FmQiyKnd6PnrXOPUuMkXA/348s.jpg", "caption": "Are you kidding me with this cross section?!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/5sWXPXZN0405-GkuhmjbIg/168s.jpg", "caption": "Full plate of the wolf burger"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/38Q55bGRHYnYDgB9l8UuIA/168s.jpg", "caption": "This thing is enormous."}]}}, {"review": {"des": "Cool spot. Very pricey but excellent food. I'd love to go again and try everything on the very interesting menu.", "pics": null}}, {"review": {"des": "Wow! Amazing amazing burger! Had the wolf burger! Found this place out through Snapchat and it was voted #3 best burger in the USA! Oh snap! Definitely lived up to that title. <br><br>The bun was deliciously buttery, the patties cooked to perfection. Well done while being super juicy. <br><br>It is definitely your dream burger. <br><br>Parking do suck for the most part though, being a tourist haha.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/T2RH4pVkHGqOB9wRWYDLkg/348s.jpg", "caption": "Wolf burger"}]}}, {"review": {"des": "It was hard to tell from the exterior that \"Little Bad Wolf\" is a restaurant. However, when I first walked in, I fell in love with the space. You could tell that no details were spared when creating this restaurant. To start off our morning brunch, I decided to go with the Little Bad Mule which consisted of \"Tito's Vodka, LBW Kaffir Lime Cordial, and Ginger Bear.\" It was really delicious, make to perfection. For an appetizer, we started with their \"Chips, Guacamole, Salsa\" platter which consisted of warm house cut chips served with guacamole, pico de gallo, and hot and mild salsa. I appreciated all the various dipping sauces and especially the fresh chips. For the main course, I had the Pan Seared White Fish which consisted of bacon onion hash, sauteed spinach, and spicy butter sauce. It was really delicious! I would definitely come back here next time I am back in Chicago.", "pics": null}}, {"review": {"des": "Service was a little slow for my liking. They messed up our order, but offered to remake it at no cost. <br><br>I would recommend getting the shrimp tacos here, they were my favorite item out of the other items we had! <br><br>Fish taco was average, shrimp, steak, and pork bacos were also meh.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/4sAUjZIqLQQayWY3Qi2BMg/348s.jpg", "caption": "Steak, pork, shrimp bacos & fish, shrimp tacos"}]}}, {"review": {"des": "Great great great atmosphere. El Chupacabra was an interesting drink, I'd recommend trying it. Service was top notch. My only gripe was that the burger (while delicious) was too greasy for my liking.  However the Mac and cheese was to die for. Will definitely go back. Would give this a solid 4.5 stars. Check it out.", "pics": null}}, {"review": {"des": "I had a good experience at this restaurant! The food was good and the ambiance was good! I wouldnt say the food was above average though. The steak frites we ordered was very filling and delicious but the steak was pretty average and it was a bit under cooked than what we ordered(med-rare). They give you large portion of fries with the steak but not the best fries, honestly the fries didnt taste so good. <br><br>We also ordered the wolf burger (3 patties) and it was a little too salty for me, still a good burger if you consider the quality and size. Got side of mac n cheeese and it was actually really good! Definitely fit my taste buds:) but my favorite was the mussel appetizer. It tasted a bit like creamy curry with a kick! So good! I would go back for the mussels but not the burgers... <br><br>Overall, very friendly service and cute restaurant!", "pics": null}}, {"review": {"des": "If you're in the Andersonville area and looking for a burger, Little Bad Wolf is the place to go. I now understand why this place is listed in several of Chicago's Best Burger joints lists. I wish I could explain why I enjoyed their burger in greater detail but all I can say is you've got to try it. I know Au Cheval has been all the craze for their burgers in Chicago for awhile but Little Bad Wolf is no slouch. Plus, you don't have to wait in those lines Au Cheval lines! <br><br>I got the \"Bad Burger\" which has 2 patties. This latter will hold you over for awhile but if you have a bigger appetite, they have a 3 patty burger called the \"Wolf Burger\" that has an egg on top and onion straws.", "pics": null}}, {"review": {"des": "Second visit and still totally in L-O-V-E!! The burgers are second to none and the fries exceed all expectations!! So why one missing star you ask?? The fish taco! Why would a place that hits all the stars decide to do a fried fish stick on a taco? I thought it was just me but sat beside another newbie couple tonight who had the same reaction. The first taco which was chicken was exceptional, but that fish stick taco?? It didn't even get a bite!!!NO LOVE!! My suggestion would be to at least let folks know within the menu description that it is breaded, fried fish...not marinated or blackened.", "pics": null}}, {"review": {"des": "Super guicy burger!! Easy for find a parking, huge selection of the beer list!<br>We came here on a sunday noon. No need to wait for a table..", "pics": null}}]}