{"name": "lockdown-bar-and-grill-chicago", "reviews": [{"review": {"des": "If you want a good massive burger this is your spot! <br><br>I really enjoyed the open space to have our burgers on a nice September day. <br><br>Great and fast service :)<br><br>We were pre-warned that they were out of the mac & cheese appetizer which was what we had in mind. Luckily they offer a \"build your own\" mac & cheese. It's a fairly decent sized bowl (portion). We picked 2 cheeses (mozzarella & american) & green onion. I rarely eat mac & cheese so I'm not the best critic in that dept. Personally I expected a little more flavor. It was good but not great. I wasn't expecting the green onions to be mixed rather overtop & I also feel a crumb really adds to a good mac & cheese. & a toasted mac & cheese really sets it off which this lacked. <br><br>The burgers:<br>I had a hard time deciding which option to pick from. I went with \"da bears\" which was also a minor disappointment. It was Good but not Great. What made it not so great to me personally was the topping. The description of the burger sounded great but didn't look or tasted as great. I wished the pineapple would have been a actual round slice vs chopped so small like a pineapple pico style. However the overall burger is massive and I saw why they bring you a knife because you almost need to cut it in half (at least if your a girl with smaller hands). <br><br>You have a choice of your side (salad, tator tots, regular fries or sweet potatoe fries). I almost always pick sweet potatoes fries if it's available. Cooked to perfection in this case. <br><br>I still rated this 5 stars rather than knocking it down 1 due to not overly impressed mac & cheese and the burger choice I made because I like to rate on a overall experience. I want to return and try a different appetizer along with another burger option and why not a different side order.", "pics": null}}, {"review": {"des": "Whaaat is happening here?  Is Lockdown on a slow death ride?  It's been a while since we've been by and we were jonesing for a really good burger so we came by expecting it to be jam packed on a Saturday evening as always. It was nearly empty. <br><br>Then the beer list has been drastically cut.  Then we noticed nearly all the liquor was gone. These should have been our signs. <br><br>Sure, restaurants make changes and sometimes it's good, sometimes it's not.  As in this case.  They ditched the wedge salad, only the best salad in the whole entire city.  What the....then they hacked up the menu, obviously cutting it to the bare essentials, the whiff of a death knell. <br><br>This would all be somewhat excusable (well not the salad part ever) if the burgers were still the best. They're not.  Like at all.  Like borderline gross. They're not the good kind of greasy, in fact they've never been this greasy, all the seasoning is gone, they seemed smaller, and the meat was different. Still at $15+ per burger though.  Wow.  We are so sad. <br><br>Too disappointed to come back. That blows.", "pics": null}}, {"review": {"des": "I was pretty disappointed with my meal when I went on Sunday 8/19. I ordered a Malaka burger. It did not come with lamb slices as it was suppose to. I noticed it when I got the burger and told the bartender right away. He went to check in the kitchen and they said they were out of lamb. If I had known that, I would not have ordered it. <br><br>The bartender was nice enough and offered me to a choose a new burger. I should have taken him up on the offer, but instead I didn't want them to go through the trouble of making a new burger and I was pretty hungry at that point. So I kept it. Big mistake! <br><br>I ordered my burger medium, and I received it very well done. So dry. I'm mad at myself for not noticing until almost half way through, but at that point I thought it was just because it was missing the lamb that it tasted like that. After I noticed, I informed the bartender. He checked and even agreed that it was way over done. Sadly, he didn't offer to do anything about it, which disappointed me. At that point I would have for sure loved the offer of a new burger that was medium. I didn't even finish the rest of the burger because it was just way to dry and kinda tasted charred. <br><br>Luckily, my boyfriend shared his burger with me. His burger on the other hand was cooked perfectly. He ordered the Fat Elvis burger and it was so delicious! I just wish my burger was as good. Very disappointed in this place, especially after it was recommended to me by a few friends that love this place.", "pics": null}}, {"review": {"des": "Lockdown Bar and Grill is the ish. They have awesome outdoor sidewalk seating, great service, awesome beer collection - it's my new favorite go to spot for burgers. Plus it's right in my new 'hood West Town, yesssss! And I'm so in love with their outdoor seating.<br><br>A week ago I had their Burger of the Month which was an amazing deal for an ingredient packed burger and a beer for $15. I was like WHAT! Such an awesome deal and I'm down with that. The July burger was a collaboration with War Pigs & rightly called the War Pigs Burger $15 with angus beef, bacon, carnitas, prosciutto, beer cheese and sweet BBQ sauce. Yea, it was a whole lot of BBQ on a Burger and I loved it. And on a pretzel bun! It comes with a side but you can also upgrade that side to their creamy mac & cheese for an extra $3.50. Totally worth it.<br><br>I need to go for brunch! Their bloody mary looks INSANE. I hate to make this comparison but everyone does it...Lockdown vs Kuma's, they are honestly on par with each other. But no wait & congestion with slightly better burgers surely gives Lockdown the edge.", "pics": null}}, {"review": {"des": "If you're in the mood for a burger, do yourself a favor and visit Lockdown. The service is GREAT! The food is awesome. We ordered The Malaka Burger (beef patty, sliced lamb, feta, tzatziki sauce) and the Death Charge (2 beef patties, bacon, carmelized onions and cheddar). Both burgers were awesome! This place is better every time I come.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/w1JgG7r8Egamn-WeeqKqig/348s.jpg", "caption": "The Malaka"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/i8BYeVyrNG_4EpZd1f09ew/168s.jpg", "caption": "The Malaka"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Qy0ea82IfGODvG2wuK1w7A/168s.jpg", "caption": "Death Charge"}]}}, {"review": {"des": "Hey hey hey went to this place last night and I have to say who evers working in the kitchen OMG wings were <a href=\"/redir?url=http%3A%2F%2FTHEBOMB.COM&s=d2d73c1cf839d2e14982a92137a9dadce1bd7361b9238a86a9ba4786d72ed79a\" target=\"_blank\" rel=\"nofollow\">THEBOMB.COM</a>!!!!! LOVED EM!!! THE service was great....the atmosphere was really nice ....but man those wings!!!! My boyfriend had the Big house burger which looked too pretty to eat  but it didn't stop me from stealing a huge bite from and it was also <a href=\"/redir?url=http%3A%2F%2FTHEBOMB.COM&s=d2d73c1cf839d2e14982a92137a9dadce1bd7361b9238a86a9ba4786d72ed79a\" target=\"_blank\" rel=\"nofollow\">THEBOMB.COM</a> I will definitely be back and will recommend this place to alllll my Peeps keep up the great work LockDown", "pics": null}}, {"review": {"des": "I think this is the best burger in all of Chicago. Each named based in their \"prison theme\", my favorite is the \"border patrol\". There are many to pick from, each amazing in its own right. The staff is always great, hair metal videos on screens everywhere. The bacon mac and cheese is the BOMB, i usually order that instead of fries.  Portions are large, so be ready to eat when you go there.", "pics": null}}, {"review": {"des": "The hunky Eric S. brought me here, knowing I'm a heavy metal fan to the core. He had mentioned this place a few times since we met and he always said it would be right up my alley. He was not mistaken. <br><br>As soon as we walked in, DIO was blasting out of the speakers. The grungy ambiance was awesome and both the bartender and our server were very cool and attentive. We started off with some beers, which were on happy hour. I had a Daisy Cutter and Eric had some weird beer I had never seen before. I'm a pickle fan so we went with fried pickles ($8) and onion rings ($10) to start. Everything was deep fried to per-fec-tion. <br><br>For my entree I went with the Punk Bitch ($14), a huge a** burger with Swiss, Prosciutto, and a Garlic Mustard Aioli. It was to die for! I felt guilty with the first bite. By the way, these guys should get five stars just for their creativity when naming all of their menu items! They're great!<br><br>Awesome vibe, great food, friendly people. I loved it!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/V4LeMQc7TPNHSIe1brq3Fg/348s.jpg", "caption": "The Punk Bitch Burger"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/2y-uL_guMX_Lc8WLXNHIkw/168s.jpg", "caption": "Fried pickles"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/2Bd-VyX2vtDDAikOaTga-Q/168s.jpg", "caption": "Onion rings"}]}}, {"review": {"des": "Again one of my favorite places however this time I was rather disappointed and had to remove a star. <br><br>The barkeep was a cool dude and the atmosphere was sweet as usual however, my burger, ordered medium came out with char and no color. <br><br>At some point places will stop asking the temperature as to not disappoint since the cooks can't figure out temps. Great tasting burger, just overcooked.", "pics": null}}, {"review": {"des": "Food: solid five stars. The build your own burger (citizen arrest) with carnitas, smoked pepper aoilo sauce, pepper jack and white cheddar cheese, with avocado and fried egg. It was soooooo good!!!!!! Highly recommend. And the hand cut fries were delish. Buffalo chicken wings were amazing too.<br><br>Service: friendly staff, but it did take them a while to serve the food tho.<br><br>Environment: super punk style bar, lots of TV and 1990s and early 2000s rock music playing on the background. The heater didn't seem work here tho. It was freezing inside", "pics": null}}, {"review": {"des": "Lockdown, you've won me over! <br><br>I went with the Lockdown Warden, which turned out to be a solid pick. A burger with a cheddar stuffed patty, topped with fried leeks and shallots with truffle oil, with some garlic and bacon mixed in. Say what?! Seriously, this burger is amazing! I would also like to add that their Bloody Mary's are really good. Our server without a doubt hooked it up. <br><br>The music is loud, but I didn't find it too overbearing. We were still able to hold reasonable conversation. The outdoor seating is also an option for anyone who may want to avoid the loud heavy metal in the summer months. And no, this is not a sports bar. Do not come here expecting a game on every flatscreen.<br><br>Food wise, this place is A1. I will definitely be back and highly recommend this a place for anyone in search of a really good burger.", "pics": null}}, {"review": {"des": "I am really sad that I have to write a negative review on lockdown. First off, the service was great it was the kitchen that completely failed us. <br><br>I went with my gf after our date at the field museum. My gf asked the bartender what he recommended, between the animal cruelty and the Malaka burgers. He recommended the Malaka. Sadly though, there must have been some miscommunication with the kitchen and the bartender because they didn't have the lamb for the burger. My girlfriend was so hungry that she just said it was ok, and tried to eat it as is. Sadly after a few bites she noticed that the burger was well done (she ordered medium) so she brought it up to our bartenders attention and he apologized. She ate my burger instead (the fat Elvis, which was good) Being the nice ppl we are, we just wanted to get the lunch over with and wanted to go. I thought since he saw she didn't eat it, he would comp either the burger or a drink or 2. But nope, we got charged for everything even after the couple of complaints and her not eating the burger. Sadly the place was not even busy for them to mess up like that. It was a huge let down.", "pics": null}}, {"review": {"des": "Great, hell amazing burgers!  Very unique combinations. Beer selection also is fantastic. I don't mind heavy metal music, to each their own. My only complaint is the ability to order online or over the phone. Their website online ordering function never works and forget calling to order a pick up order, you will get hung up on constantly.", "pics": null}}, {"review": {"des": "This place is great!, very nice and helpful waiters,  I had built your own citizens burger.<br>A lot of options to put whatever you like in the burger and the beef is delicious, I'm definitely going to come back here, and you should try it too!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Cv39V2KjX0AtYX-cXWdm9A/348s.jpg", "caption": "Build your own citizens burger,  beef, mushroom, caramelize onion and avocado. Yummy!!"}]}}, {"review": {"des": "Incredible, one of a kind burgers. Only dilemma, too many great options to choose from. <br>Great service. Delicious burgers. Fresh fries. Can't go wrong.", "pics": null}}, {"review": {"des": "Make sure sure you get your workout in before going to Lockdown because their fatty, absolutely delicious burgers are gonna knock you out and add a couple inches to your waistline - a tradeoff worth making for some of the best burgers you'll ever have.  Their Warden burger, complete with a cheese bomb cooked into the center of the meat, is truly one of the best burgers I've had the pleasure of consuming.  Expertly seasoned fries and creamy mac n cheese are a couple of their fantastic sides that perfectly compliment their godly main dishes.  Sure the music can be a little loud and the atmosphere could be intimidating if you're sensitive to death metal and tattoos, but if you are, you should really face your fears because this burgers will rock (pun intended) your world.", "pics": null}}, {"review": {"des": "I love this place... I'm not the best at checking in, but I've been here many, many times. Tonight the bartender Ashley is taking care of me. She has an awesome attitude, which compliments her awesome tattoos.<br><br>The food here is \"sick!\" Felt that would be the best term, as this is a metal bar (guitar riffs galore). Nothing scary here, so even if you prefer to jam out to *NSYNC or Chumbawumba, you'll dig this place; even more so their awesome burgers and \"Build Your Own Mac & Cheese.\"<br><br>I've not had one bad experience here, so I have to say checking this place out is a must if you're a Wicker Park/Ukrainian Village transplant, or if you're just in the hankerin for a f'n delicious burger.<br><br>Chomp on my friends... Chomp on.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/bMIpBm5gTPxyTOFfGK4rEA/168s.jpg", "caption": "The Three Wise Men maybe?"}]}}, {"review": {"des": "Hands down The Best Vegan Burger I have ever found!  Finally the texture and girth of a meat burger, it will definitely do the trick.  Plus so many fun topping choices!  Yep, kid in candy store.  Also really liked that it's not all dark & dingy with the too cool for school feel, it has an open, airy feel and friendly staff.  Heard about it from a friend frequenting this gem since it opened and when she said easy parking I was in!", "pics": null}}, {"review": {"des": "THE FOLSOM PRISON BLUES<br><br>Metalheads and burgerbros unite, your time is here.<br><br>Two of my favorite things in the world can be found at this Ukrainian Village restaurant oddity: giant, flavorful burger choices with hardcore names (Plague Bringer, Cruelty to Animals) and some seriously headbanging tunes.<br><br>I've been to Lockdown several times and each visit sees me trying a new item.  Most recently I ordered the 'electric chair' ($14) which was a 10oz Angus beef patty with gorgonzola, buffalo sauce, caramelized onion, and jalapeno relish served on a brioche bun and accompanied by fries.  I destroyed it in record time.<br><br>Those packing a major appetite should opt for the 'lockdown warden', a burger so well-received by fans and critics alike that it garnered a \"29-28-29\" from the Zagat guide, which gets pole position for best in Chicago.  It's a bacon-infused burger stuffed with Merkts cheddar cheese topped with fried leeks, shallots, and truffle oil ($16).<br><br>Music is predominantly hard rock and death metal, although there's some Bon Jovi and Pearl Jam sprinkled in the mix.  Overall I'd say the tunes are f*cking badass and anyone that rocks out to Judas Priest and/or Pantera will find Lockdown smack dab in their wheelhouse.<br><br>Staff are super chill and are basically rockstars themselves.  I've experienced great service on every occasion and the clientele base, well, they're my kinda people: leather-wearing, tattoo-sporting, devil horn-gesturing men and women who appreciate quality metal.<br><br>Bread = 5+<br>Circuses = 5+<br><br>I only reserve the \"5+\" rating for those businesses that truly shine through the din of mediocrity.  Lockdown's killer reputation precedes it and between their totally sick menu and excellently rowdy vibe, I go out of my way to recommend to friends and family.  I'm ALWAYS seeking an excuse/reason to return here.<br><br>*TL;DR*<br><br>Better than Kuma's.<br>Better than Au Cheval.<br>Better than.....(insert thing you like most in the world).<br><br>If you listen to any of the Big Four - Megadeth, Slayer, Anthrax, Metallica - you absolutely MUST stop in for a bite and a beer.  Even if heavy metal isn't your cup of tea yet you enjoy a good burger anyways, please do swing by; I guarantee you'll love it.<br><br>........but if you're a sissy vegan who hates loud noises, then you should probably stay at home with your twelve cats, listen to a Jane Austen audiobook and eat a quinoa salad.<br><br>If getting thrown in the slammer was this much fun, I'd be out committing crimes left & right.  Only the non-violent ones, of course  ;)", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/MXj9K28MhIZ2ZyE7FMPx6Q/168s.jpg", "caption": "The 10oz \"electric chair\" comes with buffalo sauce, caramelized onions, gorgonzola, jalapeño relish!!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/7XzA6BJygWCMXme3BwT1Lg/168s.jpg", "caption": "Their menu has some seriously awesome burger choices. Creatively named AND beyond delicious..... truly unique stuff!!"}]}}, {"review": {"des": "There's two things I love to do. One is translating rap lyrics into white. I do this in my head to pass the time at work. No joke. Quick example:<br><br>Artist: Juicy J ft. Wiz Khalifa <br>Song: \"Smoke a N***a\"<br><br>Actual lyrics: <br><br>I got a bad b***h on a hash pipe. And dat ass right. I dunno lil shawtys name, I just call her last night. Ballin' hard, coppin' foreign cars like they half price. Blownin' loud, Juicy J be higher than the gas price. <br><br>Translation into white: <br><br>I'm accompanied by a precocious woman with heightened physical attributes, who's smoking narcotics. The size of her derrière meets my standards. I do not know said females name because I'm rather promiscuous & was not interested in acquiring such personal information. In effort to discern this particular sexual partner, I refer to her as \"last night\", as that is when we engaged in coitus & debauchery. My rap music affords me the opportunity to frivolously purchase multiple imported luxury sports cars as if they are cheap. They are not. Ample consumption of a strain of high-grade marijuana has me inebriated.<br><br>The second thing I love to do is eat food at Lockdown. At this point you were probably questioning if there'd be an actual review. <br><br>Lockdown is my 3rd favorite burger place behind Kumas and Bad Apple (please miss me with that Au Cheval nonsense). Their apps are legit. For example I always need the Boned Out wings. The buffalo sauce is on key and the chicken is juicy. The only problem with the burgers is the indecisiveness it causes because so many are good. I feel like I always end up getting the Border Patrol, Federales, or Arson burger, because of course I would. I'm Lah-tino. <br><br>Another selling point is the beer list. There's always a nice selection of draft, cans and bottles of craft beer. Cannot complain about the service either. They've been helpful every visit. <br><br>Come to Lockdown. Their burgers may not be in the same class as Kumas, but they're very good and more accessible. Also all the music they play is already translated into white.", "pics": null}}, {"review": {"des": "Heavy metal music and atmosphere with staff full of tattoos and piercing...not my cup of tea. But.....their burger is really good. It is what i imagined a a burger should taste and look like. They are also very creative with their burger menu....Death by shrooms is what I got and I loved it. <br><br>That staff are nice and professional. Good establishment overall. If you love kumas burger, you should visit the lockdown as I think that take burgers one step above.", "pics": null}}, {"review": {"des": "Their \"Warden Burger\" used to be one of my favorites in the city.  Then they closed for renovation for a long time, opened back up, and it just wasn't the same.  It tasted so plain. Not what I want in an $18 burger.  Service was good.", "pics": null}}, {"review": {"des": "Went on half price burger Tuesday.  Went late at 10pm and was seated right away.  The service was pretty quick.  <br>My problem with this place is that they are a burger place, but improperly cooked all 4 of our burgers!  I had the punk bitch burger which was flavored well but was extremely DRY due to being over cooked.  Everyone ordered a medium burger, and they were all well done.  Very disappointing!  The fries were good.  I will give them another chance, and hopefully they won't over cook the burger this time.", "pics": null}}, {"review": {"des": "Great burgers and the best Mac'N'cheese. This place is a small motorcycle bar. Sometimes there is a wait. And sometimes there is over 20 motorcycles parked outside(we don't go then) so we usually find some where else.   It's always an argument rather to get lockdown or kumas.   Although kumas is more of a drive", "pics": null}}, {"review": {"des": "On a visit to Chicago we stayed in the Ukrainian Village right around the corner from Lockdown. Amazing food and drinks! We hung out and chilled and had a couple Lockdown Margaritas one afternoon.'The bartender Omie is the sh*t! Highly recommended!", "pics": null}}, {"review": {"des": "Came in and had a massive burger, inexpensive and amazing. Thatcher gave amazing service, I'll be back for sure.", "pics": null}}, {"review": {"des": "This place was awesome. Came here after dinner at Boeufhaus to get drinks. Bartender was this huge death metal looking guy who could easily pass for a Sons of Anarchy character. To my amazement this guy was one of the nicest and most genuine bartenders I've come across in quite some time. He gave us some great recommendations (their ice cream sundae is fire) and even gave us the lowdown on the current state of heavy metal. Will definitely come back.", "pics": null}}, {"review": {"des": "THIS PLACE IS THE BEST! We had my sister in laws 30th birthday party in the back outdoor patio section just a couple of weeks ago. The food was outstanding and the service was so amazing that I had to give Day a personal shout-out. The weather turned out to be less than ideal, to say the least. In the pouring rain, Day along with the rest of the staff helped get us moved to the inside of the BBQ part of Lockdown. Day went above and beyond to ensure the sweets we brought got packaged up and also ensured the food and alcohol we paid for was moved inside for us to continue to enjoy. She was such a great sport about everything. <br><br>We will be back!", "pics": null}}, {"review": {"des": "Outstanding burgers, as always. Great atmosphere. Staff is awesome. Thatcher and Day display a level of professionalism that is on par with a 4 star establishment. Alex the Chef visits periodically to check if his cooking is good, wellllll the cooking was great. Highly recommend.", "pics": null}}, {"review": {"des": "Food was ok but the staff was very rude. <br><br>Our server kept making inappropriate comments about what I was ordering. This was very unprofessional and it made everyone feel unwelcome.<br><br>I will not be returning.", "pics": null}}, {"review": {"des": "Best burgers I've ever tasted. Fresh ingredients; recommend pretzel buns. It's light breading; just right for the burger, bacon, and barbecue sauce. Definitely worth while to come back again in vacation.", "pics": null}}, {"review": {"des": "A BACON infused patty, the center is filled with a massive quantity of MERKTS Cheddar Cheese, on a buttered and toasted bun or pretzel roll!! THE LOCKDOWN WARDEN BURGER knocked me right off of my chair!! If you are a cheeseburger fan, this place needs to be on your LIST! Lockdown Bar & Grill!! Had one of the best days of my life hanging with PJ the owner and that was BEFORE I had this BURGER!! Get here now!! They are located on Western Avenue in Chicago. If you dig Metal, Insane food and an amazing bar then this is your OASIS!! Subscribe to my You Tube channel A Biker Dude, to see the Lockdown video!", "pics": null}}, {"review": {"des": "Love the burgers and mac n cheese. Look forward to my next visit. They play a lot of heavy metal music; I'm not a fan of the genre but I still love the atmosphere of the place. I think the burgers they have to offer are very unique like the fat Elvis and the Warden. The Warden burger patty is stuffed with cheese, leek, onions and who knows what else deliciousness. The leek combo is a great mix for a burger -- never seen that incorporated.", "pics": null}}, {"review": {"des": "IMO the best burgers in the city. I'd strongly recommend the federales. The service is always great and the food is great. The music can be a little too loud but that's part of the whole experience.", "pics": null}}, {"review": {"des": "If you know me, you know I love a good burger. Thankfully, I grew out of that stage in my life where I thought all the good burgers came from major restaurant chains like McDonald's, Burger King, Wendy's and so on (I know, how naive of me...), and now, I'm at that stage in my life where I still have the same love for burgers, but I want to see the world of burgers and all the different types of deliciousness these non-chain restaurants have to offer. One of my stops to find a fine burger had to be one of Chicago's well-known spots for a greasy meat patty, and that's Lockdown Bar & Grill.<br><br>When people think Lockdown, they immediately compare it to Kuma's. Well, I did the very same. I mean, they are quite similar. Big gourmet burgers, wide array of sides, big beers, and of course, the heavy metal music blaring inside the building. It's a lot like Kuma's, however the style and taste of the food you're eating here is the one distinct thing that separates itself from  its burger colleague.<br><br>It was my first time, so I had to try the Lockdown Warden burger. The fried leeks immediately caught my eye and since I heard it had such a high Zagat rating, I figure why not. Although I was disappointed I could not get my burger done medium rare, the end result of my meal was still nothing but positive. What really got me going was the addition of Merkt's cheddar cheese just oozing out of the burger with each bite. So rich in flavor, and the fried leeks was an interesting choice that gave the sandwich an extra crunch to add to the experience.<br><br>Everything else about the restaurant was very nice. The server Thatcher was super cool about everything and very helpful as well as professional with his service. Kudos! Also, the outdoor seating is perfect for some summertime dinning. Check out the lovely beer garden in the back when you get the chance. There's a fire pit!<br><br>Burger fanatics, this is a must if you haven't tried it already. Definitely a restaurant to have in mind when you want a big ol fat meal.", "pics": null}}, {"review": {"des": "Ok why is it that on multiple occasions when trying to call and place an order for take out is it that I'm first on hold for close to 10 minutes-decide to then hang up in case they've forgotten-then call back and immediately get hung up on several times?? I love Lockdown but are your phones broken? If so, make it a little easier to for us to order online.", "pics": null}}, {"review": {"des": "Oh, how the mighty have fallen. A year ago, before the ownership changed, I would have argued fervently that Lockdown had one of the best burgers in the city, and best mac and cheese no doubt (yes, better than Kuma's). I'm sad to say this is definitely no longer the truth. <br><br>I used to be a regular at Lockdown. For about a year, my boyfriend and I stopped in almost every Tuesday for the 1/2 off burger deal. It's safe to say I've tried every burger on the menu. Then things slowly began to change...our favorite servers were gone, the quality of the burger dropped substantially, and the mac and cheese was definitely not the same creamy, flavorful dish we'd come to love. After a few serious disappointments, we stopped going all together.<br><br>Today, about a year after the initial letdown, we stopped back in...everyone deserves a second chance, right? We ordered our favorite burger and prayed for a time warp back to the good old days....sad to say, we won't be going back to Lockdown. They got rid of half the burger menu, added the option to choose your weight of patty (just...why?), and the mac and cheese was more velveeta than secret recipe. <br><br>To add insult to injury, we both ordered burgers medium rare than came out a dull gray color, totally flavorless. If I hadn't known how good Lockdown has been in the past, this may have been an acceptable experience. But from here on out I'm sticking to Kuma's.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/lIMZw1RuJ8uGaYEMg5Gayg/348s.jpg", "caption": "Public Disturbance w/ BBQ sauce, Gorgonzola, and onion rings on a pretzel bun w a side of mac"}]}}, {"review": {"des": "This place is terrific. My girlfriend and I went on a Saturday night and split two burgers -- the Fat Elvis and the Lockdown -- because we couldn't decide on just one. I would highly recommend this just because Lockdown has a lot of great burger options. Lockdown has, for my money, the best peanut butter burger in the city. Their Fat Elvis is not to be missed. Solid beer selection as well. Music is a bit loud but that's a minor quibble. Definitely looking forward to returning!", "pics": null}}, {"review": {"des": "Only been here twice, but good times. Great music and videos on TV, love the dark atmosphere, decent food. Friendly staff. Service was a bit slower both times and I've spent more money here than at Kuma's.. but I will return. I also don't eat red meat anymore, but did enjoy the chicken & turkey options.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/z3c4QYd1khgnZGuyGBJ9mQ/348s.jpg", "caption": "\"Notcho bitch\" loool and he got the turkey burger w/ mac&cheese. Also some fruity vodka drink! Yum"}]}}, {"review": {"des": "I've come to this place maybe 15-20 times overall....  but I haven't been recently. <br><br>I think the quality has tanked. Pickles used to come with assorted dips. Only came with one this time. Flight risk was made of terrible thin patties.  Mac n cheese was still delish. <br><br>Bathroom was always shitty but now doesn't have a wall around the toilet. <br><br>Beer selection was great. <br><br>No longer my favorite burger bar in the city.", "pics": null}}, {"review": {"des": "Holy crap. The burgers. I mean...the BURGERS.<br><br>They're big. They're wonderfully named. They're delicious. You could argue that these burgers are metal. Which would be appropriate! Given the giant Lemmy portrait, and all the metal music playing constantly. It's loud, but it's not a bother.<br><br>Service was pretty spot on, a little slow on our 2nd visit, but always quite friendly. Apparently as Chicago prices go this is average, but as a traveler from Denver I was really surprised at how expensive drinks got.<br><br>Even still, if I were to live in Chicago, once booze inflation wasn't so staggering, I'd have no trouble making The Lockdown a home bar. It's a good looking joint with great staff, fun jams, and burgers that'll knock your socks off as it adds a digit the next time you step on the scale.", "pics": null}}, {"review": {"des": "This is my second visit to this joint. My first time was excellent from food to service but this time around It wasn't as great. <br>The server didn't ask how I wanted the burger cooked so it came out well done. We were not given any wipes, was also charged for an order of fries and our bill was given to another table and it took 20 mins for us to get it back. <br>The burgers were still good despite being over cooked but for the time being I will just head to another burger place closer to my hood.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/99ZlC12xarsh6yflHqoh3Q/348s.jpg", "caption": "Lockdown Burger with sweet potato fries"}]}}, {"review": {"des": "So glad I know someone who has been here before. The heavy metal and overall decor could have been a deterrent. <br>Amazing beer selection. Amazing food. Amazing staff. <br>Regardless of your beer preference, you'll find something you like. We had already eaten before we arrived but had an order of Loosies (freshly-made potato chips with dip) that were great and after spending a bit of time there, mac and cheese and a burger made its way to the table. Both were fantastic. <br>If you're looking for a craft beer or a good burger, this is a great spot. Definitely recommend.", "pics": null}}, {"review": {"des": "Now THIS is a beefy burger!<br><br>Inevitably, there will be a comparison to Kuma's simply because they play heavy metal, and it has that biker vibe to it. I'll give you that. On the other hand, whoever's putting these burgers together in the kitchen has got the right touch. Kuma's is heavy handed with the salt, but Lockdown has got it under control with the right mix and dose of ingredients.<br><br>I had the Lockdown Warden, which according to my waitress is one of the most popular burgers on the menu. You had me at truffle oil, but throw in some shallots and fried leeks? Yes please. I thought the leeks were green onions, but they're not.<br><br>The wife ordered the Bootleg, which had bacon, kimchi, and a fried egg. Lockdown apparently makes their own kimchi? Good for them! Surprisingly not spicy, but still a mighty tasty burger.<br><br>So burgers are served on a pretzel bun, and you either like that or you don't. It's not everyday you eat a whopping patty of meat specially ground on a soft pretzel bun. All burgers come with fries or a side salad. Opted for the fries, and they were legit.<br><br>I'm not a fan of the music, but I'll be back to try out the other burgers. 1/2 price burgers on Tuesdays FTW!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/9hDcMQnmVppRmiQ0Dk0TZw/348s.jpg", "caption": "The Lockdown Warden - this is it!"}]}}, {"review": {"des": "What happened to this place? Food used to be super good, now the quality of burger is subpar.<br><br>I have been going here for a while and my last visit in October left me very disappointed. I love a good burger and Lockdown used to be my go to place. Past two time my experience had been a let down.  <br><br>I don't know if there place is under new owner or a new chef ? If so, my advise would be to go back to the quality it used to be, don't skimp or short cut, burger/food is not the same, quality has gone down drastically.", "pics": null}}, {"review": {"des": "My friend and I came here late and night when everything else was closed. We were literally looking for a joint that was open late where we can get a quality burger. It was around 1am on a Thursday night so Lockdown's hours are very convenient to say the least!<br>The place is prison / death / hardcore themed which is interesting. The atmosphere is relaxed though, it's nothing too boring or too wild- it's a pretty interesting and comfortable setting. The staff is wonderful!! One of them helped me find a place to charge my phone and the lady at the bar gave me good recommendations. I lost a key that night so I spoke to them the next day and they were so nice about the whole situation  (even though I didn't lose it there). <br>The burger options are wild, they have burgers like \"The Fat Elvis\" or \"The Death Sentence\". My friend got a Thanksgiving themed burger, complete with cranberries, gravy and mashed potatoes! I kept it simple with the classic \"Big House\". You can also create your own, it's called \"Citizen's arrest\" and they do a step by step with options for that on the menu!<br>The burgers are really good. They are not the best I've had, but definitely quality, interesting and large! I think they are a bit pricey, but overall worth it. I also liked their Mac and cheese.<br>Overall, a really cool place to check out, especially if you need a late night bite!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Li9rfpzUKeB01ByZFARFuw/348s.jpg", "caption": "We took it to go! Delicious"}]}}, {"review": {"des": "The service and food were great, however my partner, friends, and I, were deeply disturbed by the consistent imagery of confederate flags in their music videos played on the screen. For that reason I, nor we, will be returning.", "pics": null}}, {"review": {"des": "Excellent little bar and grill with a fantastic menu including smoked meats, mac n cheese, burgers, and tasty vegetarian dishes. If you appreciate vintage metal videos and a super friendly staff, this is the place. The prison theme is also fun. I had the Indecent Exposure, which was satisfying. The rest of the crew had wings, burgers, and sweet potato fries. They offer pretzel or brioche buns, which is a tough decision to make. Don't worry. The servers will help you choose. And the bathroom is clean. If you're heading to the Empty Bottle for a show, you have to enjoy a meal at the Lockdown first. Yummy!", "pics": null}}, {"review": {"des": "Had the chance to finally try this place. I ordered the federales burger and it was everything I was hoping for. Meaty juicy cooked medium a little spicy. That dipping sauce is amazing. I would definitely come back for more. My boyfriend and his friends couldn't stop raving over their fries. You get 5 stars lock down.", "pics": null}}, {"review": {"des": "The best burgers in Chicago.  They recently made some changes to the Fat Elvis like it's not melted peanut butter any more and the bananas were not flambeed in the grand Marnier sauce. Not very happy with that but so glad that they brought back the Flight risk!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/STlRGZGwNlYQ6sUZ-Ec9MA/168s.jpg", "caption": "New menu"}]}}, {"review": {"des": "Even as a vegetarian I was already a fan for the insane coffee drinks (where else gives you two full-size donuts as a garnish??) and the unpretentious atmosphere ... but then they started serving the Impossible vegan burger and leveled up my entire life. <br><br>I also saw they added a nice big back patio area this year, although I haven't sat out there yet.", "pics": null}}, {"review": {"des": "I had somewhat high expectations for this place due largely to my friends hyping up the burgers. We had a group of 5 people and we were seated in the back of the restaurant. The lighting here is pretty dim so it was hard to read the menu. The rock theme wasn't my cup of tea. I found some of the music videos that were playing on the flat screens around the restaurant a little annoying and disturbing especially when one video showed the performer drinking blood (fake or real, it was still gross). <br>We ordered buffalo wings and fried pickles to start. The buffalo wings were actually very good and the fried pickles were, well, fried pickles. Nothing too special there. <br>With the atmosphere aside, I ordered a burger with spicy aioli, jalopeno relish, and pepperjack cheese. You have an option of getting fries, salad, or mac and cheese for your side. I picked a salad with vinaigrette and honestly, the salad was the probably the best part of my meal. The patty itself was pretty dry and the \"spice\" on my burger was pretty disappointing. My boyfriend ordered the Arson burger and it was a let down. The burger itself had a splash of their spiciest sauce and sliced up habanero peppers. It wasn't the crazy hell burger that we were hoping for. All in all, it was not worth the money and I don't plan on coming back.", "pics": null}}, {"review": {"des": "Been there twice in the last month after not being there for a year or two - It sucks now. Used to be great - the food is typical and can be found at any place that serves burgers. Also, the music is too f@#king loud - for F#@cks sake - it's a restaurant most people are trying to have a conversation, which you can't do without yelling. I get you're playing concerts, doesn't mean the volume should be concert hall level loud.<br><br>I used to really love this place which is why I tried again after my disappointing experience - I thought it had to just be a bad day. Nope - you can find the same burger at another shop for less money and not strain your voice trying to talk.", "pics": null}}, {"review": {"des": "Came here before a show @ Empty Bottle and my second experience couldn't have been any better!<br><br>They had the rare Bourbon County by Goose on draft...that was a treat. <br><br>Complimentary chips were great! I'd double up on them next time.<br><br>Fried pickles were perfectly crisp on the outside, not too much batter. Nachos were solid as well.<br><br>Burger was great - I'm happy they have different patty options. I got the smallest (6oz) and was still beyond full. The fresh cut fries are the perfect pair.<br><br>Lockdown, you've won me over.", "pics": null}}, {"review": {"des": "What a cool place.  We got a kick out of the menu. The burgers are AMAZING! BEST fries and you MUST try the Mac n Cheese!! Compliments to the chef & fantastic server, Jess !!!", "pics": null}}, {"review": {"des": "On three different occasions I have called several times and been hung up on immediately or put on hold and then hung up on. I live close, so on the third occasion I decided to go in to order takeout and wait (because their online ordering system has also never been functioning in my experience) - I asked if something was wrong with the phones and was told \"no we're just busy.\" There were very few dine in customers and even if they were slammed, put me on hold for as long as you need ..don't just hang up on me? I live close and love the food but you've lost my business.", "pics": null}}, {"review": {"des": "I'm curious to know the back story of why all of these fantastic burgers are named after jail - related incidents...my theory is that someone went to jail without ever having a last supper beforehand and once they were in jail they developed an obsession for burgers (what their last supper would have been) and then named each of his concoctions after the terrible things he saw in jail.  The likelihood that my theory is right is about .005% but the likelihood that the burgers are, in fact, delicious is around 99.9%.  <br><br>I'd heard from a couple of people that these burgers were comparable to those at Kuma's Corner so I set on my quest to research this claim.  Here are my results: the burger is very juicy and jam-packed with ingredients...and the buns were quite dense and delicious.  Although it tool forever and a day (about 45 minutes to be exact) to get our burgers they were cooked to perfection.  While ordering the burgers I'd debated on the Lockdown Warden and the Cruelty to Animals - I chose the latter.  This burger had so much meat on it that it became difficult to decipher which was which, but it was still quite tastey....just not as tastey as Kuma's (in my humble opinion).<br><br>However, the mac n' cheese that we ordered with the burger was phenomenal.  Sure, it was an additional $3 to get the mac n' cheese instead of fries with the burger but that extra cost was well worth it.  Oh, anf if you're looking for some good beer - they have lots of it and they have the strong Not Your Father's root beer (the stronggg  one) on tap.  It's a popular choice it seems so they should have it in stock if you wish to partake in its magnificence.<br><br>Now, here's a tip: if, on the weekend,  you're going with a group where some members are under the age of 21 then you have to arrive before 10 pm because that's when they stop letting underage people in.   When we went we were with our friend who is only 20, but thankfully we got there around 8 pm so we were able to eat.  The bouncer (who looked like he came straight outta a Tim Burton movie) almost didn't let us in because he didn't realize it was only 8 pm.  <br><br>Like Kuma's it's kind of small on the inside of the restaurant but they have some seating outside for when it's nice weather still.  Also, like Kuma's (hmmm, seems like there's some copy-cattin' going on) this is a metal-oriented  bar so you'll hear thay type of music throughout your thug-dinigng experience.  All in all, it's great fun and you will enjoy it!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Z-gOvfS5r43J1NwaN27mTw/168s.jpg", "caption": "The lockdown warden burger"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/1J4na1xy2mWXLsZ7-MaEaA/168s.jpg", "caption": "Cruelty to animals burger"}]}}, {"review": {"des": "I love this place, it has the best burgers ever!. Outdoor and indoor seating good vibes!", "pics": null}}, {"review": {"des": "Best burgers in Chicago and ive been to alot of spots through out Chi and this ones still the king..daily deals, tasty fries, great beer love this place! I recommend this spot to anyone looking to try a great burger...its a little loud in there because of the heavy metal theme but its worth it!!", "pics": null}}, {"review": {"des": "I tend to go here about once a year since this is my cousin's go-to place for her birthday dinner. One thing to note is that if you don't enjoy heavy metal music, then you would most likely find this place too loud. We literally had had to yell to talk to the person across the table, and the music can be overwhelming sometimes for some people.<br><br>Food wise though, I thought their burgers are solid. They have a variety of burgers to choose from and I always have such a hard time deciding what I want or remembering what I had before. So I decided the last time I went to just order the flight risk, which gives you their choice of 3 mini burgers. So much easier for someone indecisive like me. I dont recall which burgers i got for my flight risk, but i thoght they were just okay and didnt have as much flavor as what i expected. From my previous visits, Lockdown Warden and Possessions of Shrooms wee always good. I would also have to say that my fave from this place, more than their burgers, is their mac and cheesy. It's creamy and delicious. <br><br>The servers and staff are pretty nice. Although, we had an encounter the last time we went where my cousin ordered red wine, but the server kept giving her white wine. This did not only happen once, but twice that evening. Another friend who came in later also had to wait for his beer a little while. Must have been a busy night for them.<br><br>Overall, their burgers are good but not exceptional for me to rave about. But would I come back here again? Sure.", "pics": null}}, {"review": {"des": "When it comes to burgers, im not that big of a fan of them but i get my urges from time to time which i cannot resist. This place without a doubt rocks hard. The atmosphere on the inside in nothing short of rock/metal/cozy all at the same time. They even have a bar with a very decent amount of beer on draft which im always a huge fan of. On summer days they even have an our door section where you can eat and drink, i enjoy sitting outside when im with company and i want to talk without being disrupted by their music indoors they play.<br><br>If your wondering about the customer service its very friendly, helpful and polite... seems like ive been saying that a lot though, but it really is. They offer great suggestions which burger taste like what and what they are paired well with.<br><br>Lets move on to Lockdown's burgers. Ive had 3 and i was impressed by every single one of them.<br>-The Fat Elvis : oh my god this burger had me lost for words. 8oz patty grilled to your taste. Layered with peanut butter, yes you read right! Peanut butter, crispy thick smoked delicious bacon and as if that wasn't enough, its topped with caramelized bananas in Grand Marnier. The flavors this burger has is just indescribable! A must try! Pair that off with their mac and cheese which is made from scratch with bacon bits and green onions and your in heaven.<br><br>-Next i went with one thats called Cruelty to Animals : this one is ridiculous! The name of the burger speaks for itself. You got your grilled 8oz patty, topped with pepper jack cheese, slow roasted pulled pork and layered with thick cut smoked crispy bacon. This burger packs an insane amount of savory flavors that just keeps you biting back for more. This burger i paired again with their home made mac and cheese.<br><br>- Last but not least i went with their signature burger called The Lockdown Warden: their legendary patty is infused with bacon, leeks, garlic and shallots and if that wasn't enough these guys stuff it with Merkts Cheddar cheese. Once the infusing and stuffings stops they top it off with fried leeks, shallots and truffle oil. Every bite is a sensation that has you asking yourself how all these flavors work soooo incredibly with one another. This burger is nothing short of a masterpiece! Once again i couldn't help myself but to pair it with their astonishing mac and cheese.<br><br>Every one of their burgers ive had, i give a 10 out of 10 everyday! This is the place to go when your with a friend or group and want catch up over a hardcore burger and a drafted beer or hand made drink. <br><br>The one small negative thing i will say is that up until about 3 weeks ago when you would go there on Tuesdays their amazing burgers were half off the original price. And they just recently took that offer off the menu and you have to pay full price for each burger everyday of the week. Which for me is fine, but it was a great deal and should be brought back.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/DFihcRXDRiurIl7-U5QjnQ/168s.jpg", "caption": "Flavors you didnt think your mouth was capable of tasting, this one is THE FAT ELVIS!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/8OJgAZkjqisDhu5U6vEh6A/168s.jpg", "caption": "The beastly CRUELTY TO ANIMALS burger! Savory stacked up top savory."}]}}, {"review": {"des": "Small bar right off of Western Ave. I've been there a few times and they've always had a table/few seats at the bar available to sit right down, which made it a great place to watch the World Series games without being trampled by others. <br><br>Pretty decent beer selection and their menu places most of its focus on burgers. The burgers are HUGE and really good, but they come at a price. Most of the burgers are $15+ and if you're looking to substitute sweet potato fries, you're adding in an additional $3.50. I ordered the Electric Chair last time, which has gorgonzola cheese & hot sauce. This was very flavorful & I ended up saving half to take it home for a second meal. <br><br>It's a place I come to on a casual evening when I want to have a seat at a bar and while the burgers are expensive, they will likely last you more than one meal.", "pics": null}}, {"review": {"des": "I can't even believe I've never written a review of Lockdown! Oh the BURGERS! Oh the fried deliciousness everywhere. When I want to eat until the buttons pop off my pants, I'll be sure to scarf down a mouth watering burger here! <br><br>If you're looking to be adventurous, you should try the Fat Elvis! I mean, seriously...can you think of a more amazing combination of toppings? Peanut Butter, Bananas, Bacon... I'll admit, you'll feel like you're about to pass out after consuming this monster, but it feels so good!<br><br>In addition to their burgers, they've also got some great fried pickles and chicken wings. Their chicken sandwich is pretty bomb too. They've also got a solid beer list.<br><br>I've always had great service here and it's nice to sit out on the patio on a hot summer day. They're always blasting rock and metal, so if you don't like it...go somewhere else!<br><br>It's a must try for the burger enthusiast!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/5Ji-5Np1cCguTavTIc1xPQ/348s.jpg", "caption": "The Fat Elvis. Pure Bliss. That Macaroni and Cheese is ALSO the bomb!"}]}}, {"review": {"des": "Get the \"Fat Elvis\" burger, and you won't be disappointed!<br><br>Lockdown's burgers are incredible.  Quality meat and, in the case of the Fat Elvis, topped with bacon, caramelized bananas, and peanut butter.  Lockdown incorporates quality with creativity. <br><br>Get a side of macaroni & cheese instead of the fries.  It's an additional $2-3 charge, but it was creamy, flavorful, and definitely worth the upcharge.<br><br>Many of the menu items' names are heavy metal music-themed.  Inside the restaurant, music was playing, and a video on a TV screen too.  The music was loud, but I didn't find it deafening and was still able to hold a conversation.<br><br>Four of us came here on a Tuesday afternoon, and I was surprised by how busy it was.  Although we were seated at the last open table, the place did clear out a little while we were seated.  It appears to be favored by local police officers.  Of course, burgers are half price on Tuesdays too, which is probably why it was so busy.  This is such a great deal, as it's the same item, and almost all of the burgers are included in the deal.<br><br>There's lots of beer here too.  I forgot the brewery name, but the \"Champagne Velvet\" was the perfect, simple American ale to go with a burger.  There was another one on the menu with lavender and peppercorn, which I completely overlooked until my husband pointed it out to me.  There are many familiar breweries as well as some unique options.<br><br>Our server was good.  At first we accidentally walked in the take-out side, and the girl behind the counter seemed like she'd been sleeping.  She could use a little polishing, but otherwise the service was fine.<br><br>Lockdown is definitely one of my favorites along with Kuma's, Brgrbelly, and Flubadub.  It's hard to pick a favorite, but Lockdown is the most conveniently located to the south and west suburbs!", "pics": null}}, {"review": {"des": "EXCELLENT BURGER! I was there yesterday on their special with one of my good friends and we were so thrilled. Had 2 different kinds, Possession Of Shrooms and Public Disturbance. After our first bite, there was no conversation for the first couple minutes, lol...We really enjoyed those juicy burgers.<br><br>I love medium when it comes to burger and they did an amazing job. The burgers came out perfectly. The meat was so juicy and tender. I tasted some spices and a yummy sauce in it, so delicious. <br><br>The Goat Cheese on the Possession Of Shrooms was OMG! it was so good with the meat and the sauteed mushrooms. I ordered one of my favorites wheat beers, Wittekerke to go with the burger and UUUMMMM ( with my eyes closed) That's all I can say.<br><br>The Best part of the day was HALF OFF on Tuesday. The service was great. The food also came out quick. They have a very nice patio if you don't like the A/C. Free parking is available on Western Ave. or near by. <br><br>Lockdown Bar & Grill is my #1 burger place so far. I'm not letting you down so please check it out :)", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/bDz1uEsiQMl9HVf8ZnOkvw/348s.jpg", "caption": "My good friend and I were so happy when the food came out. Love the burger at Lockdown Bar & Grill. My #1 so far."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/7M88ei668bwHxGwee570MA/168s.jpg", "caption": "Public Disturbance. Yummy!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Zy6dBQMnW0oVW-70p6AbsA/168s.jpg", "caption": "A perfect combo with that juicy Burger. One of my favorite wheat beers,Wittekerke."}]}}, {"review": {"des": "The food was amazing, great patio space and Quinn provided us with amazing service and suggestions. <br>Me and my father stopped by and shared the mac and cheese with pepper jack cheese, mushroom and chicken. After we got the H. B. I. C. Salad and the sweet potato fries to nibble on. I sipped on The Panama cocktail which was similar to a mule that's very berry delightful, hahahaha. To top off our splendid evening we got the Lockdown Warden with regular fries. Which was superb. Definitely need to come here and try the food.", "pics": null}}, {"review": {"des": "I had some time to kill before a flight and was craving a juicy burger. After pulling up some yelp reviews, I decided to fully indulge in the Public Disturbance. This beast was delicious! I'm a die hard BBQ sauce woman and theirs does not disappoint! Added bonus: can easily substitute for sweet potato fries . My eyes were bigger than my stomach and I had to take this bad boy on the plane - everyone from security to the guy sitting next to me hated/envied me. Service was great as well!", "pics": null}}, {"review": {"des": "Has Lockdown out-Kuma'd Kuma's?  It may be true.<br><br>As you walk in, you are assaulted by a sonic storm cloud, shoving thunder down your ears and out your butt.  Lockdown is LOUD.<br><br>But it's a good loud.  Metal, of the heavy variety.  This is a place to get drunk and get stuffed and headbang a little.<br><br>I ordered the Cruelty to Animals burger ($15) - Bacon, White Cheddar, Braised Pork, Prosciutto.  It was awesome.  The mighty pretzel bun could not contain the meat avalanche, and pig parts came sliding out the sides.  I loved every bite.<br><br>The fries were tasty, but could have used some seasoning.<br><br>I also enjoyed a Good Juju beer from Left Hand Brewing Company.  It tasted like a boozy ginger ale.  Awesome.<br><br>There are some drawbacks.  While I sat at the bar, I did get hit with somebody's powerful B.O.  A good way to counteract that is to shove more burger in your face.  It's like a gas mask made of meat.<br><br>Lockdown is open late and their kitchen doesn't close until 30 minutes before the whole bar shuts down.  That's a win.<br><br>I will be back to chew through more of the animal kingdom and to further damage my eardrums.<br><br>Bonus: While I was there I chatted up a roadie for Weezer.  They chose Lockdown to grab food and booze after the 2015 Taste of Chicago concert.", "pics": null}}, {"review": {"des": "This place is excellent at what they do. This is what places like Kuma wish they were. The food is outstanding in all aspects. The appetizers that involve fries are making my mouth water right now. The burgers are unique and prepared in a way that has to be tried to understand. The beer selection is awesome. The drinks are creative. The topper is the phonimal service you get. There was a real tall bartender/server that was so above and beyond the norm. Hr made our entire table feel welcome. He offered up drink ideas and produced some awesome stuff. Went far out of his way. Great place and I'll be back there asap. Get over there !", "pics": null}}, {"review": {"des": "Not sure what happened but the food is not what it use to be, within the last year or so the food has really lost its quality, I was a weekly regular but sadly just gave up on the spot. The last couple of times there I went in hoping that my last visit was just a bad experience but I just kept hoping too much and finally admitted to myself that the food is not the same anymore..", "pics": null}}, {"review": {"des": "Went around New Years and the quality of my meal was horrible.  My food was cold, took a long time and it was cold in there as well.  Not sure if I'd go back here again.  I was definitely unimpressed.", "pics": null}}, {"review": {"des": "Holy fuck, the \"No Punk Bitch\" Burger is amazing. A pretzel bun filled with a rare medium patty,  Swiss cheese,  and prosciutto all worked together to give you this enlightening moment of a creatively yet simple well made burger. (Who knew prosciutto and beef could compliment one another so well?) This is a great starter burger for anyone who would like to try adding more layers of meat before ordering the \"Cruelty to Animals\" and experiencing a heart attack. Do me a favor and upgrade your fries to sweet potatoes fries and dip them in the aoili sauce - you won't regret it. If you are in the mood for being a total fat ass then add on a side order of Mac and cheese.  All three were worth the thousands of calories consumed today.", "pics": null}}, {"review": {"des": "The Big House burger is one of the best burgers ive had in the city. Can't wait to return with my friends.", "pics": null}}, {"review": {"des": "If you enjoy metal music and a really good burger, you need to give Lockdown a try. They always have really inventive and interesting drink and burger specials. I will say that if you are looking for a quiet place to talk, come during the summer when the patio is open or order it to go.", "pics": null}}, {"review": {"des": "Hearing all the hype about there Amazing food we had to check it out, the day we went the a/c happened to be broke which sucked because the place was like 80+ degrees so not such a good start, finally the food came and while it wasn't bad if I wanted an amazing burger I would deffinetly chose Kumas over lockdown and we also had the wings again they weren't bad but I have deffinetly had better. Overall 3 stars food w for no a/c", "pics": null}}, {"review": {"des": "This was our first time here. We sat outside, as the night was/is gorgeous. They had a band playing inside so it was loud but still a good atmosphere. Our server was prompt and friendly. I had the \"build your own\" mac & cheese with pepper jack cheese, white cheddar cheese, and bacon. It was fantastic! My boyfriend had the Big House burger and fries and said it was delicious. It looked like it! Definitely want to return here!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/lRld4_BPR5gw615NGFaVcA/348s.jpg", "caption": "Pepper jack, white cheddar and bacon mac & cheese"}]}}, {"review": {"des": "Let's start w/the burger - it's tasty. We enjoyed The Big House burger. The French fries were lukewarm (disappointing). The restaurant was cold. The service was good. If the fries are served hot & the thermostat is dialed up it's worth eating here.", "pics": null}}, {"review": {"des": "The first thing that comes to mind when I'm thinking about the word \" lockdown,\" is no a prison cell, but a roller coaster ride. To me lockdown means I'm about go for a ride with some amazing burgers so I better get my harness and seat belt \" lockdown\" because this is going to fun! I know I'm weird but a lot of us foodies are weird people to begin with. So here is my review about the food.<br><br>I had their Boot leg burger the one with fresh home made kimchi was really delicious. It was a juicy tender burger cooked to my liking of medium rare burger. I love the cheese mixing with the fresh kimchi and the bun. I got a fried egg on it too which made the juicy messy burger all the more fun to eat. My husband had the lockdown burger and he enjoyed every bite. It has the organic ground beef with pretzel bun and the burger comes with fresh cut fries or a choice of salad. We chose the fresh cut fries of course!<br><br> The Lockdown bar & grill reminds me of Kuma's corner's atmosphere and decorations. I think the Lockdown has more appealing and their service is a lot better. The waitress is nicer and she always ask if everything is okay, which is good.<br><br> I would recommend and return to this Lockdown because the food is something I'll crave again and the service was excellent. It's totally worth a try if you happen to be in the area. For us we were somewhat in the area and it attracted us to go check it out. So please go check it out!", "pics": null}}, {"review": {"des": "I came here for the half off burgers Tuesday because why not..? It's a steal! To be honest, I came here a few years back and the first time it was just A-OK so I never really considered going back because it's a little off the beaten path but I had a burger craving.<br><br>Unfortunately, the second time around was Awesome! I say unfortunately because now I'll have Tuesday conundrums on whether or not to workout or just go and grab a burger here...FML!!! I ordered the Punk B*tch which is topped with a good amount of Prosciutto, slathered with garlic-y mustard aioli, and melted swiss cheese filling in everything in between. The meat was cooked to my preference, Medium and the pretzel bun just sealed the deal. GAMEOVER. As an added bonus the fries were on point too, especially the sriracha (my guess) type of dipping sauce they provide. <br><br>My total bill including tip came out to $10.74...(you should tip on the original amount vs. the discounted burger amount). Service was friendly and prompt. Atmosphere was well \"casual\"...read the other reviews. Go here on Tuesdays! Oh yeah the Mac and Cheese here is DELICIOUS too.   <br><br>Side story: Probably one of the awkward ordering experiences of Daniel Wong. <br><br>Me: Can I please have the uh Punk uhh...<br>Female Server: Bitch?<br>Me: Yes the Punk Bitch please...thanks...", "pics": null}}, {"review": {"des": "I don't know why people think this place is so great.  I went here with a friend (who had also previously reviewed) and her review is still true today: this place is super annoying loud, even when it's like 5 p.m. on a Thursday evening.  We went here because we wanted to do a working dinner.  I saw on Yelp that they had Wifi, so I brought my laptop and we came here for dinner, drinks, and work.  <br><br>Parking was easy, we got in alright, there were tons of tables available so we sat and I pulled my laptop out.  We place our drink orders and I ask for the wifi password... That's when the waitress kindly informs us that they have no wifi and, apparently, never did.  Why would people on Yelp say that they did if it weren't true?  And, also, great... we came here specifically to eat and do work and now I have to waste a ton of my phone data by using my phone as a hotspot.  Super annoying and douchey.<br><br>The food here isn't even that great.  If you're not getting a burger, don't bother getting any food.  The salads are overpriced and the appetizers were super greasy and burned-tasting.  The beer was fine but even domestics were mostly canned, which sucks because canned beer sucks.  <br><br>I probably won't come back because this place just isn't anything special and it's sort of douche-y.  The end.", "pics": null}}, {"review": {"des": "As a first time guest, i was pleased. My friend and i got there and were greeted right away. Our table was big and spacious. The bar itself was fun. All the staff was very friendly and catered to our needs. <br>For our appetizer, we ordered the fried pickles! So tasty and totally worth it. I like that they give free chips as a starter. I ordered a delicious veggie burger and a blue moon. I was very happy to see they had vegetarian options. My fries were burnt so i had to send them back but it wasnt a problem. They fixed it right away and our server was kind about it. <br>The atmosphere was great. They have tvs every where. They were showing concerts from rock bands. So it was awesome!  I will definitely be going back.", "pics": null}}, {"review": {"des": "The pictures and menu offerings had me salivating for a Lockdown burger for about a month now - however, when I finally got one this past saturday, I was slightly letdown.  I got the Warden burger with side of mac n cheese.  It was good, but I guess I was expecting to be blown away.  Yelp over-hyped it for me!  *sad face*<br><br>1.) The pretzel bun was cold/not toasted<br>2.) Mac n cheese was also lukewarm, and not super cheesy/saucy.  I like mine piping hot and oozing with cheese!  The noodles were too al dente for me.<br><br>I think I prefer Kuma's still.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ZNBdUKD4W3y1iOJnVdHoCg/168s.jpg", "caption": "Warden burger"}]}}, {"review": {"des": "I ate the Warden cold and it was still the best burger I've had the privilege to taste. The Mac and cheese was immaculate.", "pics": null}}, {"review": {"des": "My friend prefers Lockdown to Kuma's and I prefer not to wait for lunch so off we went to eat impressively loaded burgers while watching an excellent Guns n' Roses DVD. Service and atmosphere were very friendly but I didn't like their ground beef blend - found it to be on the lean side (and I asked for my patty to be cooked medium rare, in case you were wondering). It wasn't bad, I just love fat and maybe my burger preference has fully switched over to smashed burgers.<br><br>We got the Burger of the Month: the \"Wrongfully Accused\" and the kitchen was stupendously generous with the goat cheese - I dipped my fries in what was essentially a separate patty of goat cheese on top of my meat patty.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/VVuzb6yq4hZ76iTEsYl_eg/348s.jpg", "caption": "The Wrongfully Accused - so much goat cheese, nommmm."}]}}, {"review": {"des": "For our son's 25th birthday, this was his choice. Having read the reviews I was expecting the noise level would be very, very loud. It really wasn't. They call themselves a metal bar and burger place. And, yes, they do play metal. We were pleasantly surprised when the \"metal\" they were playing was an old AC/DC concert video - a young and chubby Ozzie Osborne sweating profusely on stage singing Ironman. It brought back memories.<br><br>\"Lockdown\" also has a jail theme. The burgers they are known for are all named for something to do with law enforcement, jail, etc. For example, I ordered the \"Federales\" - a 1/2 pound burger with chorizo sausage and a hot sauce on a bun with fries. Huge - sloppy - and so large I could not finish it. They have a wide variety of choices, including an Elvis burger complete with peanut butter and bananas (not sure I'll ever try that one). You also can build your own burger with a huge variety of topping choices.<br><br>We did start off with some appetizers - an order of their homemade chips, which were okay and fried pickles, which were very good.<br><br>But, damned if it wasn't one of the best burgers I've had in Chicago. If you don't want a burger, they have a few other options (not a lot, but some) - they offer a few salads and sandwiches. They also have a huge selection of craft beers and an impressive stock of liquors.<br><br>Lockdown is a great place with very attentive servers. With so many burger joints in and around Chicago, this is one you need to try at least once.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/rj2aaDE3ZFkk9g5QapMvLA/348s.jpg", "caption": "Fried dill pickles"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/MOYKKU44vCPA5cgAK_8pjg/168s.jpg", "caption": "Federales Burger with fries. Not sure how to begin..."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/mNOi_QUxE0DF4-OjgRCBig/168s.jpg", "caption": "Loosies"}]}}, {"review": {"des": "Lockdown is a shadow of its former self. Yesterday I walked in around 5pm and the first clue should have been how empty it was compared to what I remember. The second clue was the beer list; what was once a phenomenal list with beers from all over the country and world has dwindled down to your Chicago basics.<br>Now I have been to Lockdown 20+ times over the last 3 years. The Fat Elvis with Mac n cheese for a side had me going there once a week after work for dinner 2 summers ago and I live in the far western suburbs so it was entirely out of my way. That is how good Lockdown was. It is not anymore. What did not come to a surprise was that Lockdown had undergone a management change. If the new owners are reading this, I would implore you to change your ways and go back to the quality that earned Lockdown 4+ stars on Yelp. <br><br>The Fat Elvis: the burger is no longer the thick juicy angus burger patty that it used to be. It is your run of the mill beef patty. The kitchen no longer understands what medium rare is. What I received was grey and dry not even a hint of pink. Next, the bacon seemed thinner, leaner and not as high of quality as it used to be. The peanut butter used to be piled on this burger and high quality. The balance relative to the other flavors (I.e. Bananas, bacon, beef, bun) was done to absolute perfection. The Fat Elvis used to be a burger that once you picked up you didn't put down because it was so deliciously messy that if you took the time to actually wipe of your hands and face entirely you would need another large black napkin. A large part of that was the peanut butter and now you will honestly have trouble finding the peanut butter. They use what can only be described as a modest amount but the color truly pales in comparison to the rich creamy brown peanut butter Lockdown used to use. Finally, the bananas are done close to the way they used to be. They are not browned or as sweet as they once were but the change in the bananas was relatively minor compared to the change in everything else about the burger.<br><br>The Mac n Cheese: Lockdown once had a Mac n Cheese that would go toe to toe with anything else offered in Chicago. Today, their Mac n Cheese is marginal at best. The perfect blend of cheeses is gone and replaced with your run of the mill profit margin increasing cheese that anyone can buy at their local grocery store. The green onions were at times too noticeable in the dish. The bacon chunks were at times too large. The consistency that the green onions and bacon were once chopped at is gone as well as the quality of bacon used in the dish. They have also increased the up-charge from $2 to $3.5. They are charging nearly twice as much for a much worse product than before.<br><br>This was the one restaurant that I constantly talked up for years and raved about. Honestly, I will not recommend Lockdown to anyone I know anymore. I am also in the process of letting those who have heard me talk about it know how far Lockdown has fallen and that I no longer stand by my recommendation. I suspect I will never be at Lockdown again because it is so far out of the way for me, which is an absolute shame. <br><br>Beef: from 9/10 to 5/10<br>Bacon: from 8.5/10 to 6/10<br>Peanut butter: from 10/10 to 3/10<br>Bananas: from 9/10 to 8/10<br>Pretzel bun: largely the same<br>Overall Fat Elvis: from 9.5/10 to 5/10<br>Mac n Cheese: from 10/10 to 6/10", "pics": null}}, {"review": {"des": "Lockdown is my response to people who love Kumas. We go here religiously for Tuesday night half-off burgers. I've had almost every burger on the menu and each is a feast of meats and toppings- Cruelty to Animals (carnitas, white cheddar, prosciutto, and juicy bacon on a thick burger) is my favorite. Also try the Conjugal visit (cranberries, stuffing, mashed potatoes, and melted brie) with a chicken breast. The mac and cheese is the best damn mac and cheese I've eaten.<br><br> The staff here are cool and accommodating, the atmosphere is one of a kind, and the garlic aioli that comes with any order of fries is addictive. Beer selection is great too.", "pics": null}}, {"review": {"des": "We had a part of ten mid day on Sunday. My first time there. I loved the the food and service. I wish I knew the servers name but she was awesome. Everyone enjoyed their food. My wife said they have the best veggie burger. I went with the brunch omelette and a side of their Mac and cheese very good. The server then brought out a bonus bowl of Mac and cheese with chorizo no charge, and that was excellent I'll go back. Good food and service", "pics": null}}, {"review": {"des": "Hello Lockdown.  It has been too long that I've been meaning to visit!<br><br>I rolled in with a few friends - most of us interested in The Fat Elvis due to some Grand Marnier Flambe respect and a love of peanut butter.  It was a wednesday so we were promptly seated, though the table was a bit wobbly.  It seems like the experience here is mostly geared to a 2-person party, but there are 3-4 tables built for 4 or more.<br><br>The waitress was friendly, funny, and prompt and got everything done pretty quickly.<br><br>Draft selections were pretty reasonable at $5-6 for most and $7 for a couple, but local cans were 1/2 off and a great deal!  The drinks came quick and our order wasn't far behind.<br><br>The Fat Elvis was good, but I wouldn't necessarily say it crossed any thresholds.  I thought the peanut butter would be more overpowering but the flavor was very balanced between burger and sweet desserty PB banana.  The one thing I'd suggest is adding some cheddar (or it could be weird, but maybe even blue cheese) to bring up the level of savory a bit and make the flavor a little more complex.  Definitely a mess-maker with melty peanut butter, so make sure to grab some extra napkins.<br><br>The Mac 'n cheese I subbed in for my fries was an A+ and a definite winner.  The portion is reasonable and the stuff was really, frankly, very good.  I did try a couple of my friend's fries and the dipping sauce they came with (spicy mayo-ish?) was pretty tasty and the fries were \"normal\" but cooked just right.<br><br>The only thing that really surprised us was a friend's Old Fashioned that totaled out to $18.50 with a Maker's Mark equivalent.  I didn't take it for that type of place, but so be it.  Definitely echm Lock Down your beer order.<br><br>I'll definitely be back for the mac 'n cheese, and maybe I'll have to try The Warden burger for some of that truffle oil goodness.  It definitely smelled strongly and deliciously of it from across the table!", "pics": null}}, {"review": {"des": "My friends recommended this place so I was really excited to try it finally. When we walked in the atmosphere was different. Music videos of heavy metal were being played if you're into that. The staff did not seem friendly. When we were finally helped a gentleman pointed us towards a table. When we got to the table a lady asked us to move towards the back. It seemed odd but we didn't think much of it. We ordered buffalo wings and fried pickles to start. The appetizers came out really fast. The wings were crispy and tasty, honestly the best part of our meal. The fried pickles tasted like your regular fried pickles. Nothing really special. I ordered the Arson Burger, their spiciest burger based on the recommendation of my friend. The wait for our food was well over 40 minutes. When we got our food, my burger had a tiny splash of their house made sauce and topped with pieces of habaneros. There wasn't much to the burger. The burger was spicy but not as spicy as I thought. This could be because I really like spicy food. It was underwhelming to be honest. Probably will not make an effort to return.", "pics": null}}, {"review": {"des": "Amazing burger & fries! Great service as well. I just wish that I wasn't forced to drink beer with my burger. I'm not a big fan of that.", "pics": null}}, {"review": {"des": "Some of the best mac and cheese I've ever had. Years ago, they used to offer their mac and cheese as half off for one of the daily specials, so I ended up eating there way too often. My favorite was always with carnitas and roasted red peppers. The burgers are good too, but I've always been a huge fan of the mac!", "pics": null}}, {"review": {"des": "I've been here twice in the past week & am still planning on my next burger to try (The Conjugal... drooool). So obviously they're doing something right & you can't go wrong with half off burgers on Tuesdays.<br><br>This place has the same vibe as Kuma's (craft burgers & beer + metal music theme) & it just soothes my dark soul all the same. The music is extremely loud & you have to scream to hear the person across from you, but that's the whole idea duhh. <br><br>I've had the Border Patrol & the Electric Chair as veggie burgers with mac & cheese no bacon. Border Patrol was so good. Electric Chair was just average I guess & really messy to eat, but then again I'm a piggy messy eater to begin with. The mac & cheese... I'm sorry to say, but I'm over it. I've had way better mac in other places in the city. Next time I go I'll stick with the fries.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/8ptgQv9KeKVyIOVmDdWdKQ/168s.jpg", "caption": "Short's soft parade, fruit & veggie beer. So good!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/RZNkc2hSItYspFrC7DVCUA/168s.jpg", "caption": "Electric Chair veggie burger + Mac & cheese, no bacon."}]}}, {"review": {"des": "Went here because I heard the burgers were good. They were not that great. I didn't even finish it and I was really hungry. Most likely will not go here again. The service was great and the bar is nice.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/S9Hne7uZDAsE_k5lW7gk9Q/348s.jpg", "caption": "The Federales (spelled wrong probably)"}]}}, {"review": {"des": "My husband LOVED this place.  I thought it was cool too but not quite 5 star worthy. Let's start with the good stuff.  <br>The beer selection was awesome & the menu looked amazing.  We were only there for the liquid yumminess.. I did have this type of \"grown up\" root beer float that was delectable. <br><br>Okay so on with the not so great stuff.  It's a type of dive bar, but only in the way of cleanliness.  I get the decor & loved it.. I mean who doesn't like a skeleton head at the bar to drink with,  right? But seriously owners. . Clean the bar, the menus & the bathroom. . I swear it won't mess up the image.  <br><br>That said,  we'll definitely be back to try the food. . I just hope it's slightly cleaner.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/r4mzD47icuYHeqlV-D3_Fg/348s.jpg", "caption": "My friend at the bar."}]}}, {"review": {"des": "I've been wanting to try lockdown for awhile after hearing all the hype. Unfortunately, I was not a fan. My burger was not cooked. It was raw and not edible. The burgers were a little too much for my taste with all the extra ingredients.", "pics": null}}, {"review": {"des": "Online says half price burgers on Tuesday. The only reason we came here was for half price. $16 plus dollars for a burger is too expensive for my taste:/", "pics": null}}, {"review": {"des": "Service was super slow even tho no one was there.  Brought me wrong item. When they brought the correct veggie burger it was mushy and no where near burger status.  More like oatmeal.  Sent it back and didn't get to eat while watching my friends eat", "pics": null}}, {"review": {"des": "I have to agree with every reviewer in here that says it used to be great but is now a huge disappointment. I was wondering, after my visit, if the management had changed and it looks like it did, which explains a lot.<br><br>I used to live blocks away for about 10 years and while I wasn't a regular, I had stopped in a handful of times and really enjoyed it. The music was way loud, but the burgers were inventive and a great alternative to Kuma's. If I remember correctly, you had your choice of patty (beef, bison, chicken or vegetarian) and the toppings were varied, but if you went with one of their creatively made ones, you couldn't go wrong. At one point they had a burger with a scotch bonnet that my spice-obsessed boyfriend loved. That's gone.<br><br>When we came in about a month ago when back in the neighborhood, it was a totally different and disappointing experience. Beef was your only choice, and each burger option, though they had the same fun names, looked like it was a variation of the same 6 toppings in different configurations. I looked at building my own but guess what? I only had the choice of the same 6 toppings. Needless to say, I wasn't thrilled with the burger I eventually landed on. However, the greatest insult is that we noticed that on the menu it states that all burgers are cooked to medium-well- no substitutions. I think that medium-well or well-done is a complete waste of meat and I prefer my burgers medium-rare. We asked our waitress why, and she explained that the kitchen thinks it's too hard to estimate the cooking time for different temperatures (something about the patty being too big or something) so they decided that everyone will have their burger only one way.<br><br>Yes, you read that right: a BURGER JOINT that doesn't know HOW TO COOK BURGERS. Either that, or their chef is too lazy to deal with it. I've never heard of this before in any other burger place ever.<br><br>Needless to say, the burger was overdone and the meat was tasteless. The only positives? The music was good without being too loud, our waitress was friendly and attentive, and the bartender was awesome. However, those three things aren't enough to make me come back ever again.... unless there's another management change.", "pics": null}}, {"review": {"des": "Fast friendly service. The burger was huge and juicy. Really liked the house aioli and the Scrumpy's cider.", "pics": null}}]}