{"name": "longman-and-eagle-chicago", "reviews": [{"review": {"des": "This place is surprisingly cozy and comfortable, considering how packed it gets and the small space. The staff is hip, but not pretentious- very helpful! <br><br>We sat at the bar and ordered the pretzel along with the truffle pasta. The pretzel was great and the side was amazing. The truffle pasta has mushrooms, cheese and goat's milk which is served in front of you. It was also delicious. We had the clock drink and really enjoyed it. They have a very interesting selection of cocktails with their own twist and are big on whiskey, but if that's not your thing, they have beer. <br><br>Overall, I'll definitely come back and try more things on their food menu.", "pics": null}}, {"review": {"des": "I used to live right down the street and was lucky to end many nights here. <br>L&E wears a lot of hats. They're a late night bar, a casual yet upscale dinner restaurant, a brunch option, an outdoor patio joint, and a whisky bar. Late night is nice here Bc it finally slows down (a bit) and you can actually get in. <br>Dinner is unique. I love their standby sloppy joe. But my fave is the micro greens salad. There's almost nothing to it, but it's perfect. <br>Brunch is hip and very Logan square. I think the menu changes sometimes. <br>The outdoor seating is really nice and slightly off to the side, perfect location. <br>I'm not a whisky drinker, but all their cocktails are great. And strong. <br>During off hours, the side bar/patio is open and has a very small menu. They have a small drink list to choose from and sometimes sell donuts. <br>If you're coming for brunch or dinner, prepare to wait a very long time. That's why I only come at odd hours.", "pics": null}}, {"review": {"des": "The absolute best Brunch of your Life is waiting for you here.<br>The drinks are amazing too as well.  Everyone was super friendly and very skilled in their jobs. <br>There was a bit of a wait understandably so.  The bar in the back was great and easy to have a drink and wait for our table.<br>The food omg.  I can not say enough good things about it.<br>The #1 hands down best ever biscuits and gravy are a must have.<br><br>I am for sure stopping back in my travels", "pics": null}}, {"review": {"des": "I've only come here for Brunch/Breakfast and have been here a few times over the years. They use fresh, seasonal, local ingredients here so their prices reflect that. Sometimes I've been absolutely blown away by my dish, other times not quite so exciting. I've always experienced very good service. <br><br>Loved the Elote Benedict on their current brunch menu. Very inventive and quite delicious. So glad our waiter recommended this! I like being able to sub greens for the fried potatoes, too. <br><br>Longman & Eagle was the first place I ever ate chicken and waffles a few years ago. I was so excited by it, I've ordered it many other places since. When I ordered it a 2nd time at L&E, I realized a lot of places do chicken & waffles better. It's one of their pricier options on the menu. <br><br>Atmosphere is quite pleasant and it's an enjoyable breakfast/brunch spot.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/kCrf2bYbZhGAvYRiXa9RqQ/348s.jpg", "caption": "Elote Benedict with side of greens"}]}}, {"review": {"des": "Overall: Breakfast, brunch, drinks, dinner, whatever...L&E is sure to satisfy your comfort food cravings.<br><br>The good: Came on a Saturday for a late brunch, and wasn't disappointed. The pumpkin granola muffin was warm, soft, and delicious. As for the main course, the chicken and waffles hit the spot on a lazy saturday, with heaps of juicy, perfectly-breaded fried chicken. The waffle wasn't overwhelming and the hash side was a good portioned side dish. Our server was friendly and quick, and the atmosphere leans old school with the exposed brick everywhere. <br><br>The not-so-good: Not much, just didn't have the \"wow\" factor that I was expecting due to overhype. If I have one thing to complain about, it's that the menu was a tad too small, but that's being nitpicky. <br><br>Food: 8.5/10<br>Atmosphere: 8/10<br>Service: 8.5/10", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/y5r5fOY_DZMi3s46GHZpjw/168s.jpg", "caption": "Chicken and waffles with glazed sweet potato and pork belly hash"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/506HTsz0mhXaABq_-eObmw/168s.jpg", "caption": "Pumpkin granola muffin"}]}}, {"review": {"des": "We came here early (like 3pm) on a Sunday night and had drinks in the back bar and put our name in the list for dinner. Our group of 8 got a table right when they started service. I'm so happy we were a large group bc it meant we got to explore a lot of the menu. There were so many really creative and tasty dishes. <br><br>I'm sure the servers all say this, ours did, but these plates are mostly meant to be shared. Some are certainly large enough to be a meal for one, but really why keep that wild boar sloppy joe all to yourself when you can share and also have the falafel scotch egg, and the salt baked apple?!<br><br>The drinks were pretty outstanding with a fun selection of beer and cider as well. Love the relaxed vibe paired with the elevated cuisine.", "pics": null}}, {"review": {"des": "Gosh I just frickin' LOVE this place. An unassuming B&B (+lunch +dinner +dranks and everything in between) in Logan Square across the street from the blue line and bus stops. The people who opened this place reaaaally made it work.<br><br>The food is incredible! They do farm-to-table and it shows in their creative dishes. Crisp veggies and the most tender of meats.... sign me up lolz. I have tried the steak tartare, sourdough pretzel, falafel scotch egg, grits and breakfast burrito... and every single dish has been superb! Pumped to try more.<br><br>One thing I love about this place is their very clear desire to keep things fresh and engage the customer base. If you follow them on Instagram you'll learn about new beverage releases, happenings at their OSB (off-site bar), Monday night dollar beers, seasonal menu items, their \"Donut Shop\" etc. I'll def be keeping tabs to see when to stop back in.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/xJ1ZGXOk7nuWN-OFRdwD_A/348s.jpg", "caption": "Steak tartare with asparagus. Sourdough pretzel with Dijon beer butter. Whoever thought of mustard+beer+butter is my personal hero"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ELEFsiFLPdrQMHI3GcuHbw/168s.jpg", "caption": "Some sort of summery tea-whisky-mint cocktail that was frkn inspirational. Love the aroma of the mint leaves while sippin'"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/3ReWEkj1tm1SoRBAD3jrQg/168s.jpg", "caption": "¡¡!!!Beef tartare w/ asparagus!!!¡¡¡¡ S'good"}]}}, {"review": {"des": "Was super excited to try this place, and luckily snagged a table for two right before the dinner rush on Saturday night. I had been starving after a day of climbing so we decided to order 4 dishes to start and go from there. <br><br>We ordered the beef fat fries ($6) which came in a nice portion size and a unique giardiniera aioli dipping sauce. We also tried the salt baked apple ($13) which was a super light dish/salad containing cut up apple, puffed wild rice, purple cabbage and Dunbarton cheese. This had some nice flavors but wasn't satiating at all. Then came the crispy octopus ($14) in a delicious bone marrow sauce. Unfortunately the octopus was overcooked and tasted way to rubbery. Lastly, we tried the truffle pasta ($16). This was so delicious but only came with 6 small pieces of ravioli! Needless to say we were not full after the 4 dishes, but we had decided to go home instead of ordering more since we weren't super impressed with the items we ordered. I also tried their signature whiskey sour ($10) which was one of the best whiskey sours I've ever had. <br><br>Not sure if we had just ordered the wrong items on the menu...but we also heard that they had a new chef who redid the menu and removed some of the dishes that made Longman and Eagle famous.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/j1ISc3X4ESrlrRCVUrLjzA/348s.jpg", "caption": "Truffle Pasta"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/W8u5nAGxxm_NWdwO8nJ3uQ/168s.jpg", "caption": "Beef Fat Fries"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/k2Cz8aDZIZYSZ7lM9zRscQ/168s.jpg", "caption": "Salt Baked Apple"}]}}, {"review": {"des": "Calling this place a gastropub does it a HUGE disservice. I mean, yes the atmosphere and decoration is very gastopub-like, but the food here is basically like a Michelin starred restaurant. <br><br>When I saw the menu, I was beyond blown away. When I looked at the menu, I looked around and had no idea what was happening. <br><br>The menu here is so creative, delicious and crazy good, I am definitely going back. They have surprising small plate that was eel on compressed watermelon. Whoever thought of that was BRILLIANT.", "pics": null}}, {"review": {"des": "Used to be one of my favorite spots in the city but certainly has dropped off in the past year and a half. Still, service is always great, and the whisky selection and dessert is top notch.<br><br>This last visit i had the chicken ballotine which was fine, a little salty with the bacon and collard greens. Miss the old chicken roulade with the hush puppies...<br><br>4 starts for solid service but foods just not as good anymore", "pics": null}}, {"review": {"des": "We came here after dinner for drinks and dessert, so while I can't comment on their dinner menu, the plates we saw going by looked delicious. <br>We sat outside at their Off Site Bar. The cocktail menu is short and sweet - I got the Rollo de Guava. It's light and refreshing, very easy to drink. Hubby got an old-fashioned, which was pretty standard.<br>Now the dessert. OMG. We got a sunflower cake with bee pollen cream and lemon streusel. So so so good. Perfectly balanced and creamy; loved the different textures and the little sprinkle of sunflower seeds. <br>We will be back! And will definitely try the dinner next time.", "pics": null}}, {"review": {"des": "Great brunch menu with a diverse selection of delicious items! Wait staff is super attentive. <br><br>We shared the chicken and waffle with sweet potato hash as well as the duck egg hash. Both options were amazing!! The duck egg hash is on the smaller side and the meat is lacking but was overall still very savory and delicious! <br><br>Excited to come back and try out their dinner menu!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/mjdK-YU48yuhhoSzFgzvfw/168s.jpg", "caption": "Duck confit"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/gx1TE5uGmjckSRON3riY-g/168s.jpg", "caption": "Chicken and waffle with sweet potato hash"}]}}, {"review": {"des": "I came here for a solo dinner at the bar while my boyfriend was at a conference event in town. The whiskey list is impressive and extensive. The bartenders are friendly and willing to answer any questions you have about food and drinks. While a boulevardier wasn't on the menu, the bartender, in all of their whiskey knowledge, whipped up a delicious one for me. <br><br>Asking the bartender for food recommendations, they immediately suggested starting with at least one broiled oyster. Typically, cooked oysters are not my thing; I prefer them raw. This one comes with savory crab butter and gourmet af lemon pepper pearls. The flavor explosion that happens is.... unbelievable. Not feeling too hungry, I ordered the grilled octopus. It came with a rich bone marrow sauce that I could have licked off the plate. <br><br>Being the dope that I am, I forgot my credit card. The bartender graciously let me run across the street to get cash out of the ATM with complete trust. Thank you!", "pics": null}}, {"review": {"des": "Cheeseburger with duck skin mayo (sans pickle) and fries were amazing. I'd say tied for my favorite burger restaurant in Chicago (and I've been to many). Don't think I could've told you that the mayo was of the duck skin variety, but a fine addition nonetheless. Beef was perfectly salted and perfectly cooked to a medium rare. Fries, on the other hand, were not salted but accompanied by ketchup so it's all gooood.<br><br>Having had a Michelin star (now only Bib Gourmand), there was a lot of hype but I'd say it meets the hype. Highly recommend if you want a quality meal in a chill, upscale bar space. Came in on a Tuesday night at 6 without a wait but I have to believe the same wouldn't be true on a weekend evening.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/bLEFa-eBTvVNeKVyXQV6cg/348s.jpg", "caption": "Cheeseburger and fries"}]}}, {"review": {"des": "Once was enough. <br><br>We showed up early on a Saturday evening and were told 45 min wait. As first-timers we were especially interested in this place so we stuck around. Two hours later we finally got seated after I had checked in with the hostess twice. Our meals, the Truffle pasta and short rib, came out relatively quickly and tasted okay. The portion size was super small for the price. I don't expect that a place like this is going to serve gut-busting portions but I was hoping for a bit more, especially after waiting so long. The staff was friendly and attentive. The space is super intimate and loud, too loud to enjoy a conversation unfortunately. That or my 31 y/o ears just aren't a match for the hipster scene of this place.", "pics": null}}, {"review": {"des": "Mediocre.<br><br>With high expectations set... Longman & Eagle didn't make the cut!<br><br>You're thinking to yourself, \"Could this be another option other than Owen & Engine?\"<br><br>The answer would be: \"You may be disappointed.\"<br><br>The food was not bad but instead a let down. Overpriced for what one receives. The Henry McKenna shot wasn't bad for $3 though.<br><br>The Sourdough pretzel for $6 was tasty but portion was very disappointing. It's a pretzel! Longman, don't loose your sanity.<br><br>The Crispy Octopus, Bone Marrow XO, Fingerling Potato, Radish for $14 wasn't bad but lacked flavor and was not hot in temperature. The sauce was very bland and nothing on the plate stood out that deserved to be put on a menu. Now, to the burgers! The burger wasn't bad but definitely was a let down, since many people stated it was their favorite burger in the city or in general. It was a regular decent burger. Salted and cooked properly. The meat tasted of quality meat but nothing stood out to make this burger a $16 burger. The fries were good but Red Hot Ranch was yelling in the background, \"You would have been happier with my fries and burger\". Yes, it's not a thin patty burger but for a farm burger there are plenty of better options. Plenty. Very overhyped burger. <br><br>Unfortunately, this was a tester that would see if it's worth returning to but the quest goes on and nothing begged for a return.<br><br>They say, <br>\"BUT THEY HAVE MICHELIN CREDIBILITY!\"<br><br>It seems as if receiving Michelin stars \"tends\" to create certain overpriced simple menu items. Nowadays some chefs/restaurants not only want it for credibility but as a stamp to overcharge for minor culinary creativity. It's vain.<br><br>Also, \"some\" of their tasting events are overpriced. In the area their has been 40 year old Scotch tastings that were more fair in price than Longman's events.<br><br>The service was good, as far as the server is concerned.<br><br>On a side note, on the phone the lady said the outdoor patio would be a 45min wait but when walking in 3-5min. later, after parking, seating was immediately available outside. Maybe, something opened up?<br><br>Also, sometimes servers or employees kept hovering or coming around the table areas, near empty tables. They seemed to be checking too often on something and acting like they were checking an empty table yet had another purpose. Not sure what the intent was but it was a bit distracting. <br><br>Word is, they got a new head chef. People may want to blame him but maybe that's not the problem. The problem may be those making the decisions. They need to step up what goes out from the menu.<br><br>Maybe other menus items deserve trying?<br><br>Unfortunately, it didn't make a good impression that calls for a return when yet there's more exploring to do.<br><br>The place was nice.<br><br>The cocktail was good.<br><br>The food wasn't bad.<br><br>In a nutshell: <br>Unimpressive.", "pics": null}}, {"review": {"des": "We stopped here after grabbing beer from Pipeworks and it was a pleasant surprise. The food was amazing with a decent beer selection. Clearly, we are not whiskey people, but the selection looked good. It's a very cute place, not huge. We had the cheese and cracker board that had honeycomb, which was amazing! We also had the oysters, bbq salmon and pork shank. All were amazing!!! Not that this matters, but their soap smelled good and I appreciate businesses with good soap haha. All in all, this place is def worth giving a try.", "pics": null}}, {"review": {"des": "Meghan drove us here in her cute car. Vroom! Thank you Meghan because it was delightful.<br>Staff is really really nice <br>Food is very original, delicious, maybe some portions are not generous enough.<br>Their selection of drinks is interesting and diversified.<br>Music is not too loud so you can enjoy your friends without yelling at each other.<br>Eco friendly - Hipster vibe - Woody atmosphere.<br><br>Don't forget to bring a flashlight, it's kind of dark though.", "pics": null}}, {"review": {"des": "Longman and Eagle is popular among locals and travelers. It's another quintessential part of Logan Square; hipster, welcoming, and urbanized with vibrant conversations. This place is open for food, drinks, and overnight stays.<br><br>While I do not have experience with the hotel side of Longman and Eagle, I have been to there for food. The first time, I went at 4:15pm. Dinner is not served until 5:00pm, so we ended up going else where. The second time, I came here for brunch. There was a 30 minute wait. The restaurant is compartmentalized into three sections: front bar with dining seat, a room with more seating, and the back bar. We waited for our table in the back bar, which had its own smaller menu. We were able to order drinks and sit in a communal seating area. <br><br>For brunch, I ordered the Elotes Benedict ($16 Corn Cake, Sour Cream Hollandaise, Avocado, Lime, side of house potatoes-- filling, hits the spot, a must order for Benedict fanatics). The corn cake was soft and went well with the smooth and creamy textures. Not to mention, the presentation was mouthwatering attractive. My husband ordered the Fried Chicken & Waffle ($18 Sweet Potato & Pork Belly Hash, Maple Syrup-- the chicken wings are sou vide; giving the chicken an undercooked appearance). My husband described the chicken as gelatinous, but was won over by the hearty sweet potato and pork belly hash side. Our friend ordered the Challah French Toast ($9 Whipped Hot Chocolate Butter-- great portion, but surprisingly different overpowering butter taste, does not come with syrup). He did not end up taking the leftovers to go. These brunch plates have quite the textures and presentations. Always a safe bet to ask the server of their favorites! <br><br>This place is now and forever on my Chicago Brunch list. Prepare for a sophisticated, yet lively experience. Longman and Eagle is diverse and a crowd favorite!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/8PPm6_5FldB5SiZOM-WRiA/348s.jpg", "caption": "Brunch Menu as of 9/30/18"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/LatARcnnHzA0GfI5IiNN7w/168s.jpg", "caption": "Fried Chicken and Waffles"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/y3WoHJa1LZdrYxx-dEABqg/168s.jpg", "caption": "Elotes Benedict"}]}}, {"review": {"des": "Love their beef rinds and fries. <br>Everything we ordered was food but just a bit too salty.  <br>The trout brandade goes well with the baguette but again too salty <br>The lamb rack was super tender but too salty <br>Octopus a little dry", "pics": null}}, {"review": {"des": "Becoming a classic. I lived in Logan in the hay-day of Lula, 05'- and it has remained to this day. Longman has become an instant classic in LS. The menu is interesting, but also delicious. I am sure they do   not skimp on ingredients. This is top tier dining and drinking. <br>I have been here 6 times in 4 years. The food never disappoints. I love that they change up the menu and focus on quality items.<br><br>Host: Super Nice Female. Unsure of name. Held door. <br>Waiter: Nick. He is funny and recommends interesting dishes and drinks.<br>Bussing: not sure, but super efficient and my water was always full.<br>Bartender: Male. Drinks were on point. <br>Outdoor seating: pleasant. <br>Regular: Melissa was cool and had fun things to say.<br><br>I had the duck confit on recommendation from waiter. It was close-your-eyes while chewing delicious. <br>Also- tasted my friends' dishes. All had great flavor!", "pics": null}}, {"review": {"des": "STOP checking the tables to see where in the process of eating guests are and taking notes!<br><br>I understand there may be people waiting but each time i have dinner at L & E, i see the host / hostess walking and staring at people and writing a note...kinda rude.<br><br>took 4 out of towners including two from France to L & E to introduce them to Americana.<br><br>I was lucky three of them had burgers and one sloppy joe...L & E succeeds in those.<br><br>I had:<br>Steak tartar 2/5  more of a mediocre salad.<br>lamb ribs. 3/5<br>chocolate cherry 3/5<br>sunflower cake 3/5<br>vanilla ice cream with whisky sauce 4/5<br><br>the whiskies were fine.<br>service was good.<br><br>I still recommend this restaurant and will certainly go back...only stick to the basics.", "pics": null}}, {"review": {"des": "One of my favorite restaurants in Chicago! It's tapas style, so my bf and I ordered 4 plates of food which was just the right amount for the both of us. <br><br>The ambience was very laid-back with dim lights and cute wall decor. It was had tons of seating, and lucky for us only about a 10-15 min wait, but I would recommend reserving ahead of time.<br><br>The first dish was the crispy octopus with bone marrow sauce. It was a phenomenal, perfectly crisp on the outside and tender on the inside.<br><br>The second dish was freshwater eel over watermelon. A surprisingly well-paired combo, and probably one of the best eels I've ever had. <br>Pl<br>The third dish was a trout brandade with delicious cheese served with bread. Another spectacular dish if you love a fancy cheese dip with bread!<br><br>The last dish was the dry aged duck with matzo balls. This had a much less bold flavor than I'd like, but still an interesting mix of flavors.<br><br>Overall a fantastic place for new mixes of flavors!", "pics": null}}, {"review": {"des": "If you read my reviews, then you know I am a huge Foodie and Longman & Eagle (L&E) has been on my bucket list for some time now. I did see late last year that they lost their Michelin star, but no matter as L&E has a very high reputation in Chicago. I am a huge bourbon fan and L&E definitely knows their bourbon. They have a massive list of bourbon and you can find some good finds. I think their prices are a little high, but if there is a bourbon you are dying to try, L&E probably has it. <br><br>I came here for brunch with my parents on a Sunday. Surprisingly it was only a 30 minute wait for a table at around 11:30am as the place was packed. So we went to the Off Site Bar (OSB) for a drink while we waited. I ordered a Manhattan and it was delicious made with excellent craft. OSB has small bites and communal tables with a cool modern speakeasy vibe. There was a motorcycle on the wall with an old school speaker.  <br><br>When we were seated, I already knew what I was going to order (The Burger). I am a huge fan of burgers and I am trying to find the best one in Chicago, which I have pretty much narrowed down. I have heard that L&E was rated as one of the best so I had to try it. The bun, bacon, and melted cheese were great. On the other hand, I thought the burger was a little dry and lacked flavor/spices. Don't get me wrong, the burger was good, but the problem is I have had better burgers in the city. I would put Au Cheval, The Loyalist, Owen & Engine, and Kuma's Corner above L&E. The fries were very good, but I wish they added some garlic aioli instead of ketchup on the side like other places do. My Dad ordered the Chicken & Waffles and I wish I got that instead as it tasted amazing. <br><br>Overall, I really liked L&E and I will have to come back and try some other items on their menu. Service was good and they were very efficient. It was packed on a Sunday and it was only a 30 minute wait for a table, which was nice. Prices are expensive (River North/West Loop prices in Logan Square), but that's what you pay for an ex-michelin star restaurant. L&E knows bourbon and their cocktails are amazing. Whether you come here for food or drinks or both, you will be impressed. I can see why L&E is one of the best restaurants/bars in Chicago and I will be back again.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/keQHxgNdBuyOF6bLM9e-hw/348s.jpg", "caption": "The Burger. Good, but I have had better."}]}}, {"review": {"des": "For the amount of recognition that this place has, it was a complete disappointment. <br><br>We had the chicken and waffles and it was almost impossible to eat. The chicken was not seasoned at all and it tasted very gamey. It came with a small amount of sweet potatoes that were very sweet and the waffle was very small. <br><br>We cut into the chicken and half of it was not cooked. We only ate part of the meat.<br><br>The Bloody Mary was good, not very spicy.", "pics": null}}, {"review": {"des": "Even though we sat outside and my fingers were about to fall off from the cold, the dining experience overall was fairly delightful - everything was flavorful and delicious. And the drinks were superb!", "pics": null}}, {"review": {"des": "Creative, delicious, and affordable! Great veggie options at this trendy neighborhood spot. Good chill vibes and farm to table make for a very pleasant dinner locale that you can feel good about environmentally and from a budget standpoint.<br><br>The mushroom toast was not what I expected but a delightful surprise--stringed mushrooms, goat cheese, and a blueberry compote made for an unexpectedly yummy combination! Also a good portion size for a dinner of \"toast\".<br><br>The drinks were on point. I got the Form VII, which was an aviation with foamed egg whites. It was perfectly balanced between sweetness, alcohol, and herb.<br><br>There were a number of appetizers that I need to go back and try. Until next time -- cheers!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/CosoKV-aPWLpc59rrLhHpQ/168s.jpg", "caption": "Mushroom toast"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/AkXX--ozen6GO8NPNBlSfw/168s.jpg", "caption": "Assortment of cocktails including the Form VII -- highly recommend"}]}}, {"review": {"des": "This is a retrospective review of a visit in Chicago during the summer of 2016. I stayed at Longman & Eagle as a guest in their inn and also ate breakfast there. I didn't realize it was a Michelin-starred place when I booked a room, I just thought the prices of their rooms were amazing.<br><br>Overnight stay:<br>I booked a room since I was attending a work conference in Chicago. I checked in with the host at the restaurant and got my key. The simplest check-in process ever.<br><br>The entrance to their rooms are separate from the restaurant. This allows guests to go as they please without having to deal with the restaurant.<br><br>Once I got into my room, I was just so amazed at the little details and touches throughout the room. I don't really want to give away more information than that to be honest (and won't post pics). There's some really cool surprises here that reminds me of why I love Logan Square so much. Let's just say that some of the amenities are hipster-centric and give the room so much character. Unless one is already a hipster, then they may roll their eyes and be like, \"ugh, sooooo last week.\"<br><br>The bed was comfortable, the Aesop lotion was wonderful, and overall the value of staying at Longman & Eagle vs a hotel or AirBNB was exceptional.<br><br>Breakfast:<br>The next morning a friend joined me for breakfast downstairs at the restaurant. Guests who stay overnight also get 2 free tokens that can be used for coffee or whiskey. Therefore I got 2 shots of whiskey and my friend ordered coffee.<br><br>Torchon of Tongue Stuff:<br>I ordered some kind of torchon of tongue meat, tomatoes with rosemary, and potatoes. It was fantastic. Fantastic enough that I can remember the tenderness of the torchon and the fact that I even remembered what was on the plate from 2 years ago!<br><br>French Toast:<br>My friend ordered the french toast. I thought it was okay. I like my french toast crispy on the outside and creamy on the inside. There were some cherries and greens thrown on top, but the toast kind of brought down the overall dish.<br><br>******<br><br>Conclusion:<br>A fantastic value for people looking for a place to stay in Chicago. The room was wonderful at the price and having a Michelin-starred restaurant downstairs is super convenient. The next time I visit Chicago I will definitely stay here and try out the dinner and dessert menu. Also, the Logan Square neighborhood is just so awesome isn't it?", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/s3GAWs6jBhKDn073AAsJVA/348s.jpg", "caption": "Tokens for guests staying at Longman & Eagle."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/0_rq2Niorr1_YAql9NZeKw/168s.jpg", "caption": "View from the side entrance for guests staying at Longman & Eagle."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/2Fc5yIn9IIlnEdE90jTGZg/168s.jpg", "caption": "Yum!"}]}}, {"review": {"des": "Great food and atmosphere. Relaxed! <br><br>Try the biscuits and gravy with a sunny side egg", "pics": null}}, {"review": {"des": "Came here with a group of friends for brunch. I was excited to try this place with all the amazing reviews, but my experience was a bit underwelming. <br><br>I didn't really find any of the food we ordered outstanding and the drinks we ordered were just OK. The space itself though is very cozy and well decorated which I liked.<br><br>The brunch wasn't all that impressing, but perhaps I'll stop again for lunch or dinner next time instead.", "pics": null}}, {"review": {"des": "I love Longman & Eagle so hard! Whenever I visit Chicago, it's a must stop. The food is creative, well thought out and delicious. The drinks are hellllaaaaa good with a really fun selection, and the staff is SO NICE. We always sit at the bar and the bartenders are always smiling, and happy to give suggestions. <br><br>The first time I visited Longman & Eagle, my super drunk friend called to inform me that she was going to meet me there. I was still sober, so I was self conscious that she would be super loud. My nerdy ass felt the need to warn the bartender that was being so super nice (Miguel) that my wasted friend was coming in. He laughed and said we've all been there, and that's what they were there for! I immediately decided that Miguel is my new best friend, even though he has no idea. lol. My friend came with her boyfriend and we stayed for a long time, and had a blast. I think we had a cheese platter that time, and my sister's friend had an amazing burger. <br><br>The last time I visited we went for brunch, and shared the Cesar salad (such a unique presentation) and soft shell crab with a poached egg and Hollandaise sauce on it. SOOOOOO GOOOOOD. Longman & Eagle does nothing but YAAAASSSSS in my book, and there will never be a visit to Chicago that doesn't include them on my itinerary. I love you guys!", "pics": null}}, {"review": {"des": "Drinks menu is fun and unique. We all ordered the Rollo de Guava - it was quite good; sweet but not too sweet.<br><br>The menu is really exciting but the portions are small. I think the prices are reasonable for the quality but this is maybe not a place to go with the intention of stuffing your face. ^_^ <br><br>We had the broiled oysters, ahi tuna tartare, the tortellini, and the butter-poached cod. The oysters were good but I couldn't help but feel that the sauce was overpowering. On the other hand, the other dishes we got seemed under-seasoned to me. Maybe my taste buds are just shot, but I could have done with just a small hit of salt.<br><br>All in all, a good dining experience. I'd say it's a great place for a date, but I wouldn't come with a large group. You may fight over who gets one of 4 tortellinis.", "pics": null}}, {"review": {"des": "Dopest appetizers...great vibes.  Back patio area is awesome.  Great location.<br><br>Street parking.<br>Decent prices.<br>Real down-to-earth people.", "pics": null}}, {"review": {"des": "Two of my good friends from DC absolutely LOVE Longman & Eagle, at least for their whiskey offerings the last time we came. This most recent journey took us to their brunch menu and I have to say I am very impressed with the quality and feel from both bites to booze.<br><br>First off, they were busy as heck on a Sunday morning. We decided to head to the back of the restaurant where they have an open bar area for you to relax, grab a drink, and perhaps indulge in these AMAZING donuts while waiting for your table. We got some drinks and shared their Mint Chocolate Donut and it was incredible! Creamy mint baked right into the middle... mmm.<br><br>Once we were seated outside for brunch, we went straight for the food and drinks. I ordered the Duck Confit ($16) which was a little bit on the smaller side, but something about the egg whites blew me away. I had never tasted egg whites so good in my life! Combine that with some well-done duck and you've got a great dish.<br><br>My friends opted for the Wild Boar Burger and the Chicken & Waffles, both of which were excellent in their own right. Both of those dishes were bigger as well so if you are a hungry bruncher, consider getting those!<br><br>Our waiter really took care of us this time around too. During our meal, there were a few yellow jackets swarming around, and he did his best to deter and fend off the buzzers as they tried to get to our food. It was very much appreciated. He also offered my friend another full shot of whiskey after his original order ran short. Great service!<br><br>My friend also got their souvenir cup which he loves to show off in the office. If you're a mug collector, he definitely recommends you snag one up before leaving!<br><br>Longman & Eagle certainly impressed and I am definitely looking forward to coming back again.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/qUZBVroKSTw5-ut4rWT4Ow/348s.jpg", "caption": "Wild Boar Burger"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/f1Q4RjOUPZtjus3sfgmjjw/168s.jpg", "caption": "Duck Confit ($16) - Bit on the smaller side but delicious"}]}}, {"review": {"des": "Five stars for the food!  Nothing more to say. <br><br>It's truly a five star food in an extremely casual environment. Service is good but the food ROCKS!<br>Presented like you would expect in the highest priced restaurants in the world.   WOW!<br><br>And if you like Bourbon give them a try because there are hundreds to chose from.  <br><br>Love it!", "pics": null}}, {"review": {"des": "I was a little skeptical before coming here. Even though I heard good things about this restaurant, lots of recent review said they experienced declining food and serving experience here. BUT I actually LOVED this place! Def one of my favorite restaurant in Chitown. <br>Cocktail: Their cocktails were ok tbh. The taste of liquor is too strong. We ordered next stop saturn, and the special drink comes in their customized L&E mug (something tasted banana-ish, don't remember the name tho). I mean, the description of the cocktails were fun and loved the rose water taste in the next stop saturn, but they need to fine-tune the ratio of the ingredients to make them meet the tastebuds sweet point. <br>Food: AMAZING!!!! We started with Beef fat fries (perfect cut and perfect texture, fry sauce taste amazing, tasted like aioli, but on the sweeter end); loved the falafel scotch egg! the liquid-ish yolk combined well with the crispy falafel shell on the outside, served on top of a cucumber tahina salad.<br>Highly recommend duck breast!! it was medium well, but still super flavorful/juicy/and tender. it came with matzo ball and soup jus, loved it!!!!<br>I will gave the lamb rib a 7/10. not that much meat on it, kinda dry ,but loved the sweetness of meat's marinate sauce. <br>we had strawberry shortcake with bubblegum ice cream for dessert. its super sweet, like super super sweet, but I enjoyed the bubble gum flavor. it's well displayed. though the portion was kinda tiny. <br><br>service: good<br><br>atmosphere: cozy small dining place with 15 ish table. they don't take reservations. but it was not busy on weekday nights. we didn't wait before being seated (they will only seat you when the whole party is there tho, so plan accordingly).", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Bvju_fDJleWmm2iN0_FhGA/348s.jpg", "caption": "Next stop saturn"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/pp4pNHQ0xlkIKamLM304HQ/168s.jpg", "caption": "Duck breast!!!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/UkfKrdPmg3qpmPxxNg9U5A/168s.jpg", "caption": "L&E mug"}]}}, {"review": {"des": "So this place is meh....<br><br>The 3 stars go to the bar staff they are great! Like the crafted cocktails and their service all just made you want to drink just a little bit more, alas our table was ready so we had to depart.<br><br>We went here on a Saturday for brunch and as you can imagine it was packed and we did have a little wait. They will not seat your table if everyone is not present so remember that before you stroll in. Luckily like I said before the bar staff is great at what they do so the wait isn't that bad.<br><br>I ordered the Shank Frites, Au Poivre, Truffle, Roasted Broccoli & Cauliflower, Pickled Shallots, Scrambled Eggs and Anson Mills Grits, Widmer's Cheddar, Bacon. This is where the issue is. My shank frites were so salty it was almost uneditable. What was the salty part was the sauce everything was glazed in. It was so bad that I left most of the frites in the bowel. Then on the reverse, the grits were thick and so unseasoned. The bacon on top was good however you would spend about half your meal trying to season the grits with salt.<br><br>I would urge you to STAY AWAY from the grits. Then when we were wrapping up the guy behind us had the fun moment when his chair broke under him throwing him to the ground and in a crowded place hitting me. It was awful. <br><br>I sampled my friends Chicken & Waffles and Sunnyside Duck Egg Hash and Duck Confit. They both were bland.<br><br>I cannot see this as a Michelin Star restaurant. Maybe if they give stars for the drinks but, meh.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/dtucVRtrd4ANp_pRX559gg/348s.jpg", "caption": "Shank Frites, Au Poivre, Truffle, Roasted Broccoli & Cauliflower, Pickled Shallots"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/1x5ml6-Qvu1t-SVMo7pflQ/168s.jpg", "caption": "DONT GET: Anson Mills Grits, Widmer’s Cheddar, Bacon"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/_nLeBxHn72LqlFdbkaYbhA/168s.jpg", "caption": "Fried Chicken, Waffles, Sweet Potato & Pork Belly Hash, Maple Syrup"}]}}, {"review": {"des": "Really hit or miss. Came by for brunch this past weekend with my boyfriend. We both ordered the French toast. When it came out, it was plated nicely, but it appeared that all the powdered sugar was coated to cover the burnt pieces of my meal!! My meal was brunt and I just stopped eating it because all my toast tasted like was burnt bread. My boyfriend's toast was fine however. We both agreed that the French toast was waaaaayyyy too salty as well.", "pics": null}}, {"review": {"des": "Went 4 months ago with some local friends. It was delicious and very reminiscent of the interesting taste profiles in some of the New York and French restaurants we had been to. Very impressed. There was a lamb stomach dish that was to die for.<br><br>Went yesterday with a friend visiting from NY. The chef has changed recently in the past 2 months. It was not the same. Diced tuna and cantaloupe with cucumber powder, horseradish overpowered carpaccio, dill forward burrata, short rib without any fat or tenderness. It was a huge disappointment. Like any art, I'm interested in seeing the basics done extraordinarily well and then from there playfulness and experimentation. Someone tell me where I can find food done simply and really well in Chicago please?", "pics": null}}, {"review": {"des": "I've been meaning to get to Longman & Eagle for a long time and finally did this past weekend. My husband and I stopped in around 9 on a Friday night and it was busy, about a 45 minute wait for 2. Luckily, a couple spots at the bar opened up and we were able to sit pretty quickly. The ambiance is dark and nice, a great place to grab a cocktail. I had the old fashioned to start and he got the sazerac. Both were delicious and flavorful. <br><br>We started with the cool ranch beef rinds because, come on, cool ranch. They were good and tasted just like the Dorito version. I got the burger and he got the sloppy joe. The burger was cooked perfectly and came with lots of fries. It had great flavor and was a pretty great burger. Note that the cheddar is more of a gooey beer cheese than regular cheddar, so you will likely be a mess after eating it. My husband was just OK on his sloppy joe. It was fine, but he said it wasn't really special. <br><br>The standout of our visit were the bartenders. Everyone was so friendly and helpful. They were extremely attentive and it felt more like a neighborhood bar where they know you rather than a very busy place with tons of patrons. I'd definitely come back.", "pics": null}}, {"review": {"des": "We chose Longman & Eagle for dinner on a Sunday evening before going to a concert and had an enjoyable meal.<br><br>The location is easy to get to, whether you're driving or taking public transportation, and you can't miss it just off THE Logan Square (Park). The outside is well taken care of and they even have outdoor seating for nice days. Inside has a regular-sized bar and plenty of seating both up front and in the back. Behind the bar you'll notice one thing... whiskey. And lots of it.<br><br>In fact, that's what brought us here: a recommendation from a friend who knows I enjoy whiskey. Well, let me tell you, the recommendation was spot on because they have a GREAT selection of practically everything. Not only do they have whiskeys but they have house cocktails, they have flights, and they even have a good selection of assorted beers.<br><br>As for the menu and the food, it is interesting. Not realizing until we had ordered, L&E is Michelin star-rated (one) - impressive! Now, the menu is small but it covers some interesting bases. The thing that immediately jumped out to me was the Sloppy Joe. It was... interesting. A bit different but not at all bad. I believe this was the first time I've had sage (leaves) on something and it threw me off a bit. However, the sandwich and the fries together were a great combo. We also started with the pretzel that came with a mustard butter that was delicious!<br><br>Prices and about what you'd expect from a finer establishment such as this. But they are by no means outrageous. Even the liquor seemed to be reasonably priced. <br><br>Well, one thing that jumped out to me, being a Blanton's man, is what they were charging for \"Blanton's Black\"... it is pretty steep. I somewhat get it, given that it is technically an import (from Japan) but it's only 80 proof... Anyway, the fact that they had it at all was still pretty cool. That being said, they did pick their own barrel of several of the bourbons and have them available to drink and buy by the bottle - pretty cool! I had the L&E Blanton's as part of my flight and it was very, very smooth and tasty.<br><br>Anyway, the prices are what you'd expect, the service was fine, the food was interestingly tasty, and the liquor selection was outstanding. This is a solid spot that I'd return to again (for drinks) in the future.", "pics": null}}, {"review": {"des": "Best restaurant in Logan Square hands down. $3 shot list. And when I say list it is a list. Lots of good bourbon if that is your thing. <br><br>Everything on the menu is good, new, and trendy. There is always going to be something creative on the menu that your going to say \"hmmm I wonder why no one has ever come up with that before\".", "pics": null}}, {"review": {"des": "I really don't see what the hype is over this place. A group of us came out for brunch to celebrate a friend's birthday. It's a Michelin Guide restaurant for one. I mean, you must try it then, right! One of our friends had been there before and said it was really good. Sold, we'll go. <br><br>Due to everyone not being present, we couldn't be seated. Hey, makes sense to us so there was no problem with that. Our party slowly trickled in and the hostess had no problem telling us we still had to wait until everyone was present. Hey, we get it. No problem. <br><br>The decor is dark and provides a chill atmosphere. The wooden ceilings were original and made you curious about how it came together. The different sizes and thickness of the wood in the ceilings catches your eye. I loved it. The ambiance made you want to relax and have a good conversation with your friends. <br><br>To kill time we sat at the bar. Service was excellent. I couldn't decide on a cocktail because there was so much to choose from. Several bartenders checked on me. Which you can appreciate the attentiveness. As our party arrived, the bartenders also greeted them quickly. <br><br>We waited an hour or so before we got seated. No problem. It gets really crowded really quickly. We sat towards the back, which wasn't bad because it was so cold that day. <br><br>Our meal...meh. I sampled everyone's food, except the burger. Our friends who had been there before said Longman and Eagle had fallen off since they were last there. Couldn't have been the same place. <br><br>The coffee, wow. It's something with a striking taste. Strong. <br><br>Chicken and waffles. I didn't particularly care for it. Way more chicken than waffle. The waffle was too small to really enjoy with the 2 pieces of chicken so you had to be careful with the pieces of waffle you cut. You'll run out of waffle and still have chicken. Plenty of it. I'm used to getting white meat with my chicken and waffles but at Longman, you get 2 pieces of dark meat. Not my fave. Dark meat is juicier than white meat but I don't think it accompanies the syrup on a waffle well. The chicken was crispy and fried well, but I thought it was pretty bland. The sweet potato and pork belly hash were okay. Some of the potatoes were undercooked. I didn't like the balance of the dish with the salty pork belly...and I love pork belly. I mean, who doesn't. <br><br>Duck egg hash. Pretty good, however the portion was very small. None of us expected that. The vinaigrette was pretty good. <br><br>Shank frites. Huge portion, however it was too salty. Way too salty. <br><br>The burger. The comments were meh...but again, I didn't try it. However, the fries were good. <br><br>The grits. Bland. One person who ordered them, sent them back. Our waitress acted so surprised when my friend told her she didn't like them. I mean hey, at $6 a bowl, if you don't like it, it needs to be known. Another person looked for anything on the table to give them some umph. She settled for hot sauce. I'm used to grits having some texture and these were toooooo creamy. Definitely not a southern grit like I'm used too. Then again, I'm not sure if that's what they were going for. We all said those couldn't have been grits. <br><br>After the meal, a couple of us didn't feel so good. We figured maybe it was the coffee. <br><br>I don't think I have to go back to Longman. I don't really want to try anything else.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/7EljCgZOf1_qxoWz9g7IFA/348s.jpg", "caption": "Burger and plenty of tasty fries"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/9Dg_G2pi4jhdU5FB_tAAFQ/168s.jpg", "caption": "Grits...bland"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/1f33dhowQmgVjrkXtml7lw/168s.jpg", "caption": "Duck egg hash"}]}}, {"review": {"des": "I wasn't really a fan of this place especially after the hype and the wait.  The decor was pretty drab, I really didn't like the burger, my wife wasn't a fan of the burrito, the grits were good but lukewarm.  I wouldn't bother going back.", "pics": null}}, {"review": {"des": "The food: 3/5. I've been to Longman&Eagle several times over the last 4 years and the last few times were a let down. This most recent time I tried steak tartare (delicious), gnocchi (not good) and skate wing (decent). <br><br>The service: 4/5. The bartenders are generally friendly. <br><br>Overall: 3.5/5. Good, not great.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/0DFsoEKKLFTwWoVs4TSzyg/348s.jpg", "caption": "Beef tartare"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/NIXLkMlwqGg8csj5HrrNGg/168s.jpg", "caption": "Gnocchi"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/h0vi6TXoUnaBPeRz_67bQA/168s.jpg", "caption": "Skate wing"}]}}, {"review": {"des": "Pros:<br>1 Michelin star<br>Very affordable for Michelin star restaurant<br>Plenty of seating<br>Bar while waiting for table<br>Extensive alcohol menu<br><br>Cons:<br>No reservations<br>Fries' taste became old after awhile<br><br>Recs:<br>Share dishes<br>Country pate<br>    Great value<br>Duck breast<br>   Well-cooked, good texture, great sauce<br>Duck egg dessert<br>   Unique", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/VlppoGSza1yl-8_tJNwddw/348s.jpg", "caption": "Duck egg dessert"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/TE3g7ALmgUC4BASNS0_akA/168s.jpg", "caption": "Duck breast"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/1TG8hL1bYrNluWvwgumbag/168s.jpg", "caption": "Country pate"}]}}, {"review": {"des": "One of my new favorite restaurants despite the fact that I didn't like my main course.<br><br>Crazy, right? But I loved the place. It's Michelin-star quality, without being stuffy. The vibe is relaxed and sort of rustic. The beef fat fries were amazing 5/5. Bone marrow is to die for 5/5! I did not like the Pork jowl because it was too fatty for me. It was a poor choice on my part, but I could see how other people would like it. I also got at old fashioned which was god damn perfect 5/5.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/rv_IYGljPhSutaZs8LLFmw/348s.jpg", "caption": "Pork jowl"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/8Yp5Kkg_-BPPGWHAu1G-Sw/168s.jpg", "caption": "Country style tables"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Zb6YbYVeKaY8zqjYu07pgA/168s.jpg", "caption": "Bone marrow"}]}}, {"review": {"des": "They do not take reservations and they also will not seat you until your entire party has arrived. We arrived as a party of 4 on a Wednesday evening and it was fairly crowded, but still ample seating. We were seated in the bar area but preferred to sit in the area near the restroom, but we were given a BS excuse from the floor mgr on why he chose to seat us in the bar area. It seemed to me that he was holding those tables for people to include a family with a child...so it seemed a little fishy to me especially since it's first come first serve on the seating. We were already seated by the time I realized his game and the shit won't fly the next time I dine here....if I do. The reason behind the 3 stars is for what happened to us and it has nothing to do with the food which was extremely good...for a dive bar. <br><br>We dined on the following:<br>Sourdough pretzel....a MUST<br>Chicken liver pate....I would rather stick to an authentic French restaurant for this dish<br>Foie Gras Mousse...so delish it should be a dessert<br>Citrus cured kampachi crudo....exciting combination of flavors. One of my favorite dishes of the night<br>Beef tartare...we cleaned the plate<br>Seared duck...another favorite<br>Fried chicken and waffles....awful. If you want the best chicken and waffles in Chicago, head to Beacon Tavern<br>Roasted broccoli & cauliflower gratin...amazing<br>Confit pork jowl....just straight up fat...eww<br>We were agitated they had already run out of the striped bass at 7:00pm.<br><br>For desserts we had: <br>Chcolate mousse cake....yummy<br>Brown butter cheesecake....equally delish<br>Chocolate and earl grey creme brûlée....the BEST creme brûlée I have ever had!!! It was simply fantastic!<br><br>I was very impressed with the beautiful presentations of all of the dishes.", "pics": null}}, {"review": {"des": "Delicious, solid food. Good drinks. Definitely glad it was a few blocks from our airbnb. <br><br>The first afternoon we stopped for drinks in the back bar. A cool spot, laid back, perfect for our arrival. <br><br>The last day of our trip we got there for breakfast, only waited about twenty minutes, with luggage, and had a nice breakfast.<br><br>We had a hard time slimming down our options and settling on four dishes. The pork belly benedict was awesome, and the homemade pork sausage was delicious. <br><br>Really, nothing was bad in any way. <br><br>Suggest making it a stop on your visit...", "pics": null}}, {"review": {"des": "Came here for a date night on a Friday night. The restaurant was packed. We didn't have a reservation but were able to immediately seat ourselves at the bar which offered full service. <br><br>It's a comfortably tight restaurant. It's dim, but has a lot of noise and activity going on that disqualifies it from being intimate.<br><br>The menu is rather unique.<br><br>Here's the food breakdown:<br>Foie Gras Mousse, waffle crust, marion blackberry jam, spiced maple syrup: There was soooo many different flavors in those couple of bites, but it was indescribably delicious. I really wanted to lick the plate of this one. <br><br>Slagel Bone Marrow with scallion chimichurri, bacon jam, toasted sourdough: The two different sauces tasted great with the bread alone. Which can be both good and bad. I would have liked more of the bone marrow. I appreciate that the bread was toasted but still had a soft chewiness to it. <br><br>Beef fat fries: Huge portion. Pretty good for fries. I wish they had other standard or more unique condiments for dipping. <br><br>Fried Chicken and Waffles: Normally, I would never order this, but we saw some other people order it and it looked delicious. Maybe I'm not a chicken and waffles person, but the flavors didn't really blend well together. Both the chicken and the waffles were pretty ordinary. The waffles were a bit on the soft side as well. <br><br>Wish I had chosen a different entre but I'm not mad. I thought the cocktails were average. But I would want to come back and try their breakfast menu.", "pics": null}}, {"review": {"des": "Really great food and prices for a 1* Michelin restaurant, located right by the logan square metro stop! <br>There was a mini wait but they have a bar in the back you can check out while you wait. Just put your name in the front first. <br><br>I really like the hipster, rustic vibe of this place- very casual and chill. <br><br>Everything here is pretty much on point- cannot go wrong with anything. <br><br>Beer tartare- excellent and great app to share<br>foie gras- delicious and great app to share<br><br>for my entree I got the duck- so tender and meaty- surprisingly full since they only give you two pieces but they're pretty decently sized<br><br>My friend got the half chicken - the chicken is effing delicious and melts in your mouth- it's a pretty big portion of chicken so I think this entree is really worth it<br><br>10/10 would come back <br>10/10 would come back and bring everyone I know<br><br>I don't even live in chicago, came all the way from NYC to visit!", "pics": null}}, {"review": {"des": "The food was just mediocre, definitely not worth the price. Even though it's not expensive the portions are so small that you have order a couple. <br>We had the sweet corn tortellini, wild boar sloppy joe and lambs. <br>Also the menu is really confusing, you definitely need someone to explain it to you.<br>But service was good.You can't find most of the items that people liked on the menu because the menu has changed. Looks like they have changed their chef recently so that's probably why. It's such a shame that you see all this good reviews then taste the food and get disappointed.", "pics": null}}, {"review": {"des": "Great place to stop in for a drink. They have a very large selection of whisky and bourbon, along with other liquors and beer on tap. The \"&\" flight was a great choice. Found a new favorite bourbon!Awesome atmosphere and staff. Didn't get any food but it smelled amazing.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ZM91s2iwoN9yjvqwdQFlQw/348s.jpg", "caption": "The \"&\" flight. They left the bottles for me to look at as i enjoyed drinking the flight."}]}}, {"review": {"des": "came here with a small group and ordered a bunch of things (and loads of drinks)<br>the good-<br>the baked oysters were delicious <br>the beet salad was tasty <br>the duck was INSANLY good ! highlight of the meal by far ! <br>the bad- <br>the short rib tasted and had the texture of corned beef , really sup par in my opinion.<br>the crap cakes were bland and absolutely covered in what tasted like store bought mayonnaise .<br>avoid both of these items and you'll have a fantastic meal !", "pics": null}}, {"review": {"des": "I used to live right next door to Longman & Eagle and I remember when it first opened not to mention the first time I got to try their food.  Those first few bites were jawdropping. Simply amazing.  It was also my first real taste of the Chicago culinary scene. <br><br>I moved out of Logan several years ago and haven't ventured back to Longman in nearly as many years.  I saw that Longman had recently lost their Michelin star which prompted me to visit again.<br><br>For appetizers we had the sour dough pretzel and the foie gras.  Both of which were nicely done but nothing that really pushed the envelope.<br><br>For dinner, my friend had the hamburger which I remember bitterly defending for years as one of the best burgers in the city.  It's still a good burger but with the addition of places like Au Chevel it just hasn't adapted to keep its place in that holy trinity of best burgers.<br><br>I had the chicken and waffles.  I can remember almost each bite of the chicken and waffles the first time I had it.  It was so perfectly done in my estimation all those years ago and today, while it is still good it can't live up to my memories of it, it was still nicely done.  <br><br>I don't know if Longman & Eagle -really- deserve 4 stars or if it is my nostalgia for my first years in Chicago that keep me from giving it three but I am going to let my heart win this one.", "pics": null}}, {"review": {"des": "Stopped by on a Sunday afternoon to grab a drink with our friend before her flight, the environment is so chill and nice- our bartender Ben was attentive and informative. Will definitely be back, it was a good experience!", "pics": null}}, {"review": {"des": "It boggles my mind that Longman has been around for just over 8 years, and my last review was 8 years ago, but its been a lovely gustatory union and I've never looked back.<br><br>Some may say that the sheen has worn off, what with the Michelin stars falling away over the past year, but my last visit here, a mere week ago, tells me that the magic lives on.<br><br>We arrived on a Friday evening and the two of us were seated promptly in the back room.  Our server was a kindred soul, for she too loved Old World funky wine, and she kept everything on schedule.<br><br>Same as it ever was, the cocktails were superb and the food was amazing.  The beef tartare with foie gras torchon was savory and impeccable.  Their seared duck breast continues to be a show stopper - savor it rare.  The steak was similarly meaty.<br><br>They recently added a Chocolate Mousse Cake for dessert and you really must prepare a pilgrimage to obtain it as soon as possible.  It is amazing and hearkens back to the heyday of Jeremy's work here.<br><br>Perhaps the saying is true<br>When the marshmallow man is away<br>The locals come out to play<br>I'll be playing, why don't you?", "pics": null}}, {"review": {"des": "I went here for dessert date. <br><br>The pastry chef is AMAZING!!  We had 2 desserts <br>The Bee Pollen Sunflower cake and The Cherry Sorbet w/ Pistachio Mousse, Let me tell you how flavorful both desserts were...<br><br>The bee pollen with the sunflower was so darn good. The cake was moist and the lemon jumped from the plate to my mouth.  It was by far my favorite dessert I've had in a very long time, if not ever! <br><br>That pistachio mousse OMG!!! So damn good. <br><br>The flavor combinations was like no other. <br><br>The new pastry chef is definitely on his way to being one of the best in the business, if he keeps this up. <br><br>I will definitely be back. <br><br>They also make the best Moscow mules!", "pics": null}}, {"review": {"des": "It took a while to write this review, so it won't be as detailed as I would like. But I can say that my stop at Longman & Eagle was well worth it, it's so far my favorite restaurant in Chicago (not saying too much, but)<br><br>I stopped on the way downtown from Ohare. The restaurant isn't huge - it is unassuming from the outside, dark inside, with a bar taking up one side and the kitchen beside it towards the back. There was a wait for a table, but I was by myself so I grabbed a seat at the bar without waiting.<br><br>Again, can't remember specifics, but I thought each dish I ordered was well thought out, balanced in flavor and texture, with lots of interesting notes that made me want to try the entire menu. I started with the foie gras mousse, which was decadent and delicious. Second course was the steak tartare, which my server recommended. It did not disappoint, there were so many flavors and textures on this plate, each bite was different and so good. I finished with the steak, served with bone marrow gnudi, sunchokes, hen of the woods mushrooms, etc. Again, so many flavors and textures, great entree size, every bite delicious.<br><br>The service was attentive and knowledgeable, everything came out on time, portion sizes were on point, and I left full and happy. Will make this a stop every time I travel to Chicago.", "pics": null}}, {"review": {"des": "Writing a review from our July 2018 stay at the L&E rooms above the restaurant/ bar as well as a brief note on our dinner. Hotel stay was 5/5 and dinner experience was 4/5. <br><br>Stayed in room #43 for three nights. The rooms is 152 sq. ft. but uses the space in clever ways (e.g., joint shower/ toilet enclosure). The room really impresses with the thoughtful details and the art. There is a tape-player with curated tapes provided, which I listened to while getting ready for the day. The honor bar had movie-theater candies, toiletries, and other treats and beverages that are hard to pass up. Bed was super comfy (full-sized) and the toiletries provided in the room are Aesop brand, which is fancy, high-quality stuff apparently and much appreciated! <br><br>Noise level is an important detail to consider before staying here. The first night of our stay was uncharacteristically noisy (apparently was industry night in the bar on Monday night and the patrons' revelry included belting out TLC's \"Waterfalls\" amongst other hits until early AM). Noise levels from passing cars and low-level chatter from the patio guests was otherwise completely unremarkable for the rest of our stay. Of note, L&E goes out of their way on their website to caution light sleepers about noise levels, but they do thoughtfully provide ear-plugs in the room. <br><br>Had cocktails, dinner and dessert on the last night of our stay. <br>Falafel scotch egg was delicious. The burrata, tomato, black eyed bean dish was a bit salty for my taste. Wild boar sloppy joe was exceptional. <br>Bee pollen cream and sunflower cake was probably my favorite item of the entire meal. Any lovers of dessert will be impressed by this creative and delicious cake. <br><br>Overall, loved staying at L&E! I loved the thoughtful details and appreciated the excellent service from staff.", "pics": null}}, {"review": {"des": "The wait on a busy Friday night for 2 was 10 mins and it looked packed so that was a plus. Service was good. I didn't like the seating arrangement because our table was an inch away from the next table so it was like we were sitting with this random pair. That sucks for a misanthrope. The food was eh. The blue crab salad was eh, scotch egg, I like Owen and engines better but the cucumber tahini it came with was good. The sea bass eh, the pork blade was like half fat so it sucked. The off menu complimentary  in house coffee gummi bear was pretty good. They need to sell that...Overall, this place was eh...", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/U1OIRcd4-lJdUY_1Rc73og/168s.jpg", "caption": "Sea bass...eh"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/otXFkOzzZr1qN-NyyVyLpg/168s.jpg", "caption": "Fatty pork blade"}]}}, {"review": {"des": "Great food and amazing whiskey!  This spot was recommended to us by a bar tender as we were doing some craft brew sampling in the neighborhood and so glad that we took his advice.  Two things that I am a sucker for, beef marrow and whiskey, soon as I heard those words I was in.  We had some phenomenal dishes and I was able to do a really splendid Bourbon tasting that even included a L&E exclusive which made it even more worth it.", "pics": null}}, {"review": {"des": "The days of sitting at the bar with a wild boar sloppy joe and $3 whiskey shots are over; not that those things aren't available anymore, but the food is certainly not worth the price. Apparently there's a new chef, fine, but I couldn't begin to explain the complete breakdown in the quality and consistency of the food! This used to be my \"let's go out to eat and sit at the bar\" staple, now it's only good for drinks -- this should be obvious though as the bar staff (amazing!) has barely rolled over since I started frequenting here in 2015 but the floor staff is a constant parade of new people in and out. <br><br>Grab a beer and a shot at OSB and a donut on a nice day, or sit at the bar and get a negroni but skip the food all together. There's no food worth spending money on here anymore, unfortunately. Hopefully this will turn around, but only time will tell.", "pics": null}}, {"review": {"des": "This place used to be quite good, but it's clear why they've lost their Michelin Star. My wife and I decided to head over to Longman & Eagle on a Sunday evening for a quick bit. We sat at the table for over 20 minutes before anyone came over to even ask about our order.<br><br>Let me state that, again. It was a Sunday night, the place was not even a quarter full, and we had to wait 20 minutes.<br><br>We ended up just walking out.<br><br>WTF, Longman?", "pics": null}}, {"review": {"des": "Delicious! I had the burger and my boyfriend had the short rib and they were both insanely yummy. Prices are about what you would expect for the level of cuisine. Cute restaurant in a trendy neighborhood and a ton of $3 whiskey shot options", "pics": null}}, {"review": {"des": "Came here for lunch and drinks.  Sat at the bar, good service.  Enjoyed the cocktails, which had a broad selection.  Also broad selection of spirits.  I got the burger with a fried egg, which was nice and juicy, and thin cut fries.   Recommended by two friends and didn't disappoint.  I'll have to come back the next time I visit to try more dishes, probably for dinner service!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Mk8IFD-lbACK9lLUqx826g/168s.jpg", "caption": "Nice selection of cocktails. Classics and new stuff"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/RqzxG3ADhgJxXGjF4hrm8Q/168s.jpg", "caption": "The burger"}]}}, {"review": {"des": "Extensive whiskey menu! I got a highball on tap. They chill Jim Beam whiskey (now owned by Suntory, so I assume it's Influenced by Japanese highballs, which I love). It's carbonated immensely. It was refreshing but almost too fizzy. At $6, it was totally decent.<br><br>Husband got the Longman Manhattan, made with Russell's Reserve L&E Barrel Select. Very nice.<br><br>We tried the meatballs with polenta and smoked potato. This was glorious. The potato must be mixed with creamy polenta and whipped. So light and the tomato sauce mixed in was perfect.<br><br>Also got the bone marrow, which I usually adore, but this one was a little under. I'm not squeamish about bloody bits, but I think it could have used a few more minutes of cooking. The flavor was ok, the scallion chimichurri was nice, but I wasn't into the sweeter topping. It was too rich for my husband so I ended up eating the rest, and it sat heavily. Not the best way to end an otherwise good snack and booze.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/CecsA43QKLWkiICW1YbKOw/348s.jpg", "caption": "Bone marrow"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/usmFIVHTxNZmQkf5cKtVqQ/168s.jpg", "caption": "Meatballs with polenta and smoked potato, delicious and fluffy!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Zx-V0ICVkMWfaN2sNfZSVw/168s.jpg", "caption": "Food menu"}]}}, {"review": {"des": "Honestly brunch here was worth going back, just not the best I've ever had. My friends and I brunch nearly every weekend, and when we are on vacation it's no exception. Luckily we found a place that did weekday brunch (we were visiting Chicago during the week) and happened upon Longman and eagle. My hash was just not good, I think I ordered the wrong thing because my friends all got tastier dishes, but my dish was overly sauced and not in a good way, the frites were soggy and the sauce was just kind of an odd choice for the overall flavor of the dish. <br><br>The coffee was delicious, the drinks were worth ordering a second or third, and the patio seating was a wonderful setting coming from a sweltering Texas summer, even In direct sun it was still breezy and comfortable.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/nOgLIwDhqUuwqRuqTyAYeg/348s.jpg", "caption": "Dranksss"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ttxIm0nmcKIUKIXSwQESoQ/168s.jpg", "caption": "Chicken and waffles"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/auLtA7M0THDER3lLGPjrng/168s.jpg", "caption": "Steak frites hash"}]}}, {"review": {"des": "I've been to L&E for the adult Easter egg hunt and had a great time.  The food was the street fare so I hadn't had the regular brunch menu.  Yesterday on News Day we stopped for brunch and I give it a thumbs up.  The bloody was perfect.  I had the cauliflower dish and was super impressed.  The people I were with had the boar sloppy joe and the duck confit.  I already knew I'd be back for Easter but after yesterday there's a big possibility I'll be back sooner.", "pics": null}}, {"review": {"des": "I might need to try other offerings here for lunch or dinner, didn't feel the brunch lived up to the hype.<br><br>- The French toast sounds amazing on paper, what we got was dry ass french toast with a lack of any sauce or topping to fix it. There was a brittle that came with it that was so hard my wife couldn't bite through it. The dish comes with a few ridiculous small amount of smears on the plate to dress it up that are barely useable, but in the end it feels just like dry ass bread that's doing too much.<br><br>- The eggs benedict was pretty good, it's more of a different take on the dish that I felt added their style and had a good amount of layers to it. When we heard it could come with greens we were excited (thinking of delicious stewed collards or something of that nature), what the \"greens\" are is a small pile of bland ass lettuce.<br><br>- Shrimp n Grits had a nice sauce, only three shrimp which I felt was kinda small for the price paid, and the other parts of the dish were okay.<br><br>- Their grits were pretty creamy and had some nice flavor. It's a decent size enough for sharing.<br><br>I feel they tried to add multiple layers to each dish and put some good effort into making it something different than you would get elsewhere. It was so so for me overall after paying $50. I do want to come back and try lunch or dinner.", "pics": null}}, {"review": {"des": "So this is my new favorite restaurant of all time.  A Michelin Star chef for $$ value.  Come with friends and share a bunch of different plates. The teas are loose leaf and they have old style beer on tap! Everything was amazing but I especially recommend the vegan cashew dessert - it had the most amazing vegan chocolate I've ever had in my life.  I will definitely come back. Wow so yummy!", "pics": null}}, {"review": {"des": "Great coffee! Duck hash was unique but not my favorite. I didn't think it was possible but they overdid the Black Truffle Vinaigrette. Dish also could have used a little more potato or a small piece of toast or something. The French toast was awesome if you are in mood for sweet versus savory.  Wait staff was friendly. Cool vibe.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/3DVxiaB0BXcspkX0DLCq2Q/168s.jpg", "caption": "Duck hash"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/6FGDR5vAcMgojJqPxsrWkg/168s.jpg", "caption": "French toast"}]}}, {"review": {"des": "Eat. Sleep. Whiskey. Oh, yes.<br>I'm a sucker for a great breakfast meal, Longman & Eagle had a bit to choose from on their rotating menu. They say good things are worth the wait.... While my group waited, I asked to see a menu. Unprompted, the host informs me that they are \"waiting on a group to finish and our table will be ready shortly after.\" <br>Over    o n e   h o u r   l a t e r, we were seated in the second room. I'm not sure why he said anything at all...<br>As soon as we were seated we ordered grits, shank frites, chicken & waffles, and my delectable pork belly benedict. <br>In the back, there's another bar in a room with natural light, picnic tables, and treats. <br>The guy behind the counter asked me what would I like, and if I wanted to try the donuts.<br>\"You had me at \"donuts\". Donuts came, coffee came, food came....you get where this is going. <br>So, long story short- we waited longer than Longman, but the coffee+donuts, and food was worth it.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/z4H5cq1aD4j-bQ7fcTSDBg/348s.jpg", "caption": "Shank frites"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/RVrmf0AaZ5gD3kEYN_ESRw/168s.jpg", "caption": "Pork belly Benedict"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/5clWTuGZjX7G72EbyfquYw/168s.jpg", "caption": "Chicken and waffles"}]}}, {"review": {"des": "Came here for brunch on a Sunday morning at 10:30, the wait was only 25 minutes. The space inside is tiny with just a few tables, but they have a few outdoor spaces. We were seated outdoors at the patio, it is a sunny day and not too hot, really enjoyed the ambiance.<br><br>The chicken waffle is pretty good, the chicken is crispy on the outside and tender inside, the waffle is so so, the sweet potato cubes are great too.<br>The Benedict is pretty good too, liked the sausage in there.<br>We also got the grits with bacon as a side, quite tasty and filling.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/_8ngpmXcc-4PZZ7vslIM1A/168s.jpg", "caption": "Chicken waffle"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/uYDo0yvwqhinJboM5UIgWQ/168s.jpg", "caption": "Benedict and grit as side"}]}}, {"review": {"des": "Longman has really gone downhill over the years.  The place used to be buzzing, but now the portions are incredibly small.<br><br>We got a few orders:<br><br>1) Avocado - Literally 1/2 an avocado + sauce (2/10)<br>2) Octopus - about the size of 4 quarters - a joke (2/10)<br>3) Caesar Salad - we were told \"Best they've ever had\" - basic salad.... 3/10<br>4) Lamb Ribs - solid dish, but very, very small (6/10)<br><br>All this for $70 - we had to eat when we got home - all these dishes came highly recommended by our waiter.<br><br>Won't be going back", "pics": null}}, {"review": {"des": "If I could give no stars I would. I came for dinner last night and was seriously disappointed in the food. Like in actual disbelief this place has multiple gears awarded Michelin star. I heard after the fact the chef left. I feel almost like I had food poisoning i was sick after eating there. <br>I am a foodie and love these type places! The atmosphere reminded me of cute places in my neighborhood in Brooklyn and drinks were okay. Food was disgusting. <br>We ordered 3 appetizers and 2 entrees. The tuna with cucumber was so strange. Tiny diced tuna and melon with huge slices of cucumber and then cucumber powder on top which was very strange texture. Beef tartar was drenched in buttermilk. The scotch egg was the only okay dish it was actually pretty good. For dinner we had dry beef short rib and has to send it back. The other entree was a burrata bean succotash which would have been awesome but there was like three table spoons of dill in the dish which was the only thing you could taste. Dill was not mentioned as an ingredient and does not go with the other ingredients. When I asked the server about the overwhelming dill taste I was told to mix it in and it would be better. It was not better. We could not eat it. <br>Again severely disappointed paying 200 for such gross food. A lot of it the flavor profiles would have worked in theory but execution and portions of strange ingredients totally ruined it. <br>So disappointed.", "pics": null}}, {"review": {"des": "So Longman got a new Executive Chef and boy, am I disappointed.  I love this place, truly, but my last visit was just so off.  Longman has always been my partner and i's go to spot when we can't decide on what to do, and we're both pretty bummed about the menu switch. <br><br>We understand that with the chef change dishes will come and go, but holy cow everything we had was under seasoned, covered in jus, and small.  The octopus left a lot to be desired with little seasoning and a lotttt of sauce, however, presentation was lovely. Now the pork steak was honestly a large thin steak with the veggies laying on top and can you guess what else? Yep, covered in more jus. Chicken ballotine was my favorite dish, but I wasn't a fan of the soggy collard greens that were drenched in JUS.  I wish that every dish wasn't just a pile of meat and then a ton of sauce. Longman is better than this. <br><br>I will say that the apple pie chocolate bar was pretty delicious. So hats off to your dessert chef for saving the meal!<br><br>Our drinks were good as always and the server was nice and knowledgeable. My partner is having a breakdown though because he lost his favorite spot. :(", "pics": null}}, {"review": {"des": "Great space and environment.  Not too loud.  Liked the lighting and all of the wood.<br><br>The food:<br><br>- The cheese board was solid.  Really enjoyed the honeycomb and mustard<br>- The beef tartare was very good.  The various sauces and the tiny pickles really brought out the flavor of the beef<br>- The strip steak was tender and perfectly cooked (as it should be when you use a sous vide).  I liked the sauces.  The only quibble I have is that it was a strip steak and it was missing that strip steak beefiness.  It was a little weird<br>- For dessert, I had the peanut butter ice cream.  It was awesome.  <br><br>Service was good.  A little slow at times, but good.  Also, I don't need my water filled up every two minutes.  That was odd.<br><br>That being said, I will definitely be back.", "pics": null}}, {"review": {"des": "I recently came here for dinner solo which ended up having its pros and cons.  Pro: It was easier to get a seat at the bar.  Con: I could only try so many dishes.  Before I start on the food it's worth mentioning that you can get a pour of whiskey for just $3 and there's a list of at least 20 to choose from - that's quite a deal!  For my main I ordered the lamb belly ($18) and it was delicious!  Formed in a spiral and pan seared, it was a creative and beautiful dish.  The portion was rather small though, so I also ordered the chocolate mousse+cake+whiskey ice cream.  It was Death By Chocolate.  Enormous, very decadent, and filled me up, but I could do without chocolate for a week afterwards.  I actually sort of regretted not trying the more intriguing sounding strawberry+bubblegum, marscapone, and cotton candy dessert instead.  Lesson learned - next time return with more people in order to experience more of L&E's creative menu!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Ai-D0jlFu1cykkrb8tAw8Q/348s.jpg", "caption": "Part of their cocktail list, April 2018"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/EYcSIj9mU0PbsHSigsltSg/168s.jpg", "caption": "Lamb belly"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/03LSFmQDQQMg6r6a0PhHPA/168s.jpg", "caption": "Chocolate mouse + chocolate cake + whiskey ice cream.  Clearly a humongous portion!"}]}}, {"review": {"des": "Never have I ever had a duck confit hash adorned with fried, sunny-side-up duck eggs before, and never have I tasted something quite this savory and delicious. <br><br>Before I delve more into the dining details, I'll start with the beginning of this Sunday brunch while visiting Chicago. Beware: they don't take reservations, but we were happy to oblige and wait at the bar with drink in hand. Even better - they have two bars for hungry patrons anxiously awaiting a bite of their delicious menu. We found two bar stools with our names on them and bellied up to bar. Given it was Sunday brunch hour, I went for the Bloody Mary, and it was good. Like, real good. Perfect spice level (As a Texas native, I giggle whenever a beer back is served to quell the spice level). Perfect consistency. Perfect alcohol ratio. I was feeling good leading into Brunch and it certainly made the wait time feel like nothing. <br><br>It was crowded in the dining area, but the service was fast and efficient, probably why the wait was nothing to sweat about. The Brunch menu might be small, but it's powerful. You always know it's a solid menu when they don't try to overwhelm or distract you with too many options. Essentially - every choice you go with will be good, so you don't need too much. Brevity is beautiful.<br><br>So, I landed on the aforementioned Sunnyside Duck Egg Hash with Duck Confit, Shallots, Yukon Gold Potato, and Black Truffle Vinaigrette. It was robust meal with a lot of flavor profiles, but surprisingly simply made with only a few major key ingredients. It came together so nicely with each flavor completing one another instead overpowering the dish. I had a taste of my friends' burger and chicken and waffles, and I can't decide which dish I was most envious of as the burger was juicy and full of flavor, but that waffle...that waffle. And THEN came the bread to soak my egg yolk in. Damn. Though I didn't use the bread for that purpose, because my overzealous inhaling of my hash left nothing for me to sop up with the bread, I was able to have a piece of their bread with their house made preserves and a whipped butter spread. Yea, if anything - I would go back for that. <br><br>As you can tell, I like this place. I. like. it. a. lot. And encourage anyone visiting living or visiting the Windy City to take the chance to dine there. Or stay there! It's a B&B, too!", "pics": null}}, {"review": {"des": "I could keep this review short and say about two words to make sure I come back...amazing bourbon!<br><br>Bourbon and whiskey is what this place is all about, and they do it better than anyone!  76 Jack, no problem, shot of Four Roses reserve, no problem, Pappy...if you can afford it, no problem.  The list goes on and on and on.<br><br>Couple the selection of bourbon with a decent set of beer taps from local crafts, to a great gastropub menu of delicious food, set in an old building feel with a bar as the focal point, then add in some of the coolest bartenders around - that really know their stuff, and you get Longman and Eagle.<br><br>We did several flights and enjoyed a few tasty morsels, and mainly just had fun!  Another super cool feature is the L stop right across the street so no worries about driving anywhere!!  Enjoy!", "pics": null}}, {"review": {"des": "Honest review: not coming anymore to inconsistent. this is my third time coming here this time for brunch n the other for a late meal at 12 am. There was an issue for brunch . We showed up at 2 because there was no parking so it took forever. When we go there we waited no problem what nobody told us is the kitchen is closing at 3 pm. The service was really awkward she was nice but kept disappearing for a really long time. We finally ate n i was still hungry but waiter dissapered again. So we asked the bus boy n she got the waiter she told us kitchen was closed why didnt u tell us that when we got there so we could order more food?? After this she left why didnt she give us the bill so we can pay n leave we literally waited 30 minutes like she kept leaving for a long time i was really mad. Since the kitchen was closing at 3 i feel the service and the food was lacking which is really disappointing.  So the third time i came was at 12 atmosphere was weird the employees were to busy talking to each other so service sucked this restaurant is not consistent at all if u come at certain times food n service will suck because of this i like duseks alot better cant recommend anything because my favorite things arent on the menu bring back the fried chicken roulade plz the burger is really good though i think hipsters ruined the restaurant like all the employees n chefs are hipsters n all they wanna do is fuck around with there coworkers <br><br>$14 Fried chicken and waffles: (to get best flavor pour syrup over chicken and hash) the chicken is really moist you cant find chicken this tender anywhere else. The skin is crispy without being greasy. The actual chicken by itself is flavorful but tastes better with all the other condiments on the plate. The hash i loved the combination of the sweet element if the sweet potato n the salty flavor of the pork belly. The flaws with the sweet potato were some of them hard so undercooked. Then i like my potatoes in a hash to be really crunchy n they werent. The waffle was kind of lacking it was way to soft and to small. The maple syrup with everything was perfect. Since we arrived late on brunch cause their was no parking i feel the food was lacking because everybody was rushing to finish.<br><br>Wild boar sloppy joe: surprising delicious. If u wanna relive ur childhood memories of sloppy joe youll love this gormea grownup version. The bun is home made and toasted thank you jesus nothing worse then an un toasted bun. The bun was so crispy a much needed texture for sloppy joe since the bun always falls apart not in this instance cause it's crispy! The fried sage didnt have a purpose whatsoever i tasted it by itself and it didnt taste like anything at all. Then theres fried onions omg so delicious it needs the extra crispy texture. The pickled jalapeño was just a whole one i wish it was cut into slices instead its hard to eat it like that. The actual sloppy joe was really flavorful and tender. Really was tasty. The fries i didnt like they didnt taste good n were to small. This dish needed some pop a wow factor to make it delicious  This was good but i feel they have better dishes here so i wouldnt order again they have better dishes<br><br>Potted Foie 19$ the foie part was really good it was really decadent with the bacon gel i wish the baguette was buttered n grilled it was just put in the oven theres a salad with veggies n bacon i didnt like it wasn't flavorful n bacon was old n hard the plum sauce was to acidic foie needs sweetness <br><br>Duck breast $25 the duck was cooked correctly the skin was soggy the sauce was bland i liked the fennel salad cut through the richness of the dish my favorite part of the dish is this duck skin chip thats so tasty thats what makes the dish<br><br>Pork jowl $23 didnt like this the jowl was extremely fatty n its a very beet forward dish love beets but there was way to much earthy flavors <br><br>Burger 16$ amaizin cheese n bacon was so good patty was so flavorful the spicy brown mustard added heat to cut through the richness bring aioli instead of ketchup. The fries were amaizjn jus cut them bigger so there not overcooked n another issue was the patty was supper tiny n the bun was huge fix that<br><br>Icebox cake$8 didnt like this its way to hard n to sweet basically its just a frozen birthcake sandwhich<br><br>Coffee pot de creme $10 amaizin the donuts were supper light n fluffy the creme was supper creamy loved the creme fresh to cut through the richness only complaint add more to cut through the sweetness", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/vjqf_AQ4mlGSnrl6pe3fIw/348s.jpg", "caption": "White chocolate ice box (icecream sandwhich) 8$ not good to hard n to sweet n tasted like a birthday cake"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/T9dM1_pxAjzeO3ej82y_IA/168s.jpg", "caption": "Bill"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/5pD8Fzar1j34Euuc6qR2SQ/168s.jpg", "caption": "Coffee pot de creme $10 good but to sweet"}]}}, {"review": {"des": "I got there at 2:30pm and the ambience was not welcoming at all. The hostess never showed up and The bartender looked at me like i was from mars. I asked for a table for 4 and he never got back to me as to whether there was a table available. The place was more empty than crowded and then he comes (bartender) back and tells me that the kitchen closes in 30 mins. At this point i was ready to walk out but i felt i should make he person in charge aware of what was happening. So I meet the chef Maxwell who was very welcoming, understanding and practically saved the day. The food was amazing (see pictures attached). I recommend the food. Customer service needs a brush.", "pics": null}}, {"review": {"des": "I have a conflicted relationship with restaurants like these.  On one hand, they provide a unique, flavorful dining experience.  On the other hand, they kind of make vegetarians and non-meat eaters in general feel like an afterthought, which is kind of surprising considering that it's in Logan Square.  It's also part of that \"Brooklyn, hipster aesthetic\" dining scene considering the employees and ambience - I don't have a problem with this at all, but it stops feeling unique after awhile.<br><br>Longman & Eagle specializes in whiskey cocktails which are strong and tasty.  My favorite is the Sazerac and I am not even a whiskey drinker but they make it perfectly.  Every cocktail I have had there has been strong, intense, and flavorful.  They don't use sugar to make their their drinks taste good, these are real cocktails!<br><br>The hostess was nice along with the server.  Our server was professional and serious, which fits this type of restaurant well.  They were also great about refilling water.  I like how the ambience and how dimly lit this place is but it's not overly dim to the point where you can't see who you're dining with.<br><br>This place is expensive since it's mainly smaller plates but their smaller plates options looked decent.  I ended up eating a lot of cauliflower because I barely had any options.  They gave us a complimentary tasting of their cream of mushroom soup.  It was really great and I wanted more of it.  I don't like most cream of mushroom soups because it gets to heavy, but there was a perfect balance of cream and mushroom flavor.  It tasted very fresh.  <br><br>We split the broccoli and cauliflower gratin small plate (which was a pretty big plate with a generous portion).  It was really delicious.  It had crunchy, cracker crumbs on there over the softly baked broccoli and cauliflower gratin with raclette cheese.  I've been seeing raclette cheese on more and more menus and I am happy to see that it's making a comeback.  The raclette gave the dish a nice, pungent cheese flavor to the more earthy flavors of the broccoli and cauliflower.  It's also served in an appetizing skillet.  <br><br>For the larger plates, I only had one option of what I could eat: the cauliflower, lentils, and curry dish.  It tasted wonderful.  I am always a little suspect of hipster places making Indian cuisine as someone who is half-Indian but it was done very well.  The cauliflower was crunchy, drizzled with a bit of raita (I am not into yogurt so I was happy to see that it wasn't an overwhelming flavor), and seasoned very well with the curry spices.  It was served over a bed of lentils that were also very flavorful.  The mango and mint weren't very intense flavors much to my liking, they just gave it a nice aftertaste.  I think after awhile I got tired of eating the cauliflower because there was just a lot of cauliflower and a little lentils.  I probably would have liked this dish more if they had more lentils and it was about half cauliflower/half lentils instead of mainly cauliflowers and a little of the lentils.  It was still amazing to eat though.  My dining companion had the duck and loved it so the dining experience was a delicious one overall.<br><br>It was just disappointing that there was only one real vegetarian large plate on the menu (no pescatarian large plates).  Considering how pricy this place is, I'll probably eat at more vegetarian/pescatarian friendly restaurants when I am in the mood to splurge on a fancy, gourmet meal.  <br><br>If you love meat though, this is your place!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/BRSOLsxobnjNdcW8_QOe9w/168s.jpg", "caption": "Broccoli/cauliflower au gratin"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/oDe1QP0z18mPOi2a9xh7Ww/168s.jpg", "caption": "Cauliflower with curry and lentils."}]}}, {"review": {"des": "Sit at the bar and meet Alan. He will answer your questions and offer suggestions that proves he knows EXACTLY what he is talking about. This is not just a good place to visit when you are in Chicago, this is a reason to visit Chicago.", "pics": null}}, {"review": {"des": "Excellent cocktails here and an extensive whiskey list if that's your kind of thing. Shots and flights of Pappy available. Bloody Mary had excellent flavor. I've had both brunch and dinner here before and have never had something I didn't like. The dishes are unique but executed very well. I will come back, again and again.", "pics": null}}, {"review": {"des": "Came here for the first time this morning and had an awesome brunch. I got the biscuit & gravy with sunny side eggs, he got the chicken & waffles w/pork belly hash and a side of the cheddar bacon grits.<br><br>Biscuit & gravy had great flavor and the biscuit was dense but flaky. He liked his chicken and waffles, but some of the pork belly hash was a bit undercooked. The cheddar and bacon grits were amazing.<br><br>I also really loved the look/feel of this place - it was quite busy but easy to get a table luckily.  Service was excellent and overall we were happy with our experience. Definitely will be back!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/D-fw-_ESLsxqsXQBG8IdqQ/168s.jpg", "caption": "Fried Chicken & Waffles, Sweet Potato & Pork Belly Hash, Maple Syrup"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/w8rUMz9uG3r20XJmr4hzsg/168s.jpg", "caption": "Biscuit & Gravy with Sunnyside eggs"}]}}, {"review": {"des": "This place used to be fantastic. Not so anymore. The last time I went, I ordered a sloppy joe and my friend order a curried cauliflower dish. Both were severely underwhelming. The sloppy joe was far from \"sloppy\" and didn't taste anything close to what I had remembered from before. It was a bit dry and lacking in flavor. My friend's cauliflower dish was not seasoned well and didn't taste much like curry or anything really. From what the waitress told us, it seems they have a new chef now, and they're in the process of changing the menu. Hopefully, the new items are better executed than what we had. We came here with high expectations because of prior experience and left harshly disappointed.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/t1w1GFSVLESvqsX0kxvt-g/168s.jpg", "caption": "Sloppy joe"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/vCqR08z-UeIyvD-R6YvoBQ/168s.jpg", "caption": "Curried cauliflower"}]}}, {"review": {"des": "Dropped by for an early breakfast and to check out how natural lighting pours into an otherwise dark rustic pub. Waiter service was great and friendly. Foot traffic is to a minimum in the morning as the rest of Logan Square slowly awakes.<br><br>For breakfast, the pork belly benedict and beef shank au poivre were excellent choices.<br><br>Pork belly benedict. A crispy slice of ramen grade pork belly on top a toasted biscuit  embellished with a handful of carrot shreds, bacon bits and poached egg. Paired with a side of salad greens = excellence.<br><br>Beef shank au poivre. Both taste profile and presentation are a work of art. I especially liked the hints of peppercorn and truffle.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/dL2eCiaR5BIlAZ0EJUWVaQ/168s.jpg", "caption": "Virgin Mary."}]}}, {"review": {"des": "Great atmosphere, unique menu, and a huge liquor selection.  Their Bloody Mary's are spicy and delicious- perfect for a Sunday Brunch.  The wait time to be seated wasn't long considering it was in the middle of the week and not that typical busy weekend.   Definitely a good spot right off the Logan Square Blue Line so give this place a visit- It will be time well spent.", "pics": null}}, {"review": {"des": "Longman & Eagle sits on a trendy corner in Logan Square. The part whisky tavern and restaurant has a gorgeous bar at the front of the house. The dinner setting is very dark and intimate -a perfect place to impress your date or a few close friends. If you want a less intimate setting, be sure to check out their casual, laid-back bar called Off Site Bar. OSB is located at the back of the restaurant. I would say a few summer nights have been spent there with friends this year. <br><br>A couple things: <br><br>1. Prepare for a wait because L&E is always jammed pack with people on weekends. I recommend adding yourself on the waitlist and making your way to OSB until your table is ready. <br><br>2. The staff here are some of the friendliest yet most-professional hipsters you'll ever dine with. I love their enthusiasm for the menu. They seem well-informed with the menu and ready to give their recommendations. <br><br>3. My favorite is the Slow-Roasted Cauliflower and Lentil Curry dish. The flavor combination is perfection. The subtle Indian spice on the Cauliflower is balanced nicely with the tangy raita. I've order this dish multiple times in the past, and the dish never disappoints.  <br><br>4. You can't leave the restaurant without trying one of their uniquely-crafted cocktails or their impressive whiskey list. The pours are pretty generous-I don't mind that. :)<br><br>I will admit that I had a few misses on dishes but some great dishes make me come back for more. Their menu always have creative intent and stay true to integrity of the ingredients displayed. I'm always a fan and highly recommend trying out one of Logan Square's precious gems.", "pics": null}}, {"review": {"des": "The best biscuits and gravy and elotes Benedict and French toast and whiskey. The best biscuits and gravy and elotes Benedict and French toast and whiskey. The best biscuits and gravy and elotes Benedict and French toast and whiskey.", "pics": null}}, {"review": {"des": "Came here for their whiskey drinks and let me tell you... they are amazing and the bar tender has the best service.  <br><br>We came here on Labor Day weekend so the restaurant was busier and wanted to grab drinks.  The back patio was completely packed so we came back to the front and saw that the bar seating was available.  This was great as there was more selection of drinks.  <br><br>Pricing for drinks was average I think we ordered about 12 drinks and total came out to be around $132.  We tried a lot of their drinks and they were all great.   If you love whiskey this is the place to go.", "pics": null}}, {"review": {"des": "Visited this cozy restaurant with two friends last night and really enjoyed the entire experience. <br><br>In regard to the atmosphere, this place has a very warm and homey vibe, largely due to the extreme low lighting, of which I personally am a big fan. When you walk in there's dining tables and the bar, and beyond that are additional rooms with more tables for dining. <br><br>We were seated within moments and our server was friendly and quick to assist us with any questions we had. I ordered a beer, but they have an incredibly extensive whiskey menu, so if you are a whiskey fan this is definitely a place for you to check out. We ordered and before any of our items came out our waiter brought us over samplers of the butternut squash soup, compliments of the chef, which was delicious. As a table we decided to share the sourdough pretzel, which came with a yummy buttery mustard spread. <br><br>One friend ordered the burger and enjoyed it, although she did say that it wasn't the best burger on the city. My other friend went with two small plates--the meatballs and wax beans. The meatballs were especially delicious because they were drenched in a creamy sauce of some sort. <br><br>I had the sloppy joe, and while it was good, it was not really what I expected. It seemed more like a corned beef hash sandwich to me. The sloppy joe and burger came with immense amounts of fries--I don't know how anyone could ever finish them all. <br><br>Overall, this was a pleasant dining experience and seems like the perfect place to hole up in on a wintry Chicago night.", "pics": null}}, {"review": {"des": "My friend and I went here for dinner a few weeks back on a Tuesday night. We both expected a line at the door, but we were able to be seated right away with the option of indoor and outdoor seating. Neither of us had ever been here before, so we were both pretty excited!<br><br>To start, we ordered the \"Roasted Broccoli & Cauliflower Gratin, Raclette, Cracker Crumbs.\" This was soo tasty - it was basically veggie mac and cheese. Highly recommend! We then split the \"Slagel Burger, Widmers Cheddar, Bacon, Beef Fat Fries\" and \"Fried Chicken & Waffle, Sweet Potato & Pork Belly Hash, Maple Syrup\" The burger was very simple, no complicated flavors. It tasted just like beef, if that makes sense. The chicken and waffles was not good. The waffle tasted like yeast, and the chicken had no taste. I was really surprised by this item, since this restaurant gets such rave reviews. Overall, I'm really glad we were able to try this place, but I'm not sure I'll be heading back any time soon. On a positive note, the service was excellent!", "pics": null}}, {"review": {"des": "Easily one of the best whiskey bars I've ever been too. Fantastic selection of all sorts, and great whiskey flights as well. The staff is extremely knowledgeable and friendly. Their food is fantastic: your classic dishes with an elevated touch of quality and finesse. Highly recommend.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/0SgAoXxkvFkONwGezOGkjA/168s.jpg", "caption": "And how did YOU spend your Sunday morning?"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/5zDOER4lfZ7g4mv615lkUA/168s.jpg", "caption": "Breakfast. Superior sourdough toast, flavorful sausage, PERFECTLY cooked and seasoned potatoes, warm and fluffy eggs"}]}}, {"review": {"des": "Came on recommendation from a friend. Dimly lit, rich wood interior with a cozy hipster feel. When we were seated (no wait on a Thursday at 6, party of 2), I was very pleased to be asked if there were any dietary considerations as well as asked if I needed a vegetarian menu. Why yes, as a matter of fact, I do! It was nice not to have to ask.<br><br>The menu isn't very organized, it was hard to discern what was an appetizer or small plate and what was meant to be an entree. Our server helped with that. We decided on:<br><br>Broccoli and cauliflower gratin: baked in a shallow 5-6\" diameter iron skillet, and copiously topped with bread crumbs. Vegetarian and very filling thanks to cream and butter. Not mind blowing but definitely filling and very good. <br><br>Bone marrow: two huge succulent bones that my hubs loved. CAme with flattened halves of sourdough buttered cheese toast, like grilled cheese bread. The toast was delicious, we asked for more and thankfully got a small, fresh, hot refill!<br><br>Beans and bacon: bathed in a rich gravy and topped with nuts and a cream finish. Not too salty and great bacon flavor. <br><br>Carpaccio: husband had this, it was good but not remarkable. He didn't say why.<br><br>We also got a nice surprise of an amuse bouche of sweet potato soup (veg version for me) that was a nice, seasonal, and slightly sweet way to get ready to eat.<br><br>Service was friendly with our waters always refilled but not too frequently. Portions were huge, we left stuffed after sharing these 4 appetizers with no room for dessert. Husband also loves the whisky offerings... even poured a st George variety we can't get back home altho we live close to the distillery. Check also totaled a respectable $100 (half the bill was alcohol(.<br><br>Overall: good, not mind blowing but definite a solid experience!", "pics": null}}, {"review": {"des": "After reading up on the reviews and hearing praise directly from a friend, alas, I finally get to try the place.  <br><br>Longman &  Eagle is the girl/guy that you want to love,  but only end up liking...as a good friend.   <br><br>Lucky for us,  there was only a 5min wait for a table of 3 on a Tuesday night. I have tried coming here before only to find out a 2hr wait on a Thursday night, so this was a pleasant surprise regardless.  <br><br>Drinks: The Great Pretender cocktail was excellent.  Smooth and refreshing without having that cheap sweet taste to it.  Would definitely get it again.  <br>Cocktail selection is excellent,  draft beer selection leaves a little more to be desired as there was only 1 Stout available.  <br><br>Food: hits with some misses. I do applaud some of the creativity. Small plates sharing style with seasonal ingredients so menu changes regularly.  Basically half their menu is appetizer portion while the other half is entree sized.  The server will most likely tell you where the cut off is in sizes.  I would recommend for the not completely starving omnivore to order 1 app + 1 entree per person. So for 3 people (1 starving,  2 hungry but not famished), we ordered 3 apps and 3 entrees.  Disclaimer: I had 3/4 of an au cheval burger 3hrs before this dinner though.  <br><br>This bite-sized starter that was scallop? topped with garnish on a piece of toast.  Delicious! My favorite bite of the night! And guess what? It was on the house ^_^<br>Foie Gras torchon - very buttery, but bland flavor. We all agreed that we did not like the garnish with it.  Too much of some kind of spice (clove?) that some bites were unpleasant. Wouldn't order again unless you're massively craving foie gras. <br>Apple walnut endive salad - wonderful presentation, pretty classic, prepped with 2 types of apples (one freshly sliced and another prepped),  I would pass on this next time even though I love apple walnut salad - this was a miss <br>Hamachi crudo - good,  more on the citrusy side, not as good as Girl and the Goat<br><br>Slagel Burger (comes with beef fat fries) - good - my friend scarfed down every single bite<br>Scallops - 4 large seared with marrow, mushrooms and cauliflower, delicious <br>Gnocchi - cooked wonderfully,  and I always love the sight of a one hour egg's yellow glutinous contents being split open in a dish, if you're a fan of gnocchi, order it! <br><br>Bottom line: come here if you're in the neighborhood and there's not a long wait, otherwise, you'll feel like you were stood up on a date.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/_FuDzPzVZSIo9rzQuUqOQQ/348s.jpg", "caption": "Gnocchi - good"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/8RCXtpaVoCyPKqPo-017Lg/168s.jpg", "caption": "Seared scallops with marrow, cauliflower, and mushroom"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/goRmjroEay3lGBomsqLQBg/168s.jpg", "caption": "Foie Gras torchon - meh"}]}}, {"review": {"des": "This place was super chill...hung out on the patio with my family and our puppies!<br>Apps were really tasty.....but you could tell they had a pastry Chef... Because the desserts are awesome..not to be missed!!!!!", "pics": null}}, {"review": {"des": "A Chicago staple. I know of few other places in the city where you can grab a $2 PBR or a $200 whisky on the same night. <br><br>The fries here are the best in the city. See you soon L&E!", "pics": null}}]}