{"name": "lotus-cafe-and-b%C3%A1nh-m%C3%AC-sandwiches-chicago-3", "reviews": [{"review": {"des": "This place was very good. I didn't bother looking for a better Banh Mi in the area. This place hit the spot. We went back again while in town. <br><br>They have a great selection of sides and teas and all of that. It's a very attractive atmosphere with a modern feel to it. They are doing things well.<br><br>I've got to say though, when I'm looking for a Vietnamese sandwich shop, it's all about the Banh Mi. That is what gives this the 5 stars. The rest is fantastic but had this been a dive with that same sandwich, I'd still be happy with the place. <br><br>These guys get it. If you are going to serve Banh Mi, serve a great Banh Mi or don't bother.", "pics": null}}, {"review": {"des": "I've heard about this spot for quite some time now. Checked Lotus Cafe out during lunch and I left the restaurant thoroughly pleased.<br><br>I like the modern-hip look for the interior and I like how they have their sriracha bottles as their decor! <br><br>I had originally wanted one of their sandwiches, but I haven't had pho in a long time and I've been craving a soup of a sort lately so I went with a pork pho.<br><br>I totally forgot how big pho bowls are, and it was some solid pho! The broth was quite rich, the meat was well cooked and the veggies and the broth complemented each other very well. I like some heat, so I poured some sriracha and it hit the spot.<br><br>Also, Vietnamese coffee is where it's at! It's very strong, but I LOVE strong coffee. The cream used in the coffee wasn't extremely sweet which I like, so I was pleased by the coffee.<br><br>Can't wait to come back and try a sandwich next time :D", "pics": null}}, {"review": {"des": "By far the best Banh mi sandwiches in the area! My boyfriend and I are pretty much regulars here. We always order the honey grilled pork Bánh Mí sandwich and it is absolutely fantastic. The meat has a fantastic seasoning and it is topped with julienned cucumbers and pickled daikon and cilantro. They also include jalepeños for an extra kick of flavor. We also love ordering their spring rolls the shrimp and vegetable rolls come in 4 and 6 piece and the sauce that is served is my absolute favorite and best that I have had with any spring roll. It is a sweet peanut sauce but what I love the most is how light it is. Definitely not too viscous like I have had at many other places. Their chicken wings are also really good. Always served hot with plenty of sauce so it's never dry. The chicken comes in 3 different spice levels mild, medium and hot. This most recent visit we ordered the shrimp spring rolls and honey grilled pork Bánh mi sandwiches all of which were fantastic. Always great service and welcoming atmosphere. The staff is always on time with the orders never had to wait more than the estimated wait time. Very well run establishment! I usually do carry out but there I are tables to dine in. There is no parking directly on Maxwell but you can park on Halsted and it's a pretty short walk. Overall very great cafe, great staff, and most importantly phenomenal food! Will definitely recommend anyone to try this place out and will definitely continue to be a regular here. <br><br>UPDATE:<br>I have been reluctant to write this amendment to my first fantastic review of this place. Lately it seems as though their service has gone way downhill. From what I remember everyone was always made fresh and I'm learning that much of their items are pre-prepared for the entire day. On 2 occasions I ordered their beef noodle salad and explicitly asked for no jalapeño peppers. On both occasions there were jalapeños present! The first time the juice from the jalapeño had seeped all the way through the salad and covered everything. It was so spicy I couldn't even eat the food. I let it go and saw it as a slip however now that this has happened I see no other explanation other than lack of attention to orders and poor service and care for customers! I ordered today and asked for no jalapeños and found at least 5 slices on top. Evidence of no effort of even checking the order to make sure it was correct. Please hire some people who will be more cognizant of customer orders. Some of us actually care whether or not our food will burn our mouths.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/KZB1VZDD_rVKyRtHO92e8g/348s.jpg", "caption": "Explicitly asked for NO jalapeños. Just 2/5 sitting right on top of the salad. No attention to detail what so ever."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/5A6oJ8A_4XVOOPjB_BUs5Q/168s.jpg", "caption": "Honey Honey Grilled Pork Banh Mi"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/U8HPCX3uQ78voyc1M6D2Vw/168s.jpg", "caption": "Shrimp Spring Rolls 6 Pcs"}]}}, {"review": {"des": "Tucked in a little place on Maxwell Street, this is one of my favorite spots to get a quick, fresh sandwich. <br>The good is always made to order, fresh and tasty. The staff is friendly and I keep coming back. Theres  nothing really complicated about this place, but it's consistently good. I have yet to try one of their bowls but I will get to that if I ever get tired of bahn mi sandwiches.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/OzJ8ZUYs0u4Ob-i_h5tqBg/348s.jpg", "caption": "Pork bahn mi"}]}}, {"review": {"des": "My buddy Deon mentioned he's never had bánh mì so we went to the best. Deon had the ginger chicken which is grilled chicken with ginger puree, carmelized onions and soy sauce. I had the sunny-side beef with sauteed rib-eye, crisply sweet potatoes, sunny-side up egg and carmelized onions. What can I say, they're both terrific! And how often do you get to treat someone to a new dish? We'll be back!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/_q0M0pYwgn_nqErEOfoXQg/348s.jpg", "caption": "Yes! That is solid! Love the bánh mì!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/PytZ9cYEapSvysmWr-_p0Q/168s.jpg", "caption": "Diving in, how will this go?"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/GOQyiK4WAvVfcKhRbft8rQ/168s.jpg", "caption": "Deon ponders his first bánh mì"}]}}, {"review": {"des": "Lotus Cafe is nestled away on Maxwell St off Halsted. This place is like money you unexpectedly find in your pocket. A Viet spot to get banh mi sandwiches and pho in the UIC area, and I don't have to go to Argyle? Yes!!<br><br>I tried the sunny-side beef and belly classic sandwiches, and these are toasted FYI. The beef one was a cross between Vietnamese and Korean for me. The belly classic has pork belly, pork roll, and pate. Lots of pickled veg, cilantro, and jalapeño, which I love. Of course you can customize your sandwich, if you're not into some of those ingredients.<br><br>Prices are a little higher than I would normally pay, but there's some good attention paid to the ingredients. Service is friendly, and there is some room to dine in at the window (bar seating) and a few tables.<br><br>I will have to come back and try the pho!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ztgjCqMdMlUCksu1lVDYYA/168s.jpg", "caption": "Sunny Side Beef Banh Mi"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/GvnNaoNrx_89q6VjgPakXA/168s.jpg", "caption": "Belly Belly Classic Banh Mi"}]}}, {"review": {"des": "Lotus Cafe & Banh Mi is the REAL DEAL!  <br><br>It's not your traditional Vietnamese sandwich shop.  They have an interesting take on ingredients and the flavors just work very well together!<br><br>The Sunny Side Beef banh mi has a great flavor profile!  Would definitely get it again and highly recommend it.  The Honey Grilled Pork banh mi is also a terrific combination of flavors.  I recommend it as well.<br><br>A couple of negatives: prices are a bit high for a banh mi, but I suppose you're paying for the location and the creativity of the menu items.  And I could honestly do without their vietnamese coffee.  It was a bit bland.<br><br>Overall, the sandwiches made this visit wonderful and it will bring me back again when I'm in town!<br><br>****FOUR STARS****", "pics": null}}, {"review": {"des": "Frequented a few times - tried the pork belly Bánh mi, beef pho and honey grilled pho. Decent stuff if you're in a bind and conveniently located. If you're looking for really great Vietnamese, however, I'd recommend you pass here. Quick, convenient with great customer service and gets the job done, but by no means amazing. Decent pho, broth is a bit watery and a little light on the helping of meat.", "pics": null}}, {"review": {"des": "The Pho was scrum-ditily-umpscious. The broth itself was a great testament to the time and dedication that this establishment puts into each and every bowl. A generous amount of seared beef was accompanied by the soft and flavorful rice noodle that was neither to thin nor to thick, it was truly a one way stop to flavor town. The main course must of course be lead by a delightful shrimp spring rolls.  This combination of shrimp, lettuce, and noodles where perfectly paired with a caramel sauce like no other. One might even go as far as to say I was in the middle of a meadow by a pond full of shrimp in the spring. This was a life changing experience that I had the pleasure of coming across on a night such as this.<br>Great atmosphere, great food, and even greater friends...<br>It was a bit pricey compared to other places that offer the same options in cuisine but still delicious.", "pics": null}}, {"review": {"des": "I had very high expectations for this place and was really looking forward to trying it out as their flavor profile is my definition of food heaven. Unfortunately, the experience did not live to the expectations. Honey grilled pork and sunny side beef sandwiches were unmemorable. They were not bursting with flavors like I thought they would. Beef was extremely chewy and would constantly get stuck between my teeth. I really didn't enjoy my Bánh mi as much as I hoped I would. I really like my wings though, so extra star just for them. I will not be back.", "pics": null}}, {"review": {"des": "Pro: service <br>Con: food: drank a lot of water afterwards <br><br>Ate and ordered a Bánh Mì and Phó around $20 in the UIC location. I was craving Viet food so I gave this restaurant a try. <br>Parking: there is a lot on the same street and it's cheaper on weekdays compared to weekends and note the restaurant does not validate your ticket. If you want a quick lunch or dinner, then you don't need to park in the lot. <br>And for the food. I do like it really much but I drank a lot of water and was thirsty when I got back home. I didn't eat anything else but it's like water cannot stop the thirst. I may or may not come back because it is kinda like a fast restaurant and that's why it's in the UIC location. So if you live near UIC or want to check it out, you can but prepare to drink lots of water. Maybe it's me but my mom and I had the same situation.", "pics": null}}, {"review": {"des": "I almost wish I came here first and not the \"sports bar\" on the corner with Happy Hour. <br><br>\"Oh wow\"! I thought to myself, let me get something to go on a Friday night after happy hour drinks and try them out. Ordered the chicken curry with white rice and for my mom I got her the beef and rice dish. Both were amazing and beyond fresh. This is what I really wanted to expect from the spot, and I did get what I asked for. Fresh ingredients for sure, and the curry was perfectly done. The bed of rice was the right proportion and the curry chicken tasted super fresh. I wanted to try the Phó but knew that it would be way too much food and didn't want to eat it the next day. But now I kind of wish I did get it. <br><br>The tiny little restaurant just screams fresh and lets the consumer know that you will have an awesome experience at the fraction of the price you would in more hoity totty spots. Totally unexpected flavors and the staff is just sweet as pie! The funny thing is that I came on evening hours and still felt that the food was fresh. I don't know if I can explain that correctly but I will say that I've had fresh dishes and this didn't disappoint me in the least. Definitely will be back to try their sandwiches but for now, the hot dishes is the thing for me. Hmmmm, wonder if they deliver near me?", "pics": null}}, {"review": {"des": "They catered one of my events on campus and it was such a hit! <br><br>Super tasty options for all the vegan and vegetarian attendees. This is great because usually these meetings that are catered have a \"vegan/vegetarian\" option and its iceberg lettuce with tomato and carrots or pasta with bland tomato sauce. It was nice to have a really hearty and tasty option available. <br><br>The sandwiches are great to share too. if you and some friends order different ones, then it's easy to trade half sandwiches.<br><br>Order was easy to make and the delivery was great.", "pics": null}}, {"review": {"des": "Always a great experience here.  Banh Mi Sandwiches are always on point.  Try the wings as they are the best in the area.  Shrimp Spring Rolls are always fresh and tasty.", "pics": null}}, {"review": {"des": "In the mood for a hearty filling sandwich that won't weigh you down? Grab yourself a seat at Lotus Cafe and opt for the banh mi sandwiches! This place takes your traditional Vietnamese sandwich and takes simple approaches to amp up the flavor profiles. If you're in the mood of staying true to the Vietnamese roots, opt for the Belly Up banh mi. You'll get to experience the smooth pate paired up against the pork belly and chunks of pork. If you're feeling for a little extra flavor, my favorite is the honey grilled pork banh mi. The pork found between this crusty, soft baguette will have nice light charred flavors that bring a smoky element to the sandwich and a hint of lemongrass. I've also had their pho here but the true stars are the sandwiches. <br><br>Cute and convenient location! Around the corner from a bubble tea place too, to perfect your meal!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/yjJCOhqlTgChi2BWc2tM3A/348s.jpg", "caption": "Honey grilled pork banh mi. Bubble tea not from here."}]}}, {"review": {"des": "Lots of people come here during the work week and get their food to go. It's also a great place to dine in and enjoy a quick lunch by yourself or with friends. The interior is clean and charming and they have quite a few tables. Conveniently, there's also garage parking very close.<br><br>Their most popular sandwich is the beef banh mi. But I opted for the honey grilled pork sandwich, which is sure to put a smile on your face. It's served on a beautiful wooden platter, which gets style points in my book. They also sell a variety of other items, like spring rolls and pho. Lotus Cafe is a great representation of a Vietnamese-inspired sandwich shop. The sandwiches are a delicious balance of saucy, crunchy and savory. The sandwich baguette itself was just ok, I didn't feel like it was anything out of the ordinary in terms of freshness and texture. The star was the salty and sweet grilled pork, they really packed on the flavor and quantity. I actually wish they put in more fresh veggies for some extra crunch and to cut some of the fattiness of the pork. I also recommend trying their Thai iced tea, it had just the right amount of sweetness and complemented the sandwich well.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/5pN33OxVvOR01OdbkPfffw/168s.jpg", "caption": "Thai iced tea and honey grilled pork banh mi"}]}}, {"review": {"des": "I like it a lot! The sandwich is delicious and cheap! Location is nice. Well, I cannot think of a bad side of this place. I strongly recommend you drop by for a quick lunch.", "pics": null}}, {"review": {"des": "I ordered a bowl of seared beef pho, the honey grilled pork banh mi, and the chicken wings. Everything was delicious! Will definitely be ordering from here again!", "pics": null}}, {"review": {"des": "Solid place with great options for different types of Banh Mi and other alternatives! My only gripe is that it's not so easily seen from the main street. Just kidding, it's a great gem. The people who run it are nice and chill, the food is made fresh and quick. <br><br>Prices are a little steep, but I suppose for the location they're at and Chicago being what it is to rent, they have to make due somehow. I've had all their sandwiches, and they're all good.", "pics": null}}, {"review": {"des": "This is our go to spot in the neighborhood. Their chicken wings are our favorite in the city, and the sunny side up beef sandwich is my favorite, love the combination of flavors going on there. Their pho is really good too a little more simple but I've been here so many times and its ALWAYS great!", "pics": null}}, {"review": {"des": "I love the spring Rolls and the veggie avocado Bánh it was soo good my friends also loved it !!!!", "pics": null}}, {"review": {"des": "A good find. Had the beef pho which really hit the spot on a cold winter day. Def make sure to add the egg for a buck extra. I think it was lacking a bit on the beef so I would prob do double meat next time. Honey pork banh mi sandwiches was delicious! Shrimp spring rolls weren't really my thing (but spring rolls never are so take that with a grain of salt).", "pics": null}}, {"review": {"des": "Delicious sandwiches.  I love the tofu Banh mi with avocado. Consistent, reliable service and high quality and flavorful food.  They deliver in the West Loop too!", "pics": null}}, {"review": {"des": "Got their pork house salad which is actually \"bun\" something like that when I order it at other Vietnamese restaurants. It's a noodle dish with pork, egg roll, and you pour a sweet sauce over the whole thing and mix it in. It may have been the poorest quality \"bun\" I've ever had, but nonetheless, tasted okay and the meal was satisfactory. Would probably just stick with bahn mi next time. I've gotten their bahn mi at other times before and remember it to be decent, but it's a bit more expensive than the average city bahn mi.<br><br>Soy glazed wings were pretty decent. Great texture-still crispy even when smothered with sauce. <br><br>I'd still come back to this place again if I was in this area, but nothing too crazy to rave about.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/5Cx5tnzvBNPC_jPzWrvxgw/168s.jpg", "caption": "Soy glazed wings"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Wc3xrLevMiEawcDhaTmuAg/168s.jpg", "caption": "Pork salad. More like a noodle dish than salad."}]}}, {"review": {"des": "New favorite lunch spot! I actually came here twice in a week! The first time I got the pho and Banh mi combo. The Banh mi was great, chewy baguette and I loved the pork and toppings. The pho is the real star for me though and the second time I came back I just got pho. Their broth is really flavorful and I love the contrast of the noodles and crunchy toppings, they give you all the fixings, jalapeños, lime, cilantro, bean sprouts and I add sriracha. <br><br>My only suggestion is that they list recipes/ideas for sandwiches and pho bowls, both times I came in people seemed overwhelmed with totally building their entree from scratch when they walk. I personally am not that familiar with Vietnamese food and didn't know what sauces and meats went together. V", "pics": null}}, {"review": {"des": "It's good I like it I had their classic it was very tasty. I also enjoyed their Thai ice-tea very sweet and delicious. We had take-out with them it didn't take very long for them to make our sandwiches and we left to eat it at home. This place has a nice small sit down area and if you want they do Pho too. It's modern and located in University Village it fits the area and the food is not bad. My classic sandwich had the usual deli meats and pate' spread that I like on a Banh Mi sandwich. I would come back here as I do want to try their pho!", "pics": null}}, {"review": {"des": "Awesome food great price. Can't go wrong with their teas. The staff is great and parking garage right next to it", "pics": null}}, {"review": {"des": "We catered in Lotus Cafe for a work lunch.<br><br>We ordered Shrimp and Garden Springrolls and an assortment of half sandwiches (Belly Classic, Sunny-side Beef, Ginger Chicken and Veggiecado). I personally had the Sunny-side Beef with fried egg and Belly Classic. <br><br>In general, the food was good but seemed Americanized IMO. With family from Vietnam, I grew up eating all this. Lotus Cafe is Vietnamese for the younger generation or non-Asians.<br><br>If I was in the area, I would return, but hit up Uptown/Argyle if you want the real deal.", "pics": null}}, {"review": {"des": "I like this place. It's a bit different than the ones in Uptown, but it's good! Sometimes you are in the area craving for pho or Bánh mi, this is the only place", "pics": null}}, {"review": {"des": "Great alternative for Vietnamese food instead of traveling all the way up north to Argyle. We had the sunny side beef Bánh mi and the seared beef pho. Both were a good size and tasted great.", "pics": null}}, {"review": {"des": "Shocked by how amazing this small sandwich shop near UIC was. Asked the counter clerk what the most popular menu item was and went with it - and it didn't disappoint! Definitely try this place out. Next time, I'm getting the wings too!", "pics": null}}, {"review": {"des": "Exceptional!  <br><br>Delivery always takes over an hour to get to our place; I can't imagine how much better the food tastes at the restaurant when it comes right out of the kitchen.  We've ordered here around 10 times, and we're always impressed.<br><br>Favorites:<br>* Soy Glazed Wings: perfectly cooked with addicting sweet and spicy sauce<br>* Shrimp Spring Rolls: always very fresh and tasty; a classic<br>* Sunny-Side Beef Banh Mi: WOW, INCREDIBLE!  This is the best Banh Mi I've ever had in my life.  With the egg, the sweet sauce, tiny crispy sweet potato, and caramelized onions it's absolute perfection. I sometimes remove the slice of jalapeno if I don't want the kick.<br><br>Also good:<br>* Honey Grilled Pork Banh Mi<br>* Rib-Eye or Pork Noodle Salad<br>* Honey Grilled Pork Pho<br>* Ginger Chicken Pho<br>* Garden Spring Rolls<br><br>The food is outstanding, and the service is great too (on the phone).  One time they forgot our Honey Grilled Pork Pho, but the next time we ordered they more than made up for the mistake.  They seem like good people. Now we are totally addicted to this place.  It's totally worth checking this place out.  Their Sunny-Side Beef Banh Mi and Soy Glazed Wings will change your brain.", "pics": null}}, {"review": {"des": "This is a typical college town shop.  It a few block  away from China Town so it doesn't have the busy and rushing feeling like china town.  I can relax and take my time to eat.  Personally, I think the price is a little high for such a place.", "pics": null}}, {"review": {"des": "Good pho with reasonable prices makes this place worth checking out. Their menu is small, so it's easy to make a choice. <br><br>I got the honey pork pho which was really good. I would've given this place a 5 stars, but I just personally was not a huge fan of the meat. Their broth and noodles were made perfectly though, and the staff were super nice.", "pics": null}}, {"review": {"des": "My sandwich was the bomb!  Loved it....when I walked in the place smelled amazing, so I was anticipating some delicious eats.  They delivered beyond my expectations.  I had the Grilled Honey Pork Banh Mih:  sliced pork shoulder, lemongrass, honey, and garlic...Yummmmazing!  I heard someone say the shrimp spring rolls were delicious, so I will try them next time because I'm definitely going back!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/nztkD9Zw_CyANXtPsVYdgQ/348s.jpg", "caption": "Honey Grilled Pork Banh Mi"}]}}, {"review": {"des": "Their honey grilled pork sandwiches are absolutely fantastic. We loved it and the soy glazed wings. Service was very good. The place is small so be prepared to stand awhile until seats are available.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/x4Xg1bqtmMB-FA5tgaokjg/348s.jpg", "caption": "Honey grilled pork sandwich & soy glazed wings"}]}}, {"review": {"des": "Bahn me up Scottie!  If I had ever been to the jungles of Vietnam I'm sure I would have felt like I was back there.  Cool dude up front.  Very tolerant of ignorant white men trying to learn how to say hello in Vietnamese.  Also, food was awesome.", "pics": null}}, {"review": {"des": "OMG yes loved their food!! This was my first time eating Vietnamese food and surely will not be the last.  The Honey pork sandwich was just so dam delicious  and my son loved the curry  chicken. Great food and service definitely will be back soon !!!", "pics": null}}, {"review": {"des": "Met up with a few friends for lunch. Enjoyed my banh mi that I ordered. The chicken wings were really good, too. I really like this place and hope to come back! It is pretty small though, but we came during 12pm on a Tuesday and it wasn't bad,. It started getting busy at 1pm which I thought was strange. Lots of yummy selections to choose from! They have a parking garage next door so it is convenient for parking!", "pics": null}}, {"review": {"des": "The power of yelp has made me very happy today. Lotus has regained a special place in my heart as well as its rightful place back into my weekly food rotation. I don't know if it's due to not eating it for so long or what, but I think it might even be better than it was before our trial separation. <br><br>In full transparency, the owner asked me to return, as follow up to my previous negative review. Lotus has taken my comments seriously and to be honest, with a 4.5 star rating, I didn't anticipate they needed to. My interactions with Lotus has been a great example of why I write food reviews. I'm a vegetarian. I eat out all the time. It's not easy to find a solid vegetarian spot. When I do, I tend to return over and over. When I had a negative experience at Lotus I yelped about it, so other vegetarians would know as well as the owner.  I do this because if it were my business, I would want to have the feedback of a negative customer experience rather than simply having a customer stop coming back and not know why.<br><br>The owner took my Yelp review as constructive feedback.  They even followed back up with me a couple months later.  So, I gave it another shot.  I missed it.  Based on this last experience, I think it might be better than it was when I first got hooked. <br><br>The wonky ingredient proportions seems to be resolved. The Banh mi was carefully crafted and subsequently easy to eat. Each bite had equal proportions of ingredients.  The tofu is now cut thinner and fried so it's a bit crispy on the outside. To be honest, Lotus is one of the only places that is able to get me to eat tofu. The new modifications to the tofu are fantastic.  The bread was probably the best I've had. The veggies were fresh and crisp and everything was perfectly coated with their secret sauce. Not too much sauce and not too dry. All in all the veggiecado walks a fine line between feeling like a healthy sandwich yet being super craveworthy and satisfying.   <br><br>Welcome back old friend.", "pics": null}}, {"review": {"des": "I ate the food I ordered, it was edible. The restaurant featured decor, and probably seating. Humans worked there, and said words to me. I will consider consuming foodstuffs from this place again.", "pics": null}}, {"review": {"des": "So good! I was looking for a meal that would be filling but not heavy and this place was a win!<br><br>I had the tofu curry bowl and spring rolls. Damn good, nice portions, and very fresh ingredients. I had to also get some pho for later.<br><br>The pho was delicious! I got the tofu/ veggie pho, extra tasty! This was yesterday's order. Ordering again today!", "pics": null}}, {"review": {"des": "We ordered delivery and the flavors were superb! I went with the classic banh mi and got the wings. Though the wings are listed as an app, they're big enough to stand as an entree. I thought the banh mi was also a very good size and I loved the taste. My friend got a curry bowl and thought it was yummy and also a generous portion for the price. The food was warm when it arrived.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/qb6Cvdp-R2i5YDcLlD70Dw/348s.jpg", "caption": "Classic banh mi"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/eM4k7AGY02qW-JAtDlY0bQ/168s.jpg", "caption": "Curry bowl with fried egg on top"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/SE8QSk8wijB4aEBydg45kw/168s.jpg", "caption": "Spring rolls"}]}}, {"review": {"des": "The street it's on is so dang cute! The honey pork bánh mì sandwich was like heaven! It was probably the best I've ever had. Definitely will be making this spot a weekly spot!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/fGpGqbakyeaT_oOz7WvjpA/348s.jpg", "caption": "Honey grilled Honey Grilled Pork Banh Mi"}]}}, {"review": {"des": "This is the kind of place I can go to over and over again and not get sick of the food. Lotus cafe is one of my favorite places for a quick meal! So incredibly delicious and the ingredients are so fresh here. I've had 2 of their sandwiches: honey grilled pork and the veggiecado. They're both amazing, just so flavorful. I'm not vegetarian but I have friends who are. It's hard to find good vegetarian options when going out to eat but the veggiecado sandwich does not disappoint! I would love to try other items from their menu in the future. The cafe itself is clean, staff is friendly, and service is quick. Prices are very reasonable. If you haven't been, I highly recommend going. You won't regret it!", "pics": null}}, {"review": {"des": "I tried this place when it first opened and I thought it was pretty good. I had a sandwich delivered to me yesterday, and now I think this place is amazing!! <br><br>I ordered the honey pork sandwich. It's pork shoulder with all the delicious fixings. First of all, delivery was crazy fast. Food came to an odd location in a very fast timeframe. Also, the delivery guy was very courteous. The sandwich was still hot when I got it. Now, the sandwich itself was delicious. The bread was perfect and it had just the right amount of chewiness and flakiness. The sandwich was packed with meat and toppings, which really makes me happy because the first time I came here I remember being a little disappointed in the amount of meat that was in the sandwich. The toppings were delicious as well, and I love that they pile on the cilantro. Oh, and the price is so great. I think my sandwich was $6.95 before tax and tip. Such a great value! <br><br>I will definitely get sandwiches from here again. I'll definitely stop in to eat inside of the restaurant. I wish I could eat three sandwiches in one sitting!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ePjOm6A55a-edJMy4i8Sjg/348s.jpg", "caption": "Honey pork sandwich"}]}}, {"review": {"des": "Bánh mì anytime! For a quick and tasty meal, Lotus is a great spot tucked in University Village. Very low key on a Friday night. We ordered the Sunny-Side Beef Bánh mì (Sautéed beef, caramelized onion, sunny-side up egg, and crispy sweet potato fries) and the Rib-eye Pineapple Noodle Salad (Sauteed rib-eye, grilled pineapple, caramelized onions, vermicelli noodle, lettuce, pickled carrot and daikon, jalapeno and cilantro). Both very tasty with the highlight being the beef. I would definitely order the Sunny-Side on repeat. A healthy portion and great flavors supported on a nice bun. The sandwich held up well. I will likely try the Honey Grilled Pork next time. The noodle salad was also a good sized portion. Lots of ingredients to mix around and dive in. It also came with a spring roll which was a nice surprise. The service was also short and sweet. Definitely worth the venture out there.<br><br>- Smile when you order", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/YATqrRWbTCUJBVaP-xITiw/348s.jpg", "caption": "Sunny-Side Beef. Get some!"}]}}, {"review": {"des": "So I was feeling under the weather and I wanted some soup. I've been craving pho for a while now since I'm sick and tired of all the ramen I've eaten the past few years due to my bf's ramen addiction. Driving all the way up to Argyle is never an appealing option for me, so I decided to do some searching and I found out that Lotus cafe finally added pho on the menu! I first tried this place out when they originally opened to try their banh mi, but that was years ago.  We used their online ordering system for pick up and had the soy glazed wings and 2 orders of the seared beef pho. We showed up about 15 minutes later and our order was ready to go. Everything was packed nicely, but the soy glazed wings container some how opened up and gooey sauce got all over, but it's no big deal. Funny that the soup didn't spill, but the chicken wings did! The wings were good. Crispy and slathered in sweet, sticky and slightly spicy sauce. Pretty much like Korean-style wings. The pho was pretty good. The beef and noodles were packed in a bowl, the soup was in a separate container, and the bean sprouts, lime wedge, jalapeno slices and basil were packed in a ziplock bag. They also provide plenty of hoisin sauce and sriracha on the side. I loved how they included all the fixings for assembly. The broth is great and the beef was good. It wasn't as good as what you can find on Argyle, but it sure does hit the spot and it's super convenient being a mile away from me! The price is decent and the serving size is large. I even had enough leftover broth and veggies to make a small bowl of soup the next day! <br><br>I highly recommend this place for a quick pho fix in the university village/south loop area. Also, there's a 15 minute flashing light standing zone close by if you are picking up an order!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/8m0oorRnPcndUT4aO9gf_A/348s.jpg", "caption": "Soy glazed wings and 2 orders of seared beef pho to-go"}]}}, {"review": {"des": "Soooo fantastic. Food and service so good. My favorite is the veggiecado. AH-MAY-ZIIIIIING", "pics": null}}, {"review": {"des": "This place is so freaking good. My sister lives walking distance and introduced me to it, saying that she and my brother-in-law loved it. Now whenever I visit, I make it a priority to stop by before heading back home. I usually get the sunny side beef bahn-mi, which is filled with all of the usual carrots, caramelized onions, cucumber, fried sweet potato, marinated daikon, jalapeno, cilantro, and then thinly sliced seasoned beef and a sunny side egg in a perfectly crisp yet soft baguette. I have tried their pho and spring rolls as well and they are all delicious too. So, when you happen to be around UIC, stop by! It'll be worth it!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/kJ9_mcdNjG2Pf8ENvKQTkA/168s.jpg", "caption": "Sunny side beef"}]}}, {"review": {"des": "I'm not Asian, so don't take too much stock in my opinion on Asian food, but I've had a good amount of banh mi in my day. I actually kind of wish I hadn't come here - not because it's bad, but because it's amazing and I don't have anything close to being this good where I live :(<br><br>I got the honey glazed pork bahn mi. Simultaneously soft and crusty bread, delicious slightly sweet grilled pork, crunchy vegetables.. Just get it. You'll have dreams about it.", "pics": null}}, {"review": {"des": "Sandwiches are consistently delicious. Reasonaly priced. My order via Yelp is ready once I enter the restaurant for pick up.", "pics": null}}, {"review": {"des": "Best Pho around the UIC area.  These guys making eating during a gloomy or raining day enjoyable!", "pics": null}}, {"review": {"des": "Decent banh mi. The pho wasn't great and the spring rolls were mediocre. Great portions though. I'll definitely have more for the a.m.", "pics": null}}, {"review": {"des": "This is one of my favorite spots in the city. You definitely get the best bang for your buck. I've eaten here for 4 years and the quality of food has only improved! <br>Must order: Sunny side beef <br>Pho: which I was at first nervous to try but now I will always order one with my sandwiches. <br>Shrimp spring roll<br>Wings<br><br>The staff is great! They have an awesome manager whose name is Jonas who is super nice and will help you if you have any questions. Will definitely keep coming back.  I just wish there were more Lotus's in the city", "pics": null}}, {"review": {"des": "Great Bánh Mi sandwich. Got the sunny side beef with no egg (not a big fan of egg) but the sandwich was delicious. Excellent flavor in the sauce used that cut the heat from the hot peppers on the traditional Bánh Mi sandwich. Would definitely come back.", "pics": null}}, {"review": {"des": "We got a Bahn Mi, Pho, Spring Egg Rolls, Wings and Rice Dish and all of them were wonderful!  The spring rolls were SO fresh, the wings were SO tasty and the rice dish was super tasty also.  We all finished our entire meals!", "pics": null}}, {"review": {"des": "I truly love this place. I've actually only ordered for delivery, but it's one of my staples. Some of the best pho in the area, and it actually travels well by delivery. One time, when the delivery service was running late, I received a personal call from the restaurant and they actually comp'ed my meal. Aside from the delicious pho and Bánh mi, go for the spring rolls because that pineapple peanut sauce is delectable.", "pics": null}}, {"review": {"des": "First time having bahn mi sandwich, ordered a classic and a honey grilled and they were both fabulous.  The contents of the sandwiches were very fresh & flavorful.  The baguette was fresh also crunchy on the outside and soft on the inside and it made the perfect sandwich.  I was not disappointed and I will be going back very soon.  I also liked the location because I don't always want to travel all the way north to try something different.", "pics": null}}, {"review": {"des": "Xlnt AND reasonable! I was feeling a bit under the weather and wanted something to help clear my sinuses. I ordered a Bahn MI sandwich (honey glazed pork) and some ginger chicken Pho. Both were incredible and left me feeling like a new man!! I may order from here again tomorrow!", "pics": null}}, {"review": {"des": "We were looking for vegan places and they only have a bang Mi vegan (mushroom and lemongrass) and they said that the rest of the menu cannot guarantee to be fully vegan... one dish vegan is not sufficient and they should consider to add more.<br>A bit pricier compare to other similar places", "pics": null}}, {"review": {"des": "This is still my fave spot to get bahn mi sandwich. I recently came back here to try their pho (tofu) for the first time, and it was delicious! Tasted just like how it should be, but it was a pretty pricey for a bowl of pho ($9.45). The pho was served in a big portion. My only complaints are the lack of noodles and the price. I also recommend the seared beef pho. The beef was really good, and it's probably the same meat they use to make the sandwich. Only thing I didn't like was how sweet the broth tasted.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/yJs4csnGZcjPOeh0x5vcRw/348s.jpg", "caption": "Pho"}]}}, {"review": {"des": "I approve! Lotus has excellent seasoned dishes. Overall, tasty food, prefect banh mi bread, delicious pho, could use a better Vegan banh mi option, clean and cute atmosphere. Highly recommend for a Vietnamese craving without having to drive all the way to Argyle. <br><br>The Seared beef pho was very tasty! They didn't skimp out on the herbs needed in the broth. It was almost perfectly seasoned how I make mine!<br><br>Veggiecado banh mi was very filling, they sure stuffed a lot in that thing! Although it was tasty and we are very thankful for a vegetarian banh mi, we still prefer Ba Le's vegetarian sandwiches. <br><br>Lemongrass Mushroom banh mi is not worth it. Mediocre and forgettable. It's actually MORE expensive than the Veggiecado. <br><br>Classic Belly banh mi was actually really good. The pork belly was seasoned well. I do think they needed to add more of that.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/KGWYUHJyiC8DPyQMYj3Wxw/348s.jpg", "caption": "Classic Belly Banh Mi"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/5LL-CEcqi2cZH4b-Mdd1pw/168s.jpg", "caption": "Mushroom Lemongrass Banh Mi (Vegan)"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/mhV6HsGXzzIKbu1olVWiVg/168s.jpg", "caption": "Veggiecado Banh Mi (Vegetarian)"}]}}, {"review": {"des": "Tried to order via phone, but they insisted I order online. Sad, that these new joints turn everything into a non personable experience w technology.<br>Food: banh mi 3, pork too salty and the noodle salad 3, sauce was too sweet<br>Service: 3<br>Ambience: 4<br>Cleanliness: 4", "pics": null}}, {"review": {"des": "I LOVE this place. I was obsessed (and who am I kidding, still am) with their rib eye pineapple \"salad.\" It's mostly noodle, but the shredded romaine, sautéed onion, and sliced jalapeños give it salad cred. In fact, all the salads start with the same base, sweet and sour dressing, and spring roll but each protein stands on its own. Both the pork and chicken (dark meat) are winners as well.<br>Can I tempt you to start with shrimp summer rolls? Tasty peanut sauce accompany to Vietnamese classic here. The chicken wings are killer! Super moist, crispy, and covered in a sweet/spicy sauce. Although your salad will come with a fried spring roll, I recommend getting a few more to satisfy you. I find their smoothies a little icy, but I might prefer that over one that is too sweet.<br>Honestly, this place does your standard Vietnamese fare extremely well, and I will never hesitate to patronize this place.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/q9yrVjGDbPSK8JK484m3rw/168s.jpg", "caption": "Straight avocado smoothie...a little icy but so good..."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/9GiQ5TIWTrr3jTEQ5QzQMw/168s.jpg", "caption": "Really nice selection of teas and pop."}]}}, {"review": {"des": "My 400th Yelp Review Milestone, and I dedicate this to my favorite restaurant near UIC (thus far)! <br><br>Can I get a HELL YEA for Lotus being right next to where I live? Thank Buddha for this amazing place to help keep my banh mi and boba cravings in check!<br><br>Lotus serves up an amazing, modern take on banh mi. Each sandwich costs around $7 and comes with a variety of ingredients that will make you reconsider the peanut butter and jelly sandwich you brought to work.<br><br>I've ordered the Honey Grilled Pork for my first sandwich, and that was classic! The bun was nicely toasted and portions were great. Ask for extra cilantro on your sandwich! The second time I got the fried tofu banh mi, and that one was just as amazing. Large pieces of tofu with thin sweet potato fries tucked inside. I loved both of them.<br><br>They also serve up some fantastic vermicelli bowls. You select your type of noodle, sauce, meat, and condiments to create your own bowl. I must say that the chicken here is on point.<br><br>Let's not forget the quality of their boba too. Chicago seems to love fruit smoothie boba, and the ones at Lotus are all made from fresh fruit! For less than $4, I got myself a mango-avocado smoothie with boba, and I couldn't be happier! The drink was damn refreshing, and the flavors blended so well together. As for the boba pearls themselves, they weren't stale or rubbery, making it easy to drink.<br><br>So while it's not the most classic style banh mi with the pate, meats, cilantro, and veggies, it still offers a fantastic new American take on one of my favorite kinds of sandwiches out there. Lotus is definitely my go-to spot on Maxwell now, and I can't wait to try their other sandwiches very soon.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/b_yovgN2fglEpvxYCvAJNg/348s.jpg", "caption": "Sunny side beef. Still prefer classic or tofu"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/7Ioz3SGt0F0vZ6XxfTDWgw/168s.jpg", "caption": "Spring rolls, ask for more peanut sauce!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/9ToQxxHNfeeZyLh62t9Hdg/168s.jpg", "caption": "Pork house noodle"}]}}, {"review": {"des": "I visited the restaurant for the first time, cashier was rude and not patient. Food was brought up to all tables but mine. Beef Phó and Chicken phó we're okay, I probably will not be returning.", "pics": null}}, {"review": {"des": "My husband and I live in the area and enjoy ordering takeout from Lotus. It's really easy to just put the blinkers on on Maxwell run inside and come right back out. Super convenient. I also really like the way they pack the pho to go (broth, noodles, toppings all separate). The food is of a consistently high quality and we always enjoy it.", "pics": null}}, {"review": {"des": "Yum. We always get Bánh Mi here during swim meets at UIC. Good variety, friendly service, and speedy.   Last time, I ordered via the Yelp app for easy pickup and the email confirmation message back said they'd be ready in 60-75 minutes, which was way too long. Gave the restaurant a call and they said it was an error. Lunch was ready for pick-up in 15.", "pics": null}}, {"review": {"des": "I have been meaning to update my review.<br><br>Lotus Cafe offers great Viet food w/o having to venture all the way to Uptown. <br><br>Plus side is they deliver to my work in River North.  <br><br>My co worker got a noodle salad which I was quite envious of, and I ordered a classic banh mi sandwich.  <br><br>Excited to order from here again!", "pics": null}}, {"review": {"des": "This place is so so so good. Everything I've eaten here has been excellent. Food quality is consistent-- the same every time. Put this on your must eat at soon list.", "pics": null}}, {"review": {"des": "So this place blew it out of the water. I ordered through the Yelp app while I was double parked in front of the restaurant. The girl from inside came out to my truck and said Russ your food is ready and off I went:)). <br><br>As for the food, the wings were amazing and my sandwich even better. Definitely recommend this place", "pics": null}}, {"review": {"des": "This place was amazing! Recommended to me by a friend. I went for lunch and ordered the honey pork Bánh Mi and a flavored ginger ale. I have no complaints other than it's so far from me. If this place was closer, I'd be in trouble.", "pics": null}}, {"review": {"des": "BANH MI ME<br><br>Parking is always a pain in the butt around this neighborhood because of the UIC campus. We had a taste for some Vietnamese sandwiches and planned on doing carry out. When I went to drop my wife off in front, I noticed a sign that said \"Free Parking\". I was so excited about this offer that I told my wife we were dinning in today. The free parking is a nice feature and it will hopefully help all of the businesses around this area by bringing in customers. <br><br>The sandwich shop is small on the inside but very clean. I noticed some of those college students hanging around using the wifi. This isn't a Starbucks. As a business owner, it would drive me crazy with one person taking up two table spots. I'm so glad I don't have to deal with such problems. We almost fell victim to not getting a seat because there were many solo eaters surfing the internet at two top tables. While we were waiting for our food, a table in the back opened up and we jumped on it. We almost had to go back to our original plan of going with carry out sandwiches because of the lack of seats. <br><br>Prior to arriving here we made a plan. We were going to order two sandwiches and then split them. We went with the Honey Grilled Pork Banh Mi with Pork shoulder, lemongrass, honey, garlic, scallions, pickled daikon, carrots, cucumber, cilantro & jalapenos. Our second sandwich was the <br>Sunny-Side Beef Banh Mi with Sautéed beef, caramelized onion, sunny-side up egg, and crispy sweet potato fries. <br><br>Both sandwiches were really good and full of flavor. If I had the choice I would definitely order the Honey Grilled Pork Banh Mi again. The sandwich had the perfect mix of savory, sweet & spicy. I loved every single bite. I was also glad that I chose to eat this sandwich second because it was amazing. My other half sandwich was the Sunny-Side Beef Banh Mi and it was good. I wish that the beef quality was a little better. There is nothing worse then pulling out inedible fat chunks from your mouth full of food. It just makes eating a sandwich an unpleasant experience. Every sandwich bite becomes a challenge because I'm not sure what I will find in there. It's like eating a fish with bones in it. The fish is good but you eat with caution. <br><br>Would we come back here? Probably because of the close location and the free parking. If I was a college student I would definitely be in here a lot using the wifi and eating sandwiches. My only suggestion to the solo flying college students is to sit in the window counter. This way you're not taking up two seats. It's better for the business and if they close down then were are you going to get your free wifi from.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/NKIQAFWPoRoYOI62Ya0Y1Q/348s.jpg", "caption": "Front counter"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/bwRqPPoqdkJPxNISNOdIzg/168s.jpg", "caption": "Vietnamese Ketchup & Mustard...translation Spicy Sauce & Sweet Sauce."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Sfuj0jtIY5gQ2kTqf6D4fA/168s.jpg", "caption": "Storefront"}]}}, {"review": {"des": "I've been to Lotus a few times, so I finally decided to write a review. I ordered the Thai Tofu Rice Bowl this last time, and I have to say, it was amazing! The Rice bowl comes with a very generous portion size, consisting of jasmine rice, tofu curry, and the regular toppings (cilantro, pickled vegetables, etc..). The Thai curry was literally perfect; very creamy and delicious with the perfect amount of spice and flavor. The rice bowl is very comparable to Shop house, but these Lotus rice bowls are significantly better. I loved this item, and I will definitely be back for more!<br><br>One recommendation I have is to tell them to go light on the cilantro; they add a lot of cilantro to their sandwiches and rice bowls, and the cilantro taste can be a little overpowering. Also, Lotus items can be a little expensive; sandwiches run around $7, and the rice bowl cost around $10. As a whole, the portions were generous, food was awesome, but the price was a little high, leading to my rating of 4 stars!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/EXhTxVjtEup4gRDnuWdkeQ/348s.jpg", "caption": "Curry Tofu Rice Bowl To-Go. Delicious!"}]}}, {"review": {"des": "This place is so yummy! I always get the sunny side beef sandwich and it never lets me down. Also the hazelnut iced coffee is one of the best I've ever had, their coffee is so creamy! You won't be disappointed with this place! Their food is usually ready super fast too.", "pics": null}}, {"review": {"des": "If it was rating just for the food, I would give Lotus Café 5 stars.<br><br>Unfortunately I had a pretty bad experience with the delivery. My food did not arrive after waiting for almost 2 hours when I was communicated that it would arrive within 45mins - 1 hour. I had called the restaurant after the first hour had gone by and the person I spoke with shared that the food had already left the restaurant. So I waited, 50 minutes later and still nothing and without a call from the delivery person to inform me of my food's whereabouts. I ended up canceling the food order, after 2 hours of waiting and disappointment I had to go in search of food elsewhere.", "pics": null}}, {"review": {"des": "Maybe their banh mi's are better?<br>My friend and I both ordered the beef pho and were very disappointed. It was overpriced for a relatively small bowl. <br><br>There weren't many people there on a Saturday, but we still had to wait 20 minutes until our pho was ready. It came out warm, but not hot, so the bean sprouts that we threw in remained completely uncooked. We were each given a small tray of bean sprouts, jalapeno peppers, a lime wedge, and basil. It was not enough for my liking. I probably could've asked for more, but I was starving. The broth was okay, it wasn't anything special and wasn't all that flavorful. The beef was not impressive; there were only a few slices and had no variety.<br>My friend also ordered the thai iced tea and she couldn't finish it because of how sweet it was.<br><br>Overall, I wanted this to be my new go to pho place since it's close to my apartment, but I would rather make the drive to Argyle for cheaper, tastier, and more authentic pho that never fail to leave me in a happy food coma.", "pics": null}}, {"review": {"des": "Just like what people said, you gotta try it, it's the best. I always order thru yelp and pick it up, always the beef pho", "pics": null}}, {"review": {"des": "Got around to checking out the Belly Special today. Pate, cilantro, pickled diakon, pork belly and other veggies on wonderful bread. I liked this more than my previous experience; to me more exotic flavors, and tastes like it is more fatty, but definitely a fun indulgence sometimes! <br><br>I see a doctor nearby, so I know I'll be back ;)", "pics": null}}, {"review": {"des": "Fantastic Bahn Mi. The service is quick and friendly, and the cafe is casual yet presentable. The prices are little bit higher than similar restaurants, but it's still a great value. Worth it.", "pics": null}}, {"review": {"des": "Made a great decision this afternoon and came here! <br><br>My boyfriend and I ordered the Sunnyside Beef, Classic Belly banh mi, and a cold jasmine milk tea.<br><br>The Sunnyside beef was amazingly delicious! The beef was tender and flavorful. The Sunnyside egg in it just added to the flavor and made the banh mi incredibly satisfying. I would definitely order this again!<br><br>The Classic Belly was also delicious! The meat was tender and but not as flavorful after having taken a bite out of the Sunnyside banh mi. <br><br>All of the banh mi come with cilantro, mayo, and jalapeños, which are some nice touches!<br><br>The cold Jasmine milk tea was so refreshing and delicious! The milk in it didn't over power and dilute the Jasmine tea flavor. I would order this again in a heart beat as well!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/a8AjjreD8_5ZF777uqCX5w/348s.jpg", "caption": "Sunnyside and Classic Belly with a cold Jasmine Milk Tea"}]}}, {"review": {"des": "The catering frm this place is amazing. I've had to order catering for a bunch of events at the University of Chicago, and was getting sick and tired of the usual hyde park options when someone tipped me off about Lotus. The sandwiches and salad rolls are incredible- prices are reasonable, ordering is a breeze, and they had no trouble finding an obscure building and room number on campus. Will definetly be ordering from here again!", "pics": null}}, {"review": {"des": "Sandwiches here are amazing oh my goodness. Loving the asian fusion concept. The sweet chili sauce is good. I like how there's water available. Would come back when I'm in the area again and craving asian fusion sandwiches.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Cdr-P05ozvo7QXhoTybDPQ/168s.jpg", "caption": "Honey grilled pork"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/U7qKmuHuR6MH97rfh0uqzg/168s.jpg", "caption": "Sunny side beef"}]}}, {"review": {"des": "Yum! A winner! Something for meat lovers and vegetarians in a sweet simple ambiance indoor or alfresco. The smoothies are good too.", "pics": null}}, {"review": {"des": "Try the sunny side beef sandwich! It taste so good. It's also a very small and nice restaurant. If you want to try the Vietnamese style sandwich,this is the place.", "pics": null}}, {"review": {"des": "On a random adventure around Chicago, I realized I was near UIC so I asked my friend to stop by Lotus Cafe so I can go buy some banh mi to take home and eat later. The cafe is located on a small one way street and it was convenient for my friend to pull over while I run in and buy some stuff. If you want to park, there is a parking structure a little bit further down or there is also lots of street parking past the structure. It is not free parking though. <br><br>I ordered the belly classic and the honey grilled pork and the total came out to almost $14. My wallet was crying! I am so used to paying $3-5 for a banh mi. But almost $7 for a banh mi is a bit steep. However, you do get what you pay for. The banh mi is on the larger ends of banh mi that I've eaten. You get pretty full off one 1 banh mi. The ingredients are fresh and they stuff it with cucumber, meat, pickled carrots and daikon, cilantro, and green peppers. I can tell the banh mi is made of quality stuff. I did like the honey grilled pork more than the belly classic, which is just a little less flavorful. I ate the belly classic a day later and it was still good! The bread was not hard at all!<br><br>The cafe itself is adorable and I love all the traditional Vietnamese decorations. They have a chalkboard column in the middle of the cafe where you can graffiti on and tag stuff. That is a cool thing to have for a college campus store. <br><br>This is my first banh mi that I have bought since my move from Los Angeles to Chicago. I have been spoiled with good and cheap Vietnamese food and coming to Chicago, I am still not used to paying an arm and a leg for Viet food. I definitely will come back here but I don't think I can afford to eat here so often.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Htolx4dgiEG6wdX-haCJBg/348s.jpg", "caption": "Belly classic"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/BXegoz7rGFHJ9j6nzmG_pA/168s.jpg", "caption": "Honey grilled pork"}]}}, {"review": {"des": "Is this the best Banh Mi I've ever had? Probably - although I'll caution that I am not an expert in this area. Certainly this puts every other sub and sandwich shop to shame because their Honey Grilled Pork Banh Mi is one of the tastiest, juiciest, and freshest sandwiches I've had in a very long time. This is a straight forward straight up Banh Mi specialty shop (although they've tried to serve pho at one point) and I can't wait to be back. Parking is quite painful although there is a nearby loading zone that can be used if you call in your order ahead of time. <br><br>Prices were fair (especially for Chicago - coming from Minnesota). Service was friendly and fast. There wasn't anything I can think of to complain about - they do Banh Mi and they do it very well. The next time I drive through Chicago I'll definitely be stopping by. But can I write a Yelp review about the atrocious Chicago traffic and construction?", "pics": null}}, {"review": {"des": "If you're into banh mi or Vietnamese food then this is a place to try. There's only a handful of restaurants in Chicago who make worthy banh mi and this is one of them. My personal favorite is the honey grilled pork. Plus, this place has other food selections such as noodle dishes that are good too!", "pics": null}}, {"review": {"des": "Loved their Bahn Mi sandwiches and went two days in a row! The ginger chicken, veggie, pork, and beef were all delicious. I look forward to trying their other items.", "pics": null}}, {"review": {"des": "The price is a little high but it being in the location  it's understandable. The banh mi was really good flavor was very well balanced. I ordered the honey grilled pork banh mi and it alot of meat and veggies it was stuffed and made it a bit worth it... Also ordered the sweet soy glazed wing and also had very well balanced flavors, not to sweet, and it was crispy. Definitely will be coming back.", "pics": null}}, {"review": {"des": "First of all, the food was awesome! Second, I want to give a thumb up for the delivery guy as he waited over 15 mins for us to come, thank you!!! I will definitely order again!!", "pics": null}}, {"review": {"des": "So many good selections here, but I was in the mood for a delicious banh mi sandwich on a nice cloudy Monday. The guy behind the counter gave me a bunch of good recommendations, but the honey grilled pork sandwich sounded the most appealing to me. He told me it was his favorite sandwich...sold!!!! <br>Of course the sandwich was topped off with caramelized chopped lemongrass, honey, garlic and green onions. The marinated grilled pork shoulder was very tasty and made for a damn good sandwich! They have a hot sauce and a sweet sauce in which both are good and goes well with the sandwich, but I kept squirting the hot sauce on my sandwich as it was definitely an enhancer. Don't get me wrong...the sandwich is good by itself but the hot sauce was the cherry on top. <br>The place itself is small, but clean and very modern. I'm sure UIC students love this place as I saw a few dining here for lunch during my visit. Nice location, nice people and nice food!", "pics": null}}, {"review": {"des": "Lotus Cafe is as good as it gets in terms of Banh Mi and I'm so glad it's by UIC!<br><br>When I used to go to school in the area, I would find myself always grabbing a Iced Vietnamese Coffee (House) and a sandwich (alternating between the Sunnyside Beef, Honey Grilled Pork and Belly Classic) ....and even long after I graduated, I still come back!<br><br>My suggestion is to try everything and see what you like. The biggest difference will be that the sandwiches are warm and toasty compared to some other sandwich places (Ba Le comes to mind) where the sandwiches are more similar to cold cuts. There is nothing wrong with that but I have a special place in my heart (and stomach) for warm sandwiches, especially with a nice iced coffee!<br><br>Highly recommend -- Parking is hard to find in front of the place but I always park right in front of the Garage half a block down and put on my flashers. It's more than enough time to walk in, order and go.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/52bCYkYLrbs7ECa_-n_XjA/348s.jpg", "caption": "Belly Classic"}]}}, {"review": {"des": "Jonas pretty much runs the whole show and he's super sexaaayy doing it. Those sandwiches are bomdiggitybomb and that pho is photastic. I wish Jonases grew on trees everywhere because I would eat those trees and digest them on my toilet. Gonna come back soon and leave them a great tip for the awesome grub.", "pics": null}}, {"review": {"des": "If you're at UIC, don't miss a chance to try a delicious banh mi from Lotus. I took a 5 week class at UIC and went to Lotus 4 times. I wish I would have tried it the first week and made it in 100% of the time. <br><br>I only tried the sunnyside beef, but when I find something I like, I stick with it. It had beef and eggs and all of the traditional banh mi toppings. The bread was nice and crunchy. The sandwich offered a perfect balance of flavors that I can just taste in my mouth as I write this review.<br><br>The prices are fair--about $7 for a sandwich. They also offer smoothies with tapioca, as well as appetizers, chips and pop. I believe they offer delivery too, but I'm not sure on delivery area or charges.<br><br>The same girl waited on me each time that I came and she was really nice.  If you're dining in, they also have jugs of water out so you don't really need to purchase a drink. Bonus: this is right next to the parking garage on Maxwell, so you can pick up a sandwich before you head back to your car.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/avi9pS_QGsZLvxATdeUNZQ/348s.jpg", "caption": "Sunny side beef and a lychee smoothie w tapioca"}]}}, {"review": {"des": "Blah blah blah.  I've been to a gazillion Viet restaurants, and this one was easily forgettable.  They don't have Pho, which in my book makes this un-Vietnamese.  The day I was there, their hot beverage machine was broken down, meaning, no hot tea, no coffee, etc.  The food was mediocre at best.  For example, the fresh spring rolls were bland and totally uninspired.  <br><br>The location is good, right in the center of Maxwell Street action.  Unfortunately, this also means that parking can be troublesome.  Also, keep in mind that this is a very small restaurant-- it seemed like most of their business was take-out.", "pics": null}}, {"review": {"des": "Okay, so Lotus Cafe's pho is really just A-VER-AGE.<br><br>HOWEVER, their Bahn Mi Sandwiches are phenomenal and are themselves worth the 4 stars. Great flavor and taste - I'll definitely be back for more.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/xiFWeibPgW-twOoszb9a2g/348s.jpg", "caption": "pho"}]}}, {"review": {"des": "Their noodle salad is soooo good! I could eat that everyday! The sandwiches are also really good. The food is a little on the pricey side compared to places in argyle but still worth it! It's kind of hidden on Maxwell and they only have a few tables so I always get my order to go", "pics": null}}, {"review": {"des": "This place is amazing. Everything is so fresh and fast. The veggiecado and spring rolls are fantastic. I would eat here everyday if I could.", "pics": null}}]}