{"name": "lou-malnatis-pizzeria-chicago-9", "reviews": [{"review": {"des": "Love any and all Lou's.   <br>Been going to Lou's since the first location <br>opened up in 1971.   <br><br>Butter crust adds to any pie.", "pics": null}}, {"review": {"des": "After going to multiple pizza places in Chicago, this was one of my least favorites. The wait was almost an hour as it was very busy that night, plus another 20 or so minutes for the food. The waiter though, was quite friendly and even entertaining. The appetizer was great, but the pizza was cold and definitely didn't taste as good as I thought it would for the reviews.<br><br>If you think you'll like it-- go for it. I'd recommend it then. I understand most of the issues probably don't happen too often, but from my personal experience I don't recommend it.", "pics": null}}, {"review": {"des": "Fantastic Chicago style pizza! Enjoyed<br>Chicago style pizza with friends as they have large portions. Four of us shared a make your own pizza with deep dish crust and tons of cheese! The flavors were delicious and heavy slices with loads<br>of ingredients--we did cheese and spinach and pepperoni. Yum! We walked from the subway so no parking needed. Good service too!", "pics": null}}, {"review": {"des": "A friend required that we visit Lou's while we were touristing in CHI and i can now say I've put in a check in the box.  Since we went on a Friday night, we opted for take-away since the wait for a table was appoximately a millionty years.  <br><br>We still had to wait 45 minutes on our take-away.  We spent that 45 minutes at a bar down the street.  <br><br>The servers who took our order were NOT friendly, I chalked it up to having to endure the Friday night rush and ALL THE NOISE at the door.  It was impossible to hear anyone unless they were yelling in your ear (very much like being at the club).<br><br>That said, the pizza was delicious.  I had never had CHI deep dish style pizza, so it was a fun experiment!", "pics": null}}, {"review": {"des": "It definitely lives up to its hype! I was a little skeptical to be honest. I'm use to going to a pizzeria when you enter you INSTANTLY smell the spices, herbs, and meats. Watching customers eating their pizza that has cheese that stretches for miles. Sadly, I didn't get that experience. Just a lot of people waiting to be seated. After the chaos of waiting for our table we were greeted by our waiter. She was a delight! Also recommended us the personal deep dish. My first experience was overly heavy. This place made it just right! Not too big, not too small! definitely can fill you up. Especially with the salad on the side. We ordered the classic! and I have to say. I am a fan now. Coming from NYC that's big words to say! But, sometimes you got to be a bit more open minded !", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/zn4-bz-NrsPxJTIMQxeTMg/168s.jpg", "caption": "The loud special with pepperoni and sausage and mushrooms"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Gl3ClOr2uQtWqmmQ17N7yQ/168s.jpg", "caption": "House salad"}]}}, {"review": {"des": "When I moved to Chicago, the Uber driver recommended that I had to try deep dish pizza at Lou. The pizza was fantastic and a large was perfect for the four of us. The huge slices were engulfed in loads of vegetables, sauce and cheese. <br>I walked to this location because it was near my apartment. We waited 45 mins before we got a table but it was worth the wait.", "pics": null}}, {"review": {"des": "When in Chicago, gotta get in my Chicago Style deep dish pizza, so we stopped in at one of our favorite spots.<br><br>Tonight was the \"The Malnati Chicago Classic\" individual pizza for me, which is their special sausage and cheese served in a buttery, crispy, and rich deep-dish crust.  Also shared a \"Chocolate Chip Pizza\" with my daughter for dessert.  It was a bit over cooked and burnt, but still pretty descent.<br><br>Our server was excellent and friendly.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/gvmHBWQ-1nvNxCquMsqwLw/168s.jpg", "caption": "Chocolate Chip Pizza"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/tfgkH66hIljc0RVnVyMJxA/168s.jpg", "caption": "The Malnati Chicago Classic Pizza"}]}}, {"review": {"des": "Came in with high expectations for Chicago deep dish pizza and left feeling a little disappointed. I don't think it's a reflection of this chain particularly, but rather the style of the pizza itself. My team and I were in town for training and decided to see what all of the hype was about. This place had thousands of reviews and seemed to be the best choice to experience authentic deep dish. We came right when they were opening for dinner time at 4pm and thankfully we were the first ones there. The reviews were right- by the time we left there a massive amount people waiting 1hr+ to get seated, which wouldn't have been worth it in my opinion.<br><br>We started out with a few apps and overestimated our hunger levels by mistakenly ordering 2 large pizzas (the Lou and the Chicago classic with the recommended butter crust). None of us have ever had deep dish so we didn't realize the extent of just how heavy it is. We barely even put a dent in one pizza. One/two slices per person was all it took to knock us all out into a painful food coma. So to anyone reading this- don't overestimate your appetite, and order just a personal size for yourself. It's more than enough.<br><br>The garlic buttercrust was the highlight for me. But I think this style overall was just too much for us since we've been accustomed to thin crust. It's a thick layer of dough with an even thick layer of cheese and sauce. Everything started to taste the same. I liked the Lou a little better since it had more toppings and consequently a better flavor profile, but the same thing happened- you just started feeling sick and unable to taste anything else.<br><br>I'm really glad I got to experience it nonetheless. The servers were super friendly, prompt, and courteous. If I ever come back, I am game to try another place to compare and see if that's just how deep dish pizza is.", "pics": null}}, {"review": {"des": "Great deep dish pizza. Once you are seated, it takes some time cuz they are busy, things come quick. Service is attentive and friendly. <br>The pizza is yummy lots of cheese and with the Chicago classic has awesome sausage yum. The pizza for 4 is really the Pizza for 6. Order accordingly. <br>We had a salad before and it was wonderful. <br>I have this spot bookmarked for the future!", "pics": null}}, {"review": {"des": "Our Order: 2 Sam Adams Oktoberfest beers, small house salad, and a small \"Lou\" deep dish (no mushrooms).<br><br>Environment: Great service.  They take your name and pizza order, but don't seat you until your pizza is almost ready, which allows all guests to enjoy drinks from the bar and allows you to eat in peace without waiting for 45 minutes at the table while it cooks.<br><br>Verdict: The buttercrust was fantastic and gave the pizza that perfect finishing touch. Everything was perfectly cooked and the service was fantastic.<br><br>Tips: Make sure to place your name down and then order your deep dish pizza at the counter.  Then grab a beer (or two) at the bar and just relax while the food is being prepared.<br><br>Next Time: We will try the classic cheese pizza.", "pics": null}}, {"review": {"des": "Three of us went to Malnati's while in Chicago on a business trip. Even though we got there early, there was a 20 minute wait. This place is popular with locals and hotel guests. It took a long while to have our order taken and a long time for the wrong order to arrive followed by another long wait for the correct order to come. <br><br>Look, I don't want to inflame any passions here, but my tastes in pizza are more East Coast. ;-)", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Uvx3JIHsBL29vesXQb1S_A/348s.jpg", "caption": "Medium Malnati Chicago Classic"}]}}, {"review": {"des": "If you're into deep dish pizza and I mean DEEP DISH, this is your place to go! I for one am not a huge deep dish pizza fan but Lou Malnati's was delish! We went with The Malnati Chicago Classic. When in doubt, classic it out. <br><br>The wait time/process wasn't too bad. It was just me and my friend and we waited for about 30 min. I loved how the hostess addressed you to pre order so you wouldn't have to wait as long for your food when your table was ready.<br><br>We ordered a small for just us two and it was more than enough. It was very filling! Definitely use a knife and a fork to eat it because it comes out very hot. It was pretty good for a deep dish pizza! Now the Malnati Salad was delish! The dressing that came with it was gourmet. Next time no bacon but very refreshing.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/iorwtNd1mPV9qxEWY96dXg/168s.jpg", "caption": "The Malnati Chicago Classic Pizza Small"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/EX6wDVkw5_DVGaI8KEvcGw/168s.jpg", "caption": "Malnati Salad"}]}}, {"review": {"des": "We came around 930pm on a Friday night and didn't have to wait more than 20 mins to be seated. They also take your pizza order before being seated so that it minimizes the wait time.<br><br>Deep dish pizza that isn't as thick as true deep dish, but still thicker than most pizzas. Lou's with pepperoni. Good balance of cheese, tomato, and all the toppings. <br><br>Minimal wait for delicious Chicago style pizza. Loved it!", "pics": null}}, {"review": {"des": "Yes, please!<br><br>Everyone knows I'm a St. Louis style pizza girl, but I love getting a Chicago style fix from time to time.  Lou Malnati's doesn't disappoint.  We got there at the beginning of the lunch rush, ordered our pies and waited for a table.<br><br>Our server was friendly, the restaurant was clean, and the pizza?  Well...it's just SO good.  Get the butter crust.", "pics": null}}, {"review": {"des": "Had an amazing experience at Lou Malnati's! <br><br>I was visiting Chicago, and of course I could not leave without trying the famously deep dish pizza. The place was highly recommended, so we decided to come inside to see what the fuss was about. <br><br>The restaurant was very busy, but the wait time was short (about 15 minutes). Not only did we order our drinks while we waited, but we were also able to order our pizza before we were seated. The pizza was nearly cooked by the time we were sat at our table! Super convenient, especially if you have children. <br><br>We started with the bruschetta, which was definitely a portion that was shareable for 3-4 people. The tomatoes were so fresh, and had a great hint of basil, and garlic. Definitely recommend! For pizza we ordered sausage and pepperoni. The food was so amazing, it was even tasty reheated. <br><br>The staff was excellent, very friendly and kind. Overall an enjoyable time, will definitely be returning if I'm back in Chicago!", "pics": null}}, {"review": {"des": "What can I say about this popular deep dish restaurant in Chicago?  It's either overrated or I just ordered the wrong pizza!<br><br>We were lucky to have a short wait (hostess overestimated wait time) but you can pre order while you wait for a table as it takes about 30 mins for the deep dish, which is nice.<br><br>We shared:<br><br>*House salad- iceberg lettuce with some romaine, shredded carrots, cabbage. It looks straight from a supermarket salad kit. Some of the lettuce looked a bit withered, and the dressing had no taste at all. I get it, they specialize in pizzas, but a bit of love on the greens wouldn't hurt<br><br>*The Lou- we decided to try this unique one since we thought we were going back with some friends.  This deep dish pizza had spinach, mushroom, tomatoes, and we added pepperoni. The crust had a weird taste, a bit bitter even, and it had yellow cheese that didnt go at all. I usually eat first with my eyes and it did not look appetizing. It wasn't as deep as I expected and definitely not cheesy enough. A small one was more than enough for the 2 of us and we even had leftovers.<br><br>Service was good but nothing to rave about.<br><br>There are several locations in Chicago but this one is in the Loop within walking distance to the Millenium Park just a few blocks from the Hilton.<br><br>Our friends had it on a separate occasion and didn't like it either.  Perhaps if I go there next time, I'd order a different one. Or maybe not...", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/if7uokBb-sK5ELCZJZCcow/168s.jpg", "caption": "The Lou deep dish with added pepperoni small"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/j2sACzF0x0MAO7HL2nH7UA/168s.jpg", "caption": "House Salad with garlic creamy dressing"}]}}, {"review": {"des": "Simply not my favorite. I've been to Pequod's and Giordano's and they easily run circles around this place. Maybe it was this particular location, or they just aren't as good. <br><br>Decor-kinda seemed antiquated and bland. They did have large windows that allowed for lots of natural lighting. <br><br>Service-waitress was good and friendly. <br><br>Food-they just missed the mark on the pizza. Cheese bread was 4 stars and favorite part of dinner. Pizza just wasn't very favorable and dough want crispy enough.", "pics": null}}, {"review": {"des": "Holy moly, delicious pizza! The \"Lou\" is a vegetarian's dream pizza. The butter crust is awesome and the ingredients are super fresh. Get a small and add a garlic bread (has 6 pieces) and you will comfortably feed 2 people. We also splurged for the dessert sampler-key lime, tiramisu, and cookie pizza. The key lime is a letdown-not limey enough and the crust is overly sweet. The tiramisu is well soaked and delicious, but the cookie pizza with ice cream and whipped cream is by far the star.<br><br>Weekends are stupid busy, so plan ahead and expect to wait 40 minutes for a table. The pizzas take about 30 minutes to cook, so they do have a great system where you put your name in for a table, and then head over to put in your pizza order so that you aren't waiting all night for a slice. But lemme tell you, it is worth the wait.", "pics": null}}, {"review": {"des": "I have a (probably empirically true) belief that Chicago is legally required to have amazing deep dish pizza wherever and whenever it's served. Lou Malnati's had a wide selection of Italian menu items but we went specifically and solely for the deep dish pizza. We got a lunch special: a personal cheese deep dish pizza with a side of cream of potato soup. We also got the personal \"Lou\", which is a vegetarian deep dish. The cheese pizza was amazing, with a perfectly crispy crust and lengthy cheese pulls with every bite. The Lou had a bigger flavour than the cheese pizza, but was also equally delicious. I recommend getting both, as they were both superb pizzas. The personal pizzas are meant for one person, so sharing both personals could definitely leave a party of two very full and satisfied. <br><br>The restaurant itself has a cute bricked, typical Italian restaurant interior that felt very home-y. In regards to wait time, Lou's was pretty packed for an off-time period. We arrived around 1:30 and waited for around 15-20 minutes for a table. However, they're pretty efficient -- they actually allow you to order your pizzas while you're waiting for a table so that your food can get to you faster.<br><br>Verdict: Having deep dish pizza in Chicago is a must, and you can't possibly go wrong with Lou Malnati's.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/-NaQCTEete-iNl9oBo3xdQ/348s.jpg", "caption": "Personal cheese deep dish pizza"}]}}, {"review": {"des": "Been here twice on 2 different visits. The wait is usually long but the deep dish pizzas are delicious. <br>Service is so so as staff forgot to call me when my take out is ready.<br>The pizza is loaded with toppings. There's a variety of sizes and toppings to choose from and you can order online prior to take out.", "pics": null}}, {"review": {"des": "So when you're in Chicago you gotta try a Chicago pizza right? I think we picked the perfect spot for it on a cold wintery night. <br><br>The wait at Lou wasn't incredible long and we were inside for our wait time so there wasn't any complaints there. The interior is very cozy, but can get a bit crazy when all the tables are full and you get a little squished. <br><br>I say skip all the appetizers and go straight for a pie! It does take a bit of time so I guess take your pick on what you want to munch on and chit chat it up. I was not blown away by the appetizers but they are a good starter. <br><br>The Chicago pizza is not what I've grown up to or is my personal favorite type of pizza, but it was pretty darn good at Lou's. If you want to get stuffed you will surely get stuffed here. The flavors were amazing and you can get a cheese pull for days!", "pics": null}}, {"review": {"des": "First time having the famous Chicago deep dish pizza and let me tell you... it was delicious! I had the Italian deep dish specialty. The crust was perfect and crispy and the spice was amazing. I rate this pizza 10 out of 10. I wish they had this place in Miami", "pics": null}}, {"review": {"des": "Came here for dinner last night for dinner with the bf. <br><br>When we got in, we were told to order the pizza so that it will be ready by the time they were ready to seat us. I think it takes about 30+ mins for the pizza to bake. You give them your name and phone number and they text you. However, there must have been an error because they skipped us. We didn't notice until some time, but they did seat us right away. <br><br>We got 2 personal pizzas: the classic and the Lou deep dish pizza. Both with the butter crust. I'd have to say that be both preferred the the Lou. It just had more flavor. Although the personal pizzas seemed small, it can definitely fill you up since they're deep dish. <br><br>Overall, it's definitely worth the try if you're in the Chicago area", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ArXpyKl7bG0Gd28jLBAgHQ/168s.jpg", "caption": "The \"Lou\" - Personal size"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/PkA1zLO64HfWkDlrOfAYwQ/168s.jpg", "caption": "The The Malnati Chicago Classic Pizza - Personal siza"}]}}, {"review": {"des": "When in Chicago... You must get a deep dish they say. It's amazing they say. It's gooey & crunchy at the same time they say. It's soooo cheesy they say. And they were all right!!!<br><br>*warning* it takes 30 mins for the pizza to cook here as everything is made to order. It does mention it on the menu and trust me, it takes the entire 30 mins. It's worth it tho.<br><br>Deep dishes are very filling so come w an appetite! They say this chain is the best out in Chicago so this is where we went and it was indeed delicious. The service was friendly, tables and bathroom was clean, and our food was made fresh. No complaints here!", "pics": null}}, {"review": {"des": "I am here to tell you the pizza was good!!! The service was good. The location looked exactly like a pizzeria and most importantly it was authentic - got pizza right down town. <br><br>I am originally from Philly and Chicago reminded me of home so much. I am in love with thin crust and haven't been given anything better so I decided to take Chicago up on their offer and test the waters. <br><br>Will I say it's better than pizza from home? No I won't lol it was good. It had good flavor. Nice and rich flavor so I will give it all the points it deserves. <br><br>I had a personal pizza and it is really the size of like the pizza but little personal pizzas so if you want more get the next size up. <br><br>Also it takes about 30 minutes to make. This was a true time frame so idk if I was happy about that but it was worth the wait.", "pics": null}}, {"review": {"des": "Not bad for my first Chicago dish and Chicago pizza ever! It gets super packed here during dinner. I came here on a weekday and the wait for a table for 2 was 1.5 hours. I can't imagine what's it's like during the weekend dinner... I got dropped off by an Uber, but street parking looks pretty scarce. Though there are parking garages nearby.<br><br>I like how you can put your name on the waiting list AND order ahead. So when you get seated, you don't wait as long. Although I did that, but ended up waiting 20 mins or so for my deep dish pizza anyways. I understand deep dishes take long to cook, but again, I can't imagine how long I'd wait if I didn't order ahead. So I definitely recommend it.<br><br>As for actual dishes, oh boy is it cheesy! Don't come here if you're on a diet, because I saw some intense calories. 3 slices seem to be the max for everybody, including me. I thought it was heavy on the pepper, but I really enjoyed the sauce! The slices weren't as cheesy/hot after the first slice, but they were still good. As a tourist, I really enjoyed this Chicago classic!!!", "pics": null}}, {"review": {"des": "It was my first time in Chicago and what is Chicago famous for? Deep dish pizza. My friends and I researched long and hard for a place to try our first Chicago deep dish pizza. From reading a whole bunch of Yelp reviews to asking random Chicagoans, we finally chose to come to Lou Malnati's on a Saturday night. <br><br>If you come to this location and you want to dine-in, be prepared to wait at least an hour for a table. A group of 3 of us came in at around 8:30pm hoping to get a table since we're a small party and it is quite late for dinner, but the wait time for us was still ~1hr. There were people everywhere in the restaurant and there was a party of 12 already waiting outside. We were hungry so we decided to go for take-out and the wait time was about 35 minutes. This was probably a better option as they told us we didn't need to stay in their busy/crowded restaurant but could just come back to get our orders. <br><br>We got 'The Malnati Chicago Classic - small' ($21.95) and 'The Lou - small' ($18.25) to split amongst the 3 of us. When we got our orders, only napkins were provided for us. I had also expected knives and forks as the menu recommended it. It wasn't a big deal, just messy for us to eat.<br><br>The Malnati Chicago Classic is made with Lou's lean sausage, some extra cheese and vine-ripened tomato sauce on Buttercrust. It was absolutely delicious. I am not sure if it the sauce or the sausage but the flavour was great AND best of us, the pizza wasn't as salty as I imagined it to be. BEST DEEP DISH PIZZA EVER!<br><br>The \"Lou\" is a spinach mix (enhanced with garlic, basic and onion), mushrooms, and sliced Roma tomatoes covered with three cheeses on Buttercrust. I enjoyed eating this as well. But I still prefer the Chicago Classic!! <br><br>The buttercrust was sure delicious!!!<br><br>Next time when I come to Chicago, I will definitely eat at Lou Malnati's again, but I think I will try other locations for the atmosphere. Some had outdoor patio seatings and I think that would be a nice experience.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/gYjgxfhrD5ImkaW8JHntyQ/168s.jpg", "caption": "The chicago classic - small serves 2"}]}}, {"review": {"des": "When in Chicago you have to try the deep dish pizza, with so many places to go I relied on asking some locals. Most popular answer was Lou Malnati's! I came here with a group of coworkers, we arrived early about 4:00pm since they don't take reservations. We were seated right away and got our drink order in,  then on to the appetizer's.  Bruschetta with fresh roma tomatoes,  basil, olive oil and shaved parmesan on garlic round crispy bread. These were so good we ordered another one. Calamari Fritti was another big hit with the group. <br><br>We shared a couple of deep dish pizza's pepperoni cheese with the butter crust (and extra charge but so worth it!)  Also a pepperoni, sausage and onion one. I love the service here, when they bring out the pizza they serve your first slice for you...so much cheesy goodness! Pizza is filling and amazing and there were leftovers!<br><br>Our crew had a great evening here, come early or prepare to wait for a long time.", "pics": null}}, {"review": {"des": "I was so happy I was able to stop here on my recent trip to Chicago.  This was my fourth time eating at a Lou Malnatis 's and it is absolutely delicious every time.  A must stop for any visitors.<br><br>I have been to several other deep dish spots, including Giordanos, Gino's East, Uno's and others.  None of them are on the level of Lou's.  The ingredients are so fresh, from the dough to the sauce.  You can really tell the pizza is carefully prepared.  <br><br>Also, you must try the bruschetta as an appetizer.  Even though you want to have room to eat as much pizza as possible, it is the best bruschetta I have ever had.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/m5vk7LZ9w69If6Pr1loz6w/168s.jpg", "caption": "Lou's Bruschetta...delicious"}]}}, {"review": {"des": "Do it.   So good.  <br>Totally worth the stop. OMG.  We had a medium \"the Lou\" and the pepperoni.  Best pizza ever!", "pics": null}}, {"review": {"des": "I'm probably not the best deep dish pizza judge, but I honestly wasn't blown away. We had the plain cheese pizza and also split a house salad. The pizza was alright. It has a nice fresh tomato sauce and gooey cheese and a buttery crust. So it checks all your deep dish boxes. This might be your thing. For me, it wasn't revolutionary. Our salad was under-dressed (red wine vinaigrette), but fine. <br><br>The service was very average. We felt a little rushed at the end, like they wanted us to leave and give up the table. (Which is fair, it's a popular place on a Saturday.) But nothing stood out as good. <br><br>The atmosphere inside is very classic Chicago. It checks off your touristy craving. But I'm sure you can find tastier food elsewhere. We probably wouldn't return the next time we're in Chicago.", "pics": null}}, {"review": {"des": "Came here in 2014 and 2018. <br><br>Between Lou M and Giordano's...I have to say Lou is much better. <br><br>We came here at lunch time and obviously there was a wait...a 30 minute wait for 2! The great thing is that you can place your order first, then go walk around (nothing to see nearby unless you have more than 30 minutes) and come back to cut your pizza cooking time in half or more.<br><br>The Malnati Chicago Classic (Personal size $10.25) feeds one person or one and a half girl. It had good servings of lean sausage, plenty of cheese (see picture) and very generous vine-rippened tomato sauce on each of the small slices! The crust was a bit too crunchy for me (almost hard) but it is definitely better than Giordano's (too doughy)<br><br>Service was a bit lacking (waitress seemed very young) but in the end, we just wanted our pizza, our water and out check. She did it fine.<br><br>----We added the Individual chocolate chip pizza $3.95 (it is VERY TINY) which was the warm cookie with ice cream on top and whipped cream. It was small but it was delicious. I think it is worth ordering (the larger size if you don't care about your love handles)", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/naG8-H9AzA9mEq06AxTOkg/168s.jpg", "caption": "It came hot! I could see the steam melt the ice cream. CHOCOLATE CHIP PIZZA $3.95 individual"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/MNZ24D66SGzUHkW4S_8EyQ/168s.jpg", "caption": "Nice and cheesy like it should be.Personal size Chicago Classic $10.25 -- great"}]}}, {"review": {"des": "Hands down my favorite!<br><br>We tried a medium Chicago Classic Pizza. Definitely should of gone for the small! We also ordered Bowtie Pasta with Lou's Sausage which consists of crumbled sausage and bowtie pasta tossed in a creamy yet slightly spicy vodka sauce. So delicious and amazing. <br><br>The sauce of the pizza is not overpowering, and it is JUST RIGHT.<br><br>We had a 35 minute wait for our food, we opted to go since the wait for a table was so long. Definitely amazing and recommend this over one of their competitors. Unfortunately only got to try to different deep dish pizzas while in Chicago!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/e4wLL19d6nJVkeo45gvkvw/168s.jpg", "caption": "Classic Pizza & Bow tie Pasta"}]}}, {"review": {"des": "Ahh the best pizza! Visiting Chicago and it was our first time having Chicago style deep dish pizza which blew our mind. Sauce on top? Who does that! But we loved every bite. One slice is definitely enough per person, but we ordered a small which included 4 slices so we forced ourselves to finish the second slice. We got The Classic which was sauce, cheese and sausage. The sausage was definitely not scarce. <br><br>The wait was about 40 minutes, but we got sat in about 30. Also, you can put in your pizza order when you put down your name so that you don't have to wait as long once you're seated. You can also order drinks there and hang out outside while waiting for your table. We were able to get a second round of drinks where our table was ready, which was a nice surprise. <br><br>This place is a must if visiting Chicago. Loved every bite!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/sdh6ZJq6T3iMMxLmv9hlQw/168s.jpg", "caption": "The Classic"}]}}, {"review": {"des": "First time trying Chicago DEEP Dish Pizza and I must say, it's really, REALLY lit. The pizza was big, so you had to have it with fork and knife. I personally like it, though preferences may differ. <br><br>The restaurant is not crowded right at opening but the place is PACKED during lunch. Come at opening and you'll be content. <br><br>We came in with no call before too, but no regrets! The staff handled our large group of 10 just fine. <br><br>Pizza takes 30 minutes to come out. 1 Slice is good for one small person. 2 slices is insane. <br><br>I had 3 slices REST IN PEACE .<br><br>Not to mention I had a sandwich too. Let's say it was more like Lasagna than Pizza. But I like it. I enjoyed the meant and the hard bottom crust. Surprisingly made my Chicago experience for deep dish really enjoyable. <br><br>Go to Lou's. Bomb af deep dish and clean place when you're early at 11am.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/gZfhoOlN1t5Kw6_TZhO80A/348s.jpg", "caption": "the squad"}]}}, {"review": {"des": "So, of course, we had to get some pizza while in Chicago and since we have some of the other choices locally we decided to go for Lou Malnati's.  Everyone else apparently had the same idea as it was very busy when we got there.  They have a great system though of having you place your order while your waiting so the pizza will be ready closer to when you are seated since they take so long to cook.  This was a nice touch that definitely expedited the process and made sure we weren't sitting at a table longer than we had to.<br><br>We ordered the Malnati Chicago Classic and a house salad.  The salad was refreshing and had a great flavor.  Definitely a good way to break up the meat and cheese that was to come.  Once the pizza came we realized we had probably over ordered, but what the heck, we're only here once.  The pizza had a great flavor and the butter crust was something different but very good.  We ended up almost finishing it and had to throw in the towel and get a box.  That extra slice didn't last long though, as it was so good I ended up finishing it that night.  <br><br>I've heard lots of comparisions about who has the best depe dish pizza, and I can put in my two sense that even though I'm not sure which is better, Lou Malnati's was REALLY GOOD!  I don't think you can go wrong either way.", "pics": null}}, {"review": {"des": "A group of us came in here for a late lunch on a Friday. I am unsure if they take reservations prior. As we walked in, it was really full, but luckily, we were able to get a table within 30 minutes. As we were waiting, we pre-ordered the pizzas as it takes about 45 minutes to cook. So when we had our table, we didn't really wait that long.<br><br>Our server was nice and even took our pictures for us. We were celebrating someone's birthday. He tried his best to get a good picture but the location of our seats weren't helping us because of the sun exposure and all. But, it's fine as we were just having a blast being together.<br><br>Some people in the group never had the Malnati salad. Oh boy, were they surprised that a pizza place has AMAZING salad!!! My boss' husband loved it! Ever since I've had the Malnati salad, I always order it! And you can order their salad dressing too if you want to stock up.<br><br>The two pizza we ordered were the Chicago Classic which is sausage, and the Lou, which is vegetarian. I like both, but my favorite is the Lou. I find it full of flavor because of all the different vegetable profile it has. A must try!! <br><br>If you're worried about parking, do not worry. There are pay to park street parking, parking lots near by, and two parking garages adjacent to the building. Just use Spot Hero to check the best prices!", "pics": null}}, {"review": {"des": "Visited the place for lunch.. Thankfully no waiting!! New to the city - no idea about this place so full and vibrant. <br><br>We ordered 'the lou' deep-dish pizza small(that serves two). The pizza usually takes 30-32 minutes to come if you go for deep dish. But if you go for thin crust, will take 20-25 minutes. <br><br>Don't miss this pizza- if you are a giodarno's fan and don't want to stand in line, try coming to this place. Amazing pizza and nice decor. <br><br>We walked from our Air bnb but I will definitely tell you to go for uber/lyft if you are new and don't stay closer to this place. Reasonable priced and great taste", "pics": null}}, {"review": {"des": "This was the shortest wait we have ever had at this location. It's usually packed  because it the best pizza on the planet but we some how scored a table within minutes of arriving. Winning. My wife and I also score a free app from the hotel. We ordered a Lou and it was amazing as always. Before we left we ordered a small meats to keep frozen for later in the year. We had enough left overs from 1 pizza to have for a full meal later. This place is always amazing. I continue to visit this place every year. Cant wait to go back next year.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Q3r53m5XqJ4_GjoxbmLPxw/348s.jpg", "caption": "Yesssss"}]}}, {"review": {"des": "As a Texan, i thought I was going to be disappointed in deep dish. I'm here to happily tell you I was wrong. <br><br>First of all, Lou's was pretty packed when we got there, as it is close to soldier field and there was a concert. However, they informed us that we could go ahead and preorder our pizza while we waited in line. This is amazing service since deep dish takes 30 min to make. You can also have beer and wine while you wait. <br><br>By the time we got seated, we ordered a salad to start and then the pizza came out as soon as we were ready for it. <br><br>The malnati salad was delicious! Sweet vinaigrette and bacon is the best combo- but the pizza was amazing! It tasted fresh and honestly couldn't have had a better experience. We got the Lou and added spinach.", "pics": null}}, {"review": {"des": "Our server was awesome . Her name was Tiffany. She was very personable and serving the pizza is a nice touch. It doesn't even need to be said but the pizza was amazing. We were in Chicago and we are from PA so we had to try deep dish, obviously. We only had to wait briefly but it was definitely worth it. We had two leftover pizzas and my husband tried to leave them behind , so now I'm questioning whether or not I should've left him behind <br>#nofoodleftbehind", "pics": null}}, {"review": {"des": "3.75<br><br>We came an hour before closing, seated promptly and greeted with friendly service. We ordered a medium size Lou pizza with sausage. <br><br>The outer crust was crunchy but not dry. I would have liked the bottom crust to be the same but it was a little soggy. The ingredients (spinach, tomatoes, onions, mushrooms, sausage) tasted very fresh. The sausage could have been spicier. <br><br>I don't think it's the best deep dish I've ever had but I'm glad I got a taste of the Chicago style deep dish.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/MezqvBsu9PIUmwLjQp-5ew/348s.jpg", "caption": "The Lou with sausage medium size"}]}}, {"review": {"des": "Chicago natives recommended to either try the Chicago deep dish from Lou malnati's or Giordano's. <br><br>***It takes 30 minutes to prepare a fresh deep dish pizza pie.<br><br>Trying the classic deep dish-butter crust with sausage and fresh spinach mix... very savory, cheesy pizza pie that is filling quite quickly.<br>4/5 - without additional condiments - relatively bland <br>5/5 - with additional condiments (crushed dried red chilli peppers and parmesan cheese) - this provides the kick of flavor<br><br>Ambience: classic old school Italian restaurant<br><br>Service: attentive and friendly", "pics": null}}, {"review": {"des": "I'll be honest ... this is the only pizza chain I've tried in Chicago... it's so good I haven't been able to try another. The crust is so buttery and I love when its crispy. seems it's a Chicago thing to put the cheese in the middle. <br>      dont usually choose thick crust ... in fact the thinner the crust the better. If I get thick crust anywhere else I either throw the edge away or let my husband or pug eat it .. I don't eat it EXCEPT for Lou Malnati's . I some time get a cup of soup to accompany the personal pizza but tonight it was very late so my husband and I share the personal pan pizza and I had a dirty martini ... yumm", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/BwWSqG_wTK3vlvSzNJGNFw/168s.jpg", "caption": "funny"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/PZ7M7LaUO_QWM0zy7wkePA/168s.jpg", "caption": "pepperoni mushroom"}]}}, {"review": {"des": "What can I say besides this is the best Chicago style pizza on earth. This year was our 3rd annual trip to this location, JUST FOR PIZZA. Yes we make a 6 hour drive here every year to get heaven in the form of pizza. This location is super busy at night but it is well worth the wait. They have it going on here if they are busy with a lot of people waiting, you go inside to the hostess station and you give them your name and how many in your party. Next you go to the counter and place your pizza order, they will ask you how long the wait time you were given. You can also grab a beverage here while you are waiting. Once they send you a text your table is ready they will seat you and place a copy of your pizza order on the table for your waiter. This is where you can order an appetizer while you're waiting for your pizza, it's take about 45 minutes for your pizza to bake (it's worth it). We always get the Lou with added toppings. Be prepared because one slice is most usually all that I can eat. <br><br>When you are leaving they also have a freezer so you can grab some frozen pizzas to go and take with you. They also have a website that you can order from and have the frozen pizzas shipped. I personally enjoy the fresh hot pizza delivered to my table at the restaurant and the experience.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/c7aJnsT6363W4rFPMHNfEw/168s.jpg", "caption": "The Lou...add pepperoni and sausage"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/2VKkElWrN6rqKZy07snbYQ/168s.jpg", "caption": "Complimentary Bruschetta from our hotel concierge....just ask!!"}]}}, {"review": {"des": "Amazing, the place was jam packed. I'm lucky, id called ahead ordered a pick up.  I chose to build my own deep dish with the butter crust.  It's no wonder Lou Malnati's is consistently top ten in CHICAGO.  With pizza like this in our back yards, of course the Pizza Museum is in Chicago.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Dl8uSxr98SDQWONltWrDzw/168s.jpg", "caption": "Beer and wine"}]}}, {"review": {"des": "Sorry Chicago, I tried to like your pizza.  <br><br>Here is the quick of it.  It is a huge cheese bomb.   You cannot taste much beside the cheese.  When it cools it is not the most appetizing.  <br><br>The canned tomato chunks on the top are not great. <br><br>The wait for the pizza to cook!  It is way too long!!  Nearly 40 minutes.  <br><br>As for Lou's specifically.  This place was super busy.  You can preorder your food so that by the time you sit down you are 50% done in cook time. The wait for a table was 40 minutes plus at least another 20 minutes waiting for a pie, that is if you pre-order.  <br><br>What did I learn today?  Thin crust for me please.", "pics": null}}, {"review": {"des": "I was in Chicago for a conference with a friend who had never had true Chicago pizza - this is her first visit to the Windy City. We had to wait about 35 minutes for our table, but preordering the classic Lou's made it easier. They do need to work on their table queue setup. Several parties got missed when it was their turn and we would have, too, had we not been watching the app. Why have the app if it's not going to help you manage the waitlist?<br><br>Meanwhile, back on food - the spinach salad was very good, though some of the leaves and the pear slices were a little too bruised up. Still - very tasty!<br><br>And the pizza - OMG. It makes me wonder why we even call what we get in Texas by the same name. This is the pizza of the gods - real, generous Italian sausage, perfect pepperoni, basil and black olives. To. Die. For. <br><br>Worth the wait. Don't miss this wonderful Chicago staple!", "pics": null}}, {"review": {"des": "Food was terrific, but the service was subpar. Waited at the table for nearly 15 minutes before someone came over. They didn't introduce themselves, but instead just asked what I wanted. No suggestions, checking up, or wondering how the food was. Really felt like they wanted me out of the restaurant.", "pics": null}}, {"review": {"des": "This is the BEST pizza in Chicago hands down!! A must try-- not greasy and made fresh .", "pics": null}}, {"review": {"des": "I think I died and went to heaven!<br><br>I am on a personal quest to visit all \"major\" pizzerias in Chicago. Lou Malnati's was next on my list. <br><br>I took a birthday trip down to Chi-Town last weekend. For my birthday dinner, we went to this location. There were many people waiting for a table, and we were told a 30-45 minute wait. I was totally okay with that. There was a small bar area where we were able to order drinks and pre-order our pizza (it takes about 45 mins to cook). It was maybe 25 minutes later and our table was ready.<br><br>Our waitress, Tabitha, was totally amazing. It was very busy yet she remained calm, cool, and collected and recognized my birthday. Super sweet. <br><br>We ordered the Dip Trio appetizer. This is definitely NOT something a Lou Malnati's consumer should ignore. There were 3 dips: roasted garlic, artichoke, and giardiniera-topped hummus served with crispy pizza chips. The flavors blew us away. OMG. Seriously! All 3 dips were fantastic and the chips were amazing in every way possible!<br><br>Then came our pizza: we ordered a pan style 'za with pepperoni and the spinach mix. It was FABULOUS!!!!!!!!! The crust was definitely made from scratch, in appearance and in taste. I could taste the passion. The spinach mix blend combine with the sauce and cheese and pepperoni was perfection. There is absolutely nothing that could have been better. <br><br>And then............<br><br>Our beautiful waitress brought me a special birthday treat - a \"cookie pizza.\" After making a wish and blowing out the candle I died again. This treat was so mind blowing delicious!<br><br>The entire experience, despite the wait, was stellar. I highly recommend and I will definitely visit again. <br><br>Thank you for making my birthday special! xoxoxo", "pics": null}}, {"review": {"des": "You hear about Chicago Deep Dish Pizza and think--it can't live up to the hype. Well, I was wrong. My first bite at Lou's was an out of body experience. That sauce! Damn...<br><br>There's not much else I can say except if you're in Chicago, you must stop by and try their Malnati's Chicago Classic. You won't regret it.", "pics": null}}, {"review": {"des": "The restaurant was packed, which is a good sign people like the place. Although, I can't rule out the possibility that they were all tourists like me. I even saw a customer rolling his suitcase around the restaurant (probably headed home after eating a deep dish). <br><br>The saving grace for me was the spinach cheese bread. It was unique and very good. It comes in a nice loaf (my picture is just a slice). <br><br>The pizza had a poor ratio of crust to cheese to sauce. I really didn't love it as much as I wanted to. I know it's probably social suicide to say this but... I think Papa Johns has a better pepperoni pizza. <br><br>Some people love deep pizza, but after trying it, I am not one of them. Unfortunately, my review reflects my new-found distaste for this type of pizza. If I were to go back I'd try their thin crust.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Ir0qYozjn8wSd9X26OGGLQ/168s.jpg", "caption": "Deep dish pepperoni for two. We could only finish half because it's so dense."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/fqzN2y8_ozWyGe3vYlfP9A/168s.jpg", "caption": "Cheesy spinach bread."}]}}, {"review": {"des": "I always grab a pizza from this chain when in Chicago. I think the crust and toppings come together perfectly. There can be a wait so be prepared to give your order before being seated since pizza will take approx 30 minutes. As a solo diner I sometimes get overlooked for drink refills but in general Lou's does ok.", "pics": null}}, {"review": {"des": "Can't leave Chicago without trying some sort of deep dish pizza!  This place did not disappoint. <br><br>We got some bread stuffed with cheese and spinach for appetizer, and a small size (says it feeds 2 people) deep dish pizza and added olives. They were both a bit too salty imo, but really good otherwise. For the pizza, the crust was like pie crust (a lot of butter flavour), and  there was a thick layer of ooey gooey cheese, a LAYER of sausage (not chunks. A whole, solid layer!) Then very chunky tomato sauce and olives. <br><br>Service was friendly and drinks were refilled promptly. Just FYI: the pizzas take half an hour to come to your table so be prepared to wait patiently. It was busy and lively on a week night, and the whole place was clean.", "pics": null}}, {"review": {"des": "As I m new to Chicago, my friend suggested me to taste this pizza.<br>As a food blogger, I m pretty excited to taste a food and it was amazing.<br><br>We had-<br><br>Deep dish pizza- Crust was buttery and crispy. Lucky that I have tasted first deep dish pizza at this place.<br><br>Three later cheese bread- it was just like a garlic bread but cheese was wonderfully baked.<br><br>Chicken wings- they were saucy and cooked perfectly.<br><br>Chicken white pasta- This was a disappointing. It's not at all good. Seasoning was not good.<br><br>Overall great experience here.", "pics": null}}, {"review": {"des": "I dined here recently for lunch with a friend. I still had my carry on luggage with me from my flight and the hostess graciously allowed me to keep my suitcase behind her so I wouldn't have to worry about it while eating. We were seated immediately in the center of the restaurant, which had warm tones and a lively atmosphere. <br><br>We started with the Malnati salad, which consisted of Romaine lettuce, tomatoes, black olives, mushrooms, salami bits, gorgonzola cheese, along with sweet vinaigrette and romano cheese. I liked all the ingredients except the olives. I enjoyed the salami bits which resembled the taste of crispy bacon. The vegetables were nicely fresh, the lettuce crisp and the crumbles of rich gorgonzola was so yummy. The sweet dressing was very good and dispersed evenly throughout the salad.<br><br>The deep dish pizza with buttercrust took approximately 30 minutes to make and we chose our own toppings: Chicken sausage, pepperoni, onion, mushroom and green peppers. We chose the small size, but it was still too much for us! We could only eat 1 slice and had to take the 2nd slice to go for later. <br><br>When the waitress came over with our pizza, she already started to cut it into pieces before I had the chance to properly look at it. I managed to take a photo of it though before she served it to us. As she was serving it, the cheese stretched and it was quite impressive to witness. Our pizza was chock full of all the toppings requested, incredibly cheesy with tons of tomato sauce, very buttery crunchy crust and thick. The flavors were strong and the ingredients mingled well together. <br><br>I had a good experience trying the deep dish pizza here, but I am not sure about coming back right away since I would want to other deep dish pizza spots!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/5__gf9ed0DCgA0QUDcwz5w/348s.jpg", "caption": "Deep dish pizza with chicken sausage, pepperoni, peppers, mushroom & onion"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/3K-FM7Bs1px6B6t2TZUCEQ/168s.jpg", "caption": "Me!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/83YNzy0wlKsUiFkyNNHEew/168s.jpg", "caption": "Salad with salami bits, mushroom, tomatoes, gorgonzola, olives & sweet vinaigrette dressing"}]}}, {"review": {"des": "2 stars for this pizzeria, plus an extra star because I liked their buffalo chicken wings.<br><br>I've had deep dish pizzas before (another chain called Uno's), so I knew what to expect and thought I was going to enjoy this place. We ordered two small deep dishes to share amongst the four of us--The Malnati Chicago Classic and The \"Lou.\" <br><br>The \"Lou\" came out first: mushrooms, spinach, sliced tomatoes and cheese. I was perplexed when I saw not only mozzarella but also cheddar cheese on the pizza. I always equated pizza with white cheeses so the yellow cheese was kinda confusing for me. The crust is made out of corn meal--I wasn't a fan of it because it was somewhat stale and crumbly. <br><br>As for the Malnati Chicago Classic, I found the center very liquid-y. The sausage had a funky taste and the tomatoes tasted like they came straight from a can. Needless to say, I could not finish my slice of the pie. <br><br>Deep dish pizzas are not for everyone, especially for Californians (as stated by a friend). Although I give thumbs down for the food, I give two thumbs up for the service! Our waiter was attentive and even helped us find the closest Mariano's grocery store that served gelato.", "pics": null}}, {"review": {"des": "We came here on a Friday at 11am with no line in sight! <br><br>Since we were visiting Chicago for the first time, we had to visit Lou's or so we thought. <br><br>We ordered: <br>The Lou (vegetarian) w/hot gardinerias and garlic: okay<br>The deep dish classic (non-veg): not much flavor<br><br>Be prepared that once you order it'll take 30 minutes to make the pizza. <br><br>Unfortunately, we felt that the deep dish/Lou Malnatis hype was overrated. I'd prefer a NY slice over a Chicago deep dish.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/2nn5BSWI-STssRE-ttlUOQ/348s.jpg", "caption": "The Lou"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/wBO_VKGmkdM0H9Z_22KCAA/168s.jpg", "caption": "The Lou"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Y4kqPCm7jPqchON7a5j6JA/168s.jpg", "caption": "The Lou + Deep Dish Classic"}]}}, {"review": {"des": "One slice is enough. So if there are only two of you, don't let your eyes be bigger than your stomach. Then again, you can always take the leftovers home. <br>We wanted to try authentic, Chicago, deep dish pizza so once again we turned to Yelp to see what was good. And as usual, Yelp did not fail us. The small pizza was big enough for the 2 of us.<br>We started with calamari, which was nice and crispy and delicous. <br> For pizza had \"The Malnati\" and was super happy we were able to substitute the sausage with chicken sausage and for dessert we had Tiramisu. Which was amazing as well. <br>Our server was busy, so we didn't really get the friendly service we like. Not much of a conversationalist, but she got the job done quick. <br>Overall, we were very happy with our Chicago pizza experience.", "pics": null}}, {"review": {"des": "Decided to try this place instead of Gino's or the other G...  one because they were open so late and closer to the hotel on a cold night and some great reviews.  Boy did I make the right call. <br><br>Amazing pizza. I love deep dish pizza when in Chicago.  Like no other but I also love a great thin crust pizza and they put did themselves on both. The cheese sticks were also amazing.  <br><br>Will be back.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/NQtZ-7sfC55BUK0ltqgK7A/168s.jpg", "caption": "Amazing deep dish"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/KzrY7dbv3fHaxlfnhQSoyQ/168s.jpg", "caption": "Thin crust"}]}}, {"review": {"des": "So I will give this place a 5 star just due to the wings. So my friend and I tried this place out first as far as \"deep dish pizza\"... in Chi-Town...so at any Lou Malnati's spot or any deep dish spot for that matter you can go ahead and order your pizza so it can be baking and then just have drinks and wait...we were seated in an appropriate time upstairs and our wings came out first before the pizza...the wings are the F%#@ bomb! You can tell the meat is marinated and seasoned and not just the skin which I love and so did my friend. That was the best part of our meal...the pizza was decent and Lou Malnati's has tomatoes on top of the pizza as opposed to tomato sauce at other spots and again it was decent...I would just go back for the wings if nothing else...", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/v89CzuUxX4ymWWFwacyBGQ/348s.jpg", "caption": "Deep dish with tomatoes"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/M_sjWoBh_leaUHHuyudRLA/168s.jpg", "caption": "These were fire!!!"}]}}, {"review": {"des": "Landing in Chicago the one thing I wanted to do was try a deep dish pizza. Staying at the Hilton Chicago I was able to walk two blocks to try Lou Malnati's. So here we go. <br><br>When we arrived there was a 25 minute to be seated. But we were given the opportunity to pre order our pizza. I ordered The Lou (without mushrooms). We were told to order anything else once we were seated. <br><br>Once seated I ordered their BBQ wings and waited patiently for my deep dish pizza to arrive. The wings were some of the best that I've ever had. It was fried to perfection and the BBQ sauce had some sweet and smokiness that I really enjoyed.<br><br>The pizza was good. I also tasted my wife's cheese deep dish and there wasnt much of a difference between the Lou and the cheese in my opinion. It was very heavy as was expected and glad I had the opportunity to try it.<br><br>So, the question is, should you try it? Yea, you should. But there are other pizza places that I would try also. Furthermore, my rating is more a 3.5  but I rated it higher.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/fS6SKE_MbEged_BbLbg-oA/168s.jpg", "caption": "The cover of their menu."}]}}, {"review": {"des": "What's not to like about this place? Great food and great service! We ordered the trio dip and the Lou pizza. The dip was so rich and so worth the calories especially after the Chicago Marathon!", "pics": null}}, {"review": {"des": "Upon planning this trip to Chicago, we were recommended this place multiple times to enjoy Chicago style deep dish pizza. I'm not a huge fan of deep dish, but Lou Malnati's had multiple options to customize your pizza the way you like. Deep dish, thin crust, a variety of toppings, extra cheesy, extra saucey, etc. <br><br>They make your pizza fresh, so plan on a half hour from once you order to when you get your food. Everything tasted great and was super filling! My husband and I shared the 2 serving pizza and took leftovers.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Aeruozs93kk9y30uOadpbA/168s.jpg", "caption": "Stuffed Spinach Bread"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/K6jnwigjWdXE12IEhIkOqg/168s.jpg", "caption": "Stuffed Spinach Bread"}]}}, {"review": {"des": "The service was great and was really excited to have deep dish for the first time but little Caesars pizza had a thicker crust.  The wings were good and the calamari was tender but really disappointed that my pizza came out the way it did.  I wanted it to look like the pictures and to overflow with cheese, but sadly it did not.", "pics": null}}, {"review": {"des": "I am not from Chicago but this place was def a unique experience.<br><br>Came here for dinner on a Thursday night. It was very busy! 40 min wait for two people but they allowed tables to pre-order pizzas so the wait for fresh pizza was cut down once the group was sat. While we had to stand during the wait, they did sell some beer (including local craft beers) for patrons s during the wait.<br><br>As soon as we sat, the service was great! We pre-ordered the pizza so the cook time was cut down and we got out order with a short wait. Ended up ordering the Malnati Chicago Classic and added pepperoni. The pizza was great! Definitely a thick pizza with more of a thin tomato sauce. A lot of the substance was provided by the meat and the cheese (such a good cheese pull). Though not what I'm used to, I think this style of pizza was pretty good. The flavor itself didn't blow me away but pizza (and especially that cheese) put me in a happy place.", "pics": null}}, {"review": {"des": "First time at LMP, it was definitely average at best. The ambiance is definitely what you want when looking for Chicago pizza, but I've had better chi deep dish (Giorandao's). Not a fan of the giant tomatoes on top of the pizza. It was nice that you could pre order your pizza before you were actually seated. Only a 30 min wait which I expected longer for a frida night. Once seats we sat on the enclosed patio although heated it was still freezing. Weren't seated at an actual dinner table it was like a couch and 2 chairs and a coffee table very low to the ground (which isn't very ideal for people 6'5\" and above). Felt like I was eating ok za in my living room. None the less it was a good experience probably wont be back being there are a plethora of other options in the area. People do love this place though & I understand why. Just not for me.", "pics": null}}, {"review": {"des": "As someone that is used to NYC pizza, Chicago deep dish is amazing from Lou Malnati's. I ordered out to my hotel room when traveling and landing 6 hours late. The order came at the perfect time.", "pics": null}}, {"review": {"des": "I have heard great things about Lou Malnati's. I figured when I walked inside the packed lobby and found out about the 40 minute wait I figured it had to be true.<br><br>I decided to make my order to go, no point in tying up a table for one person. I ordered a small deep dish. I was told 20 minutes. After 35 minutes of watching people push each other around the lobby my pizza was done. I walked it 1 block back to my hotel room. <br><br>I was disappointed by the flavor. I've had other Chicago deep dishes and this one was lacking. The sausage was not seasoned to my liking. The cheese blend lacked flavor, and the crust was bland. The sauce was good, I'm glad they put it on top as it was the highlight of the pizza.<br><br>I can say I tried it, and I can say it didn't live up to the hype.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/-Vib09HCSZqJHKRkaNVHSQ/168s.jpg", "caption": "The to go registers."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/rGFyq0XdLOLt_eLxomK8YQ/168s.jpg", "caption": "The pizza"}]}}, {"review": {"des": "Although it is somewhat of a chain restaurant I had to try the original Lou Malnati's. I arrived early and there was no wait by the time we left there was people piled in and waiting outside on the sidewalk. The pizza was good and the crust was even better. Everyone like this pizza better than Pequods and the competitors. It was deep dish heaven and I enjoyed every bite.  The big controversy in Chicago over which has the beast deep dish is very easy to solve. Try one at each of the big three and decide for yourself. There are subtle differences in sauce, crossed, cheese, and toppings. But overall the concept is the same.  I would not hesitate to recommend Lou Malnati's.", "pics": null}}, {"review": {"des": "I've asked a couple of locals for their opinion on the best deep dish pizza, everyone said Lou's or Giordanos. My pick? Lou's. <br><br>Lou Malnati's - Best deep dish pizza in Chicago alert! <br><br>I've had a fair share of my deep dish pizzas during my stay in Chicago and Lou's is by far #1 on that list. <br>The quality is what I'm always looking for in my food and Lou's comes through! I had the vegetarian deep dish, the calamari, & spinach bread. <br>Omg! Everything was amazing! Yes the pizza does take long but while you're waiting for a seat, it'll be out by the time you settle. We came during lunch time, so service were a bit slow, but I understand the situation. <br><br>Food def makes up for it! <br>The spinach bread is really interesting and something you could only experience here. There's nothing like it. It's creamy, cheesy and satisfying. <br>The calamari were fresh. Seasoned and fried perfectly! That sauce is completely addicting and I keep thinking about how good that was. Def would love to be back here for some good ol pizza when visiting Chicago.", "pics": null}}, {"review": {"des": "In Chicago for the day I knew pizza was my must have food. Since we were doing a river tour later that afternoon this Lou Malnati's location made sense. I arrive probably around 12:30, and approached the hostess. I knew there would be a wait, especially considering that it was a weekend and getting to be lunch prime time. She explained to me that the ait was about 45 minutes and took my name. At that point I was to go up to the register and place my order. Since Chicago pizzas are so thick this is a long baking situation, so they get things going for you even if there is a wait time, so you're not sitting at the table for the 40+ minutes it takes to bake a deep dish pizza. I placed an order for \"the Lou\" and opted for the butter crust as the cashier stated that's what they are known for. They do have a bar inside, but it was a pretty busy, so I stepped outside to see what else was around and ended up at Pink Taco for my wait time. They had taken my phone number and have a system that texts you when your table is ready, so walking down the block a little wouldn't be an issue. I got the text in a little less than the 45 minutes quoted wait time and we headed over. We were seated upstairs but the window, which was nice.<br><br>Our waitress was friendly and we started with a calamari and a spinach bread app. Both good, but honestly you probably don't need apps, unless you're really starving...or maybe I should have done a salad because in the end it was just a lot of bread. Despite placing the pizza order ahead of time it was still a little bit of a wait, but apps and wine kept us occupied. When the pizza arrived the waitress served it. It is a deep dish, with lots of cheese. The Lou includes veggies as well (mushroom, spinach, tomatoes) and overall I really enjoyed it. Being a New Yorker it's different for me to do pizza this way, but when there is that much cheese involved its hard not to like it!<br><br>I say Lou's is as good a place as any to get your Chicago pizza experience. They do seem to have that touristy presence (I can't judge, I was a tourist) but that also means they have the system down and are used to handling the crowds, so overall no complaints from me.", "pics": null}}, {"review": {"des": "TL;DR - It's pizza, so it's not bad, there's just better.<br><br>The Setup - 3/5 - Realistically, it's probably the best it can be given the popularity and the lead time it takes to prep a pizza.  Step 1:  Go put your name in at the Kiosk on the left.  Step 2:  Go order your pizza at the registers in the middle of the waiting area.  Step 3:  Wait for your text to say your table is ready.  Step 4:  Eat pizza.  I had ordered my pizza before putting my name in (rookie mistake).  Luckily, I noticed and a crisis was averted.<br><br>The Pizza - 2/5 - Maybe it's just a preference thing, but I found the pizza just okay.  The sauce was a little too sweet for my liking and while I finished the pizza, afterwards, I just felt like I ingested a ton of calories for not a lot of enjoyment.  It's hard to find a bad pizza and hard to find a great pizza.  This falls into the average category.  Of the major chain Chicago pizza's, i prefer Giordano's.  <br><br>Ambiance - 3/5 - Classic pizza parlor feel.  Despite it's immense popularity and huge lines, the tables aren't too crowded together which I appreciated.  <br><br>Service - 3/5 - Average.  Got the job done, but did not stand out.", "pics": null}}, {"review": {"des": "When I was researching good eats in Chicago, all I could find was the Deep Dish Pizza, and I knew that I had to get one from Lou Malnati's! The pizza itself takes about 30 minutes so we had to entertain ourselves with a Caesar Salad to start. The Caesar here is awesome! And I especially appreciate that the server prepares it for you tableside.<br><br>Now for the pizza, it was heaven!! Lou Malnati hosting my first ever deep dish pizza experience was a delight! It did feel rather sinful to eat pizza with a fork and a knife, but its just way too much to eat with your hands. It's almost barbaric to do so. One thing that I can't forget is how tasty the sausage was on the inside. The sausage to me made the whole pizza. I feel like because we live in California, we are missing out on such a magnificent delicacy! What a great first time experience!<br><br>On a good note: we had one slice for leftovers. We didn't eat the slice until 2 days later, and it was still damn good! Pizza is done right in Chicago. I can fly out here any day for a slice.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/BxZE3aaf0zdA-9w4ww8l4w/348s.jpg", "caption": "Malnati"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/qCJCvZeY7BMYvH1Cw_Vhqw/168s.jpg", "caption": "Malnati"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/FcNJB9dNvzHAI744Bhkusg/168s.jpg", "caption": "Caesar Salad"}]}}, {"review": {"des": "Solid, always. I always come to Lou Malnati's, and I'm always satisfied. The Chicago classic (sausage pizza) is amazing. If you're a tourist reading this deciding which deep dish place to go to, go here. I moved here recently, and this is by far my favorite one.<br><br>To begin with, this location gets incredibly busy so be prepared to wait or go during an off peak time. Deep dish pizzas are special and you should expect to wait half an hour at a minimum for it. Call ahead to get your pizza started if you can. They allow that sometimes.<br><br>I ordered the calamari here and it's alright, but let me go into detail about the Malnati Chicago Classic. For starters, sometimes deep dish gets a bad rep because it has too much tomato sauce so ask for light sauce. Once you take a bite, you'll love the butter encrusted bread topped with cheese and a generous serving of sausage each bite. Generally, eating the crust is a drag, but this one is so delectable you'll wish the entire pizza was crust. Trust me you'll fall in love with this deep dish and will never order from another place again.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/_MuEWsLgcbcqjhCIsmAcbw/348s.jpg", "caption": "Calamari"}]}}, {"review": {"des": "What a fun named restaurant. If only they added an \"El\" or something, then it'd be pronounced \"illuminati\" lol! <br><br>We were in Chicago all week and didn't get to try any deep dish pizza yet so we made it a goal to have some before our flight back home. <br><br>We came here before the dinner rush and asked to sit at the table closest to the window. There were a lot to people coming in and out to pick up their carry outs.<br><br>Pizzas do take a while to make, come bearing in mind it'd take at least 40 minutes. We were going to get two single size of their signature pizzas but our waitress let us know that it's actually possible to get a single size with half half! What a life saver because that was just the perfect amount of food for us. 2 fat slices of pizza each.<br><br>It came in a deep dish skillet that the server cut and served in front of us. The depth of the pizza was amazing but the crust definitely trumps everything about this pizza. I've had \"deep dish\" pizza in California and it's always soggy but not the pizza here! Every bite of crust was crispy and delicious. I'm drooling just thinking about it.<br><br>The Lou - OMG, so delicious, I actually wished we got a whole pizza of just this but we wanted to try the other one too. I love the spinach and fresh tomatoes. So fresh and delicious. <br><br>The Malnati - this one is definitely the heavier of the two. It was delicious at the first few bites but the amount of cheese and meat was a little overwhelming for me. Definitely geared more towards meat lovers. It was delicious but I need me some veggies for balance.<br><br>Will def be back next time I'm in town to get a whole Lou pizza!", "pics": null}}, {"review": {"des": "It's the best, really nothing else you can say. Cold beer, deep dish, homemade ranch and marinara. Always worth the wait.", "pics": null}}, {"review": {"des": "Another must do while in Chicago was to have myself some true Chicago deep dish pizza.  A quick search of the area and we came upon this place.  <br><br>When we arrived, this place was packed and getting more packed by the second.  I think that might have been because of the football game ending nearby.  But most likely it was because of the reputation this place has.  Even though they were busy we were seated promptly and given our menus to look over.  <br><br>Once our server arrived and asked if we had ever eaten there before he went into an explanation that is somewhat explained on the menu itself.  I did not care that I would have to wait for a crust that was going to be freshly made.  In fact that was what enticed me to get a deep dish pizza.  <br><br>I also decided that I wanted to have a salad and asked for a house salad.  What I didn't know was how big a side house salad is here.  It's enough to feed four people let alone one.  I'm not complaining there, but wow, it was not expected.<br><br>Then the pizza arrived.  At first glance at this thing it reminded me of the pizzas they use to serve during school lunch, but only in looks.  The taste of it was amazing.  This little thing contained so much flavor that I was overwhelmed.  Overwhelmed by the fact that I had ordered too much good tasting food.  Knowing that I was to leave the city soon meant that it was all for naught.  It was pointless to try and take all this with me.<br><br>Great service here and I can see why people love this place so much.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/UHU_m4l6LCa2F9EfV0MyEw/168s.jpg", "caption": "The Malnati personal deep dish."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/dHSKQCD0nX4Zsq7ouErsfQ/168s.jpg", "caption": "Individual house salad"}]}}, {"review": {"des": "Not really impressed with the atmosphere but my local friend likes it and had to go have lunch here.   The pizza is very good but my lunch special salad and a 1/2 chicken sandwich was not good.  Giving it 4 stars for my friend's pizza and soup....don't bother for the salad and chicken sandwich..", "pics": null}}, {"review": {"des": "Great pie.   <br><br>We went with the Classic (sausage pizza on the buttercrust) and a house salad. <br><br>The individual house salad is perfect for 2 people.   The family size is probably for 4 or 5 (it's huge).  <br><br>The sausage covers most of the pizza.  It's not like some clumps of sausage sprinkled across the pizza.  The crust was deep dish, but thinner than the competition.   It was good. <br><br>I would have no problem going to Lou's for pie and salad again.", "pics": null}}, {"review": {"des": "Even people from out of town know of the rivalry between the two great Chicago-style deep dish pizza giants. I chose Lou's, as it was closer to where I was staying, plus I had heard many people who rated it to be the best deep dish in Chicago. <br><br>I don't get it. This pizza is so simple yet so complex. Sausage, cheese, and tomato sauce. That's it, yet there was so much texture, flavor, and melty cheese. I could try and try to recreate it but I wouldn't be able to do it. The tomato sauce tasted like straight up wine. The sausage remained in tight medallions despite being simmered in the sauce. The crust was paper thin yet held up to the weight of the toppings. Seriously good stuff. I can't wait to visit again.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/JmAs7VwfHmH3ik3tXiG6oA/168s.jpg", "caption": "One medium and a small"}]}}, {"review": {"des": "Not being from Chicago, my idea of deep dish was Pizza Hut but after a bite of Loh Malnati's, I can never go back to anything else!<br><br>The first night we landed in Chicago, we headed over. There was one that was right around the corner from our hotel (perfect for walking off the pizza right after!). Surprisingly, for a table of 6 of us, we were seated within 5 minutes. Between 6 of us, we split 3 pizzas (and had some leftover for the night - which tastes just as good cold!). <br><br>My favorite was the pan pizza with sausage, pepperoni and green pepper. The ration of the bread to the cheese to the toppings was perfect. Too much tomato gives me reflux but this was the perfect amount. We also got The Lou but I didn't like that as much - I felt that it had too many toppings. The butter crust is a must!<br><br>They have frozen pizzas which you can also buy. Maybe next time!", "pics": null}}, {"review": {"des": "This pizza was worth the wait! It was my first experience with Chicago style pizza and I loved it. We waited for almost an hour, but were able to pre-order our pizza. Once we were seated, it did take a while for a server to come to us, which seemed to be a consistent theme- service was very friendly but slow. We ordered wings, and our pre-order was the special: a sausage pizza on butter crust. The wings were really good! The sauce was very flavorful and just the right amount of heat. The pizza was great as well. The crust was very buttery and delicious, maybe could have used a touch more salt. The sausage was yummy and was pressed into the pan over the dough so you got sausage in every bite. I would absolutely return if I am in Chicago again, although I might try to go at non-peak hours :)", "pics": null}}, {"review": {"des": "Famous Chicago Deep Dish Pizza! When in Chicago...you must try it! The one down side to this was the busy downtown area. About a 45 minute wait time. BUT, it is really cool that you can see your place in line via smartphone. Back to the food-DEE-LISH-US pizza, large portions, yummy wings and salads. It's everything you want in a pizzeria. It's not a fancy pants place but a traditional pizza place close to Lake Michigan in the heart of Chicago. Now whether you believe deep dish is real or not, is up for you to decide. I believe it's just really REALLY good tomato pie.", "pics": null}}, {"review": {"des": "Once again, a fabulous time at Lou Malnati's. My husband and I were visiting Chicago for the weekend and knew we had to hit up some chicago-style deep dish pizza. We had the unfortunate event of deciding to go to dinner around 8:30, approximately the same time as when a local sporting event let out. We showed up in the Uber to find out there was a 45 minute wait, and people crowded around the outside of the restaurant. We went in and checked with the hostess who explained we could actually pre-place our order while we waited for a table, which was amazing because their pizza usually takes 30-45 minutes anyways. We went around the corner to a divy drinking hole and got a few drinks. They had a site/application where the customer can see when their table is available and how many parties in front of them. This was great because we could make sure to arrive back in time for our table to be ready! Yay technology!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/FnEYaLE2Ll8t9XK7hzLpzA/348s.jpg", "caption": "Cheese pizza"}]}}, {"review": {"des": "My favorite place for classic Chicago deep dish pizza. I've been to UNO's and Giordano's which are both very good but I keep coming back here, which says something. The wait also says something. <br><br>My favorite is the Malnati Chicago classic. Simple but delicious. A slab of Italian sausage with cheese and tomato on a butter crust. One or two slices is plenty for a meal. <br><br>Service was great as usual and luckily the wait was non existent which was a first for this location. We came around 4:45 PM and two of us were seated right away. When we finished at about 6 there was quite a group of people waiting. Go just a little earlier than traditional meal time (or anytime in the off hours) to avoid the wait. It usually takes 30 or so minutes once your order is placed to get your deep dish as they make it fresh with the order, so be prepared. If you're starving they have a good selection of appetizers to hold you over. <br><br>Do yourself a favor when in Chicago and get you some great deep dish.", "pics": null}}, {"review": {"des": "Amazing deep dish pizza. Service is good and quick but prepare to wait when you get there. We did only about 30 minutes but they have a bar to keep you busy. It's one of the Staples of Chicago where you must stop in if in the area.   Really good appetizer menu as well as desserts. I strongly recommend this place", "pics": null}}, {"review": {"des": "This is a 5 star review from a New York pizza snob that previously despised deep dish pizza...<br><br>Last time I was in Chicago, I ate Giordano's pizza and strongly disliked it. It's basically a pizza casserole- a ton of bread and cheese, but didn't really resemble pizza to me. But I was determined to try Chicago deep dish again, and Lou Malnati's was strongly recommended, so I gave it a shot. I had NO idea that there was a difference in the type of Chicago pizza, and Giordano's is a stuffed deep dish. Who knew?<br><br>When I got to Lou's, I was really put off by the crowd. It seemed like everyone and their mother was waiting to be seated. We put our name in and was told it'd be an hour, but I really like how you place your order  right there so the pizza can be ready for you when you are seated! The wait took the entire hour, but it was nice being able to see where we were at in the queue by checking on our phone, so we could easily kill time by walking over to the fountain.<br><br>OK, regarding the food, I absolutely loved the pizza! It is COMPLETELY different from the stuffed pizza. It's deep dish, but that only means that the crust is tall, it's not 3inches worth of dough and cheese. The crust itself is not overly thick at all. A very unique pizza, for me, in the fact that there was an entire layer of sausage on top of the pizza. I assumed there would be some sausage sprinkled on top, but the entire pizza had a layer of sausage! Plus, the crust was incredibly crispy, which I really appreciate it (because if you didn't catch a theme by now, that's completely different from the stuffed pizza). Lou Malnati's convinced me that I actually love Chicago deep dish pizza, and I am officially able to admit it.", "pics": null}}, {"review": {"des": "Phenomenal service, great recommendations, and the BEST deep dish pizza I have ever had. All in all, the iconic Chicago deep dish experience that I was so pleased to share with my friend who was visiting. <br><br>Deep Dish<br>A flaky, buttery crust. California plum tomatoes, sausage, Wisconsin cheese, and you have a hit. Lou Malnati's has not strayed from its recipe for 40 years, and I can see why. My friend and I split a personal size pizza, paired with some thin crust, which was a perfect portion size.<br><br>Thin Crust<br>To complement the deep dish, we ordered a small thin crust pizza with mushrooms and sausage. They only have the plain cheese thin crust pizza, and you can choose whichever toppings you'd like, with price points for the amount of toppings you choose.<br><br>I will take whichever of my family and friends who visit Chicago to Lou Malnati's, although I have yet to explore other locations.", "pics": null}}, {"review": {"des": "I had the Malnati's Chicago Classic and Wings w/ a kick and Gorgonzola dressing delivered to my hotel. The service was quick and the pizza was the best I've ever had.", "pics": null}}, {"review": {"des": "Deep dish pizza's rule!<br><br>During an unplanned, but fun day trip to the city a short while ago, we made one thing certain. Lou Malnati's could not be bypassed. Even if we were still kinda full from lunch, we had to go. No matter how long the wait was going to be. That said, how was this review overlooked?!<br><br>Don't be intimidated by the huge crowd of people waiting both inside and out. Not all of them are waiting to dine in. Either way, the line moved much quicker than I expected. Granted, the wait was about an hour, but if you saw the crowd, you'd probably guess longer.<br><br>First thing to do is to check yourself in with the hostess. She'll ask for a cell number, then she'll send you a text with a link to click on, so that you can check on your status real time. This actually kept me quite entertained until our turn was up. I have a simple mind, so I'm easily amused.<br><br>Surprisingly, once you get seated, it seems like any other \"normal\" restaurant. You would never guess that there's a mad crowd on the outside and in the foyer area. I was expecting to be rushed and with possible sloppy service. But, no. Not at all. Service was great!<br><br>The pizzas do take time to cook. I'd say about 30 to 45 minutes depending on what you order, so it's best to know what you want ahead of time so that you can order as soon as you sit. Or preorder it when your turn is near. So we ordered a small Chicago Classic with a Butter Crust just before our number was up and ordered a thing of wings once we got seated.<br><br>The wings were average, but really, we were there for the pizza anyway, so who gives. There's no better deep dish pizza in my opinion. Ours had Italian sausage, vine ripened tomato sauce, and lots gooey cheese. And that butter crust. Not grease ladened like other deep dish pizzas you may have had before. A must have.<br><br>Definitely going back again someday when I return to Chicago!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ygMHovIScZptb7BFP2s3MA/348s.jpg", "caption": "With more cheese and chili pepper flakes"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/NOEjfWrj57pEAsNeoQhjVQ/168s.jpg", "caption": "Small Malnati Chicago Classic with Butter Crust"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/_U9Gu42ZjYMd0cb4AnmDsQ/168s.jpg", "caption": "Cheeeese"}]}}, {"review": {"des": "First trip to Chicago and came in here to try the famed Deep Dish. We were seated promptly for Thanksgiving lunch and I was impressed by the 70s booth like area. I guess, I am an old soul in a way. Got the bruschetta and Lou Spinach deep dish. We were super hungry and the bruschetta was yummy. The deep dish takes some time to come out but was good. I was actually surprised they had a veggie option. And a spinach one at that. The food was 3 stars but the service deserves an extra star.", "pics": null}}, {"review": {"des": "We had a high expectation for this place. But, pizza was just alright. The butter crust was under seasoned. We ordered \"the classic\" and \"Lou\" (vegetarian). Both are just okay. We were not wowed at all. We were however, had to blinked then opened both eyes big when tasted Malnati's salad. It was different and absolutely delicious. Anyway, SF Bay area has Patxie. Although Patxie doesnt have a history like Lou's Malnati, it definitely can stand its ground.", "pics": null}}, {"review": {"des": "Ok, So when heading to Chicago you will find that there are Lou Malnati's people and Giordiano's people. After this experience, I'm team Lou! The restaurant wasn't over crowded for our lunch time visit. We also were seated in 15 minutes, although it wasn't a lot of waiting area (I went outside). <br><br>Once seated, our server was warm and friendly. She had already checked on our pre-order and helped us decide on a salad to start. The Ceasar salad was delicious and the croutons were warm and tasty. Everything was well timed and our pizza arrived shortly after we finished our salad. I didn't get a picture of it because our server divided up our slices while we were there. But trust me, it looked yummy! We did the veggie pizza with chicken sausage added. <br><br>The pizza itself was delicious and not over filled. The crust at the bottom of the pie was as crispy as the sides of the pie. The crust was also not too fluffy and had a cheese flavor to it. I loved it!  I had 2 slices and was still ready for the day, so no guilty feeling afters helped this review too!", "pics": null}}, {"review": {"des": "We only had one evening to visit Chicago on a recent trip to Illinois, so we wanted to make the most of it with some of the city's best deep dish pizza. Lou Malnati's was recommended by a few friends, and had overwhelmingly positive reviews on Yelp and Google so we decided to give it a go-- glad we did!<br><br>There are other items on the menu, but the pizza is definitely the star attraction here. We went with The Malnati Chicago Classic (sausage, cheese, tomato sauce on Buttercrust, $16 for a small). It was hot, gooey, and delicious! The crust was fantastic, but the molten cheese definitely definitely made utensils necessary. A very different experience from the pizza that I'm used to-- which is exactly what we were looking for and not disappointed.<br><br>What was disappointing, however, were the beer selection and the salad. Lou's (this location, at least) doesn't have any draft beers at all and only a few options for bottled brew. Also: the salad (we had the Malnati Salad, $10) tasted moldy to me. I think that's just a personal preference thing though; I can't stand bleu cheese because it tastes like mold and that's what this salad tasted like. My dining partner likes stinky cheese, though, and enjoyed her portion of the salad.<br><br>Our server was great, and the dining room was pleasant enough. All in all, not a bad place to grab some authentic Chicago pie!", "pics": null}}, {"review": {"des": "Makes we want to start pointing, great pizza...I'll start barking for some extra garlic!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/bMqRszesg2mN7EcKvba_tA/348s.jpg", "caption": "Great pizza...I am still barking.   I started pointing as I ate!"}]}}, {"review": {"des": "This dining experience was everything! The food was great and service was very hospitable and warm. Getting seated could be a solid minute so arriving be sure to plan a 45mn gap so that you get seated when you will be hungry. The phone alerts are an amazing system, you can go walk a bit and maybe enjoy what literature you can peruse and Barnes n Nobles next door. <br><br>The interior decoration is well displayed with its industrial and rustic feel. The evening lighting has a dim yellow glow and is hits that cheese with the perfect ambiance. <br><br>Our party ordered some appetizers. We had the buffalo wings, mozzarella sticks, and some fries. The buffalo wings were tender and savory and went well with the ranch they provide. The mozzarella sticks were nice and hot and the cheese drips just right when you bite into it. The fries were also nice and crispy. <br><br>For the main plate we got a large deep dish pizza perfect for our table of 5. Definitely would have served an additional person but leftovers are always a win. The pepperoni, sausage, jalapeño, and mushroom made the winning combo. Get your pizza well done because you can definitely savor the butter crust the best at that point. <br><br>Was slightly disappointed that they only had one stout option for beers but can't complain. I came to a pizza place looking for more than one stout to consider sipping on. Will definitely return in the near future!", "pics": null}}, {"review": {"des": "Yes, even this California girl liked their Deep Dish Pizza. <br><br>Service was excellent for this type of fast casual place. We were seated immediate, and (because we were baking in the sun) they were able to move us to a different table at our request. We read reviews and the menu and knew that the pizza would take awhile, so we hunkered down and chilled to wait for the pizza. <br><br>Protip, your hotel/concierge might have coupons to this place, so check with the front desk before you head over. We found out after the fact that we could have gotten a free bruschetta. <br><br>The pizza was AMAZING, we got the Lou with added sausage, and it was perfect. A lot of veggies, but super flavorful sausage to balance it out. The crust was a little too yeasty, so I think it would have been better with the butter crust. <br><br>Overall, amazing! If I'm ever back in Chicago I'll be visiting again.", "pics": null}}, {"review": {"des": "Of course we expected this place to be crowded, especially because we came before a concert like many other folks in the area. It's great that they have a system down for ordering your pizza ahead of time before you're seated. That way you're not waiting as long. Though, the wait did still feel rather long. <br><br>We ordered wine when we first sat down and sipped on that for a while. To start, we ordered a salad and the stuffed spinach bread. We expected them to come out much earlier than the pizza, but our table quickly filled up since we pre-ordered. <br><br>The three of us ordered personal sized The \"Lou\" with spinach, mushrooms and sliced tomatoes with their popular garlic buttercrust. It was four slices, and honestly each of us could only eat one, especially after the spinach bread. We didn't regret it though because we all ended up loving the spinach bread more than the famous pizza! Not sure if the sausage version would have been better, but one of my friends doesn't eat pork. <br><br>All in all, we are glad we came for the Chicago deep dish experience, but I'm definitely going to try somewhere else for reference next time I come.", "pics": null}}]}