{"name": "lou-malnatis-pizzeria-chicago-8", "reviews": [{"review": {"des": "I love a good pizza, but sometimes actions speak louder than words: you know I'm really into a pizza when I can't stop stuffing my face with it. Case in point, Malnati's.<br><br>Line is long, and yes, is worth it. Luckily, we only waited 30 minutes before being seated. We got a family size Malnati's salad so we would starve by the time our large Malnati Chicago Classic deep dish came. They seriously don't play when it comes to portions: that salad could make a dinner-sized salad for 4 people. I had to put the brakes on my salad consumption so I would have room for pizza, but it was that darn good. I definitely recommend getting it!<br><br>As for the pizza, it was everything you could ever want and more. A magical, buttery crust, delicious sausage, all riding the deep waves of a sea of cheese.<br><br>I think I had 3 slices, and zero regrets about it.<br><br>Can you come to Florida already, Malnati??", "pics": null}}, {"review": {"des": "We had tried Giordano's for our very first meal in Chicago as it was right across the street from our hotel. After we met up with a friend in Chicago, she immediately recommended Lou Malnati's instead of Giordano's...and since she was the Chicago native, we just had to give this place a try!<br><br>We made our way here with our newborn baby and had a super awesome meal! The service was great and the servers were friendly - wait time actually wasn't too terrible and the pizzas were very delicious! (the only thing was that they didn't do the cool cheese belt like our server at Giordano's did, haha!).<br><br>After having had both Giordano's and Lou Malnati's, we were pretty torn as they were both good! We decided to give this place one more star than Giordano's as the flavor was definitely more on point at Lou Malnati's. We will definitely be coming back for our next visit!", "pics": null}}, {"review": {"des": "Lou Malnati's was my first deep dish pizza stop in Chicago.  It was good, but surprisingly not as good as I expected.  I have tons of friends who love this place, so it's probably just a personal preference that I was not super excited about it.  First, the restaurant itself is fantastic and our servers were beyond amazing.  They were attentive and so friendly.  <br><br>The pizza itself has a corn-like crust taste, which was good, but not my preference.  The tomatoes are amazing and the meats are super fresh.  It was good, but did not blow me away.  The mozzarella was also very delicious.  The pizza takes about 45 minutes, which is standard and they had the TVs going to make the time pass quickly.  Overall, the pizza was good, but I prefer a non-corn based crust.", "pics": null}}, {"review": {"des": "So when you think of Chicago, you synonymously imagine The Bean and at least one dining experience with Deep Dish Pizza. I was determined to make this happened and I kept asking around like a maniac where to eat. It was a clear winner from multiple folks to try Lou Malnati's. <br><br>TL/DR Just come here and get the damn pizza. You'll be crying tears of joy<br><br>(Now I'm no conspiracy theorist but Lou Malnati's and Illuminati sound the same, so it makes sense why it was truly some of the best pizza I've ever had)<br><br>If you're looking to grab a bite here without a wait WHATSOEVER, come during the 2/3pm hour on a weekday. This was the sweet spot and we were able to be immediately seated.<br><br>You know this place is a staple in town, when the restaurant has a FREAKING conference room folks can rent out. I'm actually quite sad my own conference was held here. I would've willingly ate deep dish pizza and the rest of their menu for three days in a row.<br><br>Now I hadn't eaten all day and I like to pretend I'm on the intermittent diet full time. I took it upon myself to eat all that I could in a short period of time. To my fellow Yelper, Rebecca W, thank you for not judging my eating lol.<br><br>Our waiter told us that the wings were a must and we placed an order for the Honey BBQ wings. HOLY CRAP the breading on these wings and THE SAUCE. THE SAUCE won me over. These wings were so good, I literally ate all but one. Because sharing is caring so Rebecca had one...<br><br>This was a good way to hold us over because they make all of their pizzas from scratch and you have to allow a solid time window for this magic, ooey-gooey, cheesy bliss stuffed with toppings to come out in it's natural perfection.<br><br>We decided to go for their classic deep dish pizza with a small since it's good for two people. Or in our case- 3/4 for one person and one slice for the other. The classic has lean sausage, a buttery crust, and extra cheese, not to mention their signature tomato sauce. We added pepperoni and it gave it that much more depth. <br><br>Every bite you have from their deep dish will have the right portions of toppings, cheese, and the buttery crust goodness. It's also nice how the server cuts a slice per person and serves you when it first comes out.<br><br>I can rave on-and-on about this but come check it out for yourself.", "pics": null}}, {"review": {"des": "One word: WOW! <br><br>Probably the best deep dish pizza I've ever had in my lifetime. Only negative I could think of is the long wait for the freshly prepared pie from the heavens.", "pics": null}}, {"review": {"des": "I love love love this pizza so much, however the service that we (three of us) had tonight on a Monday night was absolutely horrible. First off, we ordered a pizza when we put our name in for a table which was great considering it takes about 30 min for deep dish and our table wait was only 15 minutes. Finally we get seated at our table and wasn't welcomed for another twenty minutes. <br><br>We then put in an order of a large Cesar salad and a glass of wine and a beer. I also asked for sides of ranch for when our pizza comes out. Flash forward to ten minutes later and another woman brings out of pizza. The three of us finish our slices, still don't have water cups, still don't have the Cesar salad and still don't have the beer or wine we ordered. We asked three other servers in our section for water and no one helped us. I kid you not, we didn't see our waiter once. He never came to check on us, never brought water, never brought ranch. Finally we gave up and asked another woman where our drinks were. By the time we were done with our pizza, the salad and drinks come out. Literally 45 minutes later of waiting. Never brought us ranch too. <br><br>It wasn't until we asked for our check and boxes that he came back around. Literally only came to our table twice. It was absurd and thankfully we had gotten their early or else the two people I was with would have missed their flight. I will absolutely never be going back to this location and will order for delivery for now on. I've never seen such terrible service before. It's honestly such a shame because this is my favorite Chicago pizza place and I love bringing visitors, but their service has got to get it together. We even saw tables around us shaking their heads and having to go up to the bar to get drinks because every waiter was MIA.", "pics": null}}, {"review": {"des": "The pizza here is good.  The environment was upbeat.  Service was good.  The wait was long, but expected.  <br><br>We ordered a medium classic pizza.  There were two of us and we were not able to finish it. <br><br>Delicious.  Will return when i'm back in town.", "pics": null}}, {"review": {"des": "Chicago = Deep Dish.  Theres no getting around it.  We've ordered delivery from Lou's many times and even after waiting an hour our pizza is always hot, cheese, and delicious.. I truly believe that the cheese is what makes this pizza better than the other deep dish options in Chicago.<br><br>With family in town over Labor Day weekend, we decided to dine in at this location (we felt it would be less busy than the River North or Loop locations).  It was a Saturday night and the wait, as expected, was around 90 minutes.  Fortunately there are a bunch of bars nearby that you can grab drinks at while you wait.  The hostess gives diners the option of putting in your pizza order early so it'll be ready when you get seated. When my mom and I walked over to do that, our table was ready, 45 minutes early! Making this experience even better.  We ordered the family sized Malnati salad and a large \"The Lou\" pizza and it fed the 5 of us comfortably.  We will be sure to come back with out of town visitors to enjoy a pizza and the fun atmosphere.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/2JYWxgHw6BwXvzErOdCZiQ/348s.jpg", "caption": "Malnati's delivery.  Just as hot and tasty as it is while dining in."}]}}, {"review": {"des": "First time here and will definitely be back.  Service was great.  Ordered the Malnati's Classic & added pepperoni & mushroom.  Sauce was not over bearing and crust was delicious.  Small size is enough to give two people...two slices each, which is plenty.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/IOroqm4wNzcjvAP2wKYWYg/168s.jpg", "caption": "Malnati's Classic with Pepperoni & Mushrooms added"}]}}, {"review": {"des": "I LOVE this pizza!! This is my first time having Chicago deep dish pizza and I honestly can't believe how perfectly they created this simple cheese pizza. The crust wasn't too hard and the cheese was perfectly stringy. The tomatoes were fresh on top and piping hot. Even the chocolate chip cookie pizza was perfectly cooked, not undercooked and not overcooked. The only thing that sucked was that the pizza takes 30 minutes but honestly worth the wait!!", "pics": null}}, {"review": {"des": "Good traditional style deep dish pizza. Open late. Granted it takes a while to make, but they warn you of that upfront. Definitely worth it. Ordered the Chicago classic and while I'm sure the other ones are fine, this one was well worth the wait. This place will be on my list when I head back to Chicago.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/jJ4E1qfgi7YRzah-AWbFnA/348s.jpg", "caption": "Late night deep dish"}]}}, {"review": {"des": "Great atmosphere, service was fantastic (sat at the bar).<br>The pizza is definitely worth the 30+ min wait from the time you order, absolutely incredible. The crust met my expectations from all the reading on the place.<br>Would give it a 5 if the wait for an actual table was under an hour, and for more cheese on the pizza to make it perfect!", "pics": null}}, {"review": {"des": "We stopped by Lou Mannti's almost as soon as we got into town. Fortunately for us, this was the closest pizza spot to our hotel. We came in here at about 9pm on a Thursday night and were seated immediately, which is always great. Our waiter was immediately attentive and remained that way through our whole stay. <br><br>Of course, we ordered a deep dish, but because we knew it would take a while and I was HUNGRY we got calamari to enjoy while we waited. And enjoyed it we did. We LOVED the house cocktail sauce which was chunkier than most other cocktail sauces which I was a huge fan of. <br><br>Once our pizza came, we immediately dug in. For me, it's hard to me not to enjoy pizza because I love hot cheese. Really. Give me hot cheese and I'm happy so Chicago style pizza is my jam. The cheese, meat, and sauce did not disappoint. I was bummed I hate eaten so much calamari so I could only have one slice. I wasn't a huge fan of the butter crust because I prefer a flaky crust, but that didn't bother me too much, the only difference it made to me is that I didn't eat the crust once I finished my pizza.<br><br>All and all, this location was awesome and the service was above par.", "pics": null}}, {"review": {"des": "Ordered the \"Chicago Classic\" at this Chicago classic pizza place. Was not disappointed! It is superb deep dish pizza, made lovingly, with lots of great Italian sausage, layers of mozzarella cheese, and a slightly sweet but full bodied sauce. The crust is outstanding, too! This has to be my favorite Chicago pizza to date.<br><br>Took a tip from other Yelpers and had the fried cheese sticks while we waited, because it does take a while for a pie of this magnificence to bake, like 30 minutes. They were OK, a little bit under cooked, still a tad firm inside. <br><br>Service was on point, and I'd say this was a good value given the size of the entrée - the medium  proved too much for two hearty appetites - and the opportunity to indulge in one of the city's best, most iconic pies.", "pics": null}}, {"review": {"des": "One of the top places I was looking forward to in Chicago...<br><br>I arrived with a group of 6 on a Saturday night around 6pm and waited for about 45 minutes. We were told we could preorder so that our pizza will be ready when we were seated. Sounded like a great idea. Unfortunately, there was no use in doing that because we ended up waiting 45 minutes for our pizza anyways. What's the point of \"preordering\" then? Eh, it was annoying but not that big of a deal.<br><br>HOWEVER, THIS IS WHY I WILL NOT RETURN. Once our pizza was ready, our server brought it next to our table and was preparing the slices. Another employee walked by with a big basin of dirty water, tried to squeeze by our server, and accidentally splashed the contents of that basin onto our pizza. Our server glared at him, peeked a look at us, looked away... and then?! PROCEEDED TO SERVE US THE PIZZA. He then continued on like nothing happened. I was flabbergasted. I honestly had no words, and we didn't know what to do since we had waited so long. We decided to say f*** it, and ate parts of it cautiously. Should we have eaten it at all? Hell no.<br><br>On top of that, the pizza was below average. Not worth the wait or the carbs. Save your calories for elsewhere.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/skY5BeNCNMB91JOisHM4HQ/348s.jpg", "caption": "The Malnati Chicago Classic Pizza"}]}}, {"review": {"des": "Not sure what happened here, but the pizza at this location was just alright. It's been many years since I've had Lou Malnati's (and it's one of my favorite brands of deep dish), so I'm not sure if the experience was due to location or if my memory pulled the hype game on me.<br><br>We ordered 2 medium pizzas for 4 people - the Lou's with extra garlic (dang +$3 for garlic is steep!), and the crustless sausage-crust pizza (haha for novelty). The Lou's crust tasted really bland and more .... dried out than crispy. Since the Lou's comes with buttered crust, I'm not sure how much drier a \"non-buttered\" crust would be. Super disappointing on the crust (both the outside and underneath the pizza).<br><br>The toppings themselves were alright. I didn't see that much extra garlic so that was disappointing too. There were lots of tomatos but somehow the crustless version tasted much more tomato-ey. As for the crustless, they are not kidding that the pizza is made of sausage. I liked it, but I can definitely see how the meat can overwhelm the balance of the flavor.<br><br>Overall, the pizza makes for great post-drinking food - but this was nothing like what I remembered from before. At least the servers were nice and they also offered lots of samples in the waiting room!", "pics": null}}, {"review": {"des": "We skipped bfast to get to Lou's on time when their lunch started at 11am. We were reading reviews and thought about getting the lunch special (small personal pizza with a choice of salad or soup)<br><br>Upon arriving, we decided on the Lou's classic small (4 slices) which ended up being enough for the both of us.<br><br>The pizza itself took ~45 mins to arrive to our table. Upon seeing it with our east coast eyes, we were scared that we ordered too little. After the server gave us our first slice, we then discovered the true meaning of deep dish pizza. <br><br>Dish deep over thin crust because you can truly taste both the cheese and tomato sauce. Its meaty, cheesy, and saucy in each bite. By the time we got to our second slice, I realized why you HAVE to eat this pizza fresh. The cheese no longer had a stretch and the crust definitely was less melt in your mouth. Regardless, I now have a new found appreciation for deep dish pizza", "pics": null}}, {"review": {"des": "My cousin came into town and wanted to try Chicago Deep Dish. We decided to check out Lou Malnati's and ordered two personal size Lou's. She added sausage to hers. The service was great and the server told us ahead of time that the wait time for the pizza would be about 25 minutes as it's made fresh. Overall, the pizza was just okay. Not something that I'd return to have, but at least we can say we tried deep dish?", "pics": null}}, {"review": {"des": "If you visit Chicago and want authentic  Chicago pizza you must come to Lou's. <br><br>It has perhaps the best pizza I have had in my life...IN MY LIFE. <br><br>We had a Classic Chicago and a Pepperoni and Peppers pie for the table and they were both incredible. <br><br>HIGHLY RECOMMENDED!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Mx6W1gJ6gdMVYH34vK1WCg/348s.jpg", "caption": "Chicago Classic in front and Pepperoni and Peppers in the back... Sublime."}]}}, {"review": {"des": "Absolutely amazing! Great service, waitress was super friendly. The wait time for the pizza was not bad.<br><br>We ordered two pizza's, they were baked to perfection. The dough was well cooked and the toppings were very fresh having a metric ton of flavor.<br><br>Food Quality: 5/5<br>Food Flavor: 5/5<br>Service: 5/5<br>Environment: 5/5<br>Memes: 5/5", "pics": null}}, {"review": {"des": "BEST. PIZZA. EVER. <br><br>Before coming to Chicago, I asked a few Chicago natives where to get deep dish pizza. Every single one of them said Lou Malnati's. They said it didn't matter which one. We ended up opting for this one because it was closest to our hotel. They have a huge indoor space as well as an outdoor patio. <br><br>We loved this place so much we came twice. The pizza was phenomenal! Yum!!!! We ordered deep dish with sausage and the butter crust. It was so tasty. When I imagine deep dish, I always think it's just layers of cheese, but it actually had just the right amount of cheese in proportion to meat, crust and sauce. It was perfect. They have a bunch of draft beers on tap that go perfectly with the pizza. <br><br>Yum. Yum. Yum. Gosh, this place is so good. This is the place to go. Avoid the other tourist trap pizza joints and come here.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/3PY9_3hDAvPMtk-NWErSoA/168s.jpg", "caption": "Menu"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/3yOXoqg52cpmyQ04yTEm5g/168s.jpg", "caption": "Menu"}]}}, {"review": {"des": "When I came to Chicago I was told I had to try Lou Malnati's pizza. Being from New York I have high standards for my pizza, but I was excited to try authentic deep dish. Unfortunately, my boyfriend and I were disappointed. It is very expensive for the smallest little personal pie and we weren't that impressed. Maybe it's because the cheese is on the bottom and the sauce goes on top? I'm not sure what the hype is. The pizza was OK, but not anything that really impressed me, especially for the price.", "pics": null}}, {"review": {"des": "When friends or family come to visit Chicago Chicago deep dish Pizza is often down as a something to try. <br>The wait was a tad longer than ideal and getting the table was about 29 minute wait. This wasn't ideal especially as my elderly uncle can't stand for too long. The deep dishes were great, we went with the two recommended ones. Garlic bread and spinach bread were good too. My favorite thing about this place is the flavor of the tomatoes, regardless of as a side with the garlic break or in the pizza, they taste amazing every time ! For those with me ( visiting from the UK) who were trying deep dish for the 1st time the meal was a great success and a new experience for them.", "pics": null}}, {"review": {"des": "Everyone recommends this place & how amazing it is! We came here on a Friday night around 7:45 pm. It was about a 25 minute wait. After you put your name on the list, they get your phone number and will text you when the table is ready. So if the wait is super long, I think you can go walk around & wait for the text. After you put your name on the list, you can also order your pizza ahead of time so it'll be ready a lot faster after you're seated. 5+ stars for that!! Generally the deep dish pizzas take a long time to cook so that's amazing that they do that for you! <br><br>We got the combination appetizer platter, deep dish with sausage and mushrooms, and deep dish cheese with garlic & onions. The combination platter was perfect! It had deep fried zucchini, mushrooms, cheese curds, and mozzarella sticks with marinara sauce and ranch. I loved the cheese curds and the appetizer was nice since it had a variety! The pizza... was horrible. Overcooked- the crust was super crunchy. And was just very basic. It didn't taste good at all! We didn't finish it and we didn't even want the leftovers... it was our first time having deep dish pizza and we were not a fan at all.", "pics": null}}, {"review": {"des": "Overall a good pizza but still the \"touristy\" Giardanos is my favorite.<br><br>We started with the spinach salad which combined strawberry's, spinach, and onions. Weird combination but works. We went with a small \"Lou\" which had spinach, mushrooms and tomatoes. It was good, I specially liked the cheese. Thought it wasn't deep enough to be called a deep dish (maybe our waiter messed up). The portion is good for two people. For dessert we went with the cookies skillet. It was ok, the best thing was the cookie being hot. Although the cookie itself was ok, lacked more sweetness for my taste!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/roHrySkrzg9aOuWv_Va4cg/348s.jpg", "caption": "Skillet cookie"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/A7txOMZmHFsP_2Q-2sFDiw/168s.jpg", "caption": "Spinach Salad (Seasonal fruit)"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/fBWcU_cpwJ6gfhKaq2_w5Q/168s.jpg", "caption": "Lou deep dish"}]}}, {"review": {"des": "I came to Lou's with my husband on a late Friday afternoon. It was not super crowded. Our server was great, but he did forget our drinks. Later he made up for that by giving us a little cookie pizza on the house, even though we did not complain. It was such a nice touch.<br><br>So onto the za. Let me preface this by saying neither my husband nor I had ever tried actual deep dish pizza. He likes meat, I don't eat meat. I like spinach, he doesn't. So we went with the personal size options even though I'm sure it's a \"different experience\" getting a real pizza, in the pan and all.<br><br>I got the Lou and it was seriously so g o o d. I grew up eating \"pan\" pizza from Pizza Hut and this crust just resonated with me. Ugh so buttery mmmm. My husband got the Original, the one with sausage and all, and he liked it but said he enjoys NY style pizza more in the end. He also could have eaten more, so I don't think the personal option is actually as much as a grown man may want. <br><br>Besides the crust, I loved the tomatoes and how the ingredients were big and not chopped up. <br><br>So as I already guessed - I became a fan of the deep dish. Thanks, Lou Malnati's!", "pics": null}}, {"review": {"des": "This place was so busy, I was so excited to try it. Long story short, I prefer Giordano's. I like the high stacked pizza topped with a thick layer of tomato sauce. Lou Malnati's is just cheese and toppings stacked medium high. I enjoyed the flavor of their food though, and everything was nice and hot when it arrived at our table. One huge advantage they have over Giordano's is that they offer a small sized pizza that two people could finish. Service was super friendly and although they were a full house, you never feel forgotten.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/U4Oqd5FcwDIwfevdRQfGgg/348s.jpg", "caption": "Sept 2018"}]}}, {"review": {"des": "This is hands down the best version of the Chicago deep dish. Now that I have experienced it, I will know to tell them to go light on the cheese. I am a very big cheese lover but this was waaaay to much. Besides that, crust is super crispy which is good and there is a lot of flavor on this thing. Def don't miss this place if u want to experience Chicago deep dish.", "pics": null}}, {"review": {"des": "Worst carrot pizza ever!<br>Covered in carrots!<br>Soggy!<br>Gross!<br>Will not recommend!<br>Menu did not say this had carrots and lunch meat on pizza! Disgusting new menu item!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/GNIzKnG7XsZJ_bJjoVGXvQ/168s.jpg", "caption": "Carrot Pizza! Gross!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/L40BK8XV9zAaqbUj7xwL4g/168s.jpg", "caption": "Worst pizza! First time ordering here, from out of town. I guess this is a new recipe, and new pizza to the menu! COVERED in carrots!"}]}}, {"review": {"des": "This is my third LMP experience, but my first time at this location. I will attest that both locations of Lou's that I've tried were by far better than my one and only experience of Giordano's. Here, it's not only about the pizza, but everything that I've tried was fantastic. <br><br>We sat at the front, in the closed off patio-like set up. I must admit, it was freezing out/in there at first. They have heaters overhead, but they got a slow start warming up. So, if you're cold natured, don't sit in that area. Our waiter was a tad slow and not very informative when we inquired about the frozen selection, he knew nothing about them and said he would check out the options and report back. I think he forgot.. but my main point is that he probably should've already known the deets. That's all for my constructive feedback, now onto the important stuff...<br><br>The concierge at the hotel gave us a coupon for a free bruschetta or a dessert when we mentioned where we were headed, so check with your concierge to see if they offer those coupons. <br><br>I started with an order of calamari. While I'm no calamari expert, I've had my fair share. I will say that their version was the best that I've EVER had. Who would've thought it... fantastic calamari served at place that has pizza down to an art. Oops, I skipped ahead. The consistency of the calamari was not tough or chewy like other calamari that I've had. It was almost like mozzarella sticks... not the taste, but the consistency. <br><br>The pizza... we ordered a small version of the deep dish The Lou and as always, my husband added a few extra toppings. I will point out and it's not a negative thing as long as you're aware... since The Lou has veggie options on it the finished product has a watery cast to it, but don't fret it doesn't make the pizza soggy at all. I'm not quite sure how. Is it the buttery crust? The combination of cheeses? Whatever it is, they have it down to an art.<br><br>As if we didn't already devour everything, we finished with the warm cookie topped with scoops of ice cream. You guessed it, that was recommendable too. <br><br>We ended the visit with two to-go frozen pizzas which were surprisingly very reasonably priced. I now have a Chicago departing ritual... pick up to-go pizzas here and popcorn from Garrett's.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/-PQfCnx11qzekHhqQA4BWA/348s.jpg", "caption": "Calamari Fritti (the best I've ever had)"}]}}, {"review": {"des": "FOOD<br>- The Malnati Chicago Classic: sausage, cheese and tomato sauce on buttercrust. Good but a little overrated. The sausage was a thin layer of sausage instead of pieces of sausages. That was different. 3.5/5<br><br>- Thin crust: pepperoni and sausage. I'm actually more of a pan crust pizza person but I preferred the thin crust over the deep dish. I can't say why. 4/5<br><br>SERVICE: Good service. We had reservations and our table was ready on time. Food came out relatively fast. The servers were attentive. 4/5<br><br>FINAL THOUGHTS: I would come back. The pizza was decent and there's other items on the menu I would like to try.", "pics": null}}, {"review": {"des": "Get the \"Lou\"<br><br>Lou Malnati's is the place for a great Chicago style deep dish pizza. Since the pizzas take about 30 minutes to cook, try the stuffed spinach bread while you wait. The hot, house made crusty loaf is stuffed with a creamy blend of cheeses, fresh spinach, garlic, onion and tomato and served with a side of fresh marinara sauce full of tomatoes. <br><br>The \"Lou\" deep dish is a classic especially for veggie lovers-spinach, mushrooms and sliced roma tomatoes. No wait on a Sunday early afternoon.<br><br>Sign up for their email list for coupons, although we got our coupons after we visited.", "pics": null}}, {"review": {"des": "Chicago deep dish definitely wins over New York pizza in my book! I'm so glad to have tried the very best of the best. My love for pizza is out of this world and I am very pleased with my decision to try Lou's. I didn't dine in, but ordered delivery to our hotel half a mile away. I went with their most popular cheese deep dish and sausage thin crust and fell in love with the cheese pizza. I literally have no complaints whatsoever about the taste, presentation, wait time, etc.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/XFogJut6Qz24_Rl2C-1Nvw/168s.jpg", "caption": "Sausage Thin Crust Pizza"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Elu2-uZsK5EIWNUBryZE2g/168s.jpg", "caption": "Cheese Deep Dish Pizza"}]}}, {"review": {"des": "Confession: I'm not a pizza lover -- I know, I know, crazy... now that we're over that... I have to admit LM Pizza was pretty tasty!<br><br>We ordered take out as we were visiting a friend and he said we HAD to try the pizza -- what's a Chi-town trip without deep dish anyway?<br><br>As a bread lover, the crust is beyond delicious. I'm pretty sure it's 80% butter, 5% flour, and 15% magic... just a guess! I'm not a huge sauce lover, but it was definitely fresh ... and they didn't skimp on it! Every thing on the pizza was flavorful. <br><br>We ordered a salad too - my only grievance... it was overly dressed. Ask for the dressing on the side.<br><br>LM's will cost you though... almost $30 for a medium size pizza. <br><br>Wait times can be up to an hour... so if at all possible, order for pick up nd enjoy at home!!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/qqDY4Hb7jTq1Z6JaXiDv3g/168s.jpg", "caption": "Sauce Pie"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/7xTckeJa-qRcT02b2mOr8w/168s.jpg", "caption": "LM Famous Deep Dish"}]}}, {"review": {"des": "ABSOLUTELY LOVED THIS PLACE!!<br><br>Easily one of the top 5 best pizzas I've ever had! <br><br>First, the restaurant is cool, tons of tvs, tons of bar seating and tons of restrains seating. Would be a great place to watch a game or come with your buddies or family. <br><br>We started with a Caesar, which was big enough to serve 3 people, and was amazing. Very surprised at how good the Caesar salad was.<br><br>Next, we ordered the Malanatis classic, which comes with extra cheese, sausage and their trademarked butter crust! The butter crust was insanely good, the sausage was perfect and the cheese was delicious. I cannot wait to come back!", "pics": null}}, {"review": {"des": "While visiting a friend who lives here, I was told this was the best deep dish around and while it's the only one I experienced, it was amazing! <br><br>Located right in the heart of Chicago, Lou Malnati's is a huge, beautiful restaurant known for their classic Chicago dish. The inside was beautiful and spacious and at 5 on a Friday we didn't have to wait! <br><br>We ordered the Malnati's salad which consists of the best dressing ever and a cheese dressing dish. Both of which are extremely deceiving in size! Follow the recommended number of servings on their menu because they're right! When they serve the deep dish they come and cut it and serve you which was awesome. And wow, was it good! <br><br>Definitely a great place to check out to experience a classic part of Chicago culture", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/PCUxsZ3MfyFzNd_DxD4Sog/168s.jpg", "caption": "Cheese Deep Dish Pizza"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/hl2T8mM5DD2duJ5l4mmvog/168s.jpg", "caption": "Malnati Salad"}]}}, {"review": {"des": "Breakdown<br>-----------------------------<br>Star #1 - Atmosphere/Decor:<br>Very clean and well kept, it is a big restaurant but they always seem to be busy. Star earned.<br><br>Star #2 - Service:<br>The servers are nice and friendly. We came before everyone started showing up so we got seated quite quickly. Our server came to check on us and after we ordered, we had to wait a while. The calamari came out pretty fast, but fyi the deep dish pizzas take some time (they even state it on the menu). Star earned.<br><br>Star #3/4 - Food:<br>The food was a letdown. The calamari was 2 thumbs up, however. The sauce that came with the calamari was similar to a cocktail sauce and it was nicely fried and crispy. Loved the calamari! The deep dish pizza, however, wasn't up to my expectations. Yes. the crust was nice and thick and crunchy, but the pizza as a whole wasn't that appetizing for me. It was overloaded with toppings as if someone just poured them on without consideration. The tomatoes on top caused the pizza to become a bit soggy. It was also really oily from all the sauce. We got the Malnati Chicago classic and the sausage was more like a layer sausage rather than sausage chunks. Overall I think this place is good for tourists, like me to try, but I am sure there are better deep dish pizza places out there. One star earned.<br><br>Star #5 - Cost/Value:<br>Pretty expensive for a deep dish pizza that is just average. Star not earned.<br><br>I came here having high expectations and they honestly weren't met. Maybe my review was a little bit biased cause of my high expectations, but for me, this restaurant isn't a four-star. It is closer to a 3.5-star restaurant because the pizza wasn't as good as I expected. I hear good things about Giordano's so if you are interested, you may want to give that one a shot.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/hNEBVknSwG8V6XVv0tS6vw/168s.jpg", "caption": "Malnati's Chicago Classic Pizza"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/eATtsfJqu0ekpKas2yLZ_w/168s.jpg", "caption": "Calamari! Very tasty, definitely try it out!"}]}}, {"review": {"des": "I asked Nicole B for a pizza place I needed to visit while in Chicago, and this was one she mentioned. I walked here from the zoo, and arrived an hour before happy hour started. I sat at the bar, and the bartender greeted me immediately and was friendly. I can't remember the drink I ordered but I'm sure it had vodka in it. I asked him about the size of the pizzas, because I wanted to eat some and take some back for RJ. He helped me decide on the small classic deep dish. He was also helpful going over the appetizers because the pizza takes awhile. I did not eat all day and needed to eat something but still be able to eat pizza. I decided on a house salad. It was pretty big for the price and held me over until the pizza was ready.  The pizza was larger than I expected but no matter, it would be eaten. The butter crust was crispy and buttery. The sauce was chunky and super garlicky, and the sausage and cheese were perfect. I ate 2 pieces and got a box for the rest, then happy hour started so of course I got another drink. We carried the pizza home on the plane and ate it for lunch the next day. It was just as fantastic even after a flight to Philly. This was a good find on my Chicago trip.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/VETeRoSskD8Vji_mcd2KcA/348s.jpg", "caption": "House salad"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/5VVYgpdd5T7Nrjmx-QYISQ/168s.jpg", "caption": "Worth the wait!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/fG7zguD68FHpTytdTCreLg/168s.jpg", "caption": "Pizza about to fly back to Philly"}]}}, {"review": {"des": "The service was terrible. We waited for 35 minutes for a table just to see it getting snatched by someone who had just walked in. The waiter just shrugged his shoulders and took us into the restaurant and found us a table in the back. The waiters were all busy and even though we had ordered as soon as walked in, it took another 30 minutes for the pizza to arrive and it was nothing great. Won't return", "pics": null}}, {"review": {"des": "Of you find yourself in Chicago and are hungry may I suggest Lou Malnatis? Fantastic pizza great service and delicious brushetta. Plan ahead there is usually a wait but it well worth the time", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/oy-OEP1wsBoFzCy-LxSrOA/348s.jpg", "caption": "The dinning room"}]}}, {"review": {"des": "This is the best Chicago deep dish in my opinion.  It is better than Geno's and Giordano's.  The crust is great and compliments the sauce and toppings deliciously!  My favorite toppings here are Sausage. Pepperoni, and garlic.  The service is great.  They come to your table every time you need a slice to be cut.  <br><br>They also have a full bar.  You can watch sports games on their TVs.  I was veey happy with my experience here.  I was visiting from Los Angeles and it snowed the day that I came here so it made tge experience that much more special.  My wife prefers Pizzeria Uno, but I have never been there.  So for now, Lou Malnatis is my favorite deep dish in the Windy City!  <br><br>P.S. They also have other options that unfortunately was too full to try.  I really want to try the calamari next time I visit this establishment.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/IbhxFLAVzj-YsvU62U-CeQ/348s.jpg", "caption": "Pepperoni, Sausage, and garlic"}]}}, {"review": {"des": "BUTTER CRUST. It's all about the butter crust. Last time I visited Chicago, I tried deep dish from another place but Lou Malnati's takes the cake. This deep dish pizza was the best pizza I've ever had. My boyfriend and I visited for lunch a little before 11 on a weekday and it was empty.<br><br>The atmosphere is really nice. There's an a seating area with leather chairs, a bar area with booths, seating with windows all along the wall and a big room for special events. We were promptly seated in the bar area in a booth and greeted right away. The waitress was friendly and explained the menu, the most popular deep dish pizzas and also let us know how long we'd wait. The pizzas take around 30 minutes but longer if you'd like more toppings. <br><br>We ended up ordering a medium Malnati Chicago Classic with pepperoni and it was incredible. the tomato sauce tasted freshly homemade. The sausage was so yummy and the crust was perfectly baked being soft but having the right around of crunch. Unfortunately, we didn't have enough room for dessert but next time we'll definitely be ordering the cookie skillet!<br><br>I'd definitely suggest coming if you're looking for authentic, delicious deep dish. Malnati's definitely did not disappoint! Come with a big appetite!", "pics": null}}, {"review": {"des": "Must try deep dish pizza! I got my first taste of deep dish pizza from Lou Malnati's and it changed how I felt about pizza. We got the small size, which is good for two people, but there was so much cheese and sausage that I could only manage to eat one piece. Our server described the pizza as having \"a thin layer of sausage on top\", but I felt like I was eating a sausage patty instead. <br><br>The service here is great, our server was friendly and recommended a lot of things. The pizza takes about 40 minutes to bake, so ordering an appetizer is recommended. I got the spinach cheese bread, it came with a side of tomato sauce. <br><br>Usually the wait here is really long, but I came around 10 pm on a Thursday night and there were plenty of tables. I have walked by Lou Malnati's during rush hours and its crazy packed, so plan your time accordingly!", "pics": null}}, {"review": {"des": "This was my first ever Chicago deep dish pizza, and it did not disappoint. This place has a lot of reviews, for a reason- it's extremely popular and extremely good. We got there around 8pm on a Thursday night, and waited about 45-50 minutes for a table. Not too bad, considering how busy it is, and the bar which gave us a chance to get drinks while we waited. <br><br>We ordered the Deep Dish Malnati Chicago Classic with that famous butter crust. It took about 35 minutes for our pizza to get there (which they warn you about many times) but it was worth the wait. That crust- wow. The two of us shared a small, which comes out to 2 slices each, and we definitely couldn't have eaten a larger pizza. <br><br>There are also lots of appetizer and salad options, all of which looked very good. Our server was good, given how busy it is here. <br><br>Overall, I am glad we chose this place for our first Chicago deep dish experience. Just be prepared to wait a decent amount of time for a table and your pizza.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/XKDM2tnSoXFUYG-avg7V3Q/348s.jpg", "caption": "The Malnati Chicago Classic"}]}}, {"review": {"des": "Family style restaurant with the best ever deep dish pizza and spot on service. Visited Lou Malnati's in Gulf coast which was easy to find off state street. We were welcomed by the hostess who was able to seat us right away. The server came by and asked if we dined here before and gave us the heads up for the 35 minute cook time on their pizzas. Good to know. We visited here on our Uber drivers recommendation. He said there are many deep dish style pizzas and the butter crust here is a  must try. PS, you can order a sample of it to try for .75 yes, give it whirl before you commit to a whole pizza pie.<br><br>We ordered a house salad to start. It was a classic salad with romaine, cucumbers, tomato, cabbage, carrots, red onion and croutons (I would say made from their classic butter crust) Served with red wine vinaigrette. We also ordered the buffalo wings before our pizza. Crispy and perfectly seasoned and spiced wing!!! They serve with ranch dressing that gives the wing a creamy taste. The pizza was  delicious!! It had a Crispy buttery crust that was soft in the middle with a crunch at the bottom. It was loaded with toppings. Crushed tomatoes, sausage and pepperoni and an abundance of cheese. Very yummy and satisfying to say the least. This was the best experience. Perfectly timed service and attentive to the smallest details. Extra napkins were provided when needed, extra utencils and plates. Hands down a good family style eatery.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/DJXOvW9xZPruSrRxN58Pvw/348s.jpg", "caption": "Appetizer - Buffa-lou wings"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/nzxasqxNsfpavxATtB77BA/168s.jpg", "caption": "Lou's classic - deep dish butter crust with pepperoni and sausage"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/qbLuSaYP11Y3LSZF52PvKA/168s.jpg", "caption": "House salad: romaine, tomatoes, cucumber, cabbage, carrots, red onion and croutons, red wine vinaigrette. Individual size"}]}}, {"review": {"des": "When in Rome, do as the Romans do, right? Came here with the bf and a friend during our trip to Chicago last month. It seemed to be one of the most reviewed spots in town where you could get Chicago-style pizza, so we opted to dine here instead of other places that came up in our search. <br><br>Depending on what time of the day or night you come in, the wait times can differ. We came in at around 9:30PM on a Saturday night and we had to wait for about 15 minutes before getting seated. Prior to getting seated, though, we were told by the server to place our order ahead of time as it takes 20-30 minutes to make a pie, apparently, so we did just that. Seems like the diners were a good mix of locals and tourists, like ourselves, so take that for what it's worth. Our server was a friendly woman who was more than attentive to our needs. We had opted to share an order of their spinach salad, a medium cheese pie, and a small Malnati Chicago classic pie.<br><br>The verdict? Everything was good, but MAN, was it heavy! We ended up leaving with basically an entire pie's worth of leftovers by the end of our meal. I would be redundant here in trying to compare Chicago style pizza with NY style pizza, but as a culinary dish by itself, I think Lou Malnati's version of the latter as pretty good: pretty good sauce, lots and lots of cheese, and a very chewy golden crust. Definitely not something we'd find back home and we're glad we managed to try this place out.", "pics": null}}, {"review": {"des": "The atmosphere is laid-back kind of sport feet. There's really nice outdoor seating. My girlfriend and I enjoyed the late afternoon with the Kentucky mule and the fried calamari to start. We ordered the\"Lou\" dish pie, the one vegetarian option for the deep dish plates.i think this was a good pie for a chains pot. <br><br>My one complaint we got two dirty dishes, a plate with left over crumbs and a glass of water with some crumb at the bottom. <br><br>The wait staff works quickly and the food is good. I would come back for a casual meet up.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/VNZzvxKGTwzL3lb9NeM5-g/168s.jpg", "caption": "The marinara sauce is fresh, almost salsa consistency. Paired nicely with that squid texture and light salty flavor."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/8cZXMRToq0RCaW8ovnRvgQ/168s.jpg", "caption": "The \"Lou\" pie you should try!"}]}}, {"review": {"des": "Lou-malnati Confirmed!!!<br><br>This pizza is demonically good! The CIA does not want you to know this but the butter crust at Lou Malnati's is amazing!! Jet fuel cannot melt steel beams but brick ovens can melt cheese to create a gooey blanket of goodness enveloping flavorful italian sausage!!<br><br>The government is spraying chemtrails and we were spraying fresh lemon juice onto succulent perfectly fried calamari!!<br><br>Seating here is an inside job unless weather permits them to open the patio area which is a great place to people watch like the way the FBI is constantly watching all of us!!<br><br>Wake up sheeple and head to lou malnati's for great pizza!!<br><br>Reviewer note: It's a shame that Yelp wouldn't let me publish this in all caps", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/KhoPZTpt8nMEwliAKIyNIg/348s.jpg", "caption": "The government deleted my photo of the pizza"}]}}, {"review": {"des": "This deep dish pizza was just about average. I had Giordano's the day before so I was able to really compare the two. When comparing the two this one definitely takes second place.", "pics": null}}, {"review": {"des": "Our Limo driver directed us to this place as an alternative to Giordano's while we were in Chicago last week. I was really craving Giordano's, so I wasn't sire what to expect. Lou Malnati's is also a large corporation, so the standards were there. Impeccable cleanliness, nice venue, friendly staff and clean standards. <br><br>We came in for lunch are were greeted promptly and seated. The waiter explained the menu options and we decided to order the Chicago Classic. It was superb. Crust stayed flaky and had a wonderful butter crust, and the sausage was plentiful and tasty. Oozing cheese and sauce completed the pizza and the small size was plenty (4 pieces) for the two of us. This was a winner for us and we will for sure be back on our next trip!", "pics": null}}, {"review": {"des": "Love this pizza<br>Gotta get the pepperoni and wagon wheel of sausage <br>Love the fact that you can order your pizza while you wait for a table<br>Service was awesome <br>True deep dish with minimal crust but a bed of toppings sauce and cheese", "pics": null}}, {"review": {"des": "It was a great experience trying Chicago style pizza for the first time. <br>The place was huge, but filled with customers. Me and my friends had to wait 45 mins for a table of six. But on the plus side, you can order your pizza while you were waiting, and complementary garlic bread were served for the people who were waiting to be seated. Delish!<br>Calamari: Crunchy, slightly under seasoned imo, but together with the sauce was perfect!<br>Chicago Classic pizza: Great balance between the sauce, cheese, sausage, and the crust. Flavorful but not overwhelming! The butter crust was crunchy, buttery, more like a tart crust than other pizza crusts! <br>Server was super nice and helpful! Totally recommend ;)", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/bdv8SUzqGhA7AcfhtGVHaw/168s.jpg", "caption": "Calamari and salsa"}]}}, {"review": {"des": "So for the longest time I thought that Lou Malnati was spelled lumanatti like some luciferous Harry Potter spell. The renowned deep dish turned out to be slightly less bewizarding than I had expected, but nonetheless magically delicious and satisfying.<br><br>We got \"the Lou\" since 1) you can never really go wrong ordering something named after the restaurant 2) it comes with Buttercrust which otherwise costs extra and 3) it comes with the most veggies (spinach mix, mushrooms and sliced roma tomatoes) and the price is only slightly higher than the other pizzas. What I liked the most is how well-balanced everything is--the garlicky savory buttercrust that was not too rich, the signature deep dish thick tomato sauce that was not overwhelming, and the mozzarella-romano-cheddar cheese in between that created delightfully nuanced overtones. <br><br>Despite the warnings from our server that the personal size was pretty small, it was actually sufficient to share between two people; while less uncomfortably filling as other deep dish I've had, it is still somewhat hefty. Because we had wanted to check out Stan's Donuts for dessert and had plans for an earlier dinner, the personal size deep dish ($10.25) worked out well for the two of us. (Except that it comes on a plate rather than a skillet, so you may want to keep that in mind depending on how important Instagram aesthetics are to you)<br><br>We came around 1:30pm on a weekday and there was plenty of seating; however the 30-40min wait becomes rather agonizing when it is a late lunch and you are ready to inhale a pizza.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/jWFInNc8rG7eswjSlVygCg/348s.jpg", "caption": "The Lou deep dish, personal size"}]}}, {"review": {"des": "Love Chicago style pizza. Some are pizza snobs and claim Chicago style isn't really pizza at all, but I don't care, I love these pies.<br><br>Malnati's in the gold coast is always crazy packed. Deep dish pizza takes up to an hour to bake, so you have a long wait. So put in your reservation at the hostess and order your pizza. They'll text you when the table is ready then it won't be long and your pizza will be ready too. Be aware, these pizzas are big and thick. A slice could fill you up. My eyes are always bigger than my stomach.<br><br>Pizza and service were excellent. I love Chicago and their pizza, the two are one in the same.", "pics": null}}, {"review": {"des": "As a former Chicagoan, I can tell you that I honestly don't crave deep dish pizza that often. However, when I do- Lou Malnati's is really the only place to get a true Chicago style pizza. Sure, there's that Giordanos garbage that tourists flock to as it's some sort of second coming. And Geno's East is good- but, Lou's is in the Major Leagues, when it comes to consistency, and real deep dish pies. <br><br>If you're a tourist, avoid the hype of the other pizza joints that are basically on every corner, and come here. Good drinks, damn good service, and the best Chicago style pizza in town. (see attached pic)", "pics": null}}, {"review": {"des": "Wow!!! They did not disappoint!  We had \"the Lou's\" deep dish pizza!  Amazing buttercrust! That can either make or break the pizza!  We also had the wings and calamari for apps since we were told it could take up to 45min for the deep dish pizza. Calamari was awesome because there was more of the squid than the outside breading. Also the wings were fried to perfection. I didn't like a lot of sauce so I had it on the side!  This location was great because it is one of their bigger restaurants and only a 20 min wait!", "pics": null}}, {"review": {"des": "I'm normally a thin crust pizza person, but this was hands down the best pizza I've ever had. I went here on a recommendation from friends who said that this was a local favorite, as opposed to Giordano's that's a tourist hotspot. I split a medium classic Lou- a deep dish garlic buttercrust pizza with spinach, mushrooms, and sliced tomatoes - with another woman and we struggled to finish it, even after not having breakfast that day. The cheese literally melted in our mouths and the whole thing was so rich with flavor. In terms of atmosphere, we went at 11:30am on a Thursday and it was pretty empty. That being said, we were told it would be about 30 minutes to get our pizza's but it was closer to 55 from the time we ordered to the time the pizza was on the table. <br><br>Overall, the place has a cool rustic vibe with light fixtures hanging own low on the table. Our waitress was very sweet, checking in on us every 10 minutes or so, and even gave us Chicago postcards / Lou's coupons for the next time we ordered (which we did again the next day).", "pics": null}}, {"review": {"des": "In Chicago for a visit besides the pizza being outstanding you have to have the house salad it is delicious", "pics": null}}, {"review": {"des": "Short trip to Chicago, and a Chicago native recommended this place for deep dish pizza. So I thought I'd try it out. Glad I did!<br><br>The wait: Visited on a Monday night. I ordered takeout and waited for 30 min. My guess wait for a table would've been longer. <br><br>Atmosphere: Spacious, casual. A little more well decorated than the typical pizza joint. <br><br>The food, portions: The personal pizza is quite small for $11 per pizza. But I still think it was worth the try! I got the Malnati's Chicago classic. My goodness, there was a complete full layer of sausage under the tomatoes! I was pleasantly surprised. <br><br>The food, flavors: Sausage was delicious. But what really stole the show was the tomatoes. Super fresh. And the cheese was perfect as well.<br><br>Bottom line: Go try it! Budget enough time or order ahead for pick up.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/4kF9YP4rzu7KqHmgp9U2pg/348s.jpg", "caption": "Personal Malnati's Chicago classic. So much sausage the the tomatoes were fresh!"}]}}, {"review": {"des": "This was really good. Not great great but really good. We were a party of 5 on a Monday night, we got there early for summer so we beat the crowd that started to arrive. Expect some wait time during prime time. <br><br>We had the deep dish Lou special, dinner salads and a thin crust cheese and pepperoni. The deep dish was good but not piping hot. The this crust was excellent. I would order that next tine: perfect. <br><br>The salad dressing is homemade. Get a side salad. <br><br>It was noisy but fairly good service. <br><br>Enjoy.", "pics": null}}, {"review": {"des": "At a place like Lou's in downtown Chicago, you have to expect a wait time. I anticipated about an hour but on a Saturday at 7pm, we only waited about 20-25 minutes for a table for 3. <br><br>We ordered a salad and a medium Lou's to share with two other friends. It was the perfect amount -- no leftovers to carry around as we walked around town afterwards.<br><br>It was my first day in the city and I was hungry and looking forward to Lou's infamous deep dish. However, I found it soggy and unflavorful. <br><br>Service was friendly and their wait system was convenient. I'll check out another spot next time I'm in the area!", "pics": null}}, {"review": {"des": "I've tried 2 other famous deep dish place in Chicago but Lou Malnati's has the BEST DEEP DISH  in Chicago!! I had the personal Chicago Classic which was perfect for me and my friend cuz we don't eat that much. The crust was thin so it wasn't too heavy on the stomach. It has the perfect amount of toppings. We also ordered the BBQ wings which weren't that good. I thought the BBQ sauce tasted funny & too sweet.<br><br>The pizza takes about 40 mins so when you're in line just put your pizza prder first so it'll be ready when you're seated.", "pics": null}}, {"review": {"des": "Came here for lunch on a Saturday with a large group so we had to preorder to secure our table. Service was slower than we expected given we had preordered. There were over 14 of us and only one server which we found odd too. The one server did the best he could but my 4 stars is due to this. We ended up ordering salads to share amongst the table which completed the cheese and meat overload I experienced - not complaining. Since there was no gluten free crust, I opted for the crust less which was made of sausage (meat overload) and was a cheese lovers paradise. The group enjoyed their pizza. Being a crustless pizza, I was surprised by the flavour which was great and texture. I would order it again. All and all, a good dining experience. For deep dish fans, you'll love it so check out a Lou's!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/VivPIreJ6h70G22bwwvg5A/168s.jpg", "caption": "The Lou"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/1yfmgz5HldaiV0azYJtaeQ/168s.jpg", "caption": "The Crustless Pizza"}]}}, {"review": {"des": "I love this pizza! This literally is my favorite pizza. We stopped through here and it was awesome! The crust tasted like biscuits, the sauce was very flavorful and full of veggies, the pizza is thick as usual, lots of cheese and pepperoni. It's amazing. If you've never had Chicago pizza, you NEED to. And this is the place you NEED to eat at.", "pics": null}}, {"review": {"des": "If you must try Chicago pizza, and if you're in town you certainly must, I can say this is definitely the best one. While I'm usually a New York style pizza guy and prefer thin crust, I have to say this was surprisingly very good! The pizza tasted great and was not overly cheesy as some other Chicago pizzas tend to be. I definitely recommend.", "pics": null}}, {"review": {"des": "Just average is the best way to describe this tourist trap. The small deep dish is the size of a personal pan pizza and it ran me 24 bucks. The dining room is nice and the booths are super comfortable. The hiring manager must be mexican because 95% of the staff is mexican. Again average is the best way to describe Lou Malnatis.", "pics": null}}, {"review": {"des": "As we were planning our trip to Chicago, everyone takes about how we had to try the deep dish, Chicago-style pizza. And time after time, we heard more and more about Lou Malnati's!<br><br>The pizza is delicious and unlike any that I've ever had before! Not overdone and definitely deserving of the hype that everyone gave it.", "pics": null}}, {"review": {"des": "Amazing as always. We sat at the bar, and although they were in the middle of lunch rush, the bartender hustled and provided an amazing experience for us. Pizza was delicious. How can you not come here while in Chicago??", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/eDO3ElEYknrAdRaLMnDViQ/168s.jpg", "caption": "Pepperoni"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/UOFyYCQrNS6QRsl9QDayIQ/168s.jpg", "caption": "Onion, green pepper and sausage."}]}}, {"review": {"des": "Lou malnatis<br><br>Food: 3/5<br>Service: n/a<br>Ambiance: n/a<br>Overall:  ordered this to go and I would say that it was pretty average.<br><br>The extended review...<br><br>Food: <br><br>Sausage and spinach - this was my first deep dish pizza in Chicago and I was expecting a little bit more.  Though is a benchmark is a place in San Francisco, the one thing that I didn't like about this was how soggy it was.  Perhaps this was because we took it to go??", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/cwq7jZhKkqnsKT3fZJ-o2g/348s.jpg", "caption": "Sausage and spinach - was a bit soggy"}]}}, {"review": {"des": "Good pizza, but not much room for variation off the menu. Tried to get Alfredo sauce on a pizza since I can't have marinara, but they didn't allow that option and only offered to give me some sauce on the side. Ended up not having anything there at all.", "pics": null}}, {"review": {"des": "My family took the Giordano's vs Lou Malnati's Chicago Pizza challenge and Giordano's won for the whole family in taste, because of the cheese.<br><br>We ordered delivery of a small pepperoni deep dish Chicago pizza from both places. <br><br>Cheese: Both places have the same crust. Giordano's has way more cheese, we love cheese. <br><br>Sauce: Lou had chunks of tomatoes in the sauce. Lou's sauce has more depth and spice. Giordano's sauce was sweeter. I liked Lou's sauce, but my hubby and daughter liked Giordano's sauce better.<br><br>Pepperoni was the same in both places. <br><br>If in Chicago try the challenge for yourself.", "pics": null}}, {"review": {"des": "Great experience for my first deep dish pizza! We opted for the Malnati's Chicago classic, but later we found out that you can do half/half. Wish we would've known beforehand. Regardless, the pizza was delicious. Particularly, the sauce they use is very rich and homemade. The crust is also buttery, loveeee. I definitely recommend to come early because the pizza takes ~ 40 minutes to bake. Also, the portion is generous! Since it's so rich and cheesy, I personally wouldn't eat more than 2 slices if I was really hungry. We ordered a medium for 4 people. Each of us had a slice and still had 2 slices left over.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/uslZkIF7hWEtGOq9D73RFQ/348s.jpg", "caption": "Medium Malnati's Chicago classic: $21 (serves 3 people but actually served 4 people)"}]}}, {"review": {"des": "Came around 830 on a Tuesday and didn't have to wait at all. <br><br>My favorite of the must-see pizza joints in chi-town, and I'm sure every location is just as good as this one was.  <br><br>If you're in the area, you know how ridiculous it is: 1) to find parking and 2) how much it is...we parked over by the John Hancock tower because we had some drinks at the signature lounge, but that was even expensive...$24 for 3 hours.  So you've been warned. Hopefully, you're cabbin it or taking local transpo, but definitely a great spot to hit up. <br><br>Service was okay, nothin special there.", "pics": null}}, {"review": {"des": "This restaurant deserves a solid 4 stars for the food, service and ambiance. Let me explain: Our group visited Chicago for the weekend and several locals highly recommended Lou's for the pizza. Needless to say, we came down for just that. The wait was an easy 1 to 1.5 hours. Once we were seated, management did apologize for the wait and gave our group a couple of free appetizers as a token of their appreciation (thank you!). The appetizers were delicious. Good quality, large portions and tasty.<br><br>Now, as for the pizza goes: I don't want to ruffle any feathers, but we had better tasting Chicago deep dish pizza in other parts of the city. Don't get me wrong, their pizza was still good as I took down two big slices myself, but it just didn't hit the spot for me on this day. <br><br>If you're visiting as we were, you may not want to wait as long as we did as it cuts into your day. But if you don't mind the wait, then go ahead and give them a try.", "pics": null}}, {"review": {"des": "Really wanted to sit outside and enjoy the weather, but I'm guessing around 10pm you can't.<br>Had medium thin crust with spinach mix, mushrooms, and jalapeños. It was good but freaking costly, about $2.00 per topping.", "pics": null}}, {"review": {"des": "Great pizza! Been here in Chicago many time for a business trip and I ran into this place twice and never fail me. I end up killing the whole pizza", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/NP2zs8bVg9jy5QjueTMgNw/348s.jpg", "caption": "Classic small pizza, all in my tummy"}]}}, {"review": {"des": "Having tried Gino's and Giordano's over the years I've become obsessed with Chicago deep dish pizza. Every person I've talked to from Chicago has told me both those places are a joke though compared to Lou's. <br><br>After several years of hearing this I finally got to test their opinion since I was in town for the weekend. Those Chicago natives are right. The crust here is sinfully delicious. I know it's filled with butter but I don't really want to know how much. The sauce is as advertised, the best of the local chains. Finally, the fillings are fresh. I had a veggie pizza and all of the ingredients tasted great.<br><br>The biggest issues for Lou's are price at $28 for a medium, and wait time which is regularly over an hour during prime time. However neither of these issues are unique to Lou's so I'll be going back next time I'm in town.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Iwo29ncVOIqHTtsPdT59OQ/348s.jpg", "caption": "Lou's veggie"}]}}, {"review": {"des": "First impression walking in, the place gives off a rustic and lively ambiance. We were seated in the front patio which was great for conversation as it wasn't too loud.<br><br>The great debate always comes down to Lou Malnati vs Giordano's as to who is the superior deep dish pizza in Chicago. I ordered the Malnati Chicago Classic with the thick butter crust. The pizza tasted amazing with a great balance between cheese, sausage, and tomato sauce held together with a light flaky crust. I definitely prefer Malnati over Giordano's overwhelming \"cheese pie\" pizzas. <br><br>I highly recommend ordering an appetizer as you wait since it does take about an hour for the deep dish to bake. I had the Bar-B-Lou wings with honey BBQ sauce which came in 9pcs. The wings were crispy and light covered in a savory flavor.<br><br>Overall, my experience earned a 5 star for the environment, food, and price (Malnati's was $2-3 cheaper for the small pizza).", "pics": null}}, {"review": {"des": "I always take out of town guests to Lou Malnati's, but after the most recent visit, I'm not so sure about this location.<br><br>Our party of five arrived early to beat the Saturday night rush and only had a few minutes to wait for a table. Once seated in one of what seemed to be a party room, we waited, and waited, and waited and no server ever approached or was even nearby. Finally, after about 25 minutes, a server came by and asked for our order. We ordered and prepared our appetites for some deep dish! Once the pizzas arrived, I was disappointed that both the classic and Lou were completely soggy. Our server never came again to check on us, and after about 45 minutes of just making conversation and pushing mushy pizza around, she finally came back. By this point, the kids were almost taking asleep so we paid and left. <br><br>Disappointing service, pizza, and experience. So sad for the out of towners to have this as thier first deep dish.", "pics": null}}, {"review": {"des": "We loved the Malnati's salad!  Very tasty!  Tonight I tried a cup of the minestrone which only left room for 1 slice of pizza.  We shared a large between 3 adults and 2 kids and we just add cheese on our half.  Pretty yummy cheese & butter crust!!!!!", "pics": null}}, {"review": {"des": "As honest as I can be, I was not a big fan of deep dish. I went with the classic and chose the butter crust as recommended however I feel that the sauce was watered down and perhaps I should have added some extra toppings. I also ordered the Calamari, which was delicious and came with a larger portion than expected. <br><br>However, later on that night we had an interesting experience when a couple had an argument in front of our table. Wine was thrown and the aftermath was spilt on my boyfriend and I. None of the staff members came to reassure us nor fully addressed the matter. It wasn't that big of a deal however, given the situation it would've been nice or even common courtesy to get checked up on since it occurred right in front of us. <br><br>Aside from that, the restaurant was a nicely decorated and authentic looking! Fun first experience you could say, but probably my last!", "pics": null}}, {"review": {"des": "TBH, too much hype and slightly overrated.<br>I'm a fan of deep dish but i'm still trying to figure out why and how Lou Malnati's is famous. I get that their buttercrust is great, but I personally didn't think it was anything unique. <br>Came in for lunch on a Monday and the restaurant wasn't too busy. The interior was industrial and pretty, different from the red fake leather couches you reminisce about when you think about a pizza joint. <br>We ordered the personal Lou Malnati's pizza and another thin crust pizza just for comparison. <br>I'm all about the texture which kinda makes sense why I liked the thin crust better than the deep dish, but both didn't WOW me. <br>The service was good and attentive and the waiter gave us pretty good recommendations. <br>I'm glad i got to try Chicago's famous deep dish, but if i were to visit again, i'd definitely wouldn't come back. There are sooo many better places to go in Chicago.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/aRXemiAcmmDbE-TLxAkPNg/348s.jpg", "caption": "small thin crust (with basil pepperoni and garlic)"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/roZNI4TenGxJE5ZK_fb7gg/168s.jpg", "caption": "personal size lou malnati's special deep dish (super cheesy but i think even more cheese would be ok)"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/jIHYcpj6GOddT6AEawgg8w/168s.jpg", "caption": "deep dish and thin crust both personal size (small for thin crust)"}]}}, {"review": {"des": "I really love the simplicity of The Malnati's Chicago Classic pizza. You can taste that the tomato sauce is made from real tomatoes. It's sweet and tangy and perfect. The tomatoes are so fresh that you can see chunks of them and the liquid on top of the pizza. Don't worry about a soggy bottom though - the perfectly rich and buttery crust provides the perfect structural foundation. Then there are the cheese and sausage - yum yum yum. It's just really a wonderful pizza.<br><br>The two of us will order a small pizza and use the extra slices for lunch over the next day or two. It's pretty substantive and stays well. It's well worth the price.<br><br>The other stuff from Lou Malnati's is okay. Some of it is good and some of it is unimpressive.<br><br>The decor at Lou Malnati's is really cool: high ceilings, big wooden doors, and kind of industrial. I like the vintage pictures. It's a great mix of modern and history.<br><br>I don't really care to eat at Lou Malnati's. It's really, really busy a lot of the time. it's loud, crowded and obnoxious. The servers are great, but the tourists. You gotta love 'em. We order our pizza ahead of time and either pick it up or have it delivered. The last time we ordered and took a cab to Revolution Brewery on Kedzie. I highly recommend doing that.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/1wCaE_fmrwgIqAOZxdTf8w/348s.jpg", "caption": "The Malnati's Chicago Classic from Lou Malnati's brought to Revolution Brewery on Kedzie."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Wzx6h7-u2xQiao8KF7JlFQ/168s.jpg", "caption": "The Malnati's Chicago Classic"}]}}, {"review": {"des": "Came here for my first ever deep dish experience and was disappointed. For two people we ordered the small Lou and a garden salad to hold us over for the 40-minute pizza cook time. The salad was fine, but the pizza was sub-par. While it looked good, it had little flavor and tasted watered down. We both only ate one slice as neither of us wanted more. <br>Additional comments - 1. we asked for the pizza without mushrooms and our check showed that our waitress noted it, but it came to us with mushrooms. - 2. in the hour we were there, waiters/waitresses dropped stacks of dishes three times. While this isn't directly the restaurant's fault, plates crashing to the ground multiple times definitely diminishes the ambiance. Only here to visit Chicago for a few days, but when returning I won't be back to Malnati's", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/J-mj_jvWnHDWqD42C8O0bA/348s.jpg", "caption": "Lou's small pizza"}]}}, {"review": {"des": "Probably the best deep dish pizza in Chicago. Great vegetarian options are also available", "pics": null}}, {"review": {"des": "Very good pizza.  Service is impeccable and great atmosphere.  The spinach stuffed bread was the highlight!", "pics": null}}, {"review": {"des": "If you're craving that Chicago deep dish - this is your place!!! The pizza and experience was great! The deep dish did take some time to prep and cook (~ about 35 minutes) so hopefully you're not completely starving when you visit here.<br><br>Don't fall shy of the appetizers and drinks, they were just as good! The personal size deep-dish pizza was more than enough for me, and even my boyfriend who ordered a small had some leftovers. <br><br>Every bite was filled with gooey, pizza goodness. The restaurant was quite aesthetic as well. I understand deep-dish pizza is a specialty, but not quite sure if it was worth the wait and price for me. <br><br>Definitely worth the try!!!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/0wbPcUfaS_diNcACOHIHWA/168s.jpg", "caption": "Deep dish"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/cMe2ju2CF6FLelYSDdx6vA/168s.jpg", "caption": "Lou deep dish"}]}}, {"review": {"des": "Well...as a New York Pizza lover I've never had Chicago style pizza.  I was impressed.  We ordered their sausage, pepperoni with spinach.  It was dish of delight.  I loved the fact that they informed us it would 30 minutes.  Anything good is worth the wait.  Everything is made fresh and requires patience.  The crust was thick yet crispy and light.  The sauce was sweet and fun.  When it first came out, it looked like Pizzaria Uno (sorry for the insult), but it was more of a masterpiece.  It can't be compared to pizza - it was an amazing presentation to flavor burst.", "pics": null}}, {"review": {"des": "Second time in there, frequent traveler. . Second time I dinned here..and the wings were cold both times Wings are not suppose to be cold ..sat at bar only two people sitting at bar. Ran out of water.  Was not asked if I wanted a different beverage.  Which I did.  But never ordered.  Also the MALNATI salad was weak.  The bacon was Burnt tasting...<br>  I will look for other choices next time I travel thru", "pics": null}}, {"review": {"des": "Lou Malnati's is a hidden gem in a big city. Visiting Chi Town, I had to try out the city's famous deep dish pizza, and I was in for a big surprise. I ordered a large deep dish pizza that consisted of 5 different flavors and I could taste each of the toppings unique flavors explode wonderfully inside my mouth. The dough was cooked perfectly; soft and chewy in the inside with a nice hard succulent exterior which provided structure to the entire pizza. <br><br>If you're a pizza lover looking for a food gasm, look no further.", "pics": null}}, {"review": {"des": "Excellent pizza! Anytime I'm in Chi, I've gotta have some deep dish. I'd never been to Lou's so wasn't sure what to expect. Service was great, and though deep dish pizza take a while, our server kept constant check on us. Pizza came and was perfect. I shall return!", "pics": null}}, {"review": {"des": "We loved it! We have great food and great time. We have shared a house salad with a custom made deep dish pizza. There was a long waiting time but we sat at the bar were we could also eat! Will go back", "pics": null}}, {"review": {"des": "Fun place to go, good atmosphere and friendly service.  The pizza itself is really not that great, but if you want to go out with friends, have some food, fun and drinks... Lou Malnati's is a good choice.", "pics": null}}, {"review": {"des": "When in Chicago, do as the Chicagoans do and eat deep dish pizza at Lou Malnati's (not to be mistaken with the Illuminati ).  Deep dish pizza is not for everyone, but I'm personally a fan. The crust at Lou Malnati's is the winner, and I appreciate all the meat that they put on our pizza (almost every single inch of our pizza was covered in a slab of sausage).  With that said, our pizza came with  only with cheese and sausage, and we paid ~$2 for pepperoni. A little more variety of toppings without paying an arm and a leg would be appreciated. Our other complaint was that we could've used a bit more sauce- every bite was a mouthful of cheese and a hint of sauce. A little more sauce could've helped balance the cheese.<br><br>Finally, be prepared to wait. We arrived at 5 pm and waited for 45 minutes. They actually text you and have an online wait system, which is nice and allowed us to read at the Barnes and nobles next door while waiting to be seated.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/jf_W-XHoZCw4egfECqtD6A/168s.jpg", "caption": "One half of our small deep dish pizza"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Azh39SPJMjF3UiobQ3NLJg/168s.jpg", "caption": "Deep dish pizza"}]}}, {"review": {"des": "Service was awful. Place was maybe half full, took forever to get someone to wait on me, and the food took twice as long to come out as they said, so I was late getting back to work.  I drank my glass of water when it first came to the table, and it was never refilled. Avoid sitting in Glenn E's section at all cost.", "pics": null}}, {"review": {"des": "I was looking for the real deal Chicago style deep dish, and I knew I had to come here to get it. <br><br>The space is much prettier than I expected. Coming from out of town, I was anticipating an old school pizza counter, but found myself in a casual yet upscale Italian restaurant. <br><br>The service was quick and friendly. Our server was happy to make recommendations about what to order. <br><br>The pizza itself was SO good. Cheesy, gooey, sweet from the sauce but tangy from the sausage-- truly delicious. And I can't forget about the decadent butter crust. <br><br>Also had the pizza chips and dips to start. They're tasty, but it's a heavy dish-- lots of cheese, grease, etc. <br><br>Overall, I can see why this place is a Chicago staple. Definitely worth stopping in!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Hq_dSp6ZctPI2zVhhKXsHQ/168s.jpg", "caption": "Deep dish"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/BObvpm9853OXw2gFPVms0A/168s.jpg", "caption": "Pizza chips with dips"}]}}, {"review": {"des": "I don't even think I need to write this review since anyone who knows anyone here in Chicago will say this is the best deep dish in Chicago. Well they obviously aren't wrong!<br><br>Our server recommended we order an appetizer since the pizza's take 35 minutes to bake. She was able to split the family size salad on SIX yes six checks and made our life wonderful. Always order the salad, ALWAYS.<br><br>The pizza itself was just the right size, had just the right amount of cheese, AND the pizza sauce was incredibly sweet and delicious. I am still dreaming of that sauce. <br><br>I am not the biggest fan of deep dish and prefer thin crust. On my next visit if I am obsessed with their thin crust I will update my review to reflect. <br><br>Knowing in advance the time it takes to bake the pizza is the best thing in the world and I wish every single restaurant would help me through this painful time of waiting for your food starving to death after you order.", "pics": null}}, {"review": {"des": "This place was delicious! The trio sampler was so tasty! The garlic dip paired really well with the spinach dip that I almost forgot there was hummus left. The deep dish pizza was amazing and I would definitely go back for seconds. This was my first real experience with deep dish pizza and I can really see the appeal. The portion sizes were perfect so one wouldn't over indulge. I almost wish I had more room to try their dessert. I would definitely recommend this place to anyone interested in getting deep dish pizza!", "pics": null}}, {"review": {"des": "Solid. I sat at the bar and the staff made me feel welcome. The bartender gave me the heads up that my pizza might take 30 minutes and I ended up waiting closer to 45 minutes. The staff was very apologetic and the manager came out and bought me a beer. A nice reminder that good customer service isn't hard. A little attention and humanity goes a long way.<br><br>The pizza was fantastic. Warning: its filling. If you haven't had Chicago style pizza before its easy to order. I got the small and I got stuffed on two slices. The bartender suggested eggs on top for breakfast.", "pics": null}}, {"review": {"des": "One of the originals, the deep dish is very tasty although we prefer NY style. Given how busy this place is, can be over an hour wait, the service and food are great. Fortunately there are enough local places to hang out whilst you wait for a table.", "pics": null}}]}