{"name": "lou-malnatis-pizzeria-chicago-4", "reviews": [{"review": {"des": "Ordered two large deep dish pizzas. One with sausage and pepperoni and the other just cheese. The sausage is kind of weird like patty chunks. But the pepperoni is so good! I definitely recommend picking up vs delivery. Our pizza was ready for pick up in 20 minutes!!!<br><br>Ugh just look at how melty the cheese was!!", "pics": null}}, {"review": {"des": "Our large deep dish extra pepperoni was not fully cooked :( <br><br>For the first time ever, I found the crust gummy.", "pics": null}}, {"review": {"des": "Classic Chicago deep dish<br><br>I'm from the NYC/Nj area where pizza is in no shortage but I love it when I come to Chicago I get the deep dish<br><br>A small pizza is enough for two people but today I got the Medium. Two slices made me more then fill. I also opted for just cheese today and it was flavorful enough<br><br>We did the wings also and they are standard pizza shop wings. Not bad just nothing special <br><br>I'll be back everytime I am in Chicago hopefully", "pics": null}}, {"review": {"des": "I didn't think I liked deep dish pizza before I tried Lou Malnati's. We asked some local friends where to get deep dish in Chicago and not fall into some tourist trap, and many of them said Lou Malnati's. So that's what we went with! We were not disappointed.<br><br>The atmosphere is no-nonsense and they let the pizza speak for itself. We started with a tasty Italian salad with lots of toppings, and the lettuce was green and fresh.<br><br>We decided to go with the Lou Malnati's special pizza - we just added some pepperoni. A small was plenty enough for two to share. The sauce on the pizza and the crust are what makes it tasty. The \"Buttercrust\" is crisp and flavorful. The red sauce is really really delicious. There wasn't TOO much cheese either, which I appreciated. The service is great and efficient - they cut the pizza and serve it on your plate, and did the same for the salad. It feels old-school and I like that.<br><br>While I'm still not the hugest fan of deep dish pizza, I knew it was a Chicago \"experience\" we had to have. I'm glad we chose Lou Malnati's - it was worth it!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ZTB2YABDJEK-PvfBKFXGbw/168s.jpg", "caption": "Lou Malnati's salad"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/zkNcJj7ALEvvf9UARZUnBQ/168s.jpg", "caption": "Small pizza with pepperoni, sausage, tomatoes"}]}}, {"review": {"des": "I think Giordano's makes some of the worst deep dish pizza in the world, and I have been hating on Chicago's deep dish scene for this reason for years.  (San Francisco has better deep dish, Yelp!  I don't know why, but they do!)  When I was making a work trip to Chicago, my friend insisted that I give Lou Malnati's a chance.<br><br>I like that this particular branch of the chain is not full of tourists so I happily strolled in for lunch at noon on a weekday.  There were 3 or 4 other parties when I entered.  I was interested in the lunch special, but I wanted to ask my server more about it.  You see, Giordano's has a similar lunch special, but they only serve frozen pizzas on it.  These are the same pizzas you get in the grocery store but sold at a premium price.  Lou Malnati's does serve frozen pizzas at the touristy locations, but this location makes the lunch special fresh, my server reassured me.<br><br>With this information, I ordered the Personal Cheese Pizza Lunch Special ($9.50), and it came with a house salad or soup.  I got the house salad, which was very large and had a nice house vinaigrette.  The personal cheese pizza was just the right size and had plenty of cheese.  Personally, I have had better crusts, but the crust was perfectly fine.  I enjoyed my meal and thought the price was very reasonable.<br><br>Overall, I think Lou Malnati's is the best deep dish option in Chicago, and this location was very enjoyable.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/vd7ZZYWZ1mPrDBzWc2WB7Q/168s.jpg", "caption": "Lunch Special (Salad or Soup and a personal cheese pizza) ... $9.50 pre tax"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/AawRcJgiqP9y6NOwpuKqFw/168s.jpg", "caption": "Lunch Special (Salad or Soup and a personal cheese pizza) ... $9.50 pre tax"}]}}, {"review": {"des": "Not a big deep dish pizza guy but went in Chicago you got to get the stuff. Be prepared to wait a while to get your pie but it's a great experience", "pics": null}}, {"review": {"des": "The only problem with Lou's is that I order from here too much. Have not had a mistep with this location in over 8 years. Great pizza and service.", "pics": null}}, {"review": {"des": "This review is for zaaaa only as I ordered delivery. I'm a big fan of pizza as I am on a quest to find the best pizza in Chicago and I have been to many places. But I still have about 7 more places to go of what is considered the best in Chicago. I have eaten Lou's many times before even back when I was living at my parent's house in the suburbs. I love their pizza! I love their crust, love their cheese and sauce, and love their ingredients. They are the best deep dish out of the Big Three (Lou's, Gino's East, and Giordano's).  Now comparing it to Pequod's and Art of Pizza, I think it goes Art of Pizza, Lou's, and Pequod's. I really like Art of Pizza's crust and sauce better than Lou's. Don't get me wrong, Lou's is excellent! <br><br>Lou's Cornicione (edge of the crust) is actually a lot thinner than the other places, but it is very crispy, which I like a lot. Their ingredient's are awesome and they have some of the biggest pieces of sausage in Chicago AKA the Sausage King. JK, but I hope you get the reference. The cheese is solid and I enjoy their sauce. The sauce is usually what people don't like about it and it's usually the picky eaters that don't like tomato chunks. I think their sauce is the weakest part of the pizza, but it's still not bad. <br><br>I have never dined in at this location, but deliveries have always been timely. Deep dish pizza is more expensive than regular pizza, but Lou's is worth the price!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/bDD3siuYG7b1Oh2IfN5yeQ/168s.jpg", "caption": "Pepperoni, Sausage, Spinach, and Butter crust zaaa"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/8zBc5okPNxhzWxCOjV93JA/168s.jpg", "caption": "Pepperoni, Sausage, and Spinach deep dish pizza. Obviously I couldn't wait..."}]}}, {"review": {"des": "A beautiful day in Chicago and after shopping downtown we hopped on the L and headed up to Lou's!  <br>A short walk from Fullerton stop on Howard train. <br>Of course we had to order the Classic Deep Dish. We added mushrooms. Ordered 2 cold beers and the pizza soon arrived. Absolutely delicious!  Nice and hot and gooey!  You can't go wrong at Lou's. <br>Also, this location has outside seating.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/nJSmXt-poxBUmtYQRwHOLg/348s.jpg", "caption": "Classic Deep Dish with Mushrooms"}]}}, {"review": {"des": "We needed a place for a quick bite to eat before seeing a show at the Apollo Theater. <br>Luckily,  this restaurant had immediate seating for the four of us in the dining room.<br>This is a typical Lou Malnati - very standard menu.  The food and the service is okay.<br><br>Short and sweet", "pics": null}}, {"review": {"des": "‍WONDERFUL server--Thanks,Katie!  <br>Great Chicago deep dish and really good gluten-free pizza. The wine  prices are a bit steep but I did enjoy the chianti!  Lacking in atmosphere but very fresh and clean. They also sell frozen pizzas.", "pics": null}}, {"review": {"des": "Classic Chicago pizza - we carried out because the wait was long.  Delish deep dish!  Try the Lous!", "pics": null}}, {"review": {"des": "We ordered the Deep dish pizza with veggies. We had for starters the garlic bread and marinara. Man one of the best Marinara I have had. The beauty of this dish is it's simplicity. But the ingredients have to be right especially the ripe tomatoes. This dish brings out the fruity taste of Tomatoes and that is the pleasure. Wow. As the Lou Menu claims they sure choose their tomatoes. <br><br>But such exquisite tomatoes sauce was less in the pizza. I didn't like that.", "pics": null}}, {"review": {"des": "Honestly, I am not a fan of deep dish. I will take Detroit style, New York style, or wood-fired oven style anytime. But...<br><br>We come here often for work lunches, and I'm never sad after, like I am with other types of deep dish. Lou's is deep dish without pushing you to your limits and making you feel terrible about yourself. <br><br>The only thing that's disappointing to me is that I'm a veggie pizza person, and their veggie pizza has a different kind of cheese combo, and I don't like it. So I stick with pepperoni or cheese. But, like I said, not as heavy as other deep dish pies, so with a big helping of one of their delicious salads, one slice fills me up without all the guilt.<br><br>They do have great salads.<br><br>The service is always fantastic. I've been here with my coworkers and a few other large groups. Both when we've called ahead and ordered when we got there, the service is fast (for deep dish) and the servers are attentive. With large groups, they bring the salads quickly, and they serve the pizzas efficiently without making anything feel rushed. They always come back to check on us too.<br><br>So, for someone who hates on deep dish on the regular, I really enjoy this Lou's location.", "pics": null}}, {"review": {"des": "We ate there on a Saturday early evening and were seated right away, so points for that. Our waitress was promptly there, everything was smooth, except the pizza. We ordered a large deep dish with a bunch of toppings including sausage, garlic, mushroom, and peppers, and half spinach, and it was honestly not deep dish status. There wasn't enough cheese? No that's not a question, there wasn't enough cheese! (Firm tone). Like it was pan pizza status cheese, not omg I really can't have the second slice, i mean the reason we wanted deep dish is for the cheese to be overwhelming and for us to hate ourselves for having it. The Lou Malnati's salad was good though. Wouldn't recommend, go to Giordano's.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/3385dwnMbz81YskN7Le8Iw/168s.jpg", "caption": "Deep dish with as little cheese as a normal pizza"}]}}, {"review": {"des": "Great deep dish pizza. We had the Lou's and it was beyond perfect. I highly recommend the Malnati's Salad. The family size is perfect for five people.", "pics": null}}, {"review": {"des": "So glad we chose this for our first true original Chicago deep dish pizza! Be patient- it's worth the wait!!!", "pics": null}}, {"review": {"des": "I love Lou Malnati's pizza! Great pizza make with excellent ingredients.  While my favorite is still Pequod's, Lou's is definitely up there in the top 10 best pizza places ever! The table service at this location was very good and the environment was clean and welcoming. I will definitely be back next time I am in Chicago!", "pics": null}}, {"review": {"des": "Outstanding pizza- butter crust to die for - flavorful - I had the veggie style add beef sausage .. amazing I would recommend", "pics": null}}, {"review": {"des": "Ordered pizzas through the yelp app and was thoroughly impressed with the efficiency of the whole process! <br><br>Our order included the Lou Malnati's Pizzeria special as well as the all veggie pizza and both were great. Also ordered two orders of the house salad and everyone was really impressed w the dressing!", "pics": null}}, {"review": {"des": "I'm trying to think of a better pizza that iv had and really can't think of one. Wow! Amazing! #mytravelingmunchies", "pics": null}}, {"review": {"des": "Wow finally got to try the famous Chicago Lou Malnati's Pizza and I we were all impressed by believe it or NOT, the Malnati's SALAD (Romaine lettuce, tomatoes, black olives, mushrooms, salami bits and gorgonzola cheese with our Sweet Vinaigrette and romano cheese).  The custom made vinagrette is really what sets it apart.  A seemingly simply salad transformed into a balanced flavor explosion in every bite, simply amazing.  The salad was strangely one of the best things we ate in Chicago.  Simply unexpected when visiting a pizza joint, we got the $14 family size portion which was HUGE for the three of us.  The salad deserves 5 stars and an award in and of itself.  What a deal, and ordered two other pizzas.  <br><br>One Malnati Chicago classic which was one of our favorites and the Lou which was our less favorite of the two, most likely due to the vegetarian nature of it.  Honestly, I think they could make the Lou pizza better even though it is vegetarian.  The topping or ingredients just didn't stand out or pop like the should.  Therefore, I would have given them 5 stars if it wasn't for the Lou.  I know I maybe being critical here but I have tried many different types of pizzas and believe my judgement really is fair.  On the bright side, service was impeccable as it is at many Chicago restaurants.  Dare I say better than most bay area restaurants?  YES, why indeed it is.  Just visit Chicago and go on a food tour so you can understand what I am saying.  Lou Malnati's is worth the visit!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/gdSkByRRzXT4VuryF8CXvQ/168s.jpg", "caption": "Malnati Salad (GF)"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/7QBKy8sPC4eGRI8CL0JwBg/168s.jpg", "caption": "The LOU"}]}}, {"review": {"des": "I had high expectations for Lou Malnati's, based on all of the great things I've heard about their pizza. I finally decided to give it a try while I was in town. The pizza did not blow me away or wasn't anything special, but it did taste good. I would rate their pizza as average at best and it falls in the middle of the spectrum. <br><br>The service was great and the restaurant was clean. <br><br>If it is convenient, I probably would get the pizza again to give it another shot. However, I will probably stick to my favorites when I am in Chicago again.", "pics": null}}, {"review": {"des": "I (happily) stand corrected. Turns out the pizza I got last time was just an off night. The pizza that I am (pause) eating and (pause) wiping on my shirt right now is amazing. What the hell? I don't know. Like I said, (burp) an off night. This is damn good pie. I'm so glad to know everything is back to normal. <br><br>Key takeaway: Don't be so hasty to write a review. (He says as he's literally eating the food right now.) <br><br>Second key takeaway: Fantastic food. Great management. They care. I like that. (Who the hell wouldn't?) <br><br>Thank you! (PS: Great delivery driver, by the way. Very friendly. His name was Marcus, I think...)", "pics": null}}, {"review": {"des": "Great deep dish and nice location! We sat outside since it was so beautiful out. I got the Lou and my BF got the original meat personal pan. Both were very yummy and cooked to perfection. I have had the salad before and remember how great it was! <br>Only slightly negative thing is that I wish they had more drink selections like draft beers and what not. We were fine with bottles but it would have been nice to have more local draft selections. Our server was nice and attentive. Overall it was a great Chicago deep dish experience. I would always recommend Lous!", "pics": null}}, {"review": {"des": "Lou's was fantastic. I 100% recommend ordering the Malnati Chicago Classic. This was maybe my first and only pizza that was made with REAL tomato sauce (like, there were real chunks of tomato, amazing). I also didn't know what a \"buttercrust\" meant when I read it but now I know it means heaven. <br><br>I had my first Chi-city deep dish experience 2 years ago and have only been a religious follower of Giordano's up until this point. I LOVE Gio's but was finally peer pressured to give Lou's a chance - all I can say is, thank god for foodie coworkers who help point you in the right direction. Service is also awesome here.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/H9KmszGaR--EYbiSLQM31w/348s.jpg", "caption": "The Malnati Chicago Classic. Real tomato in the sauce"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/egRxykOBUQ1zTDnCNk2_PQ/168s.jpg", "caption": "The Malnati Chicago Classic"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Zq3b6PeCUn8r2EWNS4j5Qg/168s.jpg", "caption": "Buffalo wings"}]}}, {"review": {"des": "Aye! Check out this little carb hack. It's pizza.... but wait for it.... the crust is sausage! That's right! Sausage is the base. Then topped with sauce, cheese, and your choice of toppings. Nice little hack when you get invited to the ever so daunting deep dish party your out of town friends will invite you to.", "pics": null}}, {"review": {"des": "I'm generally a fan of Lou's but this location is lacking a little for me.<br><br>On the day I went, there was a pungent smell near the back of the dining area, we asked to be moved, and were very welcome to do so. Smell bad, service good.<br><br>Ordered a half Malnati, half Lou's. It was a little under baked (as a personal opinion) and a little cold. <br><br>We told our server, who was concerned enough to let management know (good) who then argued that he can see the steam coming off the pizza still (bad). Sure there might have still been steam coming off... but the pizza overall (cheese??) was sitting at a comfy slightly higher than room temperature, at first slice. Sure, it might have been steaming because the center of the pizza, where the sauce sits is made of liquid and retains heat better than the other parts of the pizza... Idk, I don't know if arguing with me about the pizza was the best way to handle it. I would've had a less sour taste in my mouth if they just offered to plop it back in the oven for a bit (which management did offer, after arguing about the temperature of my pizza).<br><br>Oh, on the plus side, the wait at this one was SIGNIFICANTLY. shorter than the other two I've been to. So instead of waiting an hour+ to be seated + 30 minutes for your food to cook, we only waited 30.", "pics": null}}, {"review": {"des": "Just look at the picture and tell me how crappy this location's pizza is. Awful. I thought lous was the best pizza in Chicago. This was more like a frozen pizza from a middle school cafeteria. And for $30! Save yourself the disappointment and order from Pizanos instead!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/jzEtjSmyi-yz9BNVJkcn2w/348s.jpg", "caption": "I thought lous was the best pizza in Chicago. This was more like a frozen pizza from a middle school cafeteria. And for $30"}]}}, {"review": {"des": "I recently had a friend tell me Chicago Deep Dish isn't pizza, it's lasagna. My response? \"Dude, whatever you wanna call it, it's amazing.\" He's wrong, of course, but he's from Salt Lake City, so what does he know?<br><br>Reasons you go to Lou's:<br>-Because you're a living, breathing human being who enjoys, at least periodically, incredible cuisine<br>-To have fun and socialize at a place where there's enough time before your food comes out to connect and not be interrupted (put your phone away)<br>-Because you've been betrayed by another, lesser pizza place<br>-You want to try the best pizza in the city<br>-You already know it's the best pizza in the city and are back for your 482nd time<br><br>What you may not know about Lou's:<br>-While they are known for their deep dish pies, they also have incredible thin crust...similar flavor in a smaller package<br>-The best thing on the menu isn't the pizza (although it's my very favorite), it's the Malnati salad, but you must get it with the sweet vinaigrette (that's how it's supposed to come)...also, the regular salad will be just fine for 3-4 people, the family size is just massive, so unless you're a group of 5 or more, don't feel like you need that much<br><br>I love this location because when there's a wait to be seated, they'll often put out some thin crust pizza for folks to munch on before they're seated. The staff is super attentive, and they have a few TVs so you don't miss whatever Chicago game's on.<br><br>My most frequent pizza order is a large pepperoni and garlic. The sauce is sweet and garlicky already, but I'm a FIEND for garlic. The sausage patty is great if you like sausage on your pizza, but it's a lot to eat, so be prepared. I'll also get the spinach mix on a pie every once in a while to get my vegetables in :) If you do get a lot of veggies or spinach, I recommend getting it well-done, so the bottom doesn't get soggy.<br><br>DON'T SKIP THE BUTTERCRUST!!!<br><br>To be honest, order whatever...Lou's won't do you wrong.", "pics": null}}, {"review": {"des": "We were told our table would be ready in 25 minutes, but they invited us to make the order for the pizza right then to save us some time, which we all thought was pretty smart.  Table was ready in about 15 minutes.  Salad was great, pretty rich, the right amount of house dressing that was bottled (they sell them at the counter) but respectable. The deep-dish lived up to its reputation.  Tangy sauce, not over-bearing on cheese, good ingredients, crust that was crisp and tasty, with a hint of butter on the outside.  Service was detail-oriented and upbeat.  Family friendly, very accommodating to the 1 and 5 year old in our party.<br><br>Only things I would change is more draft beer choices and fewer bacon bits on the salad, about half.  OK, and maybe have a house dressing that is made in house.", "pics": null}}, {"review": {"des": "Overall I'd recommend Lou Malnati's. Good atmosphere, and friendly staff. The pizza was good, but didn't really blow my mind. The house salad was good, and made for a great appetizer. Weirdly, the Coke was AMAZING. <br><br>Overall, very positive experience, and would recommend!", "pics": null}}, {"review": {"des": "This is by far my favorite pizza spot in Chicago!!! I've had their deep dish and thin crust many times. I love love their pizza sauce- it's a little more tangy than other pizza places in the city which like and their buttery crust is sooooo delicious. For as many times and how long I've been going there for, I just found out that you can order their classic buttery crust, which basically is more butter and tastes a lot richer than what they normally serve. I highly recommend that. This review I wrote just made me hungry for Lou's...Ok, going to go grab some now :)", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/RgRyJa45MJfhiuCDFCZz_g/348s.jpg", "caption": "Thin crust"}]}}, {"review": {"des": "Lou Malnati's was my introduction to deep dish pizza! And, I'm so glad that it was delicious! The place was packed, but since we went a little earlier, we were able to get seated fairly quickly. <br><br>Deep dish takes time to cook, so we started off with a salad. Portions are very generous here, even the salad. <br><br>The crust was nice and buttery. They are very generous with the toppings. I love cheese and they definitely did not disappoint. I believe we got \"The Lou\" and added sausage and pepperoni. It was delicious! <br><br>The service was great. They served us each slice of pizza... I was so surprised. The waiter was fantastic and attentive.", "pics": null}}, {"review": {"des": "For our first trip to Chicago I had seemed out advice from all of my friends who live, have lived, or been to Chicago in regards to pizza and hot dogs.  <br><br>Malnati's was recommended by a few, among a couple other restaurants.  I cannot speak for the others restaurants, but I am definitely not upset that we chose Malnati's.  <br><br>I am a die hard New York pizza lover, but I have to say Chicago makes a great pizza.  Different from New York, of course, but I think that's why I can hold it in such high regard as well.  <br><br>Will definitely visit again when I am in Chicago.", "pics": null}}, {"review": {"des": "A fantastic dining experience, as usual. The manager, Josh was very knowledgeable and helpful with food allergy needs. He took the time to talk with me and we went over the ingredients together.  I cannot express enough gratitude for his kindness and the kindness of our server who also made sure we were all well taken care of. Thank you so much, we look forward to returning.", "pics": null}}, {"review": {"des": "Possibly worst meal I had in past year, and definitely the worst pizza.  It tasted like cardboard.", "pics": null}}, {"review": {"des": "So, Chicago...New York...deep dish...thin dough...slice weighs a pound....slice folds in half...   Mary Ann...Ginger....wait, got carried away with the dots and that's another conumdrum ...altogether!<br><br>Back in the Second City and we Funksters are pizza jonesing bad.  Lou's at the corner of Wrightwood and Sheffield answered the call with the Malnati's Chicago Classic. The downside was the wait...1.5 hrs to prepare the thing and wait for a seat, but we knew that going in.<br><br>So we hoofed around the DePaul campus just a couple blocks south, sat and watched the local hipsters a little, then got the electronic heads up that a table was ready and the deep dish not far off.<br><br>These folks have service down pat. While stations are clearly identified, everyone pitches in. Efficient and simple.  None better in the pizza game.<br><br>To our drink orders we added a Malnati Salad - Romaine lettuce, tomatoes, black olives, mushrooms, salami bits, gorgonzola cheese bits with a fantastic light house-made red wine vinaigrette and romano cheese. A Family serving for $13.55. The three of us managed to lick the bowl dry! Table manners be damned!<br><br>Finally at exactly 1.5 hrs from the time we walked in the front door the medium Classic came steaming to the table - Lou's lean sausage, some extra cheese and vine-ripened tomato sauce on the famous Buttercrust $18.75.  For the uninitiated, Buttercrust is a cross between a traditional pizza crust and a pot pie crust.  More pastry crust like, yet not flakey, but as it's name implies buttery smooth in taste.  We each had a slice... more like a slab really and all split a slab. And that left two slabs for breakfast in the AM.<br><br>Would we return? In a Popa Chubby Nobody Loves me Like I Love Myself blues minute!<br><br>Now for that Chicago...New York thing.  Actually I'm going with Lorain...Yala's. Best dang pizza EVER!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/mBIzZyLFzdp1RKD4pvLpOw/348s.jpg", "caption": "Everybody adds pizza pics!"}]}}, {"review": {"des": "Want a fresh pizza? Call Domino's!  <br><br>Every time we order delivery from this Lou's location there's an issue...they get the order wrong, they forget to bring the soda's, they can't figure out how the directory works etc.  Inevitably the pizza shows up cold so we decided to try picking it up instead.  That hasn't worked out much better.  Last night we were told the pizza would be ready at 7:40 so we showed up a few minutes early just in case it was done.  The girl working the counter took our name but didn't bother to go back and see if our pizza was ready until we asked.  When we got the pizza it was already cold...is it that hard, you're a pizza place! <br><br>There are too many options in Chicago to waste your time or money on this very poorly run version of Lou's.  I love your pizza but this location needs to get their collective act together...you give Lou's a bad name.", "pics": null}}, {"review": {"des": "This place is fantastic! The food is great and the service is phenomenal. I can't say enough about the experience. They were busy and we had to wait a little longer than expected, so the manager offered to buy us an appetizer and start our pizza order early. We sat down to a wonderful appetizer and the pizzas followed shortly afterwards. Then to top it off, they gave us a cookie pizza topped with ice cream for free too.  Over and beyond!", "pics": null}}, {"review": {"des": "i dont typically like deep dish pizza because of the sauce to cheese ratio but.. Lou's was AMAZING.<br>They have the sauce cheese ratio down.<br>Food was delicious Will be back if I'm ever in town.", "pics": null}}, {"review": {"des": "Probably the smallest location that I've been to. Two stars down simply due to service and quality of the pizza.  I came in with a friend and we shared two personal sized pizzas. While most of the pizza was delicious, the sauce was watery and ultimately made some of the crust soggy. This has never happened at any other location. The service here was also very mediocre. The waiter didn't check on us much and the table we were sitting at was also sticky. Will I go back to Lou's, definitely. Will I go back to this location, not too sure.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/FPIeFt6dlcj6RAtei9Tnww/348s.jpg", "caption": "Personal sized Malnati's Classic (bottom) And the Lou (top)"}]}}, {"review": {"des": "Wow if you are visiting Chicago for first time, you have to came, the pizza it's amazing, tasty. Juicy, really delicious food; we ordered 2 Chicago style pizza, bruschetta and all the flavors on your mouth are an amazing, excellent experience. Also the service is really really good. You definitely have to try it.", "pics": null}}, {"review": {"des": "I've been to other Lou Malnati's locations, and don't get me wrong-- Lou Malnati's deep dish is great. When I'm with a group, we always get the Lou and the Malnati classic, whose flavors complement each other perfectly. Delicious! <br><br>I felt the need to write this review because of an experience I had at this location when I came with a friend a few months ago. I got in a little earlier than her and asked if I could put my name down for a table. As there weren't too many people at the time (it was pretty early), the hostess told me we didn't need to put our names down, and that I could just be seated when my friend arrived. Unfortunately, people started to trickle in, and before I knew it, there was a bit of a wait. That was understandable-- I waited until my friend arrived, and we put our name down together. We also pre-ordered our pizza when we put our names down. We waited for about 30 minutes before we were seated-- again, totally understandable. <br><br>Unfortunately, that wasn't the last of our wait. After being seated, we sat at our small table in the corner for over an hour before we received our pizza. Maybe it was because we were sitting in the corner, but over the course of that hour, our waiter stopped by our table --maybe** once-- the entire time. We ordered 1 small pizza between the two of us because we weren't too hungry, and it took over an hour (combined with the 30 minutes in which we had pre-ordered our pizza?). I've never had to wait that long for deep dish. <br><br>The pizza tasted like every other Lou's location I've been to, but the service here was disappointing to say the least. I will not be back.", "pics": null}}, {"review": {"des": "Had the second smallest size pepperoni pie - they say it serves 2, but I practically ate the whole thing and I ate some garlic bread too. I wonder if their portions are too health conscious :). <br><br>The pizza was great and I'm really glad they took the order while I was waiting to be seated - it takes 40mins to bake. Also the marinara sauce for the garlic bread was delicious. <br><br>Also they have an awesome sign inside the pizzeria regarding kale, tofu and other hipster sauces.", "pics": null}}, {"review": {"des": "So admittedly, I'm usually not a huge deep dish fan. But, when in Chicago... We stopped here for dinner on the recommendation of a coworker. And the food was pretty good! It also helped that we got the smallest size possible, because deep dish is so heavy that I can't have huge amounts of it. We got the wings, salad and an individual pie. Everything was fresh, it tasted great and service was friendly too.", "pics": null}}, {"review": {"des": "On my first visit to Chicago I was hoping for a deep-dish pie that would finally show me what all the excitement was about. My friends enthusiastically suggest Lou Malnati's (which was conveniently next to the bar we were going to afterwards).<br><br>The restaurant definitely seemed like chain that is family oriented, and the decor was pretty standard fare. Service was sluggish at best. The place wasn't too busy, but it took 15 mins just to get our drinks. We decided to get an appetizer (chips & dip), and it arrived 25 mins later, about 5 mins before the actual pizza.<br><br>The pie itself was tasty, but not tasty enough to change my preference for its thin crust cousin. I will say that the butter crust was amaze-balls.<br><br>Food: 3/5 (Except the crust...5/5!)<br>Service: 2/5 (Staff was friendly, but slow)<br>Atmosphere: 3/5 (Like an Olive Garden, but from Chicago)<br>Price: 3/5 (Average stuff)", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/T7BDb08XEmAvhWbDu2eCZA/168s.jpg", "caption": "The chips and 3 dips. The garlic stuff was the best by far."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/kKI25PD90MoizS9QR9TboA/168s.jpg", "caption": "The Classic. Good, but not life changing. Only the crust was life changing."}]}}, {"review": {"des": "I'm thinking maybe there management changed or something at this location. I've been ordering pizza here since I moved in July (almost every week), but as of the last two times they have messed up 4 different time..<br><br>First time, I order a pizza.. they deliver & it's wrong. No big deal. They resend the pizza & refund me.<br><br>Second time, this is national pizza day, and it was a blizzard outside so I'm sure it was a crazy day for the restaurant. However, I order the pizza, the pizza takes three hours to deliver && it's wrong.<br><br>I call and they offer to send another pizza, as the pizza was on its way an hour later (no big deal) the pizza delivery guy apparently slipped and so they had to make another pizza. In light of messing up my pizza and the delivery person falling they call and let me know they are gonna refund me and all this stuff.<br><br>They finally come, bring the right pizza this time, and they offer me two heart shaped pizzas. Which were are labeled pepperoni (my favorite). <br><br>I made one of those \"pepperoni\" heart shaped pizzas tonight, and it's freaking sausage !  I don't usually give restaurants crap, and am a very understanding person, but this is absolutely ridiculous lol I just want what I ordered. Get it right people. <br>End rant.", "pics": null}}, {"review": {"des": "At Lou Malnati's, you should order all and any deep dish pies with <br>1) extra cheese<br>2) b u t t e r c r u s t <br>Always. <br>Without any special requests, their deep dish pies seem to be heavy on the tomato sauce. <br><br>If you  are a tourist or a local, the Chicago Classic does not disappoint. <br><br>If you are waiting more than an hour (which is normal) and at the Wrightwood and Lincoln location: go to PROST next door and order cheese curds (and a beer). Pretty quick order there. You'll be finished and paying for that appetizer before they even call your name to be seated.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/VOT1c6_gbWcyKSAQjo67fg/168s.jpg", "caption": "Pepperoni Medium Slice"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/KuQV5l_xGlAwKM4aSa3-3A/168s.jpg", "caption": "Menu"}]}}, {"review": {"des": "Literally the best pizza I've ever had. You must try the Malnati's classic. Perfect mix of tomato's cheese and spices. And the sausage is unreal.", "pics": null}}, {"review": {"des": "I'm a huge fan of Lou's! You must try their cheese bread. After seeing several other tables order this appetizer, we knew we had to get one too. It's sooo good! We stopped by on a weekday during lunch and they offer amazing lunch specials. For ~$8.50/person, you get either a soup/salad and a personal pizza (cheese, sausage or pepperoni). It also includes a drink! We loved the salad because of their croutons. So good! What I love about their pizza is that the sides are slightly crunchy. I'm personally not a huge fan of dense deep-dish pizza so I loved Lou's since the crust wasn't too heavy. Between the sausage and pepperoni personal pizza options, we enjoyed the sausage pizza more. I can't wait to go back!", "pics": null}}, {"review": {"des": "HANDS DOWN the best deep dish pizza in Chicago. Trust me, I know. I was there for 4 days and tried 4 of the top-rated deep dish spots in Chicago. LOU MALNATI'S FTW!<br><br>Ambiance is like any other pizza joint. Service is great. There is usually a 1-2 hour wait, but luckily we came in at a great time with no wait time at all! They serve local beer which is always a plus. We came on Good Friday so we ordered the veggie aka \"The Lou\". PERFECT CRUST, PERFECT AMOUNT OF CHEESE/INGREDIENTS, PERFECT SAUCE... PERFECT ALL AROUND. And this is just their veggie.......<br><br>We intended to come back another day to try their Lou Malnati's signature sausage based pizza but unfortunately didn't get to it. So for now I will dream until the day I am united with its perfection.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ytbgM0GICwB8HmawTEROlg/168s.jpg", "caption": "Local beer"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/b5vQrYmEmeCEI2vP0g-6QA/168s.jpg", "caption": "The Lou"}]}}, {"review": {"des": "From what I've heard, Lou Malnatis is synonymous with local Chicago franchise. Well, ever since they've birthed Uno's Pizzeria. They created this guy to be the only in Chicago restaurant. <br><br>We did a pick up order on a large Chicago classic. As much as interaction with this particular shop. We were pretty much in and out. My fiance dropped me off,, me and my friend walked in. I said I was there for pick a pick up. They took my name, the brung me my pie, I gave them my cc, they swiped it, a receipt came out, I signed it and we were on our merry way. No baby momma drama. <br><br>The whole transaction was really pleasant, the pie however was a different story. I don't know, but it was a bit blandish. I don't know if that's a word, but I guess it's an adjective enough. They did give us pepper flakes and parmesan packets to doctor up the flavor. The slices for some reason left me with a \"where's the \"MMM\" factor?\" kind of feeling. <br><br>The front of the line employees were great. Just the food was a tad bit lackluster.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/-M5zLcgciqw71FB7FNm7CQ/168s.jpg", "caption": "(\",)"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/K2fxBv_KB15qHD8ceoxFUw/168s.jpg", "caption": "(\",)"}]}}, {"review": {"des": "Pickup Lunch order, Lou's Sausage Deep dish with extra cheese, butter crust. Consistently excellent throughout the city.<br><br>Easy call, great service, on time. No complaints. Only the sounds of pleasure as I destroyed my personal pizza.<br><br>Just enough to fill me up on the go. A bit steep but sometimes you have to treat yourself on the road.", "pics": null}}, {"review": {"des": "This place is worth the hype. This location is smaller than the downtown location and doesn't take reservations, so keep that in mind before showing up absolutely starving. The nice thing about the wait is that they take your number and will text you five minutes before you can sit allowing you to visit a nearby bar for a cocktail. We ordered the malnati salad and the \"Lou\" for two. Perfect amount of food, but if you are really starving and want to be gluttonous I'd recommend getting a slightly larger pizza. We ordered the pizza well done because we wanted a crispy crust and I would definitely recommend this. The Lou is a vegetarian pizza with mushrooms, spinach, tomatoes, three types of cheese and a garlic buttercrust. It was awesome. Cheesey, flavorful, crunchy, gooey. I'm going to be craving this.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/bw6Qn2t7hGGuAT5FIG22aA/348s.jpg", "caption": "A piece of the \"Lou\". Well done."}]}}, {"review": {"des": "Long wait, but mmmm the butter crust. Chicago is one of my former homes, and it was so good to go back and eat some authentic Chicago pizza. Many things have changed in Chicago, but the pizza is still incredible.", "pics": null}}, {"review": {"des": "We met up with a couple of friends from Austin for dinner here yesterday after we spent the afternoon on the architectural boat tour. We were only going to eat deep dish once, so we did a lot of research as to where to go, and we definitely chose wisely with Lou Malnati's. <br><br>There was a 45 minute wait, but they have you put in your pizza order early so it'll be close-to-ready by the time that you get seated. Instead of hanging around in the crowded foyer, we went across the street to the taco place and got some drinks (LM's will text you when the table is ready).<br><br>We got the family house salad, which was a nice start the meal, and a ton of salad for the price. For pizza, we shared the vegetarian 'Lou' and we also got the 'Chicago Classic', deep-dish style, natch. Both were unbelievably cheesy, saucy, and packed with toppings. SO GOOD, SO FULL. <br><br>Our server was awesome, and we had a great time here. This place lived up to the hype, and we're glad that our Chicago deep-dish experience was a satisfying one.", "pics": null}}, {"review": {"des": "Alas, I think it's time to assess my opinion of The Lou Deep Dish Buttercrust Pizza. Lou Malnati's was my favorite pizzeria since my BFF Jacqui lived around the corner from the original Lou Malnati's at Albion and Lincoln Avenue. <br><br>Tonight my BFF Sue and I rushed into a busy Lou Malnati's on Wrightwood. We were given a 35 minute wait time so I ordered a 14\" The Lou Deep Dish Buttercrust at the counter, to be ready when we obtained a seat. 40 minutes later we were shown our seat and it was 9pm. <br><br>Sad to say, when I questioned the hostess if  she placed our order, her response was \"I don't know.\"  Alarm bells going off, I told our waitress we already ordered. She didn't seem to know anything. So I said, \"Please find out if it's been ordered. If not we'll revise our order \" <br><br>Unfortunately she returned promising our pizza would be ready in twenty minutes. By now we'd waited nearly an hour. We shared a delicious salad and waited. 30 minutes later, a sad, uncooked, water swimming pizza came out. <br><br>The manager tried to tell me this was normal for a LOU. He tried to tell me the LOU pizzas I've eaten since high school was wrong and this was the way THE LOU always came out!!!<br><br>I couldn't eat it.  It was uncooked. Sue couldn't eat it. We got up to leave. I almost paid for the salad. I decided they should comp us our small salad and two teas. Fortunately he agreed. <br><br>Two ours after we walked in their door Sue and I left, hungry and sad the pizza we craved never materialized. It'll be some time before I can eat there again.", "pics": null}}, {"review": {"des": "Classic, consistent. Service is always spot on, and despite all the Lou Malnati's sprinkled across the area, there is usually no problem with seating here. There are a few examples that come to mind when it comes to \"better\" deep dish, but really, it's excellent.", "pics": null}}, {"review": {"des": "Andrea our server was great. A very attentive staff. No one copped an attitude   The side salad was big enough for two people.", "pics": null}}, {"review": {"des": "Triple checked that our pizza would have no parm on top as it is an irritant to one of our family members and  they consistently cover the pizza in it and force us to wait for another pizza to be made. Never coming back to this location. Seem to be nothing but a bunch of jokers.", "pics": null}}, {"review": {"des": "Salad delivered to my house has 5-6 full black seeds in the pears. Like no effort put into making this. Disappointed.", "pics": null}}, {"review": {"des": "When I came to Chicago, the main recommendation that I got was to try the deep dish pizza here, and Lou Malnati's was the name that people kept giving me. While I had never heard of deep dish pizza and had no idea what to expect, the New Yorker in did not think pizza could look like that. All my doubts were cast aside when I tried my first bite, and over my time being in Chicago, I still haven't had deep dish pizza as good as Lou's.", "pics": null}}, {"review": {"des": "A small, quaint Lou Malnati's. Pretty quiet, did not like the feel of this place versus other big bustling Lou's. The three of us got very quick seating by seating at the bar area. Pizza was good, the house salad was bland.", "pics": null}}, {"review": {"des": "I tried Gino's East, Giordano's , and other pizzas , Lou Malnati's is so different in a nice way , I can walk in any day again . It was that nice !", "pics": null}}, {"review": {"des": "The Lou Malanati's on Lincoln and Montrose told me that I was not within their delivery range, and indicated the Wrightwood location was who I needed to order from.  I laughed because I am actually closer to the Lincoln and Montrose one, but whatever.<br><br>Called this location, and the service is great.  Delivery takes a while, but they do a good job with my deep dish sausage and spinach.  It comes hot like it was just taken out of the oven.  It came really watery/greasy once, but that was the only incident, out of 4 - 5 times I've ordered so far, so I think it was isolated.<br><br>Delivery drivers are also friendly and energetic.", "pics": null}}, {"review": {"des": "Had my first ever deep dish pizza here! As someone from PA, I wasn't sure where to go in Chicago for deep dish. We talked to a lot of people and they told us this was the place to go for the best. I went with five other people and we got two pizzas to split. We each only ended up spending 5 dollars for dinner! Amazing price for what we got. Can get busy so I would call before to know wait time, but it's worth the wait. A great spot for a newcomer to try their first deep dish.", "pics": null}}, {"review": {"des": "I was really hoping to love this place. It came highly recommended from a Chicago native and it only disappointed. I came to Chicago for two things, the Cubs and to try a deep dish pizza for the first time, and the pizza definitely disappointed (Cubs can never disappoint me). <br><br>It honestly tasted like a pizza that you heat up from the freezer section at the grocery store. There was nothing good about it, just a boring deep dish pizza that was a complete waste of calories!", "pics": null}}, {"review": {"des": "Great pizza! Would definitely recommend the butter crust! We got half cheese and half pepperoni, very timely on their delivery. Would absolutely recommend!", "pics": null}}, {"review": {"des": "Had to try Chicago pizza! We went because of the high reviews despite any location you go to. There was a bit of a wait, but they would offer thin crust pizza for customers to munch on so that was really nice!<br>The waitress was super nice and attentive. She recommended the spinach stuffed bread, which had some good flavor. The bread itself was from the pizza dough I believe. It was a tad too crispy for cutting, but the crunch was enjoyable otherwise!<br>We got the classic pizza with the sausage and butter crust. Wasn't too thick, and it wasn't so overloaded with toppings that would make the crust soggy. The crust had a really nice crunch at the bottom and there was just enough cheese, sauce, and toppings to get a good mix of flavors in each bite. Would definitely get again!<br>Unfortunately have to give it one less star because their iced tea was gross. Can't even explain the taste it was that bad. A 4.5 star would be my opinion if I could do halves.", "pics": null}}, {"review": {"des": "As a visitor from new haven, I do heard about the debate between thin pizza and thick pizza, and about whether Chicago or new haven is the origin of pizza. To be honest, I prefer the pizza, but this restaurant is a must-go! And we tried the goose land deer. It tastes good too!", "pics": null}}, {"review": {"des": "I think this is the best quality Chicago deep dish pizza you can get from a chain restaurant. Cheese was nicely thick, and the crust (with butter of course) was not too crispy and not too soft. They do a great job in making sure the pizza is done right and, from my experience, are the fastest in delivering the pizza out. <br><br>Will come again if I'm ever in Chicago!", "pics": null}}, {"review": {"des": "Lou Malnati's has evolved into a culinary destination point whenever I'm visiting my brother in Chicago. Malnati's delivered my baptism into deep dish pizza when I first traveled out in 2011, and though I've tried a couple of Chicago's other chains since, I still give them a leg up on the competition. What I especially love is that you can postal ship their pizzas (frozen) throughout the US. As a Christmas gift, my brother ordered online a box of 8 full size pizzas that was delivered to my apartment doorstep. Though I applauded the creativity, I must admit it was a bit of a logistical headache trying to find space in the freezer. Nonetheless, the pizzas - each with its signature sweet buttery crust- kept my fed and content through a Northeast winter hibernation.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/g4iTv93zjR_F2aYQb8Oeig/168s.jpg", "caption": "Deep dish pepperoni and sausage"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ZGT2uc5vuzw-v-Z840IpXg/168s.jpg", "caption": "Deep dish pepperoni and sausage"}]}}, {"review": {"des": "On my day trip to Chicago, we were craving pizza. It was either Giordano's or Lous. Having read a lot of positive reviews we decided with to go with Lou's. When we arrived the place wasn't to busy which was great since we got a table right away. We ordered the Lou's original, I think that's what is called. The pizza was great, the sauce was delicious, their was a generous amount of sasuages,and the medium pie was more than enough for three people. I'm glad to have finally tried a deep dish pizza from Chicago, you can't go wrong with malnati.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/DgqIZNusMjdXMM1vISdLww/348s.jpg", "caption": "Pizza heaven"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/c1EzIz3pKNlmvym13jdsyg/168s.jpg", "caption": "The famous deep dish"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/8bal3LBLEF57_T8AGPFruA/168s.jpg", "caption": "Garlic bread"}]}}, {"review": {"des": "For a long time Lou Malnati's has ranked as my least favorite of the various Chicago-style pizza franchises, but I'm starting to come around a little. LM's place in the pantheon is to have the crunchiest, most pie-like crust, and large quantities of a particularly tart tomato sauce.  I doubt it's actually any healthier than any of the others, but perhaps we can think of it as having transferred some of the excess cheese of Giordano's into a particularly rich and buttery crust.  In any event, on my most recent trip to LM's I found myself enjoying this combination and wondering if I need to refresh my memory about what Gino's is like too.<br><br>The Malnati salad is very nice (though I might prefer a less-sweet dressing). The service was a little slow, but like most deep-dish places these days they let you order your pizza before you are seated, which cuts down on the wait.", "pics": null}}, {"review": {"des": "Ordered from this location today by mistake for the first time in 6 months (been using the North Center location during the past 6 months). The food was delivered, consistency was poor and the cheese was like chewing an old tire. Dough was very damp despite it being uncut, my guess is that it was undercooked.<br><br>I ordered a small classic Lou and a small gluten free, both were edible but not up to the level of quality of neighbouring Lou's stores. Both the dough was soggy, cheese was rubbery (guessing either undercooked or oven wasn't warm enough) <br><br>Only thing good this time was the order arrived on time as promised and the delivery driver was a nice guy (their drivers are always polite and courteous).<br><br>That said there is still a ton of room for improvement considering the amount of competition and the fact that other Lou's stores deliver to our building. I'll be going back to the north Center store as the quality is always on point. <br><br>Hopefully the managers take a look at what they are not doing compared to the other Lou Malnatis stores when it comes to food prep and cooking as they are missing something by a mile. <br><br>Yes \"pizza is pizza\" but in Chicago \"pizza is life!\"", "pics": null}}, {"review": {"des": "Really good pizza. Have all sorts of places to eat from people who live here, decided on this and we weren't disappointed", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/uw2FE11eaKBdAi9KFpbY4Q/168s.jpg", "caption": "Don't listen, this is WAY too much for 2 people...get the single size"}]}}, {"review": {"des": "First time trying deep dish, so I can not compare it to the other places in Chicago. I recommend ordering extra sauce with the classic cheese deep dish. Otherwise great first experience, I would recommend trying while in Chicago.", "pics": null}}, {"review": {"des": "I ordered a deep dish, butter crust, pescatarian pizza with spinach, olives, peppers, and giardiniera - well done.<br><br>My oh my! I had almost forgotten what amazing pizza tastes like.<br><br>If you've lost that pizza-loving feeling - you owe it to yourself to stop in the original location of Lou Malnati's Pizzeria and get your groove back.<br><br>Excellent service - with plenty of salad and drinks while you wait.<br><br>Just remember - a little bit goes a long way...<br><br>Don't forget the fork!", "pics": null}}, {"review": {"des": "I HIGHLY recommend Lou Malnati's if you're visiting. It's part of the Chicago experience. From start to finish, it's gonna feel like you're on cloud nine. The Malnati salad is YUMMMMAZING!!!! Their vinaigrette on that salad is a touch of vinegar with a sweet after taste. Even my four year old was dominating the salad with me! Their pizza was everything we hoped a Chicago deep dish pizza would be...and more! Their sauce is EXTREMELY fresh! You can just taste chunks of juicy tomatoes. Their buttery crust is so flavorful and perfectly crisp. Their sausages are no joke. They are more than generous with their toppings. I can't stand anchovy, but my husband LOVES it. I absolutely love seafood, so I gave their anchovy a try. I assumed it would be stinky and slimy like all the other anchovy pizzas I've tried. It was not. Their anchovy was so freshly prepared that it tasted much like crab meat! You could feel the anchovy melting in your mouth. It was superb. I did not expect that at all! Spinach is the way to go on their pizza. With the bold flavors of the sauce, the spinach really adds to it. Absolutely delicious. And speaking of delicious, their cookie a la mode and their tiramisu are divine! Pretty sure we got a taste of heaven. My gosh! It was very delicious and not over powering on the sweetness. Treat your tastebuds because you won't want to skip out on desert here...or any of their food!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/u3W5sJH3RYC4HerwKX6BWQ/348s.jpg", "caption": "How can you not want this tiramisu? I want seconds!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/LcYIWd8YE-DODphAXd6GGA/168s.jpg", "caption": "Tiramisu ! Highly recommend it!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/OWCDpx2oq8ZsIBIa0_iE8Q/168s.jpg", "caption": "Cookie a la mode. So warm. And so delicious."}]}}, {"review": {"des": "Growing up I was surrounded by Lou Malnati's, yet Giordano's was my favorite for deep dish and thin crust (Chi-town's thin crust is vastly underrated). I still love my Gio's and have even transported some back to Austin, but I have to say in recent years it's Lou's that I crave more when I'm back in town. This location is just footsteps away from my old stomping grounds at DePaul and it's one of their best. You may notice a difference in consistency between locations.<br><br>My dad and I came in for a pie and while they were busy inside, we got seated right away. Sometimes they'll have a thin crust pizza at the front desk that you can grab a square or triangle of while you wait for a seat. On my most recent visit this was not the case unfortunately.<br><br>I went with the Goose Island Matilda which is a Belgian style pale ale. It was pretty good. We got an order of wings which were great. We did a mix of both the buffalo and honey bbq sauces. I prefer the buffalo, but felt like getting a variety. There is a good amount of meat on them which is always appreciated. We sat outside for our pizza. I could go into detail about it, but instead, I think the pictures speak for themselves.<br><br>*Chicago Native Tip: Whatever you do, do not order the personal pizzas. They are not at all the same.", "pics": null}}, {"review": {"des": "Classic deep-dish pizza, friendly service, nice neighborhood location. Do NOT go on a Cubs game day if you want a table unless you don't mind waiting an hour or more. We had six in our group so maybe that was part of the delay. Once we were seated the service was great. It took awhile to get our pizza but it was worth the wait. Consider ordering your pizza in advance.", "pics": null}}, {"review": {"des": "Been ordering from here for years and have never had a bad pizza; until the last couple I've ordered. Not sure if they have new pizza makers or MGMT isn't doing quality control but something isn't right! First one.. it was all DOUGH, whoever made it didn't press down the dough in the pan so I ended up with a big piece of dry pizza bread. Second one.. not sure what happened but this was the worst pizza I've ever had from Lou's. Crust was so dry/hard you couldn't cut thru it? Again, the pizza didn't have the toppings to fill the crust; ended up with a half full pool of grease! I ate two small pieces and have no intentions of re-heating it at all. +1 star for the Order Taker girl / Delivery guy.. pizza is way too expensive for these kind of debacles! PS- The pic below is not of the bad pizzas I recieved! That was a great one.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/lE2vTRCNGSP8_fblrYpTMg/348s.jpg", "caption": "Pepperoni Well Done!"}]}}, {"review": {"des": "Since this trip was our first to Chicago, we decided to start off with a bang and get a Chicago-style pizza on our first night. We ordered the special deep dish (sausage) and the amount of sausage, cheese, and crust that arrived on the pizza was insane! Great way to begin our vacation.", "pics": null}}, {"review": {"des": "This was my first experience with Lou Malnati's and the food was overwhelmingly average. I ordered a personal-sized deep dish pizza with cheddar cheese, mushrooms, and garlic. I liked that they did not skimp on the cheddar cheese, or the garlic. The flavor of the pizza was delicious and I was starving at the time, so it hit the spot. Again, nothing overly special, but it was a pizza and it delivered what one would expect from that.<br><br>The \"butter crust,\" one of their hallmarks, is what I was most looking forward to trying. While the flavor of the crust was pretty good, and it didn't fall apart in the face of the deep dish, it was nothing special (you should be noticing a theme by now). The crust was firm to the point of being tough, and I would have liked it to be a bit flakier and richer, as those are the qualities that come to mind when I think of a \"butter crust.\"<br><br>Again, it is a pizza, and it does the job. Nothing too polarizing here, I would probably get it again if I were really in the mood for some deep dish and didn't feel like going farther than down the street to get it.", "pics": null}}, {"review": {"des": "My first deep-dish pizza and boy I was in love. My preconceived notions of it were soggy crust and overwhelming tomato sauce, not very good. But Lou's completely changed my world with the first bite of \"The Lou,\" and several more of the classic. Amazing!", "pics": null}}, {"review": {"des": "really yumm pizza ... this is the best deep dish in chicago ... very quick service and the crust is really crispy ...  asked for easy on cheese... u can def customize based on ur requirements", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/gp1lYdQpLhkyps4b31BlEA/348s.jpg", "caption": "veggie deep dish"}]}}, {"review": {"des": "I actually didn't like Chicago style deep dish pizza until I had Lou Malnati's. Just phenomenal.", "pics": null}}, {"review": {"des": "Placed my order at 8:45p on Saturday and was quoted 30 for Take-Out for a small deep dish. At 9:35 was \"updated\" that it would be \"5 more minutes.\" FINALLY walked out at 9:55.<br><br>Next time I'll just go to Gino's.", "pics": null}}, {"review": {"des": "One of our favorite pizza places. We get the extra sauce and extra cheese deep dish usually. The toppings vary. Most of the time we get 2 sausages and 1 pepperoni. We always get the bruschetta and cheddar cubes with dipping sauces. I get the Malnati salad hold the cheese. And we sometimes get the Chocolate chip pizza for dessert. We pick up an order at least once a week.<br><br>The service is always good and fast. The quality can't be beat. It really is one of the best in Chicago. You need to try it once if you come to town!", "pics": null}}, {"review": {"des": "We went here for a birthday celebration. The service was fantastic and we had a half booth by the window which was very comfortable. The pizza was pretty good but the butter crust wasn't as good as I thought it would be.", "pics": null}}, {"review": {"des": "My family and I are from Pittsburgh. We stopped here for dinner to try deep dish pizza for the first time as we passed through Chicago on our way to visit relatives in the midwest last year.<br><br>The food is always delicious and the service always friendly. We love the deep dish Lou pizza, which is a white pizza with garlic butter sauce, garlic spinach, crushed tomatoes, fresh tomatoes, mushrooms, and a few cheeses. It is not as heavy as the name deep dish implies, because the crust is fluffy. The salads are prettt nice here too - no bad lettuce in the mix, a variety of ingredients, and the dressings are clearly house made and delish!<br><br>Since that first time, we always make a point to stop here and order a Lou as we make the trip to visit family!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/uUJddR38ri1L8uJNfM8pgA/168s.jpg", "caption": "The Lou deep dish."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/yt_JTrIFjOsGMtHL_k2IbA/168s.jpg", "caption": "House salad, very nice! Love their dressings."}]}}, {"review": {"des": "Not a bad place for pizza! I really only have deep dish when I visit Chicago.. It's weird because other places outside of Chicago that sell deep dish pizza just aren't as great. I got a Mushroom Pepperoni Pizza which was super good.<br><br>This location is a lot smaller than the other one I've been to, but the service is pretty quick and that's what's great!", "pics": null}}, {"review": {"des": "I am not crazy about it. It was ok. <br><br>I ordered the classic \"buttercrust\" pizza with extra cheese and lean sausage because I was told by my server this is the classic, and most popular option. Popular means it must be good right? I mean, pizza as a whole is fairly popular and it's pretty darn good. Even bad pizza is still pretty good (I don't think I've met a pizza I've fully written off).  <br><br>I admit I was hesitant about trying deep dish and adding a deep dish place to my itinerary. I am all about the crust. The crust makes or breaks a pizza. the major distinguishing point in a deep dish is how the crust is made (recipe) and how its formed, altering flavors, textures, etc. But I wanted to give deep dish the chance and researched the heck out deep dish. I automatically knocked off the really popular national chains like Uno's. I read the differences between places and knocked out places that do the two layer stuff. I love buttery rich crusts and Lou's gets pretty rave reviews, so I picked this location to pop my deep dish cherry. <br><br>I have to say, I did not like how crunchy and dry this crust was. I was imagining something more tender but still crisp like a detroit style pizza. Instead, it was like comparable to the crust of a quiche.  <br><br>What really killed it for me was how bland the sauce was. I was looking forward to some intense tomato notes, bright, zingy, maybe a bit peppery, and mine just tasted like just canned tomatoes plopped on top. The cheese- eh, the sausage, bland. No little caramelized bits on the cheese with textural contrast, just molten mozz. I think it was part skim too because it wasn't as creamy as whole milk mozz. <br><br>I do prefer this over the abomination that is new york pizza (floppy, sloppy, bland crust and minimal cheese and sauce, kill it with fire!) but I'll rather be eating at Costco. Better yet, why is no one talking about Detroit Pizza? It seriously is my favorite pizza. Skip deep dish, skip new york, risk getting jumped to have pizza worth getting jumped for!<br><br>PS: garden salad is pretty good to say the least! Love the dressing, I'd tell them to put it on the side though because mine was drowning in dressing that I accidentally flicked vinegar into my eye chowing down on a very wet salad!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/bRFqq6SbTiv6KIUYj_8KUQ/348s.jpg", "caption": "My delicious garden salad with red wine vinaigrette"}]}}, {"review": {"des": "I simply don't think this is the \"best\" pizza in Chicago. If you like the crispier, crumbly, pie-like crust, then yes, you will thoroughly enjoy Lou. <br><br>The Chicago classic has one large slap of sausage on the entire pizza, versus being cut up into individual pieces. The sauce is tasty, too.<br><br>I'm just not a fan of the pie-like texture. I prefer more fluff. But if this is your style, by all means!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/mtRtYXSfRFdu0J_8lmKfeg/168s.jpg", "caption": "Deep dish is only delicious when you can share with friends."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/o0RzPNb_X87_UWvmwI_0Ew/168s.jpg", "caption": "Fresh Chicago Classic!"}]}}, {"review": {"des": "The pizza was amazing! The service was poor. Lou's has a great reputation for its tasty pizza among locals so we were excited to hit it up. We were happy to wait the 35 minutes for a table. Our waiter was kind but not on top of things. We asked for a drink and cup of ice and 10 minutes later when our pizza was brought to our table our waiter then remembered the drink and ice and quickly ran to get it. Most disappointing was my interaction with a man who appeared to be the manager. There was a group seated after us and ordered after us, was larger than our table and yet got served before our table. I tried to ask the manager about how they process who is served first and he tried to tell me the group was seated before us which felt a little insulting considering they were right next to us. He then talked himself into circles and worked as hard as he could to avoid my simple straightforward questions. I was kind and not pushy and yet he was condescending & acted like he didn't even want to be talking to me. He made no adjustment to our bill and didn't follow up after the conversation to check in at all. It's unfortunate that some of the best food we had while visiting Chicago was accompanied with the most disappointing service. There are plenty of other Lou's in Chicago. We recommend eating at one of the other one's.", "pics": null}}, {"review": {"des": "Came in with great expectations, our waitress was good - smiling and hospitable, but the food itself was OK! Personally for me, I don't understand what's all the hype about - personally Pizza Hut deep pan is not that different!", "pics": null}}, {"review": {"des": "Not a big fan of pan pizza..despite the 30 minute wait, we sat outside...and had The \"butter crust\"house pie which is excellent. Not too much sauce, like alot of deep dish places try, fresh sweet tomato sauce, good cheese.  Im sold, best Ive had in Chicago. The thin crust personal pie sadly looked like a school lunch pizza.. or one of the California Pizza Kitchen frozen pizzas you get at the supermarket. It had tasted better than it looked.. also the zombie waiter was a a droll guy- but I really think they got him from The Walking Dead TV show.. I still favor New York style but this place is worth a visit.", "pics": null}}, {"review": {"des": "If I see another review from an out of towner that begins with, \"I'm a New Yorker\", \"I'm a Californian\", \"I'm from Maryland\"... especially Maryland... what does Maryland have to do with pizza?? Aren't they famous for Chesapeake crabs?  <br><br>Anyway, you're in Chicago, folks! You can't compare apples and oranges.  I don't care if you're a \"New Yorker at heart\"... do you like the pizza and service here or do you not?? <br><br>So, this is my review of Lou Malnati's deep dish pizza.  NOT a comparison of Chicago Deep Dish to umm Maryland pizza?? Still confused by that reviewer.  <br><br>We went on a Wednesday afternoon and got right in.  We ordered the trio of chips and dip to start because Lord knows a small Chicago deep dish for two isn't enough... we inhaled the pizza chips, topped with fresh tomatoes and cheese!! The three dips were spinach, roasted garlic and I think a garlicky hummus with peppers and jalapeños?  The roasted garlic dip is the bomb.  Definitely will try to duplicate that at home.<br><br>We got the Lou's Classic and it comes topped with a continuous layer of Italian sausage.  Nothing to hate about that. There was a thick layer of cheese like you'd expect and a buttery crust.    <br><br>All in all, excellent service and the food was good.  <br><br>Now here's why I compare.  Personal preference goes to Giordanos.  I think because I tried it on family vacation, I'm a bit nostalgic and partial to it.  I also think Giordanos has more sauce, which I prefer and in my minimal experience, considering I've only been twice... there pizza comes out hotter and cheese meltier. <br><br>But I don't think you could go to wrong with either one.  Try them both and see which you like better.", "pics": null}}, {"review": {"des": "I want to be impressed with this place, but I haven't been!  Both times we've had take out- once delivered, once picked up.  Neither times was I blown away by the pizza.  It's just like regular pizza in Chicago.", "pics": null}}]}