{"name": "loving-heart-chicago", "reviews": [{"review": {"des": "They have the best vegan burger!!!<br>Their salad and curry are also very good!<br>They cake delish! Way better than portfolios chocolate cake. <br>Non vegetarians/vegans will also like this place!", "pics": null}}, {"review": {"des": "Probably the best vegan food in a casual sandwich cafe-like setting that I have encountered in Chicago. Friend got the huge Eden wrap and a beautiful and delicious blueberry smoothie. I had the Loving Heart burger and thought the patty, veggie toppings, and bun were of very good quality. Also had a refreshing spiced iced tea and rice paper wraps of vegan Korean BBQ that were as flavorful as meat. Finished the meal feeling satisfied and wholesome.<br><br>I would say the only potential criticism is that the restaurant plays a TV channel called Supreme Master TV and has other paraphernalia related to a set of spiritual/religious beliefs. No one proselytized to us, but the literature is definitely present.", "pics": null}}, {"review": {"des": "Having had the privilege of eating at scores of vegan/vegetarian restaurants all over the US (and the world), I would have to say that this is one of the very best: the food is delicious, healthy, fresh and not expensive.<br><br>Though I can't say I'm a big fan of the cultlike Supreme Master Ching Hai, the Vietnamese businesswoman with a global chain of vegan restaurants, I salute her efforts toward making tasty vegan food available in numerous locations. Her restaurants vary in quality but this one is perhaps the best of all we have visited so far.<br><br>TIPS:<br><br>* Parking here can be a challenge, so be prepared.<br><br>* As there are only a handful of tables in the restaurant, it may be best to avoid peak hours or consider doing take-out. I believe they will deliver to addresses in the vicinity.<br><br>* The hours are somewhat limited (MON-SAT, 12-8 pm), so keep that in mind.<br><br>Menu items we found to be quite good: Potato Kale Soup, Loving Burger, Eden Wrap, Curry Bowl and Nacho Chips. They did a good job of preparing the food for take-out on one occasion. When we arrived at our destination more than an hour later, the soup was still hot!", "pics": null}}, {"review": {"des": "Loving Heart almost has to be a destination place for those who don't live in the neighborhood. Traffic can be heavy, parking is sparse and pricey, and construction makes it all worse. But for those of us who enjoy Montrose Harbor and the Bird Sanctuary in our beautiful Chicago summers, Loving Heart is convenient and close. It's probably one of the few places a hungry vegan can find good food. And you can get carry-out, too, which means you can linger even longer at the lakefront.<br><br>There is a rack of paper menus near the counter where you order. Once your order is placed, you are given one of those electronic thingees that beep loudly and light up when your food is ready.<br><br>If you're eating in, there are several tables in the front of the restaurant and alongside the wall. There's not room for a big group. Or, if a big group came in, they'd take the entire space. Let's call this place \"intimate\" without candles, hanging plants, or wandering musicians. <br><br>I ordered the Eden Wrap. This is served wrapped up, as if you were taking it out. Apparently there is no difference between food served for eat-in or to go. Oh well. The Eden Wrap is a meal in itself; it is big! It includes apple and avocado and all sorts of yummy veggies, along with a cashew-based cheese spread. It is really good. Be aware, though, that  it is also very juicy. I went through several napkins, because my fingers got so sticky. You'll want to wash your hands before and after eating, if you get this wrap.<br><br>There is a single-seat toilet in the back. Again, a nice feature for us beachcombers. We can eat, drink, and use comfortable facilities. The frightening possibility of using the dreaded public toilets at Montrose can be greatly reduced.<br><br>The only thing I didn't like is that the TV, which is near where I was sitting, runs continuously on Supreme Master TV. What the heck is that??? It looks like some cult thing to me. It's creepy. <br><br>Despite the creep factor of the TV programming, I liked Loving Heart Vegan. I will definitely stop in again over this summer and work my way through the wraps and salad bowls. If you see me there, in my straw hat, carefully averting my eyes from the TV, stop by and say hi.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/r6-c9HRiFF92mgkkT0mabw/348s.jpg", "caption": "The Eden Wrap"}]}}, {"review": {"des": "This is a cute little vegan cafe. Their menu is pretty interesting and some of the items look really good. Their hours are a little weird. I honestly wish they did breakfast and lunch instead of just lunch and dinner. This is mainly due to the area and that I think it will be harder for them to stay in business as a dinner joint but I would definitely grab vegan breakfast there on the regular. Vegan breakfast is pretty hard to come by if you don't like oatmeal. I'm not strictly vegan I should say; I'm just cutting back on meat and dairy and totally eliminating eggs. The food here is simple and relies on fresh ingredients prepared to order. It's not overpriced like some vegan places so I'm sure I'll be back again.", "pics": null}}, {"review": {"des": "I never imagined a cafe could have amazing food, lovely atmosphere and have an overriding positive spiritual feeling. Who knew? We decided to check out this cute little cafe after spending the day at Montrose Beach which is only a few blocks away. You step down a couple steps into this adorable, immaculate little shop. About 6 tables but while we were there, their were several take out orders and we were there at an off time. They have a couple televisions going with the Supreme Master channel going. This is a channel owned by the Supreme Master, a spiritual leader and I think vegan? All positive, spiritual and uplifting stories and  news posts from around the world. They also have a book case full of books by the Supreme Master. Very interesting and worth knowing about. Not going to convert, but interesting! So anyway, after reviewing the pretty extensive 100% vegan menu we ordered the Happy Burger and Curry Bowl with Korean Bar B Que. We also tried the Thom Kha Soup. You order at the counter and she gave us a buzzer. My daughter also had a green smoothie. I opted for the purified water on tap for free. While we waited for the food  we read all the vegan info and perused the Supreme Master library! We picked up our cutlery which is made from recycled and biodegradable material. Then the food came and it was absolutely delicious. The happy burger made us very happy! It was melt in your mouth delicious and came with a bag of kettle chips. The curry bowl was HUGE! It had a big portion of brown rice layered with tender sweet potatoes, tender Korean bbq, carrots, spinach and red pepper strips. The curry sauce was creamy and delicious. It was so good I could not stop but forced myself too and had a good portion to bring home. We did not try the desserts but they looked delicious. We will definitely return and try their other dishes. I am sure they will be great if the are prepared with even a % of the care and flavor that these were prepared. What an interesting, sweet and delicious vegan cafe that lives the vegan values in every way!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/DrQmHf8DcomAY3aKh1Hs7w/348s.jpg", "caption": "Enjoying Supreme Master channel!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/rvuA8iYMBleAuWlfoiUp4w/168s.jpg", "caption": "Super clean cute, spiritual cafe"}]}}, {"review": {"des": "Everything about this place is amazing. From soups, wraps, to homemade plant-based pastries, and most importantly, you feel good afterwards. It's our go to when we are in the area.", "pics": null}}, {"review": {"des": "Loving Heart is by far my favorite restaurant!! The food here is always unique, delicious, and fresh. Best of all though, is that this great food is prepared and served by the kindest, sweetest, and most charming  people you could ever meet! What a gem this place is, thank you, thank you, thank you!!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ip7tAyIJFleoQxDSH041ow/168s.jpg", "caption": "Sooooo YUM!!! Ever Young Bowl, Nachos, Tom Kha Soup, Double Chocolate Cake, and Blueberry Banana Smoothies"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/B-6Hc1MRMMzviBmzYAp0cA/168s.jpg", "caption": "Ever Young Bowl, Nachos, Tom Kha Soup...EVERYTHING is so unique, delicious, and fresh!! This is by far my favorite restaurant!!!"}]}}, {"review": {"des": "I am not a vegetarian or a vegan.  I love every meal I've gotten at Loving Heart. Their noodles taste delicious and have great texture, great portion sizes on everything.  I can say that if you enjoy food, and are open to skipping meat, get over there and get something to go. I do recommend ordering delivery or carryout as the dine-in space is small.", "pics": null}}, {"review": {"des": "Love, love, love this place. I was greeted by a very kind lady as I walked into the door and she explained the menu to us. I ordered the Green Deva Salad while my friend ordered the Curry with korean somen noodles. We both opted for the korean BBQ fake-meat, which was delicious.<br><br>I love the dressing for the Green Deva Salad; healthy, organic, and delicious. The curry sauce was also delicious! The place is small, but very cozy and clean. The food here almost reminds me of By Chloe in New York. The curry bowl was actually very filling because of the amount of noodles in the bowl.<br><br>Would come back and would recommend!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/yY6pLa1vl--D1XgD8Ezv5A/348s.jpg", "caption": "Green Deva Salad (amazing!) and Curry Noodles"}]}}, {"review": {"des": "AMAZING!!!!!<br>The owner is super sweet, good is delicious and always comes in a timely manner. I go there often for a little treat. GREAT!", "pics": null}}, {"review": {"des": "This is my second time going hear and definitely not the last! On my first visit, I ordered the Happy Burger and it was unbelievable! On my second visit, I ordered the Loving Burger w/ Avocado (which is pictured below) and again, food was amazing! The staff was super friendly and the environment is cozy enough to where I can get work done on my laptop. WiFi is available, but you have to ask them what is the password and there is a time limit of 2 hours.", "pics": null}}, {"review": {"des": "Didn't realize this was a vegan restaurant - thought it was just vegetarian friendly. My daughter had the Happy Burger and really enjoyed it. I had the Korean \"pork\" bimbap and it was Delicious! So fresh, hearty, sweet and spicy, and home made. This little gem of a restaurant is easy to overlook, hidden in plain view. So - look for it! We'll go again!!", "pics": null}}, {"review": {"des": "Favorite vegan restaurant so far. I've tried a few other vegan restaurants in Chicago since there's so many options, but for the price, quantity and flavor-it's unbeatable. <br><br>There's an Asian kick to most dishes and the most expensive entree on the menu is 9 bucks. For organic food. <br><br>I suggest the Everyoung Bowl and the Spicy Stew for entrees, and apple ginger cake for dessert.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Cnlcy8AaqxLAYSsZDpWf1w/348s.jpg", "caption": "Menu"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/k8XsFzofJHXrqUH1dpjryQ/168s.jpg", "caption": "Menu"}]}}, {"review": {"des": "Amazing little vegan restaurant. Truly a little treasure.<br>Highly recommend the place. Simple menu, good prices", "pics": null}}, {"review": {"des": "So gooooood!!! This is on of my favorite vegan spots in the whole of Chicago! Everything on the menu tastes FANTASTIC! It's got a super-cute little cafe atmosphere, and the staff is always great at giving recommendations. I'm going to try and eat everything on the menu!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/-vppbOQaeHUXjHSmETEHbQ/348s.jpg", "caption": "Curry Bowl and Double Chocolate Cake!!"}]}}, {"review": {"des": "Absolutely flavorful, bold, filling, healthy, and delicious food!! It's affordable and I encourage everyone to try them out!! I had the Curry Bowl with the Tom Kha soup and my taste buds were buzzing!! The service here is wonderful and I got my food pretty quickly. I cannot believe how filled up I got for a person who eats a lot of food. Totally worth it!", "pics": null}}, {"review": {"des": "Wish it was closer!  The food is great, \"Short Ribs\" fooled a non veggie", "pics": null}}, {"review": {"des": "A solid vegan/vegetarian place with a wide variety of Asian-inspired dishes. It's a small restaurant with simple and clean aesthetics. The lady at the counter is very sweet and friendly. I got the Green Deva Salad, with Korean BBQ \"meat\" as protein. It barely tastes like fake meat and the marinate is deliciously sweet. My favorite part of the salad is the dressing - a homemade green ginger pesto dressing that is refreshing and sweet. Everything on the menu appears to be super healthy and clean.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/UY7VW1aeaycEzXLwpSC8uQ/348s.jpg", "caption": "Green Deva Salad (bottom)"}]}}, {"review": {"des": "The food here is freshly made right after you order it.  Tasty all vegan place, but carnivores will enjoy it as well. The Happy Burger is my all-time favorite, although the salad with black beans and the homemade raw green ginger dressing is absolutely amazing as well.  The staff here are hard working, efficient and extremely sweet.  It's a pleasure to just stop in, although we frequently get it to go.", "pics": null}}, {"review": {"des": "This place is a short walk from Montrose Beach. The service was excellent and the food was delicious! The atmosphere of the restaurant was relaxing and the other patrons were very friendly. My wife and I had the nachos (they were fantastic), the potato soup, and the Spicy stew! I'm not vegan or a vegetarian and this food was excellent and well priced!", "pics": null}}, {"review": {"des": "So many vegan and gf options, it was hard to choose! My girlfriend and I each got the soup of the day and a sandwiches. The spicy kimchi soup was amazeballs. What a treat to have a creamy vegan soup on a crappy winter day. We actually took a quart back home to Minnesota. <br><br>My girlfriend has no dietary restrictions and regularly eats meat absolutely loved the veggie burger and the creamy potato soup. From starters to desserts (holy crap, try the frosted cookies) there isn't a dud to be had here. <br><br>It's a small but comfortable space. They keep it toasty in the winter, so stop in and warm up with a hot chai. <br><br>All their food is available to go and travels well. This place is a must visit for out-of-towers.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/GZZZpownEyAAv8zTL2HOzw/348s.jpg", "caption": "Get the large soup!"}]}}, {"review": {"des": "Everything here is so good! The chocolate cake is so rich and decadent. The Korean bbq TVP is amazing! My favorite thing on the menu is the green diva bowl with brown rice and the Korean bbq. The pesto sauce on it is crazy good. The happy burger is also great and has a unique flavor. The owner is also very nice.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/TaCdLYxSpM4x0XBPS4HRdw/348s.jpg", "caption": "Bimbap bowl"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/zjMJBAG9jlG6ajYFobDX_Q/168s.jpg", "caption": "Green diva bowl"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/2Opc0gVhntgHeGnP5r6Mcg/168s.jpg", "caption": "Spring rolls (great snack)"}]}}, {"review": {"des": "Truthfully, I don't care about organics, vegan dining, or whether or not things are gluten-free. Luckily you don't really need to here, because the food is actually quite good anyhow. I was seriously impressed with both the wraps and the plates. Tried their Ever Young Bowl, the bowl version of their best-seller Green Deva Salad, which came ripe fresh spinach, onions, bell peppers, cilantro, peanuts, your choice of base(I got the Asian wheat noodles), and your choice of protein(korean bbq vegetable protein is the way to go). Just from looking around you can tell they take pride in both the freshness of their ingredients, as well as their presentation on the plate. But beyond that, the freshness extends past the plethora of colors on the plate to the scent of their ingredients too. That said, none of that matters if the taste doesn't deliver, which it fortunately did. In particular, the green ginger pesto was a deliciously nutty, sweet, savory iteration that stuck well to the chewy noodles, though I could have spread on everything. Likewise, the bbq was a still savory rendition of meat substitute that could fare just as well in a non-vegan establishment. And while they don't do much in trying to really re-create renditions of meat classics(no vegan reubens or vegan chicken wings here), they craft unique dishes in their own right that best of all don't make you feel like shit after eating them. Even consuming their heavy plates as opposed to a wrap or salad, I felt satiated yet still ready to go about the rest of my day. Which I guess is the point.", "pics": null}}, {"review": {"des": "The best vegan restaurant and my #1 favorite place to eat! Love the friendly, cozy and peaceful  atmosphere. The food is amazingly delicious!!! You can tell that it's made with love and care for the people who eat it! Especially their vegan burger - \"happy burger\" with avocado. It is the best burger (not just vegan) that I have ever had in my life! Thank you so much!", "pics": null}}, {"review": {"des": "My vegan sister visited from vegan LA, the mecca of US veganism.  I had to impress, but also make it look like I wasn't trying that hard.  Loving Heart was an amazing choice.<br><br>This is vegan food as made by true believers.  One of the chefs was also manning the tablet POS, and she practically sang a vegan song that only my sister could hear when our food was ready.  It was my sister, me and my chef from NYC, who had joked about sneaking in a little jerky and hiding it for me in the bathroom.<br><br>For a non-vegan, I found the vegan nachos delicious, and the vegan Happy Burger also delicious.  The happy burger was juiced up with vegannaise, a kind of vegan special sauce that really appealed to me.  The homemade potato side was well seasoned and crisp.<br><br>The artwork here is also amazing.  I felt like the abstract subtly spiritual nature of some of the artwork rekindled mystical journeys I have taken in the past (this is called a \"flashback\") and my own (almost) year of veganism.  In particular, I had a trippy thought that meat eaters would probably have more bad trips, because of the superior karma of animallessness.<br><br>This vegan food was very tasty, in an underground cafe near the bird sanctuary, it was a treat to visit with my sister and chef, during this actual Chicago fall aka \"the non-polar non-vortex.\"", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/sDQjdbUShVXxYrqM86Upjg/348s.jpg", "caption": "Art piece 3"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/3ivaWm9TRJPGHemofcKL0A/168s.jpg", "caption": "Art piece 3"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/xaRaRaHg3TDGH_w3zj2l7Q/168s.jpg", "caption": "Art piece 1"}]}}, {"review": {"des": "Amazing. Fresh, perfectly prepared vegan and organic food. Quick, friendly service from the walk-up style counter.  Very casual. Great, subtle music playing. The happy burger and side salad are delicious, fantastic sauce and dressing on both, very creamy. I also love the nachos with hummus, simple curry with brown rice, eden wrap (like the best massive raw veggie taco you've ever had, with apples! and a gf brown rice tortilla!) I don't miss the meat and cheese! They also use compostable bags and silverware. I love it here and will be back again and again.", "pics": null}}, {"review": {"des": "I love eating from here.  I haven't had the opportunity to try everything but so far my most favorite is the every young bowl.", "pics": null}}, {"review": {"des": "This is a great spot for vegans. Great selection and delicious food. Love the bibim bowl and  the soups. Can't wait to try the other items! I love that it's organic too!", "pics": null}}, {"review": {"des": "I love there food. It's so good and delicious! The people here is friendly! And it's peaceful here !!", "pics": null}}, {"review": {"des": "A definite dining gem! A wonderful, unassuming setting that provides healthy and delicious vegan options at reasonable prices!", "pics": null}}, {"review": {"des": "I tried Loving Heart with a vegan friend. To be perfectly honest, I was not expecting much. I eat veggie style most days, vegan, not often. I love cheese, dairy, and well, food! I have a hard time imagining an entire meal cooked without the influence of nonvegan things. I left this small restaurant wanting more and scheming ways that I could get some of the *Super*Awesome* Nachos delivered anytime I wanted and attempting to replicate the burrito. I have also become a walking advertisement, babbling about the goodness of their food to anyone who is pondering eating establishment choices.<br><br>What did we eat? It felt like EVERYTHING!!<br><br>I started off with a latte created with Metropolis coffee and coconut milk.  It was perfect and it hit the spot! In fact, it was so good (I do love both Metropolis and coconut milk) that I managed to gulp down a second throughout the meal.<br><br>My friend and I split the nachos. They rocked. I actually loved the side with red pepper hummus (very well flavored). My friend preferred the side with tomato hummus- it was a perfect split. To be honest, these were so good there was literally not a crumb left!   <br><br>I was fortunate enough to select the hearty Black Bean Burrito as my meal. It contained sweet potatoes, avocados, beans and spinach. I had the gluten free version. The burrito tasted delightful and was ENORMOUS! I took 2/3 of it home for a fantastic dinner!<br><br>****As far as accessibility is concerned, this establishment is located in a garden unit. You should contact the restaurant directly with any questions on entry. Stairs are required for entering and leaving through the front door. There may be a second entrance. Patrons order food at a counter. Our food was partially delivered to us, other parts of our meal were picked up from the counter. The staff was very accommodating with all needs.****", "pics": null}}, {"review": {"des": "This is a long overdue review...I haven't been here in a few months and I'm sad! I discovered this gem a year ago and since then I've gone at least ten times. It's so tiny, you may miss it the first time you go, but that is part of the charm! Every time I've gone (but one time) I've gotten the curry bowl. It is my favorite vegetarian/vegan dish in the city and I find it tough to eat anything else when I go....with that being said you should try everything here, not just the curry bowl! :P I've tried bites of other dishes when I've gone with my husband or friends and everything is amazing. The owner is super sweet, the restaurant is very clean, and the prices are reasonable. So, what are you waiting for? Go! Well, not today...it's closed on Sundays, but go tomorrow- you will not be disappointed! :)", "pics": null}}, {"review": {"des": "Excellent food! You'll walk away feeling satisfied and full (not bloated). The food is consistent and always fresh.", "pics": null}}, {"review": {"des": "Totally deserving of the 5 stars. We were treated so kindly and the food was remarkable! I will visit again before my trip back home. Parking can be challenging, so plan accordingly. The nachos are a must!!!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Y6WaUNPPFMSpIYyPE6HMzw/348s.jpg", "caption": "Carrot cake. The frosting will delight your tastebuds."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/w5joFdZ5mg5sbpOZ15CTKA/168s.jpg", "caption": "The curry hit the spot. Nicely done"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/DS3IAF1yMI4S6cLQxRKE_Q/168s.jpg", "caption": "Delicious nachos! Truly superb!"}]}}, {"review": {"des": "To preface, I'm not vegan, but an omnivore, and I have some pretty high standards for a 5 star Yelp rating. Plus, coming from and growing up in a restaurant background myself (though I don't cook much these days)--grandparents and parents owned a Chinese restaurant for 40yrs before retiring--I actually know what good food is, how much everything costs vs. prep time and how it compares to the value you're getting. <br><br>What I've noticed is that many/most vegetarian places seem to be both overpriced (many times comparable to or more than) compared to a \"regular\" omnivore restaurant--which is what's kept me from eating at vegan/vegetarian places in the past. Not only that, the portions at many vegetarian places can leave you feeling less than satisfied in your belly and wallet, but not Loving Heart!<br><br>I was surprised to come across this restaurant through Amazon Prime first, and find the value matches what you're paying! LOVE THIS as I'm sooo not rich, but have been leaning more towards vegetarian/vegan food places due to health reasons.  <br><br>As an (sorry for the TMI) aside: for 3 months after December, I had a problem where I was bleeding when I went to poop 90% of the time--which was also painful. Never had that problem before in my life. When I finally went to see a doctor (GI specialist), I was told I had an anal fissure. ANYWAY, long story short, I've found that when I ate more of a vegan/vegetarian diet (and I've always eaten healthy prior) I had less pain/bleeding when pooping. That, along with the cream prescribed by my doctor has taken the bleeding and pain away from my bathroom experience. Yay!<br><br>Sooo... I for one am very happy that Loving Heart serves up well-portioned, fairly priced food that also happens to taste fresh, wonderful, and healthy--WITHOUT LEAVING YOU HUNGRY! I couldn't become a FT vegan-vegetarian eater, but for a vegan alternative (eat it now app. 40-50% of the time) it's become the one I measure all other vegan/vegetarian places against. And because of its fairly priced to portion ratio as well as the quality, it's also where I'll choose to buy from before any other vege restaurant. <br><br>Loving Heart loves your heart, and will take care of your body, not just belly--AND won't hurt your wallet too much either! Thank you for existing, and please don't change!", "pics": null}}, {"review": {"des": "Open until nine!! I almost didn't go in because it looks dark, but they're really nice and the food is delicious! Healthy is just a bonus.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/MBg7A0ubI6VJDHP-dMM7Ow/348s.jpg", "caption": "This Deva thing is amazing. Tons if gluten free options including badass desserts!!"}]}}, {"review": {"des": "Found this gem on Yelp and decided to try it because it had great reviews and offered very healthy options.  I'm far from a vegan so I was concerned I wouldn't be full from one item.  I got the Happy Burger and popped chips and it was very delicious and made me comfortably full.  A good full to where I didn't feel worthless like I do after eating a heavy greasy burger.  If you haven't tried and are open to meat substitutes this is the place!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/28rlGY4BaAJZFDW6ekaXBQ/348s.jpg", "caption": "Split cut view of the Happy Burger!"}]}}, {"review": {"des": "Ok I'm super excited to write this review! <br>This was the first Vegan restaurant I visited since transitions to being vegan. I'm currently on the search of finding good and affordable vegan joints. And this is my favorite on regards of food right now. I got the the Korean BBQ burger and a tiny bag of healthy chips for $6.<br><br>The burger was a decent size and the Korean BBQ was really seasoned and good! The lady was nice as well, and the restaurant is in a basement kinda setting and it's really cozy, so a good place to go and do work! Highly recommend !", "pics": null}}, {"review": {"des": "Very impressed with their food. I tried the Happy Burger. (I believe that is the Korean BBQ one). It was so good! Carrot cake was very tasty, too! Nice location. Almost a little hard to miss if you aren't familiar with the area or using GPS though. Super quaint and homey inside. Great customer service too. I can't wait to go back!", "pics": null}}, {"review": {"des": "Such a great restaurant. I was in the mood for something vegan and/or vegetarian. I looked this place up on Yelp and had no idea there was a vegan place right up the street from me. The girl at the counter was really helpful in helping me decide what I should get.<br><br>I'd totally recommend the Happy Burger and the Coconutty smoothie. Absolutely delicious. Don't even recognize that it's not meat and I'm a meat eater.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/_Hcz3M3YkO80brgyF-Tx5g/168s.jpg", "caption": "Front cashier area."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/0YO8-VNsFVCwMnpmdSTJag/168s.jpg", "caption": "Coconutty smoothie. So good!"}]}}, {"review": {"des": "My Vegan sister dragged me, the omnivore sister, kicking and screaming to this restaurant...no, I'm just kidding about being dragged, but let's say I went reluctantly! Since this is my first experience at a vegan restaurant, I have nothing to compare it to but what I do have experience in is food and eating, and boy let me tell you the food is great! I had the BiBim Bowl, overflowing with  fresh, organic veggies, choice of rice or noodles, and I even walked on the wild side and tried the Korean BBQ (non-GMO texturized vegetable protein)! Wow, wow, wow...yummy goodness! So tasty, a week later I suggested it as a place to go to my sister, and ate there again, and have to say the Happy burger, and Heaven Wraps are also awesome! Use your gps to find this place, it can be easy to miss on Montrose. Happy Vegan eating!", "pics": null}}, {"review": {"des": "I'm not vegan, but this is amazing. I could write about the exquisiteness of the food, the warm reception, or the ever so tranquil environment. But my words would fall short. It's a must try experience.", "pics": null}}, {"review": {"des": "Loving Heart is a true treasure and gem! This restaurant has a warm, friendly vibe. The food is delicious! My favorites are the potato kale soup, the green deva salad, bibim bowl and heaven wrap. Most items can be made gluten free too. Highly recommended!", "pics": null}}, {"review": {"des": "The music softly playing had me feeling like I was back in Paris (the accordions likely helped with that), which was an unexpected little perk of grabbing my lunch here. I got the Eden wrap, and it was delicious and HUGE. I only ate half so I could leave room for some raw chocolate \"cheesecake,\" which was more like a pudding but quite yummy nonetheless. <br><br>It's a small space, but not cramped, although when I went there were only a few other people present. I only saw one person working, and she was so pleasant! I'll be moving into the neighborhood this fall and once I do, this will be a regular stop.", "pics": null}}, {"review": {"des": "I ate at Loving Heart on a very bad day for me.  I came to Chicago to visit my great aunt, only to find out she passed away.  Sad and hungry, I found this place on Yelp.  It was so nice to be greeted with a smile and gently instructed on how to order.  It was compassionate and comforting, exactly what I needed given the circumstances.  <br><br>I ordered the Hearty Bean Wrap and the Coconutty Smoothie, both of which I greatly enjoyed.  The wrap is big enough to save half for later. <br><br>If I'm ever in Chicago again, I'll come back.  I love places where they treat you well without knowing what kind of day you're having, just because it's the right thing to do.", "pics": null}}, {"review": {"des": "I cannot say enough good things about the food. I went with my friend. I'm not a vegetarian but she is, and both of us were blown away with the food. We ordered the Curry Bowl with noodles and the Ever Young Bowl with brown rice. We were so impressed with the food. It was delicious!! The Korean BBQ (texturized vegetable protein) that they added to the bowls blew us away. We both came home with leftovers (they have generous portion sizes) and our family couldn't believe it wasn't meat. Such flavorful food and so yummy!! Will def be back to try other things on their menu. <br>I must add we also ordered the carrot cake and cinnamon latte, but the entree raised the bar too high and the dessert and coffee was simply ok in comparison lol. <br>Super clean restaurant, very quaint, service with a smile, and again AMAZING food!!", "pics": null}}, {"review": {"des": "It's my first time to have salad that has a Asian flavor. Yummy!!! But it seems that there are not enough vegetables but too many vege meat in the salad. But all in all, I love this place!", "pics": null}}, {"review": {"des": "The ever young bowl and loving burger were perfect, even as take out.  As a lactose intolerant, I really appreciate vegan desserts so of course I picked some up as well and they were amazing.  Didn't see any pictures of the dessert so attaching some.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/kwRPF7Fyo1BXWbK8jzftGA/348s.jpg", "caption": "Carrot cake and cookies!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/CzG67OIAd5KXKxE6HqNEYw/168s.jpg", "caption": "Ever young bowl!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/WayFT5Fo9xeD0yIW_mjc-g/168s.jpg", "caption": "Bibim bowl!"}]}}, {"review": {"des": "This is a nice spot for a satisfying vegan meal (including dessert). The soup was freshly prepared,  and the noodle bowls were good.  The service was as genuine as other reviewers describe,  and the 'vibe' was pleasant.  <br><br>Though you can dine in,  everything is served in to-go containers, and while they are 'eco-sensitive' materials, the absence of real dishes seems counter intuitive to the broader vegan message in the café.  <br><br>Overall, it was not the best vegan I've ever had,  but was a solid experience and I would happily return.", "pics": null}}, {"review": {"des": "The Happy Burger and their nacho's are the two must things to try here! The Happy Burger is genuinely taste like a real burger. I use to eat burgers all the time and this had me fooled. The sauces in it are great which creates a little zest to it.  The burger also doesn't have that weird taste that you usually encounter with veggie burgers. It so good! It's a must if you love burgers (meat eater or not)Their nacho's are awesome as well. It has all fresh ingredients. It has hummus and a something similar to ground beef (it's not meat). It's so good. I don't even miss the cheese! <br><br>The place is typically quite, clean, and small. There is free wi-fi. It's a very unassuming place. I've had hard time finding it. I've passed by it multiple times on foot and by car without noticing it. The owner is extremely nice and she does look to be a one women show. It seems that she is the only one there.  They also do delivery as well through door dash. <br><br>If you love good healthy vegan/vegetarian food, this is the place for you!", "pics": null}}, {"review": {"des": "Loving Heart is my favorite vegan restaurant in the city. I go there at least once a week -- I'm hooked on their food. The potato soup is outstanding, and I also like the Loving Burger and the Happy Burger.  Such a great place! The nachos are great too, and the chocolate cake.", "pics": null}}, {"review": {"des": "Probably in my top three places for vegan food. I always get the loving burger but love to try out the other sandwiches. Everytime I come here I have a great experience.", "pics": null}}, {"review": {"des": "I highly recommend the Ever young noodles with Koren barbq and sobo noodles!   Good size portion filled with delish!   Yum!", "pics": null}}, {"review": {"des": "Even though I cannot stand meatless food, I love this place. The nicest staff, generous portions, very reasonable prices, and amazing taste.", "pics": null}}, {"review": {"des": "These place keeps getting better by the day..<br><br>Soup of the day is usually a blind take.. Especially if its tom kha its a no brainer...<br><br>Place is as neat and clean as ever with the most humble people running it.. <br><br>I very rarely give something a 5 star.. But what I can do.. Too good..", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/S-2JgNtCMPGjcTruCc46Sg/348s.jpg", "caption": "Ever young bowl of noodles are always the best"}]}}, {"review": {"des": "What I unique place , tasty , fresh , food. Owner is calm and friendly.<br>I wish there was a option for a stronger coffee because I like strong coffee<br>Get \" Bean Wrap \"", "pics": null}}, {"review": {"des": "Wonderful vegan vegetarian food! I had the Curry Bowl and if I lived here that would be my comfort food go to. Margaret had the Tom Kha Soup and the Green Diva Salad. Also very delicious! So glad we found this place so close<br>to our brother-in-law's apartment!", "pics": null}}, {"review": {"des": "Loving Heart is all vegan, all the time.  I never realized how many vegan joints are in my surrounding neighborhood until I started hanging out with people who are friends with/date vegans. I had a black bean and sweet potato wrap here that was good, but I missed cheese. My friend had a burger that was very tasty and was a beef substitute that looked like strips of beef and tasted like it was marinated in a Korean sauce.  They have air popped chips, and raw cheesecakes that look tasty, as well as brownies. My friend had a coconut peanut smoothy and liked it. I had iced coffee and thought it was good. <br><br>Overall an a-ok experience. It appears this place is the bomb diggy when it comes to vegan food. Don't be too judgy of my review.", "pics": null}}, {"review": {"des": "There are many great vegan restaurants in Chicago, but this is truly the best. Absolutely delicious food. Everything is so fresh and flavorful. The Happy Burger and the Summer Rolls are so good!! The green ginger pesto is so very delicious  The service is exceptional, always extremely friendly and kind. I never write reviews even when I like the restaurant, but I just had to say how awesome this place is! Thank you for your delicious food, Loving Heart!", "pics": null}}, {"review": {"des": "I'm a big fan of Loving Heart on Montrose.  And I'm surprised I haven't done a yelp review yet.<br>First of all, I'm a carnivore.  Not a vegetarian or vegan at all.  But so far I've loved the items I tried on the menu.  The Ever Young Salad is a symphony of flavors including something that tastes like BBQ pork.  The smoothies have all the yummy flavorings I like.  Don't forget the cinnamon ginger iced tea, and the vegan desserts. Try the vegan iced coffee which I think has almond milk or something yummy.  Once my buddhist group had a backyard picnic and I brought the Ever Young Salad which was devoured instantly.  I've encouraged many of my friend to try out LH too and no one is disappointed.  Once I got there and a Meetup group was in progress.  The staff are great and gentle and lovely.  Now if they could offer back massages, we could call it a spa.<br><br>Living nearby, I've seen several venues try and fail in this space.  I think Loving Heart has what it takes to stay around for a long time.  It's good for the neighborhood.<br><br>-- Dwight Okita     <a href=\"/redir?url=http%3A%2F%2Fwww.dwightokita.com&s=9fc76b08b37b9154244d917a97bf79947e1e591847dcf6567028e741a48fc435\" target=\"_blank\" rel=\"nofollow\">dwightokita.com</a>", "pics": null}}, {"review": {"des": "my sister mentioned a vegan restaurant and I said absolutely not... But after looking at the menu online I decided to give it a try<br><br>Started with the picobello smoothie which consists of apples, carrot, banana, kale, ginger and coconut milk. I loved the way it tastes. perfect juice.<br><br>Moved on to the green deva salad which was filled with the freshest organic vegetables and a homemade green ginger pesto dressing. It also has vegan Korean BBQ (texturized vegetable protein) and it is not bad at all! I was expecting to hate imitation meat.<br><br>Next the lotus wrap! Made with chicken alternatives, carrots, lettuce, tomato, onions and a home made spicy sweet sauce. split it with my sister and wish I hadn't! Delish! <br><br>We also ordered the bibim bowl with rice and it was good but at this point we were so full.<br><br>So happy we decided to give it a try! The lady at the front is the sweetest which of course made the experience 10x better!!! <br><br>COUNTER SERVICE", "pics": null}}, {"review": {"des": "I highly recommend this 100% Vegan restaurant: Tasty food, reasonable prices, nice ambiance and friendly service. Free WiFi. <br>My favorites are their potato soup and BiBim or Ever Young noodles.", "pics": null}}, {"review": {"des": "This adorable little cafe is a diamond in the rough (the rough known as not-very-veggie-friendly Uptown)! Not only is it within walking distance of work, but everything I've tried on the menu so far has been fresh and delicious!<br><br>The staff are friendly, the prices are very reasonable, the selection is decent, and I never feel like I'm ingesting too many calories or too much grease (as I do at a lot of the vegan diners in town).<br><br>While everything on the menu is vegan, my omnivorous coworker raves about the soy beef and has become a frequent customer!<br><br>I recommend the Paramhansa Salad, Happy Burger, Ever Young Noodle, and the awesome hummus-based nachos!<br><br>The only downsides, which really aren't a huge deal: sometimes it takes a bit of time to get your order (but there are typically only two women working, and everything is super fresh and homemade) and the religious propaganda and videos are a tad in-your-face, but that's totally their prerogative!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/HIxfneAOEHourBtGrd15vw/168s.jpg", "caption": "The Paramhansa salad minus onions"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/IJnB2XddR99hJgSVxA1OxQ/168s.jpg", "caption": "The nachos! Soooo surprisingly good!"}]}}, {"review": {"des": "Wow! Thanks Yelpers for Yelping about Loving Heart! <br><br>You order at the counter if you'd like to dine in. They'll call out your order when it's ready and you can bring it to your table. Everything is self-serve - water, silverware, napkins, etc. The lady at the register was very sweet and good at describing the food/beverages for the questions we had. <br><br>The menu items are fairly priced and you get a very good portion for your order. <br><br>Here's a big deal - they use biodegradable bags, to go containers and silverware! I can't tell you how many vegan/veg restaurants I've been to that don't do this. <br><br>Yelpers were right about the nachos - this is a must order if you come here! All of the vegetables on them were very fresh, and it didn't seem like we were eating hummus! Plus, the fixins to nacho ratio is spot on! <br><br>My dining pal had the Ever Young Noodle. Wow! She won on this one. The pasta was well dressed, and once again, all the vegetables were fresh. I had the BiBim Noodle. The noodles are not dressed; I feel that with more beef, the dish would have been great. The sauce overwhelms the dish a bit - it's good that you have the option to put as much or as little as you want. <br><br>We also had the cinnamon & ginger tea. It is well flavored and may be strong for some people. I find that the cinnamon is more prominent than the ginger. There are several teas to choose from. <br><br>The raw chocolate cake has a fudgy consistency; I enjoyed it. It doesn't have a rich, sweet chocolate taste. If you've had soy chocolate ice cream, it tastes similar to that. <br><br>This may not matter in the summer, but it is nice & warm in there! Tables, floors & bathroom are clean & bright. The one thing you may want to know is the rear seating has a speaker back there that may be too loud. We listened to a soundtrack from some play called The Real Love over and over for the hour and a half we were there. It sounded like something you'd hear at a Disney theme park. Pretty sure Shirley Partridge makes a cameo in this play since it was also projected on the rear wall (soundtrack and play not synced). <br><br>This place is garden level on the North side of Montrose, just a 1/2 block East of Jewel and the gym. Street parking can be tricky around here. <br><br>I am telling my friends about this place, and so should you. It is excellent! You'll like it even if you are a meat eater!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Lq7nuPgfZ-N8jwSxyyR9nA/348s.jpg", "caption": "Nachos! You must order these!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/xQ6phiWpqQjZUMM459F1iA/168s.jpg", "caption": "BiBim Noodle"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/VbGF5n6Nv9YRrPAJr4or_Q/168s.jpg", "caption": "Ever Young Noodle"}]}}, {"review": {"des": "A sweet, quiet place that almost looks more like a library than a cafe! This place was very calm when I visited on a Wednesday evening, and the staff was very nice. I overheard a few other patrons having very chill conversations about health and exercise, subtly judging their counterparts who still eat meat. Nonetheless they seemed like well to do folks who were also enjoying some serenity.", "pics": null}}, {"review": {"des": "What a great place this is! We walked about 25min to get here and it was well worth it. It's a small space that you can easily walk by without noticing the restaurant. Totally no frills, you order at the counter and the food comes out pretty quick. <br>Everything we ordered was awesome. The ginger cinnamon tea was refreshing. The Tom Kha soup was super good and 5 stars for the Ever Young noodle (I got it gluten free).<br>I wish there was more restaurants like this: affordable, simple, great healthy food and nice people!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/yuj03f4JcpODLfS0j4pXyA/348s.jpg", "caption": "Ever Young Salad"}]}}, {"review": {"des": "All vegan = awesome! All I had there was a wrap and chai. The wrap was pretty good. The chai was a little bit too strong. They close in the middle of the afternoon, which kind of sucked because I went there to study. Otherwise, I'm pretty excited this place is now in Uptown!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/OURRT4Ns8VMehkvpQqS07g/348s.jpg", "caption": "Main room."}]}}, {"review": {"des": "As an update:  I love this place!  The nachos are a staple, and you can't go wrong with the rice rolls, heaven wrap, or Tom Kha soup.  The staff is always friendly and helpful, and they deeply care about your input.<br><br>I can honestly say that this is one of the best vegan restaurants on the North Side.  The nearest competitors rely on dishes saturated with fat and salt.  The food at Loving Heart relies on the ingredients themselves, not deep-fried, heart-attack city.  You can keep your myocardial infarction, and I'll keep my health by coming to Loving Heart Vegan Cafe!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/QbeWExMXUT8FPYjH_-dc3A/168s.jpg", "caption": "Counter and new decorations."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/K_twAzZ1IoJtMUdXBob99A/168s.jpg", "caption": "Spring roll."}]}}, {"review": {"des": "The food was great! I'm not vegan, but I loved the nachos; way better than any meat and cheese nachos I've had lately. I also really liked that it was reasonably priced, especially for a vegan restaurant. Service was also very friendly. Being new to the area it was a nice find; I'll be back!", "pics": null}}, {"review": {"des": "Cutesy decor upon entering. Quite kawaii. Beautiful pastel trim and book cases. This is definitely a take out place as there were only about 6 tables fit for couples only. I didn't try the dessert but it was displayed nicely and looked perfect. I got the happy burger which tasted like real meat ! Came with all the classics an actual meat lovers burger would. Came with chips also. Small portions(McDonalds sized burger and handful of chips) but very yummy. I'd recommend for a great lunch spot.  *nachos were super small and bland wouldn't recommend * My bf LOVED his wrap though.", "pics": null}}, {"review": {"des": "Attention to detail to each meal served! Truly shows the loving heart with which they do their work. My favs are curry bowl and ever young bowl.", "pics": null}}, {"review": {"des": "The food is incredible, the people are so kind, and the prices are great.<br><br>It's a small, simple space, maybe easily missed. Make an effort to go here!<br><br>My favorites are: <br>The Loving Burger <br>The Ever Young Bowl<br>& the Tom Kha soup", "pics": null}}, {"review": {"des": "Always my go-to spot when in need of a healthy and comforting meal! Everything is delicious! Such a a cute neighborhood business and friendly place.", "pics": null}}, {"review": {"des": "Very kind and helpful personnel. Tidy and harmonic space. Delicious, healthy and fresh food. Very decent price.", "pics": null}}, {"review": {"des": "This is a great new vegan restaurant.  There are a lot of great options on the menu and  I ended up ordering more than I could eat in a setting.  First off, the green tea offered was pretty good (came in a packet though).  The spring rolls were also super tasty and had some seitan inside of them, though I wasn't a huge fan of the sauce that accompanied the rolls.  The burger was good too, but average.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/mA2BDL-8mFj6E4hB5L3gyQ/168s.jpg", "caption": "Vegan Happy Burger"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ptLJTOXHsGZhd2ka9Q7y8A/168s.jpg", "caption": "Vegan rice roll"}]}}, {"review": {"des": "LOVE!!!!!!!! <br>Due to recent dietary changes, seemed like there was nothing I could eat. This place is amazing. Healthy, quick, and delicious!<br>Has opened my world up to food possibilities.", "pics": null}}, {"review": {"des": "Curry bowl is to die for...   Nachos are very good as well.  And the vegan deserts are perfect in every way.   I love meat and I didn't even miss it!", "pics": null}}, {"review": {"des": "I ate at the loving heart for lunch today and, as usual, it was fantastic. I ordered (from the very friendly server) the Ever Young Bowl with noodles instead of brown rice and I also ordered a coffee. I started off with the coffee, which I drank black, although the server offered coconut milk and almond milk. The coffee was GOOD. The Ever Young Bowl was flavorful, healthy, fresh, satisfying and yummy! <br><br>Being vegan is new for me and it has been a bit of a struggle to eat out so the Loving Heart is really great for me! Ironically, my meat-eater brother introduced me to this place and he eats here all the time. Thank you Loving Heart and please keep up serving the great food!", "pics": null}}, {"review": {"des": "Green Dava Salad with Korean BBQ is amazing. Best salad in Chicago? Very friendly atmosphere.", "pics": null}}, {"review": {"des": "My girlfriend is a Vegetarian and I'm a meat eatter. However, you can't go wrong with this place. We regularly order food from here and the host always is very greeting with a lovely smile. <br><br>I love the Nacho's, Smoothies and the Burgers. <br><br>Prices are extremely reasonable. <br><br>Oh, psst, try out the Vegan Cookies (yummy)", "pics": null}}, {"review": {"des": "Healthy. Peaceful. Good-tasting. Except for stuff with BBQ sauce on it, which I don't condone. <br>The noodles were very good and the potstickers had fresh filo. <br>Also the book on immediate enlightenment is a good read. <br><br>This isn't a date place and it's not speedy. It's relaxing.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/LhoLDOakC4Re_KVsQR0org/348s.jpg", "caption": "The decor/library at Loving Heart"}]}}, {"review": {"des": "Delicious! Impressive quality, service, presentation-- this place is truly fantastic. I'm a huge fan, and a repeat customer.", "pics": null}}, {"review": {"des": "I cannot say enough about this great place . It's food is amazing , vegan food never tasted so good . Great selections of raw desserts , smoothies . Vegan Korean bbq ! It's a small gem! Very peaceful, small cozy space . Super friendly!", "pics": null}}, {"review": {"des": "Happy burger was delicious. The atmosphere was quiet and I sat by a nice big front window to soak in the sun while I ate. Must go for vegans!", "pics": null}}, {"review": {"des": "this place is currently closed, no dates listed to when they will re-open", "pics": null}}, {"review": {"des": "Very Clean and cozy restaurant..... I enjoyed the Heaven Wrap and I had some of there very Healthy Nacho Chips....Quick and great food....", "pics": null}}, {"review": {"des": "In the past months, I have had the potstickers, happy burger and the finally, the Green Deva noodle salad last night.  It was pretty big to begin with, and I ate it all.   The top layer had the vegan Korean BBQ, sliced pieces of red pepper, lots of cilantro (which I love), then the noodles below covered thickly in the sauce.  It was nutty, coconut-ey, with a big hint of green. <br><br>I could have eaten even more. I might even eat that every day I am at school until I get sick of it. Seriously.", "pics": null}}, {"review": {"des": "This place seems simple, but the flavors are amazing. We got the curry bowl and nachos and both were fantastic. <br>The smoothie was just ok", "pics": null}}, {"review": {"des": "5 stars in every aspect. Attention. Location. Service. Environment and of course the food is awesome! I have had the happy burger the loving heart burger and the ever young noodles. Taste is great. This is my favorite vegan rest ever and is so close to my place! Prices also very affordable. You can't go wrong with this place! Nice nice", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/9a7KOCVsJGPPbyZVg6OG2w/348s.jpg", "caption": "Ever young noodle"}]}}, {"review": {"des": "I consider myself a Flexatarian (I eat veggie meals with no meat several times a week). I have eaten at Chicago Diner, Karen's, and Mana food bar. The food from Loving Heart is as good and better! Try the Lotus Wrap. I only wish the restaurant had a more vibrant ambiance, and I wish they were open later. Great food, fresh and tasty!", "pics": null}}, {"review": {"des": "Delightful. Delicious. This is a restaurant that makes you feel good about eating out. And while eating, the rush of \"comfort food\" emerges sans guilt. My belly and being are both well-satisfied. If you enjoy wholesome, planet-friendly, nutritious food prepared with care, then plan to find your way here. Thanks, Loving Heart, for sharing your talents with the public.", "pics": null}}, {"review": {"des": "This is one of my favorite restaurants in Chicago. I tried veggie burger, noodle salads, wraps, cup cakes and coffee... and now I eat here few times a week. <br>I like the fact that they use fresh vegetables, avocados, organic bread etc. everything fresh. <br><br>Bibi.. The host is very friendly.. and will recommend food based on your pallette. <br><br>Price is so reasonable. Not expensive at all. <br><br>10/10.. and i am not even vegan.", "pics": null}}, {"review": {"des": "Vegan gem! Quick & friendly service. Order at the counter type place. Texture of the faux meat is probably one of the best I've had. There's also cool posters/pamphplets in the place with quotes and info from different vegan celebrities. It's cool to read over while scarfing down the goodness.", "pics": null}}, {"review": {"des": "Hands down the Best vegan food ever! Everything was made fresh and tasted incredible! I couldn't have asked for a better meal!", "pics": null}}, {"review": {"des": "Get the yellow curry!  It was so delicious.  We chatted with the owner, and she was so nice.  I am new to the area and was so happy to find a great vegan place. My husband had a veggie burger, which was a bit small, but the curry portion was huge.  We will be back.  Get the chocolate cake for dessert - you won't regret it!", "pics": null}}, {"review": {"des": "Yesterday was my first time trying Loving Heart. I seriously wanted to order everything on the menu! Bonus: The space was sunny, clean, calm. The woman who took our order was very kind and helpful. I only ate half my Hearty Bean wrap (even though I wanted to eat the entire thing) because it was huge. I enjoyed my experience here immensely and will definitely be back for more!", "pics": null}}, {"review": {"des": "Simply an excellent place to eat. Quiet, pleasant, with excellent filling food whether you are vegan, vegetarian or a meat eater.", "pics": null}}, {"review": {"des": "I've been meaning to come to this place since January and I'm finally here, 6 months later. I wish I had come sooner - it's fresh, healthy food *that's tasty* and a good price.<br><br>Between the happy burger and loving burger, happy was the better one. Loving burger had a sweet taste to it.<br><br>Paramhansa was unexpectedly good with the apples, raisins, cranberries. It was a nice start to the meal<br><br>Nacho chips are more filling than you would expect. Flavorful hummus with a flavorful tomato chutney.<br><br>Will definitely come here again! I think it will be my go to place since I love across the street.", "pics": null}}, {"review": {"des": "Spot on every time. Literally a loving atmosphere. Very kind workers. Their food is so so good, and maintain and simple menu that really delivers fresh ingredients every time.", "pics": null}}]}