{"name": "lowcountry-lakeview-chicago", "reviews": [{"review": {"des": "Really great food! I have been here three times and every experience was great. <br><br>Service: Always very fast to be seated and get drink orders. Every server I've had are very quick to explain how ordering works for anyone who is new and the food comes out incredibly fast!<br><br>Food: Ordering here is pretty great because you get to build your meal. You get to pick your proteins (shrimp, lobster tail, and king crab is what I recommend), sauce (everythang is SO good), heat, and then add ons (corn on the cob, sausage, potatoes). <br><br>I also always order the Honey butter jalapeño cornbread -- VERY GOOD!<br><br>When the food comes out it is in a clear bag and the server will cut it open right in front of you. I really like this because you see how good the food looks, then you get the delicious smell of the food when the bag opens, and then dig in!!<br><br>Highly recommend!", "pics": null}}, {"review": {"des": "Came by on a weeknight with a friend to try Lowcountry. Little bit of spice to ward off the cold was just what we needed. My friend had never had a seafood boil before, so it was on!<br><br>I'm slowly making my way through seafood boils in Chicago, this was next on the list so it was perfect timing we decided to come. The decor was festive for the holiday season and such a cute place overall. It made you feel like you were dining outside somewhere in the south. They were mostly picnic tables covered in your standard red and white picnic style. A roll of paper towels was on each table. The community sink to wash your handles was centrally located.<br><br>The staff is super nice. The food comes out hot, but not to the extent that you can't dig in right away. The potatoes are a great pairing of vegetable with their sauce. The corn was pretty good too, but the potatoes totally win. Next time, we're going to try the sausage. They also have happy hour on drinks (half-priced with food purchase when seated at the bar), which is fun. And...there's a shots dice game ($3 shots).<br><br>Their daily specials are a great deal. They have mussels and fries for $10/lb. before 7pm. From Tue-Thu they have a great combo for $25 (1/2 shrimp, 1/2 snow crab legs, 3 pieces of corn & potatoes, 2 pieces of cornbread). <br><br>What we actually got:<br>G & T - made with grapefruit gin (fantastic)<br>Garlic Noodles - they were alright, but not really recommended. They were a bit on the bland side and tasted like maybe garlic powder was used...noodles were really soft. They could be good with a stronger garlic flavor.<br>Cajun Fries - fries are hard to not eat when they are in front of you. They were decent, would've been better with more cajun seasoning and fresh from the fryer. Not to say this exactly stopped me from snacking on them.<br>Jalapeno Cornbread - served with melted honey butter is amazing. By far, this was our favorite side dish. It's a tad dense, but the jalapeno kick is there and the honey butter you pour on top is the best thing to add to the cornbread (though the cornbread can stand on its own). This is highly recommended.<br>Mussels & Potatoes - the potatoes do a great job soaking in the sauce and a perfect veg to have in your boil. Sometimes it's bland and is extra, but this added to the boil and was amazing. The mussels were tops for us. They were big, full of flavor and perfectly cooked.<br>Headless Shrimp & Corn - the shrimp are easy to peel, great at be covered in sauce (makes you want to suck the sauce off before actually peeling the shrimp for consumption). The shrimp is well cooked and deliciously sweet, not overcooked. The corn was good, easy to eat, but seemed a bit waterlogged. <br>Beignets - they come served warm. They're big and a bit dense and covered in powdered sugar, but they're still delicious. Best consumed while their still hot/warm. <br>Fried Oreos - while both desserts are good, if you don't have room for both, choose the Oreos first. They're not your typical Fried Oreos. They are battered in a cereal coating giving them extra crunch as you bite into them. They are fantastic! They cream gets melted into the chocolate cookie shell, but you can still taste that it's an Oreo. The crunch and the soft gooey center is a great combination.<br><br>TLDR: definitely worth checking out. Their sauce is on point (the everything - level 2 is a good enjoyment level, but if you like spice you can feel, I'd kick it up to level 3). Any of the seafood options would be a great pick (mussels, especially). Jalapeno cornbread is the way to go. Fried Oreos to finish up.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/k6WLcKIy02aDtElq755vUw/348s.jpg", "caption": "Jalapeno cornbread"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/QF6C_VAnnElahfRbsWnOJA/168s.jpg", "caption": "Headless shrimp & corn"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/cmFM3HEdwJadJU02KpwBcQ/168s.jpg", "caption": "Cajun fries"}]}}, {"review": {"des": "I had a great experience here! We came during crawfish offseason and still enjoyed our meal. Two of us split the 3 year anniversary special and it was perfect. I'm sure that deal won't be around forever though, so go before it's gone. They also have happy hour and weekday specials which are an awesome deal too. So if you're hesitant about going cause of the price, I would recommend going during the week. <br><br>The food was delicious and service was great too, I'll definitely be back.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/caQGZSgvtSVSgP6XcfxrlA/348s.jpg", "caption": "3 year anniversary special (snow crab, king crab and shrimp with corn, potatoes and corn bread)"}]}}, {"review": {"des": "What an authentic seafood boil! I was pleasantly surprised with all aspects of Lowcountry: the cool decor (hanging buoys and glass terrariums), a hand-washing station in the center of the restaurant for convenience, long picnic tables for seating, and the FRESHEST seafood! There's a fireplace near the front for extra warmth- so cozy! Our party of 6 arrived at 6:00pm on a Saturday and waited about 30 minutes for our table. While at the bar, we took advantage of happy hour pricing: half-priced cocktails, drafts, and wine, and half-priced apps (available from 5:00-7:00pm; must order both food and drink). <br><br>Once seated, your group can opt to \"Roll the Dice\" for a random round of shots ($3/person). The server will bring a giant die, which one person rolls on the floor. The number that lands face up determines the round of shots for the table, from Malort to Something Sweet to Fireball. One catch: everyone has to participate!<br><br>Our waiter explained the menu and his recommendations. Key takeaway: 1 pound of seafood per person, and the \"everythang\" sauce is the most popular. You can determine the level of heat from mild to ridiculously spicy (literally!). We opted for the \"Three Year Anniversary\" order with 1/2 pound of crab, 1 pound of shrimp, potato, corn cobs, and a side of jalapeño cornbread. It was plenty for two people and a reasonable $39.99. Put on your bib and pass the paper towels because it's a hands-on, messy dinner! <br><br>Service was a little slow while waiting for our check, but likely because many other tables were wrapping up at the same time. Many folks were standing inside waiting from 7:30pm onward, so I recommend coming on the earlier side on the weekend. Check out the weekday specials too! Lowcountry was fun and definitely conducive for bigger parties, families, and kids. Bring your crew and dig in!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/EWe0AEnc9ujppHEwR_ZyWQ/348s.jpg", "caption": "Dinner for two, freshly boiled and ready to serve!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Xb6CR6V3EbRVXRjIF_dSnw/168s.jpg", "caption": "The main event- Anniversary Special for $39.99"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/KiqqkvYX2iUJl6mLPgvw1w/168s.jpg", "caption": "Dinner menu"}]}}, {"review": {"des": "Parking on the street is limited.  It is best to park in a garage and walk to the restaurant.  We parked in DSW/Marshalls/Michaels garage for free.  It was a 10 min walk to the restaurant.  There was no wait when we arrived.  We arrived right before a Cubs game let out.  <br><br>They keep buckets and paper towels at the table.  When I looked at the menu I was concerned.  The prices aren't listed.  I'm sure it's due to changes in market value.  They change the prices on the wall.  If you don't see them, your waiter will write it on your paper menu.   We informed the waitress we are trying to attend a movie and they rushed our order.  Which shows they are very accommodating.  <br><br>I had a soft shell crab for my appetizer.  Don't be alarmed, but this is only one crab (enough for one person).  I ordered the the crab legs (one pound) with three corn and three potatoes.  I was concerned this wouldn't be enough, but I was very satisfied.  I selected the Everything sauce; this is garlic and cajun sauce mixed.  This sauce was EVERYTHING!<br><br>The food is worth the walk and whatever price they want to charge!  I will make it my business to stop here again!  I hope you try it next time your in Chicago.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/J9SJ1OvcxuWTl9aukLawwg/348s.jpg", "caption": "The menu, but where is the price per pound for the Lowcountry boil"}]}}, {"review": {"des": "I didn't know what to expect when I walked in here, but this is such an experience! <br><br>The menu is...complicated. Our waiter spent two minutes explaining how it all worked and how to combine things, and when he left I had forgotten everything and was confused. Thankfully we had read the Yelp reviews and knew what to get (thank you Yelpers)! <br><br>What we ordered: <br>We got the weekday special (3 pieces of corn, potatoes, 1/2 pound shrimp with heads off, a 1/2 pound snow crab, and 2 pieces of jalapeno cornbread). We added another pound of shrimp, pound of snow crab, sausage and a side of rice.  We knew to get the everything sauce as that was the favorite. Somehow we also got a soft shell crab with spicy sauce, we didn't order it so I don't know how we got it, but I'd suggest it. <br><br>They suggest you order a pound of seafood per person, and we had some leftovers. You can split a bag with your table or get individual bags.  Their shrimp was really good, but you still have to peel off the shell and legs, even when they come without the head or you can order with the head. The rice was really good with the extra sauce from the bag and the soft shell crab was surprisingly good.  We were very satisfied with the quality of the seafood, the crab tasted great without the sauce. The only drawback....my mouth has tasted like garlic for the next 24 hours...but it's all worth it! <br><br>The eating experience: <br>It comes out in a big bag which they cut at the table. Before eating, cut many napkins for yourself or use the gloves. I didn't know there were gloves until it was too late, so the napkins were a must. They provide you with 4 utensils and a bib and have an area where you can wash your hands. <br><br>This place doesn't take reservations but they have really long tables so it is good for big groups!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/UePnZNefJOczrxb2FOs9zQ/168s.jpg", "caption": "Rice as a side was a good choice"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/iXSk0McdFfJlrokhWiq2lA/168s.jpg", "caption": "This was super good!"}]}}, {"review": {"des": "We went with a group of 8 on a Friday night around 7:30 PM and the restaurant was about 80% full. The host was great and was able to have a table cleared and us all seated as soon as we arrived. We ordered about a pound of seafood per person and sides and everything tasted phenomenal. <br>I highly recommend the following 2 things that particularly stick out as amazing:<br>- shrimp with everythang sauce <br>- honey jalapeño cornbread... seriously the best <br>They also had some good drink specials and you can get beer buckets that are as cheap as 6 for $25. <br>It's a fun dining experience as a group! Definitely recommend!", "pics": null}}, {"review": {"des": "Jonathan was our server! He was dope he explained everything to us on how the food is prepared and the sauces to get we ordered the Anniversary Special which was a great deal for $39 and I got the Sangria which was super tasty. Great food good drinks great concept and service. What I didn't like was after I brought my leftovers home I didn't know how to warm it up. But I'll certainly be be back!!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/FROCf2-MdqmRH9X3-TYACg/348s.jpg", "caption": "When you only want one Deep Fried Oreos"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/8gFb6s4OoZaxIhxXScITbQ/168s.jpg", "caption": "Anniversary Special"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ZHb3KpzsqBxwTYXSCoujHw/168s.jpg", "caption": "Rum punch and sangria"}]}}, {"review": {"des": "Im not a big seafood boil fan. Butttttttttt I've gotta say that they ARE THE BEST!!! The seasoning they use will have you smack yo mama!!! Lol I've never tasted a boil like theirs. I got all flavors, level 3. Drinks were good & strong too. The service was pleasant as well. The only thing is it's very pricey. I had the snow crab and lobster tails. EXCELLENT", "pics": null}}, {"review": {"des": "The decor is great and it smells really good when you walk in. Heads up, I would request an actual table and not sit at the picnic tables that they have unless you like to have the bench your sharing with other people be moved and bumped every second like I had, the girl could not sit still and it was very annoying. I asked the waitress to move to an actual table and it was sooo much better.<br><br>Anyhoo, to the food. I love spicy food and I almost got the number 3 Spicey was for the crab boil but luckily I went with the #2 hotness and it had a nice buildable kick. I got everythang for the season in and it was flavorful and delicious. Me and my sis ordered the jalapeño pepper corn bread which was just okay, I thought it could be a little sweeter but my sister said she thought it was sweet enough.<br><br>You must try the fried pickles, those were my favorite, they have a nice crisp thin layer and yummy thick ranch dressing to dip them in.<br><br>My sister orders a margarita on the rocks but o could barely taste in alcohol in her drink. I ordered an hurricane but it wasn't strong at all, it tasted nice but I think it was lacking a little bit of the liquor. I had a super long work week with lots of overtime and I was looking for a strong good drink but it was a miss at this place which is why I took away 1 Star. Would definitely come back.", "pics": null}}, {"review": {"des": "Way better than The Boiling Crab in California and The Boiler Shrimp in Crawfish in Skokie suburbs. I'm no culinary expert but I like to eat. Low country does it just right for their seafood. I traveled a couple times to New Orleans and fell in love with the Creole/Cajun spiced seafood down there. <br><br>My family and I came here for a friend's birthday party. They had a 3rd year anniversary. I'm Filipino so when I have the chance to eat with my hands, the better. We sat down and ordered their third year anniversary combo (which btw was the highlight of our meal) included shrimp, corn, crab legs, potatoes, cornbread in Hot Garlic sauce for $39.99. In addition, I ordered the Broccoli salad and Gumbo. I'm a bit of a Gumbo snob (I make my own at home) so it was a bit underwhelming, it was just a bit salty for my taste. Other than that everything else was delicious.  The cornbread was actually my favorite viand of the night. It was so buttery, slightly sweet, and corn bits which was so scrumptious. <br><br>Service was top-notch, attentive, and friendly. Pan, the owner came by to even chit chat with us. He really cares about making the customer happy. What a nice guy! We will definitely be back next time I crave seafood broil. 5 Stars!", "pics": null}}, {"review": {"des": "Wow I truly loved the food.  Specially the service.  We had an awesome crew that was making sure everything was ok.  There was so much food, we actually took food home.  I loved the restaurant atmosphere and the setting.  I been to other crab restaurant and the are so crowded you eat elbow to elbow.  Low country is very specious and roomy.  Very clean and modern decor.  <br>What is not to like about getting an enormous bag full of the most delicious seafood.  I enjoyed eating the calamari, soft  crab shelf. The only thing I did not like was the fried Oreo cookies.  I loved this restaurant for the service, food and for the price.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/S9ENG2WzzVnKa4q4MkVJXw/348s.jpg", "caption": "Enteance"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/pt0BmhIz-tf3VCE7JIaMsA/168s.jpg", "caption": "Bar"}]}}, {"review": {"des": "As much as I dislike eating with my hands and reeking of garlic and seafood I freakin love seafood in the bag places! <br><br>Came here with a friend for the first time and everyone was super friendly. We were told we can sit forever and just grabbed a long table. The waitress came by and went over the concept. Suggestions on how much to order etc etc. we went with a pound of shrimp. 2 lbs of snow crab, potatoes, sausage and corn. All in garlic. We also got a side of white rice and garlic beignets. Everything. Was delicious I would say skip the garlic beignets, they were too greasy for my taste and filled me up way too much. <br><br>I would for sure be back they cleaned up quickly, packed up our food to go nicely and were super friendly. <br><br>Tip- I always say this to myself but never follow through. Get the seafood plain and get the sauces on the side, I feel like they sauce the bags too much and you end up smelling. For days. I would rather have the seafood plain and just dip into the flavorings.", "pics": null}}, {"review": {"des": "Up until I was in college, I never ate seafood. Now I love it and I feel like I need to make up for all the lost years. Good thing Lowcountry exists so I easily get my fix. <br><br>You enter the restaurant and there are long tables. This is a great place to go with a group. In fact, I highly recommend coming with 4 or more. <br><br>Once you grab a spot, there are baskets on the table with the menu. You order the type of seafood you want by the pound and the price per pound is posted on a board on the wall. It's market rate and some things are seasonal so they won't be available. You choose your food, pick the spicy level and the flavor profile. And then you choose your add-ins: corn, sausage, and potatoes.<br><br>Both times I've been here I've gotten the everything sauce - combination of Cajun, Lemon Pepper, and Garlic sauces. It's delicious. I've also gotten the level 1 heat level. Level 2 is okay but I feel like some of the flavor is lost. I like hot food - believe me, I'm the one who writes angry reviews if the restaurant serves me food that's \"spicy\" and isn't hotter than sriracha sauce. But something about the way Lowcountry adds heat to the sauce takes away from the flavor. So I'm fine with level 1. But if you're looking for hot food - level 1 isn't what you should order.<br><br>I also highly recommend ordering the sausage and corn with your boil. The corn is yummy but the sausage is incredible. Potatoes taste good but I've only got them once. I feel like it's a waste because all the carbs will fill you up before you can eat all the fish. But to each their own.<br><br>Shrimp you can order with the head on or without. Both options you'll have to peel off the legs and tail. I recommend going for headless because it's kinda gross taking off their heads but you do you. Either way the shrimp is amazing and next time I'm going, we're doubling up on shrimp. Mussels are okay but I discovered that I don't really like mussels. My friend who likes mussels found them to be tasty. Snow crab is yummy and fun to break out of the shell. I haven't ordered the King Crab because it's been double the price of snow crab. <br><br>Once you place your order, the wait is short. And the food will come delivered in bags that you just dig into. It's a messy meal but they also provide bibs. Plus, there's a set of sinks in the middle of the restaurant so you can wash up when you're done!<br><br>I also recommend the jalapeño corn bread and the beignets for dessert. Yum! <br><br>Overall, this is one of my favorite places to take my friends. If you go with a group, it won't set you back too much. For four people we ordered: 1 lbs. shrimp without the head, 1 lbs. snow crab legs, 1 lbs. mussels, jalapeño corn bread, beignets, and a half-off bottle of white wine. We ended up spending about $27 a person which isn't too bad for dinner and drinks.", "pics": null}}, {"review": {"des": "Came here for an early dinner right when they opened at 4pm because otherwise we would have had to wait. Service was a little slow to start and it took our server a little bit to notice us but when she finally did we finally got things moving. We had ordered the fried shrimp, the fried calamari and the jalapeño corn bread as appetizers and everything was okay. I was hoping the corn bread would have been a little tastier but it was a little crumbly which i didn't care for. The fried calamari was a little on the smaller side which is eh so we had to order a few orders of it! <br><br>Then came out our main entrees which were super yummy as I definitely preferred them over the appetizers. The shrimp and the crab were super tasty, we did the second level spicy which had the right amount of heat but also the right amount of flavor! <br><br>I would come again if I'm in the area as the people working here were super nice and I would skip the appetizers and just get more pounds of the crab meat and next time I'll go for the king crab!", "pics": null}}, {"review": {"des": "They serve seafood in a bag full of sauce. That's how I like my seafood boils, none of that sprinkling of Cajun dust.<br><br>The appetizers of calamari and soft shell crab, both served with jalapeños, went over well with a nice kick that even those who can't endure spicy food would like. The shrimp, crab legs, corn, andouille, and potatoes in the spicy lemon garlic sauce hit the spot. Must admit the limeade and the Jameson and ginger beer also were a plus.<br><br>Seafood boils are big in Chicago and for someone who spent time in New Orleans and in bayou country throughout Louisiana, comparing seafood boil restaurants this far North to \"real deal\" Cajun eating can be unfair. However, Lowcountry is not half stepping. (I am surprised they didn't focus on Lowcountry, South Carolina.)", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/g_n8igneMoRjuu8QSJJ-Mg/348s.jpg", "caption": "Calamari with Jalapeños"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/yqJR-kQxVIbxA3w485DQ2A/168s.jpg", "caption": "Soft Shell Crab with Jalapeños"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/U2Ip5nzdRPy5R8VSthyoQg/168s.jpg", "caption": "Lowcountry Limeade"}]}}, {"review": {"des": "Best seafood in Illinois! Honestly better the New Orleans in my opinion, outstanding food", "pics": null}}, {"review": {"des": "This restaurant has been on my list to try since the cajun seafood craze started in Chicago. I finally tried it recently with my family and I was pretty disappointed. The shrimp was overcooked. The flavor was mediocre. There are so many other cajun seafood places in Chicago now that I would prefer over this one.", "pics": null}}, {"review": {"des": "Plain and simple: <br>Top notch service and the food was delicious!<br>I appreciate the roll of paper towels bolted right to the table. Also the have a hand washing station presented nicely in the middle of the dining area!<br><br>Parking could be hard to acquire during a cubs game but we lucked out with street parking during our visit.", "pics": null}}, {"review": {"des": "After planning to go here forever and my cousins raving about this place, I finally made it last Friday! <br><br>They're open until 11pm with last orders at 10:30. We got there around 9pm and there was only one or two other groups in the restaurant. Perfect! I hear the wait could be an hour sometimes if you go during the dinner rush. <br><br>We ordered one shrimp with head and one mussels. Both had Cajun sauce, shrimp was level 1 and mussels were level 2 spice. We also ordered two sides of rice, potatoes with the shrimp, and jalapeño cornbread. <br><br>Everything was delicious! I really liked the spice level 2 but eating that continuously could get really spicy. The level 1 is a nice break. It goes great with rice because it soaks up the sauce. The potatoes were good as well. I also loved the cornbread! I'm always on the search for a good cornbread and this hit the spot!! I thought the jalapeño might be overpowering but it wasn't at all. <br><br>I will surely be back to try the everything sauce and perhaps the garlic noodles!", "pics": null}}, {"review": {"des": "Andrew made a Rum Punch for me that was outta this world.  If you like seafood you need to try low country. But be ready to get messy kinda,like a pig in mud kinda way!", "pics": null}}, {"review": {"des": "This place is awesome!!! It was sooo good. I can't even explain how good it was. I lived in the South for a few years so I was used to real<br>Southern Cajun/Creole seafood so I wasn't expecting much.. but they definitely impressed me.<br><br>The crab, shrimp, potatoes, corn, etc, ALL OF IT was seasoned amazingly. Like you can actually taste the spices and the juicy goodness. I hate going to seafood places and it looks like it seasoned, but once you bite into it or open it up, it's just bland. Not the case here. Again, I was seriously surprised and very impressed.<br><br>Came here with some friends for a mini \"bachelorette\" lunch. Our server was super friendly, attentive, and helpful when it came to ordering. He explained the menu and how everything works. <br><br>They also had bucket sinks conveniently outside of the rest rooms, so clean up was easy! No need to fumble around with messy hands trying to find your way to the bathroom. You can prewash before you go. I liked that a lot.<br><br>There was also some dice game where you roll for a shot, so we let the bride to be choose our fates lol.<br><br>We had a lot of fun and was so full afterwards. I've already recommended this place to a lot of my friends and will definitely be back!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/I7JxXiVU6iDB3DQa3OmDCw/168s.jpg", "caption": "Dice game"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/EhvFdAmYnSmSS5uNCN4Etg/168s.jpg", "caption": "Messy but classy feast lol"}]}}, {"review": {"des": "There's so much greatness in this place and their food, I don't even know how to begin, sight, well I'll give it a shot. <br><br>From the moment you step inside this southern seafood wonder, the scent draws you in from a distance and once inside you know that your eyes  mind and tastebuds are going to taken for a flavorful joyride. <br><br>We got shrimp  mussels with their hot sauce, it was finger licking good, can't wait to go back. <br><br>Ps. You must be comfortable to have your food get all over your Face.", "pics": null}}, {"review": {"des": "How cool that Chi-town has a low country place! Be ready to pay a pretty penny when you come here. The seafood comes in daily. Some of it is flash frozen, but you would never know. Picnic style seating. Huge portions so don't order too much! We ordered way too much food for sure. None of the side items really caught my fancy, but the seafood was good. Some of it is quite spicy- so beware! Nice staff. They also serve fried oreos for dessert- nam!!!", "pics": null}}, {"review": {"des": "Sweet, spicy, savory, sloppy, salty, sublime, super smiling service, special, sensational.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/9WCEjassqYJfCwo-0CQZZg/348s.jpg", "caption": "Fresh hot Beignets Aka Powdered Pillows of Love"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Gxo1ak2hpYz2GBXN81LGGg/168s.jpg", "caption": "Dungeness Crab"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/wHQ1__Eyw9iWfflyjI7YvA/168s.jpg", "caption": "Mighty good eating. The Everything Sauce is addictive!"}]}}, {"review": {"des": "Honest review: it was a million times better then angry crab that place is so overrated its like the au cheval of seafood. this is how u order if u look at the table there are pens n a menu u could either fill it out urself or ask the server for assistance. the first thing u pick are the proteins my recommendation is to get the shrimp because this is the one protein they put alot of it then i would get whatever proteins u want even though its pricy jus know its not gonna be a small portion. Then u pick the sauce u want i always go for everything because i want more flavor. Then u pick ur heat level we picked two because the server said it was spicy. It wasnt at all had to keep asking for hot sauce wish i would have ordered 4 n on their Instagram they talk about a level 5 heat. Then u pick ur add ons i dont add anything else dont think they do anything jus feel like its a waste of money/ service: our service was really nice n really went above n beyond like she checked up on us every 10 minutes literly n the other employees were really nice to my only issue is that the non servers would ask if we needed anything n when we did ask for something we wouldnt see them again or get what we asked for? This was a little confusing. Ambiance: its big theres normal tables n  communal tables theres tvs to watch games n chill n theres a bar area theres a place to wash ur hands that is really helpful. On the tables theres a bunch of napkins n u get served with all the utensils u need. I would recommend keeping the plastic bowls they give u when u first sit down so its less messy when h eat the seafood boil. The bad: first thing was the appetizers werent that flavorful n werent properly done. Like the calamari was overcooked so it was really hard n it didnt have any seasoning on it. The soft shell crab lacked seasoning too. The fries werent crispy n needed salt. The aioli however was really good. Issue number two: the seafood boil was extremely salty like literly tasted like ocean water they really need to town down how much salt they put like literally my tongue was numb like if i had burnt my tongue from all the sodium i consumed. Issue 3 the seafood boil gets cold really hot because it wasnt to hot to begin with its like luke warm the seafood has to be extremely hot i feel if they did like an asian hot pot it would retain the heat better or in a pot maybe or even if they get rid of the dumb bag n use like a big fondue pot with a burner underneath to keep the seafood hot this is a really big issue because it takes a long time to unpeal the seafood to get to the meat n when u finally do its cold.  jus add more seasoning to apps n add more cajin flavor to sea boil last issue plz clean shrimp takes two seconds to devain a shrimp n cut of their legs n try to to some different apps n desserts they were basic {another recommendation is to eat crab fast because it gets cold in 2 secs n starts to get really salty} it was better then angry crab and mad boil so  3 stars<br><br>2/5 Fried calamari $8 this needed seasoning badly didnt have no salt or peper nothing which was disappointing. It was rubbery cause it was overcooked so be vary of that chefs. <br><br>2/5 Softshell crab $12 didnt have no funky taste, but was tinier then other soft shell crabs i had. It needed seasoning<br><br>1/5 Cajun fries $6 these were sad they werent crispy n needed salt wouldnt order again <br><br>Aioli dipping sauce: good but i had better its jus mayo n hotsauce feel they could added more flavor to it<br><br>3/5 Shrimp/ crab boil $74 when u think of how much food u get its worth it. The first thing i have to point out is that its not greasy or has a gross buttery taste to it like angry crab. The sauce had a lot of garlic but thats all i really taste that n salt would have loved more cajin seasoning n lemon peper. The seafood was overcooked so i would recommend as soon as its about to be done send it to customers then boom itll be perfect. The shrimp need to be cleaned takes two seconds to devain a shrimp n cutting some of the tails would be nice too<br><br>0/5 Deep fried oreos $6 i never really understood why people on food network would say its over battered until i tried this. Literally the batter is like double the size of the filling u coulsnt taste the oreo at all so it was really bland a pancake batter would be better n their wasnt enough sauce would be wise to put it on the side to not get soggy<br><br>3/5 Beignets $6 lol these weren't beignets these were donuts but they were tasty though beignets are suppose to have the texture of popovers jus an fyi <br><br>Desserts/ appetizers try to make things that are complex n different n i bet u would be more crowded then angry crab", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/mDO_r_Ggfz8n_CixoXhEzQ/348s.jpg", "caption": "Menu"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/FK4kNFjwYpwkjg_rhVvHYQ/168s.jpg", "caption": "Menu"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/4hz_73cgQWrw4q7edx3P2A/168s.jpg", "caption": "Inside"}]}}, {"review": {"des": "This place is awesome. My mom and I came here for restaurant week 2k18, when we arrived on Friday, the hostess told us it would be a 45-60 minute wait, so my mom and I decided to walk to the bar for drinks, before we finished our drinks, the hostess texted me to let us know our table was ready. The seafood was delicious, the number 2 Hot level is a little spicy, but not a first, the more you eat it, the spicier it gets. The honey butter jalapeno cornbread is amazing. The beignets were awesome. I will definitely be back. The two of us spent under $100 with tip and drinks, thanks restaurant week. You will get messy, do not wear white, be prepared to lick your fingers and use every paper towel at your table. They have opened a South Loop location too!!!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/skOP6Wdr-KAGXU0_B_U37g/348s.jpg", "caption": "Restaurant week menu 2k18"}]}}, {"review": {"des": "I finally had my birthday dinner here last month and it was good though I was not blown away: I had 2 pounds of mussels (my fav!) and 1 pound of snow crab legs in the everything sauce (Cajun, lemon pepper and garlic butter) with no heat (I don't prefer spicy foods). The mussels were big and plump as others yelpers had previously reported on so I was extremely happy about that and the crab legs were sweet and meaty so I was also satisfied with that. However the flavorful was a bit mild to my liking and I've had better more robust flavor at Two Fish (similar concept restaurant on the Southside). <br><br>The sides & desserts were good such as the garlic buttered noodles, fried pickles, jalapeno cornbread and sweet beignets. The specialty cocktails weren't so special and left me wanting more (in flavor, alcohol content and quantity), probably due the glassware they used: mines came in small rock glass and my friend had a margarita also in the same small rock glass (um, it should had been in a margarita glass, DUH!). Overall I was glad to have checked it out and would go back once or twice more but since I have a boil-in-the-bag seafood restaurant in my own backyard, I'll stick to Two Fish as my go-to spot for this type of cuisine.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Pv6RwZBAQhXoCCX7Jv3g_A/348s.jpg", "caption": "What's in my bag? 2 pounds of mussels and 1 pounds of snow crab legs in the Everything sauce with no heat."}]}}, {"review": {"des": "Fantastic!  We had the happy hour special - mussels and fries for $10 per pound.  We expected lots of fries and were pleasantly surprised to find a large portion of big mussels on the half shell in a tasty sauce.  Be warned - the garlic sauce is super garlicky.  Not for a first date; reserve it for a committed relationship.  Also, spice level 2 is pretty spicy.<br><br>Very clean restaurant with super friendly staff.  Cocktails are inventive and quite good.<br><br>Highly recommend this place.", "pics": null}}, {"review": {"des": "I'm not a big seafood guy. I'm a meat guy. I'll choose meat over seafood any day. But my goodness this place was SO GOOD. First off, I got the shrimp, oysters and snow crab legs. Just a warning the place can get pricey. The prices won't ever be available online I believe. Market prices at the actual restaurant. For sauces we got everything. I highly recommend getting the everything sauce. It was delicious. I love garlic. I love spicy. I love flavor and this sauce had it all. I should've brought a bowl of rice to mix the rice with the sauce too, it was THAT GOOD. I think the experience of eating at a place like this is really enjoyable. I feel that the shrimp I got and the snow crab legs I got are pretty standard. Nothing to write home about. But it's really the sauce that just blew me away. <br><br>Overall I had a great time here. I liked the fact I can rip my own seafood apart and make myself a mess with my own hands and tools to eat the shrimp and crack open the harder stuff like the crab. The sausage, corn, potatoes were a pleasant compliment. There wasn't much sausage to eat from and it wasn't too flavor to be honest but I liked the corn and potatoes. Coming from a NON-seafood guy I will definitely be coming back here. <br><br>Also got the deep fried oreos. It was enjoyable but I definitely want to try the beignets next time.<br><br>It has a good atmosphere where you don't feel smug at certain places. I mean there's a sink in the middle of the restaurant for you to wash your hands. It's a cool place.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/wfQuiyqVl1COaPvMbk9nwg/168s.jpg", "caption": "Shrimp snow crab legs oysters corn sausage and potatoes"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Y3OW8R_WR-OPrBIFDhLLDw/168s.jpg", "caption": "Deep fried Oreos"}]}}, {"review": {"des": "OMG where to start. First off, traffic up that way is RIDICULOUS. We had to drive around looking for a parking space but that didn't stop us from going. <br><br>We came at a good time a little pass 7 (we missed happy hour) but there was no wait. Surprisingly on a Friday night we were seated as soon as we walked in. When you first come in it has that country picnic feel (hence the name). Then there's a huge metal tub where you wash your hands (pretty neat). <br><br>So the food WOW the food was everything. We did the 2lbs crab legs, 1lb shrimp, corn & sausage. We also did all 3 seasonings (garlic, lemon & Cajun) excellent. The food came in a big plastic bag so our server cut the bag open & all you could see was steam coming from the food. I'm a crab leg person so I usually have butter with my legs but these crab legs you don't need butter just the seasoning. The shrimp were easy to pull nothing to hard. Also, we ordered the buttered noodles. Those were good but too garlicky. However beware the drinks are pricey about $12. My margarita I had was a little watered down but the food made up the difference lol. <br><br>I will come back soon.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/utAzwFHvVCx4SR4I4Ggk1Q/348s.jpg", "caption": "Garlic noodles"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ZtdgOKs8PjF7s6jZlOYWPg/168s.jpg", "caption": "2 lbs crab legs, 1 lb shrimp & corn"}]}}, {"review": {"des": "Delicious!!! Prices are pretty high, so it would be nice if there were more specials available during happy hours and such. But overall, definitely recommend! Will be returning.", "pics": null}}, {"review": {"des": "5/5 for sure! The host was incredibly accommodating to my friend and I who dined in, which led us on a great start. The food was sooo good. Got the weekly special mixed with crab legs, shrimp, corn, and potatoes tossed in all of the sauces and got it \"very hot\" (perfect amount of heat for those who love spicy food). Got the fun bibs and the hand washing station was just steps away from our table which made this messy experience very tolerable. <br>Can't wait to be back!", "pics": null}}, {"review": {"des": "I've seen this place pop up on my Yelp feed several times when I've been in Chicago, so I finally made it a point to give it a try. It was a bit messy, something I should have realized when I saw the sink sitting in the middle of the dining room, but the food was quite tasty.<br><br>Typical seafood boil. Shrimp was tasty but the sausage was my favorite (and the one thing we barely got any of). The spices were a tad heavy and we left feeling like we both needed to take heartburn pills from the garlic, but it was pretty good.", "pics": null}}, {"review": {"des": "With my fiancé being a huge crawfish [aka mudbug] fanatic, we made it a must to check out at Least one spot whiLe in Chicago.<br><br>Thanks to YeLp we narrowed it down to two Locations and decided on LowCountry because of the raging reviews.<br><br>Located in the downtown area of ChiTown, I onLy noticed street parking when we got here so if that's the case... parking can be tough so be prepared to waLk.<br><br>Our party of two roLLed up to a pretty open restaurant. There were maybe 3 or 4 other parties having dinner.<br>LC is quite spacious and the decor with the bench and tabLes were cute. My favorite aspect of the Layout was the Large sink tub to wash up- I Loved the simpLy, rustic feeL that it gave.<br><br>The menu isn't too extensive and is very straight forward:<br>Decide how much you want to order [items offered by the LB], seLect your protein(s), choose your sauce & heat LeveL, and Last but not Least, add on whatever additionaLs you wouLd Like.  <br><br>We ordered:<br>1LB Shrimp [with head]<br>2LBS Crawfish<br>Corn on the Cob<br>Red Potatoes<br>AndouiLLe Sausage<br>PickLed Veggies<br>Butter for Dipping X2<br>Powdered Sugar Beignets<br><br>I couLdn't heLp but noticed a few stares- not sure if Chicagoans have smaLLer appetites than we do but my man and I get doooooooown. Lmao.<br><br>Food was good. I Liked the presentation but the shrimp wasn't crisp, it was more on the mush side.<br>The veggies consisted primariLy of pickLed cucumbers [daikon, cauLifLower, & carrots were super skimp], meh.<br>The highLight of our meaL was the beignets. They were cooked perfectLy and are HUGE in size. [be aware that they are more on the denser side so if you're Looking for something Light, this may not be for you].<br><br>Good customer service added to the experience but I personaLLy think the crawfish & seafood boiL we have in CaLi is better.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/TEUqtwUDb7m1sCIvPUaF9w/348s.jpg", "caption": "Heat LeveL ONE."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Rs9TaBTpI2OwBknUhdKTbA/168s.jpg", "caption": "Beignets [cross section]"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/UrLmV9tImWUlRE4TI8qcFQ/168s.jpg", "caption": "Beignet"}]}}, {"review": {"des": "Went here last week with my boyfriend.... We're looking for a good seafood place we both enjoy buy this wasn't it. The food was OK buy nothing special.  We had the restaurant week special.....   Half shrimp and half crab legs I had the garlic sauce and my boyfriend had the spicy Cajun seasoning our seafood. He didn't  care for the level 3 sauce so he tried the last level even that sauce wasn't spicy  enough for him.  The hot doughnut covered in powder sugar were to big and doughy. I did enjoy the popcorn chicken and fried shrimp they were well seasoned I like the jalapeno peppers that came with them.  I also thought the jalapeno cornbread was interesting.", "pics": null}}, {"review": {"des": "I got the cornbread and crab/shrimp bag. I had so many expectations for this place and it did not disappoint. Pro tip: you can do karaoke in the lower level! There is also a tasty bourbon punch you can get with dinner that I would highly recommend - goes well with the shellfish.", "pics": null}}, {"review": {"des": "OMG! WHY DID I NOT COME HERE SOONER?? *kicks self* <br><br>I am a seafood lover. I love it, but I never get to eat it. Why? Because finding an amazing seafood restaurant in the Midwest that is affordable, give great portions, and is extra uber tasty is a bit tricky to do. *Enters Lowcountry*<br><br>I walked into Lowcountry at the end of a Cubs game *deep breath*. After wading myself through traffic in my car, and wading through the hundreds of slow-moving people in the street, I made it through the door. Lowcountry had just opened, so I managed to quickly walk to a couple of open spots at the bar. Pro tip: Sit at the bar when they open, because you will get half-priced drinks. You can also order food at the bar, and that is what we did.<br><br>Ok, so we order a pound of mussels, a pound of shrimp head-off, and a pound of crawfish. Three pounds of seafood for two people-don't judge. We decided to get the garlic sauce for the mussels, and a mix of sauces for the rest.  We add on some sausage and corn. It took a little while to cook, so we sipped on our cheap-but-delicious drinks as we wait. <br><br>The food arrives and when I see the mussels I almost start tearing up. Guys, these are the best mussels I've ever had. They were HUGE, all of the shells were opened, and all had a great portion of meat in them. I didn't know these existed. I don't think I'll ever be able to shell out mussels at any other restaurant, until I find some on par with these. The crawfish were tasty and the shrimp were big and delicious too. We got 2nd level spice I think, and it was the perfect amount of spice. I loved the andouille sausage, and the corn and cornbread was good too. We reeked of garlic and seafood when we left, but it was well worth it. <br><br>2nd pro tip: Save your leftovers and sauce. Eat said leftovers at home and use said sauce for cooking something else. Delicious!<br><br>I need to get back here, like yesterday. I can't wait until the weather is warmer. Seafood, sun, and strong drinks. Count me in!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/HXKwWrv8ApTBvMCwStosLQ/348s.jpg", "caption": "More drinks"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/pqOdbX45SKtuVigkOmg9gg/168s.jpg", "caption": "Mussels, Shrimp (Head Off, and Crawfish"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/zyteRBz4gpp44rg2pBEDsw/168s.jpg", "caption": "Honey Butter Jalapeno Cornbread"}]}}, {"review": {"des": "This is absolutely one of my favourite places in Chicago & I will bring all my guests here. I only discovered it 6 months ago (they run an amazing deal during Restaurant Week in February) and have been 3 times! It's a ton of fun to wear a bib, be served a meal in a bag, and dig in with your hands. The atmosphere is super casual and fun with large, shared picnic tables. It's a great place to take a group and to get your Instagram photo of a seafood feast in a bag. The jalapeño cornbread and beignets are MUST HAVES. I've never had to wait at all and the servers hustle like crazy to deliver your food, clear courses, and refill drinks. Fair warning: wear the gloves! But you will still smell & taste garlic for 36 hours after leaving.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/TEAs_Wds48L401zmRQ9meQ/348s.jpg", "caption": "Lemon pepper mussels, Cajun shrimp & potatoes, and jalapeño cornbread"}]}}, {"review": {"des": "OH. EM. GEE. this place is absolute FIRE! The ordering process is smart and efficient - pick your protein, pick your fixin's, pick your sauce and spicy level! We ate at the bar, and enjoyed some cocktails before our platter of delight came out in all its glory! We did a pound of headless shrimp and a pound of clams and a side of garlic noodles. Everything was amazing and absolutely on point. Our bartender even gave us a shot on the house as we left! My one warning - you will end up smelling like garlic so beware! Small price to pay for an amazing meal!!!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/mG_LuoXV9EjnL5Xulsnziw/348s.jpg", "caption": "sinks for washing"}]}}, {"review": {"des": "This is a really good spot if you're just looking to eat more seafood than your body can handle. You go in, order from a variety of seafood (shrimp, crab, mussels, etc), pick add ons (potatos or corn), choose a sauce, and sides. Their sauces are really good, but BEWARE - their level 4 really is as \"overwhelming\" as any of the servers describe it. <br><br>I was torn between a 3 and 4 star review only because although all their regular food is so so good - I hated their crawfish boil. It was very over cooked and they base their flavor on sauces (on top of the crawfish in its shell).. not a fan. <br><br>Overall, solid place though.", "pics": null}}, {"review": {"des": "Not personally a seafood lover but during a Fathers Day outing, we ended here and absolutely enjoyed everything.<br><br>Deone (I really hope I spelled the name correctly) was super friendly and found us a table on such a busy day, especially since we were a party of 8. Service overall was Letty consistent despite the hectic crowd.<br><br>The food was tasty and generously portioned. We had king crab, shrimp, potatoes with everything selected for the seasoning. They forgot our corn but they took it off the bill so no biggy. The jalapeño corn bread was a hit at our table as well.<br><br>They beignets were pretty good too, so no need to travel to Cafe Du Monde for them, although you probably should, anyway. <br><br>Overall, I would recommend this place and go back myself. Place was clean, didn't stink like seafood (reason I'm not a seafood lover), and the service was good. Give it a try. <br><br>Sorry, no pics, we were starving and skipped the pictures!", "pics": null}}, {"review": {"des": "Mmmmm. Yum! I love me any restaurant where you can get seafood in a bag. We opted to sit at the bar so we could get the happy hour. No food discount, but you get an alcohol discount with a food purchase. I opted for the king crab legs in the everything sauce and Cajun fries. The fries were crispy, fresh, and delicious. The crab legs were pretty darn perfect. They put a lot of garlic in their sauce - and I'm pretty sure I smelled like garlic for 3 days after - but it was yum to me. Pro tip: Ask for gloves. They don't auto give them to you, but you can ask for them. I also really liked that they had a hand washing basin right in the middle of the restaurant. It's a small place, but getting a table / finding a seat at the bar wasn't a problem. The bartender was really busy, but we were taken care of. I will most definitely be back.", "pics": null}}, {"review": {"des": "First experience here was great and I'll definitely visit again.  Recommend getting a biscuit to soak up the leftover butter sauce!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/tt0V5yDfW-UvdX5rbp8CIg/348s.jpg", "caption": "Garlic, Lemon Pepper and Cajun Spice Shrimp (Head Off) Delicious!"}]}}, {"review": {"des": "We've eaten crustaceans at several restaurants across the country, and this place is the bomb!!!  I literally dream about their food.  Whatever you order, choose the everything sauce.  Best time to come is during the weekdays (Tues - Thurs); otherwise, be prepared to wait for 1+ hours.  <br><br>Oh btw, as an experienced Dungeness and King Crab eater, I once thought it a rookie move to wear a plastic bib while eating.  Well, if you want to dive into the food and truly enjoy eating with your hands, I highly suggest using the bib and not wearing anything fancy.<br><br>My wife and I are slowly chasing the #Worlds50BestRestaurants ...and I swear this place should be on that list (haha).", "pics": null}}, {"review": {"des": "Overall: Crab-crackin good time! A little pricey, but well worth the trip if you want some boiled goodness!<br><br>The good: Food was fantastic, very flavorful and hearty. The \"everything\" sauce was a good mix of all the flavors, and the cornbread/fries/calamari were crisp and tasted great. Potatoes and corn were also perfect. Fun and inviting atmosphere, for families or bar-goers alike. Lots of options for boiling, sides, and drinks. Plenty of napkins, bibs, and a giant \"sink\" for when you get all messy.<br><br>The not-so-good: The menu is confusing at first until the waiter explained it to us. The prices are a little high (but, it is seafood). No reservations. Portion of fries was disappointingly small.<br><br>Atmosphere: 9/10<br>Service: 9/10<br>Food: 9/10", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/kfN0FVVsNZ3lV-TbKzCb9g/348s.jpg", "caption": "Before the carnage"}]}}, {"review": {"des": "So there are a few boiler places in Chicago so it's cool to have one close to check out. My bf and I went to try them out on a busy weekend night. While waiting for a table we went downstairs to the bar/karaoke floor and got a drink. There was a drunk af family down there so we were entertained til our table was ready. <br><br>So maybe it was the wait for the food or the two huge guys next to us hocking lougees (lugees?), but it wasn't that great a time. We got shrimp with \"everything\" flavoring, calamari, and cornbread. Cornbread was fine, calamari was mediocre, and i honestly can't even remember what the shrimp tastes like, so that shows how memorable that was. <br><br>So ya, we won't be back.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/iFVkgDAQ8-iORagivPbzmg/348s.jpg", "caption": "This was us excited before our dreams were dashed"}]}}, {"review": {"des": "Prepare to get messy, because there's no way you can eat like a lady here. <br>The way the place works is that you choose from a menu by selecting options of dishes, spice levels, seasoning, sides, etc. Then it all comes on a big platter with a bucket to toss the scraps in. There's a reason there's thick brown paper on each table - sauce gets everywhere. <br>Very tasty seasoning they have as well. We just got garlic on the shrimp, and then \"everything\" on the king and snow crab, and it all comes in individualized bags. We also got a side of the potato salad. All of it was delicious. <br>Great for groups or for a \"messy\" date night.", "pics": null}}, {"review": {"des": "All I can say is... Wow!  Awesome food, cool vibe and great service.  Andrew mixes up some great cocktails!  Great spot for the group after a Cubs game...or before! Almost forgot, don't leave without indulging in the deep fried Oreo.", "pics": null}}, {"review": {"des": "Almost to the finish line. <br><br>Taste and service get 5/5! <br>Execution and actual cooking of the crawfish: 2.5<br><br>The crawfish boil: Got the everything and level 4 (highest) spiciness. Taste was good and they don't skimp on seasoning and garlic. As a spicy lover, the heat was appropriate and we sweated eating the mud bugs. But I loved it. Cooking execution can be improved, however, as a good amount was overcooked where the meat was breaking off into pieces instead of staying whole when you pull out the tail. Size was select with a good amount of Jumbo for 12.99/lb. I like that the bags come out on a serving tray and they cut open the bags for you. Corn was meh (6 for $2) - more buttery, less of the sweet. The Andouille sausage is BOMB. You get 3 pieces for $2, worth it. <br><br>People seem to like what they're eating because so many people ordered extra orders to go. <br><br>Service: Good polite and kind. Way better than Angry Crab service. <br><br>Ambiance: casual, liked the picnic/backyard seating style<br><br>BIG WIN FOR MARCH: Whole month of March - all the beer on tap are from Ballast brewery based out of San Diego!! <br><br>Bottom line: Just as top notch as west coast Boiling Crab and def better than Angry Crab and Saigon Bistro. (Hope they don't overcook next time)", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/V_gT-4R9eDU30_e6D4EYww/348s.jpg", "caption": "Crawfish heaven"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/-S1ECvj_djQ6ctX3Qgvetw/168s.jpg", "caption": "8 lbs of fiery crawfish glory + Cajun fries"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/I7YugWsCXPI5U715vT7uTw/168s.jpg", "caption": "Outside look"}]}}, {"review": {"des": "First time visit to Chicago, were on our way to a Cubs game, stopped here for dinner.   Sat at the bar.   Andrew was an awesome bartender.   Recommended the Anniversary special.   Shrimp, crab legs,  king crab legs,  corn, potatoes for $39.<br>Certainly enough for 2.  Had a little spice but not too much.   Andrew was engaging,  helpful and fun.   Even tried to score us some tickets from another patron that had said he wasn't going to the game.  Didn't work out but he tried.  Missed the game but enjoyed our time at this restaurant. Definitely a must do...", "pics": null}}, {"review": {"des": "This place is perfect for a group! The seating included long picnic tables, and the family style atmosphere was spot on with the music, TVs, and and cute kids. Our waiter was so nice in helping us on how to order off the menu, and explaining the specific prices for the day. They were not serving crawfish at the time, and he also recommended different flavors of sauces.<br><br>We ordered one pound of shrimp, one pound of scallops, wings, and cajun fries, to share with four people. It was the perfect amount of food and a very reasonable price! I would recommend the cajun seasoning and not the \"everything\" (all sauces mixed) since it was more flavorful. The wings and scallops were everyone's favorite, and it's also located in a such a cute neighborhood.", "pics": null}}, {"review": {"des": "Their seafood is very delicious- I have tried shrimp, mussels and clams with corn.<br><br>Their beignets are amazing. They may give you a heart attack but they are tasty. ;)<br><br>In terms of sides the garlic noodle is good and the pickled vegetables are just ok.<br><br>Their food tends to be on the salty side though.", "pics": null}}, {"review": {"des": "Ordered way too much food, it was rather tasty, a lil upset the waiter didn't say something along the lines of \"you two girls going to eat that much, it's a lot\" he could have saved me some money. I recommend 2 persons ordering only 1 pound of food, and I'm fat (lol).  My girlfriend and I made the mistake of ordering 2lbs of king crab legs, along with 2lbs of shrimp, jalapeño cornbread, 1lb of mussels with corn, fries & potatoes, and fried oreos. We could have fed an entire army with that much food. I relayed my thoughts to the waiter and he goes, oh is it your first time here. Uhh yeah, I told you that when we first arrived. So they get four stars bcuz I feel like I got haggled, LOL!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Y8X0CKQ1yWo2vlniuaDDQw/348s.jpg", "caption": "2lbs of errrthang!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/-jcATu-dUxCOKEhWS5NFow/168s.jpg", "caption": "Hand Cut Cajun Fries & Jalapeño Honey Butter Jalapeno Cornbread"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/0LDp_cFxX12-D0_EELi09A/168s.jpg", "caption": "Deep Fried Oreos"}]}}, {"review": {"des": "Eat dinner out of a plastic bag?  Sure, why not?<br><br>Lowcountry is hot!  The food is spicy (if you like it that way), and the restaurant is popular.  Tables fill up fast, so be prepared to wait.<br><br>After a friend would not stop raving about this place, a group of 4 of us came on a Friday night.  So how does Lowcountry work?<br><br>1.  Pick your fish!  I chose the head-off shrimp because I like shrimp and hate to turn a meal into work.  No cracking shells for me.  It's good to know that you have to order by the pound.<br><br>2.  Pick your sauce!  I picked the \"Everythang,\" a combination of cajun, garlic, and lemon pepper seasoning.  There's no reason you should order anything other than \"Everythang.\"<br><br>3.  Choose your heat level.  It's graded on a scale of 1-4.  I went with 2/Hot.  My friend went with 3/Very Hot.  She had some tummy troubles the next day.  2 was perfect for me; I think 3 would've made my food less enjoyable.<br><br>4.  Add other things like potatoes, corn, or andouille sausage.  I skipped this.<br><br>There are sides too.  We shared the jalapeno honey butter corn bread, hush puppies, and deep fried oreos for dessert.  Everything tasted so good, I keep telling my husband I need to take him there.  Lowcountry is the kind of place you will drop in every conversation with your friends about seafood, the south, or even something completely unrelated like the weather - it's that good.<br><br>They also have some crazy shot promotions in their bar area.  You pay a few bucks, roll a dice, and then SURPRISE!  You take a shot of whatever awful concoction they tell you to.  I didn't partake but couldn't help but watch another girl do this - they also ring a cow bell really loud so you can't miss it.", "pics": null}}, {"review": {"des": "First word of warning: Don't come here in your favorite clothes. Unless you don't mind crawfish guts on that blouse (despite the bib). Second: ALWAYS do the head-on shrimp. I don't care how squeamish you get with their beady eyes, this is the way to go for succulent shellfish. Final? Anticipate garlic breath for the next 24 hours- not necessarily a bad thing. The corn is scrumptious and the andouille sausage has that satisfying snap. The jalapeño corn bread is one of the best I've had and I love that it has corn kernels in it. All the food we got stuffed a party of five. I'm of the personal opinion that a lb of shrimp and a side is perfect for two people. Pro tip: ask for the sauces on the side too for some extra dunking fun. This might not be my favorite seafood boil spot in the city, but I would not hesitate to return.", "pics": null}}, {"review": {"des": "I'm not sure who's feet I need to kiss for allowing the seafood boil craze to invade and consume Chicago, but dagnabbit if you point them out to me, I'll do it!<br><br>Low Country has definitely been my favorite seafood joint out of all of the ones (4) I've been to in Chicago, thus far! For appetizers, my lovely friends and I tried the fried calamari with jalapeños. Delish! While waiting for our dinner, to we decided to do the cool dice roll game where one person at the table rolls and the others have to take whatever shot corresponds with whatever number was rolled. Luckily we got a mixed vodka shot and not Malort!<br><br>For dinner, our table consisted of bags of shrimp and crab legs, accompanied by the jalapeño cornbread. I got potatoes added to my bag and didn't expect that many (from past experiences) but there were a few good sized potatoes cut up in the bag. This time, I went with the mildest sauce - the Lebron sauce aka weak sauce! Lmbo and I didn't have to worry about my nose running from too much spice but they did bring a big cup of the medium sauce for me to try.... and yeah.... boogers coming from my nose and teary eyes. No thanks! <br><br>Full bar is available with wine options and there is a big sink in the middle for you to get clean with. Reservations are suggested unless you plan on going during an off time (before 7 on a weekday). Great, attentive service as well.<br><br>Thank you seafood lords!!!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/1R5rTrFu2ZCxCmmlNsC-eg/348s.jpg", "caption": "Mixed vodka shots from the game"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/euUe6D_MmI5yWdtjXeMf3A/168s.jpg", "caption": "Hurricane"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/RSYlBRZ8ens7d7yiP_6SwA/168s.jpg", "caption": "Shrimp boil with potatoes"}]}}, {"review": {"des": "Yee-haw! Bow down to Lowcountry for having the best Cajun seafood offerings this side of Chicago has seen! I am a definite fan!<br><br>I first came here over a year ago for a Yelp event where we got to sample a lot of their food and drinks as part of their soft opening. More recently, I got to enjoy my last big meal of 2016 with a dear friend before the New Year.<br><br>Similar to Boiling Crab, this restaurant allows you to order various seafood in bags, and you use your hands to rip it apart and soak up all the meat. Each seafood is priced according to market rates and availability depending on the season. With each other, you can customize the type of sauce you want, the spice level, as well as any additions including sausages, potatoes, or corn.<br><br>Our server was super friendly and helpful in teaching us how to order off the menu and getting our drink orders in. Their Limeade ($12) was a popular choice back opening, so we got just that and it wa a great, minty refresher on a Winter's night.<br><br>I ordered a pound of shrimp with the \"everything\" sauce at level 2 spicy. Be warned- the spiciness is real and can make your stomach upset, but it is so worth it. Eating with your fingers and getting a little messy here is all part of the fun!<br><br>Don't forget the appetizers too, which I enjoyed more than the actual seafood boil I ordered! I got the fried shrimp and calamari, and tried my friend's jalapeño corn bread. The seafood appetizers were both AMAZING and some of the best I've had in the Midwest. The corn bread was absolutely delicious and a great addition to any order. Highly recommended!<br><br>Thanks Lowcountry for staying amazing even after your opening. I am loving the food and ambience and wish you all into this new year.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/CfkLe5gmWWfutvXCTCNLFA/348s.jpg", "caption": "Pounds of shrimp"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/InZtCuyaugVop7b_MMlQDg/168s.jpg", "caption": "Pricy but delicious"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/lF0V99PyI9nvox-EwHWbdw/168s.jpg", "caption": "AMAZING appetizers"}]}}, {"review": {"des": "WOW OH WOW this place is SO GOOD! I have been missing my favorite restaurant, The Boiling Crab, for soooo long. If you're from California, you know what I'm talking about! This place is comparable and maybe even as good as Boiling Crab!!! <br><br>But be prepared to get messy. You will eat with your hands and make a mess all over your table and it will be okay! <br><br>I came here with three friends and we shared 2 lb of headless shrimp, 1 lb of snow crab legs and 1 lb of clams. We also got 2 orders of corn (comes with 6 pieces per order). All the seafood comes in plastic bags, so don't be surprised. We ordered all of our seafood with the Everythang sauce. We got the #1 spice level with a side of the #3 spice level for the more adventurous people in our group. All of the food was SO GOOD. I highly recommend the Everythang sauce- it's the best combination of garlic and cajun spices. The #1 spice level is not spicy at all. The #3 is more like a medium spice, which is my favorite! I also recommend getting the headless shrimps!! It's $2 more than the regular shrimps but that is so worth it for the amount of time you save from pulling the skin of the shrimp. PLUS, the sauce soaks in so much better when it's deveined and headless!! <br><br>We finished off our meal with an order of beignets, which were super soft on the inside and very crispy on the outside with the perfect amount of powder sugar! <br><br>I can't wait to come back here again!", "pics": null}}, {"review": {"des": "Wow, I have found myself in seafood heaven. This is equivalent to Boiling Crab in California and I am SO happy to find a place to satisfy my mighty cravings of shrimp boil drenched in garlic, lemon pepper, and cajun juices! Fair warning that if you get garlic, your fingers and mouth will smell like garlic for quite some time. But if you love garlic as much as I do, then there's not really much to complain about.<br><br>I love the experience of eating with my hands and just living my best life sucking the shrimps clean and then dipping it back into the sauce to eat. I do wish that they gave out salt and pepper with limes because I like to dip my shrimp in that as well.The market price for the shrimp over the summer was $14.99 I believe. This place is quite spacious as there is a lower level - great for private party reservations. The staff are incredibly helpful and friendly. The menu is also hilarious - if you want a level 1 spice, you're \"weak like Lebron\" !! #dead Also, there's thai iced tea on the menu which is really random to me - makes me wonder if the owners are Asian? I wanted to try it but also didn't want to risk it lol<br><br>I've been here twice - one time I shared a pound with a friend and that was very filling. We also got level 3 spice - I could handle it but it made it a bit difficult to enjoy the food because my lips were getting a lot of the spice. When I went with my boyfriend.. he eats a lot of shrimp lol I wish we could've gotten 1.5 lbs of shrimp but they don't do half orders here, which is a little disappointing! I got a pound for myself with some rice on the side and a level 2 spice (much better), but I was waaaaayyyy too full afterwards! We also got sausage and potatoes - potatoes are the shit, but we probably could've gone without the sausages. We also had an order of cajun fries - quite small for the price, but still good nonetheless. I just wish they were a little crunchier because they're quite soggy by the time they get out to us. I've also tried their jalapeno cornbread which is pretty good too. <br><br>I would definitely come here again, but probably like once a quarter. It's probably not good for me to eat like this so often lol but I really do love this place. Every time I take my first bite, I get so happy and I leave SOOOOO satisfied. I just wish it was a little more affordable but seafood makes it what it is.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/0KKB36k-HYompY5hIMY4Mg/348s.jpg", "caption": "14.99/lb. each bag is 1 lb of shrimps"}]}}, {"review": {"des": "I've been to 3 of these now. Low country definitely was a disappointment, mainly because my jaw dropped when I saw the amount of food given to us. They had the least amount of food provided compared to others. The only thing that seemed cool about them was that they had happy hour drink specials when we went on a Sunday around 4:30. Staff was great-very friendly. But I wouldn't go here again. Not worth it for how pricey it is.", "pics": null}}, {"review": {"des": "This was our first dinner during last week's trip to Chicago. Underwhelming is the overall verdict the two of us give this place. The schtick here is the boil-in-a-bag technique. It is better in theory than in practice. We had:<br><br>Shrimp with garlic sauce -- well, it was that, for sure. A bag of about 20 medium shrimp drowned in a buttery garlic sauce. In my opinion it was way too much sauce, so much that it actually made me a bit nauseous later. <br><br>Soft shell crab -- my partner loves soft shell crab. He rated this 3/10, so clearly he was not impressed.<br><br>Crab hush puppies -- they were okay, not bad, nothing special.<br><br>Coleslaw -- the best part of the meal, sadly. <br><br>I do not understand the appeal of this place. It's not real Creole/Cajun food. It's not that good. It's not a good value. It reminded of the kind of place drunk frat boys go to guzzle gallons of beer, yuk like Neanderthals, and shovel greasy food into their gullets. I'd never return.", "pics": null}}, {"review": {"des": "Creamy buttery garlicky crab legs ! <br>Lots of flavor . <br>I recommend the beignets . <br>Fresh to order ; warm & fluffy . It's a must !", "pics": null}}, {"review": {"des": "Holy crap this place is amazing! Very fun spot to get some bomb crab/seafood boil. I've lived in Baltimore 20+ years and love my local seafood but I can safely say this is probably the best seafood experience I've had outside of home. The shrimp and clam was amazing, their spices and mix in the boil bag is sooo good. Wish I could bring the garlic sauce home. 1 seafood order/person is the perfect portion with some sides. We'll return for sure.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/wnoJ11k30ghlnA9UQKRaXQ/348s.jpg", "caption": "Shrimp and clam boil with fries and cornbread"}]}}, {"review": {"des": "Craving for that cajun seafood boil, we opted to go to lowcountry over our usual spot - angry crab. And I must say I was not disappointed! This place has been on my list 'to try' for a while now because of all positive reviews from the fellow yelper. We definitely chose a good day to go as we found paid parking one block away from the restaurant, and there was no wait at 9pm on a Friday night. Must be the windy city freezing temps :/ <br><br>For the food - Jonathan served us and explained all options we have. We usually like spicy food but he did mention that a level 3 can be spicier than usual - so we chose to go for a level 2. For the two of us, we got 2 lbs of head on shrimp with everything, and 1lb of snow crab with lemon garlic sauce. We also snuck in some potatoes, sausage and corn in there. Along with cajun fries and jalapeno corn bread.<br><br>The seafood itself was absolutely delicious! The shrimps were bigger than I'm used to, and I thoroughly enjoyed them with the sauce. Level 2 spice was perfect for these bad boys. The snow crab was also really good - although I haven't mastered eating them properly, thankfully my companion was there to help me out. The jalapeno bread was really good! I'm definitely getting that on every visit. The only thing I could pass on were the cajun fries. Although the fries were crispy and had a good amount of seasoning, for $6, I expected something extraordinary. For this reason only, I was considering giving this restaurant a rating of 4 -- but everything else was so good, I had to stick to my 5!<br><br>We were too full to try the beignets, but maybe next time! I highly recommend this place, and maybe even like it a little better than Angry Crab because of the service and the atmosphere, as well as the food. But can't beat AC's BYOB policy!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/mPGBH7oznXVCsqFlR37LVQ/348s.jpg", "caption": "Cajun fries"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Taiza2TiyXLru94vKWTS8A/168s.jpg", "caption": "Jalapeños cornbread"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/x5h-GtWfQ2OyGzxPNxKlwQ/168s.jpg", "caption": "2 lbs of shrimp and 1 lb of snow crab"}]}}, {"review": {"des": "I've been wanting to come here for close to a year but somehow it always got moved to the bottom of the list.<br><br>My dad is in town this week so we decided to finally try. I am now wondering why I waited so long!<br><br>Stopped in on a Sunday evening around 5, not too busy. There are some solo tables and communal tables. Happy hour for people sitting at the bar.<br><br>My dad, boyfriend and I ordered 1lb snow crab, 1lb shrimp head off, side of sausage, corn and then added the Cajun fries and cornbread. Also, we did everything and heat #2. <br><br>First and foremost, this was more than enough for three people. Everything was excellent and had so much flavor. We saw a lot of people ordering per person and it is so much better to share as you get to taste different things and you cannot order by the 1/2 pound. I am definitely returning and look forward to adding more seafood into the mix but maybe just sticking to potatoes and sausage as the other sides were just a lot to eat. Also, will make room for the beignets.<br><br>A+++", "pics": null}}, {"review": {"des": "This place is hands down my favorite Cajun seafood boil place near me. The flavor is outstanding and the sauces are wonderful!!!", "pics": null}}, {"review": {"des": "Good place for seafood cajun style! I like this place because they have draft beers and cocktails! Ask the bartender for happy hour specials. Street parking only.", "pics": null}}, {"review": {"des": "Found this place on Yelp and the reviews did not disappoint. Staff was super friendly.  Food was awesome.  Definitely coming back.", "pics": null}}, {"review": {"des": "I grew up in New Orleans and lived in Texas for 9 years so I know my cajun seafood, and I LOVE this place. Admittedly, it's pricier than similar offerings in Texas and Louisiana but I give them a pass on that due to location.<br><br>The snow crab legs are fat and juicy (which is what I recommend getting for first timers), and the seasoning is absolutely on point. ALWAYS get the \"everythang\" seasoning. You can choose a spiciness level from 1 to 4 (there's actually a hidden 5 level which they don't advertise on the menu made with ghost peppers which I have tried before and it burns your mouth, literally).<br><br>I've tried the dungeness crab which is good but the snow crabs are still where the money is at in my opinion. If you get shrimp, get it with head-on. It's a lot more tender and less overcooked. Always add corn. The potatoes are just OK and the sausage is also just OK.<br><br>Don't be afraid to get your hands (and face) dirty. That's the only way to eat this type of cuisine.", "pics": null}}, {"review": {"des": "Finally the weather was cold enough for some hot & spicy, down & dirty seafood festival without having to think \"is this restaurant air-conditioned?\"  <br><br>This afternoon I took a walk in the Wrigleyville/Lakeview neighborhoods and wanted to stay in the area for dinner.  I then called hubby over to join me at \"Lowcountry.\" <br><br>If you're here for the very first time (like we were), please, please let the server go over the details on the menu.  Jonathan, our server for the night, was extremely thorough on explaining the available seafood options, market prices, add-ons, levels of spiciness (YOU NEED TO KNOW THIS), and other miscellaneous information that you may want to find out before placing your orders.  <br><br>I must say spicy level 2 is enough for regular dudes and dudettes out there, unless your lip is thick like an encyclopedia and your stomach is made of iron.  We went with 1lb. shrimps (head-off) with sausages and everything seasoning and 1lb. snow crab legs with corn, potatoes, and lemon pepper seasoning.  By the way, \"everything\" seasoning is the combination of garlic, lemon pepper, and Cajun.  Jonathan commented that this was the most popular.  <br><br>Wow, we had a blast!  I really thought I was hungry.  Well, whatever we ordered was definitely sufficient for two (2) people.  I was very glad that leftover could be bagged and brought home.  Now my work lunch for the next day is all set.  <br><br>I thought that price was fair since seafood is expected to cost more in the Midwest: $45 (post-tax, prior to tipping).  <br><br>For those who aren't fond of sports bars (like myself), \"Lowcountry\" is an alternative I highly recommend near the Wrigley Field.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/nT9wIUiXMwkNGrey3Ba19w/168s.jpg", "caption": "Cool tool"}]}}, {"review": {"des": "This place is amazing! Food was unreal and the service was great too. Will definitely be back soon!", "pics": null}}, {"review": {"des": "This place is great! I've visited other crab boil restaurants and lowcountry holds its own. It's spacious and not crapped so it allows you enough room to dive in. They serve alcoholic beverages. The staff is nice and the decor has the right ambiance. The flavor/spices were just average compared to \"AngryCrab\" but good. I'd definitely go back and I'd recommend anyone that wants to experience the seafood boil experience. <br>Oh! The fried Oreo's were good.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Ju1h0quj8Zynh2F9lo9K2g/348s.jpg", "caption": "2 lbs of King crab and Cajun fries... delish"}]}}, {"review": {"des": "Seriously amazing! This place far exceeded my expectations & that's not easy to do! The service was fantastic, the shrimp perfect & the Rose Sangria hit the spot:) highly reco! Cute washtub in the middle to wash up after the fab, messy, delicious crab legs!", "pics": null}}, {"review": {"des": "Finally a good restaurant in the neighborhood! The food is fresh and delicious, also the waitresses and staff are friendly and very attentive. Classic creole seafood, desserts and drinks! Highly Recommend!", "pics": null}}, {"review": {"des": "Of the 4 crab boil places we have been to in 14 days, Low Country has my favorite interior and I liked the layout of the restaurant. <br><br>They offer the most sides and the cocktails were very good. <br><br>I think of the four restaurants, Low Country was the skimpiest on their sauce, but the crab was good. <br><br>We also enjoyed the pickled vegetables. <br><br>I thought the cornbread lacked flavor & was dry and a bit hard.", "pics": null}}, {"review": {"des": "My food was amazing (2 lbs of<br>Crab and corn). I got<br>The \"everythang\" seasoning with a level<br>Two which was just right as far as spice goes. The fried pickles were good but I'm not into that kind of thing. Also, the jalapeño cornbread was moist and well prepared. One order is certainly enough for the table. I tasted the shrimp and they were cooked perfectly. Two of my friends ordered margaritas and they said they were delicious. The best past is that the wait wasn't long at all like you notice at some of these other crab places.<br><br>I couldn't give it 5 stars because the pans your food comes in are too large considering the table size. Either they should have bigger tables or smaller pans. <br><br>Overall, food was great and I WILL be back.", "pics": null}}, {"review": {"des": "Great seafood boil. Best ever! Friendly service and good vibes! Definitely will come back the next time we're in town!", "pics": null}}, {"review": {"des": "So thankful a friend introduced me to this place. If you are looking for a different take on seafood where you aren't afraid to get your hands dirty this is the place. Their sauces are all very good, I personally do their garlic sauce alone but thats because I'm a garlic freak. Be careful with their spice level on the sauces I'd recommend 2 if you like spicy food because levels 3 & 4 are a lot to deal with and unless you are a pepper head you probably won't enjoy levels 3 & 4. the Andouille sausage is such a good add on to the boil. Gajun fries, garlic beignets, soft-shell crab and the jalapeño corn bread are all a must try.", "pics": null}}, {"review": {"des": "Cannot put into words how much I loved my first seafood boil experience!<br><br>We had the shrimp heads off in the cajun spice and lemon pepper sauce made hot to order with corn on the cob and garlic beignets.<br><br>The shrimp was fresh and super flavorful. The heat was intense but we loved it.  We used the garlic beignets to soak up the sauce and the corn on the cob was steamed perfectly.  I loved that the cob was in with the shrimp to lock in the same flavors.<br><br>We topped everything off with traditional beignets for dessert and cool our mouths down.<br><br>I can't emphasize enough how amazing this place is and the craze of seafood boils is catching on.  These guys definitely know how it's done!  With paper towels table side and menus ready to write on you can't go wrong with this northside spot.  Wash your hands in the center of the restaurant and keep on eating!  With TVs to watch the CUBS and drinks at the bar you have it all when you come here.<br><br>I will be back soon enough!!", "pics": null}}, {"review": {"des": "We might have to come back to Chicago just to return to Lowcountry. We got there 10 minutes before they stopped taking food orders. Our waiter was awesome and made us feel completely relaxed even at the end of their night. The seafood boil was unbelievable. We added sausage and lobster tail to the daily shrimp and crab leg special. The sauces were delicious and we savored every bite. Can't wait to come back!", "pics": null}}, {"review": {"des": "Yes Yes Yes!!!! The food was great, the sell everything by the pound, season favor, and heat level. The have a great drink menu; I ordered the house wine, the crab hush puppy wasssss awesome!!!! The staff was great, quick, and friendly. I totally recommend this spot for anybody visiting Chicago! Cute venue also... not to big and the open later in the day.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ZkhmeI8I_Getas47uhYnvw/168s.jpg", "caption": "Outside the venue"}]}}, {"review": {"des": "Phenomenal food, service and atmosphere. Can't go wrong!", "pics": null}}, {"review": {"des": "Really fun restaurant!! We got crab legs and shrimp with potatoes. We got the least spicy sauce, which I loved but still thought was a little spicy, so if you're not that into spicy food I would stick with the lowest spice! The food was delicious and it was a really fun atmosphere. We went at happy hour which got us 1/2 price drinks if we sat at the bar- would definitely recommend doing this! Happy hour went until maybe 7pm which was plenty of time for us. Would recommend to all!", "pics": null}}, {"review": {"des": "The refreshing craft cocktails and the mouth-watering delicious seafood, combined with great service, make this a phenomenal restaurant and well worth a visit. <br><br>We ordered a pound of shrimp and a pound of crawfish, with garlic sauce and spice level 2. Recommend wearing the bib, as the eating can get messy! Both were cooked perfectly with tender meat on the inside. The biscuit with raspberry and jalapeño jam was a great addition. <br><br>Half off craft cocktails from 5-7pm, definitely a great deal for $6 cocktails. At the end the bartender also gave us two shots on the house!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Y7L2AfYUQikpY8mrLjwHyA/348s.jpg", "caption": "Crawfish, shrimp, and biscuit with raspberry jalapeño jam"}]}}, {"review": {"des": "What the what?! Okay, I have no idea why in the world I have never been here before but it was pretty damn amazing. We went on a evening during the weekend and were super concerned there would be a long wait. I think the Cubs game & pride fest saved us; we were seated right away! <br>Greeted immediately by our very knowledgeable server ( who recited the menu like it was her job! ) & we were on our way to awesome! You have to order by the pound, except for the lobster. The lobster is 2 lbs at market price. I ordered the snow crab legs with the garlic sauce - spice level 2. It wasn't too spicy and the flavor was crazy good. The garlic beignets are a MUST. Seriously, order them. <br>Great experience, great place! CANNOT wait to go back for more.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/_dgANDWBJcqmK1-OqBQzzg/348s.jpg", "caption": "A pound of snow crab legs with their garlic sauce"}]}}, {"review": {"des": "Great service, phenomenal food. Also kind, humble and hardworking owners who work as attentive servers seemingly every day they are open.<br><br>ALL seafood is super tasty, and our usual \"go-to's\" are the oysters, shrimp and snow crab legs. The spices/sauce here is second to none. I've tried the other seafood boil restaurants in the city known for long waits--and low country is definitely superior in taste. We love the \"everything\" spice option at level 3 which is pretty spicy. We always get the corn and sausage--OMGAWD, the sausage in that sauce is a dream come true. <br><br>My favorite sides follow:<br><br>Cornbread - I often joke that they are made with crack. The texture, combination of subtle sweet and spicy and buttery goodness will make anyone an addict.<br><br>Beignets--also know as, \"powdered pillows of love\". I do not have a sweet tooth and normally skip pastries, but these pillowy, savory and sweet rolls just melt in the mouth so perfectly as a heavenly soul food should.  <br><br>Fried (anything) - for us, usually calamari. The batter and accompanying dipping sauce set these appetizers apart. Just the right amount of salty without an overwhelming amount of oil. <br><br>All in all, we always have a fantastic experience every time, and we have eaten here several times. My husband was impressed by their old fashioned and selection of beer on draft, and I have been happy with every cocktail I've tried. It's nice to be able to pair our messy meal with a cold beer or polished cocktail. I love this place so much that I ask my hubs to take me here for my birthday and any holidays that I can use as an excuse to go. Low country is among my top 3 favorite restaurants in Chicago.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/PXZDOlbW6b0F0eARTNXZmw/348s.jpg", "caption": "Snow crab, mussels and shrimp with corn and sausage - level 3 \"everything\" spice. SO GOOD."}]}}, {"review": {"des": "Came here right as they opened on a recent trip to Chicago, didn't disappoint! Their happy hour is pretty good pricing but the only catch is its only available at the bar. Their margaritas are on point! We arrived thinking we would get the king crab boil, but the price per pound on it when we got there was $48, so we ended up getting a shrimp boil ($27). (I think the price changes with the market.) We got the all the seasonings and sausage and red potatoes. For two people, we were stuffed! We even got free shots as we were leaving. Definitely recommend!", "pics": null}}, {"review": {"des": "I have to admit, I was skeptical. How good could something not even remotely native to Chicago be? However, I LOVED our dinner experience here on a Friday night. We headed over on the early side to hopefully avoid a wait, but still waited about an hour for a table. We ventured over to a nearby bar (no shortage of these) and were able to track our progress on the app. <br><br>Once seated, our waiter was extremely helpful in navigating the menu. Determining what to get was pretty easy for us, head-on shrimp and mussels! The everything sauce, very spicy, was fantastic and had a significant kick! The boyfriend and I really like spicy food and this hit the spot. We also added sausage, potatoes, and corn to just one of the pounds of seafood. To add to both would have been overkill! Highly recommend the coleslaw and cornbread for sides, they help to balance everything going on in the boil. Cocktails seemed a little pricey, but buckets of beer (we got Coronas and 312) were $25 for mix and match.<br><br>You're going to want to be dainty and clean, resist this urge! Embrace that you will be super messy and smell like garlic following Lowcountry. I also wouldn't recommend this for a first date. It might inhibit you from really digging in. And corn on the cob isn't conducive to conversation. And you'd need like, 100 mints to prepare for a makeout session. Overall, this place rocks. Lively atmosphere, delicious seafood, and unique concept that's executed really well.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/bJgTyt0kkmUo8ZGd2jWfNA/348s.jpg", "caption": "Shrimp and mussels! Shrimp were the star, highly recommend."}]}}, {"review": {"des": "Delicious food and awesome atmosphere!<br><br>We ordered a serving of snow crab legs and mussels (two people, we shared). They serve great portion sizes and the mussels were huge. <br><br>Order the everything sauce, it's delicious and very flavorful (just don't expect to make out after a date here since you'll smell of delicious garlic until the next day).<br><br>We came back a day later because it was so delicious.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/A_6JePWQjhNwwSfiHqm7QQ/348s.jpg", "caption": "Snow crab legs and shrimp with everything sauce."}]}}, {"review": {"des": "Overall: Fresh seafood (can be tough to find in IL), great flavors, fresh side orders, and the restaurant rang itself has a fun, laid back vibe. Beachy decor, kind of transports you to some small fisherman city but JK, you're in Wrigley. <br><br>Order up: 1 lb of king crab with \"everything spice,\" medium hot - crab was fresh, sauce was bomb, super garlic-y; fried calamari - served with scallions and fresh jalapeños, different from typical fried calamari but really good (the aioli it's served with makes the dish); pickled veggies - nice fresh crunchy veggies, not overwhelmingly pickled or excessive vinegar, on the sweeter side; coleslaw - I'm a lover of lettuce with mayo, this coleslaw did not disappoint. <br><br>Negative Nancy: $42 bucks for 1 lb of crab... and the portion was small, it was barely any crab. The coleslaw was also super small too. Not gonna lie, I was hungry when I left. Hungry and broke. <br><br>Oh, you get to wear a bib.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/1VoQDUyxTfJU4W9Z77rPbw/348s.jpg", "caption": "Fried calamari (not pictured: garlic aioli - I would eat the aioli by itself, with a spoon.)"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/kFAtE1Vsf3udN-2oNFlcLw/168s.jpg", "caption": "Coleslaw (good) and pickled veggies."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/3382jgSocJEII7Aw-JfuuQ/168s.jpg", "caption": "1 lb king crab. Everything sauce. Medium heat. Sauce is delicious. Not overly spicy. fresh, but pricey for such a small amount :("}]}}, {"review": {"des": "Updated on 4/9/16<br>Came here on a Saturday night and was told there was a 3 hour wait and since they stop seating at 1045pm and it was 8pm I couldn't be seated. Mind you there were a bunch of half empty tables in this place. I don't know what kind of business turns down paying customers...I guess this place. I'll never come here again I can tell you that. I'm not going to pay my money to be treated rudely by a hostess!", "pics": null}}, {"review": {"des": "Best crawfish here. Hands down. Their EVERYTHANG level 3 reminded me of Houston's type of seasoning. We had some of their level 4, and it was too hot! <br><br>I noticed 95% of the crowd here one Friday night, didn't order crawfish! Seems like most people eat shrimp here. <br><br>Definitely order their cornbread. It's DA BOMB. <br><br>Their fried Oreos are not worth it. They use rice instead of regular batter, which is a cool twist... But I don't think it worked out well. It hardened too fast. <br><br>Their sauce is on point. I am definitely not returning to all of the other crawfish joints anymore. This place really surprised me. I was saddened when it was no longer Blokes and Birds... But this is way better! <br><br>Tip: Make fried rice with that sauce!!!!", "pics": null}}, {"review": {"des": "There isn't really much to say about a place that consists of putting buckets of food in front of your face, except that the bucket of food was so good that we got even more. Yum! Yum! Yum! I wish I was eating some right now!<br><br>It DOES get super crowded here, so they lose a star for not accepting reservations. We had to wait an hour and 15 minutes to get a table for 3.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/joL28wFrXq7sTjqCl7c_lA/348s.jpg", "caption": "Oh so delicious! Shrimp, corn, and potatoes."}]}}, {"review": {"des": "If you are in town and have a taste for seafood this would be a great choice. The waitress was a little slow in getting what we needed but turned out to be very knowledgeable and patient with helping us choose what would be a good for our family. The food was very flavorful. The drinks were also good. The space was a little cramped but that would be my only complaint.", "pics": null}}, {"review": {"des": "Very, very impressed with Lowcountry! <br><br>For someone who knows absolutely nothing about seafood/boils/etc I was a little intimidated. The bartender (forgot his name - he was great) did an excellent job of giving me a full rundown on the entire menu along with whats popular and his favorites.<br><br>Got a Shrimp Bahn Mi that was fresh and flavorful. Bonus points for their excellent beer list along with their great happy hour specials.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/PrAtA0A4lhvlo92fVCSMjw/348s.jpg", "caption": "Shrimp Bahn Mi with Cajun Fries"}]}}, {"review": {"des": "I recently went to Lowcountry for dinner on a Saturday night. IT WAS AWESOME!! I was not familiar with the best way to order, and our server Jonathon did an awesome job explaining. <br><br>My boyfriend and I ordered 1 lb of head off shrimp and 1 lb mussels with everything spice and level 1 spice (since it was our first time trying, we didn't want to ruin it with too much spice). We also ordered the jalapeño cornbread and picked veggies. We added corn and potatoes to our seafood boil too. <br><br>When our food came out they cut open the bag and we were hit with the amazing smell!! I kid you not these were the biggest and most delicious mussels I have ever had!! Wherever they are buying their mussels they should let every Chicago restaurant know. The flavor was great and everything was cooked great! We cleaned our platter!! The only thing we were kinda meh about was the pickled veggies. They just didn't quite taste pickley enough for us.<br><br>We were so intrigued by the fried Oreos, so we had to try them! THEY WERE AWESOME! I've never had fried Oreos before and they are decadent, but way too tasty! <br><br>I will definitely be back at Lowcountry to enjoy more delicious food! Definitely go give this place a try if you are curious!! (We didn't drink there that night, but they even had great drink options too!)", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/1d9ejgtoRlRrj3kl66ptYg/348s.jpg", "caption": "Shrimp head off and mussels with everything spice! Jalapeño cornbread and pickled veggies on the side!"}]}}, {"review": {"des": "Very fun restaurant! You choose what type of sea food you want and they cook it in a bag with your chosen sauce and bing the whole thing our for you to dig into.<br><br>Our wait time was about 45 minutes and there really wasn't any place to sit or stand. They suggested finding a seat at the bar, but the bar was packed the whole time we were waiting.<br><br>Also I might not come here on a first date, it gets a bit messy.", "pics": null}}, {"review": {"des": "I tried angry crab and hated it because of all the garlic and there was no way to get the food with out it....but low and behold I find my gem when I went to Lowcountry. They had no problem with making my crab leg bag without the over powering taste of garlic. The service was great. And the fried shrimp were made to perfection and came with an amazing dipping sauce. I love that they have a bar and offer drinks. The only thing that wasn't spectacular were the beignets but that's because I've been privy to the delights of cafe du monde. Having deep creole roots I get real picky about my seafood but I must say this place did not disappoint.", "pics": null}}, {"review": {"des": "My all time favorite for asian/cajun crab legs! Loooooove this spot! Better than most copy cats. For one it's a bar/ lounge so no byob which makes the check more expensive but so worth it! The ambience, the service, the food, the drinks! So good! The happy hour Monday- Friday if you sit at the bar 1/2 priced drinks! Yeah! Only thing I would say it lacks is there sides. Ehhh. But who needs sides with crab legs? I don't! :)", "pics": null}}]}