{"name": "lula-cafe-chicago-3", "reviews": [{"review": {"des": "There is no shortage of glowing reviews for Lula, but I have to put in an additional complimentary two cents. The fried sunchokes (Fall 2018) are indulgent and texturally interesting, creamy for the Chicago cold snap, a perfect appetizer to share. So many dishes have unusual & delicious combinations of ingredients. I find that Lula pushes the edge of creativity without ostracizing clientele. Amazing success in this area!<br><br>A special thank you to Andrew for his table service a few weeks ago. His descriptions were clear and enticing, his timing was present but never hovering, he was patient as we took forever to decide, and he made eye contact while chatting with us. Thanks you for sincere and hospitable service, Andrew!<br><br>Also sending special gratitude to Elise at the bar. She amiably convinced me to try the special Lula cocktail (what's the name, again?) when I was in the mood for an espresso martini. It surprised me by being both creamy, roasted, citral, but much more nuanced than an espresso martini. I was so pleased with her confident, friendly suggestion. On my last visit, it was no longer on the menu, but you will be unsurprised to know that she built it for me again. You made my day, Elise (twice!).", "pics": null}}, {"review": {"des": "( cornbread French toast with peaches, butterscotch sauce, brown sugar pecans and lemon yogurt) this dish was literally heaven on earth, incredibly delicious and unique taste. The baked feta was good too.<br><br>P.s wasn't a big fan of the vibe and ambiance", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ZwRLuN7Ce7Vr6wTlDCEdDQ/168s.jpg", "caption": "Cornbread French toast"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/H4aXawkwWSxkoZrj4mfMMQ/168s.jpg", "caption": "Baked feta"}]}}, {"review": {"des": "I've had breakfast, lunch and dinner here - clearly a fan  and enjoy the menu each time. For breakfast/brunch I really like the tofu scramble and gimme lean sausage. The specials are always good to mix things up. Recently went for lunch with a friend. There's likely to be a wait, but we didn't mind since you can order a cocktail while you wait. I had a squash purée soup and autumn salad. My friend had the steak sandwich on special. <br><br>The service is always very attentive and friendly. The environment is a great combination of relaxed and lively. Always a good spot before or after the farmers market on Logan.", "pics": null}}, {"review": {"des": "This was one of those dining experiences completely sponsored by the Yelp community and I'm glad I took their advice. I was visiting from Florida and staying in the Logan Square area. Before heading to the airport I looked up breakfast options near the train and Lula was recommended from the Yelp community. It's a smaller restaurant but was active for a Monday morning around 9am. I had my large duffel bag and they offered to keep it behind the hostess stand since I was eating breakfast alone at the bar. This was a quaint, hipster spot and I really enjoyed it. I got their coffee and I don't know if there is anything special about it but it tasted really good. For breakfast I got the royale sandwich and it was AMAZING. All of the ingredients were fresh and I didn't expect to like mushrooms and eggs in a sandwich but I did! If I'm ever back I will be checking out this place again!", "pics": null}}, {"review": {"des": "Great service and wonderful food!<br><br>Ordered a Blue Line 1919 to start--it's a great choice for mezcal fans. I had the summer omelet, which was perfectly cooked and served with a side salad of microgreens and a slice of hazelnut toast. Everything was excellent. My partner ordered the very substantial turkey sandwich, one of the only times I've ever seen a huge sandwich that didn't self-destruct on the first bite. After brunch I had a perfectly brewed espresso and we shared the matcha ice cream. I highly recommend the ice cream! Often, matcha flavored desserts don't deliver a very potent matcha flavor, but the ice cream was big on the matcha without being bitter. <br><br>I can't say enough about the service, everyone was really friendly and cool even though the place was slammed and it would have been easy to get snippy on a 95 degree crazy busy brunch service.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/TBXIyNKfSTbuT4Pz-aHV2Q/348s.jpg", "caption": "Summer omelet with stracciatella di bufala, wax beans, and sorrel aioli."}]}}, {"review": {"des": "Great place for brunch. We came on a Saturday around noon without a reservation and were sat within about 10 minutes. It's a pretty sizable place so they can turn tables pretty quickly if you're willing to wait for a few minutes. They also have an outdoor seating area if you'd prefer.<br><br>Drink menu is full of fun and unique brunch cocktails, and I believe all of them are around $12. They don't have bottomless though.<br><br>Food was EXCEPTIONAL. I got a turkey club with avocado spead and I was blown away. The veggies were cold and fresh, the bread was mutli-grain and tasteful, and the avocado spread was out of this world. Came with some breakfast potatoes as well, which were a nice, savory touch for this meal. I believe they also have a specials menu, which they rotate daily, adding a fun touch to the restaurant.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/6KNmJuQU9LSfP2B9Fv3u6Q/348s.jpg", "caption": "Turkey Club with Avocado"}]}}, {"review": {"des": "*hipster - old school standby. Been coming here since I was in my 20s. I'm 44 so that should say something. I'm an old hipster lol. The food is always good. I have been doing keto for the past year or so I would like a menu that has more keto options and unfortunately this does not only one option was available. However for me it's got a good place in my heart swell keep coming back. The chicken was amazingly tender and had a good taste to it and my partner enjoyed his ham and cheese panino.", "pics": null}}, {"review": {"des": "I came here with my bf for our anniversary dinner this year. I was a little skeptical about coming because their menu is a little small and nothing really stood out at first glance so I wasn't excited to come. However, my bf REALLY wanted to go, so there we were. <br><br>We sat on the patio, which is really nice. It's in a high traffic area so it's not like you've got a peaceful rooftop or anything, and people watching is minimal, but it was a cute patio lit by candles. They put blankets on the chairs which I think is a nice touch this time of year (September)! <br><br>Now onto the food- we had the farm dinner menu on a Monday, which I was excited about despite their normal menu. It looked amazing. <br><br>The starter was a crispy chickpea pancake with whipped ricotta and apples (AMAZING). I was surprised by this and the texture and flavor combo was perfect. <br><br>The entree was short rib with endive and grilled pears. This one as a combo did NOT work for me. The endive was so ridiculously bitter, I tried two bites with the whole combo and it was just gross. So I scraped off all of the endive and tried just the short rib and pears together. This was also an unappealing combo. They just didn't work for me. HOWEVER, individually the short rib was juicy and tender and I loved it, and the pears were fine. I just thought this course was a weird pairing that didn't work and even my bf who is ALL ABOUT those unique pairings thought it was a bad mix. <br><br>The dessert was fresh nectarines with a hazelnut crumble and ice cream. I don't remember what flavor the ice cream was, but it was incredible and the whole dish was just awesome. <br><br>Our server was really friendly and knowledgeable, and was really great overall, but even on a Monday, the restaurant was packed. The bussers and food runners were great as well. <br><br>We had our 3 course farm dinner with 3 wine pairings and it was $70 per person- I believe it was $45 without the wine pairings. <br><br>I enjoyed the dinner, but between the disappointing entree combo and overall price, it was a solid 4 Stars for me. This is probably a restaurant for people who are foodies for meatless food as it seems like that's what they do best. Still a great dinner!", "pics": null}}, {"review": {"des": "We loved Lula! We were visiting from downtown KC and came here on recommendation. It was a Sunday morning and we arrived 15 minutes early -- glad we did!!! It was very busy and filled up in a matter of minutes. Every worker we encountered there was super nice and friendly, and the atmosphere is very trendy and clean. I ordered the challah French toast and my boyfriend got the pancakes. Both were amazing. We sat outside and while it is a little crammed (might be hard with children), we managed just fine and it sat comfortably enough. Afterwards we walked right across the street to the Logan Square farmers market and that was such a treat as well, so many amazing vendors!", "pics": null}}, {"review": {"des": "When I think of Logan Square... I think Lula Cafe. Whimsical, funky decor with a heavy emphasis on hipster. Small unique menu meant for splurging, and a small dining/patio area. Some people like the brunch menu more because it is more affordable. Some people like the dinner menu more because it has more unique flavors. You have to visit this place more than once to get a real feel for it.<br><br>You either love this place to death or can't understand why people worship the ground here. I am a fan of LC because I love the cafe culture. My husband, however, does not like this place. He loves red meat, cheap eats, bbqs, burgers, steak, larger portions, and a variety to choose from. He cringes at meat substitutes. We have completely different tastes, but I hope this paints a very Lula picture for you.<br><br>We arrived at 4:00PM today (Monday)- that weird time of day when it's not lunch, but not quite dinner. Luckily, Lula was open and serving food. My one quirk with our experience was the host was on the phone when we arrived. She didn't acknowledge us, even when it was visible we were standing in front of her. She continued the phone conversation for another five minutes or so without excusing herself from either party. Finally, she put the phone call on hold and said \"this way to your seats\". Still no hello or sorry for the wait. <br><br>Our server was completely different. Very accommodating and lively. <br>We were given the \"Cafe\" (or midday) menu. Some crowd favorites that our server suggested on this menu were Baked French Feta ($14), Turkey Sandwich ($13), and the Gunthorp Pan Roasted Chicken ($19). My husband chose the Turkey Sandwich (plus $2 for bacon and cheese) and I chose the Chilled Peanut Satay Noodles with Tofu ($13). Both choices had lots of flavor. Best turkey sandwich I have ever? No, but I did like how they didn't skimp on the avocado. My noodle bowl had no shortage of sauce and was very savory. With lots of seed tendrils and cilantro, I was satisfied with my meal. My husband on the other hand commented on the portion to price ratio. We were both very hungry when we arrived. Leaving, I was content and my husband said he would probably be hungry in another 30 minutes.<br><br>Would I eat at Lula Cafe every week for the rest of my life? No. Did I like the food and would I come here again? Absolutely. See you then, Lula.", "pics": null}}, {"review": {"des": "Had brunch this morning here and it was amazing! The place is pretty big with two different dining rooms. One room has a bar and is fairly open and the other long with small tables. Very simple decor and styling that is not boring, more minimal and speaks for itself. The focus here is the food, and the ambience is relaxing and light. <br><br>I was glad we didn't have to wait to be seated and the service was very friendly. <br><br>I had the best ever chai latte, here. It literally smelled like fresh ground cinnamon on top of the cream. I also ordered a piece of the pear cranberry coffee cake which was really good. The flavors of it weren't overpowering and the texture reminded me of moist banana bread. P.S. This is a small portion so just use it as a supplement to your meal or to just try.<br>I ordered the breakfast burrito which was absolutely perfect, only finished half before I was full.<br>My boyfriend ordered a brunch cocktail which was good and was similar to a crossover of a white russian/eggnog. He also ordered the porridge which has bee pollen and blood orange and he said it was sweet but really good and should be tried at least once.<br><br>Overall, good quality for the price and very tasty. Would love to come back and try more!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/rIOUVDNrYJPPUwVC5RSWSA/348s.jpg", "caption": "Breakfast Burrito"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Y6UvpkQrmTF6dJuQD3gHDw/168s.jpg", "caption": "Porridge with bee pollen and blood orange"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/9bXIUVF63llRuGYgeuT2iA/168s.jpg", "caption": "Best ever chai and brunch cocktail"}]}}, {"review": {"des": "We received a gift card and a glowing recommendation to stop by Lula Cafe, so after failing to land a reservation online, we decided to try our chances at an early dinner at 6pm. The restaurant has a lovely, eclectic, shabby-chic feel, and all of the staff, from the maître d' (who informed us the wait for a table indoors would only be 15 minutes), to the bartender, who mixed up the most beautiful periwinkle drink I've ever seen, to our lovely waitress, Kendal, who was super friendly and attentive throughout our meal.<br><br>Since we weren't too hungry, we ordered just a few small plates; each dish was absolutely incredible. Lula offers a large selection of seasonal specials that changes each night, as well as a full menu of items that are always available. We were enticed by the tomato and lobster salad with quinoa, which tasted so fresh and summery, with the buttery quality of the lobster accentuated by the lightly creamy dressing. We also enjoyed the chilled peanut satay noodles, which was a perfect dish for a hot day and was surprisingly filling. However, our very favorite dish was mussel and chanterelle toast. Comprised of a thick, crusty piece of grilled bread mounded with buttery, almost sweet chanterelles, smoky oysters, and a garlicky pesto sort of sauce, we immediately were hit with the mouthwatering smell when the dish arrived on our table. We almost ordered a second one - if only we hadn't been quite so full! For dessert, our waitress recommended the olive oil cake, which was very moist and full of olive oil flavor, and served with pecan-encrusted roasted figs - so, so good.<br><br>What's kind of nuts is that for this incredible meal highlighting local, seasonal produce and featuring luxurious items like lobster, chanterelles, and oysters, our total bill came out to ~$60 for the food (and then with the $20 gift card, we each paid only $20 before tip). The menu is also so extensive, we would have totally come back here again if we had had one more day in Chicago. In the meanwhile, I'll just have to sigh dreamily as I think about that chanterelle and oyster toast, and wait with bated breath for my next visit to Chicago.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/yA0aevU_JhNWgQ_PSWQ81w/348s.jpg", "caption": "Olive oil cake with pecan-encrusted figs and anise-hyssop ice cream - $10"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/hY1y0wOLjoIZ64obL7qpXw/168s.jpg", "caption": "Mussel and chanterelle toast (order this!) - $12"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/LXwuXtlYQWchHS4H-oKAeA/168s.jpg", "caption": "Interior of main indoor dining area"}]}}, {"review": {"des": "Loved the brunch experience at Lula. I ordered the veggie scrambler which has asian inspired flavors like sesame. Flavor was on point and great portions also. <br><br>There is plenty of street parking (Its $2/ hr on Saturday). Only dow side is the wait, we waited 25 minutes (there is a cute local shop around the  corner in case you want to shop while you wait).", "pics": null}}, {"review": {"des": "I didn't heed the warnings but it didn't take long to be overwhelmed by the hipster vibes of this place. It's a very large restaurant, and was unexpectedly packed on a Saturday morning. My boyfriend and I were able to get seating near the chef's counter without reservation.<br><br>Smoked Lake Trout Scramble: There was A LOT of dill on this. I had to move it to the side because it was overwhelming the entire dish. Additionally, the trout barely had any presence. <br><br>Pork and Sweet Potato Hash: When you eat a hash, you expect something relatively meaty and/or fatty, hefty, crispy, and filling. This dish had none of those elements to it. Everything was the same, soft texture. It was the cleanest and leanest hash I have ever tasted in my life, which wasn't what we were expecting of a hash. <br><br>Since we were sitting right at the counter where we could peer into the kitchen we were able to see that the hash had already been prepared in advance in a large skillet and portioned out for every order, which probably explains the texture of the dish. <br><br>Portions are good at this restaurant, but the taste and filling-ness of the dishes were subpar.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/h2KymMfhiVzuZWhK2_BIcA/168s.jpg", "caption": "Menu"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/IqadptVl0LZWNe85wnQJmQ/168s.jpg", "caption": "Menu"}]}}, {"review": {"des": "Was quickly seated at the bar and the staff was really friendly.<br><br>Ordered the Royale breakfast sandwich and it was so good! The garlic bechamel sauce was divine. The bread was a bit tough, but to me overall it sort of tasted like an pizza in sandwich form with an egg! <br><br>Ordered a vanilla latte and it was excellent as well.", "pics": null}}, {"review": {"des": "Food-<br>Almond hummus: 4<br>Far from your traditional hummus, and more of an American take on the spread. Good and with a unique taste.<br><br>Beet bruschetta: 4.5<br>Goat cheese was excellent, as were the pairings. Eat this by hand. <br><br>Desserts-<br>Olive oil cake: 5<br>Excellent; eat each bite with a piece of everything: fig, cake, cream. <br><br>Chocolate - 3<br>Interesting take on dark chocolate,  Japanese crackers, raspberries, flower petals, and cream.  Wouldn't order again. <br><br>Drinks-<br>Cabernet: 5<br>Latte (Metric): 5<br><br>Service: 5<br>Ambiance: 5", "pics": null}}, {"review": {"des": "Why I'm fan-girling over Lula Cafe's brunch:<br><br>(01) in-house pastries (i.e. poppyseed & fennel biscuit)<br>(02) plentiful vegetarian options (i.e. chickpea & sweet potato tagine)<br><br>100% worth the hour wait.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/RUjH3sft89ojD1TI4kNKVA/168s.jpg", "caption": "Quesadilla"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/y2aYVS52ARL1rTvSvzYkqA/168s.jpg", "caption": "Tagine"}]}}, {"review": {"des": "Lula has been part of the Logan Square community for 17 years prior to the more recent explosion of restaurants, bars, and cafes.  I have had the pleasure of coming here for both brunch and dinner.  While I am more of a fan of their dinner options, their brunch is also delicious and affordable.  The environment is quaint and cute within a somewhat eclectic and charming space.  Their patio is always packed full of diners.  Their service has always been accommodating and the servers are knowledgeable and proud of their food.<br><br>Brunch:<br>If you are looking for unique brunch fare without getting stuffed, Lula is a great option.  It's challenging for me to come here for brunch since they only have it till 2pm and I'm a late riser on the weekends so I usually miss their brunch.  In the few times I have been able to have their brunch, I have been impressed with their unique offerings.  It's always busy with a wait so expect to wait a bit.  While I am usually a fan of savory foods for brunch, my dining companion and I started out with their Sweet Grain Porridge, which had bee pollen, soy milk, rhubarb, and sunflower.  The grain on top added a nice crunchy texture.  It was really cozy and not overly sweet.  I really liked how the soy milk went with everything in the bowl.  We also ordered the chocolate sesame babka.  It was a bit dry for my tastes but I don't pretend to be a babka expert so maybe they're supposed to be on the dryer side.  It wasn't super sweet but more mild.  <br><br>My favorite brunch dish was their Smoked Trout Scramble served with a side of crusty, fresh sourdough bread and seasoned potatoes.  It was served with fresh dill, arugula, bits of tasty smoked trout, and whipped cream cheese.  The cream cheese did not dominate the flavors at all and complemented the fresh vegetables and herbs very well.  The eggs were also creamy and perfectly made.  I am often disappointed with scrambled eggs when I eat out because they are often dried out but I was satisfied with my eggs at Lula.  <br><br>We also tried the Lula Classic Breakfast Burrito which came with avocado, potato, cheddar, scrambled eggs, and salsa verde.  The eggs were creamy and blended very nicely with the avocado.  I think the burrito overall could have been more seasoned but the salsa verde definitely added more flavor to it.  <br><br>Dinner: <br>While I do like their brunch, I am more of a fan of their dinner because I think the flavors get more exciting.  Their cocktails are always super delicious and refreshing.  <br><br>My favorite appetizer is the Baked French Feta.  It is heaven in a small, appetizing silver bowl.  The baked French feta comes out baked and sizzling garnished with acidic and savory marinated olives, cucumber, parsley, and a succulent jalapeño-basil oil.  The feta is soft and moist and spreads perfectly on the delicious baked bread served with it.  I never forgot about how delicious this was after the first time I ate here.  <br><br>We also shared their Fave Bean hummus, which was also remarkable and delicious.  It was fresh and came with these savory mushrooms adding a delicious umami flavor.  It was also packed with flavor.  <br><br>For our entrees we of course ordered some pasta because Lula knows how to do pasta and they do really interesting sauces and flavors.  We ordered their bucatini with ricotta and basil with freshly shaved parmesan on top.  It was another savory delight and the pasta tasted fresh along with the herbs used.  Our last entree was their Wood-Ear Mushroom risotto.  It was creamy with arugula and chives served on top.  The mushrooms were crispy and added a fun texture to the moist risotto.    <br>Lula is pricier but it's worth the splurge.", "pics": null}}, {"review": {"des": "Love this place. Always a line outside, for a reason! Food is always amazing, staff always friendly and the only bad thing about this place is that they are closed on Tuesday's. :)", "pics": null}}, {"review": {"des": "On this trip to Chicago we had breakfast/brunch twice at Lula's.  They never disappoint.  Not an overwhelming menus, but very creative food options that you've probably never experienced anywhere else.<br><br>I had their \"Brown Butter Granola\" which was the best granola I have ever experienced.  It was served with their home-made yogurt covered with their home-made granola with fresh peaches and blueberries and interesting floral and herbs complements that gave it a unique flavor I've never experienced.<br><br>For an appetizer we had ricotta cheese with fresh plumb bits served with a cracker bread and on another occasion their roasted beet bruschetta that had unique herbs to complement.<br><br>My wife had their \"grain bowl\" that was amazing on our first trip and on our second, an omelet.  I didn't taste it, but she continually say, \"what did they do to these eggs?\" And, she never even offered me a bite!  <br><br>It's becoming our favorite in Chicago and certainly in Logan Square.", "pics": null}}, {"review": {"des": "I don't know why some people want to hate on this place! I think it's perfection. We were able to find parking right outside, the hostess was so cool when checking in, I enjoyed the brunch cocktail list (I tried the fair-weather friend: mezcal based), and thought the 30 minute wait went by fast and was well worth it! Theres a few cool shops down the street you can check out while you wait.<br><br>I loved the music, the interior, the crowd, the food, and most of all the service! <br><br>We were seated in the back room, and although we were too late to eat off the brunch menu, the lunch menu proved to be great. Our waiter even offered us some leftover pastries from the morning and gave us the option of getting a side of scrambled eggs in case we were really desperate for a more traditional brunch option. <br><br>the pastries- sweet potato donut and this pear/red wine crumble were both so unique and not too sweet! Whoever makes their pastries is a genius. Keep making things that are a little different!<br><br>The food- I split the Moroccan lentil soup which was just a little spicy and warmed me up- good value for $6. The Yia Yia pasta seemed interesting and I'm glad I tried it. It tasted more like cheese than brown sugar or butter- very good. The turkey club may have only been a turkey club, but it was so good! Hands down my favorite meal I had in three days in Chicago.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/EuXvSLdie7vt-kQsCF_XFw/348s.jpg", "caption": "Yia Yia Pasta, Moroccan Lentil Soup, Turkey Club"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/gsYLMv-ip7aXMfUdyDDQxA/168s.jpg", "caption": "Second room for seating"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/rPxULmnOHihZkpfLLjesrw/168s.jpg", "caption": "Fair-weather friend, Sweet potato donut, Pear/red wine pastry"}]}}, {"review": {"des": "This is my kinda place. If I'm going out for breakfast, I want something hearty but not heavy that'll put me in a carb coma for the rest of the day. Lula really hit the spot and it was honestly one of the best breakfasts I've ever had dining out. We got there just before opening on a Sunday morning, and there was already a long line waiting.<br><br>The menu seems to change seasonally, which is a good thing (and bad- I can't find a description of what I ate and know I'll never be able to have it again!). Everything is obviously fresh and you could call this a \"farm to table\" kind of place. We had never been, so they sent out a complimentary pastry, which was yummy- not overly sweet and big enough to share between the two of us. We ordered a main course, a side of beets (overly generous portion that we could barely finish), as well as a side of chicken sausage. It was plenty for the two of us. The service was excellent, the food fresh and tasty (I would have licked my plate if I could have), and the atmosphere homey. The place is pretty big with lots of seating, so the line moved fast...which was good because we were hungry! I'd definitely recommend Lula Cafe for breakfast and would make the trek back next time we are in Chicago!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/sU8FuFuTFf7tElTpNZJShQ/348s.jpg", "caption": "Breakfast with an enormous side of beets and some chicken sausage"}]}}, {"review": {"des": "I love Lula Cafe, you can love me or not. It's pretty as a picture, whimsically old in the most dewy way; I like the sun in my eyes and the candlelight at dinner is a kiss.<br><br>The food is a walk in the garden, a visit to the farm. The approach to food is modern wholesome. I love bringing vegan friends because they are often charmed by the menu. Some of the ever-changing dishes are mind-blowing. In fact, my recent server walked me through the menu and said, \"This dish used to be my favorite and then this new item was introduced and it became my favorite!\"<br><br>If you are still reading this, you might be wondering why I'm giving Lula Cafe three stars if I am so in love. Well, it is terribly uncomfortable for me. The chairs are hard. My bum and back hurt by the time I leave. Additionally, the tables are really, really close to one another - so much so that the servers need to pull the table out so that guests can get through and sit on the other side.<br><br>That brings me to my final complaint: it's noisy. It's so noisy that I strained my voice the last time I was there and my throat and upper chest hurt afterward.<br><br>Chef and owner Jason Hammel also works his culinary magic at Marisol. Chef and James Beard nominee Sarah Rinkavage works at Marisol too. I don't have the answers, but the question is clear. Marisol is a much more pleasant dining experience compared to Lula so how can I possibly give Lula five stars when I know that it has already been reincarnated and that the reincarnation is superior?", "pics": null}}, {"review": {"des": "I hut up Lula for brunch yesterday and had a really nice experience, as usual. The host was a little off in quoting the time, but eventually we were seated. <br><br>The service was good and my grain bowl was to-die-for! It was really different but full of really satisfying flavors. The grilled apple is a tall treat. The Bloody Mary was meh. <br><br>I must say I'm sad to see the old menu gone. I went in hoping for an old favorite. Bring it back?", "pics": null}}, {"review": {"des": "Good food. This place definitely is hipster/gentrification inspired. Yelps got it all wrong with only 2 dollar signs. A lot more expensive than advertised. Reminds me of tons of places in PDX without the high-end prices.", "pics": null}}, {"review": {"des": "My all time ultimate favorite eatery in the world! I used to live a ten minute walk away on Spaulding--back in the early 2000s and fell in love with the space, the community feel, and of course, the food, most definitely. Carefully curated experience with local food driven menu or a classic long standing cafe menu with equally delicious flavorful dishes. The feeling that the staff enjoy each other and what they are doing. Beautiful ambiance and presentation.<br>Mmm--tho it's been 14 years since I left Chicago, every trip back Lula is the highlight of my visit and it is amazing every time. Kudos to them for finally making the restrooms gender inclusive, too!", "pics": null}}, {"review": {"des": "This is a hidden gem in Logan square, which I've come to love for it's eclectic dining options and local feel. Lulas is no exception and I highly recommend you come for a brunch. Each dish was incredible and we got lucky not having to wait long since we opted for bar seating. The cafe is a decent size, but it does it get popular on the weekends. <br><br>We got the soup of the day (curry pumpkin), Po boy sandwich, and beet bruschetta as well as a couple of drinks. Couldn't have asked for a better meal", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/mLHmhvdTblZoaYhX6NLZKw/348s.jpg", "caption": "Sandwich royale. Shrimp Po boy"}]}}, {"review": {"des": "Everyone was wonderful!! Especially the host, the bartender, and the couple of men that brought out our food, with the exception of our waitress, who didn't really check in on us as often as the other waiters did on their table. On the upside her recommendations were spot on. <br><br>Once we received our food though, we forgot about the annoyance described above. <br><br>Charred eggplant ($12) is NOT charred eggplant. I don't know why they named this dish as such, when y'all actually puréed like hummus. Luckily, even though my partner was upset about his expectation vs what came to us, I enjoyed pairing the \"charred\" eggplant with grapes and bread. <br><br>Pork belly ($18) was delicious, then again, what pork belly isn't? It is a bit on the sweet side, and reminds me of filipino seasonings. <br><br>Lamb ($29) was not the best seasoned lamb I've had, but holy smokes, it was the best tenderized lamb I've ever had! They apparently use sous vide for the lamb, and let me tell you, it really melts in your mouth!! <br><br>Creme brûlée (n/a) just shut up and hand your money!!!!!!!!! SO GOOD that they ran out. <br><br>Overall, I enjoyed our dishes with the wine we paired it with (Sauvignon blanc), and also the outside seating. <br><br>I recommend!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/sOnUSY10DpR2I2bxt1OfzA/348s.jpg", "caption": "10.1.17 creme brûlée"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/BofBwcMkPo3oVMsakJOcyg/168s.jpg", "caption": "10.1.17 Sauvignon Blanc $10/glass"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/TYlFfUaFhDyRSkSnJs49Dw/168s.jpg", "caption": "10.1.17 pork belly"}]}}, {"review": {"des": "I've always raves about Lula's but the last few times haven't been quite as good as the first ones. Menu is getting old (breakfast at least). Still very good, but just not the 5 stars it used to be", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ubX6BEx0a2LMunxEbCzA-w/168s.jpg", "caption": "Pumpkin hummus. Maybe worth trying, but not super impressive."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/oIB3kIGiXDKg2O3nUpuAjA/168s.jpg", "caption": "Buttermilk Pancakes or Brioche French Toast Lots of people were having pancakes today, and there'd were all fluffy..... why aren't mine?"}]}}, {"review": {"des": "Came here for breakfast yesterday and would not hesitate to recommend to a friend! The menu is small, but you can tell the chef cares and that they are truly farm-to-tabling it. <br><br>I had the lox platter, but so many things on the menu jumped out to me! The food is unique and not all just the basic breakfast fare you expect to see. <br><br>ALSO- we got a chocolate sesame babka that was to die for. Definitely check out a pastry if you have room. <br><br>Only marking down because service was pretty slow, however, our server was very polite and knowledgeable.", "pics": null}}, {"review": {"des": "We had a really good brunch here. We got the house pastries (chocolate babka, poppy & fennel seed biscuit, and pear cranberry coffee cake), brussels sprouts, spring onion grits, and the breakfast burrito. Everything was really good, especially the pastries (which I had ranked as: biscuit, coffee cake, babka). Dinner here looks great as well, and I'd love to try their cakes.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/l4TtGSkSAklmBfFaGvkCrA/348s.jpg", "caption": "Brussels sprouts"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/2ybQfZIjDTclVU12iKRB8A/168s.jpg", "caption": "House pastries"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/8oJ3h41KviTNREuUXZEnaw/168s.jpg", "caption": "Breakfast burrito"}]}}, {"review": {"des": "Checked out this place on the recommendation of a former veggie Chicagoan. I hear it's great for brunch, but I've only been for dinner - still, dinner was pretty tasty! We sat outside on the patio and my friend had a great selection of wine while I devoured everything in sight.<br><br>I'm not really sure what everyone's talking about re: \"whimsical\" and \"hipster,\" - but then again, I'm from Portland, so maybe I have higher standards for whimsical and hipster. This seemed pretty bread-and-butter American New to me - both in terms of decor, service, and fare. Which is not to say it wasn't good! The dishes were well-done, well-presented, and the service was stellar. Wouldn't hesitate to come here again, and I have their brunch high on my list of \"to-try\" places the next time I'm in the area.", "pics": null}}, {"review": {"des": "It's a staple and it's always good. I've been here many times over 13 years and I've never had a bad time. It's a wait but good things are worth it. The crowd in Logan can be a touch frustrating these days but Lula can't help that. I also seem to be way too caffeinated when I leave because the coffee is so damn good.", "pics": null}}, {"review": {"des": "Went to Lula Cafe on a Sunday morning and turned out to be great! Chill area in Logan Square that offers a nice and modern environment with great hip hop beats in the background. We ordered the Classic Lula breakfast burrito, tofu and vegetable scramble, and the challah french toast! <br><br>The breakfast burrito had a very good consistency with the organic eggs being soft mixed with the fresh guacamole, topped with a flavorful salsa verde sauce and sour cream. The tofu and vegetable scramble came with tofu, greens, and potatoes. Had a very ginger and asian flavor taste, and mixed with the season potatoes (some of the better potatoes ive had) turned out to be a solid dish. Lastly the fresh toast is a must get here! The toast was fluffy and just right in the amount of sugar, mixed with a lemon cream sauce and fruity blueberries, rasberries, and blackberries. <br><br>Overall this is a great brunch place with a modern/hip vibe and would definitely come again and checkout the different specials they offer.", "pics": null}}, {"review": {"des": "Brunch with my friend at Lula Cafe put a cheerful touch on a rainy, dreary winter day.  The inside is cozy, eclectic, and not at all pretentious.  I admired the hipster style of the diners seated next to us.<br><br>Everything on the menu is unique and made with carefully thought out ingredients.  My friend & I have similar tastes, so we ordered the Baked Feta to share.  It's served with olive oil, kalamata olives, and crusty bread.  Until that day at Lula Cafe, I hated olives.  Now when I spy a kalamata olive, I want to eat it!  <br><br>We both had the \"Royale\" breakfast sandwich with garlic bechamel, tomato and sunny side egg.  The sandwich was a little bit messy, but the crusty bread helped hold in all of the delicious ingredients.  The sandwich was big enough to share or save half for dinner later, but I happily finished every bite.  My only minor complaint is the bread.  It was so crusty that my jaw got a hell of a work out.<br> <br>The menu changes somewhat regularly, so don't peruse their website and get your heart set on anything.  <br><br>What's brunch without mimosas?  There's beer, wine, cocktails, and a full bar too.  <br><br>The service was great from the door to our waiter.  The tables here are close together, with narrow walkways, but I didn't get any dirty looks for bringing my baby in here in a stroller.  I parked my stroller by the hostess stand and they sat us at a table where the carrier fit nicely into the booth.<br><br>I'm hungry now just thinking about it!", "pics": null}}, {"review": {"des": "Such a great place! Great lightning, nice ambiance, and delicious and reasonably priced meals. I loved brunch there, and would definitely try to go back for lunch or dinner! Try the Coconut Brioche French Toast or the Potato Crepe for sure.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/4WA-hc__JHhap74EorSU8w/168s.jpg", "caption": "Coconut Brioche French Toast"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/EtF1V-SMK2My4a7rs65DJw/168s.jpg", "caption": "Potato crepe- delicious!"}]}}, {"review": {"des": "If you love brunch but don't like boring breakfast food, this place is for you. Don't expect plain eggs or obvious pancakes drenched in syrup. Instead, you get a creatively crafted menu, elevating breakfast food to a whole new level. The drink options are plentiful, from craft beer or brunch cocktails. And then there is the rotating selection of pastries. Hard to choose, so bring some friends and get them all.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/HvhIPTFa3Z6lO1X9t1b6jg/168s.jpg", "caption": "Grits"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/5wDlKSMzpXe8pYtU-dpTzg/168s.jpg", "caption": "Biscuit"}]}}, {"review": {"des": "I can't believe it's taken me this long to make it to Lula, but this place is fantastic! I came with some girlfriends for brunch over Labor Day weekend and we had the most wonderful meal.<br><br>They have a killer set menu, along with a rotating menu that changes daily with specials.  We shared the pastries platter, all of which were absolutely delicious.  My two friends ordered the zucchini bread french toast, and the breakfast burrito, respectively.  Both were beautifully presented with unique and amazing flavors.<br><br>I ordered the special charred tomatoes with 'ndjua sausage.  It was served in a skillet with a bulgar salad, poached eggs, some greens, and delicious grilled bread.  It was one of the best brunch skillets I've ever had.  Delicious, balanced, amazing flavors, just the right amount of spice, and beautifully presented.<br><br>I cannot say enough good things about Lula! Will definitely be back soon.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ubng_lAaOqFLZfFHnBN27Q/348s.jpg", "caption": "Pastries sampler - all were fab."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/IOr-gXT5LDkHCDmzR42euw/168s.jpg", "caption": "Perfect breakfast burrito"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/5mWALVRlkHdrne4bAZCKCA/168s.jpg", "caption": "Charred tomatoes and 'ndjua special. Absolutely delicious."}]}}, {"review": {"des": "Service was great! We were at a four top and it was a bit tight. Drinks were tasty but there was a limited selection for wine. Dinner was good but portions were small. Flavors combinations were somewhat atypical and slightly bold. Recommend yia yia's pasta. The bucatini was to die for. <br>The four of us ordered 5 small-medium plates, 3 entrees and 2 desserts. It was just enough without feeling stuffed. Not necessarily the place to go if you have a huge appetite!", "pics": null}}, {"review": {"des": "Impeccable service, delicious food. The homemade ricotta with plums was really good, and the rice bowl was such a great balance of flavors and huge portion too. Couldn't even finish! Wish I lived around here to have this more often. Highly recommended", "pics": null}}, {"review": {"des": "This review is for their catering. We had been to the restaurant several times and loved it, so we decided to use them as our wedding caterer. They are AWESOME to work with for events. <br><br>We had been searching for alternatives to typical catering companies, and we knew we didn't want to deal with rentals, service, and bartenders separately (as is the case with many other restaurants who do events and weddings).<br><br>Lula (and Anna H) were super easy to work with. We met in person to go over menu thoughts and then they crafted a unique menu that we tweaked as the wedding got closer. They basically created a customized Lula pop-up. <br><br>The food was absolutely delicious. We got tons of compliments on our family style menu. The only thing that could possibly count as a criticism is that one of the side dishes was corn but it was not explicit that it would be served on the cob. But it was still delicious!<br><br>The service team was spectacular, bar service was on point, and we didn't have to deal with the service ware rentals ourselves which was great. Pricing was competitive with other full service caterers in Chicago. <br><br>Highly recommend for private events and weddings. The team was awesome!!", "pics": null}}, {"review": {"des": "One simply cannot go to Lula's just once.  Why I waited nearly 2 years to visit is beyond me.  Truthfully I'm quite disappointed in myself.  I would periodically look at their ever evolving menu and recall always being impressed and intrigued.  This is a farm to table mainstay of Logan Square.  The menu is inventive, progressive, and extremely delicious.  This is your super laid back cafe with fine dining taste and low prices.", "pics": null}}, {"review": {"des": "Food is excellent, if you have a sweet tooth, i would recommend the French toast for breakfast! I recommend coming in on a weekday because weekends are about an hour wait for a table. Every time I come, the food never disappoints and the seasonal changes in their food is always worth to try!", "pics": null}}, {"review": {"des": "I really don't have a bad thing to say about this place. <br>My sister treated both my husband and I (and herself) to their six-course vegetarian tasting menu plus wine pairing as an early birthday gift to both of us. Lula Cafe is located in Logan Square, which is a pretty big neighborhood now and is booming with millennials and people old like us too haha. <br><br>Our experience here was nothing short was fantastic! The place is really cute, dimly lit, intimate and is actually bigger than you think from the outside! And despite the interior, it's a very casual place so you don't need to be super dressed up. Their entire menu sounded good, but we were there for the vegetarian tasting menu plus wine pairing.<br><br>I couldn't tell you the wines we drank because I forgot, but I do remember the course we ate:<br>* Their take on a Caesar-type salad with radishes, ricotta salata, Parmesan, black quinoa and a dressing. I twas absolutely delicious! Radishes are seriously one of my new favorite things now.<br>* A lemon mousse of sorts, but savory: it was topped with fried onions, greens and other things. It wasn't our favorite, but the flavors were really good.<br>* Sugar snap peas, braised radishes in a lemony dressing - so good! The greens were so crisp and the flavors really bold<br>* Fried rice-ish dish<br>* Cheese course<br>* Deconstructed strawberry short cake with brown butter crumble, strawberries, basil mint ice cream and omg so good<br><br>Overall, our experience was great. The wines were so delicious with each course. The first and last course is what blew us away and something we'll remember for a really long time. The staff was so friendly and attentive to us with each course, explaining the dishes and the wines as well. <br><br>The only thing I can state is that it's a little expensive. It's $60/person and then add another $30 if you include wine. This seems expensive but I did a similar vegan tasting menu in Michigan which was $60/person (it was $45 plus $15 for wine) and the portion sizes were smaller and we only got 4-5 courses. This was totally worth it for almost $100/person: you get full size portions, six courses and wines. Make sure you also make a reservation if you can. We got there early but our reservation was for 9pm! so this place must really be happening.<br><br>I really don't have a bad thing to say about this place! I want to come back here to try their regular menu or brunch sometime soon! Definitely stop in if you're in Chicago :)", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/CRxaYPAy5h7EB_-a4G_Nyw/348s.jpg", "caption": "Six course vegetarian tasting menu Course 4: sugar snap peas, radishes, and other vegetables"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/1zrJeSIe5dCHrO4LG4sOiQ/168s.jpg", "caption": "Storefront"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/-3U2y8C476p1uksaLgxe7w/168s.jpg", "caption": "Six course vegetarian tasting menu Course 6: deconstructed strawberry shortcake: strawberries, basil mint ice cream and brown butter crumble"}]}}, {"review": {"des": "Oh. My. Gosh. This place is unbelievable!!! If you are scared away by the long wait, which there will be, find some way to occupy yourself because it's worth it! We were told we would have to wait 80 minutes, which was okay because we wanted to walk around the farmers market. We ended up having to wait almost two hours, which was NOT ideal. <br><br>When we were finally seated, our waitress came quickly and our food didn't take too long. Everyone's food was fantastic-- we all got something different and we're all pleased. We went for brunch, but got mostly lunch items. Would definitely go back!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/FVICDzpZSBVWrdcrBHkiFA/348s.jpg", "caption": "Ginger brioche French toast"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/IM9W_aSIRCHCjvI8rJiNBw/168s.jpg", "caption": "Charred tomatoes from special menu"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ByD9F0oFv_eGXbj-G7kJgg/168s.jpg", "caption": "Grain bowl"}]}}, {"review": {"des": "This review is for dessert only. This was our first time here and I can see why the place is so popular. It was packed when we arrived at about 745pm and we sat at the counter in back. Service was lovely. It was a bit loud inside but very \"hip\".<br><br>Food:<br>- Strawberries and Mint 5/5. It was lovely, light, and refreshing. Strawberries, graham cracker crumbs, sugar flakes, and mint. Perfect dessert after a big meal.<br>- Chocolate pudding 3/5. It was tasty but nothing special. Yummy chocolate pudding, some sort of sorbet, chocolate flakes, and annoying leaves.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/VMlJYGrpMREKKpnlACMtEw/168s.jpg", "caption": "Strawberries and mint - Light and delicious. Perfect after a big meal."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/xY0ZRQH7VCcL38GBa-W-IA/168s.jpg", "caption": "Chocolate pudding - tasty but nothing special"}]}}, {"review": {"des": "We went here for a late lunch after watching Black panther at the Logan theater and it really hit the spot. I got the turkey sandwich and my boyfriend got a pasta dish. They have a fairly extensive drink list and we got a delicious bottle of saison. The pasta dish was good but not great. My sandwich on the other hand was amazing. It came on great bread, and was so moist. Turkey can be so dry but the avocado, tomato and aoili kept the sandwich moist and delicious. It was also such a great atmosphere. We were at a small table with a view of Logan square on a beautiful snowy day. Our service was a bit slow at the end but everyone was very friendly.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/VfCMWqUMdu2XOWc_JgdilA/168s.jpg", "caption": "Turkey sandwich. So moist. So good"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Wyss4TplWKgEK88UfJAqAw/168s.jpg", "caption": "Bottle of crisp delicious saison. Not too citrusy"}]}}, {"review": {"des": "Best French toast I've ever had!! It had blueberry blackberrys and raspberrys! The bread was not hard or too soggy, but just the right amount!", "pics": null}}, {"review": {"des": "Great food!! Lots of veggie options plus a great hipster vibe. Waiters were very accommodating", "pics": null}}, {"review": {"des": "One of the best brunches in Chicago. You might have to wait in line on sundays. Tasty and creative.", "pics": null}}, {"review": {"des": "Food: top-notch. The freshness of the farm-to-table ingredient selections really shines through each dish. I started off with the cinnamon bun with was so delectably soft it melted like warm, cinnamon-y butter in my mouth. Then I split both the truffle omelet as well as the fried chicken & biscuits. I must say the chicken & biscuits was the winner of the meal. The biscuits were flaky with just the right touch of salt, the eggs poached to perfection, and the chicken moist with a crunchy, umami fried coating. Topping off the omelet was ample black truffle shavings, which I appreciated. However, the egg batter was airy with a smooth consistency. I would have preferred a greater variety of texture and denser omelet.<br><br>Service: This place was packed for brunch on a Saturday morning (for obvious reasons!), but I managed to get two spots at the bar without much wait. The waiters were attentive and the food was delivered in a prompt fashion.<br><br>Vibe: Super hip. Like hipster meets hip. The bar looked high-end while the surrounding décor was more eclectic in a shabby chic meets farm kinda way. I liked it.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/zCl4RXgEOIRokTleA_i1aA/348s.jpg", "caption": "Cinnamon roll, worth it!!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/2AWOpAcC2q1ruTAgl2uvSA/168s.jpg", "caption": "Fried chicken & biscuits, highlight of the meal"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/xAOyMfDdP2H5yNyHAxtVyg/168s.jpg", "caption": "Truffle omelet, could be a bit more substantial"}]}}, {"review": {"des": "4.5 stars, or 4.75 stars...is that a thing? Prior to coming I had heard nothing but good things about this place, so I had to try it. They have a really cute set up. There is patio seating, their front room which looks more modern and their back room which is had a small stand up piano, and some more window seating. The hostess seated me and I sat for a little waiting for my friend and realized the AC was hitting right at our table, I asked to be reseated and they did so right away with a smile on their face!<br><br>We ordered the Classic Lula Breakfast Burrito and Lula '99 Turkey Sandwich. I enjoyed the burrito more than the sandwich. The egg in the burrito was nice and fluffy and the mesh of the avocado, potatoes, and tomatoes was great! The sandwich and burrito actually had similar ingredients inside - avocado, tomato, and onion. However, the bread was a bit too hard and I wasn't a fan of the sprouts. The reason I knocked down a tad is because nothing on the menu was really appealing aside from the two items that we ordered, and nothing really stuck out to me or was super special, as I feel like you can get these two items elsewhere. Would I be open to coming back again, sure. But would I ever crave it? Unfortunately, probably not.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/vZ_QLBRt3KEaBNdmYjBG2Q/168s.jpg", "caption": "Lula '99 Turkey Sandwich"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/EF9y8_0A27_bKN4mHZZL4g/168s.jpg", "caption": "Classic Lula Breakfast Burrito"}]}}, {"review": {"des": "If you are trying to brunch here, get ready to wait. (Luckily there is a super cute bookstore on the same block) <br><br>This cafe is SO cute. It's crowded, and loud because everyone is trying to experience the cuteness. I got a breakfast wrap and loved it! Super light, left feeling great.", "pics": null}}, {"review": {"des": "Ugh. Continues to be a moment of culinary celestial delight.<br><br>They remain inventive, chic, warm and the place attracts a cool, diverse and multigenerational clientele. A perennial favorite.", "pics": null}}, {"review": {"des": "I get nervous about hyped restaurants. They're often set up for failure from the get go. Your hopes are high, your hangry levels are off the charts from the hour wait, and by the time you sit down the breakfast tastes like every other breakfast in town. In all fairness, it's not easy to make eggs special.<br><br>Lula surpassed all overhyped expectations and soared into super breakfast status. When they say they are known for fresh ingredients, they aren't kidding. <br><br>Our summer menu was chalk full of fresh rhubarb. Rhubarb bellini. Rhubarb and strawberry yogurt with chamomile granola. HEAVEN. <br><br>Their 'sandwich series' pork shoulder and egg breakfast sandwich was out of control. Fresh and flavorful​ but never overpowering. So satisfying.<br><br>I've never felt so passionately about brunch before. Come to Lula. You will not regret it.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/vfL245sC3t62WREiZ15xCw/168s.jpg", "caption": "Yogurt and granola with strawberry and rhubarb. In the back: bee sting"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/MfCyj0G5LpsLoMveaq3MXw/168s.jpg", "caption": "Sandwich series with pork shoulder and egg"}]}}, {"review": {"des": "My wife and I like to go out to breakfast at least once a week. Our only stipulation is to try new places every week! <br><br>This week we had the pleasure of enjoying LuLa Cafe. Located just to the right of the Illinois Centennial Monument in Logan Square Lula Cafe offers an unsophisticated dining experience. <br><br>My wife ordered the Classic LuLa Breakfast Burrito a seamless blend of avocado, onion, green chile, tomato, potato, organic eggs, and cheddar. I took a strategic approach and ordered the buttermilk pancakes! <br><br>Exceptional restaurant! <br><br>1/18/18", "pics": null}}, {"review": {"des": "Was pretty excited to come as I heard great things. Great service and vibe but food wise nothing really special. <br><br>Maybe because I went for brunch? And brunch is always just meh.<br><br>I had le royale sandwich. Toast wasn't great. The ingredients didn't come together for me. Side salad was meh.<br><br>Had French toast. This was ok. The crumble was too hard. Nothing memorable.", "pics": null}}, {"review": {"des": "My friend, fiancée, and I waited like 45 min to eat here and I hate waiting but it was really good. I had the tofu scramble and added a eggs to it. So good! The coffee hit the spot, food arrived quick, staff was nice and didn't push us out despite other people waiting. I'd love to return!", "pics": null}}, {"review": {"des": "Cool, boho, funky vibe, and perfect for a sunny and lazy Saturday afternoon! Late lunch included beet bruschetta and a turkey sandwich. But we're so fresh, the bruschetta was a nice balance of sweet and creamy. The bread, same for both dishes, sealed the deal.  <br>Cocktails, Blue Line (how did they do that?) and Yes, And? Were well crafted and beautiful presented. <br>The place was full, and I have a feeling we got lucky to not have to wait for a table. We will be back, Lula!", "pics": null}}, {"review": {"des": "The food: 4/5. I finally got a chance to try one of the most popular places in Logan and I'd go back to try their dinner or most likely the vegetarian tasting menu. We only had a spinach endive salad and baked feta, both were good although not amazing. The salad could use more endive and less dressing, and the feta could use less oil. The drinks were great. <br><br>The service: 4/5. We were seated right away and the service was fast. <br><br>Overall: 4/5. I'd go back to try their dinner.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/BewsLqY0J409t0Ynl5_H0A/168s.jpg", "caption": "Baked feta"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/JIx5FxbYkew_DoFo2LU9pA/168s.jpg", "caption": "Spinach endive salad"}]}}, {"review": {"des": "I was in town with a few friends and this place happened to be near our Airbnb. It had good reviews so we just wanted to see what the hype was about...and man did it live upto it.<br><br>We went for breakfast and the food was on point. Between us, we ordered some breakfast burritos (a must have) and a quesadilla. Food came quickly and tasted amazing. Service was also excellent. The server was super friendly and answered our questions. Ambiance was nice; it was a pleasant place for brunch.<br><br>I would highly recommend this place. And if you go there, get the breakfast burrito!", "pics": null}}, {"review": {"des": "Been coming here for years, most recently with the Missus a couple of weeks ago. We had lunch. Food here is always tasty. Portions aren't oversized, but never leave hungry. Service is always impeccable. I don't think we'd bring the boy in here, as it's not super roomy on the older side of the restaurant, though newer side with the big bar has a nice airy feel. Last time we were there I saw older folk sitting next to bearded hipster types sitting next to some Mennonite or Amish folks. And everyone seemed to be enjoying their grub. All of these newer spots swing into the area trying for the brass ring of local spot that leans forward without being trendy. But there's only one Lula.", "pics": null}}, {"review": {"des": "Came here on a Sunday and waited for one hour for a table for five. Definitely a pretty long wait, and the restaurant gets pretty crowded with people standing around waiting, but you can order drinks and pastries at the bar while waiting. I have been really pumped to try out this place, and although the food was not exceptional, they did not disappoint. I got the smoked trout scramble (although I think they used salmon instead of trout) - pillowy, rich and creamy, the scrambled eggs go really well with the toasts, and the side of potatoes are generously salted, fried to a beautiful solid crunch. I was slightly disappointed with the zucchini bread french toast - the bread itself was pretty bland, but the toppings of sherry pastry cream and candied citrus were lovely. The place was bustling as we headed out - so definitely expect to wait if you're coming for brunch!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/HtXy0wvYRB0IsM3USdYvWw/348s.jpg", "caption": "Trout scramble"}]}}, {"review": {"des": "Made a reservation because my vegetarian friend was visiting from out of town and heard great things about Lula Cafe. We ordered about 6-7 dishes between 5 people and we left feeling VERY full. Everything we got was incredibly interesting. Eclectic mix of flavors... like cinnamon in a butter pasta... is that common?? I hadn't tried to before but I thought it was ahhhmazing. <br><br>Great service. They changed the silverware and napkins between every course, which I didn't think was necessary, but was much appreciated. It was really packed for being there on a random weeknight, so I'll definitely make a reservation and be back.", "pics": null}}, {"review": {"des": "Cute little place, you can taste the quality in the ingredients. The drinks are playful, the menu is rustic. Would definitely go back.", "pics": null}}, {"review": {"des": "Food was decent. Service from our waitress sucked. It wasn't that busy either. They forgot my cocktail after I finished my meal. Not sure if we'll go back.", "pics": null}}, {"review": {"des": "Lula Cafe is a casual spot I went to with a few girlfriends for lunch on a weekday. I was on my lunch break so they ordered ahead of time for me. I ordered the cauliflower quesadillas which were SO good! I love the Brussels sprouts and the beet salad. The beet salad had the perfect amount of salt. <br><br>We sat near the door on a colder day and you couldn't even feel a slight breeze! BRAVO to the cafe for being able to control that so well in Chicago. <br><br>There were a lot of really attentive people but it took a while to get something done. I never really knew who our server was so I never asked for coffee. That's the ONLY reason I gave 4 stars based on experience. Ambiance and food were 5 stars!!", "pics": null}}, {"review": {"des": "Can only say I just had the best breakfast burrito I've ever had. Nothing flashy. Just quality, fresh ingredients. Perfectly cooked and put together in a soft tortilla. It's all I needed to start the day. <br><br>Service was polite and fast. Great place.", "pics": null}}, {"review": {"des": "Cute cafe with great food!! They don't take reservations for brunch and it seems to be kid friendly as there always seem to be families when we go for brunch. <br><br>Ambiance: It's a bit loud and snug inside. A lot of natural light gets in through the windows which makes it great for a sunny afternoon and makes the place look bigger.<br><br>Food: Chicken and biscuits, baked french feta, house pastries and coffee brioche french toast<br><br>Chicken and biscuits: Definitely a more \"refreshing\" chicken and biscuits than I'm accustomed to. I finished all of it and didn't feel disgustingly full. The chicken to biscuits ratio was a bit small, but the poached egg on top definitely made up for it. The black peppered gravy was really good and not too heavy. It was either the peanuts or the bacon that added a little crunch to the dish. Loved the kale and the candied yams that were super soft. All around great dish and highly reccomend. <br><br>Baked French Feta: Great starter! The jalepeno flavor in the oil is very subtle as is the basil. The bread was presoaked with some oil, but still crispy. But that cheese though MMMMMM. So good, but don't take my word for it, just get it. <br><br>Coffee Brioche French Toast: I think I overheard this was recently added to the menu. Everything from the whipped topping, to the coffee sauce wow. The french toast was bursting with flavor, soft, but not drenched and the frosted pecans added a contrasting texture. It didn't stand a chance with our forks!<br><br>House pastries: We got all four because well why not? What's $4 more?! The boston brown bread was a mix of sweet and salty with chunks of something sweet, maybe raisins? The sourdough cinnamon roll was really good, nice and soft, probably my fav of the four. The spelt cake was like a crumbly coffee cake, not a fsvorite with everyone, but I liked it. And the Tuscan sweet bun was good as well. <br><br>As far as drinks go their mimosas were really good and their coffee!<br><br>Service: Was amazing! They were very attentive and super chill and nice!<br><br>Highly reccomend!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/-22cxdlCUY8fJibIfe9cXg/348s.jpg", "caption": "We brunch hard"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/w-ET9DLbHVmzeskhW2-sow/168s.jpg", "caption": "House pastries and baked french feta"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/PP3k5ajAakLHgtw_HZmyOA/168s.jpg", "caption": "Chicken and biscuits"}]}}, {"review": {"des": "I was pumped up about this place since my friend told me everything is good at this place. Went on a Thursday night; it wasn't busy. The server was really nice. Drinks were ok. However, I am giving 3 stars rating due to food. We ordered baked French feta, which comes with grilled bread. It was mediocre. I've had better feta. Charred eggplant (daily menu)- tastes really similar to a hummus that is eggplant flavor. Roasted honeynut squash (daily menu)- the nuts were tasty. The squash would've tasted better if it was cooked a little bit more. <br>Gunthorp Farm Pan Roasted Chicken comes with potatoes. The potatoes were the best part. Chicken was so salty that I can \"chew\" the sea salt. I didn't like the chicken at all! <br>I went on October 26. Overall, everything tasted like \"fall season\". I'm not a big fan on fall flavors so my review may be biased. The best part was cream brulee which tasted like fall flavor, too, but overall, was the best dish from all the ones mentioned above. <br>Restaurant also has a distinctive bar smell as soon as you walk in.", "pics": null}}, {"review": {"des": "Super hipster spot. A little pricey for the quantity of the food, but the quality is great.", "pics": null}}, {"review": {"des": "I love this restaurant. It is my favorite restaurant in the city, hands down . The service is impeccable. The food and beverage offerings are like none other. Delicious, unique pairings, beautifully presented, not affected, just lovely. It's got a hipster vibe but it isn't unwelcoming or pretentious. Years ago I was inhabiting this place for weekly brunch with friends. Now I live in Evanston and I still come to Logan Square numerous times a year to go to Lula. Pure perfection!", "pics": null}}, {"review": {"des": "Lula was precious. The decor, the ambiance, the vibe, the food...everything about it was great. It's been sitting in my bookmarks list for quite sometime now so I made sure to cross it off. Went for dinner last week and sat outside. It was full of personality outside too. The only bad thing was the occasional sewage smell. But that's chicago, you can't Lula for that. We had the campanelle, the quesadilla and the goat cheese/beet bruschetta. The waiter raved about the campanelle but it was okay. It was not awful but it was a forgettable dish. The quesadilla was wow but the bruschetta was probably one of my favorite thing to eat ever. It has all things I love put in one plate. Bread, goat cheese, beets, nuts and kale. Heaven in the mouth. <br>I will return for sure, very soon!", "pics": null}}, {"review": {"des": "I have no idea why people rave about lula so much? It was just very busy and very average.", "pics": null}}, {"review": {"des": "What a delicious evening of passed plates and conversation. <br><br>6 adults and 2 kids... yup kids, it is even a good choice for the younger generation...  ordered a slew of plates and passed them around to get the best representation of the flavours offered by the creative kitchen. It is hard to pick a few to rave about, plus with a revolving menu what's the point. With a sustainable sourced menu and a knowledgeable staff it was a great experience. <br><br>I get the feeling that Lula will be visited again.", "pics": null}}, {"review": {"des": "Just had an excellent dinner here! We were seated fairly quick on a Thursday evening at the chef's table. Our server was very pleasant, and we stared with a couple beers. The ambiance of the restaurant is romantic, but still casual. It's dimly lit with candles at the table, but still has a relaxed vibe to it. I ordered the quesadilla with a side of the pickled beets. Might sound random, but I love pickled beets so I get excited if I see it on a menu! Both my dishes were fantastic! I loved every bite of the quesadilla! We finished with the carrot cake, which was good as well. Very much enjoyed my time here, would definitely recommend to anyone looking for dinner in the neighborhood!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/RYUgDH1-l9TaJGn8MZeteg/168s.jpg", "caption": "Quesadilla & a side of pickled beets"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/qahuWWqkxYHskrE2djckeQ/168s.jpg", "caption": "Carrot cake"}]}}, {"review": {"des": "I don't do brunch much anymore because I can't stand no-reservation spots. But, we decided to go for it one weekend at Lula and had about an hour wait for two people. The food was delicious but took forever so they gave us our drinks free and came over to apologize, which I appreciated. I like what they do here, farm to table style and seasonal menus. Next time we will come for dinner, when you can actually reserve a table.", "pics": null}}, {"review": {"des": "Overrated AF! I feel robbed after paying $15 for a basic turkey sandwich. The toilet paper on the walls fit this place perfectly because the food reminds me of a baby's diaper. Also thanks for the sewer water.", "pics": null}}, {"review": {"des": "Lula Cafe is divine. We chose this spot based on its good reviews and close proximity to our Logan Square Airbnb. A bit of a wait for Saturday brunch - but that's to be expected for somewhere this delicious. The outdoor seating was lovely and the service was superb. The food was creative and flavorful! Glad we stopped here during our stay!", "pics": null}}, {"review": {"des": "The service is very slow during busy hours. The food was meh. Nothing to write home about but it was about $45 for two ppl to have breakfast plus tip. You are paying for the hip ambiance but it ends there", "pics": null}}, {"review": {"des": "First time here, it was a no go for me. The menu is is very limited. Ordered the quesadillas and I was disappointed. Dry wheat thins with a minimal spread of ricotta inside and cheese sprinkled on top. Didn't even finish my food because of how unappetizing it was. Ordered Giordano's right after we left.", "pics": null}}, {"review": {"des": "Absolutely delicious brunch spot and there is usually a wait for good reason! The staff are all very friendly and attentive, the menu is very selective but very high quality! The atmosphere inside invited conversation over fantastic food fare!<br><br>We ordered the Tofu Scramble, Lake Trout Scramble, and their freshly squeezed orange juice.<br><br>Both of the scrambles were exquisite! Surprisingly flavorful for both! The Tofu Scramble had a more fresh bite as there were microgreens sprinkled on top for that added crunch. The Lake Trout Scramble was very reminiscent of smoked salmon. The potatoes that came with the Lake Trout Scramble were perfectly roasted. The skin on the outside was crunchy and salty, the inside was tender. Even the bread with the Scramble was delicious and paired with their home made jam made an irresistible combination.  <br><br>The orange juice was also very fresh and had pulp in it, which was to out liking.<br><br>Definitely an amazing brunch spot to try out if you are in the area!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/15tZ2BLptHSWLGh8K8sojw/348s.jpg", "caption": "Lake Trout Scramble"}]}}, {"review": {"des": "Went here on a Saturday night and we didn't get a reservation till 9pm. The ambience was very nice and the service was awesome but unfortunately the food didn't live up to our expectations. My wife got the 6 course vegetarian meal which was just ok. The soup and dessert were probably the best part of her meal. I got the noodles which were definitely above average. I would come again but definitely not my favorite place I've been to in the area.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/2OjHq806FTmPGwBbcLpcSA/348s.jpg", "caption": "Feta on Garlic bread!"}]}}, {"review": {"des": "Ate brunch here on a Saturday. Arrived 30 min after they opened and was still a 15-20 min wait. (There is always a line). Found a seat at the bar, so was able to bypass the wait. We split the burrito and the Brussel sprouts. The burrito was actually lacking a bit of flavor, needed some hot sauce to mask the blandness. The Brussel sprouts were fantastic, carmelized onions with prosciutto and cheese. Flavor was perfect and tasty. I'm giving it a 4 star with the benefit of the doubt that maybe the burrito is just not their best dish. The other food that came out looked great and we will be back to try something new.", "pics": null}}, {"review": {"des": "Although the wait for three people was 45 minutes, it's just a short and sweet review. It was the best breakfast burrito I've ever had in my life. I'm steal dreaming about it. I added bacon into it, and it just paired perfectly with the eggs and potatoes. I need it again!!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/-F9xx9fJUo-L3VB3wmcFIA/348s.jpg", "caption": "Burrito action"}]}}, {"review": {"des": "We need more places like Lula that makes vegetables taste like magic. Maybe we could all be less meat-obsessed! <br><br>I ordered a seasonal cucumber salad and it was heavenly. It was a bowl of cucumber! Just cucumber! But the light dressing and herbs and flowers made me feel like I was eating a garden. <br><br>My husband ordered a bowl of tomato and grits and I couldn't stop eating it. Loved the amazingly rich flavors and again, just how fresh everything tasted. <br><br>We ended the meal with their berry gelato and ginger ice cream. Both the best I've ever had.<br><br>We usually feel slightly bloated after a meal even if it's in a nice restaurant because of our mild intolerance to a few things. We didn't feel any of that after our meal even with dessert. And with their space expansion we didn't have to wait at all for a table of two at 1pm on a Sunday. Thumbs up!", "pics": null}}, {"review": {"des": "Really great seasonal food. All the dishes felt very fresh and made of in-season ingredients. The cocktails were amazing and very generous. <br>Restaurant is also conveniently located next to a book store you can browse if the wait is too long. <br><br>Will for sure be going back!", "pics": null}}, {"review": {"des": "I'm a tourist in Chicago and was looking for a great place for Sunday brunch, and found this place thanks to Yelp -- and couldn't be more glad.  <br><br>My husband and I took a cab there from the Loop and felt like we were back where we used to live in Bushwick, Brooklyn -- cute restaurants in the middle of an industrial area; filled with hipsters. <br><br>We had to wait a bit; but not too long -- and the hostess was great about coming out to get everyone when their tables were ready.  I had the best Bloody Mary I have ever tasted followed by fresh, electric, delicious food with unique flavors.  There is a reason this place was packed. <br><br>The menu appears to cater to a vegetarian crowd, while still including a few dishes with meet.  They certainly accommodated my husband when he asked for a side of bacon.  I'd go back in a second and can't wait to return to Chicago to try this place for dinner.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/3u_GRqjlI2WYYhV9RKGh6w/348s.jpg", "caption": "The packed Sunday brunch crowd."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/1m9534sfhbn4mo05UEqocw/168s.jpg", "caption": "Smoked salmon with fresh tomatoes and cucumbers."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/3DwkKNFsdRGKonQpa0Q8uw/168s.jpg", "caption": "Slaw -- beyond good."}]}}, {"review": {"des": "Lula Café is a really great little place. The peanut butter thai sandwich was excellent and filled with exotic flavors. The chicken was excellent too. Quesadillas were super great too, I just wish there was more of them. The coffee and espresso are nice and strong. We also tried a few desserts and they were great. I'd definitely go back again to try some of the other dishes.", "pics": null}}, {"review": {"des": "I'm very torn that I can't give Lula 5 stars because I wasn't totally impressed by the food. We ordered the burrito, shrimp po boy, and beet bruschetta. The food like looked amazing but it didn't wow me. Beet bruschetta was very plain. It just tasted like it could use more seasoning. Burrito pretty good and it was very hardy. Po boy was my favorite because the bread was perfectly toasted and it wasn't heavy. The special Lula green tea blend was great though and we were able to get a water refill for it. The service was absolutely top notch. We never felt rushed during peak brunch hours--5 stars for that, but I can't say I would ever come back for the food.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ZflAO39eDD7MlO6WEw0uWQ/168s.jpg", "caption": "Top: breakfast burrito, bottom: shrimp po boy"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/DF2_H5pxoijLYERPccE9Ng/168s.jpg", "caption": "Beet bruschetta"}]}}, {"review": {"des": "I went here for brunch with my roommate on a Saturday. The wait wasn't that bad at prime brunch time, maybe about 15 minutes. <br><br>It's a cute setting, and a decent menu. I wish they had more cafe drink options though. I got the breakfast burrito, which was amazing, but so heavy and rich. Which I'm sure some people would like, but I was stuffed after just eating one half. Not necessarily a bad thing, but not something I would want to eat as leftovers since it has egg in it. It was good but not sure if I'd go back. Deff worth trying out at least once though.", "pics": null}}, {"review": {"des": "Wait wouldn't have been that long but our entire party didn't arrive until an hour later. I would recommend getting there around 10 am on a weekend to get seated right away/pretty quickly.<br><br>I ordered the two vegetarian dishes that stood out:<br><br>the breakfast burrito - i love breakfast burritos and this one was one of the better ones i've had! Big pieces of scrambled egg and avocado made this burrito so good. ask for their hot sauce too, it goes great on the breakfast burrito.<br><br>the tofu bowl - i forgot the real name of the dish but this was amazing, really good flavor. <br><br>If i had to pick one i'd probably pick the tofu bowl but if you can swing it, get both because they are both amazing <br><br>Decor was really cute, they have tiny flowers on every table.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/yOJ81GWyp2GmtAX4ih6USA/348s.jpg", "caption": "breakfast burrito"}]}}, {"review": {"des": "I like the philosophy of the place, which is numero uno to me. Friendly host to greet you as you enter the establishment. Great food choices that are morally correct. I like that the employees aren't dressed in horrible matching outfits and the full bar has some great concoctions. <br><br>We started with the quesadillas for an appetizer. I had the yummy turkey club with bacon, avocado, sprouts, tomatoes and some more great toppings. My drink was very refreshing, made with tequila and molasses. If you like fresh, good tasting and satisfying I recommend everything I ordered.", "pics": null}}, {"review": {"des": "Wonderful selection of pastries, salads, appetizers and entree's. This morning we tried the pastries. They were lightly sweet with blend of subtle flavors standing out with each the blueberry was my favorite, but contended by the peach pistachio. I had the summer omelette. Lovely! Beautifully wrapped in egg, decorated wit scallions and capers served with watercress greens. The service and attentiveness was exceptional. I highly recommend this restaurant for food service and ambiance. Well done!", "pics": null}}, {"review": {"des": "It's hard to believe this was our first time but it won't be our last.  Everything on the menu was interesting and original. We ate all vegetarian fare and found everything seasoned perfectly with great textures and flavor. The wait staff couldn't have been nicer and even picked one of our favorite items. Overall this place just makes me happy. <br>5 stars.", "pics": null}}, {"review": {"des": "Absolutely delicious seasonal fair thoughtfully presented in a pleasant, artful space with great atmosphere. Friendly and rapid service. Some of the best food and dining experience in Chicago or anywhere.", "pics": null}}, {"review": {"des": "I would've rated this Gastro café a four-star eating experience for creative cuisine, value, and down to earth service, except that the loud disco-like music blaring in the dining room and some overzealous bussing, tarnished experience.<br><br>My recommendation to management would be to step outside the conventional new mold of screaming loud music over dinner, and try one week of exquisite dinner jazz such as miles Davis, Bill Evans, Ahmad Jamal, Tony Jobim, Pat Matheny and John Coltrane ballads.  You might just find yourself with lines out the door!<br><br>We were a party of seven and enjoyed a variety of appetizers, salads, and entrée options. Three of us ordered the chicken dish and it did not disappoint.  <br><br>There is decent value for the level of cooking and food quality in a very informal setting. The wine list unfortunately is both mediocre and high priced. There is scarcely a bottle on the wine list below $60 once you factor combined 25% tax and tip.<br>Maybe enjoy a bottle of beer with your dinner instead.", "pics": null}}, {"review": {"des": "Not a part of town I would typically dine at but what the heck, it was perfect location for a girls night out/ friends b'day. The restaurant was packed for a Monday night and glad we had a reservation. Was a really big group 13+ and the menu was prix fixe; had the b'day gals name printed on it, how cute?( I am a sucker for custom stuff)<br>I think to begin with our server John was a bit overwhelmed but as the evening progressed he was totally onboard with our looney, rowdy gang of selfie crazed gals :)  The restaurant served a glass of complimentary champagne and we felt we had to beg for our drink...also, the drinks menu came to the table much more than 1 hour into the evening which was a tad bit disappointing but the food more than made up for everything else.<br>Can I give 10 stars just for the food? Yes! I loved my endive salad, chicken and potatoes entrée and the carrot cake for dessert. Could smell the butter and deliciousness in every bite!! Will probably go back for brunch soon!!!", "pics": null}}, {"review": {"des": "After months of having this spot on my list I finally had the chance to visit on a Saturday afternoon (around 3pm). I expected a very long wait but was actually seated right away and outside! FYI they have blankets in case you get chilly.<br><br>Atmosphere- Lively and bustling, it's also in a really great area to shop and just walk around.<br><br>Service- Our food was at our table less than 10 mins after we ordered, I was surprised at how quickly everything was out. Very friendly waitress and quick delivery.<br><br>Food- so why the 3 stars? Perhaps my expectations were too high or I shouldn't have ordered the Tanaki sandwich. I need to come back for a second take! Don't get me wrong, the sandwich was good... the peanut butter gave it a nice taste but it didn't have the 5 star taste. My friend got the chickpea dish and she thought the same. The dishes tasted too much like something we had tried before. I will be returning to try their most popular dishes!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/v80FpZuYpNFJHXIHC5ra0g/348s.jpg", "caption": "The Tanika sandwich"}]}}, {"review": {"des": "This place has great vegetarian food and fantastic service. When we arrived for dinner with a reservation we were seated right away. The staff is patient, friendly and knowledgeable. The sequence of service was on point, food came out at a good pace for family style and our servers were professionals. They described our food to us, maintained our beverages and table without me even noticing, it was fine dining quality service. <br><br>Enough of me gushing about the service, now to the food. I felt the dishes were fun and had well balanced flavors,  paired with interesting textures. A couple of my favorites were their sunchoke dip, and the winter citrus salad. I wish I took some pics so I could remember and recreate some of what I ate but I was out with people and was too busy enjoying the food, company and service.", "pics": null}}]}