{"name": "lyfe-kitchen-chicago", "reviews": [{"review": {"des": "We came here on a Sunday afternoon and we chose this place because of the endless options especially for those with dietary restrictions! <br>I love this quick casual concept but still really healthy! You order at the counter and they bring the food to you. The food was quick and fast! <br><br>After contemplating with the variety of options, I decided to go with the chicken sandwich along with the orange mint chia drink. <br>The portion of the sandwich was perfect and delicious. And as for the chia drink, it lasted only about a minute. It was so delicious!! <br>The price of the menu is very reasonable considering the fact of organic and healthy ingredients used. <br>My vegan friend ordered the beet poke and she said it was 5 stars!!<br>I'll definitely have to come back to try the other items on the menu. <br><br>Oh and there's kombucha and beer on tap! They also offer happy hour with alcoholic beverages!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/WcGWcBeieQcCkApVFmiKYQ/168s.jpg", "caption": "Orange Mint Chia Drink"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/jDWnh83lA6xn-qhDVAn5dQ/168s.jpg", "caption": "Quinoa Chicken Bowl!"}]}}, {"review": {"des": "I can't count how many times I've walked past LYFE Kitchen but I finally got the chance to dine here this past weekend and I can tell ya it won't be my last time.<br><br>First off, lots of healthy breakfast & lunch items to choose from! After a hard time of deciding what to get, I settled on the quinoa crunch bowl + tofu and it was delicious! It comes with quinoa (obviously), arugula, beets, tomatoes, cucumber, avocado, and edamame hummus. It was a surprisingly very filling meal! I also had the ginger mint chia to drink and we shared a side of sweet potato fries. I had a sip of my orange ginger chia drink, which was also really good.<br><br>I will most certainly be back to try out the other items on the menu!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/I6J2S1yDc7OUv6FIEuCk-A/348s.jpg", "caption": "Grilled chicken & avocado"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/QR477dyp9EfGUBLqJlQy7Q/168s.jpg", "caption": "Beet poke"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ExlLuZF5TFg8qKC55BoFNQ/168s.jpg", "caption": "Quinoa crunch bowl"}]}}, {"review": {"des": "I really like Lyfe Kitchen.   When I say \"I want a burger\" for lunch it's a safe bet he's going to say \"Let's go to Lyfe Kitchen\".<br><br>Their farmhouse burger is very good, and the sweet potato fries are a perfect side (which we usually share and still don't finish).  I've had the fish tacos too and they were very good.  I have yet to try any of the entrees but the salmon and soba noodles is next on my list.  There are plenty of vegetarian and vegan options too. <br><br>I was kinda surprised to realize Lyfe Kitchen also serves alcohol, some wine, beer, or a cocktail with your healthy food is always a good idea.  Tried the Cure cocktail yesterday and it was very good.  <br><br>This is a counter service restaurant, you order at the counter and they bring your food to your table.  There is a decent amount of outdoor seating (weather permitting, of course).  <br><br>I'm officially adding Lyfe Kitchen to my list of favorite spots.", "pics": null}}, {"review": {"des": "Mediocre food. I had the farmhouse burger with a side of sweet potato fries. The patty was bland and lacked flavor and salt. I don't know how they make the fries - but they had char grill marks on them. Half were burned, the other half were chewy as if not thoroughly cooked. 3 stars for service and the organic factor.", "pics": null}}, {"review": {"des": "Against my wishes, I stumbled into LYFE Kitchen after a Sunday day party, BUT I am so glad I did. I was not in the mood for \"healthy food\" after a day of drinking, but it turned out great. I had the mahi mahi tacos, served with a side salad. There were two tacos, but they were huge, so fresh, and so good. <br><br>My friend had the buffalo cauliflower tacos, to which I was thinking...no thanks. But when I tried it - SO GOOD! <br><br>I would definitely come back and try other items on the menu.", "pics": null}}, {"review": {"des": "A nice little fast casual joint with a healthy kick. I wanted something along the healthy side when I visited Chicago and this place satisfied that craving. It's a little pricey for the portion sizes but not too bad (I guess that's what you get in a big city?). I was disappointed the espresso/coffee machine was down- 4 stars for that.", "pics": null}}, {"review": {"des": "I love the concept - healthy and tasty-looking food, counter ordering, food delivered to your table, water \"on draught,\" but I didn't love what I ordered on my first visit.  The pumpkin soup was a little too sweet for my tastes, and the sweet potato fries seemed undercooked.  I'd probably try other things next time.", "pics": null}}, {"review": {"des": "An EXCELLENT place for people with food allergies. Being gluten and lactose intolerant, I often have limited choices at restaurants. At LYFE Kitchen, I was able to eat a gluten free penne pasta dish with vegan cashew cream sauce, and there were many more great vegan and gluten free options.<br><br>This is a casual quick service place, where you order your food at the register, choose your own seating, and the food is brought out to you when it's ready. Great place for a quick and delicious meal!", "pics": null}}, {"review": {"des": "First, the decor is very inviting and chic. The employees were courteous as well. The menu is catered to the healthy crowd and gluten free/vegan friendly. I could see right into the kitchen and  everything appeared to be fresh and clean. I didn't try any of the lemonades, but other customers who were there told me they are really good. I enjoyed my salad; I appreciate the cashier recommending that I get an extra salad dressing, it probably would've been too dry with just one.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/g_6lhU3ukvW3bZCmCwP2vg/348s.jpg", "caption": "Kale Caesar Salad with chicken"}]}}, {"review": {"des": "The menu is sneaky big. When you walk in, you can't tell what is really on the menu without picking up a menu. The way it works is you order at the counter and they bring you your food using the proximity pagers. No beeping or noise making. <br><br>I had the bbq flatbread which is good. I had the hibiscus drink which was good. I ate lunch with a colleague and we spent about an hour chatting. It was not really busy during lunch hour. 11:30 it was dead.  The menu is pretty broad so I definitely have many options for future visits.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/2AKDywE3za9CfZXx-MEVlg/348s.jpg", "caption": "Main area"}]}}, {"review": {"des": "SO GOOD! Easily a culinary highlight of my trip to the Windy City last week. I ordered the salmon noodles and a charcoal lemonade. <br><br>Lemonade (3/5) - just fine, does not taste too different from a regular lemonade and the charcoal powder is not overwhelming. Found it a little strange that there weren't nutritional facts on the label hence feel like I downed 40g+ of sugar with this one.. might not get again, though it was fun to try!<br><br>Salmon (4/5) - oof, just delicious. The crusty exterior of the salmon was so satisfying to cut through with my fork. The salmon itself was soft and very, very tasty! The buckwheat noodles were very thin (I much prefer a thinner noodle to something thicker like soba - so it was perfect for me!) and I loved the sauce they were in - not quite like anything I've tried before. I would say the dish went a bit too heavy on the sauce but otherwise superb. <br><br>I ordered takeout at the lunch hour and it was packed so it was about a 10-15 min wait after ordering and a few minutes to wait to order (the app didn't accept payments from Canadian customers! Strange! And ritual didn't have the full menu) but I think it was worth it. <br><br>Loved it! Miss it already and in my sights for my next trip to Chicago in two weeks :)", "pics": null}}, {"review": {"des": "This place was great!! Such a great variety of food options. They cater to food allergies and various food diets/preferences. The staff was very welcoming, friendly, and helpful. I got the fish tacos with a side salad, they were delicious! Everything tasted so fresh. They also have a neat variety of drink options. I got the ginger pomegranate lemonade, it was great. The decor and atmosphere was wonderful!!", "pics": null}}, {"review": {"des": "This place has a decent amount of vegetarian/vegan options, but portions are small for what you're paying. <br><br>I had a red curry bowl and a kale banana smoothie. The red curry bowl was good, but unless you add protein to it, it will not fill you up. <br><br>The kale smoothie was okay, a bit odd at first because you'd expect a kale banana smoothie to be creamy and sweet, but their kale smoothie is sweet and tangy because of the apple/lemon juice. There was a ball at the bottom of my smoothie. Not sure what it was, but I'm assuming it's part of the drink?", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/lM31K6fKHyctLEu1EjP1Vg/168s.jpg", "caption": "Kale Banana Smoothie"}]}}, {"review": {"des": "I had the buffalo chicken salad and chicken tortilla soup. I enjoyed both items a lot and this time I was full. I feel like the salad was bigger this time. <br><br>I wish the chicken tortilla soup had tortillas to put in the soup. <br><br>When I picked up my food it took awhile for somebody to help me even though they had people available. I recommend calling in to order your food as a soup on the side is 3.50 instead of 4.50.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/7M8qrTgkF-bEu8GiqN-S1Q/348s.jpg", "caption": "Buffalo chicken salad and chicken tortilla soup"}]}}, {"review": {"des": "Had the grilled chicken sandwich w/ side salad. Food was very fresh and affordable. Food arrived at my table in 5 min. I'll definitely be back.", "pics": null}}, {"review": {"des": "After a weekend of indulging in the Chicago food scene, I was in need of something healthy for dinner, but something a little more substantial than a salad. I was working at a coffee shop across the street from LYFE, so I decided to wander in to see if it did the trick. Spoiler alert: it did!<br><br>This place is pretty low-drama: you order at the counter, they give you a number, and then they bring out your food. There was plenty of seating on a chilly Sunday night, and I loved the amount of choices on their dinner menu. I ended up ordering the crispy baked chicken & brussels, and wow was it good! The chicken was perfectly done, and came alongside brussels sprouts, butternut squash, dried cranberries, a sweet corn puree, and a dijon vinaigrette. It was filling, satisfying, and still light at the same time.<br><br>One of the awesome employees came by and gave me a chocolate chip cookie to go. He obviously didn't get the healthy memo, but let's face it, I still ate it (and it was great.) I would definitely stop by LYFE again when I need a quick, easy, and healthy meal.", "pics": null}}, {"review": {"des": "My husband and I checked out LYFE Kitchen on our first night staying in Chicago. I found it by searching for vegan restaurants in downtown Chicago. They have plenty of vegan and non-vegan options. You order at the counter, they give you a number to put on your table, and then they bring your food out to you. They offer a variety of alcoholic beverages including beer, wine, and cocktails. Our food came out quickly and the staff were friendly. The buffalo cauliflower tacos were my favorite. The sweet corn chowder was also very good. My husband had the beyond burger which he said was just OK, but not great. Overall, we liked LYFE and would definitely come back.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/0YevXl6wP2GgbiAjF4rH5A/348s.jpg", "caption": "Chips and guacamole"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/UgFEzr8jLCtvD5Ls5MarIA/168s.jpg", "caption": "Chocolate pomegranate parfait"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/zZOEjwWmQ5D0ONklO8jqjg/168s.jpg", "caption": "Buffalo cauliflower tacos"}]}}, {"review": {"des": "LYFE Kitchen has a healthy, fast casual vibe, and is a popular lunch spot among some of my coworkers. I think their baked sweet potato fries with garlic parmesan and chipotle aioli is delicious, but their roasted salmon and soba is more somewhere between decent and good. For $16.50 it feels way too expensive to only be somewhat good, and I've had their fish tacos (mahi mahi, chayote slaw, avocado, cilantro, green onion, etc.) which are also just okay. I don't see myself becoming a lunch regular here because the prices are just too high for food that just isn't that good. I think I've ordered their poke for dinner during a late night at work, and I've just had much better poke for much less money. It's not good, and doesn't feel as delicious as legit poke places.", "pics": null}}, {"review": {"des": "Fantastic gluten-free and dairy-free options. I had a roasted mushroom soup that I'm still dreaming of weeks later. Creative menu. Great product. Friendly service.", "pics": null}}, {"review": {"des": "Vegan time baby! lmao <br><br>Service: Check<br>Freshness: Check<br>Taste (Sandwich): Check<br>Price: Check<br>Smoothie: 2x Check<br><br>Bingo Chicago! <br>I might go to the NYC branch next time :D", "pics": null}}, {"review": {"des": "Came here looking for something a little lighter for lunch, and was not disappointed! <br><br>Food: 5/5 - Got the ahi tuna quinoa bowl with avocado, which was fresh and flavorful. I rarely eat healthy when I go out because I feel like \"healthy food\" is just never as satisfying -- but this was really good and I would definitely order it again!<br>Service: 5/5 - The ordering process was easy (order at counter, seat yourself, then the food is brought to you), the food came out quickly, and the staff was frequently clearing away emptied dishes from tables, keeping the place spotless.<br>Atmosphere: 5/5 - Spacious, tons of tables and light. It was a nice place to get a little bit of work/studying done too.<br>Value: 4/5<br><br>Overall: Will come back here next time I'm in town! Delicious, healthy food.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/mKcaIYUai6BXXzdfr1sgBg/348s.jpg", "caption": "Ahi tuna poke bowl with avocado."}]}}, {"review": {"des": "LYFE kitchen has a good selection of choices, some vegan/vegetarian others carnivore.  What they all share is good flavor, enticing presentation, and are reasonably healthy (how healthy can sweet potato fries really be?).<br><br>The quinoa crunch salad is tasty and well seasoned.  The cauliflower acts were less interesting (the cashier recommended them over the cauliflower and chickpea, the latter might have been better).  They also serve the beyond burger, which may fri nd had and said was good. From last experience, the rd curry bowl is also good.<br><br>Prices are just a smidge above reasonable, but not out of bounds.<br><br>The kombucha - from Marin Kombucha - is overly sweet.  Missing that sharp and refreshing taste you would get from real kombucha.  How about supporting local kombucha makers, instead of consuming energy carting barrels from California?<br><br>Service is generally good.  However, the cashiers who insist on saying \"is that all you are getting?\" need additional  customer service training.  First, retail workers should not convey contempt as if the customer is not buying enough to satisfy the clerk/cashier. Second, the phrasing is grammatically incorrect.  The proper phrase is, \"may i provide you with anything else?\"  This shows a willingness to assist the customer, an interest in being of service, and prompts the customer to either order additional items or indicate that their order is complete. [by the way, the proper customer response if her order is complete, is to say, \"thank you, no].  However, do not try to explain this to the millennial and generation Z workers here or you will get a very puzzled look and then a dismissive \"whatever!\" as they roll their eyes at you.  <br><br>Food came out in a timely manner.  Seats are generally comfortable for the length of a meal.  Lighting is good.  Noise level is a bit on the noisy side; background music is not great.", "pics": null}}, {"review": {"des": "Good food. I like the fact they have vegan options and focus more on healthy side of food. We had red curry bowl with veggies, roasted cauliflower and chickpeas, and chips and guacamole. They are all tasty. Especially the curry bowl really hit the spot in this windy, cold, rainy day! The interior is clean and spacious. This can be a good place for party or big groups! <br>There are few downsides of this place. First, it took a long time to get our food even when it was not the peak. The second one is what blew me off which is they don't wear gloves when they work in the kitchen cooking for your food. On top of that, they use their hands to grab topping and salsa to put on your food!!! THEY USE THEIR HANDS! What?! Which era we are living in? What's the health regulations here? I can't believe my eyes when I saw that. Anyway, the safe way to go is order those food that doesn't need topping or salsas on the top. Hint: Curry bowl is the way to go.", "pics": null}}, {"review": {"des": "Was excited to try the place but they were out of 4 items I asked for then potatoes came out spicy which my sister and daughter can't eat. They politely replaced them but overall wouldn't return.", "pics": null}}, {"review": {"des": "I have a new favorite flatbread - the Grilled Veggie!<br><br>It has a layer of chili oil to give it a kick, and then topped with perfectly grilled veggies.  There is no cheese on top, but you won't miss it... this thing is packed with flavor!!!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/6mRfxOVCw9n9JFmVKaKvnw/348s.jpg", "caption": "Grilled veggie flatbread"}]}}, {"review": {"des": "Fish tacos and sweet potato fries, two things I don't get to eat that often as a Celiac. They had no trouble accommodating my gluten issues and the food was quite delicious.", "pics": null}}, {"review": {"des": "This is a quick serve healthy concept where you order at the counter and they bring your food to the table. It's not entirely vegetarian, but that's the emphasis.<br><br>The guacamole appetizer was very fresh and well seasoned, although the accompanying chips are a bit on the indestructible side. <br><br>Buffalo chick is baked rather than fried. It was moist and flavorful, although the coating was much more like barbecue or chili powder than true BUffalo sauce.<br><br>The best item I tried was a special, the Vietnamese shrimp salad, which had a nice mix of romaine and arugula dressed in a vinaigrette, and a handful of shrimp in sweet Tahi chili sauce.<br><br>This location is large and airy, with lots of sidewalk seating, too.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/zfk_SfpBZwdq0FV9Om_2Tg/348s.jpg", "caption": "Vietnamese shrimp salad"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/UrsKPVVQoiH3owQ6tzb99w/168s.jpg", "caption": "Guacamole"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Ne6obJi4CIzJsysRd4oCaQ/168s.jpg", "caption": "Buffalo chicken"}]}}, {"review": {"des": "Lyfe Kitchen is the kind of establishment I wish was more prevalent: fresh, healthy ingredients in a bright and clean atmosphere.<br><br>I ordered the Farmhouse Burger and Sweet Potato Fries.<br><br>The burger was a bit minimalist: lettuce, tomato, onions, and sauce on a brioche bun. The bun was a really good compliment: I love the whole grains! The burger was (mostly) juicy, and I enjoyed the spring salad that came with it.<br><br>The sweet potato fries were pretty good too. They had a sprinkling of spice (cayenne?) which was okay, but I wasn't expecting it. I like that they were baked.<br><br>I liked that they had a water spout with three different waters, but the \"chilled\" wasn't cold.<br><br>The food runners were nice and also cleared plates relatively quickly.<br><br>I'm definitely a fan, and can't wait to try some of their other menu items!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/5vJ4s7OLpIZmbgeoE1q3jw/348s.jpg", "caption": "Farmhouse Burger"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/QRIT6DU2-_jGpqYO5mgr9A/168s.jpg", "caption": "Farmhouse Burger and Sweet Potato Fries"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/3G3jRT-6Lqs84uY-b9UAiQ/168s.jpg", "caption": "Farmhouse Burger and Sweet Potato Fries"}]}}, {"review": {"des": "They have so many gluten free options here and are very careful with any allergies you have. Very healthy and simple tasting food. The restaurant is very clean and has very friendly employees.", "pics": null}}, {"review": {"des": "I was visiting the city of Chicago last week, trying to find decent vegan food that wasn't a salad and French fries, AND GOD BLESS that we found this place. I had the beyond burger and the vegan cookie and my heart was set. The beyond burger was interesting... tasted a little too much like meat for my comfort level, but It was very cool to try. And the cookie was just what I needed to cure my chocolate crave. I brought along with me 8 other non vegans, and heard no complaints from them. Next time I'm in town, I'll definitely be back!", "pics": null}}, {"review": {"des": "Huge seating area, with wifi available with purchase. I had a bit of time to kill between meetings, and I decided to stop by here to get some work done. I ordered coffee, and was able to pick a choice of seating. The music selection is great, and the staff were very friendly. I didn't get any food this time, but my previous experiences with LYFE kitchen always lead me back to the BBQ chicken flatbread!", "pics": null}}, {"review": {"des": "Gluten free! I had the gluten free flat bread pizza ($9) for lunch. It was on a so-so flat bread. It was bade with fresh mozzarella and tomatoes than baked. I'm not sure if salt is a dirty word in this restaurant but they certainly didn't put any on my food and it really needed just a tiny bit.  I also had a gf corn soup ($3.50 supplement) with was just ok and a gluten free ginger cookie which was good. <br><br>Here is my biggest concern. There are three trays of baked goods the top is not gluten free, the middle is gluten free, and the bottom isn't gluten free. Why would you place a food with an allergen over the food without that same allergen. There is this little thing called gravity. If they missed something this obvious what else might they miss?", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/P1bNptaxCDc90DStsJz3UA/348s.jpg", "caption": "Marinera Flat bread ($9)"}]}}, {"review": {"des": "This is really a place that my wife likes because she is Gluten Free and eats VERY sensibly. I tag along. To me, the food is good, but the portions are a tad small. For the happiness the place gives my wife, it is a small price to pay.", "pics": null}}, {"review": {"des": "Tasty, fresh, and ideal for a group that has gluten-free members.   Everybody in the group got something different and everyone in the group expressed tasteful pleasure with their choices, including the gluten free cookies.  <br><br>The order at the counter, and then table service from there, method works well with my group, so everyone was pretty happy with the way place handles the order/serve methodology that LYFE applies. <br><br>Overall it was a good experience and we'll go back next time we are in the area.", "pics": null}}, {"review": {"des": "I love the vegan and healthy options !!!  The employees were also extremely friendly . Luis was helpful with recommendations .", "pics": null}}, {"review": {"des": "One wasn't enough!!! Amazing gluten free cookies! They were soft and chewy and one of the best tasting gluten free cookies I have had. <br><br>Also the gluten free pizza was good and definitely worth a try if you are looking for a gluten free pizza.", "pics": null}}, {"review": {"des": "So we chose to eat outside as it is not entirely frigid and when the food came out, no utensils and when asking for it the lazy woman who brought it out told us the utensils were inside and we could get them ourselves! Wow!!! If you don't want patrons to enjoy your outdoor patio area, remove your outdoor seating.", "pics": null}}, {"review": {"des": "I've been trying to eat healthier this year, and this place provides everything I need to stay on course with my New Years resolution. They use fresh and healthy ingredients yet they don't compromise the taste. I tried their quinoa crunch salad and I was very satisfied with it. Their green hummus and the salad dressing was so good. <br><br>If you're going to place a take-out order, be sure to order it online. They don't take take out orders via phone. Punch in all your information online, swing by in about 15-20 min to get your food!", "pics": null}}, {"review": {"des": "So often I try to avoid chain restaurants, but as this seems a smaller chain and the food seemed quality enough, I gave it a go. Woo, so glad I did! This meal was amazing in my eyes. Filling, healthy, and diverse, I was pleased with this choice. <br><br>For lunch I ordered a veggie and tofu curry bowl thing with a chocolate chip cookie. Man, was my mouth watering waiting for my friend to get out of the restroom... I tell you, that is extreme patience. She ordered fish tacos and was also delighted with her dish! The restaurant itself is very clean and beautifully filled with live plants.<br><br>This particular location seems to be in a really good location for Chicago. We walked from a popular coffee shop and then from LYFE walked down to the Navy Pier. I believe it was about 2 miles away, so not bad at all!", "pics": null}}, {"review": {"des": "A vegan friend found LYFE Kitchen when researching potential lunch spots for our Chicago trip, and I couldn't have been happier with her find!<br><br>I ordered the fish tacos and my friend chose the veggie + tofu curry bowl... and they were both absolutely DELICIOUS!<br><br>The atmosphere of LYFE was both comfortable and clean, with flourishing greenery everywhere. We will definitely be back.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ZfeGlJkiN1er6Q7s8ZIHqw/348s.jpg", "caption": "Grilled mahi, chayote slaw, avocado, cilantro, green onion, chipotle aioli on warm corn tortillas, salsa fresca on the side."}]}}, {"review": {"des": "This place is absolutely amazing. Healthy options that make you feel great after. The breakfast menu is delicious. I'm a big fan of the Pomegranate Power Bowl. Superb. Perfect way to start my day. Their mini Halo Top ice cream pints are adorable and only 160-180 calories for the whole thing! The gluten-free pizza crust is crispy and tasty. The staff are always extremely friendly and happy, even in the mornings. Very sweet people. The self-serve water is perfect and they have three types. This place is amazing for people of all diets and everything is delicious. I extremely recommend this. Well done.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/X4JSesbVormV1aFOpDIPag/348s.jpg", "caption": "Pomegranate Power Bowl"}]}}, {"review": {"des": "Amazing place. Good food. Fresh. <br>Plus, u have a choice of sparkling or still water. <br><br>Would go back again.", "pics": null}}, {"review": {"des": "Pros- Ingredients are healthy, portion sizes are good enough, Restaurant is clean, Good for a date night, Cocktails and drinks are so so healthy!!! I'd def visit here for the Skinny Cocktails!!!! <br><br>Cons- Over-Priced for what it's worth <br><br>Bottom line - Come here for cocktails and food elsewhere if u want to save some money else forget it and  enjoy your life!!! lol", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/uKr8atbaZkgphX4fhMUrRw/168s.jpg", "caption": "cauliflower flatbread"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/3l1bAOa5IDSP_Quxw6Uu-Q/168s.jpg", "caption": "strawberry shake"}]}}, {"review": {"des": "I am vegetarian and enjoy most of the food at LYFE. In fact, I was a frequent visitor when I worked nearby.<br><br>My favorite choices were the breakfast burrito in the morning and the veggie burger or margarita flatbread in the afternoons/evenings. I loved that I could order with the app, earn points, and pick up within a decent timeframe before arriving to work. <br><br>The food was usually very tasty. However, the consistency with service was my biggest issue with this LYFE. There were a few weeks when I ordered every day. Sometimes my food was overcooked, sometimes I received the correct condiments, sometimes I did not. Once in awhile the food was not ready for over 15 minutes past pick-up time. It was truly hit or miss. <br><br>Frankly, the chefs were pretty good, but the staff at the front desk couldn't care less if you are standing around looking for your order. The younger workers are frequently too preoccupied with their cell phones to take your order or see if you have a pick-up order ready. My coworker, a former restaurant manager, even pointed it out. Having been a frequent customer since LYFE opened here a few years ago, I never saw a change regarding the service aspect. I had my money refunded many a time (true story) because of lateness or incorrectly fulfilled orders!<br><br>During a recent visit I asked to redeem a free meal with my frequent buyer app points and also mentioned I have a free cookie for my birthday. I was told I could not redeem both. Whaa! It's my birthday!! I had spent at that point probably $1000+ on my daily LYFE habit. Boo. <br><br>Four stars for the food. Three on service. Get it together LYFE! Train (and maybe pay more) so that your workers actually care about their customers!", "pics": null}}, {"review": {"des": "Casual, \"fast\" healthy food restaurant with very welcoming staff. <br><br>As with most healthy restaurants, it's a bit on the expensive side. My smoothie cost almost as much as my food. I ordered the mango cucumber lime smoothie and the bbq chicken flatbread. The smoothie was incredibly refreshing and a perfect curb to the sweet tooth I had. The flat bread was delicious, not too heavy and perfect for if you had a pizza craving! My gripe with it is that the chicken to flatbread ratio was way off. There were literally like three strips of chicken. Despite my big appetite, it held me over, otherwise I think the next time I'd order extra chicken. Not a place where you would get the best bang for your buck in relation to price and portions, but I'd go back.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/HrgYZkGJ2wMHsSvUHAENyA/348s.jpg", "caption": "BBQ chicken flatbread"}]}}, {"review": {"des": "Black bean burger was very dry and fell apart. Definitely do not buy! Morningstar frozen burger is higher quality. I'm just getting the buffalo chicken wrap if I come here again bc that was worth it.", "pics": null}}, {"review": {"des": "We were looking for a light, healthy lunch and LYFE Kitchen hit the spot!!  Despite having an extensive lunch menu, a whole selection of brunch options, and craft beer&wine the place was rather empty for sunday right around lunch time.  The restaurant was super clean and the staff was very friendly and super helpful.  We split 3 plates ($8-11 each) for lunch and had more than enough food.  <br><br>The best dish was certainly the side order of roasted brussel sprouts and butternut squash with a dijon vinaigrette. The veggies were perfectly cooked, and the plate was quite large for a side order and just delicious.  The roasted veggie salad was solid and the best part were all the roasted peppers. The red onion and sugar snap peas were great, however the chicken we had added was lackluster. Not much flavor and it had the texture of microwave chicken nuggets. The flatbread was really great, but everything with sautéed mushrooms, goat cheese and balsamic glaze is good.  The crust was a touch hard and thin, but overall the pizza was good enough to order again.  <br><br>Overall: fresh ingredients, great flavors, and quite healthy for restaurant food.  We'd certainly return if we're in the area.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/sMyL9tzCqqL0eCJB3ndkuA/348s.jpg", "caption": "Mushroom flatbread, sprouts & butternut,grilled veggie salad with chicken"}]}}, {"review": {"des": "We've been waiting a half hour for a fruit cup and burrito. The service here is miserable. The vegan menu is skimpy for a place that is supposedly vegan friendly. The reviews were so good and I was looking forward to eating here. <br>I'm giving a review of one star for service. Don't know what the food tastes like.<br> We will not come here again if we are back in Chicago. People that were in here before us still don't have their food. Lots of people are complaining.", "pics": null}}, {"review": {"des": "Very satisfied with my experience.  Not a big yelp reviewer, but they went above and beyond.  I asked them to put the football game on and they worked at it until they got it, even though I told them it was no big deal.  Quiet ambiance, lots of room.  You order at a counter and they bring the food to you sort of a deal.  Very friendly people, eager to please.  Chicken sandwich was bomb.  My gf got cauliflower tacos which were also good.  The guacamole needed salt, which I added, and it was delicious.  They have beers on tap.  Good vegetarian options.  Very happy.", "pics": null}}, {"review": {"des": "This place is not bad. The food is interesting and fun, so that's pretty cool. The decor was nice and the place is pretty big, so it makes you feel like you will always have room. They have free water, carbonated and not. I'm not sure if that's standard in this part of town because I did see the carbonated water at another restaurant as well.<br>My only thing about writing this review is that they told me that they will charge me for ordering a chicken dish and substituting the chicken with a non-meat or plant based protein. The chicken dish was already around $13 and I didn't want the chicken....so....kinda felt annoyed. But the food is good and the service is what you expect. Not that I have complaint about that but I just want to let people know.", "pics": null}}, {"review": {"des": "Ancient grains tastes exactly how it sounds like -- out of place, thrown together in a way that is kinda wrong, and tastes even worse. Picture a lumpy gunmetal colored vase that's used to decorate your Aunt Christie's fireplace for \"swank\" purposes. An ill-fitting argyle sweater on a Wall Street bro. Picture licking a hay stack. Now you're going to visualize tasting chimchurri thats been violated with a concoction of soy sauce and vinegar, thrown on a top of vegetables. These are all things I pictured when I ate ancient grains. <br><br>I will give credit to LYFE for having wicked flatbreads (the goat cheese & mushroom mix is scrumptious). But until the portion sizes are better / the buffoonery that is ancient grains is removed from the menu, I cannot break the two star review.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/EyrSqOOn0b2pYGvmJdeldQ/348s.jpg", "caption": "Ancient grains, really meh"}]}}, {"review": {"des": "A reminder of True Food Kitchen with a smaller menu. When I am in Chicago and want something heathy when having those late night cravings, I don't feel like I'm cheating when I call them. Uber eats....winning!!!", "pics": null}}, {"review": {"des": "Forever in search of the healthiest meals in the Mid West I found this \"fast-fine\" restaurant based on reviews, menu and recommendation from a friend.  When you walk in you are greeted by a spacious, kinda nice in a cafeteria-sheik kinda way, joint with a hydroponic herb garden..... how cool is that?  I grabbed a kombucha from the fridge and immediately popped it open to enjoy as I perused the menu, never even considering price as it was unmarked.  Once I got to the friendly cashier I ordered the quinoa crunch bowl with added natural chicken and the edamame and veggie app.  With the 5.00 kombucha  and added chicken the total came to over 28 dollars and of course I added a 5 dollar tip to support the herb garden or something like that I made up to take my mind off of the fact that this meal would be twice as expensive as most other salad bowl / hummus combos I have had on the road.  But no matter at this point-- I figured the high cost would be worth the price.<br><br>As I assembled my evening spread at my hotel desk (see pictures) it looked really fresh.  The quinoa bowl was deconstructed (good stuff at the bottom) with dressing on the side.  Once combined with the dressing I was expecting what the menu promised a spicy dressing with, when combined with the grilled chicken, would give this thing a south west kick.  The dressing was not spicy....... the chicken was left off entirely despite being charged for it.......... what's with this town and preventing me from eating chicken???? Second restaurant, second screw up on my friggin' chicken!!!!! Egads man!!!!!<br>Cmon guys, it was past 8pm and NOT your rush crowd!!!!  All this said, it was decent... not mind blowing.... basically what you would expect from a healthy bowl of quinoa tabbouleh, greens, hummus and a sweet (not spicy) house made dressing.<br><br>The edamame hummus was topped with Spanish paprika which is a nice smoky accent and the crudités very fresh.....  I'm glad I had a bag of beanitos chips to add to this or we are talking fiber overload and probably not enough calories for an after workout meal.<br><br>In conclusion: I want my chicken dammit!<br>The food is healthy tasting and does not represent a great value.  You may interpret \"healthy tasting\" as you wish.  For me it was just ok.  Would I go back?  Probably not unless with friends so I could sample a greater array of menu offerings.<br><br>Rob D, Parker, CO", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/9F-i9sy9VawXN-mjRQDbiQ/348s.jpg", "caption": "Everything deconstructed..... and kind of small."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/9U1npjJwn6DCD7BSBw5EWA/168s.jpg", "caption": "Full (ish) bar and crafts on tap."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/MRGB17MkNv_-wXdy4Z5jOw/168s.jpg", "caption": "Open kitchen so you can see that they wear gloves!!!"}]}}, {"review": {"des": "This is a great place. I went late on a Saturday night with my cousin and she is vegetarian. There were plenty of meat options for me and vegetarian options for her. I love buffalo chicken so I ordered the chicken strips from the 'small plates' menu. I ordered sweet potato fries to go with it since it was a small plate, but I definitely didn't need them! The proportion of both small plate dishes were huge so getting 2 is totally unnecessary. The place is clean and well kept for a 'fast' place and the bathrooms were very clean. They sell alcohol here too which made it easy for us since we also wanted to have a drink. They have beer wine and some cocktails. We both ordered Moscow mules and they were made very well (I'm assuming they came from a premixed can, but I can't say for sure)!", "pics": null}}, {"review": {"des": "The place is really nice and quiet. We ordered a ahi tuna poke - with spinach instead of quinoa - and the buffalo chicken salad. We also had the fresh lemonade and the hibiscus iced tea. Everything tasted good and fresh. 4 stars was only because of the amount of protein on the salads, they could have been a bit more generous. Everything else was a 5-star experience.", "pics": null}}, {"review": {"des": "It was decent but if you're looking for a healthy eat spot this isn't even close to top 5. the dishes were decent, but nothing stood out.  Also, we paid nearly 40$ for a small flatbread, some chicken and brussel sprouts, and a can of wine.<br><br>True food is better, but same price range.  Sweet green is probably your best bet in the neighborhood for a healthy, affordable, and tasty lunch.", "pics": null}}, {"review": {"des": "I live around the block from this place and finally decided to stop in after constantly hearing great things. Breakfast is served until 3pm on the weekends, which automatically is a win in my book. <br><br>Its a bright, lively atmosphere with upbeat music playing. The staff is friendly although I witnessed a customer asking about nuts in some baked goods. The cashier responded \"I think these are nut free\" as she pointed to a few types. Normally this wouldn't be a big deal, but knowing how serious some allergies are I was slightly concerned about her lack of knowledge. <br><br>The food is fresh and delicious. Perfect for grabbing a casual meal that your body won't hate you for eating. I'll be back again to try some dinner!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/YgupT_jnUzZWmtnxVwcxKw/348s.jpg", "caption": "Breakfast Burrito"}]}}, {"review": {"des": "Overall: Great casual, easy dining experience that is both healthy and delicious. However, a little too expensive for what you get.<br><br>The good: Great tasting healthy food with a large menu to choose from. Salads, flatbreads, bowls, sandwiches, etc. Service is friendly and the atmosphere is clean and modern.<br><br>The bad: Sometimes the service is fast, and other times I've had to wait too long. Also, my to-go experiences have been less than stellar. Eat in-house if you can.<br><br>Atmosphere: 9/10<br>Service: 8/10<br>Food: 8/10", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/JMlNmWQcn97dCFP57WUyLg/348s.jpg", "caption": "Black bean chicken bowl to go"}]}}, {"review": {"des": "When I'm in River North this is my default vegetarian burger location. One of these babies and killer smoothie, and you have one very happy and satisfied customer - that's already looking forward to coming back - the moment I leave this place.  <br><br>Everything on the vegetarian/vegan menu looks amazing, but I just can't get past a veggie burger - this is one of those places for me.", "pics": null}}, {"review": {"des": "So my wife and I came out to Chicago for vacation and we was super hungry and had taste to go to another place and a young lady stopped us with samples outside there front door. The taste was so good that we had to stop in and eat there. Everybody that we dealt with was so nice. I just want to say thank you Jose the manager, Mileena cashier, Jhariea cashier, and Paradise the server. Coming from the Bay Area and knowing restaurants this was good. Thank you guys", "pics": null}}, {"review": {"des": "The \"poke\" was mostly some crunchy noodle things. The to go container was big, but when I opened it the meal didn't even take up half the container! That was not $11 worth of poke, if you could even call it that!", "pics": null}}, {"review": {"des": "While I have never been to LYFE kitchens we get their catered food At work a lot. <br><br>General comments: Chimchurri vinegrette is a great concept and they should utilize chimchurri in more of their dishes. Especially sweet potatoes, broccoli and feta. I also adore the red sauce they serve with the quinoa veggie wrap. The lemon vin is way too zesty. I really enjoy their wraps,  love the grilled vegetable but do not see them on their regular menu. The chia puddings are also delicious; chocolate raspberry is the way to go.", "pics": null}}, {"review": {"des": "Service definitely lacks during lunch hour. Placed an order to eat in the restaurant and was told to listen for my order to be called instead of being given a pager. <br><br>After 15 minutes of waiting, I finally went up to ask about my order and they had it sitting in the back -- ended up with a cold flatbread.", "pics": null}}, {"review": {"des": "I came to LYFE kitchen when they first popped up in the city and loved that they had a vegetarian and normal menu. Now it's combined so there's less in the menu to pick from. The food is always fresh and light. It's a bit on the pricier side but you get quality vs quantity here. I never get completely full with an entree here so I always get a soup or apps on the side. Their sweet potato crinkle fries are the bomb tho!!", "pics": null}}, {"review": {"des": "I went here after the St. Patty's celebration. My friends are vegan so this restaurant was a great suggestion. I had a large breakfast so I wanted something light. I grabbed the Greek yogurt. There was this pomegranate chia sauce that I loved. It added the perfect sweetness to the sour plain yogurt. I like this place a lot.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/SA0-p0lk8suK8hq-CxpIzw/348s.jpg", "caption": "Greek yogurt bowl and ginger chia drink"}]}}, {"review": {"des": "Rude manager. Used to order here all the time. Not any more. How dare you try to find out if your order is ready.", "pics": null}}, {"review": {"des": "Lyfe Kitchen is clean, bright, and provided me with a delicious meal. I came in late afternoon on a weekday on a mission to find good vegan food, and I achieved my goal. I had \"Art's Unfried Chicken\" and oh boy, it was SO GOOD!! The Brussel sprout and butternut squash side was fabulous. The unfried chicken tasted great. <br><br>You stand at a counter and order your food, and they deliver it to your table. You do not bus your own dishes -- at least, I didn't, and I looked around for dish pans.<br><br>My only complaint was, I thought it was a little pricey. For the meal alone -- no drinks, not even water -- I paid $15.00 and change. I justified this because the restaurant is on expensive real estate, and I had spent the afternoon at Northwestern Hospital, sitting in waiting rooms for hours. <br><br>Lyfe Kitchen also has vegetarian (with dairy and/or eggs) and carnivore selections. I was pleasantly surprised to see that they also sell alcoholic beverages, but I did not partake on that visit. <br><br>I would definitely visit Lyfe Kitchen again.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/0Uc6xjO77Jo0rp0KNsjB2A/348s.jpg", "caption": "My $15 + change meal."}]}}, {"review": {"des": "This place should be called DEAD Kitchen. The lettuce on my veggie burger was wilted beyond belief and the sweet potato fries tasted like 12 month old frozen potatoes. I was extremely underwhelmed by the presentation of my burger and the disgusting frozen fries. My meal was far from being made with fresh ingredients.<br><br>One would expect better quality of food and presentation, considering this isn't your typical fast food joint with dollar menu items.", "pics": null}}, {"review": {"des": "While eating my lunch, I got up to refill my water cup.  Upon returning to my table, an employee had cleaned up my table and threw out the lunch I was in the middle of eating.  As soon as the employee noticed they clearly made a mistake, the employee quickly re-ordered my item from the kitchen in a to go box and provided me a full meal replacement as I left.  Great example of turning a bad situation into a better outcome!", "pics": null}}, {"review": {"des": "yummy!!! i got the buffalo cauliflower tacos, my mom got the bbq chicken flatbread, and we shared some sweet potato fries! it was SO GOOD! the service was super fast and friendly! there were sooo many vegan and gluten free options to choose from which is so awesome!", "pics": null}}, {"review": {"des": "My breakfast sandwich had a long hair cooked into it, and they did not offer me a refund when I showed them.", "pics": null}}, {"review": {"des": "Bathrooms had no running water and hand sanitizer machine was broken. When I had told one of the girls that worked behind the counter that the faucets and sanitizer were broken she said one faucet worked (when it didn't) and did nothing about it. <br><br>Bathrooms were dirty with paper everywhere.<br><br>I ordered a hot tea and they gave me the wrong kind and not very friendly when exchanging it.<br><br>We also saw two people return their food because of problems. <br><br>Not a good experience", "pics": null}}, {"review": {"des": "Got the chicken and black bean bowl but I asked for another dressing because I don't like spicy food. One of the cooks was super patient by telling me their other sauces and what would pair nicely with the chicken and black beans. <br><br>I got the pomodoro and it was great. Tasty and filling. They could have added more chicken but it was great. <br><br>I really enjoyed this dish and the service provided by the waitress and cook.", "pics": null}}, {"review": {"des": "I work close by and come often for lunch because it's relatively healthy and is quick. However, I have never been here without having some sort of service issue. It is super unfortunate because it's something that can be so easily fixed but in all my time coming the same problems just keep happening. <br><br>To start, the cashiers are just rude. They aren't friendly and don't look happy. I've been a cashier at a busy restaurant before and it's a shitty job, I get it. But you are literally handing me a receipt with a line for a tip. Why wouldn't you try a little harder? <br><br>Anytime I pick up or eat in there seems to be something wrong or missing with my order. I picked up salads last week and didn't realize until I was back in the office that they didn't put dressing on the salad or on the side. When I came back to get dressing there wasn't even an apology, just handed me the dressing and acted as if I was bothering them. <br><br>Today I ordered a chicken sandwich with cheddar cheese and when I brought it back to the counter I was told I didn't pay for cheese. Really? Just put the cheese on it without asking questions it's probably 8 cents a slice. I did ask for cheese so it doesn't really seem like it's my problem that the cashier forgot to add it on. So we are back to why the cashiers are part of the problem.  I'd be more forgiving if this was a one time thing but it seems to be every time. My friend also got the veggie burger and the bun they put it on literally looked like a sad whole grain pita. Why?? If you are ordering a burger I'm pretty sure you want a burger not a pita sandwich.  My other friend asked for a burger with just tomato, and it came out with nothing on it, no tomato. So two out of the four of us had food that came out wrong. That's not good. <br><br>Their pickup line is also not efficient, there are literally 5 bags at any time just sitting on the counter and no one in sight to call out your name. So you sit there and wait for someone to come by the counter and give you your food while you watch your food sit. <br><br>For a growing chain like Lyfe kitchen, you think they would put more emphasis on the service, especially considering the high price you pay. Won't be surprised to see this place drop low in rating unless they turn things around.", "pics": null}}, {"review": {"des": "We pretty much had LYFE kitchen for lunch every other day during our visit to Chicago! It was convenient that they have many locations around the city.  The food there was all very fresh, light, and healthy ingredients.  We would treat ourselves at the end with a warm muffin- i think it was carrot/zuccini- something healthy sounding too! All the locations were very clean and had nice outdoor patios too.  One small detail that I really liked was that they had free sparkling water on tap along with the regular water that guests can help themselves with- that was something I've never seen before at another casual restaurant.", "pics": null}}, {"review": {"des": "I remember when this location first opened.  It was good then and still good now.  I love their breakfast food.  They are your alternative to the other unhealthy breakfast options.  I love their decor, ambiance, food options, prices are decent, staff are always friendly, clean establishment.  Keep up the good work guys!!!", "pics": null}}, {"review": {"des": "While in Chicago for a business conference, I was looking for a fast but healthy lunch option and that's just what I found at Lyfe Kitchen! I knew I was going to like this place from the moment I walked into the modern space. They offer lots of healthy, fresh options that all sounded so good. I went with the chicken with Brussels sprouts and butternut squash...It was delicious!! My friend got the black bean bowl with chicken and gave it raving review. She said it had a bit of a kick. I liked the portion and presentation of my meals as well. The staff was so friendly and helpful. I will definitely come back here despite it being a bit on the pricy side.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/74qT1gq9UcOibz5UREM3PA/348s.jpg", "caption": "Amazing crispy chicken with Brussels sprouts and butternut squash!"}]}}, {"review": {"des": "One of the worst experiences in terms of service and food. Guy at the counter was rude and plain mean. Didn't had the service etiquette. Looks like he didn't want to work on a Sunday and was probably forced to work. Wanted to correct our pronunciation rather than deliver food. Some would call it racism. Ordered fish tacos, first impression was fish was stale and bland and veggies had no flavor. Also ordered spicy chicken bowl with beans, chicken was dry and over cooked.<br>We've eaten here before though would say the experience this time around was far worse than before. Will skip it going forward. In the name of healthy food, let's not be fooled by quality. In Chicago there are way better options in terms of true food kitchen and docs b.", "pics": null}}, {"review": {"des": "What can I say about LYFE?  Its a big open space, modern, clean, and a comfortable atmosphere.  There are electrical outlets in the floor, so you can bring your laptop, phone charger, curling iron, alarm clock, whatever.  There is an herb garden in the middle of the dining area.  Nice lighting, loft feel.  Even the chairs are comfortable, like booths for one!  #youcantsitwithme  Ha! <br><br>Tomato soup:  Tangy, nice and hot!  Topped with parsley?  Some sort of creamy cheese chunks, yummy, and kind of cuts the acidity.<br><br>Edamame hummus plate: big portion.  Hummus in a decent sized ramekin with paprika sprinkled lightly.  An assortment of radishes, cherry tomatoes, steamed and cold vibrantly colored broccoli florets, warm grained pita slices, and maybe not so fresh cucumbers.  Cucumber fail.  <br><br>Everything good deserves a little naughty.  Two chocolate chip cookies.  Buttery, soft, slightly under baked and chewy, the way I like em' and make em'. <br><br>Bill $16<br><br>Also:  They have a self serve water station including choices of ambient water or sparkling.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/obw-TTDFWGtjFjkNbRAqQA/348s.jpg", "caption": "Lyfe with a cane.  Hunger prevails.  I'll make it work somehow."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/wq9xCBpPYjIsu83MJBaMxQ/168s.jpg", "caption": "\"Unfried\" chicken with Brussel sprouts, butternut squash, mustard Dijon"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/B67dnsgPmcbI9MtGmwiwBA/168s.jpg", "caption": "BBQ chicken pizza with bits of corn"}]}}, {"review": {"des": "The vegetarian burger was delicious. The prices are also really good for the area. The outdoor dining area was really nice.", "pics": null}}, {"review": {"des": "Lyfe Kitchen is a great place for someone who likes to eat healthy yet try different foods. They have wine as well. Who doesn't want wine with healthy choices of foods ?? I love the menu and food and the staff is amazing. This restaurant has saved me on days when I really wanted a burger but I opted for corn chowder and a flatbread. Try it it's good.", "pics": null}}, {"review": {"des": "This place was a welcome relief on St Patrick's Day.  All the other places we passed were asking for IDs but we were able to get a delicious and healthy breakfast at this place.  The service was friendly and the food tasted wonderful.", "pics": null}}, {"review": {"des": "Food was okay, the place was a little overhyped, decent amount of varity for food. Staff was friendly. Probably wouldn't go back since there are so many other food options in downtown Chicago.", "pics": null}}, {"review": {"des": "Stopped in today for lunch and got the mushroom flat bread. I had never heard of this place, I was just walking by. The menu had lots of delicious sounding options and the lunch service was fast. The flat bread was delicious and I was back at work on time. Will definitely try again!", "pics": null}}, {"review": {"des": "This place is a blessing for anyone with food allergies.<br><br>If you have a food allergy, you can 100% understand that the staff doesn't ask YOU first if you have any allergies. I'm allergic to soybean oil, which is even harder because the FDA won't recognize it as an allergen and that stuff is in EVERYTHING. I've only stuck to two dishes here so far - the buffalo chicken wrap and the salmon veggies/quinoa summer dish - but both are so, so great. <br><br>So, you can have allergy-safe food that is ALSO delicious. That is big for me, because I can find food elsewhere I can eat- I don't come here just because they're so aware. That's just a major plus in my book.", "pics": null}}, {"review": {"des": "Didn't expect much out of what I assumed was a chain, but man oh man did I have the time of my LYFE here. <br><br>Had the corn chowder, buffalo \"chicken\" strips, ancient grain stir fry, chia chocolate budino pudding cup, kale banana smoothie. <br><br>5/5, 4/5, 4/5, 4/5, 7/5 respectively. Everything was incredibly enjoyable, we felt great about the meal, staff was super friendly, and the only slight I have is that it was a bit overpriced. <br><br>About to see a movie at ArcLight?!? You know where to go...", "pics": null}}, {"review": {"des": "While I didn't realize before visiting that you order at the counter yourself and then take a seat and they bring your food/beverage to you, that didn't turn out to be a problem at all.  We enjoyed the drinks, it had happy hour, and the food (we didn't have that much but what we did have was good) was very tasty.  And healthy!", "pics": null}}, {"review": {"des": "Absolutely incredible. Came here for a nice clean post leg day cheat meal and ordered a double cheese burger with their BAKED (tasted so good like fried) sweet pot fries and the waiter Keith was AMAZING!!!!!! I highly recommend this place and please chat with Keith he is just such an amazing person. Loved the food and over all experience", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/fp3cMVhvqpLaLqnsrJAz6A/348s.jpg", "caption": "Double cheeseburger and baked sweet potato fries YUM! Added avocado and mushroom and mozz cheese ! Booty gains"}]}}, {"review": {"des": "This is my favorite healthy lunch spot that doesn't cost too much. Their gluten-free and vegan options are exceptional -- omg their vegan Caesar with gluten-free crisps?!? So good! Great sides, smoothies, food, service, atmosphere. They serve alcohol, too! A great place for a casual lunch or dinner.", "pics": null}}, {"review": {"des": "It was always pretty obvious to me that LYFE Kitchen was focused on healthy living; however, it took me a while to identify the niche within that. For example, is it a juice bar? Is it farm-to-table? Does it have a lot of take-out? Now I understand that it's a healthy fast-food restaurant.<br><br>Think Panera only uber healthy. You go in and before you even order you are confronted with a shelf partition holding potted herbs. I'm not sure if those herbs are used in the dishes served at LYFE Kitchen or if they're only creating the impression that the restaurant uses fresh ingredients.<br><br>You order at the counter just past the herb shelves. Be sure to grab one of the menus from the rack prior to getting to the counter. The writing on the wall above the counter only has drinks so it's important to know what you want before it's your turn.<br><br>The menus are divided into categories: vegetarian, vegan, gluten free, and everything. There's some overlap between the menus so it's not important to study all of them. The menus include calories and sodium content for each menu item including the alcohol!<br><br>The prices are really reasonable for the quality of food you get. I think you can expect to pay about $15 for lunch if you get an entree and a drink.<br><br>You grab silverware and water (room temperature, chilled, or sparkling) and choose a seat. Your food is brought to you and then bused away when you're finished.<br><br>The food is pretty much regular food. You can get sandwiches, wraps, chicken, and even burgers... Only they're the healthy cousins of what you're used to. Take the pudding for example. It has chia seeds in it. Or the \"fried\" chicken. Yup - it's crusted with crushed nuts and baked. The only food that I've gotten that wasn't 100% delicious was the fish. I don't really blame LYFE Kitchen for that. Chicago's just a hard place to get quality seafood.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/FdC-ppc7tEcH_cJ2XvOwnA/348s.jpg", "caption": "Fish tacos"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/hwN3xQo4Nkjp2jHVEMisHA/168s.jpg", "caption": "Hamburger. The best!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/nOgntFAkkkXjmsHcrAp5kQ/168s.jpg", "caption": "Chocolate Budino"}]}}, {"review": {"des": "They grow their own herbs inside!  Yep, a real, live, indoor fresh herb garden: Oregano, Basil, Tarragon, Cilantro, Dill, Fennel, Garlic, Bay Leaves...right here in the center of the restaurant.  <br><br>LYFE Kitchen is like a breath of fresh air; as soon as you touch the super cool utensil shaped door handles you know this experience will be next level.  Everything is extremely fresh, the menu offers an awesome variety of items for all to enjoy and you'll be pleased to know that it's all healthy, fresh and nourishing. I love the open kitchen and the restaurants decor is soooooo calming.  I grabbed a window seat, enjoyed my meal and played on my tablet without interruption.<br><br>Customer service was pleasing as well; it was my first visit so the cashier was patient and led me to the Quinoa Pancakes (of course I added blueberries).  They came with a side of greek yogurt and ramekin of fresh berries   I enjoyed them immensely! I also tried the Brussels Sprouts & Squash side salad which was absolutely superb.  <br><br>If you're in Chicago please do yourself a favor and grab at least 1 meal at LYFE Kitchen.<br><br>Thank me later.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/stdpckBrVR3NViKPbvYl8w/348s.jpg", "caption": "Nice seating"}]}}, {"review": {"des": "I would give Lyfe higher stars if it weren't so expensive. It's extremely pricey for what you are getting. I like that I can eat here and not worry about my food being unhealthy. Pretty much everything on the menu is super healthy. I like the flat bread options. Also, the chicken sandwich is good, especially if you add goat cheese to it. I am interested/curious about the charcoal lemonade. It's not cheap, but they claim it has a ton of health benefits. I would like to see a nutritional label.", "pics": null}}, {"review": {"des": "This is an excellent option when you want something healthy to eat in River North. I typically get my food to go, but I have dined in on a few occasions. <br><br>Food: <br><br>Roasted Brussels and Squash is my favorite item on the menu. This side dish is seasoned perfectly. <br><br>Mahi Fish Tacos are a close second. They are nice and light, but also flavorful. <br><br>Unfried Buffalo Chicken Strips taste like unfried chicken, lol. I would rather just have baked chicken than this teaser. <br><br>I would like to try more options but the calories border between low enough if you are looking for a healthier option while dining out and too high to eat at home on a regular basis. <br><br>They have wine and beer if you want to eat healthy but have a drink or two.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/vhpzvk0lCIxOIELZmEf73A/348s.jpg", "caption": "Mahi Fish Tacos - sorry I was so hungry I forgot to take the pic before my first bite!"}]}}, {"review": {"des": "Had lunch... good food but a bit noisy so it's tough to converse but.... it's lunch! Easy to order and they bring the food to your table. Would go here again...<br>Make sure to order the sweet potato fries!!!!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/GjJOy6rTfIGQicZ0PEafDg/348s.jpg", "caption": "Great place for lunch..... Sweet potato fries are worth ordering....."}]}}, {"review": {"des": "Came in around 920pm on 8-9 <br>Was my first time going in so I was a little lost in the menu I came in to get something for my niece and the lady in the counter was very rude I had ask her about the menu she just pointed to the menu I was suppose to read and like in a rude way took my menu I had. Felt like she thought I was going to leave it somewhere else. When I order she took my order as if she was in a rush I know it's closing time but it's not a way to treat customers with the attitude she gave me.", "pics": null}}, {"review": {"des": "I come here when I'm at NW hospital. Always delicious. Great GF options and kids menu", "pics": null}}, {"review": {"des": "We stopped in to Lyfe for a quick lunch and it was reasonable.  Once we figured out that you order at the counter and then they bring it to you 10 minutes later, everything was good.  There wasn't a lot on the menu that really appealed to me but If there was one thing I'd change, it would be to add felafel.  Having said that, we were both happy with the chicken soup and fish tacos we ordered.", "pics": null}}, {"review": {"des": "LYFE should hire a hispanic cook, because everything I've tried has been pretty flavorless. <br><br>I've had the fish tacos, guac, veggie burger, flatbread, salad, fries, and it's all been money gone down the drain. <br><br>I like the concept of Lyfe, I really do. I track my food intake and appreciate places that arent fast food that list their nutritional context. However, I cannot tolerate tasteless health food. This is not 1959. There's too much knowledge of seasonings, substitutes, veggies and fruits that can jazz up a dish without making it calorically dense or taste like cardboard.<br><br>I do it all the time. I watch what I eat and cook delicious stuff daily. Is it because I'm Cuban? Perhaps. But I'm sure LYFE can do a little better, just try a little harder.", "pics": null}}, {"review": {"des": "So glad we found this restaurant! Walking distance from our hotel. Love love love! An amazing environment with great selection. We traveled with people who were either gluten free or vegan so this restaurant was able to fit everyone's diet. The staff were very friendly and patient when taking my order. There was so many choices it was hard to decide what I wanted. Ordered spicy chicken kale soup and a quinoa black bean bowl! Both were very flavorful and chicken moist. I would order both again and try other dishes! The pasta, flatbread, sandwiches, and sweet potato fries looked amazing and according to friends were delicious as well! I'm always craving healthier choices when traveling and this restaurant was perfect only downside is that it's a little pricey but not too ridiculous! You definitely are paying for quality!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Vdtqm3QE6WDsaSka6Q95BQ/168s.jpg", "caption": "Spicy chicken kale soup"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/3kWZoBPyLbkaj0LSptpgYA/168s.jpg", "caption": "Quinoa and black beans with grilled chicken"}]}}, {"review": {"des": "As a southerner who tends to steer clear of anything vegan, gluten free, or vegetarian, LYFE surprised me for the better. It's a cute little café that looks like it should be in California lifestyle magazine. <br><br>LYFE has a menu for every food preference you could think of (gluten free, vegan, low fat, vegetarian, or no restrictions at all). Very inclusive of all dietary needs.<br><br>I had the grilled cheese and it was very good! They used several different types of cheese as well as an assortment of veggies and spices. Definitely not your normal grilled cheese. Best I've ever had. <br><br>My uncle, who's gluten intolerant, was ecstatic about his meal was well. He explained that their food lacked the grainy, bland taste which often characterizes gluten free cuisines. <br><br>The employees are very nice also. When our waitress found out that we weren't Chicago locals, she was eager to recommend places we should visit and was very helpful. <br><br>Overall a great place. I highly recommend it for a brunch/lunch with friends or family.", "pics": null}}]}