{"name": "m-henry-chicago", "reviews": [{"review": {"des": "The pancakes I got here were unbelievable! Everything on the menu looked awesome so I asked the waiter which pancakes were his favorite and he suggested the Blackberry Bliss Cakes. I literally didn't talk to my friends for 10 minutes because I was focusing on the pancakes. I didn't think I'd finish them because the mascarpone cheese in the middle was pretty filling, but I ate everything on the plate. <br><br>We were seated surprisingly quickly for a weekend morning, and service was great. Even the simpler things on the menu, like the eggs & potatoes, are excellent. They also have great vegetarian and vegan options, and they're BYOB! Can't get much better than that.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/E58m7paGYTJdxb1MBmMukw/348s.jpg", "caption": "Blackberry Bliss Cakes"}]}}, {"review": {"des": "M.Henry is a good, solid place to eat. I struggle between a 3-4, but there wasn't anything at all wrong with our experience. Their bread pudding was really nice! <br><br>I do wish their menu was a bit bigger, but the food is decent and pricing is a little high for what it's worth. An overall lack of \"Wow!\" factor but that might just be me. <br><br>Again, solid good breakfast and lunch option for Andersonville.", "pics": null}}, {"review": {"des": "After a year of anticipation, I finally made my way to m. henry's. Adorable little place. We were seated right away on a Sunday morning because they had a party coming in an hour and we agreed to be finished by then.<br><br>I went savory for breakfast and regretted my choice! I had a taste of everyone's plate (there was 4 of us) and their mango cranberry pancakes were by far the best. I can't recommend this plate enough- the pancakes encompassed all the flavors you could possibly want (tart, sweet, buttery, savory) while still remaining fluffy and airy. Absolutely to die for! <br><br>I ordered the lemon shrimp and corn cake benedict and thought it was meh. The latina omlette was amazing! Each bite was perfectly balanced thanks to the chipotle sauce that brought it all together- absolute killer!<br><br>Their service was spot on! I don't think my water glass got more than half empty.<br><br>Overall delicious little place worth checking out if you love brunch! Get something sweet... you won't be disappointed!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/6Osidpbr_JwxRasvef8MTA/348s.jpg", "caption": "Omeletta- delicious !"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/X0GyvtnqS3O9z3NSfq0TfQ/168s.jpg", "caption": "Lemon shrimp Benedict - meh"}]}}, {"review": {"des": "Haven't been here in years and decided to drop by for brunch. Still busy as always and tasty. I opted for the breakfast sandwich with scrambled eggs instead of the fried egg sandwich. I really enjoyed it and it was a lot of food. I really liked how everything was pretty well made and not greasy. The tomatoes and mango were a nice finish to the dish. Luckily we got here early around 10a and didn't have to wait for a table. There is street paid street parking on Clark and free street parking on Hollywood Ave. The service was good but the menu is very limited and that's why I give it four stars. I think they should have more variety and maybe mix lunch things into the menu Incase someone in the group doesn't like breakfast foods.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/61blxcPr-X7LPFexI4tdSQ/348s.jpg", "caption": "Fannie's Killer Fried Egg Sandwich with scrambled eggs"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/wiBIWbYGDQIhiYoNcrb7Yw/168s.jpg", "caption": "Rustic Peasant Quiche"}]}}, {"review": {"des": "We came here for breakfast of course and had to wait about 30 minutes to get a table. Not a bad wait, and definitely worth the wait. I ordered Jorge's black bean cakes and huevos borrachos or just for short their \"drunken eggs\". I'm really not sure how they came up with this wonderful creation. Very simple ingredients, eggs, chorizo, tortillas and beans used to create a masterpiece of a plate. The black beans were very delicious and commented the main dish very well. <br><br>You basically have two masa tortillas covered with eggs, I chose over easy, topped with chorizo and smothered in their adobo sauce with queso fresco sprinkled on top and sour cream with a side of sliced avocado and cherry tomatoes. The adobo sauce wasn't spicy, still very delicious. Cloud 9 for sure with every bite. <br><br>Everyone was very chill and welcoming. Food didn't take long to arrive and everything tasted great. I'll definitely be back!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/R30Q_lf4PCefkaXY_f9soA/348s.jpg", "caption": "Drunken eggs"}]}}, {"review": {"des": "Came here at 12 pm on a Saturday and was somehow magically seated right away. I've walked past here before and seen a line out the door so it definitely gets packed, but I was lucky. Got the Blackberry Bliss Pancakes because of all the hype and was fearful it would be too sweet, but it was such a delight! the blackberries have a nice little sauce on the bottom, a thin compote of sorts and without much added sugar from what I can tell at least. I am usually horribly afraid of too sweet breakfast items, and seeing the sea of sauce I thought it would be way too sweet but was perfect. The pancakes were airy and delicious and a good portion overall.<br><br>Got the caprese chicken sandwich and a soup as a takeout item and they were really quick about it and my friend said it was perfectly fresh and light and delicious for her.<br><br>Definitely coming back here to try more on their menu, hopefully will get lucky being seated again!", "pics": null}}, {"review": {"des": "I was just there 20 mins ago with a craving for Marzipan cake.  I bought the guava one - and that doesn't taste like guava AT ALL.  There's nothing guava about it and the sponge layer is BREADY DRY.  I miss Swedish bakery.... Btw, princess torte is traditionally GREEN!  There's a reason for that.  Yours appears anemic.  If you want to keep it white, call it a different name", "pics": null}}, {"review": {"des": "M.Henry is one of my favorite brunch places. <br>I usually order the Fannie's killer fried egg with the bread on the side, their Latina Omelet is a good choice too, it is not spicy at all but it has a kick! They have gluten free toast you just need to ask for it. Their menu has not so many options but enough for what it is a breakfast/brunch place. <br>What you need to know: They are usually busy during the weekends, If you have time and are not bothered by crowds go there on a weekend and be prepared to wait at least 45 min to be seated. If you want to sit down at a relaxed atmosphere, have great service, and enjoy your meal, go there during the middle of the week around noon, there is no waiting time. They are always busy, you'll never see this place empty, but usually weekdays are your best bet, you can ask to sit anywhere you like. Their food quality and service is excellent, their waiters are the best.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/vflTBCEuQSr3pa-6jftZJw/168s.jpg", "caption": "Pretty busy"}]}}, {"review": {"des": "The food? Not too shabby, but not worth the cramped quarters and neglectful service. It was like pulling teeth getting coffee or water refilled and when asked if we wanted to see a dessert menu, we answered \"yes\". After waiting about ten minutes for the menu, our check arrived. No menu. It just felt rushed, cramped, and unwelcoming.<br><br>The fried egg sandwich was pretty solid. Aside from being a little messy (we'll chalk that piece up to user error), it was tasty. I'd do takeout again, but I won't be back for the dining experience anytime soon...", "pics": null}}, {"review": {"des": "Went with my friend on a Saturday morning around 11. There only was a 15 minute wait and they had a cute bench out front so we just sat there until our name was called. They had a bakery counter as soon as you walked in with yummy looking treats like scones, baguettes, and cinnamon rolls. I didn't try anything this time but will next time I'm in. The service was super friendly and we didn't feel rushed like busy brunch places can sometimes feel.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/KwqKtbaS64ExrGHUqHN1gQ/168s.jpg", "caption": "The Latina Omeletta"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/0pX1oB7CwyipGsWonMOy1A/168s.jpg", "caption": "The maple glazed turkey sandwich on an English muffin with the cutest little cornichon on top"}]}}, {"review": {"des": "Well I ordered the exact same things I did 8 years ago.  Does that tell you something?<br><br>(Yes I am a creature of habit.  Yes I love m.henry!!)<br><br>The bread pudding is still that magical little bowl of heaven.  *sigh*  The bacon wrapped eggs is awesome because while it appears you ordered super healthy with the beautiful salad greens framing the eggs, what you don't see is all the cheesy, gooey, polenta, and bacon tucked in the dish.  It's definitely a well balanced meal.<br><br>Do arrive early for a no wait brunch!", "pics": null}}, {"review": {"des": "If you want to try this place, I recommend getting a sweet dish! Pancakes, french toast--I mean it looks just as good as it taste! Any item on the sweets menu, you can't go wrong! It literally looks like waking up to a dream! Savory dishes aren't their best. I had their brunch platter and it was extremely underwhelming and weirdly random. Don't do it! Also if you want to sit there and eat, get there before 10am because it's always crowded and hard to grab a seat. If you have a group of 10, you can have a reservation but other than that they don't take reservations. Also, it's BYOB so bring some bubbly and order an OJ carafe! When I came here, I wasn't a fan of the service. You should always have water waiting for you as you sit down or the server should hurry and get it. I asked for water like 3 times before it was given.", "pics": null}}, {"review": {"des": "Love the vibe.  Vintage plus fresh baked goods.    My son got empanada and was disappointed but the pancakes were outstanding!", "pics": null}}, {"review": {"des": "An okay place for breakfast with usual long lines of customers. I guess this is the only breakfast place in this part of the town, thus a lot of customers on weekends, but for what's its worth, the food is okay. I have to say presentation of the food is great, they've used not so common fruits and looks fresh - thus you have the first class touch that you don't get in a regular breakfast place. I'm giving it 3 stars right now coz 2 out of 4 main dish we ordered we like.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/rXKCkxA5od4ngArzQ2XGUQ/348s.jpg", "caption": "Empanada - spicy empanada which is fine but it lacks any savory tastes. I've tasted better empanadas"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/D6xgyM0TBFX2dqGIFZopag/168s.jpg", "caption": "Rustic peasant quiche with salad on the side - will not go wrong w/ this one. A bit more salad dressing and this dish is perfect"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/SNDfcwg4NF9gsJ2jDXlmqg/168s.jpg", "caption": "Eggs Benedict - good choice but more hollandaise sauce would be nice"}]}}, {"review": {"des": "Love that they open at 7am! Great for out of towners who want to start their day. Not a budget meal by any means; delicious nonetheless. I had the cinnamon rolls French toast and surprisingly ate the whole thing. Whoops. It came with a cranberry compote, sliced fresh peach, blueberries and plums. It does come already drenched in syrup, as well. It wasn't too sweet somehow and the cream cheese filling was a good complement. I noticed other tables ordering the brioche French toast which came with fresh berries. I was a bit envious but what are you going to do! My husband had the eggs in a basket on sourdough with potatoes. His plate was also a very generous portion. With coffee, juice and tip, we spent about $40.", "pics": null}}, {"review": {"des": "We were pretty excited to try this place out, and when we came it was packed. The food came out and it looked really good too. Once we started eating, nothing was good though. At all. Very bland, or dry, or just plain boring. Maybe it was an off day.", "pics": null}}, {"review": {"des": "Pros: despite being somewhat busy, we were seated quickly and received near perfect service.  Omelette was cooked perfectly and everything on the table was delicious, beautifully presented and well balanced.  Enjoyed the ambience and artwork.  Pricing was ok considering the quality.<br><br>Cons:  potatoes were maybe slightly too salty?<br><br>Overall a great breakfast experience.", "pics": null}}, {"review": {"des": "Breakfast is my favorite meal of the day and I take it VERY seriously. Having said that... the best thing on the menu...Cinnamon roll french toast. Cinnamon roll french toast. Cinnamon roll french toast. Cinnamon roll french toast! HOLY MOLY, you would think that it would be something heavy that would weigh you down for breakfast but man oh man, it was so fluffy and the peaches beneath all the pancakes were so fresh and tart..perfect balance of sweet and tart. m.henry has been on my radar for quite some time and I am glad we tried it on our visit to Chicago. <br><br>Quick tip: If you are visiting, come down here on a Friday​..there is no wait.", "pics": null}}, {"review": {"des": "Had a lovely breakfast. Food was delicious. Went in a Thursday morning w family. They all loved it. I suggest ordering the bliss cakes to share as a starter.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Y_S58CqzWl4e8R7xvGUG-A/348s.jpg", "caption": "BlissCakes"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/EloaKWZQFkXrVHk8uF-Wvw/168s.jpg", "caption": "Cinnamon French Toast"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/O2i9PU-i5_TW7J6yPS_D4g/168s.jpg", "caption": "Fannies Fried Egg Sandwhich"}]}}, {"review": {"des": "This is one of my favorite place for a vegan/vegetarian breakfast.<br><br>It's hard to find restaurants that serve<br>Meat as well as vegetarian/vegan meals . They also have almond milk for your coffee .<br><br>Our favorite is the vegan tofu scramble which comes with either tempeh or veggie sausage and a side of fruit or potatoes . (Always get the potatoes !!)<br><br>Great sunny spot with a bakery up front for to-go<br>Items... including some vegan treats", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/X72cW5SMuZI93G9uGZiXdQ/348s.jpg", "caption": "Yummmmm! Vegan tofu scramble"}]}}, {"review": {"des": "I'd been wanting to try this place for quite a while and finally had the opportunity. It was everything I dreamed!<br><br>First and most important recommendation: go early in the morning on a weekend! It starts to fill up fast! I had the eggs Benedict and breakfast bread pudding. Both to die for, 5/5. The breakfast bread pudding has delicious warm peaches and blackberries! The outdoor seating was simply magical. It feels very much like a secret garden!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/rTpLeB5T1GEpGZQLGamNDw/348s.jpg", "caption": "Lovely patio"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/4LOgKnhdekg-V77Y7VKL4w/168s.jpg", "caption": "Lovely patio"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/LJH8MyKKWyDzaJO8qmG9Nw/168s.jpg", "caption": "Breakfast bread pudding, yum!"}]}}, {"review": {"des": "Omg! M.henry is one of the best breakfast places in Chicago. Food is fresh and juicy, you can feel that they really care how the food tastes and looks. I had an art on my plate. Good thing that they have a lot of vegetarian options, even veggie sausage which tastes like heaven. Service was great, very professional.  10/10 we loved it!", "pics": null}}, {"review": {"des": "I've come to m Henry a few times in my past visits to Chicago and I'll come every time if I can! The food is so good here! The last time I got the killer egg sandwich and my friend got the jerk chicken sandwich- both very tasty. I'd still recommend the egg sandwich as it is perfectly cooked and the side potatoes are excellent as well. The ambiance is very nice too- friendly staff and great customers too. I've heard they can have a wait, but it's worth it! Great spot!!!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/OZf-k1osSAb6Ye0EVCOOEw/348s.jpg", "caption": "Killer fried egg sandwich (I got it without tomato) --- super good!!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/XWaso6vrcStFMsQtMWSDqg/168s.jpg", "caption": "Jerk chicken"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/PqIzAq3VpGtVLjhSZG9L3A/168s.jpg", "caption": "Tea service"}]}}, {"review": {"des": "what a cool little place! we waited 45min for a table of 2 on a sunday so def expected that since duh people love brunch, but the hostess was really helpful and said to just go down the street and kill time at this pretty nice gift shop that had home made things and a green house. so def worth it.<br><br>the place is really small so we were close to other tables but i didnt even hear them talking, not that im a loud talker, actually i didnt even speak lol i just wanted to eat hahaha so yeah its close but not so close that im listening to people talk. <br><br>the food here was pretty good, lots of choices, i was not sure of what to get so i got this little sampler, i forgot the name but it had a little bit of everything and even dessert on it. my friend had a different kind of sampler as well. but after eating our main dish we were thinking it was just okay breakfast, the toast is rock hard lol i could of knocked someone unconscious if i threw it at them. the eggs were wet strange, the potatoes were good though. the chicken sausage was strangely good. but what will have us coming back for more is the dessert portion of our brunch, the FRENCH toast duh, with raspberries and lemon curd. sooo good! wth i didnt know i could love french toast lol. so all in all the sweeter options here are the good parts of this place, while the savory foods can be eaten elsewhere.", "pics": null}}, {"review": {"des": "This is a super cute spot with yummy vegetarian options. Saturday morning with no wait? Score! The servers and staff were welcoming and efficient. Our breakfast was flavorful and well plated. We were super impressed with the freshness and presentation of the fruit that accompanied one of the entrees. I had black bean cakes/scrambled eggs/soy chorizo and I cleaned my plate. I appreciated that there are ere quite a few veggie options. Unpretentious and solidly delicious. I'll come here again next time we're in the area.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/F6q-AXw64wHVhiCYkTI1eg/348s.jpg", "caption": "Black bean cakes + scrambled eggs + soy chorizo."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/jbAsY9JMhJf9htD_IwSiFA/168s.jpg", "caption": "Tofu scramble + potatoes."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/XjsZ-_ZlDyj0fupOGrvaDA/168s.jpg", "caption": "Breakfast/brunch menu."}]}}, {"review": {"des": "This is more like a 3.5 star place - given this place's popularity, the food overall is tasty but very average for brunch. Came on a Saturday around noon and the wait for 2 people was around 15-20 minutes. The inside is pretty crowded and loud - your usual neighborhood brunch scene. <br><br>We got the Blackberry Bliss Cakes and the Black Bean Cakes with Huevos Borrachos (drunken eggs). The bliss cakes are a stack of two very fluffy and soft pancakes layered with warm blackberries and vanilla mascarpone cream, topped with toasted oats. I like that the berry compote is very fresh and tart, which cuts into the creaminess of the mascarpone. I'm personally not a pancakes person and I thought this was decent, so if you are a pancake person you'll probably love this.<br><br>I was less of a fan of the savory dish. The homemade black bean cakes are soft and flavored, but the eggs are pretty bland and the tortilla was a little too thick. I was overall not impressed by this dish, which is maybe why this is a 3.5 and not a 4 star place.", "pics": null}}, {"review": {"des": "m.henry is one of the premiere brunch spots in not only Andersonville but all of Chicago. Expect a hefty wait if you don't get there early on the weekends. The restaurant is fairly large with tables packed in tight and has a casual, easy going atmosphere.<br><br>The menu runs from sweet to savory and everything in between. The fried egg sandwich and blackberry bliss cakes are both outstanding. I had the later on my most recent visit - three thick pancakes with layers of mascarpone cheese in between piled high with fresh blackberries. I'm drooling all over again just typing it. And my phone isn't even water proof. <br><br>Love this place! m.henry is a must visit for any brunch fan.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/szUptBi90PHEk4O_vPigEQ/348s.jpg", "caption": "Blackberry bliss cakes"}]}}, {"review": {"des": "M.henry hits the spot for me with their tex mex brunch items- I like the drunken eggs, and the poblano version of it. The rice and eggs are flavorful but not overpowering, moist but not gooey, and the crumbly cheese and warm patties just melt in with the rest of the dish. <br><br>It's their bakery items that have me hooked- the chocolate-coconut scones, olive-lemon loaf, and marble cake in particular. Crunchy yet soft exterior, moist interior, and just enough flavour that you know what you're eating but it doesn't overpower the dough.", "pics": null}}, {"review": {"des": "Overrated. Definitely not worth the wait or the price. Today was my first time here and I ordered the simple French Toast and scrambled eggs. The eggs were soupy and the French Toast was hard and bland. So disappointing since we made a special 30 min trip just to try it.", "pics": null}}, {"review": {"des": "My favorite breakfast spot when I don't mind traveling up north. I love the look and feel of this place, even when its super busy. I appreciate the \"non-meat\" options. I like going here on a date but I'd definitely take my mature 8 year old here. I enjoyed the vegan tofu scramble with a side of veggie sausage. Delicious! <br>The wait was quite long but I'm used to that. I have only been in the summer so standing outside was fine. I look forward to returning so I can eat on the lovely patio.", "pics": null}}, {"review": {"des": "I had a wonderful time here, from when we walked in to when we left. I came exactly at 8am when they just open there door. We were greeted right away. <br><br>The service was great, our food came right away. I really think everything on the menu will taste good, if you order it. You can't go wrong with the options they have. <br><br>The food tasted so good. I had the fried egg with apple wood bacon, and also tried the lemon raspberry French toast. Everything taste so fresh, which is a big plus for me.  <br><br>You should give this place a try, come early because it does get busy at later time.", "pics": null}}, {"review": {"des": "This is  my favorite must go place for brunch in Chicago.<br>They just downright serve good food. Sandwiches are worthy of the price, taste fresh, with very interesting flavors. I'm never disappointed when I go there. I once tried their bread pudding - BEST bread pudding ever- comes with raspberry and caramelized apple slices on top of it- comes warm right out of the oven, and just melts in your mouth ! On the weekends, the wait/ lines can be long, but if you leave to go to another place, you would have beat the traffic, find another place to park and wait in line all over again (applies to any brunch places in Chicago- so, stick to whichever place you picked and just toughen it out). Check out the pictures posted, you can see that the portions are good and you won't regret it !", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/tHwbGrsh58k_xcYryqECMg/348s.jpg", "caption": "The side salad has a great mix of greens and the dressing was tastefully done"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/VZulQ39JXTqi9eJ59QD2lA/168s.jpg", "caption": "The bread pudding - huge serving but so good !"}]}}, {"review": {"des": "Man. Man o man does this place have some good food. It's a decent sized place too. I have been here a few times and the wait time is never too long. But alright let's get to the fun stuff. So the menu is pretty decent. Lots of choices and I didn't know what to order. I'm generally pretty healthy with my food choices so I figured I'd try something light...Cinnamon roll french toast. *I was thinking it was traditional style with some cinnamon powder on top lol* but when this hit my table someone cued Darth Vader's theme music. I wasn't expecting such a large dish nor did I want it but I paid for it ol well I thought. First bite and all health consciousness was out the window! So much flavor! Just flavor everywhere! So good, I didn't even remember to take the picture until I was done eating it. Now I have to have this once a week!<br><br>Update: Great food, strange customer service.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/2tm1JVgUyOsy-NZXFKcoHw/348s.jpg", "caption": "Man. Man o man does this place have some good food. Cinnamon roll french toast!"}]}}, {"review": {"des": "After a year or two of being told to come here by friends and family, we finally made the journey. We were very happy that we did! With such a cool menu, the three of us tried different menu items and were all pleasantly surprised. I had some amazing pancake and berry dish that was so delicious. Someone else ordered an egg special and we were all jealously after trying it.  It's no wonder they're packed on the weekends!", "pics": null}}, {"review": {"des": "This the worst experience I had with brunch in Chicago. The seating lady told me it would be 30 minutes but she kept leading people who came after us in. When I tried to talk to her when it had been one hour, she refused and even told me that I couldn't stand in front of the desk. People have been standing there all the time because the waiting area is very crowded. But she asked me to back off. I was very upset because I have been carrying my daughter for such a long time. I suspect her doing so because I am Asian, the only Asian group in the waiting area. <br><br>Besides the service, we ordered the omelette( OK), bliss cake ( very sweet), and the famous pudding ( way too sweet)<br><br>It was my first time and last time coming here. Not worthy the waiting at all. Any brunch place would be better than this one.", "pics": null}}, {"review": {"des": "Wow. They knocked it out of the park, which apparently most of chicago already knows, but I was an m.henry virgin until earlier this week. <br><br>It's quaint. Cute. Andersonville-esque. <br><br>We ordered the veritable vegan scramble and scrambled eggs with cheese and chives. With one of the best fruit cup side dishes we've ever had in our lives. Was it your traditional melon/cantaloupe combo with one or two stray grapes? <br><br>No, it was mango, blackberries, nectarines, strawberries - fresh, seasonal, delightful fruits.<br><br>We inhaled both of our dishes, and got a lemon drop cookie to end the meal with something sweet. Was filling, healthful, - $25 or so for the two of us (totally reasonable, if not underpriced for a chicago brunch, amirite?) <br><br>I love this place. I hope to be back soon, but imagine that if you go not on a Wednesday at 10:45,  there might be a wait. Just a sense I have.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/INQYqxq3YcYrzmWK2zyMuA/168s.jpg", "caption": "Veritable vegan scramble -was delicious"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/7cl4DngGoengWraUspjMFw/168s.jpg", "caption": "Scrambled eggs with cheese and chives; and a delicious fruit blend"}]}}, {"review": {"des": "I had the BlackBerry Blisscakes, they were excellent. Got seated immediately, Service was quick and friendly, hats off to the wait staff. I would definitely return.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/EKeji_iloFJR8vpcAmcu4g/348s.jpg", "caption": "BlackBerry blisscakes excellent"}]}}, {"review": {"des": "Worth the wait. I had the fried egg breakfast sandwich and everything about it was fresh and satisfying. The breakfast potatoes here are some of the best I've ever had. <br><br>I would also suggest the bread pudding to share! It's not too sweet--only sweetened by the fruit they add to it.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/3bcXWoGUNA_iBN82uDtrOg/348s.jpg", "caption": "Fried egg breakfast sandwich and their bread pudding"}]}}, {"review": {"des": "I'm a control freak, but this time for brunch I let my friend pick and she chose M Henry. I was excited she picked a place outside the downtown area. Parking was a little hard at first, but I was able to find some non metered side street parking a block away.<br><br>We went for brunch around 11:45 on a Saturday and only had to wait 5 minutes. Once seated our server came over right away and we placed our non alcoholic drink orders (place is BYOB) and an order of the cinnamon French toast to share. OMG that French toast is soooo good! It's comes with sweetened cream cheese in the middle surrounded by fresh fruit. It is a must order.<br><br>For my meal I had the fried egg sandwich and it was good. The side of potatoes it came with were my favorite cause they were seasoned perfectly. My friend ordered the drunken eggs entree with the black bean cakes and she enjoyed it.<br><br>What makes this place 5 stars is the quality, portion size of food, and the prices. We ordered a coke, apple juice, and 3 plates (which were all delicious) and our bill came to $40. I will definitely be back! (Also service was great!)", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/eqC0dmVF-BlY3lWAV-9sYA/168s.jpg", "caption": "Jorge's Black Bean Cakes & Huevos borrachos (drunken eggs)"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/oHDzwN6PWv_bW3Ls1cJZ0g/168s.jpg", "caption": "Cinnamon French Toast - Delicious"}]}}, {"review": {"des": "Wow. So excited to find this place. Great food, really fresh ingredients and chill but tasteful decor. Excited to come back and try more stuff soon!", "pics": null}}, {"review": {"des": "Great food, good service, super cute interior. Everything on the menu sounded so good, it took me and my friends a long time to figure out what we wanted. I ordered the blackberry bliss pancakes- I felt that the berries were sour which threw off my plate a bit but besides that it was delicious. It does get a little loud in there because of how packed it usually is but service was still fairly quick despite how many people were there.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/lfHxeDF9Jn3MK9ljvJlwkg/348s.jpg", "caption": "Blackberry bliss pancakes"}]}}, {"review": {"des": "When someone is new to the city and asks where to go for brunch, this is my go to every single time. MHenry is amazing in every way: the food is amazing (and worth the wait), there are many sweet and savory options on the menu (seriously I prefer sweet, and usually there is only one or two options-this one has many--the Cinnamon Roll French Toast is mind-blowing and you should get it if you are into sweet), the servers are friendly, and the atmosphere is wonderful. Go to M.Henry, you will be glad you did!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/_KYcHp4ROrhxw8YF5nFR4A/168s.jpg", "caption": "Yes I ordered all of this, and yes it was one of the best decisions I have ever made."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/jSvarXm_4FMekxUqlJCtaw/168s.jpg", "caption": "One of the many out of town guests that I take to M.Henry. Seriously, I recommend this place to everyone. So delicious!"}]}}, {"review": {"des": "The BEST pancakes I've ever had.  The savory food is also excellent, and they have great vegetarian food.  It's the perfect place for a brunch date, or to bring out-of-town guests.", "pics": null}}, {"review": {"des": "Went here for brunch. Was seated quickly. Very open bright area with paintings on the wall. I ordered the bean bowl which was a delicious, filling vegetarian option, although you can add chicken if you'd like. Service was super fast and overall really friendly energy. Great for an easy going date or to bring the family. Not too pricy either.", "pics": null}}, {"review": {"des": "Great pancakes! Black bean cakes and turkey sausage were also very tasty. Service was just ok. Lastly, the coffee was not very good. Would definitely go back for the food.", "pics": null}}, {"review": {"des": "Fantastic brunch spot! Their savory and sweet menu items are al impeccable and top notch! Friendly service as well!<br><br>We ordered their Salmon Rotolone, Shrimp and Crab Cake Benedict, Pancetta Benedict, and Mixed Berry French Toast! <br><br>The Salmon Rotolone was very delicious! The omelette was well made and not overly salty or bland, the salmon slices inside were fresh, and the sprouts gave a great crunch and added texture to each bite! The side salad it came with was lightly dressed which was to our liking. It was a generous salad and not just some spring mix thrown into the plate. <br><br>The Shrimp and Crab Cake Benedict was so incredibly fresh and each bite sent us to heaven! The cakes were not just full of filler like bread crumbs like at some other places, there were crab meat in each bite.<br><br>The Pancetta Benedict was topped with just the most perfect poached egg! The creamy egg yolk just made the overall dish so mouth watering. The Pancetta was not overly salty and the slice was generous. <br><br>The French Toast was not overly sweet since the tartness of the berries matched well with the sweetness. The portion was generous and great for sharing with the table. <br><br>We loved everything we tried today and will definitely be back to try the other items!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/zL261gdCnYhJa1OFaz4f9Q/348s.jpg", "caption": "French Toast"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/QY5xRXrOHNbbubjdUoa2Lw/168s.jpg", "caption": "Shrimp and Crab Benny"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/7SgrYBY65uOGnbJJX_G76g/168s.jpg", "caption": "Shrimp and Crab Benny"}]}}, {"review": {"des": "m.henry is undoubtedly the best place for breakfast/brunch in Chicago, to the point that I am more than willing to make the hour+ trek from where I live to Andersonville and then greet a most likely long wait just to eat there. Between the amazing food, the cozy space, vegetarian friendly options, and the outdoor patio in the warmer months- this is an ideal spot! <br><br>You can't go wrong with anything on the menu, but if you don't try the blackberry bliss cakes, you're making a mistake. They're great to share with the table if you don't want to commit to a sweets-only meal. The black bean cakes and huevos borrachos are also a great option; the sauce is delicious and you can substitute soy chorizo for the meat option without a jarring difference in flavor. The sweet plantains on the side of the Latina omeletta make the classically good omelette even better. And the veggie and goat cheese quiche is a perfect balance of cheese, egg, and crust. Like I said, you can't go wrong. <br><br>They also serve metropolis bottomless coffee, and have a sweet little cafe/bakery in the front. Staff is always friendly and the experience is always worth the wait. This is definitely my go to recommendation for anyone looking to try a new brunch place.", "pics": null}}, {"review": {"des": "Food is mediocre. I had the blackberry bliss pancakes and it was not something I would return for.", "pics": null}}, {"review": {"des": "Delicious food. Mouth watering presentation. I've never been disappointed here. They offer items with vegetarian variations.", "pics": null}}, {"review": {"des": "Forgive me as I have sinned. I thought Mhenry was just hype. With a head hanging low, I was wrong. <br><br>We arrived on a Saturday & I don't know how it happened but there was no wait. Perhaps the God's wanting to rub my nose in it? When we left there was a line. The eyes, oh the eyes burning into you as each person was gleeful at your leaving.<br><br>I had the florentine shrimp and crab cake bennie and it was out of this world. It took all my strength to not snatch it, run & hover over it chanting \"My Precious\". I grudgingly gave samples under duress. <br><br>My honey got the rhubarb pancakes. Which were amazing. He also got a peanut butter gluten free cookie which I believe made his day. He is a freak for peanuts & gluten is not his friend (he made an exception for his main).<br><br>Our waitress was awesome. She had a great personality, was on top of her game yet we did not feel rushed.", "pics": null}}, {"review": {"des": "just, WOW. I had the dandelion, shallot, and leek omelette with fruit and it was just phenomenal. The fruit was obviously fresh cut and was one of the best medleys i've had, with berries, peaches, pineapple, and apples. I also had a vegan gluten free peanut butter cookie and it was amazing, obviously made in house that day. Some of the best brunch food i've had. The service was fast and efficient, however it did get a little loud. They had gluten free and vegan options as well as daily specials to die for. just wow", "pics": null}}, {"review": {"des": "There aren't enough positive things to say about m.henry and all of its' delectable delights. This is my go-to brunch spot in the best neighborhood of Chicago! And when I have visitors in from out of town, I send them there to. Their food is consistent and always delicious! I also love their atmosphere and the attention to detail the Owner put in to making their place super cozy.", "pics": null}}, {"review": {"des": "BLACKBERRY. BLISS. PANCAKES.<br>It is a well-known fact among my friends and family that sweet breakfast isn't my thing. M Henry's blackberry bliss pancakes converted me. The buckwheat pancakes are fluffy and flavorful, filled with a whipped, creamy marscapone and topped with sweet-sour blackberry sauce and delightfully crunchy toasted oats. I'm drooling right now, just thinking about them.<br><br>Want savory? M Henry does excellent savory breakfasts, whether you choose the omelettes or sandwiches. They also provide vegan-friendly options like soy chorizo. <br><br>A must for any brunch lover in Chicago!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/0nOPKNRzyFIaw6EGD279XQ/348s.jpg", "caption": "Omelette with home fries"}]}}, {"review": {"des": "Ton Turkey burger was good.  I wasn't crazy about the bun and the purple chips.  Next time I will order a la carte items since I'm kinda fussy (non-dairy and braces).<br><br>But as would definitely come again.  Service was prompt and fantastic and there's plenty of space and pretty art on the walls.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/_KVshp71GNHKaCkZ4ELrdQ/348s.jpg", "caption": "To-go coffee station and soft drinks."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/rRq3Il16r2oKd8GWtzMFGA/168s.jpg", "caption": "Tom Turkey burger without cheese or onions.  (I'm non-dairy).  Purple chips was my choice of side."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/uLFSR89J3QfTan7gVXU-jw/168s.jpg", "caption": "Art and lamps at M Henry."}]}}, {"review": {"des": "I don't understand the hype of this place. It's good, but very similar to most brunch places across the Midwest: big portions, cute presentation, ok taste. <br><br>Service is excellent. My sister and I went on a Saturday afternoon and we were able to get a table pretty quickly. The hostess at the front was super nice and friendly. The pastries at the front looked delicious. We didn't try them, but maybe something to go back for next time. <br><br>The food is painfully average and very forgettable. The latte I had was not good--milky, watery and tasted like any generic latte you'd get at a diner. If you're supposed to have a bakery/coffee station in your restaurant, the coffee drinks should be spot on. Disappointing. <br><br>For food, I had the dandelion omelette with potatoes and French bread. French bread was good quality. Potatoes were good with peppers, but were just normal breakfast potatoes. The omelette with the dandelion, which I was looking forward to the most, was a huge let down. I couldn't really distinguish any flavor from it; the cheese it was filled with was good but that's all you can taste. <br><br>We also got the lemon French toast. It wasn't too sweet, which was good, but again nothing to awe at. It was looked super pretty though. <br><br>Overall, an acceptable place to brunch. If you aren't able to get a table quickly, don't fret. You can just go to any literally any other brunch place and it'll be a similar experience.", "pics": null}}, {"review": {"des": "Great spot for Brunch.  The outdoor patio is lovely and makes you feel like you're far from the city traffic. The food is wonderful with an extensive selection of vegetarian options. Byob with their fresh squeezed juices was perfect.", "pics": null}}, {"review": {"des": "If you haven't gone to m.henry you need to go. they definitely live up to the hype. They are BYOB in case you were trying to get a drink. The place is a little small so they are pretty busy on the weekends, but it's definitely worth the wait. I didn't know what to order, everything looked so good on the menu and i was amazed at how quick they brought the food. Definitely coming back !!!!", "pics": null}}, {"review": {"des": "My usual \"go to\" spot for Saturday brunch. I love that they provide vegetarian options on the regular as well as their seasonal menu. I typically order the tofu scramble and sometimes if I have a sweet tooth I may get one of the specialty French toast as well. The portions are moderate so I never finish my food. Although the dining area isn't huge we've never had to wait for than 15min for a table. There's an area by the door where you can purchase delicious pastries to go. Service is always great and the place is pretty clean. The prices are very reasonable, I'll continue to come here!", "pics": null}}, {"review": {"des": "Went there for brunch and ordered the brunch plate. We had just got there before the rush. You know it's good when there is a line out the door. Everything was good! Food was great! Service was great! And we got our food within 10 minutes of ordering.", "pics": null}}, {"review": {"des": "Best french toast I have ever eaten. Highly recommend. We went on a Thursday afternoon, and we were seated right away.", "pics": null}}, {"review": {"des": "This is a phenomenal place for brunch. My friend and I went on a Saturday morning about an hour after they opened, and we were seated immediately. We ordered the blackberry bliss cakes; fannie's killer fried egg sandwich; and the dandelion, shallot, and leek omelette. We were two people and the servings were huge. If I were to go back, I would probably get the pancakes and the omelette, both of which I highly, highly recommend. The hype around those pancakes is real and well deserved. And that omelette is legitimately one of the best omelette I've had ever. The potatoes that come with the sandwich and omelette were delicious as well. Honestly, I would recommend this place to anyone. It is probably one of the best brunch spots I've been to, period.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/g7V5oRhxsFs2J7lm19246A/348s.jpg", "caption": "Fannie's killer fried egg sandwich: delicious"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/xjR3KZaJq5GJaModqWnWjA/168s.jpg", "caption": "Blackberry bliss cakes: phenomenal"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Ht0o0ZXUyXCx7UXQ_5Kazg/168s.jpg", "caption": "Dandelion, shallot, and leek omelette: one of the tastiest omelettes I've ever eaten"}]}}, {"review": {"des": "I came here for a late breakfast or an early lunch<br>When I walked in the host wait on us I think he is the owner or he is in charged of the place. He gave us a table next to other people very close to them but they were pretty empty or about 6 available tables. I asked them to seat me in a different table and the men in charge or host told me that those tables are for parties of 4 people or more and I said but you do not have anyone right now. <br>He them found a small little table and gave to is. <br>But  then I observed a couple that just arrived after us and they got a table for 4 but they were only 2 <br>And I observed the other tables empty my whole stay. <br>But when things starts bad end bad I ordered a sandwich that was on the special menu and the sandwich was horrible some type of veggie sandwich with a goat cheese or something I couldn't eat anything. <br>Will never go back<br>Honestly I feel discriminated there.", "pics": null}}, {"review": {"des": "Stopped for Sunday brunch around 10am. We were seated immediately with the option for indoor and outdoor seating. Our food came very quickly and was very good. As a vegetarian who eats mostly vegan I appreciated the multiple vegan specific menu options and also substitutions (soy chorizo, scrambled tofu, etc.) <br><br>We got coffee refills to go and left full and happy.", "pics": null}}, {"review": {"des": "We found this place on Yelp.  Figured we had time so we would show up and wait and am I glad we did.  The food exceeded our expectations.  We had to wait 45 minutes to an hour.  It was crowded by the door but it was sunny and cool out so we didn't mind the wait.  Everyone was kind and pleasant.  We were seated and realized everything on the menu looked good.  I settled on eggs, potatoes and toast.  My husband had the Pear French Toast and then we ordered a 1/2 order of the Blackberry Bliss Cakes to share.  There wasn't one thing that I can find fault with.  Every bite, from the eggs to the potatoes to the pancakes was yummy.  I would highly recommend taking the time to try this place out.  Make sure you have time to wait but it is worth it.  Price and serving size were reasonable too.  Two thumbs up!!", "pics": null}}, {"review": {"des": "Absolutely delightful lunch experience at M. Henry! The iced tea is fantastic and fresh AND bottomless. The sandwiches come with a choice of a simple green salad, blue corn chips, or slaw. We both choose side salads, and for some reason they were different, but both delicious! Mine had an asian sesame dressing with greens and pickled veggies. My husband's had an olive oil dressing, greens, radishes, cucumbers and tomatoes. The bread is made in house. I had the pancetta \"BLT\" on special. The pancetta was perfectly crispy and salty. The bread was fresh and flavorful. The tomatoes were thick cut. My husband had the grilled cheese with bacon and apples. There were a few choices for ingredients for the grilled cheese, but these were certainly delicious. Our server was very friendly and our drinks were never empty. I would absolutely come back and try breakfast next time!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/TU5APq0BDlEa5k6tlOQk2A/168s.jpg", "caption": "Pancetta \"BLT\" with side salad"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/NZf-UWCVUe8mPjEfljEV3g/168s.jpg", "caption": "Grilled cheese with apple and bacon. Side salad."}]}}, {"review": {"des": "Amazing breakfast for a relatively affordable price. Service was very quick and the food was delicious. I ordered fannies killer fried egg sandwich. The eggs were perfectly cooked and the potatoes were fantastic. I would definitely return in the future.", "pics": null}}, {"review": {"des": "I've been twice recently and very disappointed. Wasn't super busy but basic refilling of coffee never happened. Bacon was precooked. Food was cold.  Ordered white toast and told they didn't have any. Asked for grape jelly again told they had none. Very disappointing.", "pics": null}}, {"review": {"des": "We finally made time to try this brunch spot after seeing so many beautiful pictures online and hearing recommendations from work friends. The coffee was a real palette pleaser, but otherwise there is nothing that would bring us back with so many other great spots to eat in Chicago.<br><br>The cinnamon roll French toast was...simply too much. It was a sweet, sugary, syrupy overload that we tried to enjoy but couldn't. <br><br>The drunken eggs were good, no complaints, just not blown away. Would recommend if in the mood for Mexican.<br><br>My omelet was nicely done. Potatoes were ok, toast was close to burnt. The chicken sausage was overpowered with spices that made it close to inedible. <br><br>Overall, we won't be back to eat, but may stop it for a cup of coffee to go! Their pastries and quiche sold up front from the case look very good as well, so maybe give those a try.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ws0kb8U4Nga3Qj3af0Br_Q/168s.jpg", "caption": "Eggs with cheese n chives, cinnamon roll french toast, drunken eggs with chorizo."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/2Gaq6HZdMKFBmP8JTN1ACg/168s.jpg", "caption": "Cinnamon roll brioce french toast - too much sweet syrupy sauce :("}]}}, {"review": {"des": "This is my second time at M. Henry for brunch and it was amazing to see how much less crowded it was on a weekday. If you come here on the weekend, be prepared to wait. I stopped by here with a friend this time and we ordered the Pancetta Benedict and the Blueberry Bliss Cakes to share (both were daily special, I believe).<br><br>The Benedict was honestly pretty average-tasting. Being a brunch addict, I have eaten many, many Benedicts in the past and this one did not stand out in particular. The potatoes on the side had a strange flavor that I couldn't quite identify...in addition, they were a bit too mushy for my taste. On the other hand, the Blueberry Bliss Cakes were absolutely fantastic! The pancakes themselves were extremely fluffy and the addition of crunchy granola on top provided a nice textural contrast. In addition, the dish was beautifully presented and the dusting of powdered sugar on top made for a nice picture.<br><br>If I am to return to M. Henry in the future, I would most definitely order the pancakes again. I would not order the Benedict again but rather try a different item on the menu. I highly recommend ordering the Blueberry Bliss Cakes (daily special) or the Blackberry Bliss Cakes (a regular menu item) since both were wonderfully delicious!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/cAdxdI7O_A-0sFfJ235IqQ/168s.jpg", "caption": "Blueberry Bliss Cakes-delicious!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ZeE0PKJ4xfD3lbmaJEGGaw/168s.jpg", "caption": "Pancetta Benedict"}]}}, {"review": {"des": "I love this place!! Menu and staff is great. I went around noon on a Saturday and luckily I was alone or else you'd have to wait probably an hour for a table. This place is always packed esp for brunch. I sat down as soon as I walked in at the counter. My server was very pleasant and he was probably one of the most attentive servers I've had and the place was packed to the max! I got my food quickly and it was great as usual. This restaurant is simply a gem and everyone should go.", "pics": null}}, {"review": {"des": "HOLY GUACAMOLE. I had the Blackberry Bliss Pancakes, and MAN were they incredibly divine. You cannot go wrong ordering these. The granola on top is amazing. I don't even know how they do it. They just look like regular oats, but they're magic. They're the perfect amount of crunchy and sweet. There were two layers of pancakes, and the bottom one had blackberries in it. GENIUS. So good. I would feel bad not finishing it (but I did with a little help). It is a lot, so if you shared that would make sense. BUT it's so good that you probably wouldn't want to share. ALSO the fried egg sandwich is good. <br><br>The staff is really friendly, and they definitely pay attention to you. However, I was here very early in the morning when there weren't loads of people, so I don't know how much that attributed to their attentiveness. <br><br>DEFINITELY COME HERE IF YOU ARE CONSIDERING IT!!!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/kMfnD4Y4bisJTxNUIrV-wQ/168s.jpg", "caption": "Blackberry bliss pancakes"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/1jlFuYKoiBLYgT6gAYgxMA/168s.jpg", "caption": "Fried egg sandwich"}]}}, {"review": {"des": "m.henry is an absolute gem for lunch. From their salads, sandwiches, omelettes to quiches, all their dishes are fresh, color and healthy. Just a small tip to ask for dressing on the side. Their salad greens can come swimming in sour vinegar dressing. I'm hoping to return over the weekend to catch their bacon wrapped egg salad on available for Sunday brunch.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/I9ESMr4YcVruZqqrJx_4iQ/348s.jpg", "caption": "The sweets counter."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/0NjTB-XxTiDhqjmt-v_WVg/168s.jpg", "caption": "Salmon glazed salad."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/r8do2A3W8A_IluVIu3zQiA/168s.jpg", "caption": "Jorge's black bean cakes + huevos borrachos (drunken eggs)."}]}}, {"review": {"des": "First time at m.henry this weekend for brunch and I will be back! A friend and I went here around noon for food and coffee and the crowd wasn't bad. Seems like it's an early and mid-afternoon place. When we left around 1:30pm, it was busy again. You walk in and smell bakery too, which is like, the perfect way to welcome me to a meal. No complaints there.<br><br>Hostess wasn't very on top of the list, so we had to check in regularly, but once we sat down, the meal moved fast. food came out very quickly, all tasty and delicious. I got the fried egg sandwich, which is HUGE. I was shocked when they showed it to me, but naturally, didn't let it go to waste. The breakfast potatoes with veggies and the mango were nice touches too. With a little hot sauce, it was great. Plus, Metropolis coffee served nice and hot.<br><br>Service was nice and friendly as well. But for the weekend, it's not a place to hang out and catch up. Maybe that's during the week. So, we turned the table and took off. But, the menu was pretty extensive for breakfast and lunch items so I'll definitely be back to try more!", "pics": null}}, {"review": {"des": "Well worth the wait.  Food was extraordinary.  French toast with marinated pears, hot cakes with sweet cheese and berries., Home fries, eggs   It was all good.  We ordered three entrees to get a taste...but ate it all.  You will not be disappointed!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/_4cUP3OdVnHPWisRMeYFwA/348s.jpg", "caption": "The wait was well worth the magnificent food.  We ordered three entrees to get a taste, but ate them all!"}]}}, {"review": {"des": "This place is overrated. Noisy beyond belief, uncomfortable chairs, and crammed rooms. The food tastes like the people at the kitchen are doing their duties for a low pay. Everyone knows the difference between the food that makes you feel happy, and the food that is prepared so  children won't cry. I couldn't wait to get outside from there.", "pics": null}}, {"review": {"des": "The food was really good. It came out extremely fast, actually so fast that I was upset that I didn't get more of a chance to conversate with my companion. Dining room is average size, sort of loud but also kid friendly. Upon walking into the restaurant you're immediately met with a to go counter that'll definitely induce some drooling with its renderings of fruit tarts & muffins. <br>The lemon raspberry French toast was very good. What sets it apart from other French toast is the fact that it's made with \"brioche bread\" & you can tell the difference in the taste. I don't know if it's enough to get a return visit. To be honest I feel like dishes like this in the city are a dime a dozen though. Near my condo I have Yolk & Wildberry as options & I felt like this was too far a commute for an otherwise common dish in breakfast confections. <br>Also tasted the eggs in the \"two eggs\" & they were cooked to perfection. Although we didn't add the \"cheese & chives\" it at least sounded like a good option for the eggs. <br>In closing it was really simple good food!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/3MHXSvNLNTGujPGk3x1mlg/168s.jpg", "caption": "Lemon raspberry brioche French toast"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ZSVl2JueSlpw5uxurIkczA/168s.jpg", "caption": "\"two eggs\" & hot chocolate"}]}}, {"review": {"des": "Went in here with seriously high hopes and left quite disappointed. Ordered the sou cherry bliss pancakes and felt like they had taken sour cherries out of a jar and poured some of the jar juice on the place rendering the cakes soggy and falling apart. The others ordered sub par eggs and bacon with potatoes which were surprisingly cold. The highlight was the large English muffin and to-go jerk chicken empanada. The service was OK as we didn't get a refill until literally as we were paying the check. Disappointed after all the positive reviews.", "pics": null}}, {"review": {"des": "The food surprised me, I'll be honest I was worried it would be bland but it was anything else. The red wine sauce on the sausage is amazing, and I'm not really an egg person, but the cheese in mine made it perfect. Will likely be coming back, a little pricier than your average corner pancake place, but well worth it!", "pics": null}}, {"review": {"des": "This place is very comparable to the other popular breakfast places in LA. Be prepared to wait for awhile for a table...even if you have reservations, but the food is awesome.<br><br>I was hoping they would have a little bit of both sweet and savory in one plate, but that's ok. I was super famished and ordered a plate of the fried egg sandwich and a plate of their pancakes with strawberries. The pancakes were nice and fluffy. And the fried egg sandwich was a hit with everyone in the table who also ordered it.<br><br>I would come back and order the fried egg sandwich. It's that good.<br><br>I also noticed that they have a 4 seater bar, which you don't need reservations for, so if it's available, just head straight to the bar.", "pics": null}}, {"review": {"des": "We were from out of town and chose this establishment due to the high ratings.  I was really disappointed in the outcome. First they told us it would be 20 minute wait and it was closer to 40 minutes which would have been  fine if they would have communicated that with us. Secondly, my daughter found a hair in her potatoes and never an apology by the management or anything, that was so unsanitary. Thirdly, while my party were still eating a waiter proceeds to pick up plates which is fine but reaching in front of me dropping utensils once again no apology or acknowledgment. I would never come here again or advise anyone to do so. Lastly it's BYOB.", "pics": null}}, {"review": {"des": "So good! Doesn't take reservations and can get crowded quickly, but it's a delicious spot running in the same veins as the bongo room downtown. I'd say it's even better, though, for freshness of ingredients, beautiful plating, uniqueness of dishes, and overall just better quality. And, even though it's packed, it doesn't seemed crammed ever, at least not to me. The decorations are adorable! I had one of their quiches, but as you can see from my photos, everything was so delicious! Would recommend to anybody!", "pics": null}}, {"review": {"des": "This place has it all--<br>1. Delicious food<br>2. Beautiful presentation<br>3. High-quality staff<br>Definitely recommend!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/guAglP-FFNz1WkOFcwJ4RA/168s.jpg", "caption": "Fluffy pancakes with ample berries :)"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/mRRoZrYU49yaXOEBQUgYQw/168s.jpg", "caption": "Perfectly cheesey quiche and crispy potatoes!"}]}}, {"review": {"des": "M.Henry is a staple Andersonville restaurant I'd heard about for years. I finally made it in for brunch and I found it to be quite underwhelming. My brother and I shared their Eggs Benedict and Jorge's Black Bean Cakes & Huevos Borrachos (Drunken Eggs). Based on the food alone, this would be a 2 star review. What bumps it up a star was the friendly service and old school comfy brunch place feel. I wouldn't say don't come here, but I would say not to come here expecting the best brunch meal of your life, but rather a warm cozy environment to have a meal in.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/JzhubZnxQ0EhrC0kxeQU7w/168s.jpg", "caption": "Jorge's Black Bean Cakes & Huevos Borrachos (Drunken Eggs)"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/mqurxAUfiNrO96m_dje66g/168s.jpg", "caption": "Eggs Benedict"}]}}, {"review": {"des": "Yum! Hubs and I came here Saturday for brunch and were pleasantly surprised to find just a few minute wait for a table. BYOB. Small cafe in the front for to-go coffee and pastry. Service seems very efficient, allowing them to turn tables over quickly. I had the Dijon Benedict with house potatoes, which also came with a little sliced fruit, which was cooked perfectly with just the right amount of hollandaise. My husband had the fried egg sandwich with thyme and goat cheese which was filling and delicious. The homemade lemonade was tangy and sour, not sugary, exactly as I prefer it. We also took a sour cherry hand pie to go from the cafe and it was flaky, fruity, and overall fantastic. I wish I got two. Now I have an excuse to return!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/k1GyNLhz4PfXLZUz3XG2HA/168s.jpg", "caption": "Fried egg sandwich with goat cheese and thyme"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/WXJGzbG4ovGKrqsrQA97LA/168s.jpg", "caption": "Dijon Benedict with house potatoes"}]}}, {"review": {"des": "First time diner. Was really impressed with emu selection and how quick the food come out. Server was great and didn't hover. Enjoyed the mango and raspberry brioche French toast. Breakfast entree and coffee was about $15 before tip. Very intimate dining space. Only down side for my experience was every time coffee was refilled it was either spilled all over the table or on my sleeve. Will return though.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/o7isL_Kc4dX--3grRpsLNA/348s.jpg", "caption": "Came during the week before 12pm. Immediately seated. Mango & Raspberry French Toast was amazing! Good and fast service."}]}}, {"review": {"des": "Yes. Yes. Yes. <br><br>Get the egg sandwich: Toasty slice of a frrsh farm loaf || generous slice of bacon + avocado, tomato, cheddar + overeasy eggs || Toasty slice of bread ready to soak up the yummy yolk.<br><br>Thyme home potatoes are perfection: no greasy mash, nicely browned on the outside but soft goodness on the inside.<br><br>And the blueberry bliss pancakes? Once you get over the guilt of destroying the photoshoot ready presentation and break into the hidden marscapone, you'll feel soooooo glad you did.", "pics": null}}, {"review": {"des": "the food was too sweet, I had the cinnamon roll French toast. It tasted like the sugar that comes in cherry jars. It wasn't too good. The marscapone however was delicious, as was the consistency of the actual French toast. However the fruit was just terrible and tasted like it had previously been dried and frozen and was now being dipped in artificial sugar. Gotta say I expected more from this place, was very disappointed. My friend's meal however which was on the more savory side tasted much better. The potatoes tasted amazing. I felt it was overpriced for the quality of food I was served. The presentation though was 5 stars everything looked beautiful. The food was just subpar. The orange juice also didn't have enough pulp for me. Also I felt that the servers were condescending and definitely didn't deserve the $5 tip.", "pics": null}}, {"review": {"des": "Absolutely scrumptious breakfast--but I wouldn't eat on the patio if you made me. It smelled bad (I think their dumpsters are right there...gross) had dirty dishes and sitting in the sun, cigarette butts sprinkled around from waiters on break. It looks nice at first glance but if you take a closer look it starts to gross you out. Stay inside!", "pics": null}}, {"review": {"des": "This place was right off a bus stop so my sister biked there while I bused from the south. You could tell it's a hoppin place because a small crowd of people were waiting outside. I went in and was surprisingly seated right away because I was a party of two. They don't seat you if your entire party isn't present so make sure to coordinate times. <br><br>I ordered a chai and the asparagus Benedict while my sis got the spicy sausage omelet. Both came with fruit and a greens salad. <br><br>It wasn't long before we got our food and it was heavenly. The dressing was light to add just a bit of flavor but not overwhelming. The Benedict was so fantastic that I took a picture well into eating it. Service was good considering they were swamped. They also have a patio for those that would like to be outside. Check it out and your mouth will be in yum town.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/erjlQ6S6QIPb7k28BOlkzw/348s.jpg", "caption": "Lox and asparagus eggs Benedict with greens"}]}}, {"review": {"des": "If I'm in Chicago, I try to go to breakfast/brunch here if possible. Bonus points if it's on a weekday so that we don't have to wait in line. Protip: while they generally don't take reservations for brunch, they will do so if the group is large enough...which meant that one time I roped people I met at a wedding into joining us at brunch the next morning.<br> <br>The pancakes are my favorite restaurant pancakes of everywhere (take that, Bongo Room; take that, other cities). I've had bliss cakes and hot cakes (can someone please tell me what the difference is?) in rhubarb, blackberry, etc. The best strategy so that you don't get sick from sugar overload is to split an omelette and a stack of (bliss, hot) cakes with someone else. <br><br>Make sure you ask for hot sauce for your omelette.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/o14WP6uc1hB_NDQA_Umn4Q/168s.jpg", "caption": "Rhubarb hot cakes"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/OjtDVMLLGuClXZ67t71NDQ/168s.jpg", "caption": "Dandelion green omelette"}]}}, {"review": {"des": "Overall: One of the best brunches I've had in awhile. Fantastic food is the highlight with plenty to choose from.<br><br>The good: Great tasting food. So many different sweet and savory options. The quiche was fantastic and flavorful. Food came out quickly, coffee was hot, BYOB, service is friendly and attentive, tons of seating (though it does get busy).<br><br>The bad: Quiche slice could've been a little bit bigger, but I'm being pretty picky here. Really, nothing is bad.<br><br>Atmosphere: 9/10<br>Service: 10/10<br>Food: 10/10", "pics": null}}, {"review": {"des": "Favorite brunch place in Chicago!  Plan on a wait though, especially on a Sunday!<br><br>I recently had the cinnamon roll french toast.  Recommended by Food Network as one of the five best brunches in the US, it was very good but I have to believe that there are more than four that are better.  It was very tasty and I loved the vanilla creme, fruit and granola that they layer on top but the roll itself was a bit dry which was disappointing.  <br><br>I have had omelettes here in the past and have always been really happy with them.  When we go again (and we will) I will most likely go back to a savory dish instead of the sweet,", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/S9vavgJrPHMepdMqKYsrbg/348s.jpg", "caption": "Cinnamon roll french toast"}]}}, {"review": {"des": "Finally got to check this place off my brunch list and wasn't disappointed! We went around 11:30 on a weekday morning and it was relatively empty, but not dead, which was nice. We were able to be seated right away and got a table next to the window which was ideal for instagramming my breakfast! And people watching as well, but what's really more important? LOL<br><br>The service here is excellent, as is the food. The waitstaff always made sure we had everything we needed and then some. The menu has your typical breakfast/lunch fare but with a modern twist. They have a daily specials menu that had some pretty cool sounding offerings like a smoked salmon omelette (which my friend ordered and said was good), but I went for the dandelion, leek, onion omelette off the regular menu and WOW! I know omelettes aren't really anything very fancy, but this is one of the best I've had. Very fluffy, and I really enjoyed the fillings. The roasted potatoes that came with it were very nice as well. The portion sizes are nice and so are the prices!<br><br>They also have a display case full of pies and other baked goods that you can order. My friends and I shared a slice of the lemon pie which was one of the best lemon pies I've had. The filling was perfectly tart and the crust was a very nice graham cracker crust. <br><br>If you're looking for a brunch spot around Andersonville, would recommend! I know it gets busy on the weekends, so if you can, aim for the middle of the week!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/FnDNFV_KUaEJ0xV6f7CZcg/168s.jpg", "caption": "Dandelion, leek, onion omelette"}]}}, {"review": {"des": "Friendly service<br>Excellent breakfast and brunch offerings<br>Great recommendations from staff<br>Bench seating outside.<br><br>Fluffiest pancakes that will ever touch your tongue.  <br><br>This place is not to be missed.", "pics": null}}, {"review": {"des": "I really wanted to enjoy my experience here. We walked in with a group of 6 on a late weekend afternoon. The hosts were friendly and were able to get us seated within 15 minutes. <br><br>That is about where the good experience stops though. The food, while not terrible, didn't come close to meeting my expectations for the price and descriptions. And they don't really seem to know what the definition of an empanada is. The other breakfast and lunch fare was ok but bland considering these are \"specialty\" breakfast dishes. <br><br>The service also left a lot to be desired. The waiters and food runners seemed to not want to move around the table and shouted from one side of it, and also had us pass food across the table from one end to the other. They mumbled in the loud dining room and overall did not seem to know quite what was going on. They were also quite slow. Nothing that required us to call them over or anything but we definitely waited a good 5+ minutes after closing our menus before even being asked about drink orders, and waited at least 10+ minutes after finishing our meal for us to get the bill. Which is surprising because bus boys were trying to clear half empty plates every minute or two. <br><br>Overall I don't think M. Henry is worth the price or the typical wait. You won't leave feeling terrible but there are many better brunch and breakfast places in the neighborhood.", "pics": null}}, {"review": {"des": "Parked on the street and walked right over to the restaurant. We got seated right away and got served my Cezar. Our order was correct and within time. The service was overall good and the food was nicely presented and cooked. Will come back.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/TW6nle3U0rDfKqa2RxHOyw/348s.jpg", "caption": "Outdoor seating"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/WxjemnAm0KKXFLnnkW3kLQ/168s.jpg", "caption": "Tastes good"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/RGAK8ppMDFBLqk_0VDcYsw/168s.jpg", "caption": "Well presented"}]}}, {"review": {"des": "Great brunch and breakfast place, even worth making the trip up Andersonville if you're looking for a destination. Everything is so good here. I'm partial to the Lemon Raspberry French Toast. Note* you can get a half order if you ask the waiter. I've also had the Polenta (really tasty) the bacon is great. I've had a lemon poppyseed muffin that was moist and tasty as well. I really can't say enough about this place as a staple of the neighborhood. <br><br>They have an adorable back patio area and I love the plate/silverware. Great Chai tea and my mom loves the coffee. I can say it's a great location with charming decor and attentive staff.", "pics": null}}, {"review": {"des": "I absolutely love the atmosphere of this restaurant! I ordered the eggs Benedict brunch special, and it was so delicious. I love their concept of BYOB, and we brought prosecco to make our own mimosas. The staff was incredibly friendly, attentive, and professional, even with a full, busy restaurant. Will definitely return!", "pics": null}}, {"review": {"des": "Almost a 5! We went to M.Henry for the first time and enjoyed a delicious brunch as a recommendation of a friend. We could not get a reservation so we took our chances and walked in. The wait was less than 30 minutes.<br><br>They have a nice menu and a good service. The only reason I gave a 4 and not 5 stars is because I was disappointed w/ their coffee. I ordered a Americano and cappuccino, both were tasting bad. Just like a old coffee.", "pics": null}}, {"review": {"des": "One of my favorite brunch/ breakfast spots!<br>The coffee is good. Nice pastries. Omletta Latina is my favorite thing to order. BB Bliss Pancakes are good, I'd share them. The wait can be long if you go on the weekends. I'd suggest going during the week in the mornings when its not so busy", "pics": null}}]}