{"name": "mannys-cafeteria-and-delicatessen-chicago-3", "reviews": [{"review": {"des": "A Chicago classic - this iconic Jewish deli is an all around gem with your favorites. Forget Elon Musk, teleportation has arrived as you step through the doors you arrive in a setting akin New York's lower east side in the 1940's.  Hot pastrami, mazal ball soup, latkes, oh my! Manny's crushes it on all levels and is a must try for adults, kids, and grandma and grandpa. <br><br>Whether it is for Saturday lunch or your wedding reception, Manny's is an instant crowd-pleaser that will not disappoint.", "pics": null}}, {"review": {"des": "This was my 2nd visit to Manny's for lunch and I must say<br>It is the perfect place to enjoy great food and service. <br>The sandwiches are larger than any I've ever seen before!<br>The amount of Corned Beef, Beef Brisket & pastrami they put on your plate is Amazing! The sandwiches are piled high and barely stay on the bread.  <br><br>The side selections are plenty, from Mac&cheese to matzah ball soup. They have daily specials and an attached Deli. <br><br>I was anxious to try the Infamous Potato Pancake, I'm not sure how many calories it has but it is worth the extra days in the gym!<br><br>Bravo Manny's.......We will return!", "pics": null}}, {"review": {"des": "On a day when we where in the City, my wife and I decided to go to our favorite deli, Mannys on Jefferson Street. As usual, it didn't disappoint. My wife had the corned beef on pumpernickel and I had the combination of pastrami and beef brisket on an onion roll. Of course we both had to get one of Mannys staples, the classic potato pancake.<br><br>The sandwiches were piled so high the bread kept falling off. As usual, both sandwiches were sublime! The corned beef was lean and flavorful and the combination of the pastrami and beef brisket was tender and flavorful. And those potato pancakes, fresh of the griddle, were awesomely flaky and light.<br><br>Nothing beats Mannys on a cold winter afternoon. If you've never gone and like delis, it's a must do!", "pics": null}}, {"review": {"des": "First time visitor. We saw a Latke's recipe from these folks on WGN so we thought we would go for lunch after wanting to try Manny's for years. As we were getting trays we were greeted by a really friendly worker behind the counter. We passed the salads and made our way to the full lunch section. I selected baked white fish and was offered a potato and a side. I asked for a Kugel and he put one on the plate and said \"that's it\". I wish he had told me that picking a Kugel negated getting a veggie side. Oh well, my strange looking lunch of a piece of fish and a Kugel still looked tasty. <br>My companion selected a half brisket sandwich and veggie soup (the Friday soup of the day) and a Latke. <br>At the register the $36 ticket surprised me a bit. We had water to drink.<br>  <br>Overall, the brisket was a hit. There's also horseradish and mustard at the table. The fish was good and the Kugel hit the spot. I did miss having a more regular side to go with a baked fish dish. The rye bread on the side was really good. (At the Store part of the deli they wanted $8 for a small rye bread, in keeping with the expensive theme of this place). The soup was ok. It had a lot of barley and not chunky vegetables that would have made it special. <br><br>The Latke was not good. It was dry, very crispy and seemed to not have much potato in it. No applesauce or sour cream either. That would have helped. Most of it was left on the plate. <br>How ironic that what got us to go to the place (the WGN Latke Demo) ended up being the worst part of our meal.<br>We're glad we went. We thought the food quality was good for the most part and the help was really friendly. Very clean and comfortable restaurant. We also thought the place was a bit over priced. If I recall correctly, my one filet of fish and a Kugel was $16.95.", "pics": null}}, {"review": {"des": "Don't yell at me for the 3 stars. Yes this place is a Chicago institution and yes we loved the cafeteria style deli that a lot of locals still frequent. But the food is what it is, just decent. You come here for the experience and not the food.<br><br>So let's talk about that experience. Very friendly staff serving you all their various foods. From the hot food section we got their \"mac and cheese\" which is spaghetti noodles in a cheese sauce. The kids loved it. <br><br>We also got the matzo ball soup which was very skippable. The matzo ball was dry, cold and crumbly. The soup was fine but not really any better than canned soup.<br><br>We also got the smoked turkey sandwich which was fine and I got the pastrami/corned beef combo, which is what most people are there for. The corned beef is ok but not memorable. The pastrami is pretty good but a little drier than I hoped. Definitely get the potato pancake because that was pretty good but I think it's weird their sour cream comes in a squeezable packet. <br><br>All in all, you know what you're in for with Manny's. An old school deli with decent food and great vibe. But if you want great food, there are better places.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/LlExzihHVm6q8FANoAGZFA/348s.jpg", "caption": "Sliced turkey and \"mac and cheese\". Kids liked the mac and cheese"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ZQZxCP9T4bykQQeIPJ06ZA/168s.jpg", "caption": "Not good matzo ball soup. Pass."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/WJA2QFW8SNiKuEMonLM4DQ/168s.jpg", "caption": "1/2 a pastrami/corned beef combo. Skip the corned beef. 1/2 a sammy is plenty for one person"}]}}, {"review": {"des": "To start....there is a parking lot to the east of the building. Thank goodness. <br><br>As you walk in, you grab a cafeteria tray and your silverware. You slide your tray down the service line as you make your selections of entrees and sides. My favorite go to is the corned beef sandwich or pastrami. They have half options available too. Everything receives two deli pickle spears. <br><br>You pay at the end registers. Don't forget your drink. <br><br>Open seating and self serve for your soft drinks. If you want something else you can grab a Dr Brown's soda or a sparkling water. Bonus!<br><br>Bus boys take care of your trays when you are finished. Tips are not frowned upon. <br><br>Bike parking on street.", "pics": null}}, {"review": {"des": "Classic Jewish deli in a town that's lacking them.  It seems they do all of the classic dishes to a point.  I had the lox and bagels which were fantastic.  A trip to mannys is a must.", "pics": null}}, {"review": {"des": "Enjoyed an after church lunch with my daughter for her first experience at Manny's.  We both had Pastrami sandwiches and while moline was dipped on a French roll, hers was turkey on pumpernickel (which was delicious by the way).  We both had potato pancakes that were cold, and while that was a miss, the sandwiches weren't, but for $42, NOTHING should miss.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ctrJmwRQpVaMxTX_j_y1tw/348s.jpg", "caption": "My daughter and I after her first Manny's experience"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/shrCr2I_KMZdeQ9jqZXK5w/168s.jpg", "caption": "My daughter and I after her first Manny's experience"}]}}, {"review": {"des": "I stopped in for lunch the other day with a friend. It was the first time I have been back since it's facelift. I was worried it would be too new and snazzy but it wasn't. It was opened up and shined up a bit but still held that classic old time charm.<br><br>As you start your journey with your tray, feeling like you are in a school cafeteria, the excitement begins. You walk along deciding what you might choose for your meal. I enjoyed cabbage and chicken noodle soup while my friend chose a huge sandwich, matzah ball soup and sampled one kreplach. If you are a little hungry or absolutely starving - this place is for you.<br><br>The staff is always amazing, friendly and personable. It feels like they have worked there forever as they treat you like family. They are silly and sassy as they get your order exactly the way you asked. I always look forward to saying hi to Chazzer Rye. He will scold you and it will feel like a huge sweet bear hug!<br><br>I'm not sure what I love more, the food or Manny's staff!!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/f0iuPn9FxlJ7nHA8Irz8EQ/348s.jpg", "caption": "The Chazzer Signature Sandwich with cheese and cole slaw on top!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Nh2E2gitSsP1w1jZh9Bfsw/168s.jpg", "caption": "The Chazzer, Matzah Ball Soup, 1 Kreplach and Rye Bread!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/zJARJ6TMSLPGkAbwz2bw7Q/168s.jpg", "caption": "Chicken Noodle Soup with serious noodles!"}]}}, {"review": {"des": "Honestly the food is no better than 3 stars. Pastrami and corned beef are serviceable, corned beef hash was dry/overcooked and scrambled eggs were devoid of flavor.  Still, there's something charming about an institution that's been around since 1942 and cranks our consistent deli food in a cafeteria environment.  Worth a trip if you're nearby.", "pics": null}}, {"review": {"des": "Where is this place band my entire life? I can't believe that I've been in Chicago seven years and have never been here until this past weekend. The restaurant was super clean all the staff was super friendly and I am sure that I eat my calories worth of the day while here laugh out loud. They had the best carrot cake that I have had in years. Everything was super fresh I cannot wait to go back to Manny's deli in the near future.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Y4IvXdk29wlfvfNMeHrF5g/348s.jpg", "caption": "Sooo good"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/DCZmKp90a9COD6paRmhfGg/168s.jpg", "caption": "The nicest guy"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/DoauhrHUU1K4VRwZ5PMImA/168s.jpg", "caption": "Whole sandwich"}]}}, {"review": {"des": "Manny's Cafe is a Chicago classic that every local knows about. It's one of the only authentic Jewish delis left in the city AND President Obama is a patron. He even had them flown out to Washington, D.C. a few times to cater official White House events. <br><br>It's a no frills cafe where you grab a tray, go down the line, pay at the end, and find an empty table in a large cafeteria. It's quick. It's easy. It's predictable.<br><br>What's not predictable is how amazing the food is and how good the coffee they brew is. The beef hash comes with a side of toast and is the BEST beef hash I've had. Order an egg over easy on top. The coffee is La Colombe and their drip coffee is excellent. <br><br>Next time you're in Chicago and want to dine with the locals, head to Manny's!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/u2pS1RX6tgibsibhRb5epw/348s.jpg", "caption": "Beef hash- so good!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/IfscFNezBSXT-UjxI57Z7Q/168s.jpg", "caption": "La Colombo coffee."}]}}, {"review": {"des": "OMG~~~!!! Huge~kinda remind of KATZ'S in NYC.<br>I was 57th st Art Fair in Chicago. One of the customer brought me Pastrami or corned beef sandwich included mustard, pickles and potato cake. <br>The customer said you have to eat this!!!<br>I ate only half of it. <br>I love it!!! <br>Look so good and taste good too.<br>I enjoyed huge size of Pastrami sandwich! <br>I want to go to here next time. Thank you customer brought me fabulous sandwich and Manny's!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/7ZVsOJIZEn9pmMstYx9DJA/348s.jpg", "caption": "Best Pastrami !!! Huge size"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/czzAJzgByoX2xk9hRapyCg/168s.jpg", "caption": "Huge Pastrami~ delicious"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/QzNDpsWPucg0dMg0EG1xrA/168s.jpg", "caption": "Manny's ~ !!!"}]}}, {"review": {"des": "It has been awhile since I've been here!  They have remodeled the place making it more modern and have added a deli.  The place looked more updated and inviting.  The food is still delicious!  Have to go with the corned beef or pastrami.  Don't think of passing up the chopped liver.  It sounds gross but if it's your first time,  this is the place to try it.  This time we came a bit early and had the option for breakfast and/lunch.  I got the 2 eggs with pastrami with potatoes on the side.  You can choose between the pancakes or toast with the meal.  I went with the toast.  I regret not ordering the pancakes as my side,  the person I was with said they were great!  I'll tell you,  runny eggs on pastrami is out of this world.  Give it a try!  The parking lot is sort of small so it's wise not to go when there packed.", "pics": null}}, {"review": {"des": "This is the legendary Jewish delicatessan of Chicago. The food has not changed in 50 years except for additions to the menu. If you want traditional Jewish food, loaded with Schmaltz, some of it loaded with flavor all of it loaded with love, this is the place to go. It is not the small time cafeteria used to be but much much bigger. And believe it or not, it still draws a huge crowd everyday for lunch.<br><br>From kishke to knishes, blintzes to brisket, chicken soup to cho suey, latkes to chopped liver, boiled tongue to turkey, brownies to ayerkichel, you will find it here. Portions are big so come with an empty stomach. Lines are long so come ready to wait.<br><br>In my recent visit, my knish was not so flavorful, but it was greasy and heavy. I was grepsing (burping) for the next 2 days. My pastrami sandwich on the other hand was delicious on rye bread with Manny's brown mustard. It was huge. It was just like the $17 pastrami sandwich used to get at the Carnegie Deli (z\"v) in New York City... and the price here is the same now. The pickle on the side was poyfect! The latke on the side was decent. Both of those come with the sandwich.<br><br>Alongside, I drank a Dr. Brown's Cel-Ray...old-school, the way I like it!!<br><br>On this day, I went at lunch time, and the joint was packed to the gills! There were high school kids and senior citizens, businesspeople people and tourists. Tables were maintained nice and clean that regularly attentive service.<br><br>After lunch, if you can stand up, take a schpatzier through the open portal next door to their to-go deli. You'll find hard salami is hanging from the wall, ready to go smoked fish, old-fashioned candies, and touristy tchotchkes.<br><br>Plan for an expensive lunch here.<br><br>Parking in the neighborhood is not a-plenty but it's usually somewhat easy.", "pics": null}}, {"review": {"des": "This sandwich was swole. Well with the price. Staff are super personable in a tough living kind of way, but it's all part of the vibe. Personally I loved it. The matzo ball soup SLAPS.", "pics": null}}, {"review": {"des": "Manny's was OK.  Not spectacular, not great and not memorable.  I ordered a combo of corned beef and pastrami.  It was huge, but the meat was not great quality.  I would rather have had less or paid more for better quality.<br><br>I received a comment on this review by the reshuffle owner.  He asked me if I complained when I was there.  There is no way to reply to him directly.  The answer is that I did not complain when I was there.  I just expected better quality than I received.", "pics": null}}, {"review": {"des": "We went for breakfast and ended up eating dinner. Two plates full of brisket, mashed potatoes, and spinach. A bowl of lentil soup and a bowl of matzo ball soup too. I can not say a bad word about the food at all. Everything we had was extremely good and brought back many childhood memories, I am happy that Manny's is still around. Only one negative today, a few of the staff were a bit unpleasant to each other and expressed their displeasure for each other in front of the patrons. Despite that, great food and highly recommended.", "pics": null}}, {"review": {"des": "I found out about this place on a recommendation and decided to try it. Being from Naperville, I love how Manny's is right off the highway. Very easy to get to. Plus, I heard that the neighbor is nicer than it used to be. <br><br>As for the layout, as everyone has said, it's cafeteria style. There are plenty of people who clearly come here a lot, so don't hold up the line. Decide what you want then jump in. I would highly recommend the pastrami sandwich (which is ENORMOUS) and the matzo ball soup. **note: my next visit/edit to this review will include the corned beef**. <br><br>Prices are decent, especially for what you get, and the atmosphere is relaxed. I went on a weekend, so I didn't see all the lawyers and construction workers, but this is a phenomenon that I heard about. <br><br>Highly recommend Manny's whether you're in the city already or would need to make a special trip; it's worth it!", "pics": null}}, {"review": {"des": "Manny's is a Chicago Institution!  It's an old Jewish style deli that has been around since 1942.<br><br>There is a small parking lot in the back of the location but I would suggest that you park on the street and pay for parking as it's always filled.<br><br>We had a pastrami sandwich with a potato pancake and a Reuben sandwich with a potato pancake.  You have your choice of corned beef, pastrami, turkey pastrami or roasted turkey meat on the Reuben. Which is grilled with Swiss cheese and Kraut and served with homemade 1000 dressing.  Both sandwiches  come with two pickles.<br><br>The sandwiches are huge and well worth the prices of 13.95 for the pastrami and 14.95 for the Reuben.  In fact for the average person, they put enough meat on a sandwich that you can eat 2 X from one sandwich.<br><br>This visit I found the pastrami to be extremely dry and the Reuben was good but also a little on the dry side. We were a little disappointed since we had not been here for a while. I think next time we visit we might try one of the everyday hot entrees as they looked really good.<br><br>Come for the cool atmosphere and huge sandwiches or try a hot entree as they seem to be a favorite of of locals.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/4R4oQCsdOrmB02aJ813bPQ/168s.jpg", "caption": "My huge pastrami sandwich"}]}}, {"review": {"des": "This authentic Jewish deli is such an authentic, Chicago staple, having been around for years and undergone multiple remodels as its business continues to grow. I had a nice chat with the owner, Ken, over our delicious meal, and he was such a sweetheart. I learned all about the history of the place, his family, etc. The restaurant as a cool concept as it's sort of a cafeteria/buffet line where you go down the line and put what you want to eat on your tray and pay at the end before you sit. They serve classic Jewish dishes, such as potato pancakes, matzah ball soup, and knish. They're known for their staple sandwich, a corned beef and pastrami monster of a sandwich. It was so flavorful, and they give you a variety of bread you can put the meat on--we chose challah roll. It was so delicious. We also ordered the matzah ball soup, a side of mushrooms, the beef stew, a knish, a side of lox, a potato pancake, a salad, and a cheese blitz. The mushrooms came cold, and i liked them! The beef stew had a lot of flavor and was tender. The carrots in the beef stew might've been my favorite. The knish was excellent and drowning in a yummy gravy. I absolutely loved the matzah ball soup. It had a saltier broth that was super flavorful. I also got to make my own salad, which made me feel better about all the other stuff i consumed LOL! The potato pancake was a little lacking in flavor in my opinion, but the lox made up for it. It was so fresh and not fishy at all. The cheese blitz at the end was the perfect way to finish on a nice, sweet but not too sweet note.", "pics": null}}, {"review": {"des": "This was everything people hyped it up to be. I had friends talk about this place since I moved here and I finally got a chance to try it out.<br><br>The parking lot was kinda hard to maneuver because the spots were close together but the snow also played a part in that cars weren't able to pull all the way up in their spots.<br><br>You walk in grab a tray and order from one of the guys behind the counter. I got the matza ball soup, kishke, 4 kinder (sandwich with turkey, pastrami, corned beef, and brisket), and the short ribs.  The matza ball soup was terrific and the kishke had a beef casing on it (as apposed to a plastic casing) and they put gravy on top. It was delicious. The sandwich was fantastic! The meat was so flavorful and went so well together.  And the short ribs were out of his world. They were so tender I could cut them with a fork. The short ribs came with mashed potatoes and gravy which was good (nothing out of this world but still very good) and steamed mix veggies.<br><br>The atmosphere was nice. It is exactly what they say it is, a cafeteria. And next door they have a deli where you can buy frozen soups as well as meat and drinks.<br><br>I would definitely recommend coming here. I can't wait to go again!", "pics": null}}, {"review": {"des": "We took my 91 year old great uncle on a trip to Chicago, and for someone his age, he has an insane appetite. I mean, he can eat a lot of food. <br><br>Well, he wanted a good meal before we went out for the evening. We automatically thought of Manny's over on Jefferson. <br><br>At one point, my Mawmaw lived on Jefferson. So, I knew it was a sign.<br><br>All five us got the roast beef with the old school noodles and cheese, and it was awesome! In fact, my great uncle said it was the best that he ever had, and that means a lot coming from someone that is 91 years old. I sure he has seen a lot of roast beefs and noodles.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/7MpneiBLfUdltvn3yH7VTA/348s.jpg", "caption": "All the food looks great!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/urCJCuHg3qcsYqbkzokwCw/168s.jpg", "caption": "Matzo ball soup"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ObKteDNYhmzksPgnhkztYA/168s.jpg", "caption": "My 91 yr old uncle said it was the best roast beef brisket ever!"}]}}, {"review": {"des": "If you want to grub out- Jewish style- this is your spot. WARNING you will be tempted to order everything while in the tempting genius ordering process. It is cafeteria style, so you have to watch every type of food be made before getting your final order in. So you may end up with a tray full of random food items you didn't originally intend to get. But they're all pretty much worth it.<br><br>Prices aren't bad either considering the huge portions you get. This isn't a fancy restaurant, so you're not gonna get fancy flavor or quality. You will get, however, your money's worth in quantity and your stomach-full's worth in comfort food. Don't be afraid to try anything and everything. <br><br>On this particular visit, we ordered some corned beef eggs benny and potato latke. Both were great. Next time around, I'd like to try the lox and the reuben, which both looked mouth-watering on the tables around us.", "pics": null}}, {"review": {"des": "Serving cafeteria style deli kinda threw my expectations off momentarily .<br><br>Ordered a cup of matzo ball soup, one potato pancake (latke) , and a half of a regular pastrami sandwich.<br><br>Highlights were of course the pastrami sandwich and the latke. They give you very generous portions even if it is only a half sandwich. Can't imagine how much you get for the chazzar!<br><br>Soup was somewhat disappointing as it was just broth and a matzo ball. I like my matzo ball soup with chicken, celery, carrots etc.<br><br>Decently priced at around 16 dollars.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/INSQGBihOb9fY8gdMoHDfQ/168s.jpg", "caption": "The sign"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/w5w-SPiyQL2RVcKAeof0yg/168s.jpg", "caption": "Half pastrami huge portions, cup of matzo ball soup"}]}}, {"review": {"des": "This place... <br><br>We loved it. The cafeteria style dining is old school Chicago and we love it. Hubs got the pastrami and corned beef sandwich and it didn't disappoint. I got the chicken pot pie and while it looked really good it was very bland and I could only eat half. They did offer a smaller portion for our daughter of one of the daily specials which was nice. They gave each one of us a coupon for a free cookie in the bakery which was a nice touch. Will be back!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/YUuOF5CKfd0r7t5PtY4NRw/348s.jpg", "caption": "Pastrami and corned beef sandwich"}]}}, {"review": {"des": "The food is amazing! It's simple and fast! Huge portions but it's not cheap. I guess you get what you pay for on the one! great place for a fast lunch or a grab and go!", "pics": null}}, {"review": {"des": "Manny's is a Chicago institution. We love coming here for breakfast. It's one of the few places in the Loop area that has free parking (other places have metered parking). The food is the main draw though, and it is consistently good. Portions are good and prices are decent.<br><br>Manny's is cafeteria style... for breakfast, you order at the register. They bring the food to your table when it's ready. I've had the corned beef hash omelette (served with potatoes and raisin toast)--yum! The lunch and dinner menu items look excellent, but we have not had a chance to make our way here in the afternoons or evenings. We are looking forward to those meals soon!", "pics": null}}, {"review": {"des": "This is an original place. Where absolutely great food and excellent customer service is the norm since 1942. All the Jewish favorites with even a touch of the contemporary. Thanks for offering gluten free bagels. Please keep the tradition alive. The best Chicken soup and corned beef sandwich in Chicago!  Fantabulous deli!!!!  Thank you!!!!!", "pics": null}}, {"review": {"des": "Classic. Not fancy, cafeteria line, trays and all. Best, hugest corned beef sandwich ever. Easily enough for two hungry adults. Not super lean, but super thin and flavorful. Delish. Noodle kugel is a little sweet, but good and also a huge portion. Everything looks good, need to go back again. I always seem to get corned beef when I go because it's that special. Street parking or small parking lot. Yum.", "pics": null}}, {"review": {"des": "Great example of what a 1940's diner/cafeteria environment is all about. Awesome portions, great and huge variety. Typical Chicago scene with it's share of business people, lawyers and out-of-towners experiencing the place. Definitely a Chicago staple.", "pics": null}}, {"review": {"des": "*** The following review contains *NO* hyperbole! ***<br><br>OK - right here, I have to admit I am something of a fanatic when it comes to Pastrami.  I will always go out of my way to find the best examples in any town I happen to find myself in, but having grown up in New York, my standards are very high!  Lucky me, 'though, because I live in Chicago, home of Mannys!<br><br>I must beg your apologies because my ability to adequately describe the incredible depth of flavor they achieve in their Pastrami falls woefully short of the mark!  I also prefer the 'bite' of their Pastrami as contrasted with Katz's which comes off as wet by comparison.<br><br>My buddy Gino G. right here at Mannys makes the best Pastrami sammy I have *EVER* had anywhere (including the late, great Carnegie Deli, Katz's, and Sarge's of NYC!!!)<br><br>Make sure your order includes one of their potato pancakes and you will not be disappointed!  I always get some raw onion to enjoy on the sandwich along with some of their excellent spicy deli mustard and (joy of joys!) their complementary horseradish!<br><br>Having waxed rhapsodic about their Pastrami, I hasten to add here that you can not go wrong with anything you choose from their extensive selection of hot and cold items, mouth-wateringly displayed as you work your way down the counter!<br><br>For me, this is a must visit restaurant in Chicago!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/c0QWAUmcA4Kk-gccu5zzTg/348s.jpg", "caption": "A sampling of Mannys Deliciousness between 05-2012 and 09-2017"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/GPH3fLGYy6ks4MBOczGNPA/168s.jpg", "caption": "A sampling of Mannys Deliciousness between 05-2012 and 09-2017"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/TU3JLo8n3CaJS405CmPQtA/168s.jpg", "caption": "A sampling of Mannys Deliciousness between 05-2012 and 09-2017"}]}}, {"review": {"des": "The line looks intimidating but the cafeteria style line moves along quickly. I had the short ribs and the corn beef & pastrami combo.<br>The serving sizes are huge, you definitely get your monies worth. Plenty of room to sit. Definitely a must do!", "pics": null}}, {"review": {"des": "I'll be back! The food is tasty and there's a lot of it. The oxtail stew smelled and tasted heavenly. The pastrami sandwich was piled high and almost as big as the plate on which it was served. <br><br>Oh, free valet parking thank goodness. No parking spots available on a Thursday at 11:15AM. <br><br>Line out the door by 11:30. Loved to see all the locals/regulars lining up.  Don't forget to look at the pictures on the walls. <br>Next on my list is the Ruben followed by the short ribs which are fall off the bone.", "pics": null}}, {"review": {"des": "My boyfriend and I walked into Manny's after we had left binny's and all the staff cracked jokes about our case of corona  The entire staff was super friendly. We were recommended the corned beef and pastrami combo, which was our first choice anyways. The amount of meat in the sandwich was ridiculous. The corned beef was a little dry and the pastrami were too thinly cut, but it was a good amount of fat and meat that cut through the dry corned beef. I was not too impressed. We went a little late in the day so i figured if we went earlier it would be a better experience. I would come back to try just the pastrami sandwich and possibly the matzo ball soup & potato pancakes.", "pics": null}}, {"review": {"des": "I always liked this place, I don't come often but enjoy when I do. Healthy portions, lots of choices and clean. Friendly staff, a little over priced in my mind.", "pics": null}}, {"review": {"des": "The cafeteria style diner allows for quick service, and lunch choices include the quintessential items like excellent pastrami sandwiches that come with Manny's own pickles (Manny's own horseradish mustard at the table) and perfect matzo ball soup. <br><br>Red velvet cake was disappointing though. Dry and a little tasteless. <br><br>But icing on the cake is a magician on Saturday's. He had me in stitches, and our daughter was mesmerized. He even made her a horse-balloon.  <br><br>The diner also offers free valet parking, and the deli sells some of their staples. Well worth going to for the the food, as well as the experience.", "pics": null}}, {"review": {"des": "Awesome place for pastrami and corned beef! Its a bit pricey but the amount of meat is ridiculous!!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/bUuxKvsZMScQxG_nuwv-2g/168s.jpg", "caption": "Pastrami rueben"}]}}, {"review": {"des": "Sure the food is very, very good, but what makes Manny's special are the people. The line servers are wonderful", "pics": null}}, {"review": {"des": "I think Manny's is overrated in my opinion. However, that does not subtract from the quality of their food. I enjoyed my $31.00 meal for a sandwich, two small soups and a side of Kugel. <br><br>We got the chazzer and split it because it was a big one. I don't think I could finish one sandwich at Manny's in one sitting. This will explain the increases in the price. They do pile on the meat, which is a plus because I want meat falling off my sandwich, there also was not a lot of breading which they get double kudos. <br><br>I got the cabbage sweet and sour soup which was a pleaser to my palate. It was a nice accompaniment to my sandwich. The kugel was also good but just needed a bit more raisins. The kugel melted in my mouth and left me wanting more.<br><br>Now, when I say it overrated, I can go to Moons and get the same kind of sandwich for half the price. I think people come here because it's well established and it's a Chicago staple. I enjoyed my meal and I will come back but on paydays...", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/TUaYbsB7oKLlQ1_XBYwicg/348s.jpg", "caption": "Sweet and sour cabbage soup"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ooKxCbMFTHKvCnFvb7nnhw/168s.jpg", "caption": "The chazzer piled high"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/cQqRBGe9M_K88p7MGH27kQ/168s.jpg", "caption": "Ready to get this party started"}]}}, {"review": {"des": "The food. Oh man. The food is great. The \"4 Kinder\" comes with four types of meat​ on your choice of bread. Each variety of meat was perfect on the rye bread. Throw some brown mustard on top; you are in business. The latke/potato pancake was alright. My Nana makes them better, what can I say. <br><br>There is plenty of seating and an excellent variety of food. Everything looked great. My daughter liked getting a balloon elephant on Sunday from the wandering magician.<br><br>So why two stars?<br><br>Here I am in line with my quiet but hungry 3-year-old​ stepping on my feet, trying to get our food just as lunch rush is picking up. The guy asks me if I want a potato pancake, piles it on the wrong sandwich and hands it to me. Luckily it was my friend's​ food, so we just swapped, no big deal... that is not worthy of any reduction in stars. What IS, is when the man building the sandwich​ gets frustrated at my friend and me, shouting at us: \"I don't understand you guys, get the hell out of here!\" <br><br>In a different life,​ I would have thought this was a classic deli counter move. But it is not very ch​arming when you have your child with you, and it is not excellent customer service. Maybe this was passable when delis were somewhat affordable and utilitarian, but at $15 a sandwich,​ I don't want a side of \"get the hell out\" with it. <br><br>So head to Manny's to enjoy some great pastrami in a pleasant cafeteria setting. And if you like getting yelled at for no reason, because your presence costs them more than the 30 dollars you're​ going to spend on lunch.", "pics": null}}, {"review": {"des": "After a long 8 hour drive to the Windy City we decided to make this place our first stop since we were starving. Mannys offers complimentary valet parking which made it convenient for us.<br>This was the first time I ever saw a deli cafeteria style. It is shaped in an L pattern and you have a very long row to check the boards to decide what you want. The menu is extensive including salads, hot entrees, hot and cold sandwiches with large pickle slices. Side portions are generous too.<br><br>The dessert selection just blew me away! They sell Eli's cheesecake here but it comes wrapped so if you are looking for authentic then I would select something else. I decided to have turkey and chopped liver. For $1.50 more I got a nice size potato pancake. My husband went with the turkey club. There is a nice selection of breads so I settled for a challah roll. I looked at the chicken noodle soup. It looked so good but on a hot day I didn't want to overindulge. For dessert I went with strawberries and blueberries. When we paid we were each given a coupon to use in their take out deli off to the left for either one free bagel or a cookie.<br><br>We found a table and believe me this sandwich was so good and messy because the chopped liver kept falling out. My potato pancake was good too. Only wish I had some applesauce to go with it. My husband enjoyed his sandwich too.  Someone comes around to take your tray when you are done. Please note that this is not a Kosher deli but it is Kosher styled. I saw someone at a nearby table and was blown away by the size of his pastrami sandwich!<br><br>After we ate we went to the take out deli. I was blown away by the selection of lox and fish! Most of the items were the same as we saw in the cafeteria. We used our coupons to get chocolate chip cookies. I was glad they were not overly big because that sandwich was so filling.<br><br>Needless to say they were fresh and very good. I was also amazed at how empty this place was but it is a bit of a distance to the city center. Expect to pay but I am used to paying high prices in delis and I was glad I had an opportunity to check this place out. A must if you love delis!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/KwvhSPJgGU4RsYrFIivygw/348s.jpg", "caption": "Seating area"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/YPxGfzORQcf-X45RfyNfjQ/168s.jpg", "caption": "This is deli style but very good"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/l3sNd-RugVd0hbnZIqp-6Q/168s.jpg", "caption": "Turkey club"}]}}, {"review": {"des": "We were accommodated even though they were closed for a private event. We came in from Los Angeles and Ubered over for our first experience there. Danny didn't turn us away. The prices and food are toe-to-toe with the very best delis in Southern California. The corned beef was a lean yummy beast of a sammy, pickles were awesome, mac and cheese was fabulous, beef stew was tremendous. Another MUST EAT stop on my Chicago list. The counter, waiting, and bussing staff were efficient, friendly, and fun! Thank you for the memories and calories!", "pics": null}}, {"review": {"des": "Okay I have been dying to try this place for a long time.  After the Shamrock shuffle , my girlfriend had a taste for a Reuben and we decided to go.  She had the Reuben, I had the roast beef sandwich and we each had a potato pancake.  The food was just okay, it was under seasoned and on the dry side.  It wasn't the worst I have ever had, but I wasn't that impressed.<br><br>On a positive note, you get A TON of food and the staff is very polite, attentive and efficient,", "pics": null}}, {"review": {"des": "Matzo Ball soup was fantastic but the meats and sandwiches were bland as cardboard. I ordered the Corned Beef of Rye and felt like I was eating dryed out steak.", "pics": null}}, {"review": {"des": "Classic iconic deli with delicious sandwiches and huge portions. Now this place is cafeteria style, meaning no waitstaff. You go in, you know what you want, you cut in front of people, get the food and pay. I got the classic corned beef and pastrami combo on rye with matzo ball soup and potato pancake. I loved the sandwich. The corned beef is some of the best I've had, tender, very very juicy. The pastrami is good as well but I prefer the corned beef over pastrami. The matzo ball soup was delicious as well. Broth was perfect and amazing flavor. The matzo ball was light and the flavor of matzo really came through compared to other matzo balls, this is the best. The potato pancake was alright. I would have liked a better texture on the inside of the pancake but just a minor thing, everything else I got was delicious. Lots of options to order here, huge portions, and you'll leave full and satisfied.", "pics": null}}, {"review": {"des": "I was in the area for work right around the hospital district and my sister told me you should really try a place called Mannys.<br><br>She said...she used to get catering from there at her old job and their pastrami is to die for.<br><br>Having some time on my hands for lunch I thought he lets go check it out let's see if it is as good as she says it is.<br><br>I pull up and I see no parking but a man comes up to my car and tells me there is valet. You can't go wrong with that so I valet my car and made my way into Mannys.<br><br>The place was super busy and it is set up like a high school cafeteria I didn't know what protocol was and most of the people that were there looked to be daily regulars...I did not realize I needed to grab a tray first before walking up to the buffet style counter so i felt like a fool squeezing by customers to grab a tray by the entrance. <br><br>I also did not see that you had needed to grab your own Silverware- there should be some type of signage telling you grab Tray and Silverware when you walk in. Oh well. <br><br>I start to work my way down the line it starts with lettuce and condiments to make a salad and then move on to the area when you tell them what kind of sandwich you want.<br><br>I order one of their sandwiches that are on the board called the \"Tazzer\" it had pastrami and corn beef with Munster cheese and coleslaw on Ryebread. At this point one of the guys behind the counter referenced I looked like someone that was not flattering it was in fact a flat out insult.. almost making me want to leave or tell the guy to #%# off!! <br><br>Moving further down the line I grab the side coleslaw and also asked for their supposed famous potato pancakes, I also got myself two cans of their specialty branded pop. Further down the line you can grab yourself pie or other side dishes that have nothing to do with sandwiches they also had some oxtail stew from what it looks like and other various foods.<br><br>so here's the rundown of what I ordered.<br><br>1 sandwich<br>Side coleslaw <br>2 potato pancakes <br>2 pops.<br><br>Grand total $33!!<br><br>Again sticker shock from a place that looks very old and nostalgic I thought the prices would be in line with that.. boy was i wrong.<br><br>But all would be worth it if the food was fantastic.. so how was the food?<br><br>The sandwich was extremely mediocre the corn beef was very dry. The pastrami was good but very fatty. The coleslaw felt nonexistent and the cheese was a very small slice you could not taste it at all. <br><br>Their famous potato pancakes were hard as rocks they tasted like they were sitting out for a while and I don't know how that's possible because everyone that came in it was ordering potato pancakes I don't know if they are  premade and let them just sit out but they were not good.<br><br>The specialty pops were very tasty but those were in a can.<br><br>Around Chicago there are many many many better Jewish delicatessen's. One that is way better is the bagel in Chicago or the one in Skokie. Their sandwiches are the same size and you get fries and coleslaw for $15.. <br><br>I saw two of the owners walking around only talking to people that they knew in fact one owner sat with a group of businessmen while they ate for their entire lunch which was about 20 minutes how do I know this because I sat right next to them. No one said hello or greeted me saying hello everyone was just moving the line along. And when I asked for a container to put my sandwich in and my potato pancake that I did not eat but for some reason I was going to bring home to show my wife how it looked ...the girl at the register gave me a sandwich wrapper in a brown bag I asked for a box she told me that is what they use for sandwiches ridiculous.<br><br>I will definitely not be back.. but again this is just my opinion go check it out for yourself", "pics": null}}, {"review": {"des": "We walked 2 miles to try Manny' s and it was worth it.   <br><br>The cafeteria was super cute (retro throwback to an earlier era) and very very clean.   I really appreciate walking into an establishment that looks like you can eat off the floor. <br><br>The food line looked as good as any cafeteria style food line can look.  None of the items looked too old or gross. <br><br>The workers seemed a little ornery but they helped without any attitude and were like grumpy old men friendly (if that makes sense.)<br><br>The sandwich we got was huge and we were able to share just one.   I was so happy they had Barqs red soda on tap.   I drank 3 glasses!<br><br>So delicious and worth the almost 5 mile round trip walk.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/_Ns-ROexIW8lO6P1AoUopQ/348s.jpg", "caption": "The four kinder with a roll and potato pancake"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/9PhTxFwponBwZ8HAmaWQ0w/168s.jpg", "caption": "Cafeteria line"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ehnr-1SX0x5tMSAtMMW30A/168s.jpg", "caption": "Extras case"}]}}, {"review": {"des": "I've been to many Delis in my time, but I have never been to a \"cafeteria style\" one so I wasn't quite sure what to expect, but I was pleasantly surprised!  Like a typical old school cafeteria you grab a tray and walk along the line.  You will choose from a selection of deli favorites in addition to pre-prepared salads, deserts, etc.  I tried the turkey Ruben, matzah ball soup and a few deserts.  All were flavorful and well prepared.  There also is a really cool bakery/deli/candy/gift shop attached that is fun to visit before or after your meal.  The food could have been slightly fresher, even though it tasted great, you could tell some of it had been sitting out for a bit.  <br><br>The parking situation is a bit of a negative, I didn't realize they did have a lot that you can't see until you pass the location, so I did \"valet\" which was basically a dude who watched you car while you left your keys inside.  It seemed very sketchy with no tag, no name and no holding of the keys.  Plus the guy barely would talk and seemed more interested in his phone.  Made me worry a bit about my car the whole time.", "pics": null}}, {"review": {"des": "Deeply appreciated the wide variety of homey old-school dishes here and am looking forward to coming back for their famous pastrami. Portions are hearty and there is a lot of seating here. You can also get deli and baked items to go in an attached store. I got Thursday tongue and mushrooms for dinner. Meat was thinly sliced and and tender in a flavorful medium-body brown gravy with lots of sliced mushrooms. My two sides were the popular potato pancake, which I found to be more dense than I would prefer, and mixed vegetables, which were fresh-tasting and not mushy. There were also several choices for bread.", "pics": null}}, {"review": {"des": "Gross. Soggy Corned beef sandwich. Such a disappointment. Hubs ordered Turkey sandwich they gave him hacked off thick thanksgiving slices. For a sandwich! I will never be back. This wasn't the first time it was like this either. Terrible!", "pics": null}}, {"review": {"des": "The Pastrami is the best I've eaten in my entire life!!!!!<br><br>My friend is a born and raised Chicagoan and he HIGHLY recommended this place to me.  I showed up right when they opened at 7am and was the only customer at the time.  I had just flown in from San Diego, and took the L-train into the city.  I was trying to stall until they opened, I arrived almost 45 minutes beforehand.  I needed to meet my girlfriend who was at her hotel already, before she went to her conference.  She had already flown in the night before and was awaiting me bringing breakfast.  I told her they didn't open in time and I was on my way to the hotel after grabbing coffee.  What I really didn't tell her that I was out front waiting to go in, lol.<br><br>After a few minutes looking at the menu, I made my decision.  I ordered a Pastrami sandwich, I know it was only 7am but that's what my friend Ed recommended.  I grabbed it To-Go and was off to the hotel to surprise her with this sandwich before her conference.  She was ecstatic and pleasantly surprised how damn good it was.  I told her I thought it was quite expensive in my opinion, but once we tried the meat it all made sense.  Worth Every Penny!!!  This pastrami was so damn good, not greasy at all like every other place in the world that serves them.  She had half and I had the other half plus our potato cake. Yummy!<br><br>Overall:<br>I recommend this place whole heartily, GET THE PASTRAMI!!!", "pics": null}}, {"review": {"des": "Didn't want to eat at the 2018 Auto Show and wanted something with substance, Have had NYC deli food like Katz's & Barney Greengrass. I figured my brother has wanted me to join him here at Manny's Cafeteria & Deli.  Since he wasn't there I still decided to go and give it a shot.  Staff was friendly & helpful (as were the patrons) As soon as I walked in, I run into a Business Associate and his Colleagues from the Northwest Suburbs (Didn't ask him I could use his name in this piece). It was his first time at Manny's.  I decided to order what they are known for:  Corned Beef on Rye with a Potato Pancake and Pickles.  Next time I am going to eat half, was I full!!!  Will try out the Matzo Ball Soup, Knisch, and other Hot Items.  Looking forward to trying this spot out again, next time with my brother & friends.  Cheers!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/lycpKo0L1o8NTVnTJ9aqow/348s.jpg", "caption": "Hard to miss, Enjoy!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/qxX86EK9ZYGHoPWcbq0zXQ/168s.jpg", "caption": "Next time going to try!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/_dttQY_72OE7IKLYPCSv0A/168s.jpg", "caption": "Waiting in Line, in the doorway."}]}}, {"review": {"des": "Amazing. Corn beef hash will fix anything wrong with you. Huge selection, massive portions and excellent service. Very spacious dining room too for big groups.", "pics": null}}, {"review": {"des": "Make sure you bring a little jar of Vaseline since your going to get fucked with there prices", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/L-mfSO_s6HwKbQpb_RfzrQ/348s.jpg", "caption": "This small crap for $31 what a rip off"}]}}, {"review": {"des": "Best deli in the Midwest! If you've ever wanted to hear local politicians negotiating something while you're eating a corned beef sandwich, THIS IS THE PLACE FOR YOU. (Literally everything is delicious.)", "pics": null}}, {"review": {"des": "I came here the other day, lookin for sumthin out of the ordinary. I always get the corned beef sandwich which never disappoints. This time I decided to order a half pastrami sandwich with the usual, potato pancake & Matzo Ball soup. Expecting a warm delicious meal to please my appetite, I was sadly disappointed. First of all, they served me a full when I asked for half sandwich. My food was cold, all of it! How do u serve cold soup?? The pastrami on the sandwich was not warm & the potato pancake wasn't soft. On top of it, my tab was $22 with a glass of water & before tip! Let it be known that this is the first time I've had a bad experience here thus the 4 star rating & will definitely be back! <br>FYI: After ordering, I noticed a sandwich on the menu called the Four Kinder which I definitely will be ordering next time. It contains Corned Beef, Pastrami, Brisket & Turkey . You're welcome!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/WfATfYZXEUcG3kcQ6Sr_bA/168s.jpg", "caption": "Hmm..which to choose??"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/iqbab4TN7VgTOf61rDVEgQ/168s.jpg", "caption": "Fat pastrami with potato pancake & Matzo ball soup"}]}}, {"review": {"des": "Time for lunch and I had to try the Famous Manny's Cornbeef sandwich. Which was delicious and a very thick sandwich, I was able to share this sandwich with my fiancé. The potato pancake served with the sandwich was delicious and we enjoyed the atmosphere and the complimentary parking on a Tuesday during lunch which made our transition with the stroller easier. My fiancé order a hotdog Chicago style which he enjoyed.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/UY-Pc-4z3eYnO-KswCionA/168s.jpg", "caption": "Corned Beef Sandwich and potato pancake"}]}}, {"review": {"des": "Manny's makes me wanna eat at a cafeteria over and over again! First timer and it's definitely intimidating when you get lined up cafeteria style lines only because there is so much to choose from! I got a bowl of matzo ball soup and the hot sandwich called The Chasser. My meat was being cut in front of me on the slicer and then plot on my rye bread! Can't get any more fresh than that my friends. The sandwich comes with a pickle slice and a side of potato pancake. Everything was so good especially the slaw they put in my sandwich! I can't get enough!!!", "pics": null}}, {"review": {"des": "Hidden gem! Manny's Cafeteria and Delicatessen is a great place to grab lunch or dinner. They have a variety of foods served cafeteria style. From salads to cold and hot sandwiches to hot entrees they have a little something for everyone. We ordered hot sandwiches and the guys serving are so kind and funny. We ordered a Reuben and pastrami and corned beef combo both on rye bread. I have never seen a bigger sandwich!! They really give you a more than generous helping of meat. My boyfriend and I shared a sandwich and his sister and her boyfriend also shared a sandwich and it was more than enough for us. We also grabbed a cream of broccoli soup and bagel crisps. The bagel crisps are really good to dip in the soup and the soup was delicious as well. Each hot sandwich comes with a few pickles as well as a potato latka and you can grab a packet of sour cream and apple sauce to pair your latka with. The food overall was delicious. We loved the atmosphere of the restaurant and they have a really cool delicatessen connected next door where you can grab meats, treats and souvenirs! On the bathroom doors also have a footdoor knob to open the door with so you don't have to touch the door after washing your hands. So cool and such a great thing to have. We will definitely be coming back in the near future and would recommend Manny's to anyone!", "pics": null}}, {"review": {"des": "From the moment you walk in you know it's something special. Essentially an east-coast styled deli with tons of sandwich and entree choices. You walk in to a huge open space, grab a tray and utensils and hit the line. Start off with your entree/sandwich. The guys behind the counter are a classic, older guys who have worked the line for years and are light on their feet and witty in conversation. Awesome guys to get in good with, they hook it up on the portions. Half a sandwich can easily fill you up. Move down the line to hand select sides and desserts. Dozens of choices, all fresh and tasty. You pay at the end with a cashier.<br><br>Seating is open and their is no shortage of tables, easily squeeze a couple hundred people into the dining room. I went for a Corned beef Ruben sandwich, a signature specialty, with coleslaw and jello on the side. Don't forget the potato pancakes! Old school comfort food made right. I took half home. There is also a small bakery, deli, to go area attached to the side which makes it easy to grab some groceries if you need something small. The only reason this place is not getting a 5 star review is the prices, straight up loved the food but 2 sandwiches, 2 small sides of one coleslaw and one potato salad, 2 cokes and 2 small desserts was almost 60 bucks. That's not including a tip and I purchased no alcohol. I'll definitely return but my order may just be limited to a sandwich to go, it's the city I understand but my my that's a hefty bill for this style of food.", "pics": null}}, {"review": {"des": "I think I ordered the wrong thing. I had a chicken caesar salad. The portion size was big and it was ok tasting, but nothing special. The folks behind the counter weren't friendly and the ordering is confusing. Glad I went with a Manny's veteran who told me to grab a tray and silverware before ordering. At the end of the day, I'd come back again because they have a parking lot and it's quick and easy, but I'll try a sandwich. I got a chocolate chip cookie at the bakery area next door and enjoyed that very much.", "pics": null}}, {"review": {"des": "I am not trying to be contrarian but found it overrated here. The space is very large and clean, which I like, but the cafeteria-style service was absurd. <br><br>There was a cashier at the beginning of the line, but also at the end? I ordered an egg dish, and it was clear it wasn't in the cafeteria trays, but I'd assumed this was fine, since I figured some of the items must be cooked on a griddle or something. The cashier was very confused, and the manager, who was nearby already, was similarly confused and kept asking if it was the side I was ordering. It was advertised on the menu itself, so I am not sure why they were so confused. It was on the posted menu and the written menu. <br><br>We got to the end of the line with empty trays, knowing that 3/4 of us had non-cafeteria entrees, and the bill was paid. Well, the other cashier then presented a different receipt of $3 more. Very weird. They settled it, but there was a LOT of consternation - confused cashiers and a visibly angry manager. It doesn't need to be utopia, but it was a bit awkward seeing them bicker back and forth, especially since this restaurant didn't exactly open yesterday.<br><br>The food was incredibly bland, even with the mustard or anything else at the table. I tried some of the corned beef someone else ordered, and it was fine. I found the food overall very unimpressive and one-note in texture and flavor. I am not sure why this glorified cafeteria is so popular. I grew up eating Jewish deli food and, though it's not my favorite food genre, I'd happily return to similar spots before Manny's.", "pics": null}}, {"review": {"des": "Be still my heart!!!<br><br>It's been a long time since I had delicatessen food THIS GOOD!!!<br><br>The corned beef was PILED HIGH and the matzo ball soup reminiscent of my grandma's. If you enjoy good delicatessen food, dine at Manny's.<br><br>They even have Dr. Brown's sodas to sweeten the deal. YUMMO!!!!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/XZimbtfUxsMYqHHqUluAJA/348s.jpg", "caption": "Celery soda!?!?"}]}}, {"review": {"des": "My favorite deli of all time.<br><br>Potato pancakes are the most delicious.<br><br>You can't go wrong with any of the sandwiches. <br><br>Put mustard on everything!", "pics": null}}, {"review": {"des": "Had a corn beef Ruben and pastrami Ruben to go. I prefer pastrami, but I always try the corn beef to compare to other places. The pastrami is definatly the way to go. <br><br>The line was a little confusing for first timers. I then figured out to jump ahead of people and go to the station where I want food from and order. The different atations include breakfast, hot sandwiches, cold sandwiches, soups, etc. Their is a bakery on tje north sode of the deli. <br><br>The pastrami Ruben was good, but I have had better. The bread was honestly the best part. They lightly toast regular rye bread, not marble rye. When I come back I'll have to try dining in to get the full experience and to try some more traditional food.", "pics": null}}, {"review": {"des": "If I just had the pastrami, this place would definitely be 5 stars. The pastrami was one of the best pastramis i've ever had. Even better maybe than Katz deli in NY. We also ordered the corned beef, roast beef, matzo ball soup, the potato pancake, and some cookies. The roast beef in the deli line looked so appetizing that we had to get it. However it was too lean and dry for my taste. That and the cookies were probably the most disappointing things that we tried. I would definitely recommend getting the pastrami or corned beef. I also saw a lot of people ordering this egg noodle breakfast dish which looked pretty good. <br><br>In terms of getting there, parking isn't too bad. It's mostly all metered but we were able to get a spot right in front around lunch time. There's also a Binny's across the street so you can get your meat and alcohol fix at the same time.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/QDNvezQIuQ4Orvi3-cXlVw/168s.jpg", "caption": "Roast beef"}]}}, {"review": {"des": "I've been to this place twice. The food is ok but I think their deli sandwiches are better because that's what they specialize in. This time I tried the fried fish, vegetables, and mash potatoes w/ gravy. To me the fish was dry & over cooked, the temperature of the fish wasn't hot, the veggies was cut to thick, and the mash potatoes w/ gravy needed salt & pepper for a little flavor. I do like when they give you a free complimentary cookie when you purchase a meal or a sandwich.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/CB8Jeo4rEVpD-RaeNAXgYw/348s.jpg", "caption": "Fried Alaskan, veggies, mash potatoes w/ gravy"}]}}, {"review": {"des": "Great place to get a cornbeef or pastrami sandwich and a pleasure to see Gino and get some laughs. Highly recommend this place for good food, laughs and service.", "pics": null}}, {"review": {"des": "Came here for lunch and a friend recommended the corned beef.  It was a delicious sandwich with an enormous amount of meat on it.  You really need to bring an appetite when eating at Mannys because the portion sizes are large.  The price is pretty expensive with the total of my meal almost being 20$.  The environment of the place is clean and the staff if friendly.", "pics": null}}, {"review": {"des": "Marvelous beef stew with a side of seeded rye bread. Always delicious entree's here. I always recommend Manny's to everyone!", "pics": null}}, {"review": {"des": "Awesome!  If you want good deli food - this is the place!  I had the pastrami sandwich, enough for 2 large sandwiches.  My wife had the beef stew.  Also had the cabbage roll soup - delicious!  Cookie to go for desert.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Wf5cK9izeaNRYnbJOkqA-g/168s.jpg", "caption": "Pastrami sandwich, cole slaw and root beer."}]}}, {"review": {"des": "Great place, a ton of choices and all of them looked great.  I had a pastrami and corned-beef sandwich, couldn't eat all of it but it was so good I really tried.  My friend had the stuffed cabbage, which I also had a bite of, we both felt is was excellent.  I know this is an old Chicago cafeteria style place, but the reason I'm not giving it 5 stars is the service (guys behind the counter) were neither very helpful nor friendly to some customers who claimed they had never been there before.  And the prices are not old style cafeteria, food was worth it but we paid about $70 at lunch for 3 people, a sandwich, stuffed cabbage, soup, fruit dish and some fountain drinks.  I recommend checking this place out if you're in the area.", "pics": null}}, {"review": {"des": "Overpriced is understatement. One tiny cream cheese comes with lox plate. Hard bagels. Will not return after two bad experiences in a row. Standards should be higher.", "pics": null}}, {"review": {"des": "It is no Katz Deli but for CHICAGO is the best one I have tried. The amount of food you get with your order is ginormous. I had the brisket, very good. Next time I go will probably share. Felt sick ... I had to much eat", "pics": null}}, {"review": {"des": "As advertised people.  Get your behind over there now.  Incredibly great, authentic Jewish deli food. It's cafeteria style so you just grab and go.  I'd eat here everyday if I lived in Chicago.", "pics": null}}, {"review": {"des": "I always prepare myself before I step foot into to Mannys because I get so overwhelmed by the delicious choices they have to eat. I tell myself to try something else this time but Im a simple girl and always end up choosing my go to meal.<br><br>My Usual:<br>side of green beans, rice soup or (matzo ball), half Pastrami half corned beef on rye, potato pancake, cherry pie or (blueberry) and a bottle of water.<br><br>Yes its a lot and no I never have any left to take home. Its THAT GOOD people!! They pile the meat so high that you can literally make about 4 sandwiches out of it. Yea I counted!<br><br>Please don't forget to use their mustard and horseradish on your sandwiches!!! Its just not the same without it. I put so much until my nose hurts but that's ok because I endure the pain for deliciousness.<br><br>Staff is simply amazing and the guys behind the food always crack jokes with you putting a smile on your face every time.<br><br>Keep on the look out people! Celebrity sightings happen often here!<br><br>OH ALMOST FORGOT!! Even after you stuffed your face at Mannys Cafeteria the amazing people there give you a card for a COMPLIMENTARY COOKIE at their Bakery!!! <br>Just can't get any better!!!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/YjYRGR04nVgZ1KpCrlytjA/348s.jpg", "caption": "Too much deliciousness in one photo!!!"}]}}, {"review": {"des": "Over ordered. Fell victim to eating with my eyes and not listening to how hungry (or not hungry) I really was. But that's not the reason for the low rating. Cause that's definitely my fault. But it did give me the opportunity to try out a good handful of their menu items. <br><br>Order for two: corned beef sandwich, chopped liver sandwich, matzo ball soup, potato ball, and Mac & cheese. And no, we did not finish all of that food in one sitting. More like three sittings. Here's the rundown: corned beef was probably the most liked item that we tried. But really, how can you ruin a corned beef sandwich?! \"Mile high\" as most delis would advertise it. The chopped liver was okay. I always forget that it's cold liver - not a preference. But it's average as well. Matzo ball soup - I don't know. I opted to not taste since I was determined to finish at least one item (half of the liver sand which). Potato ball was flavorful but needed heat. No spice to it and they didn't have any hot sauce out on the tables. Least favorite was the Mac & cheese. And I love me a good Mac & cheese! Sad disappointment. <br><br>Decor is lunchroom cafeteria style. Apparently President Obama frequents the deli. Walked here from UIC so not sure about parking. In short, doubt that I'd revisit. <br><br>Remember: food adventures are out there. All you have to do is find 'em!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Wb02NEg1kaTfuBY5MhQG-Q/348s.jpg", "caption": "Mac & cheese"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/D2nQ0OKyQ_-hcCGXCZwW-Q/168s.jpg", "caption": "Potato pancake"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/1CMljqHKjcqg1RT0D45sIA/168s.jpg", "caption": "Liver!"}]}}, {"review": {"des": "There are delis and then there is Manny's. Manny's is not only a Chicago icon, it's also really damn good!!<br><br>The corn beef and pastrami sandwich, potato pancake and chicken matzo ball soup will change your life. Possibly by making it shorter, but what's the point of living without cured meats. <br><br>Oh and the sandwiches are large enough to feed an African village for about a week, or me for several hours. <br><br>EAT HERE!!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/K2KJP_wLsvXEBZO-ltWsAw/348s.jpg", "caption": "I see this in my dreams."}]}}, {"review": {"des": "We had lunch at Manny's yesterday and the food was amazing, just like the old delis that I grew up with. I hadn't been there for 20 years and it was just as amazing as I remember. <br>The reason I am giving it only 4 stars and not 5 are I cannot believe that they charge extra for sour cream for the potato latkes, it wasn't the 50 cents but really it was just stupid since anyone Jewish knows it always comes with it and I also got charged for the pickle again not a big deal money wise but so not the Jewish way.<br>The food for both of us came to a little over 30.00 and it was pricey but to me it was worth it.<br>The men behind the counter were very nice however the cashiers were just down right rude one even rolled her eyes are me when I asked for the sour cream and you could tell they didn't want to be working.<br>I will be back just because of the food and as a Jewish woman its so hard to find the food I grew up with, I mean really where can you find chopped liver that's made the way my mother use to make it, amazing.", "pics": null}}, {"review": {"des": "My review is for the cafeteria portion, not the deli portion. I was extremely happy with the bagels I got from the deli and would happily return to that half of the building.<br><br>Having heard everyone talk about how great this place was, I was excited to have iconic Jewish food without having to schlep to Skokie. I went for breakfast one morning and ordered the archetypal combo of Challah French Toast and Corned Beef Hash, but was very disappointed. The french toast was lukewarm and almost stale. The hash was dried out and not very flavorful; I wasn't even able to finish it.<br><br>The deli food from the lunch line may be different, I wouldn't know.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/-jp2TigL9rKuhOFcdnLwvg/348s.jpg", "caption": "Challah French toast and corned beef hash. Didn't live up to reputation."}]}}, {"review": {"des": "Looking to try my first corned beef sandwich and considering it's not that far off from my job site, I decided to make my way to Manny's. It's situated in the middle of nowhere oddly except for a bus stop nearby if your looking to get there via public transportation, otherwise you have to drive to get here. Kind staff. I believe the owner of the establishment is behind the kitchen counter alongside other staff members serving up all the food. The theme of the restaurant is very unique, a cafeteria school lunchroom setting, with chairs instead of those long lunch tables that almost everyone should be used to. Talk about options when you get here and see the menu. As for the corned beef, I was served a sandwich with rye bread and the corned beef. And boy was it a lot of beef. I didn't find myself overwhelmingly full by it strangely enough however. I loved how the rye bread was buttered, it helped the sandwich. As for the corned beef itself it was chewy, but still respectably tender. It had a slight savory taste, but other that it didn't taste like much of anything. I felt like it needed some sort of sauce or something to put it over the top. And talk about expensive for a sandwich by the way, wow. Coming at around $15 with taxes +another $2 if you choose to get the potato pancake. It's a crunchy, hash-brown basically that has a distinct tasty filing inside. But, also somewhat flavorless, like if I was just eating a deep fried potato made into the shape of a pancake. It also comes with some delicious dill pickle slices, not to sour, it was just right. And for dessert I got a slice of their sweet potato pie. It was very sweet, but overall definitely average tasting. Maybe I came at a wrong time?", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/9e9BkZ7R9YhpNbO6HkuDqQ/168s.jpg", "caption": "Corned Beef Sandwich+potato pancake"}]}}, {"review": {"des": "Overrated. Terrible food now. <br><br>Used to be amazing like ten years ago. Nothing like it used to be quality wise. The Family is messing this place up. <br><br>Corned Beef is dry. Price wise this place is a rip off. Way too much for a crappy meal. <br><br>The family should be ashamed. <br><br>You are killing a legend. Sad. <br><br>Avoid. Not what is used to be. Disappointed.", "pics": null}}, {"review": {"des": "I have always wanted to try Manny's. Today was that day. We were having a going away party for a coworker. I decided to place a catering order. It was AMAZING! I placed an order of corn beef, pastrami, turkey and tuna. Everyone LOVED them! They were gobbled up! Thanks", "pics": null}}, {"review": {"des": "Honest review: food is good but its extremely inconsistent. Since it is like a cafeteria alot of times your food will be cold if this happens send it back. Then some times due to the food being old n having to reheat it, it could be extremely salty so taste food before u pay. All the meat is pre sliced so it is never hot its always luke warm. They do not toast bread which is extremely lazy fix this. They forget to label food so most of the time you have no idea what things are fix that. None of the people behind counter explain how to order so if ur confused your fucked i would recommend researching before you come. They do not give you your full bill my bill was 80 bucks, usually when places do this they are over charging so ask for entire bill to be safe. Be warned it is pricy<br>Pastrami sandwhich n corn beef are good but i had better at hopleaf been going here for years but think its time to look for actual restaurants that serve sandwhichs that arent cold or to salty if you know of any delis or good pastrami sandwhiches hit also like the blintz after u eat go next store to get free cookie!!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/wwXxY0oGe1-Hk6Amx6CCRA/348s.jpg", "caption": "Food"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/R7WL6C1PUsdAlA7BkiC3UA/168s.jpg", "caption": "Food"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/C2l5wuYg_H4pLBpmQyqvkQ/168s.jpg", "caption": "Food"}]}}, {"review": {"des": "Old school, cafeteria style eating. A wide variety of good food, friendly people and plenty of space to dine in. This place is a throwback to the days where you grabbed a tray, tell the server what you want, pay and headed to the nearest table to eat. Being a deli and cafeteria with a newly attached bakery, this is the ultimate no frills, no gimmicks, spot for lunch. Simply a gem.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/CnxOx0dkiQt0HakDwLdjvQ/348s.jpg", "caption": "Corned beef and Pastrami always saves the day!!!"}]}}, {"review": {"des": "It hurts my heart to give this Staple of the South Loop only 2 stars.  YES the recently renovated space is very nice.  The separate carry-out section is fabulous. However - the real reason we come is for deli food.  My boss took 2 of us to an early lunch yesterday (Wednesday) and we got there ahead of the crowd. Boss had corned beef on rye with a potato pancake; I had corned beef/pastrami combo on a kaiser roll with a pp; and my coworker had a salad.  YES the meat is piled high (and it's expen$ive) but the meat was bland and dry and kind of tough to chew. We both agreed - no amount of mustard was going to improve our sandwiches. As for the potato pancake ($2.50 each) ... I prefer mine to be thinner and HOT.  The famous deli man with the mustache did throw mine on the grill (per my request) to heat up but ... it wasn't great. <br><br>I know I'm going to catch flack for this review but something is missing/different from many previous visits. Maybe their supplier isn't providing the best cuts. Maybe demand is down. Not sure and I'm not a snob - but I know what I like.  It's not \"to die for\" anymore.  So sad.", "pics": null}}, {"review": {"des": "A Chicago classic! Just as much as deep dish pizza. <br>I only get to go here a few times a year since I don't get into Chicago very often.  But when I do, Manny's is a \"must stop\" place to go for lunch. <br>Is it old fashioned?  You bet. <br>Is the food great? You bet again. <br>Is it expensive?  Why yes it is. <br>Is it worth it?  Undoubtedly!<br>Stopped by yesterday with my brother and had a half of a pastrami on rye. Why only half?  Because their sandwich's are so huge that I'm going to have the other half for lunch again today. I also brought home a corned beef on an onion roll for my wife. Half of that was her dinner last night. The other half will be her lunch today. <br>You can't beat the taste of their sandwiches. <br>BTW, my brother had their short ribs (gedempte fleish) and he too brought half home for a second meal. <br>When you stop in, be sure to say \"Hi\" to Geno who runs the slicing machine. He is a master sandwich-maker.  He's the circus part of the \"Bread and Circus\" that is Manny's. Be sure to tell him to \"Pile it on\" as he's preparing your sandwich.", "pics": null}}, {"review": {"des": "This was my first time here and I wasn't impressed by the food. The food was cold and bland and to top it off super pricey over $44 for 2 sandwiches and 2 noodle soups and pancakes. It's my first and last time here. I was obviously expecting something better then your regular deli/diner options.", "pics": null}}, {"review": {"des": "My first time in Manny's, I had always heard about it but on my way back from the city decided to pick up some lunch for myself and my family. I had done a little reading about how it is cafeteria style and tried to inform myself as best as possible before walking up and embarrassing myself.<br><br>You get in line with a tray, silverware if you're eating in, and order your food at each station. There's a salad/appetizer station, soup, hot entrees, sandwiches, etc. The guys behind the counter range from nice and helpful to a little grouchy. I specified at each station that it was to-go, and everything was put in to-go containers, and then nicely packed up for me all together when I got to the register, along with mustard, 1000 Island/sauce and napkins/utensils.<br><br>The food itself was fantastic. I am by no means an authority on pastrami or corned beef, each of my family members had one sandwich and everyone thought their food was really really good. Flavorful, tender beef, tasty rye bread, a spectacular wild mushroom barley soup and thick potato pancakes. <br><br>I understand the food/preparation is very traditional, so take my constructive criticism with a grain of salt, but I felt that the bread could've been larger as well as toasted to accommodate more of the heaping portion of meat. Also, I was unable to get a half/combo portion of the signature sandwiches, had I known this I would not have ordered the soup when I first got in line. The menu also stated that with the purchase of a signature sandwich, you can get a potato pancake for only $1.50 more, instead of $2.50 at regular price. I am almost sure that I was charged full price after computing the cost of my order, though no itemized receipt was given. Not a big deal, but did drive the cost of an already expensive meal up a few extra $. The signature sandwiches are all close to $15, the portion is huge and the quality is good, but I feel like it would be much more reasonable at the $10 price point, even if it meant losing a couple more ozs of meat in the tradeoff.<br><br>All of the food was great. The cafeteria experience was interesting and Manny's definitely has a rich history that makes it authentic and unlike anywhere I've ever been. I'll be back to try more of the many offerings they have.", "pics": null}}, {"review": {"des": "I ordered the beef stew. I remember it being so good. It's mediocre now, lacking depth and flavor. And it's so much more expensive now. At $17.19, you'd think the meat would be a little less tough and chewy. Also, the potatoes were not cooked through. The portion size is still large, but I'll be throwing the rest away. I will not order this again.", "pics": null}}, {"review": {"des": "Great food, not so great customer service. Ordered catering here for the first time and I felt as if I was a huge bother to both persons who assisted me.  Rushed conversation, poor communication and lack of appreciation may be the reasons I never call again. There are too many great places to get deli sandwiches from around here. I really don't want to be made to feel like a jerk for calling to make changes to my order.", "pics": null}}, {"review": {"des": "I wanted to be productive. I decided that this past Wednesday was going to be laundry, shopping, and whatever-else-I-can-do day. After hitting up Chinatown for our Asian goods, my friends (and of course my fiancee) were starving. One of our friends suggested Manny's.<br>We found the directions on Yelp and parked in the rear. <br><br>This place is reminiscent of a grade school cafeteria where you grab a tray, utensils, and tell the diners what you want. Wednesday's special was a turkey leg, but my friend ordered it so I opted for the beef shank (they were out of lamb shank). You then proceed down the line and grab bread, beverages, desserts if you so please. At the end is the cashier. It was pretty pricey for the amount of food we got, but it was a huge serving. <br><br>The turkey leg was very flavorful and was swimming in gravy. It was juicy, succulent, and filling My fiancee ordered their infamous corned beef sandwich served with a side of potato pancake and pickles. However, she mentioned that the meat in itself was a bit dry and the sandwich needed deli mustard to keep the meat moist. My other friend ordered a plate of beef stew, and he commented that he could have made it himself, sans extra oil, salt, and pepper. <br><br>Overall, this place is probably the closest thing to a deli in New York. I would come back here again to try other options...just as long as I expect to leave with a hole in my wallet.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/EawpvTceC1Lo48RApfFUVQ/348s.jpg", "caption": "Turkey leg"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/3gUwHxfNERUtM7QRU8nBUg/168s.jpg", "caption": "Beef stew"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/0bxSscOHqCyc0t3bQzj7xQ/168s.jpg", "caption": "Corned beef sandwich"}]}}, {"review": {"des": "I was truly looking forward to trying Manny's for the first time. We used grubhub for our first experience. The delivery went fine. However, I was very disappointed with the food and customer service from Manny's. One sandwich was ordered on seedless rye with lean corned beef. Not a Reuben, just a grilled corned beef with Swiss. What arrived was a traditional Reuben with non-lean corned beef. I called grubhub and the customer service agent did a 3 way call with Manny's. While the special instructions were acknowledged, the woman at Manny's refused to accept that they sent the wrong sandwich. Oh well, I guess I will never try them again. I grew up in Michigan and have been fortunate to enjoyed actually good delis like Zingermanns, Stage, and Hy-Grade for years. I must say that Manny's is below average in comparison to those and the old standbys in NYC.  The latke was bland and unremarkable, nothing special about the corned beef and the rest of the order just so so. <br>Update,  I immediately received a call from the owner after posting the review. There was a miscommunication between grubhub and the deli. That call made up for everything and I will definitely visit in person next time.", "pics": null}}, {"review": {"des": "I mean, c'mon, it's Manny's. The staff is direct and efficient, the food is big and delicious, the deli and candy selections ate ridiculous... It's a legend--and for good reason. If you can master the Manny's etiquette (it's very particular), anything you get will be generous and delectable and you'll be both very satisfied and happy.", "pics": null}}, {"review": {"des": "Half decent food but this place is terribly overpriced. Highway robbery. Definitely won't be back!", "pics": null}}, {"review": {"des": "I have been a loyal customer for over 25 years. I love the food. I see the same employees in the restaurant every week, they seem happy and are friendly and helpful. The reason I gave 4 stars instead of 5 is because of the service in the take out bakery and deli. Every week we try to buy items to take home, while there are employees there, they don't seem to want to wait on customers. It's disappointing to have a great experience in the restaurant then go to the bakery deli and be the only customer in the place and stand at the counter for 5 or 10 minutes while the employees ignore you and work on something else. I hate to write this review because we love food and the employees at the restaurant, but customer service in the Bakery deli needs a lot of improvement. I highly recommend the restaurant.", "pics": null}}, {"review": {"des": "I have not been here for over a decade.  I must say that this place is impeccable.  It's pricey but you pay for what you get.  I ordered the famous corned beef and the nice fellow just kept putting the beef on the bread.  It overflowed the small pieces of rye bread but so unbelievable. This place is the best place to get old style delicious delicatessen sandwich.  So I won't be a stranger and will stop by more often.  Fantastic sandwiches.", "pics": null}}, {"review": {"des": "This place is as legit a deli as you can get. <br><br>The staff and management are so welcoming, there's a huge parking lot which makes it a super convenient location, and the food options are incredible -- you're basically either guaranteed to eat so much that you'll have to take a nap, or you'll have plenty of leftovers.<br><br>And the new area attached to the restaurant where you can get bakery and deli items to go is AWESOME.", "pics": null}}, {"review": {"des": "haaa prices are up there but you are hungry <br>get a tray order and pay <br>i order <br>matzo ball soup<br>pastrami sandwich 2 pickles, 1 potato pancake  i  want a cheese blintzes but the  order is of 3<br>side sport peppers  <br>chicago flag cookie<br>and a drink<br>$41 wowwwwww<br>i just came for the cookie<br>was a expensive experience<br>the  potato pancake was to simple bland i have put salt ,pepers and hot sauce<br>nice people old people run this place whitch i like thank<br>of course o take the rest to go<br>the cookie is like a brick and lot sugar i just like the desing chicago flag", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/LLhisaMFfOKcaoeNm3r-CA/348s.jpg", "caption": "cheese blintzes"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/LUSz70IWodCetjalnUgpaA/168s.jpg", "caption": "come hungry leave broke & full"}]}}]}