{"name": "maple-and-ash-chicago", "reviews": [{"review": {"des": "I came here for my aunt's birthday dinner on Saturday night. I was in town visiting and we were told this one of the places you had to come to in Chicago. Luckily we made a reservation because it seemed like those who hadn't were left waiting at the host stand or standing at the bar. When you get there you walk through their bottom bar and head all the way to the back of the building to elevator. There is a coat check there if you want to use it or you can head up to the 3rd floor.<br><br>We went right up to the host stand and were sat within a few minutes. This restaurant is gorgeous. Just an amazing atmosphere with beautiful candelabras on the tables and an open kitchen with a woodfire oven. <br><br>Once we took our seats we were greeted by our server Jasper, who greeted us with a cocktail. Ok any place that greets you with a drink before you order a drink is my kind of place!  But back to Jasper.... Jasper is my server whenever I come here. He was so amazing to me, my aunt, and my cousin. All of his recommendations were great and his personality was what made this experience. Not just his knowledge of the menu, but his personality and how he carried himself and handled kitchen errors was the main reason I would return here. <br><br>We had the steak frites, meatballs, and agnolotti. The fries came with a garlic aioli and they were amazing. Crispy and hot and not too salty. The steak was perfectly seasoned. My aunt's steak was overcooked, but they fixed it super quick and took it off the bill. The ricotta agnolotti was so good. It was so light and the truffle wasn't overwhelming. It was perfectly sauced so you could taste every individual component. I loved everything. If I hadn't gotten so full of the food, I would have ordered more. Next time I'll bring more people. Yes it's pricey, but it's worth it every penny. <br><br>Can't wait to come back here and have Jasper as my server!", "pics": null}}, {"review": {"des": "Wait : rsvp is strongly recommended. Good for large group<br>Atmosphere: spadeful, although crowded, we don't need to shout. Might be due to very high ceiling. <br>Service : friendly and informative<br>Food : everything is good except dessert. We have 8 groups and ordered different steaks ( cowgirl, New York Steaks  , Alaskan King crabs legs, and oysters. Meat are well seasoned and cooked at the perfect temperature. As a starter, I love the  bacons, sweet and crunchy. For veggie : creamed spinach and Brussels sprouts are the best. <br>Price : must be pricy! Lol my boss paid for it and I got to enjoy the meal without worrying about the bills <br>Dessert: chocolate cake is not bad, moist and sweet. Peach crepe is not flavorful <br><br>Tips : don't forget to get selfie at the coat check", "pics": null}}, {"review": {"des": "Business meeting Sunday night with the team and have an exceptional experience. We petitioned on Yelp for a 6th star and the request was denied. <br><br>All steps of service were fantastic, our server Megan was one of the best I have had and made the experience very unique. We ordered almost all apps, a bunch of sides, and a few delicious cuts of steak. <br><br>Thank you for tonight and the continued stellar experience.", "pics": null}}, {"review": {"des": "If you're in Chicago, you have to make a reservation at Maple & Ash (and yes, be sure to make a reservation far in advance especially for weekends).<br><br>Ambiance= 10/10. So chic. <br><br>Service= 10/10. Incredible- friendly and knowledgeable.<br><br>Food & Bev= 10/10. YUM YUM YUM.<br><br>My husband and I have been a few times now and each visit is better than the next. I can assure you that you will not be disappointed. Whatever you do though, make sure you order the \"Baller\" seafood tower to start. It will blow your mind (see photo). Be sure to request the house made pasta to be mixed in the tower as well...buttery goodness. <br><br>Can't wait for our next trip to Chicago so we can pay Maple & Ash another visit!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Y5fnA22NzoRSP1IcpWq21A/348s.jpg", "caption": "Nice little personal touch!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/urPukRPGOAFzrtT40UZUVw/168s.jpg", "caption": "YUM"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/AE69fJMJeRG26rrgtzsMog/168s.jpg", "caption": "Asparagus, Mashed Potatoes, Tenderloin, Mushrooms"}]}}, {"review": {"des": "This place is super elegant and cute!!<br>Highly recommend reserving ahead of time. FYI they allow a 15 min grace period. When you arrive, go straight to the back and take the elevator to the third floor. I accidentally thought the hostess at the street level was the maple and ash hostess. Oops.<br><br>We got complimentary cocktails when we sat down. I think they were lychee flavored. The complimentary apps were some radishes, olives, and nuts. My boyfriend and I split the baked and loaded, ricotta agnolotti, and 28 day dry aged bone in ribeye. This definitely was enough to fill us up. Service was super nice and polite. Never had to ask for a refill of water and our waiter was always around but never annoying!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/PzkQEacIhjKpmsYJ3BT2Sw/348s.jpg", "caption": "Dry aged bone in ribeye"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/yxXbXik9MUU3Tgv9pBOtpA/168s.jpg", "caption": "Ricotta agnolotti with winter truffle"}]}}, {"review": {"des": "Very eloquent spot in the heart of the Gold Coast. You walk into the entrance,  but have to take the elevator to the 3rd floor of the building to get to the restaurant. Famously known for their brunch, a friend and I decided to try that. The price for the food is fairly expensive,  but the quality of the food is great so definitely worth it. <br><br>The food options include a carving stations, eggs station, dessert, waffles and other breakfast favorites. I highly recommend getting the market omelette, it's very delicious. Drinks wise, you have the option to do unlimited mimosas for an extra fee. They also have other drinks, coffee, and teas on the menu.<br><br>The best thing of all, is that they bring extra apps to the table. One was this delicious ravioli, that came with a great mushroom sauce. They also bring a fish plate that comes with delicious scallops, mussels, lobster, etc. Worth it just for that alone. <br><br>The service is outstanding, as our server was very attentive and knowledgeable about the menu. I've also heard they have a great dinner menu, so will be back to try that for sure.", "pics": null}}, {"review": {"des": "I still love Maple & Ash, but need to make a few subtle changes to my original review. ..<br><br>Adding my full foodie endorsement behind the Aged Meatballs and the Baked & Loaded Short Rib Mashed Potatoes. Both are delicious and can not be passed up on your next visit. (Side note: Skip the creamed spinach)<br><br>Dropping a star for serving choice rather than prime cuts of steaks. This has always been the offering at Maple & Ash, but since my original review it's become more apparent. Don't get me wrong. ..this is still an excellent steak particularly because of the charcoal preparation, but there are better cuts available. <br><br>Although I'm changing my rating from 5 to 4 stars, overall this is still my favorite steakhouse in Chicago. Check out my original review for additional photos and make a reservation for a special occasion soon.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/6TdHu8CKqNYFs5g9To4JGw/348s.jpg", "caption": "Complimentary Belvedere Vodka Martini w/ Elderflower"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/U_tQH793UmoD_oh3V0A1fg/168s.jpg", "caption": "Ceiling light fixture"}]}}, {"review": {"des": "A must stop; make reservations.<br><br>Ambiance is very date night...darker with great decor and lighting.  And this place is definitely in the viagra triangle.  A lot of older men trying too hard.<br><br>Service was outstanding.  Our service was wonderful...so fun.<br><br>Must read the menu, including the notes on the side.<br><br>We only had two issues: the server asked about food allergies but I did not hear him.  So, when I ordered and mentioned my dairy allergy, it was hard to find something not smothered in cheese or butter.  I had the Dover Sole, and it was pretty blah to be honest without the dairy component.  I did get my own order of fries without dairy and they were best fries I have ever had in my life. Octopus is a MUST.  Devine.<br><br>One of the people in my group was unfortunately the victim of a server cleaning the table and dumping fries and aioli on his back.  My friend left the table to clean up, and they covered our wine bill which was a nice fix.<br><br>Overall, I would come back again because of the experience and the service.  And the octopus and fries.", "pics": null}}, {"review": {"des": "Lovely experience! We were there celebrating a birthday and got the themed menu, which was very cool and much enjoyed. As read, we weren't greeted with drinks or a complimentary dessert for it but that's alright. <br><br>We started with the grilled octopus and bacon. Personally I can't speak on the bacon but I was told it was great and the octopus was delicious. Grilled to perfection with a nice sauce and cilantro to accompany. <br><br>I got the branzino and smoked carrots and the birthday boy got the rib-eye and onion rings. He throughly enjoyed his. I had to send the fish back to get it prepared properly but after that it was very tasty. The carrots are amazing. I definitely recommend them!<br><br>Dessert we got the crepe and it was fabulous. The ice cream is the star of the show. <br><br>Things that sort of were a disappointment: the valet. No where to be found each time. We had to hunt him down. When we asked inside about how to find him we were given a blow off answer by the bartender. Then after I did track him down upon leaving, he didn't even start the car, just handed me my key and pointed me in the direction of it. Sort of lame dude. <br><br>Also, I have health issues and dietary needs. For the most part they were addressed but they didn't prepare everything how I could eat it; like the fish and carrots as I was told they couldn't just simply grill and had to coat things in butter and oil which ended up making me very ill later that night and into the following day. <br><br>The food was very good, please don't get me wrong, but I don't understand why things couldn't be dry grilled. Even bob chinn's will make me simply grilled fish. And if it's something that can't be done please tell me before I order it and it's in front of me. Please provide me options, if any, that I have available. No one like to throw up fish. Especially $42 fish. <br><br>All that aside I do recommend trying Maple & Ash. It's certainly worth it.", "pics": null}}, {"review": {"des": "Came here for a birthday dinner. They will print out a cute Happy birthday note on the menu if you give them notice in advance. The restaurant is huge with a ton of seating, but is constantly busy. You can make reservations online. Interior is dark and very upscale vibe, and although it's fairly dressy atmosphere, they didn't have a strict dress code and there were quite a few very casually dressed people. Really lively dinner, with a ton of large groups.<br><br>When we sat down they gave us free cocktails - we got the limoncello. Service was extremely attentive but not annoying. When our birthday friend went to the bathroom, he dropped by and asked us if we wanted to order dessert for her first.<br><br>Food here was delicious. The charred Brussels sprouts were simply done but had a satisfying crunch. The foie gras was the only option that tasted fairly average - it was buttery and savory but not anything special. We ordered the cowgirl steak aka bone in rib eye, as well as the bone in new york steak - both were scarfed down even thought they were huge. The bone in rib eye was extremely buttery and melt-in-your mouth. Even the beef stroganoff pasta was delicious, although a bit on the so al dente it was too firm side.<br><br>Maple and Ash is definitely on the pricey side but the food and service make it absolutely worth it.", "pics": null}}, {"review": {"des": "After an indulgent bday week I capped it off with dinner with my husband at Maple & Ash. I had planned to eat healthy since my week had consisted of cake, cake and more cake. But Maple & Ash is not where you'll want to eat healthy because everything on the menu looks so good!<br><br>After we enjoyed a few small plates compliments of the chef (the service here is truly perfection) we ordered the seafood tower, caviar and caesar  salad.  All amazing- I always appreciate a good seafood tower. However, if I must choose a favorite the caviar wins among the 3.<br><br>We ordered one of the steak specials to share. I was so stuffed when it came out that I can barely eat more than a few bites...and my husband had the same issue. We regretted all the leftovers when we got the bill and realized that few bites of steak alone cost $180, but my husband declared it the tastiest leftover lunch the next day.<br><br>No room for dessert either, but (again) I had my share of cake that week.<br><br>Highly recommend for a special occasion or even a date night. The atmosphere, people watching, service and food doesn't get much better than this.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/96P_qFaXb9vAOGzvf05pYA/348s.jpg", "caption": "Menu souvenir"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/1a-lPMCaBWFbrd_c0D8-5A/168s.jpg", "caption": "Cesar salad"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/oR6zyI3I0YsAAQd3UdtOYQ/168s.jpg", "caption": "Seafood tower"}]}}, {"review": {"des": "Last night was my first time eating at Maple & Ash and it has already become my favorite restaurant in Chicago! I called same day to make reservations with no issue. Upon arrival we were shown to the lounge area which is very nice and creates a great social atmosphere. I was very impressed with the cocktail menu selection. I tried the \"Risk it all\" and an old fashioned and both were made perfectly. When we first sat at our table the server greeted everyone with a welcome cocktail which was a huge surprise as most restaurants don't do that. <br><br>For appetizers we had the grilled octopus which was delicious! The bread that came along with the octopus made for a nice pairing - I would highly recommend this dish. For my entree I settled on the Icelandic Cod. The Cod has a light crisp to it and was covered with a lump crab sauce - also recommend this dish. <br><br>I typically do not go for dessert but the waiter did such a good job of talking through the options that I couldn't resist! I settled on the Mille Crepe and was not disappointed. It came out as advertised and tasted great! <br><br>Overall the best features of this restaurant were the atmosphere and service. The environment is nice for date nights, business dinners, or a celebratory dinner with a group of friends.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/esu7yT7wIWzZxl4VGNOF0w/348s.jpg", "caption": "Wood Grilled Spanish Octopus"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/8Up5H4ykQ1CiCFgNWoMaYw/168s.jpg", "caption": "Brussels Sprouts"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/NlKwIYm7tyX5_GDt-Z5pow/168s.jpg", "caption": "Mille Crepe"}]}}, {"review": {"des": "Maple and Ash is by far and away our favorite restaurant in Chicago!! From perfectly cooked steaks, the most amazing fresh pastas and seafood, you can't go wrong! Maple and Ash has the most amazing Sunday brunch that will leave you happy and full all day and the dinners are delicious and intimate! We go there just to enjoy and also celebrate birthdays, holidays and friendship! <br><br>The service and decor are amazing and we have developed a friendship with the best restaurant manager around, David Prainito. He makes his customers feel special every time they come in to enjoy an incredible meal and restaurant experience. We love the restaurant so much that we even included it in our MUST TRY list for our out of town wedding guests. We also signed our marriage license with a pen from the restaurant.", "pics": null}}, {"review": {"des": "I came here due to everyones recommendation on a brunch spot. <br><br>i checked for a table online for a Sunday brunch and they still had a ton of tables open so i decided i didn't need a reso. <br><br>M&A is upstairs so you go through the bottom restaurant and go up the leather elevator. <br><br>Unfortunately, we needed a reso. but we checked online and there were still tables available? we ended up sitting at the bar or else the wait was around 30 minutes, which is fine but i had a flight to catch. <br><br>Their brunch is a buffet style. I know you're thinking, how can a brunch buffet be booouuugie? with filets. truffle. etc. <br><br>they had several stations:<br>1.their classic table which had thiccq cut bacon, pancakes fresh made, etc. <br>2.pastries/yogurt/ fruit. <br>3. salad made perfectly to your liking. filets. potatoes. etc. <br>4. egg bar. which includes a delicious truffle omlette that you should try. <br><br>with your buffet comes some pasta and a seafood dish to the table. <br><br>the quality of everything was good. <br><br>but i know everyone must come here for the ENVIRONMENT and the VIBES that it puts out.<br>dimly lit. audacious decorations. beautiful. loud. classy. <br><br>i want to come back and try their coursed meal, maybe soon ;)", "pics": null}}, {"review": {"des": "I really enjoyed myself at Maple and Ash. We started with two complimentary drinks and our waiter was very attentive. My favorites were the wedge salad and the dry aged steak. I also had creamed spinach mashed potatoes and onion soup which were pretty good. I ordered the bacon appetizer and ate it with the wedge salad it was delicious!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/q4O7yZPdNRM7Z9W78zawyQ/348s.jpg", "caption": "Cooked perfectly"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/tOIAmm-VYoigVnGOKctmYg/168s.jpg", "caption": "Medium"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/9O9fh7Ms5KoZiYSPEhrjxQ/168s.jpg", "caption": "Good night at Maple and Ash"}]}}, {"review": {"des": "I had dinner with my son and daughter-n-law the other evening, and enjoyed all that Maple & Ash has to offer.<br><br>First and foremost - the energy and vibe is incredible. Always bustling, crazy good music, tons of beautiful people and staff that look out for every detail. Top notch!<br><br>We had salads, halibut, steak, potatoes and bananas foster. I heard comments at my table reflecting on this being one of the top 5 best meals ever. Nice!<br><br>There are a ton of amazing restaurants in Chicago. Maple & Ash stands out because of it's atmosphere, cuisine and service. It is not an accident that this restaurant is consistently busy. If you want dinner at a destination spot, Maple & Ash is the place to be!", "pics": null}}, {"review": {"des": "5 STARS and then some! M&A pulls out all the stops for a superb dining experience. Upon arrival, we were greeted by our super friendly waiter who gave us a complimentary cocktail and small apps to munch on. SUCH a nice touch. <br><br>My husband and I were there celebrating our 30th birthdays as we are a day apart and they gave us menus that both said \"Happy 30th birthday!\" on the menu. Way to make a gal and guy feel special! <br><br>We ordered everything to share, starting with the meatballs as an app (came with cheese curds and the best sauce and garlic bread - highly recommend!). We then ordered the 8oz filet, the ricotta pasta, broccolini and the mashed potatoes. It was all melt in your mouth good. Holy cow. I sat there savoring each and every bite, wishing the meal would never end! Because we decided to share everything, our waiter had everything split or served directly to us on our plates once the food arrived. Very, very nice!<br><br>The ricotta pasta is to die for and is so savory. It's a bit on the heavier side so best to share! The filet seemed smaller than an 8oz but maybe it's because I was getting greedy and just wanted more because it was so good! The broccolini was very flavorful with the lemon and the mashed potatoes - possibly the best I've ever had. They were creamy goodness and were so buttery and delightful. <br><br>Lucky for us, we couldn't quite finish everything but we have leftovers to indulge in! We will 100% be back and will be singing the praises on Maple & Ash!", "pics": null}}, {"review": {"des": "Swanky and sexy steakhouse. Unlike most Chicago steakhouses in the area that sort of give the old school boys club vibe, Maple & Ash gives it a dark, moody, and sensual atmosphere. If you like candles and chandeliers and fancy adults all dressed up nice, throwing money in the air, this is your place.<br><br>Definitely need reservations if you want to have dinner on a Friday night. The reason I had to drop a star was the initial experience we had with our 9:00pm time. This reservation was the only time slot we could have that were made weeks in advance. Somehow, our host seemed to have forgotten us and we ended up waiting an additional 30-40min before we got our table.<br><br>All was forgiven when our server came by to greet us with welcome drinks. Our server was jovial, fun, easy-going and made up for our earlier miscommunication. Execution of all the steaks were unique and delicious - they know how to play with fire! The tried and true steak will always be a good ribeye. Seafood tower was a luxurious treat. Dessert was scrumptious end to the night.", "pics": null}}, {"review": {"des": "This is hands down the place to go if you want a great dinner. The atmosphere of the restaurant is fantastic, from the decor, music, and good vibes all around. The service was great, our waiter was very accommodating the whole time and knew what he was doing. A+ to the service. Oh but wait, the food was amazing!!!! I ordered the steak frites and my husband ordered a filet. So sooooo good and perfectly cooked. We also got cream of spinach and Mac n cheese as sides. Was more than enough for us both. Overall food was very good, fun place for dinner as a couple or with friends, and price was very well worth it. 10/10 will be going back. One of my favorite restaurants in the city!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/JmRmIF0THnWgjg1pQ-ZjhA/348s.jpg", "caption": "Steak Frites. Prepared perfectly! Fries were amazing too!"}]}}, {"review": {"des": "Phenomenal dinning experience. Beautiful space, impeccable service, delicious food. <br><br>We arrived for an early dinner on a Thursday. As we were waiting to take the elevator up to the restaurant (on the third floor), the manager introduced us to the complimentary photo booth. I must say it wasn't something I would expect in this space, but it was a whole lot of fun. <br><br>After we finished with our photo fun, we took the elevator to the third floor. As the door opened, I was taken aback by the beauty of the space. Parisian chic with a touch of medieval. We were seated in the dining room at table with large, comfortable chairs. Wherever I looked it was simply beautiful. A nice additional touch was the candle burning on the table (no fake flames here), as well as the complimentary martini served to us immediately after we took our seats. <br><br>From the moment we were seated, the service was outstanding. We never waited or wanted for anything. I also really appreciated the \"down to earth\" persona of the staff. In such an upscale place, there is certainly potential for people to be pretentious, but this was not the case at Maple and Ash. Even though it was a fine dining experience, I felt very comfortable and at ease the entire time. <br><br>I ordered the petite filet mignon complimented with the penta crema blue cheese and shared the baked and loaded with my husband. The baked and loaded was super rich and super dee-lish (layered mashed potatoes, short ribs, truffles,cheese, and onion straws).<br><br>In a city with countless restaurants, I would definitely return to Maple and Ash on a future visit to the Windy City. <br><br>Insider's tip: It's also a great spot for celebrity sightings.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/GKBFobalt5KQZSGcxKtCEw/348s.jpg", "caption": "Candle at each table"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/fWlLOsErfdHiIbiNZcvCtg/168s.jpg", "caption": "Baked & Loaded (enough for 4)"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/g52qjTjtaEWwkQMpyUYkKA/168s.jpg", "caption": "Petite filet mignon with Penta crema blue cheese"}]}}, {"review": {"des": "Stylish, classy and yummy! What a fantastic place. Found this gem through a fellow foodie and boy was it good. <br><br>This place is a 4 story building. Sitting space is available outside and right by the entrance there is a bar that I immediately pictured full of patrons during happy hour. After checking in for our brunch reservation, we were instructed to take the elevator to the 3rd floor. The place is gourgeous and customer service is a solid 5 start from the hostes to the kitchen staff that prepares your food. <br><br>The brunch has a separate drink Menu and there is a $30 bottomless option. It makes sence if you will having more than 2 drinks. Also, each food station has shoots you can endulge with while your food is prepared.<br><br>Maple & Ash features smoked dishes. The fine smoked flavor can be savored since you walk in and truly expressed on their meat sections. The brunch is not necessarily buffet but it does have 3 stations; eggs, meats and pancakes/French toasts. Also, it includes a home made pasta and grilled seafood appetizer to share. <br><br>The eggs station let's you get them  your way or  4 different omelet variations. While having my Market omelet prepared, I went to the meat station which featured filet mignon, pork cuts and smoked salmon. Also, there is a salad table which allows you to customized it. The filet was my all time favorite with the salmon a closed second. The beef was the most tender filet I have ever tasted and the salmon was fresh made with a balanced smoky flavor.<br><br>I moved to the pancakes after which their claim to bets the best in all Chicago. They were good so was their French toast. Their crispy potatoes were  surprisingly good and worth the extra carbs. <br><br>This place is for sure a 5 start for food, service and experience. Hope to be back and explore their dinner menu next time I'll visit Chicago.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/UIv_U_8I9c96lBoT-8ADFw/168s.jpg", "caption": "Sea food platter to share"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Eat0FCVpiujwhwwfAZereQ/168s.jpg", "caption": "That omelet though !"}]}}, {"review": {"des": "What a gorgeous restaurant!! Came here for the brunch buffet with a few friends on a Sunday. The brunch buffet is $60 pp and has a breakfast foods station with dessert, made to order salad station, carving station and a made to order omelette station. They also bring you a small tower of cooked seafood (not unlimited) that has jumbo scallops, shrimp and clams. They bring a truffle pasta (unlimited) to the table as well, which was SUPER delicious. There's also an option to do bottomless mimosas ($30 pp) which we opted out of. The breakfast station has your typical breakfast foods like bacon, sausage, freshly made pancakes, French toast, pastries. I tried some of everything and there wasn't anything I was disappointed by. The carving station had filet mignon and pork, and they gave HUGE portions. There was also caviar to top the meat. At the omelette station, I tried the soft scramble eggs with herbs and creme fraiche, which reminds me of my fave entree at three arts club! There's also these refreshing shots of a cocktail with grey goose vodka, lime juice and sugar for you to take while you wait for your eggs. Overall, everything I tasted was of high quality and extremely delicious. Not to mention the ambiance makes this restaurant perfect for any date night or special occasion.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/x-EPz_IXiuWj-THzmjMNag/348s.jpg", "caption": "Truffle pasta"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/_vQaFjk_vY4QFSpOSC9BiQ/168s.jpg", "caption": "Seafood tower of scallops, shrimp and clams"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/qCwhGeYGD2AXDorwMBe5Mg/168s.jpg", "caption": "Pancakes, sausage, filet mignon and pain au chocolat"}]}}, {"review": {"des": "Wow what an experience. Can't come to Chicago without coming to this establishment. Food oh my, drinks great.5 star all the way", "pics": null}}, {"review": {"des": "Maple & Ash was an all around amazing experience! One of my best friends brought me here (who lives nearby) when I came to visit her for the weekend. <br><br>We ordered the following: Summertime Chi cocktails to start, tuna tartare appetizer and oysters as our appetizers, and the petite filet (medium rare was my preferred temp and also the restaurant recommendation by the chef) and fire roasted chicken for our entrees.  We also ordered the asparagus and buttered potatoes as our sides (they're family style). We enjoyed a lovely bottle of Pinot Noir from France (can't remember the name), but it was delicious!! <br><br>The ambiance was incredible - very romantic, chic, and also a bit rustic. We kept joking about the Beauty and the Beast vibes because of the chandeliers, candlestick center pieces, and dim lighting. <br><br>The price point was comparable to most places in the Gold Coast. A bit pricey, but the service, food, and atmosphere is well worth it and makes it easy to justify the cost :) It was SO good and I cannot wait to be back to try some other eats on the menu! <br><br>Thanks, A&M!", "pics": null}}, {"review": {"des": "One of the best meals I've ever had! Every side and appetizer we ordered was absolutely delicious - not to mention the perfectly cooked steak. <br><br>Wonderful selection of wines and our waiter was super entertaining. The decor at this place was phenomenal and added to the already perfect meal. Highly recommended!", "pics": null}}, {"review": {"des": "Okay, where do I start...<br><br>Upon entering 15 mins. early for a reservation, we found the 8 Bar as a sort of oasis on the ground floor and they were more than happy to entertain us before heading to the 3rd floor for M&A.  Before going up to the 3rd floor, we found a selfie station that mixes old school with the new!  Check it out before entering the elevator!<br><br>As you get off the elevator, the hosts are genuinely friendly and welcoming.  Allow them to walk you to your table, past the well-trained chefs, attentive waiters, and among the really cool (sorry, I'm not an architect) decor.  Did I hear Common at here the other day?<br><br>They sometimes provide complimentary apps & drinks which we found to be a pleasant surprise...and delicious!  We ordered their Fork & Knife Caesar salad (w/ eggs, yes!), 16 oz. Cowgirl Ribeye, 6 oz Filet (both woodfired), and their Baked & Loaded. If you like Manhattans, they do it right with those candy cherries to make your tongue break dance!<br><br>Highlights: Everything!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Mm0Prom65EFIKn-3jQ_I5A/348s.jpg", "caption": "Fork & Knife Caesar salad...as good as the entrees and creatively done!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/01xALw88IThATpcTDurJSQ/168s.jpg", "caption": "Baked and Loaded...food coma coming right up!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/NlPTrzZAGVmG8a6GhdRNQA/168s.jpg", "caption": "16 oz. Cowgirl Ribeye...serves two OR one hungry tourist!"}]}}, {"review": {"des": "Visited Maple & Ash today after living in the neighborhood for 2 years and I cannot believe I waited so long! I was pleasantly surprised.<br><br>Ambiance: Great spot for brunch, especially the patio. On a sunny day it's very enjoyable and you can easily people watch.<br><br>Service: Good service, waiter answered our questions and food arrived promptly.<br><br>Food: I ordered the chilaquiles without the queso fresco since I avoid dairy like the plague. I was very impressed especially because I make these at home myself. The tortillas were the perfect level of crunch, the salsa had a nice kick to it and the toppings were kept simple- a fried egg, onions and radishes. My roommate ordered the french toast which came with a side of bacon so it was the perfect balance between sweet and savory. The French toast itself was sweet and very tasty. Lastly the home fries were nice and semi crunchy.<br><br>The only reason I give 4 stars is the lack of dairy substitutes, I wanted to try a sandwich but without the cheese it was basically just bread, egg, and arugula. Still, I would return for a future brunch.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/O7u84NSUkhg45S17NkMK2w/348s.jpg", "caption": "French toast also very tasty!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/nYuTFL7_pqjdBN442_h5hg/168s.jpg", "caption": "Home fries on the side"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/At_DlCUuGr8TaPp065McpA/168s.jpg", "caption": "Chilaquiles- highly recommend!"}]}}, {"review": {"des": "One of the best dining experiences to be had in Chicago. This place never disappoints. If you're looking for a decadent steak and seafood dinner, Maple & Ash should be at the top of your list. <br><br>The restaurant boasts a cool, dark atmosphere<br>with a bar and lounge area at the entrance. <br><br>You are provided with a complimentary cocktail at the beginning of the meal, and the waitstaff is well versed on all of the food items and wines available. The meal itself is a feast. <br><br>Recommendations: dover sole, potatoes au gratin, seafood tower, and the rib eye steak. <br><br>If you want to go big, go Maple & Ash.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/kv6yWDl2bV4lZX5XvOBRrw/168s.jpg", "caption": "Dover sole"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/0RDvouNuNOTy4Ijjx9r0EA/168s.jpg", "caption": "Fantastic wine list"}]}}, {"review": {"des": "My wife and I were so looking forward to celebrating our wedding anniversary at Maple & Ash.  It was one of the very few Chicago \"steak houses\" we had not dined at, yet.   We had a coveted 7pm reservation on a Saturday.  <br><br>The space and the food did not disappoint.  We arrived a little early so we could have a cocktail at the bar.  The bar/lounge on the second floor is spacious and beautiful.  We found an open stool immediately and ordered the house Old Fashioned, which was very good. <br><br>The evening started to take turn when we noticed the bartender and a couple of the servers take a shot (of liquor) to salute the evening.  Not that we really cared but, we found that a little odd for the employees of such a posh Michelin-starred restaurant to be drinking in front of customers or at all while on the job. <br><br>We were seated at a lovely table for 2 after our cocktails at the bar.  Our waitress, Alexandria, came over and introduced herself and at that same moment a patron passed by and said to us that she was a great server.  A good sign I thought. <br><br>Alexandria then congratulated us on our wedding anniversary.  We had mentioned it when we made the reservation in the hope that we might get a great table - we did!  Alexandria then handed us a personalized menu commemorating the special occasion.  This would have been a very nice touch, I have an autographed menu from Charlie Trotter hanging in my home office, but M&A got it all wrong (see picture).  This was our 33rd anniversary, not the 34th; and my name is Nick, not Dick.  Although, I have been called worse.  The menu mistake was not the end of the world and my wife and I did get a laugh out of it.  But I expect better from a restaurant like M&A.<br><br>The meal was excellent.  The very knowledgeable and personable wine steward helped my wife select a nice bottle of wine.  For appetizers my wife had the meatballs and I had oysters.  For our entrées my wife finally had the Branzino.  A Mediterranean fish that we had been wanting to try after only becoming aware of while watching 2012's Amazing Spider-Man. In one of the film's more noteworthy scenes, Peter (Andrew Garfield) endures an awkward dinner with Gwen Stacy (Emma Stone) and her family, during which Branzino is served.  But I digress.  I on the other hand had the 37 day dry-aged bone-in ribeye with the M&A Beefed Up Butter prepared tableside - classic!<br><br>I'm sorry to say that service overall was fair, bordering on horrible.  Our water glasses went unfilled for long periods of time.  Our wine glasses were never refilled.  And the rudest part of the service was a gentleman from the restaurant, that looked and acted like a Secret Service agent, who interrupted Alexandria 2, maybe 3 times during the course of the night while she was in the middle of a conversation with us about the menu.  She literally would walk away from us mid-sentence and huddle with this gentleman for several seconds and then return to us.<br><br>The final insult to us occurred at the end of the evening.  As I mentioned above, we told M&A about our special occasion with the goal to get a great table.  Goal achieved.  We weren't looking for a complimentary dessert.  We rarely, rarely even eat dessert.  But, enter Alexandria carrying a small glass bowl with a small slice of a banana with 3 lit sparklers stuck into it (see picture).  Saying happy anniversary to us.  To which we replied \"Thank you\" as she sat this thing on the table in between us.  My wife and I just looked at each other.  What are we supposed to do (if anything) with this?  We laughed in bewilderment.  And we were insulted.<br><br>They say that if you have a bad meal, but great service you may be more inclined to give the restaurant another chance.  But if you have bad service and great food you are likely not to return.  Chicago is one of the world's best cities for food.  With all those great restaurants to choose from I'm sorry to say that I doubt that we'll give Maple and Ash another try.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/TPCVpX9BpwKNmACExYS8gw/168s.jpg", "caption": "This slice of banana and 3 sparklers were compliments of M&A for our anniversary."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ZGwbGVKJaiaTVotFi13chg/168s.jpg", "caption": "It was 33 years and my name is not \"Dick\".  Although I have been called worse."}]}}, {"review": {"des": "Well, this was amazing. I think this is the restaurant that you think you'll get to experience in a major US city like Chicago, but very rarely do. I think you go to places that get close, get it kind of right, but miss the mark somewhere, either by being too hip, too austere, too farm-to-table-y or too high concept. Maple & Ash was perfect from start to finish. <br><br>Real candles in gorgeous candelabras, impeccable service, a welcome cocktail set this up for success. As the sun set, the interior became truly cinematic, and our dinner began to arrive. The crudo was amazing, everyone loved their salad, and the massive desserts were very memorable and delicious. Our server was exceptional; I never wanted for a single item.<br><br>My steak could not have been better or more expertly prepared. My filet was absolutely wonderful, from the cut of the meat to the perfect preparation, plating, temperature. I absolutely loved and savored every bite. There is nothing I would change about this experience so for that I've got to go five stars.", "pics": null}}, {"review": {"des": "I got the chance to celebrate my birthday here this weekend, and I am so glad I chose Maple & Ash!  A group of 4 girlfriends and I dined in on a Friday evening, and I loved that they started us off with complimentary cocktails and small bites. We had all gotten cocktails at the bar prior to being seated, and they were absolutely delicious. <br><br>For food I had the petite filet, and we shared a number of sides: broccolini, mac & cheese, whipped mashed potatoes and the maple glazed bacon. My personal favorite was the maple glazed bacon, although I wish they gave you more than 2 slices for twelve dollars (it was a little hard to share). Even the bread that they serve was absolutely outstanding, fresh out of the oven, warm and buttery... we had to ask for another order! For dessert, my only regret is that they did not have the 'Chocolate Bomb' on the menu (must have been discontinued?) so I went with the Chocolate Cake. The cake was good, but honestly nothing too memorable/outstanding. <br><br>From the service here, to the drinks, and that delicious maple glazed bacon, my mouth is watering just thinking of another visit to Maple & Ash. For now, the memories will have to suffice- (until I can make it over for brunch;) ). <br><br>Pro tip: Don't miss out on the photo booth downstairs.", "pics": null}}, {"review": {"des": "I love maple & ash! This exceeded my expectation what fine dining is all about. Came here to celebrate my birthday and I had an awesome time. We were welcomed with on the house drinks that our server was already shaking for us and I was shock how good that was as well.<br>We both had our own steak and we didn't even finish it because of how big it was. The seasoning was on point! We had some butter on the side that add the finishing yummy touches on it. The mash potatoes were everything, It was whipped more than perfect and instantly melted in your mouth. I never had such whipped mashed in my life and I wanted more. <br>For the table, we had a seafood platter and OMG it was so delicious. Even though we only got a little piece of it, it was so worth every penny to share it as an appetizer so that we had had room to enjoy our own steak. Came here hungry and left so full. It is expensive but it was so worth going for a birthday dinner. <br>They even give you a printout that said happy birthday on it which I thought was really cute. Now we were full up to our stomachs by now and the waiter was so sweet by giving us a dessert on the house with a candle on top for me to blow out. I really enjoy my visit at maple & ash and will be back!", "pics": null}}, {"review": {"des": "A true world class steak house. Everything from the service, to the ambiance to the amazing food was perfect. Pricing was also perfect. Wow can they do anything wrong? <br><br>Firstly I love the main dining room, remind me of beauty and the beast (so nostalgic +1) . I love the real candles, the tall ones and the real flowers wow. <br><br>The service was Wow our waiter I forgot his name may be Andrew but he was perfect. The perfect amount of words, attitude he was a waiter that lifted our experience for sure. The welcome drink was also a nice touch. <br><br>Ok the food, woah bam. Everything was so good, and nothing was even over priced! The steak dry aged, PERFECT. No sauce needed. <br>Steak tar tar, THE BEST tar tar I EVER had. And I legit prob had 30 at the point of my life. Fire smoke egg yolk, I'd like to add the smexy Iphone emoji here cause that how it made me feel.<br>The Alaskan king crab, wood smoked. Again just perfect. The butter sauce. <br><br>Yes this is pricy but it worth every penny. I'm happy to come back again and again. I can't wait to try the. I dont give a f next.", "pics": null}}, {"review": {"des": "Celebrated an anniversary dinner at maple and ash and it was an amazing experience. It was all of the little touches that really make this restaurant stand out, including  the complimentary starter cocktail and shishito peppers and strong water refill game. We had the branzino and it was to die for. The bone in New York strip had loads of flavor, and the most unexpected stand out of the night- the carrots!! Omg I'm still thinking about the carrots a week later.. <br><br>Wonderful dining experience and I can't wait to return", "pics": null}}, {"review": {"des": "This place is fantastic. Service is beyond excellent and so is the food. <br><br>Steak tartar - allegedly the best ever. I've been on a mission to find the best steak tartar. This steak tartar is outstanding and certainly one of my favorites. The thing that holds it back from \"the best\" is the bread because it is crunchy instead of buttery and fluffy. On the plus side, the bread has this awesome Smokey taste that really sets it apart and is very enjoyable to eat. It's a wonderful steak tartar. Ranking it at a solid #2 (Cochon, M&A, Bavette's, Gilt Bar, Maude's, Longman & Eagle).<br><br>Truffle agnolotti - this city offers a fair amount of truffle pastas (Gilt Bar has a famous dish, RPM and Sienna Tavern also offer delicious truffle pasta dishes). This agnolotti is on another level. Words don't even describe these dreamy pillows. <br><br>Caesar salad - now Caesar salads are generally delicious. This one is again on another level. I know people rave about the wedge but this salad is slightly charred and unbelievably savory. The perfect start to an amazing meal.<br><br>28 day aged bone in ribeye - the first time we got this it was the best steak we had ever had. The second time it ranked at second best. Still very good. <br><br>I know that the Midwest gets a bad wrap restaurant wise sometimes. Known as \"meat forward\" we developed this reputation generations ago with our infamous stock yards which provided Chicagoans with meat - a luxury for most. The steak house was a staple for generations, setting the American standard in 'fine dining'. White table clothes and tuxedo wearing servers offered fussy and pretentious vibes but I'm very excited that M&A has been successful in reinventing this tradition and does so with charm.", "pics": null}}, {"review": {"des": "Nice place. Weird though- the inside restaurant is separate from the outside part. So our reservation was for inside, not outside. Regardless, we scrapped the reservation and sat on the patio. They didn't check us in or cancel our reservation though, and open table sent an email like hey, don't \"no-show\". Wtf? <br>Outside menu for brunch is limited. But at least they offer the regular menu too. Service is painfully slow. <br>Food was really good; albeit the portion size was small. <br>Thankfully, we were not rushed through our meal so we could enjoy the scenery. The patio area is topped with a pergola, so there is no real coverage for rain. Small leaves and what not came down on us but if you don't mind that, the patio is fine. <br>I had the soft scrambled egg, which is a funny name because it's not just one egg. They make scrambled eggs and they give you a scoop. It's probably the equivalent of two eggs. <br>See pics. I didn't leave a crumb on my plate. Yum!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/TXROpxbq_E7v6taHn4tpeQ/348s.jpg", "caption": "Brunch menu"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/A3HNV3z_MHqXR3alTbVU2g/168s.jpg", "caption": "Menu"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/_lF7iEZnFxG5ToYFE9s74A/168s.jpg", "caption": "Soft scrambled egg with pepper conserve, pecorino, avocado, home fries and house bacon. Delicious."}]}}, {"review": {"des": "I was in between 3 and 4 stars here and I went with three, because overall I don't think I would return to Maple and Ash. <br><br>The food was good and the atmosphere was great, but it didn't WOW me and I guess for the prices I think it should. <br><br>I think they are known for their sea food towers, we ordered one and again it was good, but for $125, it wasn't great. <br><br>If you do go here, get the meatballs.", "pics": null}}, {"review": {"des": "The best place to eat I've eaten in the past year. <br><br>My girlfriend and I eat here every couple of months, after we've had a few bad customer service experiences, because you feel more welcome here than you do in your own home. I can't imagine how many patrons they see every week, but a few of the staff STILL remember us by name. <br><br>The food is on another level. I cannot attest to the steaks that cost hundreds of dollars, but everything I've had here is perfectly made. The first time we came we got the IDGAF, but honestly anything is incredible. <br><br>Brunch cannot be put into words. The steak alone makes the $60 a head worth it. <br><br>I cannot say it enough. Eat here for every meal.", "pics": null}}, {"review": {"des": "I had brunch at this place! Yes, it is pricy...but it worth it. Food is so tasty and ambience so magnificent! We had complimentary sea food plate-which was great! <br>For brunch they serve various receipts of scrambled eggs, salads, great stakes, cheese plates, pancakes, all kinds of sweets and fruits! Loved it", "pics": null}}, {"review": {"des": "After we left another great spot with awesome music in the neighborhood we were in the mood for another cool place. We were recommended to try Maple & Ash.  <br> We had few Drinks at the Bar and Erik Was Absolutely Amazing and talented bartender. <br> Music was an Amazing as well but with another different tone. Whoever was no Dj playing wich I was a bit disappointed. We were looking for a loungy spot with a Live DJ. <br> As the music was just a simple playlist. <br> I will go back when they have a live Dj", "pics": null}}, {"review": {"des": "This was hands down one of the best meals I've had.  All three of us dining ordered the \" I DONT give a fuck\" which the chef prepares a four course meal of whatever they choose.  This was the best decision we made.  There was so much food, appetizers, salad with lamb chop, steak, salmon, scallops, caviar, dessert ice cream sundae bar table side!  <br><br>Our waiter Rene was amazing, gave us all the perfect recommendations.  This is our new go to restaurant.", "pics": null}}, {"review": {"des": "What an amazing experience from start to finish. From the moment you walk in you know that this experience will be different than most steak houses. The ambiance is classy and not too loud so you're able to speak. The bartenders are educated in the art of mixology so you know you're getting a quality spirit. The waiter was super knowledgeable about the menu and was able to answer all of our questions. Everything is A la Carter per usual and the side selection is magnificent from garlic mashed potatoes to thick cut maple glazed bacon. You can't go wrong with any of these selections. The steak was grilled to perfection and wasn't overly seasoned which was great because you actually were able to taste the quality of the dry aged meat. All in all, I highly recommend stopping here but make sure to save some money before you come because it's a bit pricey $$$$", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/EqSC5i8JHfm0Y7B6teSJPA/168s.jpg", "caption": "Our table decorations"}]}}, {"review": {"des": "I celebrated my 35th bday here. I called in a reservation of 10, anything over 8 has to be held w/a credit card. The day of, I ended up having only 7 & the restaurant was cool about it. We ordered drinks at the bar until most of the party arrived. Bar service was a 3 he didn't seem to pay attention to certain requests. We were seated on the 3rd floor. Our server was very nice, I hate I don't remember his name! <br><br>We all ordered various items. Meatballs, surf & turf, lamb chops, chicken, beef short ribs. Everyone enjoyed their meal, but 1 person. My filet was cooked a perfect medium rare temp through out and the 1/2 lobster was delicious too. This place is beautiful. I'd definitely come again and recommend it to others.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/GoeOn7qKKXaoN4lcFslBNA/348s.jpg", "caption": "Filet in the surf & turf"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/4_-JD89_PGobrnXdM3jdLg/168s.jpg", "caption": "Chicken"}]}}, {"review": {"des": "Amazing!  <br><br>That's my review without details.  Nothing was bad, absolutely nothing.  From the service to the menu and decor,  excellent!  All of flavors blended across items.  <br><br>I have to go back to try more!<br><br>Let's go starters.   Those wild blue prawns....wow!  The dipping sauces...yes!  This was the best blue prawn cocktail!  It was just good!!!   Let's not talk about the meatballs.  If we do, then I won't be able to finish.<br><br>Almost forgot...that smoked salmon was excellent!<br><br>Do you like drinks?  Cocktails were brought to the table for each person to sample.  Not my thing, but a nice touch!<br><br>The Mac and Cheese is explosive with flavor.  Again, it's one of the best that I've tasted from a Chi steakhouse in while.  It ranks at the top!<br><br>Explain to me how they made this broccolini so good? I'm really trying to figure it out.   <br><br>By the time I worked through the starters and sides,  I didn't even need this cowgirl ribeye.  Unlike other steakhouses, the steak rested a bit so the flavor of the meat could settle.  <br><br>The only thing I didn't like was the walk through the 1st floor bar back to the elevators.  It was congested and awkward.  But at the end of the corridor is an elevator to Amazing!<br><br>I'll be back!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/EDkJwb0LGgewe35uDaj9kQ/348s.jpg", "caption": "Some drink she had."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/1VSlySmSItr3BJ8uUFjACA/168s.jpg", "caption": "Wild Blue Prawn Shrimp Cocktail"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/D5-OMRj6nCW8tN_x6mguVg/168s.jpg", "caption": "Prime Beef Meatballs"}]}}, {"review": {"des": "This place left a bad taste in our mouth over and over again throughout the night. <br><br>Whoever the chef is, props because the food is good. Everything else SUCKED. We made a reservation at 8:30pm. We were ushered upstairs to the restaurant but then told to go \"order some drinks\" at the bar. We sat and decided we might as well... we don't end up being seated until 9pm. It takes forever for anyone to give us any attention. We finally order food at 9:30pm. It takes about 45 minutes to feed us while we just sit and stare around.<br><br>Finally, food is served, no explanation or apology of what the hell is going on. Then the food gets cleared after we're done eating and we are sitting there for 20 minutes trying to get our waiter's attention for the check. He checks in on everyone around us and actively avoids eye contact. We finally get the check and it's completely wrong.<br><br>Thankfully, we got someone else to help us straighten this out. THEN, as we're waiting for the elevator to go down to the exit, everyone coming up exits the elevator and the one worker that's inside the elevator closes the door in our face when we were blatantly waiting to get out of there. BYE FOREVER!!", "pics": null}}, {"review": {"des": "I've been to M&A several times since they've opened for dinner.  Always a spectacular experience with more than enough food and drinks, that I never leave hungry, and always leave wishing I had a pair of sweatpants hiding in my purse.  <br><br>Skip to daytime, Saturday afternoon.  The music is pleasing and a volume where I can hear my convo but not be able to eavesdrop over at the next table (which sometimes seems to be the thing here at night)... not that I've ever done it. **smirk  We were seated in the center room with high ceilings where the acoustics bounce away.  Polished crowd.  $55 bucks a pop.<br><br>Our server, Adrian, very kind, and attentive, don't hesitate to ask for anything he notes.  Polished himself and informative, he delights us with quite the presentation of the menu.  So many stations to choose from.<br><br>I have a Paloma.  It's refreshing, not weak, with pleasant notes of grapefruit.  Well balanced.<br><br>Kale salad.  I added peanuts, crumbs, tomatoes.  The dressing has a hint of heat, and I was jazzed!<br><br>Sausage links are mellow and perfectly salted.  The casing is gentle and not too chewy, smokiness lingered.  Filet... they served two pieces at a time, I chose the beef butter, and it has a wine reduction.  MMMhhmmm. <br><br>Eggs in Purgatory (8 minutes), a bit spicy, made table side, and while I'm snapping a photo, my server folds my napkin when I wasn't paying attention.  Love the detail.  Or maybe it was magic??<br><br>Marketfresh Omelette - big portion, nice omelette chef (engaging), love the goat cheese addition, and a hint of spiciness on that back end.  <br><br>Brioche could be toasted a little bit more, as it was a bit soggy.  Maple syrup is a nice touch (and happy it's not crap pancake spooge).  Blueberries and muddled raspberries.  <br><br>Browned Butter Brownie is the perfect chew.  Coconut Pie missed the mark for me.  I didn't get any coconut flavor other than the toasted coconut on the top.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/JdQlTS-Ah2YBoktEGDAXpg/348s.jpg", "caption": "Yummy"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/w7UDT12mmxiFVqkEkfICPA/168s.jpg", "caption": "\"Guilty as charged\". Haha (where's the handcuffs emoji)"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/pWsq0FdVjflapt4TqsEDQw/168s.jpg", "caption": "The meatballs.  OH!  Yum So saucey"}]}}, {"review": {"des": "A week ago I had an opportunity to host a group of colleagues in the city. I planned the whole evening with drinks at one of downtown iconic pubs and dinner at M&S. We got in for our 8:30 reservation and were greeted right away and our table was ready on time. The restaurant is very full and it was hard to have a conversation with people sitting across the table. We started our dinner with a nice bottle of wine. The selection of wine here is great. Our waiter did a great job and if yelp had a separate rating for waiters he would get 5 stars. <br>Each one of us ordered our steaks and within a short wait time the plates along with three sides appeared in front of us. Everything was going perfect until I cut a piece out of my Snake River Wagyu Filet. I was in shock. SALT!!!  All I could taste was salt. I figured maybe the end piece got sprinkled with salt so I cut another piece from the other side and same taste of salt in my mouth. <br>I informed our waiter of what is going on and he immediately offered to remake it. I was good with that because I was looking forward to enjoying piece of wagyu filet. Few minutes later I was informed that the kitchen had no more wagyu filet and I was offered wagyu strip. At this point I am starving so I said yes whatever you have just bring it. Few moments later piece of strip shows  up. Unfortunately, this piece was rare and not medium how I originally ordered. At this point I was done and still starving. <br>Out of the six different steaks at the table one more steak was very salty but my colleague was too hungry and did not send his filet back. <br>We ended up getting some desert to share which was delicious and I ended up eating most of it but at that point I needed to eat something. <br>Bottom line; I waited a long while to try this place, the wait staff was great, the desert was awesome but there was no way I was going to pay over $100 for a wagyu filet that tasted more like a brick of salt than tender piece of premium beef.", "pics": null}}, {"review": {"des": "Finally an upscale restaurant where strict dress code is not required. Their \"I don't give a F\" menu was an excellent choice for me and my husband. Thanks to our server, Walker for an outstanding job.", "pics": null}}, {"review": {"des": "Considering how excited my wife and I were to try Maple and Ash, we couldn't be more disappointed.<br>If you ever take your leftover steak home and have to re-season it because it was so bland, that's a problem. The lamb chops were decent. The French Onion soup was good, as was the Mac n cheese and the loaded baked potato. <br>Couple the below average food with the very rude waitress we had, and it isn't a good recipe. The atmosphere is so upbeat and it was completely shot by our waitress's attitude.", "pics": null}}, {"review": {"des": "This is a must try restaurant! The steak is the best I have ever had. It was perfectly cooked and super flavorful. I wouldn't want to put any sauce on it because the meat alone is fantastic. I enjoyed the 10 oz filet mignon, it was expensive but worth it. <br><br>The au gratin potatoes were super cheesy and delicious. Personally there was too much cheese for my liking but I still enjoyed it. The mashed potatoes are fantastic they are so creamy and flavorful, I will definitely get the mashed potatoes again. <br><br>They pour you a house martini once you sit down - this is a nice touch and my drink was delicious! <br><br>Our server was very friendly and knowledgeable about the menu. <br><br>My only critique which appears to ring true with some of their other reviews is that the food can be slow. I understand they are busy but for a high end restaurant it's something they can improve on. At least my food was cooked perfectly when we did receive it. <br><br>The atmosphere is cozy, I like the lighting and decor. <br><br>I will definitely be back!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/UDy-y9BRE8WcULaP5NTYQA/348s.jpg", "caption": "10 oz Filet Mignon - fantastic"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/QVC7IyF2f6RG_vqdDoCk2A/168s.jpg", "caption": "Yukon Gold Gratin - super cheesy"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/3_RCP5yJx2yegPJ98M45yg/168s.jpg", "caption": "Steak and lobster"}]}}, {"review": {"des": "Amazing ambiance, service, food and design. I loved tge candles. The restaurant is so loud which is a big part of the ambiance.", "pics": null}}, {"review": {"des": "We went out for a date night. We arrived about 15 mins early expecting to wait even with having a reservation... we did not wait at all and got seated right away. We were seated and the attire is a mix of business casual and casual. Atmosphere is good you can hear well and the background music is not overwhelming.<br><br>Service: Derrick our host/server did a great job, attentive, gave good recommendations and knew how to delivery what we wanted. He made the experience 5 star quality, sit in his section.<br><br>Food: Let's see we got the Semi-pro Tower to start us out it had every seafood item I wanted to devour and we did exactly that. Calling it a tower is a bit of a stretch, but the seafood was good.  Next we shared the Australia rack of lamb cook Medium +. This was cooked very well and it was what really hit the spot. <br><br>Desert: Was a coconut cream pie and boy let me tell you, you cannot go wrong with that. I almost fell asleep after eating that delicious morsel. <br><br>Reason for 4 star due to pricing, while it was up scale eating the prices were bit high for what is provided. I believe you can enjoy this for a special occasion like we did, but not a on a regular basis.", "pics": null}}, {"review": {"des": "If you want the eat the best food of your life, come here. Yup, I said it! By far the most splendid atmosphere, service and food. All around amazing experience the seafood tower was incredible. The taste made me come back a second time in the same week while I was visiting. And the second group of people I brought agreed with how I describe the crazy good food!!! Come here and you won't be disappointed! And get the bananas fosters! <br><br>Ps....the birthday take away was awesome!!!", "pics": null}}, {"review": {"des": "What an absolutely incredible brunch experience at Maple and Ash today with my family!! David and Dario took the best care of us, not a moment went by that we were without a drink or a delicious dish in front of us!! The brunch was fantastic but the service really shines here. David finished off the brunch with a flaming bananas foster over a chocolate globe! We were extended family and best friends here and we couldn't have picked a better locale!! Thanks Dario and Dave for a great time!! Salud!!", "pics": null}}, {"review": {"des": "Chicago house wives, NBA players, & the filthy rich! <br><br>This place is absolutely elegant. The top notch come here and it shows. The plates are amazing! The servers are there to please you and will try their best to make you happy. Ours every day down with us for a few shots! My party tried a couple cuts of steak which I heard to be amazing. I had a mashed potato side along with a vegan friendly pasta. I would have it everyday if I could.<br><br>The layout is pretty interesting here. When you walk in you'll find a very small bar and seating. If you have a reservation you'll walk through to the back and find an elevator that takes you up to the actual restaurant. SUPER COOL. <br><br>This is a perfect spot for a date night for a very special occasion.", "pics": null}}, {"review": {"des": "Mason from Maple and Ash contacted me through yelp and insisted that we come back for dinner on them. It was a much better experience and Mason and his team went above and beyond to accommodate us. We were truly pleased with the food and service. Thanks for making it right and hats off to you guys.", "pics": null}}, {"review": {"des": "Great ambiance and service. The food was good but a little salty. All in all, we had a great visit. My one gripe is their corkage which is higher than many comparable steakhouses. We brought our own wine and still ended up with a $400 bill so be prepared to spend.", "pics": null}}, {"review": {"des": "Second time around with a large group on a Friday night. This time went much smoother. We were seated promptly. An interesting flower based martini was poured for us, not too sugary. Martinis aren't my thing really, but it was nice. We once again enjoyed a warm seafood tower. This is a winner! Have yet to see it on a menu elsewhere in town, so definitely check it out on your visit. <br>We split most items as a group this time. The other highlights were the 28 day dry aged ribeye, sliced to share. It's rare that I go back for more steak, but that was amazing! I do love lamb, however, & the lamb chops did not disappoint. Cooked to perfection & served warm. We also tried the wedge salad, chateaubriand (with a garlic sauce made to make your mouth water), asparagus, mashed potatoes, & more mushrooms. Don't leave without getting those mushrooms! They are made in heaven. <br>Mason was our server this time. He was terrific! Polite, prompt, funny, & attentive. Happy to have experienced a better time around! <br>Maple & Ash is definitely still a hot spot in town. If you feel like dressing up, or going out to one of the trendier places in town were a good number go to \"be seen\", this is your steak house! If you want a quieter evening where there isn't a crowd, don't come here on the weekend. It's a hot spot for a reason, and once you try the seafood tower & mushrooms, you'll be hooked for good! <br>The table finished off with the chocolate cake & coconut cream pie. That chocolate cake is still a winner & I'm definitely more of a Sundae or pie girl, so that is saying something about that cake now that won on 2 occasions.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/tumPjUMmxcoL0pFE_w3pIQ/168s.jpg", "caption": "Chocolate cake"}]}}, {"review": {"des": "My crew surprised me with upstairs reservations at Maple & Ash. Now that's a cool crew. <br><br>Maple & Ash is the new \"to-die-for\" hot spot downtown.<br><br>MAPLE & ASH<br><br>Maple & Ash is an innovative take on the traditional steakhouse; mixing a modern aesthetic with authentic service to deliver classic wood-fired dishes.  <br><br>With a sumptuous menu crafted by two-Michelin-star chef, Danny Grant and a wine program named one of \"America's Best\" by Wine Spectator, Maple & Ash finds a way to celebrate every moment.<br><br>THE SERVICE & EXPERIENCE<br><br>There's a note in the margin of Maple & Ash's menu: <br><br>\"If your neighboring table has a candelabra that you want, swipe theirs while they're using the restroom.\" <br><br>I love sexy mischievousness, and this Gold Coast hot spot has it all. <br><br>From the openers, cocktails (I tried their Louis Roederer Cristal Brut 2009), and appetizers, to the delicious deserts, the food is deadly serious.<br><br>The service is the best in business; the staff is well trained at fine dining, and is at the top of their game.<br><br>Pure excellence. Believe the hype. <br><br>CONCLUSION<br><br>I adore Maple & Ash; it's more than a restaurant, it's an experience.<br><br>5/5 RECOMMEND<br><br>OF NOTE<br><br>*Drop off is encouraged.<br><br>*Maple & Ash has a cool wine club.<br><br>*Events are welcome.<br><br>*For more information: <a href=\"/redir?url=http%3A%2F%2Fmapleandash.com&s=0ae2ff84ffcf6bcf00063757304aaa0ad33a68a63c8406a48e7626b107ad17c4\" target=\"_blank\" rel=\"nofollow\">mapleandash.com</a>", "pics": null}}, {"review": {"des": "I recently went to Maple & Ash for a holiday brunch with a group of friends and loved it! Let me start by saying, the restaurant is absolutely beautiful.  It took everything in me to not walk around taking pictures of the entire restaurant. In addition, Maple & Ash had decorated for the holidays and had gorgeous wreaths and ornaments all over the restaurant.  I would love to host a party in their space.  <br><br>Now onto the food.  On Sunday, Maple & Ash does a huge brunch buffet.  But this is not your ordinary brunch buffet. Everything was far too luxurious to be considered a mere buffet.  They had an omelette station that operated out of the kitchen that made absolutely amazing omelettes (and they even had shots while you waited).  There was also a carving station that served filet mignon and salmon. Another station had pancakes hot off the griddle, along with the rest of the breakfast classics.  Finally, there was a dessert / pastry station.  But it didn't stop there!  On top of that, the waiter brought a mini seafood grill platter and agnolotti directly to our table and hot out of the oven.  Needless to say, I had a VERY hard time deciding what to eat and left incredibly full.<br><br>In terms of service our waiter was nice, but nothing special.  There were a few times when we had to follow up about drinks, etc., but there were no major hiccups with service.  <br><br>Bottom line, brunch was delicious.  Check it out and come with an empty stomach.", "pics": null}}, {"review": {"des": "Outstanding brunch experience from start to finish. I was blown away at the fact that Maple & Ash is not only a trendy spot to be at, but the food, ambience, and service are high quality as well. The hype is real people!<br><br>I was here with a group of gals for our annual holiday brunch. From the second I walked in I was impressed. Valet parking, complimentary coach check, an elevator upstairs to the main restaurant, plus the hostess walked me right to my group's table. Service was fabulous! Our drinks were always filled and despite the busy brunch hour, the bottles of champagne were always stocked at our table.<br><br>That's right - they offer $25 bottomless mimosas and juices. What a steal (especially at a place like this). Their brunch buffet was impressive and for (I believe) $50 you could make all your brunch dreams come true! Seriously, they have so much to offer -- pancakes, sausage, bacon, pastries, yogurt, fruit, omelettes, eggs, sweets, steak, seafood, and more!<br><br>Our group grazed and sipped for about 4 hours and it was so much fun. The restaurant was beautifully decorated for the holidays! Everything I ate was delicious and my favorites were probably the pancakes and my ham and cheese omelette. The seafood platter they delivered to our table was a pleasant surprise as well! It included shrimp, scallops, and mussels.<br><br>By the time we left our group somehow scored a complimentary bottle of pink champagne and a free brunch as well. Not sure what all transpired as our service was great, but we'll take it! They even brought out a fabulous dessert for my friend's birthday which was a nice surprise.<br><br>I can't wait to come back to Maple and Ash and bring my husband. We'll have to check out dinner here sometime soon! Especially since the ambiance has a sexy-date night vibe.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/S9SCEYuDmDDUhH1pH4efKA/168s.jpg", "caption": "Brunch"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/EynHRQCK3I2wkM5F3RkEGQ/168s.jpg", "caption": "Brunch seafood platter"}]}}, {"review": {"des": "Delicious, Awesome Customer Service, Elegant..<br><br>I went to Maple & Ash on Christmas Eve with my Brunch Bae on Sunday. The service is outstanding & the food is delicious and well prepared.  We were a little upset that brunch was not served this day but it was highly suggested I return for the experience.<br><br>She enjoyed the Petite steak well done that was seasoned perfectly and cooked even better, it was not dry like typical WD and no red :).  She was very pleased.<br><br>I ordered the Short rib stroganoff that was delicious, the past was too al dente for me but it was still good & that fresh dill put it over the top.  We order a side of brussel sprouts to share and it was more than enough.<br><br>We loved how they welcomed us with a tasty martini.  This place has a beautiful classic rustic feel thats perfect for date night.<br><br>Also our hostess was great & I cant wait to return to experience brunch & the IDGA#.", "pics": null}}, {"review": {"des": "Went here for a big milestone birthday dinner while in Chicago and it was worth it. The restaurant had a really nice ambiance which was low lit and was rustic and elegant at the same time. They start you off with some pate, butter, and compotes with various breads and crackers. <br><br>The wait staff was very attentive and had good recommendations for first timers. I remember having a seafood tower that was absolutely amazing. It had king crab, scallops, shrimp, mussels, and oysters. Sides of lemon were available for squeezing. The Mac n cheese was a side I could not pass up and I'm glad I didn't. It was oven baked and full of cheese. Very oily but hey, you only live once right?<br><br>The birthday boy had a large steak. It had to be re fired once but it tasted smooth and full of flavor. <br><br>The restaurant pulled out the stops and made a news press cover that memorialized the 40th birthday event which was great. The dessert that topped it off was a banana chocolate pie that was encased in chocolate. They pour hot caramel over the chocolate dome which reveals the pie inside. It was so rich and flavorful. <br><br>Leaving there was tough because of how stuffed I was. But was well worth it.", "pics": null}}, {"review": {"des": "This restaurant was amazing. The sponsored ad is what brought me to it's page and I fell in love with it from there. I wanted to surprise my boyfriend with a intimate birthday dinner and it met and surpassed expectations. The pre-dinner cocktail was delicious and refreshing. It was just the right amount. Our server was very attentive and had great recommendations. Overall, the atmosphere was great and very romantic. The personalized menu was the icing on the cake. My boyfriend is still talking about the dinner weeks later. We will definitely be back!", "pics": null}}, {"review": {"des": "I would have given 5 stars if our reservation time was honored. We had reservations at 8:30 and we didn't get seated until after 9 p.m. We waited in the lounge, which was a consolation, since my husband and I were celebrating our wedding anniversary so we enjoyed drinks while we waited. I would have appreciated if the hosts provide us with an update instead of my husband walking up to the host stand twice to get an update on our table. <br><br>Our waiter, Bart was wonderful. Excellent customer service and extremely nice and knowledgeable about the menu, wine selections and pairings. Bart truly made the experience celebratory with a nice toast to start our dinner. We ordered the Caesar salad smokey and flavorful. We then had the filet mignon paired with the beefed up butter which was so delicious ... it really complimented the steak beautifully. We enjoyed a bottle of wine dinner. To end our dinner, Bart brought over the chocolate cake, which was delicious. My husband and I really enjoyed our meal and plan on coming back! <br><br>Thank you to Bart for going above and beyond to ensure we had a memorable dinner experience.", "pics": null}}, {"review": {"des": "Came here for my friend's bday and I was SO impressed. I had the Scotchy scotch scotch and omg it was so good that I had 2 of them! And they are strong lol. It was like an old fashioned on steroids. No wonder it is so well reviewed! I also had the agnolotti, it is their hand made pasta with ricotta filling. I told the waitress o had been lookin at this pasta but I was concerned that it would be too heavy since we were going out after for my friend's bday. She assured me that it was just the right amount of food, and wouldn't be too heavy. Oh my god I am so glad I ordered it!! It was so flavorful but light and delicious and it had truffles too  I've also had the tuna tartare here on a separate occasion and it was incredible.<br><br>The atmosphere is so nice in here, everyone is always dressed so elegantly and the lighting is dim (real candelabras!!). It's a really sexy place. <br><br>Our waitress (I forget her name but she had really cute short blonde hair) was amazingly attentive and really knowledgeable and I was so impressed with her ability to take care of a massive birthday party with all split checks and people kept getting up and moving seats (as an experienced server myself that would have sent me into cardiac arrest but she was poised and so on her game!). <br><br>Can't wait to come back here all the time!!", "pics": null}}, {"review": {"des": "Maple and Ash has become my absolute favorite steakhouse in the city! The service is top notch and the food is amazingly delicious!! I had the bone in filet mignon that was cooked to perfection (medium), best tasting asparagus, the baked and loaded was so yummy (not a baked potato) and THE Bacon was incredible, never in my life have I had bacon this good! For dessert the chocolate cake with coffee cream filling topped with a scoop of vanilla ice cream was very light and tasty! Our server Megan was fantastic as well.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/gZgVwZJ0afb3TsQ0KUe8lA/348s.jpg", "caption": "Chocolate cake with coffee cream filling and a scoop of ice cream"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/B00ROrghsRrTf75PBYnwAw/168s.jpg", "caption": "Bone in filet, asparagus, bacon and the baked and loaded"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/7J2gDsltjQkg1t0ROYewnw/168s.jpg", "caption": "When you don't know what to get, you order this!"}]}}, {"review": {"des": "I came here last night with some clients and we had a fantastic evening.  Jamie, our server was FANTASTIC.  Jamie was fun, engaging and made the entire night more of an experience.<br><br>I had a 48 day aged steak and it was out of this world.  All of the sides were as tasty as the steak- loved the mash potatoes.  Wine was good, bread was good- you really can't go wrong here.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/XU_7Y-QaGZhP9Nlt7DjLoQ/168s.jpg", "caption": "Jamie is the best server ever 100%"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/gK30IsVyQSj-jVR77Aa-2A/168s.jpg", "caption": "48 day aged steak"}]}}, {"review": {"des": "Went here on Friday night for the first time and we were all blown away. From the food to the service, everything was nothing but top notch! I'm normally hesitant on going to upscale places since I believe that the ambiance takes away from the flavor of the food but man oh man, the food was just delicious!<br><br>The pork dish, steak and loaded potato were among my favorites but I highly doubt that you can go wrong with anything you order here.", "pics": null}}, {"review": {"des": "Great steakhouse experience on a visit to Chicago. The food is very good, service was great (except for the long wait for our table, but it seemed like a busy night), and it's not crazy expensive. They give really big portions which is definitely enough to share. French Onion Soup was really good and not salty (like a lot of places are)!", "pics": null}}, {"review": {"des": "THIS is Chicago's destination dine! As close to a New York feel with Beverly Hills looking bimbos as you're gonna get in the Chiggity Chi!<br><br>Way back to the elevator and up to floor 3 you're greeted by a packed host area after which is a beautiful and fairly large bar (also packed), and finally the coup de grace, a plush and mod sexy dark dining room.<br><br>So popular is M&A that we were seated 45 min late on an 8:30 Thursday rez. No matter, so much the better to stare at the eye candy staff and patrons and have a drink and work up more hunger for what's to come.<br><br>Our server was effusively nice and cool as shit. We got comp booze, a rum and cucumber concoction that was quite nice, and even a sublime pumpkin agnolotti and some other on the house accommodations. <br><br>Cocktails and beers were spot on. Their bread is literally the best I've had at ANY establishment. Steak tartare shined, one of the best around. Octopus and calamari dish was good, not amazing.<br><br>We all got surf and turf for $65 and my 6oz filet was HEAVENLY. It was as rich as ribeye and cooked perfectly. The mashed potatoes and garlic were ultra rich but not overly so paradoxically. The half lobster was wonderful but there are one or two better ones elsewhere.<br><br>Coconut pie, a long skinny affair, was delightful. I was stuffed full but it was so light and fluffy with toasty coconut bits that I forced several bites.<br><br>While expensive, none of this really even broke the bank. And not even a finger printed and lipstick'd up wine glass nor throw up on the stairs to bathrooms on floor 4 could reduce this truly 5-star spot.<br><br>My homies and I goan make this a monthly ritual.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ElPzHdtLIPSE0bqz6vzcEQ/348s.jpg", "caption": "Squid and big octopus chunks in there somewhere. Great!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/C9gKrzkqGaNAXh8RESGuSw/168s.jpg", "caption": "About the best steak tartare you goan find!!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Vvkk10bBLte-JpxGqB9Esw/168s.jpg", "caption": "We're gonna do M&A once a month!!"}]}}, {"review": {"des": "Food is delicious, everything we ordered was great. Make sure you make reservations ahead of time because they are always booked. They also take awhile to bring out your food so be prepared to be there for awhile. Service was good no complaints our server was very attentive.", "pics": null}}, {"review": {"des": "This review is for Sunday brunch.  <br><br>Great ambiance! The decor, music, energy in room......made the experience a lovely one.<br> <br>The buffet isnt cheap at $55, but a nice treat, especially for a special occassion. There are several options and everything I had was delicious.  My friend talked about items like the french toast being cool/cold, but being I'm a slow eater I didn't even notice.<br><br>I won't go through all the food items, but will share tips. <br><br>1- At The Carving Station are bowls containing garlic, some type of butter, and a bowl with flakes of salt. Definitely take some of the salt it's actually really good on the meat. <br><br>2- the fire roasted eggs are amazing. However the sauce is a little spicy so if you can't take heat don't try it.<br><br>3- there's a container of caviar/ roe by the salmon. If you've never tried caviar, go for it....it's free.<br><br>4- they do bottomless mimosas but in a different way. You get the entire bottle of champagne along with two carafes (oj & peach juice) and a shot glass with mixed berries. If you're the only one at your table doing mimosas then note you'll have that entire bottle to yourself. Happened to me, but it was my birthday so I was in celebration mode.<br><br>5. Each table IS provided with a sample plate of scallops, shrimp, mussels and pasta. It's just enough for everyone to get a taste and all delicious.  I've read others say their table was missed, hunt your waiter down if you have to.....its worth it.<br><br>That all said, I'd come back.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/6Py4rAaIChl0Sdt3Eqe_jg/348s.jpg", "caption": "Banana bread, coconut cream cake, cream puff (with lime flavor), filet mignon, caviar/roe."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/8R4YBKKvLCvgPfYurmL_4Q/168s.jpg", "caption": "Roasted eggs"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/2dslhY_TCw55gkfgwxmUWg/168s.jpg", "caption": "Filet mignon, crispy potatoes, bacon, french toast, salmon, caviar/ roe"}]}}, {"review": {"des": "Love this place. Wife and I went for dinner and absolutely loved it! The menu had some old school dishes, with modern twists. Our server was great and the sommelier recommended the best wines with our meal. Definitely a recommend for anyone looking to dine here.", "pics": null}}, {"review": {"des": "This place has got it all - beautiful décor, great service and delicious food in a trendy up-scale hot spot in Chicago. If you are looking to go to a place to be seen, this is one of those places. You walk in and the restaurant is beautifully decorated while being dimly lit perfect for a date or a business dinner. The cooked seafood tower was quite nice and the steaks were cooked as requested with plenty of favor. Although there are so many great steak places in Chicago, this should be on your list of ones to check out.", "pics": null}}, {"review": {"des": "The more I dine here the better it gets, everyone takes such great care of me and the food is perfection in and of itself. They take such care with their product and it shows.  I would never think that I would enjoy radishes so much but I love them as a simple nibble before the main attractions. On my last visit I brought three guests who had never had the opportunity to dine here previously and all were won over. Not only the impeccable service by Jennifer, the perfect food, and the in depth education by Patrick the Wine Captain, but the over all ambience of the restaurant really won my guests over and all three declared it to be the best experience of our family get together weekend. Which included multiple Michelin starred establishments. All of us would prefer to dine at Maple and Ash than anywhere else in Chicago. Three of our party of four simply do not care for lamb but all three declared the lamb lollipops to be exquisite and delicious. One of our party is a bit iffy about oysters and thought that the fire roasted oysters delectable. As to the wines how can one comment on pure perfection, Patrick paired our meal's wine divinely, I trust Patrick implicitly to select my wine. This is the must dine place!", "pics": null}}, {"review": {"des": "I made reservations for my husband's 30th birthday dinner at Maple + Ash. The food was delicious and the welcome cocktails were a very nice touch.<br><br>For dinner, I had the seafood tower which came with an assortment of seafoods e.g. lobsters, scallops, mussels, etc. It was quite delicious! My husband opted for the filet mignon, which was very delicious but also a tad small of a portion size. Definitely opt for something a tad bigger if you are working up an appetite that evening!<br><br>For a fun treat, I would recommend trying the ice cream sundae bar for dessert. You get to choose a few ice cream flavors and they will bring out an assortment of delicious toppings.<br><br>The ambiance is very modern, with a touch of old-school class. It was a tad loud in the restaurant, but we were still able to carry on our conversation audibly. The service was good, however, not extraordinary. Our waiter was attentive, but could have been a bit friendlier and more informative regarding the menu options.<br><br>Overall, it was a wonderful experience! Would definitely recommend for a nice celebratory dinner!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/wInHC9fMxwCSFwZ5_1sEfg/168s.jpg", "caption": "The ice cream sundae bar was so much fun (and tasty)!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/0a0yicL_XmXPjXUKTfXlRg/168s.jpg", "caption": "The delicious seafood tower. Would certainly recommend (unless you have shellfish allergies)!"}]}}, {"review": {"des": "Amazing experience celebrating my fiancés birthday! The roasted seafood is to die for (we got<br>the crab) and the steaks were equally as good! Good tasting drinks, super pretty, and with a good amount of alcohol in them! We got greeted with complimentary drinks and small plates and our server was very friendly knowledgeable and fun without being overbearing. The decor of the place was also really cool, especially the candle lit tables! Make sure to make reservations well in advance, this place was super busy!", "pics": null}}, {"review": {"des": "I consider Maple and Ash one of my top ten favorite restaurants!! I have been here a few times for brunch when traveling to Chicago and I'm so happy that I got to enjoy it again this past weekend. The ambience is incredible, I love the high ceilings, the decor and the moody lighting! The food is to die for! Brunch is buffet style and ranges from pancakes to filet mignon (one of the best I've ever had) Do yourself a favor and check this place out... you will not regret it!!", "pics": null}}, {"review": {"des": "The decor of this place is amazing. Candle lit atmosphere which was really hip. <br>The food was amazing. I had the bone in ribeye and it was cooked on a wood fire flame perfectly and seasoned just right. All of the sides we on point and the service was top notch. Did not have to wait or want for anything. I highly recommend this place if you are in the mood for a great steak or a great piece of fresh fish", "pics": null}}, {"review": {"des": "Ok this is my first review in a while/ a review I actually feel like writing and honestly it's because I'm so excited to explain how awesome this place is. My friends and I stumbled upon this place reading an online blog of top brunch spots in Chicago. Originally we were supposed to go to Fremont's AYCE/ AYCD brunch but thank goodness they didn't take us in because of Max reservations. We called in on the day of and and made a reservation for a party of 5 easy. Walking in, the host at the front directed us to walk towards the back of the restaurant and take the elevator the third floor. Waiting for the elevator there's a cute photo booth (that doesn't print out pictures but you can send to yourself via text or email) next to the elevator, super cute and fun! So, the way the brunch works is that if you want to do a la carte, the seating is bottom floor and outside seating. If you're doing all you can eat, it's at the third floor. <br><br>SERVICE: When arriving to the third floor, they had another host stand we checked in with and sat us immediately. Our server, I wish I could remember her name was certainly amazing and enhanced our experience! She had such charisma to her and was super easy to talk too/ sweet. Since this was a buffet style so if you think about it, to compliment her service for just checking up or refilling drinks, she did beyond that. She kept us entertained and even took the time tell us different spots to check out around Chicago since we were visiting the area. Actually, the whole staff as well was so sweet, all so helpful and gave impeccable service, what was really awesome about them is how cool and how they didn't seem to put on a fake customer service act and seemed to actually like their job. <br><br>AMBIANCE: The ambiance was a low lit lounge which they lit real candles which I was questioning if it was a fire hazard or not. It was upscale but nothing too overwhelming, the interior was very simple, clean and upscale. Wasn't too loud, a very nice place to chat with friends/ family. <br><br>FOOD: so with the buffet the way the set up works is that all the breakfast food and desserts are towards the front of the dining area on the side opposite to the kitchen. They offered bacon, sausage, pancakes, potatoes and French toast. My personal opinion from the station is that you should probably get one thing front this station unless you're a huge breakfast fanatic because the other food they offer is worth the room in your tummy. The pancake with wild berries was so freaking good, super light and moist, didn't need any syrup and was sweet/ buttery enough. They had a salad station which was like a sweet green or fast casual salad bar where you customize your own salad and they mix it for you. This was awesome to me, they offered so many different options and even offered avocados (I freaking love avocados) and good quality goat cheese which melts in your mouth. Next to it was the protein which was smoked salmon, porkbelly and filet mignon which they cut for you. It was really nice because they offered so many toppings or pairings for the salmon next to it like dill sauce, even CAVIAR, and a bunch of other stuff. The omelette station was separate from the breakfast station and what was one of the coolest parts of it was not that they made it fresh in front of you or that you could customize it but that they leave a little tray which is a cute surprise of shots!!! To add more excitement to the boozy brunch. The omelettes were really good we fluffy, light, full of flavor from the quality of ingredients. If you get the fire roasted omelette it's basically sunny side up eggs in a skillet with roasted peppers and tomatoes and has a kick to it. I think it was my favorite although their market omelette was good as well but just a simple omelette. What is also included is their seafood tower which is ordered to the table, basically is sautéed scallops, shrimp, mussels in a pan that's cooked in butter and seasoned. They also send out an order of house made ravioli what is stuffed with ricotta cheese and served with a mushroom sauce (one of my favorites!!) what is nice is that it's part of the AYCE but it's made to order so you just let the server know when you want more. My second favorite thing was the filet mignon, for all you can eat, it was up to par with Brazilian steak houses. <br><br>At the end the bill came out to $100/person for both the buffet and bottomless mimosas. (Not including tip)  I think it was worth it. The experience was lovely and so was the quality of service and food. If you're looking for a place to treat yourself, this is a must try. Brunch is probably my favorite meal and this place tops high in my brunch place. If you're from the DC/VA area reading this, this brunch place is up to par with sequoia in Georgetown but catered to younger adults more so than families or adults. Whenever I come back to the visit Chicago I would have this as my go to place for brunch.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/4tp0S5J7i8QupS7sfHsOEA/348s.jpg", "caption": "Fire roasted eggs"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/8gulc3d3g-OP6arWgCpM9Q/168s.jpg", "caption": "Cooked seafood tower"}]}}, {"review": {"des": "Food was great. Chef is def top notch. Pasta and aged rib-eye was delicious and well prepared. Seafood is fresh and well cooked. <br><br>Only downside to our entire experience is the waiter. Def needs improvement to match the top notch food. My colleague put it best: \"Matt was a pretentious ass.\" We were very excited for the experience. After 15 mins of looking at the menu, we already knew what we wanted to order, but he made us wait 20-30mins before taking our order. Once we finished, he didn't clear our plates until his counterpart came by to pick up our plates. He asked if we wanted desserts, told us what the options were and left. We wanted 2 chocolate cake and wanted to order if he wasn't so quick to go back to his corner! Well, he never came back to see if we wanted desserts or anything else. Thankfully, he turned around and we just asked for our check. Done. Not waiting anymore! <br><br>Would I be back? Yes because the food is great. Would I sit in Matt's area? Hell to the N-O!", "pics": null}}, {"review": {"des": "My second visit to Maple and Ash went a lot smoother than my first visit in June 2017.  My only small issue this time around was with the time we were seated at our table.  Our reservation was for 4:15pm on a Saturday, but the restaurant didn't allow guests to come upstairs to Maple and Ash until about 20 minutes later when the restaurant was officially open.  In the mean time, my boyfriend I got the chance to enjoy cocktails downstairs in the Eight Bar lounge. Waiting wasn't a huge deal, but I don't understand why a restaurant would have the option of making a reservation at a time when the restaurant isn't even officially open.  <br><br>Once we got upstairs, the service from our waiter was excellent.  He was very personable and attentive to us during our visit at the restaurant.  Our chilled oysters, aged ribeye, and potato gratin were all outstanding.  The food is something I can never hesitate to recommend to people if they are looking for a quality dinner experience.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/n7TBMoNn0Ps9dFMOUx4Msg/168s.jpg", "caption": "28 day dry aged ribeye"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/rfqmt6UZsZti7GwPnekNjg/168s.jpg", "caption": "Yukon gold gratin"}]}}, {"review": {"des": "Uniquely amazing.  I came here with a party of 5, and it is one of the best restaurant experiences I've ever had. Each of us were provided with a fruity vodka mixed drink, some beets, crackers and prosciutto. All complimentary! <br><br>I ordered the petit filet and mac & cheese as the side. The filet didn't match my taste buds. It had a weird flavor so I won't be getting that next time. But I had a bite of my boyfriend's Eisenhower and that was delicious!<br><br>Was so full but we haaaave to end with the Sundae Service! This was awesome! They provide a bunch of toppings like fudge, nuts, sprinkles, fruit, etc. And everyone gets a scoop of raspberry, of vanilla, and of chocolate.<br><br>I want to come back for the IDGAF special but need to expand my stomach first. :)", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/9eQafZt6_HR76mh6eee5Jw/168s.jpg", "caption": "sunday service"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/5UOY40TjFr5jI_JXFw-6mA/168s.jpg", "caption": "petit filet mignon (front) eisenhower and brussels sprouts (back)"}]}}, {"review": {"des": "I made a reservation through OpenTable for my boyfriend's birthday.  In my notes in the OpenTable reservation, I wrote \"celebrating boyfriend's birthday.\" Usually restaurants ignore my notes but Maple & Ash texted me to ask the name of the birthday person which was cool!<br><br>The restaurant has a sexy, elegant vibe.  We went on a Monday evening and were surprised how packed the restaurant was.  Guys were dressed in sport coats, girls in dresses and heels ranging from clubby outfits to maxi dresses. I felt under dressed in my summer dress.<br><br>We had to wait about 10 minutes before we got seated so the hostess told us we could hang out at the bar while we waited.  I got an Early Morning, Longer Night and the man got Dreams of my Playa. We both ended up liking my drink more.<br><br>Shortly after we got seated, radishes (with some sort of butter?) and these thing cheesy crackers were brought out for us to snack on.  Our waiter, Marty, was awesome.  He had a great sense of humor and greeted all his tables with a cocktail.  The cocktail was rum based and tasted like honeydew.  It was so good we ended up ordering another glass each.  <br><br>Food wise, we started off with the French onion soup and prime beef meatballs.  Marty asked if we were sharing both appetizers and we said yes.  When the food came out, the soup was served in 2 separate cups which was really nice.  The soup and meatballs were both so good.  I love a rich broth for the french onion soup.  The meatballs were seasoned really well.<br><br>For our entrees, we both ordered the cowgirl which is essentially a ribeye but with a little less fat.  I ordered a side of bone marrow and my boyfriend got the baked & loaded. Marty explained to us that the baked & loaded wasn't your typed baked and loaded potato.  It was a layer of braised short ribs on the bottom, whipped potatoes on top, some other stuff (maybe onion strings?) and topped off with a truffled gravy.<br><br>All of the food was so good...and we definitely had a lot of leftovers.<br><br>And the reason I mentioned that Maple & Ash texted me asking whose birthday we were celebrating was because they brought out a menu that had \"Happy birthday Victor\" printed on it.  <br>To top off the night, w<br>e got the chocolate bombe for dessert which was yummy! A little too sweet for me but it was still a unique dessert.<br><br>I can't wait to come back and try all the seafood dishes and foie gras!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ul6ucIjty574dTczFG16hQ/348s.jpg", "caption": "Cowgirl"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ZwL7zvhBIaarInuna0IgMA/168s.jpg", "caption": "Baked & loaded and bone marrow"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/MaJqZILj0tOEeJ6l3fuBqg/168s.jpg", "caption": "Meatballs"}]}}, {"review": {"des": "Spectacular experience; perfect setting and vibe!!! A place I will definitely be back to.<br><br>Dinner at Maple & Ash was an amazing experience. We dined on the 2nd level. The customer service here was unreal; the attention to detail was so well received. Thank you for the perfect and above the bar service! <br>The food was also something to brag about. My husband and I enjoyed all of our picks as well as the complimentary ones.<br>We were welcomed with a complimentary cocktail at the table which was delicious and well balanced. And set the tone well for our Friday night in Chicago. The waiter also presented a small charcuterie style plates and warm bread basket to keep us company while we reviewed the menus. The olives/pickled veggies, cheese, cured meat and bread were perfect to pick at our taste buds.<br>  I had a couple wines throughout the night and had the staff pair it with our order and my preference in bold/dry which worked real well. My husband really enjoyed his old fashioned too.<br> We had the Wood grilled Spanish Octopus and Oysters as starters- the flavor and char on the octopus was great. And the oysters wonderful.<br> As an entree, we shared the Whole Roasted Dover Sole and it was LOVELY!!! The staff made this entree split for us with a delicate and beautiful presentation. We also shared a side of Mac n Cheese which was hefty and plenty as a side for 2-4 ppl.<br> The dessert was a show in itself, just checkout my video of the flambee tableside. WOW. <br><br>Cannot wait to go back and try their \"I DON'T GIVE A F*@K\".", "pics": null}}, {"review": {"des": "So after posting my review on here, I was messaged by Maple & Ash directly wanting to make up for the awful experience I previously had.  <br><br>I'd like to thank Mason & Maple & Ash for an amazing experience  They truly went above and beyond when they didn't have to, and showed me that they really do standout as a top tier steakhouse in this city.", "pics": null}}, {"review": {"des": "First of all, fabulous service. Adrian was a phenomenal waiter and made my husband's birthday super special. We really enjoyed the seafood selection (especially the fire roasted king crab). We split the tomahawk between four adults. I'd go back just for the potato gratin side. And for dessert, we had the sundae service which was delicious and a beautiful display! Oh and I love that they bring you a cocktail right as you sit down at your table - so fun.", "pics": null}}, {"review": {"des": "Fire roasted blue prawns- flavor was lacking to me, but my boyfriend loved them.<br>Roasted chicken- flavor was lacking to my boyfriend, but I loveeeeed the dish. <br>The salmon dish- very fresh & flavorful.<br>Yukon Gold Gratin- best I've had EVER!<br>Creamed Spinach-best I've had...ever! <br>Wednesday complementary Martini- I ordered 2 more !! <br>I'll rate this place a 7/10. Would come back for sides, martini & to try the lamb chops ! (The table next to me had them with some type of special butter atop & the smell was sensaaaaational) . See you soon M&A", "pics": null}}, {"review": {"des": "0In my 30 years of living, never have I truly understood what a 5 star experience was until I dined here. This amazing place has \"raised the bar,\" so to speak and I can honestly say it was one of the most unforgettable dining experiences I will treasure for a lifetime.<br><br> The service here is impeccable and the cuisine is to die for! My husband and I came here for our anniversary and walked away with no regrets, or disappointments. It is relatively a new establishment (around 2 1/2 years old) and the ambiance of this place has all the feels of a new, hip place for all of it's customers. They take good care of their staff and that in itself should tell you something about coming here. The servers are provided with custom tailored sports coats and dressed to the nines! They treat you as if you were royalty the moment you sit down. Our server's name was Rene and he took great care of us throughout our whole experience. <br><br>We both ended up going with the \"I don't give a f*@*$\" menu item which means the kitchen gives you the best of everything on their menu in the style of a 4 course meal. Boy, do they pay attention to detail or what! Even their wedge salad could not compare to any other salad in the world for flavor and texture. The way they marry the flavors with each menu item we received was phenomenal. They even served us complimentary fresh French bread and butter, cheese crisps, crunchy fresh radishes with a cheese spread and a type of salami/ prosciutto before we even ordered. The appetizers included crab legs, manila clams and extra large prawns that were bursting with flavor of chili oil and garlic butter. Following this item came a cheesy Italian rotini pasta cooked Al dente that they mixed in with the seafood. Dare I even mention that they also gave us caviar served in steamed half oysters laying on top of vodka filled shot glasses? I mean C'mon now!  <br><br>Then, as if that wasn't enough, our entreè was a 27 or 35 day aged bone in ribeye cooked to perfection served with amazing gourmet sides of the most delicious mashed potatoes and gravy, cheese filled pasta, grilled asparagus and the best seared scallops you ever tasted in your life! Finally, our dining experience concluded with a divine Neapolitan scooped ice cream dish that came with a three tier tower of topping options from salted caramel wafer bars, to sprinkles, to coconut flakes, to crushed walnuts, to hot fudge and hot caramel drizzle.  <br><br>Needless to say, you get your money's worth here. We weren't even able to finish it all, so we definitely took it back to the hotel with us for a late night treat. If you are looking for a place to splurge, or impress someone, or spoil the one you love, this is it! It was one of the most romantic and excellent dining experiences I have ever had!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/enwCI9m3VmYBr6Y-8lDrrQ/348s.jpg", "caption": "Here I am feeling more than perfect on my Anniversary with my husband."}]}}, {"review": {"des": "We had two different experiences here. The first \"miscommunication\" was expelled from our memory based on the second one. We were truly looked after,  the service was flawless, food was  absolutely amazing, the drinks were perfectly matched. This was the. complete experience is not one we will forget any time soon. A couple of times we looked at each other after tasting something  and just smiled. Mason and the whole team has our thanks for an amazing experience.", "pics": null}}, {"review": {"des": "Wow. I was very impressed when I returned to Maple & Ash for dinner. Everything was amazing. Our server Kevin provided excellent service.<br><br>Fork & Knife Caesar was really good<br>Roasted Seafood tower is a must<br>Lamb Chops were excellent<br>Dry-Aged NY Strip was excellent and cooked to a perfect med rare<br>Scallops were perfectly prepared<br>Excellent wine pairings from Kevin<br><br>I completely understand why people rave about Maple & Ash. The food is amazing and the atmosphere is different than any other steakhouse in Chicago. The music and atmosphere are upbeat and add to the experience. It's clear that Maple & Ash has a standard they want to maintain with their food, staff and atmosphere. All first class, I'll be returning soon.<br><br>If by chance you have any issues when there I suggest mentioning it, it's clear the staff wants everything to be perfect and will remedy the situation.", "pics": null}}, {"review": {"des": "So my manager asked me to find a place that is light, fast, casual, and had a salad. Let me tell you, this place doesn't fit that description. Butttttt, it is everything besides that and so much more. I really liked this place! I would say the biggest downside is that it is super loud so bring a blow horn. However surprisingly that wouldn't detract me from going again. It is all about leveling expectations. One other thing, so someone in our group had a nut allergy and they were definitely not good about communicating that something they brought out had nuts so that could've been a huge problem, so be very diligent on your own. Venue is great for a date night, fun team dinner, and has a HUGEEEE wine selection. So prepare yourself. <br><br>A few super fun things: You get a welcome cocktail. So you know how you normally get excited when there is bread or chips/salsa to greet you. Well they upped it to a great drink. On top of that there is some complimentary bites that are very good. They kicked off the experience strong. <br><br>Now for the actual food! <br>APPETIZERS<br>Meatballs: Honestly I would've happily eaten this as a meal. It was sooooooo good. Like a ton of flavors bursting in your mouth<br>Prawns: They had the shells on them so it felt like too much work. It needed a better sauce or something to add some more flavors<br><br>MAINS:<br>Crab: So it was different because normally you get your grab and then a small cup to dip into melted butter. In this case the bottom of the plate was lathered with it and a mixed sauce, which I have to say was very tasty and impressive. I would've gotten this again as its a sort of light option but very tasty. <br>Lamb: My friend who is a lamb lover/powerlifter (just because thats cool to note) said that this wasn't necessarily his favorite dish he's had. So I would recommend going more for a steak option because....<br>Filet Mingnon: This seemed to be very enjoyable to the person who got it and he said it was phenomenal. Also someone who regularly eats steaks <br><br>SIDES: <br>Macaroni: Like the meatballs, I would say this is a MUST. <br>Asparagus: They were fine. Its also a vegetable so I am sort of biased, because how do you compare this to mac <br>Fries: The fries were a nice compliment and the perfect texture.", "pics": null}}, {"review": {"des": "I visited Maple & Ash with an 18-person group, and we had a limited menu that had been pre-selected, so I don't have much feedback on the pricing or full menu options.<br><br>What I can say is that everything we ate was absolutely fabulous.  I had the bone-in filet, which melted in your mouth.  After sampling most of the salads, meatballs, octopus, and seafood tower, I was sure that I wouldn't make a dent in that filet, but I kept eating bite after bite, with no regrets! <br> Service was top notch as well.", "pics": null}}, {"review": {"des": "First time here. Awesome experience and food. David and Dario were the best hosts. Already planning a return visit with other friends and family.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Qqw84O9M4gZJMHDm-ANkBQ/348s.jpg", "caption": "Jeff Toleman, Mike Toleman, Katie Toleman, Shane Bridges, Scott Cain"}]}}, {"review": {"des": "Where do i begin. Maple&Ash is definitely a thumbs up restaurant! I made reservations yesterday night for 2 and when we got there we were greeted and seated right away. First thing the server did was give us a complimentary cocktail which i very much enjoy. He was very attentive and kept checking on us to see if we had any questions about the menu. I ordered the snake wagyu strip with the trussel pureé and can i say i am absolutely in love! The mash that came with that dish was the best ive ever tasted and it went so well dipped in the steak.<br>We also ordered the bone marrow and the dish came out placed so perfect and beautiful. The coconut dessert we had was extremely delicious also and im not even a fan of coconut! The ambiance is quite nice there and our server was very kind and handsome might i add haha. I would definitely come back and eat here again.", "pics": null}}, {"review": {"des": "Outstanding restaurant, in my opinion one of tue best in Chicago. The service, food and drinks are all very outstanding. The wine list is amazing. Had the branzino but everything looks really good. This place has a great chef and staff.", "pics": null}}, {"review": {"des": "This is an excellent experience. Went for dinner - early seating. Great ambiance.<br><br>The food was amazing. Great appetizers, main course (rack of lamb), sides (mashed potatoes, center cut bacon, broccoli,etc....). Probably the best lamb I've ever had.<br><br>We were in a bit of hurry as we had a theater reservation. But when we come back we're going try IDGAF as a group.", "pics": null}}, {"review": {"des": "Tony is the best waiter ever! Just putting that out there. Oh yeah, the food is amazing too! <br><br>We were a party of 9 and all got our own entrees and shared a bunch of sides. I got the salmon and it was great. For sides, we split sautéed spinach, the Brussel sprouts, mashed potatoes and the mushrooms.  I thought all four were great. I really liked the spinach but others at the table thought it was too salty. <br><br>I left dinner very full and happy.  When you come, ask for Tony!<br><br>Tony told us they are opening up a second location in Scottsdale, AZ this upcoming Fall!", "pics": null}}, {"review": {"des": "Food is excellent.  Atmosphere is quite romantic - a nice change from the stereotypical steakhouse.  Only complaint is service could be a tad better for a restaurant of this caliper.", "pics": null}}]}