{"name": "margies-candies-chicago", "reviews": [{"review": {"des": "I have such fond memories of my first time coming here a few years ago. Friends and I managed to snag a table and we all marveled at the huge sundaes and gravy boats of hot fudge. I just wish I was able to recreate that experience.<br><br>Don't get me wrong, the ice cream is still fantastic, but it loses some of its charm when presented in a styrofoam takeaway box instead of porcelain bowls. And unless you're willing to wait, or you get very, very lucky, you'll have to settle for the takeaway. And even then you might end up waiting an absurd amount of time. I really cannot stress enough how packed this place can get. It's hard to appreciate the cozy atmosphere they' got going when the crowd is blocking most of the decor. If you do get a seat, but it's not a booth, be prepared for a nerve-wracking dining experience as servers and patrons must get uncomfortably close to you in order to pass by. <br><br>All that said, I really can't bring myself to give Margie's less than four stars. It's a five-star place with a major crowding problem that unfortunately means that not everyone will have a five-star experience. I hope that one day they're able to expand, make the place a bit easier to move through, or at the very least, figure out a solution for handling the crowds. I really hope that happens, because I miss going here.", "pics": null}}, {"review": {"des": "I hate to leave a 1 star review but I honestly do not understand the high reviews of this place. My boyfriend and I went on a late Saturday night after watching a comedy show. It was one of the few places open for dessert. It was crowded with structure. Everyone was just standing crowded around the people who are eating in the booths which I felt bad for those people as they were trying to enjoy their ice cream sitting. <br><br>The ice cream does not taste or look homemade, so I don't think it is. The toppings looked old and you can see the toppings are just store bought Sara Lee brownies, canned cherries, etc. The place looked and smell old, not in a cute aesthetic way either. We didn't try the chocolate as it look gross just sitting in some glass front with no one standing by it and various old knick knacks surrounding it. <br><br>Overall, it was inefficient way to serve ice cream that wasn't even good. The poor server, servicing customers at the booth had to jump and leap around everyone trying to get to go ice cream. Workers looked like they hated working there and I don't blame them. Don't waste you time. I've had better ice cream from a grocery store.", "pics": null}}, {"review": {"des": "If you're looking for a comfy, well lit, affordable, and delicious place to get your ice cream fix, Margie's Candies is the place to go.  Although we went late in the night for a midnight snack, it felt very welcoming and family friendly.  I really wanted to try $69 \"The Royal George\": 25 scoops of ice cream in a punch bowl doused with all the best homemade hot fudge and assorted toppings, but I was not in the right mindset to tackle that challenge.<br><br>I settled for the $10.95 Eiffel Tower, which came with your choice of 4 scoops of ice cream, banana chunks, strawberry chunks, dried blueberries, peach quarter wedges, whipped cream, fudge, and peanuts.  We 4 flavors we got were the Cookies and Cream, Praline, New York Cherry, and Chocolate Chip.<br><br>The environment was so authentic.  We were seated in a booth with a mini table-side jukebox and a view of an array of retro pictures and trinkets.  It was quiet enough to have a pleasant conversation with a friend and listen to the best hits of 2000 playing on the radio in the background.  The waiter was friendly and water was served immediately to us upon arrival.<br><br>The ice cream itself had a delicious mixture of toppings and everything tasted so good.  I personally was surprised with the New York Cherry flavor.  I would definitely recommend.  The chocolate chip and cookies and cream were also delicious, but it mixed together, and after a while, it was difficult to decipher which was which.  It came with 2 wafers good for soaking up those last melted scoops of ice cream out of the bowl.  It was very delicious, needless to say, if there were no one else in the restaurant, I might have been licking the rims of the bowl.  The meal could be comfortably shared between 2 people.<br><br>For your reference all sundaes and splits come with your choice of ice creams at no extra charge.  Flavors include: Chocolate Vanilla, Butter Pecan, Strawberry, Coffee, New York Cherry, Coconut, Chocolate Chip, Cheesecake, Pistachio, Strawberry, Cookie & Cream, Praline, Banana, Mint Chocolate, Sherbet, and Sugar Free Vanilla.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/XhGjOahRdTiq-QdVEKV3fw/348s.jpg", "caption": "Look at all the chocolates!"}]}}, {"review": {"des": "Some of the BEST desserts in the City! This is a great little date spot that's been here forever! The nostalgia is wonderful and it takes me back to a simpler time. <br>The ice cream and candies are divine. You only plan on getting a little but end up spending a small fortune for a \"taste\" of this and that! Look  at these dishes!<br>Summer weekend evenings are the busiest times with the wait being upwards of an hour to get in. Yeah, it's small and intimate, which makes you so appreciative when you FINALLY get a seat. Worth the wait though! If you're driving too fast you'll pass it...so slow down, get a seat and enjoy! Oh! Eat your wafers!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Ic85q0gaoAosLpgO5XuVpQ/348s.jpg", "caption": "Nostalgia!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/eC6VDp65b8dXlkDVoe5hhA/168s.jpg", "caption": "Apple Cobbler & Ice Cream"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/O84AtF-NUPmqI2e3R0Z_yQ/168s.jpg", "caption": "Butter Pecan"}]}}, {"review": {"des": "This places had delicious desserts! I live the atmosphere too! It's different! At first I thought it was pricey but then I saw the serving sizes and Two people can easily eat out of one order!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/J9VQMQS2CnsmGgLKQ0GuRg/348s.jpg", "caption": "The atmosphere"}]}}, {"review": {"des": "Lines were pretty long, portions were huge but the ice cream was delicious so it was worth the wait. I had hard time picking what I want from the menu because there were too many options to choose from plus everything sounded like you will get a bucket of ice cream with every order. Not that I am complaining but I wanted a smaller serving and they didn't have too many options to choose from. I will be back next summer to give them another try.", "pics": null}}, {"review": {"des": "Why I haven't written a review for Margie's yet, I'm not sure. I'm guessing it's probably because there are already so many reviews saying how great it is that another one won't really change anything. <br><br>Well, it really is one of the best places to get a dessert and I should probably include it on my list of places in to visit while in Chicago. I've never had the candy here because I usually get something ice cream related and it's never a disappointment. My last visit, they were closing up but still offered to make us stuff to go. which was nice of them.", "pics": null}}, {"review": {"des": "Got my period and was craving sweets so found this spot.... best find ever!!! So many choices of sundaes, great atmosphere, definitely a place to come and hang out often. Had the strawberry shortcake sundae and brownie sundae, both awesome!!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/-0nUnPX014UMTtfEpJCoLw/348s.jpg", "caption": "Brownie sundae with warm fudge on top!!!! Sooo good"}]}}, {"review": {"des": "A Chicago classic. This place has been around forever. I've enjoyed ice cream here since I was a kid decades ago.  The only complaint is that the seating is very limited.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/yq2IROslyYQuLQEKqYDEIw/348s.jpg", "caption": "Decor"}]}}, {"review": {"des": "Old fashioned style ice cream shop.  Classic spot.  Not a million flavors.  Not a ton of flash.  But great ice cream.  Marshmallow topping is under appreciated and stellar.  They have a billion options.  Maintained the classic look.  They also sell candy and have actual food.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/TygiQzDvcqak1K6n8Cp_Lg/348s.jpg", "caption": "Inside"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Op3kR8oIVv1Sttpi9FUxdg/168s.jpg", "caption": "Inside"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/AWo_zTwcFn_E6lMKDVQ2zg/168s.jpg", "caption": "Inside"}]}}, {"review": {"des": "I mean, do I really have the explain how awesome this place is?!?<br><br>To start, it's ranked as one of the best ice cream shops in the United States. A ranking they truly deserve because the ice cream genuinely tastes AMAZING. <br><br>Every single time I come here, I remember why I love it. The quality of the ice cream ingredients is delicious, as all flavors have the perfect blend of creamy, savory and sweetness. My personal favorite flavor is cookies n' cream!! <br><br>I would highly recommend trying a sundae, the turtle one is ambrosial in every regard. <br><br>If I had to chose something I didn't like about this place, it would have to be how it's ALWAYS packed! I expected them to have a bigger location by now but they don't. The average wait time for a table is usually 30 minutes and the parking sucks too! <br><br>However, that wait is totally worth it in my opinion. You'll  get the best ice cream you've ever tried with a vibe you won't forget!!", "pics": null}}, {"review": {"des": "I really want someone in my life. Not cause I hate being alone, or cause I wanna be with someone. My needs for another person in my life is so that I can go to Margies and order one of their delicious and ridiculously HUGE ICE CREAM creations. Until then, I can only stare thru the window at all the happy people enjoying a 6 pound TURTLE sundae, or a table sized banana split. Sadly, all I can accomplish is a single scoop ice cream cone, cause even those scoops are enormous. Seriously, I think one of these creations is heavier than a 3 month old puppy. <br>The room is tiny, so be prepared to wait in line for a table. You may be better off ordering to go, and praying it doesn't spill inside your car.", "pics": null}}, {"review": {"des": "Super cute old school place with incredible ice cream sundaes.  Their hot fudge is fantastic and served in a ladle you use for gravy on Thanksgiving.  The classic sundae is a healthy portion of great ice cream accompanied with fresh toppings, and the menu offers a litany of fabulous other ice cream creation options.  A bit pricey for a sundae, but worth it for the quality and quantity you receive.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/OX40EYH8ZptrerKtELHo6g/348s.jpg", "caption": "Old Fashioned Sundae - best way to beat the Chi summer heat!"}]}}, {"review": {"des": "Did you ever get a strong craving to eat ice cream in a vintage shop before? Well, then Margie's Candies has answered your cravings! It's definitely a unique experience. <br><br>First, you are probably going to have to wait since it's popular and there aren't a lot of seats. It's in the shape of a square basically. They have a big glass viewing case right in the middle and the edges around it are booths. In the viewing case, they have candies kind of similar to the kinds you might get <br><br>They don't go all out for crazy unique ice cream flavors, but you get a lot for what you pay! They serve the ice cream in giant old fashioned dishes. You'd be amazed by the size. Quick service, too! Definitely worth trying if you come to Chicago!", "pics": null}}, {"review": {"des": "This place is legendary.  Is it a bit part of team #TooMuch?  Absolutely​!  However, come for the nostalgia and to cool off on a hot summer day.  The portions are large and definitely​ shareable.  All of the sundaes​ come with a syrup gravy boat, nuts, wafer cookies, and whipped cream. <br><br>Come early and be prepared to wait, more often than not, you'll have to wait.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/GtcvZZ3z4nrfCmGEpm71_A/348s.jpg", "caption": "Sundae."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/HPNaXd0Xe8X6fYi2kOCokw/168s.jpg", "caption": "The Astronaut."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/-ItRsdwJibZzHIk06DOvng/168s.jpg", "caption": "About the same size as the sundaes sold inside."}]}}, {"review": {"des": "One of my go to ice cream shops. <br><br>- always fairly busy but quick service<br>- they bring water with refills to everyone <br>- it's a old fashion overly crowded that reminds me of a great grandma that loves to hoard stuff but she's always sweet with a load of stories, it's a good thing! <br>- So many options! <br>- large portions <br>- fair prices", "pics": null}}, {"review": {"des": "Came here in a group of 4 to check out the hype. Seating takes a while.<br><br>My boyfriend and I shared the Eiffel tower. Have you ever seen those side by side photos, of pinterest expectations and failed reality photos? Well, this was a prime example of it. The presentation definitely fell sort of expectation. Realistically, it looked like a smoothie that hadn't yet been blended. The container/bowl/vase that our ice cream was in was rather tall and large and awkward to eat out of. There was fruit on top that looked like it had been tossed on rather inelegantly, comically and ironically for a name like the Eiffel Tower...<br><br>Maybe I am insensitive to ice cream, but taste-wise- don't get me wrong, it tasted fine- but it was average- equivalent to ice cream that I could have gotten at a grocery store, or other chain ice-cream shop.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Ox8rnMZRiMQxHGL3Mm0J3A/168s.jpg", "caption": "Not so appropriately named Eiffel tower"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/pHquBrctthFwD05aajrXZA/168s.jpg", "caption": "Banana split"}]}}, {"review": {"des": "I don't get what the hype is about this place. I think the biggest draw is the old timey ice cream shop vibe about this place and is a cool place to chill for a bit. In terms of taste, the ice cream itself was very meh. Actually the ice cream was probably my least favorite part of the sundae/banana split (and I tried many flavors: coffee, vanilla, cheesecake, pistachio). Also pro tip, don't get the pistachio. I am a huge pistachio fan, but this pistachio was like neon green and tasted quite fake. The turtle was decent. I'd say skip the ice cream, just go for the candies.", "pics": null}}, {"review": {"des": "I want to say thank you for all the help and excellent service Margie's did for me. Thank you to Yary for going over and beyond the call of duty on a special request. Without her I would never got my shipment on the surprise I have for my GF. <br>This is a top notch place to come and call for your chocolate home needs anywhere in the world. Love the place.", "pics": null}}, {"review": {"des": "I absolutely love visiting places that contain a taste of history and walking into this store it felt like I stepped back in time. Such a beautiful and authentic store, I loved gazing at all the antiques and Knick-knacks all around the store, wondering what the story was for every piece placed around the store. The ice cream was out of this world! So creamy and the fudge was so warm they absolutely complemented each other! Loved that this store stayed in its mostly original condition since they first opened, please keep it that way!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/h8RrCRlgdLcUMu2C3YMcSQ/348s.jpg", "caption": "Ordered a fudge banana split, Brownie Ala Mode, and root beer"}]}}, {"review": {"des": "Why is there always a line on a warm day here?!<br>And the ranking in America?? Lies. All Lies.<br><br>It's not good, its not even okay. This place has ordinary ice cream, horrible food (seriously DO not eat here unless you want to spend the night in the bathroom when you get home), seating is tight and old, service is always rushed and in a hurry, and I always leave here feeling sick, and with a migraine. <br><br>Their sundaes are nothing special. They have plain usual ice cream flavors with whip creme, syrup, nuts and toppings... that's it.  If you want to go to a place to have a good time with friends and family, share a desert I can name three other places within 2 blocks are are better.<br><br>Just take a picture in front of the ice cream cone, and then take the bus down to Jeni's, Mr. Freeze, or Mikko's instead. Trust me its better.", "pics": null}}, {"review": {"des": "I love Margie's. Good ol' fashioned ice cream and sundaes. It's a cozy place and a great place for kids. They even offered us cups to split our sundae. I mean, really, were you NOT going to share that?<br><br>I'm docking on star for their sundae presentation. How could we have shared? We would have needed longer spoons and to stand up. They basically put 4 scoops of ice cream at the bottom of a tall vase. A plate would have been more ideal.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ldudGymj9MfZYq0bnY1t8w/348s.jpg", "caption": "Disappointing presentation..."}]}}, {"review": {"des": "No matter how many times I come here the food service and ambience is always amazing. Worth the trip out for that sugar rush. <br>Although the turtle is the usual order just about everything is great here. <br>The biggest drawback is impulse control from eating all the fudge. Warm rich and hearty it's instant diabetes but sooooooo worth it!!!!", "pics": null}}, {"review": {"des": "Of All the classic ice cream shops in Chicago my two faves were either Margie's or gerties back in the day. Well Margie's beat gerties 15 years ago and they still beat them now, hands down! I love the turtle sundaes here! ice cream is just my favorite thing to have after a bad day lol or even during summer with friends. You can't go wrong with their hot fudge too it's a must that I get an extra side of it. I would go here every week, but I'll treat myself every now and then. This place takes me back to my childhood and I feel like a big kid with their ice cream! Mostly everything on the menu is good! The lines are long but totally worth it, booths are old fashioned such a nostalgic place to be in. Employees are quick and they are pleasant too.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/QTE8KL_lc8Z0pGGsQjPlpQ/348s.jpg", "caption": "Soooo good takes me back to my childhood, I enjoyed the whole thing!!! Lol"}]}}, {"review": {"des": "Came here with a group of friends to try out \"THE ROYAL GEORGE\". The place is super tiny and we had a group of 6 people. We waited about half an hour before we were seated. We ordered pretty much all the flavors of the ice cream they had available and doubled up on some of them. Honestly, it's just a huge bowl of ice cream piled up with whipped cream on top. They gave us caramel and chocolate fudge syrup to put on top along with 7 ice cream cones. We didn't get nuts because we had a friend that was allergic to them. We ended up leaving the place with 2 containers filled with leftover ice cream that we couldn't finish which was about 9 scoops. It was definitely an Instagram worthy experience. Now I can cross this off my personal bucket list. Only get it if you have a group of friends who are into sweet or else good luck!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/8GCpwm14TZjTsUrWZa98ag/348s.jpg", "caption": "Royal George!"}]}}, {"review": {"des": "Before you die, you must try this 25 scoop masterpiece! Bring your friends! Ask for the \"Royal George\"", "pics": null}}, {"review": {"des": "This is a lovely old fashioned ice cream parlor with generous portions. What's not to love? The scoops are large, perhaps bigger than my clenched fist? I ended up getting a two-scoop marshmallow sundae when I visited, and couldn't come close to finishing it.<br><br>That sundae included a boat of chocolate syrup that my table of 12 probably could have shared, but that's half of the charm, right?<br><br>We were tempted to get the 25-scoop sundae, but opted out since we were there very late into the night and didn't want to keep the wait staff there past closing time. (At 1 a.m.! How many ice cream parlors have you visited that are open that late?)<br><br>The sundaes also came with the best wafer cookies I've ever eaten, which I can only assume are homemade.<br><br>I will definitely keep this on my short list of places to go the next time I'm in Chicago.", "pics": null}}, {"review": {"des": "A cute old school looking diner but for dessert! They actually seat you & take your order. There's a jukebox on every table ,the waiters are super nice, and the menu is amazing!", "pics": null}}, {"review": {"des": "Growing up I always passes this place but never went in. I finally decided to check it out and liked what I saw. The place has such a charm to it. I love how they kept it so original. I had no idea that it was a restaurant as well which was pretty interesting. I think the ice cream and chocolate could use some tuning because it was great, just good. I also didn't like that there were no samples of chocolate. How can I buy something that I'm not even sure if it's good? However, the service was great and it was a good time. Would I go again? Nah.", "pics": null}}, {"review": {"des": "Visited this Margie's location today, and boy, was it something else. I understand they cannot control certain aspects, like lack of seating or staffing issues, but it's the customer service and general cleanliness is what turned me off. The menus are STICKY from previous guests, and the guests waiting to pay & guests waiting to seated were huddled around the door awaiting directions which never came. When we (the guests) tried asking the waiter any questions, he answered with a shrug, a sour expression, and a brisk brush by. My party and I simply walked out and had ice cream at Jeni's; we ran out of patience.<br><br>The very least you could give is an apology + an explanation.", "pics": null}}, {"review": {"des": "To begin with, completely crowded, absolutely chaotic and a little bit cramped. The interior is loud and you can barely move between the narrow spaces and the tables pushed together. There are chairs outside as well and generally a crowd outside of the diner. Very old timey vibe inside, looks like something straight out of the 60s. Never tried coming here that late but they're apparently also open until midnight which is crazy. <br><br>When we came it was a little confusing to figure out how to queue or get our number taken. There is also a small aisle where you can buy boxed goods to go, and it was hard to figure out where the line exactly was. They have the works that you can buy out as well - massive chocolate covered marshmallows, and every imaginable caramel / turtle combination. <br><br>Prices look expensive on paper ($10+ for a sundae?) but are pretty worth it given the sheer size of what you get it's absolutely worth it. Large sundaes come in a cute clamshell bowl and are seriously the size of my face. Sundaes come with all the fixings - a gravy boat of sauce, whipped cream, nuts, the works. <br><br>Definitely worth a visit but beware the damage to your waistline.", "pics": null}}, {"review": {"des": "5 stars for the home made hot fudge.... BUT, I was destroyed when I stopped in late at night during the summer and a man was delivering stacks of Edy's ice cream on a dolly.  Destroyed I say.  VERY sad.  I'm from the SW side of Chicago and I don't get up there very often and I only had time to grab a jar of hot fudge to go.  I want to take my friends here in the near future to try the hot fudge, but it just totally sucks that it's not home made ice cream anymore.  Poor Margie is rolling in her grave!  :-(", "pics": null}}, {"review": {"des": "I luv there ice cream. Luv going there. Wish it was bigger. But great prices and great selection", "pics": null}}, {"review": {"des": "Margie's has amazing ice cream and sundaes. It's so rich and scrumptious. A classic root beer float I so good!<br><br>However, I'm going to dock major for service. It's always crowded- they have this huge unnecessary chocolate counter in the middle that needs to be knocked down as it just takes up space. We've waited over an hour for ice cream multiple summer nights so for that reason we have given up on Margie's.", "pics": null}}, {"review": {"des": "I've been to Margie's several times, but today was the first time I tried their Fudge Royal shake, which is made with bananas, hot fudge, and whip cream, outside of ice cream and milk. I had it without bananas as I am allergic to them. Regardless,  it was one of the best shakes I have EVER had. I asked them to blend it with the fudge, omg! It is a must try!", "pics": null}}, {"review": {"des": "Amazing ice cream but be warned the portions are huge.  You probably only need to order one sunday for every 2 or 3 people in your party.", "pics": null}}, {"review": {"des": "One of my favorite ice cream shops in the city. This place is very homey and feels old school is exactly where I wanted to eat and feel like a kid again. I love the feel of this place, it takes me back to my childhood, and brings upon that grin kids had on their faces when they got ice cream. <br><br>Perfect spot for families and dates. I came here with my cousin and we sat here got the banana split with hot chocolate on the side, caught up and enjoyed the ice cream which was very creamy and scrumptious. <br><br>I also ended up grabbing a watermelon rock lollipop on my way out and I ended up feeling like I was 12 again. <br><br>I got carried away from the food, that I almost forgot to mention the service. The service was also amazing, very sweet people.", "pics": null}}, {"review": {"des": "Margie's will forever be a classic!!! The staff is unbelievably sweet and their customer service is excellent. I just want to give a shoutout to the old man who always goes around serving water. He is definitely one of the faces at Margie's and his work ethic is excellent. I've had a conversation with him a couple of times and it amazes me. He definitely deserves more recognition at the work place. Other than that, amazing food and ice cream.", "pics": null}}, {"review": {"des": "I love Margie's. Great place to go out with family and friends if you're in the mood for a good time and dessert! It's usually packed anytime after 7 pm. The longest I've waited in line was probably an hour but worth the wait. I always seem to get the brownie a la mode which is just ice cream topped with some whip cream, nuts and a brownie. It usually comes with the vanilla wafers and chocolate sauce to drizzle over it. I love it and would always go back again or right now in the moment if I could. There's no going wrong when going to Margie's. I always walk away feeling happy.", "pics": null}}, {"review": {"des": "When you walk into Margie's, you feel like you're being taken back to a different era. A huge part of its charm lies in its history and old-school feel, as if you're entering a shop your grandparents frequented as kids.<br><br>While I think this is a place everyone in Chicago should visit at least once, I'm not sure I would come here regularly. To me, the appeal of eating ice cream is instant gratification; you order it and two minutes later you're eating it. At Margie's though, you'll likely have to wait for your ice cream, sometimes even up to an hour, and I'm just way too impatient for that! I'm also a sucker for super unique ice cream flavors, and Margie's generally sticks to the classics, so don't expect anything crazy like honey lavender or Thai iced tea. If you're craving a banana split or sundae with cookies and cream or mint chocolate chip, then Margie's is for you.", "pics": null}}, {"review": {"des": "I've been going to margies since I was a kid, and this was the first time I actually ate their amazing ice cream inside! It was a Sunday night and it was pretty slow then what I'm used too, which is why we were able to get seats. It's so cozy to chill with people and enjoying a sundae. I'll be coming back during the winter months (I hope I'm not the only one who eats ice cream during the winte", "pics": null}}, {"review": {"des": "The best turtle sundae on planet earth :))) Always delicious and prices are so reasonable for the huge portions!! It's a Chicago must!", "pics": null}}, {"review": {"des": "I've been coming here since I was a kid. I can remember Sunday's with my family after my dad's routine weekend store visits to the Brickyard to make a quick stop at KMart's deli, yup.. they had a deli back in the day and the usual stop at Sear's for what my father would call window shopping for new tools. After all that, we would make our way to Margie's and i would have a sundae. The fun memories I have there are priceless. Nevertheless, let's talk about my experience at this little ice cream shop that been around since the early 20's. <br><br>When you first walk in, please be aware that the place is tiny. I mean like, you will be making new friends whether you like it or not, but that doesn't stop the place from getting packed every weekend. The average wait on a winter weekend is about 40 minutes and double during the summer. Thankfully, they have outdoor seating during the warm months so you can get your frozen treats to go and just hang out in front. personally, I wish they would find a way to expand this location. Its very cramped inside and if you are looking for group seating, good luck.. not going to happen. The most you might be able to get in a booth is about 5 to 6 people. <br><br>Now, on the other hand, just as there is this tiny space that makes you feel like you're eating you homemade ice cream in an MRI machine. The quality of what they serve is well worth it. My new favorite ice cream treat has become the Coco Loco Sundae. This bad boy is made of coconut ice cream, with candied coconut shavings, peanuts, and served in their half shell bowls with a side of chocolate syrup and their signature vanilla wafer. <br><br>The prices are very reasonable, so if your almost broke from your date night, stop off here and you both can share a treat for under $10, I did. That's not saying that I'm cheap, just that it was nice to have been able to get a quality dessert and not have to pay a lot for a thimble of  cake. <br><br>Well, I hope this helped shed some like on this great nostalgic location that has been here before many of our grandparents. I hope you enjoy.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/I4WlHmygRgYeeB1bhMBrHQ/348s.jpg", "caption": "Banana nut sundae..."}]}}, {"review": {"des": "Pretty awesome old school candy shop, small seating areas but the desserts are fire and you get to pour your own chocolate sauce on the sundaes with a dish that looks like a genie lamp. Definitely coming back for a banana split", "pics": null}}, {"review": {"des": "I loved it.<br>Beware of the after dark drunk crowd on weekday evenings.  Plan ahead for a wait.", "pics": null}}, {"review": {"des": "I was excited to visit this place and grab ice cream of some sort since the weather has been so nice and warm; even thought it was a week day and near closing time, I was surprised by how packed the place was as they have limited inside seating and outdoor seating but still more than the other Margie's candies location near Ravenswood area. I enjoyed the turtle split which really reminds me of my favorite banana split and a turtle sundae! Service was quick and price was affordable for portion! Looking forward to trying other items off the menu!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/L9lkiX7HLyzeZo5wNmNRGA/168s.jpg", "caption": "The turtle split"}]}}, {"review": {"des": "Classic Chicago sweets, ice cream and also small plates. To die for. The best grill cheese. But it's the place you must go to in the summer! For anyone visiting the area you must stop by!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/4Xw0Qu11OcFmSOGyJZ__qQ/348s.jpg", "caption": "Raspberry split"}]}}, {"review": {"des": "Best chocolate malt at 11:30pm with a 6am flight the next morning, worth it! Hands down the beat malt. I wish I had time to shop the candy selection. They were a bit crowded since they were about to close and I couldn't see the case that well. Go here now!", "pics": null}}, {"review": {"des": "About as classic as you can get! Delicious and definitely the sugar rush you need! My favorite ice cream spot in the city! If youre visiting, this place is definitely worth a shot!", "pics": null}}, {"review": {"des": "Margie's is one of those places where Chicagoans look at you cross-eyed if you admit to having lived here for years and never been. So I finally made the hike and wow!<br><br>First off, apparently noon on a Sunday is the perfect time to come. It was basically empty. By the time I finished, there was a wait. <br><br>So, disclosures first: I love ice cream, but I'm a bit of a purist. Usually I'm not all about the fancy saucy and candies and whatever else. I just want you to make really good ice cream. Well... They do. At my Yelp forefather-and-mothers' insistence, I got the hot fudge sundae, although I substituted in cheesecake ice cream. (Probably my favorite single flavor ice cream in any store that offers it.) The ice cream was perfect: creamy with great flavor and genuinely mixing the sweetness and tartness that makes cheesecake ice cream great. And that hot fudge! That stuff was delicious. I'm a believer now. I also appreciate that they give it to you on the side so the newcomers like me can check it out BEFORE smothering their food in it. <br><br>Definitely worth the hype, and glad I went. Although for my waistline's sake hopefully I'll stay away for a while.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/mc5W3Gy-aZ3sdecWyaBK6g/168s.jpg", "caption": "Hot fudge sundae deliciousness, with wafer"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/qTikPrMXwWBxlyYlnuTo1w/168s.jpg", "caption": "Cute old timey jukebox at the table"}]}}, {"review": {"des": "I absolutely have no complaints about Margie's. I've always had short wait times, but I know it can get long in the summer, since the place is on the smaller side. However, it has that cool vintage diner feel which I love! <br><br>Their menu has a wide selection of sundaes, shakes, and even sandwiches. Their prices are great for the portions that they give. They even carry the \"world's largest sundae\" which is dozens of scoops. I've been here twice and gotten the chocolate mint sundae both times. It comes as a huge bowl of mint chocolate chip ice cream with a ton of whipped cream and a cherry on top. The bowl is large enough for 2-3 people to comfortably share. It also comes with wafers and a bowl of hot fudge. The fudge is sooooo rich and delicious and tastes like a melted brownie. For less than $10, this was a steal. <br><br>My favorite dessert place in Chicago! Would come here more often if it weren't out of the way.", "pics": null}}, {"review": {"des": "The staff here are so sweet. I always order the yogurt sundae with a strawberry shortcake on the side, and it never disappoints.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/EB9pfMrZwljBiLnnprcEDw/348s.jpg", "caption": "Yogurt sundae with a strawberry shortcake on the side."}]}}, {"review": {"des": "You can easily miss this place on western.  Walked in out of curiosity.  This place takes you back into the 70's.  The ice cream are reasonably priced.  The sundaes are delicious.  They have a kids menu too.  The booths are really tight and it's hard to get around the place.  <br><br>The people are friendly.", "pics": null}}, {"review": {"des": "It was a 15 min wait to be seated. Ordered a caramel banana split. You get to choose which 3 scoops of ice cream you want. It was really good, just how any banana split would taste though. Nothing extraordinary. It's not worth a wait longer than what I waited. This place is a hype. The seating is so cramped, which is hated because there were these 2 obnoxious little girls being very loud right next to us. I saw them make a brownie a la mode icecream and they just put a prepackaged single serve brownie into the icecream. There was a no name, probably dollar store peanut butter on the counter. Later I saw on the menu the peanut jelly sandwich for $5. Prices are too high for what it is.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/5GcvlFHRfNtmjFsGP0n5MQ/348s.jpg", "caption": "Caramel banana split"}]}}, {"review": {"des": "So happy I made the trek out to Margies! I am visiting Chicago from out of state and this was my last day in town. Before coming out I saw a FB post on best ice cream places and that's how I heard of this place. It lives up to the hype as far as flavor and experience in my opinion. I haven't had a sundae in years. This was really fun. I had one scoop of cookies and cream with whip cream, sprinkles and a cherry on top plus the wafer cookie and hot fudge on the side. Why not? It was great. Very smooth and creamy and not over frozen or too melty, just right. The look of the interior, you think you warped back in time to at least 1957 or so. I thought that was pretty cool. I took one star off because the floors are pretty groady. Really old carpeting that doesn't look like it gets swept often. Nit picking, it's great to check out. I highly recommend it.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/uP_Mjtpog_TJc9fC9ATs1Q/168s.jpg", "caption": "1 scoop sundae of cookies and cream with hot fudge on the side. Really good."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/7Qr4w9U-XzmKLvGXuIDZhA/168s.jpg", "caption": "Cool juke box at the table. I feel like I stepped back in time. It's cool :-)"}]}}, {"review": {"des": "Was in the Wicker Park/Logan Square area, so I decided to stop by Margie's Candies for some dessert! The interior of this restaurant is old Fashioned, with some booth style seating throughout the restaurant. The interior was pretty cramped and crowded when I went, so ordered To-Go. <br><br>I tried the Chocolate Mint Malt and the Fudge Atomic Sundae. The Chocolate Mint Malt had a pretty large serving size, and was really thick; the flavor itself was pretty good, but not mind blowingly special. The Fudge Atomic Sundae also had a pretty large serving size. It had 2 scoops of vanilla ice cream, chocolate and caramel sauce, whipped cream,and crushed peanuts on top. The Chocolate sauce was thick and hot, and it really added that special taste to the Sundae. Overall the Sundae was pretty simple, but it tasted really good!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/OnW8i7gR8uspXPMRPjWMcQ/168s.jpg", "caption": "Atomic Fudge Sundae"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/61jrtf8sHU2gDwXFPg2FqQ/168s.jpg", "caption": "Chocolate Mint Malt"}]}}, {"review": {"des": "This place is overrated!  I don't think they serve the best ice cream. I've had 3 flavors.  Pistachio, vanilla and pecan. 3 of them tasted exactly the same to me. Is like I order one flavor. Huge portions. Okay service.<br> <br> Pretty cool decor,  it takes you back to 60s life style and pretty small space too maybe that's why it gets packed, you see the lines and you think that's where they serve the best ice cream ever!", "pics": null}}, {"review": {"des": "Great ice cream. The best shakes. Worth the wait but does get very bidet during the warmer months.", "pics": null}}, {"review": {"des": "First time coming here....I was very excited hear good things about this dessert place. Have a lot of selection on their special, sundae, float, shake, and banana split. The portion are huge...I got a guy type split. I couldn't finish it. I would definitely recommend this place and would come back!", "pics": null}}, {"review": {"des": "The times I've gone, I never had to wait for a table so I guess I got lucky. That being said, I don't think I would have waited for there was a line here. It's good, but it's not that good.<br><br>I enjoy the good ol' banana split that they serve here and it's huge so definitely share it with at least two other people.<br><br>Flavors of ice cream that I like here are the cheesecake and strawberry. I would suggest avoiding pistachio flavor because it tasted a bit off to my friends and I, more minty than nutty.<br><br>They also serve food here but I mainly go for their desserts. Their milkshakes are pretty darn good, too.<br><br>Portions are huge overall in anything that you order. They have some crazy creations for people who have big sweet tooth so try them if you dare!<br><br>This is a cute date place because it's so retro and it seems like a scene out of the 70s/80s diner type date.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/V_pFwYJNXiBb-QDdd4GRZw/348s.jpg", "caption": "Yummy desserts"}]}}, {"review": {"des": "SO good! The sundaes and ice cream here is seriously delicious and I am very glad I got a chance to try it while I was in Chicago! I got the banana split with caramel and fudge sauce (turtle split) and it was YUM. It's a large portion and the prices are reasonable! The store itself is tiny and cramped, and you should expect to wait for a table, but even on a cold rainy day the wait was worth it. I'll definitely be back for another sundae next time I'm in Chicago.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/e4_w8zvqH3cqgdjuRJN_JQ/168s.jpg", "caption": "Turtle banana split"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/SLhGljm4JwfQMykrxuBuEg/168s.jpg", "caption": "Yummmm"}]}}, {"review": {"des": "This place is as old school as it gets!! Love, love, love this place! There is street parking but it's also accessible via the blue line. Usually there is a large crowd outside waiting to get inside or that is waiting for their order. If you come here on weekend nights, be aware, you will not get seated right away! I came here on a Thursday night around 9:30 and it was poppin'! I barely found a place to sit inside. This place really takes you back to a time when people had greater appreciation for mom and pop ice cream parlors. The parlors where couples would come after a track meet or football game for some old fashion ice cream and bonding. They even have those old school boom boxes at each table (they don't work) and those old school couches where you just basically sink into it once you have a seat. I mean, it's really cute! I love anything old and \"take me back\" so I felt right at home. As you can tell by now, the atmosphere is heartwarming and sincere, it takes you back to the 80's-90's. The walls of the place are filled with old memorabilia. As for the ice cream- nothing beats homemade! I ordered the banana split with a scoop of chocolate, strawberry and pistachio (for my friend). I don't like pistachio flavored ice cream so I was not ranting and raving about this flavor but I really did love the strawberries and chocolate! It was SO good! Especially with the whip cream and self- served fudge to the side! I really loved that they did not pour out the fudge themselves and this way, to each its own! The texture of the ice cream was delicious, it was churned just the right amount and it was creamy as well. I was saddened as I was approaching the last bites. I would go back in a heartbeat! They do accept credit cards and cash. Their prices are reasonable. A banana split big enough for two people was less than $8.00. They also have homemade chocolates available but I haven't tried them! I would highly recommend this place to anyone!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/zWs9QUWYVRlhIav-DylR1A/348s.jpg", "caption": "Banana split"}]}}, {"review": {"des": "Down with pretentious and weird off-the-wall flavors and meet the classic \"we focus on simplicity and what we do best.\"  <br><br>It's clearly evident that the focus is strictly  on the ice cream when you walk in.  The decor hasn't changed since the dinosaur ages and probably has not been dusted since the Great Depression.  Owners also haven't adjusted the prices with inflation because the portions here are large and cheap.<br><br>Tips:<br><br>-there will be a wait<br>-no parking (I'm obviously not from Chicago and am not used to bikes and public transit)<br>-prepare for teleportation <br>-bring your inhaler if your an asthmatic<br>-have an extra pair of socks because they will be knocked off!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/9fu80sqKARQtPtPTwaQz6Q/348s.jpg", "caption": "The place to be on a Saturday night"}]}}, {"review": {"des": "This old timey candy and ice cream parlor is small, but has a lot of charm. While you may wait a while for a table (especially in the summer) the ice cream creations are worth it! They are delicious and the staff is very nice. It's also a great date spot to chat and share a sundae.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/n8MN_aE_2gOG0Yxz7arxxQ/348s.jpg", "caption": "Turtle sundae with vanilla and mint chocolate chip ice cream!"}]}}, {"review": {"des": "Stopped here after seeing the commercial on tv my stopped here to get a banana split for my husband and a ice cream sundae for me.  <br>I will say it was delicious <br>The place is small in a sketchy part of the city we were lucky to find parking right in front <br>The service was great nice crew was working I would definitely say I would have eaten the entire store if I could. The chocolate was out of this world good", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/QiKlUrX2Jd5Hf2d6wwpIOQ/168s.jpg", "caption": "Jukebox"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/tI2CkGBftJWlTW_bQc6gXQ/168s.jpg", "caption": "His Banana Split. Hers Turtle Sundae"}]}}, {"review": {"des": "Wow! I'm dumbfounded! What business does NOT sell gift certificates online or over the phone? I contacted Margie's on Western Avenue, asked to purchase and a gift certificate, offered to pay for the stamp to put it in the mail and was told that I would have to come in. Seriously? Gift certificates are an easy and inexpensive profit source. Heck, most of the time the certificates don't get used! <br><br>Oh...if the staff person and manager had been pleasant about it maybe I wouldn't be so passionate. However, they weren't. There are other places to send my ice cream loving father!", "pics": null}}, {"review": {"des": "Huge ice cream portions topped to the nines at completely reasonable prices for the creation set in front of you<br><br>Margie's is an [mostly] ice cream shop set on the corner of Western & Armitage in Logan Square. The array of ice cream selections just blew my mind! Simple sundaes to 35 scoop $60 sundaes and everything in between. This isn't Baskin Robbins so they have just 16 flavors on the docket, but c'mon that's just plenty. Aside from tons of cool ice cream concoctions, they had many chocolates in many forms for grab & go purchasing.<br><br>I had the Chocolate Mint Sundae for $7.95 which looked like it had several scoops of mint chocolate chip ice cream in a dish. Next to that was a big cream saucer of chocolate syrup. I'm a chocolate monster so this suited my fancy just fine. It was mouthwateringly delicious and I indulged in way more than I should have! My bestie had a chocolate malt shake ($5.25) which again was huge and very tasty though I thought could have used just a little extra oomph to it.<br><br>Margie's gets super busy and there isn't much space inside. I have visions in my mind of shuffling some things around (like removing the giant center station) and adding in more tables which of course would equal more business. But it is what it is right now and you may need to wait for a table before inhaling your desserts. They do have some seats set up outside if you prefer to take your goodies to go.<br><br>Overall, a nice stop when your sweet tooth won't let it's craving subside. Good service, good prices and huge ice cream dishes!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/-9jjgM73sZUq43l4lr6w0A/168s.jpg", "caption": "Sign on the wall"}]}}, {"review": {"des": "I love this place. I don't care how old it is and how non extravagant the ice cream is! Their ice cream is rich and creamy and I looooove their hot fudge. I could drink it with a straw! Love coming here even on a cold night. Prepare to wait in lines during the summer but so totally worth sharing the experience with friends or family!", "pics": null}}, {"review": {"des": "The ONLY reason I'm giving this awesome place 4 stars instead of 5 is because its size. When you walk inside, it's so busy and there so little room to move that it makes the experience very uncomfortable. I was constantly thinking I was going to elbow someone in the face or step on their toes? But, the simple fact is that Margies Candies is so well renowned for their candy products that it's worth dealing with the stress. Their candies are OUT OF THIS WORLD DELICIOUS and I ALWAYS recommend them to all going to Chicago for a visit.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/_-O3OrxKjAawYGYwxLGCtA/168s.jpg", "caption": "Turtles for my lady:)"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/zjRFmGkIQfjc1wnlfggIOw/168s.jpg", "caption": "The outside looks deceivingly large:)"}]}}, {"review": {"des": "I don't always eat ice cream. But when I do, it's at this place. Margie's Candies is an old school ice cream parlor with great atmosphere. The interior has a nice vintage feeling, and they even have a little collection of The Beatles memorabilia. <br><br>The actual ice cream is of very high quality. Both the banana splits and the sundaes are excellent. <br><br>Margie's Candies is also quite inexpensive. You get a lot of ice cream for your money. Maybe even too much. <br><br>Depending on when you go, you might end up waiting for quite a while before getting a table. When it's crowded, it can also take a bit of time to get served.", "pics": null}}, {"review": {"des": "Everyone talked this place up and I did not find it special at all. The ice cream was no better than what you get in the store and they do not put a lot of toppings on your sundaes. It's cramped and not worth waiting in the long lines I see it has - luckily, I did not have to wait in it when I went.", "pics": null}}, {"review": {"des": "Very disappointed.. The place was tiny, cramped, and crowded.. people kept bumping into each other.  We sat in a booth, and waited for our ice cream.  The waiter was not friendly at all.  A woman took my ice cream dish before I was even done eating and didn't even ask me.  Also not even two seconds after the woman took the dish away, the waiter asked if we were done because other people were waiting.  How rude and tasteless. Needless to say he didn't get a tip.  As for the ice cream itself, we ordered the jumbo turtle pecan sundae, with two scoops of praline (which literally had NO pralines, and was tasteless) and one scoop of strawberry.  I don't understand what the hype is.  I've had WAY better ice cream from Oberweis and Baskin Robbins.  I'll never go back to Margie's because it wasn't even worth it.", "pics": null}}, {"review": {"des": "They no longer serve home made ice cream! That was the only reason I ever came here. Now they get bucket ice cream delivered which they told me tasted just like their old home made ice cream (it absolutely did not). Was very disappointed. Not worth the parking hassle, waiting hassle, and inconvenient seating/service to eat bucket ice cream with defrosted fruit. Bring back homemade ice cream!! Stop being lazy and taking your life customers for granted!", "pics": null}}, {"review": {"des": "Best sundaes everrrrr. The hot fudge is to die for. I wish the menu was simpler.. It's relatively cheap and HUGE! The menu basically has the same sundae written 5 different times with 1 variation. Make your life easier and just tell the waitress what you want on your ice cream.<br><br>I wasn't a huge fan of the chocolate/candies though.. Stick to the ice cream!<br><br>Also, there's almost always a wait. Even in 30 degree weather in the middle of winter. Completely worth it though!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/oWGtLA5wkkUfp0lA0HQhDQ/348s.jpg", "caption": "Jumbo hot fudge"}]}}, {"review": {"des": "This is a nice oldies resturant serving only ice cream, especially banana split, they have different kinds of banana split. Although the restaurant is old, it has its character and kinds cosy. It's full every time we visit them.", "pics": null}}, {"review": {"des": "This is the best hot fudge sundae in the world. They don't make places like this anymore.", "pics": null}}, {"review": {"des": "The ice cream is great for the price and the scoops are really big. They have a lot to offer. The place is a bit small so you have to wait a sometimes, but the wait is always worth it.", "pics": null}}, {"review": {"des": "Went back to Margie's Candies for a 2nd visit, who can resist? This time on empty stomachs so, we scarfed up every last bite of our sundaes. If you have not been to Margie's you gotta stop. The menu is rather large, though many of the sundaes are very similar. My go to fav is the mint choc chip ice cream with marshmallow topping and HOT fudge sauce on the side.<br>Service was quick and fast, we stopped by during mid-afternoon and got a table right away. If you have friends or relatives visiting Chicago, this is a stop you want to make. Street parking is available, just look for the green box to pay or you'll get a ticket :(", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/m2wIZGRqcj5rUnck-jAcCw/348s.jpg", "caption": "Yummy, tasty sundaes, try them all!"}]}}, {"review": {"des": "Service is long but mostly worth it. Take up to 25minutes for a table because the place is so small. Enjoy the ice cream here just wished the people gave less attitude", "pics": null}}, {"review": {"des": "I am such a dessert fanatic!!!! Margie's really blew me away. We had the Caramel Apple Cobbler and the Pina Colada Sundae. My favorite hands down was the Caramel Apple Cobbler. Gooey Caramel, ice cream, over a warm apple pie! I also must note the prices are really really reasonable for what you get. There are also containers full of different candies and caramel apples. <br><br>The seating area is diner style. About six booths. The service was great and parking was easy to find. I will be back! :)", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/zIRsPKkpMEbJVfq6duXxUw/168s.jpg", "caption": "Piña Colada Sundae"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/4BJJ1VVnfHtz_88Af38NfQ/168s.jpg", "caption": "Apple Cobbler Sundae"}]}}, {"review": {"des": "If you want that old-school, straight-to-the-damn point kind of ice cream...Margie's is where it's at. <br><br>The locations are small and it can definitely get busy so depending on what time you arrive, anticipate you may have to wait for a table. Seems like the to-go orders are fast, however! <br><br>The staff is nice. Amidst how stressful and busy things can be, they still seem pretty patient and do a great job keeping things in order. <br><br>Their menu is filled with different kinds of sundaes, malts, milkshakes, creations, simple ice cream scoops, etc. ANYTHING WITH THEIR HOT FUDGE IS A YES FOR ME. <br><br>I wish I lived closer. Though, that would be dangerous because I'd be here every day. I'd  definitely recommend anyone visiting Chicago to come through and indulge in some yummy ice cream and goodies at Margie's!", "pics": null}}, {"review": {"des": "Love coming here, I usually order the Turtle Split or Brownie one (forgot name). It is always worth the wait, service is quick and servers are nice. Make sure to come hungry or ready to share! The store is small and retro which makes it unique.", "pics": null}}, {"review": {"des": "Terrible service<br><br>Seriously terrible service.<br><br>What I don't understand is, if I go in at 11:30, why they are open until midnight if they can't clearly state that they aren't going to serve food past a certain time.<br><br>Because of this, because they can't set the right expectation, certain people can't eat.<br><br>Just don't go in expecting to eat unless you get there before 11:15pm.  That's all.<br><br>Good ice cream I guess.", "pics": null}}, {"review": {"des": "So I've been coming here since I was a little girl my grandmother knew the owners and haven't been back in like 3 years and sad to say I was so disappointed with their customer service! The kid that waited on my husband and I just had the demeanor that he didn't care and didn't want to be there, sat us down brought my husband a glass of water said he would be back with mine never did! Then when served our ice cream which is always great tasting we ordered sundaes I noticed it didn't have any nuts so I asked him and he said \"oh we don't have any\" didn't even mention that in the beginning when we ordered our sundaes and told him what we wanted on them! He acted like he didn't care at all! I don't think I'll be back to this location...", "pics": null}}, {"review": {"des": "I could not have had a better experience with my first visit to Margie's. Anytime I had driven past this place there was a line that seemed to extend outside. When my companion and I came here on a random weekday we found parking immediately and got seated as soon as we walked in. Talk about lucky timing! <br><br>The place is pretty small and we sat down at a booth; inside there is tons of stuff to take a gander at and each table has it's very own out of service jukebox; in all honesty that semi broke my heart because that would have been a nice treat, listening to some music while downing a sundae. <br><br>I can't exactly remember what I ordered but it was some type of strawberry fudge sundae. I went with french vanilla and cookies n' cream ice cream, which were both amazing. The sundae was huge and the only bad moment was not being able to make room for the wafer cookie that came with it. <br><br>Just to add this, their hot fudge is something I still have dreams about. Such a fun experience.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/2yOYZTOdb7Uv07ljg9fbqw/168s.jpg", "caption": "Yuuuumm"}]}}, {"review": {"des": "Margie's Candies has been a staple in Chicago since the 1920's ... Homemade ice cream and candies, what could better?!<br><br>But onto my experience... We went for some much needed dessert after having dinner with my husband, daughter and a really good friend - it was our friend's first time there - on a Saturday night. <br>If you've never been to Margie's, be prepared to wait... But it will be so worth it.<br>We waited about 40 minutes inside of the restaurant because it was too cold to wait outside - they do have outside seating in the warmer months, which is great for taking your desserts to go.<br><br>The waiting inside will be cramped because they have limited seating and limited standing room as well. <br>The seating, when you are finally able to sit, is very cramped - so make sure that you like the people you are going with. LOL!! <br><br>The place only has one waitress so be prepared to wait a little bit for your dessert (or food) since she's the only one working the whole floor. She's been working there for 9 years and enjoys the craziness of the crowds.<br><br>All in all... our sundaes were amazing. And our little one loves being able to order her own sundae.<br><br>Cannot wait to go back in the summer... And continue making memories with our family.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/5qoNuqTmlf_mvMpLqIEr4Q/348s.jpg", "caption": "Yum... Giant ice cream!"}]}}, {"review": {"des": "Margie's is the place for huge, awesome, in your face, old-fashioned ice cream desserts.  Definitely big enough to share!!  I heard they have nice candies, too- I have yet to try!  Be prepared to wait, as the lines can get long!", "pics": null}}, {"review": {"des": "Time capsule ice cream shop and chocolate candy with a limited menu. The ice cream is the star here, delicious carmel sundae and banana splits. It gets crowded and the place itself is a maze of booths. Worth a visit.", "pics": null}}, {"review": {"des": "I've never had to wait for a table, but Margie's is rather small, so be ready for it if you have a group. <br><br>It's a fun, old timey (think 80s) diner for chocolate, ice cream sundaes, and floats, although they serve food too. Really large portions, so it makes sense that big groups come in (and hence, the wait time that people complain about).<br><br>Atmosphere is everything you could ask for in a date-spot.", "pics": null}}, {"review": {"des": "Tiny, old school. Margie's is where you go for old fashioned ice cream. A whole page of banana splits! I had a praline sundae with fruit (the only serious negative -- tinned fruit is a little too old school for me) and my ice cream companion had the brownie sundae. He made a perfect choice, but he deserved it after getting a personal best at the triathlon that day.<br><br>The prices are great (the candy they sell is priced like 20 years ago!)<br><br>I wish I'd known about Margie's before. Sometimes you want real ice cream!", "pics": null}}, {"review": {"des": "Great place to eat some delicious desserts. If you have a big sweet tooth like mine you definitely would want to come here", "pics": null}}, {"review": {"des": "i've been back in Chicago a couple of years and never had been to Margie's. decided to go with my bf today. they were pretty busy at 3pm on a Friday, but we grabbed a two person table in an awkward spot. <br>as for atmosphere, it's about 62 out today and i found the restaurant insanely hot. too many people in the shop waiting for tables even though employees asked them to step outside. i noticed that the \"cooks\" weren't wearing hair nets (more bothered with the lady with very long hair to be honest). restaurant has been there for a long time and it hasn't been modernized (cute, but it looks very run down and dusty). <br><br>took about 15 minutes to get someone to take our order. waitress was friendly enough. we got our sundaes quite quickly. i ordered a turtle sundae, very good (and very rich with all the hot fudge and caramel - YUM!)<br><br>i took a look at the handmade candies, not impressed (i am used to See's Candies). was happy to see they sell rock candy though. <br><br>i give them a 7 out of 10.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/JDgVei5ezXBhXxx6MNUCcg/348s.jpg", "caption": "two scoop turtle sundae (vanilla ic cream, caramel, hot fudge, whipped cream, peanuts & maraschino cherry). $6"}]}}, {"review": {"des": "Hot fudge!! YUMMI!!!!!!! Home made. Ice cream however comes from WI,but still good.  I ordered turtle Sunday which was very good, except I would like it to have more nuts :)<br>Please come early, this place even on Monday night was PACKED! Had to wait for a table over 20 min.<br>Check this place out and get turtle candies to go!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/EsxOCcyi98dyoCQp9zq8AA/348s.jpg", "caption": "Oreo cookie shake"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/L8OkdGu3xRldaXnjx8s33w/168s.jpg", "caption": "Cappuccino milk shake"}]}}, {"review": {"des": "Cool, little throwback to what a date might be like generations ago. The brownie a la mode was tasty and the experience was great overall. To everyone who visits this place, some advice: be courteous to the staff!! They're working hard to serve YOU so be considerate and don't block the walkways (it's a tight fit, I get it, but make room for the people that need to bus tables, take orders, etc) and for the love of god, tip!!!! Look beyond your privileged selves and show some love to the people who wait on you! That's it, rant over.  End transmission.", "pics": null}}, {"review": {"des": "How did it take this long for me to know about this place? This is a small diner in the middle of Western, Armitage and Milwaukee. The sign on the wall said it's been open for 95 years. They do what they know. They know ice cream and they do a phenomenal job. I got the brownie a la mode and the people I was with got a peach cobbler and a traditional sundae. We all enjoyed our choices thoroughly. Things you need to know: it's super small and you will have to wait for seating. The staff is not friendly (I guess they don't really need to be, customers are still coming). Pricing is high but the portions are enormous so it evens out. I would definitely recommend this place for any sweet tooth's out there", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/N0mgZsdzoQXpiqOAvtzIaw/348s.jpg", "caption": "Brownie sundae"}]}}, {"review": {"des": "Old rustic diner looking location. Their known for the their ginormous desserts with all sorts of interesting flavors.<br><br>The banana split comes in a huge shell with three flavors of your choice of ice cream. Pistacchio has by far the weirdest-non traditional taste to it, sort of mint like. Cheesecake is more cheesy than sweet. Lastly strawberry shortcake went great with the bananas and whip cream. On the side they provided wafers and a hot fudge which was really clunky in dressing the banana split.<br><br>Also got the cherry jubilee with additional 3 flavors of our choice, my favorite had to be coffee, then the praline. It was also topped with lots of maraschino cherries which i could eat all day.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/X4Mo44R4qNOhPRqodep2rA/348s.jpg", "caption": "Banana split with not so hot duge and wafers on the side"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/TOu10W6Xd48w6IPCNORzgw/168s.jpg", "caption": "Cherry jubilee, with NUTSSSSS"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/p3wbfL23aeVIjqknxEx3Vg/168s.jpg", "caption": "Cool record player"}]}}, {"review": {"des": "Some of the best sundae I have ever had until this day. <br>There could be a little wait for a table, but it is worth it. <br>There are many varieties to choose from.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/o3RCFUAaGdVl6pUO5-aI8w/348s.jpg", "caption": "Vanilla Fudge and Banana Sundae"}]}}, {"review": {"des": "Visited it after a friend's recommendation.  It is not centrally located in the currently popular wicker park area and so wouldn't have found this place had it not been for the recommendation.  A group size of 2 helped in getting seats quickly as other groups had to wait longer.  Place is smaller but it has this strange old golden feel about it that you would want to check out.  Ice creams were good.  We loved the brownie/fudge we added as a side and vanilla flavor was strong and nice.  I would recommend this place for a cozy ice cream evening but I'd suggest going in with a very small group.  Prices are a steal for the quality they offer.", "pics": null}}, {"review": {"des": "Margie's is a Chicago classic. A fun place to bring your tourist friends and a nice pick me up for a dreary Saturday afternoon. Be prepared for a wait in a tight squeezed blast from the past shoppe. Last night, the sweet spot was ran by a total of six people. One hostess, one bus boy, one washer, one waitress, and two scoopers/mixers. They were working hard and quickly. With demand high and moral low, this iconic location could be the Icecream daydream that it once perhaps was--for everyone. Perhaps investing in a reservation app where you can get texted your time would have a positive outcome.", "pics": null}}, {"review": {"des": "I'm so disappointed by this ice cream parlor. The service is average, you just do not feel welcome. The place will definitely need some TLC soon, worn-out booths, old dolls on shelves, dirty tables...it lacks spirit<br>The ice cream tastes okay and to be fair you have what you pay for.<br><br>If you visit Chicago for a few days only, do not loose time by coming here.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/9I_vRANSkVp3wqV2DG2_VQ/348s.jpg", "caption": "Ready for banana split"}]}}]}