{"name": "marios-italian-lemonade-chicago", "reviews": [{"review": {"des": "Being from California, the only Italian Ice experience I have is with Rita's Italian Ice. My boyfriend, from Chicago, has always refused to go to Rita's. Now I understand why. <br><br>Holy. Sh*t. This is mindblowingly good. Chunks of fruit and lemon in your ice. <br><br>We came on a mildly warm day in July and luckily avoided a long line. We've tried to come to Mario's on every trip back to Chicago, each time missing their closing/opening date by days. We FINALLY got lucky and they were open. <br><br>Don't be fooled by the little shack looking shop - it's seriously the best, most refreshing snack on a hot Chicago summer day. If we weren't staying in the 'burbs...I would have asked to come back every day for the rest of our trip. My only regret is getting only a medium....", "pics": null}}, {"review": {"des": "I've eaten other Italian Lemonades and they don't stand up to Mario's. Back in the day when I went to UIC and lived in the hood I would go to Al's Beef along with their fries then cross Taylor street and get a lemonade. From Mario's.  <br><br>They have great lemonade with chunks of real fruit inside.  One of my favorites was the peach lemonade.  <br><br>I guess I'm not getting any younger because Skippy was dating Maria at the time back when Mario was still in command of the lemonade stand.  I guess Skippy & Maria (next man & woman up) the next generation up to take over the lemonade stand.<br><br>Because iced lemonade is seasonal I remember waiting for them to open in the spring and the inevitable closing as the weather started getting colder.  Great iced lemonade in Da Old Eyetalian Neighborhood right by University of Illinois in Chicago.", "pics": null}}, {"review": {"des": "The perfect summer treat! The place has been around since 1954, so Mario's is basically synonymous with Chicago tradition at this point. <br><br>Lemon and watermelon are the most popular flavors. I had the mango frozen lemonade on my last visit because it was only available for a limited time only, and I'm a sucker for those kinds of things, but it was also very good - big chunks of mango! <br><br>FYI, the place is cash only, so make sure to bring those dolla dolla bills.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/OAaD27mHc9l0fkKkMf8yhw/348s.jpg", "caption": "Mango Frozen Lemonade"}]}}, {"review": {"des": "Honestly, there is not much better than Mario's on a hot summer day. Real ingredients! So refreshing! The line always moves quickly so don't worry if it looks like a long line. Lemon is classic and has real lemon in it- you'll find lemon rind in your cup! If you get a size larger than small you can combine flavors. I love half lemon and half cantaloupe. So good!<br>As you see in my pic, it's good on a gloomy rainy day too lol. And then there's no line", "pics": null}}, {"review": {"des": "A Chicago institution for a reason.  One of a kind, absolutely delicious.  Especially on a hot day.  They didn't have the peach when I went, so I opted for the watermelon and it was perfect.  Friendly service, you really cannot go wrong here.  Spectacular.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/lpGGSP9d1C8Po_ZscGr93A/348s.jpg", "caption": "Watermelon Italian ice"}]}}, {"review": {"des": "Delicious and affordable. Great selection of different flavors like pomegranate (really delicious!) Only downside is their cash only policy. Other than that, great lemonade!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/rh_rbwlaZg6VKTiMU3MvNA/348s.jpg", "caption": "Open late!"}]}}, {"review": {"des": "Mario's has been a Chicago staple since I can remember. As a kid it would be such a treat when my parents would take us. And its so amazing that the business continues to keep its traditional italian ice top notch for all these decades. <br><br>They always have all the flavors available. My two personal favs are cantaloupe and strawberry. Don't be scared to ask for half/half when you can't make up your mind. <br><br>The best thing is that they are open late for late night sugar cravings and they also have to go options in large containers. <br><br>Don't forget the cash because they don't take cards!", "pics": null}}, {"review": {"des": "Bruno Mars loves this place.<br><br>I can prove it.<br><br>Here is his song, \"Mario's.\"<br><a href=\"/redir?url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3D9xdyRsGOl6U&s=4e2d5e237b8e0d9ced22c15f8b98eb0b8d4fc27ee63b79522b45603c294e305c\" target=\"_blank\" rel=\"nofollow\">youtube.com/watch?v=9xdy…</a><br><br>It's a beautiful night,<br>We're looking for something yummm to do<br>Hey baby, I think I wanna Mario's<br>Is it something in the ice, or is it the flavoured juice<br>Who cares baby, I think I wanna Mario's<br><br>Well I know this little ice place on the Taylor St<br>We can go, no one will know<br>Oh c'mon girl, who cares if we get fat<br>Got a pocket full of cash we can blow<br>(Although, it's only a couple dollars you know)<br>Shots of Pina Colada Italian Ice<br>And it's on my shirt girl<br><br>Don't say small small small small small<br>Just say large large large large large<br>And we'll share share share share share<br>If you're ready, like I'm ready<br><br>It's a beautiful night,<br>We're looking for something yummm to do<br>Hey baby, I think I wanna Mario's<br>Is it something in the ice, or is it the flavoured juice<br>Who cares baby, I think I wanna Mario's<br><br>What to get: Lemon Ice and whatever else you fancy<br>What not to get: Jack Lemmon as a client, if you escort<br>Why not: I can't tell you, I signed a non-disclosure agreement<br>Really?: Yeah, but ask Michael Douglas and Demi Moore<br>Why?: They did not sign a non-Disclosure agreement<br><br>(But they should have)<br><br>I feel bad for Luigi. Mario totally dumped him and went into business for himself (probably at the behest of Princess Toadstool that b**ch he should have let Bowser the King of the Koopas have her the wench), opening up this Italian Ice shop.<br><br>Last time I came to Luigi's... I mean Mario's...  the girl was super nice until she got a $1 tip. At which point she lost interest in me completely. Same thing happens at strip clubs. <br><br>But prior to my tipping her, she assured me that I should stick with my beloved lemon, and oh my goddess I forgot how amazing it is. No wonder I consider this the best Italian ice in the country because it really is. Yes. I said. In. The. Country.<br><br>It has lemon chunks in it. The rind, too. What more do you need to know? Well, it tastes absolutely heavenly. My favourite. So there.<br><br>I've been coming here for Italian ice for a very very long time. When I first heard that Chicago had a lot of these water ice stands, and that they were good, I tried pretty much all of them in a short space of time (but not like, 2 minutes short, I'll leave that sort of thing for your boyfriend).<br><br>Mario's was the absolute best and others are not even close (just like you weren't close with your aforementioned boyfriend). It was the best by a long distance. Absolutely incredible and possibly the best in the country. Probably. OK definitely.<br><br>Every time I've gone back since, I have thought similarly. It is as good as the stuff in Philadelphia if not better (Pop's, Italiano's, Dati's). This is the only place in Chicago I would get Water Ice or Italian Ice on a regular basis.<br><br>I'm actually thinking of buying a Kart so I can get here any time I want, even when the streets are too snowy to drive. I'll call it my Super Mario's Kart.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/6k0OdGWmGneWmRuc-h-lJg/348s.jpg", "caption": "You call that little? I'll show you something berry berry little. (Pulls down pants)"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/HzTo4e59mFpHVhdcKd1UXw/168s.jpg", "caption": "One of the true hidden gems of Chicago. Oh wait did I say hidden."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/XBZwqtZ6VDXHCBRp6HRMrw/168s.jpg", "caption": "Somebody is enjoying their Italian Lemonade"}]}}, {"review": {"des": "Was introduced to this place last year. It's the perfect cold treat one could wish for that no other smoothie or ice-cream would fulfill. <br><br>It's a small booth place, where the lines go all along the block..esp on a hot summer afternoon but don't let that mislead your footsteps since the line usually moves very quick. <br><br>Flavor wise so far I've tried the lemon ice, pomegranate and of course the watermelon. I'd say my favorite is the watermelon and is so is of many others. It has the perfect fresh sweetness and chunks of watermelon in it. <br><br>The large size is a monster so I always go with the medium. It's delicious whichever way you prefer.<br><br>Only cash.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/hHXQV8EiSfOPdxT1ciz9Mw/348s.jpg", "caption": "Medium watermelon ice"}]}}, {"review": {"des": "They use fresh fruit to make it and most flavours are great! Do remember to carry cash as they do not accept credit/debit cards", "pics": null}}, {"review": {"des": "This is another family favorite. I don't remember a summer without a stop at Mario's. My kids now love it! Prices are not bad and the Italian lemonade is just right! Lines get really long on hot days.", "pics": null}}, {"review": {"des": "This place is a hidden gem. The shop is very small with no seating area. They have decent amount of flavors to choose from, you can get more than one flavor if you get size medium and up. The Italian ice has a slushy consistency, contains real fruit. I love how it's not overly sweet, very light and fresh. <br>It's a great place to stop by if you are in the area, but not enough to be your main destination.", "pics": null}}, {"review": {"des": "Definitely had good timing, because when we got there we were serviced immediately we turned around and the line was done the block. Yes, down the block! The mango is my favorite and my go to and if the line was wrapped around the damn corner I'd wait in. How I wish summer was all year 'round.", "pics": null}}, {"review": {"des": "Love coming here for some Italian ice! The ice tastes really fresh and portions are very generous. They are pretty awesome here in general. They are friendly and efficient. Pricing is not bad at all. This place is at a perfect location. Plan to come have a meal and stop for an Italian ice. There are so many nice places for food within walking distance. I always look forward to come here.", "pics": null}}, {"review": {"des": "The pride of Little Italy, Mario's is seasonal but well worth the wait.<br><br>On hot days there's a long line but just wait it out and get that LARGE WATERMELON Italian ice. Thank me later.", "pics": null}}, {"review": {"des": "Mango and strawberry is veryyyyyy delicious!!!! It's always fresh and never feels fake syrup flavors, made with fresh fruit!!", "pics": null}}, {"review": {"des": "Perhaps Chicago's best-known Italian ice stand, Mario's definitely serves summertime treats that folks are willing to wait in line for. If you like pulp, this might be the spot for you.", "pics": null}}, {"review": {"des": "We have been coming to Mario's Italian lemonade stand for many, many years. <br><br>It's actually flavored ice in a cup!<br><br>They have been in the same location since 1954, and it's still the best place to go for Italian Ice in Chicago.<br><br>They are only open from late spring to early fall, so make sure you visit when you can.<br><br>They have about a dozen different flavors, and some of our favorites are cantaloupe, watermelon and pomegranate. Try a combination of two flavors like cantaloupe and watermelon or pomegranate and watermelon, you will not be disappointed.<br><br>It's cash only, so be prepared the prices are $2 for a small $3 for a medium $4 for a large and $5 for an extra large.<br><br>On a hot summer day there's really long lines, but they usually have three to four young people working there and the lines move quickly.<br><br>It's a Chicago tradition and I highly recommend you try it!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/JpXiQB5Ay8RQU4ABcKwU8g/168s.jpg", "caption": "Cantaloupe and watermelon"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/gjur2nEMfPgh69pnxkmiSg/168s.jpg", "caption": "Pomegranate and watermelon"}]}}, {"review": {"des": "Yum! What a nice treat on a hot day. The fresh lemonade slush has the perfect balance of tart and sweet. You can taste the fruity flavor (of your choosing) and the lemon. There are real pieces of lemon peel throughout the slush. For sizes medium and up you can pick two flavors. There will probably be a line, but it moves fairly quickly!", "pics": null}}, {"review": {"des": "I heard this place is always busy with lines down the block so I got lucky with only 3 people ahead of me on a Friday evening. My main purpose that night was to go to Al's across the street but someone on Facebook said don't forget to check out Mario's. I'm sure glad I stopped by. Ordered the watermelon Italian Ice and was blown away. Best I've ever had. It is cash only. There is pieces of watermelon and seeds in the Italian Ice. Definitely going back.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/G2xxoucFmtUxQ2cR-n2PlA/168s.jpg", "caption": "Guess it was a down time."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/uxqyScXnBVhlGRVp8oBVug/168s.jpg", "caption": "Watermelon Italian Ice. You can see the seeds. Amazing."}]}}, {"review": {"des": "Weve heard so many great things about this place so we finally made the decision to go. We waited in line for a while only to be told they only take cash.   There were no signs indicating they were cash only.   We were pretty bummed- we waited so long to walk away with nothing.  <br><br>Suggestion:  put up a sign that says Cash Only!", "pics": null}}, {"review": {"des": "I hate to be that one outlier that disagrees with the majority, but Mario's Italian Lemonade simply isn't my cup of water...or should I say, my cup of ice...that get's watered down very quickly.  As a fair warning, when I want dessert of any kind - I want chocolate, and I don't want tartness.  If there's one word to describe how Mario's tastes on my pallet, it's 'tart'.  Prior to coming to Mario's before the most recent time, I had been there once and at that time I had gotten to try a few flavors, but none were good enough to make me want more.<br><br>It just so happened that my fiancé and I were wandering down the road after having just dined in at a not-so-good restaurant, so our luck wasn't so hot on this particular day.  We decided that since we hadn't had dessert and since it was a hot day outside, we would stop off at Mario's.  My fiancé had never tried it before and therefore I let him choose the flavor - he opted for pina colada, which was a seasonal flavor.  We got a medium-sized cup of Italian ice/lemonade and even that was a lot for the two of us.  We couldn't even finish half of it, but that's primarily because it was so tart.  I personally didn't like the chunks of coconut and pineapple in the Italian ice, but then again the pineapple tasted super unripe.  <br><br>I liked some of the other flavors like watermelon and blue raspberry that I'd had in the past, but like I mentioned earlier - even those were mediocre for me.  Though I may not be such a fan of what they are serving here, I can appreciate the foothold it has in the community and I like the idea of an old-school lemonade stand that keeps people coming back.  Because it is \"old-school\" you can only use cash here.  Luckily, it's not too expensive here - I think that for a medium-sized Italian ice/lemonade you'd be paying around $3.  That may be kind of expensive if you realize that you're essentially paying for flavored frozen water, but try not to think of it in that manner.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/kRzdjTqiw0iHaef0kyWj2A/348s.jpg", "caption": "Pina colada shaved Italian ice"}]}}, {"review": {"des": "Italian ice. Fresh fruit. Tons of flavors. Super cheap. Amazing. <br><br>Only complaint is that there isn't one closer to me", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/uA0Co7Kd_-TvOpHkwo4ETQ/168s.jpg", "caption": "Delicious"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ZMuUNdD5eAKEgNn3WOeuEw/168s.jpg", "caption": "The stand"}]}}, {"review": {"des": "Classic Italian Lemonade stand in Chicago that I love frequenting during the summer months; partly because of the nostalgia of coming here for years since I was a small child. I am glad that they are still a little mom and pop stand when the whole neighborhood around them has completely transformed. There is no seating but that's part of the fun. No frills and repeatable product every single time. My favorite flavors are lemon, strawberry, and watermelon. Basic but thats exactly what I love about this place. They have hundreds of other flavors to match every taste bud. I can't remember ever having a bad experience. I would recommend going as early as possible because the line gets so long but it moves fast and is totally worth it!", "pics": null}}, {"review": {"des": "Been going to Mario's for over 35yrs. Has been the same great place it has always been...just love it...my personal favs have always been watermelon and honeydew.... Hasn't changed in all these years....just gets  better", "pics": null}}, {"review": {"des": "Mario's is located in the thick of Little Italy.  As we approached the counter, we noticed groups of people gathered on the sidewalk, socializing in the neighborhood as if there were a festival in the area.  A stocky man in a sweat suit, with a chunky gold chain and bracelet to match, stood on the sidewalk with his hands on his hips and potbelly protruding, while he explained his family history to a group of people.  It was as if Mario's strategically positioned this man on the corner to give the neighborhood a stereotypical Italian image.<br><br>Like other Italian ice spots, Mario's does not have seating and is a walk-up counter.  Lines are long, but the service is quick.  Aside from Italian ice, there is a variety of snacks and candy on the menu too.<br><br>I had the watermelon cherry Italian ice.  This is the most authentic version we tried while on our \"crawl.\"  There were chunks of fruit and shaved lemon rinds inbetween the icy bits.<br><br>If you haven't tried Lupini beans, buy a bag of these while you're at Mario's too.  It's an interesting way to finish your Italian ice, sort of a salty palate cleanser.<br><br>Mario's is cash only but worth a stop at the ATM.", "pics": null}}, {"review": {"des": "I used to be willing to drive across town for this, and would have surely given them 5 stars then. Now, I'm not sure if it would even be worth crossing the street for. Definitely not worth waiting in any lines for these days, and definitely not what it used to be. On the last visit, most ices were too melted, mostly liquid, and the flavor just wasn't there. I had to do the unthinkable and drop several watery cups of flavorless ice in the trash, as there was no enjoyment factor. Disappointing to see the quality has dropped so low.  That poor quality means my friends and I won't return in future seasons, and won't recommend this Chicago institution anymore either. If they keep heading in this direction, lines will be a non issue in the future. I guess good things do not last forever.", "pics": null}}, {"review": {"des": "A little bit of heaven on a hot summer day!<br><br>Italian is in the name, but make no mistake, this has Chicago written all over.<br><br>Like many other immigrants, Italian American's put their own spin on their homeland's creations; <br><br>Think of spaghetti with meatballs, the Italian beef sandwich, and, Mario's Italian lemonade.<br><br>Sure, you can find Italian lemonade in other places; lemon though, and if you lucky, one or two more flavors.<br>But at marios, and nowhere else that I know of, at least 10 to 12 flavors can be found on any given day: from watermelon, cantaloupe, pineapple, coconut, pina colada and many others.<br><br>With the right combination of fruit, lemon, sugar and water, it seems Mario's can perform magic with any fruit.<br><br>Every summer, from May through August, I visit Mario's over & over & over; often, I skip dessert so I can stop by, for a refreshing Italian lemonade.", "pics": null}}, {"review": {"des": "Wow what a pleasant surprise.  I was visiting from out of towns grabbing some food at another establishment on the same block when low and behold looky looky here!  I'm from NY and we love our ices!   This was a little different but so tasty and refreshing!  Wish we had these back home.  Chicago is lucky.  Can't wait to visit again, yum", "pics": null}}, {"review": {"des": "After hearing all this hype about Mario's...I figured I would give it a shot. Went with several friends and we each ordered. I ordered the piña colada. Tried it and immediately thought they served me a lemon Italian ice. There were lemon rinds in the piña colada?! One of my coworkers ordered watermelon and had lemon rinds in it too! Needless to say, I will not return to this place. If I can vote 0 stars I would. I would much rather try Italian ice from Carms on Polk.", "pics": null}}, {"review": {"des": "I know this is supposed to be a long standing Chicago tradition but unfortunately I was not impressed. I asked if they could do 2 flavors in a small and was told no. I was hoping to try a few different flavors but ended up ordering the Watermelon flavor since I could only get one. <br><br>The flavor was not concentrated enough so it didn't taste like much at all. It melted instantly so I essentially just got watermelon water. Also, when it was handed to me, it was running down the sides and they did not have any napkins. Overall not a good experience and I will not return. I prefer the Italian Ice at other locations around Chicago much better.", "pics": null}}, {"review": {"des": "I cannot pass through Chicago and get an order of my childhood nostalgia! My favorite has always been watermelon. They make the frozen lemonade with lemon and fresh fruit of the flavor that is listed. I personally love the rinds of lemon in my ice. They balance the sweet and tart and the watermelon chunks contribute to the flavor. <br><br>Coconut is also fabulous, as is cantaloupe. The lines are long, but they move fast. <br><br>It is so nice to have a Chicago staple for so long in the same spot and not change a bit after all these years. It is still as great as it was when I was a kid.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/z-eoY_V0eAaaPWhYTkO8Kg/168s.jpg", "caption": "One watermelon, one coconut! Yummy!"}]}}, {"review": {"des": "This was a good icey surrounded by a college atmosphere this the popularity. If your in the neighborhood sure try it. They let you mix 2 flavors on the $3 and up cups. Btw they give you a straw which is the best part. Note....they are seasonal so be careful.", "pics": null}}, {"review": {"des": "Wasn't a hit today. We have been here many times in the past...usually crossing the street from Al's Italian Beef after a salty sandwich for a sweet. In the past they always had tasty ices...pretty much a strong taste of whatever flavor you chose...like cherry...it was a slap of cherry on Italian Ice...strong cherry taste. Today it was wimpy, wimpy, wimpy. <br><br>Very watered down Italian Ice today...the color was even wimpy. I again ordered a cherry but today it came out as a weak pink instead of a dark red...just a watered down taste. I don't know if they are resting on their laurels, up charging the UIC kids, or just had an off day, but the Italian Ices today were not worth the money. Too bad as this used to be a thing...", "pics": null}}, {"review": {"des": "I have been going to this place for over 8 years... since I was in undergrad at UIC back in 2008! <br>I think this is a place that I will always love coming to, no matter where I am in the city, I always find my way to Mario's during the summer for some italian ice! <br><br>They are always consistent with the flavors, I can say year after year they flavors taste exactly the same, I appreciate the consistency- really takes you down memory lane with the flavors. <br><br>My all time favorite flavors are the piñacolada and the lemon... I usually switch off between the two.... but I know all the other flavors are equally good!", "pics": null}}, {"review": {"des": "If, during the summer, u pass by Taylor St - Little Italy and see a big line you arrived to Mario's Italian Lemonade.<br>My friend and I came here for the first time and decided to try a traditional one and one with watermelon. Both were good but The one that would make me come back is the watermelon one!<br>Price is ok, not cheap but not crazy expensive since it is such a trendy place.<br>I think this place is even part of a tour cause when we were there a tour bus passed by slowly while all the people inside were checking the place and the ladies working there started waving at them.", "pics": null}}, {"review": {"des": "In Chicago, all you have to say is \"Mario\" and they know where that is. Been coming here for decades and consist other than the occasional price hike - but that is expected for the location. <br><br>Plenty of new flavors to choose from but I enjoy my $3 medium mix of lemon and blue raspberry. <br><br>On any day of the week, expect long lines but they go fast.", "pics": null}}, {"review": {"des": "This place still hits the spot on a hot summer day. The line can get pretty long on nice days, but it moves pretty quickly. The smallest cup size is always more than enough for me. And I always stick to the plain lemonade flavor. Great texture and much sweeter than it is tart!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/q6tNcW97TEorx6vqOQpbBw/348s.jpg", "caption": "Small plain lemonade"}]}}, {"review": {"des": "My husband has been going to Marios for 25 years at least. We moved out of state so now whenever we visit Marios is a must. We love the watermelon the most, then cantaloupe. Yes, there is lemon in all flavors and lemon rind, it's how it's supposed to be! This is a fantastic Chicago tradition that hasn't changed its beautiful quality. Thank you, Marios for still giving us what we crave", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/T4Dw3TeeBvsuIpm9P8zfAw/348s.jpg", "caption": "Late night lemonade"}]}}, {"review": {"des": "Amazing Italian Ice, fast service, delicious traditional flavors! Mario's has been a Chicago Staple and a Family Tradition forever. The perfect, inexpensive, delicious summer treat the entire family can enjoy!<br><br>Those who posted negative reviews don't understand the true flavor of Traditional Italian Ice. It's meant to be light, with lots of natural flavors (hence why they keep the lemon seeds and other fruit seeds in the ice). Delicious, low-calorie, inexpensive treat that truly defines the Italian Way!", "pics": null}}, {"review": {"des": "Great fast service!!! Fresh Italian lemonade. With variety of flavors. I have to say I have tried them all and they are all amazing!!!!!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/X3-BqCuHasLYWq9AThs93g/348s.jpg", "caption": "Chocolate strawberry!!!! Amazing!!!! Best chance I took I have to say I have tied them all and they are fresh and yummy"}]}}, {"review": {"des": "If you're ever considering going out for Italian ice, you better get your ass over here! this is the SPOT! They've got a wide variety of flavors and sizes, and it's perfect for when you're really wanting to have a peak summer time. <br><br>Bonus points if you show up on roller blades.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/i08ojUyeU0o2NXQsWZgpRg/348s.jpg", "caption": "Our empty cups curbside, hangin out"}]}}, {"review": {"des": "Mario's is a neighborhood summer staple.  They have a great menu of flavors and the staff is always friendly.  While it's not quite the same texture as Hawaiian shave ice, it's still very tasty with a great consistency/texture and the addition of lemon to all the flavors helps make them not too sweet.  Pina colada is my fave!", "pics": null}}, {"review": {"des": "Hands down the best Italian ice I've ever had ..loved everything about this little place", "pics": null}}, {"review": {"des": "The perfect summer treat! The place has been around since 1954, so Mario's basically synonymous with Chicago tradition at this point. I like lime ice.", "pics": null}}, {"review": {"des": "Yes, I'm a huge fan! The lines move fairly quick so don't be intimidated. This shack is known for it's frosty Italian lemonades which are basically slushies or something like a slurpee. It's still worth it and truly delicous. The flavors pop out and they have plenty to choose from. The down side is that they only accept cash. So because of this and that the lemonade ice itself isn't as surprising, I had to give it a 3-star. Don't get me wrong, it's great but you can get a a big gulp at the 7-11 for the low.. I'm just being honest lol.", "pics": null}}, {"review": {"des": "Amazing!  I can't believe this is still here.  Must visit for a true Chicago experience.  My Dad took us there over 40 years ago and it still tastes and looks the same as I remember it. Chunks of fresh fruit make this a delicious treat.", "pics": null}}, {"review": {"des": "Place is awesome.  It's unfortunate it's not open the whole year!<br>My wife and I would trek down to Taylor St from Gilberts!  40+ miles one way!<br><br>See you when it warms up, Mario's!..", "pics": null}}, {"review": {"des": "Ok the lemon Ice has actual lemon peel and is only available for 3 months out of the year and I was there.... but that would rate a 4 star you say????  Then a old Italian man walks up to me and says how do you like the Ice???? And its Mario who owns the place, we end up talking for 30 minutes.... this made my day...  we even talked about opening a Marios in Hawaii....   LOL but he dont have a phone.....", "pics": null}}, {"review": {"des": "When my friends who went to UIC for undergrad wanted to take me to this \"lemonade stand\", I was a bit skeptical at first but boy, did Mario prove me wrong. This is one legit lemonade stand. If I had a stand like this as a kid, I wouldn't need to be in grad school right now.<br><br>This is a great place to stop by on a hot humid Chicago day to grab a yummy shaved ice dessert to cool off. Even on a rainy day, this stand was poppin'! We pulled up and had one person stay in the car while we went to the stand and bought some yummy heaven icy delight. Although it is a bit \"wtf, $2 for a small cup of ice and fruity flavoring\", it is totally worth it. I got the watermelon lemonade slushy and they use the legit stuff, I even tasted pieces of watermelon and lemon rind in my slushy.<br><br>Definitely a local flavor and a must try if you are in the neighborhood!", "pics": null}}, {"review": {"des": "Great on a hot summer day. Lines are usually long, but they move pretty quickly. All the fruit Italian ice taste fresh.<br><br>The jumbo size is a good deal to take home and share with friends. You can mix a couple flavors-- They also give you extra cups and spoons if you order this size. <br><br>Would recommend the cantalopue!", "pics": null}}, {"review": {"des": "Mario's is definitely a must-stop for anyone in Little Italy/University Village, and anyone that goes to UIC.  My first time here was as a freshman at UIC (back then the prices were almost half what they are now).  But it tastes just as good now as it did back then.<br><br>They have seasonal flavors that come and go throughout the spring/summer (pomegranate, mango, peach)  You can go with the standard Lemonade, I love the watermelon and the strawberry, and the pina colada is good as well.  Heck I'm sure if I tried all the flavors I'd say they were all good.<br><br>There's almost always a line, but it moves quickly, and their refreshing icy lemonade is definitely worth the wait.", "pics": null}}, {"review": {"des": "I'm shocked this place doesn't have a thousand+ reviews. There is always a line to get some of this famous italian ice. It has been here since my grandma and grandpa lived on the area. When ever you come to Little Italy for dinner, you should save room for Mario's in the summertime.", "pics": null}}, {"review": {"des": "A perfect cold frozen Italian lemonade delight for those hot Chicago days. I had the watermelon one. It had bits of watermelon in it. So refreshing! And not overpoweringly sweet. I went around 4:30pm on a Tuesday and there was luckily no line! $2 for a small. I'll definitely be back :)", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/7dnmZAiK8CNwIBhemmrxZA/348s.jpg", "caption": "Watermelon!"}]}}, {"review": {"des": "I been coming to Mario's Italian ice for decades now.   This place make you feel a little bit Italian.  My favorite flavor now is pineapple.  It is perfect. I tasted my sons Luigi chocolate flavor it was good.   My son Michelangelo had cantaloupe.  My mom had watermelon this flavor used to be my favorite.  I love grape and blue berry flavors too<br><br>When you have this Italian ice it welcomes you to summer.  I come here as much as I can during the time it is open.  The people working here a young people very friendly and will give you flavor tasting upon request.   I have had other Italian ices but for sure Marios is number one in the whole entire world.  Yum yummy delicious and refreshing. <br><br>I give it 5 stars because I love it", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/GXqHqJbUSSn_1EJVhOv8WA/348s.jpg", "caption": "A long line for this delicious Italian ice"}]}}, {"review": {"des": "A Chi Town staple...this was one of the first things I learned about this place when my family moved here. We've been coming here ever since. Don't know if there is anything I can say that hasn't already been said, but I've been scolded for not yet reviewing Mario's. It's a place to start a time-honored tradition, one that will create fond memories, forge friendships, and strengthen bonds. Because seriously, who's unhappy when consuming Italian ice?! Being budget-friendly and having an assortment of flavors doesn't hurt either", "pics": null}}, {"review": {"des": "Mario's has the best Italian Ice in the city.  Period.  Closed in the winter and no available seating around this walk up outdoor counter service spot but we've never been disappointed with any of the flavors.  Lemon for me always but the kids will always try some of the variety of flavors.", "pics": null}}, {"review": {"des": "Lemon Italian Ice was sour like it had too much lemon juice. It was not good. I literally just had a lemon Italian ice yesterday from another place it was perfect but not this one. Customer service was exceptional.", "pics": null}}, {"review": {"des": "I need a picture of an actual Mario's Italian ice because their Italian ice is the best. I have enjoyed a number of these frozen and sweet treats. Located in the UIC neighborhood on Taylor St., Mario's is a historical landmark for frozen Italian ice. Conveniently close to my barbershop, AJ the Barber, Marios is an easy choice on a warm Summer afternoon. My only complaint is that Mario's is only open maybe 6 months of the year which makes sense but they could open it in early May. Either way got to love this place and it is the best Italian ice in Chi city.", "pics": null}}, {"review": {"des": "This was simply delicious for the Chicago heat. It was nice to walk around little Italy and just enjoy this Italian Lemoanade.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/QLKsDUHFlmzO-81BZ6Q9fw/348s.jpg", "caption": "Strawberry lemonade ice. Beat the Chicago heat!"}]}}, {"review": {"des": "Iconic. This should be on the top five things everyone does in Chicago. I go all the time. Inexpensive, delicious, real chunks of lemon. If I could only bring three things to a deserted island, a Mario's Italian lemonade (classic lemon flavor duh) would be one of them. Strawberry and watermelon are also good (according to my friends. I am a purist and stick to the lemon.) Go here. You won't regret it.", "pics": null}}, {"review": {"des": "Best Lemonade in Little Italy area. But only available in summer.  They have many flavors and sell at reasonable price.", "pics": null}}, {"review": {"des": "My favorite Italian ice spot!! I've been here hundreds of times and the fruit cocktail is my favorite. It has a various amount of fruit inside the Italian ice. Best flavor ever. They're quick, efficient, and have good service. Get the Jumbo size for $8. It's huge but you can ask for cups to pour your home and the Italian ice tastes great even after freezing it. Parking can be a problem since it's on a street. Accidentally parked in the bus lane last time and got a ticket!", "pics": null}}, {"review": {"des": "Excellent spot for a cheap treat that tastes delicious! Definitely need to visit every summer! If you haven't tried it, you are missing out.", "pics": null}}, {"review": {"des": "I absolutely love this place! I like literally count down till it open. We sometimes go almost everyday on weekends. Def recommend blue raspberry and watermelon. Staff is always super friendly. There can be a long line but goes by quick. Def a chicago staple!", "pics": null}}, {"review": {"des": "Great place! Fond memories and flavors. Ices are not too thick and just the right consistency for a hot summer day. Unfortunately, even during unseasonably HOT Chicago weather like this week, Mario's is closed until May 1st. Can't wait!", "pics": null}}, {"review": {"des": "Italian Lemonade is BOMB. Like... holy cow.<br><br>Mario's is one of my favorite spots in this big ol' city. Dropped by here after a painful sushi lunch next door, and this made up for it right away. On a hot summer day, these are PERFECT in quenching your thirst. Ranging from small cups at $1.75 to a big bucket for $7, you get shaved Italian ice with wonderful fresh fruit pieces inside.<br><br>The pomegranate is the BEST. Watermelon is fantastic as well. Blueberry was tasty but wasn't my cup of tea- definitely wish I had just gotten another pomegranate.<br><br>The only sad thing about Mario's is that it's going to close in a few weeks for the Fall-Spring. Super Sad! But I get it, they need to take their business over to somewhere warmer like Miami.<br><br>But every year I continue to live in Chicago, I will be back here to enjoy the best dessert ever.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/6yqCfLNTBaiDALvghMPnSQ/168s.jpg", "caption": "Delicious watermelon lemonade"}]}}, {"review": {"des": "I have nothing else to say except two (2) words: ten (10) star! <br><br>Ok, it will not make any sense to stop my review here.  Mario's Italian lemonade is truly a Chicago institution, without a doubt.  Please do NOT tell anyone that tonight was my very first visit.  Trust me, I will certainly become a duchess for the number of check-in at Mario's, as long as I commit to put $2.75 in cash aside for a medium-size cup every single day.  <br><br>If you are insisting on playing your Super Mario Brother video game at home and refusing to head out to Taylor St. (Little Italy), you are for sure missing out the summer fun.<br><br>We were fortunate enough to get to the window and place our order rather quickly.  Pomegranate and cantaloupe were our picks (tough decisions by the way).  Not only did I see generous pieces of fresh fruit in the cup, but also visualize many biological components of the fruit.  For example, I encountered many pomegranate seeds and they were very delicious and refreshing!  <br><br>The quarter piece of frozen lemon was an awesome touch!  OMG, I will have to upgrade to a larger size next time.  <br><br>Mario's also sells lupini beans.  Hubby grew up in Roma and knew exactly what they were while I was relatively clueless.  I guess I will have to make a point of trying them next time.  <br><br>There's usually a bus directly coming from Streeterville near the Water Tower Place (#157 Taylor/Streeterville) until the end of PM rush hours.  If that doesn't work out, the CTA 60 (Blue Island/26th.) bus runs late and has a terminal stop at Millennium Park.  If you prefer to take the \"L,\" the CTA Racine Blue Line station is approximately fifteen (15) to twenty (20) minute walk.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/r1Fz625Kxo3lz_fUVbqthQ/348s.jpg", "caption": "Pineapple (left); orange (right)"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/h-sP5JrVczhWR5NgRbQSTA/168s.jpg", "caption": "Watermelon and coconut"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/A7YE_sHTJipN_R1hPc-YIA/168s.jpg", "caption": "Pomegrante and cantaloupe"}]}}, {"review": {"des": "This place is a bit overrated. I tried the pomegranate and watermelon. The pomegranate was too sour for me and the watermelon was just okay.<br><br>I would be interested in going again to try new flavors but I wouldn't go out of my way for it.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/vCSEEd_L_m7_L7TfmVmH3w/348s.jpg", "caption": "watermelon and pomegranate + watermelon"}]}}, {"review": {"des": "Kids had the lemon and lime ice here. They said it was good, but not necessarily great. Not sour enough... Kinda subtle flavor.", "pics": null}}, {"review": {"des": "I've been coming here for many many years and LOVE their Italian Ice. Its a great summer treat and very refreshing. We usually get a couple small cups to eat right away and a couple tubs of ice to take home.<br><br>My favorites are Pina Colada, Watermelon, Blue Raspberry, Lime, Strawberry and Coconut. <br><br>The bit of pineapple in the Pina Colada are sooo good and the watermelon chunks in the watermelon are good as well. I don't really care for the lemon peels but I deal with it because I love the ice.<br><br>They also sell Lupini beans which pair so well with a cold ice. I had never heard of a Lupini beans before coming to Mario's. Now their one of my favorite snacks.<br><br>Parking is easy to find. The lines are usually long but move very fast. The staff is always nice and they work hard so I always make sure to tip them a few dollars =)<br><br>I look forward to spring every year because I know they'll be opening soon.", "pics": null}}, {"review": {"des": "BLOWN AWAY! I am not a fan of shaved ice (I prefer chocolate sweets), but on a hot Chicago day, my wife and I found ourselves at this little stand on a side street. It's literally a wooden stand in the middle of a street and it's perfect! It's only $2 for a cup of the most amazing shaved ice you'll ever have. Each cup includes a bit of lemonade and real pieces of fruit. The watermelon lemonade shaved ice is OUT OF THIS WORLD!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/LIs6Awu949-ypVwyxTie5g/348s.jpg", "caption": "They sell nuts too!"}]}}, {"review": {"des": "Great on a hot day. It's so refreshing. Flavors tried. Cantaloupe & pina colada. Fruit cocktail. So nice & lite on the stomach. Must try.  Parking on street & a crowd comes thru but goes quick. Only open summer months.", "pics": null}}, {"review": {"des": "Came here on a Monday night around 10pm and there was a line down the block! No place to sit, but it's no wonder this place is booming--the Italian lemonades are super yummy!! You can mix flavors. Personally I enjoy watermelon and pomegranate! ($3 for a medium) this place is cash only.", "pics": null}}, {"review": {"des": "I've been going here for years. I recently came back to town and this was my first stop. The lemonade was not as good as it used to be and the service was horrible. I felt rushed and as if I was bothering them - just to get watered down Italian ice. Do they have new owners because I'm confused..?", "pics": null}}, {"review": {"des": "a must have in Chicago.  Don't be scared by the line, it moves very quickly.  Awesome flavors, value and taste.  Love this place, reminds me of Rita's WaterIce in Philly", "pics": null}}, {"review": {"des": "My sister kept telling me that this was a \"must-stop\" kinda place during my weekend visit and she was right! This small frozen lemonade stand in University Village produces incredibly delightful and refreshing flavors that keep the crowds lining up even in chilly and rainy May weather. <br><br>At her suggestion, we got mediums ($2.75) with half strawberry and half piña colada. With fresh fruit in each sip or spoonful, the flavors were really bold. This afternoon treat had just the right amount of sweetness and it was very light, which was a welcomed contrast to our heavy meals.<br><br>The place is cheap, the employees are efficient, and the lemonade is good!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/TwiFGlJrFbw9Do7567gErQ/168s.jpg", "caption": "Piña colada on top, strawberry underneath"}]}}, {"review": {"des": "Marios is more than just a neighborhood Italian ice place for me. Let me take you all back to a much younger and slimmer version of myself, high school aged Julie. My friends and I knew when Marios opened it was time for summer. I spent countless Friday's racing through I-55 traffic to grab a blue raspberry Italian ice and cashews. Fast forward, and most is the same. Except the aforementioned changes in myself. Marios is consistently the summer go to spot for anyone from the southside and beyond. The Italian ice is delicious with some lemon slices to give it an extra zing. Gummy bears and cashews are another personal favorite in case you're in need of some extra flavors on the side. Blue raspberry, grape and watermelon are my personal favorites for the ice but you can't go wrong here so go for the gold and try them all.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/1ni_Up98MxSX41V6xl2cQw/168s.jpg", "caption": "Blue raspberry, strawberry and cashews."}]}}, {"review": {"des": "This my place to go anytime I'm in Little Italy. And for those that try and go here and see long lines...don't worry! Line moves super fast. Keep in mind that is cash only but they got like 15 different flavors. Lemonade of course...watermelon, Pina colada, blue raspberry, strawberry etc..  Lemon did taste a little bitter at times and sweet on other sips but enjoyed the strawberry flavor.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/skBg3a7VCta3KNSJLoQEPw/348s.jpg", "caption": "Lemonade & Strawberry."}]}}, {"review": {"des": "We swung by Mario's Italian Lemonade stand on a Saturday afternoon after I stumbled across it on Yelp the other day.<br><br>Décor: it's a true \"hole-in-the-wall\" stand that doesn't have much to it other than a window and a roof+walls haha. But you know that that means, the food is going to be great! Located right off the UIC campus it is a pretty easy to get to spot. While it's a bit off the beaten path it is located in a quaint little neighborhood where you could easily get lost just taking in \"suburban\" urban Chicago.<br>Bathroom: unknown<br><br>Staff: There were three very friendly teenagers working who were quick to make the frozen lemonades and were always smiling. Fun staff.<br><br>Food: We had a small Strawberry (tasty) and a medium lemon+lime (meh). Overall the lemonades were just okay... while PERFECT for a hot summer day they do not carry an overabundance of flavor. Perhaps I'm used to overly-sugared-up lemonades and therefore my taste was thrown off by a \"real\" lemonade, or the fact that I LOVE water with lemon and probably add way too much on a daily basis, but I found the \"drinks\" to be a bit bland.<br><br>Value: It's cheap and it's CASH-ONLY.<br><br>While I love finding little local treasures like this they usually turn out to be a bit more enjoyable. I think I'd still recommend others to give it a try but only if they were nearby and I wouldn't over sell it. I don't think we'll return in the near future.", "pics": null}}, {"review": {"des": "Famous place on the Taylor Street. The fruit flavor is very pure and I want to try most of its flavors!", "pics": null}}, {"review": {"des": "I no longer live in Chicago but i ALWAYS eat at Mario's when I come back. They have one of the most unique Italian lemonade I've ever had. From experience, they seem to have a very polarizing flavor. People either love it or hate it. They are only open during the summer season so make sure to check before you make the trek over there. <br><br>All of their flavors are amazing but my favorite by far is watermelon. The ice is not too sweet but heavily infused with watermelon flavor and juice. There are giant chunks of fruit in it as well. The lemon zest gives the dessert an extra flavor too. Mario's is excellent for that hot summer day when you aren't looking to get an extreme sugar high from chocolate or heavy ice cream. <br><br>Highly recommend it and will repeated urge people to come here against their will. 6 stars if that were possible", "pics": null}}, {"review": {"des": "I LOVE this place!!!!! I have never had a bad flavor. I anxiously wait for August for the peach. I have most of my friends hooked on it too :-) do yourself a favor stop by and check it out. You will not be disappointed", "pics": null}}, {"review": {"des": "An absolute Chicago Classic. Open from May 1st through second Sunday in September. All the flavors are great,but when they have peach, it's a must try! On a hot summer's night the crowd spills out on to the street and it may take you 30 minutes to get to the window. Somehow, that makes the prize even better.", "pics": null}}, {"review": {"des": "I went on the first day of its opening for this year on May 1st and it was packed. The line was long and out to the streets. I'm not from Chicago and was just visiting but I heard a lot of great things about this place and decided to check it out. I got the pineapple and watermelon flavors in a medium cup for $3. This place is cash only and you can do up to 2 flavors in the medium and large cup but you can only choose one flavor in the small. <br><br>I have never tasted a more fresh Italian lemonade ever! I loved the chunks of fruit that's actually in the ice. It's so refreshing and I could definitely see why this place is the go to on a hot summer day. I'll definitely be back to try the other flavors!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/foALRDYmP4tT-T1pOwi44g/348s.jpg", "caption": "I got pineapple and watermelon in a medium cup for $3"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/rRjq0-gtA4blcEne-vYwUg/168s.jpg", "caption": "These are the lemonade flavors"}]}}, {"review": {"des": "I've been coming here since I was in my moms womb. lol A great Chicago spot to beat the summertime heat and get a fresh Italian ice.Can't say I have a favorite because I love everything about this <a href=\"/redir?url=http%3A%2F%2Fplace.my&s=12fcd1fa3d6980a46b675e5cde791b1dfe27116b53bf36b2fb5a5248d5538d6c\" target=\"_blank\" rel=\"nofollow\">place.my</a> combo is half lemon/straw with a side of pumkin seeds. ;) The heavy salt covered seeds gives you a bit energy from walking all day down town. While after you time it down with the fresh italtian ice with bits of lemon in it.", "pics": null}}, {"review": {"des": "Why are you open only three months out of the year!! Pretty simple great Italian ice, tons of different flavors, fresh fruit, freshly squeezed lemonade, lupini beans, and cashews. This is an old-school Italian ice stand not much like them anymore, too bad it's only open late May through August then it's bye-bye, all the Italian ices homemade No bull. Not a better place anywhere in my opinion.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/rKeMre6Usk3VqhwX6lQbsA/348s.jpg", "caption": "Half cantaloupe half lemon Italian ice!"}]}}, {"review": {"des": "This place has been in business for close to 50 years and is a Chicago staple. There is a large selection of Italian ice flavors all using real fruit. The only downside is that I do not like all of the pieces of fruit pit in my Italian ice. No matter what flavor i get, The Italian ice is loaded with seeds and peels.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/lGF4kWBt0982sqqWmo21kg/348s.jpg", "caption": "Blue raspberry and bannana cherry"}]}}, {"review": {"des": "This is my favorite place to go in the summer for a tasty treat! Every flavor I've had is incredible; there is often a long line, but it doesn't take too long. Can't wait for summer, I could used an Italian Lemonade right now!", "pics": null}}, {"review": {"des": "Mario's is my kind of frozen treat. It's a shame (but makes so much sense) that they're only open for the summer season, but I miss it even when it's freezing outside.<br><br>The small is only one flavor, where the medium will let you get two! <br><br>I'm obsessed with how fresh it is - the lemon rind and fruit bits (the pomegranate is one of my favorite flavors) help keep everything from getting overly sweet.<br><br>There tends to be a long line, but people are rather friendly - students, families, tourists - and it moves relatively fast. <br><br>Watch out for the bees though! They love this stuff -", "pics": null}}, {"review": {"des": "Loved coming here in the summer and really enjoyed the shaved ice with some real fruits in there, especially the watermelon one. sadly it is closed for about half of the year because of the long chicago winter", "pics": null}}, {"review": {"des": "Colored ice with aspartame or some other sugar. My lemon ice was nothing more than sugar water. Not sure what all the huff was about. The Pomegranate was not much better. I guess we just got lucky today. Not returning anytime soon. Sorry.", "pics": null}}, {"review": {"des": "My favorite place in Chicago! Their watermelon lemonade is by far my favorite! I've been going here for years with my family. I love this place!", "pics": null}}, {"review": {"des": "This place is really good for what it is - I mean, yes, a little overrated but it's an Italian lemonade stand! If you don't know what good Italian ice is, it isn't the place for you. Italian ice is supposed to be sweet and tart, if you have a preference just ask! They'll happily accommodate. Their prices are really inexpensive so if you're looking to just try, you aren't losing much.<br><br>It's perfect on a hot summer day! They use actual lemons and you can tell when you start eating it because there's lemon throughout the ice itself. the flavors are made from fresh fruit rather than syrup! There are so many flavors and they're all very affordable! I've never had Italian ice that was so smooth! They really pack it in there as well, even if you get the small! <br><br>So far, I've had the blue raspberry, strawberry, and the watermelon. You can't go wrong with any of these! I'm still looking forward to trying the other flavors! On a hot summer day, expect a line.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Mnzrozh-1J39gDTr_-r7Bg/348s.jpg", "caption": "On a hot day!"}]}}, {"review": {"des": "Omg!!!!!!! I absolutely love... love ....love ....this place. I am a HUGE fan of their pineapple Italian ice, I mix it with almost anything any everything. This is a spot to take your entire family. You get to sit out side and enjoy the summer breeze and good conversation over this one of a kind Italian lemonade. I've been going to this place since I can remember,my entire family loves this place.  Each visit I literally get a large pineapple and watermelon  plus a jumbo packed on ice  to take home that's how much I love it 100 stars if I could just that good. Great job you Guys never let me done", "pics": null}}, {"review": {"des": "Saturday night, post dinner plan: Italian ice at Mario's.  I was almost scared away by the long line at 9pm, but so glad we persevered since we were blissfully enjoying our delicious Italian ice lemonades in no time! They can be ordered in small through x-large sizes, and you could mix two flavors starting from the medium size. <br><br>The cantaloupe flavor was my favorite, followed by watermelon.  I thought the strawberry tasted artifical and wasn't a fan.  Little bits of fruit and a frozen lemon rind added a more natural and interesting lemon zest flavor.  The texture is like a slightly firmer slushy, and there is an option to skim the surface with a spoon or drink it through the straw.  Refreshing, light and not too sweet - these are really the quintessential summer treat!", "pics": null}}, {"review": {"des": "There's a reason why the line is so long. The frozen lemonade from there is amazingly delicious. I've tried at least 7 of the many different flavors and they were all amazing. Some come with pieces of the fruit flavor you buy and pieces of lemon to add to taste.", "pics": null}}, {"review": {"des": "Fresh and natural Italian Ice made with real fruit and juice. The line may look long but goes fast. Well worth the wait", "pics": null}}, {"review": {"des": "This is seriously the best Italian lemonade spot in town. Every summer the line is down the block! You can taste how fresh everything is. There are are also chunks of fruit in your cup.If you ordered watermelon, there's watermelon pieces! <br><br>Pros: <br>Fresh and homemade <br>So many flavors to choose from<br>You can mix and match the flavors as well<br>They make sure the line is moved fast<br>Very friendly staff!<br><br>Cons:<br>The long line<br>That's it!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/pR8FsSRPQa52fRrng5xX6g/168s.jpg", "caption": "I was SO full from lunch but still made room for Italian lemonade!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/pdoYdIJOPUW-mHtxds6zVg/168s.jpg", "caption": "His and hers."}]}}, {"review": {"des": "Mario's is a classic summer staple event in Chicago. <br>Yes, I categorize it as an event because it is a big deal to go there. It is a summer place and Chicago celebrates summer like no other City. Our last visit was a rainy summer night and even though it was raining, there was still a line! The place is good! This is where real Chicagoans go. For those that do not live close and need to drive, sometimes you are lucky and find meter parking, sometimes you double park. In any case, the staff is always pretty nice, open til midnight on the weekends, the price is reasonable and the flavors are delish!", "pics": null}}]}