{"name": "mastros-steakhouse-chicago", "reviews": [{"review": {"des": "I stopped in to Mastro's last night for a quick bite after work with a friend. We had the best time!<br><br>The hostess greeted us sweetly and sat us in the bar room as requested. The live music sounded great, with quite a variety in their line up. I loved that they weren't too loud so we could still chat over our meal.<br><br>The server was amazing. She really knew her stuff and helped us navigate our cocktail order and also the dinner menu. We enjoyed the best martinis - like always and then ordered appetizers and a side since we were keeping it light.<br><br>Our shrimp cocktail was fresh and tasty. The scallops had a sauce I wasn't sure about, but once I tried it I fell in love. The tuna tartare was so good I could eat it everyday! To round things out we shared a little steamed spinach. Believe it or not, we were so satisfied we didn't even have the butter cake tonight. I will be sure to have some next time.<br><br>Overall, on top of a magical cuisine and attractive room, the hospitality always exceeds my expectations. Love. Love. Love.", "pics": null}}, {"review": {"des": "Mastro's is a respected steakhouse that I have had a few great meals at. Rather than labeling it a hip or trendy restaurant, I find it to be exclusive and a bit stuffy. They serve strong drinks in a (very) dimly-lit setting with ample space upstairs for private events. Whenever I bring people here, the reaction is often \"I liked it but I didn't love it and I'm not sure why.\" I know that leaving it at this is a total disservice to how wonderful of a restaurant Mastro's is, but I've never had a dining experience here that could compare to Swift & Sons on a bad night.<br><br>I think that young people are better off visiting the newer Steak 48, which is owned by the same restaurant group and does a better job of capturing the awe factor that helps distinguish top-flight steakhouses.", "pics": null}}, {"review": {"des": "BEST PLACE IN CHICAGO!!!!!!!! Food is AMAZING New York strip is the best in the game!! The One of a kind BUTTER-CAKE is so delicious!!   the salmon is just so amazing . <br><br>Would recommend to anyone that loves the best quality stake,sushi,fish, sprits ext.", "pics": null}}, {"review": {"des": "Upgrade your dining experience and go here! The best thing I've ever had in my mouth!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/kSZxmzP3WC89Hy25Wz4PcQ/168s.jpg", "caption": "Let the seafood tower BEGIN!!!"}]}}, {"review": {"des": "This hip and trendy steakhouse is a staple in Chicago and other cities where this chain exists.<br><br>The food was excellent, but for a party of 5, I didn't expect to pay $9 every time they filled up our water glass. Who charges for water, seriously? Mastro's Steakhouse does so when they say sparkling or natural water, either way, it's going to cost you between $18-$36 for your group of 4-5 people if they have a couple of refills.<br><br>Of course, being a 5-star steakhouse you expect to pay for sides and depending on which sides you get you may have enough for your entire table, or not. <br><br>We made a reservation for a birthday and requested birthday cake and a candle they called to confirm that and the reservation during dinner they completely forgot about the cake - no good! 5-star restaurants don't forget about big details like a confirmed reservation is for a 70th-anniversary dinner after they called to state they could accommodate the request. <br><br>The waiter was great but he approached me to tell me I didn't need an additional order or green beans because my party ordered one and it should be extra. Never mind, I wanted it and my food allergies made it so I couldn't share with someone eating anything with shellfish in it. Was he paying the bill, nope? I turned to him and smiled and said, \"I would like an order of green beans on my plate please.\" <br><br>So the food comes out and my medium rare steak is overcooked. My medium rare steak was more well done than my boyfriend who ordered his in a medium. I hate sending items back but in this case, it was just hard to chew. The next steak they sent out was so perfect, I ordered a second one to go!  <br><br>My bill for a party of 5 with one steak to go was $730 after tip. I tipped a little over 20%, I always do, but they certainly didn't rank amongst $600-900 dinners I've had in the past. <br><br>The food was good.<br><br>The steak was excellent.<br><br>But, this can't be the best steakhouse in Chicago, can it?", "pics": null}}, {"review": {"des": "When we walked in, we we're greeted with the sound of beautiful live band. Our hostess seated us right away and our server Chris, tended to us right away. <br><br>Chris was attentive and friendly (but not dripping with friendliness like his job was on the line but a sincere friendly, approachable type of person). He asked us if we were celebrating anything special to which we said my sister's 10Th year anniversary at work!<br><br>He asked us what we liked and made some suggestions. We decided on the Australian tomahawk steak to share between 2 and Chilean sea bass. Since we said we were splitting the tomahawk, our waiter went ahead and had the steak sliced for us so that it'll be easier to share! The was delicious and bursting with flavors! The sea bass was very flaky and juicy at the same time! Both entrees were insanely delicious! We also had Gorgonzola Mac and cheese and green beans with sliced almonds.<br><br>At the end of our meals, we decided to go with a creme brûlée to share since none of us finished our meals and were completely stuffed! Imagine our surprise when Chris was thoughtful enough to remember what we were celebrating and brought out an additional dessert compliments of him! He made our night even more special with his thoughtfulness! Will definitely stop by again if I'm ever in town! Thank you Chris for being an awesome server!", "pics": null}}, {"review": {"des": "We came here on a Friday night with no reservations. We were expecting to be told they had no space or we'd have to wait for a bar area table. Much to our surprise they were able to find us a table at the bar fairly quickly. <br><br>We just wanted a quick good meal so we ordered the 12oz filet and garlic mashed potatoes. My favorite part of the entire meal was how the steak came out of a very hot plate. It made all the difference. I've been to so many places before and no ones done this. They usually have warm plates but not like this one. The steak itself was cooked medium rare and was almost soft enough for me to break off a piece with my fork. The mashed potatoes were a good consistency. They were light and airy. <br><br>Overall a really good experience. We were looking for a quick good meal and that's exactly what we got.", "pics": null}}, {"review": {"des": "After speaking to a manager I was told somebody was going to reach out to me and it didn't happen. I responded with an email and no response.  <br><br>I just want to say if you're black man stay away. This restaurant doesn't care about black people at all<br><br>Manager called and told me he was going to call back but never did.", "pics": null}}, {"review": {"des": "Zero stars if possible!<br><br>This was one of the WORST dining experiences I have ever encountered in my life.  <br><br>After ordering $500+ of food and several bottles of wine, our $115 Wagyu steak was sent back twice due horrendously overcooked, and then under-cooked, preparations.  Unfortunately, our server and manager were both entirely unapologetic and unwilling to take care of the issue.  After finally receiving a properly cooked steak, our entire family was totally taken aback while being greeted with an anti-Semitic slur along with the check (the steak was refunded, however, no other items were replaced after sitting on the table cold for nearly 1 hour).  <br><br>Upon confrontation by my wife and mother on the way out, the manager of the restaurant insisted that what several of us heard from the server on the way out (at first, \"Happy Holidays\", followed by,\"Happy Hanukkah\" under her breath while rudely turning and walking away), the manager proceeded to defend his server (he was not there) and insist that such an event couldn't have possibly taken place.<br><br>My family and I will never eat at a Mastro's again.  My brother has been to this restaurant in several cities three separate times over the past week, and will never come back.  Good luck treating your customers this way... we will continue to go to Joe's for good food in Chicago.", "pics": null}}, {"review": {"des": "**Updated**<br><br>Manager contacted me after posting my review. She requested that I complete an online survey. I took the time to complete and messaged her to let her know I submitted. Apparently I wasted not only money on dinner, but also my time. .. it's been a month and still no word. Disappointing to say the least.<br><br>I should probably write a thorough review, but I'm still salty about all the money we spent for a mediocre-to-poor experience. All 3 of our steaks were over cooked. We were starving so one of my friends decided to eat his well done ribeye, smh. Our server disappeared after taking our order. We had to flag another waiter to send our steaks back. After waiting for the re-fire we ended up taking our food to go. To make matters worse, nothing was offered for the inconvenience AND they mixed up our to-go boxes. Luckily for me, I ended up with the pricier steak practically untouched. I expect so much more from a steakhouse with these prices and reputation.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/dSUfd_B7fRNeCrAqoAPBQQ/348s.jpg", "caption": "Hennessy Sidecar - Hennessy VS Cognac, Cointreau, sweet & sour and fresh lime juice served up with a sugar rim and lime garnish"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/SOBrrculnuT-K-FwTFjilw/168s.jpg", "caption": "Ribeye & Mac"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/SF_h0360q10NwQXzuLuBqw/168s.jpg", "caption": "22 oz Bone-in Ribeye"}]}}, {"review": {"des": "I've been wanting to check out Mastor's for some time now and what better time then during restaurant week. segway to Restaurant week stop #3. <br><br>Arrived a little bit before my reso and was given an option of a few places to sit. We went with the lounge since they said there will be live music ( which was really good). <br><br>before I get into the food I'm just going to make a comment about the service.... it was lacking. Our waiter was nice, but honestly I expected more from Mastro's. <br><br>on to the food:<br>Mambo salad- I would say skip it. it was not spicy and it was overloaded with cheese<br>Jalapeno Tuna Sashimi- good flavor and super fresh<br>Blackened Salmon- My friend ordered this and I was beyond surprised it was so good!<br>6oz Filet- It was good but way over cooked for my taste. I ordered medium and it was not a medium at all. <br>Mini Warm Butter Cake<br>cheecake  ( both desserts were so good)<br><br>outside of the RW menu we added garlic mashed potatoes. brussle sprouts, and a bottle of wine. <br><br>Everything was decent but I was not wow'd. I've just had better meals/experiences at other steak houses.", "pics": null}}, {"review": {"des": "Great meal. Fantastic streaks. Beware, the appetizer portions are HUGE! The Lobster bisque and tuna appetizers are meals by themselves. The bone-in rib eye was one of the best I've ever had. The twice baked potato and creamed spinach were very good and also large portions for sharing. Our server was rock solid. Very knowledgeable and always smiling. She could not have been better. The only things that kept this from being a five star meal were service related. We dine out a lot so maybe I'm being too picky but here you go:<br><br>- Held a reservation but had to wait over a half hour for our table. The (multiple) hostesses could not have been less interested about our wait and had a very conceded attitude. My recommendation is to send them back to service school - it's not about you it's about the customer.<br>- The waitstaff gentlemen filling the water filled my wife's glass quickly and over the rim so the water splashed all over her place setting and silverware and he just walked away.<br><br>Again, thanks for the great meal but if restaurants are all about continuous improvement there are a couple areas to improve here. Look forward to visiting again.", "pics": null}}, {"review": {"des": "Where to begin??? The bar is large well stared and the drinks are large and strong. The music is live and really good. <br><br>The food is very well prepared. The bone in filet is fabulous. Tender and juicy. Sides are big for sharing. Shrimp cocktail perfectly cooker and the nuclear horseradish sauce deserves the name. <br><br>Killer sushi. Fantastic wine list. I could live here.", "pics": null}}, {"review": {"des": "BACKGROUND<br><br>I must confess, I'm a HUGE fan of Mastro's.<br><br>MASTRO'S<br><br>As always, I love to do my research and find out some information on the location I'm visiting, so I can use my reviews for reference. And this is what I found from various sources.<br><br>Mastro's collection of sophisticated, classic Steakhouses and Ocean Club seafood locations are recognized for their combination of world-class service, highly acclaimed cuisine, and live entertainment in an elegant yet energetic atmosphere. A truly unparalleled dining experience.<br><br>Mastro's Restaurants is owned by Landry's, Inc. and is led by a team of highly motivated and detail oriented management who strive for excellence in guest service, finest quality food and distinct ambiance - elements that set Mastro's apart from other restaurant groups.<br><br>Although each restaurant possesses unique design elements, all exhibit commonality in their goals: to provide every guest with a truly memorable experience. <br><br>I have visited the Mastro's in Scottsdale, which also has the casual elegance with an edgy southwest feel, including impressive Chihuly Glass accent chandeliers. <br><br>THE STORY & SERVICE EXPERIENCE<br><br>A group of us love starting at a meeting place downtown and then hopping from hot-spot to hot-spot.<br><br>On this particular night, we started at RPM, then jumped over to Mastro's for a nightcap and some live music.<br><br>Mastro's is lovely from start to finish. Very well appointed and truly a superb experience.<br><br>I love having drinks at their backlit wall bar. Their cocktails are fun and unique, and they have an amazing by-the-glass wine list, including some delicious champagnes. <br><br>The staff is efficient and well trained in high-end service.<br><br>CONCLUSION<br><br>You know the saying, \"You get what you pay for?\" Well in this case, that saying is 100% accurate. Nothing but FIRST CLASS all the way.<br><br>I can't wait to go back.<br><br>5/5 RECOMMEND<br><br>OF NOTE<br><br>*Locations: Mastro's Restaurants can be found in prominent cities across the U.S., including the original Mastro's Steakhouse in North Scottsdale. Ten additional Steakhouse locations can be found in Beverly Hills, Thousand Oaks, Costa Mesa, Malibu, Palm Desert, Chicago, downtown Scottsdale, Houston, New York City and Washington D.C. Mastro's Ocean Club has locations in Boston, Las Vegas, Scottsdale and Newport Beach.<br><br>*Accolades: Consistently hailed by diners and critics alike as \"masterful\" (Los Angeles Daily News), \"high end\" ( Los Angeles Times), one of the \"top 10 steakhouse in the U.S.\" (Gayot) and \"the preferred steakhouse of celebs and locals\" (944).<br><br>*Proper Attire Required.<br><br>*Gift Certificates Available.<br><br>*Parking is impossible. Drop off preferred.<br><br>*For more information: <a href=\"/redir?url=http%3A%2F%2Fmastrosrestaurants.com&s=14fd2b0b9eb6b394448c4618e6833c46741164a941a78d302dc56a687b52ab5c\" target=\"_blank\" rel=\"nofollow\">mastrosrestaurants.com</a>", "pics": null}}, {"review": {"des": "I recently dined at Mastro's Steakhouse on a chilly weekday evening. Despite the usual assortment of wintry Chicago elements outside, the dining experience inside was well stocked with diners, most of whom were elegantly dressed to match the fine atmosphere indoors. <br><br>Our server was very patient with us, as my dining companion and I chitchatted throughout the evening rather than selecting menu choices immediately. His dry expertise was very helpful with any food questions that we had. The waitstaff team provided impeccable service throughout. The live music in the adjacent room added to the overall experience. <br><br>We were presented a bread basket, which held a good looking selection but was nearly untouched by us because we ordered a parade of food accompanied by adult beverages. My French onion soup was sumptuously hearty and gooey, while my galpal enjoyed her lobster bisque and her salmon main course. My entree was the 8 ounce filet, which was tasty as you would expect at a steakhouse. Our server mentioned that the side dishes were large and suitable for sharing. Indeed the Gorgonzola mac and cheese came out in a scintillating hot skillet, an enormous portion that could easily stand as an entree in its own right. We went with the Brussels sprouts as a second side, and they added a healthy kick to our meal. <br><br>We were thisclose to not ordering dessert, but I blurted out an order of the profiteroles. We were not expecting such a beautiful presentation, but this sculpturally scrumptious dessert was a treat for the eyes and the taste buds. Three puff pastries were filled with ice cream and topped with drizzled chocolate sauce, powdered sugar, two chocolate sticks, and a generous dollop of whipped cream. As if that were not enough, they added a side tray of extra cream, though that was left untouched as the main body of dessert was substantial enough. This was a terrific ending to a fine meal at Mastro's.", "pics": null}}, {"review": {"des": "Such a great steakhouse! Wonderful food, service was top notch, and the wine list might have more pages than an encyclopedia. <br><br>Had the spicy fish appetizer, a filet and the Brussel sprouts. Dessert was mango sorbet.", "pics": null}}, {"review": {"des": "Great dining experience with a group! <br><br>We visited Mastro's for dinner last night with a group of twelve. We had a reservation at eight and were seated right on time. It was not very busy. Our server and all of the staff were excellent. <br><br>We had a few bottles of wine, and I enjoyed them all. We didn't see any other drink options on the menu. We ordered some appetizers and salads to have before our meal. They also brought out a nice bread basket. The tuna jalapeño appetizer was very good! The oysters Rockefeller were not as good. I had pieces of shell in both of my oysters. They also were not baked as long as I would have preferred. <br><br>For our entree, I ordered the 8 oz fillet. Others in my group all ordered steak or seafood. The steak was well cooked and seasoned. I really enjoyed it. I also tasted some of the lobster, and I was really impressed. Some of the other group favorites were the Kansas City ribeye, the ahi tuna, and the sea bass. We shared several family style sides which were all excellent. My favorite was the lobster mashed potatoes. Overall, dinner was very good.<br><br>We didn't have any extra room for desert, but their offerings all looked delicious!", "pics": null}}, {"review": {"des": "Not much to say that hasn't been said - an absolutely stellar meal from start to finish. <br><br>They have a very dark interior, white linens and very good staff. We looked over their extensive wine menu and ended up all getting different drinks. Two of my companions got the lobster bisque soup to start and MAN were these huge bowls. They both devoured them and seemed to enjoy to the last drop. <br><br>We got an assortment of steaks, some scallops and sushi. For sides we chose the asparagus and the scalloped potatoes. The potatoes were killer. For the price though, I do wish the sides were bigger. We had 5 people and each person only got two sticks of asparagus. <br><br>Service was top notch - so were the prices, beware you WILL drop a ton of money dining here. Naturally there are no prices on the website and it's too dark to take a pic of the menu, but think along the lines of a $65 tiny steak... that is literally JUST the steak. Don't get me wrong they were delicious - but be prepared to come out with lighter pockets.", "pics": null}}, {"review": {"des": "Had an absolutely wonderful experience here at Mastro's Chicago tonight. Ambiance is warm and dark and what I expect from a Chicago steakhouse.<br><br>We started with the seafood tower which was a cornucopia of crab , lobster tails, jumbo shrimp, and oysters all served on a two tier iced tower with dry ice and condiments. This was pure foodgasm and over the top. <br><br>We then had a small salad. Not too much to talk about here and I ate as little as possible to save room in the tummy.<br><br>Our entrees were the filet, NY steak, and bone in pork chop. All meats were served on a sizzling hot plate and cooked to perfection. My favorite was the pork chop , cooked to perfection and served with sides of asparagus, mashed potato and mushrooms. <br><br>Lastly was the buttercake. Oh yeah, the buttercake. Give me my buttercake! A perfect end to the evening and one of the highlights of the meal. N", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/x_5iYNBar4hQ5bTABuusbg/168s.jpg", "caption": "Seafood tower"}]}}, {"review": {"des": "This is probably one of my favorite steakhouses in town and that is saying a lot considering Chicago is the Mecca for steak. The restaurant definitely has an older ambiance and vibe but the staff is extremely friendly and very familiar with the menu and offers great suggestions. This restaurant appears to be on the higher end but we have gone there for casual drinks and had a great time. I recommend it for parties or just a quick drink before a show. Mastros is one of those hidden gems in the city that only the locals know about. It's convenient location adds to the appeal and I recommend everyone try this place at least once if you are looking for a fabulous steak. Highly recommend!! (They are great for birthdays too!!)", "pics": null}}, {"review": {"des": "What can I say that hasn't been said?<br><br>As a first-timer, I didn't know what to expect. All I'd heard was \"ORDER THE WARM BUTTER CAKE\".<br><br>My husband made reservations, we showed up on time, and were given the option to sit in the lounge or in the dining room. Since there was awesome live music in the lounge, we chose the lounge. <br><br>I'll get straight to the point: the ribeyes, mac and cheese, creamed spinach, and even the house-made bread were on point. ALL were delicious, fresh, and cooked perfectly.<br><br>Then, the warm butter cake came out and I almost cried. That cake is no joke. IT IS THE TRUTH. <br><br>The best part of my meal was learning this wasn't a Chicago only establishment. I didn't even know Mastro's was in California, so when I go back home, you can bet I'm gonna find Mastro's and make it my go-to spot.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/VMeuLReVqsFfh95FmMj1JQ/348s.jpg", "caption": "Not baaaaaad! Loved the Gorgonzola Mac & Cheese!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/H-swFPIv-8kHOoSvR5JjFg/168s.jpg", "caption": "The pretzel bread....yum!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/_0Y2x0kx2mUB7w9X9a-CrQ/168s.jpg", "caption": "This Mastro 's Signature Warm Butter Cake is life."}]}}, {"review": {"des": "I've been coming here for almost a decade, whether for business dinners or date night with my beautiful bride, it has always been consistently perfect.<br><br>The steaks is remarkably flavorful and cooked to perfection. The sides are plentiful, the drinks are creative and tasty. <br><br>On this night (date night) my wife and I shared the porterhouse for 2, snap peas and the house salad. I added the roasted bone marrow. and of course drinks, What a perfect meal. <br><br>Modern beautiful space, friendly great service <br><br>With all the great Primehouses in Chicago both old and new, and we tried them (almost) all,  Mastro's remains on our Top 10 Steakhouses that we go to every year", "pics": null}}, {"review": {"des": "Fantastic deserts, and the cocktails are well made - but at these prices you're going to be left wanting more in both quality and quantity. <br>My fiancé and I ended up spending $250 before tip,  which for a fantastic meal could have been well worth it and lead us to reminisce about it but alas, the prices are far fetched for what you get in return. <br><br>Just some base examples - the 50$ steaks don't come with sides, ok - no problem so you order a side, $14 for Brussels sprouts and that's what you get. No fancy nuts or bacon or onions mixed in, just the sprouts with some pepper. The $18 gnocchi is a small pan of gnocchi, nothing special... you get a couple spoonfuls each if you're splitting it.<br>Cocktails. At 18$ each go to Franklin Room, much better cocktails worth that price. <br><br>The creme brûlée was amazing, and the butter cake as you've seen in other reviews was absolutely incredible - the whip cream somehow doesn't melt and makes you think that's the way all whip cream is supposed to taste. But outside of the desserts and the drinks you're better off even at Wild Fire, or Joes Seafood if you're looking for your fish fix. <br><br>Finally the kicker - $15 for a single pat of truffle butter on my streak. Truffle butter was presented as one of two options and I chose not realizing that was extra. And there you have it. It slid off onto the hot plate and disintegrated. SAVE YOUR CASH, plenty of other places to check out in the city.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/vr6dQGx3TIFOfafNM2_UGA/348s.jpg", "caption": "Oh those prices - $15 butter pat anyone?"}]}}, {"review": {"des": "Hurts the mind, body and soul to give Mastro's a 3 stars but this one is the weakest one I've been to around the USA. Travel frequently for work and I have 3 Mastro's in driving distance to me at home so I'm regular. <br><br>I might have to blame it on the time. We came at 5:30 on a wednesday and the place was DEAD. I also the kitchen wasn't crankin like it usually is. Bread was cold and my steak was nothing special. Lacked flavor which is so odd cuz they usually have the best flavored steaks. They saved themselves with their buttercake which is always top notch. <br><br>Unfortunately, dont think I would come back to this location again", "pics": null}}, {"review": {"des": "Very high class environment. Mastro's have really made a name for themselves in Chicago! Came here for a friend's birthday and the service was great. Our server kept coming around to help us and ensure that we were satisfied.<br><br>Everything is always fresh and carefully cooked. I enjoyed a couple lemon drops and a big shared meal with friends. My only complaint is that it is really just overpriced. I agree with some other yelpers that yes I understand the fine dining aspect, but Mastro's makes it hard for the younger generation to dine here.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/jv-lTbL-s-ogh-hokm6rgg/168s.jpg", "caption": "Lemon drops"}]}}, {"review": {"des": "We had a wonderful experience per usual. This is one of the best steakhouses in Chicago. Steaks and sea bass were cooked to perfection. Kyle was our waiter and he did a phenomenal job. He was very professional and attentive throughout the entire night. Highly recommend!!", "pics": null}}, {"review": {"des": "6 of us went here for a business dinner Wednesday night.  We had drinks in the bar first and everyone there was amazing!  Our waitress couldn't have been nicer and everyone working there was very attentive.  Onto the dining room and our waiter and his team bent over backwards to make sure our meal was perfect.   We had a mix of seafood and steaks and of course, the most amazing desserts!   Drinks were great, service was great, food was great - what more can you ask for?  Oh - I know - how about they called me then next day just to see how or meal was!  <br><br>This was my first time to the Chicago location but have been to the manhattan location as well - will certainly be back to both.", "pics": null}}, {"review": {"des": "I consider myself a bit of a foodie yet I never leave reviews either negative nor positive on any social media platform.   At the most I post pictures on Instagram but that is about it.  I have been to Mastro's Chicago countless times and have always enjoyed it along with several other locations in other cities.   The food is always great and the service is always consistent.   This time in particular I happened to be dining with my newborn child who was sleeping in a car carrier.  Upon making the online reservation I specified we would be dining with baby in tow yet when we arrived there was an older female host with blonde hair that seemed completely caught off guard and rude about the fact that we were dining with a baby and out right made us feel not welcomed.  Immediately another much more polite host stepped in and sat us at a table.  We live in the city and plan to dine with our child when In reason (i.e. 5:30 pm) He slept the entire time and didn't make a peep nor did he inconvenience anyone.   The rest of the staff was great and respectful.  It is in my opinion that at minimum this rude host needs to be trained to at least hide her facial expressions when she doesn't agree with a guests dining decisions and as my mother would say she needs an attitude adjustment.", "pics": null}}, {"review": {"des": "I had dinner reservations yesterday at 6:00pm. We arrived early and was seated right away in the room with the live music. We were sat in a corner booth and the look was very romantic. Romantic and extremely dark. Our waiter was phenomenal (can't remember his name) but he came right over and was able to make great recommendations on the drinks, main course and the different types of steaks that were on the menu. He checked on us periodically to make sure everything was going well. The experience was awesome. The piano bar was a great added touch. I liked the song selection and it was very entertaining. <br><br>Now... the food: DELICIOUS! I had the lamb chops with the lobster mash potatoes. Both items were filling and tasted great together. I passed on the $15 truffle butter. My boyfriend had the steak and garlic mashed potatoes and he also said his food was good too. For dessert, I ordered the warm butter cake. Much to my surprise, they did present my boyfriend with a complimentary cake with the personalize plate with my boyfriend age and name! I didn't have to remind the host or anything. I just put the request on my reservation. I thought that was so awesome and it surprised both of us! <br><br>Overall, it was a great experience and my boyfriend enjoyed himself. Great birthday dinner! The restaurant was not crowded and that could be do to the timing of our reservation. I appreciated the valet only being $16.00. <br><br>I give Mastro's 4 out of 5 because of the prices and the lack of lighting. I'm all for ambience but it was extremely dark. Also, I understand and expect the high ticket prices attached to fine dining but I also think the cost is inflated because they can do it. Don't get me wrong, the waiter explained how the meats are the finest, the seafood is the freshest. I understand you have to pay for quality but still don't mean I like it. I've been to more expensive places and had less of a good time and I've been to less expensive places and had just a good of a time. <br><br>The cost will not keep me from coming back to Mastro's. I am thoroughly impressed with the restaurant and will recommend it to my family and friends.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/wv_27fKiQAoQnEBjl_O3kA/348s.jpg", "caption": "Dream Berry cocktail"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/DD_lCVnxKbvHNLzorVa22Q/168s.jpg", "caption": "Mastro's Signature Warm Butter Cake Chocolate Sin Cake - complimentary birthday cake"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/pM9zDr3c86yYIPqtGG0RGQ/168s.jpg", "caption": "\"Chef's Cut\" New York Strip 20oz with Garlic Mashed Potatoes"}]}}, {"review": {"des": "I've only been here for private events, but each time the service and the food were great. This time around, I had the seared ahi tuna, caesar salad, petite filet, garlic mashed potatoes, steamed broccoli, creamed spinach and the warm butter cake. Ahi tuna was good, caesar salad was mediocre, the filet was exceptional, mashed potatoes were super buttery, the broccoli was al dente, can't really go wrong with creamed spinach and the warm butter cake was decadent and tasty. Mastro's is one of my favorite steakhouses in Chicago.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/_v2rfIcKUohVX46hMl6cMA/348s.jpg", "caption": "seared ahi tuna"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/U8UNr6BAgcSN83DJJGIr5A/168s.jpg", "caption": "warm butter cake"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/A-rJQP1z0d6UiXD1CVhMdg/168s.jpg", "caption": "petite filet with garlic mashed potato, creamed spinach and broccoli"}]}}, {"review": {"des": "Had a great meal and was only made better by great service from Lauren. The filet was awesome and the sushi was just as good. I will be back to try the lobster bisque and butter cake!", "pics": null}}, {"review": {"des": "My boyfriend and I came here twice so far, once for Valentine's Day and the other for a celebratory dinner. The food and service are absolutely phenomenal! They have an extensive wine and cocktail list and are very generous with their sangria portions. I always order the 8oz petite filet mignon which looks tiny when it comes out but ladies, I can assure you that you will be full from it. The filet is perfectly seasoned and oh so tender...drooling. My boyfriend always orders the 22oz bone-in ribeye which he claims to be the best he's ever had. As for sides, the lobster mashed potatoes and Alaskan king crab black truffle gnocchi are delicious but will make you stuffed, so you're better off choosing one of the heavier sides to share. The sides come in two sizes but the smaller one is enough for two people. We also get the asparagus (sautéed is more flavorful than grilled) which is always a classic when paired with steak. And last but not least, dessert. Two words: BUTTER CAKE. Holy moly it really is as good as they claim and is perfect alongside the Intelligentsia coffee that they serve. <br><br>All in all, Mastro's is #2 in my list of top steakhouses. The ambience is formal but the live music is a great touch. Bavette's is still #1 for me and has more of an intimate and romantic ambience.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/lcYewofZvm3VcvguXx69Aw/168s.jpg", "caption": "Bone - In Ribeye"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/78DD49Yj-e1Pm53N_-9dLQ/168s.jpg", "caption": "Mastro 's Signature Warm Butter Cake"}]}}, {"review": {"des": "I loved the food at Mastro's. I ordered the Filet, and it was cooked to perfection. The plate was still sizzling, so the bottom was made with a nice crispy edge similar to a cookout over a grill. The service at the bar was spot on. My barkeep was personable, but not overbearing and he was efficient with a full bar. They had a live duet in the bar area that was not over the top in terms of decibels. <br>The decor is cliche steak house. Dimly lit with your wood and dark colors on the walls, bar, and furniture. It was so dark, I felt like an old man turning on my phone to read the menu. As usual as in most steak house bar areas, the room was all old guys with the corporate card having drinks. <br>I can imagine that this would be a great option for a large dinner party, since you can share the sides. Additionally, it looks like reservations are almost a must.", "pics": null}}, {"review": {"des": "Thank Bill an staff for helping me celebrate my engagement had my grandson come out when we ordered desert", "pics": null}}, {"review": {"des": "so apparently they strictly enforce the dress code here but wasn't aware...yet my boyfriend was able to slide through with his gym shoes even after one of the hosts scanned him up and down (phew!)<br><br>i got the petite filet (8 oz) and my boyfriend got the bone-in ribeye (22 oz). for sides, we got the lobster mashed potatoes and sautéed asparagus. i think we could have done without the asparagus, but other than that, great food! loved the mashed potatoes - definitely recommend just getting that if you plan on getting a side. otherwise you will be STUFFED.<br><br>we were so full after finishing our entrees, but we haaad to order the recommended butter cake! it was good - had fruit and ice cream, but i've had better butter cake before in NY at Del Frisco's so wasn't as impressed as other reviewers on here.<br><br>overall though, good service and good food.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/fLStb5tY25awJqMg_N_N0Q/168s.jpg", "caption": "Mastro 's Signature Warm Butter Cake"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/SSaX4gQqss7vg9uz4McnCw/168s.jpg", "caption": "petit filet 8 oz with lobster mashed potatoes and asparagus"}]}}, {"review": {"des": "Update visited again while we were here! Thy delivered again! Ambiance, food, drinks...spot on! <br><br>We came here for drinks and appetizers and we're we in for a treat!! It was so much more than drinks and food! Live music, amazing ambiance, melt on your tongue food, drinks that wow you, and an experience to remember!!  Several of us had their signature martinis, cosmo, Apple tini, lemon drop Tini. Unlike anything I have ever had, they tasted amazing, looked magical and were more like 2.5 drinks in one! Served with a colored sugared rim and dry ice these packed in the flavor. We had a few plates of the shrimp cocktail, largest shrimp I have ever seen, bone marrow, crab cakes, bread, and the butter cake for dessert. Truly food heaven!! Our waitress was absolutely fantastic!! Bri called us by name, took her time to make sure we always had what we needed, answered our questions and made our experience over the top!!  The lighting was a very dim, even hard to read menu. But who cares, you can see to eat drink and talk and listen to the live music! Best place in Chicago to go!!<br><br>This will be my go to when we visit Chicago...this is how all others will measure up! Well done!", "pics": null}}, {"review": {"des": "Nikki was our server - she is amazing.  Very friendly and accommodating.  We had the bone marrow for appetizer.. i am not sold! Lets just say it is an acquired taste.<br>The steak was great - and the sweet treat after was even better.  The butter cake did not disappoint and we also ordered lemon Sorbet (which was ok, had better though).<br><br>Over all great experience, would love to go back", "pics": null}}, {"review": {"des": "The best. Service was great. Apps and sides were delicious.  Steaks were cooked to perfection. <br><br>We were there on a Saturday night and sat in the dining room which was very nice. However, it looked like the lounge was hoping too!! It was full when we left at 8, can't go wrong with either sitting area.", "pics": null}}, {"review": {"des": "AMAZING. Food was unreal loved the lobster Mac and cheese, amazing service not too pushy. Perfect place for a fancy occasion. I got the petite filet no topping and the steak was so flavorful and I have NEVER had a steak without a side sauce. We started with the cold appetizer tower with shrimp etc, you could do without if you didn't want to splurge but definitely spilt some sides for the table they are amazing and steak was perfect. We finished with the signature cake dessert which was great and large portion (sides were large portions too).", "pics": null}}, {"review": {"des": "Stopped by here for a business meeting and I was so excited to try Mastro's! I am so glad that I had the opportunity to because I had such a great experience here. These are the things I had:<br><br>- Petite filet: perfectly medium rare and tender.<br>- Creamed spinach: the spinach was delicious and well done. Flavoring was good and not too creamy.<br>- Mashed potatoes: creamy and so good.<br>- Brocolli: plain and crunchy. Not overdone.<br>- Warmed butter cake: this thing is amazing. so buttery and delicious!! <br>- Cheesecake: also very good.<br><br>We sat in a private room so I can't comment on the restaurant itself, but our waiters were so friendly.", "pics": null}}, {"review": {"des": "Best steakhouse I been too great food ,great desserts, great service wine alittle over priced but overall everything was great", "pics": null}}, {"review": {"des": "Mastro's provided dinner for our group one night and it was fantastic. Very impressive especially considering that they catered it. Hard to pull that off. The steaks were perfect. Also had lobster tails, king prawns, and snow crab legs. All ready to eat.", "pics": null}}, {"review": {"des": "Exceptional service! Came here for hubby's work function and were taken care of. Sorry peeps, but Mastros was closed to a private function! We had seafood tower, salad, steaks, sides and dessert! Warm butter cake to be exact! I know I might have made the waiter work harder when I ordered 3 espresso martinis  (for my die hard caffeinated alcoholics), chamomile tea and sparkling water but that's what I do! Anyway, food exceptional as always.  Yes I'll come back !", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/tHg4bw55Vk5LTeDiH_Lbnw/348s.jpg", "caption": "Chamomile, Espresso Martini and Sparkling Water cause you must hydrate, get buzzed and soothe your throat!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/AT0sgKr52d-OQiHSaXcJbw/168s.jpg", "caption": "Yes please"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/igfbplM3OqBYE4C7wqyoEQ/168s.jpg", "caption": "Warm butter cake"}]}}, {"review": {"des": "I really enjoyed this place. Given that I took the women in my life their on mothers day I expected a very pricey bill and of course it surely was !! LoL <br><br>The food was delicious and the alcohol was refreshing! <br>Parking of course is metered parking unless you valet somewhere close.<br><br>Sidenote: side dishes are al la carte... hope that helps someone out!", "pics": null}}, {"review": {"des": "If you're lucky enough to get Parker as your server then buckle up and enjoy the ride. I have been to every steakhouse in the city and not only was this the best service but the best food we've ever had. Get the butter cake. You're welcome.", "pics": null}}, {"review": {"des": "The best part of dinner here is always the lobster Mac! This has always been a go-to place for my friends and I, so we do dine here often. There are times the steak is cooked perfectly and other times, it's just not right at all. With that said, their onion rings and mac n cheese are both out of this world. Service is always excellent and the environment is always pleasant. Definitely a must try.", "pics": null}}, {"review": {"des": "Had an award dinner here with some top accounts & it was fantastic. <br>We had a room upstairs that had a built in bar with a fantastic bar tender, poured a great class of Cabernet with a great smile & nice personality. <br>They have a great wine list & can make any cocktail you can imagine. <br><br>They served several hor dourves from steak tartar to crab cakes that were awesome. <br><br>The entrees were equally awesome, everyone at our table had various steaks you! <br><br>The sides were all delicious as well & even though there is no room for it, you must do there signature butter cake! <br><br>This place is everything you expect of a great steak house.", "pics": null}}, {"review": {"des": "Really great restaurant. The food and service was outstanding. Went on a busy night and it was a bit loud. But great live music! Lively cool Chicago restaurant! Great bar too!!", "pics": null}}, {"review": {"des": "This review is for the lounge area, not the dinning room or their food! <br><br>I would say, however, that the dining area looks elegant, and the cuisine, as well as the menu looks terrific too! BTW: The food smells delicious.<br><br>The reason we've never eaten here is because we have always come on the weekend for after-dinner drinks and live music. They have an amazing wine selection, good cocktails, and honestly, I would say just an okay beer selection (I'm a beer guy). The options are mainly craft beers, which is perfectly fine, but the selection is surprisingly slim. I also believe, for example, that a can of Daisy Cutter is 25% higher here than other bars a block away (e.g., $8 versus $10, the latter of which is the cost of a 4-pack at the store).<br><br>This should give you an idea of their prices overall. <br><br>Nonetheless, the mark-ups are probably because the lounge is nice and the music is free. I would also call it elegant, but, being honest, it is always crowded on a Friday or Saturday night. We usually get lucky and a table opens up. (It's seat yourself in the lounge). At other times, we've been unlucky. It's definitely not a typical bar vibe either; more upscale. So we're not about to stand around in a crowded lounge with candles and white table clothes. So, we politely leave when there is nowhere to sit.<br><br>Attire tends to be business-casual to a formal (e.g., dinner dress/suit and tie). I've always felt comfortable here in a button up shirt and collar--no tie.<br><br>The staff is usually swamped, yet attentive, professional, and courteous. For being so crowded in that room, it is remarkably clean, which nearly always also includes the washrooms, especially the set upstairs with an attendant.<br><br>So, although it's expensive, we enjoy listening to their live musicians play for us, and it's also a cool place to unwind after dinner.<br><br>We'll definitely be back!", "pics": null}}, {"review": {"des": "Great! <br><br>We made a 5:00pm reservation for 4 on New Year's Eve at Mastro's and had no problem getting in. I did have to add my credit card to my reservation since it was a holiday, so that was kind of annoying. The bar area did have live music which was a nice touch!<br><br>We sat in the main dining room which is your typical dim-lit steakhouse atmosphere, it's a very cozy spot. Our waitress was so sweet and patient with us as we asked so many questions. I ordered the roasted chicken which was seasoned to perfection. My husband and his mother split the porterhouse, it was huge. My father in law ordered the Petit Filet and he enjoyed it. For sides we had Brussels sprouts (added some bacon steak which was perfection) and macaroni and cheese. Since it was a holiday, we couldn't help but order desserts. We had chocolate cake and their famous butter cake, which is as good as it sounds. <br><br>If you're looking for a great dining experience and willing to pay a little more, check out Mastro's. I plan on returning and sitting in the bar area.", "pics": null}}, {"review": {"des": "Best dinner experience I've had in a long time. Service and staff are fabulous. The location of our table made us feel like we were having a private dining experience. The ambiance was perfect, the noise level was perfect. Food and drinks were to die for. We didn't enjoy our sides as much as we expected but they were not bad. The steak was absolutely perfect in every way and I will be returning for every family birthday.", "pics": null}}, {"review": {"des": "Our 3rd time to Mastros in Chicago . <br>Amazing service, & everything but the steak was amazing. I know it's so odd. It's a high end steak house. But the steak seriously had zero flavor! No salt paper nothing. And the since the steak comes on a super hot plate, my med rate ended up medium by the time i was going in for my second bite. If they told the customer to order a temp tire down and seasoned it just a tad it would be 5 Stars no doubt. <br>With that being said, the chopped salad was great!! The sides.... lobster mashed potatoes & creamed spinach both amazing! <br>Best part was the dessert butter cake!! Omg you have to get it. Comes out so warm, smells amazing & melts in your mouth. <br>Omar our server was beyond amazing! So friendly, educational, & delivered A+++ service. <br>If they can do something better with their steaks this place would be the best in town.", "pics": null}}, {"review": {"des": "Had high hopes, been to a Mastro's before and the experience was a 180 from what I've experienced before. <br><br>From the interaction with the hostess (cocky, arrogant) to the food, poor experience. Had a bone in ribeye with king crab legs, ribeye was cooked poorly (ordered medium rare, got medium well.) The crab leg was bland, not sweet at all.  Steak was bland and lacked taste, no marbleization, the toughest ribeye I've tried to eat. More like a strip steak. The side dishes were greasy. <br><br>The butter cake was good and added a star.  We sat waiting for drinks regularly much of our time there, the wait staff was poor at best.<br><br>$400 bill and some of the worst food and service I've had in a long time.  I hope it was a one off issue, but I likely won't go back to this location.", "pics": null}}, {"review": {"des": "Great Chilean Sea Bass! Dress code business casual. Pricey yes  but a great dinning experience. Deserts were way to good! It was a great place to meet with co workers on a Friday night for drinks and dinner.", "pics": null}}, {"review": {"des": "Took my husband here for his birthday this weekend. We had our reservations at 8pm waited about 20-25 min I guess because they were waiting on people to get up and leave ‍...so why even make reservations....once we sat down at our table everything changed i gotta say we both agreed on this place being the best steak house we've ever been to In Chicago. We have been to quite a few steak houses in Chicago but this one is by far our favorite. Food, service, drinks, music, dessert! GeeZ was I stuffed and In love with this place. Our waiter Miguel was awesome FYI! We will definitely be back to this place!", "pics": null}}, {"review": {"des": "I was extremely excited to be dining at Mastro's. When you see $$$$ on Yelp and someone else is paying it adds to the excitement.  However, there are high expectations.  I have an excellent palette and also pay attention to details. Food is one aspect of a dining experience. Service is another. Mastro's fell short in both areas.  <br>I was with a group of coworkers as well as my bosses. The waiter started to explain the menu but apparently wanted complete silence because he stopped mid sentence and made a passive aggressive remark.  I know he gets his tip on a big party regardless... I honestly think that rule should change after his attitude.<br>I have experience in fine dining restaurants.  I believe quality of food is getting worse and places like Mastros think if they put some dry ice under some bland shrimp cocktail they can charge outrageous prices.  I ordered a ribeye \"oscar style\" and got a mini crab cake with no asparagus.  When I asked about the missing asparagus tips he motioned across the table and said I think someone ordered asparagus side dish and proceeded to walk away. Really?  One piece of soggy asparagus made its way to me eventually but I'm sure the added cost of the \"oscar\" deserved fresh asparagus tips.  The cocktail I got was good.  The crab gnocchi side was delicious. And, the butter cake was goid<br>I would spend my money elsewhere.  I emailed Mastros and they have not responded, leaving me to believe they do not care.<br><br>Update... <br>the Manager called to ask me about my experience. He stated he wanted to \"gather all the information \" before calling me back.  I did ask why it took so long .  I had originally emailed and waited over a week with no response before writing my review.  After the review posted is when I got a response... he said something about just getting my email.  I know they're busy so I'll give him the benefit of doubt.  However his response and questions made me uncomfortable in that I felt he didn't either believe me or was making excuses.  I was in the restaurant world once and only wanted to help them.  I did not pay for the meal.  But it did cost me in many ways for the \"pleasure \" to dine there.  He ended the call telling me to ask for him the next time I dine with them and he would make sure my experience was better.  So basically I would get one good meal for twice the price?!", "pics": null}}, {"review": {"des": "This place has gone downhill. Last two visits have had terrible front of house experiences. <br><br>Server was a fraud. Tried to serve a wine that was wrong vintage and looked like a kid with his hand in the cookie jar when I mentioned it. <br><br>The only saving grace is the steak was great. But when you are sat an hour late for a reservation and all they can offer you is some flat prosecco, to try and pacify the problem, it's obvious you're management are clearly not paying attention. Hostess team needs experience. Management team needs to get better. <br><br>Sad, as I used to like this place locally but also in other locations across the US.", "pics": null}}, {"review": {"des": "I ended up here randomly with a group of four. We sat at the bar, which made for an interesting dinner dynamic, but most of the tables in the bar area only seat 2 or 3. We ordered two bottles of wine, scallops, crab legs, shrimp, steak, and a twice baked potato. There was plenty of food to go around, and everyone seemed to enjoy what they ordered. The service was impeccable, and our bartender was extremely thoughtful. The bill came to about $800 (due in part to the wine we chose), so be prepared to spend.", "pics": null}}, {"review": {"des": "I enjoyed Mastro's Steakhouse. The service was excellent. I had sea bass, lobster mash potatoes and asparagus. DIVINE!! Live music which I usually hate because it always reminds me of the movie... The Wedding Singer. I enjoyed the singing which surprised me. The dim lighting, elegantly dress staff, pretty people and good cocktails made a great night for a late dinner. The only thing that I didn't like was standing and waiting for a table. <br>I was impressed because although it was crowded ... the hostess came directly to us in the crowd when it was time to seat us. I was for sure they would miss us seeing we were out of sight. <br>Classy!!", "pics": null}}, {"review": {"des": "Steakhouse in Chicago! A classic landmark, dark woods, aged beef. Good wine list, make a reservation. Nice for a date night special dinner because it is pricey $$$. Try the butter cake for dessert! Sooo good, enough for two to share. I had the filet, lobster mashed potatoes, and The gnocchi is so good too! White table cloth, fine dining restaurant. Sautéed mushrooms! Leave room and go hungry! So filling. Side are family style to share:", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/eTKOWUKRGi1RuXmJ-_YCzw/348s.jpg", "caption": "Lobster bisque! With real chunky pieces of lobster."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/GLkC7KNmRO0xD-iYkL1Y0g/168s.jpg", "caption": "Breadbasket is so good with garlic butter!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/bJmCDYhgWX5_8v_967nvBQ/168s.jpg", "caption": "Butter cake dessert with homemade whipped cream."}]}}, {"review": {"des": "For years I have heard everyone praise, refer to and slobber all over Mastro's like its the best steak falling out of the sky. So for our monthly friends dinner one of my good friends chose this place for the June edition. I walked in and saw the place was very dark...like real dark LOL. Very classy joint as they have the liquor cabinets out and it has that white dining cloth that most classy joints have. Majority of our group was on time so we grabbed a seat at the bar. Patrons and bar team were very conversational and genuinely nice people so it made the wait pretty fun. FYI, this is one of those places that will not seat your group if one person is missing so make sure all of your people are on time. <br><br>Once seated in the main dining room, we got a nice booth that fit 6. We instantly started ordering wine and an abundance of appetizers.<br><br>Creamed Spinach...good<br>Gorgonzola Mac & Cheese....yummy<br>Sautéed Asparagus...good<br>Garlic Mashed Potatoes...good<br>Shrimp Cocktail....awesome and very good presentation with the smoke<br><br>I went with the 16oz New York Strip which was very good, but I could not finish it due to all the food flowing everywhere; not to mention the upcoming desserts. The Key Lime Pie was nothing short of amazing and the Warm Butter Cake...wohoo!!! Damn!!! That was some good cake along with some nice vanilla ice cream! Wow! that was good! Our server Justin was a good guy. The other guys that were bussing the table were a little funny sale though. They even gave me the wrong box as I wanted to have my steak the next morning and it was leftover sides mashed together in the box. My friend quietly ate my leftover NY strip in which half of it left...damn, damn damn!!!!", "pics": null}}, {"review": {"des": "Love the lobster cocktail!  We added two shrimp a la cart. Always a fan of the Gorgonzola Mac & cheese and the petite filet.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/cCtIk3O9ViSA8eADJM_73Q/168s.jpg", "caption": "Lobster Cocktail & added 2 shrimps"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/2Z2hsuZTzwjqAM2XrEml2Q/168s.jpg", "caption": "Cocktails, half a Petite Filet, and Gorgonzola Mac & Cheese."}]}}, {"review": {"des": "This is probably the best steakhouse I've ave been to! Excellent service, atmosphere, and ambiance! My steak was cooked perfectly! Spinach was supreme!", "pics": null}}, {"review": {"des": "We went here last night. Once we FINALLY got someone to service us we were off to a better start. I had the shrimp cocktail and house salad (it was kinda late for me to be eating). I have no complaints  I loved my food. And the service picked up once we were acknowledged so I'm happy.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/n0lrvTaNcZd9hOa7lmRN0g/348s.jpg", "caption": "Shrimp cocktail"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/rUytjQcZJtgUA1jHHE3PQQ/168s.jpg", "caption": "My cousin got the lobster mac n cheese (HUGE SERVING)"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/TsQTv5_Jqmh5Xr8ydHYf1A/168s.jpg", "caption": "House salad (comes with a shrimp in it)."}]}}, {"review": {"des": "It was a stone blast... I had a spectacular time at Mastro's, it was one of my better experiences. I cut my review short in fear of typos, because their drinks are euphoric. Lol lol.", "pics": null}}, {"review": {"des": "My cousin had recommended my boyfriend and I go here for a date night in Chicago and I am so happy that we did! From the amazing food, to the beautiful atmosphere, and the wonderful music, it deserves 5 stars (and more)!<br><br>I got two sides for my meal, the Black Truffle Black Gnocchi and Lobster Mashed Potatoes. Both were out of this world! Talk about some serious carbs. Do I regret it? Not at all. Would I do it again? Absolutely. My boyfriend got the Bone Inn Rib Eye for his meal and said it was one of the best steaks he has ever had. I'm not a huge steak fan myself, but still tried some of his and thought it was pretty darn good. The bread we were served while we were waiting for our meal was also great! I was trying not to fill up on bread before my meal, but I couldn't stop eating it!<br><br>Even though we were stuffed from our main course, there is always room for dessert so we decided to try the much raved about Warm Butter Cake. The Warm Butter Cake was served with a heaping spoonful of vanilla ice cream and a generous portion of their homemade whipped cream on the side. Now I understand why people had spoken so highly of this dessert! It was incredible!<br><br>As if the food wasn't enough, I was also very impressed with the atmosphere. My cousin suggested we ask to be seated by the bar and it was a fantastic idea. We got a comfy, but romantic, table right in front of the band. The fantastic band and dim lighting really made this a great spot for a date on our last night in Chicago. <br><br>I will most definitely be returning to Mastro's during our next trip to Chicago! I'm already looking forward to my next carb overload and that Warm Butter Cake!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/bI9sSy32QpG8BKuMlw5KCA/168s.jpg", "caption": "Mastro's Signature Warm Butter Cake! Simply AMAZING!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/EoA9KCvZXeAZdUdeSQUIHg/168s.jpg", "caption": "Sazerac and Elderflower Martini"}]}}, {"review": {"des": "The steak (and that char...damn!), the warm butter cake, the \"colossal\" onion rings, the warm pretzel bread, the massive mac-and-cheese...there was a lot to love about my first experience at the Chicago Mastro's location.<br><br>The service was fantastic and the team here was surprisingly accommodating towards young kids (I brought a three-year-old and an 8-month-old to dinner for a 5:30 reservation this past weekend).  The space is beautiful, and the private dining options upstairs also looked fantastic, even if I thought the bar and the pop music covers were just a little cheesy.<br><br>The only misses were a couple of the sides we tried; the brussels sprouts were a complete miss for us, and the wedge salad was only OK.  But the other dishes more than made up for this and next time we will do a better job of asking our server for better side dish recommendations from this menu.<br><br>A great experience and that steak will be tough to beat.  I miss you already, warm butter cake!", "pics": null}}, {"review": {"des": "Took my boyfriend here for his birthday. We enjoy going to different food places, but I decided I wanted to go to a high-end place. Plus everyone suggested this place to me. <br><br>Yes I was expecting to pay a GOOD penny, as we got seafood and steak. The waiter saved us from getting more seafood for the seafood tower as he was very knowledgeable on how much seafood a couple can handle haha- keeping in mind we got steaks too. <br><br>The steaks were EXCELLENT. Worth the price for sure. Were even good re-heated for lunch the next day, and that says a lot. <br><br>Overall this place has a romantic and chill feel. I felt really relaxed and super ~fancy~ at this place for sure. Nice live music in the bar area. <br><br>One tip is to expect to spend a pretty penny, don't be surprised if your bill is steep- but it is worth it. For sure suggest this place for special occasions.", "pics": null}}, {"review": {"des": "Definitely THE place for special occasions!<br><br>I honestly think that it is impossible to make a poor choice, here - the 12 oz. filet is more than enough, and the Chocolate Pudding Cake is extraordinary - you'll taste chocolate, not sugar.<br><br>Bar staff is pleasant, personable, but not at all intrusive - my Stoly Elite gimlet was perfect.", "pics": null}}, {"review": {"des": "I went to Mastro's as a last hurrah dinner while in Chicago and I expected it to be good but I did not expect to be absolutely blown tf away. I ordered the 12oz filet and I've never actually had a steak melt in my mouth even though I tell people \"oh my gawddd it melts like butter\" NO I WAS LYING, this steak though?! This steak... hit your tongue and melted in a way that can be described as how your heart feels when in a lovers embrace. It tasted like someone took all that is happy and magical in this world and seared it to a crispy perfection. For sides we ordered the wild mushrooms and garlic mashed potatoes, I don't think I could have ever loved fungus or spuds more than I did in those 120 so minutes we were here. And before any of this even happened, I ordered the French onion soup. I can't physically wrap myself around how incredible their soup was. It was a cup of cheese topped miracle. My taste buds were not singing, they were dying, going to heaven, and then being reincarnated with every succulent bite. Never in my life have I dressed up so fancy for a nice restaurants and said \"screw it\" and ate every single bite of my food to where I left the restaurant looking every bit of 7 months pregnant because I couldn't physically hold my happy and filled gut in. Thank you Mastro's. THANK YOU FOR MAKING ME FEEL ALIVE THROUGH YOUR FOOD.", "pics": null}}, {"review": {"des": "My favorite place on earth. Parker was my waiter he was awesome! Can't go wrong with anything on the menu! Good eats!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/lpgeGlKXLPDMJ_06DUDvOA/348s.jpg", "caption": "Infamous Mastro 's Signature Warm Butter Cake yum"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/kAYfY0Y-jjc0oQko1656kg/168s.jpg", "caption": "Filet with Lobster Mashed Potatoes Mac and Gorgonzola Mac & Cheese and Broccoli - Steamed or Broccoli - Steamed or Sauted yum"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/1_jdKyi_J4SuZCW5wynVcQ/168s.jpg", "caption": "Lemon drop"}]}}, {"review": {"des": "This is my favorite restaurant in Chicago. We took our family there once again and had a wonderful dining experience. The smoke salmon appetizer was over the top. All veal, lamb and strip steak were done to order. we had to pass on the butter. Are just too full. our server Kelly was very friendly and responsive to our needs. Hooray again for a memorable dining experience .<br>Can not wait to come back<br><br>Kathleen and Bill Wagner", "pics": null}}, {"review": {"des": "First time at Mastro's Steakhouse. My partner and I were both extremely disappointed at many aspects of this high-end restaurant.<br><br>We had made a reservation days in advance, and the restaurant staff in fact called the day before to confirm. Given that, I would have expected them to be ready to seat us when we arrived promptly at the appointed time - which was an early seating with little chance of \"slow diners\" failing to vacate. No such luck. We did our part, why can't these restauranteurs do theirs?<br><br>And when finally summoned into the dining room (past a chaotic bar area with mediocre but loud band), we were given seating with one chair into the main aisle - which meant I was continually bumped by staff and other customers as they went by. I foresaw the issue and suggested to the host that this might not be the best, but couldn't get them to find a different table.<br><br>I will note that this is the first time in my life that I've paid well over $300 for a dinner for two - in which we had only two mixed drinks and NO wine. With tip it was pushing $400. Absurd.<br><br>The restaurant was incredibly chaotic and loud, even without the band. It's one of these restaurants that they've designed to \"enhance\" the noise instead of managing it properly. <br><br>For many this should be a deal-breaker - fine dining should NOT inhibit our conversation and limit it to shouts, nor should the waiter be required to shout at the diners. This is a huge fail.<br><br>The food was mostly first rate. Oysters on the half-shell as an appetizer were much too small and I wouldn't order again. The steaks were high-quality - one of the best filet mignon's I've ever had. One of the sides we ordered, mushrooms with truffle butter sauce, arrived with no evidence of the (very expensive) truffle butter. In my experience items with such an expensive component are finished at the table to ensure patrons they are getting what they've paid for. <br><br>Portions were typically Chicago much-too-large, and we left with a shopping bag of uneaten food as did most in the restaurant. What's the purpose of such largess? <br><br>All in all we wouldn't go here again, and likely not their companion restaurant in Chicago either.", "pics": null}}, {"review": {"des": "This place has the best food and great service. Right when we walked in, we were seated right away even without a reservation. Our waitress, Lola, was super nice and told us all about the menu and helped us choose the right meals. The Chef's Cut (New York Steak) was so good and had amazing flavor. I highly recommend this restaurant, especially if you're a sea food lover because they have tons of options. They also have a ton of cocktail, wine, and many more options for drinks!!", "pics": null}}, {"review": {"des": "Service: Great attentive staff. Our waiter was fun and knowledgeable about the menu. <br>Food: Tuna Tartare - I must admit it. One of the best I ever had. <br>Beef Carpaccio- good as well, very generous portion. <br>As main course we had lamb chops, sea bass and halibut.<br>As Sea Bass was really delicious, moist and nicely seasoned unfortunately Halibut was completely dry because was over cooked. Lamp Chops were kind of salty. Our onion rings and green beans as a side dish were to our satisfaction.", "pics": null}}, {"review": {"des": "I've been coming to Chicago on business for the last 8 years and have tried my fair share of steak joints but this is hands down my favorite. It's not cheap but well worth every dollar. It's now part of my repertoire and come here without fail. <br>They have a good selection of red wines, particularly like their Oratorio Gigondas or Brunello selections. <br>We generally share some starters, this time we had the tuna tartare which comes on a bed of crushed crackers, Rockefeller mushrooms and steak sashimi, can never have too much steak. My favorite cut here is the Ribeye-on-bone. They also have some very good sides my go-to's are the creamed spinach, truffle mushrooms and gorgonzola Mac & Cheese...just writing the review is making my mouth water. Needless to say we didn't have any space for dessert and nor did I want to wash away the beautiful taste left on my tongue. <br>I gave it one less star as the server we had definitely rushed us, for the amount we're paying I want to relax and enjoy a good meal. As soon as the last drop of our first wine was poured we immediately had a menu showed in our face to select another. <br>Lastly, make sure to make a reservation as it's hard to get a walk-in table, in case you're lucky to get one it's close to where they have a live music which makes it tough to have a conversation.", "pics": null}}, {"review": {"des": "I've been to this restaurant few times. Last week I went there with a larger group. And this place is great for it since they have large comfortable booth. <br>They have a complimentary coat check and if you're in a mood for just a cocktail and great live music (Friday night band was a maxing) then you're welcome to sit at the Piano Bar Lounge. There's also second floor and private dinning rooms. <br>Have to warn you about their martinis... it's not one glass it's the whole shaker, so if you were planning to have only one drink this is the wrong choice. I enjoyed their French martini. <br>For main course I had 24oz porter house (yes, this girl likes to eat) and before I had salmon, both dishes tasted great! For side dish I like to order lobster mashed potatoes (you read it right Lobster) and creamed spinach. <br>This time I couldn't resist their desert, so we ordered cream brûlée and Mastro's Signature Butter cake (take me back).", "pics": null}}, {"review": {"des": "1st, don't trust open table for reservations. I was able to call and get a reservation next day. <br><br>Ordered the chef's cut 33 oz rib eye. Delicious. Waiter said it was big enough to share. And it was definitely big enough to share for 2.<br><br>Got the lobster mash and that was okay. Very few pieces for lobster but was a very large portion for $40. Was kind of annoyed the waiter just defaulted us to the large order instead of asking or suggesting. So in the end we had to take 70% of the mashed potatoes to go. Only to find 1 more piece of lobster in the leftovers, I guess they are trained to scoop the lobster onto the plate to make a good first impression.<br><br>Butter cake was amazing. We were both stuffed at this point and said we can only take a few bites. Managed to eat half the thing. <br><br>Would come back for butter cake.", "pics": null}}, {"review": {"des": "This is my number one favorite steakhouse in Chicago. The ambience is nice and the staff is very fast, efficient & polite. If you are ever looking for the best cocktails, appetizers and steak this is the place to come to. Ive been coming here once a year for about 5yrs now. I absolutely adore this restaurant. I have sat on the piano bar side and in the dining room. I suppose it depends on if you're in the mood for loud music or not lol but over all this is the best steakhouse in Chicago.", "pics": null}}, {"review": {"des": "Based on the reviews I had to celebrate my birthday here before going to see the musical Hamilton in Chicago. All of the food & beverages were delicious. That warm butter cake...OMG!! It is so good! Diego was our server; he was so helpful & attentive. I will definitely be back.", "pics": null}}, {"review": {"des": "Filet Oscar style with a side of lobster mashed potatoes. Full of flavor, plated beautifully and worth every penny. If I could give more than 5 stars I would. I never leave this place hungry or unsatisfied.", "pics": null}}, {"review": {"des": "Mastros is always great, but last night we had an even better experience because of our waiter.  I think his name was Jeffery, but he was a tall dude with a big beard. He was fantastic! <br><br>Not only was he very attentive and went out of his way to make our experience perfect (including a tasting of his favorite bourbon and letting us have smaller sides), he was hilarious. He made sure to know our names, and made my boyfriends birthday special. It's refreshing to have a waiter that isn't rude or boring or awkward or just meh, especially at a high end place.  Sometimes you question why servers that are like that are in this industry. But seriously this guy is working in the perfect industry for his personality! We seriously wanted to offer him a job at a friend of ours steakhouse. <br><br>The food itself was amazing as always, highly recommended! Thanks Jeff for a memorable meal.", "pics": null}}, {"review": {"des": "Perfect!  Kyle, our waiter was amazing!  Food spectacular.  No complaints!!  Excellent service!!", "pics": null}}, {"review": {"des": "My favorite restaurant in chicago!<br>Prices are very reasonable for what you get, awesome service and the food is SO GOOD!! Sit in the lounge though, dont sit in the restaurant, its dark and quiet and you feel like youre at the dark country club on sunday in there, the lounge has a cool bar high tables, live music most nights on the piano.  the food is UNREAL so so good!!<br>the tuna sliced appetizer is the best thing on the menu over carrots", "pics": null}}, {"review": {"des": "The best steak (porterhouse) and best dessert (butter cake) I've ever had in my entire life. Mastro's is exactly what you think it is; top notch service, white tablecloth, pricey but worth it. <br><br>My fiancé and I love this place so much it's where we had dinner the night I proposed! And every time we've gone back since it never disappoints! <br><br>Very expensive but worth every single penny!", "pics": null}}, {"review": {"des": "Great food, great atmosphere, and friendly staff.  If you want a great quality steak, this is your place.  Cooked to perfection, and the fresh sides were a perfect complement to the steak.  We found the staff to be very friendly and knowledgeable, and they really made us fem right at home.", "pics": null}}, {"review": {"des": "One of the best steakhouses in Chicago, even though it's a chain. Our server Tim, was top of the line for service. <br>We(3 of us)started with a delicious ahi tartare with avocado. The iceberg wedge is a favorite and this was chopped which made it easier to eat. <br>We had never had top grade wagyu beef so we splurged and tried a 10 oz NY Strip which came sliced. It was a unique experience to have beef so tender it melted in your mouth. It was very rich because of the buttery fat, almost like eating foie gras. We think we like less fat and more meat. An experience worth having though. <br>My salmon with a side of shrimp was perfectly cooked. The sides were good with the baked potato very big with a nice selection of condiments. The sautéed spinach was also good.", "pics": null}}, {"review": {"des": "Enjoyed our 35th wedding anniversary at Mastro's.  Very good service in an excellent fine dining establishment.<br><br>We split the chopped salad and enjoyed a petite filet and a NY strip, with mashed potatoes and truffle oil mushrooms.  Desert was the pecan pie.  All were superb.  Great wine selection too.<br><br>Yeah, it's pricey, but well worth it. We'll be back.", "pics": null}}, {"review": {"des": "Memorable dining experience worth the money spent on it. Came here on a special occasion and was completely  blown away with the food  and service. <br><br>Reserved a week in an advance for a Friday table around 9pm. Staff was professional and the ambience was a perfect combination of vibrant and upscale. <br><br>Waiter was super knowledgable and attentive to our table. Portions are HUGE. Easily order only 2 sides for a party of 4. <br><br>Appetizer : <br>Sautéed shrimp  <br><br>Entree <br>New York strip medium well done <br><br>Split sides : <br>Lobster mashed potatoes : divine combination of hearty potatoes and lobster  ( HIGHLY RECOMMEND) <br><br>Asparagus sautéed : mediocre side nothing memorable( DO NOT RECOMMEND ) <br><br>Gorgonzola Mac and cheese : cheesy overload of perfection. ( HIGHLY RECOMMEND ) <br><br>Desert :<br>(Split amongst all 4) <br>Mastros signature warm butter cake : <br>Homemade whip cream poured over a warm butter cake <br><br>Experience , food and service is highly recommendable!<br><br>Roughly $100 a person.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/zsqdOd0XWMP-v2wP4t5-Hg/348s.jpg", "caption": "New York strip with sautéed asparagus and lobster mashed potatoes"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/OJjNj4_um3tWHCwzrcu_2A/168s.jpg", "caption": "Mastros signature warm butter cake"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/06JMmjKlm2LOgpT58IKRvQ/168s.jpg", "caption": "Sautéed shrimp"}]}}, {"review": {"des": "My favourite steak restaurant in Chicago. Had the sushis and tuna tostadas, super good.  The bone in filet mignon amazing.... Lamb chops are<br>Awesome... My daughter had the halibut, and said it was great. The service excellent. And to close the indulgence, we had the chocolate cake.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/RkR0tOAKnhV_drREtVD9Pw/348s.jpg", "caption": "Lamb chops"}]}}, {"review": {"des": "MASTROS gave my date and I the total dining experience! The ambiance, food and drinks (dream berry) are grade A. I will definitely dine again mainly because of the level of service we received from our waiter Omar- he was outstanding total rockstar in fine dining.", "pics": null}}, {"review": {"des": "As someone who is a big Billion Dollar Buyer fan I went to Mastros with a a bias as to how good it was going to be.  Someone in Chicago also told me it was their favorite steak in town.  I WISH I agreed with them, but definitely not.  It was a good steak, but not even close to my favorite in Chicago.  The service was excellent and its obvious that the server was very well trained.  She knew everything about everything on the menu!  For the prices, the meal did not even come close to being what I expected.  The tuna sashimi was ok, but would not order it again.  Also, the bar area is SO dark that its almost weird.  Not a bad spot, but definitely not worth the prices.  If I'm paying that much for a meal, I'll go to RPM.  My meal was a 6.5 out of 10 at best.", "pics": null}}, {"review": {"des": "Excellent service super steaks and food don't watch your dollars and worth it. I go offen and am never disappointed. Drinks are the best out of this world. Dessert is a must", "pics": null}}, {"review": {"des": "It's not too late to pop in for the Restaurant Week 2017 menu!  You've got a few hours left, tick tock tick tock.  <br><br>I have been to Mastro's several times, this location just once and the location out in Orange County, California, many times.  Each time I leave in awe.  The combination of service, quality, and ambiance is second to none!  <br><br>The Restaurant Week menu consisted of a small selection for each course, three total.  I started with the jalapeno tuna sashimi.  I don't even like tuna but it was the only item on the appetizer list that tickled my fancy.  The tuna was sliced thin and was soft, fresh, and mild.  There was also just the right amount of soy sauce/sesame oil (or whatever the sauce was on the plate).  For the second course I ordered the 6 oz. steak, of course.  6 oz. sounds a little bit on the smaller side, it is, but it was the perfect size considering the additional consumption of an appetizer and dessert.  I ordered my steak medium rare and my husband ordered his medium.  When they presented us with our steaks, they gave my husband a medium steak and gave me a well done steak.  To be honest, I think they switched up the plates.  Did my husband want to hand me my order?  No way, I wouldn't be able pry that medium steak out of his cold dead hands, it was too good.  The medium steak was also delicious, the right amount of seasoning, but it was too dry for my liking.  But like I said, still good overall.  And for the third and final course, I ordered the butter cake, just because you can't go to Mastro's  and not order THE butter cake.  <br><br>Overall it was a wonderful experience.  I will definitely return!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/FOBb454Kgwz6RzC7pgr2-A/348s.jpg", "caption": "Butter cake"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/6g1EJhYtEJyKydOYN8IC0g/168s.jpg", "caption": "I asked for it medium rare ... it was not what I wanted but still good"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/OImCJJvwLAEnRmCILJy4WA/168s.jpg", "caption": "Restaurant week 6 oz steak"}]}}, {"review": {"des": "We had reservations here and we got seated within 5 minutes of arriving. This restaurant is very dark and has a cool, somewhat romantic vibe. Our waitress greeted us immediately and the ordering began. The bread basket had multiple choices in it, but it wasn't impressive, plus our waitress kept telling us not to fill up on bread (I'm sure that's a restaurants biggest fear) She scared me so I didn't eat any. The steaks (filets) were good, just good. Drinks were fine, kinda weak. Cokes were $5 each and apparently I was charged $5 for refills, because I only ordered 3 cokes (2 refills) for a $25 charge. that was a first. Totally absurd actually. Look this place is good, not amazing. Nobody in my party has any interest in returning. Honestly, the service was good, and the server was always checking on us, (really too much it was kinda annoying) she was like an experienced car salesman. She really got us with an almost $200 appetizer of Seafood Tower. Every single shrimp, clam or crab was an individual charge. The shrimp on it was good, but the lobster was somewhat dry. Fleming's has an almost identical seafood tower with sauces for much less. <br>Look, If I was on a dinner budget I wouldn't be eating at Mastro's...but don't take advantage of your customers. No matter, the meal was fine.", "pics": null}}, {"review": {"des": "Went to Mastro's for my Dad's birthday. The hostesses were pretty stucked up. Not sure why. I mean do you even have to have a college degree to be a hostess? They looked like they were picked up from a strip club. I know that's mean but when you treat customers like trash, you deserve to be treated like trash as well. But unfortunately my experience with them wasn't so long and deserving to take down anymore than 1 star. Our waitress was phenomenal. Very attentive. Very friendly. And definitely knew the menu inside and out. I lived in NYC for 5 years and had the best steak of my life there. Nothing will compare. But I asked her about the porterhouse and how it compares to Lugers/Wolfgangs but she was very honest and admitted she never was there so she wouldn't know. I appreciated the honesty. <br><br>We got the lobster as a cold appetizer. Very fresh tasting and decent portions. For steaks my mom got the Filet - Medium Well. Don't ask me why she got it that way, but it was pretty bad. I trust that it would've been better if it was medium or rarer but I'm blaming my mom for this one. My dad and I split the porterhouse. Thought it was great. Definitely not like Peter Luger's or Wolfgangs but just as good. Also please please get the lobster mash potatoes. Phenomenal!!!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/q0WCZN76613y_ngNrG6_7A/168s.jpg", "caption": "Porterhouse for 2"}]}}, {"review": {"des": "This is the best steak house I have ever been to.<br><br>The ambiance is perfect, low light.<br><br>The service is 5 stars itself, the staff here makes sure you are taken care for and are very attentive.<br><br>The meal was out of this world, I had filet mignon with lobster mac and cheese and mashed potatoes.  No one else compares.", "pics": null}}, {"review": {"des": "Mastro's is a quality, classy place.  I've been here for drinks a few times, but not for dinner (yet).  Service is always quick, there's always an open seat in the bar area, the decor (especially the lighting) is memorable, but what really elevates Mastro's is the live jazz.  It's definitely the music that causes me to choose Mastro's over so many other fancy River North bars.  Now I just need to earn a special occasion to enjoy the full meal experience.", "pics": null}}, {"review": {"des": "Came here last night for the first time with a some colleagues/clients.  We had a really nice time and the food was great.  I had the filet and we shared a bunch of apps/sides like tuna sashimi with jalapeños, Mac & cheese, Brussel sprouts, seafood mashed potatoes and creamed spinach.  Overall it was good but insanely expensive- not sure it's really worth the price.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/FPjevanBI6UG5YNU7qJSEA/168s.jpg", "caption": "Omg"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/L_y6Ynvww7_oAAuIzC3C4g/168s.jpg", "caption": "Salad?"}]}}, {"review": {"des": "Anniversary dinner date was so special thanks to our awesome & very attentive server. It is pricey but worth every penny. Top notch service, good eats & great music background.", "pics": null}}]}