{"name": "maudes-liquor-bar-chicago", "reviews": [{"review": {"des": "Six of us went there last Saturday to celebrate a birthday.  We have been to Maude's several times.  Wonderful vibe, wonderful food, wonderful service.  French dining without the formality.  Can't go wrong with anything on the menu.<br><br>Wanted to especially acknowledge Alexandria.  Found out that it was her last night as a trainee.  Fooled us all. She was great - attentive, knowledgeable about the menu, and happy to make recommendations.", "pics": null}}, {"review": {"des": "Ohhh Maude's you were amazing..  Great food, great atmosphere, great service.  It was my wife's birthday.. 28th to be exact.  everything went according to my plan that would ensure a great evening and brownie points for me.  <br><br>The only hang-up was that we made a reservation for 8:30 and did not get sat until 8:50, which resulted in us being there until 10:30.  <br><br>So, I'm docking them 1 star like the privileged millennial that I am!<br><br>So there!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/VDYmiwUnNiHQuN-IoFDB1Q/348s.jpg", "caption": "Farm Chicken"}]}}, {"review": {"des": "Outside of dessert and cheese, I don't partake in French cuisine that often. That is why I was ecstatic to come to Maude's for a romantic date night. The ambiance reminds me of listening to a Cigarette After Sex song... dark, sexy, slow burning, and nostalgic. It's the type of place that makes you want to take a mental snap shot of how great and fabulous your life is so you can retrieve it for inspiration when life gets more chaotic. <br><br>We started with rum and vodka smashers and the the French onion fondue. The vodka smasher was perfectly blended and flavorful. The rum smasher was a bit too strong and hard to get down. <br><br>I highly recommend the French onion fondue. It tasted like the most creamy, decadent, and cheesy French onion soup you've ever had. <br><br>I opted for the cassoulet and my boyfriend got the steak. The cassoulet was absolutely delicious! It paired white beans, duck confit, garlic sausage and pork belly. I usually opt for a lighter fare and was surprised by my choice - but I was so glad I got it! I couldn't stop eating it and was blown away by the layers of flavors. <br><br>The steak was juicy, tender and overall delicious. <br><br>The staff was attentive but not overbearing. <br><br>Overall this is the perfect place for trendy couples with a romantic soul.", "pics": null}}, {"review": {"des": "Three words: French. Onion. Fondue.  Its the reason I stopped in and the reason I keep coming back (aside from the great service, atmosphere, oh and the creme brûlée).  I normally wouldn't jump on the idea of going out for French food, however, everyone raves about this place and it hasn't disappointed. I like it because it is relatively easy to get into (only need to make a reservation about 3 days in advanced), its in the west loop so you're close to other bars for pre/post dinner cocktails, and everything I've tried on the menu has been delicious.  My favorites are the French onion fondue (even my friend who \"hates\" onions would've licked the bowl had I let her), the steak tartar, gnocchi, burger, muscles, and the creme brûlée.  Maude's is a great spot for date night or girls night.  Its so easy to get a yummy bottle of wine and appetizers to share.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/67-smrNafkoPeymg62Uscw/168s.jpg", "caption": "the famous French onion fondue!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/gELjJ4m-xt1ys7VnNDse7A/168s.jpg", "caption": "caramelized deliciousness"}]}}, {"review": {"des": "Best French food I've ever had! Came here on a date night and got to experience the romantic atmosphere (dimly lit lights, close seating, the works). The mussels are heaven, and the Pom frites are to die for! We were feeling particularly decadent and threw in some oysters and French onion fondue (oh my god the fondue....)<br><br>Come here and go all out. It's worth it.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/F1nkRZX5-1WHVSic6hqFZQ/348s.jpg", "caption": "Oysters"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/dJedWySs93Kf7cQrBVWtbw/168s.jpg", "caption": "French Onion Fondue- amazing"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/XHC0sRn_edDpNcEagIt0cQ/168s.jpg", "caption": "Mussels"}]}}, {"review": {"des": "Food: French onion fondue was AMAZING! Maude's steak was too chewy, salty, and pricey!<br>Service: Service was slow. After we got our food, it was difficult to get the server's attention.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/IL4MrVBIM18opqjBj7wonA/348s.jpg", "caption": "Maude's steak"}]}}, {"review": {"des": "I've hit every other major restaurant in the Hogsalt restaurant group, save for High Five Ramen...I'm delighted to say that Maude's is just as good as Bavette's, Green Street Smoked Meats, the Chevals, and Gilt Bar, while capturing the same interior feel as the other restaurants in the family, which I love to death.<br><br>Came in for dinner this past Saturday with five others, and sampled about a third of the menu.  This included both the steak and salmon tartare, the ratatouille, the mussels, the burger, the gnocchi, the fondue, the escargot, the cheese plate (Delice de Bourgogne), and both desserts (creme brulee, chocolate mousse).  I also tried four different cocktails, including the smokey violet smash, the sazerac, the St. Germain fizz and the Eastern Sour.<br><br>Look, it all worked.  Maude's has almost a thousand reviews and is on the Bib Gourmand list (the reason why we were there, since I'm working down the list), so it's got to be good at something, but now I know it's great at everything.  We also got out of here for about $80/person, so if you can have world-class food for under a hundred bucks a head, you do it!!", "pics": null}}, {"review": {"des": "I can't decide which I like better: the drinks or the decor. <br><br>I've only been to Maude's for drinks, but man, am I in love. Their house red wine was only $6 and easily better than almost all $13/glass wine I've had elsewhere. And my fiancé loved his gin and lemon cocktail called 20th Century. Even though he was initially embarrassed that it looked \"girly,\" he said it was probably one of the best drinks he's had, ever. <br><br>AND THE DECOR. Omg. It's a dream. Dimly-lit and classy, this place is perfect for a date night (or date night drinks). You have to pass through a heavy velvet curtain after the door to even enter Maude's, and chandeliers all over the ceiling give it a super romantic vibe. It's like speak-easy meets romantic French restaurant, and I love it. <br><br>As soon as we left, we decided we need to come back. And if not just for drinks, maybe even for dinner. On paper, a $42 steak scares me a bit, but everything about Maude's made their dinner prices look totally worth it.", "pics": null}}, {"review": {"des": "Last Friday, a couple friends and I had an early birthday dinner here. I'm glad we made a reservation because the space is intimate (read: small).<br>There are a few tables outside, but most of the seating is inside. You will likely be sitting very close to the table next to you.<br><br>Our server was attentive and friendly. We started with drinks and escargot. Their (green, not yellow) chartreuse smash is a truly a treat. The escargot comes with 6 pieces (and plenty of warm bread) so it's perfect for 2-3 people to share. I ordered the mussels for dinner. The portion is large with lots of broth. It was very good, but nothing special. My friends liked the tartare and the burger. We were too full for dessert, but our server brought us a sweet anyway. <br><br>Overall, enjoyable experience! I'm sure their cocktails will lure us back soon.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/jC0AdJ1XIuTJv38vECA4TQ/168s.jpg", "caption": "Escargot"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/3hJW9UWa1Mdr-ZofGetY2A/168s.jpg", "caption": "Mussels"}]}}, {"review": {"des": "This is more like 4.5 stars but I'm rounding up. <br><br>Just came for dinner tonight with the fiancée. He raved about the salmon from a prior trip and the couple next to us got it - it's huge! Smelled really good. We got 6 oysters to start and the shaved vegetable salad. Wow. That salad was sizable, fresh, acidic, just a killer way to start a meal! Highly recommend. The oysters were also very fresh and crisp. For our meals we had mussels and the pork and split Brussels sprouts. Sprouts were very good. The mussels were fabulous - some really fat ones in there! The baguette that came with it was spot on, as you'd expect from a French spot. His pork was like a schnitzel, thinly pounded and breaded. Very good but a little heavier than my meal. <br><br>My only complaint is that it was a bit slow. Our waiter didn't come by for long periods of time and our oysters took quite a bit of time to get. Total meal time was about 1.5 hours, although the last 15 minutes or so were me drinking jasmine tea so that's my fault haha.<br><br>Would return, although there's so many new places to try I'm not sure I can say I'll definitely return.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/0pOIU2vP7pjjsnVX-WRaxw/348s.jpg", "caption": "Steamed Mussels, Brussels Sprouts, Pork Paillard"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/yGCV6k0sAbD9tslBPYUUzw/168s.jpg", "caption": "Pork Paillard and Brussels Sprouts"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/e9b2SFo0POEz5_QssJ24mw/168s.jpg", "caption": "Atmosphere"}]}}, {"review": {"des": "What an amazing evening !  James our server was helpful and charming.  He explained the menu and we just smiled at all the wonderful choices.   We decided on Mussels to share as an appetizer.  Best taste I have ever had.  The French Gimlet  was the best drink ever.  We then had the French onion fondue and ricotta gnocchi.   Fondue was good but gnocchi was OUTSTANDING.  Skipped dessert, but would recommend to everyone.", "pics": null}}, {"review": {"des": "We only had drinks at bar while waiting on au cheval but the service was great, the ambiance was great, the good others had looked great. Will definitely go back. Loved the smashed drinks yum", "pics": null}}, {"review": {"des": "Maude's is absolutely fabulous. There's no other place like it in the West Loop neighborhood. I loved the ambience, cocktails, food, but most of all the service. We ordered the steak tartare and the pork paillard. The tartare was salty but they took it back no questions asked and gave us a new one, which was much better. The pork was also excellent and was very happy with the portion. I can't wait to come back.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/k6MZFdIQ-lJ8XFzrfFEPFQ/168s.jpg", "caption": "Pork Paillard"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/cCHBfcBzUyFoPg4yo1QVVA/168s.jpg", "caption": "Tenderloin Steak Tartare"}]}}, {"review": {"des": "We had a reservation at 8:15. We arrived on time and they told us that it would be another 30 minutes until we could be seated. They encouraged us to go to the bar next door and said they would call when our table is available. They called us at 8:45 (we told them we were on our way) and we arrived back within two minutes, only to have them tell us they GAVE OUR TABLE AWAY. We waited another 30 minutes before leaving. Awful service.", "pics": null}}, {"review": {"des": "French style food in a restaurant ambiance with dim light and lots of great food!  The group of friends selected this one and I loved my steak. It's a huge portion but if you enjoy good meat that's prepared well with truffle salt and bernaise sauce you will be pleased.  My friends had the beef tartare and raved about it! We also shared a salad lyonnaise with incredible dressing and pork belly that was mouth watering delicious!! Amazing chocolate mousse for dessert we shared but it was truly phenomenal!!Good service too. The busy neighborhood is full of restaurants so we did a ride share.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/062l-mmy-KZS0qJF_q8qWg/348s.jpg", "caption": "Roast Farm Chicken"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/c-2f2LFLeqYzdhBihVZ68Q/168s.jpg", "caption": "Gnocchi"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/E3eXgNUtSRnJOLq6Zbzcqw/168s.jpg", "caption": "Maude 's Steak"}]}}, {"review": {"des": "Ok so snails for the second time<br>Best snails ever<br>They come with a butter herbs mix it's so so so so good<br>The music is not super loud you can't  speak over it., so mellow and chill<br>The food everytime is amazing - the steak tartare was AMAZINGN and the bread that came with it was warm and fresh and the chicken and salmon our friends ordered was phenomenal <br>The violet smash drink was such a hit<br>We all got different smashes before all different and amazing<br>But the violet smash was so so good they all got it as the second drink", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/MbrgHMaQfni5dDtrZie4oQ/348s.jpg", "caption": "Just checked-in, been 4 be4 I loved everything Let's see how they perform late at night They texted us on time when our table was ready"}]}}, {"review": {"des": "Only came here for drinks for the review will be short. The preset cocktail list is decent, but the preparation of the drinks is flawless. Everything tasted delicious, the staff was very welcoming and accommodating to requests. Besides having very tasty high-end drinks, they had a $3 whiskey shot. So not only can you have well crafted drinks, but you can also get your night started with very cheaper liquor. Dimly lit but classy, highly recommend for a place to start the night, if you're taking the classy route.", "pics": null}}, {"review": {"des": "Went again this week. Still love it.<br>Bibb salad is huge with a nice dressing. We LOVE the lentil side dish.  We shared the chicken, which was moist and tender and delicious. The pommes frites are a must.<br><br>For drinks we had a Sazerac (a little sweet for my husband's taste but I loved it) and Boulevardier (a little bitter for my taste but husband loved it).  See why we get along? :)", "pics": null}}, {"review": {"des": "Joyce, Luke and I flew in to Chicago to see Thomas and Nicole and they booked us at Maude's on our first night there - great choice!  Expertly mixed cocktails to start at their fast paced and packed bar.  Place had an ultra cool, sophisticated vibe, dimly lit and gave us the feeling that we were smart enough to know this was the place to be!  Tenderloin steak tartare garnished with a perfect slow cooked egg yolk ($21.95) was tasty enough that even the 16 year old tried it AND LIKED IT!  Escargot ($16.95) was off the hook good served, like the tartare, with fantastic crunchy chewy bread.  Luke had the $17.50 cheeseburger with caramelized onions on the perfect toasted brioche roll and he was quite happy.   While the youngster ate that, we indulged on the Maude's Tower ($=don't ask) brimming with lobster, shrimp and oysters and it was all fresh and awesome.  We split the Pork Paillard ($19.95) and it was so good we demanded the recipe.  Braised lentils ($9.95) were awesome, too.  Great first night in Chicago at a great, professionally managed, cheerily staffed must go to place.", "pics": null}}, {"review": {"des": "We spontaneously stopped here for a quick patio dinner in between happy hour and going out. I got a tequila smash after eyeing one at another table, and this was deliciously refreshing. We also had some mussels to start, which were tasty- the broth and bread were great. The fries were also delicious too. I enjoyed the nice patio ambiance along west loop as well. Good service, and all in all, a good night.", "pics": null}}, {"review": {"des": "I came here last night around 9pm with a date for drinks after we checked out the Loyalist. Maude's was small, intimate, dark, not too loud, and cozy so this place is perfect for dates. The place was packed so we opted to stand by the bar. The bartender immediately gave us the drink menu. And because it was so dark, we actually had to use the flashlight on one of our phones to look at the menu. Not a complaint, just a little embarrassing that my eyesight is so poor. <br><br>I ordered the French Gimlet and she ordered Death in the Afternoon. Both drinks were fantastic! They were both sweet, refreshing, and the cocktails didn't taste like pure alcohol. Prices were right on point for cocktails in Chicago. And to be honest with the quality of the cocktails, I would say they were on the cheap side. I will have to come back and try this place for dinner sometime!", "pics": null}}, {"review": {"des": "Mauds Liquor Bar seems to know how to do it right  Well executed restaurant with fine food.  It's very nice to know you are pretty much guaranteed a great dining experience.  The staff is pleasant, attentive, and unpretentious.  Not a lot of choices on the menu, but all the right ones for me.  Quality not quantity!  The restuarant is French with a twist of a more relaxed atmosphere.  I think the name is misleading,  because it's more upscale then part of the name implies  \"Liquor bar.\" <br><br>The appetizer,  French onion fondue was more like a spinach artichoke dip consistency, but wonderful, deep rich onion flavor with crusty cheesy top! Yum!   The chicken crispy outside and tender inside.  Must try the mushroom gnocchi, I don't even like gnocchi, but I loved this dish.  So.... venture out to West Loop and enjoy a great evening.  I almost forgot A+ great date atmosphere, or a grown up kind of place to hang, yah.  You'll see.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/TpjJyA8Sw1uLt02kprsm7A/348s.jpg", "caption": "Dinner"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/BzjLJ-PS1vDZTAB7AV825Q/168s.jpg", "caption": "Bar area"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/B8TiQREx61Pqeburb40eNw/168s.jpg", "caption": "Maudsfirst floor"}]}}, {"review": {"des": "Maude's is a cool spot in a very competitive area. The drinks are very good, the food is good, the service is good, and the decor is cool.  <br>Would be rated higher in many areas, could be rated lower for this particular area. Still a solid 4 stars", "pics": null}}, {"review": {"des": "Loved the food here. Execellently executed French food with an awesome atmosphere. Loved the tartare as well as gnocchi.", "pics": null}}, {"review": {"des": "It is a pity when a restaurant with good food, location and atmosphere is deteriorated by its staff.<br><br>I walked in this evening at 8:30p.m. only to be told there was a 1 hour wait list.  5 tables where fully open.   <br><br>I proceed to get on Open Table immediately, to make a reservation.  To my surprise, full immediate availability at any time. <br><br>After making my reservation, on the spot, the hostess so entitled was so rude and sloppy in showing us to our table, that I proceeded to walk out.   I asked to speak with a manager, and she declined.  I was not going to make a scene and proceeded to walk out quietly.<br><br>Pity that this happens in a restaurant that I frequent at least twice a month.  Plenty of competition in the neighborhood with so many other options.   <br><br>If this is a marketing technique, I would recommend their management team to snap out of it.   It only took us 2 minutes to walk out and get a great meal across the street....  :)", "pics": null}}, {"review": {"des": "The food was delicious. We were a party of 5 and we ordered the seafood tower, burger, mussels, chicken, and several other items. It was all prepared very well. The atmosphere is romantic, dimly lit room with intimate ambience. Our service was a little slow. The waitstaff took a while to check on us.", "pics": null}}, {"review": {"des": "By far one of the best restaurant I've eaten in. Great everything from greeting to ordering to service to quality of food to dessert to exit. Everything was impeccable from beginning to end and we were a demanding, unruly gang of diners so this is coming from a tough audience.<br>The bill was a bit high (over $400) for a party of six but the ROI was valid and it made for a memorable experience.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/hcZDMQpaetqavnUufb3xVA/348s.jpg", "caption": "Great ambience (upstairs)"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/LThfT1OFftFZA85g-F3IsQ/168s.jpg", "caption": "Tower Top"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/398yWLdgjpoUREX7OjDDZg/168s.jpg", "caption": "A Cudtom \"Tower\""}]}}, {"review": {"des": "A date brought me here for dinner because I told them that I was dying to try Maude's and had been for over a year. When we got there, we were told our table wouldn't be ready for a while, so we decided to get some cocktails at the bar like the proper grown ups that we were. The main bar area faces the tiny dining area and I have to say it was super uncomfortable to be in a crowd of like 15 people clutching cocktails as we tried not to pour our drinks on seated diners. My date and I thankfully got seated in 20 minutes which was ok but I was pretty exhausted from having to awkwardly mingle with a mix of clueless bros and their more clueless dates. I digress. My date saved the night by ordering a dozen oysters and more cocktails. Also to start with, we had the chicken liver mousse which came with toasted sourdough bread. <br><br>Now, I've gotta say that I had immediate eaters remorse when I tasted the mousse because it didn't really hit me with any kind of remarkable chicken mousse flavor. What I mean is that the chef took more time to mask the chicken liver in the mousse then highlight it. It was almost like he or she thought that the Maude's clientele couldn't handle the realness of a classic French mousse. Honestly, they were probably right. But if you want a better chicken liver mousse, I suggest you go to any other French restaurant in the city. If it's done right, it can't be missed!<br><br>I had the roasted chicken as a main dish and it was also just ok. It was juicy but not as flavorful as the roast chicken I've had at Bavette's... <br><br>Overall it was a mildly satisfying experience. Come here for the drinks and maybe an oyster or two.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/XIWpEJQI0Zc0Emq51_RD5Q/348s.jpg", "caption": "Mmm oysters..."}]}}, {"review": {"des": "This restaurant is very good, however I wish they would get more cocktails that are less champagne based. I understand that it's a French themed restaurant so it makes sense, but still would be nice to have a few other cocktails. The French onion Fondue was amazing, along with the Gnocchi, and Ratatouille. I also like that the portions were small allowing us to try a few different foods. My only complaint was the steak, we asked for medium well and it came out very rare to the point that it was bloody. We still ate it but I was not happy with how chewy the texture was. The steak could have been better.", "pics": null}}, {"review": {"des": "I absolutely love Gilt Bar, Donut Vault, and Bavette's, so I knew I would equally love Maude's and I do! The only reason I am giving it 4 stars as opposed to 5 is the lack of desserts. I die for the chocolate cream pie at Gilt and Bavette's and I thought I would be in for a treat at Maude's but when I asked for a dessert menu, I was told they only have 2 desserts, creme brûlée and chocolate mousse...that's it?! Sadly, I passed. Besides the lack of dessert, my meal was freaking awesome! I dined on the escargot and salmon. I have no words for the escargot besides BOMB. The bread was also amazeballs. The salmon was cooked to perfection and I almost forgot to mention the chartreuse smash....tasted as good as it looked.<br>I dined solo at the bar and had a great time chatting with the staff. They were great company!", "pics": null}}, {"review": {"des": "Overall: Moody, trendy, intimate, and a great (but expensive) choice for drinks.<br><br>The good: Amazing cocktails, both in presentation, taste, and effectiveness. There are plenty of options to choose from, no matter the liquor you prefer. There's also some decent beer and wine options. The atmosphere is also top notch, very cozy and moody with an antique vibe. The food also looked great (didn't get any)<br><br>The not-so-good: The bartender wasn't attentive, even despite the fact that he was literally in front of us. Multiple times we'd be sitting waiting for him to ask for a drink choice. Like the rest of the area, it was expensive. Didn't even get food and the bill was climbing.<br><br>Atmosphere: 9/10<br>Service: 7.5/10", "pics": null}}, {"review": {"des": "A charming spot, but a selective French bistro menu means you either have to be feeling the food or prepared to feed yourself elsewhere. Service was warm, salad lyonnaise and the cheeseburger were easy and filling. Great weeknight dinner.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/K5EE2JWweZkNZh6DLn4mWg/348s.jpg", "caption": "Eastern Sour"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/kjyT4LuMr1Jsmw0NkhlqlQ/168s.jpg", "caption": "Salade Lyonnaise"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/vaHC-W3MkO-V1UbZqobJdg/168s.jpg", "caption": "The cheeseburger"}]}}, {"review": {"des": "Really cool ambience at Maude's Liquor Bar--quaint low light restaurant with brick interior sets the mood for a perfect date night or small group dinner outing. <br><br>We just stopped by for a light dinner/appetizer share and got the Steamed mussels with celery, lemon, pastis and Ricotta gnocchi with butternut squash and sage. The mussels were amazing--the pastis (an anise-flavored French spirit) created a creamy sauce full of rich flavor that complemented the celery and herbs and it left me wanting a second order of mussels! The gnocchi however left room to impress. Perhaps that's my fault for ordering Italian at a French bistro but they gnocchi themselves lacked flavor and were too pillowy making me want more texture in the dish. The well cooked butternut squash and high quality ingredients saved this dish!<br><br>I'd come back to try more of their French cuisine and maybe a seafood tower on a special occasion as they are priced really high.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/aSd7vhKx2DB8gcOUZ6Me5Q/168s.jpg", "caption": "Steamed mussels with celery, lemon, pastis"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/cE9InixqYPx2NJcbpM93mw/168s.jpg", "caption": "Ricotta gnocchi with butternut squash, sage"}]}}, {"review": {"des": "When I made my reservation here I was looking for some place French and nice. The ambience was dark and rustic. A smallish place, so the tables are kind of close together. After arriving I was seated immediately. I ordered the vieux carte cocktail. Very reminiscent of a Manhattan, but no garnish. I had the shrimp cocktail and 6 east coast oysters for an appetizer. The pirates were mundane. They had no brine flavor, they had no flavor actually. The shrimp was excellent. Fresh, briny and not over cooked. For dinner I had the pork for my entree. A huge flattened price of pork, pan fried with a crust. Covered with apples and arugula. It was very good. I thoroughly enjoyed me dinner here, and I'll definitely be back.", "pics": null}}, {"review": {"des": "Maude's is hands down one of my favorite dinner spots in all of Chicago. The food is always amazing and the service is top notch. My husband and I went there on a Friday night which is usually busy. I couldn't remember the name of the drink I like so our awesome server, Nick and the manager made it their mission to guess what it was (which they didn't have to do).", "pics": null}}, {"review": {"des": "The place was just ok. I was not impressed with either the food or the craft cocktails. The price on both was also slightly ridiculous for what you get. <br><br>We ordered two cocktails, the tartar, and a salad and paid around $70.00. I don't mind paying for great service and food, but this place was lacking. The bartender was a little \"stuck-up\" and only warmed up a little after I ordered \"his favorite drink\". The drink itself had potential but I've had better with the same ingredients. The tartar was decent but the portion of meat was small and the cuts/slices of bread were way too big (difficult even to bite into). The salad was just ok, although it did have pork-belly on the side. <br><br>I wouldn't go out of my way to come here, but I wouldn't object if somebody asked me to go back in.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/wQEQP5afO7DsKeEFmZ_adw/168s.jpg", "caption": "Leones (sp) salad"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/oipGTCZ8QHqa7AweguEZaw/168s.jpg", "caption": "Steak Tartar"}]}}, {"review": {"des": "I've been craving French food since I missed the food that I tried in Paris. My friend was curious to try French food so we wanted to come to Maude's to try their food. The interior is beautiful with an intimate French bistro vibe along with the bar in the back of the restaurant. We arrived here when it opened at 5:00PM on a weekday which was the perfect time because we were able to sit at a booth. It started to get crowded by 6:00. <br><br>The highlights of the meal were the Steak Tartare ($18.95), Foie Gras Pate ($17.95), and the Escargot ($15.95). The steak tartare was prepared perfectly and was very tender. The Foie Gras was delicious and smooth and the strawberry jam complemented the saltiness of the pate. The 6 pieces of escargot were small but very tasty since it simmered in garlic butter.<br><br>The cons was that the cheeseburger ($16.95) and the French Onion Fondue ($14.95) were basic. The cheeseburger was very salty that I couldn't enjoy it and kept chugging my water. Don't bother ordering a cheeseburger here when Au Cheval is down the street from here. My friend ordered the French Onion Fondue which was basically cheesy onions. I was disappointed to start the meal with delicious shared dishes (steak tartare, foie gras, and escargot) only to end with mediocre main dishes. The other con was that I noticed that my friend and I were the only Asian Americans in the restaurant. I took a restroom break and when I came back, I saw a sriracha bottle on the table, which wasn't there when we first got the table. I was upset by this and it rubbed me the wrong way (isn't this a French restaurant?). I didn't see any other tables that had a sriracha bottle so it kind of ruined my dining experience. If these cons didn't happen, I would've given Maude's a higher rating.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/8w99sQqczNkhDq3TLtstUQ/348s.jpg", "caption": "Maude's Cheeseburger"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/0YCNDpoFn4g6wcEcalJL1Q/168s.jpg", "caption": "French Onion Fondue"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/TBdtJncp8J9T8uWrDoKWWw/168s.jpg", "caption": "Escargot"}]}}, {"review": {"des": "Started with the french onion fondue and it was very good spread over their crusty, buttery bread. Then the duck liver pate with red onion jam. To me it tasted like Carmel with a hint of onion and the sweet red onion jam on top of it was perfect. Smashed potatoes were the best I ever had. Learned there is never enough butter in potatoes. Just creamy, buttery and the gravy was delicious. Also had the Ricotta Gnocchi. Firm but light bites that tasted like the middle of garlic bread with each bite. Complimented with mushrooms. Just a great dish. Finally we had the roasted chicken which was good. After everything else it was good but didn't blow me away. Overall excellent food. I can always count on a HogSalt restaurant to not shy in butter, salty, fatty goodness. Great meal", "pics": null}}, {"review": {"des": "Absolutely worth going to and spending time. We ate downstairs and had the foie gras pâté with tart cherry jam and the steak tartar. Everything about both dishes was excellent, from execution to taste. The service was great too. When we had questions, if the server didn't know, he would go get answers. Also, attentive without being intrusive, and friendly, not pretentious. <br><br>Will definitely be back", "pics": null}}, {"review": {"des": "Best salmon ive ever had.  I really hope they use quality fresh ingredients.  The drink \"astoria\" is delightful.", "pics": null}}, {"review": {"des": "Drinks were amazing and we got to know the bartender who gave us a lesson in Aperol, a delightful Italian spritzer.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ah14IKgGikwudO1vqss3wQ/348s.jpg", "caption": "Vodka Smash was very refreshing."}]}}, {"review": {"des": "2nd time at Maude's and I still love the ambience! <br><br>It's intimate, yet trendy, and it's the kind of restaurant that puts you in the mood. It's good for small groups or for date night. <br><br>We ordered the steak tartare, which was perfectly seasoned, the half roasted chicken, which was pretty good and was the size to be shared, and the burger that came with crispy fries with a side of aioli. The burger was really flavorful and well made and can almost be comparable to Au Cheval's burger! (I think I would definitely try the pork pillard or the braised short ribs next time because I love heavy flavored/seasoned food). <br><br>Moreover, Maude's have an amazing list of cocktails, so be sure to try one! If not, then share a bottle of wine with whoever you come with. Cheers!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/NhQTZrY5M7Ho5RD8Wnpv2A/348s.jpg", "caption": "Ambiance was great. Make sure to order a bottle of wine to share or try their awesome cocktails!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/96IP8u5tNR8tKzKitheqdA/168s.jpg", "caption": "Steak tartare! Yummm..."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/JiDL8-ec34-tjVI0I1_66Q/168s.jpg", "caption": "Roasted Farm Chicken with parsley and garlic."}]}}, {"review": {"des": "The old adage 'never judge a book by its cover' holds true when it comes to Maude's Liquor Bar. Located in West Loop, I must admit that I as exited the car and saw the exterior of Maude's my first thought was...'this will be interesting'. Thankfully, this ended up being a 'more than meets the eye' place. The exterior is very non-descript with only the name on the door. <br><br>Upon entering I immediately knew I was going to enjoy this place. The ambiance was very laid back and relaxed (perfect for chillaxin) with very low lighting. Additionally, considering the time and the number of people present the noise level was relatively quiet. For me, it felt like I walked into a place which is part speakeasy and part bistro. Maude's is perfect for meeting friends (as I did) or for a date night. <br><br>For an opening (and closing) adult beverage I went with an Old Fashioned which was crafted to perfection. There were a few other adult beverages on the menu which caught my eye (hello vodka smash) that I hope to try during future visits. <br><br>The menu contains enough different options to fit most appetites. Within our group of four we ordered a nice variety which allowed for sharing/sampling. Our orders consisted Moules Frites (from the 'Traditional French' area of the menu), Scottish Salmon, Braised Short Rib and Roast Farm Chicken (the latter three are from the 'Almost French' area of the menu). Having sampled each entrée, I can say it would take entirely too much typing to describe each entrée. All I can say is I'm thankfully I do not have to choose my favorite as all were deliciously prepared. On my next visit I seriously anticipate having a difficult time deciding an entrée. And if those were not tasty enough, we opted to share an order of Brussels Sprouts as our side. Similar to the entrées, these were super tasty! If you're a fan of Brussels Sprouts, order these! If you're not a fan of Brussels Sprouts, order these! You will become a fan after tasting them. After 'mostly' finishing our entrées and the Brussels Sprouts (all were decent size portions) we were all stuffed and did not to make it to the dessert menu. <br><br>The service throughout the night was superb. From the hostess to our server everyone was warm and friendly. Our server did a great job of being present at the right time, never letting a water glass sit empty.  <br><br>Lastly, a big shout-out to Chicago's own Yelper-extraordinaire....Alex A, who not only suggested Maude's but setup dinner reservations. Thanks Alex for including Melanie B (it was GREAT to finally meet her) and Jordan C (we go way back...like spinal cords and car seats). And a big thank you to Maude's for being a great place to dine with friends. I look forward to my next visit.", "pics": null}}, {"review": {"des": "Came here last night for my girlfriend's birthday. We ordered two drinks, the whisky and rum smash. The drinks were delicious. To eat she had the mussels and I had the rotisserie chicken and smashed potatoes. The food was was great, even got the creme brûlée for dessert. I would have given more stars but the server was terrible. She constantly walked by our table and did not check in, removed our plates and gave them to another table, when our food came out we had no plates. It was a rather annoying experience. Again the food was excellent, server was terrible.", "pics": null}}, {"review": {"des": "I've only drank here so I can't speak for the food. But the drinks, slight variations on pre-Prohibition classics, were well made and promptly served. Great ambiance inside; I felt transported to an distant and luxurious decade.", "pics": null}}, {"review": {"des": "Stopped in for a couple drinks and a snack. Eastern Sour is definitely a whiskey based cocktail that was sour yet refreshing. St Germain Fizz was fruity and refreshing. I would get both drinks again. I felt the pate was just OK because it had an odd after taste. The fries were pretty good and filling although a bit on the salty side. Service was great.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/6gfRq5rWFnx1K-U53gi2zw/348s.jpg", "caption": "Eastern Sour on the left; St Germain Fizz on the right"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/UpEhK48-TVv7qDiz-BrJwQ/168s.jpg", "caption": "Pate"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ASU-3N1KGwPMs8_yCbFr5A/168s.jpg", "caption": "Menu 8/7/17"}]}}, {"review": {"des": "Best gnocchi I've ever had in my life. Period. Hands down. It was pillowy and soft and buttery and even a little meaty. It made my dreams come true. The drinks were very good too - I'd recommend the sazarec. Also, very tasty oysters! The tangy sauce was perfection and we got frites too - can't go wrong with fries and aioli. Service was horrible but the food made up for it!", "pics": null}}, {"review": {"des": "This place oozes french charm.  My friend and I sat outside and just shared some apps so take my impressions for what they're worth.  We had the shrimp cocktail which was exactly what you'd expect absolutely anywhere: six shrimp on a bed of ice with cocktail sauce.  We also had the French Onion Fondue, kind a French Onion Soup without the liquid, so caramelized onions with gratineed cheese on top.  It was fine but not as tasty as I'd hoped.  Drinks were fine.  This place makes me think that people will eat anything on West Randolph Street.", "pics": null}}, {"review": {"des": "Now my 3rd time here. Each time it only gets better and i like it more and more <br>We were sat immediately for our reservation by a very friendly host <br>Our server could not have been more pleasant and also patient as we decided what we wanted and ordered in a few rounds <br>Food.amazing! <br>Oysters were fresh and came very nicely displayed. French onion fondue remains my favorite, order it! I raved about it to all my friends and they all agreed .<br><br>Tried the cassoulet for the first time. Wow. Im not normally someone who eats a ton of pork/meat but this was amazing! Its a large portion , we shared it with 5 people  .<br>The gnocchi was our other entree , taste wise delicious, i was slightly thrown off on how it was just served on like a random salad plate while everything else was nicely plated but no biggy. Its also a good dish for sharing and had great texture. <br><br>Atmosphere is dark and cozy<br>I recommend going with a few people to try more things !<br>Will be returning", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/A7DPVSjL76zaXdDwAUZ4Ag/348s.jpg", "caption": "French onion fondue . Keeps me coming back . So so good"}]}}, {"review": {"des": "Overpriced and service that is awful. Ate here last night with a group of colleagues. Not only did waitstaff forget to bring one diner's main course initially but delayed over 20 minutes when they realized their error. They offered to make up with some token deserts, but then forgot the same person's tea. They were also out of many sides. Crazy. There is nothing special about this restaurant. I had the Maude's steak which was not unique at all. At the end, I had to stand up and chase down a waiter simply to pay our bill. If they need more staff they should hire some, and they should think about upgrading their chef for the prices they charge.", "pics": null}}, {"review": {"des": "Maude's delivered pretty much as expected with a few standouts. First off the space is very well done, warm and completely inviting. While the table spacing is predictably tight, it is French country refined with wonderful lighting and colors.<br><br>Service was good, not great and had to track down our server on a few occasions. Apart from that, Maude's brought it where it really counts, the food.  <br><br>Scottish Salmon is hard to pass up for me and because we had a few drinks prior at Aviary, wasn't over the top hungry and a natural choice.  If perfection can be achieved in temp, texture and flavor then it just was with this dish.  She went w the Pork Paillard which was a thin quality cut of pork in a light and crunchy breading. Paired w delicious, Pomme Frites the whole meal was total quality. <br><br>[X] Check it out -", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/KLoC3mT4nuoGq39co91kTA/348s.jpg", "caption": "Scottish Salmon - perfection"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ssbzuGNqpAu0dffWHy3k_A/168s.jpg", "caption": "Lighting executed"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/g9c7OcfUuwL58-ktXUngBQ/168s.jpg", "caption": "Whiskey Smash !"}]}}, {"review": {"des": "I love french food and being in Chicago all summer I was thinking I would never find my escargot or pâté! My boyfriend was recommended this place and the reviews and pictures looked great! We booked a reservation online and were seated on their second floor. We came for dinner and it was super dimly lit and romantic. They had all the traditional french items and more. Their cocktail list also seemed like a lot of fun. I chose a classic french 75 and my boyfriend chose the boulevardier. I loved their french 75 and I can't wait to try their other cocktails.<br><br>For appetizers we ordered the escargot and the foie gras pâté. The escargot was slathered in garlic herb butter and was so yummy. The foie gras came with great bread to spread their jam and foie gras on. I would definitely order these plates again! They also give you free bread to start with so you can dip your bread in the escargot butter and the extra pâté you might have left. <br><br>For entrees I ordered the salmon and my boyfriend ordered the cassoulet. The salmon was perfect and I ordered it with a side of their mash potatoes. The mash potatoes were very smooth and they put chicken jus on it so it was very savory as well. My boyfriends cassoulet was massive. It could definitely have been spit between two people. I loved the beans and all the meat that was on it. We ended up eating it the next day and it was still good. <br><br>Next time I'm going to Chicago I will have to come back here!", "pics": null}}, {"review": {"des": "Maude's serves up my 2 favorite things: French food and lots of bread. <br><br>My husband and I shared:<br>Escargot (loved the potent lemon flavor)<br>Steak Tartar<br>French Onion Fondue (the best part of French onion soup- the melted cheese and caramelized onions!)<br>Pommes Frites <br><br>Portions were huge especially for French food. <br>Every dish came with a generous loaf of warm, soft bread. I had to muster up a lot of willpower not to eat it all. <br><br>One of my favorite meals in a long time!", "pics": null}}, {"review": {"des": "Another great restaurant in the Bavette's and Gilt Bar family! Love the BYOB policy where you pour an extra glass from your bottle and share it with a different table in the restaurant. I prefer bavettes and Gilt Bar over Maude's menu selection.", "pics": null}}, {"review": {"des": "Excellent in every regard: really the best meal I've enjoyed in recent memory and my new favorite French restaurant in the city. I highly recommend the salmon tartare with crème frâiche - it's a revelation. The escargot was perfection along with the crusty warm baguette served with it. My companion who has traveled extensively, lived abroad for years and dined in France many times said the pomme frites were the best she's ever had (high praise). The ambiance is romantic with dim lighting and ornate chandeliers. Our server, Brad, was a doll and just the right amount of attentive. Hostesses were kind and all smiles and don't get me started on the mezcal negroni. #LOVE", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/CjJHDUWRokckJGg5WE6Qjw/348s.jpg", "caption": "Mezcal Negroni. Please try."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/0dkbkC4lPiHKgERC0QUIaQ/168s.jpg", "caption": "Stellar escargot."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/dKT67-JPaXo2099aTxn4Vw/168s.jpg", "caption": "Perfection - salmon tartare."}]}}, {"review": {"des": "If you're looking for a great date night with good food, drinks, and sexy atmosphere... Maude's would be it.  I discovered this great restaurant as I tried to book the ever popular Bavette's and then found that they had 2 other restaurants, Gilt and Maude's.  Sitting on the super popular Randolph, this French influenced bistro serves up really good food and would perfect that special date night.<br><br>We were able to be seated in the upstairs 'library' area where the kitchen is exposed to the exclusive dining area.  Dim lightning with a gorgeous 'boudoir' feel.  Because the room is not large, the noise level is always reasonable and you can have a good conversation while dining.  The only little note is that you maybe seated within inches of the other table.  I think our table was only 2 inches from the other one... not an exaggeration.<br><br>Thankfully our server was on point and helped us pick a great selection to try.  We had the shaved vegetable salad, Parisian ricotta gnocchi, seared salmon, and creme brulee.  I also got the green tea as it was insanely cold that day ... loved the HUGE large tea pot for the loose leaf tea.  The shaved vegetable salad was quite acidic and it made it a bit challenging to eat but the large amount of blue cheese helped with it.  The Parisian gnocchi was really good.  Between the generous helping of mushrooms and the light and yet nicely seared gnocchi, this was a good dish.  The salmon was perfectly cooked... it was a nice translucent deeper pink in the middle and honestly very tasty.  <br><br>I have to make a separate paragraph for the creme brulee.... honestly amazing.  I love how they have the custard thinly so you have tons of the super crackly caramelized sugar with each bite.  This was so well done.  It's been a while since I've had one this good.<br><br>Service was definitely attentive and overall, the dining was very good.  I do like Bavettes a bit more but seeing how near impossible it is to get a reservations there, Maude's does a wonderful experience.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/PquDBaLsh_Sl3GSVBlDisQ/348s.jpg", "caption": "Dim and sexy atmosphere ... restaurant fills up quickly"}]}}, {"review": {"des": "Last time I was so blown away by their Cassoulet that it was difficult for me to see or admit that there is a bit of pretentiousness here. Perhaps that's part of what they are going for, but unlike the French restaurant stereotype of rudeness toward patrons, I've had really great service in France.<br><br>Anyway, the long and the short of it is this, I ordered a Trinidad Sour and they gave me a Trinidad Sling. These are not the same drinks, far from it in fact. A minute or two after ordering it, our server came back and asked if it was a Sling or a Sour I wanted and I said Sour. Once received, I thought perhaps they have a completely different recipe and presentation so I asked our server. He said they didn't know what a Trinidad Sour was so they made the Trinidad Sling instead.<br><br>I was surprised, my experience from previous visits has been that they really know what they are doing when it comes to cocktails. Ultimately I still like Maude's, but feel this could have been handled better.", "pics": null}}, {"review": {"des": "I was impressed! I came here on Friday and really enjoyed everything. <br><br>The atmosphere of this place is very warm and cozy. It's perfect for a cold winter night. The tables are a little close together so that is one thing I did not like. We had some very loud groups next to us which was distracting. <br><br>The food and service was great! Our server provides us with some great recommendations and was attentive. We ordered oysters, the beef tartare and cassoulet. I loved the beer tartare and would recommend this dish! The cassoulet is very rich and heavy... you don't need a lot of it. The food was very good. <br><br>I would come back here again and would recommend this place.", "pics": null}}, {"review": {"des": "Top notch food and ambiance at top notch prices.  Maude's is a place where you can spend a lot, yet the quality matches the price.  It has the ambiance of a darker French café, or a speakeasy from the 1920s.  Solid drink menu; yet I'll talk about the food.  Oysters were phenomenal; choices of four different kinds - can mix and match.  French onion fondue was the perfect consistency; good amount of cheese and onion.  Had roasted bone marrow; first time I ever had it.  I understand bone marrow is healthy for us.... I just loved the mix with the rest of the dish.  If you like foie gras, it is great - comes with a cognac sauce and some sort of cherry jam.  <br><br>Not a quiet place, yet enough background noise that you won't hear others' conversations.<br><br>Would give it a 5 for food - except can get really crowded and prices can build up quickly.", "pics": null}}, {"review": {"des": "Stopped in here late on a Friday night with a group of 3 others. There were many open tables, but the greeter told us we needed to go to the bar in the back because we didn't have a reservation and because we were only getting drinks. The bar area was crowded with no available seats. We went to the back, got a few menus, and realized we couldn't even read them because it was so dark. We had to use our iPhone flashlights to read the menus, which (1) immediately embarrasses newcomers into the restaurant and makes them feel unwelcome and (2) disrupts the vibe for people who are already in the restaurant. We started debating whether we even wanted to stay, and while discussing this, a waiter came by and asked us if we wanted to sit at one of the tables. We sat and each got a cocktail -- all of which were very well-made -- but I couldn't shake my initial impression of being a less valued guest.", "pics": null}}, {"review": {"des": "The ambiance in this place is amazing.  The brick walls, candlelight, dark wood make the place so comfortable.  Upstairs is substantially quieter than the main floor.  I had the Cassoulet which was delicious. My wife had the chicken, which was ok.  The drinks where so so, my Manhattan did not have a cherry:(  Food came out surprisingly fast, too fast for my liking.  I like to ease into a meal.  Valet lost my car keys and took over 30 minutes to find them.  Not good.  <br><br>All in all I would go back, and when I do I will be more prepared. Request a table upstairs, don't rush to order, and take an uber.", "pics": null}}, {"review": {"des": "Love. What an elegant, fun restaurant that would be my first date pick every time. The ambiance is lovely, low lighting and exposed brick (a bit noisy, but that kind of adds to the fun in my opinion). The waiters on point, around but not too nosy. Great wine/cocktail list with something for everyone. <br><br>Definitely get the oysters to start, wherever they're sourced they're excellent. As is the chicken liver pate, served with large slices of thick cut toasted bread. The mussels are large and properly (not overly) cooked, with a nicely salty broth for dipping. And the gnocchi is delicate but not falling apart, with just the right amount of parm. I would definitely be back to try more on the menu.", "pics": null}}, {"review": {"des": "Very charming interior! The service was great, waiters are very attentive. I will be dreaming about the gnocchi, you have to order it!", "pics": null}}, {"review": {"des": "Great French restaurant. Excellent service. Foie, escargot & cassoulet was perfect for a party of two.  Inform if have mobility issues if you don't want to be seated upstairs.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/cHvEN14FaFEsYKS47ABe3A/348s.jpg", "caption": "Foie, escargot & cassoulet was perfect for a party of two."}]}}, {"review": {"des": "This is a great place to stop in for dinner in the West Loop. The atmosphere is great, and the food will not disappoint. In my opinion, the prices are pretty reasonable compared to the restaurants in the area, especially when you consider the seemingly automatic \"mark-up\" that gets added to French food. <br><br>Ordered the pork paillard which was so much better than I was expecting - would recommend trying for sure. The steak tartare was great as well, on par with the expectations I would have.<br><br>The best part is that if you aren't looking for a pretentious wine pairing for your meal, the $6 house wine by the glass was actually decent and well worth the modest price.<br><br>Would definitely come back to try some cocktails and more of their delicious sounding dishes.", "pics": null}}, {"review": {"des": "I had heard rave reviews from my friends re Maude's Liquor Bar and for the most part, my expectations were fulfilled. Where expectations fell slightly short, however, were at the drinks and price point.<br><br>First of all, be ready for a heavy, hearty meal. Not quite in portion, but everything is extremely rich (not a bad thing, just an observation).<br><br>We had ordered the Classic Lyonnaise salad and it did not disappoint. It was well-portioned and hearty, with delicious grilled pork belly. For $15, it was a little steeper for a starter-salad.<br><br>We also grabbed a ricotta gnocchi, at $18. Very good, very rich, although for the portion, probably would have loved paying closer to $15-16, but meh. <br><br>We grabbed two other plates but neither were very memorable  - so I'll skip the descriptions. <br><br>Where my disappointment was though, was with the smashes. Yes, $11-15 drinks in Chicago is pretty average, especially in the west loop, but these smashes (as you could see from everyone's pictures) were SO overwhelmingly filled with ice and fruit, I'm not sure I even got much liquid! Two sips and bye $13! I did also grab a few stirred drinks and they were much more worth it.<br><br>Would I be back? Maybe.", "pics": null}}, {"review": {"des": "Hmmmm, where do I start with Maude?? When I first heard the name, I was thinking \"What??? Liquor Bar?? Sounds like  place I want to visit!\" So, we did! The ambiance is relaxed and romantic.....more romantic. The lighting is just dim enough and it reminded of a movie scene. I love it!!!<br><br>The food was even better! The cassoulet was heavenly and mashed potatoes were perfect. We shared the cassoulet. It was super flavorful and seasoned perfectly. The mashed potatoes had a perfect creaminess to go with this yummy gravy that's poured over the top.......my mouth is watering thinking about it : )<br><br> I had the Lillet Rose drink, it was strong, but very good. I would definitely recommend Maude's Liquor and will be back soon.", "pics": null}}, {"review": {"des": "I love the interior and atmosphere of this place--dimly lit and cozy with nice rustic furniture.<br><br>The food was great; I didn't expect to like it as much as I did given my tendency to be unimpressed by alot of Western/American food, but Maude's took me by pleasant surprise!<br><br>We ordered:<br>- the steak tartare - a m a z i n g<br>- Maude's steak (rare) - also so, so good and flavorful. I definitely could not have finished it on my own. Unsure how my partner did that and still had some of my cassoulet. Lol.<br>- cassoulet - We knew we ordered a lot of food, and as expected brought home half the dish. The sausage in the cassoulet was by far my favorite. Wasn't the biggest fan of the duck as it was abit salty, and wished it was replaced by more sausage. <br>- Aviation drink <br>- sazerac drink<br><br>Would return!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/fu_zJZSnoWBNS2NrDMcHlA/168s.jpg", "caption": "Cassoulet in foreground, steak in back"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/H6UMmFeKq-V9wARavFCtnA/168s.jpg", "caption": "Steak tartare"}]}}, {"review": {"des": "Such a great stop! Not only was the food great but every cocktail exceeded all expectations!<br><br>Shaun (sp?) was so great and gave us amazing service! The fresh squeezed grapefruit juice made for the best Greyhound I have ever had. All of the drinks were great and the food was so delicious. <br><br>The overall atmosphere was unbeatable and really set us up for an amazing night!!!!!!<br><br>Thanks Maude's!!!", "pics": null}}, {"review": {"des": "I came here the other night with colleagues and had a great time.  We sat upstairs and it was dark and intimate.  The drinks were great and the food was excellent.  I can't speak to the prices but I'm assuming it was expensive.  We had one person order for the table and I swear I tried everything on the menu.  Great food, great service, I'd love to go back!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/fM46VinS7rDyOhiJEAQUEA/348s.jpg", "caption": "Seafood tower!"}]}}, {"review": {"des": "Came here for a late night visit recently and very much enjoyed the intimate atmosphere and my cocktail (the gimlet).", "pics": null}}, {"review": {"des": "This is my husband's favorite restaurant in Chicago. We came here recently for his birthday dinner and we brought his parents for their first time. We started with some oysters because they're my husband's favorite. My father-in-law said the salmon was the best he's had in his life and my mother-in-law LOVED her steak tartare. I tried the cheeseburger because I know Maude's is a sister restaurant of Au Cheval and it did not disappoint. The ambiance is very cozy and romantic and the service is exceptional.", "pics": null}}, {"review": {"des": "Food is somewhat good but service sucks!! I'm writing this while I'm waiting for the server to come back for the dessert order ... 15 min ago!!!!", "pics": null}}, {"review": {"des": "My review is really only for the drinks here since I did not eat here- but let me just tell you these drinks were really good!  We stopped in on a Saturday night while we were waiting for our table at Au Cheval - the bartender was super nice and made us some great drinks.  It's also really cute inside.  I had a lot of trouble deciding which drink I wanted to try, but ended up going with the eastern sour.  I'm not normally a big whiskey drinker but this tasted so good!! It was strong but still tasted really good. Unfortunately since we were waiting for a table, we didn't eat here, but I definitely want to try it when I'm back in Chicago. I was getting food envy when I saw the food come out!!", "pics": null}}, {"review": {"des": "HORRIBLE SERVICE! Great food just like their sister restaurants, but horrendous service! Came on a Wednesday night at 8:30. Waited around to be greater by the waitress. We ordered cocktails, appetizers and the entrees at the same time. We waited 25 minutes for the appetizers and the drinks were still not out. The waitress was nowhere to be found. Later on my friend ordered a bottle of wine. We got delivered a drink order from another table. Finally, the waitress brought the bottle of wine with only 1 wine glass...no one checked on us regarding our entrees for 10 minutes. Beyond disappointed with the service. Food was great, but will not return due to the service. It was a favorite for years, but restaurant staff needs adequate training.", "pics": null}}, {"review": {"des": "This could have been a 4 to 5 star but for the salt....what was that about? Would have thought the shaker top popped off but for the fact that all the fry servings were doused. As a salt collector ( when my friends travel and ask what they can bring me I tell them the 3 Ss - salt, scarves, soap. So - being a salt snob here - I know that Maud is using a high grade, coarse salt which should means you use much less because it is so much impact. Maude has salt madness! stop the madness!<br><br>My risotto was grand, my martini excellent, service kind professional (my description of a server who knows what he is doing without attitude).", "pics": null}}, {"review": {"des": "Had a great dinner at Maude's last night.  Cute, industrial-style restaurant with amazingly rich food.  Drinks were on par.  I had a Vodka Smash and my boyfriend had a Smokey Violet Smash.  Mine was nice and citrusy.  His was actually smokey!  How do they do that??  I wish I got his instead, but next time we frequent Maude's, I'm definitely getting the Smokey Violet.  He loves escargot so of course, we ordered that.  He liked them a lot and said they are comparable to his favorite at Chez Joel on Taylor Street.  I had the bibb lettuce (and I just love bibb lettuce) and haven't had it in a very long time.  Very good!!  A nice huge serving of it too.  It was a very simple dish but I enjoyed it a lot.  We had the steak tartare and I have to say it's one of the best I've had so far.  That was my favorite dish last night.  My boyfriend ordered the West Coast oysters and said they were tasty, the sauces that accompany them were tasty as well, and all around he just really enjoyed the fresh, raw oysters.  I've been wanting to go to Maude's for so long and I'm so glad I had a great meal here.", "pics": null}}, {"review": {"des": "This place is AMAZING! Such a romantic and intimate atmosphere. Their cocktails are so good. They really know what they are doing. Food-wise you can't go wrong. My favorites are the salmon tartare, french onion fondue, mussels (you'll lap up the broth with bread), the chicken is so delicious too. Pommel Frites are a MUST! That garlic aioli dipping sauce is so good. My favorite cocktails is the whiskey cocktail with Lion in the name and a whiskey smash.", "pics": null}}, {"review": {"des": "My husband surprised me for my birthday dinner at Maude's. Knowing I love French food, he thought it would be a slam dunk surprise. We were both hugely disappointed.  <br><br>1) We arrive for our reservation and are told they have \"a lot\" more tables to seat before us so go to the bar.  The bar is very small and literally in the middle of other seated diners.  It was three people deep trying to order drinks with bartenders more interested in socializing.  We tried for 10 minutes to get drinks while continuously bumping into seated patrons' tables.   All of a sudden, our table was ready so we didn't order a drink after all. <br><br>2) The ambiance could be nice but the music is just odd here. It was a mix of electronic and obscure tracks that were simply too loud and distracting. Additionally, we hoped it would be a romantic setting and we were literally backed like pickles next to other customers. <br><br>3) The cocktail list is very narrow and limited but the drinks we ordered were tasty. <br><br>4) We started with the escargot which was very delicious and lemony. We had the French onion fondue next which was very disappointing and primarily onions with a smattering of congealed clumpy cheese.  Worst of all was the cassoullet- their $40 showcase entree. The duck was unpalatably salty. The white beans were undercooked, gritty and completely inedible.  The sausage had the taste of a hot dog. We literally ate none of the dish but the staff didn't bother to ask why.   The brussel sprouts were simultaneously undercooked but charred and tasted like sulfur bombs.   We ordered the creme brûlée which took more than 20 minutes to arrive. While they comped it due to the delay, it was not worth the wait.  <br><br>My husband had made the arrangements noting we were celebrating a birthday and Maude's fell more than short.  We will not be returning or recommending it to anyone.", "pics": null}}, {"review": {"des": "We decided to stop by Maude's before dinner in the West Loop on a Friday night. Very cute ambiance with dim lighting. It was impossible to get a table so we stood by the bar, which quickly got very crowded. They should def think about limiting the number of people that they allow to stand around there. The place is TINY and people start bumping into each other, etc. Not pleasant.<br><br>We ordered fries, which were perfectly crispy and came with an aioli dipping sauce.<br><br>Also had 2 drinks each, but none of them really blew our mind. On top of that, they are pretty freaking pricey! Not sure how the food is, but I don't think I'll be returning for drinks with the price tag and limited space.", "pics": null}}, {"review": {"des": "I love you, Maude. Thank you for treating me for a wonderful dinner night on your second floor (TRY to get seats up there!) A beautifully dim light dinner - I felt like I was in a beautiful painting. I always feel like finding a French restaurant is challenging- so I am thankful that I did a girls night here. <br><br>The MENU - wow. Oysters to the French Onion Fondue (what an amazing twist to  the classic soup) and Ricotta Gnocchi. It's such a creative menu and you have to get as much as you can. I suggest going with a group of 5 and more people to really share everything on a round table. <br><br>If you love Gin like I do- you won't go wrong with the French Gimlet. It was so refreshing and the sweetness was just right. <br><br>It's a nibble and take your time type of restaurant with great service. Looking forward to going back!", "pics": null}}, {"review": {"des": "So was in Chicago for a quick day trip and decided that I was craving some French food and after a quick yelp search, decided to lock in this place for dinner. Landed at O'hare and dealt with all the traffic up the highway and threw my bags at the hotel and made my way over to this joint. This spot is right near Girl & the Goat and Au Cheval so it fits right into the foodie neighborhood. The door is a bit unassuming but once you walk into the restaurant, it feels you are transported to another world in its entirety. <br><br>The joint has a busy vibe with a cross of a French Café and Speakeasy bar. The hostess was friendly and quick to seat us and the waitress was friendly once she opened up and started chatting. The bar certainly had plenty of options to choose from and was busy all night. I decided to go with an Oban as my drink of choice and kept it going for the night. After a bit of perusing, we decided to order half a dozen oysters, the salmon tartare, and after much debate the cassoulet. The oysters were cleaned well and fresh although not the freshest I have had. They were a good start to the meal but was excited to try the other items. The salmon tartare was good and refreshing if that makes sense. The crème fraiche was delicious and paired well with the salmon. It was hard to not clean up this plate but we made good work of it. The cassoulet was the next dish up and no regrets ordering this bad boy. It was protein heavy and just really solid given it was a perfect fall night in Chicago. This dish is massive but certainly does not disappoint. The meat for the duck just fell right off the bone and the sausage was delicious. The pork belly was so tender and the bone marrow done just right. I really want to learn how to cook this bad boy as it was really solid and definitely a surprise for me. <br><br>All in all, a really solid place and quite happy with the options we selected. I will certainly be back to try more items on this menu in the future.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/GDus8LJ6tjhUA8sXTQYkrQ/348s.jpg", "caption": "Cassoulet...delish"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/yELjOaDhGdMXbK0q5SNySQ/168s.jpg", "caption": "Oysters"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/kg5ZtSqVNa614BGp7th-Og/168s.jpg", "caption": "Salmon tartare"}]}}, {"review": {"des": "It was recommended to visit. The food was good and healthy. Service was quick and polite. I highly recommend chicken, it was perfect. It was a good lunch experience.", "pics": null}}, {"review": {"des": "best dishes include foie gras paté, escargot, steak tartare, chicken liver mousse, and french onion fondue. for drinks, order the whiskey sour (egg whites included).", "pics": null}}, {"review": {"des": "Good service and the food is excellent,  well executed french brasserie style.  Order the foie-gras, pork paillard and ribeye, you'll be glad you did.", "pics": null}}, {"review": {"des": "French Onion Dip Fondue...enough said.  Basically, I need to come here for dinner so I can try the rest of their food because their appetizers were better then the food down the street at Girl & the Goat. <br>My hubby and our friends sat at the bar and enjoyed watching the bartenders (who were awesome) work their magic.  Our awesome bartender gave us some suggestions on things to try food wise and they were amazing.  I wish we would have eaten here for dinner, but I am for sure planning another date night with the hubby to try out their menu. <br><br>I'm not sure if there is an upstairs, but the downstairs was on the smaller side.  Perfect for a date night, has a more romantic feel to it!<br><br>In all seriousness.. I can't stop thinking about the French Onion Fondue....it is life.", "pics": null}}, {"review": {"des": "Champagne, shrimp cocktail, gnocchi, and creme brûlée. Everything was great! Service was lovely. <br><br>I was a little worried it might be too young and loud for my two dinner companions (my mother and her friend) but they LOVED it!", "pics": null}}, {"review": {"des": "From the beginning, I was intrigued by the description \"dimly lit.\" This would be the place to take your significant other should he decide to go into literary exile. Or any kind of an exile from life - period. All around, it has that dark, seething cabaret Parisian vibe about it. It speaks to the dark soul. The bar is a sad café. Fortunately, neither my friend or I were in exile - just decided to dine there pre-opera during the winter season. We originally stopped by The Loyalist, but it was far too crowded, and  I start to feel faint and claustrophobic when surrounded by too many people. Maude's just happened to have a cozy table in the corner. In case you're not telepathic, don't worry - the conversational level is low enough so that you will be able to communicate without primal scream. Snail appetizer was lovely laced in butter, salads were tart and savory, and my dining companion ordered the baked chicken entree for both of us, which was heavenly. We shared a chocolate mousse because something about the atmosphere invites closeness and sharing. Get a corner table if you can - there is enough room to hold hands and gaze into one another's eyes while you feel a sin coming on. Linger over a warmed brandy snifter of cognac, and then realize that you have just missed the first 45 minutes of Turandot. Make sure your driver is on standby.", "pics": null}}, {"review": {"des": "Excellent cocktails! They do several smashes here that are amazingly refreshing. We had the smokey violet and the gin one and loved them both.<br><br>We had a little foie gras and cherry dish that was delicious as well as the pomme frites that we're excellent!!<br><br>Attentive service in a sexy, cozy surrounding vibe. We loved it and would come back.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/tZY0IOhYAZPzdaUOg0xIBg/348s.jpg", "caption": "Smokey violet smash"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/nlrSkOHBrMvizU8zY9SCzg/168s.jpg", "caption": "Gin smash"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/LiI0huFNteq1ukqUl2oZMQ/168s.jpg", "caption": "Four"}]}}, {"review": {"des": "I'm honestly surprised this place doesn't have a Michelin star. It's replaced Longman and Eagle as my favorite restaurant in Chicago. It's a beautiful space, especially the upstairs. The steak, mussels, tartare were all exceptional. Overall a top restaurant that isn't too pricey compared to its sister restaurant Bavette's or other French inspired restaurants in Chicago.", "pics": null}}, {"review": {"des": "Maude's is a delicious restaurant and provides the necessary FUNK for a French establishment. Maude's sister restaurant, Gilt Bar, delivers a very similar menu and I actually ate at Gilt last night. The Mussels are the true go to dish at both restaurants. They have the best!! At this meal, my girlfriend and I were accompanied by two friends. More people= more dishes to try!! Now let's dive into the delicious entrees that we enjoyed. <br><br>For the first time I enjoyed escargot. A fish I never planned on trying was surprisingly delicious and extremely flavorful. Our meal also consisted of the mussels and caramelized Au gratin potato dish. Both dishes were out of this world! We also enjoyed the chicken and steak dishes for entrees. You really cannot go wrong as every menu item is delicious!! <br><br>I might not love French food, but Maude's corrects all of my French food fears. I live close to Maude's and I will be back!", "pics": null}}, {"review": {"des": "Disappointed! I read a lot of very good review and decided to make a reservation for my 20 yrs anniversary. First impression was not the good one as we arrived before other couples and they were seated before us. A detail but very important! First proposed table was behind the hostess... not really romantic! <br>Food was neither at the level I was expecting based on picture. Foie gras mousse was just a mousse... we asked for additional bread to finish it, it came after our main dishes... this is not the type of service I expect from a 4 stars restaurant.", "pics": null}}, {"review": {"des": "Strange name, great place.  Atmosphere is dimly lit and romantic, food is excellent, and unlike France the cocktail list is large and excellent.  The wine list was also good although I wish it was a bit bigger - the Burgundy section was very light which seems a shame at a good French restaurant.  However, the atmosphere and food make up for any shortcomings in the wine list.  Everything is well concepted and executed, with everything from fresh seafood to French classics, and great items such as roasted chicken or carrots and of course slow braised short rib.  Or even escargot if you're in the mood.<br><br>Well done, And well worthy of a Michelin mention in the Bib Gourmand section.  Definitely worth a visit.", "pics": null}}, {"review": {"des": "I got so hyped up about this place... Was looking for a romantic ambiance for my wedding anniversary and I think I expected more.  The pics ppl post- it's not that dark in there !<br>The \"appetizers\" like the Brie cheese and jam on bread was delicious, the spinach onion fondue was ok.  And the casserole was good but the duck was too salty and the sausage tasted like the regular veal dogs I could buy at any Chicago, European deli.  <br>Drinks were good.  But I think that ambiance and setting wasn't as they market it.  Yes, there are many candles but it's not private or intimate and sexy.  Your crammed up next to people aside you, STARRING at your food as they make a decision of what to order!!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/3K8DWu1unoRlpc4yAWdrcw/348s.jpg", "caption": "The casserole, with duck, white beans and so on.  Again, duck was toooo salty."}]}}, {"review": {"des": "Overall a hip Frenchie-bistrot with disappointingly uneven food quality. I was expecting a better overall experience based on the reviews and the recent Michelin Bib Gourmand rating. I'll cut straight to the chase:<br><br>- Fantastic list of cocktails that didn't disappoint. My Sazerac was awesome, wife's \"Death in the Afternoon\" wasn't quite as complex, but she gave it a B+.<br>- Escargots were excellent, with a non-traditional lemon note (I liked it) and very nice petit pain batard (pointy football shape).<br>- Things went south with the pate fois gras, which wasn't a pate, but a mousse. There's a big difference. Flavor just wasn't there and for an $18 appetizer I expected better.<br>- Cassoulet: What a shame. Beautiful confit de canard and nice garlic sausage, but the beans were undercooked. Waiter said, well, \"they're al dente.\" No. They were raw inside. As in crunchy starchy. For $38. Sure, there were plenty of beans and it served two, but the crunchy beans marred the whole experience.<br>- Creme brule was very nice. Unusually large plate with a thinner layer of custard gave it a nice caramel crust to creme ratio.<br>- Coffee: Seriously, WTF. A big pot of French press ($8) was undrinkable. Sour. I mean, SOUR. One of the worst cups of coffee I've been served in years. Couldn't choke it down. How does that happen?<br><br>Service was very good and the atmosphere was nice, for a relatively quiet early Sunday evening. Music started out traditional French crooners but somehow shifted to David Byrne. I was a little confused by the intent, but either way it was OK.<br><br>In the end, the bill was $185 for two and a not-that-satisfying meal. I think Maude's can do better.", "pics": null}}, {"review": {"des": "A-OK is about the right review on this place.  <br><br>Pros:<br>- Cool spot and ambiance<br>- Drinks are pretty darn good<br><br>Cons:<br>- Why do people come here for the food?  Eh... it's just that... eh.  Nothing special really at all.<br><br>Maude's is a fun place to come for drinks if you'd like - don't come here for the food.  Prices are pretty ridiculous for the food portions you get and the quality of the food you'd eat.", "pics": null}}, {"review": {"des": "Maude's Liquor Bar:<br><br>A Cassoulet with garlic sausage, pork belly, and duck leg confit....<br><br> A Pork Shoulder Terrine wrapped in bacon...<br><br>Chicken Liver Mousse....<br><br>Buttery, creamy, rich Ricotta Gnocchi with zucchini...<br><br>Braised Lentils and Brussels sprouts...<br><br>Yes, I reiterated the menu almost verbatim... but their menu is what legends are made of. Unique offerings executed with such superiority that one can't help but quiver when the aforementioned ingredients are spoken in unison. This dark, eclectic, hipster haunt, continues to be my number one choice for intimate nights teeming with a stellar wine and cocktail selection and hands down, the BEST food in Chicago.<br><br>Reservations are a must, at least two weeks in advance. And please, do not forget the VISA at home...you will need it, and you'll be glad you packed the platinum.", "pics": null}}, {"review": {"des": "Honest review: everything was meh nothing stood out  to make me come again the best thing of the night was the cassoulet but it wasnt worth the price.two things annoyed me besides the medicore food. 1 the terrible service we walked in got seated literly nobody said anything we had empty glasses for like 20 minutes then like she would like say hi then always disappear for a really long time cause she was socializing. I told her it was my gfs birthday n she forgot to top it off we ordered dessert she brought it n forgot the spoons n we sat their tryin to telepathically consume the dessert for 10 minutes. Then the person who brings ur food describes the dish with a very pronounced french accent. When i order Chinese food i dont want the waiter speakin to me in chinese because i dont speak chinese so obviously im not gonna know what u said. The second annoying thing  is the very loud music picture kumas corner loud in a romantic setting thats a no no. Also despite the name i didnt see alot of cocktails on the menu. I wouldnt come back again theirs better french restaurants<br> <br>Foie gras pate 17$: the bread was really good really thick and really crunchy. wish there was butter on the bread for an added richness. The strawberry jam was jus ur normal<br>Jam. It was sweet but not to sweet. The foie pate was a lil dissapointing it wasnt as rich as i was expecting it to be like u could barely taste the foie even by itself. So when u put everythin together all u tasted was straberry if the bread was buttered it Would have been better cause the richness would have been cut by the sweetness<br><br>Oysters 10.50$: fresh cleaned properly the presentation was really cute. Their was two sauces one like a cucumber balsamic vinegar which i didnt care For. the other sauce was a cocktail sauce with alot of horseradish 10 dollars for 3 was a lil steep though u could have fresher n more tastier oysters at another establishment like gt fish and oysters<br><br>Escargot 15$ (be warned dish is very hot) i like snails ive been eating them since i was a kid. The best way i could describe this dish is like a shrimp scampi thats bascially what it tastes like jus more fancier. Its really garlicky so be warned if ur on a date. For me the overwhelimg garlic flavor overpowered the snail so they should put less. It needed a lil salt. If u dip the bread in it tastes good. I wish they would have More of the sauce on the side because its really hard to dunk that really big bread into the little whole lol i wouldnt order it again because it didnt wow me i like that they had lemon to cut through the richness<br><br>cassoulet 38$ best dish of the night but not worth the price though i would describe it as something ur grandmother would make very homey. Be warned the dish is very hot. I would recommend to evenly distribute the meat everywhere so u could get the perfect bite like take the marrow out of bone n mix it in with the beans. The beans were really flavorful a lil mushy would have prefered them more aldente but they really absorbed all the rich flavors of the dish. The bone marrow added a beutiful rich element to the dish made it so decadent. The pork belly was my favorite part of the dish it was supper crispy n added a great salty element to the dish. The sausage wsnt that flavorful like after eatin a bite of it i was like meh would have liked it fried or burnt like a crispy sausage like if they put more seasoning on it would have been great. I love duck but the duck wasnt crispy so i was very dissapointed n it was very bland to. the best part of the dish is it has alot of crispy bread crumbs that adds tons of flavor. I wish it had more depth of flavor like somethin acidic to cut through the richness somethin sweet or spicy would have really put this dish over the top<br><br>Dark chocolate mouse 10$ the desserts of this place were really underwhelming like really mouse n crembrule could u get anymore basic wheres the soufflé? The actual<br>Mouse was very forgetful. The chocolate was alright ur typical mouse then theirs cream n chocolate shavings. The highlight is the seasalt but theres not enough so put more to counteract the sweetness", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/8663i5wwY0wVEmoopBrK1w/348s.jpg", "caption": "Oysters 10$ for 3"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/F25KHkiISL_uodJcrwJH-w/168s.jpg", "caption": "Cassoulet 38$ good but not worth the price be warned very hot"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/YPm-6OYaJxAdhKTQ3KGp_Q/168s.jpg", "caption": "Bill  wish i went to lena brava instead"}]}}, {"review": {"des": "Made reservations for my boyfriend's birthday. I called the restaurant TWO times this week to double check that they made a note that we were celebrating. I called Monday, and I called Friday. Our reservations were for Friday at 9PM. Both times I was told the celebration was noted, and that I just needed to order a dessert to get a small candle with it. <br><br>Our server had no idea, she was barely at our table. She brought the dessert menu over, we order, and they bring the dessert with nothing on it.. by that time I'm pissed more than anything and not wanting to say anything to embarrass my boyfriend plus by that point it was pointless since the dessert was already sitting on the table..next thing she brings over is the check and again at that point I didn't even had a chance to address what was missing because she dropped off the check and walk away. <br><br>Before we left I stopped at the hostess stand to address it with them since I assume they were the ones I have been speaking to when I called this  week. I got a \"sorry about that I take full blame\" apology.. that's it. We won't be coming back.", "pics": null}}, {"review": {"des": "We just stopped by for a late night drink when we were on a walk. It seems like Maude's is owned by the restaurant group who also owns Bavette's.  The Bottom line is is is fine but they do not give away the drinks here and they are a bit on the pricey side. If I'm in the area I will probably stop by again.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/nAcHMg9ymF37wCzMdvkzWg/348s.jpg", "caption": "Main area with bar in the rear"}]}}]}