{"name": "meli-cafe-and-juice-bar-chicago", "reviews": [{"review": {"des": "I've been here so many times, and Meli just never disappoints! <br><br>Food (5/5): Their brunch is phenomenal, especially their breakfast bowls. My favorite breakfast bowl is Farmland when I am not in the mood for any meats, just veggie. However, if you like a lot of meats with your eggs, Down the Farm is an excellent choice! Their smoothies and juices are also very delicious, my favorite is the Liver Cleanse Smoothie. If you're aiming for something more sweet for breakfast, get the Banana Bread French Toast. You will not regret it!!! Compared to other places, their portions are very satisfying. <br><br>Service (5/5): Every server that I've had each time I came here was very nice and helpful. They always made sure everything was good and refilled waters often. Very friendly and kind service.<br><br>Atmosphere (5/5): It feels like I am in a little wooden cabin. The interior is very neat and organized while having a casual/warm and intimate atmosphere.<br><br>PS: you can substitute your egg dishes for all egg whites with no extra charge!!!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/791H6mV2M3lNOlR7q-S8uA/348s.jpg", "caption": "Spicy Flamenco Omelette with egg white substitution"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/I8plekbDTOG3I2SMFCikuA/168s.jpg", "caption": "Banana Bread French Toast"}]}}, {"review": {"des": "My boyfriend and I came here for breakfast! We were greeted and seated quickly. We shared the Ribeye Green Chilaquiles, this was a special so it is not on the menu. I had very high expectations for this dish but was pretty dissatisfied. There was not enough meat and the square-cut tortillas were way too hard. Each time I tried to grab a spoonful of our dish the tortilla would dissolve into smaller pieces because of how overly crispy they were. Also, they put waaay too many onions in this dish, so much so that the onion taste overpowered the taste of the rest of the dish. It was hard to taste the egg, cheese and cilantro that was also part of this dish. The  green sauce that it was topped with was completely flavorless! I mean what is the point of that? We ordered a side of baby red potatoes to eat with this dish. The potatoes were okay, but I did really like their homemade ketchup! Also, I loved their jam!<br><br>We also shared the Maple Butter Pancakes with bananas and pecans. This dish was good. We did enjoy the pancakes and loved how this was large enough to share. The topped bananas and pecans that it comes with give it a much more full and flavorful taste.<br><br>Service was good and quick. Doubt I would ever go back though.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/AQcj8fUl16rekBulCp6SMw/348s.jpg", "caption": "Ribeye Green Chilaquiles  (Special, not on menu)"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/_GDe3yv7RElBKmWeslSNGQ/168s.jpg", "caption": "Side of baby red potatoes"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/7A9IjUwQN1yMhkxFJVKhUQ/168s.jpg", "caption": "Maple Butter Pancakes"}]}}, {"review": {"des": "Perfect little brunch spot! This place is always a popular brunch spot, the times I've been, there's always a wait. Sometimes the wait can be up to 30 mins depending on the day. But well worth it! The staff is always kind and apologetic for the wait. The food also comes out pretty fast, so if you're starving you don't have to worry about a long wait for the food!<br>Let's get down to the food: I always get myself a fresh juice. They have a good selection of juices but I usually get the Detox and it's always so fresh. I love their skillets and my favorite is the jalapeño chicken. Their Benedict's are also delicious and have a huge selection of brunch items from wraps, skillets, sandwiches or omelets. My FAVORITE thing about Meli's cafe is their homemade jam and butter. I almost want to buy myself a jar from them! Their jam is not too sweet and perfect for my toast. <br>Here's one thing, I wish the place was a little bigger!  The tables are kind of close together and I'm always afraid to knock something over when I get up.", "pics": null}}, {"review": {"des": "Service was great. Food was brought in large portion sizes and very tasty. I loved my jalapeño breakfast bowl (chorizo and potatoes are so good). Our coffee cups were consistently being refilled. I will definitely be coming back here again.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/OIruvoonQatGlf6cLlKlHA/168s.jpg", "caption": "Omelette"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/GFl6VGtdrn--ShL0W4f3wA/168s.jpg", "caption": "Jalapeño breakfast bowl"}]}}, {"review": {"des": "Great lox and bagel. <br>Fresh and flavorful. It was exactly what I was craving. <br>Service was friendly and responsive.<br><br>During the week is your best bet to avoid waiting in line....this place gets pretty busy on the weekend.", "pics": null}}, {"review": {"des": "Meli offers a sweet and savory brunch with hearty portions, a juice menu, and vegan options. It has everything! Sunday brunch is in high demand, so be prepared to put your name in and wait anywhere from 5-45 minutes. You'll be notified via text message when your table is ready.<br><br>I had the Symphony Crepes ($15) and oh my...they were outstanding! It reminded me of Paris. The three rolled crepes were fluffy and stuffed with Nutella, chopped pecan, strawberry, and banana with a dollop of whipped creme and chocolate drizzle. It was divine and indulgent! Also sampled the Poutine special ($15), which was a bowl of French fries covered with 2 eggs, gravy, bacon, and cheese. While not quite as yummy as the crepes, it was fun to try an atypical brunch dish.<br><br>For two people, this brunch was affordable. The service staff was tied down, since the restaurant was at capacity, but we were promptly served after ordering. Meli is family friendly, but you're more likely to be seated sooner with parties of four or less. <br><br>Will return to try the juices and smoothies and extensive lunch menu!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/3kLBRAaq4dLg-jszHdIqkA/168s.jpg", "caption": "Symphony crepes- $15"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/3i74IEKTbGMtVp3AmMCpug/168s.jpg", "caption": "Poutine bowl- $15"}]}}, {"review": {"des": "One of my favorite brunch places in Chicago. The food is consistently good and the service is even better. The manager at the front is always so happy and helpful. They try and move things a lot as quickly as possibly but it can get pretty busy on weekend. We've never had anything but breakfast/brunch.", "pics": null}}, {"review": {"des": "Great breakfast and brunch spot! Welcoming and clean environment, friendly staff, and tasty food.  Menu items are extensive for breakfast/brunch, portions are generous, and actual food is on point. For breakfast items (eggs/toast/pancakes/sausage), they bring you whipped cream, jam, maple syrup, hot sauce, and ketchup prior to your meal which I liked bc i dont have to ask.  Wait times for food is low so food comes to you quickly. For sundays, it starts to get busy around 945/10am so if you're there by 9am there will be no wait! Happy eating!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/opIx6akCOaDyLn9SaMdDog/348s.jpg", "caption": "Make your own omelette: choice 1 protein and 3 veggies :)"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/O37n0zWVW2l29ubRsssyow/168s.jpg", "caption": "Side of sausage (3), $4."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ADYZGu9WC1wNFuCTCXUVjw/168s.jpg", "caption": "Maple pecan pancakes! Huge pancakes, fluffy, and every bite was delightful!"}]}}, {"review": {"des": "3.5 Stars really. <br><br>A little after 10am on a Sunday and we were able to get seated immediately.  But by the time we left, there were quite a few parties waiting to be seated. <br><br>I've wanted to visit here because of the juice bar and the menu is pretty big with lots of choices, sweet/savory/healthy. <br><br>My son ordered the chicken and waffles and orange strawberry juice. <br>I went with the Farmland breakfast bowl, poached eggs and asked for only half serving of potatoes (I wont eat them all, didn't want to waste them).  <br><br>The kid loved his chicken/waffles, he didn't like the bacon jam--a little too weird for his young palate, but he did dig the grape jam on his waffles instead.  The juice was tasty, but he really didn't drink much, until I asked fro a glass of ice and poured the juice in...so much better!  So if you're not a fan of room temp juice, ask for the ice. <br><br>My breakfast bowl was made with fresh veggies and the eggs were perfectly poached. Made even better with a couple dashes of Cholula. The potatoes as expected, are just typical skillet breakfast baby red potatoes.  <br><br>Service was OK. Our server seemed to be having a bad day and I had to ask a different server (who was much friendlier) for a to-go box and our check. Of course our original server showed up to take the check/payment. Huh. <br><br>The space is packed pretty tightly, it's easy to bump into other tables and you can totally hear everyone's conversations easily.", "pics": null}}, {"review": {"des": "Decent brunch with a quaint feel. But I wouldn't go out of my way for Meli Cafe. <br><br>Last Sunday, a Yelp notification popped up recommending this place as a \"popular brunch spot,\" and not even 15 minutes later, a friend recommended we meet here for brunch. It felt like it was meant to be! And it was certainly popular -- expect to wait on the weekends, even in bad weather. I had the \"ABC 7 skillet\" off the specials menu, and it sounded like everything that is good about brunch all on one plate: avocado, bell peppers, breakfast potatoes, and eggs. But the reality? It was just kind of bland. And my fiancé said the same of his eggs Benedict -- okay, but not the greatest. <br><br>If I lived a few blocks away, I have no doubt that Meli Cafe would quickly fall into a reliable brunch spot. The menu is huge, and the service and feel of this place are both super cozy and friendly. But I've had better, and I've had worse. And I prefer to save my brunch funds for the really awesome, wow-worthy spots.<br><br>To note: this place has gluten free pancakes if you're celiac and looking for non-egg options!", "pics": null}}, {"review": {"des": "We both tried the Chicago Fire skillet, her's without avocado, everything was cooked right and the portions were great for a brunch. <br>Service was friendly and timely, and the restrooms were clean (which is rare in Chicago).", "pics": null}}, {"review": {"des": "The latté was good, but that's about it.  The \"tofu scramble\" was actually flavorless diced tofu with equally bland veggies.  I could barely eat it and left 2/3 of it on my plate.  And they only gave me one slice of toast, and considering the toast was the only thing palatable about the breakfast, that was also a disappointment.  Seriously, you guys - a tofu scramble should be scrambled!  It should look like scrambled eggs and be flavorful with spices and nutritional yeast.  Diced tofu doesn't cut it!  <br><br>And my friends all had complaints as well.  The 'banana bread french toast' was just... banana bread that did not have the consistency of french toast at all.  The corned beef hash was from a can.  The chicken tenders on the chicken & waffles was just frozen chicken heated up.  The \"bacon marmalade\" was just sweetened bacon with no orange \"marmalade\" at all.  The orange juice was warm.  On the whole, an incredibly disappointing experience.  We won't be going back.", "pics": null}}, {"review": {"des": "I've visited Meli Cafe on numerous occasions <br>And I've never been disappointed. The Salmon<br>Salad is my favorite.. fresh ingredients and the <br>Balsamic dressing is delicious. My son loves the <br>French toast. Great food. Great staff.", "pics": null}}, {"review": {"des": "Been here a couple times and always liked it. But went recently and got the corned beef hash Benedict and it wasn't my thing. Corned beef hash was not as crisply and cooked as I like typically. Got the kiwi mango orange honey juice which honestly just tasted like grapefruit. my friend seemed to like the corned beef bowl though. Jam was really tasty and coffee was good", "pics": null}}, {"review": {"des": "I finally made it for brunch at Meli Cafe on a recent Saturday.  Meli has a couple of locations, with the one in Greektown on Halsted being its original spot.  Meli means \"honey\" in Greek, but my bud and I were content to eat our sweet and tasty food without resorting to using any terms of endearment.  Surprisingly there was no wait for a table on this particular Saturday just before noontime.  The interior is bright and cheery, and the staff was equally so during our visit.  It was blazing hot outside, but inside it was quite comfortable.  <br><br>I went for the chicken and waffles, a delicious and hearty meal that I managed to finish since my only beverage was water.  The pieces of boneless fried chicken went well with the herbed waffle, which was not overly sweet.  The waffle was topped with a sunny side egg, which itself shrouded the \"maple bacon marmalade\" - basically a delish pile of sweetened bacon pieces.  These are not entire strips of crispy bacon, so if you are expecting that then you might be disappointed.  The dish also comes with syrup and butter, but for me the sweet bacon was the star of this meal.  My bud enjoyed his order of Nutella crepes.  Amazingly he did not completely finish his order of three crepes, filled and topped with banana slices, but he came pretty close.  Meli is not the cheapest place for breakfast, but since I basically ate dinner for breakfast (brunch? lunch?) then to me this yummy and filling meal was worth it.", "pics": null}}, {"review": {"des": "Very poor service! They were able to seat multiple parties of 2, but could not seat me, a party of 1. Multiple parties that entered after me, were seated before me. I'm so disappointed because I've heard many great things about this place. Perhaps a another location will have better service to its patrons. To Stax I go", "pics": null}}, {"review": {"des": "Love this place for food and juice. Sadly they changed their hours to open at 7am daily. <br><br>Honey pancakes are fantastic as are everything else we have eaten here! <br><br>Wish we lived closer and could go more often!", "pics": null}}, {"review": {"des": "Most people seem to go for breakfast; I went for lunch.  So... figuring I have a new perspective to add.  <br><br>First off, everything is both filling and healthy.  They have a choice of about 7 different wraps and a similar number of sandwiches. If you're vegetarian - you'll find an avocado wrap (including arugula and mozzarella)  which is filling.  If you want meat - well... I really liked the goat cheese wrap with chicken, roasted red pepper, onions, and spinach. My friend got this wrap with bacon, avocado, romaine, and turkey.  The wraps are huge.  The sandwiches are sizable as well - ranging from burgers to a reuben to chicken breast.  Yes... you can get gluten free.<br><br>Oh yes, there's also several salads.  The grilled salmon salad was quite enjoyable with capers and almonds throughout.  They have a beet salad and some fruit salads as well.  <br><br>A little on the pricey side, but service was great, food was healthy and filling and water was regularly refilled.", "pics": null}}, {"review": {"des": "I love this place for breakfast. I enjoy coming here with my friends and family. So far I have liked every item I have ever tried on their menu! And font forget to get their freshly made juices which is what caught my eye to begin with.<br><br>I am very picky when it comes to orange juice, as many breakfast places in Chicago falsely advertise that they have \"Freshly squeezed orange juice\" when at times its fresh juice that's bought from a store. But this place hands down has not only REAL fresh orange juice but ALL different kinds of fresh hand crafted juices! I've also tried their different smoothies which are great as well!<br><br>For food I recommend any of their crepes or omelettes since they are my favorite, but even the sandwiches, wraps tasted exquisite.<br><br>In addition, service was impressive, the waiter/waitress were very responsive, and came by many times to check up on our group. I have came here plenty of times and have never had an issue with the service.<br><br>Delicious food and friendly service. Great breakfast spot!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/SfoJJ2kf_Nl9_GIDrVHseA/348s.jpg", "caption": "Wonderful crepes"}]}}, {"review": {"des": "Just gross food.  It tasted like the food was either really over-cooked or heated up nasty leftovers.  Told the server but she didn't care.  Terrible service and food.  Too many restaurants for me to go back and give them a second chance.  <br><br>Really wanted to like this place since it's nearby.", "pics": null}}, {"review": {"des": "One of the best brunch places around! A neighborhood gem! <br><br>The food is always delicious and fresh and the cafe is sunny and welcoming. You just want to hang out there. The specials are usually very good. This time we had the crepe special with eggs, veggies and pesto and the waffle special with granola and fruit compote. So good! Love Meli!", "pics": null}}, {"review": {"des": "Many options for both food and juices/smoothies at reasonable prices. Great vegetarian and vegan menu as well! Overall great spot and waitstaff!", "pics": null}}, {"review": {"des": "I want here with a group of friends last week and the food was alright but not that exciting. One of my friends got a crepe dish with Nutella that she was very excited about. The other friend got tacos that were okay but also had a few issues. If I was reviewing based on food alone I would probably give it 4 stars. My main issue was with the service. I felt like I was being rushed throughout the meal. They also kept telling us that we needed to leave so they could do some work. Overall I think there are better brunch places in Chicago and I won't be coming back here.", "pics": null}}, {"review": {"des": "I just got back from a trip to Chicago and we ate breakfast at Meli's 2 out of the 3 morning we were there and they are all around wonderful! I had the biscuit and gravy with babybred potatoes and they were to die for! The servers kept of coffee hot and fresh throughout our whole dining experience and did so with a smile on their faces!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/zTGBbLWLSuULOVZCBEC7sA/348s.jpg", "caption": "Coffee kept hot and fresh the whole time!"}]}}, {"review": {"des": "My absolute favorite breakfast place in Chicago. Excellent location in greektown and the staff is friendly and accommodating. I had the chicken and waffles which was excellent, my friend had an omelet which looked amazing. Love this place and can't wait to go back!", "pics": null}}, {"review": {"des": "I love Meli Cafe. Their ghost pepper items are fantastic. Their juices are fresh as heck and delicious. The restaurant is very clean including the bathrooms. The staff are good about refills and are courteous. The menu has lots to offer and you will find something that will peak your interest. The food is really good and makes this place worth more than two visits. It is located in Greek town and is in walking distance of the blue line as well as UIC. There is street parking but tough to find during busy hours. Early morning on the weekends or weekdays you will find street parking a lot quicker. Overall, great place and I plan on returning soon.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/qCQiOnuoAACfMl04XbTG8g/168s.jpg", "caption": "Halstead out there. Greek town. UIC.... #memories"}]}}, {"review": {"des": "By far, the best French toast I have had in my life. Went early for breakfast and also enjoyed a freshly prepared orange and strawberry juice. Sweet environment and great service. A must if anywhere near Greek Town in Chicago.", "pics": null}}, {"review": {"des": "Everything here is absolutely fantastic! I am from California, but Meli Cafe is pretty close to getting me to make the move. I was staying at a hotel down the street for about a week, and normally I'm one to explore and try different places, but once I had Meli's Cafe, I was hooked, went back for breakfast every single day. The food is delicious, and the quality of the ingredients is super fresh. They have juices, smoothies, and breakfast available at this location.<br><br>Service: Impeccable. Every experience I had here, the host and servers were extremely polite, friendly, and fast, even on to-go orders.<br><br>Venue: I felt like I was in a little cafe in France. The decor is so cute, and the restaurant is very clean and well kept. Ample seating for small parties and groups. <br><br>Food: AMAZING! I literally showed up at 6am opening to grab my one last meal for my flight home.<br>Hash benedict- my favorite! Why have I not seen other places come up with this? Corned beef hash over an English muffin, topped with poached eggs covered in hollandaise sauce. The corned beef hash is cooked to perfection, not too mushy, or overly salty. Sauce is perfection. Order this, you won't regret it!<br><br>Peanut butter banana crepes- The peanut butter is so creamy and smooth, each bite just melts in your mouth. Definitely a peanut butter overload though, this might be a good one to share. It is delicious.<br><br>Spicy flamenco- Chicken chorizo, jalapeño, onions, tomato, avocado, cilantro, pepper jack cheese, sour cream. Seems like more of a Mexican style dish, but they do it right. A little on the spicy side, so be ready.<br><br>Pancakes- Wow! Who knew something so simple could be so delicious. I think their secret is in the pure dark amber maple syrup, it is phenomenal. I only tried the basic pancakes, but I can't wait to try the others.<br><br>Banana maple crunch smoothie- sooo good! Tasted like I was drinking an amazing banana maple pancake through a straw.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ML5SMdBHJqCvZiiDT8_hNg/348s.jpg", "caption": "Hash Benedict"}]}}, {"review": {"des": "Food was so delicious!! Unfortunately the location we were at didn't serve alcohol but the service and food was amazing.", "pics": null}}, {"review": {"des": "Such an amazing time! The food was perfect. Our server Mariana was so well at continuing and making sure everything was good!  <br><br>One heads up however with location, the parking can be difficult to find, but other than that the restaurant itself is perfect!!", "pics": null}}, {"review": {"des": "I was in Chicago for four days couple weeks ago, and as usual I was looking for a place with some  yummy breakfast or brunch, the closest one  to my hotel was Meli cafe, so I read some reviews and saw some pictures and it looked pretty good, so I decided to give it a try.  I'm glad I did, the food was super delicious, the restaurant it's super clean and the service was phenomenal. Alina and Mooky were super friendly and very professional. They answered all our questions about the menu. Definitely coming back again!", "pics": null}}, {"review": {"des": "The food is exceptional and consistently prepared and locally sourced. Predominantly organic. Fantastic service with servers who all have bright and positively happy dispositions. <br>The omelette and related breakfast items that are served all day result on a weekend wait that is worth it. Specials are creative and change daily. <br>They move the tables quickly but you never feel rushed. <br>Great place with friendly vibe.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/wt1IJDrkHe_CgsC9dXqDSQ/168s.jpg", "caption": "Casual atmosphere"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/7IHJ_kOOwlJgb0Un_MZ2mw/168s.jpg", "caption": "Farmers Breakfast Bowl"}]}}, {"review": {"des": "I was here for brunch, and it was fine, standard brunch fare. While there wasn't anything objectionable, it's easy to do much better within walking distance. I don't regret going here, but I wouldn't bother going again.", "pics": null}}, {"review": {"des": "I visited this restaurant twice in the same week; once with co-workers and second time with my family.<br>On both occasions, everyone with me enjoyed their food. <br>From now on this is my favorite breakfast place and I will go as far as saying it is better than \"Lou Mitchell's\". This based on creative and old-school menu items and how special attention is given to all the dishes. <br>Meli Cafe is a bit pricey (you can easily spend $20+ per person) but you get good quality food for the price.<br>Only one person in my family tried an item from their lunch menu, they described it satisfactory and not as good as our breakfast. With literally so many items on their breakfast menu, I wouldn't be going near their lunch items and I am okay with that.<br>5 stars for breakfast menu, 3 stars for lunch menu.", "pics": null}}, {"review": {"des": "Delicious! Very large portions, you definitely get what you pay for. Right in the middle of Greektown and a great Chicago experience.", "pics": null}}, {"review": {"des": "My only complaint is about the food. It looks yummy, but on 'looks'. The flavor is very simple, just SWEET. And the taste of French toast is a bit strange. We ordered Elvis French toast and blueberry lemon pancake, both are not good. A little disappointed to the chef at this restaurant.", "pics": null}}, {"review": {"des": "Good spot in Greektown for breakfast and lunch! Not recommended for a business lunch if you dine in; it's a relatively small place, and it can get quite loud and crowded. It's nice for a leisurely breakfast or lunch with friends. <br><br>I mostly stick to the lunch menu, and largely for carry our, which has consistently been good! They're fast, everything is always well-packed and hot when I arrive. <br><br>Their wraps are HUGE....they use a tortilla the size of a pitcher's mound, but it's a sizable portion for lunch (and then leftovers). I'm a fan of their no name wrap, which is more or less a club sandwich wrap. Ingredients are always fresh, and special requests to the order are never ignored. <br><br>Burgers and breakfast don't really hold up well with take out, and some of their hot sandwiches are a little hit or miss even when you dine in. <br><br>The avocado caprese wrap is also a favorite!! Another huge portion, and it comes with large slices of avocado, tomato, pesto and fresh mozzarella. It's plentiful, but not overly-filling. Sides-wise: their fries are really tasty! They're handcut, well-cooked and come with a tasty homemade ketchup. The pasta salad is ok.<br><br>Their salads are also really good! The Meli salad is a simple, but filling salad...ingredients are always fresh.<br><br>My personal favorite is the beet salad, and I add grilled chicken. It's served over arugula and with goat cheese and sliced beets. They don't skimp on the chicken, either! <br><br>All in all, good spot for takeout and a casual lunch.", "pics": null}}, {"review": {"des": "I would not eat here again. I ordered the vegetarian Benedict and like wth? There is no hollandaise sauce and there is literally no flavor. Just steamed spinach flavor. Where are the spices and flavors? Maybe toss in garlic or something damn. Not coming back. Service is quick and nice but food not worth it. Oh, and potatoes are stale af.", "pics": null}}, {"review": {"des": "There are no other options for breakfast in the immediate area so Meli is a neighborhood necessity. The prices are high but the food is ordinary. Green Street Local blows it out of the water with a much better atmosphere, better food, and cheaper prices but doesn't open until 11 on weekdays.", "pics": null}}, {"review": {"des": "Service was the only saving grace for this surprisingly popular place. I've been here twice and the food has always been bland. The portions are great though. I expected much better considering how highly rated this place is and how busy it usually is. I would not recommend", "pics": null}}, {"review": {"des": "Holy Crepes!!! do not leave without getting the crepes, even if you don't like sweets, for the love of god order the crepes. <br><br>We came here with a group of 4 and they set us pretty quickly. We ordered our own entrees and got a crepes for the table. The plates were massive - each plate could easily feed a party of two. So I purposely didn't finish my plate so I could try the dessert crepe we got for the table. We ordered the cobbler which came with a ton of berries and tasted really light yet filling. It had just the perfect combination of sugars, syrup and fruit - enough to want you coming back for more!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/EBToc-ky7rjf7NGYF2qqNw/348s.jpg", "caption": "Brunch!!"}]}}, {"review": {"des": "This was suggested to me by Facebook and the reviews looked good so we tried it and we were not disappointed. Its good food and a cute place. Good choices for breakfast and they have a small all vegan and gluten free menu.", "pics": null}}, {"review": {"des": "Loved it, definitely going back. <br><br>Woke up after NYE2015 party, craving for some good food, me and my friends decided to check this place out. This place was awesome. <br><br>They have a good variety of creative breakfast items giving enough options to meet everyone's variant food preferences. For that reason,looking  at their menu, I felt that I should order something different/unusual than the regular breakfast menu items like omelette or pancakes. I ordered \"black pepper bacon hash\" from their \"Today's special\" section. Bed of shredded crispy potato hash brown, bacon, green peppers, onions, red pepper, topped with melted cheese and covered with 2 over easy eggs(any style eggs, I choose over easy), served with toast( choose Rye) butter, fresh real pineapple jelly. So darn delicious. <br><br>All my friends loved whatever they ordered. They also have some good smoothies and coffee . Loved their green machine and mango smoothies. Service was good too. <br><br>Overall, I'll definitely and happily recommend this place if you are looking for something different and delicious.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/GGwf1-hxX_ZSs0lOEfhvbQ/348s.jpg", "caption": "Black pepper bacon hash"}]}}, {"review": {"des": "Very tasty place with many fun offerings. They have a nice selection of juices and smoothies and have awesome coffee. The day we went it was quite busy, so it was a bit difficult to get a coffee refill for some reason. Definitely try the multiple types of pancakes they have because you won't regret it. Very competitively priced for the area.", "pics": null}}, {"review": {"des": "Finally! A place where I can get a customized omelet that is cooked through perfectly, and packed full of all of the nutrition and macros that I need to make it through my day. I ordered an avocado, tomato, mushroom, and feta omelet with sausage and it arrived lightly browned, with just the right balance of ingredients so nothing overpowered any other ingredient. My husband's chicken and waffles were crispy in all the right places and nicely balanced. The coffee is spot on, too. I appreciated the attentive service without being hovered over that day, as well. Great experience and will definitely be back!", "pics": null}}, {"review": {"des": "Very good breakfast spot in the west loop area. The portions are pretty generous and everything is tasty. Fresh squeezed juice is a must when you come here.", "pics": null}}, {"review": {"des": "The oatmeal was delicious, and we didn't have to wait long to be seated. However if you're in a larger group be prepared there's not a ton of space in the restaurant & they can only divide your check between two cards.", "pics": null}}, {"review": {"des": "I really enjoyed all of my visits to this location. What stands out, though, is that the staff was very gracious when they hosted our family for my mom's birthday. It is a fairly small space, and we are a rather large group, but they made it work. The bowls are delicious (Mana Mou FTW!), the challah and brioche french toasts are awesome, and the juices and smoothies are grand-tastic! I love that they serve Eggland's Best Organic eggs, also!", "pics": null}}, {"review": {"des": "I had a horrible experiences. I went with my friend today at 940am. It was early for me. I saw the menu is different than usual. So I asked my server Amy Z about the Ruben sandwich which I usually get. She told me it is not serve until 10am. So I ordered a drink and waited. Around 1015am, my friend even finished the food, I asked Amy again to make sure she put the order in. But she handed me the check and told me the Ruben is not in the menu anymore. I was speechless. Horrible experience ever. No apologies for any misunderstandings.", "pics": null}}, {"review": {"des": "Great breakfast spot in Greek town. I was meeting a vegan friend and we picked Meli because it has a vegan menu. Excellent food and great coffee! Great, quick service as well. Can't ask for more in a breakfast spot. I had a veggie omelette with wheat toast and my friend had a tofu scrambler with toast. We both eyed other people's pancakes though--every thing looked great", "pics": null}}, {"review": {"des": "I had a negative delivery experience at their other location, but walked over to this location for brunch yesterday because it was nearby and I wanted to give it another chance. I'm very glad I did! The cafe was quaint, the service was responsive, and the food was delicious. I had the spicy flamenco omelette, and it easily made for two delicious meals. My friend had the smoked salmon omelette and had great things to say about it, as well. Wonderful brunch experience, will definitely be back!", "pics": null}}, {"review": {"des": "I really liked it here! First of all, GF options are always a plus. I also loved how fresh and food and juices were! I went twice and had GF French Toast with fruit, Corned Beef Hash, and I was able to get almond milk with my coffee. I also had a Wheat Grass shot which I loved and a Green Machine smoothie to go and they also gave me a complimentary glass of OJ! Everything was delicious. I was there with 4 other people though and we were disappointed that they were unable to split the check for us.  But that wouldn't stop me from going back!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/7QECeb2iAF6AWz0q7WSN_Q/168s.jpg", "caption": "Gluten Free Seeded French Toast"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/rkMX9xbQQzna7bq-NxrHXA/168s.jpg", "caption": "Corned Beef Hash"}]}}, {"review": {"des": "Fist time dining in here it was a Sunday great first impression. Very friendly atmosphere and great food. This place was pretty packed when we arrive there was an estimated 25 minute wait we ended up being seated within like 10 minutes. <br><br>The menus weren't too complicated. They offer a kids menu and specials along with the regular menu. Unfortunately they don't have many food options that include pancakes. Our waitress was really nice she recommended a few choices. I ordered the breakfast sampler which includes 2 pancakes eggs bacon and hash browns. The eggs were scrambled soft the way I like them. The bacon was crispy and the hash browns were flavorful. The only reason why I'm giving this restaurant 4/5 stars and not the whole 5 is because the pancakes were not to my liking. I recommend this place and I will be a returning customer.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Zj6GQCWwqnLqzNMyLJwY9g/348s.jpg", "caption": "Kids French Toast"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/-9S-CS0_7n6yEWA87Eu2XA/168s.jpg", "caption": "Bowl"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/6BCTS1knBkcdblA-bURznA/168s.jpg", "caption": "Breakfast Sampler"}]}}, {"review": {"des": "Had a really nice brunch here after landing from O'hare.<br><br>Ordered the Hash Benedict, french toast and baked oatmeal.<br><br>All were delicious.<br><br>Hash Benedict was cooked perfect and the egg was spot. The potatoes that came with it were decent.<br><br>French toast was just right. A little hint of cinnamon and not overly sweet. Didn't need any syrup for it. Baked oatmeal was a surprise. It was kind of like a creme brulee crust on top. It had a lot of raisins and bananas which I dislike, but it was still pretty food.<br><br>Interior was nice, very welcoming. Service was great. Good spot to go!", "pics": null}}, {"review": {"des": "This was my first time using a Facebook suggestion to get breakfast, and pleasantly surprised at how good the place turned out.  We were seated quickly. The service was attentive but not overbearing. The food also came out quickly. Normally I'm a little apprehensive when the food comes out within 5 mins of ordering, but it was very tasty! Their coffee was also fantastic. I had the farmland bowl, wife had the beet salad, and friend had the chorizo omelette.  The portions are quite big, some with smaller appetites might not be able to finish their plates.", "pics": null}}, {"review": {"des": "I went to Meli Cafe for fresh juice and brunch after my friend missed her train. Honestly, not the best experience. Not only was Meli extraordinarily pricey, but sub-par at best. Mango smoothie I ordered was actually warm, where the heat from the blender used warmed the smoothie. My friends Ginger juice was warm as well secondly, our Entrees were suspiciously warm as well as if they were premade and sitting in a salamander (kitchen term).  The entrees all come with potatoes and that's it. All and all go to Meli for a lukewarm experience where you can happily pay $30 per person to suffer.", "pics": null}}, {"review": {"des": "This is a must place to go for breakfast. I love their menu. You can have skillet, pancakes, Benedict, fresh squeeze juices, omelette. So many choices I love it.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/BIOATAuhwWK3QKIVPbzV0w/348s.jpg", "caption": "Green and chorizo omelette with rye toast."}]}}, {"review": {"des": "I have been here before a long time ago. I remembered i had a bad service last time but desided to give it another chance.<br><br>The service was very pleasant this time. They accommodated us right away even though we had to wait about 15min for the rest of the guest to arrive.  So we where able to start drinking coffee. <br><br>The coffee here is so good! If you are a crape kind of person this is a place you have to come to.  The crapes are amazingly delicious! I had the Cloud 9.  Everyone else loved what they order. <br><br>I will definitely come here again and recommend it to my friends.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/W8JM-j6gbUtAqUahhJIGuw/348s.jpg", "caption": "Milk Chocolate"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/OAay_4adSa3P4oHH9cLBxg/168s.jpg", "caption": "Scramble eggs with bacon and potatoes"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/CwvPnu74DxbTLnyFPH40vA/168s.jpg", "caption": "Chocolate chip pancakes"}]}}, {"review": {"des": "The breakfast food was good. Nothing special. In a place where there r tons of breakfast places. I would go elsewhere for good breakfast food and pay less", "pics": null}}, {"review": {"des": "Delicious food! Friendly service. Pancakes potatoes and eggs are my go to. Good stuff along with ALL of their juices.", "pics": null}}, {"review": {"des": "I'd place it right up there with one of the best brunch spots in Chicago. Located in a nice neighborhood. It's a small friendly establishment with all the good eats. They have plenty of options and healthy meals for the average fit person. Also, you can't go wrong with the Juice Bar. They're delicious and come in a large glass. Will definitely be coming here to eat again", "pics": null}}, {"review": {"des": "I had the waffle with fruit and my date had the Down on the Farm breakfast bowl. We were both very happy with our dishes. The environment was warm and friendly and we both enjoyed our experience at Meli. Hope to go back soon.", "pics": null}}, {"review": {"des": "This place in my opinion serves the best breakfast I have ever  had in Chicago. I've been here a few times and yes I forget to yelp a few times but this place is special to me and my wife. This particular Meli café is the first place we ever ate as a couple. Every year around the time of our anniversary we try to have breakfast or brunch there. Sometimes we try to visit them throughout the year, but sometimes you can't even get parking in the area, but that's another story. However, when you do get a parking spot, their service is excellent and their food makes up for the drive or finding parking. I know we are going back here and suggest that you guys try them out. I always recommend them to my friends and family.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/2GZkZF1vNkS8rGWjPJM5Hg/348s.jpg", "caption": "They serve so much food and it's so delicious!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/JYxJUZGkUCcE4rSQG5O07w/168s.jpg", "caption": "This was excellent and delicious at the same time!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/wP6G_gmJfHbymcmCEoLSXQ/168s.jpg", "caption": "The best hash brown ever!"}]}}, {"review": {"des": "I had the breakfast tacos. They were filling and delicious! There were 6 in our party and the food came out very quickly. The restaurant was cozy and comfortable. Definitely will go back.", "pics": null}}, {"review": {"des": "Oh my.<br><br>Came here for breakfast on a random weekday morning.  Quantity definitely trumped quality at this restaurant.  Portions were MASSIVE but altogether kind of soso.  The salmon omelet was covered in some sort of hollandaise sauce that overwhelmed the entire dish, and the salmon itself was kind of bland.  The cafe benedict was the same - a HUGE portion that even I could not finish (and I can eat a lot!), bacon, an egg that was over-poached, smothered in hollandaise sauce.<br><br>Might come back one day if I am very, very hungry (or maybe hungover?)", "pics": null}}, {"review": {"des": "It's been amazing experience. This is my firat time visiting this place, but it was great, I've ordered Nutella crepes and I have to say that was delicious. Great staff and an awesome service. Highly recommend Meli Cafe & Juice Bar at S Halsted.", "pics": null}}, {"review": {"des": "I kept passing by Meli's from my apartment to UIC, but I never stopped to check it out until recently...big mistake! Meli's is such a cute brunch place, especially in the summer; they leave the big windows open and you can have a nice meal with a gentle breeze. <br>The big game-changer of this place is that they have a special section on their menu that is vegan AND Gluten-free!!! At last my dietary restrictions are acknowledged!!!!<br>I had the Vegan french toast that was absolutely delicious. There were 2 pieces, and they were topped with fresh berries, with a little bowl of agave on the side. They also have vegan pancakes, tofu scrambles, and vegan sliders to curb all your craves. And for the regular dieters, it's a big hit too!", "pics": null}}, {"review": {"des": "One of my favorite breakfast places. Most of the plates they provide are excellent. They also have specials that change every day. Highly recommend this place if you are looking for a good place to brunch.", "pics": null}}, {"review": {"des": "The one in River North is better, but this one's pretty good too. Super small but easy to do for takeout orders due to lots of nearby street parking.", "pics": null}}, {"review": {"des": "Amazing!! It was recommended to us by the hotel we were staying at.<br>Fresh and filling food. We both got the Avocado, bacon and poached egg on toast and were blown away with how good it was. We can't wait to go back again!", "pics": null}}, {"review": {"des": "I enjoy going to Meli Cafe on Halsted for breakfast because I find found the food and service consistently good each time. As a West Loop resident people remind me that we have tons of wonderful restaurants and we don't have many sit down breakfast places that serve traditional breakfast dishes. Meli features a number of sweet and savory options that you can't go wrong with. Their breakfast bowls (think of a skillet but served in a nice looking bowl) or the french toast are a couple of my favorite items. The portions are generous but the dishes are on the pricier side, averaging $16-$18 per person with tax and tip (not including coffee). Juices and smoothies are $3 or $5. The interior is nice and the place gets really busy weekend mornings so expect to wait if you don't arrive early or if your entire party isn't present. They'll only seat you when everyone is ready to eat. :)", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/LGXpankYSruqquWtjYGZ_w/348s.jpg", "caption": "Farmhouse breakfast bowl with my touch of cholula hot sauce."}]}}, {"review": {"des": "Food quality is ok - very huge amount of food for the price! However, the customer service here I got today was terrible. First of all, they got my order wrong. I was asking for egg white since I do not eat the yolk. They changed it for me, but no one said any word to me. They just took my wrong plate and walked away. After another 15 mins, the right one was on my table. Still, no one said a word.... Then, when I was eating half way and using my phone, the bus person came to me asked me if I was done and wanted to clean my table. There was NO WAITING man and I just got my food for 15-20 mins!", "pics": null}}, {"review": {"des": "One of the best breakfast places in the area. Everyone is friendly and helpful - food is heavenly as well. I would go here everyday but I would be broke. Its a little pricey but well worth the money!", "pics": null}}, {"review": {"des": "Overall: Great breakfast/brunch/lunch option with casual prices and atmosphere.<br><br>The good: The food is delicious and plentiful. You will definitely not leave hungry. It's also pretty affordable. Plenty of options to choose from. Overall the service is friendly and the atmosphere is clean.<br><br>The bad: The check took a long time to get taken care of. The food also took longer than expected. Very limited seating.<br><br>Atmosphere: 8/10<br>Service: 8/10<br>Food: 8/10", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/lSaD9jBPQlpakcT8v6MgcQ/168s.jpg", "caption": "Goat cheese wrap with fries"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/qjKFCGxIKgDuFVgP_ahhmw/168s.jpg", "caption": "Yuppie bowl"}]}}, {"review": {"des": "Lovely spot for lunch or brunch. Portions are generous and always delicious. Fresh juices are a must. Can get a little claustrophobic around peak times, but that is a testament to how good of a spot it is.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/pn64_qVlah5_O1U0YNw6Jg/348s.jpg", "caption": "Spicy Flamenco"}]}}, {"review": {"des": "The food was good but too expensive for regular food. The crepes were good but they were drowned in some chocolate syrup that killed their flavor.", "pics": null}}, {"review": {"des": "This is one of the diners in greektown known as brunch spot.  It was a saturday brunch and we didn't have to wait too long even though the place was jampacked.  I ordered some of the regular brunch dishes like pancakes and omellets. They weren't bad.<br><br>The issue I had with this restaurant was that the servers were too apparent about pushing customers out as soon as they are done with the food.  I know it is not a mannered behavior to stay much longer after the food, but this place was too obvious that management weren't happy that customers stay one minute longer than they have to.<br><br>Won't be my first choice for brunch around the area.", "pics": null}}, {"review": {"des": "I've been to Meli a few times in the past few months and I must say the customer service is second to none! And the food is absolutely delicious! There was a slight mix up with my order today (due to loud surroundings on my end) and the staff was so courteous and understanding! They replaced my order so quickly and not for a second seemed frustrated. They are absolutely the best! I will be back again and again! I can't stop  raving to all of my coworkers! I highly recommend!!", "pics": null}}, {"review": {"des": "It was ok kind of underwhelming, I remember this place being better they used to bring some complimentary and very tasty honey to the table when it was more authentic greek breakfast spot. Now it is all russian staff blasting Pitbull for your ultimate breakfast experience.<br>Breakfast for two now costs $50 (no alcohol). $19 for salmon benedict. Kind of pricey. Oh and the honey that used to be free? You can pick up a small jar on your way out for a mere $11.", "pics": null}}, {"review": {"des": "This is where I had the best egg benedict of my life. I can see why they have raving reviews. Ate brunch here on Labor Day and there was a short wait for our group of 5. Parking around this area seems to be difficult to find?<br><br>I was amazed by the extensive menu options - it can be hard to choose! Egg benedict is my favorite breakfast item, so I settled on that list and went with the Hash Benedict. Food didn't take long to come out and upon my first bite I knew I had made the right choice. Excellent combination of texture and flavor. It was a huge serving that came with baby red potatoes, so I only able to finish one muffin.<br><br>Also tried my cousin's Mixed Berry french toast. Delicious but too sweet for me even without maple syrup, two bites is good enough for me.<br><br>The menu also included a selection of juices and smoothies! However I only ordered a small orange juice because I knew I would have gotten too full. Their healthy smoothies contain combinations I would like, though, and I would have gotten one to go if I weren't going to be flying out after the meal.<br><br>Highly recommended!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/SJS6Xjnm98srDXaA0XSUDg/348s.jpg", "caption": "Hash Benedict"}]}}, {"review": {"des": "Walked here from our hotel and it was delicious! My skillet was great, the veggies were crisp and the potatoes were full of flavor not salt! My kids had the French toast, the chocolate chip pancakes and the Nutella crepes and each one was tasty and sweet! They loved it! Will definitely come back again!", "pics": null}}, {"review": {"des": "Went here after a few years. Place was busy but wasn't a line on a sunday. Service was good. Food was ok.  First they raised the prices and lowered the portions.  The jam which is usually tasty was bland.  They should revert back to the original or make modifications that benefit both the guest and restaurant.", "pics": null}}, {"review": {"des": "The food was terrible... sike naw, this shit was good as hell. Everything was fresh, the jam was great. Everything looked amazing. Some of the best breakfast I've had. 10/10 recommend stopping by if your in Chicago.", "pics": null}}, {"review": {"des": "Excellent quality of ingredients, plus it has a variety of healthy options. The Orange and carrot juice are fresh (no concentrated) coffee was fresh. The reason why not 5 stars is the place is super small tables are too close (no booths) decoration and music should be clearly defined.  Usually there is a line here.", "pics": null}}, {"review": {"des": "My favorite brunch place in Chicago! This is a charming cafe perfect for brunch or lunch in Greek town. Fresh juice and jams, great coffee and omelets. Also, friendly service. Thumbs up.", "pics": null}}, {"review": {"des": "Spent the New Years brunch here and it was wildly busy! After getting seated after 40 minutes I started with grapefruit juice which was amazing and so fresh. The meal itself was typical brunch, I would feel comfortable comparing to an eggsperience type of brunch. I had an avocado caprese wrap which was comparable to any sandwich shop. I also had their special which was a croissant French toast-- lackluster. They also messed up our order a few times. The service left a lot to be desired, especially after a 45 minute wait. <br>I would return for an average brunch if the wait was not significant.", "pics": null}}, {"review": {"des": "Some of the waitresses don't seem to understand people who speak English at times but being patient will pay off because the juice and the food is fresh and tasty. The Service could be a little better but I will definitely go back. It's a parking garage nearby that make it easy to go there.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/3IxP3SOxuCKZK0X777WY8A/348s.jpg", "caption": "Family fun"}]}}, {"review": {"des": "Friendly service and decent breakfast items. Their red potato side that accompanies most dishes are awesome. I like their fresh juice selection, but it's a bit expensive though. Overall, a nice place for brunch.", "pics": null}}, {"review": {"des": "Reasonably priced breakfast/brunch cafe with a variety of menu items. I like the omelets, the breakfast bowls, the benedicts, the pancakes...basically everything that they serve here. There's nothing fancy/gourmet about Meli Cafe; it's a pleasant cafe with friendly people that serve delicious breakfast food", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/SVJVCiweD0E-5nReBvIpcw/348s.jpg", "caption": "Eggs Benedict"}]}}, {"review": {"des": "The food was very delish! Wife had nutela crepes with strawberries and i had pork belly eggs bendict. Food came out fast. Only giving 4 stars since server took 10 minutes to take our order.", "pics": null}}, {"review": {"des": "This place is a gem!<br>After being sorely disappointed about the service at the Cafè on the opposite side of the street we walked across to Meli's -- and we were so happy that we did! My husband and I ordered the park belly eggs Benedict to share (which was a wise decision ;) ) and it was so so SO good! <br>Even though the place was hoppin' we were almost seated immediately. Our waitress was very friendly and even though it was a busy morning we did not have to wait long for our food at all. I highly recommend this place (for food, service and people watching :) ) <br>We will definitely be back!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/3I1vJ29r_Zv4UDpdx4i0kw/348s.jpg", "caption": "The pork belly eggs Benedict was an excellent choice! -- the hollandaise sauce was the best I had to date. Yum! :)"}]}}, {"review": {"des": "Excellent food. Always crowded but worth the wait. Friendly helpful staff and omelets that are the bomb", "pics": null}}, {"review": {"des": "This has always been my go to spot for breakfast when I'm in the city. I was really disappointed in my breakfast this morning.  Our food took longer than normal to come out. Tables seated after us received their food before we did. In addition, my chicken and pear omelette with red potatoes had a chemical taste to it (almost as if pan wasn't fully washed and there was cleaning product still left on it).  I still have the after taste in my mouth. Our waitress was not attentive, she didn't ask if something was wrong with the food after seeing that I had only taken two bites out of the entire meal. They brought out white toast when I asked for Greek toast. The servers response was we don't have greek toast and gave me an attitude. This was something I should have been told at the beginning. I'm giving them 3 stars because my daughters food was good and she was happy with her meal.", "pics": null}}, {"review": {"des": "As this is my nearest neighborhood breakfast spot, I have been here many times, both during busy and not busy hours. The food is simply amazing. On my most recent visit I just got a simple pancakes, eggs, meat and potatoes. The potatoes are perfectly seasoned and just the right size to be hearty and not dry. The eggs were perfectly fluffy and cooked just right. <br><br>Most of the negative reviews seem to be from people ordering vegetarian substitutes, so apparently, don't do that. And for those complaining about the charge for more syrup, it's real maple. I stand by the fact that the service is not super friendly, but they are attentive so it's not a big deal.", "pics": null}}, {"review": {"des": "Sadly, this place does not have a liquor license, so my dreams of a delicious bloody mary were crushed...by a glass of juice made with wheatgrass. Don't get me wrong, the juice was really good, it just wasn't what I was hoping for. (Apparently their other location has alcohol.) I can't remember what I ate, but I think it was some sort of scramble that was super duper tasty. The wait was long, but probably worth it if you have time to spare.", "pics": null}}, {"review": {"des": "If there has ever been a battle that I've truly struggled with in life, it has been choosing between a savory dish or a sweet dish for breakfast. <br>You see, I'm either going to get a huge stack of pancakes or French toast, or I'm going to get a 5 egg omelette with hash browns that are the size of your face. I can't do a little bit of both. Luckily, my inner fat child ordered two dishes at Meli and the best part is that my friend and the server didn't judge me whatsoever. <br><br>Okay, ramble over, on to the food. <br><br>Eggs are eggs, good portions. Their house potatoes were great, I have no idea what seasoning they use (I think Rosemary is one of them) but it works and I could have definitely had more, they were roasted perfectly. <br><br>The strawberry cream stuffed French toast. <br>By the beard of Zeus, this was incredible! Nothing better than sweet white cream in your mouth, am I right? <br><br>You're awful for thinking that, pervert. <br><br>Get it, get it!", "pics": null}}, {"review": {"des": "HASH BENEDICT! I haven't seen it on any other menu where I've been except on multiple menus in Chicago, so I figured I should order it.<br><br>Good choice, me!<br><br>The hash was perfect and not greasy at all. They also didn't put too much hollandaise, which is usually a pitfall of brunch places. The potatoes were excellent but reeeaalllly salty. My mom got the yuppie bowl and it was SO good.<br><br>Overall... awesome.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/uLTRYDG4moN6pRrTiKDFmQ/168s.jpg", "caption": "Green envy"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/TXQIuDo9G5gybZ8CmRW-aw/168s.jpg", "caption": "Hash Benedict. Delish. Perfect hash."}]}}, {"review": {"des": "My cousin and I were looking for a brunch spot to eat at and we found this place nearby (it was also the #1 result for brunch spots near UIC). There was an ample amount of parking spots within walking distance of the place. <br><br>The staff was very nice. Service was also very quick and they checked in on us once in a while to see how we were doing.<br><br>I ordered the Farmers Egg Benedict which was really good. My cousin ordered the Hash Egg Benedict which he highly recommends. <br><br>The prices here are not too high and I'd definitely come back.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/v_KWKVfpThnaj-4i6bZY-w/348s.jpg", "caption": "The one at the top is the Hash Egg Benedict; the other one is the Farmers Egg Benedict. Orange juice was decent."}]}}, {"review": {"des": "There is something about 'une petite tasse à café' that gets me every time. Steaming coffee served in a properly modest cup as opposed to an oversized mug or a flimsypaper cup makes me feel like I am in the right place and spending my time as I should. Good coffee and great wine can have that effect on me.<br><br>I am happy to report that the house brew at Meli's was delicious, a medium roast perfected for wake-me-ups. The freshly squeezed orange was also flavourful, but mine wasn't chilled. <br><br>I ordered the cafe eggs benedict, made with pork belly, tomato, spinach and your classic hollandaise sauce, and paired with baby red potatoes.<br><br>I got what I asked for- thick slabs of meaty pork and soft diced potatoes sprinkled with fresh parsley. My eggs were poached correctly and I didn't need the usual garnishes (ketchup, mayo, whatever) to boost taste in any way. The order came quickly and the portion was huge (I did not finish it). But I will say the potatoes were slightly over-salted and I prefer my english muffin more toasted, but that is to taste in both cases. <br><br>My waitress disappeared on me so I didn't get any \"check-ups\" or a much needed coffee refill until much later into my meal. I could see her chatting it up with the bartenders so this was not due to business. Her other patrons also noticed.<br><br>Overall I wouldn't hesitate to give this establishment a 4.5 or 5 stars if it wasn't for the warm OJ, a soggy muffin and a friendly but flighty waitress. See also my tip below for another oversight on management's part. <br><br>It's also important to note the place is not cheap. $15 for eggs benny is a bit much. But the portions were more than fair. <br><br>I RECOMMEND: The cafe eggs benedict for a breakfast crave or the kale chicken caesar wrap if you're on the lunch end of the brunch spectrum. <br><br>EXTRA TIP:  NO WI-FI access for customers, although there is clearly Meli wi-fi in the building. (Major FAIL in this day and age, and not considerate of the travelling/working diner). I came to Meli for a leisurely breakfast but had to rush and make my way back to the Starbucks around the corner for the work portion of my lunch break. Unfortunate. I liked the Meli ambiance. <br><br>ALSO NOTE- It gets busy around 12:30-1:30 even on a weekday. The sandwiches make for a good lunch so no surprise there.", "pics": null}}, {"review": {"des": "Delicious food. But really? $1.50 for a shot of syrup? That's just cheap. You already charge $6 for juice. Just give my kids some syrup.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/HNNp6dvi9knAQLA-rdlP9Q/348s.jpg", "caption": "$1.50 shot of syrup. Extra charge. Seriously?"}]}}]}