{"name": "mercat-a-la-planxa-chicago", "reviews": [{"review": {"des": "We went for brunch after the Hot Chocolate Run this year.  There was no wait, the hostess seated us quickly and our server came our promptly to ask for our beverage drink.  The bloody mary was not something to write home about.  However, the dishes we ordered more than made up for it.<br><br>We got the hanger steak and the Mercat burger.  Both were equally delicious.  The hanger steak was cooked medium rare and melted in your mouth.  The Mercat burger was cooked with purpose and had truffle fries on the side with some spicy mayo.  Amazing time!  Looking forward to going back for more tapas!", "pics": null}}, {"review": {"des": "Amazing tapas joint!  Great location, nice ambience, reasonable prices, and of course wonderful food.  Not sure whether it's authentic since I've never had tapas in Spain (I believe they just call them comidas there) but I love just about everything we ordered. <br><br>BTW despite of the hyper flavorful dishes, beware of how much you order and eat.   It's eat to overdo tapas and feel sick and sorry afterwards because it can to too rich if taken in large quantity.", "pics": null}}, {"review": {"des": "**BAR/LOUNGE REVIEW ONLY** <br><br>Food Order: \"Pa amb tomaquet\" Al Estilo Catalan (crispy ciabatta bread brushed with ripe tomato, Arbequina EVO oil, and a touch of sea salt)<br><br>Drink Order: Cosmo and Old Fashioned<br><br>Environment: The restaurant and bar/lounge is actually a very beautiful location.  There are multiple levels including a balcony area and small nooks for both dinner and lounge areas.<br><br>Verdict: The food (tapas menu) was actually pretty disappointing for vegetarians. The signature dish we ordered was not very good (lacked flavor).<br><br>How They Get More Stars?: more vegetarian friendly food options or even just small bites/appetizers for the bar area. <br><br>Tips: Order at the bar and take your drinks upstairs to the balcony area.  There is also a smaller lounge/bar on the basement level (it is not connected to the restaurant, but has the same name) - it has more of a sports/dive bar.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/d9U32WLBUcv2jqqGPVpwdA/348s.jpg", "caption": "Cocktail menu"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/_CzPctlbboBk-LPXm18_Jg/168s.jpg", "caption": "Bar area"}]}}, {"review": {"des": "Had tapas here on Wednesday night. The restaurant has a nice atmosphere - it's well decorated with high ceilings and an open feel. Our server was friendly and very knowledgeable about the menu. My drink was good. However, I felt that the food missed the mark here. <br><br>Drink: <br>Sangria Rosado - sweet and tasty, ordered a pitcher (probably around 4 drinks) for 46 dollars <br>Food:<br>Pa amb Tomaquet (w/ ham) - honestly my favorite dish, bread with a tomato spread and prosciutto. Very filling and flavorful <br>Vieiras - scallops, comes with 4, just okay- I kind of expect a restaurant quality scallop to melt in my mouth and these did not<br>Pulpo con Patatas - octopus with potatoes seasoned with paprika, this dish was tasty<br>Pimientos del Padron - would recommend the padron peppers, a simple and fresh dish <br>Croquetas de Jamon - recommended to us, a fried ball of ham with sauce on top, didn't enjoy this one <br>Coca Fina de Lomo de Atun Rojo - tuna flatbread, beautiful presentation, a bigger portioned tapa<br><br>Like I said, if you're going out to eat solely for tapas there are other restaurants in the city with tastier morsels. But if you're in the area or staying at the Blackstone it isn't a place to totally avoid.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/9kmdEXguFJDp-4dxSX9Kjw/348s.jpg", "caption": "Vieiras"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/7Hy579pBDJT5so-JYVujFg/168s.jpg", "caption": "Coca fina de lomo de atun rojo"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/lTgfItpuMOfxFkq8WXa9og/168s.jpg", "caption": "\"Pa Amb Tomaquet\" al Estilo Catalan"}]}}, {"review": {"des": "Delicious fresh food. Went with friends for light dinner and we were all delighted with our choices, from the green salad to the potatoe tuna salad , the excellent flatbread with sashimi grade tuna to the scallops<br>Lovely location overlooking grant park, lively atmosphere and nice layout. Conversation friendly .", "pics": null}}, {"review": {"des": "Came here with friends and really enjoyed the food. The fried calamari and bacalao were standouts. Paella was great especially given the amount of uber-fresh seafood that was on it. We ordered a bottle of white which paired well with our seafood heavy dinner. The desserts were a bit too rich for my taste but executed well. Only quibble is the price - I get that's likely due to the location but this makes it a place I can't come back too often or I'd be broke.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/MJPXY-_SLiELFwksHRsRuw/348s.jpg", "caption": "Spanish cured meats"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/1BX2B4TgKZ97X0J5-PCkPQ/168s.jpg", "caption": "Patatas Bravas"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/8d0LAVRcQjNLL9teBsoT4A/168s.jpg", "caption": "Fried Calamari"}]}}, {"review": {"des": "We stayed at the Blackstone hotel on a trip to Chicago and had an evening meal here one night. The food and service were outstanding. It is pricey, but we had such a good time we felt it was worth it. We shared several tapas, including the gampas garlic shrimp, diver scallops, calamari, and mushroom flatbread. Everything was fresh and well prepared and served hot. Interesting wine list mostly from Spain and several unusual cocktails as well. Liked it a lot, 4.5 to 5 stars.", "pics": null}}, {"review": {"des": "Food was great. The hollandaise sauce was amazing! The eggs were also very tasty. The service was okay, it is nice that someone comes around to refill your water and the team very obviously works together. So although I didn't see my waitress much I didn't ever feel I wasn't receiving great service.  The restaurant offers a different breakfast experience including Spanish choices and my Benedict with chorizo was very tasty.", "pics": null}}, {"review": {"des": "The Assistant GM messaged me on Yelp after I posted my review. <br>She wanted me to contact her. <br>I called and left 2 detailed voicemail messages and never received a returned call. <br>So, what's the point of replying to my review and asking me to contact you if you have no intention to actually follow up with me??", "pics": null}}, {"review": {"des": "Hosted clients for a business dinner here recently with the tasting menu and the wine pairing. The food was incredible and the restaurant even accommodated for two vegetarians in the group to be included in the tasting menu with separate veggie dishes. From the bacon wrapped dates, tomato bread, paella and dessert (ordered separately), every dish was executed well and unique. The wine pours were generous and just kept coming with each course - the red blend at the end was the table favorite. Make a reservation because it can get busy but don't miss out on Mercat.", "pics": null}}, {"review": {"des": "We went to Mercat last Saturday because it is so closed to our place and we always wanted to give it a try. The food was good, but not good enough to justify the price we paid. <br><br>We ordered XORIÇO, EMBUTIDOS IBERICOS, CORDERO, COCA DE ESCALIVADA (FLATBREAD) and BACALAO.<br><br>XORIÇO - smoked paprika-garlic sausage - I love the taste of paprika spice and I like sausage in general, so I thought this would be a good appetizer to start the night. The smell was excellent when the plate was served. After I took a bite, I was disappointed. The sausage was very chewy and too salty for me. However, fiance loved it because he likes salty stuff.<br><br>EMBUTIDOS IBERICOS - selection of spanish cured meats - the taste was good; however, I didn't expect that much of olive oil on the plate. It felt like the meats were soaked in olive oil. My fingers got very messy when I tried to wrap the meat around the finger bread they provided. <br><br>CORDERO - two lamb chops - I love how tender the lamb was and the taste of the sauce. The lamb chop is thicker than the ones you can get from other restaurants. However, $15 one piece and nothing else on the plate? Maybe a little expensive...<br><br>COCA DE ESCALIVADA (FLATBREAD) - flatbread pizza with roasted eggplant and yellow squash - interesting topping for flatbread and it tasted fresh and delicious. Also loved the whipped goat cheese.<br><br>BACALAO - Atlantic cod - cod was tender with crispy skin. Some spice they used was very spicy, so be cautious when you order this dish.<br><br>For dessert, we ordered TORTA DE XOCOLAT and ARROZ CON LECHE CROQUETTE. Both were so-so.<br><br>Fiance also got a soft drink and had 2 re-fills. Total bill went up to almost $130 with tax. Although tapas are usually expensive given the portion, this place is comparably more expensive than other tapas places given the taste and amount of the food.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/LVN39xjAxf0Lo0_qDTFIUg/348s.jpg", "caption": "lamb chop"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/eDo1Tg0D2Gt61x4ARJPwYA/168s.jpg", "caption": "spanish cured meats"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ltL7cbX9XPjBcNzfePnI_A/168s.jpg", "caption": "Atlantic cod"}]}}, {"review": {"des": "I was tired after a long day of work and just wanted something quick - Mercat was attached my hotel, the Blackstone, so I just jumped over there around 7:00 on a Thursday. <br><br>It was surprisingly dead for the time, not even half the tables were sat. I head over to the bar hoping for quick service and a cold drink. Well, eventually I got my drink. The bartender was in a foul mood - after 10 minutes, not kidding, he came over and asked what I wanted to drink. I asked to see a menu, and then the first two drinks I chose he \"couldn't make\". Finally I settled on the Mercat Gin and Tonic. It came in a wine glass and was fantastic - which it had BETTER be for a $14 cocktail... It had cardamom, lemon, and rosemary. <br><br>After a while I had to ask him again for a food menu. I ended up asking a server who was buzzing around questions about the menu, how much a single diner should order and what his recommendations were. He was very helpful and gave me the whole spiel. He said that Chef's favorite item on the menu was the lamb dish. It was described as \"rack of lamb\" and was $30. I caved and ordered this, and also the bacon wrapped dates to start. <br><br>The bacon wrapped dates came out immediately, there were four and that were two per toothpick (to give you a size idea). They were in a very small bowl with random greens below them. The server brought out what he called \"la peral cheese fondue\", it was hot blue cheese. He poured it over the whole bowl. I ate one and LOVED it. SO good - they finely chop marcona almonds and stuff the dates so there was a nice crunch. <br><br>While delicious, they were small and I was hungry. Imagine my surprise when two tiny circles of lamb came out and literally nothing was on the plate with it besides a red smear of romesco. The lamb was cooked perfectly and the seasoning on the outside was great. The only downside was now I was $54 in at this restaurant and I was still hungry. I was nursing my drink very slowly to make it last longer. <br><br>I decided that the less than friendly atmosphere wasn't for me, and I wanted to head back to my room. I asked the bartender if there was another small plate I could bring back to my room like cheese or olives. He said I had to get the ham and cheese croquettes, at $12 more. I agreed as they did sound good. I paid my $75 tab (including tip) and went back to my room. You guys these croquettes were gross. I was so bummed. They came with the same sauce as the lamb and were lukewarm. When I bit into one the whole thing disintegrated and I was just attacked by salt. I ate a few and tossed the rest. <br><br>I think that the flavors were there, and it has a lot of potential to swing back around - but the prices for the quality were really off. That and the surly bartender just did not provide for a positive experience.", "pics": null}}, {"review": {"des": "Fantastic small plates and drinks! Service was good but a little cold ... but the atmosphere was very warm and elegant", "pics": null}}, {"review": {"des": "Go up the elevator and be introduced to a beautiful dining room with smiling faces.<br><br>Wonderful decor and delicious tapas await.  Cocktails are all very smooth and unique.<br><br>The most memorable dish was the tuna flatbread..with Saffron aioli and truffle oil, and a lemon touch...so good!!!<br><br>The best thing I ate here was the peach dessert, perfectly crisp and topped with ice cream...YUM!", "pics": null}}, {"review": {"des": "Fabulous desserts in a Sexy Space - small portions mean buttons won't burst as romance blooms!<br><br>Came here on a wild and stormy night to have an after dinner dessert feast.<br><br>Bar seating was available at 8pm & the space loosened up after about 9pm but if you're coming earlier be ready to stand or wait n wait without reservations.", "pics": null}}, {"review": {"des": "Jamon with Apple, are u kidding me? Very bad Spanish foods! Won't recommend to anyone!", "pics": null}}, {"review": {"des": "The food was exceptional, which is why I gave this restaurant a few stars. I ordered scallops, bacon wrapped dates, and ham croquettes. All of which were sensational. My (much) less adventurous coworker ordered the verde salad and potatoes. She seemed satisfied.<br><br>Unfortunately my overall experience was terrible. When I first arrived a gentleman in front of me was taken right to a table; however, when I asked to be seated there was \"checking for a reservation.\" Really? Not the men before or after me, but OK. Wasn't going to let it spoil the night.<br><br>We were seated and waited almost 10 minutes before we were greeted by our waitress. She apologized and took our orders and almost immediately my first course was served. My colleague and I started to work on a project and then 10 minutes went by. Then 20. At about 30 I was starting to get really upset. Our waitress visited other tables, checked in on folks, and refilled wine glasses but not once did she ask if we were OK. <br><br>Finally she spun around and asked if we were doing ok waiting and I asked her how long it usually takes for food to be prepared. She let us know she thought that because I waited to eat my appetizer that I was in a work meeting and wanted to wait. Which doesn't account for the 15 mins after I devoured my dates and put away all paperwork. Also, why wouldn't you just ask? <br><br>The rest of my food was outstanding, but the service left a lot to be desired. Perhaps it's because my coworker and I were younger. I dare not say that it was because I was the only black person in the restaurant outside of the wait staff. What I do know is that my company saved a lot of money on the robust tip I was prepared to offer for good service.", "pics": null}}, {"review": {"des": "This is in the property of Blackstone hotel.<br>It's quite a huge place. The servers are professional and courteous.<br>The food is good.<br>Loved the lamb ravioli !", "pics": null}}, {"review": {"des": "Another trip to Chicago so we finally decided to have dinner at Mercat.  The atmosphere is nice, dimly lit, and service is excellent.  <br><br>Didn't know what to order so proceeded with chef choice.  Excellent.  My favorite are the following:<br><br>1. Olives and bacon wrapped scallops <br>2. Scallops<br>3.  Butter grilled shrimp with bread<br>4.  Meat Paella<br>5.  Steak<br><br>Highly recommend.", "pics": null}}, {"review": {"des": "Hotel bar so nothing too over the top here. It had a really nice atmosphere inside, dimly lit and comfortable seats. The drinks and presentation were good here but the waiter was not very friendly and seemed annoyed most of the time serving our group. Nice wine list and full bar here. <br><br>If you are feeling relaxed and just want a spot to hang out at before you head to bed this is it. Don't make a special trip here for the bar, it's a nice addition for guests at the hotel though.", "pics": null}}, {"review": {"des": "A couple of my friends recommended this place to me, and I was extremely disappointed by the experience. We ordered a smoked salmon potato omelette ($18). It came with no sides, and the portion was quite small. The lamb burger ($18) came with a side of fries that was overly salted. The service was mediocre and one waiter was outright rude. We were seated down, but didn't really like our seats so when the waiter came over to pour us iced water, we asked him if we can move to the table close by the window. His response? Yes, but only once. We didn't really give him a response because we were in shock. Why would you make such a comment to your customers? It's even unacceptable if I am at a fast food joint, let alone a proper Spanish restaurant that's inside a hotel! I would not recommend this place!", "pics": null}}, {"review": {"des": "Mercat a la Planxa is definitely an interesting restaurant. Came here on a Thursday for lunch (6/8/17) not knowing what to expect. A vendor suggested we try this place, and I was along for the ride. <br><br>The menu is somewhat small, yet slightly difficult to decipher. We asked our server for a brief rundown, which was super helpful. After some indecision, I decided on the ravioli d'anyell (lamb ravioli), priced at $17. This place is a little pricey.<br><br>The atmosphere is great. I really enjoyed the open space. The decor was on point. Exactly what you would expect from a restaurant with the name that it has. No complaints about the ambiance. I'm not sure what the first floor is all about, but we sat on the second. Service was slow at times, but friendly. <br><br>I thought the food here was really good! I loved my ravioli. Everything was on point. The serving sizes were not very substantial, however. For the price, I was expecting a little more, but I've definitely been to worse. Bring some extra cash if you come here hungry. <br><br>While the food is great, I'm not sure a simple entree will fill you. That being said, I think this restaurant is more of a small plates/tapas kind of a place where you share. Now that I think about it, I guess we went about it all wrong! I would definitely recommend this restaurant to those looking for a unique experience. Go ahead and check it out!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/uAkNGxBX8lC-beNtfwzD1Q/168s.jpg", "caption": "Ravioli D'anyell"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/UCwDkrcpf8Z866TDXb7Dbw/168s.jpg", "caption": "Menu"}]}}, {"review": {"des": "Love this place!!!! The Mercat benedit was delicious! I also got to sample the French toast, the flank steak breakfast dish and the scrambled eggs with lobster dish..which all were amazing! This place is conveniently located inside the black stone hotel where I was staying. I was a little skeptical reading the menu before heading here since it's so different but I promise you will not be disappointed. Can't wait to come back.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/v_z8PmBD_nkUP5qOn2OYVg/348s.jpg", "caption": "Mercat Benedict was delicious! Definitely recommend!"}]}}, {"review": {"des": "Rough go at the place in terms of getting food and value proposition. <br><br>I ordered the boquerones, an anchovy dish which I have had at places before so I know that I like the dish. The execution here was very different, being the orange slices served with it and the green olives. One wouldn't think green olives with an already salty fish & oranges together. It actually worked. I did wish there was some sort of starch with it, though - it needed it.<br><br>At the same time I ordered the boquerones, I ordered one of the pulpo dishes (which is octupus). It took about an hour. And it was a very tiny piece of tentacle. They clearly had an issue, at the expense of my time, but the bartender serving me did remove it from the bill so that was fair/nice.<br><br>Even though the cost is about $30 (not including tax, tip, drinks) for those very small dishes, I had to order more. Those tiny bites of food weren't close to being enough for dinner. I don't have a problem spending money on food... but come on!  <br><br>Next I went with the ravioli, it had oxtail, fresh peas and a light sauce. It seems like there were bonito flakes on it, and ended up tasting more like a tuna past dish. Weird though because it was oxtail. It wasn't bad but seemed misrepresented and need more seasoning. The fresh peace were really good. <br><br>I even went with a dessert, which I don't often do, but since I did not really get very full. Olive oil cake sounded great. I ate about half and that was all I could do. It wasn't very good. The cake was dense, cold, almost gritty. The accessories to the cake overdid it on the citrus. What is with this chef/restaurant and oranges?? There was orange marmalade in between the cake, a dried orange in top, citrusy orange sorbet on top of the cake (should probably go on the side) and a sweet caramel sauce. They should've probably taken it off, too but since the pulpo fiasco, I didn't expect any more. <br><br>Overall, the bartenders were great (I ate at the bar). Food was good, kitchen needs to improve timing, and again the value proposition is way off. I've spent $100 or more on dinner before, and that's fine, but it's gotta be worth it.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/FRM0ddLu_SPTCAPyITjw3w/348s.jpg", "caption": "Olive oil cake was not for me"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/eWW2Ioc8dlMZ-OaMHGK5Pw/168s.jpg", "caption": "The dechutes is delicious!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/bjafvyive-3C-IOh8HeRig/168s.jpg", "caption": "Oxtail ravioli"}]}}, {"review": {"des": "It has been some time that I have been there but my first statement about Mercat is that if you want to \"feel like you have arrived\" then go!  My first time going to dinner at Mercat was like I had stepped into the Sex in the City movie where the energy and vibe of the place was high and mighty.  <br><br>Upon getting to our table, the waiter suggested going with the chef's tasting.  Everything was great.  Service was fantastic.  One of the highlights was this chocolate fried dessert trio.  Each morsel of chocolate was fried and had a savory sauce with it.  When you put it in your mouth, it seemed to explode - each with a different herbal tone.  <br><br>Mercat is one of my favorite places to take someone or people who want to feel special.  I have always really enjoyed it.  It has four stars because I save a 5 star rating for a place that makes me feel special in my tummy and in my soul.  They nailed the tummy part but did not connect with the waitstaff as much.  However, they were still good.", "pics": null}}, {"review": {"des": "I love tapas. I love tapas, but I know that I am someone who finds one favorite place and rarely navigates. Last night, I'm so glad that I did. We came to Mercat dying for some Spanish food and I was blown away. <br><br>Things we ordered: Blanco Sangria, Patatas Bravas, Gambas Al Ajillo, Tortilla Espanola, Ravioli d'Anyell, and Churros for dessert. <br><br>Most of these things are typical orders for me when I have tapas, but I was blown away. The Patatas Bravas was served in a way that I had never expected (almost tater tot shaped) and were deliciously smoky. The Gambas were slightly spicy but perfectly cooked; the Tortilla Espanola had the MOST DELICIOUS saffron aioli I wanted to lick the plate. And maybe you're like, \"Ravioli?\". I know. Don't overthink it. It's fantastic. Like actually top two things I ordered. <br><br>The sangria is bomb - sometimes it's made with too much fruit and it get bitter and weird but this was perfectly sweet and citrusy. <br><br>If I'm honest, I almost gave 4 stars because the Churros are v salty (I didn't read the menu stating that there is manchego cheese in them). I have never met a Churro I didn't wanna marry - and at a Spanish restaurant no less. <br><br>But fear not: our server was phenomenal. Quickly recommended this peach dessert (don't remember the name) that was astounding and so flavorful with crispy phyllo pastry and perfect peach sorbet. <br><br>Overall, higher end price, but worth every single penny. Will definitely be returning. And I mean, like, tomorrow.", "pics": null}}, {"review": {"des": "What a great experience! Went on a Sunday around 2pm. Restaurant was pretty quiet; there was a Bears game. Our server, Joanna, was very attentive- a perfect balance of checking in on us, but not in our face all the time. We went for celebrated 2 people's birthday so they gave us champagne for the birthday girls, as well as this AMAZING, DELICIOUS chocolate covered ice cream at the end. It had horchata ice cream with rice crispies covered with chocolate.- typical chocolate truffle size Yuuuuuuum! I can still taste it in my mouth. <br>As far as entrees, we didn't do tapas. Each person ordered their own brunch. I had rainbow trout and ordered side rice for my daughter. Rice was good with perfect flavor & crispiness. Overall, my experience was great in both food, service, & the quality. <br>They have valet available.", "pics": null}}, {"review": {"des": "Oh where to begin.... I've been wanting to try for as long as I've lived in Chicago and finally got a good excuse with a gift certificate.<br><br>I arrived and was seated immediately. The dining room is beautiful and a good vibe. I ordered the Mercat G&T, verde salad, and xoco fritos. The drink comes. The gin is good, but the flavors in the mixer were a bit bland. I sip away and it is 50 minutes later until the salad arrives. A leaf with a large brown spot sits on top. I quickly move it. Overall, good flavor and love the spicy combo with cucumbers to balance. The xoco fritos arrive as I'm working on the salad. The description led me to think it'll have rice, but it looked like they fried it with rice in the batter. Pretty solid. <br><br>The wait was pretty long. I was thinking of doing a fixed meal, but glad I didn't. The couple next to me did and they had some long waits followed by a lot of plates at once. For me, the G&T became diluted and I finished it without a check in. A manager or someone came to apologize for the delay as I was finishing, but that appeared too late. <br><br>I asked for the check. It came and sat with my credit card for 15 minutes. I even moved it to make the credit card more visible. The waiter also checked with the table next to me during that time. A server even put dessert hardware on the table, even though I didn't order anything and a check and payment sat on the corner. While I normally don't mind an off check process, it's been a longer dinner than expected. <br><br>I had high hopes to return to try the paella, but am left very disappointed. Food was good, but service didn't cut it.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/zDQJ-j9fhzKyYJ8_osnyAg/348s.jpg", "caption": "Mercat G&T"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/k-VhihdVwxwwm7jXjAZJnw/168s.jpg", "caption": "Xoco fritos"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/cPCZPdRB9pA02p8DXl2rXg/168s.jpg", "caption": "Verde salad"}]}}, {"review": {"des": "Would not recommend brunch. Was impossible to find with no outer sign on Michigan. Although completely empty w no wait time to get seated, service was slow and food was meh.", "pics": null}}, {"review": {"des": "Great menu, great breakfast! Took my parents for breakfast here a few days ago and we absolutely loved it! I ordered a very basic two eggs any style and was pleasantly surprised by how amazing they made it for something so simple. A little pricey but worth it. Conveniently located inside the Blackstone hotel.", "pics": null}}, {"review": {"des": "Had dinner here with colleagues. We usually love tapas, but I was underwhelmed with this experience.<br><br>Beginning with the good. They have a lovely Spanish wine selection and the food is very good. The bartender is very sweet and attentive. Perhaps the best thing about this place is the atmosphere--it's stunning inside and out. Great vibe!<br><br>We had a reservation but all of the staff were eating together before the dining room opened. The bartender greeted us, served us drinks and had us sit in the lounge area until the waitstaff was ready. After the staff ate dinner, the scattered back to the kitchen and we were ignored for 20 minutes before we were able to track down a hostess to seat us. We ordered many items from the menu, all were good-nothing to die for. I know tapas are small, but I felt that everything was significantly overpriced with the exception of the piella. I spent over $60 as an individual and came with a group of 6 and left with plenty of room for dessert. In summary: food is good, but not worth the price, service is so-so, and ambiance is amazing!", "pics": null}}, {"review": {"des": "Boy has this place slipped! From the food, the service, and overall cleanliness...it was such a disappointment.  They have invested zero in updating anything in the past years and it seems they are happy to just get by. Too bad.", "pics": null}}, {"review": {"des": "What happened to this place? I remember when it first opened in 2008ish, it was excellent. Even four or five years ago, it was still great. <br><br>But we went last night and it was...not good.<br><br>The service was attentive and the bottle of wine that was recommended was very good. But the food? Every single tapas item that came out was under-seasoned and either incredibly bland, or incredibly oily. <br><br>We were starving and had to make curtain for the show we were going to, so we just downed the wine, picked at the tapas and headed out. <br><br>Maybe it was because it was a Wednesday? No clue but sad to sully the great memories of fantastic meals I've had there.", "pics": null}}, {"review": {"des": "We were a group of 6 and decided on all having chef's tasting menu. I'm not going to describe each dish in detail, but the most awesome part is that they don't skimp on portion! So many dishes. So much food. As a plus, the sangria was very good. Some of the dishes popped out as excellent: I particularly liked the stuffed dates (super sweet and oily, so cheating), but others decided that the shrimp was their favorite. The interior design of the restaurant and the lobby is beautiful.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/QJ2hsZzVMTf1xy5foqSYNA/348s.jpg", "caption": "Lobby"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/7mD82AikMxUcKoXMCQtN9Q/168s.jpg", "caption": "Shrimp"}]}}, {"review": {"des": "I've been to Mercat on a few occasions and have had different experiences. <br><br>The good:<br>Sangria! The patio. Tapas!<br><br>The okay:<br>The lunch options. <br><br>I highly recommend ordering sangria and sitting on the patio for both the people watching and the beautiful views of Grant Park. I went for lunch yesterday and we were able to be seated right away and our meal came out relatively fast. The dining room is large and open and we were lucky enough for a window seat to overlook the park. I ordered the bikini sandvitx - manchego cheese, serrano ham, truffle, and blueberry compote. The truffle flavor didn't come through and the sandwich was on the greasier side. I ended up using a fork and knife to eat it. The chips were either slightly stale or not fried all the way - on the soggier side. <br><br>TL;DR: Lunch - eh. Sangria - Do it!", "pics": null}}, {"review": {"des": "I am a big fan of tapas and when I got a $25 off mailer from them I figured I would give it a shot. <br>Me and a friend of mine stopped in for lunch recently since my coupon was expiring. Its located in The Blackstone Hotel on Michigan Ave. which is convenient for me since I don't live too far from this place and its not a far walk from my job. The place wasn't too occupied and we were able to score a table by the window as we could see Michigan Ave foot traffic. I looked around at the colorful decor and the cool looking bars surrounding the dining room.<br><br>Looked at the menu and saw what looked like goodies. We got the following:<br><br>Garlic Shrimp - the best of all<br>Beef lamb & meatballs, pickled vegetables, smoked yogurt and almonds - very good!<br>Charred asparagus -yum<br>Ham Croquettes  - meh<br>Rosada Sangria - yeah was real nice<br><br>Service from our server Joanna was nothing short of stellar as she took good care of us the whole time and is a very cool girl.", "pics": null}}, {"review": {"des": "I stopped by here after work one day in the mood to try something a little a little different. I've had tapas before, but I hadn't had them in a while so it was time for a refresher. Just as a tip, when you walk into the place you have to go up the stairs to get to the actual restaurant. The lower level is basically all drinks. <br><br>So anyways I get upstairs and I'm seated right away. Everyone seems really friendly and generally pleasant. It is a tad dark in the restaurant, but not to the point to where you'll be tripping over yourself haha. So we're seated and they almost immediately bring out complimentary drinks and an appetizer (my kind of service!). Having already had experience with tapas I kind of knew the drill, but if you've never had tapas before the menu cam seem kind of overwhelming. The good news though is that there are several \"chef tasting\" options that allow you to try several popular dishes at a set price. The waiters are also pretty flexible, so if theres something in the menu that you don't like, just tell them and they'll probably swap it for something else! The waiters are also super helpful and will give their opinions of what they think you may like! <br><br>I ended up getting the smaller chef's tasting which featured 8 of their popular tapas! I feel like the waiters we're watching us because all of the plates seemed to come out with perfect timing. Literally one plate would be taken and the next one would come out right behind it. Another thing I appreciated is that the waiters didn't make us feel rushed and consistently asked how we were doing and if we needed anything. Fast forward to the end of the night and dessert! Although I'm not a fan of chocolate I must say that all of the desserts were good and not too overwhelming. I didn't feel as though I was stuffed and forcing myself to finish which was definitely a plus. <br><br>Overall I had a really positive experience from the tapas, to the service and the overall vibe of the restaurant!", "pics": null}}, {"review": {"des": "Mercat a la Planxa is a hidden gem amongst the hustle and bustle on Michigan Ave. Always being a fan of Spanish tapas, my boyfriend and I wanted to give it a try. The restaurant is within The Blackstone hotel, and walking through the boutique lobby sets the mood where past meets present. <br><br>After ordering cocktails, we decided to go with the \"chef's tasting menu,\" allowing the chef to surprise us with a course of 9-11 different plates to share. The bacon wrapped dates were addicting! I also really enjoyed the patatas bravas and Serrano ham and fig salad to start. And the surprises just kept coming! From the grilled octopus to the codero (rack of lamb), every dish was fresh and paired very well.<br><br>For dessert, we had Torta de Xocolat, or commonly known as the flourless chocolate cake with coffee ice cream. It was the perfect way to end our meal. We were both so glad we went with the chef's selection. Instead of picking and choosing ourselves, it was a treat to sit back and enjoy a culinary tour through Barlecona. <br><br>We can't wait to be back and try their brunch menu!", "pics": null}}, {"review": {"des": "I visited here with friends. They have outdoor where you have an awesome view since the restaurant is situated on the Magnificent Mile and indoor seating. The restaurant is an short stroll from Hilton Chicago and Congress hotels.<br><br>Service is attentive with EXTREMELY knowledgeable waiters--they recite the menu items from memory, offer detailed explanations and recommendations. You can tell they are used to serving exacting clients. The tapas were exceptional, we had scallops, octopus, paella, a potato dish and flourless chocolate treat. All delicioso..! The restaurant is actually a hotel restaurant but you would never know it. I thoroughly enjoyed my visit (I had frequented this restaurant many years before as a medical sales rep with my physician clients) and the service has remained consistent. Amazing!", "pics": null}}, {"review": {"des": "I'm always able to make a reservation. This place has never been to busy to accommodate me. The atmosphere is really modern and cool. There are a ton of employees hanging around ready to serve you. The food is really excellent. I do the chefs special and the varieties of foods are extremely tasty. The best part has to be the sangria made from scratch. Mercat a la Planxa is a hidden gem. I will definitely be back", "pics": null}}, {"review": {"des": "Very nice meal, although they were sold out of several items on the menu (4 not 5 stars).  Service was excellent, course timing was also strong.", "pics": null}}, {"review": {"des": "These tapas dishes are the closest to those we ate in Spain.  We went for Sunday brunch and enjoyed the Pa Amb Tomaquet, Boquerones, Pimientos de Padron, Pulpo con Patatas, and Patatas Bravas.  It was Easter Sunday so the restaurant was quiet, but we choose to sit in the bar with a view into the Brookstone Hotel lobby.  The tapas menu is very affordable.<br>The sangria was not as you get in many places (which is not authentic) and more resembled a cocktail than a sangria, but they were delicious. <br>We especially enjoyed speaking with Claudia, the bartender, who is an excellent mixologist.  Try her Lemon Drop!  It was the best I've ever tasted.", "pics": null}}, {"review": {"des": "The only reason we picked this place for a night cap was because we had friends staying in the hotel that shares a space with Mercat. I wasn't particularly thrilled with the level of hospitality from the host, as she seemed rather annoyed that we walked in at 8:00 PM for drinks and not dinner. We were seated by the small tables at the bar, provided menus, and waited for a server to come by.  Water was brought out promptly, a server came by and took our drink order. We eventually ordered desserts because it their menu was enticing. Management came by along and asked how we were enjoying ourselves, overall a pretty average experience.  Closer to 10PM, the bar got fairly busy and it was harder to wave down someone for water and drinks. I will probably need to make it a point to visit here and have a proper dinner, but it's a decent place to come have a drink, a snack, and just relax after a long day roaming the streets of Chicago.", "pics": null}}, {"review": {"des": "This was unbelievable , love love this place. Nothing like going to a restaurant for a few hours and being served small plates of well executed dishes of beautifully plated food. The Berkshire park shoulder was so good.  Next to it was a puréed roasted red pepper sauce with ground almonds , parsley and unfortunately I can't remember what else was in it. Total brain overload on my experience here.Would be one of my last meal picks. I'm salivating thinking of it. Surprisingly  the seafood dishes were just average. Our waiter was excellent very well versed on the foods and wines. The hostess were okay young inexperienced and didn't seem to be on par with the staff. The kitchen is very accommodating to our one vegan and  pescatarian at out table. I think if I was a vegan or pescatarian I would have taken a break on my dietary choice for those few hours. I will definitely revisit.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/TGjetT85668-vbHmUqsPig/348s.jpg", "caption": "Beautiful lobby"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/AXdh2jjQ2_ey2xN6YTy3eg/168s.jpg", "caption": "Only flaw in this wonderful experience."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/RBL9VQG8_Jk7mNVccHljvg/168s.jpg", "caption": "Olives to whet your appetite"}]}}, {"review": {"des": "The Scallops.  Get the Scallops.  Wow!  Maybe the best scallops I have ever had.  Overall the food is good.  Some of it great! But the scallops are incredible.  <br><br>The energy is lively, and I mean a bit loud.  But if you are into that, its a great spot.", "pics": null}}, {"review": {"des": "Stopped in this restaurant in my hotel and was pleasantly surprised.  For a hotel restaurant it was upscale and trendy, with a comfortable atmosphere and fairly lively crowd for a rainy Tuesday.<br><br>As I was on my own I opted to sit in the lounge area.  They had a decent, if pricy, wine list with mainly Spanish wines (makes sense).  Not being a fan of Spanish wines, I opted for a cocktail and was not disappointed.  The bascule was a delightful concoction of gin, lemon, honey, celery bitters and cidre.  Yummy!<br><br>There were lots of good options on the menu (tapas, salad, paella for a crowd, and entree's), but when my server (Natalia, excellent) heard my inquiry on how the pulpo was prepared, she suggested the pulpito special.<br><br>This was small (not baby, but young) octopus sauteed and grilled served with a potato foam, potato coins, asparagus and pearl onions.  Overall a very nice dish with perfectly tender and crisp octopus that balanced nicely with the sides.  My only complaint is that the octopus could have benefitted from a bit more seasoning.  I added salt that helped, but some garlic or oregano in the sautee would have been good.<br><br>All and all a nice experience and more food than I could eat.  Would go back.", "pics": null}}, {"review": {"des": "Maybe at some point this was a good restaurant, but it isn't today.  <br><br>The decor which looks stuck in some past when orange and brown banquets were a thing is overall shabby looking.<br><br>The food is more mediocre. The Verde salad, was bland and the greens soggy. Ham coquettes had no ham flavor and an odd pepper sauce that added nothing to the experience . The Spanish cured meats were a disaster, drenched in oil and served without bread. When we asked for bread we got a few well-aged slices. In short, you could do better with a selection from Trader Joe's. The only dish worth mentioning were mushrooms and confit potatoes which were great though also over cooked.<br><br>Add to that Michigan Ave prices and indifferent service, and this restaurant would never survive if located in the West Loop. And there are better tapas places nearby. <br><br>So, steer clear.", "pics": null}}, {"review": {"des": "Brunch (9/10) <br>Ordered a set and got some weird tasting food out of it. Wasn't bad at all but just not the usual tastes my tastebuds were yearning for. It is something unique that should be experienced and it is still quite delicious! Many of the foods seem to be something that are ordinary  but there is a spin to it that makes it unique that make it slightly better than what It would have been following the old recipe.", "pics": null}}, {"review": {"des": "Average food extremely over-priced! Wines extremely over over priced and not that good.  Food was just ok. Had the green salad that was to have cucumber avocado and asparagus in it... on piece of asparagus the size of my pinky fingernail, no cucumber; overall the salad was very small, for $14! The meatballs were very greasy and tasted like oil, no flavor. The blu fin tuna was very good, but the overall experience was so bad I wouldn't go back. You have to ask for bread. Atmosphere- when full of people expect it to be loud, I felt like I was in a cafeteria, an extremely over priced one. I have no problem paying for a good meal, good wine and nice atmosphere...this was none of those things", "pics": null}}, {"review": {"des": "We visited Mercat for Father's Day and really enjoyed the experience. Our server was wonderful and made some awesome recommendations, including a Spanish brandy my husband loved. <br><br>Highly recommend the Mallorca Sunset (delicious mixed drink), and for tapas: embutidos iberico, the pulpo con potatas, the albondigas (like a perfect bite of gyro in meatball form), and the bacon-wrapped dates (obviously - it's a classic for a reason).<br><br>The interior is also gorgeous - perfect for a celebration or a night out.", "pics": null}}, {"review": {"des": "Excelente comida y servicio. Very flavorful!<br>I ordered a brisket over a crochet topped with sunny side eggs and side of fries. My husband had the couscous with chick peas and baby carrots, simple but so delicious.  Short menu but I'm certain all was just as good!", "pics": null}}, {"review": {"des": "Went yesterday and had the lobster scrambler type thing.. i have no idea the actual name. It was absolutely delicious! And Alex was a great server! Can't wait to go back.", "pics": null}}, {"review": {"des": "We arrived here without checking if they have the usual Mother's Day brunch and we were disappointed it was A' la carte only.  We ordered a whole bunch of stuff , nothing to excite the taste buds....a big change from last year.  The best part was the bottomless mimosas which the hubby and I enjoyed.Our server was very pleasant  but not sure we will be coming back anytime soon.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Ju7SB9Z_EMxpCvNj4HFLXQ/348s.jpg", "caption": "Bottom less mimosas was good"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/W9DujJ6qx9O04tg5CHaezw/168s.jpg", "caption": "Manchego scrambled eggs"}]}}, {"review": {"des": "PLUMA!!!  Our server recommended this as it is not very common.  We were three colloquial gents in town from Seattle and we thought \"hey we've never heard of this before, but there is something about the way this server is describing it.\"  We ordered it and some other tapas.  <br><br>The food here is good, but Oh My Lanta, the Pluma is the best cut of meat you'll ever have.  It's like the best beef tenderloin you've ever had, with a slight bacon taste at the end, and it is melt in your mouth tender.   Who knew.....Pluma.  It's like finding out you can rewind live TV for the first time....", "pics": null}}, {"review": {"des": "Small plates & small seating areas. Quite a variety of tapa plates. We tried 6 plates between 2 of us for a bigger variety. Flavors were from mild to wild! Loved the spinach & fig salad. <br><br>Being downtown Chicago, expect to pay a high price. But try it once!", "pics": null}}, {"review": {"des": "This was a great place for dinner after checking into our hotel. Nice view. Great ambiance. Service was fantastic. Everything was tasty. We got the croquetas, octopus and hanger steak. Really liked it all...especially the croquetas.", "pics": null}}, {"review": {"des": "This was my first time here but definitely not my last.  The group I was with come here yearly.  We had the Chefs Tasting Menu which gave us a good selection of delicious appetizers, salads, and entrees.  It was a selection that pleased all and left no one hungry.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/6NXCtTn4rFcNMlytcxzU8Q/348s.jpg", "caption": "Fabulous small plates and Chef's Tasting Menu.  Would definitely recommend, along with the wine tasting."}]}}, {"review": {"des": "Just thinking about the morcilla at this place makes my mouth water. This is a review from my experience in 2015.<br><br>My husband is a huge fan of tapas, so this was our obvious choice when we were looking for good food before the C2E2 convention (in 2015). From the get-go, the decoration and ambiance is cosmopolitan and cool, the house music mix was banging throughout the evening, and this is important to me, so I was happy. <br><br>We were, as always, on a budget, so we began with the classic tortilla española, which for such a relatively simple dish, the flavor combination was fantastic. Then we had the morcilla and oh man, it was delightful. My husband had never had morcilla before and was apprehensive but after this he was hooked. We nibbled on beautifully cooked camarones al ajillo but unfortunately decided on ending with the octopus, which was not bad except for the fact that the sauce was olive-based and we hate olives. So skip that if you dislike olives. <br><br>Great service, fabulous ambiance, great tapas. - or at least it was in 2015. A must if you are in Chicago!", "pics": null}}, {"review": {"des": "I am always so surprised when I come here and the restaurant is almost always empty. Maybe it's because it's kinda tucked away in this hotel, and it's not really something you can easily happen upon. It's also on the southern end of Michigan, so maybe that's why. Who knows!<br><br>Regardless, this is one of my favorite tapas place in Chicago. I haven't really been disappointed by anything on the menu. It's definitely a little pricey, but the restaurant itself is really nice, and it has these giant windows that look out onto the lake and millenium park. Presentation is really nice, and the staff is incredibly helpful.<br><br>1. Tortilla Espanola - Can't really go wrong with this dish, but they really do a good job of it here. All the components go well together.<br>2. Croquetas de Jamon - Love these! So satisfying.<br>3. Patatas Bravas - These aren't my favorite item here, but they are presented absolutely beautifully.<br>4. Scallops - Absolutely delicious and also beautifully presented!<br>5. Lamb - My favorite item on the menu!!! The lamb is really tasty!<br>6. Shishito Peppers - These are a nice side dish. I always love ordering these at tapas places.<br><br>The sangria is also really good here. It doesn't taste like you're just drinking sweet wine with fruit in it. It light, but still packs a punch.<br><br>If you are going to be in the loop, or you have family in town, I think this is a great place for dinner. This is probably one of the only upscale tapas places in Chicago, and they definitely know what they are doing.", "pics": null}}, {"review": {"des": "Delicious all around! I had the croquetas de jamon as an appetizer and the Hanger Steak for my main course. For dessert I enjoyed the Torta de Xocolat. I highly recommend this place to anyone. Service was quick and amazing too!", "pics": null}}, {"review": {"des": "underwhelming is a great word to describe my experience here last Wednesday night. My friend and I came wanting a small snack so we sat at the bar ready to order some food and drinks. The bartender couldn't look more disinterested to take our order and never came back once our food came or if we needed another drink. The only time he came back around was to collect our plates and give our check. Now onto the food, the PATATAS BRAVAS were ok and a little salty for my tastes.The QUESO MIXTO was tasty but the CHARCUTERIA DEL MERCAT were by far the best call out of the food we ordered. The ambiance was cool, hip and a historic feel to it and would hang out for drinks but won't go out of my way to go back.", "pics": null}}, {"review": {"des": "Decent tapas and a very nice space. The waiter recommended we order 6 tapas for two people which was too much. Four would have been more than adequate. The paella takes 45-60 minutes and should be ordered for parties of at least 6.", "pics": null}}, {"review": {"des": "The food was good, but really expensive for a $$$ rating. The drinks are expensive and you can't taste the alcohol in them.  When you spend money on drinks I expect results!", "pics": null}}, {"review": {"des": "Over priced. Quality of foods wasn't bad but price wasn't justifiable. At least 25% inflation. I usually focus on quality of foods but price must be proportional to foods.", "pics": null}}, {"review": {"des": "These guys are specialized in tapas. This is inside the black stone hotel. Good crowd today. Their portions are very small and being in Chicago downtown they are very pricey too. If you want to have drinks with light food then this is the perfect place. If you are hungry then go to some other restaurant.", "pics": null}}, {"review": {"des": "Have you ever looked up a restaurant menu and decided what you wanted- like you really had your heart set on something delicious.  You go to the restaurant hangry because you are thinking your going to get an amazing meal and they don't have you item and you literally tear up inside (and out, in my case).  My girlfriends and I recently came here for dinner on a Friday night.  We awkwardly were walking around downstairs with staff looking at us and not directing us where to go.  We finally notice the stairs and walk upstairs and again are looking around like a deer in headlights because the hostess stand is near the kitchen area.  We are greeted and seated.  Our server is excellent actually- but I soon realize that my menu item that I was dying to try was not on the menu.  I ordered somethings similar with seafood but got completely different seafood that was told me and I just couldn't.  All I kept seeing in my dish was little baby octopuses and my heart hurt.  Our waiter was super cool though and gave us a glass of champagne and dessert on the house because we all ordered the same meal but differently and none of us cared for it, which I thought was very nice of him.  <br><br>If you are staying the beautiful hotel, maybe check it out- definitely get some drinks and tapas might be a better choice food wise from them!", "pics": null}}, {"review": {"des": "Went here while in Chicago visiting family and YES!!! I want to eat every day (but then I would be broke). We got the chefs selection with wine pairing. The best items were the sausage, steak, and all the others were really yummy and fun. They gave us about 12 different small plates to share between four people and 4-5 glasses of wine to go along with them. Of course not all wines are created equally but all but one of them were very enjoyable! The reds were all on point! So yes I recommend! But make sure to eat an early dinner or make reservations.", "pics": null}}, {"review": {"des": "Unbelievable food & drink, I recommend visiting this place during happy hour for sure. The Small plates are decently priced (check out the octopus It was my favorite) and the drinks are made with such amazing detail. I travel to Chicago 5-6 times a year and I stay at the Blackstone because the restaurant, never had a bad meal here. I would also recommend the green salad with grill shrimp, it was delicious", "pics": null}}, {"review": {"des": "We were told that this restaurant was very good, so I bookmarked to make sure we were able to have dinner while in Chicago. We went for dinner on Sunday night. Reservation was at 9:30 pm but I was told that this restaurant is always full. Surprisingly it wasn't; probably because they also have a buffet brunch so I guess is more popular on a Sunday. Everything we ordered was delicious. We got the Serrano ham, anchovies, tomato bread, patatas bravas, and cod fish, for dessert churros and arroz con leche croquetes everything outstanding. Strongly recommend this place if you visit Chicago. Service and decoration was also a plus", "pics": null}}, {"review": {"des": "We came here for desserts and ordered almost everything on the dessert menu. Portions were on the smaller side. My favorite is the turron bon bons. I can eat that for days! The rest were just okay. Next time I would like to try their tapas menu. Great atmosphere! Service was perfect and desserts came out in a reasonable time. A tad bit pricey for small desserts.", "pics": null}}, {"review": {"des": "Very good service and excellent food! Just don't order the Paella Negra... it's literally black from the squid. So, unfortunately it doesn't only look unpleasantly, it also comes with a aftertaste.", "pics": null}}, {"review": {"des": "This was the second of 3 dinner  restaurants we visited on a recent fun trip to Chicago that we did with another couple. This restaurnat was fabulous. We arrived at 7 pm on a Friday, the main, and lovely dining room, was hardly populated.  But it filled up starting at 8 or so. Our server was fabulous, knew the menu and the wines! <br><br>We followed her recommendation and ordered their elevated tasting menu with wine paring. It was awesome, the wines were perfect ! You had better be hungry because it was a lot food! The final dish wasn't on the menu, the new Spnish Chefs personnel Paella!. Absolutely awesome.  We could barely walk back to our Hotel, but I'd do it again!<br><br>A must place to go.", "pics": null}}, {"review": {"des": "Wow! Excellent food and service. Diego, our server, was very friendly and welcoming. We each had the chef's tasting menu and every course was beyond excellent. My friend and I were impressed by every aspect of dinner. <br><br>We have both been to some of the best restaurants in this city and very rarely review a restaurant with as many positive reviews as they have but felt compelled to in this case.<br><br>Kudos.", "pics": null}}, {"review": {"des": "This was my first time dining at Mercat a la Planxa.  It was a restaurant my boyfriend has always loved and when I said I wanted tapas for my birthday he recommended we must go here.<br><br>Unfortunately, our experience was less than stellar.  The food was quite delicious, authentic, and original.  The rest of the experience fell short.  Our server offered only a very brief greeting and did not give any overview of the menu or ask if we had dined there before.  There were no recommendations or attempted upsells, just a greeting followed by, can I get you started with some drinks?  Definitely not the best start.<br><br>After we ordered all of our food, the dishes were coursed fairly well until our last and main dish, which was the cannelloni.  We finished eating the prior dishes and then it took 30 minutes before the cannelloni came out.  Our server seemed to basically disappear and when we did find him to inquire on the status he said the kitchen told him 2 minutes (the food didn't arrive for another 10).  There was no apology for the delay or acknowledgement of the delay.  We did learn that he had 11 tables at that time that he was serving (11!!!!).  I'm not sure how Mercat thinks they can deliver great service with that ratio.<br><br>After finishing our last dish, with both of our drinks empty, we again looked for a server, but with no luck.  I eventually asked a back-waiter to locate a manager for us.  The manager approached the table, and speaking only to my boyfriend, asked how she could help (even though I asked for the manager).  I spoke up and clarified the issue that we just wanted refills and a dessert menu, but I'm confused as to why you would assume the man would be the one asking for the manager?<br><br>I'm not sure we will choose to return to Mercat a la Planxa.  Although the food was amazing; it seems the management doesn't understand how service can make or break an experience.", "pics": null}}, {"review": {"des": "I've been meaning to try Mercat a la Planxa since I ate at its sister restaurant in Philadelphia last December. It took me nearly a year to try MALP, but good things come to those who wait, right?<br><br>My friend and I came to MALP, and we tried the following tapas:<br><br>Datiles con almendras (Bacon-wrapped dates)-These were my friend's favorite tapa. Thick-cut bacon wrapped the fresh dates. I've noticed a trend of bacon-wrapped dates in Chicago, and MALP seems to outshine Avec in this regard. <br><br>Patatas bravas (Spice potatoes)-This tasted like eating mashed potatoes freshly fried and served with a spicy sauce. Its the potato version of creamed corn nuggets in the South. <br><br>Wagyu bavette (Carnes)-One of my favorites and would come back for the steak. <br><br>Mixto (Cheese Plate)-Selection of three cheeses accompanied by fruit spread. <br><br>Lamb chop-Seasoned to a perfection so as not to mask the natural flavor of lamb. <br><br>I was pleasantly surprised by the quality of food, service, and ambience. I would return for another special occasion because, yes, its a splurge, but its tapas at South Loop prices.", "pics": null}}, {"review": {"des": "My husband and I came here as a celebration dinner. We both loved the food we had in Spain so we thought this would be a good choice. We ordered 6 tapas and felt as though this was an adequate amount of food for the both of us. I had been to Mercat a few years ago with friends and remembered absolutely loving the food. We had gotten a variety of meat, seafood, and veggie options. This time, my husband and I only got seafood and veggie options. The food was good, I just wasn't \"wow-ed\" like I was the first time. I think the veggie options just aren't as interesting or exotic as the meat options. We were pleased with the service and ambiance, but the food is expensive for small portions. Overall, we enjoyed our dinner, but will probably head to other restaurants before dining here again.", "pics": null}}, {"review": {"des": "My family is from Spain - this restaurant is authentic and absolutely amazing. We have sent many friends and they always rave. I highly recommend.<br><br>Last week, I brought a business associate for a business dinner. Unfortunately as the staff was clearing the table, a full glass or red wine was spilled all over my favorite winter white jacket. It absolutely soaked my jacket.<br><br>The manager rushed over and took care of the situation immediately.  She whisked my coat away promising to have it cleaned and shipped to me and committing to replace it if the stain was permanent. After the enormous stain didn't budge with the typical restaurant pre-treat, she paid to replace my jacket.<br><br>While I am super disappointed to lose my favorite jacket, Mercat handled the situation in exemplary fashion.", "pics": null}}, {"review": {"des": "I came on Christmas Eve. The drinks were great although disappointed on the flavor of my paella. I ordered a Christmas soup as an appetizer which only came after my entree was ordered.... way after! I was told I wouldn't be charged for the soup to find out it was added to a split bill(I dined with a group). I didn't enjoy the paella. I could barely taste the flavor or texture  of any pork sausage or pork loin AT ALL!! Seemed like a paella that was prepared by cutting corners!!! All<br>I tasted was artichoke, squid ink rice and the fried calamari  tad bits of loin. I've had WAY better paella. (La Taberna on Halsted!!) <br>The ambience and decor is beautiful tho..... food could be improved and ensure customers actually taste the ingredients you're claiming are in your dishes. Waiters should make<br>Sure they take initiative in asking customers if they want to split the bill to avoid a last<br>Minute hassle! Whilst eating dessert the waiter brought the bill and didn't split the bill for the group and she had the nerve to say\"You should have told me to split the bill\"..... we didn't know she was getting the bill in the first place and it's her duty to ASK when she is doing so! In the end we managed to get it split although with incorrect amounts. Poor communication from the waiter!..... I've attempted to contact a manager, left a voicemail and STILL no response. Not expected from a restaurant on Michigan Ave!! 1st and Last time going there.", "pics": null}}, {"review": {"des": "RABO DE TORO: This was my second favorite dish. Here you have braised ox-tail ravioli and shaved truffle in a reduction sauce. (top right)<br><br>PINTXOS MURANOS: Lamb loin wrapped with bacon. Anything bacon is going to taste good to me and this just solidified my opinion. (bottom right)<br><br>ARROZ CON MORILLAS: This was my favorite dish of the night. In simpler terms, consider this risotto. The creaminess came from morel mushrooms which I thought was perfect. It also came with peas for texture and topped with asparagus. I wanted to eat this bowl by myself. (bottom left)<br><br>BLACK ANGUS RIBEYE: We requested our steak medium-rare and it came out more on the medium side which made it a little drier than we preferred.  The sauce on the left was a aioli and was the most appealing to us. My girlfriend and I are aioli freaks. The middle sauce was a vinaigrette sauce, while the one of the right has been forgotten.", "pics": null}}, {"review": {"des": "Neither my wife nor I have been here for dinner, but after many visits for lunch I have to say this is unquestionably one of the best restaurants in the area.  Salads?  Excellent.  Wood-fired meats or even the hamburger?  Wow.  Tapas?  Yes.  Cocktails & wine?  Very nice selection.<br><br>It's not the cheapest lunch, and it gets crowded during the weekday lunch hour, but definitely worth a visit if you're in the area or staying at the connected Renaissance hotel.  Very well done.", "pics": null}}, {"review": {"des": "Simply one of the. Eat dinners I've had in a long time. The service was wonderful and the food out of this world!  I've had the Spanish omelette many times but this one has a saffron aioli that SET IT OFF!<br>Sangria...the bomb!", "pics": null}}, {"review": {"des": "I've only been here twice, once for breakfast and once for brunch before work. The brunch items were more memorable and prepared nicely. Good quality ingredients and great flavors! The sauces with my chicken were diverse and made the dish stand out.<br><br>I really need to go here for dinner!!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/GF_G9j5z9-lCYYoEZV1sWg/348s.jpg", "caption": "Salmon"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/azJ-Vt0czh4hpBOY1NCSAw/168s.jpg", "caption": "Mushrooms & vegetables"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/oQiLoWaOXaKu3EX0sq7bMg/168s.jpg", "caption": "Chicken"}]}}, {"review": {"des": "This is a very popular restaurant on the second floor of the Blackstone Hotel, drawing both Chicago locals and those staying at the large hotels along Michigan Ave., such as the Hilton next door. The tapas are as good as any we had in Spain (which we visited a month ago), and particularly recommended are Coca de Esclavida (smoked eggplant), the lamb ravioli,  and the Paella de Verduas. We also enjoyed the Negroni cocktail. This is definitely a top restaurant for the area, especially if you have just arrived in Chicago and want a place close to your hotel along South Michigan Avenue.", "pics": null}}, {"review": {"des": "Breakfast was incredible! Alex made excellent recommendations and the food came out picture perfect! The potatoes were a great appetizer for our fillet and lobster breakfasts", "pics": null}}, {"review": {"des": "1st, it's located in a historic like hotel. Renaissance Blackstone on Michigan ave. I made the mistake of entering on the lower level and I thought...is th is it? The bartender was kind enough to let me know the main dining was upstairs main area. Went up the spiral stair aside the front of bar.  Going upstairs was a whole different view.  Needless to say Dante, our waiter, was the main reason for the enjoyable evening. He was well versed on the entire menu and the whole Catalonia experienxe. He even spoke some as well. He explained everything in detail. We tried so many things, and actually lingered on the Mesa a la Mercat charcuterie and cheese boards. Wow, they were so good. Then afterwards, so many things cane out including the gambas, which were so juicy. It was a smorgasbord of flavors and textures. I would be remiss if I did not mention the host. I don't know his name but he came back a few times to check on us. What a great guy and he is a connoisseur of Bourbons!!!  Almost the last people to exit,  Dante had us try the Catalonia dessert. We thought we were so full, but in the end, nothing was left of the dessert!  What a great experience dining at Mercat!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/v6QqsNhl3YnpQaEy0psdbA/348s.jpg", "caption": "Catalonia dessert that I thought I could not eat another bite...was gone!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/zwsd9ECZR9tCefI8yKhBSg/168s.jpg", "caption": "Cochinillo...roasted suckling pig with the calcots  (Spanish green onions) a must to have"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/I6gqbR77VAaQreVDWJbGqQ/168s.jpg", "caption": "Gambas!!!! The juiciest I ever had"}]}}, {"review": {"des": "I don't give out many five stars (I don't think?)<br><br>Lunch tasting menu is an EXCELLENT VALUE<br><br>Arroz a la cazuela:<br>Decadent saffron soup with tender rice, perfectly cooked shrimp, chorizo for smoky spice, and confit artichoke for a nice textural addition. Crostini with paprika aioli provides a perfect welcome to Spanish flavored. Perfectly executed. Soul-warming <br><br>Green salad was excellent. Sherry vinaigrette offers quintessential eastern-Mediterranean flavoring to a salad with arugula and bitter greens, plentiful pieces of perfectly of cooked chilled asparagus and green beans, and sliced avocado. <br><br>Second course was so-so:<br><br>Coca was nice. Manchego was nice and salty. Mushrooms were well seasoned, but overall wasn't anything special. Tortilla was fine also. One of my favorite Spanish foods. Mine was a bit too moist and aioli could use some pizzaz - maybe include piquillo peppers somewhere <br><br>Third course <br>Espinacas a la catalana - perfection. Perfectly seasoned and flavored. Salty, sweet, bitter, sour, nutty, herbs everything. Crunch, mush <br><br>The lamb!?!?!? Perfect juicy and crusted with salty zesty goodness. I want to go back and devour an entire zoo's worth of lambs cooked this way. The aioli and other romesco-like sauce were beautiful with it. Absolutely stellar. Flavor of the grill mixed with fat and juice and oh my god I can't continue <br><br>Service was prompt, friendly, and helpful. I will absolutely be back on my next trip to Chicago", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/zQKzqP-P0UE6soC4Sx0gIQ/168s.jpg", "caption": "Coca and tortilla española"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/cksTafZEXC7_3xFVkyHO0w/168s.jpg", "caption": "Arroz a la cazuela . Divine"}]}}, {"review": {"des": "Had a very nice networking dinner at Mercat - service & staff were attentive and helpful in making both food and wine recommendations. Highlights of the meal were the albondigas, hangar steak, and gambas al ajillo. <br><br>Will definitely be back for another meal - the joint was a bit loud so made the networking a bit tough, but otherwise it's a very neat space & ambiance!", "pics": null}}, {"review": {"des": "The decor of the restaurant is beautiful. Went in for lunch on a week day. They have a limited menu with a two tapas special.  The red sangria was okay. It's served in a small glass that whisky can be served in ...Not worth the money....it wasn't that strong. The server was knowledgable and friendly. She did a great job! The burger was a nice portion and was filling but nothing special. The salad was okay. Nothing stuck out. The menu changes for dinner and it may be better.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/A-4ytrQFL1gEQQfWGCgDSA/168s.jpg", "caption": "The main dinning room"}]}}, {"review": {"des": "Came to Chicago for a trade show. For our last night, we just happened on this place. What a pleasant surprise. The food was delightfully different and the service was excellent. Definitely recommend!", "pics": null}}, {"review": {"des": "I love tapas and this place is definitely good.  I stopped in for a late dinner while in Chicago for work and had an enjoyable meal.  I started with the Serrano ham and fig salad which was a bit too salty and generally unbalanced, then had the diver scallops and garlic shrimp, both of which were excellent.  Finished with rice pudding croquettes, which were pretty nice.  The service was quite good throughout.<br><br>The space is absolutely beautiful, this would be a great destination to take someone you want to impress.", "pics": null}}, {"review": {"des": "Honest review: i was really disappointed. I came here because this was jose garces restaurant and hes an iron chef. The food wasnt that good this was my dream restaurant i would be embarrassed if i was garces for the food. I think its crazy for the expensive tasting menu that thats wht it consisted of ur suppose to put the best dishes on it not crappy ones for the price could have went to a better restaurant more pictures on my profile all in all wouldnt come back food wasnt worth the price <br><br>Free course: Bruschetta <br><br>Expensive tasting menu: doesnt come with desserts:<br>Dates with baccon<br>Meet and cheese plate<br>Tortilla (spanish omlett)<br>Chicken Croquette<br>Ox tail ravioli<br>Flatbread<br>Roasted cauliflower<br>Grilled shrimp<br>Lamb chop <br>Mushroom rice <br><br>Dessert:<br>Corn cake<br>Bon bon<br><br>Bruschetta was really good i loved the really crispy bread underneath my the tomatoes were really fresh a perfect start for the meal it was alittle to acidic and to much garlic though <br><br>Dates with bacon: this was my favorite part of the meal it was so decadent i thought this was gonna be gross because their dates but i was so wrong its so great the sweatness of the dates with the saltyness of the bacon and the richness of the fondue a must order!!!! I would come back here just for that <br><br>Meet and cheese plate: i always wanted to try iberico pork it was great a really high quality pork the sauce was to die for when he said it was lavender i was really worried but no it was great it wasnt a true meet and cheese board because there was only 1 cheese and it was hard it was really delicous though and one meet the condiments didnt really help i just dipped everything in the sauce <br><br>Tortilla:lol for the price dont serve me an omlett there was saffron on it though just wish it was implimented in the sauce not as a garnish didnt like it just a normal omlett with potatoes <br><br>Chicken croquette this was really good it was really crisp and i loved the sald the sauce was really good tasted like lemonaden really good successful dish<br><br>Ox tail ravioli: i thought this was gonna be amaizing it had like the littlest bit of truffles wish  there was more i didnt like it at all the sauce didnt taste good and the actual ravioli wasnt good really a poor execution <br><br>Flatbread: this was really good the cheese was really high quality it was salty and really rich the actual bread was really crisp it was really good<br><br>Roasted cauliflower: this was so good be warned the sour cream underneath is really over powering so try to avoid it because theres alot of it and it kind of ruins the dish! It was perfectly cooked really was a home run best vegetable dish i ever had<br><br>Grilled shrimp: it was cooked perfectly there wasnt any actual seaoning on the shrimp though so it was flat the sauce was good though not enough though<br><br>Lamb chop: i love lamb but i hated it it was over cooked and needed seasoning really badly and there was a lot of sinu on it the sauces did improve the taste of the lamb not alot though<br>Mushroom rice: this was really good tje rice was cooked perfectly not gummy at all then there was shaved asparagus on top which was really tasty all in all really good would order again<br><br>Corn cake: this was really delicous everything worked together perfectly i didnt eat the canella because it made the dish way to sweet. All the condiments were really great the cake was moist not dry loved the fresh berries the crunchy stuff on the side of the plate was really good the icecream was really good but was way to frozen so it was hard <br><br>Bon bon the sauce was really good the bon bon wasnt really thay good way to frozen really disappointed <br><br>Service: it was okay didnt really like it didnt like his recommendations and he would disapear for a while and my plates werent picked up so they would just sit there and no new utensils which sucked because i need clean utensils its awkward always waiting for him for long periods of time <br><br>Atmosphere: its really pretty i love the big open windows which u can look out", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/aMIwzmrzqLd7uglsHwYU3Q/348s.jpg", "caption": "Flatbread"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/j7kSilpo4qEk4fcjm6TpTw/168s.jpg", "caption": "Ox tail ravioli"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/aBPnJr0n8LuWk9VgoShypw/168s.jpg", "caption": "Chicken croquette"}]}}, {"review": {"des": "Delightful restaurant with knowledgeable waitstaff. You know that your experience will be memorable when the General Manager walks up to your table to ask your four year old if she is enjoying her meal. Tapas style meals so it's nice to order about 5 for two adults. The chocolate dessert was a sweet way to end a great night put.", "pics": null}}, {"review": {"des": "(Sorry, this post should have been published in 2015 -- some reason it didnt get sent. Anyhow, I stand by my words below though I've only been there once. And the Manager did call to offer us another meal of their signature items, but shouldn't it all be good?? We went before the dinner rush so there's no real excuse...)  <br><br>People of Chicago, lovers of La Planxa -- you have got it all wrong!!!<br><br>You're going to a spot that an Iron Chef has opened, so you expect EVERY THING on their menu to be at least decent, not just their signatures.<br><br>We stayed at the hotel where the restaurant is located, and JB especially loves this type of cuisine. I was enticed more for those two reasons, not for the name behind the restaurant. Regardless, it was his evening so he picked the items:<br><br>a pitcher of white sangria<br><br>apps: empanada verde, escalivada d'alberginia, croquetas de pollo, coca de jamon y queso, and serrano ham & fig salad.<br><br>We left a note for the server because he was pretty busy - they were pretty full that evening - didn't take any leftovers but we did write that his service was fine (note \"fine,\" not great), but the food was terrible. The manager called us the next morning and said it was unfortunate no one came around to table touch, otherwise they would have offered us some of their best dishes. Unfortunately, we were on our way to Manhattan, and while she did offer to pay for our next meal the next time we are in town, there are TONS of spots in Chicago - and I'm not all about chancing my limited time in Chi-town with a questionable menu for another meal.", "pics": null}}, {"review": {"des": "A taste sensation. Save up your $$$ so you can try a variety of items; lots of new flavors, combinations and textures.<br><br>One BIG complaint: The servers are very nice but it always (been here 5x in 4 years) seems like they are just shy of panic mode. Very poor management: you'll have several different people bringing your food and no one seems to know what you ordered exactly, or what is going on. Every time we've had servers bring us someone else's food (multiple times) asking if we ordered it, when we say no they wander off to the next table to ask the same thing, and on & on. It happened to us 3 times today. You've got to wonder how many tables your food visited before it came to you.<br>Today got 75% of our food before the drinks finally came out.<br>Really, if it weren't for the flavor bombs I'd find somewhere else.", "pics": null}}, {"review": {"des": "Wow this place has a lot of reviews! <br><br>My sister and I popped in for a drink before heading to an event inside The Blackstone Hotel. For those of you who don't know, Mercat is connected, but you can enter from the street or inside the hotel.<br><br>We were in the lower level of the restaurant which was pretty small. My understanding was that this was more of a cocktail/lounge area for folks to mingle, because there weren't really any large tables for seating. Although there was a crowd, we were able to snag a couple stools up at the bar.<br><br>Their cocktail list is pretty extensive. My sister and I both decided to go with their Menta Cidro which is grey goose vodka, st. germain, mint, fresh citrus, and soda. I highly suggest this drink! We both thought it was amazing and so refreshing. No alcohol tasted at all which is always delicious (and dangerous). I want to say the cocktail cost about $8.<br><br>We were pretty hungry and originally planned to hold out for the event we were headed to in a half hour, but of course decided to peruse the menu anyway. It was a little much for what we were looking for at the moment, but I would love to check out their tapas another time. We were kind of just hoping for like some chips and salsa, but the closest thing to a snack was their quesos and meats, which we weren't feelin' at the time. <br><br>Our waitress was so nice and attentive. She helped us out with the food menu and took our drink orders right away.<br><br>Seems like a really popular spot! I hope to come back and eat next time I'm in the area.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ou-mQ5oYpuqcUa2NGGBuxA/348s.jpg", "caption": "Menta Cidro - grey goose citron, st. Germain, mint, fresh citrus, soda"}]}}, {"review": {"des": "I'm sad to be downgrading my review to a 3-star, and really almost 2-star....this used to be one on my faves in Chicago. I was excited to come back on a visit to my hometown with a group of co-workers. We ordered a wide variety on the menu and left with a fairly average meal for the price point.<br><br>The Highlights:<br>Pasta - delicious, texture was great. Best thing I ate all night<br>Hanger Steak - cooked beautifully and the sauce was delicious (slightly spicy)<br><br>What was a disappointment:<br>Spanish octopus - Presentation w/ potatos was confusing, texture also a little mealy<br>Scallops - very uninspired<br>Gambas - VERY fishy! texture was mealy. So disappointing b/c these were an old fav <br><br>There were others that were also \"Just ok.\" Like the bacon-wrapped dates, the serrano-fig salad, and the peppers which used to be one of my faves too!<br><br>Service was friendly but slow at times given how slow it was when we were there at 9pm on a Friday.<br><br>I probably won't be back :(", "pics": null}}, {"review": {"des": "We love this place.  We have been there for lunch and dinner.  The tapas and entrees are delicious.  We had shrimp, a sort of flat bread pizza, meatballs and cocktails and enjoyed every bite and sip.  We love the atmosphere and it reminds us of Barcelona.", "pics": null}}, {"review": {"des": "I got the luxury tasting with wine pairing and loved it. It was my first time at tapas and my husbands second. We had a great night with great service", "pics": null}}, {"review": {"des": "It was good, but not worth what we paid. The food is all tapas and the flavors are good, but not outstanding!!  Certainly didn't seem worthy of $120 for two.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/FXx0L77bAYz3cOy9tkCHOA/348s.jpg", "caption": "Spicy Potatoes with paprika aioli"}]}}, {"review": {"des": "The simian food critic, Iota, and I have visited this place three times in three days. The only mark against it, which I am forgiving, is that last night the waitstaff overlooked me for quite a while until a bar tender came by--and then they made up for the oversight by camping my glass of delicious and authentic sangria tinto and an amuse bouche of pan y tomate (I could've eaten a whole plate of<br>that). Here's the run down of our first visit:<br><br>\"Ickkkeeeiiesddola.\" Iota warned that hotel restaurants are rarely great. Well, she was wrong this time. We didn't know this was Too Chef Jose Garces restaurant when we came in. I started to suspect something special when I saw what I consider to be an authentic tapas, modern and traditional, menu. <br><br>When the first dish came out, she said, \"Ickeiaia xtalanop.\" Which translates to, see I told you. No way I'm eating those fish on nuggets. <br><br>By the time the padrón peppers came to the table, though, the brave simian had fallen in love with really good, well prepped anchovies brightened with lemon and olive oil on a pile of toasted pine nuts and chopped olives. Perfect bite territory, folks. <br><br>\"Yayayayyyyieeeaaaah! Coooorrreeeasddpopppo! Yum.\" And when what she called the meet lollipops came out, she nearly knocked her chair over with excitement.\" Um, me too, frankly. This place is knock your chair over good, people. Highly recommended. In fact, we are hear this afternoon for the third time. After tapas and sangria with some new friends from around the country yesterday.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Djme3nZJ4y8a3-Wf1X1U3Q/348s.jpg", "caption": "Iota loves grilled lollipops, like bite-sized chunks of lamb & tomato wrapped in bacon served with brioche and onion paste and spiced jus."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/rJFwImnC3v3yDrLus9UujA/168s.jpg", "caption": "Padrón peppers don't need much, and Garces' crew treats them right with a quick fry and a drizzle of flaked salt and  romesco for dipping."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/73-Z_LEltL16JuYHF_et1A/168s.jpg", "caption": "Iota wasn't so sure about the filets of fish on mystery nuggets. But the anchovies on a mound of toasted pine nuts and olives was divine."}]}}]}