{"name": "metropolis-coffee-company-chicago-3", "reviews": [{"review": {"des": "I've recently moved to Edgewater two months ago and I'm so glad I came across this coffee shop! The atmosphere is the perfect environment to study or meet up with a group of friends in. <br>The Staff is friendly and professional. There are various treats and beverages to chose from however, My personal beverage of choice is the \"Lakeshore Fog\" it's the perfect blend of Earl Grey and espresso with a lavender whipped cream that is sure to add a wisp of pleasure to the pallet on any day, but especially cold snowy days. The flavor brings a nostalgia of the perfect snowy day, under a blanket,  next to the crackling glow of the fireplace. <br>I will definitely be returning to this amazing establishment.", "pics": null}}, {"review": {"des": "I used to love this place.  I love working in coffee shops, whether for online errands or writing, whatever!  It's got a great atmosphere and location, drinks are good, lots of snack and sweet options. <br><br>However, literally every.single.time I come in here now the internet is shit. It cuts out, and even the buffering power of youtube can't save me.  It's not just my computer either.  If you don't need internet, fine, come, enjoy!  <br><br>If you do, don't bother.", "pics": null}}, {"review": {"des": "Definitely Great Coffee. Just a couple of<br>things to note: <br>1)menu is quite limited .... not even sandwiches?!!<br>2) Service animals (including emotional support) are not allowed.<br>Of course, many eateries do not allow  Pets  but service animals and their guardians shouldn't be excluded i think. <br><br>Other than that...their Quiche pies are delicious!!!", "pics": null}}, {"review": {"des": "Just found my favorite coffeeshop in chicago! This Lakeshore Fog is one of their signature coffee with lavender cream on top! Nothing can make me happier on a Saturday morning than it's floral aroma <br>And there are arts, newspaper, and a mini library inside", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ERlB645wedi26IRbCGh3jw/168s.jpg", "caption": "Lake shore fog"}]}}, {"review": {"des": "great coffee shop  to get work done . the only downside is that there are not many places to charge a laptop at . The music is light and not to overpowering to get distracting . <br>The coffee was really good , strong but not bitter .", "pics": null}}, {"review": {"des": "This is a large coffee shop with a nice atmosphere. Staff is really nice. Coffee is decent. I had the Nutella croissant. The croissant was good, but it was very light on the Nutella which some people might like (not me, though). I did find myself kicking back for a while to read my book. Wish I lived closer!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/mqPWKe_NwYWv14txgbbMJw/348s.jpg", "caption": "cafe au lait and Nutella croissant"}]}}, {"review": {"des": "I came here for the first time today and I loved it! The staff at the cash register was super helpful in terms of navigating the menu. I ended up ordering an iced vanilla latte and it was sooooo good. It comes in a mason jar which I love since there's not waste! The shop itself has a ton of seating but still feeling like a cozy cafe. The women sitting near me ordered a pie and it looked quite delicious, so I recommend trying a slice based on looks. Overall, love everything about here and will definitely be back!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/gdpeEYKyophLQsY1L4ywxg/348s.jpg", "caption": "Great place to do work!"}]}}, {"review": {"des": "Reed was my cashier, who offered me (and sold me) on oat milk, which I had never tried before. I got their golden latte, which was made to perfection by kale the barista. Both were so kind and welcoming. Will definitely come back next time I'm in town", "pics": null}}, {"review": {"des": "The best part of waking up, is definitely Metropolis in my cup.<br><br>I've been purchasing the Mocha Java blend on and off for years. The tasting notes? Blueberry and chocolate, what a combo! I love that I can pop into the café and buy a bag and have them custom grind it for free to my liking (i.e. French press, cone filter, flat bottom filter, stove top espresso, press espresso). I'm not sure if this is a perma-promotion, but last Thursday I received $2 off my bag of beans! And I always accept the free cup that comes with my purchase and linger a bit before heading home. <br><br>They deliver as well, but because I live on the northside it's just easier and more cost-effective to visit Metropolis in person. Plus, hanging out there is always enjoyable.<br><br>'til next time!", "pics": null}}, {"review": {"des": "Chocolate Chess Pie! Worth every penny. Didn't grab a coffee. Was a quick stop before road trip back home. Place was spacious with lots of tables. Staff is helpful when unsure of which delectable to choose :) Would stop in again when back in Chitown!", "pics": null}}, {"review": {"des": "Good selection of coffees, pastries, and snacks. Solid place to post up and work, get together with small groups, or recharge on a date. Friendly, knowledgeable staff, and a nice ambiance that's a mix of homey and hipster vibes.<br><br>Personally enjoy stopping in for a Japanese cold brew, hanging out while working for a bit, and taking in the natural light near the windows.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/bhCmfKNzpk-dk0AE8sAz6w/348s.jpg", "caption": "Mexican cocoa"}]}}, {"review": {"des": "A wonderful large coffee shop with plentiful seating and friendly servers. I had latte with ginger and my husband had the Mexican cocoa.<br><br>If you order anything with ginger be warned that they don't use ginger syrup, they chop up huge chunks of ginger and float them in your coffee. It's a bit disconcerting when your lip bumps into a chunk that is buried in your foam and you think there's something unnatural going on. If they used syrup they would have a sweeter, stronger heat from the ginger. As it is, it's pretty weak.<br><br>The Mexican cocoa was sweet but not spicy, as we had hoped. It's pretty run of the mill hot chocolate.<br><br>Great atmosphere and a cool location. Maybe try the cold brewed coffee going through the stills in the back... It's brewed for hours and must be pretty decent.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ylMIXvH64GLiP4RwdHuInw/348s.jpg", "caption": "Cold brew happening in the back."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/avjZHQWGH8PjAgAKambAqw/168s.jpg", "caption": "Mexican Cocoa. Meh."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/lzSgyGS7us_tpjxxB-oQ7w/168s.jpg", "caption": "Ginger latte."}]}}, {"review": {"des": "A really neat and lively spot (with free parking!). I was surprised upon ordering my cortado because they customize how big or small you want it which was very nice. I went with a double shot cortado which was perfect. It was smooth and delicious. A great neighborhood coffee shop in Edgewater, where you can post up for awhile with your work or a good book.", "pics": null}}, {"review": {"des": "Came here for a meeting with a girl I met on Bumble Bizz! Coffee was awesome and the atmosphere is super chill! Definitely recommend for a study spot with good vibes.", "pics": null}}, {"review": {"des": "Metropolis is that indie coffee shop that you can't help but stop by. There's plenty of seating and makes for a perfect warm place to get work done. Definitely a crowded spot so be sure to get there early!", "pics": null}}, {"review": {"des": "I really used to enjoy Metropolis lattes and the drip coffee was usually decent, but the cold brew I got today tasted extremely alcoholic--almost rancid-- as if it had been brewing or sitting out for far too long. I know this because I work at a cafe myself and we usually check the quality of the cold brew we make every other day or so. If it tastes alcoholic, you HAVE to dump it, since that's a pretty clear sign it's gone bad. Needless to say, I probably won't be back.", "pics": null}}, {"review": {"des": "Lovely atmosphere. Great neighborhood coffee joint. Huge, busy, great food choices and delicious coffee.! And besides all of that. FREE PARKING ON THE NORTH SIDE OF CHICAGO!!!! How rare! Awesome!", "pics": null}}, {"review": {"des": "This place is overpriced, below average, and the staff are boring. I will say it's a lot quieter than Starbucks, but if there were a Starbucks close by, I would probably go there instead of this funeral home", "pics": null}}, {"review": {"des": "I was a bit underwhelmed by Metropolis Coffee.  <br><br>The space is light, airy, large, and comfortable, with plenty of seating; it's a good location to hunker down for a day of writing, working from your computer, or studying.  The staff person who helped me was super friendly and nice, and didn't give off any sort of \"too hip/hipster for you\" vibe like is sometimes found in places like this.  And the coffee I tried -- a single origin pourover on the Chemex for me and a ginger coffee for my guy (literally a drip coffee with a couple of big hunks of ginger thrown in) -- was good.  We also tried a delicious, large chocolate scone and a great donut. (If you're tight on cash, the donut was about a third of the price as the scone, and tasted just as good!)<br><br>But that's why I was underwhelmed: the coffee was good, but didn't blow me away.  The single origin coffee was pleasant and very drinkable, with a nice flavor and no harshness.  But (confession time, I love Starbucks) I've had several Starbucks single-origin reserve coffees recently that tasted better.  It's great to support a local place, which is a really strong reason to pick Metropolis over a big chain.  But the coffee didn't live up to the hype for me.", "pics": null}}, {"review": {"des": "One of my favorite hangouts when I was going to Loyola! I still come back here to catch up with my friends or just to secure a quiet nook in which to do some studying. Lovely calm atmosphere, but getting a seat can be tricky--there's a ton of Loyola students and locals who usually have the same idea. I wish they could expand this location or have an outdoor option one day.", "pics": null}}, {"review": {"des": "I think the word I would like to use is.. underwhelmed. The aesthetics are hipster-ish and comfortable, and I like the pop of color on the cup and plate that came with my latte, but the coffee itself wasn't adequate. I don't know where it went wrong but the coffee really had no body / aroma and just diluted. Perhaps the steaming didn't go correctly or what not. Presentation is on point, but I'm wasn't pleased with the latte.", "pics": null}}, {"review": {"des": "Love this place! I live right by and it's so much nicer than just going to Starbucks. There's plenty of tables and the mugs are really nice to hold (they're nice and big). My only issue is that sometimes service takes quite a long time.", "pics": null}}, {"review": {"des": "Definitely one of the better coffee rosters in the city. They roast on the premise and have a huge space full of tables. You'll see a lot of Loyola students here  during the semester along with other community members taking advantage of the wifi. <br><br>The service can be hit or miss. Some of the staff are friendly and welcoming but I regularly run into staff that makes me feel like I'm not \"cool\" enough to be there or I'm bothering them by placing an order. <br><br>Be careful if you do order anything special like no ice or tea in anything but the 12oz cup as they'll often forget or ignore the request.", "pics": null}}, {"review": {"des": "The pie. Any pie, all the pie, just do yourself a favor and get pie. The coffee is good too; I'm not a huge coffee person so I can't really go into much detail about it, but I enjoyed it. The service is friendly and there's also a small cute outdoor seating area for warmer days", "pics": null}}, {"review": {"des": "THIS PLACE GETS CROWDED, but for obvious reasons. One reason could be that I went on a Sunday. Two, maybe finals were coming up and everyone was looking for a place to study. Three, it is just really good coffee. Well let me tell you, it's probably all three. The environment seems like a good place to study, but I suggest to maybe go on a weekday if you were planning to get any work done. If you just want a drink or a quick bite to eat, this place is great! Again, it all depends on your intentions. Pictures below was the Ice Tea and Spinach & Feta Handmade Pie, both I recommend.", "pics": null}}, {"review": {"des": "Good solid coffee spot. It's one block West of the lake, which means parking is HORRIFIC but they have a small parking lot where you can sometimes snag a free spot. This place is huge and there's an array of couches, tables etc so there's plenty of room if you want to hang out for the day. It can get loud with all the people, so I wouldn't recommend going here to work unless you don't have to make calls. I've have their eggs, bagels, quiche, smoked salmon and a few other things, all were yummy. I live that you can buy their beans here, as well. The baristas are all very friendly, too. Which is a plus", "pics": null}}, {"review": {"des": "One of my favorite places in the city. Great coffee made by people who care about their work. <br>Good basic food options - though less than they used to have. When they reduced their menu they explained why, which I appreciated. <br>Plenty of space to work on your laptop or meet with a friend/colleague. <br>Chill neighborhood vibe, all types of people come through.<br>One block from the train and one block from the lake! Coming here is a great way to have a mini-vacation, even as a local.", "pics": null}}, {"review": {"des": "Def a great place to stop by to get quick coffee or snack!", "pics": null}}, {"review": {"des": "Metropolis Coffee is a big personality in a big ole city.  It can be hard to stand out amongst the sea of coffee shops when our great city is overflowing with them, but Metropolis Coffee does a pretty good job at drawing in the crowd over and over again.  I've now been to Metropolis Coffee twice, and both times it was filled with coffee-lovers alike, many of whom appear to be regulars.  This coffee shop is seemingly beloved by  the peeps in its hood, but also by busy, busy bees like me who are trying to do work (there's a ton of outlets for is too!).  I find it extremely comfortable and easy to dive into your work whilst here; despite how large it is, it feels cozy and it's not too loud either.<br><br>Now that I've been here twice, I have had their Chai tea latte and their green tea latte.  As the staff person had advised me, the green tea latte is extremely sweet (no sugar needed), but it's scrumptious alright.  That's a sweet treat, no doubt and I wouldn't be getting that all the time if I were you...it's rich.  The Chai tea latte was fair, though I probably would have liked it more were it hot.  I'd asked for it hot but the staff made it iced, and I didn't have the heart to ask them to change it when they were already so scattered with having to make the large amount of drinks.  I just thought the flavor of the Chai was too subtle.  Next time I go I would definitely like to try their regular coffee or the Kyoto-style coffer they pride themselves on.  Metropolis Coffee is definitely setting themselves apart with offering that. <br><br>I also ordered the pear and cheese danish on my first visit...it was a bit dry so I asked them to warm it up which they were happy to do.  This did wonders, and it ender being quite delicious.  The pastries do seem a bit underwhelming and I probably wouldn't ever order food from here again, but thst danish was top notch...but only after it was warmed up.  The pastries aren't good enough to cost $4 so that's another reason I won't be eating here.  The coffee and drinks, on the hand, are worth the price but don't worry - you're not paying an arm and a leg for it here.  The prices are comparable to all the other shops in the area.<br><br>What's also cool is that they have tshirts and sweatshirts, not to mention mugs and other awesome gifts, for sale.  Because marketing works so well on me I would totally get myself a gift from here - they have some pretty cute stuff.  Sorry - that's not the only cool thing here.  They also have daily coffee and tea specials which look good, but that I haven't had the chance to get to yet.  <br><br>Just a head's up: be prepared to order once you get to the counter because the lines forms real quickly behind you, and the staff are like crazed lunatics (in the nicest way possible) making the drinks at lightning speed.  They don't have time for uncertainty.  The staff probably won't let on that would want you to hurry up the pace, though, because they're very friendly and helpful.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/QwSmWjagoYKBat7NQysrEg/348s.jpg", "caption": "Mexican coco"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/qfjSohQIQhl4sdKLAZDyCg/168s.jpg", "caption": "Green tea latte...delicious"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/wAFM6nfdTcqXkFr4D2bOeQ/168s.jpg", "caption": "Iced Chai latte"}]}}, {"review": {"des": "My favorite coffee shop in Chicago by far! The staff is amazing and super friendly, the coffee is perfect, and the overall atmosphere is exactly what you want from a coffee shop. They have a large space which means that, even when they're really busy, you can almost always find a seat. This also makes it a great place to meet a friend or have small group meetings for work. Literally can't say enough good things about this place!!", "pics": null}}, {"review": {"des": "I love this place. I wish there was one on every corner instead of another coffee shop that shall remain nameless. They have awesome quiche and pastries and I love the chai tea the most. It's warm and cozy and the people are always so friendly. While there is plenty of seating, it is always pretty packed because it's awesome. It's dependable like an old friend.", "pics": null}}, {"review": {"des": "Top notch coffee and service. Been going here for about 4 years. Their coffee is sold at Whole Foods as well and they put a lot of care and detail in their roasting. Love it. Quality products.", "pics": null}}, {"review": {"des": "I went in during a morning rush and waited in line about 5 minutes.  I went with the iced coffee.  I was disappointed that they did not add any cream or sugar or ask me prior, so had to go over to the side table and add it myself. I don't know if the baristas were too busy or stressed but it was not a good experience,  and the coffee went to waste. Needless to say,  I have not been back.", "pics": null}}, {"review": {"des": "Really love their pomegranate spice coffee, creative. Seating is  scant with as many people who do come in, but this place is worth a visit. Very warm and welcoming place.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/MlStNzZI0Aw7ef1PQ2RUOw/348s.jpg", "caption": "Pomegranate spice latte"}]}}, {"review": {"des": "Fantastic coffee  with lots of room to spread out. This place is divided into three larger rooms. Each room is filled with lots of seating. I had a piece of quiche and a cafe au lait. Both were yummy and warming on a cold fall day. Great place to meet a group of friends, but know it can be very busy.", "pics": null}}, {"review": {"des": "Went back to this place after years, and it's still great, so I've decided to give it a review.  <br>I love the atmosphere there.  Even though it's on the larger size as far as coffee joints, it still keeps that cozy feeling of a smaller place somehow.  There is plenty of seating.  This time I went at peak breakfast time, and even though it was mobbed, I got a seat right away.  <br>The staff is super-friendly, and both the food and coffee are fantastic.  I got the griddled ham egg cheese English muffin breakfast.  The muffin itself was great.  It was cooked just right, and the muffin was nice and fluffy (which I like - I know some people prefer more crispy).  The salad that came with it was also really good, especially the dressing.  For coffee, I got the Mexican hot chocolate with a shot of espresso (I forget what the official name is)...mmmmm, so good!  To top things off, the prices are actually quite reasonable.  <br>Definitely going back again.  Great job, folks!", "pics": null}}, {"review": {"des": "I like this cafe to do work, but it is definitely not the most quiet place. If you want complete quiet and concentration for studying, this place probably is not for you. The music can be a bit loud, so I come somewhat often, but I can't stay for super long.", "pics": null}}, {"review": {"des": "Came for the Indie Coffee Pass and got a double Cortado which was a beautiful drink.<br><br>The barista who took care of us was smiley and highly recommended the Lakeshore Fog which I now really want to try. <br><br>Lots of local art and photographs, and a good amount of seating. <br><br>Here around 11:30 on a Sunday, the line for the counter wrapped around the front area of the shop. So it seems that it's a pretty hoppin' place!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/jNsB1I4gak5f6Gy58M6bSA/348s.jpg", "caption": "Double Cortado and Kyoto cold brew!"}]}}, {"review": {"des": "I cannot find a place like this serving sophisticated latte and nice intensity and flavor of coffee :) I enjoyed my latte with free wifi.<br><br>Two things, I want to suggest this place are 1) spacing and 2) cleaning. <br><br>I think they can organize interiors to fit more people and be wise to use space efficiently. This large crowd of people fighting for seating leads my second concern. It won't let any staffs to clean up the tables and floors because as soon as table is open,<br> It was taken in a second, so it kept uncleanliness all the time. I hope they will fix these soon.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/iRMlniUC5bzTygAx9uHBYg/348s.jpg", "caption": "Latte. I like this cup and blue saucer."}]}}, {"review": {"des": "Coffee wise is really good, it will be a perfect place for chatting, meeting, drinking coffee , but not for studying at all especially the weekends.. i have my solo on with my own music but still too loud that I can't concentrate and study, i hope they can do like the last section for studying which should be less noisy and quieter, however it could be good for group studying.", "pics": null}}, {"review": {"des": "Prices have been raised at an already expensive coffee place. Great product, but I can't imagine why the prices have gone up significantly. They are busy from open to close. Maybe the owner needs a new car. It's a shame to see. I will limit my future visits.", "pics": null}}, {"review": {"des": "Coffee and croissants are delish! The internet situation has been fixed and the staff is friendly. They now have a place to print and the printer saved me earlier today from not having to driving to get replacement ink for my printer.", "pics": null}}, {"review": {"des": "I love their chai!!! Spicy with just the right amount of flavor! Yum. Also, great espresso.", "pics": null}}, {"review": {"des": "This review is for their ONLINE ORDERING and shipping.<br><br>I used to live in Chicago, and now live in SoCal. There are some things I miss about home, so I try to experience little bits when I can, like following the Blackhawks during hockey season, hitting up the local hot dog place that serves authentic Vienna Beef Chicago dogs with bright green relish, etc. <br><br>Another way is to order some delicious roasted to order coffee from Metropolis and have it shipped. I immediately fell in love with Schweik's Blend (AMAZING with some half and half or heavy cream, but tasty all on its own, too) after ordering a pound of it, and just placed an order for TWO pounds since I went through a single pound so quickly. They ship it SUPER FRESH, and they offer pretty much any grind you want, where some other places don't (example: Cone Filter, Stove Top Espresso).<br><br>I love that this is not a huge chain and that their coffee is affordable and GOOD. I really like supporting smaller businesses when I'm able to.", "pics": null}}, {"review": {"des": "When I visited: 2.24.16<br>What I got: 16 oz Coffee of the Day (Mocha Java)<br>Drink Review: I'm always delighted by their different roast available every day. I almost always take my coffee black and as the maiden visit with the passport, I was sure to stick to my basics. Their board signals what notes to expect in the brew, which is a nice touch. The roast itself was a nicely balanced, and overall calm yet bitter presentation of Chilean beans that let me with a great aftertaste. Not my favorite, but never a bad cup here. <br>Cafe Review: Full disclosure- This has been my 'home cafe' for the better part of seven or so years. As a Loyola alumni and a Roger's park resident, this has always been my go to spot for some local caffeine. The overall aesthetic matches the eclectic, multicultural, yet welcoming vibe of Roger's Park and Edgewater. Over the years, the art on the walls have changed a bit, and a few different baristas have come and gone. In the end though, I will always have a deep love for this place. The three main seating areas provide different lighting and style, along with a variety of short, medium, and long term seating as you go further into the cafe itself. In this progression, there are options for both work focused (well weather wood tables and chairs) and comfortable (welcoming leather and suede couches, sofa, and reading chairs). Another great value added to this spot is the solid food offerings (I recommend the Lox bagel or the spinach pastry) along with a dedicated brew bar offering phenomenal coffees and teas from rare loose leaf teas and single origin roasts to authentic Kyoto style brews.<br>Overall Visit Rating: 9/10", "pics": null}}, {"review": {"des": "Ginger latte should come with a warning... I sipped my drink expecting spicy gingery goodness, but nearly chocked on a huge chunk of something. What is this in my drink? A cookie? Coffee suds? I thought. No... it was ginger. A huge chunk of raw, hairy ginger. Not even candied ginger. And there were SEVERAL of these on my small 8oz latte! Worse part is, there was still no flavor :/<br><br>Next time, warn customers that the ginger latte is flavored with real ginger instead of a house-made syrup... before they choke on a chunk.", "pics": null}}, {"review": {"des": "I'm always looking for cafes to work out of and Metropolis is great for that. They have free wifi and plenty of tables. Even though it's a large space, it still has cozy coffeehouse feels. The people that work here are always really pleasant. I had a iced chai while I was here and it was great. They have a decent selection of sweets and small bites in a case by the register.  It is a bit of a pricier place to get coffee though. Overall, it's a great atmosphere if you're looking to get some work done or just chill and enjoy a cup of coffee.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/scSWlScl6hm474vhsVM4zg/348s.jpg", "caption": "Cool interior"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/npVD8LwFsNyl53wPxbfd8g/168s.jpg", "caption": "Iced chai"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/4wWtf9aTgl5bNRCCaQzvVw/168s.jpg", "caption": "if you like to people watch like I do, post up at the bar stop by the window"}]}}, {"review": {"des": "Somehow, the coffee I ordered there today cost more than $7.00. I asked for something like a Frappucino. Everyone knows a what a Frappucino is. It's a blended coffee.  They just gave me an iced coffee instead. For $7.00? I don't think so! Also, they have a very limited selection of flavors. Just not worth it.", "pics": null}}, {"review": {"des": "Great coffee spot just off the Granville L station. Many many many years ago I lived in this area and on a recent trip to Chicago I got to take my wife around my old stomping grounds. <br><br>Unfortunately, Metropolis Coffee Company did not exist (at least not at this location) when I lived there because it would have been my favorite stop!<br><br>Great baristas that take pride in their craft.", "pics": null}}, {"review": {"des": "Cool little coffee shop just a few blocks south of Loyola University campus. Free wifi with lots of tables and seats if you fancy a spot to sip on coffee and catch up on some emails or get some studying done. For the same price as Starbucks, you can get a much better cup of coffee from here, SO WHY NOT? <br><br>They do have those nifty Kyoto Style ice coffee makers if you wanna get something unique as well as a variety of different coffee beans you can choose from for their pourover method. Be sure to take your coffee straight black with no sugar or cream to really get a taste of the coffee for what it's worth. There is a difference!<br><br>'Til next time, cheers!", "pics": null}}, {"review": {"des": "Oo la la. You want good coffee? No, correction. You want great coffee. This is the place. Probably the best coffee I've ever had in my entire life. I go to school right near it and honestly spend the majority of my time here. Great place to chill with friends and do homework. the baked goods are AMAZING too. highly recommend the choco chip scones, but you gotta get there early bc they run out. Apple pie is pretty good but overpriced. come here.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Qn8CbQyUL3vCe3UXwMAhGw/348s.jpg", "caption": "cafe au lait!"}]}}, {"review": {"des": "Came here yesterday on a whim for a coffee.  Had the Kyoto cold brew and it was pretty good, a little sour for me but definitely strong!  Nice staff, great location, I'll be back!", "pics": null}}, {"review": {"des": "Metropolis is a shining example of great coffee, and their large location on Granville is extremely popular, so get ready for a location filled with folks who love it!<br><br>The sign at this location says it opens at 7:30am on a Sunday - however - don't let that fool you! I got there at 7:29am, and there were already 10 people in line!<br><br>I particularly like the fact that this place has a kitchen, and they serve up some excellent lox and bagel - complete with capers and onions - YUM.<br><br>The coffee is of course excellent, and though the space is large and filled with tables, I still somehow managed to hear my name when my order was up. It was a little bit chilly, so be sure to bring a layer or two if you get cold easily.<br><br>If you're looking for a quiet place to think - this place isn't for you. However, they do have free wi-fi, and it's a good place to meet up with friends over an excellent latte, chai, mocha, or tea.<br><br>Cheers!", "pics": null}}, {"review": {"des": "The Q's like Metropolis. Great coffee, lattes, teas, and a straight forward breakfast delicious pastries, veggie/or ham cheese croissants, bagels etc.<br><br>When the weather is warmer they have outside seating, offer free Wi-Fi, and great happy servers, laid-back environment and they welcome well behaved dogs.   So come and enjoy, we always do. Mrs. Q says: Don't forget to ask for their punch card.  After 10 drinks, you get one free.", "pics": null}}, {"review": {"des": "I recommend this place for people who want to get some serious work done!<br><br>First of all, there are enough outlets for your laptops, tablets, and cellular devices.  Although chances are that you may be sitting with some working strangers diagonally across you at a large table, you will still have your own privacy.  Clientele is consisted of college students (Loyola), working professionals, and career yelpers like myself.  The entire place is comfortable to sit for a considerable amount of time.  Toward the back of the coffee shop, there is a couple of cozy sofas with a small coffee table just in case you want to snuggle.  <br><br>Well, it's a coffee shop.  I know the coffee has to be good, correct?  I had the 12 oz. chai and green tea latte.  Even though the chai wasn't the best I've had (Bridgeport Coffee Company is more superior in the chai category), I couldn't really complain because it was still quite good.  I'm fond of the green tea latte though.  I liked it that it was savory, but not at all cloying.  The prices of the coffee are pretty reasonable.  You can get a cup of regular for a little over $2.  Mr. SB and Miss DD: retreat your footprints in Chicago; your coffee is subpar.  <br><br>They didn't require the password for the free wifi, and I was able to log on it after registering with an e-mail address.  They do have some profound, philosophical books for you to peruse, but I will pass because I've had my life figured out.  <br><br>It's located two (2)-minute walking distance to the CTA Granville Red line station.  The surroundings seem to be safe because the Loyola dormitories are in proximity.  I saw the Chicago Police and the Campus Patrol Unit constantly going around to watch suspicious activities.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/3oSBh8pVKmO9xXY47b5r0Q/168s.jpg", "caption": "12 oz. green tea latte"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/YSJIs58jHwYuXRo9lHh4qA/168s.jpg", "caption": "12 oz. chai"}]}}, {"review": {"des": "I love Metropolis, and I've been singing their praises to anyone who will listen for over ten years... but.... somebody needs to teach the baristas how to make a chai. The hot chai is wayyyy overly spiced. The iced chai is a glass of milk with a shot of tea. Everything else is great, please do better for the tea lovers! xoxo", "pics": null}}, {"review": {"des": "Metropolis is a quaint coffee shop in a trendy location. The coffee was good but not memorable. The almond milk was store bought rather than homemade (trust me, there is a difference). Ambience is nice. Service is good but not phenomenal. I think they have such potential to be a great place but fall a bit short. Overall nice but wouldn't go out of my way.", "pics": null}}, {"review": {"des": "This is probably one of my favorite coffee shops in Chicago. The coffee is excellent! The shop has a hippy feel to it with a welcoming environment. It's usually crowded with students probably from Loyola since it's close by. It's also close to the lake. So my friends and I like to grab coffee from here and walk over to the lake nearby. The lake also has a playground that the kids can play at while you enjoy your coffee and the view. <br>In terms of parking there's a good amount of free street parking. The service is always excellent!<br>I like to get the house blend of the day, mocha and my friend got the Mexican hot cocoa( I think)it was excellent. In terms of coffee my three favorite places  to get a good cup of coffee are from metropolis, intelligentsia and ipsento. Definitely check this place out! They also sell there house blend coffee beans at target if you can't make it out to the store.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/l2aaGL8lv3iHQqkc2ghvMg/348s.jpg", "caption": "Cash register area and bakery"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/84rj5jqux6d0Y1GsyAmLng/168s.jpg", "caption": "The shop decor"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/PB3-0UgXg5qkbHsXdHYPJQ/168s.jpg", "caption": "Mochas"}]}}, {"review": {"des": "Packaged Coffee Fluff...<br><br>Candidly, I've enjoyed my experiences \"in cafe\" but their packaged coffee was almost insulting. Metropolis has done a decent job of branding, packaging and marketing, but<br>their labeling of ingredients suggests that what's inside the bag is less important to them than the bag itself... and implies it should be to us as well.<br><br>Forget branding \"philosophy\" and \"coffee aesthetic\" and descriptive words like chocolate, cinnamon and butterscotch... be transparent about what's in the bag!<br><br>Your blend \"ingredients\" state \"coffee beans.\" Really... like we'd buy expensive wine with labeling for ingredients saying \"crushed grapes.\"<br><br>While your \"Single Origin\" selections imply something uniquely special and do identify the coffee varieties... they are hardly of \"single origin.\" Consider your KENYA WEITHAGA... it not only comes from multiple farms spread out over a large geography and at different altitudes; it includes - NOT One, but Four different varieties. <br><br>I've had good, mediocre and bad coffee from Metropolis, but finally threw in the towel because I don't want to guess what's in the bag. Is it strong bitter Robusta or bold, nutty flavored Columbian Arabica beans? Nor do I want to pay top Arabica prices for Robusta beans. It's like paying Opus One prices for box wine.<br><br>I'm reminded of J.Peterman catalogs where it's about effecting an immediate buying decision based on the mental imagery of words/text/story, while product facts run thin. <br><br>But hey, the ambiance and energy of the cafes can make up for experimenting with what's in the cup. I mean anyone who's ever gone camping can attest to... even Folgers tasting great over a camp stove at 6AM.", "pics": null}}, {"review": {"des": "The coffee is great and fairly strong and the environment is one of the best in the city blah blah blah STRAWBERRY JAM DONUT I GOT THE LAST ONE TODAY YOU DIDN'T AND IT WAS AMAZING...also about a month I took a copy of Fight Club from the bookshelf and forgot to bring something to replace it. I've even seen most of the movie in YouTube clips since and am just remembering now that I have the book. So I don't think I've even opened it, but it looks nice on my bookshelf. I'll try to remember to bring a book to leave you guys later.", "pics": null}}, {"review": {"des": "I quite possible had the absolute worst tasting coffee ever! I bought a bag of whole bean Red Line Espresso to brew at home. This is the first time I have ever purchased their coffee, I have been home brewing espresso for 15+ years.<br><br>First: the bag was extremely difficult to open. Not a huge issue, but highly uncommon with coffee - especially with small batch makers. <br><br>Second: Second the aroma; it was off... simple put it was off. It did not have the typical earthy sweet caramel notes one would expect. Then I noticed how dry and light the beans were. Espresso beans usually have a sheen of oils from the roasting process covering the beans and they are often very dark - nearly black. These were the color of peanut butter.<br><br>I went ahead and did my grind and brewed my cup following all the normal steps I always take. I noted right away how light and transparent the coffee was coming out. Once I added my steamed milk it took on a very pale beige tone.<br><br>Now the taste... it tasted stale or sour. There was little that resembled coffee in flavor or color. I gave it another try the next morning and altered the grind slightly as well as the pull time to see if I could enrich the flavor any - still no luck.<br><br>I'm sure their coffee shops are lovely but based upon the coffee alone; I think I'll pass.", "pics": null}}, {"review": {"des": "Damn. The stereotype about Japanese \"salarymen\" working late into the Tokyo night must be true, if the Kyoto-style, cold-brew iced coffee having a groovin' house party on my tongue right now is any indication. This stuff is good and strong, good AND strong--all three combinations.<br><br>I don't know what's with the folks in Kyoto, though. I once travelled there, and it was a mellow city with a rich history and a relatively slow pace of life, at least compared to the major cities of Japan. Maybe they are like the drug dealers that source & sell the stuff, but have a rule not to use the stuff. They just ship it to shaking addicts in Tokyo and beyond.<br><br>I'm not up this way too often, but Metropolis has been on my 5-star cafe list since the first time I set tongue on it, about the time that it opened. The coffee is good, and I especially appreciate the ambience: the big couches and small and group tables; the multiple rooms, both quiet and with music; and the diversity of people here: a many-bean salad of ethnicities and earnings, students and salary-(wo)men, the young and the still-youthful, paper- and pixel-lovers, the engrossed and en-gossiped, those alone and accompanied... Stop me if I'm boring and belaboring you. <br><br>The counter staff has always been friendly to me, and they've always had a sense of humor in this oh-so-serious world of coffee, where they clearly know beans about beans. When I've seen Jeff, the owner, he's regaled me with stories of his trips to Brazil and the large stacks of sacks of coffee we were standing by, and about the virtues of making espresso with a not-so-dark roasted bean. <br><br>While I wish they were closer to my abode, I'm glad that they're not, because this place is one-of-a-kind.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/xVg80zvYhTSf1Xpu5cvIqQ/348s.jpg", "caption": "\"Step away from the apparatus, Walter White. We're not cooking; we're cold-brewing, drip-by-drip. It'll still blow your mind\""}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/A5nlUkzIx49Hiq7vbcavMw/168s.jpg", "caption": "Still, cold-brew waters run deep. This innocent-looking Kyoto immigrant may just kick your ass, in a tasteful way."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/F76CJOs7B5zsv5Gzc2UCUw/168s.jpg", "caption": "\"He didn't think of himself as a hero. He was a regular guy, drinking Kyoto-style coffee & saving lives, just like anyone.\""}]}}, {"review": {"des": "I post up with my computer and work here at least once a week. Love this place!", "pics": null}}, {"review": {"des": "There certainly are both hit and miss aspects to Metropolis for me, but when it comes down to it, they are good at what they claim to be good at: making coffee. In addition, their beans are exquisite, and are always fresh; you really can't go wrong with their beans for home brewing. <br>Their pastry selection is diverse, and is certainly a draw for walking 6 blocks to visit their shop. Expect to walk away with a $10-12 bill if getting a drink and slice of pie, but it's quite worth it. They also offer a punch card that is relatively generous in comparison to comparable programmes (AHEM...STARBUCKS).<br><br>In regards to the \"miss\" of the hit and miss designation...Metropolis is hipster. Very hipster. As are the majority of their customers. Sometimes its a bit off-putting, and makes it hard to be comfortable in such a silly atmosphere, in such silly company, but oh well...<br><br>Metropolis recently renovated their store layout, and it's now much more open-feeling and comfortable. Nevertheless, expect to have to hunt for seating during peak business hours...and keep in mind that people do love to sit there for hours, sometimes doing apparently absolutely nothing. To-go might be a good idea at these times! <br><br>Must have drink: lavender latte, or caramel cappuccino<br>Must have pie: Derby pie, or chocolate cream pie", "pics": null}}, {"review": {"des": "I've been coming here for years to study, drink coffee, and hang out. The music and atmosphere is as quirky as it is warm. <br><br>The baristas are friendly to chat with and always accommodating. They strike a balance of being professional and knowledgeable without being pretentious or condescending. <br><br>I had a two-shot cortado today and a spinach feta hand pie. Both were terrific! Free-wifi, a stack of newspapers to read, and good conversation with fellow regulars from the neighborhood.<br><br>Importantly, the cafe has explicit signage supporting T-friendly bathrooms. I love this place!", "pics": null}}, {"review": {"des": "Great triple shot cortado. Visiting from SF where coffee is sooo good. I was looking for something similar to my fav back home and this place delivered! This will be my go to spot while here!", "pics": null}}, {"review": {"des": "Great staff, excellent coffee and pretty good pastries. A wonderful bang for your buck.<br><br>My daughter and I went there 3 out of 4 mornings during our trip to Chicago for a tour of the Loyola University campus.<br><br>Day 1. Walked up to the counter and ordered a drip Brazilian med roast and a 4-shot Macchiato, an apple-cherry pie slice and a coffee cake. The macchiato was excellent....a wonderful dollop of foam on top of 4 shots of espresso wherein the crema formed perfectly to provide a nice set of layers.....espresso, crema, foamy milk.....the drip coffee was really nice with a great balace.<br><br>Day 2. Walked in and was greeted by the cashier by my first name....very impressive considering that the previous morning, we decided to explore a different part of the city. We wanted to see their latte art skills and ordered cups of cappuccino and latte and was not disappointed. The coffee was awesome by the way with perfect balance of richness, nuttiness, smokiness (very very slight), brightness and cocoa. <br><br>Day 3. We were greeted like regulars amidst the crowd in line. That was special. We ordered a couple of 12 oz cups, my daughter got the Ethiopian drip and I got the Colombian pourover.  Again, nothing but great things to say about their coffee as it seems that their roaster knows what he is doing.<br><br>If my daughter decides to attend Loyola, they have a regular customer in her. If that happens, I will probably end up making friends with the roaster and share some knowledge with him/her as well as learn new things from the rest of the staff. <br><br>I'm hooked.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ru2iiRD01EmWMyipXAn87w/348s.jpg", "caption": "Lovely"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/lLXKaO1yy6C_mABS7ZfdWA/168s.jpg", "caption": "4 shot macchiato"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/m_8V0JyYjB8tHjyCd2AvLw/168s.jpg", "caption": "Daily brew. 4 shot macchiato, apple cherry crumble and coffee cake"}]}}, {"review": {"des": "A+ decaf mocha! D- on the pastry selection; not even a cookie to be had here! Bring your own snack:)", "pics": null}}, {"review": {"des": "Was in the area for Halloween and my friend told me I had to try this place I was a little iffy considering all I knew before here was Starbucks, when I walked in not only was it crowded but the atmosphere and the employees were so nice! I ordered a mocha and the prices were very good! That was beyond the best mocha I've ever had!!! I wish there was more metropolis coffee company's out by Orland park so management please make it happen if not I'd love to become a business partner and see what we can't do. Will defiantly be coming back thanks for the great experience!!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/DcEBX27fkuxuCSo57PdWkg/348s.jpg", "caption": "Best mocha ever"}]}}, {"review": {"des": "At the recommendation  of someone I'm following on Instagram, I decided to try out Metropolis. The hipster vibe is very much 2010, but the coffee is fantastic. I got the ginger coffee brewed with Kenyan Weithag as a pour-over. I liked it a lot. The coffeehouse is a nice size and seems to pack quickly. I will go for takeaway in the future.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/zG8Gmm8CX2vJ6XqTgVHpTg/348s.jpg", "caption": "Ginger Coffee Brewed with Kenyan Weithaga"}]}}, {"review": {"des": "A perfect balance between being rundown/shitty and cool. Whoever put this place together was clever - minimal art on the walls (much of which is by local artists and for sale), a large space to utilize, and some pretty good coffee. I enjoy coming here for these reasons.  <br><br>Understandably, every time I come here it's pretty packed.  The crowd seems to be mostly students and friends hanging out. Be prepared to get overwhelmed by the amount of hipsters that are within a 20 foot radius of where you're sitting.  Whatever, though, they don't bother me.<br><br>As far as drinks go, I have tried their iced chai, regular coffee, and Italian soda.  All were good.  They don't carry almond milk, sadly, but they do offer hemp milk for those who don't do dairy or soy.  <br><br>Parking is plentiful.  Out front is regular paid parking.  Further down the street, in the residential areas, there's free parking (just a short walk away), and the company provides a small lot next door for customers (but good luck finding parking there).  <br><br>I am a big fan of coffee shops and the environment they provide when I'm studying for school.  At the moment, I'm taking a break from a 20 page paper that's due in...oh...two weeks (only 16 more pages to go!).  Places like Metropolis provide just the right amount of human contact for people like me who don't like working in total silence.<br><br>I'll definitely be coming here for a long time to come.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/2hibNyDu6ExINcXerpyXYw/348s.jpg", "caption": "Apricot earl grey macaroon, iced chai tea with hemp, and some weird water."}]}}, {"review": {"des": "Merrrr I went here and had coffee and tea and cookies but I was sad there were not amazing pie options. The coffee and tea were ok and the cookies were 2 star cookies which brings this rating down. On the plus side I loved the staff so that brought it up to 4 stars. Also, tip: a lot of people are working and studying in the side room so I felt kind of rude chatting with my friend over our respective beverages but what's a girl gonna do ya know? When you gotta gab you gotta gab.", "pics": null}}, {"review": {"des": "I love going to Metropolis - strong internet connection, plenty of seating, they'll give you more hot water for your tea as often as you want. What is there not to like? <br><br>I usually get the weekly pairing, because why not? Also because it saves me the stress of trying to pick a tea off what I think is a very substantial list, and then deciding whether or not to get a pastry. Just get the pastry and the tea they suggest. You won't be disappointed. <br><br>Protip: if you have 500+ followers on Instagram, download the app Popular Pays for a free weekly pairing once a month! Literally MY FAVE thing.", "pics": null}}, {"review": {"des": "Friendly baristas that remember your order! We brew metropolis at home also so we buy our coffee here also. Love coming here for weekend breakfast (faves are the lox bagel and breakfast sandwich). Always great selection of pastries fresh! Great neighborhood spot :)", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/9GMa-dJ2afJSKcUreqYorw/348s.jpg", "caption": "The BEST lattes and tasty donuts in town"}]}}, {"review": {"des": "Friendly baristas, superb coffee, and even more wonderful selections. This is the only place I actually commit to filling punch cards. I forget everywhere else. But here, every cup o' joe counts.<br>Their chai lattes are some of the best too!", "pics": null}}, {"review": {"des": "If Metropolis exchanged places with Starbucks and there were zillions of MCC's and 1 Starbucks, I would be okay with that. This perspective is coming from a Starbucks devotee. There is something  special about Metropolis. From the attention to detail of every single drink creation to the carefully selected espresso, coffee beans, tea leaves, unique sodas; there's something refreshing, aromatic, caffeinated and simply divine, for everyone to quench their thirst or merely wake up. <br><br>Metropolis has the competition in the bag as far as quality, delicious tasting baked goods. Some are homemade, others are brought in from a bakery - all are simply delicious and worth every caloric bite! Several months ago, they advertised on Craigslist that that they were giving away free coffee bags. I got a bunch of these cool cloth bags - in fact, several of them. Not because I had an immediate use for coffee bags, but because I wanted the aroma of Metropolis in my house and I do want to find an art project where I can use the most interesting coffee bags.", "pics": null}}, {"review": {"des": "Staff is always upbeat. Very fast service. Great space to work on my laptop or catch up with friends. Never tried the food but I'm sure it's good.", "pics": null}}, {"review": {"des": "I've never had a bad experience coming here! Great tasting coffee, reasonable price, and a friendly atmosphere make it a neighborhood hotspot!", "pics": null}}, {"review": {"des": "Pros: fantastic coffee and staff. There's even a quiet room at the back that's great for work/study. Fast and reliable WiFi.<br><br>Cons: Music can be loud and not that great. Either one of those would be fantastic, but the combination loses out. Loud music also frequently encourages fellow patrons to talk louder than they normally would, even in the quiet room.", "pics": null}}, {"review": {"des": "Their coffee is always burnt. I hate this place. If you're going to push a bullsh*t hipster vibe (glazed with a not-even-surreptitious corporate shine) at least have good coffee. Maybe their knockoff Starbucks sugar frothy latte stuff is better--although it's not cheaper than Starbucks. I can't wait till the Dunkin opens down the street so I can drink reasonably priced coffee and be comfortable expecting that it will be burned as sh*t.", "pics": null}}, {"review": {"des": "A bit overpriced  but way worth it. This is a super busy  but still managed to stay local low key and customer oriented establisment. It has a groovy artsy feeling and noticed  lately that they do have local artists paintings that are displayed  for visual enjoyment as well as available for purchase .  The absolutely best thing  from the menu here is the green tea latte with a prosciutto croissant. Amazingly delish.  If visiting edgewater  this place is a must try.", "pics": null}}, {"review": {"des": "Ouuuu I liked this place!<br><br>Perfect, cute lil coffee shop!<br><br>I came here with my crazy cousin and he's ADHD self ran to the back to talk to one of the coffee baristas because he found out they also brew coffee using the cold press method (or something like that).. so he was in the back for a while talking to a cool barista. <br><br>Meanwhile I ordered a medium mocha and it was delicious!!!! Also they do the cool cute coffee designs on the top and I was just simply content! <br><br>There was an ample amount of sitting. The crowd was a good mix.<br><br>Once my cousin came back (like 20 minutes later), we shared a piece of apple pie, which was good, but not something like \"wow\".. but decent. <br><br>Highly recommend you go and try their coffee!!!!", "pics": null}}, {"review": {"des": "My favorite coffee shop. Excellent roast & fantastic prep. I don't usually buy coffee in the streets but when I do, it's Metro. So good I even bought a shirt", "pics": null}}, {"review": {"des": "Nice seating area and change of pace from Evanston's coffee shops. Tried the Kyoto iced coffee, which has a very distinct flavor but was good nonetheless. The spinach Gruyere quiche was yummy but nothing to write home about. I like the variety of seating options...multiple large communal tables and smaller tables near the wall. I came on Election Day so it was probably a bit louder than usual but still a great environment for getting some work done.", "pics": null}}, {"review": {"des": "This is one of my favorite spots in the city. Great staff and warm environment. Good place to get some coffee and read a book, surf the web and/or chat with a friend. Although at certain times it is difficult to find seats because it is so popular. Most of the customers are friendly enough to share their tables, so don't be shy. They also have outdoor seating when it isn't freezing. <br><br>It is only a few blocks east from the Granville Redline. They have a small parking lot west of the building (one hour limit), street parking in front and neighborhood parking that isn't permit if you choose to drive. They have bike racks in front of the shop and around the corners for bikes. <br><br>Tip: If it is your first time, they have three doors, two of which are for emergency use only. Check the labels on the door to make sure it is the right one so you don't look like you're trying to arm wrestle the door. Enjoy!", "pics": null}}, {"review": {"des": "In my opinion, Metropolis coffee is horrible. It's incredibly bitter-- don't get me wrong, I love strong coffee but this coffee is so bad. The 2 stars comes from the great service and cute atmosphere in the actual shop. If the coffee was better, I would actually come back here. I'd suggest giving it a try if you like bitter coffee because the shop itself is worth a visit.", "pics": null}}, {"review": {"des": "wifi connection has been really poor for the last week. ordinarily, you get a stable connection. can management look into this? having to disconnect and reconnect several times is very frustrating.", "pics": null}}, {"review": {"des": "I took the family on a walk around Edgewater, and I knew I wanted to stop in here  for a snack before we headed home. While I was there, I figured I'd get some iced coffee too.<br><br>I can't tell you much about the Kyoto process, but I can say that it makes some fine iced coffee, one I'm very happy to drink black (okay, with a little bit of simple syrup). It's strong, definitely bold but not that bitter. <br><br>We also had a blueberry crumble bar and a piece of apple cherry pie. The bar, which is made in-house, crumbled nicely and wasn't overly sweet. The blueberries were fresh, and the texture was excellent.<br><br>The pie was even better, though I wish I knew which bakery it came from. The crust was flaky but sturdy all the way through, from the bottom of the crust out to the edges. There was an ample amount of fruit, and the pie topping reminded me of a great brown sugar crumble. I think a piece of pie runs $4.50... it's definitely worth it.<br><br>A coffee house like this deserves to be well trafficked. There's many nooks and crannies for people to sit, and it's nice and quiet on the inside. I wish I had one of these closer to home!", "pics": null}}, {"review": {"des": "I absolutely love their Mexican hot chocolate here!! So creamy and good. This place is a good place to bring your computer or read a book. Great atmosphere!", "pics": null}}, {"review": {"des": "Two stars.  Coffee is fresh roast but their gimmick seems to involve playing around with different varieties of beans and mixing light/dark roasts together to make some of their signature blends.  Not a huge fan of this sort of apostasy--having a coffee with both a loud citrus (underdone) and a scorched plywood flavor (well done) is just not palatable, IMO.<br><br>Facility is good sized and hipsterish in decor, replete with cafe tables, weird furniture and avant-garde artsy pictures on the walls.<br><br>The baristas seem aloof and forcibly nice, and act like they all belong to some exclusive coffee guild that only tolerates customers if they genuflect and pay proper homage to their skills. They appear to communicate with each other using eye rolls, smirks and odd looks, usually while you're ordering. Not sure of the exact dialect.<br><br>Despite having a cash tip jar on the counter they will SHAMELESSLY AUTO-TIP YOU on your bill if you use a CC to pay.  This tees me off, especially when I'm just buying a coffee and leaving the premises--what service am I needing to tip them for?  There is no real service involved.  And if you dare to check \"no tip\" on your receipt then they get kind of snotty with you--zero to bitch in 3 seconds.<br><br>The desserts are usually creative in nature and reasonably priced--I had a great slice of oatmeal pie there once.<br><br>Two stars.", "pics": null}}, {"review": {"des": "What happened? Coffee is horrible now. Much better 5 years ago. It is worse than a Starbucks.", "pics": null}}, {"review": {"des": "This coffee shop is quaint and has really good coffee. They offer a few pies and quiches that are also delicious. I ordered the green tea latte here and it was slightly foamy on the top with the smooth feel in the middle I like. <br><br>Added bonuses:<br>1. There's currently a deal on Groupon here. <br>2. If you buy coffee here often, they have a deal where the 8th (?) coffee or so is free. I've only seen others use this as I haven't done it myself.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/FbkvZbErcfjXFmG2ggKFew/348s.jpg", "caption": "Latte. Yum!"}]}}, {"review": {"des": "One of the best things about living in Edgewater is this coffeeshop. The staff is always friendly, the coffee always delicious, and it's an ideal spot to get writing or studying done. It can get a little crowded when Loyola is at key parts of the school year, but it's crowded for good reason. Also a great place to get coffee beans for home.", "pics": null}}, {"review": {"des": "Let me first say that I love this place and their coffee is amazing... but almost every time I go in I wait a significant amount of time for my drink to be made. I understand it's a laid back atmosphere, but there's no excuse for it to take 10 plus minutes to make an iced latte. I have, in the past, worked in a coffee shop for close to 4 years and I have some kind of understanding of how long it should take for beverages to be made. It's usually not even that busy when I go in and they have quite a few expresso machines but it seems like every time it takes too long for my drink to be made. It becomes very irritating and inconvenient when I have to be somewhere at a certain time. It also doesn't help to see the baristas there always chatting it up with their personal conversations. Show some urgency to get drinks out, once in a while.", "pics": null}}, {"review": {"des": "I should check in here, because since moving close to here not too long ago, I've already redeemed a free drink card (9 drinks, 10th free) and am well on my way to my next one! Everyone who knows me is aware of my allegiance to Intelligentsia in so many ways and for so many reasons... but I do love Metropolis too. <br><br>My favorite thing about this location... OUTLETS. EVERYWHERE. Most accessible in any cafe I've ever been to. There's plenty to go around, even if you sat away from the walls. There's also always a ton of seats in three rooms. People generally come here to work, it seems, so it's a great work environment all around (not too much conversation, a big enough space that it all becomes background noise, etc).<br><br>They always have a wide selection of single origin beans here with all sorts of flavor profiles, so it's easy to switch it up. The only brew methods offered are Kalita and Aeropress though... both not my favorite, but the coffee tastes pretty good generally. <br><br>My only complaint is that 90% of the time my coffee from the coffee bar takes FOREVER to come. It's not usually the barista's fault if there's like 5 orders for Aeropress lined up and limited equipment, but sometimes... it is, because some don't move very quickly. <br><br>If you're in a hurry, I suggest the express coffee of the day (sometimes not brewed as well as the fresh stuff), or an espresso drink (though my cortado wasn't great).<br><br>The food selection here is just alright... Overpriced quiches, pies, overly sweet pastries... Meh. Come for pretty good coffee and the work environment. There's also a small parking lot for customers (1hr max).", "pics": null}}, {"review": {"des": "Thank you Jennifer Greenburg and Melissa Sands for recommending this spot!<br>The cold brewed Kyoto style coffee is wonderful. Plenty of seating. We joined the coffee club.", "pics": null}}, {"review": {"des": "Love this coffee shop. Awesome coffee, great customer service and really chill and laid back ambiance.", "pics": null}}, {"review": {"des": "I hung out all day here and it was great for studying! Although it was hard to find a table in the morning, by the afternoon there were plenty of open seats. A bonus is that they have lots of outlets all over so it's a great place to study. <br><br>Their chai is so delicious too! A little pricey but definitely worth it on a cold day.", "pics": null}}, {"review": {"des": "I liked this shop, even before the expansion, because of the great coffee and the ample seating. After 7 years, I find myself struggling to continue to make it part of my regular routine, since exchanges with staff can definitely be enough to make you want to take your $6 coffee to go and forget you ever went in.<br><br>Pros:<br>Really great quality coffees and teas<br>Excellent variety and selection of beverages<br>Spacious and conveniently arranged seating<br><br>Cons: <br>Shockingly pushy and rude men at the front of the house (It's every Monday now and it's a real bummer.)<br>Pricey", "pics": null}}, {"review": {"des": "I love coming to Metropolis to work when I don't want to work from home. Their coffee is consistently great, especially the coldbrew, and the pastries from Dollop are a great addition.<br>I felt compelled to review them today because of an outstanding customer service experience. My order somehow got mixed up and it took about 15 minutes before I had my drink. I asked the barista about it and he gave me a coupon for a free drink and upsized my order for free! Can't recommend this place highly enough for laptop surfers and conversation seekers alike.", "pics": null}}]}