{"name": "michael-jordans-steak-house-chicago-2", "reviews": [{"review": {"des": "This review is for The Bar. <br><br>We popped in here for a light dinner and a drink following a first half light dinner over at Eataly. <br><br>I love Eataly but must admit I enjoyed our light meal here more. <br><br>We sat at a booth between the bar and hotel lobby. Our waitress was friendly. <br><br>We both ordered tap beers, then we ordered a Chopped Salad and a Crab Cake. <br><br>The crab cake was really good. Not as tasty as Hugo's Frog Bar but still really good. It was all large lump meat. <br><br>Even better than the crab cake was the chopped salad. It was really different than others I've had. It had some thick small bits of either bacon or pancetta. Really good.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/BVIorGdF7Y7L7HpXl5G87Q/168s.jpg", "caption": "Crab Cake - not quite as good as Hugo's Frog Bar but still very good."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/kEySTafJgJhzlFZfjZTa5Q/168s.jpg", "caption": "Chopped Salad - wow, this was amazing."}]}}, {"review": {"des": "The steakhouse is located inside one of the nicer hotels in the area and is easy to find if you're downtown Chicago<br><br>We had an excellent wait staff that was very attentive all night long and made sure to offer suggestions for a party of five and to make sure that our beverages were always topped off<br><br>We chose three of their more popular steaks for our party of five along with several appetizers and sides in this worked well for both the large and small appetites and our group<br><br>This also allowed us to sample each of the different cuts of steak so something I would recommend<br><br>I really like the steakhouse and would not hesitate to recommend it or go back again", "pics": null}}, {"review": {"des": "Came here for my birthday dinner 2 weeks ago and had the best time celebrating it thanks to the great servers. Me and my dinner partner (who flew in from Kansas City just for me!) ordered a good amount of food that was all well prepared and delicious.<br><br>We split the Blue cheese fondue with toast and even ordered another serving of it because the flavor was divine. It reminded me of that fact that I don't eat enough blue cheese..!<br><br>We also ordered the extremely flavorful sautéed mushrooms. I would highly recommend this for your table. The oysters we got were ok but there was one that I had that was terrible and nearly ruined the night when I realized it had gone bad. Thankfully my filet mignon came out shortly after that and the night was saved. <br><br>My filet mignon was perfectly done thanks to the expert grilling and thyme butter that was served with it. And it was a great portion size considering I had been eating for 20 minutes before I even got it.<br><br>Our server brought out a slice of MJ's chocolate cake for me and I loved it! It was exactly what I wanted and if you know me, you know that the best way to make me happy, especially on my birthday, is to get me a slice of the chocolate cake from one of my favorite steakhouses in the world.<br><br>Definitely looking forward to visiting again soon!", "pics": null}}, {"review": {"des": "What a fun and unexpected surprise in Chicago! We had to eat here because my husband loved loved loved Michael Jordan. Jordan is the reason he even watches pro basketball. Anyway, we stopped in for a simple dinner at the bar. Our burger and fries were delicious! It was also really fun to look at all the Jordan memorabilia throughout the space, including the faux championship trophies at the staircase. <br><br>I have a feeling I'll be back here for a meal in the main dining room if my husband has any say in the matter. But the food here is good so I won't mind!", "pics": null}}, {"review": {"des": "I am usually hesitant to try restaurants of famous people as they are usually more hype than anything else. Boy was I surprised with this place. Nice ambiance, not too long of a wait for a walk in party of 4. Tried the colossal crab, absolutely delicious!!! All lump crab meat lightly seared on the top no breading....the best kind. The garlic bread was soooooooo good, I think I ate like 4 pieces -_- but i couldn't stop. I would definitely stop back in and eat here whenever I'm in Chi Town!!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/2yY-snI7oYOck7OH4HlH3A/348s.jpg", "caption": "Colossal crab cake"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Gf5D7G95gcy9IoiH9evuNw/168s.jpg", "caption": "Garlic bread"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/OfaEmhMhiWCy-Vs6ExQjJA/168s.jpg", "caption": "Return of the ploach"}]}}, {"review": {"des": "I came here because it was my sons 10th birthday and he's named after Michael Jordan. I called ahead of time and made the reservation. When we finally arrived we were greeted with open arms and the hostess even gave me and my son a tour of upstairs. She took pictures and made us feel so comfortable and at home. SHE WAS THE BEST!!<br><br>The food is AMAZING!! The garlic bread with blue cheese fondue is straight from Heaven!! I've never had anything like it in my life and I was tempted to pay for another order to go. I ordered the 6oz Filet Mignon (medium well) with the mashed potatoes. The Filet Mignon was one of the best steaks I have ever tasted. With and without the A1 sauce. The mashed potatoes were different, but they were good. <br><br>Our waiter was superb. I ordered the layered chocolate cake and it was so moist and chocolatey. Yes...chocolatey, I made that word up, lol. Then the waiter came out with a ball and card for my son. I thought that was the sweetest thing for the restaurant to do as a whole. We are def coming back!!", "pics": null}}, {"review": {"des": "Very seldom do I care to eat at a celebrity owned and franchised restaurant.  But...I was pleasantly surprised tonight.  Eating one of the best steaks I have ever tasted.....like EVER.. ...at Michael Jordan's Steakhouse! And Chicago has some amazing food choices. Damn...it's shockingly delicious! And the Garlic bread is the best I have ever had!  Just ate that wonderful meal, garlic bread did not disappoint and I thank the Yelper Community for putting me on to this. Steak Frites were outstanding! I'm going to pass out now! Thanks....I'll be back again once I come out of this coma.", "pics": null}}, {"review": {"des": "Came here with a visiting family for an early dinner on Wednesday. The place was rather empty, but the front desk kept encouraging us to go to the bar at first, presumably because we were casually dressed Asians who didn't strike as appropriate materials for a formal steak dinner. Definitely didn't appreciate that part, though prejudice at steakhouses is sadly no news for me. I'm still mildly offended by the stone-faced lady at the front desk who coldly took us to a table when we turned down her magnanimous offer on a bar seat and asked for a table. <br><br>The food itself was pretty good. Our waiter was jovial and awesome. We shared garlic bread (definitely get this, so good), crab cake, and salads. As for steaks, we had boneless fillet mignons and a NY ribeye. All top notch, what you would expect from an expensive steakhouse. <br><br>Despite the good food/service, I can't not take into account the subtle discrimination based on race and appearance that I feel I experienced. It's not just this place, but a general problem in fancy Western restaurants, I'm afraid. Maybe I was wrong after all, and would be thrilled to know I was. But for now, 3 stars.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/NuC-NTzND32tGzdYSs16Mw/348s.jpg", "caption": "fillet mignon"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Ih-wzP-dZewSwjS0HORjcA/168s.jpg", "caption": "ribeye"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/9sxL7kdylfnas0b6xg4QtQ/168s.jpg", "caption": "crab cake"}]}}, {"review": {"des": "I'm sure Michael Jordan's Steak House could stand on its on in most areas in downtown Chicago or in any big city for that matter but being connected to the InterContinental Hotel I'm sure has its advantages, I know for us it became the go to restaurant by default simply because of its convenience since we were staying at the hotel. After spending most of the day walking around McCormick Center at a trade show this restaurant was as welcoming as any place we could have chosen in downtown Chicago. The causal dining in the restaurant's bar provide us with a no wait dining experience which was exactly what we were looking for without having to sacrifice quality, although this city is filled with some of the best restaurants on the planet getting seated at a reasonable hour is not always easy especially with as many events this city seems to host. I'm sure the locals have their secret locations, but for those of us just popping in for a visit I'm all about playing it safe so I usually try and choose this caliber of restaurant and I don't ever remember having a bad meal in this town in all the times over the years I've visited Chicago.<br><br>We found a high top just a few feet from the bar and our server who seemed really busy from the time we arrived until we finished dinner service made sure we were well taken care of - she wasn't overly attentive but she instinctively appeared at exactly the right times whether to refresh our drinks or just to ensure we had everything we needed. The cocktails were very good but they are definitely not giving anything away here, the pours are measured and accurate and the prices are definitely top shelf. After looking over the menu I decided on the bone-in filet cooked medium rare and requested that the chef default to the rare side, it would be a tragedy to over cook such a choice piece of beef and once it arrived there was no doubt the person doing the steaks is no amateur this steak was amazing and still sizzling when it arrived making it impossible to take a second look at the prices after the first bite it seemed like a bargain. I paired this will a chopped salad and hand cut fries, the salad was so good it's a must order if you're a salad person the fries well they are irresistible and plentiful definitely made for sharing. Over-all a great experience that I hope to repeat, like I mentioned earlier we walked in from the lobby out of convenience but going forward this will be a destination...", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/I9zJ7mTx-Rar4pMPcs-fXA/348s.jpg", "caption": "16 oz  Bone-in Filet Mignon"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/KQdjkQ8Whw81ZMAXdIqYcQ/168s.jpg", "caption": "MJ's Chopped Salad"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/oWabtsNQhH9_83FJ4iCBhw/168s.jpg", "caption": "Beef Fat Fries"}]}}, {"review": {"des": "This is for a bar review only. <br><br>We ate in the bar and the service was so-so. Our waitress was quit slow and inattentive but the food was delicious. <br><br>We ordered a specialty steak on the menu, our waitress came back to let us know that they didn't have any left. Then we proceeded to order a different steak, our waitress came back to let us know they didn't have any left. Third times a charm..", "pics": null}}, {"review": {"des": "We were staying at the Intercontinental for a conference so when a vendor offered to take us to lunch MJ's steakhouse was a logical choice.   <br><br>When you think of Chicago steakhouses of course Gibson's comes to mind but I will say I was actually impressed by MJ's since I really did not expect too much from a restaurant in the hotel.<br><br>First off, I am glad that a vendor took us to lunch as it was not cheap. But having said that the food was freaking amazing.  We started off with Nueske's double smoked bacon and all I will say is OMFG.  These are some thick ass delicious slices with an amazing sweet glaze covering the savory meaty goodness.  <br><br>Of course coming to a steakhouse I am not ordering a salad and i will say that MJ's Prime Delmonico lives up to its billing.  It is a large 16 oz cut which is dry aged for 45 days.  I had it with an amazing side of creamed spinach and I powered through the entire 16 ounces as it was so delicious.  <br><br>The venue itself is pretty nice and although it is MJ's place memorabilia is not really in your face everywhere.  The 6 NBA trophies at the entrance is a nice touch.  Service was top notch as well.<br><br>Overall this place is awesome, especially if someone else is paying as it wasn't cheap.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/pez2oO4__jTBN7xNO6dvyA/348s.jpg", "caption": "Mj 's Prime Delmonico 16 Oz"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ucjVF-BwahyXffpxMVVMdA/168s.jpg", "caption": "Nueske 's Double Smoked Bacon"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/CMCZ1RZZmQO6Hn2oeh0Yxw/168s.jpg", "caption": "6 trophies at the entrance"}]}}, {"review": {"des": "Absolutely loved MJs. Not only is it perfectly decorated for a Michael Jordan Fab but the food was fantastic. The bacon appetizer is a must get. The macaroni & cheese was okay but the bone in ribeye was the best I've ever had. The cyst was excellent, the meat quality was first taste rate and the seasoning was perfect.", "pics": null}}, {"review": {"des": "The steak was SIMPLY DELICIOUS. Melt in your mouth kind of steak. My husband out ordered me (yet again) by ordering the 6oz Filet with mashed potatoes while I ordered the Steak Frites (go for the Filet) that comes with well seasoned French fries.<br><br>The only reason why I'm giving 4 stars is that the 23 layer cake was not as flavorful as I was expecting - unfortunately. <br><br>We had a great experience and we'd go back and just order a different dessert.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/b8PiQKiumZVISkL9ZSBIGQ/348s.jpg", "caption": "Looks better than it tastes - go for another dessert"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/zbwFT2cgZr_Z8bCz3x4Z4g/168s.jpg", "caption": "MUST HAVE - DELICIOUS Filet Filet Mignon 6 Oz - Medium - Melt in your mouth steak"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/jpIBAacWv7vrPQkZHP3Zmw/168s.jpg", "caption": "Steak Frites - great French fries, good meat"}]}}, {"review": {"des": "Restaurant Update<br>I came late into town on a Friday night for a medical conference and I was shocked to find all the restaurants were super busy even at 8 pm. Luckily I wandered over to my favorite steak house in Chicago and grabbed a seat at the bar. I ended up getting the shrimp cocktail appetizer which had large prawns on a microgreen but a bit on the smaller side. The filet mignon 10 oz on and green bean sides was the highlight of the meal. The filet is served on top of bay leaf butter which was cooked to perfection. It was beyond tender and required no effort to cut. The meat was prime quality and I have yet to find another steakhouse that can match this perfection. My service was so so, the bar tender did not seem like she was in a happy mood, but the great food kept me company!", "pics": null}}, {"review": {"des": "We had reservations for dinner and were able to sit down on time. This is a fine dining restaurant, so you should dress up when coming in. Luckily when we came in, it was during restaurant week and we saved a little bit of money. We received excellent service and the food was excellent. For appetizers we ordered the Garlic Bread and the Bacon. For dinner we ordered the ribeye. For dessert we ordered the Mixed Berry Cheesecake. Would come eat here again.<br><br>Appetizers: The Garlic Bread were thick slices of bread with melted garlic cheese. The bread was laid on top of a fondue cheese sauce, which was really tasty. Double Smoked Bacon speaks for itself. It had a nice sweet and smokey flavor to it.<br><br>Steak: Got the option to upgrade the ribeye to a delmonico. This was cooked to a perfect medium-rare. It was super tender and I barely had to chew it with how tender it was.<br><br>Dessert: The cheesecake was good. It had the perfect amount of sweetness without being too sweat. I ate every crumb off of the plate.", "pics": null}}, {"review": {"des": "I have enjoyed everything I've had. I ordered scallops, corn off the cob, and asparagus as the entree. Perfectly cooked everytime. <br><br>Service was great also. <br><br>I wish the cheesecake wasn't deconstructed. I had to chase the crumbs around my plate to eat it. Not cool. <br><br>Ive also has the 23 layer chocolate cake. It was delicious and very rich.", "pics": null}}, {"review": {"des": "Michael Jordan steakhouse is amazing ! My steak was TO DIE FOR ! They have this bleu cheese fondue garlic bread (it's really good) . We also ordered the shrimp dejong... it was extremely salty BUT more than likely just underestimated how much salt was added . Would definitely go back . The duck fat fries were okay , nothing to write home about . Asparagus was really good , very nicely seasoned . Order the ribeye", "pics": null}}, {"review": {"des": "Beautiful establishment, spectacular service, and amazing food.<br><br>Ordered: <br>- Crap cake is typically my go-to appetizer and this place offers a unique take on it --  unlike anywhere I've ever been. It's a generous stack of pure crab with not a lot of fuss. <br>- Burrata cheese salad -- no complaints <br>-24ounce bone in T-bone steak perfectly made (see attached video)<br>- The trio of mash potatoes, loved the assortment.<br>- Mac and cheese, standard. <br>- Mushrooms: generous portion with tons of flavor. <br>- Crème brûlée (butterscotch), my fav. Loved  it.<br><br>Will definitely be back.", "pics": null}}, {"review": {"des": "Great steakhouse. I got the 10 ounce filet which was cooked perfectly and very good quality meat. The 2 sides we got were the potato trio and the creamed spinach. The potato trio is served separately and all the various potatoes are good, although the crab was honestly my least favorite. The creamed spinach was very good. I also got the 23 layer cake which was good but not overly impressive. It is huge so I would recommend splitting it. Overall, I really like the place although it has a hard time holding up to the steakhouse competition in downtown Chicago. Anywhere else it would be a 5 start steakhouse.", "pics": null}}, {"review": {"des": "When I was told our group was coming here I thought maybe it would be a bit of a tourist trap but I was pleasantly surprised. <br>It is definitely an upscale steakhouse and it has an intimate vibe to it. <br>The prices were pretty steep so come with that in mind. I ordered the NY strip and it was perfectly cooked to my requested medium rare. The chimmichurri and potato on top complimented the steak wonderfully. The only hiccup was one of friends received a room temp, bordering on cold, steak. But when he told the waiter they were amazingly accommodating! They insured him they would bring a new steak, not that one reheated, a small shrimp dish to eat while he waited, and another mac and cheese side as a courtesy. The manager came over and apologized and came by a couple of time to check in after that as well. We were very impressed with the level of service they provided. <br><br>I do recommend coming here for a nice dinner whether it be a date or for a group. It was a great end to our trip", "pics": null}}, {"review": {"des": "This place is tried and true. I normally come here to chill and grab a drink at the bar or if there's a game on (and that's your thing) , this is the place go.<br><br>The bartenders are super friendly, food and drinks are good. There's something on the menu for everyone and they have the biggest chocolate cake I've ever seen! I watched in amazement as this couple attempted to eat it all. There was no way! Lol<br><br>If you're up for being social, this is also a good place to network as most people who converge here are in or out-of-state professionals.<br><br>Definitely recommend for drinks, grabbing  a bite at the bar, dinner, dessert and networking.", "pics": null}}, {"review": {"des": "Wow, such service!! <br><br>It's the little things that matter.. <br>My water couldn't fall below half before they were refilling it right away. They wiped our table clean in between meals (appetizers, entrees, desserts). They gave menu suggestions and checked on us consistently. <br><br>The food was amazing! (great portion sizing too) I ordered the Salmon and Risotto - so tender, juicy and crisp. I loved every bite. My boyfriend ordered the MJ steak and newly brewed MJ beer - He ate the entire meal without any complaints! <br><br>You've got to try the garlic bread! I normally don't love Bleu Cheese but I think its the fact that it comes in a fondue style is what made it basically melt in my mouth. <br><br>Definitely will be back!", "pics": null}}, {"review": {"des": "This is a solid and respectable steak house. It is the restaurant off the lobby of the Hotel Intercontinental. The bar burger is delicious and you have many choices of cheese. They let me swap out fries with mashed potatoes, and that was a great decision! The mashed potatoes had a little bit of brown butter drizzled over the top. Yum!<br><br>My table has had the Delmonico, salmon, chopped salad and almost all the sides at one point or another. No complaints on any of them. <br><br>The 23 layer chocolate cake is a show stopper and you will probably take most of it home. As it makes a fine breakfast!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/AJUD1XS5KDURk4KO5-LPqQ/348s.jpg", "caption": "The bar burger. I swapped out the fries for mashed potatoes. Excellent decision!"}]}}, {"review": {"des": "This place is awesome!  I usually don't like hotel restaurants, but this is not just any hotel restaurant! THIS is MJ's restaurant and it ranks right up there like he does!  Food was delicious and service was just as good!  Great spot!", "pics": null}}, {"review": {"des": "For the last night in Chicago we made reservations at MJ's steakhouse. Let me start with the service: we were seated quickly, the decor was very classy and had on the stairwell leading to the second floor all of Jordan's 6 championship trophy's. From there you walk over a nice glass bridge into the dinning area. Great decor. <br><br>The menu had a variety of appetizers, side dishes and cuts of beef. First course, we had the crab cake and it was excellent. Jumbo crab meat, not over seasoned. For the entrees, I had the 24oz bone in ribeye steak and it was delicious. I'm a big time steak eater. My wife had the New York strip at 14 oz and was happy with her choice. We then shared to sides which were bacon mac and cheese which was recommended by the server. It was delicious and not over powering with cheese, hint of bacon was also a great addition and the crust on top was nice. The green beans were cooked well in a light butter sauce.  <br><br>For a nice dinner in the downtown Chicago area, try MJ's steak house. You can even eat at MJ's table number \"23\".", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/nCmvld6_xUmbX43gjTsvOQ/168s.jpg", "caption": "Bone - in Ribeye 24oz"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/v4rWf7cKU9-OYtPEOhm-xQ/168s.jpg", "caption": "New York Strip 14 oz"}]}}, {"review": {"des": "Wow. Expensive but worth it. We came here for my birthday & it was worth every penny. We both has the filet mignon and it was the best filet both of us ever had. We both had it cooked medium. We ordered broccoli a-la-carte (veggies are included w/the steak) and it was quite tasty as well. The wine we had was pretty good too as well as the atmosphere. The only issue is that after we ordered & received our food, the service seemed to deteriorate and she didn't return to our table very much after. We needed refills on my soda & her wine but since she (waitress) took so long we ended up skipping the second glass of wine. Waitress was nice enough to take our picture for my birthday and bring me out a birthday desert with a fascmile autograph of MJ on a birthday card.", "pics": null}}, {"review": {"des": "Best experience ever! Definitely coming back soon, the food was delicious & did not take super long to come out . My boyfriend & I went to celebrate our anniversary & they provided champagne on the house which was nice! Our server Nick was awesome!!! Deff will ask for him next time we go back in. The steak was big & cooked perfectly to my liking! Loved it! <br>**ps there is dress code! Business casual", "pics": null}}, {"review": {"des": "Outstanding service! Jason was a wonderful host last night. The prices were high but the value was well worth it. Our bill was around $150 for one glass of wine, two steak dinners, two sides, and one dessert. You have to order the sides separately from the entrees, just a heads up. <br><br>This place changes the menu every few weeks but Jason knew the choices front and back. He even sold us on some blue cheese bread that we normally wouldn't have gotten, and it was delish. I asked Jason for a great sweet red wine, and he didn't disappoint. <br><br>Our server also doubled as a hot spot enthusiast. He directed us to a bunch of great spots and even wrote some out on the back of our receipt for us. We are only in town for a few days, so that was perfect. Ask for Jason! He is excellent!<br><br>The atmosphere was fantastic and the food was wonderful. Best steak I have ever had. The chef even went out of his way to make a signature steak sauce for me after Jason explained that I'm a serious A1 lover. <br><br>The building is attached to the intercontinental hotel and is super classy. It's a sight to see for sure.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/JejtUIyGjWa2wBEYZmpMpA/348s.jpg", "caption": "The upstairs dining area"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/7a9joqKGgyETYLg3FMzoJw/168s.jpg", "caption": "Apple dessert"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/XAGeLy0sOxvzPzNhdyGTIg/168s.jpg", "caption": "Petite filet with crab and asparagus"}]}}, {"review": {"des": "We had a wonderful experience here. The atmosphere is neat with it showing off some old architectural ambience. My wife and I went with a steak flight which was the right choice for us. It included 3 different premium cuts of Steak along with 3 different wines to compliment. There was also sauces, salts and items to mix up your pallet. Our waiter was great and informative of all things steak. Being honest I expected a bland meal with a bunch of Jordan gear. The Jordan related items I saw were more artistic and very classy.", "pics": null}}, {"review": {"des": "Fantastic steak house.<br>I had a 10oz mignon, medium. The side was spinach. The steak was very smooth. This dish was the perfect definition for medium cooked steak. The outside was not burnt, but well-done. When I pressed the steak with my fork gently, it bounced back which means the inside was soft and medium cooked. Not surprising, when I cut it, the inside had a beautiful pink color and no extra blood were leaked out. <br>The side was spinach with cheese. It's very delicates the spinach were soaked in cheese and the top was sprinkled with fried crispy cheese.<br>Although the service was kind of dull, as long as it's not horrible, this place worths 5* rate.", "pics": null}}, {"review": {"des": "The service is exceptional even when every table is sat. We had everything we requested attended to in moments. The sides are amazing and shareable. The Mac and Cheese is the superstar as are the blue cheese bread sticks. My strip was cooked to medium with perfection, there was just a little too much fat than I'm use to on a strip. And before you start, I'm from Kansas City originally so I know my way around a good steak. Prices are a little higher due to the novelty of the restaurant so be prepared for that. Also it was my bday and they brought me the Apple tart dessert, it was delicious!", "pics": null}}, {"review": {"des": "If you're like me, before arriving to Chicago, you have a ton of bookmarked spots. This was one of mine. One of my Yelp friends posted about this place and my husband is a MJ fan, so I found it intriguing. We hadn't planned on stopping for lunch here, but my husband spotted it as we were walking downtown and wanted to stop in. <br><br>My first impression, I was surprised to find that it was a hotel restaurant. It has a separate entrance, but also one attached to the hotel. We were here on a Friday at lunch and were seated right away. <br><br>We both ordered burgers, two different versions. I ordered the Steak House Burger well done. It was cooked perfectly and super cheesy! My husband ordered an upgraded Wagyu burger for $3 more than my burger. The only recognizable upgrade on it was only the special sauce. We were both pleasantly surprised to find that the burgers are served with fries... which the menu didn't list. The fries were excellent too. Perfectly tossed in a salty herb mixture. No complaints about the food at all. It was one of the best and filling burgers I've ever had. <br><br>Cons: <br>I started with a Long Island Iced Tea. I must say, it was pretty small and weak for the $14 price tag. Another con to our experience was the service. Our waiter was a bit off. He brought us out the someone else's burgers. He sat them in front of us, walked away and I literally took a picture and everything and he came back over and took them away. Yeah, after it sat in front of me long enough for me to hover over it and take a picture. I watched him serve them to the correct patrons. For some reason, I felt bad afterwards, like I violated someone else's food. It wasn't my fault, ok?! ;) When I ordered, I asked for a side of ranch. It never arrived, so I asked again when my husband requested ketchup. Low and behold, I again don't get ranch. I asked for the third time (nicely, I promise). He snapped at me and said \"I didn't hear you ask for it\". Well, I didn't even mention that I'd asked two times before. Not cool. Thank goodness the food was good.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/8jEfqKJPWXN6h1R8Fhe16A/348s.jpg", "caption": "Lunch menu as of 4/13/18"}]}}, {"review": {"des": "Michael Jordan's steakhouse is probably too popular to be considered a hidden gem along the Magnificent Mile. However, the meal and service rank up there with the other fine steakhouse in the city.  I expected to be overwhelmed with touristy tributes to Michael, but that isn't the case. <br><br>Yes, there reminders of the GOAT are present, but the food and service are the true stars at this Establishment.<br><br>We had the bacon appetizer and NY strip. My son referred to this as the \"best meal ever.\"", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/3WI6d3TzcZZhPm5QBDYyfQ/348s.jpg", "caption": "You can't leave without the 23 Later cake for dessert."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/d73GfpQ8TVlyipPVTULguw/168s.jpg", "caption": "Perfectly cooked NY strip"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/5G_JN3HK6A9oqNu35fE2ng/168s.jpg", "caption": "Mac and cheese"}]}}, {"review": {"des": "Very nice steakhouse on Michigan Avenue. If I had to summarize it in a sentence: the food was 3.5 stars and the service (Jason) was 5 stars. I rounded up my 3.5 stars to 4 solely because of the on-point service. The ambiance is very nice...chill I would describe it as. Nice and quiet, no TVs blaring on the walls, somewhat romantic place to go, lots of room between the tables, and attached to the Intercontinental Hotel. <br><br>We started out with the blue cheese fondue garlic bread (5 stars and the hit of the night...nice and crispy and the blue cheese was a wonderful addition). For our dinners, two had the steak frites (4 stars for the wonderful meat...perfectly done and a nice portion), the last at our table had the bone-in ribeye (also 4 stars as this place lives up to its reputation as a steakhouse...when you order it medium, they know what that means). For sides we shared the creamed spinach (3 stars ok...the cheese sort of solidifies on top, but all in all pretty good) and the duck fried rice (2 stars weird...it was odd tasting a nice piece of steak and then feeling like you just dropped into a Chinese restaurant)...didn't like the duck fried rice addition. Additions by the way were fair sized...you could split them between two diners. <br><br>As a suggestion...they should add a nice baked potato - in fact, I was surprised they didn't have a selection. This is the Midwest and we do like our steak and potatoes. While they offer a nice three spot of mashed...sometimes you just have to have a loaded baked potato. <br><br>For dessert we finished with the trio of ice cream tastes (4 stars...very nice and creamy) and the 23 layer chocolate cake (3 stars ok...more show than go). All in all this is a nice restaurant...and one worth trying. They don't charge atmospheric prices like some others, but do serve everything a la carte.", "pics": null}}, {"review": {"des": "This may be my favorite steakhouse by far and I don't eat steak! I'm a chicken and fish girl! We were early for our reservation and decided to have a few drinks at the bar, both drinks and service at the bar were GREAT! We were seated upstairs by a window with a view of the famous Michigan Ave! Jason was our waiter and I must say one of the BEST EVER!! He guided us thru the <br>menu and had GREAT suggestions. He basically order my dinner/desert and I LOVED every second of it!! I can't wait to come back! Honestly, one of the BEST dinning  experiences I've ever had! Both food and service out of this world!!", "pics": null}}, {"review": {"des": "Have not been in prior so am excited to be close hotel and easy walk to here. Busy saturday evening. Sitting upstairs dining area. Pelligrino to begin. A Malbec house glass red coming. Am doing a rare bone in filet and asparagus. Haven't had this type filet. And a lemon meringue pie coming. Dinner was really good and deserves another visit soon. Actually will be back same area in 2 days. And plan to return here with passenger friends for further testing!!", "pics": null}}, {"review": {"des": "There was no wait when we arrived and were promptly seated.  Our waitress was very knowledgeable in the different steaks and side dishes.  We had a double fried maple glaced bacon; it was to die for!  We also had garlic bread blue cheese fondue, which was excellent.  We also had the mushrooms and the Mac and cheese as side dishes, those were really good.  The main steak was a 55 day dry aged rib-eye which was cooked to perfection as requested \"medium rare\".", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/C_DI_9u5Nqq1lJ9bs9nqyw/348s.jpg", "caption": "Mushrooms and Mac & Cheese side dishes"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/fH9Xa52QY2SS_oQZMkqTag/168s.jpg", "caption": "Delmonico steak medium rare"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/wWDFLFJ1cwvvVhOOZ-MQug/168s.jpg", "caption": "Double fried maple glaced bacon"}]}}, {"review": {"des": "Everything was done to perfection.  Started with the Bleu cheese garlic bread.  So tangy the cheese with the sweetness of garlic,  then the signature Delmonico steak with cheese crust done to perfection (rare) accompanied by the off the cob corn. Finished with the decadent tall tall chocolate cake.  ( only had 1/4 and took the rest back.  The service was great, Sarah my server was attentive and wonderful.  The entire service team worked together in perfect timing.  Definitely need to return to Chicago.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/RHfjv8nvtPzN1KC4HZePdg/348s.jpg", "caption": "Tall tall chocolate cake"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/4GxBYxGVKfz-GLVAL7Gi1w/168s.jpg", "caption": "Signature Delmonico steak"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/mCDm74nlC68zi7CnUvMmqw/168s.jpg", "caption": "Off the cob corn"}]}}, {"review": {"des": "While in town on business, I stopped in here for several meals, late dinner (3-19-2018) and lunch (3-20-2918).  For dinner I had a Caesar salad, iced tea and a Bar Burger with fries.  For lunch I had a chicken Caesar salad and iced tea.  Overall, both meals were good.  The salads were HUGE.  Good flavor.  Fresh ingredients and lightly dressed.  The burger was good too.  Lettuce, tomato, cheddar cheese and \"secret sauce.\"  Nice and juicy burger.  BIG!  The French fries were hot and seasoned, but kind of stubby.  The catsup made them even better.  The tea was good.  Fresh and good flavor.  My server for dinner was J. Cherry who was amazing.  Very friendly and helpful.  My server for lunch was Caesar and he was amazing!!  Very attentive without being intrusive.  I can see myself coming back again.  Keep up the great service and quality food.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ZXp1E_EI_kk_994LFitZyQ/348s.jpg", "caption": "Tea and water,  Refilled multiple times."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ZS6LGhWAHxq6QZuwh2OPqg/168s.jpg", "caption": "The salad.  That's a lot of chicken too!!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/swVulL4Apc1KfeP6hvRBfA/168s.jpg", "caption": "More of our view."}]}}, {"review": {"des": "Two stars due to expectations not being met. When you pay good money for food you expect a certain level of ambiance, service and food standards. Although the service for us was well the way they dealt with a large party directly behind us was awful. No organization, a lot of noise, and annoying distraction. Additionally, one of our sides came out wrong. They didn't tell us until later that they ran out of the certain side and then they forgot to pack my side (which I was looking forward to eating later). Disappointed overall.", "pics": null}}, {"review": {"des": "Well worth going to if you're visiting the city or splurging. It's a little on the pricey end, but you pay for what you get. I got the NY Strip, my wife got a few veggie sides, our friends got the salmon and Streak and frites, and we shared a bacon mac and cheese. The streaks were very tasty with perfect crusts, the veggies were well seasoned and very flavorful, the mac and cheese was very creamy and delicious, and the salmon (i was told) very good. Thanks MJ for a great steak house! Pat yourself on the back haha", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/2jlRlFuGbuueHugyjVtAow/168s.jpg", "caption": "Bacon Macaroni & Cheese"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/7PgmEMm__1PgbM9Tt1-yvg/168s.jpg", "caption": "NY Slagel Farms NY Strip 12 oz"}]}}, {"review": {"des": "This was my 3rd visit to Chicago but my first visit to MJ's Steakhouse. I ordered the bone in rib eye with side of broccoli and it was so delicious. The steak was tender and juicy and it was a huge portion! One of the best steaks I have had! This is a must visit if you don't mind spending the money as it was very expensive. I would definitely come back the next time I come to town. I also ordered the Action Point signature drink with MJ's symbol!", "pics": null}}, {"review": {"des": "Surprisingly very good! I honestly wasn't expecting great food and the classy elegant atmosphere achieved by a restaurant on magnificent mile, but  think it's up to par with any other high end chop house. <br><br>We went here for my boyfriend's 23rd bday (appropriate cuz Michael Jordan). The hostess greeted us and led us up a beautiful staircase and then over a modern red-lit bridge where all the tables were. What an entrance! <br><br>We got two overpriced glasses of wine and sparkling water as well as the famous garlic bread to start. The garlic bread is a MUST! They pour a mild blue cheese fondue over it which pairs wonderfully with the garlicky and crispy bread. <br><br>I ordered the filet mignon and it was cooked perfectly. Juicy, tender, and just the right amount of butter. Lovely presentation as well. We ended dinner with the Nutella creme brulee which came with carmelized banana. Oh yes, I'm getting hungry just thinking about this amazing meal.<br><br>Everything here was so excellent and I'm glad we gave it a chance. Well done, Michael Jordan and staff.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Mm0XP9NWXQ2qbF1ulhR8fA/168s.jpg", "caption": "Best garlic bread"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/z2mJG-fi2Y4SS7ACxIHlow/168s.jpg", "caption": "Filet mignon"}]}}, {"review": {"des": "From the service to the every part of the meal was Outstanding and on point. I had the small bone in Ribeye it was the special and my husband had the MJ's Delmonico. The meat melted in your mouth and it was cooked to perfection! I would recommend and would return. Our servicer was very attentive and did a special desert for our anniversary. Oh and the garlic bread blue cheese sauce is a must as an appetizer.", "pics": null}}, {"review": {"des": "We had a wonderful experience at MJ's steakhouse and would highly recommend it! My boyfriend and I made reservations a few days before, and even moved it up with no problem. We're both basketball and MJ fans, so it was like going to a classy Jordan museum with great food and service.<br><br>Location/ Atmosphere:<br><br>We were told there isn't as much memorabilia as his other resturant's, but what we saw was more than enough, and it was a beautiful atmosphere. It's connected to the Intercontinental hotel, and easy to find right off Michigan Street. We walked there from the Marriott, and it was less than a 5 minute walk if you're coming from the back side of the hotel on Michigan Street. Walking up the stairs to the dining are and over the glass bridge (Which was a scene in HBO's Empire) set the smooth tone. On the other side of the bridge you'll see knives in cases that belong to the Jordan family and friends. They actually use these knives when the come the resturant! I loved taking picture of he quotes on the wall and on the trophy's! <br><br>Food:<br>-Order the \"Dream Team\" which is not on the menu! It's half orders of the garlic bread, crab cake and bacon! I wanted to try them all, and in this case, Rod and I finished the whole plate of three items between the two of us.<br>-The garlic bread has a blue cheese fondue, and while I'm not a big fan of blue cheese, this was delicious and I could eat it with anything! We asked the sauce on the side, which was good so the Brad didn't get too soggy. <br>-The crab cake was all crab! It didn't skimp on the meat and had a nice thin layer of breadcrumbs on top. It's really worth it!<br>-The bacon had a delicious sweet touch and reminded us of honey baked ham, but better! <br>-Rod had the petite filet, which was small, but very filling due to the crab topping. He doesn't like his steak too bloody, so he ordered it medium, which came out perfectly. It was Pink on the inside with a touch of Red. <br>-He also got the corn which was a little too spicy for me (I'm really sensitive to spice). While it was flavorful, it was okay. Maybe next time we'd try something else like the potato trio. <br>-I got the scallops with the butternut squash and it was great! It was filling for me and I couldn't finish the last scallop. The scallops were cooked perfectly and sides were a great addition.<br>-23 layer cake was awesome! I like the rides of MJ and 23, and love chocolate, so it was a perfect ending. It was a normal chocolate cake, but I love how the presented it and cut it for us. We had enough to take home. <br><br>Service: <br>-Our server John was very attentive, personable, reliable and friendly. <br>-The server assistant and host was great with checking in with us, refilling water and clearing our dishes.<br>-There's two sides of the resturant, and it wasn't too busy. <br><br>Overall, great experience for MJ and basketball lovers! Food was great!", "pics": null}}, {"review": {"des": "Stopped in the bar for a quick bite and drinks, this was the perfect spot. Nice intimate crowd with dimmed lights. I only wish there was light music playing. Tried the crab cakes and garlic beard with a tequila sunrise. All were delicious. The crab cake comes as one, but it's full of lump crab meat. The garlic bread with topped with a heavenly sauce that I really wish I could remember. & the tequila sunrise had the perfect blend of flavors. My friend insisted we need bacon, so we had bacon. It was very thickly sliced and so savory. I'll definitely be back for dinner.", "pics": null}}, {"review": {"des": "Very nice restaurant service e was fast and friendly. The steak was made to perfection. We ordered the mashed potatoes which can cooked three ways. Al in all we had a great experience thanks Michael Jordan and Chicago for having us.", "pics": null}}, {"review": {"des": "For our 3rd wedding anniversary, we visited Chicago and made reservations with MJ Restaurant. <br><br>Nice ambiance and pretty upscale. To start with, we ordered garlic bread and cheese fondue followed by Delmonico steak, beautifully cooked and melts in my mouth. Asparagus side dish is also delicious. Our server gave us complimentary champagne and finished up with the 23 layer chocolate cake. <br><br>A must try restaurant.", "pics": null}}, {"review": {"des": "Enjoyed MJ's restaurant. Self Park was about 5minutes away so it was a quick walk. Sat at the upstairs booth that had full view of the dinning area. Bathroom was very clean and fully stocked. Waitor was ok a little snippy at times.  Started off with  the garlic bread and ceasar salad. Very tasty apps. Never had fondu on the side ! Different but tasty My meal was the bone-in ribeye. Sides/ reg. Mash, corn and fried duck rice. Everything was delicious. Sides were worth it. Steak was good. Got it medium well. Steak 48 has better steak but MJs sides are to die for. I would definitely be going BK but next time different style steak.", "pics": null}}, {"review": {"des": "This is a tough one.  To be clear, I ate at the bar area.  It was noisy (to be expected) and it was my second try.  I first tried and no one knew I existed.  Went to the main dining room which was booked but the manager took me back to the bar area and saw that I was served.  Now for the important part; the fillet was melt in your mouth great! The asparagus was ok. All in all the manager and the chef rescued the meal and the evening.", "pics": null}}, {"review": {"des": "Visiting Chicago for a conference and a member of our group wanted to go here.  Everyone enjoyed their meals except me. Two had the Steak Frites, one had the Steak burger, another had the steak sandwich and I had the Delmonico. It looked great but was undercooked (I ordered medium) and it was more rare. It also had an odd taste. I ate about half and gave up. Maybe I just had a bad experience.  Fries were a cold. Waiter disappeared at times.", "pics": null}}, {"review": {"des": "First impression are everything, right? And this first impression was memorable! The entrance is grand! Beautiful staircase up to a hanging walkway to the dining area where you feel like royalty walking up.<br><br>Once seated, we quickly skimmed the menu and put in our orders. We OBVIOUSLY started with the Garlic Bread (I would be a terrible Yelper if I didn't) and it was PHENOMENAL! It was very different... not your standard garlic bread since it was served atop a pool of decadent Wisconsin blue cheese fondue! I mean c'mon, if you don't love that then just leave! <br><br>I ordered the filet mignon, which was phenomenal, as well! However, as far as price vs quality go, I do think there are better steakhouses in Chicago. But still 100% phenomenal! <br><br>Jordan ordered the MJ's 16 oz Delmonico with the Broiled Truffle Tremor Cheese. While he thought the steak was high quality, he did think the cheese topping took away from the dish. The tremor cheese topping is basically a rich, Brie-like cheese that comes melted/broiled over the top of the steak. It's definitely decadent and I actually really enjoyed the accompaniment, but I can see how this can take away from the steak experience (is that a type of experience?!?).<br><br>Sides-wise the Mashed Trio is delicious and a perfect combo for any steak and any taste buds! Ours came with a truffle variety, a lobster variety and another one, which were all great options. We also got the brussel sprouts, which while good were a let down compared to other brussel sprouts I've had!<br><br>Altogether, this was a delicious meal! We would probably do things differently next time (steaks with no toppings), but there was enough that we would not change (garlic bread, steak quality) to have us coming back again!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/vl87KHsfetksjZSmsowKyA/348s.jpg", "caption": "Entrance"}]}}, {"review": {"des": "At first I wasn't sure if I had faith in a Michael Jordan \"steak,\" and boy, was I wrong. The meat was seasoned perfectly. Everything I ordered was phenomenal. The interior design is super elegant and breathtaking. Beautiful establishment.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/yEYrUNgnMp7ECAgRCj3XwA/168s.jpg", "caption": "If I remember correctly- sangria."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/GUrnWwILmd1pFb1Ig10whA/168s.jpg", "caption": "Wagyu Meatballs"}]}}, {"review": {"des": "HonestLy, MichaeL Jordan's Steakhouse is probabLy the BEST steakhouse I've been to.<br><br>During our stay in Chicago we made it a must to ask Chicagoans what their take for MJ's restaurant was and 4 out of 5 times the key word that described the steakhouse was \"overrated\".<br>Boy am I gLad we overLooked the negativity and decided to check out this spot for ourseLves.<br><br>The steakhouse is Locates inside of IntercontinentaL HoteL posted aLong the upscaLe shopping area of Chicago known as the Magnificent MiLe.<br><br>[we made reservations for 9:45pm and arrived @ 9:15 and were seated within 5 minutes- SCORE!]<br><br>Our party of two ordered:<br>BLood Orange is the New BLack X2<br>Hemingway's BLackout<br>[Hot] GarLic Bread<br>MJ's DeLmonico 16oz Steak<br>Bone-In 16oz FiLet Migon<br>FingerLing Potatoes- cooked in duck fat and topped off with carameLized onions & tune<br>Roasted Mushrooms- made with roasted garLic, sherry, & thyme<br>[compLimentary] Red VeLvet Cupcake<br><br>Food was as cooked weLL and fuLLy enjoyed. Appetizer GarLic Bread is to die for- Make sure you order this!!<br>The sides were weLL seasoned and very deLicious. <br>The steaks were fLavorfuL and very tender.<br>And the handcrafted beverages were strong and in return, did its job [SCORE X2]. <br><br>To top it aLL off, the food wasn't the onLy thing that was amazing. We Lucked out with CLaudia being our server. <br>Not onLy is she super friendLy, taLkative, and attentive- she is very knowLedgeabLe regarding the foods & drinks that are being offered.<br>Thank you for making our Last night here memorabLe. <br>Add MJ's steakhouse as another reason why it pains me to Leave ChiTown :(", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/lsAUiBPYqFA7HJlTB-sU7A/348s.jpg", "caption": "Hemingway's BLackout- $13"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/g8pW9Ef4ZnC6d3ZEJ64rnQ/168s.jpg", "caption": "BLood Orange is the New BLack -$13"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Cquhp8n4A_5Ij4IBO2dKyA/168s.jpg", "caption": "Interior"}]}}, {"review": {"des": "Luis from the bar made a stellar IMPRESION on us. We came back and gave it another try, after a previous not so good experience, and we have to Say it is going AWESOME! <br><br>Last Saturday was our first time at the bar and we had a great time Luis was very attentive funny and had a great personality. We had the Garlic Bread Fondue with Wisconsin Blue Cheese (which was amazingly tasty) and we ordered a crab cake. Usually I would just order crab cakes from Hugo's Frog Bar or Gibson's but this was WAY BETTER. <br><br>I had a John Wayne's Last Ride, which was an excellent drink, also suggested by our bartender Luis. My wife had Champagne (and trust me she was happy) after more than a few drinks at the bar we decided to call it quits, but made sure we had Luis place an order of the signature Michael Jordan's 23 Layer Chocolate Cake to go. <br><br>My wife loves historic buildings and appreciates architecture so this is one of her favorite buildings and I love bringing her back to this place.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/1yVCKU5zkm3TSnc0v7IAyQ/168s.jpg", "caption": "Ask for LUIS at the bar he is awesome"}]}}, {"review": {"des": "Surprisingly pleasant...creatively styled...definitely a go to when in Chicago. Our server Julio was awesome! Very knowledgeable, helpful and friendly. We had the French onion soup to start...great for sharing and very delicious. Steak was excellent as expected.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/qcNq9uTiNLULdOP0VJHd_g/348s.jpg", "caption": "Best thing on the menu!"}]}}, {"review": {"des": "We had reservations for 16 people for my fathers 70th birthday. Food was good & reasonably priced. Service was ok depending upon who you got. Our bill was over $2000.00. We brought a simple sheet cake with us. They charged us $3.00 per person to just cut a cake in squares, 3 x 16= $48.00. You would think after bringing 16 people in for a 5:30 dinner & spending $2000.00 they would be descent enough to cut the cake for no fee. This is enough for me & the rest of our party to never return. Come on!  I understand you want us to purchase a cake from you for over $150 but give us a break.", "pics": null}}, {"review": {"des": "This would be a 5-star review, had it not been for the atrocious service.<br><br>First, I didn't mind the fact that it was a tourist trap. I was hungry, and I was in the mood for a steak lunch. I showed up around 1 pm and the place was empty. My friend and I were seated immediately, but it took about 30 minutes to get the server's attention. Annoying.<br><br>After putting in our order, we were ignored for another 45 minutes while the food was being prepared. No water, no straws, no bread, nothing. <br><br>The food finally arrived. I ordered the Steak Frites medium-rare, a side of mashed potatoes, and a side of grilled asparagus. All delicious, and perfectly prepared.<br><br>My only regret is not having ordered the garlic bread appetizer. The table next to mine ordered it, and I was salivating pretty much the entire time. I would visit this chain again, and just pray for a better server.", "pics": null}}, {"review": {"des": "While in Chicago we visited Michael Jordon's Steakhouse and loved it!  The steaks were amazing and our waiter David was friendly as well as professional. We celebrated our daughters 19th birthday and everything from the environment, food, and service was nothing less than perfect. I highly recommend this steakhouse and definitely ask for David, he went above and beyond.", "pics": null}}, {"review": {"des": "If you make reservations here (particularly for a holiday, such as Christmas), they will seat you in the bar.  You will be on tile floor surrounded by giant TVs sitting on tiny and uncomfortable chairs.  You will not be getting the dining room experience.  The food was just so so and the ambiance was terrible.  Not at all worth the price and it really bothered my party that we weren't given some notice that we would have Christmas dinner in a bar.", "pics": null}}, {"review": {"des": "Great Experience. Our host Nick was very welcoming and friendly. We were offered comp champagne just cause we were celebrating a special Birthday. We got the MJ delmonico and a steak special that was off the menu that came with chipotle shrimps, had the trio potatoes and spinach for the sides; and ofcourse I can't leave out the best garlic bread I've ever had, a must! For dessert we had the 23 layer chocolate cake. All dishes were delicious and was very well beautifully presented. After dinner we had asked the waiter where table 23 was, it was just next to us. Table 23 is where Michael Jordan dines when he's in town. We were at table 24...FYI , u can sit on his table, just gotta pay extra extra...lol", "pics": null}}, {"review": {"des": "The service is great from the hostess, waiters and floor managers.  The food was not my favorite so I decided to make another reservation to try a different steak house.  The sauce seemed to be the added flavor to both the dishes I ordered.  The crab cake have lumps of crab but it was very dry.  Definitely a dish you should eat with the sauce. The petite filet was good but I wish I ordered it with the sauce on the side.  I normally do not add sauce to my steak so I was thrown off by the taste.  The meat quality was decent but not the best.  There is a kids menu available if you have young ones.  The cheese pizza is thin crust with some fancy cheese my daughter scraped off.  The restaurant is nice and cool to check out but I had a higher expectations for the food.", "pics": null}}, {"review": {"des": "1st time here. Tried the pork chops...not very good! To tough to enjoy!! Nice atmosphere and the bread was good!!", "pics": null}}, {"review": {"des": "After a long day at FNCE, the team decided to have dinner at this restaurant. I have always passed by this place on my way to PURPLE PIG but never had tried it so it was great to have dinner here with the team.<br>For appetizers the team shared the dream team appetizer which came with :<br>Garlic cheesy ciabatta bread<br>2 crab cakes - $23 each<br>Double smoked bacon/pork belly<br>I did not have cheesy bread but had the crab cake and bacon. The crab cake was DELISH!<br>Real and big pieces of crab, very little breading and good for 2-3 people sharing.<br>The bacon was a little too salty for me.<br>The team also shared 3 bottles of 2011 AMARONE. It was a very good wine- $100+/bottle.<br>For my main course , I ordered the MJ DELMONICO which is 48 days dry aged with mixed green salad. My steak was superb. Great marbelization , huge steak (16 oz.) for $52 and added bone marrow butter. The team also shared the following sides:<br>Roasted broccoli<br>Roasted asparagus<br>Roasted Mushrooms<br>TRIO ( mash potato served two ways and one sweet potato- mashed)<br>For dessert, the team shared:<br>23 layer chocolate cake<br>Peanut Butter Pie<br>Peach with fresh phyllo dough with ice cream on top.<br>The 23 layer cake was huge but quite dry for my taste.<br>The team's favorite was the Peanut Butter pie.<br>Great service, quite interesting interior and a solid steak house.<br>They also serve scallops, pork chop, lamb chops and fish (sea bass or salmon) if you are not steak fan.<br>Try this place when you can. TRUST!", "pics": null}}, {"review": {"des": "Living on Long Island and commuting into New York City I've been well aware of Michael Jordan's Steakhouse. The one I'm referring to is the restaurant housed inside Grand Central Station. I have passed by it many times, but oddly have never had a meal there. Naturally, there is an abundance of great steakhouses in NYC. I'm a Capital Grille Guy, but obviously Luger's, Del Frisco's and Ben & Jacks among others are all top notch. I was on a business trip in Chicago and was taken by a friend to the Michael Jordan's in the Magnificent Mile location. I was quite excited as I love to try new steakhouses and burger joints. The inside had the classic appearance of an old time steak emporium. Menu selection for drinks was terrific with nice cocktails and great craft beers on tap, many local brews. I had one called Domaine Dupage which was a wonderful amber ale. They also have signature cocktails with great names like \"Blood of a Billionaire \" and \"I Like Big Rums & I can not Lie\". There is also a nice selection of wines and bubbly by the glass. For apps we shared the Colossal Crab Cake and the Double Smoked Bacon with maple glaze. OMG! How tasty was that? For the main course I had the 6oz. Filet Mignon with Bay leaf butter. It came perfectly prepared medium-rare with the butter still sizzling on top. My side was the cream spinach which might be the best version I've had yet. For dessert the signature dish is the 23 layer chocolate cake. We all shared it, but didn't finish. The interesting thing about that item is that The Strip House was first to the party with a 23 layer version. Naturally, Jordan's uniform number was 23 hence their take on it. I must say though that Jordan's was superior due to the inclusion of whipped cream along the side with chocolate slivers sticking out. HEAVEN! I can hardly wait to try the location here at home to see if it matches up. If so, my steakhouse choices will become even more complicated.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/JwxkeBVtvqHvxQDmkRCNQg/348s.jpg", "caption": "The 23 layer chocolate cake. Mmmmmmmm."}]}}, {"review": {"des": "Michael Jordan Steak House is beyond superb. The service was excellent so was the food. From calling to make reservation up to the last minute details of dessert. The staff at MJSH were very attentive and good at their jobs. Everything was coordinated to the detail, we came to our reservation we were seated right away. The staff were very caring they seated us by a window with a view, the ambiance of the restaurant was really welcoming and the turn around time for the food was great. It was really nice, the valet parking was $14 for 4 hours of course we didn't dine in but only two hours. <br><br>Our waitress Jean made excellent suggestions! She was very patient and she took care of us the entire night! So the customer service was great. She started us out with some signature cocktails. I had the blood orange sangria. I didnt like the cocktail to much I think it had too much of one of the ingredients cant point out the taste. The presentation was really nice it was garnished with a purple<br>Flower. <br><br>The food was great. For starters we had the garlic bread. It was excellent one of the most popular appetizers they offer. The blue cheese was really good complimented the bread well. Then we had a caesar salad which we ordered one they split it for us to share (really appreciated that). For an entre I had the smoked faroe salmon. Fish cooked perfect so flavorful and juicy. The potatoes and lobster salad on top was really good. My bf got the bone in rib eye cooked medium with an add on of the stuffed 1/2 lobster and we had the mash potato trio.  My favorite flavor or mash potato was the sweet potato flavor. The steak my bf had was perfectly cooked juicy and flavorful. His favorite part of the meal was the stuffed 1/2 lobster. <br><br>Finally, for desert we had the 23 layer chocolate cake. For chocolate lovers only you have been warned! This cake is so rich, moist fudgy and chocolately, its too much for two people. The cream on the side is really good it lightens the desert up a bit. This dish was almost perfect I recommend either more cream or that its served with ice cream.<br><br>Overall, I recommend and I will return. This was the perfect dinner worthy of a special occasion. Expensive but money well spent. I would like to thank the staff of MJ Steak House for the excellent dining experience and a special thanks to our waitress Jean for making the experience so easy and pleasant with great customer service.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/XsoEXCSUjW9LCU5KI4gDdA/348s.jpg", "caption": "23 Layer Chocolate Cake"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/dJ-lIkRSdV9fqogOcpV5Mg/168s.jpg", "caption": "Blood orange sangria"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/0SVUzDLN_pDW-SBen0-nRA/168s.jpg", "caption": "Special Menu"}]}}, {"review": {"des": "This place totally surprised me. Too many celebrity restaurants succeed on their name and the food is secondary. While I didn't have a full dinner, what I did eat was stellar. <br><br>I was with work colleagues and we had a happy hour at Howell's and Hood, which was okay...nice drink list, huge beer menu, but food was typical bar. Enough about that...I'll review them separately. <br><br>We all decided to have drinks and appetizers, so I ordered an old fashioned, and my two work buddies ordered beers. Drinks were just what we expected. <br><br>For food, I try to eat healthy, so I ordered a crudo, and the two fellas I was with ordered smoked thick cut pork belly, shrimp cocktail and Mac and cheese.  The crude was fantastic! If It was tuna and was perfect! The shrimp cocktail was also really good, but the star of the evening was the pork belly. Wow! This was just about the best thing I've had recently. It was double smoked and tasted like brisket. It was also super rich so one piece was enough. <br><br>I've stayed at the intercontinental hotel before but generally avoided MJ's restaurant.  Won't avoid it in the future and will try dinner next time.", "pics": null}}, {"review": {"des": "Pros: good customer service, good wine, and wonderful ambience. <br><br>Cons: over-priced, slow service, and worst fries ever. <br><br>Because I am a glutton for punishment we went here 2 nights in a row for drinks, since we stayed at the Intercontinental. Both nights, it took forever for someone to come to the table. Once we got a server, they were both very pleasant. The over-priced wine was good, but not a great compliment to the over-priced disgusting fries ($9 for a small cone-shaped container). BTW: for vegetarians, they cook their fries in some kind of animal oil but will cook them in vegetable oil if you ask. Apparently they are not good until boiled in animal fat because what I got was an over-seasoned (brown sugar, paprika and some other kind of seasoning) bunch of potato sticks. <br><br>Anyway, not to complain (too late), but sorry Michael, I am not a true fan. The 3 star was for the service and wine.", "pics": null}}, {"review": {"des": "We ate out on the patio tonight and it was beautiful. The food was great and the service was better. We started with some of the beef fat fries.  They were good.  Just the right amount of crispy & the ranch dressing was great. The flat bread pizza was enough to feed 2-3 people.  I had the bbq chicken pizza and it was delish.  My friend had the pulled pork sliders.  Those were as cute as they were tasty! This is definitely a place to sit and enjoy the city.", "pics": null}}, {"review": {"des": "The bread appetizer is amazing, get that if you go here. The ribeye steak was good and cooked perfectly. The 23 layer chocolate cake was good but it tasted like any other chocolate cake.", "pics": null}}, {"review": {"des": "Was a little weary of this restaurant being too touristy but the food and service turned out to be a pleasant surprise for the most part. The ambience is typical of an upscale steak house with a vintage vibe. Service was absolutely 10/10-- one of the best I've encountered. Our waiter was so patient explaining the menu thoroughly and made sure we were doing ok throughout the meal. The manage also went around checking on everyone. <br><br>Food: <br>- crab cake appetizer 9/10-- the lemon aioli sauce was light and refreshing and the cake came in a bigger portion than expected with huge chunks of crab meat. Though this was as seasoned as some of the other crab cakes I've had, I liked how light it was and I prefer the most bland and refreshing taste. Also liked how the cake was very very lightly fried with minimal batter. <br>- MJ's Delmonico 8/10-- this is a fattier cut but the ginger balsamic glaze was so delicious and flavorful <br>-  Scallop- 6/5/10- this was probably the dish that was the most disappointing for me. The scallops were huge and the raw material was very nice and the pairing with the squash and apples is beautiful. For me, the bottom of the dish was just drenched in oil and the oil really took over the taste halfway through the dish going from a 8/10 to a 6/10. Would recommend draining out the oil before serving <br>- Fillet mignon special with 2 jumbo shrimp 10/10-- the fillet mignon was absolutely AMAZING melt in your mouth! probably one of the BEST steaks I have ever had, simply amazing. The shrimp was so big- the size of my hand but a little too overly battered. That kind of quality seafood  should be cooked more finely in my opinion with minimal batter.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/5HY5VhTBadfD7n1L9yK-8A/348s.jpg", "caption": "Crab cake"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/70p0uxStwB9QYqIe5YObhw/168s.jpg", "caption": "7oz"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/hbjQAA23k8T_TssJ1a79hw/168s.jpg", "caption": "Scallops"}]}}, {"review": {"des": "I have been here multiple times and it's always been a delicious experience!  I've had private group dinners for work and smaller groups in the main dining room.  The service has always been attentive (on one occasion we had someone with Celiac's in our group and our waiter was extra attentive in helping her figure out what she could eat and making sure it was correct).<br><br>The garlic bread is to die for.  The bread itself is nice and soft, but the best part is that they pour a blue cheese fondue over the top of it, and it's phenomenal.  Pro tip: try to snag a piece at the bottom of the bowl, it's been soaking up all that fondue.  Their bacon appetizer is also delicious-thick cut bacon with a maple glaze and just a hint of a char.<br><br>The steaks are well-cooked, and there's many different options depending on your preference.  The scallops I had on my most recent visit might have been the best scallops I've ever had-the brown butter sauce they come in was very good.<br><br>I've never actually ordered the 23-layer chocolate cake they brag about, but I've seen it and if you like chocolate that would be the dessert for you.  The nutella creme brulee is a unique option if you're looking for something beyond the standard.<br><br>Prices are about in line with any other steakhouse in the area.  This is definitely one of my favorite higher-end restaurants in Chicago.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Qt6PS5c3IoKdGz_t1FarWg/168s.jpg", "caption": "Nutella creme brulee"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/RC_E40t1tBH3txVg0gYJuQ/168s.jpg", "caption": "Scallops with roasted squash"}]}}, {"review": {"des": "Awesome. Everything was cooked perfectly, and the staff was wonderful. <br><br>We ordered: <br>Bacon<br>Garlic bread <br>Porterhouse <br>23 layer chocolate cake<br><br>DEFINITELY order the bacon!", "pics": null}}, {"review": {"des": "Good steakhouse, classic decor, excellent knowledgeable wait staff, good wine list with strong by the glass choices. App: Double smoked bacon will probably clog my arteries tonight but I will die happy. Side: Cream spinach - perfection - served as a casserole with bread crumbs on top. Salad: Spinach - flavorful with fresh berries. Steak: Filet Mignon ordered medium rare served slightly over cooked - light pink center. Garlic butter topping was good. Very good overall - not MJ perfect though.", "pics": null}}, {"review": {"des": "First off, we had excellent service.  Our waitress was awesome and I feel so terrible that I cannot remember her name (we were in on Saturday night).<br><br>Great wine list!!<br><br>I ordered the bacon appetizer.  I didn't love it, although the crispy edges were to die for.  The middle I found too fatty for my tastes.<br><br>I had a petite filet cooked to perfection, with grilled asparagus.  The asparagus was a little too over done for me, but still very tasty.  <br><br>My friend had the scallops which were perfectly prepared.  So good.<br><br>I also came back by myself the second night for happy hour, and had the burger (which they made without the bun).  So good.<br><br>Lovely option in the city!", "pics": null}}, {"review": {"des": "Definitely a place to eat at when your here in Chicago!!! Soo beautiful inside and Dont forget to go upstairs to check out where personal set of knives  we ordered filet and their specialty Micheal Jordan's signature steak and they both melted in your mouth and all then sides were to die for!!!", "pics": null}}, {"review": {"des": "I got the steak frites (usda prime) with fries and carmellized onions with a side of corn off the cob. I thought that the corn was very very good and the fries were great. BUT the steak was terrible. It was very chewy and tough and not prepared the way I asked. I would go again for that corn though!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/78bAhzYeaJZ_S5vc7pjsqA/168s.jpg", "caption": "Corn off the cob. Amazing!!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/zP0YBxgJ8lNJBUo7jrlSgA/168s.jpg", "caption": "Steak frites. Steak was very tough and chewy"}]}}, {"review": {"des": "Michael Jordan is great at a lot of things, steaks may not be one of them.<br><br>This place is a must for Michael Jordan fans, from the drinks to the decor, there's plenty to geek out over. The ambiance, service and their garlic bread all deserve 5 stars. The garlic bread was recommended to us by our waitress, and for good reason. Perfectly toasted and flavored, and the blue cheese fondue poured over was the nicest touch. And I don't even like blue cheese.<br><br>We ordered the MJ Delmonico, which is their signature boneless rib eye, and it was underwhelming to say the least.<br><br>I did mention that we were celebrating a birthday, so when we ordered the 23 layer chocolate cake, they were sure to include and special \"Happy Birthday\" message on the plate, which was a very nice gesture.<br><br>Overall, the drinks and the garlic bread were so good I'd come again, but perhaps I'll stick to the lounge area instead of having a full dinner.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/IuziwWcI01Rz7KMZKaLIQA/168s.jpg", "caption": "Garlic Bread"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/99wsSd9LhQ3bMCMMuAHCYA/168s.jpg", "caption": "23 Layer Chocolate Cake"}]}}, {"review": {"des": "This is a review only for the bar, not the steakhouse. <br><br>I went in here a few times during a recent business trip as my clients were staying at the InterContinental Magnificent Mile, to which this spot is connected. <br><br>First time I went it, it was around happy hour. Our server was so apathetic and the drinks were pretty weak and watery. I ordered a basic gin & tonic with Beefeater and it was just blah. <br><br>Later another night, I ordered a mellonballer which was fine. <br><br>The real prize was that you can order bacon as an appetizer. Yes please! So tasty and exactly what you want to eat while drinking.", "pics": null}}, {"review": {"des": "Not an easy place to get to ...but definitely worth the adventure<br>Located in downtown Chicago, by the river, next to the Chicago Tribune ...this is the original film site of the 'Leviticus Club' from the FOX  tv show Empire(before they recreated it on a stage set).<br>It is a nice restaurant. <br>My fiance and I came here to enjoy dinner for our first trip to Chicago. When u enter the revolving door, u walk rigjt into a small lobby and the notice the red hue glow through the dark ambiance ...very modern and chique.<br>We were prmptly greeted by the hostess at the desk. <br>To the left, the bar area ..smaller than most steak house bars but very downtown esque in scene...perfect for City folk getting off work and meetung up. Along the left side walls are framed photos of MJ.<br>The staircase mentioned in all the reviews is smaller than imagimed off the reads but definitely beautiful.  Red stairs on either side climb up to a main platforms that lead to a lit up runway that takes you to the dinimg area.<br>The dining area is your typical steakhouse style ...low light, modern decor, window views, etc. ...not a large dining room but spacious enough.<br>There really is not much to describe far from the typical dining experience at a steakhouse ...you would expect service to be prompt but slow.  Start with drink orders, look thru the menu as you wait for ur drinks, place your food order ...yada yada yada <br>Now, the food we ordered, very good!<br>...im not gonna say it was the best ever but definitely worth the value for what it is.<br>We ordered:<br>GARLIC BREAD w FONDUE BLEU CHEESE SAUCE  ..which was tasty and that sauce was a great compliment but it was not a 'blow you away' kind of bread but definitely a must try!<br>CRAB CAKE ...hands down the best i ever ordered at a steakhouse because these were 10% crumb and 90% king crab meat!  One big mound of crab - very worth it!<br>BONE MARROW APPETIZER ... bone marrow mixed in beef shred packed in a half cut bone shank plated with arugula and 4 flat wedges of the garlic bread (i felt it was the same) but without the drizzle. This was good but i expected it to be all marrow.<br>LAMB CHOPS ...oh my goodness these were 'fire'.  Tender, bone in with a light crisp coating gave a tasty masterpiece to enjoy.<br>MICHAEL JORDAN STEAK ...medium rare thick piece of straight up meat!  Add the auju sauce and its a done deal. Tasty, tender, great steak. Nothing out of this world tho.<br>ASPARAGUS SIDE ...meh, soggy.<br><br>So MJ steakhouse was a fun dinner experience. The waitress was tentative and interactive with good recommendations. The manager even stopped over to say hello and took our pic for us. The hostess was nice to start the evening when seating us. Atmosphere was good. Food tasted great. Price is surprisingly inexpensive! I repeat, inexpensive!  All in all we were happy to make it out here and enjoy.<br><br>Will definitely come back!", "pics": null}}, {"review": {"des": "Everything we ordered on the menu was perfect!  We started with the garlic bread, and I had the MJ Delmonico, while the Mrs. Had the bone in ribeye.  For sides, we had the trio of mashed potatoes, and the creamed spinach.  For desert, she had the Nutella creme-brûlée and I had the peanut butter pie.  All of it was amazing. We also ordered some sangrias.  Would go back for sure!", "pics": null}}, {"review": {"des": "I never knew that steak could taste this good!<br><br>My friends and I started at the bar and had a couple of drinks (vodka sprite for me). They were potent and delicious!<br><br>Went upstairs after our reservation was called. We ordered the corn chowder and a couple of other appetizers, including the garlic break. They were great! <br><br>Along with some nice red wine, I ordered the delmonico. IT WAS AMAZING. I cannot day enough how great this steak was. I literally could not believe how tasty it was. <br><br>We had 22 later chocolate cake for dessert. <br><br>I will definitely be back to MJ's as soon as I can!!", "pics": null}}, {"review": {"des": "You know what? Do NOT spend your money here! Let me clarify, well, my husband and I had desired to eat at Michael Jordan STK, since we moved to Chicago! And as Brazilians we love ST house! So, today we decided to check this one, besides our love for Michael Jordan, this one is also considered top 10 Stake House in Chicago! <br><br>I don't have words to describe how disappointed we are! At the beginning, the host was far away disrespect with us! But we were so excited that we finally got in this STK that we just let her \"problems\" go! So we went to our table, the waitress seems to be unhappy there, and offer any special treatment as we were expected (because you know.... Michael Jordan). We order our food, the meat that we ordered was made by nothing special!!! I mean, it was good, but not good enough if you consider the price! The size of the meat as you can see in my picture, is normal, nothing huge at all!(you have to consider that I am a Brazilian and we have knowledge about this point hahaha) we also ordered a piece of cake, well, it was good! But as everything that we order nothing special if you consider the PRICE! <br><br>At the and, our bill: $190 dollars ( I chocked when I saw it)  our total order was a entree (bread), one salad, aspargos plate ($13 for 5 aspargos), 2 stakes, one cake! DEFINITELY this Steak House does not worth pay that much!!!! TOO PRICEY! You can find a better STK with a reasonable price and an excellent service!", "pics": null}}, {"review": {"des": "23-Layer cake", "pics": null}}, {"review": {"des": "I would have given 5 stars if the steak was actually good. And, since this is a pricy steakhouse, that is the first thing that should be good.<br><br>What prevented me from giving 2 stars was the service. Our server was fabulous and was invested in us to find the perfect wine. It was later in the evening, so she was able to pay more attention than usual.<br><br>We probably won't come back for dinner, but I did enjoy the wine, so maybe we'll be back for that.", "pics": null}}, {"review": {"des": "Our experience was lovely. We came here to celebrate my sister's birthday. A meal for 6 people leaving with full bellies totaled to $420.. YIKES. Let's break it down, shall we? <br><br>Service: 5/5  <br>Our waitress was super friendly and helpful. She made several recommendations which included ordering 3-4 side dishes since the entrees aren't too filling. There was a waiter that would absolutely not let our water glasses reach even below 3/4 full. He refilled our water glasses about 5 or 6 times throughout our meal. Food came out pretty fast. <br><br>Food: Great presentation! Portion sizes were decent. The drink menu is quite extensive. <br>Pretzel bread with honey butter: 4/5 The honey butter was very light. I had to pack it on the bread to be able to taste it. The pretzel bread itself was delicious and soft! <br>Ghost of Jumpman's Past: 5/5 This drink was lovely. The famous jumpman symbol was a nice touch. Perfect balance of fruity taste and very refreshing. <br>Seared sea scallops: 4/5 The scallops were cooked perfectly with nice seared edges. They were a bit on the salty side. In addition, the description in the menu said it came with butternut squash? But my dish came only with 4 pieces of scallops.. I felt a bit cheated. <br>Delmonico: 4/5 The steak was on the fattier side but it was cooked perfectly medium rare- just the way I like it! The sauce came on the side but I felt the meat was quite flavorful as it was. <br>Mashed trio: 3.5/5 The truffle butter one seemed too heavy. The only mashed potato I really enjoyed was the lobster one. The lobster was subtle and didn't take too much away from the potatoes. <br>Mac & cheese: 5/5 Perfectly cheesy with bread crumb topping and the pasta was cooked al dente. This is a great dish to pair with some steak!  <br>Corn off the cob: 4/5 This dish reminded me of elote just in a sizzling pot! It was a bit too salty for my taste but the seasonings worked really well. <br>French fries: 3.5/5 Nothing special. The green sauce was good and the fries were crispy but I probably wouldn't order them again. <br>Free birthday dessert: 2.5/5 It was very kind of them to add in a free dessert along with a signed MJ birthday card. The cupcake itself was lemon flavored but it tasted EXTREMELY dry. <br><br>We had a great experience here. The interior is beautifully decorated. The restaurant showcases some engraved knives for celebrities such as Tiger Woods and Shaq. The prices are comparable to other steakhouses; however, they included a very generous 20% gratuity in the bill when we received it. I recommend trying this place at least once if you're here in Chicago to celebrate a special occasion or if you're just a big MJ fan.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/D0ozTSBXJ2empPSlRp_51w/348s.jpg", "caption": "Ghost of Jumpman's Past"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/RtH6Zsz9xzYqIcmbb2-KEQ/168s.jpg", "caption": "Mashed Potato Trio"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/7dH0S6DnmUAgCTnrJLGApA/168s.jpg", "caption": "Grass Fed Ribeye"}]}}, {"review": {"des": "One star- Spectacular ambiance <br>One star- my boyfriend enjoyed it <br><br>Being a Chicago native, I've never been here before and was excited to bring my boyfriend here for his birthday. As soon as we walked in, the hosts and our waitress were \"nice\" but it sounded rehearsed and not genuine. I ordered the lamb chops and it was disgusting-no flavor and it had more fat than meat. The bacon mac and cheese was just ok. My boyfriend enjoyed his Delmonico steak. The waitress brought us our check and we were charged for garlic breadsticks but we never ordered it. When she took our order she said \"I'm going to start you guys with some breadsticks\" and any prudent person would assume that means complimentary bread and not charge me for something I didn't ask for. She took it off the bill but it kind of rubbed me the wrong way. I am 1000% sure that I will never come here again.. super bummed, I had high expectations.", "pics": null}}, {"review": {"des": "We came during lunch hour. The only thing we ordered are steaks. A MJ'S Prime Delmonico and a New York Strip. I really liked the New York Strip. It has the beautiful and rich pepper flavor, and the steak is really big. The Delmonico is also good. Overall, you do not really need any reason to visit the GOAT's steakhouse.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/bzHNC-nixi2hqfi1O9TNUg/348s.jpg", "caption": "New York Strip"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/3wwCoo76Q_93YfJkzn-zAA/168s.jpg", "caption": "MJ's Prime Delmonico"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/uigeAXgDz4Q9li3mnxjarA/168s.jpg", "caption": "Bread"}]}}, {"review": {"des": "I'm a huge Jordan fan but the steakhouse was ok. Garlic bread was probably the best thing we ate.  Bone in ribeye was 6/10.   The sides were good, lots of flavor.  We tried the corn, potatoes and green beans.  The 23 layered cake was so so.   It was kind of dry.  It was nice to check out once but I probably wouldn't come back if it were up to me.", "pics": null}}, {"review": {"des": "If you sort through my reviews you will rarely see me at a steakhouse.  There is just something about a steakhouse that just doesn't appeal to me.  Maybe because I cook a damn good steak.  Truthfully, my ability to cook a good steak has nothing to do with said ability and everything to do with where I get my meat as well as the cut.<br><br>But back to Micheal Jordan Steakhouse.  This place in particular never made it on my bookmark list because it just screams \"tourist trap.\"  I mean, it is on mag mile after all.  But my friends were visiting from California and they REALLY wanted to dine here.  Probaby in hopes that Micheal Jordan himself would wait our table.  <br><br>I'm actually glad my friends made me dine outside my box because the food here was amazing and the service was top notch.  It didn't feel stuffy or snooty.  I walked in in my 90s grunge outfit, baggy ripped jeans and a flannel.  I didn't get weird looks and I didn't get kicked out.  <br><br>I was torn between the 16 oz delmonico or 16 oz bone in filet.  The price difference was marginal, $4.  Our waiter recommended the bone in filet and I'm so glad he did.  My steak literally tasted like buttah.  My friends got the delmonico; although good, it could not compare to the bone in filet.  <br><br>Overall, it was a really good experience.  The one steak and two glasses of wine was a little painful to the wallet but it will recover.  I look forward to going back with the hubs.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/z4WnRbYX21oNc74MeG1Czg/348s.jpg", "caption": "Bone in filet!"}]}}, {"review": {"des": "I am a big fan of a good steak and I was very happy that Michael Jordan cooked up a dream for me. (OK, I know he didn't make it himself, but wouldn't that sure be cool if he did!?)<br><br>The atmosphere is a little dark and hip, which has a fun vibe to it. The service is great and the food is amazing! Totally worth the price (plan on dropping a few bills, but like I said, it's worth it). <br><br>I don't eat cheese, but the rest of my group ate the garlic bread with the cheese fondue and raved about it. Give it a go, unless you don't like cheese. Or garlic bread.<br><br>The sides are al a carte and large portions, so try to find one that you can share with someone else at your table. I had the green beans and they were delicious.", "pics": null}}, {"review": {"des": "I'm going to have to downgrade my review from 5 to 3 stars. While the food is still just as delicious (love me some blue cheese garlic bread and french fries), the ambiance and service is not on the same level. When we arrived this past Friday night for our 7pm reservation, there was a loud vacuum cleaner vacuuming the lobby where you check in. Prime time on a Friday night is awfully strange timing to send your vacuum cleaner out... What befuddled me most is how they let it go on for so long. 10 minutes later, now upstairs at our table, and that damn vacuum cleaner is STILL vacuuming and it can be heard VERY clearly from every single table in the restaurant. Talk about romantic date buzz kill!! Honestly I was appalled that that many waiters, hostesses, and other staff allowed that to go on for as along as it did because frankly, that should be unacceptable. <br><br>On top of that, our last few service experiences have been strange to say the least... a waitress who after taking your order makes inquiries into your personal life and proceeds to tell you where they live, what they're doing here, where they're from originally, until it has gone on for so long that you've forgotten you just placed an order for a $50 steak. I'm all for friendly service but this was just absurd. And especially frustrating when it means they're so engaged in conversation with everybody that they're not doing their actual job. One of our steaks was overcooked but because this waitress was busy unloading her life story on someone, she never came to ask how our food was. Sorry but I'm not here to share life stories with my waitress. <br><br>Somebody in Michael Jordans, maybe even Michael Jordan himself needs to come in and pull the plug on the unnecessary chatter, and vacuuming.", "pics": null}}, {"review": {"des": "Pros:<br>- MUST order: mac & cheese, crab cake (best crab cake in Chicago, and I always try every restaurant's crab cake). <br>- THE MOST flavorful mac & cheese in town (my 2nd favorite is Bavette's), and sprinkled with awesome crunchiness. <br>- VERY UNIQUE crab cake. There is virtually no mayo or binder holding the crab together. It's very pure essence of crab. The aioli and other seasonings are on the side. I love this.<br><br>Cons:<br>- EXTREMELY loud. Especially if you can't get a table in the normal eating area, so sit at the bar tables (the bar area has tables).<br><br>-----<br>I thought it would be awful, but it wasn't. Got dragged here on a business dinner, rolling my eyes the entire way, but I was pleasantly surprised!<br><br>The steak is decent, but I still prefer the original Morton's or Chicago Firehouse (which is blander than Morton's, but great with au poivre).<br><br>I have converted a number of non-believers. Many, like myself, doubted this place for bearing a sport hero's name. But now they believe. They believe in the crab cake and mac & cheese!!<br><br>Pass on: garlic bread w/blue cheese fondue (none of the flavors were clear), shrimp", "pics": null}}, {"review": {"des": "Lovely decor, great staff, good food.<br><br>The hostess sat me at a long table in front of a window overlooking the street. It was fun to people watch while I ate lunch. The menu isn't the most vegetarian/pescatarian friendly one, but I totally didn't expect anything else with the word 'steakhouse' in the title. I ordered a Caesar salad (though I REALLY wanted to order the garlic bread with cheese sauce that sounded amazing!). Excellent portion size on the salad, very crisp and fresh tasting. I know a salad may not sound like much, but really this was an excellent salad. Slightly overdressed, but that is definitely a personal taste thing. The waiter was lovely, didn't rush me and answered my many varied questions about ingredients and preparation. <br><br>The one downside, when you enter from the hotel you don't really know how to find the hostess stand. Otherwise, a great experience overall.", "pics": null}}, {"review": {"des": "It's okay. Just okay. But with so many really really great steakhouses in Chicago, this would not be on my list. So, the service was good. The drinks were good. The soup was very good but the portion was very small for the money. The salads were huge and good (like every other steakhouse). The steak was NOT GOOD! It was tough and chewy! It was inedible! Oh, and the potatoes were very good - the desserts too! So I'm staying at the intercontinental in a few weeks and it's right inside so I might go back for a cocktail and dessert but it sure would have been nice to be able to have dinner.", "pics": null}}, {"review": {"des": "Micheal Jordan Steak House staff did a wonderful job with their service. The food was delicious, you must try the garlic bread with blue cheese. I wish I could have order for seconds :0) my steak was juicy and delicious. <br><br>We we're celebrating our anniversary and the staff went above and beyond to make our anniversary special. Thank you for everything and I'll look forward to comeback", "pics": null}}, {"review": {"des": "Steaks was good. The lamb shank was disgusting. Tasteless and rock solid. Service are horrible.", "pics": null}}, {"review": {"des": "The appeal of the steakhouse has long eluded me most probably because I never ever find myself inside of one.  But in Chicago, when a place across the street told me there was a 30 minute wait for dinner and that place had no TV from which to watch that evening's World Series game I sunk into a luxurious barstool at Michael Jordan's Steak House then decided to ignore the text message which told me my table across the street was ready.  <br><br>I now understand the appeal of a steakhouse.  <br><br>Though I never made it out of the bar it was the bar which caused me to return again the next evening and, were I in Chicago longer, I could imagine this becoming \"my bar\".  It's plush, elegant, sharp, and a bit luxurious in feel and the server even remembered me on my return visit.  <br><br>I never made it into the steakhouse portion of the place but I can attest to the pure deliciousness of the Wedge Salad ($13; Bacon, tomatoes, blue cheese, & crispy shallots) consumed in the bar area.  It was a most perfect accompaniment to some fine wine.  I didn't sample the Caramelized Onion Soup ($12; Raclette, gruyère cheese, & madeira) but my friend who did described it as very rich and said she would order differently next time to which I say \"order the Wedge Salad\".  <br><br>The dark walls are lined with vintage photos of Michael Jordan and this outpost does nothing to diminish his legend.  It's a lovely, classy, comfortable bar with mighty fine food, drink, and service.  <br><br>Keeping it classy, MJ.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/47xeGnTA2n_kJmS-YMjMGQ/168s.jpg", "caption": "Carmelized Onion Soup is very (too?) rich."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/UNcUO0cRnzwbUB0QCrzT0A/168s.jpg", "caption": "Wedge Salad looks good, tastes fantastic.  Get it!"}]}}, {"review": {"des": "If it were just the drinks and fries, I would give this a 4 star, but this also included the room service (in-room dining) for the InterContinential because I believe it's the same kitchen providing the food.<br><br>I had lunch in the bar area with a few of my co-workers (since we're all out of town) we wanted to do the tourist thing and had a lunch meeting there. Also, we were lazy and didn't want to go far from the hotel. For this meal, I had the $54 MJ steak. I wanted it medium-well, it was well done. Also, I had a side of a mash potatoes. It turned out to be plain mash potatoes, not with the brown butter and chives as described on the menu. Bummed, but the hard apple cider was very good. <br><br>My second meal, I ordered in-room service (because I had work to do, and was lazy). I ordered the baked mac and cheese, and cheesecake. I would give this meal a 1.5 star. The breadcrumbs or topping they used was so old or the dish was prepped a while ago, it made the whole dish have oily stale taste. The worse part of the meal, the cheesecake had dollops of whipped cream--THERE WAS A LONG BLONDE HAIR IN IT!<br><br>My third meal, I decided to eat at the bar, because if there were hair in my food, I could show them. I had the steak burger and fries with the hard apple cider. This meal redeemed them. My burger was perfectly cooked, medium-well. I think that their fries had crack in it, I couldn't get enough. I was going to order an order to go, but I decided to have some self-control. <br><br>It is one of those places that you have to try once, just to say that you've been there. It's simple food, and if done right, it's very good. Though, if you wanted a good steak for your money, I'm sure there are better places downtown Chicago that's worth your money.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/t2VnoJvUT5jLPu1Nv_uLZQ/348s.jpg", "caption": "Ohhh the"}]}}, {"review": {"des": "Unfortunately wasn't very impressed with the \"Delmonico\" steak for the price paid. Service was also strange and awkward for an expensive restaurant in the city. <br>You could tee up and hit a golf ball in any direction in Chicago and find a better steak.", "pics": null}}]}