{"name": "millennium-park-chicago", "reviews": [{"review": {"des": "In the heart of the city nestled between bustling Michigan Avenue and Lake Shore Drive is a piece of gorgeous nature. That alone helped me fall in love instantly.<br><br>The planners for this park had forethought to create an oasis of everything fun for families, locals and visitors young and old. Each season offers something new that keeps everyone coming for the first time or for a return visit.<br><br>Photo opportunities are everywhere. Movies, music, ice skating, shopping and eating options are available at all times. I've been there during the day and evening and enjoyed both types of visits.<br><br>Don't forget to stop by the \"Bean\" for the perfect Instagram photo or creative Snapchat. I live nearby and can never get enough of one of the best jewels of Chicago!", "pics": null}}, {"review": {"des": "Millennium Park was a required tourist stop for our group as we HAD to visit The Bean, which was pretty awesome, despite the summer crowd.<br><br>Additionally, the Rock n Roll race go through the park, which makes it extra special now.", "pics": null}}, {"review": {"des": "Fantastic park!<br><br>Millennium park was the first place we visited during our weekend trip to Chicago in the middle of August, and no doubt about it that this park probably should be your first visit too.  <br><br>The landscaping alone is lovely here, but there's so much more!  This 24.5 acre park is home to iconic structures like the bean (the big shiny metallic uh...bean) to the Millennium monument and fountain, or even the large digital towers with huge faces on them (careful...these things spit a stream of water out at you...I loved it!)<br><br>We sadly didn't get a chance to explore the entire park.  While we did have expectations of coming back, we got caught up with the rest of Chicago to get back here.  The beauty is we COULD have easily got back to Millennium park, considering the transportation could get us there (exit at Washington/Wabash (elevated lines) station or the lake  or Washington subway station to get there).<br><br>I love this park and it's perfect for this city.  If you find yourself in Chicago and you have a few days, do yourself a favor and check this place out!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/luLeUEzsZN0SmmEGUrprww/348s.jpg", "caption": "The bean"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/gIgb_DbXLc1p-3m_OzWt0A/168s.jpg", "caption": "One of the faces on the water tower"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/K0B85C-EBXa71VMJy7rmUw/168s.jpg", "caption": "Up close of water tower"}]}}, {"review": {"des": "Great place for pictures.  I've seen many weddings that were there. The grounds are decorated beautifully each season. There's no real park staff that I ever saw nor security but we felt save and enjoyed ourselves. There is an ice skating outdoor rink nearby that looked like fun.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/HDcBC7Phm_Yh117fDHqDgw/348s.jpg", "caption": "Bean blends in with the sky!!!"}]}}, {"review": {"des": "08/2018<br><br>I can now appreciate the draw of \"The Bean\"!<br><br>Free to visit, Cloud Gate aka \"The Bean\" is an entrancing interactive piece of art. We walked down Michigan Avenue to Millennial Park for what I imagined would be a quick photo stop until I found myself fascinated by it & its sky, building & people reflections. We were fine with the number of visitors there as we had very courteous interactions. <br><br>I loved it so much, we first saw it in the evening & then returned to see it at daytime & to enjoy walking around more of the park.", "pics": null}}, {"review": {"des": "Really cool park with lots of things to check out. Chicago is a very busy city and I like the fact that this is in the middle of downtown. Also some great site seeing so if you want to get in 10K steps or more I suggest you come here and start to walk! Lots of cool things to see. <br><br>One thing I notice is a lot of Asian people that are extremely nice, I believe they are selling peace bracelets.  I didn't buy any because I didn't have any cash but if you see them and have cash. Help them out. Not sure what the cause is though<br><br>Nice park to relax after a long day of work and unwind. Very popular park with lots of people. Some cool art exhibits as well. Definitely suggest checking this park out if you are in the Chicago area. I believe they have live music here on the weekends and during the week. That would be pretty cool to check out.", "pics": null}}, {"review": {"des": "It's a must see if you're a visitor. Plus you'll get you walking quota in.  Never disappoints. Besides plenty of photo ops for selfies and such, there's a nice energy and vibe here.  <br>I've been here in the summer, fall and winter and the Bean looks amazing.  There was free live entertainment when we checked it out.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/8LKlMQr6iIrW92KaCxJFlA/348s.jpg", "caption": "Interior shot of the Bean"}]}}, {"review": {"des": "This is a great public park in downtown Chicago. Full of well curated artwork (soooo much more than just the bean!) and plenty of room to walk around and rest in beautiful surroundings. I seriously can't understate the importance of taking an hour or two to wander the park - look at the sculptures, cross the pedestrian bridge, pose in front of the Cloud Gate and much more. I think my favorite parts were the pedestrian bridge and the Pritzker Pavilion. So beautiful!!", "pics": null}}, {"review": {"des": "If I could live at Millennium Park, I most definitely would! There's so much more to do and see besides taking the perfect pic for the gram. With that being said, it is a beautiful space and I could never have too many photos with the Bean.<br><br>It is a tourist destination, but c'mon it's a MUST in Chicago. It's very green and a large open space if that's your kind of thing. Don't let the crowds detour you; I sorta think there are more people walking up and down Magnificent Mile than hanging around Cloud Gate. <br><br>Best time of day is the early morning and during the week, even less people when it rains!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Ryh4cHPvSynubnOMcL_9yQ/348s.jpg", "caption": "There will be a lot of pointing"}]}}, {"review": {"des": "Who doesn't visit Millennium Park when coming to Chicago? This place has been on my list for some time!  After taking the train into town, my friends and I made our way through the city. Don't expect it to be empty, everyone comes to see the bean! Get your photos and take your selfies, and beware of photo bombers (such as myself). There is plenty to adore at millennium Park, I wish that we had more time, but we had a train to catch to get back. We were also told that Millennium Park is a sight to see at night too!", "pics": null}}, {"review": {"des": "This is definitely a very beautiful park. Lots of activities here. There is an outdoor bar just right below the Bean. There is also the Bean - great for photo taking. Its a Chicago Iconic monument. Tourist hotspot. The park is huge. There is also an out door stage on the side. <br><br>MPP - green space really stand out being surrounded by lots of tall buildings. There is also a garden at one corner of the park. Very amazing. <br><br>Tourist hotspot. Must visit", "pics": null}}, {"review": {"des": "Millennium Park is beautiful. Not too much to see other than the bean! It's very clean and well kept. Not much to say about it.", "pics": null}}, {"review": {"des": "Well hello Millennium Park! Chicago has one of the best and beautiful historical landmarks. This park has the famous \"Bean\" that everyone raves about, rock climbing, Laurie garden, skating rink, and more! I'm from Houston and coming here made me want to move here! The attractions are endless and well more exciting! But hey I still love my city just a tourist doing touristy things. I would definitely recommend making a pit stop here and taking numerous pictures. Enjoy!", "pics": null}}, {"review": {"des": "The Millennium Park was really close to the hotel we were staying at and it's definitely THE tourist spot to visit - we went to the park on our very first day in Chicago. It was a short walk but I didn't realize how big the park was! We definitely didn't get to walk the entire thing, but it was nice to check out the famous Bean and take lots of pictures while enjoying some delicious Stan's donuts in the shade.", "pics": null}}, {"review": {"des": "Go see the bean, even though you'll feel like a tourist. It's worth it. We went on a particularly crowded day and it was still fun. Even if we did have to dodge every third person stopping randomly to take a picture in front of every angle of the Christmas tree.", "pics": null}}, {"review": {"des": "Millenium Park is just the bees knees.<br><br>   I have been to Chicago multiple times and have to make a trip to this park every time. It's kind of the hub for tourists, as it has so many different sights to see, along with it being right next to other tourist-y areas. <br><br>   The famous Bean is located here, which is, of course, a must for any visitors.<br><br>  They have a huge, outdoor arena area, where they hold Lollapalooza and have different events. We came here one time and they had a huge projector playing a movie, and everyone brought blankets and chairs to hangout here. Plus, vendors were walking around giving people free tubs of ice cream. No, not a cup or a scoop. A TUB. YES QUEEN.<br><br>   Millenium Park also has some other cool artwork here and there, some fountains, and it makes a great photo op no matter which angle you shoot in. Nevertheless, just come here. You won't be disappointed.", "pics": null}}, {"review": {"des": "The park itself is beautiful, with a lot of green space and beautiful architecture. Make sure you check out the other part of the park that's not only the BEAN. We all love the bean, duh, but the art sale tent, other sculptures, and the park itself are worth some time of yours. <br>Like other major parks in big cities, there are some homeless people resting around the park. I don't find that disturbing, but I can see some people may seem that as \"out-of-scene\".<br>Also, I give it 4 stars because how packed this place can be. It's hard to find tranquility or just some uncrowded space sometimes.", "pics": null}}, {"review": {"des": "This park is a must see when visiting Chicago. It is home to many cool features such as the Cloud Gate, limited time art like Mt Rushmore this summer, and the Crown Fountain \"Faces\". It is clean, well kept, and well policed so in turn safe. There was a free music fest going on this particular weekend with some big names. There was also a really cool food festival going on in another area. The point is there is always something going on here and so much to see and do... so get out, get some exercise and walk around this huge park right along the lake in Chi Town!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Q_kH97JMrXHa3Q_0wiP2TQ/168s.jpg", "caption": "Limited time art"}]}}, {"review": {"des": "Cool park.  Lots to see.  And of course, you must visit the bean.  So many tourist here trying to get a selfie with the bean.  Guilty!  I wish i had more time to really check out the park more.  I guess this is an excuse to come back one day.", "pics": null}}, {"review": {"des": "Now I was born in NY and after many visits to Chicago i feel a good comparison of Millennium Park is Central Park. This trip I stayed within walking distance. There is so many things going on here every day. Luckily I came here everyday as it was always near where I was going. The gardens are magnificent. If I lived here you would need to come to find your happy place even though the weather is cold and dreary. <br><br>The most beautiful sculptures as well as I walked up to the Cloud Gate aka the bean with the beautiful reflection of the city scape. Great for photos of such an iconic piece of art. <br><br>This park is a treasure and not to be missed by locals and visitors alike. Hope next visit I have better weather to enjoy all it's natural beauty as well as have a picnic.", "pics": null}}, {"review": {"des": "I'd been here before and it was one of the must see's I was anxious to take my mom to see.  Seeing it in person is just such a neater experience than videos and pics. <br><br>the people watching is great ... so many playing in the fountain and taking selfies by the cloud/bean sculpture.  We walked here from our Hilton hotel.<br><br>another interesting thing to do that's totally free.  a popular place and can be crowded.  If you are a picture purist and want to have only you in the pic .. you will wait a LONG LONG time. Some lovely flowers landscaping .. places to sit and relax .. and watch the action.<br><br>The Crown fountain is very unique  .. in the summer there is a area to walk in the shallow water and cool off .. on either side is huge walls that show video close up of real peoples face .. smiling, frowning ... sometime they shoot water fountain out of their mouth. The kids go crazy giggling and playing in the water. Its fun to watch and for kids of all ages. Hey it was hot ... I took of my shoes and cooled off.", "pics": null}}, {"review": {"des": "First off, let me say the Bean is super cool. It's much larger than I expected and offers really amazing reflections of the surrounding buildings. It's worth a stop to just see this famous monument. I didn't have a lot of time to fully explore the park but it didn't seem to have a lot more to offer. I might be wrong but that's my initial impression. It was also packed so as someone who prefers as few people in my pictures as possible, it's rough. It just wasn't an option. Something tells me it rarely is. However, it's really awesome that my 200th review is of such an iconic tourist spot.", "pics": null}}, {"review": {"des": "Beautiful park. So much to see and do. I had an opportunity to walk around a bit. I went to see the Bean (more on that in a different review). It was a perfect day to be at the park. Sunny but breezy. I sat on a bench and watched people for awhile. A wide variety of people come through the park; tourists, locals, young couples, families. <br><br>There was a set up for some musical festival and of course, a ton of people went to look at the Bean. The fountains were beautiful too. I wish I had more time to walk around and see more stuff. <br><br>I'm glad I got a chance to go there.", "pics": null}}, {"review": {"des": "This is where Millennials go for sun and fun when they get tired of sleeping in their parent's basement. Just kidding, ha ha. This is the best public park I have ever been to. It's like a theme park but it is free. The bean is mesmerizing really unique. Hey, why didn't the boomers get a park made for us? Too busy raising our millennial kids I guess. LOL Check it out.<br><br>Listed in Drive Across America: <a href=\"https://www.yelp.com/collection/4_4-FCUBHEQBq43u7DXRig\">yelp.com/collection/4_4-…</a>", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/aV9LnXl0XmFjRS_NIU71tQ/348s.jpg", "caption": "Climbing wall"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/yZFl0vgam7Ypg_OEKJAyeA/168s.jpg", "caption": "Concert stage"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Kx9rZqwtN_nL47HSWbrs0A/168s.jpg", "caption": "The Bean!!!"}]}}, {"review": {"des": "Is it the Central Park or Griffin Park of Chicago? Or are those the Millennium Parks of NYC and LA? Beautiful spot, central location, and a newish World Series Championship, zero excuses to not visit if you're in the Windy City.", "pics": null}}, {"review": {"des": "If you are in Chicago, this is a must see.  The park is beautiful and has the famous \"bean\".  The \"bean\" is large modern art.  It is as the name suggests shaped like a bean or a large ellipsoid.  The cool thing about it is that the \"bean\" is a mirrored.  Since it is curved, you get really interesting reflections.   Of course the park is free, so it's a good value for your entertainment.", "pics": null}}, {"review": {"des": "I'm so old, I remember where there was no such thing as Millennium Park. It was created in 2004 for us lovely citizens of Chicago & our tourists to enjoy concerts, fests, events, family time, dates and whatever else our heart desires in their 25 acres.<br><br>There is so incredibly much that goes down at Millennium Park that it's impossible to name it all. Let's go through the biggies though...<br>~Jay Pritzker Pavilion where you can see tons of fests, concerts, movies in the park<br>~the Bean aka its official name Cloud Gate aka Stand under & take a selfie mirrored statue<br>~the Crown Fountain aka video sculptures & spitting water faces<br>~the Lurie Garden<br>~Ice Rink & Park Grill<br>~Pedestrian Bridge - it's so cool & wind-y!<br>~Maggie Daley Park which is the coolest kids park on the planet.<br><br>It's the top tourist destination in Chicago now! Take that jankity Navy Pier.", "pics": null}}, {"review": {"des": "It's such an amazingly structured park for tourists! There's lots of room around the bean as well, so you don't have to stand super close to people and ruin pictures. <br><br>I realized that the farther you walk away from the center of the bean, the better your photos are in terms of landscape and quality! There's even a toddler/children park if you follow this trail the other side of the park. <br><br>It was super clean and very open. I love how it was central to everything in downtown as well.", "pics": null}}, {"review": {"des": "How lucky are the people of Chicago to have this open space dotted with public art such as Cloud Gate, Crown Fountain, among other spots such as Lurie Gardens, and the Pritzker Pavilion?  <br><br>Wide Open Spaces-<br>There are also benches scattered throughout the 24.5 acres of the park where individuals can enjoy the green spaces, hear the birds chirp, and soak up the sunshine.<br><br>The History-<br>Once controlled by the Illinois Central Railroad in which the area \"[w]as covered with unsightly railroad tracks and parking lots, remained blight on Chicago's lakefront throughout the 20th century.\"  Furthermore \"[w]ith the commitment of the private sector and the involvement of world-renowned architect Frank Gehry, the project evolved into an ambitious undertaking featuring a collection of world-renowned artists, architects, planners, landscape architects and designers.\"<br>Source:<br><a href=\"/redir?url=https%3A%2F%2Fwww.cityofchicago.org%2Fcity%2Fen%2Fdepts%2Fdca%2Fsupp_info%2Fmillennium_park_history.html&s=45f89dd29af7b5034deba5d765cc7a9b8b58dc807042457647de9facc9eec5a7\" target=\"_blank\" rel=\"nofollow\">cityofchicago.org/city/e…</a><br><br>For FUN-<br>Check out the audio tour of Millennium Park<br>See:<br><a href=\"/redir?url=https%3A%2F%2Fwww.cityofchicago.org%2Fcity%2Fen%2Fdepts%2Fdca%2Fsupp_info%2Fmillenniumparkaudio.html&s=15323342064c87c7dc2ec985fa0a5a52b076012d93613d453d75ba97f0f9e4b2\" target=\"_blank\" rel=\"nofollow\">cityofchicago.org/city/e…</a>", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/MDf4co9N9kK-MrujcV2E9A/348s.jpg", "caption": "Looking down over the park from Cindy's Rooftop Deck on the 13th Floor of the Chicago Athletic Association."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/WwfQRDqrvVKYxbrFQwqOWA/168s.jpg", "caption": "Crown Plaza-1,000 diverse Chicagoans are projected featuring video shorts of their faces (visual-no sound)."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/bhOGNnVRqMf3qdYa0G0sjA/168s.jpg", "caption": "The Map! Very Useful!"}]}}, {"review": {"des": "The Millennium Park beautiful was a place. So different from any park I have ever seen in a city. We loved the bean. It was just magnificent. We took many images at all various angles. The fountain was so incredible at night. It is easy to get to on the bus or a nice stroll. I would definitely put this on the must-see of your trip.", "pics": null}}, {"review": {"des": "FUN, well made, interesting, free and unique are the attributes of the Millennium Park. <br>Kids will love it, along with the parents. The lakefront is only 5 minutes away.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/jZJfYBo2RVNySDLgocloiw/348s.jpg", "caption": "Stage"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/vT0-xhv-KHlpDKJNJXgQnw/168s.jpg", "caption": "Nearby lakefront"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/oq42yc4pSrStBX21ZoYaMw/168s.jpg", "caption": "Nearby sculpture by Mestrovic"}]}}, {"review": {"des": "I think this place is a must for anyone visiting Chicago, just do it!<br><br>I've been here several times and I've always found something to be going on.  This time around I came in March and it was COLD.  <br><br>- The park itself is beautiful and if the weather is nice it's especially fun to walk around and explore, even when it's cold you will find adventure.<br>- The bean is interesting/beautiful/fun spot where you have to take at least 10 pics from different angles.<br>- Sometimes, when warm, there are free concerts in the Pritzker Pavilion, BUT, even if there isn't any concert the place itself is beautiful.<br>- From the park you have a great view on Chicago's architecture. <br><br>If you're coming to Chicago, please do yourself a favor and visit this place, it's FREE.", "pics": null}}, {"review": {"des": "Bottom Line:  Lots of open space with various \"rooms\" and free events in the prized pavilion.<br><br>Millennium Park is the pride of Chicago.  The park is adjacent to Grant Park and was built to celebrate the new millennium. The project was over budget and behind schedule but the result is an endearing and iconic landmark in downtown Chicago.  <br><br>Millennium Park is famous for having free concerts in the state-of-the-art pavilion by renowned architect Frank Geary but perhaps the most popular attraction in the park is \"Cloud Gate.\" Thousands of visitors each day stop by the big shiny bean to take selfies and enjoy the reflection of the Chicago sky line. <br><br>The park features various \"rooms\" each with a focal point, such as Cloud Gate. Another popular \"room\" features interactive screens with an integrated water fountain.  The screens show different picture of people representing Chicago and every now and again a few of them spit like gargoyles. The concept is creative and a huge hit with kids on hot days but I still find it bizarre!  The fountain is called the Crown Fountain.<br><br>On my visit in early May I enjoyed the thousands of tulips in bloom in the park. I bet the holiday ice rink in the winter is a neat experience too.<br><br>The engineering behind the park is interesting.  It's basically built over railroad tracks and a parking garage. I think the area used to be an eye sore.<br><br>Speaking of railroads, it's nice that the park is easily accessible from the Metra commuter train and the L.  <br><br>I heard a stat that Millennium Park has surpassed the Navy Pier as the most visited landmark in Chicago.  Whatever the case, it was very, very busy on my most recent visit and they really took away from the overall experience.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ie5XW8-rk2bTwZQ4eY3Cvw/168s.jpg", "caption": "Gorgeous May tulips in Millennium Park"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/XxKLDjF3qSOMBTjFvVt_gg/168s.jpg", "caption": "A map of Millenium Park"}]}}, {"review": {"des": "On future trips, February will not be my in my first few choices of months to visit Chicago. The cold heavy dampness in the air caused a slip sliding effect to the parks walking surface, took a few slides before I got the jist. Due to cold and rainy conditions, the time I had hoped to spend within the park was quickly dashed.<br><br>The ice skating rinks lights illuminate portions of the skating surface, it glimmers at you once you look close, then you'll catch it.<br><br>The fountain was ivory white to the eye, cool and smooth to the touch and although inactive, dispelled an aura of strength and purity, holding a prominent park position.<br><br>The changing faced structure and The Bean never really did it for me and the tourists buzzing around them like moths to a light is puzzling to me.", "pics": null}}, {"review": {"des": "Definitely a must see for anyone's first visit in Chicago. When you think of Chicago, Millennium Park is going to be the first image that comes to mind.<br><br>Parking: I know there's plenty of designated parking lots in the area, but most of them are pricey. My friends and I ended up parking a couple of blocks away at a parking meter for much cheaper. Also, we arrived pretty early so we were lucky!<br><br>Park: This is where The Bean or Cloud Gate is basically at. There's definitely plenty more to see here than just that, but you can't really leave Chicago without taking a photo in front of The Bean! It does get extremely packed later in the day, I recommend arriving as early as possible to get a good photo in. There's plenty of art installations scattered around the park. They're all very unique and beautiful. I recommend spending an hour or two here to be able to experience everything!<br><br>Ice Skating: Offered in the winter, but this is a MUST!  There are two rinks, one that's located in the heart of downtown right in front of The Bean. I really like that rink because it's small and gets you a great view of the city. Rentals are affordable, and you can use those skates for however long you want for the day! The second rink is located across the park at Maggie Daley's Park, that one is a cool skating ribbon that wraps around rock climbing walls. Still a fun and unique experience!<br><br>Overall experience here is great. I love that you get to see and do so much for such little cost! This is all part of the Chicago experience and it'd be a shame if you skip out on Millennium Park!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/DpmIWha2IBtuAm9XD4haug/348s.jpg", "caption": "Ice skating by The Bean :)"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/cDT_mS0KwHCVH6Hofchaeg/168s.jpg", "caption": "The Bean!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/iJUuSELsWX2zWKayWZi1uQ/168s.jpg", "caption": "Beautiful"}]}}, {"review": {"des": "So many free things to do for all ages. They have slides that are exhilarating and sizes appropriately for different age groups that are posted on signs. Very beautiful art instaltions all over the park including the cloud which many refer to as the \"bean\".<br><br>Overall from the slides, jumping bridge, the bean, and pirate ship. It is a great park I wish that had one in every major city", "pics": null}}, {"review": {"des": "Though Millennium Park was completed only in 2004, it's perhaps Chicago's most well-known park. Just look at the number of reviews here!<br><br>Construction dragged on for 6 years and cost $475 million, far exceeding the original budget of $150 million. This park embodies Chicago's architectural spirit of \"make no little plans.\" Prominent features include Crown Fountain, Pritzker Pavilion, Lurie Garden, and the iconic Cloud Gate sculpture colloquially known as \"The Bean\".<br><br>The park is fairly large and connects to Maggie Daley Park to the east and the Art Institute to the south via a couple awesome-looking pedestrian bridges. The grounds are well cared for, and there is a lot to see throughout. Unsurprisingly, this place can get pretty crowded.<br><br>On our first visit, the annual Blues Festival was going on here and the crowds were massive. They were gone when we returned on a weekday, though there were still a fair number of people in the park. Still, it was great being able to walk around and enjoy all that this place has to offer!", "pics": null}}, {"review": {"des": "Gorgeous park. We really enjoyed seeing Cloud Gate and all of the beautiful structures. There was a musical festival all around us when we visited the park so it was extra busy but very enjoyable. The location of the park offers almost 360 views of downtown Chicago so there is always something to see and within walking distance of many attractions, restaurants, and the CIBC theatre.", "pics": null}}, {"review": {"des": "Quintessential Chicago! The Bean. Green space. A view of the skyline. Walking distance to Soldier field, the magnificent mile, the business district, etc. It's a must go to if you've never been to Chicago or if you have but have never been to this park!", "pics": null}}, {"review": {"des": "Explore Beyond \"Cloud Gate,\" aka \"The Bean\" <br><br>Art and architecture. Concerts and concessions. Gardens and galleries. Industrial wasteland metamorphosed into a world-renowned urban park. So much to explore. <br><br>Difficult to believe that this amazing Chicago playground was once an eyesore on the Chicago waterfront. From the 1850's until 1997, this beautiful park was covered with train tracks and parking lots. In 1997, Mayor Richard M. Daley planned a new green space to enhance this neighborhood. World-renowned architect Frank Gehry collaborated with other famous and local urban planners, artists, landscape architects and designers to transform the landscape into todays 24 acre Millennium Park.<br><br>Highlights include of course Cloud Gate and The Crown Fountain with the ever-changing faces, but take the time to walk through Lurie Gardens and smell the flowers or dip your feet into the water. Explore arachnids in the Sunday Science Classes. Listen to the Blues, Jazz or Mariachis. Or catch a kids flick like \"CoCo.\" (Bring a box of Kleenex to this tear jerker.)  <br><br>Check on-line for a schedule of events. Many are free. And remember, take pictures and leave footprints.", "pics": null}}, {"review": {"des": "Even on a frigid day this is a great place to visit.  I just wanted to get out and walk one day and lucky for me this was right up the street.  It's amazing that you can be in the middle of the hustle and bustle of the city, but then somehow forget the noise and disappear while sitting on a bench.  Even though there are many people nearby, you can still feel an isolation.<br><br>Of course there are the touristy things to do while in this park, but don't let that overshadow all that there is to do here.  Take a moment and just enjoy your surroundings.  Take a walk, stand and stare at an object, and of course visit the bean.", "pics": null}}, {"review": {"des": "The roommate and I were across the street. Since he's never been to the bean (or Cloud Gate), I dragged him here on Tuesday, December 5th around 1:15pm.<br><br>It was cold AF, so the park was pretty empty. We didn't explore much. Just walked by the McCormick Tribune Ice Rink, saw Cloud Gate and I believe The Jay Pritzker Pavilion. The roomie isn't really into doing touristy things, but I think seeing the bean is pretty cool. It's fun walking around and seeing your reflection change with all the angles. I've been here on warmer days during past trips and it can get insanely crowded. Since it was so cold, we were able to get a fairly unobstructed pic. A plus on going on a freezing day I guess.<br><br>One of the things I think you should see when visiting Chicago.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/NrkoiaIhg9BeYDFQhzmpaw/348s.jpg", "caption": "Millennium Park"}]}}, {"review": {"des": "What's a visit to Chicago without a visit to the Bean? We took a Lyft down here and spent some time walking around and taking pictures. <br><br>The water walls were extremely crowded with kids and families splashing around on the hot day. The Bean of course was crowded since it was a Saturday. Lots of people taking pictures. <br><br>Beautiful park and gardens and a must do when in Chicago.", "pics": null}}, {"review": {"des": "The most iconic thing about chicago.  Nice place to hangout at night where you have all the locals coming out and enjoy the fountains.  Also you can see many of the iconic buildings lit up.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/OpNHSmdd5GPQxe7iWK3mrA/348s.jpg", "caption": "Shiny bean front view"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/nwZMFWnmuHs8v9miJrAacQ/168s.jpg", "caption": "The famous \"bean\""}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/hbKMvPBxGUUnPjsqQbxb0w/168s.jpg", "caption": "Creepy face staring out st one another.  Spits water from time to time"}]}}, {"review": {"des": "Worth a visit. Walked to it from the Field Museum .Close to lake shore. Took pictures by the Crown fountain. They were setting up for a concert memorial weekend Sunday. Very crowded but worth a look. Great for just people watching", "pics": null}}, {"review": {"des": "Beautiful park, lots of cool things to do.  Watch fireworks during the summer.  Home of the famous Cloud Gate \"The Bean\" and the Crown Fountain.  Each year the have the Taste of Chicago at one end of the park.  There is also a amphitheater on site.  The park is huge.  Good people watching location.", "pics": null}}, {"review": {"des": "The Bean! The Bean! The Bean! Whew got that outta my system. So I've been looking at pictures of the Bean for the longest. Finally got my chance to see it up close. Magic! So many people. So many photo ops. So beyond the Bean, I didn't get to see more of Millennium Park like I planned, but overall enjoyed the experience.", "pics": null}}, {"review": {"des": "Hard to miss on any uber ride and you can honestly get off anywhere on this street. I like that you can hit Grant Park, walk to the art museum, and then come here to see the Bean all in one trip. <br><br>They were under event prep when I went so certain areas were closed which was disappointing since it was high tourist season. However, still saw what I came to see. <br><br>Chicago during the summer is beautiful in both scenery and weather and so it was really pleasant walking around looking at the digital water wall and the grounds. <br><br>Not the most crowded tourist spot I've been to, but if you think you can take a picture of the bean, alone - with no one else interfering - you're going to be disappointed. <br><br>Overall, a very pleasant experience.", "pics": null}}, {"review": {"des": "Conduct any search of what to do in Chicago and the millennium park will be top five. Between the Bean and the outdoor skating rink, there's plenty to do and see here! I've only ever been in the winter but I'm sure it's an amazing summer destination. Can't wait to go back and picnic.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/G99YoZxnfRGXjQ-UAK7xYQ/348s.jpg", "caption": "Cliche Bean Photo!"}]}}, {"review": {"des": "Can't visit Chicago without visiting Millennium Park!<br><br>You can find Cloud Gate, or more popularly known as \"The Bean\" here! It's one of the top sightseeing spots for tourists. The park itself is beautiful with lots of lush green gardens. If you're visiting for the first time, make sure you walk around the whole park and explore rather than just stopping at the bean! For being a major park, I didn't really see any homeless people and the park was well kept. <br><br>I went on a Saturday afternoon, and big mistake. Can't take any nice pictures because it was extremely crowded. So if you want nice pictures in front of the bean, go on a weekday or very early morning.", "pics": null}}, {"review": {"des": "This is a really unique park. The bus line stops right by it and it's not a lot of walking.   It is a big open area so it's not crazy crowded like I expected", "pics": null}}, {"review": {"des": "When you think of Chicago, it's hard not to think of Millennium Park, or the Bean (Cloud Gate), for good reason. It's a hallmark of Chicago that contributes a grounded beauty so central to the city. A green, grassy lawn filled with architectural elements, ice skating rink in the winter, fountain in the summer, children's playground, amphitheater, view of the skyline, walk to the lake shore, it has a little bit of something for everyone. <br><br>The first place you should go if you're in Chicago and haven't been before. And I've been here so many times as a newcomer here, and it hasn't gotten old, and I don't think it ever will.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/wGjhp2CWk93TNqds05q51g/348s.jpg", "caption": "Holiday Christmas tree in the plaza."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/rGLja1oMT0N_66enWCLMwg/168s.jpg", "caption": "Winter ice skating rink."}]}}, {"review": {"des": "The Bean, The Cloud Gate, the outside amphitheater are all fixtures in Millennium Park. Add to that a new rock climbing wall, children's playground, ice skating rink all with a view of the lake shore and you have yourself one of the best parks in the world! I'm from Chicago and I love taking my guests and my family. It's packed but there are private spaces in the garden with benches surrounded by flora that accommodate a few people and there are nooks and crannies everywhere where you can potentially find respite from the droves of locals and tourists in the park. The park continues to grow and I can't wait to see how it evolves over the next few years.<br><br>Not so humbly submitted,<br>Michael C.", "pics": null}}, {"review": {"des": "Not really sure what to say about this place that already hasn't been written. If you're a tourist or a local it's always fun to visit and there is something for everyone. <br><br>The Bean. Good place to take photos with the mirrored finish. Great view of the city skyline behind it. Also cool views of the streets and the L. <br><br>Pritzker Pavilion. I remember that one summer there was this series called edible audible picnic and it was held during lunch time. Shows were always free and it was an awesome experience. Families, students, professional on lunch break, tourists, and the like all stopped to soak it in. Some bigger names like Bill Callahan and Dosh played there. Also the architecture is phenomenal. <br><br>Art Institute. Not technically part of millennium park but close enough. See my review on that place. <br><br>There are constantly changing art installations that are worth seeing. Winter time has an ice skating rink. It's one of those feel-good places that makes you proud to live in contemporary society.", "pics": null}}, {"review": {"des": "Nice area to people watch. Spacious and has the huge Bean! Plenty of picnic tables and benches.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/aO7-SxYWclRA1-kF0r-ZHw/348s.jpg", "caption": "Bean"}]}}, {"review": {"des": "Did a late run and used this as a cool down area. I have been here but never paid much attention to it.  I walked around it and this place is really neat.  Lots to see and do.  Made a few friends wanting nooners during their lunch.  Always a good thing.  Place was really clean and kept up nicely.", "pics": null}}, {"review": {"des": "This park is awesome!! They have miniature golf, rock climbing wall, a full play area for the kids, 2 spray fountains, and they have events.<br><br>I love this park.", "pics": null}}, {"review": {"des": "This park has a lot of activities in the City. The park is famous because of the architecture creation of the bean. A shining sculpture shape like a bean. Some people said is is out of this world. Many has take pictures of their deflection of their mirror image. You also can take the picture with the deflection of the city as a back ground. If you move to bottom center of the bean, you image appear at 3 to 4 time at the bean. <br><br>The park not just offer the bean. It has the Millennium monument with the fountain, restaurant like Park Grill at above the park, The Pritzker Pavilion, Laurie Garden. I can bet you most visitor visit park above but never gone underground city below. If you have been to their tunnel underground, you find shopping and restaurants. The park offer many things including morning exercise at the pavilion. I like the most is the music symphony in the summer. It has many famous song play here.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/R4O-nIvhWEO_r4tmrCizvA/348s.jpg", "caption": "Exercise in the morning"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/KkIoskL_2MFmjx9nq3alBw/168s.jpg", "caption": "Bean image of night city"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Z5S9go_t2snj1dZr8NkYcg/168s.jpg", "caption": "City view"}]}}, {"review": {"des": "Whether you're a visitor to Chicago or a local resident - this is one of the sites you must visit on your trip to the loop. Millennium Park is a joy to walk through both from an aesthetic viewpoint as well as a photography-opportunity viewpoint. Some of the great features include.<br><br>Cloud gate (or the bean): This sculpture really helps to capture Chicago's iconic skyline as well as provide a fun alternative to the traditional selfie.<br><br>Lurie Garden: Beautiful collection of flowers and grasses that bring great beauty to the park.<br><br>Crown fountain: Something about seeing the faces locals along with fountains of spit is oddly entertaining but also a great way to provide a method of cooling off during the summer.<br><br>Boeing galleries: Provide a rotating set of different sculptures throughout the year. This gives it a different character depending on what artwork is installed.<br><br>Nichols bridgeway and BP bridge: Provide a great way to walk around the park and take great pictures away from the street.<br><br>There's other great features in Millenium Park including an ice rink, theater, and performance stage which add to the depth and variety of things to do at this amazing park. Definitely worth a visit if you're in the loop, particularly during the warmer months.", "pics": null}}, {"review": {"des": "It was in early May, 2017, just before Mothers Day.  One of the things I like to see are the Lurie Gardens. The Gardens span 5 acres of perennials that are enclosed within a 15' high \"shoulder\" hedge (Carl Sandburg's \"City of Big Shoulders\" from within his poem). However, the gardens are not as prolific with flowers in May. We only saw tulips, but these displays were very nice. When I first visited the Park some years ago in late July, the gardens were bursting with the beauty of flowers. So if you mainly want to see the Gardens at their peak, go in late-July-early August. <br><br>Of course, the majority of visitors go to the Park to see the famous Cloud Gate, aka the  \"Bean\", designed by Anish Kapoor. It is an architectural wonder, comprised of 168 stainless steel plates, welded together. The Bean looks like liquid mercury, reaching toward the clouds.<br><br>There is intended architectural design throughout the Park, including the famous 50' high double-towers named Crown Fountain. The Fountain depicts the images of randomly-chosen citizens, periodically spitting water out of their mouths. It is supposed to symbolize \"life\" flowing out from them. It's pretty strange IMO. Nevertheless, beautiful, if you approach it knowing the meaning beforehand. <br><br>Also of note is the Jay Pritzer Pavilion, another architectural sky-wonder. It is home to the Grant Park Music Festival and numerous free concerts. The sound system that frames the stage is supported by \"ribbons\" of stainless steel. <br><br>There are so many more items of interest other than the few I've touched upon. If you haven't seen Millennium Park yet, you should go. It was just recently upgraded and remodeled.<br><br>It goes without saying there is a lot of walking. Be sure to wear comfy shoes.<br><br>*****FIVE FABULOUS STARS*****<br><br>57/100", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/YCI9cqgloy1xvgz0N9SzlQ/348s.jpg", "caption": "Cloud Gate or The Bean"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/gxUmWQlqxOdcyqcuRrUVxg/168s.jpg", "caption": "Jay Pritzker Pavilion & additional Lawn Seating"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/4eiwYnDc4oy8Fwm6gfZEZA/168s.jpg", "caption": "Crown Fountain"}]}}, {"review": {"des": "Millennium Park is a staple of the Chicago cityscape. It's such a beautiful living organism with the bustling crowds, extravagant art pieces, and foliage year-round; there's always something cool to see. Just be sure you have plenty of memory open on your phone for the amount of photos you'll be taking.<br><br>Fountains, rock climbing, and go-carts in the summer, ice skating in the winter, flowers in the spring, and concerts and events all throughout the year. Millennium Park can easily be the center piece of the city.", "pics": null}}, {"review": {"des": "This is one of my favorite parks in the world. Whether it's the design, the planning, the art installations, the lawn, there isn't a piece of this park that isn't stunning in its own right and completely picture worthy! This place is totally a gem and each time I come I feel like I discover something that wasn't there before; and either it really wasn't there before OR I just missed it. Come twice, if you can, once during the day and again at sunset. Both views are stunning in their own right. And for all you photographers, you know how much light can change a photo. Trust me, you will want the sunset photos! <br><br>This park is the home of some must sees:<br><br>The Bean (The Cloud Gate) - some people say that it's overrated, but it really isn't! <br>Crown Fountain<br>BP Bridge<br>Buckingham Fountain <br>Boeing Gallery <br><br>Park on the street and walk. Parking in the garage can be a little pricey. AND if you download Chicago's parking app (which I highly recommend) then you can manage your parking without having to go back to the car to extend your time.", "pics": null}}, {"review": {"des": "Tourist-y. I wish I could end it there, but Yelp won't let me. Many, many different people. A few different spots to see. Check out the gift shop, they are extremely polite and helpful. Otherwise, just check out what there is to see before you venture in to the city!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/gwbl1riHS_CEdnHYVOL3kg/348s.jpg", "caption": "This fountain... is trippy. No other words. I dig it. The water fountain from the mouth? Does it get weirder? Love it."}]}}, {"review": {"des": "While in chicago, I had to see the iconic bean. The famous bean that everyone talks about and other various things that can be seen in this area. It's super crowded so definitely come early if you want a picture with less people. <br><br>I do like that it's so reflective and it was larger than I thought it would be. When it's really cold, the bean has this ice glaze over it that makes it look very interesting, but other than that, it's just a bean. <br><br>When my sister and I were in chicago, the women walk was going on and it was super crowded. It all took place at this park and it was truly an interesting sight to see everyone congregate in one place.", "pics": null}}, {"review": {"des": "Beautiful large grassy area downtown chicago<br>Perfect for movies in the park<br>-i recommend bringing your blanket, snacks and wine (its allowed)<br>Parking is steep but a little cheaper if you walk a few min", "pics": null}}, {"review": {"des": "The Bean is one of the most famous sights in Chicago and one that I was looking forward to visiting.<br><br>We came by twice - once around 7:30 am on Saturday after arriving ridiculously early at ORD on a redeye and once in the afternoon on Sunday. My tip after experiencing the park at both times: COME AS EARLY AS YOU CAN! I could not believe how many people were around Sunday afternoon. To be fair, there was a jazz festival going on and it was a long weekend, but still, I was overwhelmed by the crowds and the number of people trying to take pictures. <br><br>I took pics of The Bean from different angles (including selfies of course) but my favorite shot was actually with the buildings behind it reflected on its reflective surface. Check out my shot for some inspiration :) <br><br>The rest of the park was pretty as there were different sculptures to look at as well as the Crown Fountain which is one of the most unique fountains I've seen. Unfortunately when we were there Sunday afternoon it was also ridiculously crowded and it was impossible to get a good shot, but it was great seeing all the kids frolicking in the water.", "pics": null}}, {"review": {"des": "Millennium Park is Chicago's answer to NY's Central Park, Boston Commons, and SF's Golden Gate Park.  I get the honor of being reviewer #1000!  Millennium Park is very walkable, and what I like most besides the gorgeous greenery is all the public art that is scattered throughout.  Then, you get this background of the cityscape, resulting in mixing in nature with modern, urban living.  <br><br>Of course, you get multiple touristy things to see/do in the park:<br><br>1. Cloud Gate - a symbol of Chicago.  Who would have thought a gigantic, reflective stainless steel bean would be the inspiration of so many selfies.  You can enjoy your own image, along with hundreds of others from different angles.<br><br>2. Crown Fountain - Its fun to watch folks play in the water, along with those space-age faces that show up in the displays.  Wait long enough and jets of water will come out and surprise the revelers.<br><br>3. There's also a nice path to the Modern Wing of the Art Institute through the park.  Its less busy than the main entrance on Michigan Ave.<br><br>4. The awesome Pavilion - would be so cool to have a concert or graduation ceremony here.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/5PyUBCKCQTq6NG39m0zjMA/348s.jpg", "caption": "Pubic Art - I think you're supposed to make a barbell squat or deadlift pose.  My bodybuilder friends can comment :)"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/UIlwvDVr6of-qBYX2UCEXA/168s.jpg", "caption": "Public Art"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/y1eHrN-n0IhTHR1EJ23S0g/168s.jpg", "caption": "Public Art"}]}}, {"review": {"des": "It's a nice landmark to take your picture with. It's cool and interesting. The optical effects with all the reflective surfaces make it fun and challenging to take some photos.", "pics": null}}, {"review": {"des": "Chicago has so many beautiful oarks that people can enjoy. The Millennium Park has lots of Art strictures to enjoy and a performance arena. Every time I go  it is always pretty clean considering how many hundreds/thousands if people visit every day! Beautiful surroundings and always some sort of event going on there.", "pics": null}}, {"review": {"des": "New York is famous for her Statue of Liberty, and LA's may be the Hollywood sign. In Chicago? It's a bean.<br><br>Millennium Park is where you will find perhaps Chicago's most famous icon (aside from deep dish of course), the Cloud Gate - or commonly known as \"the Bean\"! However, the Bean is only a part of this amazing park. Here, you will also find some impressive modern art installments like the overarching Jay Pritzker Pavilion and the intriguing Crown Fountain in the midst of beautiful promenades and gardens. Despite its small size in the center of a major city, Millennium Park certainly feels like a world apart from the bustling city!<br><br>Modern cities are often lamented as ugly and depressing, but Chicago is not the case. In fact, the Windy City actually makes herself more beautiful with the very urbanization that deface other great cities through the world. Millennium Park is an example of such, because the organization and the artwork of this park shows that the progress to modernization and efficiency is not always cold and merciless with proper thought and planning, but instead can be beautiful in a humanizing yet efficient manner.<br><br>I think if you can go to only one place in Chicago, Millennium Park is it!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/PpVxT6VNWlv3YPaMuInJDQ/348s.jpg", "caption": "The Pavilion"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Xj6Dk6TOmpivZA4Pjv6mdg/168s.jpg", "caption": "Crown Fountain"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/6xQo8fys0hg4E5QVvWr9Mw/168s.jpg", "caption": "Cloud Gate aka the Bean"}]}}, {"review": {"des": "The bean! Defintely one of the biggest tourist traps in Chicago and it's actually pretty neat. I was fortunate enough to experience the bean when it snowed a rather perfect amount. The atmosphere was beautiful with the snow blanketing the surrounding. It's pretty interesting to stand in the middle of it and stare into the oddly shaped design. The reflections are pretty trippy to say the least.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/xesAns4hDhKj-sLXbVllSw/348s.jpg", "caption": "The bean."}]}}, {"review": {"des": "Millennium Park is a must if you're in downtown Chicago, preferably on a warm sunny day.  You walk around, see all the sites, visit The Bean, grab an ice cream, let your kids splash around in the water fountain play area.  Just a fun, relaxing time in an otherwise busy city.", "pics": null}}, {"review": {"des": "Very pretty, clean and not too crowded. The Cloud Bean and water picture towers were cool. Lurie Gardens were pretty to walk through. Doesn't take much time to get through", "pics": null}}, {"review": {"des": "What a great park just off the Miracle Mile in Chicago.  Everyone of course knows this place because of 'The Bean', a beautiful chrome sculpture by Anish Kapoor, and officially called 'Cloud Gate'.  It is a wonderful piece to photograph and observe as the reflections of the skyline and people are truly unique.  It is worth coming here simply for this piece alone.  There are other items of interest here however along with some simple green space.  During winter, they have ice skating available and a beautiful Christmas Tree lit up as well.  It's a great part of the city and a must see if you come to Chicago!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Lfg5ecVD2SuVr3_r75gTIg/348s.jpg", "caption": "Cloud Gate Skyline"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/_XVLNrXD0NgpSkuQ-jmtjw/168s.jpg", "caption": "Cloud Gate - Christmas Tree"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ETR_JRlA9eNnDlFiBYGnhw/168s.jpg", "caption": "Cloud Gate"}]}}, {"review": {"des": "Amazing pubLic park Located in Downtown Chicago.<br><br>This is THE spot to hit up if you're on that tourist mindset.<br>That being said, this pLace gets super busy [at aLL hours of the day] so be patient whiLe navigate the park and taking pictures.<br><br>MiLLennium Park is the gateway to CLoud Gate (aka: The Bean), Lurie Garden, The Great Lawn|Pritzker PaviLLion, and Crown Fountain.<br>As if this wasn't enough excitement for you, the BP Bridge is here to connect you from MiLLennium Park to Maggie DaLey Park.<br><br>I am definiteLy a fan & I can guarantee you wiLL be one too! Come through to have a nice snack|meaL, curL up under a tree to catch up on a book, take the most amazing photos, or simpLy bike|jog around the park-  there is something for visitors of aLL ages to enjoy.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/DoE8vlqf1zHDflbliBV8xg/168s.jpg", "caption": "Great Lawn|Pritzker PaviLLion"}]}}, {"review": {"des": "It seems I neglected to review Millennium Park on my last visit to Chicago. It's pretty sweet, and right next to Grant Park, forming a giant park that reminds me of Central Park in NYC.<br><br>It's built on top of an underground parking garage, which makes getting to it pretty convenient. But it also has access to plenty of Chicago's bike share stations.<br><br>Lots of different people congregate at this park. I've seen a live orchestra play in the summer heat at the Jay Pritzker Pavilion as well as street performers by the fountain in Wrigley Square. There are also the Lurie Gardens and a bridge connecting to Grant Park. But the two most popular attractions are the likely Cloud Gate sculpture and the Crown Fountains. <br><br>The Cloud Gate sculpture is pretty much a shiny, giant, metal bean. I have no idea why they chose to make it but you can walk underneath it and it looks really cool. It's also a required social media post, to prove you're in Chicago. <br><br>The Crown Fountains are two walls with screens that display faces. They cascade water down the sides where people (mostly kids and immature adults like me) can play. Occasionally, the faces on the fountains open up and start spitting water.  And I like to joke that they spit and don't swallow.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/eYkOXxmRp1SsB6d6VA50nQ/348s.jpg", "caption": "Wrigley Square fountain"}]}}, {"review": {"des": "This one is over rated. Was born in chicago only went twice . biggest but not the best part of park is the bean.<br>It not that great just big if i had to take a guess about 8 by 7 feet. Ice skating in winter only if weather allows .", "pics": null}}, {"review": {"des": "This is a really busy park and it includes the \"bean\" which is something that young people really enjoy on a visit to Chicago. I was walking though on July 4th and it was getting rather crowded with people and seemed to be the place to visit! It is very transit accessible and the walking paths are excellent as well. I liked the art and the interesting people watching that was present here.", "pics": null}}, {"review": {"des": "If you can't see the amazing beauty and variety of uses that the City has created for the public (yes, on our tax dollar, but...) then I don't know you. <br><br>Sure, there are great parks spaces elsewhere along the Lakefront and in the City, I love 'em all! But Millennium Park is the crown jewel. Whether I'm skating there in the winter or enjoying a cool drink at the cafe in the summer, having a picnic with my hubby during a concert at the Pritzker or putting my toesies in the stream at the lurie garden- you can't beat Millennium Park (for Chicago parks)! MP ftw", "pics": null}}, {"review": {"des": "Amazing park right on Lame Michigan. Beautiful open green space, and absolutely lovely to walk through. <br><br>There's a rock wall, a mini golf course, and 'the Bean' can be found in this park. There's nothing like this in Boston, so it was a real treat to visit.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/OmfcF1wrm8G9KzNnJa-0rQ/348s.jpg", "caption": "Water fountain"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/KiME7TKdTxAVtuBYqz9-rg/168s.jpg", "caption": "Water fountain on the edge of the park."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/A4GuBci3onLlIKG1owuV2A/168s.jpg", "caption": "The Bean"}]}}, {"review": {"des": "I love Millennium Park. I love the free events, the architecture, the views, and everything about it. <br>Millennium Park is a great place to visit year round. In the fall you can see the beautiful leaves transform the area. In the winter, there's the ice skating rink with free admission, but pricey skate rentals. In the spring, you get to see the gardens bloom and trees awaken. And in the summer, you have some of the best free Chicago programming available. There are usually a few alcohol vendors available, and always lots of people bringing their own to enjoy while watching an orchestra performance, or an Oscar-winning movie.<br><br>If you're going to a free movie, concert, or the performance of Wait Wait Don't Tell Me, I recommend that you get there EARLY. These events have been over capacity this past year, and it's definitely a bummer arriving too late and having to turn back.", "pics": null}}, {"review": {"des": "A gorgeous public venue that you could cynically describe as being a subset of Grant Park incorporating everything that lies north of the Art Institute, Millennium Park is appropriately called the \"front lawn\" of Chicago for good reason. <br><br>In particular, the bean sculpture, or \"Cloud Gate,\" reflects the surrounding skyline beautifully, and alongside other nearby features like the concert pavilion and skating rink, serves as a gateway from the wall of buildings along Michigan Avenue towards the lakefront. There are ample paths and spaces for folks to stroll and relax, as well as gardens, fountains, and art installations. There's even a beer garden serving Chicago's own Goose Island beer.<br><br>Worth a visit not just for the bean, but for all its other amenities, as well as for a pleasant walk if you're on your way to the museums further south.", "pics": null}}, {"review": {"des": "So nice to be surrounded by greenery in the middle of the city. Tulips were everywhere when I visited this spring! This is a very well kept up park, lots of locals and tourists alike. <br>Pritzker Music Pavilion is huge, I wasn't able to attend an event here, but it looked like an amazing spot for concerts in the summer. As always, lots of people around the Bean/Cloud Gate taking selfies. The park is close by the bus and train line and a nice place to walk through to/from the Art Institute of Chicago.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Zi15vogxQvWtHCFl7dvTGQ/348s.jpg", "caption": "The bean!"}]}}, {"review": {"des": "Must see when in Chicago. Been here several times but still enjoy visiting millennium park. Lots to do and explore! My 9 year old loved this place.", "pics": null}}, {"review": {"des": "The Bean! And lots of other cool things to explore. No trip to Chicago would be complete without walking around the bean aka \"cloud gate\".... people watching taking their selfies is half the fun, enjoy!", "pics": null}}, {"review": {"des": "I've been going to Millennium Park for many years as most of my jobs have been within walking distance of it. I always enjoy sitting there at lunch time with my book either sitting in the garden (which is my favorite) or by the water. In the summer, there are a ton of visitors to the park. They have free events throughout the year like concerts on the lawn and a tree lighting for the holidays. The park is huge with lots of different activities: the bean, the faces with water, a garden, walking paths, it's just a great place to spend a few hours on a sunny day!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/LQM8aGWkOZbIXVX5vwr0Rg/348s.jpg", "caption": "flowers in the garden (2017)"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/APJxztxPVNGsOKJzOvg_jQ/168s.jpg", "caption": "picnic area (2007)"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/_82uGQcQ9Za5yFysThsTNg/168s.jpg", "caption": "guy on stilts in the park (2007)"}]}}, {"review": {"des": "When you think of Chicago, you think of Cloud Gate aka The Bean. My first time in Chicago, so automatically that was the first destination. Luckily, today it was also snowing so it was a beautiful scene to see with Chicago's high buildings in the background it was a great photo op.", "pics": null}}, {"review": {"des": "The fact that we were told to leave with our dog put a damper on things. While I understand, we were traveling and thought it would be fun to get a picture at the bean with our dog. Otherwise a great and large green space in the middle of a giant city.", "pics": null}}, {"review": {"des": "BEAUTIFUL park. I know that Chicago is known for the bean and many visit this park for that reason but there is so much more to explore at this park. I was lucky to visit in the month of May when the weather was perfect. I can imagine that visiting this park during the winter may be a NO. However my experience was well. One that I'll remember and will recommend to anyone not from Chicago that like outdoors, flowers and exercise...... go to this park.", "pics": null}}, {"review": {"des": "HOW YOU BEAN?<br><br>I honestly enjoyed the view of the fountain at night more than anything here. The sound and lights were so beautiful and so calming.<br><br>The bean is overrated. We went once at night to get photos and it was crowded like crazy. We went again at 4am on a Monday morning and there was only 1 other person. It's ridiculous to have to go so early to get a decent photo. Some tourists stand on the table to get a decent photo of the bean. I'm glad there are staff members always near the bean to keep these people in check. <br><br>This park is great for Pokemon. Many stops and gyms. There was a concert going on the first night we visited. Located right near the new Nutella restaurant. <br><br>If you go to this park, I recommend stopping by the fountain at night and just sitting or laying there for a while. It's very nice. (If you go in the morning, be mindful of the homeless nearby. Try not to wake them up!)", "pics": null}}, {"review": {"des": "This place is just amazing! The architecture around it is just breathtaking. My wife love ves taking pictures here and there is always something to do. If we had kids they would definitely enjoy this place a lot. In the meantime my wife and I love coming here for walks, picnics, and just to get away from the hustle and bustle of the daily busy city lifestyle. <br><br>Right across from this park there are a lot of places to choose from for a cup of coffee (Peet's Coffee) pizza there is Giordano's, you name it you can find just about anything near by. <br><br>There is something for everyone. Of course you cannot forget the incredible art (The Magic Bean) The Ray Pritzker Pavillion, and there is a food court right below the Magic Bean.", "pics": null}}, {"review": {"des": "A must see while in Chicago. Be prepared, there are tons of tourists everywhere, but the crowd is never too full. Charge your camera before coming, you'll want to take a good deal off photos in various locations. In Chicago, this goes without saying, but perfect hair for pictures won't happen and that's just fine with me!", "pics": null}}, {"review": {"des": "It's like going to NYC and not seeing the Statue of Liberty- this is a tourist just. It's usually pretty crowded so you might want to go super early to avoid the crowds and get a good picture. The park has the cloud gate (aka the bean)! There are restaurants near the bean where you can stop and enjoy the view, or you can walk somewhere across the park and go to a rooftop bar. Sometimes there are festivals or performers here- this area is usually super lively and nice to just walk through.", "pics": null}}, {"review": {"des": "This is a must see tourist spot when visiting Chicago. The best part is it's free, minus the parking garage. The park is kept clean and there is plenty of space to explore. Walk down to \"The Bean\" aka Cloud Gate and take a picture of your reflection off that awesome piece of art.", "pics": null}}, {"review": {"des": "There's a really good chance you are in this park because of the Giant Jelly Bean (formally known as Cloud Gate). Or it's because of the park's proximity to the high rise buildings. Or you're just passing by as you walk to work / go to training for work. <br><br>I love how the city of Chicago is often a juxtaposition of modern (all the buildings and urban life) and nature (expansive parks and patches of flora and fauna). Millennium Park is no exception, especially with its location and attractions. I found myself walking through here to see the Bean, the Millennium Monument, and the Crown Fountain. If you have limited time in Chicago, walking through this park is a quick way to see some sights and enjoy nature. Plus, you get some nice Instagram pictures with the Bean. At night, it's a good spot to enjoy the lights from the buildings (though not the only good spot to do so). During my last visit, I was surprised and delighted to find the park growing tomatoes near the stairs!", "pics": null}}, {"review": {"des": "This park is so average- I can't explain why every tourist visits it almost every time they're in Chicago. (I'm guilty, too). I do enjoy this park in the Summer, especially the creepy art installations that spew water from face portraits. After seeing the Bean a few times I am pretty sick of it, but most people really enjoy it their first time.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/H1QtXdEMjEjaI5SGlneNfg/348s.jpg", "caption": "This installation is way better than the Bean!"}]}}, {"review": {"des": "What can I say? The beauty of this park speaks for itself. Something is always happening at this park. <br>First time I went to millennium park is was for The November Project, which is a workout group held every Friday at 6am. Amazing support group, friendly and fun!", "pics": null}}, {"review": {"des": "Screw Boston. <br><br>I have no shame in saying that I would choose this park over the Boston Common any day: it's cleaner, greener, and I didn't find a single syringe, drug dealer, or miscreant telling me I have a nice butt. Oh, Chicago you are doing something right.<br><br>We had a couple of hours to kill before our flight home and I was adamant that I wanted to see the Bean, Cloud Gate as it is actually named (see profile pictures!). If you are going to the Bean, leave extra time! It is touristy and it can take awhile to get close enough for a picture as there are typically hundreds of people milling around with the same goal. Be patient! Also good to note: people are really friendly and willing to take your picture if you ask them. I think I was asked about eight times.<br><br> Everything about this park is amazing: the steps up to the sculpture are litter-free and spacious enough to walk up with the crowd. The Jay Pritzker Pavilion was a something to see! Nobody was playing when we walked through but that didn't take away from its appeal. It was a tranquil field of green and it was interesting in contrast to the bustling city. Lots of people were sitting at the Crown Fountain, dipping their feet and cooling off. We also visited the Lurie Garden, an urban garden full of 222 types of plants including grasses, trees, shrubs, bulbs, and perennial herbaceous plants. <br><br>If you are visiting Chicago, this HAS to be on your list of things to do. It's free, it's beautiful, and it's across the street from the Chicago Lakefront Trail so you can walk along Lake Michigan and see the boats.", "pics": null}}, {"review": {"des": "Millennium Park is an outdoor art exhibit and a path to fun! One of my favorite places to go in the city. Be sure to grab a self tour guide so you don't miss a sight (the Boeing Gallery South has been taken out though) and learn a little bit of history on each piece. My daughter also loves<br>going to the park because of the Crown Fountains waterfall gives her a moment to indulge in fun and get her feet wet. Overall a great attraction in the city to explore or go on a family adventure.", "pics": null}}, {"review": {"des": "Millenium Park is an all inclusive and accessible, family friendly park with exposure to nature, architecture, brilliant art and lively music venues. I saw so many kinds of people of all ages enjoying their time out at the park.  After a long day of school and work I found myself enjoying the peace of the self guided tour while walking along viewing the sites. My nephew and I happen to go together, and although he couldn't quite appreciate the brilliance of the Jay Pritzker Pavilion or Exelon Pavilion, he still enjoyed running around the interactive garden at the Crowne Fountain.", "pics": null}}]}