{"name": "mindys-hot-chocolate-chicago-2", "reviews": [{"review": {"des": "Mindys! Always a great time!!<br>First time there for brunch, very pleased!<br>Avocado toast was very tasty!<br>And the pumpkin spice hot chocolate was perfect!<br>Wish they used the bigger cups like they use to and looks like they cut back on the marshmallow size too, unfortunately.", "pics": null}}, {"review": {"des": "I was really looking forward to going to Mindy's. Most of our experience was just fantastic. Our server Brandi was excellent. My date and I were distracted from ordering at each turn and she came by just often enough and was understanding until we figured out what we wanted. I had a lovely glass of red and my date had a cocktail. The octopus with creamy polenta was delicious and even my date who doesn't like octopus all that much enjoyed it. The Mexican hot chocolate was decadent and beautifully spicy although I wish I had had more time to enjoy it. <br><br>Here comes the 4 star part. Let me preface this with: I have been in the service industry for near 17 years in all different kinds a of establishments. Mindy's closes at 10pm the night we were there. At 10pm sharp, with dessert in front of us, one of the staff came around and started clearing tables including our water glasses. By 10 15 he was flipping chairs. Never have I worked someplace where this is appropriate. Now, we were having the nicest time and isn't that what you want in your establishment? I looked around, concerned we were keeping staff from leaving but noticed that neither the front nor back of house looked close to being finished with closing things down so I thought it would be fine if we finished our very heavy hot chocolate (not something you just want to throw back). At 10 20 the aforementioned employee came the table next to us. The girls there each had half a glass of champagne and hot chocolate in front of them. He asked if he could clear anything. They said no and they were still working on things. He then asked if they needed a to go cup. I was shocked. I've never witnessed a more blatant gtfo except at 2am when you legally must leave a bar. <br><br>Like I said, I work in restaurants and this just seemed so incredibly rude. Of course no one wants to work after the sign says you're closed but that's the job. Let people leave high on the service and atmosphere they've enjoyed in your establishment rather than feeling forcibly pushed out and leaving before finishing what they've ordered. It wouldn't have taken much at all to say \"No rush (an acceptable industry lie), but just so you know we close at 10 o'clock.\" Would have given us all the nudge you intended and maybe we needed without being inconsiderate and pushy.  <br><br>I'll go back, looking forward to trying more of the menu, but unfortunately with this sour memory.", "pics": null}}, {"review": {"des": "I am convinced that the classic mac and cheese is not real mac and cheese, but the memory of the first time you ever had mac and cheese as a child, revisited in your adult life without disappointment. Therefore, this restaurant cannot be real. It is a sick and twisted fantasy of what food should be when you had it the first time. When you go to Mindy's Hot Chocolate and order the hot chocolate, you think, \"oh I like hot chocolate, I'll order that.\" But when you drink it, it becomes the memory of hot chocolate in your mind, forever.<br><br>What a cruel, cruel world this is.<br>At least we have Mindy's Hot Chocolate.", "pics": null}}, {"review": {"des": "My husband took me here for my birthday and it was a lovely time. We went on a Saturday morning, and with a reservation, were in pretty quickly. I had a salad and it was quite succulent. I also tried the hot chocolate (although it was summer) and it was VERY rich and sweet. Great place for chocolate lovers, I was only able to drink some of the drink as it is very heavy (and tasty)! Food was delicious and service was amazing. I would recommend making a reservation before going. Also, there is street parking around if you drive and its close to public transportation.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/qgTJmnpq2eDMBe-5U9bmLw/348s.jpg", "caption": "Famous hot chocolate (even on a summer day) and coffee!!!!"}]}}, {"review": {"des": "The hot chocolate here (as you would imagine) rocked my socks. Wow. So rich and creamy. Although I could have gotten one half the size. The homemade marshmallows were top notch and you can get extra if you want more. You can also buy the hot chocolate by the bag for at home. Dark, medium (milk chocolate with some dark) and Mexican which had spice in it. They have a few others and you can spike it too. <br><br>But THE FOOD!! Wow. It was so hard to pick from the menu. I ended up getting the chicken thighs ( with perfectly crispy skin), sweet potato, spetzel and a mushroom chicken jus <br><br>My server had a bit of a resting mean face and seemed really fake in her niceness but the meal was amazing so I was happy :)", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ub4Tz1IzjtGCDGCdegdluQ/168s.jpg", "caption": "Dessert looks amazing!"}]}}, {"review": {"des": "I had such high hopes for this place but it did not meet my expectation. We went on a Sunday around 11am for brunch without reservations and the wait was 1.5 hours for a table and no wait for the bar. We of course sat at the bar but if you're with a larger party make reservations or try to avoid peak times. We had a simple order, medium hot chocolate and avocado toast. <br><br>The hot chocolate was good but not $8 worth. There as nothing about it that makes me want it again. I can get something similar somewhere else for a lot cheap. The marshmallow was probably the better part of the hot chocolate. It was very light and not overly sweet.<br><br>The avocado toast was also good but could use some adjustments. First of all, you get an entire avocado sliced on top of two very thin pieces of toast. The avocado to toast ratio didn't work. There was so much avocado on the toast that you barely felt like you were eating any toast. I had a really hard time even picking it up and taking a bite out of it. My toast was also slightly burnt so that make it hard to cut and/or bite. The honey ricotta and pistachios were the perfect amount and went so well with the avocado. I did wish I had a little more ricotta. My suggestions would be to have a thicker toast or have less avocado. <br><br>I wouldn't say we didn't' like this place but we also didn't love it. I would maybe try it again if I'm in the area.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ueMKl3S0J-eQ7Xwq5J_-oQ/348s.jpg", "caption": "Avocado Toast"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/KeE-ftCkn9sT8dcevsf53A/168s.jpg", "caption": "Side Potatoes"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/YfBnn516kkU94O2iWCp6Rg/168s.jpg", "caption": "Medium Hot Chocolate"}]}}, {"review": {"des": "James Beard Foundation Award for \"Outstanding Pastry Chef\" alert. What an honor it is to finally try this place out! Yes, I'll add to the comments; there is always a wait. We waited 40 minutes on a Saturday around 11:00AM. The dessert is out of this world here. The food is average. When a restaurant is this well known and prestigious, where do you start? Their namesake. We ordered the:<br><br>-Old Fashioned Hot Chocolate- Iced! $11(paper straw-- yay, medium hot chocolate, whipped granache, sugary marshmallow) So glad we ordered this. The FANCIEST hot chocolate I have ever had! I don't care for chocolate, and I thought that this was a real treat! Creamy, thick, and a true comfort food (errr- drink).<br>-Ratatouille Hash $16 (Zucchini, Charred onions, cherry tomatoes, eggplant, bell peppers, potatoes, sunny side egg). Underwhelming tomato flavor with a soft, mushy texture. I wish I would have ordered the Southern Benedict or the quiche. <br>-Brioche French Toast $14. You can't really go wrong with french toast at an upscale restaurant. It was very sweet with a creamy texture. Comes with breakfast sausage that had a kick to it. Worth the $14.<br><br>I would love to come back here for a dessert date. It's the #1 place for indulging in your sweet tooth! Love you, Mindy!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/utKGliPJi2onv2-uPHamzA/168s.jpg", "caption": "Old Fashioned Hot Chocolate - Iced!"}]}}, {"review": {"des": "Went to Mindy's last night and grabbed a seat at the bar by myself. I asked the bartender what was popular, and she gave my great suggestions. I ended up going with the octopus and the burger. The octopus was not quite what I was expecting in that it was large tentacles. This is different than how it's been prepared for me in the past. It took me a minute to get over this, but then there were cheese grits (one of my absolute favorite foods) in the dish and I got over it quickly. The octopus itself has a great flavor, and it's cooked in a way that really just give it the perfect texture. <br><br>Now for the burger. I came in being told that this was supposed to be one of the best burgers in the city, so I went the whole nine yards. Got bacon and egg on top of the cheddar cheese that comes with it, and the sesame seed bun. My high expectations of the burger were exceeded and I can say it's definitely one of the better burgers I have eaten. What was great was the homemade chips that accompanied the burger, I couldn't get enough of them even though I was full! <br><br>What a fabulous spot to have within walking distance, I will definitely be returning. Yea", "pics": null}}, {"review": {"des": "Do not avoid this places. Mindy's Hot chocolate has some of the best food and hot chocolate in the city, this place is truly unique. <br><br>I had the boozy (mint chocolate and a shot of rum) lord...and that marshmallow......I wish I had more.<br><br>I also had a granola parfait, which had fresh fruit and amazing granola<br><br>The brisket Benedict biscuit was amazing so light and fluffy the whole thing just melts in your mouth <br><br>Can't wait to visit again.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ECcbu5RvCuDAZYFZpNx5_g/348s.jpg", "caption": "Brisket Benedict"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/8RbZOcjVUxZlDXuoCL3S8w/168s.jpg", "caption": "Granola parfait"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/PKu-PLFmlHn-F1x0b7E5ow/168s.jpg", "caption": "The boozy  (mint chocolate and rum)"}]}}, {"review": {"des": "Saturday evening had a 2 hour wait...... came back Sunday and was seated right away :) I didn't have much expectations, I mean, how good can hot chocolate get? YOU CAN GET IT GOOD *drooling over my keyboard* I tried both the regular hot chocolate and the dark. Both are fantastic, but I preferred dark, that dark chocolates are usually my preferences. It is creamy and rich and buttery and chocolaty *drooling again* I was eager to buy a package to go to bring home for my family members. They too, were so pleased. I cannot wait to come back in town to visit and buy more! The only food I was able to try was the grilled octopus, very delicious too. I would have to come back for a full meal sometime, and I look very forward to it.", "pics": null}}, {"review": {"des": "A favorite of mine to give visiting friends a taste of chicago. Mindy's stands on a street lined with hip stores at the heart of Wicker Park, making the restaurant a perfect place to grab meal without losing much time for adventuring.<br><br>An episode on Netflix's Sugar Rush brought Mindy's to my attention. A James Beard Awardee for pastries!? Count me in! The desserts changes seasonally, but every time there is always something on the menu that wows me. As of this review, the poached pear dessert I had is sweet but not overly, moist but balanced with crunch and topped with a bold, creamy cheese cake ice cream. I think the description fits many of their other dessert offerings - complex, balanced and just plain satisfying for any sweet tooth. I am personally not a fan of the hot chocolate as it is a bit too sweet for me, thus I recommend jumping to the menu that won them the award.<br><br>Although I rave the dessert, the food is just outstanding. I will stand by their elevated take on chicken and waffle! One of the best I have had.<br><br>Overall, Mindy's have earned a spot on what defines Chicago cuisine experience for me.", "pics": null}}, {"review": {"des": "My hot chocolate was amazing. The best I've ever had. I was excited by the chocolate focus and ther pictures looked great. I enjoyed my experience and meal. My sea bass was very salty however. Also the hostess asked us to get up because she had a reservation. Those would be my only complaints.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/e4HBlptWyLZVm0L0qlvGpw/168s.jpg", "caption": "Sea Bass"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/MvtlZ5xSEikbuTH-xNkT2A/168s.jpg", "caption": "Burrata"}]}}, {"review": {"des": "The name speaks for itself: it's the best hot chocolate I've ever had on the street. I'm veeery picky when it comes to hot chocolate, and this one's perfect. I wouldn't order the one with ganache - the ganache is basically chocolate flavored whipped cream -but apart from that it's perfect. Would've had another one had I any space left!<br><br>The food is also a winner, everything was great, fresh and super tasty. I had the poached eggs with sourdough bread, sausage (amazing) and potatoes. It didn't take very long to arrive and was absolutely amazing.<br><br>Only downside was the waiting line. Since I was by myself, it was easy to find 1 spot at the bar, but the 2-3 pax groups I saw come in had a 1:30h waiting line (around 11am). If you have time to spare, I recommend putting your name on the list and taking a walk around the neighborhood, which is super nice.", "pics": null}}, {"review": {"des": "Am visiting from Los Angeles and read about this place in food blogs so really excited to try it. Got the hot chocolate. Agree with other reviewers that the marshmallows are great. The hot chocolate is super decadent! It's very good but literary so rich that you feel you are drinking pure melted chocolate with little dairy. Something with so much richness and sugar that after drinking it you might feel sick. <br>The reason I gave 3 stars is purely the price. $13 for a cup of hot chocolate??!!! I've never had something so expensive. Personally I feel I would have rather they sold me a mini for $5 as we got the Mac and cheese and the hot cocoa was more money. Plus we did the $3 split so it was $16 for hit chocolate. In LA they have something very close at Ladurée and it costs- $5.", "pics": null}}, {"review": {"des": "Do the hot chocolate thing...if your crazy include a shot which is an extra $5 and that brings your drink to a whopping $16!! But don't waste your money on any of the deserts. It was a huge disappointment.", "pics": null}}, {"review": {"des": "Once again, I fell for the hype... The spaghetti squash salad was sad, flavorless, and definitely not worth $14, while both the pumpkin hot chocolate and port wine poached pear split were overly sweet. I was expecting the hot chocolate to taste more refined, but received a creamy version of what you'd find at a local Dunkin' Donuts. The ice cream overshadowed the subtle taste of the poached pears, and could not be saved by the bitterness of the chocolate. My companion only ordered the chicken soup and described it as \"spicy and delicious\", so at least one of us left satisfied. This place is PACKED on a Saturday night, so be prepared for an extended wait in an incredibly cramped area.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/QhjgVbmJexbtfTg_4Lnghw/348s.jpg", "caption": "Pumpkin Hot Chocolate w/ House-Made Marshmallows"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/omrSHBnZftDtJr-3ztpgyA/168s.jpg", "caption": "Spaghetti Squash Salad w/ Roasted Butternut and Spaghetti Squash, Tuscan Kale, Pepitas, Pecorino Romano, & Brown Butter Vinaigrette"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/EcXx1VQsghaK98QDwvDUHA/168s.jpg", "caption": "Port Wine Poached Pear Split w/ Graham Cracker Cookie Dough-Cheesecake Ice Cream, Honey Butter Scotch, & Seeded Bitter Chocolate Brittle"}]}}, {"review": {"des": "What a cute little place for a sweet snack! <br><br>Came here on a Saturday around 5pm. We had originally planned to come here for an early dinner, but after checking out the menu, it is evident this places true star power is within its dessert and hot chocolate drink selection. They do have regular food entrees, but the menu is quite limited and doesn't have the selection that you'll find at any other place in the Wicker Park area. <br><br>I had a lemon hot chocolate which sounds absolutely god awful on paper but was simply amazing in real life. It tasted like I was drinking an actual piece of lemon pound cake. Our server was extremely friendly and the vibe in the place was very positive. They have a good deal of vegetarian options for those who subscribe to that diet as well. No wifi here, that I could tell.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/xkDOlyYRxCBTmUIovugKjw/348s.jpg", "caption": "Looks at that amazing marshmallow! It was coated in something, maybe sugar or coconut flakes!"}]}}, {"review": {"des": "Mac & cheese was good, the donuts were basic.; Nothing mind-blowing about it. I had the chicken & waffles - the Sriracha syrup gave it a kick. The chicken had the right amount of crunchy to it. I really came to check out the hot chocolate. I ordered the pumpkin spice. It was delicious but the $8 price for it was appalling. I'm glad I came to try it out but it will definitely be a one time visit", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/mFO9FSIFJJobIHCqPNjVBw/168s.jpg", "caption": "Pumpkin spice"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/KupNVI8UddTNBSjHdRzRrA/168s.jpg", "caption": "Chicken & waffles"}]}}, {"review": {"des": "If I could give Mindy's more stars I would - disclaimer though: I only had the hot chocolate and a cookie and didn't sit down for an actual meal.<br><br>The hot chocolate was sooooo good. It's a bit pricey but is very delicious. I had the seasonal flavor which has a bit of butterscotch in it and adds a bit of a richer taste to it. The homemade marshmallows were the highlight though - they're super soft and get almost caramelized by the hot chocolate. I'd recommend ordering extra marshmallows with your drink!", "pics": null}}, {"review": {"des": "I just had the most amazing dinner here. <br>After a terrible Uber ride through Chicago's traffic I was not feeling it and had a terrible headache, as soon as I came in the staff was just so welcoming. I ended up sitting at the bar near the kitchen were I could see all the action.<br>I order the octopus and pickeld radish and it was delicious, crispy on the outside and soft on the inside. The pickled radish was a nice surprise with that plate.<br>But what I really REALLY want to recommend is the apple bread pudding. This one is so airy, fluffy and full of flavor, it is also served with caramelized apples and streusel on the top with a warm salted caramel sauce that is to die for. I went all in and asked the chef to accompany that with whatever ice ceam they felt right and OMG what a surprise! I got a chuncky snickerdoodle ice cream to top off my bread pudding. Best decision ever!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/iMGIq3WB7d-6Sp18wdROcw/168s.jpg", "caption": "Octopus and radishes"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/S20hX4kVycjc5fPQqwKzsw/168s.jpg", "caption": "Apples!"}]}}, {"review": {"des": "I will have to come here and try the food.  This review is solely based on a hot chocolate order.  We came in to keep warm, they were packed so we sat by the door waiting for my daughter's $9 hot chocolate (with tax).  They unfortunately have a cookie display box where you can take cookies to go and my very quick toddler got her hands on one .. *sigh* another $3 for a gourmet cookie that I am sure my toddler loved since she ate it in 4 bites, but wouldn't have known the difference from a Mrs. Field's snickerdoodle that is twice the size and cheaper vs. a Mindy snickerdoodle ...  anyway, got the $9 hot chocolate and my 8 year old daughter took two sips and said it was too sweet.  I didn't try it because I don't eat sweets either, if I need sugar I use stevia so I knew it would be too sweet for me.  My husband tried it and he could barely drink it as well.  My 3 year old seems to be the only one in the family with a sweet tooth.  I am sure the food here is good, but if my daughter can't drink hot chocolate from here, I will definitely not order that again :(", "pics": null}}, {"review": {"des": "They really make good hot chocolates, its not like the ones with fake cacao, but feels like melted chocolate. We ordered both 'dark hot chocolate, and medium one' i'd highly recommend the dark one. It comes with marshmallow. We also ordered some ice cream, it was good also. The only negative thing was the service, i both didn't like the host who welcomed us, and the servers were all had serious faces, not super polite, just some random guys that are doing their jobs. It's a romantic place but a bit loud. Would i go again? Maybe, if i crave for hot chocolate!", "pics": null}}, {"review": {"des": "​This place is bustling with a cool, trendy vibe. My friend and I opted to be seated at the bar so that we could be served immediately since I was only there for dessert. However, I did see a few patrons' savory dishes and they looked exquisite! <br><br>I really wanted to try the Butterscotch Hot Chocolate which is made with half caramelized Belgian white chocolate and half French milk chocolate, along with house-made​ butterscotch, but I was already full from dinner earlier and also didn't feel like spending $8 for it. In retrospect, perhaps I should have gotten it but I think it would have been too much. <br><br>I narrowed down my choices to two: Chocolate Pie or Coffee Tres Leches. I decided on the Chocolate Pie, which consisted of chocolate pie with graham cracker crust, chocolate sorbet on top of the pie, whipped hot chocolate and toasted marshmallow. Sort of like a deconstructed S'mores in a sense. It was absolutely delectable! The chocolate pie was incredibly rich, packed with amazing chocolate flavor and the graham cracker crust complemented it really well. The sorbet was smooth, creamy, refreshing and the chocolate glaze added to the delicious-ness of the dessert. The marshmallow was nicely gooey and tasted wonderful with the pie. All the ingredients came together perfectly and I thoroughly enjoyed it all. <br><br>The bartender was really nice and made himself readily available throughout the time we were there. I would definitely come back to try the hot chocolate.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/7-GiS5jDzJJhv-grSx4PSQ/168s.jpg", "caption": "Chocolate pie, toasted marshmallow & chocolate sorbet  - Delicious!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/VL-_4kd8anpmyeLCrNa8KA/168s.jpg", "caption": "Chocolate pie, toasted marshmallow & chocolate sorbet"}]}}, {"review": {"des": "I came here on a whim and had so much fun! The restaurant has a roomy yet rustic cozy atmosphere. <br><br>We did desserts and it was all great! We had several hot chocolates and  they all had great flavor and were so rich! I have never had hot chocolate so rich before. I had the medium milk chocolate which I really liked but I would definitely come back and try another flavor. For our desserts, we split the donuts and cookies. Both the donuts and cookies were tasty and we ate through them slowly with our hot chocolates. The cookies are baked fresh daily so I think you get something different everyday which makes it fun! <br><br>If you do not want to do dinner, this is also a great place to just sit with a nice mug of rich hot cocoa and share a dessert or two. I will be bank for brunch as I have heard the brunch is pretty good.", "pics": null}}, {"review": {"des": "Tried the coffee frozen nought dessert, looks messy but taste really good. They change the menu always and I like how they come up with new and unique desserts", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/OsVqtZslcVUB3UPFiw6YlQ/168s.jpg", "caption": "Milk hot chocolate with shot of espresso"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/GQ5ua-QNIqrNs8uzQRO02g/168s.jpg", "caption": "Frozen coffee nought"}]}}, {"review": {"des": "One of the most exciting things about working in Wicker Park is the overabundance of food options. Mindy's has been on my radar for years and one night after work, a few coworkers and I decided to try this spot out! <br><br>Why did I wait so long?!?!? <br><br>This place is phenomenal! I haven't had such delicious hot chocolate since my trip to Angelina's in Paris! I had the Mexican Hot Chocolate which was the perfect blend of milk and dark chocolate with hints of cinnamon, it was so rich! We also shared the donuts, flourless chocolate cake, and the cheesecake! Needless to say we couldn't agree on one, so we eat got a dessert and shared. <br><br>Next time I hope to try some dinner entrees because I can only imagine how good those are.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/F46oxtWVrpf-it6XZ9U1NA/168s.jpg", "caption": "The infamous Mexican Hot Chocolate!!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/1CHrNwIfpLyzQpcvDmRiZg/168s.jpg", "caption": "Dessert date with the girlies! Of course we couldn't agree on one dessert..."}]}}, {"review": {"des": "I have come here a couple of times with my girlfriend, and it is always a pleasure.  <br><br>The first time we came here only for the breakfast, which was a great experience and great food!<br><br>The next few times were just for the hot chocolate and some dessert, which were also delicious!  We have tried 2 or 3 of the hot chocolates and all of them are very delicious!  <br><br>The atmosphere is also great.  It is a very intimate space with dim lights and candle lit tables.<br><br>One thing that people keep telling me to try is the mac and cheese, so I can't wait to go back and try it!<br><br>One thing I do recommend is making a reservation ahead of time if you are coming early in the day (gets pretty packed).  The last couple of times I've gone have been around 9 - 9:30 pm, which is not as packed, especially when trying to get a table for 2 for dessert.", "pics": null}}, {"review": {"des": "CA Residents here.  My wife and i tried this place out and it was just a pleasant experience.<br><br>The ambiance and interior was very detailed and open.  The food was just well done.  Every item was good and you cant go wrong.  The hot chocolate was just perfect.  Its never too sweet! Well balanced and fulfilling.<br><br>Enjoy!", "pics": null}}, {"review": {"des": "Neat spot. Whimsical decor with a fireplace. Annoying waitress that only visited every hour or so. She would make conversation and then flit away without taking our order. Maddening. Finally she came back and took our order (we'd had plenty of time to think about it by then.) The food: risotto BALLS were very tasty, octopus on a bed of polenta, and burrata. Very generous portions IMO. The risotto balls were the winner with the octopus coming in second. But the Mexican Hot Chocolate really stole the show, especially with the marshmallow and shot of whiskey in it mmm so good.Made me forgive the waitress for sucking it was that good. Can't wait to come back. Servers, please improve. Thanks.", "pics": null}}, {"review": {"des": "As I write this review I lay in bed, overfilled, overjoyed, overstuffed, and oversaturated with the decadent flavors and richness of Mindy's Hot Chocolate. <br><br>I've dined at Mindy's many times before - for dinner and also just for dessert. Her hot chocolate isn't your basic bitch swiss miss hot chocolate, it's something that you never imagined. Think of going to grandmas house for easter or passover and remove the standard deviation of error....you get pure perfection. Honestly, f*** Netflix for not including Mindy in their fourth season of \"Chefs Table\" that featured only pastry chefs.<br><br>This time around I had the chocolate malt, which I blacked out while I consumed it (sugar black out) as well as the frozen nougat which froze my heart between beats AKA the sugar beats.<br><br>If you haven't been to Mindy's then honestly, your loss. More for me and less for you.<br><br>Pro Tip - Be ready to put aside all of your morals and order a hot chocolate for each person and a dessert to share. There are no rules at Mindy's, diabetes checks itself at the door.", "pics": null}}, {"review": {"des": "Came here for the raving hot chocolate drink and it did not let me down. It was creamy and not too sweet. It really was the perfect hot chocolate.<br><br>I also ordered a cranberry sorbet. It was refreshing.", "pics": null}}, {"review": {"des": "You can't go wrong with Hot chocolate on a freezing day. Living in Chicago, you get plenty of those. However, we visited Mindy's Hot chocolate on a warmer day outside but it was cold enough in the restaurant to be thankful for having the hot chocolate. There isn't just hot chocolate here but snacks and sandwiches as well but our purpose for the visit was hot chocolate. We were there with friends so we tried out different kinds of hot chocolate. Call me old school, I loved the regular milk hot chocolate but my husband ordered dark chocolate one which was equally good. It was a little extra sweet for me, however, I'd definitely visit again just requesting it to make a little less sweeter and it'd be perfect.", "pics": null}}, {"review": {"des": "Brunch is not so bad here even though it's known as a dessert place. I got the italian breakfast that comes with polenta, a poached egg, eggplant, roasted sweet tomatoes that's served in a mini skillet. It was quite creamy and and it wasn't too heavy. It was a good amount so you don't feel overly full. My friend got the avocado toast and the presentation was pretty, but the taste was alright. It tasted more salty and the sourdough bread was kind of hard to chew through and it was kinda hard to cut. It was my friend's first time here since she moved to Chicago and she had the milk hot chocolate to go and she was not disappointed at all. She said it's delicious and the best!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/P1wp8I-96-sgfKDh4rQsqA/168s.jpg", "caption": "Italian breakfast"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/mIHxV9MI4pCv3Mb8ehOffg/168s.jpg", "caption": "Avocado toast"}]}}, {"review": {"des": "Do not eat here.. the savory dishes particularly. It felt like going to a neighbor's house for dinner, a neighbor that is a horrible cook and only knows salt as a flavor. I kid you not their 'famous fried chicken' tasted like an oversalted chicken tender from burger king, but cost $25. This just proves again that just because some thing is popular on yelp.. it really does not guarantee anything. Get dessert here if you want, but definitely not worth the dinner. Yucks.", "pics": null}}, {"review": {"des": "Had the morning breakfast here and the drinks have tons of chocolate in them so don't down it or you will get a stomach ache like I did. Amateur move on my part. But I had the Mexican and it was good. <br>The donuts were delicious and so were the entrees but my beef was on the salty side. <br>I wanna try dinner here next to crave my appetite for great food.", "pics": null}}, {"review": {"des": "I have forgotten how much I enjoyed this place.<br><br>Their hot chocolate is pretty good, there's thickness to it that you want from a hot chocolate and a mixture of milk chocolate with a dark chocolate to even out the sweetness. The \"medium\" hot chocolate is really the way to go.<br><br>The dessert was good, nothing too out of the ordinary, an enjoyable experience.<br><br>Actually, it wasn't as good as the olden days. I felt like they were a lot better, with a wider selection back then. Now, it's just too common. Good, but common.", "pics": null}}, {"review": {"des": "If I could give more stars I would! I've waited many years to top my 'best meal ever' and a return trip to Mindy's Hot Chocolate has ended my wait for a new favorite. <br>Our server was charming and attentive and helped steer us toward this perfect meal.<br>Started with a cocktail that was just added to the menu that day: Sparkling wine with Chamomile sorbet and rimmed in violet sugar...absolutely the best drink i ever had. Two of us shared a steak salad and Halibut with squash in a lemon sauce. For dessert we had the pistachio frangipane with local poached peaches, sweet corn cream and pistachio caramel poppycock popcorn.<br>Our server paced his service perfectly. Start to finish the best meal I've ever had.<br>My only caution is that it is noisy but with such a satisfying restaurant experience who wouldn't be whooping it up!", "pics": null}}, {"review": {"des": "This award winning restaurant was a perfect place to have lunch with a group of girlfriends.  Great ambience, artwork on the walls, and the menu! It was difficult to decide! I had a delicious spaghetti squash salad and an amazing dessert :)  many vegetarian options, they ask about food allergies too.  Coffee was excellent.", "pics": null}}, {"review": {"des": "Went there for the hot chocolate and it was AMAZING. Got the old fashioned one! Also got tomato soup and it was delicious! Definitely recommend this place!", "pics": null}}, {"review": {"des": "Mindy's has to be the #1 for hot chocolate... this stuff is THAT good.<br><br>I came here with a friend of mine for brunch, and we ordered 2 chocolate chip pancakes, a side of bacon and a side of breakfast potatoes. The pancake was outstanding; it came with one cake that is super buttery and fluffy. The bacon and breakfast potatoes were okay. <br><br>For dessert (because chocolate chip pancakes weren't enough...) we both ordered the Black & Tan hot chocolate. When it came out, I was a little disappointed. We were looking at other tables that had large, round mugs of hot chocolate, so that's what we were expecting. When ours came out- they were served in what looked like a small, clear glass shot glass. When spending $8 on one cup of hot chocolate (yes, EIGHT DOLLARS. you read that right), I'm going to expect a little more. Especially when I see other customers with larger mugs. I pretty much drank it in one sip. It was good, but not $8 worth.<br><br>Our waitress also seemed.... not there. She was very distracted and when we wanted to order the hot chocolate... she was nowhere to be found.<br><br>Overall I would come back and maybe try something else at Mindy's. But for an $8 hot chocolate, I don't want to feel like I'm being cheated since they aren't all served in the same glass. *shrug*.", "pics": null}}, {"review": {"des": "I love this place! <br><br>It is the perfect place to come on a quiet, winter night when the snow is gently falling. I could watch all the lovers pass by all night. Ask for a window seat. You'll feel nostalgic yet blissful. <br><br>Food is amazing. <br>Mac and cheese- creamy, decadent, flavorful, and rich .. it's everything I could possibly want in a Mac and cheese.<br>Grilled chicken thighs- My friend ordered this and didn't love it. I thought the lemon sauce and fingerling potatoes (perfectly crisp) were delicious. <br>Pulled pork- I love when restaurants use provolone cheese to compliment bbq sauce. Delicious and I was satisfied. <br><br>Dessert:<br>Pumpkin pie cheesecake (out during Thanksgiving)- I specially ordered this for my Aunt's annul Thanksgiving dinner. The pie received so many compliments! What a unique twist on the classic. <br>Medium Hot Chocolate- Best hot chocolate in the city! Splash of Carmel and home made marshmallows! Who could beat that?! It's rich but addictive. You will drink it all. <br>Mexican- Also delicious but a bit heavier than Medium. <br><br>Ambiance- Subtly romantic. The dim lighting and woodsy decor makes this place feel intimate yet relaxed. <br><br>Service - Perfect. Timely but not rushed. <br><br>This place is a Chicago gem. I adore everything about it and recommend it to every type of foodie.", "pics": null}}, {"review": {"des": "Stopped here while visiting.  Got some hot chocolate to go, and let me tell you.  The hot chocolate here is rich.  Incredibly strong deep chocolate flavors.  I honestly wasn't expecting this.  I honestly would probably share it with someone else next time, it was a little too much for me.  It was tasty, but can only handle so much rich chocolate<br><br>Definitely a trendy vibe here and it was packed.  The staff were all friendly, wouldn't mind going here again.", "pics": null}}, {"review": {"des": "Honestly not a fan. The service was pretty good but I basically just really didn't like the food. The fried fritters were great, but I ordered a pretty standard drink (White Russian) and it was terrible, then much to my surprise, the Apple Pie was probably the worst I've ever had. I can't judge their hot chocolate because I'm not about to pay $10 for a fancy hot chocolate. I may give them another chance in the future but I definitely was not impressed by first visit... may just not be a good fit for my taste buds since it's obviously popular in the neighborhood.", "pics": null}}, {"review": {"des": "My friend and I went to Mindy's for brunch today and overall had a great experience! I ordered a mimosa and the Swiss chard scramble and my friend had the cheddar biscuit sandwich.  All of the other food at different tables looked great too. I had to take a star off due to the service - it took us nearly an hour to get our food from when we were seated. I think they're a bit short staffed and could use an extra couple of servers. Decor and ambiance are great and I'd recommend a walk on the 606 after", "pics": null}}, {"review": {"des": "Over rated for sure. I did not like the hot chocolate at all and there wasn't many dessert options. We ordered three different items and they were all ok...ambience is cool and the servers are polite just wished they had more options on their menu.", "pics": null}}, {"review": {"des": "In my opinion, the hot chocolate didn't live up to the rave reviews. I had the dark hot chocolate while my boyfriend had the old fashioned. There was too much chocolate and sugar and not enough milk. The old fashioned was overwhelmingly sweet, while the dark hot chocolate tasted like what a regular hot chocolate should taste like. Both were like drinking a melted chocolate bar. I've had much better hot chocolate of various styles (French, Mexican, English, etc) at El Moro in Mexico City. <br><br>Also, the server in charge of seating tonight was particularly unfriendly. It was my birthday and my boyfriend wanted to buy me a slice of cake before the day ended. We were only able to make it here 7 minutes before midnight; we were hopeful though because some Yelp reviewers were seated a few minutes before closing. The server told us we couldn't be seated because the kitchen was as closed, but we could order drinks to go. My boyfriend told her it was my birthday and asked if they had any cake slices that we could buy to go as well. The server annoyingly snapped back, \"The kitchen is closed. If the kitchen was open, I'd seat you.\" She then proceeded to quickly have us pay for the hot chocolate and leave. Definitely an unfriendly end to my birthday.", "pics": null}}, {"review": {"des": "Mindy's is known for their hot chocolate, but I do like that the host gently reminded us that they also serve up meals!<br><br>Pro tip 1: if you come just to try their hot chocolate, you can get it at the \"to-go\" line. Or, you can always dine in. However, be mindful of their slow service since they are attending to other customers who are dining in.<br><br>Pro tip 2: old fashion is the most famous, but medium is the popular choice.<br><br>Pro tip 3: you can pay $1 for a split cup- share between 2 people. Each person gets their own cup with their own marshmallows! I don't know if it's actually more (fluid oz), but if you don't want to down a whole chocolate factory, this is probably the option to go.<br><br>Overall, the chocolate was okay. I actually prefer dark chocolate, and medium was still too sweet. If you've had Dandelions in SF, this place is far from their quality! Plus, why do marshmallows cost extra? (Dandelion is AYCE...literally LOL.)<br><br>Cute spot, slow service. Nice menu, but probably mediocre food. This review is ONLY for hot chocolate!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/f9MmRm79nPIOmcs5haIH5g/168s.jpg", "caption": "Menu"}]}}, {"review": {"des": "The molted chocolate cake was fluffy, airy, and exquisite, however, it does not differ from a run-of-the-mill grocery store chocolate cake. Mindy's doughnuts' teeny tiny portion was a joke (Keep in mind I am comparing this minuscule size to fine dining desserts), and the caramel popcorn was outrageously lacking in sugary saccharinity I expected. <br><br>My old fashioned hot chocolate unfortunately came out cold (I think it was the whipped ganache) and too sickly sweet which I found funny because I have a sweet tooth. I unfortunately had to send it back. Overall, I can definitely recommend better dessert places for the price, but I know this is a Chicagoan favorite and hope others enjoy their experience here.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/feUu4osXehDRrEDWCdkH3A/348s.jpg", "caption": "Mindy's doughnuts"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/kSiHnZhOwwBpHOYm-G551A/168s.jpg", "caption": "Old fashioned hot cocoa"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/sVtKtsJWJW_KEiRbbautxw/168s.jpg", "caption": "Molted chocolate cake"}]}}, {"review": {"des": "Strictly a desert only review... <br>We have been intending to come to Mindy's for quite sometime. And rightly so we weren't disappointed. The hot chocolates were good specially the dark chocolate. But the deserts were just too good. We tried the banana butterscotch and the two chocolate one...  both were amazing but the banana one is worthy of a second try. <br>Service wise it was good. Overall a wonderful place to have desert!", "pics": null}}, {"review": {"des": "On our first night in Chicago we realized the hard way that places close quite early. We got on the Internet to look for places open and we stumbled into Mindy's Hot Chocolate. It was a couple miles away from our hotel and what we thought would be a quick Uber ride. It turned out that because all the one Way streets I'll driver had to do a bit of maneuvering and it turned out to be quite a long ride, we were actually starting to get a little nervous. <br><br>The place isn't located in the nicest area. It looked a little shady to me and we did see a couple of drunk people in the street and that made me a bit nervous. However, once inside the restaurant it's was OK though. The place is pretty nice inside, it has very subdued lighting which made for an intimate setting . <br>There are no reservation per se and there was a wait for dinner. We didn't want dinner so we sat at the bar. I ordered one of their specialty cocktails, it wasn't as good as he sounded, but it was OK.<br><br> They must've been going through a shift change, because the bartender who first helped us was not the same one who finished taking care of us. In fact I was very happy with the switch, as the bartender who took over is one of the nicest people I have ever seen in the service industry. <br>She went above and beyond for us.  Made our visit truly special. <br>I also had an old fashioned which was very good. My friend tried the hot chocolate and some of their homemade cookies, she really liked them. This was one of the places that stood out to me. People don't seem very friendly in Chicago, so the ones who are, are the ones you tend to remember. I would definitely recommend this place.", "pics": null}}, {"review": {"des": "It's good, but it's not for me. When it comes to hot chocolate, I'm really simple. Take it to go, and keep it clean. Maybe some whipped cream and a marshmallow, but I don't need all the flavors and decoration. They did home-make their marshmallows which tasted better than store-bought. We also had some chocolate pie thing and a peanut butter milkshake. We did go kind of spontaneously, so we were not exactly dressed up for the occasion; which, the attire was a little formal. <br><br>Old Fashioned Hot Chocolate (5/5)<br>--- <br><br>Ode to the Milk Chocolate Malted (3/5)<br>--- Too busy. It was rich. it was covered in a bunch of rich chocolate toppings, it was filled with some rich stout mousse, and was served with a mini cup of malt-something on the side. <br><br>Peanut Butter Milkshake (3/5)<br>--- I'm all for whipped cream on top, but again, too much. It was pretty thin so it wasn't difficult using a straw like most places. However, that's all I tasted. No chocolate, no chunks of anything, it was pretty straight-forward.<br><br>The atmosphere was chill, the service was friendly, it did feel a little crammed, but we were only there for 30min max. They have take-out Hot Chocolate and desserts on the spot, and a full on menu if you wanted to do a real dinner as well. To be honest, the only reason I will come back is for the cool hot chocolate, but it's a nice place.", "pics": null}}, {"review": {"des": "I had my bridal brunch here and it was a great time at a great brunch place with some great hot chocolate! <br><br>This place is called \"Mindy's Hot Chocolate\" for a reason-- you definitely have to order the hot chocolate! I love that there are different kinds and my friend and I shared a cup. The hot chocolate was oh so rich and thick, it reminded me of hot chocolate in Paris that leaves you licking your mouth for more and yet simultaneously being completely satisfied with the sip you just took. I love the marshmallow (it looked homemade, but I didn't ask so not sure heh) and how it adds creaminess to the thick chocolate. <br><br>The food also was great! I ordered the seasonal quiche. The crust was extra buttery and crispy and I loved that the mixed green salad was more mixed greens and not just romaine lettuce. The champagne vinaigrette was surprisingly flavorful and sounds fancy which makes me feel fancy. Would love to come back! <br><br>Note: Be sure to specify what location when planning a group brunch/lunch/dinner/whatever. We had a few mishaps of people confusing it with the other Chicago location!", "pics": null}}, {"review": {"des": "Best hot chocolate ever, whether you get alcohol or ganache it is a necessity to get the hot chocolate! They hand grate the chocolate and the marshmallow is homemade and such a great addition.<br><br>I would skip the pork belly fried rice (salty) but definitely the sunchoke omelet.", "pics": null}}, {"review": {"des": "This was one of my favorite spots on my Chicago trip, and it happened on a whim!<br><br>After a very long day of sightseeing, Tairyn and I had an early dinner and headed back to the hotel to relax for a bit. But it was far too early to call it a night... after all, it was our first full day in town, and it was a Friday evening! We decided to search for a bar where she could get an Old Fashioned and I could get dessert, cause that's how I roll. Lo and behold, this place pops up in my Yelp app, and away we went.<br><br>We walked in around 10 p.m. or so and it was still a bit busy, though we got a spot at the bar with no problem. I had originally wanted an actual dessert, but after perusing the menu and not seeing anything that really tempted me, I decided to get a few of their small homemade cookies from the front display instead ($1 apiece). I opted for two each of the brownie cookie, chocolate chip, and oatmeal scotchie, and had two there while taking the rest to go.<br><br>Of course, I couldn't visit a place with hot chocolate in the name without ordering that signature drink. And oh my word, this was a heavenly cup indeed. I ordered the medium hot chocolate (if you want a \"traditional\" hot chocolate, this is the one to order), which comes with a homemade marshmallow. I asked for an extra marshmallow, because of course. This was a thick, rich, decadent drink that was oh-so satisfying, and the marshmallows were fantastic if you let them melt a bit in the hot chocolate.<br><br>I thought about ordering a second one, but upon gazing up at the glassware on the bar, I spotted a gorgeous crystal Longchamp champagne flute... the same kind my mom always had. You see, the day before, I was feeling a little down, and asked my mom to show me a sign she is okay (she passed away a year ago). The last time I asked for a sign from her, she delivered in a wonderful way... and this time, that champagne flute was her sign. So I decided I'd order a glass of champagne... but only if I could have it in that glass. I asked our bartender Caitria if I could use it, and explained why, and she gladly brought it down off the top of the shelf for me, even though the glassware that high on the shelf is usually just for display and not for actually serving customers. She was super sweet, and having champagne in that glass (as I silently raised a toast to my mom) absolutely made my night.<br><br>I will absolutely come back here on my next trip to the Windy City, and when I do, I'm going to make sure to ask for Caitria, because she was awesome.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/btiWmkzUMszuVOcThhYAfA/168s.jpg", "caption": "Cheers, momma :)"}]}}, {"review": {"des": "This is a must stop for a cup of their amazing hot chocolate. I loved the Mexican with cinnamon and chili powder. It's served with a marshmallow that is nothing like the ones that come in a bag at the grocery. These cubes of heaven dissolve and add just the right amount of creamy sweetness. The old fashioned is a bit sweeter, but also very good.<br><br>Desserts are also good, but very rich. We tried the malted chocolate cake and the banana bread pudding. These are good for sharing bc two bites is enough. <br><br>The food menu looks great, would definitely come back to check it out. Make a reservation because it fills up.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/t0OO4ZyNFgFXWPa6j3f5_w/348s.jpg", "caption": "so much temptation"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/RRhge-S0rF1qdd-2G_g7rA/168s.jpg", "caption": "Mexican hot chocolate"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/tXeXYByfV6s3P044cxVb_Q/168s.jpg", "caption": "banana bread pudding"}]}}, {"review": {"des": "Celebrated my boyfriends birthday here with 2 other friends. Tried calling twice to inquire about candles, etc to make it special but never got through, was only put on hold. Twice. For over 6 minutes the first time. This was at 6:30PM. There is no 'non peak times'. My boyfriend picked the destination tho, so no worries, we'll wing it. We were unfortunately sat at the worst table-it happens. No non-alcoholic beer. Dessert (not mine) was not edible. I almost forced my guy to send it back; it was some layered brownie treat that you couldn't cut with a knife. And finally: no candles. Our server however was great. I've definitely had better food, better environment and better front of the house care from MANY other places.  If a restaurant can't manage the front of the house, it usually is a top-down problem.", "pics": null}}, {"review": {"des": "Oh my gosh this place has great desserts. We came here on a recommendation/gift card. We also had a cocktail as well. The cab I had has was fabulous. The Satan's Carmel my buddy had rocked too. They seem to have a great list of craft cocktails to choose from. The interior of this place is very dim and relaxing. We will definitely be coming back to have full on dinner here in the near future. Can't wait to try the amazing looking food!", "pics": null}}, {"review": {"des": "Very much enjoyed this place for brunch!! I've been following them on instagram for a while and live just a block away, so it was time I made a visit! The first time we went we sat at the bar and didn't wait at all. The second time, we were told it would be 1.5 hour wait, so we ended up somewhere else, but I got a text in only 45-50 minutes. <br><br>The food is really good-- all of their items are quality and they have different pairings you don't always see at restaurants. I got the butternut squash and my boyfriend got a scramble. Both were really good, but I was disappointed by the price for he amount of food we got. Mine was pretty small and was $14 I think. We also got drinks-- skip the latte, as it's expensive and not worth it. We haven't gone for dinner, but I would go back for brunch again.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/yK67ZjmyrMDkxFQlrDZQ2g/168s.jpg", "caption": "Butternut squash breakfast"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Bza0c8M7qSkP9sNNU0vbuQ/168s.jpg", "caption": "Scramble"}]}}, {"review": {"des": "My short travel to Chicago and Mindy's made my top list. I was extremely pleased with this place!<br><br>The old fashioned hot chocolate was delicious. I hope I can come back to try more. <br><br>For the food, the Mac and cheese stole my heart. It was insanely delicious. I've never had Mac and cheese this good! <br><br>The service was wonderful and they offered great recommendations and was very informative. <br><br>Oh, and dessert menu changes based on the local market availability!!!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/wRm3y73S7z3TUSJeyDQ5Qg/168s.jpg", "caption": "Mac and cheese small plate 5/5 and highly recommended"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ioFjOHuuPYsWklH4s5nnvA/168s.jpg", "caption": "Bananas dessert 4/5"}]}}, {"review": {"des": "So I actually came here when the restaurant was closed, but they were open for to go drink and pastry orders. They have different hot chocolate options to choose from and all of them sound delicious - it was hard to pick! I went with the Oatly Hot Chocolate that came with a cubed marshmallow on a stick placed inside the spout. I was told to drop the marshmallow in and mix it in while it melts. Wow, the taste was just amazing and when it was snowing outside, I couldn't wish for anything better. I HIGHLY recommend paying Mindy's Hot Chocolate a visit!", "pics": null}}, {"review": {"des": "I came here for dinner with my boyfriend for my birthday and it was perfect! He couldn't have picked a better place. Mindy's is so cute and romantic but at the same time it felt simple and cozy/homey to me. I came during the summer but I bet it's even better in the winter with a cup of delicious hot chocolate!<br><br>We both ordered the hamburger, which is DELICIOUS! I've tried other famous burger places in Chicago (au cheval) but I think Mindy's is better! Definitely get the egg on top, makes a big difference. It's pricey ($18) for a burger but worth trying atleast once!<br><br>For desert we of course had to try their hot chocolate. We got the regular one although they have several flavors, all of which sound heavenly! The hot chocolate is also pricey ($8) but worth it. It's so smooth and creamy yum! Because of how rich it is though I would recommend sharing.<br><br>We also got one of their desserts but I don't remember the name. They have different desserts throughout the year for different seasons, which makes you want to go back even more! The one we got was so incredible and unique. All their desserts are $13 but again worth it because it's just that good! Also recommend sharing if you're getting dessert and hot chocolate.<br><br>Overall I loved Mindy's and I'm excited to go back to try some of their other seasonal desserts!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ThAh9ARl59AIM48Bc_58mg/168s.jpg", "caption": "Hot chocolate"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/vgC-ohTY8tGsgfL4nDh2xg/168s.jpg", "caption": "The hamburger - delicious!"}]}}, {"review": {"des": "Popped into Mindy's on a Saturday night around 8:30 and got seated at the bar right away. Bartender, Max, was fantastic to us. Great service. We ordered a couple glasses of wine, the cheese board, and the octopus dish. My boyfriend loved the octopus dish - even ventured so far to say it was possibly the best grilled octopus he had ever had. The cheese board was fantastic too - we had a blue, a sharp yellow, and a soft white cheese, with nuts, a couple micro pickles, and some nice sourdough bread. We finished up with the medium hot chocolate with a shot of orange cognac (recommended by Max) and a Mexican hot chocolate with a shot of brandy. They both were incredible. So so creamy, rich, with a homemade marshmallow that melted at the most perfect speed and consistency. Great experience all around. We will definitely be back. Thanks, Max!", "pics": null}}, {"review": {"des": "You can completely disregard my last review...this place is great. The atmosphere is just so cute, especially in the summer when the whole store front is open. I came here for lunch last Friday and was pleasantly surprised to find they had breakfast options on the menu as well. <br><br>My friend and I had the half & half hot chocolate, medium hot chocolate, avocado toast, salmon bagel, and the seasonal cake from the dessert menu. Hot chocolates and dessert were mind blowing, and the food was good as well! I can't wait to come back. Also wondering if I can buy those marshmallows by the jar...", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/CgYbaiJlhgNG1WXE4wGPtA/168s.jpg", "caption": "Medium Hot Chocolate x House-made Marshmallow"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/HfVgGLnxY7rncqNnBSTEzQ/168s.jpg", "caption": "Seasonal Cake"}]}}, {"review": {"des": "Great service. Can get busy with long waits. Mac n cheese is delicious and raw Brussels sprout salad with bagel chips surprised me at how good it was. Homemade mashmallows!!!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/mR3_IK7L3-fGvYvMkQCTfg/348s.jpg", "caption": "Medium hot choc (split), mac n cheese, Brussels sprout caesar, and of course cookies: all top notch"}]}}, {"review": {"des": "Drove here on a whim with a couple of friends. Was told the wait was an hour but ended up being seated within 15 min, score! I ordered the eggnog hot chocolate... First of all, follow the menu's instructions and order hot chocolate after your meal. Second, I hated the hot chocolate. I know this sounds awful, and I feel bad for saying it, but it reminded me of Progresso's Creamy Chicken and Dumpling soup??? I could only finish 1/4 of it before giving up as I couldn't stand the flavor and it was too rich for me. I'm a lil chicken sh*t, so I didn't complain as our server was excellent and very sweet lol. Definitely not worth $8 though. Next up, I ordered the Mac and Cheese. It was delicious and you get a pretty good amount of it. I definitely couldn't finish it after the hot chocolate debacle (Order hot chocolate after your meal). But I definitely recommend the mac. Again, very rich but really hits the spot. My one friend ordered the steak salad. Beware, for $19 you don't get much. He said it was good but definitely not enough food. Next time we go, they decided they're ordering the burgers as they looked great and more worth the $. Finally, we ordered dessert. My friends got hot chocolates, and we each picked a type of ice cream for the 3 for $12 dessert. I got the Ginger Snap which was DELICIOUS but they put the scoops in these tiny ass bowls that are meant for sauces. It was so hard to eat the ice cream without getting it all over the place. It was adorable presentation but not functional at all. I also ordered a regular coffee to help calm my stomach down after all that richness and it was delicious so no complaints there. I could have had 5 more cups of it. <br><br>Some other notes... The ambience is great. Loved how the place was decorated and it felt so cozy. The staff was great, everyone was super nice and attentive. They served us TONS of water which helped with the richness of everything. Overall, I liked the place. I think I ordered some of the wrong things so I definitely would come back to try it again. Probably won't be spending my money on the hot chocolate again. I'm excited to try some of their other drink options though!", "pics": null}}, {"review": {"des": "We came here for desserts.  & as the name of the restaurant, we had to try their hot chocolates!<br><br>I loved that their hot chocolates come with a large, cube shaped, house made marshmallow!  Fluffy & sweet.  I have the ultimate sweet tooth but I definitely thought that their hot chocolates were too sweet.  I felt like I needed a glass of milk to try to finish my hot chocolate & since I did not, I could only finish half.  They have several flavors to choose from dark, chai, to regular.<br><br>Black & Tan (1/3 fudge, 2/3 medium hot chocolate):  Way, way chocolatey.<br>Regular:  Less chocolately.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ZIYsMnA2aV9VELbKU0EsZA/168s.jpg", "caption": "Regular"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/GR1mJr-cuoa0x9sJXVupNw/168s.jpg", "caption": "Black & Tan"}]}}, {"review": {"des": "I'm not a big chocolate or sweets person, but if I was this place would be heaven.  I was pleased to find savory brunch dishes on the menu, but a little sad that your girl couldn't get a Bloody Mary.  The vibe wasn't too hip or hipster. This place isn't in a neighborhood that I frequent, but I'd  definitely come back the next time I'm in the area.", "pics": null}}, {"review": {"des": "This is such a cute restaurant and the name does not do it justice because they actually serve an extensive food menu that looks equally as delectable as their desserts. I came here just to get a taste of their dessert and hot chocolate. While the items are double the price of what I would usually shell out for a hot chocolate or dessert item, it was worth the splurge. I tried the Mexican hot chocolate and the blueberries dessert tart. I loved the hot chocolate- it was very rich, but not as rich as the hot chocolate at Angelina's in Paris. And the best part was watching the homemade marshmallow melt into the hot chocolate. However, I did not pick up the taste of any cinnamon or cayenne in the Mexican hot chocolate. You could have told me it was a regular hot chocolate and I would have agreed. <br><br>I would also highly recommend trying out one of their dessert items. The portion size is actually very small so if you're sharing, each person may end up with less than five bites. The blueberries one I got tasted quite tart and refreshing, so the flavor balanced out perfectly with the sweetness lingering in my mouth from the hot chocolate. It's the perfect one to get if you're looking for a \"light\" dessert.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/X0mLHl3ATWE32HZNTYnjKQ/348s.jpg", "caption": "blueberries"}]}}, {"review": {"des": "This is DEFINITELY one of the best spots for brunch (or whatever) in Chicago. I appreciate every small detail here. From food, drinks, hot chocolate, great coffee, to the interior design. You have to wait a bit for food but it doesn't matter as the ambience, vibe and drinks are so good. IN LOVE!", "pics": null}}, {"review": {"des": "We only tried doughnuts, coffee cake and hit chocolate-all 3 were delicious.  Kind of noisy but in a good way.  Sat at a communal table because only available unless wait for 30 minutes.  All the meals I observed being served looked tasty!  Definitely will go back.", "pics": null}}, {"review": {"des": "Do not get hot chocolate and cake or else it really will be death by chocolate. <br><br>The hot chocolate is suuuper rich, one of the most decadent drinks I've ever had and definitely worth to try. The chocolate cake was good but overly sweet and together it was just too much. Definitely had a stomach ache after.<br><br>This place is very popular so be prepared to wait if you come during a popular time, also be prepared to spend $8 for hot chocolate.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/oS7JnVxfwaggEBqvG6RIcQ/168s.jpg", "caption": "Perfection"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/CwwBuXSzhSJnMhvtH288xw/168s.jpg", "caption": "Death by chocolate"}]}}, {"review": {"des": "Came here because we heard nothing but rave reviews; but were quite disappointed with the hot chocolate and the caramel popcorn we ordered. The popcorn was so stale, and our hot chocolate was too rich.  The ambiance is nice but I wouldn't come here again was quite overpriced for so so drinks and stale dessert.", "pics": null}}, {"review": {"des": "Food was better than desserts. The desserts were good, but a little too sweet... or a lot to sweet. I would come back, but just for the regular food. <br><br>But the wait staff took too long to take our order, come back, bring our food, and they even took too much time to bring us our check. <br><br>Maybe next time it will be better.", "pics": null}}, {"review": {"des": "Mindy's Hot Chocolate is a busy, trendy hot mess on a Sunday morning. We arrived at 9:45 AM and were first to queue up. Within minutes, there was a long line behind us. When we were invited in at 10:00 AM when the restaurant officially opened, our entire party was not yet present. Therefore, we were asked to step aside to let others be seated. I was a little worried because there were so many people clamoring for tables, but when the rest of our party arrived a few minutes later, we were seated almost immediately. We lucked out because there was a wait for tables even when we left over an hour later. If you don't have a reservation for brunch (Good luck getting one, by the way.), you should probably queue up before the restaurant opens.<br><br>The restaurant is lovely, and the service we experienced was quite good. The prices, on the other hand, were elevated. I couldn't help but make references to the $5 milkshake in Pulp Fiction when looking at the $8 hot chocolate prices and the $3 charge for splitting on hot chocolate on the menu. The hot chocolate was exceptional, but wow. And no, there wasn't any bourbon in it. (Pulp Fiction reference, once again.) That's expensive hot chocolate! Also, I had avocado toast as a bit of a joke because it's a trendy item that many people in my 40+ age bracket just don't understand. I think it was $13 or $14, and it was seriously one slice of toast topped with a poached egg, mashed avocado, and some sprouts. There was nothing on the side. No fruit. Nothing. The avocado toast was tasty, but overpriced for a tiny entree with basic ingredients.<br><br>Despite the fact that it's such a busy location and despite the elevated prices, Mindy's Hot Chocolate is a lovely place to indulge.", "pics": null}}, {"review": {"des": "Great place on division street. Great service as well. We had to sit at the bar which serves the same menu. For me the noise level was a little high. <br>Authenticity: N/A<br>Ambiance: 6/10<br>Flavor: 8/10<br>Taste: 8/10<br>Service: 7/10<br>Recommended: yes<br>Return factor: 0.9", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/icbVEMVuE1dt9TVH8p1dcw/348s.jpg", "caption": "Organic Crispy chicken. Very flavorful, crisp on the outside, moist on the inside."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Oh5UZB25kZfJ3bo6GwsqKg/168s.jpg", "caption": "Cheese platter."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/xALd2eA6J4z0MjJAnyMEcg/168s.jpg", "caption": "Risotto with flame-grilled shrimp"}]}}, {"review": {"des": "Bucktown would not be the same without this sweet spot! Mindy's is a cool, casual spot and the best part about it is the homemade hot chocolate dessert. Perfect for winter! The place does get very busy so might have to put your name down. Definitely cannot miss this place and the ambiance!", "pics": null}}, {"review": {"des": "This place is the *best*. I always go out of my way to meet my friends here cuz it's so good. Cozy, lots of savory & sweet options, plus a warm, welcoming environment. Def recommend!", "pics": null}}, {"review": {"des": "Amazing food and interior, we came here for lunch and we had tomato soup, quiche and sandwich. Hot chocolate and marshmallows are to die for !!! I want to be back for dinner . Service was ok, Im taking one star because of the hostess. she didn't allow us to sit on the bar chair we wanted to the end of the bar so bartender don't have to walk that far?? But bartender seemed ok with that. Anyway change the hostess, everything else top notch.", "pics": null}}, {"review": {"des": "Finally made it to Mindy Segal's critically acclaimed cold weather wonderland! All in all, I was happy with the decision. After waiting for an hour in line at the Maggie Daley Skating Ribbon, only to have it close early, we needed a pick me up. This proved sufficient. <br><br>At first glance, my burger didn't seem very large and a little overpriced for its' modest size. Luckily, it proved to be extremely rich and one of the best tasting burgers I've had in Chicago. The short rib blend is exquisite. However, at a hefty $17, would it kill you to offer fries, tots, or sweet potato fries over the cost cutting \"house chips\"? Girlfriend's pork belly sandwich was also very good, despite it falling apart mid-meal... Happy to play garbage disposal after she couldn't finish it. Solid beer selection, but also a little high on the price point. <br><br>To end the meal, the best hot chocolate I've ever had! As it should be, given the accolades and name of the restaurant... I tried the Mexican, she tried the Dark, both amazing. All in all, overpriced, but very good.", "pics": null}}, {"review": {"des": "A treat I was truly looking forward to kind of let me down.<br><br>First: if you're going to Mindy's, make a reservation in advance. Walk ins are welcomed but it's busy here and usually booked.<br><br>We made our reservation thankfully so when we came we were seated immediately. The place is cool. Dark, dimly lit playing some early 2001's Mary J Blige. I liked it. <br><br>Our server Jessica came over and asked us if we needed anything. My friend asked for a water. She replied there is water on the table. She was right. On the table were two dark green bottles next to the flowers on the centerpiece. Being dark it was hard to see. My friend replied \"oh sorry I thought it was decorative\". Our waitress replies, \"oh yeah, decorative water.\"<br><br>This is going to be a long evening...<br><br>She asked if we needed help with the menu, but we were ok. I ordered a peanut butter milkshake and their donuts.<br><br>A runner brought our food. I liked the milkshake but didn't enjoy the whipped cream which topped it. It was more of a heavy cream than a sweet whipped cream. The donuts were ok. A few small sugar donuts with chocolate sauce and caramel popcorn. The popcorn had a great flavor but the donuts were a little chewy. Again, they were ok.<br><br>Our waitress never came by to see how things were. Then she dropped the check off. We noticed that the check was missing an item. Being that she didn't really worry about us while there we decided not to mention it. We gave our respective payments. When she brought the change back she took the money out of my friends cash. Apparently she realized she made an error, corrected it, but never mentioned it to us. No \"I'm sorry I made an error\". She just took the money without notice. Yes, we should have been charged that amount, but technically, it wasn't what the bill stated. Two wrongs don't make a right I suppose but it would have been nice for her to mention that what our bill was, wasn't what we were actually going to be charged.<br><br>At the end of the day I was really let down by this experience. The service was not great. Spending $21 on a milkshake and some donuts was a lot, and for being just ok tasting, it really wasn't worth it at all.", "pics": null}}, {"review": {"des": "My sweet tooth lead me here since there aren't a lot of dessert places in Chicago. Came here just for hot chocolate and dessert which changes depending on the seasonal menu. There were a variety of choices for the hot chocolate which is probably expected when a place is themed around hot chocolate. Unfortunately, it wasn't mind blowing at all. <br><br>My hot chocolate was not piping hot the way I thought it would be nor was it too hot. I got swings of \"cold milk\" but it is probably because of the marshmallow. <br><br>As for the dessert, we had trouble choosing as it was since everything sounded so good, but we got one to share except we were picking off pieces that we wanted and didn't want from the dessert. A little disappointing, but was a really cute date spot to finish a night out in Chicago.<br><br>Based off of reviews, very happy that there wasn't a line when I came after an early dinner. We were immediately seated and managed to snag dessert fairly quickly.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/-XkNI5O0eyJ3YVunqsNljw/168s.jpg", "caption": "Hot chocolate"}]}}, {"review": {"des": "The desesert chef here is supposedly James Beard awarded. We ordered their ice medium hot chocolate and cheesecake. The hot chocolate is very rich and dense but overwhelmingly sweet...The cheesecake came with many ingredients with various textures which I enjoyed. Again, I wish the dessert was lighter and less sweet cuz we had to take a break after a few bites...", "pics": null}}, {"review": {"des": "Honestly, the hot chocolate was so good that I have still been thinking about it since I had it for the first time weeks ago.  I seriously can't wait to go back out that way!<br><br>The prices are fairly high for the types of things they offer, but hey good food and drinks...<br><br>The ambience is super chill and relaxed.  The service was phenomenal and I would recommend this place... whether you want the food or not, it's totally worth it to just come for dessert just be aware of the minimum. <br><br>It was completely packed when my girlfriend and I arrived, however we had reservations prior to and only had to wait about 2 minutes until we were seated.<br><br>I think that the reviews of this place definitely does it justice and you should go try it yourself. :)", "pics": null}}, {"review": {"des": "Stopped in for lunch because the lunch menu looked appetizing. Informed on arrival: \"take out only until 5:30.\" Website and other online sources don't mention this preposterous practice. Politely suggested to host that they should mention this bizarre fact on their website. She quipped, \"look, I am not in charge of the website, I'm just the host.\" Waste my time, lose my business. Be rude, gain my poor review.", "pics": null}}, {"review": {"des": "Such a cute place, a definite must-try for dessert and hot chocolate!<br><br>My sister and I came here on a Wednesday evening - mainly wanting to try the famous hot chocolate, of course. The hostess greeted us and first asked if we were eating dinner or just getting hot chocolate/dessert - there's a minimum amount you must spend if you're just eating dessert - and opted for dinner. There was luckily no wait - only maybe 4 or 5 other tables were seated at the point when we arrived.<br><br>We chose to share a few of the appetizers: the soup (white bean minestrone), the burrata, the cheese plate, and the macaroni and cheese. We liked the macaroni and cheese and the burrata plate with beets, but didn't are for the cheeses on the cheese plate. The soup was okay - kind of forgettable but nice enough on a chilly night.<br><br>Then, the main event: hot chocolate and dessert! We were already kind of full at that point so decided to get one hot chocolate and one dessert. There's an extra charge for splitting the hot chocolate. We got the medium hot chocolate which seems to be the \"original\" on which there are many variations - mexican, dark, pumpkin spice, peppermint, etc. We also shared the brioche donuts although we had a hard time choosing from all the amazing sounding desserts! <br><br>The donuts came out first and were spectacular - warm, soft, dusted with just enough sugar, and accompanied by a rich fudge sauce (so, so good) and cracker jack caramel popcorn. We were already blown away by the donuts when the hot chocolate came out, piping hot, accompanied by one of their homemade marshmallows. The hot chocolate was so very good, exactly my kind of comfort food; super rich and creamy hot chocolate and the addition of the marshmallow melting in the mug only made it better. Even splitting the one mug of hot chocolate, we struggled to finish it after dinner and dessert because it was so rich and heavy. Absolutely worth it to try it but if (and when) I hopefully come again, it would probably be on an empty stomach just for hot chocolate and to split a dessert - a filling meal all by itself.", "pics": null}}, {"review": {"des": "Mindy's was so good that I actually went on a Saturday with a friend and came back the very next day with another friend. The place is very cute and gives off such a warm vibe. They take walk-ins if you didn't score a reservation. The wait was pretty long but totally expected. You can order some of their wonderful hot chocolate while you wait or peruse the goods that they have up front.<br><br>I had the Mexican hocho (#gilmoregirls). The hot chocolate could have been a meal on its own. It was thick with a spicy kick and tasted like luxury in a mug.<br><br>I ordered the biscuits and gravy with a side of bacon on my first trip and my friend ordered the 2 Eggs Any Way. Both dishes were hearty and incredibly tasty. I'm a huge fan of potatoes, and the 2 Eggs Any Way breakfast came with potatoes and a choice of sausage or bacon plus toast. I had major food envy, but my friend was kind enough to share her potatoes with me.<br><br>Service was good but a bit on the slower side. The tables are spaced closed to each other so if someone wants to get up, then the neighbors usually had to scoot over a bit.<br><br>Mindy's was definitely worth the wait. A few diners at neighboring tables ordered the mac & cheese, and that looked really good! If you don't have time to wait for the yummy food, definitely stop in to try the hot chocolate!", "pics": null}}, {"review": {"des": "So this is what hot chocolate's supposed to taste like! <br><br>Prep your tastebuds for ultra sweetness. Seriously, imagine a handful of sugar dissolved and that's about right. My partner and I went to Mindy's for hot chocolate and banana pudding. The hot chocolates are thick and rich with a large fluffy marshmallow right on top (it will melt and become a little gooey), making me wish I was cuddling at home while it snowed outside. <br><br>The banana pudding wasn't just a pudding, it also included banana-flavored cookies, drizzle, and other banana-themed delights. I deducted a star for its price-- $8 minimum for a cup of chocolate! Now that's sweet dessert at a hot price.", "pics": null}}, {"review": {"des": "I love this place. I went on a date here and it is such cute little spot to go out with friends or a date. The hot chocolate is AMAZING! I had also an italian soup here too. It was really good. I mean I can't complain at all!", "pics": null}}, {"review": {"des": "The food and service here are superb, and so is the atmosphere. We were welcomed warmly at the front, and were led a cozy table for two in the subtly lit dining area. My spouse ordered a glass of white wine, and I chose a boozy hot chocolate: dark oat milk with a shot of whiskey on the side. The chocolate was rich and warm on its own, and adding the whiskey gave it another welcome dimension. For dinner we started with the risotto fritters and a bowl of bean soup, both outstanding. Our main courses were the pappardelle and the crispy chicken thighs. The chicken was tender and flavorful, dressed up nicely with gnocchi; and the house made Italian sausage was perfect. For dessert we shared the 'apple,' which was a puck of bread pudding bathed in caramel sauce and garnished with caramel corn. Delicious. We had a great time here, and I'd love to return.", "pics": null}}, {"review": {"des": "How good can hot chocolate get? Really really good, apparently. We came here really late on a Saturday night and were lucky to get a table. The first thing you'll notice is how great the place looks! When we went, there was an incredibly diverse crowd - from little kids having cookies to impeccably dressed couples enjoying a bottle of wine. Something about the place makes it feel very welcoming.<br><br>We ordered two hot chocolates - the Medium and the Mexican. The medium takes a regular hot chocolate to its extreme, and gives you a decadent, creamy, evolved version of it. The Mexican was different, and the addition of the cayenne pepper made it very very interesting and memorable. My only issue with it was that the cinnamon was a bit too overpowering, and subdued the chocolate - but maybe that's just me.<br><br>Overall the experience was great and I will definitely be back for brunch! The prices are quite high for hot chocolate, but they give you more than enough to split a mug. Mindy's will likely be an occasional indulgence for me.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/2H1z1N_Zw5EQj1d3QmzHAw/348s.jpg", "caption": "A shot of the interior."}]}}, {"review": {"des": "Probably the best, richest hot chocolate I'll ever have.<br><br>I saw how popular the caramelized white chocolate flavor was on Yelp, and based on this, chose the seasonal Pumpkin Spice hot chocolate--a mix of dark chocolate, caramelized white, and just the right amount of spices.<br><br>Amazing.  <br><br>Mindy's succeeds in creating a drink that is both rich and chocolately, but at the right texture/viscosity.  In my experiences, some rich hot chocolates end up reminding me of drinking hot mud.  <br>Not Mindy's.  It was an absolutely divine, velvety hot drink.  The caramelized white chocolate had this toffee note that gave the drink so much depth and sweetness to balance of the quality dark chocolate in the forefront.  The spices were not overwhelming, but just enough.<br><br>My waiter was also very personable and kind.  It was a perfect evening on a fall weekday when they had their front doors open.<br><br>There's also an option to spike your hot chocolate, which I may recommend for those who want to tame the sweetness/richness further.  Everything is on the pricey side, but it is worth coming for dessert.", "pics": null}}, {"review": {"des": "I've had the medium hot chocolate several times to go. Yes, it costs $8. The marshmallows contain animal gelatin, which is why I didn't have them, but even without marshmallows, the hot chocolate was excellent. It was thick and creamy, hot and very sweet. Very comforting on cold days. It closes later than most places in the area.", "pics": null}}, {"review": {"des": "This place is really delightful. I heeded the warning of my fellow Yelpers and showed up bright and early for brunch one Saturday (and by \"bright and early\" I mean 11am). There are no bottomless (or cheap) mimosas here, like I'm used to so I only got one brunch cocktail called a \"Good Lookin' Bird\". The cocktail was made with vodka, passion fruit puree, lime, and cava and it was a little sweet but it also packed a punch. I wanted another one but it was $10 so that wasn't going to work. <br><br>To eat, I got the breakfast sandwich with bacon. The portion was a little on the small side but the flavors of the egg, cheese, arugla, tomato, aioli...and bacon, all went well. Then again, it is next to impossible to mess up a breakfast sandwich. The potatoes that came with it were a little on the dry side but that's nothing a little ketchup won't fix.<br><br>To end my meal, I had the chai hot chocolate. There was no way I was leaving the restaurant without trying what they're famous for and it did not disappoint! Out of the 10 or so flavors of hot chocolates, I chose the chai hot chocolate because I thought the flavors of the chai would go well with the richness of the chocolate and I was proven correct. The housemade marshamallow was also a nice tough.", "pics": null}}, {"review": {"des": "I ordered the old fashioned hot chocolate and pork belly sandwich. Hot chocolate was too sweet for my liking but my boyfriend and I did the shared cup so that made it easier to consume. The sandwich was good overall, but the pork was too greasy for me & I ended up not eating half of the sandwich.<br><br>Staff were great and very helpful. Google said they open again at 5pm for dinner but they actually don't let anyone sit until 5:30pm. Parking is on the street so hopefully everyone has the luck to find one!", "pics": null}}, {"review": {"des": "Wow! Just wow! I came here with hubby and a friend on a Friday night. They said it would be a 45 minute wait, so we were waiting for an Uber to go to a bar nearby in the meantime, but as we were about to leave they sat us down! Yay!<br>First of all, the restaurant itself has such romantic lighting and is loud, but quiet enough that you can still have a normal conversation. It's a very lively, business casual, fun place with adorable decor. They have beautiful vintage mirrors on the wall and it just adds to the ambiance. <br>Now onto the best part: the hot chocolate. Oh my! I was talking to a friend and while he was talking I took the first sip of my oat milk hot chocolate and I made a loud noise and said: oh man! I couldn't help but to have a strong reaction to the best hot chocolate in my life. My friend thought it was funny that I interrupted him to \"moan\" about how good the drink was. Good times!<br>We also had amazing desserts. I had the flourless chocolate cake, hubby and friend both had the milk chocolate frozen nougat. Everything was perfectly presented. The desserts have very generous portions, so you can definitely share. Don't share you hot chocolate! Just kidding.<br>This is a great place for any special occasion. Not good for really big groups. <br>Can't forget to mention that the service was also incredible to match everything else. Both our hostesses and servers were so professional, genuine and very knowledgeable. <br>Also had an extra dirty martini and it was perfectly made! Loved every minute of it! Thank you Mindy Hot Chocolate! Keep it up!", "pics": null}}, {"review": {"des": "We found this place trying to kill time before flying out. And I wish we found it sooner! We came in for dessert but the dinner menu looked amazing! It's a cute little romantic bistro type of feel. I regret not grabbing a bag of marshmallows before we left because they were to die for! <br>The bestie got the regular milk hot chocolate and that was so rich but not in a overwhelming  need a glass of water type of way. I ended up getting the Mexican hot chocolate and it definitely had a spicy kick to it. It's like I knew it was coming but it still caught me off guard, in a good way of course.", "pics": null}}, {"review": {"des": "The food we ordered (arancini, roasted corn soup, side salad, tagliatelle, coho salmon) was uniformly delicious, but we should have stopped after our entrées. The service was sssslllloooowwww, the seats grew extremely uncomfortable over time, and after drinking less than half the hot chocolate that the restaurant recommends enjoying alongside dessert, I hit a wall and couldn't swallow another sip of it. It must be made with cream or something rather than milk, because not only was I unable to finish it (and I didn't even touch the housemade marshmallow, which I asked to have held but which came anyway), I felt queasy for half an hour after leaving and still don't feel 100 percent back to normal the following morning. It's strange to say about a restaurant that's so clearly proud of its sweet creations, but if I ever come back, it will only be for the food.", "pics": null}}, {"review": {"des": "This is hands down the best burger in the city. I've been on a burger vision quest, and this is the promised land. You could take my word for it, or stick your head up a butchers' ass ... Wait, no, it has to be your bull.", "pics": null}}, {"review": {"des": "Came back to Mindy's for brunch for the first time in quite a while. Got there at 10:30 am and the wait for 4 people was already 1-1.5 hrs. We checked back in with the hostess after an hour and she said we had the next 4-top [table]. Great! And then she gave one of those to a group of 6. And then another to a group of 5 who was waiting on their last person for more than 10 minutes while our [complete] party stood their staring at an empty table. And then she tried to seat the 4 of us at the bar. I was really not pleased with her charade.<br><br>Two at my table ordered the pancake which was phenomenal. Highly recommend it. I got the salami scramble which was alright. Better than I can make but it won't blow your socks off. My last friend got the famous burger. Despite ordering it medium it was charred pretty good on the outside which overpowered the rest of it. Also, unrelated to food, but they were just BLASTING techno music for a solid 20 minutes. Who thought that was appropriate for this type of restaurant??<br><br>I'm going with 4 stars because the hot chocolates are still amazing and the food is very very good most of the time. But Mindy really needs to whip her staff into shape. And please, turn off the techno music next time.", "pics": null}}, {"review": {"des": "Highly recommend. Both dinner and dessert are both phenomenal - burger is very good as well as their hot chocolates.", "pics": null}}]}