{"name": "minghin-cuisine-chicago-3", "reviews": [{"review": {"des": "This place is located in the main Chinatown plaza. We were seated down quickly for a late dinner on a Friday night. <br><br>They hand you IPads as menus. This was cool. Once you are ready to order, just flag down the waiter and he will put in the order on the IPads. I thought we personally can order on them, but we couldn't. <br><br>I had beef chow mein and shared potstickers for appetizers. I liked both of my food. I thought both were really good. They were both typical dishes you'd find in a Chinese restaurant. <br><br>They also give you some hard cookies once you're paying. This is typical to any Chinese restaurant.", "pics": null}}, {"review": {"des": "Great dim sum food! I went here with a group of 14 for a friend's birthday. The normal tables only hold 12, and they were going to push two together but would have made for an awkward seating arrangement as they are all round. Anyways they had a private room they put us in which ended up being great with one huge table!<br><br>The food is really good but come prepared knowing what you want to try as there isn't much help navigating the menus or providing advice from the wait staff. Nice people just they let you order whatever you want (we ordered wayyyy to much). <br><br>Overall was great and we ended up at about $25 per person after tax and tip.", "pics": null}}, {"review": {"des": "Omfg if you want to impress a date, bring her here. Just don't let her see the bill. Order WAY too many things. Try them all. Discuss your favorites. Then order dessert. <br>It will be like $70 lol<br>It's soooo affordable!!!!<br>HIGHLY recommended!!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Ckcsf7V1vbzyvMyF-OmFHA/348s.jpg", "caption": "Ribs. Awesome"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/jcf5iP1xGVkKYM4dxyQnKg/168s.jpg", "caption": "Singapore noodles. Super good"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/zfhFs6uTO_3ekGCh9ydAIA/168s.jpg", "caption": "Chicken fried rice. Really good"}]}}, {"review": {"des": "I'm not sure how crowded this location in Chinatown would be during peak hours, but my friend and I were seated right away when we came for a late lunch at around 2 PM. I love that they serve dim sum even in the afternoon!<br>We shared the shrimp dumpling ($4.50), pan fried green chive cake ($3.95), rice crepe with fried donut inside (3.95), pork and preserved egg congee ($3.95), and crispy pork belly Macau style ($6.50). All were really good and authentic!<br>Worth a visit if you're craving some good, inexpensive dim sum.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/TQ5bV_i6WzPfi1KMx41mHw/348s.jpg", "caption": "Rice crepe with fried donut"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/C1dEVO31zg89kwuY8Oh6zA/168s.jpg", "caption": "Feast"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ef2YEUletMlJdCQHQFxtgg/168s.jpg", "caption": "Pan fried green chive cake"}]}}, {"review": {"des": "Many of the Chinatown restaurants is Szechuan. Finally this restaurant represent Cantonese Restaurant. I would said, it is the best so far at Chicago after my three visit. The price range very by the selection fish. It is wide range of selection. So it is difficult to classify the $$$ value of the restaurant. They have some very expensive dish and also very affordable dish. <br><br>The menu is very extensive. May be required over 20 visit or have group of ten to try many dish at once. Their menu includes dim sum or traditional Cantonese or delicate Cantonese. I like the choices here. High tech menu tablet. <br><br>We started with the special soup of the day. This soup is braised in old flame meaning low flame. The Chinese herb is exquisite. Love this old tradition Cantonese style soup. Our appetizer is the Cutter fish roll in Theochew style. The cutter fish was grind and wrap in tofu skin and fried. Very close to my hometown food. We also have the grilled lamb skew. They are good too. <br><br>Our main dish is the Japanese Tofu with golden straw mushroom. It very excellent dish for vegetarians. We also have ginger scallions fish fillet. Very flavorful with high heat wok technique. Our last dish is the pan fried turnip with XO source. <br><br>All our dish are good. Services is good. Overall is true 5 stars restaurant.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/XE86Hh8efyJw66fcuHETng/348s.jpg", "caption": "Grilled lamb"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/8EZ8IfHrujKGC9KLTlvrLw/168s.jpg", "caption": "Cutter fish roll"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Cx6PrfttkOcwV-GamyGUIg/168s.jpg", "caption": "Ginger scallions fish fillet"}]}}, {"review": {"des": "Nothing amazing about this dim sum joint. If you're in the neighborhood and craving some, MingHin will do the trick. They offer your standard dim sum fare with a wide range of opening hours to accommodate all your odd-hour cravings. Their space is fairly large so you can definitely bring a larger group. It does tend to get fairly busy on the weekend but you shouldn't be waiting too long. The prices are reasonable and the service is efficient.<br><br>It's not terrible but nothing life-changing. There are better dim sum places out there but MingHin won't disappoint.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/UHIsO3G6uUrv-Zy33gro9Q/348s.jpg", "caption": "Chicken feet, Chinese broccoli"}]}}, {"review": {"des": "Went there with a large party (12 people) for my first trip to the restaurant itself.  I don't know that I felt differently about the food from my last review (still consistently 3.5 - delicious but not the best ever) with the addition that I enjoyed there Beijing Duck which I had not tried there before.  It is clear to me that the service elevates my previous review - which was delivery and truly only focused on the quality of the food and delivery process.  I felt very well attended to, they worked with me in planning a large group, were attentive and very kind.  An experience like this reminds me how eating at a restaurant where service is impeccable can elevate the dinning experience entirely.  <br>Thank you so much for the lovely service!  Also super affordable prices!", "pics": null}}, {"review": {"des": "I always try to make a trip to Minghin Cuisine whenever I'm in Chicago. I came here on a Sunday morning around 9 A.M. I was able to get seated and have my order taken right away. The ordering process is simple. They give you a dim sum menu with blank checkboxes, so you can write in the quantity next to the item you'd like. As you may have guessed, this isn't the traditional dim sum place where the staff roll carts of food to each table. Instead, you order à la carte here.<br><br>I ordered the shrimp dumplings, siu mai, home-made fish ball, baby cuttlefish with curry sauce, sticky rice in lotus leaf, pan fried vegetable roll, beef crepe, egg yolk paste bun, and pork with preserved congee. Nine or ten items were definitely enough for three people to share. All of the items were satisfying to taste. My favorites were the cuttlefish and congee. The service was great. My table never ran out of hot tea and the food came out quickly. To top it all off, the food was cheaper than expected, and they allowed us to split the check amount between two people.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/LH7Wr1rlTH4TeX_EoPykrw/348s.jpg", "caption": "Left: Beef Crepe; Right: Stuffed Sticky Rice in Lotus Leaf"}]}}, {"review": {"des": "After a bit of traveling I got home sick and craved for dim sum. Minghin was very promising with the vast amount of reviews, their website states they won numerous rewards, and it's located in china town. Maybe it was the high expectations and the yearn for some really great dimsum, but this place left me a bit underwhelmed.<br><br>Parking- there is a self pay lot at the entrance of the China Town Gates @ 2130 S. Wentworth Ave. It's about a block from the restaurant but they validate! So it's only $2 for the first 3 hrs. Ask for a validation ticket as you leave.<br><br>Restaurant- dimsum to order meaning no carts. They give you an order form to mark and will bring out the food. There is also a tablet on the table if you want to order main dishes/ dinner items. We came for dimsum so the waitress took it away. They do not have soy sauce or chili on the tables so ask.<br><br>Food- I judge every dim sum restaurant by my 4 favorite dishes. Sui Mai, shrimp rice rolls(shrimp crepe), deep fried taro, and chicken feet.<br><br>1. Sui mai- 5 stars, each order came with 5 instead of 4 sui mais! The meat was chopped just enough giving nice texture, seasoning was good, and each had a slither of mushroom.<br><br>2. Chicken feet- 3 stars, seasoning from the black bean marinade had an herbal flavor that was a bit overwhelming for me, but each foot was cut in half making it easier to eat.<br><br>3. Shrimp Rice Roll- 2 stars. This is my absolute favorite dimsum dish so I am very critical. The dish LOOKED amazing coming out, it looked shiny and silky, the rolls laid on top of a pool of dark soy sauce. Looks can be deceiving.. The flour roll was not silky, it was too thick and slightly dry as you bite into it. Soy sauce needed a bit more sugar to balance out the flavors. The shrimp was the best part, cooked to perfection. Total disappointment.<br><br>4. Deep fried taro- 5 stars, the outter layer was thin yet crunchy, taro layer was thick with great taro consistency, and the meat inside was well seasoned.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/X7q5sZcFguBXB2w7MrNICA/348s.jpg", "caption": "Tablet for dinner items and paper menu to mark your dimsum orders"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/y-q-VAY2Sa5ViAu4cYgFGw/168s.jpg", "caption": "Chicken feet and preserved veggie and pork congee"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/-C-96g0JkSlqkbvfylwb_Q/168s.jpg", "caption": "Parking lot to the restaurant bc I didn't know where to park. Ask for validation. Hope this helps someone bc I could have used it!"}]}}, {"review": {"des": "Dim summon! Love me a good dim sum spot. Headed over on a Sunday morning around 11am. The crowds were pretty massive. I did find out while waiting that they seem to take reservations. A lot of ppl had reservations. If I ever come back, I'll come with reservations haha<br><br>The wait was about 15-20mins before we were seated. Nothing excessively long. The guy working the front, handing out numbers, was seriously the most pleasant dim sum greeter I've ever met in my entire life. Typically, it's a \"here's your number\" *now go away and don't ask questions* kind of attitude - but not here! Super, super friendly. <br><br>When we did finally get seated, we were left with a sort of iPad situation to order cooked dishes and a paper sheet to order dim sum. With two ppl, it's hard to get cooked dishes, along with dim sum, so I'll have to save that for another visit. Stand-outs were DEFINITELY the baked salty egg yolk bun (prob the BEST one I've ever had in my whole life!!) and variations of shrimp dumpling. They had excellent wrappers, that didn't fall apart at the touch. <br><br>Was it the best dim sum I've ever had? No. But would I return? Yes, yes. 4 stars.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/be3uRJyFCKE-6jpoIyEDAg/168s.jpg", "caption": "Baked Creamy Egg Yolk Bun (THE BEST)"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/5GfguE8RS9WALXoX41AV4A/168s.jpg", "caption": "Shrimp Dumpling w/ Green Chives, Baby Cuttlefish w/ Curry Sauce, Baked Creamy Egg Yolk Bun"}]}}, {"review": {"des": "Pretty good Dimsum in Chi-town!<br>Who would have thought? <br>Met a friend here for lunch <br>While I was visiting for a conference <br><br>The honey beef ribs were very tasty<br>As were the chive and shrimp dumplings<br>And these shrimp fried roll things <br><br>But the star of the show was the potstickers <br>Omg! So, so good! <br><br>I have definitely had better dim sum here in CA<br>But I would rec this as a solid spot in Chicago<br>It also gets super crowded so come around 11!", "pics": null}}, {"review": {"des": "Went here at the MingHin Cuisine and had a nice dining experience here. The staff and quick service. I ate a roasted duck along with pork BBQ which I find great. I got my meal not so long, well made with good quality. Highly recommended!", "pics": null}}, {"review": {"des": "I came to this place yesterday second time and I like this place. Traditional Asian/ Cantonese atmosphere, food and interior design. We ordered so many different Chinese dishes. Appetizers and entrees were amazing, food keep coming, I loved their noodles, Beijing duck and many other dishes that I don't remember the name. Btw their green tea is awesome as well as desserts. Btw this is how private room look like. They also can do weddings or celebrations", "pics": null}}, {"review": {"des": "(English)<br>Craving dim sum on a Sunday afternoon? Well, this is your place to go. Located in Chinatown Square, this place will make you enjoy dim sum like no other. <br><br>The restaurant has a very enjoyable and inviting decor. They have a large selection of dim sum to choose from, along with a large menu with other dishes that include meats, rice, and noodles. We ordered 4 types of dim sum and they were all delicious and amazing looking. The composition of the MingHin's Shrimp Dumpling, as well as the Shrimp Crepe with a delicious sauce and texture. BBQ Pork Bun, soft and slightly sweet buns that complimented well with the pork filling, and the shining Lotus Seed Paste Buns which were beyond delicious. <br><br>I would definitely go back for MingHin's dim sum, it's not just an amazing restaurant, but is located in an amazing neighborhood. Good prices and great service. <br><br>(Español)<br>Anhelo de dim sum un domingo por la tarde? Bueno, este es tu lugar para ir. Ubicado en la Plaza de Chinatown, este lugar te hará disfrutar del dim sum como ningún otro.<br><br>El restaurante tiene una decoración muy agradable y es muy acogedor. Tienen una larga selección de dim sum para elegir, junto con un gran menú con otros platos que incluyen carnes, arroz y fideos. Pedimos 4 tipos de dim sum y todos eran deliciosos y de aspecto asombroso. La composición de la bola de masa de camarones, el MingHin's Shrimp Dumpling, al igual que la crepe de camarones con una deliciosa salsa y textura. BBQ Pork Buns<br>unos bollos suaves y ligeramente dulces que se complementaban bien con el relleno de cerdo, por ultimo el brillante bollito de pasta de semillas de loto, que estaban más que deliciosos.<br><br>Definitivamente regresaría por el dim sum de MingHin, no es solo un restaurante increíble, sino que está ubicado en un vecindario increíble. Buenos precios y gran servicio.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/qWPLDTVFq-rOR8hW4obSRg/348s.jpg", "caption": "Lotus Seed Paste Buns"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/rTf7la5FMXV0EU8oBwp5Dg/168s.jpg", "caption": "BBQ Pork Bun"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/2y4ajN6-m4uASvK4cWs7gg/168s.jpg", "caption": "MingHin’s Shrimp Dumpling"}]}}, {"review": {"des": "I liked MingHin but I did not love it. It was good...<br><br>The room was slightly modernized and clean. There was a random chandelier in a doorway and lighted murals on the ceiling. Booths and tables make for a variety of seating. However, loud rap music poured out of the open kitchen and filled the dining room. No thanks! <br><br>Service was kind and efficient. The server was very sweet and helpful. <br><br>I heard rave reviews about the food so perhaps my expectation was high. To be fair my egg roll was de-lish. But my veggie entree was, well boring. Everything was fresh and piping hot. I found the variety of veggies was a bit boring. There were so many pea pods, chicory and big pieces of a crunchy white vegetable. I usually enjoy a bit more variety and a tad more taste. <br><br>I parked, entered and exited on what I think is the back side of the restaurant. The side that faces Cermak instead of the courtyard. I must admit it looks frightening. When I left and was getting into my car, a hobo under the influence tried to get into my car with me. I literally had to yell and slam my door. <br><br>So the bottom line is I had a decent dinner but will not be rushing back!", "pics": null}}, {"review": {"des": "Came here for Dim Sum; ordered MingHin Shrimp Dumpling, Chicken Feet, Pan Fried Vegetables Rolls ,Shrimp Crepe, Beef Crepe, BBQ Pork bun, chilled Jellyfish, Chicken Feet, Egg Tart. Coconut Jell <br><br> Everything was delicious.  The only thing I would not order again would be the Chicken Feet, not a lot of meat, mostly skin and bone. The coconut jell was a nice fresh light touch <br><br>The service was outstanding", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/NS8Cy8QqxrKyuFHfuc3XnQ/348s.jpg", "caption": "Chilled jellyfish"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/fs09CDZYjXGyEuFyY8CaHQ/168s.jpg", "caption": "Braised beef varieties"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/G6zfQqIGHryuH5uKexDYyg/168s.jpg", "caption": "Coconut Pudding"}]}}, {"review": {"des": "Our go to for dim sum in Chicago on Sundays! Located in Chinatown Square! Try to make a reservation, if you have a group. <br>Otherwise, you'll wait but it's not that bad because you can explore the things around you, and take turns waiting! <br>This place has a good selection of shrimp dumplings and we also ordered shrimp egg rolls, steamed fish and thick rice noodles with beef, deep fried beans   Spare Ribs w/ Black Bean Sauce, & some barbecue buns to take home.<br>We ordered the coconut pudding for dessert which was light and refreshing.<br>Great price for dim sum! Clean bathrooms. <br>Afterwards, you can go shopping in the cute little shops outside! <br>Perfect place to take guests and a nice history and cultural experience! There were kids on field trips and families exploring stores !", "pics": null}}, {"review": {"des": "Never knew that you could have a wedding reception here.  Pretty awesome as the whole upstairs was turned into 2 rooms for a reception venue.  Speakers were available to hook up your phone for music if you wanted to go that route.  There was even a room available for the bridal party.  And most importantly,  open bar was an option! <br><br>So I was surprised at the drinks available at open bar.  The pina coladas were fabulous.   Pina coladas are one of my favorite drinks and they made them really good here.  The peach mojitos were also divine.  A little on the sweet side but i did not mind it at all.  The other drink available was a mai tai, but i was only able to take a sip off of someone's drink and it wasn't  cold anymore.  So next on the mai tai.  <br><br>The food that we had was delicious.  Crispy chicken and duck was flavored well and had a nice fresh crisp to the skin.  The beef with asparagus was nice and juicy and yhe asparagus was fresh.  Lobster was awesome.  For some reason though,  this being a Chinese Restaurant, they served us the rice LAST.  What in the world was all that about?  Every Asian person knows that you have to eat EVERYTHING with rice and if the rice aint there then your meal aint complete!  Then when asked where the rice was,  our server said it wasnt part of the order.  Yeah right.  That was corrected right away cuz that was a lie.<br><br>Anyways, I'm over the rice venting.  Other than that the service was good.  We had the whole place from 5pm until 2am if we wanted.   <br><br>Only issue is there is a parking lot outside but its metered parking.  I believe they do validate for the lot which a a further walk down but i couldnt tell you exactly where that lot is.<br><br>Anywho, thats all for now.  Ill be back to try them again for their dim sum on a different day.", "pics": null}}, {"review": {"des": "This place has a decent selection of dim sum. However, it is different from most dim sum places I've been to. There were no carts. They just give a sheet of paper that has pictures and you check off which dishes you'd like. We definitely ordered way more than we could eat. It was my friend's first time trying dim sum and I felt like he didn't get the whole experience. I'd probably try a more authentic dim sum place next time.", "pics": null}}, {"review": {"des": "Large banquet style dim sum restaurant in Chinatown. Interior is similar to the large chinese banquet halls although MingHin is smaller because they split it on two stories. This location gets pretty busy, although they keep people moving very quickly. On Sunday during lunch time we waited about 15 minutes. <br><br>They do not do the push carts - everything is a la carte off a menu with full color pictures. Otherwise, service, selection and price are fairly typical of a dim sum restaurant. They've got all the favorites - egg tarts, buns, congee, and a wide selection of steamed dumplings. You can order off the paper menu by checking off what you want, and you can also get things from the full a la carte menu (off the regular dinner menu) from the ipad. Staff is very prompt but otherwise scarce. You have to flag people down but once you do, things come pretty quickly. The food did come in a bit of a delayed order, with some of the dishes coming right away and a few coming after we had eaten most of it. <br><br>The salty egg bun with the crusty sugar top is a solid option, although a bit polarizing with the savory-sweet combination. They have a very wide selection of dumplings although all of them were on the greasy side. The crystal shrimp dumplings were the right flavor but fell apart when we ate them, with the skin a little dry. Pricing was pretty solid, and we stuffed ourselves for 2 with the bill coming out to about $30. My one gripe with the experience was that the tea was WAY too heavily brewed and came extremely bitter. We asked for multiple hot water refills before it got diluted enough.<br><br>Overall, I think MingHin is a solid dim sum option. Everything we had was up to snuff and tasted solid - really satisfies the craving, although it wasn't anything on the menu that totally wow'd.", "pics": null}}, {"review": {"des": "Does Chicago lack dim sum or something? Seriously don't understand the hype of this place. Came in and got a number. Walked around for 15 minutes, sat for another 5 minutes in the restaurant and our number got called. For the fact that there were 20 people ahead of us, 20 minutes wasn't a bad wait at all. There's also an upstairs to this place so it's a massive restaurant. <br><br>We ordered the shu mai, brisket, shrimp dumpling, chive and pork dumpling, sticky rice in banana leaf, and Chinese donut wrapped in the thin coat of rice noodle. Only thing stood out was the chive and pork dumpling. Everything else was super average. The Chinese donut was stale and dry. Very disappointed in that. <br><br>Service was good. Waiter was checking up on us multiple times. You get the menu and then write in what you want then hand it back to them. But this place definitely isn't worth it.", "pics": null}}, {"review": {"des": "I really do make a calculated effort to always try a dim sum in any city that has a China Town.  The reason why I do this, is that just like with any other type of restaurant, different chefs cook food very differently.  The first thing I look at before I even come, is if they serve obviously pre frozen dim sum or if it's fresh.  That can sometimes be difficult, but with a little research, you can find the answer.  <br><br>So let's talk about the food!  I found most of their food to be extremely delicious.  I also found their translations to be quite hilarious.  I've never seen a dim sum restaurant label some of their noodle dishes as \"crepes\".  I completely get it though.  If you are serving customer who haven't had Dim Sum or trying to attract new customers, that's the easiest way to do it.  <br><br>This particular restaurant has you order a la carte.  I prefer the rolling carts myself, but today it was perfect because we were in a hurry.  They have a large menu with a lot of classic favorites.  The cherng fun is very tasty here and the beef and shrimp style is packed with meat.  My wife said her chicken feet were good too.   I was not a fan of their version of tsa leung though.  They deep fry the bread and it's too crunchy.  I also didn't like the beef balls. They were too loosely packed.  That kinda bums me out since they are a favorite of mine.  <br><br>I do recommend coming here though as the price was pretty decent. 7 dishes for about 32 bucks.", "pics": null}}, {"review": {"des": "Very solid restaurant in chinatown! In terms of food, I would say this is a 4/5 stars. Very tasty dishes and the dim sum here is usually not disappointing. Bare with me and continue reading to find out why it was only given a 3/5 star rating. Parking had nothing to do with it as parking on the weekends in chinatown is a hassle regardless. <br><br>The reason why it was given a 3/5 star was because of the cleanliness of the restaurant and the service. The service was available and usually fulfills your needs when you ask them. A few problems that occurred was that they would bring a tea pot of hot tea over a child's head; if nothing spills over the child, they are fine. But the fact that there can be a possibility of hot tea being spilled on a child's head scares me in terms of the quality of servers here. Another thing was that when they served the dishes, though it might be because they are heavy and large plates, but that should not give them the reason to grip on to it with their thumbs basically touching the food. Very unsanitary act from the servers. Would probably question if they really passed any food sanitation class/course/certification before working here. <br><br>Another thing as you see in one of the pictures I have taken, the seat/couch in one of the private rooms are extremely dirty. Much rather sit on the floor outside than on this. The plates were not cleaned very well either.<br><br>In all honesty, I would rather eat at Phoenix or Lee Wing Wah! Food is slightly better there, service is good, and most definitely feels a little cleaner. But if you don't care about the environment, minghin wouldn't be a bad location to eat at!", "pics": null}}, {"review": {"des": "3.5 stars<br>Very typical dim sum menu. I was expecting cart service considering how big the place was but instead they have tablets for their regular menu and paper menu for dim sum items. There seemed to be lots of tourists and locals as well. Service was good -I always expect to be abused at Chinese restaurants, otherwise it does not feel quite right haha.  <br>Overall good food but nothing extraordinary.  The place does get packed, we arrived around 11am on a Saturday and by the time we left there was a long line.", "pics": null}}, {"review": {"des": "This is definitely not a place for vegetarians!<br>I have been to many dim sum places- and I don't expect much options. <br>However, first the waiter told me they couldn't make fried tofu without pork. Then he told me they couldn't make vegetable dumplings. Then he told me they couldn't make the fried rice without meat. This was all very confusing. Either it's pre-made back there or we just got a jerk waiter.<br>Also, the sesame balls were barely filled! <br>The noodles, however, the ones made without meat, were  SO GOOD. That's where they get my two stars! <br>My friends got too full to try the desserts- so maybe I'll give this place another shot someday!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/fq5-8SlAu-558Ffa3wPlKw/348s.jpg", "caption": "Bean Sprout Soy Sauce Chow Mein"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/cS9bf608ntncKIySOUyssw/168s.jpg", "caption": "Array of dim sum!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/F4X1Isis54aUwO7gWcQO0g/168s.jpg", "caption": "Deep Fried Sesame Ball"}]}}, {"review": {"des": "One of my favorite Dim Sum places! You order from a menu instead of a cart, which I prefer because you don't have to anxiously await for some shrimp crepes while being offered chicken feet or something else that you have no interest in. <br><br>I get to mark what I want and it comes shortly after. The lines get crazy on the weekend, but I think it's because it's a great place for large parties or family meals.<br><br>I like to wait till we eat all the savory items then order the steamed yellow rolls. That way they are soft and warm and just a bit of a sweet bite to finish your meal.", "pics": null}}, {"review": {"des": "This place is pretty good. We got the orange chicken, some vegetable fried rice and pork buns. The pork buns weren't the best I've had and the rice felt a little oily but the orange chicken was definitely one of the better ones I've tried. The breading was light and the sauce wasn't terribly sweet. Good flavor. <br><br>Service needs some work. Our pork buns arrived well after we had finished our meal which was very strange. I hardly had room for them. It was also hard to locate the server to ask for updates. <br>Conclusion: service 2.5/5<br>Food: 4/5", "pics": null}}, {"review": {"des": "I have been here three times so I think I can give a pretty good review and thoughts on this place.I have only done Dim Sum here, but that is their specialty I find this place both familiar, but also with a dash of a unique Chinese adventure! <br><br>First, I adore the little mall that it is situated in. Its an open air market with stores, bubble tea joints, and great finds like MingHin. It kind of adds to the adventure. The restaurant looks small from the outside, but inside it is gigantic and full of corridors and rooms that add to the whole foreign \"weirdness\" (in a good way). It made me feel like I have stepped into a new country. This place is also full of Asian customers. I have an informal rule that if you find lots of people of the nationality of the cuisine in the restaurant, then the place is probably awesome! <br><br>The Dim Sum menu is mostly pictures, but they are pretty accurate and you can just check which items you want. I went with my friend MW a few times and he speaks Chinese. He did all the ordering. When I went with my parents, I ended up choosing for us. I got to bring back MW. <br><br>We mostly got baos, dumplings, shu mai, and ribs all three times I have been there. All the food has been outstanding and some of the best Chinese food I have ever eaten. They are also very generous with the portions which made the bill super affordable for what we got. <br><br>The service was good, but not great. If you are there with somebody who is Chinese, I think you get a little bit of a better service. I think there is sometimes a language barrier and the menu can sometimes get a little daunting for us \"white people\". I felt I got a little better service with MW than with my parents. However, compared to other places in Chinatown, they are still much better. I had an awesome lunch with my parents there, but there was a little bit of a confusion on the food. They gave us a bigger plate of ribs than we asked (and charged us more). While the server was very apologetic, she never offered to give us the big plate and small plate prices. It was only a few dollars different so we thought it wasn't worth it. Plus, we probably needed the bigger plate of ribs for our group anyway so good on her for \"guessing\" our larger appetites. <br><br>I know how scary Chinatown can be, especially if you are new to Chinese cuisine and culture. This is a perfect first intro place to Chinatown. The food is fantastic, the service is helpful, and it won't break the bank. Isn't that the things we want in a restaurant anyway? Go and have an adventure!", "pics": null}}, {"review": {"des": "I love this place for dim sum! The pork belly is my favorite! They do it right and it's crispy and delicious! All of the dumplings are great too! If you're feeling it, the octopus and the chicken feet are some of my favorites too! <br><br>I take everyone here because it's the best spot in Chinatown and they have many other great locations!", "pics": null}}, {"review": {"des": "I have eaten at MingHin before but at the Rolling Meadows location.  The time we ate there the food & service was outstanding, not so much at the Chinatown location.  <br><br>The Chinatown MingHin is located at the west end of the newer section along Archer Ave.  The restaurant has a very nice decor and is very inviting.  They have the same selection of dim sum along with dishes that can be ordered.  We ordered 3 dim sum dishes and to dishes from the menu.  <br><br>DIM SUM DISHES (Pro Tip 20% off before 4pm)<br>* Stuffed Bean curd w/shrimp & pork (excellent highly recommended)<br>* Deep fried shrimp egg rolls (very good soft succulent shrimp w/crispy egg roll skin served piping hot)<br>* Pork & shrimp Shu mai (mediocre can get this anywhere)<br>MAIN DISHES<br>* Fried Rice noodle w/Beef (oily noodle (not crispy, very tender beef).   I would not recommend this dish.  <br>* Shredded BBQue Duck w/pan fried rice noodles (this dish was also very oily and wasn't very good)<br><br>I found the food to be mediocre w/the exception of the divery disappointing as was the service compared to my meal at the MingHin Restaurant in Rolling Meadows where both the food and service were spot on.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/xql-FEYRpWPcSwGFBUtNkQ/348s.jpg", "caption": "Very nice interior space"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/zuD0aMwPl5YHP7IIK7W7EA/168s.jpg", "caption": "Facing common space between restaurants"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/tJRu4cP7_V8v0h6Vr6Eg0Q/168s.jpg", "caption": "Chinatown MingHin along Archer Avenue"}]}}, {"review": {"des": "My first dinner here in Chicago was solid. Coming from Houston, I had my own expectations of Chinatown and Chicago dim sum did not disappoint! <br><br>Setting/Service:<br>First off, the interior was clean. there were different sections of the restaurant that offered different vibes. Romantic booths, large tables for group parties, or a cultural dining experience in the front. The service was great, and I appreciated the pictures/tablet method to order for those who aren't as familiar/comfortable with ordering. <br>The service was inviting and respectful. Everyone greeted you as you walked through, and they made sure to be attentive. <br><br>Food:<br>In terms of price, MingHin is a bit more expensive than I am used to ($1 more/dish), but I was still happy to pay in terms of quality of the food and service I received. <br>Shu-mai: one of the best I've had.  They give you 5 dumplings for a Medium order, and the pork is fresh with generous portion of shrimp. We loved it so much we got a second order. <br>Shrimp dumpling hakgow and pan-fried turnip cake: both were good. It's hard to mess these up.<br>Pork belly Special: Delicious and the skin was a perfect crisp! Chewy, juicy, perfectly caramelized. I would recommend this if you're a pork belly fan!<br>Crispy Pan Fried Noodle with Seafood Sauce- this dish was the only one that I had reservations about. I was really craving a crispy ramen-like texture, but the noodles were drenched and soggy within seconds.  The sauce was generous but not as potent in flavor as I'd like. The seafood portion was generous with scallops, cuttlefish, and vegetables, so I still enjoyed it, but I have definitely had better.<br><br>Craving dimsum after a long day? Wanting to explore more asian cuisine? Want to plan a nice graduation lunch/date dinner? This is a great pick!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ubjT8G_L_lrxHMmqvKbwaQ/168s.jpg", "caption": "PanFried Crispy Noodle in Seafood Sauce"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/BjzVx2csP7nRj_orjf0zMg/168s.jpg", "caption": "Shu Mai- spectacular"}]}}, {"review": {"des": "MingHin is one of my favorite spots in Chinatown because I love their dim sum. The service and food is always there and that's something I can appreciate. I've been here probably a dozen times because it's just delicious and their menu is easy to navigate for Chinatown newbies.<br><br>If you haven't done dim sum before, dim sum is ordering small plates to share with people. Most things come on a plate with 3 but some come with 2. Their menu has pictures so even if you don't know what the dish is, you can get an idea from the pictures.<br><br>My favorite dim sum dishes:<br><br>Stuffed Sticky Rice in Lotus Leaf - yummy rice all wrapped up in a leaf. The stuffing is delicious and I love sticky rice.<br><br>Pan Fried Turnip Cake - I had never had turnips before coming here and now I love them. They're like a potato pancake is the closest to how I can describe them. Turnips are root vegetables so they don't have a ton of flavor on their own. But the hot sauce they put on the table goes well with these!<br><br>Deep Fried Taro Puff - These things are weird but I love them. It's a stringy puff thing and it tastes delicious.<br><br>Overall I definitely love this place. One thing to note is that it is super popular Saturday mornings so prepare for a wait. Dinner doesn't usually have that long of a wait.", "pics": null}}, {"review": {"des": "Went here for dinner on a Friday night. Started with a few orders of dim sum: <br><br>Shrimp Dumplings: wouldn't order again, texture was a little slimy for me<br>Chicken and Dried Scallops Buns: pretty good, a little too much dough compared to the amount of meat inside <br>Pan Fried Pork Stickers: delicious, really liked these<br><br>This was my first experience with dim sum and I must say I was a little disappointed. However, our entrees more than made up for that:<br><br>Beijing Duck: First they brought out a platter of the duck skin, buns, and a sauce. Then a plate with the duck meat and vegetables. The skin was crispy and paired well with the sauce inside the buns. The meat was delicious as well. Definitely recommend this dish! We shared the half portion and were impressed with the size.<br><br>Eel Fried Rice: Hands down the best fried rice I've ever had. I plan on ordering this for take out frequently! The eel added an interesting flavor as well.<br><br>All in all had a great experience! Quick service, inexpensive, casual environment. Will be back!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/fKVyHOLR-Qp0DZPUzKb5wQ/348s.jpg", "caption": "Beijing Duck - course 1"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/I9O6UtlfRdICZwn43zQh1g/168s.jpg", "caption": "Beijing Duck - course 2"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/oXmz_bqusQdW7ztI5RPHVA/168s.jpg", "caption": "Eel Fried Rice"}]}}, {"review": {"des": "Arrived 7 pm ish last night.  Just before the rush of people dining in for dinner service.  Welcomed with hot tea.  To order, we had to use the iPad with pictures, a small description of the menu name, ingredients, size and price.<br><br>Ordered the Singapore noodles with shrimp.  It came out dry.  Needed more broth or sauce to make it appetizing.  The seafood soup was very good.  The egg drop soup should be dropped out from the menu list...it was Bland, watery and expensive!<br><br>Loved the shrimp balls!  Had to take 4 bites per piece.  Wished there was more sauce.<br><br>Had to pay for public parking.  Very tight space.<br><br>Fast and friendly service.  If we only new that dimsum is served past 8pm till 2 am.  We should have came late for dinner.", "pics": null}}, {"review": {"des": "MingHin has been our go-to dim sum place in Chinatown for a couple years now. We always go in a group of at least 4, or preferably more so we can get a table with a lazy susan :)<br>Usually there's a wait but it moves fairly quickly - just be sure to stick around because they really cycle through those numbers! The service is always very efficient as well. We've never waited very long for our food, but it does come out staggered. <br>Some of my favorite dishes include the pan fried turnip cake, stuffed sticky rice, bbq pork bun, congee, and garlic gai lan. Oh and always get the chrysathemum tea! <br>This time around, our group of 5 ordered about 12-15 dishes and we each only paid ~$20 each (incl. tax, tip). <br>Cheap, delicious, and always a good time!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/jteKjbVcn6T5HtqvxiUgXQ/348s.jpg", "caption": "Dim Sum Sundays"}]}}, {"review": {"des": "I went in with a buddy who knows authentic Chinese cooking.  He said that this place is more on the authentic side, so that was good.  <br><br>The food here was good and reasonably priced.  If you want dim sum, you'll order by selecting the paper menu.  If you want anything else, you'll order view a tablet they have at the table.  You will however need the waiter to come by and submit the order since it ask for a verification code to do so.  The service is just like mostly other Chinese restaurant, mediocre.  We had to flag our server down several times.  But once we got her attention, she did get us what we wanted.<br><br>The food was good.  We got a few items from the dim sum menu and a few from the tablet.  We cleaned the plates even though we were full, that shows how good it was.", "pics": null}}, {"review": {"des": "This place has plenty of photos and reviews to speak for itself but there were a couple of reasons why I did not give 5 stars. <br><br>A plus for me was that they take reservations. Dim Sum places get so busy, especially on weekends and since we were in town to see some friends, I liked that I was able to make a reservation and was guaranteed a table. It was very authentic and traditional with the large tables and lazy susans but also had a very modern look to it downstairs that I think helps attract customers. Parking is validated if you dine in Chinatown so it made parking worth it. <br><br>A couple of cons for me were that it's a communal serving experience. The person who showed you your table is not necessarily your waiter/waitress but at the same time you're able to ask anyone to help you get something. I did ask a young man if we could order with him and he simply shrugged and walked away. I finally found someone to put in our order but then never saw that same person again. Another con about this place is that with it being so busy/more modern, there are not push carts for you to pick items out of. I didn't really mind since I was able to order plenty of items off the menu and it was all ready for the table at once. We almost ran out of room at our table! <br><br>The food is amazing. The BBQ pork buns were so soft and slightly sweet and complimented the stuffing. The pork & corn cakes were a new twist from your traditional pork/chive. Congee was perfectly salty and comforting. The Beijing Duck was so crispy and went so well with the bao buns. I'm a huge lover of Chinese broccoli and the plate came out so crunchy and cooked well. My new favorite food is the rice noodle rolls, we got an order with spare ribs and another cooked in the XO sauce. We were more than full and still had a lot of food that we were able to take home. I'm excited to eat leftovers!", "pics": null}}, {"review": {"des": "Excellent dim sum all day.  Came here at night time and ordered Dim Sum.  This is place is very large and modern.  You order using a a tablet that they give you.  They bring you complimentary hot tea.  Overall a very good experience.", "pics": null}}, {"review": {"des": "What an awesome place for dim sum! We went twice while we were in Chicago and throughout both visits, we practically ordered everything. Great variety, authentic, and extremely affordable. While wasn't in love with everything, I certainly enjoyed both meals. Here are my favorites:<br><br>- Beef or shrimp crepe<br>- Short rib with honey sauce<br>- Siu Mai<br>- Minghin's Shrimp Dumplings<br>- Deep Fried Spring Roll<br><br>I also really liked how they served tea with our dim sum as well. Bonus points on that! Heads up - when checking out, they can only use up to 3 cards. Something to note if you're planning to split the bill.", "pics": null}}, {"review": {"des": "My husband is half Chinese...we travel full time...so we spend lots of time at Chinese restaurants - and I must say that this is one of the best that we have been too in the whole country. <br><br>Great service! They have a tablet for the menu! So handy! Food comes out so fast! The atmosphere is great!<br><br>Totally recommend!!:)", "pics": null}}, {"review": {"des": "I was not expecting this. Before arrival I thought I knew what good Chinese food was, but this place changed and elevated my definition. Everything was brilliantly delicious, and I would definitely want to revisit this place for both its food and service.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/W8Vd6dE53ubKi5S5DPUBdQ/348s.jpg", "caption": "Egg fu young"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/4pieFbMVRToVKOf4yocjiQ/168s.jpg", "caption": "Potstickers"}]}}, {"review": {"des": "OK first of all do not ever be scared away from this place because of the crowdedness.. it is full of people because it is freakin' great!  And the turn around time isn't usually long. <br>If I ever have out-of-town visitors, this is the place that I always bring them.  The dim sum is great and the service is quick and by quick I mean so super duper fast.  We usually tend to order way too many things but they're so tasty that it's always finished.  My favorites are the shumai and the curry cuttlefish.", "pics": null}}, {"review": {"des": "There are honestly so many dim sum spots in Chinatown! But this one is probably the most \"well-known\" and has the most locations around Illinois! There will be a wait for sure! But most likely not too long depending on when you go! We were there probably around 11am? It was a short wait for our group of 9. The restaurant idle is quite spacious - 2 floors.<br><br>Parking:<br>We parked in the semi outdoor structure under the metro and I believe Minghin will validate parking for 2 hours!! <br><br>What we ordered:<br>[My recommendations]<br>- 榴蓮酥 Durian Cakes (I personally LOVE durian flavored things )<br>- 蜜汁牛仔骨 Short Rib with Honey Sauce<br>- 蜂巢荔蓉芋角 Deep Fried Taro Puff (My childhood fav!!! Still love it!!) <br>- 好味醬蒸鳳爪 Chicken Feet w. Special Sauce (My all time FAV!!)<br>- 鮮蝦豆苗餃 Shrimp Dumpling with Pea Tip <br>- 腊味蘿蔔糕 Pan Fried Turnip Cake<br>- 名軒蝦餃皇 MingHin's Shrimp Dumpling<br>- 蠔皇叉燒包 BBQ Pork Bun<br><br>[Other items that weren't bad]<br>-鮑汁鮮竹卷 Stuffed Bean Curd Skin with Pork & Shrimp <br>- 夫妻肺片 Sichuan Sliced Beef in Chili Sauce<br>- 柱黃蒸燒賣 Siu Mai (Pork & Shrimp Dumpling - one of the most popular dim sum dishes but I've never LOVED it...)<br>- 珍珠糯米雞 Stuffed Sticky Rice in Lotus Leaf (I didn't get to try this but i usually like them!!)<br>- 芋絲炸春卷 Deep Fries Spring Roll<br>- 鮮蝦腸粉 Shrimp Crepe<br><br>Overall, the food was delicious! Dim sum does always get a little pricey though!", "pics": null}}, {"review": {"des": "Authentic, Delicious, Affordable<br><br>I love MingHin. It's one of my favorite places to eat in Chinatown, and I've never had a bad experience. The vast menu, ranging from traditional dim sum to Fried Duck and Chow Mein Noodles, is somehow executed well across the board. The service has always been excellent, and I find myself consistently stunned by how affordable everything that I eat there is, especially for the quality.<br><br>For those of you that don't know much about Chinese food besides the General Tso's Chicken your order at your local Panda Express: Have no fear, here's a quick guide on some of their home runs. <br><br>Crispy Duck 烤鸭 - Kao Ya, pronounce Kao Yahhhh for those of you who want to give traditional ordering a try. Fried Chinese duck is an amazing dish, and one that everybody should try. The meat is tender, juicy, and unbelievably succulent. It's a must try. <br><br>Shrimp Stuffed Dumpling - This is also a home run. Thin spring roll-esque wrappings are stuffed with molded balls of shrimp that are juicy and have a lovely texture. <br><br>Chicken Feet - Minghin's chicken feet is both an amusing way to terrify your less adventurous friends, but also a delicious authentic interpretation of a classic Chinese dish that shouldn't be ignored. Chicken feet has a lot of glutenous elements that break down during the cooking process, giving the chicken a shockingly tender quality and has a wonderful flavor. <br><br>Turnip Cake - Turnip Cakes are always a surprise, event to some of my Asian friends. They should not be passed up though. Turnip, when cooked right, can have an amazingly fluffy texture and can be shaped similarly to a hash brown. Instead of being crisped and fried though, MingHin steams there to give it one of the fluffiest textures you'll ever experience. <br><br>Other than that, just give a look at the Dim Sum menu and pick what looks tasty for you. More than that, if its you're first time in Chinatown, give anything strange a go. Be adventurous!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/xoW12JuVzGobed_sb0bC0Q/348s.jpg", "caption": "Duck 烤鸭"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/dgfavxLYLGozO4CxhEBCtA/168s.jpg", "caption": "Turnip Cake"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/cIEvZAxxdlKpCmVj0Q6jMw/168s.jpg", "caption": "Chow Mein with Beef"}]}}, {"review": {"des": "We were in the mood for dim sum this morning and was planning on going to the Dolo Restaurant but went to Minghin instead due to the number of reviews on Yelp and the high remarks. After we finally got to Chinatown and made our way to Minghin we can see the reasons for high remarks and the numbers of reviews received. We came through the backside of the restaurant and didn't wait very long for our table.<br><br>While waiting for our table, the host gave us the actual menu to review and check out what we were going to order once seated so to be more efficient. We were seated at the right time before the big rush came through. We didn't feel rush to finish our food so they can turn table over to accommodate the rush. The restaurant is clean and had a good amount of seats in the waiting area. The cool part of the waiting area seats were repurpose drums.<br><br>Service was good and it would be 4 stars if we were told upon being seated how everything works since it was our first time. The wait staff came by to ask wherever we wanted tea but spoke very quiet that it was hard to understand and we felt like we couldn't ask them any questions. It felt a little awkward like they were not excited for us to be there. Usually we would be greeted and ask whether we've been there before and then the wait staff would explain the process of ordering since we are accustomed to having the carts with the food go around and we just point to order instead of ordering everything all at once. <br><br>The food is 4.5 stars. Every dish had a good amount of flavor and we didn't have to use soy sauce or the chili oil sauce but it made it tastes better with a little spice. I love that they use fresh ingredients for all the dishes especially the fried taro cake. It had chunks of taro and a good balance of seasoning. The country style dumpling was awesome with a good marinate of the shrimp that it didn't taste fishy or too empowering of the shrimp taste. The changzhou dumpling tasted little like a soup dumplings with peanuts and minced meat it was great. The custard roll was a densed dessert cake and not too sweet but after all the food I could only finish one roll and we took the rest to go. The fried cake dumpling was my favorite with a whole lot of meat and deep fried together with green onions or chives. The mango pudding was awesome. Not too sweet or runny. It was a perfect and I could have eaten the whole serving but had to stop to leave some for my husband. The bok choy was good with the right amount of oyster sauce drizzled any again it was better with a little dip in the chili oil soy sauce. <br><br>Overall, would definitely come back since there were so much more that we didn't get to try that we don't have at home. The tea was good and love that they go around to check to make if we need more or not. The wait staff was attentive when I had the lid half way on the tea pot and came over right away to refill the tea. A very good price for the amount of food we ordered.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/DC6Xn-tMvOPtbYmCRCW6qA/348s.jpg", "caption": "All the food"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/S-zS08ds8jxpAC4o3L5FFQ/168s.jpg", "caption": "The deep fried taro cakes and pan fried dumpling"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/pB4HUfWoMLNyqrfo24SEEg/168s.jpg", "caption": "An assortment of dumplings and other food"}]}}, {"review": {"des": "Dim Sum! Dim Sum!!!<br><br>What a find...thank you Yelp! After a long day of traveling, this was a terrific discovery in Chicago's lovely Chinatown. MingHin is a large restaurant and thankfully we went during an off hour. We only had to wait a few minutes for a table and ordered a mix of dumplings and appetizers.<br><br>Everything was served piping hot and fresh to order - as soon as the dishes were ready, they were brought to the table. There are 2 different menus to order from - one is on a tablet (which was quirky and kept disconnecting from the internet so that was annoying...it was a Samsung  and a bit clunky...) - the other is a paper menu that has photos with check boxes next to the items (for the dim sum specifically).<br><br>We had shumai, stuffed sticky rice in lotus leaf, 2 different kinds of shrimp dumplings and grilled chicken skewers. Yum! The dumpling \"shells\" were very gelatinous yet delicious. <br><br>This would be a great place to visit with a large group of people...and sit at one of the tables with the lazy susan in the middle...so that you can try the entire friggin' menu. <br><br>We left very, very full and very, very happy.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/k2L_J1d4DddwCdptCPTUqA/348s.jpg", "caption": "Shumai"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ecJ9Vg1qxyZT93F0T48kCg/168s.jpg", "caption": "Stuffed Sticky Rice in Lotus Leaf"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/nOnf-LcUFDUh7YXZC6erpg/168s.jpg", "caption": "Stuffed Sticky Rice in Lotus Leaf"}]}}, {"review": {"des": "My visit definitely didn't disappoint!  I have eaten different types of Chinese cuisine but this was my first Dim Sum experience. Dish after dish arrived at our table and each were an explosion of flavor in their own right.  There were three of us and each of us left very satisfied with our meal. The cherry on top was that it was very inexpensive. We ordered 10 different dishes so I was expecting to pay atleast $30 by myself but I had overshot my assumption by almost half. Definitely will be coming back for more!", "pics": null}}, {"review": {"des": "The dim sum quality was one of the best I've had so far. The restaurant is clean and does not smell like a typical China town restaurant that I'm used to in Houston. It's located by business buildings and parks. I'd come back to eat here the next time I'm in Chicago area. <br>Not quite 5 stars because the rice noodle shrimp roll was kinda mushy.", "pics": null}}, {"review": {"des": "This restaurant has a wide range of dishes so it's nice to have a huge selection.  I did enjoy the meal but the food was not spectacular.  Dumplings were a little over steamed and food was a little under-seasoned.", "pics": null}}, {"review": {"des": "MingHin is \"the Chinatown\".  I simply walk past everything to just arrive here.  <br><br>If you need the early morning Minghin fix or that late night drunken minghin fix they got you covered.  <br><br>I would recommend coming with at least 3 to 4 people so you can order a lot of stuff to try.  Their dumplings/pot stickers come in 3 to 4 counts.  Super cheap...$3 a order.  <br><br>Service is fast....team of servers.  The place is huge!!!  You will be seated immediately regardless how busy they are.  <br><br>Must try:  siu mai, pan fried chive dumpling, beef balls (my fav), shrimp dumpling with chives, fried corn pork cake.<br><br>Only main dish I've ordered here was chicken and cashew....fresh and healthy style rather than thick creamy broth based.  Being back in Florida writing this review is killing me....", "pics": null}}, {"review": {"des": "If you want dim sum, go early!  The line forms fast.  MingHin has all the typical dim sum treats and more.  Take a look at all the photos posted and make plans to go!", "pics": null}}, {"review": {"des": "We stumbled on this place while exploring Chinatown. It seemed to be quite busy for a weekday lunch but we had a very short wait. Food was good. My personal favorites were the crab meat seaweed roll and the siu mai. Turnip cakes were surprisingly good as well. No dim sum carts here (which saddens me because that's part of the food adventure), but you mark your selections on a paper menu. Would probably come back next time we are in town.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/a9x0y7F0TZZZNwxkt5V5og/348s.jpg", "caption": "Stir Fried Sticky Rice"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/UJsXWlIUuATilHVnPO7Oyg/168s.jpg", "caption": "Deep Fried Crab Meat Seaweed Roll"}]}}, {"review": {"des": "Average Chinese food. Think we're spoiled in Cali. Nice, large restaurant,  with iPad screens for ordering.  Great for a group. Pretty clean,  for Chinese restaurant standards.  <br><br>Generally greasy food. Standouts: Chinese broccoli with beef-- loved the big chunks of fresh ginger.  Pea leaves with garlic. Simple dish,  but tasty.  <br><br>They serve dim sum until 5 pm, then again from 9 pm- closing. <br><br>Lyfted here from McCornick around 10 pm ($11 ride, .9 miles from McCormick convention center.  Doesn't seem too safe to walk at night) . Bummer they don't serve sweet dim sum in the evening... mainly savory items. Of what we ordered,  the beef balls were the best. Juicy and tasty.  Wish they had a larger dim sum menu at night. <br><br>Average prices. Average place.", "pics": null}}, {"review": {"des": "UPDATE: Labor Day! I ordered online at 10:33 pm (!!!) and I accidentally selected \"pick-up\" instead of \"delivery.\" I called up, and the guy told me that I could just pay the $4 delivery fee to the delivery guy! I got my food in like 30 minutes!!! I ordered 4 appetizer/dim sum dishes and two mains! Ridiculously fast delivery, and the food was excellent! I had noted in the ordering platform to use less salt, so just perfect for me.<br><br>**********<br>Average score of a 3.... <br><br>I am not sure if the quality of the cooking changes based on the shifts or time you dine because my first experience was 5 Stars for a delivery order one evening two weeks ago, but like a 2-Star rating for a late lunch I had at the actual restaurant yesterday. Rarely is a delivery order better than eating onsite at a restaurant...<br><br>The steamed sea bass had wonderful flavor, but the fish was half the size of the one I got when I ordered delivery service. Also, this fish was really chewy, so definitely over cooked (whereas the one I got delivered was amazingly tender, just perfectly steamed).1<br><br>The lobster over yifu noodles was insanely salty and tasted like soy sauce. Supposedly 1.5 to 1.75 lbs, there was very little meat. The lobster meat was also over cooked and chewy.<br><br>GanChowSiJiDou (string beans) was spicy, flavorful, and tender! A little less salt would also have been nice...<br><br>Fried sweet rolls were delicious, as are all fried pieces of dough! <br><br>Will probably stick to the Lake Shore location..", "pics": null}}, {"review": {"des": "Delivery came faster than I expected and everything was hot with plenty of condiments.  The crab Rangoon was delicious. I also enjoyed sweet and sour veggies. My guest had the roasted duck and said it was fantastic. I'm glad. Live close enough to order in.  I'd recommend them for sure.", "pics": null}}, {"review": {"des": "I really wanted to like this place after all the positive reviews on Yelp that gave it an average of 4 stars. <br><br>Around 7:30 pm on a Sunday evening we ventured into MingHin. Since we didn't have reservations, the hostess informed us it would be approximately a 20 min wait. Luckily, the wait was about 10 mins. However, once we got seated that's when the waiting really began.<br><br>Our waitress informed us the sooner we ordered  the better since people had been waiting for at least 20 to 30 mins for their food.  We already knew what we wanted to order after looking at their cool digital menu and yelp photos. The consensus was the Pan-fried butterfish, the shrimp fried rice, and the American Broccoli with garlic to share.<br><br>Now, someone may say, you were warned that the food would take 20 to 30 mins to come out, so what is the issue? Well, I would respond that usually when you wait for food and it finally comes out, it comes out together not in a staggered schedule. The fact that the food came out late but on a staggered schedule was the issue we encountered.<br><br>After we waited for 20 mins the fish came out. We didn't eat it right away because we expected either the shrimp fried rice or broccoli to follow close behind. Nope, the broccoli came about 10 mins later and then the shrimp fried rice came about another 10 mins later. <br><br>The waiter and the bus boy constantly apologized and even tried to mitigate the situation by asking if we wanted steamed white rice in order to hold us over, we said yes, but that ended up coming out after everything else. So the broccoli and fish were cold when both rice options got to the table. <br><br>Sadly, the flavor of the fish was not that great. The portion size of the shrimp fried rice was good but the shrimp had this strange aftertaste. The American broccoli, the plain steamed rice, and the hot oil concoction they had were the best tasting items. SMH, thus I would not return nor would I recommend since their food service was below par for such a well known and regarded Chinese restaurant. I am not sure if they were understaffed, or overwhelmed, but either way, the wait time to be fed was ridiculous!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/4md-dE3DBo2j3RfCs1KwkA/348s.jpg", "caption": "Compliments"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/JW3eFnvH-gsTK16nWG18Lg/168s.jpg", "caption": "Shrimp fried rice"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/hpcen2x7xjrVsBF7_FtFjw/168s.jpg", "caption": "American Broccoli in garlic"}]}}, {"review": {"des": "My favorite Dim Sum in Chicago! Food is consistently good and reasonably priced. I recommend the crunchy chicken chow mein and the beef balls. Don't forget to ask for the hot chili oil. <br>We go early so we can park in the lot behind the restaurant which makes going there very easy.", "pics": null}}, {"review": {"des": "A great Chinatown staple. With a reasonably priced, delicious dim sum menu, MingHin is one of my favorite restaurants in the area. Service is consistently good and quick. I would recommend to anyone who wants to have some of the best dim sum in Chicago.", "pics": null}}, {"review": {"des": "Maine can never disappoints! It doesn't matter when I visit  The food is always great and the service is always fast. The restaurant is always clean! There is no shortage of choices to things to pick from the menu. Everything is authentic affordable and fantastic. This is one of my favorite restaurants to visit when in Chinatown and I don't mind driving over an hour to get there regardless of how bad traffic maybe. There's a great selection of them some fried rice poultry and beef and veggies.", "pics": null}}, {"review": {"des": "Really good Dim Sum!  Went with a group of colleagues from work for lunch.  You really have to know your way around Chinatown to find this place.  This place gets pretty packed for dinner and weekends.   I tried everything except for the weird textured bao's and the chicken feet.  I could not bring myself to do it.  Everything else was delicious though, especially the ribs and meat!", "pics": null}}, {"review": {"des": "We were visiting Chicago from Atlanta and decided to get Dim Sum delivered our first morning in town. <br><br>I loved that they had pictures and descriptions of all the dimsum available. Placing our order and having it delivered was a smooth process. With delivery we had expected to food to taste mediocre but with this place it was still amazing. In fact it is better than all the dimsum restaurants we've had back home in Atlanta. <br><br>I really wish they had one back home. I have never had dim sum that had tasted this good! <br><br>In Atlanta all the dim sum restaurants taste like the foods been frozen or reheated and all of the workers only speak chinese. So having such a pleasant experience with this place  that not only provided awesome service but understood what I wanted just makes me want to move to Chicago even more!", "pics": null}}, {"review": {"des": "This is poplar busy place with good food.  <br>An exception is the sweet sour pork which was all sweet no sour. More like Panda Express orange chicken. No green peppers. Very over-cooked and over breaded and hard to chew.  <br>Regretted not sending it back. <br>Their new tablet menu is awkward because they only gave one per table.", "pics": null}}, {"review": {"des": "This place was a complete let down. Service and food was horrible. How do you have a tablet ordering system but yet you still manage to put in the wrong order for me?<br><br>Beef noodle stir fry - this was apparently one of their most popular dishes but yet it was the most greasy and bland noodles dish I've had. I had to add soy sauce to it but it still didn't make much of a difference <br><br>BBQ duck - greasy!!! Yes, I'll give it to them that it was flavorful but the oil separated under the duck and it made it quite hard to eat<br><br>Salted fried tofu with minced pork - I thought when I ordered this dish, it would have been with some sort of stir fry pork and not dried shredded pork. It was a let down. Even if I did expect what I received, I was not pleased. The tofu was not flavored at all. It tasted like straight up oil. Where is the salt?! So bland.<br><br>Corn crab soup - tad watery to me and not enough crab meat. It was loaded with a ton of egg which really overpowered the soup. I didn't want egg drop soup!<br><br>For my first Chicago Chinatown restaurant, I'm very very disappointed and don't even know if I want to even go to another Chinese place nearby (esp bc this was rated 4 Stars).", "pics": null}}, {"review": {"des": "Dim sum galore! So much variety to choose from and at decent prices. We arrived on a busy Sunday afternoon but was seated within ten minutes. I didn't realize how big the space at the Chinatown location and  seated on the second floor. As we were seated our server hands us two menu, one for the dim sum and a tablet containing their full menu dishes. The few times I have dined at MingHin, I mostly order through their dim sum menu. The menu gets a bit overwhelming but it's nice because it contains a picture of what each dish looks like. There's a box for each of the item to mark which dishes you selected. My favorites include: shrimp dumpling, siu mai (pork & shrimp dumpling), spare ribs w/ black been sauce, braised beef, stuffed sticky rice in lotus leaf, deep fried crabmeat & seaweed roll, shrimp crepes, congee (soup), and buns. I love the small servings so I can try multiple dishes! Yesterday we ordered about 6 dishes from the dim sum menu and our total bill was under $40! Very affordable and I always leave satisfied. Our server was very attentive and we got our orders within 15 minutes or less. For the dim sum lovers out there, make sure you give this place a try!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/wJO5VGNngvQe0NSrzb2WCg/348s.jpg", "caption": "Shredded BBQ Pork w/ Pan-Fried Udon Noodles, Short Rib, Pork & Shrimp Sui Mai, Congee, & Stuffed Sticky Rice in Lotus Leaf!"}]}}, {"review": {"des": "DLW is a renowned dim sum aficionado, can't get enough. Me, not so much. My biggest problem is that the dishes need to be served as fresh as possible, especially the fried and grilled items, so when the steam tables make the rounds, they can turn those items into unappetizing, congealed messes. <br><br>Here is a place even I can like. They key is that they don't do the steam tables. Everything comes from the kitchen, and the quality is notably better. We tried pan-fried tofu, beef balls, short ribs with honey sauce, fried pork dumplings and shrimp crepe. All were quite good. <br><br>They have a veritable army of servers, so the service is prompt and attentive. They refilled our tea pot without our having to ask, something I had not seen in any other dim sum place. DLW has already made me promise to take her back the next time we're in Chicago.", "pics": null}}, {"review": {"des": "I've been to MinHin a bunch of times over the past few years. I've been bragging about MingHin being the best dim sum place in the U.S. But my last visit was quite disappointing. The Shrimp ChangFen and Dumplings are obviously pre-cooked. The wraps are sticky to the bottoms and broken. The buns don't have a great flavor, either. Although their service and price are impeccable. We came in at 4pm, and for 7 dishes it only cost $30. But I would not come back again, and I will most likely try another Chinatown Dim Sum place.", "pics": null}}, {"review": {"des": "The most famous dim sum place is Chicago always lives up to the hype. It can be difficult to get into during brunch if you have a party of 4 or more, but there are multiple locations in the city that you can choose from now.<br><br>I tend to get the same things: sticky rice in leaves, steamed bbq pork buns, and crispy sesame balls. I'm always down to get other things, but I need those three. Of all of the dim sum spots I've been to, Minghin delivers. Their seafood is significantly better than Cai, which would be my next favorite spot in Chinatown. The Chinese broccoli with garlic is also great.<br><br>If you're in the area and want dim sum, Minghin is the place to go. It's a consistently solid choice if you aren't turned off by the wait times. Luckily, there are a bunch of place in that shopping center to check out while you wait!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Xoa9_NQ0i4hLelr7RYmeoA/168s.jpg", "caption": "Chinese broccoli with garlic"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/moYS-mDNIomp1COhs7Nw8g/168s.jpg", "caption": "Fried sesame ball with red bean"}]}}, {"review": {"des": "Great service and quick food delivery made this a really enjoyable night out in Chinatown! The space is large and well-lit with a variety of tables types: intimate booths for two, round tables with a lazy susan for passing plates, four tops, and private rooms for larger parties. <br><br>We went for dinner on a chilly April Friday night at 7:30 pm and were seated immediately. Our waitress was darling and very helpful. We were served hot tea right away and had time to browse the menu, which was on a tablet. I inquired about dim sum, but was initially told that the dim sum menu ended at 4:00pm and resumed at 9:00pm. However, the waitress checked with the kitchen and they offered to prepare dim sum just for us, even though it was outside of the normal serving hours. I was ecstatic! We chose a variety of dim sum options from the paper menu and were served within minutes. The dishes came out when ready, which was kind of exciting to see what would arrive next.<br><br>Many of the dishes we selected were based on other yelp reviewers' suggestions. Highlights included:<br>-crispy pork belly, Macau style (dipped in sugar- so nice!)<br>-pan fried pot stickers (cooked fresh and stuffed full!)<br>-BBQ pork buns (hot, light, fluffy)<br><br>Other interesting dishes we tried were:<br>-shrimp dumplings (4 pieces per order)<br>-stuffed bean curd skin with pork and shrimp (salty! 3 pieces per order)<br>-stuffed sticky rice in lotus leaf (2 pieces per order)<br>-deep fried spring roll (3 pieces per order)<br>-deep fried shrimp roll (4 pieces per order)<br>-pork fried rice (huge portion! You will have leftovers!)<br><br>The drink menu is limited, but you will find cheap sake ($5 small, $8 large) and imported beers ($3-$4). You will have to ask for water. <br><br>There's something for everyone here, whether you like Chinese-American or more authentic Cantonese. I was pleased and will return to try the dinner entrees!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/wefaMXkfATLTxTkQ-_LfYQ/348s.jpg", "caption": "Crispy pork belly Macau style- delicious!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Ml-XXTc9O_ClEpaFyb29XQ/168s.jpg", "caption": "Stuffed bean curd skin with pork and shrimp"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/mZC6iGkgbz2-H6x82566lQ/168s.jpg", "caption": "Pan fried pot stickers"}]}}, {"review": {"des": "I've been here twice now and ordered from the tablet/dinner menu both times. The standard Americanized Chinese fare (lo mein, General Tso's, etc.) is pretty good, if a little on the greasy side. But that's what I expect from standard Chinese.<br><br>The latest visit we were with a group of 6 and all ordered a bunch of different dinners. The cucumber salad (cucumbers in chili oil and chili peppers) was a fantastic start to the meal and spicy enough to make me want to order a second beer. The roast duck was amazingly good but I wish I had gotten it whole rather than have them chop it up with the bone in, which made it difficult to eat. The scallion and garlic lo mein was good and fresh if a bit basic and the baby bok choy with garlic was tasty as well.<br><br>The only real disappointment was the roast pork belly. It looked under done and tasted gamey in that specific way pork can. Yuck! The top crust was good and crunchy but I didn't even finish the first piece. What a waste but we were so happy with the other food, we didn't mention it to anyone.<br><br>We'll be back to try the seafood options and dive into some dim sum!", "pics": null}}, {"review": {"des": "Dim sum and pot stickers are some of my favorite things so I was super excited to come here (1st time visiting Chinatown too!). We got there around 9pm and sadly they didn't have their full dim sum menu available, however there still was quite a large selection to pick from. They have ipads and paper menus with pictures which was nice to see what to expect. <br><br>Between the two of us we ordered:<br>2 types of Pot Stickers<br>Fried Noodles with Beef<br>Spring Rolls<br>BBQ Pork Buns<br>Broccoli<br><br>All of it was pretty great and somehow almost finished everything. The greatest surprise was when the bill came it was half of what I was expecting it to be. Lot's of good food for very reasonable prices! Yum! Definitely want to go back when they have their full dim sum menu and try more!", "pics": null}}, {"review": {"des": "Great service ! Good food. The shrimp are big and the food was pretty delicious.  We ordered between 2 ppl 6 dishes and ate it all.", "pics": null}}, {"review": {"des": "....just go...seriously if you've ever had any interest in Chinese food, and I'm talking REAL DEAL CHINESE FOOD, you need to get your €£%# to MingHin NOW!!!! I cannot fully express how much I love this place, and the whole shopping center feels like you're not in the States anymore.<br><br>I'll post pictures - everything was DELICIOUS.", "pics": null}}, {"review": {"des": "noms!!! Came here for lunch on xmas day and boy was it packed. But this amazing smart jewish girl made reservations months in advance ( literally like 4 months). When my friend and I arrived the line was insane I repeat INSANE! we had to push through the crowd to find the host. Thank goodness for reso's because we were seated right away. We were given a dim sum menu along with an ipad that had the full menu. <br><br>food: <br>short ribs<br>deep fried crab meat and seaweed roll<br>mongolian beef<br>ginger scallion crab<br>kung pao shrimp <br>pot stickers <br>garlic peapod tips<br><br>yes 2 people ordered all of that and we ate it all!!!! we also would have ordered more but the waitress legit cut us off (I was really not too happy about that) <br><br>Over all everything was super delicious, out of the few restaurants I have been to in China town this one may be my favorite.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/GWKts2J3arQQXMqeME3aWg/168s.jpg", "caption": "Kung pao shrimp"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/sRQHMavWPmaffYNdE2DBug/168s.jpg", "caption": "Short ribs- dim sum menu"}]}}, {"review": {"des": "I've been to this location several times as one of my friends loves this place.  I've never been a fan before and after a recent dinner there, I felt I had to write.<br><br>It's a large place with several rooms.  Our party of four was sat in a private room with a private table.  I did not ask for that during reservations, but it was much appreciated b/c it was so quiet and we were able to talk.  However, you feel very isolated - which wouldn't have been a problem had they explained anything to us.  They seat you and then leave and don't come back.  You're not given menus, but we discovered that the two tablets set on the table were for you to order from.  It would have been nice had they explained that to us.<br><br>So - we ordered drinks on the tablet, but you can't place the order b/c you need a waitress to enter her code in.  So we had to flag someone down. <br>I had the Lychee Martini - two of them actually, and I loved them.<br><br>For appetizers - we got the Crab Rangoon, Shrimp Balls, and Fried Wontons.  The Rangoons were excellent.  More flat of a rangoon than most places.  It was the same sweet dipping sauce for all three.  It would have been nice if there was a different sauce for one of them.<br><br>For entrees, we ordered:  Kung Pao Chicken, Stir Fried Chow Mein Noodles w/ Beef, Ox Tail w/ Honey and Peppers Hot Pot, and the Crispy Lettuce with Black Bean Sauce.  <br><br>The Beef Noodles were really good and that was the consensus among everyone.  The Chicken was okay, but Kung Pao means spice and there were none.  One person liked the Ox Tail, and nobody really liked the Lettuce with Bean sauce b/c it was very runny and not thick at all.  We asked for chili paste and they brought out a very small amount which we all used very quickly.  <br><br>As I said - I've been to this restaurant for lunch twice before and both times, we got dessert of egg custards.  I asked two waitresses and they said they only have them for breakfast.  I find it hard to believe they have no dessert at all for dinner.<br><br>My husband and I just found the food very bland with little originality or flavor.  I will not be back.", "pics": null}}, {"review": {"des": "MingHin Cuisine is a chain.  There are other locations within Illinois such as Downtown Chicago, Naperville, etc., but I usually frequent the Chinatown location since it's closest.  It tends to get extremely busy on the weekends (which is why I choose to order via GrubHub instead of going to the restaurant), but it's still my favorite Dim Sum spot.  My favorites include Pork Siu Mai, Sticky Rice (wrapped in a leaf), Country Style Shrimp Dumplings, and the Pork Buns.  I always ask for more sauces (Sriracha + Hoisin is the best!).  Service is usually quick and friendly.  This location is cheaper than the one downtown and the food is quite fresh since there are a ton of customers.<br><br>You can get your parking ticket validated here if you're luck enough to find a spot within the plaza.", "pics": null}}, {"review": {"des": "A solid dim sum place with no frills and no non sense. The experience is very straightforward, and the food is good but doesn't stand out in the grand universe of a million dim sum places. I expected more pizzaz or wow factor for such a hyped place, but you know what the food was good and I have no real complaints.", "pics": null}}, {"review": {"des": "Is this place a castle?! We arrived on a busy Sunday for lunch (basically when everyone else wants Dim Sum too) and expected to wait close to an hour. Surprisingly, we only waited a mere 2 minutes. And then we realized why: it's HUGE inside. <br><br>I guess the restaurant takes up the entire building or something because there were two floors and multiple rooms...it was like walking through a maze just to get to our table. I was surprised that service was pretty good too (was expecting Asian standards to be honest).<br><br>Everything we ordered was delicious but the Crispy Pork Belly definitely stood out. It was so tender! <br><br>Parking was annoying but what's new in Chicago. Would definitely come back here.", "pics": null}}, {"review": {"des": "Allen and I walked all the way from Lincoln Park to Chinatown JUST to try MingHin. We were desperately craving Asian food, and dim sum sounded about right!<br><br>Pro tip 1: don't walk here...<br>Pro tip 2: You can't read the Chinese characters on the banner, let me translate it for you: starting 2:30 PM-4 PM, 15% off entire bill (for dim sum). <br><br>We arrived around 2 PM, and put in our order at 2:20 PM. If we waited 10 more minutes to do so, we could have gotten a discount.....<br><br>Anyhow, between the two of us, we ordered: <br>-2 orders of chicken feet // GET!<br>-1 shrimp dumplings //GET. I like how big and plump the shrimps are!<br>-1 order of siu mai // not too bad!<br>-1 bean curd skin with pork and shrimp // my favorite dish of all time. This place made it well!<br>-1 spare ribs with black beans // not bad.<br>-1 beef crepe // ehhh.<br>-1 shrimp crepe // good! <br>-1 Baked creamy egg yolk bun //MUST GET.<br><br>Pros:<br>+1 clean environment (though they've been shut down a few times due to hygiene...?)<br>+1 good service<br>+1 nice meu selections<br>+1 pretty good prices<br><br>Cons:<br>-1 still bitter about that 15% off...<br><br>After you get yourself in a food coma, go out and walk in this plaza! I would totally get Kungfu Tea if I wasn't so full.<br><br>Overall, this place is more authentic than other dim sum places I've had in the bay area. Check out the photos for prices!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/kwedAR3hHWwomVuIylPLaQ/348s.jpg", "caption": "For 2"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/v5UAZ0lzuv877iOXbiI5dg/168s.jpg", "caption": "Baked yolk bun"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/sP2IWI4zMpFsIPundElM0A/168s.jpg", "caption": "Menu 5"}]}}, {"review": {"des": "I'm just going to go back to every single review post 1 year and refute all. I don't know that person.<br><br>They had plenty of dumplings this time. Everything was great. Was crowded for a Sunday afternoon so we got seated upstairs. Service was consistent throughout. Shrimp chive dumplings, pork buns, short ribs were all great. Wasn't s big fan of the duck. We also got rice rolls that were flavorful.<br> <br>I am all about that bang for your buck. For all that we got it was pretty affordable. <br><br>Good food, good service, good buns-all good!", "pics": null}}, {"review": {"des": "We attend a celebratory dinner last night for about 100 guests in the upstairs banquet hall- the one in the back since the space was divided in two and a lively wedding celebration was in full swing on the other side of the divider in the front of the hall. That meant we had to walk through their event to access ours. I didn't care but they might have been annoyed by 100 people walking through their wedding. <br><br>Our event went beautifully and there was plenty of attentive staff to assist and serve, paying close attention to our guest with peanut and tree nut allergies. They announced which dishes had nuts and came by special just to make sure we knew the complementary cookies were made of almond. The food was delicious and served in 8 courses family style. It was odd the only 2 vegetarian dishes were the last to be served so I sat through a bunch of courses with an empty plate. But once they arrived I was well fed. And the other guests all said the meat-based courses were delicious. We had 3 children in our group and they ate everything! Super staff. Bright and inviting banquet space. Tidy and spacious bathrooms. We had a fun night at Minghin and they even brought out to-go dishes at the end of the meal so the extra food did not go to waste.", "pics": null}}, {"review": {"des": "Really nice food great flavor lots of assortment and reasonably fast. Only problem was they don't communicate to you how you're supposed to order they drop to iPad type gadgets on the table with a paper menu and then look at you strange.  <br><br>The food was hot and fresh but came out a couple of items at a time.  <br><br>If it weren't for the wait staff I would've given it five stars.  We had ask the busboy three times for water and he didn't look like he spoke English although he was about 25 years old.", "pics": null}}, {"review": {"des": "I came here recently for dim sum.  The food is average for me.  The prices are about average, maybe a little higher than what I am used to.  The roasted duck was okay, nothing I could rave about.  Hargow and siumai was pretty average.  The service is pretty good and there are plugs at your booth to charge your phone!", "pics": null}}, {"review": {"des": "Pretty good Chinese all around, but i guess I was expecting more considering the reviews/reputation, and of course its location right in Chinatown. Seated promptly (weekday, not crowded).  Young casual waitstaff. Tried 4 dishes: Softshell crab- the taste and texture was good, but it was so salty, I was drinking water all night afterwards. Japanese tofu with pea pods- pretty good tofu dish , fresh veggies. Would've been better without being soaked in sauce and oil though.  A lighter fried tofu instead of the soggy fried covering would have been so much better. Baby Oyster Omelet-  Skimped on the oysters. Chinese broccoli- Good and fresh. Ambience- what you'd expect in a popular Chinese restaurant, moderately noisy, quick service, simple furnishings. Nothing terrible, but not memorable either. Probably will try one of the many other neighboring  eateries next time I'm in the vicinity.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/uYbJxOi-5JNqX77pec2wKw/348s.jpg", "caption": "crab, oyster omelette, tofu and veggies"}]}}, {"review": {"des": "tl;dr - amazing dim sum, the Yelp reviews are true!<br><br>There are sooo many dim sum options in Chicago Chinatown so I decided to check out this one due to the outstanding Yelp reviews! I went around lunch time so this place was bustling, but they somehow had seats for us too. <br><br>For a Chinese restaurant, this was probably the best service that I've ever received - we were able to wave down a waiter to get tea/more food extremely quickly, which doesn't happen very often in my experience.<br><br>We got 7 dishes for 2 people, which was more than enough to fill us up for lunch. My favorite dishes were the BBQ pork buns and the homemade fish balls, but we also got other dishes like chicken feet, red bean jelly, custard rolls, shumai, and shrimp dumplings.<br><br>The BBQ pork buns were filled with steamy, delicious, sweet, savory, saucy pork bits - sosososo delicious! Definitely a must-get if you're here!<br><br>The homemade fish balls were so fresh and savory - you definitely can tell that they're homemade and not store-bought. The portions were generous, and I loved the chunks of veggies that were thrown into the fish ball mixture.<br><br>7 dishes came out to be only ~$30 - a ridiculously good price for a filling meal. Will definitely be back for the great service and delicious, cheap food!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/tRxQlUqUcwkDTM9s6r6lsA/348s.jpg", "caption": "Only $30 for 7 things say whaaat"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/qe6UbANZU51mQE4S8gIHMQ/168s.jpg", "caption": "Siu mai"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/mvCOb9eJFjjMaEFaI5mGVA/168s.jpg", "caption": "Baked BBQ Pork buns"}]}}, {"review": {"des": "Modern decor and atmosphere. Tea was good. Before trying any chinese food in Chicago, I was like, there is no where else that has better chinese food than LA. But after trying another restaurant and this one, Chicago chinatown food definitely competes.  We came here for dimsum brunch on a Tuesday. We ordered beef crepe, pan fried rice noodles, dried scallop and beef ball porridge, and turnip cake. They were all very tasty, beyond what I expected. Service was excellent, and the place is very clean. So good!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/slxPtkn3Gx8SZtboN1EERQ/348s.jpg", "caption": "Dried scallop and beef porridge"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/9U5pjglaYTVpBpkDKqK6HQ/168s.jpg", "caption": "Beef crepe"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/bnG1rjndTdDylBmNgf_Qrg/168s.jpg", "caption": "Pan fried rice noodle"}]}}, {"review": {"des": "This was a fun dim sum place in Chicago!  We came in for brunch on a Sunday morning around 12, and there was only a 15 minute wait.  The place is huge- two stories with a ton of tables! We were seated and provided with menus and water, and our server came to check on us every 5-10 minutes.  The menu for dim sum is pretty straightforward- you check off the items you want, and provide the checked off menu to the server.  We got a variety of dumplings and the fried sticky rice, which came out to just over $30 total.  The pork and vegetable fried potstickers were delicious, but honestly everything started tasting the same after a while.  The food wasn't terribly greasy, and our only complaint was that there was a 15 minute break between when the food was brought out.  Otherwise- we really enjoyed it!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/wRatp09F4Et9ocZrk2uiPQ/348s.jpg", "caption": "shu mai"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/r5-app9ZRRKIZW1hSOaFIA/168s.jpg", "caption": "pork and vegetable buns"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/X0WQAJYy9RcsH04jyygzlA/168s.jpg", "caption": "potstickers- we loved these!"}]}}, {"review": {"des": "Dim Summmmmmm!   So good.   <br><br>This Chinatown fixture still stays true to their roots, serving the Dim Sum with the traditional American-Chinese dishes that typify the best of the Chinese culinary tradition for American tastes.  Even so, these dishes are still prepared so much better than most of the Chinese \"Panda\"-style restaurants in America.  <br><br>We stayed on the Dim Sum small plates side of the menu with bun and shu-mai dishes of delicious shrimp and pork / pork-barbecue dishes excellently prepared and delivered simultaneously in a ballet of service.  So many tastes and textures to please the pallet on one table made it difficult to start.  Taro dishes, barbecue pork ribs, fried noodles, and soft-steamed and chewy-fried bun dishes with seasoning and preparation of skilled hands.  <br><br>Then the bill came and we were surprised to discover.........   <br><br>....a 20% discount for dining between 2 and 5 that we didn't expect.   Even without the discount the dinner would have been under $30 for two. <br><br>A real value.  Highly recommended.", "pics": null}}, {"review": {"des": "I have a love for dim sum , so whenever I'm in a major metropolitan city I try to get a taste of what the it has to offer. MingHin is definitely authentic dim sum and is tucked away in the Chicago's China town. The menu offers photos of all the options to check off your order. From B-B-Q pork sticky puns to chicken feet , we tried it all! Favors were savory and delicious. Expect to leave with a full belly !", "pics": null}}, {"review": {"des": "It was not my first choice, and I am not thrilled I went. (I would go back for dim sum, keeping an open mind, since it seems so well reviewed.)<br><br>We went for dinner, and the staff was nice enough. It was odd but not unwelcome that the two of us were seated at a large four-person table, effectively in our own section.<br><br>I wanted to eat light so I had some hot and sour soup. It was NOT good. It tasted like what you could get at a crappy Americanized Chinese restaurant in a strip mall. (I was longing for Lao Szechwan's spicy, well known stuff.) In fact, some of the soup was barely up to room temperature. The shrimp in it was disgusting, tasting totally fishy and strange. <br><br>It gets 3 stars because my boyfriend liked his chicken fried rice, though it took a very long time on a not-too-crowded Friday night. The decor and service were decent-to-good, so that's something.", "pics": null}}, {"review": {"des": "Good variety of dim sum for lunch.  Great responsive service and authentic Chinese dim sum.  We enjoyed all the dishes.  In particular, we loved the noodles sauteed with seafood, vegetarian dumplings, congee and turnip cake.  Definitely worth more visits.", "pics": null}}, {"review": {"des": "The best hot and sour soup.<br>Massive crab rangoons.<br>Next level Hong Kong style FRESH Dungeness crab. I'm talking like, meat ON meat.  Shrimp and spicy ground pork on top of the fried crab. Will knock you straight on your ass.<br><br>Cocktails are strong and decently priced ($7). Service is good- they have a lot of staff. <br>Gotta make it a point to come back here next time I'm in Chi-town!!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/GzyY8tY3OCM8oLJD6qvuaQ/348s.jpg", "caption": "Hong Kong style Dungeness crab. Shrimp and spicy ground pork on top of fried crab!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/M9oF2IKz4_oC9NQvUa9V5A/168s.jpg", "caption": "Huge crab rangoons!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/dvKn0Sz4K70KFYAtIAXu8A/168s.jpg", "caption": "Best hot and sour soup"}]}}, {"review": {"des": "Amazing food and service. I have been craving this for a long time. The noodles are fresh and the duck is excellent!", "pics": null}}, {"review": {"des": "Food was good, service was good. The place has lots of seating (2 floors) and we didn't have to wait for a table for 9 on a Saturday evening around 6.<br><br>Only complaint is that some of the dim sum items weren't on the menu (they're on the other location menus all day).", "pics": null}}, {"review": {"des": "I've eaten at this location multiple times and each time was about the same. Your standard Dim Sum restaurant, one of the best in Chicago considering there aren't very many places to choose from to begin with. Its nice because they offer traditional Cantonese food with a sort of Hong Kong style (basically, expect a clean interior with a dash of fancy).  The interior is well designed with authentic Chinese touches to a modern vibe. <br><br>You're automatically given a side of Hoisin sauce and Sriracha... but! Remember to ask for some chili oil and/or soy sauce! These will enhance the flavor of most/all of the small dishes. <br><br>Some of my fav Dim Sum dishes:<br><br>SAVORY<br>- Rice Crepe with Deep Fried Chinese Bread (THIS! So good. Nice and crunchy on the inside. Is best with the sauce it comes with and some chili oil.)<br>- Shrimp Hargao (\"Minghin's Shrimp Dumpling\" The skin is not too thick or thin, just right.)<br>- Shrimp Crepe (a personal #1 favorite)<br>- Siu Mai (a staple, \"Pork & Shrimp Dumpling\")<br>- Short Rib with Honey Sauce or Pepper Sauce (both are good imo)<br><br>SWEET<br>- Deep Fried Sesame Ball (Very light and crispy on the outside with some sweet red bean paste inside)<br>- Egg Tarts! (\"Putty Egg Custard Tart\")<br><br>I've tried the Mini Sweet Custard Rolls not knowing what to expect. They're only okay, a bit dry. Not bad but also not something I would get again.<br><br>Overall, no matter what you try here, it'll probably be good! This isn't the best dim sum place I've ever been to, nor is it in my top 5. BUT the right flavors are here and are probably the best in the Chicago area for this. With limited options, this is definitely my go-to place for a quick breakfast/brunch. They also open at 8AM!!! Most other restaurants don't open until around 10/11AM, so good for a meal before a trip out.<br><br>The staff are helpful and I've had no problems with them every time I've come. The wait isn't bad either, even on busy weekend mornings. The longest waiting time was about 20 minutes but every other time, we were seated within 5 minutes or less of arriving. Which is SUPER awesome. A lot of other dim sum places I've been to in Southern California typically take 30min-1hr+ just to be seated, so this is really nice. <br><br>If you're new to Chinese food, this is a good gateway into the cuisine and culture! And if you're already well-versed, this is a good place to get the basics and those cravings satisfied.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Oc_h0U0Dz0D7-nD5Rb72hA/348s.jpg", "caption": "Really appreciate this interior"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/y6i7jql-C32srRTAmxBTxg/168s.jpg", "caption": "Shrimp Crepe"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/-H5AZYeqCGbgBl4tiGcbBQ/168s.jpg", "caption": "Great way to spend a Sunday morning!"}]}}, {"review": {"des": "They stop serving Dimsum at 5 on saturdays! Food is delicious, service is good enough.", "pics": null}}, {"review": {"des": "For 6 people we ordered a   18 items- totaling ~$150. <br><br>Service here is perfect -- so nice, way better than downtown location.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/x19i3zDp1EyoZ0trDmdJRw/348s.jpg", "caption": "12.25.17 upstairs seating utilized to accommodate capacity"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/EwYq4OOGnDjsXfxjSnS1oA/168s.jpg", "caption": "12.25.17 front entrance is in inner court"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/6O5tqr9rg1_b8Aoqmr9Wfw/168s.jpg", "caption": "12.25.17 Xmas line!!!!! No reservations"}]}}, {"review": {"des": "The venue for this place is really nice. It's open and spacious. They have plenty of seating available so it is good for large groups. The decor is nice too.<br><br>We did the dim sum and I was really excited for it. Unfortunately, it wasn't as great as I hoped it would be. The dumplings we got were not good at all. I couldn't even tell you which ones were okay or bad because no one mentioned what they were and if they did, it was fast and quiet. <br><br>I really wanted to like this place but I don't think I would come back again.", "pics": null}}, {"review": {"des": "I've never ordered any other food here besides dim sum, but why would you need to? It's delicious and a good value, especially if you come as a group. We usually come here on Sundays to eat dim sum between 10AM and 1PMish and the wait is usually anywhere from 10-20 minutes which isn't too bad considering it's usually with large (10+) groups. <br><br>The last time we came, I notice that they have iPads at the tables now, but we still ordered dim sum off the paper menus where you just mark how much of a dish you want and they bring it out to your table. Service is decent regardless, but if you have a Cantonese speaker with you it's usually a little better/faster.<br><br>The items I usually eat when we come here: ha gow, siu mai, chicken feet, spare ribs, shrimp crepe, dough crepe, custard roll, egg tarts. Sometimes the congee with the century eggs and sometimes turnip cakes and sometimes gai lan when I want to pretend I'm being healthy. Lol it's all good to be honest -- I'm not too picky. <br><br>For a group of 12 of us we spent about $190 for dim sum including gratuity, so a bit under $16 per person. To be quite honest, we probably could have ordered even less food and still been very full instead of disgustingly full. Fair warning: if you come with a group they can only split payment 6 ways so come with cash or be prepared to Venmo your friends.<br><br>The Chinatown location also does late night dim sum from 9PM until 2AM so you don't have to limit your dim sum cravings to just brunch!", "pics": null}}, {"review": {"des": "Yum!!!! I really enjoyed the dim sum here. I'd say even better than some places in San Gabriel Valley in California. I was delightfully surprised by the juiciness of the dishes. They were quick to get the extra condiments I asked for. The interior was also decorated beautifully. I strongly recommend this restaurant.", "pics": null}}, {"review": {"des": "One of the nicer and lesser-packed dim sum places in Chinatown. Overall the portion sizes are pretty good and the menu has typically anything that you would want to order. The BBQ buns are amazing especially - I'd make a trip here just to eat those alone. The portion size of the fried rice is also ridiculous.<br><br>Weird that they don't have chili oil and soy sauce on the tables though! You can ask for it like we did but they give you Sriracha originally instead and it's just an odd combo lol", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/SD4rPX91QkC75MxgZx-6WQ/348s.jpg", "caption": "Shrimp dumplings and tripe"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/xsYw23MK8e466tQau34XwA/168s.jpg", "caption": "Bbq pork bun"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/M-WpjvgW5aEauBLBg2UIaA/168s.jpg", "caption": "BBQ pork"}]}}]}