{"name": "minghin-cuisine-chicago-7", "reviews": [{"review": {"des": "There's something so fun and relaxing about dim sum on a Sunday.  Maybe it's the families you're surrounded by or the fact you can gorge yourself w cute little dumplings.  Whatever the case, it's one of my favorite activities.  This location of MingHin gets 5-stars for two reasons the other MingHin's do not have. 1. They take reservations!!!! If you know Chinatown's location... it's nearly impossible to get a table on your own and you have to wait for hours on a busy Sunday.  Having this feature makes this location far superior!  2. Their view into the city is breathtaking!  Its a hidden gem of the city. <br><br>Food is delicious! You have so many options!  They give you an digital tablet menu, a paper dimsum menu, and their full menu.  Options are endless.  For dimsum, get their sweet top egg custard buns!  Super popular and fresh out of the oven!  Other favorite dimsum items: shrimp crepes, shrimp dumplings, shrimp and chive, mini crispy spring rolls, yu choy, and bbq pork buns.  Non-dimsum favorite, shrimp fried rice! They use large shrimp in their fried rice. Not the mini, hard to find, frozen stuff. <br><br>If you like the chili oil, ask for extra cause the portion they initially give is very small.", "pics": null}}, {"review": {"des": "My first time dining here.  I knew it's good because it was so crowded and many Asians were dining.  When you go to a Chinese restaurant and the menus are in Chinese you know you're at the right place! <br>I had the shrimp Dumplings which were 10/10 !  Perfectly steamed shrimp, not chewy, with a delicate seafood flavor.  My main course was  Chinese broccoli and shrimp which had its own delicate flavors and perfectly cooked.  Everything seem so good it was  a tough time choosing.  Would have liked to try the duck.  <br>Dessert was  mango pudding.  Service was good too, but some language barrier. That's why it was real authentic. <br>Next time I'm in Chicago I'm coming back!", "pics": null}}, {"review": {"des": "This was recommended to me by a friend in Chicago area during my visit. I went to the location in downtown instead of the one in China town. <br>The foods were delicious but they are rather more americanized dimsum than traditional one. You can do a la carte order on paper, there is not cart pushing around.<br>Recommend Har Gow, shumai, bao buns, and bean curd. The shrimp crepe rolls are alright, the dough was too thick.<br>The service was good but kinda slow even though the restaurant was empty at the time.<br>We had a good dining experience here, and would come back again.", "pics": null}}, {"review": {"des": "The best chinese food restaurant in Chicago! I loved it so much i came back twice in one weekend! Had I lived in chicago, I'd be a frequent here. I love their dim sum! and it's served all day! you can't go wrong. <br><br>Highly recommend the Har Gow (shrimp dumplings), chicken feet, spare ribs, definitely the salty egg custard bun that flows out when you bite into it (the yolk can be a bit salty-- so what I did was let most of it flow out and used it as a zip to get the consistency I like)<br><br>We also tried their oysters (because they ran out of giant clams) made canton style with garlic and scallions. This was also excellent. Even though we were only able to try their dim sum I have no doubts their regulator meals are delicious too! <br><br>This will definitely be on my list next time I'm in town!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/zhjqo0Bnks76XmQtgO6yaA/348s.jpg", "caption": "GLORIOUS!!!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/gr_qN0oWa64zKweX2hRDEA/168s.jpg", "caption": "garlic oysters. (because they ran out of scallops) very authentic. i want more"}]}}, {"review": {"des": "If you're craving tasty Dim Sum, this is a great place to come get it! Easy walk from Millennium Park up Randolph Street past Aon Center. Looks deceptively small from the outside but, it's actually pretty sizable with a really nice view at the back of the restaurant. <br><br>The food and service really shines here and I believe they do Dim Sum all day. There is also a full menu but we've only come here for Dim Sum. Just check off what you want on the menu and it starts coming out quickly. Yes, some items are fabulous & others not quite what I expected. Just work your way thru the menu & enjoy - especially when the bill comes and it's so affordable for how satisfied your tummy is feeling.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/5WQzKVv-heByqy2b3ZK_Jw/348s.jpg", "caption": "Dim Sum Menu"}]}}, {"review": {"des": "A classic Cantonese restaurant with a great view near Millennium Park. I love the decor; it's like a modern-traditional Chinese design with large windows that let in plenty of sunlight. They have this really cool display of zisha clay teapots by the bar. <br><br>MingHin features classic Guangdong cuisine, and the dishes are all around good. I went with friends during the weekday for lunch and was able to get seated quickly. As per traditional, we ordered the rice noodles with beef - the noodles were slightly crispy and fragrant. For veggies, the scallops with Japanese tofu which I highly recommend. There was plenty of sauce, but the ingredients didn't become soggy. The scallops were really fresh and was nicely complimented by the tofu which soaks up the flavor of the scallops and the sauce. The salt and pepper fried shrimp was good. The BBQ platter featured roasted pork belly, BBQ pork, and roasted duck. The BBQ pork was alright, but the pork belly and the duck were the best. <br><br>They have a good selection for tea service, and complimentary desserts which consists of fortunate cookies and almond cookies.  All in all recommend if you are in downtown and want authentic Canto cuisine.", "pics": null}}, {"review": {"des": "In Chicago for a conference and found this place on Yelp.  The hotel front desk person also gave it a thumbs up after I asked for directions. I missed the turn and got lost walking on Michigan Avenue.  After walking what seemed like 10 blocks, I found MingHin.  You gotta love it when there is a restaurant serving dim-sum until 10 pm.  I was there at 8:45.  I ordered the pork and preserved egg congee, U Choy greens, and tripes.  LOVED all 3!  The congee was creamy with just the right amount of meat and egg; the greens were fresh and tender; the tripe flavorful and crisp.  I also got the Lychee green tea which complimented my late dinner perfectly.  <br><br>I liked this restaurant so much that I returned the next night.  This time the food was not as good.  Ordered the sui mai (ok), egg custard bun (not bad), fried taro cake (lots of shredded taro but too crispy), and bbq pork rice rolls (bad - meat and soy sauce were salty when they should have been on the sweet side).  <br><br>I will probably return the next time I'm in Chicago; sticking with what I ordered the first time.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/AwdQL7mSpMRXTIpRcVow9Q/168s.jpg", "caption": "Pork and preserved eggs congee plus U Choy greens. Delicious comfort food!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/HmDn8E7TeqETQmz0eJtibQ/168s.jpg", "caption": "Dim sum and lychee green tea at 8:30 pm. Love it!"}]}}, {"review": {"des": "First time at this MingHin location! I've been to the other smaller location. After visiting both locations, I've concluded that MingHin is pretty consistent & that's a good thing. <br><br>I know there may be \"better\" places in Chinatown, but I really like MingHin! I was also bringing a couple of first timers with me & MingHin is a great 1st place because:<br>*it has a clear menu with photos + English/Chinese<br>*pretty dang good service - especially when it comes to dimsum<br>*all the classic dishes that you want first timers to try!<br><br>We basically ordered everything on the menu from the bbq meats to the dim sum dishes to dim sum desserts! No complaints on my side. <br><br>We came around 11am on a Sunday, but the line started to really back up when it was closer to Noon. So, get in early! Even though this location is larger, may be because of how central it is, it sees more foot traffic? Not sure! <br><br>The end of the meal comes with fortune cookies & almond cookies so save some room! <br><br>245/365", "pics": null}}, {"review": {"des": "I went here for the first time with 3 other friends on Saturday for lunch around noon. There was a bit of a wait for a table, but it wasn't too long. The service overall was great. They immediately gave us hot tea and water as we sat down and checked in with us various times throughout the lunch. <br><br>We partnered off and got about 7-8 dishes per pair. It was a little more than we needed but I felt full when we left happy with our choices. We tried the shrimp crepe, pork steamed buns, shrimp and pork dumplings, ribs, and a few other items. I enjoyed the steam buns and dumplings the best. It was also not too expensive for the lunch. We spent about ~$15 each. <br><br>Added bonus - they give you a cookie and fortune cookie with your check :)", "pics": null}}, {"review": {"des": "One of the \"fun\" parts about this location is trying to find the d@mn place!!  Came here to meet up a client for lunch and good thing i arrived early cuz it took a couple twists and turns to figure out this location.  But it was all worth it at the end.<br><br>Great variety of all the dim sum that you can think of.  From baos, shumai, dumplings, fish cakes, you name it, they got it! All prepared nice  and fresh and coming to your table at full speed ahead.  <br><br>The service was amazing.  They kept the food  coming in a very timely manner.  Our party ordered tons of different kinds of dim sum and we were able to enjoy them all without having to really wait too long before the next one arrived.   <br><br>The location seems a little tiny at first but there is a bigger area towards the back for larger parties.  This restaurant is rapidly becoming one of my favorite Chinese restaurants in Chicago!", "pics": null}}, {"review": {"des": "OMG!! Amazing Chinese food, cheap, and huge portions. The Ginger lover drink is delicious - not quite a Moscow mule, it has tons of ginger. I started with the egg rolls and potstickers. Both were great and huge portions. I had the combination fried rice. My coworker had the sweet and sour chicken which was some of the best I've ever had. My other coworkers had the softshell crab which was also great. Absolutely loved this place - we couldn't stop eating!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/VYAMvDK5T28kqVm5CCjxSA/168s.jpg", "caption": "Huge portions"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/1dJfG9SbEiUj2wCIR8_Jtw/168s.jpg", "caption": "Combination fried rice"}]}}, {"review": {"des": "This is easily the best dim sum in Chicago. Both locations are good (Chinatown/loop). Definitely recommend making reservations especially on the weekends.<br><br>Get the complimentary jasmine tea and dim sum plates obviously! Some of their main dishes are good too. A lot of the better dim sum dishes are shrink based. I recommend the shrimp dumpling, siu mai (pork and shrimp dumpling), cheong fan (steamed shrimp rice crepe), taro cake, and egg custard! I do not recommend the crispy pork belly. It's too expensive for the portion you get.", "pics": null}}, {"review": {"des": "The first time I came here is with my roommate and two classmates. We ordered and tried most of the recommended foods here! It's a kind of yummy Guangdong Cuisine!<br>This time I came here to do volunteering for American & Asian bar association. There is a annual awards ceremony here. It is a good way to communicate with lawyers and law school students in Chicago area. <br>Volunteer work always make me happy.<br>Food here is still awesome! Fried shrimp dumplings are so delicious that words can't express!<br>The white wine is good! I like its light and golden color .We three girls are thirsty after talking too much with lawyers.we order different drinks,  but we share and taste this cup ( pic)together lol! still half left！<br><br>Tips： you can totally enjoy tasting foods here without bothering by phone. No signal and wifi here!lol! Just Focus on food and people around u!", "pics": null}}, {"review": {"des": "Good place for Chinese and dim sum. Service is alright, but they tend to not want to hug you so you need to flag them down if you want anything. <br><br>Veggie crepes were my favorite dim sum item and you must get some of their house made chili oil to dip it and pour on everything! Not spicy but has an amazing and unique flavor. I even asked for tons of the oil to go!<br><br>Accommodating with menu changes such as fired rice ingredients. The fired rice noodles with beef were also good as well as the peppered asparagus. Dishes were yummy and would come again.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/7OqqNSfsO1s-2cE75gwOPA/168s.jpg", "caption": "Rice noodle with beef"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/MPOnQmaG_1ukQEm1BGk9fA/168s.jpg", "caption": "Pan fired vegetable crepe and shrimp Country Style Dumpling"}]}}, {"review": {"des": "Wow our favorite dim sum spot. I don't know if it's because it's been so long since we've had really good Chinese food, since moving away from the west coast, but this is my favorite place. The food is so fresh and non-greasy. The daikon turnip cakes have fresh slices of daikon in them. The jut porridge rice is delicious. The staff is very attentive and the chairs are comfy. We enjoy the interior. Great for small or large parties. If money weren't an object I'd order food from this place for lunch everyday!", "pics": null}}, {"review": {"des": "We were craving some Dim Sum after a great day at the Blues Festival and had bookmarked MingHin some time ago. Seemed fortuitous that it was a short walk away. And wow, am I glad we went!!! A little deceiving from the outside because it's very well done and much larger inside than it looks. We were seated all the way against the windows in the back and had a terrific view of the park like setting. <br><br>As hungry as we were, we went right to work on the dim sum menu and the food started coming out fast and furious. Barely had time to wash my hands after I initially sat down. As always, we tend to over order (read that as over eat) when we get Dim Sum. In this case, it was so worth it though. The shrimp Sui Mai was fabulous and so were the potstickers, steamed bbq pork buns, egg yolk paste buns (how do they make those things so addicting?), and almost every one of the 7-8 items we ordered.  The only one I wouldn't order again was the short ribs with pepper. They were a bit of a disappointment but not enough to impact our experience. <br><br>Service was first rate, atmosphere is terrific and the food is quick and spectacular. Five stars for sure!!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/-GoFb4iimxaANS5EWdgrPw/348s.jpg", "caption": "Dim Sum!!!"}]}}, {"review": {"des": "Yummy! I am a regular takeout customer here. I ordered from them a million times and have no complaints. Food is always hot and fresh, delivery is fast, everything packaged very nicely. They seem to be very consistent with the way they run their business. I like you guys and will be a customer for many more years!", "pics": null}}, {"review": {"des": "This was dreck. <br><br>Ordered take out. The food was soggy. The duck was too fatty, and it was very average.<br><br>It gets two stars because the white rice and noodles  were decent (not too hard to screw up white rice though).", "pics": null}}, {"review": {"des": "This is probably my favorite Chinese restaurant thus far in the city. I had dinner on a Tuesday after work with one other person around 5:30 p.m. No wait. We were seated in the back with a fantastic view of the city. The service and food was phenomenal. We ordered pot stickers, orange beef and orange chicken with white rice. Tea, cookies, and fortune cookies came with no charge. I have zero complaints or criticisms about this place. Absolutely phenomenal ambience, food and service and generously priced.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/KshvBOYNDKRRth8HyxFmAQ/348s.jpg", "caption": "Almond Cookies"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/CbAUQVeWYwfLaZ9Op9Ofag/168s.jpg", "caption": "Pot Potstickers (6)"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/A8XOpRvLF4df9hWZk8YC-g/168s.jpg", "caption": "Orange Chicken"}]}}, {"review": {"des": "This is my go to take out/delivery Asian place in the city. We've been ordering from them for over 2 years now. We've tried a huge selection of items and everything is pretty good. My husbands favorite if the general tso's chicken. He gets it extra spicy and with brown rice. It's consistently good. I usually get the stir fry wide rice noodles with beef. It's very simple but good. Just be aware that sometimes this dish is a little oily. Even knowing that I still order it because when it's good it's great. The noodles are cooked perfectly, unlike many other places where they are overcooked and a mush. The beef is tender and flavorful. <br><br>Other dishes we've tried and liked is the fried rice, the orange chicken, crab rangoons, beef lo mein, and the king pao chicken. The portions are big and enough for you to share or have left overs.<br><br>The prices are higher than what you'd want to pay for a take out/delivery Asian place but we've tried a few other places in the area and the prices might be a little cheaper but the food was not nearly as good as this place.", "pics": null}}, {"review": {"des": "I came here on a Friday morning right as they opened. No one was in the restaurant so I was a bit nervous at first. By the time my husband and I ordered our food, a few more people came in and by the time we left, the whole restaurant was full! <br><br>My first impression was that it's a really clean restaurant! The decor is also very modern. My husband and I ordered our usual dim sum selections and they came out piping hot in a matter of minutes. We were able to get in and out in no time at all, which was a plus! Everything we had was delicious and our service was phenomenal. I highly recommend!", "pics": null}}, {"review": {"des": "DIM SUM 41<br><br>The centuries-old practice of shareable steamer baskets is alive and well at this Chinese restaurant in The Loop.<br><br>Several days before attending the annual NRA show at McCormick Place (restaurants, not rifles), my family met our friends Jeff and Janet G here for Friday night dinner on 5/18/18.  Though the original installation is in Chinatown, the newer location is just as good.<br><br>This MingHin is about one block east of the Aon Center -- the supertall stripy building formerly known as Standard Oil -- and just north of Randolph Street.  It's tough to find and even tougher to know where to park.  You'll likely have to use the same garage as Mariano's, which has a dangerously narrow entrance off of Lake Shore East Park.  Hopefully you drive a Mini Cooper or Fiat, as our midsize SUV barely fit.  A minivan or pickup truck will get stuck trying to squeeze in here!<br><br>Alright, enough about the nerve-racking parking sitsh.  The decor inside was much fancier than I expected, as we were quickly seated at a large round table in their dining room.  Each person got their own tablet and could peruse the \"e-menus\" at their leisure, as well as add food items to their cart.  Pretty cool!<br><br>Perhaps it was just the selection of stuff we got, but I didn't find anything terribly special.  My bowl of egg drop soup ($3.50) was kinda weak, though the crab rangoon (4 for $5) were delicious and came with dipping sauce.  Potstickers (6 for $5) were pretty standard.<br><br>After that, things started to get a bit weird.  Someone placed like a million orders of shrimp rice noodle rolls, which looked like seafood crêpes in a flimsy paper wrapper.  There was a squid and peapod entree that made its way around (I passed), but sadly no sight of the good ol' kung pao chicken.<br><br>I did enjoy the steamed barbecue pork bun as well as the deep fried sesame ball.  A quintet of miniature sweet custard rolls rounded things out.<br><br>Bread = 3.5<br>Circuses = 4.5<br><br>Our server was great.  I saw one dude literally running from the kitchen to tables with trays of food, both empty AND full.  It was entertaining to watch this guy practically sprinting back & forth, wondering if he'd trip and fling someone's egg foo young into the next county.<br><br>* TL;DR *<br><br>Unless you're lucky and/or savvy enough to find a spot on the street, just parking your car beforehand can be a nightmare.  Apart from that, however, you can expect a fairly decent Chinese meal here.  The service was speedy, the atmosphere trendy, and the food above average.<br><br>I'd recommend MingHin for the dim sum experience, especially for larger groups.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/4QFMoiv57bkZ1YtTGE9q9A/348s.jpg", "caption": "This dim sum restaurant near Millennium Park is pretty good! Parking is hella tricky to find, tho"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/wTXYAFBZooLfHiYpAfVDkA/168s.jpg", "caption": "Steamed custard rolls for dessert. Much more springy and less liquidy than I'd expected"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/QYbC2zLSvw31e2lfyZ1Jyg/168s.jpg", "caption": "Their menus, including a TABLET option for dim sum at a table of 8. Pretty cool e-option!"}]}}, {"review": {"des": "Amazing!! Also awesome new location--tons of seating (including outdoor, but the tables out there are quite small... so maybe not ideal for dim sum), and huuuge selection of dim sum. Ordering is a breeze here. No confusion on what you're ordering since you can mark the desired quantity of each dish you want on the menu, complete with photos. Everything we ordered was cooked to perfection and reasonably priced. Food also comes out mighty fast here. Will definitely be back again. Make sure you reserve online if you plan on dining during peak lunch hours--people were lined up waiting starting around 1230PM.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/928YPTCanew7PO3VQmm-Dw/348s.jpg", "caption": "Dim Sum"}]}}, {"review": {"des": "We were looking for somewhere to eat lunch and having never actually been to a DimSum restaurant, really wanted to try this place out.  We stopped in and decided to sit outside since the weather was so nice, but they seemed to have plenty of seating both inside and out.  <br><br>There are two separate menus, one for normal food and a dim sum menu, so make sure you ask for whichever you need if you don't see it.  The dim sum menu is easy enough to order from as you just check off what you want and hand it to the server to put in your order.  MingHin had a lot of great offerings of things I had never tried before like chicken feet and our favorite of the day, the egg yolk paste bun.<br><br>Everything came out as ready and hot.  It all tasted great and we ended up finishing it all with happy tastebuds.", "pics": null}}, {"review": {"des": "This is the more upscale downtown version of Chinatown's MingHin restaurant, and a welcome option for dim sum and Hong Kong-style dishes including a variety of noodles and subtly flavored seafood dishes. <br><br>The dim sum ate the standouts here. Order a variety of dumplings and enjoy.", "pics": null}}, {"review": {"des": "UPDATE: 4 stars. They DELIVER! I don't even know how to begin to describe how happy I am that they deliver! Food was on time and warm. Everything was neatly packed and delivery man was very kind. <br><br>ORIGINAL REVIEW: 3.5 stars if you will...The food is not to die for but they are consistent at their so-so to good dim sum. If you have a craving for dim sum it will fill your void (hence I rounded up the 3.5 stars).<br>I came before the lunch crowd came so I didn't have to wait. I ordered my food and 90% came with good service and in a timely manner. When it got busy... I waited an uncomfortable amount of time for my jellyfish before I flagged someone down to remind them about it. So that's my one star down. <br>The other half star was because the tables are sticky. I might not have noticed wearing long sleeves but I cringed every time my arms touched the table.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Xb6_Dsb8a0GymOA6YtBWVg/348s.jpg", "caption": "Orange Chicken"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/R6B_3fPypwO6NH2iwKiBKw/168s.jpg", "caption": "Crab and corn Crab Meat Corn Soup"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/sYK5io3qcok-xbwytYElAA/168s.jpg", "caption": "Steamed Whole Shrimp Garlic Sauce"}]}}, {"review": {"des": "We stopped here for lunch after a conference nearby. It's not typical dimsum (no carts here) but they still tasted delicious. Reasonable prices and big portions. <br><br>Service was efficient and we were stuffed at the end. The dumplings were quite good but so was the fried rice surprisingly. The duck with noodles was missing enough duck to qualify as a duck dish though. <br><br>And they weren't great with food allergies.  One dish they said was chicken also had shrimp in it. Would've been helpful to know.", "pics": null}}, {"review": {"des": "Great choice for dim sum! This is it, folks! If you want authentic Cantonese cuisine, look how further. While growing up in NYC, my family always took me out to eat Cantonese food. It became a tradition and something I grew up looking forward to with every trip I took up to city my whole life. It is my comfort food and this place gave me that feeling back after missing it for about 5 years. <br><br>My husband, on the hand,  had only tried dim sum once in his life with my family in NYC and so he let me do the ordering. I ordered the shumai, shrimp rice crepe and sticky rice to start. Out of the three, the shumai was definitely the best. It was stuffed with shrimp and pork and very good. The shrimp rice crepe had good flavor but the texture was very sticky and the sticky rice had that authentic good flavor, as well. All of these items were followed by beef and vegetable pan fried noodles and that was all it took! I got my hubby hooked on dim sum! I just wish we had room for more, but I guess that just means that the next time we are in Chicago, we will have to come back for more.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/5_yTP6Iy4drMbx56945oOA/348s.jpg", "caption": "Beef and vegetable pan fried noodles"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/B9kBxScznphjdlxQaffccA/168s.jpg", "caption": "Stick rice"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/wvhPmpy-MUj1Ix17pPuywQ/168s.jpg", "caption": "Shumai and sticky rice"}]}}, {"review": {"des": "BEST. DIM SUM. EVER!<br>The atmosphere, food, service were so awesome. The menu is well-organized and clean, you don't have to agonize over it. The staffs might speak Chinese to you at first of you're Asian XD.<br><br>All the dim sums are soooo fresh and delicious. I wish I could eat more!! We ordered the flower tea, which comes out with rock sugar, and it went so well with the food. Get the flower tea, it will balance the food overall.<br><br>The service was quick and nice too. They are good at communicating with the customers. I wish Virginia has this restaurant! <br><br>Overall, delightful experience. We might go back before we leave Chicago :)", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/oHe-M_6AWQ0IE96qkGaAXg/348s.jpg", "caption": "Tiny tea pots and cups :)"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/9hhytcVwhpJw0eEOHZsTtQ/168s.jpg", "caption": "Egg tarts"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/IGo_FEqFb2U8cm8YLHihIg/168s.jpg", "caption": "Cold appetizer-spicy tripe"}]}}, {"review": {"des": "This location is way more convenient to go to than the one in Chinatown. Though you lose the feeling of authenticity when not being in Chinatown.  On the plus side, Millennium Park is right there, so you can roll your way there after an incredibly filling meal of dim sum.<br><br>We went for dim sum on a Sunday. We got there around 11:30am - I was super surprised it wasn't packed. It got busy by the time we left. <br><br>We ordered:<br>* MingHin's Shrimp Dumpling<br>* Short Rib with Pepper Sauce<br>* Siu Mai<br>* Sweet Topping Egg Yolk Bun<br><br>Everything was delicious. We promptly slipped into a food coma afterwards. I'd say the food is just about the same as the location in Chinatown. I haven't been to their other two locations.<br><br>Kind of weird thing that happened: my SO had ordered hot black tea. He got carded, so we were like, ok that's weird but sure, whatever. The server comes back with a bottle of Budweiser. And I'm like, \"Uh, we ordered hot black tea.\" And he says, \"Oh, you didn't order Budweiser?\" and looked extremely perplexed afterwards and/or upset that he had opened a bottle of cheap beer. Oh well.", "pics": null}}, {"review": {"des": "Came for dim sum at dinner time. Servers were very helpful and polite.<br><br>Shrimp dumpling with pea tip (4/5): could taste fresh pea tip from it. Quite nice.<br><br>Fried shrimp rolls (3.5/5): the roll itself was fine but I don't like the sweet sauce that came with it. Asked for vinegar instead.<br><br>Rice crepe with deep-fried Chinese donut (3/5): fried donut wasn't really crispy, otherwise would be a good one.<br><br>Crispy pork belly (2.5/5): got smell that usual crispy pork belly not suppose to have. Somewhat weird.", "pics": null}}, {"review": {"des": "The dim sum is amazing!!! Here for a conference and it was confusing at first to find but it's honest to goodness top notch dim sum! The chicken with scallops was soo good I got an order To go! Can't wait to go back! Worth the 20-40 min wait. Good for a party of 1 to eat at the bar.", "pics": null}}, {"review": {"des": "Lots of veg options and vegan options were good. The place itself was a little hard to find, but overall fine. The mapo tofu was different than expected (must be from a diff region in China than i used to) because it tasted almost sour and spicy? <br><br>Rice cruller rolls were amazing as usual (its pretty hard to screw that up lol) and veggie rolls were good too. I thought everything was way more oily than it needed to be? But maybe you could request with less oil. Highly recommend the green beans.", "pics": null}}, {"review": {"des": "It was the 4th of July week and they had numerous guests waiting for a table and dining in. We were lucky to have an open table for a party of 8. Nice ambience, clean and well-designed interiors. You can order thru their iPad or printed menu. We had dim sum, stir-fried rice noodles with beef, bbq pork rib, chinese broccoli with garlic and shrimp fried rice. Everything was well-prepared and super tasty. The service was great and quick. All were very attentive with our needs. We ended our dinner with fortune cookies and huge almond cookies. I really enjoyed the food and overall experience. <br><br>A place for authentic and delicious dim sum and chinese cuisine. I can't wait to go back to Chicago! I highly recommend it.", "pics": null}}, {"review": {"des": "I was super excited about this place because of its bib gourmand distinction, but the food felt somewhat average. I would give this place a 3.5/5 but since Yelp doesn't have half stars, 3 it is. The hot and sour soup was honestly the worst I've had and my expectations were super high. They did alter the soup to be vegetarian for my liking since it usually comes with pork (she even said she could put chicken in it if I wanted). The shrimp fried rice was pretty good and I was satisfied with the taste. The chili oil gave the fried rice a kick and made it so much better. The service was good especially with how busy it was. I appreciated the kind staff checking up on me from time to time and being prompt when I had a request.  I'll be back to try other items on the menu to see what the bib gourmand 4 years in a row is for though!", "pics": null}}, {"review": {"des": "I love this place. I am not from Chicago but this is my second time in this restaurant. The place is modern and feels clean. <br><br>The dim sum is so delicious we have tried various plates. The Macau Pork belly was so good. The udon noodles with vegetables have such a great flavour. The food comes out very quick. They give you a paper menu for the dim sum, which your suppose to pick which one you want and how many... <br><br>They also give you a tablet in case you want from regular menu. The roasted duck is good. I definitely recommend this place. The service was nice.", "pics": null}}, {"review": {"des": "We ordered the dim sum. You order from a picture menu, not a cart. Everything was delivered quickly and piping hot. They do not skimp on the fillings. The non-alcoholic drink menu was the biggest I have ever seen. The restaurant is clean, attractive and has big picture windows. It is right across from Millennium Park and the street parking was convenient to both.", "pics": null}}, {"review": {"des": "Totally satisfying... <br>food was great, excellent price, great staff... <br>would recommend.", "pics": null}}, {"review": {"des": "After an hour of searching for our last meal in Chicago, we found MingHin through the Micheline's Recognition List. The West Loop location was convenient since we were staying at the Palmer House. Service was excellent. There were multiple servers and they all provided great service.  <br><br>We had the following (see picture). Our favorites were turnip cake, egg yolk bun, and sticky rice wrapped in lotus leaves. <br><br>Tip: Ask for chili oil and soy sauce. They were super responsive and brought everything.", "pics": null}}, {"review": {"des": "We walked in on a Friday night super hungry with a party of 8. We were lucky that they had a table open for us with no reservation. All of the employees greeted us as we were escorted to our table. Our waiter quickly greeted us and asked us if we wanted drinks.<br>Dim sum menu was on paper but a more complete menu was on their Samsung tablets. <br>We ordered a variety of dim sum, noodles, veggies, and bbq dishes. They came out 1 at a time when each was ready. Everything tasted very good to delicious. The server was attentive but not intrusive. Even though we didn't need it, they seemed to suggest that they validate parking.<br>Overall, it was a great experience.", "pics": null}}, {"review": {"des": "Really enjoyed my meal here! This is right around the corner from the Radisson and close to a bunch of other eating establishments. I showed up for lunch and they were packed but had a table available for my sassy party of one. There were a lot of large parties so this is definitely a popular place. <br><br>I had the potstickers, wonton soup and bbq pork with broccoli. The potstickers were juicy and flavorful with tantalizing notes of ginger. The sauce was a bit different, had a char siu taste and I really enjoyed it. The wonton soup was also a hit, the broth was flavorful and served piping hot. The individual portion is served with 3 wontons, a couple of slices of bbq pork and bok choy. Simple, flavorful and the right taste notes all around. The bbq poet with broccoli was also a major winner, the broccoli was crisp and the pork was tender and delicious. Really reminded me of NY style chinese. Something that was missing was hot sauce but I should have asked for hot oil. <br><br>My server was friendly, polite and paid the right amount of attention. His timing was great and he cashed the check out quickly. <br><br>Something weird did happen at the end but totally not the fault of the restaurant, the white guy sitting next to me was tremendously put out that he had to move his suitcase so that I could sit down and kept trying to intrude upon my space (like pushing his chair all the way back to hit my table and spill my soup). Once I told him that I would punch him in the face he seemed to wise up. I may look like a nice Indian girl but my fists are from Brooklyn. I hadn't gotten the racist vibe in this city prior to this but always worth paying attention to.", "pics": null}}, {"review": {"des": "Very good quality food. Had a slightly different taste than your average Chinese takeout which made it memorable", "pics": null}}, {"review": {"des": "One of my best dining experience in Chicago didn't involve any deep dish pizza nor molecular gastronomy.  It was actually dimsum.  <br><br>I loved MingHin.  All the dumplings were great.  Good chicken feet.  Tasty porridge.  The place was clean.  The service was impeccable.  We had a good table next to the windows with a nice view of the adjacent park.<br><br>Highly recommend.", "pics": null}}, {"review": {"des": "My first impression was that MingHin was extremely clean and well-decorated. Funnily enough, this actually caught me off guard because I'm used to the classic dirty, hole-in-the-wall markers of authenticity at other dim sum places I've been to in Chinatowns and across Asia. I was worried that this would mean that the food wouldn't be good or authentic, but boy was I wrong. We ordered a LOT (a bit too much actually...) and everything was delicious. I was very pleased with the taste and the well-kept environment was a bonus. The food tasted like it was made out of high quality ingredients, and overall, I very much enjoyed stuffing my face here.", "pics": null}}, {"review": {"des": "Such a fun place to go and sample different types of dim sum! We've been to this location and the one in China town...we enjoyed both.  This location can be tricky to find on your first trip, but once you realize where it is it is kind easy.<br>I go for the warm BBQ pork buns,  but I enjoy the variety that you can sample without breaking the bank. We sampled the Sweet & Sour Chicken and it was phenomenal!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/EW7ZxefE8N0mzty8XkXwjQ/348s.jpg", "caption": "Sweet n sour chicken - really good"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/k9nTjHzAUTsPulAcu4rDRQ/168s.jpg", "caption": "Custard tarts"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/-YLnk6KXCwdZQTX9LBGabQ/168s.jpg", "caption": "Inside bbq pork bun"}]}}, {"review": {"des": "Delicious food, the place is really clean and the service staff was really helpful with all my questions about the menu. I don't know if this is the best Dim Sum in Chicago but it was really delicious and cheap. I ordered tarp and chicken spring rolls, jellyfish, shrimp dumplings and chicken and shrimp dumplings. Delicious and spicy.", "pics": null}}, {"review": {"des": "My father has been chasing Chicago's best Dim Sum for as long as I can remember.<br><br>This has been is go to in recent years.<br><br>The food is delicious.<br><br>They do a great job with both Dim Sum and normal dishes so order both!<br><br>I'm sure we'll be back!", "pics": null}}, {"review": {"des": "Great location near home, a little bit of Chinatown feel and taste outside of Chinatown!  They have 4 locations in the city.  The interior is clean and sunny and the employees are very friendly and available if you need them.  The dishes are by order, they don't come around with them but they come pretty quickly once you order.    I avoided it for a while thinking it was going to be some price-jacked watered-down version of Dim Sum but it is the real thing, you know it's good when you see the crowd is largely Chinese and seems happy.", "pics": null}}, {"review": {"des": "I was super excited to get dim sum in Chicago and this place happened to be open on Thanksgiving Day. I think maybe if I had come on a less busy day, it would have been a 4. <br><br>When my spouse and I first showed up at around 2, the wait was over an hour long to get a table for two. Since they were open until 10 PM that night, we decided to eat a quick bite from the grocery store next door to the restaurant. We walked around Millennium Park for a bit and came back at around 4. It was a bit confusing when we entered because there were so many people in there, but eventually we were given a sticky note (no kidding) with a number on it to hold our place in line; they told us the wait would be around 25 minutes. <br><br>Pro tip: if you're getting dim sum, like we were, grab a menu and decide what you want and mark the quantity of each on it. <br><br>After we were seated, they took our drink orders and our marked dim sum menu right away. We ordered 4 dishes: shu mai, sticky rice steamed in lotus leaf, custard rolls, and a roasted/fried pork dish from sort of the chef's special section. Well, we wanted to order the roasted/fried pork but were told a few minutes afterwards that they ran out of it; we decided to get the bbq pork instead. <br><br>The shu mai and sticky rice came out within 5 minutes and the custard rolls came out 5-10 minutes after that. The shu mai were really excellent - large and meaty/shrimpy with big chunks of mushrooms. The sticky rice was a smaller potion than I had expected, but it was very tasty and had all the fillings I would expect (Chinese sausage, egg yolk, minced pork). The rice was steamed perfectly. The custard rolls weren't really what I thought they would be; we got them because we had never had them before and were curious. <br><br>We must have waited about 20-30 minutes for the last dish. We asked a server about it because we thought maybe they had forgotten but he said the kitchen was just really busy. I get it, it's Thanksgiving; no big deal. At one point he said it was coming out in one minute. 10-15 minutes later, a different server told us they were out of that dish as well. We ended up just asking for our check. Well, they had charged us for the pork dish, so we had to ask them to take it back to get voided. Finally, we paid and left. <br><br>I was comfortably full (not stuffed the way I usually am after getting dim sum haha) and it wasn't too expensive considering it's Chicago. I gave them 3 stars because of the hiccups in service but I know that it might have been different if we didn't go on a major holiday and they weren't so busy. Overall I'm glad they were open and enjoyed the shu mai a lot!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/YvMxjpFdL_qt-X4csm6PXw/348s.jpg", "caption": "Milk tea (cold) and custard rolls"}]}}, {"review": {"des": "Definitely not quality food... <br><br>We ordered delivery... Never Again!!!<br><br>The crispy pork belly was (I can't even explain) what was wrong...  Either fried in cold oil and so meat was soaked in oil or just stale meat - Avoid it!<br><br>The Chicken Fried rice was average...  Chef seemed to be having a bad day<br><br>Beef with Black Pepper was almost with no seasoning <br><br>Get your act together or...", "pics": null}}, {"review": {"des": "FOOD OVERLOAD<br><br>What Did I get<br>What did I not get! I was so hungry I ordered pretty much everything! Sorry some I didn't get a picture of... I sat at a small table at the food was a lot.. Here we go....<br>Rice paste rolls - Got the shrimp, vegetable and pork. OH BOY these were very generous. There was a lot of stuffing. The rice rolls was a bit thick for my taste but i appreciated the generous amount of meats inside! <br>Cakes - Turnip cake and taro cake. These were good! Loved it<br>Egg Tart - I was so stuffed I didn't have the chance to eat these hot.. but has this at the hotel and it would have been good if it was warm and fresh...<br>Shrimp Dumpling (Har Gaw) - It was good. Shrimp tasted fresh<br>Shu Mai - This came with 5! and not 4! It was good too, chewy and had lots of meat.<br>Chicken feet - I like these, they were not as fried as they should be. <br>Curried Cuttlefish - The curry on this was a bit strong for me. If it was another flavor I would have liked it more.<br>Overall the foods was more on the sweet side and not on the savory side.<br><br>Environment<br>Boy was this place hard to find and hidden. There was a long wait... We went around 130...For a table of 2 I waited for about 30 mins.... outside.. Inside there were a lot of seating. <br><br>Niceness of the Staff<br>They were relatively nice. When we needed something they were able to bring us what we needed, no complains<br><br>Dollar<br>It was quite pricey for me. Not sure if I would make this place a habit to go. Once a while is good. Around $3-7 a plate. The bill came up to $56<br><br>Yes?<br>For dim sum, yes. I would also like to try their other menus. <br><br>#WendyWanders #WendyandChiTown", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/w91ukLslmoiJRJfPjDP89Q/348s.jpg", "caption": "May 2018 - tea"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/PjZgYJz6I14ARZ0ytIJCEQ/168s.jpg", "caption": "May 2018 - Shrimp rice roll"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/EBrkmLxMY9_In0AH3YI-og/168s.jpg", "caption": "May 2018 - rice rolls with pork bbq"}]}}, {"review": {"des": "Really great Tsang Fun (they call it the crepe rolls on the menu); the noodle was tender and bouncy. Wasn't impressed with their limited dim sum menu, and their chow mien left something to be desired. I also had their egg custard buns, and that was alright. Would I go back? Probably only for the Tsang Fun if I was really craving it.", "pics": null}}, {"review": {"des": "Fantastic dimsum for a reasonable price! I was stoked to try this place because it's Michelin recognized and it didn't disappoint. From the har gow to the congee to the Chinese broccoli and turnip cake, everything was scrumptious. The only thing we didn't like was the free cookie they gave at the end of the meal. Lol! It was dry. But it was free so oh wel, not our loss. I don't think many people like them, so many tables didn't eat there's too. Hopefully management sees this. The best part though was the egg yolk bun. Holy heck I've never had it that good before. You could tell it was freshly steamed and the custard was soooo flavorful and was oozing out the bun. I dream about this egg custard bun.", "pics": null}}, {"review": {"des": "My mom, aunt, and I went to Chicago for the weekend. After reading reviews about this place having the best dim sum in Chinatown, we had to check it out. MingHin definitely didn't disappoint! We went early Saturday morning and waited only 10-15 mins. Like other reviews have said, MingHin doesn't have those neat dim sum carts. Instead, they give you a paper menu. On the paper menus are photos of all of the dim sums. Write the quantity of what you want next to the photo and just hand that to the waitress. Our food came out in bursts--which I loved! My guess is that when it's ready, they bring it out. It tasted way more fresh and they pack in the protein!! MingHin is also cheaper than what we have in Minnesota! We are definitely hitting up MingHin the next time we're in Chicago.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/kVorbdHJst-mBSvQxVa5cw/168s.jpg", "caption": "Pan-Fried Potsticker"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/8QHIIk4gSPho7BdNst0sgA/168s.jpg", "caption": "Pork Buns"}]}}, {"review": {"des": "Minghin came highly suggested when looking for dim sum recommendations during a weekend stay in Chicago. It surely did not disappoint: there was no wait at 11am on a Sunday, the service was excellent compared to other dim sum restaurants, and the restaurant was clean and had a trendy ambiance, which is a great breath of fresh air from traditional dim sum. <br><br>The food was very good; we ordered combination fried rice, shaomai, baked BBQ pork buns, shrimp dumplings, beef short ribs, and egg custards. The fried rice took twice as long to arrive than the other dishes, and we had finished eating for about 8 minutes by the time it came to our table so I recommend ordering entrees before you even look at the dim sum menu. Overall, the food was good for the price and we ordered the perfect amount for two people (one of which has quite the appetite!). The egg custards were very flaky and buttery, so keep that in mind if you prefer a crispier crust. I ordered a coffee as well (I require coffee at nearly every meal) and it came pre-mixed with milk and sugar, so you should specify if you want black coffee. <br><br>Consistent with all dim sum restaurants, it was quite noisy, but there is considerably more privacy in this restaurant than others. <br><br>Overall, the restaurant is a solid 4-stars: clean, good service, good food, and good ambiance. However, there was nothing truly special about this restaurant - just your standard Cantonese Dim Sum.", "pics": null}}, {"review": {"des": "Just as good as the MingHin in Chinatown!  Outstanding food and Service. Our server Eric was amazing.  Very professional friendly and helpful.  Had our favorites Pork Belly, Roast Duck, Egg yolk buns , shrimp egg rolls and short ribs. All were delicious.  Also had the hot and sour soup which is excellent. Nice and spicy.  Also tried the baby book Choy with garlic which was also delicious.  Truly a great meal and the best Chinese food anywhere.  Yes anywhere!  I live in New York and while I have some favorite spots for Chinese food in Chinatown there is nothing to compare to MingHin.  Truly the best I have ever had.  I don't live in Chicago but will always come here whenever in town.  Don't miss it!   Also this new location is very nice and beautiful atmosphere", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/yfb8pekd_xep1NmqYkkbCA/348s.jpg", "caption": "Don't miss the pork buns!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/8llnmxO-soJQciuC4_2vdg/168s.jpg", "caption": "Roast duck"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Vx4MAB_Tye20Gm3ak2sEFQ/168s.jpg", "caption": "Honey short ribs"}]}}, {"review": {"des": "I've been here twice in a week now and I love MingHin!<br><br>The service is on point! Food comes out fast, they refill your tea, dishes are cleared promptly - what's not to like? <br><br>The food is delicious~. I love the shrimp dumplings, the bbq pork buns, the shumai, and the fried sesame balls. Basically everything I tried, I loved. I'm not usually a big shumai or shrimp dumpling person, but they are really fresh tasting and still have a good texture and flavor to them at Minghin. The baked bbq pork buns are soft and buttery on the outside and warm and meaty on the inside. The fried sesame balls are crispy on the outside, and warm and gooey in the inside (rice cake) with a sweet paste in the center. The food is SO good and it keeps me coming back every time!<br><br>The location is a little weird; it's located next to the Mariano's. If you come from the backside, you'll need to take the escalators all the way up to get to the restaurant. It's close to many businesses so you could do a quick lunch here or a dinner right after work!<br><br>I'm a huge fan of MingHin and will continue to visit frequently!", "pics": null}}, {"review": {"des": "Food is pretty standard dim sum level. About 10 mins wait to be seated. Waitress kept asking if we wanna sit at bar or outside lol. Service needs big improvements. <br><br>Wish have gotten more attention from the waiter bc our tea cup wasn't refilled after having the top flipped there for 10 mins and had to flag someone to get it changed. Asked for vinegar and hot sauce and never got it. Asked another waiter then finally got it. I guess they're just very busy and didn't have a problem grabbing the signed receipt from us in the face before we even left the table?", "pics": null}}, {"review": {"des": "I ate here last month, but I'm just now getting around to writing about it.<br><br>My friend made brunch reservations for 6 people. To say this was the best dimsum of my life is no exaggeration. I love dim sum, and I've tried so many places in NYC, but this place takes the cake. <br><br>I can't remember what we ordered because my friend did it in Mandarin, which I don't speak. However, you really can't go wrong with anything you order here. What I do remember stuffing into my mouth were the shrimp dumplings, spare ribs, BBQ pork bun, siu mai, beef crepe, and my one true love, the egg yolk bun.<br><br>I won't speak to each of them except for the egg yolk bun. I have been searching for egg yolk forever. Sometimes it's custard. I don't want custard. I want that golden lava. This place had it. It was sweet and sugary and delicious. Most of my friends could only eat half of the bun, but I had to eat an entire bun because I was just so happy to have it. It was phenomenal. Just writing this review makes me think about it all over again. <br><br>I also ordered a peach boba to go. They have fairly big sizes, and I found that they had the perfect boba to slush ratio.", "pics": null}}, {"review": {"des": "I came back to this place for Sunday lunch while my family was visiting. The wait is still long (1 hour) and the food is still delicious.<br><br>Oops, I found a piece of plastic wrap inside my shrimp dim sum. <br><br>I totally could have not noticed it but I did, and it made me question the hygiene/discipline in the kitchen area. I mean, how fast (or carelessly) do you have to be rolling dim sum to let this served up to a customer? <br><br>I didn't want to give a hard time to the waitress who was wonderful and had nothing to do with it; she even knocked out this item from charge. But I thought it wouldn't be fair to let this slip by since this is kinda serious. I love the dim sum here so I'd love to go back, but from now on perhaps with some caution when I do...", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/uQSYwF6YouRvTU8rwXKEaQ/348s.jpg", "caption": "A giant piece of plastic wrap found inside my shrimp dim sum."}]}}, {"review": {"des": "Decent enough if you carve for dim sum. Most dishes were too oily. Also service was spotty with the lead waitress treating some guests better than others. <br><br>The rice noodle roll was good. The roast pork was pretty good as well but cut too big big given the more fat to meat ratio. It was just too heavy after few pieces. The shiu mai and egg tart weren't good. Other dishes we had weren't memorable.", "pics": null}}, {"review": {"des": "I've eaten at MingHin a number of times. Their Dim Sum is great and they serve it all day! Would absolutely recommend coming for the Dim Sum, there aren't many other options in the Loop.<br><br>On the other hand, their non Dim Sum food is only okay. Service is only okay too. it can take some time (up to 30 mins) to get seated at busy hours. Food comes relatively quickly, but multiple times I've had dishes forgotten about, and had to remind them.", "pics": null}}, {"review": {"des": "Flying to Chicago. You would think most would go for the infamous slice of pizza to compare of all pizza's. Sure you can. So are 1000 of other people. Why not hit up an Asian spot!? This place is definitely one of the best take outs I've eaten. The variety of sauces they give you. BONKERS! Not many would be so detail in giving you so many other then your typical plum, mustard, and soy. When I'm on my trips I get a little home sick. Missing that good o Chinese noms. This would be the spot! I mean heck. I've ordered it 3 nights in a row without getting tired of it! Till my next trip!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/8eKJ-UPctqcZdhCgO-p2sg/168s.jpg", "caption": "This is by far the most legit place!! With the sauces! NYC needs this!!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/xYRZtFDc8gRYMn2EB1IdfQ/168s.jpg", "caption": "Salt pepper pork chops, pop stickers"}]}}, {"review": {"des": "I must say the food was absolutely amazing and the service was excellent!!!!! Most Chinese dim sum servers are rude but here they showed the up most respect....I would definitely come back over n over again.....highly recommended.....keep up the amazing service!!!!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/aKCRF12KTRx39wR4pChp5A/168s.jpg", "caption": "Perfect view n the service was absolutely amazing!!!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/sY7o3p4iSoCYjGO9k5O6Sw/168s.jpg", "caption": "The view was beautiful"}]}}, {"review": {"des": "Omg. SO hard to find! We're not from Chicago, so that's probably why. But it literally took about 15 minutes for us to try to find the place. Google maps was no help. BUT it was so worth it. We almost gave up, but persevered and eventually found it.<br><br>LOCATION: this place is located on the 4th floor of 333 E. Benton, and the entrance faces Randolph street. <br><br>So we had a reservation and we ended up being about 15 minutes late from wandering around trying to find the place. But I don't think we would've needed the reservation. The place is pretty spacious. <br>I was a little disappointed that they didn't have the traditional carts. But it was fun ordering off of the menu that had pictures of each item. I ended up trying different dishes that I normally wouldn't have tried. I loved everything we ordered. Pork/shrimp shumai was my favorite. <br>Our server was excellent, everything came out quickly. Great way to end our Chicago weekend.", "pics": null}}, {"review": {"des": "I love dim sum. So very much. And this place does dim sum RIGHT. They have an excellent selection of dumplings, noodles, and other delicacies and everything comes out well timed and delicious. Great place for groups as you can split everything and the space is huge. I'm always weary of a restaurant in the Loop, but this place is well worth the confusing trek to find it.", "pics": null}}, {"review": {"des": "This dim sum place is so good!! I'm from LA where there are so many authentic Chinese restaurants and I think this place is better than any dim sum place I've tried in LA. I had to come back before I left Chicago! <br><br>The restaurant is very clean and modern. The price was great for the quality of the food. We must have tried more than half of the dishes on the dim sum menu across the two times I visited. LOVED the beef tripe, spare ribs and chicken feet. The shrimp dumplings and siu mai were great too.", "pics": null}}, {"review": {"des": "Review for delivery only:  Their rocket-fast delivery time from River East to Streeterville (only 45 minutes) couldn't make up for the mediocre offerings on our second attempt. <br><br>The meat in the Pot Sticker appetizer ($4.95) had a strange, burnt taste on the inside. Our Shrimp Egg Foo Young ($13.95 for three large orbs of egg and noodles) was delivered with a strangely watery sauce that tasted like a blend of chicken stock and soy sauce - not the rich, smooth and unctuous brown gravy we received with our last order. The Orange Beef ($13.95) featured long, chewy strips of beef - some pieces were visibly charred, others were still coated in gooey, raw corn starch - but none of it had any actual orange flavor. <br><br>Sigh!!!<br><br>Pretty unremarkable for $48 - I think we'll look elsewhere for Chinese delivery.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/pw9b6eBaIDwg4ZQJI_YgSQ/168s.jpg", "caption": "The Shrimp Egg Foo Young was delivered with a strangely watery sauce & the Orange Beef pieces were either charred or gooey with corn starch."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/KgQYuaBZWCANGqoqvuq1EA/168s.jpg", "caption": "Our Pot Sticker appetizer ($4.95) had a strange, burnt taste on the inside."}]}}, {"review": {"des": "Good but was expecting more. Hubs and I really liked the braised beef, steamed pork spare ribs w bean, and congee. <br>Were not impressed with the chang fen, fried chive dumpling, and longan bun (paste was mixed with egg yolk).<br>Interior decor was beautiful though! Very elegant.", "pics": null}}, {"review": {"des": "Loved the atmosphere. We got a table by the window and it was beautiful outside, a really nice view. Food was good. You order everything from a menu with pictures which is super helpful in picking what you want. We got Chinese broccoli, chicken feet, shrimp dumplings, rice crepe shrimp wraps, yolk buns, egg tarts, stretched tofu, etc. Service was great and they didn't mind us staying a long time since the restaurant is huge and there is lots of space. <br><br>Would recommend to anyone visiting Chicago looking for good Dim Sum.", "pics": null}}, {"review": {"des": "A place for authentic dim sum and traditional Cantonese food. The meat is also good so you can always have one or two kind to go with your rice.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/2BU5AKGnCfdtzfbHkxW3fQ/168s.jpg", "caption": "Steamed scallop"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/rtIIgRLtfVZN3NGCFWuifg/168s.jpg", "caption": "Cha shu meat"}]}}, {"review": {"des": "YOU DIM SUM, YOU WIN SUM! My monthly dim sum spot in the city. I prefer this location in the Loop than on the one Grand and Chinatown, since you can do dim sum all day. The quality of the food is quite great and the drink is good too. HK milk tea, ask for a cup of ice on the side to make the drink even more colder and more refreshing. <br><br>For this meal, I got<br>1. Pot stickers<br>2. Shrimp and Chive dumplings <br>3. BBQ buns<br>4. Udon and bbq ducks<br><br>All were very delicious! Also, I love the staff, all were very attentive as always! Bottom line, same dim sum quality amazing as you would get in LA, NYC, SF, HK and other great city you get dim sum! Happy Yum Cha-ing!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/l2_nrU3dinryw7qUNKRonQ/348s.jpg", "caption": "Hong Kong milk tea"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/NB5fBaLFTUA3nj0YiVWINA/168s.jpg", "caption": "Stir Fried Udon with BBQ Duck"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/AcLYLSkOdUHr1gLxRX7yDw/168s.jpg", "caption": "Pot stickers"}]}}, {"review": {"des": "Very beautiful decor and the view from their windows is insane!!! I came here for lunch today in between doctors appointments and I was welcomed very nicely and offered tea. I'm Chinese and it's so funny to me how they offer both chopsticks and a fork in their table setting but it's way easier than having people ask/complain. However, once the food came, which was relatively pricey (but yes, I understand this is lakeshore east and rent is expensive), my roast pork did not taste like the classic roast pork I'm used to having (it was sweeter and not as fatty (probably to cater to Americans)) and their spare rib dim sum platter did not have enough black bean sauce for me to consider authentic. Their noodles are phenomenal though, I had the XO sauce rice noodle and it never fails to impress, just a bit pricey. Staff pleasant as always and I'm glad they speak Cantonese- feels a bit closer to home.", "pics": null}}, {"review": {"des": "Great place for dimsum! The shrimp dumplings (虾饺） were my favorite, large shrimp filling and not too sticky. Food came out fast, tasted fresh, and was very cheap (we ordered around 12 or 13 dishes and it came out to $13 per person for 4 people). I liked that the food came out all around the same time. Only downside was they did not have push carts which would've been more fun, so you have to order from a set menu.", "pics": null}}, {"review": {"des": "It seems like most of the reviews are about the dim sum so let me change things up a bit. I do appreciate the all day dim sum but I usually come here for the other food. My go-to orders are always the pea tip shoots with Japanese tofu and the beef brisket with eggplant. I also always get the stir fried rice noodle with beef (chow fun). So good! If you're a tofu lover, you have to try the Japanese tofu they have here, it's like a bite of heaven. It's fried on the outside but the inside is like silken tofu and I have no clue how they do it. The beef in the noodles are also so tender and the noodles are very flavorful. Brisket is tender and well seasoned. My fiancé and I go here at least once a month.", "pics": null}}, {"review": {"des": "This place definitely exceeded my expectations. I expected a traditional Chinese restaurant with dim sum carts rolling around. I was shocked by two things: FANTASTIC customer service and the beautiful modernized decor. The interior was very clean and spacious filled with comfortable chairs/couches. It was definitely a new experience for me. <br><br>Some highlights for us: <br>Shu mai - comes with 5 pieces! Super juicy and delicious.<br>Pan fried taro - They use REAL taro pieces and not the powdered kind. Legit stuff. <br>Duck over rice plate- The rice was on the dry side but the duck was tasty. I really enjoyed the sauce. <br>Chives pancake- The pork went really well with the chives. I did wish the dough was a bit more chewy. <br>Baked BBQ buns- perfect balance of sweet and savory. There's an abundant amount of meat in there too. <br>At the end of the meal, they give you some cookies and fortune cookies! Woop woop. <br><br>In addition, A+ service! We were greeted immediately upon arrival three times. We sat at a table within a few minutes but the workers didn't explain how to order. They just left tablets and a bunch of menus on the table. They did check on us frequently clearing out dishes and refilling water.  And food came out fairly quickly.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Zotg25ZUC4QC06dMD7nTJA/348s.jpg", "caption": "Tripe & sticky rice"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/gj9ytNR8YQnhUpb0LwENmw/168s.jpg", "caption": "Interior"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/rmuR4aLL4luw_nX3yE0k4A/168s.jpg", "caption": "Hot tea"}]}}, {"review": {"des": "Authentic and absolutely wonderful. Dim sum is fresh and tasty. Highly recommend trying their shrimp dumpling and pot stickers.", "pics": null}}, {"review": {"des": "I come here probably at least once a month for lunch with friends/coworkers during the workweek. It is different than the usual lunch places in the loop. The prices are extremely reasonable for the area. I like that they have lunch specials that include both more authentic Chinese dishes and the more 'fast food Chinese' dishes so there is a wide variety. My favorites include the salt and pepper pork chops, fried rice, and beef with chinese broccoli. You can even substitute brown rice for white rice at no extra charge!<br><br>The dim sum here is also solid when you don't want to make a trip down to Chinatown. It is a little confusing to find if you're not familiar with the lakeview east area, but it is directly across the path from Mariano's.", "pics": null}}, {"review": {"des": "Place is clean and nice. It's not easy to find if you don't live in Chicago.  It is located in 4th floor of Village Market. Parking is free for the first 120 minutes.  You have to ask for parking ticket validation. I forgot to do this and I had to pay $25.00 for parking. Food is just as good as in MingHin in the suburbs., but the selection was limited. We came in after lunch and there was no wait.<br><br>This will be our favorite Minghin place.", "pics": null}}, {"review": {"des": "Came for lunch with a group of coworkers to celebrate the Chinese New Year. We made reservations for 11:30 am and I'm glad we did because by noon it was very busy. <br>We ordered dim sum for everyone to share and try different dishes, which was really fun. I've been to dim sum many times before, and at the MingHin in Chinatown too. The menu is largely the same with only slight differences. My favorites tend to be the bbq pork buns, any of the dumplings, and this time around I discovered I really like taro root! <br>Per usual, timing of the dishes was mostly staggered and there was only noticeable lag towards the end of our visit when we put in a few more orders during their peak time. Water glasses were kept filled, as were our teapots, and we were given complimentary fortune cookies with our bill. For a group of 10, we must have ordered ~16 items and it came out to $16 each. Super affordable and I left pleasantly full.<br>So if you're looking for a good dim sum restaurant in the loop, MingHin definitely does the trick.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ceK7wG8Ep410YBOI4-6QWA/348s.jpg", "caption": "They have a bar area up front too"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/fMYAzscO0RqftuVMiFLIWA/168s.jpg", "caption": "The main dining area"}]}}, {"review": {"des": "Arrived in the afternoon into Chicago on Saturday March 25th, and stayed at the Hyatt Regency Chicago off of E. Wacker. Hungry around 3pm, there was no line and the place was moderately packed. <br><br>The food was freshly prepared and the service was outstanding. They were very attentive and came to check on me often. Changed out my plate when needed and did not feel rushed at all like most Chinese dim sum places (maybe because it was an off-hour). <br><br>The food was hot, and I will definitely eat their dim sum again. No wonder they have been successful in opening multiple sites at very nice locations!<br><br>Great dim sum for anyone who is staying downtown for work or conference like i was!", "pics": null}}, {"review": {"des": "The Chinese food was ok. <br>BUT I did a search on Yelp for KOREAN and this restaurant popped up and was close so we went..,<br>It is NOT a Korean restaurant.<br>Don't know how they tag theirselves for searches but Korean and Chinese is totally different.  I was wanting Korean :(", "pics": null}}, {"review": {"des": "I used to live right by this gem. Great food! Although service needs a lot of work. Sometimes you'll just be sitting around to get attention from someone but the food never disappoints.", "pics": null}}, {"review": {"des": "Always good place to share some dim-sum with friends. <br>Good service. <br>Clean food, I could eat here all day. <br>Great view!", "pics": null}}, {"review": {"des": "This was our wild card pick for the night. We didn't have something planned on our itinerary for dinner in hopes of discovering something new and to force us to explore the city and to be surprised.<br><br>After having American food for a few days straight, we were craving some Asian food. Because we weren't able to find a good ramen spot, we settled on Chinese food and from the looks on how busy this place was, we seemed to have made a good decision. This place was packed! We were also surprised to see how nice the restaurant is, probably one of the nicest Chinese restaurants we've ever been to! <br><br>We waited for about 40 mins and finally got seated. They had a tablet ready for us at the table and a dim sum menu. We were told to order entrees from the tablet and to mark how many orders of what we wanted from the dim sum menu. <br><br>Once again we ordered more than our stomachs can handle, but everything was delicious. We were curious as to how the food was going to compare to what we have at home, especially since there's not many Chinese restaurants in the area, but we were pleasantly surprised. From the dim sum menu we ordered siu mai, shrimp dumpling, shrimp rice cake, and the baked egg yolk bun. The tablet had a wide variety of options ranging from appetizers, soup, vegetable dishes, fried rice, etc. We got an order of the Ming Hin special fried rice as well as the salt and pepper fish fillet.<br><br>We thought most dishes from the dim sum menu was very good, nothing special to stand out from other good dim sum spots, but just really good. However the baked egg yolk bun was the life of the party. Different from your traditional egg custard bun, this one came with a sweet and savory taste. After the first bite, you get some of the ooey gooey egg custard goodness from the inside, with the saltiness from the egg and a nice crunchy crust on the outside of the bun. This is something we don't find often here in the Bay Area, so will definitely be craving this. <br><br>Our hot items from the tablet wasn't special from any other chinese spots, it was just prepared very well and was generous with the portions. All in all, everything we ordered satisfied our cravings and would definitely recommend. <br><br>Quick note, we suggest checking up on your table and status in line every so often to make sure you aren't missed. Service can also be slow on busy nights like one we experienced, so beware!", "pics": null}}, {"review": {"des": "What an awesome location! Thank you MingHin for a wonderful experience! <br><br>I love dim sum. If I could, I would eat it for breakfast, lunch and dinner. Unfortunately, I have no idea how to make it. Luckily there's a bunch of Ming Hin locations around Chicago. <br><br>I may be a little biased, but this is my favorite location. Unlike their other location in Chinatown, this location is super clean and everyone is super friendly. They also speak English well! It was super easy to make brunch reservations online. We did not have to wait and just walked in right away. The BEST part about this location is that the food arrived soon after we placed our order! Everything was fresh and warm. <br><br>BTW, this is NOT a dim sum place where they roll around carts and you get to pick what you want from the cart. You get a sheet with pictures of the food and you simply write down how many orders of each item you want. When you're ready to order, you hand them the sheet of paper. <br><br>I recommend the Siu Mai, Shrimp Dumpling, Turnip Cake and Shrimp Crepe. Skip the BBQ Pork Crepe, dumpling with chives and pot stickers. We even ordered some BBQ duck on the side and it was pretty delicious - super juicy and tender. <br><br>The only weird part of this chain is that there's no soy sauce or chili oil on the table. You have to ask for these two items. It's crazy because for a table of 4, we got a small dish of soy sauce, which meant we kept having to ask for soy sauce... I believe that every dim sum place should already have soy sauce and chili oil at each table. Maybe it's a Chicago thing? If you don't mind asking, this is the place to go for dim sum. <br><br>I will definitely be back! Thanks again Ming Hin!", "pics": null}}, {"review": {"des": "We were very excited for Dim Sum here but walked out very disappointed.  The food was cooked well and the servers were nice, but the ingredients itself were not fresh.  Our shrimp tasted extra fishy, the chicken feet did not taste fresh, and the stuffed sticky rice in lotus leaf was literally not edible.  I spit it out after one bite.  It tasted like it had been frozen for weeks and then recooked.  The servers were nice enough to take the dish back to the kitchen and comped it.  The standout dishes we did like were the congee and the chinese broccoli, and the Shiu Mai was not bad.  I think all the issues from today could have been eliminated if the ingredients themselves were fresh.  The cooking was not bad but the best chefs in the world can't make non-fresh food taste good.", "pics": null}}, {"review": {"des": "This dim sum place is pretty good. I really liked their ordering system of where you can mark a menu, it reduces the work and confusion of chasing down of servers that push the carts. One thing I'm not used to is the hoison and Sriracha sauce. Maybe it's the area, but I am used to eating dim sum with soy sauce and chili peppers.<br><br>As for the food, some dishes I enjoyed and some I thought were just okay. Overall, the dim sum tastes less oily and more fresh compared to places I've had in the past. I think the turnover rate helps maintain fresh food.<br><br>The sa siu pork in the rice crepe didn't come with enough of the sauce for me. It was a little bland for me, but I felt like it wasn't too oily. The sticky rice in banana leave was good too but didn't blow me away. The dumplings was also good, nothing too special but tasty. I think I enjoyed the chicken feet the most. It was hot and had lots of flavor.<br><br>Overall, a great place to come with others and share a meal. Reasonably priced, clean restaurant, and friendly service. Food comes out hot and fresh, and location is right across from attractions so that's a plus.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/n9rQz9wzwR0iR9N9Joagcg/348s.jpg", "caption": "Eating dim sum alone, no shame"}]}}, {"review": {"des": "4.25/5 dimsum yes.<br><br>so this will be short since i didn't dine in or really sample much, but i did order a bunch of dimsum to go. and y'all, i was impressed/satisfied. really plump and meaty siu mai, substantial shrimp chunks in the har gow, and also a nice serving of the chinese broccoli in my order. all in all it was a little pricier for what i would want to pay for dimsum, but given location and quality i was ok with the price.<br><br>i'd come back and have as seated meal!", "pics": null}}, {"review": {"des": "My fiancé and I came here for brunch since he knows how big of a dim sum fan I am. <br>There was Quite a bit of a wait so I was anticipating MIND BLOWING food.... which was not the case.<br><br>Between the both of us, we ordered:<br>MingHin's Shrimp DumpLings(2)<br>Siu Mai- Shrimp and Pork DumpLings(2)<br>Shrimp DumpLing w| Green Chive<br>Spare Ribs w| BLack Bean Sauce<br>Chicken Feet<br>Short Ribs w| Honey Sauce<br>ChiLLed JeLLy Fish<br><br>So here's the rundown of our visit:<br>-Finding this Location was a bit of a headache. It is Located in the ViLLage Market on the 4th fLoor.<br>-We were immediateLy given hoisin [pLum] sauce and sriracha but we had to reQuest for soy Sauce. Not sure if it's an East Coast thing but I couLdn't|wouLdn't bring myseLf to eat dumpLings with hoisin.<br>-The tabLe was too smaLL for us and aLL of our food. I'm not your typicaL Asian who has a tiny appetite- I gets doooown!! <br>-The restaurant forgot one of our orders and we had to fLag someone down and Let them know.<br>-Bathrooms are a mess with toiLet paper and paper toweLs aLL over the fLoor. Yuck.<br><br>The food in itseLf was simpLy ok. I've definiteLy had better tasting dim sum out in the Bay Area.<br>The huge Letdowns were the FLAVORLESS ChiLLed JeLLy Fish, the HONEYLESS Short Ribs in Honey Sauce (they just tasted bLand and oiLy), and the Shrimp DumpLing w| Green Chives (the texture was more mushy than anything).<br><br>On the bright side, the cubed sugar crystaLs are an eLegant touch and a nice way to sweeten up your tea. <br>The customer service was good. There were a few times when we had to fLag down a worker but on muLtipLe occasions someone stopped by to ask us how everything was. <br><br>Three stars because this pLace has potentiaL, maybe it was just a reaLLy reaLLy off day....<br>That being said, I'm not too sure if I'd come back.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/cAMSBJLtK92fZgdrtTQQVw/348s.jpg", "caption": "ChiLLed JeLLy Fish"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Ifr5_nX-HSvIhcEXiH8BaA/168s.jpg", "caption": "Short Ribs with Honey Sauce. PASS."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/SdMPRH0XlYOYLoDKw6HxCQ/168s.jpg", "caption": "Tea with cubed rock sugar"}]}}, {"review": {"des": "I ordered delivery for  stir fried rice noodles with beef. I wrote a note for no any kind of onions.  Because I have allergy with onions. After 50 mins waiting (only 0.04 miles from my apartment) only 3 pieces of beef in my noodle. I throw the noodle when I saw onions.  The driver call me and ask me to go down wait for him. So I did, after 10mins standing in the wind waiting this stupid man to find me. Never order again from this stupid restaurant, just tried.", "pics": null}}, {"review": {"des": "If you don't want to wait too long on a weekend, this is the place to go. However, if you want good dimsum, you'd better stick with their location in Chinatown.<br><br>I've been to their Chinatown location plenty of times, and the food has always been good. I was expecting the food at their Loop location to be of the same caliber. This, unfortunately, was not the case. Our food came out piping hot, but most of it was overcooked. The dumpling wrappers on our shrimp dumplings fell apart and couldn't hold the dumplings together. The wraps on their beef crepe dumplings were too gummy. Even their shumai dumplings were not as good. And if you know dimsum, you know that the shrimp dumplings (hargow) and shumai dumplings are what we rate dimsum places by. They are staples in dimsum places. The one good thing we ordered was the fried turnip cakes. These turned out just right. They weren't overcooked into a soggy mess. <br><br>The service was good, but I don't think I'd come back here ever again.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/XsvS4wtdIn29pqPIxsoh3A/348s.jpg", "caption": "Beef crepe, shumai, hargow, fried turnip cake, and Macau pork belly"}]}}, {"review": {"des": "My party came here for dinner and the service was amazing! We made a reservation beforehand, and once we came we were seated immediately. Someone was always around to clean up any plates we finished or asked if we needed anything approximately every 5 minutes. Restaurant is very clean and the dim sum came out very quick.", "pics": null}}, {"review": {"des": "Our second time dining in for dinner. Nothing bad to say about this place. Reasonably priced Dim Dum in the loop! You can't beat that. This place is sooo so good! The portions are so big and the service is so fast. Everyone is working hard and helping out so your food comes out fresh, fast, yummy, and in a timely manner. I would totally recommend giving this place a try.  We will be back for a third round and probably a fourth!", "pics": null}}, {"review": {"des": "This is the first restaurant I went to while visiting Chicago for the first time. The chicken was delicious but the fried rice seemed like it was just white rice with soy sauce. I felt a little rushed here but the servers were nice and the ambience was good. The menu was on an iPad as well as on a pamphlet which was a nice change. I would recommend MingHin to anyone looking for a quick sit-down meal, but maybe not a date.", "pics": null}}, {"review": {"des": "I gave 3 stars only because of the fast delivery. I ordered chicken egg food young, it wasn't that good.", "pics": null}}, {"review": {"des": "Minghin is my favorite place for Chinese food in the city, although I haven't had a chance to explore as much of Chinatown as I'd like.  I love the location of this branch, as it's centrally located near plenty of other shopping and dining options.  <br><br>We go about once a week and always love having the ability to get dim sum at dinner.  One thing I noticed and love is that the shrimp in all the dim sum are huge and really fresh.  This is not always the case at other dim sum restaurants.  We generally also got a seafood noodle dish, seafood soup, and vegetables, all of which come out promptly and prepared perfectly.  It's hard to judge a lot of items on the menu because we always return to our favorites, but the dishes on other tables look similarly appetizing and I would imagine they are also prepared with outstanding quality.<br><br>While it's a big space, Minghin is always packed at dinner time and all day on weekends, but they're efficient about service and turn over tables quickly.  Service is professional and even sometimes friendly!  The prices are reasonable, just adding to our love for this place.", "pics": null}}, {"review": {"des": "Great Chinese restaurant, good taste, reasonable price, even provide free tea and cookies. Thumb up!", "pics": null}}, {"review": {"des": "I came here as a late birthday celebration a few months ago. The place looks polished and chic. <br><br>We came here on a Tuesday night. There weren't that many people but the service was kind of slow. We had to wave them down a few times because they weren't coming to us. <br>Besides that, the food was good! We ordered pork buns, dumplings, egg rolls, and other things. The cocktails were good as well! <br><br>My family and family friends love going to the MingHin in Rolling Meadows. That place is always busy but hopefully I can go back soon", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/-3fO9xLfPyzdddWTab6LRg/348s.jpg", "caption": "Me, K, and T"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/P8nNc2FZK2P0kvrWGSg5lg/168s.jpg", "caption": "Refreshing"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/J_WcCrjjxed9hnPUxAW1Pw/168s.jpg", "caption": "!"}]}}, {"review": {"des": "Came here to try their dim sum because we were craving it. Tried the shrimp rice noodle, mango pudding, shrimp egg roll, egg tart, baked pork buns, and shumai. Everything was satisfying. I liked the shrimp egg roll the most. I've had the mango pudding at different dim sum places and have to say it wasn't that good so I wouldn't recommend it. The service is quick and good.", "pics": null}}]}