{"name": "mollys-cupcakes-chicago", "reviews": [{"review": {"des": "Molly's is a great to close out your evening with their selection of delicious cupcakes. The last time I was here I was slightly disappointed with the peach cobbler which used to be my favorite. This time I went for the Samoas and was not disappointed. Molly's got the coconut and caramel taste just right. It was literally a Samoas in cupcake form. Definitely recommend to try for those who love Girl Scout cookies!<br><br>My friends and I came around 7 on a Saturday, and there was no line or wait.", "pics": null}}, {"review": {"des": "Hands down my favorite cupcake place in the city! The red velvet with cream cheese... yuuuuuum! They have cupcakes with fillings and they're also good- (Boston cream hint hint). I'm one of those people that actually like the bread part in the cake & not so much frosting, so this place is perfect for me! There're other competitors that just puts more emphasis on frosting rather than the cake so nope, they're not for me. Only Molly's!! Their customer service is super good, too! <br><br>By the way- if you have any vegan friends or people that are allergic to eggs, they make vegan cupcakes!!! AND they taste good! <br><br>Writing this review makes me want to have another cupcake now....", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/hke8FY-sjoq2yDACaOyHAA/348s.jpg", "caption": "November 2018"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/0jXfaxFj26ME9rbyCPMOfg/168s.jpg", "caption": "November 2018"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ymsUsPrWDDE-kdmw12xVpw/168s.jpg", "caption": "October 2018 Samoa"}]}}, {"review": {"des": "I've enjoyed eating Molly's Cupcakes before but I've never actually been to this location. After my recent visit, I realize it's quite a fun place to shoot the breeze while eating a delicious cupcake. There is colorful seating (including a couple of swings!), whimsical displays throughout, and loud upbeat music that the kids seem to love (you know who you are). <br><br>I enjoyed the peanut butter Nutella cupcake, scrumptious in all phases (moist cake, creamy frosting and tasty filling). There is a lovely selection of cupcakes and other treats, so pick your selection and enjoy.", "pics": null}}, {"review": {"des": "I haven't been here in so long but glad I finally made it back. <br><br>There wasn't too many people when we came in on a Sunday afternoon so we were able to take our time deciding which cupcake we wanted. <br><br>I decided on the s'mores cupcake and my mom got peach cobbler. Mine was so yummy and I love that it's topped with marshmallow after a thin layer of chocolate frosting. It wasn't too decadent, it was perfect. My mom also really liked her cupcake. <br><br>The only thing I didn't like was how the cake was crumbling every bite I took. Even when I was holding it, it started to fall apart. We both end up using forks to eat them. I prefer more moist cakes. <br>I would come back again though.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/HLpkd1lvNW48qiHi0490_g/348s.jpg", "caption": "S'mores and Peach Cobbler"}]}}, {"review": {"des": "I now compare every cupcake I eat to Molly's and get overwhelmed by disappointment. Enough said, dont want to repeat what everyone says. I am said they aren't open late anymore. What if I'm craving cupcakes. I wonder what the calorie count is...", "pics": null}}, {"review": {"des": "This place is so, so cute and makes some of the best cupcakes I've ever had in my life. This coming from someone who LOVES cupcakes! <br><br>I won't lie, I got this place confused with another Chicago cupcake company and thought they were one and the same, so I'd walked past Molly's quite a few times thinking I'd already tried their product. Recently my parents were visiting and wanted to go inside, so I complied. It wasn't until then that I realized I'd been missing out on make-your-own cupcakes, whimsical and nostalgic decor, and a lot of friendly faces. They even sell ice cream! <br><br>I included a photo of the make-your-own cupcake menu, because that intrigued me the most. There are also quite a few pre-fixed cupcake creations here at Molly's that I strongly considered, but I'm a sucker for banana flavors, so I went with a banana bread cake, buttercream frosting, and mini Oreo toppings. Molly's also offers the option of getting a frosting filling in your cupcake as well. <br><br>I can't believe I'd been missing out for so long on such a great place that is so close to my home. Molly's has fair prices, friendly staff, a cute ambience, and most importantly, fantastic cupcakes!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/N78L0yRHThGbZRAxG_UIjw/348s.jpg", "caption": "Some of their flavors + combos!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Zkg2IYLDIv3uH-ImPqk_aQ/168s.jpg", "caption": "Swings inside. :)"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/HQnS4_drnVVlktEM1wiAjA/168s.jpg", "caption": "Make-your-own menu!"}]}}, {"review": {"des": "Fabulous cupcakes! I loooove sweets, seriously I have a problem and yelp hasn't helped haha as now I have a \"reason\" to check out many bakeries bc I can write a review! My husband ain't buying it anymore lol. Anyways this place is awesome. Very cute decor, the cupcakes won on cupcake wars a few seasons back.<br>I love how you can see the kitchen and I appreciated seeing a women look through raspberries, checking each one before I assume she washes them (fingers crossed) <br>We visited on a super hot Tuesday, one thing I noticed is the water jug was empty and they were a little busy so I was bummed no water but I def loved the sprinkle station.<br><br>We tried the Boston creme, Samoa, and chocolate cupcake all were delicious. They even gave my husband a free cupcake bc it was his birthday. Very nice, thank you. If I'm ever in the area I will always come here for delicious cupcake", "pics": null}}, {"review": {"des": "Molly's Cupcakes has ruined most other cupcakes for me, and it doesn't help that I now live dangerously close to this little wonder. The interior is all bright pastels and very cute, with a 3-4 two seater tables and a communal table, and even some swings if you desire to eat your cupcake while in limited motion. :)<br><br>They have around 20 flavors of cupcakes, with a few rotating seasonally, and there is a build your own cupcake option as well, though I'm yet to try that out. The cupcakes have fillings, so they're more filling (no pun intended) than your average cupcake. I'd recommend two for three people.<br><br>The cupcakes are not cloyingly sweet, and stay true to the described flavor profiles, and almost everyone is likely to find their cupcake of choice. I have a preference for the fruit based flavors, because I think they do those really well! The staff is also very helpful and has often helped me try out new flavors that I ended up enjoying.<br><br>My favorite include the peach cobbler, raspberry cream, key lime, and chocolate decadence. <br><br>If you don't live in the area, this place is a hop, skip, and jump away from bus stops for 22,36,151,156, and many other lines, so be sure to check it out!", "pics": null}}, {"review": {"des": "I was nervous about trying Molly's Cupcakes. I feel like some places get so hyped up for okay food. After coming here, I see why people love Molly's Cupcakes so much. It is so hard to find a center filled cupcakes and Molly's has a great selection of center filled cupcakes. <br><br>Even though I had dinner, I was drooling when I saw the cupcakes. I could not decide on just one so I got four! I picked strawberry shortcake, peach cobbler, salted caramel butterscotch and s'mores. I normally do not like fruit flavored cupcakes but I figured why not give it a try! I liked the peach and strawberry cupcakes but my favorites were the s'mores and salted caramel butterscotch cupcakes. The s'mores had a nice chocolate filling in the center with a light marshmallow frosting. The frosting was not too sweet and had a great whipped texture. The butterscotch cupcakes center was an tasty caramel pudding filling. Because the pudding filling is heavy, my cupcake began to split when I took it out of the box. My favorite part of the butterscotch cupcake was the salted vanilla buttercream. It tasted not only great but it was so light and fluffy, I forgot I was eating this calorie-heavy cupcake!<br><br>If you do not like the flavors available, you can build your own which I want to try next time!<br><br>This location has these cute swing seats that helped add a fun and whimsical vibe. Already can't wait to go back!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/_JNu16lJN_Vkc9SJIJPbLw/168s.jpg", "caption": "Strawberry shortcake, peach cobbler, salted caramel butterscotch and s'mores. IG: betweencupcakes"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/y6fqemPZRDPwp0-EFn8PIA/168s.jpg", "caption": "Strawberry shortcake. IG: betweencupcakes"}]}}, {"review": {"des": "Honest review: (favorite place for cupcakes) been here 5 times (first experience) felt annoyed ok i went here twice in the same day was in the neighborhood and was like holy shit cupcakes lets check it out n when we got there they had like every cupcakes like the unique ones peach cobbler crembrule and more unique flavors i was like ooo after we eat lets come here for dessert but what i noticed is that its dirty inside like tables and floors are not cleaned but people who work here are dancing or goofing off i was like ok so left to go eat came back like an hour later and all the unique flavors were gone n im like why not just make the ones ur famous for again? Instead of making more basic ones? Just was confused on why they would do that doesnt seem that smart cause its on clark street very busy area should always have what their famous for then another thing we noticed when we walked in it was dirty we ordered our cupcakes then had to clean where we were going to sit because again the people working here were dancing they really need a janitor because the dinning area and the bathroom was dirty that was a turn off. {its always dirty cause employees are always messing around n been here 5 times} (they have ice cream/ pies/ cookies and other treats) cupcakes: I think the cupcakes are amazing their flavorful filling and perfect texturely my only complaint is sometimes they can be old but still really good a lil pricy but id come back just wish they would update the flavors cause some of them are not good like keep being creative just cause u one cupcake wars doesnt mean u stop<br>best things: crembrule/ blueberry cheesecake/ butter scotch/ peach cobbler/ apple pie<br><br>Blueberry cheesecake: amazing texturally really moist theres a lot of blueberry and the chrunchy bits taste good love the cream part of the cheesecake just put more on top would order again<br><br>Butter scotch: if u love sweet and salty youll love this. It wasnt to sweet and the salt made it taste better <br><br>White chocolate raspberry: wasnt my favorite had to much raspberry so way to acidic<br><br>Crembrule: this was the best cupcake I ever had in my life/ one of the best pastries I ever had. What makes it special is the crust it's supper moist and the top is really crispy without being burnt and the filling is so rich and the berries on top cut through the richness just was perfect <br><br>Peanut butter Nutella:it was good but wish it had more of a Nutella flavor with lil notes of peanut butter it was very peanut butter forward<br><br>Samoa: if u love coconut u will love this<br><br>Peach cobbler: really good loved all the whip cream just wish it had more of a cobbler spice<br><br>Apple pie: this was phenomenal the spice level was so good n love the whip cream like really tastes like an apple pie n love the frust on top for crunch just wish it was more of a crumble cause that tastes better n its less hard<br><br>Cake butter: this was gross tasted like a really bad pumpkin pie kinda just had to many spices hatted the filling", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/k65v_kJCWLBC6N7nOqNu-w/348s.jpg", "caption": "Peanut Butter Nutella"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/bklhNCkpzJI1rNXYyv8yvw/168s.jpg", "caption": "Samoa"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/3sKhf1lImbuFjOqdiuUQQA/168s.jpg", "caption": "Peach Cobbler"}]}}, {"review": {"des": "Molly's Has the best cupcakes. I frequent the Clark location for all special occasions- my favorite are the white chocolate raspberry, Cookie Monster, and the peach cobbler (honestly they're all good). What really prompted me to write a review was for my wedding. Instead of cupcakes, we decided to do a pink white chocolate raspberry cake and it was DELICIOUS. It was the most complimented part of our wedding and we couldn't have been happier with how it tasted and was decorated. We ordered a Full sheet and a round 12 inch to be cut for 120 guests and the slices were huge and we still had leftovers!<br><br>The delivery was also prompt and Molly's staff was really easy to work with.", "pics": null}}, {"review": {"des": "My two must haves are the creme brulee cupcake and the peach cobbler cupcake, which are two of the most popular flavors as well (for good reason)! The peach cobbler cupcake has a peach puree in the center, which is delicious. The cupcakes are really good, but pretty expensive for cupcakes...", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/qLXNghNDFHrkwFnQ-QnbiQ/348s.jpg", "caption": "Creme Brulee (left) & Peach Cobbler (right)"}]}}, {"review": {"des": "Where do I start?! :). Molly's Cupcakes is in the exciting Old Town neighborhood of Chicago. The location itself is very appealing to the eye. From the swinging chairs, to the colorful tables, to the board games. <br><br>As for the cupcakes....BEYOND AMAZING. They were moist and flavorful. I had the the Blueberry Cheesecake and every bite was just as good as the one before! <br><br>My family and I enjoyed our experience and most definitely will return when we are in the city!", "pics": null}}, {"review": {"des": "Yum, Best cupcakes! Love that they are open late. They have center filled and regular cupcakes. I'm usually a red velvet cupcake when it comes to the regular version, but the creme brulee is my all time favorite. I do like to try the other flavors and never been disappointed. <br><br>It's a cute place has \"swing\" seat set by the bar, tables and booths to sit and eat your cupcake and I saw they have board games to play. Water dispensers and extra sugary toppings to add to your cupcake is also available. <br><br>If I lived closer I would probably get a cupcake a day =)", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/tICSaGdmQAJRSS3Zhux4zw/348s.jpg", "caption": "cream brulee cupcake and peach cobbler cupcake"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/InY70nMRoa-KxzLJmkZdOw/168s.jpg", "caption": "cupcake variety!"}]}}, {"review": {"des": "We are planning on using Molly's Cupcakes for our wedding.  <br><br>A+ communication: it has been seamless the entire time.  For being an extremely busy business, they are extremely accessible either over the phone or through e-mail.  <br><br>A+ experience: we did tastings prior to deciding on which frosting/cake combinations we would have.  This was an impressive experience with generous portions (half a cupcake for each of the standard flavors, large portions of frosting, and two center-filled cupcakes to try!).  We were pretty set on having Molly's at our wedding but the wedding/events coordinator sealed the deal with us through this fun tasting sesion.<br><br>If you want to do larger orders, they are very accommodating with designs, flavor combinations/variety, and delivery or pick-up.  Highly recommended.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/UhH6Wl8QK-qUU409dW-ppQ/168s.jpg", "caption": "Cupcake tasting for a wedding order.  Fantastic!"}]}}, {"review": {"des": "This was on my list of must go places in Chicago as it was on food Network shows. The store itself is pretty cute and the flavors are definitely different and creative compare to other cupcake places.<br><br>I got the blueberry cheesecake stuffed cupcake and it was pretty good. I like that the cake is still pretty moist and the flavor spot on. I love the Graham cracker topped on it. It gives a balance to the cupcake. I do wish I had try other cupcakes that they had like the creme brulee or the Samoa, but I was too full from lunch.<br>  <br>The only critique I had was the price doesn't really justify the size. The cake is pretty small but costed +$4. <br><br>Overall, it's a good place to try, and if I'm ever craving for cupcakes, I would go here.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/7KVKY7J_DDPrOFig-dTHRw/168s.jpg", "caption": "Blueberry cheesecake"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/VAvD0J0rGEmrt0oB3bApcA/168s.jpg", "caption": "Cupcakes!!!!"}]}}, {"review": {"des": "BEST cupcakes that I've ever had in my life!!! This is the stuff my food dreams are made of, and I need to come back here when I visit Chicago again. <br><br>All of the cupcakes are so, so good: perfectly moist, not too sweet, and the center filling brings the whole cupcake together. I think I've tried all of the flavors from the gazillion times I've frequented this place, but my all time favorite is the creme brulee. The crisp glaze is so on point and perfectly reminiscent of creme brulee, and the center filling on this one really makes it the perfect creme brulee version of a cupcake!", "pics": null}}, {"review": {"des": "Great place for coffee and some sweet cupcakes. They have different kinds, seriously amazing choice. Recommend", "pics": null}}, {"review": {"des": "I've tried many famous cupcake shops across the country like Susiecakes, Sprinkles, Crumbs, Magnolia, etc. and even many of Molly's stuffed cupcakes...but my favorite cupcake in the world is their blueberry cheesecake cupcake. Nothing beats it.<br><br>Not sure if they still do this but they used to offer discounted \"ugly\" cupcakes for dine-in", "pics": null}}, {"review": {"des": "My favorite cupcakes for the longest time. So good that I get regular cravings for them. Have tried many flavors. Pass on the frosting (the kind used on their butterscotch cupcakes, etc). I like the cake part of their cupcakes the best. Frosting not good enough to warrant the calories.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/xNpslKpEfbbVab8om_NuIA/168s.jpg", "caption": "Key lime"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/umj5ZferQKjx25wxVPQT0A/168s.jpg", "caption": "One of my favorites"}]}}, {"review": {"des": "Simply amazing... i usually dont like sweet , but these cupcakes were amazing. I ordered 36 assorted filled cupcake for bday party in my office and everyone loved it ( good job to me to find this place :) )", "pics": null}}, {"review": {"des": "I've heard from far and wide and many people about these cupcakes and how they are the best cupcakes ever. I had very high hopes. I must say that from what I have tried, I was not as blown away as expected though. The cupcakes weren't bad, just not deserving of the hype.<br><br>ATMOSPHERE/ARCHITECTURE: 8/10<br><br>Pretty looking interior that is colorful and homey. It seats around 20-25 people in total. I did like that all the cupcakes and drinks were served in ceramic plates and cups, which was a nice touch to make it feel homier. <br><br>SERVICE : 7/10<br><br>Service was average. The cashier was nice and helpful.<br><br>FOOD: 8/10<br><br>I tried the tiramisu cupcake and the white chocolate raspberry cupcake.<br><br>Tiramisu Cupcake - Didn't really taste like tiramisu at all. It was just kind of a cupcake filled with some type of custard. I was actually pretty disappointed in this cupcake as I expected mini-tiramisu. I would not get this one again.<br><br>White Chocolate Raspberry Cupcake - This one was much better. The white chocolate interior along with the frosting went together very well. I'm sure their other cupcakes might be hits, but I had one hit and one miss.<br><br>Chai Tea Latte - Pretty standard. Nothing amazing or out of this world.<br><br>PROBABILITY OF RETURN: 7/10<br><br>I would definitely consider returning to try other flavors. I am sure there are some outstanding ones I may have missed out on, but I would hope that all the flavors would be well done. Overall it did not live up to the hype that people gave it in my opinion.<br><br>TO EAT OR NOT TO EAT: Worth a visit. Don't hype your expectations up too much though.<br><br>OVERALL: 7/10", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/MKiW0pplPvBLaWdf0DLGKQ/348s.jpg", "caption": "White Chocolate Raspberry Cupcake"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/DOAbbKtmvLxgzM0wTsdrNw/168s.jpg", "caption": "Chai Tea with Tiramisu and White Chocolate Raspberry Cupcakes"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/5yFFDQL1_pdDwo_17R4t3w/168s.jpg", "caption": "Tiramisu Cupcake"}]}}, {"review": {"des": "SERIOUSLY DELICIOUS- Best cupcakes in the area! The store is super cute and clean. Personally, the center filled cupcakes are my favorite, but they also have regular cupcakes and other treats available. Stop in to see what seasonal cupcakes they have!!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/bDA6cABVmdCa9d_8Ewvs0w/348s.jpg", "caption": "Top left: Cookie Monster. Top right: creme brûlée. Bottom left: cake batter"}]}}, {"review": {"des": "Nom nom yum yum good.. We walked in at 8 pm and the swings right near the checkout counter made me smile. I like funky and it was right up my alley. We got the chocolate decadence and the salted caramel. Really moist and soft..", "pics": null}}, {"review": {"des": "This place was great! It has a super cute set up and the cupcakes were delish! I got to try the funfetti cupcake as well as the cookie dough one. Both stole my heart! They were great, with the funfetti having a slight lead cause who doesn't love cake batter in the middle of their cupcake!", "pics": null}}, {"review": {"des": "Love these cupcakes! The lady at the counter were helpful in letting us know what the most popular flavors were. They were the Ron Bennington, Cake Batter, Cookie Monster and Raspberry and Cream for those that wanted to know.<br><br>We ended up getting those flavors and an additional Creme Brulee. Yum!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/zMJEdE5bvI2u43N84v-rxQ/168s.jpg", "caption": "That S'mores shot!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/vpUFAo5ko0YdKkyHeA9a_A/168s.jpg", "caption": "(From left to right, top to bottom) Creme Brulee, Raspberry & Cream, Cookie Monster, S'mores and Ron Bennington"}]}}, {"review": {"des": "Cute cupcake shop with fun seating at the bar area. Large selection of cupcakes and nice friendly customer service. Got the Cookie Monster cupcake and it was light and fluffy. The middle was filled with cookie dough and the frosting was good without being overly sweet. The cookie on top was a nice extra bonus. Also had a Rice Krispie treat which was good but could maybe use some more butter in the recipe. Flavor was lacking slightly.", "pics": null}}, {"review": {"des": "Most of the time the cupcakes are good. I've had them once or twice where they were a little dry but usually they are moist and soft. The have a really large selection  and we've tried just about all of them. My favorite is the Samoa cupcake. It taste just like the girl scout cookie!", "pics": null}}, {"review": {"des": "Without a doubt, Molly's Cupcakes are the best in Chicagoland, and some of the best cupcakes I have EVER tried. They are simply delicious!<br><br>You must try the cake batter filled cupcake. They will blow your mind. The cake melts in your mouth and the cake batter filling is to die for. My other all time flavor is cookie monster... I love the vibe in this place as well. It is welcoming and non-pretentious.The filled cupcakes are reasonably priced at $3.75 and you can order online. Highly recommend this place (even if it means driving an hour to get there!!)", "pics": null}}, {"review": {"des": "My favorite place to get cupcakes in Chicago (sorry Sprinkles). First and foremost, they're not too sweet and the flavor combinations are amazing. The creme brule and peach cobbler are two of my favorites, but I still have yet to try a cupcake there that I didn't like. The peach cobbler is vanilla cake, peach puree, brown sugar streusel, and homemade whipped cream. The whipped cream alone is reason enough to get this cupcake...so fluffy, light, and perfectly balanced with the sweetness of peach. My friend was raving about this cupcake for a week when I brought one to her.  Molly's is open until 10 pm during the week and midnight on Friday & Saturday, which makes it a great place to go for a low-key date.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/HJTPmDnOcvjtsRqfGwG0Bw/348s.jpg", "caption": "Creme brule and peach cobbler cupcake"}]}}, {"review": {"des": "Creme Brûlée cutting cake!<br>so we ordered a cutting cake and about 400 of our very favorite mini cupcakes.<br><br>The tasting was amazing. We opted for the small additional charge to have them delivered. Worth every penny! Our guests could not stop raving about the cupcakes and the delicious cutting cake.<br><br>The options are endless and the customer service was above and beyond!<br>Our wedding was on 5/27/18 and I was worried about the weather with it being almost 98 degrees. Cupcakes lasted great everything was phenomenal!", "pics": null}}, {"review": {"des": "Loved using Molly's for my graduation cake! It was delicious and my entire family loved it. Super easy with communication and pick up. It looked great with my simple design!", "pics": null}}, {"review": {"des": "Visiting from out of state and dropped in for a cupcake. Tried the white chocolate and raspberry. Just a little taste of heaven!!<br>Also love the seats at the coffee bar.", "pics": null}}, {"review": {"des": "This is my favorite cupcake place ever! Definitely try the Peach cobbler cupcake. It's my favorite flavor and it's the reason why Molly's won Cupcake Wars. It's a yellow cupcake filled with peach cobbler and topped with whipped cream, a sprinkle of cinnamon and sliced peaches. It's amazing! I've never had a bad cupcake here but that's definitely my favorite. If you like peanut butter, try the Ron Bennington.", "pics": null}}, {"review": {"des": "This places been my favorite place for cupcakes. There selection of donuts are ridiculous. Peanut butter Nutella, peach cobbler, key lime, classic vanilla, red velvet, chocolate with either cream cheese, buttercream, vanilla or chocolate frosting, they even put sprinkles on top of the classic cupcakes. There filling cupcakes are the must to get. I'm drawn to their deluxe cupcakes even though the classic are good too. Would come back here in a heart beat.", "pics": null}}, {"review": {"des": "Sweet tooth?! A quick stop to Molly's will definitely fix that! I stopped by on a Saturday afternoon with cravings of something sweet. It definitely took me a while to decide which cupcake to get, but luckily the staff was kind to help me decide. I went with what was the most popular. I got the peach cobbler and blueberry cheesecake, which came out to be $8.31, the average price of a quality cupcake. I grabbed a swing seat by the counter and the place was just absolutely relaxing. I loved the cute ambience while enjoying my cupcakes. I'll be sure to come back for more and definitely to try their coffee!!", "pics": null}}, {"review": {"des": "After our most recent wedding-related purchase with Molly's, we felt the need to publicly shower them with our gratitude and appreciation by upping their Yelp rating.<br><br>One of our favorite treats is Molly's creme-brulee center-filled cupcakes and we were ecstatic when we found out they now have wedding cakes. We began our wedding planning in September 2016 and the whole process with Molly's has been seamless. We booked a cake tasting in mid-September 2016 and we were immediately given a time slot the following week. Our cake tasting consisted of five classic Molly's cupcake flavors (vanilla, chocolate, red velvet, banana, and carrot) with all of their frosting options (vanilla, chocolate, cream cheese, brown butter, and buttercream). In addition, we were allowed to select two center-filled flavors to try. Needless to say, the creme-brulee flavor was a must-have but we also tried the blueberry cheesecake center-filled cupcake. I do not suggest having dinner prior to tasting because the portions were delightfully comparable to a meal. <br><br>During the tasting, our event coordinator was very careful to jot down notes and made meaningful inquiries to gauge our thoughts and plans. The whole process was about 30 minutes long. At the conclusion of the cake tasting, our event coordinator immediately emailed us the notes she had taken and followed up with the instructions should we decide to proceed with their service. I am big fan of their efficiency, especially since her notes were so thorough that I did not have to repeat myself. Therefore, within a week, we had confirmed the approximate number of guests, amount of cake we intend to book, deposit to secure the date, tentative delivery time, and design. <br><br>Fast forward ahead, in July 2017, Molly's sent us a check-in e-mail to inquire if we had any changes on our end, i.e. number of guests, wedding venue address and contact information, delivery times, etc. The fact that I did not have to take the initiative to follow up was a huge plus, considering how we had a ton of last-minute wedding plans to settle. It was a quick item to check off and without any further changes, we paid the remaining balance a month before our wedding.   <br><br>On our wedding day, Molly's deliverer was punctual to deliver both the wedding and sheet cakes well before our reception time. We did not have to fret about any last minute mishaps as the cakes arrived just as we had anticipated. When cake was served, our guests marveled about the selection, asked for seconds, and inquired of its origins. We briefly considered being selfish and withholding the information so we could have all the delicious cakes to ourselves, but of course, the best things in life (not calories) are meant to be shared. Let everyone have Molly's cupcakes!<br><br>P.S. The picture I have shared is the only one I have on hand. *fingers crossed* I'm hoping our photographer has a better version.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/eTf4Z_dIGGlMSuKTIYtI0w/348s.jpg", "caption": "September 2016 cake tasting"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/LwMrFdjl939CNhFgBIXZvg/168s.jpg", "caption": "September 2016 cake tasting"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/-Es0Qg7ZNKNhzQzoTEYAXg/168s.jpg", "caption": "September 2016 cake tasting"}]}}, {"review": {"des": "I've never craved cupcakes in my life, but Molly's is an exception. My favorite cupcakes are the creme brûlée and peach cobbler! Both are not too overly sweet. Best part about the creme brûlée cupcake is of course the vanilla bean custard inside and the caramelized sugar on top. The peach cobbler cupcake has a light, frothy whipped cream on top, paired with the delicate peach jam inside. <br><br>Definitely a must try in Chicago!", "pics": null}}, {"review": {"des": "OMG, the gluten free chocolate cupcake is devine! Absolutely heavenly...and I don't even like cupcakes all that much but tried this anyway because the employee said it was made with gf cake batter and then molten chocolate. Mmmmm. The thought of cake made me want it! SO glad I tried it. I will be back soon!! Love their story too. Buy a cupcake, help a local school!", "pics": null}}, {"review": {"des": "Best dessert in Chicago. Every cupcake is delicious. I literally get a different flavor every time I visit. They're open later on the weekends so it's great to hangout with cupcakes and board games.<br><br>I've also order for a party in the past. They have mini cupcakes which are the perfect size for events!", "pics": null}}, {"review": {"des": "Everyone kept talking about it so I had to tried them out! My friend and I walked here to take some back to LA with us. I ordered the creme brulee  and blueberry cheesecake to share with him. I ordered a few more for my sister and he for his brothers. Our siblings inhaled the cupcakes and all said they were really good: <br><br>This place was a treat to try :)", "pics": null}}, {"review": {"des": "So far this is the best tasting cupcake I ever had. Beautifully decorated and yummy! My favorite is the red velvet. Ive tried the blueberry this time and so tasty.   The have a cute store with swing as the chair.  The coffee is not bad. It goes well with their cupcake.  What would keep me from going here is parking. Hard to find parking, only street parking on busy street.", "pics": null}}, {"review": {"des": "Ordered 2 cupcakes. a chocolate one and a Nutella peanut butter one. Quite pleased with the outcome. You can look in the display case as you're making a decision. They also have an array of hot beverages. The cool thing is there swing chairs which are pretty popular.", "pics": null}}, {"review": {"des": "Tried these a while ago and forgot to write a review.   I think I forgot to write about it because they were unremarkable and we won't be back.  Went in with my tween and teen.  We love cupcakes and love to try different places. <br><br>The woman working was not the happiest or welcoming of cupcake mongers. In my opinion, anyone selling cupcakes should be happy!  You're surrounded by cupcakes.  Also, I felt like the place was kind of dark and industrial which is cool for a craft brewery, but for a cupcake shop is odd.  Unless you have Morticia Addams selling cupcakes, then, it's all good.<br><br>We got 4 cupcakes to take home.  I don't even remember what they were because none of them were great.  I do remember some were dry and some of the frostings were too sweet. My kids didn't like them either.  Their comments were, \"Meh\" and \"Your lemon meringue cupcakes are better than all of these.\"  <br><br>So, our search will continue for a great cupcake place.  So far we haven't found any that are excellent.  Most are edible, but none have been crave worthy yet.", "pics": null}}, {"review": {"des": "I'll choose Molly's cupcakes over Sprinkles any day! My favorite is the Peach Cobbler- has a whipped cream filling with a slice of peach on top. I've also had their large Rice Krispie squares and make your own cupcake (choose cupcake flavor base and frosting) of banana base with chocolate frosting!", "pics": null}}, {"review": {"des": "If you know me, you know how much I like Molly's cupcakes. Not much for me to say.<br><br>Get any cupcake ever and hangout with some board games. My personal favorites are the Creme Brûlée and the Samoa cupcakes. <br><br>Also, the staff is super pleasant. I got a free cupcake once because the icing was falling off. So yeah, all in all a very good cupcake.", "pics": null}}, {"review": {"des": "Visiting the Lincoln Park area of Chicago, I needed a birthday surprise, and this was it! I ordered by the piece so we could get a variety. It was a little pricey, but worth it. <br>The filled cupcakes were particularly wonderful, but even the non-filled were moist and delicious. Very rich, though, so beware of how many you order; we cut them in half to share. <br>I ordered and paid in advance, including a tip. The driver from GrubHub was about 15 minutes late, but Molly's was right on top of his delivery when I called. <br>Highly recommend.", "pics": null}}, {"review": {"des": "O. M. G. <br>Light fluffy and every icing and flavor was perfection!  We have the pumpkin spice, Samoa, and Peach cobbler.  Each cupcake has a distinct personality entirely different and precisely designed  with wonderful selection of ingredients. <br><br>These cupcakes are on fleek!  Haha.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ehVR5wcDukNxm4yr_mQpOg/348s.jpg", "caption": "Pumpkin spice cupcake.  I got it to go and my box shifted during transportation:/ But it still tasted DELICIOUS!  :-)"}]}}, {"review": {"des": "For almost two years, I've been eating a vegan diet. Imagine my delight and surprise to see that Molly's had not only one selection, but two - two!! - vegan cupcakes for me to enjoy.<br><br>They offered Vanilla and Chocolate. Not the most adventurous choices, obviously, but perfectly fine for me. I had one of each. They were delicious. I'd have them again, and be willing to try any other vegan variety Molly's cares to make.<br><br>Strict vegans should be aware that these vegan cupcakes are made where every other cupcake is made. If you need to have kosher-style rules for your vegan food, maybe you don't want come here. As for me, I will take the deliciousness any day.", "pics": null}}, {"review": {"des": "I came here on a Monday around 7:30pm with my date.  We had just gotten dinner and she suggested this place.  Since I hadn't been here before... I didn't hesitate to say, \"Yes!!\".<br><br>The interior is very inviting due to being well kept, clean, and colorful.  The employees were very kind and patient with me too especially considering I was having trouble figuring out what I wanted to get (there's so many visually appealing options).  <br><br>After deciding for so long and getting some more information on the popularity of some cupcake varieties, my date and I settled on cake batter, blueberry cheesecake, peach cobbler, and creme brulee.<br><br>First, let me share that this was my first time ever having high quality cupcakes.  All previous experiences with cupcakes had to do with them coming from grocery stores.  <br><br>These cupcakes are like individual pieces of art!  What was even better was that they truly did taste like the flavor they are labeled as AND they are very delicious.<br><br>Creme brulee actually had a nice sugar crust on top like a real creme brulee would have, the blueberry cheesecake had crust on top and filling with fresh blueberries that tied the flavor together, the cake batter tasted like cake batter from the cupcake piece (had delicious cake batter flavored filling too) whereas the icing elevated it to taste like a birthday cake, and lastly the peach cobbler had a fresh peach slice on top and a dollop of sweet and creamy icing and some cinnamon... gosh all were so good.  All of the cupcakes were moist too and tasted fresh.<br><br>My date and I just split each in half so we could share.  I'm glad we skipped dessert at the place we got dinner and came here because the entire experience was awesome.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/VvFqD5Yg3bKvzGgWbyu8KA/348s.jpg", "caption": "Creme brulee"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/YGBsQEdGcVJcancSay8vxw/168s.jpg", "caption": "Peach cobbler"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Ql-D1HgH53v8XmxNjtvVlw/168s.jpg", "caption": "Blueberry cheesecake"}]}}, {"review": {"des": "Hands down BEST CUPCAKES. I've tried Sprinkles and honestly, it's not that good compared to Molly's. Sprinkles is too hyped and not that good. Although better than most cupcakes you can get in bakeries from grocery stores, there a similar resemblance. <br><br>I've also tried Magnolia Bakery, however I think their best dessert there is their Banana Bread Pudding. Their cupcakes are overly sweet. Cupcakes are meant to be sweet, but the frosting was overwhelming sweet. I couldn't eat more than one bite. <br><br>I've been coming to Molly's Cupcake for around 3 years now. Their frosting isn't your average sweet and swirl frosting, rather they have marshmallows on top or frostings topped with cookies, crumbs, fruits, etc. The frostings aren't overwhelmingly sweet either. It's the perfect amount of sweetness. I love the wide variety of cupcakes they have. <br><br>My favorites are eclair (even though it's not a cupcake) and Creme Brûlée. .", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/XL0rGBzwkRmk41uUNHOj4w/168s.jpg", "caption": "Creme Brûlée"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/RxjwO4IXW3AIKLJ57ij0YA/168s.jpg", "caption": "Butterscotch Cream"}]}}, {"review": {"des": "I love these cupcakes! The shop smells amazing as soon as you walk in and your eyes go straight to the great variety of cupcakes displayed in the cases and counters. There's so many amazing flavors to choose from and I've yet to be disappointed by one! Yes, they taste as good as they look. I'm not vegan but I did notice they had some vegan cupcakes available which is neat! The shop is so cute and there's fun swings you can sit on. The staff is welcoming and friendly. Finding parking can be a challenge but it is worth a long walk! The price is a little high for a cupcake but worth a try.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/eFWJ5bY3N1weiE84YI-wkg/348s.jpg", "caption": "Chocolate and red velvet cupcakes"}]}}, {"review": {"des": "Maybe I'm a donut lover with no taste, but I don't get the hype. Are the staff awesome? Yes. Is the elementary school theme cute? Yes. Are the cupcakes beautiful? Absolutely. But... I just didn't love them. <br><br>--<br>Cookie Monster ($4.12)<br>Vanilla cake with cookie dough filling and vanilla/whipped buttercream frosting topped with mini chocolate chips and a mini cookie. The best component is the cookie dough, which is pretty good. There's just so little of it! I almost wish it was filled with a more whipped version of the cookie dough instead of the more authentic texture so it would add more moisture to the cake. I didn't love the frosting which just tasted like sugar, and the cookie on top tasted stale--no crunch at all. I also would have loved to see chocolate chips in the cupcake instead of sprinkled on top, to make the cupcake seem more like a cookie. For $4.12, this was disappointing. Maybe the other beautiful cupcakes are better--if I were to go back, I'd try Creme Brûlée!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/dHuShVaXeFx2YZAOZ6ksfg/348s.jpg", "caption": "Cookie Monster ($4.12, August 2016)"}]}}, {"review": {"des": "Adult tested +Fork Recommended for the Molten Chocolate Cupcake!<br><br>What is the Molten Chocolate Cupcake..according to Molly's web site it is:<br><br>\"FLOURLESS MOLTEN CHOCOLATE<br>Flourless chocolate cake, dulce de leche ganache  filling, french vanilla buttercream, chocolate drizzle.\"  I have to say the frosting was more like \"cool whip\" than french vanilla buttercream....still was delicious...<br><br>I picked up an assortment of cupcakes for a friend's informal birthday party...strawberry shortcake (they put the strawberry on after they take it out of the case), white raspberry, molten chocolate, and butterscotch.  Carefully boxed and packaged...was a bit disappointed that they did not have the Dulce de Leche cupcake...<br><br>FYI-Inquiring minds want to know who is Ron Bennington?", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/NC4gNfd0Rw7qvDX4eM1dMQ/348s.jpg", "caption": "Fork Recommended!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/xtSbcCNoea05zibRB6aqHg/168s.jpg", "caption": "Molten Chocolate Cupcake"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/CbUBQ672DIeSNSfyH-cMEw/168s.jpg", "caption": "Company verification that you are actually \"there!\""}]}}, {"review": {"des": "All I can say is these cupcakes is off the chain good. I don't know how they make a cupcake taste like a piece of heaven on earth. Delicious!", "pics": null}}, {"review": {"des": "I am not sure how I forgot to rate this place! This is one of my favorite cupcake shops in IL. I love the layout and design of the shop. I have had the latte from here and really like it. <br><br>All the cupcakes are great! I have had a few different ones and have never been disappointed. A really great shop in Lincoln Park that cannot be missed.", "pics": null}}, {"review": {"des": "I have to say I was really impressed by this place. More so the delicacy and taste of the cupcake. Never have I ever had one that almost perfectly balanced out sweetness and sponginess at once. This satisfied my sweet tooth and I would recommend the Creme Brûlée cupcake if you got the chance. I would definitely come back for a round 2 if I'm ever near a Molly's Cupcake.<br><br>This location in particular had good service.", "pics": null}}, {"review": {"des": "This place is definitely somewhere to bookmark when you're in the area. It is incredibly cute inside with many cupcake options! There are mini cupcakes, regular sized, and filled. I loved the mini cupcake, and my cousin also had a birthday cake made by them with a cake batter frosting in between the layers. It was very good!", "pics": null}}, {"review": {"des": "Wow. Just wow. Mollys cupcakes is legitimately the best cupcake place out there. It is so hard for me to resist this place when I am close by. Their cupcakes are all filled on the inside in the BEST way possible. They have a variety of cupcakes to choose from along with a few cookie options. My all time fave is the birthday cake cupcake. It's filled with cake batter on the inside and omg is it the best thing ever. <br><br>No need to try anything else-- that one is just perfect . I've had their coffee one time before and it's also pretty good-- the real winners are the sweets though. <br><br>We have ordered a cake from them for my birthday for the last two years and it's been a HUGE hit. It's expensive, but it's super tasty and it serves a ton of people. Your guests will thank you!!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Vgyz85WzQD4l6a0vIVuqyQ/348s.jpg", "caption": "Birthday cake cake-- the classic cupcake made into a cake!!"}]}}, {"review": {"des": "Love this neighborhood spot to grab a sweet treat with the kiddos! The flavors & names of the delicious cupcakes are so intriguing.  Two of the favorites of the family is the eclair & the crime brûlée flavors! Also a fun place to eat your one of a kind cupcake! Kids luv sitting on the swing chairs in the bakery & noshing on their sweet morsels of goodness!", "pics": null}}, {"review": {"des": "I love these cupcakes! Boston creme for the win! The store is super cute. Not much seating and the seating that is there is a tad bit jammed. I love the whole swing seat concept but trying to juggle a cupcake and coffee while on a swing is not the best idea. Their cupcakes are always decadent and moist. They have a verity of cupcakes to choose from. Def one of my favs!", "pics": null}}, {"review": {"des": "Great cupcakes! Super moist and have many options to choose from. Friendly service and even have a gluten free option! Highly recommend!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/9l_E6ZLjvV1sJvsT8x22tw/168s.jpg", "caption": "Inside of the peanut butter nutella."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/I8kXBs-BNedqJOh1RXsm6w/168s.jpg", "caption": "Delicious cupcakes!"}]}}, {"review": {"des": "The cutest little bakery ever! Wish the swings were open to enjoy our cupcakes on but no worries. Got the dark chocolate cupcake with peanut butter inside and butterfinger pieces on top. Omg amazing! So rich but just the right amount to feel good after still. The other cupcake pictured is the white chocolate raspberry cheesecake. Also superb. Want to go back and try everything else... hope they get a carrot cake in soon!", "pics": null}}, {"review": {"des": "Great service and even better cupcakes. You can't go wrong with anything that you order here. I've tried them all, including their chocolate covered Oreos. As seen on Food network, there is a reason they won cupcake wars!", "pics": null}}, {"review": {"des": "When I think of cupcakes, I think of generic grocery bought bulks of pastries, I bring to my team at work as a gesture of kindness. This place completely changed my whole mind set of the word cupcake.  If your seeking to fulfill your cupcake void in your life, this place is a must visit. THE HOLY GRAIL OF CUPCAKES in Chicago! <br><br>Cute interior, with warm colors create an inviting environment to sit back and enjoy a cup of coffee and pastry with some friends.  Table seating is limited so be comfortable with sharing a table with a few strangers while you scuff down your cupcake. <br><br>These are some of my favorite ones I tried: <br><br>S'mores cupcake: topped with a mini snack size Hershey on top. This cake is moist and gooey with marshmallow goodness inside sprinkled with graham cracker pieces on top.   <br><br>Birthday cake cupcake : Filled with cake batter bites inside. Need I say more. ( Absolutely my favorite ) <br><br>Peanut butter cupcake : if your love the combination of peanut butter and chocolate or if your human for that matter. This cupcake is a winner. ( Think Rees pieces in cake form ! ) <br><br>Individual cupcakes are under 4 dollars depending on the kind, they offer batches of them for discounted pricing.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/_3VgKGK3LySU14_a5C4hXw/168s.jpg", "caption": "Smores cupcake"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/zDGwBRf6WX2CW4TsC6S5fw/168s.jpg", "caption": "Smores cupcake and birthday cake"}]}}, {"review": {"des": "Sinful is the word! Love their red velvet and the chocolate. One of the few places that make mini cupcakes and each bite is like a bloom of heaven", "pics": null}}, {"review": {"des": "I'm (not) sorry, but as I stated a decade ago these cupcakes are vastly overrated! It had been that long since I last had them and decided to give them another try after several people asked me about them. Keeping in mind that I have tried all the major cupcake places in Chicago, Molly's does not rank in my top 5. If you are the type that likes a filled cupcake, ie stuffed with some flavor in the cake, then you'll appreciate these. A true cupcake enthusiast will recognize that the cake should be able to stand on its own without being stuffed. And while Molly's does offer both, it's clear they pride themselves in the stuffed versions. As for flavors in still not convinced that their red velvet is a true red velvet. I could not detect the presence of chocolate in it. It seemed like it was a yellow cake that had been died red. If there is any chocolate in it then it is very little because the color is most definitely off (not a deep red, rather a marginal red). Overall these tasted at a level slightly above store bought cupcakes. There really wasn't anything particular about them that told me why they've been voted as one of the best cupcakes in the country. I can argue against that. One of the things I recall from my first tasting of them remains true these years later, they're a bit oily. I was still getting some on my fingers. As for cake flavors they are very limited: chocolate, vanilla and red velvet. There were a few other flavors for the specialty (stuffed) cupcakes, but again, it's all about the basics and there wasn't anything beyond the aforementioned.The frosting flavors are more varied. All in all I have about five other cupcake locations I'd go to before going to Molly's. They have better selections, better quality, use better ingredients and have more flavor in their cakes.", "pics": null}}, {"review": {"des": "This place is the perfect end of date dessert spot. There are a ton of great dinner places up in Lincoln park but almost every time I am up there I go for a cupcake. They are nicely decorated but don't let that fool you; the emphasis is on making them taste great. <br>Most recently I had a Samoa cupcake which was full of wonderful nostalgia. If you had Samoa cookies from the girl scouts growing up this cupcake will take you right back to those carefree times. I also love the ron bennington because dark chocolate and peanut butter speaks to my soul. <br>Go on a date and play board games, go to get a pick me up after a long day, go get a bunch when you have guests in town, go go go!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/nqDfqXAbo9KpdknueLAkMQ/168s.jpg", "caption": "Peachy treat"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/7ePFWmyc0_ZGGnhlvR2b9g/168s.jpg", "caption": "Samoa cupcake"}]}}, {"review": {"des": "Wow what a nice place to hang out and enjoy the most delicious and moist fancy cupcakes in Chicago.   I was so surprised to see how the owner had such an ingenious creation to add swings to the table so you can have memories of your childhood.  The place has everything to enjoy your sweet tooth from teas to coffees and sprinkles and fancy sugars and plenty water .  The walls are decorated with nice things that remind you of good times and trust me I have had many many cups cakes all over Chicagoland and of course my neighborhood Dupage county.  Molly's to me are the best cupcakes  because you on most you get a surprise and delicious filling.  They are not too sweet NOR exaggerated with artificial colors or dyes.  This are legit darn delicious .   Too bad I had stuff myself with an entire full meal before because I would have tasted every single flavor they have.   They have tons to choose from.   I know you will have the flavor you would  love.   Wait I don't think they have my most favorite flavor which is maple  but not with bacon.  Which I gave them a hint\"hint hint\".  I had a wonderful time and I really loved the cup cake definitely a 5 star  place great for kids and for those grown ups that are sill kids", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/jh9dhvl1Bwbj_3IcrP8X-g/168s.jpg", "caption": "Deliciousness"}]}}, {"review": {"des": "These cupcakes are so amazing. Everytime I have them they are so incredibly moist. You need to go for the filled cupcakes. My personal favorites are the cookie monster and the cake batter, filled with cookie dough and vanilla cake batter respectively. They absolutely stuff the cupcakes with filling. They are seriously amazing. They also have very good tea, so if you have the time enjoy the warm atmosphere and sit to eat your cupcake with tea.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/g_sdroZK0p4J6iOAs--uHg/348s.jpg", "caption": "So good had to order two"}]}}, {"review": {"des": "Living in a small agricultural town in Wisconsin, I don't get to visit many high-end, upscale, or fancy bakeries or restaurants so when we came to Chicago that was a priority for me, and this place definitely delivered on my expectations. One thing I wanted was an instagramable dessert so after looking around I choose this place, also because I am an avid baker and wanted to see how professionals do things. It was awesome getting to see into the kitchen and the selection of cupcakes was amazing. We had a group of four so we all got different cupcakes to try as many as we could. My favorite was the Cookie Monster, but blueberry cheesecake deserves some much-needed love too.<br><br>The only thing I would mark down on would be the price, almost $4 for one cupcake is pretty extreme when you have a large group. That's not to say the price isn't worth it, but it's not somewhere I would go to buy a bunch of cupcakes for a party, just as a little snack.", "pics": null}}, {"review": {"des": "We recently used Molly's Cupcakes as the primary dessert at our wedding, and couldn't be happier with how everything went.<br><br>My now-husband and I wanted to do a cupcake tower with multiple flavors of cupcakes and a small round cake to accommodate a cute cake topper (more my desire than his). We did tastings as several bakeries in Chicago, and Molly's was a clear winner. Not only are their cupcakes delicious and their variety of options plentiful, they were also super accommodating of any changes we wanted to make. For example, I wanted their salted caramel butterscotch cupcake to be made with chocolate cake, minus the butterscotch filling, and with more saltiness on top (essentially turning it into a chocolate salted caramel cupcake). They said \"no problem\" when we placed the order, and on the wedding day, they delivered exactly what I asked for and it was phenomenal.<br><br>I also provided a photo of what we wanted the round cake to look like, and they got it just right.<br><br>Everything about working with Molly's was easy, from setting up the tasting, to determining what we wanted to order, to changing our delivery time (when our caterer requested that dessert get there earlier than initially planned), to delivering on the final product. Everything was just as delicious on the big day as it was at our tasting, and several guests commented to us on how good dessert was.<br><br>I cannot recommend Molly's enough for wedding service, and we will definitely be doing additional business with them in the future (there are still birthdays and anniversaries to be had!).", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/1ebX4X3bHecHOHxReO6sHQ/168s.jpg", "caption": "Molly's Cupcakes at our wedding."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/EnPaD9-lnNZnpQOJ8p1R7w/168s.jpg", "caption": "Despite doing a cupcake tower, we had to have an actual cake to house our cute topper!"}]}}, {"review": {"des": "I was torn between the Girl Scout cookie samoa cupcake and the peach cobbler cupcake. My eye was drawn to the cobbler. I asked the girl working which she recommended and she said the cobbler because it won cupcake wars. <br><br>Let it be known that the boy was loathe to even stop in here on our arduous 18 minute walk home. I was told I did not require a cupcake. (Yes I did). He waited outside 2 minutes before begrudgingly coming inside and sulking with hands in pockets. <br>He did not help me decide on which heavenly cupcake I would go home with. Useless. <br><br>I proceeded to get my peach cobbler cuppycake to-go since I would not enjoy eating it there with king of sulk around! <br><br>I then had to explain to the boy what cupcake wars was on the way home. He was curious. <br><br>I did not share my cupcake with him. I promptly put it in the fridge as I was advised to by the helpful employee however. <br><br>I ate half of it the next morning with a fork. It was AMAZING. The frosting tasted au naturale and I didn't realize the middle would be stuffed with a peachy refreshing jelly thing. <br><br>I ate the other half in a differing sitting. The peach on top of the frosting was good too. No picture. Sorry. In mah belly", "pics": null}}, {"review": {"des": "Wow, the hype is real at Molly's Cupcakes. They have a tons of awesome flavors and I will absolutely come back to try more of the flavors! So far I've only tried one flavor, but will update this review when I've tried more.<br><br>Peach Cobbler: This is an AMAZING flavor, I highly highly recommend getting this flavor. The taste is identical to a peach cobbler pie. The cupcake is so incredibly moist that it almost practically falls apart which in a plus in my opinion. I love moist cupcakes. The cake itself is flavored as well as having a peach filling, so delicious!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Qq_7oDLdE2yIvN8wEt6KDg/348s.jpg", "caption": "Peach Cobbler"}]}}, {"review": {"des": "This place is cupcakes meets my childhood memories!! So why I should start with the cupcakes, I think the setting is just so amazing. Let's talk about the music of the nineties the lunch boxes swings for stools and board games in the corner with the plants classification of middle school days on the wall. In short, nostalgia.<br><br>So the cupcakes -- there's a variety of flavors most of them are filled with some creamy goodness and then there are some that are plane with tasty frosting. We got there kind of late so they were out of a few favorites  - opted for butterscotch caramel and Tiramisu. The cake was super moist and very rich. A good way to indulge and you could even split the cupcake if you just need a taste of goodness.<br><br>In the rotation of top 5 cupcake shops that I've had in Chicago.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/5hynizFzF5vIC5Ro4m3qAg/168s.jpg", "caption": "Tiramisu"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/FiODoCHnr3PNUBzQyxxk1w/168s.jpg", "caption": "Butterscotch caramel cupcake"}]}}, {"review": {"des": "Wedding planning is not for everyone... and when I was planning my wedding in 2017, I discovered that everything that can go wrong, will go wrong. My (now) husband and I had a whole destination wedding planned that ended up falling through last minute and instead, we ended up getting married in our home town, Chicago. Faced with last minute scrambling to get a ceremony venue, reception venue, officiant, invitations, and everything else I think it goes without saying that I was in full panic mode. This full 180 of our wedding plans included a new need for a cake which brings me to this review! <br><br>Since we had loved Molly's cupcakes for years, we thought we would just look into whether they would entertain the idea of making a wedding cake. THEY DID! So, in an effort to give a fair review, I've listed our pro's and con's below.<br><br>THE POSITIVES:<br><br>1. We got to do a complimentary tasting with one of the bakers. Plus, they threw in an extra free cupcake before we left. Yum!<br><br>2. The cake was incredibly delicious, all our guests raved about it and it was very moist and heavy (more similar to brownie texture than cake texture). We went with cookie monster flavor on the base layer, and chocolate on the top layer. BEST DECISIONS EVER!<br><br>3. The cake was delivered on time, by the head chef, and they agreed to use our personalized cake topper. They were also willing to use our cake plate which we just dropped off at the Lincoln Park location the month before our wedding. And, they included a side of chocolate ganache, cut strawberries, and mini chocolate chip cookies to be served with our cake at the reception.<br><br>4. The cake was ENORMOUS. They give you the width of the cake when you order it but we had no idea how tall it would be. We had a very small wedding with only 25 people in attendance so we ordered a 2 tier cake and it was WAY too much. Which was wonderful, we ended up with lots of left overs!!!<br><br>5. It was very reasonably priced!<br><br>THE NEGATIVES:<br><br>1. The emailing communication wasn't the best. Every time I reached out I got an auto message a few hours later saying they would get back to me ASAP which got annoying after a while since I would get excited thinking I got a response. I wish they had given us a specific baker's email so that we could avoid the headache. <br><br>2. All the meetings and tastings are at the Lincoln Park location and the parking is a NIGHTMARE. We ended up missing the first tasting appointment because we were driving around looking for a parking spot for OVER AN HOUR. Moral of the story: skip the car, take the train. <br><br>3. If you decide you want to taste test a seasonal flavor and it's not currently that season, you have to order an entire batch of cupcakes. We wanted to try tiramisu and pumpkin spice since we were getting married in October but they said we had to order and pay for a batch of them to taste them since we were there to try them in August and it wasn't Fall yet. Ultimately, we ended up biting the bullet and ordering the tiramisu ones which were pretty expensive. <br><br>4. They cannot do fondant. This is obviously a biased negative but for someone who was really hoping for a quilted fondant cake this was pretty disappointing. At the time, they were only offering a brown sugar frosting, regular frosting, or buttercream. We went with buttercream and it looked very crisp and clean. We also had them do draped sugar pearls and frosted flowers. It turned out pretty but not exactly what we had in mind. If you decide to go with a design, I recommend keeping it simple since they don't have as much experience with decorating. <br><br>OVERALL:<br><br>Definitely worth checking out if you're in the market for a simple cake that packs a lot of flavor. We are glad we used Molly's for our wedding cake and we love that we can stop in anytime for a cupcake in our wedding cake flavor!", "pics": null}}, {"review": {"des": "We ended 4/19 'What the What' Wednesday with a trip to Molly's Cupcakes. This place never disappoints and offers more than just cupcakes. <br><br>The Ron Bennington is a chocolate cupcake with peanut butter filling, topped with chocolate icing, Heath Bar pieces, and butterscotch. The flavor combinations were scrumptious, and although I do not like butterscotch, I can't imagine this cupcake without it!!<br><br>The Boston Cream is a vanilla cupcake with cream filling, dark chocolate frosting, and white chocolate shavings. This classic, while simple in execution, is extraordinary in cupcake form!<br><br>What I enjoy most about the cupcakes is the ratio of build to bite. There is just enough of everything to get the perfect bite in every bite. <br><br>We also tried one of their large Peanut Butter cookies. It had a lot of texture from the peanut pieces and was still soft and chewy when I warmed it up in the oven. :)<br><br>I also had a Mini Red Velvet cupcake with buttercream frosting as a birthday surprise: adorable and tasty. I do not like cream cheese frosting and was delighted to find out I could customize my own cupcake. <br><br>The last treat was an Oreo covered in white chocolate with a drizzle of chocolate. The other option was an Oreo covered in chocolate with a drizzle of white chocolate, showcasing again that there is something for everyone. <br><br>Going to Molly's cupcakes was an excellent choice for dessert!<br><br>----------------------<br>5/4/17<br><br>Strawberry Shortcake- a delicious cupcake,but the frosting was too rich and heavy as a topping. <br><br>Ron Bennington-fabulous as always!<br><br>Samoa- I dislike the girl scout cookie, but this cupcake is a light balance of the classic: coconut/chocolate/caramel/graham cracker<br><br>Peach Cobbler- my favorite combination of cupcake, filling, and frosting. Whatever frosting this is- I want it on all my cupcakes in the future because it's light and fluffy. <br><br>Oatmeal Raisin cookie- delicious and chewy.<br><br>Peanut Butter cookie- warmed up, it's a bite of heaven.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Y-2bfUJn27g7Y1_pNIp_cg/348s.jpg", "caption": "Classic RB: Chocolate with Peanut Butter center."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/FN0LI8TZQ7o5jXH1GfjFUA/168s.jpg", "caption": "Creamy tart center matched sugary meringue topping"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/fW0uyiuqAE7Pcv6t4tcMlw/168s.jpg", "caption": "Lemon Meringue: super tart with fluffy meringue"}]}}, {"review": {"des": "They're good - but they're kind of small for the price.  The tastes don't always come through that much - like blueberry cheesecake wasn't too different than the plain yellow cake. Just a little.  The cookie dough also wasn't really that much like cookie dough above and beyond the cake itself.  I think part of the problem is that they're small and very light / airy... so there's not like this dense heavy layer of cream cheese or cookie dough.  Plus, they're gone in about 2 seconds & you wonder - did I just eat a whole cupcake?  If you call ahead, you can get the larger size  & those might taste more like the flavor because there's just more of the ingredient in there.  They're more expensive.<br><br>The other desserts they have look REALLY good but I can't  imagine what the calories would be in those, so I'm afraid to try.  They just look so good in the case (cream pies and stuff like that - not on the regular menu).", "pics": null}}, {"review": {"des": "Delicious cupcakes. They are cute! Nice to-go box. Busy line but goes fast. Cash required when under certain amount. Seemed a little rushed but still nice experience overall. I will be back.", "pics": null}}, {"review": {"des": "Maybe I don't like cupcakes or something, but I wasn't really a fan.  We were considering doing Molly's cupcakes for our wedding so we decided to stop by and try a few before making a choice.  We decided to try their samosa, white chocolate raspberry, blueberry cheesecake, and peach cobbler.  The cupcakes look beautiful but I through that the actual cupcake tasted like cornbread and in general they were very sweet.", "pics": null}}, {"review": {"des": "Very delicious cupcakes and Mini French Silk pies. This is in a review from several weeks past when I was still living and working in Chicago. Unfortunately, I will miss this one place since I am no longer living there. I am surprised they stood the test of time in a competitive economy in Chicago but that is good. Anyways they have plenty of tasty and unusual flavor of cupcakes. I had the Creme Bruelee cupcake that really tasted like Creme Bruelee. If you also order the Mini French Silk pie do pay for it in advance to reserve it! They sell out very quickly since the Mini French Silk Pie is their Best seller there. It is good I can pay in advance to reserve it. It is good their business is getting a good reputation since they are even opening one somewhere in the state of Ohio and suburban Naperville, IL as well. Hopefully when I get time going back to Chicago to check up my residence I will stop buy to order something. You will be missed since I am not working and living in St Paul/Minneapolis, MN. :[", "pics": null}}, {"review": {"des": "Dear Molly:<br><br>I used to live in Chicago for many years and raved about your cupcakes to everyone I knew. All of our visitors craving cake or cupcakes were taken to your cute shop for a bite and they were never disappointed. The flavor combinations you have are unmatched, particularly: Creme Brûlée, Peanut Butter Nutella, Boston Creme, Minty Mash Up, Mixed Berry, Blueberry Cheesecake, and Cookie Monster. I prefer your cupcakes with filling over the classic ones because they have more flavor and texture. I am a true sweet tooth and have tried cupcakes all over the US, and yours are in my top 3. <br><br>So...I'm writing this out of sheer desperation. You see, my partner and I relocated to California and I have been trying to fill my cupcake fix everywhere in Northern Cali-and each time I have left very disappointed. I even tried a cupcake competitor in San Fran who won The Cupcake Wars but hers were nothing like your cupcakes and were very expensive. We have asked family in Chicago to Fed Ex us your cupcakes periodically and they always oblige. Although they arrive mashed in the mail, they are STILL soft, moist, delicious and satisfying!! <br><br>Would you consider opening a branch of your store  in Sacramento (our new city) where the rent is fairly affordable, or even San Fran where people make LOTS of money and you would probably make a killing on your cupcakes and other pastries? We have friends and coworkers who need to know how good a Chicago-style cupcake is and you would have many customers! We will make sure of it!<br><br>We need you! Until then...we are awaiting our next Molly's cupcake shipment in the mail. <br><br>Your Loyal Customer,<br><br>Amy", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/GYTboZmmzEaSbVcyn98IFQ/168s.jpg", "caption": "Aren't they gorgeous? Shy's \"carry-on\" from Chicago to Sacramento!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/01txebkomZtrSztL3oc93A/168s.jpg", "caption": "Fed Ex was not kind...and they were still delicious!!"}]}}, {"review": {"des": "Friends and colleagues have been hyping up the deliciousness of Molly's Cupcakes..... I disagree.<br><br>2.5 stars for mediocre, over-priced cupcakes and below average (stand-offish) customer service.", "pics": null}}, {"review": {"des": "Super moist fresh cupcakes, what more can you ask for? Every time I come they're always making fresh new batches of cupcakes. As I was watching them burn the crust with a tourch on all those créme brûleè cupcakes before my very eyes, I was truly mesmerized and hypnotized.<br>Very hard working and loyal employees.<br><br>They always run out of their top selling cupcake (créme brûleé). You can order it before you get there though! <br>They've got a big selection and all their other cupcakes are worth trying as well. Every single one of them is F.O.K (fresh out the kitchen. And yes I just made that word up lol!)<br><br>They've got some cute little swings on the side that you can sit on and sip your coffee while your munching on their moist cupcakes!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/A1rwDFADFxQUcn83z16bmA/168s.jpg", "caption": "Yum yummm and YUMMM!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/50sDROOxd8Au5y3q0VY-jg/168s.jpg", "caption": "Yum yummm and YUMMM!"}]}}, {"review": {"des": "Love, love, love, love this place!! <br><br>I don't like too many cupcake places but this is by far the best one I have ever been to. <br><br>My go to cupcakes are the center-filled ones. I love the creme brulee, the blueberry cheesecake, and cookie monster. I am also in love with their red velvet. The red velvet is not too sweet and I feel that most places the frosting is so overwhelming but at Molly's it is done perfectly. My boyfriend is a huge fan of the peach cobbler. <br><br>It can be on the pricier side for cupcakes but I am from out of town so it's worth it every once in awhile.<br><br>I gave it a four star because I have been in and there have been times when my favorite cupcake would be sold out and being from out of town I really looked forward to it. That does however show that it's quite a popular place. Parking can also be a pain but that's anywhere in Chicago.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/pwEl0PwWomyFLscyz0tA4w/348s.jpg", "caption": "creme brulee"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/SX_72AYTdDuOoHBFK3gHdA/168s.jpg", "caption": "the peach cobbler"}]}}, {"review": {"des": "Molly's Cupcakes is what dreams are made of. A swing in the middle of the shop, a plethora of games to play, and the most delicious display case. <br><br>Molly's is something special for multiple reasons:<br><br>1. Nothing is overly sweet, just authentic to the flavor profiles they state on their menu board. <br><br>2. Every cupcake has a FILLING. Molly's has seriously spoiled me because now I feel incomplete if I even try to eat a cupcake that doesn't have a filling!!<br><br>3. They provide something for everyone wth their 20+ flavors. My personal favorites are the Cookie Monster, Ron Bennington and Boston Cream. Close runner-ups are the Choco-cino and Eclair. <br><br>4. My favorite part though? Molly was the owner's 3rd grade teacher. Isn't that amazing to have such a big impact on a child's life? As a teacher myself, I can only hope I'm filling those same shoes (and that a student opens up a cupcake shop after me ;)<br><br>The only downfall is parking. Lakeview is crowded (a given), so parking can be monstrous at any point throughout the day. It's semi-close to the Diversey Brown Line if you're on the CTA though :)", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/EMneb85npaXbjdjhxmeh7g/348s.jpg", "caption": "Mini cupcakes! Birthday cake (top), peach cobbler and Nutella PB!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/9fU0xa_i54oc3y7CQqJK2w/168s.jpg", "caption": "Samoa cupcake: 5 stars"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/SonRJbAnVjxx4xl6SsWIUQ/168s.jpg", "caption": "Cookie Monster cupcake cross-section"}]}}, {"review": {"des": "Let me start by saying I do not eat cupcakes, never really have, just not my thing... with one caveat. Molly's Cupcakes I'll have any day of the week. They are $3.75 and worth every penny!  Anytime we visit Chicago we try to stop by and order a dozen to take home.  Our favorites are crème brûlée and blueberry cheesecake. You cannot go wrong with either one of those. Enjoy!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/wHazkNVF5YYLgg6a_VV7LQ/168s.jpg", "caption": "Crème brûlée"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/W1Wb32u8nfU3tA7ZlI8gSQ/168s.jpg", "caption": "Blueberry Cheesecake"}]}}, {"review": {"des": "I had Molly's cupcakes catered for my wedding for a party of 100. It was GREAT! Kristine who helped my husband and I, was super accommodating, friendly, and patient with my constant alterations in my order. We had an order of red velvet, peach cobbler, boston creme, and cookie dough. It was a HUGE hit! Everyone loved the cupcakes and kept asking where I got it from. I told them MOLLY'S! Thank you Molly's cupcakes for making our wedding day a lil bit sweeter.", "pics": null}}, {"review": {"des": "Yall are smoking crack with this one. <br><br>The WORST cupcakes I've ever had, their customer service is non-existent.<br><br> I'm not quite sure if it was just an off day but every cupcake I tried was horrible. Now, understand that I only have a cheat meal once in a while due to health issues.  So, I was eager to try a 4 pack with my girlfriend. The chocolate cupcake had absolutely no flavor to the cupcake and the icing had too much sugar like all I tasted was sugar and couldn't thought the brown color came from food coloring cause it sure as hell didn't come from chocolate. The lack of balance threw me off and I just threw that cupcake away. If you know anything about me, you know that CHOCOLATE IS MY LIFE. That might have been the single most dramatic moment in my life.<br><br> The cookies And cream cupcake which is something everyone talks about was ridiculously baaaaadd. All I could taste was the overwhelming vanilla extracts. The alcohol extract coated my tongue and sterilized it. I was so shocked, they need to check the cameras cause I am guessing the bakers have a thing going on and got in on back there and knocked over an entire bottle of vanilla extract because that is the only explanation I am willing to accept. <br><br> I was surprised to see that the employees were not behind the counter a but sitting talking and playing on their ipad. Like, ok, I am here standing at the counter just eyeraping the food... totally don't want to buy anything.<br><br>I decided that I was gonna take this as an opportunity to help them improve customer service and quality and wrote in to recommend that they change or at least taste test their own product once in a while and a year later come as still not have a heard a word from them. It's a little sad that a company that so well known as 0 customer care or relations. I guess they are too busy playing on their ipads to actually answer.", "pics": null}}, {"review": {"des": "My favorite cupcakes in Chicago or possibly anywhere.  You know how cupcakes can be sickeningly sweet?  These aren't like that- even the frosting!  They have tons of different options- some of my favorite include the creme brûlée and the apple pie.  Most of the ones if not all in the display case have creme fillings but you can also make your own cupcake and choose your cake base and frosting and toppings!  They have about four swing seats at the bar which are highly coveted and limited table seating as well.  As for beverages they have an assortment of teas and coffees as well as milk!  I would definitely make a stop here and grab a dozen cupcakes and share them.  They are so popular that over the years they moved into different cities like Iowa city and nyc.  Move aside sprinkles!!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/hh7VCRb1Cg6D5kbjeSuScA/348s.jpg", "caption": "Creme brûlée and apple pie!"}]}}, {"review": {"des": "It's really good and to die for!!! I'll come back to Chicago anytime just for the chocolate cupcakes! It's way different from the other bakeries cakes I tried ... I love anything with chocolates and traveled from West to East but so far this is the my favorite one !!", "pics": null}}, {"review": {"des": "I walked into this shop with high hopes and a positive attitude. This review is also in regards to the salty blonde working behind the counter. Midday on a Thursday, snowing and around 24 degrees outside. Instead of getting a warm welcome, as soon as I walked into the shop I was berated by the blonde telling me \"no dogs allowed in the shop\". The dog that she was so worried about was a 5 pound yorkie who was quietly sticking her head out of my purse! When I informed her that my dog was a service animal she quickly shifted gears on the no dog policy and then continued to rush me and my party to order...there were maybe two other customers in the shop who were already sitting down eating, so it's not like we were holding up the line. <br><br>As far as the cupcakes..$4 per cupcake for basic cupcakes that taste no different than store-bought cupcakes. The bad vibes I received inside could not be cured by any of the cupcakes I bought. <br><br>Regardless of the service, it's a gimmick, definitely not worth $4 per treat.", "pics": null}}, {"review": {"des": "Stopped by for an after dinner treat. Ahh Ma Zing!!! You must try the crème brûlée cupcake, it was out of this world! The carrot cake was delicious as well and the rice crispy square was enormous. Great little place to sit and relax and enjoy some amazing sweet treats. The staff was incredibly friendly and told us next time to try the Samoa. Before heading back to Milwaukee I will make sure I stop back again to try that cupcake!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/S4FzB6lc6h-bPUysaTUWUQ/348s.jpg", "caption": "The enormous rice crispy square."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/InQLSubBn5dJ3HAdLReR8w/168s.jpg", "caption": "Inside the crème brûlée cupcake"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/cK32gqCU_y_a9QfIa7s8hQ/168s.jpg", "caption": "On the left is the crème brûlée cupcake and on the right is the carrot cake cupcake."}]}}, {"review": {"des": "I love this cupcake place. The white chocolate rasberry and chocolate decadence are my favorite paired with the coffee. I enjoy having the minis too sometimes.. they are perfect for a quick bite.. the red velvet with cream cheese frosting is a favorite in the minis. For cream cheese fans, you can ask for another side of frosting. :) This place is kid friendly, my kid loves to run around here and there are some books which we can read to her and family board games for older kids.", "pics": null}}, {"review": {"des": "Delicious!  They have a lot of flavors to choose from and they are always packed.  Like line-out-the-door packed.  Their employees are super friendly and the decor is really cute.  There isn't a lot of places to sit--so more than likely you can't even enjoy your cupcakes there.  The only not-so-great comment is that the cupcakes are pretty pricey.  Overall,  a great place to try out!", "pics": null}}, {"review": {"des": "ABSOLUTELY AMAZING. All that I can say is how amazing these cupcakes are! The restaurant itself was very cute and welcoming and the cupcake display was so beautiful! The selection was immense and that's a good thing but a bad thing because I could eat all of them! I had the Samoa, red velvet, chocolate, and extra chocolate decadence! The frosting was so tasty, not too sweet, and not too bland! This was a wonderful experience!", "pics": null}}, {"review": {"des": "I would say this falls in the 3.5 stars category as the cupcakes are good, but not great, and very (very) expensive. <br><br>We tried the peach cobbler (won cupcake wars!), cookie monster, blueberry cheesecake, and creme brulee cupcakes at the Iowa City and Lincoln Park locations. All of the filled cupcakes are $3.75 each so after tax you're paying $4 a cupcake. They are also quite small.<br><br>All of them were quite good except the cookie monster which was unmemorable. The cupcakes were all moist, flavorful, and not overly sweet. The fillings inside provided a nice twist. However, they are not good enough to be worth $4 each. <br><br>Overall, I would say that if you really enjoy cupcakes and don't mind the price, this is the place for you!", "pics": null}}, {"review": {"des": "The filled cupcakes are something very special! They are very moist but hold together without falling apart in your hands. They're decadent without being overly sweet or heavy. I'm able to eat about 3 and still feel ok. Crepe brûlée is the absolute best. My favorite cupcake of any place in Chicago because it's so unique. It had so much texture and dimension for a cupcake. Second favorite is the raspberry and then the chocolate decadent. Please do not get anything but the filled cupcakes if you really want to experience what Molly's has to offer. On the flip side, I wasn't a fan of all the flavors they had to offer. They can be a little hit and miss. But the staff are so friendly and they have gender neutral bathrooms.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/E8E6fgMxS0yEHSGyX1Y2bA/348s.jpg", "caption": "A dozen cupcakes"}]}}, {"review": {"des": "These are so meh. They are dry and really sweet. I bought 12 different ones and just did not find anything inspiring about these cupcakes. They're very overpriced for not being amazing.", "pics": null}}, {"review": {"des": "Cupcakes aren't my thing but i tried them never the less. I got the one with peanut butter in it. It was good but I'm not sure what else to say. Take my review with a grain of salt cause I don't like up cupcakes to begin with", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/W5pcHAPX2AX_R-4k73YB3g/348s.jpg", "caption": "Forgot the names"}]}}]}