{"name": "mollys-cupcakes-chicago-3", "reviews": [{"review": {"des": "Dear Creme Brûlée Cupcake,<br><br>Thank you for allowing me to indulge in your creamy, sweet, moist and decadent flavor. From the moment I laid my eyes on you, I knew you were the one. S'mores, Chocolate Mousse and Cookie Monster all tried to get my attention, but I only wanted you. <br><br>It's so cliche to say it was love at first sight so I will tell you that with you it was love at first bite. I am not exaggerating when I say I was catapulted into the heavens when I had my first taste. I could not control myself around you. The next bite was always better than the last. <br><br>Now here we are. You are gone, and I'm here all alone. Missing you and counting the days until I can have you again. You are truly the best cupcake I ever had, and no that is not something I say to all the cupcakes. <br><br>Stay Sweet! <br><br>Signed,<br><br>A Lovestruck Yelper", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/7nQLpm2AJyC6kdeBbaJcJg/168s.jpg", "caption": "Cute Packaging"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/_3UcwIMoIJMzAD5px9_7sQ/168s.jpg", "caption": "Chocolate Mousse, Creme Brûlée, S'Mores, Cookie Monster"}]}}, {"review": {"des": "I stumbled across Molly's while I was walking from pinstripes to the theater. I saw the sign and instantly knew I had to go inside because I've heard nothing but amazing things about these little delicious babies. I like to call things like this... food fate. <br>First things first, this. place. is. so. cute. It has little swings that hang down from the ceiling with rope where you can sit and enjoy your desserts. There's a counter with assorted sprinkle shakers that you can add to your sweets for free. The display case of all the yummy treats they have actually looks fake it's so pristine and perfect. I wish I could have ordered them all but I restrained myself.. reluctantly. <br>I ended up choosing the S'mores cupcake and I apologized to my fiancé after the first bite because I knew that I was not going to share. It was SO good. The cake itself was moist and perfectly sweet without being too sweet. It had a rich chocolatey center I wished lasted longer. And how could I forget that perfectly toasted marshmallow topping, with a little Hershey bar to top it all off. Basically a s'mores explosion in your mouth. I also stole a bite of the peanut butter Nutella cupcake my fiancé got. I don't even necessarily like Nutella and I would have stolen that cupcake when he wasn't looking. Molly's made me a very happy chick.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/S8FE3a-4QlhfjsvaX-M03w/168s.jpg", "caption": "Top: peanut butter nutella Bottom: s'mores"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/YeOXltRJq_r7DOBzE3VsIw/168s.jpg", "caption": "Complimentary sprinkles"}]}}, {"review": {"des": "This review is Rated SSC..strong sensual contact. I made love to a cupcake today. Not just any cupcake, but Mollys cookie dough cupcake. I should have taken a naughty photo of this cupcake's creamy cookie dough curves,but I'm not sharing. I'm a gentleman.<br><br> When I first laid my eyes on..well...we' ll call her Creamy, I knew I was gonna have her. She was kinda shy on the way home, even fell over in the box while on Lake Shore Drive, but I scooped her up and assured her that she was in good hands. Once we arrived home..i treated her with the respect she deserved by taking her out the box..slowly unwrapping her cupcake paper...and doing things to her that I can't describe on Yelp.<br><br> Mmm..the succulent taste. I fell in love with a cupcake on out first date. Some may call her a thot, but I don't care. Love knows no rules.<br><br>I wish she stayed closer, so I wouldn't have to cheat on her with the McRib, but that's life.", "pics": null}}, {"review": {"des": "Wow! This time I tried the Cookie Monster and the Samoa and I have to say these were absolute game changers. Molly, I'm bumping you to 5 stars. If you are a cookie dough lover, you have to get the Cookie Monster! The middle is filled with raw cookie dough. Yes. Cookie dough inside a cupcake! It's freakin dessert Inception. The Samoa cupcake melted my heart because first of all, Samoa is the best Girl Scout cookie hands down. Second of all, the Samoa cupcake does a perfect job incorporating those flavors. Ughhh now I need to try ever flavor they have!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/jM_C2DJZhZyg7pGerxd1ag/168s.jpg", "caption": "Samoa and Cookie Monster"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/LYKts9Nz_n8KGo3UM-6q_Q/168s.jpg", "caption": "Peach cobbler $3.75"}]}}, {"review": {"des": "I thought that I had grown tired of eating cupcakes, but the Peach Cobbler Cupcake at Molly's changed my mind. This is their winning cupcake from Cupcake Wars and it definitely lived up to expectations. The cake is wonderfully moist and was topped with fresh whipped cream that was not overly sweet. With each bite, you could taste a hint of cinnamon and the peach on top added just the right amount of juiciness. I've tried several other flavors of cupcakes but I seem to find myself going back to the Peach Cobbler.<br><br>The creme brulee cupcake is also incredibly popular here and rightfully so; however, I would highly recommend trying the Peach Cobbler. You won't be disappointed.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/NmmorsbOZ_YWhsgZVKvRbQ/348s.jpg", "caption": "Peach Cobbler Cupcake: SO GOOD"}]}}, {"review": {"des": "When it comes to cupcakes this place makes the best I've ever eaten. Both of the cupcakes i had were extremely moist with a great filling in both. The cupcakes are pricey at almost 4 bucks a piece but well worth the price. They have a huge selection of different flavors to choose from.<br><br>The service was good and the dining room has plenty of room to find a table to eat at. If your in the area I highly recommend trying this place when you have a sweet tooth.", "pics": null}}, {"review": {"des": "It's been a long time since I've indulged in a cupcake. I'll be honest I prefer Asian baked goods mainly because they seem to use less sugar than American baked goods. Cupcakes are no different. I have a huge issue with frosting in most bakeries because they're just cloyingly sweet. Molly's Cupcakes pleasantly surprised me with their cupcakes and I was so glad that we dropped in for an afternoon treat during a walk. <br><br>My husband ordered their Carrot Cake with cream cheese frosting and I ordered their Peach Cobble Cupcake (vanilla cake, cinnamon peach puree, brown sugar streusel, homemade whipped cream, sliced peach). The carrot cake was very good! It was baked properly and had the right amount of flavor. However found that their cream cheese frosting was a tad too sour for my preference. Their Peach Cobbler cupcake was fantastic! I loved the cinnamon peach filling and I'm so glad that they went with whipped cream instead of frosting. It wasn't sweet and it was the perfect addition to this cupcake. <br><br>We enjoyed our afternoon snack here and from the looks of it so did a ton of other people. They also have a ton of board games so feel free to come with some friends. Oh, and they also serve Intelligentsia Coffee! What else could you want? 4/5", "pics": null}}, {"review": {"des": "Still my favorite cupcakes in the city. My favorite is the creme brulee with the caramelized sugar on top and the custard in the middle. The berries on top are always fresh. My second favorite is the cake batter. The blue frosting is a bit much for me, but the gooey cake batter is so yummy. <br><br>They are open late so it's perfect for dessert after dinner and they seem to have an endless supply of cupcakes. Street parking is difficult, FYI.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/vX_6eIewmA-EdBV078nBIg/168s.jpg", "caption": "Creme Brulee"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/tLPePt3zXYHsv0attaC-aw/168s.jpg", "caption": "Smores"}]}}, {"review": {"des": "I used this location for delivery to my work. I had a HORRIBLE experience with the delivery service. To make a long story short, I emailed them what happened and sent pictures of 90% of the cupcakes ruined when they got to my work. I never heard a response back and they still charged me for the tip even though I said I absolutely did not want to tip the driver. DO NOT USE THIS LOCATION FOR DELIVERY. It may be okay to stop in for tourists but if you actually live in the city don't waste your time. Go to the Clark street location. This location is franchised so it doesn't have anything to do with the original location - go to that one!! After the lack of response, having the staff accuse me of \"not being available, the delivery service, and smashed cupcakes I would never go back to this location. Whoever runs this place clearly does not care about their customers. <br><br>A little more about the story if you're interested:<br><br>The driver said he was at my location and called with no answer. I did leave specific delivery instructions that included checking in with security, suite number, etc. I gave receptions number because there is always someone there so a call would never be missed just in case. I received a call from the store saying the driver returned saying I wasn't there. I told them I never received any calls nor did reception and I still want the order. They sent someone out (they use a third party delivery service I think) I walked away from my desk for 1 min, came back to 2 missed calls. I called the store - no answer, called the other number that presumed was the driver and he said he was on his way and he was told I was \"hard to get ahold of.\" <br><br>He shows up, the cupcakes are all smashed and they were very late. I sent an email to this location explaining what had happened. Our phones show every single call and these ones that this driver said took place never did! It was funny, not sure if it was the same driver that dropped off the cupcakes or if it was someone new, but they had no problem getting to our floor to make the delivery.", "pics": null}}, {"review": {"des": "A local friend knows I have a sweet tooth and recommended a few dessert places to look out for when I visited Chicago. Molly's is one of them. After a stroll from Navy Pier, we stopped by this place for some Scooby snacks. <br><br>The swing seating make that place look fun. They have a good variety of cupcakes and some pies. They all look delicious and I want to try them all. We got 3 cupcakes (peach cobbler, strawberry shortcake, chocolate mousse) and a pecan pie. The cupcakes had cream filling in the center. I like the peach cobbler the most. The price is a bit steep so I give them a 4. But they do have good moist cupcakes.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/XHL7fFvM3c_u-siBSEYytA/348s.jpg", "caption": "cupcakes for winners"}]}}, {"review": {"des": "Still, so good!<br><br>Apple butter: 5<br>Chocolate salted caramel: 4.5<br>Favorite of all - chocolate peanut butter: 5+<br>Intelligentsia coffee is still served. <br><br>Ambiance is uplifting and fun, even. Service is great. This location is more spacious than that in Lincoln Park.", "pics": null}}, {"review": {"des": "I feel like you can't really go wrong with Molly's Cupcakes! They are always so yummy. <br>My favorite one is creme brulee!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/CV47xNwEj0HN5y4C0fRaJA/348s.jpg", "caption": "creme brulee"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/y7t0TbexlTzEt66FrKip3g/168s.jpg", "caption": "Peanut butter Nutella"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/cZW9ydzR-cWZOZP8KhOafw/168s.jpg", "caption": "Samoa"}]}}, {"review": {"des": "OMG this place is amazing. We got the peanut butter Nutella, Boston cream, and peach cobbler cupcakes and shared them. Everything was amazing, but we ranked Nutella as the best - the cupcake had the texture of a peanut butter cookie. Second was Boston cream (this is good for a chocolate lover) and peach cobbler was third (still delicious, but I'm a chocolate girl). <br><br>The line moved very quickly and the people were friendly and helpful as we decided what to order. They have a fun atmosphere with swings to sit on and sprinkles out for you to add to your cupcake if you want. Plus they have a water jug out, which is nice since the foods so sweet. They do have other beverages to buy like coffee and tea, but we stuck with the cupcakes (priorities!). We'll definitely come back here!", "pics": null}}, {"review": {"des": "freaking best cupcakes. this is what dreams are made of. <br><br>have to try::::: creme brûlée cupcakes!!", "pics": null}}, {"review": {"des": "Peach Cobbler Cupcake: 5 out of 5 Stars<br><br>The peach cobbler cupcake was amazing! The cake's consistency is fluffy and airy like clouds. Cupcakes often get overbaked and are too dry but this was nice and moist. At the same time though, when you pulled off the liner, the cupcake still held its shape. The homemade icing was lighter, a strategic choice since the filling and the peach on top had sweeter notes. Together, the cake, filling, and toppings went together brilliantly. Each component balancing out the other, yet not overpowering one another for pure amazingness. Best cupcake that I've had, hands down.<br><br>The store itself is also super cute. There are swing chairs next to a marble bar counter where you can enjoy your marvelous treat.<br><br>Will definitely be coming back to try out their other flavors like creme brulee and blueberry cheesecake.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/yu3vOLcgOqaETtjDueRcRA/348s.jpg", "caption": "Peach Cobbler"}]}}, {"review": {"des": "This really is my favorite cupcake place in the city. Service is always stellar, selections are always seasonally appropriate and delightful and even though the location is tourist/streeterville central, it's easy to get to.<br><br>A little on the pricey side: 25.00 for 6 cupcakes. At the end of the day, if you are wanting a fun, once in a while treat, the price is worth it.", "pics": null}}, {"review": {"des": "Although we stay in the burbs we ever so often make the drive into Downtown  Chicago when we have friends / family visiting and wanting to explore the city. During one such walks from Navy Pier to Michigan Ave we stumbled upon Mollys.<br><br>I was immediately struck by the cute interiors especially the wooden swings suspended from the ceiling. Sweet! The place also has thislong wooden table surrounded by metal chairs should you decide to show up with a gang. Board games, books - perfect for that cafe feel. But what good will a place be if it didn't have food to boast? And believe me these guyz have it spot on in that area as well.<br><br>We tried the Creme Brulee cupcake which turned out to be my favorite. It has a custard filling which is a nice surprise when you spoon into that cake. We also had the Smores cupcake, delicious.. chocolaty and topped with melty marshmallow. The Eclair was just how it was supposed to be, a delectable creamy eclair but in the form of a cupcake.<br><br>Their entrance has stickers of several awards they won and after eating here, it is clear why. So the next time am in Downtown, I know where am headed.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/YTchCLWbbUr4VYDuG-ExxQ/168s.jpg", "caption": "How nice are the interiors"}]}}, {"review": {"des": "If you are visiting the Navy Pier or staying near it and are craving something sweet, Molly's Cupcakes will hit the spot. While on the way to the Pier, i decided to check out this place. First thing first, they share the entrance with a dental clinic and the place is not wheelchair accessible. I had to take my toddler out of the stroller and leave the stroller on the side (of the entrance) and walk up a few stairs. Was pleasantly surprised to see the interior and plenty of seating area. Since usually cupcake shops are tiny with hardly any seating space. <br><br>We ordered two cupcakes. The woman  behind the counter was very helpful and friendly. I got a chocolate cupcake (love anything with chocolate) and my son got a cake batter cupcake. Decided to sit and eat, as it can get messy with kids. The cupcakes were served in plastic plates, which I appreciated since paper plates are flimsy. There were plenty of utensils on the side, plus water (and cups). The best part for the kids was seeing extra sprinkles on the side. I mean, which kid doesn't love sprinkles. They had a variety of 5 different ones, which my toddler enjoyed.<br><br>The icing to the cake ratio was perfect, the icing was sweet but at the same time not too sweet. I also liked that the cupcake had filling in it, otherwise I find the cupcakes to be too dry sometimes. I tried my son's cake batter cupcake and eventhough I'm not a fan of cake batter, his cupcake was delicious too. <br><br>Really enjoyed the cupcakes after a walk to the Pier. Thumbs up for the friendly service and cleanliness.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/CBhWypd3yZqY66sXcCFm-A/348s.jpg", "caption": "Menu @Molly's Cupcakes"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/AA0Mp69MBj5DefxJOQ68NQ/168s.jpg", "caption": "Molly's Cupcakes"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/_n1Sg2lJUES5Om3fIOhF7A/168s.jpg", "caption": "The entrance @ Molly's Cupcakes"}]}}, {"review": {"des": "Molly's is highly rated so I was thrilled there was a nearby location to me. If you are by Navy Pier this location is definitely in walking distance. <br><br>The shop itself is very clean and friendly looking. We were cracking up since it is next to a dentist office.<br><br>I tried a few of their mini cupcakes to try an assortment of cake and frosting flavors. I found their frosting to be very over powering. I didn't enjoy the flavor of any of my cupcakes. Overall I don't really get what the hype is about but maybe Molly's just isn't for me.", "pics": null}}, {"review": {"des": "After having dinner and cocktails at a nearby restaurant, I stopped in to pick up one of their great cupcakes to take home with me.  This shop is in the heart of Streeterville - located in the River East building.  <br><br>The shoppe has a very cool vibe with a great display case front and center.  There is a large menu hanging from the ceiling listing all of their various cupcakes, cookies and other goodies including drinks.  There is a wall of windows for the natural light and to watch the world go by.  There are various sizes of tables and like their other shoppes, the have \"hanging chairs\" in front of the counter. <br><br>After reviewing the menu, I had ordered the Raspberry and Creme cupcake.  Within couple of minutes, I had received my order to go as requested.  The counter person was friendly.  <br><br>I had devoured the cupcake as soon as I got home.  The cupcake was moist and excellent.  <br><br>I would highly recommend Molly's Cupcakes!   Looking forward to another cupcake.", "pics": null}}, {"review": {"des": "The people behind the counter are so rude and disrespectful and their prices of things fluctuate way too often to have more than 1 shop. <br><br>I am never coming back here because the owner is also very passive aggressive. I can see why they hire the type of employees they do.", "pics": null}}, {"review": {"des": "My friend and I actually stumbled on Molly's by chance - we were on our way to Navy Pier and some really good advertising (\"Winner of Cupcake Wars\", \"Food Channel\") caught our eye. We hadn't done too much research on dessert places in Chicago, and the signs looked good enough, so we headed on inside.<br><br>- S'mores: this looked really interesting, because it was graham cracker cake, chocolate filling, and marshmallow on top as a kind of icing. It was a very interesting cupcake! The cake definitely felt like they did something to it... I can't pinpoint it, but I guess that's the \"graham cracker\" portion of the cake coming into play? The cake wasn't your typical cupcake batter, as it felt more grainy and textured, I guess resembling that graham cracker. The chocolate filling was great, and the marshmallow top was light. All the combinations made for a cupcake that earned its title as s'mores, that's for sure!<br><br>There is some seating space inside, and it's a quaint little place. If they can bring s'mores to a cupcake in this fashion, I would definitely like to try some of their other flavours to see what kind of unique cupcake twist they give them!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/mflDyJOmUrOLkL3566LKEQ/348s.jpg", "caption": "Left: Cookies n Cream. Right: S'mores"}]}}, {"review": {"des": "Best cupcakes I've ever had! <br><br>On a whim we stopped into Molly's for the first time on a Friday night. We weren't in the mood for dinner, so we wanted a light dessert instead. We saw the sign for Molly's and walked right in.<br><br>I love how spacious the space is! There's plenty of seating (chairs and swings) so you can enjoy your coffee and cupcake in peace. The tables by the window have such a great view of the city as well! <br><br>Employees were happy to help us narrow down which cupcakes we should try as well. The s'mores cupcake included a toasted marshmallow on top, as well as a Hershey chocolate piece. I'm a sucker for anything s'mores so I knew Molly's would soon have a piece of my heart the second I saw that cupcake! My boyfriend chose the Cookies and Creme, which included chocolate cake and a cookies and cream filled center. <br><br>Both options were heavenly! We ended up stopping in on our way back to Michigan just to get a few more cupcakes for the road! I only wish you could get them delivered to your home if you live out of state!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/04YkG3Gr63gA9rDPfzc26w/348s.jpg", "caption": "S'Mores and Cookies and Cream cupcake"}]}}, {"review": {"des": "Amazing cupcakes, flavor is bomb and not too heavy. Free water is awesome especially with sugary items. Must stop by. Literally saw cupcakes and went for it, no regrets.", "pics": null}}, {"review": {"des": "Ordered the flourless chocolate cupcake, mini carrot cake with CC frosting and the Boston Cream. <br>Wish I could have tried more but we are talking about cupcakes here! The flourless chocolate one was good but strong, so highly suggest splitting in two portions or getting a glass of milk to go with it.<br>The CC frosting was very good, but they could hold back a little bit of the lemon so it doesnt compete with the carrot. The Boston cream looked and tasted amazing. Look forward to going back and trying the Creme Brulee and others!", "pics": null}}, {"review": {"des": "I haven't been to the physical store, but I had a dozen of the \"stuffed\" cupcakes delivered to me. They were SO delicious that I definitely need bigger pants! I really enjoyed that their frosting wasn't too sweet which allowed it to balance with the filling and the cake. <br><br>You really can't go wrong with any of the flavors, because they're all delicious. I'm a bigger fan of a vanilla based cupcake, and the smores one stole my heart with the graham cracker cake! <br><br>Minus one star because when I transferred the cupcakes to an air-tight container, but they dried up within 24 hours. I was definitely disappointed, because I was hoping they would have lasted a few days. <br><br>I browsed their website, and it looks like they have a \"make your own station\" - which I definitely want to visit!", "pics": null}}, {"review": {"des": "This is gonna be quick...<br>Amazing latte <br>Amazing Blueberry Cheesecake cupcake<br>Amazing Boston Creme cupcake<br>Super Amazing service with a smile<br><br>If you're in the area, you had better stop in!", "pics": null}}, {"review": {"des": "Really really wish I can give a 5 stars but I can't..<br><br>Stumbled upon this place today with my daughter after a birthday party at pinstripe (next door to Molly's)<br><br>Since my two oldest kids had to stay at home, I figure I should bring cupcakes to kinda bribe them so they won't hate me for leaving them behind for a birthday party.<br><br>The place was huge! I can see a couple tables. The ambiance was amazing. A plus because I love a huge space, it makes me feel at home.<br><br>There were tons of cupcake flavors and my daughter chose 5. Raspberry something, cheesecake, creme brulle, vanilla with pink frosting (Don't know what it's called) and a custom choco cupcakes with gummy bears (yes you read this right! GUMMY BEARS)<br><br>Price was not bad. I mean it's cupcake plus I wouldn't mind spending a little extra for my kids because I will most likely get to lick the frosting.<br><br>The service was not bad. It was not the nicest.  It feels like they want to get rid of us so bad. Being there the first time, I just want to take a look at the menu and the person behind the counter was rushing us so bad.<br><br>The taste. For me, the frosting was way too sweet. At least the white vanilla frosting. The creme brulle and cheesecake were good.<br><br>To sum it up.<br><br>One star for the creme brulee <br>One star for the cupcake flavor variations<br>One star for the place/ambiance <br>One star for the price", "pics": null}}, {"review": {"des": "Is it just me or did I miss scoping out the display case for the cupcakes that have filling in them? The last 3 times I've had Molly's they did not offer cupcakes with filling. Maybe I just have to stop going in the evening, idk. The size has decreased dramatically since they originally opened on Clark. Don't get me wrong, I still like Molly's but sorry, my love for these cupcakes just isn't the same. I do love what they did with this new location staying true to the school themed motif, swinging counter chairs, and inviting board games. <br><br>Here are my top 3 favorite cupcakes in order. <br>-Chocolate Decadence- chocolate ganache filled. I don't believe they offer this anymore? Why?! Please make a come back!  <br><br>-The Ron Bennington- peanut-butter center.  <br><br>-Strawberry Shortcake- vanilla center. Seasonal. <br><br>Overall glad to see Molly's expand through out the years! Def a solid cupcake.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/eYbSUNpKc6j8S-u1aIky-A/168s.jpg", "caption": "Blueberry Cheesecake Cupcake"}]}}, {"review": {"des": "I've always had major love for Molly's. I used to live around the corner from the LP location, and then moved downtown so I was very excited when they opened this second location! Every flavor of cupcake I've tried has been delicious (and I've tried almost all of them) so I don't think you can go wrong. As others have noted, it's a little expensive but worth it.<br><br>This time around, I grabbed a dozen minis to go for a friend's dinner party. To make it easy, I went with a random assortment of vanilla, chocolate, red velvet,  and carrot cake all with buttercream frosting. A definite hit at the party - they were all demolished in no time flat. <br><br>If you're not taking to go, there's a variety of seating and tables inside - including the coveted swing seats up at the counter. In addition, they have board games if you want to hang for awhile. So fun!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Qwx8oL43IooRgGQm_-AB4w/168s.jpg", "caption": "A dozen assorted minis to go"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/J8y812GaI_he7zyV-Zv1EA/168s.jpg", "caption": "Inside"}]}}, {"review": {"des": "This place won Cupcake Wars on Food Network for a reason! Everything in the case looked absolutely amazing. Sadly, none of their pre-made cupcakes are vegan; however you can build your own cupcake and make it vegan. Both their vanilla and chocolate bases are vegan, and their vanilla and chocolate frostings are both vegan as well. I think their only vegan topping is Oreos, but fortunately I love Oreos so I was a happy camper. The taste and texture of the cupcake was wonderful. I savored every bite!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/T71arSiXf5LchOTF-vfhqQ/348s.jpg", "caption": "Build-your-own cupcake. Vanilla base, chocolate frosting, and Oreo topping (all vegan)"}]}}, {"review": {"des": "Ordered: <br>-Blueberry Cheesecake Cupcake<br>-Jasmine green tea<br><br>The middle of the cupcake was filled with cheesecake and topped with fresh blueberries and broken pieces of sweet crispy graham cracker crust. The cake itself was super moist and not overly sweet. This was definitely a perfect match with the jasmine green tea. The jasmine tea was very aromatic. I've ordered jasmine tea at other places and found that the jasmine scent is strongest here. So if you love jasmine tea and moist cupcakes, this is the place for you!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/WFrsHFLA_Ung45Tn8owBtQ/348s.jpg", "caption": "Jasmine green tea"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/fFhwUcSZqWQG624UzAbAbw/168s.jpg", "caption": "Blueberry cheesecake"}]}}, {"review": {"des": "I was craving some late night sweets and Molly's was one of the only places open late. Glad I walked in because as a cookie enthusiast, I loved the Cookie Monster cupcake! It was topped with a cookie and plenty of chocolate chips and the best part was that it's filled with yummy cookie dough, as told to us by a kind employee. He really walked me through all the flavors they had available and I was sad that they were out of the creme brûlée flavor because that sounds amazing. If I'm ever back in Chi Town, I'll be at Molly's to try the other flavors! These cupcakes taste like they're truly made with love, as much as I love Sprinkles. The interior of this spot is so cute too.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/VdIq6J7_35wihGNFj94Sbg/348s.jpg", "caption": "Swings to sit on in store"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/9PHc7LK17KkXT2n4BQF_mA/168s.jpg", "caption": "Cookie Monster"}]}}, {"review": {"des": "UGH amazing amazing amazing cupcakes. I love cupcakes and I can hands down say this is the best place in Chicago. Reasonable prices and such creative flavors! <br>Every cupcake tastes so great and the stuffed cupcakes are the best. Birthday cake has cake batter (probably my favorite), the creme bulee has custard etc etc. <br>some other awesome flavors are: s'mores, cookie dough, the strawberry shortcake. <br>I can't think of a single person who wouldn't like Molly's!!!! Here's a picture I got as a birthday gift for someone", "pics": null}}, {"review": {"des": "Creme brulee cupcakes are arguably the best cupcake ever created! Perfectly carmelized and hardened sugar top over a vanilla cupcake and vanilla creme,  where have you been all my life?!? They have multiple flavors but also allow you to create your own.  I love that they have 2 sizes,  regular and mini.", "pics": null}}, {"review": {"des": "The cupcakes are incredible!! I recommend trying the peach cobbler its delicious and the creme brulee!! The blueberry, Apple cinnamon and Eclair are good but not as good as the ones I recommend  The staff is friendly and helpful!!", "pics": null}}, {"review": {"des": "They have have some bomb cupcakes. I have had <br>Many cupcakes but never this good. The cupcakes I had were: birthday cake cupcake, Oreo cupcake, Cookie Monster cupcake. These cupcakes have filling inside them which are amazing. There also have a build you own cupcake  which my sister had and it was delicious too. The cup cakes are a big size for the price that they cost which makes them really affordable. They also take recommendations for new cupcakes which is a great idea letting consumers come up with new cupcakes. Ohh and did i mention you can charge you phone while you eat great cupcakes. My experience there was amazing", "pics": null}}, {"review": {"des": "This place is a joke!  So I order 3 Khalua and Cream cupcakes for My Boyfriend's Birthday.  I go to 411 E Illinois to pick them up after 10am.<br>I go in the guy behind the counter asked if I am picking up.  I replied yes and he hands me a bag with about 20-25 cupcakes in it.  And hands me a receipt. So I leave and look at the receipt the first name was mine but the debit card and amount wasn't so I brought the cupcakes back.  The guy behind the counter says I will get yours.  Never told me anything.  I get to my boyfriends house and give him the cupcakes and they weren't what I ordered.  Tried to email Molly's directly and they said I placed the order through Grubhub.  No I went to Molly's Cupcakes website.  The person Chanel the so called GM at Molly's has done nothing to resolve this.  Good Riddance.  First and Last Time Ordering!", "pics": null}}, {"review": {"des": "Aghhh these are amazing! After walking around Navy Pier we stumbled upon this place because we saw the Cupcake Wars Winner sticker in the window. I love that show! And boy now I understand why they won. These cupcakes are SO light and moist. And at under $4 a cupcake, a great deal too. Good thing we don't live in the area or I'd get fat on these cupcakes.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ZDbt0eRbwES8hmAZzmCjkw/168s.jpg", "caption": "Cookies and Cream cupcake and Dark Chocolate with Buttercream and Oreos cupcake"}]}}, {"review": {"des": "Love Love Love this place! 5/5 service, 5/5 ambience, 5/5 cupcakes!!! The place is quite spacious and has these cute swings you can sit on while enjoying your cupcake. They also have some books around if you want to spend some more time there.<br><br>Now, onto the cupcake...WOW. Every single time the cupcakes have been perfectly moist and the filling well balanced with the cake. Frostings are light and refreshing. I have brought many visits here and have converted to Molly's fans. Some of my friends have even taken a bunch of these back across the country for their friends to try. <br><br>These are my cupcakes in order of favs- <br>1. Peach cobbler- a must have if you like peach! The cake is moist but not soggy and the cream so light. The peach cobbler filling is not too sweat and perfect balanced <br>1. Cream Brule- omgggg the caramelized top is don't perfectly <br>1. Carrot cake- a must have if u like carrot cakes. Not oily and great texture <br>2. Red velvet- cake is baked evenly, frosting is heavenly<br>2. Blueberry cheesecake - a little heavier with a cream filling but a perfect blend between a cheesecake and cupcake <br>2. Cake batter- never thought a cake batter could taste so good! Don't underestimate this! <br>3. S'more- very rich cupcake with a rich chocolate filling <br><br>Enjoy! Can't wait to try more flavors", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/dZSi9M5GttOkyNSt2xFNOw/168s.jpg", "caption": "S'more cupcake"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/5JNKsOZDFeW8oXNebAIb9w/168s.jpg", "caption": "So many choices!!!"}]}}, {"review": {"des": "I am a huge fan of Cupcake Wars, so when I walked in and told me I was very excited! I tried their \"winning\" peach clobber cupcake and was not disappointed! <br><br>The store itself was super cute with swings, a collection of old lunchboxes and lockers", "pics": null}}, {"review": {"des": "I love cupcakes and I am always looking to try new places when I travel. I have to admit this place is the best so far. The cupcakes from this place are absolutely amazing!! The service is a bit slow for the amount of business they have. That could use improvement but the cupcakes are fresh, delicious. I am in town for a couple of days and I plan to go everyday to try a different one. Today I tried the birthday cake and creme brûlée cupcakes.", "pics": null}}, {"review": {"des": "On my way out of the brand new Carson's ribs  location near Navy Pier I saw the illuminated sign for Molly's Cupcakes it was about 9 p.m. or close to 9 and me and my daughter ran down the street as fast as we could before my husband couldn't say no  we cannot patronize the business<br> when we went inside it was music blaring filled with people still at this time of night 3 or 4 people on the swings that was located near the register 10 to 15 people in line already and various people sitting in the tables and drawing their Delicacies my daughter and I've had never been there before so we are lost on what selection and because they were $4 each the specialty cupcakes<br> we really wanted to make a good choice because $4 is really expensive for a cupcake and if you make a $4 mistake you're going to be very pissed off end up being the birthday cake a red velvet cupcake and my husband got him like a lemon blueberry cupcake and a winner of cup of course was my husband cupcake who really didn't even care about having one but he had the best of them all my daughter hurts was too artificial tasting and mine didn't taste like much so I'm a try Molly's one more time but honestly  I wish I would've went with the peach cobbler", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/RoGWfrit9cJdcoNYxZKjeA/348s.jpg", "caption": "Entrance"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ddSKVXsSGQhcjvFFX2rjMw/168s.jpg", "caption": "Yup"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/x14s0eGTjUP2RhBhCJvRbw/168s.jpg", "caption": "Treats"}]}}, {"review": {"des": "Ehh...Molly's, I wanted to love you, really I did.<br><br>Problem 1 - All of their cupcakes are way too busy for my style.  I'll admit that I'm a bit of a purist when it comes to food.  I don't like when classics are tampered with.  I was immediately put off by seeing that every single one of their signature cupcakes had filling and at least three different components to the toppings.  I appreciate Sprinkles cupcakes because they keep it simple and to the point.  Molly's cupcakes just felt like they were doing way too much, which leads us to the next issue....<br><br>Problem 2 - Because of the unappealing busy-ness of the signature cupcakes, I opted for the \"build your own\" cupcakes, in which you choose the flavor cupcake and the flavor of frosting.  I ordered one chocolate cake with vanilla frosting, one banana cake with vanilla frosting and one mini vanilla cake with chocolate.  The mini cupcake was the best for sure.  My husband and I agreed that their vanilla frosting was kind of awful.  It was pasty and just really didn't work with the cake.<br><br>Problem 3 - The girl helping me at the counter seemed very annoyed as she was taking my order and frosting my three cupcakes.  Nothing friendly about that service.<br><br>Given that there are other cupcake spots in the area that I much prefer, I doubt I'll be giving this Molly's location another try.", "pics": null}}, {"review": {"des": "LOVE molly's cupcake! i normally go to the original location but this one is a bit closer to me..<br>the service is just as friendly and the cupcakes is just as good as the other one..<br>4 stars because they ran out of my favorite creme brulee cupcake a few times when i went.", "pics": null}}, {"review": {"des": "Step aside Sprinkles Cupcakes, there's a better cupcake place in town and it's Molly's cupcakes.  <br><br>These center-filled cupcakes separate Molly's from other bakeries. They have an assorted amount of flavors. From the Ron-Bennington, Cake Batter and Creme Brûlée, all of their cupcakes are absolutely delicious and moist. It's a great place to bring your family and friends.<br><br>Once you enter this cute shop, it will remind you of a classroom. From their cute chairs to their lockers and chalkboard, Molly's brings a welcoming atmosphere. You'll also enjoy their swings. Make sure to take a picture of your cupcake on the swings after you make your purchase. <br><br>There's even a sprinkle section where you can take your cupcake and decorate it as you please. How cute is that? Be careful though, you might get a sugar overload. But let's be real, who doesn't love sprinkles? <br><br>If you decide to stay and eat your cupcake, your cupcake will be served on a glass plate that looks like a small paper plate. There are forks and knives so that you can split your cupcake and share with your friends. You can even grab a small cup of water to enjoy your cupcake with. Molly's thinks of everything. <br><br>Also, did I mention that they have board games there? If you and your friends are looking for a place to hang out, grab a cupcake and a board game and have fun! This is actually a fun spot to hang out. <br><br>The best part about this bakery is that they are opened late! Yes, you don't have to wake up early and grab a cupcake before they run out or they close.<br><br>You must come to Molly's and try one of their cupcakes!", "pics": null}}, {"review": {"des": "5 stars doesn't do this cupcake shop justice! We stopped here because we were walking by and it looked like it would be delicious. We were right!!! <br><br>I had a red velvet and a chocolate cupcake and they were incredible. They have a great area to sit if you want to have your cupcake with a drink or read etc. while you eat. I honestly cannot wait until the next time I am in Chicago and can get some more of these delicious cupcakes!", "pics": null}}, {"review": {"des": "Of the countless cupcake options in Chicago, I like Molly's best. They're not overly sweet and are always moist. Yesterday I opted for a S'more and a Samoa. Both were even better than they look. <br><br>Occasionally, I'll find better cupcakes at a competitor only to be disappointed with lack of consistentcy during my next visit. Molly's serves up decadent, realiably delicious cupcakes every time. I've also had great experiences with huge catering orders too. No complaints.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Nyz9ge16JKdNpQx9EDY8zQ/168s.jpg", "caption": "Blueberry Cheesecake - vanilla cake infused with cheesecake, cinnamon Graham cracker crumb, pastry cream and glazed blueberry"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/07yQ8CJNxC9c33ARV1kOIw/168s.jpg", "caption": "Get this. .."}]}}, {"review": {"des": "Less quirky digs, same killer cupcakes.<br><br>Took advantage of Molly's new Navy Pier-adjacent location for a cupcake fix prior to a Grant Park wedding.  The new location, which oddly shares an entrance with a dental clinic(!) still smells of freshly sawed wood, but features Molly's stand-bys such as chain swings at the bar as well as an assortment of board games.  Location was spacious with high ceilings, which is an unusual change compared to its more intimate Lincoln Park and Greenwich Village NYC locations, which ultimately evoked an unusual sense of sterility.<br><br>Fortunately, cupcakes were as good as usual, with high points including the creme brulee filled cupcake.  High marks for coffee and tea offerings as well.", "pics": null}}, {"review": {"des": "These cupcakes are the best. Like out of this world good. When you are at the store, it is hard not to buy all of the flavors they have. My personal favorite was there chocolate cupcake. It was so moist and rich. This is the place to fix your sweet tooth at!", "pics": null}}, {"review": {"des": "Hands down the best cupcake bakery EVER. These cupcakes are light, soft, and flavorful, and even my highly-sensitive-to-over-sweetness family thought they were perfect. They also look gorgeous.<br><br>We had the creme brûlée, blueberry cheesecake, and strawberry shortcake. <br><br>Strawberry shortcake: The cake is vanilla but honestly tastes kinda like cornbread and has similar texture (it works really well!); the filling is close to quality strawberry jam, but more subtle.<br><br>Creme brûlée: The caramelized sugar top is SO good and crispy and tastes just like the real thing. Flavors are perfectly balanced between that, the vanilla custard filling, and tart fruit. The cake is super delicate.<br><br>Blueberry cheesecake: This was the family favorite! The cheesecake itself is light, and you can taste a milky cheesiness alongside the blueberries. Topped with more blueberries and crunchy graham pieces -- eating this cupcake is a full-on sensory experience. <br><br>I've been craving Molly's Cupcakes since I had them a few years ago in Iowa City, and have finally made it to the Chicago storefront. Safe to say I'll be back! And from what I remember of their ice cream, it's also to die for...", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/EfojyWPBcDH0DKFN5-MKHQ/348s.jpg", "caption": "Creme brûlée! There is a LOT of filling here"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/X22RmXB8_dYnB6A0LCjZyw/168s.jpg", "caption": "Strawberry shortcake (spring/summer seasonal cupcake), Creme brûlée, Blueberry cheesecake!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/kbhRUHrRYaxDqBitYjZXtA/168s.jpg", "caption": "Blueberry cheesecake! Perfect combo of textures and flavors"}]}}, {"review": {"des": "Amazing cup cakes of different sizes. Try out the butter scotch, red velvet !! The one near Lincoln park had more reviews but we wanted to try the one near navy pier. Ambience looks amazing!", "pics": null}}, {"review": {"des": "7/15/2017 - While sightseeing in Chicago we walked into a cupcakes sign so of course, we had to go in. The cupcake boutique-style bakeshop was packed with locals and tourists alike. There are lockers by the back with tons of lunch boxes from shows and characters of my childhood. Knight Rider, Dukes of Hazard, etc. There were also these wooden swings to be used as chairs, super fun!!!. ALso, there is a huge black board on a wall with the Table of Elements and up top it says E=MC2 (Eat=Molly's Cupcakes) and other fun facts about the components of flour, vanilla, and baking soda. <br><br>After looking at all their goodies in the glass case, I went with the Cake Batter and my friend went with the Peach Cobbler cupcake. They are served in cute little plates. I really loved the Peach Cobbler with the peach puree filling. The Cake Batter was just ok. Both were super fresh and moist as they are made right there. The Cake Batter is filled inside with liquid cake batter. Perfect little stop on our way to more walking....calories were burn I'm sure.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/xO0nZxZSJuMFnLQAXEVKKQ/168s.jpg", "caption": "Peach Cobbler & Cake Batter"}]}}, {"review": {"des": "The service from staff was amazing and the cupcake was delicious. This was my first time visiting the store and the selection was pretty big. I asked on of the staff to assist in my cupcake selection process. I narrowed it down to three chocolate peanut butter, chocolate chip cookie and the blueberry cheesecake. She helped me select the blueberry cheesecake and it was amazing. The cupcake was light and delicious. There was just enough blueberry so you can taste it but not overbearing. The cheesecake finish at the top just made it all come together. Coffee wasn't great but the cupcakes were great. <br><br>I would recommend this place to anyone that is looking for a great cupcake made from scratch. Excellent service and a great product.", "pics": null}}, {"review": {"des": "Imagine: you're wandering around downtown Chicago, you're not sure what you want to do with your friends.  You're bored and wouldn't mind something to eat but have no idea what to hit up in a city that's filled with so much food.  You're also showing around your friend that's new to Chicago, the city, and you finally decided on maybe bringing them to Navy Pier when you stumble across Molly's Cupcakes.  Do you go in?  Do you ignore it?<br><br>GO. IN.  ~done being dramatic~<br><br>Molly's Cupcakes are amazing.  I'm normally not a huge cupcake fan because majority of the time, cupcakes are way too sweet for me and growing up, I was used to those Asian cupcakes that are just mildly sweet and filled with fruit (classic grocery store American cupcakes, I can barely tolerate because of the overwhelmingly sweet taste that always comes with them).  So when my friends first brought me to Molly's, I was beyond skeptical to say the least.  Sure, they were artsy.  Sure, they have cute wall art and games that you could play with you friends while you're enjoying your cupcakes.  But where they good?  Were they too sweet? <br><br>Let me just say, I've never been happier with spending money on cupcakes in my life.  Not only does Molly's provide unique flavors such as Blueberry Cheesecake, Crème Brulee, Mixed Berry, Strawberry Shortcake, and Chocolate Raspberry, but all of them are balanced with the perfect amount of sweetness and fluffiness, it makes you want to cry tears of happiness.  I pretty much recommend all the cupcakes I named above for those people who are looking for something that is not too sweet and somewhat fruity.  I've also tried Cookee Monster and Boston Cream, but those for me were a little bit on the too-sweet side.  <br><br>The people there are always very nice, the place is always very clean, and there may be a little bit of a line sometimes, but people order quickly and there's never more than a 5 minute wait (from my experience) to get your order in.  They have, like I said before, some fun games like jenga, apples to apples, etc. to play with you friends if you're there with a group.  You can also take cupcakes to-go obviously, so that's always an option.  Point is: Molly's Cupcakes is the way to go if you ever need to take someone in downtown Chicago to a nice, friendly, somewhat artsy, definitely tasty food place but you're just looking for something small/a dessert.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/zhL3-e2LgAtii_DsqkKiZA/168s.jpg", "caption": "Mixed Berry (front) Blueberry Cheesecake (left) Crème Brulee (back) Peach Cobbler (right)"}]}}, {"review": {"des": "I'm not much of a cupcake person, but I have to make an exception for Molly's; these cupcakes are no ordinary cupcakes. <br><br>While we do have a Molly's location in New York City, Chicago is home to Molly's, so I try to stop by for a sweet treat when in the Windy City. The cupcakes are light and fluffy, and the fillings are delicious. My top 5 favorite cupcakes here are:<br><br>1. Crème brulee cupcake  - vanilla cake filled with custard, and topped with torched sugar and berries<br> <br>2. Salted caramel butterscotch cupcake - vanilla cake stuffed with butterscotch pudding, topped with buttercream and a drizzle of salted caramel<br>  <br>3. Lemon meringue cupcake - filled with lemon curd and topped with toasted meringue - this is available only in spring and summer<br><br>4. Blueberry cheesecake cupcake - cheesecake caked into the cupcake!<br><br>5. Peach cobbler cupcake <br><br>The East River location is a nice little recess amidst the frenzied bustle of downtown Chicago, and a portion of the profits are donated directly to local schools. Noble and fitting, given that Molly's was named after the founder's school teacher who made cupcakes for her students on their birthdays. <br><br>This business will continue to have my support, even if that means a few inches continually added to my already ever-expanding waistline!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/UQ6Yyx-_oXvtZUduMh3SEQ/348s.jpg", "caption": "Creme brulee cupcake"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/U3scwXpPxdASBMccuuejAQ/168s.jpg", "caption": "Blueberry cheesecake cupcake"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/p7n2ucR_VCrQU2AJpp0DQQ/168s.jpg", "caption": "The beauty that is the lemon meringue cupcake"}]}}, {"review": {"des": "I can't say enough good things about this place.  I went in here expecting to be pleased but not wowed.  I mean, cupcakes were all the rage and ubiquitous for awhile, so I thought this place would just be more of the (admittedly yummy) same.  Well, I was wowed. <br><br>The selection is large and the cupcakes are completely amazingly delicious.  I tasted the chocolate peanut butter and the birthday cake and both were just fantastic.  Seating was plentiful, there was a large shelf of board games for customers to use, and there was free water with NON-DISPOSABLE cups.  <br><br>Please open another location in Hyde Park!", "pics": null}}, {"review": {"des": "One star for crappy service. I was the only person there, ordered 6 cupcakes, one iced mocha, and one iced chai. The drinks took 20 minutes, I've never seen a person move slower. I didn't get a chai, but an iced coffee instead.", "pics": null}}, {"review": {"des": "I was so excited about this location! We were just done with checking out Navy Pier and it was nice to know that they had a location near downtown. I love the Lincoln Park location as well. This one is big! There are cool games and a very cute setup. I've tried the Ron Bennington and peanut butter chocolate before. Today I had the cookie monster and Samoa one. These were amazing! The cookie monster had delicious cookie dough inside. I loved the coconut flavor of the Samoa. I also got to try a bit of the mint chocolate chip one. This was richer because of the chocolate. Overall though the cupcakes are delicious and amazing. I highly recommend!!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/LK2wbTxysmRSIGBTgGExlQ/168s.jpg", "caption": "Cookie monster! Absolutely delicious."}]}}, {"review": {"des": "Awesome location. Right on the way to Navy Pier. Fun environment (they have seats like swings). Overall good experience, but I was less thrilled with the cupcakes I selected. <br><br>I got coffee and 4 cupcakes...<br><br>Coffee - okay. slightly burnt, but they had milk to add so that helped. <br><br>Peach Cobbler - pie filling awesome! cupcake light. whipped topping light. sprinkle of cinnamon.  Absolutely awesome cupcake.<br><br>Creme Brulee - too sugary for my taste (but if you like creme brulee, you love this). The center is super liquidity. I tried to split this cupcake with someone and it was absolutely impossible since the center just ran out everywhere. <br><br>Blueberry Cheesecake - tasted like blueberry pancakes. I loved the fresh blueberries, but was less a fan of the cupcake and cream cheese frosting. The frosting was more sugar than cream cheese and it melted before I even got home. <br><br>Somosa Cupcake - way too sweet. Sugar taste and cream overpowered any specific flavor and hardly any cake. It was all filling and frosting. <br><br>One note, the prices confused me. $2.50 for regular cupcake and $3,75 for filled. All the cupcakes I purchased were $3.75 (despite some not having fill). So I'm not sure what cupcakes would actually only be $2.50. Would have been nice, if they had prices listed a bit clearer per cupcake.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/poaAdrvFxBBfLv2Z7v2iwg/348s.jpg", "caption": "Creme brûlée, blueberry cheesecake, samona, peach cobbler"}]}}, {"review": {"des": "Awesome cupcake. I had the cookies and cream. Very rich and moist. A little sweat but the macchiato was a perfect match with it. It has been a long time since I've had a real Italian macchiato and they did it perfectly. <br><br>Very nice little place. Seats by the huge window for people watching. ;-)", "pics": null}}, {"review": {"des": "Get anything ever on their menu. It will not disappoint.<br><br>If you've been to the Lincoln park location, you'll love their new location. I think it's everything the original is but in a larger space. It's something different but still keeps the old feel.<br><br>I've been trying to slowly get the whole menu but there's just so much goodness.<br><br>Oh and if you have someone visiting Chicago, you can go to Navy pier and probably hit up Molly's right after no problem.", "pics": null}}, {"review": {"des": "I will make the disclaimer that I am NOT a cupcake fan, yet this place did a great job in convincing me that cupcakes are awesome! I can see why they won Cupcake Wars! I tried two cupcakes so maybe I just lucked out. I tried the chocolate eclair and I had the key lime cupcake for myself. What I was expecting was something more on the dry side with no depth. What I got was a delicious creamy explosion center in both, which did not impede the moistness of the cake itself. The cake was also at the great sweet spot where it was moist but not soggy. Hard to do considering all the filling it had. I am giving it 4 stars because like every other cupcake place they do seem to overdo it with the icing. I think the cupcake lost some of its strength by having so much of it. Really, you've made a perfect cupcake, don't ruin it with so much icing. Let the cupcake speak for itself.<br><br>Oh! One more thing! The swing seats are the best thing about this place. Such cute and original seating for when children come in. Loved it!!", "pics": null}}, {"review": {"des": "Holy cow.. Seriously, Molly.. you are something else! I never considered myself a sweet tooth connoisseur. I've had some good desserts before, but after trying Molly's cupcakes I know these are definitely the best cupcakes I've ever had. Each individual cupcake has a smooth and creamy filling in the center, and the flavors of all these cupcakes mesh so well with each other. I'm embarrassed to say that I went back the very next day after I first tried them here! And after writing this review, I'm planning on making a pit stop there today! <br><br>In order of my favs:<br><br>Smores- my fav! It's a cinnamon graham cracker-esque cupcake with a smooth chocolate filling, topped with just a light coating of chocolate ganache, toasted marshmallow and a Hersey square.  The combo of flavors are seriously perfect!<br><br>Cookies and cream- chocolate cupcake with a cookies and cream filling, light coating of chocolate ganache, whipped frosting and a mini Oreo. <br><br>Blueberry cheesecake- perfect light and fluffy vanilla/cheesecake combo with a graham cracker crust finishing on top! <br><br>Cookie Monster- cookie dough filling (enough said)<br><br>Cake batter- most people's favs but found the filling too be too sweet. Tasted too rich for me with almost a pure butter flavor; some may not see the negative in this :)<br><br>Salted caramel butterscotch- not my fav in flavor combos..the filling was a butterscotch pudding and the texture was a bit thick.<br><br>Even of the cupcakes I wasn't a fan of, it's still ranks higher than most cupcakes I've had. Bottom line is get here asap and enjoy your cupcake today! You will not be disappointed!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/79bJqnFGMZSqwN0MVThL0g/168s.jpg", "caption": "Creme brûlée cupcake"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Bsgil2IxTU13idDI2OaBbQ/168s.jpg", "caption": "Cookies and cream.. also a top contender!"}]}}, {"review": {"des": "After months and months of torture pics from my sister and nieces enjoying these delicious cupcakes I couldn't handle the suspense so I dove right into this place and right before I did I called 45 min in advance to make sure the most popular Crème Brûlée cupcakes were available luckily they had two and saved them for me until I had arrived! <br><br>This location was pretty spacious for downtown, I was expecting it to be small and cramped. Instantly fell in love with the school theme, seats, swings and chalkboard. Makes you feel like a kid again.<br><br>Lines form quickly here so you'd better stop staring and get your cupcake before its gone!<br>I was overwhelmed by all the choices they had. I will have to return and try them all! Probably the MOISTEST cupcakes I've ever had and they were sOoOooOOoOooOo delicious each one was unique. <br>I had gotten the s'mores, cookie monster, red velvet m, blueberry cheesecake and of course the belle of the ball CRÈME BRÛLÉE which was my all time favorite. <br><br>I'll come back and get a dozen of these all for myself ;) sorry no sharing", "pics": null}}, {"review": {"des": "Went to the new location in Streeterville, same great cupcakes, though I like the Lincoln Park location - just has more buzz and history.  Love their cupcakes, my favorite in the city.  Creamy frosting, fluffy cake, I love the filling.", "pics": null}}, {"review": {"des": "Ordered the red velvet with cream cheese icing and sprinkles. Watched my cupcake be taken out of a Tupperware. These are not fresh baked and you can taste the difference. The cake was okay, but the icing tasted like cream cheese straight from the tub, not like icing. I'm glad we have Georgetown Cupcakes back home. They still have the best red velvet cupcakes, hands down.", "pics": null}}, {"review": {"des": "Molly's cupcakes is awesome, and affordable I had their cupcakes once when I visited and I fell in love! <br><br>My boyfriend lives in Chicago and I live in Houston  , but  I wanted to get him something special for his birthday. So I was able to order their cupcakes over the phone and have them delivered same day to his house and they even put a little happy Birthday note !", "pics": null}}, {"review": {"des": "So the creme brûlée cupcake has probably ruined me for creme brûlée for life. It was one of the best things I've ever tried and I LOVE creme brûlée. So yummy and perfect. The torched top and creme brûlée filling and fresh fruit was just perfection. Does Molly's ship cupcakes? Asking for a friend.", "pics": null}}, {"review": {"des": "Probably the best cupcakes I've had comparable to Peters burnt almond cupcake in the bay area but there's so many other good options. Must try the creme brulee cupcakes! It has actually creme brulee cream inside and the carmellized sugar on top. The peach cobbler was my second favorite followed by the blueberry cheesecake then strawberry shortcake.", "pics": null}}, {"review": {"des": "The Raspberry Creme cupcake was so amazing. The cream was great, and the actual cupcake itself was so moist. <br><br>Next time I'll have to try more options.", "pics": null}}, {"review": {"des": "I am by no means a cup cake connoisseur but I definitely was excited to come here and left slightly disappointed.<br><br>I live in the neighborhood and walk by this joint all the time. It's beautiful, has swings at the cupcake bar, and the decor is just clever and cute.<br><br>The cupcakes will run you about $4. The build your own is slightly confusing only because the staff doesn't really make the effort to ask you if you've been there before. <br><br>I grabbed a smore cupcake and it was good, just not great. Notably - and what kind of bugged me was that the cupcakes didn't seem to be very uniform in size. Some had more icing, some less. Meh - for the pricepoint, you'd think they'd be a bit more uniform...", "pics": null}}, {"review": {"des": "What a spacious classroo... Err cupcake shop! I loved the classroom theme they had going throughout the space, from the re-purposed school desks to the lockers to the lab chairs and even the chalkboard with a full cupcake table of elements. Awesome & unique!<br><br>As for the cupcakes themselves... delicious! I had shared the S'Mores cupcake and it was great! Nice marshmallow icing topping with cinnamon/gram cracker flavored cake filled with more chocolate and of course topped with a piece of Hersey's chocolate. Yums!<br><br>Not sure what the specialty cupcake market looks like now a days as it's been years since I've been to a Sprinkles location, but Molly's will cost ya $4 and some change to grab one of these goodies. I knocked a star as it did seem kinda on the smaller side of the cupcake spectrum (by no means am I an expert, but relatively speaking). <br><br>Anyways, not a bad place to stop if you have a sweet tooth craving or even looking to grab a cup of coffee. Lots of open table space too if you looking for a new spot to get some work done. I did also recall free wifi somewhere as my phone seems to automatically hook to it. That's all I got.<br><br>'Til next time, cheers!<br><br>81/365", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Zsp2nDcwr9MhjYIs1jHkpw/168s.jpg", "caption": "You want S'More?"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/SXl0YAMyimknitpEXxkquw/168s.jpg", "caption": "Eat Molly's cupcakes and learn the cupcake periodic table"}]}}, {"review": {"des": "First went in this cute little shop because it looked so quaint from the outside.  My friend got a coffee and we had fun taking pictures of the adorable decor and sitting on the swing seats.  As we walked out, we noticed signs that said they were the winners of cupcake wars so we ran back in to try their cupcakes. OMG!! Their cupcakes are to die for!! I had the s'mores cupcake. It was the lightest, moistest cupcake with the perfect balance of flavors! I was so excited to eat it that I forgot to take  a picture of it!  Also bought some cookies and brownies to take home for the kids.  Everything we tried was so yummy!!  I will definitely be returning!", "pics": null}}, {"review": {"des": "This is going to sound like an exaggeration, but I'm being completely honest: these are the best cupcakes I've ever had!! They are each stuffed with something amazingly awesome. My favorites are the Cake Batter filled and the cookie dough filled. I mean come on, how delicious does that sound!! The frosting is amazing too because it's not too sweet. The cake is moist and flavorful. I'd also highly recommend the flourless chocolate cake! I can't say enough good things about my new favorite place in all of Chicago!! It is well worth the price! Don't miss your chance to try these little bites of heaven!!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/1pR5ezwd82uG8b52LG_suw/168s.jpg", "caption": "Cookie dough filled!!"}]}}, {"review": {"des": "Did not enjoy the cupcakes today. We ordered the chocolate raspberry and the Samoa (which is suppose to be like a Girl Scout cookie with marshmallow and coconut flakes) they were TOO RICH and that over powered the taste. So we did not enjoy our cupcakes. <br><br>The service was nice and welcoming as soon as you walk into the door they always great you with a \"hello welcome to Mollys\" but the espresso they use also not what we were expecting. They use intelligista For some reason it's either the espresso or their machines. (It's either old coffee beans or they just don't clean the machines as often as they should) The taste was not pleasant it was the taste of old coffee grounds or something like that. This was out FIRST time of having their specialty coffee drinks and we will surely not try them again.", "pics": null}}, {"review": {"des": "Love, love this place.  <br><br>Came here to get cupcakes for my birthday-soooooo many to choose from.  <br><br>Love the birthday cake batter with the center filling!  Wish I had more time to explore ALL of the DIVERSE options...not just cupcakes either-chocolate covered oreos, strawberries, cheesecake....need I say more?", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/QE64idNvd_WEEnvBhIVmJQ/348s.jpg", "caption": "Birthday Cake Cupcake-soft batter center-fleur de lis and candle from amazon.com"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Z3PZX4bT7C4FDbVM_SuGHw/168s.jpg", "caption": "Soft interior of Birthday Cake Cupcake! Yummy!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/GLVquEHynHrCfOM4g0YS9g/168s.jpg", "caption": "Birthday Cake Cupcake"}]}}, {"review": {"des": "Since spotting Molly's Cupcakes this summer on my way to Navy Pier, I had been meaning to stop in for a sweet treat. I finally got my chance on Sunday evening (because what pairs better with a dry martini than a scrumptious cupcake, amirite?). The hours here are fairly generous, especially for the early-to-bed world of bakeries. I came in a bit after 6 pm and still felt there was a good selection from which to choose. The space immediately made me feel happy, with its rope swings, lunchbox and locker motif, and bright colors. The line moved swiftly although the payment setup was mystifying. Fortunately I didn't have to tangle with it as I went old school (cash). <br><br>As to the cupcakes themselves, I am definitely a convert to this place over Sprinkles and Sugar Bliss. Not only are the cupcakes filled (I sampled the butterscotch salted caramel), the main selling points for me were the lightness of the frosting and the fact that the cake was moist. Love that they have a build-your-own cupcake (mini or regular size) option as well. For designer cupcakes I didn't feel the prices were out of line, and will probably be back here the next time my sweet tooth needs satisfying.", "pics": null}}, {"review": {"des": "Blueberry cheesecake cupcake for the win! Very light and moist. It's wasn't overly sweet, and there was just the right amount of cheesecake filling. The blueberries tasted super fresh and the cinnamon graham cracker pieces added a nice crunch. No wonder they won cupcake wars.<br><br>The store itself is really cute and spacious. Love the \"school\" theme they have going on from the periodic table on the chalkboard to the wooden swings. They also have a lot of different and seasonal flavors to choose from. Next time, I will need to try one of their famous center-filled cupcakes. Very pleased with my visit here!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/dqtrdfflS1sh4MeG-DGskA/348s.jpg", "caption": "Blueberry cheesecake"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Gi7tPT3tKsSNuYADL5mRzw/168s.jpg", "caption": "S'mores, blueberry cheesecake, creme brûlée, & red velvet"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/XbtqrOKGKfoE3dQw3Cz3Tg/168s.jpg", "caption": "Red velvet & carrot w/ cream cheese frosting"}]}}, {"review": {"des": "We were on the hunt for doughnuts but unfortunately everything was sold out because it was later in the afternoon. Found this on yelp and decided to try it out. So glad we did! There were a few of us so we got a half dozen and tried a bite of each. All of them were so amazing. I could eat the peach cobbler cupcake every day for the rest of my life and die a happy woman. My next favorite was creme brûlée. It was a little pricey for my liking but honestly didn't care because they were so good.", "pics": null}}, {"review": {"des": "I love Molly's cupcakes because they have amazing cake! Some have a filling which make a nice surprise. Like the cookie dough cupcake actually has cookie dough in the middle.<br>My favorite cupcake is the creme brûlée. It has a glazed top like the top of a real creme brûlée. Love it. This is my go to spot to get a cupcake for someone's birthday or a special occasion. <br>The interior is shabby chic with large \"swing\" chairs that make for a cute picture. They don't actually swing though. <br>The staff are always friendly and smiley. <br>Go to Molly's if you want to have delicious piece of cake! If you're headed to navy pier, head along Illinois along your way to pick up some cupcakes. It's a great location.", "pics": null}}, {"review": {"des": "Definitely impressed with their cupcakes! Not usually a sweets person but won't ever say no to their cupcakes! I ordered the banana cupcake topped with vanilla frosting and sprinkles. Yes, it sounds and looks plain. Don't underestimate it. The amount of flavor the banana gives off is the perfect amount! The frosting is interesting. IT DOES NOT STICK TO THE FINGER. How??? The frosting was a plus for me. Their frosting is not too sweet. I hate overwhelmingly sweet frosting. So they did a great job. What topped off my experience were the swings in front of the counter! It's a cute, creative seating area. Heard great things about the blueberry crumble cupcake. Must get next time!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/cl7N6yoPzc06wZSa-A5kdg/348s.jpg", "caption": "Banana Cupcake Topped with Vanilla Frosting and Sprinkles!"}]}}, {"review": {"des": "If you love cupcakes then this is heaven. I just devoured mine. You can build your own cupcake with any kind of filling and toppings and frosting. What more could one ask for!!! You'd think they overcharge but prices are surprisingly reasonable.  Good coffee too.", "pics": null}}, {"review": {"des": "I've come here a couple of times with my girlfriend and we both love it.<br><br>The cupcakes are great, worth giving some of them a try.  <br><br>The best thing about this place i think is its ambience and decorative style.  They have a wall full of science and math equations, a bookshelf full of books, board games, and funky stuffed animals.  <br><br>It's definitely a nice place to go on a date :)", "pics": null}}, {"review": {"des": "By far my favorite cupcake place! Love all the flavor options! There's always so many good options it's hard to choose!", "pics": null}}, {"review": {"des": "My all time favorite cupcake shop hands down and I'm not ashamed to admit that I've tried nearly ever other one in the city, for research purposes, of course:) yes, they are pretty pricey and if you're looking for a few dozen they will likely give you sticker shock but if you want to wow your guests with not just a cupcake but a work of delicious art, Molly's is the spot! My favorite cake is a tie between the birthday cake and cookies and cream but the good ole Ronnie B never dissapoints! The shop itself is super cute and welcoming.  When I am in the mood to indulge not just any cupcake will suffice, I want my calories to be worth it and with Molly's it always is!!!", "pics": null}}, {"review": {"des": "These are my favorite cupcakes out of all the cupcakes in the city! I will admit, it took a while for me to really love them. I'm used to the dense cupcakes of Sprinkles and Crave (Houston!), so I was pleasantly surprised at these light fluffy cakes. The first one I tried was the Nutella peanut butter, and while I enjoyed it, I wasn't blown away. The ones that did blow me away were the Ron Bennington, Raspberries and cream, and my FAVORITE - Crème brûlée cupcake. The Crème brûlée cupcake is the best cupcake I've ever had. I've taken friends from out of town and they shared my sentiment.", "pics": null}}, {"review": {"des": "Delicious and worth the walk! We had the Cookie Monster, S'more, and Boston Kreme. Lots of frosting, lots of flavor and very cute. I loved the bakery seating. It feels like a schoolhouse with desks, lockers, books, and games.", "pics": null}}, {"review": {"des": "WOW the creme brûlée and peanut butter nutella cupcakes were moist and deliciously stuffed. Both of them I would get again ($3.75) each or they have a build-your-own option for $2.75. Ample seating, board games available and a lot of natural sunlight, all a quick walk from navy pier!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/q4c92Ra077aCURHU6OBJxA/348s.jpg", "caption": "Creme brûlée and peanut butter Nutella  sooo good"}]}}, {"review": {"des": "We were walking by and smelled the coffee. So we decided a mid afternoon snack was necessary. So we went in and got 1 s'more cupcake and 1 butterscotch, with 2 cups of coffee. We were blown away with how delicious they were. They had filling in it that just cascaded over the cupcake when we cut into them. The Coffee was not the best but the cupcakes more than made up for them.", "pics": null}}, {"review": {"des": "Love this place! The cupcakes are absolutely delicious! I have tried various flavors at other locations. At this location I have tried the cake batter and the smore flavor. They are very nice and accommodating here. We ordered these cupcakes off of DoorDash and the order got cancelled. I called Molly's cupcakes right away and they explained the situation and put our cupcakes aside with our name on them so they were reserved for us and they told us to re-order and that they'd have the cupcakes ready for our driver! They have way more flavors in the store then on DoorDash so I would highly recommend going in there. Their cupcakes are very flavorful and moist!", "pics": null}}, {"review": {"des": "Amazing amazing amazing! Great cupcakes, great fillings, great frosting!Cannot say enough good things but a definite must try if you're in the area, a must try!! A portion of the profits even go to support local schools! Cannot say enough good things!! <br><br>Some favorites : key lime pie cupcake, créme brûlée (if they have it please try!!), samoa (a bit too sweet for some tastes), and Cookie Monster cupcake. But really you can't go wrong", "pics": null}}, {"review": {"des": "O.M.G.<br><br>The creme brulee cupcakes are LIFE-CHANGING.<br><br>There's also free wifi and board games to play!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Q5NG79K93EI7gPfibS_9Vg/348s.jpg", "caption": "creme brulee cupcake inside"}]}}, {"review": {"des": "Having gone to school in Lincoln Park, Molly's was our SPOT...until my bank account wasn't havin' it... Now that I've moved to Dallas, I miss Molly's SO much - no other place compares. <br><br>Not only are their cupcakes creatively delicious and satisfying, but they create a super fun store atmosphere. From the games, to the swings, to the helpful and friendly staff, Molly's is my favorite cupcake destination. When I lived in Chicago I took all my out of town friends there, and now when people ask for recommendations, it remains first on my list.<br><br>Finally, Molly's donates a portion of their proceeds to local schools! Sweet treats that benefit the community? Yes please!", "pics": null}}, {"review": {"des": "If you would have bet me before coming here that I'd ever think so highly of a cupcake shop, you would be richer today! The main reason I'm not a cupcake fan is because, I mean, aren't they kind of a dumb dessert? They're messy, an inconvenient size, and you have to access them by removing paper. Then are you supposed to use a fork, or your hands? Then what angle do you attack them from? If you use a fork, they fall apart all over the place. If you use hands, you have to get your hands sticky and open your mouth really wide so it'll all fit. (Stay on topic!)<br><br>But I have to say, all the accolades seem well-deserved here. Whatever those accolades are, that is. Something about finalist for Cupcake Wars or something, and best in Chicago, maybe? I can't remember, but they're proudly displayed on the storefront to entice you. The inside is fun, as it's a really cool and relaxed hangout spot that provides a nice escape from the bustling outside. Staff is super friendly and working hard, from what I could tell. Presentation is on, with colorful cards and detailed descriptions of all the offerings. And there are several options that don't try too hard, which is what sold it for me. The flavors are just interesting enough without being too daring or zany. I appreciate subtlety.<br><br>Regarding the cupcake experience itself, the cake quality is fantastic and frosting is delectable. You'll find creme-filled offerings, which offer an ideal amount of creme so it isn't exploding out the sides of your mouth when you bite into one. (Also, cupcakes are apparently a rich area for innuendos.) Details are not lost, as many of the cupcakes have an extra touch of shavings or berries added on top. I'm truly impressed because I feel there is a genuine passion that is apparent in each and every cupcake, and I appreciate that kind of dedication to a craft.<br><br>Finally, I assume all the drinks are superb, because the iced chai tea latte was packed with incredible flavor. Many places tend to offer watered-down chai lattes, but there was no skimping found in this drink. They could have overcharged for drinks, as well, but prices are reasonable.<br><br>Loved it here, and Molly's has definitely made me reconsider what I'll put in my mouth.", "pics": null}}, {"review": {"des": "Cute little place. Cupcake is pretty good. You can make your own cupcake. Pick your cupcake and your frosting. Then you can sprinkle whatever u like on it. It's fun. Give it a try.", "pics": null}}, {"review": {"des": "I stumbled across Molly's and I'm so glad I did. The only regret I had was that I was too full from dinner that I wasn't able to eat more than one cupcake. I opted for the Creme Brûlée cupcake and it did not disappoint, in fact I was presently surprised. There were many others delicious choices available. Signs in the shop indicate Molly's is an award winner. There is plenty of seating available, including swings and student style desks.", "pics": null}}, {"review": {"des": "Tried the Cookies-N-cream cupcake, moist and soft inside, goes perfectly with ice coffee. Wish it was less sweet though.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/mNZt8iibCVBF8lr-gZa73A/348s.jpg", "caption": "Cookies-n-cream cupcake"}]}}, {"review": {"des": "I wasn't having the greatest day when my fiancé suggested we go get some dessert, but Molly's definitely brightened my evening when we stopped by here. <br><br>All their cupcakes looked delicious, and as someone who always wants to try EVERYTHING on a menu, it was difficult for me to just pick one. But alas, I narrowed my choices down to a few and finally ended up with one. I'm not gonna bother with telling you which one to get or how amazing I thought my flavor was because quite frankly, everyone has different tastebuds, and I'm sure all of them are fantastic - if having just one is any indicator. <br><br>It's definitely a lively location and is not a far walk from most area hotels. If I had been feeling better, I would have enjoyed the nice walk in the lovely, cool breeze. The decor is hipster chic and has a nice vibe to it. If I lived in Chicago, I would definitely stop by all the time, just to have a cupcake and hang out.<br><br>I also ordered a Chai Tea Latte, and OH MY GAWD. It was seriously the best chai tea latte I've ever had. And I've had a lot - mainly because I don't drink coffee. It might be from Intelligentsia, since Molly's serves Intelligentsia's coffee. Regardless, I daresay that the chai tea was even better than the cupcake for something sweet. <br><br>I would definitely come back if I'm in the area again, but I really wish we had one here in KC right about now.<br><br>Overall: 4.5/5<br>Food: 4.5/5<br>Service: 4/5<br>Atmosphere: 4/5", "pics": null}}, {"review": {"des": "WORTH IT! Being tourists in Chicago, we didn't know about this place but we're in the mood for a treat so we walked in. From the outside, nothing was enticing except for a simple chalkboard sign. However, once you get inside it's a whole new story. They've got a cool modern library vibe in the place. Complete with outlets to charge phones/laptops. <br><br>You can either build your own cupcake or get a specialty filled one. I got the cookies n cream cupcake while my SO got a butterscotch salted caramel one. They were both delicious! There was a lot of buttercream on mine but it was soft and not too sweet, so it was edible. We got a simple coffee to wash down the cupcakes...all in all it was an excellent snack and I'm back in Canada craving one of Molly's cupcakes!", "pics": null}}]}