{"name": "momotaro-chicago-3", "reviews": [{"review": {"des": "Momotaro's amazing food is matched with exceptional service. I took my boyfriend here for his birthday the other day and it was a great experience! The restaurant is beautiful and very well decorated. It is modern and trendy, but still maintains a cozy and comfortable ambience. Our server was really nice and made us feel special, including thoughtful touches like providing my boyfriend with a personalized menu, wishing him happy birthday! I started the meal with the mezcal cocktail- smoky, plummy. It was really nice and smooth, not too sweet, and I appreciated that it wasn't on ice. <br><br>We had tons of food. We had the chahan (my favorite), aburi buri, sake no sugi, shishito, washugyu, hokkaido hotate, momomake, and kani jomaki. It was too much food, but we were able to take some of it home. The chahan was my favorite. I know what you're thinking... it's just fried rice... but it's really great and I'm a sucker for stone bowls. The aburi buri was also really light and refreshing. It had lots of flavors and was a great way to start the meal. The shishito pepper skewers were a larger portion than we anticipated. We had a few spicy peppers, which surprised us! The washugyu was a little salty for me, but my boyfriend enjoyed it. I enjoyed the scallops but my boyfriend didn't. I think he was concerned about eating raw scallop. And the salmon was much larger than I expected it to be, on the salty side, good flavor, and very savory and tender. <br><br>Finally, we ordered two of the Momotaro crunch for dessert! It was hands down my favorite part of the meal. Everything was great, but my mouth only started watering now, as I wrote about this dessert. The matcha ganache was like cool ice cream and went very well with the chocolate. I loved the texture too! They also brought an ice cream popsicle for his birthday! The vanilla ice cream was delicious. <br><br>I'd definitely recommend Momotaro to anyone who's looking to treat themselves! The food is amazing and the service is exceptional. I went into it deciding that I would order everything I wanted to try and leave without regrets. It was so much fun!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/tRYXMsFIE6RQ_q1MOksUKQ/348s.jpg", "caption": "Momotaro crunch (bottom, an absolute MUST order!) and ice cream popsicle (top). We couldn't wait to dig in!"}]}}, {"review": {"des": "I don't understand how this place has 4 stars. Came here 2 weeks ago and was severely disappointed. We ordered the 'A5 miyazaki steak strip' and 'chef's seasonal nigiri selection'. The steak was probably the most disappointing of all, especially with its premium price tag of $100. I have never had anything SO SALTY in my entire life. The meat cut/quality was amazing.... but they ruined this amazing piece of steak by caking the whole thing in salt. Ugh. Soooooo disappointing. We literally had to bite off the outer layer and spit it out because it was unbearable. You would think that this overseasoning was just a fluke. Well..... the chef's nigiri selection was no better. The fish itself was good, but the rice underneath was doused in vinegar--couldn't taste anything but the vinegar. It was so overpowering that no soy sauce was needed. <br><br>To be fair the servers/manager here were fantastic. They were very attentive and even asked us if anything was wrong when we didn't entirely finish our A5 steak. They comped $20 off the bill as an apology. Hopefully they had also taken our comments back to the chefs.<br><br>Sadly, I don't think this place deserves one of the top places to go for sushi in Chicago. Do yourself a favor and pick anywhere else.", "pics": null}}, {"review": {"des": "Overall: Momotaro had high expectations and, minus our unfortunate service, met and exceeded them.<br><br>The good: Atmosphere is spot on. Classy with an obvious but tasteful Japanese vibe. Everything from the lighting to the table presentation screams quality, and it achieves it. The menu is varied - Sushi, cold plates, warm plates, small and large, with ever selection astounding. The waygu beef was both of our favorites, but the nigiri choices, Unagi donburi, and the equally tasty figgy puff dessert were all special in their own way.<br><br>The not-so-good: Our server was borderline bad, which was unfortunate because it was the only downfall of the evening. Several times throughout the night we were stranded waiting to order, asking bussers and other waiters for our guy. He also wasn't helpful with explaining the menu until forced to do so.<br><br>Food/Drink: 9/10<br>Atmosphere: 10/10<br>Service: 7/10", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/J5ZAynU5UmTE92fY7ZVfmQ/348s.jpg", "caption": "Figgy puff"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/7UdaGmOkgTMuc5QKq0hNGQ/168s.jpg", "caption": "Medium bluefin tuna and salmon"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/eAggqXl5b_j7fR3aJMmRKw/168s.jpg", "caption": "Iwashi - grilled sardines"}]}}, {"review": {"des": "I used to love Momotaro and had visited many times since they opened, but my experiences over the past year have been generally disappointing. The last time the chef's menu was fairly mediocre with several pieces tasting very fishy, poor quality uni and the scallops that were slimy. Given Momotaro's high price point, it makes more sense now to splurge at Omakase Yume or Kyoten.", "pics": null}}, {"review": {"des": "My friend and I split a few dishes that were fantastic. We started with the Miso Yasai which included amazing mushrooms and a miso dressing that was next level good. <br>We also split the Chirashi which was a bowl of three different types of fish, cubed, and set on top of rice. This was a fantastic starter and the rice is flavored well. I typically prefer a more subtle rice but it was nice with the fish.<br>We both split the Chef's Seasonable Sashimi Selection. This dish is so easy to split because each fish comes in two cuts so each person got one. This was the perfect meal. The fish were fantastic (some better than others) and the presentation was beautiful. <br>Overall, it was a great experience with good service and a great menu. I am not completely sure the experience was worth the price but it is definitely worth a visit.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/D9v2i8dThPWFQ8X4XWT36Q/348s.jpg", "caption": "Birthday Ice Cream"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/WzIgkh_VUUbBRUT86ylxFw/168s.jpg", "caption": "Chirashi and Miso Yasai"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ELRWLMfihcu_84ok3X8iew/168s.jpg", "caption": "Chef's Seasonal Sashimi Selection (Nov. 2018)"}]}}, {"review": {"des": "Some of the better Japanese style sushi in Chicago. Unfortunately, for one of the most significant cities in the world, Chicago is absolutely terrible for sushi.<br><br>There are other spots in town that do it worse, much worse. For example, a few cheaper eateries serve fish as sashimi that I would have second thoughts about eating cooked. Momotaro doesn't do that.<br><br>The decor here is excellent. Service is swift and polite. Everything is a great experience except for the food itself.<br><br>We intended on ordering more, much more. But after ordering the 60 dollar seasonal sashimi, we quickly realized that we have had much better for less than 30 dollars in California. The quality of the fish itself could be bested in a 23 dollar chirashi bowl in LA or a 16 dollar one in Taiwan. The food was presented and garnished well, but the taste itself was lackluster for all they tried to do with it. Sushi can be simple. If you can get better results putting a dab of wasabi on vinegared rice and putting a piece of raw fish over it, then you should be doing that instead of putting on pretty garnishes that do nothing to enhance the flavour.<br><br>Their robata items may be better, but the sushi, both traditional and vegetarian, soured our impression so badly that we decided to eat elsewhere for the rest of the night.<br><br>This is sushi for people who don't eat sushi. Unfortunately, the state of Japanese food in this city is at a point where Momotaro is a relative premium in comparison. Sushi in smaller Southern Chinese cities is a running joke among people, but even that would compare well compared to what's available in Chicago. If you grew up in the Midwest and never had sushi elsewhere, Momotaro is a great restaurant to try it out. If you like sushi, prepare to not only be sorely disappointed but also pay far too much money for what you get.<br><br>In truth, we had a one star experience in terms of food, but I don't want to condemn a restaurant for something that only makes up half their menu. Their Izakaya Restaurant in the basement is a much better experience.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Y-fVrnabwqXbKPB6h2WKiA/168s.jpg", "caption": "Bland, boring, but well instagrammable. Eat with your eyes."}]}}, {"review": {"des": "Amazing food. A bit pricey.<br><br>Came here back in the summer and enjoyed the experience. Sampled the chef's choice nigiri they had, and felt like the fish melted in my mouth. Great service. <br><br>Overall, would come again on special occasions.", "pics": null}}, {"review": {"des": "I really loved the ambience at Momotaro. Very chic and trendy. We ordered the chef's choice nigiri (9 pieces for $59) - everything was fresh and flavors were paired very nicely. We then ordered aburi sake nigiri pieces and the chili tuna roll. For the price point, I expected more out of their rolls. It's 6 small pieces and the tuna was kind of chopped up instead of being nice big chunks. It didn't taste much different from a lower end sushi restaurant's spicy tuna roll. We also ordered a couple of drinks - I had the housemade raspberry yuzu soda and added vodka. On the menu, the soda is listed is $5 and the bottom says $8 with vodka, gin, or rum. I took that to mean it's $8 total with a shot of vodka instead if $5, turns out it's $13 for that drink. The soda is good but it's not worth it at all, given you can barely taste any alcohol in it.<br><br>Overall, the restaurant is very good for pieces of fresh fish, but the prices are very West Loop. Is it the best sushi I've ever had? No. But it does the job and it's a pretty date night spot.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/VXmxCG4yrTPCX-AaCddaqQ/168s.jpg", "caption": "Chili tuna roll"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/c1M3wZ0quI5I86iFKYuBxg/168s.jpg", "caption": "Chef's choice"}]}}, {"review": {"des": "Da Lobstaaaaaaaa<br><br>My favorite thing here was... can you guess? <br><br>Da lobstaaaaaaaa!!!!<br><br>My boyfriend brought me here for my birthday dinner. I love how they put your name on the menu and bring you your personal dessert, super cute! My boyfriend had reservations for us and they couldn't really accommodate which was very disappointing. People plan a lot to eat at a place like this. It's usually for special occasions and what not. He was very let down. He called earlier to let them know it was a birthday and he requested a booth. They said they'd be able to accommodate. When we got there we were offered seats at the bar or a regular table. We almost left. I figured since we came all the way there and he had this planned that we would stay. It was really good food but nothing that would make me want to go back. <br><br>I'd say go, but just to say you went type thing.", "pics": null}}, {"review": {"des": "Overrated, over seasoned, and over priced. I would not rate this as one of the best sushi joints. Maybe if they figured out how to keep the salt away from the chefs things might be ok. Go elsewhere and thank me later.", "pics": null}}, {"review": {"des": "Good food in an excellent ambiance, with good service. A bit on the pricey side for what you get, but maybe I'm not used to the premium paid on Japanese food in Chicago.<br><br>Food:<br>- Otoro Sashimi (5/5) - Fresh!<br>- Momo Tartare (4/5) - Pretty good appetizer, but a little bit salty<br>- Washugyu (4/5) - Juicy and tasty, but a bit pricey for what you get<br>- Curry Udon (5/5) - Savory and filling, definitely one of the better dishes<br>- Negi Hamachi Roll (3/5) - Good... but not $12 good. Presentation and taste similar to your run of the mill sushi joints.<br><br>Service:<br>Very attentive and thorough in their explanations.<br><br>Ambiance:<br>Well-decorated and easy to have a conversation - good for business dinners, dates, and pretty much anything else.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/SURQcU4Z78s26L6VyNbzag/348s.jpg", "caption": "Curry Udon"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/HmSI6pMDM0ifAEtBwW9BmA/168s.jpg", "caption": "Momo Tartare"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/cXGMdGplcyYJ6jOgrBl2bg/168s.jpg", "caption": "Otoro Sashimi"}]}}, {"review": {"des": "This is my favorite restaurant in Chicago, bar none. It's surprising I haven't written a review until now, since I've consistently visited 1-2x per month for the last year and a half. <br><br>It's super-popular with the \"in\" crowd, so be sure to make a reservation, as it's almost certain to be full, regardless of the day. Dress is \"smart casual\" so try and avoid sneakers, though this is a hotspot for celebs in Chicago, so they're pretty lax about dress code. The decor is exceptional, making it a perfect place for a date, or an evening out with friends. Not a place for kids. They are typically prompt with reservations, though you may have to wait 10-15 minutes upon arrival.<br><br>There's three parts to the restaurant. The downstairs, known as the \"Izakaya\" is first-come, first-serve, and has a limited menu, with some of the same items as the main dining room. The dining room is deceptively large, and the ambiance is just incredible. They roll the sushi right in the middle of the restaurant, which is surely a treat to watch. There is also an upstairs where they house private parties if you're looking for an eloquent place to host an event. <br><br>Sake list is extensive. I typically get the Bride of the Box, but they have something for everyone, depending on your palate. <br><br>The food is EXCEPTIONAL. I eat at Nobu, and am a sushi fanatic. I haven't been to Momofuku in nyc, but I still swear that this is the best sushi I've ever had. Rumor has it they fly in the fish several times per week directly from Japan. Hard to know if this is true. No matter what you do, make sure you get the Otoro Nigiri, Washugyu, and the Momomaki roll. They're sure to be a hit. Some of my other favorites are the Zuke Salmon Roll, Tekka Maki Roll, Shishto peppers and Age Dashi Tofu. If you're looking for a real treat, the Imperial Strip is the best dish on the menu, and the presentation is incredible. Don't skip out on the dessert either; the Momo Crunch is a nice, sweet, compliment to a savory meal. Everything is primed for sharing, and I recommend 1-2 small plates, 1 roll, and ~2 Nigiri per person. <br><br>In conclusion, this place takes my top spot in all of Chicago. The combination of accessibility (you can get a reservation on a weekend ~2 weeks in advance), ambiance, crowd, food, service, and price-point (you can have everything listed above for ~$120 / pp) makes this a true standout. Great work, undoubtedly will be back soon.", "pics": null}}, {"review": {"des": "Really great environment and excellent food akin to Uchi in Dallas, Houston and Austin but with more of a focus on grilled items. <br><br>I found the environment more foodie centered than competitors such as Roka Akor and the kitchen items are as good as the sushi. There is a streak of creativity here, and they seem to straddle three spheres, sushi bar, izakaya, and moderne.<br><br>I went on a Monday, so many of the items were out of stock. Hamachi Kama, fresh wasabi, and a Japanese hefeweissen on tap etc were tapped out. That said they get a fresh fish shipment from Japan at least once a week and local markets more often, so I picked a notoriously frail day for sushi. I believe there's a NYT article on why not to eat sushi on Mondays which dented the industry!<br><br>The hostesses and service staff are well trained and attentive with an authentic smile. They seem a little overworked here, and I could see they try to cram the patrons. My server was busy with many others, however, other wait staff kept my water full, my plates cleaned, and served the kitchen dishes as they were prepared.<br><br>Here's a rundown on what I had:<br><br>- Belgian Style White Ale Japanese style, so of course the can had a cat on it<br><br>- Uni from Baja, CA and Ikura - I was a little surprised that my gunkan-sushi started the feast, but I didn't complain since they were delicious. They were pre-sauced, and their rice is served room-temperature, with a good amount of mirin and vinegar. A little more flavorful than other places, yet less polished kernels. More earthy. The nori paper was only okay, not crisp enough<br><br>- Shiitake Mushroom Skewers - weirdly, may have been my favorite bite. I noticed that my server gushed over this, when I ordered it, and it turned out great. Just the right amount of spicing, perfectly cooked, creamy yet mushroom-y texture. Loved it. The onion and lemon were a nice touch<br><br>- Yasu Vegetable Plate - very good, yet a bit heavy on the sauce and we need to stop serving okra. Who wants slimy vegetables? Loved the greens, and the baby corn was a fun take on low-end asian cuisine<br><br>- Sashimi platter - very good assortment of sashimi, mostly nicely cut although a few pieces were larger than I would recommend. Nice, fresh shiso leaf, and the plating was well spaced and assorted. The chu-toro and scallop were standouts<br><br>- Maguro bite from kitchen - this had a bit of their crunchy, spicy sauce on top. I found it a bit banal. I don't want spicy tuna even if more Korean spicy sauce inspired<br><br> - Grilled Sardines - these were done perfectly, and I like how you can de-bone it with a quick pull on the tail<br><br>- Salmon with Ikura - the addition of ikura is what attracted me to this item. Very good cut of salmon, I think the kama, since it was very fatty. It is served in a sweet sauce akin to the miso-glazed cod that Nobu has made famous<br><br>All together, an excellent meal. I docked the restaurant a star for being bereft of some key items and the overall especially charged atmosphere which was one step too much and further away from the zen quality one desires in a Japanese restaurant. That said, the food is great, the servers, especially sushi chefs, are personable, and the environment is attractive and dynamic with a hip clientele.", "pics": null}}, {"review": {"des": "I took the wife here for her birthday as we have heard many great things from everyone who came. We were able to find rsvp same day on a Tuesday night, but it was a late one at 845p. That didn't really bother us as we knew we both knew we wanted Momotaro or nothing. Parking in the area can be somewhat difficult, but we did manage to find something almost across the street after 5 minutes of searching.<br><br>Right as we walked into the restaurant, the ambience is perfect for date night. Service is extremely attentive and they explained everything thoroughly and made extremely good recommendations. It is actually perfect to come with just 2 people, but I think 3 is the best because their portions are meant for 2-3 people. <br><br>For cold, we started with the Miyazaki Beef and Raibu Kani. Both were amazing, but my favorite is the Raibu Kani, which is a live Dungeness crab with vegetable kakiage to give it a good tempura crunch. For hot, we went with the Curry Udon and Mentaiko Spaghetti. I would honestly recommend both as they are both super tasty and amazing. Curry Udon is pretty well sized compared to the other dishes. Honestly, everything here is extremely good. We haven't had anything that tasted okay or average. Everything is above average! We also tried the Washugyu, Aji Yakusugi (highly recommended), A5 Ebi Uni Maguro, Kani Jomaki, and Momomaki. <br><br>This ended up being the perfect evening for a birthday/date night dinner. We are glad we finally had a chance to try Momotaro and we will definitely be back in the future.", "pics": null}}, {"review": {"des": "Had the pleasure of coming in to enjoy a drink and a few things to eat. We sat at the sushi bar right away on a Friday night around 8:30.<br><br>We got these drinks... forgot they were called, but a matcha drink... and they were delicious! <br><br>We ordered a couple of rolls, one of them being the big eye tuna... very good!! Had the agedashi tofu, broth was amazing. These mini tacos were really good too. <br><br>Overall we had a nice experience and the food was good. Def want to come back and have a full dinner. They also have a bar downstairs that have a separate menu too.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/QKYN-mAv-S-qJ-blE8HY4g/168s.jpg", "caption": "Matcha drink (alcohol)"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/AHVjrwp8wbKfJW_DOuliwQ/168s.jpg", "caption": "Sushi... the left is the big eye"}]}}, {"review": {"des": "Great fresh sushi<br>Beautiful presentation<br>Great ambiance<br>Beautifully attended to our group in a private room. <br><br>Great cocktails!<br><br>Would definitely go back for a date night.", "pics": null}}, {"review": {"des": "I was here for a private dinner this time and, again, dinner was great and everything I had was tasty. I was able to try a large variety of items and the presentation was on point.<br><br>Can't really go wrong with this place. If you are looking for good and reliable modern Japanese food with trendy and upscale ambiance, Momotaro is your place.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/wuWJ_yt9J_9hEBT8qMIwfg/348s.jpg", "caption": "Nama Chocolate Tart"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/2LrGEqEV_Nsoi5RXK6_4gw/168s.jpg", "caption": "Black currant mochi"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ufJWl0DcCEFJWPEQiRX7bg/168s.jpg", "caption": "Charred wagyu steak and Shiitake"}]}}, {"review": {"des": "This place is unreal. I went with a group of 6 and everything we ordered was amazing. They sent us out some free appetizers for our table wait being long and the shiitake mushrooms( which I wouldn't normally order) we're amazing!!! All the fish was was so so fresh. My favorite thing was the akami To Negi Toro, the tuna melts in your mouth. I will 100% be back. Can't wait to explore the menu further.", "pics": null}}, {"review": {"des": "Came here for our anniversary dinner and was met with complimentary champagne as well as a custom menu that said Happy Anniversary!<br><br>Food:<br>- Momomaki: 4/5 tasty flavor combination! But not wow. <br>- Chutoro (fatty tuna): 5/5 melts in your mouth just like sushi in Japan. Recommend nigiri style. <br>- Otoro (super fatty tuna): 4/5 a little too fatty for my taste<br>- Sake (Salmon): 4/5 3 pc per order. Good. <br>- Curry Udon: 5/5 WOW the udon consistency was just right. So good. The curry has a good kick too. Recommend this. <br>- Mentaiko Spaghetti: 3.5/5 good flavors but the noodles itself reminded me of boxed pasta...<br>- Momotaro Crunch: 5/5 you'd think the highlight would be the matcha filling but no the chocolate yoooo. <br><br>Service: On point. Many of the staff wished us a happy anniversary. <br><br>Ambiance: Very hip. Dress up to fit in.", "pics": null}}, {"review": {"des": "Celebrate a birthday here and was so surprised at their level of service! They greeted the birthday immediately when we walked in and wished him a happy birthday. Definitely wasn't expecting that! We were also presented with a special menu with a birthday message printed on top. Cute! <br><br>Can't remember everything we ate because we ordered so many items but we definitely enjoyed everything. I loved the crab salad and the pasta dish. The tomato and milk bread appetizer was also deliciously interesting. The fish we ordered came out fresh and beautifully plated and presented. Service was so wonderful and it was just a lovely dinner overall. Ended our meal with a matcha cookie that tasted like a matcha kitkat. Wanted to order about a hundred of those, they were so good! Really enjoyed a nice evening here!", "pics": null}}, {"review": {"des": "Momotaro is the best Japanese restaurant I have been to so far in Chicago. The fish is unbelievable fresh and the sushi is delicious. However, the real winners for me here are the appetizers and small plates. The wagyu was a little too salty but very flavorful. The salmon was literally unbelievable. Do not joke around with this rec. You have to order the salmon!!! You won't regret it. The dessert was yummy and so was the wine. The staff was very friendly making this dinner a very enjoyable experience. I am eager to return!", "pics": null}}, {"review": {"des": "Restaurant's ambience is quite nice, waiters are friendly and super attentive and foods serve were fantastic. I ordered their popular dishes so there may be lots of reviews on it already. However, I would like to point out Momotaro's dessert section. This section completely blew my friends and my expectations!! Beyond good and it gets to the point where on of my friends say \"I would honestly stand up right now just to give this two desserts an around of applause\". Awesome experience in Momotaro! Would go here again! And especially for their dessertss", "pics": null}}, {"review": {"des": "This review pains me as I know I am giving three stars to a restaurant that otherwise deserves a four. Headline - great food, and the non-sushi items were likely the best - but service (at least on this particular occasion) was disappointing. We waited 45 min at our table before we could order! :( *sad*<br><br>Food was inventive and very tasty. I am a huge maki fan and will occasionally delight myself in nigiri as well, but Momotaro's sushi was not the highlight of the meal. The tomato tartare was a crowd favourite and will be hailed by vegetarians as a successful attempt at making vegetarian dishes that aren't plain or bland. It was so creamy and delicious and didn't taste as prosaic as \"raw tomato\" sounds. So good! Must try! <br><br>Alaskan crab salad was another highlight - the plate was a piece of crab and there is a stick with lemon and cayenne attached to it that makes the dish appear to be a boat - frankly, it's adorable. The crispy textures within the salad are fantastic. Really enjoyed this dish. <br><br>Crunch cookie and torte - both were amazing in different ways. Matcha cookie doesn't sound too unconventional given how trendy matcha is these days but this was so much more than taking a cookie and making it green. It's a light and flaky set of thin chocolate biscuits cushioning a layer of creamy matcha in between. Absolutely delightful. One of my favourite resto desserts, easily, and not so big as to induce guilt after eating. Torte is decadent and creamy - chocolate fans will love this one as it's more of a classic chocolate dish that is just plain and simple good. <br><br>Among the other items we ordered were tuna tartare (if you like tuna this is great), beef dumplings (alright - cold!) and crab (did not try this one but seemed to be a hit across the table). We also had the agedashi tofu which I enjoyed even though it's not necessarily the most \"innovative\" dish (essentially fried tofu sitting in a tub of miso - I like both though so I thought this was fine!)<br><br>Overall - try the tartare and don't skip dessert!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/R-nw2Bv0hM9CYfAI3ltodg/348s.jpg", "caption": "Alaskan crab salad - so beautifully presented and absolutely delicious, must-order!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/A5_5jGBeUYj3Fa53pWQInQ/168s.jpg", "caption": "Taro"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ZKzG7eY4MPSLryrx8x-mZA/168s.jpg", "caption": "Chocolate torte (right) and cookie crunch (left) - fantastic!!!! Loved them both"}]}}, {"review": {"des": "Honestly, I was let down here and it pains me to say that. We made reservations for my husband's late birthday celebration when his family was in town, and I'm disappointed we brought them here. The service was amazing. Our waiter was knowledgeable and attentive, but ultimately, the food was just okay for the price. We had numerous items, with the tuna tartare and chocolate tart dessert being the favorites. The beef rice was tasty and a good size for five people, but that was the only one that felt large enough to us all. We had to double orders, like the hamachi, just so we could all have one bite. The sashimi and food in general was high quality and flavorful, but for the price, it was not worth it. We all left disappointed at the portion sizes and still wanting more. It's not that it's a bad place to eat, just overhyped and overpriced for my expectations.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/gzCZvCzLAIChKvCxJM16vg/348s.jpg", "caption": "Beef rice"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/9zNQtgn7QIwyoEULdgHKPQ/168s.jpg", "caption": "Hamachi"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/l6XYvUuyeNFCm0q9n6p6gQ/168s.jpg", "caption": "Tuna Donburi chips"}]}}, {"review": {"des": "I would give this place 4-star, the environment looks good, service is god, the food could range from 2-5. <br>My favorite is the King crab! Well balanced seasoning doesn't cover the sweetness of crab meat. Another dish I like is the Mentaiko spaghetti. The taste is good and it's not easy to find this kind of dish in other places. Sushi and una-don are all above average.<br>Washugyu is too salty for me, cover the flavor of beef.", "pics": null}}, {"review": {"des": "Decided to take a dinner break to check out this place within a 10hr work day and I'm disappointed y'all! I spent $60 for one six piece maki roll, two Sapporo beers and two peices of shamimi on rice and my last single piece (pictured) took 40 min to come out for one single piece of shamimi on rice! I don't mind paying for expensive sushi if it tastes unique and exotic but all this was is presentation! I decided to hold off on the $35 dollar six piece maki roll they had to try their $18 momomaki roll and it looked pretty and did taste good but not $18 dollars worth more like $9 worth! I'd rather go to other places I know and drop $25 (Like Tanoshi) on a ten piece maki roll that actually tastes unique and fills me up! BOO! You're paying a high price for a presentation when you can get better tasting sushi in the Chicagoland area for cheaper! Sorry!", "pics": null}}, {"review": {"des": "I have been to Momotaro multiple times over the years - I've had dates here; I've celebrated my mom's birthday here; I've brought my out-of-town friends here... Momotaro was such a lovely restaurant that has excellent ambience, my go-to food, and new interesting dishes. However, the most recent visit was a little disappointing... <br><br>We ordered several things - Ogo, Miso Soup, Hatsu, Alaskan King Crab, Yari Ika, Tamago, Kani Jomaki and Tuna Jaga. I am very disappointed with the sushi/Maki this time - both for the taste and wait. We waited a long time for the rolls and our waiter's explanation was that there were 6 Omakase placed right before our order... When we finally got ours, the taste was meh... Funny thing is that their Nigiri, Yari Ika and Tamago, tasted great. <br><br>Other dishes all tasted great. I am a huge fan of their Kush Yaki, especially the beef tongue (my go-to dish); however, they no longer serve that... Hatsu (chicken heart) was tender the flavorful. We ordered another skewer, but I forgot its name (It was grounded meat on top of the shiitake mushroom cap) - mushroom was soaked with meat juice/flavor and every bite was amazing.<br><br>Alaskan King Crab was fantastic! This just became my favorite king crab dish in Chicago. They have the fancy version Miso soup with tofu puffs and mushrooms. <br><br>It may look harsh to give Momotaro a low rating, but it is not an easy thing for me to do since I've had so many memories there. They do have many good dishes; however, I believe good rolls are a must-have thing for any good Japanese restaurants. Given their so-so sushi/maki, all I can give is a 3-star.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/W2qxPBPCHRW1dOMpNTGa2A/348s.jpg", "caption": "Rolls"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Iav6b-0GLL1zT0MeNN6N1A/168s.jpg", "caption": "Ogo"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/0Km5ETIo9dAp4QbFqMgEhQ/168s.jpg", "caption": "Alaskan King Crab"}]}}, {"review": {"des": "Came in late at night and the kitchen was almost closed (but advised that the izakaya opens late), but still decided to stay upstairs for a quick meal.<br><br>As shown in the photos, we ordered a curry udon, chirashi, and raw beef tongue uni as the appetizer. First, the appetizer was extremely salty and I couldn't taste any of the uni and beef tongue (half the bowl was soy sauce, AND used cooking not dipping soysauce which made things worse, sooooo salty) I wouldn't recommend anyone ordering it....Next comes the $23 chirashi, which I always loved, but disappointed. Just look at my photos, four types of cubed sashimi with egg, cucumber, salmon roe (regular chirashi topping), but the portion was a pure disappointment. You'd think it's a lot since the sashimi fully covers the rice, but if you look closely there only 4 pieces of fish which is very little for the price. Truly a disappointment.<br><br>With all that said, the service and ambiance were on par with other restaurants with this price range. Honestly, I almost never give a 2 star and maybe I picked the two worse dishes, but this just doesn't fly with me.<br><br>food 2/5<br>price 2.5/5<br>ambiance 4/5<br>service 4/5", "pics": null}}, {"review": {"des": "Hands down best Japanese sushi place so far in Chicago! If you haven't already, go and check their site and you can tell this place is not some mediocre joint.<br><br>I basically spent $2,000 on dinner in March of 2018 and had a great dining experience. You can easily get carried away if you aren't careful on what you want to eat! Haha<br><br>Jonathan was our waiter and he also offered to setup a menu course for our table as well, if I was not sure what to get. Which is great for those not super well versed in Japanese cuisine<br><br>Chef omakase Nigiri dish was great, it is not typical authentic traditional Nigiri from Japan but a Fusion take on High quality nigiri selected and crafted by the chef. This plate alone was about $59 per person.<br><br>The Wagyu A5 steak was amazingly tender and tasty, exactly what I was expecting once ordered. Price was easily $100 for this dish alone.<br><br>For appetizers, I ordered one pc of sushi of my liking for each person at our table. It may not seem like a lot but after 3-6 plates you will begin to worry! Lol<br><br>The mushroom bowl was a bit saltier than I would have liked but that was the waiters pick. <br><br>IF YOU DO NOT LIKE RAW SEAFOOD, this is not the place for you! I forgot most of the names of what we ordered as we ended up drinking quite a bit as well. The 1000 year old aji whiskey? (Cant remember exact name) came in two price points and In my friends Honest Opinion... the $12-$13 one was basically identical to the $32 one<br><br>Overall expect to spend some time here as the wait is not terribly long for your food but it does roll out a tad slow<br><br>I highly recommend Momotaro if you are ever in town!", "pics": null}}, {"review": {"des": "I find this place to be a bit overrated. I have been to the restaurant and the izakaya.  My latest experience was at the izakaya on Sunday night for the ramen popup.  First of all the hostess couldn't even bother to seat us. Handed me a number and told me to go find the table while other people were shown to their table. Secondly we asked to order an app - the chicken karaage. They said they were out so we ordered the other app option, a broccoli dish that was very good. BUT later on we saw other tables around us getting the chicken dish. Confused why when we were told that they were sold out we asked a waitress about it. She said they were  sold out but then the chef made some more. We were disappointed that they didn't tell us when the chicken became available and check if we still wanted to order some (which we would have).  Another weird part off the night was when my friend wanted to order a 2nd bowl of ramen and the waitress was like I have to check how much time you have at your table. Who says no or maybe to ordering more food?!? I get it- there was a time limit to our table but there is this thing called togo boxes which I am sure my friend would have been fine with getting- if our table time expired.  The good part was that the staff realized that our treatment was not up to par and gave us 2 mini ice cream sandwiches. The person that gave them to us made it a point that we were the ONLY table getting them tonight. Obviously we felt so special (sarcasm).  Either way the miso and curry ramen was good. Will we be back?!? Who knows...", "pics": null}}, {"review": {"des": "First time here and I loved it. Beautiful decor. Basement restaurant with slightly different menu also. Super fresh sushi and unique choices.", "pics": null}}, {"review": {"des": "Writing this review hurts.... I had such high expectations based on reviews and personal references, but to be honest, I found the experience very sub par for a sushi spot.  The decor and ambience is great, and the service is fantastic.  But the food.... it just wasn't good, especially for the price.  Several sushi rolls tasted old and fishy, there was minimal flavor, the rice to seafood ratio was very ricey, and overall, my meal that cost so much more than it should have based on the quality.  I heard such great things about this place, and maybe I just went on an off night, but from my experience, I unfortunately can not recommend this place in good faith.", "pics": null}}, {"review": {"des": "The first two times I went to Momotaro, I would have given it 4, even 5 stars. But the third time is the one that drove me here. I excitedly booked a reservation for a much-needed girls' night with two good friends, assuring them that Momo is *the* best sushi in the city. My two companions are vegetarian, but both previewed the menu and found there would be plenty for them to enjoy.<br><br>The food was pretty tasty, but the service was god awful. They were encouraged to order an avocado-cucumber roll, so they did. Some time passed and they were told that the kitchen had run out of avocado. ...OK, so they ordered the chef's five-piece veggie nigiri. My chef's special nigiri came and went (delicious, but not as good as the previous time I had it) and they were still waiting for theirs. The waiter kept coming over to assure us he \"just\" checked and they were going to get it going \"right away.\" After he did this once or twice, he went ahead and gave us dessert menus to pass the time. We then asked him to check if it was actually coming, he checked and confirmed that they had not yet started. Then why did he tell us they had? It was a bizarre and 45-minute ordeal. We then canceled the order for the veggie nigiri and got the check. <br><br>Everything tasted good. But I do wish they they had given the option to get a third piece of the tomato tartare so we didn't have to awkwardly split the two.<br><br>If you want amazing, innovative sushi/Japanese food, I recommend going to Kai Zan, Arami, or Tanoshii instead. If you want a chic, trendy environment with less great service and food, try Momo.", "pics": null}}, {"review": {"des": "HOLY. COW. The place is actually some of the best quality sushi I've ever had. The atmosphere is intimate while also being chic. We ordered some wine at the bar, which was delicious and smooth. When our table was ready, we were eager to order as the bartender went through the entire menu with us plate by plate, recommending every dish she loved. We ended up ordering a few appetizers, including the wagyu skewers, the Momotaro tartare, the sake no sugi (salmon cooked on cedar), and the raibu kani. We thoroughly enjoyed everything we ordered. The salmon might have been my favorite--It was so warm and flavorful and melted right in your mouth. The raibu kani (aka Dungeness crab), was delicious and came with ikura and vegetables mixed in with some tempura flakes. There was so much texture and flavor in the dish. For my entree, I ordered the momomaki, and It was INCREDIBLE. I'm usually one for very dressed up rolls, inclusive of multiple fish, avocado, and veggies/fruit. This roll was so simple yet so tasty, I could eat It over and over. Finally, we followed It up with the Momotaro crunch dessert, which were basically matcha cookies dipped in chocolate. Everything far exceeded my expectations!! Can't wait to come back.", "pics": null}}, {"review": {"des": "Ok. I think it's still sushi made for white people. Decent quality fish (which is hard to find in Chicago, so I'll give them brownie points for that), but sushi was very overpriced and the rolls tried too hard to be inventive. I just want good quality sushi that isn't trying so hard to be \"trendy\" for people that don't know sushi that well.", "pics": null}}, {"review": {"des": "My fiancee and I were visiting chicago and were recommended here. I'm a huge sushi-lover coming from hong kong island and growing up in vancouver so I have high expectations for seafood/sushi...<br><br>Pros: Atmosphere/decor was nice with high ceilings. Service was fast. Presentation of food was nice. I did enjoy their chocolate tart dessert.<br><br>Cons: We ordered the chef's seasonal nigri selection and negi toro. You get 9 pieces for nigri selection. It was okay - not that flavorful. The negi toro was bland and not memorable. <br>The wagyu skirt steak skewers were way too salty and the curry udon was overpowering in curry flavor, nothing more.<br><br>Our marker for good service is when we don't need to ask for a second round ourselves. I had to ask for my next drink unfortunately.<br><br>Overall, disappointed given all the raving reviews.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/MKTuQ6lo350WY_TEyWRyQg/348s.jpg", "caption": "Curry Udon"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/LMQFScn9FU720UL7QBV7kw/168s.jpg", "caption": "Nama Chocolate Tart"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/HiHwB6oNtnfvrkf7THs6Ng/168s.jpg", "caption": "Chef's Seasonal Nigiri Selection*"}]}}, {"review": {"des": "Ambiance - Trendy, Romantic<br>Service - Good<br>Food - Good place to try sushi & non-sushi Japanese food<br>Reservations - Generally easy to find<br><br>Most ordered on every visit:<br>Tartare - Tomato could not have been more sexier<br>Jidori chicken oysters - Love that mostly for the accompanied yuzu kosho<br>Mentaiko Spaghetti - You cannot not order<br>Sushi/Nigiri - Tuna, Uni, Mackerel<br>Raibu Kani - Good, but slightly salty (gotta try something different)<br><br>Spotted Ming Tsai (chef) here once.<br><br>Will be back for more!!!!", "pics": null}}, {"review": {"des": "I enjoy this place. It has a very nice ambience and the waiter was very attentive. I originally went for my girlfriends birthday so it was nice that they customize the menu to say Happy Birthday to her. I made reservation through open table which was convient and they have call to ensure you're still going to the reservation and texts to ensure you're still going of you are running late. I would say they have exceptional service.<br><br>For food I ordered the nigiri omakase, wagyu don buri, and fisherman something. Overall those dishes alone lift me full and even some to take home. The omakase was very delicious with many different garnishes on top. They were 10 different type of nigiri that was served for the omakase. The don buri was good but more on the salty end and since wagyu was full cook it taste pretty similar to any other beef so I was kind of disappointed. But the fisherman dish had a alot of stuff in it that made it pretty filling. <br><br>Over all it was very good and I would hope to try the other part of momotaro the next time I go", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/6Mex3Z6mQKFpRd1RKa92KQ/168s.jpg", "caption": "Nigiri Omakase w/ garnishes"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/2KUl30UITj0QH87Ht_k-cA/168s.jpg", "caption": "Wagyu Beed Don Buri"}]}}, {"review": {"des": "Be sure to make reservations! I came on a Tuesday night at 7 pm and almost every single table was taken. Good thing we had made reservations about two weeks prior.<br><br>The ambiance is dimly light and fairly romantic. Each dish is meant to be shared where we ordered the age dashi tofu, jidori chicken oysters, mentaiko spaghetti, chirashi, and one order of akami sashimi (one order comes with two pieces). This definitely was enough for two people portion wise. <br><br>Their tofu is housemade where they completely fry the outside of it and comes sprinkled with these delightful mini mushrooms. The jidori chicken oysters were extremely tender - definitely the best chicken skewer I have ever had and would highly recommend. The mentaiko spaghetti was creamy but did not have a very unique flavor. Heads up - their chirashi comes with cubed sashimi instead of the classic slices. On top of the fish being fresh, the rice had the perfect texture with the right ratio of sugar + vinegar.<br><br>Overall, I would highly recommend Momotaro for a date night, a special occasion or if you feel like being a bit fancy.<br><br>Atmosphere: 4/5<br>Service: 4/5<br>Food: 4/5", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/e3YubGfyP5VA4VzrArGDyQ/168s.jpg", "caption": "Akami"}]}}, {"review": {"des": "A5 beef tartare, great spice/sauce with minced A5 beef, great taste. <br><br>Nigiri to sashimi, fresh and tasty. <br><br>Chicken heart and washugyu barbecue, salty but tasty! We tasted without the lemon and sauce at first, both of us thought the barbecue was too salty and greasy, however after we added lemon and sauce, it changed the whole flavor! <br><br>Eel on rice, good taste, served quiet soon when we were still having other dishes. So when we got to eat it the rice was kind of cold. <br><br>Birthday gift was a popsicle, sweetness a little bit overwhelmed. But it was really nice to have a Birthday gift from Momotaro. Matcha chocolate crunch, the cream part inside chocolate was quite sweet, it conquered the taste of Matcha. The strawberry sundae was fine, brownie was quite solid. <br><br>Overall experience was nice, especially the service is nice!", "pics": null}}, {"review": {"des": "We got last minute reservations here and am so glad we did. Everything that came out was a masterpiece in how it looked and tasted. I took pictures but the lighting was dim and they didn't come out so well. These works of art deserve better so I'm not posting them.<br><br>The service was excellent. They kept our bottle of sake chilled and our glasses were never empty. The timing was spot on. The decor was clean, open and spacious. The hostess was welcoming. <br><br>I like the vibe of the diners that were a mix of dressed up and casual.", "pics": null}}, {"review": {"des": "I had such a wonderful experience here and can't believe I hadn't come here sooner. <br><br>I was brought here for my birthday, and it was probably the biggest deal I ever felt at a restaurant. My friend made the reservation and she said Momotaro took the time to call the day prior to ask whose birthday it was so they could print it on a customized menu on the day of. Fast forward to our dinner and we were greeted with birthday wishes here and there--by the hostesses, our waitress and a manager, who stopped by especially to check on us. I'm not usually a fan of the center-of-attention treatment, but the Momotaro staff was so sweet to us I have to give them a shoutout!<br><br>So, service was amazing. Food was also delicious! We ordered two of their specialty nigiri (the Kumamoto Beef & Aburi Beni Toro), the Tsukune Kushi Yaki and a few other plates to share (Anko no Karaage, Kakuni, Momomaki). Everything was delicious--I especially loved the salmon belly nigiri. Best salmon nigiri I've had in Chicago! The Tsukune also delicious and cutely presented with two quail eggs over the top of the skewers. The Anko no Karaage was a little salty, but super crispy on the outside paired with tender fish on the inside. I also ordered the Monk's Journey cocktail--not sweet, not bitter, very refreshing, right down my alley for drinks. <br><br>Definitely be ready to shell out some big money for this place! Wish it wasn't so expensive but definitely will come back on special occasions.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/L5FdfJxDbgaWmhWzWTrGGg/348s.jpg", "caption": "Tsukune"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/wuw8TjuQiZDjI0ybd9gopQ/168s.jpg", "caption": "Anko no Karaage"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/HFuZmxYlOnwfh-Nlq6r73A/168s.jpg", "caption": "Kumamoto Beef to Hotate"}]}}, {"review": {"des": "I could never give this place less than 5 stars. Everything here is amazing. Whenever we have friends, from out of town, visit, we like to take them here. The hot and cold dishes are equally as good and it surprises me everytime. Service is superb. <br><br>The most memorable dish I ate here was the waygu beef. I could have it every day and I'm a \"seafood kind of gal.\" It was a waygu beef kabob, with a spicy, limey, salty concoction to dip in. I want to learn how to make that! <br><br>Don't come here with a budget. Come here with a group of friends willing to spend and share.", "pics": null}}, {"review": {"des": "I was a little apprehensive coming to Momotaro, I was told by a friend that it was the \"best sushi\" he had ever had and we don't generally have palettes that align. <br><br>I arrived before the rest of my party and decided to have a have a drink at the bar. I wasn't sure what I wanted and they had some interesting drinks so the bartender was nice enough to talk to me about what I liked and ended up suggesting the Old Fashioned. Oh my goodness it was hands down the best Old Fashioned I've ever had. They make their own bitters and use a Japanese whisky that really gives it's a smokey taste. It was wonderful! <br><br>Once the rest of our group arrived we were seated, our waitress was very helpful and friendly. She explained to us that it was best to order everything at the beginning of the meal so they are able to keep bringing us dishes. She helped us make selections on sake and dishes, making sure we had a nice range of choices and that it would be enough for our group. <br><br>Everything we had was delicious! I will certainly be back and recommend Momotaro to others!", "pics": null}}, {"review": {"des": "Momotaro came recommended to me by two people who live in Chicago. This upscale Japanese restaurant was very welcoming with their attentive staff, American-Izakaya style interior, and open kitchen format. <br><br>This menu featured similar things you would find at an Izakaya with an American twist. I would also have to say the drinks we got were top notch too. They had a ton of cocktails, but the Dragon Tongue Orchid was one of my favorites of all time. It had the right amount of passionfruit, citrus, and alcohol for a refreshing time!<br><br>Their menu rotates, but at the time some dishes that we ordered that I enjoyed were:<br><br>Aji Yakusugi:<br>The smoked Japanese horse mackerel was served in a closed dish that had a small burning on the inside to give the smokey taste. I think it was the cypress that was burnt to give it a slightly smoked tree accent. The two-piece sushi dish was definitely unique in the sense that I haven't tried a piece of smoked fish on sweet sushi rice. <br><br>Unagi Donburi:<br>A classic dish served in Japan. This definitely had more sauce and seasoning than I'm accustomed to, but in a good sense! I was a bit worried that it might overwhelm the eel too much, but the peppers soaked in the sauce well so we could really taste the classic eel and rice combination.<br><br>Wagyu Beef:<br>The Wagyu beef I believe might be seasonal, but we had it the night we were there. Was it the best ever? Nope, but it definitely passed the mark of \"melt in your mouth\" marbling meat. For the price however, I'd rather save that money to eat Kobe beef in Kobe, Japan.<br><br>I would also like to say that the Uni was fresh and definitely one of the things that they incorporate into many of their dishes.<br><br>Momotaro is a nice place to go to for a special occasion as our meal ended up being ~300 for a party of 4, who wasn't super full at the end.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/HCEGDMXF9phoqUgrMEPG6Q/168s.jpg", "caption": "Beef Skewer"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/3WwnVPMczIF0pMKzKp06qg/168s.jpg", "caption": "Unagi Don"}]}}, {"review": {"des": "Great wine selection, they have special sake selection that tastes more like white wine. <br><br>Great service and ambience. <br><br>However, food is too salty. Even after we sent back some dishes, the new ones that brought to us was still salty.", "pics": null}}, {"review": {"des": "I had a pretty mixed experience coming here.<br>First off, I loved the ambiance and the service.<br>The best part was the skewers. We had ordered the wagyu skirt steak and the chicken heart, and both were amazing. We had tried two more dishes from the cold menu, which were both good. One was a beef tartare and the other one a tuna tartare.<br>I had ordered the Mist of Miyada as a cocktail; it was a bourbon based drink that was delicious.<br><br>The one huge downside of this place was the sushi. I was very disappointed with the sushi. I ordered three rolls. The Zuke salmon roll was decent. But I tried the Negi Toro and the Tuna Jaga, which were both quite bad. I expected world class sushi but it was quite a letdown.<br><br>Anyways, I would still come back to this restaurant, but I would avoid the sushi at all costs.", "pics": null}}, {"review": {"des": "I went to Chicago on business - the business of hunting down the best Japanese food the village of Chicago has to offer (and actual work business). (Hamburger cannot be contained by any one city.) All roads led to Momotaro. I sat at the bar as a \"party of 1,\" but by the end of the meal my Momotaro family felt a bit larger than that. There was the couple fighting at the other side of the bar from me. We didn't so much as talk, but shared that special bond only a good meal can create. There were also the sushi chefs directly in front, dazzling me with their craft as I dazzled them with mine. So OpenTable, when you reserve me a place for one, know that you just don't get it, okay? <br><br>I went kind of all out with ordering from the expansive menu. Let's get the star of the show out of the way before we move onto more quotidian things. The Momotaro tartare is a tower of dense and flavorful sweet sun-dried tomato with Japanese milk bread to soak it all in. It is mastery of vegetarian tartares and will leave you asking, \"more?\" The mentaiko spaghetti with cod roe and an organic egg, is a bit more hit and miss, but certainly an interesting dish. The washugyu, imperial wagyu skirt steak marinated in garlic shoyu, has awesome flavor that really packs a punch. On the sushi front, the salmon belly, spear squid and kumamoto beef from the chef's specialties were all truly interesting and worth the order. I also got a sushi roll, but had to force it into my belly as the capstone on such a large, rich meal.", "pics": null}}, {"review": {"des": "Hands down the best sushi in Chicago, but be prepared to pay for it. Momotaro has consistently impressed me over repeated visits with thoughtfully composed appetizers and small plates, and the highest quality fish I have found in Chicago by a wide margin. They also have a fantastic selection of Sake and rare Japanese Whiskey, which happen to be perfect ingredients in many delicious modern Japanese cocktails.<br><br>The bacon wrapped quail egg skewers are one of our favorite starters, charred to yakitori perfection. The crispy charred bacon wrap gives way to a delicate tender quail egg, where the yolk oozes out and combines with the bacon and Japanese seasoning to deliver big flavor from such a small package.<br><br>My absolute favorite dish, and the reason i come back repeatedly, is the tuna belly. Now most high end Japanese restaurants will serve Maguro and Toro options, but the star at Momotaro is the Chutoro, or the medium fatty tuna belly. Medium-fatty strikes the perfect balance between the high fat and flavor content of Toro, and the smooth texture and complexity of Maguro. The Chutoro sushi is one of the most delicious and satisfying bites of food you will ever put in your mouth, and after your first bite I guarantee you will order more.<br><br>The other sushi selection is fantastic with interesting choices such as amberjack, purple uni, and more. The sushi rolls are also all delicious and well composed with sweet and acid notes to balance the raw fish.<br><br>The desserts are not to be missed either, with an always rotating menu featuring unique house made mochi, cakes, pies and confections, always with a modern Japanese twist.<br><br>Bring your date here, they'll be sure to be impressed.", "pics": null}}, {"review": {"des": "We've always raved about how amazing this place is and how it was our favorite sushi spot in Chicago but we were a bit underwhelmed this last visit. Came here for my fiancé's birthday, had a reservation at 7:30 but wasn't seated until about 8. I get it was a Friday night but what's the point of making a reservation? There also was some confusion and the hostess took us to the wrong table and left us in the middle of the restaurant without saying anything.<br><br>We were then sandwiched between two other tables so it was very tight fit. There wasn't really enough space for food we ordered when it came out. We decided to just stick with sushi this time and got a few rolls and the chef's seasonal nigiri. They were good but not as memorable as our previous visit. Bummer :/<br><br>Still a nice place for a date night but probably no longer gonna be our go to for sushi.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/vTrYCCuM9SNJHXHKMFJuKA/348s.jpg", "caption": "Chef's seasonal nigiri"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/0vHxiX3nAj5Q9pfozhYX9A/168s.jpg", "caption": "Kani jomaki"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/AlpCkhuq_EwtNWJzxfQEtQ/168s.jpg", "caption": "Kani jomaki, momomaki, salmon nigiri"}]}}, {"review": {"des": "Ate at Izakaya for restaurant week 2018 on a Sunday night. The vibe is dark and intimate compared to the upstairs restaurant Momotaro, which is open-concept and modern.<br><br>The restaurant week deal was $33 for three courses. We ordered:<br><br>Chili King Crab Maki: Pretty standard sushi roll, nothing special. A piece that my boyfriend ate still had crab shell in it.<br><br>Fried prawns: This came with two pieces (quite small) but was very delicious, especially when dipped into the sauce<br><br>Uni spaghetti: Really savory with the perfect amount of spice.<br><br>Tekka don buri: Also delicious, the fish roe balls were a nice touch. There was a lot of rice compared to the amount of fish and toppings. <br><br>We also ordered a dish off of the normal menu as well.<br><br>Kakuni ($18): Really delicious soft pieces of fatty pork belly. The black sugar sauce was a great complement. <br><br>For dessert, we got one of each of the matcha ice cream sandwich and brown sugar ice cream sandwich. Being a huge matcha fan, the matcha flavor wasn't that pronounced; I actually enjoyed the brown sugar flavor more. The \"bread\" part of the sandwich was like a thin brownie. <br><br>The total came out to around $55 pp w/ tax and tip.<br><br>Overall, I would highly recommend trying this place out! A lot of the dishes are very unique and creative. Just note the portions are small (I didn't feel super full after all the courses) and it is a bit pricey.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/1DjmHLy76AwQfxggWl6M5w/348s.jpg", "caption": "Fried prawns and Crab Maki"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/S_BoiZ0Ale8bYwq0O0ogbA/168s.jpg", "caption": "Tekka don buri"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/JsCi-BqQ5xwzwrJTbDSWug/168s.jpg", "caption": "Match & brown sugar ice cream sandwich"}]}}, {"review": {"des": "I had the momotaro tartare and gyudon and my friend had the sukiyaki. The plating of the dishes is a delight to the eyes and the food is literally so good. <br><br>I don't know what the paste for the tartare was but it was literally sooo good although we wished that they had more bread to serve with it. <br><br>The gyudon was the best i've ever had and the sukiyaki came with the traditional egg dipping sauce which I actually don't see often in the states. <br><br>i think we were lucky to get a table walk in so might be good to make a reservation in advance!! the receipt also comes in a really cute envelope HAHA", "pics": null}}, {"review": {"des": "Went to Momotaro last Saturday for my wife and I anniversary. From the moment we walked in the staff was attentive and we had several staff members come over to the table to wish us happy anniversary, the menus that they provided even said happy anniversary. Our waiter was excellent and was very informative. Food was amazing.  Overall great experience.", "pics": null}}, {"review": {"des": "Came on a Saturday night with reservations with my family.  We ordered 13 different plates from start to finish.  The menu I'm happy to say has changed since they first opened over five years ago.  The menu is improved in its choices but also less choices it seems.  I have sat both on the main floor and upstairs.  I refer upstairs because there is more space with less tables and less noise.  Also a restroom up there that most people from the main floor don't bother to visit, so no waiting.  The staff was more than helpful with answering questions, timing of all the dishes could be improved because at certain times there was one late and other times three arrived at the same moment.   Would totally come back here again as find it as close to the real thin as possible but it is quite pricey.  They are in alignment with Nobu pricing but without all the fanfare.", "pics": null}}, {"review": {"des": "You know a place is special when after a year, you still dream of the matcha cookies that you ate even though the photos you took were nowhere to be found. You know a place is special when after a year, you still remember the amazing sushi that melted in your mouth and the damage this place did to your wallet. Honestly I would come back to this place again and again, if only I don't live thousands of miles away.", "pics": null}}, {"review": {"des": "We went to Momotaro for our anniversary - and it was amazing! The service was wonderful. They customized a menu with \"Happy Anniversary\" and brought us some complimentary drinks. our server was absolutely lovely.<br><br>I gave 4-stars because while Momotaro is amazing, the sushi is typical of the Midwest. You just can't beat the sushi on the coast! But the food we had was delectable.", "pics": null}}, {"review": {"des": "I was really excited when I came across this place. The menu reminded me of Zuma and there was a decent variety of vegetarian options. It's not everyday you come across this for a Japanese restaurant.<br><br>Being on a college student budget, I arrived with a $20 voucher from OpenTable reservations with a friend. We for our meal we ordered an Agedashi Tofu, Momotaro Tartare (it came highly recommended by our waitress), Shishito Peppers and a baby shiitake maki. As each dish came out, I became more and more frustrated as nothing stood out to me or seemed worth the price tag. <br><br>The agedashi tofu had a beautiful broth, but the tofu itself was not the traditional silken tofu you get. It was much denser. It was also fried almost haphazardly and didn't have a light tempura coat as I hoped. I was just shocked such a fine japanese restaurant had strayed so away from the traditional dish. - 2/5<br><br>The momotaro tartare was also disappointing. Perhaps I had read too many reviews and been recommended it too many times, that my expectations were too high. But the taste wasn't as complex as I was hoping and it was too sweet for my liking. 3/5<br><br>Shishito peppers - Nothing unique. And it wasn't served with enough of the miso mayo. - 2/5<br><br>The baby shiitake maki - Once again, nothing stood out to me as a wow. - 3/5<br><br>For dessert, my friend and I ordered a momotaro crunch. It was light and the chocolate was fine. But there wasn't quite enough matcha for it to find it completely satisfying as an end to a Japanese meal.<br><br>Personally, as a vegetarian, I don't believe Momotaro is worth the price tag. It may be for the meat and fish dishes, but there was something about the restaurant that wasn't nearly as satisfying as I was hoping.", "pics": null}}, {"review": {"des": "Had such a good time here!  Drinks were good.  Food was great!!!   The portion size was bigger than we thought and left very full!  Good vibe & fresh food, but tight space between tables.  Very sincere severs(especially for Chi standard).", "pics": null}}, {"review": {"des": "We had a fantastic experience at Momotaro. My husband and I attended for our 14th wedding anniversary. We were touched when we arrived and they had printed our menus to specially have \"Happy anniversary!\" on them. The manager even came by to thank us for coming in for the occasion. This set the tone for wonderful service throughout the night - our waiter was attentive and incredibly knowledgeable about the dishes.<br><br>As for the food, everything was executed perfectly. The hamachi was some of the best I've ever had (and I've had some fantastic yellowtail from living on the coast). Most of the dishes we had were incredibly creative and while some weren't necessarily anything extraordinary (the unagi donburi, for example) they were still delicious and well worth ordering. It's a testament to a restaurant when they can nail something that seems so simple.<br><br>Our courses:<br>Aburi buri - buncho charred Kyushu Island hamachi with shimeji mushrooms and fried garlic shoyu<br>A5 Miyazaki beef daikon dumplings - wild wasabi, maui onion, shio konbu<br>Unagi donburi - barbecued eel on kanpyo rice with sansho pepper<br>Hirame no karaage - fried Nantucket flounder with chili miso, lotus root, and charred ramps<br>Chili tuna maki - bigeye tuna, sesamu cucumbers, pickled radish (no photo)<br>Negi hamachi - chopped yellowtail hamachi, tokyo scallion (no photo)<br>Aji yakusugi - smoked aji, 1000 year old cypress<br>Sake and hamachi nigiri - salmon and yellowtail<br>Momotaro crunch - matcha ganache between milk and dark chocolate", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Zx9RhtlHJwbaYsSmLFrxEQ/348s.jpg", "caption": "Unagi donburi - barbecued eel on kanpyo rice with sansho pepper"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ZQO2zouA-VlkEYBI-d19Rg/168s.jpg", "caption": "Momotaro crunch - matcha ganache between milk and dark chocolate"}]}}, {"review": {"des": "Visited in April 2018.<br>Good selection of drinks, fashion Japanese Cocktail, Japanese whisky, and descent wine selection.<br><br>The grilled King Salmon was the highlight of the night.", "pics": null}}, {"review": {"des": "Came here on a Tuesday night at around 8pm by myself. It was busy but since I was alone I was able to be seated immediately. <br><br>Unfortunately service here is pretty slow especially as a lone diner. Took approximately 15 minutes to get my order in and about another 35 minutes to get my food (since I was seated at the sushi bar I did see my dinner sitting ready and waiting to be serve for about 5-7 minutes). I must say despite being slow they were pretty friendly and aimed to please. Nonetheless slow service is still slow service. <br><br>Sushi quality is definitely much better than other sushi places in Chicago, but it could be fresher. Rice was pretty good not overly hard, soft, vinegary, or sweet. Omakase here is unique as its heavily garnished. Flavours went well together and was pretty delicious though at times difficult to chew and experience all flavours since the garnishes were piled so high. <br><br>I don't think I would come back for omakase here unless I've exhausted all other omakase restaurants on my hit list in Chicago but I would definitely wouldn't mind trying other entrees here.", "pics": null}}, {"review": {"des": "I have heard the chitter chatter about Monotaro around Chicago for quite some time, but finally tried it for myself recently. I tend to be quite picky when it comes to sushi, and Monotaro did not disappoint. The space is very open and inviting, but some of the smaller tables are quite close to one another - I find this to be a rather common phenomenon among the nicer Chicago restaurants. The service was good, and I never had to look around in an attempt to get our server's attention.<br><br>As for food, we ordered the following: miso soup, shishito, chef's sashimi selection, chili tuna, una-kyu, aji yakusugi, and negi toro. <br><br>I loved the miso soup to start - it was a far more flavorful and interesting approach to miso soup than I have had in the past. The tofu in the miso soup was delicious. I also loved the aji yakusugi nigirizushi, which is smoked in 1000 year cypress. All of the chef's selection sashimi and rolls were enjoyable, and I left the restaurant quite satisfied and eager to return.<br><br>Pro Tip: The restaurant typically receives fresh fish shipments on Tuesdays, so Tuesday or Wednesday may be the best day to visit.", "pics": null}}, {"review": {"des": "After an extensive food crawl around Chicago (including Alinea!, Avent, the purple pig, all the pizza joints, etc), this was by far my favorite meal in Chicago. The atmosphere was very classy yet casual, the service fast and friendly, and the food was amazing. <br><br>Favorite must haves: <br>Alaskan King crab-creative presentation and delicious<br>Chawanmushi-great texture and flavor<br>Chef's special nigiri-very fresh and light<br>Dessert: sesame kurondaiku. OMG this is the best dessert I have ever had. Gently flavorful, perfectly textured, and not too sweet or heavy. A year later, I still think about this dessert every so often. <br><br>The curry udon and aburi buri were good but not my favorite. <br><br>For the price, especially coming from Alinea the night before (!), this was quite a treat. Would definitely come back!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/y3exYGZZ50Hupr1xtOmcoQ/348s.jpg", "caption": "Sesame kurondaiku -best dessert I have ever had"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/zUcZzeI_TS_GawsXSWXDEA/168s.jpg", "caption": "Curry udon"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/YGW6-tqC0a_FnJEjt3BYUw/168s.jpg", "caption": "Chefs special nigiri"}]}}, {"review": {"des": "I've always wanted to checkout this place every since i discovered the magic of Fulton Market, and it did not disappoint.<br><br>I made a reservation for 4 at 8:30 PM on a Sunday through OpenTable and was quick and painless. We were quickly seated and introduced to the menu. <br><br>Our server was extremely awesome and gave us a very thorough introduction of the menu. Everything was seasoned and cooked to perfection, presentations were also extremely on point. Each time a dish comes out, the chef comes out of the kitchen, brings his creation to the table, and presents it right in front of you- it cannot get anymore authentic and special than that. <br><br>My favorite dishes were:<br>Dashi Aged tofu- perfect broth, perfect texture, the mushrooms were awesome.<br>Udon- cooked in beef fat, with tender and thinly sliced beef, juicy, flavorful, rich, delicious.<br>The momo special maki roll- spicy, fresh, full of flavors!<br><br>Between the 4 of us, we ordered 3 makis, 2 skewer dishes, 1 rice dish, 1 udon dish, and a tofu dish. Total turned out to be $140 for four which was a great deal, as we all left with happy full stomach :)<br><br>The highlight was definitely my complimentary birthday dessert, we got free pocky topped with confetti! So fun and definitely finished our meal with a sweet tone.<br><br>Overall, the service, ambiance, food were above my expectation, and well worth the money, especially if you go with a party of four and more to get more variety and share between more people!  DELICIOUS! WOULD COME BACK AGAIN!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/cncgyYA2Mk5rlFIkYiHbBA/348s.jpg", "caption": "Washygyu skewers"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/glavUAbsXUOUz4hqAdvIKw/168s.jpg", "caption": "Gyuniku udon"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/1q12QKawr92vQNmwUk0MMA/168s.jpg", "caption": "Age dashi tofu"}]}}, {"review": {"des": "Definitely one of the best dining experience! I wish I can give them 7 stars.<br><br>We started with two Uni Chawan Mushi. The egg custard and Uni are definitely best friends! They go so well together and bring a fantastic taste. <br><br>We went the easy way by ordering nigiri Omakase. They are literally as good as the ones we had in Tokyo before!<br><br>Imperial Gyu Don was sooo delicious! The super high quality wagyu beef with sweet onions. On the other hand, the pork curry udon was really disappointing.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/nHjg96J9C10UFqSDyOnf4Q/168s.jpg", "caption": "Pork curry noodle. Try to avoid."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/_HQ-OondAfFw_4FK8GWTOg/168s.jpg", "caption": "The best beef don"}]}}, {"review": {"des": "This is the best sushi restaurant I've ever been to. Do not miss the opportunity to eat here. And don't forget to eat at the sushi bar", "pics": null}}, {"review": {"des": "Love this restaurant  - good food, nice ambiance and a special shout out to Devon our server and stories about his dog.  We started with a nice balanced  (expensive) sake which was wonderful.  The ogo seaweed salad was crisp and delicious, unlike the fake bright green generic ones purveyed at other restaurants.  I prefer the black and dark purple seaweed which is what was served.  The chirashi was fresh and tasty.  The best were the roasted shitaki mushrooms on skewers - kushi yaki.  Just perfectly moist and s little toasted on the outside.  Divine.  This topped our evening, as did the tempura shitake roll.  Wonderful.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/5Kf526cViv3KRYG9zQDNjA/348s.jpg", "caption": "Chirashi"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/1X-gJ88Gu0H7Ydz3imYx6Q/168s.jpg", "caption": "Grilled shitake"}]}}, {"review": {"des": "The bartender was great (didn't catch her name) but she made great cocktails. MURAKAMI DAIQUIRI & MONK'S JOURNEY (matcha green tea) were delicious. The sake list was great as well. <br><br>The food:<br>Balfego tuna ($20) - Good <br>Shortrib meatballs ($12) - Good<br>Age dashi tofu ($14) - Decent (I would skip this dish next time)<br>Gyudon - imperial beef with rice ($18) - Exceptional<br>Alaskan king crab ($26) - Good but small portion (1 leg and a small leg) that was shared amongst 4 people. <br>Kumamoto beef to hotate - garlic wagu beef ($12) - Exceptional<br>Sake sashimi ($4) - Good BUT it was frozen in the middle =\\<br>Hamachi ($4) - Fresh and delicious <br>Otoro ($10) - Good EXCEPT there were bones in 2 of the pieces =\\<br>Go Takara - hamachi, spicy tuna, snapper, etc ($24) - Good<br><br>I highly recommend the Gyudon (we ordered 2 of them because it was THAT good) and we ordered more of the Kumamoto beef. Service was exceptional. I would definitely come back and that's saying a lot since there's a lot of restaurants I have on my list to try in downtown.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/WXGfxAW4O0UGUoFyG5Busw/348s.jpg", "caption": "Sake, hamachi and otoro"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/RqpNQZkgU0eBKLbJ0udYRg/168s.jpg", "caption": "Balfego tuna"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/XZYp6I9yIig-K503vKmE0Q/168s.jpg", "caption": "Shortrib meatballs"}]}}, {"review": {"des": "I was super excited about this sushi restaurant since it has their own vegetarian menu! Most places are not very veggie friendly, but this was very different. I came here with two of my colleagues and we ordered various items. <br>I started off with MOMOTARO TARTARE which was amazing. It sounds like a simple dish but the bread was perfectly soft with a tasty tomato spread on top. In addition, I had baby shiitake maki which was good but not phenomenal like the momotaro tartare. It was small and I definitely had room for for the five piece vegetarian nigiri selection which was excellent and unique. The toppings including mushroom, eggplant, daikon. I have never had nigiri before because it is usually topped with fresh fish but this was unique. <br>My friend also ordered several sashimi which she enjoyed. She also had the age dashi tofu which she shared with me and was delicious. The tofu  absorbed the broth very well. She also had the curry udon noodles and if I wasn't vegetarian i would have dug in because it smelled amazing and she ate it all up even though she was full. <br>Our other friend also had their fried rice that had a great presentation of mixing it with the egg at the table. <br>I would definitely recommend this restaurant to my friends and family especially those who are vegetarian.", "pics": null}}, {"review": {"des": "This is one spot in Chicago that lived up to the hype and was 100% worth the expensive bill. <br><br>Order everything. Everything was good. <br><br>Perfect for a date night and even more perfect for a meal that can be expensed on a corporate account. Again, expensive, but worth it.", "pics": null}}, {"review": {"des": "All together a great bar dining experience.  A couple of my friends brought me here while visiting Chicago.  I am a sushi lover!  We came by after dinner elsewhere, \"just for drinks.\"  That never holds true...<br><br>I couldn't resist trying some things on the menu.  <br><br>First, it's a beautifully designed restaurant that caters to all dining needs.  The three level restaurant has an upstairs private room for large parties, ground level table and bar fine dining, and basement level casual dining bar with limited menu. <br><br>We sat at the ground level bar.  The sake selections are numerous and the bartenders are genuinely happy to make your drinks to your liking. <br><br>Needless to say, we had sake, cocktails and a few izakaya dishes.  Everything was delicious.  If I were local, I could see myself frequenting this place!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/7El4oHEIieuEa3tRiIweOA/168s.jpg", "caption": "Madai (sea bream) sashimi"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/KRnILFWQ0IY5dhTngpBKjQ/168s.jpg", "caption": "Baja and Hokaido uni nigiri"}]}}, {"review": {"des": "Loved the food! This was our second time going here! While the first time the food was a miss, it was great this time around! The ambience and service overall is great! Our server was knowledgeable about the menu but one of our dishes took a long time to come out on the table and we weren't informed. We kept waiting and finally had to ask. This was a little weird to me because we did feel a little rushed to order more because our server kept asking if we want to order more and that we should order it all at once so they pace it out for us. Except for the slightly rushed part to order more the service was just fine. I would recommend ordering their mushrooms and the crab appetizer.", "pics": null}}, {"review": {"des": "The food is amazing, but the staff are knowledgeable and hunourous which made for an engaging and delightful experience! Highly recommended!<br>If you are waiting for your table, wait on the lower level where they have a bar with a wide cocktail and sake menu. <br>The bar and restaurant are dimly light, so whilst it is a busy place, it could double as a romantic option.", "pics": null}}, {"review": {"des": "Ate at the Izakaya last Weds. They have an awesome happy hour (6-8) that's 3 courses with a cocktail for $25. I think it's the best deal in the city for the quality, but don't tell anyone. <br><br>Had amazing uni and quail egg shooters. One of the best bites of food I've had in a long time. We also split a bunch of the dishes, like the uni pasta (we like uni) and the beef with gravy. Everything is good, so try whatever you like. <br><br>Cocktails are also pretty good. They're full priced, but fair. Have some interesting Japanese-focused flavors in them as well. <br><br>Will definitely come back for the happy hour.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/62Kng3hLQ6DBXmrMTtvTXA/348s.jpg", "caption": "Uni and quail egg shooters"}]}}, {"review": {"des": "My wife, daughter and I came to the Izakaya at Momotaro for a combination of my wife's birthday and our 23rd anniversary and had a wonderful time with amazing food.<br><br>This is a pricey restaurant, but it was one of those times where we left feeling that we got our money's worth even when we saw the final bill!", "pics": null}}, {"review": {"des": "Had an amazing dinner experience here last weekend. We started out with drinks downstairs when our table wasn't ready - natsujikan and present tense. Both really well presented and tasty. <br><br>Once we sat upstairs we had our waiter give us a run down of the menu and he highly recommended the momotaro tartare. Trust him and me, get this! So different but so incredibly good. We also ordered: shishito peppers (amazing miso dipping sauce), shortrib meatball skewer (two thumbs up), washugyu skewer (melt in your mouth goodness) and a miso soup to start. Definite repeats: tartare and shortrib meatball. For round two we got: otoro nigiri, Baja uni (they were out of hokkaido uni), aji yakosugi and the momomaki. The fish was so fresh and went down smooth like butter. I could have eaten so many more pieces! <br><br>Overall simple but gorgeous spot with tasty drinks and great quality food. Perfect for a special occasion.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/SWA39fwXh0Y2DU6dlxl-gQ/348s.jpg", "caption": "Washugyu"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Uazo6e9JlKlyH_iHIA7UOw/168s.jpg", "caption": "Aji Yukosugi"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/jtC0zb4SKgBEvKOqvX5PRQ/168s.jpg", "caption": "Baja uni (back) and otoro nigiri"}]}}, {"review": {"des": "I loved it. How I am a traditional sushi fan but there were some welcome surprises such as the bacon and quail egg wrapped in bacon that really had nothing to do with sushi but were delicious. The staff was friendly and accommodating and knowledgeable and we had a great night. The service was fast and attentive too!!", "pics": null}}, {"review": {"des": "Highlights: Otoro, wagyu beef sushi, and crab salad. Pretty big place. They take their time bringing out dishes so it doesn't feel overwhelming.", "pics": null}}, {"review": {"des": "OMG. I had been wanting to come to this place for years, and I finally pulled the trigger with a girlfriend who also has an affinity for sushi. Our server was fantastic (I want to say his name is David or Daniel)--he was so knowledgable on everything on the menu and had such an artistic way of describing each one.<br><br>To start, we each ordered the Monk's Journey cocktail. I love matcha, and this was, hands down, one of the best cocktails I've ever had. For food, we ordered the Momotaro Tartare (very good), Anko No Karaage (good, but forgettable), Mentaiko Spaghetti (skip), and Go Takara (FANTASTIC!) I'm blanking on the name of the last item we got but it was also very good. From the food, to the service, to the ambiance, this place was definitely worth recommending.", "pics": null}}, {"review": {"des": "The staff made my father's birthday very special. He smiled at his special menu and his dessert. They accommodated my mother, who required a low table due to her disability. We were seated at a cozy table for six. We ate the dishes as they promptly arrived. I strongly recommend the hot pot, which is similar to beef fried rice. The imperial steak was large enough to share. I also like the passionfruit sorbet with coconut. The jasmine hot tea was wonderful. Various family members enjoyed the different alcoholic mixed drinks as well as wine selection.", "pics": null}}, {"review": {"des": "I was here for Chicago restaurant week and ordered both off the special menu and off their regular menu. While some of the dishes were outstanding, some were very underwhelming. If you do come here, the aburi buri was my favorite thing on the menu. Great flavor -- a really tasty dish. The skirt steak also had a great flavor but a couple slices were a little undercooked for my taste. The tonkatsu was good, but nothing special. I felt that way about the karaage as well. Most dishes are light and not super filling, unless you order up some sushi- it was plenty for me, but some might want more filling plates. The ambiance was nice, but felt a little pretentious for what this place truly is. Service was a little slow, but I somewhat expected that during restaurant week.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/PCwAz5L2dvGVAG02KgiSJQ/348s.jpg", "caption": "Tonkatsu"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/h0mGuojSMdN4y19CFi9MYQ/168s.jpg", "caption": "Skirt steak"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/tvEyjoFur2a-q7JKk76giQ/168s.jpg", "caption": "Old fashioned"}]}}, {"review": {"des": "Great food - went there with my sisters for my dad's birthday. Our server was really nice, and attentive. She had great recommendations for wine. <br><br>One thing that was kind of annoying was that the hostess wouldn't seat us while we were waiting for my dad. Our reservation was at 6 and we arrived at 5:57 to a pretty empty restaurant with our dad five minutes away. The hostess made a big deal about not seating us unless we were \"actively ordering.\" I would understand this if they were really busy, and we didn't have a reservation. Ok whatever. After our dad arrived and we sat down, our server didn't even come by for five minutes. So even if we had sat down without our dad, we wouldn't have been able to \"actively order\" without him anyway! No big deal, just kind sullied an otherwise great experience!", "pics": null}}, {"review": {"des": "Wow. Wow. Wow. Delicious food on the separate vegetarian menu. Great place for a business dinner (classy, clean, tasty, expensive) where everyone will leave happy!!<br><br>I had thought Shizen in San Francisco was the only lace in the US that could do vegetarian Japanese food well, but this place proved me wrong. I had a delicious, filling dinner with items from the vegetarian menu that felt more traditional than what I'd get from a vegan/creative sushi place in SF: <br><br>Agedashi tofu (vegetarian) - there are two versions of this so get the one without Bonito flakes! Warm, delicious, soft tofu cooked in a Japanese style<br><br>Momotaro Tartare - simple but delicious dish primarily made out of bread and tomatoes <br><br>Chef's vegetarian nigiri tasting - classic Japanese flavors without the fish/meat. Subtle but delightful flavors<br><br>Eggplant sushi - great combination of fried eggplant with other ingredients made this something that even the carnivores grabbed for<br><br>I chose to come here instead of check out the fireworks on Navy Pier and do not regret it at all! I had a wonderful time and can't wait to come back! Great job with having vegetarian options!!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ddrQeWkybfOOEur8kp2r4w/348s.jpg", "caption": "Vegetarian menu is delicious!!!! Server also pointed out vegan items."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/dgHmiTw0Sc9qbla02d8F2A/168s.jpg", "caption": "Momotaro tartare - delicious and vegetarian."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/S1X3tFknCbwEF-DXR8a_Fg/168s.jpg", "caption": "Chef's vegetarian nigiri. Thoughtful in a classic way. Loved it."}]}}, {"review": {"des": "It only took one meal to make this one of my new favorites in Chicago. I was a little skeptical at first, having dined at other upscale Japanese restaurants just to have a meal that was reminiscent of something that could be obtained at neighborhood restaurant, lacking that special \"wow\" expectation that comes with the elevated price. That was certainly not our experience at Momotaro. Each dish was special, a combination of flavors many of which I haven't had blended so well before. The ingredients were of the highest quality, having some of the best wagyu, uni, monkfish that I've had. We will certainly be back", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/xDne43B1vW1ki0Ste3P8YQ/348s.jpg", "caption": "Hokkaido Hotate on the lower left, kumamoto beef to hotate on lower right. Momomaki and Una-kyu above"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/7wqHsiyQkeTr9XZA4coBJA/168s.jpg", "caption": "Heritage pork curry udon. Super yummy"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/dkYttQk-y33fY3y8gADxjA/168s.jpg", "caption": "Mitoburo. Lots of bold flavors here with the spicy mustard on the side"}]}}, {"review": {"des": "Honest review: didnt like it nothing blew me away. The sushi is pretty plain nothing that u cant get somewhere else for being revered  as the best sushi at least do things different and atleast deliver that promise for being the best the service was okay nothing special didnt give good recommendations didnt describe all the food n took away utencils and didnt give new ones took away the hotsauce that they charged for when we still eating n the wasabi i paid for n like we were done eating and waited forever to order dessert<br>the only thing i thought was worth ordering again was the Hotate and the Brown butter piroquettes theres alot better places that are cheaper n tastier u dont need to spend a fortune for basic food my favorite sushi place is still kaizan <br><br>Mentaiko Spaghetti 15$ didnt like it not as good as mott street. this needed texture really badly and needed something to make it more decadent and needed more of a pop was very bland<br><br>Aji yakusugi 12$ (Smoked fish) meh good but thought it was gonna be different the smoke just added smell didnt add any flavor to it <br><br>Curry Udon 19$ (be warned its supper hot when it comes to the table give it a minute to cool down) good but curry was not home made which is disappointing since this restaurant is so expensive. theres pork in here with shisto peppers and theres like a cabbage salad on top. My favorite part is the shisto peppers cause it adds heat n mixed with the curry sauce makes it taste so good just no knife so hard to cut it the salad added some sweetness to it which was good i would order this again jus make the curry from scratch put more shisto peppers n more salad on it<br><br>Hotate $18 really tasty i love raw scallops there great texturally and have a great sweetness to them its a good dish but is very one dimensional all the components are sour so it goes well with the sweet scallops however this dish needs some heat to counter act that and something salty too n this dish needs texture badly <br><br>Live dungeness rice $28 good but needed more uni. The risotto texture was perfect supper creamy without being mushy. The crab adds a wonderful sweet component and the veggies add freshness theres like one uni on top which adds saltyness and brinyness i added wasabi and hotsauce and soysauce to make it taste better so it was lacking complexity  <br><br>Ogo $6 (seaweed salad)<br>I was surprised but this was really good. The seaweed has a nice briny salty taste to it and the dressing is sweet and acidic to cut through the brinyness my only complaint add some heat and texture to it<br><br>Cedar roasted kurodai (seabream) $30 good but i had better fish in my life. The skin was crispy however the way it was put on the plate the skin on the other side got soggy. The fish itself didnt have a grilled flavor or was that flavorful was pretty bland and was overcooked i loved the sauce it tasted like mint was really refreshing just was expecting more since it was 30 bucks no complexity<br><br>Brown butter piroquettes 11$ best dessert of the nite. there kind of like cookies but not exactly i loved that there savory just wish there was more of them and they were small cause there supper crunchy so kinda hard to eat the white chocolate cream adds great sweetness and theres a bunch of acidic components to cut through the sweetness<br><br>Black currant mochi 10$ picture like a pb and j only thing its a kinda basic dessert n the mochi part was unappetizing cause texturally it was supper hard and leathery like fruit roll up", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/M8u9WAUhI2iLHEnlOeFKHg/348s.jpg", "caption": "Bill"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/O4Sb2uvGYeMhI1vcWVZLPw/168s.jpg", "caption": "Mochi 10$ not my fav tastes like pb n j"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Zl52P_o862jV4mONpvRtUw/168s.jpg", "caption": "Mochi $10 tastes like pb n j kinda basic"}]}}, {"review": {"des": "I had dinner here last night with one of my friends and not only was the food delicious but the service was also exceptional. My friend doesn't eat seafood so our waiter was great as explaining what non-seafood dishes to order. His suggestions were amazing. We ordered the miso soup, miso yasai, cahan, and I ordered the tuna sashimi. We also ordered the udon noodles but had to cancel the order being that we were so full from our other dishes. I will definitely go back to try more things!", "pics": null}}, {"review": {"des": "Momotaro made my partner's 30th birthday truly special. Not only did our server greet us with a \"Happy Birthday!\" (he was surprised they knew), they topped off the evening with a complimentary birthday dessert - candle and all. <br><br>The atmosphere and decor is very minimal and romantic. The food was delicious, creative, and beautifully set. The service was bar none. I wish I remembered our server's name to give her a shout out, she deserves one. Kind and attentive. The gentleman that brought our food out was also very pleasant, he made us laugh. <br><br>All in all, it was a wonderful experience. We will be back. Thank you!", "pics": null}}, {"review": {"des": "My friend took me to here & I'm so glad she did!! Momomaki roll is amazing, a must order. Also, don't leave without trying the Chili Mentaiko Spaghetti!!!", "pics": null}}, {"review": {"des": "Everything was great here. Sushi was executed perfectly and fish selection is fresh. Has a great vibe and atmosphere. Highly recommend.", "pics": null}}, {"review": {"des": "Great sushi and cooked options.  Everything was delicious.  We had a delay getting seated and they gave us a few complimentary appetizers.", "pics": null}}, {"review": {"des": "My favorite sushi place ever (even beats the fresh sushi out in Hawaii).  They have their fish flown in daily so it's still fresh (and makes for a pricey meal).<br><br>I love this place so much.  The food and drinks are all so creative and amazing. <br><br>My favorite thing to order here is the otoro sashimi.  All the sashimi just literally melts in your mouth.  One time I was here and they had a special which was otoro tartar...so good.<br>I've tried some of the skewers- the hatsu (chicken heart), shortrib meatballs, and washugyu. The shortrib was my favorite of the skewers.<br>I've tried both the curry udon and the spaghetti.  The udon was a larger order than I imagined.  It came out piping hot.  Both noodle dishes were good.  I'd be ok ordering more nigiri and skipping the noodles in the future though.<br>On to the nigirizushi....I've had the aburi beni toro, Hokkaido hotate, and I think the aji yakusugi.  The first two stood out in my mind.  I remember wanting to order more. <br>The momomaki is the only maki I've tried.  I prefer sticking with the sashimi or nigiri over the rolls here.<br><br>As for drinks...I've had the monk's journey only.  I want to try the other drinks but somehow I keep going back to the same drink. <br><br>Service is always great.  The atmosphere is more romantic.  It's dimly lit inside.  I've always made my reservations on OpenTable about a week ahead of time and haven't had too much trouble getting the time slot I wanted.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/u_dCCq5euqoHYDW6pM0buA/348s.jpg", "caption": "Aburi beni toro, hokkaido hotate and otoro sashimi. 3 things you should order"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/29Zp7ZwhFdmCSOs9FHeTvQ/168s.jpg", "caption": "Curry udon"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/McaR3gBII8RneMEdV1h9Ng/168s.jpg", "caption": "Aji yakusuki"}]}}, {"review": {"des": "Sushi is great. Don't come in even a minute earlier before they open. They kept the door locked until 4:30. I had to knock for them to open the door at 4:30. There were 2 other couples standing outside waiting in the cold. Not something I would ever expect out of a high-end place.", "pics": null}}, {"review": {"des": "I've been coming here for two years and all I can say is wow! I've had sushi all around the world and this is the top place I've ever been to. The food is amazing and the experience is top notch. I need to add though that while I'm sure the other servers are great, you will guarantee yourself an out of this world experience if you request Nam to be your waiter. This man is a culinary prophet. He puts the \"ish\" in fish. Do your self a favor and request to have Nam serve you. You won't be disappointed!", "pics": null}}, {"review": {"des": "Excellent service and even better food. Sushi specials were the best.  Raw octopus and hamachi appetizers were excellent.  Fanciest chirashi bowl ever with edible flowers and its own shoyu. Special cream puff ice cream, black sesame seed custard with fresh figs was the best.  $350 meal (including drinks) but well worth it.", "pics": null}}, {"review": {"des": "This was excellent!!! Ate at the Izakaya for the first day of restaurant week 2018, and it knocked my socks off.<br><br>First course: <br>- chicken karaage with shishito pepper mustard/green sauce - 5/5<br>-aburi buri - 5/5. I was worried this could be a tiny serving size, but it had four very substantial sashimi  pieces <br><br>Second course:<br>- uni spaghetti with squid -3.5/5. I would describe this as a tasty fancy version of buttered noodles with squid rings and one piece of uni on top. <br>- fish of the day (hamachi fish collar marinated for three days in miso): 6/5. If this is the fish of the day, get this!!!! I like to steer clear of hyperbole when it comes to food, but this was the best fish collar I have ever had <br><br>Dessert: <br>- ice cream sandwich - 4/5. Two flavors are offered and tried them both. We both preferred the brown sugar, but the matcha is good if you're looking for something less sweet (still sweet though) <br><br>In addition to the restaurant week menu, we ordered a few rolls/sushi pieces from the Momotaro menu (which is awesome they let you do that). These were excellent as well! Highly recommend this place - will return.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/G4t28JDg1UCqe3BvMhpxcQ/348s.jpg", "caption": "Aburi buri (2018 restaurant week)"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/lCHUwUCXvWYlDdMYxsSClQ/168s.jpg", "caption": "Hamachi collar (2018 restaurant week)"}]}}, {"review": {"des": "Food was terrible, the sushi it's too sour, rice flavorless,  and mean it's hard to read, I won't back again.", "pics": null}}, {"review": {"des": "Highly recommended for vegetarians/vegans! We had a delicious dinner at Momotaro and were thoroughly impressed. They have a separate menu just for vegetarians (with vegan items and items able to be made vegan) and everything we ordered was great. The momotaro tartare, maitake don buri, shiitake maki rolls, and age dashi tofu (house made tofu) specifically were all our favorites. We ended the meal with their sesame cake with salted caramel and it was equally tasty!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/eQNF3cyRZcQxhgZE1ixRaw/348s.jpg", "caption": "Dessert!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/9UmBSCo8h1KjhZJ-aqSH3Q/168s.jpg", "caption": "Age dashi tofu"}]}}, {"review": {"des": "Came with a friend and we shared 2 rolls, a wagyu beef dish, and desert. <br><br>Tea selections are only on the dessert menu so keep that in mind if you want to order tea during dinner. I wish I had known this before I got stuck with plain old green tea. The tea was freshly brewed from leaves in front of me though which is always a plus. <br><br>There were 6 options of rolls (6 pieces each) and the two that we chose were very salty and didn't require soy sauce. We enjoyed them but I wish there was more than 1 salmon option. <br><br>The wagyu beef Don Buri was my favorite dish of our order and enough for sharing for 2-3 people as a side. <br><br>The mochi dessert was good but wasn't traditional mochi. It's made in house and has a gel wrap instead of the usual rice flour powdered wrap. <br><br>Overall the food was good but I am unlikely to return as the sushi didn't impress me that much for the price compared to other upscale sushi restaurants.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/J99yMIyL-Sg-vOoaDT-PPQ/168s.jpg", "caption": "Wagyu don buri"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/gGw9DsurzEoT6R4wX0gIVw/168s.jpg", "caption": "Mochi dessert"}]}}, {"review": {"des": "Nice place to treat youself. Like the kushiyaki mono, grilled king crab grill, hotate and daily special nigiri. Waited a little while for mentaiko<br>spaghetti and received  a service with the momotaro crunch which was really lovely and enjouyable.", "pics": null}}, {"review": {"des": "So this restaurant is one of the best I've experienced in Chicago. If you are coming here and you like sushi, order the Nigiri with garnishes! All the fish was delicious (our favorites were the salmon, scallop, and I think red snapper. But really every piece of fish was FANTASTIC.)  The garnishes are unique and add so much fun and flavor to the dish, too.<br><br>Spaghetti was good too.  It's creamy but not too heavy, but it's just regular pasta with a unique sauce. <br><br>Seaweed salad was delicious and affordable.<br><br>Would not order the hirame appetizer again ($20 for five thin slices of fish with not much creativity in the dish besides it sitting on a tub of ice.  Nigiri or sashimi is a better and tastier deal any day.)<br><br>Service is lovely, and ambience is intimate.  A bit dark for good food photographs. Tables are a little close together, but nothing too distracting.", "pics": null}}]}