{"name": "mon-ami-gabi-chicago", "reviews": [{"review": {"des": "My wife and I stopped at Mon Ami Gabi a couple Sundays ago for brunch on the way to the beach. It was a beautiful day so we sat outside in their sunken patio section. The inside of the restaurant looked really classy as we passed through!<br><br>We were just in Paris a month ago, so I will say their menu is slightly Americanized but there were lots of good options. They first bring you a french baguette with butter and jam as a starter...yum. I ordered the chocolate waffle and my wife got the omelette Lorraine. Both were outstanding! The waffles were the perfect crispiness with really decadent hot fudge drizzled all over. The omelette tasted like onion soup wrapped in an egg blanket. <br><br>Service was very polite and prompt throughout as well. I left very impressed with Mon Ami Gabi, would love to try them for dinner sometime too!", "pics": null}}, {"review": {"des": "Yum steak frites!!!  They are cooked perfectly and it's a pretty good portion.   We got the classic with bernaise sauce and the one with red wine sauce/onions.   Can't tell ya which is better, it's a coin toss. <br><br>Escargot and salad were solid appetizers, but if you're not starving, just the steak frites will do. I probably eat more than the average person and it definitely filled me up.  <br><br>The first time I came here I didn't get the steak frites, I don't even remember what dish I got anymore it wasn't memorable... so just to stress one more time, get the steak frites!<br><br>Very poppin place but the servers do a good job of checking up on you every 15 or so minutes.  Old fashioned wasn't that good, it had no hint of sweetness at all.", "pics": null}}, {"review": {"des": "Mon Ami Gabi is a delicious and comfortable French restaurant tucked right inside the Belsen Stratford Hotel. I was with a group for dinner and drinks. The service is really professional with well trained staff who act like a well oiled machine, taking care of our every need. <br><br>The food was delicious. We had the warm goat cheese in a tomato sauce with a crispy baguette which was scrumptious. The shrimp appetizer was okay, the shrimp were large but slightly overlooked. The chicken liver mousse on the other hand was spectacular. We finished it and ordered a second! I would go back for this appetizer alone. <br><br>Most of us had the filet mignon with frites. The filet came with a giant slab of butter on top, which I could have done without because the meat was like butter itself. Perfectly medium rare, sliced easily, and each bite melted in my mouth. The frites were perfectly crispy and some sitting in the red wine reduction, which was delightful. <br><br>The trio of desserts was okay- the only dessert I would get again was the creme bruleé.<br><br>Overall a really nice French restaurant with great service, nice wine, and a classic French menu that pleased us all.", "pics": null}}, {"review": {"des": "I'm a huge fan of Mon Ami Gabi in Vegas, so when my girl and I made plans to grab dinner in the area I suggested coming here. She was with it and in a few minutes we were pulling into valet. <br><br>It was a warm August night so we sat outside at a corner table. From the start service was a little slow and dare I say, inept. I have found that in Chicago I usually know restaurant menus better than the servers themselves do, but anyways...<br><br>For starters we had the goat cheese and the oysters. Oysters were a nice blend of east and west coast. <br><br>Our main course was comprised of my tomato salad and my girlfriends salmon salad. We indulged and ordered a side of macaroni and cheese! Everything tasted just fine and was satisfying. <br><br>Valet parking at this charming restaurant is $14. Will definitely keep in mind when in the neighborhood again.", "pics": null}}, {"review": {"des": "Ok i am IN LOVE with this place. In a beautiful older apartment building called the Stratford. The restaurant is so intimate and romantic. They bring you out a load of French bread to start with some butter. It's so warm and authentic. Super yummy. We ordered the artichoke which is nothing more than a steamed artichoke. Nothing special not a lot of flavor but good if you like a healthy undressed artichoke! The bottle of red wine we got was also delicious. For dinner, we ordered trout almandine, steak frites, and the skate wing with cauliflower purée, Brussels sprouts, and dates. Everything was melt in your mouth, flavorfully amazing. I loved every bite of everything i took. we also got a lemon creme brûlée that was divine. On our way out, we asked the bartender if they made espresso martinis, and he gave us each a sample of the one he was making coincidentally when we asked! Awesome staff. Will definitely be back.", "pics": null}}, {"review": {"des": "It has been sometime since I have dined at this restaurant. And this does it did not disappoint. The food was outstanding. Having been to Paris and around the world this was authentic if not better than a Parisian bistro in my opinion.  I opted for a sparkling rose which was delicious. I then started with the Caesar salad which is one of the best I've ever had. For my main course I had the prime classic stake with the herb butter and frites.  The meet was so tender he almost didn't need a knife to cut it. I love that they use the butcher block paper and place the French bread on the table which was also amazing. Service was attentive and friendly. I appreciated that they brought the birthday dessert at the end which was a single profiterole.  It really was a great deal. Had no problem making a reservation.  There was a tiny weight just before the reservation time which we did not mine. I can't wait to go back", "pics": null}}, {"review": {"des": "Super swanky/cute French bistro up in the Lincoln park area. I came here for restaurant week with a couple of friends and was pleasantly surprised. <br><br>The ambiance was really calm, although the tables are super close to each other. The service was great despite being a little on the slow end. An elderly woman next to us had an incident and the staff was quick to assist and ensure all were alright, as well as follow up which was really great to see. <br><br>The food was delicious! The French onion soup was amazing. The steak was well cooked and a hearty portion, and the frites that came with it were uniquely cooked to perfection. They also served a trio of desserts which were incredibly rich, but all amazing. It it slightly on the pricier end, but I would definitely come back.", "pics": null}}, {"review": {"des": "Been to this restaurant numerous times, but the service provided by Justy warranted a review.  What a pleasant, sweet, and fantastic server!  Felt like my girlfriend and I were eating dinner with a friend.  She is simply adorable and we love her.  Request Justy if you go here!", "pics": null}}, {"review": {"des": "Mon Ami Gabi offers great service and wonderful French food. We received a warm baguette upon arrival which is greatly appreciated. It was a perfect crunchy texture with a soft interior.<br><br>Crispy Duck Confit - this is an appetizer however it's a full duck leg, served with sauteed onions. This dish was very flavorful with a salty, crispy skin.<br><br>Steak Frites with Bordelaise sauce - well cooked and very tender. Fries were delightfully crunchy.<br><br>Braised Lank Shank - amazing dish and such a large portion. Served with Brussels sprouts and cheesy polenta.<br><br>Overall, this will become one of my \"go-to\" restaurants!", "pics": null}}, {"review": {"des": "Who is this Gabi person? I would like to meet her, kiss her and hug her because I had the best meal ever. We came in on a Tuesday and just loved our experience there. We sat at the bar while we waited for our table and Jake the bartender greeted us with complementary champagne to celebrate our anniversary. We sat and ordered and the food was just heavenly. They gave us a loaf of bread and it was delish. A whole crispy outside, warm inside loaf. We had salmon, eggplant and arugula salad, and scallops. I have to say, the scallops may have been the most amazing scallops I may have eaten which leads me to forgive them the fact that they sliced them in half. Mon Ami Gabi is an LEYE joint so come and rack up your points people and you will not be disappointed.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/xFwr_P3NqTdpBSZ-EDlfkg/348s.jpg", "caption": "Scallops doubled up"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/QDvrkajsiF7JTjPS2lv8LQ/168s.jpg", "caption": "Salmon"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/KxVB-JXv9fS36ZxjeGfQbQ/168s.jpg", "caption": "Eggplant and arugula salad"}]}}, {"review": {"des": "This was a lively Tuesday evening. While there was a corporate promo going on for the month, I'm sure this place is normally pretty busy. We were seated within a few minutes of our reservation, and service was top notch, from our hostess to our server.<br><br>The complimentary French bread was sooo good. I saved some for mopping the sauce of the half order of mussels, which was perfect. The sauce was a little sweeter/different than I'm used to, but still very good. Boo and I both get a filet migon, mines au poivre, his in the Bordeaux. Again, their sauces were a little different, but still highly enjoyable. Only real gripe was that mine was overcooked - medium well nearly done vs. medium. The other was cooked perfectly. Fries were alright. <br><br>Overall, you can get higher quality steak elsewhere, but Mon Ami Gabi is still very good and great bang for your buck. Service was stellar. A great experience.", "pics": null}}, {"review": {"des": "Although Mon Ami Gabi is a Chicago staple, it took me over 7 years of living in the city before I finally visited this restaurant for dinner. My only regret is waiting that long to try this wonderful place!<br><br>The restaurant is located inside of the Belden-Stratford building. As soon as you walk in, take a left and you will see the sign for the restaurant. I highly recommend making a reservation, especially on the weekend. I came here at 6pm on a Friday with a reservation, and the restaurant was already starting to get crowded. Luckily, we were seating in a cozy corner spot away from the hustle and bustle of the bar.<br><br>The meal starts with a loaf of bread being brought to your table. Yes, an entire loaf of delicious, crispy, French bread. Honestly, I could have stopped the meal there with a glass of wine and a few pieces of bread. But of course, we had to sample more of the food. As an appetizer, we ordered the escargot. I personally was not overly impressed with this appetizer, but my friend loved it (I made the mistake of hoping it would be as good as the escargot I ate in France a few years back). For entrees, we ordered the trout almondine and the chicken grand-mere. We did not have to wait long for our food, and everything was delicious. <br><br>Overall, I very much enjoyed Mon Ami Gabi, and look forward to bringing out-of-town guests and friends here for dinner in the future!", "pics": null}}, {"review": {"des": "Last night, I went to join my boyfriend and friend as they finished dinner to help them kill a bottle of wine. Service was lovely and prompt and we ordered dessert. When dropping off the bread pudding, the food runner putting it down grazed my breast with his forearm. No worries, things happen. He apologized and then continued to run the length of his arm down to his hand on my breast when \"removing\" his hand from the table. There was plenty of room at the table, nobody seated next to us, and no reason for any tight quarters that would have made this okay. <br><br>An altogether lovely experience completely ruined. I felt violated, uncomfortable, and embarrassed.", "pics": null}}, {"review": {"des": "Mon Ami Gabi is a classic Parisian style Bistro - it is upscale, but not stuffy.  You walk in and are taken by the charm and ambience of a bistro in Paris with their dark wood pillars and accents interspersed with little chalkboards that have seafood specials written in French.  The tan/beige wall color with the darker wood and larger windows provided that cozy, French ambience.  The lighting is dim making it a perfect space for an intimate friend dinner or romantic date.  The service was excellent on all fronts as well, and the individuals serving the water and running food were very fast.  Our server was also on top of everything and went out of her way to make the experience enjoyable for us.<br><br>Considering that we went to Mon Ami Gabi for Restaurant Week, we decided to go with the Restaurant Week menu for $44 per person.  It was a \"treat yourself\" kind of night.  We both ordered a glass of French wine to compliment the meal (\"when in France\"), and they had a wonderful selection of wine from their rotating daily menu.  I had a glass of the sparkling rosé and my dining companion had the Beaujolais, which was a very mild, red wine.<br><br>A complementary warm baked baguette with a sweet, creamy butter, a carrot vinaigrette salad, and a mushroom tartare were served to start off the dining experience.  There is nothing like a warm baguette with fresh butter to start your meal with.  I love French bread and am all about enjoying your carbs if you can.  To cope with the heaviness though, the carrot vinaigrette salad provided some refreshing zest to the heavy bread and mushroom tartare.  The mushroom tartare was served on a little crostini and was earthy and savory.  I appreciated that it was a mushroom tartare since most places tend to do beef or tuna tartare.  I found it original.  <br><br>For the appetizers, we ordered French Onion Soup and Escargot.  We told the server we were going to share the appetizers so she brought out two different bowls of French Onion Soup for us!  That was very thoughtful of her.  The French Onion soup was basically your gooey, delicious gruyere cheese party on top of the moist, soaked up bread, broth, and caramelized onions.  I only let myself eat this a few times a year and it was worth it.  <br><br>The baked escargot was also extremely satisfying and tasty dish served with a garlic, basil, herb butter.  The escargot texture was perfectly firm and soaked up that heavenly butter, which reminded me of a delightful pesto sauce.  I used the bread to soak it up because that butter should not go to waste!  It was my dining companion's first time eating escargot and it was a success!  This is a great place to try your first escargot since they prepare it perfectly.<br><br>At this point, we were already getting full, but when in Paris, you have to live up to the food challenge.  For our entrées, we ordered the Salmon and Casareccia Pasta.  Both of these were jaw-droppingly delicious.  The Salmon filet had a flaky texture with subtle flavors over a delicate beurre blanc sauce.  It was served with roasted fingerling potatoes.  I think they could have seasoned the potatoes more, but I know they were going for a light, delicate flavor.  The menu description said it was served with a caviar créme fraîche.  There was no créme fraîche (which is fine with me because I don't really like it), but I did ask the server about the caviar because I didn't see it on my plate.  She said it was very small and served in the beurre blanc sauce.  It didn't taste like caviar, nor did it pop in my mouth like caviar so I'm not sure what happened with that.  The caviar issue is my only complaint with the dining experience.<br><br>The Casereccia Pasta was exquisite.  It consisted of a wide variety of mushrooms such as oyster and maitake served in a light truffle oil sauce with hints of lemon.  The truffle oil was a prominent flavor in the dish, which was very much to my liking.  The poached egg in the middle added a delicate creaminess to the light, truffle sauce and the Gran Padano <br><br>You can't enjoy the restaurant week menu without immersing yourself in the desserts at a French restaurant so regardless of how full we were, we still had them.  Their dessert was a combination of their profiterole (pastry with vanilla ice cream in the middle with chocolate generously drizzled on top), vanilla créme brûlée, and chocolate mousse.  I went into a food coma because of this dessert trio, but it was well worth it.  The  double chocolate fudge melting on the ice cream, the thick, decadent chocolate mousse with the little chocolate balls, and the crusty top of the vanilla créme brûlée made me an extremely happy human being.  What an experience!<br><br>I left Mon Ami Gabi stuffed with leftovers, delighted, and excited for the next time I get to set foot in there.  They have so many other delicious items on their menu that I'd like to try.  But it'll have to wait for a celebration or special occasion as it is a pricey restaurant in Lincoln Park.", "pics": null}}, {"review": {"des": "Another perfect dinner on a warm summer night.  We sat on the patio with a nice summer breeze.  Our server, Janet, was very welcoming and efficient.  We enjoyed a bowl of delicious fresh gazpacho along with the Caesar salad  and steak classique to end the weekend.  Thanks to the texted offers, a chocolate mousse that delicately balanced chocolate richness and creaminess was free.  This place NEVER disappoints.", "pics": null}}, {"review": {"des": "Lettuce Entertain You always does a good job with their concepts, and Mon Ami Gabi is no exception. Although it is one of the oldest concepts in the portfolio, it is showing no sign of age. This is probably due to its classic French Brasserie theming, which is perfect.<br><br>As others have mentioned, the French bread served at the start of the meal is 100% authentic.<br><br>We started by sharing the chilled seafood platter, which was a good deal considering all that it included, and was a perfect starter for a table of three.<br><br>The artichoke appetizer is served chilled, which isn't my favorite, and I prefer a mayonnaise based sauce, but my companions like it. I liked my mousse pate, and it was even better with the brioche that accompanied the smoked salmon, which was also excellent.<br><br>The mussels were also good, another classic preparation.<br><br>Trout was just okay, a bit on the dry side, but my Prime New York strip was a top notch steak. As others have mentioned, the accompanying frites are unusually thin, more like ribbons than traditional pomme frites.<br><br>We finished with chocolate mousse that was light and fluffy.<br><br>The wine list is the weak spot of the restaurant. Somewhat logically it is all French. But except for some nice Champagnes there are no great wines on the list. They've obviously made an effort to keep prices below $200, but since the markup is about three times retail, there aren't really any wines on the list that manage a rating above 90 points.<br><br>Service was professional and attentive.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Ujo7_GP0bkpwwN2nyBAOIQ/348s.jpg", "caption": "Mussels"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Hdhf0JvnAURaUKack4PpMA/168s.jpg", "caption": "Trout"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/GKDypjGXOMhi_PdHhEOcow/168s.jpg", "caption": "NY Strip"}]}}, {"review": {"des": "Went here for date night because of how cute the venue and location was. To begin we were given warm fresh bread with butter and some sweet carrots, which was very good. We had the shrimp cocktail which was super filling and fresh. We also had the French onion soup which was good, but if you love salt you may just want to add a little more for yourself.  We were already a little full so we decided to split the steak frites, which was cooked perfectly even for being portioned in half sizes. The fries were very crisp. The best thing about this menu is there macaroni gratin! I'm telling you this is the best Mac and cheese anywhere. Try it yourself! It is not your typically yellow/orange Mac and cheese. I would go back there just to eat this alone.", "pics": null}}, {"review": {"des": "Sunday brunch with an old college friend in Lincoln Park. This place is very popular, with a classy yet slightly stuffy atmosphere, and I seemed to be rubbing shoulders with gentry haha.<br><br>Popular menu item are their varieties of steak frites. I wasn't particularly hungry so I ordered a fruit cup (mediocre and overpriced) but my friend had a delectable, good-sized quiche with a side of salad. I enjoyed, a little too much, the complimentary house baguette that was over a foot long, warm, and came with a homemade fruit jam and light butter. It's been a long time since I last enjoyed such a classic French baguette!<br><br>This is a great spot to visit because you can head right over to the free Lincoln Park Conservatory and the Zoo, which is across the street! Lots of little boutique cafes and eateries alongside the sprawling open park.", "pics": null}}, {"review": {"des": "So this is our go to place for celebrating!! I have only good things to say. The food is amazing. Their drinks are on point, an amazing collection of wine. Location is amazing near the pond in Lincoln Park. The decore is super classy. The staff is always polite and very helpful. It's better to get a reservation ahead for dinner. <br>Let's talk about the food. They bring in a really nice loaf of french bread that is perfectly crisp on the outside and oh so soft inside. The scallop appetizers are our favorite and we always order that, don't miss that one. The escargots are good too. The fish dishes are nice, I've had the salmon, mahi-mahi and the trout. I love their lamb shank too, it's amazingly tender and so perfectly cooked. My husband is fan of their steaks. The half chicken is yummy, juicy and rich. For dessert we usually love their creme brulee and the chocolate mousse cake, but last time we tried the banana bread pudding with Carmel sauce and absolutely loved it, the only thing I did not like on the desert menu was their profiteroles. But other than that I can't think of a single item on the menu I wouldn't enjoy. <br>Absolutely love this place. Definitely give it a try!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/iEByH8tckW25hpmdkKzLvg/348s.jpg", "caption": "Banana bread pudding with Carmel sauce"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/lg7x7MEmVFIhUE8nfqKKBw/168s.jpg", "caption": "Half chicken with truffles and bacon"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/7rc2p6sr-tv6METljtJlLA/168s.jpg", "caption": "Lamb shank"}]}}, {"review": {"des": "Table of 2, with a party of fruit flies<br><br>I want to preface this review on the grounds that the food here tastes incredible. It has nothing to do with the food itself, but rather the experience. My boyfriend and I have been here many times (it helps that he lives about 2 blocks away) and every time we have had a wonderful experience. Until the fateful Friday night.<br><br>I  made a reservation for 7:30pm for this past Friday Night. I work in the loop, live in Logan Square. I worked late on Friday, and rushed to head home and then commute to Lincoln Park in time for our reservation. I wasn't expecting to be waiting 20 minutes, watching other parties that arrived after me, and also had 7:30pm reservations, to be seated before me. Nonetheless, I'm not sure what their internal seating strategy is when multiple parties with the same table size and reservation time come, but that isn't what initially bothered me. I waited 20 minutes so that I can be seated in the bar area. What also bothers me is that I listed my reservation as a \"date\". I would assume that the host/employees would want us to have a rather pleasant date, but alas, we were seated in the bar, watching patrons consume multiple drinks, while at the same time getting louder and louder. I really enjoy yelling across the table when I eat on dates (said no one ever).<br><br>Ok. I got over that. We sat down, server came brought us menus, and we ordered - I ordered a nice glass of bourdeaux, and my boyfriend ordered a Manhattan. Within 1 minute of my glass being filled at the table, did I experience a fruit fly attacking my glass, and plummeting to its death by way of wine drowning. I waited until the server came back to advise of the unpleasant encounter, and was provided a new glass. What resulted in our 1.25 hour dining experience could only be described as sheer anxiety of having fruit flies attack our drinks. I spent the majority of the evening having my one hand on top of the wine glass, watching as fruit flies came nearby. We successfully killed 2 with our hands, and 2 landed in our drinks, which we then scooped out, and swatted at the rest. I cannot speak to the reason why these fruit flies were in the restaurant, but my understanding is that something rotting is close by. Additionally, having fruit flies around you while you try to have an enjoyable, relaxing dinner is very unpleasant. For the amount of money we are spending at this establishment, this should never be an issue.<br><br>If that wasn't enough - the food. I like my meat without any blood in it (a good medium well). When it was time to place my order for the prime steak, I advised that I wanted no red, just a very very light pink line in the middle - typically between a medium and a medium well. I was told that I need to get a medium as if I tell the cooks to make it a medium well, it will be overcooked. I said ok, but again, I want it light pink no blood. The table next to me also ordered the steak the same way, and was told the exact same thing I was told. <br><br>My steak came out first, as we had already finished our appetizer (the French onion soup is delicious). It gets placed in front of me, and all I can see is blood oozing on the bottom of the plate, mixing with the tasty sauce placed on top of the steak. I cut the steak in the middle and what I saw was a steak that was a traditional medium, maybe even closer to a medium rare. The server left before I had a chance to cut my steak, so I had to wait until she came back around to tell her that this was way undercooked. She took it back to get it flash cooked, and brought it out again. I cut the part where I had initially cut, and it wasn't bad. I could live with it. Well, shame on me for choosing that piece to cut, because the rest of the steak was still a nice red. I didn't eat it. I ate a few pieces, and then ate the French fries that accompanied the dish. My boyfriend ended up taking the steak home instead. Fun fact, after I complained about my steak the first time being undercooked, the server came to the table next to me to advise that they put hers in as a medium well. Awesome. <br><br>I couldn't send the steak back, because let's face it - cooking it for a 3rd time would have made the steak hard. Everyone knows that 2 times is the max. So, I enjoyed a night eating expensive food at a loud bar, surrounded by fruit flies, and eating French fries. <br><br>There are many French places in the city, and this one was my favorite. However, after this experience, I'm not sure if we will be coming back. I can deal with the wait time.  I cannot accept specifying this was a date/special occasion and being placed at the bar. I also would never want to be on a date while being surrounded by fruit flies all evening. And the food - maybe my specifications should have been written down, so that I got the steak cooked the way I wanted. It was only a few words that needed to be written down.<br><br>All in all, I am very dissatisfied with this experience. I expected better.", "pics": null}}, {"review": {"des": "We visited Mon Ami Gabi for Sunday brunch with a reservation at 1 pm. Granted the weather wasn't the best, but restaurant was about half full when we arrived. The hostess was really nice and helped us change our reservation to 2 people even though we had made it for more people. <br><br>The food: <br>- My friend started with a mimosa, and I started with a hot chocolate. I thought the mimosa was overpriced for what it was, but given the restaurant was located inside the Belden Stratford - fine. The hot chocolate was not good. It was probably an 8 oz cup with half of it being foam. It tasted like it came out of a packet and it wasn't even mixed well, nowhere as rich as the hot chocolate that you would get from a place like Eataly<br><br>- The baguette, butter and jam were on point. The restaurant gives you a whole baguette in a paper bag and it's perfect for sharing<br><br>- I ordered the Beef Bourguignon Eggs Benedict and my friend ordered the Duck Confit & Brussels Sprouts. Perhaps I should have ordered something I knew I would like, but the Beef Bourguignon Eggs Benedict was just okay. It came on two halves of an English muffin, and two poached eggs. The English muffin was soggy from the sauce, and I thought the bourguignon sauce was say too salty. I maybe saw two small pieces of beef and some mushrooms. The egg was good but how do you mess up a poached egg. <br><br>- My friend's Duck Confit looked delicious - it came withe one duck leg, hash browns, and two sunny-side up eggs. <br><br>The service: <br>- Small complaint, but the waiter didn't come up and clean up the breadcrumbs after we had our baguette. (he eventually did it just before giving us the bill) When they give you a whole loaf, it's really hard to cut it off without having everyone's hands all over it. Our entire table was covered in crumbs and I ate my brunch with crumbs on my sleeves. Hey not saying I'm a perfect eater, but I wish they cleaned up the crumbs after we got our main entree<br><br>The bill was $32 including tip / tax for each of us, and I can honestly say that it was't that great. I'm a little disappointed that this was just an OKAY experience and I really wished that I liked it", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Svae0S2V-gvHwncdwtn0yA/348s.jpg", "caption": "Beef Bourguignon Eggs Benedict - $15.95. It was just OKAY"}]}}, {"review": {"des": "The food: 3/5. I tried a tartare which was the highlight of my meal. The complimentary baguette and frisee salad were good as well. Ratatouille was just ok, a little overdone for my state and pate was so bad, I barely touched it. <br><br>The service: 3/5. The service is indifferent. Everyone seemed rushing, so it was hard to get recommendations out of the waitress. <br><br>Overall: 3/5. Decent but soulless food. With the abundance of great restaurants in Chicago, I'm unlikely to return.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/LqG-_YI2dLdtCEEpYBVdMw/348s.jpg", "caption": "Steak tartare"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/5SBf_stPMntf6KqKOeWBRw/168s.jpg", "caption": "Chicken pate - I don't recommend"}]}}, {"review": {"des": "Wonderful experience from start to finish. The food here is truly delightful. It's largely steak and seafood prepared with delicate care to create flavorful dishes that delight while remaining rather simple. <br><br>The restaurant is quite large but sectioned off into smaller sections of 20-30 seats giving each room section a more intimate feel. Service is attentive and polite without being intrusive.", "pics": null}}, {"review": {"des": "Any self-respecting restaurant goer should have known better than to hit up Mon Ami Gabi on the evening of the Lincoln Park Christmas Market,  but they accepted an 8:30 rez, and they are, after all, a starlet in the  \"Lettuce Entertain You\" constellation.    <br><br>We waited until 9:15pm to be seated for an 8:30 rez.  Front of the house was clearly\" in the weeds\"  and the kitchen wasn't far behind!   We placed an order the mussels to share.  About 10 minutes later, the server informed us that there were only a 1/2 order left. He apologized and offered us the half order of mussels and a half order of scallops \"on the house.\"  However when the bill came, he had inadvertently had forgotten his promise, and charged us for it!  ( We helped him to \"refresh\" his memory).  <br><br>The top sirloin (bavette) was good, and for my taste, the hanger steak was the better choice.  The trout amandine was as good as any bistro gets.  The profiteroles with chocolate sauce, while one of the most simplest of desserts, is at the top of my list.  Mon Ami always does a great job with them.<br><br>While the food was a solid \"good\", the service was wayyyyy  off that night.", "pics": null}}, {"review": {"des": "I have been to Mon Ami Gabi twice and wanted to give it a second chance after going during restaurant week several years ago. (I don't think restaurant week is a fair time to evaluate restaurants, as I have rarely had a meal during restaurant week that actually showcases how good a restaurant actually is....)<br><br>The service at Mon Ami Gabi, like most Lettuce Entertain You restaurants, is fantastic. Our server was attentive, helpful, but not overbearing. We loved the escargot, French onion soup, and our chocolate caramel tart dessert. The wine we had was also delicious and at only about a double mark-up, fairly priced for a nicer restaurant. The steak frites is where I came up disappointed both times I visited. The flavor of the steak is very good and the frites are also quite yummy. That said, the quality of the meat is not quite up to par with what I would expect. (Some gristle and fat throughout the cut) That said, I would still return here and probably just get a number of appetizers to share and the delicious dessert.", "pics": null}}, {"review": {"des": "Seemingly a hidden gem in heart of lincoln park.  I've passed by many time wondering what their menu and food would taste like.  After several unsuccessful attempts to dining at Mn Ami i finally made it last night.  I walked in with very high expectation, perhaps my long wait just raised the bars high for Mon Ami.  <br><br>I shared Caeser Salad, and Cheese Platter which was nice but i felt it wasn't any different than walking into wholefood for imported cheese.  Salad was chunky (which seems to be the new trend as i had the same complaint recently with lunch at Italian Village) and I had to ask for extra dressing.  I ordered pasta for dinner which was also not so impressive but perhaps i shouldn't pick an italian dish at french establishment.  <br><br>Overall i wasn't impressed but i certainly not disappointed, being a foodie i'm not writing off Mon Ami just yet!  I'll be back.", "pics": null}}, {"review": {"des": "Okay...they have gluten free toast here and since so many places don't Mon Ami Gabi is already 5 points ahead in my book. My favorite GF breakfast dish in the city is their smoked salmon eggs benny on a bed of crispy hash browns. Ask for an extra side of hollandaise it's THAT good.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/5ZURrcbMs8tcXSSEE4fkuQ/348s.jpg", "caption": "THE BEST SMOKED SALON BENNY TO EVER WALK THE EARTH (and gluten free!)"}]}}, {"review": {"des": "Great ambiance and very welcoming and friendly staff. The wine list and pricing weren't too bad either! We had the lamb shank, lobster bisque and French onion soup. We also had a skirt steak if that wasn't enough. <br><br>Overall, it's a great date night spot but also friendly for families and we saw several birthday parties that night. We'd love to come back again and check out another meal", "pics": null}}, {"review": {"des": "Oh Felicia,<br>What was the rush?  We felt rushed by you from the moment we came in.  We were seated around 7:45 so it wasn't as if the place was closing. <br><br>You had your pad in hand right away and asked us if we knew what we wanted for dinner. We were only considering our appetizers at that point and we had to ask you what the specials were. <br><br>After our dessert, you presented us with the check without us asking. We would've been very open to ordering an after dinner drink but you lost out on that money. <br><br>I wish you would've considered our pace. Your service was way too rushed and we didn't feel relaxed at all.  Thank God we didn't order our appetizers and entree at the same time!<br><br>I'd return to Mon Ami but would request to sit in David's section. The rush tonight didn't make for a pleasant evening at all.", "pics": null}}, {"review": {"des": "Great skate fish, fresh baguette, good drink, tasty beef. <br><br>This place is located in a residential building near Lincoln Park. I was planning to have the sushi next door but that was closed on Monday. Then I went to this place. Nice and cozy environment with friendly server. <br><br>As a carb lover, I enjoyed the baguette with the sour carrots. They offer a wide choice of food in the menu. I instantly found there was a skate fish course and was interested in how it could taste like. Well, it came out more than I expected. The side califlower was even better than the fish. Definitely worth to try if you never had the skate fish", "pics": null}}, {"review": {"des": "I went to Mon Ami Gabi on a Sunday night with a friend without reservations. We were able to grab two seats at the bar. The bartender, Jordan, warmly greeted us. <br><br>You are immediately served tasty bread and carrot by the kitchen. <br><br>We asked Jordan for guidance about drinks and food. Jordan gladly offered his thoughts about the menu.<br><br>We ordered the classique steak frites, Spinach side, and tomato salad. The kitchen kindly split the classique into two plates for us. For dessert, we ordered the bread pudding. <br><br>I've lived in Chicago almost 2 years and this meal was arguably the best meal I've had in the city. With two $10 drinks, the meal was $78 between the two of us. I find this to be great value. The portions are large. We walked away stuffed. <br><br>The restaurant has a great vibe. You can tell there is great camaraderie amongst the staff. Everyone is very friendly. We got to know Jordan sitting at bar. He playfully guessed when our food would arrive from the kitchen and he was right almost to the second!<br><br>I've been to other similar restaurants (Le Bouchon comes to mind) in the area, and what sets Mon Ami Gabi apart from them is the service. The service from Jordan at the bar is particularly exceptional.", "pics": null}}, {"review": {"des": "First time here and I was not impressed with the food. I ordered the pepper stake \"medium\", but it was so thin that it was hard to keep it medium. It came with frites, which were cold by the time they got to our table. My wife had to return her frites, because they were burnt. We share a bottle of the house wine (Pinot Noir). It was OK. I would give this restaurant only 3 stars max based on this visit, but I still gave it 4 stars for the following reasons:<br>1. My wife liked her dish after they replaced the frites (I tasted hers and was not impressed)<br>2. The bread pudding was very good<br>3. Very good atmosphere<br>There is valet parking. I did not drive, so I am not sure if it is free or not. Prices are reasonable", "pics": null}}, {"review": {"des": "A new favorite French place in the city. Everything about our experience was wonderful.  <br>You walk into an elegant atmosphere with lots of cozy tables for two but also plenty of room for bigger parties. The atmosphere is bustling but not so loud that you can't hear your dinner companions. <br>They start you with a hot, freshly baked baguette with butter and a small dish of carrot salad. I don't know if you're supposed to, but I ate them together (putting the salad in the bread like a spread) and it was a nice little appetizer.<br>I ordered the steak frites, and my wife ordered the mussels frites. Both dishes were fantastic. The fries here are really unique; they're crispy and curvy, as if they were cut thinly and became twisted as they were fried. <br>For dessert, we shared some profiteroles. They were basically ice cream filled pastry puffs drizzled in hot fudge sauce--very indulgent and worth every calorie.<br>I can't wait to come back!", "pics": null}}, {"review": {"des": "First time I came here, I loved it! I thought I had found a gem!! However over time I've been getting the steak kind of cold (which hasn't been the greatest). I removed one star because of the cold steak but wanted to mention the amazing service of  our waiter at the downtown location -- he served us desserts on the house for the inconvenience we had with the steaks. My new favorite at the restaurant is the trout.", "pics": null}}, {"review": {"des": "After a few visits, we are continuously impressed by the dishes. The highlights that you absolutely have to try are the beef bourguignon and scallop gratinées. They also had a Monday special of pork tenderloin that I have so many compliments for. It could have been eaten with a spoon. I've never demolished a dish so fast in my life, I wish I would have recorded it.", "pics": null}}, {"review": {"des": "By far the best Restaurant Week place to dine. Went here the last 3 years and every year gets better. The food is amazing and the people are really friendly. Great place to take a date or a group of Friends. The atmosphere and presentation is out of this world. A place to impress anyone for food and drinks. I was impressed. Well done!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/qdUw6lAgx-6QqEGcTPcyOQ/348s.jpg", "caption": "Onion Soup"}]}}, {"review": {"des": "This is a wedding reception review. <br><br>In picking a wedding reception venue, the most important thing was to find a venue that actually had delicious food. We  decided on Mon Ami because we love the food, we thought it was a great value (overall) and had heard (from our florist) really good things about their manager, Sue, who was taking care of events. After meeting Sue, we ultimately decided not to hire a wedding planner to manage things with Mon Ami because we really liked her style (very kind, but sharp attention to detail). In retrospect, this was a HUGE mistake because Sue was not there on our day-of and we really needed someone like her. Before I explain, though. Let me start with what went well at our reception:<br><br>1. Our guests loved the food and drinks. Seriously, it was the best wedding food I've ever had (not just saying that because it was my wedding). My husband and I split the steak frites and the burger, they were perfect. <br>2. Mon Ami was super flexible in accommodating all of the specifics that we requested (they didn't have preferred vendors for a cake, they assembled our gift box, set up our gift table and on the day they made any corrections that we asked for in the moment). They let us have signature drinks.  They let us use the sound system for free and most people were so kind. Ultimately, we are so happy that we went with them, logistical issues aside. <br><br>Here are the problems that we had with the venue (things you might want to consider if you're considering having a wedding/reception here):<br><br>1. HORRIFIC CUSTOMER SERVICE: The in-house event planner told us in an email that we could drop off our wedding cake the day before, provided that we did it in a certain time frame. Anyone who has had a wedding in the last two decades knows that the day before your wedding is supper stressful and busy, as it was for us. As directed, we arrived during the specified time frame with our very heavy wedding cake. One of the staff opened the door for my husband, who was holding the cake; we were surprised to see that a Rosh Hashanah event was taking place in the space, we were pretty obscured from view because of the way the room is set up, but it was obvious the room was not empty.  As my husband is backing out not wanting to disturb the event, out comes a server \"Willis\"  WHISPER YELLING at my husband \"no, no, no you don't! You wouldn't want anyone to interrupt your event, so you're not going to interrupt theirs, you need to go in the back!\"  We were absolutely stunned at the way he spoke to us,  and with the type of day we had, I definitely lost it  and with a huge attitude explained that we were simply doing as we had been directed. He continued to yell at us and then insisted that we follow him; I asked if we could stay and call the in-house event planner for clarification. He persisted that we had to follow him (by the way, my husband is holding our HEAVY cake this whole time, Willis offered no cart or even a place an option to set the cake down or a moment). Reluctantly we followed him, while he scolded us the whole way (which, is a long way...especially when you are carrying a 40lb cake), by the time we got there. I was LIVID. red in the face and close to tears. I asked another staff person, a sous chef, I think, to call the planner, she said she would be not before telling me to \"calm down.\" *que kill bill music*<br><br>Upon arrival, the in-house event planner told us that we should have called before we arrived...which we would have been happy to do had she said that in her email. In my mind this was totally their bad, however I ended up apologizing for my bad attitude because I try to take the high road even when I meet people like Willis. They apologized for nothing...I guess because it was our bad (in their minds) for not magically knowing we were supposed to do something they hadn't informed us about?<br><br>2. BAD JUDGEMENT: <br>They put Willis, the same man who had treated us so abominably the day before, on wine service with the wine cart.  I nearly lost it when I saw this, but decided to let it go because I wanted to enjoy my reception, but it was super disturbing.  Guess what the #1 complaint I got from guests was? You guessed it, wine service!<br><br>We had originally planned to have two bars (one indoor and one out door), they ended up not doing the outside one due to an unexpectedly warm fall day. The bar inside could only fit one bar tender so this mean that we had 1 bartender for over 100 people...oh and Willis on the wine cart. This combination meant that some people had to wait 20-30 minutes for a single drink. Seriously, I am happy the drinks were good once people go them<br><br>That said,  I think our  mistake was not hiring someone to manage logistics. It was hard to be a bride and also also logistics manager at the reception. Bottom line:  I would recommend using this place as an event venue, but only with an outside event planner (or maybe confirmation of Sue's presence).", "pics": null}}, {"review": {"des": "What an adorable spot and a total hidden gem. The food was fantastic and I mean fantastic! The bread is made in house and was warm when it hits the table. It has a very French feel about the place, everything from the food to the atmosphere. It was quiet elegance with a casual side, which was perfect for a Saturday brunch. I have only been once so I'd love to go back and see what they are like in the winter. Our server was so sweet, and gave great advice on what to order and encouraged us to all get different things so we could try them. I had one of the benedicts, which was incredible with the addition of avocado and crab. So light without being rich. You will enjoy it!", "pics": null}}, {"review": {"des": "When there is a 45 minute wait for Sunday brunch, you know it's about to be lit. Or so I thought.<br><br>My boyfriend and I decided to check this place out because we had a gift card, and because we've never really eaten French food before (French fries don't count, right?). After our wait, we were led to our table...by the kitchen. Our table was in front of the kitchen door, so servers were always walking in and out. This would not be a problem, but there were plenty of open tables by the windows, where it wasn't so disruptive. However I understand that there is a set up as to where we get seated, so I wasn't entirely upset.<br><br>It was super busy, so I understand the wait but it did take awhile for a server to take our orders. We were just sitting, starving ducks. Someone dropped off a loaf of their French bread and walked away after 10 minutes of us just sitting there. Another person dropped off butter and jam moments later. It took so long that I didn't even realize that the butter and jam was for the bread. <br><br>Anyways, we ordered the poutine, salmon & hash brown benedict, and steak frites. The benedict was really good, but the portions were on the smaller side. What they lacked in size, they made up in flavor. The poutine was alright. It was veeeery salty. My favorite was the steak frites with the green butter. Probably the most tender steak I've ever had and the fries were amazing. If anything, *get* the steak frites.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/0lr-VoRGYiYGXOWqXL4nlA/348s.jpg", "caption": "Steak frites with green butter"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/6Var2n5sDSjG4J5wD5Qb4w/168s.jpg", "caption": "Salmon and hash brown benedict"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/n1MqDrBUexNR6vvO5KWB-A/168s.jpg", "caption": "Poutine"}]}}, {"review": {"des": "I literally made a yelp account so i could review this place... I ordered a petite filet medium rare and it came out completely well done. The waiter didn't come back for so long I finally had to flag down someone else to please get my waiter. My steak was not only ruined and expensive, but all the waiter said was that he will remember me for next time and that was it. Very expensive meal for a terribly cooked steak, waste of money. Will likely never go back.", "pics": null}}, {"review": {"des": "I've been here 2 times and both times, the waiters/hosts were extremelyyyy nice and accommodating. This place is very classy and they treat you like royalty. Most recently, I came here with some girlfriends for boozy af brunch. I got sick and others weren't feelin' it so sadly, we could not partake. The brunch cocktails, however, looked amazingly put together but kinda priceyyyyy. But you're paying for queen-status drinks so yaknow... I'll be back to try them though!<br><br>The food though... mhmmmmm... It was literally like OH MY GOD YASSSSS. Before food, they serve you a real baguette full of crunch and that kind of bread you'd be eating while walking along the Seine yaknow. I got their brunch special, which was scrambled eggs with lump crab, spinach, cheese and a side of hash browns. Boy, was it what I was looking for throughout my entire career of brunchin'. The eggs were a tad oily and salty, but the plate itself more than made up for it. The crab was neatly tucked into each bite of egg and I literally couldn't have asked for anything more out of life honestly. The hash browns were cooked in a pancake-like shape and it was crunchy on the outside and soft and godly on the inside. I'm a ketchup geek and even their ketchup was made in heaven! Overall, super impressed with service, food AND vibe. It was a dream....", "pics": null}}, {"review": {"des": "We came here for our friends bachelor party and had a great time.  The service was great, and the atmosphere was great too for our group.  Probably the most reasonable steak prices for Chicago that is still high quality.  Most of our steaks were cooked correctly.  We had one in our party who's mid-rare steak was very much undercooked.  Their Ribeye was nearly 'blue rare towards' the thick part of the cut.  Otherwise everyone one else around the table was pretty close to a perfect cook.<br><br>Pretty good wine list with a lot of different variety to pair with the food.  Reasonable bottle prices too.  <br><br>Another plus, great location right by the lakefront and in a very nice neighborhood near other bars/restaurants.  Easy to get around from.", "pics": null}}, {"review": {"des": "The steak bordelaise is to die for. And the french onion soup is FANTASTIC. Can't wait to go back soon.", "pics": null}}, {"review": {"des": "I went during restaurant week with a more limited menu but it was outstanding. My husband and I split the Escargot and Crispy Duck for appetizers (both were fantastic and our first time trying escargot! I'd highly recommend it!). As our entrees, we got the Steak Frites and the Scallops. They were both great but the Steak Frites stood out. They came with a choice of sauce and I chose the classic butter sauce which I would highly recommend. The dessert were smaller portions of  chocolate mousse, tiramisu, and profiterole (a pastry filled with ice cream and Mom Ami Gabi's homemade hot fudge). I would recommend all of the desserts. <br><br>The service was great, food was wonderful, and prices weren't overly outrageous on the regular menu. I will definitely be back! I've heard their brunches are great, too!", "pics": null}}, {"review": {"des": "I fell in love at Mon Ami Gabi... literally. When I first started dating my husband, we would walk around the corner from my condo and come here for lovely romantic dinners together. <br><br>Fast forward more than a decade. We finally made it back with my boys, who are now 7 and 9. It was a Sunday night and boy this place was still just as full and popular as it ever was -- a testament to just how much people love this place.<br><br>We made reservations on Open Table... it's quick, easy and you really should have a reservation or you're going to be waiting a long time! <br><br>A personal and long-standing favorite at Mon Ami Gabi is the merlot butter filet with pom frites. This is the kind of dinner that you actually have dreams about... trust me. <br><br>When you go, you'll see lots of couples (old and young) as well as groups of friends dining together. You'll also see families... but they take the earlier seating generally. And families that do come here generally make an effort to keep the kids in the seats.<br><br>Try Mon Ami Gabi and you will find a local favorite that has stood the test of time... not an easy feat in Chicago!", "pics": null}}, {"review": {"des": "The wife and I have been wanting to go here for years and finally made a point to check it on our anniversary. It did not disappoint. She got the pork tenderloin and I got the bernaise prime steak. You get a loaf of French bread w butter which was great. We also ordered the shrimp cocktail and she got the French onion soup; everything was delicious! Also, prices are reasonable for that type of place. Can't wait to go again :)", "pics": null}}, {"review": {"des": "C and I dined with another couple on Saturday night. Although we had a reservation, we had to wait about 10 minutes. No big deal, especially since the lobby is so beautiful and it gave a chance to catch up with our friends.<br><br>Fresh bread and butter were delivered almost instantly, as was water, which was topped off almost too often. The bread was excellent.<br><br>The ambiance is very nice. We may as well have been in Paris. The restaurant looks like authentic bistro. <br><br>Service was very professional and we never had to look around for the server. He was there when needed. Unfortunately, they cleared the table rather too promptly and, worse yet, they would clear plates the instant it appeared that someone might be finished, while others were only half done with their meal. I think that everyone of us had to indicate we were not quite finished. My wife's wine glass was snatched away with a sip left. That might be okay if it was the last glass on the table or if we had paid, but we hadn't even seen the dessert menu at that point. Frankly, I found the constant clearing annoying and disruptive to our conversation.<br><br>The food: I ordered the Prime Steak Frites Au Poivre. It was cooked properly and tasted good. My wife ordered the skate, which was outstanding. We shared creme brulee, which was excellent.<br><br>Overall, we very much enjoyed Mon Ami Gabi.<br><br>Ambiance: 5 stars<br>Food: 4.5 stars<br>Service: 4.5 stars", "pics": null}}, {"review": {"des": "The dinner was excellent! David was a great server. The French bread and carrot salad were perfect. If you like traditional French food Mon Ami Gabi is a must. I can not say enough about our experience at Mon Ami Gabi.", "pics": null}}, {"review": {"des": "The overall ambiance was great. I had a beautiful date that was a ton of fun. She loved her drink right from the get go. I had an old fashion to loosen me up. <br><br>This girl was a smoke show. I don't think it was the drinks or the lighting either. 10/10 girl you take home to Mom. Great values.<br><br>Food was actually worth the money too.", "pics": null}}, {"review": {"des": "Horrible service.  Short changed from the bartender.... Been coming here for years and experienced the level of service decline ... there are to many reputable places that have honest people ... so I say try another place or watch your tab/ bill closely.", "pics": null}}, {"review": {"des": "Time and again we have celebrated occasions at Mon Ami Gabi.  The restaurant and its staff never disappoint....and the food is a delight.  Although not on the inexpensive side it remains a great value.  <br>And if you find an exceptional server like Felicia you'll be likely to return time and time again as well as a wonderful young manager who came on board recently and totally fits the bill.  He's friendly & accomadating, another plus for Mon Ami Gabi. <br>Not least are the baguette and carrot salad as  appetizers and to compliment the meal..... plus various freebies that come on your text message if you sign up!<br>Larry Abrams", "pics": null}}, {"review": {"des": "Love this place.  Small and intimate with European flair.  Awesome wine selection by the glass.  Wait staff is attentive and helpful, but not overwhelming.  Love the bread.  And I always get the Mussels because I love the bread.  Steak and frites.  Wonderful.  Enjoy the menu just the way it is and don't skip hearing the nightly specials.", "pics": null}}, {"review": {"des": "I went there thinking the food will blow us over. The decor is nice French bistro (with the necessaire signage in French and the usual clichés). It was a posh place in a posh apartment building in a posh neighborhood. The service was good! I ordered the fish and chips ( so not french) and my friend got chicken breast with ratatouille. Honestly, for amount of money, my food tasted okayish and the fries were skinny fries. I even was hungry after my meal. My friend's dish was not bad but nothing exceptional. The baguette they served us complimentary was re-heated in the microwave was chewy and inedible. i believe it is the location and the ambience l we paid for. <br><br>Comes to make a point : there are so many bars and restaurants in Chicago, which are posh and have great decor, but fail miserably at food, which should be the essential soul of a restaurant. Ô", "pics": null}}, {"review": {"des": "This was a cute little restaurant in Lincoln Park that did a great job with the ambiance and atmosphere. Music in the background was pleasant, although chairs weren't the most comfortable.<br><br>Came here for a work dinner and as a vegetarian, was scared a French menu couldn't cater but this did a good job!<br><br>I got:<br><br>- burratta: came with three pieces of bread that were OK, not the best burrata app I've had and would opt for another app over this <br><br>- warm goat cheese: similar to the goat cheese dish many tapas places have, this was served with a nice toasted baguette. Nothing out of this world but tasted good<br><br>- vegetable Tagine: great dish! Never had something like this before and heard it has Moroccan roots which I was interested in trying. It comes as a soup-ey dish with cous cups and vegetables, and give a spicy sauce on the side to increase the kick. I really enjoyed this dish and glad I tried it over the pasta (the other vegetarian fish which sounded good but wasn't coming to a French restaurant for pasta!)<br><br>Had the bottle of Malbec which was nice if you like heavy bodied wines (which I do). <br><br>The banana bread pudding with ice cream was also amazing - all their desserts looked good.", "pics": null}}, {"review": {"des": "Mon Ami Gabi was quite a treat.  It's located inside a residential building, so that might throw you if you're looking for a restaurant in its own building.  The place is quite small and dimly lit.  I wouldn't say it's a romantic atmosphere because it's a little too loud, but it had a nice ambiance.<br><br>We began our meal with their complimentary warm baguette and butter.  They also served us a weird trapezoid of shredded carrots.<br><br>The French Onion Soup was good.  I feel like that's a hard dish to screw up.<br><br>I ordered the 12 oz. NY strip steak and frites.  I appreciate that my server allowed me to sample both the bordelaise and bearnaise sauces on the side.  The steak was good.  The frites were excellent.<br><br>We passed on dessert, but we did enjoy a bottle of the Louis Latour Bourgogne Gamay wine.  It's a very light red.  I'm normally a pinot noir guy, but my lady wanted something light.  This fit the bill.  At $40, it was one of their cheaper bottles.<br><br>Our server was excellent.<br><br>I would happily return to Mon Ami Gabi, though it's very expensive.  It will probably end up on my once-a-year list.", "pics": null}}, {"review": {"des": "We enjoyed our dinner and it was a good experience! All food was delicious, amazing halal steak, salad, soup, fish. Will come again!", "pics": null}}, {"review": {"des": "Delicious!<br><br>Came by here the other night for dinner with a friend visiting from out of town. Our goal: STEAK FRITES. I went for the Classique Steak Frites cooked medium. It was cooked to perfection and served with a generous dose of green butter to lather it up for every bite. Fries also cooked to perfection as well. Overall a well executed classic steak frites dish! <br><br>Prior to being seated we hit the bar for a round of cocktails. I opted for the bourbon symphony which is a concoxion consisting of calvados, vourvon, cointreau, and lemon. I would probably would pass on as it tasted super watered down as it was server over a full glass of ice. <br><br>Anyways, if you're looking for steak frites, look no further! Be sure to set a reservation in advance. This place is always bumpin' for dinner. <br><br>'Til next time, cheers!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/9W9y9CahWGgy15eLteujBw/348s.jpg", "caption": "Classique steak frites! Yum yum yum!"}]}}, {"review": {"des": "What separates really really good from great? Mon Ami Gabi has been around forever- it was an early Lettuce Entertain You restaurant and it was in Lincoln Park way back in the 80s/early 90s. So how are things 25+ years later?<br><br>I'd say excellent. The service is excellent- on par with the great Chicago steakhouses- you know, filled with a professional waitstaff that know their shit....that takes eating and wine/food pairing seriously....but isn't pretentious.<br><br>The tables are tight together and this gives it a....French bistro....type feel. Yup. Imagine that.<br><br>My only complaint? I like big California wines and France really doesn't offer that. Or....Mon Ami Gabi doesn't offer that. I ordered a 2012 Chateau Louvie St Emilion for $80+ (frustrating because it sells for $25-30 at liquor stores) and it was ok. I think they could probably reconfigure their wine list, still keeping it French, still maintaining good margins, but perhaps bring up the wine quality.<br><br>The food, the service, the atmosphere? Wonderful. This is an older, well established institution in Chicago and it deserves your visit.", "pics": null}}, {"review": {"des": "My partner and I came in for dinner on New Years Day. They were running a little late with reservations so we sat at the bar. Our bartender was helpful and kind even setting us up with the Lettuce app. After we were seated, we were greeted by Felicia who let us know our server would be with us shortly. When our server arrived she was visibly annoyed with us. While my boyfriend was mid order, she snatched the menu out of his hands and we had to stop her to let her know we still wanted to order a bottle of wine. <br><br>Felicia presented our wine and checked in with us later on. Honestly, I wish we could have given our gratuity to her as she was incredibly attentive and personable. We didn't see our server again until it was time to pay. She brought us our check while we were still having dessert and finishing our bottle and she stood over us while we signed. At which point she grabbed the check book and took off. <br><br>Our meal itself was wonderful and everyone from the host, bartender, server assistants, etc were incredible. It was just a bummer to spend $150 on a celebratory meal and to feel rushed by our server. Nevertheless, Mon Ami is one of our favorite steakhouses and we will definitely be back.", "pics": null}}, {"review": {"des": "I don't think its possible to say enough good things about this place.  I have been to Paris and the food here is as good as or better than all the restaurants I ate at while there.  <br><br>My wife and I came in on a Saturday night for dinner.  As expected the place was VERY busy.  Luckily we had a 7:30 reservation, but we ended up still waiting about 30 minutes to be seated.  We were a little annoyed, but we weren't going to let it ruin the night.  <br><br>After being seated, we decided on a few glasses of wine then ordered the escargot and french onion soup for apps.  Both options were amazing.  The escargot is a smaller app, but the sauce it comes in is so good and great for eating with the baguettes they leave on your table.  The french onion soup is HUGE, easily shareable for 2 people as an app.  Its also very good.  There is a massive layer of cheese on top and the broth is the best I have ever had.  <br><br>After the apps (which had basically already filled us up) we decided on the classic and onion/red wine sauce steaks with frites.  The steaks were easily the best I have ever had, like ever.  The portion is also huge.  We really tried to eat the entire thing because it was so good, but it just wasn't possible.  The fries are also very well seasoned and go great with the steak.<br><br>The service was over the top awesome.  They almost seemed a little understaffed because our waitress was running around like crazy.  There was other staff helping to clear the tables and bring food, but it was busy.  Despite the number of other guests, our waitress went out of her way to make us feel special.  At the end of the meal, we asked the waitress for the check and said we were in a bit of a rush to get going.  When she brought the check back, she said she was going to buy us champagne and dessert because we had waited so long to be seated, but decided to just comp our wine since we were in a bit of a hurry.  SO NICE.<br><br>Great place, can't recommend enough.", "pics": null}}, {"review": {"des": "This ranks way up there, for one of the best dining places I have ever dined at. Not only Chicago , but in the USA. The service and the quality was first class in every detail! Please don't change a thing.  \" I shall return\"    Thank you for making my Saturday a perfect day.", "pics": null}}, {"review": {"des": "First time there, great atmosphere and amazing food. Biggest plus was the staff- our waitress Amy was attentive, welcoming and personable. I would go back just to be served by her again.", "pics": null}}, {"review": {"des": "I have been here a couple of times since they opened long ago. very pricey but yet the quality and size of the steak and other items just doesn't justify it.", "pics": null}}, {"review": {"des": "This is a pleasant, consistently quality French Cafe. The baguette is among the best in Chicago and the food is always fresh, hot and as ordered. The wine selections are excellent. My daughter wants to know why I'm only giving four stars as she, like me, always finds dinners at Mon Ami to be special and tasty.", "pics": null}}, {"review": {"des": "We originally had reservations for 6:30 but wouldn't be able to make it in time so we called ahead and they were able to reserve a seat for two at 7:45/8pm. We got there around 7:30 and was greeted very warmly by the nice hostess with a \"happy birthday\". She told us she would try to seat us earlier if possible, so nice! We had time to wait so we sat at the quaint little bar and had a drink. Very extensive wine menu but they also had a fair beer list!<br><br>We started with the Baked Goat Cheese which was very yummy! And for dinner the Roquefort and Filet Au Poivre. The filet was very yummy however I suggest ordering it Medium as a I made the mistake of ordering it Medium Well and ended up with a dryer steak than I wanted but it was still very tasty! It paired well with the malbec that I ordered. We thought the fries were OK but they cool down before the meal is through which was disappointing. We also had a side of the Macaroni Gratin that was perfect size for two, also very good.<br><br>At the end we were given a small dessert (not on the menu) with a candle on top to celebrate my boyfriends birthday, so cute! Perfect to share as we were very full by this time!<br><br>Overall, food was good. Staff was friendly and accommodating and the ambience was very warm and intimate. Would definitely come back again for a special occasion!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/U_RQQT6w8wm7ZzUWC2qylw/168s.jpg", "caption": "Macaroni Gratin"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/zXI7c1zZ6kXR79ZgzAH1Uw/168s.jpg", "caption": "Filet Au Poivre"}]}}, {"review": {"des": "A nice French bistro in an upscale residential building. The decor of place is very nice. The bar is small but you can choose to wait in the lobby of the building. Bartender was helpful and chose a delicious non-alcoholic yet suitable for socializing drink which was served in champagne glasses. Food was overall tasty. We had goat cheese, beef tartare, and the seafood platter. We loved everything.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/8RfD-Yo3R5HPTHrPONnFCg/348s.jpg", "caption": "Seafood platter. Loved the oysters"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/gMJhXl6z5JbG8Hdy069fEg/168s.jpg", "caption": "Beef tartare"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/XLM_BTiuQa9A0sXHHMl-FA/168s.jpg", "caption": "My. Ew favorite non-alcoholic drink."}]}}, {"review": {"des": "I am not a big soup fan and the two best soups of my life I had here. Last year, the butter squash, this year, the cauliflower one.<br>We have tried most of the appetizers on the menu and all are amazing, the scallops one has too much onions for my taste, but I don't like onions. The servers are knowledgeable on the meat and fish sources which makes me confident in dining there. Service is always great.<br>The only minor complaint I have is that during happy hour, 5-6 pm, they don't give you a new glass of wine when you reorder but refill the one you have even if not empty, therefore you drink less wine. Mmm, I want my wine, even though it's happy hour wine!<br>Desserts have consistently been good and they serve a small treat if you celebrate an event there.", "pics": null}}, {"review": {"des": "This place never disappoints my favorite time to come here is for breakfast time. They have amazing bloody Mary's that are a little over priced. The baguette with jelly that comes with the food is to die for.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/z7z12pf2V2nF0a46quqAyA/348s.jpg", "caption": "Favorite thing here..the banana waffles"}]}}, {"review": {"des": "I came here with my boyfriend for our anniversary. He made reservation and left a note saying it was our anniversary. I love it here! The food, place, and service was outstanding! We both got steaks and they were one of my favorites I had. When we were done eating, they surprised us with a dessert! We didn't order it but they gave it to us for our anniversary! I was very impressed and they totally won me over! I definitely recommend for a cute date/anniversary/celebration!!!", "pics": null}}, {"review": {"des": "Mon Ami Gabi is a great spot where you'll find hearty meals, good service - all with a French inspired menu and atmosphere. The menu features steaks. While there are better steaks in the city, these are good. All other items are also delicious. <br><br>During the warmer months, they offer a nice patio where you can sit under the shade of the trees, along side Lincoln Park. In the winter, the warm and cozy, white table cloth interior beckons.This isn't a trendy spot but rather tends to draw an older crowd but that doesn't stop us from going (family of three with a toddler - kids menu is great). <br><br>Tip - The place is often busy so make a reservation.", "pics": null}}, {"review": {"des": "A follow -up to our Father's Day experience........ not ideal.   HOWEVER the GM REACHED OUT several times.    He was very interested in how he could improve the issues we had and HE VERY MUCH WANTED TO MAKE US FEEL COMPENSATED... He was very kind and we look forward to experiencing the restaurant  again very soon!!!!  Thank you!", "pics": null}}, {"review": {"des": "My mom is stuck staying in a small hotel for 6 weeks while she gets medical treatment. Mon Ami Gabi STILL has their restaurant week menu saying they are doing restaurant week on the 4th. <br><br>However, they are NOT honoring it. If they're going to cancel something they're advertising, they need to call people who have reservations. They seemed to lack any regret about having incorrect info on their site.", "pics": null}}, {"review": {"des": "Think if Applebee's had its steak menu in french and raised its prices.  Then you get Mon Ami Gabi. It's not really french, is it hon?  It's a decent neighborhood restaurant, not a destination.", "pics": null}}, {"review": {"des": "Wow!  Outstanding experience! <br><br>David K and Steven took incredible care of us.  <br><br>Beautiful patio!<br><br>Recommendation for improvement is homemade recipe for Bloody Mary.  Current exclusive recipe is lacking flavor depth.  I'd skip the Bloody Mary. <br><br>Food: best quiche I ever had...bacon, asparagus, and cheese. Perfect crust. Amazing. <br><br>My friend enjoyed her salmon benedict entree which they use hash browns rather than English muffin. <br><br>So happy to return another time soon. Today I was a first timer.", "pics": null}}, {"review": {"des": "I love Mon Ami! This location is very charming in the Belden Stratford and next to the park. The service is fantastic. The steak frites were so good. Very tender. Wine was great also. Free coat check a plus!", "pics": null}}, {"review": {"des": "This is for the Sunday brunch. Seems like the dinner is much better here.<br><br>The hostess and server were great, as well as the busboys.<br><br>The food was not great (We got the blinis and poutine). Specifically, the blinis were incredibly small portion... we laughed at the portion size difference between the blini and poutine. <br><br>The coffee was also not great.", "pics": null}}, {"review": {"des": "My husband and I dine here regularly and it is ALWAYS good. <br><br>I live for the seasonal scallops and he always gets the steak frites. We always share the amazing french onion soup (even in the summer) and devour the bread. I love their Lilliet Royale cocktail, too. <br><br>The service is consistently good, too.", "pics": null}}, {"review": {"des": "I have only been here for brunch so that is what this review pertains to.  <br><br>They open at 10am and since it is located close to where i am staying,  I was there before the doors opened at 10:03am.   I was greeted by a friendly hostess, seated promptly and given water. <br><br>The decor is a traditional french bistro with light relaxing music playing that created a nice atmosphere for a Sunday brunch. <br><br>I wanted to try a brunch cocktail so I inquired about the bloody mary but was informed the mix was not made in house so I opted for a fresh orange juice mimosa instead.   The mimosa was very light on the OJ so I requested a side of orange juice and the waiter was very nice and brought it without hesitation. <br><br>Egg White Omelet - egg whites, asparagus, spinach, peas. <br>I added jarlsberg cheese to it.  This was cooked perfectly, not too oily and the veggies were very fresh, including the peas.  It was delicious.  The hash browns were not that good but I prefer real chunks of potatoes to the stringy lukewarm hash browns that never seem fresh to me.   I asked for ketchup and tabasco for the hash browns as I planned to eat some of them anyway.  <br><br>They give a baguette and butter to every table, but I told him not to waste it since I am gluten-free.  I ordered a side of gluten-free toast to accompany my omelet which came with a side of butter.  The toast was small but toasted to golden brown perfection and was good. <br><br>My bill came to $26 which is reasonable for the service, atmosphere and quality food.  <br><br>Overall, a great experience. I will come back again and sit outside on the patio once the weather warms up.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/8Kmzecboq1IldpFjyEnf_g/348s.jpg", "caption": "prawn special with baby artichokes, corn and cherry tomatoes"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/-3KYRFD4SucmCfgqScMKSQ/168s.jpg", "caption": "inside"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/dp3hbn5QcsUcHZeTLjBI4Q/168s.jpg", "caption": "egg white omelet with fresh asparagus, spinach & peas"}]}}, {"review": {"des": "Awesome dinner for Valentine's Day! The bread (as everyone else on here has already mentioned) is perfect. We split a few appetizers before the entrees, and everything was brought out quickly - especially considering how packed they were.<br><br>The chicken liver pate, salmon tartare, and escargot were all plated nicely and delicious. Steak was incredible as well - cooked to a perfect medium-rare!<br><br>Oh, and the decor definitely reminded us of restaurants we've been to in France!", "pics": null}}, {"review": {"des": "We have recently had breakfast here. I had an egg white omelette which was delicious. They also had a kid-friendly menu. We would be happy to go back soon.", "pics": null}}, {"review": {"des": "Great food, great staff, good service. On the pricey side but I think it is justified. I have been to other locations in the suburbs, this is the by far the best one. I had the steak with the blue cheese, it was really good. the atmosphere is  great and the location offers great \"walk after\" options due to its proximity to the park. Highly recommended.", "pics": null}}, {"review": {"des": "One of our favorite places to go! We live around the corner and come here often. The chicken liver pate is amazing and I usually get the frisée salad and hubby gets the grand mere chicken. The chocolate mousse and the chocolate caramel tart are also phenomenal. The bartender, Jordan, is the best, so if you're able to get a seat at the bar-- do it.", "pics": null}}, {"review": {"des": "My girlfriend and I were walking through Lincoln park zoo for Valentine's Day and decided to come to this restaurant as an impromptu early dinner. As we didn't have reservations and happened to be an hour early before opening hours, we spoke to the manager and he said we could dine at 5pm as long as we were out by 6:15. No big deal for us <br><br>We ordered the escargot and onion soup for appetizers. I was very underwhelmed by the escargot as they come without the shell and were just overly chewy. The onion soup came out Luke warm and we actually needed to ask them to reheat (we are really not that picky so it's a big deal when we ask for them do something like that) also quite surprised it wasn't hot when we were literally the first guests in the restaurant.<br><br>For main course we decided to have the seafood platter and the hangar steak in Merlot cream. Although we asked to have the seafood be served first, both entrees came out together. The seafood platter was mediocre at best but probably wouldn't order again (oysters were delicious though). The hangar steak was overly cooked and at this point in dining had also cooled so it was burnt outside and Cold inside. Refer to pictures for reference.<br><br>Dessert was the caramel creme brûlée and found it to also be mediocre. <br><br>With the meal at this price point I would have expected more and the server just seemed completely out of it. I probably won't be returning here for any special occasions in the future.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/H0ZKVYR64C5_vOZO6oPTpQ/348s.jpg", "caption": "Caramel Creme brûlée"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/106L9_NzZytvC1IrsuY10g/168s.jpg", "caption": "Hangar steak"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/kCKBZrCKUCyqDqIk01TgHg/168s.jpg", "caption": "Onion soup"}]}}, {"review": {"des": "A classic LEYE restaurant that delivers what you would expect. You can't really go wrong with any of these restaurants. Tucked away inside an old, upscale apartment building (?), this restaurant serves the French classics and more.<br><br>Their French Onion Soup was very good, on par with other place we've tried, and their meat dishes are all done nicely. We had a mussels and that was a little on the salty side - I didn't think this was as good as I expected, though the salty fries complimented the dish qite nicely. Service was good.", "pics": null}}, {"review": {"des": "Best brunch to date. This French treat is nestled right in my coworkers apartment complex in Lincoln Park. Instant jealousy. I'd love to walk off the elevator and straight into this place everyday.<br><br>The decor is kitschy yet tastefully playful French. It's super cute inside. Service was great and our waiter was very attentive. <br><br>For brunch, I was adventurous and got the chickpea cakes eggs benedict. It's exactly what you think, two small delicious and savory cakes made out of chickpeas, topped with poached eggs and a wonderful vert hollandaise sauce. I was a bit skeptical of the cakes, but they were crispy on the outside and had the perfect soft consistency on the inside. <br><br>It was filling but didn't leave me with the usual regret of a greasy (yet satisfying) brunch. If you're into off the beaten path breakfasts, I'd recommend this plate.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Q2xaLdSSvKvEzN6Q6sTEbA/348s.jpg", "caption": "Chickpea cakes eggs benedict"}]}}, {"review": {"des": "Have not been here for about 10 years, decided to try again and was not disappointed.  Decor is dark and cozy.  Very comfortable.  Started with a couple cocktails, the Lillet Royale and the Last Nights of Paris.  The Lillet Royale was excellent.  I could have had several.  The Last Nights of Paris was well done, just not my cup of tea.  First app was the Baked Goat Cheese.  Goat cheese and tomato sauce is always good, this tomato sauce could have used a little more seasoning.  The baguette was perfect.  Crispy outside, chewy inside.  Next up was the French Onion Soup.  The onions were quite sweet and had obviously been given a lot of care.  Very flavorful broth.  Next came the wine.  We were up in the air about a couple choices, the server offered to let us try both.  For dinner it was the Roquefort Steak Frites and the Filet Au Poivre.  Both were done perfectly to order and were extremely tender.  I have a hard time giving good marks to steaks where it's less about the steak and more about sauces, etc., but these were executed very well.  Frites were golden and crispy.  And the Garlic Spinach was a great accompaniment.  The server brought us a Salted Chocolate Carmel Tart for dessert on here.  It tasted great but was a little much for us on top of all the rich food we'd just eaten.  And the server was great throughout the whole meal.  It will not be another 10 years before we go back.", "pics": null}}, {"review": {"des": "Knowing Mon Ami Gabi is more on being a French restaurant, I was never really interested in trying this place.  After a friend and I had dinner at another restaurant, we had decided to come to this restaurant for a cocktail.  We were able to obtain couple of seats at the quaint bar.  Jordan, bartender,  had greeted us with a smile and set us up with a menu to review and then proceeded to take our drink order.<br><br>By the time, Jordan brought us the drinks, we had decided to split an order of Frites and Fries.  Our order was placed.  Jordan was very attentive to us and to his other customers and to the servers.  Within 10 minutes or so, the food runner brought us our meal on two seperate plates.  The steak was done perfectly while the fries were seasoned just right.  No desserts this time.<br><br>The restaurant is on the smaller side, however, it did remind me of some of the restaurants in France.  The restaurant has a great fenced in patio.  The restaurant was certainly not loud.  You could have a conversation without raising your voice.     <br><br>From the time we had walked into this restaurant to the time we had left, we had a great tme.  Thanks Jordan!", "pics": null}}, {"review": {"des": "I just discovered this place for delivery recently.  I really like the quality, for being a chain restaurant concept, they really do a good job.  I like to order their scallop appetizer with carmelized leeks and shallots with butter.  I'm telling you, delish!  I also like their French onion soup, their steak and fries with béarnaise sauce also rocks!  I have liked everything I've tried and the delivery is pretty fast and served warm.  <br><br>I am a fan and will continue to order from here when I want to treat myself to a nice dinner in.", "pics": null}}, {"review": {"des": "Had a great experience here after a recommendation from a friend. Had two appetizers, entrees and desserts all of which were pretty perfect. The service was great, seems to be a little bit of team service so someone was always stopping by to help even if it wasn't your actual server. We went with steak for dinner, as they are well known for their steaks. Both were cooked perfectly and tasted amazing. A little out the main city, but most definitely worth your time.", "pics": null}}, {"review": {"des": "Mon Ami Gabi is one of my favorite places to dine. Intimate room, very good service, great wine and drinks and the food is wonderful.  Can get busy and at times a bit noisy but well worth a visit.  Steak frites is a favorite!", "pics": null}}, {"review": {"des": "It was a beautiful day so we decided to take advantage of their quaint covered patio and it was perfect. I was so happy that we could enjoy sitting outside without getting baked to death. Upon seating, we were promptly greeted by our waitress Janet K, who was attentive and provided us with excellent service all night. <br>I knew the bread was going to be fantastic, but the butter that accompanied the bread stole the show. It was so creamy, it was disgusting. To protect myself and my stomach, I promptly ordered the goat cheese salad to deter further carb overload. For an appetizer, we chose the chicken liver mousse which was so good. For the main course, we dined on the seafood tower (fruits de mer), seared scallops, whipped cauliflower-let me interject..I would eat this instead of mashed potatoes for the rest of my life if I could. The sautéed mushrooms were amazeballs as well. <br>We would not have been able to live with ourselves if we had skipped dessert, so we went with creme brûlée, raspberry galette, and their special of the peach crepe with sour cream ice cream. All of the desserts were divine!<br>From the first encounter with the hostess and maitre d', this was a memorable night of fun and frivolity with friends.", "pics": null}}, {"review": {"des": "Last night was our first Valentine's Day together alone without the kids in I can't remember how long, so we decided to go to Mon Ami Gabi for dinner. First when I called a week ahead to make a reservation the gentlemen on the Dave was very welcoming from the moment he answered the phone to the moment we hung up. They were booked solid, but asked for time to make some calls to see if those reservations were going to be kept. He let me know about an hour later that he has some cancellations and was able to get us in at our time that we hoped for. When showing up the manager (Jim I believe was his name greeted us with a smile), and got us to our table with in a minute. Nicole our server was beyond friendly, warm welcome, and very knowledgeable about the menu (both the food and wine list). From start to finish we had a wonderful time and we will always be great full the Mon Ami Gabi staff for making this an incredible memory for us. We will definitely be back both next Valentine's Day as well as times in between. Thank you from the both of us!!", "pics": null}}, {"review": {"des": "Cozy fancy atmosphere makes for a great date night spot on a cold evening. They serve a variety of steak frites in different French sauces and different cuts. The Classique had a good herb butter sauce and a nice thin-ish flank cut steak, cooked with skill. The filet with cream fraiche sauce was also delightful, and the frites do a great job sopping up the juices of the meat and sauce. Escargot was fine in a rich parsley butter sauce that's great dipped in french bread. I can pass on the country pate next time.", "pics": null}}, {"review": {"des": "I have been going to this restaurant for over 20 years (even when it was Un Gran Cafe).  Last night we showed up for our dinner reservation and they had closed the patio for a private party.  It was a perfect night and we were going primarily to enjoy the garden.  They always call to confirm dinner reservations, but they didn't do this yesterday as I believe they knew if they told patrons that the patio was going to be closed, many people would cancel.  This is just horrible customer service and the host/manager was not even that nice about it.  He said something like \"I will make a note in your reservation and we will take care of you next time.\"  What does that even mean?", "pics": null}}, {"review": {"des": "Love love love this place! My husband took me here last weekend for my birthday. We already want to go back! The prices aren't too expensive. It's definitely worth it with. the quality of the food and services. <br><br>As an appetizer we ordered the goat cheese in tomato bisque. Delicious!! A must try. <br>We both ordered the French onion soup. It wasn't my favorite. I could have done without ordering it. <br><br>For entrees, I ordered the hanger steak with MERLOT BUTTER! It was cooked to perfection. I was so sad when I got full and had to box it up. My husband ordered the chicken grand-mere. It was delicious too, but my husband wished he had ordered the same thing as me. ;) <br><br>For desert we ordered a lemon creme brûlée. Again.. Delicious! <br><br>The cocktails were very good and they have a great wine selection.", "pics": null}}, {"review": {"des": "We patronize Mon Ami Gabi because they get it right, every single time.<br><br>If you Mon Ami often enough, you may notice that the staff does not change very much. The staff knows very well what they are doing and treats guests like old friends and family. They notice when you are our for a celebration even if you do not mention it. They will bring you profiteroles and congratulate you or say Happy Birthday/Anniversary accordingly.<br><br>Our meals at Mon Ami are never rushed. The crusty French bread is always amazingly fresh. I love the goat cheese appetizer. Entrees are adequately portioned and always prepared correctly.<br><br>Mon Ami may be part of LEYE, and a small chain, but it is a very worthwhile dinner restaurant.", "pics": null}}, {"review": {"des": "My family likes to gather here for meals. We usually have a big group and order many dishes. During my last visit I got scallops and whipped cauliflower. The scallops were cooked perfectly (I can't stand overcooked seafood) and were layered on scrumptious vegetables with a marvelous sauce. The cauliflower is a great alternative to mashed potatoes. Plus, it was something my 6 month grand daughter could taste while everyone else ate (she is very curious about food and wants everything). <br><br>The wine selection is top notch along with service and decor. <br><br>We always eat everything never leftovers, even with deserts.", "pics": null}}, {"review": {"des": "Dining al fresco is such a treat during our short summers and their outdoor space is quite nice. <br><br>Came here after the other half scored a promotion for a celebratory dinner, so worth wile. Everything we had was so delicious!", "pics": null}}, {"review": {"des": "You will feel transported across the Atlantic. Waiters are all older men, with accents - thought that was funny. The bread and butter brought out before the dinner were absolutely delicious. We ordered salmon tartare and mussels for hors d'oeuvre. Both were delicate and mouth-watering, but the mussels' broth won the table over. We went through two loaves of bread soaking up the broth. <br>For our main entrees, we ordered warm goat cheese salad and filet mignon in merlot sauce. Amazing. A+", "pics": null}}, {"review": {"des": "No doubt Mon Ami Gabi is a stylish and much sought-after restaurant. Our group of 4 headed over after dinner in River North to experience their dessert and drink offerings. Upon entering at around 10ish, it was still so busy that we waited about 10-15 minutes for a table to open up. Not a problem, as it's situated in the Belden Stratford hotel so there is plenty of space to wait in the grand lobby.<br><br>The hostess was not too friendly but we really liked our waitress. White chocolate bread pudding, creme brulee, chocolate cake, and raspberry sour cream ice cream were chosen to satisfy our sweet tooths. All were divine. Decaf coffee and good conversation complimented the desserts well, and made for a pleasant night. I would probably recommend Mon Ami for a little older crowd, special occassion, or fancier date night.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/WxmhsWMctIIZ9br_zRCbVA/168s.jpg", "caption": "Warm chocolate cake"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Z07Y_MixqbtouFnBx8G31w/168s.jpg", "caption": "Raspberry & Sour Cream Sorbet"}]}}]}