{"name": "montis-chicago", "reviews": [{"review": {"des": "An Eagles Bar getting a five star from Anthony? What? <br><br>Seriously, this is some of the best bar food in all of Chicago. <br><br>Yes, this is technically a Philly Bar, but it is also much more. It is tucked away almost off a main road, but once you enter, they welcome you like an old friend. The specialty here is Philly Cheesesteak. You can get the classic (which is awesome), but they also have a pizza version, greek, and my personal favorite, the Rocky. The Rocky is a bit of a spicy sandwich challenge. So flavorful, but also with a giant kick. It isn't for the faint of heart. If all of these sound good, no fear! You can actually get a sampler of mini cheesesteak sandwiches. For your veterinarians out there, you are covered as well with a veggie version! <br><br>We haven't had much else there, but their coconut chicken starter is  a star! The pretzel nuggets are also not to miss. <br><br>They also have a pretty good beer list so everything is covered here. It is a little small so make sure to get there ASAP! This is one of my favorite places in the city!", "pics": null}}, {"review": {"des": "Their cheesesteaks are solid. You can get a traditional version with just the meat, cheese, and grilled onions or a hoagie version with mayo and veggies added on. I prefer the hoagie because it gives the sandwich a nice crunch and freshness. <br><br>Their sandwiches come in three different sizes - mini, 8\", or 12\" - and they're served with a side of fries. I usually get the 8\" and it's plenty of food! The sandwiches are loaded with meat and very filling. My friend from Philly claims that they taste very authentic, as good as the ones you'd get in Philly.<br><br>If order for pickup, they can get it ready in just 15 minutes on most days!", "pics": null}}, {"review": {"des": "Great local spot to grab a sandwich. <br>I had the Greek version sans bun with a side salad and it made a great healthy meal. Others in the group had the traditional sandwiches which all looked good but none had onions or peppers on top which I thought was odd but I'm no Philly cheesesteak expert. All suggested more cheese as well but these were minor comments. The bread was good and the fries were fresh. <br>Split the Italian ice for dessert (for free from the yelp checkin). <br>Waiter was nice but was the only one working which made it slower than preferred for drinks, etc., but was adequate. <br>If you are in the Lincoln Square area it's definitely worth a stop.", "pics": null}}, {"review": {"des": "Monti's never fails! The BEST cheesesteaks and they also have really good wings! <br>Family friendly or perfect for date night. Warm, cozy environment, always playing cool music. If you want to catch a game, they have that on too!", "pics": null}}, {"review": {"des": "We just moved to Lincoln Square and were going to host very large housewarming party (~60 people). We wanted to do something different for food at the party and found Monti's. <br><br>The week before the party, we came in for dinner and did our version of a \"food tasting.\" I ordered the Philly platter (original, the Rocky, Southside Johnny) and my husband ordered the wings. The philly cheesesteaks were PHENOMENAL. My favorite was the Rocky, but be warned as it is truly as spicy as it sounds. The wings were thick and juicy, and the buffalo flavor was great. I have to give a shout out to the bartender as she was super friendly and helpful. She really makes you feel like you're right at home<br><br>Given the success of our food tasting, we went ahead and moved forward with a catering order and worked with Jennifer, who was fantastic! She was great in providing recommendations for packages, and also worked hard to make sure our order size was just right. I had folks who were vegetarian and she suggested a small order of Where's the Beef. This was a huge hit for them and that platter was done by the end of the night.<br><br>I definitely recieved a lot of compliments about the food throughout the day so thank you Monti's for making my party a success!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/78Fn3ZLaifm1s5gSDT9x3Q/168s.jpg", "caption": "Cheesesteak Platter"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/rmgVdPgdQENvcSb4d6BLNw/168s.jpg", "caption": "Saucy and delicious wings"}]}}, {"review": {"des": "This is a great place to get a Philly Cheese steak if you're close to the Lincoln Square neighborhood.  Cute place with a couple of televisions , a bar area and enough tables.  I ordered ahead because I was taking it to go. The food was great.  I ordered the Rocky,  which is the hot and spicy cheese steak.  The fries were above average.  I will definitely go back.", "pics": null}}, {"review": {"des": "I love this place! I'm originally from Philadelphia so finding this place in Chicago gives me a nice reminder of home. This place has cheesesteaks and pizza. I haven't tried the pizza but the cheesesteaks are amazing! I usually go for the authentic cheesesteak- onions, a choice of cheese. They also have some specialty sandwiches that are pretty good too.  Pretty large craft beer selection too. It's a smaller restaurant and seating is limited- I would recommend getting there early.", "pics": null}}, {"review": {"des": "My husband and I came here for 2 Philly cheese steaks for lunch and they were good.  Nothing exciting, not super flavorful and a little pricey for what we got.  I had heard such great things for YEARS being a local in the neighborhood, so perhaps we will give another try.", "pics": null}}, {"review": {"des": "Not a better representation of a Philly steak in Chicago! Love this spot for lunch, I usually stop by at least once a month. Super friendly owners make this place even better. They always have good local brews too, but only one on tap at a time.", "pics": null}}, {"review": {"des": "Monti's is an amazing sandwich shop / bar.  It is located on Talman just off of Lawrence, so you might drive by if you aren't paying attention.  It was pretty empty when I came mid-day, but service was great.  They play oldies (maybe 60s-70s music) which is a creates a pleasant atmosphere.  The place had a good vibe and I really enjoyed my dining experience.  My food came out in about 10 minutes and I was ready to eat!<br><br>I came for the Philly after seeing much buzz about it on Yelp.  I ordered 10\" with white American for $10.99.  The sandwich was amazing!  The bun was soft and pillowy!  It stood up really well to all the meat and added a nice texture.  The chopped rib eye on the sandwich was excellent!  The generous portion had a nice carmelization and a subtle salty taste.  The white American cheese and onions all melded together into a great sauce.  This is as good as any of the Philly cheesesteaks I have ever had.  It comes with fries, but honestly they weren't that great.  Perhaps that is a Philly style French fry? For dessert they even have Tastycakes!<br><br>If you want a taste of Philly check Monti's out!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/2ptR8cfo-S13wlWCw2mxww/168s.jpg", "caption": "I enjoyed my meal"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/BGrwkMRRcMCPnx4D5EilvQ/168s.jpg", "caption": "Amazing philly cheese steak"}]}}, {"review": {"des": "My buddy has been telling me about this place for years. Finally came here and I let him order for me. I had a 12\" Rocky, with Jalapeno and serrano peppers! I love spicy food and eat it often, but boy this was pretty damn spicy. I started sweating like I was in a sauna and my mouth was numb lol..  I had to take half of it home. And heres the thing, couple hours later when I ate the rest, the spice calmed down and it was amazing. <br>    Aside from spice, I must say the meat, the bread and overall flavor is top notch. It was not overly greasy or salty, pretty close to perfect. This is has to be the best Philly Cheesesteak In Chicago!! I already want to go back and try the other sandwiches. Ps they have a pretty good beer selection, including ZombieDust  my fave #craftbeerpoints!", "pics": null}}, {"review": {"des": "I've worked in the food industry, so I know what it's like when a customer comes in twenty minutes before closing. But, if you can't handle it, then don't work in the food industry! This will inevitably happen and customers shouldn't feel uncomfortable from the moment they walk in. Before walking out, the server/bartender made it a point to pull out the saran wrap right in front of us at the bar - On top of the other rude hints, this is what triggered my review...<br><br>Despite the above... shout out to the cooks! You guys are the real MVP! Just had the BEST cheesesteak ever - hot, juicy, and tasty! Our italian ice was on point too. <br><br>We'll be back with hopes that our customer service experience is better. Great spot worth checking out though.", "pics": null}}, {"review": {"des": "The husband always talks about having a real Philly cheese steak and his deep love for them. I've had cheese steaks in my life, but never like the original ones from Philly. So I wasn't quite sold on cheese steaks. We heard of Monti's through a few people. We decided to make the trek for his birthday lunch. The area is quite residential and the place is pretty laid back. I can see this place as a great local bar/restaurant to have in neighborhood. <br><br>We opted for their original Philly cheese steak with cheddar sauce lunch special with a cup of chili and an order of wings to split. The wings are addictive! Perfect amount of breading and sauce ratio. Great tang on the buffalo wings that is ohh soo good. It was like the wing gods gave us their best wings. Oh trust me, I've eaten a lot of wings in my life that it would probably disgust most folks. These were great wings. <br><br>Now lets talk about their cheese steaks! The amoroso bread has this wonderful softness in the inside but light crisp on the outside. Not sure how to quite explain it, but the bread has this texture that compliments the meat and cheese really well. The make their own cheese sauce that definitely shined on its own ...not too salty, not too thick or bland. Needless to say, I inhaled this sandwich and wondered when are we coming back. The chili was pretty good too! <br><br>Pretty sure I would eat here at least twice a week if we lived closer. Great service and food. Wonderful neighborhood restaurant that really shines. Oh yeah, we did come back and brought our friends along. They're in love with their food just as much as we are.", "pics": null}}, {"review": {"des": "Just stopped in.....only read the reviews since I'm not from the area and since we were in the area we thought we'd try it. All I have to say is believe the hype!<br><br>This is the best Philly cheesesteak sandwich I've ever had in Chicago and it's right up there with Jim's in Philadelphia as the best cheesesteak sandwich I've EVER had!!!<br><br>Steak cooked perfectly with onions, the homemade rolls were outstanding and the spicy mayo I had on the side topped it off. And the fries were great also.<br><br>And get an Italian ice to go......Awesome!!!<br><br>Katie took great care of us!!!! Kudos to Jim the owner.. we'll definitely be back!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/GidT9FfNkXdRekwkfAHg-Q/348s.jpg", "caption": "Roasted Turkey sub"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/QsVLNMaAg0uskPa-8hCPwQ/168s.jpg", "caption": "8 inch Authentic Philly Cheesesteak"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/TaViWHF1IxPCI7K04uH4kg/168s.jpg", "caption": "Mini original Authentic Philly Cheesesteak"}]}}, {"review": {"des": "I don't think that there is any human way possible to mess up a Philly Cheesesteak but I have had some real questionable ones in my past.<br>Well I'm pretty damn impressed with this place! I've had a Philly Cheesesteak craving for a while now but really couldn't make up my mind when to take care of it. So instead playing on the internet and trying to review hundreds of places, I started a yelp thread and asked where I should go for the best Philly in town and my fellow Yelpers  recommended Monti's.<br><br>When we got here the vibe was very relaxed and it looked like a friendly neighborhood bar that has been around for a while. We seated ourselves at the bar and were waited on right away (I wish I remember the bartenders name). Since it was a weekday, we decided to pass on drinks and stuck with soda. We also ordered right away and the toppings of my cheesecake were green peppers, mushroom, provolone cheese, mayo and onions.  The thing was AMAZING I absolutely don't have anything to complain about!  It was fresh, well seasoned and satisfied my craving.<br><br>We live on the other side of town and would come back here any day of the week.", "pics": null}}, {"review": {"des": "The Place<br>Monti's is located at 4757 N Talman Ave Chicago, IL   That's said it's in Lincoln square just off Lawrence.  It is a pub atmosphere with a Pennsylvania theme.  There are seats at the bar and ample tables available.<br><br>The Menu<br>Monti's has many menu offerings, starters, soups, salads, hoagies, grinders, desserts etc.  Their focus and specialty Is on Philly Cheesesteak and they do it very well.   Simply amazing!!! They have a good variety of options and add-ons but the Philly cheesesteak is delicious.<br><br>The Experience/Value/Service<br>Overall we had a very positive experience at Monti's.  Good selection of beers and mixed drinks.  Our service was good the place was clean and the value very fair for the cheesesteak delivered.  You may find a cheaper cheesesteak but I'm not sure you will find a better one!!! Highly recommend you give Monti's a try.", "pics": null}}, {"review": {"des": "Not bad for a greasy spoon.<br><br>I had the Rocky with the cheese sauce.  The sauce was a bit musty but the rest of the sandwich was pretty good.  The fries were not crispy but i like them served as such.  I ordered  take out but when i got there the place seemed very relaxed, clean, had a fully stocked bar with craft beers, and comfortable. I'm going back to dine in and try something else on the menu.", "pics": null}}, {"review": {"des": "This place is a little gem hidden off of Lawrence street in Lincoln Square! I lived up here for a year before I even knew it existed. An Uber driver actually told me about during a ride one day. Obviously I took his advice and went in. <br>Let me just say that I am very particular with claims of serving a 'Philly Cheesesteak', but this place did NOT disappoint! The cheese sauce is so so bomb and they really just pack it all into the buns. AND THE FRIES!!! Some of the best fries in Lincoln Square. Honestly. <br>Looks like a lil sports bar on the inside. The staff is fantastic and very friendly. Definitely a place to visit and try.", "pics": null}}, {"review": {"des": "Rounding up my tour of Chicago feeding frenzy with a final, climatic, and momentous stop at Monti's. Their 8\" Southside Johnny (mushrooms & onions) was my Pilly Cheesesteak of choice.<br> <br>While the SF Bay Area where I come from has some of the best food available anywhere, there is nothing that quite compares with this Cheesesteak just consumed. We got nothing on you, Monti's! <br><br>Thank you God, that I live 2300 miles from your doorstep, thus limiting my exposure to the food offered here. If Monti's were much closer  I would have to say goodbye to my girlish figure, of which I have worked soooo hard to achieve.<br>.<br>WOW! is all I can say after my experience of consuming such a wonderful sando. If I tried to describe it to you, I would probably just be doing a disservice to both the owners, friendly staff, and the venue itself. An epiphany here, folks!<br><br>While their accompaniment of fries aren't quite up to the same par as the cheesesteak itself, (Portillo's on downtown Chi-town has the fries market cornered!) I would personally urge you to make that special trip out to Talman Ave in Ravenswood for this very special and A-W-E-S-O-M-E treat. You won't be disappointing yourself. The best EVER!<br><br>Indescribable deliciousness! Eew-wee, gooey, juicy lusciousness. Words I have never ever used for a sandwich. They are appropriate descriptors here. Don't doubt me, just drop by to see for yourself.<br><br>And if you do go based my review, remember: YOU OWE ME!<br><br>Enuf Sed!!", "pics": null}}, {"review": {"des": "Was craving a true Philly Cheese Steak and thankfully Yelp guided me to Monti's!  The Cheesesteak is exceptional!  Friendly neighborhood vibe with a small bar and moderate seating (10-15 tables). <br><br>Katy has been the bartender on both of my trips and she is excellent. Friendly service & remembered what I liked even though I had only been there once before.  <br><br>On my 1st visit I had the 'South Side Johnny' which tosses some mushrooms, grilled onions, Swiss and horseradish sauce  on an excellent hoagie bun. Today I did the Authentic Philly Cheesesteak w/aged Cheddar Sauce.  Can't go wrong with either one - they were both delicious.  <br><br>They offer these in 3 sizes \"Mini\", 8 inch and a foot long.  Fries come w/your cheesesteak and they too are delicious.  <br><br>I highly recommend Monti's and hope you are lucky enough to have Katy take care of you. Enjoy!", "pics": null}}, {"review": {"des": "If you're craving a cheesesteak, I don't know of a better place in the city. Hot and melty with great soft bread. Good low-key neighborhood vibe if you eat in. Nice beer selection and kids' foods they'll eat. Do it!", "pics": null}}, {"review": {"des": "Monti's is The most LEGIT Place in the Land of Lincoln for a Philadelphia Cheesesteak sandwich!  I tried a 12 inch Philly with cheese Whiz \"Aged cheddar mushrooms, onions, jalapeños and a side of pickled Serrano peppers (Extremely hot)for my fries and wow was I blown away. Most juiciest beat tasting sandwich I've had in a long time. The original Philly flavor and quality is definitely there. Will be back soon! Beer selection is also GREAT.<br><br>Thanks Montis!!", "pics": null}}, {"review": {"des": "Addendum to my cheesesteak pilgrimage (see my list!)<br><br>Back in 2009, I was working out in Philadelphia and made it a point to go to a different cheesesteak joint once a week. I reviewed them all (Dalessandro's all the way), and added a couple more non-Philly reviews in 2010.<br><br>Well, we're back.<br><br>I've heard of Monti's for a long time as being the one true cheesesteak in Chicago. However, I live quite far from it and it would need to be a good reason to go all the way up for it. Having taken a day off for my birthday, and with the wife being off, it was good enough for me.<br><br>I was quite surprised to find that Monti's isn't some kind of take-out joint, but a sit down bar/restaurant. Worked for me. We decided to split some wings, then each get the lunch special which got us a mini sandwich and some chili.<br><br>The wings are worth the trip alone. Wings are my favorite food, and these are some of the best buffalo wings in the city. Not too saucy, perfectly crisp and huge.<br><br>The chili was tasty too, but takes a back seat to the sandwich.<br><br>Yes, this is indeed the best Philly I've had in the city. Sadly there's no Whiz here, but they do offer their own cheese sauce which worked just as well. Again it's not too much, just enough to coat the meat and start to soak into the bread. And the bread is perfect. As with many regional sandwiches, the bread can make or break it. Just like Chicago beefs need Turano or Gonnella, they serve up authentic Amoroso rolls here. Soft but crisp on the outside, it works well contrasting with the cheesy beef within.<br><br>Monti's is now one of my favorite spots in the city. I wish they had one further south, but it might literally kill me. Yes, the wings and cheesesteak here are death-worthy, and I can't say that about many places.", "pics": null}}, {"review": {"des": "Just a shout out to my friends at Monti's! Had a delicious cheesesteak sandwich on Saturday that I brought over to Dovetail Brewing. Patrons and staff alike, proclaimed the Philly original smelled terrific, and it paired perfectly with the Dovetail Lager.<br><br>On Sunday, my girlfriend and I shared another Monti's treat when we attended Wingfest in Wrigleyville. Read my review for yourself, but Monti's wings blew past the competition with a crispy skin, spicy buffalo sauce and tender poultry that really stood out against the rest.<br><br>A challenge for the management team: What's your favorite cheesesteak sandwich in your home city of Brotherly Love?", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/7sVMMfb0Oc57H9F8lquofA/348s.jpg", "caption": "Love a Monti's Cheesesteak with Dovetail Lager"}]}}, {"review": {"des": "There is absolutely nothing here that isn't delicious! Even the salads are great and that's surprising for a place that does the greasy essentials perfectly!", "pics": null}}, {"review": {"des": "This place offers the best Philly cheesesteak in Chicago. The best part is that they have the option for cheesesteak flights! My friends and I enjoyed their food and incredibly good service from their friendly staff. Also, don't miss out on their finger licking buffalo wings! The sauce was to die for! We'll definitely come back for more!", "pics": null}}, {"review": {"des": "Cheese steak was delicious. Had the 12\" with the cheese sauce. It was so hot I nearly burned my mouth because I was so excited to eat it. This was only my third or fourth cheese steak sandwich, but first one from Montis. I've never been to Philly, but something tells me the locals would approve. <br><br>Montis has a cool dive bar atmosphere. Not a huge place but I was here for lunch during the weekday. I'll have to check it out during a weekend and get some drinks next time.", "pics": null}}, {"review": {"des": "I have to give it five stars b/c I thought it was great.  It's definitely a little divey of a space, but there were two different families in there Saturday night when we went and so you also know it's a neighborhood spot.<br><br>I started with a fruity martini and it was strong - and only $8.  That alone will bring me back!  AND, they contained several different bottles of Bols liquor.  Not many places have this liquor from Amsterdam.  It's a great liquor!<br><br>My husband had the \"Rocky\" - dear god that was hot and spicy.  He loved it but I could never eat a full one of that.  It had great flavor, but too spicy for me.  I had the \"Niko the Greek.\".  It was perfectly greek - from the sweet and savory gyro meat to the soft bread to the wonderful tzatziki sauce.  I would get this item again and again.  <br><br>I will definitely come back to try other items as well as stick with the few that we had.", "pics": null}}, {"review": {"des": "Serrano Peppers are effing amazing! Super spicy but great! <br><br>Footlong Philly = Happiness! <br><br>You guys are simply amazing. Will keep ordering from you , except this time, I'll def take the flight! !", "pics": null}}, {"review": {"des": "Awesome local hidden gem. Great selection and excellent wings! Service is also always attentive and friendly", "pics": null}}, {"review": {"des": "Monti's is just okay to me. Honestly the best part is their bread it was nice and soft and had a nice chew to it other then that it's just meh to me. I got the original cheese steak with cheese sauce I asked for extra cheese.The steak itself wasn't dry but very bland and tasteless. It comes with side of French fries that are less then an handful and cold so personally not worth the $15 to me.", "pics": null}}, {"review": {"des": "There's something about Monti's that seems more refined than Philly's Best, maybe it's the table service.. or maybe it's the neat food preparation. I don't know if that's a good or bad thing. <br><br>The Roast Pork with broccoli rabe is better than their cheesesteak, but both are good. The water ice is authentic and the service is exceptional for a sandwich shop.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/q79sRSiSnFfw2B9QmdeEbA/348s.jpg", "caption": "Water Ice - Lemon"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/9vt_UUr8UR41xR-cF_DZlg/168s.jpg", "caption": "Fries"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ivY2VbeRweDq_XgwJaYYAg/168s.jpg", "caption": "Roast Pork Loin - Roasted peppers, broccoli rabe, smoked provolone. Side of chilli."}]}}, {"review": {"des": "I live right down the street from Monti's, so we dine in pretty regularly. The sandwiches are generally great, but the Rocky is the most inconsistent sandwich on the menu. Sometimes it's the perfect amount of heat, and other times it's practically inedible because it's so hot. I've asked for medium spice and gotten nothing. Last night, I could hardly swallow the sandwich it was so hot.<br><br>Anyway, Monti's just seems off lately. They opened late (or not at all?) this past Wednesday leaving people literally standing out in the cold. Yesterday they were out of 8\" bread, and my server seemed to be the only person working the floor. I want it to be my neighborhood joint, but it's just too dark and uncomfortable to compare to my other go-to, Rockwell's.<br><br>It always takes a little too long to get your food there, especially with two kids, but last night was longer than usual. Once we got our food, that was the last time I saw our server until I needed to flag her down for the bill. I asked for a to go box for my too-spicy sandwich (which I ended up eating because I couldn't wait for more food), but after waiting for that too, I ended up just leaving. It was busy, I know, but if that's the case, Monti's either needs to add staff or help their staff better multi-task. <br><br>I'm definitely taking a break from Monti's. There's plenty of other places that take forever and give me heartburn; I'll just start making my way through them. And just a side note, I really hate that the kid meals don't include a drink in the price.", "pics": null}}, {"review": {"des": "We loved it here, great room excellent looking bar.  Waiter super cool very knowledgeable on menu.  Can t wait to try other things besides the cheese steak.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/pyfs-frbmNB06UdRcOd-YA/168s.jpg", "caption": "Great chili"}]}}, {"review": {"des": "Good place in a nice neighborhood. Came upon it during a massive neighborhood garage sale which was fun!. Service was good. Food was great. I got a lunch special of a mini Phili provolone  sub and a mixed greens side salad. Bread was just right.  My love ordered a Niko the Greek sub. He enjoyed it very much. It's a gyro type sandwich.  If you check-in with Yelp you get a free Italian ice. Which we all enjoyed. We recommend!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/4V6aV9Ap8wEJd4Me7WTObA/348s.jpg", "caption": "Italian ice"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/gPQLjvMTmKK_U5SWafi4Tg/168s.jpg", "caption": "Niko the Greek 8inch. And fries"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/-BzqL2aTo67WeDtUADWF_g/168s.jpg", "caption": "Mini Phili with provolone and side mixed greens salad."}]}}, {"review": {"des": "It was my first time trying this place with my boyfriend. The outside didn't seem too modern, but once you come inside the interior does grab you.<br><br>It is very clean, spacious, and inviting interior. For a Saturday, it was pretty empty but I can't complain since it was absolutely freezing. <br><br>Our waitress was on point. She gave great customer service.<br><br>We ordered the jumbo wing, rocky sauce. Wings was cooked perfectly! Skin was crispy and the inside was juicy. Rocky sauce taste like a cheddar jalapeño sauce. Delicious.<br><br>We had the authentic philly cheesesteak and rocky. Delicious! It was something so simple that hits you with a lot of flavor. It didn't have to be dressed up in any fancy sauce. It was simple, flavorful, and filly.<br><br>Also, water ice mango. Yummy!", "pics": null}}, {"review": {"des": "This here ladies n gents is The Rocky. Monti's is Philadelphia themed small restaurant know for their cheesesteaks and this sucker sure packs a punch. From the jalapeños to the charred Serrano peppers, this thing will make you sweat - the spicy mayo is a touch too. It's no wonder this one is known to pack a punch!! They've got a nice selection of craft beers and I'm coming back here as soon as I can to try the rest of their menu!!", "pics": null}}, {"review": {"des": "We came here because of the menu and reviews indicating they had gluten free options, but when we arrived in mid-April, we were informed that they hadn't had any gluten free breads or equivalent since early February. So, I ended up with some vegetables and hummus with a soda. I don't recommend Monti's to anyone with food allergies or celiac disease. They seemed a bit flippant about the whole thing. The server was friendly to us, but the availability of options was incredibly disappointing.", "pics": null}}, {"review": {"des": "This is easily the best cheesesteak sandwich in northern Illinois. I've been to this place at least 15 times over the years. Always quality made fresh how you want it.", "pics": null}}, {"review": {"des": "I love a good cheesesteak so when I saw all the rave reviews on Yelp I figured I had to give Monti's a try. I got the 12\" authentic Philly and I asked the waitress for a suggestion for what cheese to go with. She said get provolone on the sandwich and some cheddar for your fries. That sounded good to me so I went with it. I just wish that when you suggest something like that to a customer you let them know there's an extra charge for more cheese. The sandwich itself was fine, very far from special and the fries would have benefited from some extra cooking time. Maybe their wings are what people really come here for but just based on my sandwich I don't get the hype.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ORMpkwJJzg5yW6Rgu3dHCg/348s.jpg", "caption": "12\" authentic Philly"}]}}, {"review": {"des": "Hidden gem in Albany Park, I'd definitely recommend this place to any one who love a philly cheese steak.", "pics": null}}, {"review": {"des": "Monti's, I hate to love you. But I do, I do!<br><br>You see, as a gluten-free girl living in a carb-loaded world, sometimes I miss a good ol' sandwich. Gluten-free bread is typically gross at its worst and slightly strange at its best. However, the gf bread that Monti's uses for their sandwiches is legitimately awesome. As in, a fireworks brand of wow! They get it from Deerfield Bakery, in case you're interested in making the trek to the North Shore for some bombtastic bread.<br><br>The classic Philly sandwich is made of all the things I crave when put together: juicy, thinly-sliced Angus ribeye, a generous amount of melted American cheese, grilled onions, shredded lettuce and mayo on that impossibly good hoagie roll. Being gluten-free, I generally eat fairly \"clean\" but sometimes, the stomach wants what the stomach wants (see first sentence of this review). This Philly sandwich, my friends, is the ultimate comfort food. <br><br>I ordered my sandwich to go though next time I'll stay in, as Monti's has that cute neighborhood bar thing going on.", "pics": null}}, {"review": {"des": "I love a good Philly Cheesesteak! While you will find a good one at Philly's Best Monti's is the competition crusher. I've eaten at Monti's so many times and never had a bad Cheesesteak. They are made to order and the icing on the cake for me is that I don't have to have it with cheese whiz or nacho cheese sauce. I love the white American cheese. Sometimes I like it hoagie style. The fact that they have options is why if I could I would eat there every day. However, that wouldn't be healthy. I really do love Monti's though and will continue to tweet about it.", "pics": null}}, {"review": {"des": "Philly Cheesesteaks are one of my guilty pleasures and this is by far the best place I have had them in Chicago.<br><br>I am far from an aficionado on authentic cheesesteaks but the bread here is the only place I have found that is on par.  I believe I read they have their rolls shipped in from Philly.  Sounds pretty tough to get more authentic than that.  Cheese options for the steaks are good.  Have tried both the aged cheddar and whiz with nothing to complain about on either.<br><br>Fries are just ok which is about the only complaint.  I still need to try the Rocky, want to see if I can deal with the heat.  That is for next time!", "pics": null}}, {"review": {"des": "I've been wanting to try Monti's for a hot minute every time I've come across it on Yelp. I've never had an authentic Philly Cheesesteak before so I really have nothing to compare it to but I must say that this is the best one I have had thus far.<br><br>Parking is a little bit tight but we got lucky with a pay to park spot just around the corner. It was pretty low key on a Saturday night right before 9 so we got seated right away. Although, it got pretty packed before 10 right before they close. Service was excellent throughout our entire dinner. The waitress who helped us was a real sweetheart and always made sure we were checked up on. They also had a pretty sick music selection playing anywhere from Bruno Mars to Fallout Boy to Evanescence- so I was pretty sold already. <br><br>We started off with an appetizer of buffalo wings with buffalo sauce. They give you other sauce options like bbq or whatever you ask for really. They were awesome. The buffalo sauce was delicious and the breading was super crunchy and every bite was succulent and juicy. My only complaint was they weren't jumbo sized like they listed and they only give you 6 so it's only 3 per person if you're with another party. Boo. But very good! <br><br>I had to try the cheesesteak I mean it really wasnt an option. They have several different kinds like a gyro one and I saw a pizza flavored one too. I decided to not get crazy and start off with an authentic cheesesteak that comes with grilled onions and your choice of cheese: provolone, cheddar, white American, etc. Get the white American cheese-you won't be disappointed! They have 3 diff sizes: mini(5\")regular(8\") and the largest one(12\"). I got a mini and that was more than enough for me! The steaks come with fries too. The fries were just okay but it was a good combo with the steak so I couldn't complain-they're doing something right!<br><br>My favorite part of the sandwich was everything but I loved the bread! It was a perfect combo with every bite of the steak and the cheese. It wasn't soggy and you had a nice crunch that complimented the cheese and steak very well.<br><br>Oh! And if you check in on Yelp they will give you free shit. I checked in and I was offered a lemon ice that I saved for next time. <br><br>All in all, great service and great food.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/jpKJ5QdTPI8CoXAaZX2GVw/168s.jpg", "caption": "Buffalo wings"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/-tJ7-f4aaLjhq3eHnHjZlg/168s.jpg", "caption": "Mini(5\") classic cheesesteak in front and 8\" regular in back"}]}}, {"review": {"des": "I ordered the philly sampler and it definitely exceeded expectations. I love cheesesteaks though, so I was expecting to love it. Specifically, I ordered The Rocky, Niko the Greek, and the Authentic Cheesesteak. I got the Cheesesteak Hoagie instead of the Authentic which was kind of a bummer, but I ordered take out so it wasn't worth mentioning it to them. The rocky and Niko the Greek were amazing!!!!! I will definitely go to this place again if I'm in the area. <br><br>The restaurant itself is pretty small and intimate, but in a good way. It felt like a comfortable place to sit down and have a drink and great food and their beer selection was good too.", "pics": null}}, {"review": {"des": "Brought my hubby in for Father's Day! I am so glad I did! It was the best Philly cheesesteak we ever had! Portion for mini was good enough for just one person. The meat was sooo goooooooood! The perfect seasoning and amount! Make sure to check in via yelp so you can get the free Italian ice. They have different one everyday so you have to ask what is the flavor of the day. We had the Mango. Not to sweet, not to tangy. Just PERFECT. It was the perfect way to end our lunch. I highly recommend to give the spot a try!", "pics": null}}, {"review": {"des": "I don't even like cheesesteaks, but i love the ones at  Montis! It's always great, every time. The servers are nice, pretzel nuggets are amazing, I've had the original steak, pizza steak, and basic turkey sandwich, and they're all delicious.<br><br>Only thing I might stay away from is the coconut chicken...the tenders are not great. <br><br>But everything else is perfect! They also have a great beer selection and weekly cocktail special.", "pics": null}}, {"review": {"des": "Our service was excellent and the cheesesteaks were even better!!  Hands down my favorite Philly joint!", "pics": null}}, {"review": {"des": "Hot damn. I showed up hoping for a decent steak and cheese and I got one of the best sandwiches of all time! We got the Greek gyro and the southie style, both were absolute home runs. Fries were ridiculously perfect too. 10/10. I'd write more, but it was such comforting food that I need to go take a happy nap now :)", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/G7JphDi16ahlkViUqcP_jg/348s.jpg", "caption": "Best of both worlds"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/e-s4jdzonZGqRDmr3tPPgQ/168s.jpg", "caption": "Greek gyro"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/WMveOHe1Clxtvju2D4z3Kw/168s.jpg", "caption": "Southie style"}]}}, {"review": {"des": "As a flight attendant, I've had real philly cheese steaks, and you know what? These are BETTER! The best cheesesteak I've ever had! Great Place!", "pics": null}}, {"review": {"des": "Had Monti's bookmarked for the longest time, finally made it happen xD<br><br>Ordered the cheesesteak sampler ($18.95 for 3 minis plus fries), picked their authentic philly, southside johnny, and pizza steak. All satisfyingly delicious, hard to pick a favorite. The bf and I both agreed that the southside johnny had a good amount of mushrooms, but its horseradish cream sauce could use a punchier presence. Also, pickles would be reaaalllly nice to have on the side.<br><br>Italian water ice free with yelp check-in, yum, except metal cup + metal spoon gave a slight metallic taste.<br><br>Friendly service, already looking forward to eating here again.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/100E6EvNIx7wN3SnqzYTXQ/168s.jpg", "caption": "Cheesesteak sampler ($18.95). Repeatworthy"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/C8m0tC5TU2fYJS-3JDKSIg/168s.jpg", "caption": "Italian water ice"}]}}, {"review": {"des": "My husband had a craving for a real Philly cheesesteak, so I found this place on Google and then confirmed that it was good on Yelp. So glad I found Monti's! The cheesesteaks are amazing!!<br><br>We went on a Tuesday evening. It was quiet and we both had a Bloody Mary. We also enjoyed the pretzel appetizer. The cheese sauce was delectable and the pretzels were so fresh. <br><br>I loved that they had various cheesesteak sizes. The sample plate looked like a great option, but I couldn't justify spending $19 for that. Instead, I had The Rocky and my husband had The Southside Johnny. The horseradish cream was absolutely amazing. The beef on both sandwiches was so fresh and the bread was perfect. <br><br>My only two recommendations: maybe it's a tourist thing, but in Philly, the cheese is usually cheese whiz. I think Monti's should offer that on the classic cheesesteak as an option. Also, The Rocky was SO spicy that I had trouble enjoying the flavor. I still enjoyed it so much, but the spice can be cut by about 30%. <br><br>Great place for a Philly cheesesteak...highly recommended!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/QJ8jDpltky_tA4oSl2y-GA/168s.jpg", "caption": "The Rocky in the front and Southside Johnny behind. Loved that they tossed my salad before serving."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/FSBZ6ByhaX7aehIcbJnh4g/168s.jpg", "caption": "Pretzel app"}]}}, {"review": {"des": "The Philly cheesesteaks are amazing, the beer selection is awesome, and the Italian ice is bomb.", "pics": null}}, {"review": {"des": "Original philly cheesesteak with smoked provolone cheese was delicious but needed more cheese. I'd order extra cheese next time.", "pics": null}}, {"review": {"des": "The husband and I have been here many a times , so a review is due! The basic philly with white American cheese is the way to go unless you do a special and my recommendation is.....I can't remember the name, but it has mushrooms, onions and I believe Swiss cheese. We tried the wings for the first time this last time we were there, buffalo, and WOW, now I know why they are known for their wings. They skimp on the carrots and celery initially but if you ask for more, they bring you a helping three times bigger than the initial offering. Great beer list including IPA, wits, and ciders. I'll be back for sure!", "pics": null}}, {"review": {"des": "Maltesers got one of the best philly cheesesteak in Chicago unless someone can tell me otherwise come on in and test it for yourself", "pics": null}}, {"review": {"des": "Another hidden gem that was recommended by a friend for legit philly cheese steaks.  Definitely a place you would not notice if you were drive through this area.  Its located on the side street so don't expect to look for big signs off of Lawrence.  <br><br>Each time I have ordered The Rocky since I love spicy foods and it is amazing.  I have also tried the South side johnny and that is really good as well.  <br><br>Went there recently because they were recommended for their chicken wings and they are pretty good and pretty big in size.<br><br>Make sure to check in while you are there to get a free italian ice dessert!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Q_lfncQuUkz-aq8OxolBlA/168s.jpg", "caption": "I love love love their hot sauce tray"}]}}, {"review": {"des": "Having gone to school at the University of Pennsylvania, I was beyond excited when I saw the UPenn pennant hanging on the wall of Monti's.  From that very moment, I just knew that Monti's was going to bring the heat...so, in my mind I said, \"Bring it on!\".  Surprising enough, Monti's actually provided me with my first experience with a Philly cheesesteak.  Call me weird, but at the time that I attended UPenn I was vehemently anti-cheesesteaks...you'd think I had a beef with them or something (Hahaha, I crack myself up).  Anyway, tangent aside - the cheesesteaks here were sublime...I was right - they brought the heat.<br><br>And they brought the heat both literally and figuratively.  Literally in the sense that The Rocky is doused with some serious peppers; it may have been spicy, but it was damn good.  My fiancé and I ordered The Rocky as a part of the sampler - three 6\" cheesesteaks of your choice with a side of fries.  We had also gotten the Authentic Philly Cheesesteak as well as the Niko the Greek, both of which were encased by the best buns ever.  I have to say that my favorite was the Authentic, but the others were a very, very close second and third.  The Niko the Greek is filled with gyros and Taziki sauce - pretty much everything you would find if you'd gone to a Mediterranean restaurant.  The gyros and the beefsteak in the other two sandwiches were so incredibly fresh, not to mention lean.  I guess that I had always expected cheesesteaks to be extremely fatty, but Monti's turned this perception upside down. I also have to give a shout-out to the fries: yummmmmmm!<br><br>We rounded out our cheesesteak extravaganza with some mango Italian ice (free with a Yelp check-in) which was apparently in season.  The last Italian ice I had was in the hospital, but this stuff was SO much better!  It made me realize that yes, Italian ice is actually good so long as you're not getting it from the hospital cafeteria.  Seriously, though...this Italian ice here at Monti's was awesome, with the exception of the brain freeze that accompanied it.  <br><br>When I'd arrived to Monti's on a Thursday night it was filled with a couple families, a couple groups of friends and then another couple so obviously it attracts a wide array of people.  It's the perfect food to get a little messy with in the comfort of the people you love, and you get to get down and dirty in a small and comfortable atmosphere.  Monti's is the epitome of \"chill\" - I can't find the words in my vocabulary to explain what I mean, but it's a place where you'll feel welcomed, without any rush to leave.  The only thing that might make you leave is the fact that the meter where your car's parked is running out.  Speaking of which, it can be somewhat difficult to find parking right around here, but if you don't mind walking a little bit, parking is available.  Besides, you're going to have to walk off all those delicious cheesesteak calories you just consumed.  <br><br>P.S. they have Three Floyds beer (but it's bottled)!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Wb6V2HPQeNFDGhAcsnk0jw/348s.jpg", "caption": "Mango Italian ice"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/mJ63LuoLePoDhjflA1j1-w/168s.jpg", "caption": "The sampler with the Nico the Greek, Authentic Philly Cheesesteak and the Rocky"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/der5DZ1IN5VL_lnmO6PDAg/168s.jpg", "caption": "Penn!!!  They got all the Philly schools represented"}]}}, {"review": {"des": "We ate at Monti's this afternoon.  I have to mention our adorable waitress/bartender.  I don't know her name.  She took my order for a cheesesteak sandwich and fries and a gin martini on the rocks.  Doesn't everyone drink two gin martinis with a Philly sam'ich lunch?  It's the only way to fly!  She asked about Vermouth.  How much?  I told her not to bother.  She protested.  \"But then it's just a glass of gin!,\" she said.  I told her the story of Winston Churchill. And how he liked his martinis dry.  How dry?  He'd only scowl at the Vermouth bottle across the room.  That's how dry.  She was skeptical...but a good sport.  And she served me two excellent dry martinis.  The sandwich was fine.  A superior martini in Chicago is more rare than a decent cheesesteak.  Go to this place!", "pics": null}}, {"review": {"des": "While we sat in a Lincoln Square radiology center awaiting my results, the BF and I began the usually exasperating discussion of what to eat. To my utter shock, he immediately responded with, \"I could go for a cheesesteak.\" Gee-golly-gosh, so could I! But I figured we were out of luck unless we wanted to resort to the gritty, open-late sort of joint we were too sober to patronize. <br><br>Yelp led our dubious, first-world-starved souls to Monti's, an unassuming storefront tucked away on a sleepy side street, just catty-corner from the HarvesTime market on Lawrence. The room was half-full but seemed almost hushed, aside from the furious clanking of spatulas against a flattop; we took it as a good sign since delicious food tends to shut people up. <br><br>Ten minutes after ordering an original Philly each (mine with added mushrooms and peppers), we were quiet ourselves, save for a few muted \"Fuck, that's good\"s and grunts of concurrence. The judicious amount of house-made aged cheddar sauce melted between and bound the juicy layers of shaved ribeye, piled high on a real Amoroso's roll that managed to be simultaneously crisp, chewy, soft and durable. (As much as I love how an Italian beef disintegrates, I loved that my cheesesteak kept together; it definitely wouldn't have if Monti's got their rolls from, say, Turano or Gonnella.) And the fries were great--crunchy and a deep golden brown. Washed down with Metropolitan's citrusy Jet Stream wheat, the sole draft beer on rotation, our meal was a total success.<br><br>Philly husband-and-wife duo Jennifer and James know what's up. We'll be back and spreading the word.", "pics": null}}, {"review": {"des": "This place is super great the philly cheese steak sandwich was omg insanely good will most definitely come back and make Monti's one of my regular spots to eat out yes it's that good", "pics": null}}, {"review": {"des": "By far the best ever Philly cheese steak I ever had! Hands down. I'm usually picky with mine but when my friend said I should try it out and I did oh lordy lordy that was fiyah! This little hidden gem was hiding from me with its delicious sandwiches! Badda bing badda boom hands down this Philly cheese steak gets the Chi-town air 5 peat approval.", "pics": null}}, {"review": {"des": "Great service. Great food. Manager/owner was very kind and approachable. Would highly recommend", "pics": null}}, {"review": {"des": "We come here when we need our cheesesteak fix and are never disappointed. The cheesesteaks are \"legit\".  They are so good I always forget to take a picture. They also have great service and a great beer list. We love Monti's.", "pics": null}}, {"review": {"des": "Amazing philly cheese steak that will make you think of it hours after you finish it. Top spot for me when it comes to phillys. Open at 11 please!", "pics": null}}, {"review": {"des": "This place is soooooo awesome. The food is so delicious, the best Philly I've had in Chicago and the wings are so tasty!!!! The service is always great and I've never had to wait. It's not a large restaurant so if you're coming with a big party definitely call ahead.", "pics": null}}, {"review": {"des": "Day 527: Monti's: Sometimes you just need a cheesesteak. Unfortunately, sometimes that occurs when you are in Chicago, the home of Italian Beef. So where does one go when one wants a sandwich whose goopiness comes from cheese than au jus? Well, it turns out that Monti's is a great place to start.<br><br>Walked in, and took a couple of seconds to get our bearings, either because it was unusually bright outside or unexpectedly dark inside. I mean, I don't really expect romantic ambiance from a cheesesteak joint, so it took a while for the eyes to adjust. We were seated and ordered drink and an order of soft pretzel nuggets and buffalo wings for starters. Both of which were great, but maybe not so much that you would say \"Hey, let's go to Monti's for Wings and Pretzel Nuggets\". Indeed he real star on the plate was the Aged Cheddar Sauce which, surprisingly, was not Cheese Wizz, but rather a Wisconsin Cheddar Fondue that went quite nicely with the pretzels. Though I went with White American on my cheesesteak, I stashed the cup of the cheddar sauce for later.<br><br>The cheesesteaks arrived, and they were excellent, not merely grading on the \"for Chicago\" curve, but indeed, by the standards of the Philadelphia Local Pizza Joints I have partaken in. Thick Amaroso rolls, shaved beef with just the right amount of sauce to juicily bite into, gooey cheese and onions just-a-little-more-crunchy-and-carmalized-than-merely-grilled. I also tried the South Side Johnny that Allison ordered: the horseradish sauce that accompanied it was creamy and just the right amount of strength, but almost unneccesary. A good cheese steak is a formula that doesn't need to be messed with. Also very much enjoyed the fries: nice and potato-ey, perhaps for mopping up any extra cheese or sauce.<br><br>We left in high spirits and with a sticky bun that was... okay, I guess. The main thing to consider is that they HAVE sticky buns in the first place. And Water Ice. And Hoagies. And most things that generally dominate Mid-Atlantic that are usually unavailable in the Great Lakes region. The craving for a good cheesesteak may be a twice-a-year kind of thing, but I'm glad Monti's is here to solve it.", "pics": null}}, {"review": {"des": "Was looking for a Philly style cheesesteak and found Montis on yelp...highest ratings so I drove the 7 miles to try it. SO GLAD I DID! Super clean..very nicely decorated...Staff was VERY nice..the food was so hot when it arrived I burned my tongue. I ordered the 12\"philly with smoked cheddar cheese sauce...could have had a bit more cheese but it was AMAZING. Will totally go again.", "pics": null}}, {"review": {"des": "The absolute best sandwich in the city, possibly the country. The perfect peppery shaved rib eye melts in your mouth. I've tried hundreds of Cheesesteaks across the country and its easy to screw up. Ive eaten 100+  Cheesesteaks from Monti's and never had a subpar sandwich. Always great draft beer selections as well", "pics": null}}, {"review": {"des": "I was in the mood for a cheesesteak sandwich and Monti's popped up as one of the best places in the city. I had the 8\" Rocky specialty cheesesteak and it was very good. I may have underestimated how hot the serrano/jalapeno peppers would be because my mouth was on fire! It really does pack a punch! Definitely worth the trip but next time I go, I think I will try the Authentic Philly cheesesteak.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/h-vic7E_69HVS-zQJR6vRA/348s.jpg", "caption": "The Rocky cheesesteak! Very delicious but hot!!"}]}}, {"review": {"des": "I've been looking for a place that does Philly cheese steaks with the right bread, meat and cheese and not had much luck in Chicago until now.  They make a great sandwich and their cheddar cheese alternative for wiz is actually really good.  I would put them up against Jim's, Pat'sor Geno's.  Great fries too.  Local beer options are a plus.", "pics": null}}, {"review": {"des": "My boyfriend and I love this hidden gem of Lincoln Square. It's one of our favorites and frequently come here when we are craving cheesesteak sandwiches. My favorite is the south side johnny which has horseradish. Yum!!  My boyfriend usually gets the rocky which is super hot with scotch bonnet peppers. We've tried some of the appetizers boneless buffalo nuggets where good but the sandwich fills you up so we don't usually get anything else. If you do a yelp check in you'll get a free Italian ice! They have a full bar which is nice too. Nice place to come for Sunday lunch.", "pics": null}}, {"review": {"des": "I never thought I would  be  able to find a place that makes a better cheesesteak than Delco's in FL. Well, I have. And unlike Delco's, they serve Zombie Dust! You have a new fan :-)", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/rnkJM5ST_lgQ06T3CQovqg/348s.jpg", "caption": "Zombie Dust @ Monti's"}]}}, {"review": {"des": "Can't say enough good things about this place. Came here for a date night this past Saturday. We were seated right away, and our waitress was quick to take our food and drink orders.<br><br>The food here comes so fast! We were starving and had our sandwiches in less than 10 minutes, outstanding.<br><br>The food here is always super fresh, hot and absolutely delicious. It doesn't hurt that they have a killer beer selection on top of it.<br><br>I seriously love Monti's and it's one of the few reason's I'm sad I'll be moving out of the area soon.<br><br>If you're thinking about trying this place, stop thinking and just go...like, NOW! You won't regret it, trust me!", "pics": null}}, {"review": {"des": "Brittany was such a terrific server! Very friendly and attentive. She told us all about how their cheesesteak sandwiches are the best in the city ~ bragging like that is only acceptable when you can back it up the way Monti's can! We will definitely be back!", "pics": null}}, {"review": {"des": "Monti's has a great Cheese Steak and the best in the Chicago land area.  The bread is legit and the meat is quality.  They use Amoroso's Bread from Philly.  The Italian Ice is great as well.  The bathroom and kitchen are clean.  Finally, the service is good.  (It's a small restaurant, kind off the beaten path)<br><br>The only real issue with this place is the price and portion size.  I believe since they use ribeye and fly in the bread from Philly, it raises the price of the sandwich.  You are going to pay $10 to $15 for Sandwich and Fries, before taxes.  (They do have smaller sizes)  Also the cheese steak places I grew up on in Philly did not have wait service.  So factor in tip and a drink and you are going to $20 or more.  I still recommend this place.", "pics": null}}, {"review": {"des": "Ordered 12 cheesesteaks for our Super Bowl party as my wife is from Philly.  Everyone at the party raved about how good the steaks were.  My wife and I were just in Philly about a month ago and went to Pat's King of Steaks as well as a small local place.   I must say that Monti's was better than Pat's and the other place.  Also, the owner Jennifer was so nice via phone and in person.", "pics": null}}, {"review": {"des": "I needed to find a new place to indulge my family's love of Philly Cheesesteaks.  I'm a Philly native, so I have some expectations to fulfill.  I found Monti's on Yelp and our visit a few days ago was great. <br><br>We all got cheesesteaks.  The meat was neither too greasy nor too dry and there was plenty of it.  Also, plenty of mushrooms, onions and cheese on all our sandwiches. I ordered the South Side Johnny with horseradish sauce on the side,  which was perfect. <br><br>The fries, which came with the sandwiches, were tasty.  Overall,  a great value! <br><br>Monti's is our new favorite cheesesteak place. I just wish they were closer to Evanston.", "pics": null}}, {"review": {"des": "My husband and i been wanting to try this place for awhile. We finally made it over. My husband got calamari, we both got cheesesteak sandwiches. They were sooo good. Definitely coming back. Its a plus its 3 minutes walking from our house. Our waitress was a really nice lady as well.", "pics": null}}, {"review": {"des": "UPDATE: The response from the business owner is exactly the reason I will never return to Monti's. The employee never once said there was a bad connection when I called to place my order. My money will happily be spent on other local businesses who value their customers. Just a tip: when a customer has an extremely negative experience in your establishment, it's probably better to try to rectify the situation than to further alienate them. Cheers!", "pics": null}}, {"review": {"des": "OMG!! GREAT Philly's!! I had the Rocky along with Calamari a few weeks ago and I must tell you, YOU HAVE to try!! I love spicy and the Rocky Philly has enough kick to it that it won't have your nose running but will have you drinking just a bit of extra water lol The Calamari was so perfectly cooked as well! I will be ordering again!!! <br>  <br><br>Hail to the Rocky!!", "pics": null}}, {"review": {"des": "Came in with my boyfriend a little after the saturday lunch hour. My girlfriend recommended, spoke very highly of the place after a company lunch. One thing that convinced me to add the place to my list of \"you need to try\" was the fact that Monti's offers a vegetarian option. Needless to say, my boyfriend was very excited and really looking forward to trying this place out immediately. <br><br>Upon entering Monti's we were greeted and we seated ourselves. There were 3 other groups dining in, the place seemed a little empty but we didn't let that get in the way. Our server came over and immediately took our drink order, he also answered all the questions my boyfriend had about the menu and even got a few recommendations out of it. <br><br>We came in VERY hungry, we slept in and skipped breakfast. I immediately knew what I wanted. I Had a 12\" Where's the Beef and a side of French Fries. My boyfriend decided on the 12\" Authentic Philly Cheesesteak with a side of French Fries as well. After ordering we waited with excitement. Unfortunately while we waited I overheard the table across from us ordering and not just ordering a standard Philly Cheesesteak they were adding extra ingredients -- I wish I would've known that was a thing!! Maybe next time I'll be able to make an order that fits my liking!<br><br>The minute our order came out my boyfriend and I were pretty amazed and excited to dig in! Being the Yelper that I am, I needed photos! My sandwhich still intact I got the perfect photo to share with my friends and by the time I got to my boyfriend's dish he was already face to face with his sandwich! Everything was pretty great, from the first bite I didn't set my sandwich down! You know it's good when you're holding on until it's gone! My boyfriend was so into his sandwich, he barely spoke to me! He stopped once to tell me how amazing it was and it was amazing!<br><br>By the end of the meal we were so full and completely satisfied! I immediately got a hold of my girlfriend and thanked her. Definitely adding Monti's to my recommendations list and knowing what I know now about the place I'll be more prepared when it comes to ordering! I'll be looking forward to my next visit and I'm sure my boyfriend will be jumping for joy upon our return!!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/G8VCkKLVNxukuwK2PSj24w/168s.jpg", "caption": "The Original!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/gc0ErOOB1Era4-J19G3BMw/168s.jpg", "caption": "Where's the Beef!?!!"}]}}, {"review": {"des": "Absolutely love Monti's. The only question I face is do I get a large or an extra large. Absolutely delicious. On top of that, service is quick and consistent. People are always very nice. Huge fan of Monti's!", "pics": null}}, {"review": {"des": "I'll jump on the bandwagon here.<br><br>I took my wife to dinner for a celebratory time as she was recently promoted at her job and she loves to eat meat, especially beef.  The many high reviews and reasonably convenient location of Monti's persuaded me that this was a good choice for dinner.<br><br>We got the calamari for starters - very good.  Light, crispy, totally good without the included marinara but the marinara was delicious and hearty as well.<br><br>We also got the sampler platter, choosing Niko the Greek, Johnny southside and Rocky. I figured she'd like the Rocky the most based on prior reviews and cause she loves spice.  <br><br>Well, shame on me, trying to 'surprise' her with a new place (she said she likes surprises), she was disappointed it was a \"sandwiches\" place.  Oh well, that one was on me.<br><br>Anyhowz, I was right about her liking the Rocky the most.  It was a little too spicy for my white-bread self but I have no complaint about the taste.<br><br>Unfortunately I started with the Niko one, and yeah, I mean, it was good, but I'd give it 4 stars.<br><br>When I got to the Johnny southside, though, I understood why people are so stoked about Monti's.  Man, so meaty, so hearty and the mushrooms were substantial and 'juicy'.<br><br>We cashed in on the free Italian ice offer - I'm no fan of Italian ice but Monti's version was great, I mean, great like equivalent-to-ice-cream great.<br><br>The wife got Merlot for a drink and enjoyed it.  I got iced tea - [dude, what's with this new trend of including ABV for all the beers? Dude I DON'T want to know!  Again, I digress].  Tea was tasty, lemon wedge was fresh and substantial.<br><br>Our baby girl got the kid's hot dog and dropped it on the floor.  Oh well, can't tell you about taste there.<br><br>Oh, and the fries.  My wife commented that they were fresh and tasty with a lot of potato flavor but personally, I could have done without them.  Sure, some potato flavor (yay) but too thick and a little dry.<br><br>Summary: I get why people rate the place so highly.  The \"mini\" version of the sandwiches is very substantial - about 5 inches long but very filled with yummy beef.  Oh, and the bread was super!  Crispy, moist, just everything you'd want in a beef sandwich type of bread.", "pics": null}}, {"review": {"des": "Everything about this place was amazing!  Our server was very friendly and attentive even going so far as to bring us different cans of cider beer to choose from when my BF couldn't decide & turning on the volume for the Penn State game.  We ordered the buffalo wings, south side johnny, and regular cheesesteak w/provolone.  The wings were top 3 for me in Chicago - HUGE, with actual buffalo sauce (not tabasco) and super crispy.  We ended up getting the mini cheesesteaks and they were the perfect size.  The steak was tasty and the bread SO fresh and the perfect texture; fries were crispy.  We were so happy to spend our Saturday night here enjoying delicious food in a comfy, friendly atmosphere.  We may end up spending every Saturday night at Monti's :D", "pics": null}}, {"review": {"des": "Love this place! They have a versatile selection of Philly cheese steaks! It's hard to find a good Philly cheese steak, so me and my BF were happy to discover this place. They also have a bar so that's a plus! Would recommend.", "pics": null}}, {"review": {"des": "I just. I can't. I mean, it's the best. Consistent as all get out. Never a bad sandwich. <br><br>Love. Love. Love. <br><br>Rocky forever.", "pics": null}}, {"review": {"des": "Wow. I can't speak to how authentic it is, but the \"Authentic Philly Cheesesteak\" is delicious! I got the eight inch and can't imagine what kind of beast could devour anything more. Along with a porter, fries and pretzel bites I'm totally wiped out. <br>The ambiance is chill without blaring music or sports (but sports on multiple flatscreens). Seating is limited to mostly pub tables with a few booths. The service<br>was friendly and helpful. As mentioned, the food was amazing. They set a high bar and clear it with ease.", "pics": null}}, {"review": {"des": "Delicious, authentic Philly cheesesteaks right here in Chicago! I mean it, this was the real deal, perfectly cooked, just the right amount of cheese, amazing soft roll. Casual atmosphere. Nice staff. Big beer selection. Will def be back.", "pics": null}}, {"review": {"des": "I remember what i had now.It was their infinitely SALTY cheesesteak sandwich.You see the infinitely attention seeking and disrespectful comment reply i just got from the owner or manager or a regular employee of this restaurant? I got too much attention actually and some of it comes from you Jennifer M.You love my page.This is why you're the internet troll you wish i was.You got too much time on your hands LYING to everybody about you giving me a refund you know you didn't give me.The only reason you're not blocked yet is because i don't know how to do that yet.All LIARS and clowns trolling me will be blocked.Now go away quietly please.THANK YOU!!!!!!!!!!!", "pics": null}}, {"review": {"des": "quick and easy. I ordered carry out. The best philly cheese steak i've had in a long time!", "pics": null}}, {"review": {"des": "This is my favorite weekend hangover meal! Fresh ingredients and generous portions. I like the Rocky, seriously hot. If you can't take the heat, get the South side Johnny.", "pics": null}}, {"review": {"des": "Parking was easy, the staff was nice, and the food was great! <br><br>We ordered the sampler platter (the Rocky, Southside Johnny, and Niko the Greek) with fries and pretzel nuggets. By far, my favorite was the Rocky. The spicy mayo is amazing. If you like spicy food, you MUST try the Rocky. Niko the Greek was my second favorite but the Southside Johnny was just too plain for me. The pretzel nuggets were very good but I didn't really like the mustard that came with them.<br><br>I will definitely be back for another Rocky!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/bP3xkD2xiegRTfwoJa3j4Q/168s.jpg", "caption": "Pretzel nuggets"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/0MO-QFrTnTThhlJWcaYchQ/168s.jpg", "caption": "Sampler platter (the Rocky, Southside Johnny, and Niko the Greek) with fries. The Rocky is the bomb!"}]}}, {"review": {"des": "A co-worker mentioned this place. I'm sure glad he did. A couple from Philly moved to Chicago and opened an authentic Philly Cheesesteak restaurant and bar. If i lived in the neighborhood, i'd be walking here frequently and see it being one of my local hangouts. The service was excellent and server was very knowledgeable he answered all our questions and we had a lot of them. The beer list is awesome. His recommendations were tasty. My brother ordered the South Side Johnny the horseradish sauce was excellent. Fries are fresh and crispy. I ordered the sampler platter, Southside Johnny, Niko the Greek and Original Authentic Philly, all of them were freaking perfect. Can't wait to go back and try more sandwiches and drink more craft beer!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/9dBn5PMym_mXPGNe3Miwhg/348s.jpg", "caption": "Sampler platter. Authentic Philly, Niko the Greek and South Side Johnny!"}]}}, {"review": {"des": "So my boyfriend was raving about this place all the time! Finally we went together & I'm so glad we did! Their cheesesteak is probably the best I've ever had! Amazing! Perfect amount of ingredients, tender beef! & their wings are in my top 5..so crispy & juicy, the sauce is mouth watering! Just gotta try it if you haven't, this place has it! <br><br>Plus their beer list is great! Nice variety", "pics": null}}, {"review": {"des": "I've been meaning to come here since it is near my apartment. We decided to get the three cheesesteak sampler, which comes with your choice of any three cheesesteaks and a side of fries. We opted for the authentic Philly cheesesteak, Niko the Greek cheesesteak, and the pizza cheesesteak... All of which were oh so tasty! Don't forget to check into yelp to claim your free Italian ice! We will definitely be back!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/moKO5JAXq_VIpdw_Vhn6NQ/348s.jpg", "caption": "Authentic philly cheesesteak, Niko the Greek cheesesteak, and pizza cheesesteak (from top to bottom)"}]}}, {"review": {"des": "I decided to try Monti's after someone referred me to it and I was not disappointed. Their wings are phenomenal! The place is cozy and the staff is very friendly. I will definitely be back again and again!", "pics": null}}, {"review": {"des": "Fantastic food, great beer and drink selection, and fast, friendly service every time I come here. Trinadi was our server last time and was an absolute pleasure! If she's working the bar, ask her for one of her amazing cocktails! Cannot recommend this place enough.", "pics": null}}, {"review": {"des": "Being originally an east coast girl, I am soooo pleased to have come across this spot!! I called ahead to order, then stopped in to pick up the sammy's and there were just a few people there. What a cute little place that you'd never expect to be there....or to be any good! Can't wait to go in sometime to have drinks and cheesesteaks....and try the wings that everyone is raving about.<br><br>But the cheesesteaks are absolutely delicious. We tried the cheesesteak sampler with the authentic philly, south side johnny and pizza steak. All were absolutely fabulous! My fave was the authentic philly. My honey's fave was the SSJ. We went so hard on those subs, it was ridiculous! How nice to bring a little Philly back into my life right when I need it.", "pics": null}}]}