{"name": "monteverde-chicago", "reviews": [{"review": {"des": "I came here with my girlfriend and a friend.  We did not make reservations... so it was a 2 hour wait, BUT it was totally worth it.<br><br>The place itself is a very lively place, yet intimate for either a couple or a small group of friends.  The middle of the place is a small kitchen were a lot of the pasta is made adante, which is awesome.  <br><br>We each ordered a different dish so that we can each try a bit of a bunch of stuff and man... everything was just sooo good.  The pasta had a beautiful texture, very well seasoned, and buttery.  Though the plates look a bit small, they are not - they are very very filling.  <br><br>We also ordered some artichokes to much on while we waited for the food and they were equally as delicious!  I know they are just artichokes... but the way they were seasoned and grilled/baked really brings out the best in those artichokes.  <br><br>I am very very much looking to come here again in the near future... this time with a reservation :)", "pics": null}}, {"review": {"des": "Ah, such mixed feelings to write this review. I really want to give Monteverde five stars. But I can't do that after discovering at the end of the meal that my dining companion had BEARD HAIR in his food that we were sharing family style. Beard hair in food is usually a deal breaker for me (aka = zero stars). Who am I kidding? \"Usually\"? I've never had beard hair served in my food. Pretty atrocious. <br><br>Ok, so I'll start at the beginning. We came here to celebrate my brother's birthday over. He lives in the neighborhood and loves to dine here. All the siblings were gathered from near and far. <br><br>Ambiance: Very cute. Rustic and chic elements. Large TVs near the bar was a little strange as this isn't a sports bar.<br><br>Food: Five of us shared the tuscan kale salad, lillian's stuffed cabbage, gnoccheti con pesto, ragu alla napoletana. I thought everything was creative and delicious (especially the stuffed cabbage). But, I didn't love the ragu. Yes, the portion was HUMONGOUS and we couldn't finish it. The soppresata meatballs and cacciatore sausage were aromatic and flavorful, but the tomato braised pork shank was dry, cumbersome, and weighing down the potential of the dish.<br><br>Service: Generally really awesome. Our server was really kind and enthusiastic. He even brought out this beautiful funfetti ice cream cake with a candle, on the house, for my brother. One con about the service (the people circulating the table and clearing dishes) was that they were WAY too quick to grab the plates and clear the table. I like to savor things and leave my favorite last few bites for last. I lost many of my favorite bites because they would just yank my plates away without asking. I thought that was a bit rude. <br><br>Ok. So now the dreaded beard hair incident. My brother is a really cool, calm dude. He grew up in a house dominated by women, and an easy going nature helped him survive. As we were finishing some of the dishes nearing the end of the meal, he asks for a fresh plate while casually mentioning he found beard hair. WHAT?! So disgusting. And no, they did not belong to anyone at the table - the colors didn't match. I was surprised that the person taking his plate of beard hairs (yes, there was more than one) away didn't send the manager by. I felt pretty sick since we were all sharing the same food. Ultimately, we all shoved this incident under the rug, as my brother wanted to let it go and enjoy the moment and festive occasion. <br><br>I don't want to let this incident ruin such a fond memory of family. I'll keep the feelings of my experience of celebration and family separate from the dining experience. But, I don't think you'll find any of us dining at Monteverde again.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/-0wjSMO--arb6IhI1TMT6g/348s.jpg", "caption": "Ragu alla napoletana"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/wO1eJw2QhrH0KkqBBeXlng/168s.jpg", "caption": "Gnochetti con pesto"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/vvfx4gUEBRTLL97VdNH26Q/168s.jpg", "caption": "Tuscan kale salad"}]}}, {"review": {"des": "I really loved this restaurant and I totally get all the hype. We came here with a group of 7 and I'm thrilled because tasting everything was a treat. The waiter recommended we get various pastas to share (family style) but since a bunch of people had  various dietary restrictions, we ordered appetizers to share and each person picked their own pasta. Turns out, we ended trying everything anyways!<br><br>With respect to appetizers we enjoyed the sunchoke and artichoke crostini as well as the stuffed olives. Both were great!<br><br>With respect to pastas, we ordered the bolognese (2), wok fried arrabbiata (2), cacio whey pepe, gnocchetti con pesto, and strangozze al pomodoro. My absolute favorite was the bolognese - it was stupendous. My husbands favorite was the cacio. Either way, I'd eat it all again happily!<br><br>For dessert, we had the butterscotch budino (was SO good that I forgot to take a picture) and the forgotten cookie. <br><br>Honorable mention goes to the drinks. I ordered the Rumble in the Bronte and I loved it.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/DVXfzmmGi41UPb_LfceanQ/348s.jpg", "caption": "Wok fried arrabbiata"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/D6OWtYjSFp4gCZmhvZyRWw/168s.jpg", "caption": "Gnocchetti con pesto"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/uouhLk0c4JIJLu-z2twvoA/168s.jpg", "caption": "Bolognese"}]}}, {"review": {"des": "Decent spot for a special outing for Italian food. Ambiance and service might have justified the prices. Was the food mind blowingly good? Some of the first bites were, yes, but I think it's easy to get bored of Italian food after the first few bites.<br><br>We got an appetizer with crispy polenta that was actually our favorite dish.<br><br>I got the cheesy pasta cacio whey pepe ($15), first few bites were seriously surprisingly good because it was more flavorful than I would have thought. But after that it got kind of like a regular heavy Alfredo pasta. <br><br>The arrabiata pasta ($18) was good but we thought it would be spicier and flavorful. The noodles would be the best part. <br><br>The cocktail ($14) was worth it, tasty but still alcoholic.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/mgLp8sjNafDWDkUTHXozyA/168s.jpg", "caption": "Arrabiata"}]}}, {"review": {"des": "Dish after dish came out, each distinct from the previous. Forget notions of spaghetti, lasagna or risotto. Chef Sarah Grueneberg takes you on a tantalizing flavor journey that expands preconceptions of Italian fare.<br><br>As an example of unexpected Italian fare, my favorite dish was MELONE E HAM: Pugliese burrata, rosemary lemon tigelle, Casella's 14 month prosciutto, basil for $24. It was served with flat bread that resembled English Muffins but were moist and rubbery in texture (I think our server called it jelly bread, but I'm not sure). We were instructed to slice it open and layer it with the marmalade, mozzarella and prosciutto. It was heavenly. I would have been sated with that dish alone.<br><br>Something that happens when lots of food is ordered and my hunger is satisfied early is that I become critical. My ravenous cavern is no longer consuming indiscriminately; instead I eat for pleasure and curiosity. That has happened *EVERY TIME* at Monteverde.<br><br>The food is still delicious, but maybe it's too salty. Or maybe I like it but don't love it. Monteverde dishes are served family-style so multiple dishes get compared side-by-side and I inevitably prefer some over others.<br><br>I believe that Chef Grueneberg is a gifted visionary and leader and it is evident in the popularity of her restaurant. It is challenging to get last minute reservations, it's crowded and noisy (but not impossible to have a civil conversation). I like Monteverde and I think it's worth trying.", "pics": null}}, {"review": {"des": "I really liked Monteverde.  Of course, you probably know the plates/portions are small, but everything was extremely tasty.  My favorite was the simple yet complex cacio e pepe.  You can never go wrong with fresh, homemade pasta, and Monteverde did not disappoint.", "pics": null}}, {"review": {"des": "Hmm, can't remember why I had this place bookmarked and I saw a lot of five star reviews for this place, but unfortunately it was a miss for me. The positives are that the staff was welcoming when we walked in and answered our questions about the parking, plus they seated us right away without a reservation. We did come early though on a weekday. <br><br>So they give you complimentary bread sticks when you sit down, didn't like them at first, but they grew on me while waiting for the food, haha. The waiter recommended sharing dishes because according to him, the food comes out at different times because everything is made to order or something like that. I think that they should just be honest and say the dishes can be on the smaller side. Also he kept saying everything was spectacular.<br><br>Started off with the octopus appetizer and it was disappointing. Super small, I think it only had two pieces of octopus and the other pieces were leek and I forget what else, unremarkable. Had the skate schnitzel salad which was a good portion and had the perfect crispy breading (worth getting). Also tried the pappardelle with the lamb and it was decent, but not spectacular. Ordered an expensive dish, can't remember the name, but it was basically tortellini with shaved truffles on top. It came with a lot of truffles, but couldn't really taste it and it was just ok. <br><br>We ordered a lot of food for two people, so I feel like we had a good sampling of their menu. The service was good though in that they refilled waters, folded your napkin when you went to the bathroom, etc., so I had a hard time deciding on how many stars, but the food couldn't justify more unfortunately. Maybe it's just not my kind of place, it was ok to try once, but I don't think I would come back or recommend.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/XjyK7fzoXeGtreVLStoXKQ/168s.jpg", "caption": "Pappardelle with lamb"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/V6ynJU_xxA7E2Qs6s_Zcew/168s.jpg", "caption": "Octypus app, small and unimpressive"}]}}, {"review": {"des": "Boy, this spot is tough to get a reservation for on a weekend. We eventually had to settle for Saturday lunch which wasn't ideal but I cheered up after seeing two words on the menu \"brunch cocktails.\"<br><br>Appreciated the high ceilings upon walking in and liked the refined, but not overly elegant vibe of restaurant. You get thin elongated bread sticks as a bread basket when first seated.<br><br>My husband got the bloody mary and me, the \"not\" bellini. His bloody mary was perfection, the fried goat cheese stuffed olives that came as a garnish on it, divine. The bellini was much sweeter than I anticipated and our server was kind enough to sub it out for the wonderful bloody mary. <br><br>Every item we ordered was cooked to perfection and flavorful. The flavors were so delicate and precise - I had a real appreciation of their craft. Our server had recommended her favorite, gnocchetti con pesto, and it was our favorite. We also had the not to be missed, and only served at lunch, egg yolk raviolo. Pesce alla griglia rounded out our meal with some fish.<br><br>For dessert, you can't go wrong with the panna cotta with fresh fruit.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/zd5xd7U-e9eSljBHdY2nYg/348s.jpg", "caption": "Panda Cotta dessert"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/qHbw9L8zB7Gx8rczcHrSyA/168s.jpg", "caption": "Interior of Monteverde"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/QDg7jTk4DI7ZMXP33q55BQ/168s.jpg", "caption": "Raviolo - only available on lunch menu"}]}}, {"review": {"des": "A little overrated in my opinion. My husband and I came here for our anniversary expecting to experience top notch service and amazing food from recommendations from others but it was a pretty mediocre experience. <br><br>We got there about 15 min early before lunch time hours were over and before our dinner reservation. It was around 345p on a Friday so there was obviously not a hue rush of people trying to get in. Also they only had 4pm resos available. The entire restaurant had multiple seats open but we still had to wait awkwardly on the side with others for our seat and until \"dinner hours\" were open. There was still people sitting at their tables from the lunch hour so I'm not really sure why we couldn't just sit at our table since we already had reservations and 90% of the restaurant had open seats. They could be offering us water or to look over the menu.<br><br>The appetizer breadsticks were really good and our waiter was really friendly. We ordered the Arancini ( it's ok.), ragu alla napolenta ( good but salty), and the grilled artichoke crostini which all seemed to be the popular dishes. While everything was good they weren't amazing and like a lot of reviews said, very salty. Prices weren't terrible and ragu napolenta was definitely huge! <br><br>Not sure I'd frequent this place but glad we gave it a try.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/vkAy4jR5gDVl-5Pc6ZgxMA/348s.jpg", "caption": "' Nduja Arancini. Incredibly crispy and good  but kind of salty"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/OM924rVYAyAKBhdZgf8sfg/168s.jpg", "caption": "Ragu. huge portion."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/uz8y8fo5aIwydqr8lq-R2g/168s.jpg", "caption": "Grilled Artichoke Crostini. Good"}]}}, {"review": {"des": "Had a reservation for 4 on Saturday Lunch and we were seat right away. Service and decor was excellent. Love how they have fresh pasta hanging in one area of the restaurant! <br><br>Bloody Mary was good! Could be spicier and I usually strongly dislike olives but these fried ones were delish and took out that pungent smell from them.<br><br>Favorite dish was hands down the Egg Yolk Ravioli! Great truffle flavor, cream sauce was perfect - next time I will order one for myself bc portion is small. <br><br>Also ordered the Omas Green Salad which was fresh and had great bites of avocado and the octopus which you can go wrong.<br><br>Last we got the Ragu which is a monster. The meat is so tender, the pasta soaks in the ragu nicely and the sausage is very juicy. A lot of elements going on and it's a hearty dish so come hungry if you want. <br><br>Overall, loved it and will be back!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/B4XWu3mcvu3H4qOHtq4ElQ/348s.jpg", "caption": "Egg Yolk Ravioli"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/0Ca2nJJD7jD7FboPnKp4xQ/168s.jpg", "caption": "Ragu Alla Napoletana"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/PcMYEZCD94XkLKv1JTApLw/168s.jpg", "caption": "Octopus Spiedino"}]}}, {"review": {"des": "I love checking out former Top Chef contestant's restaurants. When I watched Sarah Grueneberg compete, I knew her food would likely blow me away & it most certainly did. Her pastas may look simple but, the flavors they deliver are divine. <br><br>We were fortunate enough to be seated right outside the kitchen for a late lunch on Saturday and loved watching the staff at work and Sarah supervising everything. We ordered the 'nduja arancini rice balls and roasted sea scallops as starters, we each ordered a pasta dish - our server gave us each an extra small plate so we could share- and zeppole for dessert. It was the perfect amount of food for 4 people and we all got to taste everything. The pesto, the egg ravioli, the cheese and pepper pasta and the tomato basil pasta were all visually beautiful and exceptionally executed. It's where this restaurant shines!<br><br>The kitchen is certainly fun to watch and depending on where you're seated you might also have a view of the pastas being rolled out up above the bar. It's a great experience and our server, Jamie, also provided excellent service. Definitely 5 star worthy!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/LIn-b20Ueb7zh_fzMrIvLg/348s.jpg", "caption": "'Nduja Arancini Sicilian rice balls"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/izhkHsWR8NdwoINDZ00h0Q/168s.jpg", "caption": "Roasted Sea Scallops with charred zucchini & fennel"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/TAyGEIQCU4zRWZQe9FGnyg/168s.jpg", "caption": "Egg Yolk Raviolo"}]}}, {"review": {"des": "The bf and I came in right at 5 pm with no reservations on a Friday and had no issues with snagging a table.  <br><br>While the place might seem extremely fancy online and from reading reviews, it felt more like a nice-casual place.  Meaning, the restaurant didn't give off that pretentious vibe but yet the quality of the food was nothing but perfection.  <br><br>The food exceeded my expectations.  We ordered the burrata appetizer along with the arancini and the ragu dish that everyone is raving about.  Everything was spectacular, especially the ragu.  It's so much food for two people and I'm glad we didn't order more pasta dishes.  The meatballs, sausage and pork shank were just so tender.  This restaurant is definitely added to my places to bring friends and family from out of town.  This restaurant lived up to its hype for me!", "pics": null}}, {"review": {"des": "This is quickly becoming perhaps my favorite restaurant in Chicago. Second visit, we got the pomodoro and pesto again, with artichoke sunchoke crostinos and the burrata/ham plate as starters. I don't know that I'd need to get the burrata/ham again -- it was fantastic, but you can get similar dishes elsewhere. I definitely want to try more pastas and veggie dishes.<br><br>For dessert, we got the birthday cake and chocolate meringue cookies, both of which were great, but I wouldn't be against trying other things next time.<br><br>Overall, an outstanding spot that I will obviously be coming back to again and again.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ndhduOowqvHQiAACfVTADg/348s.jpg", "caption": "Birthday cake"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/v4kVUIkMD_RFbW7w97Apvg/168s.jpg", "caption": "Lunch menu (10/6/2018)"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/PupNSJD-SPB4UTMvbwl4Ag/168s.jpg", "caption": "Burrata + ham"}]}}, {"review": {"des": "An absolutely fantastic dinner experience! Service was spot on, and the ambience is great, even though some of the tables are quite close together. We had the arancini, squash blossom, sunchoke crostini (highly recommend) to start. The Roman eggplant parmesan was probably the best eggplant parm I've had. The skin is left on the eggplant so it is crispy, and the eggplant slices are thick and meaty. The arrabiatta pasta with ground shrimp was unique, evoking flavors of Southeast Asia. The anchovy paparadelle tasted amazing, with tons of shaved truffles on top. The Texas redfish was so moist and perfectly cooked. <br>The couple next to us ordered the ragu dish (\"for the table\", $55). It looked huge - I'd recommend getting this if you have at least four people in your party. Or if you're planning on skipping appies and desserts.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/F_SKtaBkrws7hH434TXF7g/348s.jpg", "caption": "Texas redfish, half portion"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/DUr0hIBBTynLtoSuLM2-Ng/168s.jpg", "caption": "Wok-fried Arrabiatta"}]}}, {"review": {"des": "Everything we ordered was delicious. Monteverde does a great job making the food approachable and delicious at a moderate price point. Here is everything we ordered, in order of my personal preference:<br>1. Pumpkin ravioli (seasonal item) - this was fantastic. The ravioli was very creamy and I love the flavor of sage / butter, so I found the sauce delicious! The ravioli also came sprinkled with pumpkin seeds and something crunchy that may have been apple. This pasta was just cozy, delicious, and perfect for fall.<br>2. Lamb skewers - this was a small plate and a bit overpriced (1 medium skewer for $9), but the taste was great. The meat was tender and the glaze was great (almost had a bit of a sweet taste to it). <br>3. Apple cake with rosemary ice cream, sea salt brittle, and walnuts - there was so much going on here, and it was all great. Lots of different flavors, textures, and temperatures. The sea salt brittle was the most unique and my favorite part of the dessert. <br>4. Bolognese (daily special) - this was pretty traditional bolognese. I enjoy bolognese, so I liked it. It's not as unique as some of the other items on the menu, so if you're looking to try new / different items, maybe skip this. The quality of the pasta was definitely really good, and I liked that the pasta was a bit more al Dente than the others. <br>5. Cacio whey Pepe - this was really creamy and good, but the Parmesan flavor was a bit too overpowering for me. It was delicious, but relative to the other pastas it was lower on my preference.<br>6. Warm chocolate ganache tart -again, this was good but the chocolate ganache after a few bites was too rich. The texture of the ganache is creamy and flowy, so it's nice. If you're a chocolate fan, definitely order this! <br>7. Hamachi Crudo - good but nothing super special. The citrus flavor was nice and overall I enjoyed the appetizer, but next time I may try something more unique on the menu.<br>Overall, this may be my new favorite restaurant in Chicago. It was delicious, and I definitely recommend you try it!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/oFor48eKIE285rh9egVVdA/348s.jpg", "caption": "Cacio whey Pepe"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/_xnljqsDKas3n4RLVuxjww/168s.jpg", "caption": "Chocolate ganache tart"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/LnaYaZqeU2VLIoaKl4-Rhg/168s.jpg", "caption": "Apple Cake with rosemary ice cream and sea salt brittle"}]}}, {"review": {"des": "Good food. Need to go back once more.<br><br>Service by Macy, professional and attentive. Good suggestions. <br>Everyone was attentive and made sure we were taken care of well. Many Thanks.<br><br>Pappardelle: 4/5<br>Cacio Whey Pepe with 5g of truffles: 3/5. probably not the best choice for truffles<br>Gnocchetti con pesto. 4/5<br>PBT 3.5/5<br>Olive Ascolane. 3.5/5<br>meatball. 3.5/5<br>Hamachi Crudo 3.5/5. looked beautiful.<br>Mountain potatoes side 4/5<br>Stuffed cabbage. 3.5/5<br>forgotten cookie 4/5<br>cannoli 3.5/5<br>Budino 3.5/5<br><br>We all enjoyed the place and would like to go back once or twice more.", "pics": null}}, {"review": {"des": "KenScale: 8.25/10<br><br>My wife Jun and I recently went on a short trip to meet my parents in Chicago (my mother had a business trip in the city, and my father was tagging along). While Jun and I ended up helping out my mother a lot for her business trip on a fairly hectic schedule, we still had a very meaningful time my parents whom we don't get to see that often as they live in Korea. Before our reunion, my mother asked that I arrange a dinner for our family and four of her business trip companions. Knowing that my father is an aficionado of Italian food, I looked up Monteverde, a leading Italian restaurant in the Windy City for its fresh take on Italian cuisine and superb pasta offerings. I was required to commit to a family style dinner that serves two snacks, two appetizers, two pastas, one main dish and two desserts, at $70 per person plus 22% mandatory \"administrative fee\" (i.e. gratuities). Not a friendly price tag, but I was more interested in making sure that my parents enjoy a good meal so decided to trust the accolade around the restaurant since its opening three years ago.   <br><br>I thought by family style, the portion would still be more or less manageable for eight people, but during the meal it almost felt like the kitchen thought they were preparing a meal for 12 or even 16 people! Not surprisingly, toward the end of the meal the entire dining party started to struggle with eating the gigantic piles of food. There were four females in the dining party (including my mother and Jun) so maybe the kitchen overestimated how much capacity we had in our stomachs? In any event, the snacks (\"stuzzichini\") and appetizers (\"piattini\") dishes Jun and I had ordered in advance of our meal were all very delicious, starting with the artichoke and sunchoke crostino where the addition of housemade ricotta and truffle made each bite wonderfully complex, as well as fried stuffed olives with a powerful mix of goat cheese and sausage inside. The stuffed cabbage had porcini mushroom Bolognese and crispy polenta inside for a spectacular effect on the overall flavor, and while if a restaurant in New York City serves skate schnitzel with wok-fried onion and peperoncino (hot chili peppers) this good, I think I will visit that place more often. The temperature and texture of the skate was spot-on, and the spicy kick from the peperoncino gave even more robustness to the dish. The pasta menus at Monteverde are divided into to groups, \"tipica\" (i.e. traditional style) and \"atipica\" (\"i.e. novel, unconventional style). Jun and I had ordered one dish each, and the one from atipica group turned out to be more successful. The pasta dish from the tipica group, campanelle with blistered cherry tomato, basil and za'atar, was surprisingly off in the flavor, which was a little too overpowering. Expecting a simple, soulful tomato-based pasta, Jun winced at how aggressive the flavor was and didn't touch the dish much. On the other hand, the wok-fried arrabbiata from the atipica group was quite wonderful, with black and white tagliolini (think spaghetti-like thin noodles) and ground Texas Gulf shrimp working beautifully with garlic hot pepper oil to give a flavor that was powerful, interesting and addictively good. As I mentioned above, by the time the pastas were done, everyone was very much stuffed and were startled to see two giant plates of Ragu alla Napoletana consisting of fusilli pasta, sausage, soppressata meatball and tomato braised pork shank. Jun and I felt terrible that both plates were barely touched, especially because all the different components in the dishes were delicious, especially the pork shank that was more or less perfectly braised. Only if our hotel had a microwave so that we could take the leftovers for a breakfast or lunch the next day... In any event, we still had desserts left, and this time the two dishes we had ordered came at a more reasonable portion. Jun and I enjoyed both warm chocolate ganache tart accompanied by hazelnut praline, banana caramel and vanilla ice cream (which had an attractively rustic quality) and butterscotch budino with buttered pecan and whipped mascarpone (with a bruleed top that you can crack with a spoon), and mustered whatever space in our stomachs we had left to savor these delightful desserts.<br><br>Monteverde is still a very popular restaurant in Chicago, and during our meal we saw that late diners were showing up at as late as 10 p.m. so I highly suggest booking for a table in advance. There is full bar with heavily Italian wine list; my father ordered a bottle of Chianti Classico from the Tuscany region that everyone enjoyed to complement the meal. The flavor at Monteverde could be slightly more moderated for my and Jun's taste, but there were still a lot of exciting dishes that I think makes this restaurant still one of the hottest tables in Chicago.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/u3wQYEeML2bLWUbZ2Ont8w/348s.jpg", "caption": "Warm Chocolate Ganache Tart with Hazelnut Praline, Banana Caramel, Vanilla Ice Cream"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/wDT6uA5R4Umpzb2ATlMrPQ/168s.jpg", "caption": "Butterscotch Budino with Bruleed Top, Buttered Pecan, Whipped Mascarpone"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/mP9BmDmpJ3hMRxbqE9MTpw/168s.jpg", "caption": "Ragu alla Napoletana – Fusilli Rustico, Cacciatore Sausage, Soppressata Meatball, Tomato Braised Pork Shank, Wild Oregano"}]}}, {"review": {"des": "Last night was my second visit. The friend I dined with is vegetarian so we opted out of any meat or fish dishes. We each had a glass of red wine and started with an artichoke & sunchoke crostino which was light, fresh and delicious. I could have had another but ... <br><br>Next up was the gnocchetti con pesto. I took my first fork full and thought it was salty and maybe it was the fault of one of the cheeses. Then my friend took her first bite and said ... this is wrong (she's been there 6 times before and said she's had this dish every time and it was definitely too salty) - so our waiter got us a new order of the same item which was perfect! <br><br>Since we were ordering 1 thing at a time, next was the green mountain salad. I poo-pooed having a salad b/c you can get salad anywhere, right? But this was full of yummy veggies with a delicious dressing and my favorite type of lettuce. VERY good.  And I was glad she talked me into it.<br><br>Our last dish was greens - sauteed, I think. Maybe some ricotta mixed in?<br> <br>Finally (because we were celebrating my birthday) - our waiter brought over a piece of cake - white with vanilla ice cream, burnt marshmallow and sprinkles on top. Very yummy and a lovely finish.", "pics": null}}, {"review": {"des": "My sister and I came yesterday evening for dinner and had a great meal with seating next to the kitchen. The plates here are meant to be shared which was perfect for us since there was so much we wanted to try.  To start we ordered the burrata and ham which came with a generous portion of the  cheese and a bunch of freshly made bread that I can only describe as the product of what would be if a bao and an English muffin had a baby. There was also prosciutto and the melon with this dish and we opted to add prosciutto butter for an additional price. This was a totally worthwhile choice and I would come back to eat this as a meal by itself, it was that good.<br><br>For drinks we had a white wine and also a cocktail named Sardinian Bandit! It's sweet and then finishes dry  (or perhaps it was the other way around) with an egg white foam. Super refreshing and right up my alley. <br><br>On to the pastas- all are made in house except the cacio whey pepe in which the bucatini is shipped from Italy, as I'm told. The agnolotti is made fresh to order. We opted to try the pappardelle with shaved truffle and the special of the day pasta which had a tomato base and scallops. Both pastas were individually robust and unique in their combination of  flavors. The shaved truffle made for a truly decadent dish although I didn't think the corn in this dish did much as it would be fine on its own or perhaps be enhanced with another veggie or meat.<br><br>Dessert - lots of options and each sounded delectable! We choose to try the blueberry lemon Sundae and were happy with our choice.<br><br>The last part of my review would be nothing but praises for Rose, our server! She was very attentive and knowledgeable. She always checked up on us yet never overbearing. Our water was never empty and overall we enjoyed not only the meal but the service was spectacular. Before our meal even ended we already started to plan on a return visit. <br><br> Check out the menu and pics! I am salivating looking at the burrata already lol!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Wc5-EiH7sZN8XMNdTlJLhA/168s.jpg", "caption": "Special of the Day Pasta with Scallop"}]}}, {"review": {"des": "I came here for my birthday dinner recently. I'd heard good things about it but had never been. Primarily because I don't generally eat carbs or dairy so I tend to steer clear of Italian. But on your birthday you have to indulge - right?!? And let me tell you it was WELL worth it!! We started with the burrata. Who doesn't love burrata?!? And it was divine. Served with prosciutto, melon and these little carby pillows. I don't know how it gets better. We also tried the octopus skewers and the hamachi collar. Amazing. But the real stars are the pasta. We ordered the pesto and the cacio whey pepe. Both were perfection but the cacio whey pepe - I'm still dreaming about it. I have literally never had better pasta in all my life. Ever. <br>Cocktails were fantastic and service was attentive and friendly. This place makes the carbs worth it.", "pics": null}}, {"review": {"des": "I have to say I was able to attend for a special event but I would jump at the chance to go back anytime the opportunity arises! The restaurant is so beautiful and you can watch behind the bar as the make home made pastas! I had the honor of meeting Chef Sarah. She is so down to earth and knows her stuff! She is a force to be reckoned with. The FOOD! The prosciutto (PBT) butter toast was out of this world and I don't even like radishes. From the schnitzel fried skate, pugliese burrata and melon, sheep's milk angolotti, pappardelle, grilled red fish, and that bone in rib eye! Oh my, my, my! The wine parings were so on point. We couldn't get enough. And I have to say the dessert was one of the BEST, absolute best things I have ever put in my mouth! The butterscotch Budino. HOLY COW. I think I have dreamt of it at least twice since having it. I could have 12! Add Monteverde to your must go list immediately!", "pics": null}}, {"review": {"des": "This place was excellent. Every dish was truly perfect. <br>PBT- gorgeous... maybe the most delicious idea for butter ever created. Truly beautiful plate and taste. <br>Fiore di zucca- soooo tasty. Just order t. Spicy sweet creamy and crunchy. <br>Sheeps milk agnolotti- maybe the best pasta we had- delicious. <br>Cacio whey Pepe- intensely creamy. I love the addition of ricotta whey. One of the best cacio e pepe I've ever had. <br>Egg ravioli- really good but slightly underwhelming. <br>Zeppole- absolutely loved these, tart raspberries,  creamy center, perfectly sugared and fried <br>Scrambled egg fonduta- really cheesy and tasty<br>Amatriciana poached eggs- loved this. Toast was great. Similar to shakshuka but with Italian flavors. Loved the guanciale. <br>It's a beautiful restaurant. I loved the mirror that shows the women making pastas by hand. Overall lovely experience.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/KVPWa5m684NfY46lKTxjXQ/348s.jpg", "caption": "italian style shakshuka with burrata toast"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/7Xaw-ohlXbf6zLUL1Nam9A/168s.jpg", "caption": "donuts"}]}}, {"review": {"des": "Cacio whey pepe: I am always critical about the texture of noodles. Chef Grueneburg nailed the texture of noodles for sure, no wonder she is the \"queen of pasta\". The cream was very, very rich. Your taste buds are swimming in the pool of rich and flavorful sauce and then gets slapped with the fresh cracked peppers that leave them wanting another a bite. <br><br>Strozzapretti with baby octopus: This dish was completely different from the cacio whey pepe. It had a whole different profile of flavors and texture. The pasta was a little bit tougher to the bite, but it needed to be to handle all the other flavors. The octopus were braised to tender perfection. It was a little bit on the saltier side, but it wasn't terrible.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/etpzgiaJJ2Mn6IqR4ZhN0A/168s.jpg", "caption": "Cacio whey pepe"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/FR0UzGGlrFJ7sOydLIhxkA/168s.jpg", "caption": "Strozzapretti with baby octopus"}]}}, {"review": {"des": "Every bite was better than the last! Everything was so delicious that I couldn't pick a favorite (although anything truffle makes me very happy). We had reservations for lunch so we didn't have a wait. The waiter was great with his recommendations. The man who filled our waters and folded our napkins was fantastic. Very sweet, offered his suggestions and fixed the slight wobble of the table without being asked.  The three people in our party left satisfied and full after sharing 5 items, including a desert, but we didn't feel too stuffed or sick. I almost can't wait to go back!", "pics": null}}, {"review": {"des": "What a great experience this was. I can honestly say this was one of the greatest meals I've ever had. Portions are generous, presentations are craveably rustic, and taste is just fantastic.<br><br>Food:<br>I came during lunch, which I specifically mention because some of these items are not on the dinner menu. I had the following...<br><br>Artichoke Sunchoke Crostino: <br>These are large crostinis which you order by the piece for $5. The bread is probably just under an inch think, and is piled high with soft and creamy ricotta and fontina. The cheese is topped with artichoke, sunchoke, and truffle which covers the entire surface. They are rich, have just the right amount of truffle, and are indulgent but not overly so for a snack / starter.<br><br>'Nduja Arancini: <br>To quote my wife, \"I want to live in this arancini.\" We both agreed that this arancini made us feel like we had never eaten arancini before. Hands down the best I've ever had. The outside layer is very crispy / crunchy, but not too thick. The inside is a warm, spicy, soft, melt in your mouth mixture of the spicy sausage, manchego, and risotto. They are topped with an insanely good aioli with a ton of spice/herb flavor and also a perfect tomato sauce. After we finished the aranci, we were scooping up what was left of these sauces with our forks and eating it straight. One order comes with 4 arancini for $8. <br><br>Egg Yolk Raviolo:<br>Cutting into this and seeing the yolk flow out was spiritual. It blended so well with the truffle and corn sauce surrounding the raviolo. I have no idea how they accomplish this masterpiece ... I am guessing there is some kind of ricotta moat so the yolk doesn't harden, and I'm really in to the concept of ricotta moats.  If you are hesitant about the anchovy, don't be. The flavor is not overpowering in the least, and the pieces are so small you wouldn't be able to visually tell there was anchovy in it. The anchovy really has a faint crab-like flavor that goes so well with the sweet corn. For the regular sized pastas, this is the priciest at $24, but it's absolutely worth it. (All of the others are $15-$20). <br><br>Ragu alla Napoletana:<br>Our server was excited to deliver this to our table and explain what was going on since we has not had it before. This is an enormous dish. It consists of a mound of fusilli pasta, 3 full sausages, 4 large meatballs, and a mountain of a pork shank, all covered in a rich tomato sauce. The fresh pasta had a great texture that stood up to all the meat on the plate. It was dense, and had just a bit of a chew to it. The sausages were thick and juicy; you could see the juice when you cut into it. They also had a pleasant little amount of spice to it. The pork shank was huge! As soon as I put my fork to it, basically all of the meat began to melt off the bone. It was braised to tender perfection in that tomato sauce. The soft pork with the dense pasta made for a really awesome bite. Finally, the meatballs. These were the best item on the plate. They are soppressata meatballs, so they have a complex spicy taste. Like the sausage, they were incredibly juicy. I tried to take small bites so I could savor them as long as possible. We ended up having a good amount of this dish left to take home with us. It's $55, but it's honestly a really good deal for the amount and quality of food you get. I just ate these leftovers for lunch and everything reheated really well too. (I forgot to mention there was green stuff on this plate too, because I had meat goggles. There was a small salad of warm and salty escarole. I presume this was there to cut into the richness of all the meat, but I have no shame / restraint and just plowed through until I had to roll out of my seat).<br><br>Other meal aspects:<br><br>Atmosphere:<br>The restaurant is modern / industrial but also cozy, and made me feel at ease. Waiters wear aprons over their nice casual outfits. It's not stuffy, and you won't feel judged if you don't order super expensive bottles of wine. On the regular drink menu glasses of wine go from $10 to $15 in most cases, and bottles from about $35 to $70. They do have a more extensive wine list if you're into that, where the median bottle price is probably in the $60s. I visited for a late weekend lunch with my wife, and we opted for cocktails which were $14, unique, and delicious. I had the Chef's Gin & Tonic, which had muddled cherry tomato and basil. It was super fresh and light, and I want another one right now. My wife had the \"This Is Not A Bellini\" which is made with sparkling sake. I think it was named \"not a bellini\" because it wasn't messing around. It was strong but fresh and light. <br><br>Service: <br>Very good; I definitely have nothing to complain about. We were regularly checked in on by our server or his helper, and our water glasses were never empty.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/2Au8zKfwWxVhO8m7Xzd5AA/348s.jpg", "caption": "'Nduja Arancini"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/VHWN6UsaoCAW6XvRszGegw/168s.jpg", "caption": "Artichoke Sunchoke Crostino"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/QJ-bPiuq1z327TmO_QkQZA/168s.jpg", "caption": "Ragu alla Napoletana"}]}}, {"review": {"des": "Yes.<br><br>This place is delicious. I wish I came in a group so I could pick off other people's food and try more dishes. Guess I just have to come back on my own!<br>Fiore Di zucca - so flavorful in all the good ways. I want this again... and again.<br>Pork Loin Skewer - Also tasty! But I'd probably get something else to try next time. <br>Spaghetti Alla Chittara - the truffle was so prominent yet not overly prominent. Just so freaking good.<br>Arrabbiata - Perfect amount of kick and substance. Tasty!<br>Chocolate Tart - I don't normally get dessert, but this was pretty tasty, too!<br><br>So many other pasta dishes I want to try now. it was also cool being able to see them make pasta at the bar area. Ambiance was classy yet casual. Waitstaff was fantastic.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/8TawFUGOoqwn04NsmylKHA/348s.jpg", "caption": "Chocolate tart"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/7sz9jYOq7k8QmpP1u148JQ/168s.jpg", "caption": "Spaghetti Alla chittara - truffle goodness. Get this."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/47ZWtaIjzxWhbt_kIF-rpw/168s.jpg", "caption": "Arrabbiata"}]}}, {"review": {"des": "Dropped by for brunch and loved it! The restaurant is beautifully decorated and the ambience is spot on. The second you walk through the door you feel comfortable and can just sit back, relax and eat. You can see employees making the fresh pasta right behind the bar. The restaurant opens exactly @ 11:30AM on the weekends so don't come too early otherwise you will be waiting outside. <br><br>The food was very tasty! My favorites were definitely the Zeppole, the pork shank and the tuna bruschetta. The Zeppole or the doughnuts were so amazing with the raspberries and vanilla crema. It wasn't too tart. The pork shank was so soft and broke apart the second you picked it up. The dish was definitely way bigger than all their dishes. I didn't get to try the truffles. But definitely will be back and give that a try.<br><br>The service great! Everyone was super friendly and attentive. The hosts took us to our seats right away and we sat towards the back. The server was really friendly and checked up on us a lot. We always had a full glass of water and a clean table. I am definitely going to be back. There are so many things to try still. <br><br>Came with a party of four and we ordered too much even for big eaters. For a group of four I would recommend maybe two small plates, a pasta and the big Ragu Alla Napoletana. They also have a rib eye, I might give that a try next time. Definitely make reservations.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/skYTbQGh2Boj6fiD4AQOrA/348s.jpg", "caption": "Ragu Ragù Alla Napoletana"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/SqtR_--aJRcIFuX-t98Mqw/168s.jpg", "caption": "Venetian Tuna Bruschetta"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/l6pEZOcGObjYFE6zK3WcYg/168s.jpg", "caption": "Cacio Whey Pepe"}]}}, {"review": {"des": "We walked by this restaurant 5 days after returning from 16 days in Italy....so pasta was not on our mind.  It smelled so good as we lingered in front of the door, we had to go in.  AMAZING!!! I would even go as far as to say better than pasta dishes we had in Italy.  <br><br>Atmosphere: even waiting an hour, standing at the bar, it was a warm authentic atmosphere with great wine and cocktials.  We ended up getting seats and ate at the bar.  The bartenders are on point with both their spirits and wine knowledge.  At the bar, you also get to watch them make the pasta!!<br><br>Appetizers: artichoke & sunchoke crostino- the truffle on top was delicious.  You will not be disappointed.  The order is for one little piece, order your own.  You will thank me for that suggestion.<br><br>Octopus spiedino- I am a lover of octopus, so yes, I'm alittle picky.  This was pretty small.  Flavorful, yes- but on a skewer the pieces are quite small.  I would try something else next time.<br><br>Pasta: wok fried arrabbiata.  This is amazing.  Great spice.  If you like spice- order this.  The shrimp in the pasta is the perfect protien choice for the spice.  Robust, satisfying, perfect spice to this dish.<br><br>Lamb Ragu- this was under their daily specials.  One of my favorite pasta dishes ever.  It has this sweetness in the sauce with a nice light noodle.  The lamb was tenderful, seasoned perfectly.  This was a fish where if you put your fork down to breath, you might not get anymore.<br><br>I cannot wait to come.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/OWW7s4KTnm3Wyhdu-MvFaQ/348s.jpg", "caption": "Daily specials- Lamb Ragu-amazing!!!!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ie45BGv0aujWRJhagWvFlg/168s.jpg", "caption": "Order this: wok-fried arrabbiata"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/wPnkagedgcv-UCKSglMyJA/168s.jpg", "caption": "Octopus spiedino"}]}}, {"review": {"des": "After hearing so many good things about this place, I was pretty excited to give this place a try. I came here on a walk-in around 6pm and luckily we were able to get seated in one of the few unreserved tables. It was our first time so we asked the waitress for recommendations.<br><br>Liver Bacon Burrata (5/5): this is one of their specials of the day, and I'm glad we got it. The flavor of the toppings blended together very well with the sauce. I'd highly recommend trying it if you see it on the menu.<br><br>Wok Fried Arrabbiata (3/5): This pasta was too salty and it reminded me of an overly greasy chow mein from an Asian takeout restaurant. They did throw in a good amount of shrimp on there though.<br><br>Cacio Whey Pepe (3/5); This pasta was pretty bland, not in the sense that there isn't enough sauce. The flavor was pretty flat and neither of us enjoyed it a whole lot. The texture of the pasta was on-point though.<br><br>Overall, I would probably still recommend giving this place a try because of the amount of rave this place has received. Maybe I went on a bad day, who knows. The waitress and hostess were all very courteous.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Z6F55WjfjZuzDtsldPEWaw/348s.jpg", "caption": "Wok Fried Arrabbiata"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/LbX5tX9hJ8ERaGyXGuDtKw/168s.jpg", "caption": "Cacio Whey Pepe"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/tlV_aJSLIDEpupiPBNIv5g/168s.jpg", "caption": "Special of the day: liver bacon burrata"}]}}, {"review": {"des": "I finally was able to visit Monteverde...for a work dinner at 5:30pm one night!  <br><br>This was actually my second visit.  My first was at the bar (also a hard seat to get).<br><br>This spot is gorgeous and I love watching the pasta being made.  It's cozy and comfortable and definitely a perfect spot for almost any occasion (giant group dinner...perhaps not as it's hard to get a seat and it gets a bit loud).  Service is friendly (on my first visit, they helped me get a seat at the bar by letting me know who was getting seated next!) and they don't rush you even though the spot is packed.  This is nice because I really dislike being rushed out.  <br><br>Everything I had was great.  The meat/cheese plate with the homemade bread - YUM!  It was so simple but so flavorful.  I also tried the ragu on the second visit and while I was initially skeptical of sharing giant entrees with my work team, it worked out really well.  We were able to try a lot and the larger plates truly can be easily shared.  Some of the meat dishes are very rich, so a little goes a long way.  Perfect for a cool fall day!<br><br>Pricing isn't inexpensive, but I thought that considering the freshness and quality ingredients along with generous portion sizes, that the price was ok.<br><br>Worth a visit if you can get a reservation, and I highly recommend trying to do so.  Otherwise, plan to come very early and try to snag a seat before they open.<br><br>Food - 5<br>Service - 5<br>Bathrooms - 5<br>Value - 4<br>Atmosphere - 5", "pics": null}}, {"review": {"des": "Boom... And just like that, one of my new top three restaurants in Chicago.  My first visit and I'm a huge fan. Not sure if the food is always this exceptional or they are having a lucky night so I'll have to come back again soon and check. :-D.  Not often I'm surprised and delight like I am now. Congrats to Seth and the entire Monteverde team for exceeding my expectations!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/aqGaHoP1AgtDDqkAZAKlzw/348s.jpg", "caption": "Crispy Squash blossoms stuffed with ricotta basil, tomato vin with honey. Very good."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/6tiqWsDStj0vXE68lDYtcQ/168s.jpg", "caption": "Stuffed with sheep mik ricotta and topped with pork sugo and marinated Melrose pepper. Excellent!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/O2a-n9p8mFRzPx_bkAjA6w/168s.jpg", "caption": "PBT. Prosciutto Butter, radish, seeded rye toast, and lemon marmallata. Fabulous!"}]}}, {"review": {"des": "The service, the desserts, and the creative cocktails sneak this one up to a 5 for me. We had 2 outstanding pastas and some good creative combos: <br>Octopus spiedino with leek and sweet potato, grilled and set in pimento sauce. (Good, cooked well)<br>Burrata, prosciutto, fig, and an awesome rosemary flat bread. (Chef recommends cutting it open and making a sandwich, and we did! This was 5/5.)<br>Gnocchetti con pesto was perfection. 5/5<br>Ricotta agnolotti with chanterelle mushroom, plum, thyme sauce and topped with Burgundy truffle was my fave! 5/5<br>Wok-fried, black and white arrabbiata with shrimp in chili oil with a side of a melt-in-your-mouth meatball (Brian's favorite thing we had, but was a little sticky for my taste and I'd rather have had full shrimp instead of little shrimp bits).<br>And we *might* have gotten 3 desserts by accident... The chocolate ganache tart was eye-closingly delicious. The butterscotch budino was lovely. We also got a slice of birthday ice cream cake (even though it's neither of our birthdays -- thus the 3rd dessert by happy accident). It was beautiful but not nearly as decadent and tasty as the other two. (Though it was nice of them to still give it to us even after we clarified that it wasn't our birthday!) <br>An incredible meal and experience. We went at 5:15, ready to sneak in at the bar when available and managed to get one of their last walk-up tables. Glad we did!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/T4oSyfxML03ry1LDv8DMmw/348s.jpg", "caption": "View from the street"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/VYkyUY6zQ7X5v803crs73g/168s.jpg", "caption": "View from the kitchen side"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Bm6GPXG2knYQjNtVyepV0g/168s.jpg", "caption": "Great space!"}]}}, {"review": {"des": "Monteverde is a cute little pasta restaurant. Street parking only and it can get crowded without a reservation.<br><br>For a party of 2 we split an appetizer and two entrees. They started us off with crunchy pretzel like bread sticks. We ordered the stuffed cabbage, lamb ravioli, and the smaller portion of the Texas redfish (pesce alla griglia).  My favorite surprisingly was the cabbage dish, savory, cheesy, very unique. I didn't like the ravioli as much as it was a bit gamier than I would have liked. I think probably we should have ordered a differebt pasta dish. The fish was quite good, perfectly cooked where the meat was very moist.<br><br>I liked the drink I had - stop and smell the roses. It was beautifully garnished.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/V0fcqbqY0mBz8O3VnqJyoA/348s.jpg", "caption": "Stop and smell the roses"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/cH-FZ5PiA3KpXsgAAEBeaA/168s.jpg", "caption": "Stuffed cabbage with fried duck egg"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/SUcMZpNhp6kXTjYJbhPQbQ/168s.jpg", "caption": "Lamb ravioli"}]}}, {"review": {"des": "Enjoyed our brunch/lunch at Monteverde. A wide range of options on the menu, and between two of us, we tried to do a bit of everything. <br><br>The things we loved:<br><br>- The truffle and artichoke bite off the snack menu. They even cut this in half for us to share - but you should have one per person because it's so good<br>- The pesto dish was also fabulous - light, refreshing, with a lovely delicate taste<br><br>The thing that was most different:<br><br>- Probably the cacio y pepe...theirs is much creamier due to the whey I believe. I prefer the focus of mine to be on the pepper, but in this case, the focus of the pasta was the creaminess<br><br>The things we would pass on next time:<br><br>-The egg yolk ravioli...the sweetness overshadowed the truffles for me, which is the whole reason we got the dish<br>-Fiore di Zucca - if you're a ricotta connoisseur then definitely get this! I will stick with the artichoke and truffle next time, because that was my preference <br><br>I would recommend giving Monteverde a try. Make sure you don't skip over the pesto - it's fabulous!", "pics": null}}, {"review": {"des": "Sorry, Monteverde...I wanted to love you but I just haven't figured out why this is one of the highest regarded restaurants in Chicago. I've been twice now, once for drinks/appetizers, and another for restaurant week, and both times I was underwhelmed. Perhaps it's just not my kind of restaurant...or I haven't yet come for a standard sit-down dinner yet...but considering all its accolades I just find it underrated especially compared to all of the amazing dining options in the West Loop. <br><br>Service and ambiance were nice. Cocktails and wine selection were solid. And the food was good. But if I'm going to spend money (and calories!) on an upscale pasta dinner, I need it to be a wow and Monteverde just didn't do it for me.", "pics": null}}, {"review": {"des": "My usual M.O. in picking a restaurant is usually on hype, reputation, reviews, reading its menu and sometimes just a feeling. Most of the time I'm spot on, rare occasions am I disappointed. But, what's even more rare is when I catch such a \"Winner\" and am so overwhelmed with the experience that's taking place that I get completely awe struck.<br>This is exactly what happened to me and my party of five today<br>at Monteverde! <br>Everything Monteverde brought to you was spectacular; the ambiance, the service, the cuisine choices, the beverages, the price your paying for what your getting and of course the food! <br><br>All was remarkable. <br>Let me show you:<br><br>Mozzarella Di Bufala - I've had this dish in 200 places. Never have I used my index finger to lick up the plate!<br><br>Scrambled Egg Fonduta w / shaved Blk Truffles - Singlely one of the best brunch egg dishes I've ever had!<br><br>Salumi Arancini - rivals NYC's Arancini Bros. and that's all they make!<br><br>Egg Yolk Raviolo - We shared this dish and fought over the portions. What else can I say!<br><br>Gnocchetti Con Pesto - I closed my eyes while eating this dish and was transported to an outdoor seaside trattoria in Genoa. Wow was it good!<br><br>Creste Di Gallo - The texture of this unique pasta was amazing. I can't even describe it's crunchy, yet soft chew-able feature. All I can say the pomodoro type sauce it was bathed in just kicked this plate up 5 notches.<br><br>Small Pesca Alla Griglia - Texas redfish, sliced heirloom tomato, shell bean salad, arugula, Sicilian almond / What a combination of ingredients. We voted this our favorite plate of the day!<br><br>Roman Eggplant Parmesan  - This casserole was rich, tasty and our finale. It was marvelous!<br><br>Panna Cotta - the perfect ending to this perfect meal!<br><br>Getting blown away like this is such a treat for me. I never expect it (anymore) but when it does happen, I'm delighted and appreciative for the talent it took to do this.", "pics": null}}, {"review": {"des": "As I have said in the past, I don't give out 5 stars very often. But Monteverde is special and both times that I have gone have been perfect. Well, almost.<br><br>What's most striking is the organization of the house. Servers, runners and cooks go about their work in an almost serine manner. There's no weeds in this place. The dishes come out timely and are paced nicely. Best to go with a group, if you like to sample the city's best hands down handmade pasta and other delights.<br><br>The Cacio Whey Pepe is orgasmic, and I don't use that expression lightly. Really creamy, if you know what I mean. Etherial. I'm not sure if I could handle a single portion. Two twirls of this cheesy, creamy noodle in my mouth. Yes, I almost blew my wad.<br><br>So, we had some other dishes. I won't elaborate on those dishes, only to say that my fork twirled amongst those of my friends at the table, and we all moaned and groaned... and sipped wine. See, this restaurant, led by its uber talented chef, Sarah Grueneberg, to me is all about execution. Hell, that's what serving food is all about. Doing it the right way. It's not easy, but these Monteverde gals (and guys) get it done. They bring you the dish and you enjoy the textures and depths of flavors.<br><br>One last thing (a note to Chef Sarah)... If they took that Cacio Whey Pepe and added some pancetta and a creamy egg yolk, they would arrive at my favorite pasta dish, Carbonara. If Chef would do this for me the next time I visit, assuredly I would cream in my jeans.", "pics": null}}, {"review": {"des": "The food and service is amazing!  This place is definitely a busy one!  I came here for dinner with my fiancé, and we tried the Arancini, burrata, skate schnitzel, cacio whey Pepe, arrabbiata, and a truffled pasta special of the day.  The skate schnitzel was absolutely amazing, and all of the pastas were incredible, too.  I have to go back to try more of the menu!  We tried the chocolate ganache tart for dessert.  It was super decadent!<br><br>I came here a second time for lunch with my friend after telling her how good this restaurant is, and it didn't disappoint!  I had to have the burrata again.  The tigelle that come with are sort of similar to English muffins but are so much better.  We also had the stuffed cabbage hat comes with an amazing mushroom ragu and crispy potenta.  We had to have a few pastas including the cacio whey Pepe again, since it's so amazing, the raviolo, and gnocchetti.  Everything was so good.  They forgot to bring us the artichoke and sunchoke crostini, so Sarah Grueneberg brought it out herself!  The service was once again amazing.  There are few places I would go back to, but this is definitely one of them!", "pics": null}}, {"review": {"des": "My favorite restaurant. Not just in Chicago. Period. <br><br>Monteverde is my gold standard. It's reason why so many restaurants I eat at end up disappointing me. It's the reason I measure my purchases in $35 increments: because that's how much a typical dinner at Monteverde will run for me. <br><br>Monteverde is the reason why I've already planned out my wedding, graduation celebration, and funeral in advance: because my girlfriend tells me that I can't plan out just the caterer without planning out everything else. <br><br>All hyperbole aside (not really), Monteverde represents the pinnacle of Italian food for me. Not only does it represent some of the most amazing Italian fare I've ever had, their culture is one of the best I've ever seen in a restaurant. <br><br>First, let's talk about the atmosphere. One thing I adore about Monteverde is how accessible it is. Although the restaurant is booked two months in advance, the large bar area means that if your willing to wait for a few minutes, you will get a seat. Furthermore, the prices are fantastic. The only Italian restaurant that I've been to that even compares to Monteverde is Babbo's. Luckily Monteverde comes at a similar quality, half the price, and without any of the problematic signals associated with Babbo's. For $35, you get food better than any One Michelin Star I've ever been to.<br><br>Side Note: The fact that Monteverde does not have a Michelin star is a crime that makes the Game 6 of the Kings-Lakers Series look like a legitimate basketball game. I'm not bitter. <br><br>At this point I've had just about everything on the menu, but a running theme is the incredible amount of effort and creativity that goes into each dish. What really distinguishes Monteverde and separates it from the pack is that they are still innovating a cuisine that has existed for hundreds of years. Whether it's their vegetarian bolognese that makes any meat bolognese blush, or their Wok-Fried Arrabiata that makes me cry, Monteverde is willing to take risks and innovate in a way many restaurants aren't. Chef Sarah and Chef Riley have truly created something amazing.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/6T2GMdY_vptlPwhZip9pIA/348s.jpg", "caption": "Lillian's Stuffed Cabbage"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/jH1Rq9s8rtf2x026UAS-0A/168s.jpg", "caption": "Cacio Whey Pepe"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/kHDyCrw5UcSZNQmmLigzfQ/168s.jpg", "caption": "Tortelli Verde"}]}}, {"review": {"des": "I love the fresh made pasta here!<br>Everything was delicious! We got Black Truffle Egg Yolk Raviolo and tagliatelle pasta with a glass of champagne to start our morning as tourists in Chicago!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/zqzG_OS6a3ljLaCSHlLMYw/168s.jpg", "caption": "Black Truffle Eggyolk Raviolo"}]}}, {"review": {"des": "I've been here twice, once for a double date dinner and once for a girl's day saturday brunch. Amazing both times. The ragu is so flavorful and the shank falls apart on the plate and melts in your mouth. The meatballs in the ragu are incredible, best restaurant meatball I've ever had. We got so lucky and chef Sarah came out to check on us, it made the experience so special. Even the salad was amazing, the dressing was so spot on. The other standout was the giant ravioli, pictured below. The ambiance inside makes you feel like you might be in an italian pasta shop instead of chicago. The home made pasta is so fabulous I wish I could take some home. I try to make a reservation here every time I am in Chicago. Simply the best.", "pics": null}}, {"review": {"des": "My Yelp batting average for 2018 is sorely lacking in plate appearances. Let's get back to the dish.<br><br>Like many a fellow Yelper, there's a hole in my heart and a hurt in my belly on the death of one Tony Bourdain. My wife likes to joke that Tony and I on a first name basis, based on how many times I casually name drop him during our eating adventures. Correspondingly, my Yelp reviews are replete with Bourdain mentions. He changed the way we think about food, about company, about life about how simultaneously large and small the world is, about how we are unique and similar, different and the same. He will be missed.<br><br>There exist many Bourdainism moments that stick with me - some famous, others fleeting, transient, exceptionally important only to a handful. And to me. One of those is a No Res episode in Rome, where Bourdain eats a dish of cacio e pepe. Hearing him gush exquisitely over this exceptionally simple plate of noodles immediately stirred me into absolutely having to try and make this meal post haste. As much as I can visualize Bourdain enjoying one of life's simple pleasures, I can visualize myself in the kitchen, mise en place, boiling pasta, grating cheese, melting butter, crushing pepper.<br><br>So it has been told that a fundamental reason we love to eat is the way dining cajoles our memories. Such it was with Monteverde's cacio e pepe, a wonderful dish in its own right, but an especially sentimental one to me. It's undoubtedly Sarah Grueneberg's best dish, among a bevy of strong contenders, I had that night; Yelp reviewers tend to agree. Though I'd argue, you can't go wrong with any of the pastas. The arribbiatta, another personal favorite, was top-notch, and the raviolo special equally fantastic. I'd also urge not to pass up the stuzzichini starters or Sara Lamb's desserts.<br><br>That cacio e pepe, though. It's ingrained in my brain, a searing memory urging me to revisit again soon.", "pics": null}}, {"review": {"des": "Enjoyed my first meal finally at Monteverde. I've been dying to try this place. We shared the ragu which was very good but I enjoyed both the Wok-Fired Arrabbiata and the Skate Schnitzel even better. I'm glad I tried it but I would not order the Ragu again unless I was in a big group. The meatballs in the Ragu were the best. The Ragu and the Arrabbiata were both tomato based but the Arrabbiata was full of garlicky, herby flavors. Plus, it has shrimp in it! The Skate, though, omg! It was fried and delicious. I can't even describe the flavors, there were so many. I licked this plate clean. Our friends also enjoyed their scallops and other pastas.<br><br>Oh and I had the Cherry Bomba and some red wine. Both were excellent. <br><br>I wish the portions were larger for the price but I thoroughly enjoyed it!", "pics": null}}, {"review": {"des": "Lets start with the bad...<br>1.  Our server was not good.  Unattentive.  Non directional.  We just didnt mesh.  1/5<br>2.  Reservations are less than stellar...only way to reserve is online.  No way to call for reservations.  Completely booked for good times for at least 2.5months ahead of time!  Ouch...the price you pay for a great restaurant.  2/5<br>3.  We only ate a little bit of gnocchi, arrabiatta and ragu.  We asked to pack it up to take home and at the end of the meal, they handed us a large bag.  The next afternoon when we were excited to dig into our leftovers, they only put the ragu in the bag!!!  No gnocchi and no arrabiatta.  Very annoying.  We purposefully ordered everything so we could try a bunch but then have leftovers for the next day.  0/5<br><br>Lets talk about the middle of the road...<br>1.  I didnt love the decor.  I felt like I was in a food hall or cafeteria from Harry Potter or Game of Thrones.  3.5/5<br><br>Lets finish with the good...5/5<br>1.  The freaking food was some of the best I have ever had.  Amazing dishes from start to finish.<br>Fried olives were absolutely amazing.  Crispy outside with a little piazzazz of mustard and the right amount of salt.  We loved these.<br>Swiss Chard and polenta...the chard was in a white cream sauce, perfectly sauteed mixed with chunks of polenta that was crispy on the outside, but buttery and creamy inside.  Perfect.<br>Eggplant was such a complex dish.  You could taste the roast on the veggies.  Loved the hearty red sauce...slathered in melted cheese.  YUM.<br>Gnocchi were perfect little shell like pastas with a herbaceous basil cooked just over al dente with the right amount of pecorino...heaven.<br>Arrabiatta was great, however out of everything, it was our least favorite...not because it was bad, but because everything else was so amazing.  The pasta was great.  Little bits of fried up shrimps with a little bit of a spicy red sauce.<br>Lastly...the ragu.  I am so glad my husband talked me into this dish despite the server telling us its made for 2-4 people.  It was HUGE.  However, it was also the most amazing dish of the night.  The meatballs were the PERFECT texture...not too dense and not too crumbly.  Sausage was amazing and that pork shank...  You can tell this dish has some love put into it.  <br>2.  All of the other staff except for our server!  Every other person we encountered was personable, nice, our speed..from food runners, to the front of the house staff, to other servers.  5/5<br>3.  Chef was dining with some friends right behind us and we rudely interrupted her to tell her how much we loved the food.  And in true top chef fan nature, I asked for a photo with her.  Alas, she was literally the nicest person ever.  Made my experience!  5/5<br><br>I am totally late to this party, but Monteverde is definitely a place to check out in Chicago.  The calories/carbs are worth it...I just wish I could enjoy our leftovers today... :(", "pics": null}}, {"review": {"des": "Monteverde has been on my radar for a while now.<br><br>I would recommend making a reservation, however if you come early before a dining rush hour, it would be possible to get seated at the full-service bar as my boyfriend and I did. <br><br>The waiter told us that the dishes run a bit small and it is encouraged to order ~4 dishes, presumably 2 appetizers, and 2 pastas, or two small dishes and 1 large dish which can feed 2.<br><br>Roasted sea scallops: This came with 2 very large, and extremely succulent scallops. I do not think the lentils did much to enhance or complement the scallops, but both the scallops and lentils on their own could have been separate delicious dishes.<br><br>Egg yolk raviolo: From the bar, we could see the cooks making the pastas fresh for each new order. I did not realize that the raviolo came as one large ravoli filled with ricotta and a soft egg. The description seemed a bit misleading as I expected a lot of smaller-sized ravioli and a very creamy sauce. I wasn't a big fan of the dish. The flavor seemed monotonous from the and there was a sweetness to the dish that I didn't expect. The pasta itself had a great texture. I wish I had ordered a different pasta dish with more actual pasta. <br><br>Cheekstone farms 24oz prime bone-in rib-eye: This was a near perfect dish. Everything was delicious from the seasoning on the rib-eye to the umami brussel sprouts to tart, chewy dried tomatoes. The only issue was that we ordered it to be medium-rare and there were several parts that were more on the rare side.<br><br>Overall, the rib-eye totally impressed me. One of the best meat dishes I've had but I was truly disappointed that I didn't enjoy the pasta here as much as I would have wanted to. I'm teetering between a 3.5 and 4 on this review. It's an impressive restaurant but I can't say it ranks among my top Italian restaurants in Chicago.", "pics": null}}, {"review": {"des": "Garnering accolades from day one for Pasta visibly made on-site and a rustic-chic approach to Modern Italian fare it was on Saturday afternoon that Brunch was ordered at Monteverde, Chef Sarah Grueneberg's 2017 Beard Award for Best Chef Great Lakes hanging proudly on the wall and the outdoor patio quick to fill while the interior was perhaps at 1/3 capacity.<br><br>Opened in 2015 and a Best New Restaurant awardee the following year, time under the guidance of Tony Mantuano allowing Grueneberg access to great Ingredients but apparently never convincing her that pretense and a good view were necessary, guests entering Monteverde will immediately notice a homey feel despite see-and-be-seen layout, the waiters and waitresses all professional yet genial whether describing plates or suggesting Wine while back-servers do world-class work keeping glasses filled and making emptied dishes vanish.<br><br>Slightly varying the daytime menu from that at night, Brunch plates lining the left column with Snacks, Small Plates, Pastas and dishes \"Per la Tavola\" to the right it was after a discussion of serving sizes that four items were requested, a one-by-one procession begun by two styles of Grissini from which savory bested sweet while a $6 follow-up of three Zeppoles immediately made Dessert a necessity thanks to unrivaled lightness beneath Cardamom Sugar and Raspberry Jam plus plenty of warm Vanilla Cream for dipping.<br><br>Originally planning to go all-in on Pasta, those thoughts reconsidered when the waiter described \"generous\" portions, it was instead \"#Montemadame Toast\" that next found itself compared to a similar Croque-riff from The Loyalist just one day prior, both Radish and Black Pepper helping to refresh a classic but Fontina Cheese simply not as enthralling as well-made Mornay Sauce.<br><br>Next presented with Gnocchetti and instructions *not* to mix the Ingredients so flavors could stand apart it was admittedly interesting to see the variance in textures ranging from creamy to leafy before disobeying and creating something far better with a few stirs, the famous \"Cacio Whey Pepe\" to follow intensely saline on first bite but subsequently mellowing as heat developed in the mid-bite before permeating the sinuses. <br><br>Turning things over to Pastry Chef Sara Lamb to finish, time at The Pump Room and now Monteverde Restaurant & Pastificio making her a name to watch, it was ignoring warnings from one Staff member that two Desserts were requested, the $12 Butterscotch Ice Cream Puff manageable by one thanks to delicate Choux, Meringue and complexities created by Booze and Fruit plus Buttered Pecans that all contributed to something greater than the sum of its parts while the Warm Chocolate Ganache Tart was admittedly a dish best shared thanks to its thick Dark Chocolate that even Bananas, Caramel and Ice Cream could not make seem lighter.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/V4gmQPMD1JYH7lPeEXjTBQ/348s.jpg", "caption": "07/07/18 Monteverde"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/qulU7F2RrKzPphVJ0vRIEQ/168s.jpg", "caption": "07/07/18 Monteverde"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/9pEULIcirYTxtRUlDgS6ng/168s.jpg", "caption": "07/07/18 Monteverde"}]}}, {"review": {"des": "Monteverde is an exceptional restaurant. <br>Exceptional food. <br>Exceptional service. <br>It's even a great value compared to other restaurants of its caliber. <br><br>I have not tasted anything at Monteverde that I would not recommend, but if I had to pick a few highlights, they would include Roasted Sea Scallops  and Stuffed Cabbage -- two of the \"small plates\" that were complex and delectable (and FWIW could easily serve as a main course). <br><br>Among pastas, the Arrabiata is rich and intense with minced shrimp, anchovies, and chili oil, and the stuffed pastas are literally made (i.e. stuffed) to order, but the best of the bunch may be the deceptively simple Strangozze Al Pomodoro. <br><br>The entire wait staff is cheery, helpful, and efficient. If you are lucky enough to get Rose as your server, you'll find a waiter who is very knowledgeable and adept at explaining the menu, and eager to make your evening a delight.<br><br>Desserts are as insanely good as the rest of the menu, so save room.", "pics": null}}, {"review": {"des": "Came for a celebratory dinner and was amazed! There were four of us, so we ordered a lot and shared. Started with the octopus, artichoke crostino and rice balls. They were all so good, but the artichoke crostino was by far the best! The truffle mix with the cheese and delicate artichoke was so good! We shared the eggplant parm, gnocchitino, wok shrimp pasta, cacio whey pepe. The pastas were so unique and had such well balanced flavors. The gnocchitino was my favorite again, with the pesto being light but rich in flavor all at the same time! We also had an order of really delicious meatballs that just melted in your mouth. We finished with a celebratory cake from the chef, and we had to try the budino too. The cake was like an adult funfetti cake on a new level. The toffee budino was unreal- I had no idea what we were ordering but I will order again every time we're back. It was so delicious! The chef stopped by our table and was gracious enough to take a picture with us. A great atmosphere and eating experience! <br><br>Update: Next visit with photos- also amazing! Please get the lemon blueberry dessert. Our server convinced us and it was one of my favorite desserts in Chicago. I was nervous because my husband isn't a huge lemon guy but OMG it was bright and salty and sweet and just absolutely delicious. Also, the gnoccheti continues to be a favorite.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/UJUcdN7T3MaL89paZysFDA/348s.jpg", "caption": "' Nduja Arancini"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/dkrG6UlmhH_Zggr9RkE1Og/168s.jpg", "caption": "Burrata e ham"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/O27h5PsAyqpVrz1m4mu6ow/168s.jpg", "caption": "Wok fried Arribata"}]}}, {"review": {"des": "Let's put it out there--lots of people love Monteverde...and lots of people are perplexed by why so many other people love Monteverde.  I was nervous coming into this meal because my \"work wife\" thinks this is the best restaurant in Chicago, while two other couples I know had classic hit-or-miss experiences.<br><br>I'm happy to say that for whatever reason, we had a five-star experience.<br><br>Positives:<br>--the food, all of it that we tried:  the ahi tuna crudo, the pappardelle, the arrabbiata, and the salumi sauce arancini.  I mean, all of the flavors, the prep, the presentation, the serving sizes...all good<br>--a couple of these dishes are a roll of the dice, none more so than the wok-fried arrabbiata, so as a menu goes, it's fun to try some things that freshen up the idea of \"stale\" Italian, and you can tell the restaurant prides itself in this area<br>--the space, although while I'm calling this a positive, if I had been seated right next to a loud group of six, this could have gone the other way.  Just know that the way Monteverde lays out its varied seating options, you could get unlucky with the people rightnexttoyou<br>--it's semi-easy to get a table here during traditional dinner times on Tuesdays and Wednesdays so try to take advantage!<br>--quality cocktails, but...<br><br>Negatives:  none that we experienced, but again, I have food friends who I trust who had only average experiences here.  This really will come down to ordering the right things, but even the arrabbiata was a dish that one friend of mine disagreed with, even though she was excited to try fried pasta.  Also, we skipped dessert (this is rare for me) because we were meeting friends after this dinner elsewhere; I've not heard exceptional things about the sweets here!", "pics": null}}, {"review": {"des": "Everyone makes mistakes. How well you handle those mistakes is what sets a restaurant apart. We spent my 40th birthday seeing Hamilton (simply incredible!) and went to Monteverde afterwards. We started with Oma's Green Mountain Salad and went for the 24 oz prime rib. Regretfully, the prime rib was taking quite awhile to arrive. Before we could speak with our server, the manager, Amy, stopped by to apologize. She acknowledged the wait and provided a glass of wine free of charge for our inconvenience. The steak was amazing! We finished dinner with the butterscotch goodness and tart. Our server also gave us two cookies on the house, since we were struggling between those 3 desserts. Thank you to the staff of Monteverde and their manager for making my 40th birthday dinner wonderful!!!", "pics": null}}, {"review": {"des": "Overall: Romantic, delicious, and unique, Monteverde deserves all the hype it receives.<br><br>The good: The atmosphere is refreshingly non-Italian, even if the bulk of the menu is. There's a uniqueness to it that's almost indescribable in that it's almost like you're in an outdoor patio (which they also have). The service is friendly and attentive, but the star of the show is obviously the food. The ham e burrata is, as always, good, but the beets were what made the dish stand out. They were flavorful, unexpected, and were a pleasant addition to the traditional pairing. The pesto gnocchi was also out of this world, with potent traditional flavors. The cheeses and sauces were rich and, by themselves, unbelievable (which is how the chef recommends you eat them).<br><br>The not-so-good: The skate schnitzel was surprisingly disappointing and nothing about it wowed me in any way. The gravy was bland, the fish itself forgettable, and the dish is overall just an odd combination. Also, the arrabiata, while good, was over-hyped and over-spiced. It was too intense overall. Also, be prepared to book far in advance, because even when we did several months ahead, we still only had an 8:30 option.<br><br>Atmosphere:10/10<br>Service: 9/10<br>Food: 8/10", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/64ovkG53sknR2EG0CrCITA/348s.jpg", "caption": "Wok fried arrabiata"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/kgpIuS0nR9NFPwvGk-bfbg/168s.jpg", "caption": "Gnochetti con pesto"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/gexn9GEnNHRFKgqxUPOKEQ/168s.jpg", "caption": "Skate schnitzel"}]}}, {"review": {"des": "Thank you, Monteverde, for not letting me down. Thank you less for the fact that my pants don't quite fit as well today. [Wish I could give it 4.5 stars]<br><br>The place: Had reservations at 8pm on a Wednesday night (that were made a month in advance mind you) - and it was PACKED when we arrived. It's not a small place, but every. seat. was. taken. There was slightly more than a dull hum permeating the air, but I was pleased to find that I could still hear my friend very well across the table - not something I take for granted in the Chicago dining scene. In a few instances it felt a little too crowded - I may have accidentally bumped ass first into 2 or 3 servers, but they took it in stride. And hey, it's not that often that my ass gets bumped at all, so all in all, not so bad. Service was great. Re-filled our waters, checked on us appropriately, made a helpful recommendation.<br><br>The taste: Yum. Yum. Carbolicious yum. We shared the hamachi crudo - cold, crisp, spicy, delicious. The octopus with leeks. We devoured this. Small bites, but tasty ones. The cacio whey pepe. <br><br>Cacio whey pepe deserves a line all its own. While not traditionally creamy, this dish had some creamy elements and reminded us of a very sophisticated adult mac and cheese. Absolutely divine in its simplicity, restraint, flavor profiles. I could eat that every day (if I wasn't worried about my ass bumping into more people). <br><br>We shared the daily special - the egg yolk raviolo - perfectly seasoned, rich, delicious. I love the runny yolk. We shared the gnochetti with pesto and pecorino - we thought it was good, but a little on the salty side. We couldn't quite finish it, because we wanted to leave room for dessert. We made a solid dent in the chocolate ganache tart. It was good, but we probably should have stopped.<br><br>She got a glass or two of wine. I tried the saba soda - which was interesting - it's made from grape must and was likened to balsamic vinegar. <br><br>My face: Carb-filled smile. Wow. This was a great meal. Check off my bookmark list (yay, feeling accomplished!) Bill for 2 was $128. Worth it. Will be dreaming of the cacio whey pepe (and the fact that Chef Sarah Gruenberg made an appearance) for a while.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/aSonde1pFUsKP3H6O46tGw/348s.jpg", "caption": "Hamachi Crudo with chili oil - spicy but delish"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/TTJFEbI9w3zZiJHLkA380w/168s.jpg", "caption": "Gnocchetti - with pesto and pecorino"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/jvrvfORVGMash11QCHM9LA/168s.jpg", "caption": "Egg yolk raviolo- the daily special. The yolk was runny and perfect"}]}}, {"review": {"des": "Monteverde is perfect in every way. The staff truly cares about their business and values how they present themselves, and the food they put forth. I fell in love with the melone e ham. The prosciutto, burrata, and bread encompasses the essence of a warm homemade meal.<br>In addition, the staff was incredible! Our server was knowledgable about the Italian wines they offer and provided impeccable suggestions.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/5zWVNeYN0ZdvhdQkpnwyEw/348s.jpg", "caption": "Melone e Ham...absolutely incredible."}]}}, {"review": {"des": "Probably my most favorite place I chicago and one of my most favorite pasta places overall. Great scene and the pasta is great- get the arrabiata - something that is unique but excellently done. <br><br>The place is packed but bar seating comes and goes quickly.", "pics": null}}, {"review": {"des": "This was a fantastic meal.  Our server was very friendly and was able to help us decide when there were so many options.  There were three of us (all women) and we ordered about 5 dishes. They were all delicious and it was the perfect amount. We even had a little room for dessert which was also fantastic.  Our server was really great at explaining how the menu works and recommending these dishes to us. I highly recommend coming here; I know I look forward to coming back to try the next round of dishes they cook up for the next season/menu.", "pics": null}}, {"review": {"des": "Whatever you do, please treat your tastebuds to this fantastic restaurant when you're in the neighborhood. There is no choosing between this restaurant and another- eat here!! We had a fantastic time- they bring each table toasted thin, long breadsticks in a mason jar to start.  We had an impeccable strawberry tuna tartare appetizer and lastly split the Ragú- THIS IS A MUST. They make their own homemade noodles (can actually watch them being made through a ceiling mirror) and pasta sauce. The pork was literally falling off the bone. And the spicy meatballs were to die for. This is pricey but it's certainly large in portion and taste.", "pics": null}}, {"review": {"des": "We had a great time with delicious food and excellent service at Monteverde for VDay dinner. We ordered two small plates and one big dish to share.<br><br>Octopus Spiedino - this octopus skewer was my favorite dish of the night. The texture was flawless. Leek in between the octopus and the sauce made the octopus more palatable.<br><br>Smoked Fish Rillettes - loved crispy polenta and salad on this pretty plate! Crispy polenta has a very thin and crispy shell with soft boiled cornmeal in the middle. It reminded me of fried rice cake (\"糍饭糕\") - a traditional local breakfast option in Shanghai. The salad on the side with dried cherry tomatoes has a little bit of sweetness and sourness that went very well with the fried polenta. The dish would be perfect had the smoked fish be less savory. <br><br>Ragu Alla Napoletana - the decent amount of food on this plate is enough for 4 people to share. The flavorful sausage and super tender pork shank were my favorite! Pork fell off the bones easily and it melted in the mouth. Meatball was delicious, but also very filling. I'd like the fusilli rustico to be boiled a little longer and wild oregano be less greasy. <br><br>Butterscotch Budino - brûléed top with chocolate crumbs, rich chocolate pecan toffee, and whipped mascarpone made it a perfect ending for a sweet date on Valentine's Day.<br><br>We are definitely going back to try other interesting things on the menu.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Ctsgo4A1fxlVdY6ghDriwA/348s.jpg", "caption": "Octopus Spiedini"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/edNKIVFvvTHJMTsL7M8cFQ/168s.jpg", "caption": "Ragù Alla Napoletana"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/_BX83h3-E0JylbYpnEK-Cw/168s.jpg", "caption": "Smoked Fish Rillettes"}]}}, {"review": {"des": "I could limn this place. I could recount, in an assiduous manner, how phenomenal the foods were. But at this point, they'll just be words arranged neatly on a page, paragraphs of malarkey. There are places you describe and places you experience; and this place, my friends, is the latter.<br><br>However, this is Yelp, so let's detail this roller coaster of an experience, shall we. Their budino is what brought us here, but I'll touch back on that later...let's start from the very beginning.<br><br>Bread sticks...awesome! And they're complimentary, LoL. They were very flavorful, I'll just leave it at that. Do try them, though.<br><br>We started with the 'njuda arancini (the rice balls). So imagine the best pizza puff you ever had and exponentiate that by a million (flavor-wise) except there's rice and the outer was crisp to perfection--that is what you are dealing with here and on top of all that, there's this glorious aioli they serve it with.<br><br>Then we moved on to the artichoke and sunchoke crostino. Let us pause for a sec and give this masterpiece the respect it deserves. If there is one thing that you need to try while you are here...IT IS THIS! I'm not going to be even describe it because it will fail on all fronts...the English language does not have enough adjectives for you to fully grasp the craftsmanship that went into this dish. You just need to look your waiter/waitress in the eyes and ask for the crostino and I'm just going to end this paragraph with: YOU'RE WELCOME!<br><br>Now we moved on to the gnocchetti con pesto. This is even harder to describe than the crostino. I mean, that gnocchetti...swoon. If a person can fall in love with food, I most definitely am madly and deeply in love with this pasta. Then, they sprinkled in the pesto and that ricotta, shaved in the Sardinian pecorino, and it doesn't stop there...they topped it with basil and pine nuts. It's the true embodiments of the highest quality of ingredients done in the most simplistic of ways to deliver an out of this world experience. It was clean, it was delicious, and it was every flavor working together for the common good of blowing your taste buds into oblivion!<br><br>My friend got the pork cheek tortellini in brodo, which in short could be deduced to the Italian ramen. The broth was so flavorful. The tortellini and the pork cheek cheek inside it, wow. Again, clean, flavorful, everything working together to enhance and not overpower. It was a great bowl of delight.<br><br>For dessert, we got the house spun ice cream and sorbet of the following flavors: passion fruit, blood orange-cranberry, and coconut milk. And not to sound like a broken record, yes, it was simple, clean, and everything a sorbet/ice cream should be. The texture was amazing, it was creamy, and you taste the flavor of the fruit without being too \"icy\". It was light and palate cleansing. My favorite was the passion fruit and my friend liked the blood orange-cranberry. But, in all honestly, it was all great, you really can't go wrong. It was served with three coconut-chocolate forgotten cookies, which is actually befitting because they were forgotten because of the amazing-ness of the sorbet. Not to say they weren't good, we were just too busy eating the sorbets.<br><br>Now, this part, I'm somewhat conflicted about: their butterscotch budino. I couldn't grasp this dessert one bit. In my opinion, it was way too salty, almost like I was eating a cup of ocean water...like my internal concentration was bordering on saline water proportion. I couldn't taste the butterscotch because the salt was too overpowering...the whipped mascarpone helped a little to lessen the saltiness, but it could not be salvaged. Even the brûléed topped did nothing to sweeten the dish. On paper this dessert seemed amazing, but a big let down in reality. But then again, it was the very first budino I ever ate, so not sure how salty it's supposed to be. Maybe I'm bias towards the sweeter spectrum of desserts. Maybe for some budino master, this is how it's supposed to be. The texture of the pudding was great. It's disheartening that the experience ended in such a weak note. <br><br>However, with that all said, this place still gets my highest recommendation because I do believe that one bad thing should not jeopardized the rating of a place. I still believe I came away with a great experience and their food was solid. I wasn't feeling one item, they shouldn't get ding for that, maybe someone else might taste that and it'd be the best thing they ever ate. <br><br>In short, go try this place, most everything in their menu is awesome. I'd come back to try every single thing in their menu for sure.", "pics": null}}, {"review": {"des": "The food: 4/5. I tried their restaurant week menu, which included squash crostini, salad, redfish, pasta with meat ragu and citrus sunday for dessert. Everything was very satisfying and very heavy, as expected from pasta dishes. However, I didn't love their wine pairings. The reds were just ok, and I wasn't at all a fan of the type of amaro they offered after dessert. Grappa or Fernet would've been a better option. <br><br>The service: 4/5. The service was fast, but not that friendly. <br><br>Overall: 4/5. A good Italian option in Chicago.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/3KdrnOnT2fZC2kSJX7AcDw/348s.jpg", "caption": "Squash crostini"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/cjcxYw_0acHRbdUUzmXPGw/168s.jpg", "caption": "Redfish"}]}}, {"review": {"des": "The service, food and ambiance were all great at Monteverde. I was there with a large group where we tried a variety of items including: skate schnitzel, artichoke and sunchoke crostino, gnocchetti con pesto, cacio whey pepe, ragu alla napoletana, nduja arancini and the oma's green mountain salad. I also had a dirty martini -- including delicious blue cheese olives (a major plus in my book). <br><br>The items at Monteverde are recommended as shareable, family style items. So, just be prepared for that. In a large group, I'm not a big fan of sharing... especially when it's a mixed group of folks that I don't know very well. So, that is really what I didn't love. When with my husband or close friends, I may consider otherwise. But, if your weird about sharing food, this may not be your spot. <br><br>I'd definitely try Monteverde again, I'll just be sure to be prepared to share!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/2uSLBswvDVoVvV-cBW60SA/348s.jpg", "caption": "Ragu Ragù Alla Napoletana"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/3T9-mcAWHoB-UK6mYZYZsw/168s.jpg", "caption": "Ragu Ragù Alla Napoletana"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/GAa00-PEDt066lh4rhP5SA/168s.jpg", "caption": "Gnocchetti Whey Pepe"}]}}, {"review": {"des": "I really wanted to like this place but it didn't live up to the expectations. I had been wanting to go to Monteverde for a while and was excited to try it after finally getting reservations. It's difficult to get reservations so make sure to plan several weeks in advance! The ambiance is nice and dim. Our waiter was friendly but the food here just didn't do it for me. <br><br>We started off with the PBT ($4 a piece) which was pretty good. We ordered a few cocktails ($13 each) which were also good. For the main dishes we decided to share the tortelloni di zucca ($15) and their famous ragu alla napoletana ($49). The tortellini was pumpkin filled and delicious. Our waiter had warned us that the ragu was a very large dish and good for groups of 4-5. He was right - it was huge. It comes with pasta, sausage, meatballs, and pork. I had high expectations for this dish because of all the Yelp reviews but l wasn't impressed. I thought the flavor was quite plain and not memorable at all. Although it's worth $49 because it is a very large dish, I would not order it again.<br><br>For dessert we tried the butterscotch budino which was ok - almost too sweet, and that's saying something since I'm such a sweet tooth. We paired it one of the desserts wines (tiny glass for $9) recommended by our waiter but I didn't think they went well together.<br><br>Overall, even though so many people had raved about it, I wasn't impressed with Monteverde.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ee4G2--ypIACj6AVZ55YAw/348s.jpg", "caption": "PBT"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/lLTyAFdVEBkXkgA2iw6RVA/168s.jpg", "caption": "Butterscotch buddino"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/gm3tJ0jIM5jaiEFAfDVpyA/168s.jpg", "caption": "Ragù Alla Napoletana"}]}}, {"review": {"des": "Came to Monteverde on Tuesday and our reservations was at 5:30pm. We were seated right away when we got there. Service was on point.<br><br>We started with the Artichoke and sunchoke crostino. This was pretty good. Then we ordered the pork liver mousse. I was not a fan of that. It had a some horse radish like taste to it and I don't like horse radish. <br><br>For our entree we decided to share the Ragu Alla Napoletana. The pasta is massive. It can definitely feed 3-4 people. There was only two of us and we couldn't finish it. The pasta was ok. The meatballs were too mushy for my taste. The sausage and pork meat was good. The sauce tasted like spaghetti sauce. <br><br>It was a decent place but I wouldn't come back again.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/G8caCR1LLcKNiQYRANYSBQ/348s.jpg", "caption": "Ragù Alla Napoletana"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/F7onf8eIRPv2VmXpW4x63A/168s.jpg", "caption": "Pork liver mousse"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/q1It0WfFI3dGuuVtI0fPBg/168s.jpg", "caption": "Artichoke and Sunchoke Crostino"}]}}, {"review": {"des": "After looking at where I dine, I realized that I don't do enough Italian for fine dining or restaurants. Kinda odd considering that I like pasta quite a bit.<br><br>Anyway, second day in a row scratching off a place on my list that had been on there for a long time. Much like Fat Rice yesterday, Monteverde lived up to its hype. I was a little worried because Italian and/or pasta is one of those things that can be hard to separate yourself and stand out from other Italian restaurants. They achieved that easily.<br><br>The spread we went with was the crostino and the schnitzel to start. Aganolotti and Arrabbiata for pasta and then finished it off with butterscotch for dessert. The starters were recommended by the server. Honestly, I was skeptical at first because schnitzel can be hit or miss and crostino sounds boring. They were anything but. The crostino looked and sounded simple but it was flavorful and a fantastic, unintentional pair to the schnitzel. And the schnitzel... jeez, that came out much larger than what we were expecting. Again the flavors here we fantastic, the tomatoes and onion had a nice sweetness to go with that savory and crispy pork (I think it was pork? Haha). Definitely recommend it.<br><br>Both pastas were great. Let's get that out the way. For me, I liked the aganolotti a tad more and she preferred the arrabbiata. It's splitting hairs really, both were great and can't wait to return to try other pasta dishes. Finished the night with the butterscotch and some tea and left a very satisfied customer!", "pics": null}}, {"review": {"des": "Ambiance was nice and romantic although a bit louder than expected. Small bar in the middle with a tv to watch a game if you chose. Wine selection is great. <br><br>Garlic sticks were fantastic and extra crispy which I loved with the presentation of a mason jar. The artichoke crostino was our favorite dish which was quite unique. I had their version of an old fashion which was way too sweet! Don't order it... Taste like blood orange liquer.<br><br>The wok fired shrimp with garlic oil dish sounded unique but was deceiving as there was barely any shrimp and the mix of black and white pasta brought a bitter taste.<br><br>The egg yolk ravioli was interesting with what was the largest ravioli piece I have ever seen but has way too much truffle oil on it and took away from the creamy cheese... Personally go to Momotaro and try their what yolk pasta instead!!!<br><br>The gnoccetini with pesto was solid... Great flavor and extremely fresh hence the extra star. <br><br>Desert we had the chocolate tart which just has too many things going on with banana ice cream marshmallow and candied nuts it felt like cold stone and tart. <br><br>I did ask for a side order of the sausage but it was never brought out which was a dissapppbtment.<br><br>For a place that we waited a month to get in I was very dissatisfied overall!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/axEhD8hX4ZlFXtolZGJYag/348s.jpg", "caption": "Gnoccetini con pesto"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/JIFIBuIw1XfiPO467upjMw/168s.jpg", "caption": "Wok fired shrimp arrabiata"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/4wsKhVKkcXykNTs_I_g_qg/168s.jpg", "caption": "Egg yolk ravioli"}]}}, {"review": {"des": "Was alright.<br><br>Service: This was where they shined. From beginning to end, our waitress Rose was the star of the night. Attentive, helpful, not overbearing, and all around super nice! Also, water glasses were frequently replenished.<br><br>arrancini- the aioli beneath them was better than the actual rice ball. Pretty average<br><br>Burrata e ham: delicious! Def cut the little Italian English muffin in half and make a Sammie. So yummy and the proscuitto butter is next level <br><br>Tortellini verdi: was really not feeling this. The miso sauce made it feel like tortellini teriyaki. Ew<br><br>Gnocchetti: pesto flavor was good, but the pasta itself was more reminiscent of shells & cheese than gnocchi<br><br>Baked apple croute: YUM<br>Chocolate ganache tart: alright", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/M34S_eL_B7fcp83n4MjE0Q/348s.jpg", "caption": "burrata e ham - best of the night"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/vAP1ITlk5a39pT2-aTm2vA/168s.jpg", "caption": "Tortellini Verdi- meh"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Vq8aQQS-X67qrsZnZa1YcQ/168s.jpg", "caption": "Gnochetti"}]}}, {"review": {"des": "I honestly don't know how a restaurant can get any better. Food, ambiance, service, price point, wine selection... all fabulous. We were lucky to nab some reservations about 3 days in advance for a late lunch at 1:45. Only time slot open the entire day so I grabbed it!  The place was fairly packed when we got there but we were seated right away at the table in front of the kitchen. We got to see amazing things come out which got our mouths watering even more. The Ragu was extremely popular and I can see why by just looking at that mound of deliciousness. We opted for the sea scallops (perfectly cooked) and nduja arancini for starters and both were incredible. All 4 of us shared our entrees and every single one was a winner. I opted for the campanelle al pomodoro with blistered cherry tomatoes. Amazing. And it was only $15. Boom. My wife got the Cacio Whey Pepe which looked kind of plain sitting in the dish but the taste was off the charts!! It was one of our favorites and I will order that for myself next time. The gnocchetti con pesto might have been the best pesto I've ever had and that's saying something! And the egg yolk ravioli?? Spectacular!<br><br>I have found a new place to add to my favorite list and another place to take friends when I want to impress them with some amazing Chicago cuisine. Total winner all around.", "pics": null}}, {"review": {"des": "All the food was flavorful and they offer generous portions. Service was quick  and friendly.", "pics": null}}, {"review": {"des": "Gotta give this a rare 5 stars: the food won me over.<br><br>As a group of 4 we were able to order 5 dishes and 2 desserts, and it is no overstatement to say that most of the dishes completely blew us away with how utterly delicious they were. We left super full and very satisfied. <br><br>The pretty, instagrammable PBT (prosciutto butter toast) was a star, and tasted just as good as it looked, with tons of unami and freshness packed onto that slice of rye. The Italian style donuts were such a value for money, at $7 for 5, and accompanied with an orange blossom honey creme, it made us very happy right off the bat.<br><br>For mains we chose the pesto gnocchi and the ragu, which we were told is suitable as an entree for 3-4 people (this is accurate). <br><br>For anyone familiar with the liguian trofie al pesto (one of my favourite dishes across all of Italy), the pesto gnocchi reminds you of that- the pillowy gnocchi melt in your mouth, along with the bright pesto and creamy cheese. <br><br>The ragu was a hearty meal- there was fusilli pasta, meatballs, sausages, and a pork shank where the meat literally slid off the bone cleanly at the gentlest prodding (see video).<br><br>Sight disappointments were the desserts- we tried the butterscotch toffee pecan one and the chocolate ganache tart with almond praline. The former was extremely rich, sweet, buttery, salty- nice as a first bite, but I was sorely missing some relief from that full-on sweet-saltiness. The chocolate ganache tart was alright, good but not sensational. We should have chosen a refreshing sorbet after all that ragu!<br><br>Our friends called desserts for (a certain equally popular Italian outfit) but mains for Monteverde.", "pics": null}}, {"review": {"des": "Amazing Italian tapas joint. We got two dishes between two people and were good. We got the Tuscan kale salad and the eggplant parm. Both were so delicious. Everything on the menu looked amazing though. I'd try to save room for dessert too because they have an awesome looking menu! The house made breadsticks were too salty tho.", "pics": null}}, {"review": {"des": "Wow. Monteverde completely blew me away. I went here with my family while home for the holidays. We always go out for a big Italian meal, but we decided to change up the location this year and I think we've found our new family tradition! Monteverde has a very creative menu that's set up to be consumed as shared plates - which is great 'cause if you're like me you're going to want to try everything. <br><br>The PBT was like nothing I've ever tasted before. I mean, take a salty meat and butter and add a bunch of delicious fresh veg? You have to try this app if you go here (even if you're just there for a sip and a bite at the bar). <br><br>The Chicky Chicky Parm Parm meatballs were on special. They were essentially chicken parmesan meatballs that were deep fried and oh, so good. <br><br>The Winter Kale Salad was really, really good and carried some unique flavors that left the salad tasting perfectly balanced. <br><br>The Seared Scallops (served with lentils and pork belly) were delicious. The lentils soaked up all of the flavors in the bowl. <br><br>We intended to share pasta, but I got greedy and kept my pumpkin tortellini all to myself because it was melt in my mouth amazing. With apple, a balsamic glaze, and fried sage leaves, I was in heaven. <br><br>For dessert we split shared the Butterscotch Budino, Baked Apple Crostada, and *Surprise!* a delightful birthday funfetti ice cream cake. All were yum and went great paired with some espresso. <br><br>This all goes without saying that the service was out of this world - our waiter, Sam, gave us great recommendations and was incredibly attentive throughout the night, picking up on the fact that it was my dad's birthday even though no one actually mentioned it in his presence. <br><br>We had a great evening celebrating my dad, and I look forward to more celebrations here in the future.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/_d4dWS1SzwZRyDcHf8S5Ug/348s.jpg", "caption": "Aperol Spritz."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/piIvEEeLS1vi1QNlV52J6w/168s.jpg", "caption": "Sage and lemon cocktail."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/zZFBlelyyqEClhmZO4ir5Q/168s.jpg", "caption": "Breadsticks are bomb."}]}}, {"review": {"des": "Went here about a month ago and since then I have become convinced that they are producing some of the best Italian food (particularly pasta) in the city right now.  <br><br>We sat outside on a Saturday afternoon (heads up dinner reservations are tough but lunch time seems to be much easier if you want to come check this place out).  We had several small bite apps, including a fantastic fried zucchini flower.  The money is in the pasta, and we had a gluten free member in the party who was also able to order pasta and I will say this was bar none the best gluten free she or myself had ever tried.  It both tasted and had the texture of true pasta we wondered if they had been accidentally been real pasta - it was not (Gluten free pasta lovers rejoice - this is the place to eat for you).  Pappardelle with pork sugo and the never to be missed cacio whey pepe (made with ricotta whey - NO WHEY!!!) were absolute winners.  The service was so friendly and welcoming (we brought a young 2 month old with us which was no problem here).  The wine list is quite nice and we had a delicious orange wine that was a BIG hit at the table.  <br><br>This place is truly special and I am so glad that in a city with such a wealth of great Italian food that they have found their space here.  Chef Grueneberg deserves her accolades and perhaps even more.  Grazie mille Monteverde!!!", "pics": null}}, {"review": {"des": "This place was recommended to me by a friend and I am so glad that I took her up for it. The restaurant has intimate seating, which translates to you being able to hear other people's conversations pretty clearly if you can't tune them out. Other than that, this place serves up some deliciousness. Plates that my friend and I shared consisted of:<br><br>- Fried squash blossom stuffed with ricotta and honey drizzle = 5/5<br>- Octopus spiedino = 3/5<br>- Burrata e ham with prosciutto butter = 5/5<br>- Wok-fried arrabbiata = 2/5<br>- Chocolate-dipped forgotten cookie = 5/5<br><br>If available, everyone must try the fried squash blossom - a light mixture of sweet and salty and very addictive! The other dish that put my friend and I in pure ecstasy was the burrata e ham. This was essentially a build-it-yourself fancy ham and cheese sandwich with the bun slathered in meat butter. Adding the sugar snap peas (part of the green accoutrements on the plate) gave it nice crunch and sweetness that unexpectedly worked quite well. We could have skipped the wok-fried arrabbiata since it was way too salty (I should have listened to other reviews), and the shrimp was grounded so not even considerable enough to be considered a shrimp pasta dish in my opinion. We barely touched this dish and could have lived without it since the burrata e ham was quite substantial in quantity for the two of us. We did have room for a small dessert and coffee and was glad we both chose the forgotten cookie because it was quite memorable. An airy meringue with a slight saltiness to it - salted caramel perhaps?<br><br>All in all, a great place to try out while in Chicago. Get the burrata e ham though!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/KrEC1hR7fYSj3uAGxR9jMg/348s.jpg", "caption": "Open kitchen"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/XCBq3tlDxNnQMgBwQN2PzQ/168s.jpg", "caption": "Prosciutto Butter aka meat butter"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/TCSGbZX_JAPubHq3ko-Myg/168s.jpg", "caption": "Forgotten cookie was very good and light"}]}}, {"review": {"des": "Monteverde was a long awaited bucket list item ever since I came to Chicago a year and a half ago. I was able to grab reservations for a Friday night dinner about a month in advance (this is usually the expected wait, but I'm sure it's easier to get a 4 pm weekday reservation). <br><br>I was really looking forward to monteverde because it's a classic Italian restaurant in the city, but I think I set my expectations a little too high. When looking at the menu, I was pleasantly surprised at how relatively inexpensive the pasta dishes seemed for a dinner menu. I then realized this is because the portions are about 2/3 of what a regular portion would be. My waiter recommended two small plates and two pasta plates for two people.<br><br>We got the roasted sea scallops appetizer - two scallops for $20 which seemed a bit ridiculous, but each scallop tasted like it was $10. Definitely one of the more memorable seafood dishes I've had, but not a regular splurge I'd be willing to pay for. We then got the Cacio whey Pepe and Pork Cheek Tortellini in Brodo. The cacio whey pepe was very unimpressive. The ricotta was too strong and the pasta was too sour and al dente for my preference. The pork cheek tortellini comes in a soup form with a 72 hour pork broth. On one hand, I could taste the 72 hours. On another hand, if you told me that the soup came straight from a can, I would've believed that too.<br><br>Overall, I believe monteverde has missed expectations. I've definitely had better pasta in the city and I had to book this dinner a month in advance which contributed to the hype. I also believe that I just chose the wrong dishes. As expensive as it was, the scallops really were great. But my monteverde experience could've been significantly different had I gotten pasta I know I traditionally prefer. Regardless, the ambience was perfect for a Friday night and I would definitely consider revisiting in a year or two.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/JbWWY0x4i9ueL2sGJ9RjEg/348s.jpg", "caption": "Interior"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/JPE3Q5GVi_NvklI1Ynx2YA/168s.jpg", "caption": "Roasted sea scallops"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/E_MgZfeEBKmjnlUQOPxXrQ/168s.jpg", "caption": "Pork cheek tortellini in brodo"}]}}, {"review": {"des": "If you pay attention to the food scene enough, you'll become accustomed to certain names and understand you should probably eat at their establishments. Sarah Grueneberg is a name that's been out there for the last few years for everything from winning some more national awards to coming in 2nd to become an Iron Chef.<br><br>While visiting Chicago, I knew I needed a solid meal and something my girlfriend would love. This came to mind as I have some fairly picky friends who reported back really good things about Monteverde.<br><br>From the start, the service was excellent. Very hospitable and our waitress was full of good suggestions. The interior is nice and inviting as well and is definitely a place I'd feel comfortable in more than just once. <br><br>As far as the food goes, everything we had was at a minimum solid. We felt that the small plates and appetizers were done a little better than the entrees. The level of creativity on some of these was really good - the PB&T with prosciutto butter, radish, lemon, etc. Did I ever think of these combinations? Hell no, but it works really well and looks great. Artichoke & Sunchoke crostini? Great. Smoked fish rillettes? Does not sound amazing but the combination of all the flavors together really works. Some of these things are approaching Michelin star level to me and surprising they didn't even get a bib gourmand - I digress, but still. What the hell?<br><br>For the entrees, we had the egg yolk raviolo and cacio whey pepe. The egg yolk raviolo is one big raviolo with a cast of flavors around it that just work like pecans and morel mushrooms. The cacio whey pepe is a more standard dish but done pretty well. My only complaint is that the cacio whey pepe was a touch salty but not too bad. All of the pasta is made in house and cooked perfectly (at least in my opinion).<br><br>All in all, I was extremely pleased with my meal and would return here in a heartbeat. I don't know what the Michelin folks are smoking, but this is bib gourmand at the very minimum with some dishes easily approaching 1 star quality. The service was excellent from start to finish too. Much recommended to any lover of good, solid food and even some dishes that you may think \"I would have never in my life thought of doing that.\"", "pics": null}}, {"review": {"des": "Fantastic meal! The service was beyond excellent- they were attentive, helpful and quick! <br><br>We wished we would've tried more pasta dishes, as we went with the scallops, Brussels sprouts, Arancini balls and ragu. The ragu, although large, was just more meat than pasta. I'm also not a huge fan of pork, but it was still tasty. That's really just a preference thing, though. Dessert was great, especially the ice cream. I would definitely try again.<br><br>Warning: reservation required far in advance!", "pics": null}}, {"review": {"des": "This place was truly excellent. The food, while not as creative as some of the other hot & trendy places, was cooked homemade with fresh flavors. Though, add this to the list of places where it's next to impossible to get a reservation. <br><br>For apps we got...<br>-nduja arancini (3.5/5)<br>-octopus spiedino (5/5) One of the best things we got!<br>-burrata e ham (4/5) very good! Especially the bread that comes with it.<br><br>For pastas we got...<br>-Cacio whey pepe (4/5)<br>-gnocchi (5/5) the pesto makes this! <br>-ragu (5/5)+ also a winner, it was HUGE amount of food that we couldn't even begin to finish. The meatballs were so flavorful! <br><br>And even after stuffing our faces we had to get dessert. The budino, the unsung hero of the meal. We didn't need the dessert, but it was well worth it.<br><br>Prepare to leave here with a lighter wallet but a FULL belly. Only note of criticism, the pacing of the dishes could have been better.", "pics": null}}, {"review": {"des": "Came to Monteverde for dinner to celebrate my 3rd anniversary and had an amazing time! The service was spot on, the food was delicious and my dining companion was perfect. I will definitely be dining at Monteverde again, for dinner and brunch. <br><br>What we had:<br>*Artichoke and Sunchoke Crostino - 5 stars, highly recommend.<br><br>*Octopus Spiedino - 2.5 stars, wouldn't get again.<br><br>*'Nduja Arancini - 4.5 stars, highly recommend.<br><br>*Skate Schnitzel - 5 stars, highly recommend. I wish we'd gotten two of these.<br><br>*Gnocchetti Con Pesto - 4 stars, recommend.<br><br>*Wok-Fried Arrabbiata - - 3 stars, just OK. I'd recommend you get two Skate Schnitzels.<br><br>*Ragu Alla Napoletana - 5 stars, highly recommend. This dish is truly meant to be shared as it is huge. The meatballs, sausage, pasta and pork shank were all delicious!<br><br>*Baked Apple Crostata - 4 stars, recommend.<br><br>*Warm Chocolate Ganache Tart - 4 stars, recommend.<br><br>Overall, Monteverde gets 4.5 star for being a bad ass restaurant that I will definitely be going back to!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/RK_qWvUEMpZX4Ylbnoh-rA/348s.jpg", "caption": "Baked Apple Crostata"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/dYm4iCh7dnEELiw9XdRM7Q/168s.jpg", "caption": "Ragù Alla Napoletana"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/DQWXkoVzcU03oz5ubgVR-A/168s.jpg", "caption": "Wok-Fried Arrabbiata"}]}}, {"review": {"des": "Monteverde was an amazing place to have lunch with my family. My little sister had initially recommended it but I didn't truly believe her until we started eating. We started off with the artichoke and sunchoke crostini which was a great starter. For $5 per crostini, it is on the expensive side but the taste was really good for a starter. My other family members also enjoyed the Octopus spiedino but I did not try this one as octopus is just not my thing. <br><br>The pasta is truly where Monteverde shines. It's exactly the al dente pasta I crave. We ordered 3 different pastas and loved them all! The cacio whey pepe is a smaller dish - I would recommend to share with up to 3 people. It's such a simple dish with simple ingredients but because it was done so perfectly, this was one of my favorites. We also got the Gnocchetti with pesto. It was my first time having gnocchetti (honestly didn't even know this was a thing) but I LOVED the baby little shells! I really liked the added touch of basil and pinenuts but for me personally, there was too much cheese in the dish. <br><br>To round out the meal, we ordered the huge Ragu alla napoletana which is a huge bowl of deliciousness filled with fusilli pasta, 3 sausages, 4 Italian meatballs, and one large pork shank in the center. All the components were so good on this dish with my favorite parts being the super tender pork meat on the shank and fusilli pasta. I just cannot rave enough about the pasta here. It is seriously SO SO SO delicious. I even went to Eataly after this meal to purchase pasta as I was so inspired after this meal. <br><br>Amazing service from Amanda - she was so pleasant and upbeat! Our waters were refilled so frequently I don't think I ever had more than half a glass empty. I think the meal was truly quite affordable for the amazing pasta dishes and a great place to have a family style type meal. If you're planning on coming, I would definitely try to make reservations at least 6-8 weeks in advance if you can or at the very least call before you arrive to ask about the wait time!", "pics": null}}, {"review": {"des": "Everything here is so delicious, and the wine list is great too. Our favorite dish was the Ragu, but the pumpkin ravioli and the Cacio whey Pepe were also amazing. The Ragu is huge, and the meatballs and pork shank are so tender and flavorful that the dish is well worth the price.", "pics": null}}, {"review": {"des": "I walked in  and was lucky enough to grab a seat at the bar area. The bartender was very helpful in food recommendations and helped me through the right amount of food and his own personal recommendations, which was well appreciated. Price is fairly reasonable given the food quality and how popular this place is. <br><br>I ended up ordering the truffle toast, pesto gnocchi, ravioli, and chocolate tart. <br><br>The fresh pastas were great of the two I had I preferred the ravioli. The pasta had a nice bite to it and had a nice al dente texture to the ravioli.  Can't really go wrong with pesto and the dish had a nice balance with the pine nuts and cheese.<br><br>My favorite part of the meal was the truffle toast. If I knew how good this was I would have ordered one less pasta and ordered two more of these. I can eat these all day (disclaimer I really love black truffle).<br><br>Chocolate tart was also delicious and I'm glad I ordered it even though I was pretty stuffed from the meal.<br><br>Monteverde has won a number of awards including James Beard best chef Great Lakes. had watched the season of Top Chef Texas where the chef was a finalist. I knew the pasta would be great from her time studying in Italy, the dishes she made throughout the season.", "pics": null}}, {"review": {"des": "I reserved for 15 people (11 adults and three children and one baby) for Sunday lunch. They were very accommodating even for a guest with food restriction. We ordered set menu and they were all fabulous. We had to change last minute with the food since they were all out but it shows how popular these food can be. I would totally go back again for other dishes.", "pics": null}}, {"review": {"des": "Food and service is spectacular! Joe who was our server was very attentive although it was extremely busy. He provided great recommendations. It's best to share plates and treat it as family style meal. So much to enjoy! Would recommend this place to everyone....even children at the table next to me were enjoying their meals.", "pics": null}}, {"review": {"des": "Food was great. Service, not so much. <br><br>The guy pouring our water was amazing. Our glass never went empty, and he was always there when we needed to find out server. <br><br>And that's the problem. Our server never checked in on us. She checked the tables aorund us, but not us. Hopefully if you decide to go you'll have a better experience!", "pics": null}}, {"review": {"des": "I expected to like this place as I went to one of the tapings of Dishaliscious and had some of her food (including some dried gnocchetti, which are small shells and nothing like gnocci).  I did not expect to be blown away.  Seriously Michelin, this isn't on par with other Italian restaurants in NY and SanFran?  Disagree wholeheartedly...but I digress.  There were four of us for lunch on a Sunday at 2:15.  It was sort of a last minute idea and we were pleasantly surprised we were able to get in before their limited menu kicks in.  We were sat immediately and our server was very friendly.  It is not a very large spot but they have an inviting bar area and the restrooms are nice as well.  The wine list is primarily Italian but they have a few other options as well.  We started with a Champagne, which had about a 1.5x markup but was good.  The Nebbiolo we had for the second bottle was about a 2x markup so nothing unexpected there.  The star of the drinks (according to all four of us) was the Shakernato with Creme de Cacao (the server thought it was dark as opposed to light but he wasn't 100% sure).  Two others tried it with other spirit options but nothing was as good as the Creme de Cacao and this was one of the best after dinner drinks I've ever had.  My husband got the vintage amaro flight and it was good as well.  Overall, portion sizes and pricing was appropriate and service was paced well.<br>You start with breadsticks and the rosemary ones were super awesome.  You really got a lot of olive oil flavor in there, although the wheat honey ones didn't really do it for any of us.  We like to share dishes anywhere we go, even if the menu isn't designed for that but fortunately the menu here is definitely conducive to sharing.  I was told by a friend to get the ragu at the end because it is large but even better on day two so we knew we had to find four other dishes for us.  The amount was perfect for four if you're looking to share and we did have a little of the ragu leftover at the end.  We started with the arancini and the exterior was so crispy that we all asked if they were double fried and were told they were not but I have no idea how she gets that perfect crunch.  The spice level is perfect as well and they are bursting with flavor.  The cheese concoction on the bottom is so tasty and the dish overall set a high bar.  The burrata came next and as far as preparations go, this is one of the best I've had.  The burrata itself was nothing spectacular but we've had a lot of burrata, including in Italy so that is not a knock on it but the whole dish with the beets and ramps made the dish take on a spring flavor and the prosciutto was actually really solid.  But the star on that plate was the bread.  I don't know what was in there (other than milk and lard cause the server told us that part) but this bread was unreal.  I would definitely ask next time I'm there if I can just buy an order of that bread.  They intend for you to make a little sandwich and I loved that originality.  We then got the stuffed cabbage dish and added the duck egg (duh).  The mushroom sauce was outstanding as was the polenta.  Our only complaint was that the egg was slightly over so some of the yolk had solidified but I know 10 seconds will do this.  I'm going to save the best for last but the ragu was literally amazing.  I tried the sausage and thought 'wow, this is so good.'  Then I tried the pork, which just fell off the bone and was the perfect tender texture.  The pasta and sauce itself was splendid but then I tried the meatball and, at first, thought okay, this is all right.  About 8 seconds later I realized I had underestimated it and just started pointing at it as if instructing my friends to try it.  Best...meatball...ever.  Because we had a red sauce, we wanted a white or lighter sauce so we tried the pesto.  There is no protein in this dish but to say you won't miss it is a understatement.  This was hands down the best pesto any of us had ever had.  We asked if the server knew what kind of olive oil she uses but he wasn't sure.  It's likely not anything I could get my hands on but worth a try.  The basil and pine nuts were literally perfect as well.  I am going to dream about this pesto for the rest of my life.  If you don't try it, you will regret it.  This is a spot you need to try and some of the best Italian food I've ever eaten, inclusive of Italy.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/aFv6ia_DSY22FNnE1VXNbQ/348s.jpg", "caption": "pesto"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/3KwuGWtSLQsTtQW-K1DtsQ/168s.jpg", "caption": "ragu"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/o0O0V9i82XfgEI5A2lW9Ww/168s.jpg", "caption": "cabbage"}]}}, {"review": {"des": "Monteverde is the ideal restaurant for pasta lovers such as myself. Save yourself the effort of reading this review and just make a reservation already!<br><br>Monteverde is located in the West Loop which is a cool low key neighborhood without all the riff raff found in the tourist hot spots. The interior is rustic chique and service is constantly moving to keep cups filled and plates cleaned. The servers are quite informative and great at describing the dishes for you.<br><br>After some delicious wine and cocktails we ordered a scallop appetizer to tease the palate. My entree was the wok seared arrabiata which blew me away with great spice and complex savory and herbal notes. The portion was perfect for my liking however it would be small for big eaters. My wife ordered the cacio whey pepe which was creamy with the right amount of parmesan and pepper to make it a dish worth craving everyday. For dessert I ordered a mango sorbet which was smooth and fruity without the weird icey texture that plagues many other sorbets. A cookie was thrown in that I can only describe as a texture between a biscuit and a marshmallow with a flavor of coconut and chocolate.<br><br>It goes without saying that the pasta was perfectly prepared in it dishes. They have a single chef dedicated to making pasta to order and he/she is stationed immediately behind the bar so you can watch the prep.<br><br>Overall I think this dinner was an absolute riot!  I'll come back here for sure.", "pics": null}}, {"review": {"des": "closing out april with a bang by reviewing one of my favorite dining experiences over the past few months.<br><br>we came with a group of 6 people and basically ordered most of the highlights off the menu to ensure we'd get to try a mix of different dishes.<br><br>don't want to bore you by going into all the details for every dish we tried, but suffice to say that you really can't go wrong with chef sarah grueneberg at the helm. <br><br>the food here is not only hearty and reminds me of delicious pasta meals that i've had in italy, but also just smells and looks amazing with plenty of fresh ingredients. i've always stood by the fact that you eat with your eyes and nose as much as your mouth and stomach. and monteverde really knows how to appeal to all the senses.<br><br>the semi-open kitchen concept is also something i've always appreciated, so i can watch chefs work while i eat. there's something really cool and satisfying about watching a well-run kitchen work their magic.<br><br>best of all, prices are reasonable which makes this restaurant more accessible for a delicious dining out experience. and won't break the bank if you want to come back over and over again.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/0MhiQgUuEwCQQkmQ2aSeAQ/348s.jpg", "caption": "hamachi crudo"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Ten6KIlTtzt4Yec1nkBnBg/168s.jpg", "caption": "brussels sprouts"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/2gReFzdwAspBtDPcqEbiow/168s.jpg", "caption": "gnocchetti con pesto (before the pesto was mixed in from the bottom)"}]}}, {"review": {"des": "We wanted to check out Monteverde now for about 9 months, my fiancé and I finally settled for a 5:15 reservation on a Tuesday night.  It impossible to get a reservation! The place is really cute and actually not as big as I would have expected.<br><br>I'll be completely honest- I'm not sure if I hyped up this place too much for myself or what but I was pretty disappointed with the food.  To start, my fiancé ordered himself an octopus appetizer which he really enjoyed but he thought the onion(?) that came on the stick overpowered the octopus which was otherwise delicious.  <br><br>For the rest of the meal, we decided to split 3 pastas, since this is an Italian restaurant after all.  We started with the tortellini which came in a broth.  It was different and very soup like but I enjoyed it.  The next pasta was a daily special with pancetta and parpadelli.  I really wished there was more meat in the pasta.  The sauce had a spice to it from the chili flakes, but in general the dish was just okay.  To finish we had the cacio whey pepe.  It was what I expected taste-wise: peppery and cheesy.  However I was greatly disappointed that our pasta was underdone- no, I don't mean al dente.  There were a couple pieces that were difficult to bite and hurt my teeth.  This was particularly disappointing because this means the pasta was probably not fresh, but I had higher exceptions of such a highly regarded Italian restaurant.  My fiancé did not enjoy any of the pasta dishes we tried.<br><br>To finish the dinner, we had the star of the dinner-the dessert.  A beautiful and delicious chocolate tart which we paired with a couple of boozy espressos. <br><br>The service was wonderful and attentive.<br><br>Overall, I'm not sure I will be back.  I did not think the pastas were memorable and the portions fairly small.  Walking out, there was a table that got one of the large entree dishes and that actually looked good, so I might consider coming back to try that if they accept walk ins at the bar but I do not see myself going out of the way to come back any time soon.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/il6nU-Vm_hSIc4MOxZXAEw/348s.jpg", "caption": "Double Chocolate Ganache Tart"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/XGMJXqeI5VDvK-cKWqmftA/168s.jpg", "caption": "Cacio Whey Pepe"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/uSyI1_Cc5vd0OobyeARa6A/168s.jpg", "caption": "Octopus"}]}}, {"review": {"des": "AMAZING! I am not a fan of going out for Italian food because I figure it's just pasta. But this placed blew me out of the water. We came here for brunch on a Sunday at 1:45. We started off with the zeppoles, 2 octopus sticks, poached eggs in sauce, 2 meatballs, and arancini. The hubby and I were sooo full. The Bloody Mary was delicious and I had the Bob Ross which didn't even taste alcoholic! Our waitress was super sweet, informative and amazing. We even got a piece of birthday cake with a candle for my 21st birthday (for the 9th time). <br><br>DEFINITELY GO HERE!", "pics": null}}, {"review": {"des": "Amazing!!! Everything about this place is amazing. Loved the atmphosere, the service, the wine, and of course the food!<br><br>I had called about 2 weeks ahead for a reservation but was told they were completely booked. They told me bar seating and patio seating were first come first served though. We got there right when they opened at 5 and they were able to seat us at a table. <br><br>Our server was fantastic. He was helpful and very attentive. <br><br>We each got a glass of the sangiovese which was great! The breadsticks they give you at the table were great too! Being our first time here we wanted to try everything! Our server recommended ordering several plates as he said the menu is designed around family style dining.  We ended up getting one of the specialty pastas with fresh truffles on it-- it was by far my favorite thing of the night! I am still craving it! Truffles are the best thing ever! We also got the arrabiata which was spicy and delicious. The shrimp is chopped into bite sized pieces. These were or first two courses and we were definitely already full. But we had ordered a small order of the redfish too. The small portion was the perfect size. It was so flavorful! <br><br>Since we were celebrating a birthday they brought out a piece of funfetti ice cream cake which was super cute! The dessert menu looked great though! Im dying to try their straciatella gelato-- it's my favorite flavor!! <br><br>We will definitely be back! Thank you Monteverde for a great night!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/8f1eLHwmKFeTUtScOl33Iw/348s.jpg", "caption": "Redfish"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/PA_Iry0buKd-gIpd8BlfGA/168s.jpg", "caption": "Birthday cake!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/IPv_MibB9P6bAWxrxk6V7g/168s.jpg", "caption": "Arrabiata"}]}}, {"review": {"des": "Food:<br>+ tomato cucumber salad - very good, large portion, fresh, loved everything except for the small fennel pieces on top<br><br>+ ahi tuna crudo - liked eating it with the sesame cracker, tuna was a little fishy, but the watermelon paired well with the tuna overall<br><br>+ hand cut pappardelle - loved the noodles and everything about this dish, none of the ingredients overpowered another, very flavorful<br><br>+ wok-fried arrabbiata - usually gravitate towards pasta like this with garlic, tomato-based sauce, and shrimp, wished it was more spicy, dish was good but started to taste very shrimp-y as we kept eating it<br><br>Service:<br>+ professional, courteous<br>+ a little slow at times<br><br>Ambience:<br>+ romantic, dimly lit, very busy<br>+ perfect for dates, small group gatherings<br>+ there was a date going on right next to us and my friend and I both felt a bit awkward at times with all the intimacy and hand holding (but can't blame the restaurant for that)<br>+ seemed like more of an older crowd than other places", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/rHv6QGpRhEVbOvRlp0qfow/168s.jpg", "caption": "Tomato cucumber salad + ahi tuna crudo"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ZlOBHq6w6-RLXfPMMaqDlQ/168s.jpg", "caption": "Hand cut pappardelle + wok-fried arrabbiata"}]}}, {"review": {"des": "My boyfriend and I went here for one of my last big meals in the city. I had been trying to get weekend reservations here for forever. I ended up just making one for brunch time. WORTH IT. So the pasta was amazing. We had the cacio e pepe and the gnocchi type pasta in pesto. Now cacio e pepe is one of my favorite foods, but that pesto. Oh my god, it was good. Just a little citrusy, which added a brightness that was really nice amongst all the richness of the other pasta. We also had the burrata appetizer. DO NOT PASS THIS UP. The tiny rolls that came with were to die for. The cocktail I had was delicious, the boyfriend is non-alcoholic, so he didn't appreciate it, but it was great.<br><br>We were lucky enough to have the chef come ask us how our food was, which was a great touch. I will be back as soon as I get back to my city. 'Til then, I'll be in STL dreaming of my chicago home and pasta.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/FJb9yQnVDm7fHZVl3M8shQ/348s.jpg", "caption": "Smoked fish dip. I thought I wouldn't like the grainy crackers. Boy, was I wrong."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/q-YHp-Vq-fv38IyqcKBdgg/168s.jpg", "caption": "The burratta. That bread with rosemary was to die for."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/sgL0qb2_ddCZ2-Ndm3kpdg/168s.jpg", "caption": "Breadsticks"}]}}, {"review": {"des": "Great place to sit at the bar and enjoy some delicious wine and Italian food. All their pastas are freshly made!<br><br>The octopus was THE BEST octopus I've ever had. It is so tender! The sauce it comes with is also a great touch.<br><br>The \"textbook\" wine was my favorite! Such a good California cab.<br><br>The wok fried arrabiata was a great semi spicy pasta dish! Had white and black taglioni with ground gulf shrimp and garlic hot pepper oil. Wasn't too heavy of a pasta dish.<br><br>Got a side of the soppresseta meatball, which was great too! Just an overall lovely experience.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/KxArj-yMmuxRFtAuXbs7Aw/168s.jpg", "caption": "Soppresseta meatball side"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/FGFl1dBxSOvNbr0wjsdL-g/168s.jpg", "caption": "Wok fried arrabiata. Get this if you like a little spice!"}]}}, {"review": {"des": "Service was outstanding. I really loved the inside especially the pasta prep in the center. We went on a Saturday for an early dinner with another couple. We shared plates so we had the opportunity to try a lot. The little gnocci pesto was AMAZING. No joke one of the best pasta dishes I've ever had and I've been to Italy. I would give it a 4 because I wasn't crazy about the large ragu dish but everyone else enjoyed it so does not seem fair to doc stars for that.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/7tkO-sLoVI5BcYrEXgXDnw/348s.jpg", "caption": "Birthday treat!!!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/l85Crf2BQQXzz-okRB21SQ/168s.jpg", "caption": "The big ragu for $50."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/BhsymvaHYGF4eFIx4KjyeQ/168s.jpg", "caption": "Very cool presentation. They tell you to mix it up. Tad bit spicy!!"}]}}, {"review": {"des": "Monteverde has stand-out Italian food in a down-to-earth setting. And I'm definitely a fan! <br><br>I came here for my birthday, and it was a darn good pick. The cacio whey pepe dish just might have been the best pasta I've ever had. Ever. It was such a far cry from the classic cacio e pepe that can often be made just as well at home. And in all my years with celiac disease, I've never seen gluten free pasta shaped in large tubes, and I've never had gluten free pasta that tasted quite so good either! My only wish is that there had been just a liiittle bit more. My fiancé's arrabbiata pasta looked like a much larger portion, and he kept commenting about feeling guilty still eating when I'd already finished!  <br><br>We weren't huge fans of the drinks (I had a glass of the pinot negro and he had the \"birch please\" cocktail), but the pasta was a hit all around. We overheard a waiter mention to a table next to us that dishes are meant to be shared, so next time, we'll order an appetizer too or three pastas to share.<br><br>Also, a word to the wise: definitely make a reservation in advance! I tried to do so a couple of nights before, thinking it wouldn't be bad for a weeknight and just two people, but the only opening was 10pm! We waited an hour for a table without a reservation, but I can imagine this place gets insane on the weekend.", "pics": null}}, {"review": {"des": "A serious score here. Everything on the menu was A++ but my favorite standout was the Ragu. I woke up the next morning thinking about it. The meatballs and sausage were so damn good...heck, the veal too...the whole plate of Ragu blew my mind.<br>Not to take away from the rest of the menu which we sampled extensively, it was all some of the best Italian food to be offered!<br><br>Special shout out to the bartender, super cool dude. His Irish impression is spot on!", "pics": null}}, {"review": {"des": "I was SOOO excited for Monteverde. After an unsuccessful (and anxiety-inducing) attempt at getting seated at the bar area, my friend and I finally came with a reservation excited to dine in a civilized way. (The bar area seating is not monitored and coordinated by the restaurant. You watch current guests like a hawk and snatch a spot when one opens up, often competing with other people waiting.) Honestly our experience was disappointing. Definitely a 3.5, tops, in my book. There were some delicious bites but the flavors got very much the same and underwhelming the more we ate.<br><br>We got the following:<br>:: skate schnitzel :: Very different from traditional schnitzel due to the use of fish, chili, and green onions. Yummy, unexpected, but a bit salty overall.<br>:: gnocchetti con pesto :: Our server mentioned the chef instructed no mixing so that we could taste different flavors in each bite. We obliged. And yet, I feel the flavors were flat. The cheese was very nice, so was the pesto. But I think it was missing something more than two pieces of basils to cut through the richness.<br>:: wok-fried shrimp arrabiata :: Pasta was al dente and the flavors were good. But I was hoping for more of a kick. <br>:: ice cream and sorbet w/ forgotten cookies :: Pleasantly surprised by the portion for only $7. For Ice-cream, the coconut milk and walnut crunch flavors were delicious. Also loved the passion fruit sorbet.<br><br>Bottom line - Personally for me it was a worthy visit, but not worthy enough for me to want to come back to try the ragu or more seasonal stuff like summer truffle pasta. I feel it's a place for celebratory occasions and best if you have a bigger party (at least 4) so you can have a little bit of everything.", "pics": null}}, {"review": {"des": "Stopped in without a reso Friday night around 6:45 and was quoted a an hr wait, which isn't bad at all for the size of the place. They have cute outdoor space that runs along the front and side of the restaurant. Table was ready after only 30 mins, woohoo! My friend and I split a bottle of Nero d'Avalo, got the stuffed cabbage for an app, and shared the gnocchetti with pesto and cacio y pepe. Yum yum yum! The stuffed cabbage is a MUST! Pastas were great too, very saucy and seasoned. <br><br>Second time was as great as I remember the first being. Will definitely be back, ideally on the patio next time!", "pics": null}}, {"review": {"des": "Went here with the besties for a night out and absolutely loved it! The waiter provided great suggestions for food and wine! Had an amazing dish of pasta with lamb and be sure to save room for dessert!", "pics": null}}, {"review": {"des": "Monteverde is easily my favorite Italian restaurant in the city of Chicago. Chef Sarah is an extremely talented and accomplished chef (having spent a considerable amount of time running the kitchen at the Michelin rated, Spiaggia prior to this endeavor).<br><br>She brings her outstanding culinary techniques to Monteverde, and evidence of this is displayed dish after dish after dish. <br><br>We ordered the lamb ravioli as well as the Ragu Alla Napoletana. <br><br>The lamb ravioli blew my mind, however the RAN made me squirm in my seat. First, the dish is huge. Please split this with two people. Second, every single component of the dish was prepared spectacularly and tasted way too good. There is just something about fresh, housemade pasta. that cannot be beat. <br><br>The best part about Monteverde, is that Chef Sarah tweaks different ingredient pairings, however, she stays within a relative realm of traditional pairings so it doesn't at all come across like she's trying too hard to be \"unique\" or \"one of a kind.\" <br><br>What you get at Monteverde is traditional cuisine, impeccably prepared.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/MbjEwBBdZEzEDF_cgWm57Q/168s.jpg", "caption": "ragu alla napoletana"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/J6y66153ReAy4rSfAoIkkg/168s.jpg", "caption": "lamb ravioli"}]}}, {"review": {"des": "So glad we decided to come here. One person in our party arrived early and secured a table for all four. We knew the wait would be a bit, without a reservation.<br><br>We wanted to share plates here and try a bit of everything. So, we ordered lots of pasta! Monteverde is well known for their handmade pastas and you can see it resting inside before being cooked to perfection.<br><br>So, we ordered the Cacio Whey Pepe (Mancini bucatini, pecorino Romano, ricotta whey, four peppercorn blend) This is a traditional pasta, cheese and pepper dish. Simple but fantastic!<br><br>Next we ordered the Gnocchetti con Pesto (housemade ricotta, basil, Tuscan pinenuts, Sardinian pecorino). It's very pesto-y but it was creamy too. A very good choice.<br><br>Finally we ordered the Ragu alla Napoletanna (fusilli rustico, cacciatore sausage, soppressata meatball, tomato braised pork shank, wild oregano). This was a mound of a dish, fit for a table of 4 to enjoy. There were lots of flavors from the pasta to the meatballs to the sausages - it was all fantastic! <br><br>My only wish was that they offered a tiramisu for dessert, but I can see why Monteverde is a local favorite and deserves every star on the chart. We thoroughly enjoyed our visit!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/sf5OumCAG-NrEntvpN9YNQ/348s.jpg", "caption": "GNOCCHETTI CON PESTO housemade ricotta, basil, Tuscan pinenuts, Sardinian pecorino (after stirred and served)"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/TfKBIY0126RS7vZuegbyRQ/168s.jpg", "caption": "GNOCCHETTI CON PESTO housemade ricotta, basil, Tuscan pinenuts, Sardinian pecorino"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ETyC5MNXykAiI3l8ys_Wrw/168s.jpg", "caption": "CACIO WHEY PEPE Mancini bucatini, pecorino Romano, ricotta whey, four peppercorn blend"}]}}]}