{"name": "mother-cluckers-kitchen-chicago", "reviews": [{"review": {"des": "Best chicken ever! The chicken is juicy, yet crispy on the outside and since it's not fried you don't feel as guilty eating so much! I always pair the chicken with the hush puppies- they are delicious, especially warm!<br><br>Only issue is that there is limited seating and parking.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/k0epkqFl41OdB9fw8oHIZg/348s.jpg", "caption": "Huge portions!"}]}}, {"review": {"des": "Pros: the shrimp po-boy is really great!! They have pretty good deals there as well. Didn't explore other options but for my first time it was really good!<br><br>Cons: I had hush puppies along with it but wasn't too fond of it. <br><br>Overall: A decent experience here", "pics": null}}, {"review": {"des": "I definitely a fan, but have mixed feelings about it. I got there at about 10:55am on a weekend and was told it was brunch menu only. By the time our order was taken, the people who were seated had dinner menus, but we were still not allowed to order from that menu. Seems weird. Anyway...<br><br>The food was good. I can't say it was ALL good as the waffle with my Chicken and Waffles was super dry. The chicken was amazing. Truly amazing. So much so that I ordered a dinner meal to-go. Was not a fan of their cole slaw at all (who puts bell pappers in cole slaw?) The hish puppies are (forgive me for saying this AMAZEBALLS. Chicken was excellent, but not as good on the next day as say...KFC. That was a let-down. I'm curious how long it will take tie-hards to knock my comparison of this place and KFC. But dammit, it's true. What else? The Mac and Cheese was also just OK, nothing special. <br><br>There is one things though....they serve Pepsi. And for that, I'm a fan for life. I'll be back.", "pics": null}}, {"review": {"des": "I went back here to Mother Cluckers today with my buddy and his son after they helped me repair and reinforce my garage door after the recent break in.<br><br>We all ordered a 2 piece chicken dinner which was very tasty and moist along w/2 sides.  I got the2 piece white chicken w/baked beans w/meat & Cole slaw & hush puppies.  The broasted chicken was seasoned well and was nice and moist.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/clV6C4jXBP2R7d0RAfClsg/348s.jpg", "caption": "Mother Cluckers 09/16/18"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/wSX4bpyGeYTdXgTOBqyZbg/168s.jpg", "caption": "2 piece white meat w/beans w/meat, coleslaw & hush puppies"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/lAo6U61DaJqF-1VZk0kjgg/168s.jpg", "caption": "My buddy Tony & his Son Alessandro"}]}}, {"review": {"des": "Excellent chicken and Waffles. The place is a little small but the food is well worth the trip, if you have to wait a little bit for a seat, I suggest you wait.", "pics": null}}, {"review": {"des": "Tiny little place.<br>Hugely popular and tremendous chicken.<br>Chicken fingers and ribs were also very good.<br>Friendly and attentive staff.<br>BYOB.", "pics": null}}, {"review": {"des": "Good place for chicken and sides. The owner is great and stands by his food. It's a good family run restaurant. Will go again", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/UwfV9352frxyult1VvCdMA/348s.jpg", "caption": "Two piece meal. Delicious"}]}}, {"review": {"des": "Not bad. ..not bad at all. Mother Cluckers is very solid. Broasted chicken is consistently crispy, juicy, tender and seasoned. I personally prefer baked mac n' cheese, theirs is the stove top variety like Kraft. Hush puppies, greens and biscuits were okay.  <br><br>Overall the food is middle of the pack, but service has been friendly during my two visits. This isn't crave inducing fried chicken, but probably your best bet for traditional simple fried chicken in the area. Not worth a special trip, but you won't hear complaints if you bring Mother Cluckers home for dinner.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/oeeGV90rNvTu9bPDWm5gFA/348s.jpg", "caption": "Collard Greens"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/yFuN8oVAm7gJDqLK1xKCIA/168s.jpg", "caption": "Mac n' Cheese"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/A-3KS3-rI06nOIPzyK6Wrg/168s.jpg", "caption": "Biscuit & Hush Puppies"}]}}, {"review": {"des": "So. Freaking. Good.<br><br>Hubby and I love fried chicken and he's a picky eater. This one he said goes into the rotation right after we were done eating. We hadn't even left the parking lot yet.<br><br>Portions are huge. We started with the onion strings and it was a brick. The manager dropped it off to our table and later told us it was the equivalent of 2 onions.  Strings were flavorful and the right amount of crispness. Some breading but not too much.  Served with a side of ranch dressing.<br><br>Chicken- we got a two piece meal + one additional piece of chicken with mashed potatoes and mac n cheese. All served with biscuit.  Because the onion strings were so big, we actually had a good amount of leftovers to take home.  The only thing I didn't care for was the biscuit. It was a little dense. Which it was lighter and fluffier.<br><br>For all that plus a drink- we spent $20.  We are definitely coming back again.<br><br>There is a small parking lot in the back. It's a small place but we found a table.  Bathroom is clean. Staff is super friendly!", "pics": null}}, {"review": {"des": "I am dying to go back to Mother Cluckers and try more off their menu!<br><br>The best thing about Mother Cluckers: The guys who work here! Oh my goodness, they are so friendly, so attentive, and go over the top in assisting you. It's the little things like - We didn't order any drinks so they brought us out 2 glasses of water, came to refill the waters, brought all our food out to us, checked up on us. It was beyond great service for a fast casual spot where you order at the register and are left to your own devices. For the friendly dudes alone, I would come back to Mother Cluckers.<br><br>Happy to report their food is pretty darn good, too, though! And incredibly well priced. My friend and I shared the 4 piece Chicken Meal for $9.95 which includes a biscuit, 2 small sides and is a huge amount of food! Seriously. Less than McDonald's and way better quality. Their chicken is broasted which seals in natural juices and is apparently a bit more healthy than the typical fried chicken. It was quite good and they had a variety of BBQ options on the table to pour on it.<br><br>The biscuit that came with the meal was pretty dry so I actually passed on eating it. We ordered fries as a side which were pretty average and Macaroni & Cheese which was good, I enjoyed it but could have had a tad more cheesy flavor to it.<br><br>All in all, enjoyed the whole meal - especially the protein - look forward to coming back and trying more on the menu!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/mpeyL32VF4KMgw2bJtQV_Q/348s.jpg", "caption": "4 piece Chicken meal"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/rh_E_B8Db_Q6IjsP97UWag/168s.jpg", "caption": "4 pc Chicken"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/qRXJd_DoDe2-CqF_nXTjNA/168s.jpg", "caption": "Inside"}]}}, {"review": {"des": "We moved to the neighborhood a few months ago and have done carry out from Mother Cluckers several times. It's pretty good food. Their ribs and fried chicken are my top favorites at this point. Though there's so much more to try! The employees are extremely kind and go out of their way for you. For a quick tasty meal I recommend Mother cluckers!", "pics": null}}, {"review": {"des": "This is the chicken place I never knew that I needed! A friend had posted about a visit to Mother Cluckers a while ago and I saved to my bucket list. I ordered take out since the place looked small online and I didn't want to risk a long wait with a baby and toddler. I ordered the shrimp po boy sandwich - so flavorful and spicy! My wife had the broasted chicken and shrimp dinner combo with Mac and cheese and fries. Everything was amazing and the portions were great for the price. I look forward to my next order from Mother Cluckers!", "pics": null}}, {"review": {"des": "I really like this place. It's hidden. The had really great vibes. Not a place for a big group. The chicken was really good. I also had the collars. They were great. I had the corn on the cob, it's was just ok. Try as different side. Back to the chicken. It was hot a very crispy. Not that expensive. Check out my picks.", "pics": null}}, {"review": {"des": "I decided to stop here for breakfast after I read that they offered chicken and waffles, a of which I have heard much, but never tried. I was grateful for the off-street parking, which can be a bit of a rarity.<br><br>On entry, I was greeted by my server, who was very upbeat and perky for the early hour. She took my drink order and let me look at the menu for a couple of minutes. What I believe to be one of the owners was sitting nearby working on a laptop. When he noticed I was done perusing the menu, he asked me what I wanted, and placed the order for me without delay. Excellent service.<br><br>As far as the food goes, I found the chicken tenders to be nicely battered and piping hot. They were not the most flavorful I've had, but they were fine. The waffle added a nice component to the meal - with a slight sweetness and exterior crunch. The syrup had little flavor, though. It was basically a sugar sauce. Some actual maple syrup would have really helped here, I think. All in all, the dish was a near-miss for me. I'm glad I tried it though.<br><br>I'm really surprised to hear that the owners would be \"rude and disrespectful\" to anyone. They were anything BUT that to me and the other customers during my visit.", "pics": null}}, {"review": {"des": "I love this places title not to mention the great food I love how it makes me able to swear undercover love ir", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/eECre_tkvz_rhqHez03PZg/348s.jpg", "caption": "Mother clucker bois"}]}}, {"review": {"des": "This place is def going on my top list of fried chicken places in the United States. This is a small little restaurant on the corner street and you would not believe how cheap this place is either. I decided to get the 4 piece chicken, and be warned its half a chicken. It's A LOT OF FOOD. This can feed def two people if you also get 4 sides, and its still a cheap date. Anyway, the chicken here is nice and tender with a good crust, its not too thin and not too thick. It's seasoned well and you can eat it with some home made barbecue sauce that they made. There was a small part of the breast that was kind of tough but the rest of the breast was pretty tender, and still holding in its juices. <br><br>The mac and cheese here is cheeesy. I mean CHEEZY. It's smooth and velvety, I didn't expect that. It was one of the best sides here and the beans here are so nice, it has a nice sweetness and savoryness to it. It's cooked with some bacon I believe to give it more flavor. The collard greens here I thought were going to be bitter. But the bitterness immediately went away when you bite it and you get notes of acidity, savoryness, and some spice to it. Food came out so fast, I was taken by surprise. The owner here is really friendly. Family owned restaurant too. I should've ordered some dessert to try it but I was so full, def should just get the 2 piece  next time if i'm eating alone.  A must go to place if you're ever in chicago.", "pics": null}}, {"review": {"des": "I had the combo chicken and rib combo. My boyfriend had the breaded steak.<br>We left feeling 10 pounds heavier despite us both barely finishing half our meals.<br><br>This is genuine southern food. The kind that makes you want to go into a food coma while simultaneously picking another fry off the plate. On top of that, the barbecue sauce is amaaaazing. It's the kind of sauce that you want to dip everything - fries, meats, vegetables. It makes everything taste superb.<br><br>Without a doubt, the breaded steak was pretty bomb. <br><br>To me, fried chicken can be one of two things: dry(bad) or juicy(good)- other than that In honestly can't distinguish fried chicken apart. This one was good, but comparable to any other fried chicken honestly. As for the other elements, I thought the biscuit was too tough and bland and the macaroni to be mediocre.  The ribs (and barbecue sauce) were more of the highlight.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/t4gia24uGJIG4h46cAyOLg/168s.jpg", "caption": "Breaded steak. Yum!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/nQbY5vYZx9VoElUV8dmb3A/168s.jpg", "caption": "Rib and chicken combo"}]}}, {"review": {"des": "If you want amazing breasted chicken, this is where you need to be!!  The chicken is cooked to perfection and seasoned in total balance, it is not overly salty.  The sides are little bowls of heaven.  The mashed potatoes are flavorful, like eating a loaded baked potato but better and the fries are really fresh cut fries.  The biscuits were a tad dense but had a good taste.<br><br>The staff is so friendly and patient while you choose but will suggest options if you are at a loss as to what to order.<br><br>My only knock was that it was pretty chilly in the restaurant, even with my coat on but the great food made me forget it!", "pics": null}}, {"review": {"des": "Very good food, clean. Unfortunately, they didn't like that my 2 year old and 4 year old were playing after dinner ( not running thru the restaurant), but standing by the wall and playing peek a boo. Sooo we got a stern talking to about keeping the kids seated. We had to wait forever for the hubbies to get the cars, so i let the girls play with the butter packets and sugar packets and anything else on the table!!! <br><br>FAMILIES WITH SMALL CHILDREN... BEWARE!!!!!", "pics": null}}, {"review": {"des": "Loving that chicken ,finger licking good,very large chicken breast sandwich and fulfilling", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Xov3fELR0CVYmWMbkpm3sg/348s.jpg", "caption": "Fried chicken sandwich"}]}}, {"review": {"des": "If you ever find yourself so northwest in Chicago you're not sure if you're still in Chicago - or find yourself hankering for fried goodness on a Sunday (or anyday) afternoon - or need to find yourself through the consumption of food you oughta make your way here.<br><br>Smallish spot that feels huge inside like a mother's kitchen. Walked in and was immediately greeted by a gent named Gary who helped us navigate our first time here. I got the Shrimp/Chicken combo with greens and mac, my wife got the Shrimp Po Boy sandwich with a \"small side\" (there was nothing small about that side).<br><br>As of right now the cheese for their cheese fries is now my favorite cheese, usurping my beloved Lucky Dog's off Roosevelt and Austin. Their greens were dead on perfect - some get the flavor right but remain soggy, others get the crunch but lose their savor - yet these collards overcame multiple injuries and droughts of depression to become the undisputed champions of the world.<br><br>Mac was god so friggin good - maybe could've used some crunch to balance that smooth cheese, but who am I to ruin a good thing?<br><br>Chicken was a dark leg and a light breast - both breaded perfectly and I needed a platform to test their BBQ sauces on - both experiments (the spicy and sweet sauce) yielded incredible results. I'd buy their sweet BBQ sauce quarterly if they bottled it. Shrimps were HUGE and this outstanding blend of spice and breading. Came with a spicy cream dip that really made the shrimp shine.<br><br>Gary informed me that the recipes and whole joint was founded by one of the Hatfield's of the great Hatfield & McCoy American history lore. He also swung by out the blue with a deep fried banana, drizzled in caramel and chocolate sauce, a remnant of the brunch they have on weekends  for no goddamn reason other than the beaming light of pure goodness emanating from his soul.<br><br>Contrary to many of the unfamily friendly reviews running around here we came in while multiple familes, with kids 2-12 cycling in and out, seemed to be thoroughly enjoying themselves. Gary even ran out to give a kid the cup they left behind - one they obvious got from Rainforest Cafe or something earlier. Another young man checked in on us just to ask how everything was, we nodded with full mouthed nods that mean \"ecstatic\" but come out verbally as \"great\". Young lady filled up our waters twice, the kind of small gestures that round out an amazing place with an Olympic diving type nuance.<br><br>For the practical - approx 8 parking spaces in the lot with tons of options around, ample seating and a no non-sense menu that offers pick-up. But for the spiritual - a sense that what you're eating has survived a battle half from the force of it's own grit but the other, that some divine hand knew these flavors must live on. Too dramatic? Whoever has buds to taste, let them taste.", "pics": null}}, {"review": {"des": "The food is amazing and the chicken have the best crunch.  I think this is the best fried chicken I ever had.. I usually order takeout and the food has always been ready waiting for me.  The staff are super friendly when picking up also.", "pics": null}}, {"review": {"des": "Another satisfying meal! I went with the broasted chicken again,mash, and coleslaw . ..I really wanted to try something new, but the chicken is so good! Next time I need to try another dish!<br><br> And yet again, the guys that work there were awesome! Thanks for the bread pudding! <br><br>A great break from the outside traffic and just get lost in good food. Now I need to go home and sleep it off", "pics": null}}, {"review": {"des": "Located right on the corner with a small parking lot behind that has an entrance on Foster & Elston.<br><br>-4 piece Fried Chicken : It came with wing, thigh, breast and leg.  Usually I only like the dark meat because white meat tends to be dry for me, but their white meat was so juicy!<br>-Mac & Cheese : Solid side but nothing special<br>-Broasted Potatoes : Giant potato wedges. Only got 2 but they are huge!<br>-Cheddar Jalapeño Corn Muffin : Very good! A little dry, I wish it was a little more moist.<br>-Corn Cobbettes : Just corn on the cob. For some reason we thought it was something else <br>-Hush Puppies : Solid as well<br>-Crab Cake Po Boy Sandwich : Huge sandwich! It was very tasty!  I could definitely not finish by myself!<br>-Bread Pudding : I was super excited by all the good reviews of the bread pudding but I think it was just all hype because I was definitely disappointed.  Not the best bread pudding I've had but it was definitely good homemade bread pudding but next time I think I'll skip it.", "pics": null}}, {"review": {"des": "The food is solid, with lots of different options while staying pretty true to the BBQ roots.<br><br>I also give them props for having a friendly and courteous staff.<br><br>I'm going to make a small complaint, though. I got charged 30 cents for \"dine in\" because I ate my meal there. I realize it's only 30 cents, but what sort of nonsense is that?  I've never heard of such a thing and the whole concept makes me kind of turned off to the place. If you don't mind getting gouged like this (or if they stop this silly policy), it's a quality spot.", "pics": null}}, {"review": {"des": "I knew about this place, but it's a bit out of the way for me to get to. I finally had a chance to try it since I was on my to the suburbs. We ordered and 8 piece broasted chicken with 2 medium sides for carryout. We choose the mac and cheese and collard greens for the sides and we went with the hush puppies over biscuits, per an employee's recommendation. <br><br>The chicken meat was moist, but the crispy skin did not travel well in the box container. I feel like the box should have been a little larger so the crispy skin wouldn't be smashed into the top of the box. This led to the condensation getting absorbed straight into the skin. The 8 piece is pretty much a whole chicken cut up (2 legs, 2 thighs, 2 wings, 2 breasts). The medium sides were a good size. The collard greens were super tender and braised with bits of pork and had a little bit of acidic/sour flavor to it. The mac a cheese was super creamy. Btw, they won't let you do half hush puppies and half biscuits. The hush puppies were a big disappoint. Half of the hush puppies were stale and over cooked. I took my first bite and it was as hard as a rock. It was even harder than a crouton. We all had rock hard hush puppies that night, what a waste. The next day when I was reheating leftovers, I noticed some hush puppies were dark small and some were lighter and larger. So, I was finally able to have a decent one. <br><br>Still kinda salty about half of my hush puppies being rock hard. Throw away the old and over cooked ones, please!", "pics": null}}, {"review": {"des": "There were so many choices here I couldn't choose!! <br>Ryan and I came here for lunch and I got the shrimp po boy with hush puppies on the side.  Ryan got the chicken po boy & it was so good! <br>We also got fried mushrooms for an appetizer.<br>The portions are big, we probably could have just done the appetizer and share a sandwich.<br><br>We will definitely come back here to try other foods! <br>They have a small parking lot in the back & ITS BYOB!", "pics": null}}, {"review": {"des": "My roommates and I went here a couple weeks ago because we are all fans of fried chicken (though honestly, who isn't). The restaurant is small, so definitely go early. It was quickly packed with loud families and children, which didn't bother us since that is what we expect from these kinds of joints. We ordered a big family style amount of chicken as well as some hush puppies and mac n cheese. The chicken itself was very tasty and flavorful, especially with their home sauces. <br><br>The mac n cheese itself, however, was pretty terrible. I'm not picky with my sides, but the mac was bland and had barely any cheese. I honestly think Kraft mac would have been better than what they were serving. Pretty disappointing when a soul food style restaurant can't make a good mac n cheese.<br><br>Food: 3/5 (4/5 for chicken, 1/5 for everything else)<br>Service: 3/5<br>Atmosphere: 3/5<br>Price: 3/5<br><br>Overall, it was fine. I wasn't blown away by anything, and I was certainly disappointed by the sides. If you just want chicken, I would recommend here. The chicken was solid and fairly priced for Chicago. But I wouldn't get much else.", "pics": null}}, {"review": {"des": "After only 1 stop at Mother Cluckers, I am, in full confidence, nominating them for the following 4(!) awards: \"Most Generous Helping, Ever\", \"Nicest Servers\", \"Absolute Fastest Arrival of Food\" and, of course, \"Best Named Restaurant Ever\". And I'm not the type of person to give away my awards freely. My friend and I were looking for a place to eat while our car was getting fixed, and we decided to walk down to Mother Cluckers' for lunch. As you can see from the number of nominations I am comfortable giving to them after just one visit, I was really impressed by the experience. Both servers were really nice to us, the food came super fast and there was seriously a lot of it. I did not expect them to provide a \"dancing bouquet of flavors\" kind of experience, but I was pleasantly surprised by the presence of a certain character in the taste of the food - it wasn't your typical lemon pepper variety. We got there just a few minutes after the opening, rather early, but the place quickly filled up with what looked to be regular customers, which is a clear sign of how well loved the place is.", "pics": null}}, {"review": {"des": "I've had this place bookmarked since it opened but just haven't gone. My husband took our kids there a few months ago and everyone raved about their breakfast so when my mom suggested it on her birthday for brunch, off we went. <br><br>We walked in at 11:45am waited in line for about 15 minutes. By the time we made it to the counter, we were told that breakfast was over. Well. That's a bummer. We wanted breakfast and lunch options. The gentleman behind the counter (who I am pretty confident is the owner) said that biscuits and gravy and chicken and waffles are all day. So we each ordered chicken and waffles and got biscuits and gravy for everyone to share. <br><br>The chicken was very good. Nice and moist and had a good flavor. My waffle was a little dry, however. The flavor was good, the sweetness level was great but just dry. Maybe it was an off day? <br><br>My family said that the last time they were there, they had a waitress that came to their table. But when we walked in it was only counter service. Not sure when that switch was made but it was confusing. <br><br>All in all it was pretty good. I'll go back and give the waffles another shot and hope I just caught them in a bad day. The chicken alone is definitely worth a repeat visit. Prices are nice too, for two pieces of chicken and a waffle it was $9.99. Great value!", "pics": null}}, {"review": {"des": "So glad to have this place near our home...a quick 5min or so drive. Just ordered take out for the second time tonight and looking forward to getting it when the in-laws come to town for a week or so before Thanksgiving.  Very solid chicken...broasted, not fried so those on here comparing it to fried should, um, probably not since it is not the same thing.  Tasty and less fatty than fried.  The biscuits are kind of my least favorite but I'll admit that I am a biscuit snob...love the hushpuppies though and the coleslaw (yes, with green peppers) is GREAT ... very fresh tasting and a good option amid the other sides.  The shrimp po'boy was AMAZING...nice spice to the remoulade too.  Fries are probably better if you eat in but our kids ate them up anyway.  Baked beans do include bacon and are less sweet than some which I appreciated although knowing about the bacon may be helpful for those with nitrate sensitivity.  My son convinced me (wasn't too hard) to add a piece of pecan pie to our order and, well, I may dream about it.  How that other reviewer could think it was not made in-house, I have no idea...it tasted very fresh ... I am a pie snob too but I am going to have to stop myself from sneaking away for an afternoon slice on my work from home days! Buttery comfort.  A very satisfying meal, especially when paired with a fresh Fistmas from our fridge!  Bring on the winter....", "pics": null}}, {"review": {"des": "\"Mmmm, that's a good mother-cluckin' order of waffles and chicken!!!\"  I'm sure it's not the first time that they have heard that one, and I'm sure it won't be the last time.  I can't attest for the waffles and chicken at any other restaurant in Chicago as this was my first time ever indulging in this iconic combination.  However, I enjoyed every last bite of my chicken and waffles - Mother Cluckers Chicken knows how to execute a sweet and salty meal to perfection!  I shoveled every bite into my mouth as if someone was about to come and steal it away from me.  My mouth was so full that I could only give a huge thumbs up to the man who came over to check on me and my satisfaction with the food.  So yeah, I liked it...a lot.<br><br>The waffles and chicken comes with either dark meat, white meat, a combination of those or with chicken tenders.  I chose the latter, but I will admit that it was a hard choice to make.  However - when in doubt, always go with the chicken tenders...you can't go wrong with them.  As I continue to blab my mouth about the chicken and waffles, I have to spare some time to devote to the other part of my meal.  My fiancé and I also split the fairly large bowl of chicken enchilada soup (which I think may have been a special on this particular day), a side of mac n' cheese, beans, jalapeno cornbread muffin and a bread pudding.  The soup was a definite winner, but all the others - not so much.  It seemed to me as if I was eating a bowl of Kraft macaroni and cheese - turn-off #1.  The beans also tasted as if they had just been poured out of a Jewel-bought can - turn-off #2.  And finally, the bread pudding was cold and kind of bland in comparison to a lot of bread pudding I have had - turn-off #3.<br><br>I was going to ask to have the bread pudding warmed up more, but they started to get very busy and I couldn't find our server to ask.  The tables aren't really assigned a server, but they do come check on you throughout your meal.  Just to cover some logistics - you walk in, place your order at the counter and then take a seat...they will then bring your food to the table and all you have to do is sit there, enjoy the music and let your eyes wander around the decorations on the walls.  It is a small, but cozy little restaurant - perfect for hiding out from the hustle and bustle of Chicago.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/pjZzITchanxRpjd7-tAUOw/348s.jpg", "caption": "Bread pudding"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/EuNiV-odhPJsIpwcswAbEA/168s.jpg", "caption": "Chicken (tenders) and waffle"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/2sMDDyp1FanHcBS-EVuhEg/168s.jpg", "caption": "The sides including: Mac n cheese, beans and jalapeno cornbread muffin"}]}}, {"review": {"des": "Mother Cluckers is mutha effing good. I've stopped in here on my way home and the fried chicken is pretty legit. Crispy & juicy, which is how all chicken should be. The collard greens and mashed potatoes are also solid. Aaaaand they have hush puppies, people! <br><br>The staff was very friendly as well. There is a small patio and parking lot which is nice when I just want to do a quick stop on the way home from work. Lastly, MCK is very reasonably priced for the amount of food you get. Who doesn't love a good deal?<br><br>I want to try give the poboy a whirl as well as breakfast. From the looks of it, seems they have a milk gravy which looks pretty promising. Milk gravy is life, y'all.", "pics": null}}, {"review": {"des": "I finally tried Mother Cluckers Chicken Yesterday. What took me so long? It was the best Chicken  ever! So juicy and moist. Crispy on the outside, tender and an excellent flavor throughout. Also a very fair price and very friendly and attentive staff. I am dying to try the bread pudding but was so stuffed after the 2 piece dinner that came with a biscuit and 2 sides. I had the collard greens and Mac and Cheese. Can't wait to bring my Boyfriend Marv he loves broasted Chicken.", "pics": null}}, {"review": {"des": "Mother's Clucker's chicken is something that I would definitely come back for.  It's broasted - not fully fried, but you would have no idea.  It's pressure cooked and it retains all the juices and the crispiness. <br><br>My husband and I split a 4 piece - white meat only - meal w/ hush puppies, broasted potatoes, and cole slaw.  The sides are nothing to write home about, but the chicken is really good.    Deliciously cooked and a good portion size.<br><br>The staff is really nice and friendly too.  We had a toddler with us, and they let the mother roam about the place with him walking around to keep him from yelling (didn't help, however!).  <br><br>They have parking for about 10 cars in a lot, but there is plenty of parking in the area, and while the place isn't large inside, there were plenty of tables.<br><br>If I was in the area - or if I wanted some tasty chicken, I would recommend you stop in at Mother Clucker's.  The name itself makes you want to go, right?", "pics": null}}, {"review": {"des": "Ok, food here is delicious!!! No joke! Such moist and tasty fried chicken, you will never find anywhere else. Also the kids chicken fingers, has a different batter thats is thinner but still crispy. My daughter usually eats just one chicken finger (from other places) because its always heavily drenched in batter and dry. This time, she ate all 3 without us nagging her to eat. This place is kid approved!!! <br>We also had the chicken and waffle. The waffle isn't the crispy type, its more soft (not moist) and has cinnamon so its almost like a doughnut. I thought it was delish! <br>~~My only reason for the missing star is that they forgot a side. We were really looking for the mac&cheese on this gloomy Sunday, but it just wasn't there :( (FYI, we got takeout) ~~", "pics": null}}, {"review": {"des": "Don't often come to this area of the city for food but glad I came here tonight. Everything we had was great.", "pics": null}}, {"review": {"des": "My husband loves the chicken here- I love the hush puppies.  The help is always pleasant and I Ilike the cozyness of the restaurant.  Highly reccommended.", "pics": null}}, {"review": {"des": "Small and unassuming, the chicken was very good and the sides (cole slaw and baked beans) were impressive. Large portions mean I will be back.", "pics": null}}, {"review": {"des": "I enjoyed the barbecue pulled pork and it was awesome! I loved the fried onions on top and the portion was big. I also got to try the hush puppies and jalapeño corn bread muffin which was amazing!! Highly recommend that one. I will be back!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/YHRDfcyQDZ4hxFk74IS4tg/168s.jpg", "caption": "Entrance"}]}}, {"review": {"des": "MotherClucker! This place is good! From the genuine service to the creamy mac n cheese, this can explain why the chicken crossed the road.<br><br>Food:<br>BF took me here because I wanted some place casual, close, and delicious (with parking). We entered and sat ourselves. I must note that this place is BYOB and they were so sweet to bring me a wine glass for my libation. <br><br>We ordered the po-boy and the chicken salad as well as sides of mac n cheese and corn cobettes! The chicken (in my salad) was tender and delicious. It wasn't overly salted or seasoned. It was simply yummy chicken. I loved the mac n cheese because it's done in such a creamy, cheesey way. I'm a huge fan of corn on the cob and the corn cobettes were fresh and crispy. I tried the po-boy but wasn't a huge fan as I didn't like the sauce but next time I definitely want to try the actual chicken. <br><br>They also have their own BBQ sauces. I tried the sweet one and it was legit. <br><br>Service:<br>So fast and genuine. The servers checked on us, didn't hover and were polite and fast! <br><br>Plenty of parking. Just beware that it's a weird intersection (turning into the parking lot).", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/0A5alsL-XjndygdwuwNasA/348s.jpg", "caption": "Soo yummy and fantastic service!!"}]}}, {"review": {"des": "I may have found my new favorite restaurant! The place is small but cozy with a Modern Texan decor. Staff was SUPER friendly and helpful. Food was hot and fast. I ordered the Broached Chicken and Shrimp plate with Mac n cheese and coleslaw and hushpuppies. The chicken was probably the best boasted I've ever eaten. fresh and very very moist. It did not even need either of their delicious BBQ sauces. The shrimp were huge and lightly breaded with a spicy kick. I'd put them up against any seafood house. The mac n cheese was very creamy but the coleslaw was on another level...creamy slaw but NOT sweet...it was amazing. Hush puppies were on the money also.<br>I DEFINITELY will be coming back again soon.", "pics": null}}, {"review": {"des": "Must be a great place if you don't have kids. My family and I arrived there 25 minutes before closing. Two gentlemen looked at my kids and tried to quietly talk to each other. Essentially, they thought the kids would take too long to eat. Take out only! <br>Reminds me of the one Seinfeld episode with the soup guy...<br>They must have so much business they don't hesitate to turn business away.<br>Single, non-breeders, this might be the place for you. <br>If you procreate, you might want to hesitate...before you visit.", "pics": null}}, {"review": {"des": "Whenever someone suggests Mother Cluckers, we usually end up going. The food is always delicious and everyone is super friendly!<br><br>The chicken is fantastic, and I love their greens. The fries and mashed potatoes are also very good. I don't care too much for their mac and cheese, but I have friends who enjoy it.<br><br>Highly recommend visiting Mother Cluckers if you like fried chicken! Yes, it is broasted, but has the taste and feel of fried chicken.", "pics": null}}, {"review": {"des": "I've come here twice now on a Sunday, once for breakfast and once for lunch.  <br>Breakfast is sit down, and they come by and give you a menu.  <br>Lunch/dinner is counter-style where you order at the counter and they bring out the food to you.<br>Both breakfast and lunch are delicious and you definitely need to come here.<br><br>Food is delicious, this last time I tried their crab cake poboy with a side of mac and cheese.  The poboy came topped with three pretty decent sized crab cakes for a sandwich.  The crab cakes themselves were crabby and topped with lettuce, tomato, and a spicy sauce.  Everything complemented perfectly.  The mac and cheese was also really good, a nice thick cheese sauce with a little bit of extra flavor (kinda like buffalo sauce-y?).  A great value.<br><br>I definitely want to come back to try the broiled chicken!<br><br>Service was great, the staff is so friendly and checked in on us throughout our short meal there, refilling drinks regularly.  There is also a convenient small parking lot right behind the restaurant!  Definitely recommend this place for a meal!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/aT_NAFUWTNhvEWE5OzAmFg/348s.jpg", "caption": "Crab cake Po Boy with Mac and cheese"}]}}, {"review": {"des": "We've been back a couple times to dine in, and ordered carry out a couple more times, since my original review.<br><br>Each time we are greeted like special guests, and they seem to do that with everyone. It's always nice to feel so welcome!<br><br>I've had the smothered chicken twice now, and it's superb. The gravy is thick and flavorful, and the breading on the chicken is crispy and delicious.<br><br>This will continue to be one of our occasional go-to places.", "pics": null}}, {"review": {"des": "Probably one of the best chicken places I have ever been. The service was amazing and we debated how come the friend chicken had such less oil in it. We later learned it's because the chicken is baked. It tasted better than fried. The serving size was plentiful and $23 bought us more of better food than it would have at KFC, Popeyes, or a chain. Only thing they can improve on was the hush puppies. Those weren't as fresh as we would have liked. <br><br>Overall, will definitely come again!", "pics": null}}, {"review": {"des": "Must come back to try it all. Breakfast did not disappoint. Looking forward to the hush puppies and bread pudding.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/-AUycm29rEFZikzFl67kVw/348s.jpg", "caption": "Amazingly delicious chicken atop a perfectly spiced waffle."}]}}, {"review": {"des": "This was my first time coming here and I am impressed. The food is inexpensive and really tasty. Great alternative from fast food places like Popeyes. Finally! REAL mashed potatoes! Not the bag stuff! The hush puppies were good and everything looked and smelled good. Nelly was so sweet and is great in customer service skills. It was a little cold and Nelly was kind enough to turn up the heat. With that said the food, location, and atmosphere is FIREEEEEEEEE! I've never had a place that has <br>GREAT FOOD<br>GREAT VIBES<br>CLEAN ESTABLISHMENT <br>AND GREAT CUSTOMER SERVICE <br><br>Thanks Nelly! You made our first visit even MORE AWESOME!", "pics": null}}, {"review": {"des": "This isn't a fine dining restaurant, and thank goodness for that! Here's what you get for $15: 2 pieces of delicious broasted fried chicken, 4 BIG, sweet delicious fried shrimp (not your prepackaged nonsense), two sides and either a biscuit or hush puppies. Two of us enjoyed the Mac n Cheese, collards (sooooo gooooood), broasted potatoes (gigantic potato wedges) and coleslaw (bright and full of veggies). Staff are very friendly, and I enjoyed the music (think Nirvana, Pearl Jam). Also, it is BYOB, so bring a couple beers or a bottle of wine and enjoy! Too full to try the desserts, but they looked tasty.", "pics": null}}, {"review": {"des": "Ok, but nothing special. Had the tenders wrap; lot of food but just OK. Won't make special effort to return.", "pics": null}}, {"review": {"des": "Ever searching for a true five star experience we set out on a Saturday afternoon  from Chicago's lakefront, more to escape the throngs of visiting Lollapalooza fans in our front yard, yet with the eager anticipation of finally finding a restaurant that matched the dazzle and hype bestowed by their customers known as the\"regulars.\"<br>At last the guru of the concrete jungle announced, \"you have arrived at your destination,\" and OMG free off street parking. With guarded expectations now bolstered by such a surprise we find the unassuming entrance and find ourselves inside a small triangular dinning area that opens up to a counter and kitchen where several voices welcomed strangers as though they were expecting lifelong family friends. With the hobble and cane of a life well lived, we approached the counter to order and caught the deft eye of the young man behind the counter,  who then offered to take our order table side.  We order our meal and relax to watch as others were greeted with the same familial enthusiasm.    <br><br>Our appetizer and meal left us with no room for the offered sweet punctuation to an experience reminiscent of a southern grandmother's Sunday table.  We offer to you the hope that you too experience the pleasure of a great meal with the joy of finding true hospitality born of hard work and become what we will soon be, a \"regular.\"", "pics": null}}, {"review": {"des": "The broasted chicken is so damn good, friendly and helpful staff. Nice clean place. This is the type of place hipsters would be buzzing about if it was in Wicker/Logan/Lincoln Park", "pics": null}}, {"review": {"des": "Had my first visit to Mother Cluckers and it was outstanding.  Got a half slab of ribs had Mac and Cheese and French fries for the sides and a side order of Hush Puppies.   <br><br>Let me tell you right now the Ribs are Magnificent.  They are HUGE and fall off the bone tender.  This is my new go to place for Ribs, even going to put them in front of Gayle Street.  They steam them in apple cider vinegar first then grill them.  The ribs were so big that I could only eat half of the half slab of ribs..   Very generous with the fries too.  Huge pile of hand cut fries.  Mac and cheese side bowl was a bit smaller, but it was tasty, and Do not leave this place with trying the hush puppies.  They were great, they are also very big so 6 was perfect for me.   <br><br>Very good prices to.  Not many places you go to and get a half slab of ribs, two sides, and side order of hush puppies for around 15 total.", "pics": null}}, {"review": {"des": "I really like coming here.  The atmosphere is casually great, the staff are nice,  and I love their food.  The poboy is bomb.", "pics": null}}, {"review": {"des": "Im in the restaurant business and always see the owner and The Mother Cluckers truck at restaurant at Restaurant Depot. Loved the name and said one day ill check it out <br><br>Well, felt like eating bad today so we went to Mother Cluckers and it was a good move. This place is on point with flavor, portion and pricing.<br><br>Broasted Chicken was excellent. Juicy, with flavor but not salty. Crispy. Loved that their was tons of breading <br><br>Best Baked Beans ive ever had. They do them with a twist here and its money. Your standard 2 beans, molasses, brown sugar, bacon but with green and red bell pepper and tomato. Was amazing.<br><br>Fried Chicken Sandwich was bigger than my head. Great handcut fries.<br><br>Manager behind counter checked on us mutiple times and provided hospitable service.<br><br>Well run operation. Huge portions. Good price points un this day and age where labor and wholesale good costs are skyrocketing.<br><br>We ll be back. Soon. Wanna try the Pulled Pork.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/IXDykWcByRm38RBFRftuTA/348s.jpg", "caption": "Amazing"}]}}, {"review": {"des": "I've been wanting to go to this place forever. I never had broasted chicken before. Supposedly it's healthier chicken with half the fat. There's some whole different process that you can probably look up, but I couldn't tell the difference between broasted and fried chicken. Just as tasty, juicy, and the skin has a nice crisp!<br><br>Service was extremely good! It's a casual place, where you order at the front where the cashier is. They have broasted chicken, of course, many types of sammiches (po boys were recommended), ribs, and plenty of choices for sides. Ended up ordering the 8 Piece Chicken, which included 2 medium sides & 4 Biscuit or Hush Puppies. The corn cobbettes were tasty as well as the mashed potatoes. Both were huge portions.<br><br>Plenty of parking at the rear and overall, a decent spot.<br><br>BATHROOM REVIEW: Located on the right-side (facing the cashier) of the restaurant, the bathroom is a single-person small stall. Although it says a key is needed, just knock and walk right in. Inside, somewhat small, but otherwise, everything was functional and working. A little too small for my taste, but it got the job done. Sit or squat? Squat.", "pics": null}}, {"review": {"des": "Driving through this part of Foster has been a routine route for hubby.  About two (2) plus years ago, the sign of \"Mother Cluckers Kitchen\" was up.  Hubby commented, \"I dislike this name, for it rhymes with that infamous \"f\" word.\"  <br><br>Well, I suggested him to get over with this because the food here we had this afternoon was freakin' great!  The owner was super nice.  As soon as he realized that we were the first-timers, he immediately provided us a couple of menus and guided us to the \"daily specials\" on the chalk/dry erase boards.  This is a casual, short-order, kind of restaurant serving all-American comfort food, but bring some cash with you because you can't add a tip on any credit card transaction.  <br><br>The food came out rather fast.  We had the 2-pieces dark chicken and fried cornmeal-battered catfish dinners.  Each dinner comes with two (2) sides.  The catfish was done impeccably, flaky on the outside while the meat remaining juicy and tender.  The sauce that came with it was spicy, but the level was comfortable and I liked it a lot.  The mashed potatoes, Mac & cheese, and collard greens were solid.  <br><br>What really impressed hubby and I was the service.  The owner refilled hubby's Mountain Dew without having us to ask for, another lady came over to check on us and brought out more sauce for my catfish, and they remembered the name of each customer who was dining in.  I just wish we had more cash on us so we could tip more generously. <br><br>The music selection was also on-point: a mix of country rock, jazz, and oldies.  Hubby \"shazamed\" a few songs.  <br><br>There's also a free customer parking onsite.  From now on, you will hear Rosa J.'s footsteps, \"clicking, clicking,\" as she marches toward this bad-a*s corner restaurant.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/2qCrkkI9m93TD4EjCqpMYA/168s.jpg", "caption": "Catfish dinner"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/kTD9782fiJQkOryKND2QZA/168s.jpg", "caption": "2 piece chicken dinner"}]}}, {"review": {"des": "If I could give this place a 10, I would! Amazing food, outstanding friendly service! And byob! We've had several items from their menu and it's all delicious! The chicken is tender and juice. Amazing baked beans (made with several kinds of beans and ham hock!), coleslaw is fresh homemade and delicious, jalapeño cornbread is just right, husband can't get enough of the crab cakes, I LOVE their pulled pork quesadilla. Try the hush puppies too, so good! Their bread pudding is heaven! Husband and I are slowly making our way thru the menu, lol.<br><br>By far, one our favorite restaurants in Chicago! Can't get enough of this place.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/sw7XSLFhg3RPTuVOJ-wTdA/168s.jpg", "caption": "Crab cake dinner with baked beans, and mac..so good!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/c3q5gsw7pPjEEm_KfSs7Aw/168s.jpg", "caption": "Chicken dinner with mac and slaw, all finger licking good"}]}}, {"review": {"des": "BBQ BBQ BBQ I had the combo chicken and rib plate. This place has ribs that melt off the bone and the broiled chicken is tender and juicy. My order came with several sides (corn cobblet which was very juicy, cole slaw that was ok and hush puppies which were dry and crunchy). I also ordered a cheddar jalapeño cheese muffin and it was kind of dry too. The cost for all that and a drink was a little over $25 (making me reconsider having sushi). In short the meats were on point but the breads were on the dry side hence the reason for 4 and not 5 stars.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/h7p5rqPuAOTAHjGLMU1R2w/348s.jpg", "caption": "Chicken and rib combo & drink = $24"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/rsNYPpf8v-BUCQyKOmKUUg/168s.jpg", "caption": "Menu"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/OBqmfddHL4ZC7NaF0lIyQA/168s.jpg", "caption": "Menu"}]}}, {"review": {"des": "Mother Cluckers is hands down one of the best names for a restaurant. For all you dumb mothercluckers out there that haven't been here, you guys are missing out. <br><br>Pros:<br><br>- The hospitality is amazing. They make you feel comfortable and has been a while since I've been to a restaurant that's genuinely cares for its customers.<br><br>- Fried chicken is a must when coming here. I tried it for the first time on a Thursday night. That chicken was so good I ended going back on Friday after work. <br><br>- On the outside it looks small but is pretty spacious inside.<br><br>- The bread pudding is served warm. Damn good.<br><br>Cons:<br><br>- I may not be a biscuit connoisseur but that thing was pretty hard<br><br>Other than that this place deserves to be visited over and over b/c the food is consistently good.", "pics": null}}, {"review": {"des": "Great place!! Chicken is fantastic and service is excellent! I highly recommend it! Beans and mashed potatoes are really good too! Jalapeno cornbread is really good! One of the best places in the area.", "pics": null}}, {"review": {"des": "Saturday afternoon, food went slightly downhill. Broasted potatoes had no flavor or crunch. Mac cheese was still delicious, same can be said of biscuit. The broasted chicken was too oily, breading on chicken lacked flavor. The chicken flavor of meat was good, but their was a gaminess to the skin once you got past the breading. The skin of the chicken was a tad rubbery. I had white meat only.<br><br>Hesitant to come back as the chicken is now extremely average, where my last visit it was one of the best. Disappointing.", "pics": null}}, {"review": {"des": "It's too bad it's a hassle to get here, otherwise I'd be a fat Mother Klucker all the time. Was seriously having a hard time finding good fried chicken in Chicago; too many places fall into the various pitfalls of soft skin, dry meat, or being just plain overpriced. But not Mother Klucker's, which hits it on the nail with good ol' chicken. Broasted or whatever you call it, they do it right. And on top of that, they actually have a host of other southern accompaniments and specialties as well, which all hit the mark. Can't tell you how satisfying and filling a 4-piece chicken meal with hushpuppies, baked beans and collard greens is; and for $10 it's great value for the amount of food. Their Po'boys are great as well. It's not the largest place, but people are nice, service is fast, and food is fresh, delicious, and affordable.", "pics": null}}, {"review": {"des": "My wife and I were having trouble deciding on a new place to try but luckily found this place after searching for 15 minutes online.  I gotta say - What a great pick!  <br><br>When you go in the atmosphere and decor is very cozy and friendly. Being a first time customer - I asked the cashier what he recommended and he suggested the Shrimp Po Boy and Chicken Parmesan sandwich.  So happy We tried it as both were unbelievably delicious!<br><br>After finishing our meal - We saw a customer who had the broasted chicken so I had to ask him if he recommended it.  He raved at how good it was so we had to try it.  I Ordered it to go but ended up eating it all at the restaurant as it was too good to stop.  The chicken was so flavorful and juicy. I've never tried broasted chicken before (pressure fryer with less oil) but now I'm the biggest fan!<br><br>We were finally ready to leave but the same customer recommended the bread pudding. Based on his previous recommendation we had to try it before we left.  (They told us it was an old family recipe 150 years old).  Tried it and WOW - soooo moist and flavorful.  I usually don't have a sweet tooth but I couldn't stop eating this!  <br><br>Along with the excellent food - the service was fantastic. At first we assumed just a regular \"order at the cashier and wait until they call my name\" type of establishment.  Not even close.  The workers were always coming by making sure we were doing okay, clearing the plates, refilling the drinks, etc.  We ended up meeting the owner Tim and ended up chatting with him a bit.  He was a real down to earth great guy.  He is clearly a reflection of why this place is such a welcoming and wonderful establishment.  <br><br>I highly recommend this place.  Try it and you will not be disappointed.  I will definitely be back as there are so many other things I want to try (especially  the ribs!)", "pics": null}}, {"review": {"des": "Great food , great atmosphere, nola is here.<br>Will come back for more very soon<br>The poyboy was amizing", "pics": null}}, {"review": {"des": "DO NOT COME HERE! (Response to Richard below) The owners are completely rude and disrespectful. My gf ordered 2 sandwiches for us and when she got home noticed one was burnt so she called the restaurant because she couldn't eat the burnt bread. When she called she spoke to one of the owners \"Penny\" who didn't like someone complaining so she got an attitude so she set the phone down and said to someone in the background that \"this lady is complaining\" once she got back on the phone she said in a condescending tone, \"So what do you want? A free sandwich\". My girlfriend was a little taken back and asked for a refund to which Penny said ok and the refund would be waiting in an envelope at the front.<br><br>Yesterday before we went and picked it up, she called just to confirm so we wouldn't run into issues when we got there. The manager answered (Penny's son) and told my gf, \"Penny is my mom and my dad is the owner Richard. He said not to give you your money back and to tell you that you're not welcome back here anymore. You probably ate the sandwich didn't you\" (she actually didn't though which is the funny part. She threw it in the garbage and ordered tacos from down the street). He then said he's too busy to talk and hung up on her.<br><br>I know there's a lot of people out there that complain and post bad yelp reviews to get free food but it's truthfully not what we were doing. We loved their food and would regularly eat there but after literally every member of that family disrespected my gf, I cannot continue to give them our business.<br><br>Side note: They commented on my gf's review (presumably being rude more) but quickly deleted it before we saw what it said.", "pics": null}}, {"review": {"des": "Very tasty, crunchy and the price very affordable considering the quality and quantity of the food. You will not go wrong with their broasted chicken. Very tender and juicy. Love their hush puppies. Their gravy is the best also... so everything's I've tried is sooooo good!!!!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/1sRB0e1HKYxity9q5uiKaQ/168s.jpg", "caption": "4pc chicken yummmm!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Kam0OFKOUU_FSVN7BitOoA/168s.jpg", "caption": "Asian wrap"}]}}, {"review": {"des": "Just got back.  Food was delicious!  Chicken was moist and not greasy.  Breaded mushrooms were the best we have ever had.  The sides were fresh and yummy.  We will definitely go back and soon. Excellent service.", "pics": null}}, {"review": {"des": "Omg this place is so GOOD. I will be back. I said I didn't like bread pudding so the owner gave us a sample omg so good...great food", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/RVAOT9YcV8wG-fm_6bIRNQ/168s.jpg", "caption": "Chicken , collard greens,mac,n cheese hush puppies"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/2IJ4lkIiv2R2B9CVC3_H7A/168s.jpg", "caption": "Empty plate from the bread pudding"}]}}, {"review": {"des": "Cannot not believe the service I just got 20mins ago from this place. I come in here ALL THE TIME. This time, didn't check the bag bc Everhthing has always been fine, get home and my sandwich is completely burnt and my bfs pulled pork sandwich has NO SAUCE OR BBQ what so ever. Called and explained what happened and PENNY goes \"well what do u want us to do\". She put down the phone and told someone in the background \"this lady is complaining\". I'm like REALLY? I told her I want a refund and she told me \"I'll give you your money back... it'll be in an envelope with your name on.. best I can do\". A simply sorry would have been on wit <br><br>Update: Called before arriving to pick up my refund and I was told by the MANAGER that the owner and Penny (which are his mother and father) told me not to give you any cash, so I won't have any money for you. And you're not welcome here anymore so I don't know what to tell you. I was seriously STUNNED all I could do was hold the phone and say what... then he goes I'm pretty busy so I gotta go bye. I have NO WORDS! I've never been treated this way and this place is family owned?? DO NOT GO HERE", "pics": null}}, {"review": {"des": "Eat here. <br>Now. <br>Delicious. Authentic. Family crowd pleaser. <br>I like the spicy remoulade but it's not for everyone. <br>And the servers and staff are super nice!", "pics": null}}, {"review": {"des": "I grew up in the neighborhood since middle school and always complained about there's no good food joints around here. Came back to the hood recently and seen this was newly added. <br><br>Music was oldies/soul/ and Stevie Wonder... Big A+ for ambience  p.s. hella friendly staff.<br><br>Ordered: <br>4 piece *** <br>Mac n cheese<br>Baked beans **** I'm Mexican and I love beans... these beans were definitely southern influence and were great. Gimmie more<br>Hush puppies **** seasoning was great!<br><br>Couldn't finish all four pieces and that's not a complaint about the serving size. <br><br>Stop by grab grub you'll enjoy it.", "pics": null}}, {"review": {"des": "I've been coming to MCK for years now and they never disappoint. Great service, amazing BBQ, even better fried chicken and fantastic service that makes you feel valued. <br><br>I normally keep it simple and go for a BBQ plate entree. Tonight I order take out and did 2 sandwiches. Holy sheet! The fried chicken sandwich could feed 2-3 people. If that wasn't good enough, my mouth dropped when I tasted the shrimp po boy. It's by far my newest and most favorite item on the menu and one of the best po boys I've had in Chicago. Four huge shrimp with a sauce that you'll remember forever. This place gets better and better each time. <br><br>Don't miss out on the fried chicken and shrimp po boy. Highly recommended. And practically everything else on the menu.", "pics": null}}, {"review": {"des": "3 stars... nothing really stood out. Food was good, customer service was okay (indifferent). Food was slightly over priced in my opinion. I would honestly prefer Popeyes fried chicken.", "pics": null}}, {"review": {"des": "Had the chicken and waffles...omg...so good. And huge. Staff was super chill, super friendly and even comped us a free bread pudding to try (it was amazing). And don't even get me started on their homemade buffalo sauce and honey mustard. Best broasted chicken in Chicago.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/d-yC_UAkxy_Tci7KnEywQQ/168s.jpg", "caption": "Bread pudding"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/3evVwTAlnkA9E50IZuyyDA/168s.jpg", "caption": "Chicken & waffles"}]}}, {"review": {"des": "Walk up to the counter, place your order, find a table and you'll have you food in minutes. My wife and I ordered the exact same thing; an order of hush puppies and their fish tacos. I recently returned with a friend and ordered the crab cake poboy, the crab tastes fresh and the poboy toppings were delicious. My friend ordered the fried chicken sandwich and we were amazed by how big the fried chicken was, of course I ordered hush puppies again and they did not disappoint. For dessert I decided to get the bread pudding per the recommendation of Gentleman at the counter... it wasn't wonderful. I've had much better bread pudding, but everything else here is so good that they hold on to their 5 stars in my book.", "pics": null}}, {"review": {"des": "Decided to give this place a try and boy was i impressed. Their chicken and waffles are so good.", "pics": null}}, {"review": {"des": "Used them to cater my daughters Disney Princess themed party! We wanted to do a Cajun/Southern theme for Princess Tiana! The food was amazing and there was so much of it. The service was outstanding and they were so sweet and great at communication. Thank you so much for being so amazing!!", "pics": null}}, {"review": {"des": "The fact that Louisiana hot sauce is on every table in this place certifies it as legit to me!", "pics": null}}, {"review": {"des": "Update: BEWARE! If you provide a bad review the owner will ask you to not return and will blame you.<br><br>Also, it's you're (as in you are) not your. <br><br>So today I went to have lunch at Mother Cluckers. The woman who helped us (blond short hair) wasn't overly friendly, which I can get over. However, I ordered a grilled chicken sandwich and I could barely bite it. The chicken was incredibly tough. I took 3 bites and just ate the fries. When she came to ask if I needed a box I explained that I couldn't eat it because the chicken was so tough. She responded with \"oh\" and dropped off the check. When I said \"so, I only took 3 bites\" she cut me off and said \"I'll just take it off!\" I responded with \"I'm happy to pay for the fries\" which she ignored. This is not customer service and in the restaurant industry good service is very important.<br><br>The other staff was very friendly and the restaurant is very cute and other chicken I've gotten there in the past has been great!!", "pics": null}}, {"review": {"des": "This place is really good. Good food, clean, well run. We didn't have much time so we asked owner what would be quick. He suggested broasted chicken. Good chicken hot crispy, not over cooked. Sides were nice. Service good. Great value for the $$. We will be back. Maybe next Saturday.", "pics": null}}, {"review": {"des": "We were in the area and decided to try this highly rated restaurant. My hopes were also high. Unfortunately, the menu is VERY uneven. The claim is great Southern food but they don't deliver on that AT ALL. Also, NONE of this is particularly healthy for you, so be ready to invest ALL of your day's calories.<br><br>We tried the following...<br>CONS (I would NEVER ReOrder any of this):<br>\"Broasted\" Chicken - NOT GOOD. Not Southern. Not flavorful. Sad looking. I would never order Fried Chicken here. We barely touched it.<br>Pork Ribs - TERRIBLE. Too much fat. Not flavorful.  We barely touched them.<br>Macaroni & Cheese - ABSOLUTELY TERRIBLE. Not seasoned at all. Not Southern. This felt like it came out of a Generic Boxed Version of \"Mac & Cheese\". Sent it back.<br>Collard Greens - The MOST TASTELESS Greens I've ever had in my entire life. Not even the best Hot Sauce (Louisiana! They offer it. It's the BEST!) could help these. Sent it back.<br><br>PROS<br>Shrimp Po' Boy - A bit on the salty side, but ABSOLUTELY DELICIOUS!<br>Hush Puppies - Same batter. A bit salty, but AMAZING! We ordered an additional serving because they were so good!<br>Baked Beans - Delicious. Not sure of the mystery meat inside, but they had a nice flavor.<br>Fries - Tasty. Hot and fresh out of the fryer!<br>Pecan Pie - Nice taste, but the portion size was too small for the price. I sense this was NOT freshly baked on-site.<br><br>AMBIENCE <br>Extra basic and could have been cleaner.<br><br>OVERALL <br>Though some things were VERY good, I don't see myself going out of my way to return here. However, if I'm ever in the area again... I would try the Catfish. They seem to do DEEP FRIED very well.", "pics": null}}, {"review": {"des": "The hubby and I stopped in for a quick dinner. As always the service was excellent. Really makes you want to continue to support a local business!<br>The food was fantastic. I got the shrimp po boy which had a little spicy kick and the mashed potatoes, which had a nice hint of Parmesan cheese. My hubby got roasted chicken and ribs and he said the rib meat was very tender and fell off the bone. Highly recommend this place! We will be back!", "pics": null}}, {"review": {"des": "First time coming here and it was phenomenal. The chicken finger wrap was delicious!! This is some seriously good chicken. They had plenty of in-house made sauces that were all excellent. <br><br>The customer service was outstanding! We ate at one of their outdoor tables and the staff brought our food out fast and made sure we had everything we needed. They even brought out a water bowl for our dog! (Dogs rule)<br><br>BYOB is a great touch. Menu is extremely reasonably priced and the portion size is more than adequate.<br><br>10/10 would recommend", "pics": null}}, {"review": {"des": "Great place. Kick ass portobello sandwich & tasty hush puppies. What really makes this place is how friendly & cool everyone is. I've driven right by this place many times over the years. Don't make the same mistake.", "pics": null}}, {"review": {"des": "Mother Cluckers Kitchen was awesome!!! My wife, kids & myself tried MCK for the first time & the food was really good but the service was even better!!! Thank you guys again", "pics": null}}, {"review": {"des": "I just went to Mother Cluckers for dinner and what can I say but excellent. Their food, Service and prices are very good. I don't live too far and I enjoy walking over to this restaurant. Mother Cluckers is possibly one of my favorite chicken restaurants in Chicago.", "pics": null}}, {"review": {"des": "My boyfriend and I came here because we thought the name was funny and also because of all the good reviews on Yelp :) It was a little out of our way when we went to Chicago, but wow, I'm glad we came here! This place is GOOD. Definitely a spot that I will come back to if I'm ever in the city again. The service is really friendly, it feels really home-y. <br><br>I got the Shrimp Po Boy and WOW, the flavor on that is absolutely so spot on. The shrimp is so good, big, and juicy. Whatever the sauce on it is amazing and the bun it comes in is good! My boyfriend got the fried chicken sandwich and that thing is HUGE. I did not expect it to be so big, but it was good as well. I prefer the shrimp po boy but both are good. It just depends on what you're in the mood for.", "pics": null}}, {"review": {"des": "Went in simply because the name got my attention as I drove by.  I was in town visiting for a food show and ordered the chicken and ribs combo.  By far the best food I've had in Chicago since I landed a week ago.  Everything is made from scratch and from their own special family recipes.<br><br>To end my feast, I had their delicious bread pudding.  You have to get it.<br><br>Thank you Tim for the delicious food!  I hope one day I'll see your restaurant on the West Coast!<br><br>Cheers.", "pics": null}}, {"review": {"des": "Tasty chicken but the sides were miniscule.  Parking is limited.", "pics": null}}, {"review": {"des": "Great customer service location is very clean... food is fresh and homemade. the shrimp has a kick to it. The chicken parmesan is huge!!! And the sides are great!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/joZMuKt7gi1S2ofi3lrGXQ/168s.jpg", "caption": "Chicken parm is HUUUGE!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ICMf0ihJRavBq0am4Fp37g/168s.jpg", "caption": "Shrimp has a kick, definitely southern sesoning!"}]}}, {"review": {"des": "Danggg motha clucka!  Found this place randomly driving by and I'm so glad I did.  This is a family owned restaurant that's clean, plays great music, has courteous service, and of course the real reason why anybody cares: the food is so good!  <br><br>Had their shrimp po boy sandwich / it's hard for me to compare it to anything else because this is the first time I've had a shrimp po boy - but everything about it just looked and tasted like a lot of care and details were put into it.  Their baked beans have a bit of kick in it so if you're into spicy, perfect!  If you're not it's still pretty dang good. It's also not too sweet and I appreciated that.  <br><br>It's on the smaller side but there is ample parking.", "pics": null}}, {"review": {"des": "Yelp is really coming in handy for my life! This was another great Yelp find. I'm always trying to find a place to meet a friend for breakfast and we are early birds. I like to meet people at 7am or so. Get together early and catch up and then we can each go about our respective days and such (run errands or whatever). Found this place on the Yelp app and just got a good vibe from it. LOVED the name (not gonna lie) and liked the idea of Southern comfort food, which is a nice change of pace from the regular ole breakfast I usually get.<br><br>I arrived at 7am today and one of the owners sat me down and was super friendly. I felt like I was part of the family! His wife (the other owner) arrived shortly thereafter. Coffee was fresh and hot and we chatted while I awaited my friend's arrival. We both ordered the same plate, on special: chicken fried steak with biscuits and a side of eggs and has browns. The food was really, really good. Made to order and tasted fresh and homemade -just what I needed! A little comfort food for a long overdue \"catch up\" session with a childhood friend.<br><br>Really cool vibe, too. -Kind of an upscale country bar. Music was on, other locals started to come in. A good crowd was forming by the time we left (around 9:30 or so). Overall, a very cool place I am very grateful to have found (despite likely having driven by it, oh, 100 times.) Cool people (the owners)! Support your local \"fried chicken for breakfast!\" down home, country establishment!!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/-P2abWRZKoe93ymLSJhggQ/348s.jpg", "caption": "The special of the day: chicken fried steak plate."}]}}, {"review": {"des": "I love Mother Cluckers! I have had the fried chicken, the hushpuppies, macaroni and cheese, jalapeno corn bread, collard greens, and the grilled shrimp po boy, and EVERYTHING was fabulous. The chicken is fried to perfection, but so moist on the inside. I haven't tried them for breakfast yet, but that will be next! The prices are also reasonable. You can get a two-piece chicken with two sides and hushpuppies for under $10.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/kcl3Ir7aNrnz9Abd4QNMWA/348s.jpg", "caption": "Grilled shrimp Po Boy"}]}}, {"review": {"des": "Yes i travel from the west suburbs to get the shrimp po boy, greens, and beans.  The owner or the owners son is also amazing and good looking too.", "pics": null}}, {"review": {"des": "I truly wish I could be in the 5 star club,or even the 4. We have avoided Mothers for sometime feeling that it was somewhat pricy, but today I felt like getting a little bold and splurge. <br>I read the mouthwatering reviews and ,well we took the plunge!<br><br>I orderd for pick up and placed my order thu Yelp.<br><br>Food was ready on time.<br>Once home I was so looking forward to a good meal.<br><br>I orderd the Chicken sand,beans,mac and cheese,corn and a slice of sweet potato pie.<br><br>I requested for the bbq sauce to be put on the side and for some mayo on the sandwich. <br><br>Neither request was honored. <br><br>The sandwich was huge and the garnish was plentiful.  But it was dry as a bone. <br>The corn was soggy and not crisp, like it had been in water all day.<br><br>The mac and cheese tasted like a hint of sour cream and the beans were the highlight of my meal.<br> Sweet potato pie was indeed sweet. Not bad, not great.<br><br>The cost?  21 bucks and some change.<br>No napkins, or eating utensils.<br><br>I am glad many enjoy the place. <br><br>As for me? It is not a keeper.<br><br>Sorry Ma'Cluck...but too much money for so little satisfaction.", "pics": null}}, {"review": {"des": "Combos don't include a drink? Thus rendering the whole concept meaningless. In fact, a combo actually costs more than ordering sides ala carte.<br><br>Decent food, totally nonsensical menu. Skip and go to any one of the gyros places a block away. Their owners don't need a remedial math class like these guys do.", "pics": null}}, {"review": {"des": "This is one of my favorite places to get food in the area. All the hype is definitely true! We order MC's a couple times a month and always look forward to it. <br><br>The chicken is really good and I'm not even usually a fried chicken fan (this is broasted but very similar if you can even tell the difference- though broasting is less greasy and supposed to be better overall). The sides are also excellent. I love the potato wedges, the coleslaw is great and you can tell it doesn't come out of a bag, and the baked beans have every kind of bean you can think of mixed in. The Mac n cheese is also very good. <br><br>Although they are known for their chicken and fixins, I normally order their other menu items that I am obsessed with- namely the shrimp tacos and the chicken lettuce wraps. I have dreams about those tacos, and not just because I'm pregnant at the moment- they are so good. <br><br>Another thing to love is that it's very affordable- we can usually get food for 2 (and a toddler) for about $20, but I've also gotten large dinners for a crowd and been really happy with how cheap it was.<br><br>Take out is the way I go most of the time but they also have a nice relaxed dining room if you want to eat there. I have heard great things about their dine in breakfasts on the weekends. Overall, highly recommend this place! They are a great neighborhood spot and a nice alternative when you're sick of pizza and Chinese takeout", "pics": null}}, {"review": {"des": "We ate here last night after my 3-year old hurt his foot at preschool and told us that only chicken fingers and corn dogs could make it better. We had never been to Mother Cluckers before since we're newish to the neighborhood, but we have been meaning to try it, so we drove over. <br><br>My husband, son, one-year old daughter and I had pretty much the most pleasant restaurant experience of all time. Everyone was super attentive and very nice, and the food was amazing. I'm a fried chicken fan, and it was delicious- we also tried the shrimp po'boy (excellent), and my son and daughter split their corn dog/chicken finger meals (I maybe tried both, and they were also really good). Sides were great too (we tried mashed potatoes, fries, beans and mac & cheese)!  We were all super full and had extra to take home. <br><br>Thanks for cheering up our little guy and serving up delicious food at a friendly place- we'll be back soon!", "pics": null}}]}