{"name": "naf-naf-grill-chicago-2", "reviews": [{"review": {"des": "So I've been to Naf Naf grill close to Milwaukee so this was very similar. I wanted to review this place because of our experience. They had ran out of pita so we ended up getting bowls (which is also very delicious). As we came to pay the guy told us drinks were on the house and gave us 2 coupons for 2 free entrees. He felt bad about there not being any pita left and we totally understood bc we showed up 25 min before closing. 5++ stars for friendly service and excellent customer service. <br><br>The food is really really good. I liked the beef better than the chicken. And I may prefer the bowl over pita. Although that could change based on mood. Haha!", "pics": null}}, {"review": {"des": "This place is a chain fast food Middle Eastern with a set up similar to Chipotle, pick your bowl or pita, proteins (chicken shawarma, falafel), toppers (pickles, onions), sauces (tahini, garlic sauce), etc.  <br><br>My friend got the vegetarian bowl, I wasnt a big fan of the falafel (it was mooshy) but I got a chicken shawarma bowl with pretty much everything on it, even multiple sauces, and it was delicious.  <br><br>It's a tasty fast food place with locations all over Chicago and select states (Pennsylvania, Ohio, NJ, MN, Wisconsin, DC and Delaware).", "pics": null}}, {"review": {"des": "You could definitely walk past this store without even knowing.  It's a bit small, but once you go in, there is more room in the back tables.  I had a chicken shawarma pita with hummus, all the veggies, and the garlic sauce for $7.35.<br><br>The chicken was marinated in a dry rub seasoning overnight and roasted throughout the day on a rotating stick.  We could see the chicken slowly cooking and getting browned as it rotated.<br><br>One thing I learned, after doing some research, was that the dish actually came from Turkey where it's called the doner kebab or \"rotating grilled meat.\"  When it was introduced in Greece, locals named it gyros or \"turn.\"  And likewise, when it was introduced to the Middle East, locals named it shawarma or \"turning.\"<br><br>There's an access to a restroom downstairs for customers and the service was really quick.  We had nice complementary water and a filling shawarma.  It tasted great.", "pics": null}}, {"review": {"des": "Can't get a NAF of this! (probably been over used but it's true) Great flavor, great taste, & great spot for lunch. First timer and I'm addicted. I would recommend getting the bowl because it also comes with a pita bread on the side. Everything is on point!", "pics": null}}, {"review": {"des": "I may be slightly OBSESSED with nafnaf. And I say slightly as I only went 4 out of 5 days last week for lunch. The chicken shawarma is so tender and flavorful pair that with the pickles, garlic sauce, a few falafel's and some green hot sauce in a lettuce bowl. I am a happy camper with a full tummy for hours! I never feel guilt after eating here either. (Even if I have a falafel or ...3) and their pitas are soooo good! Fluffy and chewy and I like to fill part of it with my lettuce bowl! They have a rewards program too which definitely entices you to return over and over again. It's another great spot to order catering from. They do require 24 hour notice (and this is where you can get some major rewards bucks for free food) and it's better if you can pick it up so you don't have to pay a flat $30 fee for delivery fee. Hopefully I can make it back for lunch next week!", "pics": null}}, {"review": {"des": "This Naf Naf Grill is located right down the street from the riverwalk on Michigan Ave just south of Wacker Drive.  Naf Naf Grill always seems to provide the same consistent good quality food no matter which one you go to.  <br><br>The storefront faced Michigan Ave as you entered a narrow passage you came to the ordering counter where like al the Naf Naf Grills they seem to systemize the ordering down to a Chipotle type system where you choose between a sandwich or a bowl, adding baba ganoush or hummus, choose your meat and toppings. After ordering you continue back to a small dining area.  <br><br>My wife ordered the chicken shawarma pita sandwich w/the baba ganoush.  She didn't seem to care to much for the item she ordered.  I ordered the bowl that came w/hummus, chicken shawarma, red cabbage, Persian pickles, red onions & garlic sauce.  This also came w/a piece of pita bread which I cut in half and used as pita pockets spooning the mix from the bowl in.  It was delicious, but quite messy to eat.  I tried my wife's chicken shawarma sandwich and sadly it was lacking something.  I think if she had gotten the hummus instead the sandwich would have been much better as the hummus was very flavorful where the baba ganoush seemed to be lacking flavor.  I put my hummus on her pita pockets and it definitely enhanced the flavor.", "pics": null}}, {"review": {"des": "Could be the tehina talking, but Naf Naf Grill does Felafel and \"Chicken or Steak Shwarma\" better than anyone else. <br><br>Love the quick, organized and understandable system to choose your food and toppings, decide if you want the chip/fries or not, grab a drink-and move on. Always quick and terrific. <br><br>This is my go to place when working in downtown Chicago, and on rare occasion I get to eat at the DuPont Circle location. <br><br>Choose your sauce, but I love the tehina here!", "pics": null}}, {"review": {"des": "I crave this place constantly for lunch. The bowl with hummus, chicken, sauces, veggies and that fluffy fresh pita are just the best way to pick up your afternoon at work. I bring lunch a lot so when I can get this it is such a treat! It's my favorite Mediterranean spot.", "pics": null}}, {"review": {"des": "Love their lettuce bowl with chicken, garlic and tahini sauce. It's so healthy and tastes amazing too! They have nice falafels as well, and the pita bread is so soft and fresh, and warm too! Their hummus is just perfection.<br>Make sure you download their app so you can get points towards a free entree! I had a BOGO offer as well as a $10 off, and the guy at the counter said I could combine them and use them on one order, but then the system didn't allow it. He was so nice that that he let me have the order for free, and I got to keep my $10 since the BOGO was the one he applied first! Great experience overall.", "pics": null}}, {"review": {"des": "I've gone back many times since the last incident because the food is still so great. However, this past weekend I ordered 13 items for a party and got only 11 of them. The other two were vegetarian ones with falafel. I ordered two even though there was only one vegetarian because I know that places usually mess up the vegetarian food. This would have been a slightly better case because UNFORTUNATELY, they didn't deliver the vegetarian ones at all!! And it is IMPOSSIBLE to get a hold of them on the phone. It is ridiculous. There is no place to give feedback on the nafnaf app about this either.", "pics": null}}, {"review": {"des": "My first stop in Chicago when I was looking for food at 8:58 pm on a Friday night. I cannot believe that most of the restaurants were closed at 9 pm on Fridays! The interior was clean and has good amount of tables to sit down and dine in. We got a veggie feast bowl and a pita bread and hummus. It was identical food except one veggies is in the bowl  and the other is inside of the bread. Ha. <br>The food was pretty decent. I like their lentil soup. Not only it's hot (always a bless to have hot food in the cold weather) but also its taste was great. The price was very reasonable compare to other restaurants. This is a good place for fast  mediterranean food. Staffs are friendly. I'd recommend this place for anyone who like Mediterranean food.", "pics": null}}, {"review": {"des": "Love Naf Naf food. It's delish. Staff is nice. The actual eating environment leaves something to be desired. Hopefully will be back tomorrow for another round of Mediterranean feasting.", "pics": null}}, {"review": {"des": "Pretty solid grab and go place for a quick shawarma. Service was friendly, but portions are on the lower side, so consider loading up on extra protein. Also, the protein was slightly dry, but it still had enough flavors overall. Nothing to rave about, but solid place if you need something to grab on the go.", "pics": null}}, {"review": {"des": "Great concept- choose a bowl or pita and add meat/falafel and toppings. We both got a chicken schwarma bowl and it was delicious. For $10/bowl the portions were generous and the service was friendly!", "pics": null}}, {"review": {"des": "This set up is similar to Chipotle. Get in line and pick out your meal as it's being scooped in front of you. <br><br>Ok if you're looking for something fast. However the depth of flavor is shallow. Perhaps the food would be better if it is hotter. It's not terrible. But definitely not a spot to go out of your way to try.", "pics": null}}, {"review": {"des": "First time I've been to a middle eastern restaurant and the food lacked in flavor. I got a falafel salad and it really had no flavor. Their topping options are also very slim. If they pulled out the herbs and spices it would be great. Everything else was fine, but I wouldn't go back. IDOF remains supreme in my opinion.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/a9-Dw1GkVy13GQwud1bk9g/348s.jpg", "caption": "Falafel salad. Flavorless"}]}}, {"review": {"des": "First time here. Close to my hotel, open fairly late and inexpensive plus healthy options. I went with the chicken shawarma bowl on a bed of hummus and romaine lettuce. Had all the toppings. Com s with a piece of flat bread but didn't finish it all although it was tasty. I left stuffed. I probably will go back as their food is yummy. Chicken shawarma is nice and moist.  The hot sauces weren't as hot as they could have been but I do have a high threshold for heat.  All the flavors meld well together. Probably be back tomorrow night. They also do pickup.", "pics": null}}, {"review": {"des": "Hands down the best falafel spot/chain in town. We always get the hummus or rice bowl with falafel and vegetables. They pack up the bowl well and serve it with a warm pita...melts in your mouth!<br><br>The garlic sauce and green sauce are on point! If you take it to go...make sure to get extra of that on the side, or else you will regret it!", "pics": null}}, {"review": {"des": "Obsessed with this place! Was in Chicago for a week for a conference and ended up going here 4 times. Such a brilliant concept. I always went for the bowls cause they seem to have a ton more food than the pitas and come with their amazingly fresh and warm pita bread anyway. If you catch them when they have a fresh batch of chicken, you can really taste the juiciness. I'll admit when it's been sitting out it loses a little luster. Either way, you throw in some rice and a mixture of their super yummy sauces and it's not a deal breaker. I tended to mix the garlic sauce with the harissa for a little kick and that seemed to be the perfect combination. Prices are super reasonable, and you can make it a combo for about $3 which adds their chips and drink for a plenty filling meal. Wish they would make their way down to my area cause I would eat here weekly.", "pics": null}}, {"review": {"des": "There's so much meat!  I just came here for a quick bite, but I'm glad I did.  This place has fantastic pitas.  I ended up getting the steak which was super tender and not too fatty.  Really surprised by the meat quality considering the great prices.  The sauces and veggies in the pita were also bursting with flavor.  I'm glad I passed on the sides because this thing really filled me up.   Great pita, would definitely recommend.", "pics": null}}, {"review": {"des": "What to get: chicken shawarma<br>Service: 4/5<br>Atmosphere: fast casual<br>Wait: 0 mins (Monday 5PM for 3)<br><br>The Experience: [March 2017]<br>I'm going to put it out there and say I'm not a big Mediterranean/ Middle Eastern food enthusiast, but Naf Naf Grill was pretty satisfying. It's like a fast casual joint, but serves pretty fresh ingredients in their pitas. If I didn't know better, I would have thought this was a famous chain. I think it's only in Chicago though.<br><br>They have a few offerings, but the shawarma is what most people end up getting. Warm chicken shawarma, chopped salad, and multiple sauces held within a large warm pita pairs well with a long walk through downtown Chicago. It's light and flavorful, it almost is like you're rewarding yourself for something.<br><br>Naf Naf Grill is a nice stop while exploring downtown. Glad I gave it a chance.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ke6dPIuWG_58qYbYx-sMRw/348s.jpg", "caption": "Chicken shawarma"}]}}, {"review": {"des": "Long day and wanted something I could grab that didn't call for a wait or too many options--Naf Nat was the answer. Entered into a clean spot, tucked away on the street and was excited to give them a try. I haven't tried Mediterranean food often, but heard they would be a great place to try. Walked in a perfect situation...someone ordering ahead of me, so I could see how things went. The layout is Chipotle style. You pick either a bowl or pita, choose your base, salad, rice or hummus and choose your meat. I chose a chicken shawarma bowl and it was delicious! I put my sauces on the side so I could give them all a try. Great fast, causal spot with spices and seasonings that make your palate sing! I would recommend to the casual diner when out and about in these Chicago streets.", "pics": null}}, {"review": {"des": "Another great choice for middle eastern food in the Chicago loop area, especially if you're going in for a quick bite. They provide various plates and sandwiches with customized meat and side orders, ingredients are always delicious, well seasoned and very fresh. My office went with their catering services a few weeks ago and were not disappointed. Plenty of food to go around and provided a great lunch option for a group of 30. Thanks and will be ordering from Naf Naf again!<br><br>Best,<br>Charlie", "pics": null}}, {"review": {"des": "This place is great. Based on some other reviews I got the chicken schwarma bowl. I was not disappointed. The chicken was moist and flavorful. It is cafeteria style so I chose the hummus base with toppings of mixed raw veggies and cabbage, onions and garlic sauce. With a drink it came to $12.50. A great value in Chicago. It is served with the best pita I have ever had. I would have given 5 stars except I have eaten at the Bucharest Grill In Detroit which is one star better. I will definitely be back here.", "pics": null}}, {"review": {"des": "First off, for those thinking this place is Halal, its not so if you're stopping here for that reason, walk right passed this place.<br><br>I never knew you could commercialize hummus and falafel until I got here. This is what taco bell is to authentic Mexican food. <br><br>Not impressed. Skip this place and keep looking for a better option.", "pics": null}}, {"review": {"des": "You know what can ruin a good food experience??? Terrible service. We stopped here for a quick bite and saw that it had great reviews. <br>I'll admit the food is good, but the service is pretty bad. Perhaps the staff was having a bad start to their day, but they were definitely not short staffed. <br>At only 12pm, there was no chicken so if you really wanted chicken you either had to wait 20 min, get something else, or leave...the 10 guests that were behind me left. I think staff preferred them to choose something else or leave. <br>By the time we got to register, there was one staffer not really communicating with us and another on her phone. Another customer tried to get the attention of the young girl on her phone but girl just walked away. The space to eat is busy and tables weren't clean. I don't think this place would be my first choice for fast food.", "pics": null}}, {"review": {"des": "I LOVE this place. I visited from Arizona and was starving so I stopped at the first decent looking place and landed at this gem! This food is so freaking good. I usually eat at Halal guys but I'm going to say that this place is better. I'm sad we don't have one of these back home but I will be back ONE day.", "pics": null}}, {"review": {"des": "So this is like the third time I review Naf Naf on Yelp. <br>The thing is that I ised to LOVE the restaurant, beyond any other \"fast food\" place. But one day, I came in and had a really bad experience. The chicken was tasting weird and had an odd texture as if it was sitting there for a while. The pita bread was cold and they were not willing to heat it up for me. I even thought i wouldn't come back again. <br>However, I did. My sister wanted to try it so we went back in and the food was good again. I guess it really depends on the day and time of the day in which you come. Whih shouldnt be that way either. Anyway, the food is great, if you go in at the right time!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/_jUEC9dEzoJcG_5d4wKl3A/348s.jpg", "caption": "Pita with chicken"}]}}, {"review": {"des": "Four and a half stars?!? Come on Chicago. You can do so much better than this. Naf Naf is Mediterranean food for the unadventurous. It's essentially uninspired Mediterranean fast food. Bland and usually over cooked. Strange pitas. Awkward service. I don't know why I would go here when there's real Mediterranean food nearby.", "pics": null}}, {"review": {"des": "Delicious. Great service, quick and easy. Would definitely go again. Veggie feast was awesome", "pics": null}}, {"review": {"des": "I came here for the first time yesterday for lunch I got the falafel bowl and my husband the chicken bowl they were both great! We ate a good amount of each for lunch and brought home the rest had a good amount for dinner and we both have left overs today for lunch! 3 times for 8.00 <br>The food tasted great and everything was fresh <br>The customer service was great as well<br>I'm glad we just stumbled in <br>We will definitely be back <br>GET EXTRA PITAS , each bowl comes w 1 but definitely will need 1 or 2 extra", "pics": null}}, {"review": {"des": "As others have mentioned, its literally Middle Eastern Chipotle!<br><br>I enjoyed my meal, had a couscous bowl with all the fixings and chicken schwarma + 3 nuggets of falafel. The couscous had a nice texture, the fixings were like a less unhealthy halal guys in NYC and the Chicken was pretty much chicken schwarma. Price wise its very reasonable given the location!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/XfaoXulxI4B2SqMtIAMqcQ/168s.jpg", "caption": "Schwarma!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/lnq3cyOUjze3YEtKink4LA/168s.jpg", "caption": "Power to the pita!"}]}}, {"review": {"des": "Food - 4/5<br>Service- 3/5<br><br>Had a bowl with Basmati Rice, Chicken Shawarma, Extra Hummus, and Fries. One of the decent shawarmas in Chicago.", "pics": null}}, {"review": {"des": "Delicious, fresh, cheap.<br><br>Can't tell you how many times I've walked by a Naf Naf Grill only to wonder what it was. Finally made it around to give it a try the other day... boy oh boy is it tasty. Think Chipotle but with a Middle Eastern & Mediterranean twist. <br><br>First pick how you want it... pita sandwich or bowl with your choice of rice, lettuce, hummus or even couscous as a base. They do allow you to mix n match bases as you like, and with my hummus bowl they even include a pita bread for you at the end after you create your bowl. So generous! <br><br>After picking your style, select your shawarma (chicken & steak options only) or falafel. Then you can top it off with garnishes such as chopped salad, cabbage, onions, & pickles. And then finish it off with one or multiple sauces are you like. Choose from tahini, garlic, amba, s'kug, or harissa. I ended up going with tahini on top and some harissa (spicy sauce) on the side to help mix up the flavors a bit.<br><br>The bowls are pretty filling and I was happy with my half chicken shawarma and falafel hummus bowl. If you feel like you need more, they do offer sides of fries & soups to complete the meal.<br><br>Anyways, my bowl ran me less than $10 so like I said, it's affordable! Not much else I got on this one. Nice casual spot if you're looking for something quick and easy.<br><br>'Til next time, cheers!<br><br>107/365", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/QLf4tDWp7sXw-95U3McJyQ/348s.jpg", "caption": "Hummus bowl half chicken half falafel!"}]}}, {"review": {"des": "I first ventured to Naf Naf when I was in Chicago for a meeting in the nearby Wyndham.  I thought it would make a fast and tasty lunch on a chilly, late May day, and a nice break from the standard hotel conference room.<br><br>It wasn't the best chicken shawarma pita I'd had in my life, but it was close.  I loved all the flavors, the fresh ingredients, and the portions, but the slight obsessive foodie in me wished that it was spicier and that all the toppings could mix into every bite, rather than being layered.  The lentil soup was also nicely flavored and not too chalky.  Our group arrived around noon, had a decent line to wait in (giving us plenty of time to choose), and then took the food back to the conference room since it was too busy for us to find space.  (We did get asked by hotel management not to bring our lunches back the next day...I think they were jealous of the amazing smells!).<br><br>When I returned and found myself nearby with no lunch plans, Naf Naf seemed the obvious choice.  I still got the chicken shawarma pita, realizing afterwards that I should've gotten the bowl so that I could stir everything up as I liked.  This time I tried the falafel - just a couple on the side.  So good! Crispy on the outside, soft on the inside, and full of flavor.<br><br>A wonderful lunch choice!", "pics": null}}, {"review": {"des": "This is the subway of Middle Eastern food, but it's a reliably decent quick lunch. I would steer away from the falafel which always seems very dry to me. But the chicken shawarma on pita with the toppings you add is really tasty.", "pics": null}}, {"review": {"des": "Naf Naf Grill is a Chipotle-style Middle Eastern restaurant. The food is inexpensive, large portions, and tasty! <br><br>There is a lot of seating here so it's good for groups. <br><br>I've tried both the chicken rice bowl and the veggie feast. I haven't had anything here I haven't liked! The falafel is straight out of the fryer, the veggies are all crisp and fresh, and the meat is all seasoned well. The hummus and baba ganoush were also really good. Make sure you try the garlic sauce! It really ties everything together. I think one of my favorite parts about this restaurant is the pita: they're warm, soft, and fresh. Portion wise, I always get at least 2 meals out of my order and feel like it's well worth the price. <br><br>The only downside is the service suffered a little when I went at lunch versus when I went for dinner. Lunch time is crazy here and I had to wait a little for my falafel. It was worth it in my opinion since I got it fresh. Also make sure you get a pita! It comes with the dish (they forgot mine during the lunch rush and I had to go back to the register to grab one).", "pics": null}}, {"review": {"des": "So yummy. Love the quick meal, lots of protein choices and spicy sauces. Tried the hummus bowl and it was delish. Long line, but totally worth it. Frankly it was a much better meal than Sweetwater down the street.", "pics": null}}, {"review": {"des": "There's a new trend in fast casual dining where, when describing the place, one says, \"it's like Chipotle but for ___!\" <br><br>Naf Naf is no exception, it's the Chipotle of shawarma. But damn, it's better than Chipotle. The shawarma is served in a warmed pita pocket, for cleaner eating than a burrito. The employees are extra friendly, explaining the concept to confused tourists. The food is fresh and delicious, so good, I came here twice on my three day business trip to Chicago. <br><br>A word about the bathroom: a trip there will make you feel like a spy. You ask an employee for a code, then open a door that leads to a hallway with only an elevator. You take the elevator down to another hallway, where your bathroom door is. You enter the code to the bathroom, where there's a clean, full bathroom. I know this exists for big city reasons that suburbia doesn't deal with but it added a special touch to my trip to Naf Naf.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/C0ozYZ3OSC5RPFSI7WN50Q/348s.jpg", "caption": "Chicken shawarma with tahini and hummus on the side"}]}}, {"review": {"des": "Nothing to write home about but certainly tasty. Fresh ingredients and a clean space. The pita bread was warm and soft. I got the chicken schwarma hummus bowl and enjoyed it a lot; fast easy cheap lunch.", "pics": null}}, {"review": {"des": "\"What does it feel like to hold a cloud?\" Grab one of their pitas and you'll know. <br><br>Came here and picked up one of their chicken schwarma bowls for lunch. Service, taste, quality, value was all great. Would definitely recommend if you want something quick. But seriously. Go for the pitas!!", "pics": null}}, {"review": {"des": "Delicious shwarma that is freshly prepared with fresh ingredients. Well priced as well.<br><br>The fresh hot sauce that they can add to shwarma is HOTTT so beware. Its delightfully hot and flavorful for my tastes.<br><br>Will be back", "pics": null}}, {"review": {"des": "Along the lines of chipotle, but instead of Mexican food it's Middle East, shawarma, beef and felafel in bowls or pita you choose the add-ins. Taste great and I will be returning to explore the menu more", "pics": null}}, {"review": {"des": "For under $10, the quantity/quality of the food is not bad. My main complaint is that the end dish ends up being a mess presentation-wise and ingredient-wise. Would've been much better if they put the salad, the meat, the hummus/baba ganoush, etc. next to each other on a flat plate, as opposed to on top of each other in a bowl. <br><br>Still a pretty decent choice for inexpensive lunch.", "pics": null}}, {"review": {"des": "Chipotle style - Mediterranean Chicken shawarma is so damn delicious also their pita is loaded with the fresh meat. They are priced good to this location and quick service also they are very nice and clean ambiance. I would recommend this<br>Place..", "pics": null}}, {"review": {"des": "Great stop for a quick bite to eat. I got the chicken shawarma hummus bowl with rice which I thought was the perfect combination. I like the build-your-own style of toppings and sauces. The chopped salad was nice and fresh and added a great crunch. The portions are big and the bowls also come with a side of pita, can definitely be more than 1 meal.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/xM20TuaJfEXWV-bN77mxGA/348s.jpg", "caption": "Hummus bowls!"}]}}, {"review": {"des": "Good fast Mediterranean food... not wow but I was ok. <br>Staff is friendly and guide you with the food according your preferences", "pics": null}}, {"review": {"des": "Hubby and I originally intended to get lunch at Red Robin Burger Works.  Well, I didn't realize that most of them were permanently closed in Chicago.  Ok, we had to develop the Plan B ASAP.<br><br>We then walked into \"Naf Naf Grill\" without knowing how this place works.  While by looking at the menu alone didn't clarify, I overheard one of the regulars explaining his go-to order to his friend.  Ok, thank you, young man.  I knew what I wanted to get.  <br><br>For some people, it's easier to look at their food assembly line instead of the confusing menu.  It's basically \"customize-your-own\" middle eastern style fast food.  You can pick a bowl of couscous, saffron rice, or salad as the base.  Then the choice of protein (falafel, chicken, or steak) comes second.  Finally, the worker will finish the bowl up with additional condiments (pickles, purple cabbage salad, chopped salad, or onion salad) and sauces (tahini, garlic, harrisa, hot jalapeño, and mango).  <br><br>Perhaps I've been spoiled on the neighborhood mom-and-pop restaurants, I've had great falafels.  From a fast-food standpoint, the falafels and the pita bread weren't awful, yet there were no comparison to many other Middle Eastern establishments nested in the less touristy areas.  <br><br>Nevertheless, if you're one of the working professionals in the Loop/Magnificent Mile, \"Naf Naf Grill\" isn't going to be a shabby choice for a speedy, convenient, reasonably-prices and relatively-tasty lunch.", "pics": null}}, {"review": {"des": "I really wish we had this in the south because it is a great fast casual place to get delicious Mediterranean food. I had the couscous bowl with all the veggies and falafel (my first time trying falafel, too!) and I ate every bite. The warm, fluffy naan on the side was a delightful bonus. Great place to stop for a quick, filling meal!", "pics": null}}, {"review": {"des": "This is like a make your own style. It's great because you can customize what you want. I personally got a pita with baba ghoush with all veggies and hot Tahiti sauce. It was delish.", "pics": null}}, {"review": {"des": "The food here is great, and it was ready almost immediately! I got the chicken shawarma in a pita with hummus, the cilantro-onion mix, and the garlic sauce. I also got a side of the fries, which are more like thinly sliced fried potatoes than traditional fries. I was very happy with the food. The pita was warm and soft, and the rest of the food was nicely seasoned. The fries were a little bit soft but I honestly liked them that way. My breath smells real bad right now but my tummy is very happy!", "pics": null}}, {"review": {"des": "Visited this Naf Naf Grill for the first time when I was looking for somewhere inexpensive for a quick dinner when staying at the Sheraton Grand for work. The staff there was super friendly, the food was good, and I left full for like $10. Can't ask for much more!", "pics": null}}, {"review": {"des": "Had a good experience at their north Michigan Avenue location.Didnt realize it was a franchise.They definitely give out good portions at a reasonable price.Has a fast food type of vibe but the food us quality I can assure you.I couldnt even finish all the extras I ordered.Shawarma was very good and so were the falafel.Nice to know I can keep an eye out for more of their locations.Im in the Loop quite frequently and an all up and down the whole area.I have a new SPOT for Middle Eastern thats for sure.Everything was really good and the employees were very helpful as well.Was not a long wait at all.Definitely worth stopping in.", "pics": null}}, {"review": {"des": "Rich and tasty veggie bowl: hummus, 4 falafels, pickles, baba ganoush (with tahini topping, of vourse)+ pita bread.<br>Delicious!", "pics": null}}, {"review": {"des": "Well I walked over a mile to get to naf naf the other day. Thats all you really need to know. The food is so good that it's worth a workout. <br>I like the steak bowl with rice and hummus. They line the bottom of the bowl with a lot of hummus so you can dip in and have some with every bite, then put a layer of rice down, and some steak. Then you add what you want- I go for veggies and tahini sauce usually but the garlic sauce is also good. <br>The best part of getting a bowl is that it is super filling. Every time I get to the bottom and think can I eat any more? The answer is always yes! That's when I turn to the included pita bread and proceed to clean up all the leftover hummus and veggies that remain clinging to the bottom of the bowl. After everything is fully scraped and the pitas are gone I am nice and full.<br>Highly recommend it. <br><br>Also, the falafel is very tasty. I usually try to go with someone else who I think will get falafel and trade them for some steak. Would steer clear of falafel if you are a big eater though as you only get 5 which is far from enough to fill me up.", "pics": null}}, {"review": {"des": "If you're looking for something different (not burgers or tacos) then I recommend some falafel or shawarma. While being a chain restaurant, Naf Nag does a lot of things well, including falafel. We were visiting from out of town and exploring the area to find some dinner. I originally thought I'd like get some lamb or chicken but the falafel sounded good on a chilly night. I had a hummous bowl that had some really light, smooth, and flavorful hummous. The garlic sauce was tasty, as was the cucumber and tomato salad. I loved the sumac onions: super seasoning without the pungent juice. The highlight though was the warm, extra soft pita! All in all, the food was great, comforting, filling, but won't make you feel sluggish or regret your decision.", "pics": null}}, {"review": {"des": "We came here after a day of walking in the park. We yelped this place and decided to come in here. Seemed like a Mediterranean Chipotle place. You get to choose what you want, a base, your sides, your proteins, and sauces. <br><br>We came in and the cashier said that there was no pita available today. We still got charged the same price. That was -1 Star.<br><br>Staff was nice but slow. We were there deciding for 5 minutes and they hadn't even finished serving/ringing up one person.<br><br>I got the veggie feast bowl. It was alright, but I only got four pieces of falafel. Feel like it should've been more. I've eaten Mediterranean before but I don't know much about the names. Baba Ganesh is def bitter to me.<br><br>Bf got the build your own with chicken shawarma, rice, and garlic sauce. He said it was good but it had a piece of plastic in the bowl. Photo attached.<br><br>The fries are decent. Some of them are too burnt, but otherwise fine.", "pics": null}}, {"review": {"des": "I decided to give this place a try during my extended weekend stay in Chicago, and I am so glad I did. I had the hummus bowl filled with rice, eggplant, chicken, falafel, onions, and more. It was served with a delicious side of fluffy pita. The employees were extremely friendly! It's been my favorite meal thus far in Chicago, and I fully plan on returning at least once more before we leave town. If you are looking for fast, delicious and fresh food, I would give Naf Naf a try!", "pics": null}}, {"review": {"des": "Middle Eastern Chipotle that's pretty good! They have an option for a pita sandwich, a bowl with rice, couscous, greens or hummus. They also have falafel and chicken and beef shwarma and good toppings like cucumber salad, cabbage, pickles, onions & various sauces. <br><br>I got the couscous with chicken shwarma and added hummus and babaganoush (each was an extra $1.50 which is quite pricey) and it was good! The shwarma wasn't the best I've had but it was still enjoyable and it hit the spot.", "pics": null}}, {"review": {"des": "Their Shawarma should be called pita Carne Asada (chopped steak) . It wasn't Shawarma! It tasted fine , but not like Shawarma! The falafel was dry, salty, and I could taste the strong flavor of onion. I wouldn't buy their falafel. I have yet to find good Shawarma in Chicago! Sorry Naf Naf, you might want to look into the \"Shawarma Grill House\" in Copenhagen, Denmark. It's the best Shawarma I've ever had. <br>Maybe, you can learn their trick and bring it to Chicago!<br>Good luck. <br><br><a href=\"/redir?url=http%3A%2F%2Fshawarmagrillhouse.dk&s=755fe02c0b9c2f0d3c5114fe3ce865c178c5c8942d36c37ef560ecf3570ce9b3\" target=\"_blank\" rel=\"nofollow\">shawarmagrillhouse.dk</a>", "pics": null}}, {"review": {"des": "I love this place, I love the food and the price, but as much as I'd love to give Naf Naf 5 Stars, I've gotten a stomachache every time I've eaten here. The person I was with also got an upset stomach. I always get a side of chicken, a side of rice, and about 4 falafels for $9. Their garlic sauce is amazing, the falafels are very tasty, though they are on the small side. Again, my only complaint is that the food gives me a stomachache, but that reason will prevent me from coming back.", "pics": null}}, {"review": {"des": "I got a falafel pita. The pita was so good and the harissa was delicious. Good value.", "pics": null}}, {"review": {"des": "We happened upon this place on Michigan Avenue more due to circumstance than plan.  I was starting to get hangry as we were walking to the Art Institute on a beautiful Sunday afternoon and this was one of the first places we happened to see.  I also really enjoy Middle Eastern food in general, so this seemed like a logical choice.<br><br>Likening Naf Naf to a Middle Eastern version of Chipotle is appropriate on many levels, including the ability to customize the base (rice, couscous, salad), proteins, and toppings.  A comparison can also be made in terms of cleanliness and likelihood of having GI distress later in the day.<br><br>We ordered a salad bowl with chicken and a couscous bowl with steak, along with the Naf Naf fries as part of a meal combo.  Along with the 2 pitas that were included, this was way too much food!  Thankfully, we were able to give one of the pitas, completely untouched, to a family with small kids dining nearby.  Even then, we could not finish all of the food.  Among the items that we ordered, I'd have to say that the falafel was the best, and even that wasn't particularly memorable or easy to recommend.<br><br>Service along the assembly line was fast and polite.  Bathrooms were located down a staircase and through a few doors.  They require a code, so make sure to ask before you head down, otherwise you'll be super annoyed when you have to make your way back upstairs after encountering a locked door.<br><br>Overall, not a bad place for an efficiently-prepared and super filling meal at reasonable prices, but hardly worth a trip on its own.", "pics": null}}, {"review": {"des": "I had a falafel from here and it was soooooo good w/ extra Tzatziki sauce . It was fulfilling but I didn't feel disgustingly food after eating. I'm actually going back today!! The customer service was superb. My new go to summer spot.", "pics": null}}, {"review": {"des": "Good food and reasonably priced. The only drawbacks were that we ate in the restaurant, and the lobby was messy and not very clean. I'd go back for lunch.", "pics": null}}, {"review": {"des": "I live in Nevada and was traveling to Chicago.  A coworker suggested this place, so I thought I would try it out.  WOW!  It was super tasty!!  I had the chicken schwarma plate, which comes with a pita.  I opted to have the basmati rice and all the fixings.  Don't miss out on this gem!  We are hoping they will someday expand out West.  We need something like this in our lives.  Naf Naf is NOM NOM!!", "pics": null}}, {"review": {"des": "Wanted something fresh and easy and quick for dinner and Naf Naf Grill fit the bill. <br><br>Not a ton of options here - pick if you want a bowl with salad/couscous or a pita, pick your protein (chicken, steak, falafel), add veggies/sauce. <br><br>I got a chicken pita and was impressed! The pita was fluffy and thick and did not fall apart like others I've had. The chicken was fine, but didn't really stand out. The sauces are what made it though - I got the tzatziki, garlic, and the jalapeño and they gave the pita a ton of flavor! <br><br>Two pitas ran us $17. <br><br>A good choice for a lunch or quick dinner.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ldxHfx56XMh8Z5BqBlxluw/348s.jpg", "caption": "Chicken Pita"}]}}, {"review": {"des": "Outstanding fresh flavorful food. Great options. Great service. Reasonable price for the portions. <br><br>Just go eat now.", "pics": null}}, {"review": {"des": "Just perfect for what it is -- fast Mediterranean. I was really surprised by the quality of the ingredients and all the tasty options for the reasonable prices. The staff was cheery and helpful too. Big fan of this place for to go food. Atmosphere seems passable but not fantastic for eating in.", "pics": null}}, {"review": {"des": "Hmmmm.... another chain in Chicago selling inauthentic Arabic food. And within sight of Drumpf Tower!<br> What would the faux president say (my apology, my American friends... it is none of my business who you want to govern you.. well... except... when said person decides to make himself governor of the world and opine on other countries as if he is in charge of it all.. then... well...)? <br>Anyway, perhaps Herr Drumpf could be reassured that the food is not reeaaaly Arabic or something?<br><br>Anyway, they did have chicken shawarma and beef shawarma on spits and also offered a variety of toppings and sauces. The meat was nothing special and it was not being carved off the spit. It was already in their trays, which is a pity. If you have it on spits and carve it from the spit then why not do so when a customer asks for it? That way the meat is tastier, warmer and does not have to sit in a lukewarm tray! I really like those authentic Arabic shawarma joints where the meat is revolving on the spit while being grilled and the juices are running down it as they take a knife to it to make your sandwich.<br><br>The sole employee behind the counter was a super friendly guy who nonetheless was having a difficult time understanding me or making himself understood to me. Perhaps those with American accents are not used to true English (which is spoken by Canadians hahaha!)? <br>Seriously, we had to repeat our sentences to one another three times on each side.<br><br>Regardless, he was very friendly and accommodated my request for a custom portion of this much beef and that much chicken in my one bowl. He topped it up also with exactly what I wanted and as much as I wanted. The meat, rice and topping were all fine - for Americanized 'Arabic' food. <br>There were a few tables in there, but most customers were more interested in take-out.<br><br>I also had a lentil soup, which was hefty. It certainly was not a watery concoction, which this girl appreciated. All orders receive a small pita loaf as well, which is well wrapped to preserve freshness.<br><br>Is there a day for Arab-Americans or that celebrates Arab culture? Naf Naf could offer the president a sandwich or bowl delivery for a photo opp the way he showed us his cultural acumen being photographed with a taco bowl on Cinco De Mayo! Boy, that was beyond embarrassing....", "pics": null}}, {"review": {"des": "It's funny that my experience at the newly opened Naf Naf Grill in Naperville in 2009 was so great that it inspired me to write by very first Yelp review. Tonight at the location on Michigan Avenue, our experience couldn't have been more different. <br><br>Over the past eight years Naf Naf has, not surprisingly, expanded to many many locations around the Chicago area. We have been hard core fans of the Naperville locations since that very first day.<br><br>On Michigan Avenue tonight, they were severely understaffed and severely challenged. One of the tree guys there was busting his butt trying to serve the customers as best as he could, but the other two were a little lost. One was preparing food while on his cell phone, probably trying to get someone in to work but still, you can't prepare food safely while on a cell phone. The other was on the cash register and didn't seem to know what he was doing at al, including correcting customers who asked for fries by saying \"we don't have fries, we have chips. In fact they ARE fries and are described on the menu that way. <br><br>It took us thirty minutes to get through the line with only three people ahead of us. Our schwarma pitas were cold, and I had to go back to the counter to get our fries after we finished our sandwiches because they weren't keeping up with demand.<br><br>We will not return to this location again and will stay in Naperville where we always get great food and great service.", "pics": null}}, {"review": {"des": "If you want a quick tasty bite in downtown Chicago without breaking the bank, stop by Naf Naf Grill on Michigan Avenue. And get the shawarma; beef or chicken, on a salad or in a pita, doesn't really matter. <br><br>After checking into the Wyndham Grand Chicago on East Wacker Drive and unpacking, I fired up my Yelp app and took a quick look at the decent dining options nearby that didn't have a wait. Naf Naf popped up, and I trekked the quarter mile from my hotel, hurrying to make it before 9 pm (which was the closing time listed on Yelp). <br><br>Upon arrival, I realized they're open till 10, and there were quite a few folks dining. I ordered the chicken shawarma in a pita, loaded with hummus and green skhug, the spicy Israeli sauce that originated in Yemen. <br><br>There is plenty of seating, but just a few of the tables are low with comfortable seating, and I was lucky enough to snag one. The chicken shawarma pita was delicious, the hummus creamy, the meat tender and moist, and the skhug took it to another level. <br><br>Wandering around the eatery afterward, sipping water to counteract the spicy meal I just had, I noticed a newspaper article posted on the wall: Naf Naf was voted one of the years Top 10 dining options by the Chicago Tribune not too long ago, with praise being heaped on their chicken shawarma. <br><br>Can I pick them or what, I thought to myself, as I made my way slowly back up Michigan Avenue towards my hotel, more than satisfied after an excellent meal.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/w0cfb73llgApVd7O2cfPQA/348s.jpg", "caption": "Not surprised to see this adorning the wall."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/KTF3wXPkNpA7hJOlOmkbzA/168s.jpg", "caption": "Chicken Shawarma pita with hummus and skhug yarok - green Yemeni-Israeli hot sauce - completely hit the spot."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/R0HjM059Fma8fxjGttWtog/168s.jpg", "caption": "I preferred a lower table with more comfortable seating."}]}}, {"review": {"des": "Stopped by here after a LONG day of walking around and was starving. It really hit the spot. <br><br>It is a build your own Middle Eastern bowl/pita sandwich (think Chipotle). They have a lot of different choices (chicken, beef, falafel, couscous, rice, hummus, salad...etc.) I came in about 30 minutes before closing and there was still a pretty crazy line. However, they still kept people moving. There is quite a bit of seating inside to eat there, but if it's really busy you might not find anything. Bonus, it's reasonably priced.", "pics": null}}, {"review": {"des": "Woh this place is a gem. Ordered basmati rice bowl plate and it was amazing. Served one of best falafel I ever had!", "pics": null}}, {"review": {"des": "This was hands-down the tastiest food I had in Chicago over the course of three days, at restaurants with various price points.  Also the first time having Chipotle style fast casual that ACTUALLY tastes really good.  Not quite sure how they pulled it off, but if I live in the vicinity I'd be eating this every other day.<br><br>I had a beef shawarma bowl for about $10.  The meat is *perfectly* spiced.  Baba ganoush is also very tasty.  The way they layer the bowl is optimized for each bite having the perfectly balanced taste mixture.  Service is quick and friendly.  The only suggestion would be to have more diverse drinks outside of boring sodas and water (how about Boylan sodas, kombucha, or hot Moroccan mint tea especially in Chicago where I'm sure there will be demand for hot drinks in the winter).<br><br>Finally, I'm glad I trusted Yelpers - 4.5 on Yelp really doesn't disappoint!", "pics": null}}, {"review": {"des": "Great little place downtown Chicago! Love the food, the price, and  the speed of service! Will be back!", "pics": null}}, {"review": {"des": "Falafel was dry and not flavorful at all. The bread was stale too. I wouldn't recommend this place at all", "pics": null}}, {"review": {"des": "Is the name Naf Naf or Nom Nom?  I had the chicken shawarma with a smear of hummus and onions, lettuce, tomato and the hot and tzatziki sauces.  I also ordered their \"fries\" that are more like potato chips.  My daughter got her veggie delight with falafel.<br><br>The shawarma and the falafels were really good.  The sandwich was filling and exactly how I wanted it because I was able to choose what I wanted in it.  The falafels were crispy on the outside and still moist on the inside.<br>The \"fries\" were okay.  I wish they were cooked a little longer so they would be crispier.  It was a tad bit soggy.<br><br>But overall, I really enjoyed this place and would come back to get my nom nom or naf naf on.", "pics": null}}, {"review": {"des": "We just happened to be passing by this restaurant and noticed it. We went in and were very pleasantly surprised. The food was most excellent and we had a fabulous meal.", "pics": null}}, {"review": {"des": "Get away from the mundane chains, this is some great & healthy food! <br>Try a bowl - couscous, salad, rice or hummus base with either chicken, steak or falafel and top with veggies and a sauce. Less than $10!", "pics": null}}, {"review": {"des": "Expensive and bad cell service. Food was good and pretty fresh. Overall, good. Would return.", "pics": null}}, {"review": {"des": "Absolutely delicious! Tried Naf naf when I was visiting Chicago and it was flavorful and filling. Just wish I had this restaurant in California!  The prices are reasonable.", "pics": null}}, {"review": {"des": "I was pleasantly surprised with this place! I got the falafel pita, and it was really good! The falafel was crunchy on the outside, and the pita was really soft and chewy. I only wish the ingredients inside were better spread out; all the hummus was at the bottom of the pita sandwich, and my vegetables/hot sauce were all at the top without falafel. Other than that, the ingredients were very fresh, and it was quite delicious! Fair price at less than $8 post-tax for the falafel pita sandwich.", "pics": null}}, {"review": {"des": "Have long been a fan of Naf Naf Grill - and the Michigan Ave location confirms my loyalty. Great staff - excellent food - and even tho the atmosphere is a bit lacking - the dining room is in the back of the shop and doesn't have any windows , but it is spotless, bright and cheery. Their lentil soup is sooo good on a cold day! do yourself a favor and stop in for a flavorful lunch and a nice break from work. Enjoy!", "pics": null}}, {"review": {"des": "Naf Naf Grill - it's basically a Middle Eastern version of Chipotle that I wish would expand to more states across the nation (ahem TEXAS). The three protein options are: chicken shwarma, beef shwarma, of falafel, and you choose from making a pita sandwich, couscous bowl, rice bowl, salad, or a hummus bowl. A lil tip - you get a LOT more from a bowl vs a pita sandwich, and bowls come WITH a pita. The price difference is only a dollar more for the bowl, so I would recommend you opt for that option if you are super hungry!<br>For toppings, they have a variety of options including baba ganoush and hummus (both of which are extra), chopped salad consisting of veggies like cucumber and bell peppers, red cabbage, onions, and pickles. They also have five different sauces available: a white garlic sauce, a white tahini sauce, a mango-based sauce, green-based sauce, and a red-based sauce. If you aren't feeling creative or inspired enough to create your own combo, they have a \"veggie's delight\" bowl that you can order as well that's on their menu. I don't remember the exact items in it, but it comes with hummus, falafels, chopped salad, baba ganoush, cabbage and onions, among others :)<br><br>They also have \"Naf Naf fries\" which are different from your typical fries. Instead of your standard fry cut, these potatoes are cut like potato chips and then fried. So good! For only $3 extra to your meal, you can \"Naf it up\" and get fries, rice, or soup plus a drink. <br><br>If you are a fan of Middle Eastern/exotic food and/or shwarmas, I would definitely recommend you give this place a try! The price is right for the amount of food you get - I had it for lunch around 2pm and wasn't hungry again until breakfast the next day.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/7lujIMuvgC9znLEC00SkGA/348s.jpg", "caption": "Chicken shwarma bowl. Bowls come WITH a pita and are only $1 more than a pita sandwich! A TON more good - worth the dollar!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/f-p00Rd75CIIOojkbFCdNg/168s.jpg", "caption": "Chicken shwarma rice bowl. I got \"everything\", the two white sauces, the mango sauce, and the red sauce."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/8g6MJMpyVtfvUHATdwMw2w/168s.jpg", "caption": "Naf Naf fries"}]}}, {"review": {"des": "Great place to have a filling veggie meal. I had the veggie feast bowl which was large enough to share with my wife. The freshly baked pita breads were yummy as were the freshly made falafels.", "pics": null}}, {"review": {"des": "This was the worst pita I ever took a bite of- then discarded. Pita was cold and underbaked and soggy. Chicken swarmha was dry to the bone. Avoid this place...really. I wish I could give zero stars.", "pics": null}}, {"review": {"des": "Yay for healthy, delicious fast-food! They have big portions, which are very filling. I tried the hummus falafel bowl with most of the sauces and was very pleased. The sauces added great flavor. I also got good service, the worker waited to take my order so I could get fresh falafel. I wish there was a Naf Naf back home~", "pics": null}}, {"review": {"des": "I must have grabbed lunch here at least a dozen times! Usually a little before noon to avoid the lunch rush, even though the line always moves quickly. Service is pretty attentive, not overly friendly, but helpful if you need it. I almost always get the chicken schwarma rice bowl and pay extra for the hummus. It's delicious, and will last me two meals (so it's worth the price). I also always take my order to go, but there are some high top tables in the back if you choose to eat there. <br><br>The bottom line: If you're in the mood for fast casual Mediterranean food, I'd recommend trying Naf Naf.", "pics": null}}, {"review": {"des": "Pita bowl!  Every single time I'm here I get the chicken shawarma pita bowl.  I've had the fries before, but the real highlight is the pita quality and the great seasoning throughout the options that you can choose for your bowl.  <br><br>The line gets very long around noon so you should come early around 11am-11:30am to avoid the rush.<br><br>The employees always seem so happy and enthusiastic; everyone is greeted with a warm \"Welcome to Naf Naf!\".<br><br>I tend to rotate between this and Halal Guys, but each place is a different experience so it is hard to truly compare both apples to apples.", "pics": null}}, {"review": {"des": "Good food. Got the hummus bowl and was fast and good for the price. Close location to our hotel. Steak was flavourful.", "pics": null}}, {"review": {"des": "So good. Lots of food. Full balanced meal with meat, veggies, and healthy grain. Very tasty. Great for about $9. I need a franchise in Tulsa! Will come back next time I'm in CHI.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/YfZAtacGxQXKZttvsfJrYA/348s.jpg", "caption": "Chicken Shwarma couscous bowl. Yum! I just let them pile everything on they thought would be good, which was basically all! They were right."}]}}, {"review": {"des": "Stopped in for lunch and was impressed! The stuffed pita was so filling and delicious! This is great place to stop for a quick lunch!", "pics": null}}, {"review": {"des": "This chain is one of my favorites. I first tried it here in Chicago and was really thrilled with the quality of the food. It tasted great! <br><br>The place was clean and nice to be in. The staff were also nice and friendly.<br><br>I've tried it since in several other places in the US, and the experience can be different to be honest. This spot here however is one of their best! <br><br>Highly recommefed! Be sure to try their amazing falafel! :)", "pics": null}}, {"review": {"des": "I swear this place puts something in their food to make me keep coming back. I actually boycotted this place for a while as I wasn't much of a fan of their limited toppings compared to places such as Roti/Chipotle/Naansense. <br><br>My go to here is the Chicken shawarma rice bowl. Again the toppings are very limited. It's Jerusalem salad, cabbage, onions and pickles. I don't eat cucumbers so I stick with the cabbage and onions along with the variety of sauces they have. <br><br>When everything is mixed together including the rice and chicken just every bite is so flavorful. The chicken isn't dry ever. The pita is soft and delicious. I can't stop eating at this place during my lunch hours...it's like _______", "pics": null}}, {"review": {"des": "Yum, yum, yum. What a great place to stop in for lunch if you work in the Loop!<br>I like to get the falafel bowl with rice on the bottom and I splurge by getting hummus on top too (I mean, for me, it's like getting Chipotle with the guac on top-- ya gotta do whatcha gotta do). You also have your choice of plenty of veggies in the bowl, very tasty tahini sauce (there are other sauce options too, like a white garlic sauce), and a generously big piece of pita on the side too! I've been to this location multiple times and it's consistently high quality.<br>One thing: the naf naf fries (they're more like thick chips?) are just ok. Not quite as satisfying as getting real fries-- I'd just skip it. The baklava is good though!<br>In conclusion: highly recommend as a fast-casual middle eastern joint!", "pics": null}}, {"review": {"des": "We tried everything on their menu and it was all so so delicious. Not many places to eat in downtown Chicago especially good flavorful meals. The steak shawarma was cooked perfectly and the falafel was the tastiest falafel I've ever had! Everything was amazing. I think the only thing I'm going to miss from Chicago is Naf Naf!", "pics": null}}, {"review": {"des": "Here at the AMA conference at the Hyatt Regency and I arrived here early. Rather than pay the price of expensive hotel room service (although it was tempting given the level of my hanger and exhaustion from having to wake up at 4), I decided to walk 2 blocks and found Naf Naf. Designed very much like a fast food restaurant, and it is, you hop in and out in last than 5 minutes. If you get there at opening time at 11, you'll have no line although you'll see that most people have already come by and popped out with their food. <br><br>Basically there's a lot of shawarma to choose from whether it be chicken or beef. For those vegetarians out there there are other options. You can have it over hummus, over a salad or in a wrap. Either way you march down the aisle like a marriage at Chipotles picking out all the individual ingredients you want included. I of course went for the steak hummus bowl which even for me I probably could have split between two people. However since I had the hunger of a starving village, I devoured it all. 3 hours later I'm still feeling it...<br><br>I'm not sure where one would park around here to go get it. The restaurant has busy streets without street parking all around it. Sorry can't help you there. Just passing through Chicago!", "pics": null}}, {"review": {"des": "I have been on the hunt for any falafel or shawarma that can possibly compare to Zamzam in OKC for a while now. I just want to make sure that they must be putting crack in theirs or something b4 I sign up for my addiction class. It's so good it's like a potent hypnotizing spell grips you & your can't stop thinking about going back there like EVERY DAY. Yes, they are that good or like I said its got some kind of secret addictive crack in it & I'm calling the Police. <br><br>Anyhoo, I heard about Naf Naf & that it was the BEST EVER. I couldn't wait to try it! Then, a trip presented itself to Chicago, hotel booked right next door & BOOM! Hello Naf Naf! <br><br>Went straight there, ordered the chicken shawarma & falafel with a side of the potato chip things. <br><br>*shocked face* Are y'all serious? This isn't the BEST EVER! Not even close. The meat was chopped too small & the falafel tasted pre-made.<br><br>Honestly, it was a decent sandwich, it was good if you like subway. If I was in the area again & there was nothing better I might order the chikin Shwarma again but not the falafel or the potato things. <br><br>I will stick to ZamZam & happily go to rehab :)'", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/nPIpIPI4FoBuNMnmqoPb6g/168s.jpg", "caption": "Crispy garlic chips on the side."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/-c7Y22AKTbJs1M4tDgH5mw/168s.jpg", "caption": "Chicken shawarma with the pickles it was good but I've had better ;)"}]}}, {"review": {"des": "Great food, cheap, friendly staff. Big bang for buck for sure. I am in Chicago for work and only had two chances to eat out. The first time I went because it is the closest restaurant to my hotel with excellent ratings. The 2nd time I chose to go again.", "pics": null}}]}