{"name": "nana-chicago", "reviews": [{"review": {"des": "I came here with some friends for Sunday brunch. The place was hopping, so we had a bit of wait. Unfortunately there's not much of a lobby, so we had to wait outside. Brrr!<br><br>Once we were seated, we were greeted by a friendly server. Since our wait was a bit longer than expected, I decided on lunch instead of breakfast. I chose the veggie burger and fries. It was so good! One of the better veggie burgers I've had of late. <br><br>All in all, delicious food, but make sure to make reservations!", "pics": null}}, {"review": {"des": "Good environment, and choices seem intriguing but the delivery comes short. Staff seemed tired and bleak. Food wasn't as fresh, guess because we came on a Tuesday lunch (restaurants usually order inventory for their weekend, mid-week, so be wary ordering seafood) . Weren't offered all services, like our neighbors. Not worth mentioning to friends nor to return.<br>1 star for ambience<br>1 start for the mixologist", "pics": null}}, {"review": {"des": "Our hunt to continue our run of Bib Gourmand restaurants (from the 2017-2018 list) took us to Nana for a lunch date two weeks ago; my wife had been once before, but this was my first outing.<br><br>The positives:  I LOVE this space, and during the day, the way the sunlight hits the spaces near the windows is fantastic and just puts you in a better mood by walking inside.  The staff upfront and our server were all very nice and I could see why this would be, for some, a great neighborhood restaurant with a bunch of regulars.  Also, for the price, the serving sizes are pretty good.<br><br>The not-as-positives:  we tried the empanadas, the veggie burger and the cubano.  All three were tasty, but none were particularly memorable.  The veggie burger had a nice crunch to it (which was due in part to nuts broken up into the veg blend; I have a nut allergy, so I don't think I asked enough questions about this before ordering or didn't notice this being written into the description in the menu), and the flavor was fine, but it wasn't a world-class sandwich.  The cubano was also fine but didn't have a particularly distinct flavor, despite very tender meat as a filler.<br><br>The negatives:  our empanadas were a total miss.  I can't really put my finger on why, but I know that the filling made my wife take one bit before pushing her share of this appetizer aside.  I had one (mainly because I paid for it!), but didn't need to take it home later...even though I still asked for a box anyway.<br><br>Overall, a slight disappointment, maybe given its standing on that Bib Gourmand list.  I would come back for dinner to round out my thoughts on this, but only when someone else suggests going.", "pics": null}}, {"review": {"des": "My partner in crime, Lena B and I finally made it to Nana one Sunday after having driven by it many times. We easily found a place to park on the side street. We enjoyed waiting about 20 minutes at the bar on this lovely sunny Sunday morning. The restaurant is cute, stylish and bright with unique art. We were seated in the side room in this busy cafe. We were pleasantly surprised to find a couple vegan entree's and appetizers on the menu. We both had the tofu scramble with black beans and potatoes. The portions were not huge but were well prepared. This was a pleasant vegan dining experience. I would be happy to come here again as an option with omnivores but I would not consider it a vegan destination. Happy that this lovely cafe has vegan options.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/DrP_UXZugfbwFbP92HBMew/168s.jpg", "caption": "Lena B at the bar at Nana"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/CZSbZ8HmLcL8TKzXM6euAw/168s.jpg", "caption": "Vegan tofu scramble at Nana"}]}}, {"review": {"des": "One of the best organic food eatery in Chicago.There were so many options to pick from.I got the Nanadict which had house made Sopes. I haven't had Sopes before and so I was excited for this and it didn't disappoint me. I had poached eggs and Chorizo on top of the Sopes. If you don't like Poached eggs, they also go offer alternate options. Nanadict came with Home fries and some greens. They complimented Sopes well.<br>My girlfriend got Pumpkin Spice French toast and I tasted some of it too. To my suprise, it wasn't as sweet as I expected it to be. It had the perfect level of sweetness and having the toast with my Nanadict was a perfect delight to my sweet senses.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/-J6L4HTFEuiSykSaZjTgYA/168s.jpg", "caption": "Menu"}]}}, {"review": {"des": "Just about everything at Nana is fresh, and you can tell a lot of thought goes into planning and preparing the food.  I had the Nanadict, and it was great.  The tea was a great complement, as well. I'll be back to try out more items from the menu!", "pics": null}}, {"review": {"des": "I have a hard time rating this one because I'm so sad about it... I came to Chicago with big hopes for this restaurant and it failed me. I got the avocado fries which were good, but he eggs Benedict and the shrimp/lobster sandwich were not good. I wanted empanadas but they were out and lobster was supposed to be on the sandwich but they were also out. I hated both entrees and didn't think it was worth the money. I do however give the restaurant 3 stars for the service. My food wasn't good, but my service was fantastic. I wish I could remember his name, he was awesome!", "pics": null}}, {"review": {"des": "I ordered the breakfast sandwich, which was egg and cheese on an English muffin with avocado on the side, along with potatoes and greens. The cheese was a bit overwhelming for me, so I'd ask for less cheese next time. The avocados helped keep it refreshing. The food here was good, but ordinary. I will say that it was very filling! I wasn't able to finish all of the potatoes and greens. The service was also a bit much for me. Our waiter stopped by our tables almost every 10-15 minutes, which cut into a lot of our conversation. <br><br>My friend and I arrived around 9:30 on a rainy Saturday and the place was already about half filled. By the time that we had left, it was pretty much filled. If you don't want to worry about waiting, you can always make reservations!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/0YogM2ge06IbWiJ2c3cfVw/348s.jpg", "caption": "Breakfast sandwich"}]}}, {"review": {"des": "We came here for brunch after a lovely Sunday morning and it was truly impressive. <br><br>Still relatively new to Chicago, my sister-friend, who is a Chicagoan, chose this little spot. I wasn't sure what to expect, but upon entering we were greeted by very friendly people and the place was packed.<br><br>Luckily we were seated almost immediately, and decided boozy brunch was the way to go! ;))<br><br>1) The Oaxacan Iced Coffee is insanely good. I imagined spicy, chocolaty coffee, but this was way better. Not only could you taste the chocolate and cinnamon very boldly, but the toasted coconut flavor also came through. Very nice, I was sad when it was all done......<br><br>2) The Baked Chilaquiles surprised me - in a good way. Baking the tortilla made such a difference in the flavor of the plate. I was pleasantly impressed at the presentation, which made the Chilaquiles the main dish. Lots of flavor and the portions were great.<br><br>3) Avocado fries - we started with these, they were delicious but the best thing was the aioli that accompanied them - excellent.<br><br>4) Ambience was also a draw. I loved the art on the walls. It felt so much like a departure from the noise and hustle of the city street outside. It made the dining experience that much better.<br><br>This place is tucked away on the edge of Bridgeport, off Halstead and 33rd, and it's like a gem that lots of people know about. I'll definitely return with more friends.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ucd2mhhi9vgmA22gUHfQIA/168s.jpg", "caption": "Yummy! Oaxacan Iced Coffee.....omg."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/9CsS7gQkX4IMfyY1RYU2dw/168s.jpg", "caption": "Baked Chilaquiles - incredibly tasty."}]}}, {"review": {"des": "Nana has been on my list of places to check out. Not often do I head out to Bridgeport. But decided on a Saturday morning to grab brunch at Nana. Parking shouldn't be a problem to find but keep note, you have to pay for parking. <br><br>There was no wait, arrived around 11:30 AM on a Saturday. We were seated right by the bar along the windows. It was a terrible seat if I'm being honest with ya. The curtains from the window kept rubbing against the side of my face and when a large group was waiting for their table, they were hanging out at the bar with their booties rubbing against my other side of the face. Uncomfortable. Almost complained and wanted to get a new table but definitely not in the mood to start drama. It was the weekend for crying out loud (Labor Day weekend), a crappy table is not going to ruin my weekend but bad start. <br><br>Service was fine. Our waitress was really nice but slow on some areas like getting a hot cup of coffee instead of an iced as originally said. Coffee here was $5 by the way. A little extreme if you ask me but what do I know, I don't drink coffee. For starters we got the avocado fries. The description, the pictures made me think this was going to be a home run. However, it wasn't close to a home-run. It wasn't even a single. It was a strike out. In my honest opinion I thought the avocado fries were very bland. It had absolutely no flavor. I was almost tempted to ask for their chipotle mayo they used as a spread to dip it in because what they gave just wasn't enough. The avocado was dry, bland and just not good. I regret ordering the dish and for $10, just not worth it. Again, the idea, the description legit sounds amazing but the execution just wasn't for me. I'll give it 2 stars. For the main brunch entree I got the Cubano Sandwich. My goodness was it delicious. Extremely flavorful, the cheese the meat, the sauce, the pickled relish. Absolutely delicious. However it was a complete mess. Meat was spewing out of the bread. I literally had to use a knife and fork to eat the meat because the meat/bread ratio sticking out was 100 to 1. All the meat was outside the bread, and there was actually barely any meat in between the bread. Delicious sandwich, just awful presentation. Even though the presentation was brutal, I'll still give the sandwich 4 stars. I wish they gave you chips or fries with the sandwich or some sort of home fries??? but they give you cole slaw which was good because I hate veggies and didn't have much taste. LOL <br><br>All in all I had high expectations for Nana and quite honestly I left disappointed. Check it out, let me know if your Cubano comes with a nice presentation unlike mine with everything spilling out. Also let me know if you like the avocado fries. Will I come back? Probably not.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/KDLNqnQcHEcFuBko4VtgIA/348s.jpg", "caption": "Drinks menu"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ftY8Vysqg7IW4LbD_7R9Hw/168s.jpg", "caption": "Food menu"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/BVyjIDVWO7zYHdSDlCXomA/168s.jpg", "caption": "Kitchen"}]}}, {"review": {"des": "We arrived at 10AM (Sat). We made it just in time before all the rush came in. Our table was a party of 7. <br><br>- we were a little bummed that it being half empty we were seated in the entrance with all the cold air. <br><br>- the treatment was good. however the vibe from the greeting was a little off. hence us being seated at the entrance. <br><br>- our 2 appetizers (avocado fries & empanadas) came out quickly. appreciated that. most of us were curious about the fries but everyone was pleasantly surprised at the taste. <br><br>- The biggest downfall was our order delay. As 3 of the 7 received our orders which was in good time, one of the orders which would have been a 4th order was incorrect. At that point the rest had to wait an unapologetic time frame. We did get apologies for the wait at least 2x but we all felt a better way to apologize would have been great. <br><br>- The food was good. We all enjoyed it, but sometimes something like the wait is just as important.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/b_y7xXV0EtPXtKUaM3RElQ/348s.jpg", "caption": "Empanadas and Avocado Fries"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/BOnvujiKaLGJQs9u1SXD8g/168s.jpg", "caption": "Baked Chilaquiles $14 with Chorizo"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/3P_y6ydGu1oyp9TioIpubQ/168s.jpg", "caption": "Breakfast Sandwich"}]}}, {"review": {"des": "AMAZING!!!!!! Went for Saturday breakfast and had the garden omelet w/house made English muffins, it's a slight up charge, but well worth it. My dining partner had the chilaquiles which were made with a twist...SUPERB. We also tried a few specialty cocktails, Oaxaca Iced Coffee and Coquito which were delightful.", "pics": null}}, {"review": {"des": "The food was mediocre for the prices, really lacked flavor and texture. Parking was decent. It was a little crowded, but not bad for a Saturday morning.", "pics": null}}, {"review": {"des": "I don't even know where to begin.  Summary: we sat there for two hours and my husband never received his food.  The waitress forgot to put it in, won't admit her fault, never apologized, and it wasn't until we alerted the manager did anyone come over to address the situation.  The pancakes were comped and we took it to go.  And that was a disaster too - the pancakes were packed without any of the sauces or toppings that came with the order.  It was just plain, naked pancakes.  So much for dulce de leche pancakes - more like plain battered cakes.<br><br>And the service - that waitress was SO bad I wanted to leave her no tip at all.  She never refilled our water.  She was slower than anyone - all other tables around us were served their food while we just sat waiting and waiting and waiting.  It took her twenty minutes to come by and pick up our credit cards to process the payment.  And she can't even take orders correctly.<br><br>All this for crappy, expensive, cold food.  Trust me, save your $$$ and go elsewhere.", "pics": null}}, {"review": {"des": "Nana is great stuff. The staff was pleasant. Our server was on top of it and the food was perfect. First time I've ever had avocado fries. They nailed it!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/j9vfoqMY97qy8uzMUVs5LA/348s.jpg", "caption": "Breakfast burrito"}]}}, {"review": {"des": "Not worth the drive from the suburbs. I read the reviews after I started the drive here, most of them were right. I only ordered appetizers to see if they were as bland as everyone stated, and yep they were right along with our server Allyson's customer service. Avocado fries were gross so I only ate half of one. The beef in the empanadas had absolutely no seasoning at all. My daughter didn't care for the cucumber fizz she ordered. My son said the water was the best thing we were served and that was warm!", "pics": null}}, {"review": {"des": "Delicious and fresh foods. Vegan options key. Lovely atmosphere and super service. Highly recommend!  <br><br>PS. HAPPY HOUR!! Cucumber cocktail was delicious, $5!!!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ChgxH2Avr6mosto0ExsT5g/348s.jpg", "caption": "Hub's Po-Boy, fried oysters, shrimp and arugula."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/L7uRAqwOIDX62780SP_shg/168s.jpg", "caption": "Avocado Fries; the hype is true, amazing."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/F4Y5D4PD3bpME0asfEjH0g/168s.jpg", "caption": "Hubs had the molette appetizer, he said the bread was to die for!"}]}}, {"review": {"des": "This is one of those places that I wanted so badly to love, but it just missed the mark for me.<br><br>The staff and service is attentive, welcoming and wonderful. No complaints!<br><br>Starters:  <br>- Avocado Fries were OK. It was a good portion of thick avocado wedges that were breaded, deep fried and served on top of a chipotle-lime aioli. Decent, but nothing to rave about<br>- Empanadas were standard. The beef filling was tasty, but not complex<br><br>Entrees:<br>- El Cubano was my favorite part of the meal. Good portion of pulled pork/ham and better flavors with the aioli, cheese and relish. <br><br>Drinks: <br>- Bloody Mary is large & flavorful with a pickle, cheese & tomato skewer<br>- Mexican Coffee is a warm, coffee drink with smoky Mezcal<br><br>I'm not rushing back, but I would definitely want to give it another shot with different orders! Maybe I'll make a brunch date out of it!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/lXG7aGTPsCTljPSFrGoWNA/348s.jpg", "caption": "Empanadas $10"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/bDh9DUUTgIbTGQ2brO1iJA/168s.jpg", "caption": "El Cubano $13"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/qblEEGKGm_Pvp3Ua51UJsw/168s.jpg", "caption": "Avocado Fries $10"}]}}, {"review": {"des": "I've only been here once, but oh man, was it tasty! We started with chicken nachos, which were delicious. I ordered the plantain sandwich and a half order of the strawberry rhubarb French toast, and I was not dissapointed. The rice and beans served with my sandwich was a bit plain, but everything else was stellar. Can't wait to go back for dinner!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/zPPH06bdTVVjhxHMgrHaLw/348s.jpg", "caption": "#menu"}]}}, {"review": {"des": "I finally made it here. It wasn't too busy for a Friday night. The place from the outside is deceiving. There are more tables inside than what you see. The decor is very nice and contemporary. <br>The host met me at the door and was very friendly. He showed me to the table and the waitress came over within a few minutes. <br>My cousin and I both seen reviews on Chicago's Best and Check Please. This place doesn't disappoint. The menu is very simple and has plenty of choices. We started with beef empanadas. They were a nice size and had plenty of filling. <br>We both ordered a sandwich and shared the sandwiches. She ordered the shrimp and oyster po boy and I ordered the el cubano. The sandwiches were very tasty and filling. <br>Will have to come back. They have a tasting menu for $25. And a Sunday brunch.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/9RQ7ofSxyYz_ZeAHbjlBFQ/348s.jpg", "caption": "Shrimp and fried oyster Po boy"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/c-Z2b9BF097GjNxlC-ZF_Q/168s.jpg", "caption": "El Cubano sandwich"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/92W_dSL3HEO0iPgbqZ_JiA/168s.jpg", "caption": "Beef empanadas"}]}}, {"review": {"des": "The size of their drink glasses are ridiculously small especially if they are gonna charge $4 for a Dr Pepper.<br>The side of asparagus should warn that it comes DRENCHED in some lemon oil sauce that might be gross to you...<br>Besides that, everything was great!!<br>The chicken sandwich is THE BOMB DIGGITY<br>the salad was a solid B+. What would have made it better was more lettuce and less arugula, salt in the dressing and maybe some red onions.<br>The waitress could have been more attentive.<br>That's why 4 stars and not 5.<br>Loved the ambiance and the art on the walls.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/YMTiOtsuU70HwolSBX9ywg/348s.jpg", "caption": "Aztec Salad $10 Nothing to write home about but fresh and good"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/gEcl78VhSmNB6zAsLcS0YQ/168s.jpg", "caption": "Grilled Asparagus $6 Not worth it. And they don't tell you it's gonna be soaked in oil sauce .. just soaked"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/tdYTeX-9b8v8rn0L6oBO9w/168s.jpg", "caption": "Grilled Chicken Sandwich $13 and Mac and cheese"}]}}, {"review": {"des": "i came to try the avocado fries<br>and the peaches and cream pancakes whit coffee<br>i be back again for more", "pics": null}}, {"review": {"des": "Great place to be in bridgeport <br><br>Its priced slightly high but the food is great abd service is alway excellent", "pics": null}}, {"review": {"des": "Nice staff. Ordinary food.<br><br>We got their Thursday Chef's choice. Nothing healthy or special - plenty of cream, salt, sugar.<br><br>My pet peeve: do not take my dish off the table while my guest is still eating. These places where dinner for 2 easily tops 70 bucks but act like a McDonalds.<br><br>2 stars because i always want small businesses to succeed.", "pics": null}}, {"review": {"des": "I went to Nana for dinner on a weekday evening. We arrived around 7pm, and it was pretty quiet. A few tables were seated, so we had our choice of which table we wanted. The atmosphere is very quaint and comfortable.<br><br>As for drinks - Nana has a full bar and few unique cocktails on the drink menu. There is also a good sized wine and beer list. The restaurant serves Metropolis coffee, which I am a huge fan of. I love when restaurants serve local, Chicago-based coffee. For food, I ordered the veggie burger with a side of greens, and my friend ordered the grilled chicken sandwich. The veggie burger was delicious - very unique flavors and quite healthy. <br><br>The best aspect of Nana was the service. The restaurant closes at 9pm, and my friend and I were still talking and enjoying ourselves come 9:15pm. The staff did not try to kick us out or rush us. We eventually noticed we had stayed past our welcome and left, but I was so amazed because most restaurants would try to force you to leave right after closing time. <br><br>Thanks Nana for the great food and for being so welcoming!", "pics": null}}, {"review": {"des": "My new fave brunch place in town. Spacious, great service, never crazy busy and of course incredible food. Tried their pear French toast, eggs nanadict, biscuits & gravy, pancakes over several visits, all were solid and huge portions for the price. Highly recommended!", "pics": null}}, {"review": {"des": "Great cozy vibe with a welcoming feel. We were seated petty quickly since we opted to just take a coupler of open stools at the bar. It was busy the whole time we were there!<br><br>They serve up local, organic options here. Guy Fieri has visited and you'll see his stamp above the open kitchen area. They had a brunch menu and regular menu. Food was tasty but nothing sticks out in my mind. <br><br>Since it was very busy, staff attention was pretty distracted. I think they checked in on us once. No biggie since we didn't need anything. <br><br>Overall: B<br>An a ok stop for brunch and a local vibe.", "pics": null}}, {"review": {"des": "After years of riding by and by we finally stopped here to have a taste at Nana. We came here on a Saturday morning. It was a beautiful day out we sat in the outdoor seating area. <br><br>My bf got the Nanadict and I ordered the breakfast sandwich. The food and service was good. The food wasnt really anything special. It was quite average. I ordered some kind of tea it wasnt good it was flavorless. The menu is really small they dont have many options and it seems to be more of a Latin theme. I only recommend to someone who like Latin breakfast. <br><br> Overall, it was a decent experience. I am not in a rush to go back but I do recommend and I may visit again.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/OG2O582RMXKdh-yc10uX4g/168s.jpg", "caption": "Nanadict"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/bcNf-yrIOsfsbgEP15VWKg/168s.jpg", "caption": "The breakfast sandwich"}]}}, {"review": {"des": "I love Nana. In fact, their one food I always order \"Plantain Sandwich\" Jibaritos is delicious!!! It is so delicious I would eat ANYTHING this place makes! <br>I love Nana so much I still force my bff and his family to drive from the burbs so we can break bread here! Did I mention I love Nana? <br><br>     I live right by Nana so it is easy when I work from home to call downstairs and be guaranteed delicious food! I am certain I will always share my hard earned cash as expensive as they are. Nana is one of the few expensive indulgences I pay for with a smile on my face.....for me at least!<br><br>Problem: <br>       3 star is for boring customer service and quality standards. <br>A few times I called for the Plantain Sandwich and they were \"sold out\". A few more times the sandwhich is so tiny I really prefer to exchange it but I'd never force food out of an American commercial kitchen if my life depended on it! Nana has a menu so skimpy I don't even know how they get the portions so arbitrarily variable! <br>          You just never know how big or small the portion is going to be! <br>I have ordered personally or delivery & delivery service.<br><br>SUGGESTIONS ON THE FOOD (PLANTAIN SANDWICH) respectively: <br>     At your rates ($15) if it is going to be small such that you cannot feed 1 person then add a second side for the price to the standard menu or sell 200 at $7/day like subway. <br>    i) If I come in to moan, I risk being the person whose food gets spat on<br>   ii) I am not looking for BETTER customer service or white glove treatment; just a standard portion we all can count on, comfort food that is fulfilling and doesn't disappoint by portion size<br><br>     I already mentioned I love Nana:<br>- it is one of those Brunch joints where the line is out the door because they do kick ass<br>- the staff is cool and progressive. I have seen Rahm Emanuel during lunch 3 times <br>- I have their menu on my fridge and have used it to pick up when I entertain!<br><br>     If you are deciding whether or not to go....do not hesitate! Do continue to support Nana if you are a regular.", "pics": null}}, {"review": {"des": "Went for brunch here with another couple based on some reviews about the place. It had a nice decor and was bigger than i expected. I ordered the cherry french toast. Which was incredible. The brioche bread was fresh and the cherries were delicious, it was a lot and somehow i couldn't finish! My husband ordered the nanadict and really enjoyed it as well. We will definitely be back especially since they change up their menu!", "pics": null}}, {"review": {"des": "I really wanted to like this place. I came in her for brunch with my family and we were all disappointed. My food was cold and the empanadas weren't good. The Brussels and kids stack were good but given if you were spending 70 plus bucks it would be better. I won't come back.", "pics": null}}, {"review": {"des": "The food was very good. They claimed it's organic, local and fresh. I had the duck omelet and it was very tasty. The coffee was amazing! It was strong. My son had hot chocolate and he loved it. I ordered some pancakes for him and the were not that great. The chilaquiles were so freaking delicious they had the right taste. French toast were very fluffy and so good.<br><br>Over all I say this place is kind of fancy with cool decorations and paintings. The price was a bit high for the food. I say 3 to 4 dollar signs instead of 2. I have had the same quality of breakfast and paid three times less. <br>I recommend if you are up for something fancy and interesting.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/SARevZgSi-iT3TwxCFtI9g/348s.jpg", "caption": "French toast"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/j-IoPNmwcyga5NkE1txF8g/168s.jpg", "caption": "Poached eggs"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/FMtsSnuW76KsbzzW66c6XQ/168s.jpg", "caption": "Chilaquiles"}]}}, {"review": {"des": "Hell toda na, toda na Nana.  4 stars is waaaay to high for this place.  I gave it 3 separate tries and each experience was different and underwhelming.   Heard they did away with the empanadas....they should do away with the cauliflower salad also.  What is that?!? The flavors did not mesh, a hap hazard attempt at creativity so basically,  it was gross.  The plantain sandwich was good, just not memorable.  So, alas, i bow out, never to return again.  Your food just doesn't stand up. Nana clearly has a following but IMHO...it's not worth the dough.", "pics": null}}, {"review": {"des": "I want to love this place, but it's so inconsistent! Today the pumpkin salad had no pumpkin and was bone dry...the nanadict had thick, flavorless sopes as the base....the home fries were underwhelming, and the greens were dry on the side.", "pics": null}}, {"review": {"des": "Wow can I just start by saying this place is amazing! Yesterday my husband went to try out this place for the first time. We live one block from it and this was our first in two years that we have lived in the area. It was just so good that it has become one of our favorite places now. <br><br>The interior is very clean, outside kitchen, nice and simple deco. As soon as we walked in we were greeted by the manager i guess and sat us down quickly. We got there around noon so I decided to get a breakfast dish and my husband a lunch dish. <br><br>I had their breakfast sandwich and wow it was too good. You can pick your choices of meat so I picked ham, one of the best hams I had in years. The muffin was soft, warm , the fries crispy and good, my my favorite thing on the sandwich had to be that cheese, it made everything taste even better. The husband had the plantain sandwich he said it was delicious, I couldn't try it since I don't do spicy food at all, but I did tried his rice with beans, they was bet good I liked it. He ended up liking my dish more though. The macha tea I had was warm and so delicious. <br><br>Service was also good, the waiter was the one that suggested us what to get, so we got it and we were very satisfied. We will definitely will be coming back but to try other dishes and of course their dinner dishes.", "pics": null}}, {"review": {"des": "The service and ambience of this place is lovely. The food, while not poorly constructed, was lacking. I got the nanquitos with the soyrizo and while nothing was bad, per se, nothing was great. The eggs were poached nicely and the sopranos was well made, but the meal as a whole lacked seasoning. The home fries were very dehydrated and tough to eat. While I like lightly dressed greens, these tasted almost like raw greens. The poblano crema has nice flavor, but there was so little of it on the eggs the effect wasn't really there. I had to douse my dish in hot sauce. I left still feeling kind of hungry and unsated. Perhaps the lunch fare is superior, but I will not come here for the brunch fare.", "pics": null}}, {"review": {"des": "Found this place while in Chicago for a convention, <br>It is awesome all of the food is homemade from locally sourced organic products. And the service rocks, Paul was our server and made sure that we had a wonderful experience. <br>We tired several thing out of the menu and nothing was disappointing, all the the suggestion were are on point", "pics": null}}, {"review": {"des": "This is a warm and welcoming little restaurant with great food and attentive staff. They are especially great with children and will go the distance to make you feel comfortable even if your kid has a tantrum (I know this from personal experience- ha!). They provide crayons for the kids and have a dedicated kids menu with all the favs (except, for some reason my son decided he wanted shrimp!). The sippy cups are also amazing- large and reusable. I highly recommend this spot, especially if you are dining with children! Also, street parking is easy.", "pics": null}}, {"review": {"des": "I thoroughly enjoyed my time here. Good service, it was my birthday and the waiter gave us a desert on the house! We had the shrimp poboy, and avocado fries, and the beef empanadas. I was stuffed by the end. Thanks!", "pics": null}}, {"review": {"des": "I was pretty disappointed with this place especially when it had such great reviews. We tried the veggie burger, MacNCheese, tomato basil soup, and avocado fries. Honestly all the items lacked flavor. We didn't get to try the breakfast items so maybe those would be worth a try? <br><br>The veggie burger came out open faced and very dry... you definitely needed to add mayo and maybe ketchup or something to get it flavored. The MacNCheese was the best thing.. had to add some black pepper though. The tomato basil soup was very bland, I added salt, pepper and like two teaspoons of hot sauce to get it flavored. The avocado fries were decent- it was my first time trying them and I may order those again to share, but overall it's not a place I'd return to.", "pics": null}}, {"review": {"des": "What a great place! Family operated, and it has a welcoming family feel to it. The menu is made of locally-sourced ingredients so everything is fresh. And then they find a new spin on an old classic, such as their delicious Chilaquiles with homemade green poblano sauce. My friends love that they can bring their kids here, and everyone can find something delicious. PERFECT for brunch in Bridgeport!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/97CzhvkYpplfAA7bovHsaQ/348s.jpg", "caption": "Eventually, the plate was picked completely clean!"}]}}, {"review": {"des": "Dined at Nana earlier today for a late lunch. I ordered the Cuban sandwich and my cousin ordered the empanadas.  Both dishes were definitely worth talking about. The empanadas were packed with flavor.  The Cuban sandwich was more of the same, loaded with all sorts of melt in your mouth flavor. The bread was delicious.  I liked the fact that they garnish the dish with a jalapeño as well so you can either leave it if you don't like hot or accompany it along with the sandwich.  The sandwich was also served with a cabbage salad.  The salad was made with red cabbage and cilantro, it was ok, I wouldn't say bad, just not my taste.  Service was great. Atmosphere was very welcoming.  Overall great food and great place.", "pics": null}}, {"review": {"des": "Their avocado fries are my favorite appetizers. Whenever my girlfriend and I come here for brunch - I never leave the place feeling super full or still hungry. The portions are big, but they never feel too heavy. <br><br>Love it, love it, love it!", "pics": null}}, {"review": {"des": "Came on a cold rainy Sunday at 11:30am, only needed to wait 10-15 mins for a table for 4.  The avocado fries were bomb, especially the sauce it came with.  The lentil soup of the day was also delicious.  Got to try the chilaquiles and the nanadict.  Both were delicious, but if I were to pick one dish I liked more I'd pick the chilaquiles.  The potatoes that came with the nanadict weren't anything special, the nanadict itself was good. <br><br>Service was great, food was delicious, would definitely come back again.", "pics": null}}, {"review": {"des": "Their empanadas and plantain sandwich are fantastic. Atmosphere is great and so is the service.", "pics": null}}, {"review": {"des": "Loved the cocktail. Food was great. The giant cappuccino  The stall in the women's restroom seems like it was designed by someone who has never tried to use it with a standard amount of stuff and female activity.", "pics": null}}, {"review": {"des": "Came here for lunch on a Monday afternoon.  Got seated immediately. They are paleo friendly.  I was able to get the plantain sandwich ($13). Had to omit the rice,  beans,  and cheese.  Server was nice to offer me a side salad which was perfect and avocado ($3) to my sandwich was made it taste phenomenal.... Just wish she had told me it was an add'l charge. <br>Their bottom-less coffee ($3.50) could've been hotter, but I asked the food runner to get be another cup and he brought me back a fresh new cup of HOT coffee. :)<br>My friend ordered a large OJ ($6) and the chilaquiles ($12.50) which she enjoyed. <br>Love the organic selection of food. The cozy environment and the 90's R&B playing in the background. <br>Come here if you want to have a nice healthy brunch date. But be prepared to spend an easy $40-50 for 2 ppl. <br>Plenty of street parking in the area.  They even have an outdoor seating area for warmer temps.  <br>Inside is pretty spotless and they have enough power outlets to charge your phones if need be. <br>Also, on the way out... The entire staff thanked us,  except our server. :( guess she was having a bad day. <br> Will I be back? Yes. I'll be back. :)", "pics": null}}, {"review": {"des": "Very disappointed with Nana's. We've been there before so we were excited to go back, but this was a terrible experience. I ordered the Nanadict and found an egg shell in my order. Not a big deal, I get that things happen, but the manager made excuses instead of apologizing. Then, they give us a \"complimentary\" dessert which they end up charging us for on the bill. We also had to pay full price for the order I did not finish. <br><br>Not to mention, they forgot to give us a menu item we ordered. The chilaquiles we ordered were plain and disappointing. <br><br>Like I said, I understand things happen, but it should be up to the restaurant to make things right. They were not interested in doing so.", "pics": null}}, {"review": {"des": "Oh wow, Nana. Wow!<br><br>I love your avocado fries and the chipotle sauce they ride in on,<br>I love your tasty mac and cheese,<br>I love everything about you,<br>Can I get a free drink please?<br><br>Oh wait, they might not do free drinks, but on Thursdays they've got some seriously good cocktails for just $5 each (normally $8-10ish). <br><br>I've had the burger, awesome. Had the empanadas, awesome. Had the pan-roasted chicken, awesome. They also do free dessert if it's your birthday.<br><br>This is a classy place, with a classy menu, for a good price. I don't often find myself in Bridgeport, but when I do, I head here.", "pics": null}}, {"review": {"des": "An absolute gem.<br><br>I visited Nana while in Chicago and happened to arrive for their special Easter Brunch. The restaurant was busy but they were happy to seat me at the spacious and comfortable bar.  The space is bright and airy and really feels like a local business. The staff were all very friendly, helpful and chatty, and were happy to answer any of our questions. The bartender here is a star, making some very delicious drinks while providing wonderful dining service to those seated at the bar. <br><br>The food was all very good. Freshly prepared with a lot of attention paid to the details. The highlight was the lamb dish we had, with absolutely delicious and perfectly prepared cubes of lamb over potato hash and served with a very tasty green mole sauce. Unexpected on a brunch menu but a real delight. <br><br>I was really impressed with Nana. Their Easter menu had many great options, and while we were eating we could overhear the staff talking about new items for various menus they were working on. They clearly really care about both their food and service here and I hope to return the next time I am in the area.", "pics": null}}, {"review": {"des": "I'm leaving a 2 Star because we ubered across town to come here and eat since the time of close was 8 pm online and on the door. Yet they closed up shop at 7 pm. An hour early for no reason.. not so good for Business. It makes me not want to make the drive again and take the chance.", "pics": null}}, {"review": {"des": "Why do I not eat at Nana's more often is a sin. Fabulous food, service & ambiance. Gotta get the amazing fried avocado appetizer, tasty fresh gnocchi and carne asada. Easy parking, outdoor seating.", "pics": null}}, {"review": {"des": "Nice friendly cozy environment.<br>50/50 on the food.<br><br>Nanadict<br>It's a bit bland, the baked potatoes were like old and dried up. Muffins under the benedict seems a little could use a little longer to toast.<br><br>Coconut Toast<br>Is delicious, I could eat that for dayz! <br><br>Overall not a bad place definitely would come back for that Toast", "pics": null}}, {"review": {"des": "This place is simply amazing. I went there 3 times for brunch on a Saturday. They don't have reservations on weekend so better be early. I love getting their nanadict with a side of Cuban black rice. Their coffee is pretty good. They also have delicious French toast with pear butter and candies pear. Their ingredients are organic and  from local farms. Interior is very cozy. Great for families or couples.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/BsxSrwEsDgzTgW99OmyW5A/348s.jpg", "caption": "Nanadict $14 Cuban Black Beans & Rice $4"}]}}, {"review": {"des": "I know everyone is already saying this bit this is a must to try at the avocado fries! The are so tasty on their own but in the sauce it intensifies favor. I need to get more asap, i went for brunch I'll be back for dinner.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/goI6q47RwcP0PGHXIYFuKQ/348s.jpg", "caption": "Classic avacodo fries"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/F8WkZJvKm83rdarglvXJww/168s.jpg", "caption": "Shrimp and oyster po'boy, kind of spicy kick on the shrimp."}]}}, {"review": {"des": "Honestly, I've passed this restaurant for other ones on Halsted like 1000x times without realizing it was there. My cousin had recommended it to me while we searching online what to eat. Today, I bring my family and friends here once in a while because I was and am so impressed by:<br><br>1) Quality of Food <br><br>I loved the tasty, exquisite Po-Boy sandwich with fried oysters, shrimp and generous helping of that herb cream! And I love the Cuban Ham sandwich, that cabbage slaw helps curb the salty and zesty ham and adds a crunch. At the end we always finish off with one of their cakes!<br><br>2) Nice Location<br><br>It has a little too few parking spots, but the restaurant itself is very stylish and clean. <br><br>3) Service<br><br>The manager is very attentive and willing to help. One thing they could improve is have condiments readily available.", "pics": null}}, {"review": {"des": "Great service! Food was amazing! No complaints. Will forsure come again! I highly suggest to try the pistachio rum cake for dessert!", "pics": null}}, {"review": {"des": "Great Plantain Sandwich which you don't find a lot of places that have it in bridgeport.  The unexpected deliciousness was the red onion slaw that include with the tender shredded chicken.  <br><br>Ice latte could have been better, however wait and staff were great.<br><br>Overall definitely worth coming back for!", "pics": null}}, {"review": {"des": "The actual space is bright and pretty. But the food was so bland, I couldn't have gotten through breakfast without hot sauce. The chilaquiles were basically a bunch of store bought tortillas made into a brick and covered with sauce. The tofu scramble tasted like beans from a can with no extra flavoring, and the tofu had absolutely no flavor. I know tofu tastes like pretty much nothing, but add some spice! Definitely not worth the price. I can make both dishes better at home.", "pics": null}}, {"review": {"des": "Holy moly... this is the Best coffee I have ever had in my whole life. Service was great and very friendly. Somehow what I feel Everyone wants a place where you can sit in cozy area and sip a coffee which makes you feel alive. This is the place my friends!!!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/HzVsYmnzneTU71wvfSpaIw/348s.jpg", "caption": "Best mocha I have I ever had"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/P6_qN43fM7UUuiXBZgxeIA/168s.jpg", "caption": "Creamy soup"}]}}, {"review": {"des": "This is one of my new favorite finds. Everything was fresh, choices were incredible and the atmosphere was relaxing. Our waitress was very efficient and the manager Tomas was so kind. They treat you like family. <br>I will definitely be back even if I have to travel a distance it is most certainly worth it.<br><br>I had the chicken breast sandwich with pickeled asparagus and fried Avocado fries. AMAZING!!!!", "pics": null}}, {"review": {"des": "Service was good. nice, comfortable spot for dinner.  All in all good and definitely worth a try, no complaints from me but not really motivated to go back", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/unFBRWQJ1ACBBzJJf3p-wA/348s.jpg", "caption": "Nana Michelada"}]}}, {"review": {"des": "After various friends kept posting drool worthy pics on social media ,I decided it was time to check this place out myself. SO glad we did !<br><br>We decided to come in for brunch one day and share the strawberry rhubarb French toast and a garden omelette . BOTH delicious and perfect.  The latté was also good and our server was efficient and sweet.<br><br>The location  is perfect for us McKinley Parkers so we will most definitely be stopping in soon !", "pics": null}}, {"review": {"des": "One of our favorite restaurants in Chgo. Low key, very good food and you can find parking! Yay!  <br>But the food is Great!", "pics": null}}, {"review": {"des": "I've now been to Nana twice, and have enjoyed both experiences there. The staff is quick, attentive, and friendly, and its a lovely space to share a meal with friends or a significant other. Most recently, I came for lunch with my sister on a snowy afternoon, and the place was packed. Even with how busy it was, we were seated quickly and our waitress stopped to check on us often. <br><br>We had the empanadas to start, and they were lovely: crispy, flavorful, and very generously portioned. I had the chilaquiles, which were delicious and well-portioned. My sister had the plantain sandwich, which was fine: a little bit dry, and less flavorful than I would have liked, but not bad. We finished off with the Chocolate Sformato for dessert. It was perfect: so chocolatey, and rich enough to split.<br><br>My only complaint is that the prices were a little steep for what we got, but I can give them a pass since they source locally and use organic ingredients. Overall, Nana is a nice little neighborhood spot if you're sick of the same brunch fare, and want to support a local business.", "pics": null}}, {"review": {"des": "I've been here countless times and thought a review is long overdue. I usually come here for brunch and have not been disappointed during this time. The specialty coffee beverages, omelettes and brunch items are superb. I'm partial to the Heuvos Rancheros and Chiliquilles. I have been here once for dinner and it was underwhelming so I'm going to continue to come for brunch.", "pics": null}}, {"review": {"des": "Super tasty food! The plantain sandwich was beyond amazing and their chicken burger was as well! I would totally recommend this restaurant!", "pics": null}}, {"review": {"des": "I was very disappointed in this place. I ordered several of their items on their menu including the baked chilaquiles, huevos rancheros, avocado fries, and bacon. Both the main dishes: baked chilaquiles and huevos rancheros had no flavor and just not good. I'm a big chilaquiles fan and I like them crispy and I guess since these are baked, they tasted more like soft and tamales, but no flavor. It was just too much tortilla stacked really thick. The drinks we had for brunch were subpar and pricey. I think there are better brunch places to go to.", "pics": null}}, {"review": {"des": "Nana is the sort of place I should really go more often, because sometimes simple things done really well are just as good as complicated things. A cadre of us piled in here for Saturday brunch and only had to wait around 15 minutes for a table at noon. Service could be a little spotty but the food was pretty awesome.<br><br>I started off having my breath taken away by their cocktail menu. Everything looked so good! I settled on an \"Aztec chocolate\" - a hot chocolate cocktail with Mezcal and cayenne. I was in heaven. <br><br>We also got the empanadas to start. They were pretty good, although I put too much chimichurri on mine and drowned out the other flavors. Not the best I've ever had, but certainly serviceable. <br><br>I had the Cubano sandwich for a main. Damn it was good. I don't even like pork that much and it was so damn good. The bread was soft and clearly fresh, the flavors were awesome, the meats were fresh cooked... It was great.<br><br>Finally, a friend of mine inquired whether they offered dessert. They don't even have a printed dessert menu, but they had a couple flavors of cake. She went for the pistachio rum cake. It came out looking pretty plain, sort of like something at a nice home cooked family brunch. It was FANTASTIC. Incredibly moist and flavorful. We were all stunned. <br><br>I would definitely go back, at least for cocktails and dessert. The menu may not impress on paper, but it will in your mouth.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/GfJbdud1k9d2a4pbgsfixQ/348s.jpg", "caption": "Peppermint hot chocolate pancakes"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/oYX7OJ1dHguLdtTTJByY1Q/168s.jpg", "caption": "Cubano - excellent"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/dbDWJHB6u7eaL8ExzY9vDw/168s.jpg", "caption": "Brussels sprouts - highly recommend covering in chorizo"}]}}, {"review": {"des": "Great food.  This place is a gem.  I love the decor, always clean, friendly staff. The food is always fresh, right temp.  Their homemade chicken the sausage is the best.  They use organic products and their prices are just right.", "pics": null}}, {"review": {"des": "This place is super cute and cozy. I came here yesterday for brunch and got the orange marmalade French toast. It was good, and you could tell all of the ingredients were fresh but nothing to really jump for joy about. I actually felt like the candied oranges on my French toast were overkill and that the  mascarpone didn't quite bring it home (I like more of a custard consistency rather than whipped cream on my French toast). However, I'd definitely come back when in the area because my date got their breakfast burrito and it was really good (the part I tried didn't have meat in it and it was still full of flavor). Not to mention, we saw a few plates go by that looked amazing. <br><br>The only thing hat really bothered me about this place was the teeny tiny bathroom, and sticky tables.", "pics": null}}, {"review": {"des": "Nana is an excellent place to go if you can get there early or during off-peak hours. We came here as a group of two right when they opened at 9 am on Sunday and beat out the hangover crowd! We were one of the first people in and had the opportunity to sit outside in the shade. Their outdoor seating is lovely and very \"no-frills\". Our waiter was efficient and kind without being in our way. We ordered a coffee, the plantain sandwich (a jibarito spinoff with chicken tinga and pickled onions inside) and the classic chorizo stuffed nanadict. I loved the plantain sandwich, it was the right size for the price, and came with a cup of black rice and beans. It was seasoned well and the plantain \"buns\" were freshly fried. It was probably a little heavy to order at 9 am but it hit the spot just right ! The chicken pieces were not very spicy, but had the quintessential tomato flavor typical of many tingas. The pickled onions added a nice acidic contrast and crunch to the inside. The rice and beans seemed very bland but some salt and pepper did the trick nicely. My friend said she enjoyed her nanadict, where the biscuit underneath reminded her of a piece of cornbread. The chorizo wasn't too spicy (I snuck a bite!) and her portions were also fair. The check came quickly and our waters were always filled. They don't leave a pitcher of water at your table anymore-- they just fill up as you drink. On their menu, they said \"in an effort to be sustainable/energy efficient, we always fill up your water\" or something along those lines. It was a bit inconvenient because I felt bad that my waiter had to fill up my water about seven times- I would rather they have left the pitcher with us! Our bill was $33 before tip, which was very reasonable for the quality of the food. Everything here is locally sourced and organic and the quality is apparent in the products. Definitely will be back for lunch or dinner.", "pics": null}}, {"review": {"des": "We were seated right away however no one asked about placing our order for at least 15 minutes (Strike1). Then when the waitress brought over the straws for our \"on demand only water\" she used her bare hands to stick our straws into said water(Strike 2). Good thing I was reluctant because everything was uphill from here. The food was really good & fresh. Avocado fried were an eclectic but good appetizer & the fried green tomatoes although a seasonal item only were perfect. The shrimp & oyster po boy had some great peppers & a sauce that really made the sandwhich. It's really a hefty meal in itself so no need for a side. The breakfast sandwhich was excellent. Chicken sausage wasn't bland at all like most places & the eggs were perfect!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/r9mzKo6d1Zdfcwl9TLz49A/168s.jpg", "caption": "Avocado fries"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/8RQ8TsyMh_QEu6dMVxbJTA/168s.jpg", "caption": "Breakfast sandwich with chicken sausage"}]}}, {"review": {"des": "I went to this place over a year ago. (Yeah, kinda late to post a review. I know) Anyhow, more than the food I loved the atmosphere. Great music playing, people singing along and just enjoying their time. It's not a big place so make sure to get in early if you want a spot. To be honest, I'm not a big fan of southern food. The quality of the food was good, just not my cup of tea I guess.", "pics": null}}, {"review": {"des": "The food was delicious  and service was great  place very clean and beautiful with all the painting for sale, it was great to meet Nana she one special lady, thank you for the hospitality, I will definitely come back and visit Nana when I come to visit Chicago from LA.", "pics": null}}, {"review": {"des": "Food was ok! Nothing special. The servers were really nice. Just not a very festive brunch place. I wouldn't go back. Both my friend and I didn't finish our food cause it wasn't very good and the brunch menu is limited.", "pics": null}}, {"review": {"des": "Beyond a doubt request Brieda to take care of you. Outstanding waitress.  One of the best ever.  The cauliflower salad is scrumptious! Cute place.  Nice vibe. Limited street parking and be sure to check the signs.  Surprisingly quite for a Saturday and the amazing reputation they have.", "pics": null}}, {"review": {"des": "I've been to this restaurant for both brunch and dinner. Excellent service and amazing food!", "pics": null}}, {"review": {"des": "We celebrated my daughter receiving an Master in Education here at her request. The wait staff was on top of their game.", "pics": null}}, {"review": {"des": "I love Nana! This has certainly become my favorite brunch spot here in Chicago and one that I enjoy taking visitors to try.<br><br>They've been around for years now, and for good reason. Their food is simply delicious, and you can taste the freshness of the ingredients. Nana is tucked away going south on Halstead, meaning there will be a lot more parking especially on the weekends. Despite the crowds, it is worth the wait.<br><br>I usually arrive on a weekend brunch within an hour of it opening, and have never waited more than 10 minutes for a table. By the time we leave around 13:00, there's a line out the door.<br><br>Some of the best plates here include the Avocado Fries. These are a staple, and a must have! The little bit of arugula and spicy sriracha they include turns this into a mouthwatering appetizer. I also highly recommend the Huevos Rancheros here too. They are a delight, and accompanied with the toast, make a perfect brunch.<br><br>Feeling thirsty? Definitely try one of their different tea lattes. I am a fan of the Chai or Matcha latte, especially in the Winter time.<br><br>With a fun decor, great food, and lively atmosphere during brunch, Nana will forever stay in my heart as my go-to spot here in Chicago.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/7ihkWe-XPmTTJkUxk4nssQ/348s.jpg", "caption": "Plenty of amazing Brunch items"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/HEe2B8VsEmcEPga1_0xYlw/168s.jpg", "caption": "Avocado Fries. Must Get!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/K77bsCp5-xDSsAWPGRFN_g/168s.jpg", "caption": "Irish St. Patty's Day Special"}]}}, {"review": {"des": "Nana is another restaurant that I want to eat at more than once a month:  the food is incredibly fresh.  The feeling I get from Nana is that the owners really care and this extends from small details to the style of service.  From the kitchen to the dining room Nana sets some high standards and as a restaurant professional I salute them.<br><br>The first time we ate here I had just moved and had a date with the Comcast dude, so to speak, so were a little rushed at the table.  The server handled it with grace and expedited our experience perfectly and I didn't even a chance to photograph my food, so you know I was rushing.  The second time was much more relaxed with the coffee and the green chilaquiles, homemade english muffins happening as well.  Nana is amazing.", "pics": null}}, {"review": {"des": "This place makes an excellent brunch, it's very pleasantly and tastefully put together, and in a neighborhood like Bridgeport, which is hideous and has few tastefully put together places, it's a real boon. If you can't tear down all of the ugly buildings in Bridgeport (which would leave almost nothing standing), you can at least put something attractive and delicious inside of them, and that's exactly what Nana did.", "pics": null}}, {"review": {"des": "It wasn't that bad. Just not what I'm looking for. It's been open for a few years so I thought I should try it.<br><br>My eggs Benedict was salty. The arugula didn't balance anything out with its peppery taste. Somehow the bread was salty and the runny eggs were salty. Thank god they gave us a wine bottle full of water. I needed it.<br><br>Some of the decor was cute to look at though.<br><br>Menu was small but it's a small place so that makes sense but for the price I'm paying and how little food I got, I am overall meh to this place.<br><br>Maybe I'd try brunch here but it's not at the top of my list.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/W91kjJiPe_iJTySfay08Gg/348s.jpg", "caption": "Eggs benedict"}]}}, {"review": {"des": "Amazing food, drinks, service, and ambience! Could not have had a better experience here!<br><br>We ordered the Red Sangria, Beermosa, ChickPea Frites, Huevos Rancheros, and the Nanadict for brunch.<br><br>The Red Sangria was a perfect mix of wine and fruit juice, very delicious! The sliced strawberries in there were also a nice touch. The Beermosa was very light and easy to drink. I highly recommend both beverages to accompany your meal.<br><br>When the ChickPea Frites came out, I was instantly in awe. The presentation was beautiful and the amount was plentiful! The Frites were crispy on the outside and almost like a custard in the inside, absolutely delicious. The Chipotle Honey drizzled on top was perfect with the spicy mayo on the bottom. There was also a salsa on the side that added freshness to the overall dish. <br><br>The Huevos Rancheros was also presented beautifully and everything was on top of one tostado chip. The Chorizo was seasoned and cooked perfectly, the eggs were poached wonderfully, and the overall dish was delicious. It was not too heavy from the cheese and I could not stop eating it. <br><br>The Nanadict was absolutely delicious and from one bite, I understood all the reviews about it. The potatoes were perfectly crispy and the ketchup sauce along with it added a nice tangy zing. The Eggs were poached to perfection, the chorizo was once again amazing, and the green sauce on top just made this whole experience heavenly.<br><br>Will have to be back to try to everything else!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/yZmc05nsjCYTpCPwMk2vNA/348s.jpg", "caption": "Huevos Rancheros-amazing"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/PPRavx3hUdKsku_RkJVvIg/168s.jpg", "caption": "Nanadict-perfection"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/jdgGpSTN-vk08nwAnqCkXg/168s.jpg", "caption": "Chickpea Frites-delicious!!"}]}}, {"review": {"des": "I went to dinner on a cold Saturday night in December and Nana filled me with warmth!  We were seated immediately and the staff and server were kind and professional.<br><br>I got the gnocchi and my guest ordered the plaintain chicken sandwich.  The gnocchi was a generous portion and I did not need to order the optional chicken to go with it.  The chicken sandwich was delicious and the better of the two entrees.<br><br>I can't wait to return!", "pics": null}}, {"review": {"des": "Good place to have brunch.. First time I ever tasted avocado fry.. And to my surprise it was tasty.", "pics": null}}, {"review": {"des": "Liked it. Prices are average. Food is good. Service is good. Parking is average. Nice decor for south side. Visited twice.", "pics": null}}, {"review": {"des": "Good food, we ordered the Nanadict and the Chilequiles. The Nanadict is supposed to come on a pupusa, but it was more like a sope- a little disappointing, but still good (needed salt). The Chilequiles on the other hand was amazing, it comes with a poblano cream sauce. Perfectly decadent and delicious but not too rich.", "pics": null}}, {"review": {"des": "Came for brunch and was disappointed. Love the ambiance of the place with the artwork so really wanted to like this place. After a semi long wait to put my name even on the list I was told the wait would be 30-40 minutes. I found it odd though that there was an open table for 2 right behind the hostess stand. After a few minutes I was called inside saying she didn't know where the other few waiting parties disappeared to. Yay for us to get seated! But when she took us in the back area (passing the still empty table directly behind the hostess stand) my friend and I were utterly in shock to see 4 or 5 tables that were completely open and ready for seating and several other empty tables that just needed to be quickly cleaned. Super bizarre. Why tell us such a long wait? Food wise the avocado fries were delicious but that's about it. My friend enjoyed her cucumber cocktail. We ordered the sope benedict but it was very bland and flavorless. The breakfast potatoes tasted a bit stale. Won't be going back except maybe to give it another shot for dinner.", "pics": null}}, {"review": {"des": "I ordered something different for me- I'm happy I did but I didn't love it. I would definitely come back- the place is so cute and the service is awesome. We also had the avocado fries and they were DELICIOUS! They're not getting 5 stars because my food- including my home fries weren't hot. They were kind of warm- the potatoes seems like they were made much earlier- not fresh for my plate.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ohLAJB6F24GetRzobbktTw/348s.jpg", "caption": "Avocado fries"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/A1sgH716u77Tb_pzVueUHQ/168s.jpg", "caption": "Huevos ranchero"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/cuNUarvY3cLlUbKxIISnbg/168s.jpg", "caption": "Home fries with sope and a poached egg with a ranchero sauce"}]}}, {"review": {"des": "Went to NaNa's for brunch and first off I loved the somewhat industrial design of the restaurant with the exposed brick. I ordered the Breakfast Burrito (Scrambled Eggs, Chicken Sausage (substitute), Diced Potatoes, Refried Beans, Chihuahua Cheese, Sour Cream and Tomatillo Salsa) and it was good but to be honest I was hoping for more. I would definitely visit the restaurant again however, because some of the other dishes I saw other patrons ordered looked amazing. Overall good experience with a nice staff.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/iPyNMqMcAkzmbOSsKjK1mg/348s.jpg", "caption": "Breakfast Burrito."}]}}, {"review": {"des": "Food not impressive considering it took 30 minutes to receive it. Ordered the \"grilled\" shrimp and fried oyster poboy. Shrimp was not grilled, small and were cocktail shrimps. The oysters were a mix of batter balls with no oysters or had oysters but were under fried/not crispy or not fresh. Tasted stale. Also ordered the Benedict and subbed the chorizo for soyrizo which was very bland and had to send back. The harvest salad was pretty much mostly arugula with small pieces of beets with very minimal dressing. Overall very underwhelmed in the lack of flavor/preparation. The Cubano sandwich was the only dish that had some flavor. The reason I'm giving 2 stars over 1 star is that the service was very nice and they were understanding in us sending back a dish. Disappointed that it was a Michelin guide recommended restaurant though.", "pics": null}}, {"review": {"des": "The drinks were great and the avocado fries is something to try.  We ordered a Cuban and plantain sandwich to go, but was not impressed. The sandwiches didn't have enough meat in them and only a little slaw was thrown into the box. Also, the bread was hard to bite into and for some reason was hard. I'm wondering if the sandwiches would be better if we ate them in the restaurant opposed to take out. Either way, it was a disappointment. My recommendation for a good food experience here: just sit-in and don't order take out.", "pics": null}}, {"review": {"des": "Went there for brunch today, and it was delicious. I tried both the ground beef and chicken empanadas, and they were cooked perfectly - not too spicy, but a good amount of flavor. The huevos rancheros with soyrizo had a great flavor and texture with crispy corn tortillas and savory guacamole - I had mine with poached eggs and soyrizo. Definitely recommend nana for brunch. It gets a bit busy over the weekends, so I'd get in a little bit earlier to ensure a short wait time.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/6uT_QXFtK2CV5k5MSeUsiw/348s.jpg", "caption": "Huevos rancheros with poached eggs and soyrizo."}]}}, {"review": {"des": "Best fried chicken ever! Went for Sunday Supper and we were absolutely delighted! Mac 'n cheese and rum cake dessert were pretty awesome, too!", "pics": null}}, {"review": {"des": "This place is perfect for brunch! We were able to find close parking and were seated immediately at a table for 4. The only down side was we couldn't sit outside due to the size of our party but we were all hungry so glad to sit inside! Our waitress was very prompt getting our orders and provided quick refills on the coffee and water. I had the chilaquiles which was good, but not as I had expected, it look like a piece of lasagna on the side of eggs and beans. Our table also enjoyed the breakfast burrito and strawberry rhubarb French toast - all very good! The lunch options looked tasty so we will be back again! I recommend the chai tea latte and espresso!", "pics": null}}, {"review": {"des": "Service was terrible, we ordered the skirt steak and the chicken.  The skirt steak was missing the nopales and the chicken was missing the carrots we were not informed, we waited over an hour for our food when it arrived the food was cold we are never going back. I would not recommend this place. So many other better options available.", "pics": null}}, {"review": {"des": "Lou was an amazing waiter, great at explaining the Menu & excellent energy! Thank you.", "pics": null}}, {"review": {"des": "Beautiful restaurant the decor is worth the visit. Sat down for Chilaquiles. Black beans A+, eggs prepared just the way I asked. Chilaquiles more like enchiladas in poblano sauce very tasty. Zero hot but I don't eat spicy so I loved it. I would come back. Music just right to be able to converse. Not traditional more like a trendy experience.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/kFg37BJSoeruDjnZebnMxQ/348s.jpg", "caption": "My \"Chilaquiles\""}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/7WR-A37oHeLiSm6vGOnsiQ/168s.jpg", "caption": "Clean"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/eL6q5RYLTjA0ZmIdlO66DQ/168s.jpg", "caption": "Love it."}]}}, {"review": {"des": "Went on a Sunday morning at 10:30am with three people and was seated right way. The service was great and the food came out really quickly. We shared the avocado fries and the chai french toast, and both were delicious. Would definitely recommend the avocado fries above all. I also had the chilaquiles; the sauce was delicious and the beans were seasoned well. The atmosphere is really casual and cozy. Great breakfast place, and I would definitely go for dinner in the future!", "pics": null}}]}