{"name": "native-foods-cafe-chicago-3", "reviews": [{"review": {"des": "Came here on a Sunday afternoon, there isn't much vegan friendly food in the downtown area of Chicago on a Sunday so....<br><br>It was really good. REALLY good.  Surprisingly good.   I set my expectations low, and this place went way above.  My sister and I shared food, and we ordered the Soul Bowl, the mac n cheese, and the bistro burger.   All of it was really good. <br><br>The people working there were also very friendly and helpful.", "pics": null}}, {"review": {"des": "Fish and chips tacos, why, hello there.<br><br>I was hesitant on getting the tacos because I've had a mediocre experience with vegan fish and chips in the past. I did not have high expectations but these were tasty! Coming from someone that isn't a fan of avocados (don't smite me ya'll), the tacos would have been NOTHING without them. <br><br>My side of choice was the salad and I used the salad to fill my tacos with more greens which worked out great! Three tacos were very filling. But wait, it doesn't stop there! Their salted caramel cashew cookie was incredible. All cookie proceeds go to a charity of your choice as well, but make sure you ask an associate because I totally forgot. I assume they automatically choose one for you?<br><br>I've been to this location a good number of times when I went to school in the area. I've found employees to be helpful and accommodating.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ke7PlV3kx2igyasx2lhB0w/348s.jpg", "caption": "Cashew cookie is delicious"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/RVdA2guTsSu2p7WuVZQKPA/168s.jpg", "caption": "Fish tacos and side salad"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/3dIh_8wy7o0sn5zN-sJ2bA/168s.jpg", "caption": "Fish and Chips Tacos"}]}}, {"review": {"des": "I am a member of NF and lifelong Chicagoan. I have been to 3 locations in the city, and I like the Belmont location best, they are friendly, spacious,  and efficient. However, I do NOT live nearby so I haven't been there in years.<br><br>The food is VERY convincing in tasting like meat, and the portions are generous enough where I can stretch into 2 meals. I may get the cookie when it's 'cookie for a cause' but the desserts are just ok. The 'oatmeal ice cream sandwich' and 'peanut butter parfait' are not overly sweet but kind of dense in texture. <br>This time I went to Clark street for carryout for the special 'cheeseburgerito'. The order was in the storage area for online orders. IT was great! <br>My favorites are the Soul Bowl and Rueben. They change up the menu quite a bit, you gotta try anything with 'jackfruit' too.<br>I am not that fond of the Hyde Park location, though it is where I live closest. They are almost always out of the special entree' and when I requested the 'waffles al pastor' they said the waffle iron was broken! They can be unorganized and forgetful, as Ingrid said, but the area itself for eating in is spacious and has outdoor seating.", "pics": null}}, {"review": {"des": "It's hard to find delicious vegan options around but thankfully we have Native foods closely. I absolutely love going to all vegetarian/vegan restaurants. I'm particularly impressed with NF because not only are they meat-free but they carry some healthy options on their menu. Their Bangkok curry bowl is a must try! I keep going over and over again to be able to try new things and so far I've not been disappointed. If you're going around lunch time be prepared to wait for a little long to place your order and find a table as it's super busy and crowded. I would also recommend to get one of their oatmeal pie... just so good!!", "pics": null}}, {"review": {"des": "Such a friendly and welcoming atmosphere every time I stopped to visit. The only other vegan restaurant I've tried was Chicago Diner. Even though Native Foods is somewhat a franchise, I prefer this place 100x more than Chicago Diner. <br><br>The menu has a variety of amazing choices, so it's a great food option for both vegans and non-vegans alike. The food always looks so fresh and vibrant and each dish has tons of flavor. <br><br>My favorite is the Buddha Bowl - it's sooo good!", "pics": null}}, {"review": {"des": "Not sure what took me so long to review native foods. I come here whenever I'm in the city. I'm not a vegan but I am a healthy eater so I love coming here. Great options, I always used to get the Greek gyro native bowl, and the last few times I got the native soul bowl. Sooo good. <br><br>The seitan and tempeh are made so well you really don't miss the meat in any of their dishes. They also have fresh juices like lavender lemoNade. <br><br>My recommendations: native bowls, native nachos, fries, potato salad, and please leave room for dessert!!! Those oatmeal cookie cream pies are addicting.<br><br>By far my favorite spot, I'm hoping they open one closer to me so I could go more often.<br><br>Price: bowl with dessert and side will run you about $14 with tax. To me it's worth it.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/5Y9Lzn63orlMyq7DTJz9vg/348s.jpg", "caption": "Chocolate ginger cookie"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/VhNwCTjRtvy_MuAXulX99A/168s.jpg", "caption": "Seasoned Fries"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/2nXCj5l5msBvLE97a21_yQ/168s.jpg", "caption": "Soul bowl so delicious!"}]}}, {"review": {"des": "Please my vegan friends, come visit me so I can take you here! The customer service and food were both a 5 for my friend and me! I ordered a taco salad, expecting perhaps a watered-down taco salad with a vegan \"ground beef\" with less of that umami flavor. Boy was I wrong! There was everything I could ever want in this taco salad (go the extra mile for the added price of avocado, you won't regret it). The seitan taco meat had the texture and season of that meaty, hearty ground taco meat and the romaine and cabbage had a nice fresh crispness. For some colorful toppings, there was roasted corn, green onions, cilantro, tortilla chips, and salsa fresca. The chipotle dressing was also wonderful and tied everything together. <br><br>My friend and I came here around 8pm and stayed until closing. They were so nice to us and the rest of the customers who were there past closing. The menu is so diverse in its cultural fusions. I saw Thai, Chinese, and Korean fusion dishes, as well as some Southern and American-inspired dishes. There's something here for everyone. I will take any of my vegan friends here the next time they ask me for a restaurant recommendation.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/llEENA6xXjnccp7DFiLorg/348s.jpg", "caption": "Seitan vegan taco salad"}]}}, {"review": {"des": "If your are vegan, you MUST come here! Everything on the menu is vegan. They have a huge variety and we loved everything we ordered. Fantastic flavors! I wish they had this place where we live!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/mv7AkQTrYGih2FN2XrMeHQ/348s.jpg", "caption": "Seasonal cupcake"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ejv8lpT8GLkZ9-XwbR5pAw/168s.jpg", "caption": "Rueben sandwich"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ZcegUOX4ULIqru2GIQZFSA/168s.jpg", "caption": "Side of mac and cheese"}]}}, {"review": {"des": "What a treat to have an entire menu to choose from instead of settling for a salad or plain fries...These nachos were to die for (I recommend adding the bbq \"chicken\" - the combination of spicy and sweet was fantastic.  I'm only in Chicago for a few days, but I'll probably find my way back for more plant-based deliciousness.  My only (very tiny) complaint was the size of the tortilla chips, which were so small that they were difficult to hold on to without getting messy (and who wants to eat nachos with a fork?)", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/mlm_j9Lc1LhfKyMGxDLzQA/348s.jpg", "caption": "Native Nachos with Cashew Cheese...Yum!"}]}}, {"review": {"des": "Every Time me and my boyfriend come to Chicago we make sure to stop by Native Foods! We LOVE their chicken and waffles. We've had a few things on their menu, but always crave that chicken and waffles! Their staff is very friendly, and so is the manager. A must try if you are in the area!", "pics": null}}, {"review": {"des": "My first time in Chicago and my first vegan fast food experience. I ordered poppin' Jelapino Burger with fried and a lavander lemonade drink. <br>Since I didn't grow up eating burger and fast food stuff, I could be little biased here. The burger was good. The reasons I think of it as 3 star than 4:<br><br>1. It was way too salty. I could that is what burger loving people like it salty, but to me the flavor got lost in salt. <br>2. The drink was way too sweet. It was like eating spoons of sugar with each drink. <br><br>I can understand that the Target audience is fast food loving people who would otherwise eat meat and drink dairy, I do believe reducing salt and sugar amout will add to the flavor and make the food much more healthier. <br><br>Even though I have it a 3, I would like to try native foods at other places.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/BKnnLZkp9oaMa2v7l1EmVg/168s.jpg", "caption": "Poppin' Jelapino Burger"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/eI4xsOGmq4tARILRuODMFA/168s.jpg", "caption": "So excited to try native foods at Chicago"}]}}, {"review": {"des": "Howdy. Always love NF. Thanks for the sample cookies. Very good. A bit cold in here. Actually, very cold. Turn the AC off!  Ok on to the food. Grilled chix is hot. Nice. Loved it. The Seitan Burger with Pretz bun is outstanding. Maybe a little less salt. Patty was salty a little. Not a lot, just a bit. Overall would get a 5 if AC was Monitored a bit better. I get it thou as it is humid outside but at 7 PM not a lot coming and got no thru open/closed door. Thanks.", "pics": null}}, {"review": {"des": "I have loved Native Foods for many years. I really loved their Thanksgiving shindigs. This year I noticed they stopped the Native Wellington. I saw I could order some sort of roast and still had time to pick it up on the day I was driving near their Costa Mesa store for an acupuncture appointment. Picked it up. Didn't read the ingredients until two days after I'd paid for it. Canola Oil? Are you kidding me? Tonight I finally tried a chunk of it and almost immediately had explosive gas. What a waste of money! Makes me not want to go out of my way to return to their establishment. I am tossing the rest of it into the trash tomorrow morning asap. What a waste of time and effort. Horrible. Absolutely stunningly horrible. Never again.", "pics": null}}, {"review": {"des": "The flavors here are unfortunately off-putting. <br><br>Had the nachos and the spicy cauliflower. What should be two naturally great tasting dishes ended up just... weird. <br><br>The nachos had a nice looking cheese sauce - that was so sweet it was hard to stomach the dish. Without this sweet sauce/cheese/whatever it was supposed to be - the nachos would be delicious. <br><br>Even worse was the cauliflower. Those were completely inedible. They were in some type of spice that I couldn't stomach.<br><br>Dating someone that's vegan - I feel really bad for this place. For both these dishes, it isn't that much of a stretch to pull off some amazing flavors. Such a shame that this vegan place can't do it justice.", "pics": null}}, {"review": {"des": "I love Native Foods, and as a vegetarian working on the south side, there arent a lot of options for a tasty lunch that actually has some non-meat protein. I've ordered from this Harper Court location numerous times, and at least half the time the food is not prepared correctly. Usually they leave toppings off. I've had a veggie burger arrive to me with nothing more than a bun and patty, and today got \"nachos\" that were missing all the toppings included--beans, corn, and onions.<br><br>Clearly the kitchen is not staffed or trained properly, or they are just lazy. No one in the front is checking the orders are prepared correctly before delivery drivers or customers pick up the food, and when you have an issue, there's almost no recourse.<br><br>Get it together Native Foods Hyde Park. I'm disappointed and hungry. (And out $15 on that messed up box of chips).", "pics": null}}, {"review": {"des": "Wow - the service at this location is TERRIBLE. We arrived during lunch and placed our orders. 10 minutes later one person in our group gets his food but the rest of us don't. Time goes by, servers ask us what we ordered about 5X. Finally after the 5th time someone asks us what we ordered, my other friend gets very irritated and goes to the counter we placed our food at to ask what is going on. <br><br>They basically lost our orders and said to wait because they need to prepare other customers' orders first. We were there waiting way before any of these people arrived.  Extremely rude. <br><br>Additionally, they had given out two of the same numbers to people who were dining in and kept getting confused as to who certain dishes belonged too. Very poor orchestration of delivery.<br><br>Overall, the food was okay. Nothing great, but I think vegetarians would appreciate this place more. They offer plant based proteins like chicken and sausage. Its an interesting concept to me, but definitely not my cup of tea. <br><br>Everything here is completely vegetarian, it is a little confusing to recognize that fact until you read at the store it literally says \"100% plant based\"", "pics": null}}, {"review": {"des": "This is fast food. Average veggie burger that is much hyped and not very exciting. Crappy McDonald's like dining. Not impressed.", "pics": null}}, {"review": {"des": "Unlike the other Yelp reviews I was very disappointed in my visit to Native Foods. <br><br>I expected there to be a creative vegetarian menu selection to choose from. Instead the menu was overloaded with carbohydrate options. I ordered the buffalo cauliflower and brussel sprouts and even the brussel sprouts were breaded. Both dishes were overcooked and UNflavorful. I don't think anyone would leave this restaurant and decide to convert to being a vegetarian. To me the food was that bad.<br><br>The customer service was also disappointing. When I arrived, apparently there had been a large party ahead of me. The large party was seated and their order had been placed. The cashier seem to be overwhelmed and told everyone in line that it would be at least a 20/30 minute wait on food orders because of the large party. I asked if we decided to wait if we could have a free fountain drink or something to compensate for the delay. She said \"No.\" When I ask to speak to the manager, she said she was the manager. I was shocked she didn't have the foresight to accommodate the customers waiting in line.<br><br>Since I had come a ways to get there and was hangry, I thought to be optimistic and hopeful that I would receive my takeout order within a 20-minute period. I did, however, looking back I probably should have considered coming back another time.<br><br>While waiting 20 minutes for my order I noticed the restaurant was just unkept. Tables were unclean, chairs were in the middle of the aisles rather than being pushed up near the tables. The whole vibe of the restaurant was just bare and sparse and unattended to. <br><br>At any rate, the menu selection was a turn-off and the customer service was too.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/_YBS7mfhAUs5iHLsKk5nqw/348s.jpg", "caption": "Wasn't worth the wait."}]}}, {"review": {"des": "This was my first experience in vegan foods. I wasn't sure what to expect. They have lots of choices and make things look like regular food but at the end I was disappointed. The food had little to no flavor. I tried adding hot sauce but it was still bland. I had the Baja tacos and it was just ok. I could tell the difference. I agree it's healthy but I guess I am not ready to go vegan yet.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/HDT2XYUhnWKtFBHue-HFQQ/348s.jpg", "caption": "Bama Baja Tacos Gluten Free"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/oVNabXNl6QAnAPkr_LYzxg/168s.jpg", "caption": "Thank goodness for fries!!"}]}}, {"review": {"des": "1st time visit to Native Foods. Was really excited to try the Jamaican Jerk Wrap made with jackfruit. Unfortunately, the pineapple chunks overpowered the other ingredients. I would give the flavor profile only 3 stars; ingredients were fresh. To a cookie and cupcake to go; they were good. Will visit again during my trip and try other items.", "pics": null}}, {"review": {"des": "I veered into the downtown area after the March for Our Lives demonstration today and had to try this place.  For a late lunch I had their \"BBQ chicken salad\" (totally vegan, of course), which was amazing... along with a black cherry soda.<br><br>After a few errands I came back and managed to squeeze in a \"chickpea tikka masala\" for an early dinner... also delicious and satisfying!  <br><br>There are so many other items I'd like to try.  I hope I get down to the Loop again eventually and stuff myself with this wondrous chow!<br><br>When I got home, I texted my dear friend (the remarkable mind behind  <a href=\"/redir?url=http%3A%2F%2Fwww.plantbasedbilly.com&s=344b5287ea6ad01fe05f66a33fcac75ff080bb15e6c309afa08f71af000fbca1\" target=\"_blank\" rel=\"nofollow\">plantbasedbilly.com</a>) and turns out he loves Native Foods Café, too!  Of course, he would!<br><br>:-)", "pics": null}}, {"review": {"des": "This place is easily in my Top 3 Favorite Vegan Places! Amazing People and Food! The flavors were amazing, I highly recommend!", "pics": null}}, {"review": {"des": "Seriously, I didn't know this place was vegan the first time I ate there. I just thought it was a health food place and I ordered the soul bowl. I have really high standards for fried chicken and I was totally fooled. I went with a coworker who had a chicken sandwich which was also delicious. I was shocked because I thought she didn't eat meat. When I returned to the office I was told everything there is plant-based. It took me a while to recover from the initial shock and then I started going back as much as possible and ordering different things to find something that is a terrible excuse for meat and to declare my victory over all vegans. It hasn't happened. In fact, the great food encouraged me to go vegan for a month and overall I've greatly reduced the amount of meat and dairy I eat. My favorite menu item is the orange cauliflower. The funny thing is I don't even much like cauliflower but deep fry it and douse it in orange sauce and I'm there. If you only go in for their lemonade, you won't be disappointed. The fresh fruit blends are just amazing. Whether your a vegetarian or just trying to eat healthier, check this place out! My only complaint is that the price is a bit high for the amount of food you get but I suppose the ingredients are more expensive.", "pics": null}}, {"review": {"des": "It's just native food cafe. The chain store. The food is standard to me. I had the Thai meatball plate. That was a big plate actually, I couldn't finish it. The 'meat ball' starts to fill up. <br><br>Service was good here. Nothing much to comment about.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/EZCVybMp8HB1ynrLe_cQAQ/348s.jpg", "caption": "Thai meat ball."}]}}, {"review": {"des": "They get quite a few points for being one of the few places in the area that's open late and also on the weekends. Native foods cafe is vegan, and they have a variety of hot food offerings as well as some pretty good vegan baked goods.<br><br>The food offerings have been alright - some are pretty good, like the southwest burger with guac, and others have been pretty bad. The two times I've ordered the soul bowl they've both been disappointing. They slather the bowl in ranch and barbeque, and it somehow still manages to be bland. There have been quite a few times when my vegetables were pretty undercooked / very hard. Their \"native\" meats, which I think are made from seitan, are pretty good textures and usually come breaded and deep friend so it's pretty passable. <br><br>Tables don't seem like they are regularly wiped down. However, service is always very friendly and attentive.", "pics": null}}, {"review": {"des": "I ordered the nachos with bbq chicken and the Thai Brussel sprouts. So delicious! I cannot wait to go back and try other things on the menu.", "pics": null}}, {"review": {"des": "This place was sooooo good! I recommend it to vegans and non-Vegans. I am a vegan however my boyfriend is not and he loved the food we ordered. Everything was very tasty. If we ever come back to Chicago for another visit we will definitely be eating here again.", "pics": null}}, {"review": {"des": "I was here a few weeks ago and had an AWESOME philly cheese steak.  (I am 45 year philly native - I know cheesesteaks!  Probably why I went plant based/vegan)   My cousin who lives in chicago knows the owner of this specific spot and recommends it highly. <br><br>This visit I had the spicy cauliflower, very nice! And then for a main the Portobello Jibarito sandwich which was wonderful and flavorfull!!  The plantain bread was a great gluten free option.  <br><br>The watermelon fresca for a drink and finished with the peanut butter ice cream sundae.  Oooh boy nice ending!!!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/FRA-vWXSE8Iq1TEhALclTw/168s.jpg", "caption": "Portobello Jibarito - backened portabella sandwich two pieces plantain  \"bread\"  chimichurri aioli, avocado arugula,"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/f54UNhwG2cGBn8NnyO8yLw/168s.jpg", "caption": "spicy fried cauliflower - fiery Korean gochujang chili sauce."}]}}, {"review": {"des": "A great option when you're craving vegan/vegetarian comfort food! I'd come here more often if it wasn't so far from my job. <br><br>I've had their chicken sandwich and soul bowl and both were great. The soul bowl comes with their special chicken, veggies, beans, rice and a side of their cornbread. It's a lot of food but it doesn't leave you feeling lazy after and I think it's decently priced.<br><br>My only complaint is that during the lunch rush hour it gets a little hectic, so expect to wait a bit before they bring your food if you're eating there. I waited about 20 mins for my order, but the server explained it was because of a mix up with the order number I was given. I didn't mind and she was nice about it. For those who only have a set amount of time for lunch, though, pick up may be the way to go.", "pics": null}}, {"review": {"des": "Came here after finding it on Yelp as a vegan restaurant. They have a ton of options, so it's great! I wanted to try the vegan nachos but I decided with the Bangkok Curry bowl. I wasn't a fan of the tofu because it was kind of bland, but I love veggies so that was good for me. Next time, I would probably get the wings or tacos or something interesting like that!", "pics": null}}, {"review": {"des": "Our daughter was so excited on our recent visit to Chicago when she realized all of the vegan options available! We ate at Native Foods Cafe twice and loved it each time! We tried the chicken salad wrap, Baja tacos, Mac and cheese, potato salad, jalapeño burger and bacon avocado club. All were excellent! But our very favorite were the crispy buffalo wings! They were to die for as well as the ranch! Had to get dessert to go. Yes, we ordered a lot but when you find such a great all vegan option, you live it up!", "pics": null}}, {"review": {"des": "OMG! Im a vegetarian trying to get to vegan. This place makes it easy. We just drove in from Columbus Ohio and looking for a place to eat.<br>So glad we found Native foods. I ordered the chicken bacon avo club. Great taste and honestly no matter whether you were trying to find vegan or not you will love everything on the menu. My one daughter had the reuben and the other soul bowl. Wish we could have kept eating. Portions are large. <br>Please come to OHIO:)", "pics": null}}, {"review": {"des": "Blahhhh.<br><br>Came for a quick Saturday lunch and was not impressed. The service was crazy low and I waited way too long for COLD nachos. The nachos were pretty plain considering and sweet, which is odd for nachos. This should have been in the description. <br><br>The place is kind of dingy and dirty too. I also HATED their menu board. You can't see it while you wait so they have paper menus you can look at, waste of paper and also, how many people have touched those?! Not a fan at all of those menus. <br><br>A big pass for me and will not be visiting again.", "pics": null}}, {"review": {"des": "What an excellent experience! As a vegan from a town without many vegan-only restaurants, I was thrilled and overwhelmed by all of the options here. It was a busy lunchtime, but the service was great and so friendly. My food made it out quickly and was delicious. I had these incredible nachos as well as an oatmeal cream pie and would highly recommend both. I felt the prices were reasonable for the quality and novelty of the food. I know this is a chain, but hope to come back the next time I visit Chicago or perhaps find one close to Alabama some day.", "pics": null}}, {"review": {"des": "Seems like a popular vegan place. They have a lot of fake meat options - like chicken fingers and burgers. I tried their mac and cheese. It was pretty good. Although the cheese had this off aftertaste that tasted sweet yet tart at the same time. Their fries are pretty good - skinny fries. Not a huge fan of the seasoning though.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/CDxw1lrP11oRfj_SDxxO2Q/348s.jpg", "caption": "Mac and cheese with fries"}]}}, {"review": {"des": "My food had so much potential. The sausage mushroom sandwich situation was tasty but my issues with it were: the sausage patty is thin and tiny and they only give you one, the cheese is tasty but not melted enough, the mushroom was soggy. <br><br>       The bread is delicious, the components of the sandwich work in theory but it wasn't executed properly. Double up on the sausage to compliment the bread to meat ratio. The mushroom was thicker than the vegan sausage and that didn't work for me. I feel they should double up on the patties or create a thicker patty altogether. It was my first time here and I had my order picked up/delivered so I didn't know what to expect. But the chocolate chip cookies were five star.", "pics": null}}, {"review": {"des": "The worst veggie burger I've ever had. <br>Ordered a cheeseburger no mayo. Got a burger no cheese, with mayo. The \"meat\" honestly looked like a dried pile of turd & didn't taste much better. <br>Service was slow and place was dirty looking. <br>Never again!", "pics": null}}, {"review": {"des": "So, I went there after the Chicago Marathon but it was not a good experience. The location is good but the food is below average. The fries came stone cold and not fresh! I sent it back and they put it in a oven and brought it back. Come on! it is 2018 and downtown Chicago. How you cannot cook fresh fries. Also, the hamburger was similar...", "pics": null}}, {"review": {"des": "Loved the copious selections of freshly made daily vegan fare and even some GF options for me! I had the baja tacos (generous portion of three) and a side of seasoned fries with some plantain chips and dip to start. I should have skipped the fries cause they're hard to stop eating!  <br>They do a nice job of providing fast good-for-you food and you can get a glass of wine (cider or beer too) as well.... was close to our hotel so we walked there but parking is available assuming you can find it on the street.... very brisk business!", "pics": null}}, {"review": {"des": "Seriously two words: Brussels sprouts. Flash fried, and then seasoned in a sweet chili sauce and cilantro sprinkled on top. Need I say more? I will. The tacos are amazing and even though the guacamole is an extra $1.99 it is so worth it the servings are very generous.  Don't bother with the fries, seasoned well, but there 100 other things on the menu that would be better.<br><br>The wine is probably the cheapest on the block, which I was very happy to find out. Staff is friendly and happy to offer their recommendations.<br><br>Worth a trip!", "pics": null}}, {"review": {"des": "I was so happy to find a vegan fast-casual restaurant that was not too pricey or pretentious. There are tons of vegan options from salads to noodles to sandwiches. I had the vegan Chicken Bacon Avocado Sandwich with sweet potato fries and it was delicious. If you download the app you get $5 off! Can't wait to try more options.", "pics": null}}, {"review": {"des": "Yeah.....it was imperative that I update my initial review. 1 month ago the food was fantastic...as you can see in my first review. I was dreaming about that burger for weeks! Last weekend I decided to drive from my home in INDIANA all the way back to this location for the delicious jalapeno crunch burger and fried cauliflower. I ordered my food like an excited school girl and waited for my food to be delivered to my table. When my food arrived a small tear left my left eye because I was so happy! Lol! I took my first bite of my cauliflower....and it was soaked in too much buffalo sauce and tasted precooked and just warmed up. I was very disappointed. I just shrugged it off and took a bite of my burger....and the bun was burnt. Badly. Plus my mushrooms I ordered as an add-on was missing. I called the waiter over and he took my plate back and returned with a new burger. IT. WAS. NASTY. Extremely nasty. I was sooooo hurt. I took 2 bites and refused to put more of this food in my body. I told the manager and he graciously refunded the burger...but not the additional money I paid for the avocado or mushrooms that was on the burger. I was not happy after driving 1 hour just for this restaurant. My hope is that Native Foods trains ALL of their chefs TO COOK THE SAME. This is not an inexpensive place to eat and going home to only cook dinner because your food wasn't good enough is very disappointing.", "pics": null}}, {"review": {"des": "I normally love Native Foods but this location just wasn't my friend I guess. My order took forever and then it showed up in a to go bag when the ticket is clearly labeled for here. That would have been fine if the food was hot and fresh. But the fries were cold and soggy and the Chicken, Avo, bacon sandwich was barely luke warm. The only reason it gets two stars instead of one was because the pretzel bun was the best and the chipotle sauce( which is my absolute favorite) made the fries not so terrible. I work down the street so I will most likely return and hopefully will be able to update with a better review.", "pics": null}}, {"review": {"des": "Disappointing to say the least. Why is it so hard to find good quality vegetarian / vegan food? <br><br>I ordered the sesame kale macro bowl and the portobello bourguignon stew, and both were pretty average. The portobello stew only had about 3 tiny pieces of mushroom, and just filled with potatoes and carrots. The tempeh in the sesame kale macro bowl was so very underwhelming - not seasoned and basically a pan-grilled piece of tasteless cardboard. The steamed kale and brown rice did nothing for the dish, and left me struggling to eat it all. The two tastiest parts of the dish was the sauerkraut and the cucumber and seaweed salad - and it was a shame there wasn't more of each!<br><br>The one redeeming feature of my visit was the drinks bar - I just couldn't get enough of the watermelon fresca and lavender lemonade.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/lhhl9pg-FacVTRWll1fNeA/348s.jpg", "caption": "Sesame kale macro bowl with side seaweed and cucumber salad; portobello bourguignon stew"}]}}, {"review": {"des": "The guy at the front was super nice and the food was good. I got the chicken bacon ranch sandwich and my bf (meat-eater) got the double cheeseburger. He enjoyed it, and my sandwich was amazing! Too bad it made me burp and feel really full for hours on end. But, that's expected when eating fried foods. <br><br>They have a lot of homemade desserts up at the front that look delicious.  :) We tried the brownie and it was awesome!<br><br>Thanks Native Foods!", "pics": null}}, {"review": {"des": "Soooo good! I got an orange cauliflower bowl and a peanut butter brownie. Pictured are my half eaten bowl and my sisters brownie in a cookie (also delicious). The unsweetened blueberry hibiscus tea was super tasty as well. This place has a ton of options and calories next to the items on the menu. 10/10 recommend. Download the app for $5 off.", "pics": null}}, {"review": {"des": "Amazing food. My go to spot when I'm in town and they switch up their menu seasonly with new surprises and keep upping their game. Each time I come to town I'm loving the new stuff they add and the direction they're headed. Much improved since when I first visited in 2016.", "pics": null}}, {"review": {"des": "I've been coming to Native Foods a long time, and the food is always good, so I'm bummed I'm writing my first not-so good review. I ordered the reuben sandwich for the first time, and it took a half hour to come out, and that was only after I asked about it. It came out cold, sloppily put together (there was no sauerkraut or dressing on one half), the bread wasn't toasted at all, and the plate was dirty. Overall, not the best experience I've had here.", "pics": null}}, {"review": {"des": "Overall impression: if you want a quick, healthy, no-fuss lunch, this would be a good spot to come to. <br><br>What I liked most about Native Foods was how filling their lunch was. I had a curry bowl with brown rice, tofu, and a few different veggies. The flavor was so-so and could have been a little more vibrant. The brown rice was undercooked (stuck to my teeth, a bit crunchy) and the tofu was overcooked (again... stuck to my teeth, a bit crunchy). If I were ever in Chicago again I wouldn't rule this place out, but I would certainly get something that was more likely to be cooked correctly (maybe a veggie burger or noodle dish?). I also had a lavender lemonade that was really sweet and really tasty. Great price and it came with free refills, so that was a pretty big plus too.", "pics": null}}, {"review": {"des": "The food is pretty good, but both times I've ordered here there has been toppings missing from my food.", "pics": null}}, {"review": {"des": "I had the Ruben and it was so good it made up for their poké not being much better than a house salad at a hospital cafeteria. I also had the oatmeal sandwich cookie and it was prob on of the best I have ever had. The frosting was not just a sweet mess and  has a uniquely delicious cream cheese flavor and texture. The ambiance is hectic but that fades away as the food starts to play its tune in your mouth.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/MBtDFZwY-94HBvPofl8J6g/168s.jpg", "caption": "Nachos"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/crlQK8OoARvCJizldPpvtQ/168s.jpg", "caption": "Rubin"}]}}, {"review": {"des": "Very colorful and convenient location! Great menu variety. I'd almost given up on NF after trying the location in HP but this location has come in handy during my 30 day meatless diet. The food at this location taste way better (fresher).  I ordered the southern fried chicken and waffles and it was well worth it! I will definitely be back to try out the other items on the menu!", "pics": null}}, {"review": {"des": "This restaurant has the worst service they put hair on your plate white manager has nasty attitude they have to fire her for ignorant racist.", "pics": null}}, {"review": {"des": "Definitely the worst Native Foods I've ever been to and I have been going for years. They have three cashier positions with one cashier servicing the people, with the line nearly out the door. Came in and order the food for carryout, and sat there waiting far longer than most of the people that came in for carry out. The staff completely ignored me while I sat there, so I decided to stand to draw some attention and they still manage to ignore me. After asking a waitress where's my order she said it was coming right up, it was next. But it wasn't I had to wait even longer. I will never go back there. The service sucks!", "pics": null}}, {"review": {"des": "I came here with my family (a group of about 8) on Good Friday before we went to a play. Most of the family is vegan besides about half of us. Because we always go to restaurants that don't offer many vegan options, we decided to go to this restaurant! Now, for those who don't know, this restaurant is COMPLETELY vegan! So if you order the \"buffalo wings,\" that's right! They're meat free! Same with the bacon and burgers and Mac n cheese. Absolutely no animal products. <br><br>I was very skeptical coming here. I've been a meat eater my entire life but I'm definitely not against the vegan lifestyle, I was scared and excited to try their dishes. <br><br>My boyfriend and I ordered their \"ground beef\" nachos and they were DELICIOUS! Tasted exactly like meat! We also got their buffalo wings that had a texture similar to real chicken! <br><br>For our entrees we both got burgers, I can't exactly remember the names but they were both delicious! <br><br>For dessert I got a double chocolate ginger cookie which was honestly probably one of the best cookies I've ever had and my boyfriend got a brownie.<br><br>I would definitely come back again even though I am not vegan! It was a great experience. <br><br>The prices were a little expensive but you have to remember that you're paying for real, great food.", "pics": null}}, {"review": {"des": "Oh, how I love this place. I discovered Native Foods via some food bloggers and put it on my to-do lost while visiting Chicago this week.<br><br>I had two different bowls, on two different days...and a huge cookie. Hands down, some of the best vegan bowls I've ever had!<br><br>Way to go, you guys are amazing. Fast, fresh and delicious....you definitely did not disappoint!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/XBp1SuW9s8MylGIGABxK0w/348s.jpg", "caption": "Soul Bowl-best cornbread I've had in a looong time!"}]}}, {"review": {"des": "Service: 5<br>Food: 5<br><br>Not much of a vegetarian but for the price this is gd. Tried the portelli burger and raw salad, both were good. Waitress was attentive,  made sure we had everything we needed", "pics": null}}, {"review": {"des": "We were super excited to try out here based on the reviews. Hugely disappointed with the quality of food! The rice in the Tikka masala was extremely dry. Also tried the spicy cauliflower that almost tasted too tangy and spicy and we could hardly finish anything. Won't be surprised if we end up with an upset tummy tonight.", "pics": null}}, {"review": {"des": "This is one of my most favorite vegan restaurants and it's a chain. I have yet to try something I don't like. This place has an extensive menu, great desserts and friendly staff. I had the \"fish\" tacos- so good, might be my favorite!", "pics": null}}, {"review": {"des": "We ordered from here through amazon restaurants. Unfortunately, their menu is not accurate so they called to tell us one of the items wasn't available so we had to choose another sandwich. I was pretty upset, but I stayed positive. We got a bbq burger and avocado chicken sandwich with fries and nachos. The bbq burger was really good, definitely itched that burger scratch. The nacho cheese was delicious, but was a little soggy from the commute I presume. Hopefully I will get another opportunity to eat here again.", "pics": null}}, {"review": {"des": "We really enjoyed our meals. I wish we had one of these near us in CT! My husband was thrilled to be able to pick ANYTHING off the menu, which is a rarity. We ordered lunch and dinner to go and all 4 meals were really astounding. We loved them. Especially for a \"fast\"ish type food place. And the lavender lemonade is phenomenal. Truly wish they would open one in ct.", "pics": null}}, {"review": {"des": "Ok, let me just put it out there, I am not vegan. I went here with my cousin, who is vegan, for some dinner randomly. She couldn't stop raving about the chicken and waffles and bruh it is pretty good! I aint lion . You gotta eat it with the sauce because it tastes good with it! I got some bbq burger it was decent, I was not WOWed by it. I also got the buffalo cauliflower because I love cauliflower in general. And let me tell you I was not disappointed at all and the ranch that goes with it?! Mm-mm gooooood! I also tried the watermelon fresca juice, yoo pretty tasty. Overall, chicken n waffles and buffalo cauliflower were FYE . I'm not vegan and I was pretty satisfied!! I can't wait to try other selections on the menu.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/9PsmQ3vuHoVw1HZSyZO7vw/348s.jpg", "caption": "Vegan for a night!!!"}]}}, {"review": {"des": "I will preface this review by saying I am not vegan/vegetarian, but I have come to like well-flavored tofu in the past few years.<br><br>I had the Moroccan bowl, and it did not do it for me. The quinoa was good, and the raisins and almonds added a nice touch. Although the vegetables appeared grilled, they did not have much flavor. Neither did the tofu. The menu says the tofu was marinated in moroccan spices, but it did not taste like it was marinated in anything. And who likes plain tofu. <br><br>There was a sauce that was drizzled on top of the dish, but there wasn't enough of it and, even if there had been more, the tofu and vegetables probably wouldn't have absorbed it in such a short time. Had the ingredients been marinated in the sauce, the dish may have been much more flavorful.", "pics": null}}, {"review": {"des": "BBQ Jackfruit sandwich: way too much bbq sauce on it that the sandwhich just breaks. The sauce was overpoweringly sweet that I could not finish it. The coleslaw on it is weird and spicy..did not compliment it at all. I felt nauseous afterwards.<br><br>Spicy cauliflower wings: so this is supposed to taste like korean gochujang wings but it does not. It's more spicy than sweet but the ranch does help. The wing itself was crispy and \"tender\" but the sauce was again a fail. <br><br>The only great part of this meal was the sweet potato fries. They are so so good and crispy. Even better with the chipotle sauce.", "pics": null}}, {"review": {"des": "Pretty decent for an all no meat place. It was kind of hard for me to find a menu as a first time diner here, but once I snagged one I ordered the soul bowl. You order and sit down and they bring it to you. <br><br>It was yummy, I don't really remember what was in it but it was very plentiful for the price. I really dug the tea options and free refills. The dude forgot my cornbread but I bugged him and it arrived. It was pretty dry and bland.<br><br>I'd recommend Native Foods if you're looking for healthier alternatives in Chi town (hot dogs and deep dish, amiright?) in a fast casual setting.", "pics": null}}, {"review": {"des": "This is why people think vegan food is boring/bland. :(<br><br>Not sure if I was here on an off day or what. My Curry Bowl had almost no curry sauce. Oh joy, plain steamed vegetables... and mostly carrots. When I asked for more curry sauce they said no problem, but when I mentioned there was hardly any to begin with the reaction was a look of annoyance. Also, there was a grain of completely uncooked hard brown rice in my dish (ow, my teeth!), but I didn't bother to mention that. <br><br>There were a lot of regulars who received warm welcomes, which was sweet to see. But unless they're getting different food than me, not sure why they'd come back.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/dwab6MgD2yFGiR-uqo7blg/168s.jpg", "caption": "My extra curry sauce, and the hard uncooked grain of rice I bit down on."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/DV-wwQRGxIiF98OW5fiVrQ/168s.jpg", "caption": "Curry bowl... where's the curry sauce?"}]}}, {"review": {"des": "Love coming here when I'm in the city!!! All the food is yummy and employees are very friendly. Very clean.", "pics": null}}, {"review": {"des": "Pretty good for a vegan place. I had the \"burger\" on the menu and it was very tasty. The flavor was pretty good. It's like the difference between getting baked potato chips vs the fried one. <br><br>It is expensive but for vegan good it is pretty good. The drinks are on point and free refills. The watermelon fresca tastes amazing.", "pics": null}}, {"review": {"des": "I really liked this place. Great vegan options! Their drinks were amazing and extremely refreshing! The food was a little bland. I packed some hot sauce and was glad I did because it was definitely needed! I would go back and try different things.", "pics": null}}, {"review": {"des": "I ordered the vegan nachos and picked them up at a later time. They were ready when I arrived. Nachos were good. And tasted sweet for some reason. Not bad for $6. I had previously had their vegan chicken wings from another location. Those were ok.", "pics": null}}, {"review": {"des": "Healthy, tastes good, same price as other things in the loop, good service (most of the time), what's not to love?<br><br>Went with a group of 6, and food came out pretty quickly (except for 1 dish, and then just a side of french fries I ordered later)  Sweet potato fries and regular fries both good and do not need any sauce (sweet potato fries ruined by ketchup, regular fries just better).  Soul Bowl good portion, bbq sauce smelled and tasted wonderful, paired well with ranch sauce, bit too many beans dulled down the taste a bit, chicken had the texture and taste of seasoned chicken, cornbread was pretty dry.  Portobello-sausage burger devoured quickly.  Moroccan Bowl just bland, sure it's healthy but it also has not taste, skip.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/_N7zUwjqf9TLkb83FibtAg/168s.jpg", "caption": "Soul bowl"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/thSIcZcLqTbDrYzUhlP-Xw/168s.jpg", "caption": "Portobello burger with sweet potato fries"}]}}, {"review": {"des": "I don't usually go for vegan stuff, but the stuff here is pretty tasty.  They certainly are creative with their menu: the first time I went here, I didn't know it was vegan-only and really thought I was eating meat.  The menu is borderline misleading in that way.", "pics": null}}, {"review": {"des": "I really enjoy Native Foods. When I first decided to be vegan it was a definite go to. Now that I've been making my own seitan and cashew cheeses I've realized how overpriced their restaurant is. The food is amazing but I would suggest The Chicago Diner if you want more bang for your buck.", "pics": null}}, {"review": {"des": "As newly minted vegetarians we were excited to find this place close to where we were staying. Plenty of tables, nice lighting. <br><br>I ordered the Buddha Bow and hubby the Sesame Kale Macro. We also shared the plantain chips. <br><br>Everything was very delicious and a good portion. I wish it would have occurred to me to substitute the jasmine rice for quinoa (Sire they would have done this), but that's not the worse of things. The Buddha bowl had a spicy kick to it. The Sesame kale a brighter fresh taste. The plantain chips were great although it would be great if they would substitute the canola oil with coconut oil!  Hint hint!!<br><br>Overall happy to have found this little spot. Would have enjoyed finding it sooner so we could have tried other things!", "pics": null}}, {"review": {"des": "Great place. Delicious food!<br>I went there yesterday and had a BBQ burger and the wings... and it was delicious!!! Can't wait to go back!!!", "pics": null}}, {"review": {"des": "I finished my first week of Insanity before my visit to Chicago, knowing how much crap I was going to stuff my face with. But hey, you gotta somehow find a way to balance out the junk food. <br><br>My eating habits had been out of control during my stay in Chicago, so I thought I'd begin eating clean again, starting with my last meal in Chicago.<br><br>I freaking love this place. I've been to many vegan restaurants and eateries that are just downright pretentious, but Native Foods was nowhere near any of that. If anything, this is a no-frills chain for vegans who don't like fuss. <br><br>The cashier recommended the Greek Gyro Bowl, so I went with that, slightly concerned about how they can pull it off as a bowl and without meat, since grilled meat, tzatziki sauce, and pita bread are the most essential components of a gyro. I was proven wrong--it was delicious. I had mistaken the seitan for meat, but it was excellent, as well as the lemon-garlic sauce and hummus. The portions were extremely generous and full of nutritious veggies, like kale, zucchini, carrots, and cauliflower. I wouldn't say there were any real Mediterranean flavors, but it was a very flavorful bowl that can probably last you 2 meals, plus it was not terribly expensive ($9). Come here hungry because you will get a lot of food for a reasonable price!<br><br>It's a shame that Native Foods closed their D.C. locations because I've just discovered this place and I can't wait to visit another Native Foods soon. I'm not vegan but I do try to eat as clean as possible and I highly recommend this place if you do, too.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/qcksykyL3o_MJBS5YHmNWw/348s.jpg", "caption": "Greek Gyro Bowl"}]}}, {"review": {"des": "In my opinion, This restaurant was to dirty for me to really enjoy. I gave it 2 stars because the \"Native chicken \" had a great texture and taste. My husband had the double cheeseburger. He said it was good but he was hungry very soon afterward, so it didn't stay with him long. If we return to Chicago, we won't plan on returning to this restaurant.", "pics": null}}, {"review": {"des": "I had the azteca salad and it didn't have much flavor at all.  The romaine lettuce in the salad was brown.  I don't know why the line is so long at this place.  Also, if this place is considered \"healthy\" why do they not publish nutrition facts/calories of their food items?", "pics": null}}, {"review": {"des": "I must not be a fan of the vegan dairy substitutes because my visit to Native this time wasn't great either. I had a girlfriend with me this time who also didn't enjoy her order. This was likely the last time I will go to Native.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/SCqHBMMrFhvGZXW1-9Zfqg/168s.jpg", "caption": "Native Chicken Wings"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/LrI_cA7QVXEYNSOHI8ZvKg/168s.jpg", "caption": "Native Nachos"}]}}, {"review": {"des": "Like most chain restaurants, sometimes you get great service and sometimes it's not so great. The food itself was fine, but it wasn't necessarily out of the box, especially compared to other Chicago eateries. Flavorful, simple, and with a somewhat standard menu that you can find throughout he chain, it was an okay choice for a quick lunch.", "pics": null}}, {"review": {"des": "Being newly 100% veg after 8 years of being a pescetarian, I was super excited after reading the reviews that vegans, yes, vegans, can have JUNK FOOD TOO!! And let me tell you, this place is on point. AND THEY HAVE WINE! I brought my non-veggie friend who has probably never NOT had meat with a meal in his entire life, and he actually enjoyed the food here (almost) as much as I did. We both had the native chicken, bacon and avo club, and shared a small order of the native chicken wings. The staff was incredibly fun and warm, loved the whole \"feel\" of the restaurant, and the establishment was clean.<br><br>Seriously cannot wait to stop in here again next time I am in the area. Perfection!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/RM8hWSUOzdHsfbRVJEvDeA/168s.jpg", "caption": "Native chicken wings ... Yuuuum"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/BCnFRQH_M8m9pwETCmzEzw/168s.jpg", "caption": "Native Chicken, Bacon and Avo club (perfection)"}]}}, {"review": {"des": "I don't really have a lot to add to what other reviewers have said since this is my first visit since I am just passing through.<br><br>I was looking to get nutrients today, so I came here and ordered the 01 burger withsteamed kale on the side.  Mission accomplished.<br><br>The burger was really outstanding, not sure what it is made of but with all the failed burgers out there, it is really clear that the owners of this place worked tirelessly on their recipe over a period of years and honed it to perfection.<br><br>In case you didn't get this from reading the other thousand reviews, the restaurant is not a conventional sit-down format, but you order at a counter, then they give you a numbered sign which you put on your table so they can find you when your food is ready.<br><br>I had read all the reviews about how the cashiers can be snippety, but I found that if you read the menu first and decide what you want before getting in line, your order process will go smoothly and any element of soup-[Civil-Rights-Challenged-20th-Century-European-Reactionary] will be minimal and you can just get your food without drama.<br><br>It is possible that the reason the cashiers get potentially snippety is because there are many good options on the menu and people have a hard time deciding.<br><br>The customers who came in behind me were a young couple, the young woman looked like a movie star and dressed to the nine-point-nines, and she was literally jumping for joy in her stilettos when they came in, then they ordered several dishes, so that is the impression I got.<br><br>One other thing to keep in mind is that many of these places with a sort of crunchy type of flavor focus more on food than vustomer service, so I think it's just a tiny bit unrealistic to expect the Downton Abbey treatment.<br><br>So in any case. whether ypu are looking to max out on nutrients, want to avoid eating animals, or just want an indulgent culinary experience or want something different, you can do a lot worse than NFC, even here where you have more places to eat than there are orangutans in the jungle, I mean before it was mostly incinerated to grow corporate soybeans for cattle feed.", "pics": null}}, {"review": {"des": "Excellent variety of organic food, perfect location, servers were moody and impatient", "pics": null}}, {"review": {"des": "Got the bangcock curry bowl, crispy buffalo wings, and my friend got the southwest burger. Everything is so flavorful and delicious and fresh, I love it here. Also the staff is super nice and knowledgeable. And pb brownie for dessert is also very good.", "pics": null}}, {"review": {"des": "*Disclaimer* I'm not a vegetarian, I love meat!!! But when I want something different Native Food is my choice. My favorite items on the menu is the 'Chicken' Ranch Run Burger,  The Taco Salad, and The 'Chicken' wings. When you think of vegetarian food the first things that comes to mind oh god, this shit taste horrible and do I need to eat again because I'm still \"hangry\". This is not the case for Native Foods. Check them out.", "pics": null}}, {"review": {"des": "No line but takes 20 minutes for food to come. Bizarre and not sustainable. Eclectic menu and food is \"meh\"", "pics": null}}, {"review": {"des": "I have never had a bad meal here. I usually get the vegan nachos with the cashew cheese and guac. The location is perfect from my work I can order and pick up or send someone to pick up. Great variety and the prices are not bad at all. <br><br>If you like vegan food you need to try this place. It will have something you like. Great place to eat!", "pics": null}}, {"review": {"des": "This is one of those trendy restaurants that differentiates itself by putting kale in everything and having a majority of the customer clientele be people who like to tie their sweaters in a knot around their neck when it's not being worn.<br><br>I had the curry Thai tofu bowl and this amazing thing happened to me after consumption: I didn't hate my life decision immediately afterwards.<br><br>This probably has to do with this amazing new green food innovation called vegetables. Ever heard of them?<br><br>As someone who's diet consists of nachos and four locos, it does seem like a foreign concept to me as well. <br><br>But the tofu and sauce complimented those little green objects pretty well.", "pics": null}}, {"review": {"des": "Native foods never disappoints. I tried this restaurant the first time I was in Chicago 2 years ago but made sure to go back (twice!) during my short trip back to Chicago recently. Everything is vegan but they don't compromise the taste of anything - you won't even realize you aren't eating real cheese! All their dishes are filled with a lot of flavor and the staff is super friendly. They do have multiple locations (I went to one in LA as well) - so def go check it out if there's one near you!", "pics": null}}, {"review": {"des": "We ordered the BBQ Pulled Jackfruit Sandwich with Lemon Doll Potato Salad and a Lil' Buddha Bowl for Callie.  Wonderful food just a bit too much sauce.  The Jackfruit was so tender and scrumptious. Everything was ultra fresh", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/IR_TQtTzo6qeqOCTv4ypMg/348s.jpg", "caption": "Very welcoming and informational for my Parkyr D"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/_zP-TVkWO53O51dtDZ-9CA/168s.jpg", "caption": "Callie was impressed"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/_5V8JZQ9XLNJAhFHAviBgA/168s.jpg", "caption": "Side of perfect veges"}]}}, {"review": {"des": "Great food, great service, great times.<br><br>The native burger is amazing and goes great with the sweet potato fries. Don't forget to try the orange cauliflower... no words to describe how amazing it is. Thanks!", "pics": null}}, {"review": {"des": "It was okay. It is like a fast food restaurant. Their cups looks dirty so I took a to go cup for my drink. Also when I ordered my food I asked the girl if there was tomatoes in the salad she said no and there was some tomatoes in my salad. What if I was allergic to it!!!", "pics": null}}, {"review": {"des": "Having tried most of the Native Foods locations around the country, they are consistently good and this one is no different.   <br><br>Chicago does not have the selection of vegan restaurants of most U.S. cities so Native Foods is really a savior, with its two locations (formerly three).<br><br>It would be nice if NF customized its menu a little for each city but at least the menu is consistently good. When it comes to vegan variety and value this place is hard to beat.   The staff are all locals and friendly.  <br><br>Tip #1: get the special of the day for a free side.  <br>Tip #2: try the deli ruben for a filling treat", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/XbCC_OHA7M92Ekk-L9AdBQ/348s.jpg", "caption": "The deli ruben is epic. Could eat one daily and never get bored of it. In fact, there have been weeks where I have come pretty close..."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Io3gS2h5NodpcLBBJRMdYw/168s.jpg", "caption": "The \"cheese\" is better than real cheese but the tortilla chips are a little weak."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/i1THXR-vAk3ydegvQKRIhA/168s.jpg", "caption": "Side of broccoli. Good, but not legendary...."}]}}, {"review": {"des": "Whenever I visit Chicago, I try to eat at least one meal at a Native Foods.  They are spread out all over, but I often stop here.  The past trip we ordered 2 meals to share.  One was a crispy Twister wrap with added tofu bacon and the Oklahoma Bacon cheeseburger with sweet potato fries.  I'd say my favorite was the Oklahoma tempeh cheeseburger.  Make sure to add the Ranch and Chipolte sauces.  I also think the sweet potato fries are some of the best I've ever had.  Another condiment recommendation, is their housemade ketchup.  <br><br>Don't forget to wet your whistle with some of their lavender blueberry lemonade or Watermelon Fresca.  No charge for refills and trying them all. Be sure to close out the meal with a carrot caramel cupcake or oatmeal cream pie.  The pie is enough for 2-3 people, and worth every penny.<br><br>For locals, it seems worth it to get the Café Tribe Card. Rack up points and get rewards for every dollar spent.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/cGXKcWY09uCLfjI-0QdBUA/348s.jpg", "caption": "Tofu pudding"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/oF1p5B2HQn1V6UHob3JRpQ/168s.jpg", "caption": "Get the sweet potato fries!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ervN5_ergS513kL_y6b4Tg/168s.jpg", "caption": "Avacado salad special"}]}}, {"review": {"des": "I love eating my meat products but this is the second time I ate here and everything is plant based. I still can't get over how tasty the food is. So far I loved both meals I had there. I also really like their Lavender Lemonade.<br><br>I had the Southwest Burger and  I didn't miss not having ground beef. The plant based product they used along with their seasoning and sides were great. I was so full.", "pics": null}}, {"review": {"des": "I may be a little overly excited about my meal today, because in the suburbs, it's difficult to find plant based menus. I was thrilled to try Native Foods Cafe where I could literally choose from an entire menu! I ran a race in the AM and just wanted to grab a quick bite before heading home. I had the Twister Wrap and it was seriously the best wrap I've ever had. I've never had a chicken meat substitute before, but I was pleasantly surprised at how tasty it was. Tons of veggies. Loved it! The service was just ok. The only person that cracked a smile was the food runner. The food came out quickly. I'll be back next time I'm in the Loop!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/-tUteyomZ3SUDIpW0f6HIQ/348s.jpg", "caption": "Twister Wrap w/ sweet potato fries."}]}}, {"review": {"des": "Delicious, healthy vegan food. I had the kale, tempeh, kraut macro bowl and it was great. Huge portions, quick service, and very friendly employees. Wish we had one of these in Philly!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/XPLWRQxG03K_C3wM3DpjWA/348s.jpg", "caption": "The kale and tempeh macro bowl. Delicious!"}]}}, {"review": {"des": "Twister Wrap = vegan version of a buffalo chicken wrap. It was very tasty! I'm not a vegan, but I would come back here. I got the potato salad as a side which I thought was a good choice. Doesn't seem like everything is \"healthy\" per se.  You order at the counter, and they give you a number. I asked for it to go and they said it would be 10-15 minutes. Ended up being less at about 1pm.", "pics": null}}, {"review": {"des": "In the 1990s, I ate a vegetarian diet and always felt like I was cheating myself.  Flavors for vegan alternatives to my favorite dishes were a pale comparison.  Native Foods Cafe proves better than anyone that this isn't the case any longer. I tried five dishes here over a three-day stay and everything was a hit.  <br><br>Their faux buffalo wings are the best boneless 'wings' you'll have.  Order them crispy, without sauce and you'll enjoy them more than any chicken-based alternative.  Great texture, crunch and flavor.  The only downside is the limited sauce options. Buffalo only. I recommend ordering the sauce on the side and dipping the wings. <br><br>The Faux Gyro is good, but the plate includes a generous portion of Quinoa and veggies that dominate. This is another place where adding some sweet/spicy sauce to the plate takes things to the next level.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/gcee9EdH19OvmgoZxXym6w/348s.jpg", "caption": "The faux buffalo wings taste great. Get them crispy. Sauce is best on the side for dipping."}]}}, {"review": {"des": "In light of my recent negative experiences with Freshii, I have been forced to seek new alternatives for a healthy lunch in the loop.  Everything about Native Foods was positive, starting with the cashier, who cheerfully answered questions and joked with my friend and me while we were dithering about.<br><br>I ended up going with the Chicken, Bacon & Avo Club, which the cashier reminded us was an entirely plant-based sandwich despite the name.  The sandwich didn't taste like chicken, nor did the bacon taste like chicken, but it was a nice portion, freshly cooked and it tasted healthy and delicious.  No less than five times, I mumbled out loud \"I can't believe how much I'm enjoying this\".  (I'm pretty sure my friend tuned me out after the first three times, but I wanted to beat a dead horse because that's just what I do)<br><br>A very inviting place for a quick healthy lunch -- I foresee becoming a regular.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/CLiYGfMdGEsHrU7uqdJL8w/168s.jpg", "caption": "Chicken bacon & avo club -- yum!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/wHKBb5bRjreh80AoVS6HRg/168s.jpg", "caption": "Scorpion burger"}]}}]}