{"name": "native-foods-cafe-chicago-2", "reviews": [{"review": {"des": "I really love this Belmont location, and I have never had a complaint. <br>I have a bad gluten allergy and Native Foods is able to use equipment that is not shared directly with gluten products.<br>Sam also has great customer service and helped me figure out what I could and couldn't eat.", "pics": null}}, {"review": {"des": "The food tends to be very good--most of the time, sometimes excellent!.<br><br>The service on the other hand,..., it's hit or miss--mostly miss. Especially when ordering for delivery. Actually, every single time--I should've learned my lesson the first time they got it completely wrong. They suggested calling the delivery service for a refund and re-ordering again.  WTF?  How about getting it right and avoiding these reviews?!<br><br>They failed once again.  <br>What is so difficult about double checking every order?  People are paying and those who sometimes have to rely on delivery pay (A LOT) extra.  My fault for giving them the benefit of the doubt.", "pics": null}}, {"review": {"des": "FOOD POISONING at Native Foods (Belmont) location.  <br><br>Let me just start by saying I am vegetarian (try to eat vegan when possible) so I am fully supportive and thrilled when I discover restaurants that are 100% vegan. I have ordered from the Native Foods closest to me (Milwaukee) and have enjoyed the food and had no issues. <br><br>However, my boyfriend lives in Lakeview which means the Native Foods on Belmont is closest to him. <br><br>He ordered me the \"OC Raw Chopper Salad\" which was actually delicious. Unfortunately my stomach started hurting shortly after finishing my salad I could tell that it didn't agree with me. About 15 minutes later, I ran to the bathroom and vomited multiple times over the next hour (until the salad was completely out of my system). Then I felt fine after.  <br><br>Not only was this first time I've gotten food poisoning, but it looks like I'm not the only one who has gotten food poisoning from this location (search 'food poisoning' within the reviews ONLY FOR BELMONT LOCATION!!). <br><br>What makes this even more disgusting (in my opinion) is the fact that no raw meat or animal byproduct involved- so the food poisoning was most likely due to unsanitary kitchen practices (someone not washing their hands, not wearing gloves, vegetables/leafy greens not washed, etc.)<br><br>I write this review not to bash but in hope I can spare somebody food poisoning and ruining their night. I will not be ordering from this location ever again given the history of food poisoning and no apparent evidence of the restaurant addressing it.", "pics": null}}, {"review": {"des": "This is probably the most poorly managed restaurant I've been to... I stopped going here a few years ago because it was just not worth the poor experience every time.<br><br>Tonight I risked going back, thinking it MUST have improved!  Wow, was I wrong.<br><br>It was worse than I remember.  I waited 48 minutes for their \"fish & chips tacos\".  The place was mobbed with angry grub hub, postmates, and doordash drivers all trying to pickup their deliveries... I've never seen anything like it. Obviously, Native Foods should NOT take orders thru these delivery places if they cannot staff the place to fulfill carryout and dine in customers.<br><br>Also, I witnessed the delivery people preparing the beverages to go for their customers!! Is THAT SANITARY?  I mean, I would NOT WANT one of those dudes responsible for my drink... The guy picked up ice cubes with his bare hands!!!!<br><br>Anyway, never again Native Foods.  My food was cold, and the order wasn't even prepared with all the ingredients listed on the menu, nor did I get my side. <br><br>You need a managerial makeover!", "pics": null}}, {"review": {"des": "Every time I'm in a town that has a Native Foods I have to make the effort to get there. It's a consistently reliable vegan food haven. I love it so much I have a rewards account without even having one in my town! The Chicago location on Belmont is no exception. It was better than my last visit to the chain, which was to the original location in Palm Springs.<br><br>I'm a bit too emotionally attached to the Oklahoma Classic. I get it almost every time I go there. But I'm still bummed that they eliminated the fried pickles from it. It's best if the peppered seitan is very thinly sliced. It reminds me of the \"bad\" old days of eating Beefy King BBQ beef sandwiches in Orlando. The sauce is sweet with a hint of heat, and the caramelized onions put it over the top in flavor. I can't forget to mention how great the fries are too! They're thin, super crispy and lightly seasoned with what I assume is paprika.<br><br>My friend had the Baja Tacos and enjoyed them, but they had a touch more heat than she expected. She had the super slaw with her taco as a side, and thought it had too much kale. She liked the flavor though. We also got several treats (a GF PB brownie, a Brookie and a regular chocolate chip cookie). I was hoping they'd have a vanilla cupcake but I'm not sure that they make them any more.<br><br>One of the things I like about Native Foods is that they make their own ingredients, such as the seitan and cheese. Other vegan chains use items that I can get at most grocery stores and cook at home, whereas Native offers unique products that are made fresh. <br><br>There are so many other items on the menu that I want to try. They need to open one in Phoenix ASAP so I can try everything!", "pics": null}}, {"review": {"des": "Had a vegan friend in town, so we stopped in. I like meat and plants alike, but mostly appreciate that their menu has a lot of options and diversity. I ordered the native chicken bacon avo club with seasoned fries and some hard cider. No regrets. <br>Service can be hit or miss, but our food at least came out quickly. Overall, This Native Foods is a good option for grabbing a casual and healthy bite to eat, vegan or not.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/uxxqC9WB394B52oEJUnIVg/348s.jpg", "caption": "Foods! All the native foods."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/aV4IULvmgfHv0Pfji0GM0A/168s.jpg", "caption": "Inside view"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/YWje54J_Jckkw87z5VOasA/168s.jpg", "caption": "Back of menu"}]}}, {"review": {"des": "As a meat eater, I was a little wary of coming to an all-vegan restaurant, but I absolutely loved every single thing I tried! <br><br>I ordered the Thai Chili Brussels Sprouts, which had a thin outer fried coating with just enough sauce. The sprouts were cooked perfectly. <br><br>My friends ordered the nachos, spicy cauliflower, and an avocado wrap with a side of Mac n cheese. I tried them all and they were all surprisingly delicious, save for the Mac n cheese, which had a kinda weird coconut flavor. I wasn't really a big fan of it.<br><br>The workers are all super nice and friendly. The place has a nice cozy vibe that makes it a great place to read a book/study/do some work on your computer.  <br><br>Prices were all pretty reasonable. I'd definitely come back here again!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/UySiC0vLO23k4Ek5oa384A/348s.jpg", "caption": "Thai Chili Brussels Sprouts"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/zhdpIgGKClVVHqZFpetq8Q/168s.jpg", "caption": "Nachos"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/W5PrzCAUwcevc_F0jxCQcA/168s.jpg", "caption": "Spicy Cauliflower"}]}}, {"review": {"des": "I wanted to give this place a 4 just because their food makes me so full! But no, I think the staff is great and the food is a treat. In LOVE with their oatmeal creme pie. Got the spicy fried cauliflower and really enjoyed it with the side of beets much more than with the sauce it came with. <br><br>I've been to this location a couple of times and I'd say overall, the service has been consistent and satisfying. If you come here a lot, definitely get the rewards card so you can get some free food when you build points", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/nOWprxpl5NwjMtJip1d72g/348s.jpg", "caption": "O R A N G E   C A U I L I F L O W  E R  get it"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/7si8KCb_2Vd3-ZLA1SBOkw/168s.jpg", "caption": "Spicy cauliflower and dessert!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/f2E937GBcwJcf3j_yDqFFw/168s.jpg", "caption": "Spicy cauliflower"}]}}, {"review": {"des": "I recently met a friend here for dinner.  We split the nachos and a sandwich and had yummy chocolate desert.  Everything was delicious!<br>The staff was very attentive to our needs and the place was clean and comfortable.<br>I highly recommend visiting Native foods for good healthy vegan deliciousness!", "pics": null}}, {"review": {"des": "Last night, my first night after moving to Chicago, I decided to come here. I was pretty excited since I loved Native Foods in LA and have been without for a few years. This... did not go well.<br><br>We ordered a chicken run ranch sandwich and a cheeseburger. An hour later we had not gotten our food. In that hour, I saw one group of people get their food - no one else. There were several Door Dash and other delivery people waiting around for their orders, too. I felt especially badly for them, since I believe they get paid per run, rather than hourly. <br><br>A (man I assume is the) manager came around and asked if anyone wanted another drink, since we were waiting. I appreciated that, and it did help. However, an explanation or estimated wait time would have helped, too. I got to try some local beer - my non-drinking wife probably would've done better if they'd offered her a cookie. She was starving.<br><br>The table next to us, who'd waited even longer, left. I do not know if they got a refund. <br><br>About 90 minutes after ordering we finally got our food. When it was dropped off, the server said she was sorry for the wait. I asked what had gone on - she said they just usually were not busy on Sundays and they weren't prepared to be \"so busy.\" I'm honestly not sure if that was possibly true. There were maybe 4 tables of people in the restaurant, plus 8 to-go orders. They couldn't handle that in under 90 minutes?<br><br>The food was kinda sad. Both of our sandwiches were dry. At that point we were starving, so at least we were fed and I could eat something vegan. I think they were closing up when we were finally heading out.", "pics": null}}, {"review": {"des": "I am not a Vegan but after a chat with some friends about Vegan food I had to stop by this previously untried Vegan restaurant. I was impressed by the flavor. I did not miss the meat or dairy. I had tomato bisque and kale soup and a taco salad. The food was well prepared and presented. It is definitely a good choice.", "pics": null}}, {"review": {"des": "I go here soo frequently I'm also ashamed. This place is heaven for all of my vegan friends out there! <br>When I was first introduced to this place I was confused because the menu uses words like 'cheese' and 'chicken', but rest assured all ingredients used are 100% vegan. For example, my favorite dish is the Native Chicken Bacon Avo Club - I've pretty much gotten it every time I've gone there. It's AMAZING. They use seitan 'bacon' and a soy based alternative as the 'chicken' I believe. <br>I would definitely recommend checking this place out. As a vegan, it takes the stress out of looking through a menu and ordering. 10/10!!", "pics": null}}, {"review": {"des": "Native Foods is one of my favorite Vegan restaurants ever. I have always visited this location as it is most convenient for me. It is very clean, with a friendly and knowledgeable staff. I love my rewards card. The chalk artwork is awesome, the collage they have in the table section is cool too.  I want to thank Native Foods for existing, for serving us awesome buffalo vegan chicken strips and Oklahoma bacon burgers. I'm not worthy, I'm not worthy. Love you a million, baggilion, fo fillion. <br>xoxoxox", "pics": null}}, {"review": {"des": "Native Foods is life and this is my favorite location!! <br><br>My love affair with Native Foods began when I was visiting the city prior to moving here. I randomly found it while wandering around, and it has been one of the best discoveries of my life. (Is that sad? Nope!) <br><br>Okay but seriously, I was a vegetarian for a number of years and have recently become a vegan. My favorite item on the entire menu is the chicken bacon avo club with seasoned fries on the side. I literally CRAVE this sandwich. It is fantastic, and reminds me so much of fried chicken and bacon, but without the cruelty, and it seriously strikes a chord in my heart when I eat it. Other delicious things I have had include the meatball sub, their desserts  (amazing), and back about a year ago I had a jackfruit bbq sandwich that I haven't found on the menu again but I vibrantly remember the incredible flavors and textures of it. Native Foods, ppppllleeeaaassseeee bring that one back! <br><br>I also love that they offer holiday vegan options! And this location is so cozy, I feel completely comfortable eating there alone on days when I am taking the train back to Evanston from the Loop. Hop off at Belmont and just wander on down! <br><br>Love you, Native Foods!", "pics": null}}, {"review": {"des": "I've been coming more often and they've gotten their shit together.  The food continues to be the bomb.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/WPqQPKjSUG7zpAMMOGObNA/348s.jpg", "caption": "The Reuben with delicious cashew cheese.  Love this but it always gives me horrible heartburn."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/VDot5yvD4NbCpIoVuwsmKQ/168s.jpg", "caption": "Fried brussel sprouts in Thai chili sauce.  Really good."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ujmX6inaeoi1gUOsxwQl8A/168s.jpg", "caption": "Jackfruit bulgogi.  Wasn't a big fan of this."}]}}, {"review": {"des": "I had an amazing vegan meal at Native Foods Cafe.   Food was spectacular.    Good flavor, texture and presentation.   Great value.   Very consciousness of my allergy restrictions and they took extra time to understand what were my restrictions.   Very friendly employees.   Highly recommend....", "pics": null}}, {"review": {"des": "When it comes to the Vegan diet, most people associate the food with flavorless grains and veggies.  However,  I encourage you to make a stop at this restaurant to see the very best of what Vegan food can be.  <br><br>I started out with the Thai Brussels Sprouts for a app.  They come lightly breaded and a crisp texture.  The spicy Thai sauce packs a great punch of flavor.  I went with the Soul Bowl (made with Native Chicken, obvi not real chicken) and comes with beans; rice and some steamed veggies.  It is topped with a blend of dressing and BBQ sauce.  Again the flavors were perfectly blended.  My meal also comes with a corn bread that offers a unique taste to the dish.  <br><br>I know what you are thinking,  this will not fill me up.  I was barely able to finish the food.<br><br>The food is not only delish,  they offer unique flavored drinks that are a great alternative to pop.  <br><br>Def a must try,  you will walk away with a whole new appreciation for Vegan cuisine.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/h4xkWahi1563TNrOp-GxKQ/168s.jpg", "caption": "Chili Brussels sprouts"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/JGhtBdpTQxbSXucgExz0iw/168s.jpg", "caption": "Soul Bowl"}]}}, {"review": {"des": "Wow.  I don't even know how to put into words how great my experience was!  I'll do my best though.<br><br>I recently have discovered that I am lactose intolerant.  I've always had a litany of stomach issues in the past and it's been a journey BUT I know that living a dairy-free life is ultimately the way for me to feel my best.  That being said, I'm a midwest girl and there is nothing I love more than cheese in all of it's beautiful forms.  It's been a rough start and I've hit my first hurdle in the journey.<br><br>I had a major nacho craving.<br><br>I reached out to a vegan friend and asked \"best place to get dairy-free nachos?  I'm dying.\"  She immediately replied with \"Native Foods will not steer you wrong.\"  She was on the money.  I got the Native Nachos delivered via Postmates (Thanks Postmates, you make my heart sing!) and holy moly y'all, these nachos were INSANE!  At first I was sad looking at my nachos--two big scoops of cashew cheese just didn't meet the idea of ooey gooey melty cheese.  I was quickly corrected though--that cashew cheese is BOMB!  I opted to add the seitan taco meat and pairing that with the chipotle sauce and the guac?  Nacho perfection.  <br><br>I'm cryin' happy tears.  Native Foods, you got me through my first hurdle in my dairy-free journey!  You've earned a very loyal customer.  I'll be back...probably more than I should.", "pics": null}}, {"review": {"des": "A lot has changed about Native Foods, which makes me really sad! I used to frequent about once a week because it was such an easy, healthy meal, but their food and service has declined recently.<br><br>My personal favorite is still the Twister Wrap. It's very customizable because you can choose crispy, grilled or buffalo \"chicken,\" and top it with either ranch or chipotle dressing. It has big chunks of avocado, a generous portion of pico de gallo, and it's all thrown on a massive wheat wrap. It comes with a regular side, and I chose a side salad with the best vinaigrette. <br><br>If you're a little hesitant about trying vegan food, I would suggest ordering the Chicken Run Ranch Burger. It's one of the things on the menu that you can't even tell is vegan, and you walk out feeling so satisfied. Although you do get that free side, update to a special side for $0.99 more and order the sweet potato fries. <br><br>HOWEVER, do yourself a favor and pass up the dessert! Again, dessert at Native Foods used to be my favorite part, but now everything is actually pretty terrible. The cupcake was SO DRY, and the frosting kind of flaked off and chipped away; nothing creamy or decadent about this \"treat.\" Also, the past two times I've been there they haven't had their Peanut Butter Banana Parfait. I wonder if they stopped making it? <br><br>Their service used to be kind, but I found it pushy and uninterested my past couple of visits. It felt much more like getting me through the line then making my visit pleasant. Overall, I still love their actual food, so I would probably have it delivered... and skip dessert :(", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Kwnzze9v6oKOBVo1I9DQwA/168s.jpg", "caption": "Ensalada Azteca Gluten Free"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/VQ3ZqO19BbnBk9EMD2UXgA/168s.jpg", "caption": "Bangkok Curry Bowl Gluten Free"}]}}, {"review": {"des": "The food was delicious- so delicious. I couldn't wait to get home to eat. I ordered takeout and ate in my car while driving. Safe, right? There was so much flavor and colors. The food smelled amazing too. The restaurant was clean and laid back. Loved it. 5 well deserved stars.", "pics": null}}, {"review": {"des": "As a person who absolutely loves veggies but is also a meat eater, I tend to be wary of many vegan restaurants because I worry I will lose out on taste at times due to the restrictions of the vegan diet. But boy did this place prove me wrong...and I'm oh sooo happy to be wrong!<br><br>First off I got takeout, so I immediately lowered my expectations because I understand that presentation/taste/temperature is hard to maintain with takeout and I tend to not judge so harshly. Not necessary here! <br>The food came early, it was beautifully packaged and nothing was mushy! In fact it was one of the best experiences with takeout I've ever had! The sauces were on the side and there was so much food where I didn't feel I got any less in amount than if I would've ate at the restaurant!<br><br>I ordered the spicy cauliflower - love fried cauliflower so it was a decent representation of that. Although it wasn't really spicy but I have a higher heat threshold. This is the only thing I ordered that I think will fare better being eaten at the restaurant than at home.<br>The taco salad - Loved all the fresh lettuce and greens, the crunchy tortilla strips and the bed of slaw it was on! It came with vegan taco meat and I was pleasantly surprised at not missing meat at all as I chowed this down! Also the salad dressing was everything!!<br>The Bangkok curry bowl - was perfection. It was simple and fresh but filling and appetizing. That Thai chili sauce is clutch and it really brings the meal together. The tofu, cooked kale and carrots and zucchini on a bed of brown rice is the perfect healthy week day meal!<br><br>I'm not prone to hyperbole when it comes to my yelp reviews so I truly am a fan of this place. I'm going to make it a point to go and eat at the place too but one thing is for sure, they have earned a loyal customer!!", "pics": null}}, {"review": {"des": "First time ordering chicken and waffles anywhere and it did not disappoint. A little pricey, but worth the quality ingredients", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/rvP8oDQXHcJKCoJG2jUPcA/348s.jpg", "caption": "Chicken and waffles"}]}}, {"review": {"des": "This is a reliable vegetarian restaurant.  I don't think I've ever been disappointed.  The watermelon juice is so refreshing!", "pics": null}}, {"review": {"des": "Native foods is a good go to spot for vegan and vegetarians. They're a chain all over the country and while sometimes they get seasonal options, the menu pretty much is the same anywhere. <br><br>The staff here are great and always friendly. I go here anywhere from 2-6times a month on average and they're always attentive. <br><br>The food is mostly good. I'd recommend avoiding the meat substitute type things and going for the more vege-centric options like the salads and bowls. My favorite is the BBQ \"chicken\" bowl because of its fresh blend of awesome flavors.", "pics": null}}, {"review": {"des": "Former vegan so I know good from bad vegan fare. Was in the mood for some good vegan fare and may have found it at Native Foods on Belmont. The BBQ burger was decent...bun was a little chewy and dense. Sweet Po fries were delish. Fresh brewed ice tea was lovely. The price point was a bit high ($20) for my lunch, but I guess that's what you'd expect for a vegan meal in this part of the city. I guess it's the kind of vegan food that a vegan would be like \"OMG YUM!\" And a non-vegan would be like, \"This is why I'm not vegan.\" ¯\\_(ツ)_/¯ I would probably give it another shot and order something else.", "pics": null}}, {"review": {"des": "My partner and I have been completely plant-based with my diet for the past couple weeks. We heard about this place and sought it out to get some of our favorites with a vegan filter.<br><br>I ordered the Big 'ol BBQ burger with a side of mac and cheese and a chocolate chip cookie. All were very good! I wish the BBQ burger would have had some more sauce on it, but it was an awesome flavor and filling :) The mac and cheese tasted pretty mac and cheesy, too! The cookie was surprisingly soft and yummy. I really wanted to try their oatmeal cream pie but they didn't have any in the case, so I'll have to go back. <br><br>My partner got some sort of bowl that was good, too.<br><br>They have an outdoor seating area that we used, and they brought the food out to us and bussed the table. Overall, very satisfied with the food and the price, I'll be back for sure.", "pics": null}}, {"review": {"des": "Skeptic at first but the flavors, taste, and textures were fantastic. Highly recommend giving this place a try if you're in the area. Their Big Ol' BBQ Burger WOW! Just WOW!! So delicious compared, fooled me. Their BBQ sauce is delicious. <br><br>The nachos are fantastic with great portion size to share. The Twister wrap is their take on a buffalo chicken wrap and it is phenomenal. I definitely want to try every item on the menu this year. So many options!!!", "pics": null}}, {"review": {"des": "This restaurant is 100% vegan and if I didn't tell you that would not notice. The food tastes so good and is so similar the meat it is replicating. The service was great and very friendly. They do a great job of helping you decide on what to order. I will be going again.", "pics": null}}, {"review": {"des": "I ordered a Native Chicken, Bacon & Avocado Club. This Native Foods Cafe location served it to me on moldy Ciabatta.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/11VLS60U12VYSUANwvrRdg/348s.jpg", "caption": "I ordered a Native Chicken, Bacon & Avocado Club. This Native Foods Cafe location served it to me on moldy Ciabatta."}]}}, {"review": {"des": "I came here with my Chicago friends to be Vegan for a change and it was delicious. The staff was super helpful in exhaling seitan to my friends, who had never heard of it.  The Buddha bowl was delicious but my friend wasn't  too impressed with the Poke bowl. It was rather plan. The veggie burger and the Buddha bowls were delicious. Don't miss out on the mural wall right on the sid rod the building, great for friend photo shoot.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/O3MedCxJVxDnUy5jUd8oPw/348s.jpg", "caption": "Buddha Bowl"}]}}, {"review": {"des": "I've been to multiple Native Foods locations and this is definitely THE BEST. The staff seems like their a family and are always more than willing to go out of their way to help answer questions when I bring in my non-veg friends. Someone is always singing or dancing behind the counter, and I LOVE IT! Food is amazing! I typically order the Native Chicken, bacon and avo club with either their spicy native chicken wings, or the spicy fried cauliflower (and I don't even like cauliflower!). Also, do yourselves a favor, and try one of their AMAZING teas or lemonades.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/U4XrZOCVohed5AoZv-wnfQ/168s.jpg", "caption": "Spicy fried cauliflower!! The best!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/CphmNjt0ZVPs6XAH3Jk3PA/168s.jpg", "caption": "Native Chicken, bacon and avo club with steamed kale and wine (of course)."}]}}, {"review": {"des": "Amazing Food and the cast and crew were great!! I will definitely be stopping here my next visit to Chicago. Thanks Native Foods Cafe for the great atmosphere and good eats!!", "pics": null}}, {"review": {"des": "So, I don't eat vegan all the time but I'm certainly up for it when it is suggested. It can be difficult for me to load up at vegan establishments as I'm highly allergic to soy and some other ingredients that are highlighted in the vegan lifestyle. When I go out to eat, I like to eat- so this can be a tad bit disappointing.<br><br>I recently had the opportunity to visit Native Foods with the company of a large group. Large groups can put any restaurant to a challenge, and let me tell you upfront, the Native Foods team rose happily to the opportunity!<br><br>I had studied the menu before showing up and had the opportunity to talk with friends both old and new while in line. I ordered the portobello burger. This was essentially a large portobello mushroom grilled and wrapped with lettuce as I could not have a bun. I had the opportunity to have chipotle mayo or other sauces on top. With this, I ordered a dill potato salad.The person I spoke with told me that they dreamed of this potato salad night, they were not exaggerating. Additionally, the portobello mushroom was grilled in a way that I can never do myself- meaning perfectly!  The person next to me chowed down on the nachos. I was extremely jealous and kept turning down the opportunity to try some knowing that I would not be able to stop. <br>I'd happily return here and have some ideas for my next meal!<br><br>**Accessibility Thoughts***<br>Native Foods Café is designed so that patrons order their own food and carry drinks and silverware to their tables. However, staff was very accommodating to people at our table. All food was delivered and plates were returned to the kitchen by staff. The delivery and return seems to be commonplace. There is a small step up into the door.", "pics": null}}, {"review": {"des": "I'm not a big vegan fan but I tried this place and I am positive surprised highly to recommend !", "pics": null}}, {"review": {"des": "Wow, amazing! The staff are all super sweet and helpful. The food is delicious. We had the wings, the nachos, and the chicken sandwich. I loved the sandwich and the sweet potato fries. I was full and the end and went back for a take out order. I wish there were more of these accessible in the burbs. One day vegans will have more rural fast food options!", "pics": null}}, {"review": {"des": "I'm not a vegetarian but my boyfriend is, and we live across the street from Native Foods so it's our go to spot when we want something to eat in a hurry.  He likes it because he can pretend he's a meat eater minus the whole slaughtering thing.   The variety on the menu is solid and it's meat replacement are good, but I find the food somewhat bland, and the service can be a tad slow.   Otherwise it's a great place for your boogie or hipster friend of significant other who's big on animal rights.", "pics": null}}, {"review": {"des": "I've been here twice, both times for lunch on a Friday, and both times the place was not crowded and the service was prompt & friendly. First time I had the Thai Meatball Bowl which I really enjoyed, a pretty unique dish, and the second time (today) I had the Bangkok Curry Bowl. Unfortunately I was a little disappointed by this dish. I've had similar buddha bowls at other places containing brown rice, steamed vegetables, tofu, and a sauce but I didn't enjoy this one as much. The veggies were maybe a bit over cooked (I prefer more of a crunch from my steamed/blanched veggies) and the dish could have been wayyyy more spicy. Maybe it just needed more sauce. Anyway the whole thing was a tad bit on the bland side, but regardless it did taste fresh and healthful. <br><br>I'd like to come back in the future to try different menu items and some of their desserts, but I wouldn't get the Bangkok Curry Bowl again.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/wX7TCijzDo8gKK_hf0ZvJA/168s.jpg", "caption": "The bun is made of plaintains!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/gPMqikLDcAOdmIfABy7jAA/168s.jpg", "caption": "The Bangkok Curry Bowl - pretty, but it was not as flavorful as I hoped!"}]}}, {"review": {"des": "I wanted to try something different and healthy, which brought me to Native Foods Café.  I've been past this one and the one Milwaukee but never tried it before.  Their Native Chicken Run Ranch with fries was bland.  The fries were also bland.  Onions and carrots on the sandwich had the most flavor.  I also tried the Root Beer made with Caine Sugar.  It had a little bite to it, which is ok, but I will probably never order it again.  <br><br>I ordered at the counter and they brought the food to the table.  Service was fine.  It's close to the Belmont Red line stop.", "pics": null}}, {"review": {"des": "I am giving this review as a constructive criticism hoping the company itself would step up its game.<br><br>I visited this location last week and I was disappointed by the food and the service. <br><br>Food-wise, I had the Buddha Bowl which had jasmine rice covered by daikon sprouts, some teriyaki yam, avocado, pineapple and corn. Although it looked colorful, the coordination of tastes were lacking, it was not appetizing, as the rice was hard, there's no flavoring in the ingredients except for the daikon sprouts which was pungent and sharp. It was not a comforting dish and I did not enjoy it at all.<br><br>Service-wise, it was a long wait compared to other similar restaurant (20 minutes) and the cashier seemed lack of training to show her professionalism. I went with a friend with a different race and we were treated differently. My friend ordered a beer and I ordered an ice tea, the cashier handed the beer and a cup to my friend, as she realized the cup wasn't very clean, she offered to switch it with a cleaner one, however when it was my turn, I got handed that cup that's not very clean and I had to wipe it myself. <br><br>It was a bit saddening whenever I saw things like this happens in Chi-town, in an area where tourism is popular. I know customer service is not easy these days with services like Yelp, it is getting more competitive as other stores knows how to cook good food as well as providing awesome customer service. The bar has been raised, that's why if you put a person up front to represent the company, that person better be superb, please don't treat it just a position with high turnover rate.", "pics": null}}, {"review": {"des": "My vegan daughter took me here for Fathers Day. So good.  I had the bbq burger. I did not miss the meat at all. Very filling. Also, try their sweet potato fries. Crispy and delicious.", "pics": null}}, {"review": {"des": "The big ole barbecue burger was sooo great. My vegan pooch begged for some,  then licked his chops.  The potatoes weren't cooked thru so didn't eat them.  Amen to this place. Zero delivery fee do I had a cheap meal in less time than u can shake a stick at...", "pics": null}}, {"review": {"des": "Native foods is a good \"fast food\" spot that is totally vegan/ vegetarian, but also good for meat lovers too! My boyfriend is by no means a vegetarian, but he likes to try new things. And he loves this place as well. All of their dishes have great flavor and are pretty filling as well. The carrot cake cupcake is to die for. All of the drinks are especially good, too. I've tried multiple of their bowls and burgers as well and have been happy with everything. <br><br>They also have weekly deals of buy one get one free meals, but they end up getting expensive even so. They require you to buy 2 drinks and a sides as well. But BOGO meals is better than nothing!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/TU0sY3HxeU5Q0Uq3nWqPPg/168s.jpg", "caption": "Native scorpion burger! We got to cashew cheese as well which doesn't taste like cheese, but adds awesome flavor. comes with a side too"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/zlbolfgcjdSG3RIHjVP7RQ/168s.jpg", "caption": "Bangkok curry bowl--- a go to for me for sure. The meal has great flavor and is very filling."}]}}, {"review": {"des": "Good food. I really enjoy eating here, but Belmont location service isn't good. Some of of the staff is nice while other's are indifferent to some people of color. Sad face with tears, because I'm really trying to eat better. Won't go back. Third time's a charm. I will only visit other location even if this one is closer to my house.", "pics": null}}, {"review": {"des": "Joanna the manager is so pleasant and always makes sure the customer is happy! The food is consistently great and the customer service is outstanding. When grub hub dropped the ball and refused to deliver my food, Joanna remade everything and threw in free cookies which was such a nice gesture even though I begged her not to. Frequent native foods flier and this location is by far my favorite!!", "pics": null}}, {"review": {"des": "My mom and I decided on this place spontaneously because it seemed like just the type of health-food place I love. We split two things: the Twister Wrap and the Grilled Veggie Power sandwich with grilled chicken. They were surprisingly delicious!! I preferred the sandwich and I got it with grilled vegetables on the side, so they were really good too. The wrap had too much lettuce, I thought, but it was good too, and we got it with grilled chicken instead of fried chicken and without the buffalo sauce. My mom had sweet potato fries she said were delicious. I can't decide between three of four stars, so I put three, but I would definitely go back again!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/IFDKj05D7ffiXV1Vjjmtuw/348s.jpg", "caption": "Grilled veggie power sandwich w/ grilled chicken–so good! Grilled vegetables on the side."}]}}, {"review": {"des": "For Fast Casual - and VEGAN, Native Foods does it right.<br><br>So many healthful options. Plant based. Meals generally run around $14 a person. Totally reasonable for what it is, and for the fact that they bring it to you. The vegan reuben is awesome, but really everything is.<br><br>I'm a fan.", "pics": null}}, {"review": {"des": "My favorite vegan places to go. The people at this location are sooooo friendly and the reason I stress this is because the dowtown location on Clark, well, they're not as friendly lol  Anyways, I will go out of my way just to eat here. Thanks guys for being so awesome", "pics": null}}, {"review": {"des": "I have been a vegan pretty much my whole life and I must say that this is definitely a very good restaurant to dine in. I love the chicken strip with the delicious ranch sauce along with the Thai as well.  Taco salad is very tasty and the Thai meatball bowl is extremely delicious. I do not know how anyone could complain about their food. They do a very good job with their menu . I recommend trying the meatball sub too. They have good fries as well.  Their chocolate chip cookie was bomb along with the raspberry cupcake . It actually tastes like real raspberries and not artificial crap.", "pics": null}}, {"review": {"des": "They get 3 stars from me for the variety of veggie options.  But overall, this place is nothing special.  Not terrible but not great, either.  Portions are not generous, prices too high for what you get.  There's not much energy to the place or the food.  It's all kind of meh.  They do give free refills on the lavender lemonade which is nice :)", "pics": null}}, {"review": {"des": "We ordered delivery via Amazon Restaurants (def recommend, it arrived in 27 minutes! Sorry yelp). I got the chickpea tikka masala, and it was very good! The flavors from the coconut and tomato sauce were accented with a mild spice and cilantro. My boyfriend ordered the Big Ol' BBQ Burger and he was very surprised at how good it was for not being meat! He said it was even better than the burgers at The Chicago Diner, which is saying something. I don't know much about service in the restaurant, but when delivery comes within 30 mins and with tasty food, I'm very happy!", "pics": null}}, {"review": {"des": "I suppose I have to leave it three stars because of of last year, it would have been 5.  I don't know what is going on here but service and food both have taken a huge nosedive.  I have been a vegetarian for 16 years now, and when this place moved into the city, it was like a godsend.  The food was unbelievably delicious and creative, totally plant based, and most of all, the people who worked there were super excited that you were there too - they were excited you were eating vegan - they were excited to be sharing this awesomeness with others. No longer.<br><br>Yesterday, we were very clearly, from the get go, bothering the staff that we were even there in the first place.  From the moment we walked in, the credit card machine was down.  \"NO CREDIT CARDS.  NO CREDIT CARDS.  WE CAN'T TAKE CREDIT CARDS.\" is being shouted as us, in a bizarre and chaotic frenzy. Jeez - we heard you the first seventeen times.  And yeah, I get it - I won't get rewards, and I can't use a gift card - We understand you!  So we walk up to the counter.  This guy is chatting it up with an employee wearing an off-white chunky knit sweater for maybe around 5 minutes before anyone gets around to helping us.  It's nearing the end of the day - maybe around 9:40pm (they have already put the chairs upside-down on the tables) and before she takes our order, loudly exclaims to the other employee \"The kitchen's gonna hate me\", then to the kitchen, \"You're gonna hate me - we have two more customers.\"  So, that's awesome - we instantly feel welcome, clearly.<br><br>We order a few items.  I'm taking my boyfriend here for the first time, having talked up the food, and because Chicago Diner was already almost closed and we wouldn't have had the time to have a full sit down meal there.  As I mentioned, we're both just bewildered at what is happening there already.  After we order, we're sternly told that it's going to be take-out \"because I told you so\", says the order-taker. Now, I know this from experience - the old Native Foods would have given us a desert or free drink or something if anything was out of place, or even if we had waited too long - it used to be a very welcoming place - now, despite no credit card, or gift card, or rewards, or having to wait, we're told to essentially get the F out.<br><br>So, we get into my car to eat our food we just purchased.  Thankfully, I double checked whether there were utensils or napkins in the bag (there weren't).  So, we set ourselves up.  He ordered the Chick'n run burger (supposedly their most popular... maybe in the glory days, I guess).  I posted the photo - it looked worse than fast food; and didn't taste much better - certainly not how it used to taste.  I ordered my old favorite standby, the Oklahoma Bacon Cheeseburger (they call it something different now), which was still pretty good, though again, not like how it used to be - I don't even remember there being any tempeh bacon, like there used to be - they must have eliminated that part.  They gave us barely a handful of fries with one, and I wanted to try their new mac and cheese (photo also attached), so ordered that with the Oklahoma burger.  The mac and cheese was freezing cold (not an exaggeration - they must have taken it straight out of the refrigerator), and it tasked like pasta mixed into coconut milk (not at all recommended - almost inedible - really terrible - I only had a few bites before tossing the rest).<br><br>I will go back to use the amount remaining on my gift cards, but with Kitchen 17 offering amazing vegan food right in the neighborhood and Chicago Diner just a touch more expensive, unless they go back to their old ways, I was so put off by this experience that I have no inclination to go back anytime soon.  Vegan food should be wonderful and exciting, and this strange storm cloud of too-cool-for-school employees is really off-putting. If you're interested in an in-group somewhat hipster eating establishment too cool for the rest of us, you're giving vegetarians and vegans a bad name.  This place has a bad case of dementia, and I hope they find a way to cure it soon.<br><br>Three stars is too generous for the condition this place is in these days.  Next time I go back, I'll update this review.  For the moment, 2.5* rounded down.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/GHDfwRsatLz0WxHAqdePEA/348s.jpg", "caption": "Is the Mac and cheese side supposed to be freezing cold?"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/XxvSm7b2fp88DMRWOBvOGw/168s.jpg", "caption": "Chicken run ranch burger.  Definitely the worst experience I have ever had at a native foods. I mean, just look at this sandwich."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/0XvkxESLrMWSdRynhiYj1A/168s.jpg", "caption": "Weird experience. They didn't seem very interested in serving us.  The chicken run ranch burger was nothing short of pathetic."}]}}, {"review": {"des": "This place is a bit of a disaster. The last time I went was around a year ago, waited over 20 minutes for the bistro steak, when it came out everything was cold. Not room temp, but cold. Even the fries. The room was filthy, plenty of dirty tables during the time I waited. Got a refund and went to Chipotle. <br><br>Went back last night, the cashier who seemed like she might be a manager told us that the wait was around 20 minutes. Which I can respect. However, after I sat down another couple had to sit at a dirty table because there were no other options. About 1/3 of the ceiling lights were burnt out. This place seems like it is slowly going out of business and they just don't care. The fries were lukewarm at best, the roasted tomatoes were missing and there was a total of two \"crispy shallots\" on the sandwich.<br><br>The iced teas are good, though.", "pics": null}}, {"review": {"des": "Native Foods never disappoints. Healthy food, good quality, great prices. <br><br>My boyfriend and I ate here last weekend. After endless searching of a place to eat, we stumbled across Native Foods, which we actually completely forgot about for some reason. We ordered the Chickpea Tikka Masala, Bangkok Curry Bowl, and a chocolate cupcake. <br><br>Chickpea Tikka Masala: 5 stars! It tastes so good! Full of so much flavor and deliciousness <br>Bangkok Curry Bowl: 3 stars. It's a good dish and is very healthy. We just felt that it was mainly packed with kale and was missing some flavor. Honestly, would have rather ordered another Chickpea Tikka Masala. If you like kale though, you may actually really enjoy this dish.<br><br>Chocolate Cupcake: 5 stars. Delicious, and the best part of this cupcake for me is that it is dairy-free, and that I can actually eat it.<br><br>Native Foods is always a great place to stop by and eat for any meal. We never leave with a stomach ache or disappointed, always happy and satisfied, and that is the best part about Native Foods. <br><br>Thank you for the delicious food and good service!", "pics": null}}, {"review": {"des": "Always on point even though the portions have gotten a tad smaller. So happy to have these in Chicago!", "pics": null}}, {"review": {"des": "Amazing vegan and vegetarian options! I love the chicken bacon avo club have ordered it twice and great every time!", "pics": null}}, {"review": {"des": "I had no idea I took my family and friends to a vegan restaurant. I actually just thought it was a place that sourced locally for their vegetables and meat. Thought nothing of it even when I read the menu. Wasn't until the food came out that I realized the vegan restaurant. My sister's chicken sandwich was so delicious. And the tofu bacon reminded me of the fried bean curds you can get in ramen. Loved it. If all the vegan food came out like this all the time, I would convert! <br><br>The teas were unique and when you add agave to them, they're delicious. I might switch over to agave now. <br><br>I'm excited to try out more dishes!", "pics": null}}, {"review": {"des": "Native Foods is a vegan restaurant.  They have been changing around their menu and adding new things.  It's all good.  The oatmeal pies are the best.  Staff to s friendly", "pics": null}}, {"review": {"des": "Never order from here. This was my \"side of fries\" and it's the second time it's happened!!!  Complete rip off. GO ELSEWHERE!", "pics": null}}, {"review": {"des": "This is a nice little vegan place, to grab a bite to eat. It has a warm, and environs atmosphere, the staff are polite, knowledgeable, and funny. I'd like to point out, that I'm not a vegan. I do although, have a couple of meatless days a week, worth of eating, just to keep my body balanced. I'm a everything in moderation but, make it as healthy as possible type, lol! I visited Native, with a close friend who's an seasoned vegan. The food here is pretty good and, in large portions. I only suggest that, they season the tofu and the sauces, at bit more. We had the Bangkok Curry dish, if I'm not mistaken. The veggies were big and steamed just right, there was plenty of tofu, the brown rice was nice and light, and the sauce was pretty good. I also had a delicious ginger chocolate cookie, and a cup of super refreshing watermelon Fresca. Oh! I'd also like to add that, they have great music playing, all the food vapors smell yummy, and the bathrooms are super clean. I definitely plan on making more trips to Native, in the near future. In fact, that Thai meatball dish looked pretty good to try next, yummm!", "pics": null}}, {"review": {"des": "I starting eating at NFC and n Southern California on business trips about ten years ago. Food is excellent - lots of different flavors. Love the nachos and sandwiches. Tried some new entrees and they didn't disappoint. Carmel brownies are heaven!!!", "pics": null}}, {"review": {"des": "April 25, 2017: I went back in here after not going for several months. All I could do was shake my head. There were four dirty tables with crumbs everywhere. The workers took quite a bit of time to clear two tables. Meanwhile (and once again) customers were physically moving dirty plates around so they could sit at the tables where they wanted to or jamming themselves in tables altogether to avoid the dirty tables. This makes me question the sanitation of the food. I'll pass on coming here ever again. <br><br>June 17, 2016: I have only been here three times. I heard a lot of great things about it during a vegan festival event a couple years back. I finally went after someone offered to treat me here for my birthday back in November. The friend I was with is over-the-top friendly. I noticed she seemed more upbeat than the cashier, but I ignored it. I was just happy to hang out with a good buddy. The Soul Bowl was pretty decent.<br><br>Then the second time I went was last week. This time I ordered an appetizer while I waited for another friend. The cashier had the same kind of blahzay attitude I remembered from the first one. I was too stunned that the second friend was willing to try a vegan spot and so happy to see him that I ignored her, too. I couldn't even tell you what either of the cashiers looked like outside of being women. I was too busy blabbing with a second friend to be concerned. We both got Crispy Chick'n Wraps and sweet potato fries.<br><br>But for the first time, I went in there today on my own so there weren't the usual distractions. This would be my third time. First problem was that the cashier completely ignored that I was next and waited on someone else. I let that go. Then when it was my turn, she told me to hold on so she could take a phone order. Meanwhile another cashier was messing around on some kind of black phone, and the cashier on the phone asked her to take my order after two to three minutes of me waiting. The second cashier took my order. Everything's OK. I sit down to wait for it and notice that a side could possibly be missing when she brings it over. But instead of assuming it was missing, I asked because I could totally have been wrong. It's possible that my order didn't come with this particular side. The server says she'll check to find out. She never comes back. I could let that slide, too. The Soul Bowl I got this time was oddly crunchy. I have no idea why, but I still gave it a shot although the first one was better.<br><br>But what was bugging me more and more was I watched a couple get up before I even sat down. Their dirty dishes were left behind. Then I watched another couple get up before I'd really dug into my meal and gave up on the server coming back. I finished my own meal and was there for about a half n' hour to about 45 minutes, and no one ever came to clean those tables. I watched people sit down, get served and then walk out. There were never more than about six or seven people sitting down the entire time I was there. This was not a huge, crowded night. But no one was cleaning tables. Then when I was getting ready to leave and packing up the remainder of my food, a new set of customers came in, started removing dirty dishes from one table and putting them on another table so they could sit down.<br><br>I think it's absolutely ridiculous that there were at least three cashiers there and no one was cleaning or even glancing over at tables. I counted about four people who came in to pick up orders. Again, I don't consider that so crazy that nobody could clean a table in 30-45 minutes of me sitting there. That makes me wonder about how sanitary the place is. It'll be a long time before I go back again. <br><br>The food is cool. I'm not doing any cartwheels over it, and I have been to several vegan restaurants that I like more -- although their cupcakes are outstanding. But it's really the so-over-it customer service and not cleaning the tables that did me in. I'll pass.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/k1WSyst8Yexei6VR6fsapQ/348s.jpg", "caption": "This Soul Bowl looks appetizing. I have no idea why, but 1st one I got in November was better. Chocolate cupcake and lemonade were great!"}]}}, {"review": {"des": "Had no idea it was a vegan restaurant until we finished our Buddha Bowl. It was very good. Who needs meat? Will go back soon to use the $5 coupon we got for installing the app. Want to try the Thai soup. Do wish they had coffee or something else with caffeine.", "pics": null}}, {"review": {"des": "Scott McDonnell killed my customer account and refuses to assist me in restoring points that they screwed up. I've been going here for years and have been a regular to most of their Chicago location, I've even worked in some of them. They seem completely uninterested in assisting their customer resolve issues that they caused.  I highly recommend not going.", "pics": null}}, {"review": {"des": "Grabbed a quick meal here with my bestie. We both love nachos and dips in general and Native Foods has so many healthy options! We split a nacho plate (with guac, obviously) and avocado kale dip. Both were great. The home made chips are pretty good too, but if they're too fresh there is a risk of sogginess so beware.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/9ZD6KM41-0MFR2jUUz45Cw/168s.jpg", "caption": "NACHOS THO"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/dvBcvN3iTQiS1lEypWxI7Q/168s.jpg", "caption": "Avocado Kale Dip"}]}}, {"review": {"des": "Staff slow<br><br>Unorganized <br><br>Unprofessional <br><br>Dirty restaurant <br><br>No one ever at register just in the back texting", "pics": null}}, {"review": {"des": "This is the third time I ordered food from this place. I was really happy before but this time I ordered my sweet potato fries and they gave me the left overs !!!!!! They are all burned and they look old ! I can't believe it. I was surprised that they sent my food really quick but now get why , they just packed the garbage they got left", "pics": null}}, {"review": {"des": "Contrary to all the hype, Miss Jean and I found our Native Foods experience to be disappointing. The highlight of the meal was the Winter Ale we drank with the food.<br><br>I ordered the Oklahoma Bacon Cheeseburger. It was a big pile of food, beautifully presented, and lacking in flavor. All I got was some kind of aftertaste from the fake meat, which was a huge surprise. I eat fake meat all the time, at home and out, and this just didn't taste like much of anything. I finally took the dipping sauce that came with the fries and doused my burger with it. Finally I got some pleasant flavor. Now, I did eat the whole thing because I was pretty hungry, and also because the sauce helped so much. I'd certainly never order this item again.<br><br>Miss Jean had the chicken ranch burger. Again, she did eat the whole thing. I said to her, gee, you must really like that. She said, no, it was kind of blah, but that she skipped lunch, and she was really hungry. <br><br>Fellow Yelpers had also sung the praises of the sweet potato fries. Those were good. That's something I'd get again.<br><br>Miss Jean and I always go for vegan food when her husband is out of town on business every month. When we in the car after dinner, she turned to me and said, \"Well, you win some, you lose some.\" For us, Native Foods is in the \"lose\" column. Huge, huge disappointment, given all the rave reviews. We won't be back.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/po8D5KMIgHTtcs-FMFP5fA/348s.jpg", "caption": "Sweet Potato Fries"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/a9RHJbGDVB638iT0eA68yw/168s.jpg", "caption": "Oklahoma Bacon Cheeseburger"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/v26dKVcCpWuwjIpd-ft0uQ/168s.jpg", "caption": "Chicken Ranch Burger"}]}}, {"review": {"des": "I love the prices on this place. The food is average to me, except the chips and guac are amazing.", "pics": null}}, {"review": {"des": "This place is very much hit or miss, and my fear is that people new to the restaurant will order something that's subpar or funky tasting and write off the whole place, when really some of the best vegan food I've ever had has come from NF- especially if you have a sweet tooth like me, the cupcakes are BAR NONE the best I have ever had. Both the chocolate and carrot cake flavor are dynamite, and not too sweet like so many cupcakes, they are really salty and flavorful. Omg. Give any vegan nagger the chocolate cupcake and you will win them over for life. Note: only the Belmont location has the good chocolate frosting) The Twister Wrap is outstanding. (The mango one is weird.) Honestly sometimes I just come for all the sides; lemon dill potato salad, sriracha slaw, fries.... all amazing. Definitely give this place a chance", "pics": null}}, {"review": {"des": "Lots of choices with reasonable prices. I love the twister wrap (with crispy \"chicken\")- I could for sure eat it everyday. Lavender lemonade is really tasty and unique. Baked goods are yummy as well. Been a vegetarian for about 10 years now and this is probably the best vegetarian/vegan place I've been to thus far. Can't wait to try more.", "pics": null}}, {"review": {"des": "I was excited for the vegan food. Disappointed that I had to wait longer than promised to receive cold food. They also forgot one of the four items I ordered. So I called and asked for a refund for that one item (because I didn't have time to turn back and pick up what should have already been in my bag) and now my bank account has been charged twice and I have to wait 2 days to get my $35 back. Everyone working there was nice, but when I order a burger and fries, I expect those items to be hot/warm. I'd rather go to Chicago Diner.<br><br>Edit: after 3 promises that they would refund the double charge on 3 separate times I called,I still never received the refund of the double charge. I still refuse to go back to this place.", "pics": null}}, {"review": {"des": "Got the Buddha bowl. Very affordable and quite filling, everyone enjoyed their meal. The fries were tasty and non greasy. Many options to explore", "pics": null}}, {"review": {"des": "BOGO on Wednesdays is an awesome deal, not all locations offer it but this one does. Often enough I come here and enjoy the friendliness of the staff as well of the service. I've tried most of their dishes and I think they are all well made. One of my favorite dishes is the Aztec sale since it's fresh and has many ingredients to have a party in your mouth.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/zwcbMQUaIvy80efwvkH5rQ/348s.jpg", "caption": "While waiting for my awesome food"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/LXoAHoPVN-cw7sr0oRpUiA/168s.jpg", "caption": "Many drinks to choose from"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/9q3mWjQS3QkbSXXPemkCFA/168s.jpg", "caption": "Good desert"}]}}, {"review": {"des": "Everything on the menu is delicious and vegan! I haven't tried anything I haven't liked. The people and service are phenomenal, too. It's definitely my go to vegan restaurant in Chicago.", "pics": null}}, {"review": {"des": "Just as amazing as the rest of the chain, with amazing food, staff, and service!<br><br>My favorites..<br><br>Appetizer:<br>Chicken Wings & Nachos. Beware the nachos are godo enough for 2 meals. I get it without the chorizo!<br><br>Sandwiches:<br>Reuben!!! Meatball sub (first thing I ever had pre-vegan)! Steak sub. BBQ Bacon Cheeseburger!!<br><br>Bowls:<br>Curry bowl, soul bowl!<br><br>Dessert:<br>Toffee cake, peanut butter parfait, oatmeal cookie!!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/E9lctd1dNPTkafvB_t648A/348s.jpg", "caption": "Gumboooooo"}]}}, {"review": {"des": "Vegan people here is the place you love. Native chicken wings are good. Sorry I dont remember the dish name but chefs recommendation is very tasty. Must try it.", "pics": null}}, {"review": {"des": "If you show up in person, you're fine. Quality vegan food and fast. If you order delivery, totally different story. A huge fan of their food, and not always able-bodied enough to get out, I've ordered delivery from Native Foods a handful of times. <br><br>Unfortunately, whoever packs up the delivery orders at this Native Foods chronically leaves out the sauces that are paired with different menu items. I actually started writing \"please remember to include\" notes on each item in Grubhub orders.\" Well, tonight, I didn't bother to write a note about the about salsa - a major component in the vegan nachos I ordered for dinner - and when I called to complain, I was put on hold (I have up after a few minutes of that).<br><br>For eating in, recommended. For ordering at home, don't do it.", "pics": null}}, {"review": {"des": "Let me start this review out by saying I am not vegan or vegetarian and love me some cheese and chicken. If I was vegan I bet I would give this 5 stars.<br><br>The set up and service: this is set up sort of like a more upscale Panera Bread, or similar to a Noodles and Company. You come in and can pick up a menu and then order at counter and the food is promptly delivered. They have a nice selection of fresh juices and teas. I tasted the lavender lemonade that was good but opted for the black unsweetened peach tea. <br>The staff was kind and helpful however in a group of around 15 it seemed that about 6 people had things forgotten with their order-mostly avocados. My cousin who frequents here says that is a big issue that occurs often, however they did bring out everyone's avocados and sauces. <br>It is important to read the menu and understand that when it says chicken, cheese or bacon- it is all fake, or I guess synthetic would be the best term. I believe the fake meats are made from pea protein and the cheeses from cashews.<br><br>Food: I ordered a veggie burger that came with Guac, salsa, and grilled jalepenos I subbed for grilled onions and would declare it pretty good- not the best veggie burger I have had but not the worst. The fries were tasty. Some of my family had the avocado crunch wrap and LOVED it. Other dishes ordered included: BBQ chicken salad, sweet potato fries, the curry bowl, a tofu bowl with veggies, taco salad (was not well received) chips and Guac, and more veggies burgers.<br><br>The best part...or worst part was I was standing talking to relatives on the other side of table holding my glass of tea and for some reason it slipped out of hand and dramatically crashed onto the floor and shattered. I was utterly embarrassed but the staff was so compassionate and helpful. One woman came over and I apologized and she said, \"don't worry about it, I do this shit all the time\" and started cleaning it up and placed a caution sign out immediately. <br><br>If you are a vegan in Chicago and haven't been here you gotta get yourself to this place! If you don't like synthetic meat, I wouldn't recommend coming here as most everything on the menu has that (although you could leave it off or sub it). If you have severe not or soy allergies, I would stay clear of this place. <br>Also I have to say it is important to remember just because this place is vegan does not mean everything on the menu is healthy (i.e.: the delicious French fries). <br>Would I come here again on my own? Doubtful. Will my vegan family come here again? Certainly.", "pics": null}}, {"review": {"des": "I came here craving something healthy, not necessarily meat-free, after a work-out. I really wanted a salad but they didn't have much of a selection so I decided on a Sesame Kale Macro Bowl. The person at the register was super helpful. She told me about the burger of the month and wanted to know if I was interested in a rewards card but was not pushy when I declined. She also said that what I had ordered went off the menu for a short period of time before angry regulars demanded it be brought back. <br><br>Needless to say, the bar was raised pretty high by this point. The positives: my meal came out relatively fast, I enjoyed the dressing, side of pickled cucumbers, and the kale was cooked very well--still retaining enough structure to not flop to my plate when I tried to puncture it with my fork. <br><br>The negatives: the seitan was dry and not coated with dressing. Seitan has NO flavour, so I was surprised by this oversight. I paid $11, which I feel is a bit expensive for a fast food meal from an \"order and sit down\" place even though I know I am paying extra for fresh/healthy produce, etc.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/cPpfGar5HY-kOiyvToCIvQ/348s.jpg", "caption": "Sesame kale macro bowl"}]}}, {"review": {"des": "I've been here 10+ times over the years while I lived off the Belmont stop. Great, friendly service ever time. My food has always came out at the perfect temp & is always so flavorful. I hope other 'food giants' learn from native foods to provide healthy, fresh, and affordable food.", "pics": null}}, {"review": {"des": "I'm a picky eater. I'm a vegan, but not the most healthiest one. I'm not a fan of kale or \"undercooked\" veggies.<br>With that said and that in mind, this place is probably one of the healthier vegan restaurants around. The quality of the food is high, they don't overcook anything so the nutrition is all there, and they have a variety for vegans to choose from because theyre 100% vegan!<br><br>The coolest thing about this place though and the reason I keep coming back despite chicago diner being just right around the block is their BOGO Wednesdays and their rewards card. Oh, and their watermelon fresca that is just out of this world delicious!", "pics": null}}, {"review": {"des": "A vegan stable.  Good selection of comfort vegan food.  You will not be disappointed with staff or service.  We get take out mostly but the dining room is ok and kin to a Chipotle.", "pics": null}}, {"review": {"des": "Absolutely amazing! My bestfriend wanted me to try something new and she promise I'd love it, she is one to always keep her promises and she was right! It's amazing, I can't believe it's VEGAN. I literally feel good from the inside out, and cleanse my soul, it changes my whole perspective about vegan food, definitely a \"feel good\" kind of food. <br><br>P.s thank you for the kind manager who had treated me to brownies and even offer cookies to my bestfriend. You brighten up my day!", "pics": null}}, {"review": {"des": "The food here is great, but every time I've come in the staff is rude and seems incredibly annoyed they have to take my order. I've never been there when it's particularly busy, either, and ordering online doesn't improve their mood. Perhaps they're perpetually understaffed and have zero customer service training. Definitely splurge for the sweet potato fries.", "pics": null}}, {"review": {"des": "Love this place for vegetarian dishes. The ingredients and flavors are amazing. Every meal I have had here has been awesome.", "pics": null}}, {"review": {"des": "I enjoy some of their bowls but that's just about it. In terms of nutrition, Native Foods has a good choice of grains, legumes and veggies. I just feel that they lack the finesse and it's too quick serve. I get it feeds the masses, but I can just cook this food at home for cheaper.", "pics": null}}, {"review": {"des": "I have visited every Native Foods in the city of Chicago but I will write about this one since it is the one I visit most frequently. I am a vegan and I LOVE this food. I always try to get something different but end up getting the chicken wings or the chicken run ranch burger because it is SO GOOD. The one negative is the small healthy selection of drinks, of which I am not a fan. This location is pretty big, good for larger parties and an enjoyable atmosphere. I think this restaurant chain is the best - there were my first ever completely vegan restaurant, which I tried when I first moved to Chicago. I regularly visit. Oh I am in love with their chocolate cupcakes and the oatmeal cream cookies. Bonus - vegan food does not take that long to cook. I have taken many nonvegan friends here to enjoy!", "pics": null}}, {"review": {"des": "Picture it: hangry vegetarian getting off the plane, struggling to make it to their final destination. This vegetarian (ie me) stumbles upon this restaurant and is delightfully surprised when they realize it's ALL VEGAN - even the \"native chicken!\" I got the BBQ salad and couldn't have been happier. Every bite was delicious. Full of flavor, fresh and just downright amazing. Thank you!!!!!!! You have helped this hungry beast", "pics": null}}, {"review": {"des": "Lunch review:<br>The good: Great menu with a lot of fun and interesting vegetables. Bowls, salads, soups, burgers, sandwiches, all with a fun (mostly) vegetarian twist. Great desserts. Good sized portions. Even beer and wine! Friendly service with both the cashier and waiting. Everything made in house it seems. Great earthy atmosphere.<br><br>The bad: Loads of veggie-head options, but few for us carnivores. Still, it was delicious. A tad pricey. <br><br>Overall: A fantastic veggie-friendly option for lunch or carryout/delivery. Will surely be buying from them again!<br><br>Atmosphere: 9/10<br>Service: 9/10<br>Food: 10/10", "pics": null}}, {"review": {"des": "I am not a vegetarian let alone vegan, nor do I aspire to be.  But if I were forced to be, Native Foods Cafe would be my Saving Grace.  I've had the \"fake chicken\" or meat substitutes before and there was always a funny after-taste or the texture was weird,  but Native Foods nails it!  My favorite is probably the Soul Bowl which comes with the Native Chicken drizzled with barbecue sauce and their version of ranch sauce.  The dish also features brown rice w/ black beans, steam kale, cauliflower, broccoli and zucchini served with a delicious piece of their signature cornbread on the side. I've also had the Native Chicken Run and Chicken, Bacon & Avo Club sandwiches and the Native Chicken wings, all of which I highly recommend!  It a nutshell there probably isn't anything on the menu that will fail to please vegan or meat-eaters alike.", "pics": null}}, {"review": {"des": "A girlfriend dragged me into this place on  Belmont Ave. kicking and screaming but I was pleasantly surprised with  the Bistro (steak) sandwich and (chicken) wings.  I'm sure a certain orange fella would see their menu as \"fake news\", but I must admit that both selections were delicious if not identifiable.", "pics": null}}, {"review": {"des": "First off I want to say <br>I enjoy the food here <br>And I wish Native Foods great success. <br><br>I have been coming here for at least once a week since last December with my gf. <br><br>Native always had a daily special <br>Monday thru Friday for 9.99!<br><br>Until today (earth day) <br>I was informed they don't offer daily specials anymore. <br>Oh calamity I think this place is going to the yuppies! Think We may be visiting less often", "pics": null}}, {"review": {"des": "I love native foods in California. I think this particular location is just managed really poorly. The staff is unfriendly and unhelpful. An example of this is when I requested a place setting. The worker told me he would get it right away, and then proceeded to sweep the floor and totally forget about me. The food has been sub par every time I've gone, and the place is somewhat dirty. I don't think I'll be returning to this location.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/G5WRQ-FPUsQ1PhC34B20XQ/348s.jpg", "caption": "This is the ranch chicken sandwich? Are you kidding me?"}]}}, {"review": {"des": "Native Foods is easily my all time favorite vegan \"fast food\" restaurant.  I've visited the LA, Denver, and Chicago spots so far and am always eager to find another location when I travel.  I typically get the ranch chicken sandwich or the club, though everything I have tried is great.  The food does feel heavy despite being typical fast food fare.  I highly recommend saving room for snacks.  The oatmeal cream pie and peanut butter parfait are killer.  <br><br>PLEASE OPEN UP A BOSTON LOCATION!!!", "pics": null}}, {"review": {"des": "Superb food!!! I had twisted wrap and chick pea dish with rice. I don't remember the name but it tasted beautiful!!! <br><br>Glad that I visited last and packed a Togo..", "pics": null}}, {"review": {"des": "I am not a vegetarian, but i do generally try and eat mostly vegetarian food. <br><br>This is one of the best chains around, they do their best to protect the environment ranging from their hand soaps ( distilled from the oil used in the kitchen ) to their food.  They offer macrobiotic bowls, vegan sweets, great drinks, sandwiches, etc. <br><br>I came with my friend to grab something to go, and just got a drink and a sweet for myself.  The watermelon mint drink is freaking delicious, so cool and fresh, and is made daily from real watermelon, with a small amount of agave syrup added.  The vegan oatmeal cookies here are insane, the cookie is so delicious and sweet, and the filling in the middle was so creamy and fluffy I couldn't even tell it was \"vegan\". <br><br>I definitely need to come here again to try the rest of their foods. <br><br>The guy working here at the cashier was genuinely friendly and easy to talk to!", "pics": null}}, {"review": {"des": "actually the best vegetarian wings I have ever had. get the buffalo wings!! I'm amazed, tasted like actual chicken (coming from a non-vegetarian). my meatball sub was sooo good, usually vegan meat and cheese tastes funky to me but everything was on point. had a healthy and delicious vegan dinner and will be back !!", "pics": null}}, {"review": {"des": "It's hard to get meat substitutes right, but boy those guys pull it off!<br>I'm not a vegan myself, but I knew you could cook some really good vegan burgers when you know what you're doing. I'd argue that those burgers are better than meat burgers.<br>Will come back for sure!", "pics": null}}, {"review": {"des": "Came to this place for the first time and I will be back guaranteed. The food is fresh and absolutely delicious. Not to mention the homemade teas are AMAZING! Come here and you will not be disappointed I promise!", "pics": null}}, {"review": {"des": "Great vegan desserts!! On point. They had excellent customer service. The lavender lemonade was great! Great place! I'm not from here but I love trying vegan places and they excelled my expectations. Well done.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/mY44qY06tMbjMZw5kEb8XQ/348s.jpg", "caption": "This is the best brownie I've ever tasted (vegan or regular)!"}]}}]}