{"name": "next-chicago-2", "reviews": [{"review": {"des": "Upping my rating to 5* as on my most recent visit, Next allowed our party to select different wine pairings for each individual guest. Previously, they forced our entire table to get the same wine pairing and that's the only reason I docked a star on my last review. Really glad for this change as it was just a customer-unfriendly policy.<br><br>IMO the 2011-2015 retrospective was better and more interesting overall than the 2005-2010 retrospective (which I still enjoyed) so I definitely wouldn't miss this one. I don't want to spoil too much (especially the dessert!) but the elote corn and pork belly were real highlights for me.<br><br>Service was top notch as always and the wine pairings were fantastic. I felt like the staff, sommelier, and chefs went out of their way to keep us engaged and make us feel welcome.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/hO5YnGNfsoGfdCIeni8rTQ/168s.jpg", "caption": "amazing pork belly from 2011-2015 retrospective."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/mHu-4eqGmg9DqZRfMhYPbA/168s.jpg", "caption": "elote corn from 2011-2015 retrospective. Think this was my favorite."}]}}, {"review": {"des": "I extended my trip to Chicago 1 night just so I can have dinner here on a Sunday night back in November. I was really excited to bring my family here and to experience their first tasting menu. Let's just say it was a terrible first time for them and I almost felt like I was torturing them. If you've never had a tasting menu don't let this be your first. They cringed as each meal came out. I had to cut the meal short and ask the waiter to skip the last 4-5 courses. They brought us dessert instead. <br><br>A few courses were SO salty. The first course I actually shoved in my pocket and threw it out when we left the restaurant. It was a bad way to start. The tapas course included an olive juice gelatin. I spit it out immediately into the napkin. <br><br>If it wasn't for my family and their suffering I would've forced myself to sit through all courses just for the experience. Walking in however, I almost felt like I was walking into some type of cult. It was an interesting experience and presentation. But I never imagined spitting out food I paid so much for. <br><br>Maybe the menu just wasn't what I'm used to. I won't completely knock the place, and am open to trying it again as long as they change the menu.", "pics": null}}, {"review": {"des": "We got SICK!  A friend and I were excited to try the NEXT on Nov 24th. We are both foodies and have tried a lot of nice restaurants over the years.  I started feeling sick even before I left the restaurant.  I went home immediately after, and was sick with diarrhea and cramping all night.  I called my friend in the morning and she had the same symptoms.  I wrote to Next about us getting sick.  They responded saying our sickness was not the fault of the restaurant.  I sent a follow up email and they never responded.  <br><br>Overall, I don't think this place is worth the money and not only because I got sick. See pros and cons,<br><br>CONs<br>* Got sick.<br>* The lighting over the tables we too bright and the place was very noisy.  Not a very nice ambience. <br>* The staff was less detailed than I expected.  Most of them sounded like they were reading from a script.   There was times when they dropped the food on our table and didn't say anything. <br>* We ordered the wine package.  However, one of the pours was sake.  I ordered wine because I like wine not sake.  I tried to drink it but then asked for another wine, which they gave me.   There were two out of the 15 courses that did not have wine pairings.  At the cost of the wine we should have gotten wine with each course. <br>* A couple of the dishes were really fishy, the Pebble and the Scallop.  <br>* The food portions were small but the dessert portions were large.  It was like they wanted to try and stuff us at the end of the dinner so we would not notice how skimpy the food portions were. <br><br>PROs<br>* The food presentation was nice.<br>* The desserts we very tasty.<br><br>This place is not worth the money.  Stay away.  If anyone else went on the same night and got sick please send an email to Next.", "pics": null}}, {"review": {"des": "Holy moly! I was here for the Alinea: 2005-2010 menu and wow! I was slightly hesitant coming here so soon after just having been to the French Novelle menu but 1) it's Alinea and 2) I haven't been able to score Alinea tickets so this was the Next best thing! <br><br>I wasn't fond of the full menu of the French Novelle but to say that the Alinea menu was outstanding is an understatement. From start to finish, all the dishes were impressive and also involved that element of surprise that you'd expect from Alinea. Items on the table were later used for dishes and everything appealed to all your senses. I definitely ate first with my eyes, then my smell and my taste. I never thought how an unexpected smell could affect and enhance your tastebuds. I totally geeked out to see some of the dishes that I saw on the Netflix Chef's Table episode. <br><br>I can't wait to see what's in store Next!", "pics": null}}, {"review": {"des": "This review encapsulates two different menus I have had over the past 2 years in chicago, Hollywood and alinea 2005-2010. It points out some of the difficulties about reviewing this restaurant and their concept of reinventing a new menu several times a year can lead to different experiences.  I understand the difficulties the michelin guide has had evaluating them, it makes consistency of experience impossible. What you can expect is to be surprised and taken on a unique journey every time you eat here. You can also be assured that service will be attentive and of very high caliber.<br><br>The Hollywood menu was 3.5 stars and truthfully was not one of my favorite dinning experiences.  The plating and concept was so playful and fun, using the idea of Hollywood and movies in making dishes is such a cool inspiration. The flavors just seemed to fall a bit flat and plating seemed to be the driving force, which was unfortunate. My feeling is that the following years menus, french classic and nouvelle as well as two alinea tastings allowed the back of the house to re-focus on the foundation of grant achatz culinary background. <br><br>This brings me to alinea 2005 - 2010. Having not yet dined at Alinea (will be headed there soon) but always a fan inspired by their technique and thoughtfulness I was so excited to taste dishes I had only dreamed of and seen in pictures. It seemed like a greatest hits (even though they suggested it was not) making it one of the most unique opportunities for an alinea and molecular fan. It was nothing short of 5 stars and re-affirms the reasons why Achatz deserves to be among the greatest in the pantheon of culinary gods. I was a little disappointed that our server would suggest that he was responsible for coming up with most of these techniques (take a look at the Adria brothers, Roca family and Arzak family for some of the godfathers of this style) but Achatz influence on molecular technique in mainstream fine dinning is unquestioned. <br><br>Across three menus (see my previous post on the tapas menu) 2 of 3 trips here have been beyond exceptional and truly unique culinary adventures well deserving of 5 stars. While it may not always live up to the very high bar they set for themselves, the chance that it might is reason enough for me to come back - I'll be there again in a few months for alinea retrospective part 2 and I am so excited!!!!", "pics": null}}, {"review": {"des": "23rd iteration of the menu. Nouvelle cuisine. Saturday night seating.<br><br>I won't bore anyone with details of each course since it will change soon. I'll sum it up with MIND BLOWING.<br><br>Impeccable service. Inventive presentation. Well executed preparation. <br><br>Half the time I didn't know exactly what all the ingredients were since the menu was in French. Normally I am an over-analyzer, but this time I let the smells and tastes take over. It was like a dream, especially after the sixth pour of wine.<br><br>If you have allergies, they will want you to be very, very clear about them. I really appreciate they did this ahead of our arrival.<br><br>We can't wait to try Alinea now. My fiance's friend was the sommelier there, which inspired this visit to Next. What a cool gig, right?!?!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/f8eINrbD6_-bpZP75CmgcA/348s.jpg", "caption": "Towards the end my belly was actually getting full. Unexpected!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/vMEHRalKXJwezvYJpCAe1Q/168s.jpg", "caption": "Presentation a delight."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/wCa4OpYvH-zVA5CZm1flVQ/168s.jpg", "caption": "Morels and chicken. pastry filled with a delicious sauce. Second favorite course. It was the most 'familiar' but execute exquisitely."}]}}, {"review": {"des": "Oh my god. This place is next level (get it?) Didnt get a reservation for Alinea, but this is the next best thing. Ok I'll stop.<br><br>What I think sets this restaurant apart from the rest is that it's not just about the food, but the experience. Where else are you going to get a dish set on a pillow that releases scented air as you go for a bite? Or use a center piece decoration for part of your meal? The entire meal of about 3 hours had us guessing, what's coming next? <br><br>We had the menu from Alinea 2005 - 2010. My entire group, except for me, had been to Alinea in the past. So they were going in with some expectation. Not me though. This was a completely new experience for me. Though there were some dishes that I was not particularly fond of, the story and the execution behind each dish made it worth it. For each dish, the servers explained to us the back story and thought process behind it. The amount of thought that goes into the creation of each dish is simply mind blowing.", "pics": null}}, {"review": {"des": "A unique experience to dine here. Expect to pay $250 per person and make sure to reserve two weeks in advance to get a chance in finishing a table.<br><br>The restaurant decor was simple yet sophisticated. Basically bunch of newspapers painted on. Although the restaurant seem large with all the mirrors (you can see every single table without moving your head) it actually has less than 15 tables.<br><br>We had the Nouvelle menu when we went there in mid June. It's 12 dishes as shown in the menu I posted. Went go into the details for each dish but will mention the highlights. Our favorites were coq en Pate and Mille-Feuille. Our least favorite was oeuf Cuit et Navat and Consommé de Figue, although they had the best presentation.<br><br>Overall a great place to spend the evening if you have some money to burn.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/gBUiIwlHP6897O_yAgq_jw/348s.jpg", "caption": "Aiguillette de Caneton au Poivre Vert"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/a5I3cVRi6nTtbXOLIDN_4Q/168s.jpg", "caption": "Fraise et Chocolat"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/mEUA_6vxB9_Q6uOjOPOwTQ/168s.jpg", "caption": "Canapes de Jardin"}]}}, {"review": {"des": "This place is not for the faint of heart. You will be transported to another universe where the flavors, smells, and visual cues are familiar but mostly alien.  The food itself is probably saying things like \"I didn't know I could do that,\" and \"holy shit where did you put that carrot?\" If you're looking for an experience with unparalleled service and avant-garde willingness, look no further. <br><br>For the extremely bold, try the non-alcoholic pairings with your meal. At times I wished I had alcohol in me so my tastebuds could take a breather, but in hindsight, it was a good choice because I remember the flavors extremely well. It was spectacularly weird and delicious.<br><br>This place was a pleasure to visit and I look forward to the next experience.", "pics": null}}, {"review": {"des": "Amazing. Amazing. Amazing.<br><br>Sunday night seating, with an exclusive view of the kitchen, and an easy on-site booking for the Aviary next door to continue the night and night's celebration.<br><br>Next is a true joy pairing some education, with the food, presented in interesting, fun, and delightful ways. The servers are all respectful, well trained, and a pleasant to interact with. The food, for the Classic French menu was all absolutely fantastic. I'm not really sure there is anything more I could say about Next except that I am incredibly excited for the next two menus featuring Alinea through the years and will likely end up going back, again and again, as they continue to learn, grow, and educate.", "pics": null}}, {"review": {"des": "2018 Next Season Tickets <br>Part 1 - French Classique<br><br>The first season of Next is classic French cuisine; after tasting their menu, it would not be so unbearable to be stuck in that time period without our modern amenities if I could eat like this every day.<br><br>1 - creme de caviar moulees<br>Waiting for us at our table was a pair of beautiful and luminous ice fish sculptures standing over a cantaloupe gourd.  This adornment actually concealed our first course, a delicious pureed caviar topped with caviar and a rich and smooth cantaloupe flavored cocktail.  I am far from being a sommelier, yet this is one time I can honestly say that a wine is fruit-forward and sweet and melony without any of the harsh tannins I traditionally associate with wine.<br><br>2 - puree de marron a la briarde<br>Our second dish was a delicious chestnut soup (and I hate chestnuts normally) presented to us topped with an intricate basket weave brioche toast.<br><br>3 - homard bellevue a la parisienne<br>An introspective dish, this course features lobster on a mirror.  The entire lobster shell comes, but the best cuts of tail and claw have already been expertly extracted and re-imagined five different ways.  Just as you'd expect from this caliber of restaurant, the lobster was cooked excellently and did not feel rubbery at all.  Everything comes in bite size portions with a special spear, which is perfect for people who do not want to get their hands dirty with lobster in the shell.<br><br>4 - turbot normandy<br>This colorful fish dish was very good.  For those who love the crispy skin on a seared fish, this was enhanced with an even crispier brioche toast base.<br><br>5 - supreme de poussin albufera<br>Do you like truffles? Slices of truffle adorn a juicy and tender piece of chicken and disks of truffle embellish a fish cream.  On the side was a macaroni dome that surprisingly stood its own as a tasty and rich complement to the chicken.<br><br>6 - roti de chevreuil au foie gras<br>The centerpiece of this meal was a cut of venison with a heart of foie gras.  For my first time eating a piece of meat known be on the game-y side, I must say it lived up to my expectations.  The texture of the deer paired well with the foie gras center and creamy lentil paste on the side.  The only mildly sad tidbit is that the server carves the meat tableside from a larger log, so you get to see with your own eyes that there is more out of reach and you can think to yourself \"so close you can almost taste it\".<br><br>7 - tableau de desserts<br>I love dessert, so I was very happy to be surprised with three amazing treats at the end.  The first was a piece of art: pristine white meringue on a pistachio cookie floating on a pink fruity sauce and garnished with a sugar corkscrew.  The second was my favorite since I'm a fan of chocolate.  Dark chocolate ice cream (that tasted so rich I wonder if it exceeds the fat content limits of actual ice cream) lounging on a bed of berry compote in an elegant coupe, the rich dark chocolate and tart raspberry danced across my taste buds as beautifully as Olympic figure skaters dance across ice. Finally, to share was a small rum cake that unfortunately can't challenge the glory of chocolate.<br><br>TL;DR - it's French-inspired art that tastes good too.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ODLP4YwuXIAMkKnK4XnJqw/348s.jpg", "caption": "7 - tableau de desserts (1)"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/hDjTIb71ULDAKlrHdvuRwg/168s.jpg", "caption": "5 - supreme de poussin albufera (macaroni)"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/_A_jPFPAwSyw-eg4V4U2rg/168s.jpg", "caption": "5 - supreme de poussin albufera"}]}}, {"review": {"des": "Soooo where do I begin. I am all about experiences and trying new things. I have dined at almost every place in Chicago and various restaurant around the world and pride myself on knowing food and being up to date. Me and my husband decided for our next food adventure we would try out Next (doing the 2011-2015 Alinea Menu) for my birthday since we could not get a reservation at Alinea.<br><br>We are seated at our table and each table had a direct spotlight above the table. It was uncomfortably bright. Second-it was a small place and extremely loud, with no music playing (I asked the server he said there's faint music). Ok I can still deal with the noise level but being able to hear everyone's conversations with the lights in full blast made me feel like I was in a school cafeteria for lunch in middle school. <br><br>Moving onto the food- there were 14? Courses- one was literally a piece of beef jerky like item that looked like a twig wrapped in a ball on our table... it was meh. We got the standard wine pairing which were ok, three were standout amazing. The food was ok. Presentation was good I just feel like for the price paid I didn't have one item that I was excited to try again. The service was good but I felt there was inexperience and novice staff. <br><br>At a steep 500 dollars a person ticket I was expecting a full blown experience with memorable flavors. Maybe Alinea is better? Maybe not. Maybe it's all so hyped up we don't even know what good food is anymore. I think the science and effort behind the food was great but next time I will be happy spending half the price for memorable food I dream about and cry home to everyone telling them they must go try it. (EG-maple and ash & momotaro). And yeah we can say we did it for the experience, but the experience was not that memorable, the music, the smells, lighting, the control over the atmosphere- I expected so much more. Also I have woken up with a sour stomach from eating so many different flavors- would it hurt to give the guests ginger between courses that have such different flavors? <br><br>I feel like such an a$$ writing this but it needs to be done.", "pics": null}}, {"review": {"des": "Went with my wife last night to experience the Famous Alinea menu. What I would like to know is the following. What is a restaurant of this caliber's protocol when a customer discovers a hair on the 3rd dish? This knowing well that accidents can happen.", "pics": null}}, {"review": {"des": "I got extremely sick after eating at Next the other day.  I got on yelp after getting sick and noticed someone else had gotten sick off the same menu a week ago.  There was a lot of seafood in this menu and I'm not sure if I had a bad piece of seafood or if something was contaminated during preparation.  They also had some different types of \"plates\" that I don't know how they sanitize.  They had a wooden plate, a log covered in seaweed, and also grapevine that was woven into a Sphere that they hid food on.  Not sure how well those things can be sanitized if they are being used more than once.", "pics": null}}, {"review": {"des": "We returned last weekend, 16 courses. For those of you who may lack my gluttonous abilities, don't fret ... very small plates as usual.  I thought the combination of plates, wine pairing, and colorful descriptions worked well.", "pics": null}}, {"review": {"des": "This wont be a typical review, due to the nature of this restaurant. Nothing I can say will be relevant for future customers, as they change the menu every 3 to 4 months. What I will say is this is a theater of food. It has a feature showcase of one particular menu and its stuff you wont find anywhere else. What excites me the most is their retrospectives of other restaurants. This feels like a history lesson about the great chefs and restaurant periods. My first visit was for the Alinea 2005-2010 menu and it was a sensory experience like no other. I hope they continue this concept for years to come.", "pics": null}}, {"review": {"des": "I feel no need to go super into details given the fact that Next changes menus every quarter. I went to the Ancient Rome menu in April and then the San Pellegrino one this month. <br><br>Overall, I came out of Ancient Rome pretty mindblown at how creative the dishes were and how well executed they were even though I don't think I actually like ancient Roman cuisine. In fact, I loved it so much that I actually made an effort to fly out to Chicago just for the San Pellegrino menu. <br><br>San Pellegrino left more to be desired than Ancient Rome, in part because I think this was one that was cobbled together. Ancient Rome felt like there was a cohesive theme that strung everything together, and each dish made sense. San Pellegrino really was more of a showcase of different chefs, and while each dish was executed well, I think I wish there was more reason or explanation as to why these dishes were chosen and why these chefs. It reminded me a lot of the In Situ concept, and the fact that Chef Achatz was able to get these dishes says a lot to how much other chefs must respect him. But nonetheless, I came out of San Pellegrino feeling like I was missing something, though I was glad to finally try Chef's famous drawing on the table dessert. <br><br>Overall, post Ancient Rome this was a 5 star no brainer, but San Pellegrino was more meh, so averaging out at a 4. Not sure I'll make an explicit trip back out for this in the future even though it was fairly decent.", "pics": null}}, {"review": {"des": "Came into Next for their French Nouvelle menu as my first longer tasting. I was wowed with all the history and thought behind each dish and there really was a theme with each dish that showed through like art through each dish's creativity. I won't review each dish like I usually do, but the standouts to me were: <br><br>The first champagne snow dish in the garden dish (one of four), I thought the balance of textures with the slushy snow and the creamy yogurt like component was really great. There was a great use of temperature and I really like that sort of sour, bitter, sweet taste that was all combined together. This dish was really nostalgic for me as it reminded me of yakult, but much creamier and tastier. <br><br>I also really loved the jellied salmon with the perfect texture of raw and not and the how it looked like a quaint beautiful little garden from the top. The white wine sauce was also delicious and tasted quite caramel-y and velvety which I loved. <br><br>The dish everyone dubbed as the UFO dish was a standout on presentation alone, although the ambrosia (I think the waiter called it) was delicious and rich and was my favorite part of the 3 part dish. <br><br>I also personally really loved the desert, I'm a big texture eater in general so this entire tasting was a delight for me as they really used it to its full potential. I loved the rosemary ice cream much more than I expected and I loved how there was a creamy texture with the ganache (which made the overall dessert not too sweet as there was a bit of cacao bitterness!) the strawberry ice cream and the raspberry (?) brittle. Really great way to tie all the dishes to a delightful end and I enjoyed the tea service at the end as well, both great teas - very aromatic to go with the dessert. <br><br>That being said I loved every part of this experience and would definitely come back - I left surprisingly full and overwhelmingly satisfied.", "pics": null}}, {"review": {"des": "Wow.  It's hard to say much because 1) the menu will be different soon, and 2) I hate spoilers (DON'T TURN OVER THE INTRO THEME CARD), but I don't know how one couldn't love the current Nouvelle menu.<br><br>Last quarter's Classique menu was great, but this exceeds it in every way. Across twelve (or more, depends how you're counting) courses there is hit after hit, and only a few small things I might change.  The standard paring wines are excellent, unusual, and a good match for each dish.  Even the service, already fantastic, felt smoother and more practiced, perhaps due to the less formal style of the menu.<br><br>The Nouvelle menu represents the transitional period between cuisine classique, with rich sauces, time-consuming preparations, and historically rare ingredients, and the current-era molecular gastronomy that deconstructs dishes and reinvents the meaning of a meal (and will be presented in the forthcoming menus this year).  Instead of deep flavors covering the nature of the underlying ingredients, the dishes on this menu focus on texturing the sharp, bold, distinctive flavors of the core component.  Presentation is geometric and artful, without becoming architectural (yet).<br><br>I find part of the joy of a tasting menu is the surprise of what is to come, but some pictures are included below if you want to spoil a few of the details.  We're looking forward to the Alinea retrospective menus later this year.  Visiting from out of town it was a bit of a gamble buying season tickets, but now we're already planning for next year.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/8NpkRMh_YNXS198OFuYmHQ/348s.jpg", "caption": "This dish really ties the room together."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/5ins65F9WSiiBVdU-NUOag/168s.jpg", "caption": "Geometry without deconstruction."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/y4GojpnLTLMLjMcydtbaOQ/168s.jpg", "caption": "A refreshing salad."}]}}, {"review": {"des": "This is my first time dining with the group. My friend and I went for the \"World's 50 Best\". They had dish from different chef around the world so we thought it would be great to try different dishes from everywhere. We also decided to the nonalcoholic drink pairing there. <br>Most of the dishes and drinks were delightful some were not our favors because of our preference with food or texture. Some dishes were a bit more salty than our taste. But I would say I enjoyed 80% of the dishes. My favorite dishes were the King Crab and the Rose! Beautiful presentations and delicate taste! :) <br>I really did enjoyed the experience the staff were wonderful. However I would say this would be an one time experience. I personally would probably not go back, but I would recommend at least trying it once. Overall had an enjoyable time there.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Byt-NscjONb83Mvgtn715g/348s.jpg", "caption": "Apples"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ow1JbpifkBxA-011S7St_Q/168s.jpg", "caption": "Monkfish"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/SS3dRJQ33NXcV47qnkq7aA/168s.jpg", "caption": "Langoustine"}]}}, {"review": {"des": "we came here for the Hollywood theme, the presentation of the food is really good and we also liked how each dish linked to the movie it tried to represent. They also incorporated a lot of cool-looking props to the dish to make it fit the Hollywood theme. The one with the microscope is pretty cool, it relates to honey i shrank the kids. The other notable ones by design are: the ratatouille one (with the nice looking mouse trap), 20000 leagues under the sea (with the captain's apparatus), and the breakfast club (the bento box and thermos)<br><br>However the food itself is not as spectacular as I expected, some of them are too salty.<br><br>Overall it is a good and unique experience.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/omr4wUtop9hUkELk5NFZ_g/348s.jpg", "caption": "Jurassic park"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/RBWnKDVXUsNOwUw1RlmSWg/168s.jpg", "caption": "Marie Antoinette"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/q0naZvg88USexZlgsCgYRQ/168s.jpg", "caption": "Connoli for  the godfather"}]}}, {"review": {"des": "The roommate and I normally plan one fancy dinner when going on vacation. When his cousin told me about the wonderful dinner they had at Next, I thought why not check them out. Their menu rotates every season or so and they were doing The World's 50 Best Restaurants. I figured it would be a good way to sample some of those restaurants' best dishes. I bought two tickets for Sunday, December 3rd at 9:15pm. The menu was priced at $255 each with a 20% service charge and 11.5% tax, so our total was $682.38.<br><br>*Rose: rose, apple pomegranate from Quique Dacosta in Alicante, Spain<br>*Jerusalem Artichoke: walnut, rye from Geranium in Copenhagen, Denmark<br>*An Oyster's Frozen Kiss: oyster, sorrel flower from Mugaritz in San Sebastian, Spain<br>*Eggs Benedict: caviar, asparagus, ham from Eleven Madison Park from New York, USA<br>*Marine Soil: sea urchin, jicama, razor clam from Central in Lima, Peru<br>*Scallop: truffle, clementine, hazelnut from The Clove Club in London, England<br>*King Crab: beef garum, hen's egg yolk, rose miso from Noma in Copenhagen, Denmark<br>*Tartare: bison, sunchoke from Estela in New York, USA<br>*Badger Flame Beet from Blue Hill at Stone Barns in Pocantico Hills, USA<br>*Riso Cacio e Pepe: parmigiano reggiano from Osteria Francescana in Modena, Italy<br>*Langoustine: wasabi, mango, thai vinaigrette from Restaurant Tim Raue in Berlin, Germany<br>*Monkfish: aubergine, fermented peppers from De Librije in Zwolle, Netherlands<br>*All Parts of the Pumpkin: the skin, the seeds, the flesh from Attica in Melbourne, Australia<br>*Squab: parsnip, almond, lavender from Next, Chicago<br>*Memory: foie gras, black truffle, chives from Restaurant Andre in Singapore<br>*Apple: chanterelles, granite from Relae in Copenhagen, Denmark<br>*Chocolate: milk chocolate, blueberry, yogurt from Alinea in Chicago<br><br>By far, my favorites were the eggs benedict, tartare, and memory. The benedict was creamy and comforting, the tartare super flavorful, and the memory decadent. Courses I also enjoyed were marine soil (though the goat cheese was a little much for the delicate uni), king crab (a little salty since it made me want rice), and scallop (loved everything except the nuts). It was nice trying all the different dishes, but as a whole, I didn't think the menu flowed very well. And I was questioning who picked some of the dishes. Like my least fav, the beet dish. Who decided to grow less earthy beets and just served them with what I think was olive oil, salt and pepper? I thought it was very lackluster. A course I couldn't finish was the pumpkin one, but I'm not a huge fan of cooked pumpkin unless it's pureed into something like a soup or curry. I was missing a good meaty dish as everything was kind of light. I would have preferred a good beef course or something similar.<br><br>*Gin & Apple Cocktail: g'vine floraison gin, granny smith apple<br>*Champagne Charles Heidsieck: brut reserve, reims, france nv<br>*Chateau Simone: les grands carmes de simone, provence, france 2014<br>*Domaine Jean-Louis Chavy: puligny-montrachet, cote de beaune, france 2014<br>*Weingut JJ Christoffel: erdener treppchen reisling kabinett, mosel, germany 2015<br>*Weingut Knauss: trollinger, wurttemberg, germany 2015<br>*Bodegas Tradicion: 30-year amontillado, jerez spain nv<br>*Domaine Jean-Louis Chave: hermitage \"farconnet\", rhone valley, france 2012<br>*Giovanni Rosso: barolo \"la serra\", piedmont, italy 2013<br>*Castello di Volpaia: \"nika\" passito di pantelleria, pantelleria, italy 2011<br><br>I also did the standard wine pairing at $145. With mandatory tax and tip, the total was $194.01. Each glass was paired with 1-3 course. Since the menu was mostly lighter fair, there were a lot of whites. (I'm more of a red girl.) I love an old scotch, so my favorite was the 30 year. Our waiter told me most people don't like that wine, but I adored it. I also got a double espresso to pair with my dessert which was included in our meal.<br><br>Fun experience and service was excellent. I would definitely consider checking them out again for another menu.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Gi3-Lqg113snmsuIdODJWA/348s.jpg", "caption": "The World's 50 Best Restaurants - Double Espresso"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/wjqGidQfW-3AnCZEXSV52g/168s.jpg", "caption": "The World's 50 Best Restaurants - Chocolate: milk chocolate, blueberry, yogurt from Alinea in Chicago"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/QzCwFQaRatC5VDABJaSxVQ/168s.jpg", "caption": "The World's 50 Best Restaurants - Chocolate: milk chocolate, blueberry, yogurt from Alinea in Chicago"}]}}, {"review": {"des": "It's still 5 stars.  It just blows me away.  The attention to detail.  The service.  The food itself.  It's such a treat to come here.  And now with it being the Alinea menu it's even more spectacular.", "pics": null}}, {"review": {"des": "My wife and I went to NEXT to celebrate our anniversary and my birthday. Got married on my birthday; I know you were wondering.<br><br>The the theme was \"Hollywood.\" Our first time there, we had no idea what to expect. They took our photo on the red carpet as we arrived, and the photo was given to us with a copy of the menu as we left: super cool! <br>The food was amazingly interesting and tied to famous films in one way or another.  I say interesting because while I'm a fan of all types of cuisine, these high-concept experiences, to me are more of a culinary journey than a quest for a comforting meal. Maybe it's partly because my wife and I got yelled at by staff for eating all of the popcorn we were given at the start of the meal. Lesson: don't give hungry South-Siders popcorn if you don't want them to eat it.<br><br>The food was a journey. There were two table cloth/dinner wear changes during the meal. We did not get the drink pairing, and nothing else was offer except water. I'm still not sure how I feel about that, but I'm leaning toward liking it. While not every bite of food was my cup of tea, I do appreciate experiencing the meal as the chef intended.  <br><br>The desserts were the best part! Beautiful and delicious! <br><br>Will I be back? Not sure. Very pricey for a teacher to do more than once every five years, but I'm glad we did!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/4GhrqR3yimTJ5c9tj2bWQw/348s.jpg", "caption": "Marie Antoinette: prettiest dish of the night!"}]}}, {"review": {"des": "More of a 3.5 star experience but I always round up. <br><br>Had  I never been to a resturant like this before,  I may have liked it more but compared to El Ideas, I thought the menu was lacking a tad. <br><br>We went for the Hollywood theme and each course is inspired by a few different movies. I had heard beforehand that the performance/ service was part of the experience but our waitstaff seemed like they just wanted to get the explanations of each dish over with so they could move on. <br><br>Many of the dishes were presented with cool plating, etc. and most with lots of flavor.  I still need to try Allinea...maybe that will be more worthy of the time and money. <br><br>This was a good meal but for the price, I would not recommend.", "pics": null}}, {"review": {"des": "What a unique experience!  We went during their \"Red Carpet Movies\" theme, and how fun was it!  <br>-Do get the drink package, it is WELL worth the price and everything does so well with each course.<br>-Do dress nicely.  This is a top notch dining experience, treat it as such.<br><br>The food was spectacular.  The staff was even better.  Each course was made to represent a movie.  The Jurassic Park course was so much fun!  I was we lived in Chicago so we could enjoy some ofntheir other themes!", "pics": null}}, {"review": {"des": "I need to radically update my very old, very outdated review.  I have had the extreme pleasure of experiencing (I use that word purposefully) the last three menus at Next - The French Laundry, Ancient Rome, and Hollywood.  Wow - they all blew me away with the inventiveness, style, yumminess, and courage.  The artistry and theatricality on display during these meals was a pleasure to behold.<br><br>Next really seems to have found its groove recently.  While I found some of the original menus - Thai and Bistro - to be fine, they were not exciting.  These last three though are exciting and groundbreaking.  The concept of the dishes is really out there and pushing some interesting envelopes.  In addition to some high wire feats in terms of the dishes, the sheer theatricality and presentation of the meal is a marvel.  <br><br>I can't wait to go to our next menu (we've got season tickets, and boy am I glad we do) and see what the Chef has in store for us.  I know it's going to be super cool.", "pics": null}}, {"review": {"des": "Cleanliness 5/5 service 5/5 food 5/5<br><br>This was one of the most memerable food experiences I've had. <br><br>Menu<br>The menu for this restaurant is constantly changing throughout the year so you have to revisit the site to figure out what's coming up next :). There is a preset menu for every theme!<br><br>Reservations<br>You make reservations online and prepay for your meal! Reservations do go quick, so jump on it when you see something you're interested in!<br><br>Ambiance<br>This restaurant has a very rustic, yet romantic setting.<br><br>Food<br>I went when Next was serving up their tapas (Spanish inspired). Every course presented was incredible. We had items from a chemically modified olive bubble, to a flaming log with the steak and toast, to a beautiful plate of cured meat, to shrimp three ways, to finding chocolates in olive tree branches and so much more. Every course was so different from each other and such a creative spin on the theme! <br><br>Service<br>The servers here were extremely knowledgeable about each course and extremely accommodating! <br><br>Side note<br>We were told that the entire restaurant staff went to Spain to experience the food first hand before creating the menu.", "pics": null}}, {"review": {"des": "I spend an absorbent amount of money on food because I enjoy the experience and it's my thing; I don't do kids, I do fine dining...all over the world. When Next released their menus for the season, I was a little annoyed that they actually wanted you to participate in each experience! I do not know what happened, maybe the lack of enthusiasm or the ridiculous total for the packages, but about a month or so later, another email was sent allowing you to book for the French: Classique. I absolutely love the Alinea group and have had the pleasure of experiencing all of their restaurants, but for the price, this Next feature was a letdown. I just dined at French Laundry and for the same price I paid for Next, I left feeling like a stuffed turkey and don't get me started on all of the complimentary desserts they give you; I was a modern day Marie Antoinette. <br>Next only provided 7 courses! To add insult to injury, they offered Squaw for an additional cost of $100! Of course we were all in and I'm glad we did, or else I would have left very hungry and would have been forced to go to Umami burger. The desserts...don't get me started at how lacking they were. Do not give me chocolate ice cream covered in gold flakes...really? I was looking forward to a decadent selection of macarons. <br>Speaking of lacking, they could really use a more professional and less nervous waitstaff. For each dish we had a different server explain the origin, but what I do not like is listening to someone that clearly just studied the words and have no idea what they are talking about. I also do not like a fast explanation because you're so nervous, you just want to get the presentation over with. <br>I was very intrigued for the upcoming series of Alinea past and present, but unless I get a clear answer on how many dishes I will be served for $300+, I will not be interested in participating. Honestly, I would rather go back to Oriole, which hands down is my absolute favorite tasting menu in Chicago. You definitely get your moneys worth and the service is bar none. Order a German wine, you're going to get an explanation complete with a German accent and a thorough, slow, and precise explanation of each dish. Oh, and the ambiance cannot be beat.", "pics": null}}, {"review": {"des": "Have eaten dialogue chef in LA. I know he used to work here and check out for the first time. The experience was good.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/GmYBiSg9zuH15sO8e2-yog/348s.jpg", "caption": "Looks great but taste like Chinese Medicine!!!!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/dJPDxf7SXiXF3eoZEkF44g/168s.jpg", "caption": "Fish bone !!! Should be a bonus"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/eCDCZ8M20vySx2fSqjKNOQ/168s.jpg", "caption": "Saumon et oseille"}]}}, {"review": {"des": "One of the most amazing dining experiences ever. The pageantry, the courses, the flavors... It was all something to behold. Candidly if Yelp did half stars, I would give the place a 4.5 eating. There were several courses that I didn't like, and if you drop $300+ per person you need to like everything in front of you.<br><br>But the service was good, and the menu was extremely unique. The theme was the 50 best restaurants around the world. So I felt like for what I paid, I tried meals from like 15 different restaurants!<br><br>Can't say I'd go back soon, but I would definitely go back in the future", "pics": null}}, {"review": {"des": "This is my third restaurant in the group that I have had the pleasure of dining with. I would say as it stands now, the ranking is Alinea, Roister, Next. <br><br>Next strangely enough felt far more stuffy than Alinea in terms of atmosphere. I also disliked that you don't have one server, random employees come to drop off the dishes. Some were far less inspired than others. <br><br>In terms of the food, almost everything was delicious. I went for the 'world's 50 best' and the eggs benedict and tempura langostine were the standouts in my opinion. Some of the other dishes were a bit odd. The second to last dish was a granita with custard in the middle. It was supposed to be a transition between the rest of the meal and the grand finale which was the dessert you literally ate off the table. However, the custard was super savory and way too salty. The bite of pumpkin a few dishes back also had a crème that was extremely salty. <br><br>There were lots of \"high end\" ingredients like oysters, uni, foie gras, black truffle. I guess fine diners like those things and maybe it was the hazard of 'the 50 best' but I felt like compared to Alinea, it was more about trying to give you the value of those items rather than making delicious food. Overall a delightful meal.", "pics": null}}, {"review": {"des": "The restaurant has an incredible concept of changing the menu every 3 months with a different theme.<br>For our visit we had the opportunity to travel thru the antique Greece.<br>The plates reproductions are fantastic.<br>At the end, the Chef Grant Achatz introduced us his kitchen.<br>Can't wait for the next menu!", "pics": null}}, {"review": {"des": "I don't like to write reviews online at all, but after last night's dinner at Next, I decided I have to post something. I really wish I can give negative stars if possible, but this is one of the worst, if not the worst meal I ever had in my life.<br>This is for the Alinea: 2005-2010 menu specifically and I'm not sure whether it applies to the other menus at this restaurant, but I suspect if it can get any better.<br>This is THE saltiest meal I've ever had in my life, and my tongue still suffers from the heavy taste hours after the meal. We complained about it being too salty three courses in, and the waiter assured us they had told the kitchen to keep in mind of this, but the course did not get any better from there. I saw other people enjoying their meals, but my boyfriend and I barely had the courage to taste any of the remaining food as the half of the whole course we had made our throat hurt from being so salty.<br>Honestly we did not think the food can get any better even if the food is less salty, some of the materials simply did not pair together and I regretted every minute of the meal that I paid so much for this.", "pics": null}}, {"review": {"des": "This was probably one of the best dinning experiences I've ever had. Every dish was beautiful and taste absolutely amazing. I love the ambiance and was worth every penny. Totally mind blowing", "pics": null}}, {"review": {"des": "I was a bit disappointed with the food. I went during the French nouvelle and i wasn't impressed. The presentation of the food is great and worth posting on social but the actual taste was average. The service was excellent. We didn't do the wine pairing but we did order a glass of Sancerre we which was excellent.", "pics": null}}, {"review": {"des": "We dined here last night to celebrate our 1st wedding anniversary. I have wanted to come here for quite some time and my wife surprised me with this. What a nice surprise! We were here for the Hollywood menu. <br><br>I refuse to post what we ate or drank, as I don't want to ruin the surprise for anyone reading the review. Half the fun of dining here is not knowing what comes, well, next! Rather, I am going to just give an overview on my thoughts of the entire evening. Here you go:<br><br>1. Service. Potentially the best service I have ever experienced. From the hostess upon arrival to the waitstaff, everything was absolutely top notch. I never get too jazzed over good/bad service. However, the entire team rocked. <br><br>2. Atmosphere. Very cool yet ultra unpretentious. Modern and sleek inside but super comfortable. They struck a very nice balance here.<br><br>3. Presentation of food. Over the top as one might expect for a Hollywood menu. The creativity for every dish was perfect.<br><br>4. Food. Ah yes, the main event. This is where I am eyeing Next as maybe 3.5 stars. Overall, the food was good. Some dishes were absolutely fantastic, while several were very 'meh'. Again not revealing anything here to ruin the surprise, but I was a little let down with the food. <br><br>5. Drinks. We did add on the standard/basic alcohol package. I was actually really blown away with the pairing. I went in expecting it to be wine, which I love, but it turned out to be a gamut of alcohols. Very cool and fun. <br><br>6. Belly. I have read some people saying they didn't leave stuffed. I don't like leaving meals feeling stuffed and like I am going to explode. I am not sure why you would come to such a nice place with that as your end goal. Nonetheless, I left extremely satiated. My wife and I both said that we were at that perfect level. Another dish would have been overkill. And, if you opt for the drink pairings, call an Uber. We were both feeling pretty good!<br><br>Here are my thoughts. Next is f***ing cool. It lived up to the hype overall. I thoroughly enjoyed my evening and won't forget the experience anytime soon. Would I recommend going now? I'd probably say wait until the next menu. The actual food didn't totally blow me away. I have looked at past menus and think they would be much better. However, if you have the chance to go right now and love Hollywood, you will still enjoy yourself!", "pics": null}}, {"review": {"des": "While a trip to French Laundry is still on the to do list, was super excited to see Achatz's take on his experience... <br><br>This is the first Next meal I've had that was purely about the food, there wasn't anything surprising or entertaining like past menus (i.e. In South America the basket over the table ended up as part of several of the courses).  However the food was carefully crafted and thoughtful, the courses mostly delicious.  <br><br>While I won't ruin the experience by detailing all the courses, a couple of the highlights for me were the black truffle custard (omg it was one of the most decadent, umami, amazingness I've had in a long time) and the lobster & foie gras (have to eat all parts together for a symphony of flavors).  All the desserts were also fantastic, enjoyed the range of flavors including all the mignardises. <br><br>Unfortunately I had a couple low points too- the chicken was not a table favorite, the texture seemed almost undercooked and no one at the table had more than a couple small bites. The hearts of palm salad was fine, but at this price point  i expect every course to be amazing and this was just ok. <br><br>Also had a bit of an interesting time with the wine situation... apparently this is one menu that you can't order by the bottle/glass (has always been an option for past menus) but after much discussion, the waitress finally was able to find one bottle that they were able to sell for $150.  <br><br>Overall the food was mostly great as expected, but star wise, fell just short of a perfect evening.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/rIrOjMXG_73EkXLPyGqDeg/168s.jpg", "caption": "Truffle custard... Oh my"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/xdSd-9jaUcVRjWzDAcCung/168s.jpg", "caption": "Lobster+figs+foie gras= brava"}]}}, {"review": {"des": "We came here for the Hollywood menu. I can't speak for any other ones. It was an amazing and fun presentation, but the food was really bad and disappointing.<br><br>Most items were very salty and/or smoky. This created a very overwhelming experience for the palette. The flavors I'd expect at such a price range were missing entirely. It seemed excessively complicated in the approach, and they failed in the delivery. <br><br>The worst part, is that 3 of the four members of our group have now come down with an unexpected urgency to use the bathroom...", "pics": null}}, {"review": {"des": "My friends and I came and experienced the French Laundry menu and it was really good, setting the bar high for one of my first finer dining experiences. We tried out Alinea the next night and I will say this place is definitely less pretentious and more intimate which I appreciated a lot more. I also enjoyed the dishes at Next a lot more than Alinea, which is probably due to the fact that, as my friend put it, \"Next is for you to enjoy your food, whereas Alinea is an experiment\". <br><br>I loved almost every dish that came out of the kitchen that night, especially the lobster and the pompano. I could eat those two dishes over and over! I also loved the short rib with the marrow (didn't expect to like the marrow but it was fantastic) and the desserts!! Every dish was explained to us after they set it down and we were all SO full by the end. I'm definitely glad I got this experience and I look forward to trying it's namesake up in Napa!", "pics": null}}, {"review": {"des": "I don't know!! I thought about this ranking a LONG time. Because grades are really sort of relative, right? And in this case, it's unfortunately relative to both her older sister, Alinea, and everything else. Alinea is, hands down, 5 stars for me. And Next is nowhere near that! But is it as average as other 3 star places I've been to? Not really...it's just....the other 3 star places I've been to are also nowhere near as expensive as Next.<br><br>We came for the World's 50 Best.<br><br>So the good: Next food is as delicious, as wonderful, as it needs to be. In some ways, it's more delicious than Alinea! I will be thinking about the bison tartare for a while.<br><br>The less good: I didn't love the setting. It's dark, a little crowded, and a little noisy.<br><br>The disappointing: The service is surprisingly standoffish. They are adequate...but I feel like the thing I LOVED about Alinea is that the wait staff there was comfortable, not snobby and snooty, and easy to talk to. Talking to the staff here was a little harder. Almost like every question I asked was pretty stupid.<br><br>Also, the table next to us had a lady allergic to nuts and they left some almonds in a dish. It's a good thing she had benadryl with her....<br><br>Anyway, I'm glad I got to go. But I wouldn't do it again. And I don't think I'd want to recommend it to people.", "pics": null}}, {"review": {"des": "Next is owned by Chef Grant Achatz and Nick Kokonas and offers an ever-changing menu (such as Modern Chinese, Vegan, Kaiseki, as well as inspirations from Childhood).  It's exciting to see what menu is being developed next, and that you can frequent this restaurant without having to repeat the cuisine you were presented with. <br><br>My friend had made reservations in advance (the restaurant is a ticket-based system), and I was excited to try this place out!  I am a huge fan of Alinea, so I was curious to see what Next had to offer.  We dined when they had their 'Ancient Rome' theme - while the presentation was beautiful, the dishes seemed to repeat in flavor and was a little overly salty (I love salt, but it was a little too much, even for me!).  <br><br>Service was impeccable, and they offer valet parking for convenience.<br><br>+ever-changing theme, approximately every 3 months<br>+ticket-based system<br>+valet parking available", "pics": null}}, {"review": {"des": "I applaud the bold nature of the concept, the vision and most importantly the buy in of the team, all signs of great leadership and good things to come. <br>I was a little underwhelmed by the exterior and entrance experience but the hospitality within the four walls immediately transported us to a very happy place. Design is modern and minimalist, dinning room is primarily banquet deuces. We were lucky enough to get one of the few booths near the kitchen and even thought the tables are in proximity and kitchen entrance is very open the noise levels were fine and the soundtrack for the evening was excellent. <br>I don't want to spoil the intellectual foreplay the menu engineering and concept drive but be prepared to be fully engaged during plate drop descriptions and I fully suggest beverage pairings as they were some of the have highlights. <br>Service team was focused and diligent, didn't miss a beat and the timing from the kitchen was impressive. <br>I think it's important to understand the experience your purchasing and how challenging the execution of something like this is so if your looking for comfort and the status quo this may not be for you. If you enjoy intellectualizing your bites and a little intrigue seasoned with ingenuity it's a must try in the Chicago area.", "pics": null}}, {"review": {"des": "For the Ancient Rome dinner, the food was on point with two exceptions....<br><br> 1. The \"salad\" with cheese  was way too much cheese.  They paired it with a shrimp which was amazing. <br><br>2. At the beginning of the meal we explained to the pompous Manager that our driver \"DD\" only wish was to have a glass of wine, was told as if we were children NO YOU MUST ORDER the full 9 glass  pairing.<br><br>There is zero À la Carte or by the bottle option.<br><br>Another diner who preferred a cocktail with the meal was also told out of luck.<br><br>Belittling customers is not the way to go about. I could have bought your restaurant.<br><br>I have had better service at a 2 star resturant.<br>WILL not be going back. I don't like being embarrassed  or treated like a child... especially when I'm dropping $200.00 each for four people. Do the math.<br><br>Spend a little more at other tastings, they are a dime a dozen in this city, that will treat you accordingly.", "pics": null}}, {"review": {"des": "We flew to Chicago on 1.13.18 to have Next's World's 50 Best Menu. Each dish was wonderfully prepared by Next's team. They explained each dish and who the Chef was and the restaurant the dish came from. We had so many favorite courses from<br>the meal and can't wait to come back to try more of Next's menus. The concept of completely changing menus every 4 months is so unique and ensures you have a different experience each time. We had a 5pm reservation when they opened and I did this intentionally to ensure we would not see courses in advance of us getting them (due to sitting next to someone who had an earlier reservation and was ahead of us in the menu progression). The finale was watching the Alinea chocolate dessert be prepared right in front of us. I had been anticipating this dessert and it did not let me down. Wonderful restaurant, wonderful staff, wonderful food, and we'll be back soon.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/T3L4dGAWwoxnIv5jHGpk2Q/348s.jpg", "caption": "First course - World's 50 Best Menu"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/KGnRNfmDwnh3ORyhWl2eLA/168s.jpg", "caption": "An Oyster's Frozen Kiss - World's 50 Best Menu"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/NY0wd8j4rgBPiEEgrR-7QQ/168s.jpg", "caption": "First course on World's 50 Best Menu - tucked inside a rose"}]}}, {"review": {"des": "Die Alpenadventur zum essen!<br><br>Well well.  Look who lucked out and found himself at Grant & Nick's famous foodie locale. Before you say anything, yes, I'm keenly aware how far beyond my means I'm living, but stfu.  It's my dinner party and I'll cry if I want to.<br><br>As fortune would have it, my coworker Alex B had an extra ticket for an opening on a Sunday at 8:45pm, but time didn't matter. I came. I saw. I ate. I conquered the 'Alps' menu.<br><br>Grab your lederhosen and let's begin.<br><br>START THE CLIMB: FRANCE<br>{ stone soup: made with smoldering stones placed in a clear vegetable broth and prepared in a herb filled teapot. served like tea, strained into a beautiful porcelain cup. a delicate and delicious amuse-bouche. 5/5<br>{ Beaufort gratin with trumpet crozets: basically, cheesy mushrooms served in a terrine with a breadcrumb crust. meh. 3/5<br>{ Salsify & apple tourton: French for 'fancy hot pocket', this was a small pastry filled with Gruyere and presented with salsify root [turnip family] and dried apple. light, but tasty. 4/5<br>{ game pie: essentially pâté [minced meat] with a layer of bread. served with gently dressed field greens and an apple-buttery-like substance.  nothing too special. 3/5<br><br>MOVIN' UP: GERMANY<br>} traditional pretzels on a wire rack with stone ground mustard and slightly pickled root vegetables. that's it. nothing at all clever or unusual. what gives?? 2/5<br>} smoked venison jerky sausages [slim jim's] with headcheese and liver spread. typical Germanic fare that didn't stand out. 3/5<br>} pork belly schnitzel with cherry & black walnut compote: topped with dressed field greens and spicy mustard crisps. actually pretty good. 4/5<br>} Raclette: potatoes, fermented mustard greens and chestnuts, topped with cheese melted by hot coals tableside. the portion of actual Raclette was too small, I felt jipped. 3/5<br><br>NEARING THE SUMMIT: SWISS BORDER<br>{ hot chocolate: dainty cup of cocoa, with milk crisp and black truffle. a great palette cleanser, with a rich flavor and velvety cocoa texture. 5/5<br>{ foraged berries: atop an ice bath sat a gorgeous honeycomb mold, inside which rested crème fraîche and preserved summer berries with cognac and honey. stellar plate presentation. 5/5<br><br>MOUNTAIN'S PEAK: SWITZERLAND<br>} arctic char: European whitefish smoked atop a burning log. presented on a trio of gold-and-white plates with cauliflower, juniper, and meticulous sauce painting. more art than food, if there was one dish that won the 'best visual spectacle award', this'd be it. 4/5<br>} goulash: hiding underneath the same burning log apparatus was a small cauldron filled with a hearty beef stock in a Barolo [red wine] base and sour cornbread. it was just like the real thing, maybe even better. 5/5<br><br>GRADUAL DESCENT: ITALY<br>{ mountain frost: bitter green salad with pomegranate bubble and fennel ice. it was refreshing, unusual, and caught me just enough off-guard to become my favorite dish of the entire meal. marvelous. 5/5<br><br>VIENNESE BASE CAMP: AUSTRIA<br>} strudel: apple, served in a sea of custard sauce. a fairly traditional dish, they nailed it. 5/5<br>} apple pie ice cream: smooth apple cinnamon ice cream with clove drizzle and crushed almonds. simple, super effective. 5/5<br>} Salzberger nockerl: a tremendously poofy butternut squash + molten caramel soufflé dusted with sugar. expertly baked and brilliantly flavorful. definitely one of the highlights. 5/5<br><br>runtime = 2 hours, 15 minutes<br><br>What surprised me the most was the team-based service which if I'm being 100% honest, was spotty. Grant's guys typically have the bar set very high, and they've always prided themselves on offering a personal touch to the dining experience. What Alex B and I received, however, was a questionable caravan of waiters with their own unique styles and attitudes. While one server did an excellent job detailing what we were about to indulge in (as well as \"where\" in the meal we were), another was quiet and uninformative. The seemingly endless parade of wait staff meant that no 2 dishes were explained the same way, or with the fervor and thoroughness you'd hope for at an upscale place like this.<br><br>What I anticipated was storytelling via food, but only one staff member mentioned anything about the Alps. Everyone else seemed oblivious to the fact that they were working at Next....not to mention that most were WAY too eager to clear plates. On several occasions I found myself saying \"wait, sh*t, I'm not done with that yet!\"<br><br>Bread = 5<br>Circuses = 3<br><br>In summary, while Next is truly a novel, high-end dining experience, it definitely wasn't perfect. The food itself had only minor flaws, but the incongruities with the service were more substantial. Between the lack of whimsical description from some and the unnecessary hastiness of other servers, I was disappointed that my trip into the Alps wound up being more of a pricey European dinner and less of a culinary expedition through the mountain range.<br><br>What's Next on the rotating menu? French Laundry. Which I has no money for   ='(", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/rzdhlWxMP3YmVQWrkHPong/348s.jpg", "caption": "Le Menu in all her glory. The Alps was $125pp, rather low for NEXT."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/De6gASwBqpT24coiGydRHg/168s.jpg", "caption": "So.....what's Next?? Whatever it is, Eric S probably can't afford it."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/oyXeYxn3JqYPqoDTudrpLQ/168s.jpg", "caption": "Dessert: cinnamon clove ice cream (L), apple strudel in custard (C), and Salzburger nockerl (R), a soufflé. #sweettooth"}]}}, {"review": {"des": "Overall: Best 5-star bang-for-your-buck that I've been to in Chicago. Not too experimental which leads to a more genuine and wholesome dining experience. A must-have!<br><br>The good: Compared to other, more expensive 5-star restaurants, the value you get here is fantastic. Both portion and taste wise, you won't leave disappointed. I won't go into food specifics, but overall the tastes were great.The rotating seasonal menu is a great idea for variety, and the Alps were delicious. The presentation of every dish was unique, even the dinnerware was alps-centered. The foods were all prepared fantastically and came out at a comfortable pace.<br><br>The bad: The atmosphere is on the bland side. There was a small mirror eye-level that was quite distracting. The service was overwhelming, table staff were hounding our plates even if we weren't finished. The waiters were hit or miss, either very friendly/informative or un-relateable. Some of the dishes I wasn't a fan of.<br><br>Atmosphere: 8/10<br>Service: 8/10<br>Food: 10/10", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/d5wI6R_h-VJvwgEvuZIbOw/168s.jpg", "caption": "salzburger nockerl (souffle)"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/HLpWKOboYOg6b35VzCkA-w/168s.jpg", "caption": "Apple Strudel with clove and cinnamon"}]}}, {"review": {"des": "Food and service is amazing, but I recently found out they pay their servers $14-$16 dollars an hour.  Not really sure how they charge what they do and pay their servers what they could make and any 2nd rate banquet hall.  Many years ago in another life, I worked in the restaurant industry, and unfortunately, there are just some establishments that don't value their employees.  It's a shame.", "pics": null}}, {"review": {"des": "After watching Grant Achatz' Alinea featured on Chef's Table, my friend and I excitedly booked dinner at this test kitchen on our first visit to Chicago. We anticipated a culinary adventure of South America. Upon arrival, we were offered a delicious iced treat called Mermelada con hielo, which was perfect since it was a bit warm and muggy that day. It was like an elegant slushy with chili seasoning and cardamom. The next 7 courses that came out was like a much talked about and hyped roller coaster ride that hit a few plateaus and did not manage to thrill me as I would have expected with this restaurant's reputation. <br><br>The highlights of the meal:<br><br>Ceviche - the aji, lime and orange one was fantastic, despite the spicy kick, which I usually avoid. The acidity was perfect, aji was fresh and the orange and lime were not overwhelming. I also loved the presentation because it was the perfect blend of Japanese and Latin America. Japanese style bowls served over an ice box.<br><br>Curanto - the chorizo and figs were was served on a beautiful black, lacquered bowl. The chorizo is perfectly seasoned with multilayers of salty, meaty, slightly sweet goodness. It's not as dry like your traditional chorizo, which I liked. The figs were a nice, sweet complement to the saltiness of the chorizo. <br><br>The lows of the meal:<br><br>Sudado - the salmon tasted like any other salmon I've had, and the broth, which included cacao, did not elevate the dish. <br><br>From the mercado- the quinoa, canchita, galleta dish was a bit too sweet. Really mushy texture. <br><br>Service was top notch with the exception of 2 hiccups. One server had mentioned if we enjoyed the Regalo, but we weren't served it yet, so the surprise was spoiled. Second, another server said if he could take our \"stuff\" away. I am a stickler with the way people say things, and when I pay $150+ to enjoy a fine dining experience, I would expect a staff person to describe our meals more than just \"stuff\". The heroine of the evening was our main hostess who arranged a last minute table for my friend and I at the Aviary, which was right next door, for an after dinner drink.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/tV1Jlq-rQ4fN51dxOK-VAA/348s.jpg", "caption": "Man, I love guava ice cream. Donut was okay."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ppgG8yATJgVu9rUZs73_Pw/168s.jpg", "caption": "Chorizo was fantastic."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/C7QidypSOkr10sc8emwIqw/168s.jpg", "caption": "This was the surprise that got spoiled!"}]}}, {"review": {"des": "Fives given very seldom by this reviewer. Expectations also very high after ten or more years of hype by the press. All accolades absolutely earned and deserved, in my opinion. A perfect nexus of dining and art. The Tock reservation system is initially a bit daunting but after experimenting, is pretty useful. The experience: I'll try to say a few things that haven't already been dwelled upon at length:<br>   Reception-greeted by name, ushered by a team to our chefs table<br>   Orientation-overview of the experience with first course introduction<br>   Service staff-all are knowledgeable and conversational, no made up on the spot answers<br>   Courses-great timing, dramatic presentation, artistic flair<br>   Pairings-carefully, thoughtfully vetted for optimum impact<br>   Dessert-beyond description, tour d force!<br>   Final notes-the dream of every foodie in a fine restaurant? Meet the Chef. At Next, the Head and Sous chefs prepare dessert and invite the guests into the kitchen for a photo.", "pics": null}}, {"review": {"des": "The service was amazing. The staff were beyond attentive to every possible need we could have. First, I have a food allergy which unfortunately is to an ingredient in nearly every dish on the planet, but the staff were relayed the information and made sure all dishes were safe for me to eat. We went over to the Aviary after, and the staff communicated my allergy to our server there as well, they really went above and beyond. If you've never had to deal with a food allergy, you'll never fully understand how amazing it is to eat with out fear of becoming ill or having extreme difficulty breathing. Our meal at Next was perfect in that regard, and I'm so grateful! Thank you! <br><br>The food and drink pairing (non-alcoholic) was a really serious journey of such bold and intricate flavors; often flavors I've never experienced together, that tasted like they were meant to be. I was worried the dishes were going to be these really weird outlandish foods that I wouldn't want to eat (because I'm a picky eater), but aside from the venison (which was much to raw for me) I wanted more of everything... And this is where the trouble starts. Maybe it's just me, but for the incredibly high price tag, I expected to leave dinner full, not hungry.. the starter was two or three bites of a caviar and cantaloupe dish which I would have really enjoyed doing more than just tasting it, I.would have liked to eat a little more of it. The next was a cool lobster plate, with a total of 13 single bites of food, 5 bites from lobster tail and two each of something from the claws, an asparagus thing, a salmon thing and something else.... All literally one bite each. For the soup, we were ladled out two spoon fulls of a soup which was mind blowing, but again..... Two scoops worth. There was also a single slice of chicken breast with veal tongue, tasty, but that only consisted of four bites of food. <br><br>I feel really incredibly disappointed in the actual dining part of the experience. I left the restaurant hungry after we spent more than most people in the city make in two weeks. I think the boy friend still wants to go to Alenia- even after this experience- I know that I will do my best to talk him out of it and go to a steak house, where they actually serve dinner.<br><br>Was it full of flavor, yes.<br>Was the service amazing, yes yes yes yes.<br>Were the dishes artistically arranged, yes.<br>Did I leave full, no. <br>Would I recommend eating here?   Not unless you like throwing money away just to taste food, but not actually eat it.<br><br>But maybe I'm not not sophisticated enough to get it?", "pics": null}}, {"review": {"des": "This review is for World's 50 Best Restaurants - this is a carefully curated sampling of dishes from some of the restaurants that are on the list.  We ate at the kitchen table and for us, this was 18 courses, from restaurants around the world, including Spain, Denmark, Peru, France, Italy, Germany, Netherlands, Mexico, Australia, Singapore and the US.  This was one of my favorite meals at Next, as nearly all the courses were delicious.  As always, the stories and explanations that accompany each course are fascinating.<br><br>The hits:<br>*Eggs Benedict - from Eleven Madison Park in NYC - caviar, hollandaise, white asparagus, ham and other stuff - so artfully presented, so decadent.<br>*King Crab - from Noma in Copenhagen - Fresh crab, beef garum, hens egg yolk, rose miso - this was probably my favorite dish of the evening.  The crab is enrobed in an umami-bomb of a  sauce made from the egg yolk, fermented beef, and miso.  WOW!<br>*Riso Cacio e Pepe - from Osteria Francescana in Modena, Italy - this is risotto made in the style of cacio e pepe - so simple, so delicious.<br>*Memory - from Restaurant Andre in Singapore - foie gras custard, black truffle gel and chives - quite a memory indeed!<br><br>The not my favorites:<br>*Oysters Frozen Kiss - from Mugaritz in San Sebastian, Spain - where's the oyster?<br>*Badger Flame Beet - from Blue Hill at Stone Barns in Pocantico Hills, NY - these are beets that have been selectively inbred for over 8 years to remove the earthiness and enhance their sweetness - these beets are served raw, thinly sliced, with just olive oil, salt and pepper - guess what? they taste like carrots.<br><br>The dessert course was interesting and delicious too - from Alinea in Chicago - our table is cleared and a silicone tablecloth is put down.  Chef then comes over and places chunks of liquid-Nitrogen-frozen milk chocolate mousse all over the table, followed by shards of compressed and dried blueberry, and some sauces and other goodies, all artfully painted and arranged.  It's like a Jackson Pollack painting!<br><br>The kitchen table wine pairing is very delicious too.<br><br>If not for a couple of courses, this would have been 5 stars for sure!  The meal is very expensive, maybe the most expensive one ever at Next.  However, the cost of eating a meal at any one of the World's 50 Best Restaurants probably would be about the same.", "pics": null}}, {"review": {"des": "Perfection! My husband and I have not been to Next since 2012, and I regret that it took us so long to visit again. The French Laundry menu was done with such precision and care. The quality of each ingredient shined through. One of my favorite courses was a dessert made with a variety of apple types. You could taste each one throughout the dish. It's this type of skill that makes Next stand out above the rest. <br><br>Service was friendly, informative and simply outstanding! I ordered a single glass of wine and was treated with equal courtesy as someone who ordered a full wine pairing. At the end of our meal, the hostess graciously escorted us over to the Aviary, without a reservation, for a post dinner cocktail. It made for a spectacular end to a perfect night.", "pics": null}}, {"review": {"des": "We really wanted to enjoy this more but left underwhelmed.  Maybe comparing to our experiences at Alinea (or similar restaurants) is not fair?  For the price and reputation we expected so much more from the food and the service.<br>We did the French Classique menu for 1 omnivore and 1 pescatarian. All staff were highly aware of the differences in our menus and did a wonderful job of explaining the different preparations. The meal began with an amuse-bouche and wine infused with cantaloupe. It was nice to have a Vin Jaune which is very difficult to find.  The service ware was a real stand out.  Everything from the soup tureens to gold rimmed plates. The food highlight was the lobster and accompaniments. <br>We did not pre-purchase the wine pairings as we prefer reds but when we spoke with the waiter he indicated there were only 2 red wines available. A French Pinot and an Italian Cab Franc. Seemed odd that the second selection was not French or that the selection was very limited.<br>We had a total of 7 courses including the amuse-bouche and dessert. Flavors were good but overall the servings were not generous. Compared to the 15 to 17 courses at Alinea or Oriole this was a miss.  <br>In addition to the food, the service was also off. One woman who cleared between courses was relatively abrupt and perfunctory each time she stopped.  Our waiter spilled wine on the table and on the bottom of the glass during the initial pour and did not notice nor clean it off.  I had to use the table cloth to keep wine off my wife's dress. We were not offered a second glass of wine. We were abruptly offered coffee or tea \"black like you had in a Chinese restaurant as a kid\" when we had no idea what course we were on.   3 times someone stepped on my foot under the table.  <br>There were no options for an after dinner spirit, port, similar.  Our waiter commented that \"classic French cuisine did not normally do a digestif?\".  We would have also thought for a classic French meal that it might have finished with a salad or a cheese course  Finally, one of my wife's dishes had a hair on the plate. To be fair, the house manager checked if my wife was \"OK\" after we pointed out the hair.  They did comp our wine and eventually put a napkin over the spilled wine after we pointed it out.<br>Maybe it was just an off night but given our expectations and experience at Alinea, we would likely just go back to Alinea instead.", "pics": null}}, {"review": {"des": "Drama drama.  Foodie place trying to hard.   Scale down the circuses and serve some food.    Concept of Charlie trotters.  From years ago.  But his place had really tasty food.   The experience was great but is wk night you just want to eat.  Maybe on a second date or third date ! I just don't see all the fuss about this place.  The Hollywood movie night presentation was fun.", "pics": null}}, {"review": {"des": "I'm usually a massive fan of Next and have been to 3 other seasons but found that Hollywood did not make the cut. We just ate at NEXT today and the octopus was tough, horror was beets gone wrong, the dessert did not have balance, nothing on the menu this time was cravable or eye opening which is what I love most about NEXT. I wished we could have gone back to \" the Alps\" or \"south America\". I literally left the restaurant questioning NEXT tonight  and thinking to myself- is this a restaurant the real deal or an imitation. None of the dishes had soul...", "pics": null}}, {"review": {"des": "I came to Next to experience \"Tour of South America\" and had an amazing time, food and service wise. Each of the 8 dishes were original, flavorful, beautifully presented and delicious. The service we received from our multiple servers was impeccable, with humor infused throughout our time there.<br><br>The issues I had with my dining experience at Next came when the lights went out due to a rain storm and the bathroom flooding...found out about this when my date was down at the bathroom and stepped in the water. Now I understand that Mother Nature can be a moody you know what and that's not the fault of Next. However, I heard one of the managers say that the power had went out the night before, but this time it was worse. Now if the power had went out the night before and the forecast showed rain...or possibility of rain, I would think that the entire staff would be ready with candles and matches just incase the power went out again. We sat in darkness for about 3-5 minutes which I wouldn't have cared about, if I hadn't paid over $300 to dine here. Once the lights went out I felt that everything was sped up to get us out of there, which tainted the overall experience for me. My last issue was that we weren't given a menu of what we had eaten. I've been to tasting menus around Chicago and in other cities and I've always been given a menu to take home. I will say that the restaurant did send me copies of the menu after I emailed requesting them.<br><br>While my experience at Next wasn't ideal, I will go back to try a different tasting experience.", "pics": null}}, {"review": {"des": "I had high expectations for Next Hollywood since it is a sister restaurant to Alina. It was a bit disappointing because the service/performance felt like it was stage/enforced and not sincere. The servers probably had to do this a million times over so maybe that's why they sounded so exhausted to repeat the same things over and over again.<br><br>The food was bursting with too much flavor meaning - it was good and interesting but there was no palate cleanser or something to sooth your tongue in between dishes. Everything was very salty and strong so our palates got very tried and exhausted by every dish at the end.<br><br>Next's selling point is really the performance (There are surprise performances on the way). But since the tables are so close by and open, you can easily see what's coming next from the other tables. And when suggestion to one of the manager was given by our party (regarding a reconsideration of rearrangement of tables or same starting time of dinner of some sort), he came off a bit strong saying that they've considered everything and there's nothing they could do. I'm sure they have considered it many times but he could also just have said \"thanks for the advice\" rather than picking bones. But overall, its a fun experience but will not return again.", "pics": null}}, {"review": {"des": "So! New menu, & went there with new menu after only 2 days of previous service.  Thoughts:  everything tasted amazing! But !!!<br>Service: some imperfections like dribbling soup on table cloth, getting another glass of wine & told meat courses coming up-it was one meat course, so we ordered red wine as recommednded, which arrived after we ate the course...then it wasn't more meat courses, it was desert. We would've ordered dessert wine not red wine if we knew that. Also coffee came after dessert already done so we didn't have it to compliment the flavors.  Also some shaky hands with servers. Confident talkers, but shaky, unconfident hands.  <br>Menu: short menu.  I'm a size 6 female and totally wanted more food.  I can't imagine how hungry a big guy would feel after.  Venison course-they cut half it up for the table - so one tiny medallion each, & take the other half away! It felt weird to have meat brought to the table but then half taken away. Why wouldn't you give everyone 2 medallions each and not left the table with a weird feeling of where's the meat going?!  <br>We were offered Squab for extra $300 .. First of all, say $75 each is a better sale than $300. If we knew it was a short menu (servers acknowledged short menu at end of the night), would've considered it.  But I think the squab should've been built into the price from the start.  <br>Not the best Next menu considering all the amazing past ones.  Still worthy of excellent food, but if there's one to miss... This might be the one if you've gone to a lot of the past ones- it's a high bar in terms of $ / expectations.", "pics": null}}, {"review": {"des": "We went on Hollywood night to Next. It was coy, delicious and just plain fun. The chefs presented 15 dishes inspired by different films and a skillet of perfectly popped fennel-enhanced popcorn (theatres could easily boost attendance by serving this). <br><br>Each entree was a full-scale production - the Star Wars' amphibious dish lay on Han Solo's gun and the Breakfast Club's soup came in a vintage 80's thermos and a fancy pixie stick. I thought my favourite dish would be the Honey I Shrunk the Foie Gras dish that came with a magnifying glass and giant flowers, but the musky richness of the foie gras felt confused against the granola and strawberry layers. In the end, After much deliberation, I decided that the Oscar should go to Dorothy's gingham plated entree, which featured the lively daintiness of fresh veggies. Best cinematography went to the scallops hiding in the depths of submarine portal drawn up from 20,000 Leagues Under the Sea and best supporting role went to the \"Coffee and Cigarettes\" truffle in the \"Life is Like a Box of...\", which captured the warm burn of a fresh cigarette (don't worry, no carcinogenic ingredients were used) in the melting chocolate. Not all the dishes were blockbusters, but each dish was uniquely memorable.   <br><br>FYI - Our server told us that the fall/winter theme will be the world's best restaurants. They've reached out to the world's 50 best restaurants and created a menu based on recipe highlights from these restaurants. Around the world in one meal!", "pics": null}}, {"review": {"des": "4.5, A really great celebratory meal. We were at the French Classique menu. It was less experimental than I expected, but everything was very interesting and very good. Mostly a normal high-end tasting menu experience, but prettier and probably the best tasting one I've had.", "pics": null}}, {"review": {"des": "The food was fantastic, but it was not worth the price. The tables in the dining room are very close together which means you can clearly hear the conversation happening at the table next to you. It is very loud in the restaurant and difficult to hear your server explain the course as they present the food. We were given a 9 course meal, and 3 of those courses were part of desert. While the food was delicious and well presented, the whole meal only took about 90 minutes. For a fine dining experience like this, I was expecting more courses and a longer meal. I have dined at Goosefoot before which offers a 4hour, 16 course meal, with a more spacious, quieter dining room, for a better price. Would I come back to Next? Probably not....", "pics": null}}, {"review": {"des": "This review is for when I went to Next a few years ago with some friends for their Bocuse D'Or menu. The food was amazing and the as well was presentation was magnificent and inspired. I would definitely come here again.", "pics": null}}, {"review": {"des": "Had the 1996 TFL menu and it was perfect. I did the non alcoholic pairing for an additional $85 and I have to say this was the best choice. <br><br>All the non alcoholic drinks were unique and paired beautifully with each course.  My favorite one was the first one pairing with the canapés consisting of honeydew melon, cranberry, quince, allspice and versus blanc.<br><br>Some of the dishes that stands out the most were \"Oysters & Pearls,\" \"Sweet Butter Poached Lobster,\" and \"Verjus Sorbet.\"<br><br>Service was impeccable. I was told by our waitress that all the staff at Next were hired and trained and most of them had no fine dining experience. It seems at the Alinea Group they really want inexperience wait staff and start them from the bottom.<br><br>Overall food, drinks and staff deserve a five star from me!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/G-iFSOqS7CzzEoe2gX1vKQ/348s.jpg", "caption": "TFL circa 1996 menu"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/u4ZzpJ4eJGuvgrLTuS61eA/168s.jpg", "caption": "Sweet Butter Poached Lobster"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/YfpxZPfF1df0D-DY_dgiPA/168s.jpg", "caption": "Storey Farms Chicken"}]}}, {"review": {"des": "Love this place. Make sure you get the pairing wine tasting it's a way better experience that way. The presentation is one of a kind and it's connected to the aviary and the office so go get drinks after your meal you won't be disappointed. Such a unique experience worth the money.", "pics": null}}, {"review": {"des": "You have to take a leap of faith coming here, you don't really know what you will be eating specifically. It's great for people wanting to try food or experience new ways of enjoying it. We went here to celebrate my graduation and they were serving the hollywood menu. Very creative as far as the incorporation of props and choice of serviceware (I never thought a porthole could be used as a bowl, yes, a porthole). The meal is planned, no \"substitutions\" or \"a la carte\" for the people that are wondering, it is all layed out as a performance/story and it is very much worth your time and money to come and enjoy it. We spent about 3 hours dining, so plan ahead if you are doing something after the meal. After the meal we were given a copy menu of what we had had to keep, they bent over backwards and had specially printed \"congratulations\" at the bottom of mine, I have never had more accomodating service ever, period. We even got a tour of the kitchen and got to speak to their Exec. Chef. I also think it's worth talking about the portions and how some people might ask about being \"full\" after a meal. I didn't specifically feel \"stuffed\" after ours, rather the feeling was being satisfied and not having the desire to eat any more, so there isn't a reason to worry about the whole \"being full\" thing, and I think a lot of the other reviews would agree with that. I highly recommend getting the earliest booking time avalible, being a 3 hour meal it's better to start early, and you will also be more surprised when your food comes out if you haven't seen other people already get it.<br><br>We watched Grant Achatz' \"Chef's Table\" episode on Netflix and that is why we knew about him and his restaurants. If you are unsure about what this restaurant is about, you should really watch the episode Netflix did. Alinea is his first and the flagship restaurant but he carries over a lot of the ideas from it to Next and you get the same \"wow\" from the food.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/mXzdqWy-VdtXXuLfcEh67A/168s.jpg", "caption": "Menu is 16 courses. The items on the lines grouped together were served together."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/vwcOfpFcPZ9xry5G0rcWzg/168s.jpg", "caption": "Serviceware was a porthole like object used as a bowl. Inventive."}]}}, {"review": {"des": "French Laundry! It was incredible! We've dined here several times and this was my favorite menu. <br>Impeccable and attentive service, delicious food. <br><br>I highly suggest getting into Aviary (next door, same owner; Grant Achatz) for a nightcap after; makes a perfect evening.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/-QjkaeVa7zqev6V3UJtZxA/348s.jpg", "caption": "Lobster with melted leeks, beet essence."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/71tPcIYcli3vCsTItZj8Xw/168s.jpg", "caption": "Pompano Amandine"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/K3pmZC4pkNHsthLKOfAipA/168s.jpg", "caption": "Beef short rib with bone marrow"}]}}, {"review": {"des": "I think that 1 star is being generous- I'm so appalled with the way we were treated!  I have been dying to go to this restaurant since it first opened.  My girlfriend was going to Chicago for business and my husband suggested I meet her out there -So I flew from Southern California to Chicago to come to eat at this restaurant.<br><br>When we arrived everything seemed great.  Sadly, with each course that was delivered we felt we were being PUNKED.  The food was so bad we couldn't finish the courses and we had to leave halfway through- it was too unbearable to sit there any longer.  It was so over salted that it wasn't edible.  The wine pairing wasn't any better.  I couldn't finish any of the wines paired.  <br><br>To make the night even worse, I gave my scarf and my coat to coat check.  When it was returned, my scarf had 2 spots where RAW meat was smashed into it.  It was so gross.  Yes, they apologized and said they'd pay for my dry cleaning.  They tried to say they don't know how that happened that they don't have anything like that at their restaurant-but we had meat in our courses-so YES you do!<br><br>I got home and took the scarf to the dry cleaner-at first run, they didn't get the grease out so they tried again, and sadly it wasn't possible.  I sent an email to Benjamin Park the day I got it back explaining this.  A week later after no response, I emailed him again, no response.  The 3rd email I sent to the only means of contacting the restaurant via their hospitality email  and copied Benjamin, no response.  The fact that a restaurant of this caliber doesn't even have the decency to respond is disgusting.  I didn't tell them what to do, I simply gave the facts-we spent over $600 on a meal we couldn't finish-and we had to go somewhere else to eat, they ruined my $400 scarf and I paid for the dry cleaning they said they pay for.  I simply said to do the right thing-I guess they feel that ignoring someone is the right thing.  Shame on you Next.  I would highly recommend anyone thinking of going to reconsider this choice-go to the Girl and the Goat instead-we had way better service and the food was delicious.  Save your money!!!!!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/zrcsyTiU6txuwxwh-o0Dxg/348s.jpg", "caption": "A brighter view of the raw meat that somehow landed on my scarf after dining at Next"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/2rdHGruy5o9FKpmk28kwBw/168s.jpg", "caption": "This is the raw meat that was gifted to me and my scarf after my horrible visit to Next"}]}}, {"review": {"des": "I usually do not go to this type of restaurant but wanted to splurge for my birthday last night, and I'm so glad we did.  Absolutely everything was wonderful and if the \"theme\" is something that I will enjoy, we will be back.  I can't remember everything we had for this \"Chilean\" experience, but I'll try!<br><br>We started with a \"Mermelada con Hielo\" - when we checked in.  It's like a little frozen peach sorbet / shaved ice.  Just a small starter on your walk to your table.  <br><br>The meal started out wonderfully with a pisco sour and several different ceviches with sweet potato chips.  We love pisco sours, so this was a great way to get the meal started.<br><br>We then had four different crudos paired with a cachaca - a grapefruit inspired drink.  I could have had a whole pitcher of the cachaca alone - that was wonderfully concocted drink.  There was one crudo that had a spicy pepper on it - that was our favorite, but each ceviche went really nicely with the cachaca.  <br><br>They then opened a small \"picnic-like\" basket from above that had small snacks - quinoa/goat cheese, un-popped popcorn, and a beer type - apple cider.  Cute gimmick, but not needed.<br><br>Then came the tuna croquettes with jalapeno sauce, tomato salad with a nicely paired Sauvignon Blanc.  I'm usually not a white wine fan, but the wine was very refreshing with the dishes.  <br><br>Also served was a type of Sheppard's Pie - sadly, this was my least favorite dish of the night - it was paired with a Bonarda red wine.<br><br>We then moved onto the salmon dish - paired with a Pinot Noir.  There were little jalapenos in this dish - which wonderfully gave it a nice and spicy finish.<br><br>Next was the cuaranto - chorizo sausage, figs, and potatoes - paired with a Chardonnay.  This was delicious.  The chorizo sausage was nicely spiced and went beautifully with the potatoes.<br><br>We then finished with a sherry type drink with a donut, guava sorbet, and a chocolate / blackberry dulce de leche.  Another dish that we could not get enough of.<br><br>I do not do the dishes above any justice in my description, but I wanted to try to describe a little so you know what you're getting.  With the exception of the \"Sheppard's pie\" dish, everything was done so beautifully and was extremely tasty.  Another reviewer commented on how seafood heavy the courses were, and while they were, I thought that was the best part of the meal.  I usually do not \"love\" seafood, but the chef here made me \"love\" seafood.  They were done so well.<br><br>We did the Standard Wine Pairing and we're happy we did.  All of the different drinks blended so well with the courses.  From the cocktails to the wines.  It is a lot to drink - in a little over 90 minutes, but that's what Uber is for!<br><br>I would be remiss if I didn't comment on the staff here at Next.  Superb!  We had so many different people clean our table and bring us food and drinks - it was hard to keep track of how many people go into this restaurant to make it such a success.  They were extremely kind and accommodating.  <br><br>Yes - this was expensive.  $400 for two people - including the tip/tax and the Standard Wine Pairing.  But it was an experience we will both remember.  I could not recommend Next more.  It's not something we will do every month, but if there is a food/country theme that we<br>find interesting, we will definitely be back!", "pics": null}}, {"review": {"des": "The recent edition of Next is Hollywood and the dishes are loosely based upon specific movies. In the multi-course, small bites world, this meal was definitely both culinarily interesting and fun/energetic. Sometimes this format can become drudgery and one gets over-stuffed. In this case: lots of entertainment and levity plus a reasonable amount of food.<br><br>The courses come at a fast pace with the kitchen always on point. Our favorite courses were \"Breakfast Club\", which included a bento box, a ham and cheese sandwich (the \"white bread\" was actually made of some sort of pecorino like cheese made airy), soup and a pixie stick. The beverage included was sake in a juice box format.<br><br>We also loved the \"Honey I Shrunk the Kids\" course in which the tidbit of foie gras, chamomile and sunflower was under an eyeglass on a stand.<br><br>We bought the standard wine pairing which included some amazing pours, starting with a split of Möet & Chandon Brut. There were beers, cider, sake and wines ranging from Trimbach riesling to some excellent pinot noir.<br><br>Our servers were all professional yet fun, particularly Dani, who definitely had a great sense of humor. Chef Jenner was kind enough to give us a kitchen mini-tour at the end. All-in-all it was a great experience and one that we would do over (and in other themes) when in Chicago.", "pics": null}}, {"review": {"des": "Last night was my 1st time at Next to experience their Tapas menu. I'm no expert but I visited Spain a few months ago so I wasn't sure what to expect. They hit the main flavors and elevated them in their own execution. They described that most of the inspiration was from western part of Spain which I didn't travel too. <br><br>The 1st course (flatbreads) is already set up before you arrive at your table. Depending on the person, this could seem like the restaurant is rushing us but it is passable as you go through the rest of the menu. Service is timed and impeccable. The BF and I opted to share 1 wine pairing since I can't drink too much. The worked well for us as they flood the table course after course and we felt slightly full by the 4th course (the tender pork belly and baguette). <br><br>Foodwise, the highlight was the pork belly that was lit on fire at your table. it looks all burnt and black that you would think they were serving you cancer. I didn't even recognize the baguette. Oddly it didn't taste burnt and the black sauce and the pork tasted amazing. We also enjoyed the cod chips and cod dip course. The octopus was cooked well but sauce at the bottom did get a bit salty. I was fascinated by the spherical olive essence literally bursting in your mouth with oliveness (yes that is a word now) as did the tempura fried egg yolk. The no fail patatas bravas did not fail in Next's execution. There was certainly \"cool\" and \"odd\" factors in presentation throughout the meal such as looking for chocolates in an olive tree, the supervised tube shot of flavors and smoked prawn with ice cream. <br><br>The biggest let down was the steak and eggs for us. The steak was too cold and the eggs were good but salty. It felt heavier than the rest of the menu. It was almost a chore to eat it. the sepia was also only okay. <br><br>In regard to wine pairing, we really enjoyed the vermouth and the 1 cocktail the most. <br><br>Overall, certainly an experience. Looking forward to the next experience :)", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/VwTnNYqmvHVbUtUIjPuryQ/348s.jpg", "caption": "Cod chip with cod dip"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/gS3zhPgJIMCYScnM2kBTkg/168s.jpg", "caption": "Prawns"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/G2zAcn0pAU_rt5LUJ3TwzA/168s.jpg", "caption": "Tapas menu"}]}}, {"review": {"des": "My friends and I booked a table at the Hollywood meal. I wanted to love this place as I love the concept but I wasn't blow away by any flavors. Overall the food was interesting but nothing mind blowing. I think my one complaint was the staff. The staff was friendly but they were overall uninterested and seemed exhausted. They often delivered their lines unenthusiastically. I get it; a long day and a lot of hard work. However, next charges 20% for tip upfront and I think we hardly got service that warranted a 20% tip. This type of meal is made more exciting through the staff and they definitely missed the mark. Overall, I felt a bit short changed for how expensive the meals are.", "pics": null}}, {"review": {"des": "My guest and I dined on the 'Hollywood' menu and I  cannot begin to describe how wonderful the entire experience was. At our slightly early arrival, we were escorted next door to The Aviary and greeted with a 'welcome' drink and a table next to the bustling bar/kitchen. At Next, our table captain was friendly, knowledgeable, and ensured that my guest's dining restrictions were not only honored but reassured us it was his distinct pleasure to do so. His team of runners was articulate and intelligent and had a shared playfulness to their delivery of the food. Every item that came out of the kitchen was a delight on its own. Particular highlights for me were the 'Wizard of Oz' dish and a hilarious tribute to 'The Breakfast Club.' Not to give too much away, but the use of bread (or, lack of) in that dish was astonishing.", "pics": null}}, {"review": {"des": "Great experience all the way through, and excellent food! We went for the Ancient Rome menu (our first Next experience) and were very impressed with the atmosphere, the service, and the food. The menu was very well thought-out, and combined more traditional preparations taken from the Ancient Roman cookbook with some very modern takes on the recipes (prime example - the first \"dish\" was like magic! But clearly drew inspiration from the book. I won't say more since I don't want to spoil the surprise but it was great). <br><br>Service was excellent - everyone there clearly knew a lot about not only the foods, but also the Ancient Roman traditions surrounding the foods. The incorporation of those stories from history added a lot to the experience, and was very impressive.<br><br>There was a great flow of smaller to heartier meals through the menu, and there was just enough food to where I *almost* thought I wouldn't be able to eat any more, but then we got the last dessert course and I made it through. Everything was delicious, a very interesting/unique combination of flavors, and the presentation was outstanding. The servers also asked for our opinions on many of the dishes, and whether we had favorites or least favorites and why. I thought that was interesting - it was the third night they were serving this menu, so seemed like they were gathering feedback to incorporate in future nights with this menu.<br><br>At the beginning of the meal, my boyfriend mentioned that we were interested in checking out the Aviary (the bar attached to Next, right next door), and one of the women there said she'd talk with the people there to find us an availability if possible. Turns out, there were two seats in The Office (the 20-person capacity \"secret\" lounge below the Aviary) - a great surprise ending to our amazing meal! I'll write a separate review on that, but definitely mention the Aviary and/or the Office at your Next dinner, if you're interested in checking it out.<br><br>We ended our Next experience with complimentary tea, which was delicious and a nice surprise, and headed downstairs to The Office. When we finally left the building, there was a cab ready for us outside - like I said, great experience all the way through. If you're considering a night at Next, I highly recommend it!", "pics": null}}, {"review": {"des": "I've said it before and I'll say it again: I'm a simple girl with simple taste and I'm not a fan of overpaying for some trendy over the top restaurant experience. But every once in a while, you agree to one of these meals and call it an experience. Plus, I like French cuisine. So when my friend invited me to bistro night at Next, I agreed. <br><br>The service at Next is exceptional. They take care of your every need. The server asked us if we had any allergies and I said that I cannot eat or drink anything touched by orange peel, which was a good thing because one of the drinks included orange and they modified it for me. We opted for cocktail, wine, beer pairings and my friends ordered some extras, but I stuck with the original menu. It was expensive enough!<br><br>The crusty bread on the table and flavored butter was a nice way to begin the meal. The drinks were all delicious and I was pleased they refilled our glasses. All the courses were of generous portions and a bit heavy, as rustic French food can be, but worth over stuffing ourselves with. <br><br>Amuse-bouche: chicken custard with crispy chicken skin served in an egg shell. The serving method was the star in this dish, but the flavor certainly matched. Who doesn't love fried chicken skin?!<br><br>Hors-d'Oeuvre: potato and leek soup. Delicious. Came with some potato chips. Couldn't eat just one!<br><br>Poisson: skate wing. This was one of those dining experiences as we were taught how to debone it ourselves. I was nervous I'd screw it up, but it was quite simple to do and ended up being delicious. Again, fried is good. And I love brussels sprouts. <br><br>Premier Plat: caramelized onion tart. This is the only course I didn't finish and maybe I was saving room, but really, I just didn't like it. I tried some of my friend's escargot with pull apart bread and it was so wet with butter that it nearly choked me. I love butter, but not when the bread is dripping with it. This was the worst course of the night for all of us, I think. <br><br>Plat principal: leg of lamb. My favorite course by far. Perfectly cooked, and melted in my mouth for a seriously flavorful experience. My friends ordered the pressed duck and that was quite cool to see. A very sexy show, really, with a hot chef destroying a duck and then stuffing the leftovers into a crazy contraption that I thought for sure would squirt duck juice all over me. Instead, it squeezed out the base for a rich jus that made the duck even more amazing. We also got green beans as a side and they were crisp and tasty. <br><br>Entremets: I chose the only non orange dessert available: a lemony tart that was a refreshing end to a great meal. <br><br>I'm not entirely sold on the $230 experiential meal, but I don't regret this one and I recommend it for everyone to try at least once. Science does say it's better to spend on experiences than goods, and a creative meal with good friends is quite an experience!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/kdXIY13bAG3frsXtxilALA/348s.jpg", "caption": "Duck press"}]}}, {"review": {"des": "We saw a last-minute Friday night reservation for Next's Ancient Roman menu, so of course we had to jump on it. It was a fun evening with friends...the menu theme was clever, the presentation was beautiful, and the service was quite good. While I'll definitely consider returning the next time the theme strikes my fancy, it was nowhere near the best dinner I've had in town. Some of the courses were solid...the shrimp/olives/walnut, leek/red cabbage/butternut squash and quail/spelt/lovage dishes were some of my favorites of the evening. But a couple things were misses for me...most notably the oxtail/turnip/horseradish course (which is surprising, as oxtail is one of my favorites), and one of the sauces on the venison. I did like that they did a fun bread course...baked at the table and with an interesting back-story regarding Roman soldiers. I wish more tasting menus included breads! All in all, fun, but for the price-point, there are other Chicago restaurants I would recommend over Next.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/P7oX4lgFfdbunRrrcJAu0Q/168s.jpg", "caption": "Bread...Baked at the Table and with a Fun Back-Story!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/8dsAnCX73JL1rZNg5qCkgQ/168s.jpg", "caption": "Oxtail...Disappointing"}]}}, {"review": {"des": "Hollywood was my first time at Next, and it was very disappointing.   They seemed more interested in trying to be cute with the movie tie-ins, then making delicious food.  In the end, they failed at both.  The movie tie-ins were silly --- white anchovies and wizard of oz --- huh?  Even the waiter had a hard time explaining many of them.  Some courses were left unfinished by everyone at the table --- the 20,000 Leagues under the sea was hard to stomach.  And absolutely no dish was great, nothing that made you go \"wow, this is the best X\" I've ever had.<br><br>Perhaps I am missing the point of Next.  Perhaps it is not supposed to be great food.  Perhaps it is mostly theater.  I wasn't impressed by the food or the theater.", "pics": null}}, {"review": {"des": "Hello Molecular Gastronomy! This was my first experience eating deconstructed  11 course menu. We were served a Hollywood themed menu with extraordinary details to each course. Every course was as scrumptious and tasted perfect. I would have loved to have a some variety in the dessert though rather than a box of chocolates to be honest. Apart from that the non-alcoholic menu was perfect for me. I would also like to commend the restaurant for creating a special menu considering I am a vegetarian :)", "pics": null}}, {"review": {"des": "I'm not sure what to say that hasn't already been said. We've wanted to eat here since it opened, but we moved away and it was something of a miracle to find a ticket slot that worked. I've followed the menus all along and am consistently impressed by how innovative and creative they are.<br><br>We dined during the Alps menu, and the entire experience was just phenomenal. At arrival, they took our coats and seated us at a table already prepared for the first course. We interacted with perhaps 10 servers, each one incredible. Our interactions were laid back but consistently professional. I had imagined what the space would look like, but I was surprised that it was actually pretty small, well lit, and full of chattering guests.<br><br>The food was outstanding--no other way to describe it. The Alps menu had 6 courses, but each one had at least 3 dishes. Out of the ~20 components we ate, there were maybe two that I didn't care for. I ate several things that I wouldn't normally even try, but I knew Next wouldn't disappoint me. I really can't even identify a favorite dish...the preparation of vegetables, meat, fish, sauces...it was all incredible. I was hoping for some theatrics and wasn't disappointed--for example, our arctic char was cooked at our table on a flaming log encased in a glass cylinder so that it became smoke infused. The presentation and plating were flawless.<br><br>I have to give an additional plug for the nonalcoholic drink menu! The drinks were out of this world, made from flowers, herbs, juices, beans, nuts... They were made to mimic the alcoholic menu, so we had a \"beer\" and several glasses that resembled red wine. One (green) drink was made entirely of savory ingredients (fines herbes, bay leaf, and milk) and served with a chocolate course, and it was so weird and so good. I honestly felt like the nonalcoholic drinks were much more interesting and showed a lot of technical skill that would've been missed with the wine menu (but I don't like wine, so there's that).<br><br>If I had one piece of advice, it would be to eat nothing the day before you come to Next...keep as much stomach space available as possible because you'll need (and want) it. At the end of the meal, they provide a menu of what you ate, overlaid with your drink pairings. It's a perfect memento to leave you dreaming of the next time you return. Next is pricey but is a seriously unique, one-of-a-kind experience.", "pics": null}}, {"review": {"des": "Been here twice now. First time was a South American menu. Not bad... they did a pretty good job of accommodating vegetarians. I think I would've given that meal a 3.5 stars because as a vegetarian it wasn't truly worth the money.<br><br>Then I came back during the TFL (French Laundry) menu. <br><br>Had to up this to 5 stars because the meal was vying for best meal of my life. Truly delicious.<br><br>For vegetarians or other dietary restrictions- email the restaurant ahead of time. They will send you a form to fill out about the specifics of your dietary restrictions. If you're thinking about booking tickets, I'd email them before booking to see if it's worth paying that much for a meal if they have to make substitutions. They'll be pretty honest with you if they think that the quality of the meal is going to be seriously jeopardized.", "pics": null}}, {"review": {"des": "Living only a few blocks away I don't know what took me soo long to get to this place.  I was lucky to get tickets for their first night of The Alps. It truly was an adventure through the Alps. The presentation of all the dishes and explanations were spot on.  <br><br>We started off with stone soup which I thought was delicious, very herbal and unique.  We had a late night dining so those stones were steaming hot.  The meal then continued with multiple courses being delivered at the same time over the next two and half hours.<br><br>My wife does not eat pork so they did make substitutions for one for one of the dish which she was very happy about. I think my favorite course was the smoked arctic char.  This wins as I loved the presentation and the fact that it was cooked on our table. <br><br>Overall it was a fantastic experience.  Only downside is now that my wife now knows how amazing this place is and she wants to come every quarter which will be costly.  Definitely check this place out for a amazing experience.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/VQklD-UCZ559_W8EPgGj0Q/168s.jpg", "caption": "Believe it or not,  this is not just a decorative piece. Something is cooking inside there"}]}}, {"review": {"des": "My husband and I dined at Next last night. The theme was Hollywood and we were up for trying something different. We've never been to Alinea, but have been to The French Laundry during Grant Achatz' tenure there, so we assumed that we were in for a delicious -- and experimental --  meal. And we love movies and popular culture, so it seemed like an excellent night all around. <br>The meal started out with fennel popcorn and a small \"corn cob\" that was fine. Nothing great, but certainly tasty. We opted for the non-alcoholic beverage pairing, so they brought us a riff on champagne made with elderberry and celery juice. A little weird, and definitely not delicious, but ok, this is Next, and we're trying new things. After that, the wheels completely fell off for us. Course after course, and we wondered if the chefs were laughing in the kitchen that we had paid so much money for food that didn't taste good. Food that made absolutely no sense, not even from a conceptual standpoint. Not only did the courses not connect to each other, but the connections they made to their corresponding movies were tenuous at best. For \"The Breakfast Club,\" they brought the Princess' bento box with sushi ( I love sushi; this was not good), a faux BLT sandwich bite made with aerated cheese that substituted for the bread, and watermelon gazpacho with lime oil and some sort of savory elixir that was dispensed by a pixie stick. Clever presentation aside, that's a lot of disparate flavors doing battle on my palate. In response, my palate never recovered. So I dreaded every course after that. I swallowed some things whole, without chewing, so I wouldn't have to taste them. The science fiction portion of the meal included some truly disgusting dishes, such as octopus and scallop on peanut and black bean creams with oregano foam. Just think about that. Dishes had several main ingredients, but then a handful more were added that felt random and careless. At one point, while eating smoked pork neck that looked like digested cat food and was sauced with beet puree meant to resemble blood, my husband asked, \"Should I worry that my meat is runny?\"<br><br>The strange and bad-tasting drinks didn't help matters at all. They were equally guilty of making no gustatory sense and fighting with their food partners. <br><br>I've never had such bad food at a restaurant. The meal was undisciplined and almost reckless, creativity run amok. My palate tells me what's what. I don't need some acclaimed restaurant to try to challenge my perception of which ingredients should go together -- and which shouldn't. The emperor definitely has no clothes at Next.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/gkV1_1ldDN27qRdwqbpT_A/348s.jpg", "caption": "Octopus and scallop on peanut and black bean creams with fresh oregano foam."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/-i5cjCwggQwT6NLiVRsaxQ/168s.jpg", "caption": "Smoked pork neck with garlic and an edible packet of blood, aka beet coulis."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/zc28YIwrXlJVZQRCj6vgkg/168s.jpg", "caption": "Dessert from the Hollywood theme at Next."}]}}, {"review": {"des": "How can anyone give this place any less than 5 stars. Yelp should have a special 6 star category for places like this. My sister and I were lucky enough to dine here Sunday evening for their 8:30 seating and it might be the best meal I've ever enjoyed. <br>We attended during their \"alps\" menu which took us through the culinary styles of a French farmhouse, German beer hall, Italian country side and Swiss alps. All I can say is AH-maze-ing! Each course is tailored for the eater so I can only attest to my nut & fish free, veggie friendly meal. Everything was delicious and the presentation was even better. <br>From the first course riffing off the old \"stone soup\" fable, to fresh baked pretzels with a full wheel of freshly melted cheese, to fish being cooked and smoked in front of us on an actual wood log over juniper, to the most delectable \"hot chocolate\" I've ever tasted and so much more I would easily go back again. I'm already plotting to attend the next menu some how. The prices may scare some people away but it is completely worth it! Not even just for the experience but the portions are well sized and they definitely don't skimp on the alcohol pairings for sure. <br>Go!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/P74QbLHE8Vd4xpZcVw2w-g/348s.jpg", "caption": "Personal flask to accompany my hot chocolate? Don't mind if I do!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/J429qGnJN0zI0mePWOBwIw/168s.jpg", "caption": "I can't remember exactly what this was but I like to refer to is as heaven"}]}}, {"review": {"des": "Trio is an even more spectacular menu than Modern Chinese. This homage to Chef's first restaurant ten years ago pulls out some vintage tricks, and reminds us of how cutting edge that restaurant was.<br><br>21 courses, many of them home runs. Very lavish ingredients, beginning with a generous serving of Osetra, and two courses using foie gras in completely different ways. <br><br>My favorite course was a surprise, the smoked figs was that perfect union of unexpected flavors that turns the whole into much more than the individual parts. <br><br>A few of Alinea's serving tricks were used for some of the courses, but they're more playful and less pretentious than at Alinea. <br><br>As always a convivial staff enthusiastically sharing information and their love of what they're doing. A great dining experience.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ssoDPEWJs7kFVkcC17nXZA/348s.jpg", "caption": "Trio: lamb"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/OXbsni-b8Vl78LdGvWn7rw/168s.jpg", "caption": "Trio: \"Pizza\""}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/1VbhVgwjMDQeAPtKqUvorg/168s.jpg", "caption": "Trio: for picking up the \"pizza\""}]}}, {"review": {"des": "The French Laundry experience at Next was as close to perfection as I've ever experienced yet! My husband and I loved every dish and wouldn't have changed anything about it. I ordered the nonalcoholic drinks and my husband ordered a wine pairing. Our least favorite part of the night (if we had to pick something) may have been the drinks only bc we weren't a fan of every glass. Service was absolutely perfect and couldn't have been any better. Can't wait to come back here!", "pics": null}}, {"review": {"des": "This is a fun yet not stuffy fine dining experience.  Did the Alps menu which surpassed my expectation as I'm not a huge meat and potato fan (you'll get some of it).  Was impressed with the amount of vegetables still available, the variety of how the food is served.  Alcoholic pairing is fun, plentiful and impressive.  Loved the Swiss wine and you'll get much more than just wine.   <br><br>Beware, there's a lot of food and you'll likely see all the cool stuff via Yelp pictures which kinda spoils the suspense.", "pics": null}}, {"review": {"des": "They act like, charge like and want to be among the worlds best, so they should be graded as such. There was nothing particularly special about my experience at next. It's a novelty act for those who enjoy the  changing themes and the appearance of the food over its flavor. I've heard good things for those who are regulars, but I would rather not spend a grand gambling on what amounts to be an average menu when compared to the worlds best restaurants. You shouldn't have to try and find a good menu at a worlds best restaurant. They should all be good. And I mean, don't get me wrong, in comparison to many restaurants this place is good, but for what they charge and what they deliver and the expectations they have of themselves this has to be rated on a scale of worlds best and on that scale at best it's a 2/5.", "pics": null}}, {"review": {"des": "------Complaints:<br><br>I hate the ticketing system. I really do.  And when my wife ended up pregnant, I had to beg them for a refund on the drink package.  Their first response was \"we'll make you virgin drinks\".  What?  You want me to pay $100 for a person to drink fancy juice?  Screw that.  Fortunately the manager trumped the first idiot I spoke to and refunded me 1 drink package.  <br><br>With regard to the drink package, other then the first cocktail, the fancy martini which was amazing, the rest of the drinks were really sub-par.  I highly recommend not getting the drink package.  TOTAL WASTE OF MONEY and I didn't drink most of it.  Maybe the biggest disappointment was the Pipeworks/Next beer.<br><br>The bread was excellent, but the staff asked us if they could clear it at least 10 times before we finally ate it all just so they would stop harassing us.  They were really hot for that bread bowl.<br><br>-----Compliments:<br><br>The food was just outstanding this time around.  Every dish in the Chicago Steak menu was just killer.  <br><br>Crudite, small but powerful.<br>Shrimp Cocktail - big ass shrimp in a tangy sauce<br>Oyster IL Bronzino - more please<br>Le Vasseur Salad - watercress and pine nuts were smoky and salty deliscousness<br>Salmon Coulibiac - salmon with dill in filo dough.  I WANT A BIGGER SLICE<br>Lobster Thermidor - Rich and heavy<br>Ribe Eye - Aged to perfection.  <br><br>The deserts were equally good, but my memory is a little vague there as I was in a food induced coma.<br><br>Lastly, drive around and find parking.  No need to pay any more money then you already are.  There is plenty of it on the street.  <br><br>And if you just want a steak, don't come to NEXT, the portion of meat is not that large and there are plenty of good steak houses in the city.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/MmtvFlHyX_qyXNdzAW5O-A/348s.jpg", "caption": "Chicago Steak - 40 day dry aged ribeye."}]}}, {"review": {"des": "I didn't think that I'd be able to say this, but it was worth every penny (and it's not an inexpensive meal!).  I tried the Alps menu, and pretty much everything I had was delicious.  Others have broken down the menu, so I won't go food-by-food, but I'll pick out some highlights (and if you are planning to go and don't want to be spoiled, stop reading!)<br><br>First off, they transform pretty much the entire restaurant into the theme-even the front door had an \"The Alps\" decoration on the door, and the foyer was decorated in Alpine theme.  We were part of a larger group that was splitting into three tables, so there was initial confusion about who was sitting where, but the staff was helpful in getting us to the right seats.  Our waiter was very nice, and personable, and mentioned my friend's food allergies (she had called ahead), which put her at ease knowing they were on top of it.  <br><br>The food was delicious, and a large part of this is the 'journey' through the Alps, from France to Germany to Switzerland to Italy to Austria.  I think the German course was my favorite the way it was put together, but the dessert was excellent as well.  Our table got the standard alcohol pairing, and I'm glad we did.  The food was delicious on its own, but getting to try it with the alcohol pairings gave some different tastes as well.  Highlights included the pork belly schnitzel, the goulash, and the crema di limoncello we got for dessert (it tasted like lemon meringue in a glass!)  But really, all the food was good, I don't think there was anything I didn't like.<br><br>I feel like we missed a bit of the 'story'-our waiter started us out with telling us about the journey, but as the night went on we just got the announcements of the foods (and not even a mention of which country we had 'traveled' into.  It was also hard to hear the food sometimes, as the restaurant got louder as it filled up throughout the evening.  They do give you a menu at the end so you can see everything that you ate and drank, which was nice.<br><br>The one downside is that since every table is at a different point in the journey, you may be 'spoiled' by tables around you that are further along.  The table next to us was about two courses ahead, and although we tried not to look at what they were eating, sometimes it was unavoidable because of how they serve the food.  I know it's terribly impractical, but I kinda wish they had partitions or something so you couldn't see what was going on around you.  It didn't ruin the meal, but it did take away a bit of the surprise.  But, that might not matter to some.<br><br>We're already trying to plan a visit back for one of the future menus, it was totally worth it.", "pics": null}}, {"review": {"des": "Great concept but failed to deliver. The restaurant is small and waaaay too dark. Uncomfortable overall. The food was just ok and definitely not worth the price and neither was the wine pairing. Service was ok too. Overall it's not a place I would recommend nor would I go back. Chicago has better restaurants than this. Very disappointed. It wasn't a bad experience but for the price and the hype we were expecting a great flight menu and it was \"meh\".", "pics": null}}, {"review": {"des": "I really enjoyed my visit to Next for their Alps menu. We had the non alcoholic drink pairing because neither of us particularly like wine and it was an excellent decision. All of the food (with a couple exceptions) was phenomenal. Things I wish I had known going in and my observations:<br><br>1. There's a lot of food. You will eat an entire day's worth of food while you eat through your two hour dinner. I wish I had skipped lunch. <br><br>2. The price may seem steep, but if you went to another upscale restaurant and ordered 5-7 drinks, and twenty+ items off of that restaurant's menu you'd end up spending just as much or more than you'd spend here. That's essentially how Next operates. This isn't typical restaurant going behavior, but that's essentially what this experience amounts to.<br><br>3. Try to book the first table of the evening. We showed up later and we saw all of the food come out for our neighboring tables and knew what was coming. It detracted from the surprise. I wish we'd booked earlier in the evening (although logistically that wouldn't have worked for us).<br><br>4. Mix your drink pairings. For the Alps menu the options are international wine pairings, domestic wine pairings, or non alcoholic wine pairings. Our neighbors did both the domestic and international. That way they got to try everything. They give you full servings of alcohol for each stage of the meal (for this menu that amounted to five and a couple of them had more than one paired drink) so if you don't want to get completely wasted mixing with the non alcoholic option isn't a bad idea.<br><br>5. The non-alcoholic drink pairing was awesome. Rather than pairing with a bottle of wine, they concoct elaborate juices. You're basically getting extra liquid courses created by the chefs that the majority of the patrons are missing out on.<br><br>6. There are a couple add ons they'll offer you when you get there for an additional charge. We passed on both of them (and I'm glad we did because we wouldn't have been able to eat anything else anyway. We weren't clearing our plates by the end) but it sort of frustrated me because I assumed we'd already put down all of the money we'd need to.<br><br>7. You'll receive a menu at the end listing everything you ate and drank. So if you miss it when they give you the run down on the course, you can always refer to this later on as long as you remember the order things came out.<br><br>I'd love to go back for another one of their menus. The restaurant was a well oiled machine every step of the way. I tried all kinds of dishes I wouldn't typically order. It was a lot of fun and well worth the ticket price.", "pics": null}}, {"review": {"des": "Chicago Steak Menu Review:<br><br>Let me start by saying that I waited an entire year to get into NEXT, so I was super excited when my friend called and asked if I wanted to go to Chicago Steak. I LOVE steak, so I was even more excited to go to this particular menu. I was thoroughly disappointed with everything about the experience AND I got very sick from something that I was served and I was unable to figure out what is was. My friend also got very ill and sent them a note (not asking for a refund), but just letting them know and they basically responded by saying that we had probably over indulged and that's why we were vomiting, had diarrhea, and painful stomach cramps.<br><br>A week after this, they refunded everything...no explanation. Which is fine by me. I gave the entire restaurant 2 stars and the Steak Menu 1.<br><br>I am not going to go over the entire menu (because most of it was not memorable) but I want to note some of the lowest points of the evening:<br><br>1. They start the menu with raw overly salty veggies stuffed into a bucket of ice. They don't give you any utensils with this, so you have to use your hands--this is stupid and the veggies were gross.<br><br>2. They overdress the salad and the poached frog legs atop are served in a way that is disturbing and unappetizing and simply does not taste good--I literally spit it into my napkin.<br><br>3. The steak was cut unevenly, so parts of it were so chewy that they also had to be spit into a napkin. <br><br>4. The salt content, throughout the meal, was outrageous. Wherever sugar was applied, they were also quite heavy handed with that.<br><br>5. For the palate cleanser, if you don't do beverage pairings, they give you a mock champagne, over brioche ice cream, that they create... it's probably the worst beverage i've ever had to drink--I tasted it a few times to be sure.<br><br>One thing I should note is that my friend thought the food was good (note: not great), but she got the beverage pairings and they start with a generous sized martini (which I tasted, it was delicious), so I am convinced that she was very drunk for most of the meal--and everything tastes way better than it actually is when you are drunk. From the stone cold sober perspective: there was NOTHING on the menu (with the exception of the desserts) that I couldn't have prepared and presented better myself for less than 25% of what I paid to go to NEXT.<br><br>I would wait for another menu if you really want to experience the restaurant: this is one you can definitely miss--It's just not worth the money.<br><br>NOTE: Please look at the \"not recommended reviews\" section--Apparently other people have gotten sick from food at NEXT.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/_PLNp9Ekrq6QCc9lJZ9VsQ/348s.jpg", "caption": "Brioche ice cream with mock champagne.  Ice cream=interesting, mock champagne=GROSS"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/vR2HkIbkIsfJ9T_kiMyTFw/168s.jpg", "caption": "frog over over dressed salad...who would want to eat this???? I tried...Sooo Gross. Ended up back in the napkin."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/eEzI_RHnaFrUzkOWjM6LDA/168s.jpg", "caption": "mussels with sweatbreads"}]}}, {"review": {"des": "Wow - what a night - I cannot say enough about the absolutely perfect dining experience I had at Next. The theme was Hooray for Hollywood- it was 15 or so small courses with paired wines that was flawlessly executed. It will have us talking about it for a long time.", "pics": null}}, {"review": {"des": "While we appreciated the theme \"hollywood\", presentation of the dishes and the taste of the dishes, both my wife and I had stomach issues immediately after dinner. We had nothing to eat all day except breakfast which consists of cereal and fruits, so the digestive issues had to be from Next. Considering it was their first night of the \"hollywood\" menu, might have been some kinks in the preparation of the food? Otherwise it's on par with alinea.", "pics": null}}, {"review": {"des": "We'd love to come more often; Next is, though, surely the definition of destination dining, and the trip from NY is worthwhile to eat here.  Most recently for the Terroir menu, and that's what I have in mind as I write.  It was a great pleasure to have the staff be rather less inhibited than previously - I actually mentioned this to Dave Beran, who stopped by the table at one point, and he commented that it wa a common customer perception which he thought reflected the greater involvement and excitement of staff for this menu vs some others.  Regardless of the reason, there just seemed to be a lot of smiles around, and the interactions with servers made the evening.<br><br>[The table next to me was *especially* happy: 4 chefs from Eleven Madison Park, in town for a cookbook launch the next day, who unsurprisingly got special treatment; I had to be content with a few shavings of their truffles :)]<br><br>Menu details would be some combination of spoilers and an impossible attempt to do credit, so I'm not going to try: highlights included a dark chocolate garnish on pulled lamb and a squab-redcurrant combination.  But the focus on wine tilted things enjoyable out of the norm: moving quite deliberately from a barrel-tasting setting to the more normal tasting-menu approach, and playing with both expectation and sensation.  My only criticism, perhaps, is that even for those such as myself with a little more body mass than I'd like, it's a *lot* of wine - do NOT drive home!  Unlike past iterations, _zero_ off-notes in either wine or food: a perfect restaurant experience.<br><br>Is it too expensive?  Well, I think not.  It's clearly out of reach or sense for many; but looking at the quality of ingredients (multiple, large pours of 1977 Madeira!) and number of kitchen staff, I don't feel at all that it's poor value.  And the memories are rich.  Go if you can.", "pics": null}}, {"review": {"des": "TFL 1996 at Next.  Wife and I wanted to go (and were lucky to score a table via my sis in law) and see if it would bring back fond memories of our visit to TFL in 2009<br><br>TFL clothes pin (underneath Next sign) on entrance door.  You walk in to see the iconic replica of the blue door at TFL with a centered doorknob.<br><br>Food was very good as anticipated.<br><br>4-4.5 stars for the food. <br>Canapes: cornet of atlantic salmon. just as good as we remembered.<br>Oysters and pears: better at TFL, but good enough.<br>Tomato salad: Very good and refreshing salad.<br>Red Mullet \"Fish and Chips\": Ah-MAZING! <br>Five-spiced lobster: Very well cooked and delicious lobster dish with foie.<br>Rabbit \"saddle\": perfectly cooked rabbit but very unappealing sauce which was probably 90% soy sauce<br>Pot Au Feu: very tender beef short rib. great.<br>Chaource: Eh for cheese dish; presentation was unrefined.<br>Verjus sorbet: Refreshing after a decadent meal.<br>Coffee and Donuts: I like TFL donuts and coffee better; taste was good, but donuts were fluffier at TFL.<br>Mignardises: good as expected.<br><br>Now on to the disappointing $260 or so \"reserve\" wine pairing option.<br><br>1 Star.<br><br>I've had much better pairings for prob 1/2 to 2/3 of the price at Daniel, EMP, and oddly enough, Alinea.  I was not impressed with a single choice of wine.  Did not elegantly accentuate the dishes.  Very sad...<br><br>A specific beef that I have with them is that they charged me $40 for a glass (admittedly after having 2 pours) of Chateau Suduiraut, Sauternes 2009.  Do you guys know how much a 1/2 bottle of that is?  Less than $40.  Enough said.<br><br>All in all, a great experience though...  Service was great and friendly.", "pics": null}}, {"review": {"des": "Last weekend we had our fifth sixth dinner at Next-Hollywood this time. As usual things were a well oiled machine. The dishes were inventive and tasty but the emphasis seemed more on the cute ideas than good food. There was a lack of entree level protein dish and the desert while good seemed to have been done before.", "pics": null}}, {"review": {"des": "Due to dietary restrictions had to sell off my tapas reservation.  Went tonight for their outside tapas menu.  Food was fantastic, service was friendly.  No wait.  They probably won't do this reduced menu outdoor concept in the future as it needs to fit with the theme.  Pintxos and tapas do seem to fit the outdoor small plate theme.<br><br>The tortilla was the best version I have had outside of San Sebastian.  Per our friendly waiter, their cheesecake is influenced by La Vina's version in San Sebastian.  Tapas menu ends in the beginning of September.", "pics": null}}, {"review": {"des": "After a year and a half of trying to get tickets to eat here, I was finally selected for the same night reservation 'lottery', of sorts. I debated back and forth whether or not to give Next 4 or 5 stars in this review. It is, very clearly, a 5 star restaurant but this particular experience I had didn't quite 'wow' me and at nearly 200 per person, without drink pairings, I really do want to be 'wowed' darn it. So therefore, based solely on this particular experience, I'm going with 4 stars for now with great hopes of trying a different menu in the near future and giving a 5 star update.<br><br>So here's my first experience with Next: 'Chicago Steak' menu:<br><br>We ended up having to wait 10 minutes over our reservation time in their cramped 'lobby' space, next to the winter cold air door, awkwardly crammed with a bunch of other people.. which I wasn't thrilled about. Alinea definitely 'wins' on the getting people seated in orderly fashion bit.<br><br>Overall I would label this particular menu as 'WHOA SEASONING..' and not always in the best way. I'm a huge fan of steak and there was a lot of bold, rich (sometimes overly so) dishes going on here. There were definitely some highs & lows:<br><br>Crudite - Heavily seasoned raw veggies (fennel, cucumber, kale, and carrot) in a bucket of ice. Interesting display, fun to finger eat, & obviously not meant to be a 'stand out dish' by any means but I found the over use of celery salt - or whatever seasoning they used on this - to be near the brink of unbearable at times. <br><br>Bread Basket - Assorted breads (buttery biscuits, cheese breadsticks, whole wheat/rye). I love bread so WIN. Delicious butter.<br><br>Shrimp Cocktail - Gigantic shrimp served with a fermented tomato cocktail sauce. This is probably the best shrimp I've had in my life. So fresh. The cocktail sauce was so good I ended up spooning it all out & eating it alone, once I finished my shrimp, much to the utter amusement of the wait staff me thinks.<br><br>Mussels & Sweet Breads/Clam & Pasta - The Mussel dish I must say was very good. I really liked the fried sweet breads even though, in general, I'm not a fan. The clam dish would have been better if I had known to break up the clam itself and mix it throughout the dish. The pasta is much better if you get bits of clam in every bite. Overall it's a very light, sweet, dish.<br><br>Frog's Legs Salad - Frog's legs served on greens in an oily, tangy, pine nut dressing. I had a hard time liking this one. This was another one where the seasoning used was a bit overpowering. We noticed by the end of the dish we had acclimated to it but overall I wasn't a fan. <br><br>Salmon - We are not huge fans of fish to begin with, so it might not be best to trust our judgement on this, but I liked the actual SALMON center of the dish - it was tender and delicious - what I didn't like was, again, the overpowering herbs/seasoning on the outer bread piece. It was just too much & I really didn't eat much of this dish.<br><br>Lobster Thermidor - HUGE Lobster chunks & apple served in a very buttery sauce. Extremely rich & powerfully seasoned, a large portion, & since I was feeling full at this point it was hard for me to eat this. I ended up picking out the succulent lobster pieces & leaving the rest behind.<br><br>This was the point in the experience for us where we asked how far along we were in the courses. Both of use were starting to get uncomfortably full at this point and, thank God, it was close to the end!<br><br>Steak -  This is a classic dish done very well. HUGE PORTION! So much so my boyfriend & I sat in shock once they placed it all on the table. Very high quality beef, cooked perfectly, may be a bit heavy handed on the salt for some but I was very pleased with it. The dish came with some interesting sauces (the bernaise taking the cake for me). The sides: french onion casserole, crunchy baked potato, & brussels sprout salad were all very good but at this point we felt like we were going to pop from being so full, so we ended up to-go boxing most of this dish. (YES YOU CAN DO THAT HERE & please do!)<br><br>Champagne Float - Very welcomed light/cool dish for a full stomach. Yummy brioche ice cream swimming in a faux champagne since we didn't order an actual drink pairing.<br><br>Baked Alaska - Hazelnut ice cream surrounded by spiky meringue, set ablaze to lightly toast it. I am not usually a fan of meringue but this dessert was AMAZING! Easily the highlight of the night! <br><br>Cheesecake Creme Brulee - Just AMAZABALLZ! <br><br>Latte - I made a tip about this amazing coffee & it was so good I even got ballsy & asked for specifics on it. They get the coffee for this from a Chicago local shop called 'Passion House' and the specific coffee used is called 'Cold Press Diner Coffee'. It's seasoned with honey, whole milk, and sarsaparilla. Excellent!<br><br>Final Verdict:<br><br>I will visit Next again (assuming I can ever get tickets!) for another menu that interests me, for sure. It's all about the menu so make sure you visit when they have one you REALLY want to try!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/fLNTEEsi4XPICUFD1Sm6gQ/168s.jpg", "caption": "End dinner with a mint :) so fullll"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/N-O0u2IFRQ96Z7QVlRoR-w/168s.jpg", "caption": "Best coffee ever!"}]}}, {"review": {"des": "The 4 star average rating for Next is shocking.  I'm not sure where to begin other than to say that our dinner for 4 at $1000+ may go on record as the biggest culinary disappointment EVER. In fact, if this experience were half the price I would be no less incredulous. <br><br>The atmosphere - no real issue here but the vibe is kind of strange - certainly not funky, nor warm or elegant.   There was also a wood smoked scent that was pervasive and overpowering (more on that later). <br><br>The service - attentive for sure and there were several servers that were actually warm and relaxed.  On the other hand, I have never been to a restaurant where I actually felt awkward when engaging with the staff.  There was such an air of intensity and severity - the situation was surreal, and not in a good way. <br><br>The food / drink pairings - this is what must make the $265 a head worthwhile.....wrong!  Okay, there were a few dishes that impressed - a small cheese casserole of some kind and remember the wood smoked scent I mentioned, well it was used to create a wonderful Arctic char that was smoked right at our table, tender beef that was carved table side and an apple strudel that was pretty tasty.  Those dishes were not nearly enough to compensate for dishes that ranged from bland - a consommé soup that was poured table side, to strange - a chocolate dish that was served in the middle of our dinner, to atrocious - a dish that was so bitter/sour that not one person at our table could stomach it (I don't recall if it was animal, mineral or vegetable).  <br><br>I forgot about the pretzels . They were probably the star of the meal.  PRETZELS WERE THE STAR!!!!!??? with a tasty grainy mustard (not enough of it, mind you) <br><br>Honestly people, if this is supposed to be a dining experience to be remembered it can only be remembered as the evening we wished we would have saved $1000 and eaten at home - thank goodness we were there with good friends (who felt bad because they booked this once in a lifetime experience).... And to top it all off, our clothes had to be taken to the dry cleaners to get the wood smoke smell removed.  <br><br>Next........", "pics": null}}]}