{"name": "nhu-lan-saigon-subs-chicago-3", "reviews": [{"review": {"des": "Love this place!!! The women are always so sweet! I don't go anywhere else when I have a banh mi craving. I also love their lunch specials. That soy sauce chicken is crack. They also have a selection of Vietnamese desserts, pastries, eggrolls, noodles, etc. They have meat and meatless options. I have also tried their vegetarian/mushroom pho, and it was very good!<br><br>Hands down and absolutely go here and support these peeps!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/19JShxymzBT-w5GyUKU3GA/348s.jpg", "caption": "Now serving roast duck and pork, soy sauce chicken, BBQ pork, steamed chicken, etc."}]}}, {"review": {"des": "Just wanted to add that when I went to the Lawrence location, they only had \"Roast Pork\" and \"BBQ Pork\" in the Chinese BBQ section. She said only the Sheridan location has the other stuff.<br><br>Also, they have buy 5 get 1 free. I don't know if it works ordering online but I usually order it in person.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/dbF9bbxObRqK22ykljfbBA/348s.jpg", "caption": "Pork Meatball"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/1Uwv0cbyOpQKw8xV6HfVxA/168s.jpg", "caption": "Special"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Jfau098UDHLAOP_1za2Fzg/168s.jpg", "caption": "Pate pork belly and pork roll"}]}}, {"review": {"des": "Thank you Chicago's Best for introducing me to this gem!! They made a mistake which I am delighted they did and when I ordered the #1 and #3 they gave me a #1 and #2 (roast pork). <br><br>I've never been so happy for mistake!! The roast pork had crispy skin with tender, flavorful meat. It was warm but not hot and made the perfect center filling for their outstanding crispy baguette!! Next time this will absolutely be my go to Sandwich (although I still want to try that #3 Lemongrass And Chicken)<br><br>After moving here from Miami, I have been on the hunt for good Cuban Bread and their baguettes are the closest thing I have found in Chicago. Fluffy center with a crispity-crunch exterior!! I'll be buying a dozen to go next time :-)<br><br>I know what you're thinking, what about the number one sandwich?! It wasn't bad and I'm sure LA only sample that one I would've enjoyed it more but couldn't compete next to that number to roast pork.<br><br>My advice for your first visit would be to order using the numbers vs the names of the sandwiches to ensure you get your order correct LOL. And don't forget to ask for fresh red chilies to kick it up a notch for s you can't beat :-)<br><br>Buy 5 sandwiches and get 1 free?!? I don't know if this is new or if it's always been the case but OMG like I need more of an excuse to buy more of these magical sandwiches to go!?! #TheMoreIComeTheBetterItGets", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/9pdsvoU62qH9GP8PbKPRuw/348s.jpg", "caption": "Absolutely incredible, #2SpaceRoastPork"}]}}, {"review": {"des": "This place has one of the best ban mi sandwiches in Chicago! I can't believe how big the sandwiches are. I'm pregnant and I thought I need to order something else because typically a sandwich won't fill me up. I ordered grilled pork and it came with so much meat. It's tasty with veggies. <br>My husband ordered the fake meat made by tofu and it tasted like steak! We were very pleased with the quality and service of this place. Certainly will come back!", "pics": null}}, {"review": {"des": "Read from Yelp reviews that this is one of the better bahn mi sandwich places but def not worth the hype. Perhaps I'm a little biased as I've only tried a few bahn mi sandwich places. <br><br>I can tell this place is authentic based on the people that work, menu, & the patrons. I had #4 grilled pork sandwich. I typically get grilled beef sandwich from a location-that-shall-not-be-named, but they didn't have any at this restaurant. <br><br>Walking in, there're only a few seats available to dine. Most patrons got their sandwiches to go, which is what I did also. My #4 sandwich was pretty pricy for what I've gotten. It was definitely worth a try, but I'll stick to a place that I love.", "pics": null}}, {"review": {"des": "This place definitely lived up to its reputation. I'm in the middle of a move and have had a pretty busy month or so with family and work obligations. I woke up one morning and needed some time to unwind. What better activity for a hungry early bird than to have some pho? <br><br>The shop is relatively easy to get to via public transportation. It's near a couple of brown stops or you can take the 49. It's in Ravenswood and super peaceful. It's one of the noodle shops that actually opens fairly early. <br><br>There are 3 tables inside but for the most part appears to be primarily a takeout spot. They have a few fridges with prepared foods. I decided to eat in and ordered the pho tai and an iced Vietnamese coffee. <br><br>The food was delicious! I'm mostly a hoisin and Sriracha in my pho person but every now and then I'll enjoy the broth as is with just the lime and fresh veggies. That's how I had it here. It was fresh, fragrant, light, comforting, and had the perfect balance of meat to broth to noodles. It was perfect for breakfast and totally hit the spot. I got a bao, a baguette, a banh mi, and some vermicelli noodles to go. Thank goodness they take credit card. <br><br>Everything was delicious, fresh, and easy. The service was good. The prices were good. I would definitely come back. <br><br>While I was there, the place was picking up with a lot of calls and walk in orders. Pretty impressive. Of course, I couldn't leave without grabbing a few other items for the road. Btw, they have fresh baguettes here (55 cents each or 3 for $1.45).", "pics": null}}, {"review": {"des": "Finally, a Banh Mi place that still sells sardine banh mi that is also close to my house!  Hubby found this cozy little bakery when I had a craving for a sardine banh mi.  We checked it out for lunch today.  Parking can be hard to find (only street parking available and the adjacent parking lot is only for the Harvest Time grocery next door).<br><br>The store itself is tiny and a bit cramped.  When we walked in, there were only 3 tables on the left (two 4 tops and one 2 top) that were all occupied and a few people crowded around the cashier.  It was hard to tell who was in line and who had ordered, but after asking around, most of the customers had already placed their orders and just waiting for their number to be called.  You can pick up prepackaged items like spring rolls, buns, a variety of desserts, and drinks from the refrigerated section to the right while waiting in line.  In fact, most of the people who ordered were doing for carry out and it got pretty crowded while we were there.<br><br>One of the 4 tops cleared so I grabbed the table while Hubby placed the order.  He tried the #1 special banh mi while I had the #15 sardine banh mi.  We ordered a box of roast duck and a mango smoothie with tapioca to share.  The duck was already ready.  The downside is they don't sell rice but offered to heat up some bread to go with the duck.  However, the bread never arrived.  We were satisfied with eating the duck solo; it was pretty good by itself.  The smoothie was great, fresh mango and not too sweet (Hubby asked to cut the sugar a bit)...dare I say better than Joy Yee down in Chinatown.<br><br>Now for the main event.  The sardine banh mi lived up to all my expectations.  The delicious sardines in a tomato sauce lovingly sandwiched between a fresh thick French baguette with the signature crispy crust and deliciously pillowy chewy middle and accompanied with fresh cucumber, daikon, jalapeños, and a mountain of cilantro.  It was so good.<br><br>So happy to discover this cute little bakery closer to home than going all the way to Uptown.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/9cbRU9AKL3jbN3a7-81XAA/348s.jpg", "caption": "Cross-section of sardine banh mi"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/SkNtD08mXMxofwCwGbtqJA/168s.jpg", "caption": "Sardine Banh Mi"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/V8GFQDgBi6puEeb_Vv69fQ/168s.jpg", "caption": "Roast Duck"}]}}, {"review": {"des": "Not that this place needs another 5-star review... but this is my favorite banh mi place. Having grown up in California and recently came back from Vietnam 2 months ago, this place is amazing.<br><br>I love the #1 (Nhu Lan Special). Basically just combination ham with pate--simple yet the best. I also tried the Roasted Pork, but I didn't like it as much. The pork was mostly fat (it was juicy and delicious, don't get me wrong) but it's just not the one for me.<br><br>If you're ever in Ravenswood and need a quick lunch, this is your spot.", "pics": null}}, {"review": {"des": "This place is hands down my FAVORITE banh mi place in all of Chicago. As a California native being spoiled with the wide variety of authentic yumminess throughout all of Westminster, CA, this spot is on par. I refuse to eat a banh mi from anywhere near me and am willing to make the 35 minute drive just for their sandwiches.<br><br>The shop itself is really tiny with only about 6 seats and seems a lot of people just order for takeout. The amount of food offerings will require you to make many subsequent visits to try everything off the menu. I'm always so tempted to buy a whole week's worth of goodies because everything is absolutely amazing. Sandwiches are all made to order. They usually have spring rolls and dessert grab n go if you're ever in a hurry.<br><br>I'm writing this at 1am as I contemplate what I'm going to order when I visit their other shop in Uptown later today. Yes, they are THAT awesome!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/mWzPVDmspS-KlIqmFarwcA/348s.jpg", "caption": "It's special!!"}]}}, {"review": {"des": "I'm Vietnamese and I've been to a LOT of bakeries that offer Banh Mi and Nhu Lan is still my favorite!<br><br>The #1 special and #8 Thit Nguoi are the best in my opinion. I don't know what it is but it's something about their sandwiches that really make them the best. <br><br>I always recommend Nhu Lan to my friends and colleges that want to try Banh Mi. The place is small and always busy, more for carry out. The staff is always friends as well and I get my sandwiches in a timely matter despite the rush that seems to always be going on in there. <br><br>Definitely a spot to check out if you love Banh Mi!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/cvFjfKsXWZjnRLVKQI-XSQ/168s.jpg", "caption": "So good!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/YG4q1ILjeguWVKM2UHQ3vQ/168s.jpg", "caption": "#8 Thit Nguoi"}]}}, {"review": {"des": "Mmm, bahn mi. Their bread is so fresh, and they have tons of filling options to choose from. If you're vegetarian or vegan, this place will hook you up. All of the ingredients are fresh and the sandwiches are made to order. Be prepared to wait for your food (there were only two employees working the busy weeknight dinner shift), and there isn't much space to stand around as you wait for your order to be prepared. Seating is limited, so plan on carrying out. Besides those factors, the food is certainly worth the visit. <br><br>If you're a cilantro hater like me, make sure to ask for your sandwich without! The lemongrass chicken is my favorite. Happy eating!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/FBRGDVNQmQJjCA4ODgrdJw/348s.jpg", "caption": "Lemongrass bahn mi without cilantro."}]}}, {"review": {"des": "I love Bánh mì sandwiches and this place was on my restaurant list for a long time. I finally got to try it today. I got a number 2 and number 14 for my GF. We both preferred the number 14 - sweet Chinese style BBQ pork. The number 2 was a little bland to me. I also bought the prepackaged roast duck and some more pork.  The coconut pineapple smoothie was a nice addition also.<br><br>The reason why I took off a star is because less than 1 hour after eating my tasty sandwich, on my way home, I shit into my shorts. <br><br>I felt something was off when I was about 10 minutes away from home via bike. I started really hustling feeling that something was not quite right. I rushed through the back entrance of my building and I usually go up to the 2nd floor of the parking garage to the bike section, but as soon as I got through the door, I knew that just wasn't going to be an option for me. <br><br>I dropped my bike on the 1st floor and ran to the elevator. I thanked the gods that the elevator was waiting for me on the 1st floor. I thought that I was safe, I'd made it. I'd experienced closer calls. <br><br>I sprinted out of the elevator - 30 feet to go. I clenched my butt cheeks together as hard as I could, walking on my tip toes the final steps. I put my key in the lock and that's when my sphincter was beaten. The battle was over. I pooped all over myself. <br><br>I probably roll the dice and eat the duck and pork I bought. I'd absolutely recommend this place if you have a high tolerance for risk. I was unlucky this day.<br><br>Update:<br><br>I ate the pork and duck I brought home with no problems at all. Delicious.", "pics": null}}, {"review": {"des": "As far as I'm concerned, Nhu Lan is one of the top options for banh mi (Vietnamese sandwich) in Chicago. Granted, I'm not a Chicago native and I was merely visiting for a week, but Nhu Lan did its job of satisfying my banh mi craving. But not only do they serve banh mi, they have massive spring rolls, che (Vietnamese dessert), and barbecue. Banh mi is buy 5 get 1 free. Prices are a bit steep but I've come to terms with the fact that banh mi in Chicago is just more expensive overall compared to banh mi back home in Texas. <br><br>I went to this location which is the original and their second location in uptown. The original location reigns supreme. I got the #1 which is the Nhu Alan special - I figure it's always good to get a store's namesake, right? Everything about the banh mi was spot on and they filled it up quite nicely. Good ratio of meat to bread and good ratio of vegetables to meat. The carrots and daikon were pickled nicely. The cucumbers and jalapeños were crunchy and fresh. Generous servings of pate (liver spread) and mayo which is ever so important. The bread was also decent. It had a nice crunch and you could tell it was baked fresh the same day.", "pics": null}}, {"review": {"des": "Great sandwiches however beware that prices online are not accurate. More expensive in store.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/n7kBRpX_vYCKGhbc9_klEg/348s.jpg", "caption": "Yummy ginger tofu"}]}}, {"review": {"des": "This was my original Bahn Mi sandwich almost 7 years ago and it still is my favorite in the game. Whether it's other purveyors in Chicago or the best culinary scene in my current home town of NYC; Nhu LAN continues to rain supreme. <br><br>The key here is classic ingredients and fresh bread made on site. <br><br>I look forward to putting it up against the Vietnamese food scene on my first trip to New Orleans as I hear it's a force to be reckoned with but I'm confident it will hold still.", "pics": null}}, {"review": {"des": "As far as I'm concerned, Nhu Lan makes the best banh mi in Chicago. While they are no longer the unbelievable bargain they used to be, they still offer a good value for truly delicious sandwich. <br><br>I typically get a classic #1 to get a bit of the funky and awesome pate, but almost as often get a roasted or grilled pork variety. The bread and toppings really make the sandwich sing. <br><br>If your idea of heaven is an Italian sub, you should try one of these on for size to see how the other half lives. Me? I find room for both in my life.<br><br>There's a refrigerated case with a variety of Asian puddings and drinks facing you as you walk in.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/STPZtaTcb68VlPt4vZo4KA/348s.jpg", "caption": "refrigerated items"}]}}, {"review": {"des": "This bakery doesn't specialize in sweets and desserts, although they do serve fruit smoothies and fried glutinous rice balls. Instead, they bake the most delicious banh mi Vietnamese baguettes. They distribute their famous baguettes to food vendors all across Chicago, who come by and pick up their breads in giant bags. For the ultimate Vietnamese sandwich shop with all the combinations of banh mi you could possibly imagine, this is it! <br><br>I got the pork banh mi with all the toppings, including cilantro and jalapenos. All their banh mi is made to order. They de-seed the jalapenos but there's still a kick to the sandwich. The baguette is so flaky and chewy, it's every bread lovers dream. You will also be making a big mess with every bite as the baguette crumbs fall everywhere.<br><br>I also tried a coconut pineapple smoothie, which sounded like a great combination but was not to my taste- it was too sweet and watery. <br><br>The inside of the shop is quite small and you'd be better off getting your food to go. Make sure to grab some of their fresh spring rolls as well as roasted duck/pork for later.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/OAEZFm7FvSW1pWdqdXuhcA/348s.jpg", "caption": "Grab and go section"}]}}, {"review": {"des": "This is my go-to for smoothies and bahn mi.  When I first moved to Budlong Woods 4 years ago, I went on yelp to look for the best places in my new area.  It made the top of the list so I had to try it, and I love it.  The bread for the sandwiches is always fresh and delicious.  The lemongrass chicken is probably my favorite.  I also love the variety of fruit available for smoothies.  They have more than just the standard strawberry, banana, etc, they have jackfruit...  I have never seen a jackfruit smoothie and one day I may order one to try.  The restaurant it's self has limited sitting, it's more for take out.  They also have a small refrigerated section with spring rolls, sticky rice, etc.", "pics": null}}, {"review": {"des": "We somehow missed the 743 Yelp reviews and so we tried this place blind, not quite sure what to expect. It turns out, they serve top-notch pho, with a peppery slightly sweet broth, unusually good meatballs, and a generous serving of basil on the garnish plate. I left very happy, and thinking I should come back here more often.<br><br>I saw some banh mi going out too, and they looked great.", "pics": null}}, {"review": {"des": "My newest craving is Avocado smoothies. So far this is my favorite. It's made with 3 ripe Avocados which I saw the clerk walk over to the blender, then after all the whirling, it was done for me with a cellophane lid.<br> I took it home and opened the cellophane lid it was creamy the best way to describe this. Light green and so, so yummy. Good price for $3.95 + tax of $0.41. Made my morning, who knew that I would crave avocado's?", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/zhKGC3F7gN0hPuvB9vCUsA/348s.jpg", "caption": "This is a light Green Avocado Smoothie. It's like eating soft serve ice cream but this is heaven in this cup. Thanks, Nhu Lan Bakery :}"}]}}, {"review": {"des": "Great place for take out. We got the roasted pork sub and batel leaf wrapped beef sub. Delicious! I love how it's already prepared with all the fillings! Take out the peppers if you don't like spicy.. because it's really spicy! We also got the white bean che which was perfectly made. Definitely a bigger selection of subs than I expected. There are a few tables to sit at, but I think it's mainly take out. We'll be back to try more!", "pics": null}}, {"review": {"des": "Can you hear the crunch when you bite into the banh mi? If not, you are missing out!<br><br>Nhu Lan is my favorite pit shop when I am craving a Vietnamese sandwich - Banh mi. They have other itema on the menu as well such as bbq duck, bbq pork, pho, and many more. I mainly go here for the banh mi though. <br><br>This location is pretty small with a few tables to dine in if you wish. I would say that it is pretty cramp, but not enough that it makes you uncomfortable unless it is around lunchtime. You would usually have maybe six people there waiting. The woman that mainly runs the store is friendly. <br><br>Banh mi is always made fresh. The flavors are consistent. The bread is bake with slight flaking when you bite into it which is normal. I always order the Banh Mi Dac Biet aka The Special since forever so I can't speak for the other. This is always hands down my favorite. They also smell the meats there if you want to buy them.<br><br>If you aren't going to eat right away, have the vegetables put on the side. They put it in a little plastic bag so you can put it in your sandwich later. This prevents your sandwich from being soggy if it sits for a while.", "pics": null}}, {"review": {"des": "Gone are the days of $1.50 Banh Mi from childhood, but paying $5.50 for Banh Mi Dac Biet is worth the cravings. The Che (all kinds) are yummy, along with fresh spring rolls. I have yet to try pho and other eats, but I will be back!", "pics": null}}, {"review": {"des": "The avocado smoothie was so good but the pho was quite expensive $11 with tax and it didn't have the beef broth taste. the meatballs and beef weren't very tasty either. i should have tried their sandwiches. their were also many flies around me as i was eating.", "pics": null}}, {"review": {"des": "The roast pork, bbq pork, and lemongrass chicken banh mis are all excellent. The shrimp rolls are also fantastic, and the pork egg rolls are addictively crunchy and flavorful.", "pics": null}}, {"review": {"des": "In my continuous search for the best bahn mi in America, trekking out to the outskirts of Chicago was the least of my worries. Through the harsh, cold Chicago rain, the people that work here made my trek worth it. They were absolutely friendly the moment I spoke Cantonese with them (though they were born in Vietnam), especially the older man who I had a great convo, talking about the Asian population in the Chicago area and in NYC. <br><br>I had the Nhu Lan Special Sandwich, but it was a very standard banh mi sandwich and nothing to write home about...although the excessive mayo almost gave me a heart attack. The meat were freshly cut and quite tasty, but that is pretty much the only thing memorable thing about it. It was priced right at $4.50, but everything here is pretty standard-priced. This place is filled with an abundance of Vietnamese pastries, snacks, and desserts, something I don't really get to see much of, regularly. I'm not very familiar with Viet restaurants and cafes in Chicago, but this is a good place to satisfy your sweet tooth if you're craving Che Ba Mau or Pandan Jelly.", "pics": null}}, {"review": {"des": "Love their sandwich. Fresh ingredients and simply yet quite yummy.<br>This is not a place for a first date but somewhere you could go once you get to know your counter part really well and enjoy the flavor they have to offer.<br>The menu is variety and service is quick. <br>Forget about big sandwich places but go here!", "pics": null}}, {"review": {"des": "So I find myself in this neighborhood while visiting Chicago, and utilized my Yelp App to find myself a nice lunch.<br>Yelp steered me to this place and claimed it to be among the best take out in this area.<br>Upon entering this small, unassuming place I immediately saw many interesting items and a large menu with plenty of choices.<br>I have an adventurous palate and was curious to try many things, but my time was limited and I decided to stick with a Banh Mi snadwich which seems to be what Nhu Lan are know for.<br>I ordered the Nhu Lan #2 Roasted Pork Banh Mi. ($5.95)<br>The sandwich was carefully built but not for long because I deconstructed it as soon as I got back to the car for a closer inspection.<br>All of the ingredients were fresh, the pork appeared like it was just cooked and had just the right amount of fat to enhance the sandwich. <br>The jalapeno, cucumber and other vegetables were nice and crisp as you can clearly see from my included photo.<br>From the first bite I was hooked, great flavors from sweet and tangy to hot and spicy and layered textures from soft and chewy to crisp and crunchy. <br>All this in one great sandwich for under $6 bucks!<br>The staff was quiet, friendly and polite.<br>I wish I could have tried some of the other interesting items they offer.<br>And I'll do so next time I'm in that area.<br>Thank you Nhu Lan Bakery.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/j-4atdBMVDcHYbroEvDEMw/348s.jpg", "caption": "A great lunch for under $6 bucks!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/jldtTs13ZhTBqPssK9mQ-w/168s.jpg", "caption": "Every ingredient was fresh."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/nHQyqBXDlQJymWSY2FLn3w/168s.jpg", "caption": "Where to begin? When in doubt....Banh Mi Sandwich!  Can't go wrong."}]}}, {"review": {"des": "I love this place! Food is delicious, and I love trying new desserts here. I am not too knowledgable with vietnamese food/desserts, but I find this bakery a great place to start exploring things that I might not be able to find in other more americanized Viet/Asian restaurants. The reasonable price and accessibility (lots of pre-made things that you can grab & go) is also a huge plus.", "pics": null}}, {"review": {"des": "Get the veggie banh mi. It somehow tastes like meat. The bread is crunchy and moist and chewy. The veggies and pickled to perfection with a hint of spice. It's filling, but just in case...get the shrimp egg rolls. The most crispy well seasoned shrimp egg rolls I've had. It can get busy around lunch time so if you are able, call your order in for pick up. There are only 3 small tables there, so take that into consideration when deciding whether to eat there or take it to go. Parking is available on Lawrence or side streets for free and there are some pay to park right in front.", "pics": null}}, {"review": {"des": "Banh mi choices were large. Bubble trouble tea choices equally mind boggling, as my curiosity, &  my eyes, & eyebrows close knit, as if they were in goggles waiting to dive into this refreshing bubble tea madness. <br><br>Woah. Fabulous choices of bubble tea with various beany, fruity, stringy, bubbly condiments in the elixir that'll make anyone 100% Vietnamese for a day, much like St. Patty's Day, which makes us all lucky, & Irish for the day. Haha. <br><br>Yes, the elixir, will one day get right dislodged into the vestibule of my brain if I suck the bubble tea hard enough through the firm, & thick straw! :-D<br><br>On a serious note, everything inside was clean, neat, & tasty. The staff woman, however, was rather unwelcoming, & resisted answering questions about many unnamed items, including the various condiments, & the banana leaf roll ups. That's your job lady, unless you think I now Vietnamese for drinking down all your bubble tea in one giant sip. <br><br>Needless to say, I continued enjoying the lemon grass banh mi, & the double humble bubble gumble tea with no restraining factors of time nor care. <br><br>Ahhhhhhhhh...refreshed, & raring all the way with my DNA now partly Vietnamese, & the tapioca balls now firmly lodged in my brain cavity...it'll make learning Vietnamese that much easier! <br><br>Sorry to tell you, no photos included, because I, indeed, sucked it all down faster than a suckling piggy learning to experience the true joys of piggyback rides, & now from Chicago onwards to my next journey.", "pics": null}}, {"review": {"des": "Such a tasty banhmi ..had the veggie lemon grass tofu one ...the tofu itself was very tasty and it was combined with cilantro, carrots and radish", "pics": null}}, {"review": {"des": "Lemongrass. Tofu. Spring. Roll. Get it, you won't be disappointed. Also, their banh mi is LEGIT. Dat crunchy roll, tho. I've only gotten takeout from here, but there are a few four-top tables should you want to sit down and nom. Must try their pork buns and pho the next time I go. <br><br>It's dangerous this place is so close to my apartment. My wallet's already taken a hefty hit. AND they deliver. (They're closed on Mondays be tee double you.)", "pics": null}}, {"review": {"des": "Nhu Lan's bahn mi is slightly larger than the one at Ba Le, but its baguette is not as flavorful or taste as fresh as the one at Ba Le. Nhu Lan's baguette is harder on the outside (seriously it ripped the first few layers off the roof of my mouth), and not as soft/fluffy on the inside as the one at Ba Le. Otherwise, I think the traditional special sandwich's meat filling between the two restaurants are about the same in terms of taste. Ba Le still holds the trophy for best bahn mi in Chicago in my book.", "pics": null}}, {"review": {"des": "As a Vietnamese American, I approve of Nhu Lan sandwiches. I'll be honest, I was brought up on the deliciousness that is Lee's Sandwiches. Growing up in San Jose, there was a plethora of Vietnamese Sandwiches but my to go would be Lee's Sandwiches with that bread that would nearly cut the roof of your mouth cause the baguette was that hard. There's something seriously addicting with Lee's Sandwiches.<br><br>Never the less, I was craving a Vietnamese sandwich and didn't bring a big enough lunch so this was the perfect time to try Nhu Lan.<br><br>The staff, while not the most friendly, they were friendly as could be for middle aged Vietnamese people (gosh, what's that going to say about me when I'm middle aged?..). Ordering was easy enough and I was in and out within 5 minutes. <br><br>The pate was good and the bread was softer than I would have liked it. But all in all, just the right amount of cilantro and plenty of meat. <br><br>For the Nhu lan special, $5.50 with tax and all. While that price isn't what I'm used to, it sure is cheap compared to other Banh Mi places in Chicago.", "pics": null}}, {"review": {"des": "Do not order the roasted pork. It is 80% fat and has fried skin that is so thick and hard it could crack a tooth. Everything else was fresh, the toppings and bread etc. I also ordered the sesame balls which were hot and melted in your mouth. I will give another review once I try the bbq pork.", "pics": null}}, {"review": {"des": "Nhu Lan is a great place to stop by for a quick and tasty meal. I got the roasted pork banh mi and it was fantastic! The pork was very flavorful and the pickled vegetables added a nice tang to the sandwich. The banh mi was actually a bit spicy due to the jalapenos stuffed inside but it wasn't anything that was too much to handle. A word of caution: the bread used for the banh mi is EXTREMELY crumbly. The crumbliness of the bread is on par with that of those Nature Valley granola bars...<br><br>There were actually many different types of banh mi sandwiches offered. I will definitely be back to try the others!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/5TZB64deErII8BShKIZOcg/348s.jpg", "caption": "Roasted pork banh mi"}]}}, {"review": {"des": "Yum Excellent roasted pork bahn mi and shrimp spring rolls.  The portions are huge!  Sandwich and appetizer can feed two people.   I cannot wait to go back and try another bahn mi or just buy the roasted pork in and of itself.  The drawback is that if you don't live in the area, Lawrence is a nightmare to navigate.  living on the far north side, Its a journey for me, but one I will happy take for this heavenly sandwich again and again!", "pics": null}}, {"review": {"des": "Stay away. I was looking forward to a bahn mi sandwich. Based on the review I had read, I expected a treat. I ordered a roast pork bahn mi....it was entirely made  up of pieces of fat rather than meat. Each piece of fat was about 1/4 to 1/2 inch thick with the slightest trace of meat. It was totally disgusting. Every piece!!! I would never go back to this place.", "pics": null}}, {"review": {"des": "I came here as recommended by my friend! i don't go to many Vietnamese places especially bakeries for that matter. Me and my cousin enjoy one sandwich worth mentioning and that was the BBQ pork! The Nhu Lan special was actually ok too with a little kick! service was quick and prices reasonable for portion.seating was limited but spacious.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ykV2qDwI_36DssfQgbFEUg/348s.jpg", "caption": "BBQ pork sandwich"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/eS5aExaNt9gfHjfnzWLSag/168s.jpg", "caption": "Nhu Lan Special sandwich"}]}}, {"review": {"des": "Excellent spot! The vegan pho is heavenly. My boyfriend loves their bbq pork Bahn mi.", "pics": null}}, {"review": {"des": "I ordered the shredded pork banh mi with the works today and I have to say, I've had better. The roll was very crusty but it was a lot of bread and not so much ingredients. It was very dry. I wished for some sriracha mayo or something. Too bad, I really wanted to like this place. Maybe I'll have to try some other items next time.", "pics": null}}, {"review": {"des": "Best banh mi shop in all of Chicagoland area! The parking situation is tough since there isn't a dedicated lot, but it's worth a visit. The pre-prepped food in the refrigerator case also is quite delicious if you don't want sandwiches.", "pics": null}}, {"review": {"des": "I have been craving really good banh mi recently, so while visiting Chicago I decided to take my dad here.  As Vietnamese we are very picky about our banh mi. I ordered number \"16\" which has ham and egg and my dad had the house special number \"1\". We both loved our orders, and I have only found one good place before this in Eden Center in VA. The funny thing is that they share the same name so I originally thought that it was a change. Come to find out, no connection. The banh mi had a flavorful homemade pâté, viet mayo and good amount of soy sauce. Their picked daikon and carrots were on point as well. The bread is incredibly fresh and had good texture as a good banh mi should be. They had I believe up to 18 or 19 selections. There's other things offered too, which included fresh fruit smoothies to homemade desserts and savory snacks. Let's not forget the push for sriracha sauce at the front counter. They had good viet condensed milk ice coffee also, some strong stuff. So if plan on doing a full day of sightseeing in Chicago, it'll definitely keep eyes your open and ready for anything! We went early in the morning, so if you want a breakfast type feel then I highly suggest the one with the egg. But then again, I eat anything for breakfast. The staff is friendly and they accept credit cards. There's two tables that could seat four at each. This is only a few blocks away from the metro and easy to locate. Highly suggested if you love this type of food or want to try something new and away from the crazy food scene in downtown. Happy eating!", "pics": null}}, {"review": {"des": "Really superb banh mis (i always get either the #4 or #17) baked on fresh bread, with nicely marinated meat and fresh vegetables. Price is pretty affordable, ranging from about $6-7 per sub. There also is a buy 5 banh mis, get one free deal if you're in a group.<br>They also have really nice smoothies, and check out their spring rolls (esp for the peanut sauce!)<br>One thing to note: the restaurant is really small so it may be hard for you to find seating on a busy day.", "pics": null}}, {"review": {"des": "They've re-opened!  <br><br>A few months ago I was so excited about trying this place... I walked over and someone inside said that they just had a small fire and would be closed a while.  So, every time I walked by I checked to see if they had resumed service and today was my lucky day!<br><br>:-)<br><br>I ordered a pork meatballs sandwich.  It came with fresh peppers, cucumber and sprigs of coriander... so delicious!  It really hit the spot.<br><br>Every employee I encountered was also very friendly.<br><br>I will absolutely be returning to try more of their offerings.", "pics": null}}, {"review": {"des": "They've really started to skimp on their shrimp rolls. There used to be five or six shrimp per roll, now there are three. It irks me when restaurants start to do things like that... Also, there didn't seem to be as much flavor as there used to. They may be lightening up on herbs as well. Bummer...", "pics": null}}, {"review": {"des": "My go-to place for banh mi's close to home.  I also grab a bubble tea while I pick up a couple sandwiches to-go.   Its not the most appealing place on the inside but its not really a place to dine in anyway.  <br><br>The menu is on the wall with everything numbered and pictured.  If you're a noobie at banh mi sandwiches, the menu makes nice and easy to choose.  <br><br>Lawrence has a million of hidden gems, try to stop at this one when you get a chance!", "pics": null}}, {"review": {"des": "Great places to grab a traditional viet sandwich and it won't hurt my pockets. The ladies there are also great! I got a #8 and it was so yummy!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/l302tE0bCRR90mwxW7SF4w/348s.jpg", "caption": "#8 sandwich"}]}}, {"review": {"des": "I love this hidden little gem!! The lemongrass tofu is so good!!! The first time I had it, I thought it was neat! I used to get the sand which but now I always get the spring rolls. They come in 3 large to an order. I usually eat 2 one day and the last the next day. The dipping sauce that come with it is outta this world!! There's some interesting items in the cooler that I've never been brave enough to try.", "pics": null}}, {"review": {"des": "Great prices, huge portions! Nhu Lan is our go to staple for a quick lunch or dinner. Try the smoothies and the Bao buns!", "pics": null}}, {"review": {"des": "Small joint that produces some of the best Banh Mi you will find in Chicagoland. Banh Mi is basically a sub sandwich done Vietnamese style containing Pickled Daikon (radish), carrots, Cilantro, cucumbers and Jalapeños. <br><br>They pretty much remind you of most asian spots it's small, hot, chicken/ducks hanging upside down in a glass case and they are usually out of a number of ingrediants for their smoothies. However their stuff is straight up bomb. It's the fricken bread that separates them from the other busters. They are a bakery so the bread is so mad fresh crispy outside, hot and Charmin soft on the inside. The above mentioned ingrediants inside taste like they were grown from a backyard garden and just harvested. Simply a devine sandwich. <br><br>The smoothies are excellent as well. Fresh fruit is always used and you can mix flavors. Although they always seem to be out of something Bananas, Strawberries, whatever so have a few options in mind. Stay away from the Tapioca balls those things are whack. They just plug up the straw and smoothie suckage ceases to exist. <br><br>A great neighborhood spot that is quick and cheap with super fresh ingredients. Most likely get your stuff to go. Only 2-3 small tables with hanging Chickens staring at you if you do sit down. Banh Mi and Tapioca ball-less smoothies FTW!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/rDKsn6oAd1Q2dq8wM-6HlQ/348s.jpg", "caption": "Meat just hangin"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/YLruE9vSUIGHtjHUzS-qmA/168s.jpg", "caption": "Lemongrass Chicken Banh Mi"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/pyhGveSvNDx8CGeYa53YvA/168s.jpg", "caption": "Whatever the heck is in these cups"}]}}, {"review": {"des": "Vegan sandwich lovers listen up!<br><br>In my opinion Nhu Lan Bakery has the best vegan Bahn Mi in Chicago.<br><br>They also have numerous vegan options.<br>All vegan options are visibly labeled on the menu which helps make ordering simple. <br><br>Order the lemongrass tofu sandwich WITH jalapeños.<br>Then take the sandwich home and eat it with plain potato chips (Pro Tip)<br>Finish it off with a Diet Coke and now you're living the good life.  <br><br>\"You're gunna like the way you look. I guarantee it.\"<br>- George Zimmer", "pics": null}}, {"review": {"des": "This isn't my favorite Banh Mi in Chicago, but it definitely wins in the bread department!  The bread is just the right touch of crispy on the outside and oh-so-chewy and soft on the inside.  It's not a bland tasting loaf either so I don't mind just snacking on the bread - which is something that's us, Nhu Lan patrons do!  People come here for just the bread without buying a single banh mi - it's that good!<br><br>My go to order is a classic #1 as I'm a fan of pate - YUM!<br><br>It's located on a busy stretch of Lawrence Ave where parking can be a pain sometimes.  Venture onto a side street if you need to... or leave the hazards on right outside the shop as I see many patrons do!  They're pretty quick with making sandwiches, unless you've ordered 6 (if that's the case, be respectful and patient!).", "pics": null}}, {"review": {"des": "Nhu Lan is as close to authentic as possible. Not only are all the sandwich components individually delicious, but they work melodiously together. From the banh mi bread, which is baked in-house and made from wheat and rice flour -- a crispy, crackly crust that lightly shatters as you bite into it and an airy interior, yessssssss -- to the real deal fillings, it basically is the best version of banh mi in Chicago. I would say even better than Ba Le, which can be heavy on the mayo. <br><br>I had the banh mi dac biet, which has that amazing bread, fresh cilantro, sliced jalapenos, tangy, pickled carrots and daikon, cucumber spears, liver paté, a thin smear of mayonnaise, a sprinkle of black pepper, and a mix of Vietnamese cold cuts -- thinly cut ham, cha lau (aka Vietnamese pork roll), and cartilaginous, tender, but with a nice chew headcheese (it's better than it sounds, I promise!). All of this for just $4.50.... Not too shabby. Straight-up, Nhu Lan does banh mi dac biet better than most places in Chicago. Many of them skimp on these key ingredients or replace it with Americanized ingredients or omit them completely. A big No-No if you are looking for authentic. <br><br>Go for the sandwiches. Especially the banh mi dac biet. Check out the prepared foods in the refrigerated cases. I recommend the spring rolls and the banh gio, the triangular banana leaf wrapped bundles of deliciousness. And top it all off with a strong, but sweet Vietnamese coffee. You won't regret it.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/mfKet_Vi5ivGGHGHkf78OQ/348s.jpg", "caption": "The interior"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/dQIwETQOb-YdYRQH95g2BQ/168s.jpg", "caption": "The remains of the Vietnamese iced coffee"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/4BzeqfZWho3xgGy8qSVcfg/168s.jpg", "caption": "Banh mi dac biet"}]}}, {"review": {"des": "This spot is awesome.  Small, but the food was great.  <br><br>I had the Roasted Pork Banh Mi. So delish and the best part is that it was only $4.95! The heat of the pork went well to the overall taste of the cold vegetables and toasted bread. I need to try the other varieties! A good start to my Chicago excursion this weekend.  What else will be in store for me this weekend? #crumblesvsfood", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/lMACBxefRLecErxHqFnqIQ/348s.jpg", "caption": "Roasted Pork Banh Mi. So delish.  I need to try the other varieties! #crumblesvsfood"}]}}, {"review": {"des": "This review is based on their delivery from grubhub. I order from this location a few times and their sandwiches and bubble tea are on point. The order always arrives on time or about 10mins early. Their sandwiches are huge and always packed with meat and veggies. I feel that they don't skimp out. I always get their roasted pork. The skin is nice and crispy; the pork is super juicy and melts in your mouth.  Great place to order your banh mi sandwiches.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/6lfhVtxuVEnDEUB0pIp3CA/348s.jpg", "caption": "The roasted pork banh mi. Delicious and they pack the fillings!"}]}}, {"review": {"des": "I went to the sheridan location on sunday morning, service was fast, staffs were friendly, but my favorite taro pudding dessert is moldy.", "pics": null}}, {"review": {"des": "Fabulous tiny cafe. This place is an awesome find! Thanks to fellow Yelpers for helping us find a fantastic lunch today. We were in the area and looked up lunch and up popped this little gem. From the outside you would not think there was much to write home about nor the inside either. The place is tiny and unassuming with three plastic tables and 2-3 chair per table, a couple of fridges with homemade food and a counter to order. <br><br>The place was mobbed from the minute we walked in to the moment we left. People ordering lunch one after the other. We ordered two Bahn Mi sandwiches, one grilled pork and one roasted pork both $4.95 they were scrumtious, the warm crispy bread was fantastic and they were HUGE! We also ordered a Ga Chicken Pho to go $8.50 massive portion and also so delicious. Amazing value in this place. Service was a little frantic but they were so busy and as I mentioned the tiny place was accomodating coontinous lines of customers constantly ordering. We also took home some steamed pork dish and sticky rice that we will try tomorrow.<br><br>If you are in the area and like Vietnamese or have not tried but would like to, go here, run here, eat here!", "pics": null}}, {"review": {"des": "I know people have been going nuts about this place, but it was my first time trying it out.  Oh man, I'm now moaning how much I've missed out the whole time since moving to Chicago more than one (1) year ago.  <br><br>The entire venue was even tinier than what I imagined; there were four (4) small tables and they didn't seem comfortable whatsoever.  Patrons were coming one after another.  As a sensitive Chicago foodie, I knew this place wouldn't disappoint me.  <br><br>I picked out two (2) types of dessert and a bowl of shrimp salad from the open-deli refrigerator before heading to the register to order our banh mi.  All the banh mi selections are numbered, so if you really don't know what you're getting yourself into, just pick out your lucky number for the day.  You will end up having a great sandwich regardless.  <br><br>We chose #3 (lemongrass chicken) and #10 (lemongrass tofu).  The lady behind the counter kindly inquired us if we wanted everything ingredient on the sandwich.  Heck yeah, of course!  If you don't eat lemongrass, pickled horseradish, shredded carrots, and cucumbers, please re-evaluate the level of happiness in your life because you appear to be very pathetic!  <br><br>The banh mi were merely awesome.  There are lots of vegetarian-friendly menu items for those who adopted a vegetarian diet like my hubby.  Really though, try the lemongrass tofu.  They make it just as hearty as meat would.  I personally thought that the tofu tasted better then the real meat.  The baguette bread was also baked in house, and it was strong and crunchy, not wimpy at all.  <br><br>While we were patiently waiting for our banh mi, one of the patrons who came right after us didn't want to wait and started munching something he bought from the deli section.  I know, friend.  The food is excellent here.  I get it!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/GTcKruXhfYMV7cFdPGevrQ/168s.jpg", "caption": "#10 lemongrass tofu"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/L6epk7H69AT1KVfqL-GgFQ/168s.jpg", "caption": "#3 lemongrass chicken"}]}}, {"review": {"des": "Ban mi sammiches are what you come for.<br><br>I get the #1 and the bbq pork ban mi. <br>Every morning thai restaurants come here just for the bread and yes the bread is that good.<br><br>Small store front ans it can get crowded in there. Seating is limited to 3 tables. Make an order wait 7 min and munch outside.<br><br>TLDR: best ban mi in city. Order #1 or bbq pork.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/sdU2U0dAJOUkFrwvJ3pKOQ/348s.jpg", "caption": "Bbq pork"}]}}, {"review": {"des": "Love it! It's a great place to pick up food on the go especially on the way to work.<br><br>Their ca phe Sua da is quite rich. You will be tweaking in a sugar rush so sip slowly! My favorite sandwich is the grilled pork. It's not really grilled. It's stir fried, but it's still good. I also like picking up a few snacks while there. <br><br>Soooo much better than Ba Le.", "pics": null}}, {"review": {"des": "I have been here since they open, usually I have decent customer service from them, but of lately... it is terrible. You don't get a welcome vide from the cashier, she seem to have no patience to take my order of 7 banh mi. And when I try to confirm my order, she was read it back to me too quick that She had to repeat it again... but that was at no help when she read it back to me even faster then before. After my wait... they gave me 1 banh mi short... I'm glad I check my order before leaving. Because the person that made my order wasn't even sure of how many total banh mi was in my order. I only knew of this because I understand Vietnamese and I over heard the conversation between the person making my sandwich and cashier after I was about to leave.", "pics": null}}, {"review": {"des": "This place is fantastic for quick sandwich stop.<br><br>The good:<br><br>- I always get the grilled pork and it's amazing, especially for the price.<br>- Veggies always seem fresh.<br>- Service is quick and friendly.<br>- Place is clean enough.<br>- Pretty easy parking for picking up food.<br><br>The bad:<br><br>- Definitely more of a to-go place, but there are 2 small tables inside.<br><br>Have to check this one out, great value as well!", "pics": null}}, {"review": {"des": "To me, Nhu Lan and Ba Le are the top two banh mi bakeries in Chicago.  I like both of them for different reasons, but this new location really impressed me!  The lemongrass chicken was marinated in a unique sauce and super flavorful.  The Chinese roasted pork was also good, but the sweet bbq flavor is more commonplace. The French bread they came in tasted fresh out of the oven.  <br><br>From the look of it, you'll wonder how you can bite into something so monstrous, but your mouth will press down on warm, soft fluffy bread with just the right amount of chewy crust.  Pickled vegetables, carrots, and cucumbers made me feel like less of a carnivore.  <br><br>My only disappointment was that the mango pineapple smoothie tasted artificial, but my boyfriend was a fan so to each their own.  There are only 3 tiny tables that seat 2 and no restrooms; take-out may be more comfortable, but we happily devoured the sandwiches in record time.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/EoxBtANBc0dYlyi9l6Q3dg/348s.jpg", "caption": "Mango pineapple fruit freeze"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/R5ArzmhYEyixptwgi52log/168s.jpg", "caption": "Chinese roasted pork banh mi"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/tR9mq-9OvxwR8TAOg0-vIg/168s.jpg", "caption": "Lemongrass chicken banh mi"}]}}, {"review": {"des": "Awesome Vietnamese banh mi sandwiches!  Lots of meat pickled daikon on a warm French bread yummy!  I've had almost all the sandwiches except the vegetarian and they have all been hits.  I chase it down with a soybean drink.", "pics": null}}, {"review": {"des": "I noticed this place opened in a little strip mall on Lawrence & Sheridan not that long ago and I've wanted to try ever since. The opportunity never knocked for myself and Nhu Lan to meet as I have either already eaten or had plans to eat while passing.<br><br>Yesterday I went to pick up my dry cleaning in that same strip mall and was not thrilled by anything in my freezer or fridge. I saw Nhu Lan as its really the only place within the strip mall that has a lit up sign and thought perfect timing. I walked in and noticed the place was well lit with cooked meat behind glass and a refrigerate area with cold sandwiches, shakes and soft drinks. The different options are on the wall and the grilled pork banh mi sandwich caught my eye. I got it to go and it probably took 5 mins to make it from the kitchen to me. I got home and was surprised how big it was...I had to cut it in half. Very good sandwich for $4 and some change. This place is within walking distance from me so I have no excuse to go here for more deliciousness.", "pics": null}}, {"review": {"des": "Most authentic Banh Mi sandwiches I've had in Chicago so far.  My only reason for giving them a 4 out of 5 star is around service/customer service.  I ordered in advanced and picked them up.  All of my sandwiches were $6.25 except one was $3.95.  I had no idea on prices when I called as I just ordered.  They have a buy 5 get one free. They took off the $3.95 one even though my 5 other sandwiches were $6.25 PLUS I bought other food in their fridge there when I came in and picked it up.  My order was around $50 bucks.  Did not know this until after I paid. I felt that they should have told me this at some point before paying or at least on the phone when I was ordering the sandwiches.  Just left a bad taste in my mouth.", "pics": null}}, {"review": {"des": "My partner and I have ordered and visited Nhu Lan Uptown many times and have never been disappointed. The Pho Tai is always delicious and the freshly baked bread used for its sandwiches is the extra detail that makes them all the more delicious! <br><br>The staff is always friendly and attentive and the wait for to-go orders is relatively short.", "pics": null}}, {"review": {"des": "Love it more than another restaurants I have been to in Chicago. So authentic, so homemade, so awesome. Regardless the environment, I love everything about this restaurant. It is also very very cheap as well. My boyfriend and I ordered more than what we can eat but it is still very cheap. I hope it can open more stores in Chicago and else where in the US", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Fm8RvW8MQ67aOhFJ_9g_4Q/168s.jpg", "caption": "Very tasty homemade sandwich bread with pork belly"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Tr2mHmng2vGtt7x639OScg/168s.jpg", "caption": "Oh my god. So good, try the duck and its juice"}]}}, {"review": {"des": "My fiancé and I recently tried out this place. <br><br>We couldn't figure out if we could park in the lot on the left of the building because the sign noted parking ONLY for shoppers of a nearby grocery store. We paid for street parking. <br><br>The cashier was very limited on English and the place could use some updating. <br><br>However, my fiancé very much enjoyed his brisket soup. Our shrimp spring rolls tasted healthy and filling. My lemon grass tofu sandwich tasted yummy! But, the bread was a little too crispy, making it hard to eat.<br><br>If we're in the area, we'll probably go again!<br><br>It was our first time eating Vietnamese food.", "pics": null}}, {"review": {"des": "The lemongrass chicken and the lemongrass vegan tofu Vietnamese sandwiches are excellent. They come with spicy jalapeno peppers, so ask for no jalapenos if you want non-spicy.  <br><br>They have lemongrass vegan tofu fresh spring rolls packaged in the cooler on the right as you enter, which have a yummy peanut sauce.  They have a lot of yummy treats in that cooler like flan and Asian desserts.<br><br>They have fresh fruit smoothies with tapioca.  Most flavors come with sweetened condensed milk, so ask for no milk if you are allergic to milk.  The mango and watermelon are my favorite flavors, but they have the options on the board on the left behind the counter.<br><br>They serve pho noodle soup as well.  They have roast duck that looks great, though I haven't tried it yet just because I usually go there for lunch.  The staff is friendly and helpful.", "pics": null}}, {"review": {"des": "They offer the best Banh Mi in town. We have to drive 30 minutes to get them but it's worthy. We loved their special sandwich and the grilled pork sandwich. Next time, we will try the Pho.", "pics": null}}, {"review": {"des": "The real deal! This small size bakery has a huge following!! If you enjoy Bhan Mi sandwiches this is the authentic Vietnamese bakery for you then! And pick up one their GIGANTIC pork buns!! Looks like an uncooked bread ball, but one bite in and you will be walking out with another sandwich and bun to go!", "pics": null}}, {"review": {"des": "Being from San Jose, CA,  I believe I am able to distinguish between a good and bad banh mi. Though I admit I have never been to Vietnam myself, I have had my fair share of the famed vietnamese sandwiches.<br><br>That being said, I am so glad I have found a place in Chicago that retains the essence of the banh mi without trying to Americanize it or put a modern twist to it. This also refers to the shop itself. I call it a shop because I there are a total of about 8 seats that you can sit down and eat at. However, as you will see, most will do take-out. Don't look to be pampered here, but at the same time, know that the service is great and people are kind.<br><br>There are a wide variety of items to choose from, which includes rice plates, prepared noodles, some hot items that are displayed, Vietnamese desserts, and of course, the Banh mi sandwiches that many people go for. <br><br>Each sandwich ranges from about $4.00-$6.00, and will fill you up about 75% given you are a pretty hearty eater. If not, it'll probably satisfy you just fine. In each sandwich, they have the typical meats including pate, bbq pork, chicken, vegetarian (which is the reason for the span of prices), with pickled radish/carrot, cilantro, large piece of cucumber, and jalapenos. You are more than welcome to tell them if you don't want a certain type of the garnish in there. The only difference I see in this shop as opposed to others I've tried in East San Jose, is the large cucumber. Though atypical, I wouldn't knock it. It gives the sandwich a refreshing crunch, though if that's not what you are used to, they would have no problems not including it.<br><br>I got the grilled pork since they ran out of the BBQ pork banh mi at 7pm! I was super bummed but just goes to show that it's quite popular, or that's what I told myself anyway. It was juicy and flavorful, without any tendons or toughness. They also did not skimp on the meat. There was an even spread throughout the entire sandwich, unless some places which I will not name. The baguette was warm when I got it which only added to my excitement as I bit into the sandwich. You get that first crunch, followed by the hundreds of crumbs that explode in either directions, followed by the chewy soft inside of the baguette. Needless to say, I was just as impressed with the filling as I was the bread itself.<br><br>I see myself coming back here many times as I craze a tasty, well made, extremely affordable, and truly Vietnamese banh mi in the future, and you should too.", "pics": null}}, {"review": {"des": "Great fruit smoothie for a good price! Their roast pork was also delish. Comes with a free bread! Super nice and friendly people working their! Will try their other desserts and bahn mi!", "pics": null}}, {"review": {"des": "Saw this driving by harvest time grocery and had to try it after reading the reviews. My wife and I have had wonderful banh mi sandwiches in other cities and this place was the best we have had so far in Chicago. The place in argyle weren't as good and more expensive, so we're happy to have found this spot. We got the roast pork and BBQ pork and our only complaint is that the filling was heavy to one side, so one bite would be very meat heavy and the other side would be veggie heavy. We will definitely be back though to try the other sandwiches!", "pics": null}}, {"review": {"des": "Great sandwiches made the right way every time I've been there. Their desserts are good too", "pics": null}}, {"review": {"des": "Food was pretty good, but the reason I give it 5 stars is the service. I was going to purchase a water and the price came out to be a little over a dollar. Since I'm poor I never carry cash I only had a dollar bill on me, but the cashier just told me I could get it for free. I still gave her a dollar and felt homeless at this point, but thanked her. Also the person who brought out the food to me gave me a great big smile, and at that moment I knew my food was made with love.", "pics": null}}, {"review": {"des": "BEST BANH MI EVER!!!!!!!!!!!!!!!!!!!!!!!!!<br><br>Our first stop after getting off the plane: Nhu Lan. I didn't look at their Yelp reviews before going there, and the place looked like a normal, small Vietnamese sandwich shop. I took a look at the menu and I knew this was gonna be good.<br><br>Why?<br><br>LOOK!<br><br>SUGARCANE SHRIMP & PORK. In a sandwich. And the #1 classic is of course, a no-brainer choice. <br><br>Please deliver. To New York. Thanks.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/2FkiSkMN-durRHhrBjGQVg/168s.jpg", "caption": "#1"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/QSv93dgm4IiVG1_bw7X9jQ/168s.jpg", "caption": "SUGARCANE SHRIMP & PORK"}]}}, {"review": {"des": "All around excellent. We came here for the banh mi, and they definitely didn't disappoint. We ended up picking up 8 sandwiches: 2 grilled pork, 2 pork rolls pate, 2 shredded pork, and 2 pork meatball pate. Though the grilled pork was our favorite, everything was delicious. So much that I forgot to capture photos! :) Having a small sampling of each one provided the best way to eat all the different meats without feeling stuffed. BTW, each sandwich is about 8\" and they do not skimp on the filling. I loved the pickled vegetables; light, crispy, tart, and refreshing. If you are sensitive to spice, ask them to omit the jalapeños. The craftsmanship of the sandwich is something that I haven't seen in a long time. Each are neatly stuffed, and no soggy mess!<br><br>Each sandwich ranges from $2.95- $4.25, but the majority fall in the $3.50-$3.75 range. Fresh-baked bread make the sandwiches oh so magical, and best if eaten immediately, but they reheat nicely if you place them in a toaster oven for a few minutes.<br><br>The young lady that took our order was sweet and adorable, and her mother was so sweet and even gave us a discount! What a gesture!<br><br>It's a shame that we can't go more frequently, but this place for sure will be a stop every time we are in the area. If you're a fan of banh mi, definitely give this place a try. Great variety, affordable prices, great portions, solid ingredients, and fresh-baked bread! You can't beat that. :)", "pics": null}}, {"review": {"des": "I bought a banh bao xa xiu like a week ago while o was eating it there was a 2inch white hair inside yuck. I should have taken a picture.", "pics": null}}, {"review": {"des": "Finally decided to review Nhu Lan after coming here numerous times. We have tried the Nhu Lan Special, Lemongrass Tofu and BBQ Pork Bahn MI's here and they are all equally delicious.  Make sure you get the combination Spring Rolls, SO GOOD....and the accompanying peanut sauce is to die for, YUM!  The sticky rice with various meats is also very tasty.<br><br>Ranks right up there with BaLe, can't say one is better than the other, just different.", "pics": null}}, {"review": {"des": "This is a small little bakery/cafe. The food is good at a decent price. They have ready made food to go also. The bah mi sandwiches are flavorful. They have vegan options for sandwiches too. I tried the ginger tofu and it was really good. I normally go for the grilled, BBQ or chinese pork sandwiches. Those are my favorites. They also have pho and other plates available that I have not tried yet. The sandwiches are great for a group of 6 because they are buy 5 get 1 free! I've taken them to work and had people try them for their first time and they love them and ask when I'm going to bring more. Great little spot that no one knows that well except for the locals.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/0Q0eVlpLlkbyrmdMIhMJHA/348s.jpg", "caption": "Ginger tofu bah mi"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/3WKnVrS8b6kgTLLfxoFUAw/168s.jpg", "caption": "Shrimp spring rolls"}]}}, {"review": {"des": "A very good amount of meat and veggies for the sandwich :)<br><br> Tastes good, so I have nothing to complain about. <br>Love that they have parking, which is always the hardest park of living in Chicago.<br><br>Satisfied my Vietnamese food cravings :D", "pics": null}}, {"review": {"des": "HIGHLY recommend! Everything is worth it.<br>This was our go-to breakfast spot the entire trip. It was not overrun by tourists, there were lots of locals and they had great banh mi , Iced coffee, and Beef Noodle Soup. It was cheap and they had us in and out quickly so we could go sight-see. All in all, a great experience.", "pics": null}}, {"review": {"des": "Oh how I heart thy! Small shop with big heart with made-to-order sandwiches. We had the Nhu Lan Special (#1) - the pate made this a very scrumptious sandwich. The lemon grass tofu bahn mi is awesome too. Anyone could be fooled, it looks like beef and the texture is like beef but its not. Great option for vegetarians and non-vegetarians alike. The crunch in the pickled veggies and fresh herbs round out everything. So delectable.", "pics": null}}, {"review": {"des": "Had the shrimp/pork sandwich it was amazing (#13). Great flavor, fresh bread would get again in a heartbeat. But let's talk about the lemongrass Tofu (#10). Bruh..... As a meat-eater who is dating a vegetarian I have tried many veggie substitutes and this is easily the best I've had. The tofu has a Jerky- like consistency but is packed with flavor, I highly recommend to vegetarians and those who are not. <br><br>Seating inside isn't great so plan to take it to go, but this place is a gem!", "pics": null}}, {"review": {"des": "Whenever we go out for a picnic or just fast food, we always call nhu lan for their bahn mis. Recently, however, we have even tried Nhu Lan's shrimp crepes, spring rolls, and pho. They were all very good. As for bahn mi's, the usuals are the pork belly and the nhu lan special. I like the stickers that are put onto our sandwiches with actual labels rather than the normal marker marks on the paper. The small things I get happiness from is funny to most.  <br><br>The French baguette of Nhu Lan's bahn mis are texturally perfect, nice and soft inside, and a little crunch on the outside. I also think their bread is bigger than most bahn mis but that could just be my imagination. They have a deal like most Vietnmese restaurants where if you buy 5, you get one free. This gets me every time,  so what I usually ask them to do is put the condiments on the side for the ones I'll eat later on in the day or the week. I usually head up my sandwich in the oven the next day for about 5-7 minutes for yummy deviousness.   <br><br>Who says you have to go to Argyle for great Vietnamese food.  Go to Nhu Lan where there's also a parking lot!! Major plus!!", "pics": null}}, {"review": {"des": "Needed my fill of Banh Mi, and having been in Chicago for the past 8 months refused to settle on the nearby Saigon Sisters(which I still refuse to go to). Also this place was on the top of my list for having the most authentic banh mi in the city, so my expectations were high. Glad to say that they were fulfilled. A group of us ordered 12 sandwiches, including their Cold Cut(#8), Roast Pork(#2), Grilled Pork(#4), lemongrass chicken(#3), Lemongrass Tofu(#10), Meatballs(#6), and Xa Xiu Pork(#17). First things to note, fresh bread, even at the end of the day. Second thing, $4-5 a sandwich, and they have some significant size to them so one could serve you for a meal though I'd probably end up downing two if I'm hungry. Third thing, they really know what they're doing here. The Grilled Pork(Banh Mi Thit Nuong), was a favorite with fantastically marinated pork, still juicy and with just enough fat to serve as a binder for the sandwich. Really though they were all good. The Banh Mi Xiu Mai(#6) and Banh Mi Thit Nguoi(#8) definitely tasted like Vietnam, while the lemongrass chicken and tofu were actually very pleasant surprises. We were especially impressed with the tofu, which honestly was pretty indistinguishable from meat the way they prepared it. All were served with very fresh pickled vegetables, a thin slice of jalapeno, and cucumber to really add some freshness. Basically...authentic sandwiches are authentic. <br><br>Also they do buy 5 get one free*, which only adds to the authenticity.<br><br>*For those wondering, this is a common deal distinctly at Vietnamese banh mi sandwiches. Don't ask me why, I don't make the rules I just observe them.", "pics": null}}, {"review": {"des": "As far as banh mi sandwich places go, this is still my fav one I've tried in Chicago by far. I'd even put them a little ahead of Ba Le, my 2nd fav banh mi sandwich place. Such a great tasting sandwich, and I wouldn't mind trying some of the other things on a future visit.<br><br>I can even overlook the fact that I'm nearly positive one of the workers(in their native language) snickered at me(and poorly covered it up), for my request of no cilantro on my banh mi sandwich. Ah well, no place is 100% perfect.", "pics": null}}, {"review": {"des": "Tasty Vietnamese sandwiches, sure, absolutely, but this place holds a special spot in my heart because of the spring rolls. Just the right combination of flavors with perfect creamy-with-an-almost-tangy-undertone peanut sauce.<br><br>Update: also fantastic egg rolls, and you can't beat the price.", "pics": null}}, {"review": {"des": "Ordered delivery from Nhu Lan (thru yelp) and it was delicious! Best pho broth I have tried yet! The only reason this is not 5 stars was bc they forgot one of the soups. They were very apologetic and they fixed the issue immediately though. I will definitely order again soon.", "pics": null}}, {"review": {"des": "Search for bánh mì sandwiches on yelp and found this one, and sadly was not impressed, ordered a barbecue pork bahn mi and pork was very tough. Bread was ok. Needed a bit of love.", "pics": null}}, {"review": {"des": "Fantastic unassuming spot for Vietnamese food.  They sell roast pork, BBQ pork, BBQ duck by the pound!!!", "pics": null}}, {"review": {"des": "I just added a photo, and it's so beautiful it should sum up my entire experience.<br><br>The delivery guys are always super sweet, always there in under 45 minutes, and always have the correct order.<br><br>The last time I ordered (I always go through Grubhub), they were out of some things I ordered so they called, asked what I would like as a substitute, and included a free egg roll and sesame ball (I had always avoided the sesame ball because it seemed like a weird concept... Until  my friend took a nibble and raved for 10 minutes about the darn thing. Then I obviously had to try it- and was hooked)!<br>Now my friend and I have literally made a pact to get together once a week and gossip and order from here.<br><br>Yay being in your 20s.<br><br>Their noodle soup is fine and delicious and fresh, but it's the sandwiches that will make you moan.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/8npEtFKTeR9zDi-xrNS5UA/348s.jpg", "caption": "Awesome grilled pork sandwich delivered (already ate the #1 special) in under half an hour!"}]}}, {"review": {"des": "I didn't love everything I ordered, but I don't think that was their issue. More my preferences. I wanted to try something different for delivery and they had great reviews and were available in the afternoon so I gave it a try. I loved their Vietnamese spring roll - they were huge, fresh and the dipping sauce they included was yummy with a little spice.. different than what I'm used to. The sandwiches were good. For me it was a lot of bread and kind of dry but, hey, it's a sandwich (hello, bread) and they included a dipping sauce to drizzle on it. All in all, it was pretty good but I haven't had the urge to go back yet.", "pics": null}}, {"review": {"des": "The bread is fresh made and the veggies are crunchy. Can't go wrong with Nhu Lan. One of the best sandwhices in the city!", "pics": null}}, {"review": {"des": "I'm fortunate to live in Uptown, not far from Argyle St and all the amazing Vietnamese restaurants. I have been a loyal customer of Ba Le for years, but Nhu Lan just knocked them off the victory podium. I visited the location on Sheridan and Lawrence and ordered the #10, lemongrass tofu Banh Mi. Best. Sandwich. Ever.", "pics": null}}, {"review": {"des": "Love love love this place!! Every time I am in the area, it is a must go to. I always order two number 1s with extra pate! The number one consists of three vietnamese cold cuts along with a nice helping of pate. The bread that Nhu Lan use to make their banh-mi is so good. It has a perfect crunchy exterior with a nice soft pillowy inside. Typically all banh-mi will come stuffed with shredded pickled daikon and carrots as well as some sliced jalapenos which can be quite spicy sometimes. Another of my favorite sandwiches is the grilled pork. Juicy charred pork which has been marinaded in lemon grass and other goodies. Buy one for the road, and then buy another sandwich for when you're hungry later at home! <br><br>One of my other favorite things to pick up when I'm here is called Cha Lua.. which is basically a giant vietnamese pork roll thats been wrapped in a banana leaf. I believe its made from pork that has been pulverized into a paste with lots of fish sauce. It's then wrapped and rolled in a banana leaf and steamed to perfection. I would describe the texture as \"bouncy\". I happen to enjoy this the most cut into cubes with two fried eggs, a big bowl of steamed rice, and a little bit of soy sauce. You can even slice this thinly and put into sandwiches as well! Don't forget your caffeine and sugar fix and order the cafe sua da (vietnamese iced coffee). For those of you that don't know what vietnamese iced coffee is, it is basically very strong espresso thats been mixed with a generous helping of condensed milk and poured over crushed ice. It's a must have beverage!", "pics": null}}]}