{"name": "nico-osteria-chicago", "reviews": [{"review": {"des": "I had dinner here with my wife on Sunday night. We fell into the joint without reservations due to a plumbing mishap at Bistronomic so I must give credit to the folks at Nico for being able to seat us so quickly.<br><br>I enjoyed the meal. We ordered two selections from the crudo section of the menu and one of them, the charred octopus, was the best version of that dish I've ever had. The other dish was the suzuki bass, and I was a little underwhelmed by it, to be fair. <br><br>The entrees were fantastic, however. My wife had the orecchiette with tuna sausage and it was very different - fresh tasting and savory at the same time. I had the lobster tortelloni, and the sautéed mushrooms included with the plate somehow manage to outshine the lobster. <br><br>The decor is interesting. The restaurant has a chefs' table at which patrons can watch the chefs do their thing, a formal dining area and a more casual seating section near the front door. We chose the formal dining room although not at the chefs' table. Although the table was too small for two people, I still enjoyed my time there. And the front staff were all attentive and pleasant.<br><br>Very nice place. I recommend for any date night, even impromptu ones!", "pics": null}}, {"review": {"des": "One of my favorite restaurants when it first opened, Nico now is just OK. The food is generally good (some of it really good), but the service is usually awful. More of a 3.5 star review, but I'm rounding down because of the price. <br><br>The pasta, crudo menu, and desserts here are great. In particular, the rigatoni bolognese and orecchiette with tuna sausage are fantastic. The gelato has always been awesome (malted cookie dough was a recent hit). If you're here in the mornings, the croissants are among the best in Chicago. Other aspects of the menu have been less successful for me (for example, so-so arctic char; below average burrata). <br><br>Given that there are some real hits here, I'd be much higher on Nico if it wasn't for the inattentive, unpolished service. At these prices, I just don't get it. On more than one occasion, I left without an extra glass of wine, or coffee and dessert, because the waiter was MIA and I couldn't wait around any more. I recall a weekday lunch in a half-empty Nico where two people each eating two dishes was stretched to nearly two hours because of a missing waiter. Having dealt with the same awful service twice within a few weeks, I once emailed the restaurant about it but nobody ever wrote me back. Maybe bad service is part of the concept.<br><br>I'd go back if I'm in the area, but wouldn't make a special trip to the Gold Coast for Nico. Chicago has too many other great Italian restaurants.", "pics": null}}, {"review": {"des": "Unforgettable experience at this trendy Italian restaurant by One Off. Personable service and excellent food in a sophisticated space.<br><br>- West Coast oysters: Delicious. Regret not getting the caviar supplement.<br><br>- Hamachi Crudo: Succulent, as good as I've had anywhere.<br><br>- Stuffed Pappardelle: Tasty.<br><br>- Pan-seared Gnocchi: Very good but the least memorable dish that I consumed.<br><br>- Duck: Exciting presentation. Tender.<br><br>- Gelato & Sorbetto (many scoops): Couldn't bring myself to stop eating until it was finished.<br><br>- Tiramisu, Chocolate Torta, Butterscotch Cremoso, Boccone Dolce: I'm not going crazy--I dined here with a dessert person. So many different flavors that I've run out of nice things to say.<br><br>You cannot go wrong at this restaurant.", "pics": null}}, {"review": {"des": "On our last day in Chicago, we decided to eat a nice brunch before heading to the airport early for our flight since we had our newborn baby with us. We were walking aimlessly while yelping and found this place in the area. It wasn't super busy since we were early for lunch and the restaurant wasn't crowded so it was nice and quiet. We both had the Rush Street Lunch - food is great and the service was on par. It was a nice find and definitely will want to come back again!", "pics": null}}, {"review": {"des": "Art + Date + Dinner + Best Restaurant Dessert in Chicago!<br><br>Pastry Chef Leigh Omilinsky's BROWN BUTTER PAN DOLCI will save your struggling date/connection. Love at first bite that is best shared.  Wanna spoon and fork?<br><br>TIRAMISU was intended to give us familiarity with a twist.  Citrus on cream is original and never done before.  Somehow everything feels light while keeping the traditional taste.<br><br>Worthy elevated Sandwiches!  Must get the SEXY SANDWICH (per Henry, aka Chicken Parmesan).  Deconstructed CLUB looks good too... pile of protein.<br><br>Pasta is questionable as STUFFED PAPPARDELLE was bland.<br><br>Beautiful & World Traveller, Hostess with the Mostess, MS SHILOH is the keyholder to THE SECRET STAIRWELL OF ART.  Request for Tour.<br><br>Best seating for LUNCH DATE is the kitchen area.  When bored, ask for Henry to jollify the vibe.<br><br>Say HELLO to awesome humans: dinosaur tattooed Andre, suave communicator Bidkar.  Generally, Staff has excellent face, charming, & impeccable manners.<br><br>I look forward to Pizza + Cocktail at the Inspiring Bar [the way of an excellent gold digger.]", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/cFoUSG0gzXcoNhX4EzesiA/348s.jpg", "caption": "Nico: 4 Flights of Art in Secret Stairwell"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/i2PUDV_KJwoeQw3k9x98kw/168s.jpg", "caption": "Nico: Must See - Secret Stairwell of Art (Tour Available)"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Vxr--Kj0xliyelYuY0QTzg/168s.jpg", "caption": "Nico: Living Wall @Bar"}]}}, {"review": {"des": "I was very disappointed with my experience at this restaurant. I was surprised by how small the menu was; there were very limited choices. We decided to get the meatballs as an appetizer. It ended up being 3 tiny meatballs for 16 dollars. I know this is Gold Coast Chicago, but come on- that's just robbery. <br><br>As a main course, me and my girlfriend both got one of the pastas, which was decent, but that's not saying much.. it's pasta. <br><br>Also, we were given probably the worst seat in the entire restaurant. We were placed in between two large parties, against a wall, with no window. And it's not like the place was packed, there were open tables. We also had a reservation. <br><br>We will not be coming again.", "pics": null}}, {"review": {"des": "I love this place. Every time, I've visited for either breakfast or brunch/lunch and it's always been exceptional. <br><br>Wonderful, fresh food, served in a gorgeous atmosphere - you can't ever go wrong!<br><br>Service is friendly and not overbearing. If you have questions, they're happy to help!<br><br>On my last visit, I was seated by the open window. It was such a nice spot. Definitely a great seat if you don't want to fully be sitting outside.<br><br>Cute patio, cute bar area, inviting spot for a family outing, date, etc. <br><br>Food - 5<br>Atmosphere - 5<br>Bathrooms - 4 (clean but downstairs so not super convenient)<br>Service - 5", "pics": null}}, {"review": {"des": "Looking for great food and a nice atmosphere then Nicos is the hot spot for you.  During the summer they'll open the windows allowing a perfect al fresco dining experience and during the winter sitting at the counter is pretty fun while watching the chefs prepare one excellent dish after another.  Pasta is delish and keeps our family come by back for our Nico fix.", "pics": null}}, {"review": {"des": "Nico Osteria is solid. It's got a nice atmosphere, good food, and pleasant service. Nothing has ever really wowed me; however, there are some truly lovely touches. For example, I am mesmerized by the large windows that flood the restaurant with sunlight. The servers are knowledgeable and friendly. I am delighted that some of the coffee drinks come with a cookie.<br><br>I have always been seated in a booth, even after a person in my party asked to be moved. The booths share a low back with the table on the other side. I've seen people accidentally elbow and bump heads with one another. Also, the tables and benches are at odd heights. It's not the most comfortable seating situation.<br><br>I would (and have) gone to Nico Osteria a couple times (Restaurant Week and recently brunch). I was curious and they were convenient. I'm no longer curious about it but I'd go there in a pinch.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/_VWBMIf_oZ8sdpZvi-HPMg/348s.jpg", "caption": "Inside of Nico Burger"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/l_GyYhfnF2s93Yy5T_tZNg/168s.jpg", "caption": "Nico Burger"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/dSiBe_001f01mz4amjByvA/168s.jpg", "caption": "Bloody Mary"}]}}, {"review": {"des": "ASTRO loves Nico. <br>Who am i to say otherwise?<br><br>I have been going to Nico regularly since they opened. I do not like some of the dishes but i have liked enough of them by now that had to jack up my rating.<br><br>Whenever the street area is open, Astro (my puppy son) and I go there, normally for breakfast/brunch since I can order the steak for him.<br><br>Service is always good. Andre is one of my regular servers there. Great champ.  Jaqueline is very good. Shwayla ? (the lovely hostess with cool outfits and lately greenish hair) is amazing. Everyone is really good. Nice to me, and nice to Astro.<br><br>One of the best oatmeals. Pastas in general are good. Sashimi dishes so so. Pricing on the high side but reasonable for the location.<br><br>One of the best restaurants in that neighborhood.", "pics": null}}, {"review": {"des": "Well we didn't wait long to return after enjoying our restaurant week here. Came in early for some drinks at the gorgeous bar. Water glasses immediately appeared as we sat down and our drinks came soon after. Loved my Il Passero. Had to wait a bit for our table but we were having a good time at the bar and our host came to get us when the table was ready. One of our friends was really tipsy from the cocktail of the day and started making crazy demands to the sommelier, who put up with us graciously and brought a few wine samples before we decided. The Sicilian wine he recommended was excellent. <br><br>We started with sardines and gem salad. You can't get sardines that fresh anywhere else in Chicago, and it paired perfectly with our wine. I'd happily eat 5 plates of it by myself! The gem salad had a lovely dressing that made it special. For pastas we got the cacio e pepe and shrimp tortelloni. Hubby says the cacio e pepe is closest to the best we've had in Rome state-side. The shrimp tortelloni was so light and full of spring veggies. For entree we shared the dover sole which came with these incredible pieces of crab-stuffed zucchini blossoms. <br><br>We ended with strawberry baba au rhum & monte bianco. The baba au rhum was so light and airy although slightly too alcoholic for me. The monte bianco was to-die-for. I don't know how they do it, but everything I've had here was fantastic and service is always excellent. One of my favorite places in Chicago!", "pics": null}}, {"review": {"des": "My favorite restaurant in Chicago this far (after three trips in the past year, I just moved to Chicago two months ago)!!!<br><br>Delicately and beautifully prepared food. Excellent customer service every minute of our experience.... <br><br>I basically Nico based on other positive reviews and photos of the food for my mother's birthday. My parents and I were very pleased. We ordered dishes to share, all of which were wonderful:<br><br>Appetizers of the Olive Oil Poached Tuna and the Chef's Selection <br><br>YUMMY pasta!!! It is often difficult to find freshly made pasta that isn't weighed down by the sauce - the pasta here is lovely. The bolognese is flavorful without being heavy or greasy. Loved the slight crunch of the carrot/celery with the soft, moist beef. And the stuffed pappardelle is DELICIOUS. That will be on my list of re-ordering!!! <br><br>Tenderly cooked fish! Bronzino (plenty to share for 2-3 people) and the Halibut were perfect. I love fish, but I rarely find places that can do them justice. Nico is a go-to for fish lovers.<br><br>Tiramisu, not like typical, but rather an upgraded version! I actually wish I hadn't eaten so much of their bread (fresh, soft) because I would have wanted to order another dessert to try. <br><br>Also, they delivered my mother a delectable chocolate-banana desert with a birthday candle on the house!<br><br>I had a $25 gift certificate from OpenTable, but the code somehow didn't work... so they took off the two pasta dishes of the bill. More than the $25, so very kind of them. <br><br>I will definitely be booking reservations here again soon! Also looking forward to trying their other restaurants that the waiter mentioned.", "pics": null}}, {"review": {"des": "We celebrated our anniversary at Nico Osteria and from the moment we walked in they catered to us.We were welcomed by the hostesses who knew we were celebrating and escorted us to our table. Our server, Brett, was fantastic! He offered us complimentary glasses of champagne as soon as we sat down.<br><br>Brett had great recommendations and was incredibly knowledgeable about the menu. The service was impeccable and the food was delicious, especially the crudo raw bar, the pappardelle, and orecchiette. At the end of our meal, Brett brought complimentary cookies and chocolates that were amazing. <br><br>I highly recommend Nico Osteria for casual and special occasions! We will definitely be coming back.", "pics": null}}, {"review": {"des": "The first time I ate breakfast at Nico I was staying at the Thompson (the attached hotel), and I knew immediately that it would be a regular stop for me in Chicago. It's a miracle that there is always seating at this place, and it's also a miracle that they have such great coffee. The food always hits the spot, too, and I always manage to get something healthy.<br><br>The waitstaff here is excellent, and more than willing to work with you if you want something a little bit off the menu. I wanted an egg white scramble with vegetables, and even though it wasn't listed, they whipped it up no problem. If you want something a little more exciting, the Eggs in Purgatory are ridiculously good (baked eggs, pancetta, potato, tomato sauce, and focaccia.) I also recommend pairing a bloody mary with whatever you decide to order.<br><br>Nico is full of natural light, has plenty of seating, and the food is always so, so good. My only complaint is that their bathroom (down a basement hall) is totally creepy -- to the point where I wouldn't go down there again. Regardless, I'll be back for breakfast!", "pics": null}}, {"review": {"des": "I have been here three times in a 48 hour period and I am not a guest at the hotel! Love, love, love this place! Easy relaxed vibe coupled with delicious food and drink and friendly and warm staff makes this a must destination. No brainer!", "pics": null}}, {"review": {"des": "First off I wanna say the food is great. I heard about the popup they were doing with Big Gay Ice Cream, and I was so excited! I went with a friend of mine expecting to see either the Big Gay Ice Cream Truck or a designated popup area within the restaurant for BGIC. It was more of a curated dessert menu, which, ok, cool. It ended up being more of a collaboration with BGIC than a true popup. You won't find the signature Salty Pimp, Bea Arthur or Mermaid Sundae. Mildly misleading, but I was game. We were initially going just for the ice cream but decided to stay to eat because the food looked great. And it was!<br><br>One thing that was kinda weird was there were empty tables left and right, but the hostess put us on a wait list and we waited maybe five minutes for the table. We had a lovely table outside, and maybe they just weren't sitting people inside as it was an odd time of day on a Saturday. <br><br>I had their Aperol spritz cocktail, which was lovely and well balanced. My friend got one of their mocktails customized with gin for a yummy, citrusy summery taste. We ordered the Brussels sprouts bruschetta, the prosciutto cotto and the French fries. The fries were fine but forgettable, but the other dishes were stunners! The prosciutto with the grilled focaccia and its citrusy accouterments was so luscious bright. The Brussels sprout leaves were crispy and perfectly salty. The burrata was creamy and cold, which was perfect in the summer heat. <br><br>From the BGIC dessert menu we ordered the double rainbow macaron ice cream sandwich, the apricot cobbler sundae and a chocolate croissant. Because the dessert menu said BIG GAY ICE CREAM across the top I made the mistake of assuming everything would be an ice cream dessert. The chocolate croissant was not ice cream, but was so tasty that this slight confusion can be forgiven. It was a riff on rocky road with marshmallow goo and almonds. Yummy! The macaron sandwich was so pretty to look at and the Fruity Pebbles around the outside added perfect texture. Then the bourbon apricots in the sundae--wow! Apricots are underutilized, I think. <br><br>Last thing that was kinda weird was on our check several of our items were more expensive than listed on our menu. I want to be clear that I'm not complaining about the prices or the food being expensive in general, but if the menu says a dish is $14, it shouldn't be $17 on the bill. I almost didn't say anything until I heard another table mention it to their server, so I mentioned it to ours. He fixed it and it was a little over $10 difference. Not huge, but, you know, it bothered me. <br><br>I would absolutely go back. I'd order that Brussels sprouts bruschetta anytime. I'll probably dream about it. I'll just check the receipt.", "pics": null}}, {"review": {"des": "Honest review: didnt like the food was surprised at how basic it is considering blackbird and publican are so good the service was ok nothing special didnt describe menu items n wasnt really that attentive one thing that was an issue was that the pos system turned off so we waited like an hour to pay after we finished eating thats fine but i feel that they should have gave us something while we were waiting like coffee since it was cold i liked monteverde so much better idk why but everything had tomoatoes and lemon in it adding acidity where its not needed ruins a dish. The desserts were to sweet n kinda basic best things: Brussel spout bruschetta, stuffed parpardelle/ double baked croissant/ profiterole <br><br>Uni Tagliolini $26: this was really bland. The pasta was cooked nicely but that was it. The sauce was to thin and had a really strong lemon flavor. The lemon made it more light but it was an odd combination n u couldnt taste any uni so add more so you could get that briney flavor n for 26$ there needs to be some protein in here or veggies or something because its just pasta in an lemony alfredo sauce<br><br>Brussels Sprout Bruschetta $15 this was the best dish of the nite. The bread was really crunchy n oily so it was really rich just a lil burnt. The Brussel sprouts added richness just it was way over fried. The cheese n the sauce combination was to die for its like the best cheese plate youll ever have just add more sauce. The hazelnuts added crunch just add more nothing really to complain about this dish just fix little mistakes<br><br>Stuffed Pappardelle $23 this was the second best dish of the nite i hate carrots with a passion, but the sweetness cut through the richness so it was actually useful in this dish. The pasta was cooked perfectly n the meat inside was really rich the sauce was supper decadent, but it was to soupy n thin so make it thicker. The best part was the bread crumbs on top put more of it then i didnt really taste truffle so add more of it. Adding something to cut down the richness would make this dish taste better like some greenery or something acidic<br><br>Lobster Spaghetti $39 for being the most expensive pasta dish i ever had it wss definitely the worst lobster dish i ever had. The sauce was so bland there was no flavor whatsoever lobster is suppose to be supper decadent this was not the case <br><br>Crispy potatoes $9 these were ok nothing special. the big potatoes werent crispy n the small ones were burnt the sauce wasnt rich enough n the cheese used in this doesnt melt n they put lemon in it?<br><br>Twice Baked Almond Croissant $12 amaizin the croissant was really crispy and flakey the filling inside was amaizin just put filling inside. I loved the almond crunch nothing better then candied nuts just put more. The icecream was really good. Didnt really care for the blueberries would have preferred a sauce it was a lil to sweet though n i would have liked the crossant to he war<br><br>Sweet Corn Profiterole 12$ amaizin the profiterole had the best texture. Wish the filling was something more special kinda basic. The sauce was really good because it was acidic. I really liked the icecream but the other components didnt really add anything n it was a little to sweet<br><br>Pesche con Crema $12 i didnt like this. there were like soggy donuts that were awkward texturally the biggiest issue is this dish was really sweet", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/bLU-2lFLIPSqInFZDmr4vQ/348s.jpg", "caption": "Stuffed Pappardelle 23$ amaizin"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/UH--vf4kJlLsb_LC1TXwWg/168s.jpg", "caption": "Lobster Spaghetti $39 bland"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/irL-V_sW1RvJtKAMcKxqCA/168s.jpg", "caption": "Uni Tagliolini $26 gross"}]}}, {"review": {"des": "Really delicious Italian meal in an intimate and romantic restaurant. <br><br>Drinks:  They have an extensive wine list with bottles starting around $40-45. <br><br>Antipasto:  We started with the Brussels Sprouts Bruschetta which was really delicious. Cheese, sweet honey, crispy hazelnuts and a heaping portion of Brussels sprouts made for a unique & memorable dish. Highly recommend! <br><br>Crudo: I'm always a fan of raw fish and this was no exception. We ordered a sea bass with avocado. It was very tasty, but for the price/portion size, I would probably just got to a sushi restaurant for raw fish. <br><br>Pasta: My husband ordered the Stuffed Pappardelle and I ordered the Orecchiette. The pappardelle is very rich and decadent with a good portion of pork and a prominent truffle flavor! The Orecchiette was a lighter, creamy dish with tuna and I LOVED it. Both come highly recommended too! <br><br>Dessert:  We ordered a dessert to split & it was good, but honestly the good on the side of my coffee was better and satisfied any sweet cravings. <br><br>We loved every course of our meals and consider this a favorite Chicago Italian restaurant.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/6BXaDgJ09-Vsu8SNa9QDSw/348s.jpg", "caption": "My after dinner Americano with the most delicious cookie on the side!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/PB1RElsZoexnwZDfQvp61w/168s.jpg", "caption": "Delicious autumn dessert"}]}}, {"review": {"des": "This place was every level of amazing - we got to sit at the bar seeing the chefs prepare stuff, so it a great experience! Most memorable things to note: We started with the chef's board of crudo which I expected to be just regular sashimi - they do add some incredible layers of flavor with additional ingredients though, so it's for sure not the usual crudo experience - it was some of the best prepared I've had. The gnocchi was A M A Z I  N G - it was so fluffly and light. The sweeat and sour onion that they put on top of the fish was one of the best things I tasted that night - I could legitimately eat scoops of that. The brussel sprout bruschetta was every bit of good as the other reviews say. Crunchy, flavorful, and big. Overall, I have nothing negative to say about any of the things we got. Everything was very good. Taking into account we had quite a few different things, I feel its important to note as usually restaurants are good at one or the other type of plates whereas this one hit high marks on everything we got. Service was also great - our server checked up on us often to see how things were going, tables and glasses were kept promptly clean, and we got seated fast. Great experience overall and I look forward to coming back!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/-8Br3hZmY_FUVnkjBe_XtA/348s.jpg", "caption": "Crudo"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/iaO6UJgWhwnpHlXnkP_oHw/168s.jpg", "caption": "Brussels Sprout Bruschetta"}]}}, {"review": {"des": "Very nice place to visit when going to Chicago!<br>The Brussels sprout is to die for.... the sweet taste mixed with the soft herbal touch in the bread makes this dish not only yummy.....it is aaaaabsolutely delicious!!!<br>The menu is not diverse enough but, the choices pretty fair. <br>The service is very good as well and the staff very friendly.<br>Burrata and meat balls......Another amazing choice but, honestly nothing can bit the Brussels!!!!", "pics": null}}, {"review": {"des": "Wow, absolutely phenomenal. Everything was perfect, from the service to the ambiance, the cocktails to the food. I'd recommend asking to sit at the Chef's Counter, very fun to watch appetizers being prepared. We highly recommend the Brussels Sprouts Bruschetta (we got so excited when we came we forgot to take a picture of it) but I'm sure you won't be disappointed regardless of what you order. <br><br>Our meals were balanced, tasteful, and delicious. It was truly an experience. Special recognition to our server Laura for outstanding service!!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/gklezkVIT6jJXpb6iCNsWw/348s.jpg", "caption": "Cacio e Pepe"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/gRg7-rhAcUNV_wZ72wpeSA/168s.jpg", "caption": "Latte"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/uyaZOX4MoqsMzCDZfoMVLA/168s.jpg", "caption": "Chef's Table Seating"}]}}, {"review": {"des": "I came to Publican last year and this year, decided to take my friend to Nico Osteria to celebrate her birthday.  You know, just trying to conquer all of Paul Kahan's restaurants. <br><br>Nico is located at the corner of the street and I came around 7:30 and it was quite full already for their outdoor seating. Inside seemed busy as well but luckily I had a reservation. <br><br>I had planned this dinner weeks ago as part of a surprise to my friend who did not know we were flying out to visit her. The restaurant staff were able to accommodate our surprise and played along nicely. <br><br>Once we were all at the table, we had an original waiter who initially came by to take out order but after that, he disappeared. In fact, we had someone else take over the rest of the meal with no introduction. Regardless, I was pretty pumped to try their homemade pasta! <br><br>If you guys have seen pictures of their lobster spaghetti and plan to order it, their spaghetti is the ONLY noodle they do not make in-house so I swapped it out for the tagliolini which was the right move. <br><br>For dessert, I ordered the tiramisu which was amazing. Overall, the lobster spaghetti was good but had it been something else with the red sauce, it wouldn't have been special at all. The tiramisu was my favorite, quite possibly the best I've had. Light, good texture and paired with a cocoa hazelnut cream which was delicious.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/4BuioocU_Q0rrh4TuuBBAQ/348s.jpg", "caption": "Tuna crudo"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/6Jdg2XN6uBIv41XXs-oy5w/168s.jpg", "caption": "Lobster spaghetti with sub tagliolini"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/VLmLFiujDzwddRKD0SMnmg/168s.jpg", "caption": "Twice baked almond croissant"}]}}, {"review": {"des": "Outstanding and innovative Italian food prepared in an authentic manner. <br><br>We came here based on the recommendation of a sales associate on Rush street when we asked where we could grab a drink and some snacks. We came on between lunch and dinner, had a couple of cocktails (which were fantastic) and then enjoyed it so much we returned for dinner.<br><br>We ended up running into another couple who were regulars and joined them at the bar where we all shared many of the pasta dishes which were fabulous with my favorite being the stuffed parpardelle. Each of the preparations were obviously homemade, even the usual pasta styles that are elsewhere served premade like orecchiette. <br><br>The wine list is small but very Italian-centric with some hidden gems like the Sardinian Isola Dei Nuraghi which was spicy, delicious and paired well with all of our selections.<br><br>Service was friendly, helpful and attentive. Would certainly return.", "pics": null}}, {"review": {"des": "Had the nico breakfast and a cup of coffee here. The scrambled eggs and potatoes were well executed. <br><br>Good service. Nice space. The dinner menu looked good. Maybe next time.", "pics": null}}, {"review": {"des": "Have been to Nico on multiple occasions and always have a very enjoyable experience. Staff is very friendly and knowledgeable. Great bar area and a nice place to grab a cocktail.<br><br>Now to the food, and I'll only talk about my favorites. First off, the crudo. Maybe you wouldn't except an Italian restaurant to have such delicious fresh fish offerings but they do! And they do it well! I suggest stating off with their daily crudo selections. Next, the Brussels sprouts bruschetta is amazing. Great combination of flavors and they get the Brussels sprouts so crispy! My favorite dish is the Orecchiette. Delicious homemade pasta with such a nice combination of flavors that don't over power each other. I say this is my favorite because I could probably eat it every night and not get sick of it! <br><br>A little pricey but a lot of good things to offer. Will definitely be back!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/k1Fq4DkyI-K2eshsW6Uh-A/348s.jpg", "caption": "Brussels Sprouts Bruschetta"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/EG3P3CSIoiD3fJAEPCb6FQ/168s.jpg", "caption": "Crudo selections"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Pu1_HnO1LfeYgJkLOabZiA/168s.jpg", "caption": "Orecchiette or a big bowl of comfort food"}]}}, {"review": {"des": "Brussel Spout bruschetta is simply AMAZING!! Great service. Cute outside dining but the main dining hall is super cozy, too. <br>The shrimp tortellini is delicious!", "pics": null}}, {"review": {"des": "This restaurant is simply one of my favorite places to lounge around whether it's for a drink with a friend or dinning in for some late night dinner. I always stay at Thompson hotel which is above nico which makes it very easy to order food and drinks from there. <br><br>Great environment with a lovely hostess who was amazing and very friendly. The waiters and bar staff were just as well. Whether you order some egg Benedict or a burger you will definitely be impressed and enjoy your time. The cocktails are prepared with the best touch and they taste just as they look. There is outdoor seating as well which can be nice to enjoy a nice meal out in the sun or shade. <br><br>I highly recommend this restaurant to anyone who is visiting or lives in Chicago, located in Gold Coast area.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/AJjMxJ5KtQAu42AQB827yA/348s.jpg", "caption": "Nico's burger comes with fries, which were amazing!"}]}}, {"review": {"des": "I'm so disappointed to give this restaurant this rating, especially since it had been on my list of places to try for a while and a coworker absolutely loved her experience just 2 days before. And, I really don't give 1 star ratings, so it kind of disappoints me when I have to. Had a few things not happened, this place would have honestly had a solid 4 stars in my book (for food and ambiance)... but poor and slow service, my friend and I both getting SICK from the food afterwards, and my friend taking home an extra order of meatballs for her fiancé only for him to realize the insides were not fully cooked ... definitely all played a role in me giving this place a 1 star.  <br><br>We went in for restaurant week this past Tuesday. While I waited for my friend (I was early for once), I grabbed a drink at the bar - the vodka cocktail, which I enjoyed. Once my friend got there, we decided to take the counter seats that were available rather than waiting for our table since the previous patrons were still there. The view from the counter seats was great - we got to watch all the action in the open kitchen (seems like they just did apps out there), which was super fun. A few of the guys would explain things to us and chat with us which was nice. <br><br>We both ordered the restaurant week menu and also ordered a Brussel sprouts bruschetta to share. That was definitely my favorite part of the meal. I also ordered the salad, truffle cacio e Pepe, cauliflower ravioli (subbed this for all of the meat options), and tiramisu. It took a very long time between each course - we're talking 25 minutes after our plates had been picked up between the salad and pasta (and a bit less between the other courses). This may have been tolerable if a) we only had 2 courses and b) the tables around us with other servers also seemed to have slow and poor service, but neither of these were the case. Overall, with the exception of the bruschetta which was GREAT, the other food was good - but nothing exceptional. But, the service just threw off our dining experience. (If this was all that was wrong, this place still would have gotten 3 stars from me). <br><br>I started feeling a bit sick to my stomach before even leaving, but at the time I figured I was just very full from the meal. Once I got home, I was definitely sick from something I ate. The next morning (still feeling sick), I texted my friend who confirmed that she had been feeling sick since leaving the restaurant as well. I'm curious to see if others that went that night (Tuesday 1/30) felt the same way. I didn't end up feeling better until Wednesday evening. <br><br>The service and the fact that we got sick from our meal was already enough for me to say I would never be back here again... but to top it off, my friend said her fiancé went to eat the meatballs she had ordered To Go to take home for him and he told her they were raw in the middle. I definitely will never be back at this restaurant.<br><br>Searching other reviews, it doesn't seem like many people have had experiences with getting sick for a few years at least (or at least haven't written yelp reviews about it), so maybe our night was a one off... but I definitely won't be risking it again and if you plan on it..... good luck. Thank goodness I didn't come here and pay full price for this horrible experience.", "pics": null}}, {"review": {"des": "After nearly a month wait for reservations, I went there for dinner on Saturday.<br><br>The bread was fresh baked and had pieces of olives.  I had never had it before. <br><br>We started with Bar Harbor Mussels which had almond butter.  I'm usually not a big fan of mussels but these were so tender!  The crushed almond pieces were a great touch of texture. <br><br>I ordered the Uni butter tagliolini and was extremely disappointed.  There was no pieces of uni and did not taste like anything but butter.  Not worth $26.  It was too greasy for me.  I would never order it again.  <br><br>My two friends both ordered the Ciabatta Crusted Black Bass which was extremely crispy on top and tender on the inside.  I wish I had ordered this instead...<br><br>We shared the greek yogurt elderflower gelato and Pesche con Crema.  The peach dessert had a very cute presentation.  It looked like mini peaches and looked prettier than it tasted.<br><br>Overall, service was pretty good but the food was disappointing.  I had heard great things about this place and it just did not live up to my expectations.  I may return to try their brunch<br><br>They offer valet parking for $16.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/x-F5P3L8kEn0ww8c3Qczxg/348s.jpg", "caption": "Greek yogurt elderflower gelato"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/7maJv6cvg-13LHMKQAAwtQ/168s.jpg", "caption": "Peaches and cream"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Gq7dQTz-jA8P9NTUCssPug/168s.jpg", "caption": "Uni tagliolini $26"}]}}, {"review": {"des": "After having eaten at Nico both morning, noon, and night - I can say that this is one of my Gold Coast go-to's when I have out of town visitors. <br><br>The brunch menu offers a little bit of everything with pancakes and pasta to a cappuccino with cookies. Lunch hits all the sweet spots with a decent array of salad, sandwiches and delectable burgers. Dinner rounds out with a delicious assortment of pasta - although I am sad carbonara isn't offered during dinner! <br><br>Overall service, selection and wines have all been good and I would recommend to anyone that visits!", "pics": null}}, {"review": {"des": "Since I'm leaving Chicago, I wanted to make my last dinner a good one. I decided on Nico since a) it has a great reputation and b) they take OpenTable gift cards and finally all that online reserving paid off! <br><br>Service & atmosphere: the space is beautiful and we got to sit outside which provided a lovely view of Viagra Triangle and cozy warm lights as it got later. Our server was friendly, informative, and gave us lots of time to talk and eat (and take pictures of our food).<br><br>Food: we ordered the tuna confit appetizer, hyped branzino, lobster spaghetti, and almond croissant. The tuna confit was tangy and fresh. The branzino was so flaky and tender, I loved how easy the meat came off the fish and how the meyer lemon brought out the flavors. The lobster spaghetti noodles themselves were cooked perfectly though the sauce was nothing special. My boyfriend and I LOVED the croissant dessert. Full disclosure, I'm an almond croissant fan so this was amazing: flaky croissant with soft buttery inside layers and sweet, nutty almond paste complimented by the ricotta and elderflower yogurt gelato. Sidenote: the complimentary focaccia and flavorful olive oil were so good we asked for more (#isbreadacarb). <br><br>Though it wasn't the best meal I've had in Chicago (or even maybe the best Italian), it was a lovely send off. Thanks, Nico!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/JDHwnvjKeSUi54xSAfjTVw/348s.jpg", "caption": "Almond croissant with ricotta and elderflower yogurt gelato OMGGGGG"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/keYAc__IeJJRtCZ5zToO0Q/168s.jpg", "caption": "Lobster spaghetti"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/81JC8_TAS9w1tfrGLrsMWQ/168s.jpg", "caption": "Salt crusted branzino with Meyer lemon, baby kale, and English pea"}]}}, {"review": {"des": "In all honesty, my expectations might have been too high, but I also blame Paul Kahan for making Public, Avec, Blackbird, Big Star, and Violet Hour so amazing. Here's the run down:<br><br>1. Food 3/5 Overall<br>Bread (5/5): Olive bread is great and they give you so much free bread. It's dangerous...<br>Big Eye Crudo (3/5): It was good, but $18 for 6 tiny slices of fish is a little exorbitant for the overall taste of the dish. I did not value each bite at $3 a pop. <br>Chef's Selection Crudo (2/5) : Six pieces for $15. There were three kinds of fish. The hamachi piece was good. The other two weren't memorable. There was not a whole lot of texture or contrast in flavor. <br>Brussels Bruschetta (4/5): This was definitely over the tastier items. Bread was crispy, the Brussels were fried, and there was a touch of sweetness from some honey. I just wish the bread was cut a little thinner. It was like half an inch thick.<br>Cauli Ravioli (5/5): It would have been a shame if they messed up the pasta. This was really good and not too heavy. The bits of raw or pickled(?) cauliflower were a great addition.<br>Veal (0/5): I have made better food out of my crock pot. The veal was SUPER dry. There was a bunch of fat and it just came with some mushy cabbage and apples on the side. The saddest dish I've ever seen. We only ate like half of it and didn't get it boxed. <br>Dessert (5/5): I don't remember exactly what it was, but it was amazing! Then again, I'm also down for the cookie pizza skillet at red lobster...#sugaraddict<br><br>2. Drinks: 3/5 <br>We only ordered old fashioneds. They were good, but the type of whiskey they used was disappointing for such a nice place. Not in my top five old fashions of Chicago (FMK, Violet Hour, Honey's, Drumbar, Aviary).<br><br>3. Service: 4/5 <br>Our waitress was very nice, and definitely knew her stuff, but she never asked us if we enjoyed our food? I would have been happy to provide feedback on some of the dishes in person.<br><br>Glad I finally went, but definitely didn't warrant the $200 bill. Will only be going back for dessert and maybe drinks.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/9WYSOf7YBSR4wBd6mG_0kA/348s.jpg", "caption": "$33 will get you 12 pieces of crudo. I recommend ordering two pasta dishes instead."}]}}, {"review": {"des": "While visiting Chicago for the weekend, I grabbed dinner at this restaurant at the independent recommendation of two friends. Unfortunately, I left disappointed. <br><br>The space is huge but we were oddly seated directly next to another table even though there were empty spots around the restaurant. Quite distracting. <br><br>But my major complaint was the entrees. I got grilled swordfish, which was so undercooked it was still cold in the middle. I couldn't even finish it. Never had swordfish served that way. My girlfriend got the stuffed pappardelle, which was quite innovative but fell a bit flat.", "pics": null}}, {"review": {"des": "Making the OneOff rounds. Sat outside on a gorgeous night. Started off with the Hamachi. A little olive oil, delicate grapes, and the right amount of acid. We had the Orecchiette and Summer Tagliolini.  The tuna sausage was unexpectedly good. The combination of peaches and basil was a hit. Pasta was perfectly done. We ended with the Boccone Dolce and Brown Butter Pan Docli. The Bay Leaf gelato was so light and refreshing. Much more restrained than I was expecting. The Sweet Corn and Olive Oil gelato was also an interesting combination that worked surprisingly well with the rest of the dish. Neither dessert was overly sweet. Perfect night! Need to come back for brunch!", "pics": null}}, {"review": {"des": "Bill and his staff crafted an unforgettable dining experience for my wife and me at Nico Osteria. <br>The cocktails - on point. <br>The bread - an adventure. <br>We ordered the chicken and veal for our entrees and they had a warm familiar flavour but totally reinvented at the same time. <br>The desserts left us smiling at the end of the night.<br><br>Thank you, Nico, for a wonderful date night with my wife!", "pics": null}}, {"review": {"des": "I really wanted to love this place... but I have to agree with other reviewers- it's quite overpriced for some mediocre dishes. <br><br>The space itself is really wonderful. It's large, spacious, comfortable, and has hints of fancypants. But I'm really all about the food. <br><br>Cocktails are 11-13 (normal) and the old fashioned was good. 4/5. <br><br>The complimentary bread was one of the best things I ate. The Olive bread (large hunks of green olives in it, and I actually hate olives) was delicious. Fluffy, flavorful, and they gave us what seemed like two loaves. <br><br>The Brussel sprout bruschetta was surprisingly delectable. A nice hunk of bread with some soft creamy cheese, honey, crispy brussel chunks, and hazelnuts. It was a little greasy and messy but this is the only thing that would make me return for. 5/5, MUST get. <br><br>The rest of it was very meh. We had some crudo which was ridiculously priced and very.... \"oh that's what I just paid $30 for?\" My orchiette pasta with tuna sausage was trying too hard. Too peppery, too spicy, just had it all wrong. The stuffed pappardelle was pretty good (4/5) but had a half serving of pasta framed as something that should fill you up. The swordfish was just okay, also a tiny serving with no sides. <br><br>The cauliflower ravioli was very very good. If I were going back I would get this as my main. <br><br>In sum... the bread, bruschetta, and cauliflower ravioli were the only items maybe worth the price. Everything else was just a little disappointing for the price.", "pics": null}}, {"review": {"des": "Utterly speechless. If I could, I would go to KAY jewelers, buy the biggest cubic zirconia I could find and propose to this place. And even if it turned me down, I'd understand....I can't tie down this place. That's unfair. So let me begin with my review:<br><br>1) The bar area is so chill. Couches and comfy chairs so relaxing you might forget you have a reservation. The drinks are great as is the service.<br><br>2) On to dinner....lets start with the apps. The meatballs, in the words of Spinal Tap, were an 11. And they come with this rice dish in hash brown-clothing....gooood lord!!!!! Oh, and let me not forget the octopus carpaccio which was oh soooo good as well. <br><br>3) Now to the stars of the evening. The rigatoni bolognese and the stuffed parpadelle. The bolognese was made on Mount Olympus because the taste and quality are truly mythical!! It's not a saucy, thick bolognese that you would find in a traditional southern Italian restaurant. It was more of a northern style, light but so damn flavorful. The parpadelle and its sauce was just indescribable, it was that damn amazing.<br><br>4) The desserts should not be ignored. The chocolate torte and some other dish that I can only describe as a white shelled sweet goodness that should be banned in 48 states and Guam. So bommmmmb.<br><br>5) The service, our server Brigitte was awesome. Great drink recommendations, on point dessert recommendations and overall just a great human being (I think, I'm not 100%, but I gave her my social security number just in case, I just trust her that much.).", "pics": null}}, {"review": {"des": "Location is dynamic!  Service was impeccable!  Menu is intriguing!<br><br>What we enjoyed:<br><br>Bar was fun - would be great for an event.<br>Wine selection expertly paired!<br>Oysters excellently fresh!<br>Chefs Selection of cured fish sashimi excellently fresh!<br>Dover Sole w/crab stuffed squash blossom - Awesome!<br>Halibut expertly prepared.<br><br>Internal Seating has a great view of the street or kitchen!  <br><br>Well done Bill!<br><br>On a personal note, I missed the calm intimacy of Snaggletooth.", "pics": null}}, {"review": {"des": "I was expecting a delicious lunch but was completely blown away! This was one of the best restaurant experiences I've had in a very long time. It's not often that I have a lunch that's truly life changing. First, the tea. The tea is infused with Rose that just adds that one element that tea has always been missing, whether you knew it or not. My advice is to order it with a side of Simple Syrup and add it to taste. Next, I had three samples of Crudo but none were as remarkable as the Bigeye Tuna. It's dressed with Strawberry, Scallion, and Seaweed sott'ollio that will change your mood, if not your life. Far and away the best Tuna Crudo I've ever had the pleasure of enjoying. <br><br>Finally the Stuffed Pappardelle which is a refreshing and rewarding experience in it's own right. A light lunch that was truly something I'll never forget.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/g1NCWtezsIk0nB4l4W2ZpA/348s.jpg", "caption": "Stuffed Pappardelle"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/i1uOCLN5OlpIlyj2cawhaw/168s.jpg", "caption": "Bigeye Tuna Crudo"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/le0bbx2DduECjg4LpYVomg/168s.jpg", "caption": "Chef's Selection of Crudo"}]}}, {"review": {"des": "This is the worst food ever save yourself a trip. They put in a ton of salt to mask the flavors.", "pics": null}}, {"review": {"des": "I've been to Nico Osteria several times spanning the last 3 years - date night with the wife, post-Gibson's Christmas party with my firm colleagues, and lounging with friends at the bar and hotel area. <br><br>One memorable experience was a fun date night in the main dining area overlooking the open Chef Kitchen, in which the Nico staff paid particular attention and provided us with a great dinner experience on a Saturday night. We ordered the Chef's Selection Crudo Plate, Pan Seared Branzino, Ravioli, an apricot based dessert, and a chocolate coffee gelato dessert. The portions are easy to get through and the restaurant leaves you with a set of Macaroons. <br><br>I'm looking forward to a lunch this summer and will try outdoor seating this time!", "pics": null}}, {"review": {"des": "Nico Osteria is a delight with terrific atmosphere and great food. Their  bruschetta is amazing, as I'm sure is the case of all their Italian fare. Valet parking is available and it's really easy to spot the restaurant. You also get a small complimentary bite of dessert with your bill.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/CM45ivOqbGhS0um4YDCS0w/348s.jpg", "caption": "Outside"}]}}, {"review": {"des": "I love dining here on a warm summer night, sitting outside surrounded by high rises and the nightlife buzz of Gold Coast.  Service is impeccable, inside is beautiful.  Food is amazing but portions are small and very pricey.  Boyfriend asked the host for flowers and he brought over a small vase with pink roses for me - very sweet!  Great date night!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/AGIAONJogCfWNaYu_IpxEg/348s.jpg", "caption": "Fish, beet salad, lobster pasta"}]}}, {"review": {"des": "Amazing amazing. We were seated by open table last minute on a weeknight. Service was exceptional. Wine was delicious. The fish fry and asparagus we started with were out of this world. The fish fry has deep fried lemons and olives that are honestly to die for. Ambiance feels upscale but friendly and attire ranged from dresses to hoodies. For mains we had a gluten free pasta fish with big eye Tuna and the whole branzino, both of which were exceptional. <br><br>I will say, the menu gives a pretty vague impression of what you're getting so prepare to ask questions but honestly 10/10, knocked the ball out of the park.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/to6OKiiq4i_phG1KW2rQYg/348s.jpg", "caption": "Dessert menu"}]}}, {"review": {"des": "Love Nico! I've been here a few times and I can't believe I haven't written a review for this place yet. The food is always outstanding and the wine selection is superb. The service is consistently great, and the staff is always willing to help with any questions. The layout of the restaurant is beautiful, I definitely recommend grabbing a drink at the bar if you have time before or after your meal. My roommates and I came here for restaurant week and this was their first time at Nico. They were blown away by every course! The tiramisu was huge and the gelato I had was creamy and delicious. The Bolognese was my favorite, and the waiter informed us that the sauce for the Bolognese dish takes days to make... and you can really taste it. I also recommend the Quercia Prosciutto... who would have thought prosciutto and rhubarb jam would go so well together?! Well.... Nico would. :)<br><br>Next time I need to try their brunch!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/L_i7xc35H_gmwFzPTicHJQ/348s.jpg", "caption": "Flat Iron Steak"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/6jQVMZ5Rv3FnDXmSv7DElw/168s.jpg", "caption": "complementary snacks with our check!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/pqkDDH87ywBz0FQ_ILX9qA/168s.jpg", "caption": "Rigatoni"}]}}, {"review": {"des": "After reading several Tribune articles about the octopus here, we finally tried Nico last night.  I'll start with the restaurant itself - very beautiful inside with a different feel.  Instead of most restaurants that have a super large bar you sit at, Nico has a super large kitchen you sit around.  You do have that option, but we opted for a regular table.<br><br>One annoying thing we encountered when we were seated.  Now, I know the place will fill up on a Friday night very quickly, but at 6 pm, there were several open two seater tables, and they sat us right next to another couple.  The tables are very close to each other so it was odd to sit right next to them with other openings.  We both asked if we could be seated one table down and the hostess said unequivocally \"no - those will fill up very soon, too, so it won't matter\"  True - they would, but not for another 15-20 minutes as it was.  So, each of the two couples could have enjoyed some privacy for 15 minutes.  Instead, we literally sat on top of each other.  That was a little bothersome especially how the hostess handled it.<br><br>Our service was quite good and everyone was attentive.  For drinks, we tried the Americano (a vermouth and graperfruit concoction), and the Cocktail of the day (which was an apple cider type drink).  Both were okay - but nothing great in our mind.<br><br>For food, we ordered the Market Salad, Brussels Sprout Bruschetta, Octopus Carpaccio, and the Lobster Spaghetti.  The salad had apples, grapes, parmesan crisps and was refreshing and good.  The Brussels Sprouts and Octopus dishes were both great and really delicious.  The Lobster Spaghetti was also good with a little spice in the sauce.<br><br>Food-wise all very good - border line great and I would order each dish again if I go back.  But, as other reviewers mentioned, $12 for a salad, $15 for bruschetta and $20 for octopus is a little steep b/c none are very large portions.<br><br>One other issue we had was that within the first hour of us being there, we only got the salad, and we ordered the food pretty quickly.  My belief is that the kitchen messed up with our appetizers and forgot about them.  Enough so that our waiter brought us out a pork broth soup to compensate.   Not really a compensation in my eyes in that literally it was a pork broth soup with no meat or veggies in it.  But at least he acknowledged the mishap with the kitchen.<br><br>Overall - I really liked the place and the food, but we did have a few mishaps along the way - not to mention the price for the portion of food - that might lead me to try other places before Nico.", "pics": null}}, {"review": {"des": "This place is a real treat.  Not surprising based on the reviews I've read, but even when you go in expecting something, you can still be a little blown away.  Great service, like really great service from our waiter (Ben, I believe) along with the surrounding staff.<br><br>My \"bartender's choice\" cocktail was so cool, and unexpected.  It served as the perfect prelude to the food, which was just as cool and unexpected.  The hamachi crudo was fantastic, sweet and spicy and subtle all at the same time.  My pea soup was incredible. And finally my homemade pasta was the best.  This is a place to which I will return.", "pics": null}}, {"review": {"des": "First time, great food, flavor in the stuffed parppadelle was outstanding!  Meatball was amazing light with the right amount of tomato sauce and fresh herbs for brightness.  Would provide a pic but look so good I forgot to take one!", "pics": null}}, {"review": {"des": "We went during restaurant week 2017, and the menu was SO worth it! There were four courses, all delicious. (Please note, I have not been there outside of restaurant week). My other restaurant week stops in the past have disappointed me, and this was not the case at Nico Osteria. <br><br>The ambiance was romantic. We were seated at the bar/could see some things being prepared. I might've been meh on this seating arrangement at first but I ended up really liking it. <br><br>One of the sous chefs overheard me being sulky about only one olive in the olive bread, so she brought us over some extras with lots of olives of her own accord. It was very sweet of her! Service was attentive. I also liked the decor in the hotel attached - however I was rather confused upon entering the building. We came in through an entrance that opened up to a curtain in the back of the restaurant and it was strange. Figured it out though! Definitely need to go here again.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/vwSd6oZ0O2rchNXiFQTyYA/348s.jpg", "caption": "Restaurant Week 2017"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/03bygfPCNexbD9C2x_EHSg/168s.jpg", "caption": "Restaurant Week 2017"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Do9c-tdkcgjnYJ3VmGIBeA/168s.jpg", "caption": "Restaurant Week 2017"}]}}, {"review": {"des": "Today was my first time at this place and I am so in love with it. The layout and atmosphere is so elegant. They have a small outdoor patio that's super cute. I came in for lunch and had the best mimosa ever! I also had their meatball appetizer and seared tuna salad. Everything was sooo delicious! Also would like to thank everyone at this place for their amazing and friendly service. My waiter, Benjamin was super sweet and awesome. Jacob was also very kind and sympathetic. I am overall very impressed by this place. The food, the layout, the drinks, and especially the service. I will definitely be back.", "pics": null}}, {"review": {"des": "nico osteria is a beautiful and very specious restaurant.  I truly enjoy the ambiance the server was very nice and the bus boys were superb. They change the bread since I don't like sour bread to the most delicious olive bread.  Let me tell you the high light of the menu which to me is very ingenious a bread stuffed with green olives it was so amazingly delicious. <br>I was not impressed  with the food  however since I know of authentic pasta.  Most of dishes had a hint of lemon which I don't think it goes well with creams.  That is my opinion.  The lobster spaghetti was a true disappointment since it was very thick spaghetti it was like bucatini.  By the time it got to the table it was already cold.  The lobster was just throne in the pasta decorating the plate no taste to it what so ever.  If the lobster had been sautéed in garlic perhaps in olive oil the dish had been better.  I don't know why I go to places that serve pastas that I know I can cook it better and I am not a chef ‍plus it needed salt so I asked to have some<br>Parmesan cheese.  <br>I really loved the bruschetta with Brussels sprout it was amazing. <br>the food was 1 .  The pastries were too sweet.  The complimentary chocolate<br>Was very delicious with the wine grapes.  Thank you big spender I had a wonderful time.  Nice restaurant overall.", "pics": null}}, {"review": {"des": "Overall: a great option in downtown Chicago for a night out. On the pricier side, but worth it for high quality food, attentive service, and a cozy atmosphere. <br><br>Food: high quality ingredients, many that are locally sourced. The dishes are creative and tasty. The complimentary bread is worth the calories.<br><br>We shared the market salad, the ricotta cheese, the octopus carpaccio and the cauliflower ravioli. All the dishes were beautifully plated, and quite delicious! My favorite item was the octopus carpaccio--tender and perfectly seasoned. If you like octopus, definitely give it a try!<br><br>Drinks: having had some happy hour wine prior to going out to eat, we only had a glass of wine each. We both went w the Sauvignon blanc blend, which was very good. They have an extensive, Italian wine list that would probably be fun to explore with more time. <br><br>Ambiance: definitely intimate and cozy. Dimly lit, Nico Osteria could be a great date spot. <br><br>Service: attentive, knowledgeable, and polite. Really not much more you could ask for. There was quite a delay in paying for the bill (jokes about dining and dashing may have been uttered), but our waiter apologized and comped our wine without any prompting on our part. <br><br>Price/Value: a bit on the pricier side, but not unreasonably so given the quality of the ingredients and the actual food itself. Portions aren't huge, but they are quite ok for sharing several among 2 people. Neither of us was left wanting after sharing 4 items. Wine is priced as expected--between $12-18/glass.", "pics": null}}, {"review": {"des": "An Italian restaurant inside the Thompson hotel <br>If the weather is nice , request the patio seating. <br><br>I enjoyed the bar a lot more than the restaurant. The noise level was just the right mix between a casual gathering and a party. <br>Their gin drinks are good and so are the mojitos <br>Of course it's very pricey <br>I got the lemon tart and was a bit disappointed <br><br>The Brussels sprouts bruschetta was really good and the grilled octopus too", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/bD0NOZYIqoNs0KLHnHlmSQ/348s.jpg", "caption": "Cool"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/52AJ8CTFr5KwArGMIh3neA/168s.jpg", "caption": "Bar seating"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/h4IGBw2ceiRg0y1GVxcaMg/168s.jpg", "caption": "Lobby"}]}}, {"review": {"des": "Eating Italian on a gluten-free diet can be a pain, so Nico Osteria has been on my must-go list forever! I came here on a Sunday night with my boyfriend ready for pasta (!!) only to have our server inform us that their pasta maker was broken. For someone with a dietary restriction, this was a little challenging (especially at an Italian restaurant!) Luckily, we had a wonderful server who was accommodating and pointed me towards two vegetable dishes.   <br><br>The dishes were ultimately very flavorful, but fairly overpriced for what they were. Beyond that, the start of the service left a lot to be desired. The hostess was cold and sandwiched us between two noisy tables when many other two-tops were available. Ultimately, our meal felt claustrophobic and turbulent. Maybe my expectations were too high coming in, but for a restaurant with this price range, I had hoped for a better experience.", "pics": null}}, {"review": {"des": "Amazing. On every level. I've dined here a handful of times and there isn't one bite I've ever had that wasn't outstanding. You can't go wrong. Crudo is so fresh, octopus carpaccio is to die for, fish is like butter. My mouth is watering just thinking about the last meal I had here. Service is always on point and I just can't say enough good things about this place. My only gripe is that I can't afford to eat here weekly.", "pics": null}}, {"review": {"des": "Father's Day Brunch was great here with hubby and daughter!  It was my 3rd time to Nico Osteria over a 5 year period. A easy favorite for the food and ambience.", "pics": null}}, {"review": {"des": "I need to come back and try their DINNER menu. <br><br>Anyways, came here for lunch on a Saturday and overall I would have to say: <br>+ GREAT MUSIC <br>+ GREAT AMBIANCE<br>+ FAST SERVICE <br><br>However, i felt like our server and the bussers were constantly trying to take away our plates and/or rush us out. We were literally there for 45 min. Max. And not to mention.... <br>1) the restaurant was practically empty minus two other tables <br>2) or maybe they were overstaffed... <br>regardless it made the food less enjoyable because every 3 min someone would ask us if we needed our plate cleared.... I wanted to ask \"excuse me sir, do you see that our plate still has food??\"<br><br>Now to the food (what y'all really care about) <br>- QUINOA SALAD WITH FRIED EGG AND BEEF: <br>(3.5/5) sure it was flavorful and filling but it was so oily. I had less than half of the bowl and my friend ate the rest. <br><br>- CARBONARA: (5/5) the noodles are so thick and perfectly cooked! Must get!", "pics": null}}, {"review": {"des": "The food here is great. We had the lobster spaghetti. It's a bit pricy, but worth it. We also had Chocolate Torta for dessert, which is also really good, very rich layers of flavor and texture.<br><br>But what's really upsetting is the service. First when we walked in, the server told us we could be seated immediately, and they are getting the table ready for us. Then some other server came back, and she said she will get our phone number and text us when our table is ready. So we waited in the lounge area for about 20 minutes, and it's too long for setting up seats. So we went back to the front desk, and the server said we have no reservations, and basically they have to accommodate the reservations first. But why would you tell us that we can be seated immediately in the first place? We are totally ok with waiting, but not ok with you telling us that we can be seated immediately and then tell us we will not be seated. Then the server said we could sit at the shared long table, which we are totally cool with, but she didn't even say the shared table was an option when we first came in. <br><br>After we are seated, it took +10 minutes for our waitress to show up. At this point, with the long meaningless waiting in the first place, me and my friends were both really upset. Even though the food is good, I will still think twice before coming back, or at least get a reservation.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Kwi99mSeVYlgxmfuPb7PiA/168s.jpg", "caption": "Lobster Spaghetti"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/55LBZdxS2_Rsb-mCmdEwQQ/168s.jpg", "caption": "Chocolate Torta"}]}}, {"review": {"des": "The service from the hosts and wait staff was great.  The food was amazing. We had salad and branzino fish.  All was going great until I ended up with a piece of bone from the fish that I couldn't get out of my mouth and it ended up lodging itself in a spot that I couldn't extract.   Told my waiter and he went to ask his manager.  Minutes later, which felt like eternity, he came back with bread and hot tea.  Neither helped.  They didn't charge for the <br>branzino, which was nice of them to do so, but I am still is discomfort.   The only reason they are getting the two stars, is the lack of management staff checking with me if I was ok, or get my contact info to follow up, or even fill out an incident report.   Way to go management.  Otherwise they would have gotten 4 stars.   <br>Also if you are gluten free, not too many options.", "pics": null}}, {"review": {"des": "New chef but the food is as good as ever, with some new twists. We like to sit by the bar counter which overlooks the kitchen. My wife saw them slicing thin prosciutto and cheese which wasn't on the main menu , but lounge menu, and they made one for her too. <br>I never had a fish collar and our server, Lindsey, highly recommended it. The fish was a snapper. The fish meat was tender and nicely seasoned, and needs to be picked off of the neck bones. An interesting dish. <br>The octopus carpaccio is thinly sliced and cooked in their big gas oven. I liked it a lot. <br>We love their pastas and a favorite is the stuffed pappardelle. The wide noodles are stuffed with braised pork. We also had the cauliflower ravioli. I'm not a fan of cauliflower, but this was very good. <br>Keep the great bread throughout the meal because it's great to soak op the food sauces. <br><br>Dessert was pumpkin tres leches which was light and full of flavor.", "pics": null}}, {"review": {"des": "Really enjoyed the food hear but felt like the service was a little light. However we did get a pretty last minute reservation and that was nice! I split the Bolognese and cauliflower pasta and both were delicious! The menu was on the pricier side given the portions however I left full and satisfied!", "pics": null}}, {"review": {"des": "I came here for restaurant week and was blown away. Four courses for $33? Who can say that's not an amazing deal?<br>To start, I had the grilled gem lettuce salad. It came with romaine hearts, avocado, mandarin oranges, and roasted root vegetables. Fresh Parmesan cheese and creamy dressing topped it off deliciously.<br>Second course, I had the rigatoni bolognese. The pasta was fresh and cooked to a chewy al dente. This was my favorite dish of the night!<br>Third course, I had the flat iron steak. It was grilled to a perfect medium rare, very tender. <br>Ended the meal with tiramisu dessert. The tiramisu concept was creative-- it was like a baked pastry, rather than the typical layered cake. It was a bit heavy and a little dry for me, but good flavors and unique presentation.<br>Overall, an excellent meal!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/HOVtQLNnP3ucEbjRMGlx8g/348s.jpg", "caption": "Gelato"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/8PM_gGj1rq_R1TinhTkn4Q/168s.jpg", "caption": "Tiramisu"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/opwkCemIbRENEOM8wKK0ww/168s.jpg", "caption": "Whitefish"}]}}, {"review": {"des": "Back two years later -- and every bit as good from service to the food itself. The stuffed paparadelle Was even better this time around. This dish is reason alone to detour here if you're anywhere in the vicinity. The crude platter was divine and unusual, a great way to say welcome back, you are in good hands", "pics": null}}, {"review": {"des": "I came here with my girlfriend on a Sunday around noon with a reservation.  When we got there, the place was about 80% empty which made it so surprising that we were seated at a very small 2 person table, directly against a wall, and crammed in between two other parties who were there.  I immediately said we wanted to change seats, and somehow they managed to put us in basically the exact same table across the room!  It made no sense - I asked if we could get a booth and was told those were reserved.  Nobody sat at those booths until we were leaving which was very frustrating because I was forced to eat with my elbow smacking the wall and 0 view of the outside. <br><br>On top of this, we waited about 15 minutes before anyone even came over to ask if we wanted water.  Then another 10 minutes passed before an actual server came over - we just about got up and left until he came right before we were about to.  <br><br>We ordered a few items off the menu (crab benedict, avocado toast, and a burger, couple of smoothies) which were all mediocre at best - I actually only ate half the crab since I didn't think it was good at all.<br><br>After all that our bill still came out to over $115 for what was a terrible overall experience.  I was extremely disappointed with the service not even considering what ended up being a hefty price.  I've been to Nico before and thought it was better then (about 2 years ago), but after this visit I will absolutely not be going back and wouldn't recommend it to anyone - especially with so many good places within shouting distance.", "pics": null}}, {"review": {"des": "Nico Osteria is a seafood restaurant located on the first floor of Thompson Hotel, consistent with the hotel theme, it is also modern and trendy. <br><br>I went on a Saturday night during dinner hour and the wait was about an hour for a table of two, but it was pleasant because there was a bar serving drinks with many seating. Their cocktails are truly amazing.<br><br>For appetizer, we had the \"Grilled Octopus\" and some oysters. The portion was on the small side but the octopus was delicious. It was perfectly charred and the blood orange sauce really made the seafood flavor stand out. <br><br>As for entree, we ordered their famous \"Lobster Spaghetti\" and \"Rigatoni\". Portion are both generous and flavors are well executed. The lobster spaghetti reminds me a little of a Chinese stir fry dish with a Western twist. An entire lobster was used in the dish and presentation-wise it was great. <br><br>Tips: <br>+ If you have a small party, put your name on the bar area, the wait is much shorter.<br>+ try their cocktails and the House Amaro, they are so good!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/rMskz21auASXS-1Zg9nawg/348s.jpg", "caption": "lobster spaghetti (finished)"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/9urhRpiJhP97kMNcI43bmw/168s.jpg", "caption": "oysters"}]}}, {"review": {"des": "We had good service but a bit slow.  The food was just mediocre.  I was expecting so much more.  The wine was good though.", "pics": null}}, {"review": {"des": "Let me start with the fact that the food here was fantastic. The Hokkaido scallop crudo was fantastic, and the burrata (and even accompanying salad) was absolutely delicious. <br>We tried the lobster spaghetti along with the pan seared gnocchi and were very satisfied (aside from a small lobster shell piece - it happens..)<br>But unfortunately the service was a tad lacking for this caliber of restaurant. Forgotten requests, long periods between the server coming over, etc. But it was clear that they were understaffed that night so I won't ding the rating.", "pics": null}}, {"review": {"des": "Awesome Italian in Gold Coast. This place is pretty swanky and expensive. I would save it for a special occasion. Good for a fancy date or a special night with friends. Great service!", "pics": null}}, {"review": {"des": "We convinced 4 friends to join us for dinner here and sadly I am embarrassed that we choose this restaurant.  <br><br>The server treated us as if we were a nuisance.  Any question that was asked was met with \"it's on the menu\" - so in other words, we should leave him alone and just find our answers on the menu.  He was insolent and rude to my husband and difficult to understand but couldn't be bothered to speak up so the table could hear him.<br><br>The food was sup-par at best.  Boring pasta.  Inedible salad.  Bland appetizers.  Not one of us liked our food.  <br><br>I don't know what happened to this restaurant as it used to be better but it is no longer in our rotation.", "pics": null}}, {"review": {"des": "Ive heard alot about Nico Osteria and was very excited to check it out. We decided to stay at the Thompson and wanted to make a point of dining at Nico while we were there. We went in on a Sunday evening after making reservations through OpenTable. Upon our arrival at the hostess stand we were guided to this really tiny two seater that was kind of wedged between two larger tables. We asked about two tables nearby that were unoccupied but were told that they were reserved. <br>The food was ok. My bf ordered two separate seafood items and each time the server came back and apologetically advised that they were out of his selection. I hate to say it but it got more disappointing by the minute. We started with the grilled octopus. It was very flavorful. I had a fish dish, it was fine but nothing fantastic. He ultimately had some type of ravioli. <br>There was a nice treat at the end of the meal. We were brought a plate of little mini desserts. They were yummy. <br>Dessert aside, I wouldn't go back on purpose. Those tables were never occupied and ultimately we realized there were several unoccupied better options. I can't deal with unaccommodating establishments and the fact that we couldn't order what we really wanted due to poor planning from the chef or whomever.. it was just not up to par and there are too many options in Chicago.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/mOGPrvjzhdnGBsIUemwbSg/348s.jpg", "caption": "Ravioli"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Sl-VrdFYiZ7ZtHclwWJ_cQ/168s.jpg", "caption": "Branzino"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/14EC-iHPUdtJb0fbSdtPMg/168s.jpg", "caption": "Octopus appetizer"}]}}, {"review": {"des": "We had an amazing dinner at Nico last night and were completely wowed start to finish. My partner and I split the Brussels sprout bruschetta and the meatballs which were both spectacular--as others have stated, the bruschetta is truly the stuff of dreams. For dinner, we had the gnocchi and the rigatoni and both were perfectly done. We also tried the shishito peppers and loved them too. We rounded it all out with a bottle of wine and 3 scoops of sorbet and were so stuffed we barely moved the rest of the night. Worth it! <br>I know this sounds like a pretty one-note review but we were truly thrilled with every aspect of our dinner. Thank you to Nico and our awesome server Lindsey, who was the perfect combination of friendly, attentive and chill. We will be back soon!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/RSeJwpHVLsUVWVKETHKM-Q/348s.jpg", "caption": "Meatballs"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/4jfWsuAJbtcDyHknRnXtcA/168s.jpg", "caption": "Brussels Sprout Bruschetta"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Hjo_VVmWatPR6cZjCtbNJg/168s.jpg", "caption": "Rigatoni"}]}}, {"review": {"des": "Really good pasta. We got rigatoni and stuffed pappardelle. Nice outdoor seating. Didn't have to wait for a table on a week day.", "pics": null}}, {"review": {"des": "The service was solid and the food had great flavors for the most part, but for the price, the proximity of other tables, and the small portions, I had to dock some stars. <br><br>- We got there early and started with a drink in the adjacent bar which I would definitely recommend checking out. Very cool place. <br>- Appetizers: We got the complimentary bread, but our fatal mistake was ordering the chef's selection of crudo. This was a colossal waste of money for a few tiny pieces of largely flavorless fish. The piece of tuna was the only appetizing selection, and at $15pp I would not order it.  <br>- For main entrees we ordered the sweet corn agnolotti and the stuffed pappardelle. Both had great flavors but at $21 and $23 respectively, a much healthier portion would have been appreciated. Since we were sharing the two plates between ourselves, we really only got a few bites of each pasta. <br>- As others have mentioned, unless you are sitting against a window, you will be sharing your dinner experience with your neighbor. In my case, a rather large gentleman sat next to me and I had to get up to allow him to get seated at his table. They should really space the tables out some more, but I doubt the management will want to cut back on the number of seatings. <br>-Wine: We ordered a bottle of the Castellargo red blend and it was a nice pairing with the meal.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/5WunnBK7aqbJEyHDYjbbYg/348s.jpg", "caption": "Enjoying a beer at the adjacent bar"}]}}, {"review": {"des": "I bring a lot of out of town guests to Nico because it's a lovely restaurant with great cocktails and wines and all the dishes from start to delicious dessert are creative and tasty. I've had the chance to dine in all the nooks, my personal favorite is the bar below the beautiful living wall or overseeing the busy chefs prepping crudo at the chefs' bar seating (for two) and the dining room tables for bigger groups.<br><br>My favorite dishes are the brussel sprout bruschetta, the orecchiette, the side veggies are great, and the rustic tiramisu as well as the other gorgeous desserts!<br><br>Correct me if I'm wrong, but I think the pasta is hand made in-house (except one they source from Italy), which makes it so much better!", "pics": null}}, {"review": {"des": "Nico Osteria wow !! <br>The food was out of this world ! I don't say that very often .. The oysters with the caviar refresh and delicious.<br>The octopus omg  melted in your mouth pure perfection.<br>The prosciutto and mozzarella cheese ball with the toasted bread was literally out of this world . I've never had a Prosciutto so delicious. The tiramisu was phenomenal no joke.<br><br>The Service however , that's why I took off one star was horrible. I requested a booth that was ignored. The server was slightly rude and snobby. That came out of the tip no joke. If I'm going to dish out $$$ I expect good service.<br>The food made  up for the  service <br>If it was not for the food I would never go back.", "pics": null}}, {"review": {"des": "Excellent. Very reasonable especially for Rush Street area<br>and wonderful meal. Wine quite reasonable and great<br>service. We are from out of town but come to Chicago fairly often. Will definitely be back.", "pics": null}}, {"review": {"des": "Another win for Paul Kahan.  The food here is just fabulous.  Kind of expensive, but fabulous.   We've been here twice already in the past month, which is not very good for our wallet.  Despite the price the restaurant actually has a fairly casual, trendy feel to it.  <br><br>The appetizers are the best part - you also have the option to sit at the kitchen counter and watch them make the apps.  The baccala bruschetta, the octopus and the meatballs are the best ones that we have tried.  As for the main courses, the pork stuffed pappardelle is definitely worth trying, and the arctic char is pretty amazing too.<br><br>There is parking in the area but often difficult to find - but if you can find it, it'll be cheaper than the valet.  Be forewarned, the police in the area give tickets very willy-nilly without bothering to check the online parking system first to see if you have actually paid.  Ugh.... so frustrating.", "pics": null}}, {"review": {"des": "Service: 5<br>Food: 4<br>Wine: 4<br><br>They didn't have the bottle of wine I wanted, but was able to order a different Rosé, hence I give it a 4. Dinner started with 3 different kinds of bread. Server stated menu changes every season. I ordered a variety of food with a girlfriend of mine. <br>Food is a 4 because some dishes were too salty.<br>Oysters from daily were VERY good. I wanted more than 2!<br>Bar Harbor Mussels- it is very garlicky. The mussels itself didn't have enough sauce so you need to dip it in sauce separately after digging out the mussels. It comes with 1 big slice of bread cut in half; I didn't have any  <br>Brussels Sprout Bruschetta- my 2nd favorite dinner. The stracciatella cheese, lemon honey, hazelnut is best combo. <br>Fritto Misto di Pesce- SKIP IT. It is not good. I ate less than half. <br>Sweet Corn Agnolotti al Plin- once again, dish is salty, but eating it with roasted beets was a good combo. <br>Roasted Beets- tastes very refreshing <br><br>Good environment. Server is very friendly and attentive. <br>Going to bathroom? Make sure you ask or you can get lost. It's downstairs. <br>You have the option of seating at chef's table or regular table.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/LGhnE1XVVy5DrmgPiyKkQQ/348s.jpg", "caption": "Sweet Corn Agnolotti al Plin"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/BurXjQglbgmYgs3BiBkn_w/168s.jpg", "caption": "Brussels Sprout Bruschetta"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/HMb6uxk0e0galFw8BCQMcA/168s.jpg", "caption": "Grotto Misto di Pesce"}]}}, {"review": {"des": "My wife and I went there for brunch on Sunday and sat by the bar. We ordered some beers and checked the menu in the meantime. The restaurant and the bar are apart from each other and they are set within beautiful Thompson hotel. The bartenders were very nice and knowledgeable and we had a very good time chatting with them. We ordered brussels bruchetta for which Nico Osteria is apparently known and I must admit it was amazing! The course were Nico hamburger and Bolognese Rigatoni and both were delicious and flavorful . I like when burgers are simple and made from good quality beef and that`s what you can find in Nico. My wife`s pasta was al dente with great sauce and poached egg which could be a little bit more runny but poached eggs are tricky :) We finished with some drinks, very good quality and very tasty. I recommend Nico`s gin drink with thyme on the top. They also carry Old Rip Van Winkle bourbon which is not very common to find at the bars (goes for $25 for 2oz of 10 years old which is worth a try). We still want to try their dinner menu in the future so we will be visiting again for sure.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/qDmK_EdN8_04GpmQBn_Ewg/348s.jpg", "caption": "Drinks"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/l1Ci3QZMnXzcObKCiTpQaQ/168s.jpg", "caption": "Burger"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/271gE2-zEorkfzomq9Itvg/168s.jpg", "caption": "Rigatoni"}]}}, {"review": {"des": "This is a restaurant week review.  This is my second year coming here for restaurant week, 4 courses for $44 is a really good deal here, the dishes are all from the main menu and would add up to quite a bit more.<br><br>This is a fancy place but the inside feels pretty relaxed.  There was a huge variety of diners (maybe because of restaurant week),  some very dressed up people on dates (stilettos, leather, etc) , elderly couples, groups of friends. Good people watching.   We had a table in the corner which I appreciated, the center area is almost like a big communal table based on how close the tables are (right next to each other) and I was happy I wasn't sitting there.  They tried to sell us on the \"chef table\" which is basically just bar style seating.  <br><br>If you are looking for just a drink the bar areas is very cool near the entrance.<br><br>Waiter was excellent.<br><br>Food:<br>1st course:  meatballs- very tender in a rich tomato sauce<br>2nd course: Cacio e Pepe- so flavorful, spicy from black pepper.  highly recommend. My husband had the orchiette with tuna and I had a bite- it was super bland, I would not recommend this.<br>3rd course: crispy chicken with cannellini bean, charred escarole - this was amazing, I don't normally order chicken at restaurants because that is boring but I loved it.  My husband ordered the swordfish and thought it was bland.<br>Dessert - coconut rotolo- a coconut cake with pineapple and ice cream.  Delicious.  <br><br>This was a lot of food, especially with the bread starter.  They waiter was recommending we get another appetizer and the fish crudo to start but I'm glad we did not.  I already had to do a slow walk home and I'm a big eater.  <br><br>Overall highly recommend for restaurant week!  But maybe skip the swordfish and orchiette with tuna.", "pics": null}}, {"review": {"des": "Out of town friend: Is this the hip new trendy place?<br>Me: Err, well...it was 3 years ago!<br><br>Yes, after multiple attempts to have dinner here, I finally made it, and it was wellllll worth the wait. This was one of the best start-to-finish dining experiences I've had in a long time. We had a reservation for a party of 4 on a warm Saturday night in early June and asked to sit outside when we arrived. Since the outside patio was first come first serve, the wait was 30 minutes and we opted to stick with our reservation inside. We were shown to a booth next to a completely open door so it felt like we were still on the patio! Best of both worlds :)<br><br>Our waitress was so fun and made the experience even more amazing. We went with a couple bottles of Nero d'Avola (a fruity red perfect for the warm evening), the crudo sampler (so fresh), brussels sprouts bruschetta (loved the flavors), stuffed pappardelle (tender meat but oddly tasted like beef stew), dry-aged ribeye, and the whole fish salt-crusted branzino (thank you kitchen for deboning it first). When the food came our waitress had thrown in the ravioli doppio which was ended up being a table favorite. The branzino was one of the best things I've ever eaten! This amazing meal plus the delicious bread bowl left no room for dessert. I can't wait to go back for dinner again here!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/yclCeTrNGgYP-qFnDVnEUg/348s.jpg", "caption": "The view from our open-air booth!"}]}}, {"review": {"des": "The flavors of the brussel sprouts bruschetta lingered in the back of my throat for hours-through dessert and cocktails and late-night tea. The octopus carpaccio was delicate in both flavor and texture- it comes charred on the grill and doused in a light, warm vinaigrette. The Monte Bianco was fantastic- hazelnut mousse surrounding whiskey and orange and a dark chocolate crunch, with cardamom gelato. And the espresso came with a supersoft, super-chocolatey cookie that IMHO tastes best dunked in the bitter espresso.", "pics": null}}, {"review": {"des": "This restaurant is as good as is gets. I don't know what is better... the service or the food. They have some of the most remarkable and attentive staff I have ever come across. Not only in terms of attentiveness, but going so far as to go the extra mile and think about things you need before you even ask for them. <br><br>All of the food is honestly incredible, but the one that gets us coming back for more is the brussel sprout toast. I don't think there is anything that I have ever eaten that I like more than this! The brussels are somehow cooked to perfection and shaved. They are on top of the most perfect cheese and then sit on a bread that is perfectly seasoned and oiled. Unreal!!", "pics": null}}, {"review": {"des": "I enjoy every meal at Nico Osteria!  But Saturday was very special in that not only did we have an incredible dining experience but we have the BEST waiter, Trevor!  Trevor, thanks for the amazing service and having so much fun with us!", "pics": null}}, {"review": {"des": "Went there for a late brunch with a girl friend and my 1 year old son. They were awesome and extremely accommodating. The food was delicious too. We ordered a bowl of fruit for the table, a pastry, sausage and potatoes. Everything was very flavorful and portions were huge! I will definitely be bringing my husband here soon to introduce him to this Gold Coast gem.", "pics": null}}, {"review": {"des": "First of all this is not your traditional large portion meal Italian restaurant. If traditional is what you prefer, then keep walking south on Rush to Rose Bud restaurant. What you will find here at Nico is small plates of very good food. Kind of like Italian tapas. The smaller plates works out great from a socializing perspective. As for the food, we started with the cheese and salumi. Included were large chunks of mortadella which reminded me of a good pate, very good salami, prociutto, and fresh mozzarella. We also ordered the olives marinated in orange and rosemary. This dish took over 45 minutes to arrive?? How long does it take to plate some marinated olives? In retrospect, they sure would have gone good with the cheese/salumi plate. Besides being late the olives didn't taste marinated. I could not taste any orange or rosemary in the garlicky marinade. The upside is they used good quality green olives, which were good all by themselves. I was washing everything down with a very good white Pecorino wine from Abruzzo that was deliciously light and crisp and the perfect amount of acidity to complement our rich dishes. We then moved on to a plate of rigatoni and tagliolini pasta dishes. The rigatoni was good, but felt that it only teased with the light crumbles of delicious Italian sausage. As for the tagliolini, it came with a leek heavy sauce that was absolutely delicious. We also ordered the side hanger steak that was a great bargain at $10. It arrived at the table a perfect medium rare and delicious.<br> <br>Our nice server Erik looked embarrassed about the slow service from the kitchen and was apologetic. I understand that Erik works in the front room and cannot control kitchen speed or mishaps. I was a little frustrated with the slow kitchen service, considering the restaurant wasn't even half full. But realize that he provided our table with good service considering whatever the circumstances were in the kitchen.", "pics": null}}, {"review": {"des": "I recently had brunch at Nico Osteria, and it was a very enjoyable experience. The Brussels Sprouts Bruschetta was the highlight, combining toasted sprouts with soft creamy cheese on think crusty bread.<br><br>There pasta carbonara was also delicious. The pasta was cooked perfectly al dente, and the oil, cheese, and spices created a rich flavor.<br><br>I'm definitely coming back to try more of their menu.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/J40_sCQfLII5RspcVFkXng/348s.jpg", "caption": "Brussels Sprouts Bruschetta"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Ll5lcrawXrYjysggcLiNdA/168s.jpg", "caption": "Dungeness Crab Scramble"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/tIsLII5aqFUwnQEi9UbyPQ/168s.jpg", "caption": "Pasta Carbonara"}]}}, {"review": {"des": "Yum Yum! I love the food and the service and the drinks and the ambiance! Perfect lunch spot...dinner too!", "pics": null}}, {"review": {"des": "The bread tells you all you need to know about this place! What do I mean by that? <br>They want your dining experience to be wonderful from start to finish so even the bread is amazingly prepared and full of flavor. Soft, pillowy, and half of the bread bowl is an olive loaf- so good. <br>The rest of the food is also amazing. The pastas are freshly made, innovative, and full of flavor. <br>In the theme of every part of the dinner being amazing they close with a little gummy candy with the check which is amazing as well. <br>You will enjoy the entire experience at nico.", "pics": null}}, {"review": {"des": "Beautiful atmosphere and watching chefs create dishes is an art form, but on the downside the menu is seasonal and thus limited.  It's also terribly overpriced unless you're trying to impress someone. Nothing comes with entres either. Best to go for a drink and appetizer.", "pics": null}}, {"review": {"des": "I came here for restaurant week and I was quite blown away by the quality and quantity of the food. The interior was well decorated and the staff were friendly. <br><br>Bread: three flavors- plain, cheese and some type of herb? There was a lot of bread but not the most amazing bread...<br>Appetizer: seafood soup - absolutely amazing. the flavor was mild and subtle yet well balanced. The ingredients tasted fresh.<br>Pasta: truffle pasta- this is honestly the biggest reason I'm taking a star away from this place. I could barely taste the truffle and the pasta itself was a little hard and rather tasteless (aside from the faint scent of truffle, black pepper, and salt)<br>Main course: Veal- I took it home and microwaved it the next day and it was still crispy and tender.<br>Dessert: coconut rotolo- pineapple roll cake with cream. It was extremely refreshing<br>Tiramisu- probably the best tiramisu I had in the united states. It was chocolate-y and nutty with crispy flakes and chocolate ganache on the side. <br>Chocolate- we were each given a piece of chocolate after paying, and while the chocolate itself was a little too sweet, they were aesthetically pleasing with gold foil and vibrant splashes of colors.<br><br>We also got coffee to go with the dessert and the coffee itself came with a chocolate cookie that was crunchy on the outside and soft and gooey on the inside. I wish the chocolate cookie itself was on the menu.", "pics": null}}, {"review": {"des": "Wonderful food and service. Sat at the chef bar where I got to watch the kitchen as they prepared food and it was an excellent experience. Had the meatballs, spaghetti, swordfish, and coconut Rotolo off the restaurant week menu and everything was delicious and cooked to perfection.", "pics": null}}, {"review": {"des": "I came here for Restaurant Week with two girlfriends because Nico Osteria was touted as having a great menu. <br><br>The place is cute and dimly lit, but the attitude of the hostess crew was the opposite of welcoming. There were open tables everywhere, yet the hostess wouldn't seat people because they were \"4 minutes early.\" Someone from our party was late due to a snow storm so we were forced to stand at the front for 45 minutes. <br><br>Our server was great, despite getting one of our orders wrong. She was very friendly and attentive. <br><br>We ordered the Brussels sprouts bruschetta as an app, which was fantastic. The meatballs and the orrechiete were a personal favorite. I don't recommend the pork shoulder with apples... we couldn't even finish it because it was cooked so poorly. <br><br>You'll be treated right here if you have a lot of money, but if you're just an everyday patron, I recommend you eat dinner elsewhere.", "pics": null}}, {"review": {"des": "Nico Osteria is SUCH a gem. My sister took me for the first time & I let her because she had been raving about it for months. Incredible Italian food. First we got bread with olives in it that was so fresh and fantastic. Then we got the brussels sprout bruschetta which was absolutely DIVINE I could have eaten it all myself but had to share with my sister. For my entree I got the rigatoni bolognese which was insane. I asked the waitress what she recommended getting & she said it was this, and after trying it, I could see why. The sauce was so savory & even though the entree looked small, it felt just right & turned out to be very filling. The dessert was outstanding as well. I think I just found my new favorite Italian Restaurant. I'm not going to lie, it is a bit pricey, but honestly if you want a really nice night out, this is 100% the place to go. Great atmosphere, even greater food.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/HHMwCqTSmDVAnDKRbglLhw/348s.jpg", "caption": "rigatoni bolognese"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/hVSR_Znm6He0jq98vcJQrQ/168s.jpg", "caption": "honey and cardamom gelato"}]}}, {"review": {"des": "I would have rated this restaurant maybe an additional star. The food is decent, but not on par with the price point. I ordered an expensive wagyu steak which was over done, and I questioned the quality. The manager was nice enough to take that off of the bill after my questioning. The crispy Brussels sprouts appetizer, on the other hand, was absolutely delicious. Our waitress seemed to have an attitude with us which dampened the dining experience.", "pics": null}}, {"review": {"des": "This restaurant is the best meal we had during our 3 day stay in Chicago.  Every dish we ordered was tasty and cooked to perfection.  The service was top notch and the ambience was wonderful.  The Brussels sprouts bruschetta appetizer was probably the best appetizer I have ever tasted!  The spaghetti Bolognese hit the spot on a rainy, cool Chicago night.  It was rich and filling and flavorful.  The stuffed branzino completed our delicious dinner and it, too, was delicious.  The portions are very generous and the prices are reasonable for a city like Chicago!  I will return there every time I go back to the city.  They deserve 5 stars plus!", "pics": null}}, {"review": {"des": "Love the green wall bar, bourbon selection and hand made pasta and other Italian specialties. Was not a fan of the octopus as it's breading was a bit limp and lost the snap of the tentacles when fresh or even just simply grilled. The pasta (shrimp totelloni with asparagus and peas) and fish collars were the standouts of the menu.", "pics": null}}, {"review": {"des": "This place is trendy, modern and renders good vibes. Nico Osteria named after the German songwriter, you'd expect it to play throwback music, right? Well they do. :)<br><br>Today's lunch: Lobster salad burger. Given that I prefer my food and drinks hot always, I requested for the lobster salad to be heated. As was forewarned that heat changes the taste flavors of the burger, I went ahead to have it toasted anyway. It wasn't much of an addition to the burger, but definitely added more grease and juices. Which is good for a girl who loves an indulgence. The side salad was bomb! Never had such crunch and fresh salad at a restaurant until today.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/dLiHeaWGr-o3r_gGZZNeRA/348s.jpg", "caption": "Starters bread."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/B7PjntFBN1MxdM962iOZoQ/168s.jpg", "caption": "The lobster salad burger"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/AimOFAHtA_X0f9AMRYD0uQ/168s.jpg", "caption": "The lobster salad burger."}]}}, {"review": {"des": "I've only been for brunch - I could eat the Brussel sprout bruschetta every day. SO. GOOD. Definitely worth going just to try that. Drinks are really good. I wasn't wowed by anything else I've tried on the menu but I will continue going back for the brussel sprout bruschetta for sure.", "pics": null}}, {"review": {"des": "We came here for a girls night dinner.  The restaurant has booths but even for us (petite asian women) the booths just seemed a bit too small.  Thankfully when we asked to be reseated the hostess was gracious and gave us a table with chairs instead.<br><br>I ordered the lobster pasta.  It looked great but it wasn't crazy delicious. I expected more flavor for the cost of the meal at $39.<br><br>For dessert I got the banana caramel and hazelnut gelato.  It was good but half of it was melted by the time it arrived to the table.<br><br>Service was good and attentive.  The restaurant also offered a free assortment of bread and oil before our meal which was a nice surprise.", "pics": null}}]}