{"name": "ninis-deli-chicago", "reviews": [{"review": {"des": "Nini's is THE place to go for every occasion. Juany really makes you feel like family whether it's your first time or your first time in a while. He'll remember your name, your order, and even the 'fit you had on the last time you were there! I've had everything at least once and, to be honest, it's all fire. Chef Huey really throws down in the kitchen. My personal favorite is the Kitchen Sink. It's legit the best of all worlds, but I can only get it when I'm HUNGRY because it's massive.<br><br>Make sure to follow Nini's, Juany, and Huey on their social medias because you GOTTA keep up with all the specials they have throughout the year.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Kh3T7wKs8m-x2yUARWjffw/348s.jpg", "caption": "Even when it's to go, Juany makes it personal!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/bNNLcd0wj9GD23qoKmS79Q/168s.jpg", "caption": "That party size Cafe Con Leche keeps you going ALL day!"}]}}, {"review": {"des": "The goat cheese ang guava was out of this world. I got the the ropa vieja sandwich which was lacking some flavour to me. This is just a personal preference so many other people may love it, for me it was ok. I ordered ahead of time and was able to skip the line, which is super helpful since parking is an issue. Worker was nice on the phone and in person. Great work guys, they are busy so they are doing something right!<br><br>Update: Juan the owner reached out to me and is so nice and has the customer in mind I couldn't leave a four star review in good conscience. Five stars all the way!!", "pics": null}}, {"review": {"des": "LOVE!<br><br>The food was absolutely amazing. I'm so happy that I decided to be a heifer and get an empanada in addition to my delicious sandwich. Service is soooo wonderful. The owner (Juan?) was full of energy, and had a great personality. I was having the worst day ever and had to escape for lunch, so glad I did! Even if the food was awful, the service would bring me back. Luckily, the food is fantastic! Can't wait to return.", "pics": null}}, {"review": {"des": "Stopped in for a quick empanada after a meeting nearby, and I was so impressed!  (I didn't realize at the time that this place has so many great reviews, but I'm certainly not surprised after visiting).  I had the guava and goat cheese empanada, and it was AMAZING!  I got it to go, so I didn't stick around for long, but the guy working behind the counter was so kind and outgoing.  I definitely want to come back here to try some of their other items!", "pics": null}}, {"review": {"des": "Ok first I wanna know what Juan takes for his positive larger than life attitude. There must be something...perhaps a secret Cuban herb?<br><br>I went here with some high expectations as I had heard some really positive reviews from a friend and through reading other yelp reviews. (589 reviews & 5 stars, I mean come on!) And should I say Nini's Deli ended up being absolutely Deli-cious.<br><br>Started off with the empanadas- <br>1. Beef: I don't think I've tasted such moist flavorful beef ever (and I dont even like beef that much). It was yum.<br>2. Chicken: very soft, I did prefer the beef for its stronger flavor over this one.<br>3. GOAT CHEESE AND GUAVA- its a game changer!!!! Perfectly balanced tangy and sweet filling in this crunchy fried pastry. Foodgasms for days.<br><br>Sandwiches- <br>We were recommended the Kitchen sink sandwich by Juan. He said it was kinda like a mix of all other 3 sandwiches. Once again the beef used here was amazing, so tasty! Portion was great, good for 2 people<br><br>Drinks- <br>1. Cafe con leche- reminded me of an Indian cold coffee. Sweet & creamy.<br>2. Hibiscus Lemonade- Perfect accompaniment to the fried empanadas. Sweet and tangy it helps to wash down the food. <br><br>Delicious food, prices are cheap, is halal (for those who have a preference), super fast service, free street parking and importantly a fun & jovial owner make this place stand out. Def 5 stars!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/HfK9X7fzR_s1n2cZpoa2FQ/348s.jpg", "caption": "Hibiscus lemonade and cafe con leche"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/uxImj1A9jEv5_8l7L_JBNA/168s.jpg", "caption": "Empanadas- chicken, beef, goat cheese guava"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Rom1jdAjys-e8pcUncK0Ow/168s.jpg", "caption": "Kitchen sink sandwich"}]}}, {"review": {"des": "It is amazing what incredible customer experience can do for a restaurant. Juan was incredibly hospitable and gave us awesome recommendations. This place is a true and beautiful example of an independent local business and is refreshing. <br><br>The food is fantastic and no visit is complete without a cafe-con-leche. The whipped cream is a beautiful touch. The empanadas are a medley of delicious flavors and extremely tasty. Arrive early as it is no surprise when they run out of food. <br><br>Truly a great place. Thank you Juan and family.", "pics": null}}, {"review": {"des": "I tried this place out for the first time this past summer and I loved everything about this Deli! I ended up getting here a little earlier than my friend but Juan was so friendly and kept me company until my friend arrived. He told me about his family's restaurant, his life, and neighborhood. I love being around people who make you feel so comfortable! Both my friend and I ended up getting Juan's recommendations off the menu and we loved everything we tried! <br><br>I hope to see you soon Juan!! I need a dose of your level of happiness and positivity haha", "pics": null}}, {"review": {"des": "I've been trying to go to this place for a good 6 months. I never seem to make it there when it was open. Heartbreaking, I know. But, don't cue the violin playing goat just yet cause today, I finally got to eat here! Trumpet sound everyone...<br><br>Let me just say that owner, Juan is very friendly, he made the experience amazing. His enthusiasm for what he does is infectious. I love the vibe he displays for his restaurant.<br><br>We ordered the Ropa Vieja, chicken empanada, cafe con leche, and hibiscus lemonade.<br><br>Now, I know the menu does say burrito, but for some reason I didn't see that. And I mistaken this for what I really wanted to try, which was the El Cubanito. When he served it to us, I was a bit confused and disappointed that it wasn't the cubanito. However, when we ate it, it was delicious. The beef was tender and flavorful. The rice, the beans and the egg helped highlight the beef. It was rich, but not too over the top. And that aioli...I want to bath in a tub full of that aioli. I mean, come on what crack did he put in that?!?<br><br>The empanada was great. I wish it had a little more seasoning, just a little. But, it's not too say it wasn't good because it was delicious. That crust is the best crust I've ever seen in an empanada (sorry, Savory Crust, they got you beat).<br><br>The only downside was that they were out of the churros for the weekend. Come on, Juan, what does a girl have to do to get a churro...you're out for the whole weekend? It's only Friday at 11 am. You're still cool though. I guess, I'll just have to come back again for the Cubanito, the churro, and the guava/goat cheese empanada. Till next time, my friend, I will definitely come back to this place!", "pics": null}}, {"review": {"des": "OMG! AMAZING! Chicken Empanada = good,  Beef Empanada = goooood, Ropa Vieja (burrito) = sooooo goooooood! Wash them down with a tasty Cafe Con Leche or a Hibiscus Lemonade and you're in paradise. Always a pleasant dining experience especially with the huge smiles and warm greetings from Juan. A must try!", "pics": null}}, {"review": {"des": "Ok, I'm from L.A., so as a visitor in your fine city, Chicago can throw the best of everything at you including Cuban sandwiches. <br><br>Such was the case at Nini's Deli in Noble Square. This very crowded, very popular sandwich place is making some serious food. Steeped heavily in its Cuban / Mexican roots we had three of their magnificent sandwiches.  They were great!<br><br>Nini's is as good as my local Burbank Cuban Sandwich shop, \"Portos\". This BYW, is a (huge) compliment. At this level of perfection all super delicious restaurants come into play and comparisons cannot be helped.<br><br>Our three Nini's sandwiches were:<br><br>The El Cubanito which was this delicious concoction of eggs, beans, avocado, plantains. Messy as hell but worth the extra napkins.<br><br>Media Noche - this beauty was chock full of cheese, Turkey, pickles, sweet guava jelly and mustard. This sandwich was complicated and delicious. <br><br>Ropa Vieja - shredded beef, rice and beans. A classic.<br><br>Was it worth the 30+ minutes to order and take your first bite? If your not in a hurry, yes. If you are in a hurry, kinda worth it.", "pics": null}}, {"review": {"des": "Awesome! <br>The owners son, Juan, is larger than life and makes your visit a true experience, even before you eat one of their amazing sandwiches or empenadas.<br>Highly recommended.", "pics": null}}, {"review": {"des": "Stopped in for lunch and met Juan who is the owners son. He explained the restaurant was inspired from his parents' Cuban and Mexican backgrounds. He was incredibly hospitable and explained the menu items to me. I ordered the Kitchen Sink which was a special for the day. The sandwich comprised of ropa vieja, ham, egg, cheese, jalapeños, and chipotle sauce.<br><br>First of all the portions are massive. The ropa vieja was a bit dry and overall the sandwich was missing flavor - it was a little bland. I also ordered a sweet empanada which is filled with goat cheese and guava. The empanada was fantastic! I washed everything down the hibiscus lemonade which was refreshing. <br><br>The indoor space offers several seating options - a few booths, high top table along the window, and some lower tables. I'm still interested in trying the el  Cubanito.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/02_bLZ8wBYiKFpWe3xknIQ/168s.jpg", "caption": "Menu (4/12/18)"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/uBirRXd03MhqWz6m5Wz7gA/168s.jpg", "caption": "Kitchen Sink"}]}}, {"review": {"des": "Phenomenal customer service from Juan. Great spacious seating inside/outside. The menu is simply unique with a Cuban/Mexican twist (definitely something new). I ordered the Classic Media Noche which wasn't on the initial menu for the week, but he made it work for me and that was worth every bit when it was received.. along with the sandwich I ordered an empanada (chicken) Y U M! It was very flavorful and juicy. My fiancé ordered the Kitchen Sink (which to me was a little intimidating).. Nonetheless,  she enjoyed it and didn't give up midway through for the size. Finally the Hibiscus lemonade/tea was perfect and I would recommend or the Café.<br>Thanks again, Juan and Nini's for the great service/food.", "pics": null}}, {"review": {"des": "Holy shit! I mean, sorry for the language but damn, this place made my year. Let me set the stage:  super snowy day (8\" and counting today) and I decided it was the perfect day to look for a spot outside the hood. I ran a quick search for reasonably priced restaurants, sorted by top rated, and this spot came up number one, even though it's not easy to get to from Diversey and Sheffield.<br><br>I digress. I'm not sure I've been to a restaurant more deserving of a pristine rating than this place. After drudging my way through the snow to get here, I see it: a small building on the corner, pained pink with Nini's written on it. (Nice Cuban touch)<br><br>Upon entering, the interior wall is likewise painted in bright colors. Love it. Music: on point. How perfect that Chan Chan was playing. The menu is written in pink and blue, and really pops! Everything was very clean, and this place just feels alive!!<br><br>I walk to the counter to order the media noche, but before I can, I'm greeted by Juan: an incredibly jovial and warm young man, part of the family who owns the restaurant. \"Hey brotha, how are you? Have you tried our food before?\" He then explains the Cuban/Mexican fusion of the menu and recommends the kitchen sink, which combines everything I was considering. I'm sold! He also recommends their Cafe con leche, which I also order. <br><br>I cannot impress enough through words how friendly and inviting Juan is. He asks my name, tells me his, gets excited when I take his recommendation, and it's not fake customer service, Juan just loves living this dream. That's the stuff that makes repeat customers.<br><br>Bill comes to $16.50, which at this point I'm happy to fork over. Juan thanks me so much for coming in and making the trek all the way from Lincoln Park /Lakeview.<br><br>Next, Juan makes me this dream of a beverage (the Cafe con leche) and sprinkles cinnamon on top. It's just great. He also asks if I want water for my table, and I get a wine bottle of water and a cup.<br><br>As I'm waiting for my sandwich, 12 people come into the restaurant (there were 6, including me, when I arrived... And this is at 3, so off peak hours for sure). Apparently everyone knew about this hot spot but me!<br><br>Food comes out: damn. Just DAMN! Juan says \"alright Joe, here is your Kitchen Sink!\" It is a sight for hungry eyes, and is very generous, portion-wise (see photo). After putting down half, I decide against finishing the whole thing, in part because I'm just about full, but also this means I get to eat the other half later, maybe share it with my girlfriend to get her hooked.<br><br>Music keeps kicking, great Cuban sound. Juan keeps being genuinely kind and excited with every customer. Cheers erupt when he brings a table of 7 their plantain appetizer.<br><br>Juan asks me how everything was, and I can't tell him everything running through my mind... That this is the type of restaurant that transports you to a Utopia when you enter.<br><br>I decide to order dessert:  At the counter, Juan starts calling me \"Joe Joe,\" and I realize I'm a part of the family. Juan recommends the guava and goat cheese empanada, and again it didn't disappoint.<br><br>People always ask me what my favorite spot in Chicago is, and I reply that I try new spots all the time, so don't have one. This may very well be that place. If my experience on my next trip is anything close to this one, I'll crown Nini's king.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/qQBhH6YwOX7bs2k2CL_kaQ/348s.jpg", "caption": "A little cart outside"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/rDSJiDCwFOIa8Pty_fL-jQ/168s.jpg", "caption": "Nini's!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/I9l2mV1KQ0CCkYb4PYJ3Dw/168s.jpg", "caption": "The filling of the goat cheese and guava empanada. This wasn't huge, but not tiny (I have big hands)."}]}}, {"review": {"des": "Bottom Line: Simply the best. A family-run Cuba/Mexico-influenced restaurant with the kindest staff and tastiest food. Very affordable, great value. <br><br>The Wait: We went at 2pm on a Thursday and waited about 15 minutes in line before ordering. Food came out within five minutes of the order. Tables turn quickly, so don't be intimidated by the crowd. Plenty of seating is available outside if you can't find space inside. <br><br>The Food: <br>Loved the guava and goat cheese sweet empanada (5/5), ropa vieja slider (tostones as buns, 5/5) and the kitchen sink sandwich (Thursday special, 5/5). My group also had the chicken empanada (4/5), which I really liked, but I'd pick the previously mentioned menu items before it if you're worried about price adding up. <br><br>The Drink:<br>Had the hibiscus lemonade (4/5), which was light and refreshing. Not as lemony as I'm used to (my benchmark is Chick-Fil-A lemonade), but still very good. <br><br>Bottom Bottom Line: Go, and go again, and go again. Good chance Nini's becomes your go-to lunch spot .", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/csYvIMk98eU-B4Ws3QJR-g/168s.jpg", "caption": "Chicken Empanada, Guava Empanada, Kitchen Sink Sandwich (Thursday Special, far right), Rope Vieja Slider (far center). All delicious."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/wdP1i0MauP__QD6OLraZdQ/168s.jpg", "caption": "Guava and Cheese Sweet Empanada. 5/5, must order."}]}}, {"review": {"des": "Good Food Overall! <br><br>Bad policy when it comes to pick a table to sit-down.<br>We were told by the owner JUAN that we can't sit-down on the table until we finish our order. <br>Us coming from New York City was quite surprising. Again food was great, but terrible when it comes to seating.", "pics": null}}, {"review": {"des": "Nini's is amazing. Great food, great people, great atmosphere. Got there early morning for some breakfast chicken empanadas and a guava and goat cheese empanada, look no further for the best empanadas in the city. They were delicious. I was also chatting it up with the OWNER of the restaurant while waiting for my food. You don't see that, almost ever. Putting in the work and speaking with customers face to face. Highly recommend Nini's to anyone in the city, and anyone visiting the city!", "pics": null}}, {"review": {"des": "PURE F***ing BLISS. Juan, the son of the owners, was so personable and amazing upon our entrance. Do not fear the long line when you walk in, totally worth it! Juan took such great care of us from explaining the history of the restaurant to checking in on us at our table. (He also remembered our names!) The food....well...idk...amazing!!!! If you haven't visited Nini's yet then shame on you! You have let your taste buds down and they deserve better. <br><br>Pro tip - try all three empanadas, they will make your taste buds dance the macarana!", "pics": null}}, {"review": {"des": "Can't say enough great things about Nini's and the staff there. Juan was fantastic being that it was my first time visiting. The pride that he has for his family-owned restaurant was admirable and you could tell they take that pride and put it into their food. If you're looking for an amazing atmosphere and fantastic Cuban sandwiches, Nini's is the spot.", "pics": null}}, {"review": {"des": "What a wonderful lunch experience. This place is small but the perfect spot to grab lunch with a friend. Menu has just the right amount of options and the staff (Juan) is extremely helpful if you are unsure of what to get. <br><br>We ordered the Ropa Burrito and a Kitchen Sink sandwich (not on menu) and both were amazing. I'd recommend the Kitchen Sink to someone who wants a little taste of everything. I need to try the empanadas next. <br><br>Come before 1130 to avoid a long wait!", "pics": null}}, {"review": {"des": "I felt like it was destiny for me to stop by here. First of all, Juan is amazing. He's so welcoming, friendly, and fun. I appreciate that while there is nothing vegan on the menu, he was able to work with me to concoct an amazing vegan jibarito slider. This slider had two different types of fried plantains in place of buns--one sweet and one savory. The inside was beans, plantains, and avocado, and the top was garnished with homemade garlic sauce. The salsa verde that came with the slider was the perfect dressing.<br><br>I initially tried one slider, but then had to get another because it was so delicious. I also tried the hibiscus lemonade, which was amazing as well. My meal here was the perfect breakfast, and Juan also recommended a bunch of other vegan-friendly stops to check out during my stay in Chicago.<br><br>Well-deserved five stars.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/TqYDklwDdfBLRXosiLY-uQ/348s.jpg", "caption": "Vegan jibarito slider"}]}}, {"review": {"des": "The food was delicious but I'm mostly disappointed I couldn't order whatever JUAN was on....the world needs more sweet plantains and people like JUAN. <br><br>Within 5 minutes of walking in he introduced himself, asked me where I was from, how I heard of NiNi's and told me the history of the store and how it was originally a convenience store/deli owned by his parents and how it has now transformed into the NiNi's we all know and love today.", "pics": null}}, {"review": {"des": "One of my (now) favorite places to eat in Chicago. I'm reading that a lot of people mention the owner, Juan and I cant imagine writing a review for this place without mentioning him. Yes the food is beyond amazing.. but the customer service and entire atmosphere of this place is what gives it a 5 stars!! The music, the culture, and the people. Juan just exemplifies someone who truly cares about their customers and will definitely have them coming back. He is such a lively, happy, caring person and he seriously made the food taste 1000x better, not that it needed that but you get me. The fact that you're waiting in a long line and then finally after about 20-30 minutes get up to order your food to get greeted by a smiling face really just makes the entire experience at Nini's the best. The empanadas are FIRE.. i love the beef the best but the chicken is so good with the green sauce that they give you with your order. They have a guava goat cheese empanada that is the perfect way to end your meal no matter what you get. I'm usually used to the cream cheese filling, so the goat cheese was a lovely change and a tasty surprise!! We also got the plantain beef slider and that was just one of the juiciest most creative little pieces of food i've tasted. I just really loved how the bun wasn't made of bread, but from fried plantains. I'm not from Chicago but you can bet Nini's is my first stop when I do come back again and again. Thanks for making this such a great experience for me and my friends!!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/JNq3QV3wZw1VwJvr55FvyA/348s.jpg", "caption": "This was amazing!! Beef slider with plantain buns!!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/J8Gpl30wzZpS7lM5ZBfInQ/168s.jpg", "caption": "They sell shirts!! Just ask!!"}]}}, {"review": {"des": "Had lunch here for the first time and fell in love! Amazing food. The veggie spinach wrap is awesome! Will definitely be back! Very clean and warm atmosphere-", "pics": null}}, {"review": {"des": "Nini's is home. From the moment you walk in, the owner Juany learns your name and makes you feel comfortable. The food is prepared right away and the cafe con leche is the best I've ever had. There really is no other restaurant in Chicago like this one. The twist that they put on their food makes it stand out from everybody else.", "pics": null}}, {"review": {"des": "I Really Hate To Leave 2 Stars Because My Experience Was 5 Stars!! Great Customer Service From Juan ( Owners Son ) He Was Very Friendly And Just Overall Great To My Wife & I. <br>We've Heard So Much About This Place For Over A Year And Finally Decided To Try It Out. I Must Say I Was Disappointed :( <br><br>1. Media Noche Is Supposed To Have Sweet Bread.<br>2. Cheese Was Too Melted Spilling Out The Sandwich.<br>3. No Flavor. Tasted Like Mustard Only. <br>4. I Know It Was Freshly Made But Didn't Taste Like It Was. <br>5. Too Expensive!! $9.50 For A Sandwich Is Pricey Compared Around To The Elite Cuban Sandwich Shops In Chicago Almost Double The Price. <br><br>It Comes With Guava Sauce And I Personally Dislike Guava So I Asked Juan To Put It On Side! And I Must Say Sandwich Was So Bland That It Needed Flavor. <br>So I Added Guava Sauce And It Was Good Doesn't Really Taste Like Guava.<br><br>Overall I Wouldn't Go Back If You've Had Other Sandwiches From Real Cuban Restaurants You'll Notice The Difference In Taste & Price.<br>I Spent $29 On 2 Sandwiches & 1 Drink That's Ridiculous For A Cuban Sandwich.<br><br>This Isn't To Be Malicious Or Sabotage Just My Honest Opinion That's What Yelp Is For Correct ?<br><br>Once Again It Pains Me To Rate Them So Low But Overall Like I Said Sandwich Was Just Flavorless Sorry Juan.", "pics": null}}, {"review": {"des": "This place is the best! Juan and Nini are awesome! I love the vibe of this place!", "pics": null}}, {"review": {"des": "Juan welcomed me in with his bright smile and enthusiasm.  He asked me if I'd ever dined with them before, and when I said no, he gave me the full history of the shop and recommended certain items on the menu for me based on my dietary restrictions. I got the Cubanito with no cheese and also got the homemade hibiscus lemonade. Cuban music wafts through the speakers and you can't help but tap your feet as you wait for your food to arrive. <br><br>Nini's is the kind of food that after you take the first bite, you are already trying to decide how you can ration the meal so that the whole experience can last as long as possible. I mean, every bite had me wanting to high five someone. Juan also brought over some chipotle mayo and salsa verde for me to add to the sandwich.  I have already been back a second time for their sandwich with guava jelly and mustard, and I will go back again for the churros and whatever else I can get from the menu. Juan even recognized me the second time I went back, which just goes to show how customer focused this place is.<br><br>If you go early before 11, there usually isn't a long wait, but there was a line by the time I left at 11, so plan ahead! Get thee to Nini's. You won't regret one bite. The portions are huge!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/fldYNN87zwHTeiZUTcDrfw/168s.jpg", "caption": "El Cubanito"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/qYdrxi6jVNVVQH9g2u31Rg/168s.jpg", "caption": "Media Noche with no cheese"}]}}, {"review": {"des": "Delicious spot! Everyone was incredibly friendly and the service was speedy, this is a family restaurant and feels like home. The food was priced well and very flavorful.<br><br>I highly recommend the hibiscus lemonade because it's refreshing, or the cafe con leche which also looked delicious. Their slider made with plantains was my favorite. Not to mention el cubanito which was a generous portion and also very flavorful.<br><br>We topped the meal with churros. I will definitely be back!", "pics": null}}, {"review": {"des": "My experience was absolute. Juan greeted me upon entry... his entire customer service interaction with me was actually top notch. I tried their media noche sandwich - a perfect combination of breakfast and lunch, which is exactly what I craved at the moment. I'm looking forward to exploring their menu further next time.<br><br>P.S. Love the pink wall outside. Such a perfect photo opp!", "pics": null}}, {"review": {"des": "Love coming here, Juan always makes me feel at home. The amount of time he goes into detail about himself and the restaurant is always great. He also takes the time to get to know you. The food is AMAZING! Came in to the place not knowing what to expect and left smiling ear to ear. I love everything on the menu! <br>The only thing I suggest is getting the biggest iced coffee there. It's so good that the small one will not be enough. Can't wait to head back!", "pics": null}}, {"review": {"des": "I've only had excellent trips to Nini's. I've been there frequently through the years and their food quality remains excellent, service is so good it has no parallel, and the atmosphere is welcoming and intriguing. Love their signage too!", "pics": null}}, {"review": {"des": "My mom and wife joined me for lunch today at Nini's; mostly, a solid affair.  First, kudos to Juan, the shopkeep who I assume owns and/or manages the joint--I am high energy and this guy out-high-energied me in a way I still can't believe!<br><br>We tried all three sandwiches, and all three empanadas.  Of the former, the ropa vieja burrito was the best thing I tasted all day.  The wrap was perfect, the shredded beef was perfect, the side aioli was perfect, and while it was large, it wasn't completely out of control.  $10 for sandwiches feels a tad high given the location of Nini's but I'll play along since it was my first time.<br><br>The other two sandwiches--a \"Cubanito\" that was a vegetarian sammie, and a pork sandwich--were very average, and this was mostly due to the rolls they were served on; not very fresh, but once you deconstructed each one, the guts were not bad.  Just not the burrito.<br><br>Of the empanadas, the chicken was the highlight...super smooth, and those fried empanada shells were good across the board.  My wife liked the goat cheese better than I did, and the shredded beef was good but that was also featured in the burrito.<br><br>Love the space, love that I have a spot to hit during the day, and when it warms up there's a small patio on Noble to enjoy the sunshine.  I understand that there are other specials I'll need to hit next time so I look forward to the challenge!", "pics": null}}, {"review": {"des": "Oh my gosh...Nini's. I cannot even rave enough about this amazing Cuban deli. My sister lives right down the street, so we decided to give this place a try for lunch.<br><br>Firstly, the place is adorable. Very clean inside with great decor. The owner takes all orders and is the most personable person. You can tell he truly loves this place and providing quality food for his customers. The staff even call you personally by name when checking on you throughout your meal. Just top notch service.<br><br>My sister and I chose to split the guava and goat cheese empanada. I then ordered the El Cubanito and my sister ordered the Kitchen Sink (combo of their 3 sandwiches). The guava and goat cheese empanada was the perfect crispiness and was served with a side mango sauce. <br><br>In regards to the sandwiches, just WOW. The Cubanito consisted of smoked ham, avocado, egg, cheese, black beans and topped with a sweep plantain. It was grilled to perfection. Truly amazing!! The sandwich is quite large, so I was able to take half home. My sister raved about her sandwich, as well.<br><br>Overall, this place is just fabulous. I could eat here every day! Please support this local place in Noble Square!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/caMK-A9rcS0KH7vhv1SD5g/348s.jpg", "caption": "Delicious lemonade!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/XniL-12ewIOk1ZeuPoxPfA/168s.jpg", "caption": "Goat cheese and guava empanada."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/5Mpkbn3eO-RH3_zBWJiDwA/168s.jpg", "caption": "El Cubanito! Amazing."}]}}, {"review": {"des": "A great experience wonderful food great atmosphere was a first time customer and was my birthday and wanted to try it and it was worth every second thanks on some amazing food and a great experience", "pics": null}}, {"review": {"des": "ATTENTION IT TEAM: CAN WE GRANT AN HONORARY SIXTH STAR FOR THIS PLACE!? <br><br>Wow. To be quite honest, I'm a bit speechless about my experience at Nini's this afternoon. I was really craving some cafe con leche and found this place on Yelp. First things first, the customer service is felt the moment you walk in the door. Everyone was so warm and friendly it honestly was very refreshing. I wish I could've gotten the cashiers name but he was so friendly and warm that not only did I get the cafe con leche that I came for but I also tried the chicken empanadas and the special of the day which was flaming hot cheetos covered elote. <br><br>Man...everything was amazing. I feel like good customer service amplifies the entire food experience and I can't tell you a single problem I had with my food. Super tasty and super quick. My meal came to about $13 which isn't bad for what I had. I left feeling energized, full and ready to come back for more cafe con leche!!! <br><br>God. If any of the employees of Ninis are reading this: I love you and want you to cater my wedding. Goodness! God bless ya!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/jyn1ZnDDWAdPLkeg6WakOg/348s.jpg", "caption": "Exterior, so cute!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/5yRSye-pOfiSDydGWzsBbg/168s.jpg", "caption": "Flaming Hot Cheetos covered elote"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/TSiAUxnOX8pj9_b4rzQhtg/168s.jpg", "caption": "Menu 8/17/17"}]}}, {"review": {"des": "Fantastic family-run deli. The food, drinks, and service are outstanding. <br><br>My favorite part of the experience was seeing how much the owner/owner's son enjoyed himself - it's quite refreshing to see people actually have passion  and enjoyment for what they do. <br><br>Will definitely return...", "pics": null}}, {"review": {"des": "Honestly, what makes this place so great is Juan (the owner/son). His enthusiasm, passion about food, and hospitality make this worth the visit. I felt like I was visiting a friend more than eating at a restaurant. I've never walked into a restaurant before and greeted with a huge smile. On top of that, the food was great. Would highly recommend the chicken empanada if you're going to get anything. He also gave us recs for different food to get in the city - by the end of our meal and conversation I realized just how much this man loves his food. Would definitely make the visit out here once I come back to chi-town.", "pics": null}}, {"review": {"des": "This place is life changing. Officially our favorite restaurant in Chi. We had a little bit of everything....SO GOOD. Also, our service was outstanding - thank you Juan you are awesome!! <br><br>Highly recommend the cafe con leche, churros and empanadas!", "pics": null}}, {"review": {"des": "I come here 3-4 times a week, I truly believe it might be one of my favorite restaurants in the city. For starters the empanadas are so consistently delicious. Very on point in terms of flakeyness & flavor. Also, the salsa verde that comes with the chicken empanada is really something special.<br><br>My go to drink is the Cafe con Leche that goes well with all of the menu items from the Media Noche to the Ropa Vieja. The owner Juan personally takes your order and will give recommendations based upon your preferences, or let you know what the weekly special is (steak sandwich, hot cheeto elote, pozole, etc). <br><br>Be prepared for the best service in all of Chicago from Juan and his chef Huey. Best food experience I've had, and happy to consider myself a regular.", "pics": null}}, {"review": {"des": "I love this place so much. The owner is incredibly nice his positive attitude is contagious, makes you want to leave a review on Yelp afterwards so here it is. The Ropa Vieja is simple and extremely tasty, leaves me stuffed all day. We get the same thing every time, but Juan made sure we tried something new and gave us a sweet empanada on the house, also delicious! I always come on a Saturday, and make sure to get there right before noon because that's when the line starts to form. Already looking forward to next time.", "pics": null}}, {"review": {"des": "This morning I stopped here for a coffee to go, and not only did I leave with the most delicious iced Cafe Con Leche I've ever had, I had a great chat with Juan, the son of the owners, which gave my morning a great start.<br><br>The cafe is half-Cuban food, half-Mexican, and ALL heart and deliciousness!!<br><br>I hated to leave, but I was parked illegally and had to get to work!<br><br>The menu looks delicious, and the cafe seems very comfortable!<br><br>I'll be back!<br>A lot! <br><br>Thank you!!", "pics": null}}, {"review": {"des": "Atmosphere: clean and spacious. Has a modern diner style with a pinch of a family feel, probably due to the restaurant being a family ran business. <br><br>Staff: awesome and positive attitude. If you come often enough they'll remember your name <br><br>Food: OMG! It's so fresh and tasty. I've only had the chicken empanadas so far and it's absolutely bomb! The horchata ice cream is the best desert I've ever had in my life. The hibiscus lemonade is really fresh. Not too sweet so you can tell it's homemade", "pics": null}}, {"review": {"des": "First off bless your sweet parents souls for making these recipes and sharing it with \"US\"! Everything is amazing. If you have never eaten it before and your not allergic to anything just take my word and try everything. It's like nothing can disappoint you here. From the cooks, to the table, even parking isn't that bad after you've had the food. I wish there was more but it's only this one. Everyone is so nice and just a wonderful family vibe here.", "pics": null}}, {"review": {"des": "This is such a cute place! Juan, he's super cool! It was my first time here. He was nice enough to give me some back story on how Nini's Deli came along. He also gave me some recommendations on what to choose from. The service here is fantastic. Juan's personality is A+. Also they have apparel for sale, they're very cute! I had gotten the cafe con leche, it's awesome. It's like the softer version of a Vietnamese iced coffee (cafe sua da) I also had a ropa vieja slider. The ropa vieja itself was super tender and flavorful. Can't wait to be back for more!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/kW7biUjkpy9bIVzfGbz2sA/348s.jpg", "caption": "Ropa Vieja slider super delicious."}]}}, {"review": {"des": "Super busy place for lunch but could still find a table to eat and chat with a friend. Highly recommend the Media Noche. Juan who took my order and also the owner was really friendly, he even gave us two cups of the cafe con leche when I only ordered 1 to share with my friend.", "pics": null}}, {"review": {"des": "I've been in search for a good Cuban sandwich and Ninis Deli was beyond all of my expectations!! First of all, we were greeted by Juan who gave us a brief history of the place and made us feel as if we were long time friends. His energy and love for what he does was like no other. He made a few recommendations and we couldn't help but to want one of everything. I ordered a cafe con leche, the kitchen sink sandwich and a guava/goat cheese empanada which were all absolutely delicious!!! I will definitely be making that hour drive from the south suburbs again!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/c5P21desWG_IoMa0fjkZcA/168s.jpg", "caption": "Kitchen Sink special"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/IZp2Krvd5be4uSDSOIdXtQ/168s.jpg", "caption": "Iced Cafe con Leche"}]}}, {"review": {"des": "This little place is tucked off of a main street. It's been family owned for a while and they keep updating it which is nice. It's colorful inside and has a very \"instagram-able\" wall outside. Food was superb. Drinks were amazing. The owners son is usually there; he's very friendly and genuinely wants to make sure you have a good time. The menu appears to be rotating and it's generally just a few items; which usually means those few will be really good. Overall: a must see.", "pics": null}}, {"review": {"des": "Dropped in to Chicago to visit my son, he recommended Nini's for lunch - outstanding!  The vibe in the Deli was great, thanks to the Owner's Larger than Life personality!  He was able greet everyone that came to the counter while taking and delivering orders, busing tables and checking on guests!<br><br>Juan recommended the Cubano \"Kitchen Sink\" which did not disappoint - the sandwich was huge and was filled with beef, ham, egg, jalapeño, avocado and cheese... out of this world!  I washed it down with a Jamaican Juice, delicious!<br><br>I will definitely visit, each and every time I'm in Chicago!", "pics": null}}, {"review": {"des": "What the h.e.double-hockey-sticks! Double-u TF! Juan rocks! The strawberry kiwi paleta rocks! The goat cheese guava jam empanada rocks!<br><br>More soon!!!", "pics": null}}, {"review": {"des": "Seriously the best ever. Food is incredible, fast, and Juan and everyone else are just so friendly and awesome!", "pics": null}}, {"review": {"des": "Hook yourself up and order 100 empanadas and a cafe con leche (Cuban version of a Vietnamese coffee)  you come in. <br><br>Decor is super trendy and fun. <br><br>Service was amazing (shout out to Juan for the recs!). <br><br>Food was comforting and delicious.", "pics": null}}, {"review": {"des": "The owners' son Juan is amazing as many reviews have discussed, he immediately asks for your name as a way to make your interaction more personable and you can tell he loves what he does. He has definitely won me over and I will become a regular purely out of service alone. <br><br>Food wise, I was bummed to find out they no longer serve the Deli's Besitos De Cuba as it looked amazing online. However, I did have the Media Noche and it was delicious. It's not powerful in flavor but a twist to its traditional dish. I thought it would be sweet with the guava jelly but with the pickles and mustard, it was a surprisingly good balance. The Sweet Empanada (goat cheese and guava), amazing. If you like goat cheese, you'd love this. It's not overly greasy but still crispy. <br><br>It's definitely busy for lunch but food comes out pretty fast once the order is put in, it is definitely a neighborhood staple that I couldn't recommend enough!", "pics": null}}, {"review": {"des": "Hands down one of my favorite places in Chicago! <br><br>Came here for the pink wall, stayed for Juan and the amazing menu, and currently planning my next visit.<br><br>My friends raved about this place and I had to try it for myself. <br><br>When me and K got to the front of the line, Juan probably knew we were first-timers haha. He welcomed us and ran us through the menu, finishing off with the specials. Based on a friend's suggestion (and the delicious description), we both ordered the Ropa Vieja burrito. We also got the tostones, hibiscus lemonade, and mango-pineapple juice topped with strawberries. <br><br>Ropa Vieja- omg wow. So good! The combo was great, especially that egg and cheese part. Drool. <br><br>Tostones- good amount for the price ($3.50). The dipping sauce was also on point. <br><br>Drinks- aesthetically pleasing, sweet (but not too sweet), refreshing. Love! <br><br>Lastly, I had to get the horchata paleta. Damn, that was good. <br><br>Sorry this is not the most detailed review but just go lol. You won't regret it.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/wbNLA2WEWTt957poDefY-w/348s.jpg", "caption": "Happy to be here"}]}}, {"review": {"des": "A few of my friends who know good food told me about this place and wanted me to try it. There is a reason this place has 5 star average from 463 reviews which is well deserved.<br><br>AmbienceThe place had a minimalistic vibe you could tell that it was the neighborhood hangout spot with a combination of families and people just coming in and trying to check out the food.<br><br>Staff I can't say how outstanding it was to meet Juan who was genuinely nice, kind and you could tell how much he loved talking about the good food that the restaurant made.<br><br>Food we have to talk about how incredible the Ropa Vieja was. It was cooked to perfection and had just the right amount of flavor, the jalapeno the cheese mmm all complimented each other to perfection. The hibiscus lemonade was just right & not too sweet.  I really enjoyed the Ropa Vieja slider too which now just thinking of it makes my mouth water. Amazing food can't wait to try everything on the menu.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/e-Fxu2bXABGuhMdprjxC5Q/348s.jpg", "caption": "Ropa Vieja so good and tasty each bite tasted better than the last"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/3TsoPGIsFTBu8wYfggebTA/168s.jpg", "caption": "Plantain slide really good"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/KjJMEWHxNjkCYZXWm_ZX2Q/168s.jpg", "caption": "Hibiscus Lemonade"}]}}, {"review": {"des": "5 stars for the best service I've had in a long time. For a place where you order and then find a table, you wouldn't think 5-star service. But this place (and the owner) make you feel so welcome. <br><br>I usually drink my coffee hot, but the iced cafe con leche with a tower of whipped cream and dash of cinnamon looked too good to pass up. And it didn't disappoint. The whipped cream melted a little into the coffee after the first few sips and it tasted just like a dessert. <br><br>We ordered the beef empanada and the sweet empanada (goat cheese and guava) and both were deliciously hot and flavorful. We also had the media noche sandwich, which I loved with the pickles and mustard. Will definitely be back to this neighborhood gem!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/rGp7H97ULJIYx21XRX2YAA/348s.jpg", "caption": "Cafe con leche"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/HldDND61bykGUWKqfzvt8A/168s.jpg", "caption": "Media noche"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/-quwRJNG-h8KfVijIhi0vQ/168s.jpg", "caption": "Clockwise from the top: chicken empanada, sweet empanada, beef empanada. And the hibiscus drink in the far left."}]}}, {"review": {"des": "GO. This cute little family-owned joint is worth checking out and definitely worth supporting. Encased in pink walls and stamped with a stellar logo, it isn't that hard to miss. You walk in, order, and are then ASSIGNED a seat. (My friend and I were told firmly, but not rudely, to order first--we didn't order right away because she had to take a phone call.) We were greeted at the counter by the owners' son, who was enthralled to tell us about the family business. He told us excitedly about his family's roots and how they were the inspiration for the food. My friend and I split a lot of different menu items. The overall consensus was that everything was good and reasonably priced.<br><br>Media Noche ($9): large portions, the flavors were excellent and the crunch and bite of the pickle was fantastic.<br><br>Flamin' hot elote ($4): just okay--it wasn't heavily slathered with all the ingredients like your typical street elote and I would've wanted more flamin' hots encrusted onto my corn. Moreover, because I went during the winter, the corn wasn't huge. Not sure if it was worth the $4 price tag.<br><br>Sweet empanada ($3.50): perfect little treat. The accompanying sauce wasn't even needed.<br><br>Churro ($2.50): small churro drizzled with cajeta. Good, but nothing too special.<br><br>Café con leche ($4): Insta-worthy and delicious. <br><br>Hibiscus lemonade ($4): not a huge fan generally, but it was good--not too sweet and not watered down.", "pics": null}}, {"review": {"des": "A neighborhood gem that I've been waiting to reopen since moving to the neighborhood (they were on vacation for a month). It's pretty popular, and I can see why. For amazing Latin sandwiches, you pay a reasonable price. The owners' son, Juan, is a fireball of energy and passion for his parents' establishment--taking orders with a huge smile and excitement. If there was a DJ Khaled of Cuban sandwiches, it would be this guy (looks similar as well).<br><br>You can't go wrong with anything on their menu. Their sandwiches are large. Great vibe as well with Latin salsa music being played and outdoor tables as well.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/CCGdNOE0f6PqZefiYtsuYg/168s.jpg", "caption": "Menu - 07/29/17"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/R2Abl8faBtNmwz3sNBR4OA/168s.jpg", "caption": "El cubanito +turkey"}]}}, {"review": {"des": "I initially saw Nini's featured on Channel 7 early one morning and decided that I had to visit.  I've eaten at similar Chicago restaurants, but Nini's is different.  Juan, our server, was incredible, as was the food!!!  I highly recommend Nini's!!!!", "pics": null}}, {"review": {"des": "Nini's Deli is absolutely amazing. When you step into Nini's, you walk into a warm, colorful and friendly atmosphere will you will soon be greeted by Juan. Juan will go above and beyond to make sure your experience is a great one and even make a point to remember your name.<br><br>I live really close so I have tried all the sandwiches including the El Cubanito, Media Noche, and Ropa Vieja. I don't think you can make a bad choice here. These sandwiches are all different, flavorful and delicious. The empanadas are also dope. I would recommend trying the Sweet Empanada. <br><br>The only negative thing I would say is that on Saturdays they tend to sell out of certain items quickly, which is great for them but so sad for my taste buds. :)<br><br>Thanks for helping make this neighborhood so great and keep up the wonderful work!", "pics": null}}, {"review": {"des": "The owner has one of the best energetic and nice people you ever meet. The food was unbelievable good<br><br>Thank you for the great food", "pics": null}}, {"review": {"des": "At least once in a mans life he should experience a trip to a restaurant that changes who he is as a person for me that trip occurred during my visit today at Nini's Deli. I've tried place after place in my life and Nini's is the pinnacle, the epitome. Watching Juan maneuver his way around the restaurant, talking to customers, whipping up Cafe Con Leche; it's like watching MJ in his prime. During my visit I enjoyed the Media Noche, which is the perfect combination of flavors dancing on my tongue and taking my palette to another dimension. Pictured below is the non-listed \"Kitchen Sink\" a crowd favorite. Thanks Juan and thank you Nini. Cinco estrellas¡", "pics": null}}, {"review": {"des": "Amazing customer service! Loved the owner!  the food is amazing and a great price. Come to Nini's, you won't be disappointed! Everything on menu is great! (Pictures : chicken empanadas , lemonade , cafe)", "pics": null}}, {"review": {"des": "Based on the high reviews we had to try it out. Of course there was a wait, but it did go by quickly. The man at the front who took our order was unbelievably nice and answered all our questions, i love how he acts like there is no line and he has all the time in the world, makes you feel good and not rushed. We got the sweet empanadas to start, wow, guava and goat cheese melts in your mouth amazing! Cafe con leche, delicious. And the kitchen sink (to share) wow, absolutely perfect, it had everything on it your heart could desire. Cant wait to go back!!", "pics": null}}, {"review": {"des": "Food was dope. I got the kitchen sink and beef empanada. Super huge sandwich. I couldn't finish it lol. But it was good. Juan is super nice. As I was sitting and eating, he literally treats all the customers coming in with lots of energy and positive vibes. I like that. You don't get that often these days.", "pics": null}}, {"review": {"des": "Awesome neighborhood spot. Breakfast empanadas are great, service is great and the owner, Juan, is very friendly! Highly recommended", "pics": null}}, {"review": {"des": "We need more places like this in Chicago! This was the highlight of my day, the food is delicious, but that is only the beginning. The owner is beyond warm, makes everyone feel like family, and truly takes the utmost pride in his craft. I had the empanadas, coffee and churros. (I now, a casual, light lunch, right? :) ) The vibe is super casual, and welcoming; you can tell everyone dining at Nini's felt really comfortable. Nini's does an amazing job of cultivating a neighborhood environment around a stellar menu. Can't wait to try the sandwiches next time.", "pics": null}}, {"review": {"des": "Just go. The food is awesome, a crowd favorite is the ropa vieja (put sriracha on that baby oh my god), but I love the media noche as well! The guava jelly is awesome with the eggs, and the crunchy texture of the bread completes every single bite. <br><br>You'll see a lot of hypebeasts walking into Nini's. Don't be intimidated if you're not wearing street brands or if you've got a different style - Juany and the team will still treat you as hospitable as possible. <br><br>It's pricey for the portion sizes but when I factor in the hospitality, respect, and energy of the place, I'm happy to pay those dollars. <br><br>And yeah they got a pink wall for photos if you're basic like that.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/6WfFAf-daQJVo2wa3_BVQQ/348s.jpg", "caption": "party size hibiscus lemonade and yeah that's two straws lol"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/COjQGUzplqIeHtla2BzGUg/168s.jpg", "caption": "flex w the plaid pants lol"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/-tCzqRmcDRH0m_dU8CWNHw/168s.jpg", "caption": "CAFE CON LECHE AND THAT ICONIC PAINT JOB YUH."}]}}, {"review": {"des": "I live around the corner and love stopping into Nini's.  As others of said, Juan immediately makes you feel welcome and its hard to not be put into a good mood when you leave.  The cafe con leche (either iced or hot) is fantastic and the sweet empanada (with goat cheese & guava) make for a perfect breakfast.", "pics": null}}, {"review": {"des": "Talk about a delicious shop with a really friendly family who runs it and you have nini's. When you come in you feel like you are part of the community and the front register guy is incredibly gregarious and welcoming. <br><br>Delicious sandwiches and the drinks are also tasty and refreshingly satisfying. Simple menu with three entrees but they are all top notch and made to order. <br><br>Service is fast especially seeing how busy they are they always serve with a smile and never are bothered even though they are slammed.<br><br>Busy with lines to the door but for good reason and worth the wait!", "pics": null}}, {"review": {"des": "This was a \"must come\" place from a friend who visited Chicago. Being a Miami native, this isn't authentic Cuban food, it's a small variety of  Cuban sandwiches  with a twist of modern flavors and add ons. Again, visiting Chicago and living in Miami, when you think Cuban food and traditional dishes, you think tostada ( Cuban bread with butter) un café citó ( Cuban expreso) una croqueta ( ham finger food) pastelitos ( pastries with meat, or guava etc.. Cubans know what I'm referring too). <br><br>The place itself is small but very casual, and has a variety of table seating  inside and outside, booths and a few tables. The place is popular as there was a line almost to the door. <br><br>I tried the popular items - café con leche, lemonade, empanada ( fried pastry with meat or chicken on the inside ) and their breakfast burrito. The café con leche ( iced Cuban version with whip cream and cinnamon) was good. It had a good sweet flavor and the cinnamon and whip cream allowed the blend to be pretty flavorful. The lemonade combo was mildly sweet, not overbearing with lemons or sugar. Empanadas were good, especially the meat one, which has stuffed shredded meat, the chicken was ok, wasn't dry at all. Lastly, the breakfast burrito consisted of ropa viejo ( shredded meat) omelet, added avocado, rice and black beans, jalapeño.. and that was pretty tasty, I would definitely have that again. <br><br>Prices were great for what the dishes themselves were.. I purchased 2 Cafe con leches, lemonade, 2 empanadas,  and the burrito and spent $34. Not bad.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/EJjVEz0nCvzS5wnymB98Hg/348s.jpg", "caption": "Outside of Ninis Deli"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/iHx1PhBrxz5NIDwwxS0b9A/168s.jpg", "caption": "Ropa Vieja"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/RFqecgSRvnZ0TeMaBU7qHQ/168s.jpg", "caption": "Ropa Vieja Burrito to go"}]}}, {"review": {"des": "This mom and pop shop is doing it right. As Juan, the son of the owners, explained, the food has cuban-mexican influences.<br><br>My group ordered:<br>-Plantains that came with 3 different dipping sauces $3.50<br>-Media Noche $8.50<br>-Ropa vieja burrito $9<br>-Their monthly (?) special of a monte carlo<br>-Cafe con leche $3.50<br>-Hibiscus lemonade $3.50<br><br>The plantains were just okay. I used them as a medium for the 3 sauces, my favorite being the chipotle ailoi. The sandwiches were of generous proportions. We all just ate half of it for lunch and had the other half for another meal. This definitely made the price worth paying for. I traded half of my burrito for the media noche and it was delicious heated up in my toaster oven. I will say, there was definitely too much ham to bread ratio in the sandwich. Which was fine since I could easily take it out to enjoy with my morning eggs. <br><br>The cafe con leche was definitely on the pretty sweet side (just how i like it) so if you want it less sweet, definitely mention that. It tasted just like a vietnamese coffee to me. The hibiscus lemonade was worth trying once but I wouldn't get it again. <br><br>Overall, I'm happy to return to support this mom and pop shop. <br><br>There's plenty of free parking around the neighborhood. And I definitely always will appreciate the system of ordering upfront, grabbing a seat, then being brought your food.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/R10OlCsgKn74lWDdHhPQjQ/348s.jpg", "caption": "Menu May 2017"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/iD7OpE0GRpVHVrrDwZmNNg/168s.jpg", "caption": "Burrito $9"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/XxI_Psmb_wingAZNvkR0YA/168s.jpg", "caption": "Plaintain Appetizer $3.50"}]}}, {"review": {"des": "Great authentic food Cuban cuisine! Great service! Family owned so the staff is wonderful and warm. Love this place !", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/VfcQavI88IWFOjQTuOtyWg/348s.jpg", "caption": "Cafe con Leche"}]}}, {"review": {"des": "Delicious food. Great vibe. Juan is awesome. Not much else to say. Strongly recommend the Ropa Vieja.", "pics": null}}, {"review": {"des": "Fantastic sandwiches and empanadas! The coffee - both drip and café con leche - is amazing, too. If I could eat here everyday, I would. Juan, the owner's son, is such a welcoming host,  you feel like he's personally welcoming you to his home and family's culture the second you walk in. As important, though, the food's quality is superb. You can't go wrong with anything on the menu!", "pics": null}}, {"review": {"des": "Nini's doesn't have a big menu, but that's okay because what they have is delicious.<br><br>My friend introduced me to this place and I'm glad I got to check it out. We got one sandwich and one empanada, as well as the party sized hibiscus lemonade to share. I enjoyed it all but the highlight for me would have to be the lemonade. I normally don't like lemonade but this was very refreshing without tasting sickly sweet or extremely sour.<br><br>The place is cutely decorated and service is also excellent!", "pics": null}}, {"review": {"des": "It's been years that I started coming here. Food is always delicious! Owner always nice and attentive. We go up there as much as we can and we get welcomed back over and over. Prices are decent wish they were cheaper but food is so worth it. Staff is nice. It does get packed but I'm always lucky to avoid that crowd.", "pics": null}}, {"review": {"des": "Nini's Deli is a prime example of what needs to be done to run an exemplary Mom and Pop restaurant. From the food, the service, the marketing, etc... I was very impressed. I ordered the Kitchen Sink which was a slew of all the meats I believe sandwiched between avocado slices, homemade chipotle aioli, and fitting bread. It was delicious. <br><br>What I came away impressed with was the passion that poured out of the owner's heart for Nini's. I forget his name (my B) but he was very energetic and enthusiastic about the menu there while explaining the different items. Super personable and even gave me a try of their homemade hibiscus lemonade since it was my first visit. His energy/enthusiasm is contagious and is much needed when trying to make it out there as a mom and pop. I appreciated it very much and I will certainly be back. Maybe tonight...?", "pics": null}}, {"review": {"des": "Juan, the son of the owners of Nini's Deli invited me to come back and try some food after my disappointment with my first experience. Honestly, I couldn't have asked for a better second experience. <br><br>The moment I introduced myself, Juan greeted me with the biggest and warmest smile. He was super enthusiastic and couldn't have been more sweet. He told my sister and I a little about Nini's Deli and his parents - father from Cuba and mother from Mexico. Nini's Deli has a great combination of food. <br><br>I was told that my sandwich I previously had, El Cubanito was more of a vegetarian option. He wanted to give me an experience with the other food options - elote with Hot Cheetos, chicken empanadas, Media Noche, and Ropa Vieja. I was also able to try their Cafe Con Leche and Hibiscus  Lemonade. <br><br>To start off, the drinks are delicious. The Cafe Con Leche isn't too sweet but isn't too bitter. Definitely a must try! The Hibiscus Lemonade is bitter and sweet. The combination is amazing. Who knew bitter and sweet works so well together. If you're not someone who likes sweet drinks, definitely try this out! <br><br>And now to the food. We started off with the elote with hot Cheetos then chicken empanadas. The elote - such an amazing twist. The butter and mayo on the corn, slapped on with some hot Cheetos crumbs. It's an experience you should try! & the chicken empanadas, super crispy. Inside is so moist with the chicken with cheese. The sauce it comes with on the side is sweet and refreshing. I want more! <br>Now to the sandwich and burrito. The moment I bit into the Media Noche, I was hit with the sweet guava jelly then the savory grilled turkey, cheese and egg. The bread, toasted and crunchy. I love it. And the crunchiness from the pickles. It all comes together. So many unique flavors and textures. It's amazing. <br>And my all time favorite is the Ropa Vieja. It's a burrito with so much flavor and stuffing packed in. From the juicy slow cooked beef. Super chewy and flavorful. The rice, not too hard and not too soft. Also the cheese and egg just melts in your mouth. Not many textures but definitely so many flavors. The flavor from the slow cooked beef and the egg and cheese just works together. I am a fan!! <br><br>I'm so grateful for Juan - reaching out to me and allowing me to experience his family's restaurant. I am definitely glad I came back and tried the other options on their menu. I will definitely come back! Great service and amazing food! Best family restaurant ever!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/sBzQZYx26GeRZFhhogn4VA/348s.jpg", "caption": "Juan is literally the best. So full of energy! Thanks for the amazing experience! I'll be back! :)"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/-NHIhjIWI5z3a67dcSb6CA/168s.jpg", "caption": "Can you tell I've fallen in love with Nini's?!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/yP-wGxwxq0DJR_5jp94Ljg/168s.jpg", "caption": "Amazing experience at Nini's with the sis."}]}}, {"review": {"des": "Have never had a bad or mediocre meal here. Everything is amazing. My favorites have to be the Ropa Vieja Slider and Empanadas. I would recommend going before 11am otherwise expect to wait in line. Such a neighborhood gem!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/a9-qXhdjVEcYS6juttyp-Q/348s.jpg", "caption": "Ropa Vieja Slider - so delicious. Crispy plantain bun with tender meat inside."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/gNqfZjpkVBfcD0E4v9oyLw/168s.jpg", "caption": "Hibiscus Lemonade & Cafe con Leche"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/kDLLNN1Kakq6i3wpAD-1SQ/168s.jpg", "caption": "Steak & chicken empanadas"}]}}, {"review": {"des": "Food here is AMAZING. Their sandwiches are so good and remind me of my times in Miami. While the coffee can't beat authentic Cuban coffee you get from Miami, it comes close. <br><br>I recommend the empanadas. They're incredible! <br>Only downside is that seating is super limited so you have to have one person sit down while everyone orders. <br><br>I'll definitely be back.", "pics": null}}, {"review": {"des": "Stopped in during a quick conference in Chicago. Tried the Empanadas including shredded Beef, shredded Chicken and Guava and Goat Cheese. Beef is served with a chipotle aioli and Chicken with a green sauce (I wish I could tell you what is was). Both were extremely crispy on the outside and moist and tender on the inside. I can't imagine they could be any better. But as great as they were can we just talk about the Guava and Goat Cheese?!?!  OMG it's so good you might cry at the thought of not having a Nini's in your own neighborhood. <br><br>Cafe con Leche was good. Served over ice in a mason jar with whipped cream. <br><br>Juan, the son of the owners, was so gregarious he made you feel right at home. <br><br>Go to Nini's Deli! You'll be glad you did!", "pics": null}}, {"review": {"des": "You literally cannot go wrong. Empanadas are awesome. Cubanito is delicious. The iced coffee comes in a mason jar with whipped cream on top. And the staff are so wonderful and kind. What more could you want?", "pics": null}}, {"review": {"des": "The place is awesome and deserves the 5 star rating you see on Yelp. Outstanding service and outstanding food. How can you go wrong? Be sure to come at least 1-2 hours before they close as I've seen them run out of food on multiple occasions.", "pics": null}}, {"review": {"des": "This place is great! Like many other reviewers have noted, Juan has an incredibly warm demeanor and makes you feel comfortable as soon as you walk in. The place has very cute decor too, with fresh, bright flowers on the tables and decorations that make the place feel cozy. <br><br>I had the goat cheese and guava empanadas (dessert empanadas) and a beef empanada. The goat cheese one was amazingly goat- what a great pairing of flavors! The beef was so flavorful and moist, with crispy outer shells with the perfect amount of softness encasing the filling. I also had the ropa vieja burrito which had egg, beef, the most delicious combo of beans and rice that I've ever had and drizzled with some sauce that I have no idea what it was- let's call it a secret sauce. The burrito was huge- big enough for two people to share. For two people, all this food was more than enough and everything was very reasonably priced. <br><br>I'm going to have to come back here when I have a craving for empanadas!", "pics": null}}, {"review": {"des": "Amazingly great Cuban/Mexican sandwiches served by warm and friendly staff at a very reasonable price. Their portions are good for sharing. I especially like their special, The Kitchen Sink. What a great sandwich. The homemade drinks were tasty too and something you should definitely try. The son of the owner said the sandwiches were based on his grandma's recipes, adding a touch of home-cooked authenticity to each bite.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/7H7dQr9fPVV-6t2X7RyvMg/168s.jpg", "caption": "I wasn't able to get his name but he was so friendly and he really took the time to explain the sandwiches to us."}]}}, {"review": {"des": "This is a MUST for those looking to find a local restaurant with AMAZING Cuban food. All these reviews speak for themselves - this cute, family-owned spot is definitely one to check out. I came here for the first time about a week ago as per a recommendation from a friend (who has been here multiple times). He advised we get there early because they will run out of food by 2-2:30pm due to their popularity around newcomers and locals! We got there around 12:30pm, waited in line for about 30-40 min, then got our food 5 min after we sat down. They sold out of food at 2pm - so we got lucky!<br><br>First off, the wait is worth it. I'm tellin' you - WAIT IN LINE. Once we got to the register we were greeted by Juan, who offers amazing hospitality and smiles to his customers. He is enthusiastic about his family history of the restaurant and takes his time explaining the menu/answering questions. The service here is so fast, graceful, and accommodating - you will not enter or leave unhappy due to the amazing atmosphere of this spot.<br><br>Next, the FOOD. Holy moly, the food. I ended up splitting all three empanadas (chicken, beef, sweet) with my boyfriend as well as the special, which was the steak sandwich. Both were cooked to absolute perfection - I was actually sad when the meal was over. So, I guess you do leave Nini's upset that you couldn't make that meal last forever! The empanadas were crispy, yet soft on the inside. The sweet one, which we saved for dessert was filled with goat cheese and jam - mouthwatering. The steak sandwich was tender and the sauces on/within the sandwich really completed it. The sauces on the side for each dish really helped add to the overall taste of each item as well! Also - cafe con leche is a must. You will not be disappointed with this drink, as it is not overly sweet but super tasteful.<br><br>Will definitely be back! The service, the food, the ambiance were all amazing. Perfection in a cute lil pink-walled place!", "pics": null}}, {"review": {"des": "Nice local spot, fresh food five star service.  Really nice place for a first date.  Homemade drinks", "pics": null}}, {"review": {"des": "One of my favorite places to go I love the Cuban sandwiches here and the agua de horchata or the coffee YUM!", "pics": null}}, {"review": {"des": "I wasn't sure what to expect from a Cuban fusion spot. I went in there with an open mind and I was blown away. When we got there, we were greeted by the owner, Juan. Very nice and chatty guy. He told us about the history of his family restaurant, which made our experience come full circle. <br><br>We had the Cuban sandwich. The twist on it with the plantains on it was pleasantly surprising. It was delicious. We also had empanadas. Shredded beef, shrimp, and a guava with cheese. Delicious.<br><br>They have a waffle slider and a jibarito slider that we were told is a Saturday thing. The waffle melts in your mouth and the chicken was seasoned to perfection. I would go back just for that if it was the only thing on the menu. <br>Their hibiscus lemonade was very refreshing. <br>The only thing I didn't care for was the Cafe con Leche because it was too sweet for my taste, but my fiancé loved it. <br><br>We will definitely be back in the near future.", "pics": null}}, {"review": {"des": "Yelp used to have an option to order from Nini's Deli online & pick-up in the store. Well, I ordered a sandwich online & showed up to quickly be informed that Nini's Deli actually did not take orders from Yelp... What could have been a frustrating/disappointing experience was quickly turned around by the amazing staff at Nini's Deli. Not only did they rush my order so I was still able to walk out right away with my meal, but they threw in a free lemonade & avocado for my sandwich!<br><br>The ability for them to go above and beyond on customer service really entices me to be a repeat customer! But it wasn't only the service that was noteworthy.. the FOOD was delicious too! I ordered a sandwich that was on special for the day that had eggs, steak, avocado, cheese and some other toppings. It was large, savory and delicious! <br><br>Amazing sandwiches, affordable prices and INCREDIBLE service! <br>What more can you ask for in a deli?!? <br>I'll be back, Nini's!", "pics": null}}, {"review": {"des": "Such an amazing find!!!! Delicious food and even better service if you can believe it. I want Nini's to cater my wedding and I want Juan to be the groom! Thank you for the empanadas and smiles. You guys are fantastic.", "pics": null}}, {"review": {"des": "Small, little family owned Cuban sandwich place with great food. A very welcoming place with a friendly owner. The special Kitchen Sink sandwich rocked and the tostones were cooked perfectly brushed with garlic and served with a chipotle mayo sauce. <br><br>They don't deliver so it makes coming here feel even more special. And situated on this residential corner next to a pizza place, it reminds me of some place you'd find in NY just kind of tucked away.", "pics": null}}, {"review": {"des": "Friendly. Delicious. Amazing place. Love the music, food and Vibe. Keep up the good work.", "pics": null}}, {"review": {"des": "I took my original reviews down due to someone's not liking it and passive aggressiveness. When I post reviews it isn't to be malicious or in an attempt to sabotage. My honest opinion is this place is for yuppies. It isn't authentic and it's overpriced.  The spices are lacking severely. The El Cubanito had zero flavor. The only potential was the thin slice of turkey I added for an additional fee. The empanada was lacking flavor as well. I just didn't like it all. And when I spend $17 I think I deserve something worthwhile. Won't be back.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/f91UnUgj655g6Jx9w_Is1w/168s.jpg", "caption": "Empanada"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/UhryZKw4HKSUkY7o9EScIA/168s.jpg", "caption": "El Cubanito"}]}}, {"review": {"des": "Amazing  best way to start the day off. The food is is breathe taking. Had a few empanada but need to back try more.", "pics": null}}, {"review": {"des": "DELICIOUS empanadas! Also I don't think I've ever seen an owner/staff get so excited to serve us their food before. Juan was STOKED to tell us about his empanadas and the restaurant, and we were stoked to eat them. We had the shredded beef and the guava/goat cheese empanadas and they were both fire. Will def come back next time I'm in Chicago.", "pics": null}}, {"review": {"des": "This place is a true gem! I can't stop thinking about it. I was craving a ropa vieja sandwich and used Yelp to look for one near me. Luckily, Nini's is super close to my work. I saw all of the wonderful reviews and menu and knew I had to go. Nini's is located in an inconspicuous corner building. I wouldn't have found it had it not been for the people sitting outside. It was PACKED. Not uncomfortably packed but enough that there were very few seats and I knew it was going to take a bit. So I don't recommend going if you're in a hurry (or order ahead if you are). I waited in line to place a to-go order at the cash register. Plenty of time to take in the surroundings and the menu. Nini's has a fun and lively atmosphere. You can tell people are enjoying their food and looking forward to it. I ordered a media noche sandwich (turkey, an egg patty, cheese, pickles, etc.), a beautiful iced cafe con leche with whip cream and cinnamon, and the special: a goat cheese and guava empanada. The owner is as lively and pleasant as everyone has mentioned. It's amazing how he is able to make you feel really special ,as a customer and get your order in.<br><br>I got my order in and hung out for probably 10 minutes or less. I had to eat back at my office, but man was it good. Everything was perfectly cooked and flavorful. The media noche was HUGE. I ended up eating only half that day and half the next (I toasted it and it reheated great!). <br><br>I will be returning...hopefully to eat in the restraunt.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/bUhAaIRIXIqle8BHiUU1KQ/348s.jpg", "caption": "Goat cheese and guava empanada"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/HPUrUegjYJ-Z5pH2KyJ60w/168s.jpg", "caption": "Media Noche again"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/pbUon0CRFUFcY9SjX3e5Gg/168s.jpg", "caption": "Media noche sandwich- turkey, egg, cheese, pickles, etc."}]}}, {"review": {"des": "Nini's Deli is a true delight! Bustelo Cuban coffee in Chicago - Heaven! Sandwiches and Empanadas amazing! <br>Their version of cafe con leche is delicious! The staff is so friendly. This family owned spot is a must!", "pics": null}}, {"review": {"des": "Let me start off by saying that Juan was the best. I haven't been welcomed into a restaurant by anyone with such enthusiasm and proud to be a part of their family owned business. First time there so  I was very impressed. I tried the cubanito and loved it. I can't wait to go back and try something else.", "pics": null}}]}