{"name": "nomi-kitchen-chicago", "reviews": [{"review": {"des": "I have been here many times and I am never disappointed. The first time was for my birthday (about 5 years ago) and I've been coming here ever since. So this review has been long overdue. <br><br>The most recent time is when I treated my sister in law for her birthday. Went here for brunch.  Their sushi is always amazing and this is coming from a person who is very particular with sushi. Oysters are a must have too! The highlight of our brunch was the GnoMi drinks that was in a gnome glass. It was a refreshing cocktail that was absolutely perfect for brunch! <br><br>One of my favorite restaurants in Chicago!", "pics": null}}, {"review": {"des": "I enjoyed my time here. Service was excellent, attentive without being overbearing, and very kind. We were seated at a window seat overlooking the Water Tower, which was lovely to see as the sun set. The ambience was classy without feeling stuffy, and I felt comfortable being there. <br><br>I had the salmon beignets as an appetizer, and they were quite good. They were warm and fluffy, and the creme that they sat on top of was a nice touch of brightness to offset the richness of the beignets. I found the creme to be a bit too acidic, when combined with the pickled onions that were also included there, but overall quite good. <br><br>For my entree, I had the Duo of Rohan Duck. The breast had a lovely crispy crust, and the sauce was a beautiful flavor. They were moist, if a bit tough. The dumplings, which contained the duck wing meat, were to die for-so moist and flavorful. A surprise treat were the small beets and greens on the side, which were the perfect balance to the richness of the duck. Sweet and retaining the right amount of crunch. <br><br>For dessert, I had a cherry mousse covered in a white chocolate shell surrounded with coconut shavings, macadamia nuts, cherries, and some pandan ice cream. When I mentioned I was from the Philippines, where pandan ice cream is traditional, they included an extra scoop of it on the side, which was a nice touch. It was a very nice dessert-not mind blowing, but the ice cream was very delicious. <br><br>It was a lovely experience, and all the food was good. I give it four stars because I feel as though small details (such as the balance of flavors in the appetizer or the toughness of the duck) should have been better, especially because the of the high price point.", "pics": null}}, {"review": {"des": "Nothing, absolutely nothing, is good about this place. Well, it's pretty and has nice views. But that's it. We stayed for ten days recently and had three rooms. Every day for brunch, the server Lewis was cruel. Giving us a hard time for coming in for brunch at 10:50, when brunch ended at 11. They were still open all day though! He was even rude to my elderly grandparents. <br><br>They try to make the portions \"pretty\" so you leave starving. It's a waste of everyone's time. Go down the street to Allium at Four Seasons or even across the street to RL. Food is so much better. I'll never stay at the hotel again because there's not a good place to eat.", "pics": null}}, {"review": {"des": "Always a favorite spot of ours . <br>Wonderful staff and amazing food . Sit in the dining room and look out over Michigan Ave or sit outside on the patio for a wonderful city view .<br><br>I love to sit at the bar and chat with the bartender and other guests .<br><br>Try the popcorn ! It's delicious !", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Q8Uh_TlRmkXZSdkKoOaPlw/348s.jpg", "caption": "Cheers"}]}}, {"review": {"des": "Stayed at the hotel this past weekend and managed to visit the Kitchen a couple of times.  The first time is for late lunch (technically still considered brunch since it's a Sunday).  I got the chirashi bowl and it was almost too beautiful to eat.  But since I was hungry, that didn't deter me and I finished it all - delicious as it was pretty!<br>The next day we went for breakfast (happened to be included with the rate) and it was another great meal.  The $35 buffet breakfast includes 2 eggs and you can order an omelet too, almost like another entree.  The pastry was good (pain au chocolate, I'm looking at you) and the eggs Benedict entree was also very good.  Service is top notch, as one would expect in this 5 star establishment.<br><br>Oh, and I forgot to mention the view!!  Front and center view of the water tower.", "pics": null}}, {"review": {"des": "Ah Restaurant Week, that time of year when we get to explore fine dining on a dime.  It's not that you don't go establishments like NoMi outside of Restaurant Week, but it is so much fun to explore the menus that the restaurants put together. Because I want to take the Heiress Apparent with me (her first time, but not the last), we opted for lunch to allow her to get back to the dorm to study (Differential Equations & Physics).<br><br>We arrived about 20 minutes early for our reservation, but the hostess was lovely and sat us right away.  We were very lucky as we got the last window seat facing Michigan Ave.  The menu did feature some of the current selections on the lunch menu, with 2 courses available for $22 and $33 for 3 courses (includes dessert, highly recommend it).<br><br>La J and I both had the Smoked Salmon Beignets as our starters.  Lovely dill crema & meyer lemon with the right amount of twang, plus the arugula & pickled fennel.  Because we are so sempatico, we both got the Gnocchi (lobster, tarragon butter, bright lights chard, parsnip) as our second course.  A very lovely balancing act of flavors.  I didn't use any salt and pepper...La J and I both agreed that would have through the balance off. <br><br>For dessert, La J got the caramel apple mousse and I got the Paris Brest.  The caramel apple mousse reminded me of a candied apple.  The out shell looked hard but it was not.  There was this lovely airy mousse with a center of caramel in it.  It reminded me of a molten lava cake with this great fluffy center and a liquid center.  La J loved  it.   The Paris Brest was lovely as well.  Don't be fooled by the black pepper cajeta.  It is traditionally a slow-cooked Mexican caramel sauce that starts with goat's milk...very good.  There was a praline cream and pralinettesx decorating the plate. <br><br>Overall, this was a great Restaurant Week event.   For $33, we got a great deal on our meal.  The Smoked Salmon Beignets were $7 cheaper, dessert about the same as the regular price, the Gnocchi was normally $34 for lunch, but on average it was $11.<br><br>I have read reviews and heard people describe the service at NoMi as being haughty or disdainful.  I am not sure why they felt this way.  I sometimes wonder if people who feel this way feel that restaurants like NoMi are out of their league.  Myself, I have dined here before and always found the service and environment to be friendly and relaxing.  Our server, Gabriel, was friendly, lovely and attentive. The food was simple, but well executed and tastefully done.  The only way this could have been a better experience was if the glasses of Prosecco had been free :-)", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/3HxuEcZ_-4bmoVEEw6C-uQ/348s.jpg", "caption": "Gnocchi (lobster, tarragon butter, bright lights chard, parsnip)"}]}}, {"review": {"des": "Revisited NoMI for Restaurant Week again. This time for dinner. NoMI remains a solid value for lunch. Dinner is still reasonable, but depending on your selections, comparable to normal restaurant pricing. <br><br>My choices<br>PUMPKIN SOUP: I'm normally not one for soup as I find them boring and bland. I was impressed by the soup appetizer last year and decided to choose it again this year. You're presented with a warmed bowl filled with roasted pumpkin seeds. The waiter then serves your soup into the bowl. The soup was perfectly warm and savory - with some crunch from the pumpkin seeds. Solid. <br><br>PORK BELLY:<br>I feel like restaurants always choose pork belly for RW because it's a relatively inexpensive cut of meat and is very versatile. I was served a very generous serving of pork belly that was beautifully caramellized. <br><br>CARAMEL APPLE MOUSSE:<br>This was very interesting! It looked like a solid sphere of jello. Instead, it was light airy mouse enveloped by a thin layer of sauce. A very interesting interpretation of a traditional caramel apple. <br><br>Overall, the ambience and service were good - if not just a touch 'haughty' feeling. The food is simple and tastefully done. I liked last year's desserts much better but I won't stop recommending NoMI for a respectable higher end meal experience.", "pics": null}}, {"review": {"des": "We celebrated our anniversary recently at NoMI Kitchen, and it was all amazing. Everything from the food to the service to the views was lovely.<br><br>We started with a few appetizers, the Deviled Eggs and Beef Tartare, both which were very tasty. For entrees, hubby went with the Angus Strip which was cooked perfectly to his liking, and I got the Rohan Duck which I'm still dreaming about! <br><br>We followed up our great meal with dessert and a glass of sherry and port. Service was impeccable all night, and we hope to be back to celebrate again!", "pics": null}}, {"review": {"des": "We had a couple beers and appetizer (sushi).   Bar tender Toni was great. They serve water in nice heavy crystal glasses and the place is clean and inviting. Highly recommend!", "pics": null}}, {"review": {"des": "We had great service and great food, but a situation occurred that was handled very poorly by the manager Jillian.<br><br>We had a earlier Saturday night reservation (6:45 pm) and I had asked for a window table and been told they were all taken so we were one of four parties at the time sitting at a non-window table. No big deal, we thought \"bummer, maybe next time\" and proceeded on with our meal. <br><br>After being seated though, two of the couples who were already seated at non-window tables transferred to window tables. We figured it wouldn't hurt to ask if we could be moved when two different tables opened up. The manager Jillian came up and told us that there were parties at the bar who were already waiting to be seated at them. Again, no big deal, we thanked her for trying and continued on with our night. <br><br>45 minutes later one of the tables was still open. While we were leaving, half of the six person party showed up. It wouldn't have mattered much to me had she said they were reserved or whatever the case was for why they were holding that table for so long but I was frustrated that as a patron to a restaurant (where i was spending a lot of money mind you) that I didn't deserve to be told the truth and rather was given the runaround by the manager as to why my request my denied. It completely ruined our experience and our night to be so blatantly lied to like that. It's unfortunate that a place such as this would do this to their patrons.<br><br>As well, when I used the women's washroom at around 8pm it was absolutely disgusting. Clearly no one had been in there all day to service it. No toilet paper, towels on the ground everywhere. I felt as though I was at a nightclub, not an expensive restaurant. This place clearly needs some work as far as manager staffing goes.", "pics": null}}, {"review": {"des": "What a view! We went there after their rush hour for lunch/brunch on Saturday afternoon to celebrate our belated anniversary. The host was very nice and asked if we were willing to wait up to 10 mins for a nice seat. We said yes and got the best seat - right on top of the water tower!! <br><br>We were torn whether to get sushi vs. American dishes. We ended up getting a sushi platter and chirashi. Chirash had about 8 kinds of seafood and every piece was excellent. The sushi platter was just as outstanding. I wish the drink menu also shows sake. I didn't think they offer any sake and ended up ordering only sauvignon blanc by the glass they have. It was pretty fruity for sauvignon blanc and it wasn't the best pairing for sushi. Later we learned they have sake by the glass and it was good. <br><br>I can see the outdoor space could be so lovely. It was raining and cold the day we visited but we hope to get back on a nice sunny day and sit outside.", "pics": null}}, {"review": {"des": "This place is great for creative food and an amazing view.<br><br>We came for a late brunch/lunch for my husband and he got their burger and I decided to try the salmon beignets (for a snack). The burger and chips were delicious (so said my husband, I tried a chip and liked the unique seasoning on it) and I really enjoyed the salmon beignets. The beignets were a clever play on a lox bagel. I definitely recommend them.<br><br>If I had one regret about this place it was not trying any of their sushi. I saw several other tables ordering sushi and wished I had ordered some too.<br><br>Just kidding... second regret is ordering a diet pepsi instead of a glass of wine. My soda was $6 or $7 but lesson learned. Never turn down a drink in Chicago!<br><br>Take your time, enjoy the peaceful atmosphere but be ready to pay the premium price. This place is worth it.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/hgwFeIrcsfX7tjzB05sBEA/168s.jpg", "caption": "Burger"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ECMWpq0t0V2ZQGjSK9ggwQ/168s.jpg", "caption": "Smoked salmon beignets"}]}}, {"review": {"des": "One of the best food experiences I've had while living in Chicago. <br><br>First of all, the ambience is perfect. It somehow manages to have a classy yet trendy feel to it so it would be perfect for a date OR a place to take your parents/family. Not to mention that view... <br><br>Second, Nomi's menu has an amazing variety of options (small and large plates, sushi, fish, salads steak...) so there's truly something for everyone.  I personally the spicy crunch roll for an appetizer and the white fish special, which were both divine. For dessert my favorite was the blueberry basil cake-not too big and had a good mix of sweet with herbal notes. <br><br>Lastly, the service is top notch. We had Patrick and he was absolutely amazing. His knowledge of the menu and recommendations were spot on. He also made the whole experience incredibly fun! <br><br>Thanks for a great night Nomi! We live across the street and will be back very soon!", "pics": null}}, {"review": {"des": "A do NOT miss for lovers of sushi, service, and spectacular lake views. <br>Here on business and drawn in by the reviews. But I'm returning for the view! <br>Wonderful unhurried service from Matt. Beautifully presented nigiri in its freshest form. My one small complaint would be that the nori would be better crisp- to balance the velvety uni. And the waiter should return to pour the guest's tea ( as is a polite custom in Japan. <br>The NoMi Benedict started out as a miss: the souvi style poached eggs just didn't feel right. The texture was runny and the yolks did not come up to temperature. But as soon as I pointed out my disappointment to my waiter, Matt, all was rectified immediately. The eggs were poached to perfection. <br>I found this experience relaxing, enjoyable, and very satiating. I will most definitely return.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/_7ykO0p3QpAEim4rydJ0ng/348s.jpg", "caption": "Uni at NoMi"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/jjM2hbUai-IgJhHncZiVuQ/168s.jpg", "caption": "NoMi. Sit indoors and request a table 31-38"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/c_xbWiyLHmts1VAtU98mXA/168s.jpg", "caption": "My view from Table 32 at NoMi"}]}}, {"review": {"des": "We had a nice breakfast here this morning. We chose a table with a view over Michigan Ave and it was just lovely. The space itself is classy and stylish. The service was standard for an upscale restaurant. We had the crab frittata, the eggs benedict with lox, and a side of bacon. The crab frittata was light as a cloud and had a pretty presentation but personally I would have preferred bigger chunks of crab because you couldn't feel it at all. The salmon benny was absolutely perfect to the last ingredient. Bacon was good.<br>To summarize, NoMi provides good food, good service, and great views!", "pics": null}}, {"review": {"des": "For our second night, we had a sit-down dinner in the private dining room of NoMi Kitchen. On arrival, it was nice to walk through the main restaurant and to also see the open plan kitchen which was so beautiful.<br>The food was spectacular and again, great gluten free options. The grape and cheese salad were my favorite and the desserts were delicious, the jalapeno sorbet was my favorite! The wait staff were attentive, informative and at our service the entire evening.", "pics": null}}, {"review": {"des": "We were there as part of a group dinner so this is not likely to be representative of the quality of the place.  We had a beautiful view and a nice set of appetizers passed around.  Lovely attentive service. <br><br>Dinner was a salad followed by chicken or scallops.  I chose the chicken and it was standard fare. Nothing exciting. The scallops were on a broth of some sort and we OK.  <br><br>Not sure about the rest of the menu but I think I will return to try the other items.", "pics": null}}, {"review": {"des": "Don't mi d paying big bucks when the place is right <br>We had a late breakfast here and it was worth it <br>We had the crab omelette which was huge and delicious !!!! Covered by tomato sauce and arugula <br>The cheddar case role was also very good <br>The coffee was expensive but the quality justified it. <br><br>You have to be patient though because food and drinks take quite a while to come out of the kitchen <br><br>I recommend getting pastries by the piece instead of the basket because it's $10 for not so good croissants vs getting one great muffin <br><br>The view is amazing !!!!!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/1foN7YiswLwuVtELHGrq-g/348s.jpg", "caption": "More of our view"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/QTG-2YE8hKs3_gttWVEGzw/168s.jpg", "caption": "Cheddar casserole"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/_Ngl52z7QVUPq8e6nlVPhQ/168s.jpg", "caption": "Crab omelette"}]}}, {"review": {"des": "We went to NoMi Kitchen for a celebratory lunch on Eve of the Eve after a City Hall wedding. The restaurant is very spacious and well lit with tons of natural lighting coming from the large windows. We sat at one of the tables overlooking the Tower and  it was a gorgeous view. <br><br>Service was great - our waiter was very sweet and brought out a bottle of complimentary bubbly for the table. The brunch menu was interesting - half typical brunch foods (think eggs Benedict, pancakes, sandwiches, etc) and half Japanese cuisine (churashi bowls, Sushi). We ordered a bit of both - Sushi rolls for appetizers and Eggs Benedict. The NoMi Benedict was with crab meat and arugula, a yummy twist on the traditional eggs Benedict. We also had their skillet cookie for dessert which was a giant cookie baked in a skillet that was part gingerbread cake/cookie, part ice cream with shaved pieces of whites chocolate. It was dessert decadence! But so yummy we polished it off in minutes and had others looking on in envy!<br><br>Overall a solid brunch spot with great service and great food. I would be curious to see what it's like for dinner when I can try their full Sushi menu. Luckily I've booked a table in two weeks to return for dinner!", "pics": null}}, {"review": {"des": "Sat outdoors for dinner in the garden rooftop patio, not a terribly stunning view but it was nice to just be outside. Patio itself is cute. Service was good. Tried the Tom kahllins cocktail which was delicious. Got sushi which I felt for the quality was overpriced. Wish the fish was a little colder too. I wish I tried the other entree items I'm sure they were better. The dessert we got a melted skillet cookie which was prepared fresh and took about<br>45 mins to make, so worth the wait!! Must try.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/SP8MVtjFiETzo7vbc0PPtw/168s.jpg", "caption": "Freshly baked hot skillet cookie a la mode with dehydrated strawberries"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/-2x73_iLqGCssp4DYBNWtQ/168s.jpg", "caption": "Sakura yellowtail"}]}}, {"review": {"des": "I would probably have to sell some of my organs to visit here regularly but it would be worth it.<br><br>After the wedding we had two hours to kill before the reception and, dressed to the nines, a group of us walked down North Michigan Ave and headed over to NoMI Kitchen to pre-game with some drinks. It is located on the 7th floor of the Park Hyatt hotel and swanky does not even begin to describe it. There are no words. You would have to see the overwhelming room of floor-to-ceiling wine bottles and chandeliers for yourself. We were seated at a Game of Thrones-esque  mahogany wooden table in said wine room and we felt like damn royalty. <br><br>I had the Old Fashioned which was ridiculously-priced but oh so worth it. It was easily the best I've ever had. We also got an order of salt and vinegar popcorn to share over drinks and it was delicious!<br><br>The group decided that the bartender was kind of a grump, but he was nice to me (haha) so I have no complaints! They were irritated by him and his supposed lack of service and attitude, but he was nothing but kind to me so I stand behind my five star rating. Smiling goes a long way, guys!", "pics": null}}, {"review": {"des": "This is one of my favorite places to grab a drink, sit on the patio, enjoy a fantastic meal or celebrate a holiday (The best Thanksgiving dinner place).  Attentive staff and extensive wine list complement the menu for any occasion.", "pics": null}}, {"review": {"des": "I came here for my birthday dinner after hearing rave reviews from my friends and here on Yelp. <br>The restaurant itself is gorgeous, and has great views given that it is only on the 7th floor of the hotel! I liked the fact that we could see into the kitchen also, and see them preparing the sushi. <br>I ordered the chicken ballotine, and my date got the beef loin. It did take quite a long time to come out, but given that it was a Friday night I didn't mind. <br>The chicken and orzo pasta was great! The orzo practically melted in your mouth, and the sauce with the chicken had a nice kick to it at the end. The beef loin was just as good, and my date kept raving about the potatoes, and how well the beef was cooked. <br>The only thing that I did not like here was the service. They were very inattentive, and did not come over at all after we got our meals. Our waters were left without refills, and we were brought the check before even being asked if we wanted dessert. I would be willing to come back again to give the restaurant another shot as the food was good, but the service that we received does make me hesitant.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/JvJ7Mq9aen6EZl0v0iUSIw/168s.jpg", "caption": "chicken ballotine"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ooQxPyFpx9lEoKt_VtOwnA/168s.jpg", "caption": "beef loin"}]}}, {"review": {"des": "Decided to check this restaurant out as we were staying at the park hyatt. The service itself was 5 stars and the food was pretty good. Wife and I ordered a sushi roll, salmon beignets, and the lamb. <br><br>Our bill for two came out to $131 before tip. I tipped $25 making the total $156 (according to math). My credit card statement showed the total to be $256. Upon calling the park hyatt billing department, I was informed that my tip was made to be $125. I assured them I did not tip nearly 100 percent of the bill. They resolved the issue and credited me the $100 without questions. That shady move is the reason for the 3 stars.", "pics": null}}, {"review": {"des": "I ate dinner here with my family tonight and it was amazing!!! From the food to the service everything was excellent. We started off in the garden, which is their outdoor bar, and had a couple drinks and then came into the restaurant for dinner. I recommend heirloom tomato salad, the prawns and the lobster risotto. Our waiter Joe, was so excellent and gave us the best recommendations. So yummy!", "pics": null}}, {"review": {"des": "Full disclosure: I lucked my way into a hotel room that came with breakfast included.  I might not have had as strong of feelings about it if I would have ben paying full price.<br><br>That said, this was a really lovely breakfast.  Service is excellent, and the view facing the lake through the glass walls is amazing.  It looks out over the Water Tower and even the lake.  My mushroom omelet was delicious, but incredibly rich.  I don't think I've ever thought something could use less goat cheese before, but I suppose there's a first for everything.  It came with toast, fruit, and potatoes, all of which were very good.  My friend had the Bircher muesli with a bowl of mixed berries and really enjoyed both.  The orange juice was good quality and they kept the coffee flowing.<br><br>Minus one star because some of the prices are outlandish, even at the Park Hyatt.  That said, I'm guessing this is a really nice spot for a classy upscale dinner, and it's definitely an excellent spot for brunch.", "pics": null}}, {"review": {"des": "Good food. Good views. Good people.<br><br>I've had brunch/lunch here multiple times with family after a church service or just to meet up and have a delicious meal. High quality everything. That goes for the sushi to the drinks to the main dishes. One time I ordered a chicken sandwich with a bacon jam that was absolutely amazing. <br><br>Service is wonderful. While the atmosphere and food is very sophisticated, you never feel as if you are out of place. All my experiences here have been positive with waiters/waitresses doing whatever they can to accommodate a food allergy or seating situation. Always friendly yet classy and professional. Especially since my aunts thought our waiter was cute (cue the giggles) and couldn't get over it lol.", "pics": null}}, {"review": {"des": "Modern, classy space with nice views of the city and great service!  I've had breakfast multiple times and lunch once (so far) at NoMi and everything from the teas, smoothies, breakfast dishes, pasta, to even sushi were so good!  I would order everything I tried again and look forward to my next visit.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/AleIluAPmxO-sbB3cCk1Ow/348s.jpg", "caption": "Carbonara"}]}}, {"review": {"des": "My wife and I have been here many times and love it!  Tonight however was disappointing.  They were not very busy at 6:00 for dinner so we got a window seat which is a special treat.  The sushi was fantastic as always.  I got the grilled octopus which was a very well prepared appetizer.  My wife got the heirloom tomato salad and halibut which was quite good.  I tried the steak tartare which was so salty as to be inedible.  Even the best kitchens will have a mistake but when I didn't eat after two bites the busboy cleared my plate without asking.  The waiter never came by during the meal and when he asked if we wanted desert never asked how the dinner was.  NOBODY asked how dinner was or how our night was.  Very disappointed with the service and one dish.  The other food was as fantastic as always.", "pics": null}}, {"review": {"des": "We chose to visit this lovely restaurant right out our back door for the first time during restaurant week. When we arrived we were seated in the middle of the restaurant. We told our delightful waiter, Joe B.,  that we were neighbors and that we hadn't visited NoMi before. Just so happened he had a lovely window seat open up overlooking the Water Tower Park and he moved us to this gorgeous table (fabulous customer service!!!). We decided to forgo to restaurant week menu and explore the amazing taste sensations on the menu - and we were so pleased we did! We had a fabulous dining experience ranging from an amazing butternut squash salad, delectable sushi to a slice of chocolate heaven. We had the best dining experience in a long time - and Joe is our new favorite neighborhood waiter!", "pics": null}}, {"review": {"des": "The interior space is just beautiful - the lounge is very clean and relaxing. You get a fantastic view of Mich Ave and that, alone, was worth the price. <br>For the meal, we shared food and ordered the Eel Cucumber Sushi & NoMI Futomaki Sushi and Caesar Salad that had fresh fish on top. The sushi was good because of the fresh fish. The sourdough croutons on the salad were /so/ good and had a perfect crunch to them. The fish was a tad on the saltier side; however, I still thoroughly enjoyed the salad.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/heT56Dv4naysVqfKJIe9ww/348s.jpg", "caption": "Interior (open kitchen)"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/GwjMH_VnsjqfBZ8ADwU9Iw/168s.jpg", "caption": "Caesar Salad with sourdough croutons & fresh fish"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/wQYWdmQPN7ZoTow1CcZ3rQ/168s.jpg", "caption": "Eel Cucumber + NoMI Futomaki Sushi"}]}}, {"review": {"des": "Great service.<br>Lovely view.<br>Fine Bellini.<br>And do not sleep on the Crab Benedict. So freekin GOOD!<br><br>And great staff, they were not at all annoyed by my request for dozens of photos", "pics": null}}, {"review": {"des": "I came here on a weekday when the weather was very nice in Chicago for a nice little lunch with my hubby as we wanted to enjoy the last of this summers nice weather and we had a great time. Around noon it was pretty empty and by one pm it was getting pretty packed so you may want to make reservations especially if you come on a weekend. To start out we got a few glasses of rose which was nice and crisp and definitely delicious. Our server was pretty attentive throughout so that was nice that you can expect good service here.<br><br>The food is a little pricey from $18 for a pastrami sandwich to $28 for a little lobster roll sandwich. We got a few sandwiches and everything was tasty and very carefully presented. Like many have said before me you do come here for the view with a hefty price tag but I can't say that the food was bad. It wasn't remarkable but it was tasty and I definitely enjoyed the atmosphere and food enough to warrant a trip back here.<br><br>I wasn't sure if I was going to get dessert but they had a dark chocolate mousse bomb and I absolutely had to get it and so glad I did. It was amazing and my favorite thing here so who knows next time I may just come for wine and dessert after lunch somewhere else. <br><br>NoMi definitely impressed overall and I want to come and sit inside or at their lounge sometime in the winter time also overlooking our absolutely beautiful city. Nomi is my homie.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/-1PuGNCs0h7_dhutEYFVQA/348s.jpg", "caption": "Amazing chocolate mousse dessert!"}]}}, {"review": {"des": "In town for a conference and had dinner here with two friends.  Beautiful open space with high ceilings and floor to ceiling windows.  Being seated next to the windows gave us a lovely view of the city but was a bit chilly.  <br><br>Started with some sushi rolls and brussel sprouts salad, very good.  I had the salmon, which was very nice, fresh and perfectly cooked. My two friends shared the osso bucco, a huge piece of meat, tender and flavourful.  <br><br>After all that, we managed the sorbet trio for dessert.  The spiced pear was especially delicious.  <br><br>Service was efficient and attentive.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/5YSdix7WDIJ8iIULNcDDVA/348s.jpg", "caption": "Trio of sorbets for dessert"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/-OMnSgneR7doP2bjlQJ9gQ/168s.jpg", "caption": "Osso bucco for 2"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/iFMIAAj1wyOX21Xp6WMzFw/168s.jpg", "caption": "Salmon perfectly cooked"}]}}, {"review": {"des": "Fresh, delicious sashimi.  Wonderful service.  Spectacular view of the city. Need I say more?", "pics": null}}, {"review": {"des": "The weather outside was bitter cold, but not the staff! We arrived at approximately 8a and was greeted with a warm hostess and friendly waiters. My selection included a crab frittata, kale, lemon, pineapple, and ginger smoothie, as well as chicken sausage. Everything was as phenomenal as the view from the table looking down to Michigan Ave. Our drinks were always filled, and we never had to ask anyone to come by, as they were always a head turn away. Our early arrival yielded my family top notch service, as we were the only patrons at the time.", "pics": null}}, {"review": {"des": "My best friend and I came here on a Sunday for a birthday brunch. The space inside is beautiful. The lounge is laid-back but polished, and the actual restaurant space is nicely laid out and has a great view of Michigan Ave. For the meal, I ordered the Nomi benedict which was with a crab salad. The eggs were perfectly poached and the hollandaise sauce was different with a sweeter kick to it. I love benedicts and this was one of the best I've had. My friend got the bara-chirashi and she really enjoyed her dish as well. The only complaint about that dish was that the octopus in it was overcooked and chewy. The rest of the seafood in the bowl was perfect though. <br><br>To top it off, we ordered desserts which we were really looking forward to and we were certainly not disappointed. We got the basque cake and the skillet cookie. The basque cake was light, a bit fruity, a bit crunchy and a bit sweet. It was beautifully put together and delicious. The skillet cookie was out of this world. The cookie was almost like a pie and was a fine balance of sweet, salty and slightly crispy. We also got a complimentary cookies and candies birthday platter. That was a pleasant surprise and the items on the plate were all yummy! <br><br>The drinks we ordered, both alcoholic and non-alcoholic, were crafted well and worth the price. The waitstaff was friendly but not overbearing. Overall, both of us loved Nomi and can't wait to go back!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/S6k5qz-3TLBIKoQftir-vA/348s.jpg", "caption": "Skillet cookie"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/3FBIyNHzHEUlI2-SQM_KxA/168s.jpg", "caption": "Basque cake"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/xt7v4TFEtAfR1yPSvctIJA/168s.jpg", "caption": "cookies and candies platter"}]}}, {"review": {"des": "Excellent for late afternoon cocktails and oysters. The oysters were served with the classic mignonette sauce and a delicious cucumber sauce. That cucumber sauce was something I am going to try an replicate. It was cucumber, vinegar, lime, herbs and perfect with the oysters.<br>Breakfast also excellent. Great brioche french toast and perfectly cooked bacon. Love the hotel, Park Hyatt, and NoMI,", "pics": null}}, {"review": {"des": "We had a ladies dinner here. Outdoor seating is first come first serve so we were lucky enough to find outside and cancel our inside reservation. We had a great night with perfect weather, awesome food and great staff. I would definitely return. Drinks were good too.", "pics": null}}, {"review": {"des": "Came here for restaurant week for their lunch menu. For $22, this was a great deal. Three course menu, and everything we had was really great. I also LOVE the large windows overlooking Michigan. It's such a great location!<br><br>I loved the Restaurant Week menu so much, that I actually ended up returning around a month later for lunch, and actually thought it was worse than Restaurant Week. I don't know if its because they came up with a new menu and took items from the dinner menu, but it was DEFINITELY better. And obviously, cheaper.<br><br>I love the Restaurant Week lunch deals, because at $22 they are really a steal, and this is one of the good ones!", "pics": null}}, {"review": {"des": "This special little place is tucked into the Park Hyatt with a beautiful view over looking our busy Michigan Ave. I was here for a birthday dinner and the food was outstanding from start to finish. The atmosphere is relaxed formal, with a quite dining room and beautiful bar area. <br>They have amazingly crafted cocktails. I ended up ordering the 'Mr. Grey' -- gin based cocktail. It was Very good but not overwhelming. We ordered the Park Board (charcuterie) & the king crab appetizer which was absolutely delicious. The crab was cooked perfectly and the dish was sensational. My date ordered the scallops and I indulged in the lamb. The scallops were some of the best I've ever had in the city with artichoke and potato. The lamb was again cooked perfectly and was just as delicious. Our waiter took excellent care of us and I was very very full by the start of our entree.  I was coerced into ordering dessert for it being my birthday. The chocolate ganache was heaven, which I'd had only two bites unfortunately due to having over ate, and my date ordered the goats milk dessert, which was a little too rich for my liking. We had a wonderful meal none the less. I can't wait to come back and do it all over again.", "pics": null}}, {"review": {"des": "Fancy fancy with mediocre food.... (3.5/5) <br><br>NoMI is located within the Park Hyatt and the staff will treat you like royalty. <br>The service was amazing. Well, I guess it wasn't too packed either on a Saturday morning. <br><br>*FYI- brunch is only serviced on Sunday's<br>*FYI- Outdoor bar seating avaliable (phenomenal views) <br>*FYI - Indoor seating by the full length windows = perfect view of the Water Plaza<br><br>The food was mediocre and on the pricey end. I definitely felt that we were paying for the views over the food.<br><br>DRINKS:<br>+ P E P P E R &  P I N E : was delicious and a drink that I would come back for. <br><br> S A L A D S: <br>- ordinary salads that are overpriced. The chicken that comes with the salad was tender and fatty. The dressing wasn't anything special.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/WidniXbBJjLB4CeSAS43fA/348s.jpg", "caption": "Bread basket"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/6qXQ_EcWd0h2OPPPr9uOmw/168s.jpg", "caption": "Salmon avocado roll"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/9VHWC1nukmcNB6Q0T5zF8g/168s.jpg", "caption": "Grilled chicken and avocado $21"}]}}, {"review": {"des": "Hotel restaurants have come a looong way and NoMI is an excellent example of a restaurant that could easily stand alone without the Park Hyatt attached.   My favorite meal here is breakfast because they make it so special.   A fancy dinner, not my cup of tea but a swanky breakfast with beautiful views, spectacular service and top notch food...yes please.  The NoMI Benedict with extra arugula and a side of zucchini bread is morning heaven.  The mushroom omelette is also great but you have to be a fan of shrooms because they are not shy with them!  A bloody or mimosa and you pretty much have made by day.<br><br>The one silly thing about this restaurant is the name.  Could we not have been a bit more original than naming it after North Michigan avenue?  Wink, wink!", "pics": null}}, {"review": {"des": "My boyfriend and I enjoyed a nice \"fancy\" dinner at NoMI. It's a lovely hotel restaurant. I wish we could've sat by the windows and seen the view other people rave about, but all the tables were filled.<br><br>Tuna tartare was perfect with a lot of spice. I had the country fried quail with beets and greens. It left me a bit underwhelmed because I wanted more quail, but it was still good regardless. My boyfriend had the sea bass, which he thought was average. For dessert, we had some type of ice cream crumble with cherries and sesame. It was amazing! My boyfriend did not like it. That was fine; more for me!<br><br>Service was great. Our server was a well mannered older gentleman with occasional wandering eyes.", "pics": null}}, {"review": {"des": "Really slow service and all the food was quite bland. come for the views and not the food!", "pics": null}}, {"review": {"des": "This restaurant has really taste food and a wonderful view", "pics": null}}, {"review": {"des": "Stunning views of the city at night! A Great place to dine overlooking the downtown area of Chicago! There are two options. One is outside on a rooftop casual patio setting with views of the city . Very lovely but also and maybe more impressive is inside with views overlooking the Water Tower building. So romantic!! The couple next to us just got engaged <br><br>The executive chef Ed Sura hit a home run with the dishes served up tonight! My hubby and I are staying at the Park Hyatt and decided to give the hotel restaurant a try. So happy we did! <br><br>Salmon - excellent! Southwestern flavors of corn, black bean and salsa verde. Beautiful presentation. <br><br>Summer squash - pickled sauce. Yes! Now I get it. The chef Ed came out to share his secret flavor technique - pickling. I will buy his book on how to! <br><br>Dessert- not to be overlooked but somewhat shy on sugar. More for the fresh and light palate. Raspberry dark chocolate torte with a chocolate chipotle sauce. Very pretty presentation. I prefer sweet so this was not so much but I still enjoyed it. <br><br>Wait staff was prompt and friendly, but not too pushy or hovering. Overall fine dining at its best!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Kch78AZFKd2NS4PeZEutJA/348s.jpg", "caption": "More views of roof top dining"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/MSmVOgy2Z9Z0zz6QP22cNA/168s.jpg", "caption": "Moon  on patio"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ZCeaD6Iw-ico4KOv7j_7TQ/168s.jpg", "caption": "Salmon"}]}}, {"review": {"des": "Decent place for Sunday brunch. We opted for the outdoor patio, which made for a pleasantly sunny (if windy at times) dining experience. <br><br>There's a fairly standard selection of brunch items along with some sushi options. I opted for the smoked salmon eggs benedict, which I thought was decently tasty. Our table also split the NoMI sushi platter. Although the fish was fresh and cut well, I would have liked to see some more interesting fish selections, instead of your run-of-the-mill sake, maguro, unagi, ebi, etc. and I thought it was a tad pricey at $78. However, the other menu options are actually quite reasonably priced. <br><br>Service in general is rather casual, but our server was friendly and fairly attentive. However, the pacing of the meal was inconsistent and there was an uncomfortably long wait for our entrées. To their credit, we were offered a complimentary dessert as compensation, which we declined as we were full.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ae6fw5t8IXR_Kdkdq35KzQ/348s.jpg", "caption": "Outdoor seating"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/BIRkEHYIVRzGB4yseKvesQ/168s.jpg", "caption": "NoMI sushi platter"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/WJ0OVWYGoDwKCn3u2jcN-w/168s.jpg", "caption": "Smoked salmon eggs Benedict"}]}}, {"review": {"des": "Amazing CS by the host, waiter and buzz staff. Food was delish, drinks up to par. Enjoyed the view and the chilax atmosphere, although our waiter seemed to be too busy and not too chill, but attended to us very well. Would love to come back and try other items on their menu.<br>Some may find this venue a bit pretentious, but I loved the decor, comfy chairs and service. Although you'd definitely spot the fake lip botoxed middle aged female dining on her own there, as well the Asian tourists staying at the hotel or shopping at Michigan avenue and taking a tea break.", "pics": null}}, {"review": {"des": "Came here for Restaurant Week lunch, and unexpectedly became a fan of NoMI in the process!<br><br>NoMI is a beautifully designed space lit by plenty of natural sunlight, which I always appreciate. 3 out of 4 in my party ordered the grain & avocado bowl followed by the smoked chicken risotto. I found both to be delicious in taste and texture contributed by the farro in the grain/avo bowl as well as the pieces of chicken in the flavorful risotto. My vegetarian friend also ordered the sweet potato soup, which had an interestingly spicy kick to it.<br><br>Would return to try more!", "pics": null}}, {"review": {"des": "My friends and I went to NoMI to grab a quick bite hoping that the patio would be open and the beautiful weather in Chicago would be in full glory.  Naturally, the weather is fickle and we found ourselves indoors in a very fine dining environment when we were not quite ready for that. It was our fault, but nonetheless we ordered a few dishes and had Limited time before we had to catch a show. Next time, I would come with plenty of time to spare, for a special event with readiness to spend more money, and order three courses. I split the carrot salad and ricotta ravioli with my friend and it was definitely not enough food for us. The restaurant is designed to be a full fine dining experience which is great because you will not feel too heavy after eating but be prepared to order multiple courses to be satisfied. <br><br>The space itself is very nice and I was amazed with how big it was. I would not hesitate to bring large groups here because I think they would be able to accommodate pretty easily. It is actually a pity that the restaurant does not get more full because the quality of the food is excellent and really does explore unique flavors that you might not expect from a typical hotel restaurant.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/myFGEqVljCUn-BavXe_VcQ/168s.jpg", "caption": "Roasted carrot salad"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/eK01tVt2DEWWIIeT6ZjsAw/168s.jpg", "caption": "Chestnut and ricotta ravioli"}]}}, {"review": {"des": "So I ll start with my favorite thing... the breakfast sandwich. I forget the real name but I could eat it 3 times a week!! As others have said the decor, view, & service are excellent. Food here can be ok to great. It's been years since I had a full dinner here but recently I stopped in for a bite. I had the octopus salad, oysters, & negi toro. I'd say the oysters were the best of there three items. Neri toro was ok but no better than any other place. The octopus salad started out great but then the onions took over and stuck with me all night, just too many.<br><br>It's hard to beat the window view and I know I will be back here again. The food can be great to ok and for the $$$$ spent here it only seems worth it for some things...", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/VfkpsKUWtv4NFcpGKfoKGg/348s.jpg", "caption": "Octopus Salad. Pretty but way too much onion."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/iifjQyHaikPDoSRM-XqVhQ/168s.jpg", "caption": "1/2 dozen East & West coast"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/IBGXtQMXRfJWR2_AaHBAcA/168s.jpg", "caption": "Breakfast Sandwich: Great flavors and satisfying! Would order it again!"}]}}, {"review": {"des": "Came for lunch During restaurant week. Enjoyed the drinks, food and especially the desert (try the almond joy!) Great view and the hotel lobby you enter through is gorgeous.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/8Dxf2Mq6eJfm-jngZSVW9g/348s.jpg", "caption": "Almond joy desert. Amazing."}]}}, {"review": {"des": "The Nomi Garden rooftop bar is spectacular! Their sprits and cocktails are one of a kind. The service is fantastic,special shout out to Ryan ( he made my birthday so special and he is the bomb dignity) 100% recommend the hand cut fries with the garlic aoli! The fries are insanely good! Definitely recommend popping by for an evening drink and some delicious bites!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/vGZxFqm_xYoKmDc4nPz33A/348s.jpg", "caption": "Pimimosa: aka a pineapple sherbet mimosa! It was so yummy and the rock candy  swirl was the perfect touch!  Highly recommend!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/LMb9TMub4cUnmIhMsE3g4A/168s.jpg", "caption": "Baha Blackberry cocktail is very refreshing and a delightful cocktail!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Qzg312mVPSs7l4es3-tb9Q/168s.jpg", "caption": "This cocktail was both gorgeous and delicious! The lavender was a special treat."}]}}, {"review": {"des": "Amazing views, great service, and a sexy little layout! Nomi is a must visit in Chicago. I stopped in for breakfast and it was as amazing as everyone gushes about. I love lemon poppy seed everything and I wanted some of their tea cake, but it came with four slices and since I was dining solo, I asked Besian if I could order a half order and he accommodated me! I was so happy and as soon as I had my first bite, I was hooked! I had not intended to eat both slices, but oh well. After I devoured the tea cake, I ordered the crab Benedict and oh my, it was incredible and rich....just the way I like it. I can not wait to come back for drinks, sushi (I hear it's incredible), dinner, more breakfast, and dessert.", "pics": null}}, {"review": {"des": "Great food, great variety, and greater service.<br><br>For a Chicago downtown restaurant, the prices are very fair for what you get. Strongly recommend a reservation for dinner.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/bDqWhGuYzCD1rPxZhBTp0A/348s.jpg", "caption": "Water tower Park"}]}}, {"review": {"des": "Very diverse menu and great service. Sat outside on terrace and was very nice. Food was delicious.", "pics": null}}, {"review": {"des": "Came here for a nice lunch while shopping on Michigan Avenue. This place is for tourists looking for a view, not people looking for a delicious lunch. The food was okay but it was under seasoned and lacked inspiration. The waiter technically did everything right but without enthusiasm. Every table surrounding us were tourists. This is not a place for locals to stop for a nice lunch.", "pics": null}}, {"review": {"des": "Came here for an anniversary dinner and had a great experience! I made a note in my reservation that we wanted a seat on the glass to get a good scenic view. I was prepared to be waiting for a seat to open up (as we've done when we are at the signature room) but was very pleased that there was a table ready for us with what I think was the best view in the house!<br>It also was restaurant week, which we didn't end up doing (the whole party dining must do the restaurant week dinner) but the deal actually looked very reasonable. <br><br>To start we got a few pieces of salmon nigiri which I think is the best salmon I have ever had to date. The pieces were so thick cut and SO fresh. <br>We also got a small charcuterie board to start which was just ok .. I've definitely had better. <br>I got the chicken risotto as my main course and my boyfriend had the scallops. Both were top notch. We also got a side of the mushrooms with spinach which was good too. <br><br>We got a complimentary dessert as well as we were celebrating our anniversary, which was some kind of layered torte with chocolate and pistachios (I'm guessing??) and a scoop of sorbet. Not my favorite but it was presented beautifully! <br>My only negative comment was our waiter wasn't the most attentive - at the end of the meal I was waiting to order another drink for at least 10/15 min but not the biggest deal in the world. <br><br>I'd say the menu is not that extensive but all dishes sound excellent. Great experience overall.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/P74E7xfMb1gUsv8oF8eiPQ/348s.jpg", "caption": "Excellent view from our seat!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/8cpJz0YoQiPZATSaDZjcxg/168s.jpg", "caption": "Complimentary dessert for anniversary"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/LWZG6eSbeWoLVJ_FiCxrlQ/168s.jpg", "caption": "Chicken risotto"}]}}, {"review": {"des": "Great ambiance. Average food. Terrible service. We were promptly seated with menus and our cocktails arrived quickly, but we then waited 40 minutes without anyone coming over, so we had to get up and go find our waitress (and we saw other people doing the same thing). Our food took forever to come out. When we asked about the delay, we were offered more bread. I get that they may have been short-staffed . . . people call in sick, stuff happens, but good customer service is about managing expectations, so if that was the case, someone should've told us (and, at this nice of a restaurant, done something other than just offering more bread). Dinner was ~$125 per person and took almost 3 hours for two courses. The company was great, so we still had a wonderful evening, but we hadn't planned for 3 hours.", "pics": null}}, {"review": {"des": "Came here for lunch during restaurant week 2016 and really enjoyed my visit. The dining room was bright and modern, with an unobstructed view of the lake and the picturesque water tower. We started with the lobster bisque & celeriac soup. While both were deliciously flavored, I thought the texture was too watery. I also did not like the combination of lobster and mango. <br><br>The entrees were excellent: my black cod was delicate with super-crispy skin. Colleague's veal cheek was melt-in-mouth tender and juicy. We both ended with the beautiful huckleberry bombe which was tart and sweet at the same time, tasted as good as it looked. <br><br>Service was attentive throughout though we thought the pacing was a tad too slow. Good for a leisurely lunch, but not so if you have to rush back to the office! But overall the experience was very relaxing and I felt recharged when I returned to work!", "pics": null}}, {"review": {"des": "Great view..great service...classy atmosphere.<br><br>Yes it's pricey.  Now that going in. It is the park hyatt afterall.<br><br>We had edamame and spicey chicken kabobs with tatziki. Which went perfectly with our pinot  grigios. <br><br>2 glasses of wine and our shared food was around $70 and worth it. This is a great place to linger and have cocktails and conversation", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/u6q-79CtxcAdQdlVpUfIxw/348s.jpg", "caption": "Spicy chicken kabobs with naan..chili sauce and tatziki"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/x_5fioXu19Xhd8q7vx87tg/168s.jpg", "caption": "Edamame"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/acZSLmnXy-0piorH0hezHA/168s.jpg", "caption": "Gorgeous bar area  The views are lovely and the service is first class"}]}}, {"review": {"des": "One of the best spots on Michigan Avenue.  Great views of Michigan Avenue or Chicago Avenue (when dining al fresco).  Desserts are out of this world and the luncheon(s) we attend was truly enjoyable.  When in the area make reservations and check our Nomi.  Cheers!", "pics": null}}, {"review": {"des": "Late review, but here it goes!  I traveled to Chicago alone for NYE in 2016 and decided I wanted to have a nice dinner.  Enter NoMi with their coursed meal. Overall the experience was really great.  The service was absolutely top notch, the atmosphere was phenomenal and the food was good.  It is four stars because I have eaten at other similarly priced restaurants in other cities where the food may have been just a bit better.  I don't know that I would come back for dinner, however I would stop by the bar and possibly get some light food.  Service and atmosphere make this a four star experience though!", "pics": null}}, {"review": {"des": "This is a cute place for fine dining and ultimately a beautiful view of the city. I came here on a Saturday around 1:00 pm. It wasn't packed, maybe around 8 tables were full. There were certainly just as many bus boys and servers as there were people dining. Parking is not easily accessible if you're not staying at the hotel, you have the option of valet or there's a garage nearby. <br><br>I highly recommend making reservations ahead of time to avoid waiting. We were actually running late to our reservations but we called in advance and let the staff at NoMi know, they were very accommodating. One thing I didn't like is that they didn't have a great appetizer menu at all. In fact, they couple the salads and starters and if you're from out of this country, you may have a hard time making a distinction between the two. I thought the appetizer menu was extremely limited and lacked variety. I was pretty disappointed for a lunch menu. We dipped straight into the main dish. I personally love anything shrimp Tempura and I asked the waiter what he considered to be the best sushi and he recommended the tiger sushi. I had the tiger sushi, which is shrimp tempura, snow crab, spicy big eye tuna and avocado. I have to say, I was really disappointed. It was spicy but it lacked a savory flavor that left its trace in your mouth. It lacked that additional umpf That sets it apart from, let's say, Mariano's sushi. If the waiter considered that to be the best, then what does that say about the rest of the sushi? Anyways, my mom had the Skuna Bay Salmon with Tomatillo salsa verde, black bean, sweet corn chow chow. My mom literally said to me, \"I should've eaten before I came here\" because the portions are really small. I did remind her that this is fine dining. She said that her salmon was half cooked half raw, were not sure if it's suppose to be cooked that way but for $38, she ate it. She thought that the side should have been better because the sweet corn chow chow was a joke, not even a child can get full off that. She loved the glaze and the presentation but that is literally all we paid for. My moms friend had the grilled Korean Shortribs which is Basmati Rice, kimchi, pea shots, sweet soy glaze. Lol, once again you're paying for the view and the ambiance, not the food. We were lucky if the ribs had any meat on them, that's how thinly cut it was. The glaze itself was spicy but overall, the ribs lacked meat. The rice was what kept my moms friend full because the kimchi and peas did not do the meal any justice.<br><br>You can go but don't say you weren't warned about the portions.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Im1SWtHicCya2PMTsszbaA/348s.jpg", "caption": "Menu"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/KF2yUfmKr58nQ-i2oGWNHg/168s.jpg", "caption": "Menu"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/d76T8IAfvNcSrqW0v3gaiw/168s.jpg", "caption": "Skuna Bay Salmon"}]}}, {"review": {"des": "This classy restaurant is located in a Building with a Hyatt hotel and high-rise residences. The restaurant overlooks the Water Tower on Michigan Ave and makes for a gorgeous view, especially during the golden hour. <br>I have a friend who has been here many times since her in-laws live on the 58th floor. She said she once bumped into STING here, so naturally my first experience here was a huge disappointment when I went and he wasn't there!!! Kidding. But the fact that Sting was there says a lot. <br><br>I went to NoMI for the first time with my best friend on her birthday. Each entree was a dreamy combination of healthy yet extravagant. My best friend is gluten AND dairy free which can be challenging when eating out, but this wasn't a problem at NoMI. Our server Tom was friendly and more than accommodating. My friend and I asked for non-alcoholic options since it was a Tuesday night. The first thing Tom suggested was a specialty strawberry ginger brew with fresh mint. What?! Little did he know that my best friend and I are ginger brew connoisseurs! We each ordered one. BEST GINGER BREW TO DATE. <br>For the entree I ordered the sushi. It was glorious. Even though I was about to burst after gobbling it all down, I ordered a small flourless chocolate cake for dessert and it was the perfect way to end the meal. <br>NoMI was a wonderful experience, I have no complaints. Except that Sting wasn't there. ;)", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/qCuP3A3JASOP7xGaXuGDwA/348s.jpg", "caption": "Flourless chocolate cake with rich chocolate syrup, summer berries, and edible flowers"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/-rKfjk3qU1F1HjT-buY95Q/168s.jpg", "caption": "View after sunset"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/5IrvOWKCdee8biLGYejfgw/168s.jpg", "caption": "Surprised I paused to take a picture- such good food!"}]}}, {"review": {"des": "NoMI's rooftop is AMAZING for a nice Friday afternoon lunch, especially in the summer or fall. The view is fantastic but the food.. is pretty average. <br><br>I had their shrimp and quinoa salad which wasn't flavorful. I know it's just a quinoa salad, but perhaps I had high expectations coming in. My friend had one of their lobster plates, but agreed it wasn't anything special either. For the food's price point, I expected more.<br><br>I'd come back here in the summer for drinks/appetizers on their rooftop, but their food isn't something I'd particularly crave or miss.", "pics": null}}, {"review": {"des": "Sunday Brunch is always better with a nice ambiance. <br><br>I ordered the scramble, while my friends had the salmon benedict (very tasty). Our wait staff were very courteous and friendly.  The brunch prices here are a standard if not a little cheaper than expected for a hotel breakfast. <br><br>I will be excited to come back here for dinner, as the people watching from the glass wall dining room would be perfect during the evening.", "pics": null}}, {"review": {"des": "One of my favorite spots in town. Great sushi and fantastic menu. Perfect spot for most occasions. They also have a great lounge!! My go to place in Chicago. <br><br>Highly recommended the spicy tuna, sashimi, east & west oysters...I could go on and on. Short rib is perfect!", "pics": null}}, {"review": {"des": "Very expensive but iconic views of Michigan Ave (sit by the window) make it worth a visit, especially for an evening dinner during the holidays when there's lights and decorations. The food was very good. We really liked the pumpkin soup, beef tartare, and rack of lamb. All were delicious! Our server, Michael, was wonderful too.", "pics": null}}, {"review": {"des": "We had a great lunch at NoMI. A corner table overlooking Waterpower place can't be beat. The emphasis on lighter fare, sushi and fish makes for a healthy lunch. \\<br><br>I had TJ's Farm Chicken at the waiter's suggestion, and it was one of the best chicken dishes I've ever had, with a perfectly crisp skin and moist, succulent meat. The accompanying herb crumbs were heavenly.<br><br>The wine list is really well thought out, and if you're willing to spring for a nice bottle, there are some excellent choices. They even have Madeira by the glass. And Madeira goes with everything (even spiny tuna rolls, it turns out!)<br><br>Service was friendly and efficient. A great place for a relaxing and tasty lunch.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/5ff5uoylIDLj_wZQ7VcYOA/348s.jpg", "caption": "Chicken"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/GUDTw71l4lME3P6VLRlY4Q/168s.jpg", "caption": "Sushi platter"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/WKa5jO98mOx3pl5Ksz3AZg/168s.jpg", "caption": "Pretzel bread"}]}}, {"review": {"des": "I came here a couple weeks ago during restaurant week.   I had been here once for dinner and had a spectacular meal, so for $33 and a three course lunch, you couldn't beat the value at this high end restaurant.  I arrive during the latter part of lunch to avoid to hectic lunch crowd.  <br><br>My server notices I'm dining solo and offers me a newspaper.  Little does he know I'm really here to take three thousand pictures of the food and jot down a bunch of notes to get it back to my yelp family.  The Malbec listed under wines by the glass was very smooth and delightful.  Excellent choice.  The server even tops off my glass and let's me finish the bottle (maybe he notices my Celinè bag sitting next to me in anticipation of a big tip)... (considering the table next to me had a group of college students with overstuffed backpacks - something I never expect to see here on any other day, and the table in front of me is filled with a husband, wife, and a loud baby in a child carrier with a strange looking cloth).  I was hoping to see my reflection in the wine glass and make funny faces, but whomever wiped the wine glasses down left towel dust particles on the glass.  <br><br>First comes the soup.  Celeriac and truffle soup, with potato bouchon, smoked apple jam.  It is warm, creamy, but not too thick.  The sweetness from the apple complements the soup, but there's too much of it, and therefore, it seems a bit out of place.  If you were to close your eyes and eat the soup you might think Campbell's.  I'm thinking maybe it needs salt.  Nope.  Didn't help. <br><br>I choose the veal cheek.  Cabernet Sauvignon braised veal cheek.  It is placed onto of a green pea cream, toasted parsnip, and baby carrots.  Visually pleasing.  The plate is hot.  Nice.  Soft.  The meat melts in my mouth.  This reminds me of a home cooked stew that been a secret family recipe for years.  I feel like a lot of thought had been put into the dish.  I am smiling.  The pea puree is vibrant in color and tastes very fresh.  <br><br>I look over to see that the hostess is feverishly rubbing her nose, sees me looking at her, and completely shies away and stops.  Haha<br><br>Alas, my always favorite part of the meal.  Dessert.  I love the way the open dessert station s close to me, and I watch the pastry cook completely focused on making each dessert beautiful, all the while opening and closing little containers of each component and appearing very detailed to both the individual dishes and working in a timely manner.  I am proud of her, and appreciate her meticulous nature.  2015 Chicago Rising Star Pastry Chef Greg Mosko heads the pastry team, and I'm looking forward to seeing his creation for this week.  Huckleberry Mousse Bombè, coriander financier, caramelized pear, micro greens, candied coconut, coconut gel, meyer lemon center.  The mousse is light, the financier is moist and used as a base for the mousse.  The gelatin gives it a nice sheen.  The sourness of the lemon complements the huckleberry mousse as well as the bits of huckleberry on the plate.  The coconut chips add crunch and texture and have citrus zest bits which add flavor.  The accompaniments of the chopped stone fruit and coconut cream really pull the whole dessert together.  This is not overwhelmingly sweet, which in my book is the most important.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/WcEVkZxSdkNxd3qPjdWfIQ/348s.jpg", "caption": "Celeriac & Truffle Soup, potato Bouchon, smoked apple jam (more like chunks) ... Meh"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/AhukX7GR2bPHS5h-iriALQ/168s.jpg", "caption": "Cabernet Sauvignon Braised veal cheek.  Green pea cream, toasted parsnip, baby carrots"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/LgUUeS6RcelOMEKN4sNqyg/168s.jpg", "caption": "Huckleberry Mousse Bombe, coriander financier, carmelized pear, micro greens, candied coconut, coconut gel, Meyer lemon center."}]}}, {"review": {"des": "An amazing place to have fine dining and wining and a view of downtown as well as the magnificent view inside of the different art they have. Exquisitely taste to indulge even in the most fanciest of fancies I must admit this is a spot worth stopping buy. If you want to impress your sweet than this will be one for the taking in 2018. I love everything they had on the menu. From the sushi to the burgers to the arugulo pasta and pizza; my kind of NoMi or I want to say Yummy town. One drink here I can't remember the name of it but someone suggested I try it that it was like a 300 year proof recipe or something and not many places have this type of drink and well that one was like an awakening of spices galore in a wine glass for me because it really woke me up. A NoMi review of 2018 by yours truly. Believe that.", "pics": null}}, {"review": {"des": "We dined at NoMI for brunch on a Saturday and really enjoyed the experience. I ordered a traditional breakfast of eggs, sausage, potatoes, toast and coffee and found every bite better than the next. The service was very attentive and the view was spectacular. I would definitely dine here again.", "pics": null}}, {"review": {"des": "Another one down for Restaurant Week. I have been to the bar, but have never eaten in the Restaurant. The views are really nice, especially if you score a seat by the windows, which I did! I had the whitefish with the basmati rice and it was really good, but the portion was really small. I hear small portions are typical here, which I am not sure how I would feel about paying the full price of $35 for such a small meal that will leave me hungry, especially when there are so many other places in the area where the food is good, you are guaranteed to get full and get more for your money. Don't get me wrong the whitefish and salad was delicious, but still you are mostly paying for the views and atmosphere. Luckily the entree also came with a salad so it helped to fill you up. They are only a 2 course for lunch where other's are 3 course during Restaurant Week, so no desert is included, which was kinda a bummer because I hear the almond joy bar is really good.  The service is outstanding and you never wait long for anything you ask for/or don't ask for. I also ordered a cocktail, and it was $15. They sell bottled (still) water (Voss) for $8. It really can add up here quickly! My final take is this is a special occasion spot you come to for celebrating, a bring someone you want to impress spot, or a you're rich and spending 100's of dollars on food/drinks don't matter to you spot. Glad I had a chance to experience it for a fraction of the cost, during Restaurant Week.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/EBVZEcqefsKIbuwrH-lFNw/348s.jpg", "caption": "Lemon Drop overlooking Michigan Avenue"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/F2k1pqKKBgRJ0TG1gHOAAw/168s.jpg", "caption": "Lemon Drop"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/q7drrVmNtIpF1MgsHUt2Pw/168s.jpg", "caption": "Caesar Salad"}]}}, {"review": {"des": "Been coming here for years. NoMi is as good a dining experience as any place in Chicago. Impeccable, personal service. Imaginative menu. Excellent execution all around. The Lounge is great before and after, and the deck is a refined experience when available.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/EEcCe4qIxScJvxS_X0Drcw/348s.jpg", "caption": "A typical dinner I've had at NoMI."}]}}, {"review": {"des": "Food was good . My husband ordered the Sushi which he said was really good . I ordered the vegetarian pasta which was good too . The cocktail I had was great too . Again , a birthday dinner which went right . Service was a little slow but manageable .", "pics": null}}, {"review": {"des": "Pretty good - the soup and gnocchi were warm and flavorful but a little one-note.", "pics": null}}, {"review": {"des": "My sister and I came for restaurant week and it is absolutely one of the better places to hit up. Between the two of us, we tried six different plates and all of them were so good that I left saying I couldn't pick a favorite and if I was to do the same meal again, I would have a very hard time deciding which dishes to eat again. I won't go so much into the details of the dish (refer to pictures) just because I don't think the restaurant week plates are on their regular menu but based on my experience here, I would definitely come back again to try their normal menu. All our dishes were gorgeously plated with bright and colorful ingredients. Everything tasted so fresh but without that 'I think I'm eating dirt' taste. You could really taste each and every piece that the chef puts on the plate. I was a huge fan of everything but the Huckleberry mousse bombe dessert was just the most exceptional way to end the meal. The best part was the sour Meyer lemon puree core that really hits you. <br><br>The one thing that was just a little over the top was the saltiness of each dish. I wish they toned it down a little because the salt really added up, particularly in the soup and vegetables which would taste great even without all the seasoning. Other than that, I super enjoyed the general ambiance of the restaurant. I loved that it was brightly lit and overlooks Michigan Ave. I love that the kitchen is out in the open so that you can see what's going on over there. This is truly the perfect place to treat your mom or grandma - they will love it!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/tGO17c4ZXJSggFYN9YOH9Q/348s.jpg", "caption": "Pretzel bread starter with an AMAZING spread"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/86qzYzH4Or2mMobK7HNQGw/168s.jpg", "caption": "NoMi's amazing spread of cookies and candies including a peppermint macaron, peanut butter cookie, and chocolate caramels"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/1LFv8MaKwG_iDfOXUnBAxQ/168s.jpg", "caption": "Beet gnocchi with blue cheese, winter baby vegetables, and caramelized walnuts"}]}}, {"review": {"des": "Dined here for lunch during restaurant week.<br><br>Started with Parmesan encrusted egg and lobster bisque. Egg was nicely soft boiled inside, and lobster bisque was not too rich and pieces of diced mango and bok choy offset a bit of the saltiness of the bisque.<br><br>Unfortunately the saltiness continued with the black cod... The cod itself was cooked perfectly but the consommé poured on top was the culprit. Beet gnocchi was a win-win combination containing goat cheese and candied walnuts. Again the goat cheese was a bit over salted but again the sweetness of the walnuts helped to offset this. The desserts were all visually appealing and delicious. The server was also considerate enough to make up a nut free plate for my sister who is allergic to nuts. He was also kind enough to move us to a table next to the window when one became available.<br><br>Solely based on the restaurant week food (which I always suspect is never as good as the regular menu) I would give NoMi 3 stars. However I feel that this is a restaurant that does have the potential to do much better and I hope to taste it next time I come!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/TEJYYVO2wRHGhkAF-GuaGw/348s.jpg", "caption": "Cookie and Candy Selection (Restaurant Week)"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/6580C4ugdx8G01aF7SzVqg/168s.jpg", "caption": "Bert Gnocchi with Goat Cheese and Candied Walnuts (Restaurant Week)"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/N3LSLDicoDI3Z4XAG51oog/168s.jpg", "caption": "Black Cod with Root Vegetables (Restaurant Week)"}]}}, {"review": {"des": "Had a few time sushi and dinner there this summer. It was very good fresh.outdoor patio good for brunch. Cocktail is exotic.", "pics": null}}, {"review": {"des": "I love love love this place! It's an hour away from me. I read the positive reviews and decided to go for my birthday dinner. Everything was excellent! The ambiance is incredible with a nice view. I like the open kitchen concept. The service was fabulous!! And the food was phenomenal. Their desserts were so so good! Highly recommend this place!!", "pics": null}}, {"review": {"des": "I love the restaurant and the views of course.  I think certain items were overpriced for what you were getting.  Service is on point, I did like my server.  Not sure if I will be back, as there are plenty of other options.", "pics": null}}, {"review": {"des": "Went here for a friend's birthday and I got pretty much what I had expected...tiny plates, lack of options, stuffy service, and an expensive bill. Taste was pretty good but I don't think I'd recommend this to anyone. Even the view was overrated.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/RwzYxHcyYo9GRNMVIeiVjw/168s.jpg", "caption": "This looks a lot bigger than it was"}]}}, {"review": {"des": "Great view of water tower place, open kitchen to watch the chefs do their thing, private art gallery with a Matisse and three Chihuly's and great staff from the valet to the chef. I went here at the recommendation of someone I met at a brunch in Dubai. He raved about the chef (Danny) that had recently departed from Dubai to Chicago to head up NOMI. Not only did we meet Danny but her her gave us excellent service and prepped our meals personally. We had an opportunity to taste some off menu items ranging from veal to cured pork prosciutto (the Spanish version. This place is PRICEY! By pricey I mean $1350 for a bottle of champagne!...But we got every pennies worth. They had a wine room and wheels of cheese, fine art and natural stones, crystals and fossils incorporated in the design. To put it simply, it was amazing! I've never been to a place quite like this.", "pics": null}}, {"review": {"des": "Great food, great view, staff is very polite. Only I didn't like one thing was although almost every table was empty, we were there for breakfast, they still rush us. As soon as I was done with my food they put the check down on the table without asking if I need anything else, and waitress keep cutting my conversation with my friend.", "pics": null}}, {"review": {"des": "I came here for lunch with a friend during restaurant week. I started off with the lobster bisque, which I found to be a little watery. The flavor was decent and I enjoyed the bok choy, but I was surprised to find bits of mango in my bowl! I could have done without it. <br><br>I ordered salmon for my entree, as they were out of black cod that day (what a bummer). The skin was perfectly crispy but the actual salmon was a touch undercooked! I loved the veggies and the consomme was flavorful. My friend's salmon was cooked perfectly and she couldn't stop raving about it, so bonus points there. <br><br>Lastly, I ordered the huckleberry mousse bombe. Absolutely stunning presentation and it tasted just as good as it looked. Perfect balance of tartness and sweetness. I might come back just for dessert!<br><br>The service here was great, and the view overlooking mag mile and the lake is hard to beat. Wish the bisque was better, but overall, Nomi made for a very pleasant experience!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/rke2jfeDkRJ4JTBKODwMCA/348s.jpg", "caption": "Lobster bisque with bok choy and mango"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/8msLJ49SWreemSoQIOin6A/168s.jpg", "caption": "Huckleberry mousse bombe. Amazing!"}]}}, {"review": {"des": "Came here for Sweetest Day. The restaurant was beautiful, our server as nice as can be, and the food was just phenomenal. I would come back in a heartbeat.", "pics": null}}, {"review": {"des": "Had the loveliest dinner here this weekend with my girlfriends. The view is beautiful. Started with perfectly fresh sushi including such a unique vegetarian roll, shared plates of deviled eggs with truffles, salmon beignets and green salad, as well as lamb chops and halibut. Delicious pastries and cheese board. The service was attentive and I love the open kitchen. One of my favorite restaurants in the city.", "pics": null}}, {"review": {"des": "Excellent restaurant in Chicago, one of my favorites. Always get great service. The small menu is regularly refreshed with in season items. The wine list is extensive, however a bit overpriced. <br>Interior design is beautiful, and the views from the window tables are one of the best in the city.", "pics": null}}, {"review": {"des": "I've been coming to NoMi for several years, both before and after they re-concepted. The quality, service and attention to detail have been consistently top notch. <br><br>My first visit was to get drinks several years ago. The location and view out the bay window are awesome.  <br><br>Gone are the days of the white linen tablecloths, but service is still masterful. <br><br>I've been here for the brunch buffet and several lunches, and with each meal, the quality was always great. Most recently I tried an amazing dessert - goat milk panna cotta with earl grey grapefruit gelee, hibiscus poached citrus salad and honey gel/champagne foam - that was perfectly seasonal and oh so tasty. That might be my dessert for 2017. Additionally, I had the farro, kale and avocado salad (ok but hearty), the smoked chicken risotto (nice and decadent in richness) and pineapple tart (I'm a glutton with two desserts!).", "pics": null}}, {"review": {"des": "*** Eggs Benedict + berry bowl + 2 coffees = $50. ***<br><br>Yup, that is pricey.  But it was very well prepared and<br>NoMI's view of Michigan Ave out to the lake is scenic.<br><br>*** So overall a delightfully romantic brunch spot. ***", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/-N8JJ_G_TtKkVsRhn0bAAQ/168s.jpg", "caption": "The View"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/5DQjvYM4pu24IdbaJasiKA/168s.jpg", "caption": "Eggs Benedict + Berry Bowl + Coffee = $50"}]}}, {"review": {"des": "Had our anniversary dinner there, everything was perfect, food, drinks, service and a view were all extraordinary. Joe was our server and he was great. Would definitely recommend it for any occasion.", "pics": null}}, {"review": {"des": "We only had breakfast here so my review is for their breakfast only.  Overall, we enjoyed ourselves.  The ambiance is great.  I loved the view and we had great service.  <br><br>The Care and Healthy smoothies are off the hook.  They are really good.  If you like smoothies I recommend these to try although they are a little expensive.  <br><br>The fresh squeezed juices were so so so they are not a must.  <br><br>The coffees here are also so so so they are not a must either.  <br><br>The buttermilk blueberry pancakes were to die for.  They were so good!  The blueberries complimented the pancakes really well.  I was already stuffed from the Nomi benedict and thought I could only eat a few bites of the pancake, but wow, this was amazing!  This is a definite must order!<br><br>The Nomi benedict was also good, but it didn't wow me.  You can't go wrong with this entree though.<br><br>The Brioche French Toast - Chocolate hazelnut with banana was also really good, but the pancakes were better so get the pancakes instead.  This wasn't amazing, but it was still good, maybe it was the chocolate and banana.<br><br>The Smoked Salmon Tartine with Tomato, red onion, capers, farm egg, lemon dill cream cheese, grilled ciabatta was also good.  It is extremely filling so if you order this, you probably won't be able to eat anything else since the bread is huge and super duper filling!  <br><br>The menu here is very simple, but you can't go wrong with eating here for breakfast.  They did a great job with service and presentation.", "pics": null}}, {"review": {"des": "Living in Salt Lake leaves me with desire to have better food choices. Don't get me wrong, we have decent food but nothing like this. <br>We went for a work function and reserved a beautiful room that overlooked the magnificent mile. <br>Food was top Notch and excellent service from a extremely knowledgeable staff.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/62jUF8aX9iLFuoe6O84_EQ/348s.jpg", "caption": "With a great crew from my work."}]}}, {"review": {"des": "Many friends of mine love NoMi Kitchen. One friend even got engaged here. It's definitely a beautiful restaurant inside Park Hyatt Chicago. If you got seated by the window, the view was unbelievable! Plus, the inside of the restaurant was just pretty and swanky. <br><br>I was sad that platinum in Hyatt didn't mean shit and only Diamond members get to eat free here. We still went because I have been wanting to try. Despite being a restaurant inside a hotel, it is well known to be a destination for people in general to dine there and not just hotel patron because it has been known to be good.<br><br>We just went for breakfast and their weekday menu was definitely simpler than the brunch menu some friends talked about. The menu were pretty much just eggs several styles: Benedicts, scrambled, omelette. There were pancakes, French Toast, smoothies - pretty standard.<br><br>My sister got the scrambled egg with bacon and I had over easy with bacon. The niece got a green smoothie. <br><br>The bacon were so good as they were Nueske's. Of course it would be good. The oven fried potatoes were also so prettily made. At the end of the day, we got just regular breakfast you could get elsewhere fraction of the price. The service was superb and very attentive. It was a very nice breakfast.<br><br>For close to $100 for eggs and bacon, it was hardly worth it. The view and service were awesome though. I guess I better work on the diamond status as if it ain't free, I would just go downstairs and go to Food Life at Water Tower for a $10 breakfast.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/DP6_ujrw7hAu_OOHnqSU_w/168s.jpg", "caption": "View"}]}}, {"review": {"des": "Great place for special occasions. The city view from the ceiling high Windows is great. We had custom sushi made which was great. Admittedly this is not a sushi place, there are many other places that have better sushi. You come here for the experience. We had the Halibut which was great and the desert was absolutely amazing as well!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/axmAHTiTUxIIK1-WIjXjcg/348s.jpg", "caption": "Half eaten custom sushi"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/MXs1txFy_yoAMN-6pr2ZKg/168s.jpg", "caption": "Halibut"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ncqMOT3_ulL0TS_9ExqCRw/168s.jpg", "caption": "Side of Brussel sprouts"}]}}, {"review": {"des": "Fantastic rooftop view!<br><br>Order:<br>Roman Gnocchi***<br>NoMI Burger<br>Black Angus Beef Sirloin <br>Honey Roasted Baby Carrots***<br>Half Dozen Oysters<br>Dragon Maki***<br>Chocolate Mousse<br>Buttermilk Pana Cotta<br><br>***fav<br><br>Great service. We came during lunch and sat outside on the rooftop which has a gorgeous view and the umbrellas conveniently shaded us from the heat and sun. However, it became a little chilly after awhile and the servers were more than accommodating in moving us indoors. The food was great but I was underwhelmed by the lackluster dessert which was quite unfortunate as I concluded my meal on a lower note.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Vchy1lHUKW6T54HvyJJK2g/348s.jpg", "caption": "Roman Gnocchi. NoMI Burger. Angus Beef Sirloin. Honey Roasted Baby Carrots. Oysters. Dragon Maki. Chocolate Mousse. Buttermilk Panna Cotta."}]}}, {"review": {"des": "Great burgers. Nice sushi. Super nice ambiance. Summertime: Can't beat the patio. Brunch is delicious, too. Nice cocktail drinks. Perfect service.", "pics": null}}, {"review": {"des": "I came here after hearing how amazing this place is from a few friends. The atmosphere is gorgeous. Definitely feels like 5 star dining with impeccable service. Great view, and delicious food.", "pics": null}}]}