{"name": "noon-o-kabab-chicago-8", "reviews": [{"review": {"des": "Delicious! The portions were huge and they honored the yelp free appetizer!! #win. I had the vegetarian curry, which was surprisingly delicious but my friends had the rib kebab and the beef kebab. I tried both and the rib won hands down. <br><br>Either way, the portions are huge (including the wine servings) and everything was delicious. If I could do a re-order I'd order the huge sampler platter and just go to town. I will return!", "pics": null}}, {"review": {"des": "With so many awesome kabab choices around me (Pita Inn, Suinik, for example), it's tough for me to drive into the city to get a lunch special. But wait, it's not that far and if you jump on Lincoln Ave to Jersey Ave, it's really easy to get here from Skokie. Plus, they have ample parking, which is important for this busy neighborhood.<br><br>There's a nice, local flair, with many families eating here. I love the art and menu and interior design - you do feel a bit transported to the Middle East, for a brief moment.<br><br>The service was good and if you ask for pita bread, they'll bring it out nice and hot. As a matter fact, the lunch special (and food in general) is presented very well and it all comes out nice and hot. The chicken is really moist and the sirloin and skirt steak are both very flavorful. They have olive oil for your pita and a red sauce for some zing. The tomato is roasted and just right. This all comes with a healthy salad.<br><br>I guess my only suggestion is for the gentleman in the sport jacket to smile and say hi to patrons. The first time, I sensed that he must of been having a bad day. But the second time, I realized that he just seems to have a chip on his shoulder. My advice is, smile a bit or say hello, after all, your restaurant is successful and it'll put people in a better mood to order more food.<br><br>I remember a guy by the name of Bob Chinn who use to say \"hello\" to everyone, he didn't do too bad of a job up there in Wheeling.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/BBD0LySEMkMVoQEgxJ9VPw/348s.jpg", "caption": "Thee lunch special, the dill rice is unabashed in flavor"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ugzaYxgtskxosJsiC-0f7w/168s.jpg", "caption": "Steak on the left sirloin on the right"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/EUPTg5t0znje3uA-VLmjrw/168s.jpg", "caption": "Hot sauce and olive oil"}]}}, {"review": {"des": "5 stars for the food<br>1 star for ONE PARTICULAR WAITRESS (see picture)<br><br>Most of the waitstaff are warm and efficient.  This one particular waitress, who I suspect is a relative, is very pushy and inefficient at taking orders.  My family regularly dines here so we know what we like.  Every time she is our waitress, she tries to convince us to change our order.  Instead of writing our order down on a notepad, she will step away after we order each dish.  If we order 4 dishes, she steps away 4 times!  Sometimes she gets distracted by another table and then doesn't come back for the rest of our order.  Recently I witnessed another customer express frustration at her because she forced a meat dish she recommended on them (they are vegetarian).  It is a real shame that she is horrible at being a server because the other servers and bussers/foodrunners are so great.    <br><br>Regardless of that one issue, the food here is fantastic!  For most, the meat is the star of the menu (and it is very good), but the REAL star is the rice.  Very flavorful, perfectly fluffy.  The best Persian rice I've ever had.  Get the tahdig (yellow crispy rice)!!  The small serving is perfect for 3 people to munch on as a side.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/oRPcc6gXHbXS9ahb_0hUSw/348s.jpg", "caption": "Sorry, this waitress is very pushy."}]}}, {"review": {"des": "Here is what I don't enjoy, going to a casual restaurant with lots of open seats and being asked to walk over to the more formal restaurant with no explanation why (the answer is because the menu is more expensive at the formal restaurant) even though we wanted to order wraps which weren't available there.<br><br>The service is bad, and the older man that greets people was just plain rude to us when we let him know that the pomegranate mushrooms (avoid) were completely raw.<br><br>The Kababs were fine, although I don't think the lamb Koubideh is pure lamb. Overall the experience was a let down due mostly to poor service.", "pics": null}}, {"review": {"des": "I had a great experience with Noon O Kabab while hosting a dinner with my family at their newly opened space and I just have to leave another review about how amazing they are. Everyone was great to work with, a few employees asked how we wanted the room to look and they rearranged the tables and set up an area for the food. They even added a few nice touches with some uplighting! The room was a beautiful and didn't need much decorating at all. It was clean and spacious. Everyone was helpful and I am so grateful for it. We have catered from here several times in the past so I knew hosting a big group for dinner here would be great, but it exceeded my expectations. Well done, Noon O Kabab.", "pics": null}}, {"review": {"des": "We've been to Noon O Kabab several times and just realized that we never wrote a review ... Serious oversight for one of our favorite places!  I mean that.  We drive almost 2 hours from Milwaukee so that I can get a little taste of home and it's worth it every time.  This visit was no different.  <br><br>The atmosphere is clean and elegant; and markedly different than the fast/casual location just across the street.  White table clothes intercepted by the bright colors of the beautiful Persian carpets, paintings and tile work adorning the walls ...  <br><br>We settled in and ordered the Caspian Eggplant to start.  While we waited for it, a basket of warm bread arrived along with a small plate of fresh herbs, radish, onion and cheese.  The eggplant was good, coming w/ a little attached side dish of yogurt.  This was the first time we had ordered it here.  I prefer mine a little smokier, but this was solid.  <br><br>Lunch/dinner was ordered shortly thereafter.  I didn't even have to look at the menu - two skewers of lamb koubideh with white rice.  My wife wrestled for awhile with her choice ultimately to land on one of her Persian favorites - fessenjan.  She ordered it with dill rice (knowing that traditionally, dill rice is reserved for Nowruz or seafood dishes, but she's a rebel and loves the dill, so I didn't bother arguing about it).  <br><br>The koubideh was amazing, as always.  In previous visits, I've tried the barg kabab, chenjeh kabab, joujeh koubideh which all were exceptional choices as well.  Rice was done perfectly.  <br><br>My wife had had fessenjan before made by a friend and found this iteration of it to be a little sweet.  I explained that regionally, fessenjan can vary a bit with a more sour taste in the north.  Despite the unexpected sweetness, she enjoyed it.  It was thick and rich with nice texture.  And, of course she loved the dill rice. <br><br>Service was good.  In past visits, we've had Persian servers who know the food and menu well.  This time, we had a young gentleman who unable to answer some questions my wife had on the menu, but we managed.  <br><br>Prices are decent for what you get with exceptionally large portions,  So go hungry and expect leftovers.  Or, try the less expensive, more casual options across the street which are just as fresh and delicious.  For those who have never tried Persian food before, I really encourage you.  My wife is now obsessed with it.  While there is a little overlap with what many would classify as \"Middle Eastern food\", it's different, yet not wildly exotic for only adventurous palates.  It's all very fresh, flavorful and uniquely Persian.", "pics": null}}, {"review": {"des": "I learned about this place from some random guy I met while eating at Superdawg, I know, so random. But such is life and am I grateful for such serendipitous moment.<br><br>The kabobs were magnificent, juicy and flavorful. I got the soltani (filet mignon and ground sirloin kabobs) and my friend got chenjeh (rib eye steak kabobs). I highly recommended these two platters. They were so tender, to be honest, one platter can feed two people.<br><br>We also got the falafel and it was unlike any falafel I have ever ate. They were light and fluffy. It was fantastic.<br><br>If you like Persian food...this place is the place to go to get your fix!", "pics": null}}, {"review": {"des": "Excellent persian restaurant in north Chicago - friendly service, laid back decor, and tasty food. <br><br>We had a party of 6 and ordered the family meal, that is supposed to serve 4, but was more than enough for our party. <br><br>The tadig with ghormeh were delicious, as well as the tabouli salad. The hummus was creamy and smooth, pairing well with the warm bread. <br><br>All the kebabs were fantastic - especially the beef (steak) and ground beef (kobideh). <br><br>You can use the private parking lot accross the street. <br><br>If you are in the area, give this place a try.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/nwrwxKWMMx57oYwwPA_W0Q/348s.jpg", "caption": "Menu cover"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/clLQ15mqDQvhjrUBoPWBQA/168s.jpg", "caption": "Tadiq"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/CDbBC4NDlMqPmhpHOzfOUQ/168s.jpg", "caption": "Decor - internal"}]}}, {"review": {"des": "We regularly eat at Noon O Kabab each time we visit Chicago.  We have always enjoyed the Kabab here, however our last visit was a disappointment.  Unlike the past, The Barg Kabab was tough and not juicy at all this time, and the Shirazi salad tasted old and moldy.  We brought the issue up with the management but we were faced with resistance. The tomatoes used in the salad must have been rotten and tasted awful. All was not bad though.  The Kashkeh Bademjoon and mast moosir was delicious, and the chicken Kabab juicy and flavorful.<br>Hope for a better experience next time", "pics": null}}, {"review": {"des": "Fabulous Persian cuisine that's perfectly seasoned and served in enormous quantities.  The chicken is juicy and the steak melts in your mouth.  The dill rice helps keeps your stomach full and your tastebuds wanting more.  Sit down or grab it to go, you'll be happy either way.", "pics": null}}, {"review": {"des": "My husband is half Iranian so we are very serious when it comes to Persian Cuisine! We enjoy coming to this restaurant when we are in town. The taste of the food is pretty close to Mom's cooking. The service could be better but all in all we enjoy it so much!<br><br>If you are not into beef...try the Salmon Kabobs!! Soo good!", "pics": null}}, {"review": {"des": "There's something about the casual room brightened with colorful Persian rugs, the smoky baba ghanoush, the cinnamon-and-tomato-braised lamb shank and those tender chicken kebabs, charred outside but still juicy inside, plopped down on deliciously fluffy rice alongside charbroiled tomatoes and onions. Pure heaven!", "pics": null}}, {"review": {"des": "How have a been there so many times without writing a review? To begin with, yes, there are multiple locations, just a half-block apart. Free parking is available in the lot around the stand-alone location, which is meant to be more \"fast casual\", and now handles their take-out business. Free and paid street parking is available around the neighborhood. The Kedzie brown line stop is right next door. <br>I've always eaten in the corner location, which is more of a standard sit-down, bring-you-the-food restaurant. Menus are very similar, with a few small differences. Staff are polite and do what they're there to do. I've never had a problem. The food is really good! There are a few vegetarian options, but it's mostly about the grilled and barbecued meats, with rice. (So, good for the gluten-free crowd, too, although there is no separate gf menu.) They have dill rice, and white rice, and (for an extra fee) shirin polo, which is Persian white rice with orange peel and pistachios and whatnot. It's amazing.", "pics": null}}, {"review": {"des": "Oh my god. Ya khodaaaa. Mind blowing. Fantastic place for Persian food. Beautiful place, fabulous Persian art work on the walls. Nice music and friendly people welcoming you. You can start the fantastic experience with a free appetizer by checking in here and choose any one of the delicious ones. Persian favorites: Kashmir-e-bademjoon or Tahdig.<br>In the next step since we are here from St Louis, we wanted to maximize our experience with the food we ordered one soltani and one joined+shrimp.", "pics": null}}, {"review": {"des": "So last night we came in with a group of 12! <br><br>The staff were very quick to accommodate us and seat us. We offered to sit 8 at one table & 4 separately and it worked out wonderfully. The older kids had their own table and he adults and one young child sat separately. It worked out so that we were able to order and eat at the same time, and we were so close together that we were still able to share plates/try each other's appetizers. <br><br>Our party ordered a bunch of different appetizers and three family platters. The hummus and Kash-ke Bademjan were amazing (as always!). <br><br>The meat was delicious and every single person in our party was over the moon. The family platters come with 5 types of meat, grilled tomatoes, and a giant plate of rice (for each person!). <br><br>We also ordered sangria, which was sweet and served with fresh fruit - just how I love it! <br><br>We love love love this place, their staff, and their food. We will continue coming here for years to come!<br><br>Thank you so much for the wonderful evening for our large group.", "pics": null}}, {"review": {"des": "We wanted a place to eat that wasn't too heavy, since I was going to run the Chicago marathon the next day.. but still wanted to load up on carbs. And that's how we decided to eat at Noon O Kabab. It was pretty packed when we came on a Saturday night but the wait wasn't more than 20 minutes. We started with pita bread and hummus and the Tadig which is a buttery plate of crispy rice that was probably one of the most amazing things my mouth has tasted. We got it for free since there is a yelp check in for an appetizer so be sure and do that. We ordered the family platter with dill rice and it was way more than enough to feed the four of us. Definitely worth it if you are eating with a few people. I love the side of onions and feta that come with your food. The only thing was that I wish they carried some sort of garlic sauce that i usually dip my meats into, but the meats were juicy and tasty enough that i was still able to thoroughly enjoy my meal without any sauces. Each of us got an entire plate of rice that we all were able to finish.. its a ton of rice guys haha. But what better way than to prepare for a marathon with rice right?? Overall, good experience, not too much conversation with our server. Food came out fairly quickly, waited a little over 15 minutes for our meats but it was a busy night and im sure the meat takes a while.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Ph-1847CW-8ODW08nygwww/168s.jpg", "caption": "Family platter with them angles"}]}}, {"review": {"des": "Came back to this place and im not sure if the cook was having a bad night or what but it was such a let down. The meat was so flavorless, tough and chewy.... The rice tasted like burlap not even adding butter helped.. Its like all the passion and care that went into the food just vanished..", "pics": null}}, {"review": {"des": "I probably would've liked it more if I ordered something else. I got the falafel sandwich (eh) and for an appetizer, the mutton mushrooms (horrible). The mushrooms taste like they were sautéed in cigarette ashes and linseed oil.", "pics": null}}, {"review": {"des": "After finding the right building for dine-in. ( They have a fast self service restaurant across the parking lot) a little confusion for first timers, we had a great experience with ambience , customer service and of course the food! <br><br>Highly recommend Mushrooms with pomegranate dressing and yogurt cucumber dip in appetizers! All the Kebabs were juicy, well grilled and fresh! <br><br>Big portion sizes so we had no room for desert!<br><br>A place to visit again and again!", "pics": null}}, {"review": {"des": "a friend of mine recommended me this place.. so since i was around the area.. i decided to give this place a try.. <br>i ended up ordering ribeye and chicken kebab combo..<br>the price was a bit pricey but the food was good..<br>both the ribeye steak and chicken was cooked nicely and was tender...<br>would come back if im about the area again!", "pics": null}}, {"review": {"des": "Food is good, but service is garbage. They made us wait 1h then we asked what's going on? Lady at the front told us you wanna wait more or you want your money?<br>Really??", "pics": null}}, {"review": {"des": "I love their food, I'm Lebanese so we eat alot of this stuff and I have to say this is the best I've ever had.", "pics": null}}, {"review": {"des": "Great food, consistently gets our order wrong for delivery and pickup. You have to open the bag while you are there and go through each item to check for accuracy, else you'll be waiting another hour and another apology for your main course. I'd put incorrect orders at about 60% of the time we have gotten pickup or delivery. I want to like this place but they so often disappoint I can't recommend it.", "pics": null}}, {"review": {"des": "Consistently great flavors, service and atmosphere. Now with a convenient parking lot and carry-out/casual option. A standing favorite for date night, work meetings...lunch or dinner any day of the week.", "pics": null}}, {"review": {"des": "Come and taste, probably, the most wonderful Persian food in the city.<br>The food is delicious and the prices are not prohibitive at all.<br>I ordered the salmon and I was not disappointed.<br>The salads, the rice and all the food is very fresh.<br><br>The portions are right and very flavorful.<br><br>Drink some of their  tea, add sugar, and enjoy some Mesopotamian food, right on the north side of Chicago.", "pics": null}}, {"review": {"des": "First time coming here, but have definitely have driven by! We got the pomegranate wings, hummus, and a kabab plater with dill rice. The Pomegranate wings were delicious and the hummus looked fresh as well. The dishes come with a side of onions, radish, and cheese. <br>I will definitely come back to try the take out place, but all in all, great place. Would Recommend.", "pics": null}}, {"review": {"des": "We were there last Saturday & I ordered shrimp dinner & my husband ordered a steak koubideh kabob dinner.  Both our dinners were superb & they gave us pleanty of salad, parsely, radishes & feda cheese.  They also gave us a tomato based soup to dip our meat & shrimp in.  The service was good & the place is so clean it's a pleasure to eat here...I wish I could eat here everyday!", "pics": null}}, {"review": {"des": "BEST Persian food ever. SO GOOD. I came here with my coworkers and I'm SO GLAD I came. The food here is AMAZING. Hands down. I think I ate the best chicken I ever had so far in my life. It was cooked to perfection and they had to marinated it before because it was SO juicy and tender. You will not regret getting the joujeh koubideh. Please get it with dill rice. The platters are HUGE too and can be shared with 2 people and still be full. We got the lamb shank with fresh green beans rice and the meat falls off the bone easily. We also ordered the baba ghannouj for appetizer and it was quite good! We got the bomieh for dessert and they are like mini donuts. The zulbia was VERY sweet and I don't think I would order that again.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/FdsXbD2q2ouLs0hd9q13Lg/348s.jpg", "caption": "Tabbouleh"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/kna7FEfKeS_cHH60x3vP6A/168s.jpg", "caption": "JOUJEH KOUBIDEH"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ixKizK0sZuthmlV96IlvgA/168s.jpg", "caption": "Zulbia"}]}}, {"review": {"des": "To start simple, that was some excellent food. Obviously a Hidden gem in North Chicago/Albany Prk area. They have two variations of the restaurants-a full dining experience as well as a quick self service eat in joint right across the street from each other. Now that's thoughtful. Regardless, I inquired and the staff mentioned the food at both places is same, it's just the dining experience that differs. They also have secured fenced parking. <br><br>Moving on to the real stuff- food! My buddy who is also a big foodie like me, strongly recommended me to try their 'Barg', which is their marinated juicy filet mignon skewer-charbroiled. I am going to to the same here and recommend it to you. The steak was cooked perfectly and it almost melted in the mouth. It came with a gravy sauce with onion. Certainly try pouring it over your meat for enhanced flavor. <br>Other items we ordered were The koubideh, ground beef skewers and the Noon o joujeh, chicken kabab also well cooked and flavorful. <br><br>Thanks to @Yelp, for the free appetizer (check-in deal) we got the kash-ke-bademjan, roasted eggplant puréed with onions, garlic and aged yogurt served w warm pita. Never had that before but m glad we got that coz it was awesomeeee. <br><br>I did forget to try their saffron ice cream, and bunch of other luring items in their menu. <br>Certainly going back.", "pics": null}}, {"review": {"des": "Guys do NOT sleep on Noon O Kabab this place is everythingggggggg. <br>Monster wraps are so filling and the ingredients are great. Side note, if you don't like pickles you're not gonna be a fan of the wraps, it's pickle city. <br>The falafel is SO good. Crispy on the outside, the inside is soft and not dry at all, dare I even say .... moist . I'm picky about restaurant fries and I could eat a whole plate of these and not even regret it. Not too crispy, not soggy or limp. Great in their creamy sauce or the hot sauce, can't go wrong there.<br>I have to convince my husband that we can't get Noon O Kabab 3 times a week and I'm running out of good reasons at this point. <br>Go to Noon O Kabab. It's important.", "pics": null}}, {"review": {"des": "What can I say? This is my favorite Persian Restaurant in America!!! I first stumbled upon this place in 2008, and it's been my favorite ever since! <br><br>The ambiance is rich and warm, the walls decorated with traditional Persian tile work and miniatures. You are presented with a plate of feta, parsley, onions and radishes served with bread. This is a traditional noon-o-panir ba sabzi plate.<br><br>I always order the single skewer of Jujeh Kabab with salad instead of rice. It's only $11 and a lot of food! There are probably 8 pieces of chicken included. Another favorite is the Soltani Kabab, which is a mix of Barg kabab (filet) and koobideh kabab (ground beef) served with half white rice and half herbed rice. The meat is juicy, tender and very delicious!!!<br><br>We always end our meal with a cup of Persian tea (chai). Highly recommended!! 5 Stars!!!!", "pics": null}}, {"review": {"des": "This is my FAVORITE place ever! Been coming here for years. The food is always delicious and portions are huge. The beef koobideh is my favorite dish.", "pics": null}}, {"review": {"des": "It took me forever to find an above average Persian restaurant. Noon O Kabab is great! I got the barg and chicken kabab combo, which was delicious. The hummus was plentiful and fresh. The bademjan was good. My only issue is that the tables in the restaurant are wayyyyy too close together... and there wasn't any soap in the bathroom. I would definitely come here again though.", "pics": null}}, {"review": {"des": "This place has the most authentic and marvelous take on Persian cuisine. Must have is the saffron-infused chai!", "pics": null}}, {"review": {"des": "The food here is delicious and the serving sizes are generous. I really love the chicken kabob plate. The only caveat is the lack of dining room server presence and no air conditioning. It's more like a walk up counter. Perfect on a breezy day.", "pics": null}}, {"review": {"des": "The food is good BUT they way they treat customers should be enough to keep people away. I ordered take out & when I got it home discovered they made a mistake in the order. I called & politely explained. First they could not find my on line order. I gave the the # on the receipt. No luck & woman said she did not think I ordered. Finally found it. Owner got on phone & said they didn't make mistake & would not correct or refund my money. It was an $80 order & mistake was only one dish so very little impact on restaurant. Hard to believe that they refused to fix minor Issue & were really rude about it. <br>Lots of other good options so I won't be eating or ordering from here again.", "pics": null}}, {"review": {"des": "I went to the \"fast food\" counter order side of this restaurant, but there seems to perhaps be a sit-down place by the same name next door. The food was pretty good. I got two skewers, one was quite good the other a little too tough for me.", "pics": null}}, {"review": {"des": "Really delicious and authentic Persian food here! The staff are all very friendly, the menu has something for everyone, and there is plenty of seating but they do get busy (always a good sign)!<br><br>We ordered the Caspian Eggplant, Barg, and the Soltani. Everything tasted amazing! The pita our server set on our table along with the cube of cheese, parsley, radish, and onions really got our appetites going for the rest of the food! The pita was so warm and fluffy!<br><br>The Caspian Eggplant paired very well with the pita bread. It was lightly sweet and savory! It comes as a mash that spreads easily but can also be eaten with just a spoon dipped into the yogurt sauce that came with it. This is a nice appetizer to share with the table.<br><br>The Barg was incredibly tender! Even the dill rice was flavorful! The filet mignon Alan of meat was huge but was also cut so easily with a knife! Each bite was tender and juicy! I could not stop eating it and every bite sent me to a blissful heaven!<br><br>The Soltani came with the filet mignon slab of meat as well as a ground up sirloin which was equally as tender. The meats were so flavorful and paired with the dill rice was superb! <br><br>This is the spot to take someone as their first taste of Persian food! They will thank you later!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/lxFJeoU5cOJrc9EXlV_c2Q/348s.jpg", "caption": "Barg"}]}}, {"review": {"des": "Great food been going there for years Kebabs and rice is always on point plus the people working there are really nice", "pics": null}}, {"review": {"des": "The family has been ordering and dining in year after year  at Noon O Kabon, that even the owner knows us by name lol. So I think it's about time to do a review. <br><br>-Customer service- Once we had delivery, and they had a new driver. The owner was so nice, that since they were late for my order, the owner herself delivered the food to my house! Can you say loyal? Nuff said <br><br>The kebabs here are always very juicy, and their rice won't disappoint. We usually get the chenjeh and koubideh (lamb, beef, and chicken), joujeh, lamb shank, the kifta, salmon, and shrimp. Their hummus & babaqinosh is also very good. If there's more than 10 of us we just order a couple of family platters.<br><br>We usually get a hummus and greens with feta cheese appetizer free with our order.<br><br>Since I like to try new things, I've recently decided to try out a new entrèe that they offer, and I did not like it at all. It's called Tah Dig with Ghormeh Sabzi. It's basically crispy dry over cooked rice scraped out of a pot with a green sauce ontop. <br><br>I wouldn't have it again because I could barely take a second bite out of it. I've also had the Caspian eggplant, I didn't like it much either. I think I'll just stick to the usual entrèes since they're pretty good and authentic Persian food. As for the Tah Dig, I don't know what that was... but I would have to say that it was the strangest entrèe I have ever had in my life. It left my face blank...", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/6SKXtn-vRq3-x0DS72HcGA/168s.jpg", "caption": "Juicy!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/sS4T9sqtpQrOUu1jX0f7aQ/168s.jpg", "caption": "The owner was so nice, that since they were late for my order, the owner herself dropped off the food to my house! Can you say loyal?"}]}}, {"review": {"des": "I had a delicious meal here, recommended by a friend who had eaten at Noon O Kabab's Milwaukee location on the Northwest side.  Another Yelper had mentioned NOK was the best place place to get kebabs in Chicago, a claim which I will support from my first visit.<br><br>We were drawn to this location by their free parking lot and the option for a quieter, white table-cloth sit down restaurant, versus the grab-and-go NOK location right across the street (north of Leland ).  They are basically the same establishment, split into two buildings so that you have the option of different dining experiences. Genius.<br><br>I really enjoyed their Persian food. The five stars comes from a combination of good food, good service & good company.  Make sure to order their tea, subtly spiced with cardamom, and there will be a huge silver tin of sugar cubes on your table for sweetening.<br><br>Shared amongst 4 people:<br>Large hummus<br>Joujeh Koubideh (chicken breast kebab); 2 skewers<br>Koubideh (ground sirloin); 2 skewers<br>Lamb Kabab; 2 skewers<br><br>With each of our meat entrees we got 50-50 dill rice and white rice, served with charred tomatoes which were delicious.  I wish there were even more charred vegetables; some bell peppers and roasted onions would have tipped this near-perfect meal to perfection.  All their meat was tender, their chicken delicious with a generous drizzle of fresh lemon.<br><br>Once you are seated, you get a basket of thin pita along with a spread of chopped onions, feta, and parsley.  You get a free appetizer under $7.50 were a Yelp Check-in and our group was unanimously down for a large hummus ($7.00).  Our server was attentive and kind.  We had a pitcher of water at our table and she checked in several times to ask how to food was or if we needed anything.  On a chilly Saturday afternoon before it got crowded, our group was well taken care of.<br><br>For a group of four splitting our food family style, next time I would order two meat entrees (instead of three) and add a couple skewers on the side because we had a lot of rice left over. They have huge portions. Make sure to ask for a side of tahini and their house-made hot sauce (which is very mild).<br><br>They were out of Baba Ghannouj when we went which was a bummer, but I will definitely come back here again.  Not only for the Baba Ghannouj for also for the Lamb Shank, the Yogurt salad, Pomegranate Wings, and a variety of their other appetizers.  Also, their saffron ice cream looks to-die-for.<br><br>In all honesty, when I first heard their name \"Noon O Kebab\" I had no idea what to expect... but don't let that deter you.  You will not be disappointed.  The Albany Park area is so rich with different types of restaurants and bakeries to explore.  I would love to bring my family here since we love Middle Eastern & Mediterranean cuisine.  My sister and I were raised on Pita Inn, Grecian Kitchen, Dengeo's and Kabul House in Skokie so the next time we're reunited, NOK it is!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/wZMgrYMOZDTO_z24a4qF8g/348s.jpg", "caption": "joujeh on the bone (cornish hen)"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/9CPJnc8L-RkrhWZGBTMlnQ/168s.jpg", "caption": "saffron ice cream"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/GySJzujWn4F3_puElt4NPQ/168s.jpg", "caption": "doogh (yogurt drink with mint)"}]}}, {"review": {"des": "Have unplanned guests? Need food fast? Order Noon O Kabab to go! I was on the corner of Western and Lawrence when my friends called unexpectedly to let me know they were coming over. I didn't have any food at home to serve so I was about to drive to Pita Inn in Skokie to get some Mediterranean food. Then I remembered a good friend of mine told me there's a really good kabob place on Kedzie so two minutes later, I arrived at Noon O Kabab. They have two locations within less than a block radius. One restaurant is sit down and the other is self serve (order to go). The place has parking but be aware, it's really, really packed. You're lucky if you find parking in the actual lot, stick to street parking if you can, it's rather hard to get out of the parking lot. Anyways, I walked in and the line wasn't too long and since it was my first time there, I let the cashier know I needed enough food for four people. The cashier suggested getting  the Joujeh platter (two skewers of juicy marinated chicken on an open fire served with rice) and Koubideh platter (two skewers of ground sirloin beef seasoned with Persian seating and also served with rice). The cashier even asked me if I would like it served family style and I said yes. I also ordered their homemade hummus. My total was about $56 dollars for two platters and hummus and I was told it would be about a fifteen minute wait. The place is clean, the bus woman and boy were busy picking up dirty dishes, sweeping the floors and making sure everything was tidy. The place was packed but it has a beautiful ambiance and aura to it, the wall art is charming as well. My food was done in less than 15 mins and the richness of the food smelled my entire car up! I have to admit, I was a little disappointed when I opened the food up when I got home, there was double the rice in comparison to the meat. There was a good amount of chicken but considering I ordered two skewers of beef, there was double the amount of chicken in comparison to beef- even though I ordered two skewers of each!! I have to admit, they serve significantly bigger pieces of chicken on the skewer and that could be the reason for the significant difference in portions. Either way, I served half the platter of rice and then all the chicken and beef on one platter and thank goodness we had enough food. Truthfully, if we didn't have other food available, we wouldn't have been able to feed three people nevertheless four. Even though the chicken was juicy, it tasted bland next to the rice. The chicken is great but even with the small side of grilled veggies and rice, there's something missing to make this platter excellent. Maybe it's the lack of salad or a sauce? I don't know but it's missing that extra key ingredient that would make this meal mind blowing. If you don't eat the chicken while it's hot, it become a little dry with the rice so I ate it with the hummus. Their hummus is really, really delicious and I ate the whole small serving in one sitting. The chicken and hummus paired together taste really good!! <br><br>I do intend to come back and try the rest of the items on their menu!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/21lUcAv-cOahUtATItv0Gw/348s.jpg", "caption": "This is the two skewers of chicken and two skewers of beef with half the rice from the container."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/3TzMNGFumXJ9loSLUJbOlg/168s.jpg", "caption": "They have Persian ice cream!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/MH6__j-RTHaLz0FcEEnroQ/168s.jpg", "caption": "Order here for to-go"}]}}, {"review": {"des": "Delicious Persian food, it's Zabiha Halal Alhumdulillah.<br><br>I love the Persian chicken kababs, freshly grilled with fresh salad, very tasty flavorful rice and I loved the Hot sauce which came with it. Quantity of the platters is huge I had to pack it for my next meal. The owner and staff is so friendly he added a portion of Rice while packing my food. I will give this Restaurant 5 Stars.<br><br>Thank you for the amazing food and service !!!!!!", "pics": null}}, {"review": {"des": "Our favorite Persian restaurant!  All the food hits the spot.  So tasty, authentic and delicious!  I usually order the<br>CHENJEH & KOUBIDEH. $15.95<br>One skewer of choice rib eye and one skewer of our signature ground sirloin.<br>Or the JOUJEH Koubideah, chicken skewer with DILL RICE!<br><br>At first taste, I wasn't a big fan.  But then, I grew to love: <br>GHORMEH SABZI (STEW) $14.95<br>Spinach, parsley, cilantro, scallions & fenugreek finely chopped & slowly cooked with cubes of lamb, red beans, & Persian dried lime.<br><br>Parking is scarce since you have to drive around the block and find street parking. So be patient.", "pics": null}}, {"review": {"des": "Great service and very authentic food, home made. Will come again.<br>Lamb shank is amazing.<br>Stuffed grape leaves amazing..", "pics": null}}, {"review": {"des": "If I could give this place 10 i would!!!!<br>ALWAYS GREAT food EXCELLENT service AWESOME environment. <br>Their tea is my weakness!!! LOVE every it<br>of their menu!!!", "pics": null}}, {"review": {"des": "First Persian food experience outside of the food cooked by my Persian friend, but this place was really great! We had a wide variety of food and loved all of it!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ISxWHwxMhVaYu_7r6QYVyQ/348s.jpg", "caption": "Bread and cheese (Persian style) feta, parsley, onion ..."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/SanJsC8N1uw1neD7XnclNA/168s.jpg", "caption": "Baba"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/7beG7uPD0w9gAhfSd5Y4zw/168s.jpg", "caption": "Pomegranate mushrooms."}]}}, {"review": {"des": "Love this place, it never disappoints. Atmosphere is welcoming. Portions are good size, with great flavors. Catering service is very good!", "pics": null}}, {"review": {"des": "Food was delicious. Presentation of food very attractive and serving portions were very generous", "pics": null}}, {"review": {"des": "The only Place for the best Kabobs, soltani, chicken. I have been eating for years and the food is always tasting the same great taste. Consistency is the main ingredient in Noon O Kabobs success!!!", "pics": null}}, {"review": {"des": "I always have a solid experience here. They have a great selection on the menu and I really like the chicken kabobs. Service is good. Food is excellent. Awesome all the way. Only thing I would hope for is more seating and they are working on that with the construction currently in progress.", "pics": null}}, {"review": {"des": "We made a return visit after several years to this relatively upscale Persian restaurant.  One noticeable change from our last visit:  the separate takeaway facility has moved to a new, modern building to the north of the main restaurant, where we went.  Not very busy on a Tuesday evening; we were seated at once, and given a relish tray consisting of hot pita, feta, raw onion, and radishes.<br><br>Our party shared an eggplant appetizer, rather smoky, served with sour cream or perhaps yogurt.<br><br>My entrée choice was something new to me:  pomegranate shrimp.  This consisted of jumbo shrimp and big mushroom caps in a tangy-sweet pomegranate sauce, served over basmati rice.  Excellent!  We'll really have to get here more often when visiting the neighborhood.<br><br>Convenient to public transportation, adjacent to the Kedzie station on the Brown Line, and two blocks from the 81-Lawrence bus.  Private parking lot at the takeaway facility; street parking is hit or miss.", "pics": null}}, {"review": {"des": "We went here for the first time after receiving a gift card. IT IS SO GOOD. I'd never had Persian food before and this was a wonderful introduction. First of all the portions are *enormous* and well worth the cost. The two of us ordered the lentil saffron soup, a joujeh (chicken) kabab plate-- two skewers' worth of moist, deliciously spiced chicken with two thin pita, a cucumber salad, regular salad-- a lamb \"monster wrap\", and the adass pollo-- a slightly sweet vegetarian dish with rice, lentils, caramelized onions, tomatoes and more-- and it was $34. We have enough food for another meal or two. <br><br>Be forewarned that the menu in the restaurant is slightly different than on the website (cheaper options too). If you order a single kabab it's only $3.95.", "pics": null}}, {"review": {"des": "This was probably one of the most tasteless Mediterranean food places I've tried. The chicken Kabab were just so bland. The hummus and baba ghanoush had more taste of tahini than the actual ingredients. And the service was poor! They apparently don't serve sauces for their meals and charge $5 for them.", "pics": null}}, {"review": {"des": "The food is okay but the person greeting us at the door is a bitch ass cunt. We came in and it was full, we asked how long the wait would be or an estimate . The cunt said \"I dOn'T KNoW tHe pEoPlE aRE EAtinG\", like we can't tell . My food tasted a bit like gas. I compared to to my family's food and they could all tell that my food was off. Theirs' was okay though so I guess mine was just off.", "pics": null}}, {"review": {"des": "We have eaten here a couple times and always the food keeps us coming back. Highly recommend for best Chicago Persian food!", "pics": null}}, {"review": {"des": "This was my go to place! Unfortunately today's meal was not satisfying. The rice was not as usual. It was dry and hard. The pita bread used to come nice and fluffy even though it was never warm, the pita still was soft. Today was just hard and cold. Very disappointed.", "pics": null}}, {"review": {"des": "Love this place!!! So delicious and healthy!!! They actually have 2 places: one is a fancier, date night worthy, the other one is very casual and BYOB. Staff is friendly, good service. Our favorites are the salmon, steak and shrimp. The tiramisu was also good.", "pics": null}}, {"review": {"des": "Execellent Persian food! I would say even better than the Kabobs you can find in iran. <br><br>All stars for flavor, quality and presentation! Thanks for the lovely experience", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/tGGkeAD_qdaFFyk61Q10lg/168s.jpg", "caption": "Loved the Barg! I usually hate barg but these were best!  Pic of Soltani (makhsoos) includes barg & koubideh"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/-lnkK0ZOyLtgcLeNDhVAew/168s.jpg", "caption": "Small Tadig plate plus side of Gormeh Sabzi. Small is actually quite large portion!"}]}}, {"review": {"des": "Amazing Persian food! Everything we had was delicious and perfectly prepared. The portions are amazing and have left overs for another meal or two. Can't wait to come back and try more food.", "pics": null}}, {"review": {"des": "Best Arabic restaurant in Chicago. Worth the visit. Reasonable prices. I recommend for all Saudis to visit this place.", "pics": null}}, {"review": {"des": "This place is phenomenal! The service was great, food was delicious, and the place is super adorable!", "pics": null}}, {"review": {"des": "Disappointed.<br>You would imagine that this place would be a little more welcoming of vegetarians. I asked for the lunch special and explained that I don't eat meat. They wanted to charge me more for taking the meat out. They were not at all accommodating.", "pics": null}}, {"review": {"des": "This used to be one of my favorite Persian restaurants. They still have decent food but the service could be better.", "pics": null}}, {"review": {"des": "The best place ever! Chicken kabab lunch special!!! Especially the dressing for the salad !*** in love***", "pics": null}}, {"review": {"des": "Incredibly unorganized. I waited 35 minutes for my order and when I asked what happened to my order, they said they gave my order to someone else by mistake, sorry! They said, \"do you want to reorder?\"  <br>In this situation, I would have expected a refund", "pics": null}}, {"review": {"des": "$5 lunch specials & hi ambience factor make for a 5 star experience! It seems the review is a little short...maybe it's just concise?", "pics": null}}, {"review": {"des": "Always they have the best  Persian food in Illinois they are number ###### One  and they have the 1st class service...You will loved it", "pics": null}}, {"review": {"des": "If you have a guest and want to try Persian food take them there and go for chenje or soltani. You will not regret it!", "pics": null}}, {"review": {"des": "Another hidden gem. True flavors of Persian food. They have opened another outlet across the street as well. We had food at the old place. The interiors and staff are inviting. We were quickly given a seat and the server came with hot pita bread, feta cheese and salad (on the house)<br><br>We had Lamb Shank, Dill rice, Lamb Kebob plate. All the items were very well presented and amazing taste. The lamb shank fell off the bone but I have had better ones. The best item was our appetizer Spicy Pomegranate Chicken Wings. They were juicy and well done with a smoked flavor. Though they named it spicy... was not spicy. My kid was happily had them.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/rhskIm_qIjMV3N1VL4teVA/168s.jpg", "caption": "Spicy Pomegranate chicken wings"}]}}, {"review": {"des": "Went to this place for the first time last week, had one of those days at work where I didn't feel like cooking and I'm so glad I didn't because the food that they make here is way better than anything I could make myself.   For those first timers, there are actually 2 locations; one is the dining area and the 2nd is across the street where they have pickup.  This is a popular spot, it's tough to find a parking spot but there's street parking and side streets in case you can't find a space in their parking lot.<br><br>I walked in to amazing smells of spices and went ahead and ordered the kabob plates; tried the beef and the chicken and honestly both were amazing.  On the rice plates you get 2 kabobs, a tomato side (it's only 1 big tomato), and rice.  You have the choice of either dill or white rice, definitely go with the dill rice, it has an amazing flavor!  One thing I will say is I wish there were more vegetables on the plate, you basically only get 1 large cooked tomato.  More veggies like onions & peppers would make the plate a lot tastier.<br><br>Also, cool note if you check in with the yelp app, you get a free appetizer :)  I tried the hummus and it honestly was the best hummus I think I've ever had.  Great flavor, fresh, and not too oily.  Do not miss out on the hummus, if you're making a pita it makes your pita 10x better.  All in all, I enjoyed my take-out experience, I will definitely try it again.  The service was pretty fast, I didn't order ahead of time because I wanted to see the menu in person and ask questions about what was included in the dishes, and my food was out within 15 minutes.  I would still recommend calling ahead of time though because during the week this place gets a lot of takeout business for dinner.  Will definitely be back for my hummus fix! :D", "pics": null}}, {"review": {"des": "Best persian restaurant in chicago, I love their Ash Reshteh soup, Lentil soup, Barg kabab and Jujeh on the bone. Service is always good as well.", "pics": null}}, {"review": {"des": "Back in Chicago and back to our favorite Persian restaurant. Our whole family loves this place and the lunch prices are great! Clean. Friendly service. Great food.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/8JkC0QWja82yKhlUoqZlGA/348s.jpg", "caption": "Menu"}]}}, {"review": {"des": "Very delicious, authentic Persian food going on here!<br>Recently a friend was craving for some Persian cuisine and this was the place he wanted to come to. Made the trek up from downtown through crazy traffic to eat here. Was Sunday afternoon and they had just about a full house as I am sure it was a lot of groups there for sunday dinner. We were given a nice table by the window which was nice as its good for street watching. <br><br>They brought us bread, cheese and onions to start us out and then we decided to order appetizers for the 4 of us to share. We got the Olovieh (Persian potato salad) which was really good and the Dolmeh (grape leaves with tomato saffron sauce). We also got some sort of Persian spinach that was very good over rice. They also had Efes beer which is supposed to be one of the best Mediterranean beers around...very refreshing!  After all of that I was already full and didn't need an entree. <br><br>My entree was the Soltani which is Barg (large skewer of marinated filet ) and Koubideh (ground beef sirloin with Persian seasoning) over dill rice! Both cuts of meat were delicious, but the Barg is probably the most perfect piece of seasoned meat I've ever tasted. The flavor was 2nd to none and paired with the dill rice was a lethal combination! Very big portions as well which is good if you intend to share and not be a fatty LOL! I chose to be a fatty that day! Our server was very nice and worked hard, but she broke my heart when she told me that me and my buddy drank the last Efes beers and there was no more Lebanese beer...truly disappointing but her service, great atmosphere and awesome dishes more than made up for it! Will be back!!!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/YJ3LqnfrygvIP9jcE4fBBg/348s.jpg", "caption": "The very delicious Soltani! Best cuts of meat I've had in some time"}]}}, {"review": {"des": "My mom and I ordered the lunch special which was not over $8. We also got a free appetizer by checking in using the yelp app. We shared lunch special, and took the other one home, because we were both full with one order and the 6 pc falafel appetizer. One order of the lunch special can fit in the to-go box. Ambience is nice. We were served pretty fast. The place has free parking. Also, it looks like they are expanding. I would come again soon.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/2Ui9R6amtw-0amtYR5Jo4A/168s.jpg", "caption": "Free appetizer when you check in with the Yelp app."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/JRASqbFKvvaiF4r2ZEwlWQ/168s.jpg", "caption": "The lunch special"}]}}, {"review": {"des": "We had out-of-town guest, restaurateur friends, visiting. So we wanted to be thoughtful in our choice of where to eat out.  We had not been to Noon O Kabab in awhile, and they did not disappoint. We went for the sit-down option, and tried their specialty cocktails and a fantastic Lebanese red wine.  We ordered a number of dishes and appetizers, and our server suggested a \"family-style\" presentation; it was a great idea and everything we ate was amazing. Favorites included Chenjeh and shrimp kabab, Lamb shank", "pics": null}}, {"review": {"des": "Awesome lunch special for a good price for the city! Chicken and sirloin kabab with half and half rice-- super delicious and more than ample amount of food. Also got the appetizer trio with baba ganouj, hummus, and kashke with pita! We went the quick spot across the street, can't wait to go back and try the dinner fare.", "pics": null}}, {"review": {"des": "Just great!  A few steps from the Brown Line train, or park just north in their parking lot.", "pics": null}}, {"review": {"des": "I just was here and it was my first time. I ordered lamb kabob and the meat combination. Everything was good service and the food taste. I definitely will be back.", "pics": null}}, {"review": {"des": "Service was a little slow-we ordered drinks and waited a while for everyone to get what they ordered-but the food was good. We had a lot of people so we ordered the big platter. I would go back fors", "pics": null}}, {"review": {"des": "Very tasteful and authentic food. The staff is incredibly friendly and the manager came over to ensure our experience and food was top notch, highly recommend! The best in the city!", "pics": null}}, {"review": {"des": "Wow we got in just before the rush at about 615pm.  When we left at 745pm there had to have been at least an hour wait.  The restaurant is actually quiet small.<br><br>Don't forget there is a free lot across the street.<br><br>Our service tonight was very slow.  We ordered an appetizer that I posted a photo of.   We didn't really like it but thanks to Yelp and their coupon it was free.  <br><br>My daughter and I got the rib eye kabobs and my wife got the lamb.  Everything was good but not great.  I was disappointed.   It took forever for them to clear our table and we were never offered dessert.  <br><br>I'm sure tonight was just a bad night.  We'll probably try it again someday but until then...two stars.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/UAAntFI2oC1NCUDmN50eBA/348s.jpg", "caption": "Onions and feta complimentary tray.  Beneath is the KashKeBademan appetizer."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/bkhFdnM8pen97o1CpXDvhg/168s.jpg", "caption": "Menu.  The KashKeBademan was just ok."}]}}, {"review": {"des": "Probably the best Persian food in Chicago, though it is a \"bit far out\" but very conveniently located on the brown line (literally it's right there - just go to the correct exit). We went on a Friday night around 7pm. It was busy but it's a large enough restaurant that there were a few open tables and we didn't need to wait. It's a nice atmosphere and definitely a good place to go with a larger party. <br><br>My group was aggressive and we ordered the large baba ganoush, which was delicious. The fresh pita bread they give with it is perfect. We then also ordered a large fried rice appetizer which was huge! The fried rice was good (literally just rice that was fried on one side so it turns crispy) but I'd save room for the main dishes. By the time our main dishes came out, which are also huge, we were quite full. The lamb kabob is perfectly spiced and cooked. The rice that accompanies the meat is addicting.<br><br>I'd definitely return. Across the street is a more fast-casual establishment of noon o kabab as well as their catering restaurant - so you can get unlimited kabobs!", "pics": null}}, {"review": {"des": "I've been meaning to check out this restaurant since it's only a few blocks away from my house, and conveniently located one block north of the Kedzie brown line station. There are two locations (the main restaurant if you want to dine in, and another location across the street, which according to the waitress is primarily for people ordering to go). I got the Lamb & Koubideh combo served over dill rice, and it was DELICIOUS. I was craving good lamb for a while and this one really hit the spot. I also ordered a hibiscus mojito which was tasty and refreshing. The service was quick and friendly, and the restaurant was well decorated. Definitely returning!", "pics": null}}, {"review": {"des": "If you are in Chicago and looking for good Persian food, you should consider Noon O Kabab. Although it's not a fancy place, the food is really good. We went there with a few American friend and this was their first time in a Persian restaurant. We all loved the food! Portions are generous and you will probably have some leftovers. Their sultani is what I have gotten a couple times. I have tried other dishes and I liked them all. Interestingly, my friend liked the feta cheese and herbs that you get as a starter so much that she asked for that next time they were coming to our house for dinner!", "pics": null}}, {"review": {"des": "My favorite neighborhood place! I've been coming here for years, but infrequently since it was sort of 'far' from my 'hood. NOW I live a block away and am here like once a week. It's just so good! LOVE the kash ke bademjan (eggplant with caramelized onions and whey), the creamy hummus, and really any kababs--they are all tender and juicy! Plus, the dill rice is so tasty! <br>Family-owned and the service is always super nice and friendly.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/3EYLFs9HzqcBB7N60LMqHQ/348s.jpg", "caption": "Kash-ke Bademjan...try it! It's decadent!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/w2HEg_hWAcaKU8Iv8UKx_Q/168s.jpg", "caption": "Joujeh koubideh--ground chicken kabab with dill rice. Tasty!"}]}}, {"review": {"des": "Man do they feed you here!! Lots of food for a great price. Only reservation is I wish their yogurt sauce wasn't so diluted.", "pics": null}}, {"review": {"des": "It's probably the best Persian food I've had in Chicago, which is I guess like saying a restaurant is the best deep dish pizza in Tehran: you have to set the bar a little lower. <br><br>The food arrived fresh and well cooked. But a persistent problem with the few Persian restaurants that exist in Chicago is that there is a lack of umami in the dishes. I don't know why that is,  but it makes for a lack of depth in everything from the Caspian eggplant to the kash-ke to the sabzi to the koubideh. No umami. No oomph!<br><br>My first inclination would be to assume that it simply isn't part of Persian cuisine the way it is with Turkish,  Lebanese,  or Moroccan cuisine (although Moroccan is also tough to pull off). But I've had some great Persian food when I was in Beirut years ago. I know it's possible. I'll keep waiting.", "pics": null}}, {"review": {"des": "The chicken skewers were perfectly cooked and juicy. Wasn't a big fan of their rib eye skewers though. There wasn't much flavor. The rice was nice and fluffy. Service at the counter was fast and friendly.", "pics": null}}, {"review": {"des": "Authentic Persian food! And delightful customer service. Ordered 10 Soltani plates sorted, Barg Kabab Plate, Shish Chenjeh, Salmon and Shrimp, Chicken lentil soup and Domieh for desert which was complimentary. When we come here we ORDER BIG. <br><br>Always leave satisfied<br><br>Oh and the Domeih Oh my God the taste is too over powering will not order that again, thank god I didn't pay for it", "pics": null}}, {"review": {"des": "this place is so good and not spicy at all <br>the ice cream is $ 5.00 it is worth it <br>check this place out  next to the train tracks<br>eat and watch the trains go by <br>you have to try this place", "pics": null}}, {"review": {"des": "I just had a Barg there and there was hair in my tomato . I addressed that to my server(Dennys) and never heard of a apology from her or the manager and after paying she just threw the check on the table and left.<br> Really disappointing.", "pics": null}}, {"review": {"des": "Came in this week to grab some Persian food -- and did leave satisfied.<br><br>We had a party of 8, were seated immediately, and the service was good.<br><br>The food was good - we started with a ton of spreads - the hummus, baba ghanouj, tabouli, and upon our waitress's request, the Kashk-ke-Bademjan, a warm eggplant dish with onion garlic and yogurt -- very good. There were whispers around the table that the hummus was 'the best hummus everrrrr', but I think some of my fellow diners were just very hungry.<br><br>For mains we ordered the family platter, which comes with a a whole variety of meats, a filet, a sirloin (someone said 'oh this one tastes like hamburger!'), ribeye, and chicken. We also got an order of the lamb koubideh and the salmon, which was 'highly recommended!' on the menu. Well, I'd recommend it too, as that was probably everyone's favorite dish of the night.<br><br>The meats came with a full plate of rice -- for every single person at the table. Seemed a little excessive to me but......'MERICA! <br><br>Overall, good food in a nice restaurant with good service. I'd recommend if you're a fan of Persian food, or just generally enjoy meats, rice, and spices. Do it.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/T_wdZuNvpi4DTHuqHWTFzQ/348s.jpg", "caption": "Cheese and onions"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/VroP73f7S1FmRnivqvTo4A/168s.jpg", "caption": "Hummus!"}]}}, {"review": {"des": "Very good food! I had the pomegranate mushrooms over the most flavorful rice ever (orange zest, raisins, saffron...). Wasn't a fan of the saffron ice cream, but glad I tried it.", "pics": null}}, {"review": {"des": "The best Persian food I've had outside of Iran by far. Addicting grilled shrimp. It's a must try. Wonderful sauces. Friendly, kind service. Will make it a regular spot.", "pics": null}}, {"review": {"des": "No doubt one of the best Persian food in town but with food comes service and they are absolutely TERRIBLE & RUDE when it comes to that. They have no regard for people waiting outside , don't even check the names they put down and if someone just walks in they'll seat them before you if met by another server. Has happened to me twice now and they absolutely have no courtesy to be the least apologetic about it. I'd just order the food rather than even visit this place.", "pics": null}}, {"review": {"des": "Hands down the best Persian food in Chicago!  Never disappointed, large portions and my favorite is the Soltani Plate.  Prices for the food you get incredibly generous.", "pics": null}}, {"review": {"des": "I really like coming here. The customer service is out of this world, their food is very good. They give you enough rice for days, which when it's that good, I have no complaints. Their grill meats are just ok though, nothing special but not bad. Their classic Persian dishes are where it's at though. Definitely give it a try!", "pics": null}}, {"review": {"des": "Went here and had an amazing waitress, Celia! She was prompt and fun to have serve us our meal! She offered to make us margaritas, so we took her up on the offer. She made two beautiful mango margaritas in giant glasses. Really good! We ordered lamb and chicken kabobs and falafel. Everything was fabulous! Great fresh flavors and lots of food, fast! <br>We will be back and are going to insist on having Celia wait on us!", "pics": null}}, {"review": {"des": "Service was very slow and the waitress was super rude. She was seen sitting down eating a meal TWICE when we were waiting to order. When she originally approached our table she says, \"Do you guys want to order or something..\" She also took 10 minutes to get a coke for one person. Chicken \"breast\" was the worst quality chicken I've ever had and the seasoning flavor was just awful. Only plus side to this place was the free pita bread and feta they bring you.", "pics": null}}]}