{"name": "oiistar-chicago", "reviews": [{"review": {"des": "During my current trip to Chicago tried this super awesome place I discovered !<br>I wish I could rate them more than  5 but sad there is no way though would love to<br>So came here with family as they love this Awesome place <br>Also before I start my review want to share my strong dislike for pork belly and this place actually redefined pork belly for me <br>To start with orderd bao pork shoulder / pork belly and Tonkatsu<br>Except tonkatsu the pork belly and shoulder was super excellent <br>Did I actually enjoy pork belly couldn't believe it but yes I really really did couldn't get over it <br>Then ordered their spicy garlic Ramen noodle soup with pork belly again They say their pork products are the best and Yes they sure are.<br>This was the best ramen I ever ever ate Wow !!<br>The pork belly was super awesome and melts in ur mouth <br>What great taste !!<br>This is so far my favourite restaurant in Chicago <br>Wish they would open an outlet in Toronto too  This is a must visit during my future trips to Chicago<br>Not to miss Loved their huge bowl like soup spoons Great experience!!", "pics": null}}, {"review": {"des": "Oh my... what oishii ramen you have Oiistar. Did I really just find my next favorite spot to Kizuki for the best tasting tonkotsu ramen in town??<br><br>Oiistar had been on my bookmarks for years and it wasn't until recently when a visitor from home came we went together. This dimly lit and long restaurant was bustling on a weeknight and we waited about 20 minutes for a seat. Despite it bring utterly confusing from the outside, they have a good system of texting you when they have a spot ready- table or bar.<br><br>We sat at the bar and shared a long table with other patrons. The menu had steaming ramen written all over it, and my friend and I each ordered our own bowls. We also ordered an Ebi Tempura Bun ($4) to start and WOW, the crunch and texture of the shrimp along with the softness of the bun was impeccable. Best bun I've had at a ramen shop for sure.<br><br>I chose the Oiimen Ramen ($14) since it was a classic take on tonkotsu ramen, one of my favorite kinds. This massive bowl of ramen came out very quickly and from first smell, I already knew it was going to be good. The garlic really came alive in the broth, the Berkshire pork belly was phenomenally tender and literally broke off in my mouth, and the thin egg noodles were all on point. Hands down one of the best bowls of ramen I've had in Chicago.<br><br>Despite the food being so amazing, I have to mark it down one star because of the odd service that we experienced. My friend wasn't able to finish her bowl at all so we asked to have it boxed up to go. A few minutes goes by and we receive our checks and pay, but no food? The server even spoke through another party (since we were sharing the table), and I could imagine myself being annoyed if that was me being interrupted by someone else's problem.<br><br>Eventually we ended up hunting down a server just to investigate, and managed to get our food after back after ten minutes. Not sure what happened but hopefully it doesn't happen to anyone else. Nonetheless, Oiistar is fantastic and a spot I plan on returning to soon.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Vdo2wrE8hUwcVK5_L8bQGg/168s.jpg", "caption": "Oiistar Ramen $14"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/8TJHy6Tl-T4N1migwjSfow/168s.jpg", "caption": "Ebi Tempura Bun"}]}}, {"review": {"des": "Ramen was awesome and pork belly in the ramen tasted like Chinese braised pork! The pork was really tender and juicy. The portion size was huge!!! Got the pork belly bun, Spicy garlic, and Oiistar ramen! Pricing was $14.5 for one ramen and $4 for pork belly bun. <br>Parking: Street parking but free parking about 5blocks or so if you can find one. <br>Service: was great! I asked for lemons and they gave me tons and manager(owner) came and asked if everything was good! Wait time for not bad.", "pics": null}}, {"review": {"des": "Absolutely delicious!!!! This would surely be my MUST GO TO spot when I come back to Chicago. <br><br>This place can get quite busy, waiting times up to 40 minutes, so plan accordingly. I had the shrimp bao, so good, I wanted to have 10 more. Oh, if I lived here, I would have had 10 more. But being on a scheduled visit, I had to limit myself so that I could try other items. The other items, were just as delicious! I thought for around $14, this ramen better be good. It was frigging GREAT! The portion sizes are HUGE, good thing I shared with my Fiance. There was a generous amount of protein and the noodles were in house made, perfect! I wanted to drink all o the broth! We also had the fried chicken, hot fresh crispy and juicy!! <br><br>I was very pleased and impressed with this place. At home, I have not found a single ramen place that I even came close to liking!! Eating here was a real treat!", "pics": null}}, {"review": {"des": "My 3-star rating means I wasn't mad that I spent my money and calories here, but I won't be putting this on my list of places to repeat giving how much great food there is in Chicago. The food was decent but overall it did not shine. <br>___<br><br>I came in to Oiistar today for lunch, just after they opened for the day at noon. The two window tables had already been taken but the remainder of the restaurant was mostly empty. By the time we left, around 1:30, it was pretty much full. <br><br>For starters, we ordered two buns: the duck breast and the tempura shrimp. The waiter said these were definitely the best two buns they had. The buns come one per order, so they are honestly a little pricey as they're $4 per bun or more. The duck breast bun is $4.50, and there was not a ton of meat in it. It was like, 60% herbs. The flavor was decent; the duck had a chargrilled taste, and the fresh herbs were good on top of that. The tempura shrimp bun was definitely the better of the two, though. It was much bigger. The shrimp tasted fresh and juicy, and the breading and everything else made for a great textural bite. A downside to both buns was that they both immediately split in half when we picked them up, because they were thinner in the middle. This made them super awkward to eat. I've never seen a bao bun do this like a cheap taco before... it was weird.<br><br>For ramens, we ordered the Spicy Garlic Shoyumen and the Chadolmen Modern. If you go to the menu on their website, you won't see these because the website is outdated. In both of these ramens, the noodles were overcooked and too soft, and there were too many noodles given the amount of broth. The eggs were undercooked, so they were simultaneously hard to cut, and when you try to cut them, the yolk runs out everywhere into broth and are lost (generally i like my ramen egg to be more gelatinous). <br><br>The Spicy Garlic Shoyumen had three pepper signs next to it, which means it is the spiciest ramen on their menu. The version of this that we received had barely any spice, and the Chadolmen actually had more of a kick. I ended up adding a good dose of their table hot sauce to make this one be actually spicy. The broth on the Shoyumen was not anything special. It tasted very thin and basic.  Yes i know it's a chicken-based broth, but even as chicken-based broths go it was not that flavorful. I will say they did an excellent job on the pork belly though. It was tender and a little charred / smoky, and it was definitely the best thing about this dish.   <br><br>The Chadolmen Modern reads like it's going to wow you with flavors.... Brisket, ground pork, kimchi, spicy miso broth.... The broth was better than the Shoyumen broth, but this one still underwhelmed. The brisket I got was straight up cold, so I was swimming it around in the broth to heat it up before eating it. Some of the brisket pieces were actually kind of tough. They cut the brisket really thinly, which is weird. I lived in Texas for three years and never once saw a thin brisket. I was really expecting it to be a thick chunk to pull apart, like the pork belly. As far as the ground pork, there was a small dollop of it that mostly disappeared into the bowl. I don't remember it having all that much flavor.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/U4bSEoNdYTsy_LOQGv9IDQ/348s.jpg", "caption": "Duck breast bun ... kind of small and split in two when picked up"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Hr5mDVjES9-2--pzOjbzaw/168s.jpg", "caption": "\"Spicy\" Garlic Shoyumen"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/kXDfiIds8BtGaVaPR3EXZg/168s.jpg", "caption": "Tempura shrimp bun ... split in half when picked up"}]}}, {"review": {"des": "Awesome ramen and baos, and very large portions! Ramen broth was rich and flavorful without being too salty. Most of the ramen options have a bit of a spicy kick but there are a couple of non-spicy choices too. Noodles are housemade, and my ramen came with two generous pieces of melt in your mouth Berkshire pork. The baos are large too, so they are a fork and knife affair, not something you can fold over into a taco/sandwich. The shrimp bao was my favorite, but we also tried the Berkshire pork, 6 hour pork shoulder, and beef/mashed potatoes and all were delicious.<br><br>The food comes out quickly, and service was great. My tea seemed a little weak in flavor but I'll let that pass. Overall, a great dining experience!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/vyI4F4rv2QtQXKzXGW70Cw/168s.jpg", "caption": "Umami ramen"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/jvkc1dG4Goan29WRoNrRMQ/168s.jpg", "caption": "Berkshire pork bao"}]}}, {"review": {"des": "OMG where to start! This place was just plain amazing. Everything we had was like a flavor bomb with a lot of umami (my favorite!!). <br><br>First the setting. Dimly lit restaurant with a decent amount of seating with a great selection of 90s music playing. We arrived during lunchtime on a Saturday and the place was packed, but that didn't impact the service at all. Our server was friendly and attentive. Our food came out quickly and the entire lunch was very efficient. <br><br>Now on to the food. <br><br> My wife and I split the oii salad, pan seared portabello mushrooms, and the pork belly, mushroom and duck breast buns. <br><br>MY GAWD. This was such an amazing meal.<br><br>Every one of the dishes was exploding with flavor. And every one had a number of different flavors tickling the various taste receptors all over your tongue. Yet despite each bite being packed with a ton of different flavors, it was never overwhelming or too much. <br><br>My personal favorite was the duck breast bun, but the pan seared portabello was a very close second. <br><br>If I lived in Chicago, this would be a regular haunt for me. Such amazing food and I didn't even try the ramen they are so well known for!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/LhfPGTwdKlHJ6A_dUcEtMg/168s.jpg", "caption": "Oii salad"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/a4kPJ1D-5OTOToFJk31eeQ/168s.jpg", "caption": "Pan seared portabello"}]}}, {"review": {"des": "Came by Oiistar after a first bout of Chicago cold weather. Really gets the broth and noodles craving going. <br><br>Came by on prime dinner time on a weekday (around 7pm). Oiistar was full but not crazy. Waited about 20 minutes, although the service was a bit chaotic and there was not anyone taking people at the door - didn't seem like they had a dedicated host / hostess. Overall, one ding was the entire night Oiistar had a bit of an understaffed feel - service was really slow and somewhat haphazard, and all the staff looked a little frazzled. Interior is dark and fairly small. They have mostly 2 tops and some 4 tops, bar seating and a large communal table. Not really great if you are trying to come here with a large group. <br><br>The menu has a wide selection of bao - meat or veggies put together in a v shaped fluffy wrapping. The prices are about $6 each which was a little steep for the amount of food you get.<br><br>The ramen selection has a few classics (a few tonkotsu types) as well as some creative options like a seafood ramen and an Indian curry inspired ramen. There is a few vegetarian bao options and a vegetarian ramen. I got the classic oiimen which came with creamy broth, garlic oil, and a thick slice of pork. The egg had a delicious creamy yolk. <br><br>Overall, Oiistar serves the heavy, creamy, very salty and meaty type of ramen that seems to be really popular in Chicago. Bowl is solid, with a fairly normal portion size. You can choose between the thick curly noodles, the straight noodles which are house made, and rice noodles which are a gluten free option. The curly noodles are the chewy eggy type that places like high five, ramen-san also serve. I liked the straight noodles better which had a more wheat-y taste. They serve beer and sake here as well.<br><br>Overall, solid ramen option in Chicago.", "pics": null}}, {"review": {"des": "Wait : none for Tuesday night <br>Service: super friendly and very informative, they suggest us to share a bowl of ramen <br>Ambiance : quiet and nice music <br>Food : we had a signature ramen. The broth is not too thick but flavorful. Noodle is great but nothing special. Slow cooked pork belly is tasty. <br>Buns r the best. I tried Berkshire pork belly and tonkatsu. Both of them are outstanding and would love to come back for them. <br>Price : affordable and I would say cheaper than other places coz you can literally share with someone <br>Overall : won't mind to come back and will love to take friends", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/7ojKJIcCUMf6y-01YWS7IA/348s.jpg", "caption": "Hrs Pork Shoulder"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/cvDifKmL6sbAD3Nx3k5wpg/168s.jpg", "caption": "Pork Loin / Pork Belly"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ABVvvJk1Bgqfa4ZOKRvFNg/168s.jpg", "caption": "Spicy garlic ramen"}]}}, {"review": {"des": "I came to Oiistar with a friend around 8PM on a Saturday. Oiistar was pretty busy with the wait estimated to be 20-40 minutes. We decided to put our name down. <br><br>The wait ended up being about 20 minutes. It was a bit confusing because you can track where you are in the queue through a link they give you via text. We were at \"position 6\" up until they gave us our table. You only have 5 minutes to get back once your number is called, so I wouldn't rely on that...<br><br>Once we were seated we ordered right away and the food came quick - within 10 minutes. I loved the ramen here! I ordered the Oiimen Classic; the broth was delicious and savory, the pork was tender, and the noodles were al dente. <br><br>What really surprised me were the portions. For $14.50 you get a HUGE ramen! Now I typically have a hard time finishing my ramen as it is, but when I was done, it didn't even look like I touched it :O<br><br>Overall I was really impressed - the flavor and price point were a solid 5/5 in my opinion. I'll be back for sure!", "pics": null}}, {"review": {"des": "My friend and I were seated immediately at 9pm on a Saturday evening! The very friendly servers checked in on us frequently as we settled in and enjoyed our meal even with the restaurant so busy.<br><br>The prices look just a tad above average, but once your food arrives you absolutely WILL NOT be disappointed. The bowls were deep, wide, and seemed never-ending with the perfectly cooked and textured ramen noodles! I ordered the chadolmen (korean style) ramen and tonkatsu (pork cutlet) bun, both perfect for my savory meat-crazed tendencies. I've had a lot of great ramen throughout my childhood in honolulu and this was VERY much on par with those, dare I say more creative and satisfyingly filling. One thing, though, is I wish there was a spicier ramen option for those craving a thrill and good ol sinus clearing. Regardless there are so many other fantastic flavor options I'd go for. Oiistar, I'll be back as soon as I catch my next amtrak back to Chicago!!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/WQG6N3dXCd_d00QjH5KmJA/348s.jpg", "caption": "Tonkatsu Bun"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Ia_QcruDsbl5agmP-xmwDg/168s.jpg", "caption": "Duck Bun"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/L5SxQV-wWVqzNCqB4JzhaA/168s.jpg", "caption": "Chadolmen Ramen"}]}}, {"review": {"des": "1. What a euphoric bun<br>2. When I'm on death row, drown me in this ramen<br>3. Ask for Alex Rodriguez<br><br>Came in sober, leaving drunk. Potentially infused ramen. Just kidding- maybe it was the sake.", "pics": null}}, {"review": {"des": "The olace was packed, we grabbed a seat at the crowed bar. I stuck with the spicy garlic. The broth was wonderfully full with flavor. Ramen noodles itself was chewy and sloped up the soup well, however I was disappointed ib the amount of ramen. It was very light compared to other ramen places for the price point. Service was good and environment was clean.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/k1h7R2_Ydr222_NR2v1i9g/348s.jpg", "caption": "Spicy garlic ramen"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/MdIygLZIxhiwxyM1cfCGSA/168s.jpg", "caption": "Wine making, I assume is available"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/iDRtB_tMVdGCe-tyU6ULlA/168s.jpg", "caption": "Menu"}]}}, {"review": {"des": "Pretty good.  I think I need to give it a 2nd run.  I wasn't blown away, but I did enjoy it.  Oiistar was recommended as a good friends favorite Ramen in the city.  I trust his taste, but they didn't really do it for me. I think off that basis alone its worth it to give it another go. To be continued..", "pics": null}}, {"review": {"des": "Such a hidden gem in Wicker Park. We ordered the duck breast and pork baos as appetizers. They use fresh veggies on top. Pork and duck breast were very tender and not dry at all. For ramen we tried the oiimen (traditional ramen) and the musclemen. Both broths were different and delicious in their own way. The mussel ramen was spicier and they definitely loaded you with many mussels! Perfect for a rainy day! I can't wait to come back when I'm in Chicago again!", "pics": null}}, {"review": {"des": "We went on a Saturday night for a double date. We were told 30min and ended up waiting an hour. A group of 6 even got seated before us and I even heard them question why. I obviously never got the answer. It's best to have just two people to be seated easily it seems. <br><br>The place is noisy with everyone being so close and space is tight. It's difficult to have a conversation with each other. <br><br>Shareables were great. My husband I shared a mushroom and avocado tempura and pan shears mushrooms which was so tasty. Then I had the veggimen ramen with egg. Portion size is huge! I couldn't eat it in one sitting and took half of it home. My husband and I could have shared. There was plenty of veggies which I loved. It had the least amount of sodium per the kitchen staff but just tasty enough. Really good for a nice chilly night in the city. <br><br>Please be advised, parking is also a challenge. We were circling around looking for someone to leave. And we weren't the only car.", "pics": null}}, {"review": {"des": "After having tried almost all the popular (and unpopular) ramen shops in Chicago, I have to say Oiistar is at the top of my list. I love how big the portions are. I can always finish my ramen, but at Oiistar I felt like I still had half left when I was feeling full. You definitely should try and make reservations for this place, as it seems to always be super busy and packed. <br><br>Really want to try their Bao next time I'm here since I've read so much about it. Does seem pricier than the ramen though at $4 a piece.", "pics": null}}, {"review": {"des": "HOLY BUNS! No but really I think Oiistar gets the title of best buns in the city. The PB is tender and saucy and messy to eat but totally worth it. <br><br>The ramen is up there too and although not the absolute best I've had in the city probably offers some of the more unique options. I love the garlic one but find the Tikkamen really interesting too. The noodles are delish. Only complaint is the egg is cut a weird way (we're ramen snobs I know) and didn't seem marinated.<br><br>The biggest tip I can give you about this place is to split their ramen unless you've got a dinosaur appetite. It's honestly just way too much and can feel disgusting/wasteful after a while but splitting it along with getting a bun (!!!) feels great and it's cheaper. <br><br>On a Wednesday night there was no wait but the place isn't too big so I can see it getting packed. Great ambiance too.", "pics": null}}, {"review": {"des": "Ramen is my go to during the long chicago winters (which apparently last into May) and oiistar is a solid supplier for a fix...<br><br>I like their seasonal/special ramens, past versions have included the brisket and spicy ramen bowls... good broth, crazy large size (definitely shareable) and tender protein...  next on my list to try is the tikkamen and the seafood <br><br>Also the buns are pretty good, the tempura cod is my favorite <br><br>If you're in the neighborhood, definitely worth stopping in...", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/AAYnKoSat0JQXcDvk91tbw/348s.jpg", "caption": "Tempura Cod"}]}}, {"review": {"des": "It was a mildly cold fall day and my boyfriend and I were on a hunt for a good ramen meal after watching the Vikings football game. We wanted to venture the Wicker Park area to explore. After performing an intense scan on yelp for ramen places we decided to head to Oiistar. <br><br>This place is a gem. There were open tables when we got there but the place had a decent crowd. The menu selection looked delicious - I already knew that I would need to come back. We started with an order of the pork belly buns. Literally it was a mouthful of foodgasm and I would come back just for that. We love anything that involves spicy and garlic so we went for the Oiimen ramen. The broth was delicious, the noodles were great, the poached egg was picture worthy, and they had the right amount of pork belly. <br><br>Oiistar was exactly what I was looking for and i can't wait to come back again.", "pics": null}}, {"review": {"des": "Delicious ramen in the heart of Wicker Park! Ordered the beef/mashed potato and chicken buns and the spicy garlic pho. The beef/mashed potato bun was shockingly good. I loved the broth of the spicy garlic pho - it had just the right amount of spice and was very flavorful. They even allowed me to exchange the pork for fried chicken for free. If you come during a busy time, put your name on the list and check out the awesome art gallery next door.", "pics": null}}, {"review": {"des": "Oiistar portions are huge for the price of their ramen, $14 a bowl easily twice as large as the other hip ramen joints in the city. In terms of flavor though, Strings wins on both its noodle texture and broth richness. However, Oiistar is a good option if you want bang for your buck in terms of ramen . We got the pork belly bun ($4), which was a bit steep but it was a generous size. The sauce was a little bit salty though. It came with micro greens that resembled clover. <br><br>Onto the ramen: I tried the Oiistar classic as well as umami. I thought the pork could have been fattier, and it was marinated in a straight soy sauce so I couldn't get the true essence of PORK. The noodles were the thin kind but still had al dente texture.  I liked the wood ear and bamboo shoots for texture. The egg was decent. However, the flavor was not rich. They make their own sangria which is pretty cool though.", "pics": null}}, {"review": {"des": "Any ramen enthusiast in the area needs to check out Oiistar. It has quite a trendy vibe, great for a small group or date. I came on a weekend evening with a small group and was seated right away at the bar. <br><br>I tried one of their chicken bao appetizers but thought it was a bit on the greasier and saltier side. Our ramens came out fast soon after we placed our orders. I choose their classic one, the Oiimen, and thought it was delicious. The bowl is ginormous and packed with perfectly cooked ramen noodles. The pork belly slices were very thick and flavorful. One of the downsides was that our overall service was quite slow. We had to remind our server at least twice to bring our checks and it felt like a very long time before anything was done.", "pics": null}}, {"review": {"des": "I've been here a few times and really enjoyed it. The portions are huge and the broth is usually flavorful. This last time I went, it seemed that the quality had dipped. Broth was not as powerful and it was just meh. Probably won't return", "pics": null}}, {"review": {"des": "Shockingly Oiistar was not super crowded for a Friday night! We were seated almost right after we got there in their long communal table with other parties which did not bother us. It was a group of 4 of us and we started off with a few different buns... tempura shrimp, duck breast, pork belly, and pollo buns. We also shared the fried garlic chicken which was great!! Highly recommend sharing the fried chicken (we got it spicy) however it was not that spicy... the sauce was very tasty and the chicken was juicy. <br><br>We all ordered our ramen entrees... Two of us got the classic ramen (Oiimen) and my other two friends ordered the Pozolmen and the Musclemen. The ramen is a lot to go through.. I saw a lot of people left a lot of their broth there and others had left overs. I kind of just ate most of the noodles and the pork belly and left some of the broth... it was just too much! Finally we also tried 1 of each of their desserts... the poached pear, bao donuts, and the creme brulee. Honestly my favorite were the Bao donuts since they came with some sort of dipping sauce that were just amazing. The poached pear was good but hard to cut with the spoon.<br><br>They also have a drink menu with a few sakes and other traditional drinks ... I got myself a small bottle of sake which was very smooth (can't remember the name)  and my friend got the hot sake which was also very smooth and easy to drink. The place can be a bit loud depending where you are seated but it was a great experience overall. I would recommend it if you are in the mood for some serious ramen dish and if you don't mind crowds... the place is small and they pack people there!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/sa_FZ_rbrTh0UQzLDvQhIg/348s.jpg", "caption": "Saved room for dessert... Poached pear, creme brulee and we also tried the bao donuts (not pictured). The Bao Donuts were my favorite!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/MidNIba8nIxo2j0JHsW-Rw/168s.jpg", "caption": "Had to go with the classic ramen.... Huge portion and super tasty!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/lr-5dQxDVyk4x9AvTO6DQA/168s.jpg", "caption": "All sorts of buns... Pollo, Shrimp, Duck breast, and the pork belly. Shrimp and Pork Belly were my fav!"}]}}, {"review": {"des": "Some of the best pork belly I've ever had in my life! I took my best friend to oiistar for her birthday and it turned out to be the perfect choice. We got here around 6:10 on a Friday evening and I was afraid we'd have to wait but the restaurant was only about half full and we were able to be seated immediately. I got the umami, my friend got the spicy garlic ramen, and we ordered a side of garlic baguette. <br><br>The ramen arrived really quickly - I want to say in less than five minutes and besides tsurutontan in New York, it was definitively the biggest bowl of noodles I've ever had in my life. The umami broth was super strong, slightly sweet, but the pork belly was really the winner of the night. The pieces fell apart effortlessly and the fat melted into my mouth. <br><br>Be aware of the law of diminishing returns. In hindsight, I could've shared a bowl with my friend, and maybe gotten a bun each. While the first half of the bowl was a miraculous experience, the second half was slowly painful. I ended up having a huge stomach ache from being too zealous about my bowl of ramen, so be mindful about the portion sizes. <br><br>Other than that, I'm so glad I got to experience oiistar. I personally gave a thumbs up to the chef and furious spoon is nothing compared to oiistar.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/fQxSikssQBtNTUTo6a4FWA/168s.jpg", "caption": "The pork belly"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/GxpOKdwoI1XQjaYbwulUrg/168s.jpg", "caption": "Umami ramen"}]}}, {"review": {"des": "Based on the server's recommendation, I had the most popular ramen, which is the spicy garlic. The flavoring was good and the garlic smell came very strong, but it was a bit too oily and salty for my taste. They are very generous with the portions, there are 2-3 really big pieces of meat in the ramen. I also tried the duck breast bun for appetizer. The duck breast tasted good, but there were some water or soup at the bottom of the bun, which makes the bun a bit mushy. Overall I would still recommend give Oiistar a try!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/5jIGVnUnBNTElElBTFb6dw/348s.jpg", "caption": "Spicy Garlic Ramen"}]}}, {"review": {"des": "THIS PLACE IS AMAZINGG!!! I went here in early February and forgot to write a review. I came here on a date, and I have heard of the place but never really thought about going there. We roll into the joint and it's super slammed but we end up getting sat at the bar. The bartender was amazing and was just the right amount of attentive as well. My date order the ramen and the portion was freaking huge, I had a bite of it and it was so delicious. But me being me I looked for anything but ramen...and I found exactly what I wanted. I ended up getting their version of jajangmeyon and it was honestly amazing, it definitely wasn't authentic and was their own twist but it was so good I ain't even mad. The portion was huge as well for the price.<br><br>Awesome place that's super trendy, super delicious food, and great service. Sadly I don't live in the area but I will be visiting again.", "pics": null}}, {"review": {"des": "Ramen bowls are ginormous! This was the first time I couldn't finish my ramen serving. My friends and I ordered the Oiimen, Tikkamen and the Chadolmen as our main course. We also ordered the Fried Garlic Chicken (Sambal) to share.<br><br>My bowl of Oiimen Classic was good--soft-boiled eggs were well done, pork belly was tender & marinated throughout, and the broth was relatively creamy. I wasn't a big fan of the noodles, which is really just my personal preference speaking. They're straight noodles that aren't the usual egg noodles found in Japanese ramen that I love. To be fair though, Oiistar is located in Wicker Park with a couple other ramen places--I'd be surprised if they didn't put a twist to this classic food. So definitely expect this place to serve fusion ramen and not authentic ramen! My friends and I did feel like we had a hearty meal out of our very large bowls of ramen. All of us took home some leftovers to finish the next day.<br><br>The Fried Garlic Chicken in Sambal sauce was amazing. Flavor seeped through the chicken and skin was fried crispy. Definitely recommend getting this as an app!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/EHkqi_TWgE7J9S5eJ1AKwQ/168s.jpg", "caption": "Fried Garlic Chicken Sambal"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/3nRXD9RakWr-15gxUIfAIQ/168s.jpg", "caption": "Oiimen"}]}}, {"review": {"des": "I went here with a friend last weekend and really enjoyed it. I've heard great things about Oiistar and had to try it for myself. When I arrived we were able to be seated immediately for a party of two. We started with two buns: tempura shrimp and pollo. Both were delicious. Then I ordered the pork belly classic ramen which I was happy with. It's actually large enough to share between two people. My friend and I were going out afterwards and did not want to carry around leftovers or waste food so it ended up being perfect. The ramen was tasty, but I've tasted better IMO. I  feel like it was tasty but I honestly prefer other places. I would come back if I was going to be in this area for drinks or something afterwards but I don't think I would seek it out.", "pics": null}}, {"review": {"des": "Came here with as a group of 6 on a weeknight and it was about a 15 minute wait.<br><br>The ramen bowls here are definitely hugeeee. I loved the garlic chicken sambaal which I would come back for just for that. It was so good and full of flavor.  My ramen itself wasn't too memorable and I thought the broth itself was salty af. But the appetizers are definitely worth coming for. <br><br>They were able to split 6 credit cards on one bill which was nice as well.", "pics": null}}, {"review": {"des": "I had the porkbelly bun and the Spicy Garlic Snoyumen ramen. It was delicious! Ramen wasn't overly spiced and the noodles were great. Perfect ramen spot to warm yourself up in this chilly Chicago weather! The restaurant is a tad small, pretty cozy, so it can take a bit of time for staff maneuver tables/ create spacing, but it adds to the cozy atmosphere! Great service. Overall, ramen and buns are a must-have!", "pics": null}}, {"review": {"des": "The landscape of ramen options have definitely grown since the last time I've visited Oiistar. I still like the physical appeal, but man, the Umami ramen I had seems to lack a couple of refinements I'm used to in a bowl.<br><br>1) Too much broth and it's way too salty. I was a little annoyed at the big, heavy, ceramic soup spoon, but I guess it doesn't matter since there's no way I could drink this salt bath.<br><br>2) Very thick cut pork belly. Again, it's a lack of detail and refinement, I've got chopsticks, not a fork and knife. It's does fall apart if one takes a stab.<br><br>3) This is going to sound terrible, but the egg wasn't cut lengthwise. Presentation-wise, it falls short, but the stubbiness also makes harder to pick up. On the plus side, they didn't skimp and gave you a whole egg.<br><br>I discovered there's also bits of ground pork and bamboo shoots, but was just difficult to fish out.  Overall, could be better balanced bowl.", "pics": null}}, {"review": {"des": "On one of the many recent cold as we don't know what Chicago evenings, a friend and I decided to get some ramen after work. He suggested Oiistar because he had just been there over the weekend and LOVED it. Hey, I'm easy going so I said cool. <br><br>We got there at the perfect time, around 5:30pm or so, because it was pretty empty. Cool little set up in the restaurant which makes it so hip and cute. You definitely want to hang your coat on their coat rack because there's no way you can have that and anything space consuming at your table. They're small tables, but I didn't mind. <br><br>Our waiter was prompt, super cool and talkative, and very knowledgeable and suggestive about the menu. Loved it. So far, I was digging Oiistar and told my friend I see why he wanted to return. <br><br>We both ordered a Sapporo and their beer prices are very reasonable. I was previously cautioned about their portion sizes being large so we only ordered two buns to start: the pork belly and the duck breast. My goodness. I could only eat half of the pork belly bun since I wanted to ensure I had room for my ramen. We both ordered the Oiimen but my friend added the spicy paste. Wow!!!! The ramen was soooooo good. Like soooo good. I could barely finish it because they give you so much. So yes, I had a take home bag. <br><br>I will definitely return to Oiistar. Love this place and it's definitely one of my favorites in Chicago. The atmosphere is hip and cool, the waitstaff is great, the food is amazing.", "pics": null}}, {"review": {"des": "You know how you have a place that sets the standard for a type of food, and that you use to compare to every food like it? Oiistar is that place for ramen. The oiimen classic is my go to and the crowning glory of ramen for me. First off, the bowl is HUGE and piping hot. There's plenty of ramen noodles, along with veggies and some ground pork. But the real winner is the slabs of pork belly. They have the perfect amount of fat, flavor, and saltiness. The broth? Simply perfect. I dream of this ramen. If you're not very hungry, it definitely is a lot of food and can be shared. I've had the miso ramen, but it was just a bit too salty for me. Looking for an app? Get the mussels, they're delicious! Savory and has that oriental flavor if you ordered from an authentic Chinese seafood restaurant.<br><br>I come here every single time I'm in Wicker Park, and that's saying a lot.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/rYrf23We6jThZL9n9GhkdA/348s.jpg", "caption": "Oiimen classic"}]}}, {"review": {"des": "Oh yea!<br><br>So we came here on a Saturday at 8pm and I assumed there would be a long wait. NOPE. It took about 15 minutes to wait for a table so score 1!<br><br>We decided to order up a storm, we did NOT know how large the ramen bowls were.<br><br>Atmosphere: <br><br>It's a cozy little environment. Dimly lit. Not pretentious at all but still a cool vibe. There is no host stand so you might walk in and think, oh its like an IHOP I will seat myself but someone with an iPad will come greet you!<br><br>Apps:<br><br>We got the Pork Belly Bun, SUPER good, it was two of us and we split it in half. Then we got the Fried Garlic Chicken. Warning on this it is a LARGE portion. I would be careful getting this because it could be an entree. However the flavors were solid and good, it was NOT spicy. Please don't believe that.<br><br>Ramen:<br><br>Okay, now for what you really care about. First, the portion sizes, don't worry they don't skimp here. In fact, the bowls seem larger than most ramen places I have visited so kudos to these guys (or gals). The Ramen was very good and flavorful. The Oiimen ramen was great. My only criticism was that it wasn't actually spicy. The menu and our waiter said they were spicy and the first sip I thought, nope not even sort of spicy. I added some of the chili paste and it was a beautiful flavor of spice but I wanted more umph!<br><br>Overall a SOLID ramen spot in Chicago! I will be back here for sure. They also serve Golden Monkey which if you love beer, you know its legit!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ofUTCQd2K0Mp-2F3zXaftg/348s.jpg", "caption": "PORK BELLY"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/DEEHnKI3RDqsBuMaKr1HVQ/168s.jpg", "caption": "Beer of Champs"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/b7KduWzdIRoylMkIJJ_oEg/168s.jpg", "caption": "FRIED GARLIC CHICKEN"}]}}, {"review": {"des": "Always so good and the menu is a bit more creative than a lot of the other ramen places around", "pics": null}}, {"review": {"des": "Typical ramen shop. The ramen's good, the soup base is kinda salty for me though. The pork belly's been cooked for pretty long time, it's actually the chinese Dong Bo style lol... but over all pretty good food except that the server forgot my beer cause shes a little busy.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/qY5L07bdv23SIfOVIuFOWw/348s.jpg", "caption": "Typical karaage dish"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Wnn4IXKEudusqxUBSj7DQg/168s.jpg", "caption": "Classic, good noodle and soup"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/j6tso43mDTatSikNt6iPHg/168s.jpg", "caption": "Best pork buns yet in Chicago, uses Dong Bo style to cook the pork belly"}]}}, {"review": {"des": "Phenomenal ramen. Service is great. The fried chicken is also a must order. Love this spot.", "pics": null}}, {"review": {"des": "My fiancé and I were craving a new ramen place since we have a ramen bucket list going.<br><br>We went here on Friday night and got in right away even though it looked busy. We sat right by the kitchen and got to watch the magic happen, which was so fun to see. The kitchen was a well oiled machine, just the fastest staff working so efficiently.  <br><br>Our waiter was fast, attentive and informative. We ended up sharing a pulled pork belly and both had the Oiimen ramen, which is their most popular. It's your typical ramen bowl. We also ordered a bunch of drinks, which were very well priced!<br><br>I must say, the serving of ramen was huge and came in a giant bowl (yes, please). I got to take some home to reheat for later. <br><br>The pulled pork bun was good and worth the price (under $4). The ramen wasn't the best I've ever had but it was definitely good and worth it. I'm a huge fan of a good, hearty broth and the broth just didn't quite do it for me. I wish it was a little more flavorful and more rich. <br><br>The experience, service and tasting of different food was well worth it for us! We had such a great time sipping our drinks and watching the amazing kitchen staff working their magic.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/UShXH1cK3NKU8SDi9wapAg/168s.jpg", "caption": "Pulled pork bun"}]}}, {"review": {"des": "I needed to rewrite my review because this restaurant deserves more praise. Oiistar is THE BEST ramen restaurant I've tried. Don't let anyone tell you differently. I've been coming here for years and brought different people here and they all fall in love. People I bring always come back with new people they want to share the food with.<br><br>The portions are huge and proportionate to what you pay for. A lot of times ramen places will charge the same amount as oiistar but the portions are half the size. I promise anything you get here will blow your mind. <br><br>If this is your first time going to Oiistar, order the Oiimen classic. If you're looking for something different, Tikkamen is amazing and the Veggimen is also superb. I personally really enjoy the duxelle appetizer. ANY bun you get will be amazing. If it's your first time, get the tonkatsu or the tempura shrimp. If you're looking for something different try the mashed or the mushroom. <br><br>The red sangria is my go to drink. The apples are always fresh and cut to order. There is usually no room for dessert but if you can, try the creme brulee. IT WILL BLOW YOUR MIND. Keep in mind there is caviar on there so it will be fishy if you don't eat it with everything else. They're coffee infused so it goes so well with the almonds and egg. <br><br>I cannot express my love for this restaurant enough. It deserves all your money and love!", "pics": null}}, {"review": {"des": "Hubby and I hit up Oiistar when we get a craving for a mix of ramen, buns, and fried chicken.  If we're judging just by the ramen alone, it's either our 2nd or 3rd favorite place in the city.  Very flavorful without being overtly salty.  Hubby thoroughly enjoyed the Oiimen during our most recent outing.  In terms of buns, the Pork Belly is my favorite: thick, juicy slabs of fatty pork covered in a delicious signature sauce and sandwiched between a fluffy pillow bun.  The Tempura Shrimp was also very good.  Each bun is the perfect size for one person or even to split.  The Fried Garlic Chicken is a great dish to share.  I prefer the sweet version.  The portions are pretty big for just the 2 of us so we always have extra to take home and the chicken is still pretty good the next day.<br><br>Service was prompt and friendly.  The first time we went here for dinner it was pretty crowded with loud music and vintage cartoons playing on the wall.  Last time we came right when it opened for lunch when it was a more quiet atmosphere.  Overall a great place to go and share a few plates and buns plus/minus a bowl of ramen or vice versa.", "pics": null}}, {"review": {"des": "For some reason when there are articles/discussions about the best ramen joints in the city, Oiistar is not mentioned.  But Oiistar has the best ramen in the city (at least based on what I have tried and I have tried many) in my humble opinion.  Many of these highly ranked ramen places tend to neglect their non-meat ramen, making the vegetarian or seafood ramen very bland and boring when it doesn't have to be at all.  What I love about Oiistar is that they put the same amount of effort into their non-meat ramen as they do with their meat ramen and I think that is a truer sign of talent than making the same pork belly ramen taste good.<br><br>I have had the veggie ramen and the seafood ramen.  The veggie ramen has a soothing broth with tofu, mushrooms, avocado, and mixed greens.  I love that there are so many noodle options (including a gluten-free noodle option) and you can add kimchi, a soft-boiled egg - which I think has an excellent consistency, and many other options.  My favorite is the musclemen which has a spicy, zesty broth that is absolutely delicious.  I really like the muscles, onion, chili pepper, scallion, and miso.  The flavors just go so well together.  <br><br>I also love the mushroom bun and the pan seared portobello mushroom appetizer.  They are pretty much the same thing except one has a bun and one doesn't.  The portobello mushrooms in both dishes are sauteed and seasoned so well.  I love the soy sauce reduction with the pickled ginger.  The bun is made very well.  The only weird thing about the regular mushroom appetizer is that there is a poached egg served but it's a cold egg while everything else in the appetizer is hot.  I was kind of turned off from the egg.  It was just kind of sitting there and wasn't really a part of the appetizer.  <br><br>We also tried the tempura cod and tempura shrimp buns.  The mushroom one is better in my opinion because the sauces are better.  The fish and shrimp buns were still good but I really wasn't into the mayo.  The tempura cod is supposed to have a thai chili mayo and the tempura shrimp is supposed to have a wasabi mayo and they just ended up tasting more like mayo rather than wasabi or thai chili.  The slaw and roasted sesame seed that came with both buns were very good though.  I really do like the fusion of French/European elements with Japanese cuisine here and find this to be a unique spot.<br><br>I like the sauces on the table and the nice big spoons.  Portions are large so you can easily split a bowl of ramen with someone and still have leftovers.  I love the decor of this place, how it's narrow, kind of dark, and modern.  They also have a lovely outdoor patio.  Service is okay, sometimes it's better than other times.  The drink selection is decent and the wine is very reasonably priced.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/GCY1noWNrOyJovOCZKaiPQ/348s.jpg", "caption": "Musclemen ramen with an egg."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/R9SBf-4Aybl5V_bwS7LwwA/168s.jpg", "caption": "Tempura cod bun"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/y2laUcptYkYPDkY1VffWtw/168s.jpg", "caption": "Tempura shrimp bun"}]}}, {"review": {"des": "These ramen bowls are HUGE. So flavorful but expect like two times the normal amount of servings for $15 a bowl. The baos were good, particularly the fish one.", "pics": null}}, {"review": {"des": "After trying most of the ramen in Chicago. This is probably one of the most consistent ramen place you can find in chicago. And definitively the fav at the moment. This review only applies for the Oiimen on 8/20/2018. The broth and the meat were able to keep up with the quality. The broth is smooth and comfort, more of the lighter side to drink unlike some heavy thick gravy or greasy soup. Service is usually nice. One star off because it might be time to change or check  that water dispenser/filter. The water tasted little bit weird. And a definite minus overall experience. hopefully the owner will look into or improve this in the future.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/70G2vDfXJPy89zqbf7SNng/348s.jpg", "caption": "OIIMEN"}]}}, {"review": {"des": "Cannot give this spot enough stars! Over the last year or so I've become a huge ramen fan and ever since I've stumbled upon this restaurant I haven't been anywhere else! Love the environment but the food is just AMAZING! From the buns to the ramen, there isn't anything I've had that has disappointed me. Plus the portion size of the ramen is enough for two meals! I always recommend this place to anyone looking for ramen!", "pics": null}}, {"review": {"des": "Solid four stars. Tempura shrimp bun was excellent! Combined all the ingredients that I really like and I had hard time resisting the urge of licking the plate clean. Goki bun was good too. I ordered oiimen ramen and it came in a huge (I mean HUGE!) bowl. I really liked the flavor profile but taking one star off for unbalanced dish, there was way too many noodles and too little toppings. Adding more toppings from the extras menu might help but then you are going to be left with leftovers and nobody wants to eat second day ramen. Otherwise great place with friendly service. I will be back!", "pics": null}}, {"review": {"des": "I'm obsessed with their sambal fried chicken! Five pieces of crispy fried chicken served on a ladle of sambal spice. Ugh, I can live on this all day long.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Slcu4teqIbTCojK1PXYyBA/348s.jpg", "caption": "Fried Garlic Chicken sambal. So deliciou!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Dl2gpAt0Bbczwqt6U1Kbqg/168s.jpg", "caption": "Spicy Garlic ramen."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/pGGAcb0n8rqOyDxz5pLdyQ/168s.jpg", "caption": "Spicy garlic ramen."}]}}, {"review": {"des": "This ramen shop is a cut above the rest. I know there are a lot of  food critics who will disagree, but my review is an opinion on the quality and service. <br><br>Service is above average. Case in point, my niece's order wasn't hot (temperature), so she asked the server if they could warm it a bit. \"Ma'am, we really can't warm it, but I will ask the chef to make a fresh bowl.\" That's customer service. Incidentally, he wrapped up the lukewarm ramen to take home.<br><br>The ramen itself is quite flavorful. I always get the bowl with the brisket. It is so good. There is enough brisket from start to finish. Try the fried chicken too. It is flavorful with some spice and a garlicky taste. <br><br>I've only had beer so I can't comment on much of the drink selection. Perhaps, I will try the sake since beer fills you up, and makes it hard to finish the ramen.", "pics": null}}, {"review": {"des": "Having tried most of the ramen joints in the city, this one is near the top. The broth is fatty with loads of flavor. The ambience is mild (unlike Furious Spoon who pumps their music too loud).<br><br>I've had the Modern ramen and Spicy Garlic ramen. I can, without hesitation, recommend both. The spice level in the garlic ramen is excellent-slow burn. I'd give it a spice level of 6 out of 10. My nose ran the whole time which is the way it should be. I've also sampled the Classic bowl which is good. I've had a few of their buns, also tasty.<br><br>I love ramen but this place never excites me, hence the 4 star rating. Will I go back? Sure. However, I haven't settled on this joint as \"my ramen spot\" so-to-speak.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/QdH9rQF1fjUa-XLvzARw-w/348s.jpg", "caption": "Spicy garlic ramen."}]}}, {"review": {"des": "Definitely one of my favorite Ramen places I have been to so far! The ramen bowls were huge and actually had a full serving to take home to eat the next day. I split the Duck Breast bun with golden raisin jalapeno chutney and the Tempura Cod bun with fennel slaw and wasabi mayo. We both agreed that the presentation for the Tempura cod bun was more aesthetically pleasing but the duck breast bun's flavor was superior. Our waiter was amazing and gave us great recommendations! <br><br>For ramen, I ordered the Oiimen bowl (the classic) which was so good. At the time I wasn't eating meat but I mad the exception because the pork belly was that good. The spicy oil and garlic was just enough spice for me and I can't tolerate spicy food that much lol. The atmosphere was perfect for a date night and a bowl could easily be split between two people. We took home both of our ramen bowls because with the buns we ordered we couldn't even make a dent in them. This will definitely be a go to comfort food place for me!", "pics": null}}, {"review": {"des": "I was surprisingly underwhelmed by the quality of the ramen at Oiistar.  I went with a few friends after seeing mostly rave reviews online and we all ordered different types of ramen.  While the portions are very generous, I found the broth to be quite bland in the few types of ramen I sampled.  Overall the food was ok and maybe I had my expectations a bit too high going in, but I am not in any rush to go back and would recommend other ramen places in the area before Oiistar.", "pics": null}}, {"review": {"des": "I haven't been to Oiistar since they opened. The menu has changed quite a bit and this is definitely a new addition. The flavor was quite unique and marinate of the pork offered a sweetness that balanced the saltiness of the broth. The noodles are made in house so you know they are good! I also love the large portions they give at Oiistar. Can't wait to try the other new additions!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/XOR5DuhbZNXDrqsu5sh56g/348s.jpg", "caption": "Umami Ramen // Berkshire pork belly, ground pork, scallion, tree ear mushroom, bamboo shoot, bean sprouts, soft boiled egg, and miso paste"}]}}, {"review": {"des": "One of my favorite ramen spots. Wishing they had one closer to the north side! Parking near Oiistar can be a headache, but the food makes up for it! I usually get a sangria, pork belly bun, and the classic ramen. All so mouth watering! My only complaint is that I always feel sleepy after my meal... but all worth it. Will be back in a few months!", "pics": null}}, {"review": {"des": "Came in with a group of 3 other friends on a Friday night around 6pm, the restaurant was pretty empty and even had outdoor seating (one of the main reasons we chose this place). The service was quick and the ramen came out in under 10 minutes within placing our orders! I got the Umami bowl and it was delicious and really generously portioned! The soup spoons they give you are huge and really help you enjoy a lot of the tasty broth the ramen comes in! I The pork belly that came with it was a great cut and less fatty than other ramen places I've been to. The ramen is DEFINITELY worth the money! <br><br>One thing to note would be that the outdoor seating area is literally on the sidewalk, so a little bit awkward when people super close to you in passing during your meal.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/qF4Xtw5P3iN18bDXLwxt8Q/348s.jpg", "caption": "Umami Ramen"}]}}, {"review": {"des": "Good, clean and simple.  This is exactly how ramen should be done.  The flavorful broth should speak for the dish and it does just that at Oiistar.  I would be back here in a heart beat on a cold night in Chicago.  The tables are always full and the buzz is the great food and fun environment.  The service is nice and although on a  busy day can be a bit slow they are very accommodating to any questions or requests you may have.", "pics": null}}, {"review": {"des": "This is absolutely the best Ramen shop in Chicago. Wicker Park is filled with Ramen sbops, and this one puts a the others to shame.  Prices are reasonable, the ambiance is great making it the perfect place to bring a date. <br><br>The spicy garlic ramen is my favorite but the others are definitely worth trying too.", "pics": null}}, {"review": {"des": "I sat at the bar and was quickly greeted w a menu and a bottle of water. I love not having to wait for water refills (I LOVE water) and not having to ask for a menu, so off to a great start!  I thought about ordering a bun and ramen until I saw how large the ramen bowls are. I went with the Umami ramen. It arrived pretty quickly and was delish! Great food, great friendly service, and plenty of leftovers for a 2nd meal. 5 stars! I'll have to go back for a few buns next time to try those.", "pics": null}}, {"review": {"des": "I went with a friend today, and the ramen was incredible. My friend is gluten free and vegan, and they were able to modify the ramen order with little issue, which is a huge plus. I can't eat any pork profits, and they were able to modify my bowl so that it didn't have ground pork and was simmered in the veggie broth instead of the standard pork belly broth. The portions were huge and there were plenty of delicious leftovers. Overall, excellent dining experience!", "pics": null}}, {"review": {"des": "Good ramen, nothing too memorable however. The tables are pretty small and it gets loud, so I would recommend this as more of a lunch spot rather than a dinner date.", "pics": null}}, {"review": {"des": "It was a bitterly cold day in the Chi. A few of my cousins and I were hanging out at an apartment nearby as we trolled on the Yelp review boards looking for something to warm us up. In the middle of my screen popped up Oiistar. One of my cousin's shrieked out in excitement. She had been here multiple times and loved their ramen. So with that, we trekked over to the ramen hub, in search of a comforting bowl of yum. <br><br>We were surely not disappointed. We were seated a few minutes after arriving to the restaurant. We were seated at a communal table so be ready to rub elbows with some strangers. The food came out in about 20 minutes after ordering. Three bowls of steeping hot ramen and 2 boas, a duck one and a pork one. I will say, we were so hungry all of it went down quick! And all of it was delicious! I would definitely recommend this place for those that want an intimate date night or a family get together. For those that are foreign to ramen, come on in! It's definitely a friendly atmosphere to intorduce your mouth to a new pallate.", "pics": null}}, {"review": {"des": "My first tinder date took me here.! I had the veg ramen. It was just delicious omfg.  I usually hate all the ramen places I have tried and was about to give up. Usually the ramen I order is very salty and the noodle is off. This  just hits all the spots for me. Too bad I live in Wisconsin . But I'll try to hit this place up whenever I'm in town. <br><br>       The tinder date went great and he texted me right after the date. Saying \"it was nice meeting me\". But I haven't heard from him since. Lol ‍ whatever , I'm just glad he took me to this gem!! Thanks tinder .! lol", "pics": null}}, {"review": {"des": "Love the veggie and tofu ramen here! Wonderful noodles and broth! I get the spicy sauce too and it's no joke. Super spicy. The buns are a great app too but be warned they're huge!!", "pics": null}}, {"review": {"des": "I first heard of Oiistar from Eater Chicago's \"The 18 Essential Ramen Shops in Chicago, 2017 Edition\" and as a total shellfish lover, I decided I had to try their Musclemen ramen!<br><br>I stopped by on a Thursday evening before the dinner rush started; there was a steady stream of customers coming in during my meal, but overall the crowd was easy and no one really needed to wait for a table.  This place is great if you want your ramen in a stylish, modern atmosphere.  The main dining area is dimly lit and there's plentiful bar seating, and I opted for a seat by their open windows for more air and light.  <br><br>If shellfish is what you want, the Musclemen ramen delivers.  I came here for mussels and I sure got mussels!!  It comes with an abundant amount of seafood!  However, that's the only significant topping on it other than scallions and chili, so it's not a very diverse bowl of ramen.  The long thin cuts of scallion didn't do anything for me to contribute to flavor and was a bit too strong of a texture contrast to the rest of the bowl; I may have preferred if the scallions were finely chopped, rather than julienned lengthwise.  My experience was closer to having a bowl of plain ramen with a side of mussels.  The broth was light -- their bonito miso lends a distinct seafood flavor -- and not too oily, although I prefer a richer and more flavorful broth.  I had them omit my chili pepper since I have a lower spice tolerance, but my server warned me that it would still have a lot of heat in the broth.  In the end, the broth had a kick but wasn't too spicy at all (perfect for me!).  You can be brave with their menu if you also have a low spice tolerance, but if you like really spicy food I suggest asking them to dial it up for you. <br><br>Not the absolute best ramen of my life, but definitely a solid bowl of seafood ramen in a lovely atmosphere.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ALB2_HRph74jtG4hkubKjQ/348s.jpg", "caption": "Musclemen ramen w/o chili pepper.  Still had a kick but not too spicy!"}]}}, {"review": {"des": "Ah, this is one of the contenders for the \"Top Ramen in Chicago\" title alongside Wasabi, Furious Spoon, and others. Well I came for the ramen so I can only vouch for the ramen.<br><br>Based on the reviews I knew I had to try either the Classic or Umami. I opted for the Umami. Guys - listen to the reviews that say the ramen portion is huuuge. I can usually finish big bowls of noodles pretty easily but I struggled with this one. Next, the broth. While I definitely enjoyed the broth (very flavorful, not too salty thank GOD), I think the Classic was better (stole some from a friend). The Umami felt like it had too much going on...again, not bad per se, but I personally prefer the Classic's taste more. The noodles were chewy and cooked well. With a place this fancy, I wish we had the option to customize and choose our noodles like many places in New York. <br><br>Service was prompt and friendly, though sometimes things get a little crazy when there are more people. It's also really DARK inside the restaurant when we went...not sure if this was a one-time thing. They have limited outdoor seating which was nice, but you're right on the sidewalk and it's a pretty pedestrian-heavy area... so just FYI. Overall definitely worth checking out! I don't know if I can give a verdict on whether Oiistar serves the BEST ramen in Chicago, but there are definitely qualities that make it a strong contender.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/dxMrqh-mQRzBAlpfVAK6rw/168s.jpg", "caption": "Classic ramen and jajangmyeon. Delicious!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/NLT95pwHIHzW8qZtxHtbpQ/168s.jpg", "caption": "Jajangmyeon. GET IT! It's so good"}]}}, {"review": {"des": "I love a seafood Ramen so my husband searched for a Ramen spot that was in Wicker Park for us to enjoy. The places that we saw didn't really offer a seafood ramen so I was overjoyed to see the Musclemen Ramen on your menu which I never had before. It was absolutely spectacular. The broth was well seasoned and the muscles were perfect. We also enjoyed a glass of white sangria. Please pay Oiistar a visit. You will not be disappointed.", "pics": null}}, {"review": {"des": "Bao buns are amazinggggg! Ramen bowls are huge! Broth is excellent. <br>Bao buns are reasonably priced as well if you want something quick and delicious to eat!<br><br>Everything was perfect", "pics": null}}, {"review": {"des": "Heard good things about their ramen, but I had ramen the day before so I ended up getting the Kimchee Chow, pretty much their take on a kimchi fried rice. They add in spinach and cotija cheese which is delicious. The portion is so huge, it's definitely worth the price. It was about 12 dollars and I ended up having it for 5 different meals. My friend ordered ramen and it came in a humongous bowl that she couldn't finish either. She said she enjoyed it, but it wasn't the best that she's ever had. <br><br>The service was great. Our waiter was friendly and patient and checked in us a good amount of times. I'm not a huge fan of their seating. A lot or most of their chairs were backless, so I was a bit uncomfortable after sitting there for a while. We got there a couple minutes before it opened and there were already a couple parties waiting outside the door!", "pics": null}}, {"review": {"des": "Best ramen I've had thus far!! I considered giving this place 4 stars because the service was having a rough night, but the food is just too good. The Manager was great and handled the situation of our forgotten order perfectly. We got pork belly, duck and 6hr pork shoulder buns, classic ramen and spicy ramen. So so so so tasty!", "pics": null}}, {"review": {"des": "One of my favorite ramen places!! I went here when it first opened and it was terrible... but after I visited a year later it completely changed my view. This place has delicious types of ramen and great pork buns. Highly recommend. If you like wasabi ramen down the block, you'll like Oii star as well!", "pics": null}}, {"review": {"des": "I was pleasantly surprised, not that I was expecting bad things. It was just better than I expected. And what else is pretty cool is that they also have a patio if you want to sit outside. I wasn't really in the mood for ramen, but I was going to hang out with some friends and we were a big-ish group. <br><br>I'm told their baos/buns are good, but I didn't try one. They looked good. It was well made (like the giant piece of pork belly on the pork belly bao).<br><br>Food:<br>Duxelles - delicious, i love the avocado puree underneath, the presentation could use some work (reminded of a sushi roll douse with zigzags of spicy mayo). There's lots of pork (it's like a pulled pork consistency. I wish I could've tasted more of the wild mushroom.<br>Oiistar Classic - it was delicious. hunks of cooked pork belly can be found in the ramen buried but so good and so full of flavor and well-cooked. Good little kick. Instead of sriracha, I wished they had togaroshi spice. There was entirely too much green stuff (personally, I'm not a big fan, but will usually deal, but this was an enormous amount). <br><br>TLDR: great spot to grab a bowl of ramen", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/P4cKfwNSFb_qXdEdk42gxQ/168s.jpg", "caption": "Oiistar Classic"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/suz_eJ-MfoWpd54SmozxtA/168s.jpg", "caption": "Duxelles"}]}}, {"review": {"des": "I went to Oiistar with a friend on Friday night and I think we did it right! Don't judge us, but we split the Oiimen ramen. It was pretty good. The pork belly was fatty (at least the pieces we had), and they were pretty flavorful/salty but the noodles and broth balanced it out well. The portions are huge! Splitting was the right move because we didn't have to feel guilty about food waste and we were also able to enjoy a few of the buns! The tempura shrimp was amazing!! Nicely lightly fried with a yummy chili mayo sauce. We also tried the Goki BBQ beef, which was also good, but did not match up to the tempura shrimp. The actual steamed bun also wasn't too big, so the bun to protein ratio was good. Overall, you probably won't go wrong with ramen at Oiistar. I enjoyed the ramen more than Hi Five and we didn't have to wait for hours!", "pics": null}}, {"review": {"des": "We tried to get in to Wasabi Ramen and there was a 45 minute wait, so called Oiistar who happened to have a 6-top ready for us that they were kind enough to hold for 15 minutes.  <br><br>First of all, the drinks are dirt cheap.  5 dolla wine, 4 dolla cranberry/vodka's (whaaa???).. Well you get the point.  <br><br>Our waiter was extremely nice and hilarious!  He recommended we all start with one bao first and then a ramen or entree.  So, I started with the fried cod bao.  It was decent but I regretted not getting the shrimp as I think the flavor would have paired better with the bun.  Also, the fish was so massive it was very difficult to eat.  So, after that came out the most MASSIVE bowl of ramen I had ever seen in my life!   I got the Veggimen.. This has to be the best veggie Ramen broth I've ever tried!  I loved everything about it except for the fact that it was a little bit ridiculously large.", "pics": null}}, {"review": {"des": "This place has amazing Ramen! The bowls are delicious with the regular toppings. They do not skimp our in the meat either. Drinks are not too pricey. They also offer some desserts like banh donuts! The fried chicken was amazing - and super sticky on the fingers!", "pics": null}}, {"review": {"des": "On a quest to find my go-to ramen spots in Chicago, I'm happy to report that Oiistar has made the cutoff. Two thumbs up for the ramen here: flavorful, fatty, LARGE portions, pork belly that melts in your mouth.<br><br>I got the spicy garlic shoyu ramen ($14) while my friend got the Oiimen classic ($14). Both were excellent. The broth was fatty and rich, and the pork (tasted like it was glazed) was one of the best I've had in awhile. Plus, it comes with 2 large pieces of pork and they ain't skimping out! The portions here are noticeably larger than other ramen joints around the city - not that I'm complaining. Slight complaint on the soft-boiled egg because it was too runny and wasn't marinaded like ramen eggs are supposed to be.<br><br>After sitting at the bar, I realized their veggie ramen was very popular. So if that's your thing, go for it.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/TkLDu4N4gV0WhOnhyWLWnw/168s.jpg", "caption": "Oiimen classic - clean, fatty broth"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ByRPMwypc16rIVwosRCi8Q/168s.jpg", "caption": "Spicy garlic shoyumen - pork was so good and portions are huge! Recommended"}]}}, {"review": {"des": "Love the ramen here! Not too salty with delicious flavorful pork belly. The buns here are also good, I would highly recommend trying the 6 Hrs Pork Shoulder bun.<br><br>They also have patio seating, great for date nights or sitting out with friends on a nice day.", "pics": null}}, {"review": {"des": "Love the vibe of this place! Every time I've ever passed, it's looked so hip and upbeat.<br><br>One critique I have is that I wish they had a wider selection of house cocktails. <br><br>This place has some fusion flavors to it. If you're looking for a very traditional ramen flavor, this is the not the place for it. However, if you're feeling adventurous and want some really strong, well-seasoned Asian flavors, this will hit the spot.<br><br>For appetizers, my boyfriend and I shared the pork belly bao and duck breast bao. The duck breast bao was probably the best meal of the entire dish. Get it! Super fluffy bao with melt-in-you-mouth duck, and a tangy/salty umami sauce. Perfection.<br><br>For the entre, we got the spicy umami ramen. Tasty ramen with all the components of a traditional ramen but I was not a fan of the pork belly in the ramen. It was way overdone. I appreciate that I didn't feel the need to add seasoning to the dish. It was also a very generous portion, perfect for 2. If we had each gotten separate bowls, we could not have finished them both!<br><br>We also shared the sambal wings. Which we had ordered as an appetizer but ended up coming out at the end of our meal. Which was fine by us. <br>To be called \"wings\" was misleading. It was more like a half chicken. There was one wing, one flat, and thighs and chicken breast in the fish. I wasn't a huge fan of the breading on the wings. The breading helped to absorb be the sauce but I would have preferred the sauce to have been more coagulated and glaze the wings rather than serve as a runny dipping sauce as we had to do. Flavor-wise, it was very umami, but still relatively average. Probably not an item I would order again. <br><br>But the restaurant itself, I would be willing to go to again. Especially for the other baos and another ramen.-Oh and our waiter was cool too. Nothing like good service to accompany a tasty meal.", "pics": null}}, {"review": {"des": "Excellent service, great vibe, and delicious food. The broth here is best and most flavorful I've had to date. Our server was amazing and a real professional. Will definitely be back. <br><br>Recommend getting the fried chicken ramen and one of the buns! Portions are huge!", "pics": null}}, {"review": {"des": "Had the Tonkatsu, Duck, 6-hour pork shoulder and bbq chicken buns. The 6-hour was alright but the rest of them were really really good. <br><br>Had the spicy shoyuramen. Noodles and broth were on point. Not really feeling the Berkshire pork on ramen though. Might have been better with the bun.", "pics": null}}, {"review": {"des": "Second time trying Oiistar after a pretty underwhelming experience a couple of years ago. <br><br>I haven't yet made the Ramen rounds after moving back from Sydney so this review is based upon the incredible bowls of liquid gold we were able to sample for two years in the asian food mecca. Ramen for me is all about the experience. I like to read about the types of broths and how long they've been cooking and I want to be able to tell my server the way I want my noodles done (medium) .......So for me, Oiistar was just okay,<br><br>We ordered the Classic as it had the fatty pork but also ground and came topped with bamboo shoots, mushrooms, runny egg etc. We picked the Classic because it said it would be spicy with the chilli oil, but it was not. From the broths i've tasted, this porky juice didn't have the richness I usually crave and sat a little watery for me. The noodles were also fairly soft as i prefer a little bite. Although the broth lacked flavor - the pork was incredible! These guys know what they are doing when cooking their meat.. a really smoky hint with chunks of fat throughout. The portion was enough for the both of us too.<br><br>Wished that they had normal size spoons instead of those heavy ladles. <br><br>Staff: quick, attentive with drinks!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/nsDm1nF47CaKoGqS026SwQ/348s.jpg", "caption": "Classic"}]}}, {"review": {"des": "Oiistar is as good as everyone says. We went for lunch and had three buns (fantastic - the best we sampled was the shrimp tempura which was loaded with pickled cabbage) and the chicken ramen (which is large enough for two to comfortably share) which was absolutely delicious.  The space itself is a bit austere, nowhere that I'd want to spend a significant amount of time. The service is attentive and gracious.", "pics": null}}, {"review": {"des": "The first time I went here I sat at the bar. Loved watching the guys make the food. The second time I ordered a few baos and I got a bowl of miso ramen which was actually cold and I asked to send it back. That was disappointing. There was only 1 waiter which was annoying because often I would try to grab his attention without success. FYI: If you didn't know, leftover ramen becomes gelatinous..Overall, I would come back because I really enjoy the flavor of the miso ramen.", "pics": null}}, {"review": {"des": "Broth is very rich and flavorful. Noodles are chewy and perfect size. Presentation is on point as well.<br>Everything is great except for the seating arrangement. You are in close contact with everyone and there's no space to put your stuff down.", "pics": null}}, {"review": {"des": "This would have been a perfect review if not for the slightly snotty customer service and the not-so-creative food.<br><br>We walked in at around 6:00 and noticed that the place was PACKED. I mean packed. We definitely didn't expect that on a Saturday night. We walked up to the very trendy looking host and were immediately greeted with a \"Do you have reservations?\" We didn't. So I asked if we could eat at the bar, and was met with a stern and slightly snotty \"No.\" Apparently, what I thought was the bar was actually tables. I shrugged my shoulders and she, again snottily and cooly informed us that it would be a 30 minute wait. <br><br>This kind of threw me off, walking in the place seems kind of intimidatingly hipster and the sort of snotty host didn't help. To their credit, though we were only seated in about 10 minutes which was amazing, and super fast for such a trendy and hopping place on a Friday night. <br><br>I was a little hit skeptical of the menu at first, as I'm a pescatarian and there weren't a ton of options for me. I decided to go with just one tempura cod bun and their oimoji which turned out to be their version of a mojito. When it arrived, I was surprised to see that it came in some sort of mason jar-chalice contraption which was so different and interesting. On top of that, my tempura cod bun was awesome. It had super crispy cod with these lightly pickled vegetables on them. Most of the time I hate pickled vegetables because they're so vinegar-y and nasty but these were just vinegar-y enough to make them sweet. <br><br>On top of all of this, my mojito was only $7 and the bun was only $4! Awesome prices for awesome tasting food.<br><br>We finished the night off with the creme brûlée which came with espresso caviar and shaved almonds. Loved this! The creme in the dish was so rich and so fresh and I loved the nutty-coffee taste that came from the top of this dish. Very good.<br><br>My one complaint, however would be that the food have been a little more innovative. My bun was good, sure, but there wasn't anything super special about it. My boyfriend got the pozole ramen and he reported that although it tasted great and the price was very reasonable, there was nothing that really made it stand out. <br><br>All in all, though, I would definitely go back. It was great food, and a great night!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/JvY5U7F6Qwb0bqHcjhN5aQ/348s.jpg", "caption": "Oimoji"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/JyvUzAuv2K8oxfxaZCGgTA/168s.jpg", "caption": "Creme brûlée"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/5caEbzb0t_B5L2f4E6ZXVg/168s.jpg", "caption": "Tempura cod bun"}]}}, {"review": {"des": "Hands down best ramen in Chicago. Been coming here for years but finally wrote a review. Oops my bad. But anywho the ramen is so tasty and their staff is top notch.", "pics": null}}, {"review": {"des": "This is by far the best ramen in the area, if not in the city. The staff is always friendly and remember me when I come in. I highly recommend the veggie ramen with duck breast!", "pics": null}}, {"review": {"des": "First time here and the meal was very enjoyable! I got Berkshire pork belly and tempura shrimp buns, both buns were very yummy. The umani ramen was also very delicious, just the right amount of spices. The staff is also very kind, a great spot for lunch l.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/lTHLf6UQ6fqNHjlI8h4B3w/348s.jpg", "caption": "Umani ramen"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/pu44WsnHcwAMTnUcy9fOUA/168s.jpg", "caption": "Tempura Shrimp"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/dYkkwZLCWWfNNfpE8EwcRw/168s.jpg", "caption": "Berkshire pork belly"}]}}, {"review": {"des": "I'm kind of a ramen snob and was pleasantly impressed with this place. Cool enough space with good enough service but damn good food. The Umami ramen and portobello avocado tempura was hella good and probably the biggest portion of ramen I've EVER had. I will definitely be coming back here when in the area!", "pics": null}}, {"review": {"des": "This was probably one of the worst food experiences I've had in the past year. <br><br>Let me preface this by saying that there were some positives. We were seated pretty quickly (it was a weeknight) and were given attentive service. We ordered the avocado and mushroom tempura to start. The avocado tempura was amazing; it defied physical expectations by retaining the subtle bite of fresh avocado in the warm embrace of a perfectly light tempura batter. I could really taste good oil flavor from it, a rare quality most deep fried foods lack. The mushroom tempura was a bit underwhelming in comparison; it had a sharper flavor but was less texturally interesting as the frying process removed the most of the bounciness of the mushroom. <br><br>I got the 6 hour pork shoulder bun, which had delicious melt-in-your-mouth meat. However, it was accompanied by a weak soggy bun that lacked the requisite fluffiness and sweet wheat flavor of authentic Chinese bread. <br><br>After receiving my hot sake late after having to remind the waiter I ordered it, I was subjected to the disaster of the night: the Umami Ramen. This wasn't just bad ramen, it was straight bad noodle soup. I wouldn't have expected something this lifeless from even an amateur home cook whose inspiration for Asian fusion food was visiting the Goya section of their local supermarket for the first time in their sad, bleak life. Although I assume the ingredients were more complex, this soup literally tasted like lukewarm water saturated with miso and flavored to living hell with gochujang. The entire bowl was almost completely homogenous in flavor and texture asides from the two slices of surprisingly dry, almost difficult to chew, pork belly. This dish left me full of so much salty gastrointestinal congestion that I didn't even realize how bad it would make me feel later in the night.<br><br>Having not eaten anything but Oiistar before 8 hours of my symptoms hitting, I received some crazy severe, fever inducing diarrhea (the kind that was probably responsible for the high death rates in preindustrial societies before the advent of modern sanitation practices). I haven't had a meal render me so debilitated since the time I received the stomach flu from some nasty South Side Chinese take-out.<br><br>Overall, 0/10 would not come again (the tasty avocado tempura will just remind me of all the other shit I had to deal with)", "pics": null}}, {"review": {"des": "Loved everything we ordered one of each of the buns and two of the bowls everything was awesome, wonderful flavors beautiful presentation", "pics": null}}, {"review": {"des": "Great Service. Tempura Cod and Mashed Buns are delicious. Ramen not authentic, broth and noodles taste like regular ramen that you can buy from asian grocery store. <br><br>Spicy Garlic Ramen<br>Musclemen Ramen<br>Tempura Cod Bun<br>Mashed Bun", "pics": null}}, {"review": {"des": "Oiistar was delicious!  I have Celiac disease and can't eat gluten which is almost always in Japanese food. They have GF rice noodles and broths, appetizers and desserts.  Oh, and beer! I was blown away by the options but most of all by how damn good everything was.  So good and so appreciated.", "pics": null}}, {"review": {"des": "Biggest ramen portions in the city. Quantity without sacrificing an ounce of quality!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/k5GKxQgiV4fjRdrIXcvtwQ/348s.jpg", "caption": "Flawless fried chicken"}]}}, {"review": {"des": "Go here if you want good ramen. One of my favorite spots for ramen in the city, wasabi is my other favorite. I typically get the muscleman which sounds unusual for ramen, but very very good! A delicious bonito miso broth, fresh mussels, with a nice spicy oil on top. Omg, it's so good. If you're not into it, their other ramen are just as good. If you want an appetizer beforehand, get buns, the pork belly and tempura shrimp are my favorites!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/t_SHbRIROWML1YKWtRkdPQ/168s.jpg", "caption": "Muscleman"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/d_vxlAZkUdCNB6oD2Kxiog/168s.jpg", "caption": "Tempura cod bun mmm so pretty and delicious!"}]}}, {"review": {"des": "Hidden gem alert.<br><br>Oiistar does nothing to market, and has driven itself to success, merely by word of mouth alone.<br><br>A contender in the ramen craze, oiister is a must-try. They offer a wide variety of ramen, ranging from traditional (shoyu or tonkatsu/classic), to spicy (jalapeño or kimchi-based), to seafood ramen options (mussels). I think there's like 10 different kinds.<br><br>Here's my thing. they've got noodle options: thick, thin, wavy, and regular. you can throw in as many eggs as you want. meats. mussels. veggies. you name it. so you'll really get the way you want it, whether you opt for a titled ramen, or start free-styling your own. A competitor i know, won't even give you extra broth (so pretentious, right?!) but this place will. And they've also got the 48hr or whatever, stewed with love, and it took days for this, amazing kind of broth. Win. <br><br>i've had the spicier ramen, and the classic. both good. i've added mussels, which were also good, and i loved the alternative, but became a slight distraction for eating. i really enjoyed it all, but i think classic won me more. (i'm a little sensitive to salt, and this was lighter for me).<br><br>But wait. there's more. You don't even need to get the ramen.<br><br>All the buns and appetizers can give you a shareable, snackable way to have your meal. Sometimes i like to just try everything, and all these options don't disappoint. I've tried the pork belly bun (good), shiitake (a little too saucy), and the tiger shrimp (WIN!!!!!!)<br><br>There's just so much on the menu, that I really want to try everything. I'm a big fan of ramen, especially when it's cold. And i love the casual vibe.<br><br>Only gripe: it can get a little cold, and the seating isn't the best. It's pretty narrow, and many chairs don't have a bag to it. But the service is good. The bowls are huge (bigger bowls, and more broth than other places serve).  <br><br>I'm usually too full for dessert by the time i've given up battling these big bowls of soup. if you haven't, definitely try it!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/_ilG-47mFVIo_kYHN1ehJg/348s.jpg", "caption": "Classic ramen"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/cvSugMrwv480PP53yuWpsA/168s.jpg", "caption": "tiger shrimp tempura bun"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/4kCTNhz3IaWWJGYvJc_11g/168s.jpg", "caption": "Shitake mushroom bun"}]}}, {"review": {"des": "The worst part about traveling alone is not being able to eat all the good looking food and food envy. I came here on a recommendation from a friend of mine. It's a little hard to find but look for a black banner that has a red circle with two lines underneath. My friend said their buns and ramen are good so I got just that.<br><br>Immediately, the Berkshire pork belly bun caught my eye. $4 seemed steep for a single bun but when it came out there were two GIANT pieces of pork belly on each side of the bun with daikon sprouts and cucumbers. The pork belly was marinated with a sweet sake soy sauce, had more fat than I usually like but it just melted in your mouth. The bun was big and wasn't clean to eat but man, I would've licked the dish clean if not for other people.<br><br>Next, the ramen. I was torn between the umami and oiimen classic but went with umami after talking to the server. The umami is a spicy miso ramen and packed with flavor! The ramen was topped with a perfectly cooked egg, scallions, tree ear mushroom and the same Berkshire pork belly from the bun (I opted out of bamboo shoots as it normally adds a weird smell and taste). This ramen was HUGE and I feel like it would be best shared. <br><br>I messed up and overdosed on the pork belly but I would definitely come back to try the other options on the menu. Just as a heads up, their ramen is on the more expensive end ($13.50+). I also noticed that their hours are split the way some Asian restaurants are (closed for a few hours between lunch and dinner).", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/EhL14jWnN1JlKFeF0gcHYg/348s.jpg", "caption": "Berkshire pork belly bun. Must get!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/o-1imiR_FvGtG7EeTCb0Lg/168s.jpg", "caption": "Umami ramen"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/zYttR2WT5swtRtBiauxRfQ/168s.jpg", "caption": "Look at how huge the pork belly is!"}]}}, {"review": {"des": "They have been closed a few times when I show up at lunch. If you don't open it would be preferable to change the hours on the door and leave a note for your customers.<br><br>The good : I love the shrimp bun here. It's so different and incredibly tasty. The spicy fried chicken is good and a large portion. The pork buns are good but a little too much sauce. <br><br>The bad : unfortunately the ramen is just not that great and it's supposed to be \"their thing\". The broth is very clear and not fatty. The noodles are just ok. The egg isn't sliced lengthwise making it look ugly and hard to grab with chopsticks? It's not a big deal but soo weird... the pork in the bun was good but In the ramen it was dry and tasted cured and Smokey which is not what I'm used to for ramen. They don't have many add on traditional toppings such as pickled ginger and oils.. the portion IS huge though which is a plus for most. White sangria was tasty. <br><br>Overall not horrible but I might just go back and get the shrimp bun to go... there are way better ramen spots.", "pics": null}}, {"review": {"des": "This is by far the best pork ramen I have ever had the broth is super delicious. The pork is the best I have had and I hate pork besides bacon. And my husband I can share the the spicy garlic pork ramen. And we ordered two steam buns and the pork from the ramen in the buns and my goodness it was love.", "pics": null}}, {"review": {"des": "Meh... <br>the meat buns were delicious!<br><br>The ramen of my choice was the umami: I don't know it tasted sweet to me in a way? This was my first ramen experience and it wasn't the best. I'm in love with pho and that just might b it. But maybe I might give the classic ramen a chance in the future. Should of gone classic to begin with to really get the authentic ramen taste. But for some reason umami stood out more and it was a fail. I did eat 1/2 and took the rest home for my fiancé. He HATED IT- he threw it out. <br><br>I also tried the brûlée! That was YUMMY!<br><br>Overall, 3 Stars.", "pics": null}}, {"review": {"des": "My friend brought me here when I visited on January 14th. I almost mistaken the entrance to Converse as I noticed their big star logo. Coming from Texas I wondered why there was a separate door attachment to the building but I was informed it was to help with the winter air draft coming in as patrons entered or exited. So I thought it was pretty nifty and functional. It felt like I was going into a secret ramen spot.<br><br>The place is quaint and was busy as we came in around 7pm dinner time. They have clothes rack inside to hang your winter coats. We were offered a table near the entrance but we decided to wait for better seating. Within 10 minutes our party of 3 was seated comfortably at the end of the long bar.<br><br>Upon arriving I of course checked out the photos online and saw the different options and flavors they had. I opted for the muscleman ramen as I didn't want to eat any pork. I was extremely pleased with my selection. The broth was full of body rich but not too rich/porky. <br>It wasn't super spicy but had a nice kick to warm you up during the winter.<br><br>There were plenty of mussels in the ramen and lots of shredded scallion which I loved! The noodles were fresh and had just the right bite. Usually I never finish my bowl of ramen but here I sure did slurp  it down. My friends ordered a few items which they enjoyed as well can't recall the names exactly. I would definitely come back when in Chicago again.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/WDEkcdau9vdfIovcJAqnzA/348s.jpg", "caption": "Musclemen ramen"}]}}]}