{"name": "ora-chicago", "reviews": [{"review": {"des": "Went to Ora on a Friday night. Waited about 10 minutes but got seated promptly thereafter at the bar. <br><br>I tried the sashimi and the oyster. The sashimi came out first and was delicious. The best I've had in Chicago and very reasonably priced. The oyster was also amazing! The soup that was supposed to come with the oyster never came, however. It was no biggie as we were pretty full. We let the server know. She not only brought it out right away but also gave us the entire oyster dish for free for the \"inconvenience.\" Very refreshing level of service!<br><br>Lastly, I love BYOB places, and this place does not disappoint. You can bring whatever liquor you want and they will provide the glasses, shot glasses, etc to enrich your experience. <br><br>While it may not be the easiest place to get into for a large group, I highly highly recommend for a date or small group of friends.", "pics": null}}, {"review": {"des": "Several friends and I decided to visit Ora for dinner on a Saturday night. We made reservations pretty last minute and they were nice enough to accommodate our group of 6 at 6 pm, provided we leave by 8 as another large party was arriving. This was totally done by us, but I am not sure that point was communicated to our server because he brought our last course out at 8. We didn't end up leaving until 815, so we felt bad for the table after us.<br><br>Other than feeling slightly guilty, our overall experience was good. The sushi was pretty decent overall. The wasabi roll had a nice freshness to it and I would recommend this. The scallop volcano was a heartier roll, but good nonetheless. The Nooky was ok, as the garlic chips overwhelmed the rest of the roll. Also worth an order were the Scottish Salmon and 7 spiced escolar nigiri (one piece/order).<br><br>The show stealer was the baked oysters. The buttery garlic goodness rendered us silent because of how tasty they were!<br><br>This place is definitely one of the better sushi joints on the Northside!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/1ARZlPmFt7XNO5Nexfbj7A/348s.jpg", "caption": "Baked oyster appetizer!"}]}}, {"review": {"des": "My favorite Sushi place in Chicago, so far! I came here with two other friends during dinner on a Saturday. The host told us there was a hour and a half wait, which is insane to commit to. Luckily, Uptown/ Montrose has a ton of bars that are perfect for learning the art of patience. <br><br>We wanted to grab a few beers at Hopleaf (across the street), while waiting. However, it was packed shoulder to shoulder with beer patrons. So, we settled on Simon's Tavern (cash only), which was empty. Music from the late 90s was playing, but not too loud that we couldn't hear our conversations. The bartender was attentive and the drinks were cheaper. After an hour, our names were called for Ora. <br><br>First impressions:<br>Warm and contemporary atmosphere. Limited seating. Lively vibe. BYOB! We stopped at Andersonville Wine & Spirits beforehand because it's right across the street. Right away, our server put our assorted six-pack of Whiner Beer (yum!) cans on ice. Our waters were always filled. We chose all the suggestions that our server recommended, and they were fantastic. Even though it was so busy, our server kept up with us. Five stars.<br><br>Food:<br>+Oyster Motoyaki $13, Japanese Egg Sauce, Flying Fish Roe, Garlic Citrus Soy Sauce, Baked Oysters. Presented in shooter sized cup. Creamy like mashed potatoes with a oyster consistency. It was a burst of flavors in my mouth. Worth experiencing.<br>+Dynamite Signature Roll $14, Baked Scallop, Tempura, Asparagus, Spicy Tuna, Cream Cheese, Wasabi cream, Soy Sauce. The cream cheese combined with the scallop was delectable and full of texture.<br>+Sashimi set $23, Seven pieces of chef's choice. No complaints if you like raw fish.<br>+Albacore Tataki $15, Seared Albacore Tuna, Soft Shell Crab, Spicy Tuna, Cucumber, Avocado, Sauce. I didn't care for this one, but my husband, who goes out of his way to order Sashimi, loved it. <br>+Miso Soup $3, Scallions, Nori, Tofu. Complex flavor, not your ordinary Miso.<br>+Surf and Turf $14, Seared Beef, Garlic Aioli, Shrimp Tempura, Cream Cheese, Scallion, Asparagus, Sweet Soy Sauce. This is my favorite Ora Roll. I don't even like beef, but it was so mouthwatering. Hits your taste buds with creamy rich flavors. <br>+Scallop Volcano $14, Spicy Scallop, Shrimp Tempura, Salmon, Cucumber, Asparagus, Grilled Scallions, Sweet Soy Sauce. Thought this would be my favorite, but it ended up being just shy of good.<br><br>Overall:<br>I would come here again for the Oyster Motoyaki and the Surf and Turf Roll. Long wait due to popularity.", "pics": null}}, {"review": {"des": "I live in the neighborhood so we'd walk here when the sushi craving hit. Enjoyed their nigiri every time. One time, they had uni, and it was amazing, had to get another. Makis are a pass for me; they were okay, none were worth reordering. Nigiris are their strong point.<br><br>One \"meh\" experience though was on our third visit. I bit into a metal strand in my salad, looked like it came from a metal pan scrubber. When we brought it to the attention of our server, she asked if I wanted a new salad.. I feel like the level of customer service didn't match the price point of Ora. Wasn't impressed by the service. <br><br>Afterwards, we had their amazing uni, one of the best I've tried in Chicago, ordered another, still great. And while I think back on the uni from that dinner, we end up going to other places for uni and sushi cravings, more further and less convenient, but with better service and providing a happier dining experience (Juno, Kai Zan).", "pics": null}}, {"review": {"des": "A friend took me here saying that it was thejr favorite sushi spot in the city, so lets just say that I had high expectations coming in.<br><br>Food: GET.THE.OYSTER.APP. even if you're like me and don't even like oysters all that much. Every bite was mouthwateringly good. We also got the Snake Eye, Dynamite, and Albacore Tataki makis. <br><br>All in all, the maki was very yummy but not mindblowing. My fav was the Snake Eye. If I came back I would probably stick to their sashimi or omakase to really enjoy the freshness of the food. <br><br>Drink: BYOB with no fuss which is fantastic.<br><br>Service: This is where they lose a star. We went at 8 on a Monday night so no wait and it wasnt too busy. The server was pretty available, I just dont know why but it takes an awkwardly long time for them to make the food. Even with alcohol it was a very noticeable amount of time before our apps were out. Hopefully they can work on this cuz I can only imagine it gets worse when it's busier", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/i-B2XcnMEAHnRggax3pbBg/348s.jpg", "caption": "So good!"}]}}, {"review": {"des": "This might be The. Best. Sushi meal I've had in my whole life.  My partner and I are sashimi junkies and not only is the fish incredibly fresh, but we ordered the chefs sashimi special and found ourselves loving pieces of fish that we usually can't stomach. <br>Some highlights were:<br>The delicately seared salmon belly that practically melted in your mouth. <br>The hamachi toro, which was light, buttery, and might be the best thing I have ever put in my body. <br>And the aroma of the beef tataki, alone, had my mouth watering, but it still wasn't enough to prepare me for the most perfectly seared piece of meat I have ever consumed. <br>Our server Max, who was slammed with a surprise Monday night rush, was efficient, kind, and incredibly well versed in Ora's menu.<br><br>It was truly, a perfect meal.", "pics": null}}, {"review": {"des": "This is a great date night spot (maybe a third or fourth date though for reasons I'll explain in a little bit). It's cozy, intimate, and has a very lively but subdued environment.<br><br>This is one of those places where even though you're getting slices of raw fish (probably) you can tell and taste the difference in the superb quality of the fish compared to any other old sushi place. It's one of those places where you get food and remember just how important quality of food is and quality of preparation is. It's one of those places where food leaves a lingering sense of \"goodness\" long after the initial taste.<br><br>From a quality of food perspective this place is great. I would say though that the quality comes at a cost that matches the quality. This place is on the pricier end (but still reasonable for what it is) and is likely partially influenced from the area it is situated in (basically almost the heart of Andersonville).<br><br>Know that it's totally worth the price. But the price could be a minor deterrent if you're just going for a causal night out.", "pics": null}}, {"review": {"des": "What had happened to one of my favorite restaurants...service and management is now sub-par. Gotten so bad. Gave away our reso...twice. waited an 1.5 hours for food.<br>DONE........", "pics": null}}, {"review": {"des": "The food: 4/5. As a sushi snob, I found Ora to be a pleasant surprise. It's definitely one of the better options for mid range sushi. It's not as good as Momotaro/Naoki, but beats other well known spots such as Toro, Juno, Coast, Arami etc. I tried seared beef which was good, the pickled carrots were an enjoyable side. Than I had a selection of sashimi (chef's pick for 20 some dollars is a steal), which was good, but not great. A few cuts were fishy, namely the scallop, madai and octopus. BYOB is a plus. <br><br>The service: 4/5. Be ready to wait, but received miso soup on the house.<br><br>Overall: 4/5. Worth commuting from Wicker for.", "pics": null}}, {"review": {"des": "Amazing sushi! One of my absolute favorite sushi restaurants!! If offered to order the thin sliced beef appetizer, DO IT. This was absolutely incredible!!!! The beef was so thin and just barely seared-- it melted in my mouth and has a slightly spicy vinaigrette on top with some thin sliced veggies. I'm truly not doing this dish justice. It was amazing. The sushi was also incredible, per usual. Even a simple salmon and avocado roll was divine. Love this place, AND--- it's BYOB!!!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/aK1mYiPirD9TWGf23JU_BQ/348s.jpg", "caption": "Salmon and avocado roll with a shiitake and avocado roll!"}]}}, {"review": {"des": "We wanted a nice sushi night and with lots of sushi options in the Edgewater/Andersonville area, we opted for Ora and it was outstanding. <br><br>Initially I was a little concerned because they don't have a website and I couldn't make reservations online. I called Ora a few days before and made a 6:15 reservation for Saturday. How old school! We arrived and were greeted warmly and seated right away. The place is small but has a great feel. Staff is incredible. Our main server was very good but I loved how all the staff took care of everyone. Love seeing that in a restaurant!<br><br>We started with miso soup which was just okay.  I've always had miso that included cubes of tofu but this did not have any. No big deal because the sushi was so incredible I didn't mind the less than stellar soup. We had a variety of nigiri and rolls and everything was exceptional. Easily some of the best sushi we've ever had.  We never even touched the soy sauce because the sushi was so good by itself it didn't need anything added.<br><br>So excited to have a great sushi spot in our neighborhood and can't wait to go back!", "pics": null}}, {"review": {"des": "Our server was friendly and fast despite being very busy. The sashimi was fresh and delicious. The steak tataki was the best I've ever had. The best part however was the hamachi toro... I will definitely be back.", "pics": null}}, {"review": {"des": "I don't make it out to Andersonville that much and am close to some really good sushi places in my neck of the woods.  But I wanted to try Ora as I heard it was really delicious and I like that it's BYOB.  The food here was absolutely delicious and high-quality.  The service here though is a 2.5 stars.  They don't seem to have their act quite together.  It was a busy Saturday night.  I made reservations ahead of time and we got there right in time for our reservations.  We had to wait there for 30 minutes because they didn't have anything ready and two of their servers/staff members were kind of snippy telling us to wait in a corner and telling my friend to wait in a separate part of the room in an abrupt way.  I understand the place is small, but this is a restaurant so they need to be nice to people who are already pissed off about having to wait when they made reservations.  It's also too cold to wait outside when its 38 degrees.  <br><br>One of the servers was very nice though and was a stark contrast to most of the other servers we interacted with there.  He was our primary server and kept apologizing for the wait.  The wine glasses took forever to come out and he just brought one of them out after we waited abut 15 minutes already because he said the other glasses were still drying.  They need to order more wine glasses then because it was a long wait to just have glasses served.  Our server just seemed completely overwhelmed and it took him awhile to come back with things.  The guy who was taking our plates was kind of rude though and we asked him nicely for a cork to open our wine bottle and he never brought it, he was basically rushing us and taking plates away without asking whether they were ready.  It's kind of a pet peeve of mine since I am a slow eater.  <br><br>The food on the other hand was excellent.  We ordered the highly recommended Oyster Motoyaki.  It was basically oysters soaked in an egg custard with garlic flakes, ponzu and green onion sprinkled on top with a soy vinaigrette.  It was baked and oozing with flavor.  This dish definitely lived up to the hype and is an extremely unique dish conceptually.<br><br>We decided to share some Maki and ordered the: Scallop Volcano roll, Smoke Eye roll, and Dynamite roll.  All of these rolls had remarkable flavors with a multiplicity of textures.  The Scallop Volcano roll was my favorite as it had smoked salmon, shrimp tempura, grilled scallions, a soy reduction, and spicy scallops on top.  All of the flavors balanced out very well into an extremely satisfying large bite of food.  The Smoke Eye roll was unique and mouthwateringly delicious as well.  My favorite part of it was the seared eel as adds a nice salty flavor to the shiitake, tiger prawn, wasabi aioli, and fish stick bits.  There was a lot of umami in this roll.  It is also finished up nicely with a soy reduction.  The Dynamite roll had that perfect crunchy texture complementing the soft baked scallops on top. It came with asparagus, tuna, and cream cheese.  Fortunately, the cream cheese did not dominate the flavors as it does sometimes at other sushi restaurants.  It tasted fresh and I enjoyed all of the tempura flakes.  <br><br>I am a firm believer in trying a sushi restaurant's nigiri or sashimi because that is the purest way to really assess the quality of their fish and rice.  I ordered the smoked mackerel nigiri.  I thought the rice was nicely sticky (I am not an expert on sushi rice though).  The smoked mackerel was light, delicate, and subtly smoked.  <br><br>Since we had to wait awhile for everything and the service was a bit rough, our server was kind of enough to serve us a spicy tuna maki on the house, which was very appreciated.  It had a completely different set of flavors from the maki we previous tried and I really enjoyed the spice of the tuna.  It was a very satisfying roll.  <br><br>I do think the sushi here is really spectacular and it is affordable for a high quality sushi place, especially since it's BYOB.  Their service needs to improve though because 2/3 people that we interacted with were not very nice and the slowness of everything really took away from the experience.  I probably won't come here on a weekend night again if I do come all the way up to Andersonville for sushi.", "pics": null}}, {"review": {"des": "Good service. BYOB. There's a liquor store down the street that has sake, so I recommend hitting that up first for a bottle. <br><br>I didn't realize this restaurant was in the neighborhood. Our nigiri was great! I wasn't sure if there was a weird texture to the rice or not, but I pounded everything all the same. <br><br>Space is dark and intimate - on the smaller side. I'd make a reservation before going on weekends.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/zPwlydmR0N1824yfq3ge1A/168s.jpg", "caption": "Yellowtail & scallion maki"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/TLbR1HAh1kebLGFSbsyP3g/168s.jpg", "caption": "Scallop nigiri, salmon belly, yellowtail, tuna"}]}}, {"review": {"des": "Very small place and a little noise with all people talking but overall it was a good experience. Service is great yet a little slow. I recommend to make reservations because the place is tiny and definitely order the snake eye roll it's wonderful.", "pics": null}}, {"review": {"des": "Amazingly fresh nigiri, unique and yummy sushi rolls and equally delicious plates. This place is byob and is perfect for a date night or just hanging out with friends. The place is always packed, weeknights or weekends doesn't matter, so better make a reservation ahead. I think this is my favorite sushi place in town. <br>Really sweet staff and very friendly service, so glad it's close to our place, we can easily get our sushi fix.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ew1EU9ia1mfQzBuaalMK4A/168s.jpg", "caption": "Scallop volcano"}]}}, {"review": {"des": "First time here and we loved it! We got the snake eye roll (very tasty especially if you want a cooked roll), the scallop volcano (my favorite!), a spicy scallop and a spicy salmon roll. The spicy salmon is actually spicy here which is nice. We also had two pieces of the fatty salmon which was amazing. It melts in your mouth! We will definitely be back soon!", "pics": null}}, {"review": {"des": "I came here while visiting family later in the evening on a Friday night. The place has a nice decor and fun atmosphere. It's small, so it can be a little loud, but I loved this place. We arrived shortly before 9:00pm and the three of us were seated immediately. The restaurant remained full the whole time we were there, but only one party actually had to wait for a table while we were there. I'm sure it's super packed closer to dinner time. <br><br>I believe our server's name was Julio, and he was magnificent. My parents can be somewhat challenging at restaurants with their 500 questions or modifications, and he was so patient and kind with them the whole night. I ordered the salmon/hotate sushi, a salmon maki roll, and spicy scallop roll. The hotate was very good, and while the spicy scallop roll was tasty and I happily ate it all, I'd probably skip it next time for an additional salmon roll. It just kind of lost the scallop taste with everything else mixed in (I like plain, boring rolls/sushi). The salmon roll was outstanding! It's a roll every sushi place can make, but I think judging a place based on the basics really shows how good (or not) they are. These were amazing - the salmon was fresh, and the ratio of salmon to rice was perfect... not overloading rice to save the restaurant some cash. I could have just ordered three (or seven?) of those and been totally content.<br><br>Everyone else with me was likewise satisfied with their food. Julio had very highly recommended the beef tataki appetizer to us when we first sat down. Nothing about it sounded great to me, and I'm not really a beef person... and I'm still not entirely sure what beef tataki is. BUT, we ordered it anyway, and it was amazing! I would have eaten the whole thing myself along with my seven salmon rolls. I'm so glad he recommended it as I would NEVER have tried it otherwise. I highly recommend Ora to anyone who has a moderate like for sushi!!", "pics": null}}, {"review": {"des": "A fun little place. We ordered oyster motoyaki, beef, chef' choice of nigiri and the maki called Wasabi tail. The oyster motoyaki worth a try. They have their thoughts in the menu. And the price is friendly in terms of their quality. I'm not usually a maki person but I think their maki is interesting. It's not those \"stuck everything in to make you full\" kind of thing. <br>As for the service, we went there when all tables are full so the wait time is a bit long but it's ok. What I like is the waiter listened to our opinions about the dishes very carefully.<br><br>PERSONAL WORDS OF ADVICE: they lose one star because many of their food still have space to improve. The rice of nigiri is not very sticky so that it cannot hold when we use chopsticks to carry it to our own plate. Wasabi tail is a bit too sour. The beef is a bit salty and flat in flavor (Maybe add some fruit flavor eg yuzu can help?)", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/00dQuEiJYjCQKYi0NtGzrg/348s.jpg", "caption": "Beef"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/SoyoeHpe-LMAdE2zL_JwTQ/168s.jpg", "caption": "Oyster motoyaki"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/k2wptjZaDw96d0Z5rugxQg/168s.jpg", "caption": "Wasabi tail"}]}}, {"review": {"des": "Been to Ora 3 times and it gets better every visit. The combinations are creative, served impeccably and always delicious. I'm jealous of my friend who lives only a few blocks away - but Ora gives me an excuse to visit him when in the Chicago area. Was served a smoked duck nigiri one night that knocked my socks off!", "pics": null}}, {"review": {"des": "Best new find! We never really go that far north but for this place we'll definitely be back!! Freshest uni I've ever had (straight from Hokkaido!) and really awesome spicy scallop :) highly recommend this place to anyone looking for high quality sushi :) street parking galore and service is great!!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/8pjXD76QrHTqnSxbbEPLtw/168s.jpg", "caption": "Uni!!!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Rxrpw4aMhXUs_H3EPwv2-A/168s.jpg", "caption": "Spicy scallop"}]}}, {"review": {"des": "Oh Ora! This place is the BEST sushi in the area. Awesome service, inventive and super fresh maki, great plating and a bomb spicy tuna roll (they do the classics right). It is a great date spot with a serious sushi vibe. Byob is a nice perk. Word to the wise: opt for a reservation or order takeout as this place gets busy!", "pics": null}}, {"review": {"des": "UPDATE: 8/31/18 - Again, Ora continues to shine. Best quality fish I've found in Chicago.  Brought a friend there last night for omakase style, and he was amazed - he's a customer for life, now.", "pics": null}}, {"review": {"des": "Came here on a Monday night and we were lucky to able to get a seat around 6:30pm because it got quite busy after! Our server was very kind (with a European accent, I think) and he explained the menu well--but perhaps he could be a little louder.<br><br>Oyster Matoyaki (5/5): oh boy, this was SOOO good. just order it. oysters with egg custard pudding-like sauce in the shell. YUM!<br><br>Snake Eye Eel Roll (4.5/5): very good and flavorful but the sushi rice was not that great (somewhat dry)<br><br>Ora-Rashi (4/5): while this is very good, it was too salty. The first few bites were delicious but after that, I needed to drink water constantly because it was too salty. LOTS of fish! they did not skimp on the fish YAY!<br><br>Uni (sea urchin) sushi (3/5): it was one of the specials of the day. I LOVE uni, but this did not seem that fresh<br><br>Scallop sushi (4/5): Good, but again, not the freshest that I have had.<br><br>Overall, very good experience and the service was wonderful!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/vsVuXomSGB1G7x91ObkyBQ/348s.jpg", "caption": "Ora-rashi: Soy sauce glazed fish with rice"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/BsYp22AuGJZR3YEovWX-5A/168s.jpg", "caption": "Snake eye eel special roll"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/7PNIt0v-LbUdzQ4jFPVOZw/168s.jpg", "caption": "Oyster matoyaki appetizer ($13)"}]}}, {"review": {"des": "Been there twice. Had a great experience the first time! Food was excellent, service was great.<br>We decided to try them out again, so we went last night.<br>The food was horrible, sushi rice was undercook. Ordered Albacore Tatake roll, and honestly couldn't taste anything beside the sauce.", "pics": null}}, {"review": {"des": "This is one of my favorite sushi spots in Chicago. If you're looking for more traditional sushi with minimal ingredients, this isn't really your spot. They focus more on specialty rolls but make them incredibly well! The ambiance is cozy and romantic, also BYOB. The only down side which makes me give them less than 5 stars is the lack of dessert on the menu. Not a single item!", "pics": null}}, {"review": {"des": "After living in Chicago for 10 years, I have never (ever) traveled to Andersonville. Boy, am I glad I did last Saturday night! A co-worker recommended Ora to my husband and I for a date night (we were headed to the Chicago Magic Lounge nearby afterwards). Hands down some of the best sushi I have ever had! <br><br>Made a reservation for 5:30 pm. Promptly seated. BYOB. The service was great in that I did not feel rushed, and apps vs. sushi were spaced out. Washi and Surf and Turf rolls were favorites. Everything was delicious, fresh and high quality.", "pics": null}}, {"review": {"des": "These guys are ridiculously good. Much love for Dalbert and Julio for introducing me to good sushi.", "pics": null}}, {"review": {"des": "I don't write a lot of these, but this place is too good to not to. We did the omakase (not specifically on the menu) and everything was excellent. Service was spot on as well. Sit at the bar if you can. Stop by Hopleaf for a nightcap. Perfect evening.", "pics": null}}, {"review": {"des": "So disappointing. Food took forever, server blamed it on the new sushi chef, but she still managed to take forever doing things that did not involve his expertise at all. The food wasn't even that good. Blah. Do not recommend.", "pics": null}}, {"review": {"des": "From the storefront, Ora doesn't look particularly assuming, but inside, the space is cozy, clean, and uncluttered. We loved the Ora-rashi, which was a heaping serving of a fusion of chirashi and a poke bowl. The nigiris were ultra-fresh and delicious. The Nooky roll that we got was good, but as with other sushi restaurants that load up rolls with too many ingredients, specific flavors get washed out. It seems to be a low-key neighborhood place where the sushi chefs know their frequent diners, and I hope to be a regular in no time!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/_lhvyfsM5nJrCxbzSUEZhQ/168s.jpg", "caption": "Nooky roll (garlic chips, escolar, avocado, tempura salmon, yellowtail, masago, cucumber, ginger sauce and citrus soy)"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/uZYEw7R79uR8BipTIxOqUw/168s.jpg", "caption": "Huge portion of ora-rashi (spicy sesame soy seasoned assorted chopped sashimi and veggies over sushi rice)"}]}}, {"review": {"des": "We got in the restaurant around 8:15 pm. We ordered two basic 6pc rolls and was thinking of ordering more after getting our first order. We waited over 30 min to get two 6 pc basic rolls. 30 min for 12 pieces of rolls. <br>Just like most of the reviews, the quality of the fish in the rolls were great. But thats all i can give two points for. The way they rolled the sushi was not great. The rice were falling apart and not evenly distributed. Also 6 pieces of rolls. We finished them in 10 min. <br>I felt like I waisted my time and money.", "pics": null}}, {"review": {"des": "Hands down - best sushi restaurant in Chicago. There is absolutely no dispute. The owners are very friendly and welcoming and the atmosphere is serene and cozy. <br><br>I was pleasantly surprised (or more like shocked) by the Oyster Motoyaki. The oysters were fresh and the sauce was amazing and quite memorable. You cannot replicate this. You MUST get this as an appetizer! <br><br>We also had the Beef Tataki. The beef was perfectly cooked and the sauce blended very well with the beef. <br><br>As for entrees, we got 2 Chef's Choice dishes and they were exceptional! If fresh, unique, and flavor are what you're looking for, this is the place to seek out!", "pics": null}}, {"review": {"des": "Definitely understand why this place boasts, according to many Yelpers, the best sushi in Chicago. Started with unagi, salmon belly, Scottish salmon, and uni (sea urchin) nigiri. All were amazingly fresh, with the salmon belly being my favorite. I'd put their nigiri up against Tsukiji in Tokyo - the fish simply melts in your mouth. Gf said the tuna nigiri was phenomenal too. We ordered Wasabi Tail, Snake Eye, spicy salmon maki, tuna maki, and received spicy octopus on the house (more on this later). Wasabi Tail hands down the best specialty maki I've had in the states. Snake Eye was a bit too thick - but then again I'm not a fan of tempura flakes and the aioli just made it too heavy. Spicy salmon was to die for - if you like spicy maki this is a must! Octopus was a bit too salty for my taste, but then again I'm not a huge octopus person to begin with - it was incredibly fresh just like all the other rolls/nigiri. Server was very knowledge, made several recommendations, friendly. <br><br>This would've received 5 stars but we made a reservation at 7pm and were not seated until 750. we received a free roll but the inconvenience caused me to take a star off. I understand you can't control how long other customers spend dining, but taking to a couple who have been here before while waiting in line, it seems as though this is a recurring problem - perhaps stagger the reservations just a tad bit farther apart on the weekends to address this issue?", "pics": null}}, {"review": {"des": "Chef's omakase for sure! If I am in the mood to splurge, Ora is the place. Chef's omakase is one of the best in the city. Maguro Toro and Sake Toro is available occasionally but is a must when it is available.", "pics": null}}, {"review": {"des": "Met a friend here for our first time visiting and we both tried the shrimp tempura roll.<br><br>It was delicious and the prices are reasonable. The food came in a reasonable time and customer service was 5 stars. <br><br>The variety of sauces did not include teriyaki, but the freshness of the sushi and rice was on point. <br><br>You can smell the fresh fish when you come in. In a good way. The atmosphere is dark and not too crowded on a weekday. <br><br>I enjoyed my visit and will come again.", "pics": null}}, {"review": {"des": "I've been in a few different times and it is consistently wonderful. Max has been my server both times and he is great! His recommendations are spot on. <br>I've tried the specials each time I've gone in and have not been disappointed. <br>The plates are not only beautiful but they taste amazing as well. The tuna sashimi here is some of the best I've had. <br>Definitely try the beef tataki as an appetizer!", "pics": null}}, {"review": {"des": "The Good: Delicious sushi. Classy yet laid-back atmosphere. Not over-priced. BYOB and there's a liquor store a block away. <br>The Bad: OK service. They took a while to come to the table and find a wine glass. The miso soup was not good (how can miso soup not be good?!).<br>Overall, a great experience. Five stars.", "pics": null}}, {"review": {"des": "Ora is my favorite sushi restaurant in Chicago. Amazing food, service and atmosphere (small and intimate, definitely recommend reservations).<br><br>Yesterday I had the beni toro (salmon belly) nigiri and an off-menu nigiri with tuna, avocado and garlic chips. I could have eaten plates full of both! Flavors and textures were spot on. I also enjoyed the miso soup, wasabi tail roll and the spicy tuna roll - this last one definitely had a kick, loved it!", "pics": null}}, {"review": {"des": "Yet another exceptional meal at Ora! Recommended this place for a friend's birthday party and everyone loved everything that we ordered. Even though it is a small place they had no problem accommodating a party of 8. We ordered a lot of rolls and they brought the food out at a perfect pace so we never had to wait long in between or had too much all at once. The  quality of the fish here is always consistent and even their California roll is far better than your typical sushi joint. I have to say Ora is the best sushi restaurant in Chicago for low key  and casual dine in!", "pics": null}}, {"review": {"des": "WOW! Didn't expect this quality. The nigiri & sashimi were unbelivable. Even rhe miso soup was amazing! Love the quality, service, & cozyness. Definitely coming back!", "pics": null}}, {"review": {"des": "We went here at about 7:30, and all tables were filled except the one for our reservation. We were seated, and first ordered an appetizer. It came less than 3 minutes after our order, and was very good - I got the miso soup, and all of the others got the House Salad - Greens, Shaved Radish, and Carrots in a ginger dressing<br><br>But, after the appetizer, my sushi was much better than I expected... It was the Snake Eye roll, and was the third best sushi roll I have ever had (the top 2 were from a restaurant in St. Louis). It was filled with goodness, and was rather hard to eat in one bite, but was delicious! It had just the right amount of heat for sushi, and wanted to be followed by another bite. <br><br>(However, the Surf and Turf roll was not that spectacular... the beef was very rare.)", "pics": null}}, {"review": {"des": "Sushi is fantastic as always.  That being said, my past 3 visits, the service has been in the dumps - and nobody cares - no ownership taken from any of the servers.  Disappointing", "pics": null}}, {"review": {"des": "Ora is delicious. My sushi-averse boyfriend even loves them! Order the Surf and Turf roll. You will not be disappointed.", "pics": null}}, {"review": {"des": "I have come to this Japanese sushi place several times.  I recommended to a friend because I recalled how yummy their food is.  Master chef and owner has an exceptional menu and space that allows a great experience.  Oh and I love that it is BYOB.", "pics": null}}, {"review": {"des": "This was an unexpected surprise in Andersonville. Decided to go on a whim and taste for sushi after recently moving to the neighborhood. There are a zillion places to get sushi around the city and you never really know what you'll get, Ora was a pleasant twist on some classics like spicy tuna and had a handful of maki rolls that sounded interesting and different than the regular fare. Wasabi and Nooky rolls were so good, we ordered the Surf and Turf, place was delightful and the flavors were on point. We bounced in without a reservation for a table for two and snagged a seat on a Tuesday but the place was quickly filled - recommend calling ahead.", "pics": null}}, {"review": {"des": "Just excellent!!!!! Try the Dynamite roll and let me know, consistent excellent service and knowledge.", "pics": null}}, {"review": {"des": "I have lived in LA for 8 years, where there is a large Japanese community, even two or three Japanese neighborhoods. No wonder it was very easy back there to try good less-Americanized sushi with reasonable price so often. And that was one of the things missing from my life after moving to Chicago. <br>Also let me add that I have been to Japan from time to time and have tried authentic sushi over there as well. <br>AND HANDS DOWN!! Ora does have one of the best freshest sushi I have ever tried. Will be back so many more times. We ordered toro salmon and toro yellowtail and tuna sashimi which melted in our mouth like heaven drops. Also their Unagi Maki is to die for.<br>Waiters were also friendly and made the experience much more delightful.", "pics": null}}, {"review": {"des": "This is one of our favorite sushi restaurants in Chicago - especially because it's byob! The restaurant is small, so it's helpful to call and make a reservation first. The sushi is fresh, creative, and beautiful. We love the chirashi roll and escobar jalapeño roll. The wait staff is so friendly and helpful! You really can't go wrong with anything on the menu.", "pics": null}}, {"review": {"des": "Seafood was fresh- ordered Chirashi don and every piece was cut well. Uni was not bad but not great. Service was mediocre , a little haphazard( they had 4 servers who were taking turns attending our table  of 2 and it wasn't even busy) and the green tea was watered down. I wish they offered some substantial rice dishes too like beef,chicken or salmon teriyaki or tonkatsu or tempura, but hey, it's a dedicated Sushi restaurant and that's ok. I really want to give 3.5 stars, but alas, no half points.  But if only judging on Sushi, 5 stars.", "pics": null}}, {"review": {"des": "This was hands down the best sushi experience I've ever had. The fish was so fresh and thoughtfully and creatively prepared. We had the pleasure of having Dalbert (owner and head chef) take us through an epic taste journey. The classics were flawless and the signature items were thoughtfully simplistic yet nuanced in flavor. The respect the team at Ora have for tradition on sushi was evident in ever detail of the space, the meticulous service and in ever bite. I live in New York but will be planning a visit to Ora into ever Chicago trip moving forward.<br><br>Note: they are BYOB but there is a great beer/wine/liquor store with a great selection across the street. We brought our own beer and our server, Tony, was on point with any refills/replacements we needed.", "pics": null}}, {"review": {"des": "Good god is this place out of this world. Love the owner, BYOB, amazingly fresh fish.", "pics": null}}, {"review": {"des": "Me and a group of friends went here and tried almost every roll on the menu! I love love loved the selection here and would recommend to anyone and everyone. We also had the edamame and the the baked oysters. Those were a little too rich for me. The flavor profile was something I had not experienced before but I love trying new things. Will be back again and again and again !", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/LAjqamDedK3Kl5Ul7P6UPg/168s.jpg", "caption": "Spicy salmon basic roll."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/fLWYfcXXdGRhsu0grO3kNg/168s.jpg", "caption": "Oysters !"}]}}, {"review": {"des": "Best salmon rolls in the city. The fish is fresh, high quality, and flavorful. Even my boyfriend, who usually shies away from fish went to town on the Sake Maki. The Avocado was smooth and buttery, they know how to select. <br>Ate ourselves into a food coma for a reasonable price. <br>It's a small, intimate space that's easy to overlook when you're walking down the street but incredibly worth the visit. We will be coming back.", "pics": null}}, {"review": {"des": "Very good place, feels authentic and real. Quiet interior, not to big, which is good sign for a sushi restaurant. That was our first visit to Chicago and we wanted to try good and fresh fish. Being a Florida residents, who previously lived in SF, we can tell for sure what is BAD and what is GOOD and differentiate conventional crap from a well made pearl. My wife and I are sushi addicted, so we know exactly what the REAL sushi should look and taste like. Let me tell you from a start, that this is the only one place in town (from all 4 to consider from) that is open on Monday. <br><br>So long story short - fish is very fresh, serving is professional, nigiri are well proportioned and sized. This is a BYOB place, so feel free to buy your favorite sake fro a liquor store right ahead in a 15 sec distance. If you are hungry as we were (14 salmon nigiri, both fat and plain, 6 tuna, 4  scallop,  4 octopus, 2 big sweet shrimp, 5! maki roll...) be prepared to spend ~$130. But it %100 worth it. Every bite!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/1oND7XM5OyZXED0iMPvimw/168s.jpg", "caption": "Legit"}]}}, {"review": {"des": "Ok here's the deal. The food is pretty good, but the menu seems pretty limited and a good majority contains something seared or cooked in some way  :(. The worst part of it all is there are three guys behind the counter and sitting at one of 10 tables you still wait 30+ minutes to get even your starters. Mind you maki will come out before sashimi which was a bit different. Over all the food was good, but nothing to write home about and with the wait it took it down a bit for me. I will say our server was awesome.", "pics": null}}, {"review": {"des": "Service: 5+ stars. Super friendly. they checked on us and gave recommendations<br>Ambiance: 5 stars. low lit and initimate<br>Free byob: 5 stars<br>creativity: 4 to 5 stars<br>Food:...maybe 3 stars. <br><br>Given the raving reviews, we came in seeking a clean refreshing dinner but it seemed the rolls we ordered were either to crunchy and fried or too saucy and spicy or had a smokey flavor with too many things going on texturely. their preparation was just soo different that we didnt feel like we had a light sushi dinner. <br>-The usual basic spicy salmon was so spicy that I could not even taste the fish. It was so red that I thought it could be tuna but I just could not tell through the gooey spicy chili sauce and low lit ambiance. <br>-The albacore tataki roll had a smoky flavor to it and could not taste many of the other ingredients. the hubby thot it was too fishy for his liking. <br>- The scallop dynamite was pretty good. it was creative and with a very fried crunchy texture. <br>-The spicy octopus was the only roll we found kind of relatable. <br>- the beni toro was certainly the only fresh item. the salmon belly melted in your mouth but  unmemorably.<br><br>the place is small so call ahead for rezzo.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/-AvY1PP5xONlbYFZ3UL1-g/348s.jpg", "caption": "Beni toro"}]}}, {"review": {"des": "Love their sushi here!  Friendly staff and creative selections.  The portions are generous and priced reasonably.  They do a lot of the little things just right here, like toasting the sesame seeds just so, and having the perfect balance of sweet and savory in the eel sauce.  Nice rice to fish ratio, which is not a given at a lot of places.  The seaweed salad has a wonderful, fresh taste to it.  Probably my favorite sushi in the city.", "pics": null}}, {"review": {"des": "Still remains one of the best spots for sushi in Chicago! <br><br>Started coming here four years back, and it continues to be one of the best options for sushi I'd ever recommend. The fish is so fresh, and the space is always fun!<br><br>Salmon Nigiri, Scallop Volcano (one of my favs), Surf n Turf Spicy Tuna roll, wasabi tail roll, Dynamite (one of my favs), nooky, etc. They're all SO good!!<br><br>BYOB, and they can chill your wine if you'd prefer.", "pics": null}}, {"review": {"des": "This is our go to sushi place.  Everything is delicious here. Rice is perfectly seasoned and a good temperature, everything is fresh, soy sauce is already on the nigiri so no need to dip in soy sauce, perfect fish to rice ratio, and service is fantastic. The hand rolls are also flavorful. Spicy take, spicy salmon, and hamachi are my favorites.", "pics": null}}, {"review": {"des": "I went there once on a double date. It was an experience. The first thing that I noticed was the service. The waiter was extremely nice and put up with our groups many questions. He recommended multiple things, even though we ended up ordering pretty much the entire menu. <br><br>The food was unique as sushi goes, definitely not your typical sushi flavors. I would have to put it at one of my top 5 sushi restaurants. A must try is the oyster motoyaki. A big plus is it's byob. <br><br>The restaurant itself is not very large and can get pretty loud. Trust me even if it sounded like a jet plane in the restaurant you still need to try it!", "pics": null}}, {"review": {"des": "One of my favorite sushi places in Chicago. I am a fanatic of Japanese food and have been there several times. This may not be a local market in Osaka but it is outstanding and a definite rarity in the midwest. The fish has amazing texture, flavor and is always fresh. The service is truly delightful and personable and the atmosphere is welcoming and relaxing. The kitchen and nonfish dishes are all top notch as well especially the vegetarian maki. I have been here a dozen times and loved it every time.", "pics": null}}, {"review": {"des": "Excellent, fresh sushi. I suggest the albacore tataki as well as the beni tori. You really can't go wrong with anything; even the basic rolls like California was amazing. I recommend making a reservation since this place is very small and cozy. Customer service was great. We didn't get the name of our server last night but he was one of the friendliest, most helpful servers we've ever had. Will be back.", "pics": null}}, {"review": {"des": "really good sushi! I tried the shrimp tempura roll and the California roll. pretty limited menu but the food, service, and atmosphere was perfect for dinner with friends", "pics": null}}, {"review": {"des": "I learned something in the first 5 minutes of sitting down. And that is the real name to the sweet sushi is not AMA EBI and is actually Botan EBI. I would have loved my entire life saying it wrong. Sushi here is prepped in house. Actually saw the Anago being peeped by the chef owner. Posh lay out and great vibe to this restaurant. Should give it 10 stars but 5 is the max.", "pics": null}}, {"review": {"des": "Tiny sushi restaurant on Clark Street. Make reservations unless only 2 of you plan on coming by 6pm. They open at 5pm. There is no room to wait. BYOB.<br><br>Now on to the good stuff: Rolls.<br><br>I've been here 3 times and love it. I'm not a sushi connoisseur, just a guy who likes to get down on some rolls.<br><br>Prior to finding this local gem, Coast Sushi Bar in Bucktown was my fav. Plenty of dates with their White Dragon - former best roll.<br><br>The torch has been passed on. The Dynamite roll at Ora is perfect. It's crunchy, warm and melts in your mouth. Very different compared to any roll I've experienced before.<br><br>I pair it with the Volcano roll. My second favorite. Like marriage, when you find the right one (or 2 in this case) you settle for the best and for go the rest.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/qisvl5A5wVOWotYtlhqJbQ/348s.jpg", "caption": "Volcano (top) - 2nd best roll. Dynamite (bottom) - best roll ever."}]}}, {"review": {"des": "A  small , cozy , dimly lit sushi place may make one think the sushi might be suspect , but this sushi place  is amazing !!! This place is one the best sushi places I have been to in Chicago ! <br>The sushi experience here is like a 7 course meal  . The waitresses are very helpful in making it amazing sushi experience for your taste buds ! <br>They really know which rolls will complement each other . <br>We started safe with the spicy tuna and dynamite and as per the waitress suggestions we tried the surf and turf ( amazing roll ) , salmon roll , the nooky , and a couple more I can't recall the names of . <br>This was the first time I can honestly say I didn't feel the need to dip my roll in any soy sauce . The flavors of each roll was so good no need for it . <br>Highly , highly recommend this place !!! <br>And make sure to call and make reservations !!!", "pics": null}}, {"review": {"des": "Great sushi with friendly service.  I suggest the chef's special where they are creative with their rolls.", "pics": null}}, {"review": {"des": "This place came highly recommended from a good friend of mine that speaks quite highly of this place...he went on to say this was one of the best sushi restaurants he has been to in Chicago. <br><br>I came in on a Tuesday night and there wasn't a lot of people there but once I sat down the place started getting pretty packed where there wasn't a seat available in the joint...glad I made a reservation. This place isn't that big so it can fill up pretty fast. Very nice space as the lighting is pretty low and has a pretty chill vibe going. The place is BYOB so I brought some sake to sip for this outing lol. Now on to the sushi....<br><br>I overheard someone say the yellowtail nigiri was pretty good and they were right. The tuna (recommended by Justine the server) was good as well. We also went with the octopus and the Shiro Seared Tuna nigiri and they were delicious! We had a couple of rolls...The Nooky and the Dynamite. Both were very good and had a bit of spice. The menu isn't as extensive as most places I have been to, but its pretty effective.", "pics": null}}, {"review": {"des": "We are big fans of Ora! It's our go-to quick casual sushi spot near home. But make reservations because they're packed on Saturdays during prime dinner hours, even on cold days when we thought they didn't need reservations! And it's surprisingly busy during weeknights too, though part of that is cuz the place is pretty tiny.<br><br>On weekends, our experience is quite a bit better. There's been special fish by the piece every weekend that we've gone, and servers are very warm and friendly, taking their time to explain the fish, taking time to check in with us at good intervals. We've gotten the sushi set (B or C, I forgot) with the \"chef's choice\" nigiri, and they've included some of the special fish that aren't just your run of the mill sushi menu pieces. And the fish on special have been incredibly fresh and unique in flavor, and we do spring for those; they're a bit more pricey but worth it. <br><br>Weeknights... complete opposite. I would make reservations and go on a weekend.<br><br>Food-wise, like I said, the sushi set. The spicy tuna that comes with it has got a definite kick to it. Very yummy! Oyster motoyaki - get it. It's a heavenly couple of bites. Chirashi roll is an explosion of umami and a generous fish portion, but the fish gets drowned a bit in sauce and might not be for the sashimi purist. Honestly... everything else, I can't remember if we've even gotten. Those are the most memorable go-tos. Their house salad dressing is particularly refreshing too.<br><br>Definitely make this one of your sushi spots if you live in the area!", "pics": null}}, {"review": {"des": "I love this place! Max is the best server ever, he is there Tuesday, Thursday & Saturday!!! Reservations are suggested, the seating is limited. <br>Order:<br>Miso Soup<br>Beef Tataki<br>2 Philly Rolls sub avocado for cucumber<br>Spicy California Roll<br>Surf and Turf<br>Shrimp Tempura Roll<br>BYOB<br>Bottle of Champagne <br>Good AF!", "pics": null}}, {"review": {"des": "Probably the best sushi I've had in Chicago. They do a great Omakase tasting menu here they just bring out a variety of great bites (Chef's discretion but usually including all of the daily specials) one dish at a time until you're full. Awesome place.", "pics": null}}, {"review": {"des": "Great local sushi spot with fresh fish. The price is competitive and the portion is great with a focus on fish rather than overloading with rice. I definitely recommend calling ahead for reservation or carry out as it can take a while to prepare. <br><br>Favorites:<br>Beni Toro/ Salmon Belly<br>Madai/Sea Bream <br>Sake/ Salmon<br>Escolar<br>Salmon Avocado Maki<br>Escolar Jalapeño Maki", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/X9vhCJt3aKZO9mCw9QhxJw/348s.jpg", "caption": "Nigiri: Salmon, Sea Bream, Escolar; Maki: Salmon, Escolar."}]}}, {"review": {"des": "Service was very slow, because there's only one waitress. Their soy sauce is the saltiest I've ever had. The food is not bad, I had better but it's ok, the shrimp tempura is actually good. What I didn't like the most is charging me $0.75 for hot sauce which is served for free in every restaurant I've ever been to. I also ordered miso soup which wasn't good at all. My experience was below average, I wouldn't go back.", "pics": null}}, {"review": {"des": "Absolutely delicious sushi. Quality & taste were top notch. Fave rolls: Surf & Turf, Spicy Octopus, and Albacore Tataki. Our server Derek was great. <br><br>Tips: definitely get a reservation. There's usually a wait and it's hard to get in on the weekend. <br><br>Oh and BYOB! No corkage fee.", "pics": null}}, {"review": {"des": "I called a little bit ahead our arrival and they saved us two seats at the bar. We arrived around 6:30PM on a Tuesday night. Reservations seem to be essential unless you are coming right at 5 when they open.<br><br>It's BYOB so we brought a bomber of good beer to drink with our food. We ordered the Sushi Set C, ($19) which included chef's choice 6 pieces nigiri, 3 pieces spicy tuna roll and 3 pieces California roll. Also we ordered the Scallop Volcano ($14) maki roll, which is a mix of spicy scallop, shrimp tempura, smoked salmon, cucumber, asparagus, grilled scallions and sweet soy reduction. Everything was excellent, the service was great and the sushi chefs were all very friendly.<br><br>Hopleaf is right across the street, a good place for a beer after some sushi!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Bx1Vnn206JjERBs7gIFN9A/348s.jpg", "caption": "Menu"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/7ud56GfmrVEqzeFTmcC0Jg/168s.jpg", "caption": "Menu"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/SJA-mFCnkmOLLPk4sYEkMA/168s.jpg", "caption": "Sushi Set C"}]}}, {"review": {"des": "This place is a great choice. Very pleasant, wonderful atmosphere and the whole experience is the best I've ever had in a restaurant of this style. They make you feel really comfortable and actually it becomes a whole experience. The server knows the menu very well, he recommended a delicious appetizer (the oyster one) and at the moment he delivers your food at the table he will let you know few little details on how to get the most flavor of your dish (for example when to add soy sauce or not). Very friendly staff and respectful at the same time. The service is fantastic. They have a concise and very well designed menu with few super interesting options! The food was just perfect in every sense, I totally recommend this amazing place.", "pics": null}}, {"review": {"des": "We called the restaurant and made a reservation for 8:45pm. We arrived at 8:45pm with a bottle of chilled wine. There was a table of six empty and two tables of four empty when we arrived. We were told that it would be a few minutes before we were seated. Subsequent to that, the restaurant seated a party of six and a party of 8 who arrived after us. It is 9pm and we haven't been seated. <br><br>We were on time and should have been seated.<br><br>The wine is warm now.  We probably won't come back.<br><br>Edit (5/29/16): In response to Justine B.<br><br>I understand very well that restaurants, especially small ones, must plan out reservation space strategically.  This problem of how many reservations a restaurant should allow and at what time isn't a new problem.  Every restaurant has to figure it out.<br><br>Again, we arrived at 8:45, and there were no other people waiting in the front of the restaurant or outside for seats.  You say that the 8 top and the 6 top were reserved for 8:30.  When the people who reserved the 6 top arrived, they CLEARLY stated to the maitre d' that they had a reservation for 8:45, not 8:30, so I'm confused when you say that their reservation was for 8:30.  In addition, the 6 top diners arrived 5 or so minutes after we did, so it would make perfect sense for them to have had a reservation for 8:45.  I find it unlikely that they had a reservation for 8:30 and arrived at 8:50, 20 minutes late, without apologizing or saying something at all about it to the maitre d'.<br><br>You say \"We offer of chilling wines for our guests, even the ones who would like to step out for a drink in a nearby establishment while they wait for the reservation before calling them when their tables are ready.\"  This would have been good to know.  No one offered to chill our wine while we waited.<br><br>You say \"Also because we are BYOB, customers sometimes tend to stay a little bit longer.\"  This makes complete sense but disappoints me as an explanation or excuse as to why we had to wait so long.  If you know that your diners tend to stay a little bit longer, then this unfortunate situation could have been avoided.  You KNOW that you can't pack your reservations in so tightly, yet you did it anyway.<br><br>What your restaurant should have done is told us that you did not have any availability at the time we requested.  It is always better to be conservative than risk making someone wait so long when they have a reservation.  Else, what is the point of a reservation?<br><br>Frankly, this is just the old song and dance where a restaurant tries to pack in a ton of reservations so that they can have 100% coverage.  The restaurant's explanation of why it happened, and the implication that they should be excused for it, is a little insulting.  Other restaurants do better or, at the very least, they make up for it in some way.<br><br>Waiting 20 minutes to sit down when you have a reservation isn't such a big deal.  But for some reason, this time it really annoyed me, and I felt compelled to make a public comment.  Transparent excuses don't help a restaurants' case.<br><br>Figure out a way to avoid making diners wait 20 minutes to sit down.", "pics": null}}, {"review": {"des": "Favorite little sushi bar in Chicago.  Everyone is always pleasant and the food is always delicious.", "pics": null}}, {"review": {"des": "Don't see what all the excitement is about. Went last night for the first time, small room, only ten tables, and an over-zealous waiter. He was WAY to enthusiastic to be believable, as he \"reviewed\" the menu for us, as though we needed a seeing eye dog to read.<br><br>At his suggestion we tried two orders of the warm oyster appetizer . . .described by Mr. Enthusiasm, \"as the biggest and best he's ever tasted.\" This man needs to get out more. For only $26 we received four of the smallest oysters in Chicago, smothered in a creamy, soy sauce. \"Where's the beef?\" we thought, as we questioned how gulible we were.<br><br>Thirty minutes later, we finally received our three rolls and sashimi plate. Oops, forgot that the sashimi  comes with 'salty' miso soup. When we asked Mr. Enthusiasm about the luke warm soup, he said the bowls were kept in the cooler! Why?? So he brought another serving of warmer soup, but with ice cold tofu. His reply, the tofu has to be kept cold to prevent bacteria! Seriously? <br>Ixnay the soup.<br><br>Sushi was good, not the best in Chicago, and actually rather small portions with not too much in embellishments. We decided to order another roll, and with four people working behind the counter, it still took another 15 minutes!<br><br>BTW, waited through the whole meal for water refills. Mr. Enthusiasm was nowhere to be found.<br><br>And twice, the staff cleaned the table next to ours (about two feet away) with clorine bleach. Effective for killing germs and your appetite.<br><br>Paid the check, $100 and still hungry. Had to go find my coat. Turns out the \"coat room\" is actually in the cooler. I love putting my \"chilled\" coat on to to go outside in the winter. BTW, I found some miso soup bowls in my coat pockets!<br><br>Check out 153 Akira in Wilmette. You'll be considerably satisfied in comparison.", "pics": null}}, {"review": {"des": "Holy Rolls! I just experienced sushi melting in my mouth! Never before have I ever experienced sushi of this tender quality! I'm blown away! Salad with ginger dressing is where I started, they had quality romaine lettuce and yummy dressing. Next up... Tuna & Salmon Nigiri, Snake Eye, Scallop Volcano (Fave,) Surf 'N' Turf & Spicy Tuna Roll. The Scallop Volcano is an award winner... Great service, and BYOB! Word. Our friends brought in our favorite beer & homemade margaritas. A pretty cool concept, which seems to be more common than not in this hip city. Faaabulous! I want to come back every day I'm here  Am I hyping this place up? No. <br><br>A little tiny hole in the wall restaurant providing the most welcoming dishes for my first meal here! It will knock your socks off. I was so thoroughly enjoying my food, I forgot to take pictures.. A must when in Chicago.", "pics": null}}, {"review": {"des": "I've been there twice and the first time I left speechless. The 2nd time my guest left speechless. The food and the flavor is beyond amazing. The food alone is an experience but when you combine it with the superior service your evening will be one of a kind. Nothing else like it out there!  Awesome restaurant and fantastic people!", "pics": null}}, {"review": {"des": "OH MY GOD. Best sushi I have ever had. The atmosphere is really nice. Definitely a great place to go on a date or nice dinner. It's BYOB which is really convenient. Just make sure you make reservations prior. It's a pretty small place. It may seem pricey but you get your money's worth!", "pics": null}}, {"review": {"des": "INCREDIBLE OMAKASE <br>I tried Omakase as executed by Master Chef and owner, Dalbert. This was definitely the way to go! The best way I could describe it is as a beautiful melody that unfolded into a symphony. His selection was exquisite and the fish was extremely flavorful and fresh. One of my favorites was his unforgettable Oyster Motoyaki. I wish I could eat this every day it was absolute HEAVEN. It was creamy and crisp, rich and slightly sweet. I highly recommend Ora to any sushi lover the quality is beyond and you will be blown away!", "pics": null}}, {"review": {"des": "Food is very good. Service is unreliable. We were there with a reservation for 5 on a fairly busy night, it took 2.5 hours from start to finish of our meal. There were 15-20 minutes between each of the rolls coming out, with no visits from servers in between. Eventually when over half an hour passed and we were still waiting on two more, we politely went to ask what was up. Our food had been delivered to the wrong table, so they were making them again. But we had to seek them out to get that information. Truly, the food is very tasty. But either it was a rough night with some inexperienced servers, or they have some serious gaps in the organization of their kitchen/servers. And the next morning we discovered they'd charged our card twice, so this experience didn't leave a good taste in my mouth.", "pics": null}}, {"review": {"des": "Nothing stood out to me here unfortunately. I think Arami, Katsu, Naoki, Tanoshii & even Nami are much better.", "pics": null}}, {"review": {"des": "Favorite sushi place! I miss living close by and every time I think to go is on a weekend when they're packed! I've never had a bad experience and the sushi is always super fresh and delicious. Also, BYOB! Love it!", "pics": null}}, {"review": {"des": "Just had Max as our server. I already loved this place, but he went above and beyond to make our experience worthwhile.<br><br>He was just so amazing!", "pics": null}}, {"review": {"des": "My partner and I have been here several times and were blown away each time. After exploring the north shore sushi scene, we feel confident in claiming Ora to be our favorite sushi spot!<br>We usually get a regular maki roll and a special maki roll each. This is more than enough food and adds up to about $22 each. I think this is very reasonable for such high quality sushi!<br>The regular maki are characterized by their fresh and crisp flavors. If you want a clean and vibrant focus on the meat flavor, the regular rolls are the best option. Plus they are half the price of the special rolls. Tonight I got the escolar jalapeño. It was fresh, bright, and clean! <br>The special rolls are so scrumptious to the point of pure pleasure! They are creative and bursting with flavor. Tonight I got the Snake eye which combined unagi, prawn tempura, and a delectable blend of sauce and veggies. Plus, the presentation is absolutely stunning!<br>Furthermore, the decor is warm and inviting, as are the staff. The servers have always been extremely kind, helpful and attentive.<br>This is a great date spot! Check it out!", "pics": null}}, {"review": {"des": "BYOB - 5 stars<br>Parking - 4 stars<br>Reservations - 5 stars<br>Nigiri - 5 stars for freshness, 3.5 stars for cut<br>Rolls - 3 stars for balance of ingredients and cuts <br>Value - 3 stars <br><br>I tried to be objective with my assessment and above rating. Fish is top notch. If I went back here, I would only order Nigiri and Sashimi since the rolls didn't quite come together.", "pics": null}}, {"review": {"des": "This is an updated review of an experience that was once quiet, romantic, and relaxing. Ora has become overcrowded, rushed and loud. Docked 2 stars for the last 4-5 visits that have been the latter. Although the affordable prices and BYOB option is alluring, we'd rather pay premium prices than deal with cramped quarters.", "pics": null}}, {"review": {"des": "I would say, the best sushi in Chicago! very fresh fish, skilled sushi chef, friendly servers, reasonable pricing. I enjoyed my experience here at Ora. One big disappointment was the hot tea, vanilla pumpkin spice favored tea.I was not sure but it was not a green tea. It didn't go well with Sushi/Sashimi. There is a reason why a simple green tea (sen-cha/ban-cha) is served with Sushi. Green tea has tannins that are good for your digestive tract. It's also loaded with catechin antioxidants, and is believed to be effective in eliminating the bacteria vibrio, one of the leading causes of food poisoning. It's same idea as vinegary rice, wasabi, ginger. Everything else, I loved it. I will go back there again with my own green tea.", "pics": null}}, {"review": {"des": "I had an unfortunate experience my first time here and I'm glad I gave Ora another shot. On my first visit, four of us waited a full hour for a table we reserved before being seated. The table we were supposed to get was done eating when we arrived, but continued to open another bottle of wine (thx BYOB), and the management did nothing until sixty minutes later when ANOTHER table cleared up and we were seated there. This time we also had a ten minute wait but it was less packed as it was earlier in the evening.<br><br>While on my last visit we were never brought any ice for our white wine, even after asking five times, we got some this time, although after being asked twice from different waiters. Combined with the small space and waiters twisting around tables, it can feel hectic. <br><br>But this place really redeems itself by its delectable signature rolls. You really can't go wrong, they're all unique, flavorful, consistently beautiful. My favorites are Dynamite and Snake Eye :)<br><br>Just make a reservation and be prepared to wait a bit!", "pics": null}}, {"review": {"des": "If you have ever even glanced at a word I've written, you know that sushi is my ambrosia but that G-d continues to challenge me with a wonderful set of parents, who are fatally flawed in that they also prefer their fish cooked - and thus, after I had deemed SarSar and Stevo were sick of me after a solid 10d of bonding time during my last time home, I made a run for it to Ora w my partner in crime, as it had long been on my radar as a place to try.<br><br>Make a res, got there around 730p on Sat and due to the limited seating, there is was a wait - though it is BYOB, so there are clearly ways to make this sitch enjoyable (read: get teenage girl wasted in the dark corner where those not neurotic enough to plan in advance are banished to to wait for a table) - but make sure you stay sentient enough to enjoy the wonderful nosh.<br><br>Started w misos and a house salad - std ginger dressing was fairly on point, though the salad wasn't particularly special - miso was warm and pleasantly briney. KM made it rain with a chirashi main - hefty assortment of fish layered over seasoned rice - though if you're feeling adventurous, get their spicy version - for $19, it's a fair amnt of food, unless you pound sush like I do.<br><br>They have 10ish fancy rolls, but after abt 4 ingredients my palate kind of dies a little, so we skipped those and indulged in salmon/avo, yellow tail/scallion, shitake/avo, tuna, and california rolls - all of which clocked in around $5-7 - the fancy rolls are closer to $12-15 - portions of fish were ample, the CA roll (w real crab, obs) had this amazing spice in it - not mayo - but something heavenly - and the black sesame seeds on the outside added a surprising, noticeable twist - oh, and and I had a few orders of nigiri too - the medai w ginger was unreallll - worth ordering a few non-maki options - though it's priced per piece, which is always a sad-face situation, but dear Lord is it worth it.<br><br>Din for 3 was around $65, which is quite reasonable given the amnt of food consumed - though it's much easier to spend more if you go all eel/tuna/salmon/spicy mayo/avo/unicorn sauce on your rolls. Noise is fairly aggressive - and the place gets packed - nevertheless, worth a visit, though service is fairly absent/shitty, so don't go hangry.<br><br>For non-sushi heathens, I think they even have a few cooked entrees/starters you can enjoy - giving me hope that maybe one of these days I'll drag the folks down here. After giving them a lil Xanax and telling them we're going to Joe's Stone Crab or something. B/c that's how I repay them for their unending love and support. With deception.", "pics": null}}, {"review": {"des": "What an incredible, stand-out sushi restaurant! Everything I ate was delicious, from the hot appetizers to the nigiri and signature maki. The atmosphere is intimate and warm, and service was very attentive and friendly, a perfect spot for date night or to catch up with a small group of friends (it seemed a bit small for larger groups.) The waitress started by suggesting special fish they had in stock that evening, which we loved (uni and smoked mackerel.) I highly recommend the oyster motoyaki (AMAZING) and beef tataki from the kitchen plates.The scallop volcano was also a standout. Extra points for BYOB. Can't wait to go back! Expect a wait (unless you make a reservation) as it is small and fills up quickly on weekends and evenings.", "pics": null}}, {"review": {"des": "This would be an easy five stars if the host didn't rush us from our table. \"Are you done with this?\" No. [Takes it anyway.]  If someone were waiting for our table, it still would've been rude but I wouldn't have been as bothered.  No one was waiting.<br><br>The food is ridiculously tasty and surprisingly hearty for sushi.  It's an interesting menu.  The room is nice, bustling, no-frills but attractive.  Ora is a great date spot.  So it's disappointing to have the spell broken so abruptly.  It was like a leisurely drive that ended with a squirrel smashing through the windshield.  <br><br>Forgetting that diners often choose restaurants for the experience as much as the food is an unforgivable sin.  I'll be happy to return when there's someone different working the door, and not needlessly bussing tables.", "pics": null}}, {"review": {"des": "So delicious. And nice vibes. I had a yellowtail roll with bacon on/in it (sounds weird, but trust) and it was soooo good. They also had a few gluten free options which was helpful.", "pics": null}}, {"review": {"des": "This place is a little bit of a trek North for us, but it's totally worth it. <br>The Sashimi here is incredible, most places focus on the rolls but here the sashimi is king! Like most people I enjoy using soy sauce with my sushi, but here everything is so wonderfully flavored it's not necessary-it would almost be insulting to the chef with how well everything is flavored. <br>The fish is flown in fresh so at times they do run out off some of the favorites.", "pics": null}}, {"review": {"des": "Esa walking by and found this sushi restaurant and this place was very good the rolls were very fresh and taste so good. The place is very small but if you go weekends early it should not be a wait. <br>The price was very reasonable. <br>Ill be back", "pics": null}}, {"review": {"des": "Consistently the best sushi in Chicago. <br><br>Max is one of the most genuine and talented servers I've ever come across. I've visited multiple times and get slightly disappointed when Max isn't there, he truly  makes the whole experience so pleasurable. <br><br>Get there early or make a reservation, fills up fast", "pics": null}}]}