{"name": "oriole-chicago", "reviews": [{"review": {"des": "Dined here again for my birthday.  Oriole continues to be the best meal in Chicago!<br><br>This place nails every aspect of the meal.  Service is fantastic and food is amazing.  I can be a little difficult with my wine options and they were more than accommodating.  There wasn't a single bad bite in the entire meal, with multiple courses on the spectacular side.  The only minor criticisms I have is that they eliminated bread and dessert is a tad on the light side.<br><br>Shocked that they haven't picked up that third michelin star.  It is just a matter of time!", "pics": null}}, {"review": {"des": "OTHER REVIEW IS FOR FOOD HAD TO MAKE TWO REVIEWS SINCE YELP HAS A WRITING LIMIT<br><br>non-alcoholic pairing ($95): there really good n worth it but didnt like the ones that tasted like sparkling water n tea but they did pear well with the food best ones: Soothing/ Red/ the tamarind one (lovely/malty/imbued these three need to be bottled) <br><br>effervescent: i didnt like this cause it tasted like tea n combined with sparkling water<br><br>Soothing: its made the same way sake is but without the alcohol this was really good n interesting<br><br>Winsome: this was similar to the first one but with more flavor n was really pretty<br><br>Lovely (peach drink): this was phenomenal tasted like peach juice was so good asked for seconds<br><br>Red:this one was really refreshing tasted like cranberry juice<br><br>Malty: this was phenomenal couldnt stop drinking it the banana flavor was so good<br><br>Crisp: i didnt like this was really bitter<br><br>Imbued: this was so good its like that mexican tamarind spicy candy n it pares perfectly with the desserts", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ldfl_gO9C4XROswypDU0CQ/348s.jpg", "caption": "Crisp"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/DQPHsbgGtNLf18maeGn3NQ/168s.jpg", "caption": "Winsome"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/EETnFndwdBgUktHUyQIkBg/168s.jpg", "caption": "Malty the banana flavor was phenomenal"}]}}, {"review": {"des": "So for perspective, I have not only dined in most of the Michelin star, 1 - 3 star, restaurants in the U.S. but I have also dined internationally at a lot of the world's best three Michelin star restaurants overseas. These include Eleven Madison Park, Guy Savoy, Central, Osteria Francescana, among many other world renowned restaurants. <br><br>Oriole was amazing and astonishing to say the least. The complexity and boldness of flavor, yet still balanced, of the courses was exemplary. I could go through the menu course by course but there really is no need as every course was exquisite, beautifully presented, and memorable. The non-alcoholic pairing was and is a brilliant, inspired, and innovative idea. But even a brilliant idea has to still be executed properly, and it absolutely was perfect. <br><br>This restaurant has absolutely reset the bar for 3 Michelin star dining in Chicago (e.g. far surpasses Alinea) and the U.S. Don't be fooled by Oriole's hidden offbeat location or its unpretentious atmosphere. This is a very serious contender in the 3 Michelin star world. Dine at this restaurant while you can still get reservations because it is inevitable that a third Michelin star is forthcoming. A mere three days after dining here, I immediately made a reservation for the first available date in October. Oriole now joins the elite list of my favorite restaurants worldwide including Eleven Madison Park, Guy Savoy, Central, Osteria Francescana among a few others.", "pics": null}}, {"review": {"des": "I think everyone knows the food is amazing. But I really want to comment on the other part of the dining experience...service here was impeccable: relaxed but consummately professional and knowledgeable servers with a sense of humor and who spoke at the appropriate volume and enunciated well. I know it sounds like a small thing but it isn't, and it made our meal all the more enjoyable. From being greeted with a cocktail at the entrance to being wished a wonderful evening at the end of our meal, I cannot say enough good things about the staff here. <br><br>And the spirit-free tea-based pairing is incredible.", "pics": null}}, {"review": {"des": "Came in for my husband's 40th birthday a month ago. I made reservations over a month or so before then. I liked that we didn't have to prepay.<br><br>The good:<br>-the service was very on point and knowledgeable. <br>-they are not insistent of their drink pairings which was great. We really enjoyed having a choice of la carte cocktails which were well balanced. My favorite had tamarind in it. <br>-ingredients were all fresh and executed well<br>- good presentation and well spaced out<br>- every detail is not overlooked<br>- the goody bag to take home was nice touch. Everyone should do this.<br>- cool entrance but that's it.<br>- personalized menu is a nice touch <br><br>The meh:<br>- the food was good but it wasn't interactive or awe inspiring as I would have hoped<br>- the price. I would have preferred if the prices already included tips. I still think 1 of my other high end luxury dinner experiences were better for less price and presentation.", "pics": null}}, {"review": {"des": "Our group of four came here at 7 pm on a Saturday night. The entrance is very unique and unexpected and the restaurant is simple yet elegant with a chic/modern feel. I was surprised that some other diners were pretty casually dressed since this place is pretty upscale... The open kitchen is immaculate and it is really cool to see the chefs in action. <br><br>The service at this restaurant is spot on. All the staff are super knowledgeable and friendly. The food was pretty wild and the flavor combinations were so unique. Was it worth ~200 per person? Probably not but we had a great experience and enjoyed our night. I would recommend trying Alinea before coming here, as I prefer it over Oriole.<br><br>I will note that I am pescatarian and the restaurant emailed us a few days in advanced asking if there were any dietary restrictions. They were super accommodating to this. However I will say you may not want to come here if you are vegan or vegetarian because the menu primarily revolves around seafood. It seemed as if they could make accommodations for gluten free / celiac.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/a1WKg3tczjn0tqv9O68tOQ/348s.jpg", "caption": "Tasty old fashioned. I think it was ~$14"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/5knLrUxcXMdaYHH81r3tKg/168s.jpg", "caption": "Sweet wine and spirits"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/fGCjaMLb370QN6UBuXRMXA/168s.jpg", "caption": "Hi"}]}}, {"review": {"des": "My husband and I had one of the best dining experiences ever at Oriole last night to celebrate our (almost) one month anniversary. I will keep this review short since the food was from a tasting menu, so it won't be much of a help if I describe how each dish tasted.<br><br>Every dish is amazing! Very very pretty presentation and the food has so many layers of flavors. Portion is about one bite or two, so you got to experience many flavors at once and won't be too stuffed.", "pics": null}}, {"review": {"des": "From entrance to exit oriole was a fantasitc meal and journey. Beauity and deliciousness in a simple and relaxed environment. It started with a really warm greetings and refreshing drink. While we waited the waiter engaged us in great conversation. <br><br>After we finished our drink, the waiter opened and old fashion elevator /loading dock door to reveal a cozy dining room.<br><br>Food was all on spot. No dish fell flat and were delicious. really enjoyed everything. I rarely can say that about any restaurant. Even alinea there were a few dishes that weren't quite there but were creative. They really speaks for itself. My favorites were the hamachi/caviar starter and the wagyu and squab.<br><br>Only gripe, which is expected, was leaving a bit on the nippy side.I will be back the next time.i come back to Chicago.", "pics": null}}, {"review": {"des": "What an amazing total dining experience from start to finish!! I can't express how much fun we had dining here and the food!!! Just amazing.<br><br>The experience begins from the moment you arrive when there's a friendly face who greets you and offers you a drink to start. And they open up the freight elevator looking door to reveal the intimate dining room beyond the gate. The kitchen area is see through so you can see all the chefs working and prepping the meals so that was an added bonus. <br><br>It's a prix fixe 13 course menu with optional drink pairing and they try to keep the menu as an element of surprise unless you cheat and scope out the menu beforehand like we did. Every course has luxurious ingredient such as caviar, uni, king crab, and A5 Wagyu al prepared to perfection with all the ingredients placed delicately on the plate that made it seem like a beautiful piece of art. And everything tasted just amazing! Hard to describe in words.<br><br>Aside from the food, I think what really took our experience to the next level was just the attentiveness and friendliness of all the staff at he restaurant especially our main server Michelle. She was so personable and accommodating from beginning to end I really think she set a new bar for me how the restaurant service can or should be.This is hands down the best fine dining experience I've had and I wish I had more stars to give.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/UqG3gwuHoMcEXDNIsgzbPg/348s.jpg", "caption": "Squab and foie gras"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/4GwFiOanBfFPIZl029KizQ/168s.jpg", "caption": "Black Sea bass"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/aqzfzEf1T8NyWJ_DWGHTxA/168s.jpg", "caption": "Amazing!!"}]}}, {"review": {"des": "Always culinary-minded when traveling, even if the impetus for a trip is otherwise, it was prior to seeing Radiohead at The United Center that a table was booked at Oriole, the Michelin 2* assuring guests that a ninety-minute Tasting Menu would be fast-paced but manageable and not a burden on the kitchen.<br><br>Opened by former Senza Chef Noah Sandoval in Winter 2016 and quickly ascending the ranks of Chicago's best Restaurants following the closures of 42 Grams, Tru and Grace Oriole resides in a West Loop building minimally labeled at 661 W. Walnut Street, entry through the door immediately followed by greeting and confirmation of reservations available Tuesday through Saturday beginning at 5:30pm. <br><br>Working alongside Wife Cara, her duties involving front of house details such as reaching out to guests personally to confirm allergies and dislikes a few days before arrival, it is shortly after being greeted by a subtle Cocktail that each diner is led through garage doors to a space elegant yet cozy, the kitchen fully visible and decor kept to a minimum save for the poster of a Bunny which holds an interesting story. <br><br>Served as twelve courses plus a single slice of Bread, Mignardises and take-home gifts, Sandoval's time at Green Zebra and schwa creating a unique style of cooking that features plenty of Vegetables but occasionally unexpected Herbs or garnishes to push Proteins in unanticipated directions, it was with not quite enough Sourdough for all the creamy Butter that dinner got underway, Sandoval himself on the line alongside Chef de Cuisine Mariya Russell who stepped up after the departure of Tim Flores and partner Genie Kwon in March.<br><br>Taking a very different approach to upscale dining than Smyth, the similar price-points and semi-casual ambiance notwithstanding, it was henceforth that Sandoval's Menu focused on precise plating and the best ingredients available, a symmetrical disc of top-flight Fish Eggs flecked in Chives and Dill Flowers exuding elegance atop silky slices of Amberjack before a 2-in-1 dish of Madai topped in Seaweed and Hokkaido Uni that was fine but in no way as exciting as Shields' version at Smyth with Funnel Cake and Maple.<br><br>Growing bolder with another two-part dish, a freshly shucked Oyster with Ham Broth and Finger Lime tied together by Borage preceding Pork Grissini decorated in contrasting flavors as well as textures, it was exciting to learn that the next dish was making its World Premier in this very moment, arguably the best of the night as it placed Langoustine in a thick broth of Eggs and Calamansi with Citrus finding its foil in a tangle of Greens.<br><br>Carefully plating a small filet of skin-on Sea Bass next amidst Peas, Brown Butter and Fennel, the stack unfortunately falling sideways when set down by staff, it was regrettable that Fennel overwhelmed more subtle flavors as it is prone to do though the follow-up of housemade Pasta was no less heavy-handed in the case of shockingly fragrant Truffles out of Australia.<br><br>Intrigued by the back-to-back use of puffed Grains to add texture, that of Wheat amidst the Capellini not as prominent as Rice on cooked Lettuce next to a beautiful bite of Wagyu, it was here turning the evening over to Pastry Chef Courtney Kenyon that the Sidecar Cocktail was reinterpreted as Sorbet, leaves lining the bowl not particularly necessary but the flavors nonetheless doing their job to refresh the palate.<br><br>Offered Coffee at this point and opting to partake given a late night ahead it was as the Double Espresso on Ice was being prepared that another highlight was served, French Cow's Milk Cheese puffed high as a Soufflé and given a complex finish thanks to the addition of Sesame plus Lemon rich but light as a cloud while the recently-debuted Pavlova seemed misnamed despite tasting great, no real Meringue to speak of and the bottom technically flawed as it proved difficult to cut with just a spoon. <br><br>Finishing up with four more mouthfuls, all pleasant but none in particular adding to the narrative, it was alongside the check that a thank you and three gifts arrived, a nice touch though enough Coffee Beans for one cup is probably lost on the vast majority who aren't running home to burr grinders while the Seeds were better-off spread nearby than in the desert they'd have traveled to in the case of this guest.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/jDyp4VubTghTOxcka7EycQ/348s.jpg", "caption": "07/07/18 Oriole"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/bQSbzlIckY2v5B0w2Cw1dQ/168s.jpg", "caption": "07/07/18 Oriole"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/qLH9B9T26NPmt5iS-Tz1yQ/168s.jpg", "caption": "07/07/18 Oriole: Sourdough Bread, Cultured Butter, Truffle, Caraway"}]}}, {"review": {"des": "I had an 8:30 reservation and it took me much less time than I was expecting to get there. I arrived at 8:00 and spent 30 min chatting with the lovely host.<br><br>After I was seated, I was sitting along the wall and there was air blowing and they offered me a shawl to keep me warm! How thoughtful. I also watched them carefully iron the table cloths while setting for the next guests. Everyone here was extremely friendly and accommodating. My dinner service finally started around 9PM<br><br>Hamachi with caviar and a dill beurre blanc. The flavors were strong yet good. There was a nice saltiness, and something crunch which added a great texture.  This was one of my favorite dishes. <br><br>Uni - was smooth with a nice crunch.  The madai  has just a perfectly gentle flavor with a nice punch from the toppings. <br><br>Oysters and cracker. Oyster was okay. The cracker was so flavorful. The ham was not overpowering, nor was the blue cheese, and there was a delightful floral flavor to it as well. <br><br>Crab.  I found the additions to this too salty and overpowered the crab. <br><br>Lobster in a broth. The broth was very salty, but I liked it. There were a few other items in there that added a nice texture and bite. <br><br>Caraway capellini Pasta with truffle. Again salty, but was good.  I cut it into tiny bites so I could enjoy it.  Also came with a pretzel bread with caraway butter. I don't like caraway, but this was a good combo, tasted like an everything bagel almost. <br><br>Scallops and Foie Gras. The foie Gras had a good flavor and texture. Scallops okay. <br><br>A5 wagyu beef. As I usually feel about A5 just a tad too fatty for my liking. But so buttery and flavorful nonetheless.<br><br>Sorbet with coconut cream and preserved cherries.  I really liked the coconut cream!<br><br>Soufflé with cheese. This was an interesting salty and sweet combo. The soufflé was sweet and the cheese sauce added a strong salty flavor. Interesting and surprising combo that I enjoyed! This would have been a good transition dish from the savory to the sweet.<br><br>Chocolate - I liked most of the flavors here, but there was one non chocolate flavor that I just wasn't a huge fan of in some bites of this dish. <br><br>Few final bites from the kitchen. <br><br>Overall I'm glad I came here and this was a solid meal that I enjoyed! Service was impeccable.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/G7y69Xh00rW8cYMzyopZ8A/348s.jpg", "caption": "Uni - was smooth with a nice crunch.  The madai  has just a perfectly gentle flavor with a nice punch from the toppings."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/0x7Wjzqf710ldbRupHFYoA/168s.jpg", "caption": "pretzel bread with caraway butter. I don't like caraway, but this was a good combo, tasted like an everything bagel almost."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/XJZX0swvojIG3MdrK7auXw/168s.jpg", "caption": "Lobster in a broth. The broth was very salty, but I liked it. There were a few other items in there that added a nice texture and bite."}]}}, {"review": {"des": "First time at Oriole last night. A truly wonderful meal without a major miss. Great food. Great service. Highly recommended!", "pics": null}}, {"review": {"des": "I am not a fine dining type of person but appreciate the ritualistic experience and have tried a few Michelin-starred restaurants. Oriole is my favorite of them all. A couple of dishes really wowed me, but the others were sort of just above average and not creative enough to justify the price tag. <br><br>The wowzers -<br>:: Japanese A5 wagyu :: Oh my gawd it was so fatty that it melted in my mouth, but somehow I still got the meatiness and texture. I think they gave us too much reduction. That piece of meat would have been more powerful with less sauce.<br>:: capellini w/ truffle :: Perfectly al dente, simple, but fabulous.<br>:: foie gras and scallop :: Intense flavors. Loved the blueberries.<br>:: wild hake :: The fish was so delicate and flaky. Paired with squash, pumpkin seeds, and brown butter, this small bite was an explosion in my mouth.<br><br>The rest of the menu all featured incredibly fresh ingredients, packed rich flavors but on the salty side. However, I feel that the combinations or flavors were all too ordinary, e.g., the sea urchin, the king crab, the cumin pork. <br><br>As to the sweet stuff, the lychee was a great palate cleanser as the switch from savory to sweet. The croissant was my favorite - the apple butter was divine. The sweet potato tempura ice cream was a bit over fried for my preference. <br><br>Service was phenomenal - detailed, friendly, and attentive. Each person gets a mini chocolate pecan pie to go from the pastry chef Genie Kwon herself. The whole night felt very seamless. It was a fantastic dining experience overall. I just wished it was perfect.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/QUX-BGYLJBM1xE4gGR5fRA/348s.jpg", "caption": "japanese A5 wagyu"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/MQeB-f01KSQpa5F6_bvc9g/168s.jpg", "caption": "sourdough w/ butter and puffed grains; capellini w/ truffle"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ffHoopo_Tnoy9qqdp4hGnQ/168s.jpg", "caption": "berkshire pork w/ raita, cummin, and parsley"}]}}, {"review": {"des": "Fantastic dining experience!!<br><br>Came here to celebrate my birthday and received a birthday card personally and specifically signed for me (they even addressed me by name) by every single staff member. That is a truly great personal touch!<br><br>They are without a doubt deserving of their Michelin status, not just because the food was impeccable and delicious, but because every single moment of our 3 hour meal was attentive and carefully constructed, from your entrance where you're given an aperitif and then ushered into the dining room through a really cool industrial door, to the way you're walked to the bathroom (standard for these types of restaurants but I still love the Royal treatment), to the little freebies stocked in the bathroom--mint, floss, tampons--and of course the way you are doted on by an incredible team of servers and chefs. The only thing they didn't do was literally feed me and wipe my mouth.<br><br>Unlike many other Michelin restaurants we've been to, we loved how the chefs at Oriole would come out to each table to present certain dishes of theirs. You always feel special when Chef makes an appearance at your table. The two chefs here genuinely want you to enjoy their creations. <br><br>If you ever have a special occasion to celebrate (or you're made of money), DO come to Oriole. You won't be disappointed.", "pics": null}}, {"review": {"des": "I brought my parents and sister to Oriole for their first fine dining experience. From the service to presentation and quality of food, everything was spot on. It was a joy to eat so many delicious dishes and see all of the chef's ideas on a plate. <br><br>My favorite dish was the Wagyu beef. It was perfectly cooked and the truffle heightened the flavor even more. I was also impressed with the oyster dish as that was a very flavorful and fresh oyster. <br><br>I highly recommend Oriole as this was a great experience!", "pics": null}}, {"review": {"des": "All the attention to detail! As soon as you step foot inside (after you find the restaurant) you are greeted with a welcome cocktail in a welcome area. You're then presented to the dining room and shown to your table. I don't want to ruin the surprises so I'll keep this rather short but each dish was carefully crafted. It was a feast for the eyes as well as the tastebuds! It was really neat to see the chefs working in the kitchen as they prepared your next course. We got the non-alcoholic pairing and it went really well with the dish. I had the non-alcoholic pairing at Next Restaurant and I'd have to say that this was better! Don't think, just do and go make a reservation here. You won't be disappointed!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/QaLZbNjetigA0eJgLrAGDw/168s.jpg", "caption": "This drink was so pretty! Art in a glass."}]}}, {"review": {"des": "It was definitely luck that got us a 9pm reservation.  Definitely book way in advance for a better time. They have customized experience for special occasions.  <br><br>Loved the unique entrance.  After finding the covert entrance, you're greeted with a quiet man who gives you a glass of their special aperitiv drink.  Then a dumbwaiter door is opened to reveal a whole new world where you can see an open kitchen and tables filled with conversations.  It's like a speakesy experience.  <br><br>They only have the prix fixe menu.  You get a choice if you want to add the wine pairing or a non-alcholic pairing as well.  I loved that they give you a lot of great & fancy ingredients for the different courses.  Definitely a good value for the 2star Michelin restaurant.  They also have a variety of non-alcholic drinks with beautiful presentation.  That's another unique part of this restaurant.  <br><br>Our experience included Hokkaido uni, Malpeque osyters, Alaskan king crab, and shaved australian winter truffles, just to name a few.  Every course was delicately prepared with wonderful presentations and fresh ingredients.  <br><br>At the end, you get a good bag with small treats, a card with greetings from the staff, and a menu of the night with a custom message on the bottom to take home.", "pics": null}}, {"review": {"des": "Best meal I had in Chicago. <br><br>We were greeted by a friendly and warm host in an old elevator. She gave us a light chai cocktail and after a few minutes, the elevator door opened and we were on our way to a wonderful experience.<br><br>Food and service were top notch. My favorites were the tomato soup (simple and complex at the same time) and the capellini (perfect). The A5 wagyu was really good too. There was nothing I dislike. I love this restaurant.", "pics": null}}, {"review": {"des": "In short, the food was delicious and the service was impeccable. I want to give this a 4.5 stars for the food but because of the exceptional service, I will round it up to 5 stars. The restaurant is tucked away in an alley and when you walk in, it is a lobby separated from the dining room. The host poured us a welcome drink (tea + alcohol) that was delicious!<br><br>Some dishes I recall:<br>Uni (5/5): I am a huge fan of sea urchin, so naturally, I loved this dish. Interesting that they added some rice puff in the middle for some extra crunch.<br><br>Egg Caviar (4/5): This was delicious, but I actually wish it were served inside an egg in the traditional manner. It was kind of hard to eat with it on the plate.<br><br>Pumpkin Hake (5/5): I was told that this is a new dish that they're experimenting with--I absolutely loved it. <br><br>A5 Wagyu (4/5): while this dish is good, it wasn't very interesting or \"wow\". Delicious nonetheless, but it is like a dish you can get anywhere that sells wagyu.<br><br>Alaskan King Crab (3/5): I was not a huge fan of this dish. I wish there were more creativity and depth in the flavor.<br><br>Lychee Sorbet and Sweet Potato Ice Cream (5/5): Love how these desserts are very asian-inspired. Both very delicious.<br><br>AND, at the end of the meal, the pastry chef brings us 2 pies to take home. The chocolate caramel pie was absolutely delicious. The chocolate ganache and the pie crust were MMHMM!<br><br>To top it all off, the service was very attentive, everything was timed perfectly. The kitchen staff even wrote and signed an anniversary card for us! So thoughtful of them.<br><br>Definitely check this place out for a special occasion meal!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/QoRiL852y15TRdyMBAxMqg/348s.jpg", "caption": "Sweet potato ice cream tempura"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/wo0eiD7qLT0oxEeCaJhMng/168s.jpg", "caption": "Lychee sorbet"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/q244soy7QNTo9mJm4cdeOg/168s.jpg", "caption": "Hudson Valley Foie Gras"}]}}, {"review": {"des": "We were able to get a reservation with \"only\" a few weeks in advanced because of it was a late 9pm slot. But since we're visiting from West Coast anyways, that's our normal dinner time :)<br>Entrance was definitely unique, where they used the freight elevator of the building as the reception room.  Opening and closing the freight elevator acts as the door into the main dining room.  It's a cool entrance.<br>There's no food menu, you can't even follow it along while eating, they want you to concentrate on the experience - but they do provide it at the end of the meal.  It's a 13 course menu and each plate is curated intricately.  Flavors were on point, there was no bad dish.  You can also order a drink pairing with the meal (even non alcoholic pairing, which is cool).  Service is exceptional from the beginning to end!<br>Took us about 2-2.5 hours to finish dinner. If there's anything to complain about, it would be the wait in between courses, I wish it would be quicker.  This is a minor point and was more noticeable since we started dinner so late.<br>Overall, I enjoyed my meal immensely and would definitely recommend it for a special dinner or a splurge.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/-46M9Rl74dORn9YPxBlamg/348s.jpg", "caption": "Malpeque Oyster"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Ra_gBCDgAmOWrnQgAzf2Ug/168s.jpg", "caption": "Hudson Valley Foie Gras"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/9kFC0e_aZ1SUFAV-RMP-Pg/168s.jpg", "caption": "Razor clam"}]}}, {"review": {"des": "Having been to over two dozen Michelin Star restaurants (predominately on the West Coast and Europe), I can guarantee that Oriole will provide you with one of the best, if not the best, meals of your life. There may be individual dishes that can be considered better elsewhere, but even Chicago's 3 star places are no match for Oriole's meal experience as a whole.<br><br>Oriole provides New American Asian fusion that distinctively amalgamates each intricacy of their complex menu that on its surface appears deceptively simple, aesthetically almost primitive and raw. <br><br>But before we get too deep into the masterfully executed meal by Executive Chef Noah Sandoval, Pastry Chef Genie Kwon and their staff, we must acknowledge the atmosphere and decor that integrate beautifully and coherently into the whole, helping paint a complete picture of the Oriole experience.<br><br>UPDATE: Chef Kwon and Chef Flores are leaving Oriole on a positive note at the end of March 2018. Their positions will be covered internally by Sous-Chef Kenyon and Russell will move up to chef de cuisine. <br><br>Having began it's life as a factory, subsequently being used for illegal raves, and only recently becoming the restaurant we know today, Oriole's venue is full of rich history that you can catch a glimpse of even now. Much like their menu, the decor blends old with modern fusion. The entrance is an antiquated industrial elevator door that splits into two halves and disappears seamlessly into the floor and ceiling. The raw brick walls and exposed ceilings with pipes blend with the modern wooden shelves and oriental light fixtures. It has an open kitchen floor plan where you can observe the team operating in unison. <br><br>The service was excellent throughout and they never skipped a beat. They also followed all the proper etiquette for fine dining while still being friendly and welcoming without being overbearing. Simply outstanding.<br><br>After receiving our welcome drink and being seated, we began our meal with high quality caviar. Can't go wrong with that! Second was uni, but it was unlike any uni I've had as it had crunchy genmai hidden inside the delicious seaweed wrap. The Spanish mackerel was refreshing and the tiny sea grapes were a nice touch. The Beausoleil oyster was also light and flavorful. I wish there was a little less liquid to fully appreciate the already delicious oyster in its own right. The Jamon Mangalica was nothing short of perfect - from the crunchiness, to the saltiness, to the richness of the dry cured ham itself. Another highlight was the Alaskan King Crab that was prepared to perfection with poached butter; the dipping sauce elevated it to the next level. The loup de mer was lovely and the black truffle was a nice touch. The sourdough that accompanied the soup was a bit on the salty side, even for me. The foie gras was dense and packed full of flavor which was nicely balanced by the dried berry and oxalis. The Berkshire Pork was falling beautifully off the bone. I was not the biggest fan of the outside but the inside was simply delicious, especially when paired with the sauce underneath. The Japanese Wagyu A5 was simply outstanding and the star of the meal, as it should be. It was dense, rich, fatty and delightfully textured. The Lemon sorbet was a welcomed light and fluffy flavor to follow, nicely mated with a touch of oil and honey. The croissant, although at first glance modest and unremarkable, had crunchy yet fluffy flavorful texture with divine fillings inside that made it memorable. The Mont Blanc with passion fruit really did make you feel like you are on top of a mountain as your meal came to an end with mignardises. Lastly, Chef Kwon herself comes out and presents you with a little parting gift to enjoy at home in the form of a beautifully wrapped Chocolate Caramel Pecan Pie, topped with gold flakes.<br><br>In additional to the more typical and conventional wine pairings, Oriole offers sake and tea pairings, as well. We had a single tea and a glass of wine with our meal so I cannot speak to the pairings themselves but the individual drinks were simply delicious. At the end of the meal you can also request coffee and/or tea. We did and the tea was phenomenal (they work with a rare teas supplier who has stock from around the world for both their teas and certain ingredients).<br><br>Overall, beyond the lovely atmosphere and stellar service, Oriole provides a coherent meal that is perfectly balanced not just in its order and flavor combinations, but also it's blending of New American and Asian fusion. No detail is left unnoticed or not considered important enough to warrant modifications and a personalized touch, down to the plating itself. Even when using familiar ingredients such as caviar, black truffle, uni, etc., Oriole's Chefs found unique ways to transform them as to make them new again. While individual dishes elsewhere may stand out more, no other experience, taken as a whole, compares to what Oriole offers its guests.", "pics": null}}, {"review": {"des": "Oriole and their EXCEPTIONAL staff blew us away with their EXCELLENT service and EXTRAORDINARY food. I made a reservation on their website in advance and the only times that were available was at 9 pm. Immediately after booking the reservation, I received a text message from the host welcoming us to Oriole! They were even able to accommodate us pescatarians! A late dinner was PERFECT for our anniversary and getaway to Chicago.<br><br>For a 2 star Michelin Star restaurant, I can only imagine how a 3 star experience would be like! I don't want to spoil the adventure too much, but I can say that every single dish and drink pairing was truly PHENOMENAL! The chefs and servers will make every attempt to keep you happy for the dinner service. You will definitely notice all of the little details of the staff going ABOVE AND BEYOND for you! The 2.5 - 3 hours of dinner will go by so quick and you won't even realize it. It seems so strange to eat for so long, but this was a FANTASTIC experience.<br><br>There was one significant highlight worth mentioning that happened to us towards the end of dinner. The host offered us a selection of hot tea with freeze dried honey. After dropping the crystalized honey into our hot tea, it just instantly dissolved. Of course we had to try it alone and it's so similar to pop rocks. I have no idea where you would buy this, because I would like a whole bag of this stuff. Go to Oriole for a very special occasion and make sure to book it ahead of time!!", "pics": null}}, {"review": {"des": "Loved every single minute of my dining experience here at Oriole. It started with a warm welcome at the entrance with a refreshing drink. The dining room was elegant yet cozy. The food was impeccable. Tasting course came with hidden surprises. Bf did the wine pairing, which was fun with not only the typical sparking, red, white wine, but also sake and cocktails.Unfortunately I wasn't feeling well that day, or I'd definitely want to participate as well. Service was phenomenal. We came to celebrate our birthdays and received a card signed for us by all of their staffs, which was so thoughtful and sweet. Thanks! The whole night was perfect. Too bad it is not in LA so I can visit more often but I will stop by if I'm ever in the Chicago area again.", "pics": null}}, {"review": {"des": "I ate at Oriole in June 2016, so a few months after they had opened. My friend and I proclaimed to everyone we met, for the following couple of months, that they would receive a Michelin star. THEY RECEIVED 2 STARS IN THAT FIRST YEAR. We were mostly right.<br><br>Before I jumped on this Yelp bandwagon, I was spending dumb amounts of money dining out, and didn't take the best photos. I also cannot remember the full tasting menu, with pairing, that I had. A few things that still stand out 2 years later:<br><br>- I loved that someone met us outside as we arrived.<br>- The pairings were so perfect, my brain was going to explode.<br>- I've been a pescetarian for 10 years, but once or twice a year I have a tiny taste of mammal meat. I've tried wagyu beef at Next and another place, and it didn't do anything for me. The piece I had at Oriole was a revelation and nearly caused me to consider introducing meat into my diet.<br><br>This meal was in total one of the most expensive I've ever had, but it also belongs in my top 3 meals ever.<br><br>I hope to be back again when I've paid off the last meal, so that I can take better pictures and experience whatever new awesome menu Oriole has going these days.", "pics": null}}, {"review": {"des": "Oh boy this was one of the most memorable, delicious, and well curated dining experiences I've had all year. Without the wine pairing, it was still hundreds of dollars per person, and if you're shelling out that much dough, then you should expect a phenomenal experience. This was that. The service was a fantastic, the food was just top top notch. Every course in this 13 - 14 course meal was a home run after a home run. They also let you split 1 wine pairing between 2 people, which actually is a perfect amount of spirits to pair with each course. <br><br>If you're looking to celebrate something special or impress someone special, you can't go wrong here. The experience completely justifies the price.", "pics": null}}, {"review": {"des": "One of the best restaurant experiences we have had in Chicago. Well deserved of Michelin stars! The personal touches of a signed card by chef and the entire staff for our anniversary add a personal touch! The maitre d helping Park our car really extends the service an extra mile.<br><br>The food is exquisite. Chef Sandoval has perfect execution and technique for his dishes. The tea pairing was also on point to match all the dishes with compliments to flavor, but not over powering. The menu and pairings are effortlessly executed by the staff. The service is outstanding!<br><br>Thank you Oriole for a wonderful experience", "pics": null}}, {"review": {"des": "2 Michelin stars.<br><br>One of the best tasting experiences to date, with a perfectly executed menu and top notch service. <br><br>The location is a bit nondescript; the entrance surprise allows for a fun start to the meal.  The space is minimalist; loved the exposed brick. The team made me feel very special on my birthday! <br><br>The standout dishes for me were the:<br>-Kampachi.<br>-Capellini pasta.<br>-Kobe beef. <br><br>Having dined at Alinea the night before, it was really hard not to compare it to Oriole so as to refrain from any grand comparisons because the two are so different, I will say that while Alinea was a showstopping performance, the food at Oriole was, in my opinion always, a smidgen better.", "pics": null}}, {"review": {"des": "I'm afraid some of the dishes (like the Madai sushi and king crab) are overseasoned so that the true flavor of ingredients are obscured.. but then I liked the Madai, capellini, loved the wagu and ALL the desserts! Plus their entrance gate is really cool and service very comfortable :-)", "pics": null}}, {"review": {"des": "Chef Noah Sandoval is an artist! I did the Non-Alcoholic pairing while my wife got hammered on Gimlets. All the drinks were fantastic and thoughtful. The food..OMG the food. The highlights for me were definitely the A5 wagyu. I will never eat a piece of steak and look at it the same. The foie with squab was redic, the  croissant, the Uni,  I mean I can go on and on. Not one bad dish of 14  all the while chef is involved in the prep and making sure everything is perfect. Even saucing a lot of our dishes tableside. Check out the pics and splurge for a very special dinner you will never forget. Chef even signed our menus!! See all<br>My pics", "pics": null}}, {"review": {"des": "If you want to find the perfect place to celebration a special occasion, definitely come to Oriole!  My fiancee and I celebrated our 10 year anniversary here and the experience has amazing from the beginning to the end.<br><br>I had been looking at Oriole for at least 2 months before our dining date but couldn't make the reservation because our traveling schedule was too busy.  It wasn't until the month before that I finally concluded that yes we'll be in town.  By then there were no opentable reservation available for anything close to the date we wanted.  I then called Chase concierge and asked them to make a reservation for us, sadly they could not secure anything but had placed us on the Oriole waitlist in case anything frees up during the weekend we are interested.  About a week before our dining date, Oriole called me and I secured a Saturday evening spot.  I've heard of other friends getting off the waitlist.  If you are somewhat flexible with your date and dinner time, I'm sure you can get a table on a short notice.<br><br>The dining experience was simply amazing.  <br>The welcome: (the night we dined was pouring cats and dogs in Chicago.  we were welcomed into the restaurant with a warm cocktail drink to fend off the cold).  We got a card to congratulate the anniversary signed by all the staff members, that was so special!<br>Service: very attentive and professional every step of the way<br>Food: best food I've ever had.  I don't need to describe every single dish but be assured that everything was perfect<br>Drinks: I don't drink alcohol but I enjoyed every non-alcoholic cocktail that the bar whipped up<br>Environment: friendly and good for conversation.  All the other diners were friendly and we were spaced out enough that no one butts into other conversations.<br><br>We came just a couple of days before the 2017 Michelin ratings were to be released.  Very happy to see that Oriole is confirmed 2 stars again, although I enjoyed this experience much much more than my Alinea experience and I wholeheartedly support a 3 star status for Oriole!", "pics": null}}, {"review": {"des": "I haven't been to a prixe fixe in awhile so I was looking forward to this for a friends bday.  <br><br>The location-you have to be looking for it to find it...hidden on what seems like an alley.<br><br>The entrance-cool.  It's an old elevator shaft that opens to the restaurant.  When we arrived, no one was at the front for about 3-5mins.  We were just kind of looking around.  When the hostess showed up, we were welcomed with a cocktail.<br><br>The restaurant-the feel is just like a clean contemporary.  The food was all very vanilla...very basic...and very salty.  Like painfully over salted.  It was an average meal.  The desserts were not good.  I wanted something more decadent...it just didn't do it for me.  We also did the wine pairings, which I was overall disappointed and wouldn't recommend.  I just felt for the value, it was not worth it.  If I'm going to spend that kind of cash (almost $900), I expected more.  It missed the mark painfully for me.<br><br>The staff was all nice and there was nothing totally awful...it just didn't do anything for me.  Kind of like Brad Pitt...", "pics": null}}, {"review": {"des": "We had New Year's eve dinner. If you are in Chicago, it's worth to try.<br>From the start to the end, the perfect dinner I ever had.<br>Service was just right. <br>Can't wait to have second visit.", "pics": null}}, {"review": {"des": "Mind.Blown. This review is for 10/17/17. First off, kudos to hubby for booking rezzies a couple months in advance for my birthday dinner. We've been to several Michelin star restaurants and after a while, the presentation and flavor combinations tend to blur and not really stand out. Well, Oriole completely blew me away. This is the real deal, the total package from start to finish. The adventure begins before you even step inside because you have to find the restaurant down a desolate, alley-like side street. Upon entry, we were greeted and offered milk punch. I've never had this before, but, it was a perfect way to kick off the evening. The process it takes to make milk punch is quite extensive involving milk, alcohol, cheese cloth, time etc.. so I completely appreciated this gesture.<br><br>The wait staff was over the top accommodating. They freshen up the bathroom each time and fold the toilet paper - OK, I probably didn't need to tell you about this, but, this is an example of the attention to detail and one small example of how they go out of there way to make you feel welcome. The birthday card signed by the entire staff was also unexpected and sweet.<br> <br>Let's talk about the food! If you're dining here, definitely get the pairing like we did. We got the standard pairing and the Sommelier did an excellent and thoughtful job. I absolutely loved every single one of the 15 courses, except for 1 (corn mousse with miso at the very end was blah).  <br>-The evening began with Golden Osetra Caviar, buttery, bright, lemony - a perfect and delectable start to the evening. <br>-The Spanish mackerel w/watermelon, seaweed and sesame was delicious. Mackerel can be overpowering but all the flavors here worked so well together. <br>-The Ora King Salmon handroll with smoked roe and genmai was made with 10 YEAR BARREL AGED SOY SAUCE. What? Didn't know this was a thing, but, I am so glad I got the chance to taste this. Yum! <br>-A quick note about the cocktail made with Madeira, Dolin Rouge etc -- just want the recipe to make this over and over again at home! <br>-The Beausoleil Oyster was next with a crispy, cheesy stick of deliciousness on the side. <br>-The Alaskan King Crab with aguachile, coriander and wild oregano was spicy and delicious. This was a tiny piece of crab and I wished there was more of it! <br>-The Sourdough with cultured butter and puffed grains (Part 1) was a bit on the salty side with puffed rice adding lots of crunch. The pairing here was the Mersault Bachey-Legros & Fils \"Les Grands Charrons\" from Burgundy, France 2014 -- I've never tasted anything like this before and will be looking to purchase soon! <br>-Part 2 was the Capellini burgundy truffle, rye berry and yeast. This was probably one of my faves. <br>-Since I don't eat pork, I got the Lamb belly with raita, cumin and parsley. At this point, I had to pause because I was in food nirvana. Hubby got the Berkshire Pork rib and he said the pork was good, but, my lamb was so much better. <br>-The Japanese A5 Wagyu with alba truffles from Italy was buttery perfection. <br><br>Some of the other fun, unique notes about this experience: sake is served as part of the pairing and you get to choose from a variety of sake glasses; before dessert is served, you're given a eucalyptus towel to freshen up; and last but not least, you are presented with a cute, little box of hazelnut, pear pie to enjoy at home. :)", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/lYSOydxwpTg7ooD0OSrOJg/348s.jpg", "caption": "So thoughtful! Everyone signed my birthday card. Thank you!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/UGmcOsPmIyqjsrq6e_cKQQ/168s.jpg", "caption": "Birthday card from staff"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ao8u_SpSCox3gxlolNhyVA/168s.jpg", "caption": "So cute"}]}}, {"review": {"des": "It pains me to write this non-five star review. I was really looking forward to Oriole, and it took over a month to book. After reading all the rave reviews, I really expected much more. <br><br>So, I made reservations about a month ahead for a friend's birthday. Two days before, the restaurant calls to confirm, and warns against tardiness. I get it. No shows and tardiness can be devastating for a business. However, on the day of the dinner, about 30 minutes before a girl named Samantha calls again to ask if I'm on the way. Very arrogantly, she emphasizes that they may not accommodate us if we are over 10 minutes late. Really?! <br><br>We got there 4 minutes late to be exact because we missed the our turn into the street. I can't believe that someone was actually standing outside waiting at the door. Maybe they are there to greet the guests, but I felt like she was the hall monitor when I was late for class. That's really not how I want to feel spending over $600 on one meal.<br><br>Now, the food. Everything was a tad on the saltier side. Presentation was nice, but simple. The portions were very small. I know high end places tend to have small portions, but I've never left Grace, Alinea, Next, Intro, Jean George, etc., hungry. This place actually counted the one piece of buttered bread as a course. Overall, the food was okay, nothing spectacular. Service during the meal was friendly.<br><br>I had a bowl of cereal when I got home. It really annoys me when I leave a restaurant hungry, and especially when it's pricey. Please don't hate me for my honesty, I really did want to like this place.", "pics": null}}, {"review": {"des": "Oriole definitely deserves its 2 Michelin stars. Friend and I went recently and got the reserve wine pairing, which I recommend. Enter through a warehouse-like lobby where you feel like you're about to go underground in a giant freight elevator. A hostess serves you an incredibly delicious aperitif and mid-sip you are welcomed through another set of doors that leads you to the dining room. Without going too much into detail, will say that the ambiance has truly captured what I take to understand as haute Chicago cuisine. It was upscale yet industrial, elegant yet raw, spacious yet quaint. It would be hard to replace something like this in Manhattan.<br><br>We started the meal with golden osetra caviar with cured hamachi, nasturtium vinegar, and radish. A good dish that is similar to those served at other Michelin star tastings. Kampachi with yuzu kosho and genmai is likewise great. Beausoleil oyster with mangalica consommé, smoked finger lime, and borage is beautiful both visually and on the tongue. Jamón mangalica with black walnut, egg yolk, and quince is one of the last favorite courses of the night. A simple breadstick wrapped with jamon that did not taste like anything more than that.<br><br>Alaskan king crab with aguachile, chicharones, and wild oregano was a big winner. The use of aquachile really elevated the dish to a point all fusion should aim for: something beyond yet eerily familiar. Ora king salmon with smoked roe, spring onion, and fresh herbs was delightful. Hudson Valley foie gras dish was a bit confused for me. An unusual pairing that is probably less done for a good reason. Considered separately and without the dried wild blueberry and oxalis sauce, the ingredients were top-notch. But the sum is lesser than the parts. Sourdough bread with cultured butter was very average.<br><br>Capellini with perigord truffle, rye berry and yeast was excellent--how can anything covered in truffle be bad? Bone broth with vietnamese coriander, cinnamon and lemongrass was refreshing and satisfying. The most exotic tasting dish of the bunch that was very much appreciated and really contrasts and prepares you for the the next dish. Japanese A5 wagyu with charred little gem, furikake, and sesame leaf was high-quality, one of the best I've had.<br><br>Now comes the slow crescendo.Cucumber sorbet with basil, champagne, and tonic beans was not particularly creative but delicious! Croissant with ashbrook, apple butter, and rosemary was actually subpar. Corn mousse with miso, chocolate, and jalapeno shaped like baby corn was excellent. Mignardises strawberry, milk and cookies and ferret was okay and not memorable. But the delicious chocolate peanut butter tarts diners are gifted upon leaving were mindblowingly good! I highyly, highly recommend Oriole.<br><br>For those who were interested, the grand reserve pairing included: Krug Champagne grand cuvée, Nate Shuzoten Junmai Ginjo Kuroushi, Paul Anheauser Riesling Spätlese Nahe (sweet), Trimbach Riesling Clos Ste Hune Alsace, Gitton Pere & Fils Pouilly-Fumé \"Les Folatieres\", Louis Jadot Latricieres-Chambertin Grand Cru, Francois Carillon Chassagne-Montrachet CLos St. Jean Premier Crus, Ceretto Barolo \"Brunate\" (the only one I thought didn't pair well with the food), Chateau de Suronde Quarts de CHaume, and Chateau Suduiraut Sauternes. I absolutely loved the pairings and the inclusion of so many diverse sweet wines.", "pics": null}}, {"review": {"des": "One of the BEST multicourse upscale meals I've had. Among the 16, I really enjoyed: <br><br>- The Cardinal Prawn (#2), similar to a Vietnamese prawn spring roll. <br>- The Jamon Mangalica (#7) - the almond stick wrapped in jamon was an explosion of deliciousness. WOW. It was sweet and savory, and it tasted better with each bite. I could go for 10 more. <br>- Santa Barbara Sea Urchin (#8)   - a small cup of decadent bites of scallops with uni infused soup<br>- Japanese A5 Wagyu (#9) - mind-blowing fantastic! The piece of wagyu was tiny, but I managed to cut it into 3 parts to savor every bite. It was like butter melting in my mouth.   <br><br>Upon entering, we were welcomed with a glass of warm shochu cider. Loved the extra touch where the server would walk me to the wash room every time. I really milked that one as I made 3 trips throughout the evening. Who knew having a small bladder could be a plus. The executive chef Noah Sandoval came by twice adding ingredients to two of the dishes. For the cherry on top to wrap up the evening, the pastry chef Genie Kwon swung by every table and gave each guest a nicely wrapped box of lemon meringue pie. The meal was $190/person before tax and tip. I'm a sucker for elder flower, so opted for the rye based cocktail with elder flower and lime syrup. <br><br>Fun facts: I heard the executive chef/owner is from Baltimore so named the restaurant after the Baltimore Orioles. The restaurant has only been open for less than a year and it has already earned 2-Michilen stars. Its remarkable accomplishment is well-deserved. I can attest their claim \"the diner is the true focus of the meal\" was delivered spot on. <br><br>Warning: it gets a little chilly inside as with most upscale dining restaurants, so bring a blazer or shawl.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/UKW-3YBxGTeK5MC7kZEFLw/348s.jpg", "caption": "lemon meringue pie"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/8ywHyfJKUNPZuDvvx7SUxw/168s.jpg", "caption": "dessert gift (lemon meringue pie) and menu"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/8P0A5clZmwtyG-n6vuI8-A/168s.jpg", "caption": "chocolates and macaroon"}]}}, {"review": {"des": "My husband and I both really loved Oriole. We came here for our anniversary dinner with high expectations and they were definitely met.<br><br>The most memorable part of the meal was the wagyu beef. Perfection.<br><br>My husband did the wine pairing and really enjoyed it. I chose to have a few cocktails and they were able to create delicious drinks off the menu.<br><br>The service was impeccable. I also loved watching the kitchen work their magic while we ate our dinner. Overall, it was a fantastic dining experience!", "pics": null}}, {"review": {"des": "So, wow.  Having dinner for the first time at Oriole I had a flashback to my first dinner at Trio before the world knew who Grant Achatz was and the genius and wonder of the food was awesome to behold and experience.  Yeah, Oriole and Chef Noah Sandoval are like that.  The entire meal was amazing, the service was wonderful, and the room was perfect.  And a few of those bites of food will remain with me for years.  Absolutely fabulous.<br><br>The 16-course tasting menu provided a well-paced evening.  The service moved along at a comfortable pace with the expert wait staff providing just the right amount of conversation and interaction to perfectly compliment the food.  This type of service, which perfectly marries the friendly and conversational with enough formality to make sure everything is perfect, was well suited to the creativity and excitement of the menu.<br><br>Rather than going down the entire menu let me provide a few highlights:<br><br>- First course of Golden Osetra Caviar with coconut dashi, lychee, and sea grape.  So many textures, so much salty sweet goodness and some unlikely but very successful marriages.  The perfect way to prepare for what is to come.<br>- Bone Broth was so rich and amazingly layered with so many flavors that it took me by surprise.  Cinnamon, lemongrass, coriander.  I could have had a gallon<br>- Ora King Salmon with smoked roe, spring onion, and fresh herbs was perhaps the most deftly cooked piece of fish I've ever experienced.  The outside crust was perfect and the middle barely cooked and amazingly moist and tender.  How that combination was so perfectly achieved may deserve a nobel prize if one was offered.<br>- However the finest dish of the night, and one I will remember forever, was the Capellini with Australian winter truffle, rye berry and yeast.  A little ball of creamy al dente capellini goodness, the sauce is redolent with truffle but amazingly complex with layers and complimentary flavors.  This is to pasta with truffles what the starship Enterprise is to the space shuttle.  I absolutely loved this dish.<br><br>Of course the mignardises involved cookies and fernet - what meal is complete without fernet?  So that was awesome.  Plus we were provided excellent individual chocolate/peanut butter pies to take home (mine was delicious for breakfast).<br><br>Have I mentioned how spot on the service was?  Did I mention that the wine pairing was wonderful?  The room?  All of these things were absolutely perfect but none compared to the food.  I cannot wait to return to see what other brilliance emerges from the mind of Chef Sandoval.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/_UpZJwtSIebN6iG8l-dT5g/348s.jpg", "caption": "Gianduja gelato with mascarpone, preserved cherries and sakura tea"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/giXigGeyT8U8hjT5BD9aaA/168s.jpg", "caption": "Japanese A5 Wagyu"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/COQODqhF8OjNkw3ndABBaA/168s.jpg", "caption": "Kampachi"}]}}, {"review": {"des": "Fantastic tasting menu and wine pairing.  Impeccable and knowledgeable servers, outstanding kitchen environment, and world class in every way.<br><br>The Délice De Bourgogne may well be the best flavor combination I have ever experienced, a perfect balance of sweet and savory with its strong, direct and complex cheese sauce merged with an ethereal interior and sugary crust for an unforgettable dish.<br><br>The jamon charcuterie, uni, cooked fois gras, and truffle cappelini were other standouts and extraordinarily visually appealing.<br><br>To nitpick still excellent dishes, but as honest feedback for your consideration, I will say the salmon was a little acidic, and the wagyu could use some more smoke or sear to contrast the velvety but mild interior.  The pavlova could use some more balance as the blackberries were sharp and the dish was somewhat difficult to separate with a spoon.", "pics": null}}, {"review": {"des": "I came to Oriole to celebrate my anniversary and had an amazing experience. The service provided by Aaron, Alexander and John was impeccable. The decor was contemporary and sleek. The food was so damn good and so worth the money. I highly recommend that you consider Oriole the next time you looking for a restaurant to celebrate something special. Definitely ranks as one of my top 3 dining experience of 2016.<br><br>Some of the highlights from the meal include:<br>*Golden Osetra Caviar<br>*Jamon Iberico De Bellota<br>*Cardinal Prawn<br>*Capellini served with the Sourdough bread<br>*Japanese A5 Wagyu<br>*Croissant", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/MaItMC9c4FlXiMLsCRpF-w/348s.jpg", "caption": "Mini Pie you get to take home"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/06uKC9_2CosMG6U9mKtlnQ/168s.jpg", "caption": "Mignardises"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/8A5vJlCiPDkIw_C_ud9zdw/168s.jpg", "caption": "Pistachio"}]}}, {"review": {"des": "Honestly we were a bit disappointed. This has been on my list for a while based on the rave reviews but - especially for the price - the food was a let down. Don't get me wrong, it was a good meal but it wasn't amazing and I found many of the dishes to be forgettable. The atmosphere is warm and the service was good but don't plan on going back.", "pics": null}}, {"review": {"des": "This was an amazing meal and service from beginning to end. I didn't think that the way someone opens a door could be impressive but Oriole even found a way to do that. The food was a work of art, amazing flavors, extremely attentive staff. I loved that it was a set course menu but you did not know what dish was coming, so it was a surprise each time. You can't beat an A5 Wagyu so that was probably my favorite dish and the pistachio 3 ways dessert was next on my list. We chose to do the tea pairing over the standard alcoholic and I had the most beautiful mocktail I've ever seen. Oriole is well worth a visit at least once in your life and I hope to come back again!", "pics": null}}, {"review": {"des": "My all time favorite restaurant in the world. I've eaten at some of the finest restaurants in NYC, New Jersey and middle east. Oriole destroys every Michelin Star restaurant I've ever been to. It was 13 courses. They were able to change some items on the menu for me because of my dietary restriction. I don't drink alcohol but they have an amazing non alcoholic drink paring. So 13 courses and 9 non alcoholic drink pairing. Absolutely the best meal of my life. Noah Sandoval is a magician. He was very happy to hear when I told him he's a magician haha. I'm already looking forward to his second restaurant he is planning to open in summer. I'm from Jersey but I'd fly again just to eat there. The entire team at Oriole is incredible. I'll never forget this experience.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/de-yMXTSvOTpe_bIMOtzcQ/348s.jpg", "caption": "The inside. 5:30 reservation on a weekday. After an hour other tables got filled."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/EWk0KyTWIZ3sD1SwfEdTOA/168s.jpg", "caption": "They welcome you with cocktail. I don't drink but they have tea as a substitute. It was great. The tea is on the right."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/aPFeBaA284Qmiq1ncfSaRQ/168s.jpg", "caption": "The outside area. This used to be a candle factory before."}]}}, {"review": {"des": "Oriole is the best restaurant I have ever eaten at. Period. <br><br>I've eaten at fine dining around the world including 7 Michelin restaurants and a handful of restaurants at the same level but in cities without Michelin guides. Oriole tops them all. They absolutely nail the combinations of taste, texture, and temperature. The flavors are just so well done. The restaurant isn't as showy as Alinea or Gaggan (in Bangkok), but every dish here just blows you away. <br><br>On top of that the service is top notch, but not pretentious. <br><br>I moved out of Chicago, but I'll be back to Oriole at some point. Absolutely worth it.", "pics": null}}, {"review": {"des": "Probably the best meal I have ever had. Period. Only thing that compared was 42 grams (RIP) but I would say this was a better overall experience than that.<br><br>Every bite was thoughtful. Absolutely adored the welcoming cocktail all the way until the take home pie that we got to eat the next day to remember and savor our experience.<br><br>My favorite course was probably the crab, but also absolutely adored the pasta and the wagyu beef. Truly, there was not a single misstep the entire meal, which I have never in my life said before of any restaurant. <br><br>For calibration, this meal far surpassed: Next, Schwa, Goosefoot, Everest, Tobolobampo.", "pics": null}}, {"review": {"des": "Mind. Blown.<br><br>My husband ate here without me (so rude!) and then bragged about it for months and months. Meanwhile, we had a series of disappointing meals at other Michelin star restaurants in NYC. We started to wonder if they were really worth the money anymore. Then, we finally find ourselves together in Chicago and he insisted we go to Oriole. He built it up so high that I thought there was no way I could enjoy it so much. WRONG. WRONG. WRONG.<br><br>This was one of the top five meals of my life. Our main servers were Michelle and Mariya. They were so fun and friendly and totally added to our experience. I loved them both!<br><br>The food was incredible. Every component of every dish was done to perfection - down to the sushi rice, or the bone broth, or any other component that you wouldn't normally think of as the star. Oh God, the bone broth! I just reminded myself. I make bone broth at home all the time from scratch. It sure doesn't taste like that. The capellini was another stunner. The husband isn't normally a fan of truffle, but even he couldn't resist the siren's call of that dish.<br><br>The atmosphere is also great. It's cozy and elegant, yet not so fancy that it feels stuffy. It's small and fairly intimate, allowing for top notch service.  They even personalized the menu after I let them know that I have an aversion to peanut butter (I know, I know, it's weird). Not an allergy, but I just hate it and I really can't get past it no matter how great the chef is. It's my one thing. At the end of the night, they sent us home with little pies. Something they didn't even have to do in the first place. There was one peanut butter chocolate one and one plain chocolate one. It was so nice of them.", "pics": null}}, {"review": {"des": "I don't even know where to begin because everything at Oriole was AMAZING. The food, the service, the ambiance - all of it was impeccable. <br><br>Let's start with the food. Oriole does a tasting menu for all of its diners with dishes that regularly rotate. We had about 14 courses. My favorites were the caviar, the beef tartare, the scallop, and the wagyu. The caviar was paired with the most amazing herbs that set off the caviar perfectly. The beef tartare was seasoned to perfection and was served with this amazing bone broth with Vietnamese flavors. The scallop was served with an amazing uni foam / broth, cauliflower, and apple. Now I know this particular pairing sounds weird, but trust me it WORKED. Finally, the wagyu was just solid, perfectly cooked, melt in your mouth beef. It was served with an interesting charred lettuce with sesame. The only dish I didn't like was the spring roll. The herbs were slightly overpowering in the dish. <br><br>The service was also amazing. Everyone who worked there went above and beyond to make sure the night went well. Dishes were brought out promptly and explained in detail. Servers were on top of drinks / wine pairings. And most importantly, the staff attempted to personalize everyone's experience. Our server even went so far as to volunteer to keep an eye out for our Uber driver for us when we were done with dinner so that we wouldn't have to wait outside. <br><br>I also loved the ambiance. The open kitchen is amazing. It's fun to be able to see the chefs at work and to watch the magic happen. I also loved that the restaurant was small - I think it seats about 30. It was nice to eat in a restaurant that wasn't overly crowded, where you could actually have a conversation without yelling at each other. And lastly, now this is weird, but I loved their bathroom. They had these amazing smelling candles and the best hand soap and lotion. They also stocked the bathroom with eucalyptus face wipes, hair spray, breath mints, and other fancy items. <br><br>Oriole definitely lives up to its reputation and its two Michelin stars are well deserved. I will for sure be back! (After my wallet recovers that is.)", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/EOVIbL2cLznGoYI8esJdbQ/168s.jpg", "caption": "Tartare broth."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/2cU9_9Tqt7xzAnZEVIFvEg/168s.jpg", "caption": "Take home pie!"}]}}, {"review": {"des": "Oriole is, hands down, the most high-end, most satisfying, most decadent prix fixe (or tasting menu) opportunity in the city of Chicago. I won't say that we have been to all of them...but we have been to (most) all of them and we have done them throughout the world. Oriole is the one we keep coming back to visit over and over. <br><br>This is the one that has NEVER disappointed. Not a single course, or a single pairing has been less than perfect. This is the one for which the only \"complaint\" that we can find to cite is the rare occurrence of a staffer filling a water glass or presenting a \"reach\" from the \"wrong side\". Hey, that is how big an ass you have to be to find a complaint with anything at Oriole! (My apologies to anybody who has found something about which to complain...I'm not really trying to insult you...everybody has a right to his/her opinion) The last time we visited (as part of our annual food and fun holiday Chicago staycation), our head table staffer even noticed (and remembered from the time before...we asked) that one of us was left handed and served and set, wherever it was appropriate, accordingly for the lefty. Now, THAT is impressive attention to detail!<br><br>There simply are not words or the need to describe in detail the perfection of the experience, every time. Oriole is what a high-end tasting experience should be. We had direct comparison opportunities during this aforementioned trip as I had schedule two other, high-end tasting menu opportunities for dinners on other nights. While the others were wonderful, and are of quite high reputation and longevity, they still fell flat compared to Oriole. Here is a hint. If you are going to do what I did and schedule multiple dinner tastings for a Chicago visit, save Oriole for last. If you don't, you will feel a bit let down by your other experiences. It is best to end with the best!<br><br>On the downside, Oriole still remains a bit hard to find. Our taxi driver this last time did the same thing that the driver for our first experience did during the year Oriole first opened. So, have your Google/other maps open to lend a hand. Oriole will also set you back a good bit, especially if you do the full tasting and high end pairing...which I highly recommend. However, the price is very appropriate for what is being offered and a value compared to if Oriole was located in NYC, LA, London, Tokyo...Chicago is a great place to live!", "pics": null}}, {"review": {"des": "Worst Michelin restaurant I have ever been to.<br><br>The food was way too salty and imbalanced. I probably drank a gallon of water while I was here to dilute the toxic level of sodium that was in my body.<br><br>My wife was complaining about an upset stomach afterwards. I also felt a lot of intestinal discomfort. The food caused me to have ridiculously awful smelling farts for the next 2 days.<br><br>The people here place the priority on making art instead of making food. The food looked very beautiful, but that was not the point of dining. The top priority of dining should be the taste. If I wanted to eat a piece of art, I would have been better off eating a statue or drinking some paint.<br><br>The tables were way too close together. I feel the people next to me can easily extend their arm and take something off my plate.<br><br>So for all the masochists out there looking to burn through $600 for horrible food, I strongly recommend dining at Oriole.", "pics": null}}, {"review": {"des": "With the hostess welcoming you as you walk up the stairs- you walk into a freight elevator and given a cocktail to help start the night- when she opens the door to the restaurant it's such a great contrast to the dark freight elevator- <br><br>The ambiance is warm and chic- service is impeccable- the food (15 courses) later I can still tell you all the amazing details and favorite components of each of the dishes I had- usually in these long multi course dinners everything starts to blend at some point (if they're doing a bad job) but each dish was different yet flowed well together like the story or styles on the runway- <br><br>Favorite- the cheese and apple butter croissant, wagyu beef that truly melts in your mouth, sourdough bread with rice puffs for that crunchy texture, the truffled topped pasta (I needed triple portion of this dish), and all the nori dusts that was used on the dish! Ending dinner with four desserts (one as \"to go\" ) was the highlight of my night!", "pics": null}}, {"review": {"des": "For the love of *insert your deity here*, stop reading my review, earn some extra cash on the side and put your name here before this place earns its Michelin 3 star status and you will never get the chance to dine at my all time favorite restaurant of all time. <br><br>For the sake of my readers, I will not divulge in the details of my meal, as most of these restaurants alter their meals by seasons, so I'm certain that your meal will look, taste, and smell differently than my experience. Furthermore, I'm not a food critique, I just love food in my own ways and with my loved one, so take my review with a heavy scoop of salt.<br><br>Now that's out of the way, let me take you to a journey that blew everything I knew about fine dining out of the water.<br><br>First of all, Oriole is kept in a secret location, hidden by a large elevator door, in a forgettable neighborhood. But, once you enter this mysterious establishment, guided by a friendly staff waiting outside the door, you will be taken to a culinary fantasy realm, fit for a foodie's dream. What's so great about this place? Well, everything. The service is incredible, the staff very knowledgeable and friendly and they've even served the one-single wine pairing in two separate wine glasses (totally unheard of). They allowed my fiancée and I to take numerous flash photographs of our meals and even let us take pictures with the chefs at the end of the meal before surprising us with complimentary dessert.<br><br>All of this, and I haven't even described how every portion of the meal was perfect and brought forth aspects of my senses that I never knew existed.<br><br>Of the three fine dining experiences during my Chicago vacation (Grace and Alinea included), Oriole took the cake (my pre-wife had my heart already).", "pics": null}}, {"review": {"des": "When you don't know how many burners your stove has and don't have vices like drugs, hookers and gambling to eat away at your disposable income, eating out can get tiresome after a while, even in NYC.  It's really refreshing to visit a restaurant like Oriole, too bad I had to trek to Chicago in the midst of winter for it.<br><br>I came here with high expectations and Oriole almost delivered, only because most of the blogs mentioned 19 courses and we only had about 15 or 16 in total.  However the savory courses were exquisite, both tasty and creative.  Everything was complex yet balanced.  And they didn't skimp on the luxury ingredients.  The desserts were good but couldn't quite measure up to the parade of spectacular plates preceding them.  <br><br>The pre-meal drink and take-home tart were nice touches, but the meal itself was what stood out.  The meal at Oriole made Alinea next night feel like a magic show only.", "pics": null}}, {"review": {"des": "Last night we dined at one of the best restaurants in the USA, in my opinion.  In just less than one year, Oriole has earned praises from many food connoisseurs from around the globe. <br><br>The food was flawless. The prix fixe menu was well crafted and the food was bold and full of flavor. <br><br>The stars of the evening were:<br>~Fois Gras with Salmon Roe.<br>~Seared Hudson Canyon Scallop.<br>~Waygu seared rare to perfection. ~Capellini with shaved Truffle.  <br><br>Chef Noah is well engaged with his patrons and his creative brilliance has helped him earn two Michelin stars in a short period. We appreciated this amazing dining experience!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/f2Eznh_18QBmh9QYsJrYqQ/348s.jpg", "caption": "Prix Fixe Menu!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/AXcnao6ylwh7OBJqXZ3dBg/168s.jpg", "caption": "More dessert!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/oUdJIOzgvZ1A4nBJixOqAQ/168s.jpg", "caption": "Dessert!"}]}}, {"review": {"des": "It was lovely ... 20 years since my husband proposed.  The most expensive meal I've had though my husband tells me adjusting for inflation, Charlie Trotter's was more.<br>Overall, the experience was incredible ... down to the secret entrance doorway and hard to find front door.  The mystery made it all that special.  Here are my favorite highlights:<br>- having a beverage pairing for those lightweights --- complimented my husband's wine paring!<br>- initial cocktail waiting for the reveal of the restaurant!<br>- the small intimate feeling.<br>- the servers were charming <br>- plating of course beautiful <br>- the final touch of the personalized menu and a card for our anniversary was just the cherry on top<br>- picked out our own drink ware for one of the sake courses<br>- Alexander and all the servers were classy and hip all at the same time. <br>- wagu beef my fav <br>- least favorite was probably the foie gras with bread --- good but the bread was boring.  <br><br>Loved every moment!", "pics": null}}, {"review": {"des": "This is the definition of a 5 star.<br>Had an absolutely phenomenal experience and meal at Oriole. Usually, I am not one to get the drink pairings and prefer to order my own but we went with the pairings and I can say it made the meal. Highly recommend doing the pairings because they are exceptional and compliment the meal perfectly.<br>My favorite pairing was the sake that was filtered in an igloo. Yes you heard me right. They called it divine droplets and that is not an overstatement. <br>My personal favorite dish was the foie gras with the scallop. Other highlights were the capellini with winter truffle- absolutely delicious, the wagyu which was the most melt in your mouth meat I've ever tasted, and the oyster dish. I love the Asian flair that the dishes had. The ingredients were so fresh and of high quality. The only miss was the corn mousse. The lychee sorbet was a great palate cleanser but the other desserts were not as great. <br>All things considered though I still left very happy and thought it was one of the most amazing meals of my life. I've been to Alinea and would say many of the dishes were on par if not better.<br>The ambiance is interesting. The entrance is very unique- you are greeted with a cocktail too! <br>The service is spot on and the staff is very attentive.<br>They made my birthday feel so special with a personalized menu and even a birthday card! <br>Absolutely worth the 2 Michelin stars. If you're looking for a place to book a \"special\" dinner... look no further.", "pics": null}}, {"review": {"des": "One of the best restaurants we've been to in Chicago! While it falls under the \"fine dining\" category, it's not over the top or pretentious. It's just amazing food with just a small touch of that surprise and delight on some of the dishes. Don't expect an Alinea-style helium sugar balloon delivered to your table for dessert, but they do have a bit of fun on the presentation for some of the food. I won't say much more about it, but the entrance to the restaurant was also very fun and unexpected. I would recommend it to anyone for their next celebration or special occasion. It's somewhere I hope to go again.", "pics": null}}, {"review": {"des": "WOW. I'm still reveling in the dining experience at Oriole last night, replaying each dish and trying to recall and savor each bite. My fiance and I went to Oriole for an early birthday celebration and even a month out all the prime time slots were booked solid. The only reservation we managed to score was 9:30p.m. on a Wednesday night, but it was well worth it. In the past two months, I've been fortunate enough to dine at both Alinea and Acadia and Oriole deserves a spot up there with the best and beats them both out for the price-point. Dare I say it was the best of the three?<br><br>Located in an alley that you could easily miss, we were greeted outside by the hostess who warmly wished me a happy birthday. Upon entering, we were faced with a giant freight elevator which opened up into a cozy dining room that seats just twelve tables. The dining experience is intimate with the kitchen just steps away and fully visible. In terms of service, it wasn't the same atmosphere as Alinea, but I preferred the more humble vibe. The food was executed at the highest level without being pretentious. Our waitress was perfectly charming and made us feel so welcomed throughout the meal. <br><br>Onto the courses! In par with the fine dining trends, we were notified we would be served 15 courses but the menu itself was a surprise. Afterwards, we were handed copies of the menu as souvenirs. Each dish was superb, the menu itself was well-rounded with each dish complementing the previous one blending into a wonderful medley of perfectly seasoned flavors. I could go on and on, but I'll summarize the highlights.<br><br>Hudson Valley foie gras - I'm usually not a fan of foie gras and feel guilty eating it but this foie gras was so perfectly silky I swear it melted in my mouth. the sharpness of the pink peppercorn provided a nice contrast.<br><br>Japanese A5 wagyu -  a bite-sized portion of seared wagyu, medium rare with charred gem lettuce. Deceptively simple, but bursting with flavor, the crispness of the lettuce paired well with the tenderness of the wagyu.<br><br>Jamon iberico de bellota - a piece of jamon iberico dressed in rich egg yolk this dish was almost overwhelming with flavor. the saltiness of the cured meat was heightened by the creamy buttery flavor of the egg yolk.<br><br>Gianduja - I don't even know how to describe what this was. A wafer-thin pretzel decorated with alternating dollops of raclette and black currant sorbet. My taste buds were dancing from the contrasting flavors of the salty, sweet, and tangy. <br><br>My least favorite part of the meal if I HAD to choose (because truly it was all amazing) was probably the Almond Croissant which was served last. Cardamom is a strong flavor and it overpowered the croissant for me. I also felt it was slightly overbaked, but otherwise a phenomenal meal!", "pics": null}}, {"review": {"des": "Amazing <br>Great experience...<br>Small delightful courses <br>Spectacular service ...<br>Great wine pairings <br>16 course ... <br>was def worth the wait , highly recommend", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/dLdnZa3V1QsPO5-EL7xdiA/348s.jpg", "caption": "16 course menu"}]}}, {"review": {"des": "I've been putting off writing this review for a long time because I don't believe I can do this place justice!<br><br>I don't think you understand what it means to truly eat food until you experience Oriole. This is THE best meal I have had in my life so far and it was an experience I will remember forever. Although not everything was perfect, the essence of food was captured in almost every single bite I had. I can tell that the ingredients are of the best quality and that Chefs Noah Sandoval and Genie Kwon lovingly create each dish with the care and precision it deserves.<br><br>Oriole is an underrated gem, recently opened and not very well advertised, so I'm glad my friend invited me to dine with her. Although the price is steep (over $270 per person if you include tax/tip), it is worth it because it opened my eyes to what it means to eat food in its purest form.<br><br>The location is literally hidden from view; you walk through this sketchy alley and you think you've made a wrong turn and are about to get mugged in the West Loop (who knew that feeling would be possible there??) but trust me you're in the right place. The entrance is through a refurbished freight elevator into a beautiful dining space with an open kitchen that allows you to see the magic that happens. They aren't pretentious here like they are in other restaurants. The hostess was warm and welcoming and all the servers were very kind as well.<br><br>Service was stellar here. We were given complimentary sparkling elderflower bitter cider because my friend and I don't like to drink. Each dish was wonderfully explained and presented to us. I won't belabor the 16 course menu because it changes as different ingredients become seasonal but I will illustrate the highlights.<br><br>Icelandic steelhead trout -- having recently visited Iceland, I didn't get a chance to enjoy the seafood due to the steep prices; I'm glad I didn't because what I had here was probably better than anything I could eat there. This dish was literally the essence of fish, not the fishy part of the fish, but the umami. That broth that the server pours in is liquid deliciousness. I cannot explain my pure delight when I savored each bite. It was one of the bigger dishes but of course I wish for more!<br><br>Japanese A5 Wagyu -- served on a beautiful plate that looks like a slice of a log, the little gem of lettuce is laughable until you eat it and pair it with the beef. Damn this is what beef should taste like. The server laughed at us when he came to pick up our plates \"I've never seen this plate so clean before!\"<br><br>Chicory custard -- I don't know what kind of magic Genie Kwon put in this but this tops all desserts I have ever had (except maybe the miso budino at Girl&theGoat). It's literally like heaven in your mouth. My friend and I were confused at first from the flavor, we had never had real cinnamon before. Now all cinnamon bought from grocery stores taste artificial to me. Real cinnamon is the real deal people!<br><br>And finally, the almond croissant. I love cardamom, and the combination of the buttery croissant with cardamom is pure genius. So flaky and flavorful. Thank you Chef kwon for creating such an elegant masterpiece that reminded me of strolling through the streets of Paris.<br><br>Finally, we were given a complimentary lemon and pecan pie boxed up for us to bring home, as my friend and I were celebrating our passing the med school board exams. I couldn't bear eating my cute little boxed up pie until 5 days later, and even then it was still gloriously delicious.<br><br>At the end, we were full. Our stomachs, minds, and hearts were full and satisfied. Thanks again Oriole, for the wonderful experience. Now I can say I truly know what it is to enjoy food. <br><br>The flip side is, I can never truly enjoy eating normal food again :P", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/NWl2knN1YfKsxTFgvRlSrw/348s.jpg", "caption": "our menu"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/sm9Tt2XLP-nsenuw-xtADw/168s.jpg", "caption": "Chicory custard (aka dessert from heaven) with whiskey, cinnamon and tahitian vanilla"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/GBo08SFxPAjlnSS1RrH88g/168s.jpg", "caption": "Santa Barabara sea urchin with yuzu kosho and genmai"}]}}, {"review": {"des": "I need another 5 stars to truly express how wonderful this hidden gem is.  It is literally hidden and relatively unknown to the public.  I know that will change over the course of the next few months because this place is going to leave its mark in the dining scene!<br><br>To arrive at Oriole you walk down a street that is not even known to those that live in the neigborhood only to approach a ramp and a hostess ready to greet you outside.  She opened up a freight elevator door to welcome you and your party into the private and intimate setting for a breathtaking pre-fix menu that will blow your socks off.<br><br>I will not reveal the details of every course but only highlight those that left a lasting impression in my mouth and mind.  With this said it is nearly impossible to say that all courses were not amazing.<br><br>I begin with the first impressions of food being the ostera caviar.  I have never had caviar and was a bit hesitant to try this dish.  Beautifully plated in what looked like a petri dish was a tomato gelee caviar and sea grapes.  The first bite sent my tastebuds on overload!  My mouth remained in shock as it watered for each bite.  Such a big surprise in such a simple and intricate looking dish.<br><br>The 8th course was the next to have caught my attention the most.  Alaskan king crab with cara cara, spring onion and herbs. The crab cooked so delicately pairs so well with cara cara and herbs almost reminding me of raitta.  The dish hit notes of Indian flavors and a bit of warmth that I truly enjoyed.<br><br>The capellini was yet another dish that had warmth and depth that I could not get enough of.  Made with yeast butter, perigord truffle and rye berries this was creamy and rich without a heaviness.<br><br>The dessert that stood out the most to me was the almond croissant.  You may think that sounds so simple but this was made with caramom, rose and acacia berry.  The flavor pallet reminded me of a less sweet and airy version of an Indian dessert, gulab jamun.<br><br>For the beverages the vermouth - cocchi americano bianco and doulin rouge was an interesting mix that paired very well with the sourdough bread and the trout.  I also enjoyed the double cream stout even though I am not usually a stout person.<br><br>Overall, the food was remarkable and the wine/cocktail pairing were on spot.  I didn't have any complaints on what I ate and everything was executed to perfection.  The staff pays attention to every detail from what side you prefer your cutlery on to what hand you drink your beverages with.  As I sat down they immediately asked if I was left handed which was great to know they cared so much to make my dining experience as comfortable as possible.  Even excusing myself for the restroom was noticed and the restroom was stocked with anything you may need.<br><br>The enviornment is not stuffy at all and friendly as the staff lightheartedly made small conversation but allowed you to enjoy the momeny with your party.<br><br>The kicker...just when you think you have eaten everything devine the pastry chef sends you home with pecan lemon pie!  This pie had the most amazing airy flaky crust and decadant filling.  The lemon and crunch of pecan paired so well and just reminded me of how great the whole experience was.", "pics": null}}, {"review": {"des": "What is not to love about a dining experience that starts with a drink as soon as you are greeted by the host? The wagyu beef is one of the best things I have ever eaten. Ever. The service was spot on with great explanations of what (and sometimes how) to eat what was in front of us.", "pics": null}}, {"review": {"des": "Everything, well almost everything, about Oriole deserved 5 stars.   We were pleased with the service, food, ambiance, kitchen staff behavior, décor and seating.  The only challenge is to find the restaurant.  It is on a 1 block long street.    The city has not seen fit to put up a street sign, so even with your GPS you may circle the block a few times looking.  Keep trying.  The experience is worth it.<br> Also, the very modern sign is in silver metal, with thin lettering.  Right under a light it was impossible to read.  Even when we were parked in front.  But after we were greeted by a most amenable host, the fun began.  <br><br>The entry foyer decor is \"industrial\", with a freight elevator door visible at the back.   There is no sign of a restaurant.  <br><br>You are greeted with a warm cocktail of Lillet and flavored tea.  I am not a big tea fan, but this was delicious.    Very low in alcohol, but a good digestif to get you ready for a couple of hours of great small plates.<br><br>After some chit-chat with the host, we were ushered into the \"freight elevator\" and the back of the car was opened.   And there was the restaurant.  Just 28 places.    The tables are further apart than at most restaurants, so you have a wonderful sense of privacy.<br><br>The décor is bare brick and beams, with well thought out spot lighting.<br><br>The menu is set, but my dining companion's vetos of certain ingredients were carefully noted, and clever substitutions were made.   Unless you check online, the menu is a surprise.   You do not get a copy until the end.<br><br>The service is one small plate after another.   The pacing of the dishes is just right.  There is no sense of being rushed.  Or of waiting too long for the next course.<br><br>The food was really excellent.   The freshest vegtables, meats and fish, beautifully presented.   There was not so much of the \"food as art\" look so popular at Alinea.    But clearly the look of each dish was well thought out.<br><br>Some of the best were the fois gras, a generous truffle scrape on top of a yoghurt combo, and an oyster \"all in one bite\" dish.    The waygu beef was so tender that is was almost gelatinous.   <br><br>There were lots of small sweets at the end.<br><br>The service was terrific.    All the servers, man and women, were not only knowledgeable, but also attractive.  They explained each dish.   They seemed to genuinely enjoy doing their jobs.   <br><br>My dining companion was celebrating her birthday.     She was wished happy birthday several times, and with the menu at the end of the meal came a birthday card signed by everyone on the staff.  Not just signed, but with various messages.<br><br>Oriole's kitchen is open to the dining room.   A young staff was preparing the plates with intensity.   During the over 2 hours we were there , little or no conversation was observed in the kitchen.  Everyone seemed to know what they were supposed to do, and they did it.   Calmly and skillfully.<br><br>         There is a wine pairing available.  But I had a fine  1/2 bottle of Chianti Classico, which was an excellent value.    My dining companion ordered an \"adult portion\" of the welcome cocktail, which the sommelier  was happy to prepare.<br><br>         For what we experienced, I regarded the meal as an excellent value.", "pics": null}}, {"review": {"des": "Without a doubt deserving of their reputation and Michelin stars. I am a foodie from way back and most of my vacations and travel are devoted to culinary experiences. Last night was without a doubt one of my very best adventures ever and I have dined all over the world. A well spent 2.5+ hours without a doubt.<br><br>Impeccable service I cannot remember a place where service was this refined and perfect in execution. <br><br>Very intimate restaurant space with seating for only about 28 guests. <br><br>The executive chef himself finished a couple of the courses tableside. Not only did he finish the course and thus make himself available for our commentary but he knew my name and used it.<br><br>Fifteen courses of compete and utter scrumptious delight I have no suggestion for any improvement, everything was prepared perfectly beginning to end. <br><br>We were the last table of the night and there was absolutely no rush for us to leave and we needed a moment to digest and allow ourselves to take in the entire experience post dinning. <br><br>After the meal went back to the hotel and very pleasantly fell asleep perfectly satiated to dream of returning. <br><br>The only negative was that our Urber Select Driver asked us how to get to the location. One of my companions found the location on GPS and basically helped him find the location. They are somewhat hidden but it is worth the trouble to find them.", "pics": null}}, {"review": {"des": "After being open only a bit more than a month, Oriole is already in contention for best restaurant in Chicago, which also makes it a contender for best in the US.<br><br>Nearly every one of our sixteen courses was a home run--so much so that it's hard to pick standouts. From the first bit of langoustine topped with caviar, each course offered an impressive array of flavors, sometimes merging into a complex whole, and at other times exploding sequentially on the palate revealing one ingredient after another.<br><br>The alteration of courses from rich to refreshing and back again kept our palates fresh. Portion sizes were just right, so that we never felt over-stuffed (although we would have happily consumed another six orders of just about anything we were served!)<br><br>Rather than attempt to describe individual courses, which change anyway, let me just list those items that topped those I've had at the best Michelin-starred restaurants in the world: Sea urchin, foie gras, Alaskan king crab and Japanese A5 Wagyu. Each of these provided a mind-blowing complexity that forced one to stop and consider what was going on in each bite, and each event on the plate. For example the charred lettuce that accompanied the Wagyu was so phenomenal it almost upstaged the Wagyu, which was the best piece of Wagyu I've ever tasted.<br><br>As with many tasting menus, the last four courses are desserts, and some members of our party don't have much of a sweet tooth. Let me just say that not one crumb survived. The desserts provided terrific variety, were never cloying, and were paired with wines that had very controlled sugar and acid levels, keeping our palates fresh and interested until the very end.<br><br>With only about a dozen tables arranged in ample space, the dining room is stylish yet comfortable. Soothing colors and rough brick walls contrast with retro hanging lamps, and a spotlight on each table shows off the food to its best advantage. A glass wall separates the dining room from the kitchen, although it certainly isn't needed for noise abatement, as there is no kitchen commotion from the many chefs working their magic.<br><br>Service is professional yet welcoming, without the stiff affectations of some top restaurants. We were particularly impressed with our sommelier, whose extensive knowledge and passion for the wines on the tasting fight was matched by his deep understanding of the ingredients in each dish and how they matched his selections.<br><br>While Oriole is not inexpensive, it offers an astonishing value given the perfection of the experience.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/NNDs2WWuk7cY_UVQm0-UvQ/348s.jpg", "caption": "Exterior"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ZJpAEoXo1i0AzAEXOuS_zg/168s.jpg", "caption": "Almond Croissants"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/zm2DXyLRkqtrHmz5qDLh1A/168s.jpg", "caption": "Japanese A5 Wagyu with Charred Lettuce"}]}}, {"review": {"des": "I was looking for a nice restaurant to take my girlfriend to for her birthday and although I had heard of Oriole, the Yelp reviews are what convinced me go to ahead and place a reservation.<br><br>Boy, we had a spectacular experience. We had a very warm welcome from the host with a cocktail to begin and then were seated to our table. The restaurant is nice and classy without being lavish. It just feels very cozy. The 11-course menu with the wine pairing was absolutely amazing from beginning to end and I will remember this as one of the best meals I've had in my life. The staff was very thoughtful every step of the way, they offered to call us a car on our way out and even signed a card for my girlfriend's birthday. Oriole went above and beyond and I cannot recommend this place enough for a nice occasion.", "pics": null}}, {"review": {"des": "This is the epitome of excellence.  Old school Chicago meat market with no blatant signage.  Sets of stairs across a street with ample parking on that particular night.  We ride up in an old school pulley freight elevator.  They're aware of who we are, and we're sat in a booth. Received a complimentary glass of champagne for our Anniversary.  The restaurant is somewhat small, but we have a birds eye view of the fishbowl kitchen.  That's what I call an open kitchen with glass surrounding it.  I can see Chef Noah and his crew, along with Chef Genie Kwon paying the utmost attention to detail with each dish that passes them.<br>Golden Osetra Caviar - tomato sorbet, crème fraiche, and sea grape<br>Not normally a fan of caviar, but this is delicious, paired with a lighter colored tomato sorbet, and the sea grape (a grape originated from the Buckwheat family, and perfect in the late summer).  Beautifully presented as such chefs like Eric Ripert and Daniel Humm.  I love next level creativity and beauty!  <br>Langoustine - shio kombu, rhubarb, and mint<br>Served on a rounded slate looking plate.  It's earthy, and the filling inside these perfect little packages is soft and moist, with the shredded shio kombu, adding a nice unami flavor and texture.<br>Madai Nigiri - yuzu koshu and genmai<br>In a wooden flat bowl, Japenese sea bream (Madai) with the yuzu koshu which is a paste made from chili peppers, yuzu peel and salt, which is then allowed to ferment.  The genmai on the top is light and refreshing with a mild sweetness. Genmaicha is a well toasted brown rice green tea.  <br>Beausoliel Oyster - iberico consummé and finger lime<br>Not a fan of oysters on the reg, however these are situated ontop of what look like sea beans and the flavor of the Iberico is just a unique taste, created in part by the aroma of sweet acorns that the Iberico pigs feed on. Giving it that rich, creamy texture that melts in your mouth. Along with the silt curing of the meat.  Turning that into a consommé is a pleasant surprise.  <br>Jamon Iberico de Bellota - black walnut, egg yolk, and compo de montalban <br>Perfect course to follow the oysters.  It like an orchestrated service, and my palette is dancing more and more.  The fattiness of the iberico, the egg yolk puree, and the cubed Spanish blend of cheese from multiple animal milks marries well.  There is a crispy cracker or perhaps gaufrette on the side of the plate.<br>Alaskan King Crab - spring onion, orange cells, and herbs<br>Small clay pot with crab inside, and orange cell foam, they pour something creamy into it (I can't honestly remember)  Sorry folks.  Fail on my part.<br>Sourdough with cultured butter and local grains<br>My god, this is some ahhhhhmazing bread, the butter is perfect and the puffed grains on the top offer a textural punch of crispy crunchy.  I could eat ten of these.<br>Capellini with period truffle, rye berry and yeast<br>Such a star dish!  Creamy, flaky, crunchy, so much truffle ontop.  I know truffle is played out, but not to me.  All day evvvvvver day.  <br>Japanese A5 Wagyu - charred little gem, furikake, sesame leaf<br>The beef was outrageously tender, seared perfectly and marbled, melt in your mouth.  Charred gem lettuce with the saltiness of the seaweed/ fish flake suits the creaminess of the meat.  The most creamy potato quenelle accompanied as well.<br>Hudson Valley Foie Gras - bay scallop, chanterelle, and nasturtium <br>Beautifully composed dish, scallop cooked to perfection, chanterelle chips.  I'm not the biggest fan of the nasturtium.  Mustardy and a little sweet, but the foie was exceptional.  Controversial or not, I love it!<br>Lamb Belly - huckleberry, rapini, and chermoula<br>The lamb was very tasty with the rapini, but it needed something.  Oh yeah!  The huckleberries.  I think the chefs were too busy impressing our neighbors (pretty sure the lady patron is a famous chef), that I didn't receive any on our plates.  The chef brought them out later and spooned it personally, but by then that dish experience was over.<br>The mochi was on point!  I love the citrusy feel of yuzu and the mildness of the yogurt with a hint of chamomile.  It's not easy to make the rice dough from scratch, as I've had to in the past when I lived in Hawaii.  Not easy at all.  Nice finesse Chef Genie.  <br>An interesting take on the next dessert course.  A long wide stick of pretzel lavash.  Just a tad on the salty side for me, but a fun vessel.  Gianduja cremeux, raclette creamy melty Swiss and French cheese, and black currant sorbet.<br>The chicory custard had to be my favorite.  Made from Chicory coffee, made with chicory custard with milk ice cream, and whiskey foam, Tahitian vanilla, and a special cinnamon. Served in a glass dish with liquid nitrogen.  Chef Genie Kwon came out of the kitchen to present us with a Happy Anniversary dish, complete with a croissant, macaron, house made pirouette, pate de fruit.  We are sent home with a box of house made pie.  Overall, a high end experience, the staff are attentive and well versed.  A++", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Mvn0A9nI4tZ8LHCAWWGLag/348s.jpg", "caption": "Gianduja and raclette cheese with black current sorbet in the pretzel lavash"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/oyeuqO5_Ko3lUlRj3Ztbpg/168s.jpg", "caption": "Sourdough with the crisp puffed local grains"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/hlWcP8_UEhflQ5cDA4lMGw/168s.jpg", "caption": "Lamb Belly with Rapini without the huckleberries (they forgot!!)"}]}}, {"review": {"des": "I made reservations at Oriole to celebrate a special occasion.  I'm so glad that we were able to enjoy a fantastic meal here.  Honestly, I wasn't sure what to expect.  For starters, there seems to be this trend of placing amazing restaurants in unusual places.  Oriole is no different.  In the evening, the street they are located on looks more like an alleyway.  Oriole's door is nondescript.  However, if you look closely, you can see the small sign by the door.  The doorway opens into a an old service elevator.  It makes for an interesting discussion and fun way to start an amazing meal.  We were offered a drink to start the night.  The warm alcoholic beverage was a nice way to warm up after walking in from the outside. <br><br>The entire meal was full of surprises.  I felt like each course went from high note to high note.  Typically, with most tasting menus, I'll find some course or item I don't particularly care for.  I don't think that's a bad thing, as everyone's tastes are varied.  Something I may enjoy, may be the exact thing someone else hates.  I enjoy having my boundaries pushed, and trying new things.  In those instances, I don't mind that I don't enjoy something.  It will often lead to a fond memory of the experience.<br><br>After reflecting on my meal at Oriole, I don't recall not feeling like each item was a high note in it's own respect.  I don't know how best to characterize the meal.  To me, it felt like there were many different ethnic influenced flavors.  The mixture of the different flavors, Asian, Spanish, and the like, was a delight.   <br><br>The meal started with Caviar, Beef Tartare, and a smoked sturgeon sabayon.  The smoked sturgeon sabayon was rich and creamy.  It was a nice offset to the tartare.  Up next, was the perfect piece of Salmon Nigiri.  This was followed by a Spanish Mackerel with asian pear and sea grapes.  This dish reminded me of the ocean.    The fish was delicate and perfect.  The ocean theme continued with a great Oyster served alongside a piece of Jamon Mangalica.   The ham was wrapped around, for lack of a better word, a cracker like bread stick, and adorned with egg yolk and blue cheese.  It was a scrumptious dish.   A perfectly poached piece of Alaskan King Crab was served with chicharones.  <br><br>One of my favorite dishes was next, a perfectly seared scallop served with foie gras, dried wild blueberry, and roasted duck jus.  There is something amazing about the way scallops get when they are seared correctly.  The exterior gets that nice crust, while the interior remains soft.  This complemented by the foi gras and duck jus was just out of the world. <br><br>This was followed by a piece of confit Berkshire pork rib rubbed in cumin.  It was served with a yogurt sauce.  After I ate this, I wanted to go all caveman and gnaw on the bone.<br><br>I didn't think the meal could get any richer.  Boy was I wrong.  After an amazing piece of house made sourdough bread and butter, they brought out a pasta dish.  The capellini was covered in shaved winter truffle.  I think this was the richest pasta I have ever had.  It was pure decadence.<br><br>By this time, I was so full, I could have died happy.  But low and behold, the next course was a perfectly seared piece of A5 Wagyu served with lemon ash.  The beef melts like butter.  The richness of the meat was perfectly offset by the black ash on the plate.  This dish was pure bliss.<br><br>After all of that, we received a series of dessert courses.  The perfect croissant - light and flakey - filled with apple butter.  A lychee sorbet and Sweet Potato tempura ice cream.  They closed out the meal with \"milk and cookies.\"  Plus, they gave us a cranberry pecan pie for the road.  This was probably the best pecan pie that I've ever had.<br><br>All in all, Oriole is an amazing experience.  It is certainly one of the best meals that I can ever think of.  Some nice restaurants feel stuffy.  Oriole is decidedly the opposite.  It feels very intimate, warm, and inviting.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/5kWD7WVt17-t1uRs0TlNfw/348s.jpg", "caption": "Capellini with shaved winter truffle."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/bC-b6S-XpR4xYxcJfi6HPw/168s.jpg", "caption": "Sourdough with Butter and puffed grains."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/bVuDRwQHWhW42wRxam3IfA/168s.jpg", "caption": "Berkshire Pork."}]}}, {"review": {"des": "All I can say is amazing. We went while in Chicago for the weekend to celebrate our anniversary. The hospitality by the team at Oriole was amazing. They made us feel as if we were regulars and the team operates as if they are family. Chef Noah Sandoval is truly one of the most talented young chefs. Each dish was amazing but the standouts for me were the Hudson Valley fois Gras and scallop, as well as the Capellini with Summer Truffle, which Chef Sandoval himself shaved onto our plate. <br>Fantastic dinner and can't wait to go back to Chicago.", "pics": null}}, {"review": {"des": "Oh. Em. Gee. So, I tried to go without eating for the longest time possible after this meal cause I felt like it would be so disrespectful to my taste buds, who just had the most royal culinary experience ever. As a New Yorker I thought Oriole would be like any other higher end restaurant, but never been so wrong and happy about it. This place is just over and beyond with everything from food to service. Came for an anniversary dinner (shout out to the bf) and it's probably the best meal I've ever had. <br><br>My fav dishes in no particular order:<br>-The wagyu beef WAS SO DELICIOUS I just felt bad for myself living like a peasant in my regular every day life. So buttery and just melts in your mouth.<br>-Berkshire pork with kimchi was pretty damn solid- and I'm Korean and super critical of fusiony Korean dishes<br>-The pasta with truffle butter- self explanatory, doesn't even need a hype sentence.<br>-The foie gras with blueberries that tasted like jam in your mouth... again, just melts in your mouth while you are melting into the chair. <br>-Also the baby corn dessert, which wasn't actually corn, but instead ice cream with a home made pretzel shell. Like I could've eaten 10 of those. So delish. <br>-Last, but not least, they send you home with a ginger key lime pie, which just happens to be my boyfriend's favorite pie. He devoured it on the spot and they gave him another one for the road! <br><br>The service was spot on and I think the staff had just as much fun watching my bf's EXTRA reactions as much as we enjoyed the food. The bathrooms were on point, with the perfect amount of lighting, multi-ply toilet paper (it really makes a difference!), hand cream, and a range of personal care items that would have Whole Foods jealous. At the end of the night they even gave us an anniversary card signed by the entire staff which made the whole experience extra special. If you live in Chicago or ever come to visit, this place is worth the $$$$- especially if it's free cause you have a generous and loving boyfriend who will read this review and know that you want to come back again :)", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Ms4Tv0u6zyrGd2USgJcOXg/348s.jpg", "caption": "The baby corn dessert that isn't actually corn and is probably the best dessert I've ever had"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/v50oLFUmul-xsPuZzdtTFQ/168s.jpg", "caption": "OMG THAT PIECE OF MEAT"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/z-ZjYhi5hqVnVaU_PUw7Cw/168s.jpg", "caption": "Pasta with generous heap of truffles"}]}}, {"review": {"des": "Oriole was an amazing experience! I came here for an early birthday dinner and was very impressed by the quality of the ingredients and the presentation of the courses. The interior had a cool, industrial exterior but after stepping through the magical sliding door of a freight elevator, you were transported into a space that felt warm and casual. The service was excellent and you could tell that the servers were very knowledgeable about each dish (thanks for being an awesome server, Neil!).<br><br>The courses that stood out the most for me were the Alaskan king crab, the A5 wagyu, and the capellini. The crab was very tender and the cara cara oranges added the perfect amount of sweetness to the dish. The coconut sauce had an incredible complexity of flavors and complemented the crab well. The A5 wagyu literally melted in my mouth, which was something that I was not expecting from a meat dish. The ground rye berry added a nuttiness to the capellini and provided a nice crunchy contrast to the overall creaminess of the dish. Other highlights included the sea urchin and the light and tangy Meyer lemon in the gianduja palette.<br><br>Overall, I would recommend Oriole if you are looking for wonderful food and service. The price tag is certainly not cheap, but after eating here I would say that it is most definitely justified. Thanks to Cara, Genie, and everyone else who made this experience one to remember.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/YB62gDyf1YGB0VuZ9CVq7Q/168s.jpg", "caption": "Alaskan king crab dish - the crab is in there!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/UM_raduQQS0o1FLxaVWZ1w/168s.jpg", "caption": "Santa Barbara sea urchin"}]}}, {"review": {"des": "We had an unbelievable experience dining at Oriole. Every course is phenomenal. The preparation and quality of ingredients was something I could not have imagined. The service is excellent as well. Make a reservation- you won't regret it!", "pics": null}}, {"review": {"des": "Got a last minute reservation on opentable on the same day. I felt very relaxed throughout the tasting. Very creative with their non alcoholic pairing. This restaurant is a hidden gem, love the decor & the food definitely live up to their reputation as a 2 michelin starred restaurant. You gotta finish your meal with the very last bite to complete your experience!  (recommended)", "pics": null}}, {"review": {"des": "It's no secret that Oriole is a top restaurant in not only Chicago, but the nation, so my review will be nothing earth-shattering. However, I did want to take the opportunity to gush over my one-year anniversary dinner with my husband here last month. <br><br>First, note that you need to make reservations months in advance. My husband tried to make one a month out, and it had been booked up that weekend for a while. He emailed them about wanting to spend our one-year-anniversary there, and they worked us in when there was a cancellation.<br><br>Oriole blew my mind. The food is incredible. The wine options are incredible. The service is incredible. The atmosphere is incredible. <br><br>The attention to detail is unlike anything I have ever seen in a dining experience. On our menus, they printed \"Happy One-Year Anniversary\" at the bottom, and they even gave us an anniversary card that all the wait staff signed! <br><br>Lastly, to-go desserts. They give you to-go desserts AFTER your dessert courses. Yup. Best meal I have ever had.", "pics": null}}, {"review": {"des": "Incredible service, dishes, and atmosphere! You are greeted with a delightful cup of tea--so lovely and much needed on a chilly, November night--and the most attentive hostess. The dishes were delectable and unique. Additionally, each one was served at the perfect time; you were never rushed to finish the previous dish nor waiting too long for the next. Cannot commend the Oriole team enough. Overall, a phenomenal meal I will not forget, served within a beautiful setting.<br><br>Those under 21: I recommend the Sunshine Spritz! Spiced chamomile, cacao juice, and elderflower tonic create a perfect melange.", "pics": null}}, {"review": {"des": "I say this with some experience, we had the best fine dining dinner in America tonight, hands down! Seriously and no disrespect meant to all the others but the bar was raised a bit by the team at Oriole! Thank you Cara Sandoval, Noah Sandoval and Genie Kwon for not only food that averaged a 10.1 on a scale of 1 to 10 but for the heart and joy that accompanies it. Your hard work and dedication makes the world a little better one bite at a time!", "pics": null}}, {"review": {"des": "My boyfriend brought me to Oriole for my birthday and it was truly one of the best meals (if not the best) I've ever had. It's clear that the the team behind this restaurant took the time to think of every last detail to create a one of a kind dining experience. At the end of the meal we were given personalized menus, the wine pairing list, a birthday card signed by the Oriole staff, and mini pies to-go. Oriole went above and beyond. The staff was kind, courteous, and efficient, while the food and wine pairings were truly spectacular. <br><br>So, if you're reading this you should just go ahead and make a reservation- you will not be disappointed.", "pics": null}}, {"review": {"des": "Five stars is inadequate for this establishment! Beginning with the phone call to set up the reservation through to calling a cab at the end of the meal - everything was perfection! <br>Michelle was our main server and with eleven courses we got to know her well over the three hours we dined. The support staff and sommelier were professional, courteous and all equally knowledgeable. At one point we were chatting with the sommelier about a wine when the next course arrived. After he was done explaining about the wine he shared what the course consisted of. He knew more than just his designated area! As did everyone. <br>The food was exquisite. Small courses where every bite was an experience for the pallet unparalleled in my experience! <br>Even the restrooms were well appointed with dry shampoo, breath mints and mouth wash. <br>Not an everyday type of place but an amazing experience. I will return to Chicago just to dine there again!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Re1Odzq708B2XxRU9ZG53Q/348s.jpg", "caption": "Corn mouse on a pretzel husk. Yum!"}]}}, {"review": {"des": "Mind blowing. Incredible and unlike any other restaurant. Food was lovely and inventive. The service was superb. The desserts really stood out. Not to miss.", "pics": null}}, {"review": {"des": "After eating at both Chicago 3 starred Michelin restaurants & several of the other 2 starred ones, ORIOLE should definitely be up there with the 3  stars!! The food was excellent as was the service. Favorite dishes were the fois gras & the wagyu beef. Did not do the wine pairings, rather had a glass of champagne & glass of red wine, that paired very nicely with the courses. Chef Sandoval was so gracious as to take a photo with me, after shaving truffles on the wonderful pasta course. Would definitely recommend for a fine dining experience in the city. And they even send you home with an individual pie, Looking forward to eating for breakfast.", "pics": null}}, {"review": {"des": "My wife and I visited Oriole for our 5 year anniversary. What we thought would be a great meal, proved to be something much more than that. Without giving too many spoilers, the whole dinner proved to be much more experiential than anticipated. From the way you enter the restaurant, to the music, to the atmosphere of the dining room - the entire experience was engaging from beginning to end. <br><br>The flavors of the food were incredible. Most of the dishes would start out with an initial flavor, shifting mid-bite to a different flavor that somehow always perfectly complimented the initial flavor. <br><br>The wait staff was incredible. Very knowledgeable and attentive, but did not come off as pretentious. Each staff member we interacted with came across as genuine and fully engaged to the job at hand. <br><br>Lastly, I would highly recommend the spirit free pairing. The drinks provided were out of this world! Pure magic. I swear they had Gandalf himself preparing these sweet potions in the back. <br><br>Thank you to the entire Oriole staff. This was an anniversary that we won't forget!", "pics": null}}, {"review": {"des": "I had high expectations coming into Oriole based on reviews and the Michelin star rating.  Oriole did not disappoint one bit.  It was fantastic.<br><br>A previous reviewer had compared Oriole to Alinea and rated Oriole higher.  I would definitely agree.  Oriole trumps Alinea (which we ate at 3 nights later in the Salon, was disappointing, and more expensive) in so many ways.  <br><br>The dishes have so much depth to them.  Everything was delicious and not just \"unique\".  Reminds me of Saison (3-stars in SF) but less expensive.<br><br>We did a standard wine pairing which was excellent.  <br><br>Favorites, aside from the A5 wagyu which is an obvious pick, were the kampachi, foie gras/scallop, and the truffle pasta.  But honestly every dish was great.  <br><br>The mignardises at the end of the meal summed up the night.  Most places just throw at you a bunch of small, random sweets that you don't care to eat.  Here they gave us three unique ice-cream sandwich-like small bites that were very enjoyable.  <br><br>The service was also amazing.  Very nice staff, attention to detail, gave us some other great food/bar recommendations.", "pics": null}}, {"review": {"des": "Oh My.  What a wonderful dining experience.  From the moment we arrived, the service was spot on.  The food was incredible and the beverage pairings with each course was perfect.  This team knows how to present, serve and excel on all regards.  <br>One of the most eatable and drinkable meals we have had in Chi-town.  <br>13 course event with Grande Cru pairings.  <br>Wine glasses, plates and silverware were added and removed silently and efficiently.  The staff was in perfect unison.  <br>We were perfectly saited at event end.  <br>Mouthwatering, tender, perfectly seasoned. Flavorable.  Depth of flavors and crunch.  <br>Ok. I'll stop.  <br>One word. Incredible.  <br>Thank you.", "pics": null}}, {"review": {"des": "This was one of my favorite meals this year. I live in San Francisco and was visiting Chicago, so I was very pleasantly surprised to score a reservation here on a Friday at 7:30, a couple weeks before. Perhaps someone else canceled shortly before I booked, but obviously the reservations gods were giving me some love that day. <br><br>There is a lot of hype with this restaurant and it's hard to manage expectation levels when the hype is VERY high. I've read some reviews where customers have complained that they were disappointed that the freight elevator was just a front to the restaurant and didn't take you to a different dining room floor or that the dishes lacked cohesiveness from one dish after another and felt more like tapas. Well, after eating here, I would like to call out on the bullshit on these other reviews. At the end of the day, Oriole created delicious dishes that paired with the ambience of the place resulted in a remarkably memorable experience. <br><br>Let's talk about the freight elevator entrance. The concept of someone waiting for you with a welcome drink in a freight elevator and it opens up to the restaurant is darn cool. Let's not get over ourselves and wanting it to be a fully functional elevator and take you to another floor or transport you to a hidden platform like Platform 3/4 at King's Cross Station. Also, I've been to the Ninja restaurant in New York where the hostess takes you in an elevator to the restaurant on the floor below and have waiters dressed as ninjas jump out at you to scare you...that experience was not cool. <br><br>Now let's talk about the most important part of the meal, the food. It's true that each dish is quite different from each other and that there is less of a cohesive theme to the entire meal apart, like you would have at Atelier Crenn in San Francisco where each dish corresponds to a line in her poem menu. But I would like to think the cohesive theme to this meal is that every dish was very good and executed to the highest level. It's very uncommon to have a nice meal where they serve you a sushi nigiri, seared foie gras and fresh made pasta in one meal. While some of the dishes are experimental and change every 2.5 months, apparently there are some staple signature dishes that do not change. My favorite dishes were the pork belly with kimchi, salmon with green goddess sauce and roe, seared scallops and foie gras, A5 wagyu with the delicious onion ash, lemongrass bone both and the baby corn dessert. I was also very impressed with the non-alcoholic pairing and thought it worked really well with the menu. <br><br>This restaurant is definitely gunning for the three Michelin stars, after receiving two stars within the first year of opening. I think that they have the potential to get there soon. I don't know when I will be in Chicago next time but I will definitely want to go back the next time I am in town.", "pics": null}}, {"review": {"des": "***Refined but edgy and inventive, Oriole is one of the very best restaurants in Chicago***<br><br>Oriole's chef Noah Sandoval used to run the high-end gluten-free restaurant Senza, which was one of the very best restaurants in Chicago. His new restaurant Oriole does feature gluten and is amazingly far and above that excellent restaurant in almost every way. Oriole is housed in an interesting back alley building where you have to go through a freight elevator entrance. It feels like you are walking into a pop-up party or event and not a fine dining restaurant (the wide variety of environments Chicago's top restaurants employ is one of the reasons why they separate themselves from restaurants on the West Coast).<br><br>Oriole is a nice space that is contemporary and comfortable but still elegant. Oriole features a tasting menu only approach, and it is a great unveiling of 12 small courses. The night started with golden osetra caviar paired with dashi coconut sorbet, lychee gelee and sea grapes. I loved the caviar and also the dashi coconut sorbet because of its mix of sweetness from the coconut and the seafood and savory flavor from the dashi. Very unique. The lychee provided more sweetness while the sea grapes exploded with sour notes.<br><br>Next came a langoustine spring roll topped with shio kombu and enoki mushrooms. I loved the jerky like texture they accomplished with the mushrooms and the mix of earthiness and taste of the ocean flavor (as well as the savory notes). The langoustine filling was moist, soft and sweet.<br><br>Next came one exceptional bite--madai nigiri with yusu kosho and puffed genmai for great crunch. Up next was another great bite--wagyu beef tartare bathed in an oyster aioli and sitting on a puffed beef tendon came crisp. This was a perfect bite as both the land and sea flavors came across. This was accompanied by a small bowl of beef broth that had a surprising sweetness provided by cinnamon.<br><br>An oyster with iberico ham consommé followed. There was also fatty iberico ham wrapped around a rich and creamy egg yolk puree and garnished with mustard seeds, a creamy and lightly salty cheese, candied black walnut with a great crunch, and an addictively satisfying in both flavor and texture crisp.<br><br>A bowl of bursting with ocean flavor salmon roe followed. It was served with purple potatoes, artichokes and shishito fumet. There was definitely a significant amount of acid here and occasionally Oriole plays with very strong, intense and maybe off-putting to some flavors like nearby Grace.<br><br>Next came great sourdough bread topped with cultured butter and puffed local grains. This was paired with an exceptional capellini pasta course tossed in a great butter sauce and topped with very aromatic black truffle. A 42 Grams-esque Wagyu beef came next, and it was perfectly marbled (exceptionally rich) and seared very well to give off a great beef flavor. It was served with béarnaise and a very charred gem lettuce topped with sesame, furikake and some kind of an acid to give it a bittersweet and sour flavor.<br><br>The last course was rich lamb belly that practically melted with just a light touch of the fork. It was paired with rapini, a very good hazelnut crumble and huckleberries. Pre-dessert was a refreshing mix of lemon tea sorbet, hibiscus, bitter greens and perfectly ripe Asian pear. Next came a lightly salty pretzel lavash crisp topped with indulgent chocolate mousse, creamy raclette cheese and black currant in both sorbet and sponge cake form. Every flavor here was strong in its own right, but somehow everything seemed to come together very nicely.<br><br>The main dessert was exceptional chicory custard topped with cinnamon and a milk ice cream. Very creamy and lots of great flavors. The last sweet item was a fresh from the oven croissant glazed very lightly with a really good honey. This was crispy but with also many soft layers and a very mild sweetness. It was exceptional especially given how most restaurants in Oriole's class do not serve made to order pastry. A really good butterscotch banana meringue pie served as a parting gift.<br><br>In addition to the excellent food at Oriole, service was very polished, precise, polite, and personable. Prices are high, but you get a great variety of ingredients that you do not often get at most fine dining restaurants (the quality of ingredients was exceptional too).<br><br>Oriole is an excellent restaurant and would easily be among the best in the country. It reminds me of Manresa in its use of Asian ingredients and Saison in its pastry service and perfectly timed, executed and precise courses. Oriole is a must visit for any resident or visitor who enjoys exceptional fine dining cuisine.<br><br>I am not sure what the parking situation is at Oriole. The CTA Clinton station is close by.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/uFQz6DLf77LB54zXujNwzA/348s.jpg", "caption": "Wagyu tartare, oyster aioli, beef tendon crisp"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/SwWHBSlOYMKa2zLDJvupJA/168s.jpg", "caption": "Wagyu tartare, oyster aioli, beef tendon crisp"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/6omPqxobJqm-7NwiqgxEBg/168s.jpg", "caption": "Wagyu tartare, oyster aioli, beef tendon crisp, beef consommé with Vietnamese coriander and cinnamon"}]}}, {"review": {"des": "Absolutely superb experience. I love the aesthetics of the place; you enter through an old warehouse elevator into a revamped, yet still semi-industrial interior. While we were waiting for our seats, our hostess served us a complimentary drink and told us about the history of the restaurant and the chef's vision.<br><br>Okay. Now for the food. TL;DR, the tasting included many courses and everything was phenomenal so I will only highlight the creme de la creme:<br>Puffed beef tendon with wagyu tartare: Beefy flavors all around and the tartare was quite possibly the best I've ever had.<br>Capellini: Quite possibly the best pasta that I have ever had in my life. The umami factor was maximized with the amazing truffles as well<br>A5 Miyazaki Beef: My favorite dish of the night despite how small it was. I've had A5 Kobe beef in Japan that set the ceiling which no other beef could ever surpass. That was until I had this Miyazaki beef at Oriole. What I thought was melt-in-your-mouth from the Kobe beef was nothing compared to this. The tenderness paired with the unique flavor of the beef has set a new ceiling.<br><br>All-in-all, this was quite the experience and has easily taken the #1 Best Meal of All Time spot in my heart (for whatever that's worth!)", "pics": null}}, {"review": {"des": "Definitely deserves its Michelin stars. Exceeded all expectations. Michelle our waitress is the bomb and made our evening fun and special. Even during the meal, I was trying to find reasons to come back....run back....to Oriole. Such a good meal. Amazing.", "pics": null}}, {"review": {"des": "We got in here just before they were suddenly awarded two Michelin stars and I'm not at all surprised by the award. This is a serious tasting menu of interesting and delicious food. There were no serious mis-steps. The service was efficient, unobtrusive, with just a hint of warmth. AND -- and this is a thing people who write about decadent tasting menus don't talk about often enough -- they were efficient. I was so happy that they managed to get us in and out in only two hours, without ever making us feel rushed.  The word that keeps coming to mind for all of it is \"impeccable.\"  <br><br>(There's almost no point in reviewing specific dishes since they change and you have no control over them anyway, but I'll just say that I loved the caviar (not usually a favorite of mine), the oyster (always a favorite of mine), the hamachi, and most of all the wagyu beef with charred lettuces and charred onion dust -- simultaneously one of the most unctious pieces of beef I can ever remember eating and the best application of \"char\" I have encountered in a fine dining restaurant.)<br><br>Now for comparisons:<br><br>I know it is a hobby horse of mine, but I still can't believe there is a just world in which Grace gets three Michelin stars while this place only gets two. If you are thinking of going to Grace, you should go here.<br><br>Perhaps the most apt comparison is Sepia, which has a similar impeccable sterility, but Oriole takes it up a notch (in magnitude, in impeccability, and in price).<br><br>But the comparison that is the most on my mind is Elizabeth, since it is the last place of this scope and price range that I've been to, and the one that turned me around on superfine dining in Chicago. And this is a tricky one. The total level of sophistication and technical skill is just higher here, I think. But that comes with a price -- a lack of the madcap flirtatiousness that makes me eager to go back to Elizabeth, but not so sure I need to come back here right away.<br><br>But look, I can't afford to go to places like this that often and you probably can't either. If you have a special occasion you want to commemorate, you can't go wrong with Oriole. It is impeccable.", "pics": null}}, {"review": {"des": "Lovely food. Great staff. Attentive service. Nice ambiance, albeit not private -- with lights zooming on my shiny freshly shaved bald head.<br><br>18 dishes served as 12 courses.<br><br>The first series were a delight to look at and eat. Not shy of flavors. The nigiri of kampachi (?) was - OMG - wish i could have ordered extras. <br><br>The spring roll was gorgeous and tasty. i put my guards down after that and knew i would enjoy my meal.<br><br>After my shitty dinner at Grace, I have been real guarded going to fancy places, wasting time and money and feeling like a food.  This was no Grace!<br><br>A couple of dishes, in particular sea urchin and saffron, beautiful but way too salty.<br><br>Savory dishes:<br><br>The wagyu steak melted in my mouth. was gorgeous and tasty.<br><br>The pasta course was so fatty and creamy that frankly i did not taste any of the pasta, nor felt the texture of it.<br><br>The lamb was nice but both the sauce and the \"preserve?\" were way too sweet.<br><br>Overall these two last dishes, felt overly heavy, and not for good reason. (even though a couple of hours after returning home i had to have chips, guacamole and salsa from whole foods!)<br><br>Deserts were nice. I cannot say I died for any of them.  Many thanks for the coconut pie at the end. I ate it driving home!  That was my favorite (yes, i'm a country boy) ....I made a mess on my Yohji Yamamoto pants but what the hell, loved it.<br><br>Good staff. Glad the explanations did not go long.<br><br>Also many many thanks for the birthday card with all the signatures. How sweet.<br><br>Menu $190 per person was reasonable/fair.<br>(Thank you Kevin for suggesting I go to Oriole)<br><br>Overall, I am happy I had the opportunity to have this meal. I will absolutely go back to Oriole and hope to leave it next time with 5 stars.<br><br>Nice way to end 2016.", "pics": null}}, {"review": {"des": "This was our last fine dining experience before my wife gave birth to our daughter. So to speak, we wouldn't be able to enjoy their alcoholic pairing, which sounded and looked spectacular from the guests next to us.  <br><br>About a month after we made our reservation, Oriole became a new 2 star restaurant in the 2017 Michelin guide. Overall, I am impressed with their presentation and services. However, I felt that the course menu lacked coherences, and the flavors did not connect. Rather than a continuous flow of dishes, I felt like that I was given many tasty plates of tapas. My favorite course was the pasta course- when the chef shaved the white truffle in front of me, the aroma literally hit me in my face. Don't take me wrong, every dish was delicious and on point. Over, I really liked this place, and at the same time, I see the potential for them to reach the next level.", "pics": null}}, {"review": {"des": "My husband and I were celebrating our 18th anniversary and had a truly wonderful time! The space is intimate and charming. You are greeted with a delightful light cocktail and escorted to your table. The service was truly immaculate, the wine list very approachable and the food just exquisite. My husband and I are foodies and I would say this was a top 5 experience for us. Definitely not to be missed.", "pics": null}}, {"review": {"des": "Oriole's been on my watch list, so when my birthday was coming up, coinciding with a milestone celebratory occasion, I luckily snatched a last-min friday dinner resos and was so looking forward to the meals...<br><br>Love the hidden place, the garage door entrance, the minimalists decor, the intimate settings...the dishes were good...the presentation were artistic, the quality of the ingredient is top notch, but perhaps I had such high anticipation of the night and recently visited another new comer in the same category in the area that it made Oriole nothing unusual or memorable...even in a way, it feels stuffy and pretentious...like as if we were at a high end place in year 2000....", "pics": null}}, {"review": {"des": "Fantastic meal, fantastic service, down to earth chef Sandoval and pastry chef Kwon.<br><br>No misses in this tasting menu. Everything was great. They even noticed that my husband ate with his left hand and started placing his utensils accordingly. <br><br>This place is about good food with elegant plating.  Plus at the end we received even more dessert to go, which my husband gobbled up happily as soon as we got home. We will definitely be heading back again. <br><br>We celebrated our anniversary and the restaurant was so sweet to give us a card where the staff signed it.  Thank you for a wonderful evening Oriole!", "pics": null}}, {"review": {"des": "Amazing..... Truly impressed. Unique, inventive, satisfying. Service was great as well. The staff was professional but also down to earth. Highly Recommended - A!", "pics": null}}, {"review": {"des": "It was my first time in Chicago when I got hungry and tried their delicious delicacies. I have some kind of allergic to some ingredients back then but this lovely restaurant caters my needs and customized my order. It was also nice meeting Chef Sandoval who has the special techniques for their savory dishes. Will always go back to this place. A must try.", "pics": null}}, {"review": {"des": "Perfect meal start to finish. Staff was wonderful, good was the best we've had in the city. Can't wait to go back", "pics": null}}, {"review": {"des": "It's unquestionably a great restaurant. Much of the food is impeccably delicious, with only a couple of less than dazzling courses. But for what you are spending it felt like the wine pairing could have been more ambitious, there should be more courses, and the general lack of warmth about the place is just slightly off-putting. Other, similarly ambitious Chicago restaurants provide a stronger memory.", "pics": null}}, {"review": {"des": "Presentation, execution, service, taste, and experience were simply incredible. Go.<br>That's all you really need to know.<br><br>We celebrated our 30 years on earth at this place and I couldn't imagine a better dinner. Thank you Oriole staff for such an memorable experience.", "pics": null}}, {"review": {"des": "In a nutshell... hands down the best meal I've ever had! According to the menu, they served us 17 courses. Progressed like a typical meal. Appetizers, entrees, dessert. With each course, each one got better. I HIGHLY recommend this place to everyone, especially for a special occasion. Service was top notch. I think I counted 12 tables with about 10 servers. We had two consistently taking care of us. Very small intimate restaurant, with an open kitchen, which makes it exciting to watch the chefs do their thing. Last but not least, we were each sent home with an individual rhubarb pie which was divine. Bravo Chef Kwon. You are amazing.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/IZL-j4-_W4RLQr0XzB15FA/348s.jpg", "caption": "Menu for the night"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/l1XcGCN90I73ITRgr35KyA/168s.jpg", "caption": "Individual rhubarb pie to go. Very nice touch!!"}]}}, {"review": {"des": "Our menu:<br><br>First two courses paired with non-vintage Champagne, R. Pouillon et Fils, Brut Réserve<br>GOLDEN OSETRA CAVIAR     tomato sorbet, crème fraîche and sea grapes<br>Very nicely done, and not really like others we've had.  Went very well with the champagne they matched for it.  95/100<br><br>LANGOUSTINE     shio kombu, rhubarb and mint<br>Intense flavors well matched, also paired well with that champagne, which we fortunately had proper restraint to make last through our first two course, per recommendation of sommelier Aaron McManus.  95/100<br><br>This course was paired with Junmai Gingo Sake, Sato No Homare, \"Pride of the Village,\" from Ibaraki Prefecture, Island of Honshu, Japan<br>MADAI NIGIRI (Japanese Sea Bream)  yuzu, kosho and genmai<br>As I told our waiter, Sommelier Aaron McManus, it was as though we were eating at a Sushi Restaurant, the fish was so perfect!  100/100<br><br>Our oyster was paired with a very obscure wine from the Basque country of Spain; Getariako Txakolina is a white wine produced in small fishing towns on the Bay of Biscay, 2015.<br>BEAUSOLEIL OYSTER     iberico consommé and finger lime<br>My partner said this was perhaps the best oyster he's had so far.  For me, I have to admit it was the first time I was willing to try eating a raw oyster, and I quite loved it.  Nice and briny, well balanced, and again, well paired with recommended wine!  100/100<br><br>An Alsatian Riesling was chosen to match this ours; 2011 Doppf Grand Cru Schoenenbourg, where the soil conditions are keuper, marl, dolomite, and gypsum.<br>JAMON IBERICO DE BELLOTA     black walnut, egg yolk and campo de montalban<br>100/100<br><br>A French Chardonnay was next, 2014 Meursault from Patrick Javillier, \"Les Clousots,\" Burgundy.<br>ALASKAN KING CRAB     spring onion, orange cells and herbs<br>Beautifully paired flavors of wine and food made for a symphony of pleasure on our palates.  95/100<br><br>SOURDOUGH     cultured butter and local grains<br><br>A Californian Sauvignon Blanc was paired here, 2014 Habit Wine Company's \"McGinley  Vineyard,\" Happy Canyon of Saint Barbara.<br>CAPELLINI     Perigord truffle, rye berries and yeast<br>Another dish that made you feel you were in a restaurant that just specialized in the very best pasta.  For Perigord truffles, in summer, these were surprisingly tasty!  They seemed more the wonderful intense flavor you find in a winter truffle.  100/100<br><br>This was another perfect pairing, Pinot Noir of Burgundy in a 2013 Volnay from Alex Gambal.<br>JAPANESE A5 WAGYU     charred little gem, furikake and sesame leaf<br>Possibly the best Wagyu beef we've eaten so far, and as we've had it perhaps a half dozen times as some of the nation's best restaurants, that's saying a lot.  100/100<br><br>A 2011 Syrah named Mairlant from François Villard om the  Northern Rhône Valley.<br>HUDSON VALLEY FOIE GRAS     bay scallop, cherries and chanterelles<br>100/100<br><br>Our last savory course was served up with a 2014 Brachetto d'Acqui, \"Pineto,\" made from red grapes in Piemonte, Italy, by Marenco<br>LAMB BELLY     huckleberry, rapini and chermoula<br>100/100 - mmmmm<br><br>Desserts were accompanied by a 10 year old Otima Tawny Port from Warres.<br>MOCHI     yuzu and chamomile yogurt<br><br>GIANDUJA     pretzel lavash, raclette and black currant<br><br>CHICORY CUSTARD     whiskey, cinnamon and Tahitian vanilla<br><br>MIGNARDISES<br><br>Service, Ambiance, table, glassware, overall quality of meal: 100/100<br><br>These scores, which I truly feel were well-deserved, add up to an average rating of 98.75% - the highest I've given anyplace up to now, and there has been some STIFF competition!  Thanks for a wonderful meal, Noah and team; also, thanks to Lesley at Sixteen Restaurant for telling us about this place.  It was hard to find, but we know where it's at now!  If I've typed anything wrong, you're welcome to let me know.  This review is dense with unfamiliar words, and my fingers are very capable of making mistakes, especially where special characters are involved, like ç.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ALHSAe37D0lksdDerj--1w/348s.jpg", "caption": "This is the entrance to Oriole, inside you'll pass through the doors of a freight elevator, but  you won't go up or down on it."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/l6xFO8N2YmKiXFRnj8XmQQ/168s.jpg", "caption": "Cara Sandoval, my partner Mitchell, and Noah Sandoval"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/uJp5mw3Z6DLe_BoLlTudcQ/168s.jpg", "caption": "My other half, Mitchell, with Chef, Noah Sandoval"}]}}, {"review": {"des": "It's difficult to express just how amazing our experience here was. From the very second we walked through the door we felt special. I kept telling our server Michelle that I wanted to live there and she just kept laughing at me! Every morsel of food I ate and every sip I drank was a moment to remember. I hate when people say that food changed them or food is emotional, but I felt feelings here. I'm allergic to oysters, so one of my courses was substituted with a burrata dish and it was that- the subbed dish -that made me put my head in my hands and make a weird noise about how I didn't believe food could make me feel like that. If you don't go to Oriole and experience these flavors you will be doing yourself and your life a disservice.", "pics": null}}]}