{"name": "osteria-via-stato-chicago", "reviews": [{"review": {"des": "Their Sunday brunch buffet is the bomb. For $35/person, you get unlimited mimosas and honestly one of the best brunch buffets I've ever had. There were so many different options to choose from, ranging from a meat and cheese table, traditional breakfast food (bacon, egg casserole, sausage, breakfast potatoes), pastries, and a meat carving station. The meat station was phenomenal. They had pork belly and prime rib, and both were so juicy and flavorful. Typically buffets end up a little \"meh\", but the food was so good. <br><br>Also, our server was really friendly and didn't make us feel like we had to leave right away. He kept the mimosas flowing, and generally took really good care of us.<br><br>Hands down, best brunch buffet I've had in the city (knocks the socks off of the Fremont buffet). I'll definitely be going back. <br><br>Only minor critique...please add more bathrooms in the downstairs level! Trekking upstairs to the mezzanine of the hotel is not ideal.", "pics": null}}, {"review": {"des": "Went for the Italian Brunch Buffet this morning.<br>$34.95 per person includes unlimited food & mimosas.<br><br>Food Stations:<br>*Bread pieces, couple of meats, grapes, pineapple, fresh roasted garlic, caesar salad, plus a few other items<br>*French toast, bacon, italian sausage patties, chicken thighs, pasta with spinach and red sauce, roasted crispy potatoes, roasted Bussels sprouts <br>*Carving station with pork belly and beef that also included cooked to order omelettes with a choice of approximately 6 ingredients <br>*Desert station with fried doughnuts and a few other deserts (I'm not a desert person, so I only glanced at the spread)<br><br>Overall the brunch buffet was good. <br><br>My favorites: italian sausage patties, pasta, potatoes & unlimited mimosas<br><br>I definitely got my mimosas ON. I was a lil tipsy after one...the 5th one!<br><br>Our server, Earl, was fantastic! He was very attentive, friendly and very professional. He seemed to provide consistently great service to all of the tables. <br><br>Generally speaking, I am not a fan of buffets. But, for $34.95 plus unlimited mimosas, this is a pretty good deal!", "pics": null}}, {"review": {"des": "I came here for their Sunday bottomless brunch & mimosa. For $35/person, you get unlimited brunch AND mimosas! <br><br>Our waiter, Earl, was top-notch! He thoroughly described the location and details of each station. Earl constantly checked up on us, refilled our water, asked if we wanted coffee and mimosa refills, changed out our utensils after each round, and folded our napkins whenever we stepped away from the table. His service exceeded my expectations. He is also very personable and made small talk with us which we enjoyed. <br><br>The food selection was pretty good. I really enjoyed the meat pasta. The pasta was Al dente. The pork belly was excellent! The little donut holes were really soft and perfectly sweet. I also really liked the salmon and variety of cheeses. I feel like buffets can get pretty overwhelming but it wasn't at Osteria. There was a good variety and I was very satisfied.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/oA3ykFe7qN7jyfFa8tLYDw/348s.jpg", "caption": "Carving station & Omelette station"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/a1bFjpvuErIOgriRbFbaeA/168s.jpg", "caption": "Dessert station"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/eEn0oJky4xJnWuIeG8-QHg/168s.jpg", "caption": "Charcuterie"}]}}, {"review": {"des": "I was really looking forward to trying Osteria Via Stato. I had tried to get reservations a few times in the past but hadn't been able to. Finally was able to get reservations for two on a Friday night. The ambiance here is nice, which is pretty standard for Italian restaurants. They seated us in this cute alcove like space. The restaurant was packed at this time.<br><br>Although I was excited to try this place I felt pretty let down by their food. Everything was soooo average. We started with mini veal meatballs ($11.95) and heirloom tomato caprese ($12.95) which is burrata cheese with tomatoes. I normally LOVE burrata but this one was disappointing. Usually when you cut burrata there's a delicious creamy interior which is so rich in flavor. This one didn't have that at all. It just didn't seem fresh and if anything it seemed a bit chewy.  The meatballs was prob the best dish of the night but also kind of average. Portion of meatballs was quite large.<br><br>For drinks I tired the watermelon daiquiri which I didn't like (the taste was quite sour and unpleasant) so our waiter was nice enough to change it out for a white wine sangria which was pretty good.<br><br>For the main course, we ordered the hand rolled gnocchi ($17.95) and the pacheri ($18.95). The gnocchi was in my opinion below average - chewy and the entire dish was not that flavorful. The pacheri was recommended by our waiter. It had large pieces of pasta with pork. This dish was flavorful but really oily and for some reason didn't taste fresh. Both of these dishes were good sized portions. <br><br>We had come for a special occasion so for dessert they gave us a slice of brownie. The texture of this brownie was also chewy and it was a bit cold. We ate 2 bites and left the rest. <br><br>Overall in my opinion I think Osteria Via Stato is overrated. There are other much better Italian restaurants in Chicago. Service is good though and staff is nice. But it's not worth it for the food.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/SrPiVSrI-adJg4dmE94q5w/348s.jpg", "caption": "Mini Mini Veal Meatballs"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/uYeMVZScZtnV9TtBN9-dSQ/168s.jpg", "caption": "Heirloom tomato caprese (burrata)"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/FyYlqMimpeUSI0X9P8FuSw/168s.jpg", "caption": "Gnocchi (left) and pacheri (right)"}]}}, {"review": {"des": "I met up with friends for dinner here and it was absolutely fabulous! Located in the heart of the River North district on State and Ontario is this awesome find. As most know, parking in this area is a bear, but fear not, for their valet service is top notch. <br><br>The restaurant is divided in 2 -- one side being the osteria and the other the pizzeria. We were warmly greeted upon arriving and decided to dine in the pizzeria side. The decor is so warm and inviting, it has an intimate Italian tavern feel to it. It's amazing how the vibe totally tunes out the hustle and bustle of State St. Their wine list is exceptional but I recommend trying their limoncello, which seems to be their specialty. Ask for recommendations from your waiter and you will not go wrong! <br><br>We started off with the antipasti board, prosciutto jam, house marinated olives, and grilled octopus. Everything was great but my favorite had to be the prosciutto jam. It was robust in flavor and complimented the goat cheese excellently. For the main course I went with the chicken Mario and was so pleased I did. The chicken was perfectly seasoned and cooked, with a juice interior, and pan seared in the end to give it a crispy exterior. It was simply delicious and served with greens and a lemon butter sauce. This easily became my favorite dish of the week. It was simple yet so flavorful and light. I definitely recommend it. <br><br>I can't wait to come back to try their specialty pizzas. This is definitely on my list for a future date night!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/CdYbb3YK_6qtcWjFABrzMw/348s.jpg", "caption": "Chicken Mario"}]}}, {"review": {"des": "My favorite Italian restaurant! I'm so glad I tried this place while visiting Chicago. I got a side of fingerling potatoes and rigatoni pasta. This was THE BEST potatoes and pasta I've ever had! The potatoes were extremely crispy, it was almost like eating gourmet fries. The rigatoni pasta isn't on their menu but I saw a photo on yelp and showed my server, and he was able to get it for me!! It was amazing, a bit on the salty side but it had so much flavor. I ate so much and I wish I could eat more since it was so good. The food was too delicious I couldn't stop eating that I became uncomfortably full afterwards LOL <br><br>Also, the free bread and roasted garlic in olive oil is to die for. The bread is so fluffy and perfectly crispy, and the oil is amazing. I love this place so much. I'm so sad I'm leaving the city tomorrow. If I'm ever in Chicago again I'm definitely coming back!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/lsGeqBRrtF0vS4LdZo9t_A/348s.jpg", "caption": "Fingerling potatoes"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ASl8BnV1T3tE8v95W_3gAA/168s.jpg", "caption": "Rigatoni"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/p0ZRlt8y7C2sPa7M8Mw9tg/168s.jpg", "caption": "Free bread and roasted garlic olive oil"}]}}, {"review": {"des": "I really love this place. The service is A+++. Our server was Earl. He was so fun and energetic. We had non-stop service at all times. My water was always filled to the top. My coffee was always filled to the top as well. I came here with a group of four for the lunch buffet. The lunch buffet I believe is around $35 per person. In between each time we got up to get a new plate at the buffet Earl would make sure that we had new utensils by the time we returned to our table. I cannot believe how good the service was. I honestly would come back just to have Earl service again. The buffet was simple delicious and straightforward. It had all the essential things and I like how it is very simple in comparison to other buffets. I felt like I had a little bit of everything. They had steak, pork belly, make your own omelette, pasta, bacon, potatoes, an assortment of cheeses, and lox. Also included in the $35 per person Buffet is unlimited mimosas. I would highly recommend this place as each item was super delicious. Honestly I just couldn't believe how good or service was. If if anyone were to come here ask for Earl.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Ts1roQYdTM7COAJoIal5bw/348s.jpg", "caption": "My plate!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ATDaa46269L6HlHF-yCfpw/168s.jpg", "caption": "Cheese bar"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/UU8jekH2oml3CVWJWbD-4g/168s.jpg", "caption": "Make your own omlette, steak and pork belly"}]}}, {"review": {"des": "Went there for brunch and was very pleased with the service and selection of food! Amazing place. Will definitely come again.", "pics": null}}, {"review": {"des": "Osteria Via Stato used to be one of our go-tos. The food was excellent, and the portions were good. Not sure what happened, but their quality has completely gone down hill. <br><br>They've now screwed up two orders in a row. Last order, they forgot to add one of our pasta entrees. When we called to let them know, their response was to refund that item and wouldn't re-deliver it. So, we had to re-order it and pay delivery service fees for a second time. Not cool when one of your family members doesn't get their meal and has to wait another hour for it to be delivered. But fine, mistakes happen, we'd give them a chance to fix it. <br><br>Today's order: didn't include any bread, forgot to include dressing for the salad. Octopus was completely undercooked and inedible. Pasta  (mushroom cavatelli) portions were maybe a third of what they used to be (to the point where they didn't even cover the bottom of the take-out container), were swimming in broth, and had only one wild mushroom in each. This used to be one of the best pastas in the city, so this is really disappointing. <br><br>Save your time and frustration. Order from a restaurant that cares enough about its customers to check orders and make sure they're prepared and packed correctly. We won't be making a mistake on this place again.", "pics": null}}, {"review": {"des": "This review is for a pizza event I attended at this place. The staff here was so nice and always made sure we had a drink in our hand and pizza on our plate.<br><br>The pizza was amazing. All of them had good flavor. My favorite pizza was the prosciutto. I loved how the balsamic and paramesan cheese complimented the prosciutto. When you come here, you must have the Peroni beer since it is on draft. <br><br>The place is cozy on the inside and they also have al fresco dining. This place is connected to the embassy suites so it is convenient for hotel guests. I  wish they had more than one toilet for customers. <br><br>I saw they have a private dining room as well which would be good for events.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/rvu1q59UQVcB6MK7plsWPw/168s.jpg", "caption": "Peroni on draft and margherita pizza"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Zl1g0nVyBiUm52Ov-S__Pw/168s.jpg", "caption": "Margherita pizza and Quattro formagi"}]}}, {"review": {"des": "On a cold Chicago evening that caught everyone by surprise (it was a chilly summer evening in June!) I came here with my good friend Maddie and our dogs. We had some trouble finding dog-friendly patios that were open for dinner but thankfully, we made our way to Osteria Via Stato and they welcomed us warmly.<br><br>Our server checked on us frequently, which was nice because we were the only table seated outside. Walking through River North, the sudden drop in temperature led a lot of restaurants to close their outdoor seating section. Our server, shivering in a short-sleeved shirt, 'braved the cold' to make sure we felt taken care of.<br><br>I describe the weather to give a shout-out to their staff, who showed us impeccable service and didn't make it a big deal to service the sole table with 2 girls, each with a dog in their lap :) Our pups kept us warm, they were accommodating, and I am so glad we wound up at Osteria Via Stato.<br><br>Between the two of us, we shared:<br>+Grilled Octopus<br>+Spaghetti & Meatballs (parm on the side)<br>+Vegetable Pizza with Pepperoni Add-On<br><br>My favorite was the spaghetti and meatballs. If I come back, next time I would order their gnocchi or risotto, and their seafood stew. My hunch is that any pasta you order here will be delectable and an easy favorite. The other two items we had were less of a highlight for me.<br><br>They were out of their wine special ($10) and a beer Maddie wanted, but our server was able to make comparable suggestions. I had a glass of prosecco and Maddie tried a lager. Overall, it was the best way to end a Saturday, in the open air, Italian food, drinks, friends, and pups all within arms reach. Grazie!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/AOD2HJmfkZxHDV8F0qtxCQ/348s.jpg", "caption": "spaghetti & meatballs"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/VZAPEOglEVy4ENYH6IuI7g/168s.jpg", "caption": "the spread"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/mmrAqXyhYhCuNSAfG2yF8Q/168s.jpg", "caption": "vegetable pizza with pepperoni add-on"}]}}, {"review": {"des": "The drinks? Eh. The pasta? Meh. The pizza? Holy shit it's good. <br><br>If you're looking for a contender for the best pizzeria in Chicago, I think this restaurant fits the profile perfectly. <br><br>We got the prosciutto americano and the peppered bacon pizza. Both pizzas were delightfully crunchy, and not too greasy either. The prosciutto americano was the highlight of our meal - I've never had such a unique tasting pizza that's bursting with such contrasting flavors. The sourness of the vinegar, the saltiness of the cheese, the leafiness of the arugula, and the light prosciutto together produces a wonderful sensation in your mouth. The satisfying crunch after each and every bite is the finishing touch of the experience. I highly recommend others getting this dish when they come here. <br><br>The peppered bacon pizza was a nice complement to the prosciutto americano - it was much more different in taste in that it was a bit more greasy and resembled more of a traditional average pizza, but it was still incredibly delicious. The egg in the middle adds a nice flavor to the pizza. <br><br>Do come visit this restaurant when you're hungering for some high quality pizza!", "pics": null}}, {"review": {"des": "Came here for lunch on a weekday around 11:45am. It wasn't busy, with a handful of tables taken up, so we were seated right away. <br><br>They have a killer lunch special for $10! <br><br>But We opted for he octopus appetizer, and for our entrees the mushroom capatavi, a pizza with ricotta, spinach, and sausage.<br><br>The octopus was tender and well seasoned! And the potatoes were to die for! It was in a lemon vinaigrette and that definitely made the dish! <br><br>The mushroom capatavi was delicious. I usually don't care for mushrooms, but I just wanted more in each of my bite! <br><br>The pizza was okay. The sausage was delicious, but the pizza was lacking in salt, so I covered it in Parmesan, which helped, but it left me wanting something else.", "pics": null}}, {"review": {"des": "Eat dessert first because you don't want to miss out on the chocolate tart. Incredible. I also had the Cacio E Pepe. It was good, not incredible but it was good.", "pics": null}}, {"review": {"des": "Wow, this place is absolutely amazing! I came here for a corporate event and they had a variety of dishes for us to sample. We had some bread with garlic oil, antipasti board and olives to start. We then received three appetizers to share at the table, two pasta dishes to share at the table, a personal main course and a personal dessert. It was a ton of food and I rolled out the front door happily after my meal was complete. <br><br>For the appetizers, we got the calamari, veal meatballs and some sort of salad. All of the dishes were delicious, but those veal meatballs were fondue for. We ended up asking for another one of those because it was just so good. <br><br>For pastas, we got the Hand-Made Tagliatelle and Pappardelle with Three Meat Ragu. Both were fantastic. I actually think we received the crispy potatoes and steamed spinach on the side as well. There was a lot food my friends. I'm still not done telling you all about it yet. But we are close! <br><br>For my main dish, I ordered the short rib. It was incredible - it melted in your mouth perfectly and the flavor was just to die for. But at that time, I was so full from everything else, I couldn't finish the whole meal. I AM SORRY OSTERIA, I TRULY LOVED IT I SWEAR! I also got dessert, but I  couldn't touch it. I was way too full. The chocolate tarte looked good though. <br><br>Service here was phenomenal btw. I think the servers were shared between the private dining room where we were and the public dining room out front. Given that the whole restaurant was packed, they did a great job making sure we had everything we needed and kept our wine glasses full all evening long. Definitely coming back again when I'm in the area!", "pics": null}}, {"review": {"des": "Wow, what an awesome dinner my husband and I had here on Saturday night. Not only was it reasonable, but it was delicious as well. The bread that we had to start was super warm and so yummy!  I had the White Peach Bellini to drink and my husband had the Sangria. Both were great.  For my main dish I had the Penne and the Whipped Potatoes (don't judge me, I like carbs, k?) and my husband had the Seafood Stew. We loved both dishes (hubs loved mine a bit too much as he ate most of it). For dessert we had the 3 gelato flavors- Vanilla, Burnt Caramel, and Espresso. Loved all 3 flavors but especially the burnt caramel. <br><br>Service was also fantastic throughout our entire time here. Don't let the fact that this restaurant is connected to a hotel fool you. This is a quality Italian restaurant and we be back for sure!", "pics": null}}, {"review": {"des": "We came in for an quick dinner. It was weekend, supper hours and we got seated very quickly. <br> <br>The attentive and well dressed staff were first to get my attention. <br><br>Ordered two kinds of pizzas and the marinated olives. <br><br>Now where my unsophisticated soul prefers dominoes on any night, I wasn't expecting much out of the pizza Osteria had to offer. Was I mistaken...<br><br>The vegetarian pizza with marinara had great bite to it, fresh and lovely. The breakfast pizza had an runny yolk style egg on it so I stayed away but I heard my friend enjoyed it to the fullest. <br><br>As for the marinated olives...again my unsophisticated palate had issues but surprisingly I really liked them.. perfectly tangy, soaked in olive oil. A tiny treat. <br><br>Ambiance is great, quiet. Staff was attentive like I said, refilled our drinks quickly..was courteous and guided us along the menu.<br><br>- Would love to return to try the chef's full menu in the different room as well as the home made gelato.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ZJXVCvQ6FN_HyNhrUgWbEA/348s.jpg", "caption": "Happy friends"}]}}, {"review": {"des": "I came here for a business lunch and was pleasantly surprised. I didn't expect much since it's adjacent/kind of connected to the Embassy Suites but it turned out to be really fantastic! <br><br>We had the Warm Ciabatta Bread and the Antipasti Board for appetizers. Both so yummy, I really enjoyed the white bean spread on the board and the whole roasted garlic cloves in the bread dip. I had the Veal Meatball Sandwich for my entree and it was really great. I would definitely order it again. My companion ordered some type of pasta that looked yummy as well!", "pics": null}}, {"review": {"des": "Excellent Food. Friendly service! Cozy ambience! Great location . Can't wait to plan a gathering there again for friends & family !", "pics": null}}, {"review": {"des": "\"When life gives you LEMONS make LIMONCELLO.\" According to Osteria Via Stato.<br><br>This is exactly what everyone who attended the Limoncello Course at Osteria Via Stato did on July 22, 2017!  Participants learned how to make limoncello \"the Italian way.\"  The course highlighted the restaurant's Chef David DiGregorio's 'cello program which is seasonal and highlights various fruits and ingredients which are infused with grain alcohol or Vodka at their peak.<br><br>There were approximately fifty people in attendance and the course was $20.00 per person. The course provided an informative history of Italian limoncello production from the regions of the islands of Capri, Ischia, and Procida; the Sorrento region; and the Amalfi Coast.  The course was based upon Osteria Via Stato's house made recipe and tasting the process of limoncello as it evolves over time.  All participants also received a complimentary recipe card and a generous sample of house made and creatively bottled limoncello to take home.<br><br>Participants were seated at tables and learned the steps of successfully peeling the skin from lemons ensuring not to have any pith or the white part of the lemon rind in the peeling process.  Participants then were walked through the process verbally and tasting wise with the production of limoncello.  Participants tasted what the process was like at three days, one week, and finally the finished product.<br><br>Upon the completion of the course about limoncello preparation, the class was provided with tasting samples of seasonal raspberrycello and chocolacello.  <br><br>The course was lead by Wine and Beverage Manager Matthew Dolin.  Mr. Dolan gave a thoughtful and informative introduction and overview of the process after which he circulated around to all of the tables engaging in pouring the cellos and interacting and answering all questions by participant guests.  Mr. Dolin also stated that this was the second year that Osteria Via Stato has held this course and that it is open to the public.<br><br>I wish they would offer this course on a more regular basis as they make other seasonal cellos such as blood orange cello and grapefruit cello which would be fun to sample.<br><br>The cellos (Limoncello, Chocolacello, and Seasonal Cellos) are available on the Osteria Via Stato Dessert Menu at the restaurant listed under the \"Digestivi & After Dinner Drinks\" under the section of \"House Made Liqueurs.\"  <br><br>Truly a magnificent and unique concept for a Chicago Italian restaurant to make house made limoncello and other cellos and to invite the public in to learn about and enjoy \"the fruits of their labor.\"<br><br>FYI-Fun Facts<br>1. Limoncello should be served cold<br>2. In Italy unique cellos such as Limoncello of Pistachio are available<br>3. It is my understanding that individuals can purchase limoncello or their seasonal cellos by the bottle by calling the restaurant in advance as the restaurant makes cellos on a regular basis.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/UwycaoNx2DWDOIaICJRLCw/348s.jpg", "caption": "Matthew Dolin, Wine and Beverage Manager pouring the limoncello during the Limoncello Course"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/8kqev0F6GZF1zMU85D1k7g/168s.jpg", "caption": "Table Setting for Each Participant"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/KFwxbVd0Z9PijuEJYMZcmg/168s.jpg", "caption": "Tasting the evolution of limoncello over time=Finished Product"}]}}, {"review": {"des": "Omg I love this place. Not necessarily for their menu items, but for their BREAD. Literally I have come here 4+ times just for the bread. It comes with the table, is olive oil-sea salt, and is warm and crusty. And the kicker? They serve it with this crazy garlic-olive oil concoction they brew in their oven for hours. The garlic basically is melted into the oil and then topped with balsamic. It is straight up spreadable. I honestly eat so much of that combo that I am mostly full by the time I get to the gnocchi, which I think is the best pasta on the menu (having tried a handful or so). Honestly, the seafood pastas and other red sauce pastas pale are quite average compared to the pillowy, plump gnocci. They've got a pretty good wine list and a multi-course dinner as well as their a la carte menu. Would recommend if you're trying to carb-load :)", "pics": null}}, {"review": {"des": "My husband and I came here yesterday for a date night. The food was pretty decent, but I found it to be overpriced for the quality (which was really disappointing because Lettuce restaurants are pretty reliable for their good value) and we had a bizarre service issue. I will come back to try the pizza, but we a pretty much done with the entrees. Here's what we ate:<br><br>Bread with Balsamic garlic: SOOO yummy. I am not typically a bread eater, but this combo was definitely worth it.<br><br>Calamari: Ehh. The marinara it  was served with didn't seem like the best pairing. After a bite or two we started fantasizing about the seasoning and dipping sauces the come withe the calamari at cafe baba reeba. Also, this came with a single two inch piece of toasted bread...which was super confusing (I think it might have been accidentally added to the plate because it was so disproportionate to the volume of calamari served).<br><br>Salmon and Shrimp with lobster sauce (special): This dish was PERFECTION. The salmon was cooked perfectly;  the lobster sauce was creamy and delicious; everything worked well together.<br><br>Scallops over sweet potato mash: The scallops were slightly overcooked (this is a pet peeve of mine). I think the issue was that the brown butter they were booked it was a tad too brown when they were seared. The sweet potato mash was over salted and had a weird combo of overbrowned root veggies and bacon on top...this were overpowering. I would probably rethink this dish entirely. Probably put the scallops over a nice risotto or something more mild that it's easy to taste them.<br><br>Black Old Fashioned: My husband thought this was excellent.<br><br>Ricotta cheese cheesecake: Italian fudge sauce is like an oxymoron. Fudge is not an italian thing (we asked for the fudge sauce on the side). The fudge sauce was good, as was the cheesecake itself, but the kitchen kind of ruined the dish by sprinkling a ton of powdered sugar over the dish/cake. This is a huge no no in my book...kind of like the dreaded mint leaf some places add to a dessert. It was an absolute turn off; not an attractive decoration...just don't do it!<br><br>Service issue: We asked our server for straws on two separate occasions. He forgot both times and wouldn't acknowledge that he had been asked. After the first half of the meal, I assumed he was swamped and  I ended up leaving the restaurant and going to the bar to get straws for the table. He saw me walking back with the straws (I smiled at him and held them up)  and didn't say anything...even when he served the rest of the meal, it was very odd. I let it go, but my husband was pretty annoyed.", "pics": null}}, {"review": {"des": "A friend wanted to bring the guys out for dinner at one of his latest finds for good Italian food, so we made the trip to the city to give it a shot.<br><br>The restaurant is located in/next to Embassy Suites, but do not let the location fool you, this is not your typical hotel restaurant.<br><br>They had a very nice but crowded sidewalk seating area, we preferred to sit inside and were led through the bar and into one of a few back dining rooms, which were spacious, nicely decorated and had beautiful brick arches that made it seem like we had just walked into Italy!<br><br>My brother and I split a Caesar salad, we liked it and thought the portion size was just right to split. I really enjoyed their bread and oil, plus the (roasted?) garlic cloves they give with it.<br><br>I had a glass of wine from the northwestern Piedmont region, which was nice and dry, flavorful, and enhanced by probably the biggest bulb on a wine glass I've ever seen.<br><br>Each of us ordered our own dinners. I had the short ribs with a side of pasta cacio e pepe, my brother had the wild mushroom ricotta cavatelli, friend 1 had chicken Mario, and friend 2 had a meatloaf special. Everyone thought their food was fantastic! The pastas are all clearly handmade, cooked perfect al-dente and were super flavorful. The last time I had cacio e pepe was in Rome last summer, and I was very impressed at how close Osteria Via Stato's was to what I remember having. Spot on!<br><br>My short ribs were also delicious. Perfectly melt-in-your-mouth tender with a nice zing in the wine sauce, as well as the potato puree on the bottom. I've had quite a few amazing short ribs, and while this one isn't #1, it is definitely towards the top of the list.<br><br>The service was another high point of our dinner. Although it did take quite awhile for us to get our food, we were in no hurry and our server, whose name escapes me, took good care of us as well as was engaging and even a little witty and funny to our group of 4 younger guys. All too often servers are too quiet, and sometimes even too talkative, but this was perfect.<br><br>Overall we really enjoyed our dinner at Osteria Via Stato. It is a straightforward place with a simple in a good way menu, high quality ingredients and good service. It isn't exactly inexpensive, but many choices are very reasonable, and they have an interesting family style prix fixe option as well.<br><br>A nice, easy option for quality River North Italian food without splurging.<br><br>Will be back for sure!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ZVnA6V0CzcP8tnvVRfXqrw/348s.jpg", "caption": "Short ribs and cacio e pepe"}]}}, {"review": {"des": "I was hoping it would be good... menu looked promising. My scallops were loaded in butter and not much else. <br><br>Mediocre, average Italian. It's passable but I wouldn't say it's an Italian experience. Sorry guys and our waiter was MIA for the majority of our $150 for 3 people meal. <br><br>End of the day- if there's nothing else available you can probably find something but I wouldn't seek this place out.", "pics": null}}, {"review": {"des": "I have to say I've eaten at a lot of the hyped restaurants in the city and when my friend arranged reservations for Valentine's Friday for me here I wasn't totally excited.  The website made the location seem mundane even though the menu looked pretty solid.  Was I ever in for a surprise as soon as I stepped in the venue.  <br>As soon as we checked in the manager Matt greeted us and took us to our romantic table.  The delicious complimentary ciabatta and balsamico/olive oil/roasted garlic came out which blew our minds to start.  The bread and roasted garlic was just so fantastically delicious.  <br><br>Our server was fantastic and brought us out two delicious glasses of Pinot.  We had the meatballs and grilled calamari appetizer.  The meatballs were tender, unctuous, delicious with a perfect bright and fresh sauce.  The calamari was grilled perfectly tender, no rubbery chewy texture at all and it was complimented by delicious fingerling potatoes.  <br>For mains we had the spaghetti diablo with salsiccia which was bright, smoky, and fresh.  The short Rib was fall apart tender and the buttery smooth potato purée was a fantastic compliment.  We finished off with the flourless chocolate tart and budino both of which were mind blowingly good.  The tart was thick and fudgy with delicious candied orange peel.  The budino was thick, creamy, and just the right amount of sweet without being cloying.  The texture of both desserts made you want more and more.  <br><br>We both agreed that this is somewhere we would definitely bring our family from out of town.  They like good food in a more quiet and relaxed yet romantic atmosphere.  I can't rave enough about the service which was incredible.   Cheers to Lettuce Entertain You for such an awesome dining experience!!", "pics": null}}, {"review": {"des": "Impressive for a commercial type restaurant. Certainly not the best but very good.  <br><br>The Octopus appetizer was quite good as was the scallop entre.  The other entre risotto was also nicely prepared. My issue probably was the limited menu and the service while good but everything felt very pedestrian.  Had a Monsanto Chianti which was very reasonable at $40 and very good (over 92 pts. WS).   Stay away from the Parmesan Regiano appetizer which for $12 is only a few chunks of cheese.  <br><br>They do have a nice area for outdoor seating which is recommended in the summer.", "pics": null}}, {"review": {"des": "I continue to find this restaurant one of my favorite Italian options! It's classy without being stuffy, and its soft lighting and slightly rustic feel add to the atmosphere.<br><br>My dining companions enjoyed the veal meatballs and Parmesan crusted onions- as did I. The pastas were well received too. I also appreciate the variety of beverage options- lots of choices for wine but some unique cocktails too!<br><br>It seems the service has slipped. Trust me, I'm not someone who acts like waiters are personal servants or anything similar. Even so, tracking down our waiter was very hard to do. Many times he'd walk by without acknowledging any of his tables...even if you politely tried to make eye contact. This was frustrating. Similar was the water service. It was awesome to have sparkling water offered with no extra charge, but whoever was filling water pretty much disappeared after the first ten minutes. I shouldn't have to crane my neck trying to get that basic thing...water. I love some sparkling water and was craving more of the bubbly good stuff!!", "pics": null}}, {"review": {"des": "This place is absolutely horrendous. Seating has zero ambience sitting in a lobby of a cheap hotel listening to the elevator ring every 30 seconds with no music. Water glasses sat empty for the first 10 minutes and then waiter forgot to bring limes. Food was disgusting - especially the orrechetti. Restaurant overcharged for the wine on the receipt versus what was in the menu - see receipt and menu I've included. Lastly they cleared some of the plates before my entire party was done eating which is incredibly rude. If you want an awful meal with terrible ambience and to get scammed on your bill - this is the place to go in the city.", "pics": null}}, {"review": {"des": "As a rule, I hate chains.  And Osteria via Stato has a chain feel.  But once you get past that, you start to tell yourself, \"hey, self, this place is pretty darn good.\"  First, the food is terrific.  It is genuinely Italian but still approachable for the American palate.  There are nice selections of antipasti, firsts, seconds and dolce.  The wine list is good.  And they even have a \"prix fix\" party menu that allows you to pick a first and second then let the good times roll for the table.  For us, the service rhymed with gucked, but maybe our guy just lost big on a horse race that day or broke up with his gal or something.  The room is cozy and olde world almost to the point of kitschy but just shy.  But it's loud; like be prepared to scream across the table at your dinner mates loud.  But hey, thatsa Italian!<br><br>But you should go here, if nothing else for the food.  Because it's actually quite good - especially the red sauce.", "pics": null}}, {"review": {"des": "I have mentioned before my dislike for writing bad reviews but oh my... I have never encountered such a nasty/b*tchy hostess in my life. She was so rude and unfriendly that I couldn't even enjoy my dinner after being so displeased by my begining service. The waitress wasn't much better but way more bearable then the long brown haired/entitled host! If you don't like people maybe find a non-people job! I would highly discourage any visitor to visit here...I don't wanna give you the wrong mid western vibe!", "pics": null}}, {"review": {"des": "We returned to Osteria Via Stato with a friend from Dublin, Ireland. This was our 2nd time to the restaurant and, this time, the food was good. My seafood stew was delicious, the bread yummy and most of us really enjoyed the food. We had 1 problem--again with the service. We were so indecisive that the server left us alone, but for too long. Even with our indecisiveness, it took far too long for us to get our food.", "pics": null}}, {"review": {"des": "This place is in a great location on State Street in River North. We came here on a weeknight in a group of four and did the multiple course dinner. It was really great to try a range of items on the menu. Since I don't eat meat I was originally concerned, but they were very accommodating and created dishes specifically for me. They have a range of tasty drinks as well. I went with the pinot noir since it pairs so nicely with Italian. Anyways, I thoroughly enjoyed my evening there!", "pics": null}}, {"review": {"des": "A great Italian spot in Rivernorth right across from Quartino! Catching the last rays of summer, we got patio seating! Made a res via LettuceEats. <br><br>Food: I was disappointed at the lack of meat options for pasta after first, but was blown away with everything we ordered after it entered my mouth. Who knew pasta without a protein still tasted 100%! Good sized portions - you didn't feel like you gained 10lbs leaving. <br><br>Food:<br>- Bread & Garlic Oil: 5/5. WOW some of the best bread ever. Fluffy and warm. The roasted garlic oil with a touch of balsamic was BOMB. Could've eaten this for forever.<br>- Mini Veal Meatballs: 5/5. I think it came with 6. So good with their sauce.<br>- Hand-made Tagliatelle: 5/5. I usually go with a protein option, but the quality of the pasta was phenomenal.<br>- Casareccia: 4.5/5. Boyfriend got his dish and really like the pesto taste.<br><br>Service: On point. Very attentive. <br><br>Ambiance: Great patio seating for a summer night dinner. Less noisy and packed compared to Quartino. You can actually hear conversations across the table!<br><br>I have to say... the quality of the pasta might be better than the popular Quartino... and the bread omg!", "pics": null}}, {"review": {"des": "Really nice Italian place. I had a pasta with pesto sauce that was good. If you are not too hungry I recommend you to order a side portion of pasta. I even found that large. The waiter was really nice, and she suggested us a good bottle of wine that was not too expensive. It's a good place for a date or for dinner with friends.", "pics": null}}, {"review": {"des": "Absolutely LOVED this place.  We went in August on recommendation from a guide of a food tour we went on.  The waiter was amazing.  He was so knowledgeable and legitimately enthusiastic about the food he was serving to the point that his enthusiasm was contagious.  (OK, so it wasn't really contagious because I'm actually that enthusiastic about food all the time anyway but it was nice to have someone at my same level.)  He brought out a few things that we had talked about but not ordered just because he wanted us to try them, and all the things he brought out to try were amazing.<br><br>For appetizers, we got the crispy calamari and the parmesan crusted sweet onions.  The calamari was great, nothing unexpected, but still great.  The parmesan crusted sweet onions were unreal.  They were covered in cheese and cooked in a cast iron pan until all the sweetness had come out, and I'm embarrassed to admit that I'm actually salivating just thinking about them now (4 months later).  He also brought out a few of the mini meatballs for us to try and they were perfect.  Moist, flavorful, and delicious.<br><br>For entrees we got the cacio e pepe and the \"chicken Mario.\"  The cacio e pepe was a little heavy but I think that's kind of the point of cacio e pepe.  It was great but I think I would get it as an appetizer portion next time instead.  The chicken Mario seemed like it was going to just be another roast chicken dish but the SAUCE on it took it over the top.  The chicken was cooked to perfection, and my husband was eating the sauce with a spoon when all the actual food was gone.  <br><br>The waiter brought out the house made chocolate bar for dessert which was perfectly smooth and balanced so well by the candied orange and toasted almonds they serve with it.  It also comes out in wax paper and the waiter smashes it with a hammer, if you're into a show.<br><br>If I'm ever in Chicago again I'll definitely come back here, which I think is saying a lot considering how many insanely good restaurants are in Chicago!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/2UtHngXK_MN_I79lpjl5gA/348s.jpg", "caption": "onion appetizer"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/7ZFmkvzp62C8xyTEHS7Kug/168s.jpg", "caption": "calamari"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/jhEf75HyHGI7mlBdyJhBvQ/168s.jpg", "caption": "balsamic/garlic dip for the bread"}]}}, {"review": {"des": "This has to be my new favorite restaurant! Sarah was our server and was outstanding! The brunch was so good and offers so many options! The young lady at the omelette station made the most delicious mushroom spinach omelette and was so friendly! This is my type of place. Good food and good service... something that is so hard to find in today's hospitality world. I will definitely be returning to try dinner! Management was also eager to learn about our experience and how they could improve... No complaints whatsoever!", "pics": null}}, {"review": {"des": "Had an awesome anniversary dinner thanks in large part to our server Mark who did a great job of being attentive but not hovering.<br><br>Food was excellent including the creamy polenta with pork ragu; the beet salad with goat cheese and the yummy risotto and pork belly.<br><br>This was our first visit and would definitely return and recommend to others. Bravo!", "pics": null}}, {"review": {"des": "**Italian restaurant with a rustic ambiance and a quality menu**<br><br>Osteria Via Stato has a couple of dining rooms when you walk in the entrance. The first consists of six to eight tables and a small bar area, where only pizza and drinks are served. The second dining hall is larger and patrons will have access to restaurant's full menu.<br><br>It was Restaurant Week the night we are here, which resulted in us having three different menus. Two of the menus were structured as three course meals while the third one was the eatery's traditional menu.<br><br>We went with the traditional menu. <br><br>The first thing we had, complimentary of course, was warm sourdough bread and dipping mixture which consisted of olive oil, balsamic vinegar, and actual garlic cloves. A great appetizer indeed.<br><br>Then I choked down on my spaghetti entree, which featured a deliciously spicy pepper tomato l sauce. And to compliment this I enjoyed a glass of Sicilian wine.<br><br>We passed on desert but I'm sure it would have been good.<br><br>All in all, I recommend this place as a good option for very decent Italian food at an affordable price.", "pics": null}}, {"review": {"des": "My sister and I had a quick bite - the penne and the gnocchi. I don't consider it authentic Italian, but very good and simple. I cleared my plate of gnocchi. The complementary garlic oil and bread was eh: bread was great but the garlic oil was overpowered by sweet balsamic. The service was not great. The waiter never checked in and we had to request our check, but it was probably an off night for our server. Everyone else employed by the restaurant was great.", "pics": null}}, {"review": {"des": "I came here for my friends birthday and I loved it!!! The complimentary bread with garlic dip is awesome!!! The bread is sooo fluffy and warm. I almost ate them all...<br>We ordered the slow roasted pork chop which is their special that night and it was awesome! The pork chop was well cooked, extremely tender and flavorful! and It was served with vege and mashed potato. Loved it!<br>The shrimp risotto was awesome too!!! It was really creamy with lots of shrimp and spinach in it. Loved it too!<br>Definitely gonna come back and check out other dishes. It is definitely one of my favorite LEYE restaurants in Chicago.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/SfPFCWwmr6up0Cm29X4fwg/348s.jpg", "caption": "We asked the waiter what is the special dishes that day: slow roasted pork chop"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/lx5nzmBozjPlOLtHvY4Ofw/168s.jpg", "caption": "We asked the waiter what is the special dishes that day: shrimp risotto with spinach"}]}}, {"review": {"des": "1. Calamari was to die for! <br><br>2. Veal meatballs: amazing <br><br>3. Penne: was ok ~ (got the \"side\" size)<br><br>Great ambiance and service. Place was accommodating for a birthday dinner of 13 (but only 11 showed). The bar area was separated by swinging doors so the dining area was more secluded.<br><br>Their balsamic and vinegar oil with roasted garlic and bread was worth the 1 hour trip out to the city. So many people got full from just eating the bread. Their other meat dishes were okkk. The short rib was rather dry but the dry-aged filet mignon was interestingly good! Their cork fee is $20 per bottle. Too much or a good price? Idk.<br><br>I usually hate leftover pasta but everything was still tasty and the pasta wasn't greasy like with other restaurants. Calamari was still bomb", "pics": null}}, {"review": {"des": "Greeted by a warm staff and showed into a beautifully lit and rustically dressed dining room. You can dine the classic Osteria way or a la carte. The complimentary ciabatta bread with dressed garlic cloves may have been the best part of the meal. SO delicious. I got the gnocchi, which was very fluffy but a little boring in terms of taste. Also got the Cacio e Pepe which was magnificent!! Wonderful service, food, and ambience. Highly recommend!", "pics": null}}, {"review": {"des": "Best Pizza I've ever had in Chicago. We originally took an Uber to Quartino. We walked in the door, got horrendously  tea-bagged by the thunderous din of the crowd and the \"boots n pants and boots n pants...\" crap music and thought, independently yet collectively \"fuck this shit, we've been in this fresh hell before.  Hated it.\"  Bounced down the street to Osteria via Strato.  Great room, great service. Amazing pizza.  Some very groovyyet dinner appropriate tunes were playing.  Night saved.", "pics": null}}, {"review": {"des": "Very nice staff that are helpful and knowledgeable! The food was okay. Pretty basic Italian good overall. Not bad but nothing special!", "pics": null}}, {"review": {"des": "I give this place 5 stars for service and 3 stars for food. Their salads are yummy and fresh- well balanced. Their risotto is subpar- undercooked and a little heavy handed on the salt. We ordered the trout which was a special and in my opinion was probably the best part of the meal- flaky, fresh, well seasoned served on a bed of kale.<br>The location is prime, and as stated earlier the service was impeccable. I just thought that the food was mediocre in comparison to other Italian I've tried in the city.", "pics": null}}, {"review": {"des": "5 stars for the bread basket but 4.0-4.5 for the rest (based on one visit on the Osteria side - there's also a pizzeria side)<br><br>My husband and I came to Chicago for a mini-moon and this was one of our first stops for dinner, recommended by a colleague as one of their favorite restaurants in Chicago. We sat outside - the ambiance was perfect and the drape lighting was romantic. There happened to be a street singer/keyboardist on the other side of the street which put the icing on top of the cake in terms of a perfect date night out.<br><br>The bread basket was the best bread basket I've ever had period. It was warm, perfectly toasted, and the inside of the bread was full, perfectly soft and chewy. The olive oil with pieces of mushroom - SO GOOD. I could have ate the bread basket for a meal and called it a day.<br><br>For appetizers we ordered the octopus - my husband loved this. It was very tender and not rubbery at all (which I personally find strange since I expect my octopus to have a slightly chewy texture, but that doesn't seem in vogue). It was VERY oily. Sitting in 1 cm of oil. But he liked it.<br><br>I ordered the seasonal market risotto which happened to be sausage risotto with snap peas. It was flavorful, al dente for sure, but slightly salty and heavy. I wished there were more snap peas to lighten the dish, and the sausage pieces were very small. My husband ordered Chicken Mario which had a delicious crispy layer and was tender/perfectly cooked on the inside. <br><br>Overall, we really loved our experience here and would come back in a heart beat the next time we're in Chicago. I heard the pizzeria has amazing thin crust pizza and will definitely be trying that as well.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/eGghYPjpNxKgmCWBlki40w/348s.jpg", "caption": "Market Risotto (sausage and snap pea) - not enough sausage and a little heavy/salty"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/zQQNQc9HJSEGJJ_VHwcw5g/168s.jpg", "caption": "Chicken Mario - loved by the hubby"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/I_QleoQBRmLuMJWjGKPa1A/168s.jpg", "caption": "Grilled Octopus - lots of oil"}]}}, {"review": {"des": "Our server was awesome, the cacio e pepe pasta was delicious and perfectly cooked, the appetizers were great too. My only complaint is how badly the bathrooms smelled. Normally, this is something I would brush off but it smelled like a Chicago alley. Made me second guess how clean their kitchen is...", "pics": null}}, {"review": {"des": "This place is a hidden gem....my first time there and ordered the veggie pizza and gnocchi and both dishes were phenomenal! The thin crust pizza was one of the best I have tasted in a while...the portion was just about right and price point was just right. The servers were great and friendly and I will return back soon!  They might not have as many reviews as the place across the street, but they are friendly @ the reservation desk, great service and awesome food...what more can you ask for!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/I9s8qqz74Udgi5ZhnBVT0A/168s.jpg", "caption": "Veggie pizza!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/xibQCQNikyM-D5p9q1gdIg/168s.jpg", "caption": "Awesome Hand - Rolled Ricotta Gnocchi!"}]}}, {"review": {"des": "My cousin and I had a coupon (buy one get one free) for Sunday brunch (Osteria: By the way, good idea to send this coupon to me when I signed up to Osteria website as I would not have probably tried the Sunday brunch). Price is usually around $34.95 per person for the Sunday brunch. Sunday brunch was great! My favorite is the their bread with their yummy olive oil/roasted garlic/balsamic vinegar (they serve this before dinner), pesto pasta (had a little kick to it), potatoes. But my all time favorite was the pork belly. Flavor was great (not overpowering or overly salty) and had the fat that all good pork belly should have. All the desserts were fantastic (my favs were the chocolate ganache tart and new york style cheesecake). I definitely would come back again for Sunday brunch and recommend this to others.", "pics": null}}, {"review": {"des": "Great Italian food. Steak was ok. Good ambiance and good service.", "pics": null}}, {"review": {"des": "Really underwhelmed by this place. First the service  was awful along with how the restaurant was run. A huge party of about 20 had reserved a table I was next to, but they kept adding more people, squeezing them in, that they were practically sitting at my table. That should not have been allowed. <br>We ordered the filet, the whipped potatoes, the spicy pasta and two drinks. The food was ok, but the portions were very small. Usually we have leftovers at an Italian place but here we were still hungry. The drinks were good, but very weak and at least $13 each. For over a $100 meal, we were still hungry and were given the worst experience. No wonder we were able to get last minute reservations on a Saturday night, that is telling.", "pics": null}}, {"review": {"des": "Since we missed our reservation at The Franklin Room, my friend called this place and they were so nice to squeeze us in, on a Friday night. I believed there's two parts to this restaurant and when we arrived we were seated right away. Tables are pretty close to each other and the ambiance was a little loud. I ordered their garlic bread, seafood linguine, and a glass of their house moscato. Garlic bread was kind of a surprise because it came with real garlics in the sauce for dipping. Bread was crispy on the outside and soft on the inside. Their seafood linguine was the highlight of last night because it's cooked in a tomato sauce but it's not the usual sour type of sauce, it's a little sweeter than others. There were plenty of seafood on the pasta, which is a plus. The moscato was like no other moscato I've tasted. It's the right amount of sweetness with sparkles! Thank you guys and will come again.", "pics": null}}, {"review": {"des": "3 stars for the food<br>5 stars for the staff<br><br>I had the pleasure of attending a wedding and reception here, so I did not get to experience Via Stato on a normal evening for dinner.  The staff was kind and helpful. I know the bartenders were slammed for this event, but they were super generous.  I am not sure what the food is like during regular service, but the buffet wasn't as good as I had hoped.  There were tons of options:  salad, creamy pesto pasta, penne and marinara, salmon, chicken, meatballs.<br>I did not try the salmon or chicken.  The pastas were well cooked, but bland.  The star of the evening were the meatballs.  The dessert buffet also offered a lot of choices - I was not wowed here either.  They also had a taco bar later that evening, but I did not have any room to try that. For sure, order meatballs.", "pics": null}}, {"review": {"des": "Osteria Via Stato has really good food. It's one of the better Italian restaurants in Chicago. Everyone should go here at least once.", "pics": null}}, {"review": {"des": "Sat at the bar. Bartender was friendly. Had cacio e Pepe, arugula salad, housemade olives and gelato. Everything came out quickly. Food was pretty good and reasonable in price. Nice ambiance.", "pics": null}}, {"review": {"des": "Absolutely delicious dinner! Took a while to get our order so the chef brought us out some complimentary small plates. You must get the roasted garlic olive oil and balsamic with bread! So good!", "pics": null}}, {"review": {"des": "Absolutely freakin' awesome!  Outstanding food and service.  I swear I could eat here everyday!", "pics": null}}, {"review": {"des": "The decor is decent, the staff is friendly, they have a menu of the standard Italian fare. I've had a pizza there in the past which was good. This time I went with the chicken Cesar salad. Great flavor and good size", "pics": null}}, {"review": {"des": "I loved it here! I came here for a business event (free food is the best food), but I would definitely come back as a patron.<br><br>The service was amazing. They were so friendly, greeted me, showed me to the meeting room restroom, whatever I needed. I could tell they were trying not to disrupt the presentation, and did a great job. Tables were cleared, food was delivered in a timely manner, waters were always filled, and they even brought a large refill for my iced tea that was ready at my disposal.<br><br>The food was great! I didn't order the short rib, but it looked amazing. I had the lemon chicken breast with broccoli and it was great. The dessert (a chocolate tart) was rich, but the portion was just right. Creamy and delectable. They also served bread, meatballs, assorted olives, salad, and a farmers bruschetta. Everything was awesome.<br><br>The venue is casual but you could definitely dress up. Loved it, need to come back to it!", "pics": null}}, {"review": {"des": "I had delicious Risotto with short rib and wild mushrooms and my husband had the gnocchi. We started with calamari which was done perfectly, but a little pricey for the size of the order. We were both stuffed so we had no room for dessert. Our server Amy was both knowledgeable as well as pleasant and personable. Overall a great experience and would highly recommend.", "pics": null}}, {"review": {"des": "I had the mini veal meatballs. They are delicious. Enough food to be a meal for one. <br><br>Also had the chocolate bar with almonds and candied orange. Not what I was expecting. Very delicious though. Its a piece of thin dark chocolate with almonds, dried oranges and almonds. <br><br>Ordered room service. They were very quick getting it up to my room.", "pics": null}}, {"review": {"des": "Excellent as I've been before.  You really forget good Italien food till you had bad Italien food.  So then when you return to via Stato you appreciate the place even more.  From the salads to the pasta to the octopus all was excellent.  Love the everyday bread as well.", "pics": null}}, {"review": {"des": "Their bread basket is served with roasted garlic and both were delicious.<br><br>For starters we shared the octopus and arugula salad. The octopus was extremely tender and cooked perfectly and the salad was fresh and peppery. For entrees I had the ribeye which was cooked perfectly and basically the same as the one you can get at RPM steak. My wife had the risotto which had good flavor but was undercooked. The consistency was a bit too much like jambalaya. The only other issue I had was that there is only a single stall bathroom in the restaurant... the other ones are in the hotel and upstairs which is a bit annoying and out of the way.", "pics": null}}, {"review": {"des": "Well, it sounded pretty good, but...  The server was very unsure of pretty much everything, and, worse yet, didn't seem to care one way or another. Failed to introduce herself, failed to offer us any cocktails or other beverages when we were seated, no knowledge of where the beer list was, etc.  Asked the bus boy at one point for crushed red pepper. He brought me salt and pepper. When I said again that I wanted crushed red pepper he told me they didn't have any. Really!??!  An Italian restaurant with no red pepper?  Well, fortunately a manager was wandering by, heard this, and told him where it was. <br><br>The food...  <br><br>Apps - White bean spread was mashed up beans. If this was seasoned, I couldn't tell. The salami was dried and curling around the edges. Large chunks of parmaggiano reggiano - tasty, but this whole plate just had no cohesion. House marinated olives were good. The reason for one of the stars. The house bread served with olive oil, balsamic, and roasted garlic is the other. <br><br>Entrees - Chicken Mario - sounds fancy. NOT!  It's a roasted, skin-on chicken breast. Done. No sauce with it. Some overly buttered rapini with no seasoning. Boring. <br><br>Linguini with Seafood and Fra Diavlo Sauce. 2 shrimp, 2 scallops, a few small pieces of calamari, crushed tomatoes. $23. Gimme a break. First, a seafood dish should have a lot more seafood. Second, the sauce had one flavor - sweet. Fra Diavlo sauce should NOT be sweet. It should have plenty of garlic and red pepper in it. I should NOT have had to ask for additional pepper. This dish, much like the Chicken Mario - boring. <br><br>Roasted Brussel Spouts - make that Burnt Brussels Spouts. Lots of black, burned surface area here - LOTS! Good idea, poorly executed. <br><br>Soup of the day. The good news? Apparently they make their own chicken stock. The bad news?  I knew this because my kid almost choked on a chicken bone. Learn how to strain your stocks. <br><br>I hate writing bad reviews since I know how much work goes into this business. But let's face it - some people put the work in, and some don't. Everything here pretty much seemed like it was just phoned in.", "pics": null}}, {"review": {"des": "I've been here before and on my most recent visit, kept asking myself, \"Why did I never order the Italian Dinner Party?\" Jeez Louise! The Italian Dinner Party is basically all you can eat courses of antipasta, pasta, and, depending on how much you want to pay, a main course!<br><br>My boyfriend and I were being indecisive but weren't incredibly hungry so went for the antipasta+ pasta. We were NOT disappointed. Highlights: the veal meatballs, and both pastas.<br><br>Our only complaints: the courses took forever and a day to come out; there is only a single stall restroom in the restaurant and it is not the cleanest.", "pics": null}}, {"review": {"des": "We came here for a late night light bite and drinks. This is a hopping place in the evening. I was surprised it being a hotel bar. Not sure if it was because there was a big conference in town or there were more locals. It seemed to be more locals.<br>We didn't wait long for a table for 6, and our server was quick to come to take our drink orders. They have beer on draft, cocktails, wine by the glass and more. They have $5 drink specials from 4-6 and free small plates. We came late so we can't speak to that.<br><br>We ordered three small pizzas to share. These are super thin pizzas and super yummy! Not too heavy. They hit the spot. It was s nice little snack for us and drinks were great too, a bit pricey but we're not watered down.", "pics": null}}, {"review": {"des": "The food was excellent tonight. And the service by our server Matt F and his staff was phenomenal. He knew we were from out of town and took the time to inform us of places to go and our concert need-to-know info. We will visit this restaurant the next time we are in town and definitely recommend it to friends/family", "pics": null}}, {"review": {"des": "Accidentally entered the Pizzeria half of Osteria, but stayed because it sounded good.  The pizzeria portion is smaller and includes a bar, so it's a bit darker and can be louder (depending on the crowd).  It also directly connects to the hotel next door, so good chance for a large group of patrons.  Service is good (easy to get a server's attention as well).<br><br>The veal meatballs were a delicious appetizer, very savory and the tomato was well seasoned with a hint of smoked or charred tomatoes.  Any extra sauce goes well with the free bread that they give you (and the sauce is better than just olive oil).  One of the special pizzas had sausage, broccoli, and carmelized onions as toppings, sounded tasty and healthy.  The sausage and caramelized onions were quite flavorful, but the broccoli just seemed a bit out of place.  Also the crust is very thin, very thin (not good or bad, just depends on your preferences).", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/IiJAgAHfDeEmXqlFk8UDpA/168s.jpg", "caption": "Special pizza with broccoli sausage caramelized onions"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/oBiQ2_IpWeY3CSdQ28oEVg/168s.jpg", "caption": "Lamb meatballs"}]}}, {"review": {"des": "Osteria Via Stato is great for events or dinners! Ended up here from a quick Google search on gluten free options. And it was history from there. No other venue could compare. We chose OVS for our wedding as we wanted great Italian food along with gluten free options. Look no further as Osteria Via Stato went above and beyond our expectations!<br><br>It is no easy task to find a wide variety of gluten free food for the bride and groom. But Osteria checked all the boxes for us down to dessert by making a crust-less cheesecake. And the arugula salad is addicting as well as the Parmesan crusted onions. Please keep in mind all our guests had all the gluten they wanted with the fresh baked bread and other food throughout dinner.<br><br>The staff knows their products and the chef takes great care preparing the food .It was a bonus in earning our Lettuce Entertain You points for our wedding. Allison, Michelle and Abby answered all my questions and accommodated our requests without any issues. It was wonderful to hear from the vendors I was working with that they had a long standing relationship with OVS. Not to worry your guests and vendors will all be fed well. The menu selections are amazing and the tasting was outstanding. The service is top notch as no glass was left empty for long. <br><br>The atmosphere was very inviting and the ceremony was beautiful in the intimate space. The staff set the mood with dozens of candles being lit for the night. Our guests couldn't rave enough about the food and how cozy and welcoming the space felt to them. This coming from Italians was confirmation for me that I selected the right place. It was outside the box and a long way from a traditional hall but it provided a truly unique experience for all. Without hesitation I would book any event at Osteria Via Stato. <br><br>Thank you Osteria Via Stato for making our wedding nothing short of spectacular!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/9VwZDk_MBZSvQFbV7GjwVw/348s.jpg", "caption": "Late night snacks of tacos with all the toppings"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/_9nL-zIRu5E8tccfbC7T8g/168s.jpg", "caption": "beautiful farmhouse tables"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/dl01r134f7MbSsWk97BG_g/168s.jpg", "caption": "Favor boxes included with cookies for your guests"}]}}, {"review": {"des": "Great little Italian restaurant. Service was great and good was delicious. The watermelon American mule is highly recommended.", "pics": null}}, {"review": {"des": "Hostess was extremely helpful and nice, so was our waiter. Food was fine, it hit the spot. Potato pizza was good and so was the wine.", "pics": null}}, {"review": {"des": "I've dined here several times in large groups, the wine and tapas are very affordable for big groups. The large carafes of wine = crowd pleaser!<br><br>Last night my husband and I popped in for a night cap and small snack, we sat at the bar. The bartender was extremely attentive and friendly (he also offered us an extra plate of vodka penne, bonus!!). Our tab with two drinks, bacon dates and two lamb meat sliders was only $33. Definitely worth a visit if you're out and about and need some refueling.", "pics": null}}, {"review": {"des": "Stopped in and had a glass of white sangria. Very tasty. Not too sweet. They served it cold from the fridge so minimal ice dilution. Very refreshing after the drive to Chicago from Louisville.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/kxMxw7_rSmcIexRh035FSw/168s.jpg", "caption": "Nice Italian wine pizza small bite bar off lobby of Embassy Suites."}]}}, {"review": {"des": "Good food, so-so ambiance.  There are many good-to-great restaurants in Chicago.  Here's my concerns about Osteria Via Stato:  1.  the music piped into the dining room was not at all relaxing or even Italian.  It was too loud and it had a heavy syncopating beat.  Maybe that's fine if your under 30, but for us it got in the way of an enjoyable evening.   2.  we were there with a couple of boys and they wanted pizza.  The waiter told us that pizza was not available, even though there is a pizzeria owned by the same people next door.  You could eat at the pizzeria but if you choose to eat at the Osteria, sorry, no pizza.  That's nuts.", "pics": null}}, {"review": {"des": "A really large restaurant so seating is plenty. All the food is pretty great, especially the pasta of course. Its nice for large parties who want to enjoy each other's company in a spacious environment. Would recommend if you ever want a safe, home-y option.", "pics": null}}, {"review": {"des": "Wow<br><br>Just wow.<br><br>We accidentally found this place while in town and it was so good we went two times for dinner. <br><br>They have a nice wine list and reasonable prices as well. Service is impeccable. It's well paced. Not rushed.<br><br>Their house baked bread is addictive. The marinated olive plate consisted of many different types. The rigatoni with a duck ragu...soooo good. Mini veal meatballs...amazing. <br><br>The second time we barely got lucky enough to get a reservation and they even accommodated a special table request.<br><br>Try the housemade dark chocolate bar with candied oranges and almonds for dessert.<br><br>A great place for a romantic dinner or a night out with friends.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/NKn742kpESBCNfwnPNwJDA/348s.jpg", "caption": "His first try at octopus and it rocked!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/EHYaQTv-xDNQfkGds3e6Qw/168s.jpg", "caption": "Homemade bittersweet chocolate with oats..candied oranges..and roasted almonds"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/qe2yS69PmKaQS11QYNzZ8g/168s.jpg", "caption": "The dessert menu"}]}}, {"review": {"des": "Great food & great service, something that seems to be the gold standard at Lettuce Entertain You restaurants. <br><br>My wife and I found this based on good reviews and location in downtown Chicago. <br><br>We tried the \"dinner party\" menu, which, for $39 per person, was amazing! We shared antipasti (crispy polenta & seasonal greens), a pasta course (orechiette & paccheri), and barely any room left for the main courses. The service was fantastic, and our waiter was great at helping us choose wine that we enjoyed. <br><br>The dining room is very romantic, and we had a great experience. Highly recommended!", "pics": null}}, {"review": {"des": "Very good food and great service. Our waiter, Dario, was super nice!! Would come again!", "pics": null}}, {"review": {"des": "Horrendous service overall. When I asked to speak to the manager, it only got worse. Definitely skip this place. So many better options in Chicago.", "pics": null}}, {"review": {"des": "Took a recommendation from a friend to come here. Ate an early dinner w my parents who are from out of town. We had the cacio e pepe, which was downright amazing...just like we had in Italy. The gnocchi was very good too. The seafood stew was good but not memorable. The pasta dishes were by far the best.", "pics": null}}, {"review": {"des": "This place is great since my friends and I was finally able to get a reservation. The restaurant decor and interior is really elegant.  We started out with the small plates of grilled octopus and antipasti board which were delicious. For entrees one of my friends had steak with mash potatoes. My other friend had ravioli with tomatoes and a sage brown butter sauce. I had a steak with sautéed greens and my husband had pork shank with spinach and cannelloni beans. We all agreed my husband dishes was the biggest compare to our dishes. Nonetheless the overall experience was great and our waiter was really helpful to us. I have to definitely go back to try their pizza and other dishes on the menu. It is a great place for any occasion and make sure you make a reservation.", "pics": null}}, {"review": {"des": "This is our third time here... once again food was outstanding but service was just mediocre...we ordered the gnocchi,spaghetti and penne all were outstanding....we had empty wine glasses,server rarely checked on us... where's the canoli and tiramisu? This is an Italian restraunt!", "pics": null}}, {"review": {"des": "I really enjoy the food here. Located inside the embassy suites, it's a no brainer to eat here. I ordered a spicy Bloody Mary which was delicious with the penne pasta. The pasta was so good however the noodles seemed hard. And it kinda sucked I was served pasta without bread but maybe it was good that I wasn't given bread lol. I love bread. And the margherita pizza was sooo bomb.", "pics": null}}, {"review": {"des": "We were looking for a potential venue for our rehearsal dinner and had never been. My fiancé emailed once we made the reservation and they did an amazing job. They sat us in the area we would be in and let us sample potential items off the menu. Our waiter Derek was especially great and we'll be requesting him to be a part of our wedding team. Loved it!", "pics": null}}, {"review": {"des": "Visited this past weekend with a group of 7 and had a great meal. We split some of the pastas and salads as well as the meatballs. The highlights were the spicy penne and short rib. Service was quick and happy to help with suggestions. Another solid Italian offering in River North!", "pics": null}}, {"review": {"des": "Good Italian food in casual eatery! I enjoyed the food--from pasta and pizza to meatballs they had good food. The desserts were delicious too. Waiters were helpful in keeping our wine glasses filled. They are located off the main Michigan avenue.", "pics": null}}, {"review": {"des": "My sisters and mom hosted a baby shower for me at Osteria via Stato, and it was great! We had the private room in the back for about 65 guests, and it was a very comfortable space for that amount of people plus a big gift table and a big dessert/games table. <br><br>The best part of the party was the staff. Nadie was our lead waitress, and she was so patient, attentive, and helpful. From rearranging seats to accommodate our guests, to noticing we were missing favors at various seats, Nadie had everything covered. I cannot say enough good things about working with her! My sister also worked with Abby to coordinate the event details, and she said Abby was always very prompt and accommodating of requests. <br><br>The food was also excellent. For appetizers, we did a house salad, bruschetta, their famous onions, and meatballs. We were kind of skeptical about picking meatballs and onions, but both were full of flavor and impressive. For entrees, we had the option of short ribs, white fish, a chicken and a vegetarian pasta... clearly I don't remember the chicken and vegetarian options well because our party is a heavy meat and fish kinda group :) Short rib looked like a normal sized portion but turned out to be huge - very flavorful and moist. White fish was a sizable portion, mine in particular was a little dry, but flavor was rich and buttery. <br><br>Overall, I would really recommend coming here to host any luncheon or stop in for a nice but not fancy meal. Great experience for us!", "pics": null}}, {"review": {"des": "Came here recently to celebrate a friend getting a new job recently and this place was her choice to let loose @. She recommended the roasted garlic as an appetizer not to mention that is was free during happy hour and the server Jose' kept em coming. The Roasted Garlic was awesome! We had a party of 8 so they were nice enough to push two tables together for us. There was a special on the very delicious red sangria which doesn't look like your normal red sangria and it tastes better than the normal version or version we are used to. Was so good I think I may have had 7 total in the 4 hours we occupied the place. <br><br>Lots of pizza was ordered and I had a slice or two of the margherita pizza and sausage pizza...both were equally as good. It got to a point our server didnt come to us after awhile as I assume it was a tactic to get us to leave at some point as I mentioned we were there about 4 hours. I grabbed him and who I believe to be the manager and they said we should start to order more food to continue to occupy the table. Since we had two new people show up and the fact that some of us had worked up a new appetite we were able to accommodate his request of ordering more food. Fun friday nite here!!!", "pics": null}}, {"review": {"des": "Osteria is a stylish, casually elegant place with indoor and outdoor seating, excellent service, and good food.   -  Solid 4.5*. Overall<br><br>Our knowledgeable, generous local friends treated us to an enjoyable dinner here yesterday evening. <br><br>AMBIENCE: <br>- Casually elegant. Slightly loud at peak time.<br><br>COMPLIMENTARY <br>Warm Bread and Roasted garlic in olive oil.  5*<br><br>- Excellent! The roasted garlic was unusually good with the bread! <br><br>APPS<br><br>1. Roasted Olives ($4), 5*<br>- flavorful! <br><br>2. Parm onion ($8), 5*<br>- Great taste and nice texture, melts in mouth. <br><br>3. Grilled octopus ($9), 5*<br>- Tender, tasty.<br><br>MAINS<br><br>1. Scallop ($29), 3.5*<br>- Chopped up small pieces; OK taste; very SMALL quantity for the price. <br><br>2. Seafood stew ($24), 4.5*<br>- Flavorful, tender; small quantity. <br><br>3. Chicken Mario ($19), 5*<br>- Tender, juicy, tasty chicken<br><br>DRINKS <br><br>1. Bottle of Red Wine, Antinori, blended ($52), 5*<br>- Robust, smooth, delicious. <br><br>2. Grey Goose martini, extra stuffed olives ($14), 5*<br>- Tasty! Wish they had blue-cheese stuffed olives, though.<br><br>DESSERTS<br><br>1. Bread pudding ($6) and Gelato platter ($6), both 5*<br>- Great with coffee and tee, NOT too sweet! <br><br>SERVICE: 5*<br>- Attentive, friendly, helpful! Maria and her crew rocked! <br><br>At our departure, our server Maria even went to the front door, along with the host and hostess, to say goodbye to us!  :-) <br><br>Osteria, Chicago. 08.27.16", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/6NYtDVOt9Xgpmesu-NZUKA/348s.jpg", "caption": "Our desserts: Gelato platter, Bread pudding. 5* Osteria, 08.27.16"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/OqZFDL3Q5QCYSEoz6uA38w/168s.jpg", "caption": "Main courses: Scallops (3.5*), Seadfood stew (4.5*), Chicken Mario (5*). Osteria, Chicago. 08.27.16"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/eKgIEMMYHp_DzE1fyEEK2Q/168s.jpg", "caption": "APPS:  Roasted olives, Parm onions, Grilled octopus, Vodka martini with extra stuffed olives.  All 5* Chicago. Aug 27, 2016."}]}}, {"review": {"des": "My son's a vegetarian and his wife is gluten-intolerant. This restaurant offered plenty of excellent selections in both categories.", "pics": null}}, {"review": {"des": "Their prefix Italian Dinner Party menu was surprisingly delicious and a great value in my opinion. For $25 bucks a person, unlimited tomato & cucumber salad, roasted garlic & warm bread, crispy polenta, pappa al pomodoro, pennette pasta and farfalle pasta! The food it self was good, and reminded me of Maggiano's. If I was super hungry, I probably could've beasted on the two different pastas. There's no shame in having leftovers here, and they will more than willingly pack up any uneaten food to go for ya. During my visit here, the only gripes I had were that the service was a bit on the slow side and there was a really obnoxious party going on in the adjacent room which kinda killed the ambiance during my visit here.<br><br>Of course, if you're not feeling the all you can eat option, you can always go for their al a carte entree menu which was reasonably priced between $10-$20 for most items. Oh yeah, don't forget those lettuce entertain you cards! Rack them points up as usual! <br><br>Til next time, cheers!", "pics": null}}, {"review": {"des": "I was in Chicago for a about a week and on my last day there I was looking for a quick meal I could eat some and take the rest to the airport for dinner. I walked in because they had a good lunch special with a salad, a sandwich and dessert for $10.95.  The waiter was really polite and helpful.  I had a beer and it was delicious! The food was good too, the salad was small but tasty and the warm bread and olive oil filled me up!  The waiter (I can't remember his name) then packed up the calzone and dessert for me to take to the airport and it was such a nice way to leave the city.", "pics": null}}, {"review": {"des": "Delicious food and drinks! I love their penne pasta with tomato sauce OR the pesto sauce and you won't regret it. The chicken mario is also superb. I have been here several times. Also, the manhattan italiano is one of the best drinks ever! Please eat the chopped salad as well.", "pics": null}}, {"review": {"des": "The bread here is absolutely delicious. We started off with the caprese salad and then moved onto entrees. The gnocchi I had was very fluffy, but also seemed a tad undercooked possibly? I warmed it up the next day and it was even better than before. <br><br>They have a nice big patio out front ... great for people watching and enjoying the Chicago summer weather. I definitely recommend that you get the bread pudding with the caramelized bananas!! Sooo good! Will definitely return!", "pics": null}}, {"review": {"des": "This is one my favorite places in Chicago. Whenever I'm back in town I make it a point to stop by here. The food is amazing. Everything is made with fresh, beautiful ingredients. Honestly some of the best Italian food I've ever had. You have to get the roasted garlic and bread for an appetizer. It seems simple but it's so so good. The service is always impeccable. Everyone is kind, warm and very attentive. Highly recommend.", "pics": null}}, {"review": {"des": "They have an excellent wine selection and really great appetizers but the layout of the restaurant means that the noise of every single patron will reach you - go for the bread and the pasta, but stay for the wine! Great for girls night or catching up with friends because it's casual but still trendy", "pics": null}}, {"review": {"des": "Hugely disappointing compared to other Lettuce Entertain You restaurants.  Ordered the grilled octopus appetizer and the cacio e pepe side order of pasta.  Both items were presented barely lukewarm, absolutely swimming in oil, and looked very unappetizing.  The tiny segments of grilled octopus had no charred grill flavor, and were overwhelmed by oily potatoes.  The cacio e pepe was missing its distinct black pepper flavor, and had ugly clumps of cheese strewn about as the sauce and oil separated.  Will not return.  The restaurant interior is also too dark and pub-like - needs updating.", "pics": null}}, {"review": {"des": "The thing that made our dinner here was the service.<br>The food was good, the roast garlic and balsamic (excellent), the anti pasti selection (fantastic), the pastas (nice), the entrees (meh).<br>You get the italian family neal for $39.95 each and it is huge. To much food in fact. <br>We had a few cocktails. They were nice.<br>But the service. <br>The service was excellent.<br>Our waiter was super efficient and really lovely. Made great suggestions and was super helpful. <br>Will absolutly return and recommend, if not just for him", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/3uyM-X--C23i_2NmI_Z3FQ/348s.jpg", "caption": "Salmon fillet"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/UWhqr0Jc3l3R2gH-LuvZ1g/168s.jpg", "caption": "Pasta course"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/VwminZv2Yio46nRGPmgd2A/168s.jpg", "caption": "Arabiatta speghetti"}]}}, {"review": {"des": "Good food, TERRIBLE SERVICE!  WHERE IS MANAGER?  Hostess spent entire evening flirting with waiters.  Talked about her boyfriend woes.", "pics": null}}, {"review": {"des": "Love, Love, Love this restaurant!!!  Everything is superb!!  Apps are delicious, as are the salads and pastas. Best Casio e Pepe I've ever had. I visit every time I go to Chicago. Upscale but reasonably priced not snobby. Great for dinner, anniversary, birthday or just some night you want really great pasta !!!", "pics": null}}]}