{"name": "over-easy-cafe-chicago-3", "reviews": [{"review": {"des": "I've come here a couple of times on the weekend for breakfast/brunch, and I've had a great experience each time! The wait I've experienced usually is no more than 30 minutes. There's always coffee outside you can grab while you wait. <br>  <br>Everyone that works here is so friendly and accommodating! This place runs like an efficient machine without making your time here feel rushed.  <br><br>And the food! Everything tastes so fresh and is prepared perfectly. The french toast specials are especially tasty-hits the sweet cravings without making you feel overstuffed or overdosed on syrup. The scramble and benedict that I've had here have also been quite delicious. I usually get the weekend specials, so note that these rotate and will not be on the menu every week. <br><br>This has definitely become one of my nearby go-to breakfast restaurants.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/sKseYAiqGwH6_4B0RDfcLA/348s.jpg", "caption": "Santa Cruz scramble and Blackberry Bliss (French Toast)"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/sZUtpd2Wj5EjRlWe09kstQ/168s.jpg", "caption": "Banana Spiked French Toast"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/cPBMNLQIOn9_aF7JGhdFDw/168s.jpg", "caption": "Baptiste Bene"}]}}, {"review": {"des": "What an excellent choice!!  On a rainy Sunday morning, our family was meeting for breakfast and the original meeting spot was closed for maintenance unexpectedly. Quickly, I checked Yelp and found Over Easy Cafe. We easily found street parking which was a plus. Our wait was about 40 minutes. Keep in mind that there is no waiting area/vestibule inside to speak of so plan accordingly. <br><br>Once inside, our server put our BYOB champagne on ice and brought out a carafe of OJ. We figured we better review the menu and order quickly since the line was growing outside and this is not a large venue. Six of us ordered and quite honestly had our piping hot food in less than ten minutes. We were amazed!  They're doing a lot of things right in that kitchen to be able to serve hot food accurately that quickly!!  <br><br>I had a French Toast stuffed with cream, bananas and caramel sauce. It was sooooo good!  My kiddo had some blueberry pancakes and we shared crispy bacon. There were pouched eggs, excellent potatoes, sausage links, sourdough toast and other delicious breakfast goodies spread across the table. <br><br>Now, I wasn't a fan of them clearing plates before we were done. If I'm chewing and my utensils aren't lying across my plate, I'm not done yet. I wasn't the only one, but I can understand that they want to turn over the tables quickly. <br><br>Bottom line, it was a really great spot for a solid meal. I just won't come back if I want to visit for any length of time.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/l6ShZ_I1h55W8UCTITxDDA/168s.jpg", "caption": "The most delicious French Toast ever!"}]}}, {"review": {"des": "My favorite low-key neighborhood-vibe brunch spot in Chicago. Unassuming, affordable, and always delicious with the friendliest staff. Brunch can be such a hassle but Over Easy is consistently, well, easy and accommodating.<br><br>I almost always get the Damen Avenue omelet, but today I went a little crazy and got the pumpkin pie French toast. It's even better than it looks. And it's probably a good thing that it's a seasonal special since it's dangerously rich.", "pics": null}}, {"review": {"des": "Serious five stars!<br><br>I see this place got review of the day today and I just want to throw my five stars in because when I came here, I enjoyed a fabulous breakfast served by one of the owners and she told me the story about how they had a little fire when they started out, how enjoyable it is to be in the industry and she was as friendly and welcoming as could be. <br><br>My \"candied Apple French toast\" was the special; it was delicious and it hit the spot.  (I still have to get back for my original interest which is the lime prickly pear with blackberries French toast!) Some menu items are seasonal and unique and I can't recommend visit here highly enough.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Xozds-jQIpExsMAtt6aPVg/348s.jpg", "caption": "Candy apple French toast - cut away the first bit so you could see how divine! Delicious & not overly sweet is a crazy feat. 4.25.17"}]}}, {"review": {"des": "I came across this place on yelp and had to give it a try. The food was awesome. I went with a friend on a Sunday morning and waited about 45 mins for a table. It was well worth it. We got some suggestions from the server and everything we ordered was amazing. The sassy eggs are definitely a must, I got one of the special French toast and it was the perfect amount of sweetness for breakfast. Overall a great brunch place.", "pics": null}}, {"review": {"des": "Ambiance: Casual, busy<br>Food: 5/5 <br>Service: 4/5<br><br>I have had Over Easy Cafe bookmarked for so long, honestly, it's a little sad how long it took me to make my way over here! Over easy is a small breakfast restaurant that doesn't take reservations. With that in mind, we started our trek early and made it there by 9am on a Saturday morning. We were told a 15 minute wait (not bad at all) and that we could enjoy complimentary coffee in the meantime. <br><br>Their menu is divided into sweet and savory, two of my favorite things and so it was hard to pick just one. Luckily my group was open to family style! We ordered the Sassy eggs, banana spiked french toast and boston cream french toast. ***WARNING*** their menu changes pretty frequently so check the menu before going in! <br><br>Everything looked BEAUTIFUL when it came out and luckily our waiter understood that we wanted to take a million pictures. It was crazy that the every dish tasted as good as it looked. To my surprise, the french toast dishes sounded really sweet but in fact they were really light and delicious. <br><br>Overall: super delicious food, waiting times are variable, the restaurant is really busy so service can be a little spotty. Would I come back? DEFINITELY!", "pics": null}}, {"review": {"des": "This place is good!!! The food looks terrific as well as the taste. My fav is the sassy eggs..yummm!", "pics": null}}, {"review": {"des": "My boyfriend and I were in town for a weekend in Chicago. We found this place on yelp and couldn't pass it up with the raving reviews! We went on a Saturday and the wait was ~30 minutes. We noticed people waiting that were holding bottles of champagne!  Hello! I'm from Indiana and have never heard of a brunch spot offering BYOB. And the cherry on top was the liquor store a few doors away. That's what sold us on the 5 stars. We ordered a decanter of OJ to make mimosas. *cheers* I loved the quaintness of the inside and the host was on it! With the restaurant being so busy, he kept everyone in the know of when their table was about ready. <br><br>The food was also tasty. I ordered the sunrise omelet which came with potatoes. Omelet was good; However the potatoes were sub-par. I would have preferred they be a little more well done. My boyfriend got the short stack bacon pancakes with scrambled eggs. He was a fan of his.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/dzFmaEdJZu1TBXkS2dYwPA/348s.jpg", "caption": "Sunrise Omelet, potatoes, short stack bacon pancakes, & scrambled eggs"}]}}, {"review": {"des": "Fantastic spot. I loved everything about this place and definitely did not have any issues with the staff as some of the other reviews have noted. No one was pretentious or pushy. Everyone was extremely friendly and helpful. This is a small space so not great for big groups and be prepared to wait. But it's well worth the wait! My dad and his friend do Bike the Drive every year and have made this their go-to spot following the ride. I was lucky enough to join them this year for both activities. Neither one disappointed :) <br><br>Over Easy Café is easily a local gem offering unique menu offerings as well as some usual suspects. Stray from the beaten menu path here and you will be rewarded. I had one of the daily specials: the Torre de Tinga. Layers of pulled chicken and crispy tortillas covered in a delicious green sauce covered in eggs and a light dusting of cheese. That green sauce...drool...as in lick the plate if it was socially acceptable goodness. My dad got his Memorial Day standby-the pulled pork benedict. They only offer this delight Memorial and Labor Day weekends so don't miss it!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/YfG-STr6gnCa-hPQcRVwmA/168s.jpg", "caption": "Pulled pork Benedict. They only make it Memorial Day and Labor Day weekends. Highly recommend"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/K90tOPN0NLf00_fpjhHZyg/168s.jpg", "caption": "Torre de Tinga. No pico. Amazing"}]}}, {"review": {"des": "Went here for some brunch today and I must say I was not disappointed!<br><br>Small cute space with great service! Our server wasn't overly pushy and hovered around the table the perfect amount.<br><br>I had a scrambler that had ham,tomato,cheddar cheese and a few other ingredients that made the dish perfectly balanced! I also had a hibiscus lemonade to drink which was just as delicious! My date had the sassy eggs which looked amazing, and he said they had a delicious flavor profile behind it. I'll make sure to return soon since it's so close to where I live.", "pics": null}}, {"review": {"des": "They should change their name to The Standard. Because it's how all other brunch spots should be judged. <br><br>High praise for this place because it hit the mark on all important aspects of brunch in my opinion. Quality, service, and aesthetics. <br><br>First- for service: we showed up at noon on a Sunday and it was packed. But they offer hot coffee outside while you wait, and plus we were seated well ahead of time. Also the hostess was super friendly to even people who weren't as nice for waiting a while. Props to the hostess for being super energetic for such a busy place. Next our server- she was awesome! She was genuine and explained the specials and was super prompt, friendly and even was playing with all the little kids around us in a high stress environment during the madness of Sunday brunch. We couldn't have asked for better service so please take notes from Gwyn if you want to know how to treat people!<br><br>Next the food- the sassy eggs were a staple and done perfectly and the steak dish I had was cooked to perfection. The dishes came out super fast and we cleaned our plate without room for anything else. An amazing brunch spot that should be on everyone's list. Not overhyped at all. Well worth the wait and then some! We will be back!!", "pics": null}}, {"review": {"des": "I came here on a Saturday a little before 10am. 30-45 minutes wait, which was fine because my friends were 20 mins away. <br><br>Service was great. They turn over tables quickly and efficiently. Our food came out within 10 minutes (I want to even say 5!). I had the Sassy Eggs and Banana spike French toast. Oh my goodness. Both were excellent.<br><br>Let me tell you about the Sassy Eggs-I ordered my eggs over medium. They were perfectly over medium. The chorizo didn't have that runny red oil that comes out of it sometimes. Very tasty and well seasoned, which were perfect with the potatoes. Party in my mouth and great presentation.<br><br>Banana spiked French toast-another winner. It wasn't too sweet. Very balanced flavors. The rum caramel was delicious that I wish there was more of it. The custard made it feel like I was eating a banana cream pie and French toast form. The candied pecans gave it that nice crunch and there were plenty of bananas inside, on top, and around the dish. It was perfect.<br><br>My coffee cup never went below halfway. This is where I am very impressed because I drink a lot of coffee at brunch and I always have to flag down someone. And sometimes it takes too long, or I'm just an impatient person when it comes to COFFEE NOW! But the staff here always made sure all cups were full. I love it. Superb service.<br><br>We had a baby with us and they were very accommodating. It was really busy and a crowded space, but the staff were pleasant and attentive. <br><br>Highly recommend this place and I want to go back and try other items. They had so many good things on it, and weekly specials as well.<br><br>There is also self-serve intelligentsia coffee available while you wait!", "pics": null}}, {"review": {"des": "Wow! What a delightful find this place is. We knew we were approaching our destination when we saw a crowd of people on the street. Wait for 3 of us was estimated at 20-30 minutes. At least it was sunny because there's no space to wait inside. They have hot coffee set up outside for your wait. <br><br>The food was totally worth the wait. Once we were seated we ordered and our food was delivered in about 10 minutes. And we were blown away! I ordered Black Eye Brioche French Toast loaded with fresh blackberries layered with the most amazing orangey lemony cream sauce and my plate drizzled with housemade blood orange syrup plus a side of applewood bacon. It was pure perfection on a plate. My daughter got the Banana Spiked French Toast with candied pecans and my husband got the Blarney Stone Benedict with the housemade corned beef. Both of them were as tickled with their dishes as I was. <br><br>The service in this tiny restaurant was phenomenal. Our server gave us a quick very descriptive rendition of the menu highlights. My husband said the busser team was like watching a pit crew turning around the next table. They were amazingly efficient! <br><br>Great job everyone - we'll happily wait outside here for your perfect breakfast/brunch again!!!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/yQfp7GFOm1LVijrCpY_oug/168s.jpg", "caption": "Black Eye French Toast with fresh Blackberries and Blood Orange Syrup"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/_2b6tj1nzetE0yF7xJGD4w/168s.jpg", "caption": "Banana Spiked French Toast"}]}}, {"review": {"des": "There's gonna be a wait to get seated. Just know that going in. But if for one minute the thought of \"well, let's just go somewhere else\" enters your mind, you better just get rid of that immediately. This place is amazing. If there's a better spot for brunch in Chicago I need to know about it! I haven't found one. Bold statement. With a creative menu and superb food quality, this place tops the list. <br><br>With a staple of recurring menu items supplemented by 4 \"specials\" you'll find something that will knock your socks off. I opted for the Blarney Stone Benedict with 2 poached eggs with home made corned beef (so good!) with Irish cheddar cheese sauce, fresh horseradish and chives. Amazing.  My wife's Black Eye French toast had giant fresh blackberries and orange pastry cream, blood orange syrup, powdered sugar and whipped cream. Yeah, it was even better than it sounds. And my daughter's Banana Spiked French Toast? Pure perfection. <br><br>It's a small place, very popular - hence the wait. But they run this place like a machine and tables are turned and reset so fast it will make your head spin. So yeah, that wait? No big deal. You'll thank me.", "pics": null}}, {"review": {"des": "Gwen and Jon know exactly what they are doing at the Over Easy Cafe.  The cozy space can sit about 20-25 people at one time.  They being a blend of culinary talents to make a perfect place for Breakfast, Brunch and Lunch.  The service is impeccable, and fresh food flys out of the kitchen to tickle your taste buds and gently fill your hunger without stuffing your belly.  The atmosphere is one of a cool neighborhood cafe that is a little secrete, but one that you are so happy to find.  <br><br>If you get the chance, you have to try the Sassy Eggs and find some time to interact with Gwen... you won't regret it.  While they have been open for business for 12 years, it's easy to see that they will be around for a very long time to come.", "pics": null}}, {"review": {"des": "Solid breakfast, awesome customer service and I was greeted immediately. My experience was Like... flawless. And that's a lot coming from me lol. I wish I got my waitress' name: she was friendly, thorough and I felt like she just 'got me'.", "pics": null}}, {"review": {"des": "This is my 3rd time coming to Over Easy and I'm soo disappointed I waited to try the sassy eggs because they were sooo good!!! Also, I'm a vegetarian so I was excited to learn that they have a vegetarian chorizo you can substitute. The wait was almost an hour long but it was worth it. One thing that bothered me is we did feel rushed to leave.", "pics": null}}, {"review": {"des": "Over Easy Cafe is so good! I love this small little brunch boutique. I love when you can find really good brunch spots. You know they are good when they are small and have a 30-45 min plus wait. They do not accept reservations, only walk ins. However, the wait is worth it. We had to wait approximately 35-45 min. The staff is very nice and the food is very good. <br><br>I came with my husband and daughter and we ordered different dishes to try and share. <br><br>I ordered the Sassy Eggs and my husband ordered the Retro Omelet. My husband and I ordered the Spiked Banana French Toast. We ordered our daughter the Easy Eggs. All of this food was amazing! I loved the Sassy Eggs. I love a good hash and this hit the spot. It consisted of pork chorizo-jalapeño-red pepper-potato hash topped with two eggs, cheddar cheese, ancho ketchup, sour cream, & guacamole. It was so yummy. The Chorizo added the perfect spice and the gauc and sour cream lended a nice cool touch to help cut the spice of the Chorizo. The cherry on top was the over easy egg. This was like omg, so tasty! My husband enjoyed his omelet and said it was good. Now the Banana Spiked French Toast was the <a href=\"/redir?url=http%3A%2F%2Fbomb.com&s=bb4f996415a9c2f21137e27cfb68f439a48cec2652b53e9b50dd7e766dbe177e\" target=\"_blank\" rel=\"nofollow\">bomb.com</a>! It was very good and one of my favorite French Toast I have ever had. I liked how it was different and loaded with yummy ingredients. It consisted of banana french toast layered with vanilla pastry cream & sliced bananas, topped with rum-caramel sauce, candied pecans & powdered sugar. The bread still had the perfect texture and wasn't soggy or anything like that. Everything in this dish played well with the next ingredient to provide a unique whole taste. Definitely try! We ordered our daughter the Easy Eggs. It consist of two eggs any way you like 'em served with red potato hash and toast. We also added chicken sausage patties for her. The sausage was very good. It had a hint of sweetness, like a sweet and savory taste that was amazing! <br><br>Overall, Over Easy Cafe has some amazing breakfast/brunch food! I would definitely come back when in the area, and encourage anybody to try them!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/zuM7sj3D4lgSt26KDFA9oA/168s.jpg", "caption": "Sassy Eggs"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/pJo9X4r0QzXpTJbD5ky5Pw/168s.jpg", "caption": "Easy Eggs"}]}}, {"review": {"des": "It is a lovely locally owned 'wee' restaurant that definitely has that small town vibe the second you step inside. Always greeted with smiling faces and kindness. The food is always delicious! The rotating 4/5 specials on the back of the menu are always unique and influenced by the seasons, allowing you to try new dishes anytime. Or stick to the good ol classic menu items! Just a lovely spot :)", "pics": null}}, {"review": {"des": "Honestly, this place is sooo worth going to. It is a bit far from downtown but I think it's worth it. This was the best meal I had during my trip. Came here for brunch with two of my friends on a Sunday. There were about 3 groups of people ahead of us but we were seated in about 30 min. It was not that bad. I like that they provide free coffee while you wait for your table. She called our names and seated the 3 of us at a small table but we manage. Our waiter was really friendly and answered all of our questions about the menu. Customer service is a 10 here! <br><br>I ordered from their Special menu that change seasonly. Forgot the name, but it was basically a Steak Benedict. The eggs were cooked perfectly and the steak was medium, just the way I like it. <br><br>One of my friend ordered the Sassy Eggs and it was very seasoned and I love the spiciness of the chorizo. It was a mountain of awesomeness. Would totally recommend this dish to anyone who love spice.<br><br>The other friend ordered the Banana Spiked French Toast which was good if you have a sweet tooth. <br><br>Overall, it was worth the wait and the staff are super friendly and doesn't rush you even when they're busy.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/-y803fKiwTHO5n3ZK999_Q/348s.jpg", "caption": "Banana spiked French toast"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Ghl6vZ-FToCtwqbXIRMFlg/168s.jpg", "caption": "Sassy eggs"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/LRbjV-IJUbGkOOUljiE4Eg/168s.jpg", "caption": "Steak benedict"}]}}, {"review": {"des": "Total deliciousness! Even our picky teen is very pleased everytime we eat here. There is always a wait and it is worth every minute! The specialty omlettes and French toast specials are divine. We especially love the many choices in the menu and the cultural influences and creativity.  We drive from the North suburbs to enjoy one of the best breakfast joints in town!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/X2na5vhG14QJGHUUmPugMw/348s.jpg", "caption": "French toast special"}]}}, {"review": {"des": "Excellent food and huge portions.  Had the Sassy Eggs so good! Service is good and food comes out fast.  Great spot to brunch.", "pics": null}}, {"review": {"des": "Why am I just reviewing this place? BEST breakfast. The rotating specials are always unique to the season. Service is attentive, coffee is always filled and they understand the demand for the restaurant and always encourage guests to be mindful of the wait- I love that!", "pics": null}}, {"review": {"des": "This has to be my new new favorite brunch place in Chicago. It's a little far north for me, but i'd come up for some brunch any day. The line can get pretty gnarly, but I think it's well worth the wait if you have the time.<br><br>Their french toasts. All of them. They offer a different selection of seasonal french toasts every week and i've got to say, they are some of the best ive ever had. The toast isnt soggy but with a nice seared crust on the outside, softer on the inside. Flavors are always excellent, I find their combinations to be innovative without the often poor execution that many restaurants fall in to.<br><br>I myself had a scramble that was loaded with venison sausage, potatoes, and tons of veggies that was superb.<br><br>Any brunch place that can nail the sweet AND savory definitely deserves all 5 stars. Needless to say, i'll definitely be back soon!", "pics": null}}, {"review": {"des": "This was my first stop in Chicago and I like it so much I went back for round two! The food was so good and so was the service , I wish there was a location in NYC.<br><br>Sassy eggs is everything the picture looks like it will be! Heaven on earth", "pics": null}}, {"review": {"des": "Fantastic brunch spot all around! Friendly staff who seats and serves you quickly, cozy interior, great brunch menu selection, and the complimentary Intelligensia Coffee available while waiting is delicious! <br><br>We ordered the Sassy Eggs, Spiked Banana French Toast, and the Blarney's Eggs Benedict. <br><br>The Sassy Eggs is a crowd favorite for good reason! The chorizo mixed with the house potatoes are absolutely incredible. Definitely recommend a runny yolk atop the pile of delicious potatoes, the mix of creamy, spicy, and savory is unbeatable. The Ancho Ketchup adds some sweetness and tartness as well as the white sauce.<br><br>The Spiked Banana French Toast is to die for! The sweetness is just right where you won't feel overly stuffed and tired of the same sweetness over and over again, the crime anglaise adds the perfect topping for each bite. Every bite will put a smile on your face!<br><br>The Blarney's Eggs Benedict was savory and just so flavorful! The horse radish based sauce really complimented the creaminess of the runny poached eggs and the meat! <br><br>Really enjoyed our time here and will be back to try the specials as well as the other items on the menu!", "pics": null}}, {"review": {"des": "Another great brunch spot in Chicago! I've been here twice and it has yet to disappoint me so far except for the waiting times but it's just that good! The sassy eggs is probably one of their most popular dish and it's a must try especially if it's you're first time, very filling and flavorful! If you're looking for something healthier and a bit on the lighter side, the Damen Ave Omelette is a great dish as well filled with mushroom, spinach, and goat cheese. This place does tend to get crowded especially on the weekend. We waited about 40 mins but luckily they're very accommodating and even serve coffee outside while you wait. Can't say enough great things about this place! The breakfast sweets will be the next on my list of dishes to try!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/mABHu_l3uatjrT_-Ph3C9w/168s.jpg", "caption": "Damen Ave Omelet- mushroom, spinach, & goat cheese"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/9WR5mh7PiAZsyaYf2oLpaw/168s.jpg", "caption": "Sassy eggs"}]}}, {"review": {"des": "The food is amazing.<br><br>The weekend early morning experience:  The only thing keeping me from giving a 5-star rating is that the restaurant is so small.  There is always a wait outside, which I don't mind, but once you get a table, they are looking to get you in and out.  <br><br>On multiple occasion my plates have been taken away while I was still eating.  It can be so loud in the restaurant that you have to half yell to have a conversation.<br><br>It's a place for awesome food but not a place to have a relaxing breakfast experience.", "pics": null}}, {"review": {"des": "By far my favorite breakfast place! The sassy eggs are a must! However you can't go wrong with anything on the menu. The rotating specials are always unique. Easy neighborhood parking. Very cozy ambiance. Place tends to fill up early so plan accordingly.", "pics": null}}, {"review": {"des": "Came here with my boyfriend for a nice morning breakfast. We came here around 11:30AM and it was a 45 to 1hr wait which we didn't mind at all. The weather was beautiful and they have free coffee for the people we are waiting and there was a live small band entertaining the crowd which I found nice. <br><br>The services was fantastic. The waiters and waitresses are all so kind and generous. The food came out pretty quick in my opinion and it was fantastic. I got the banana spike French toast with a side of potatoes. Absolutely delicious. Definitely for those who have a sweet tooth side in the morning.", "pics": null}}, {"review": {"des": "The Place<br>The Over Easy Cafe is located at 4943 N Damen Ave, Chicago, IL.  In and around the Ravenswood, Lincoln Square neighborhoods.  Very clean and inviting atmosphere.   Nice table layout capable of seating singles as well as small parties.   Get there early this place fills up fast.<br><br>The Menu <br>Super breakfast menu.  Some very interesting and delicious offerings.  We ordered from the breakfast specials menu.  We pursued the offerings and decided on three of the specials.  Nostradamus favorite Breakfast Sandwich, eggs scrambled with saucisson noisette, butter braised leeks, & grains of paradise, topped with cave-aged gruyere cheese & served on a toasted telera roll with red potato hash.  Couldn't pass on the Gallinacci Scramble, eggs scrambled with golden chanterelle mushrooms, vidalias, fresh thyme, parmigiano reggiano, & fontina cheese, served with red potato hash & toast.  Couldn't pass up the Damen Avenue Omelet, eggs, sautéed marinated portobellos, spinach, & goat cheese, served with red potato hash & toast.  The presentation was picture perfect. If you walked away hungry it was your own fault.  These breakfast entrees were excellent,  <br><br>The Experience/Service/Value<br>We were greeted as we approached the door and promptly seated.  I actually felt like they were happy we were there.  Our waitress was delightful and we were well pampered.  Great breakfast experience that actually lived up to the hype I had heard.  A little on the expensive side but you get what you pay for and that's always a good thing.  Well worth your time and money recommend you stop in for a bite.", "pics": null}}, {"review": {"des": "Excellent food, great fast service  in a cozy little restaurant. The reviews posted before me do not lie, this place was a hit", "pics": null}}, {"review": {"des": "This has to be the smallest restaurant ever... waits can be a while....<br><br>HOWEVER...<br><br>The food is amazing! Great portions, and the seasonings are amazing. They have all kinds of delicious options here. I want everything on the menu! This is a must, if you're into breakfast/brunch.", "pics": null}}, {"review": {"des": "If you're looking for a fantastic breakfast/brunch spot this is it. The service is FANTASTIC and the food comes out quick!  Don't think the food is bad just because it's quick it's amazing. The sassy eggs were full of flavor with every bite and the blueberry crunch pancakes were delicious!  I even got veggie sausage links (something I never do) and even though they were a bit on the dry side they were very tasty. <br><br>The staff is extremely kind and extremely friendly. I'd go back for them alone. <br><br>Thanks for a great experience will be back 100%", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/eTP0FdXSBNKjXysuL9tfZw/348s.jpg", "caption": "Sassy eggs. Aka - the bomb dot com"}]}}, {"review": {"des": "Delicious good tasting food in ravenswood area with a unique selection.", "pics": null}}, {"review": {"des": "I'm impressed! Came here on a Saturday a couple hours before closing and only had to wait about 25 minutes for a table for two. The host and waitresses were all extremely friendly. They opened the doors for us, gave us some time to look over the menu, but also stopped by to explain the weekend specials that were available. I ordered the Blackberry bliss french toast, but also got a taste of the Nueva Mexicana Omelet. <br><br>The blackberry bliss french toast was delicious. Between the two pieces of toast was vanilla anglaise and blackberries. The plate had something like blackberry syrup all along the bottom that the toast sat in. It was a tad difficult to cut pieces off while trying to keep it all together. The toast was fluffy and the anglaise was perfectly creamy. The syrup that I mentioned before wasn't too sweet and brought it all together nicely. While this was a special, I would return to their other french toasts. The Nueva Mexicana Omelet was also pretty tasty! While there was a bit too much goat cheese, it went well with the potatoes that were on the side! Also, they have super cute decor!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/LxPAMC-13lfNuDq3nyfiPQ/348s.jpg", "caption": "Sassy Eggs"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/srL-zu5KjsYbo6HEW_P2rg/168s.jpg", "caption": "Banana Spiked French toast"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/7PqPkNk41MyXKwWeRCxO6A/168s.jpg", "caption": "BlackBerry Bliss French Toast"}]}}, {"review": {"des": "A true gem in Chicago's Lincoln Square neighborhood. The dining area is very small so your best bet is coming on a weekday unless you don't mind waiting. The service is great and very quick. I always get the sassy eggs (with veggie chorizo, which is a wonderful option) and have yet to be disappointed. The dish is a blend of flavors and textures from the crispy potato bed, to the flavorful and saucy chorizo, with creamy eggs, and a refreshing dollop of guac. Beautifully finished with a ketchup and sour cream drizzle.", "pics": null}}, {"review": {"des": "This place is fantastic and runs like a well-oiled machine! I stumbled upon it while driving back from a round of golf, and almost decided to go to the place 2 or so doors down because their was a wait. Glad I didn't.<br><br>They've got free coffee outside while you wait, and seemed to underpromise and overdeliver on the wait time (so don't stray too far, the table will come up quick).<br><br>I had to order the sassy eggs because they came so highly recommended, and they delivered. The weekly special of french toast was delicious. With both plates, the presentation was great as well...whipped cream dollops in each corner of the french toast dish, and the sassy sauce drizzled on the eggs with a twisted orange slice on the side - very nice.<br><br>What impressed me most about this place was a sign that urged diners to wrap up their business after they're done eating so they can keep the wait down. LOVE THAT! Instead of the awkward \"I think they want us to leave\" hints that many places send when trying to turn over tables, this place is just out with it and it is great.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/u0RnfuBq8Q-hPhagvSFe_w/168s.jpg", "caption": "Weekly French toast special...I had cut this in half to share, but great presentation."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/LgpoM-BdIP6W12ktsY-Vig/168s.jpg", "caption": "Sassy eggs! Comes with toast"}]}}, {"review": {"des": "Being from St. Louis which has a notably lower population density than Chicago, I am still not used to the intense battle that ensues when trying to find a brunch spot in Chicago. I came here with friends on a day with really nasty, slushy weather, and the line was out the door. They corralled me and probably ten other guests into the back hallway of the restaurant where we constantly had to squeeze against the wall for passing bussers and people going to the bathroom. If it weren't for the fact that they offered complimentary [and outstanding] coffee while you wait, I might not have had the patience to deal with this scenario. <br><br>All that being said, once we were finally seated, the service was excellent and everything on the menu sounded delicious. I know it's a good sign when so many menu options sound good that I can't make up my mind. I finally settled on the French toast special for the day which featured raspberry coulis, hazelnut pastry cream, and chocolate ganache. It was incredibly rich and sweet, and the flavors meshed perfectly. I'm always hesitant to order something that sugary for breakfast due to the inevitable carb coma that follows, but it was worth it. It is also worth noting that Over Easy's presentation on all of their dishes is absolutely gorgeous. If I'm ever in the area, I will definitely be back, in spite of the massive and well-deserved crowd.", "pics": null}}, {"review": {"des": "This little place packs a BIG, FLAVORFUL punch to the eyes, the gut + the tongue. Everything on the menu sounded incredible, especially the specials. <br>I had a scramble with Parmesan, Havarti, squash, onion, and bacon with a side of roasted red potatoes and toast. The food was mouth watering, an ideal savory palette. The potatoes were prepared in a way that evened out the robustness of the scramble. And they had gluten free toast! So I upgraded my side to french toast- the sweetness was light and subtle. Over Easy serves Intellegencia coffee, so of course that was wonderful.<br><br>My friend had the \"Sassy Eggs,\" they looked amazing. And were, by his account! Our food was ready within 10 minutes of ordering. We ate at 11am on a Wednesday morning and the place was busy, but not packed or noisy. The waitstaff was attentive and kind. Highly + Deliciously recommend!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/z5fmvIRejQ58E-4qy8wrYw/168s.jpg", "caption": "Sassy Eggs- complete with chorizo and guac"}]}}, {"review": {"des": "So busy, but so good. This cafe brings refinement to weekend brunching in a way that's so unique, I haven't seen anything like that anywhere else. With huge portions, cheery smiles and a lively atmosphere, Over Easy Cafe has the perfect formula for a great time. If you have a sweet tooth, I highly recommend the apricot ambrosia french toast (it's a weekly special so it might not be available) or any other french toast. If you're in the mood for something savory instead however, the sassy eggs are SUBLIME. Come here, brave the wait and you're guaranteed a great time. 1000% recommend.", "pics": null}}, {"review": {"des": "This is one of those neighborhood spots you don't want to review because you don't want people with the in of the best places but people are catching on and I don't blame them. Food is always ridiculously delicious and full of considerate flavor. Their specials are seasonal and their servers are always well spoken about them. Wish it was bigger but adds to its specialness. The female server is the best server I have ever had.", "pics": null}}, {"review": {"des": "Have been to Over Easy twice and it is well worth the wait for this \"wee\" restaurant. It's full of phenomenal wait staff and expertly crafted food. They have 3 specials that change every week so whether you're someone that gets the same thing every time you go (Like my roommate with sassy eggs) or if you try something new every time like me, you'll be satisfied. My only complaint is that for such good food you should invest in better hot and iced coffee and have more variations of caffeinated beverages you can make.", "pics": null}}, {"review": {"des": "Excellent Food and Service! <br>I had the Bernsten special. My guest had the Sassy eggs. The food was So good! Not your typical Breakfast place.<br>They are so busy, and yet able to operate flawlessly!  \"I'll be back\"", "pics": null}}, {"review": {"des": "We are from out of town and heard about this place on yelp. There was no wait and we got seated right away. Our waitress, Crystal, was very helpful in suggesting options on the menu and was so very friendly definitely. My husband ended up getting the Sassy Eggs which was definitely savory. I ended up getting the Candy Apple French toast (sweet). I loved it and it was very filling. The brew coffee was Intelligensia coffee which was also really good. Would definitely come back here.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/_RAhOs6h3C_KnjTCoWlVMQ/168s.jpg", "caption": "Candy Apple French toast"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/4aygZO2o7LybNauyL8Mqww/168s.jpg", "caption": "Sassy Eggs"}]}}, {"review": {"des": "It's rare giving a 5-star rating to a breakfast-focused place, but this place deserves it. I've been to this place probably close to 10 times and have been meaning to review it for some time.<br><br>Every single thing I've had here is good. Even simple eggs and toast. It's crazy. Gwyn, the owner recognizes people in the area and welcomes them back. And that goes a long way these days. She's very knowledgeable about the food and the origins of the dish.<br><br>You'll constantly find a line out the door because the place only has 12 small tables and a bar that fits 4. No one complains. Everyone waits. <br><br>Why? The wait is worth it.", "pics": null}}, {"review": {"des": "By far one of my favorite breakfast places. If you are in the area, I would highly recommend you stop by and try the sassy eggs. You will not be disappointed.", "pics": null}}, {"review": {"des": "The food was a huge let down. It looks like they do a great job with sweet dishes such as waffles. But there breakfast sandwiches and there tofu plate are bland and I would say close to disgusting.  Would give one star but the atmosphere was nice so two stars it is.", "pics": null}}, {"review": {"des": "Anytime I have family or friends visiting from out of town, my first thought is to take them to brunch here! There is no wrong choice on the menu and the changing specials always have me wanting to come back! The restaurant is small, so the wait can be long. However, they usually provide some coffee outside to help us stay patient. I also never like to travel in large groups when it comes to restaurants or any seating situations, so the wait is never too long for us. I'm getting hungry just writing this review!", "pics": null}}, {"review": {"des": "They were all smiles as soon as we walked in. Service is stellar and the food is equally amazing! We will be back.  The staff has this down!", "pics": null}}, {"review": {"des": "4.5/5. Great breakfast option in Ravenswood that has a small neighborhood feel while serving some aesthetic, filling, and all around tasty morning dishes. Place is cleverly decorated with some exposed brick, modified 'L' station signs, and various egg-shaped accents. The menu is varied but not overwhelming large, and pictures featured around the establishment make it easy to see what you should get. Having seen pictures online, we knew that going for some variation of french toast would be a must. The other thing we got was the sassy eggs because chorizo and crispy potatoes have my name on it.Food comes out fast(guess it has to if they want to keep up with the weekend crowd), but looks very deliberately composed. It's as if they knew people would take pictures. That aside, the taste actually holds up, whether from the crispness of the potatoes or the cornflake crusted french toast to the sweetness of their homemade strawberry syrup and mascarpone cheese. As far as the sassy eggs went, everything came together harmoniously, though to be fair it's hard to imagine that those ingredients wouldn't. Very satisfied with the food, and the other dishes(mainly the other fresh toasts) that came out looked just as good.<br><br>Weekly rotating specials keep it interesting, so if you are able to come on a weekday, check online to see if they've got a new item that piques your interest and stop by when they don't have lines out the door.", "pics": null}}, {"review": {"des": "I walk past this spot every morning. Often it is full and on the weekends there is always a wait. The first few times I went I was impressed with the friendly service and the speed with which they go through the line. The food was always just pretty good breakfast offerings. Omelettes, pancakes, some weekly specials...all were good, but nothing spectacular. You may read this and be confused by the 5 star review. <br>I recently had the Sassy Eggs, and my view of Over Easy was changed...I get it now. The dish is a beautiful pile of chorizo-jalapeño-red pepper-potato hash with eggs, cheddar, ancho ketchup, sour cream, and guacamole. It is perfect, while everything else on the menu is pretty good, the Sassy Eggs is one of my favorite breakfast items in Chicago. Worth the wait for the pleasant atmosphere and quality food.", "pics": null}}, {"review": {"des": "So many good breakfast spots in Chicago. This one ranks near the top of my list for sure. The service is fast and friendly. The menu has something for everyone. Definitely a creative chef, as you can see from the photo. (Sassy Eggs - a popular choice) My scrambled eggs were light, fluffy, and moist. The French toast had a perfect crunch on the edges and not too heavy. I love that they have veggie meat choices such as tofu and veggie chorizo sausage. I will be back for sure. <br><br>Be prepared to wait outdoors when it is busy. Plan ahead for winter months.", "pics": null}}, {"review": {"des": "If you live in Chicago and STILL haven't taken a trip to Over Easy, you're missing out. Their brunch is so perfect. <br><br>Every time I go, I order their weekly French Toast special and feel like I've died and gone to heaven. They mix and match flavors and get super creative, such as the Cannoli French Toast with pistachios, chocolate and cannoli filling, or the Elvis French Toast with peanut butter and banana. I contemplate licking the plate every single visit. <br><br>The BF never gets anything but the Sassy Eggs, and has proclaimed them his favorite egg dish he's EVER had (and that's saying a lot because we brunch way too often). <br><br>Yes, there's a wait no matter what day or time you visit. We could all afford to take a walk in Winnemac Park to burn off some of the calories we're about to consume anyway though, so grab a cup of complimentary coffee and get to steppin'! Plus the blessing is that as soon as you order, your food is at your table in under 5 minutes guaranteed.<br><br>Do yourself a favor and go to Over Easy. You'll thank me later.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/1auci95AWmUDMTutC5Jp3Q/168s.jpg", "caption": "Cannoli French Toast Parte Due (Weekly French Toast Special)"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/DQTYBo6mxAi33YbcrqhTDw/168s.jpg", "caption": "Sassy eggs"}]}}, {"review": {"des": "About a 40 minute wait on a Saturday morning around 11am or so. We tried their two most popular dishes: <br>Sassy eggs ($12) - pork chorizo jalapeño red pepper potato hash topped with two eggs, cheddar cheese, ancho ketchup, sour cream, and guacamole. <br>Banana spiked French toast ($10) - banana French toast layered with vanilla pastry cream and sliced bananas, topped with rum caramel sauce, candied pecans, and powdered sugar <br><br>Both were really good!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/IPMapHcmMtD8IozcXwgRTw/348s.jpg", "caption": "Sassy eggs and banana spiked French toast"}]}}, {"review": {"des": "The sassy egg as almost everyone mention is the choice to go with. It is the best ever and the service was amazing as well. The only negative thing that couldn't be helped is the long wait due to the small area. It wasn't helping that I was out waiting in the rain too where we couldn't wait inside due to small area even though later I saw them letting people wait in the back area.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/aB_w5DQPd62UZbkE_1lEBQ/168s.jpg", "caption": "SASSY EGGS!!! a must!!"}]}}, {"review": {"des": "Still one of my fave brunch spots! <br><br>We were quoted a 60-75 min wait on a Sunday morning around 11, and actual wait time was about 55. There's complimentary coffee on the sidewalk while you wait, as there's no real lobby room in the restaurant.  There's also a park across the street where you can walk... or Bang Bang Pie shop next door to grab a biscuit or pie appetizer. Lol. #noshame<br><br>Chorizo hash with avocado, sour cream, cheese, and 2 eggs your way make up the Sassy Eggs plate. Delicious and quite an abundant portion! It stretched me 3 meals and also comes with 2 slices of toast. <br><br>I have yet to try the burger or a sweet dish here and still have it on my to do list, even after my note to self from 7 years ago below. But I can say I veered away from the Damen Ave omelet this time!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/OiZQ8oqVcvyz7rxYJUg2EA/348s.jpg", "caption": "Small interior. Be prepared to wait for brunch!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/FWTpFh9S5Y-qEiHoG1p81g/168s.jpg", "caption": "4 eggs, sausage, bacon"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Had1sd3BZ3VYcJNZjK9dMA/168s.jpg", "caption": "Sassy eggs: chorizo, potatoes, sour cream, guac"}]}}, {"review": {"des": "I came on the weekday around moon time. There were waiting list. The place is tiny and I have to wait about 15 minutes, then we seated. <br>Their food is great and looks fancy. I like Sassy Eggs. It was so delicious. <br>The only reason I gave 4 stars because the table is so small and I order 3 things, and it barely fit on table. It is hard to to move plates around to share.", "pics": null}}, {"review": {"des": "We arrived at 8:30am with no wait on a Sunday. It was our first time and so we chose the popular sassy eggs (with poached eggs) and sopes al pastor. This place was super cute and although can be loud, it has a very intimate vibe.<br><br>Service: It seems like this place can get busy quickly. The servers seemed to know this and although they want to serve the food and rush you out quickly to seat more customers, not once did I feel rushed. The service was amazing and on top of their game. <br><br>Food: Here is where they lost a star. Their sassy eggs was a house specialty, but I was a little disappointed. The potatoes were very bland and for having chorizo and jalapeños, it had almost no \"kick\". On the other hand, the sopes al pastor was packed full of flavor. The salsa de chile that was used for the sopes al pastor was amazing. We could not get enough of it and it definitely added a lot of spice and soft flavors. The sopes and beans added so much texture, combined with the pork was fantastic. <br><br>I definitely want to come back again for Sunday brunch, not for the sassy eggs, but for their Sunday brunch menu.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/o_6ZLoX038QHDd4Z488ZEQ/168s.jpg", "caption": "Sopes al Pastor"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/1uNOSXnj7G8dPmEY-bPnSg/168s.jpg", "caption": "Sassy Eggs"}]}}, {"review": {"des": "Great food and customer service. Strongly recommend going on a weekday or first thing in the weekend. The wait for weekend brunch can be long, and they don't take reservations.", "pics": null}}, {"review": {"des": "Went here on a Sunday morning (around 10:30am), the host told us the wait was 1h, ended up being almost 50min, the place has a nice decoration. The place is really small, for the amount of people that want to eat there.<br><br>They have complementary coffee on the sidewalk (you'll have to wait outside), so you can have coffee while waiting, I took advantage of that because it was a cold and rainy morning. <br><br>Once inside we had coffee (again, yes); we were a party of 4, we ordered 3 sassy eggs, 1 Banana Spiked French Toast (for share) and I ordered the Breakfast Sandwich. The sassy eggs were really good, a little spicy, the Avocado was good, made with quality ingredients but I'm glad I didn't order it; too much potatoes (personal preferences). <br><br>Our server (who was really nice) recommended the sandwich, which was why I had it. It was really tasty, the bread was so soft, the scrambled eggs with ham were good. It's plenty, we were so full. <br><br>This is definitely a place that I'd recommend IF you don't mind waiting.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/PXD4Q9k3zO04LH87evy4-Q/348s.jpg", "caption": "Sassy eggs"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/W9e_XFd1oSHZbj53Ba0wvQ/168s.jpg", "caption": "Banana Spiked French Toast"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/u2XWQLbPaC1BC6_BJL8Rvw/168s.jpg", "caption": "Breakfast sandwich"}]}}, {"review": {"des": "Been going to Over Easy since meeting my husband in 2007:-) Recipes are still consistent after all these years, food is great, service solid and fast.<br><br>All these years later, and it's still one of our faves. And, now that we have a kiddo, we like to take her, too!<br><br>Always on rotation as a weekend brunch spot for our little fam.", "pics": null}}, {"review": {"des": "Breakfast was good.  Special with their version of eggs Benedict was really good though the Mexican chicken stew w eggs special was very bland.  Not impressed w the chicken stew dish.  Most of it sat neglected on the plate.  The twice a year Labor Day special was good.  Waitress was very attentive and hard-working.<br><br>Breakfast was $14 a pop so more than I would normally pay but had to try it.  Will I be back?  Maybe...  The potatoes were perfectly crispy outside and soft and pillowy inside.<br><br>Great service, food was fair.  The Labor Day special was good though as I finished it up, it seemed almost overwhelmingly flavored w sweet, salty and fatty.  Almost like eating eggs with gravy and frosting.  Felt like I was inhaling a heart attack...maybe in a pizza kind of way.<br><br>I think I just needed some fruit or veggies to balance it out.<br><br>Overall, nice place to take guests.  Dunno if I'd call it a repeat though.  Great service.", "pics": null}}, {"review": {"des": "This place just became top 5 of my favorite brunch places. Friendly staff, great food, and great atmosphere. Also, the food came to our table super fast. We were impressed haha. <br><br>Definitely coming back! Thanks for the great experience!<br><br>Ordered the Damen Ave. omelette and the spike banana French toast. Didn't disappoint - would definitely order those again!", "pics": null}}, {"review": {"des": "The food is quite good - on par with other Chicago brunch places - and beautifully plated. <br><br>The service needs to chill - of course they are stressed because there is always a line and the dining room is so small - but my friend was offered a \"to go box\" before he was even halfway done with his breakfast. The bill arrived shortly thereafter, and the remainder of the meal became a battle with staff to not have our plates whisked away before we finished eating. Left feeling rushed and sick.", "pics": null}}, {"review": {"des": "Cozy little cafe on Damen between Lawrence and Foster. We rolled up about 1:00pm on a Sunday for brunch and we're told the wait would be 30 minutes. We were seated in about 15 by a lovely, lively hostess. Our waiter was awesome too. Over Easy is BYOB and we brought a couple bottles of champagne and he popped them right away for us and brought us a carafe of freckled orange juice (OJ with strawberry purée). The oj was delicious. I ordered the beef enchiladas. My boyfriend ordered the soyrizo skillet and my best friend ordered the breakfast sandwich. All of our food came out, no joke, in about 7 minutes, 8 tops. Piping hot. My enchiladas were delicious, great sauce, flavorful, eggs over easy (lol get it) and cooked perfectly. The breakfast sandwich was HUGE and and SO GOOD. Bursting with flavor. My boyfriend said the soyrizo was really good, but needed salt. Easy fix, he put some salt on it. Highly recommend if you're looking for a quick, delicious brunch. Great portion sizes for the price, friendly, informative staff, great, solid brunch food. And... BYOB. Can't beat it.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/YQun-LPx7B3TD2W6n2AQFw/348s.jpg", "caption": "Enchiladas de Picadillo"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/fZHst_qJnzVNiVqjs128zg/168s.jpg", "caption": "Soyrizo skillet"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/O2QkHMLplCSy3DmimOjnOQ/168s.jpg", "caption": "Breakfast sandwich!"}]}}, {"review": {"des": "When I first tried coming here with my boyfriend, we arrived a little over an hour before they closed (lol...big mistake). Because the place is small (can only hold 42 occupants) and popular, the wait was long and they had stopped taking names. <br><br>Fast forward to our second time: we came about an hour and a half before they closed and had to wait for 45-50 minutes, which wasn't terrible. They provide free coffee for you outside while you're waiting and Bang Bang Pie & Biscuits is right next door! We ordered the Sassy Eggs and Banana Spiked French Toast, both of which are house specialties and popular items on the menu. The Sassy Eggs were deeelicious and sooo savory, perfectly balanced by the sweetness of the french toast. The french toast wasn't too sweet and the vanilla pastry cream on the inside reminded me of banana pudding. <br><br>I only docked a star because while this place is a fantastic brunch place, my favorites of all time are still Toast and Bongo Room.", "pics": null}}, {"review": {"des": "The best French toast hands down, very good egg platters, great service and not that expensive. Everything is perfect.", "pics": null}}, {"review": {"des": "Excellent service. All staff friendly and helpful.<br>Great food. Got the basil pesto, sundried tomato omelette and pancakes very fluffy! The sassy eggs are tasty too. Love the red potatoes hash.<br>Cute ambiance. Thank you, will be back!", "pics": null}}, {"review": {"des": "They serve a great breakfast. Hash browns eggs Benedict. Pancakes....great quality American breakfast. Brunch lunchy things.  <br><br>My only comparison would be nookies and I prefer bookies, because they are s chicago original.", "pics": null}}, {"review": {"des": "Second time here, will be coming back for a third time!! I love this place. The host (man with long hair) was very welcoming and got us seated right away. Service was fast, food was DELICIOUS. Prices are fair. Small but very cozy cafe.", "pics": null}}, {"review": {"des": "Great breakfast and service. Pretty easy late morning street parking. <br>Loved the homemade hash with is usually not as good as diner can hash.", "pics": null}}, {"review": {"des": "On a recent visit to Chicago my buddy brought me here for my first meal.  We sat at the counter as it was packed.  Our server was great, very enthusiastic and friendly.  We both ordered one of the specials, their twist on a breakfast BLT which included an amazing pork belly.  Oh and the bread on the sandwich was perfect....soft, warm and delicious.  The food, service and overall experience here was top notch and I will definitely make it back here on my next visit to town.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/mMHm2dC0Qx3exeKdbdF2nA/348s.jpg", "caption": "Breakfast BLT...incredible"}]}}, {"review": {"des": "I was out with coworkers late one morning and we stumbled upon this place while looking for a place to grab a quick breakfast.  It was a weekday morning and the place was busy.   We waited in line about 20 minutes, initially debating on whether we should stay or not, until we started perusing the menu.  Wow!  We were suddenly excited about our visit and couldn't decide on what to order.  Everything looked so good.  We all decided on an order of the sassy eggs each and a shared plate (for 4) of the spiked bananas French toast. We were all happy with the selections and left stuffed ourselves.  The sassy eggs were just the right spiciness and the sweet French toast was like a dessert.  I understand the line now.", "pics": null}}, {"review": {"des": "Is there a better brunch spot in Chicago besides Over Easy? Ive never had a bad breakfast here. Its the perfect way to start the Day! The spiked banana french toast is my go-to here, and I generally only eat savory breakfasts. Love Over Easy!", "pics": null}}, {"review": {"des": "Best breakfast/lunch  place in Chicago.  Hands down.  Huge portions of delicious goodness served enthusiastically by a great waitstaff.  Today I had the Muffaletta sandwich for lunch.  Wow so good.  I'd eat here every day if i could.", "pics": null}}, {"review": {"des": "Overall, lovely experience. Summary:<br>Service: 5/5<br>Ambiance: 4/5<br>Food: 4/5<br>Price: 4/5 (Two coffees and two entrees came to $35.36)<br><br>The whole Megillah:<br>My sister and I came at about 11:45 on a Saturday morning and had to wait about 25 or 30 minutes for a table. The hostess was very sweet, and there was coffee set up outside to have while we waited. The waitress was equally lovely and helpful. She recommended the Sassy eggs - pork chorizo-jalapeño-red pepper-potato hash topped with two eggs, cheddar cheese, ancho ketchup, sour cream, & guacamole. We were able to order it with vegan chorizo, which I really appreciated! She also recommended we order the eggs over medium, which were perfectly runny and delicious. This would have been perfect hangover food; it was super heavy, a little greasy, and FILLING. We also got the Damen Ave Omelet, which comes with mushrooms, spinach, and goat cheese. We got it without goat cheese, but were able to sub in some tasty salsa. The omelette was aight. I have to say, we had some food envy for some of the other dishes we saw come out; the Nuevo Mexicans Omelet and some of the scrambles and sandwiches looked particularly tasty. It looks like the Sunday brunch has some Benedict options, which I'm always a sucker for. Would be worth checking out!", "pics": null}}, {"review": {"des": "Be prepared to wait at least 30 minutes for two people and at least an hour for parties of 3 or more. With that said it's probably best if one shows up right at opening. I went on a Saturday at around 11am. Waited outside and sipped on some complimentary coffee. <br><br>I suggest you try the sassy eggs if it is your first time. However, if you are from town and plan to come back again the next time definitely try one of their specials. <br><br>Don't be fooled by the descriptions and Yelp photos the portions are huge and very filling. My family and I ordered with our stomach and had enough food for the next day. All food is very fresh and very tasty. Definitely worth the wait. It is on the pricey side we spent about $99 plus tip for 3 teenage girls and 2 adults.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/-f_LNKDtH1sBBmcOzrRscg/348s.jpg", "caption": "Homemade Italian sausage on telera bread."}]}}, {"review": {"des": "What a wonderful spot to have breakfast! I approached the door, and the host opened the door for me- how chivalrous and polite of him! I wasn't sure of what I should order, but my server, Carrie was helpful and suggested I ordered the tofu chorizo. It was so good, and the guacamole definitely tasted better than their next door neighbors (sorry not meaning to talk smack!) this place is so cute and small, definitely has that mom and pop shop feel to it.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/c-W9_0625ZQob3ooA_dHtw/348s.jpg", "caption": "Deliciousness"}]}}, {"review": {"des": "The food here is solid! There is always a 30+ minute wait, but it's totally worth it.  The sassy eggs is my favorite meal item, it has everything you need to get your day started. There is pork chorizo, potato hash, topped with eggs, cheese, sour cream and guacamole!  They also have weekly specials so check that out before ordering.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ozW_V69pshVBoGzfi-LQiA/348s.jpg", "caption": "Howlin' Wolf's Favorite Breakfast Howlin' Wolf's Favorite Breakfast Sandwich"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ip37KvvE2jZ0KD_0qdlw6Q/168s.jpg", "caption": "Sassy Eggs"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/_R7zUO0KNY5qC6GErfyKuw/168s.jpg", "caption": "Bacon pancake platter"}]}}, {"review": {"des": "The best breakfast you will ever have. The sassy eggs are to amazin. The serves is spectacular 10 stars out of 5 :)", "pics": null}}, {"review": {"des": "This is our favorite neighborhood brunch place. The service is always so friendly, and the food arrives fast and is delicious. The variety of menu options makes it fun to try something new every time. I love the seasonal offerings. But they also make your standard breakfast items very well. <br><br>Our favorites are the blueberry pancakes with orange butter, the sassy eggs with chorizo hash, and the cheddar cheese omelet.<br><br>Be prepared to wait for a table on the weekends. It's worth it. You can always grab a cup of coffee and support other local businesses while you're at it. If you're not in the mood to wait, we've also had great success with their takeout.", "pics": null}}, {"review": {"des": "Extremely rushed service. Great if you want to inhale your food and then immediately leave. If you want to enjoy your meal and maybe have a conversation with your friends, go elsewhere. They will bring your check before you are finished eating and then push you out as soon as the plates are cleared.", "pics": null}}, {"review": {"des": "Really enjoyed the food here. Staff was friendly, knowledgeable, and efficient. We were warned that the portions were big, but ordered too much food any way. Should hVe listened. But we got to eat more of the delicious food. <br><br>Parking nearby was easy. Took about three minutes to get seats.", "pics": null}}, {"review": {"des": "$3.50 cents for a nothing special cup of coffee????? Are you serious?????  WTF?<br><br>Seems like instead of raising prices you are padding the pricing on over pricing the drinks. <br><br>Seriously that sucks. I WAS a fan. Now I'm giving you the side eye.", "pics": null}}, {"review": {"des": "Very good pancakes. I got the blueberry ones and they were perfectly light and fluffy. Also had the chicken sausage which was delightful. Servers are attentive. I barely could drink half my mug of coffee before it was filled! Only downside was no real maple syrup.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/aQd6-RZ1FPWGWBh5hqkhCA/348s.jpg", "caption": "Blueberry Pancakes"}]}}, {"review": {"des": "We went for Sunday brunch, there was the usual anticipated wait I had read about. The wait went by quick and they have coffee set up outside while you wait. The food was good, fresh and tasty. The only thing I can't get past is the prices: paying ~20 before tip for an omelet and fresh OJ is a little steep when other places in the area have great quality too and better prices. Also, the service was a little disappointing, staff is a little too worried about getting people out but not checking if you need anything before bringing the check.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/pg-TWuTmdqdqMnnp2QtBbg/348s.jpg", "caption": "Freckled OJ"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/DKbHV99toxqkcOitpDUXAg/168s.jpg", "caption": "Basil, sundries tomatos, and Gouda omelet"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/3BB8F0uXEHqfz6RGMPAQpg/168s.jpg", "caption": "Ham and cheese  omelet"}]}}, {"review": {"des": "My husband, one year old, and I visited for our second time this morning. The food is wonderful and the coffee is hot (and never empty). The staff is attentive, friendly, and efficient. Dining out with a toddler can be tricky but the server came right to the table upon sitting and offered to put his order in right away. Within a few minutes we had a toast happy kid. The crew here cares about their guests and it shows. <br><br>We will absolutely be back!", "pics": null}}, {"review": {"des": "YES, my favorite brunch in Chicago!<br><br>This place though! I had such a fun experience here. Food was great, service was great, interior was great. Okay so got here around 10am on a Saturday, and my friends and I only had to wait about 30 minutes. Not too bad for a popular brunch place right? Put your name on the waitlist, and just chill outside. They provide free coffee right outside the storefront with a menu as well. Loving the egg themed decor btw. Alright alright, before I get to the food, let me just tell you about their top notch service. The woman with the dyed turqoise hair was just the best. She described the menu really well with much enthusiasm along with her personal preferences. The waiters are always going around refilling coffee and water. A+ guys.<br><br>My friends and I ordered the Banana Spiked French Toast, the special Autumn Apple Crisp French Toast, and the Sassy Eggs.<br><br>Banana Spiked French Toast - (5/5) This tasted really good. Don't be scared away by the caramel if you're not a sweet tooth because it doesn't kill the taste at all. The vanilla pastry cream compliments well with the sauce and sliced bananas.<br><br>Autumn Apple Crisp French Toast - (5/5) I swear you must get their special french toast, no matter what flavor it rotates to (prob depends on the season). This was well decorated, and the french toast was soft but crisp with delicious flavor.<br><br>Sassy Eggs - (5/5) If you want something savory or just something to balance out the sweet breakfast options, get this! The chorizo jalepeno hash is to die for. The combination with the eggs, cheese, guac, and sauce left my taste buds wanting more.<br><br>The best brunch here.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/mF2b1HbbKuvDI4qCYzEOtA/348s.jpg", "caption": "Sassy Eggs"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/evZiuOddT-dEdmj1LMZBww/168s.jpg", "caption": "Banana Spiked"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/LQ0zXfgR3_SIHLCoULZ0ug/168s.jpg", "caption": "Autumn Apple Crisp"}]}}, {"review": {"des": "This is the best breakfast/brunch in the city. Always great service and great food. The weekly specials are always amazing and never appear to be an after thought it a way to get rid of old ingredients. I always appreciate their balance between sweet and savory with great options for both. Love stopping in whenever I have a day off!", "pics": null}}, {"review": {"des": "We're always looking for new brunch spots in Chicago so we turn to yelp for ideas. We came across this place and saw they had almost 5stars, so we decided to give this one a try. When we arrived, there was a 10-15min wait which was okay for us because while you wait, you get free shot cups of coffee. Also, usually if you have to wait at a restaurant, it's a good sign that the food is good.<br>This place is BYOB so once seated, we ordered orange Juice for our champagne which was as $11.50. We then ordered food and surprisingly the food came out pretty quick even though it was busy. I ordered the Omelet with potatoes and the stack of French toast. The French Toast was dry yet had this eggy taste to it (not good). The potatoes had no seasoning, and my omelette was sooo over cooked and super thick like 2 omelettes stacked on top of each other. That's how thick and gross it was. There's was almost NO cheese in it either. I might as well had ordered quiche because that was the texture and thickness of the omelette. It was really horrendous. The staff is friendly but the food sucks. We also had to send another plate back because she asked for eggs scrambled soft and they came out hard ass hell. Never again. You'd think that because of their name, they'd know how to properly cook your eggs.", "pics": null}}, {"review": {"des": "Living one block away from Over Easy is one of the biggest perks to my apartment. My boyfriend and I love this place - the phenomenal food, good energy, and everything in between. I truly don't mind the wait when fresh coffee is supplied for free and the light at the end of the tunnel is a delicious brunch! Sassy eggs are my favorite dish so far.", "pics": null}}, {"review": {"des": "Yummy, fresh and never disappoints!  They'll also make almost anything vegetarian with their soy substitute.  Love the artwork, don't mind waiting while sipping on coffee and watching through the kitchen window-at all!  Just know, you'll wait!", "pics": null}}, {"review": {"des": "So my goal while I'm living in Chicago is to eat at a different brunch place each Sunday. This Sunday, a friend chose this gem. Oh my god. The wait was about 40 minutes (something that seems to be recurring in Chicago) but they provided complimentary coffee shots which I thought was very considerate. We were seated and I ordered the freckled OJ and Bernsterns egg scramble. <br><br>Our server was extremely knowledgeable about the menu. Apparently, their brunch options change every week. I thought that was interesting. The options included fancy French toast (not the actual name), a salmon dish, and I forgot the rest. But our server explained each thing in detail. <br><br>The orange juice was amazing. I drank it well before my food came. This restaurant is BYOB so I plan on trying champagne with that orange juice. I'm sure it'll be amazing. My food was equally awesome. There was soooo much flavor. The home fries were also amazing. I will definitely be coming back", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/RsKS07xV8tqmSe4jwik8xw/348s.jpg", "caption": "Bernsterns egg scramble"}]}}, {"review": {"des": "This place has the best breakfast/brunch in town! A+! Also, the owner of the place is the sweetest and really cares about each and every person that walks in.", "pics": null}}, {"review": {"des": "My daughter lives nearby and it is a must for breakfast when we visit. Great service and amazing food. There is no friendlier staff anywhere.", "pics": null}}, {"review": {"des": "This place is greeaatttt, except on street parking!!! The food is delicious! Ambiance is nice and quiet.", "pics": null}}, {"review": {"des": "This place is so overrated. Every time I drive by, the stroller mafia is lined up three deep out front. I know there aren't a ton of options for walkable family-friendly brunch in this particular stretch of Ravenswood, but my word, why make your restless toddler wait an hour outside so you can have a mediocre omelette? Go to Fireside or Danny's Egghead Diner.<br>Over Easy is fine, I guess - they've got all the breakfast staples like French toast and whatnot. I had a smoked salmon omelette that was loaded with salmon, but it was so overcooked, and the hash browns were unseasoned. Pass.", "pics": null}}, {"review": {"des": "Really good food. The omelette we got had goat cheese inside and it was fantastic. The limon French toast was absolutely amazing, but I'm glad my friend and I split each dish because one was savory and one was sweet! We waited a long time to be seated, but the food did not disappoint.", "pics": null}}, {"review": {"des": "You can't go wrong here! Fantastic atmosphere with a very friendly staff! Sassy eggs was possibly the best breakfast I've ever had! Come here!!", "pics": null}}]}