{"name": "owen-and-engine-chicago", "reviews": [{"review": {"des": "Love the food! <br><br>The chicken and biscuit plate is chicken two ways with a creamy sauce. The little biscuits were fluffy and crisp. Wish there was more of those (but the dish is more than enough food).<br><br>The chicharron was crunchy and cheesey. Good appetizer.<br><br>And dont forget the hot chocolate. The hot chocolate came in a tea pot and very chocolatey. The the warm crunchy toast sticks goes really well with it. Great way to end the meal!<br><br>Parking wasn't too bad. Was able to find spots on the side streets that didn't require a permit two blocks away. Metered parking also available.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Yar_nWcTEsvsPuPzakXufg/348s.jpg", "caption": "Chicken and biscuits"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/A3lkW0dC6BLc3v-UzUISuA/168s.jpg", "caption": "Scallop on black lentils with toasted almond"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Y_uABzxUmu8r1hUsEIEUow/168s.jpg", "caption": "Hamanitas"}]}}, {"review": {"des": "I went in to Owen & Engine with high expectations, which were completely met. The food, service, and atmosphere were all excellent. I can definitely see more visits in my future.<br><br>The restaurant is fairly spacious with a second floor containing a bar you can wait at if your table is not ready. I visited on Friday night around 7pm, and I think there was either no wait or a minimal wait; I had reservations, but there seemed to be a few tables available. <br><br>Beer wise, they have a sizeable draft list. They have probably 12-15 taps, about half of which are British beers. I love me some Midwestern beers, but this was an enjoyable change of pace that definitely contributed to the authentic pub life vibe. <br><br>Food wise, I tried many things...<br><br>Roasted Bone Marrow: UNREAL. The server told us this is their play on PB&J, because it comes with cashew butter, plum jam, and turmeric-raisin bread. We were all but licking the plate. I would consider this a must order item. <br><br>Charcuterie & Cheese Board: Huge, diverse, great for sharing. We had a party of 4, chose 2 meats and 2 cheeses, and there was enough to keep us all busy. The meats/cheese were accompanied by bread, something that resembled thin pita chips, homemade pickles, grainy mustard, prune jam (I think), apples, pears, fresh cranberries, puffy mini biscuits, and candied pecans. One of our meats was the daily fresh sausage which happened to be rabbit sausage made with pork fat. It delivered.<br><br>Burger: Simple, thick, meat-forward, oniony. Think worcestershire/steak/meatloaf sandwich. It was juuuust a touch dry. After my visit, I saw that many people add an egg which I think would have added the perfect amount of moisture. <br><br>Chicken and Biscuits: Huge, crispy, insane gravy. I kept stealing bites from my mother-in-law so I could get more of that mushroom gravy. Note to self: get more mushroom gravy in my life. <br><br>Fish and Chips: P.e.r.f.e.c.t. The fish was piping hot and juicy. The breading was crispy and stuck to the fish the whole time. It did not slough off after a couple bites. The fries came with a vinegar mayo dip... which seems like such an obvious fit for fish and chips, yet I've never heard of / seen it before. <br><br>Service wise, great throughout. Our server was friendly and attentive and did a great job explaining the menu / daily specials / helping us order.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/wK_ZXiL8iWuir1IDalLzMA/348s.jpg", "caption": "Chicken and Biscuits"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/KWwv_KSRWSQgz4yy_RAgkw/168s.jpg", "caption": "Fish & Chips"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/t9cDJVWz6BVOTlzFZnQL1Q/168s.jpg", "caption": "Burger - I would recommend adding an egg"}]}}, {"review": {"des": "The best part about this place is the atmosphere! Downstairs we had drinks at a pretty hip neighborhood bar. Then upstairs we had dinner in what felt like someone's English home - very romantic.<br><br>The service was good and friendly. The food was good but not stand out amazing:<br><br>scotch eggs - the wife's favorite dish of the night. It was very good but just 1 egg. I feel like they should have given at least 2<br><br>mussels - top notch, always love mussels and they did it well<br><br>bone marrow - again another favorite, can't really go wrong with this dish and they did it well<br><br>burger - I got mine with egg (of course) and bacon.  Juicy with a good ratio of bread to meat it was moist and melt in your mouth delicious! Though I still have Au Cheval's burger as the best, this one is up there in the top 5!<br><br>brownie and ice cream - they tried too hard to make it different by adding some sort of curry spice. It did not work for me and pretty much hated this dish.<br><br>all in all a nice romantic evening with friendly staff and good dishes.  Come here for the atmosphere and try their burger!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/LEy4qfeZhiGTrxpZx8cLNA/168s.jpg", "caption": "burger"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/LJSAa2iXf3ScNq9raOzl4w/168s.jpg", "caption": "scotch egg"}]}}, {"review": {"des": "We came here a few nights before Thanksgiving, and I've been slacking in getting this review out.  <br><br>I always forget about this place because its sort of in this no-mans land between Logan and Roscoe Village (or is that Lakeview still? I don't even know!) <br><br>We got in and got seated immediately.  The interior is perfect-- simple, clean, warm (in both temperature and mood)  And our waitress was excellent-- friendly, charming, extremely knowledgeable, good banter.  A+<br><br>She helped us pick out a couple really great and unique beers.  <br><br>We ordered--<br><br>Scotch Egg-- a nicely done variant on the scotch egg. It could have used a little more umami flavor in the sausage, but overall it was nicely done.<br><br>Pretzel -- the Welsch rarebit was delicious.   <br><br>Relatively short on those two because the bone marrow was the next dish and as a lifelong fan of bone marrow this is easily one of the top 5 bone marrow dishes I've ever had.  The tumeric-raisin bread was rich and hearty and a great base for the flavors of the roasted and pickled plums mixed with the savoriness of the bone marrow.   It's been a few weeks since I ate this and I find myself planning another trip over to O&E to enjoy it.<br><br>Finally, we had the O&E Burger.  There are dozens of reviews that mention the burger so I don't want to beat on the same dead horse but the burger is great, the flavor is rich, and the onions are delicious.", "pics": null}}, {"review": {"des": "We just went in for our second time, after such an amazing first time experience. This time we made sure to get reservations though (definitely suggest this, even if it is just two people.) <br><br>The first time we just did some cocktails and small plates before heading to a movie. This time we split a large dish and a small one. <br><br>My fiance always sticks with her favorite; a dirty martini. Whereas I was intrigued by the Sir Smokes- a lot. <br><br>Not only was that my favorite cocktail they have, but it was so good, I made sure that was my first drink this second time. Then finished off the night with a couple old fashions. <br><br>For our small dish this time we did the pickles. They were great! a range of different pickled items. Ranging from beats, mushrooms, and onions, and of course pickles. <br><br>Then for the large dish we got the burger. (Make sure to get the cheese on top.) As someone who loves trying all the different burgers in Chicago to find the best. I definitely rate this in the top 15.", "pics": null}}, {"review": {"des": "I was here last night for a friend of a friend's birthday party...having been to other places like this I'm not sure just on me eating a hamburger if I can Judge by this visit alone in everything that's going on....i noticed there was not any ketchup served with the burgher but just the English stuff they serve in jolly old england. Being that this is a English style restaurant and this is the same day England beat Colombia I elected not to complain. In most cases if there was no ketchup being offered as an American I am offended but not so here. The burger is tasty and huge. Outside of Gibson's and few other places this is an award winning hamburger in my book. <br><br>God save the queen and the chef at Owen an Engine<br><br>Nice outdoor  patio ...if you are clostrophibic or however you spell that maybe not for you. But only if that stops you from having a good time but why should it ?", "pics": null}}, {"review": {"des": "Because setting matters to me, I'd almost want to deduct a star for the ugly view of Storage Cube & Movie Cineplex across the street.  But the interior, service &  food/bev are simply deserving of a 5 full big ones.  <br><br>I tried two interesting yet very different Red wines.  The Ermitage ($14 gl) is dry, on the lighter side and has a yummy barn yard funk and a surprisingly effervescent quality.  The Thurston Wolfe ($13) had a medium body and comforting vanilla note without being overly sweet.  <br><br>Get the Scotch Egg.  Flavorful, perfectly cooked with a nice mustard sauce on the side.  How often do you find a Scotch Egg?<br>Chicken Pasty & Mussles were both wonderful and substantial.<br><br> Next time I'll try Pimm's Cup or five...before a movie across the street.", "pics": null}}, {"review": {"des": "Very good burger and old fashioned drinks. The fries were absolutely terrible lol, but I'm not eating out for french fries. Service was great, and the decor is beautiful.  Upstairs is gorgeous. Not underpriced though.", "pics": null}}, {"review": {"des": "Owen & Engine, a gastropub with true British flair and fare. This is a really charming little pub and I was looking very forward to a full meal. Unfortunately, when I arrived there was only a limited snack menu being served. <br><br>Here comes something lame about me; I ate my first soft pretzel in 2016, I never really thought I would fancy them yet I can say that the mustard glazed soft pretzel w/welsh rarebit was beyond the stereotypical soft pretzel. I actually had to Google what rarebit was - I was nervous it was some sort of meat sprinkles. I was pleasantly surprised that two-year aged cheese, mixed with butter, mustard and beer was very lovingly highlighted in its own cast-iron vessel. In my mind, I thought, go crazy, go crazy! If you fancy grilled cheese this would certainly be enjoyed. It feels like a warm hug from that go-to comfort food. Best pretzel I've ever had!<br><br>I dabbled and went with a concord shrub cocktail. It was rather tart for my liking but it was quickly altered and made sweeter for me. With that said, the service was really good. I'm looking forward to trying some of their dinner offerings. Speaking of dinner, this place is right across the street from a large Regal Cinema movie theater so very comfortably you can have a bite to eat and then go to your movie or vice versa and not have to worry about a large commute.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/-8hZByPGbLiRrhIEV7dIWw/168s.jpg", "caption": "Seasonal Shrub"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/gMvFI9EGH7qJGRZmRVBoig/168s.jpg", "caption": "Mustard glazed soft pretzel w/welsh rarebit"}]}}, {"review": {"des": "Me and my better half decided to eat here after seeing a movie right across the street...I had no idea until reading that this spot is by the same folks responsible for Fat Willys rib shack also right next door to Owen and Engine...Well i love Fat Willys and this place is great as well...Im not really a fan of heavy English pub food but the flavors here were nice and interesting and not as heavy and greasy as usual pub fare...Definitely get the chicken and  biscuits...So many flavors happening all at once in this dish that it was a little overwhelming and pretty complex for a fried chicken dish...And the drinks are stellar as well...The future juice was very tasty...As for the ambiance, it's very nice and romantic...I love the look of old dark British pubs and this one is elegant to boot...Love the painting on dinning room wall filled with horses...I would go back indeed.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/lUUpxYUNGrbTN1zU2GY_jg/348s.jpg", "caption": "Chicken & Biscuits...Yum!"}]}}, {"review": {"des": "I love Owen & Engine overall. However I have to say their fish and chips for $21 was not worth $21 to me. It's consider a \" large\" meal plate and it had two small fish fillets with a decent amount of chips \" fries\" with two sauces one is tartar sauce the other malt vinegar mayo. The fish was nice thinly yet crispy and fish was flaky and tasty. My problem was I wouldn't order it again for the price. Yes, they plated all fancy and it tasted good. But people still like upscale with some value. Their burger is probably the best value at $18 for a juicy freshly ground in house burger. It comes with fries on Tuesday it comes with beer and shot or bourbon! That is a better value.<br><br>It's a lesson learned by me to not order it again for the value. I like good eats but I also love value too. I would come back again to have their burger and their bone marrow but I wouldn't order their fish and chips. When I went Fish and chips I really want fish and chips. Pleasant house another English food restaurant has fish and chips for $13 maybe even more now? But it's huge fish fillets and the chips are like home fries in cubes. I like that. Okay enough said I still like Owen & Engine I just wouldn't recommend their fish and chips at $21.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/hOdUf_1KGKYZm0edA6bbWw/168s.jpg", "caption": "Slagel Farms Beef BURGER"}]}}, {"review": {"des": "Romantic spot perfect for an intimate dinner with a loved one. The scotch egg was very delicious and I enjoyed the salad as well, which came with a tangy dressing. I saw many times a burger pass by me so that will be for next trip. <br><br>The ambience of this place was fantastic. Casual yet honey and romantic with dim lighting that wasn't too dark. Great job on the decor - i truly felt like I was transported to the UK.", "pics": null}}, {"review": {"des": "Owen & Engine holds one of the 3 nationally acclaimed burgers in Chicago's list so I headed on over. <br><br>First of all, beautiful place. Lovely stylish decor. Our server Elliot must be an owner or a partner because he knew the menu and details of the food like the back of his hand; How everything was prepared, they way things are cooked and seasoned and the whole fine print. Even spotted him experimenting with cocktails later.<br><br>Anyway, back to the food. With the help of friends, I ordered the Burger, the rib-eye streak and the assorted pickles.<br><br>Pickles were incredible. A mixture of carrots, Brussels sprouts, mushrooms, peppers, beats, olives and MORE. Tasted phenomenal.<br><br>The steak was perfectly cooked to medium rare, and beautifully seasoned. Very tender and juicy (ribeye is a fatty cut). <br><br>At $35 you get what you paid for, but as a wild carnivore, it can wheel a little underwhelming when your steak is gone and you haven't broken a sweat. <br><br>The burger was wonderful. House style, it doesn't come with cheese or a fried egg, but are options for add-on. This burger, named the \"Slagel Farms Beef Burger\" is a 9oz patty with caramelized onions, and malt vinegar mayo. <br><br>While truly a piece of a art and a must-try, for me this burger still trails behind Au Cheval and the Little Bad Wolf. Probably because I crave a bit of texture and moisture. Au Cheval's bernaise sauce and sliced pickles do the trick for me. <br><br>The fries and the garlic mayo aioli type sauce (not sure what it was) were out of this word. Much to my amazement they surpass anything Au Cheval has served me.<br><br>This place is  for me.", "pics": null}}, {"review": {"des": "I've been here several of times for before-movie-drinks or to pick up my Scotch-Egg-loving husband, but I recently dined in for my first full meal here. I left super impressed with the food!<br><br>My husband eats their Scotch Eggs about once to twice monthly and will swear that they make the best Scotch Eggs EVER and while I do not consider myself a Scotch Egg connoisseur like him, I can attest that it is a solid scotch egg. Perfectly cooked with a gooey yolk & crispy fried portion and a great meat to egg ratio (which is obviously important in any scotch egg, duh).  <br><br>Since we've obviously tried the Scotch Egg a few times, we decided that on this particular evening we were going to branch out, so we started off with the Beef Tenderloin Tartare. I have only recently gotten into this tartare thing, but this one was delicious-ness! The beef was splendid, the quail/hen egg made the consistency perfect and the trout roe gave it great salinity! Perfect bites!<br><br>I ordered the Slagel Farm's Beef burger and must say it competes in my mind for one of the best burgers in Chicago. While I'm sure it is delicious as a stand-alone patty, I did kick it up a notch by adding in, not just one, but ALL of the add-on options (cheddar cheese, bacon & an egg). I have no regrets and feel no shame. It was amazing. <br><br>My husband ordered the Fish & Chips, which while very good fish and chips are still just fish and chips.. get it? Basically, he was eyeing my burger the whole time. <br><br>Final thought... Holy Malt Vinegar Mayo... the world is a better place because of this.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/20xHWFTg_PXFeviRfCGi_Q/348s.jpg", "caption": "Slagel Farms Beef Burger with egg, bacon and cheddar cheese added on!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/r8nMgTT-Pv5DgKh1HYWkXg/168s.jpg", "caption": "Beef Tenderloin Tartare"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/EnZgo_FRzFnHHPtYoZM4jg/168s.jpg", "caption": "Scotch Eggs"}]}}, {"review": {"des": "Heard of this place a few times so I was looking forward to trying this place. Went to celebrate a friend's birthday. Located in a random place on Western, across the theatre on one side and across from Burger King on the other side, I was surprised this place was a popular place in Chicago. I was also lucky to find parking spots on Western and plus more behind me!<br><br>Walking in, I was greeted by the friendliest hostess! She welcomed me to the restaurant and sat me near the window. Walking in at 6:30 on a Thursday night, it was quite empty but by 8, it was a full house. She also let me know that it was rare for me to find parking on Western & and that the theatre has $2 parking all day. <br><br>My friend recommended the Scottish Egg and I am so glad I got it! It was damn good and the only dish that I've really enjoyed. I've also had 3 other dish. I could've totally skipped the fish & chips. I wasn't expecting a soggy crusted fish and it was too oily for me. I was also pretty full at that point so my review of fish & chips may not be fair. The bone marrow and on point. The raisins in charred octopus were a nice touch to the dish. <br><br>The restaurant gave us complementary birthday Mignardises desserts. That was very kind of them.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/7eWRzEV5EMNAcJZN_csZgg/348s.jpg", "caption": "Seasonal Shrub cocktail $14 April 2018"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/_BRE9TvvHqB3bDkIjqymig/168s.jpg", "caption": "O & E $12 April 2018"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ee2kgoQLL5dFfrLRez2vFA/168s.jpg", "caption": "Scottish egg My 1st one ever(!) and I loved it! $8 April 2018"}]}}, {"review": {"des": "Definitely a unique establishment in terms of decor and menu items. Very nice people all around from the greeter to the waiter to the server. Shout out to Santiago!<br><br>One thing that's worth noting is that we had difficulty deciding what to order because all of the options looked good so there's tons we missed out on. We ended up getting the burger and liked that they took pride in the meat being from a local farm. Solid coffee, the rose lemonade was delicious and came in the most adorable bottle, and the scotch egg was 'the best I've ever had' according to my husband. I absolutely loved the scones as they were warm and we got to taste a fruity one, chocolate one, and savory. The clotted cream and pear butter were perfect. <br><br>We never even got to dessert so we'll definitely be back, but this is a special occasion place for us because of the price. Our lunch was $84 which felt like a lot.", "pics": null}}, {"review": {"des": "Great gastropub! Attentive and friendly service, the waiter came by to check on us several times. Interesting appetizers, we had veggies and yogurt which was delicious and fresh! But really just like everyone came for the burger, which did not disappoint! Their burger is on par with Minetta Tavern and Peter Luger burger in NYC.  Also it was a good size portion as well topped with caramelized onions. We opted not to go for cheese, bacon o  egg on top. The waiter noted that their burger was a blend of several beef cuts made in-house,believe it was chuck, short rib and brisket.<br>Finally, a great beer and wine selection.<br>A must stop for you in Chicago.", "pics": null}}, {"review": {"des": "SERVICE: The service here is phenomenal. Our waitress knew everything on the menu back to front, and she had a great attitude. One of my table mates ordered a beer that could come two ways-- cold or at 55 degrees, which would bring out some of the flavors according to the waitress. All in all, she managed to convince half a table of people to buy warm beer. Pretty impressive if you ask me.<br><br>FOOD: Assorted pickles, Virginia Peanuts, side of potatoes, biscuits and Hunter's Gravy, and Tuna Melt.<br><br>The Tuna Melt was delicious. The Tuna was generously applied to two crispy, buttered pieces of everything bread that I believe were pan fried. The two halves were topped with a slice of boiled egg and a tiny anchovy. Yum! The accompanying salad was also very delicious and the dressing was incredible. The salad included sweet potato chunks and carrot slivers. <br><br>The Virginia Peanuts were awesome. I love peanuts by themselves, but the sweet, savory, spicy made this dish.<br><br>The pot of pickles was a little misleading, and it wasn't just pickled cucumbers (which most people think of when they hear pickles), but rather pickled onions, pickled red peppers, pickled banana peppers, pickled cucumbers etc. Pretty good stuff. I put some on my sandwich. <br><br>The Biscuits and Gravy was very good, they gravy is what really shone on this plate. they can do the eggs any way you like. <br><br>The potatoes came out a bit late, but she assured us that she would not charge us for the potatoes since they were delayed. When they came out, they were hot and crispy, but a bit over-salted. <br><br>DRINKS: B2D2 beer. Red Snapper. Glass Apple.<br><br>The Glass apple was essentially a strong, gin-leaning pear-tasting martini and definitely had a lot of strength. As a pretty heavy-weight, I only wanted to order one of these since I was driving. The taste and color are both light and refreshing. I really loved this cocktail, but opted to switch over to the b2d2 afterwards. <br><br>The Red Snapper was essentially a Bloody Mary, but with much more intention and quite a bit spicier. This was very strong and was also a sipper. <br><br>ATMOSPHERE: This place is obviously a well-oiled ship, everyone here moves through the small passages effortlessly and everyone seems to know the menu pretty well. Its a small place, and it filled up pretty soon after we got there, around 11:15.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/FMPGZoet77Pp1A9UcyQenA/348s.jpg", "caption": "Tuna melt up close"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/MDWNlJo3CbL1JahVVRdLxA/168s.jpg", "caption": "Assorted pickles, side of bacon, side of potatoes"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/PhOC7OqLJ9PkmmJgaQS_PQ/168s.jpg", "caption": "Tuna Melt with salad"}]}}, {"review": {"des": "First time I went here was when it first opened and the hamburger was literally the best thing I'd ever eaten. The waiter also took time to tell us what the meat mix is (it has filet in it and 3 other parts of the cow).. and it was delicious!!!! The second time I went was a few years later (after talking to everyone about how good it is), and the burger was super mediocre. Way less juicy (maybe even a little dry, if you can call a medium rare burger dry), and not quite salty enough. Maybe it was an off night, but who knows. Also, I had called to ask to change our 6pm reservation to 5 people instead of 4, and they said they couldn't accommodate us and we'd have to waitl til 9pm, so we just went with 4 people and it turned out that the entire upstairs area where we were sitting was still empty until we left at 730pm. A little silly an unnecessary.", "pics": null}}, {"review": {"des": "We have visited this restaurant many times and we love how consistent it is with the food. Ambience is casual but romantic, they have a patio which is very enjoyable during summer, there is also a room with a large table that can accommodate big parties.<br>Cocktails are very good. The burger is one of our favorite items for lunch or dinner but we actually like their brunch the most.<br>I feel this place is a must, you won't be disappointed!", "pics": null}}, {"review": {"des": "Really cozy and cute spot with great service and good food...<br><br>Came in to try the burger and of course needed to sample a few more things:<br><br>- corn dumplings - flavorful, rich and a good one to share <br>- cheeseburger- so I'm a thin patty girl, but as thick burgers go, this was pretty good with lots of juicy beefiness.  Good cheese and onions on a soft bun, solid burger by any standard...<br>- green beans - tried to be slightly healthy but they definitely didn't taste low fat :0<br>- milk and cookies to end, very comforting with the perfect amount of sweetness<br><br>Overall would definitely return to try other things (bubble and squeak is at the top of the list, obvi)", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/F2vHSPtMhneRDroLaixceg/348s.jpg", "caption": "Cheeseburger"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/mpPCyY51X55PSuMSNCxJTA/168s.jpg", "caption": "Corn dumplings"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/7R4nZnfOxf_YfFvOUYbpOg/168s.jpg", "caption": "Green beans"}]}}, {"review": {"des": "Food, service and atmosphere: 5 stars! Perfect date night spot. Had the most delicious pot of mussels and my boyfriend devoured the chicken and biscuits, paired with a great old fashioned. We will be back sooner than later!", "pics": null}}, {"review": {"des": "TL/DR: burger is fantastic and different and makes you want to sleep for hours afterwards... That's a good thing. <br><br>I go to Chicago every year and will definitely add O&E to my list of must stop places. This burger rivals Au Cheval (don't @ me just try it) in terms of WTF, smack you in the mouth goodness. It's thick, almost like a roast, and simple -- oh so simple. Bun,  grilled onions thick ass meat patty is all you need to put one's self into a good coma for hours. <br><br>Oh yeah the beer list is solid with some great Belgium bottles that wander into the whale category.", "pics": null}}, {"review": {"des": "Excellent dining experience!! Reservations highly recommend. We didn't have them and ended up sitting at the bar. It turned out to be fine but it's such a cozy and romantic place, that a table would have been nice. So the food and drinks... Both excellent. I was really impressed with the expertise of the servers. They know their food and drinks well and were able to make sure on recommendations. I had a burger with grilled onions on a potato bun that was cooked to perfection. Unfortunately, I don't remember all of the details since it was two weeks ago but you will not be disappointed", "pics": null}}, {"review": {"des": "I've been here a couple times within the past few years. I came back recently to take advantage of their beer, bourbon and a burger deal on Tuesdays. It's always a good time when you start a meal off with a shot of bourbon and chase it with a nice cold beer. Am I right?! I've had their burger once before and from what I remember, it was pretty juicy. The burger patty was thick, but this time around I found it to be a bit dry. The toasted buns they use are good and their fries were very good and crunchy. But, the burger was a let down. I'll be going elsewhere for my BBB.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/KvwX4CTbIkK_NRdoS2f0fw/348s.jpg", "caption": "Burger and fries"}]}}, {"review": {"des": "Honest review: (burger really over exaggerated) food was ok but not great like nothing wowed me enough to come all the way over here to eat again. Service: the service is amazing there really nice give clean plates describe menu items really did an amazing job. Ambiance: the ambiance is like a pub but like cute like its dark inside so good for a date nite n the atmosphere is cool so its a good hangout like they play really good music like u will wanna hangout here all nite. N its big two theres two floors Food: (menu same as website) hmm like everything was ok but feel like how so many people talk this place up n talk about how amazing the burger is im like meh the food was meh left wishing i went somewhere else like its ok just nothing blew me away n like fix dessserts they were really basic $12 dollar desserts have to be amazing. best things: falafel/ banana cream pie<br><br>Falafel $14: I usually dont like falafels but this was good. It was really crunchy just wish they were more flavorful. Loved the humus it was really good liked the chutney just wish there was more liked the onions n cilantro for freshness liked the addition of fresh pita<br><br>Bone marrow $16 the bread was really good n it was buttered just wish there was more. Bone marrow was cooked good n seasoned my issue was dont think all the citrus wasnt a good pairing. The reason is because the citrus added a bitter flavor so like the marmalade wasnt a good balance of sweet n acidic. <br><br>Burger $18 plus $3 upcharge for bacon: ok ok so alot of people are addicted to this burger n claim its the best. It was a good burger it was really moist cooked perfectly it was really juicy just it needed seasoning. Its kinda like a plain burger though like it was good but nothing unique something u can easily make at ur house. The bun was good but the bottom bun got supper soggy because of the juiciness of the burger idk how they could fix that but didnt mind it jus its really messy to eat my face n hands were covered in grease n hamburger juice. Theres camarlized onions. U know it doesnt come with cheese or bacon that's disappointing. The bacon was crispy n actually made to order which was good. The star of the burger honestly was the aioli n the fries. The fries were supper crispy n seasoned well n the aioli was supper decadent they charged me +$2 upcharge for more aioli its a big burger n theres alot of fries how am i supposed to eat it all with a lil container of sauce. Good burger just ive had better burgers if they made it more unique n added more stuff to it then it would be a better burger u def could find a better burger for less then $18 like for $21 bucks could eat a burger with foie so dont really think the value is there either for this burger<br><br>Grilled octopus $16: i think the octopus was cooked perfectly n was crispy but thats all the positives ive had a lot of squid ink pastas n thing that instead of putting tiny components like raisins make a sauce very difficult to eat pasta n tiny raisins together also didnt get any hear either.<br><br>Banana cream pie $12 it was good but like it was like a normal banana cream pie the best part was the candied hazelnuts the carmel was to thick n there was barely any left. Chantilly  cream was good but to thick it was over whipped. N like a $12 dollar dessert should be the best dessert ever not have a crust thats to hard to cut through <br><br>White chocolate cheesecake $12: only part i liked was the cheesecake n the merangues. Theres to much going on in here theres a lot of chocolate that over powers the cheesecake n really doesnt need to be there n like there was really dry chocolate cake. The worst part was the passion fruit it was so tart ruined the dish.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ZLIKEIq1DCeHPk_LK2OALg/348s.jpg", "caption": "Banana cream pie"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/LbrzYpYKnsbUC5-baNjqqg/168s.jpg", "caption": "Banana cream pie"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/6BtrjOAGd5vRHmXq8Xen5A/168s.jpg", "caption": "White chocolate cheesecake"}]}}, {"review": {"des": "So I can't really compare the actual burger to Au Cheval considering the last time I had Au Cheval was a couple years ago, but this burger was darn good. No skimping on the fat amount of juicy meat either. Definitely come for a Tuesday burger, bourbon, and beer special, and definitely make a reservation to guarantee a spot beforehand. <br><br>Our service was excellent and speedy even on such a crowded Tuesday (yes Tuesday) night. The waitress really made sure I knew the goodness I was getting myself into by ordering this burger. It comes quite simply with just the meat, caramelized onions, and delicious fries. You really don't need anything else, surprisingly, as I tend to be more of a toppings girl. The beer pairing is great- even though you can't choose the type of beer, Owen and Engine does an awesome job selecting for you. <br><br>I can't even believe I finished all that meat, but I did it. You can too and you probably will because it's so juicy and tasty.", "pics": null}}, {"review": {"des": "What an amazing time we have each time we come to your establishment.  We have celebrated birthdays to just brunches.  Your menu is one of a kind in this side of the pond.  Staff is nice and accommodating.  Love your upstairs ambiance.  We will keep coming back definitely.  Cheers !", "pics": null}}, {"review": {"des": "Delicious charcuterie board and food! Their cheeses with meats, plus crackers and fruits, were all so delicious. Their scotch egg was good too, crispy on the outside with the right amount of meat to egg ratio.<br><br>I also got their burger, I got it medium well as I was pregnant and it was still really moist and delicious. It was a simple burger with caramelized onions on top but the patty was really good.", "pics": null}}, {"review": {"des": "Super tasty food in a phenomenal atmosphere.  The restaurant is super cozy and has major British pub vibes.  There is a great burger deal on Tuesday's that gets you a burger, a pre-selected beer, and a whiskey shot for $18.  Great place for a date night or a nice relaxing dinner!", "pics": null}}, {"review": {"des": "My friend and I walked into a full Owen & Engine (it's not that big) after a movie next door at 6ish on a Saturday evening and were told their tables are booked until 9 and the bar is full, so we were looking up alternate dinner options. Then, the hostess notified us of 2 spots opening up at the bar so we happily took our seats there. It's got to be just as cozy as the tables...faux candles, friendly bartenders, and a view of their impressive liquor collection.<br><br>On that note, I wanted to get lit so I perused the drink menu and ordered the hardest drink I could find: pomegranate green tea. They had a variety of teas, which come in a nice porcelain teapot and cup. Also comes with a sweet little biscuit on the side and milk upon request.<br><br>They have a bunch of dishes I want to try, but ended up getting the burger because some call it the best in the city. Wouldn't agree with that statement but it is undoubtedly delicious. I'm not a meat expert by any means but the beef tasted high quality and it was very well salted. For my fellow bread novices: \"house potato bap\" is the bun it comes on. The meat is juicy, so juicy that it flows into the plate and makes the bottom of the bun sightly soggy. The malt vinegar mayo goes well with the fries, but wasn't as flavorful as I was expecting. The caramelized onions also were good but I could've done without them, not being a huge onion guy. If you want, you can also add an egg, cheese, and/or bacon (or at least those options were available when I went).", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/MOfxoHe_lf_Hwns5au8Gjw/168s.jpg", "caption": "Burger"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/3QZkjEpEoBKl7r3tJ58qSw/168s.jpg", "caption": "Pomegranate Green Tea"}]}}, {"review": {"des": "Solid British pub styled atmosphere and food. We've been here a few times and like others have mentioned Tue is their BBB $16 special, aka a specific Beer, a shot of specific Bourbon and their standard Burger for $16. A great deal, considering the Burger alone is $18. We've also had their fish and chips, Scottish egg and it's all great. They use high quality produce sourced from local farmers. <br><br>They have an extensive beer, whisky, scotch and bourbon list with comfortable lounge chairs upstairs. <br><br>Parking across the street in the movie theater parking lot is inexpensive. I am told movies are also discounted on Tuesdays and hence make for a fun and inexpensive date night.", "pics": null}}, {"review": {"des": "I came here for Sunday brunch. They take reservations from their website.<br><br>When we arrived we were seated upstairs near a window. The decor is old fashioned and cozy, I really like the atmosphere here. <br><br>For lunch I had the burger with white cheddar added. The price is a little stiff $18 + $2 for the cheese but everything is high quality and delicious. Plus the burger is huge and they give you a big portion of fries. I was soooo full! The buns are made in house and were perfectly soft which went great with the burger. <br><br>Our server was very friendly and helpful!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Z7bEUtaq1gKBpqJVvGAkFg/348s.jpg", "caption": "Burger with white cheddar - very good"}]}}, {"review": {"des": "I can't believe we had a $27 burger! My boyfriend and I came in for lunch. I order the bangers & mash. This alone gave it the 2 stars of this review. My boyfriend ordered the burger. He wanted bacon & cheese added. The waiter asked if he wanted greens which he automatically said yes. I knew there was going to be an added charge for the cheese & bacon, but we were also charged $2 for greens. I couldn't believe it! Never ever have I been charged for greens! If I ever go back, unlikely though, don't order the already $20 burger. It wasn't worth even $10!", "pics": null}}, {"review": {"des": "I came here last Friday night with the GF for the first time as I heard this place serves a pretty damn good burger. Surprisingly, we were able to find two seats at the bar around 8pm. The place is small as it only sits about 50 people and is dimly lit. <br><br>We started off with the pretzel and we both ordered the burger. The pretzel was very tough, but it came out piping hot and the cheese sauce was very flavorful. It also had some sort of mustard on top that gave it some flavor. It was ok, but I would probably not get it again as I like my pretzels soft. <br><br>I ordered mine with cheese medium and she ordered her's without cheese medium rare so we ended up splitting them. These burgers were flat out amazing! Now, I will admit that this is the first time ever that I preferred a burger without cheese. But the cheese was overwhelming and you couldn't taste the seasoning as much. I think this is one of the best burgers in the city. I'm debating whether or not it beats Au Cheval, but it's up there. It definitely beats Kuma's Corner, DMK Burger Bar, and M Burger. <br><br>This place gets 5 stars not only because of their food, but I thought their service was excellent too. We talked to the bartenders, who were friendly, they made sure we never ran out of drinks, and made sure we were accommodated. I drink a ton of water as I am a runner (plus I had an 18 mile run Saturday morning) and I must have went through about 12 glasses in 2 hours. My glass was rarely empty and I never had to ask for a re-fill. They also had some good quality brews too. <br><br>So make sure you try the burger as they have a great deal on Tuesday! I heard they also have some other great dishes so I will have to come back and try!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ro03NMvO1wbqmVp0HCV_wA/348s.jpg", "caption": "The Burger with cheese! Plus their fries were amazing too!"}]}}, {"review": {"des": "We came here on a Friday night. I'd recommend reservations- there was a 90 minute wait for two people. Fortunately we were able to snag seats on the second floor in some comfy armchairs. <br><br>We had Eric as our server and he was great. Informative about the menu and really friendly. My husband had a really good stout on tap and I had one of the Pimms cups. I love Pimms but this was a little sweet for my taste in cocktail. <br><br>We split the cheese plate which was huge for the price and good quality- lots of fixings and flavors going on. We then split the fish and chips which was SO light and flaky and yummy. The malt aioli was really good as well. <br><br>We will definitely be back! And since everyone else was getting burgers that's probably next on our list :)", "pics": null}}, {"review": {"des": "My kinda pub!  Small, cozy, good service, family atmosphere, great food, plus beer pairings to go along with the food.  The bartenders know their beer too.  I don't live nearby, but if I go to the movie theater across the street, there's a 100% chance I'm going to O&E after.", "pics": null}}, {"review": {"des": "When craving a burger, there are only a handful of places that I look to, and Owen & Engine is definitely one of them.  The burger here is simple and classic, perfectly cooked with caramelized onions and an onion bun.  No special sauce, cheese,  or extra toppings here.  Anything else would just be in the way.  You do have the option of bacon or cheese, but I encourage you to resist the pull to add any extras.  This melt in your mouth burger does not require any add-ons. <br><br>The service both times I have been here has been outstanding as well.  Staff is super friendly and efficient.  If you're in the area (or not), make it a priority to visit.", "pics": null}}, {"review": {"des": "Excellent English-style pub with unique burger, great service, and good beer menu. Stylish interior with comfortable ambiance that would be good for either impromptu casual dinner or something more dressed up. <br><br>Started with a scotch egg and followed with their vegetable korma. My partner had their burger, which was so rich and delicious that he and I switched dishes halfway through so he could take a breather.<br><br>Vegetable korma was exceptional--the paneer is perfect and spices are complex and delicious. Two dishes and small starter was probably just enough food for most. <br><br>Our server was wonderfully knowledgeable and kind, even offering some local breweries to try since we were curious about local beer. <br><br>Would definitely return!", "pics": null}}, {"review": {"des": "I just keep coming back here! Everytime we go to the movies we stop here for anything from a drink, a snack, a full dinner and/or DESSERT!<br><br>They have the most talented Pastry?(dessert) chef. Innovative, creative  and amazingly presented.  Always a combination that you initially think, huh? Then you taste and you are sent to heaven.<br><br>The wait staff really know their stuff and can easily make suggestion for the perfect drink pairing.  Bravo to this attractive group of bearded plaid shirted folks.", "pics": null}}, {"review": {"des": "Today was my second time back to this amazing place. It's official. I never leave disappointed. We started out with the scotch egg. It was cooked to perfection. Then my partner had the Ploughman's platter which he wouldn't share because he loved it so much. And I had the Bubbly and Squeak! If you love mashed potatoes, these are your spirit child. It's all delicious veggies chopped up and put in mashed potatoes, topped with a layer of English cheddar (I added the egg on top, but considering leaving it off next time). Don't judge me for eating only mashed potatoes for lunch. They're my spirit child!", "pics": null}}, {"review": {"des": "Not everyone appreciates premium ingredients and expert technique used to enhance familiar comfort foods. From the 2 yr aged English cheddar to the housemade pickles this burger has been elevated to the highest level. <br><br>Some have lamented the upcharges for add ons, lack of lettuce & tomato or even the $17 pricetag. Keep in mind we're talking a 1/2 lb Slagel Farms short rib/brisket/chuck premium burger blend, well seasoned atop a freshly baked brioche onion bun. The buns are baked in-house, they have a pickling program and even the ketchup is made in-house. The bun is buttery and adds to the richness of the burger. <br><br>I usually order a side of lettuce and tomato at Au Cheval, but I think that would throw this burger off. You wouldn't ruin a White Castle slider or a McDonald's single cheese with L&T would you? I'm​ partial to thin patties, but this is an exception. Unlike the Longman & Eagle burger, which I find to be greasy, this burger is extremely rich in a good way.<br><br>I would also describe the burger as notably tender. The key is not overworking and loosely packing as the burger is formed. I love a cheap simple burger as much as the next guy, but if you have the palate to appreciate the refined craftsmanship of quality ingredients try this burger. <br><br>They say the cooks in Hell are English. If they helped make the Owen & Engine burger, count me in.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/63n50SI2bJLupN3t7AtJoQ/168s.jpg", "caption": "Housemade Sour Cream Old Fashioned Doughnut - Strawberry-Basil Glaze"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/EgDX_gYrkoerVyBqipmNBA/168s.jpg", "caption": "Miskatonic Grendel"}]}}, {"review": {"des": "This is really a 3.5 star review.  <br><br>I enjoyed the overall experience at Owen and Engine. Our server was funny and very descriptive, plus he had a good sense of how long to hang around -- he was really great.  <br><br>My friend got the pork rinds and they tasted like sour cream and onion chips. That's not my personal favorite flavor but if you like those generally, the pork rinds are probably a go. They looked really cool, too. She also got the charcuterie which I'm told was good. I had the burger and after reading all the glowing reviews, I was ready to smash. It was cooked perfectly but not seasoned well enough. I rarely add salt to my food but that probably would've helped. Maybe the expectation is that you'll add toppings, but all I wanted was a burger (no cheese or egg etc.).", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/JCHCeN9gplNNtpRnBJzYsg/348s.jpg", "caption": "Burger (check the juices coming from it after I cut it!)"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/VIbweRtKAkRbR0lPf4puGg/168s.jpg", "caption": "Beef burger"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/EeayE8IgeRecDLsIwbTZRw/168s.jpg", "caption": "Charcuterie"}]}}, {"review": {"des": "Came here on a Saturday morning, there was no wait. We came for the full English breakfast, and it was excellent. <br><br>To address the elephant in the room, or at least the photo, it was streaky bacon rather than British back bacon. However, the two rashers were delicious and crispy. Banger and blood pudding were good, especially with HP sauce. They also have a tasty housemade ketchup as well as Heinz. <br><br>The mushrooms were either marinated or cooked with vinegar? The slight acidity was an interesting match with the salty meat bits, and maybe made up for the lack of tomato in the fry up.<br><br>The highlight was definitely the housemade baked beans. I will never say no to a real tin of Heinz beans, but this tasted of fresh tomatoes, and inspired me to make a batch when I get home to my overflowing tomato garden.<br><br>The Red Snapper cocktail was exactly to my taste, as I usually ask for gin or Scotch in my Bloody Mary if available. See photo for ingredients. Nice selection of beers on draft. Solid service.<br><br>We left happy and desperately in need of naps.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/2Sxu79CiHZCQQyMqupgkvQ/348s.jpg", "caption": "Draft list"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/1BeBCbIeV_luOOYWtVqFXA/168s.jpg", "caption": "Beer and Red Snapper brunch cocktail"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Nqz5hsk7D5fWiPT3Q-kyww/168s.jpg", "caption": "Full English breakfast!"}]}}, {"review": {"des": "Loved this place! My boyfriend and I came here for date night and everything was excellent - food, atmosphere, and service. We tried the scotch egg, bubble and squeak (out of this world!!), the burger, and wings. All the food was 10/10. Topped everything off with their house shot (malort and grapefruit liquor) and some cocktails. We will definitely be back!", "pics": null}}, {"review": {"des": "Came here to try the burger that everyone glows about.  We were surprised by how pricey the menu was for the type of food that was being served. An $18 burger ??  The burger ended up being quite tasty, cooked very well, pretty juicy.   The service was great, our waitress was very attentive but not annoying.  And the ambience in the restaurant was great - dimly lit, nicely decorated, very clean.  The only drawback being that it was a bit overpriced for a burger.", "pics": null}}, {"review": {"des": "Eating brunch at Owen & Engine might be the first time I realized I am a bad bitch. Started off with tea and crumpets, really buying in to the whole English thing. Ended up sharing the pastry platter and finished things off with the full English fry up. Everything was absolutely top notch. You can really tell they care about the food, the service, the whole experience. This place is boujee in the best way and I will certainly be going back. <br><br>Also, I'm sure this is true at all times here, but if you're going for weekend brunch then make a reservation. I've gotten lucky and found walk-in spots at the bar but you'll definitely want a reservation.", "pics": null}}, {"review": {"des": "Excellent English-style pub with unique burger, great service, and good beer menu. Stylish interior with comfortable ambiance that would be good for either impromptu casual dinner or something more dressed up. <br><br>Started with a scotch egg. I had their burger, which was so rich and delicious that it was  switched dishes halfway through so I could take a breather.<br><br>Two dishes and small starter was probably just enough food for most. <br><br>Our server was wonderfully knowledgeable and kind, even offering some local breweries to try too.<br><br>I would definitely come back soon.", "pics": null}}, {"review": {"des": "Knocking a star because this place is pretentious af...but keeping 4 stars because it's still incredibly delicious.<br><br>The old fashioned isn't the best I ever had, but it was certainly solid. Our server was knowledgeable and attentive.<br><br>We split two dishes, both which were prepared masterfully. Asparagus dish was prepared 3 ways - pickled, seated and shaved. Every bite was amazing. The ploughman plate had some of the freshest ingredients I've tasted in a while (freshly baked bread being the highlight). <br><br>In conclusion, if you can deal with the next level pretentious attitude, the food is worthwhile.", "pics": null}}, {"review": {"des": "Excellent... Well executed food and service, with a very, very, nice property/setting that aims to place you in an exceptional gastropub experience!<br><br>If this is what Gastropubs are like in Chicago or elsewhere than bring this culture of restaurants into existence!<br><br>Food is prepared, seasoned, and cooked as if it aims to near a target of perfection. <br><br>This burger is one of the best. It may be the best most will try, without exaggeration. It's the flavor- from the simplicity of the bread being buttered and toasted, the caramelized onions, to the juices of the good fat that the quality of that Slagel Farms meat imparts upon the overall burger, with that touch of aioli... It is to savor! Simple is better when it's quality and done right (seasoning and cooking properly). At Owen & Engine it is done right!<br><br>Only thing... It is truly ridiculous that they charge more for cheese on the burger, at the price point that they are at it echoes, \"Really, why am I doing this to your pockets\"! Many Gastropubs in Chicago offer Slagel burgers, now, and most aren't overcharging for cheese, ever since these Slagel burgers trended to be priced higher than others kinds of quality burger meat. Yes, Owen & Engine does execute the burger better than all or most but they should really consider not charging more for cheese. Reserve the extra cost for bacon, Etc. Imagine by charging more for cheese, if you add bacon it's about $20 for the plate. The Chips (fresh cut fries) portion are fair but it isn't a mountain of fries so for $20 that is overall steep. (Reason for star taken off)<br><br>On the fair note, it's awesome that they have weekday specials. It is a good way of regarding the customers who really want to continue to return to or try Owen & Engine without breaking the bank. It's respectable to the customers and is an excellent business decision that should enhance the profitability of the establishment in its entirety.<br><br>Back to the food... The Fish and Chips are also a win! It's seasoned well and fresh tasting. It is not greasy and is a nice portion. Throw some malt vinegar on this meal and you're good to go.<br><br>Don't forget to have a pour of Bourbon or a \"classic style\" Whiskey Sour cocktail. Can't forget to mention the Engine's that they have pouring out a nice selection of brews.<br><br>Also,  if you sit at the bar at, \"a certain hour\" you get a free shot on/with the house. <br><br>Owne & Engine offers great food and professional service that is served in an \"attention to detail\" enviornment!<br><br>So much more to try from the menu...<br>Highly recommended.<br>One of the best!", "pics": null}}, {"review": {"des": "Let me save you some reading- GO HERE ON A TUESDAY FOR TRIPLE B NIGHT! Burger & fries, a beer, and a shot of bourbon- FOR $16!!  <br><br>Their burger is hands down the best burger I've ever had.  It is incredible.  It is flavorful, juicy, and perfectly cooked and seasoned.  Service on Tuesdays (the only times I've been- it's too good a deal to pass up) can be a bit slow, but that's to be expected given it gets busy FAST.  I would recommend that if you go, you anticipate a leisurely dinner.  Luckily that is easy because the atmosphere is warm and cozy, like your millionaire grandfather's library/study (I don't actually have one of those, but I can imagine from movies), and it isn't too loud to hinder conversation.  <br><br>My SO isn't into traditional burger toppings like lettuce, tomato, raw onion, ketchup, etc. because he's a \"chef\" and those flavors don't \"naturally work together\".  While that is pretentious as hell, I agree with him on this burger.  Meat, caramelized onions, and possibly cheese or a fried egg (he gets the egg, not me, I think runny yolks are gross) are ALL you need on this burger.  Anything else is just a distraction.  This is a perfect burger.<br><br>We've also had the scotch egg, which was fantastic.  But how can you go wrong with a boiled egg wrapped in sausage and fried?  Their housemade mustard they serve with it is great too- I recommend asking for a side of it to dip your fries from the burger in. <br><br>Anyways- put this on your list if you're on a best burger quest.  I guarantee this will make the top 10, if not number 1!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/3E_VUkiQIMsUkmGNPfuZHQ/348s.jpg", "caption": "Triple B Tuesday! Best burger in the city!"}]}}, {"review": {"des": "Taking a star off of my original review because of the response I received from the manager. I do realize my original review was harsh. Honestly I was really upset with my experience! However, I do believe the first reaction is the best one. BUT that said my issue wasn't really with the service, it was with everything ELSE. The service just sullied an already poor experience with the bad FOOD and ridiculous pricing. What is ALSO not okay was the manager's response. She did apologize for the service, but it feels like she did not read my review at all. Aside from the fact that she got my name wrong in her reply, she also failed to recognize that the service was NOT the issue. Even if it were, I do not want to put someone's JOB and LIVELIHOOD at risk because of it. I find this response to be completely unprofessional. <br><br>\"Do you remember who your server was or what he was wearing/looked like? I am sure he was overwhelmed with his other tables but either way I would like to politely discuss this with him because it is not ok.\"", "pics": null}}, {"review": {"des": "This place is so cozy. It would be absolute perfect choice on a cold, rainy night. They've absolutely nailed the British vibe in that regard. While I heard the burger was delicious, and I was tempted by the fish and chips, I opted for the vegetable korma. This is a nice, vey filling dish that is great for anyone looking for the \"lighter\" of the hearty fare options. It's filled with loads of chickpeas and other seasonal vegetables. My only issue with it was that there really was not much curry sauce to sop up with all the pita bread they give you. Nonetheless, it was certainly a satisfying meal. We also tried the scotch egg - not to be missed at a British inspired restaurant! Service was friendly and attentive as well. Highly recommend!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/WNpw5rLSz78Taxmz-9Ka5A/348s.jpg", "caption": "Vegetable korma"}]}}, {"review": {"des": "Easily one of the best burgers in the city. This place puts Au Cheval to shame on the burger front! <br><br>I'll get to that in a minute...one of the most notable highlights is the ambiance. It's a crowded little dining area and bar on the first floor. It's lively when it's busy, and it can be a little hard to carry on a conversation when it's hopping, but it's part of the charm! I love the dark wood, English pub feel. Upstairs is a smaller lounge-like dining area. It's a bit quieter, cozy and also has a bar. In a nutshell: first floor is great for drinks and a meal with friends. Upstairs is ideal for date night. While this place is frequently busy, they offer a no-fuss reservation system. <br><br>Great rotating drink list. They have a lot of great, lesser-known beers, but I'm rarely disappointed by any beer I've tried. <br><br>I shamelessly stick to the burger. It's consistently done well! Very fresh beef, always perfectly cooked, delicious caramelized onions...a mark of a good burger is one that holds up well without cheese. This burger lives up to that. The option of aged cheddar is also an excellent addition, allowing the burger to speak for itself will not disappoint. Fries are also consistently good! A little thicker-cut and well-presented, and they come with a (vinegar??) aioli. Very yummy!! It's a rich dinner, but well-worth it! <br><br>The one time I did order something that wasn't a burger, I was really disappointed. I don't think it's on their menu anymore, but it was their take on a bahn mi sandwich. Ugh! Textually off-putting, off lemon grass and soap like after taste. It was BAD! I haven't strayed from the burger since. :)<br><br>Great spot for a a spectacular burger and date night. Reservations highly recommended!", "pics": null}}, {"review": {"des": "I was looking forward to the cheeseburger here. Everything started out great (Sunday 2pm). What seemed like a fantastic cheeseburger until about six hours later...the grumbling stomach followed by trips to the bathroom and an Imodium. Not pleased.", "pics": null}}, {"review": {"des": "This review is for the Burger, Beer, and Bourbon night on Tuesday nights. What a great deal for $16, considering the burger itself is regularly priced higher than that!<br><br>The hostess and waitstaff are extremely attentive and helpful. I enjoyed the intimate ambiance and music selection in the background. The burger is thick and juicy, topped with caramelized onions and a perfectly chewy bun. The chef suggests that \"less is more\" with this burger, and I really enjoyed the melted cheddar cheese add-on. Just know that if you get the special, you're locked into the specific beer and bourbon of the day. <br><br>Expect a wait on Tuesday night, unless you're able to snag a seat at the bar or at the couches on the second floor. It's worth it!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/tZMrp3ajcY3ZgEoFIXKmDA/348s.jpg", "caption": "Burger, beer, and bourbon night on Tuesdays!"}]}}, {"review": {"des": "This is one of my favorite British pubs in the city. I have enjoyed many brunches, lunches and dinners here. They have been on several 'Best Burger in Chicago' lists. I don't eat meat so I can't confirm or deny, but I've been there with several different friends who told me their burger was excellent (although not cooked to the requested doneness for two). The atmosphere really adds to the experience here. It's small, but comfortable, dark, lots of wood, very British pub-ish with all the comfort and charm.  I always feel like I would stay for hours if I could. <br><br>The Sunday brunch is great. They don't do brunch on Saturdays which bums me out - we like to go here before or after a movie at AMC Theaters right across the street and went by once on a Saturday stoked for brunch (no dice). I enjoy the coffee presentation and it tastes great too! French press, biscuit and adorable cup and saucer sets. <br><br>My favorite thing is to go and share a few small plates with my pals if it's lunch or dinner. So good! The pretzel with rarebit knocks my socks off and the bubble 'n squeak too! Carbs and cheese... What's not to like!?<br><br>Creative cocktail menu and a decent selection of craft beers for your adult bev pleasure.<br><br>Go to a movie and park in their lot ($2 - no time limit). Hit Owen & Engine before or after. It makes for a great outing!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/7IqOD8dLYhbxpONPKOYAGQ/348s.jpg", "caption": "Veggie Korma is a fresh flavorlicious delight."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ViXKyZBZAzBebtOHIWG0XQ/168s.jpg", "caption": "Best. Cocktail. Ever. The Night Shade."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/LKkaolZqWR22ojzFcAN51w/168s.jpg", "caption": "Please never take the pretzel off the menu. So good."}]}}, {"review": {"des": "Wonderful food! Kind and unpretentious service, atmosphere upstairs was beyond amazing. You feel like you're in someone's private library and it's the perfect place to enjoy some great food and even better drinks!", "pics": null}}, {"review": {"des": "This is an excellent place right on Western by the movie theater. I stopped on a cold January night and got warmed up with an Irish coffee. I sat at the bar since tables are hard to come by without a reservation. There is a second floor reportedly with a second bar but the hostess suggested the first floor as the stools have backs. Good call! They have small, medium and large plates on the menu. I picked the pot of mussels as it seemed appropriate for the weather.  They were fantastic with some bread on top and so many mussels they had to empty my shell bowl 3 Times! Will definitely keep this on my list of great dinner places in Bucktown. Update - make sure you order drinks without alcohol.  You pay extra for that. Brought my 5 stars down to 3.", "pics": null}}, {"review": {"des": "Have I really not reviewed this place yet? After all the wonderful meals and memories here?<br><br>Man...I done f*cked up.<br><br>Bo Fowler is nothing short of a culinary genius. <br><br>I was already in love with her amazing burger. A perfect 60/20/20 blend of chuck, short rib, and brisket, all from Slagel Family Farm, topped with caramelised onions on a housemade bun and a side of chips, it is a perfect and juicy testament to how great burgers can be. Order it on Tuesdays along with a shot of bourbon and a pint of beer for only $17.<br><br>But this past holiday, I ordered an amazing 22oz aged prime rib dinner with duck fat roasted potatoes, trumpet mushrooms, creamed spinach, and beef jus. It was the perfect Christmas gift to myself.<br><br>Owen & Engine is a perfect cap to a night out at the movies with the parking structure for Regal Theater City North 14 right across the street and only $2 parking with validation. It's got a casual laid back ambience upstairs or a more formal dining room downstairs.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/3PiklPxI32NYa7pfLPMhoQ/348s.jpg", "caption": "Aged prime rib with duck fat roasted potatoes, trumpet mushrooms, creamed spinach, and beef jus."}]}}, {"review": {"des": "Good food, nice drinks, interesting beer selection (draft & bottle), friendly staff and cool environment.<br><br>Fish and Chips was really tasty.  So were the Pork Rinds.  Pickles were o.k..  Definitely will be back to try other items on the menu.<br><br>Great option for a before or after movie bite.  Easy parking for $2 in the garage across the street.", "pics": null}}, {"review": {"des": "I've been coming to Owen & Engine for years because I love British food and many places just don't do it right! Yes, a lot of it is weird boiled things,  but Owen & Engine takes the best of the best and really does it right. I enjoy the rotating menu that always has some classics, as well as some new creations.<br><br>Favourites to get every time: scotch eggs, oysters, bone marrow. Fish & chips is lovely, and the steak is wonderful. Anything paired with one of the British or local brews is absolutely wonderful. <br><br>As this is the only restaurant close to the theatre, it might be busy when shows are letting out. Don't forget to be there for your free shots at the time when the clock is stopped!<br><br>The service in both the upper and lower bars is wonderful, and I just adore coming here.", "pics": null}}, {"review": {"des": "One word, NaCl (well, ok, one chemical compound). We had dinner here tonight with an old friend, and fortunately the company made up for the food. Had the fish and fries (not chips, these were fries) and all of it was salty as hell. It's 2 hours later, and my mouth is still a bit puckered and dry from how salty the fish and fries were. The fish itself was light and flaky, but the coating was so salty it was nearly inedible - I'm guessing it had something to do with the oil. <br><br>Scotch egg was good (which was deep fried too, but didn't have the same saltiness), pretzel and Welsh rarebit was decent as well. Service was ok. <br><br>Very underwhelming for a $240 dinner for 3 with tip. Should've read reviews here and went with a burger....", "pics": null}}, {"review": {"des": "We came across Owen and Engine back in July last year as we were hankering for English pub fare and boy were we surprised with the kitchen.  It was clear they had people in the kitchen who knew what they were doing and using quality ingredients.  We were happy we came across this hidden gem of a place that had a kitchen that would rival that of a Michelin starred restaurant.  We went very often after that, sometimes every week and enjoyed various dishes, including a very exceptional Chick Pea Korma dish that I was told would never go away since it was so popular.<br><br>Unfortunately, a few months ago, for unknown reasons, the quality began dropping.  They changed the brand of tea they used to a less flavorful one, and other things began to slip.  We continued to go once every few weeks to see if it was just an off day, but it did not improve.  Bacon would be burnt, potatoes and other food started to taste off, items were too dry. etc., dinner portion sizes were small.  House-made items just weren't made as well as before, including a clotted cream that came with the scones that was very much like whipped cream rather than clotted cream when it used to be nice and thick.<br><br>A month or two ago they even took the Chick Pea Korma dish I was told would never come off the menu off the menu and added a falafel dish that is just no where near as good and the food quality dropped even more.<br><br>I honestly don't know why this happened, perhaps they lost key kitchen staff or a food source, but the result is Owen and Engine have now become a pub with somewhat middling hit and miss food instead of the high quality gastropub we used to love.  We've gone so many times and been unsatisfied that we will no longer be regulars at this place.  I'm sure it's still a fine place for a drink and their pastries still seem to be going strong, but alas, their great kitchen is no more and lacks consistency.", "pics": null}}, {"review": {"des": "Phenomenal burger (in my opinion the best in the city) and amazing craft beer list. The atmosphere is cozy enough for a date or a gathering with some friends. I've had both here. The location is slightly out of the way but once you're here it's all worth it.", "pics": null}}, {"review": {"des": "Hoes before Bros was the theme for evening... I would like to think... My friend Jess invited me to an amazing dinner at Owen & Engine. Upon arriving, I didnt read up on it so I wasnt sure what to expect! We had a private dinning area in the upstairs back area. There was about 10 ladies all different, ages, and ethnicities bonding over fantastic food. We started off with so many bottles of Rosè I lost count. We had amazing apps, I mostly loved the pretzel! And I had the burger which was huge and juicy:).... We had impeccable service and the owner (Chef) came and chatted with us for a bit! Parking is a little sketch but doable.", "pics": null}}, {"review": {"des": "Meh.<br><br>Cocktails we're $14. Burger was $18 and while the meat was good, it just had a plain bun and carmolized onion on top. It tasted pretty bland. They charge extra for cheese. Fries were soggy. <br><br>Not worth the money or the wait", "pics": null}}, {"review": {"des": "This is the best food I've had in the United States. Bangers and mash with wild rabbit is the best. Ever tried a Scotch Egg? Probably not. But if you try this one you'll get it every time. Beer selection is excellent. One of the bartenders is even a certified Beer Cicerone. The place is classy. You'll need reservations on the weekends. Highly recommended.", "pics": null}}, {"review": {"des": "Bonkers good British gastropub fare.<br><br>Dropped in for game 3 of the NBA finals to see the Cavs choke away a substantial third-quarter lead.  Fortunately, food and drink at Owen and Engine an enjoyable evening.  Found seats at the end of the bar, and started off with beers from the cask and from the tap on the advice of the broadly knowledgeable bartenders.<br><br>Proceeded to appetizers including the warm pretzel served with Welsh rarebit, a decadent meltdown of savory cheeses so good that it merited application on other menu items, including the Scottish egg, which featured a generous application of richly flavored sausage over a runny yolked egg.<br><br>Proceeded to the much lauded Slagel Farms burger, with the addition of cheddar to the usual caramelized onion.  Burger emerged oddly neat (usually these fancy burgers are collapsing on their own bulk).  Particular credit is due to the patty itself; somehow, the coarsely ground medium rare beef managed to achieve the twin ideals of the juiciness of higher-fat patties, while maintaining the umami notes of aged beef.  Definitely took the opportunity to eat a few bites of meat by itself.<br><br>Other high notes include the homemade pickle jar, as well as the end-of-the-night shots of the scotch of the day.  Only down point was that cream ales don't taste particularly good out of the cask - they certainly taste better robustly cold.<br><br>Worth a return, if only to eat down the menu of high points including the Bubble and Squeak, as well as the fish and chips.", "pics": null}}, {"review": {"des": "Owen and Engine has quickly become one of my favourite places in the city. A great selection of beer and liqeur, an amazing in house charcuterie, and one of the best burgers in the city. Every burger I've seen has been cooked EXACTLY as ordered, and is honestly mouth watering. The cheese options for the charcuterie are on a whole other level. The fruit with it are sweet and fresh. The mustard and picked veggies are delicious. Have absolutely 0 complaints. It is a bit pricy, but Tuesdays are a beer, shot and burger. Well worth it. Maybe make a reservation ahead of time. Arrive at 7 and there wasn't seating until 9.", "pics": null}}, {"review": {"des": "Finally got over here for the infamous Burger, Bourbon, and Beer deal Tuesday night. The burger slipped into my top 5. It was cooked to a perfect medium rare. The onions complemented the meat perfectly. I don't even think there was a sauce on the burger but the buns were so good. I think the succulent burger juices may have been absorbed by the buns. The fries were solid and the garlic aioli dipping sauce never fails. Nice variety on their beer menu. Highly recommend comin here for a burger then watching a flick at the movie theater on the corner. date night?", "pics": null}}, {"review": {"des": "Visiting from Houston and my brother in law took me there.  This is a very solid place with high standards on it's food and Britishness.  First of all, it's jam packed on a Tuesday night at 10pm.  Very dark inside but the conversations were lively and the staff was hovering around constantly.  <br><br>We sat at the bar and the service there is friendly and not lacking anything.  We were super hungry so we ordered the dry aged bone in ribeye and the Slagel burger.  <br><br>22oz Bone in ribeye - 4/5 - <br>as a red-blooded Texan, I can safely say this is a good quality piece of meat and they know how to cook it medium.  It's not exactly Texas good but it's very close. The side dishes were excellent. Wild mushrooms, kale, tiny potatoes in some tasty sauce and seasoning.  Very high quality ingredients.  As much as any top snooty farm to table restaurant would have. Overall great dish and presentation. One thing is that this dish is the same price as at a fancy sit down formal steakhouse.<br><br>Slagel Burger - 5/5 <br>Very precise burger with custom bun and premium aged cheese. Everything from top to bottom seems carefully selected. It's not a burger with a ton of things going on, it's straight to business and the meat is great. I think it's brisket and short rib.  It comes with good fries, but I wish I knew about the homemade ketchup. Tasty and worth the splurge when you want<br><br>All in all, very nice people, serious about their craft and expensive but delicious.", "pics": null}}, {"review": {"des": "It was a random night and I was out with my family doing school supply shopping - asked my little sister to look for restaurants around the area and we ended coming in here.<br><br>Remind you, we were running errands so looking decent wasn't really this night but we got there and was greeted politely  and was seated in their big table upstairs. The candles and dim atmosphere was so cute. We noticed a lot of couples probably having a date night.<br><br>Alexa  was patient with us, with the little kids and with our little knowledge of the restaurant - she gave suggestions and all of these were fantastic.<br> <br>We had Cornish pasty, Linguini, Indian chicken and burger! Super yummy.  <br><br>I would definitely come back, maybe for date night before or after a movie.", "pics": null}}, {"review": {"des": "Typical yelp burying reviews that'll actually help people make an informed decision. After only scrolling for a minute I found a number of reviews highlighting the same complaints about the same hostess (blonde hair, piercings) And NO responses from management. So it shouldn't surprise anyone to learn they've done nothing about their awful hostess who would rather send people back out in to the cold than suggest getting a beer near the bar. I showed at 7 and was rudely told nothing would be open until 9:15. No mention of spots at the bar which could open soon, didn't check, just watched us walk back out the door. <br><br>So, we went and sat in our car cause there is nothing else in this neighborhood (another reason management probably doesn't care, but a terrible mistake regarding the long term success of your restaurant when you have expensive food and horrible service). We brought up the reservation page and alas! 8:15 table for 2. Someone must've canceled. We go back, I tell the same hostess our reso is for 8:15 but if something opens up before we'd love to sit down sooner, \"oh nothing will be open before 8:15. I mean, I guess you could stand by the bar.\" As she's finishing this incredibly warm invitation, 2 spots open up at the bar. \"Oh, yeah and I guess you can sit there if you want. It's full service.\" <br><br>The bar was great. Bartenders very helpful. Food great. But my god, having worked in restaurants for nearly 10 years, I don't understand why any establishment would put an unfriendly, impatient, apathetic human being as the first face that's seen when someone comes through the doors you worked so hard to open. Unless this person is an investor or family member or something (and even still) you are making such a terrible decision allowing this person to continue working here. <br><br>Evidence TWO. I had a nice time (other than my first impression), so I suggested to my parents they do a date night movie/burger evening. Same hostess, same attitude. They got there at 6 and were immediately told nothing would be open until 7:30. Before anything else was said! My mom very calmly told this person they had a reservation for 6:00 upon which they were seated promptly. <br><br>Your burger is delicious. Your beer options are tasty. But you're a bit pricy and have the epitome of a burnt out \"lifer\" as your hostess who is single handedly diminishing your hard work with her bad attitude. Fix it or you will fade away along with the fading quickly movie theater biz across the street.", "pics": null}}, {"review": {"des": "Brunch at Owen & Engine is criminally underrated. I came back for the first time in a while and everything was still incredible!<br><br>First, there's always tables available on Sunday morning which is invaluable in itself. To start out, definitely check out their pastry board because they always have some great options. For entrees, my friends and I ordered the berry pancakes, French toast sandwich and biscuits & gravy. Everything was amazing! The cheddar biscuits mixed with their thick gravy and eggs is everything a hangover cure should be. The pancakes were enormous and thick but super soft at the same time. I was so full but I kept cramming those cakes in my mouth like my life depended on it. <br><br>O&E should really be on all the best brunch lists, but then again, I do enjoy not waiting for my table.", "pics": null}}, {"review": {"des": "All I can say is that I had the burger there with brisket and short-ribs ground into the meat. It was easily the best and juiciest burger I've had...ever.", "pics": null}}, {"review": {"des": "Stopped in here before the movie last night. Awesome rooftop patio if the weather permits. Great laid back atmosphere. Great selection of bottle and draft beers. We ordered the Scotch Egg and it was fantastic!! I'll definitely be making a trip back here before our next movie:)", "pics": null}}, {"review": {"des": "Owen & Engine is a British gastro pub located in Logan Square that I actually knew nothing about upon arrival. My date suggested this place, so I didn't bother doing any preliminary research, and was pleasantly surprised. The space features wallpaper, old school fixtures, and dark wood, which all made for a very intimate and comfortable atmosphere. <br><br>Here's what we had:<br><br>Scotch Egg - A soft-boiled egg wrapped in pork sausage and bread crumbs, and served with stout mustard. I love both soft-boiled eggs, and mustard, so right up my alley lol. <br><br>Squid Ink Linguini - I was craving seafood and this hit the spot. The burrata cheese was a really nice touch. <br><br>Lamb BLT - Our waitress sold my tablemate on this. The portion was sizeable, and he enjoyed his food, but complained that it was a little salty. She raved about how they bring in whole lambs and marinate the meat for something like a week...she almost sold me on it too, honestly. <br><br>Ganache - Served with rum-avocado ice cream. This dessert was deceptive in that it was much larger than it appeared. The ice cream kind of stole the show for me, but not in a bad way.<br><br>Our waitress was helpful, friendly, and very passionate about the menu. I also didn't think the price point was too bad. All that food, and three drinks came out to just under $90. I definitely see myself returning, either for brunch or to try the charcuterie :3", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/nygiQDwbkEV9TYNBN8cHuA/348s.jpg", "caption": "In my natural habitat - ft. half eaten Scotch Egg."}]}}, {"review": {"des": "Unbelievable burger and great old fashioneds. Great chats with the bartenders, it's great to meet people who love what they do!", "pics": null}}, {"review": {"des": "Dinner w college buddies was an awesome idea!!!  Great place to visit in the neighborhood.  The atmosphere is very relaxing and service very friendly and attentive.  This place has two bars, one on each floor, so finding a place at the bar before dinner is easy.  I recommend the scotch egg, ploughman's board, dry aged ribeye steak, and tart cherry pie.....delicious!!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/VT1LzY7d_JhnDXEwB_crhg/348s.jpg", "caption": "Dessert menu, 072717"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/tCQs0pAMaB9li0ZVSspfnw/168s.jpg", "caption": "Haddock fish and chips...."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/paKiw_7eD-42hJnI1FAbOg/168s.jpg", "caption": "Beef burger.... is there anything else?"}]}}, {"review": {"des": "Had the absolute best dinner here while on a trip to Chicago! We did not have a reservation, but fortunately two seats opened up at the bar after only a 10 minute wait. I would recommend making a reservation if you know what time you'll be in.  The two bartenders that helped us were extremely friendly and knowledgeable, which was nice since their draft list is extensive. My husband & I started with the soft pretzel appetizer, which comes with a delicious and creamy cheese for dipping. For dinner, I had the pierogi, which was life changing! Without a doubt, the best pierogi I've ever had. My husband had the fish & chips, which was also really good and comes with a rather unique sauce. The portion sizes were plentiful, neither of us were able to finish our meals.  Overall, an excellent meal and very enjoyable environment.", "pics": null}}, {"review": {"des": "We had the tuna melt and it was excellent, and the salad they served along side was a large portion of veggies and greens, including housemade dressing, house fermented veggies and house made bread for the sandwich. Mascarpone french toast was also amazing. We didnt try the beers, but they had an extensive list. Our bartender was attentive and knowledgeable, and the place is really cute.  Small space, IMHO, best for groups of 4 or less.", "pics": null}}, {"review": {"des": "Fun Wed night date night dinner with wife.  2 vegetarians.  Excellent mushroom strog, OK Indian korma.  Interesting beer list of English + domestic.  Excellent service: server replaced a flat pour.  $80 for 2.", "pics": null}}, {"review": {"des": "I can only echo the same things which have been said. The hostess in front is horrible. They refused to seat me despite an empty restaurant because I would only be ordering drinks and appetizersp. Everything is an up charge and it's already way overpriced for what you get. It looks nice and the servers were ok but the food does not redeem the rude.", "pics": null}}, {"review": {"des": "We were here Sunday night a bit early for dinner (4:30), so we drank and had a couple bar \"snacks\" from the light menu. I opted for the Samuel's Smith Oatmeal Stout, very smooth and drinkable. We started with the pickles and the Scotch egg, which I've never had. They served it with a honey mustard that was sweet and spicy. I've come to appreciate this little bit of heaven, Soft boiled egg wrapped in sausage and breaded (i think) and deep fried. WOW! Both snacks hit the spot<br><br>It was finally 5 and we were ready to order-- Get the burger with the egg! It was so good, cooked perfectly and all the components meshed well. Ask for the homemade ketchup too. We also ordered the mussels, we wanted the fish and chips but our waitress let us know that they always have the fish and chips but they don't always have mussels. The broth was a hint spicy and flavorful, exactly how you want your mussels to be served. It ended up being more food than we could actually eat, we were both very full and sadly left a handful of mussels in the pot. <br><br>But we will be back: to have the fish and chips -- and the Burger!", "pics": null}}, {"review": {"des": "Place is a joke. Go elsewhere.<br><br>Months ago I went in on a random Saturday to grab a burger. It was 330pm and I was told I could not order the burger until 5pm. I looked around and saw hardly anyone in there and thought it was a joke. They told me it's the rule as they have a small kitchen. I said it was all I wanted and they seriously let me leave instead of making a burger. I was baffled that they would rather lose a customer during a dead time than make a simple burger.<br><br>Fast forward to today. I was in the area at 5 and decided to give them another shot. I was with a friend that wasn't eating so I asked if I could place a to go order, so my friend didn't have to watch me eat. They told me they don't do to go orders.<br><br>Unreal. This place has lost me as a potential customer for life. I will never attempt to go there again. Do yourself a favor and go somewhere else without weird rules.", "pics": null}}, {"review": {"des": "Mother of god, get the mussels. GET THE MUSSELS. We love good thai food, and I thought my husband was going to fight me for  the mussels in a thai curry coconut broth with strawberry thai sausage that I ordered. Just...sublime. <br>Fish and chips and scotch egg were both fine - nothing special.<br>Venison tartare was really flavorful and good - husband didn't enjoy the blueberries in it so much, but I didn't mind. <br>Server was fabulous!!", "pics": null}}, {"review": {"des": "Am a bit embarrassed it took so long to update this review.<br><br>Everything about this place is awesome! The amazing staff, the clean bathrooms, the stellar attitude of the maitre d' and especially the incredible food. <br><br>Let me zoom in on the food. While nearly everything I've consumed here is phenomenal, one dish that particularly rocks is the bubble and squeak. Anybody who doesn't love Owen & Engine's version is clearly a douche-bag. Savory, pleasant texture and perfectly done... for only $12!<br><br>I have contacted Eater Chicago to encourage them to rank them even higher on the list.", "pics": null}}, {"review": {"des": "This place strikes me as a proper English Pub with a smallish space but it works, quite cozy and nice.  The atmo, beer, food, and service - all excellent. I'll even say that about the service even after we were re-arranged after a few folks from our party of about 10-12 left and then asked to sit at the bar once there were only four of us left. Whatever, as mentioned the space is small so can understand and we happily obliged when they asked us to switch spots with those at the bar waiting for a table.<br><br>Props to Sarah S. for putting this outing together (thanks and thanks for the awesome Cupcakes!)...I came for O&E only and missed the movie shenanigans, even though i'm totally using that word out of context....I just felt moved say shenanigans.  <br><br>The only food I tried I'd maybe say is the only food you might even need to know about. Jack Reacher's Banger's and Mash. Ok, so technically not the name of the dish but is the name of the bloke who ordered this awesome comfort food and was kind enough to share. <br><br>Ahhh, the elusive parking around here, even more elusive bc of the construction all along Western Ave. Park Hack, find free parking on the S Side of the Expressway, you guessed it, on Western. I also have it on good authority that you can park in the movie parking lot and tell them you bought movie ticket on-line and get validation? I cannot confirm or deny but there's that.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/yzmMDI1zKWxhdNxocbE9Vg/348s.jpg", "caption": "Owen & Engine keepin it classy all the way to the boys rooms."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/B3j16pAydl4IABHe5HWqZQ/168s.jpg", "caption": "Proper stylish bogs"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/MDHg6EfBLj5sdeCWaw-p8Q/168s.jpg", "caption": "Triple B Tuesday's!"}]}}, {"review": {"des": "On my list for a while since I've read great things about the burger.  Pre movie meal, sat on 2nd floor patio which was nice.  My son had escargot which we both liked.  I had the much raved about burger.  I knew it was $18 going in. I asked for medium rare and it came back medium plus.  I have had slagel farms burgers from other restaurants so the preparation was a huge disappointment.  Not sure how someone with such a reputation and high price point misses on the basics.  No time to send it back due to movie start time.  They did nail the fries.  But doubtful I will give them a second chance.  I just read another reviewer who said the place has declined.  Definitely a 'meh' experience.", "pics": null}}, {"review": {"des": "Owen & Engine offers the perfect British fare for those wanting a brisk refreshing European beer and grub before catching a movie across the street. Location and ease of getting seats early dusk couldn't be it any more convenient for a movie date.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/91_0IkVdKioENUKdAtLOCA/348s.jpg", "caption": "Cheese board."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/zAUKaUTJVtVQf3u8dyxIUw/168s.jpg", "caption": "Cheese board."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/zHYKc48HyQpkU9y0QXKeYw/168s.jpg", "caption": "Cheese board."}]}}, {"review": {"des": "I am a bit embarassed that I went here.  This restaurant brings the gourmet out of the British pub fare -- which is hard enough to do.  But I wanted to give it the benefit of the doubt.<br><br>Everything about this place was a disappointment.  The sarcastic and underwhelming staff, the condition of the bathroom, the \"i want to go home right now\" attitude of the maitre d', and the food.<br><br>Let me zoom in on the food.  I ordered the scotch egg, the cornish pasty, and the bubble and squeak.  The scotch egg was decent.  The cornish pasty was, ok.  And the bubble and squeak, which was mashed potatoes with cheddar cheese and pieces of vegetables mixed in.  Salty, chalky, and amateurly done....for $12?<br><br>I made my formal complaint to the restaurant and requested that Eater Chicago takes the restaurant off the list.", "pics": null}}, {"review": {"des": "My husband and I live nearby and have been wanting to visit Owen & Engine for a while. We finally made it there this weekend with my inlaws for a birthday dinner, and I'm kicking myself for not going sooner!<br><br>My husband and I split the burger (I think it dethroned Au Cheval for me!), the gnudi medium plate (packed with flavor), and the braised short rib small plate (perfect appetizer). I would recommend any and all of these dishes! <br><br>It truly seems like you cannot go wrong with their menu, but when I return, I'll have a hard time venturing away from that burger. You need to try it!", "pics": null}}, {"review": {"des": "Best burger in Chicago! Trust me on this. Top three burgers I've ever had. Juicy, cooked exactly as I requested, and so much flavor. The bun really makes it too, the perfect consistency. The caramelized onions were perfect and made the burger even more mouthwatering. The french fries were also delicious. Their selection of draught beers was great and I got a Hefeweizen that was so flavorful and hit the spot. The atmosphere is very cozy and romantic. I can't wait to go back!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/J6quxl4mgU9R5Pix4Cz6Aw/168s.jpg", "caption": "Enough said!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/t-JzbKvNckERm_dzAXsd7g/168s.jpg", "caption": "Burger and french fries- mouthwatering!"}]}}, {"review": {"des": "I really enjoyed this place!  My boyfriend and I went there and got the burger, fish and chips, and the pretzel.  We also started out with cocktails.  The cocktails were good but next time I'll stick with beer as my cocktail was mostly ice!  For 14 dollars I would expect more.  The pretzel was a delicious starter, loved the mustard glaze and the cheese sauce was amazing.  My boyfriend had the burger and although I didn't try any, he inhaled it and loved it!  I had the fish and chips which were delicious!  I love fries and these were perfect fries.  The fries are served with a wonderful garlic aioli but I also was able to get regular ketchup, they offer a house ketchup but I'm a hienz girl :-)  The place is a bit expensive for what you get, however, I will be back for the great food!  Also again biggest advice I can give here is skip the small cocktails and have a beer!", "pics": null}}, {"review": {"des": "First place I came after getting off the plane on a recent business trip.  I think they consider this upscale casual indian, or a british gastropub.  They have a 1 page menu. But their drink menu is 8 pages long.<br><br>I tried the popular burger and a draft beer to go along with it: Evening Tide dry oyster stout.  The burger comes with limited toppings to showcase the beef which is 40% chuck, 30% short rib and 30% brisket.  If you want to add cheese or bacon, that will be about $5 more.  If you dare to add lettuce, you're looking at a burger that's nearly $30.  I just stuck to the burger as presented on the menu.  Burger comes with a side of fries in a short glass.<br><br>How was it? It was awesome if you like a really beefy tasting burger.  If you're the type that enjoys all the toppings at some of these places that pop up with 100 different burger combinations, it may not be your favorite.  It was one of my favorites though.  The carmelized onions added a nice touch and usually make for a great burger anyway.  To summarize, it was one of those burgers that was so good, I couldn't decide whether to scarf it all down or to savor it.<br><br>The fries were the weakest part of the dish for me, even though they were fancy and when dipped in the vinegar aoli, they were still good.  When dipped in the house made ketchup, they were even better.<br><br>They had 20 beers on draft the night I visited.  Good mix of customers here, of many different races although it still seemed to have a hipster vibe.<br><br>Didn't get a glimpse of the upstairs, but if I'm ever in town again, I'd likely come back for another burger, or maybe their curry if they have it on the menu.  <br><br>They have a separate dessert menu with 5 desserts for around $10 each,  which sounded good and expertly crafted, just none I wanted that night.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/g8sjGS6muD2JNC-vzon0FA/348s.jpg", "caption": "The burger"}]}}, {"review": {"des": "My favorite burger in Chicago! Atmosphere is great and service was A+. Zero complaints! We will be back", "pics": null}}, {"review": {"des": "Recommendation: make reservations!!<br>Great food, nice ambiance, and awesome service. Great place for a casual date night. Make sure to go on a Tuesday night for their $16 burger, beer, and bourbon deal. Don't forget to catch a movie afterwards.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/yaLoiyTGIzeQT-uLYrQ0Ag/348s.jpg", "caption": "$16 Tuesday deal"}]}}, {"review": {"des": "This has to be one of my favorite places in Chicago.  It has amazing food & a staff that is incredible. They understand the Menu & are great tips on food & beer pairings.", "pics": null}}, {"review": {"des": "It was raining heavily outside when we dined here, complimenting the British Theme nicely. The food here has no equal in Chicago. I ordered the Full English Fry Up and found it to be a nice hangover cure as well as a delicious breakfast.", "pics": null}}]}