{"name": "panes-bread-cafe-chicago", "reviews": [{"review": {"des": "I like that they bake their own bread and make the sandwiches to order.  <br><br>Try the monster cookie. <br><br>Try them for brunch!", "pics": null}}, {"review": {"des": "This place is super cute and right next to my old apartment. It seems to be family owned, and has really interesting decorations and a decent sized patio! My favorite is the tomato bread... I love it! Which is why my favorite sandwich is Turkey, Turkey with smoked turkey, avo, roasted red pepper, spicy mayo and tomato bread. The tomato bread is really good for people who are pizza fans. They bake their own bread and its cash only too!", "pics": null}}, {"review": {"des": "So damn good. The bread was so fresh. We ordered the Turkey Turkey and Turkey club. The sandwiches come with classic chips.  Great for a Saturday out and about, super filling. Enjoy!", "pics": null}}, {"review": {"des": "It's about time that I posted about my love and admiration for Panes. They do it all. Sandwiches. Soups. Cookies & chocolates. Loaves of bread to go. The options are diverse and the food never ceases to impress. My favorites are the pampazo and the turkey-turkey. I don't think I've had a better light sandwich than the turkey-turkey. The roasted beef and pollo diablo are elite. My friends have all had and raved about the Oaxacan, Sloppy Pollo, Spicy Philly, & the Popular. Heck the 2 vegetarian options were perfect to go for the beach this summer. Top it off with the Cookie Monster cookie. We've taken a  tomato bread loaf to our friends places as small gifts for inviting us over. It's that good. This is a cant miss place at a respectable price. You will not find a better option at this price point.", "pics": null}}, {"review": {"des": "Finally, a place where I will easily be a regular at. I've already been four times in one week... I've tried the pollo diablo, turkey turkey, tuna, and their greek omelette. All fantastic! The pollo diablo wasn't spicy though, I would say even for the average joe. What definitely stands out of course is their fresh baked bread. Their omelettes are solid along with the potatoes. Portions are generous, where I can easily make their sandwiches into two meals. All super affordable too, but as noted, cash only or checks, which I actually wrote a few times, which at first was awkward, but hey whatever. The lady taking orders was always very nice. The space is also quite cute. I can't wait to take home some of their bread home. Also, not a big sweet tooth but hands down, their chocolate chip cookie is the best yet.", "pics": null}}, {"review": {"des": "Stopped in here after a spa visit next door. My massage therapist mentioned Panes having good sandwiches, and I immediately started recalculating my trip home after hearing that. He had me at \"sandwich,\" which I am an absolute sucker for. It's no joke - ask my credit card. I recently went on a 2 month bender of eating a ridiculous amount of sandwiches non-stop, but I digress...   <br><br>Panes has fresh bread daily, an extensive menu, including a full page of different types of sandwiches, and a super cute vibe on the inside. The walls are colorful, eclectic signs and art, and lots of tables to sit at. Very low key, which is definitely more my style. It felt like a mom and pop shop, and I wouldn't be surprised if that's what it was. You order and pay at the counter, grab your card number, and wait for order up. The woman that helped me recommended the pollo diablo, which she described as spicy. Me: Yes please! Total for the sandwich was $8 bucks, and I must say, the portion was HUGE. Definitely enough for a couple of meals. It was a delicious sandwich and you get a bag chips with it. Definitely recommend for those in working in the area. I heard the veggie sandwiches are really good there as well. 4 stars!", "pics": null}}, {"review": {"des": "Got the turkey, turkey and I've never looked back. It's on tomato bread and has avocados, peppers and you guessed it - turkey. All their stuff is fresh  and good. And not to pricey either! Had other items there that have been good but turkey, turkey is my favorite.", "pics": null}}, {"review": {"des": "Delicious on the go sandwich!!! Ordered the Turkey, Turkey with smoked turkey, avo, roasted red pepper, spicy mayo and tomato bread. The tomato bread was soooo tasty. Everything tied together very well. Highly recommend this sammich. Also comes with a side of chips!<br><br>Coming from Boston, the cute shop felt even homier with the Red Sox decor. Chatted with the owner and she was the sweetest. May have to become a regular once I start working nearby. :)<br><br>FYI, cash only!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/aRL8UGRYtBsNAjFzPsJsLA/348s.jpg", "caption": "Turkey, turkey: turkey, avo, roasted red pepper, spicy mayo on tomato bread. SO GOOD."}]}}, {"review": {"des": "My daughter lives in the neighborhood and was not aware of this place until I visited and picked up a rental car at the nearby Enterprise. Their bread is so delicious as are their sandwiches. We had some crostini with goat cheese as an appetizer. My sandwich was smoked ham with American cheese, mayo, lettuce and tomato and it was way more than I could eat although I did try. Very delicious! We were so glad we stopped in and want to go back for some truffles. Cash only and is small so it gets pretty crowded during lunch time. Brunch available on the weekend.", "pics": null}}, {"review": {"des": "Great neighborhood spot. Love the turkey turkey on tomato bread. It's absolutely delicious and inexpensive (around $7 per sandwich). Soups are good -- love the carrot one!", "pics": null}}, {"review": {"des": "Great neighborhood café with good fresh baked bread. Think of it as a better Panera; they keep everything affordable(salads and sandwiches all ~$7), but with larger portions and better fillings. All of their sandwiches sound delicious, and since I'm a fan of the tomato bread, ones like the oaxacan,  turkey turkey, the popular, and the pampazo. Also their salads are good albeit sometimes their chopping of lettuce is a bit strange; they come with generous portions of toppings, a side of rosemary olive bread, and homemade dressings. Happy to have this around to just return and try out more sandwiches. Closer to 4/5, but bump it up cus it's a nice local family business with all around consistently good options.", "pics": null}}, {"review": {"des": "I really like this place. Very good food. The staff is friendly and the prices are reasonable. I had on different occasions the pork and the chicken sandwiches. The soups are also good.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/DJqwCtl_8XwTkITN310-Kg/168s.jpg", "caption": "Awesome lunch."}]}}, {"review": {"des": "Excellent little mom and pops place! The sandwiches are phenomenal. All the bread here is handmade and let me just say that their sweet French bread is hard to put down. <br><br>The entire menu can satisfy almost any craving with the different varieties of sandwiches available to order.", "pics": null}}, {"review": {"des": "My favorite sandwich place near Wrigleyville. Fresh-made bread is delicious, service is great, and the prices are right! The \"Turkey Turkey\" is my absolute favorite sandwich.", "pics": null}}, {"review": {"des": "Everything is great here. Bread is fresh and tasty, sandwiches are amazing (love their special sandwiches of the week/month/whatever it is), their pasta is awesome, their soup is great, and their desserts are amazing. Love it all!<br><br>If I had one negative critique: I wish the staff were a little friendlier...always seen a little stand-offish that's why I give it 4 stars. To get a perfect five stars, establishments must have both great food and great service. don't get me wrong, they aren't mean, they just aren't welcoming that much.<br><br>but the food is great! my favorite sandwich is \"el parisino\" I think. Their special chicken curry sandwich is also a good one.", "pics": null}}, {"review": {"des": "You can't go wrong with any sandwich here. One of my favorite sandwich places in Chicago! Everything is so fresh.", "pics": null}}, {"review": {"des": "It's pretty dumb that I haven't reviewed Panes yet - it's great! The sandwiches and pasta are good (a few vegetarian options!), but the real goldmine here is all the bakery goods: the truffles are incredible, the rice pudding (when they have it) is divine, and tomato focaccia and banana bread make up just a few of the loaves you need to buy for yourself. It's cash only, but they do have an ATM. And, they are open pretty late, so this is a great place to satisfy that sudden dessert craving you might get.", "pics": null}}, {"review": {"des": "Panes is so delicious and hits the spot every time! I pretty much always get my usual Turkey Turkey on the tasty tomato bread. The prices are not bad at all, keep in mind it's all cash only. All of the homemade breads and cookies are to die for. Definitely recommend if you're in the area.", "pics": null}}, {"review": {"des": "The food is amazing my favorite is the turkey turkey and the monster cookies are to die for! Can go wrong with a sandwich from Panes!!!", "pics": null}}, {"review": {"des": "Having lived around the corner, I was here when this place first opened. They are survivors. Chicago Pizza gone, Salad pizza joint on the corner gone another place gone. Service is still a little slow, still cash only, sandwich's still ROCK! As does the bread... though my bread intake has somewhat ceased. Place is still busy during lunch time. Neighborhood joint it remains. Not much to say except, I'm glad this place still exists.", "pics": null}}, {"review": {"des": "Had the popular sandwich and potato salad, and both were very good. Especially with the tomatobread!", "pics": null}}, {"review": {"des": "The best bread makes the best sandwiches. I get the pollo diablo and don't forget dessert...", "pics": null}}, {"review": {"des": "All the love for Panes!! Went to meet some friends for brunch and fell in love - the french toast, sandwiches, you really can't go wrong. They make their own bread and have free samples for anyone to try. Will definitely be back to try even more yummy food!", "pics": null}}, {"review": {"des": "A really cute and solid restaurant close to many common walking attractions in Chicago. This place serves pretty large portions, making it a good option for the hungry lunch or dinner guest. Their food tastes *quite* Italian in style, and ranges from Sandwiches to Salads to Pastas, to bakery fresh breads and cookies. Worth checking out!<br><br>I tried the Pollo Diavola and my girlfriend had the Angel Hair pasta - both were solid.", "pics": null}}, {"review": {"des": "My favorite monthly brunch. A few blocks from my dog groomer (Kriser's on Belmont), this is the best neighborhood cafe for me to wait while they get pretty. I always order the house chilequiles and a San Pellegrino- aranciata rossa. DELICIOUS. ALWAYS.  Cash only. Do not miss this charming place.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/mFq7ZmJzqI6_d9lbdPr2oQ/348s.jpg", "caption": "House chilequiles - delicious!"}]}}, {"review": {"des": "My boyfriend and I ordered from here for lunch because the spot is super close to my place. We decided to split a pork sandwich and their beef one. Although the bread was really good the beef one lacked flavor so I decided to add some horseradish sauce I had in the fridge. The pork one was flavorful but not too heavy. The only downside for me for this place is that they are cash only and the atm they have charges a fee to withdraw money. :(", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/nBz3LBiiHaQlxwCk4xFoJw/168s.jpg", "caption": "Roast beef sandwich"}]}}, {"review": {"des": "I've come here a few times now and love their food. Their bread is delicious, and their soups have never steered me wrong (esp their Tomato Soup). It's a cozy and smaller space, but I love the small business vibe. Sometimes their food is a little less flavorful, but adding some salt/pepper/Parmesan/red pepper flakes is an easy fix. I've always enjoyed what I ordered.", "pics": null}}, {"review": {"des": "Delicious and cheap breakfast! I got the bacon egg and cheese. It was served on their bread along with potatoes. My friend got the French toast which had a great presentation. Sit outside if you can!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/RwKsY0nJiiKZa3e8msR_FQ/348s.jpg", "caption": "French toast was so good! Baked apples on top."}]}}, {"review": {"des": "The turkey turkey was one of the best sandwiches I've ever had. Everything about it was amazing. I also had the monster cookie and that was also delicious. I will definitely come back here", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/b6Vear6fUQhINLqxbCAR9g/348s.jpg", "caption": "Half of the turkey turkey"}]}}, {"review": {"des": "Had their portabella sandwich and it was fantastic. Their bread is homemade and was very fresh. Wifey had the pollo diablo and she loved it. Had outdoor seating, which was perfect for a summer day. Can't wait to come back to try their pizzas and pastas. <br><br>Tip:  BYOB and cash only", "pics": null}}, {"review": {"des": "I'm in coming here for probably 15-20 years for lunch and I really like it. It's one of the best sandwiches in the city and it all bases off the bread. Not the biggest fan of the things outside of the sandwiches but the sandwiches are really good. Make sure you get a monster cookie with your meal as well.  I also really like the fact that it's a family-run business and we're supporting small delis in sandwich shops.", "pics": null}}, {"review": {"des": "Panes is absolutely delicious; fresh,tasty and always warm service. I love coming here with my friends on a Saturday afternoon for coffee and sandwiches.", "pics": null}}, {"review": {"des": "I was teetering between 2 and 3 stars and thought I would cave and give 2. Here is the scoop. Cash only, dirt cheap omelettes and breakfast tasty meals.  However the day I went the coffee machine was on the fritz and they could not recommend the coffee. Ok, fine. The potatoes that come with the eggs were severely undercooked(raw with bad seasoned salt) and when I sent them back they came back black but still undercooked. It's in a great location on Sheffield Street but I would honestly find another place to go for breakfast... Sorry", "pics": null}}, {"review": {"des": "I have been eating there for years, and it only gets better! The business is a blending of an American female chef, and her Mexican husband who is a baker. The combination that they produce is Amazing! Remember, the bread is half of any sandwich, and they bake their own breads on site from scratch. Unlike so many other restaurants where the bread is frozen and heated up at the restaurant, Panes makes everything there and it is an Amazing experience. Sometimes it is packed, but deal with the reality; a great place attracts crowds. And every time I visit, I also purchase a loaf of their bread. Remember, for a small restaurant to survive for as long as Panes has survived, in a highly competitive area; it has to be exceptional.", "pics": null}}, {"review": {"des": "One of the best sandwiches in town! Big portion, comes with potato chips, perfectly toasted bread for a nice crisp. I'll be coming back to try out the other 15+ sandwiches they offer. CASH ONLY! We also got the monster cookie due to its popularity on Yelp, and it didn't disappoint. 5 stars", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/4iGfu2us16Cfu9WgFYuzJQ/348s.jpg", "caption": "Using my hand for scale...and this is only half the portion"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/B_6Qu42ZAWoGvfImPRMKtQ/168s.jpg", "caption": "Veggie scrambled eggs"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/IEijCByVOEx5gZpxjVFEjA/168s.jpg", "caption": "Roast beef egg sanxwich"}]}}, {"review": {"des": "Tip1: Cash-only<br>Tip2: MONSTER COOKIE<br><br>Panes is a great place to grab a sandwich right by the Wellington brown line stop. They have a ton of options on house-made bread, as well as pizzas and pastas too. I ordered the roasted beef sandwich which came with onions, tomato and avocado. Portion size was generous and it came with chips too...for only like 7 bucks or so. Awesome sandwich!<br><br>And be sure to get one of their monster cookies. Perfect way to end a meal!", "pics": null}}, {"review": {"des": "Honestly some of the best sandwiches in Chicago, GREAT crusty bread, but a cafe in 2018 without WiFi?? what's the point", "pics": null}}, {"review": {"des": "Order the oxacoan on tomato bread. You will not be disappointed. I've tried most the other sandwiches and this is hands down the best one. The other ones don't even compare. Cash only and call ahead to place your order.", "pics": null}}, {"review": {"des": "I am very thankful that I live close by. I haven't had a meal yet that was not tasty and well done. I am trying different sandwiches by the week and I haven't been disappointed. <br> <br>Panes makes their own bread and gives you bread with most orders. The menu is wide ranging and doesn't change! Breakfast is amazing. <br><br>They are always on the ball with making your meal. Even when it's crowded they make your food very quickly. <br><br>Panes has very reasonable prices too which is a break from the majority of Chicago food scene. <br><br>It's cash only so keep that in mind, but they do have an ATM inside.<br><br>If there's item on the menu that isn't top shelf I'd say it's their pizza but it's still good. Leave your pizza order for the pizza specialists nearby. <br><br>Their hours of operation are very generous.<br><br>I don't know where'd I be without Panes in my backyard! They deserve heavy patronage every day of the week.", "pics": null}}, {"review": {"des": "It was a very good lunch I had the meatball sandwich I would go back. Nice atmosphere", "pics": null}}, {"review": {"des": "Amazing sandwiches.  A friend of mine recommended it a few weeks ago and I have gone back 4 times since.  The turkey club is excellent.  Really perfect food, it's like you mom is in the back making it for you.  Actually glad that they don't have wi-fi, don't need people who are not eating hogging up the tables when there is no place to sit.", "pics": null}}, {"review": {"des": "Always fresh, fast, well priced.  This has been a go-to for years. Panes never disappoints.", "pics": null}}, {"review": {"des": "There need to be more places like Panes. <br>I'm saddened it took me so long to discover Panes despite living a couple blocks away. <br><br>I say there need to be more places like Panes because it's very reasonably priced everything and perfect for that lunch when you don't know what you want. They've got about a dozen sandwich options most of which come on some of the best tomato focaccia type bread you'll ever have. And a lot of the sandwiches are creative. I had the spicy philly which was kinda like a cheese steak with a bit of chipotle mayo thrown in there. It was absolutely incredible. and despite only costing about $7.50, I got two meals out of it (admittedly had an appetizer to start with).<br><br>Great, quaint atmosphere with a bit of random everything, but again perfect for when you're not sure what you want. The pizzas look quite good and they have salad and even pasta options. <br><br>Only downside is that it's cash only which is a pain if you don't realize.<br>But can't wait to go back!!", "pics": null}}, {"review": {"des": "Love this place!  Its the best food that you can taste its homemade and done super well every time.  I have tried virtually every sandwich here and they're all amazing.  I keep going back to the Turkey Turkey and Pompazo on tomato bread (best tomato bread i have ever had with a sandwich).  I've also been back multiple times for breakfast/brunch too.   Their chilaquiles verde are authentic and the salsa is great.<br><br>Last but not least, they usually have samples f their freshly baked cookies or bread that make for a nice treat while you wait for your food.<br><br>I Love You Panes", "pics": null}}, {"review": {"des": "This a higher end sandwich food place in Lakeview. The trick is to place your order by phone and then go pick it up so you don't wait. My go-to sandwich is the Chicken Club. Enjoy!!", "pics": null}}, {"review": {"des": "Panes is honestly one of my favorites in the city. A cozy family owned and operated cafe that serves great homemade food.", "pics": null}}, {"review": {"des": "Delicious whole foods! And the employees are very sweet and welcoming. Unlike alot of northside chicago places. I would eat here everyday if I could.", "pics": null}}, {"review": {"des": "I have never had a better sandwich in my life. We seriously could eat here every week (almost do). This is a family run business and you can tell they put a lot of hard work into this place. It's cozy and once again...THE MOST DELICIOUS FOOD EVER!", "pics": null}}, {"review": {"des": "I have dreams about the Turkey Turkey, everything I've tried here is awesome. Their sweets are great as well! Only thing to note is it's cash only, but they have an ATM inside.", "pics": null}}, {"review": {"des": "Pollo diablo was really good.  The sandwich is pretty big so was going to only eat half but it was to good!  8 bucks for a sandwich and chips not bad.  Got the BBQ sauce on the side and it was super salty but warm and good.  Def will be coming here a lot during my lunch breaks.  Bring cash!<br><br>Update- came here again and ordered the pompanzo or whatever.. The last sandwich on the menu.  Super good!!! How do they get the chicken so juicy? Yum!  Had to give the BBQ sauce one more shot but it was extremely salty and pretty unbearable!  Never ordering that again.  Also not that big of a deal but prices online are different from the actual place.  All the sandwiches are around 8-9$ bucks.. Can't wait to try something else here!<br><br>Turkey turkey isn't horrible but not the best thing here.. If anything just get the tomato bread cause that was the best thing about the sandwich.. Everything else was average!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/aXjSG6z8T62PNsI0M1h6nw/348s.jpg", "caption": "Feta salad"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/3gno-FPWSO5LdKATvEATfg/168s.jpg", "caption": "Tortilla salad"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/NbFZSoOmrLfUTawcT2WdbA/168s.jpg", "caption": "Brunch omelette.. Pretty good!"}]}}, {"review": {"des": "I *LOVED* this place. This year I have the goal of visiting new restaurants --out of the ones I already know and love. Today I found this little gem through Yelp. What an amazing find!<br><br>I had the green chilaquiles which were absolutely awesome. I'd rather have them be spicier (that's just me), but they were really good. A generous plate of chicken, scrambled eggs and tortillas with green tomatillo sauce + cream and queso fresco. Sided with breakfast red potatoes, this was a real winner. My kids had the mac & cheese which was made from scratch and really good.<br><br>A highlight of this breakfast was the banana bread --which is made from scratch and baked in-house! This tasted gloriously while sipping my coffee before my chilaquiles came.<br><br>Really good service, very clean and priced right. I cannot say enough good things about this place. Oh, it's cash only, so bring those crisp bills with you.<br><br>I'll go back for sure and try the sandwiches and other breakfast dishes.", "pics": null}}, {"review": {"des": "I have lived in the area for years and every time I pass Panes, someone is cleaning the windows, setting up chairs, or exhibiting hard work somehow. It is clear that this is a family run business and this family is doing an amazing job! The food is outstanding and is always fresh. I often go in just to buy a loaf of bread, or some of their peanut butter balls to bring to a party. The family that owns and runs Panes is very hard working and cares about what they serve. This is a gemstone in Lakeview! I will always choose Panes before a chain sandwich establishment.", "pics": null}}, {"review": {"des": "Timing was on our side today common here. We were able to park across the street directly across from the restaurant. You order your food at the little bakery counter, part for it, then sit and wait for it to be brought out to you.<br>The bread from our sandwiches was made right there. It tasted fresh, but had a little thyme or rosemary in it, which i don't care for. I had chicken with bacon and cheese. They have us chips, but i didn't eat them.<br>What i really enjoyed was the little do-it-yourself filtered water setup. You can refill it as much as you wanted. It was a small, family owned, quant place.", "pics": null}}, {"review": {"des": "Panes is especially for those days when you realize you're spending way too much on eating out but you also just happened to not bring a lunch. They have delicious, huge sandwiches at a very reasonable price. I got the special written on the chalkboard which was a steak sandwich with mushroom & pepper jack. The bread is crispy on the outside and warm and toasty on the inside. All the ingredients are fresh and very hearty. I can easily split the sandwich into two meals. <br><br>Come here if you have 45 minutes to spare and relax. It is one of the best places for lunch if you want something quick.  <br><br>Bonus! Sometimes they have bread out on the front counter to sample.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/qT0GvOeYd1WFtVe8144WLQ/348s.jpg", "caption": "Steak sandwich with chips"}]}}, {"review": {"des": "Angel hair pasta with grilled chicken and spinach, sun dried tomatoes is awesome. Pairs great with the sweet bread", "pics": null}}, {"review": {"des": "Not sure how this came onto my radar, but I'm glad it did.  Stopped in for lunch Sunday...cute decor, seating for a few dozen.  I'd imagine parking to be more of a challenge on any other day.  We each ordered the Oaxacan pork sandwich and couldn't have been happier.  Delicious, marinated thick sliced pork with caramelized onions and roasted red peppers on some homemade bread.  Man, I'm sorry I was late to this party, but I'll definitely be back to try other options of the breads and pastries.", "pics": null}}, {"review": {"des": "Bread is great! I ordered the pasta and it was good. Very cute small place w great chocolate cake. Cute out door seating. Perfect for a little lunch trip!", "pics": null}}, {"review": {"des": "Amazing sandwiches and delicious sides..gotta try the Mexican pork sandwich!!! Soooo goooood!!!", "pics": null}}, {"review": {"des": "Having recently moved to Chicago with my partner, who is a Chicago native, he introduced me to Panes Bread Café, a Chicago staple since 1994! This place is amazing!! The place is really cute, and the food is just delicious! My partner ordered the Super Panes, which he last had about 10 years ago, and he said it was just like it was when he had it last and it brought back great memories! I selected the Spicy Philly, and it was truly delectable! The bread was very fresh, and the sandwich was made up of the best quality of ingredients, and ample sized as well! <br>They also have a various selection of desserts, which we did not order on this visit, but all of them look so good, a must on the next visit! <br>This will be a go to for us on many occasions, so glad I was able to experience such a great establishment!", "pics": null}}, {"review": {"des": "Have lived in the area for a few months and finally decided to stop by for carry out lunch, and was not disappointed! The pasta I ordered was fresh and cooked perfectly, with plenty of leftovers for later! Came with two delicious bread rolls as well, so I will be coming back to try more of the baked goods. My roommate and been there for brunch on the weekends, and has nothing bad to say either. A great meal alternative to all the lunch chains nearby, an absolute gem of a neighborhood food spot. All the employees I interacted with were friendly and efficient, and there's an adorable dining space for dining in. It's totally worth grabbing cash from the ATM beforehand, can't wait to go back and try what else they have to offer!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Ws5q8AhDZ2IuZdNsgKwh8Q/348s.jpg", "caption": "The spicy penne was amazing! Had the perfect amount of heat, and the creamy sauce was very tasty."}]}}, {"review": {"des": "Where do I start? Panes has been a top favorite of mine for almost 8 years now. And by favorite, I mean favorite restaurant of all time. I guess I must mention that sandwiches are one of my favorite foods, so this place is my heaven. <br><br>Homemade bread, fresh ingredients, and a variety of options. Their soups, salads and pasta's are also very delicious; my favorite being the mac n cheese. Their monster cookie is a must try. <br><br>My favorite sandwich is the Roast Beef. I love that all the sandwiches come with a side of Lay's chips. It's a perfect meal. The prices have been hiking up more than I'd like in the last few years, but even so it's still very affordable. <br><br>Anyway, I love Panes. So good. They have a cute patio and it's BYOB. <br><br>CASH ONLY!", "pics": null}}, {"review": {"des": "I come here about twice a week and I either order the tortilla salad or pollo diablo. This place is amazing and truly a gem.", "pics": null}}, {"review": {"des": "6 Years after my last review-Panes remains consistently the best place to get a salad, sandwich or pasta dish for lunch or for a quick dinner.  Wonderful staff, wonderful food.  <br><br>I think the only thing that has changed since 2010 is that they now deliver.<br><br>Thank you Panes!", "pics": null}}, {"review": {"des": "Freshly baked baguettes and other breads!  Yummy!  Excellent coffee and omelettes.  Cash only.  Very affordable in great neighborhood.", "pics": null}}, {"review": {"des": "If you go here and don't get a sandwich, you are out of your mind. The bread is fantastic. The roast beef is dreamy. This is better than any fast-chain sandwich you've had this year.<br><br>And treat yourself to a truffle. Because you're worth it and this place is amazing.", "pics": null}}, {"review": {"des": "Panes Bread Cafe has good food. Their sandwiches are tasty and some of their other things are delicious as well.", "pics": null}}, {"review": {"des": "I live really close to panes and have tried many items on their menu. The omelettes are really well portioned for 7-8$, but aren't very flavorful. The sandwiches always have something missing, I don't know what it is. They are just good, not amazing. I always expect more from their bread based on the name of the place - I've had their tomato bread which is pretty good but the bread that comes with salad and soups is super average. Tastes like regular white bread to me. <br><br>So overall -<br><br>Pros: relatively quick, cheap, fresh hot food, big portions<br>Cons: taste is average, cash only", "pics": null}}, {"review": {"des": "The Pollo Diablo sandwich made on their fresh baked Tomato Bread is something to write home about. When it comes to dining out, I never choose chicken because nothing compares to the tender, juicy beer-can chicken off the grill at home. But Yelpers convinced me to try this Pollo Diablo sandwich here at Panes, and I am so glad I did. Juicy, delicious and sooooooo tender! This sandwich is described on the menu to have some kick to it, but I never discern such. I think they dilute the sriracha with too much mayo. <br><br>FYI, when I ask for onions added to any of their sandwiches, all they have to offer are sweet caramelized onion. I like happen to enjoy these onions, but some people probably wouldn't --they are super sweet! They are so sweet in fact, I had to inquire about their preparation. And the answer is yes, the onions are caramelized with sugar.<br><br>Stuffed mushrooms are well executed, and the surrounding marinara sauce is a great touch, but... $3.75 for 4 small 'shrooms is steep.<br><br>Taking home fresh loaves of bread is always a win. They are super delicious and very reasonably priced. I like the country white for homemade grilled cheese. <br><br>I love how they roast the vegetables for the sandwiches, rather than putting them on an oily grill. I am usually afraid to order Portabella sandwiches at any restaurant, because I know that mushroom is a sponge for oil. Panes takes the danger out of ordering mushrooms; their roasting process is spot on! <br><br>Go to Panes and order off their menu freely. I'm quite certain everything is a win.  They just know how to create tasty stuff. But with that said, whatever you choose, do not order a monster cookie! I repeat: Do NOT order a monster cookie. They are too good and I want them all to myself. #cookiemonsterindisguise", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/SIh1-RJe33UnG3haHINneA/348s.jpg", "caption": "Omelet - Fluffy and Delicious"}]}}, {"review": {"des": "Excellent sandwiches and treats, run by lovely people, a wonderful spot to sit and enjoy the neighborhood. Bring cash or check!", "pics": null}}, {"review": {"des": "Honestly, it can't get much better for the price and quality.  This place is family owned and it shows when you're there, and I mean that in a good way. <br><br>Panes is a great example of what a small family owned joint brings you. Unique food at a great price, and that includes their brunch menu as well.  Some top lunch/dinner recommendations are the El Diablo, Super Pannes and Sunny California.<br><br>Now.. if you are a hipster, only shop at Nordstroms, or consistently watch the TV show \"Girls\", please just stay away.  I don't need you ruining it.", "pics": null}}, {"review": {"des": "I would have ordered a Sandwich but I did not realize that the back of the menu had the sandwiches. I ended up with the Spicy Penne. Overcooked noodles, unwarmed sauce, it was edible but barely. Oh and the white bread must have sugar in it it was so sweet, the other bread which you got less of was good with herbs. I might have bought the bread loaf but they don't take credit cards but are so kind to have an ATM machine there.<br><br>Only ended up there because Pompei was closed. I had hoped for some really good Italian but no such luck at Panes Bread.", "pics": null}}, {"review": {"des": "Panes is really nothing special.<br><br>I came here for lunch after reading a lot of good reviews. I ordered a chicken sandwich with tomatoes and pesto. It was adequate for the meal, honestly totally forgettable in terms of taste and quality. The pesto lacked flavor that I end up adding a lot of table salt and pepper to the sandwich. The side chips were stale. My main gripe was that a sandwich made in a bakery should have really fresh, delicious bread. However, this sandwich's bread was totally average.<br><br>I don't think I'll be back to Panes. It is fine for an average lunch if you are in the area.", "pics": null}}, {"review": {"des": "Wow these sandwiches are delicious!!!! Great reasonable prices as well! The sandwiches come with lays also. Super filling but all the ingredients taste very fresh. Will definitely be back to try more of the sandwiches soups salads and pastries !", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Iwvsl8Nh3hD9U19QO1YiOQ/348s.jpg", "caption": "Todo Italian on the garlic oregano bread"}]}}, {"review": {"des": "Great food! Super fresh tasting... could be a little bit more seasoned but salt does the job", "pics": null}}, {"review": {"des": "Panes Bread Cafe is a neighborhood gem that has been near the corner of Sheffield and Wellington for 1,000,000 years.  Ok, it's only been 20 years.  20 YEARS!!!!   How do I know?  I used to live around the corner when they opened up.  '93 or '94.  <br><br>20 years later Panes is still one of THE best sandwich shops in the City of Chicago.  Sadly, they have had a massive price increase over the years:  their excellent, best in the city sandwiches now cost $5.95 instead of $4.95.  the nerve.<br><br>The same lady has been running the place the entire time (forgive me, Panes Lady...after 20 years and 200 sandwiches, I should know your name, but I don't!).  She's 20 years older, I'm 20 years older, and Panes still completely blows the doors off of nearly every other sandwich joint in the city.  Quietly, calmly, and efficiently, I might add.<br><br>It's cash only.  So if you don't have $10 in your pocket, don't come.  They don't deep-fry anything, so if you're looking for a gut-bomb, this ain't yer joint.  And they do great pastas, fresh bread to go, and some simple yet not-every-day desserts as well.<br><br>Panes is small, so seating is tight, and at lunch time it's hard to get a seat.  But they are excellent at carry out, so take it to go and enjoy it at your own place where you have all the room in the world to savor the outstanding ingredients and fresh bread that make their sandwiches so spectacular.<br><br>The Popular, the Pompazo, the Pollo Diablo, the Roasted Beef, the Super Panes...all are FABULOUS.  But don't ask me about the Oaxacan Pork - because I don't want you numskulls ordering it and then there won't be any left for me!  (Ok, it's really, really good!)<br><br>For pastas, their Panes Linguini is a rock solid takeout winner at only $7.50.<br><br>Panes is just great all-around:  great people, great place, great sandwiches, great pastas, great bread, great prices, and a great 20 year track record.<br><br>Panes, congratulations on 20 years, and please, please, please stay open for 20 more!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/UuNrtga6jV8DPfkNtirCsg/348s.jpg", "caption": "2014 sandwich menu w/prices"}]}}, {"review": {"des": "Ordered delivery from here and am so glad I did. I ordered The Popular and my boyfriend ordered the Todo Italiano. Both were delicious but The Popular was definitely the winner! Delivery was on time, but there is a small delivery fee. Would definitely want to go to the cafe next time and see what else they have.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/gvlfOS1IMAzOOPlJprNC2w/168s.jpg", "caption": "The Popular"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/TTiKliSI9Mh8qa1DBo2TCw/168s.jpg", "caption": "Todo Italiano"}]}}, {"review": {"des": "This place is CASH ONLY (personal checks are accepted here as well).  <br><br>My intention was to get a sandwich or soup, but with $2, it didn't get me far enough for have a real meal.  <br><br>They have an ATM on site though, but it was out of order.  How did I know that?  My husband was assigned to fix the machine, and that was why I was here.  Make sense now?<br><br>Anyways, I got myself a mint chocolate cookie for $1.75.  I'm assuming the tax was included because the price was what exactly listed on the menu.  It was delicious and not too tiny.  Everyone seemed to be friendly and was not too crowed like other cafe places in Lakeview neighborhood.  I wish I wasn't \"poor\" so that I could try their food.  Other patrons were dining in there and they did look appetizing...oh bummer!  <br><br>They do have wifi available...and a nice patio!", "pics": null}}, {"review": {"des": "I distinctly recall visiting here during a Chicago visit circa 2007.  Seven years later, Panes was remembered fondly.  I sought this place out again upon returning to Chicago in March 2014 because what ever better to do on a winter evening of a blustery -15 degrees than to walk two miles for a sandwich and a tiny buckeye.  Slipping on ice works up an appetite.  <br><br>For less than the price of the generically vapid and unvaried chain deli lunchtime sandwich, you can support a lovely little local deli with fresh bread and giant sandwiches made to order.  My favorite is the Pollo Diablo.  It's not that spicy if you're a spicy lover.  The sandwiches are hearty and huge.  See pics; they're totally instragram worthy.  <br><br>I love taking friends here for lunch.  They love it and they love the prices.  It's cute and no frills and a hidden gem.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/WKWky8XNYTVKuLtUuRIExA/168s.jpg", "caption": "Pollo diablo"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/K8kA2phkbcaJUqxjBgsV3g/168s.jpg", "caption": "Pollo Diablo"}]}}, {"review": {"des": "This is my favorite mom and pop sandwich shop! Turkey Turkey is the best sandwich on the menu and the homemade tomato bread is amazing and so fresh. Staff is always very nice.", "pics": null}}, {"review": {"des": "Amazing sandwiches for a great price!! In addition to an excellent service. I come here every week!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Tl9RQtw_SDCKJrZYRwji-Q/348s.jpg", "caption": "Chiken Club ! ( take home)"}]}}, {"review": {"des": "I recently moved from Chicago to Portland, and this is one of my top 5 restaurants I will miss from Chicago! (not kidding when I say I shed a tear when I left.) I feel like I'm visiting family every time I'm here. Great service, AMAZING FOOD, and very, very affordable. Plus, you get free bread if you're dining in. 100 stars.", "pics": null}}, {"review": {"des": "I feel kind of guilty writing this review but honestly my food was disgusting - mealy tomatoes, wilted greens, packet of high fructose corn syrup dressing, stale bread even though it's a bakery. Everything about it was really, really gross. I can't fathom how this place is getting good reviews.", "pics": null}}, {"review": {"des": "I live close by so it is a super convenient location for me. I am satisfied with the food but I think the breakfast could be better. The owner is super nice and other workers are great as well. Great price points.", "pics": null}}, {"review": {"des": "My husband and I stopped in here tonight and had some great sandwiches. We had the Todo Italiano and Pollo Diablo.  The bread is so good, ingredients definitely tasted fresh and we loved the flavor combos. We also got a chocolate chip cookie which was delicious. Definitely coming back to try more sandwiches!", "pics": null}}, {"review": {"des": "So I stopped in to grab a sandwich for my wife who was at the hospital (just across the street) with our newborn daughter who decided to join our family one month early. When I arrived I was greeted by Karen with a great big smile and she had my wife's food ready to go. She provided me the highest level of service a customer could ask for not to mention my wife loved the sandwich!!<br><br>We don't live in the neighborhood but we'll make sure to come back in the future to try other sandwiches and to introduce Karen to our little girl!!", "pics": null}}, {"review": {"des": "We ordered the turkey club, chicken club and the tortilla soup. Excellent food and service. Friendly staff.  We will be back!", "pics": null}}, {"review": {"des": "The reviews here are incredible, but I must have swung and missed during my experience, since I thought the food was pretty average.<br><br>The Pizza Bread appetizer/starter was pretty bland and my Pollo Diablo was served on some pretty tasty bread but was light on filling...this ended up being a blessing in disguise, since I walked to DMK next door for a stellar chocolate shake.  The potato chips on the side were also pretty plain and there were not many of them.  But I love anything BYO and the outdoor patio was perfect two days ago for sitting outside with my big (11 peeps) team of friends.<br><br>If I lived closer, I might try other things on the menu but I'm not sure I'd be back.  I will give Panes big props for being priced appropriately...for $6.50, you get an average sandwich of average size.", "pics": null}}, {"review": {"des": "Whichever sandwich you choose, order it on their homemade tomato bread!  It is dangerously good.  I always stop here for lunch after getting my hair done next door.  I am never disappointed.  Quick service.  Cash Only.", "pics": null}}, {"review": {"des": "Stopped by Panes Bread Cafe on an urgent bread craving - ordered two sandwiches (Super Panes and Roast Beef) Okay amount of deli meat, great portions and sauces..the bread was fantastic :q Perfectly chewy and toasty, would eat again just for the bread.<br><br>The space is large! We sat outside in the sidewalk area but the inside has ample seating. Cash only though. Overall, wouldn't go out of my way but would definitely come back if I'm in the neighborhood for reasonably priced sandwiches!", "pics": null}}, {"review": {"des": "I was really excited to try this place because my friend had told me that it was good here. I decided to go in one day around 4:30pm to give it a try. I looked at the menu for a bit and ended up ordering their \"The Popular\" sandwich. It was decent I should say. It wasn't like \"omgsh this is the best sandwich I have ever had\". It was kind of dry and not the best with flavor. I give 3 stars because it was okay and their tomato bread that the sandwich came on, was good.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/rf4dvQOOEM89rCth70f2ZA/348s.jpg", "caption": "\"The Popular\" sandwich. It came out to be around $7 with some cents. This includes a small bag of Lays chips."}]}}, {"review": {"des": "This place is a great deal for the quality of food.  I would give it 5 stars but my delivery order was shorted a bag of chips and I was given the wrong dressing with my spinach salad.  I wish they made they're own dressing, it seems like that is the only thing that isn't home made.", "pics": null}}, {"review": {"des": "The Pollo Diablo is my go-to sandwich! This original bad boy of spicy chicken and spicy mayo NEVER FAILS! <br><br>The other winner is the Tortilla Salad, I usually ask for spinach instead of lettuce and ask for extra avocado - delicious! <br><br>Other standouts are the Cream of Tomato Soup (so creamy and sooooo good!) and the Monster Cookie (you just have to!).<br><br>The owner and staff are nice people.  I work close by and have been coming here regularly for almost 8 years. They definitely notice when l haven't been coming in a while or when I deviate from my normal Pollo Diablo!", "pics": null}}, {"review": {"des": "I'm not sure how I haven't been to this place before today; it's so good! I got the portobello sandwich, side of potato salad (a little bland, tbh) and the chocolate chip banana bread which totaled out around $17. Would have been cheaper if I had some self control, but definitely worth it!", "pics": null}}, {"review": {"des": "Wow!! What a fabulous find! So inexpensive! Huge portions! And delicious, real, fresh, homemade food!! Will be coming back!", "pics": null}}, {"review": {"des": "It's unassuming, but once we found this place, we fell in love with it. Terrific sandwiches and great fresh baked bread if you're having people over. While it would be easier if they took credit cards, I don't feel that it is worth docking any stars for. My personal favorite is the pompazo.", "pics": null}}, {"review": {"des": "Nom. So glad I was finally able to try Panes! I know Panes is mostly known for their sandwiches, but this is definitely a hidden excellent breakfast gem. Came in with the boyfriend on a snowy Saturday morning and it was basically empty. Panes has a casual atmosphere with a great homey feel to it. You order at the counter and then find a seat. We had a really difficult time deciding what to order, they have several omelet, egg scramble, and breakfast sandwich options. I ended up going with the roast beef egg sandwich and the boyfriend got an egg scramble with  veggies that he added bacon to. Our breakfast was incredibly inexpensive, I think the prices at Panes are a few dollars less than most breakfast places in the area. <br><br>Our food was up quickly and brought to our table. My sandwich was phenomenal! Plenty of perfectly cooked roast beef, muenster cheese, sweet caramelized onions, and scrambled egg on, what was definitely, a freshly baked sandwich roll. The flavors complimented each other so well and I had to forfeit some monster bites to my dining companion because it was so huge. The sandwich came with really tasty roasted potatoes. The boyfriend had an egg scramble with veggies and bacon that was incredibly flavorful. It also came with the roasted potatoes and a green salsa. We were given a basket of bread with our meal that just makes me want to come back and try ALL of their breads! Overall, I definitely recommend Panes for breakfast and will be returning for lunch!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/orjxm3_2V9ODzM4E6k4AAQ/168s.jpg", "caption": "Egg scramble with potatoes."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/YUhzlkFeguJGCMu7x-XRHw/168s.jpg", "caption": "Roast beef breakfast sandwich, awesome."}]}}, {"review": {"des": "I haven't been to Pane's for several years, but I still rate their BLT and rice pudding with white chocolate chips as the best I've ever eaten.  Making a special trip to Panes when we visit Chicago this summer.", "pics": null}}, {"review": {"des": "This restaurant has my favorite sandwich in the city - The oaxacan pork sandwich is a delicate blend of pork, onions, peppers, and some great seasonings. I savor every bite while eating here. My wife and I go here 2x per month, and would be here more if we lived closer. <br><br>Because the oaxacan pork sandwich is so good, I have yet to try another thing on their menu. It is so good, that I could probably eat it daily. Restaurant is very cozy and a fun, very casual place to take a date.", "pics": null}}, {"review": {"des": "This bakery is close to me and I get baguettes occasionally. <br>They have a few varieties. <br>I like the rosemary. <br>I got a banana bread loaf and it was a little dry. <br>The prices are right but they only accept cash or cheques.", "pics": null}}, {"review": {"des": "I went to Panes years ago and remembered the reason I've not been back the minute after I ordered and was told 2 sandwiches would not be ready for 15 minutes, freaky slow!!! Plus cash only, come on. We ordered 2 sandwiches the super panes and the red pepper  and mozzarella neither had much filling and the bread got real soggy from the sauce. The bread was to airy and light for me kind of reminded me of one of the cheap Jewel loaves of bread. Both sandwiches came out hot which was not mentioned on the menu which on a hot day I was hoping for a cold crispy sandwich. I see they have other breads they might be better. Customer service was lacking, when I called before I came in and asked about the menu I was told don't look on line the menu on there is 20 years old , you might want to address that right?", "pics": null}}]}