{"name": "papas-cache-sabroso-chicago", "reviews": [{"review": {"des": "Papa's Cache is always a MUST on every trip to Chicago, the restaurant serves Puerto Rican cuisine  that'll make your tastebuds go wild - It's home to the Jibarito , a sandwich that uses tostones instead of bread, and with every bite you'll fall more in love. <br>The Jibarito is definitely the star of this restaurant, along with its Saturday Special meal that consists of pernil (roasted pork) , arroz con gandules (yellow rice with pigeon peas) and sweet plantains. The staff is always super friendly and welcoming, along with Papa himself who is usually at the restaurant talking and befriending customers . The entire vibe of the restaurant is very authentic and home-y, reminding me of the restaurants back home on the island of Puerto Rico.<br>The restaurant is in a small location and typically busy (People Love Papa's! Clearly) and if you're with a large group of 5 or more you might have to wait a bit in order for them to accommodate but it's definitely possible. I typically visit the restaurant with my family of 7/8 people and they always accommodate for our size with ease. <br>Papa Cache's is where you can find delicious Puerto Rican cuisine with good service at affordable pricing - add it to your Chicago bucket list and put a star next to it for urgency.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/BZuJCNfrmRQPWpaiUrmLGw/168s.jpg", "caption": "Steak Jibarito con Arroz con Gandules pictured with Cola Champagne drink."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/7p8cZk611PgO5j2w00DTFw/168s.jpg", "caption": "Steak Jibarito con Arroz con Gandules."}]}}, {"review": {"des": "First impressions; pretty busy little spot. The server was nice and attentive. The chicken was fall off the bone, moist and  tasty.  We had the steak sandwich were the bread was actually fried plantains. The steak was flavorful and tender.<br><br>Will definitely come back!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/wx3-NVtFLYxHfCHMUyzHIQ/168s.jpg", "caption": "An artist's sharing their talent. I didn't want to take pictures of the people in the restaurant."}]}}, {"review": {"des": "This place is great. Amazing food and an even better team that works in the restaurant. I went for the first time about a month ago and I was so impressed that I went back a few weeks later. The other cool thing was that the owner, \"papa\" was there both times I've eaten there. On my first visit he came up, asked how my meal was, and then gave me a brief history of the restaurant and how he runs it with his family, etc. Class guy. <br><br>My only issue I have with the restaurant is that the last time I was there they must have had an exhaust fan out inside of the restaurant as when we left my girlfriend and I smelled like garlic the rest of the night. <br><br>Even with the smell it's still 5 stars and we'll be back soon.", "pics": null}}, {"review": {"des": "Great casual, hole in the wall, mom & pop type restaurant. It's BYOB, which I always love!<br><br>The Jibarito, which is a sandwich with fried plantains serving in place of the bread. It can be ordered with steak, chicken or vegetarian. The Steak Jibarito is DELICIOUS! It's filling, crispy and altogether satisfying. <br><br>My husband got the Papa's Whole Chicken, which was tender & cooked perfectly, but he was definitely eyeing my Jibarito the whole time. <br><br>Would definitely recommend for a casual, BYOB dining option for affordable & filling food!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/4ssf6SWcdrrPZpcFK6bB-w/168s.jpg", "caption": "Papa's Whole Chicken"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/DbJLtXymj6ZLD5fYil6-OQ/168s.jpg", "caption": "Steak Jibarito"}]}}, {"review": {"des": "This was the first time I heard of a Jibarrito (steak, lettuce, tomato, and mayo in a fried plantain sandwich). The joint was a little small so we had to sit outside when it was like 20 degrees outside to avoid waiting for over 30 minutes. But, it was totally worth it! The Jibarrito was AMAZING and  we got more fried plantains on the side that were a little sweeter. <br><br>I would definitely recommend this restaurant if you are looking to try something new!", "pics": null}}, {"review": {"des": "Super good rotisserie chicken and sides.  They have a small outdoor covered area to eat as well.  Plenty of street parking.  Lots of people came for take out as well!  Ordered the quarter chicken with rice and beans and it came with bread as well.  Cleaned my entire plate it was so good.  The chicken was moist and not dry at all as it can be with some rotisserie shops.  Definitely coming here again.", "pics": null}}, {"review": {"des": "JIBARITO JAMBOREE<br><br>These purveyors of a legendary sandwich have received their fair share of accolades.<br><br>As part of a trip to 'Little San Juan' (as I call it), Nichole C and I came here for lunch following a visit to Botanica Victoria in the Puerto Rican district of Humboldt Park.  I'd never had more than a bite of an authentic jibarito so the choice for us was obvious: Papa's Cache Sabroso.<br><br>Seeing that they had a BYOB policy, we stopped at the nearby Boriken corner liquor store -- where we encountered a resident kitty! -- and picked up some beer.  Though the restaurant itself is small inside, they have an enclosed patio area where we wound up sitting.<br><br>Not long after cracking open a cold Modelo, a server came by to take our order.  I naturally had to get the steak jibarito con arroz ($9.50), their signature sandwich with rice.  Two fried garlic plantains bounded meat, cheese, shredded lettuce, tomato, onions and mayo.  It tasted great; I can see why they're renowned for it.<br><br>NC got the Saturday special, \"lechon asado con arroz y maduro\" ($11) which translates to roasted pork with rice and sweet plantains.  The meat was tender and fell off the bone, while the ripe plantains reminded me of caramelized bananas.  It too tasted fantastic.<br><br>We also got a half order of yuca on the side ($2.75) which came with onions.  I wasn't a big fan but NC loved it.  Better still, they had cans of Coco Rico, a tough-to-find coconut soda that reminded her of home.  Seeing the smile on her face earned y'all big points in my book!<br><br>Bread = 5<br>Circuses = 4<br><br>I had initially eyed a 4* rating for Papa's, but after pondering how much we enjoyed lunch, I had to reconsider.  Coupled with a belief in BYOB and some unique Puerto Rican sodas, that pushes them into 5* territory.<br><br>You need not be a full-blooded Boricua to enjoy their excellent jibarito.....you just have to appreciate good food.  Recommended, si!!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/SvXzKDRQDG-lFKF682UY6w/348s.jpg", "caption": "The Saturday special is \"lechon asado con arroz y maduro\" ($11, roasted pork w/sweet plantains). Side of yuca ($3) and can of coco rico!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/xMANJYP8AvQ05fJGRNjtvg/168s.jpg", "caption": "Their hours, loled @ \"leave me alone I'm closed!!\" on Sundays"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ATPG120wKMyvOby24k_u5w/168s.jpg", "caption": "Their signature steak jibarito ($9.50) with rice. It's two garlic fried plantains with lettuce, tomato, mayo and cheese! Tasty."}]}}, {"review": {"des": "Papa introduced me to the phenomenon that is the jibarito when I moved to Chicago way back when and I still have yet to find a better rendition nearly 10 years later! Technically chicken is the specialty of the house but I always get steak in mine...", "pics": null}}, {"review": {"des": "Small but friendly staff. Owner was very engaging when I said hi while he stepped outside.<br>Jibarito Steak-4.5 stars<br>Chicken Caesar Salad-5 stars. It was so good per my 10 year old she ate a whole adult portion.<br>White Rice-3.5 stars great texture not oily was a pinch short of salt for my liking. But it was enjoyable.<br>Red Beans-3.75 stats awesome taste, a little watery for my liking. I could of used a little more for the portion of rice I received.<br>Arroz con gandules-4 stats It was really good.<br><br>3.5 stars-Service charge of 20% in my opinion was excessive for a party four given the size of the restaurant and the limited menu.<br>This place is good for a quick trip back home<br><br>3.5 stars Malta was at almost room temperature", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/GyuCOFtXvvFjglkzqzO5sQ/348s.jpg", "caption": "Arroz y habichuelas con Chuleta"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/F0H_EQkyolzW-4RAzyUYlw/168s.jpg", "caption": "Chicken Caesar Salad"}]}}, {"review": {"des": "Hey they got it going on. Small but effective. Good people always with a smile. It is a busy place but you get your food quickly.<br><br>They even have a wall of fame on the east dining area wall. I haven't taken the time to do a close-up of it because I don't want to be standing over people as they eat.<br><br>Again great place to visit with good food and pleasant people working there.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ea41AwfYA_43d2lRH6cK-A/168s.jpg", "caption": "Chicken Jibarito with Spanish rice"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/X0gi46KDq8JxAC9LqiCB5A/168s.jpg", "caption": "Papa 's Chicken Salad"}]}}, {"review": {"des": "I'm not sure the jibarito here was better than the one I had at Borinquen a couple of years ago, but it was very close.  And the chicken?  Let's just say your best bet here is to order ANY dish that has the chicken.  We got a dark two-piece order with the sides of rice and beans, and a steak jibarito.  The steak was fine, and the toppings on the jibarito were also just...fine.  But the plantains of that jibarito were perfect, so next time, I'm just going to get it with chicken instead.<br><br>Bare bones interior.  Not much space inside, and the sign is completely obscured with the door housing that covers the front patio.  It's not sexy, but nobody cares because the food is so good.  And the prices are just about right...we dropped $18 for a lot of food and a little bit of takeout.<br><br>This place has been around for a bit, so if you haven't hit this by now (like me before this visit), be ashamed, lower your head, eat the food, then add it to your rotation.  Great service too!", "pics": null}}, {"review": {"des": "This place renowned for there jibaritos. Unfortunately, I found mine dry and not as flavorful as I expected due to a previous experience I had. I previously had a place called Borinquén and figured to try this place since it was well known. But I did prefer Borinquén best.  Borinquén was a little messy to eat but that easy because the meat portion was bigger and they did had curly fries or rice as an option. <br><br>Service was a little slow and it wasn't that busy. Had to keep calling over the waitress for minor things like forgetting to bring napkins to our drinks. Overall wasn't impressed. My husband does prefer this place over Borinquén especially bc the arroz con gandules doesn't have pork and he's Muslim.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/2OdmoSTz2Ob4Emlrxx07Cw/348s.jpg", "caption": "Arroz con gandules and a steak jibarito"}]}}, {"review": {"des": "This place was absolutely delicious!! We were in Humboldt Park so we thought we should try some Puerto Rican food for lunch! I was intrigued by jibaritos so we came here.<br><br>We ordered steak jibarito with Spanish rice and the 1/2 chicken dinner. Everything was so well seasoned. The plantains added a different touch to the sandwich--they were crispy on top but starchy in the middle, slightly sweet and garlicky. The chicken was so tender, moist, and full of flavor! We also got yuca as a side for our chicken. I was expecting yuca fries so I was surprised when steamed yuca came out. It wasn't bad, just unexpected, but the texture of it was a little too gloopy. It wasn't anything the restaurant did wrong! I just realized I like fried Yuca more. :) <br><br>The restaurant is also BYOB and there's a little grocery/liquor store a block away! It was a super nice experience to just chill on their patio with our beers and full+happy stomachs. Service was also stellar! Can't recommend this place enough.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/0kz_wOMxCjMLkBJWFuz1XA/348s.jpg", "caption": "Steak jibarito with 1/2 chicken dinner. We asked for hot sauce which was homemade and delicious!"}]}}, {"review": {"des": "This place is incredible and so delicious!  It is totally worth the trip to go out here. The food there is legit Puerto Rican food and everything was very authentic for a pretty decent price. I ordered 2 pieces of chicken with arroz con gandules, sides of yuca and platanos maduros. Even the tostones were very well done. The total with a drink came out to be about $12 for all that food. Originally from Miami so to see a place cook like this way out in Chicago was a nice reminder of authentic Hispanic culture. <br><br>Since this is located in a small hole in the wall restaurant (those are always the best kinds) keep in mind that it can get crowded pretty quickly. There are only a few tables inside (maybe about 7?). There was barely a long wait for the food to arrive. Just a couple of minutes. Worth checking out and highly recommended.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/l-nIDrcZGmZXudOv-RqxxQ/348s.jpg", "caption": "Arroz con Gandules, Tostones, y Yuca. Only thing missing was the platanos maduros which were just as incredible."}]}}, {"review": {"des": "This place is a hole in the wall but I'm telling you I dream about their jibaritos. Its tiny inside but it is BYOB if you can find a spot! At night/dinner on weekends the line takes forever but please wait it out because you will have a new favorite spot!", "pics": null}}, {"review": {"des": "One of the best bang-for-your-buck meals in Chicago. We got the whole chicken (which comes with rice), plantains, and flan, and the bill was 25 bucks. Can't beat it. The plantains were cooked perfectly, and not too sweet. The chicken was seasoned well and super juicy. We had it with the green hot sauce, which is addicting but very spicy. Flan was fairly standard. Had tons leftover, which made this an even better deal. <br><br>It's BYOB, and conveniently, there is a liquor store across the street. Small restaurant, but service is great.", "pics": null}}, {"review": {"des": "I visited a few weeks ago but on a Saturday evening. We waited less than 10 min to be seated on the enclosed patio. The food was alright through I would have liked more seasoning and flare added to the shrimp dish especially since the server recommended. It's BYOB which is nice. I wouldn't put this on my short list considering I've eaten PR food all my life and This just didn't get me excited.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/OYZgxmHo4JNNHfzWrRXe9Q/348s.jpg", "caption": "The Shrimp dish"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/98TtIk53wxVE-GsfSxbTSg/168s.jpg", "caption": "Sweet plantains"}]}}, {"review": {"des": "If someone ask me where to go for fire Latin food in Chicago, I'm sending them STRAIGHT here.<br><br>Please don't be a scary picky eater....<br><br>try the Jibarito<br>Yuca &<br>Plaintains.<br><br>Also it's BYOB...wtf else do ya want!?", "pics": null}}, {"review": {"des": "The absolute best Puerto Rican restaurant in the city! I usually get a steak jibarito and arroz con gandules.", "pics": null}}, {"review": {"des": "Best tostones I've had outside the island. They're huge with just the perfect amount of salt and definitely not oily.<br><br>I had the shrimp dish with rice and habichuelas. I gave it 4 stars because  I really wanted dessert and they were all out, although I admit it was a late dinner. <br>Other than that it hit the spot while away from home on a business trip :)<br><br>You want PR food while in the Chi you gotta go to Humboldt Park!", "pics": null}}, {"review": {"des": "Food is amazing, very tasty, like home made. Service was pretty good too. Price is great!! I would definitely come back!", "pics": null}}, {"review": {"des": "Delicious, probably the best Puerto Rican food I've had in Chicago. I had the steak jibarito and shared a 1/2 chicken and side of maduros with my friend. Yum! That's really all I have to say. <br><br>There was only one server and she was very pleasant but stretched a little thin trying to attend to everyone. So it took half an hour to get our food. If they could get the dishes out a little faster, this would be 5 stars for sure.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/VOX3AnAFwCo0RUedqznmUQ/168s.jpg", "caption": "1/2 chicken with maduros"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/aTZHoePME4UnoEZFeMsKng/168s.jpg", "caption": "Steak jibarito"}]}}, {"review": {"des": "I really love this place. So much I went back twice in a week. I only eat chicken and fish, so it's hard to find a place that has great juicy chicken with all the seasonings. The tostones were good but on the second day, they were fried too hard. The rice and beans were to perfection and the plantains were just what I needed. My friend did care for her chicken but she love their tacos and said they were \"on point.\"<br><br>The decor and size of this place is a little confusing to me. It's like the outdoor seating is bigger than the inside, which in Chicago we don't have perfect weather all-year round. <br><br>Another thing to make mention of is please be aware when you sit down to order your chicken, it will be like a 20-30 wait. The first time I went, it was 25 minutes and the second time it was 30 when they told me 20. I didn't complain because I knew my chicken was going to be fresh. <br><br>Overall, it's a nice little gem tucked away on a Main Street in Humboldt Park that serves succulent chicken and excellent customer service.<br><br>I'll be back, but wondering if I can call in my chicken??", "pics": null}}, {"review": {"des": "Good lunch spot, awesome jibarito place!!! I have had the chicken and vegetarian jibaritos here, both are great. They have a nice patio in the summer. They do sit down and take out. Service has always been great as well :)", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/EdLx6eUv2GrwjHwnaemXPA/348s.jpg", "caption": "Vegetarian jibarito with white rice and beans"}]}}, {"review": {"des": "This is by far the worst experience I've had at a Latin restaurant. This was my first visit to this restaurant. I got there with my husband and daughter at 7:45. We were told the wait is 15 to 20 minutes. We got seated 45 minutes later. The delay in getting food is unreal. We ordered 2 jibarito sandwiches and I got the lechon special. We ordered within 5 minutes after being seated since our wait was so long. Our food came out at 9:15....45 minutes after we ordered!!!! We were ready to leave but since it was so late in the evening not many places were open. I didn't eat the lechon, it was terrible and so dry. The rice was under cooked. I will never go back here again. Not worth it.", "pics": null}}, {"review": {"des": "Very rude..<br>After a customer calls in a order they criticized them..<br>Horrible customer service. .<br>Expensive and cheap on the food", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/C08GZh8vpxiwwzqY74_fHQ/168s.jpg", "caption": "Horrible  I don't recommend this place"}]}}, {"review": {"des": "The jibarito was good !!! But they took forever to make jibarito 25/30 mins lmao !!! Rice sucks was nasty !!! And she charged me for a big parcha and gave me a medium size beside half of my rice portion !!!  My stalker was behind all of that of course and the lil dude acting like own the place with the black guy next to him acting like they knew me the whole time  but from where tho ?? Lmao ... but the place was busy cause of me cause they all waiting got me to show up just to give me problems and half of my stuff n nasty rice !!! You always want a nice review from me in yelp so you know for the next time I show up to your fancy lol restaurant !!!", "pics": null}}, {"review": {"des": "I can say I have found my Puerto Rican spot! I am a lifelong Chicago resident and I JUST discovered this gem! I decided to try a chicken jibarito and it was freaking amazing! The rice taste just like my aunts and the Maduros were actually maduro!!", "pics": null}}, {"review": {"des": "Holy jibarito! I approached this place with a little trepidation. Chicken jibarito? I thought those were a steak thing. Boy was I wrong. Everything about this sandwich was excellent. Crispy plantains, flavorful chicken, perfect proportions.... it was supremely excellent. The rice was slightly dry but otherwise quite good. I didn't try anything else (how many calories can you expect me to eat in a day?!), but I'd happily go back any day. They have an enclosed patio seating area that was a perfect option for a light spring day. Highly recommended.", "pics": null}}, {"review": {"des": "How could anyone give this place less than 5 stars? Amazing food. Outdoor seating. Luge music on fridays. Literally one of the best places in town.", "pics": null}}, {"review": {"des": "I seriously feel this is the best PR food in Chicago. The mofongo is delicious. The rice tastes amazing. We have ordered the carne frita, jibaritos, habichuelas, bistec and it was all just as excellent. The owners and staff are incredible people.", "pics": null}}, {"review": {"des": "Amazing! Hubby and I went here on a Saturday night. Place was busy but we got a table. Waitress was attentive. Brought us wine glasses for our bottle we brought in. Upon sitting down we received complementary bread which was delicious. Meals came out promptly and were hot. Plates were exactly as ordered and plentiful. You definitely get bang for your buck. I can't say enough about this place!", "pics": null}}, {"review": {"des": "Best roasted chicken ever. You must have the green salsa that comes with it. I could literally put that salsa on everything. Place is extremely small outside but they have a patio in front. I've been coming to this place for years and will continue.", "pics": null}}, {"review": {"des": "Love trying new spots for a jibarito and they have the best one so far!! It was so fresh not too much garlic just enough and the meat was well cooked. If you haven't tried you must go!!!", "pics": null}}, {"review": {"des": "The sandwich, get it...enough said. I don't care for anything else other than how good this sandwich was. Oh and the sweet plantains were so properly caramelized. Damn, I'm getting mad hungry right now thinking of this place.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/x2IcLedmCzDdQMmOI1b_UA/348s.jpg", "caption": "This that chicken magic sandwich"}]}}, {"review": {"des": "I was a little hesitant trying the jibaritos just because I've never heard of it. My friend was telling me about this restaurant and I can say, it did not disappoint!<br><br>Service was quick. Servers were friendly. And the best part-- the jibaritos :))))))) I had the steak one and it was really good. I thought I was going to have leftovers, but nope- that thing was gone.<br><br>Would def go here again and bring my friends!!", "pics": null}}, {"review": {"des": "The only thing is they're always running late !<br>But food is worth it so delicious better than most p r restaurants the chicken asada is so delicious on a Jibarito", "pics": null}}, {"review": {"des": "I love this place! This is first the restaurant where I have ever tried a jibarito. Their steak jibarito is a must have...I am officially addicted!", "pics": null}}, {"review": {"des": "The food is incredible: I recommend the jibarito! Friendly staff and cozy environment. BYOB and outdoor seating available.", "pics": null}}, {"review": {"des": "Let me just cut to the chase. I ordered the Papa's medio pollo chon (half chicken) with white rice and habichuelas, and tostones. I have been living off of dormitory meal plans for the past year and this was the most delicious and glorious meal I have had in a long time. The rotisserie chicken had such awesome flavor. Perfect balance of savory and acidity. It was also tender. The tostones were thinner than what I've had back home in Florida, BUT still deliciously crispy with this garlicy sauce drizzled on top like tears from the angels above. Overall, the first meal here was great. Looking forward to coming back.", "pics": null}}, {"review": {"des": "Stumbled upon this place. Great unique food. Not for the high brow! Authentic and delicious. BYOB and come Saturday the special", "pics": null}}, {"review": {"des": "I LOVE THIS PLACE!!!! The jibaritos are delicious, honestly what ever you order will be delicious. I travel from the South East side of Chicago all the way to Humboldt Park for this food. I crave it! I always add the cola champagne and never ever skip out on the Flan. Amazing!!! You can't go wrong at this restaurant. The staff are friendly and the owner is very funny and personable. It does get crowded, so go on a non busy time, i.e lunchtime etc as waits can be 20-30 min.", "pics": null}}, {"review": {"des": "Food tasted great / service was great even when she got busy and the entire outdoor seating got filled up.<br> We got the yuca for an appetizer, it came out nice and hot cooked soft and tasted delicious... Our entrees were the steak jibaritos with arroz con gandules and a side of habichuelas to share at the table (yummmm!!).<br> Everything was fresh and delicious.<br><br>Oh, and its BYOB / with a liquor store right across the street at the corner.<br>(Your welcome lol)", "pics": null}}, {"review": {"des": "The steak jibarito and arroz con gandules were on point! We came in during lunch, and were taken care of quickly. The steak was nicely seasoned, and the plantain was fried PERFECTLY, not too soggy and not too crisp. The only downside for me is that they don't serve alcapurrias or pastelillos.", "pics": null}}, {"review": {"des": "Best Puerto Rican food in Chicago. Right in Humboldt Park. You won't be disappointed!", "pics": null}}, {"review": {"des": "Yummmmm......saborrrrrrrrr *rolling \"R\" horribly*<br><br>After going through a stint of earing chicken nuggets and fries from Wendy's for about a month (and 10 pounds later. Preggo problems), I have finally shaken the desire for that crap and am back to desiring hot, home cooked food. While coming from the north side of the city, I was not looking forward to rattling through pots and pans to cook, while my begging dog claws at my ankles at 10 something at night. I sighed as I continued driving down Division Street. The options around in either direction didn't appeal to me at all - Burger King, McDonald's..... BARF!!!! As I passed under the big Puerto Rican flag, I immediately thought about how I stopped at about 3 PR food trucks through Humboldt Park a few days ago (don't judge me) and how good a jibarito would be. I then passed Papas. It was a sign from the plantain gods!!!!<br><br>I pulled a uturn and stopped. It's a very small place that you would totally miss if you weren't looking for it. There's plenty of street parking though. The inside is pretty small but that does nothing to take away from the PR feel of the place as you smell the aromas of the island and gaze at all of the celebrity pics on the wall. I ordered my chicken jibarito and rice and beans. The place was packed and normally is, but that doesn't take away from their service.<br><br>The taste - delicious! Plantains were perfectly cut for the sandwich. I hate when thick pieces are cut. It was fried to perfection and the garlic, olive oil, and seasoning blends were mouth watering. I wish I had more rice and beans as well. I devoured my food. They totally made a faithful patron out of me and my belly!<br><br>VIVA PUERTO RICO! :-)<br><br>#WhoNeedsLoveWhenYouHaveFood <br>#ChiTownFoodieChic", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/b-qL42PAvnLbEXS0hPtwKg/348s.jpg", "caption": "My jibarito!!!!!"}]}}, {"review": {"des": "Open on time! This is the 2nd time I come here and you guys open 30 minutes after the stated time! Then you see the workers inside and they can care less, nor do they answer the phone! Lucky that your food is good because the service sucks! I've been a customer for over 10 years but I think the service you provide will prevent me from returning. The only hard worker I see is the Colombian woman, the rest can care less.", "pics": null}}, {"review": {"des": "This is a small restaurant that tends to be busy.  It my first jibarrito, and it was really good so I came back a second time.  Food took a little while to come out.  I loved it, but for a food you eat with your hands, I don't understand why they pour the garlic sauce on top of the sandwich (where it gets all over your hands) rather than inside the sandwich.  Still, very good and I can't wait for another!", "pics": null}}, {"review": {"des": "Easily my favorite Puerto Rican style rotisserie chicken in the city. The jibaritos are solid and are only $6 w/ rice on Tuesdays, I prefer the chicken with extra garlic sauce but my sister swears by the steak. The only reason I cannot give this place 5 stars is the service which can be spotty at times; if you advertise that you open at 11am then I should not have to wait until 12pm to place an order so you can get the restaurant up and running. On several occasions I've called at 11 for carry out only to be told they're not ready and to call back later. By the time they're ready for my phone order it's already lunch rush and I end up having to wait 45 min to an hour for one sandwich.", "pics": null}}, {"review": {"des": "Best Puerto Rican food and Jibaritos ever, hands down! My friends and I went for my birthday and there was not one dish that touched our lips that was not incredibly delicious. Great service too!", "pics": null}}, {"review": {"des": "I really love the authenticity of the food! Best place to have Jibaritos! Yuca! Well, everything!!! So if you are in Chicago or just visiting, make sure to stop by!", "pics": null}}, {"review": {"des": "We're visiting from Austin, Texas, but we're Puertorican and this place was highly recommended. It lived up to the hype! The service was great and the food was too! The arroz con gandules super! Must go!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/SchKAJhHplwwxI9kPPNsLA/168s.jpg", "caption": "Vegetarian Jibarito"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/VojPRG55OQzlkFTzFgfbBQ/168s.jpg", "caption": "Steak Jibarito"}]}}, {"review": {"des": "The jabaritos are pretty good but the portion of rice is small compared to other restaurants that sell jabaritos with a side of arroz con gandules.", "pics": null}}, {"review": {"des": "It has been such a long time since we ate here and after reading the article  last week in the Chicago Tribune, we decided to go back. Besides the service that was really good, we were very disappointed in our food. The chicken was very dry, and the steak meat that was in the jibarito was also dry.  It was like we got leftover meat that had been sitting there.  I am Puerto Rican and I know what the steak meat should look like since I cook it often. I can tell you that the meat was left over from earlier.  We probably should have said something and we did not, because the waitress was so accommodating and nice. I just hope that this is read on their behalf that they consider not serving me that is dry or leftover.  I would not say that this place is reasonably price because a whole chicken dinner which includes rice only is $16.50.", "pics": null}}, {"review": {"des": "Best jibarito I have ever had. I like that they don't use the super creamy yellow American cheese and don't load the top with tons of garlic. It's a bit smaller than you get at other places but it taste way better. The yucca was really good as well.", "pics": null}}, {"review": {"des": "This is my favorite Puerto Rican restaurant in Chicago. As a kid, my dad always brought home papa cache's chicken. If you haven't had it, please don't think twice about it. It's amazingly delicious and you'll be back for more. My family and I have been loyal customers since their very first location and will always be as long as the food tastes as good as it does. Everything on the menu does not disappoint. The prices are reasonable and appropriate for what you're getting. Everything is freshly made, which is a huge deal in comparison to most Puerto Rican restaurants here in Chicago. The restaurant itself is small but very comfortable. You are attended to and well taken care of. The food does take a while to cook, which results in longer wait times but once you try the food you realize it was worth the wait.", "pics": null}}, {"review": {"des": "In Chicago, Mexican restaurants are ubiquitous and Puerto Rican restaurants are rare. This is a casual Puerto Rican restaurant well worth the trip to this West Chicago neighborhood near Humboldt Park. The signature dish is a \"Jibarito\", a sandwich in which crunchy toasted plantains are used instead of a bun. We were told that this sandwich was created by the owners in Chicago so technically it's not something imported from the Island. Whatever the origins, it is excellent and comes in several varieties including chicken, steak, and vegetarian. The menu contains many other traditional Puerto Rican specialties primarily involving chicken, pork and steak. They do a big takeout trade, but our group was seated and the service was very friendly with a nice, local neighborhood feel.", "pics": null}}, {"review": {"des": "Stopped by on a Saturday night with my boyfriend. It was about an hour before closing and I was surprised to see a good number of people packed into the small restaurant. I took this as a good sign.<br><br>Our server was pretty cold and not personable, but we were really there to enjoy puerto rican food so that's what this review is based off of.<br><br>To start, we tried the tostones. You get 12 for $3, which is awesome. They came out piping hot and were perfectly crisp, without being overly greasy. A great to start to the meal, and I highly recommend.<br><br>We decided to try two entrees and share. We ordered the bistec en salsa (salsa roja) and the 1/2 chicken dinner.<br><br>When our food arrived, everything looked great! With each entree you get a large helping of rice and a side salad. The portion was just fantastic. For $9 the amount of chicken you get it CRAZY. More than enough to feed two people.<br><br>The serving size for the bistec was on the smaller size, but the meat was cooked very well and I loved the sautéed peppers and onions served with it. In the future, we'd order the bistec without the salsa because we didn't care for its flavor.<br><br>The chicken was cooked just wonderfully. So juicy and fresh, with an excellent yet subtle blend of spices. The rice was also extremely tasty, and the salad so fresh and crisp!<br><br>My only complaint: the chicken could have been a bit hotter. I'm kind of picky about this, but it's the only reason I didn't give a five start review.<br><br>Overall, the food was absolutely excellent and we both really enjoyed our extremely reasonably priced huge meals!!! We will definitely be back. Just don't expect stellar service, come for the great food!", "pics": null}}, {"review": {"des": "Loved this place!! Went with some coworkers on a Friday for dinner to try their jibarito sandwich. It's a BYOB place so we picked up some coronas and limes on the way. We sat outside in the front where they have an enclosed patio-like area. The weather was warm so it was really nice to eat out there.<br><br>The staff was so friendly and helpful! The waitress noticed our limes and offered to cut them for us. She also brought them back in a nice little to go container. All of us got the jibarito and it was DELICIOUS!!!! I had the steak which was well seasoned and the crispy plantains were a good replacement for bread. Also had a side of Spanish rice which was pretty tasty too. <br><br>Overall, awesome food and service. (The waitress brought my friend a to go box without us even having to ask) More of a dive though so don't go if you're looking for something more fancy and upscale. And don't forget to BYOB :)", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/3JSU0ipX_DEaPlPLjd_vwA/348s.jpg", "caption": "Yummy jibaritos with Spanish rice"}]}}, {"review": {"des": "This probably is my favorite spot in the city of Chicago to get tacos, and other tasty foods associated with the Puerto Rican culture. Once you tryout the steak tacos here, your taste buds will be hooked. I'm not sure if it's  how they allow the meat to marinate as far as seasonings or if it's how tender the meat is always, but it's one of my favorites when in Humbodlt Park.", "pics": null}}, {"review": {"des": "Delicious food, very affordable for the excellent quality. Ordered apps and a few entrees to share for lunch on a Saturday. Left full and fully satisfied!", "pics": null}}, {"review": {"des": "Mmmm.... very flavorful place for a great price. However, we went on a Saturday afternoon- around lunchtime and it was a bit packed until totally packed a little after we had our orders taken.  It seemed a bit understaffed as well, so it took awhile for our drinks to come out - the food came out first instead and then the waitress apologized for not having received our drinks earlier. There were also quite a bit of people ordering takeout via phone and in person. But the food was delicious and worth it in the end. I had the Saturday special & my bf had the steak bistec dinner. The rice wasn't as soft as I'd like, but it was still good, but adding my bf's beans to it made it more tasty.  My bf asked for the mojo sauce and it kicked up our entrees even more. Would love to go again ,  but hopefully it will be less busy when we go.", "pics": null}}, {"review": {"des": "3.5...Usually am generous with local family-run spots, but I just couldn't bump this up to a 4. What we expected to be a quick casual spot for dinner ended up being closer to two hours late Friday evening. My group of three was in the area and saw this place nearby. It was pretty busy when we arrived and we seated ourselves inside. The place seemed to be well staffed. We were brought out some bread promptly and then waters arrived some time after. One of the ladies took our order at a reasonable time. Here's where things stopped being okay. We noticed our order taking a long time, but we still didn't even bother them about it until way later, when it was getting ridiculous. They ensured us the first time, that it was up next...but nope, it was like another twenty minutes. All in all, pretty sure we waited about an hour for our three jibaritos. In this time, I noticed a man seated well after us got his food in 15-20 minutes...They were all nice in there, but an apology or some sort of reason would have helped. Luckily, their jibaritos were some of the best I have ever had. Their arroz con gandules was disappointing. At first, I thought they were just fine, but now looking back, they actually were not good...very bland and basic. Their rice and red beans were much better, and would opt for that next time. I would like to come back and try more items, but hopefully will have a better experience next time. The wait time for our food was just excessive. So far, I still prefer La Cocina Boricua de la Familia Galarza and Casa Yari, but Papa's Cache Sabroso's jibaritos sure are memorable.", "pics": null}}, {"review": {"des": "When we want jibaritos at work this is where we go, and there are a lot of places in Humboldt Park for them but Papa's is the best. I usually get the steak with the arroz con gandules, but the chicken is awesome too. The Puerto Rican rice is really good, it has that texture you want and crave, and I've only had better from a woman at work who makes it homemade. There is nothing like the combination of the steak, grilled onions, garlicky may and the sweet and crispy plantains for bread. I can eat three of them in one sitting if had less self control, and probably would only feel bad for a few seconds. I just had one a few days ago, and I'm already craving one again. That's how good they are!", "pics": null}}, {"review": {"des": "This is probably my favorite puertorican restaurant . Wow the food is so flavorful and so delicious . And I love the owner he is very pleasant and funny man and so is his sister I forgot their name but they are pretty awesome . My husband and I live about 45 minutes away from this place . And it's worth the drive and the wait . The place is very small but full of love and good food. <br>So they are known for the rotisserie chicken called pollo chon. It's rotisserie chicken seasoned to taste like pork roast also known as lechón. It's delicious . Jibaritos are very good too . I love that garlicky taste on the fried green plantain that they use as bread . The portions are pretty big and prices are awesome. There's outside seating now that the weather is stilll nice . But the inside  will keep you warm in the winter since the place is very small . But enjoy the best rice con gandules also known as every Chicagoan refers to it as \"puertorican rice\". Arroz con gandules people . But it's ok when in chicago you do as the Chicagoans do .  Oh The service is great. And don't forget to bring a good cold beer , a modelo or corona will be a great choice with some good authentic puertorican food. Buen provecho mi gente !", "pics": null}}, {"review": {"des": "This place is like walking into a restaunt in Puerto Rico. The look, the aromas and the friendly owner and staff. I had some pollochon with yuca. It was amazing. Thank you for the prompt service and cordial attention.", "pics": null}}, {"review": {"des": "Went yesterday with the family - my wife, our 4 children, the Abuelos, and my sister and her husband, who frequent the place. Even with a party of ten, they had great, friendly, and prompt service. Food came out fairly quick - and the taste was amazing.<br>I ordered the bistec encebollado with maduros. Most everyone else got the rotisserie chicken. My steak was good. The rotisserie chicken was awesome. It took me back to my Abuelo's kitchen, eating pollo asado. The rice, tostones, and maduros were spot on as well.<br>Ambiance was the only aspect that made this 4 stars instead of 5. But all in all, I highly recommend this place - and do yourself a favor and just get the chicken.", "pics": null}}, {"review": {"des": "I love this restaurant!! People are so friendly and they take a lot of time to let you choose or try! <br>For sure I had a culinary orgasm! I never have been disappointed! Never ever! <br>I recommend this place to all people who wants to try something exotic or new!", "pics": null}}, {"review": {"des": "This place right here is the best ever even tho i cook the same foods on my lazy days ill be there for my usual, arroz con gandules and chuleta frita with my salad on the side.  Fat girl problem.", "pics": null}}, {"review": {"des": "They might just be the best Jibarito spot in the city.  I've been going here for almost a decade.  The service here is always friendly.  The food is always fresh and delicious.  Steak or Chicken Jibarito doesn't matter, you can't go wrong.  I usually get double meat.  The arroz con gandules and the arroz y habichuelas are equally delicious.  I prefer the rice and beans because their beans are so flavorful, but my wife prefers the arroz con gandules.  The tostones and maduro are also delicious.  The salads are basic but very tasty.  I have to point out that the food here is extremely consistent in my experience.  My favorite meal is the dos chuletas (two pork chops).  I get it with the rice and beans and a side of tostones.  Guaranteed to please, but they are known for their roast chicken.  The one thing I can say that is not super consistent is the juiciness of their chicken.  Most of the time their roasted chickens are succulent and mouth watering, but I will admit that every now and then I come here to get chickens and a few might be a little dry, but still very flavorful.  Keep up the good work.", "pics": null}}, {"review": {"des": "I had the biggest craving for pr food all week im so happy i saw this place very good", "pics": null}}, {"review": {"des": "Sweet staff and perfect tostones for the jibaritos. Chicken and beef were juicy and flavorful and both kinds of rice were delicately seasoned with garlic. I found myself eating the beans even though I don't really like beans - they were done just that well! Oh, and the maduros were perfect too, thin caramelization on the outside and sweet and luscious on the inside.", "pics": null}}, {"review": {"des": "Usually I will give them four stars but not today I ordered a Jibarito on the plantains and the plantains were so hard I couldn't bite threw them away plus the rice was burnt so much it taste like coffee. I called to ask if the rice was changed the wife said NO but she was sorry but I just didn't eat it. I order white chicken & it a dry as hell also. Never on a busy day like Saturday because my food was trash", "pics": null}}, {"review": {"des": "This is for a to-go order. <br>This place seems to cater more to frequent goers. The girl that answered the phone was not too friendly, and when I asked a couple questions about the menu - she seemed annoyed by the fact that I even had the gall to ask them. <br>Arriving to get my food was no different. People that were behind me in line were allowed to cut in front of me, who all seemed like they were acquainted with the owners/workers there. One person cutting is OK, but three did it in the time I was there. Not cool. <br><br>When I did get to tell her why I was there, my food was already there waiting for me to pick it up. I ordered the Camarones en Salsa, and the other ordered Jibarito con Arroz. The Camarones was really lackluster and had about 5 shrimp in it. The price tag? A whopping 14.50! The Jibarito con Arroz was a bit too greasy for the other's liking. They do their rice well though.<br><br>Another nice touch - they give you complimentary fried plaintains! A bit over-salted.<br><br>All in all - LOSE THE ATTITUDE because that's enough for me to never come back again. The food is good, but that type of money can get you something better in Chicago.", "pics": null}}, {"review": {"des": "I ordered the steak jibarrito sandwich with bread and American cheese. It wassuper yummy and i'll definitely go back when I visit Chicago again.", "pics": null}}, {"review": {"des": "I was eager to sit down and have a good lunch, so I ordered a chicken salad, it was very busy but if you have 45 minutes to wait and wait and wait and finally go to the counter and check, this is the place for you I finished by paying for a meal and walked right out not even with it on hand, they seemed to busy and made me feel like something was wrong with me for bothering them, sorry I can't deal with this. I know he's a good guy but it's sad to say I won't be back any day soon.", "pics": null}}, {"review": {"des": "Papa Caches is fun.<br>It's truly the definition of a \"ma and pa\" restaurant. You walk in and are greeted (kinda) by the owner at the register and his wife who runs the food. They're not too good at recommending food or really even explaining how it's made, but I promise you whatever you choose will be delicious.  <br><br>The ordering system is all messed up. Sometimes they take your money at the register, sometimes they tell you to sit down and you're forced to get back up in line after you're super full and have to stand for 10 minutes to pay your tab that you could have just paid the first time you were at the register.<br><br>The people who run the food out to you, like the owners son, really don't care at all about how you're doing or if you need anything - but like I said the food is just so good it literally doesn't matter.<br><br>If this place had anyone working it that knew how to deliver quality hospitality it would really take this place to the next level. I literally don't care though, because the chicken dinners are just so magical I'll put up with any type of service for it.  <br><br>If you're sitting too long at a table and the place is busy, they will definitely ask you to leave. They even have signs on the walls that say \"don't be rude and give up your table if you're done\". <br><br>LOL", "pics": null}}, {"review": {"des": "I've finally decided...hands down my favorite PR restaurant. From the rice to the tostones, I'm a raging fan. It's a nice location in the Humboldt Park hood and easy to find. You can smell the rotisserie chicken from their parking lot across the street. You better beware though, it smells that fantastic from the immense amount of garlic each is slathered with. If you're not careful, it can stay with you for the rest of the day. I always make a point of having a fizzy drink with my dinner; I'm convinced it helps. Most of the time it's my Caribbean favorites Kola Champagne or Coco Rico. They also offer ginger ale, root beer, Pepsi, and parcha (AKA passion fruit). <br>There are daily dinner specials but my favorite day at Papa's is Saturday. The one day a week lechon is awesome. It's easy to find this over salty, greasy, or dry in other places, but Papa knows pork. It's perfectly seasoned on its own, however Mama has a kick in the mouth green hot sauce that pairs wonderfully with the roast pig. The tostones are reliably good. Some other places don't change their oil enough or they half cook the plantain in advance. Papa seems to clean the fryer regularly and make the delicious twice fried platanos to order. Garlic makes a not so subtle appearance on these babies too! <br>Before I rave any more, I have to remind you that this is a mom and pop operation. They can easily run out of specials before they close. Sometimes that means you'll have a wait before you get your paws on the next batch of pollo chon. Sometimes that means you'll go without the lechon next Saturday. You can't rush the process. <br>Speaking of rush, I don't think I've been here when the place wasn't full. So be smart or be patient! It's easier getting a table during the summer since the outdoor enclosed patio doubles the seating. If you're logical you'll read that to mean you can sit down while you wait for real Puerto Rican grub. In all seasons, between diners and their busy delivery service, I highly recommend calling ahead for takeout service. I had leftovers for breakfast this morning and I already want some more.", "pics": null}}, {"review": {"des": "This place, and basically the entire neighborhood, was wonderful! I had a jibarito for the first time - a Puerto Rican sandwich that is pretty  specific to the community in Chicago. Basically, instead of bread, the sandwich is on two large slices of fried plantain! <br><br>It was absolutely delicious. Our server was super sweet, fast, and helpful explaining a couple of menu items that my friends and I did not know! I wish I remembered her name. <br><br>The owner was great as well! At least, I'm going to assume he was the owner. He was super friendly and welcoming and cracked a few jokes with us. It's a pretty small restaurant, but on a Friday evening it wasn't very busy. It's definitely a small \"hole in the wall\" family type restaurant. <br><br>The only small issue was that we couldn't split our check, but it was stated on the menu and my friends and I worked it out ourselves. I appreciate that if you're going to have that policy, it's clearly stated! So that was nice.<br><br>Over all, a great place. The food and the service and the atmosphere felt very true to Humboldt Park, and that is worth it's weight in gold in this gentrified city!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/dvlRVkXHqHJ5-LNw_nTKGg/348s.jpg", "caption": "My chicken Jibarito with everything on it, and yellow rice."}]}}, {"review": {"des": "If you appreciate courteous service, this is NOT the place for you. The waitress that I had was rude and forgot to put my order in or something because after 20 minutes of sitting there with a one year old child who would need a nap soon, I still didn't have my food. When I got up to see what the hold up was, I saw my food sitting up there with the ticket on the plate leaning on the sandwich (which was alarming because it had the waitress who wrote the ticket's germs on it as she didn't have gloves on when taking my order, not to mention the ink on the paper). Granted, this was after waiting 20 minutes for my food, when people who came in after me already had their food. <br>When I told the waitress that I didn't have my food, she said she was about to serve it (right, my sandwich was sitting there the whole five minutes I stood at the counter waiting for someone's attention) and didn't even apologize. I told her to make it to go as the baby needed a nap so she proceeds to dump it along with the rice and beans I ordered into a styrofoam container and hands it to me in a bag with the beans leaking out of the styrofoam. I had to walk a mile and told her that I needed the beans in a sealed container and she looked at me like she had no idea what to do. <br>Overall, not a good experience. They treated the \"white people\" who arrived after I did in a prompt and courteous manner, almost tripping over themselves to serve them and I couldn't even get a sandwich. <br>I often recommend places to friends and family and have recommended this place but no more. Never going to this place again.", "pics": null}}, {"review": {"des": "Amazing! Best Spanish food I've had. Their jibarito is to die for! Their waiter is super nice and comforting!", "pics": null}}, {"review": {"des": "Simple, delicious food. BYOB and homey. Nothing fancy, but everything you want in a jibarito.", "pics": null}}, {"review": {"des": "I love their jibaritos! Best Hands down in Chicago and I have been to many puerto rican restaurants in Chicago. They are  always fresh and not overcooked. Prices are reasonable. I just wish their place was bigger because its very popular and can get crowded fast. But otherwise, I highly recommend eating here if your looking to eat a real jibarito!", "pics": null}}, {"review": {"des": "Omg I love their chicken jibaritos ... their the best in Chicago hands down. Keep up the good work", "pics": null}}, {"review": {"des": "One of my favorite local places. The chicken is soooooo good! I highly recommend this place for a fun meal!", "pics": null}}, {"review": {"des": "Chicken & Beans & Rice & Plantains...all so tasty & a great price point.", "pics": null}}, {"review": {"des": "Best tostones! Steak in red sauce is amazing as well as the chicken! Friendly service, those tostones  best thing ever!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Ou5iur9U0zjz4DGWL6vSwQ/348s.jpg", "caption": "Bistec En Salsa Dinner, Tostones and Chicken Breast Dinner"}]}}, {"review": {"des": "I've lived in Humboldt Park for over a year now and I love Papa's!! Best PR food in the hood. The chicken is so deliciously garlicky.  I always get either a chicken jibarito (if I'm feeling naughty), the dark piece meal w/ yucca and gandules, or the papa's chicken salad.  All are very delicious.  It is a BYOB spot and a great place to eat outside in their little patio when it's nice out.  The inside is pretty small and can get packed.  I usually see Papa in there when I go and he always greets me with a smile and a hello. Great family-owned neighborhood joint with reasonable prices.", "pics": null}}, {"review": {"des": "Food was great, waitress was so nice! Will be back soon <br><br>My friends and I ordered steak jibaritos and they tasted homemade just like I like them. The arroz blanco and habichuelas tasted delish too. Everything pretty much tastes homemade. <br><br>They serve soft bread and butter while you are waiting. <br><br>It's a pretty laid back type of place. <br><br>Ask for some hot sauce if you like stuff spicy. It's so good.", "pics": null}}, {"review": {"des": "This place is an authentic chicarican place! The steak jibarito was so delicious! And the hot sauce they made in house was the best ! I even bought a bottle that they made for me ! The service was awesome and made you feel at home! Will definitely be coming back soon!", "pics": null}}, {"review": {"des": "I would just like to start this review with: Everyone should try a jibarito.<br><br>On a recent trip to Chicago my wife and I were looking for a place to have lunch. We like to try types of food we haven't had before and whenever we end up in a bigger city than where we live I immediately search for something new. Reading about Chicago, I noticed they have a large Puerto Rican community. I was immediately interested and began looking for places and foods to eat. I noticed that there was a sandwich available called a jibarito that used fried plantains instead of bread. I decided I had to try this sandwich and set out on picking a restaurant. <br><br>I picked Papa's Cache Sabroso and am so glad that I did. It's a little place that appears a bit run down on the inside and it was full so we had to wait a bit to be seated. When we sat down, I looked over the menu to find the jibarito. It is available with steak, chicken, or vegetarian option. I chose the steak jibarito and my wife chose the 2-piece dark rotisserie chicken.  They both came with rice and beans. The jibarito was so good. The simplicity of just steak, lettuce, tomato, cheese, and some sauce sandwiched between two starchy plantains was perfect. It made me want to eat every sandwich with plantains instead of bread. My wife's chicken was also perfectly roasted. I tried a piece of it and loved the perfectly spiced flavor and she was very happy with it.<br><br>We will definitely be eating here again on future trips to Chicago.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/qRBvhsKNqC7k-aGGxOsJeg/348s.jpg", "caption": "Steak Jibarito con Arroz blanco con Habichuelas"}]}}, {"review": {"des": "I am a repeated customer i called had a class party the food was fresh amazing and delicious done within an hour great prices best reasturant on division", "pics": null}}, {"review": {"des": "Outstanding Puertorican fried pork chops, finger licking good, jibaritos sandwich a must try and the grilled chicken breast dinner delicious too.... A BYOB ...(liquor store across the street if needed)... Service was great. Busy with orders to go... A must try!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/A8Utjv6CPRzJIxE8xZ8XRQ/348s.jpg", "caption": "You be the judge"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/K6D5xetIUg60OjB4XNAmIA/168s.jpg", "caption": "A must try .. Fried pork chops"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/-uvLn2b8VUkbAl4ZNOvDrQ/168s.jpg", "caption": "Grilled chicken breast dinner w/ fried plantains and veggies"}]}}, {"review": {"des": "Great food but poor service.<br><br>I've never really had Puerto Rican food before. I didn't know what to expect, but I was very impressed by what I got.  My friends brought me here for my first experience and I'm happy they did.<br><br>They ordered for me, which all good friends do when them know how to hook you. They ordered me the steak Jibarito which was just amazing.  It's a steak sandwich where they sub the bread for fried platens. So, I don't know that's it's any healthier, but honestly I didn't mind it.<br><br>What I will tell you is that the restaurant is small and if the sidewalk seats aren't open, it maybe seats 30 people at most. Also, I'm almost certain that it's cash only, but many of these smaller Hispanic places are, so no surprise there.<br><br>My one complaint was the slow to nonexistent service. I get that this isn't a McDonalds, but we had to ask for water, there were no refills, and she never came back after our food was delivered. I can appreciate that this is a small family run establishment, but even if the food is good, poor service will keep me away.<br><br>I'd love to give this place another chance, but as its been 30 minutes since we've last seen our waitress, there is a good possibility that if you stop by, you'll see me here.", "pics": null}}, {"review": {"des": "This is a great little spot that you can smell a block away.<br>Our family comes here whenever we're in the neighborhood, and we always get the tostones (garlicky fried plantains) as our appetizer, and steak jibaritos all around. <br>A jibarito is a unique sandwich with plantains instead of bread that was invented by Chicago's Puerto Rican community (can verify--my parents visited Puerto Rico and asked for jibaritos at every restaurant and found them nowhere).<br>I used to hate plantains but this place converted me.<br>On top of amazing food for a great price, the staff are always very friendly and the owner often comes over to our table to talk Cubs baseball.", "pics": null}}, {"review": {"des": "Wonderful jibarrito. The meat was cooked to perfection and had great flavor. Just the right amount of toppings and the plantain was crunchy and the right thickness. The arroz con gandules or 'Spanish rice' as the woman called it... Lol. Was flavorful and fluffy. <br>They don't have pasteles (Puerto Rican tamale), rellenos de papa (meat stuffed potato), or morcilla (blood sausage) that I could see. But they had plenty of other dishes there that made your mouth water. They even have chicken on rotisserie in the back. The smells of the shop were fantastic! I will come back.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/2Z-Z7mDbwd2k1FtWNUIlUg/348s.jpg", "caption": "Delicious almost didn't take a pic! Lol"}]}}, {"review": {"des": "The good:<br><br>1. Really friendly owner (or manager) that greets everyone. <br>2. The Jibarito steak sandwich I had (see picture). First time I've ever had a sandwich served between plantains. <br>3. BYOB. I know this is ubiquituous in Chicago, but it isn't in DC. Definitely appreciate being able to bring in a bottle of wine, and having the restaurant provide a wine opener and wine glasses for free. <br><br>I really have no complaints. Good food, friendly service, reasonable prices.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/c22G5rwv4KfdyD8uM7Gz2w/348s.jpg", "caption": "A great sandwich."}]}}, {"review": {"des": "I have to start by saying the food here is delicious, usually. I would give them 4 stars but the service and attitude of the people who run this place is absolutely atrocious. The chicken was dried out and the gandules were flavorless this time. But that's not the worst part. Simple version, they lie to customers and overcharge you for super late food then blame their employees and hang up on you when you complain.<br><br>I have ordered before through grubhub and everything was fine, the food was great. I really wanted to order from here again and grubhub kept telling me they weren't delivering to my area. So I called the restaurant and they told me they would check into that because it should deliver to my area but they could take my order over the phone. I asked how much delivery would be and the person on the phone ignored me and kept asking what I wanted while people in the background were yelling. I placed my order and before I could ask for the total or time they hung up on me.<br><br>An hour and a half later I call the restaurant and ask where my food is. They basically blame the delivery driver and make some excuse about the orders being really far apart and say my food would be there in ten minutes. Here's where the BS starts. I placed my order at 7:42, the receipt said 8:27, I called the second time at 8:57, and didn't get my food until 9:15. I called to complain when I saw a scathing $10 delivery fee. That's 45 minutes to make my food, then 50 minutes to deliver when I only live a 15 minute drive away. Unacceptable.<br><br>So I called the restaurant to complain. First they told me delivery should be $7, to which I had argued that their delivery fee is clearly $3 on every service they use. First they claimed that was grubhub's fee and not theirs, they don't set the delivery fee. Then they blamed the delivery driver for charging too much. Then they hung up on me. I called back and someone else answered the phone. I was told they would talk to the manager and call me back and she hung up on me, no one called.<br><br>I absolutely can't believe someone would run a restaurant like this and treat customers like this. It's my fault for signing the receipt without checking the price (last time I trust a restaurant in Chicago) but when I asked for the fee and the total they should have told me ahead of time instead of hanging up on me. My order should not have taken 90 minutes to make and deliver.", "pics": null}}, {"review": {"des": "Could not decide between the jibarito and the chicken so that gives me good reason to return!   Went with the chicken which was very tender and tasty.   The tostones were perfectly crisp and garlicky.   The yuca was amazing!!!  <br>The service was great.", "pics": null}}, {"review": {"des": "I really love the chicken and yellow rice with beans.  I normally order Papa's Pollo Chon 2pc Oscuro. I once tried to eat the 1/2 chicken which was too much food.  It's a small very casual restaurant with covered patio seating and good service.", "pics": null}}]}