{"name": "pasta-palazzo-chicago", "reviews": [{"review": {"des": "This place is amazing. Nestled right in the heart of Lincoln Park, it's a cute and quaint restaurant that is perfect for a nice, but not too expensive, dinner. <br><br>I attended here with a friend and we ordered two pasta entrees, shared a salad and each had a glass of wine for under $20s. The menu is fairly extensive and offers a variety of pasta options. The staff was super friendly and attentive. <br><br>I'll definitely be back soon.", "pics": null}}, {"review": {"des": "We came here for the first time on a Thursday evening. It was a little busy for a table so we decided to post up at the bar spot by the register. It was fun watching the cooks make all the food in front of you. It may not be the freshest ingredients but you know it's coming hot and fresh from the pan all at a very reasonable price. Food was great!!<br><br>Why the 2 star review? Well being first timers we apparently weren't familiar with how the restaurant operates. There is no bar service, only spots at the bar. The waiters apparently wait on every seat. But we didn't know that at the time. After waiting for 10 minutes to be greeted or acknowledged, we decided to ask the lady behind the bar if we could order from her, as she was just standing right in front of us, not busy, occasionally ringing up take-out orders or opening beers from the fridge. She literally rolls her eyes at us and reluctantly says that she would \"have to grab us a ticket to take our order\".  Okay, maybe she's just grumpy. No sweat. But when we asked her if we could have our bill, she literally scoffs and rolls her eyes at us AGAIN. WTF!? What's up with this lady? Then it dawned on me that the only possible reason she was so rude and reluctant to serve us was because she wasn't our server. Apparently that entitled her to treat us like a nuisance. She literally could have just told us that our waiter would be with us whenever, or asked the waiter to greet us, or helped us understand the process, or say hello, or any pleasant interaction at all, but apparently it was easier to be rude and dismissive. I absolutely understand why she's not a server. Pathetic customer service from an otherwise quality establishment. I guess next time we'll be better customers lol.", "pics": null}}, {"review": {"des": "We came here for a quick meal during the weekday. We were seated right away and the server brought us menus and waters shortly after.<br><br>I ordered the jalapeno gnocchi and my husband for the penne bolognese. Both items were okay. The jalapeno gnocchi itself was very unique and tasty but I don't think the red pepper sauce went well with it. I really like spicy food but the sauce had no depth of flavor. It was very basic. The penne bolognese was also basic. It wasn't bad but it wasn't life changing either.<br><br>Overall its a decent Italian place. Service was good, prices are fair and food was okay. The jalapeno gnocchi did boost up my rating from a 2 to a 3.", "pics": null}}, {"review": {"des": "As has been echoed in other posts, the management is incredibly rude. My friend arrived first in our party of three and the female host was dismissive when she asked for a table, walking away & ignoring her when she mentioned her full party had not arrived (understandable if the policy is to seat customers once the entire party arrives, however she could have conveyed this in a courteous manner).<br><br>A table finally opened, to our delight.. yet the experience continued to deteriorate. It was a bizarre situation.. the male host came over to our table and yelled at us because a nice couple offered, on their own volition, to switch tables with us since theirs was bigger and we were a larger group. We were taken aback by his condescending approach over something so trivial. He continued to rant, lecturing us on \"how the restaurant industry works... (??)<br><br>After yelling at us (which was embarrassing given the restaurant is so small and was crowded), he went on to confront the couple who had switched tables with us (who had not even ordered yet, I might add). He made us feel incredibly awkward and unwelcome. It was unnecessary and borderline comical. In general, I believe it is inappropriate to enter a situation aggressively- especially if you work in hospitality. We were paying guests excited to enjoy a meal!<br><br>Needless to say, we left and will not return. Bummer since we live so close! Worth noting that when we left, the female host followed us outside and said either \"someone's pissed!\" or \"someone's a b!$*h\" (it was hard to decipher). Cherry on top of a memorable night of horrible service! Perhaps they were projecting their life/work frustrations on our group?<br><br>Anyway, we ended up going to Vinci instead- a three minute walk up the street. Food is incredible and service is outstanding, I highly recommend skipping Pasta Palazzo and in favor of Vinci.", "pics": null}}, {"review": {"des": "Pasta heaven. I had an impromptu dinner tonight and was pleasantly surprised. I ordered spaghetti frutti de mare and it knocked my socks off. We added chicken to the jalapeño gnocchi and it was delicious. I must admit, I didn't prefer it over the spaghetti dish, though. The side of spinach was good as well. My only qualm was with the bruschetta. It had more vinegar/vinaigrette flavor than I would've liked. A bit overwhelming to me. But, my date loved it. There was enough street parking. The dining area is small and adjacent to an open cooking area so, it can get a bit loud. Just use your outside voice, if needed:)", "pics": null}}, {"review": {"des": "While shopping, we got hungry and randomly popped into Pasta Palazzo  on a complete whim. We figured we couldn't go wrong if the word \"pasta\" was in the restaurant name... and we were correct!<br><br>We were super pleased with everything! It was about 2pm on a rainy and cold Saturday afternoon, so the place was fairly empty. We ordered a bottle of wine, garlic bread, raviolis and gnocchis from the handmade pasta section.<br><br>Wine was great. (I mean, what wine isn't great?) The garlic bread was a miss. It barely tasted garlicky and it took a while for it to come out considering it was pretty empty. I would definitely skip that appetizer.<br><br>But let's get down to the good stuff. The vodka sauce raviolis were definitely really good but the alfredo cheese gnocchis stole the entire damn show! Holy bananas, they were literally pillows in your mouth and just the most decadent things I've ever tasted. We shared both entrees and it was the perfect pasta tango in our mouths. <br><br>Hint: don't expect to go home with leftovers. <br>(insert sad face)", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/9076G4JFq7rQFPHyW8meqA/348s.jpg", "caption": "Bottle of Malbec."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/jaBtGMuwIYNmq-i609LHWg/168s.jpg", "caption": "Top: Spinach/Cheese Ravioli with vodka tomato cream sauce. Bottom: Ricotta filled gnocchi with alfredo cheese sauce."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/WPr_UkNuHPAlLWa6NgakWQ/168s.jpg", "caption": "Garlic bread with tomato dipping sauce."}]}}, {"review": {"des": "This is legit one of my favorite restaurants in Pittsburgh.  I've moved away from Chicago since then but I always come back here when I visit.  Their prices and quality can't be beat in my opinion.  The jalapeno gnocchi is one of the best dishes I've had anywhere.<br><br>Jalapeno Gnocchi: 10/10", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/svZZ3sc0fKpWoi9wLyQ-Pg/348s.jpg", "caption": "Jalapeno Gnocchi with Red Pepper Sauce, a must have"}]}}, {"review": {"des": "I like this place. Most of of the time it's 4 star but tonight's visit was more of a 3 (which is atypical and a first for me). It's a casual, neighborhood staple and I've been numerous times.<br><br>Pros: <br>-Reasonably priced, good food<br>-Decent portion sizes <br>-Seasonal/daily food specials<br><br>Cons:<br>-Loud<br>-Cramped (+hot if you're at the bar)<br>-Limited seating (you might have to wait)<br><br>I really like the capellini pomodoro, the conchiglie gorgonzola, and the baked goat cheese app. I also usually partake in the delish specials to keep things interesting. Most entrees are between $8-$12. They have good Sangria for $6 and inexpensive beer and wine options. Service is sufficient.<br><br>If you happen to be in the neighborhood you should give it a try. I actually like Pasta Palazzo more than the other \"shiny\" dining options available at the Halsted & Armitage intersection. Be careful not to over look it!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Zay1f_4Uj4E130AytWJbNQ/348s.jpg", "caption": "Capellini Pomodoro"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/3Wn-xFUeAhnxkn1X1aZN6Q/168s.jpg", "caption": "Sangria $6"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/py3B3MtTV3yn9Mmchey1Lw/168s.jpg", "caption": "Farfalle Pomodoro Formaggio"}]}}, {"review": {"des": "First of all, the service was nonexistent. What was really going on in there? We ask for service and the woman that worked there was extremely rude and gave both my friend and I attitude. It is extremely disorganized. I would expect better. Yikes.", "pics": null}}, {"review": {"des": "Finally stopped by for dinner on a Sunday evening. The place was pretty busy, especially with takeout orders. We were seated promptly. I enjoyed the casual nice atmosphere with the open kitchen. It was great to start with complimentary bread to eat along with the fixings on the table (parm, evoo, chili flakes). We ordered the baked goat cheese, broccoli potato soup, tomato dill soup, pesto linquine, and the special of pumpkin ravioli in sage brown butter sauce.<br><br>Service was pretty good. Our food took just a tad long to come out, but no big deal, as we were regularly checked on and given updates and the staff was friendly. I enjoyed the app and the soups. However, I found the pesto linquine to be super bland. Considering I tend to be salt-sensitive, I felt like this dish had zero salt. Even sprinkling some parm from the table couldn't save it. This was not the pesto I am used to. The dish looked much better than it tasted. A positive though is that the cook on the actual pasta was perfect, as was with the ravioli. I enjoyed the pumpkin ravioli much better, so maybe there are just hits and misses here. I liked their menu, but do wish for a bit more variety, especially as many of the options are somewhat similar.<br><br>Pasta Palazzo wasn't fully satisfying in the authentic sense and wasn't exactly satisfying in the chain (Noodles & Co) type of food sense either...it is somewhere in between but it just fell flat for me. While I wasn't super impressed with their food, Pasta Palazzo is still a solid option that at least won't break the bank, as with other mediocre but overpriced places in the area. I definitely want to give it another shot and try other pastas there.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/I-Taj-hzHPoMbYw3xWr8wA/168s.jpg", "caption": "Linguine pesto"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/fyjrCCE1ICX-Uc0FZN8tEA/168s.jpg", "caption": "Pumpkin in brown butter sage"}]}}, {"review": {"des": "I'm not much of a pasta person, for the most part, I can't really tell what's freshly made vs. out of the box. Which makes me feel like I could make most past dishes myself.. which makes me feel like I'm being overcharged for some dishes..<br><br>But the boyfriend suggested to go here and since he had a bad day, I was willing to try this place and I'm glad I did!<br><br>We got the:<br>Cheesy bread $3 <br>Classico $10<br>Pesto Gnocci $11<br><br>I gotta say, I was really impressed with how fresh and good it tasted - like I definitely couldn't have made those dishes and if I did, it wouldn't have tasted that good .<br><br>The sausage in the classico was bomb. I definitely recommend anything with sausage in it! The gnocci was filled with ricotta which was a treat. I'd come back and the boyfriend said he definitely wants to come back.", "pics": null}}, {"review": {"des": "Tried one of their house made pastas today, (not all are fresh, but all good) I had the ravioli with pomodoro sauce, it reminded me of of something I would make. The pasta was the perfect density and the sauce was fresh with ample chunks of tomato and basil. Make sure you have some extra bread to sop up all the left over sauce on your plate. <br><br>I've never had a bad meal here, not a huge menu, however they cover all the bases for pasta, it's their namesake after all. I've dined out on my share of what would seem to be a simple meal that goes wrong, here it's been consistently very good. A salad, pasta, bread and a glass of wine, done well it's very satisfying. <br><br>Keeps me coming back.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/_ZE79AsGyJUdoihz4b8Tog/348s.jpg", "caption": "Ravioli pomadoro"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/sZXmDylTnapZ6lk-k3o5KA/168s.jpg", "caption": "Pesto cream linguine. Sometimes a girl craves carbs."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/rOZtDQiM9leX3ualjBcbGA/168s.jpg", "caption": "Pretty big for a small salad"}]}}, {"review": {"des": "I forget how much I hate community seating until I end up at a community table and having to ask people to interrupt their dinner so I can scoot behind them to sit down for mine. <br><br>But otherwise, I'm in love with this place! I love the customization aspect of the homemade pasta, choosing a pasta, a sauce and being able to add things. I got the gnocchi with pesto and chicken. I wouldn't order the chicken again, the gnocchi and sauce were fantastic! My friend and I also shared a caprese salad and bruschetta which I would definitely order again!<br><br>The service was friendly and quick, I'll definitely return on a less-busy night though!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/5VDkd7nQo4ITHBnrJBb1OQ/168s.jpg", "caption": "Caprese salad"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Qi-fZsooSD9mApgJyiJ89A/168s.jpg", "caption": "Housemate gnocchi with pesto sauce and chicken"}]}}, {"review": {"des": "Last night was my second trip to Pasta Palazzo and it was even better than I imagined. I lived in Chicago last summer and tried it one evening right before closing. The staff was already cleaning up but sat us immediately. Our server told us to take our time and we never felt rushed to make a decision or eat quickly. Our second trip was no different. I spent all weekend moving into my new apartment and didn't realize that the restaurant was closing early. When we showed up, we were seated right away. Our server was incredibly sweet and very attentive to filling our drinks and answering our questions. The food was just as incredible! Perfect portions, made hot and ready right in front of us, and a very decent price for the area. Cannot wait for my next visit.", "pics": null}}, {"review": {"des": "The most ridiculously awesome gnocchi I've ever had. It was like eating jalapeño popper pasta! Eat bite was a hint of jalapeño and wonderful ricotta. If you like pasta with a kick, try this dish!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/2xjyPjyxF_M7R6QEw3Do1A/348s.jpg", "caption": "Jalapeño Gnocchi // jalapeno and ricotta stuffed dumplings with roasted red pepper sauce and Italian sausage."}]}}, {"review": {"des": "Came here for a late dinner on Friday night and instantly knew I would like it because I was overwhelmed by the smell of garlic right when I walked in. Our timing was perfect since a table of 4 just wrapped up. I ordered the jalapeno gnocchi and it was some of the best gnocchi I've ever had. Gnocchi is by far my favorite pasta, so I tend to order it when I'm out for Italian. The gnocchi had a wonderfully airy and pillowy texture, while having enough bite on the outside. The sauce was creamy and just a tad spicy, especially since I added sausage. My only gripe is that my dish had far less pasta than my friends who ordered penne bolognese and macaroni and cheese. I was still hungry, but got to help my friend finish the penne bolognese.", "pics": null}}, {"review": {"des": "This place is always busy during dinner time, so I took my date to this place at opening for lunch and had no issue getting a table... in fact we had freedom to choose where we wanted to sit.<br><br>This place is very cozy even though it's small inside and you definitely get a hipster or contemporary feel rather than \"authentic italian\".<br><br>I really liked how you could see your dish being prepared since the stove for preparing dishes was behind the counter.<br><br>The bread here was nothing special, but I really enjoyed the grilled calamari because of the simplicity in preparation and the fact it was properly cooked.  It was not rubbery whatsoever and the char marks added great complexity of flavor.<br><br>My main dish was the jalapeno gnocchi with sausage.  The spice wasn't overwhelming and I'd say it was more of a small kick, which was great because the heat didn't take away from the flavors.  The gnocchi is homemade too, which made it taste even better.  The texture and taste from the dish overall was extremely good and I can see why so many people recommend this dish.  I highly recommend getting the sausage because the added fat and flavor of the meat really tie things together.<br><br>I'll obviously come here again... whether casually or for another date!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/cdtJiPeYMfgh7Nz8_w6RuA/348s.jpg", "caption": "Menu as of 4/1/2017"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/dqrmVM-ctREehL0aLQX8qg/168s.jpg", "caption": "Menu as of 4/1/2017"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/W0BfMH7mGHuZZPCZMwLfrQ/168s.jpg", "caption": "Drink menu as of 4/1/2017"}]}}, {"review": {"des": "I can not say enough great things about this place. It is so cute, the people are SO friendly, and girl the food.... is outstanding. And SO CHEAP!! I come here all the time, I love that it's just a nice little family local place with outstanding food and the service is quick I've literally never had a problem and have been going here for years. Amazing.", "pics": null}}, {"review": {"des": "Hands down my favorite pasta place in the city. The restaurant itself is cozy but the service is great and food is always amazing.<br><br>You honestly can't go wrong with anything on the menu - Cavatappi Pollo & Gnocchi are two of my faves.", "pics": null}}, {"review": {"des": "I came here on a Saturday and admittedly, it wasn't exactly what I was expecting. It's definitely the most informal Italian restaurant I've ever been to -- no tablecloths, water in plastic glasses, a wall mural that was more of a funky Piet Mondrian than anything echoing da Vinci.<br><br>But the food was good -- and very affordable. Garlic bread was reliable, and my risotto with seafood entree was huge and very filling.<br><br>Keeping with the hipster/contemporary vibe more than an Italian restaurant, the service was nothing to write home about, restrooms were poorly stocked, and food took quite a while to come out. Unlike other hipster/contemporary restaurants, this place draws the line on keeping it classy, so have no fear of getting stabbed by a stray nail in a secondhand chair, or getting your check handed to you in a 1997 Beanie Babies Collector Guide.<br><br>Value and quality at Pasta Palazzo are top notch. Just keep your expectations realistic on the atmosphere when you walk in the door.", "pics": null}}, {"review": {"des": "This place looks cute on the outside, and from the description it seemed like a local version of Noodles & Company. The bummer? I think Noodles has better pasta. <br><br>The inside is cute and cozy. Portion sizes looked fair and prices were really reasonable. AND they have gluten free pasta! I was really excited! Until I tried the Alfredo pasta I'd ordered... The dish that arrived in front of me was most definitely not Alfredo as I know it. The sauce was tan, not white, and it was full of black pepper and spice. It wasn't creamy, it wasn't cheesy, and it was way overpowering. There was so much bite to the sauce that it was impossible to eat more than a few pieces of pasta.<br><br>I don't know if someone just accidentally knocked the entire salt and pepper container into the sauce that day or what. I'm seriously really easy to please -- especially when it comes to pasta! But Pasta Palazzo was a disappointment. Lincoln Park has a ton of Italian options, so I won't be rushing back.", "pics": null}}, {"review": {"des": "Carb lovers paradise. I don't think I've ever had a harder time deciding what pasta I wanted. Penne, linguine, spaghetti, farfalle, capellini. You name it, they've got it. Plenty to make vegetarians and meat lovers happy. <br><br>It's a tiny space so it can get a little crowded and there may be a wait depending on the night. But suck it up, be patient, and wreck your body with some delicious pasta!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Ob-T8bBLcpB9yLPMkxf-JQ/348s.jpg", "caption": "Linguine pesto"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/QYbNBhqvQ_Vqc1kkpsFdbw/168s.jpg", "caption": "Penne Bolognese"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/n4gpApizKNDNZhkpDi2H9A/168s.jpg", "caption": "Mac n cheese"}]}}, {"review": {"des": "My mom and I had originally been planning to go to another restaurant around the corner, but that place didn't have seating so we decided to search for another place. Pasta Palazzo was close by and we saw its' positive ratings on Yelp so we decided it was perfect! <br><br>My mom and I ordered the goat cheese appetizer, small salads (caesar for me, mixed greens for my mom) and we split the penne con salsiccie. I don't really like goat cheese, but I loved the appetizer. It was kind of like bread with marinera sauce and some cheese. I really enjoyed it. The salads were good but not out of this world. I mean, it takes a lot for some lettuce to be crazy unique. The pasta dish was very good! We finished every last bit of it. The sausage had an amazing flavor and the mushroom in the dish made for a bit of a twist in the dish.<br><br>My mom and I really enjoyed our experience and said we would probably be back!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/s7BXP1pq6D16oZVkqlQRLA/348s.jpg", "caption": "the Penne con Salsiccie- yummmm"}]}}, {"review": {"des": "Very affordable and delicious pasta restaurant. The Farfalle Alfredo was consistently good when dining in and carrying out. The space is very cute, but be aware that seating is rather limited. Can't wait to try some of their other food options and explore their drink menu further!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Esy7VOZHk-uMIUgKV6CjmA/348s.jpg", "caption": "Farfalle Alfredo"}]}}, {"review": {"des": "What an amazing restaurant.  I love the ambiance and the feel to it as it feels very intimate and authentic.  The food is absolutely delicious doesn't matter what you order.  I love the baked goat cheese appetizer and the gnocchi.  The prices are affordable and worth every penny considering how delicious and authentic the food tastes.  If you love Italian food, this is a must go to restaurant in Chicago.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/bINxYA3cTsdFqmGDLqWvtA/168s.jpg", "caption": "Gnocchi in Gorgonzola sauce"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/1S20lmgBmnkc2WdTYCeqOQ/168s.jpg", "caption": "Baked goat cheese with garlic bread"}]}}, {"review": {"des": "Dropped in with a friend for dinner. I was pleasantly surprised. The atmosphere is nothing special and is on the casual side but the food is so good! It's the perfect portions to eat just enough and not walk away feeling stuffed. Also, so affordable! It's definitely a great family spot.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/BRA1xDyNaVw41QYIve7Taw/348s.jpg", "caption": "Bruschetta. Jalapeño gnocchi and pesto linguine. All were delicious."}]}}, {"review": {"des": "My life forever changed when I tried made in house gnocchi... <br><br>Their jalepano gnocchi was extremely delicate and melted in my mouth like I was eating a soft pillowy cloud. And I know you are wondering... was it spicy? No! It wasn't overwhelming heat wise, but just enough to detect the jalepeno flavor. I had these potato-pasta babies with a delicious marinara sauce and perfectly cooked calamari. Highly recommend!<br><br>I also had a sangria and split a goat cheese appetizer with some nice bread. Those two were very good as well but, wow, the gnocchi FTW!", "pics": null}}, {"review": {"des": "Came here last night with a group of girlfriends for dinner. We waited about 20 minutes for a table to open up. When we sat down we were greeted by the waiter and were asked if we want something to drink. We all got a glass of wine, I had the house red and it was a great combo of sweet and dry.<br><br>I needed a few minute to decide what I wanted so in the mean time they brought out bread for the table (YUM). Three of the girls ordered the Jalapeno gnocchi (clearly a house fave), another girl ordered the house healthy special, and I still needed assistance and was recommended to order the Cavatappi Pollo. I enjoyed my decision but added probably half a bottle of red pepper flakes (I really like the heat). <br><br>Cute, rustic and homey atmosphere. I definitely recommend this restaurant to pasta lovers.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/BTguh8MM3Ou9ryI4tvQgDA/348s.jpg", "caption": "Cavatappi pollo"}]}}, {"review": {"des": "What's not to like?! This place was great! We had sangria to start off.. followed by some garlic bread and jalapeño gnocchi. All was delicious!!! I definitely can't wait to go back!!!", "pics": null}}, {"review": {"des": "Visited Pasta Palazzo with a group of four on a Saturday night around 6:30. We were seated after a brief 5 minute wait. The restaurant is fairly small with the kitchen in the dining area, so some tables have a good view of their food being prepared.<br><br>Everyone in our party agreed that the food was just okay and the menu options pretty bland, things we could have fairly easily made at home ourselves. That said, they came at a value, priced at $10-12 a plate. My biggest complaint was that most of the dishes were vegetarian, but some people are into that, I guess. <br><br>I ordered one of the specials, the seafood risotto with broccoli. It came with some shrimp and scallops, but wasn't anything to write home about. The best dish I sampled was the jalapeño gnocchi, which was stuffed with ricotta. It had very little spice, just enough to taste it but no more. It would have been amazing if we had added sausage to it. Not sure if they allow that.<br><br>We also ordered garlic bread and bruschetta as appetizers. They were also good, but not great. Had I known we were going to get free bread with our meals, I probably would have skipped those.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/xg39Pfil9QCdnJqB6jMqYg/168s.jpg", "caption": "Bruschetta"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/hjmYXHbk9aQuqb1ieduoEg/168s.jpg", "caption": "Seafood risotto with broccoli"}]}}, {"review": {"des": "I've never had anything I didn't love here.  It's gotta be one of my favorite neighborhood digs.  If anything, I would always opt for their homemade pastas.  The gnocchi is puffy and pillowy, and can be pretty rich depending on your sauce of choice.  You can't lose with any of their starters.", "pics": null}}, {"review": {"des": "$6 sangria was great, $4 for a big plate of bruschetta, $9 for basically 2 servings of pasta. I will definitely be back!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/uik-MAPmBq6hohkKLqmAvg/348s.jpg", "caption": "$6 Sangria"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/nPDbDPZ68ps5xLCk6T-X8g/168s.jpg", "caption": "$4 Bruschetta"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Q6uXOAjXSTgEIZXvyMq_bg/168s.jpg", "caption": "Healthy Primavera"}]}}, {"review": {"des": "The potato broccoli soup is delicious, especially on a chilly day! Everything is decently priced as well.", "pics": null}}, {"review": {"des": "Reasonable prices and quick service. Two things I love about Pasta Palazzo. They have their own app you can order takeout from. They do not offer delivery yet. You get a nice portion of pasta and they have some pretty good daily specials. I usually ask for a different pasta with their bolognese and they always come through. Service is nice and the atmosphere is chill. I hope they do delivery soon.", "pics": null}}, {"review": {"des": "I had a lovely dinner here with some girlfriends before a concert at Lincoln hall. From the rustic crusty bread to the cooked to order pasta dishes, everything was tasty.<br><br>We tried the house made tortellinis in marinara sauce. The tortellinis were wonderful. However, I found the marinara too sweet and on the bland side.<br><br>We also had the pasta fungi. It's a marsala cream sauce with mixed mushrooms. It was just lovely. I've never had a creamy Marsala sauce before--truly unique and outstanding.<br><br>Finally we tried the house made (specialty) jalapeño gnocchi. These were the highlight of the meal, for sure. The best pasta dish I have ever had the pleasure of eating. I haven't stopped thinking about it since! I described them as little pillows of creamy spicy heaven. You must must try this dish!<br><br>I'm excited to go back sometime soon, thanks Pasta Palazzo!", "pics": null}}, {"review": {"des": "Service was fast and efficient and the pasta was amazing perfect amount not too heavy and the atmosphere is very cool you can watch them cook and smell all of the flavors!", "pics": null}}, {"review": {"des": "Good service. Bruschetta was awful. Soggy and overwhelming amount of vinegar. Pasta was basic at best. No flavor. Husband had Alfredo.... tasteless.  I had penne fungi Marsala pasta dish. There was more mushrooms than pasta. Tasteless. Wouldn't go back. Prices are good but u get what u pay for", "pics": null}}, {"review": {"des": "I loved eating here.  It's located in the Lincoln Park area of Chicago.  They have every pasta imaginable!  They even have a healthy pasta section served with no butter or cheese!  It is dairy free friendly restaurant.  I have ordered the healthy chicken before, it was really good!  I recommend eating here!  I can't wait to go back!", "pics": null}}, {"review": {"des": "A hidden go-to spot in LP. <br><br>The Atkins movement has put a damper on pasta generally speaking, but Palaz is well worth it. <br><br>I've gone through most of the menu at this point, and would have to call out the pesto and Cavatapi Pollo as the top two. You really can't go wrong with any other option, thought. The bread / olive oil are money, too. <br><br>Staff is friendly, and if you're apartment's heat stops working for whatever reason, come here for the warmest eating experience in the city (I mean it in an endearing way, not complaining).", "pics": null}}, {"review": {"des": "the best pasta on Halstead. a nice little nook with plenty of options to choose from. Last time I got the asparagus as a side and it was very flavorful. Wear loose pants if you're going to eat here", "pics": null}}, {"review": {"des": "The garlic bread was slightly burnt and had absolutely no garlic flavor. The gnocchi could have been delicious, except for the fact that their were large bits of jalapeño in the center that ruined the best part of gnocchi...the buttery soft melt in you mouth texture. Additionally, the sauce was very one note. I like spicy food, but I still want the essence of what make gnocchi great, which is the texture. <br><br>Between the mediocre garlic bread and poor take on a classic, I can't recommend this restaurant.", "pics": null}}, {"review": {"des": "Hands down the best italian food I have had. Went there twice in 2 weeks cz we couldn't stop thinking about our first experience there. <br>We have only tried their homemade pasta (jalapeno gnocchi, ravioli with pesto and tortellini with gorganzola cream). The sauces are really flavorful and the jalapeno gnocchi def has a good kick. <br>If you choose to sit at the bar you get to see the chefs cooking which is very entertaining. <br>The restaurant itself is fairly small so do expect a wait but the service is great.", "pics": null}}, {"review": {"des": "This place deserves the fresh 5 stars. <br>Professional and speedy service was outstanding.<br>The bread that comes in before your meal hits the spot. I recommend taking the oil, pepper, and salt to make a quick dip for it.<br>For entrees, I got the pesto ravioli and mushroom masala pasta. There were generous portions of birth the pasta and the sauce. The pesto was nutty and filled with aroma which I really enjoyed though it was dense. The ravioli was good but the pesto really takes the crown. I'll have to try the tortellini next time I'm in Chicago.<br>The marinara was on the simple side but still packed flavor for the pasta and mushrooms. <br>Go to this place for affordable Italian that doesn't taste like Olive Garden.", "pics": null}}, {"review": {"des": "A very casual spot. I think they need more space. It's very small with an open kitchen and half the seating is at the bar overlooking it.<br><br>Wish we could make reservations or order delivery or have a digital way to get on the list to wait. Super tight waiting area and they just take your name.<br><br>We had some yummy pasta and apps - would go back for some casual pasta!", "pics": null}}, {"review": {"des": "Now they serving alcohol too, but BYOB option is still on a table for a corkage fee. My favorite thing about this place is food, haha! <br>Friendly stuff, cosy atmosphere.", "pics": null}}, {"review": {"des": "Amazing pasta every time my family has been in! Great wine selection as well. This place is a HAVE TO place to stop every time we are in Chicago!", "pics": null}}, {"review": {"des": "Really delicious, freshly made Italian food.  Reasonable prices, friendly staff, and fantastic food that you can watch being made from scratch if you sit at the bar.  I've been here three times now, twice for lunch and once for dinner, I'll definitely keep coming back.", "pics": null}}, {"review": {"des": "This place has fresh, hot, quality food and a superb menu for those who like slightly Americanized Italian food. Everything is good, including the salads and sandwiches. The seating could be better because primarily heavy bar seats at high top tables; I say this only in case owners are perusing Yelp and considering updating the decor at Pasta Palazzo. Personally, I'd love to see them having a bigger, more comfortable place near Lincoln Square.", "pics": null}}, {"review": {"des": "We don't use 'awesome' to describe restaurants as much, unless they are superb. However, AWESOME is solely the word to say about Pasta Palazzo. Whether you're craving for authentic Italian food or just a rich meal, this place should be sitting at number One on your list. The food is five star for a very affordable price.<br><br>The restaurant has special menu for everyday and some are worth trying. We tried plenty, and Jalapeño gnocchi is one must-try dish - it just WOW! Gnocchi is as soft as pillows and just melt in your mouth.<br><br>The portion isn't crazily big, but rest assured that you're getting what you pay for because each bite is a piece of heaven itself. And yes, the food is great and you can make it even better as you like it by tweaking the food in any way you want. They have always been very accommodating with customer's special order.<br><br>If you drop by at dinner, make sure to order some cocktail to go along with your superb meal. Bread are provided free of charge but nothing is spectacular about it, just the typical chewy white bread.<br><br>Recommended : Caesar salad with Shrimp, Jalapeño gnocchi, Lobster-stuff Ravioli in Alfredo cream sauce<br><br>For more, visit us at: <a href=\"/redir?url=http%3A%2F%2Fwww.thecoupleeats.com%2F5-must-try-dining-places-in-chicago-for-first-timers%2F4%2F&s=4a84855c1ba92f91f490a99d2de7f37f1a53f51ad1f3415c9a9dc240084c1349\" target=\"_blank\" rel=\"nofollow\">thecoupleeats.com/5-must…</a>", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/8dUbVD-s5dSvjVcO9GNGQg/348s.jpg", "caption": "Jalapeño gnocchi"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/eX3R_lym3HAU7Cento1_hw/168s.jpg", "caption": "Burning flame !"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/uLHgx_RgZd4fBIMT_xNTSA/168s.jpg", "caption": "Lobster-stuff Ravioli in Alfredo cream sauce"}]}}, {"review": {"des": "Dined in.  Fettuccine special and homemade tortellini orders were delicious. Service also very quick, which is great. <br><br>Free bread‼‼", "pics": null}}, {"review": {"des": "I've dined in twice and both have been great visits! <br><br>Super casual that's fun to dine in or have carryout (note: I've only dined in. However, I saw a TON of carryout orders). On my most recent visit, we sat at the bar, which gives you a front row view of the small kitchen. It was fun to sit there because you get to see all the types of pastas/sauces they make in front of you (plus, the warmth of the grill is nice!)<br><br>They have a small wine list that's accessible and inexpensive. Bring a friend and split a bottle :)<br><br>The food has always been great. I've had the much-discussed jalapeno gnocchi, penne bolognese, and a pesto dish. I've also had the garlic bread. Every item was perfectly sized (if not too large), piping hot, and tasted wonderful. Also, with price points from $8-$12, it won't break the bank!<br><br>While I will still go to Topo Gigio for our nice dinner dates, PP is an awesome choice for a fun, casual night out. Highly recommend!", "pics": null}}, {"review": {"des": "Really good Italian at an incredibly affordable price. I'm a fan.<br><br>The jalapeño gnocchi was delicious, as were the meatballs. Goat cheese appetizer was also solid. The only thing I didn't like was the Caesar salad. That was surprisingly unimpressive, especially given how delicious everything else was. The other salads at nearby tables looked good, though, so I'll try a different one next time. I'll definitely be back.", "pics": null}}, {"review": {"des": "This was not good. Ordered the chicken cavatappi and a salad. Extremely disappointed and will never order from here again. It was super salty and lacked other flavors. I couldn't even taste the sun dried tomatoes due to the saltiness. I added broccoli and got like 3 pieces added. I ate about 4 bites. The bread was also disgusting. Why even include it. It was hard and tasted stale. Oh and I greatly enjoyed the heel. lol. One bite and trash. Haven't tried the salad yet so hopefully that's fine. Hard to mess up salad. Don't wait for over an hour for this food.", "pics": null}}, {"review": {"des": "Great place for pasta! My friend and I ordered the risotto special and the penne funghi to split. Both dishes were very good! They had the right amount of sauce on them. The prices were pretty good too! i wish the menu had more creative options on it as opposed to some slight variation of some dishes.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/tPfEq7KhTS6ndMgSxBSKog/348s.jpg", "caption": "top: pasta funghi bottom: risotto special"}]}}, {"review": {"des": "I had a dinner on Tuesday night! Reviews were awesome so I have called before coming in to know if there is an open spot. I got my table pretty quick. Service was awesome!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/nrFl0kRXhzNuz7BNoVYMRQ/348s.jpg", "caption": "Healthy Primavera Love it!"}]}}, {"review": {"des": "Great meals with so much flavor! Both meals we ordered were perfectly sized for a dinner and left us stuffed.  Simple, fresh ingredients with a nice atmosphere = the way Italian should be enjoyed!", "pics": null}}, {"review": {"des": "Solid Italian spot that actually isn't very expensive despite the area, I got mussels in tomato sauce for only $8, though I think that it was definitely more of an appetizer instead of an entree, those went for usually $9-$11. Even though what I got wasn't that big, it was still good, and the pasta my friend got looked very good, so next time I come back I will definitely get a pasta dish", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/xk-nlEk9uFWjNB7qROoEKA/348s.jpg", "caption": "Steamed mussels in tomato white sauce"}]}}, {"review": {"des": "A cozy family friendly pasta spot good for groups of four to eight. Surprisingly reasonable prices for such delicious food in one of the more tony neighborhoods of the city. A sit-down dinner for three with two bottles of wine was under $100 which never happens.  The staff was pleasant and friendly but I would recommend avoiding the fierce early evening rush. They offer a variety of pasta styles/sauces and everyone was happy with the food, it's as good as you expect. Overall, if you're in the mood for pasta (or have a cheat day) call a couple of friends and swing through this spot.", "pics": null}}, {"review": {"des": "I find myself so frustrated every time I try to eat here. Service is always incredibly slow. I have had to end up walking out because no one ever came to take my order. Another time, we walked in at the same time as two other tables. They got their food after about ten minutes. Ours was about 40 minutes. There was only three tables there! I decided to try carry out, hoping it might be better. Nope. Waited for my food that was estimated at 15 minutes well over half an hour later. It makes me sad because I love the food.", "pics": null}}, {"review": {"des": "This place was cute and had a great atmosphere. The decor was nice and visually pleasing. The wait staff was attentive and efficient. The food was good and we enjoyed a nice dinner here. <br><br>I had the vegetarian salad and tomato soup. Both were tasty. The veggies on the salad were warm and the balsamic dressing was whipped. The waiter said the tomato soup was a favorite by many which is why it's always available. I enjoyed. Definitely recommend.", "pics": null}}, {"review": {"des": "This place was great! The service was wonderful and the food was outstanding. And so moderately priced! The next time that I'm in Chicago, I will absolutely come back!", "pics": null}}, {"review": {"des": "There is nothing wrong with Pasta Palazzo, but there is nothing necessarily spectacular about it either. The service was relatively slow, but the food was fine. After all, it is pretty hard to mess up pasta! This menu had a good selection of pasta dishes, and the asparagus appetizer was great!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/SrlKh_Y5qHEQ58Oad3SQEw/348s.jpg", "caption": "Seafood pasta!"}]}}, {"review": {"des": "I happened to find this place on Yelp and let me tell you it lived up to it's hype. It i not a fancy place but still is very comfortable. We started out with the Bruschetta and it was very good. My wife had Penne Alle Melanzane and she loved it. I had the Spaghetti Frutti di Mare which was fantastic. I had one glass of wine. Our bill without tip was 35.00 The service was great. No doubt we'll be coming back here on a regular basis.", "pics": null}}, {"review": {"des": "A good casual pasta spot. Un-pretentious, good service and easy on the pocket.<br>It's a departure from the usual quiet, Italian restaurants. The ambience is approachable, targeted toward younger everyday, clientele. Hence the food is not as expensive. Would dine here frequently if I lived closer.", "pics": null}}, {"review": {"des": "Delicious food!<br>Outstanding service!<br><br>I wish I lived or worked closer to Pasta Palazzo!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/9kpa_W4AyqrNHyDNsa1eGg/348s.jpg", "caption": "The Rigatoni was delicious!!"}]}}, {"review": {"des": "OK this has already been my fallback place for a decent, well prepared, good tasting Italian meal. And they still don't disappoint.It can be a little tight on seating, as it is a intimate place with a dozen tables. I can say that they have been consistent in their food preparation for ten years, which is hard to say for almost any place. Go there, get a window seat, enjoy the food, and watch the world walking by on Halsted", "pics": null}}, {"review": {"des": "Pasta Palazzo is a very charming Italian restaurant in the heart of Lincoln Park on Halsted. There is not much seating, so call ahead, and be aware they will not seat incomplete parties. If you have a party larger than 8, you may have difficulty, but the staff is incredibly friendly and are happy to accommodate.<br><br>I came here with my boyfriend and his family on a Saturday evening, there were 8 of us total include 3 very rowdy kids, adorable, but they're between the ages of 4-9 so very easily excited. <br><br>The staff didn't blink an eye, they were absolutely fantastic with us even when we had to change tables, they immediately accommodated us and the service was great.<br><br>We shared appetizers, calamari- delicious, small portion, Bruscetta- very fresh tomatoes and the sauce was amazing along w the bread, and baked goat cheese, if you like goat cheese, it's amazing, it comes in a tomato sauce with toasted garlic bread, kind of bland, but not terrible.<br><br>We split a large Cesar salad, the greens were very fresh, but the dressing was a bit bland, it was still good, just not great.<br><br> My BF ordered the seafood pasta in a red sauce, the seafood was very fresh and well season, the pasta was great.<br><br>I ordered the gnocchi with Gorgonzola sauce, The menu doesn't say that any veggies come with it, just the plain pasta, but when I asked if veggies could be added, the server said I could add whatever I wanted, it was a large group ordering, so as not to hold it up I only ordered mushrooms, but if I would have know that anything could go in the gnocchi, so it would be very helpful if that were listed on the menu or even offer a wider selection of gnocchi dishes. And I wasn't a huge fan of the Gorgonzola sauce, you can choose between about 10 other sauces, but it was a little overwhelming on the menu and I didn't know what would go best, so that's my fault for ordering it. <br><br>I was surprised by how small the portions seemed, the price point is pretty affordable, but I finished my plate and I was still hungry, and that never happens when I east pasta. <br><br>The food was good, but the service was outstanding and we will definately be back.", "pics": null}}, {"review": {"des": "I have been going to Pasta Palazzo for years now..My sister Pam exposed me to this Lincoln Park treasure and I have been hooked since! This review is long over due!! <br>Their meals are CONSISTENT, FAST, & WARM. The staff is also pleasant and accommodating..I seriously rave about this place to anyone looking for a quick, GOOD, AUTHENTIC, bite in Lincoln Park. <br>Everything is just so good!!! The meals are super affordable as well and the atmosphere is cozy ..I couldn't ask for a better pasta joint..The goat cheese, alfredo, & the chicken sandwich is my favorite. <br>Everyone I bring here, leaves FULL & HAPPY! Thank you for bringing such a fantastic place to Lincoln Park!!", "pics": null}}, {"review": {"des": "Huge fan, love the customization you can get and you end up with a reasonable portion for a reasonable price whereas a lot of Italian places dump like 1.5 meals worth of pasta on you and then charge double or triple. It's pasta, it shouldn't be that expensive.<br>Pasta Palazzo puts a more casual twist on it with friendly servers and good prices.<br><br>I got the jalapeno stuffed dumplings with roasted red pepper puree and added sundried tomatoes. It was incredible, I'd get it in a heartbeat. I didn't feel overly full at the end and I cleaned my plate - everything about the dish was great. There was some heat to it, but not too powerful. The gnocchi was good, but the sauce was the highlight. That roasted red pepper puree was superb.<br><br>I'm definitely going back, it's a unique option when looking for a pasta dinner and it executes the concept perfectly.", "pics": null}}, {"review": {"des": "We stubbled upon this delicious restaurant while shopping. It was delicious. The goat cheese with fresh basil sauce appetizer was the best! Would go there for that alone. Super service and pretty interior.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/7KSHxATF7VlvdZUADfZ0PA/168s.jpg", "caption": "Homemade sangria!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/AZu5dWaPJN9QZ7FEsxqwlg/168s.jpg", "caption": "Amazing goat cheese appetizer"}]}}, {"review": {"des": "Absolutely amazing food! Pasta is fantastic and owner is very pleasent and accommodating. I got the jalapeño gnocchi and it was phenomenal. Highly recommend!", "pics": null}}, {"review": {"des": "As disappointing as this sounds, but an expectation of delicious Italian food doesn't get quite satisfied by coming here. They have a great selection of various dishes and drinks that they serve, along with some specials they have of the day...though some staple Italian food dishes were missing from the menus. (Pasta Carbonara, just to name one...)<br><br>Delicious bread and olive oil though before your meal comes to the table, and an interesting atmosphere to say the least. I wouldn't say that I will never come back here again, but if choosing between here and dare I say Olive Garden (which I know isn't truly Italian), I would choose Olive Garden.", "pics": null}}, {"review": {"des": "Pasta Palzazzo is the only place in Chicago in the Lincoln Park neighborhood for pasta! A friend and I stumbled upon Pasta Palazzo a few years ago and its a must for any visit to Chicago.<br>Check out their daily specials, all of their pasta and sauces are amazing.<br>Their vegetariano salad is one of the best salads I've ever enjoyed, great mix of perfectly grilled zucchini, peppers, eggplant on mixed greens <br>On this visit smoked chicken ravioli with gorgonzola was one of the specials, my friend and I devoured it and would have loved more! <br>If you like pasta, friendly service in a great neighborhood, look no further than Pasta Palazzo!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/i0RzkvGXQmNcxRydo0C7cA/168s.jpg", "caption": "Vegetariano salad grilled veggies on top of fresh greens with balsamic vinaigrette"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/__8dFIYBLgZ14ixA0ha_Wg/168s.jpg", "caption": "Smoked chicken ravioli with tomato gorgonzola sauce"}]}}, {"review": {"des": "Delicious. The three specials we tried were great. The restaurant is small, colorful, very nice--especially for the price. We enjoyed the window seat and the privacy of this table. The waitress could have been more gracious--they serve coffee out of a thermos and it wasn't hot. But when we complained, she brewed a fresh pot. It just took a while and we finished the dessert before the coffee arrived.", "pics": null}}, {"review": {"des": "The food is delicious! Plus - substitute gluten free penne in any dish for an additional $2<br><br>I stopped in here for lunch and was able to quickly grab a table. Within about 10 minutes, the restaurant was full, so I guess we dropped in at the perfect moment. <br><br>The staff was friendly from the second we walked in the door and remained attentive even once all the tables were filled. <br><br>I went with a daily special - Seafood Risotto. Risotto with shrimp, calamari, scallops and broccoli in a tomato cream sauce. It was beyond delicious. The creamy tomato sauce was the perfect overlay of the seafood mix. The broccoli added a nice, fresh crunch. <br><br>The serving size was more than enough for me! I took it home and had lunch the following day!", "pics": null}}, {"review": {"des": "The hostess seated 4 tables that came after us, and when I inquired she said she thought my name was something else in a hostile manner. The food is not bad but it's not worth the attitude.", "pics": null}}, {"review": {"des": "You know when your looking for wholesome food.. like warm hit the spot food. This is the place. Anytime I come here I leave feeling satisfied. I see people have mixed reviews here BUT it's not the restaurants fault if you order the wrong thing. I love cheese but not blue cheese so I won't order something with blue cheese, it's that simple!! They have many things on the menu so you need to know what you love. The gnocchi is to die for, its fresh and made perfectly. Also get the goat cheese appetizer it's warm and so satisfying. If you love pasta you will love this place!", "pics": null}}, {"review": {"des": "This is a lovely restaurant that specializes in pasta. I have dined here often in the 15 plus years that I have lived in Lakeview-Lincoln Park area and I have never had a disappointing experience. The pastas are all cooked to order and are delicious. Service has always been friendly and efficient. Additionally the ambiance is casual, yet a little upscale. The pricing is extremely easy on the wallet, especially when considering the quality of the food. The pasta portions are not huge, but enough, however the side Caesar and House Salad are generous for $4. You really cannot go wrong here as this is my favorite spot to indulge in a plate of pasta.", "pics": null}}, {"review": {"des": "Hand made pasta was fantastic. Mozzarella was fresh. Gnocchi is melt in your mouth good! Dined on a Tuesday evening and it was steady busy. Service was quick and polite.", "pics": null}}, {"review": {"des": "Jalapeño Gnocchi, please order it. The softest and most delicious I've ever had. I recommend adding a protein to it as well, but even if you don't it's amazing. <br><br>Smaller place with many shared tables which is nice when not crowded, but not ideal when it is. Also love that the kitchen is right in front of you. Great spot for casual date or cheap but delicious dinner.", "pics": null}}, {"review": {"des": "Bad experience with service. Otherwise 4 stars for food.<br><br>Our server seemed to be in his own world. He didn't greet my SO and I (by introducing himself, getting us settled in, etc.) He took our order and didn't return until later in the meal when he gave us the bill (didn't come by to check how we liked the dishes, didn't offer to refill water cups even though mine was empty.) He was passing by and we asked for the check -- no acknowledgment that he had heard us and then brought our check over a few minutes late. He didn't bother to try to remove any of the finished plates on our table until after he brought the check over for a signature.<br><br>Overall, the sense we got was that we were somehow a burden for him even though we were providing business. <br><br>Not likely to return.", "pics": null}}, {"review": {"des": "Wow... Jalapeño gnocchi with scallops... No joke. And the fungi with sausage?? Fantastic. My husband and I were pleasantly surprised! The setting is crowded. But totally worth it and loved the staff :) Ambiance is definitely casual. Everything is also affordable. LOVE!<br><br>Fourth time here... still love it!! Tried the veal tortellacci this time", "pics": null}}, {"review": {"des": "My wife and I both agreed it was some of the best pasta we have ever had.  The menu looked a little simple at first compared to restaurants with pages and pages of options, but I rather liked focusing on things they do well - and they did it really well. :)", "pics": null}}, {"review": {"des": "This is our nearby pasta place. 5 of us came to eat and arrived at the restaurant around 8:20pm last Sunday 5/8. The tables were about 75% full with people eating. The gentleman host told is \"we close at 8:30\". We looked around and asked if it was \"still ok to sit\". He kept saying \"well...we close at 8:30\".<br>So we gathered that meant no - without him actually having to say no. In my mind, it's either your open and seating guests or not. The passive and uninviting approach by this gentleman was to say the least- disappointing. <br>Hungry he walked next door to Stella Barra. They were happy to seat us and we had a fantastic meal!<br>Hoping the Owner reads this and makes a change to how this situation is dealt with in the future.", "pics": null}}, {"review": {"des": "I have been a cocktail server for many years but I never experienced such a rude attitude from a server. I went there with my roommate for dinner. We didn't know that they were closing in 10 minutes. The server with glasses came to the table and asked for our order. I asked for the alcohol menu. The server left kind off upset, then he came back and threw the alcohol menu at the table making a loud sound, he didn't even made eye contact or apologized. Then he came back and said, we are closing in 5 minutes. We decided to leave because it was obvious that we were not welcome. I left in shock and upset due to the rudeness and lack of tact of the server. I was there on 03/22/17. <br><br>To the server, you are not made for this job. You need to learn basic manners and have tact when you treat people. I am a server as well, at the end of the night the only thing that I want to do is go home. But because you want to go home, you don't have the right to treat people like trash. You are not dealing with your parents, siblings or friends you are at work, be professional. You work for the tips but you really don't care, it is just a job for you. Disgusting!", "pics": null}}, {"review": {"des": "Average. No great but not terrible either. Ordered delivery. Pasta was over cooked. Frutti Del Mar was a little light on the seafood. The highlight was the meatballs.", "pics": null}}, {"review": {"des": "This is my favorite pasta place in Chicago, which is saying a lot because there are a ton in Chicago! The pasta is so tasty; and everything is fresh and authentic! They make the pasta in front of you (the kitchen is right behind the bar seating) so you know everything they are using is fresh. Highly recommend! Super cute mom and pop place.", "pics": null}}, {"review": {"des": "Delightful neighborhood place. Friendly greeting upon arrival and prompt service.  I had the grilled portobello with pesto. WONDERFUL.  My husband had the meatball sandwich and said great flavor. A little too much bread but was easy to remedy.", "pics": null}}, {"review": {"des": "This is my favorite date night restaurant in Chicago. Seriously. Been going here with my girlfriend for 4+ years now. Exceptional food, great service, amazing sangria, what else could you ask for? The staff is friendly but beware they don't take reservations (which I kind of like). Go here any night of the week and check out the specials written on the chalk board. I guarantee you won't be disappointed! You can also carry out.<br><br>Highly suggest the cavatappi pollo, bruschetta, sangria, and anything with the spicy vodka sauce or on the \"specials\" chalk board.", "pics": null}}, {"review": {"des": "Pasta Palazzo is a neighborhood staple. It's consistently simple, good food for a great price. You know what you are getting and everything on the menu is solid. The staff is friendly and accommodating. Each dish is made to order so they don't mind when you want to sub or add ingredients. I'm always pleased with the pasta dishes and surprisingly the grilled calamari is one of my favorites in the city. When you want a casual and quick dinner out, palazzo is the perfect place. It's easy, inexpensive and always tasty!", "pics": null}}, {"review": {"des": "I was really excited for a delicious and affordable Italian place within a moment's notice, and upon finding out about Pasta Palazzo and perusing the menu I had really high expectations. Going in ordered a small Caesar salad(deluding myself into being 'healthy') along with the jalapeno gnocchi, which seemed like a fan favorite. Very polarized. The Caesar salad just had so much dressing when I got it, it was hard to finish. As in, I didn't finish it. That aside, the jalapeno gnocchi was delicious. Incredibly fluffy pieces of home-made gnocchi tossed in a deliciously savory red pepper sauce that I'd like to pour on all my pastas. They're filled with a bit of ricotta too, so when you bite into these pillows you get fluffy inside fluffy. The portion size isn't that large for what you're paying($11), but the quality was arguably worth it. Will avoid the salad next time, and check out their other pasta options to see how they compare on the flavor/cost scale.", "pics": null}}, {"review": {"des": "When you are still thinking about the pasta the next day, you know you've got a winner. We went here for dinner this past weekend, and split the Jalapeño Gnocchi and the Veal Tortellacci special. Both were very good, but especially the Tortellacci...I used a piece of bread to get every bit of the creamy sauce of that dish! And for lovers of dishes with a bit of spice, the Jalapeño Gnocchi is stuffed with a delicious blend of Jalapeño pepper and cheese...I don't know why more Italian restaurants don't use Jalapeños! We went for a very early dinner on our way to an event, so it wasn't very crowded...but the space is a tad small, so I can see it getting crowded on busy nights. But, prices are reasonable and service was good, so I think it would be worth a bit of a wait. Enjoy!", "pics": null}}, {"review": {"des": "Been eating here and getting takeout for 10 years.  Great people, easy-going, consistency with the great food!  Very reasonable $ as well.", "pics": null}}, {"review": {"des": "Quick and delicious place to stop by if you're on a schedule. The bow tie pasta was scrumptious! Definitely one of the better pasta joints in North side Chicago.", "pics": null}}, {"review": {"des": "My favorite thing about this place is how consistent they are. I've been too many times to count being that I'm a DePaul alumni who used to live near it and I can truthfully say every time it was spot on. Some favorites of mine are the regular and jalapeno gnocchi, both equally delicious. Aside from the food which is pretty spot on the service can be hit or miss. Typically you'll get a friendly server but it may take a while for them to get to you. It's a pretty small place so typically they have one or two people taking care of everyone which can be a lot to handle, so just be patient.<br><br>Food and service aside, the atmosphere is pretty amazing! The restaurant has a pretty vibrant color scheme and it truly feels like a warm and cozy setting. They also typically have some good tunes on as well. The size of the restuarant can cause it to get pretty loud during a busy dinner service but that's something you really can't control.<br><br>Price-wise, this place offers great value. A super filling pasta dish will run you about 10 bucks which is pretty rare for good Italian and especially good considering its location on the wonderfully pretentious Armitage street. <br><br>Perfect for date nights or family gatherings, you should give this place a shot. Especially if you're a semi broke DePaul student trying to impress a date haha.", "pics": null}}, {"review": {"des": "This is usually a great go to for my husband and I. Love the jalapeño gnocchi! Sadly, I couldn't be more disappointed with their rude service. On Tuesday night, my husband and I were going there for dinner and arrived around 7:30. There was a 20-25 minute wait. The hostess was short and not very friendly. We asked her if we could order a glass of wine while we waited for our table. She practically threw the drink menu at us and walked away (never returning). Then we asked if we could sit at the bar (as it's usually first come first serve) and her response was there's only one chair. When we found two chairs together she scolded us like children, with aggressive arm gestures, saying there was a wait and we can't just sit wherever we want. At this point we had enough of her rudeness and left the restaurant. Sadly not sure if we will return.", "pics": null}}, {"review": {"des": "My new love! The husband and I heard about this place from a friend and decided to try it last night. We were really impressed and cannot wait for our next visit.<br><br>Here's all you need to know:<br><br>1. Delicious food - We had the conchiglie gorgonzola and jalapeno gnocchi<br>2. Awesome price point - Entrees are only $8-$10<br>3. Great service and friendly staff<br><br>It's the perfect no frills restaurant. I would love to try their entire menu!", "pics": null}}, {"review": {"des": "I adore Pasta Palazzo. I've eaten in once and ordered takeout about three times. I must admit that I've only ever ordered one thing here - the gnocchi. I can't help it. I don't want to order anything else because I love these soft little pillowy pockets of deliciousness. The price is also great - $10. I'll be honest though, I always find myself wanting more more more!<br><br>Maybe one day I'll finally find the courage to venture out and try something new on the menu but let's be realistic, I'm probably never going to stray from my beloved gnocchi.", "pics": null}}, {"review": {"des": "Pretty good taste, but somewhat overpriced for its portions. I ordered the grilled chicken sandwich with a side salad for $10. The bun was fresh and soft and most importantly...the meat. The chicken was honestly so good. They cook it on the grill which gives it a nice charcoal flavor. On top of that, they put grilled red peppers and a really tasty secret sauce that explodes in my mouth.", "pics": null}}, {"review": {"des": "Just so consistently great.<br>The service is always impeccable and the food is freshly made.<br>The sangria is always a favorite and the capellini pomodoro is the best! Be sure to get it. The fresh tomatoes are on point in this dish.<br>It's a small, quaint place, but super welcoming. Great for lunch or a quick bite to eat. It's an open kitchen, so be ready to smell all the goodness!", "pics": null}}]}