{"name": "pastoral-chicago-2", "reviews": [{"review": {"des": "Ha, I love this place and you will too! Their menu options seem unlimited and are above average in taste. Where do they find all these perfectly crafted cheeses?<br><br>It's a nice place to go and relax. Browse the wines, meats, cheeses and dare yourself to try something different. You won't be disappointed by the brie it is amazing. I don't care if you are lactose intolerant bring some Lactaid and enjoy yourself.  <br><br>The only thing that upset me about this place is when my food ran out :) meaning I finished it. <br><br>Have a great time, I did.", "pics": null}}, {"review": {"des": "Note for this particular location, you cannot have a glass of wine with your meal as they don't have the license. They do however have a small selection of bottles available for purchase. <br><br>I ordered a veggie sandwich on a baguette and it was okay. I can appreciate a \"crispy on the outside, soft on the inside\" piece of bread but this was rock hard and difficult to chew.", "pics": null}}, {"review": {"des": "The food is good.<br><br>The people that work there make it very uncomfortable though. They are either yelling at each other or discussing divisive politics. <br><br>I got my food to stay but I then wished I hadn't. I didn't feel comfortable with the things they were talking about.<br><br>I don't need that, I just wanted to get something to eat.", "pics": null}}, {"review": {"des": "I'm partial to the Lakeview East location but this one is great for quick, easy corporate catering for lunch/afternoon. The salad and sandwich platters always look great so I don't have to re-plate for guests like I do with other catering orders. The staff is very friendly and always easy to get ahold of for any last minute changes. I will continue to order because they are consistent, reliable and always requested by staff and guests.", "pics": null}}, {"review": {"des": "Fantastic fresh ingredients make this place a diamond in the rough. <br><br>Charcuterie and cheese...that's all you have to say to talk dirty to me! Pastoral has it all! Fantastic cheese and meat selection.  Sandwiches, cheese and charcuterie trays, as well as deli take-homes, wine and local brews are some of what you will find at this local gem. Prices are reasonable for the products you receive. <br><br>Local beer and wine is also available inside of their restaurant (pick up a pint or a bottle to take with your meal). Millennium Park is located a stones throw away....a great spot to take a cheese tray and a bottle of nice wine if you're trying to impress a date. <br><br>I ordered the Blue Pig and Fig sandwich with the hottest habanero potato chips you could ever imagine. I expected to wait 20-25 min for my sandwich during lunch hours.  When I asked how much longer it would be for my pig and fig, after 30 min, an employee apologized and said they would put s rush on it....no big deal, I expected to wait, and I told the employee this.  I wasn't mad at all.  He continued to apologize and explain that this should never happen; a coupon for a free sandwich next time I visit was issued to me, at the employees insistence. <br><br>Grab a punch card when you are here....buy 9 sandwiches and get the 10th free (or something like that). It's a nice kickback for enjoying something you would normally buy anyway.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/mk3rL3yCsS_R6yQ9RyfdYg/168s.jpg", "caption": "Some super spicy chips!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/krnAOx2QhPOti5BnLAcNnQ/168s.jpg", "caption": "Beer!"}]}}, {"review": {"des": "That health but salad!!! My goodness, best salad I've had in my life! So magical! A real local gem. Great for catering lunches for work too with the sandwiches and salads, so delicious!", "pics": null}}, {"review": {"des": "The people working here were so helpful and patient. And it's super close to my job and home. They have a huge selection of cheeses, meats, homemade bread, condiments, and wine. I didn't get a chance to try their Sammies but they had a constant flow of people coming in to order sandwiches togo. The custom charcuterie and cheese box I made was delicious and so pretty. It looked like a rainbow of meats and cheese. I'll definitely be back to try more of their things.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/6ZpamzXrkuTRiAQA1Eubsg/168s.jpg", "caption": "Rainbow of deliciousness"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/eTvkNv5ftA7prPszKYJF_g/168s.jpg", "caption": "Super helpful and patient staff! Custom made"}]}}, {"review": {"des": "Great little cheese and deli shop in downtown Chicago!<br><br>We stopped in for a cheese plate and to escape the rain. There's only a few little tables, so if you're planning to eat your sandwich here I would make other plans.<br><br>We ordered the cheese plate and spent a little bit browsing while waiting for it to be put together. They have a good selection of artisan cheeses as well as regular cheese. I was pleased to see they have brick cheese, which is apparently a WI-only cheese. The cheese monger said they wanted to carry all the unique cheeses from the Midwest, even though apparently no one outside of WI has any idea what brick cheese is (It's delicious; get it!).<br><br>They also have a wall o' wine and it seemed to be a good selection. I believe there's also bread to go with your cheese and wine.<br><br>The cheese plate was real tasty. The sides were very complimentary, which is important in a good cheese plate. Honestly, I would expect nothing less from this quality of cheese shop.<br><br>I will definitely try to stop in here the next time I'm in Chicago.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Ly8uCYxIxI4aCY-1Bh0Dug/348s.jpg", "caption": "cheese board with some extra."}]}}, {"review": {"des": "This location is legit. It's got about 6 chairs for sitting on if you want to eat your sandwich inside. I went in around 1:30pm. No one else was there and my sandwich was made stat! Got the Pig & Fig I think? <br><br>I've only otherwise been to the Lakeview location. Plenty of cheeses here too. I didn't peruse the meat selection though. I'll be back for lunch again!", "pics": null}}, {"review": {"des": "Great tasting food for sandwiches, snacks and catering. Helpful, friendly staff make it easy to order and go. Not much seating if you're looking to sit and dine.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/lZpGeyyhjSPVMEyMbIaeHQ/348s.jpg", "caption": "Cheese and more cheese"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/0Pn7FGKcpkOiDvHT-3vB5w/168s.jpg", "caption": "Menu with prices"}]}}, {"review": {"des": "I've popped into this artisan cheese/bread/wine shop a few times, and there are a few things you should know:<br>1. They source high quality ingredients, so expect the food to be higher quality as well<br>2. Better quality comes with higher but fair (not crazy) prices and portion sizes are pretty good<br>3. Get the BLTA sandwich. <br>4. Overall,  it's a small shop; plan to take it to go (they do have some seating outside but inside its very limited/awkward)<br>5. Speedy service is never part of the experience. I suspect part of this is purposeful to get customers to look around the shop while waiting. <br><br>Summarized: If you're looking for a high quality sandwich or custom cheese tray to go, and don't mind waiting, definitely try Pastoral.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/2yfQe5KoIc0Y1rC7yr7Zmg/348s.jpg", "caption": "BLTA - huge! And so good!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Fw2xR8VkhJ--z1cOABDz2Q/168s.jpg", "caption": "Smaller shop, with limited seating"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/jlfLK89zghTywJvCppZOLw/168s.jpg", "caption": "Say cheese"}]}}, {"review": {"des": "This meat and cheese shop is just a few blocks away from the Chicago River, and THE PLACE to go for simple French fare. The second you step inside, you're blasted with the stench of aged cheeses. On one wall are a massive display of cheese, meat on the other, and wine on the last. A small cart serving a dozen types of olives sits innocently in the corner.<br><br>There's an impressive lunch crowd standing around waiting for their sandwiches and salads. I will soon be one of the people in it for the $10 lunch deal.<br><br>The No. 1, Sinfully Healthy, is a hearty sandwich boasting turkey, creamy fromager d'affinois, mango chutney, some greens and tangy mustard spread on thick, soft multigrain bread. It's like the better, grownup version of those cold cut sammies I made when I was younger. In this case, I sincerely wouldn't mind having this everyday. <br><br>The No. 4, Blue Pig & Fig, is a splurge sandwich that's petite and unique in flavor. Blue cheese meets serrano ham with fig preserves on a sturdy baguette. <br><br>We took our sandwiches to go and ate them by the riverside. A perfect lunch date!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/XXJ3Ia6VvI8LgtyBhHL-hg/168s.jpg", "caption": "Cheese selection!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/wyKw8xFP1ora4cyqLTHkeQ/168s.jpg", "caption": "No. 1 and No. 4"}]}}, {"review": {"des": "I really love cheese, bread and wine. So what better than a location with all of the things I love ?! I have major OCD/ADD and I was extremely overwhelmed with all the options. I came here with my sister in law who is on the same frequency. The poor guy behind the counter was not having it with us.<br><br>He was very helpful in asking us the kinds of cheese and meats we were into and giving us several different samples. We must have been in there for over 30-40 min. The guy was a trooper and trying to maintain his patience whilst my sis and I clearly had trouble with attempting to adult and make decisions without the \"idk what do you wanna do? -idk what do you want to do\" followed by blank stares and giggles. <br><br>Price was relatively expensive but everything was quality. I was so satisfied with our charcuterie plate when all was said and done. I suggest getting a large baguette as well. So so good. I recommend any of their red wine selection. The combination was perfect. <br><br>Cute place and helpful service for the clueless.", "pics": null}}, {"review": {"des": "Love coming to this spot pre-concerts in Grant Park. I normally pick up food and wine to go, it's perfect! The \"healthy turkey\" sandwich is definitely not (with a huge slab of cheese in addition to the turkey and figs) but it sure is tasty! They don't have any lower-fat chip options so I normally pick up a bag or protein chips or other tasty baked chip to complement my sandwich. The salads are also a good choice and are super fresh and inventive. Docking a star because it seems like they are always understaffed.", "pics": null}}, {"review": {"des": "Solid sandwiches and great service.  This place has great charcuterie, cheese, bread and other provisions.  The prices are relatively reasonable as well for imported and artisanal goods.  I scanned the varied wine selection and found it to be really nice and well priced.  The sandwiches I picked up for lunch were excellent, the French bread is a little difficult to chew through but I'm not sure how you remedy that other than having a softer base.  I think the cheese boards and charcuterie platters look great and I look forward to ordering one.  <br><br>If you're going to the park on a sunny day, it's a great place to pick up some picnic stuff and sandwiches and be on your way.  Will be back!", "pics": null}}, {"review": {"des": "Great downtown wine, cheese, and sandwich shop. Your sandwich will be more expensive than a fast food sandwich shop, it will take a little longer to make, it will also taste much...much better. When the weather is decent they have outdoor seating, which is helpful because the indoor seating is limited. <br><br>Pastoral is probably my favorite downtown lunch option, and my most often ordered sandwich is the salumi piccante. The sandwich includes calabrese salami, podda cheese, giardiniera, greens, and mayo on a baguette for $9. Not too bad for a great quality sandwich.", "pics": null}}, {"review": {"des": "Pastoral was a major let down. We picked up sandwiches and drove to Cloud Gate on a nice sunny day. I was excited for my picnic in the park but unfortunately both of our mediterranean turkey and tuna sandwiches sandwiches were sub par. Tuna was really fishy and hard to eat without masking it with chips. Honestly even panera sandwiches would be better than this.", "pics": null}}, {"review": {"des": "What a great little shop with a great euro wine selection, cheese and deli. I got the Blue Pig and Fig sandwich and a bottle of french Chardonnay. I don't like blue cheese so with their suggestion I substituted the blue cheese with Alpine cheese, similar to guyrere. It was a perfect blend of thin sliced European tasting ham and salty, nutty cheese with a sweet fig jam. I would have given 5 stars but the crusty bread was just a little too crust for me. Its probably because the bread was likely baked in the morning and I got my sandwich in the evening. Otherwise it was a very memorable meal and I would order t again in a heartbeat.", "pics": null}}, {"review": {"des": "Oh my god. Heavenly. When you first walk by this place, you think it's a cheese shop - it is, but it also has some out of this world take out food as well! Was doing some Yelp research when staying in Chicago and this came up as a top lunch choice. Came in around 12:30 on a Friday and there was a heavy lunch crowd. It took a bit long to get my order in / get my food, but it was WELL worth it. I went with the sinfully healthy sandwich - turkey, brie(?), mango chutney, lettuce, etc. Fresh, filling, TASTY. The bread was like a cloud and the cheese...next level. I also had some of the dill chips which balanced all of the flavors out quite well. Needless to say, if you're in the area, you HAVE to go here!", "pics": null}}, {"review": {"des": "I had a hankering for some cheese and good bread.  Visiting for out of town, I did a quick query of wine and cheese shops.  I'm glad I found it.  The wine selection is quite small but appears to be well curated.  The gentleman helping me was very helpful and friendly.   I saw something that I wanted to add on my way out the door so returned to the register.  The nice dude had gone to the back or something.  The lady who then helped me was kind of mean.  I don't know how else to describe her.  <br><br>Ultimately, if you see a dude working the counter, proceed.  If it's a woman who looks a bit severe, pretend you walked in the wrong door and turn around.  The cheese and bread were great though.", "pics": null}}, {"review": {"des": "I used to visit this place regularly when I lived next door but my recent visit with a friend was disappointing. We had a sandwich and a salad and both were mediocre. Will not visit for food again. Maybe for their cheeses.", "pics": null}}, {"review": {"des": "Popped into Pastoral for some wine, cheese, and other nibbles for a hotel room picnic on a rainy day.  This is an intimate space with an impressive array of products/merchandise.  I didn't know what I wanted, and two staff members expertly guided me to products I loved based on a few inquiries.  Take the opportunity to taste cheeses before you buy!  They not only know their product line, they can tell you about where it was made and the people who made it.  They have charcuterie and olives, which I didn't sample or buy because I had already picked up a good supply at Eataly, and fancy pants preserved vegetables and accompaniments like tapenade and pickled okra.  If carbs are your thing, they have crackers and breads.  They have a few retail items, like cheese boards and knives.  I'd love to take one of their slate cheese boards home -- if only I didn't have to make weight when I check my bag at O'Hare.  Their wine selection is solid, and they have a nice portion of it chilled so you can grab and go without having to wait.  They also had some ciders and sodas.  They have both indoor and outdoor seating and will make sandwiches and do catering if that's your game.  Nothing but love for Pastoral!", "pics": null}}, {"review": {"des": "This is by far my favorite gourmet sandwich place.  It is a bit on the pricier side though because they use very high quality cheeses and ingredients so don't go here if you're looking to get filled up for cheap.  I am a huge fan of gourmet French cheeses, baguette bread, and tapenade.  I am never super into their vegetarian/vegan selections so I do a build your own and am always enamored with the sandwich I have.  I love their tapenade, white bean spread, and pesto.  Their frommage d'affinois is my favorite cheese.  Their picnic basket selection though could be better.  The first two don't have meat in them but they're not very exciting for savory-minded people and the last one has the best cheeses, olives, etc. but you can't get it without meat and they won't let you substitute more cheese for the meat, which I think is very lame.  <br><br>Also, when I go there, the service is never too good and they're not very helpful with telling you what you can take a la carte to go.  It is also pretty slow so be sure to wait a bit for your sandwich.", "pics": null}}, {"review": {"des": "Had the Sinfully Healthy<br>Loved the pineapple chutney & slight spice. No need for chips with all this flavor going on. <br>Definitely recommend. <br><br>Great cheese selections (deli) & wines on the shelves.", "pics": null}}, {"review": {"des": "Definitely my kinda spot, amazing location, and helpful service. I like this place because the menu isn't super complicated, they keep it simple, healthy, and delicious. I got the Mediterranean turkey on whole wheat and added Brie cheese. What a delicious sandwich! My friend got the other turkey sandwich on the menu which was also a hit. This place also can put together charcuterie platters which I did for a friends birthday on a boat and they have a wide selection of wines that can be paired. <br>  I love this little hidden gem and look forward to trying the other sandwiches on their menu!", "pics": null}}, {"review": {"des": "I've heard of the delicious legend that is Pastoral and I finally go a chance to try it out! <br><br>The yay:<br>-The sinfully healthy sandwich is SO flavorful and fresh - get it! It absolutely lives up to its namesake.<br>-The bottles drink offerings are interesting - I loved my half lemonade/tea<br>-The side salad is plentiful and light. A nice accompaniment to the sammies.<br>-Staff is friendly albeit busy <br><br>The meh:<br>-We waited almost 30 minutes for our sandwiches to be made...and there were only three other people in the space when we arrived. <br>-The interior is very much designed for grab and go - there are only a few tables to sit down and nosh<br>-Because of the smallish space, it can get pretty noisy if you do decide to eat in <br>-No restroom of any kind <br><br>I completely understand the appeal, especially if you call ahead/order takeout!", "pics": null}}, {"review": {"des": "Delicious sandwiches. I got the #3, Salumi Piccante and it definitely hit the spot. It was basically an Italian sandwich with the added kick of the giardiniara. Honestly any of the sandwiches looked delicious and it was pretty difficult having to choose! I can't wait to go back and try the Blue Pig & Fig sandwich which I also had my eye on!", "pics": null}}, {"review": {"des": "Sandwiches are not great. Baguette was chewy not crisp on outside soft on inside. Customer service wasn't great long wait time. They don't let you know which sandwiches are on hot and cold on the menu so ask. When I asked if they could warm up my sandwich they said no and didn't offer me another option of sandwich. Over priced for the quality! Not recommending and not coming back.", "pics": null}}, {"review": {"des": "For lunch, I built my own sandwich which was very similar to the fig and pig sandwich on the menu. The only difference was that I added greens and substituted the usual cheese for manchego. My sandwich was really good and filling. I shared the cheese platter and everyone in my group really liked the three types of cheeses, marcona almonds, and jam. The service was quick and friendly. The prices were good. There is outdoor and indoor seating. We were able to grab a table for five at noon on a Thursday.", "pics": null}}, {"review": {"des": "Cute little sandwich shop with an amazing selection of cheese and meats, but minus one star for the wait time. <br><br>I stopped by a bit after the lunch rush hour and got the Mediterranean Turkey. The sandwich itself was quite good-- and I'm usually pretty indifferent towards sandwiches-- the pesto, bean puree, and sun dried tomatoes blended surprisingly well in terms of flavor and kept the sandwich from getting too dry. I also liked that the turkey was actual turkey meat as opposed to slices of deli turkey. <br><br>However, the 20 min wait for a cold sandwich was a little ridiculous, so would highly recommend ordering ahead of time.", "pics": null}}, {"review": {"des": "Trying to figure out why this place has such good reviews. My wife and I visited here from out of town with reasonably high expectations. <br><br>There was nothing good about this place. Subway would've been a better choice. The sandwich tasted like something that my 89-year-old blind grandma whipped up for me. <br><br>There is no public restroom. He asked for a water cup and they just handed us a plastic cup with no water. <br><br>We even took our leftover sandwiches and gave them to a homeless guy who refused them because he knew that they were low quality.", "pics": null}}, {"review": {"des": "Was here during a very busy weekday lunch.  Very limited seating.  Three 2 seaters with only 4 chairs.  It is a cute shop filled with sandwiches and even an olive and garlic bar.  Amazing looking cheese selection as well.  The cheese monger gave me a free sample of Gutensberg, shaved with a knife.   Fancy knife skills sir.<br><br>A table of two have been finished eating since before I arrived and are just taking up space.  I know they can see me waiting... (tap foot, tap foot a little louder).  They are deep in conversation about the weather and not looking up.  Nice.  How roooooood.  I might die of low blood sugar and collapse before they move.  Are they from NYC?  lol<br><br>I'm holding onto the Blue Pig n' Fig sandwich I ordered three years ago when I stood in line.  The bread is cold though.  Weird.  When I finally see another spot open up (as I'm hovering at this point, and a another couple sees my anguish and politely gets up and offers me their table before they leave).  The whole grain mustard brings the pungent out of the nostrils!  The saltiness of the Jamon Serrano and that blue cheese tang, marries well with the sweetness of the black tea preserves.  What a thought out combination of flavor.  Some pieces of the serrano are a bit tough, and the bread is harder than I'd like, but overall, yum.  I get up to leave, it's 12:45, and now the line is out the door!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/H2R2wT7ERj0JlpE6o0MVgg/348s.jpg", "caption": "Blue Pig N' Fig"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/w770hHtgzWYZ9HpEPpttMA/168s.jpg", "caption": "My lunch"}]}}, {"review": {"des": "Great place to grab a picnic lunch. We shared a sandwich and the cheese plate and there were zero complaints about the food, service or price. If I wasn't visiting Chicago, I could see becoming a regular here. Though not life-changing or mind-blowing, it's a very good spot for lunch and I'm glad we walked in having had no expectations at all.", "pics": null}}, {"review": {"des": "Pastoral is such a cute place! It perfectly blends the attributes of a quaint wine shop and classy delicatessen with fine cheeses & made to order sandwiches. You can't drink onsite, but it would be a great spot to pick up a bottle of wine and a couple of sandwiches to go! <br><br>I went to Pastoral at about 12:30 on a Friday, and there were several people waiting in line (making the intimate shop feel a little cramped). The place was appropriately decked out in holiday decorations, which added to the appeal of the space.<br><br>I ate the Salumi Picante sandwich. The bread was delicious and very fresh; the giardiniera was unique in the best way; the salumi was good (though tough to bite through on the first try). Overall, it was a great sandwich, but definitely a little pricey - not a mile down the street is a divey Italian deli with a tastier footlong sandwich for the same price. You definitely pay for the whole experience at Pastoral, and I'm okay with that sometimes!", "pics": null}}, {"review": {"des": "One of the best sandwiches I've ever had. <br><br>Salumi Piccante: highly recommend this sandwich to those who like a little bit of heat. One thing to note is the bread is very chewy and will give you jaw a nice workout. It's well worth it though. <br><br>This Sandwich is made up of:<br><br>- Calabrese salami: ground pork salami with red pepper flakes added which gives it heat<br><br>- Podda cheese: this cheese is made using a blend of pasteurized cow's and sheep's milk. The taste of this cheese is like a combination of an aged romano and parmesan cheese. <br><br>- Spicy Giardiniera: an Italian relish of pickled vegetables in vinegar or oil. <br><br>- Mayo<br><br>- Field greens", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/2xH6MHsJ7gIAsg5dhtf2Dg/348s.jpg", "caption": "Salumi Piccante"}]}}, {"review": {"des": "Forgot to give my friend a fork. What was she supposed to do eat with her hands? Oh and their chicken nuggets suck. Theyre as hard as crack rocks.", "pics": null}}, {"review": {"des": "As soon as I moved to Chicago I loved to eat the veggie  farmhouse sandwich, but since 1 year ago the sandwich is very poorly made (see photo), the taste has changed, I believe they have hired new people and totally lost the quality. The service is not good either.", "pics": null}}, {"review": {"des": "I've just had such a wonderful experience at this Pastoral location. I stopped in on Valentine's Day to get some wine to pair with my romantic dinner. I talked to a wonderfully helpful young woman whose name I cannot recall but she was wearing a \"butter\" hat. I explained the dishes I'd be preparing and she sampled some possible accompaniments for me until I found the perfect wine. I also wanted to have a cheese course and she offered her perspective and allowed me to sample several until we found the most perfect cheese. While all of this was happening all of the employees were busily preparing V-day orders. They hardly missed a beat answering my questions while also chopping and arranging cheese on platters. Wine and cheese shops aren't uncommon but this level of customer service is hard to find in the Loop. Training and educating employees is the key to success and this is evident at Pastoral. A lot of other businesses downtown could learn a thing or two about consumer courtesy skills from this place.", "pics": null}}, {"review": {"des": "Rushing back to my hotel to catch my shuttle to the airport I needed to get something to eat fast, and I wanted something delicious, not average.  This place exceeded my expectations.  I ordered #3 Salumi Piccante.  I was in heaven.  The items didn't stay between the bread very well and so it was kinda messy eating on the run, but for those moments I hurried back to my hotel I was lost in the delight of eating my sandwhich.", "pics": null}}, {"review": {"des": "Delicious cheese, sandwiches, and salads! Perfect for loop lunch to go (only a 4 top inside) or for noshing at millennium park. <br><br>Oh and there's chocolate and wine too. Be still my inner fat kid heart.", "pics": null}}, {"review": {"des": "Higher end sandwich shop, also sells lots of products to go, from meats cheese and breads to wine and beer, not a whole lot of space to sit, most people get stuff to go, I had the yelp check in sandwich, and it was very good, it can get crowded and orders might take a while so just be prepared for that, easy to get to, right off the L lake stops, plus it has an olive bar", "pics": null}}, {"review": {"des": "Pastoral makes going from work directly to Ravinia easy! They offer three picnic options at $25. With the addition of cheese and wine it makes a nice picnic option that can be picked up at the French Market at Ogilvie on your way north. We ordered the savory picnic. It was a full baguette with Serrano ham, salami, pickled vegetables and a few tapandes. We added on a delicious cheese spread and it turned to be quite a meal for two people. Next time I have a weeknight Ravinia concert I'll use Pastoral again for an easy but Ravinia worthy dinner option.", "pics": null}}, {"review": {"des": "Lovely gourmet wine, cheese, and sandwich shop that perfectly fit the bill for a gourmet sandwich to go. I had the Blue Pig and Fig which was perfectly delicious. I do wish the assistant had put on gloves when he was assembling my sandwich, or at least washed up first. I didn't say anything because I was in a hurry and also too numb from the polar vortex cold of the Chicago winter (it was January when I visited). Oh well. At least my microbiome benefited from the experience, since I consumed that sandwich and suffered no ill effects.", "pics": null}}, {"review": {"des": "I like Pastoral. The sandwiches and deli are great. They have a nice selection of wines. Great olive bar!<br><br>However, this place can be sooooo excruciatingly slow. And if there is a line with more than two people, forget about it and turn right back around.", "pics": null}}, {"review": {"des": "I had an amazing sandwich at Pastoral when I was downtown for a training last week. I was kind of sick of the typical chain places in the loop, and so I decided to try Pastoral for lunch as it's something different. It's def more of a grab and go place bc it's super small, but it's fun to check out the wine and cheese offerings when you're in line. I got the mmmm melt, which has cheese and chutney and mustard. I don't know if it's bc I was super hungry, but it was truly one of the best grilled cheese sandwiches I have had. Stop by for a quick lunch when you're in the area!", "pics": null}}, {"review": {"des": "Saturday, 11:30 AM.<br><br>Quickie:<br>+ Food quality<br>+ Service<br>+ Hygiene<br>+ Menu variety<br><br>And then...?<br>Pastoral has delicious artisanal cheeses and makes gourmet sandwiches that are on fleek. <br><br>**********<br>Stuffed my face in:<br>1. Cali Chevre<br>    + Interesting mix: nutty almond and avocado's cream softens the bite<br>2. Mediterranean Turkey<br>    + White bean puree trumps other condiments here<br><br>Constructive comment:<br>*Compost option", "pics": null}}, {"review": {"des": "I'm not sure how I stumbled upon Pastoral (yelp? friend recommendation?), but I'm glad I did. They have a deli, fresh made sandwiches and cheese boards, and a wonderful selection of wines! I frequent this place often since it's steps out of my route home when I decide to take the pink line - sadly, I lose every frequent sandwich card I get, but if you're not prone to misplacing things like me, be sure to get stamps every time you buy a sandwich to work up to a free one!<br><br>I've tried the caprese (once) and the Farmhouse Veggie (every.single.time)!! Don't get me wrong, the caprese was still VERY good, but I feel like I can get one anywhere, whereas the Farmhouse veggie is a different combination of flavors. The first time I tried it, I almost asked for them to hold the apple, but it provides a great crunch and sweetness to the sandwich. What I forget to tell them that I regret every time is to go easy on the mustard - they LATHER it on and it is extremely overpowering. I would recommend asking them for light mustard if you get this (again I'm forgetful and don't follow my own advice - hopefully I'll remember next time).<br><br>Their bread is delicious - they sell their day old bread for 50 percent off! I haven't bought any cheeses or olives, but will likely leave with some one of these days :)", "pics": null}}, {"review": {"des": "Let me set the scene for you: My mom and I walk into a small, clean, yet completely empty store (besides the 2 men behind the counter). We order a blue pig n' fig and grant park grinder. While paying, the cashier asks for a name for the order so he knows who to give it to when it's ready (we're the only people here). While waiting for our sandwiches we browse the selection of cheeses and antipasto items. About 5 minutes later the sandwiches are ready and the same man who took the order says \"Suzanne\" while scanning the store looking for someone to answer to that name. Did I mention we were the only ones there and this is a small place? <br><br>Besides the odd and comical experience, the sandwiches are great. Fresh bread and high quality meats and cheeses. The blue pig n' fig was definitely the standout, so I highly suggest you order this if you're a blue cheese fan. This is more of a to-go place in my mind, but there are a few tables inside and outside. Millennium park is just around the corner, so this is a great place to grab a sandwich to-go and do some serious people watching at Millennium Park.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/-6nHbjks-qosk-y19zjAAw/168s.jpg", "caption": "Grant park grinder"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/A5g8xxxNWeQUkpdPu0vwMQ/168s.jpg", "caption": "Blue pig n' fig"}]}}, {"review": {"des": "I swung in to Pastoral for a quick lunch while on a solo shopping binge. I wanted something quick, and light so a sandwich fit the bill perfectly. There was certainly no lack of choices so my decision to go here was a combination of Yelp reviews, plus I was standing 10 feet away when I looked it up. <br><br>In terms of service and set up, it's probably more like a 2.5-3 stars. The staff was polite enough but otherwise seemed not terribly interested in the customer service aspect. And there is literally one table with 4 chairs, so you either need to take it to go or hope to snag a seat (and that others at the table don't mind sharing with a stranger). <br><br>That said, it seemed like their main focus is quality products and in that sense it's 5 stars easy. The selection of to-go cheeses, breads, sides, meats, and more was very decent. The deli menu was interesting as well; lots to choose from and a good mix of classics and not-so-classics. I was torn between The Southpaw (pimento cheese) and tuna salad so, at staff recommendation I got tuna salad topped with pimento cheese. A crazy combination, but it worked. It was a nice size, too; I saved the second half for an afternoon snack. I also got a side of potato salad which left a lot to be desired; very small portion and had a slight metallic taste to it. <br><br>I'm an out-of-towner so I can't say this is THE place to get a sandwich. But I think any would-be diners would be completely satisfied eating here.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/s3MEmZA75SenfIwICpUtHQ/168s.jpg", "caption": "$3 for 7 cubes of potato, mixed with the usual potato salad jazz, plus a faint taste of metal. Weird, and so not worth it."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/PuvHMRJwONGygb1XhFVYxA/168s.jpg", "caption": "Tuna salad topped with pimento cheese. Fat kid alert! But so good."}]}}, {"review": {"des": "Really like their sandwiches, and I always gain an appetite for fine cheeses and meats when I'm there.", "pics": null}}, {"review": {"des": "Pastoral was chosen for our work's monthly birthday lunch. I ended up ordering a custom sandwich on a french baguette with the prosciutto bacon, mayo, lettuce, cucumber, and red onion.  The total ended up being $5.50 which is less pricey than their other sandwiches and salads.  I though the prosciutto bacon was pretty good but there was barely any on the sandwich.  However, my biggest disappoint was the bread.  It was very hard and EVERYONE that ordered a sandwich agreed that the bread gave their mouth a work out.  Since the bread was so tough, everything was falling out of the sandwich.", "pics": null}}, {"review": {"des": "Disappointing... <br><br>My sandwich was supposed to have fig, Dijon, Gorgonzola and jimon iberico Serrano ham. <br><br>I think they forgot the blue cheese? <br><br>Bread was hard as a rock<br><br>The only delicious part was the Serrano ham. <br><br>I love my blue cheese and that was missing!", "pics": null}}, {"review": {"des": "Cute little shop with a great selection of cheese, wines, and sandwiches. When visiting Chicago, I decided to try Pastoral out. From the breadth of choices, I decided to go with the Sinfully Healthy Sandwich.<br><br>Sinfully Healthy Sandwich: the name says it all. You feel guilty that it tastes so good, yet happy that the ingredients are semi-healthy. Roasted local turkey, Fromager D'Affinois, mango chutney, whole grain Dijon mustard and field greens on cracked wheat bread. A pretty standard sandwich, but the main standouts are the Fromager D'Affinois, which is an interesting thick cheese that's most closely compared to brie, and the mango chutney, which gives the sandwich a sweetness that works very well. The mustard also gives it an extra kick. Surprisingly, the flavors really blend well together. The bread was fantastic too.<br><br>I've heard great things about the Blue Pig N' Fig, so if I've ever back, that's what I'll try next! So glad I was able to make a stop here.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/l3yvKBOuE2vsChVwwYKwuA/348s.jpg", "caption": "Interior (cheese selection!)"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/F7-yyOaORnwXvl_6Poiokw/168s.jpg", "caption": "Interior (cash register)"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/g-6DLOqRIZ4kV3-0r7eiwg/168s.jpg", "caption": "Interior (of the wine selection)"}]}}, {"review": {"des": "The food is outstanding, but they can NEVER get the order right. Often we'll order at the office, and I think 9 out of 10 times they forget a sandwich, mislabel something or put the incorrect ingredients on a sandwich. It doesn't matter if we take out or go through Grubhub, something is always missing or wrong. Sadly I think we'll have to find a new lunch spot.", "pics": null}}, {"review": {"des": "I got the Harvest salad. It was pretty tasty - though nothing outstanding. The prosciutto was crispy (more like bacon), and I wasn't a fan of the shallot confit - too strong. It didn't come with bread so I ordered 1/3 baguette on the side. The staff there is super friendly, and the gift products are beautiful. I would come back to get a sandwich (they look better) or just pick up some nice cheeses!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/N6D_WxiOgLm6c_sg6bfwIQ/348s.jpg", "caption": "Harvest salad (with Poddo cheese instead if bleu) and a side baguette"}]}}, {"review": {"des": "I'll be glad to update my review if this is fixed/addressed, but as of right now, as dramatic as this sounds, this place needs new management and fast before they run it into the ground. <br><br>Obligatory Yelper \"I come here all the time\" statement. I actually do. I come here twice a week to eat salads and stuff. I've been through countless punch cards (nobody offers them anymore unless you ask.) I can pinpoint exactly when this place started going downhill, and that's when they tidied up their menu. Of course I was upset to see the Mediterranean salad was no longer offered, along with a few choice sandwiches, (and that you if I wanted to substitute beets with Tuscan white beans, I would still be charged extra) but I got over it. These are still the best salads within office walking distance even though the wait times have DOUBLED in the past couple of months.<br><br>My coworker just marched in and swore off Pastoral forever because he had to wait a whopping 20 minutes, to which I said whatever, I waited for 25 yesterday. <br><br>Here's what's going on:<br><br>I've been eating mixed greens that haven't been cut/prepped. Look at the photo I posted. Stems as long as spaghetti. Cut your damn greens so I don't have to gag on the stems. <br><br>Something is always wrong with my order. I don't want a bag, I get a bag and charged for one anyway. I want a baguette. There's no baguette. They forgot the dressing. They forgot the napkins. <br><br>The other day was my breaking point because I'm not a diva and I diligently check now to make sure they didn't forget anything. I decided to duck in at 12:50 to beat the lunch rush. I was the only other person in there. A man ordered ahead of me. He got his sandwich immediately. I wait ten minutes for my salad. Nobody feels like making it. I hear someone say that my name wasn't written on the ticket, but I guess that's enough to put it off. I try to make eye-contact with the woman who seems to be in charge. She ignores me even though her cheese tray is finished. Then the lunch rush starts. Now I know I'm in for it. I just stand there flabbergasted as people who ordered 10-15 minutes after me get served. I'm not sure why my ticket was missed/ignored. I'm desperately trying to get someone's attention but people are standing around and goofing off or just blatantly ignoring me (I'm looking at you, lady in charge!) FINALLY, it's no joke, 1:15 and somebody hands someone else my salad, but luckily he notices and says that she got his order wrong. Somebody hands me my salad and I get to leave. After waiting.  For twenty five minutes, even though I ordered when it was completely dead. <br><br>Management: take note! You're losing customers!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/DAqQY7j0TW6wZnyt1Wfp8w/348s.jpg", "caption": "AAAAAAAAAHHH! CUT YO GREENS!"}]}}, {"review": {"des": "Great place to come for a romantic wine and cheese night!  Pretty limited seating but it's great to get sandwiches, bread, and cheese to go and sit out by the bandshell at Millennium Park for a picnic!  Some of my favorite sandwiches are the Club Nuovo (with tomato, turkey, prosciutto bacon, mayo, and field greens) and BLTA (with bacon, tomato, avocado, and field greens).  The bacon is deliciously salty and balances out the other flavors and the baguettes are always fresh.<br>The staff are knowledgeable about their cheeses and wines so they can help you choose if you have an idea of what kind of other cheese you like.  I'd definitely recommend the triple creme brie if you're a fan of brie!   They also always have fresh bread that pairs with your bread!  And don't forget the wine!<br>One thing to note is that they are a little slow in making sandwiches since there's only one person who does it so you should bear that in mind if you're in a hurry.", "pics": null}}, {"review": {"des": "Customer service goin' down the tubes. Price you pay isn't much worth it anymore. This place used to be a go to, now it might be a pass up.", "pics": null}}, {"review": {"des": "I live really close to this shop and only recently discovered it due to office catering Love the sandwiches here.  I ordered a San Danielle sandwich that includes prosciutto, mozzarella, roasted tomatoes and pesto, loved every bite.  Everything came together perfectly and the bread is great.  Will definitely be making trips to the shop for more sandwiches and check out other offerings.", "pics": null}}, {"review": {"des": "I decided to try the blue pig and fig. If you don't like mustard, make sure you let them know. I happen to love mustard, so it complimented the sandwich well. The bread had a nice crust, but was moist in the middle. The service was prompt and friendly. Happy I beat the lunch crowd because it was really busy.", "pics": null}}, {"review": {"des": "Absolutely Amazing! I love the cheese and meat selection. Everything is made to order, even cutting the cheese off the block. I love gourmet sandwiches and this place defines that. I had the Blue Pig N' Fig sandwich. The fresh baked bread with the perfect crunch and fluffy dough, the fresh Serrano meat with blue cheese and fig spread all topped with greens is a bite to remember.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/IQzG_lxw1Ob8eLcWJJ-OMQ/348s.jpg", "caption": "Blue Pig N' Fig ($10.50)- worth every penny!"}]}}, {"review": {"des": "Pastoral has pretty good food. Their sandwiches are delicious. Some of their other things are worth trying as well.", "pics": null}}, {"review": {"des": "Train wreck!<br>We went here the Saturday of Jazz Fest and things were a mess. We got there around 5:30 so I wasn't really surprised that they were out of baguettes but they were also out of some type of ham and mayo! They also said they were understaffed so there'd be a wait. There were about a dozen or so people in front of us and there were four employees there so we assumed things would move fairly quickly. We didn't expect 33 minutes to make our sandwiches! I would think with Jazz Fest going on they would have had more staff there and would not have run out of ingredients. This was just a very aggravating experience.", "pics": null}}, {"review": {"des": "I stumbled across Pastoral completely by accident -- and what a happy accident it was!<br><br>I was strolling back to my hotel after a morning in Millennium Park, when I felt hungry and peered into this cute gourmet food market.  A quick search on the Yelp app showed nothing but rave reviews, so I decided to pop in for lunch.<br><br>You know what?  Those rave reviews are 100% on-point.  The selection of gourmet food items is mind-boggling -- from cheeses to cold cuts to olives to wines to just about anything else you'd need to arrange a high-end picnic.<br><br>The real draws at Pastoral are the sandwiches.  I ordered a \"Sinfully Healthy\" sandwich -- turkey, Fromager D'Affinois, mango chutney, Dijon mustard, field greens, and cracked whole wheat bread -- and took a seat on the patio.  This sandwich was easily one of my favorite sandwiches of all time.  The flavor in each bite was huge.  I was desperate to get every last bit of Fromager D'Affinois and mango chutney in my mouth.<br><br>It's really just icing on the proverbial cake that this sandwich also happened to be big, filling, healthy, and inexpensive.  (You might save a few pennies by going to the Subway down the block, but your conscience will never forgive you.)<br><br>Next time I'm in Chi-town, I'm coming back to Pastoral with a basket in tow.  I can imagine the perfect Millennium Park picnic right now...", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/aFa4lHs_qXDkW6eBw5V88A/348s.jpg", "caption": "Sinfully Healthy sandwich"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/SQL4BupP6h9aDcnL2_gVqA/168s.jpg", "caption": "more olives"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/PkHXyg3uIGVxxep8z8owtw/168s.jpg", "caption": "olive bar"}]}}, {"review": {"des": "We stopped by this place after reading favorable reviews. The Sinfully Healthy Turkey Sandwich looked quite tasty on Yelp.<br><br>Service was friendly when we arrived in the later morning. We ended up ordering the Sinfully Healthy and the Club Nuovo.<br><br>The wait was quite long for two sandwiches. Most of the staff was working on large corporate orders, which seemed to slow down the process.<br><br>The sandwiches were mediocre. The Sinfully Healthy was filled with the intense fruit preserves and heavy cheese, which overpowered the rest of the meal. The  prosciutto bacon in the Club Nuovo was really dry and crunchy-- in a less than pleasant way.<br><br>Overall, we were a little disappointed with this spot based on the favorable reviews.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/xdnI8PvZZ6fyFx1U4PspNQ/168s.jpg", "caption": "\"Sinfully Healthy\" Sandwich"}]}}, {"review": {"des": "This place has some awesome sandwiches. I got the salumi piccante, and I highly recommend it. Ya a little spicy but the flavor is amazing. Veronica is super knowledgeable about cheese and they have a great selection. I recommend this place for anyone doing some cheese shopping or looking for a delicious sandwich", "pics": null}}, {"review": {"des": "After reading some stellar reviews on Yelp, I decided to try Pastoral out for lunch one weekday. I'll skip the details around their extensive cheese collection, and gift basket offering since that has been covered by several others. I'll jump right into the review of my sandwich. When we lived in LA, we ate some of the best sandwiches at Mendocino Farms and I went in expecting similar. Sadly, this doesn't come close.<br><br>I ordered the smoked salmon sandwich (forgetting what it's called on the menu). For $13 and change before tax, I was expecting a phenomenal sandwich but I was totally disappointed. Here's why. <br><br>This is a cold sandwich, not a panini pressed. I am not sure if they offer hot sandwiches but this would certainly taste a lot better if it was served hot. <br><br>Although the salmon was fresh and smoked in house, the quantity was very little. The bread is about 7\" to begin with, so not that long and it wasn't layered up. Subway adds more meat in their sandwiches and they don't cost $13! With chips, drink and tax, I was looking at a $20 tab. <br>PS: there are other sandwiches that are priced less.", "pics": null}}, {"review": {"des": "As the final leg of Chicago trip was wrapping up, Tiff and myself decided to grab a sammie as we took the train to the airport. We look up local sandwiches shop and settle on this gem.<br><br>Pastoral is first and foremost a deli and they have a wide varieties of meats and cheese decked out throughout the store. Stepping into the property, you can feel the rich cheese as it wafts your nose. They have an excellent selection of wine, cheese, and meat. Luckily there was no line as it was mid afternoon on a Tuesday.<br><br>We decided to go with the Salumi Piccante, a rich sandwich top with Calabrese salami, podda, and spicy giardiniera. <br><br>This was perhaps the BEST sandwich I ever had. With each bite, my mouth was bombard with rich umami taste. And everything taste HIGH quality. Simply mindblown. The sandwich had quite a kick to it from the salami and giardiniera. It was offset by the rich taste of the podda cheese and leave you begging for more.<br><br>And this was about an hour after we order the sandwich as we ate it while waiting for our flight at the Midway. This is definitely on my places to go back when I come visit again. :)<br><br>TL;DR - Amazing sandwiches with high quality ingridents", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/8zpUR4DYo2PBEkphn4FPoQ/348s.jpg", "caption": "Salumi Piccante"}]}}, {"review": {"des": "Well that was hands-down the best sandwich I've had in a long time!!! <br><br>It was called Cali- Chevre... an odd combination of celery, onions goat cheese avocado and almond butter... Yes I said almond butter!!!  Oh,  but it was so good!!   They had so many great vegetarian and a couple vegan options as well. <br><br>This is such a cute spot, great for a quick sandwich on your lunch break, or to grab some specialty cheeses. My only complaint, is I ordered a combo and they forgot to give me my cookie :,(", "pics": null}}, {"review": {"des": "The fact that this place exists just makes me really happy. Really cute interior, fantastic wine and cheese selection. I love their sandwiches most of the time, but on my last visit I tried the Simple Pig and did not enjoy it. The saltiness of the terrine and the dijon mustard were just too much for me. They are always offering samples of cheeses though, and all the employees actually know exactly what they're talking about if you have questions, which is awesome. <br><br>Ideal place to pick up a sandwich/bottle and head to millenium park to enjoy it, but they don't have a lot of seating and you cannot legally consume their alcohol on site.", "pics": null}}, {"review": {"des": "I get this catered a couple times a month to work. I get triggered when someone says \"Pastoral\"", "pics": null}}, {"review": {"des": "Crazy good sandwiches! Yes, the wait time is around 30 minutes, because everybody in front of me try to order more than 2 subs, and it's a labor day weekend.<br><br>When we talk about great sandwich, they need to have a good presentation and a good taste. And Pastoral has it all. They aligned the sandwich so well that eating it made me feel guilty. Also, the bread was layered with some kind of sauce, and then whole grain Dijon, and then arugula probably, and then ham. Every bites had dimensions of tastes: first sweet, second sour and then spicy! They also provide artisan drinks with reasonable prices. <br><br>Despite the long wait, I totally loved this shop. That sandwich was one of the best sandwiches I've had. I wish I could take some bread and cheese to know more about the store, but I'm travelling light. So maybe next time I visit Chicago.", "pics": null}}, {"review": {"des": "Super fresh and tasty sandwiches!<br><br>My friend and I came here looking for a quick bite to eat. It was around 2pm so we didn't have to wait very long and were able to sit in the limited seating they had inside. I ordered the sinfully healthy sandwich and my friend ordered the health nut salad. Portions were good for the price!<br><br>Great option for an affordable lunch if you're in the area!", "pics": null}}, {"review": {"des": "Purchased a sausage that was already wrapped in the light brown butcher's paper in the glass display. Couldn't see the actual meat but the ppl said it was fantastic. Bought it and Put it in my fridge. A few days later when I unwrapped the butcher's paper it was covered in green mold and smelled like a month-old aborted fetus. I legit couldn't believe it. I called them, manager picked up, told him about the mold and smell and he nonchalantly goes \"sure we can fix that for you just come on down!\" WHAT THE FRICK. This is a major health code violation and they should be ashamed that they're charging this much ($36.99 A POUND!) for something that can make someone terribly sick. Never going back again. Not a single staff member was shocked when I went back to get my money and I told them I had moldy meat. You guys should be ashamed of yourselves.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/LOLLA9qEqIYzWS7JhiCD9g/348s.jpg", "caption": "Green mold at the tip a few days after purchase. Was in my fridge the whole time."}]}}, {"review": {"des": "This is Chicago in the summer time, I know who own the place and i love the concept they have, but seriously on the busy summer days where we stopped by to pick up a few bottle of wines on our way to millenium park concert, it took us half hour for us to pay waiting in line with people that can't decide what sandwich to get , can you step it up please. The cashier seem high on something", "pics": null}}, {"review": {"des": "I love the sandwiches but the website is not user friendly - where's an easy to locate menu of the sandwiches!!!!", "pics": null}}, {"review": {"des": "I've had sandwiches from here that are tasty and reasonably priced.  <br><br>We recently got one of their picnic baskets for a show at Millennium Park.  It was a total bust.<br><br>It was $43 and while it may have been decent quality it felt a lot more like it should have cost half as much.  Kind of a real let down and not what I would have expected from them given their other offerings.", "pics": null}}, {"review": {"des": "V good. Got the Club Nuevo for lunch and the pastrami on it was amazing. Good bread too. It takes a bit for them to make though. Luckily there's lots of things to look at while you wait.", "pics": null}}, {"review": {"des": "This is a sandwich shop in addition to a cheese and wine shop. The fare is fantastic as witnessed by the long line out the front door every weekday at noon.<br><br>The Nutty Gardner is my favorite (vegan) but the Cali Chevre is also amazing (goat cheese, almond butter, avocado, celery and onions). There are three other vegetarian choices and then about a dozen incredible deli specials.<br><br>I rate this high and so do most other regulars who eat here. It is a real gemstone just west one block off of Michigan near the Virgin Hotel.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/_SB0kkx1xGKL8lDm18shig/348s.jpg", "caption": "Nutty Gardner (vegan)"}]}}, {"review": {"des": "Meh.  It's nothing more than a basic deli -  which,  to be sure,  isn't a bad thing -  but it's nothing special,  and it's overpriced for what you get.   We had the Grant Park Grinder,  which is a boring Italian sub, with boring meats,  and not much of them,  though the mozzarella was fresh, as well as a drizzle of balsamic and olive oil.   Distinctly meh.<br><br>Absolutely not worth waiting on line for this average deli.", "pics": null}}, {"review": {"des": "Great way to mix it up for lunchtime in the loop! Gourmet, fresh sandwiches. <br><br>Came here for lunch after reading many helpful yelp reviews. Everything on the menu actually sounds delicious, so I was having a hard time narrowing my list. I decided on the Blue Pig N' Fig - it did not disappoint! The ingredients are fresh and even though it's on a baguette, it's a very light sandwich. (I'm actually still kinda hungry...) The dijon, fig, and bleu cheese complement each other perfectly. I'm drooling as I reminisce. <br><br>Best advice I read from other yelpers: CALL AHEAD. The store is pretty small and the line of people ordering vs waiting for food seems pretty chaotic. Luckily, I zoomed to the pick-up register and my food was already prepared for me. (I called at noon and it was ready by 12:15 pm.)", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Fhm01iL-cfyt0A5GfgEElg/348s.jpg", "caption": "Blue Pig N' Fig"}]}}, {"review": {"des": "/TL;DR<br>Quaint cafe and meat/cheese shop. Seating is hyper-limited inside. There are some outside though that you can enjoy on one of those rare Chicago days that it's nice enough to be outdoors. ;-)<br><br>/ATMOSPHERE<br>Quaint. Not much really except dead space and counter space. Smells amazing in there.<br><br>/FOOD<br>Meats and cheese. If I recall, you can get a charcuterie. I went with a couple of sandwiches. Both were yummy.<br><br>/SERVICE<br>They sure can take an order. They were spot on with running my card and handing my order over the counter to me.<br><br>HOW TO READ MY REVIEWS:<br>1 Star - Does not approach edible. Enter at your own risk.<br>2 Stars - If I'm in the area, I'd pick something else.<br>3 Stars - I would stop by if I happen to be in the area.<br>4 Stars - I would pick this place out of other places nearby.<br>5 Stars - I would go out of my way to dine here.", "pics": null}}, {"review": {"des": "Came here out of the blue for lunch. I hate to give such a delicious sandwich three stars but the service was more NY than Chicago.<br>We came in on a Sunday.. I think the guy at the counter was still hung over, how dare we?! He then gave us the wrong sandwich ( I think he had no choice but to snap out of it after this) the place fills up fast with many people commenting about their amazing selections, no doubt a legit sandwich spot.<br><br>I had the blue pig and fig, also tried the San Danielle. Great selection of drinks and I would definitely recommend to anyone who is around and wanting a delicious baguette sandwich, tres Parisienne! <br><br>I will definitely be back to try some of the other cheesy delicacies I spotted, I am confident the weird service was just a fluke! <br><br>Great alcoholic beverage selection, I plan to check this out some more also.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/V23dDd9z_6TEmgB7nOhY9w/348s.jpg", "caption": "Blue pig & fig"}]}}, {"review": {"des": "Best cold cut sandwich I've had!!! Been looking forward to coming back ever since I left this town. Fresh and tasty ingredients. Love it", "pics": null}}, {"review": {"des": "$11 bucks for a sandwich--I had one request--no mustard.  And they went ahead and put it on there anyway.  This was at 11 in the morning--no one in line so there's no way being super busy was an excuse.  Just poor service.", "pics": null}}, {"review": {"des": "Cheeeese, marvelous cheeeeeese! Isn't that the jingle that the American Dairy Farmers would have us sing? I guess this cheese is a slice more \"fancy\" so I just sing louder.  I want them to hear me in the hills of Europe where cows and goats and sheep are currently working on my future forays into cheese-tasting bliss. <br><br>Anyway ~ this Pastoral, like the one in French Market ~ well, you have to go looking for it on your first try. It's tucked in just east of Wabash on Lake, on the south side of the street.  I know the map can tell you that, but now you've got the verbal too. (It's better than me singing, right?)<br><br>My interaction here was so pleasant. I sampled a couple of cheeses, but ultimately went with a Taleggio. The cheesemonger and I had a great chat about the tastes of different types of milks, how to serve cheese (you will quickly note that if you take it from the fridge and let it sit, the flavors on most cheese develop quite nicely and quickly, generally speaking.) He also commented on the \"extra mold\" I'd found on my Wabash Cannonball from the French Market Pastoral. It's true - you just slice it away - consume as usual if it's a basic looking greenish mold. WARNING warning: BLACK molds or any fancy COLORS (red, yellow, orange) are ick - don't \"eat around it\". Of course, I recommend you pop in and have this chat on your own. Get a sandwich while you're here!<br><br>The place got pretty packed fairly quickly - even on an off hour. There's only a couple of tables - located centrally in a small space. It's not looking like a place to hang out for an hour or so. <br><br>Note: They don't have any tap water available (only bottled, for purchase).  I prefer to spend my money on cheeeese.  (or olives, charcuterie, beer and/or wine...all of which you find right here!)", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/W6T8dPhZYbFF0lzuAr0clQ/348s.jpg", "caption": "Taleggio to go"}]}}, {"review": {"des": "Ordered the bridgepork and boy was it amazing. Nice thick slices of cheese and plenty of meet to satisfy a hungry customer. The place is a little pricey so my only knock would have been a bit larger sandwich for 10.50. See my picture to see exact size but a little closer to 8 inches would be nice. <br><br>When I am looking to treat myself/get a bit of an upscale sandwich, I have my place!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/tFNH9dUsECU75e_8d0K3tw/348s.jpg", "caption": "Bridgepork, about size of a regular potbelly sandwich. So good!!"}]}}, {"review": {"des": "2 sandwiches to go: Mediterranean Turkey ($7.99) + Club Nuovo ($7.99): Both roasted turkey & on a baguette<br><br>Mediterranean Turkey:  love the creamy pesto taste<br>Club Nuovo: bigger and more turkey than the mediterranean<br><br>Out of the two, I'd go for Club Nuovo. It's a perfect balance of greens, turkey, and bread and is much more filling. Go for the other if you love pesto and sundried tomatoes.", "pics": null}}, {"review": {"des": "Excellent cheese shop and deli with a large selection of wines and some craft beers. I had the Bocadillo de La Mancha, which had Spanish ham and manchego cheese, along with some spicy mustard, on rustic bread. The cheese in particular was a standout, and the sandwich, which was about $11, was enough for a meal itself. Everything here looked great, service was friendly and you can get it to go or sit inside or on the sidewalk. Great little spot in a touristy part of Chicago lacking in local flavor.", "pics": null}}, {"review": {"des": "Really like what Pastoral is all about. Chacuterie, wine,  and good sandwiches. I had the Blue Pig and fig which was delicious. The grain mustard with the blue cheese and prosciutto complemented each other really well. Wait times at 11am on Friday was around 40 minutes which was a little much for just a sandwich.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/8ev6p90KT_A-PumQhTm8EA/348s.jpg", "caption": "Blue Pig and Fig, Habenero Chips and a Curiousity Cola"}]}}, {"review": {"des": "seriously the best salads ive ever had! I've had the health nut, the Mediterranean and the heartland. All of them are delicious. I especially love the spiced almonds and marinated beans they use. Staff working are always super nice as well.", "pics": null}}, {"review": {"des": "Generally creative application of mostly quality ingredients suffered because my French bread on the Blue Pig and Fig was so tough.  I ate there on a Sunday afternoon, so perhaps they were using bread leftover from the week.  Hopefully that was a one off, because it was otherwise fantastic.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/inthVTddzJFdJ0yzpqmxXw/168s.jpg", "caption": "Blue Pig and Fig"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/cwe3Re4IVwe3LoO0eEyLqA/168s.jpg", "caption": "Sinfully Healthy"}]}}, {"review": {"des": "Visited Chicago with my bf for the weekend. We came here for lunch since it was the closest thing to us.<br><br>I ordered Blue Pig N' Fig and the BF ordered Salumi Piccante. I saw Blue Pig N' Fig because it wad being made in front of me and thought it looks pretty good. Ordered to try.<br><br>So glad I did because its really good. The dryed ham, fig with black tea preserved and blue cheese compliment each other perfectly. The sandwich was also spread with whole grain dijon mustard.  This added an extra kick. I wish they lightly spreaded the sandwich as some parts were overpowering.<br><br>The Salumi  Piccante just okay for me. Nothing special.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Vyn06f3Q8jc3_doNhvIQDw/348s.jpg", "caption": "Blue Pig and Fig. So good!!"}]}}, {"review": {"des": "AGAIN, Steph M. knows whats UP in Chicagoland. After a long walk in the city, we were ready to stuff our faces and meat+cheese+fruity spread sounded awesome. It was a little tough to make a decision on which sandwich but I ended up with the Sinfully Healthy Sandwich. We sat down outside and enjoyed the warm breeze. This sandwich had a good amount of protein, delicious soft cheese and a fruit spread that completed the entire thing. I think any sandwich with a soft cheese should have a fruit spread like pear or fig. We split some dill pickle kettle chips too, and those are always a favorite. Highly recommend!", "pics": null}}, {"review": {"des": "I wanted this to be great, and it should have been. Came in for a snack as well as some sandwiches to take with. Was very clear that I was looking to make a small cheese plate for 2.  Lackluster service and the staff was not happy about the small portions requested. Cheese not labeled or priced - how can you understand what to ask for?  Sandwiches also not great - my make your own had mayo which was NOT asked for, the bean spread was almost non-existent and there was barely any turkey. If I wanted bread for my meal, I would have gotten a loaf of bread. Actual food components were great but not sure I can justify the expense to return.", "pics": null}}, {"review": {"des": "Really, really fantastic sandwiches. Some of the best I've had in a long time.<br><br>The shop itself is also a great to pick up cheese, charcuterie, and other odds and ends. <br><br>I had the \"Salumi Piccante\" - Calabrese salami, Podda, locally made spicy giardiniera, mayo and field greens. Despite it being the lunch rush, it came up quickly and was $9.25. <br><br>The meat was great quality, the cheese was awesome, and the accompaniments added great, balanced flavor. The bread was crispy (almost overly so), but full of flavor. My wife got a sandwich too, I forget which kind, but she liked hers also. <br><br>Great place, and I would and will return!", "pics": null}}, {"review": {"des": "Based on my last two visits, I will say that while I still like the sandwiches here, the service level has definitely deteriorated. They seem to have lots of people working there, but only one person can ever be at the register? Even when there is a line all the way to the door? And that one person at the register could not have been more incompetent today. He took forever with each person's order taking and then even called one guy back while I was trying to give my order, because he needed the guy's credit card number again. This cashier never said, \"Please,\" \"Thank you\" or \"You're welcome.\" He didn't seem to enjoy dealing with people. I don't pay $9 for a turkey sandwich to be treated that way. The last time I was there, it was the same way and when I ordered tomatoes on my sandwich, I was given roasted tomatoes without being told in advance about it. Just seems like the courtesy and appreciation for my business is gone or forgotten and that is really too bad.", "pics": null}}, {"review": {"des": "A word to the wise - avoid the wait by calling ahead.  The shop is small and can get very crowded during peak lunch times.<br><br>An old co-worker and I were supposed to go to lunch, but she canceled on me so I had to scramble for other options.  I remembered Pastoral and their wonderfully delicious Sinfully Healthy sandwich.  One nice advantage to my new building is that it's only a 0.4 mile walk to Pastoral making it easier for me to access their delicious food during my hour lunch break.<br><br>I called around 1:00 on a Friday afternoon and was told that my order would be ready in 30 minutes.  I left my office at around 1:20, showed up at 1:30 and my order was ready and waiting.  <br><br>Paying for my lunch was quick and convenient.  There's a register by the cheese counter closest to the window.  You grab your drink out of the cooler next to the one with the wine.  The cookies are by the register where you place your order and there are chips on a small shelf by the window.  For frequent Pastoral diners, they have a punch card where you get one sandwich or salad free when you buy 10.<br><br>The Sinfully Healthy is, hands down, one of the best sandwiches I've ever consumed.  It comes with local roasted turkey, Fromager D'Affinois cheese, mango chutney, whole grain Dijon mustard and field greens.  This sandwich, unlike their others which is served on a baguette, is served on cracked wheat bread.  Personally, I'm not a huge fan of baguettes for sandwiches since they tend to be too hard.<br><br>Service seems pretty good, though my interactions have been super minimal - just placing and picking up an order.  They also have a small outdoor dining area that always looks packed at lunch time.<br><br>I highly recommend hightailing it to Pastoral if you haven't already tried it.  Yes, it's a bit pricier than your normal lunch fare, but trust me, it's worth every single penny.  As for me, I definitely foresee treating myself to Friday lunches in the future.  I definitely will be calling ahead though and so should you!", "pics": null}}, {"review": {"des": "If looking for sausages or cheeses in the loop area, find Pastoral.  They let you try whatever you want and will recommend items with little or no input from you if you don't know what you are looking for.<br><br>Their multigrain baguette(which they source from a European baker in River North/Gold Coast) is awesome to go with the cheeses.<br><br>Reminds me of going to a cheese shop in Europe except there are no language barrier issues!<br><br>I love their sandwiches as well, but I usually just come for the cheese.", "pics": null}}, {"review": {"des": "I'm extremely picky when it comes to sandwiches, and I have to say that these were incredible. There are many unique ones to choose from, and I would seriously eat any one. <br><br>I decided to go with the Blue Fig and Pig and it was soo yummy- filled with blue cheese, ham, and a delicious mustard. My boyfriend got the Mediterranean turkey and that was delicious as well! Tasted very fresh and healthy. <br><br>We got there at 11:45 for lunch and there was no line, but one started to accumulate right around 12 so get there early if you can! Definitely will be back soon.", "pics": null}}]}