{"name": "penumbra-chicago", "reviews": [{"review": {"des": "This was THE BEST dining experience I've had in a loooong time!<br><br>Where do I start???<br><br>Went for dinner Thursday evening. <br><br>When you enter the restaurant you are welcomed into a bar/lounge area with comfy seats and tables to chillax and have cocktails. There's also a couple of tables that seat 4. It is dimly lit and spacious. The ambiance is hip and romantic. A great gathering area for both friends and couples.<br><br>We were led to the rear of the restaurant into the dining area. WOW! Very warm and inviting with beautiful decor. Definitely sets the mood! There's plenty of space between the tables, so it's a more intimate dining experience.<br><br>There are tables along the wall with sheer curtains, which is where we were seated. Very romantic! It was like we were in our own little world. <br><br>Started with a glass of Tempranillo, which was perfect! We were served complimentary soup, which was smooth, creamy and rich with flavor. It was absolutely DE-LISH! <br><br>Ordered the Ribeye $27 and Nueva York $27 for our entrees along with a glass of Cabernet Sauvignon.<br>The Ribeye is rubbed in cracked black pepper and served with a roasted poblano potato puree and a house salad. <br>The Nueva York is a New York strip steak rubbed with roasted garlic peppercorn served with a roasted poblano potato puree and a house salad. <br>Both steaks were cooked perfectly. They were soooo tender, juicy and flavorful! The roasted poblano potato puree also tasted great and had a good consistency. I don't remember all of the ingredients in the arugula salad, but it was fresh and a perfect accompaniment for the dish. <br>The Cab was a perfect pairing for our meal!<br><br>The menu includes steak, pork, chicken and seafood. There's also options for vegetarians as well. They have a good cocktail list that includes beer and several wines.<br><br>Our server, Johnathan, was great! He was very personable, friendly and informative about the menu. He was also very attentive and professional. He definitely made our dining experience even better!<br><br>After dinner, we went back to the lounge area to relax. I had an opportunity to speak with the owner, Rita, who was so delightful! She definitely takes pride in her establishment and delivering good food with great service. <br><br>I truly enjoyed the meal, service & ambiance and I'm sure you will as well. The price point is great too. I highly recommend Penumbra and I will surely return.<br><br>Buen Provecho!", "pics": null}}, {"review": {"des": "1. Excellent service, <br>2. Nice interior, <br>3. Very clean bathrooms,<br>4. Perfect medium rare ribeye without ruining my account,<br>5. Delicious pork chop, especially garlic sauce,<br>6. Well priced cocktails,<br>7. Romantic ambiance.", "pics": null}}, {"review": {"des": "How do I even begin to thank this restaurant for such an amazing birthday dinner!! I was searching for so many places to have a nice dinner in Chicago at a reasonable price. <br><br>I saw that Penumbra had 5 stars and SOOO many reviews so I thought we have to try it out. When we arrived we were greeted by a sweet hostess who sat us. Then our waitress described all the amazing things on the menu and some favorites. <br><br>We decided to try the Jalapeño Shrimp, which I would recommend to EVERYONE. They aren't too Spicy, but packed with great flavor! <br><br>Then we had the Ribeye steaks with Potatoes and their house salad which ugh,.. is so great. It had amazing flavor, packed with great taste, and just the perfect amount of food. <br><br>I finished with their Truffle Brownie, which was packed with warm truffle chocolate, and a crispy outside. My mouth is watering talking about it. <br><br>I also got the Capreniah Drink (I recommend asking the bartender to muddle it with Raw Sugar and not the Syrup, like a traditional drink).. it was GREAT!! <br><br>Truly, truly want to say I had one of the best experiences here!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/rlEs9FjwAibkilk3i75JyQ/348s.jpg", "caption": "Truffle Brownie"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/QF7lARhwTXz6-6kY4BTvZQ/168s.jpg", "caption": "Ribeye"}]}}, {"review": {"des": "Penumbra is a lovely addition to the neighborhood that takes creative use of a very unique space.  Great cocktails, affordable wine list, and flavorful steaks make it a romantic evening with your partner or paramour.<br><br>Like any Romantic, Penumbra bides its time.  In the front is a large but sparsely lit (and furnished) bar.  This space alone is large enough to fit a full bistro, but it is populated with just a few club chairs and couches to complement the stools along the bar.<br><br>It may appear underwhelming, but then your server walks you through the room to the cavernous back dining room, which has a two story high ceiling and dim, romantic lighting.  A row of two tops along the east wall are each shrouded in linen for privacy. Its a lovely \"whoa!\" moment.<br><br>And the dining experience lives up to the decor.  The cocktails are excellent; my noble bourbon boozers will be pleased to hear Woodford Reserve is available, and the rye Manhattan is also excellent.<br><br>The wine list is very eclectic and affordable; if you aren't in the mood for a full dinner, the front bar is perfect for sampling the many offerings by the glass.  For wines by the bottle, I recommend the Chateauneuf du Pape for a felonious $55, and the chewy and robust South African Cabernet.  Both pair excellently with the steaks.<br><br>And you'll have three different steaks to choose from - a ribeye, a NY Strip, and a flat iron.  All are well seasoned and flavorful, and I particularly like the flavor of the flat iron.  Be advised that they are not the tenderest of steaks, but they are not tough, either.  Simply toothsome and full of flavor.<br><br>The shrimp appetizers are superb, and we love the rum raisin ice cream, served in a chocolate cup.<br><br>Service is friendly and attentive.  If you need a quick injection of romance, Penumbra is the ideal neighborhood destination.", "pics": null}}, {"review": {"des": "This place is a Hidden GEM!! The food was outstanding!! Worth going to enjoy a nice steak and a great ambience!! They were playing fantastic Latin music!! The brought us a complimentary potato soup to try which was delicious!! I had the New York strip steak!! It was grilled to perfection. The ribeye was extremely delicious and had an amazing mix of flavors also grilled to perfection!! The salmon was also really good!!! My compliments to the chef who made the salmon!!!! All the sides were great as well!! Overall this is a fantastic restaurant!!!!", "pics": null}}, {"review": {"des": "Since my initial review, I've gone back here numerous times and each time I have not been disappointed! Every item I've tried has been seasoned perfectly and cooked to perfection! <br><br>Looking at the exterior, you wouldn't expect the place to be so large! There is a wine bar when you initially walk in. The hostess would ask if you have a reservation. Each time I've been it hasn't been too busy, but I've always made a reservation in case (you can do so on yelp, or call the restaurant directly). It has gotten busier every time I've returned so it would be wise to make one just in case.<br><br>The dining area behind the wine bar is large and intimate. It is dimly lit and very intimate. They have a range of selection for appetizer and entrees (seafood, beef, pork, and chicken dishes). However, if you are a vegetarian, there might not be too much for you to choose from. They have a large wine selection, which is expected since it is a wine bar. <br><br>And while it lasts, they have a great dessert when you check in! :)", "pics": null}}, {"review": {"des": "Had a tremendous experience at Penumbra. Service was top notch, server wae super knowledgeable about the menu and was able to answer any questions. Appetizers, main dish, and drinks were all high end. <br><br>This is an unreal place and I wish I can go back. Eey soon.", "pics": null}}, {"review": {"des": "Found Penumbra while scrolling through Yelp and decided to make reservations for babe's birthday based by the positive reviews I read. Came to the restaurant around 6 and was greeted by the hostess who walked us to the back of the restaurant into the most romantic, intimate setting I have ever seen! Our server Landon was amazing...he walked us through the whole menu and pointed out to what was most popular and what paired well with drinks. For our appetizer we ordered the grilled shrimp with a pineapple salsa and for entrees we ordered the flat iron steak and grilled lobster which came with sides of potatoes/salad. WOW is all I can say because everything had so much flavor and was cooked perfectly! Finally, for dessert we enjoyed the vanilla flan to end on a beautiful evening at Penumbra. Check out the wines since Penumbra has an awesome selection of it!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/sBl9e6jy7gzZFpJyN6i6nA/348s.jpg", "caption": "Birthday Flan @ Penumbra"}]}}, {"review": {"des": "This place is AMAZING. I had dinner there with my mother on a Sunday night. It wasn't very crowded but it's a 5 star restaurant. The service, the food, everything was perfect.<br><br>We started with coconut mojitos- they were delicious. Then, we got the complimentary poblano soup- my taste buds were so happy. It was perfectly seasoned, nicely spicy- without being too spicy. I ordered the jalapeno shrimp and my mom ordered the shadow shrimp (garlic). They were both very fresh and cooked so well. It came with potatoes and a side salad. For a $20 entree, we got a lot of food that was definitely worth it. I would 100% recommend!", "pics": null}}, {"review": {"des": "Join the ILLUMINATI today and be liberated, enlightened and illuminated hence start a new era of your life with endless riches, fame and powers bestow unto you from beyond reply for initiation <a href=\"mailto:dukevasco@elitemail.org\">dukevasco@elitemail.org</a>", "pics": null}}, {"review": {"des": "I cannot say enough about this business! It was absolutely incredible and we cant wait to come back again and again!<br><br>The owner is wonderful, she has a restuarant background and takes so much pride in this business! The staff is extremely attentive,  helpful and friendly...they all make your experience! Food is explosive with flavor, large portions, affordable and high quality. We were both blown away! Fantastic wine menu and a half off wine glasses happy hour from 5-630 <br><br>We shared the crab cakes with a small salad. Best we have had and salad was delicious! Boyfriend had the pork and we are both still talking about the flavor and perfection it was cooked. I ordered the salmon and it was outstanding. The roasted vegetables and salad that were served with it were unique and could be a meal alone! We ended with the homemade icecream...a must!<br><br>A true Chicago gem! Best meal Ive had in awhile!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/uKl-RrwKoreJNi9B64eyAA/348s.jpg", "caption": "The fabulous owner...it was a pleasure to meet her and experience her restaurant!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/s7z-JwArzyZ-R6rJ881TtA/168s.jpg", "caption": "Homemade ice cream"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Kcxn8QyDT-sGndd4R5WasQ/168s.jpg", "caption": "Salmon topped with a caper butter...delicious!"}]}}, {"review": {"des": "I completely understand why Penumbra has five stars on yelp. That is how I found it and it definitely lived up to the hype. The restaurant is kind of hidden, with a simple front on Fullerton that you could easily walk right past. The inside though is amazing. It's a dark, intimate atmosphere and to my pleasant surprise we were seated at a table with almost a sheer curtain around it - very classy and unique. <br><br>They brought us out some soup to try, free of charge, which was delicious. We ordered crab cakes to start and each had a cocktail and my partner had a glass of wine with dinner. Main course we had the NY steak and the shadow shrimp. Everything was absolutely fantastic and I would go back in a heartbeat. <br><br>Service was great and the best part - prices were reasonable! I feel like our dinner of three drinks, an app, and two entrees of steak and seafood could easily be $200 somewhere, but here is was about half that. <br><br>Highly, highly recommend!", "pics": null}}, {"review": {"des": "My boyfriend and I had dinner here last Saturday. As other reviews note, the outside/front entrance is very underwhelming but the back part of the restaurant is very nice. Some of the tables are separated with thin curtains to add some ~romantic~ ambiance. <br><br>They have a decently strong wine list as well as several cocktails. The food menu is somewhat limited but if you like steak and/or seafood, you're good! <br>We shared the scallop appetizer which was tasty. Their homemade pineapple relish was the star of the dish! I ordered the creole jalapeño shrimp, which was a large portion, a little spicy, and featured more homemade relish. My boyfriend said the NY steak was \"good.\" <br><br>My only (very small) gripe with this place is the service. Our waitress was friendly, but doted on us too much. They brought everything way too quickly. They were serving our main dishes before we finished our appetizer. <br><br>The prices, however are incredibly reasonable! We left very satisfied.", "pics": null}}, {"review": {"des": "I came here with very high expectations due to the perfect 5 start reviews they have, and they totally went above and beyond! It doesn't look like much from the outside, but once you step into the dining room, it's so romantic and beautiful with drapes separating some tables. I came with my boyfriend and the mood was just fantastic! We have the option to dim or brighten the light above our table. Did I mention the food was delicious? This was out cheat night, so we got the crab cake, scallops and bocatidos as appetizer and nueva York steak and flat iron for entree. Everything tasted wonderful. Scallops were cooked perfectly. The crab cake was a tad mushy, but still tasted amazing. The steaks were so well seasoned and tender. We got 2 dessert drinks French connection and the mocha mint. The mocha mint was so good, on the other hand French connection needs a little work, tasted like cough syrup. The service was amazing too! The waiter recommended a very good wine to go with my steak. <br>Amazing experience, would totally visit again soon!", "pics": null}}, {"review": {"des": "5 star service, 5 star food. The staff are the paragon of good hpspitality. The food made me smile and I rarely smile. I'm coming back many more times. I had the shrimp, steaks, and the<br>Bocadito. I got ice cream for checking in and it was pretty good. Great music. I love the dim amostohere, very chill or romantic.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Opb3Ww5xmNLnzxTocsD7oQ/348s.jpg", "caption": "Their food made me smile and I rarely smile."}]}}, {"review": {"des": "Super cute date night spot & neighborhood gem! The wine list was wonderful & reasonably priced; the waiter gave us great recommendations and we loved our bottle of Chianti.  The cheese board was a perfect starter for 4 people (and only $20); it included some classics and some really unique cheeses (ginger goat cheese? strange but good!). Before dinner, they brought out tiny cups of poblano & potato soup and it was SO GOOD! The Nueva York steak was tasty, but had a rather large section of fat; the roasted veggies and mashed potatoes were delicious! The spicy shrimp (I can't remember exactly what it was called) was AWESOME and came with tasty roasted potatoes and a great side salad.", "pics": null}}, {"review": {"des": "OHMYGOD. I can't believe I am just now discovering this gem. Came here for my 30th birthday dinner and I wish I could give 10 stars. The ambiance was incredible. I love a dark, intimate restaurant and Penumbra was exactly that with some whimsy. <br><br>The menu is perfect. Something for everyone. I had the NY strip steak and it was phenomenal. Everyone in my party raved about their food, and the cocktails were great, too. But the best part of the whole night was the exceptional service. Our server, Sebastian, was patient and thorough with the menu and went above and beyond to accommodate everyone's dietary restrictions. Little things like giving me a fresh cup of chimmichuri to bring home with my leftover steak, or asking the chef to prepare an entirely different sauce for my mom to pour over her salmon, etc., showed he cares about our experience. <br><br>The cherry on top was this gorgeous dessert plate they brought out for my birthday. We had ordered the flourless chocolate cake and I'm not sure whether it was a coincidence or Sebastian heard my mom call me \"Elizabeth Rose,\" but either way the plate was thoughtful and again, above and beyond. <br><br>I would say I'll be back for the next special occasion, but the prices are so reasonable I really don't have to wait until then. <br><br>Thank you, Penumbra & Sebastian! You were the highlight of my birthday.", "pics": null}}, {"review": {"des": "This place is awesome. The food is delicious and the atmosphere is romantic. The lights are dim and you can sit on couches if you like.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/T15hCzVcP-59sesBTKabjg/348s.jpg", "caption": "Family Time"}]}}, {"review": {"des": "Came here for a birthday dinner on a Wednesday. Didn't really get too busy until 7:30, probably best to make a reservation just in case.<br><br>Very nice vibe and that goes well for couples. We were in the back which I think is the dining area. Low lit with nice decorations. Waiter was friendly and attentive and gave a good run down of the menu. We ended up getting the New York strip and creole jalapeño shrimp. The New York strip was good but felt like it was missing something. The sides were amazing though, seasoned well. The jalapeño creole shrimp was superb. Hit you with a spicy punch at the end but wasn't too overwhelming. Sides were good as well.<br><br>Ended up with the rum raisin ice cream which was good, but nothing special. Girlfriend enjoyed the place and I'm pretty sure we'd like to come back to try other dishes. Prices are reasonable as well! Only criticism was that our waiter got super busy and inattentive when more people started rolling in. Took over 30 minutes to get our dessert and our check.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/hg5L_Ga6u_xHZHsXNll28Q/348s.jpg", "caption": "New York Strip, was good but regret not getting the ribeye."}]}}, {"review": {"des": "From the moment we arrived we just continued to be wowed. The hostess was genuinely welcoming as if inviting us to sit down at her home. We were seated in a almost private table. I love the way that they curtain off some tables and there are hooks for your coat or purse. It was so romantic and perfect for our Sweetest Day dinner. Our waiter was awesome saving us some money on suggesting the special that combined both the surf and turf that we wanted. The prices were great even without the special. The charred texture of the steak was phenomenal and the flavor of the lobster was so good! The molten chocolate cake just put us over the edge. We couldn't stop talking about everything and can't wait to come back.", "pics": null}}, {"review": {"des": "What a unique place in the city! The decor is romantic yet not stuck up. The prices aren't bad either. The food itself was pretty good but not amazing. My chicken was a bit rubbery, although the flavor was delicious. The same goes for my husband's steak. The wine was delicious and they have a great selection. The waitress my very nice and attentive. I'd recommend trying Penumbra out.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/gMwsi3rdFC5zBHAOkC6tKQ/348s.jpg", "caption": "Chicken"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/X33g8fBdDvmvX4CymxDOnw/168s.jpg", "caption": "Rib eye"}]}}, {"review": {"des": "I had never been here before but based on reviews, decided it would be an ideal restaurant for boyfriend's surprise birthday dinner. We made our reservation for 6 people with Rita, who was extremely friendly and accommodating. The entire experience was better than I could have imagined.<br><br>The front of the restaurant, quite frankly, looks underwhelming. But the hidden gem of this restaurant is when you walk to the back, where it opens up to a large, beautiful room that has curtains, low-lighting, and candle-lit tables. Perfect date, or in this case, a surprise dinner.<br>It was a Friday night and all the tables were filled, so I suggest making a reservation. We stayed there for a long while, drinking and talking and never felt rushed to order or leave. The service was great, very friendly, and attentive the entire time.<br><br>Now for the food:<br>Cocktails: Good serving sizes and delicious. We went through a couple rounds of drink and I got to try a taste of several of them. There wasn't a single one I didn't like.<br><br>Shadow Shrimp: Very simply executed, but flavorful.<br><br>Ribeye: Great choice in the cut. If you like fattier cuts, this was perfect. The potato puree was a bit lackluster, but the asparagus was delicious. The ribeye itself was cooked to perfection, but the seasoning may have been a bit too salty.<br><br>Salmon: In general, I think it's hard to mess up. Salmon can either be delicious or it can be average. The salmon here is definitely delicious.<br><br>Molten Brandy Truffle: They put a candle on it and wrote happy birthday on the plate for my boyfriend. Delicious. Keep in mind that it is a very, very, very decadent and dense cake that we shared with our entire party.", "pics": null}}, {"review": {"des": "I never knew a Logan Square restaurant could be so dead. At 6:30pm on a Tuesday we were the only two people dining in the whole place. It's a MASSIVE restaurant with bar seats in front, a dining room in back, and a bunch of lounge chairs hidden by curtains to the side. <br><br>Wine is 1/2 off Tuesday, Wednesday and Thursday from 5:00-6:30, but they were out of my two favorite wines. Double boo. My third choice was a-okay. <br><br>Service was very slow, and the music was way too loud, but I would consider giving them a second chance since everyone else seems to love it!", "pics": null}}, {"review": {"des": "great environment for dates, liked the privacy and intimate environment. The dishes are really good too. really liked the salad that came with the entree, they are not just lettuce with dressing, there are a variety of greens topped with mandarin orange. The shrimps are quite good!<br><br>for dessert, really liked the raisin and rum ice cream, loved the raisin bits in there.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/C3N-GogfQtuKhficblHQQg/348s.jpg", "caption": "Raisin ice cream"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/9wdUHtmtrhliGuC8Gghpzw/168s.jpg", "caption": "Steak"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ewLsklV39mU6hAhUqr0usA/168s.jpg", "caption": "Shrimp"}]}}, {"review": {"des": "Let me start off by saying I never leave reviews. As soon as we walked in we could tell it would be a great time. The atmosphere and dark setting made it so perfect for our romantic night we had planned but also seems like a great setting for friends. There are tables with chairs as well as private cabanas with couches. Thank you to our waitress Christine! The drinks, dinner and dessert were all spectacular. The owner, Rita, was so kind and checked in on us to make sure we were enjoying the experience. Easily a new favorite in Chicago, it is 5 stars for a reason. <br><br>A big plus is that this is Latin owned!!!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/TBUKQCKIdi3Y0H4cvmqhVA/348s.jpg", "caption": "Flat iron"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/yda6KgWfQT8AJEJ3GZHaEw/168s.jpg", "caption": "Rib eye"}]}}, {"review": {"des": "So glad we found this place. From outside it doesn't look like much, but what you don't see if the large dining room in the back. All of the food is amazing, I have not a bad bite of food here. <br>On top of that the staff is very friendly and they have a great bartender making a variety of cocktails.  <br>If you are around Logan square, stop in and you will see why this place has 5 stars", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/O0hAljfW-SOM443d2VlxIQ/168s.jpg", "caption": "Veggie platter with chicken"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/pSKhHn648XAcgBxb8ow5kw/168s.jpg", "caption": "Steak"}]}}, {"review": {"des": "There are not enough words to say how amazing and fantastic this place is. Jonathan our server is a total sweetheart and the food is just SPECTACULAR. This place is hidden gem. If you have not come yet make every effort to come<br><br>I'm so happy", "pics": null}}, {"review": {"des": "I loved the food. I enjoyed the front room for a casual bottle of wine and salad. I enjoyed a curtained table in the main room for a full dinner. Friendly service.", "pics": null}}, {"review": {"des": "The ribeye steak was so good. I will be back to that restaurant next time.<br>I was enjoying my meal, good service and good place", "pics": null}}, {"review": {"des": "Took my boyfriend for his birthday, very romantic, food came out fast and very delicious, portions are just perfect, not too big and not too small. <br>Bring your couple here or to ask someone to be your girlfriend I think is the perfect spot", "pics": null}}, {"review": {"des": "GO HERE. You will not regret it. I'm torn between keeping this gem a secret and screaming from the rooftops of the Willis for everyone to go to Penumbra. I saw all the high reviews on Yelp and decided to take a look for myself.<br><br>Fact: this place is truly amazing. The cocktails, the food, the ambiance. It has it ALL. The place has a wine bar in the front and the restaurant is located in the back. There are private booths tucked away on the sides with cute little throw pillows, dim lighting, and wonderful decor (if you need a romantic date night--this is your place). <br><br>I arranged a 10 party birthday dinner for my friend, and Rita (the owner) could not have been more helpful. She was so kind and provided excellent service to make sure we were taken care of for the night despite our large party size. She called me to confirm the reservations, helped us hang up the decorations, and checked on us throughout the night.<br><br>Price: 20-30, completely reasonable for the amount of food you'll get. <br><br>Food: The charcuterie plate was top notch (we got the half). There are plenty of vegetarian options available too if that's your thing! I got the Harvest with a vegetable medley of asparagus, various peppers, grilled zucchini, AMAZING grilled portobello mushrooms and a side of potato puree (which they made into a heart--I'm hungry again just thinking about the food). The pork and chicken dishes my friends ordered were both cooked to perfection. <br><br>5/5. Is there a 10/5 button? Because this place deserves that. Will be back again and again to my heart's delight (though not so much my wallet)", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/YvZTsuq4WWrKx83YncQ93g/348s.jpg", "caption": "Our big dinner table. Just the best ambiance"}]}}, {"review": {"des": "Found this on yelp while looking for a romantic and quiet dinner while visiting Chicago with BF. It was amazing.  Service was on point.  Had a private table even with our last minute reservation on Friday night.  First up was coconut mojito and caipirinha. Both were perfect. had flank steak.  BF has the pork.  The meats and side were delicious.  Then we finished it off with the molten brandy truffle- to die for.  Will be back every time I'm in Chicago.", "pics": null}}, {"review": {"des": "Definitely a 5 star restaurant for a reason. I took my boyfriend out here for his birthday and we received excellent service. We started off with the shadow shrimp and it was seasoned perfectly. We then got the flat iron and New York strip and everything was so amazing about the steak, it was so flavorful. Everything went well together and the wine list was great. We will definitely be back.", "pics": null}}, {"review": {"des": "I have mixed feelings. Some of the food was very good, some flavors missed the mark in my opinion. The wine list was fine but when you claim to be a wine bar I expected more selection or an explanation of why the list was average in size. But overall we were very happy and will definitely be back.", "pics": null}}, {"review": {"des": "I dislike seafood but once in a while I try shrimp. This is the first time I ate shrimp and enjoyed it so much I ate half the plate. The shrimp and bocadito as appetizers were delicious. The steak was up to par as expected based on the apps. We got to eat the homemade ice cream, that was also delicious, because we checked in. My boyfriend and I are very satisfied coming here.", "pics": null}}, {"review": {"des": "Would have probably never thought to come here since it's in a very inconspicuous area. Came for a bachlorette dinner.  The setting is very dark and pretty romantic haha<br>We were seated at a bigger table but the ones surrounding us had couches and had curtains, making it pretty private.  The food was amazing.  It was mostly Latin fare but had other items on the menu as well including some vegetarian friendly options.  I had one of the steaks which were amazing and the serving size was pretty huge.  The manager was very sweet and it was clear she cares about her customers.  Will sure be back!", "pics": null}}, {"review": {"des": "Talk about a surprisingly delicious place in an unassuming location! Although the restaurant is not obvious when you pull up to it, when you enter, you are transported into this very romantic locale. The ambience takes you away to some far away place where you can enjoy a date with your loved one. <br><br>The food transports your tastebuds to heaven. Not sure if this is a regular thing, but they started us off with a small cup of their soup. On the day we went, it was this potato soup with hints of cilantro. I wish I could just have bowlfuls of that soup!<br><br>We ordered a charcuterie plate, crab cakes and the jalapeno shrimp. The charcuterie plate had very delicious meats and cheeses. Paired with a good wine, this is a definite must start.  The crab cakes were also good, but the show stealer was the shrimp. If I had known how good the shrimp was going to be, I may have ordered double!! In fact, I want to go back just for the shrimp. We also had some tortilla dish reminiscent of a quesadilla. That was just ok.<br><br>Definitely would come back here!", "pics": null}}, {"review": {"des": "Everything about my experience here today was great.  My bf and I came here as a last minute decision for his birthday, and we were not disappointed.  We walked in a little before 6 and were seated in one of the romantic little private tables in the main dining room.<br><br>Sebastian was our server and was phenomenal.  He brought us our drinks promptly and gave us some pointers about the menu items.  We started off with the scallops and crab cake appetizers.  The scallops were superb, along with the sautéed spinach, pineapple salsa, and the avocado puree that the scallops were presented on.  I'd absolutely order the scallops again and recommend them.  The crab cakes were pretty standard, although it was apparent these we not some frozen crab cakes sitting in the freezer.  They were fresh and yummy.<br><br>For our entrees, we had the salmon with caper sauce and one of the steaks.  I ordered my steak medium rare, but it came out nearly rare.  I always order medium rare without issue, but this was undercooked for my liking.  I kindly asked Sebastian if it could be grilled just a few more minutes, and he took the plate back without a problem.  My steak reappeared a few minutes later along with a fresh portion of the garden salad.  The steak was medium rare and absolutely delicious with the accompanying chimchurri sauce.  The steak may have been undercooked to begin with, but the problem was rectified and I was happy.  <br><br>This place has a romantic vibe and is not pretentious.  The front bar area is a good place to hang with friends, and if you prefer something a little more intimate, they have a few low tables with couches.  Service was on point and the food was delicious.  Definitely come here for a romantic evening out.", "pics": null}}, {"review": {"des": "Very cool wine bar and restaurant!  Decided to have a date night here with my wife after reading the reviews, and it was perfect.  Great ambience (lighting and decor was awesome), great food and of course great wine :).", "pics": null}}, {"review": {"des": "What a great restaurant.  The ambiance is wonderful almost exotic and the food was delicious. Johnathon our services was helpful in making this great experience.", "pics": null}}, {"review": {"des": "This place is amazing! I was skeptical of a place that had 100+ five-star reviews.  I mean, it can't be, right?  It is!  The hype is real.  <br><br>We made a reservation over yelp DM.  The owner replied quickly, and it was super easy.  <br><br>Our server was very knowledgeable and detail oriented; he was attentive and friendly while giving us space to enjoy date night. <br><br>We tried wine from the wine list.  The list is not very long, but I felt it had a lot of different options for every taste and pairing.  <br><br>We were given a free sample of a fall squash soup.  It was delicious and velvety smooth- fall in a cup.  We tried the Creole Jalapeño Shrimp appetizer with the sweet mango salsa, lemon, and mango over grilled shrimp.<br><br>As our main courses, we tried the ribeye and the chicken.  We ordered the ribeye medium rare, and it was delicious.  Good quality meat.  The chicken was juicy, and the goat cheese was not overpowering the dish.  Great balance altogether in the dish.  <br><br>To finish the had the Molten Brandy Truffle- very rich.  I enjoyed the raspberry coulis that came with the truffle.<br><br>The ambiance-<br>* Romantic, private sections.<br>* There is a main table in the center of the room, perfect for large parties.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/oAu_C4REQT61hUmqkugB0g/348s.jpg", "caption": "Chocolate truffle."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/5eNbi3l-VyGMxWJhTcTyfg/168s.jpg", "caption": "Chicken."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/5nBeeyJVB7opfGbDKmIoZw/168s.jpg", "caption": "Ribeye."}]}}, {"review": {"des": "Excellent experience all the way around.<br><br>We were seating at a very private table with curtains surrounding it. We never noticed that anyone else was in the restaurant. The waitress, Monica, was very knowledgeable about the menu and helped us make our decisions. The food came out very quickly and timely upon completion of each course. Definitely a unique experience. I would recommend this for any intimate date night.", "pics": null}}, {"review": {"des": "From the cocktails to the dinner and dessert everything was incredible!! The ambiance was unique and perfect for our date. <br><br>I had the grapefruit old fashion, the salmon, and we shared the rum raisin ice cream. My bf has the flat iron steak and the eclipse drink. We shared the half portion charcuterie plate which was a great size for the price and delicious. <br><br>Everything was delicious, the service was perfect, it was all around a great dinner. We will definitely be back.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/xEntS6-wXYZtlDQZJuuemQ/348s.jpg", "caption": "Homemade rum raisin ice cream in a chocolate mug. My first try at rum raisin ice cream and it was incredible"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Bcw_ynL2uf7XEhMTWWg5Dw/168s.jpg", "caption": "Flat iron steak, potatoes and house salad. Delicious!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/e0Vep1vUXdPKQylvn3qdQg/168s.jpg", "caption": "Salmon, house potatoes, asparagus. Delicious!!"}]}}, {"review": {"des": "I was very close to ranking this a three but a couple things make it more deserving of a 4 star ranking. <br><br>First and foremost-- the food was amazing. The jalapeno shrimp were absolutely delicious with a serious kick and I loved the pineapple relish they were served with. The New York strip steak was perfectly cooked, peppery and the roasted vegetables were the perfect accompaniment. We got a little amuse bouche of soup before our meal that was also amazing-- had I been hungrier I would have been tempted to order more! I had a coconut mojito to drink that was highly recommended by the server. I'm not usually big on them but this was delicious! I also loved the woman who brought us to our table. She was so sweet and personable. <br><br>The not as good- Some of the tables are sectioned off with what looks like curtains or a veil at the entrance-- those jive more with the dark, romantic vibe of the place. I wish we had been sat there as we were basically just in the middle of a dark room. I also wish they'd had more wines by the glass, considering that they are a wine bar, I was underwhelmed by the choices. When we went to redeem the free Yelp dessert, the server pushed back and said it was only available on weekdays. When I produced the offer, he went along with it but we were charged for it anyway which I didn't notice until after we'd paid the check. It was only a few bucks but it left a bad taste in my mouth-- I always tip on what the total would be before promos so his money would not have been affected. This kind of upset me. <br><br>My best friend recommended this restaurant and said they were given flawless service so I'd been highly anticipating coming here for a while. I was very excited when I made the reservation! I loved the food but I would not rush back because of the way the server acted about the dessert which he then charged us for anyway. That's pretty dishonest.", "pics": null}}, {"review": {"des": "Came here with the bestie last night after paint and sip at the Tipsy Brush in Logan Square. Found this place on yelp and liked the high ratings. It. Did. Not. Disappoint. <br><br>The ambiance and decor was intimate and funky. They have a bar inside near the front door and tables in the back. It's dark as it's part of the ambiance they create but they gave us mini flashlights to see the menu. I was surprised at the cost too. It was very reasonable. <br><br>Bestie ordered a an old fashioned and I got a classic martini with vodka. Let me tell you. If you like a classic strong martini...this is the place. Started off with an amuse-bouche of potato soup. It was flavored really well with a hint of spice. Bestie and I both ordered the pork chop covered garlic cream sauce, chipotle cranberry sauce or both with roasted veggies and a size of roasted potato. De-li-cious! The pork had a dry rub on it and was seasoned really well. It was cooked beautifully. Not dry at all. The potatoes were so good I asked for another serving. Yes. Please order this dish. <br><br>Bestie finished the evening with a scoop of rum raisin ice cream. It was served in a mini edible chocolate cup! This place her major cool points for presentation. <br><br>Go today. Go tomorrow. Just go. Sit in Vinnie section. Tip well. The end.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Oz455kdq5BwRa_TAFiwhlg/348s.jpg", "caption": "Classic martini with vodka"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/V4zABBRaTsL6N3FHYrhAMQ/168s.jpg", "caption": "Old fashion cocktail"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ye4VrK1c2-HSEKxT3xKGEg/168s.jpg", "caption": "Pork Chop Entree"}]}}, {"review": {"des": "Seeing this joint on the outside you wouldn't even think of how lovely this establishment is on the inside. The staff was so polite and professional.  The ambiance is definitely candle lit dinner romantic. Me and my boyfriend we the first ones there for an early dinner. They have these curtained off table to the left side of the restaurant. We were seated at one of them. It gave us a very intimate experience that made us feel like we had our own little secret room. On to the food. Honestly, everything was delicious. I was really happy with what I ordered. They also have wine specials on certain days! I would definitely make it back here. Perfect for an anniversary or romantic birthday dinner.", "pics": null}}, {"review": {"des": "We loved everything here. The plates are balanced, including a main meat, potatoes, and a nice fresh salad. The service is excellent. The portions are an appropriate amount for the price.", "pics": null}}, {"review": {"des": "Took my boyfriend here for his birthday and we loved it! The hostess helped me set up the table beforehand with a nice, chilled bottle of wine before we came in. We were sat in a private table of two which I didn't expect but WOW was it absolutely perfect. Our server, Laura, was very friendly and recommended the creole jalapeño shrimp as a starter and it was delicious!!! For entrees we had the NY Strip and the Pork, which were also cooked to perfection! Such a romantic and wonderful dining experience without being overpriced - I can definitely see how this place has 5 stars!", "pics": null}}, {"review": {"des": "Great ambiance. Very intimate setting, great for a date night. Food and drinks were also delicious!", "pics": null}}, {"review": {"des": "I'm not the type of person who writes reviews (just read them), but this place exceeded all expectations and deserves a 5 star review. My boyfriend and I are from out of town, searched restaurants that had the highest ratings and found Penumbra. We booked a reservation through yelp (super convenient). The staff is extremely nice and informative. This place is perfect for a romantic date night as a couple of the tables are enclosed by sheer curtains. The food was absolutely amazing, we ordered the New York strip that came with mashed potatoes (in the shape of a heart) and veggies. Their complimentary potato based soup was phenomenal, drinks were perfect, and all for an extremely reasonable price. 10/10. Will definitely be back!", "pics": null}}, {"review": {"des": "At first I was curious how this place could have a perfect 5 star rating and we quickly found out why! We ended up coming here just to figure this out so we got the siblings together to celebrate our brother's birthday. We really liked how you walk in and the dining room is in another room. The mood is very romantic with float curtains separating tables for two. It was very dim but definitely added to the mood. We started out with he charcuterie platter and some crab cakes. My sister is on the keto diet so we asked about ingredients to figure out what she could and couldn't have. The salad with the crab cake was very refreshing and had lots of fruit with a sweet dressing. The crab cake was very well seasoned and full of crab meat. The meat and cheese platter was also very good. It came with assorted cheeses (all very good but our favorite was the sage) and different meats as well olives. Since we heard that this place was known for the steaks, 3 of us got ribeyes and my other sister got the pork. The ribeye was cooked very well and it came with a heart-shaped mashed potatoes and more of the salad from earlier. It also came with chimichurri and was a pleasant surprise since not many places offer that! The pork was also very good. It was cooked perfectly and very flavorful. The pork dish came with roasted veggies which was also prepared well. Since my sister is on the keto diet, she couldn't eat the potatoes and the sweet salad so she requested a side of roasted veggies. We understood that it would be an extra charge but Sebastián ended up comping it for us! Sebastián our server was very attentive. In the shuffle of having each other try a piece of something my sister dropped her knife and Sebastián was right there with a new one! He was amazing! I can honestly go on and on about this place so just do me a favor and check it out!", "pics": null}}, {"review": {"des": "The hype is real!  Nothing that has been said about the service, food or ambience in other reviews has been overstated. This was exactly the restaurant experience that you don't get anymore, and they are apparently very consistent. <br><br>We ordered cocktails from their specialty list, and it was very hard to choose. Our wonderful server brought out a delicious soup as a bit of an amuse bouche and our drinks came out in a timely manner. He gave us plenty of time with the menu, and cane to explain the entrees efficiency and clearly. Nothing felt superfluous; it was all information we wanted to know. <br><br>We ordered the scallop appetizer, flat iron steak, New York strip, chicken and the Latin Lobster. They were all amazing. The wine we ordered with dinner was a Tempranillo, and our server was so knowledgeable about the wine and winery. It is obvious everyone cares about what they do here. <br><br>Unfortunately, we had to go back downtown to catch a play, so we had to skip dessert. We will do it next time. We are visitors to Chicago quite often, and I always like to try new places, be we will return.", "pics": null}}, {"review": {"des": "PEN-YUM-BRA!<br><br>When we saw the rating and reviews, we had to give it a try. And wow are we glad we did. Here's the breakdown:<br><br>Ambience: From the street, unassuming. The bar area is nice - roomy and sleek but then you step back into the dining room it's like a transformation. The room is dark (but pleasantly so) and simply and elegantly decorated. <br><br>Service: Fabulous. We had Nora - she was efficient, friendly and professional. I loved that it was so elegant but not at all stuffy. Every staff person was friendly - even when I was just trying to find my way to the rest room. Rita - the owner was as sweet as can be, going around to every table to see if guests were happy.<br><br>Food and Drinks: We tried some of the more unusual cocktails: The spicy margarita - Yay! The basil old fashioned - Yay! And the Eclipse - Yay! As others recommended, do not miss the Shadow Shrimp (as an appetizer or entree). They were moist, full of flavor and soooo delicious! We each had the rib eye. Dinners come with salad and potatoes and all for a VERY reasonable $25! I cannot wait to go back and try some other menu items. Our check-in via Yelp! got us a rum raisin ice cream. Also delicious and top-notch!<br><br>Value: I don't even understand how they can offer what they do at the prices they do, particularly for the entrees. The drinks and appetizers are more on-par with other restaurants but the entrees are beautifully presented and scrumptious. <br><br>Bottom Line: I can't wait to go back and eat in the shadows again!<br><br>P.S. They brought us each a little flashlight at the beginning to see the menu better. Not really necessary, but a fun touch.", "pics": null}}, {"review": {"des": "Came here for my husband birthday and let me say they didn't disappoint.  The food was amazing from the complimentary roasted corn poblano soup to the crab cakes, to our main entrees.  We ordered the Nueva York - the steak was juicy and tender full of flavor and the Pork was amazing. For drinks we tried the pineapple and coconut mojitos both delicious.  The service was exceptional we will definitely return and highly recommend it!", "pics": null}}, {"review": {"des": "This place it's magic the food it's amazing and the service it's unbelievable (Laura) she it's great! <br><br>I eat the lobster and it was just delicious the atmosphere it's very romantic and the interior decor with curtains and candles was the perfect touch", "pics": null}}, {"review": {"des": "I like to keep things concise, but there are a number of reasons why I love this place:<br><br>1. The ambiance is the best part. I would say there's at least 3 feet of space in between tables, which is a breath of fresh air these days. They could easily add extra tables if they wanted to, but that would just ruin the theme of the restaurant. In contrast, in most trendy-popular restaurants in Chicago, you're sitting within inches of another guest. Also the music is great and is not blasting in your ears. It's a rather dark restaurant (hence the name penumbra), but I thought it really set the tone; I could still see in front of me which is all I want to see.<br><br>2. Cocktails had a great balance of flavor and technique. I recommend the grapefruit and basil old fashioned.<br><br>3. Food was delicious. Had a bite of my boyfriend's steak and it was extremely flavorful. I got the lobster, which at first sight I thought was small, but it was plenty filling and very flavorful. It allowed room for dessert!<br><br>4. I hope to come back to try the flan. We got the penumbra rum raisin cup. Just some chocolate molded as a cup with a scoop of ice cream.<br><br>I feel like this place is such a hidden gem and so unique and tasteful. It definitely doesn't follow today's trends we see in almost every restaurant. You will not be disappointed!", "pics": null}}, {"review": {"des": "Loved it!<br><br>1.. ambiance -   great,  very intimate, love the decor. You can bring your kids,  but if you do you will feel out of place.  <br>2. Service - phenomenal , our waitress tookm the time to explain everything! She alls checked how we where doing often enough. <br>3. Food- also great,  flavor was a tad different but in a good way. Portion were right. <br><br>I definitely want to come back!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/jpYZmvpeXWgQezXIdLtLMA/168s.jpg", "caption": "Jalapeno shrimp were hot but that pineapple relish cut the spiciness...."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/wzZE2untNF_v6V7wdl1IoQ/168s.jpg", "caption": "Scallops were fresh and divine..."}]}}, {"review": {"des": "So value-wise this place is amazing. The wait staff and hosts were very welcoming and super attentive. Service was 100. It was a quiet Friday night, and we may have been the loudest table...but no one commented on it.<br><br>As for the food: the Nueva York (pictured) was delicious, the Ribeye was also very tasty. One of our friends ordered the salmon which was also well received. As many other reviewers mentioned the creole shrimp is quite delicious. Everything delivered on flavor though cookery may have been a slight mismatch, but that's nitpicking.<br><br>My only minus is that we ordered some lobster and while it was flavorful it was a bit overdone.  I would recommend ordering things a little more rare than usual here if you like to have your meat more in the rare side. <br><br>Overall a great experience for a neighborhood joint. Would recommend.", "pics": null}}, {"review": {"des": "Where do I begin? We weren't very hungry so had a main and dessert and now I understand the ratings! <br>Perfectly cooked ribeye was paired with a delicious salad ( apples, raisins and the freshest greens), chimichuri sauce and a heart shaped mashed potato which I can't even describe. For dessert we had the home made rum raisin ice cream and the molten lava chocolate cake- clearly made worth a premium cocoa. <br>Portions are perfectly sized and don't leave you over full but certainly satisfied. <br>The waitress was attentive and made the experience 5*.<br><br>Note: Make reservation as they are booked solid. It is a wine paid and Argentinian restaurant so great place to grab wine if you don't want a meal.", "pics": null}}, {"review": {"des": "What a shock to have a place so wonderful so close to home. <br><br>We did not order the soup but they brought us a delightful taste of vegetable soup to start. It was very good. <br><br>I had. Ribeye that was cooked very nicely.  It was just the right medium rare.  The accompanying vegetables were wonderful and the mashed potatoes were very good. <br><br>My friend had the salmon and loved it <br><br>Finally the rum raisin was a hit for desert.", "pics": null}}, {"review": {"des": "Excellent food, service and decor. We will be coming back again. <br>Try the creole shrimp. Spicy and tangy. Salmon was savory and tender. We  will be back.", "pics": null}}, {"review": {"des": "The service here is amazing! For starters, I was looking for a reservation on Open Table but it was all booked. I was a little bummed but when I looked on Yelp, it had a request reservation feature. I had never used that before so I figured why not. I promise you it took MAYBE 5 minutes for the owner to email me back to confirm a reservation time that could work for the both of us. Say what?! That's dope.<br><br>My friend and I arrived and the entire staff was super nice and knowledgeable. Our server, Sebastian explained the menu and wines to perfection as if he was sommelier! Impressive. I ordered the Ribeye and a few glasses of Cabernet. They give you a complementary sampling of a soup of the day to start. I'm licking my chops right now just thinking about it my meal. I can't believe I had never heard of this spot before. I will definitely be back. Oh and the price is suuuuuper reasonable... added bonus for ya. Boom.", "pics": null}}, {"review": {"des": "Ready to level up your date night? Get thee to Penumbra!  This place is truly magical -- from the romantic fabric panels enclosing each booth, to the whimsical lighting and the amazing food/service, you'll be transported on a first class ticket to love land.  Corny? Maybe I am, but you'll know what I mean once you've dined here.<br><br>As everyone's mentioned, the jalepeno shrimp is phenomenal (flavorful, plump, juicy, perfectly portioned) and I think I had the best pork chop of my life while here. The SO is notoriously picky and walked in skeptical...but left a happy believer (with a full belly). We'll definitely be back.<br><br>TL;DNR: Superb restaurant. Visit often. Tell your friends.", "pics": null}}, {"review": {"des": "The food here is legit amazing.  I had the shadow shrimp and it was better than how I make it at home (which is saying a lot given that I make a ton of shrimp).  It was A-mazing alone but with the pineapple salsa it was pretty phenomenal.  <br><br>Service was also great  and we were seated right away, definitely recommend using Yelp to book here for the quick turnaround time.  Here's the thing though, I came here for vday and the atmosphere/music seemed a little bit \"forced datey\" rather  than \"surprisingly great date spot.\"  Not to say that  it's not a solid date spot but would have liked a little bit more of  a casual vibe.  That being said, it was Vday so  that might be different on another date.... I think I just  convinced myself to do a repeat visit.", "pics": null}}, {"review": {"des": "2nd time at this romantic gem . The blackened and jalepeno shrimp are delicious. <br>Pork is very tender and full of flavor. <br>Salmon in the capers sauce is outstanding. <br>The drinks are lovely!", "pics": null}}, {"review": {"des": "Omgosh. If I was local, I would be here way too often. <br><br>From the romantic ambiance to the amazing service, I was entirely happy with my whole experience here. We were started off with a complimentary small cup of their delicious soup. Next was the crab cakes - so good! My NY Strip steak entree came accompanied with the freshest chimichurri, and my husband absolutely devoured his Shadow Shrimp. The side salad that came with entrees was a great compliment to both. The rum raisin ice cream was unique and a wonderful ending note to our meal. <br><br>Will definitely be back if in the area again!", "pics": null}}, {"review": {"des": "I really liked Penumbra, but it wasn't five stars to me - like everyone else says.<br><br>I liked the simple atmosphere of the restaurant.  You enter into the bar / lounge area - which if I lived in the area, I definitely would go to.  You then move to the dining room - which is medium sized, and the tables aren't right on top of each other.  You had your privacy, and if you wanted more privacy, they have \"draperies\" to pull around certain tables.  Yes - the place is dark and yes you will need their flashlight to read the menu, but I enjoyed that.<br><br>Our waitress was good and very friendly.  The manager also stopped by to see how we were doing throughout the meal.<br><br>I got a glass of malbec - but not my favorite, and my husband got both mojitos (coconut and pineapple).  Coconut won hands down!<br><br>We started with the Jalapeno Shrimp appetizer.  Very good!   We quickly ate that.  I wish I had gotten it in the entree portion - it that really tasty.<br><br>For entrees, they came in lightning speed.  We got them soon after the appetizer - and then there wasn't enough time to get another drink.  I wish we had time to savor the app and drinks before the main courses came.<br><br>My husband and I both got the ribeye - that came with a house salad and poblano mashed potatoes.  I enjoyed the salad and the potatoes (very good), but the ribeye was too fatty for me.  Even my husband admitted it was a bit too grisly for him.  <br><br>For dessert, it was my husband's birthday so they wrote happy birthday on the rum raisin ice cream we got.  The ice cream was tasty - we should have gotten two!<br><br>Overall - I liked Penumbra, and if I was in the area I would go back, but I just wouldn't order the steak.  I would lean more towards the pork or shrimp dishes next time.", "pics": null}}, {"review": {"des": "Was super excited to try this place after reading everyone's raving reviews but was pretty disappointed by the experience. Went on a quiet night and there were two servers working maybe 6-8 tables. Our waitress greeted us when we first got there but then blatantly ignored us for about 30 minutes after that and we didn't even get to order a drink yet. We were polite and patient at first and tried to get eye contact with her as she walked past our table several tables. It got to the point where we physically had to flag her down. Finally we were able to order and we got the Bocaditos, Shadow Shrimp, and Pork. Everything was good but not amazing by any means. This place definitely didn't live up to the hype and we will not be returning.", "pics": null}}, {"review": {"des": "Great meal n great service from Vinny!!  <br><br>Went for my birthday with 5 friends.  I always like going to new places with lots of people so I can taste a variety of foods!! <br><br>Did check out the yelp pix but when I walked in it didn't look like the pix...until we walked to the back!!!<br><br>Dim, spacious room with sheer curtains that divided each table of guests.   Nice touch.   The place was a bit empty for a 7:30 on a Saturday night but maybe it more if a late-night place since it a wine bar as well. <br><br>Complementary cup of potato soup to sip.  Was delish!<br>Then did a few apps, 5 main courses n 3 desserts.  One of which was a birthday cake n the other 2 was their flan.  Liked it so much we ordered another one.  (Checkout pix) <br><br>Owner was very gracious.  Came to our t able to se how everything was.  <br><br>Good friends, good drinks, good food, good service...what more can you ask for???", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/VfEuKbRjhD-KvLyUv4BZfg/348s.jpg", "caption": "Like a Chocolate lava cake"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/nAvGdjDkauvZVnFT6irLJQ/168s.jpg", "caption": "(Front to back) New York strip, ribeye, salmon, veggies, shrimp."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/VWk8hI-iS6KqbEiBCPsUlA/168s.jpg", "caption": "Old fashion"}]}}, {"review": {"des": "This place must be new, because it wasn't that busy at dinner time on a weekday and it is awesome. Food is amazing and very affordable. They could probably charge double and I'd still go there. We had shrimp and salmon last time and they were both seasoned and cooked perfectly. The place is quite dark, but it makes for a romantic/intimate feel. Service was excellent. Everyone is very prompt, professional, and courteous. One of the best value meals I've had in Chicago for sure. I will definitely be going back.", "pics": null}}, {"review": {"des": "First of all the service as outstanding.  What I love about the place is that it is family owned and they take care of you like a member of the family the moment you walk in the door.  I had the salmon and it was delicious through and through.  My wife had the scallops and vegetarian offering, also delicious.  We finished the meal with a homemade rum raisin ice cream.  Also quite nice.  The atmosphere is outstanding.  You have a level of privacy with curtains wrapping around your sitting area.  Give this place a try.", "pics": null}}, {"review": {"des": "Wow! This little hidden gem is amazing! We had reservations got there early and they still sat us right away. Our waiter Sebastian was very wonderful he was very calm and super informative on the wines and food. <br>The ambiance is very romantic great for a date night. <br>The food was amazing cooked perfectly. We will definitely be back. 5 Stars all the way.", "pics": null}}, {"review": {"des": "Great place for a couple's night out. Loved the food too. My husband had the ribeye and I had their harvest plate. Yummy! <br>We also got some soup (on the house!) which was a delicious corn, squash soup. I'd recommend it to all couple's looking for a romantic night out! Cheers!", "pics": null}}, {"review": {"des": "Latin inflected, carefully prepared food. The Ecuadorean owner and her son are charming. For a wine bar, the list and staff need to be better. Romantic atmosphere. Good night out.", "pics": null}}, {"review": {"des": "Terrific spot. Good prices and amazing food. Service was very good but I also came in around 530pm so the place was half full", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/SjtnztXD4lBg2ousNdDCEw/348s.jpg", "caption": "Dessert"}]}}, {"review": {"des": "This. Place. Is. Amazing.<br>Go here and bring a date. Super romantic and the food & wine are off the charts.", "pics": null}}, {"review": {"des": "Wooh! I live in Logan Square and have walked by this place so many times without realizing the magic happening inside!  When you look or walk in, all you can see is a bar area.  Really cute but doesn't look like much is going on.  When you go to get seated in the back you walk into a dark, draped, and very romantic dining area.  I came with my sister and wasn't on a date, but it was still very nice to have more of an intimidate scenery!<br><br>To start off we ordered spicy jalapeño margaritas and the classic ceviche.  All I can say is perfection!  Then got the Ribeye and Creole Jalapeno Shrimp and a couple coconut mojitos.  The Ribeye was a little too salty for my taste but would defiantly order it again.  -Just tell them light on the salt.- The Creole Jalapeno Shrimp was everything I wanted! The side salad, Mango salsa and potatoes added a nice touch too!  For dessert got the Molten Brandy Truffle.  Warm gooey goodness, wanted another one when it was gone!  Btw everything I ordered was gluten and dairy free- Even the coconut mojito and dessert! <br><br>So ladies and gentlemen... it's true!  This place is defiantly 5 star material.  The prices, customer service, scenery, food and drinks=5 stars!  Don't let the outside fool you!  I actually can't wait to come here again!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/MuEz9OUzqo5BSam-zUCRlQ/348s.jpg", "caption": "Bday party!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/81bgsWgbbW5_Ycdms0pvOA/168s.jpg", "caption": "Dark atmosphere good food!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/4x_tYXJZNdw0WBqK8fKElQ/168s.jpg", "caption": "Fun night!"}]}}, {"review": {"des": "After an insanely hot day at Wrigley (I could have stayed in Texas for a feels like temperature of 108, y'all) we almost cancelled our reservation out of sheer exhaustion. Our taste buds were thrilled we didn't!<br><br>The owner personally greeted us at the entrance and showed us to our table. The decor and ambience is awesome... just plan to give your eyes a little time to adjust to the limited light. It is named Penumbra after all!<br><br>Our server, Salvador, could not have been more friendly, helpful, and a joy to be around.<br><br>The deliciousness started with an amuse-bouche of Creamy Roasted Poblano Soup and we followed that up with the full size Charcuterie. Nothing brings extended family together like battling over the last bite of cheese.<br><br>Our mostly steak-loving group ordered Ribeye, Flat Iron, New York Strip, and - at the recommendation of our server and new friend, Salvador - Creole Jalapeño Shrimp (extra Pineapple Relish please). Everyone raved about their entree, and the Flat Iron-eater repeatedly swore it was the best she's ever had. <br><br>Tip: Whatever side your entree comes with... go ahead and replace that with the Roasted Poblano Potato Puree. You're welcome.<br><br>Despite being pleasantly full, we couldn't very well not order desserts Rum Raisin Ice Cream and Molten Brandy Truffle with a side of more family battling over last bites.<br><br>I were a local, this would be my go-to dinner spot!", "pics": null}}, {"review": {"des": "Ambiance is great and the service was impeccable. The cocktails were on point and all good ordered was happily devoured (ribeye, scallops and shrimp). Great spot and worth the train ride.", "pics": null}}, {"review": {"des": "This place was fantastic!! The service, food and ambiance were absolutely perfect. This place is as described; intimate, romantic, classy and slightly upscale (not really). The food was as good as it looked but even better. Our server Sebastian was very informative and efficient.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/5sPR_UvSERSVKJXYq6-lfw/168s.jpg", "caption": "Scallops"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/mrP4i1EvUPPPTuA7QV-O8w/168s.jpg", "caption": "Rib Eye"}]}}, {"review": {"des": "My friend and I enjoyed very friendly and helpful service here. We were delighted by the amuse bouche of celery soup, and were immediately struck by the atmosphere. Seemed to be Moroccan inspired and intended to be very romantic. Although one reviewer thought handing out flashlights to read the menu was an indication that the place was too dimly lit, I thought the dim lighting added to the atmosphere and was impressed that the had the thoughtful foresight to provide flashlights. I suppose ultimately the truth is somewhere in the middle. A tiny bit more lighting wouldn't hurt.<br><br>On the note of atmosphere: I would highly recommend this spot for a romantic, intimate date. There were several private tables surrounded by drapes that offered a special ambience and experience.<br><br>Food and wine: we shared a bottle of Boneshaker Zinfandel which we thoroughly enjoyed. The charcuterie board was full of unusual selections which is always fun. We had the quesadilla on the waiter's personal recommendation, but admittedly couldn't see what the fuss was about. It was fine, but not memorable. Finally, we shared a piece of the bourbon cake for dessert and while it was very good, we both agreed it didn't really deliver on the \"bourbon\" flavor the description promised in the menu description.<br><br>A final aside: there is something unusual going on in both ladies' rooms with some unclear signage.  I could only guess they meant to instruct the customer on where to dispose of feminine hygiene products, but did not refer to them as such, which makes the signs a bit...confusing. I found these awkwardly worded sign(s) very bizarre and didn't know what to make of them. So odd that I still remember it after several weeks. Perhaps something for the manager to review and reword for clarity?", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Ct9DRooNYUZWbctWDy-UDw/348s.jpg", "caption": "Charcuterie board and the quesadilla"}]}}, {"review": {"des": "My husband and I were looking for a date night spot for our anniversary and found Penumbra on Yelp.  The food was AMAZING!  Seasoned and flavorful!  The ambiance was PERFECT!  We sat at a table with sheer curtains that gave just enough privacy to make it perfect for a date night.  We dined on the crab cakes, salmon and pork with coconut and pineapple mojitos.  There was no salt or pepper on the table because we didn't need either!  Also, our waiter was fantastic!  I see why other yelpers gave Penumbra 5 stars!!  We will definitely be back!!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/hJ92bEXBSpC3o8mEidasNg/348s.jpg", "caption": "Delicious food and ambiance!!  Just what the hubby and I needed...best date night this year!!"}]}}, {"review": {"des": "My husband chose Penumbra for my 30th birthday dinner based on the reviews and we were NOT disappointed. It's a small and unassuming restaurant front and when we entered, we were met with a huge group of people participating in the free wine tasting. We were led to the back of the restaurant which opened up into a beautiful and dimly lit room with curtains and cabanas and dining tables. They start you off with complimentary soup and we shared the crab cake appetizer which was delicious. I got the New York steak entree and my husband got the pork, both of which were delicious! We finished off with the coconut flan which was thick and creamy and amazing!! Our server Sebastian was excellent and prompt. He drew a rose with chocolate sauce and wrote happy birthday on our dessert plate. We met the owner and she was so sweet and nice. We loved our visit and we definitely will be back!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/jDZDvkDP1IUXkR4AlI-k2A/348s.jpg", "caption": "Coconut flan"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/7MSwc7rscMOeRjz1hL4cXA/168s.jpg", "caption": "New York steak entree"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/JYu8W6TJpyDROkwI-n8l2A/168s.jpg", "caption": "Crab cake appetizer"}]}}, {"review": {"des": "Beautiful restaurant with a bar up front and romantic restaurant in the back.  Definitely a date place.  It is a little on the dark side, but they have little flashlights for you, and can add lighting to your table.  It is so quiet....it feels like you are alone even in a restaurant filled with people.<br><br>You can tell this is a local establishment.  Lots of love in this place, including the food!<br><br>Menu notes which food contain dairy or gluten.  I ordered the Harvest meal with chicken added.  So delicious.  My friend ate the salmon which was spectacular.  The avocado crema with my dish was so tasty.<br><br>Sebastian was our server and he was great.<br><br>Wine list is substantial, although we did not have any.  <br><br>Great ambiance with excellent food.  I highly recommend this place for a romantic date!!", "pics": null}}, {"review": {"des": "I've been dying to try this place after reading the reveiws and gazing at the pictures. First I have to say if you weren't sure where it was you could miss it. It's so unassuming on the outside. Think curtains close, neon lights, tarot cards/ fortune teller. So I went on a Wednesday at 5:30. They open at 5. So well....we were the only one's there. Which is not quite the atmoshere I was hoping for. But again it was early.  We walked inside and I was immediately impressed. Like wow would have never thought it was so cute based on the outside. So well we sat in a cozy curtain enclosed area. Very romanric if I were on a date. Super nice seating area in the front if I were just coming in for a glass of wine. Highly attentive service. I had the rib eye it was delish!!! Perfectly cooked, and well seasoned. Great place for a date!", "pics": null}}, {"review": {"des": "Wonderful service, treated us like kings. Boyfriend had always walked by, never stopped in. Everything is reasonably priced. Very intimate romantic setting. Very welcome service even as we were shabbily dressed not expecting such formality. Recommendations on the menu were wonderful, and were give complimentary soup. Will definitely be back.", "pics": null}}, {"review": {"des": "I love the ambiance but little too dark for my liking. Food was absolutely delicious, the staff makes you feel special.", "pics": null}}, {"review": {"des": "It's rare to find a non-corporate restaurant in Chicago these days. Penumbra is owned by Sebastian and his mother Rita, and the small business/local vibe definitely comes across in the restaurant's amazing offers and service.<br><br>I came here last week with some friends and all of our dishes were excellent - we had the charcuterie board,  flat iron steak, salmon, and harvest salad. The garlic and herb sauce paired perfectly with my red meat, and surprisingly, the poblano potato puree was one of the best \"mashed potatoes\" I've ever had. Our waiter, Sebastian, was also quite knowledgeable about the wine varietals and origins of the different ingredients. <br><br>I came back a week later for Penumbra's wine tasting, which was a very fun and (wine) education-packed event.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/pmtjxuG9zbKEszTe4-l_wA/168s.jpg", "caption": "charcuterie board with 4 cheeses"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Fhb12O-jZqhxGHQtZOduAQ/168s.jpg", "caption": "flat iron steak"}]}}, {"review": {"des": "Finally came here around Valentine's Day.  Sure the decor seemed like an odd mixture of an adult version of Aladdin curtains with a Beauty and the Beast single rose on the table... but that's all just \"ambience\"<br><br>A nice selection of seafood, steak, pork, and chicken.  Sounds pretty basic, but the flavors were delectable.  <br><br>::Creole Jalapeno Shrimp::<br>A true oxymoron with these jumbo shrimp.  The grilled smokiness makes for the platform on which the spices and jalapeno dab on.  The pineapple relish is a little too sweet, but not awkwardly sweet like a super polite dentist.  Relish moderation is a good strategy to offset the savory that the shrimp brings.<br><br>::Scallops::<br>A little underwhelming, especially since they under-cooked the first batch.  But they remade them without any question.  Dat service... However, even the second batch of scallops had a little Big-League-Chew to it.  The avocado crema is also too delicate for this dish and like my sense of fashion can feel bland.  This can probably be fixed with better scallop sourcing.<br><br>::Nueva York Steak::<br>Thanks to Spanish II from high school I knew that this was a New York Strip.  The peppercorn crust on this was the star.  It reminds me of an Egyptian prince being mummified in the best pepper crust this side of the Giza.  Such care and precision helps keeps all the juices intact.  Slather on some poblano puree and see you in the afterlife...<br><br>::Pork::<br>If you couldn't tell, they don't mess around with naming their dishes anything elaborate.  Like... \"Chop of Ages\".   Regardless, it was a dish with depths of flavor.  The dry rub hangs around the pork like a needy boyfriend protecting the pork from any outside threats.   But uh-oh watch out for that sweet-spicy cranberry chipotle... Mr. Steal Yo Pork.<br><br>::Cocktails::<br>Little pricey, but worth taking the edge off.", "pics": null}}, {"review": {"des": "One of the best restaurants I have ever been no doubt, so unique, amazing food, great staff, awesome ambience, and doesn't break the bank! <br>Also happy hour was a nice surprise! <br>Will definitely try to come back!", "pics": null}}, {"review": {"des": "Penumbra is one of my favorite words in the natural sciences. In reference to the sun, it's the \"excited\" region of the sun spot. The outer layer where all of the electromagnetic influences dictate what happens in the darker center. That's why Penumbra is the perfect name for this Chicago gem. The atmosphere is dark and intimate. It's a perfect dating restaurant with light music playing in the background, never disrupting your conversation. I ordered a rib eye, medium rare (the only way to order a steak.) It was cooked to perfection and I'm not exaggerating. It came with chimichurri but to be honest, the steak didn't even need it. It was nice to ping pong between flavors though. This was my first time to Chicago and rest assured, on return trips I will be visiting this restaurant.", "pics": null}}, {"review": {"des": "Came here for a birthday dinner and everyone was so sweet. They asked if we had any special occasions and then ended up coming with dessert decorated for my birthday which was so nice. Our waiter explained everything on the menu. I had a the New York strip which was cooked perfectly and the poblano mashed potatoes and seasoned vegetables went perfectly with it cocktails were good as well. Very intimate and relaxing setting. <br>Definitely will be back!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/mAGqEh-Z3o9JK-974l1nmg/168s.jpg", "caption": "Birthday surprise!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/-xXkE3cKpjw047sT5MEQdA/168s.jpg", "caption": "New York strip"}]}}, {"review": {"des": "Lovely place, with a very intimate feel.  Perfect for a date night.  Each table for 2 (called \"cabanas\" by the hostess) is surrounded by a thin veil, which is nice and provides a bit of privacy.  The flat iron steak and accompanying salad were delicious.  Potatoes were ok.", "pics": null}}, {"review": {"des": "What an amazing meal!!! Started with prosecco that was actually DOCG!! Then to the charcuterie, scallops (mango relish FTW!) garlic lobster tail.....perfect start to finish!", "pics": null}}, {"review": {"des": "Price and service are a hole in one. Server was extremely knowledgeable about the wine selection as well as the food. <br><br>Look forward to visiting again in the future.", "pics": null}}, {"review": {"des": "Intimate atmosphere,  delicious Latin fusion menu,  wonderful service. I will definitely be going back!", "pics": null}}, {"review": {"des": "The cheapest fancy restaurant steak I've ever had, and it's such a steal - ribeye for only $25! My boyfriend and I made a reservation and were seated promptly. The atmosphere of the restaurant is nice and not too loud so easy to have a conversation, definitely an upscale restaurant but the prices for everything are so reasonable it's shocking! Our waiter Sebastian was excellent, very attentive, always filled our water cups, and was knowledgeable about the menu. My boyfriend ordered the NY steak medium well, and I ordered the ribeye medium rare. Both came out perfectly. Highly recommend this restaurant, and I'll definitely be back.", "pics": null}}, {"review": {"des": "Don't understand how this place has such a good review.  Mediocre food, mediocre service,  mediocre overall!!!  Will not visit again!", "pics": null}}, {"review": {"des": "The food is awesome. The cocktails are great. The owner is such a sweetheart. She makes everybody feel welcomed. This place is definitely a must. I will be back.", "pics": null}}, {"review": {"des": "This place is a little hidden gem. It's super cute and an excellent idea for a date night. So looking at it from the outside it looks kind of like a store front, but once you go inside it's so pretty and spacious. I had the Steak which was very tasty along with poblano mashed potatoes and grilled veggies. As far as drinks I had the late bloomer which was a champagne infused cocktail with a really pretty flower inside and also an old fashioned , Both were good. I recommend getting a dessert if your there, the rum raisin ice cream is super yummy and a perfect end to a lovely meal.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/tKn4H4rfmiolBMIBAfcvSA/348s.jpg", "caption": "Rum raisin ice cream"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/7SB_eTngTA4DDIMLIN6wbQ/168s.jpg", "caption": "Grapefruit old fashioned"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/sHOm49CrnT2EusMLZ_gKBQ/168s.jpg", "caption": "The late Bloomer"}]}}]}