{"name": "pi-hi-cafe-chicago", "reviews": [{"review": {"des": "This place is sooo good. It's small and gets busy easily, but the people are always nice. The food is always good. I also would highly recommend trying their iced coffee which is super good.", "pics": null}}, {"review": {"des": "Great people behind the counter. Great service. Really good food. Really enjoy the falafels and hummus. I almost never care about rice, but man their yellow rice is fantastic. Prices are incredibly low - you get a ton of quality food for your buck!", "pics": null}}, {"review": {"des": "Overall: If you are looking for a fast and super casual lunch or dinner option, definitely grab some falafel at Pi-Hi.<br><br>The good: I'd guess to say this is probably the best falafel in the area. Not the best in the city by any means, but it's pretty freakin' good and comes out hot. The pitas that we got were stuffed to the brim (one broke) with hummus and veggies, and the sauces provided were creamy and spicy respectively. The portion sizes were filling and not too overwhelming, the menu is well-varied, and the prices are fitting for the quality and size you get.<br><br>The not-so-good: While the food was hot and fresh, it did take quite a bit to come out. For a \"fast casual\" experience, we were there for probably 40 minutes total. The atmosphere is lacking, with an absence of decoration, theme, and overall cleanliness. Not enough to sway you away per say, but it's not necessarily welcoming either. The cashier wasn't very conversational.<br><br>Atmosphere: 7.5/10<br>Service: 7.5/10<br>Food: 9/10", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/AyENwHAbUky7LwXU3sqPNw/168s.jpg", "caption": "Falafel side"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/pPAufFlNndAuvNsKyfJF8A/168s.jpg", "caption": "Chicken shawarma sandwich"}]}}, {"review": {"des": "UPDATE: this pizza is still consistently amazing- quality of food and service is always awesome!<br><br>HOW HAVE I LIVED A MINUTE WALK AWAY FROM THIS PLACE AND I ONLY JUST ATE HERE?!?!?!?<br><br>I've walked past this place a million times, and assumed it was just Mediterranean food. It is Mediterranean food, but they also have a wood fire oven for PIZZA! How on earth I missed this I have no idea. I don't like gyros or other Mediterranean food so I never bothered coming in here. <br><br>The pizza is freaking amazing, as is the service. They are massive pizzas and they use fresh mozzarella (!!!) <br><br>The lady at the front counter was so friendly and wonderful. This will be my go to pizza place for sure.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/62s8w36IA3Wpq4_81tmiXA/348s.jpg", "caption": "Yum!"}]}}, {"review": {"des": "Pi-Hi Cafe is Mediteranean Restaurant on the east side of Western Ave across the street from Lane Tech High School in a tiny little strip mall.  <br><br>I'm always looking for something new especially Mediteranean food.  Pi-Hi has a small dimly lit dining area.  They serve a variety of Mediteranean dishes and oven baked pizzas that look very good.  The owner was super friendly telling me a little about various options they serve.<br><br>I'm not sure why, but tonight I chose a vegetarian dish that came w/4 falafel, baba ganoush, hummus, tabouleh, dolmas & salad.  The falafel was delicious seasoned w/Garlic, The baba ganoush was also delicious (but a little too salty for my taste), the hummus was ok and the dolmas was also very good but a little too salty.  They also have 3 their own sauces, a hot sauce, tahini & a Garlic tahini (my favorite).  Overall it was a pretty good meal.<br><br>I would like to come back and try some of their other dishes like the chicken shawarma and maybe one of the oven baked pizzas.  They looked delicious.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/5hrZYLQPdl3VaZSJJQ5Ieg/348s.jpg", "caption": "Vegetarian Combo - 4 Falafel, BSN ganoush, tabouli, hummus, dolmas & salad"}]}}, {"review": {"des": "I came in for the juice and smoothies unfortunately they do not do that anymore. Havent had the pizza but the falafels were good.", "pics": null}}, {"review": {"des": "Ordered the veggie platter and the food was just so-so. Babaganoush was quite slimy. Rice was greasy and bland.  Pita/Hummus were average. <br><br>The sauces that came with as sides were terrible and tasteless.  Watery tahini and some green thing that tasted like bitter pesto.  <br><br>I would not recommend this place for their food.", "pics": null}}, {"review": {"des": "I ordered through DoorDash today for lunch. Omg the flavors were amazing. I had a beef and chicken shawarma with salad and hummus. The hummus was a tad bland but all the other flavors made up for it. Large portions, I couldn't even eat half of it. Very pleased I will be ordering again.", "pics": null}}, {"review": {"des": "This place has the best avocado panini! I order from here at least once a week for lunch and I'm never disappointed! They're fries are also good! The pizza is good! Everything I've had here is good. I always order ahead and it's always ready when I pick it up. The owner is nice and friendly, when he's there he's always hands on, taking orders, talking to customer and on the few occasions that we've eaten there he's given us free samples of food! Love this place in Roscoe village!", "pics": null}}, {"review": {"des": "This place really is as good as people are saying! We ordered 2 chicken combos for delivery last night which came with your choice of two of their types of chicken (the curry chicken is excellent and very flavorful!) rice, hummus, one falafel, one pita, and salad plus sauce options. The falafel was truly delicious and very savory, I wish I had ordered more. The food came fast, was warm, and delicious. We are already looking forward to ordering again... next time pizza!", "pics": null}}, {"review": {"des": "Okay so I gave them another chance and ordered the beef kafta sandwich and to my delight it was amazing. I was a little bitter about my kabobs but hopefully one day they will be back but until then ill do the other beef options that they have. Im glad I came back everything is still just as delicious and the staff just as friendly.", "pics": null}}, {"review": {"des": "Best Mediterranean food I've ever had. Everything tastes so fresh. They have the classic Mediterranean dishes but also pizzas and paninis. This place is a must go if you're in Chicago. Has the classic neighborhood restaurant feel and incredible hospitality. Great options for vegetarians, vegans, and meat-eaters, too!", "pics": null}}, {"review": {"des": "Great food at a great price, don't let the outside appearance fool you.<br>I eat here at least twice a week...", "pics": null}}, {"review": {"des": "They have a few vegetarian options. The avocado spinach panini is delicious. The tabbouleh salad is on the salty side.", "pics": null}}, {"review": {"des": "I finally went in today after having this as my go to cheap but so good pizza for delivery!<br>If you like pizza or falafel go here. <br>They are well priced with excellent food. <br>I'm so glad I went in, the service was delightful! I felt great about going back to work after my lunch break. <br>Chill  and friendly atmosphere fine for anyone but maybe large groups of like 8 or more. <br>Falafel isn't dry and pita is fresh. Couldn't finish my food cuz I just had alot. <br>They have a parking lot so they are easy to get to. <br>They have been flexible with me when I had time constraints when getting delivery. <br>They have deals for lane tech high school", "pics": null}}, {"review": {"des": "Yeah this place is the best. I've had a lot of items on their menu and have loved it all. I've even had their catering a couple times too and each time they were very helpful with taking the order and confirming it the day before and the day of. The owner is very nice and loves to chat with the customers too.", "pics": null}}, {"review": {"des": "before you start throwing rotten tomatoes at my review...<br><br>please hear me out. i've read review after review about how awesome the pizza is but my family and i opted to go middle eastern instead. the boys enjoyed their meat dishes but my veggie combo plate was seriously lacking in FLAVOR all around. i normally think EVERYthing is salty but i was seriously stretching my tastebuds to find any sort of spice or taste in the hummus, baba ganoush, falafel, salad and (drier than toast) pita. my friend claims this her favorite falafel but i could NOT disagree more. aside from falafel i've had from the middle east (ok, i know i can't be that picky moving back to chicago), i put naf naf on a pedestal in this department. i SO want to love this place but thinking i need to move on to their pizza. i absolutely will not try anything else off their middle eastern menu...", "pics": null}}, {"review": {"des": "Wow! We ordered delivery from here at the office today.  Mixed up things and tried a variety of items. The food was delicious and very fresh.", "pics": null}}, {"review": {"des": "Looking for a spot that's quick, affordable and has wood-fired pizza? Then this is the place to go. While they may be a Mediterranean restaurant with great hummus and grape leaves, the pizza here is what does it for me. Nothing better than a thin, crispy, wood-fired pizza to fill your stomach after a long day. This place is definitely one that I love going to when I'm in this part of town.", "pics": null}}, {"review": {"des": "This restaurant is excellent.  The owner is very involved whenever I go in to eat or carry out.  My picky daughter  loves the pizza bites and their pizza asking me to order delivery often.  We had Pi Hi cater our staff lunch meeting and my 25 employees loved it, price was reasonable and lots of food.  My favorite place to order delivery or carry out.  Love the food and the owner really cares!  I'm a healthy eater and this food is within the range of limitations for my diet.  Delivery through Grub Hub is super fast and really nice delivery guys too!", "pics": null}}, {"review": {"des": "Had their chicken chipotle plate today and it was good, but I'm not sure where all the 5 star reviews are coming from?<br><br>Atmosphere: It's hidden in a strip mall with a fairly bare bones interior. Clean which is a plus!<br>Service: You order at the counter. The cashier was nice enough and gave me recommendations. No complaints.<br>Price: Average. My plate was around $10 for rice, chicken, salad, hummus, and pita. <br>Food: It was definitely good, and since I work around the area I will probably be back. BUT... I definitely would not go out of my way to come here.<br><br>Overall, it's a great local business. Will add to my go to lunch spots if I'm working in the area!", "pics": null}}, {"review": {"des": "I've always seen this place on my way home from work, and after my favorite Mediteranian restaurant closed recently I decided to give it a try. Based off te service alone I would go back. My husband ordered food and I stopped to pick it up. I think it was the owner who helped me once I arrived, but regardless it was great service. We ordered two chicken kabob dinners and paid $20 and some change. The price was fair and the portion was huge! Everything was absolutely delicious. The chicken was so flavorful. I absolutely loved everything... the food, the price, the portion, and the service. I'll be back very soon.", "pics": null}}, {"review": {"des": "Food is great, staff is very welcoming and helpful!  It is a very small place and at lunchtime on a weekday, was PACKED with high school students from across the street.  Nonetheless, I'd love to eat at Pi-Hi again.", "pics": null}}, {"review": {"des": "DEFINITELY RECOMMEND THIS PLACE! First time coming here today and my boyfriend and I already can't wait to go back and try the other items. We had the half dozen falafels and the Mediterranean pizza. Falafels are hands down the best I ever had. They were tasty, fresh and a good size for each! There were also three different sauces that you try with the falafels. Of course I didn't ask what the sauces were due to the excitement of how amazing they were lol. The Mediterranean pizza was just as appetizing (had chicken AND beef shawarma). It's a ten inch pizza that typically serves 1-2 people but we ended up eating half and took the rest home. Ferris, the owner, was extremely nice! You can tell just by his hospitality that he really cares about his staff and his customers! Overall they have high quality, homemade food and welcoming staff!!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/hcFFYqR1HO2V3FFYOwsfuQ/348s.jpg", "caption": "Half dozen falafels"}]}}, {"review": {"des": "You can drive right by without noticing Pi-Hi, which is in a small strip on Western Ave.  Very unassuming front with signage denoting a fiery flame, but this camoflauges the name, especially at night. We wanted to check out the only Chicago restaurant that made the Yelp top 100 in the US!  Ultimately, good food on a budget, but I wouldn't go out of my way to eat here.  The owner couldn't be friendlier, which I believe encourages the glowing reviews.  <br><br>The meat in the beef shawarma is fine cut so every bite is flavorful.  The plate is an excellent value and comes with rice, salad, falafel, hummus and pita bread.  I loved the beef shawarma and falafel, but the hummus and pita were lacking something.  The hummus tasted plain and the pita wasn't the freshest.<br><br>A good wood-oven pizza has an incredible crunchy crust but their version was doughy.  The margharita pizza was covered with basil, and the herb overwhelmed the flavors.  The sauce was also on the sweet side.  I would return for the schwarma but not the pizza.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/HJ131YIR-T-kM93uGQqTsA/168s.jpg", "caption": "Beef Shawarma Plate"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/fwi7oFWZDgkAKSNnq2lb8A/168s.jpg", "caption": "Margherita Pizza"}]}}, {"review": {"des": "It's really convenient for me to stop by Pi-Hi to grab food and since I love Mediterranean, I'm happy that it's so close by. The chicken shwarmma is fairly good so I tend to get a plate of that or sometimes the combo chicken which also comes with kebobs. The hummus is delicious and since most Mediterranean places don't include hummus in their meals, it's a really good bonus! On the other hand, the rice is rather plain though - it's missing some spices that could take it to another level. Also, the garlic sauce that I opted for on the side did not taste like garlic at all! <br><br>Falafels - does not compare to Pita Inn...I am a strict believer that Pita Inn has the best falafels in the world so I was dying to try the falafels here given that some reviews have noted that the two are similar. Nope! Sorry, but Pita Inn still trumps all. It's not bad here but it's just not comparable. <br><br>Sweet potato fries - Hm...what to say. Definitely not the best sweet potato fries I've had. It could be a bit crispier and less burnt on the edges though with more flavoring that actually sticks to the fries. <br><br>Dolma - fairly cheap. You get 6 small ones for $2. I wish there was more stuffing to fill out the grape leaves.<br><br>Pi-Hi didn't live up to its amazing reviews for me in terms of their Mediterranean food but I do plan on trying their pizzas and paninis later.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/OPodQkgwziMhD29sP3BvNQ/168s.jpg", "caption": "Chicken shwarma plate"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ga_S6jNEw5TnNh-2ESMctw/168s.jpg", "caption": "Sweet potato fries"}]}}, {"review": {"des": "I have only gotten delivery. It the food has been top notch.  More to come once I've explored more of the menu.", "pics": null}}, {"review": {"des": "Tiny little place with big flavors that are not rivaled by any other. I think this is top pizza in Chicago if you like thin crust. You must have their panini. Their panini are might fine as well!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/S0-FwSiFoXpuYH2AG2ky-A/168s.jpg", "caption": "Panini and Mediterranean entree menu"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Fo-QBMFQSY9m1GUXy5zl2g/168s.jpg", "caption": "Juices and smoothies menu"}]}}, {"review": {"des": "We had to host 25 grad students and faculty for dinner. Luckily, I found this place!! The food was absolutely delicious and super fresh. There was something for every diet restriction. The falafel is easily one of the best in the city, and still thinking about that baba ganoush. Prices were super reasonable and the customer service impeccable.", "pics": null}}, {"review": {"des": "Really great meats. We got the shawarma as well as the beef meat and loved it. We're so used to big portions of meat which this was lacking (we like leftovers) which would be my only complaint. Also we aren't huge fans of rice and there was a ton of that so it went uneaten, although it wasn't bad.", "pics": null}}, {"review": {"des": "HALAL PEPPERONI. HALAL SAUSAGE. <br><br>Right. Now that we have that out of the way- if you want some halal pepperoni (beef, obvs) pizza and you don't want to trek out to Devon (ugh), try Pi-Hi. Honestly, I have driven past here a million times but never realized it was food... doh. I think I saw the sign which has flame design on it, and the word \"Hi\" and assumed it was a vape cafe or something? Whoops.<br><br>The pepperoni is delish (sujuk, for those of you who know what that is) and the sausage they use is crumbled kefte kabab and it is delicious. Like I kept picking pieces off, eating it, and exclaiming \"Mmmmmmm!!!\" (I should have probably ordered it to go, for obvious reasons...)<br><br>Next time I'd ask for extra toppings (I just wanted MORE MORE MORE), and, I'd probably order a second pizza, but that's just me. My husband and I polished off one pizza in no time flat, but we also like to eat, so two normal people can probably get by with one :)<br><br>Super nice staff. Menu looked tasty. And according to (I think he was) the owner, everything but the turkey is halal for those of you who care.<br><br>See you soon, Pi-Hi!", "pics": null}}, {"review": {"des": "Will definitely go back! I don't know how I haven't tried this place since it's only a block away, but the food was delicious and the customer service was great. Falafel was probably the best I've ever had. 100% recommend", "pics": null}}, {"review": {"des": "I've passed this place soooo many times. Now I just imagine how many great meals I've missed by not trying it sooner. This place is awesome. I had the chicken kabob sandwich, and it was phenomenal. The staff was very friendly and I was impressed with the amount of choices on the menu. It's right across the street from late tech, has a lot of parking, and will be my go to spot from now on.", "pics": null}}, {"review": {"des": "After looking at all the stars and wonderful reviews, I was so excited to try. Food was very disappointing. Worst hummus I have ever had in my life. Shawarma did not taste authentic at all. We tried both the beef and chicken. The only decent thing we had were the falafel pieces.", "pics": null}}, {"review": {"des": "My friend says I give way too many five stars (what can I say -- I have good taste and know where to go...) However, when I brought him to try the Mediterranean Pizza and the Spicy Chicken Shwarma plate, he was amazed. He would give this place a five star too. I think I saw his eyes roll to the back of his head because the food is so good. <br><br>The Mediterranean Pizza probably ranks as one of the best five pizzas I've ever had in my life. The wood fire makes all the difference. The dough is delicious, the meat is fresh and succulent, the sauce is slightly sweet, and the basil adds another level of freshness. I also enjoyed the chicken plate but not as much as the pizza because it was THAT good. I also enjoyed the falafal as well. <br><br>The owner is also super humble, very wise, and very passionate about his business. He gave us dolmas and baklava and the baklava BLEW me away. There's something so different about his baklava compared to the usually very, very sweet baklava that I usually have eaten.<br><br>Anyways, come and support this business! It's a fairly new one but definitely worth the trek from wherever you are. ORDER THE MEDITERRANEAN!", "pics": null}}, {"review": {"des": "Amazing food! I had the Chicken Shawarma plate and would definitely get it again. The falafels are fresh and a must have. <br>The dine in area is small so if you have a large party, greater than 4 people, it might be easier to do take out.", "pics": null}}, {"review": {"des": "The portions- huge. <br>The prices- amazing. <br>The service- phenomenal. <br>The taste- fantastic. <br><br>My boyfriend and I first visited a few weeks ago. We mentioned we were vegetarian and the owner kindly recommended a few of the many options he had for us. We first ordered to stay and then remembered about 7 minutes later that we had a commitment elsewhere. He was very accommodating and the food came very fast! I got a red pepper panini and my boyfriend got an eggplant panini along with a pizza, all were top notch. He even sent us home with some complimentary Baklava. This man was so great to us- I hope the best for his business because he deserves every drop of success he can get! We will definitely be frequenting this place- fantastic food for amazing prices.", "pics": null}}, {"review": {"des": "Hands down some of the tastiest, most unique pizza in Chicago!  The service is also some of the friendliest I have ever experienced!  We got the beef shawerma pizza and sausage pizza (they have many halal items on the menu).  The pizzas were freshly made and ready in no time.  The sauce and the toppings really took it to another level- I've never had shawerma on a pizza!  They also have milkshakes, smoothies, sandwiches, etc.  I'm going to order falafel next time (which the host graciously allowed us to sample- crunchy on the outside and soft on the inside)!", "pics": null}}, {"review": {"des": "Food was decent.  However I placed a takeout order and told it would take about 15 minutes to be ready for pickup. (Average time of takeout)  not a problem.  I got to the restaurant 35 minutes later.  They asked what I ordered and took my payment.  I then proceeded to wait an additional 15 minutes before I realized they never even started cooking my food.  (I was watching the cook in the back prepare other meals)  I then asked them what the holdup was and if my order would be ready soon. Mind you this is 50 minutes after I called and placed the order.  They then rushed to the kitchen and were talking about my order.  The cook finally prepared my order and it was ready in 7-10min.  Most definitely a terrible experience as my order was completely forgotten.. Even after they asked me what I ordered and I paid for it when I got there 35 min after I called the order in!!!!  Look I know mistakes are made all the time that's fine I've been in the service industry for many years but this was over the top.  Stupidity.  Food was average like many other Mediterranean restaurants no real complaint there.  Honestly I'll never order or eat here again nor recommend dealing with very slow employees.", "pics": null}}, {"review": {"des": "This place has a little bit of everything! Always great service and fast delivery. It's great for when neither of us want the same thing - he usually goes for the gyro plate and I love the margarita pizza!", "pics": null}}, {"review": {"des": "This is a pretty small but great place to get some quick, good food. The food is really flavorful, and they have a lot of options for affordable prices. It's mostly a carry out place since it's super small with not a lot of seating. They do a great job with the pizza, which I prefer to anything else. The fries are also pretty good - as crispy as you'd expect from a small Mediterranean place like this. All in all a really solid choice for weekend lunch after a long night.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/kS9LCOCwznBXNn3RAwYJhw/348s.jpg", "caption": "Menu(2/2)"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/h3ARDkUEnLbWYjnklvXH3A/168s.jpg", "caption": "Menu"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/1iPYiFr5p1xO7PasOJk7gA/168s.jpg", "caption": "Sausage pizza"}]}}, {"review": {"des": "Amazing food and fantastic service! Did a catering order and it was so delish, on time and easy to work with. Would recommend again and again!", "pics": null}}, {"review": {"des": "So my boyfriend and I decided to try this place out. We walk in, place was full but we mentioned that we were both new and have some questions. <br><br>Our server was extremely helpful and attentive. He sat us down and answered all questions and gave us amazing recommendations. <br><br>We ordered the pepperoni Pi and the chicken combo plate (recommended by our server) and let me tell you, IT WAS DELICIOUS! We also each order their homemade strawberry lemonade and the regular homemade lemonade. Also GREAT. <br><br>All Ingredients are fresh and the service is great. If you haven't been here, GO! YOU WON'T REGRET IT!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/rwwHZSylP1yuETR2qBUG-w/348s.jpg", "caption": "Pepperoni Pi was to die for!!"}]}}, {"review": {"des": "Best Turkish/Mediterranean / Halal food. Very delicious house special pizza. Good customer service. Food was fresh and quick service was offered.", "pics": null}}, {"review": {"des": "TL;DR<br>Great, friendly service. Mediocre food but affordable.<br><br>Food: I've only had the Mediterranean-type food on the menu such as the falafel and chicken shawarma and it's all very bland. The beef kafta is good but there have been some time where I found it to be under-seasoned so I guess food quality here is very dependent on who's the chef that day. I have yet to try their pizzas but I've heard good things. I will come back to try them some day. Other than that nothing to get excited about unfortunately.<br><br>Service: Everyone who works here are very nice and helpful. A+ for that.<br><br>Atmosphere: The place is located in a small strip mall but it looks rather nice on the inside. Very clean but very small. A decent spot to go to if your by yourself or have no more than two friends with you.", "pics": null}}, {"review": {"des": "Absolutely PHENOMENAL! NOT only was the food great the customer service was Superb. This quaint cafe is a well hidden gem in the Roscoe Village community. A lot of food for reasonable prices, fresh food, great salads. You must stop in, you Wwon't be disappointed. #1sttimecustomer#willreturn", "pics": null}}, {"review": {"des": "If you are searching for a slice of Mediterranean heaven and wood fire pizza, the search is over. Visited this small restaurant last week and now I know what all the buzz is about! Unlikely combination of wood fire pizza, panninis and Mediterranean selections makes this place unique and able to satisfy a range of tastes.<br><br>The moment I walked in I was warmly greeted by one of the owners, Ferris. The place was jammed packed with Lane Tech students and there were no seats available. He kindly let me know they'd be leaving at 11:30 and offered me lemon water. As busy as it was, he found time to speak with me and welcome me as I let him know it was my  first time at Pi Hi Cafe.<br><br>Every person working here is very friendly and attentive. Excellent customer service is an obvious priority, as well as fresh and scrumptious food. <br><br>As I sat down, I met the other owner and he was just as friendly and attentive as his partner. He offered me a free piece of baklava which was ooey gooey piece of sweetness. <br><br>Their passion for good quality food is evident as I devoured my chicken kabob plate which had salad, rice, hummus and falafel. I don't normally like falafel, this one you cannot pass up. The hummus does not taste very traditional and I have no clue what makes it different. I cannot wait to come back and try their other dishes. <br><br>Thank you Pi-Hi Cafe for treating me like family. We need more great restaurants such as yours. I wish you all the success in the world.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/75razLf_XejJuKGiEHMzeg/348s.jpg", "caption": "Chicken kabob plate"}]}}, {"review": {"des": "Cozy place for quality pizza. The actual restaurant itself is reminiscent of New York style pizzerias in that most people carry out and there isn't much seating. The staff was very friendly and welcoming, even before they learned we would be dining in. My friend and I shared the Mediterranean Pi- it was delicious, and it was the perfect portion for the two of us.<br><br>As it turns out, Pi-Hi Cafe is across the street from my friend's partner's high school. She mentioned that her partner used to go all the time for lunch during high school, and immediately the owner/manager remembered him. I think that truly speaks to how much they care about their customers.", "pics": null}}, {"review": {"des": "Pi Hi Cafe is not to be missed!  The food is delicious and the customer service is top notch.  Highly recommend the grilled vegetables which comes with hummus, salad, rice, falafel and pita.  Absolutely delicious!   The restaurant, located right across from Lane Tech High School, recently donated food for Lane's athletic fundraiser.  A true community partner!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/9xtZeJUsBjFS2stjVM2n0g/348s.jpg", "caption": "Pi Hi Cafe's delicious food."}]}}, {"review": {"des": "Brought a group of eight for dinner this week; solid across the board.  Even though Pi-Hi is a Mediterranean cafe, you walk in thinking this is a pizza place, but everything is pretty tasty.  I tried the sausage and pepperoni pizza, which was good and actually had enough meat on it to keep me happy...the fries, hummus and pita offerings were also good enough.  The real winner here is the falafel, which is bordering on my new favorite in Chicago (although I have had good falafel at places like Falafel & Grill in Wicker or Taza in the Loop)...very fresh, tasty, not dried out at all, a winner.  Prices here are very fair--I ordered some falafel and two individual pizzas and came out of this for less than $25.  Me gusta!<br><br>Service is great and the owner/manager (not sure which) on the night we were there was very accommodating.  Also--BYO policy here is a little fuzzy, but for now assume that it's BYO if you show up close to 7:30 or 8 during the week and it's not crowded.  It sounds like you don't want to show up with your own booze here any time when one of the HS students could show up from across the street to grab a pie.", "pics": null}}, {"review": {"des": "Great as always <br>I've been coming here for the past 2 years <br>Best falafel in north Chicago <br>Got to try it", "pics": null}}, {"review": {"des": "What a hidden gem! I don't think I would've noticed this place if I had just passed by. Thank goodness for Yelp! We went in close to closing time on a Tuesday night. And the owner was nothing but nice, I'm sure a lot of other places would've been annoyed with someone coming in 1/2 hour before closing!I really wanted a pizza, but the oven was a bit on the cool side and I would've had to wait...and I was starving. So, I went w/ a panini. I had a chicken, spinach, provolone, roasted pepper panini. Once I got my order, I noticed that they forgot the cheese. I went back up and the owner and cook were SO apologetic! They must have apologized 10 times! That showed me they care about their customers. My husband had an eggplant sandwich and he enjoyed it. We shared a hummus which was yummy as well. I was watching other customers come in and all were greeted in a friendly manner. <br><br>I will definitely come back to check out the rest of the menu! Love hidden gems like this!", "pics": null}}, {"review": {"des": "After church we were starving and wanted something quick and tasty. Boy did we get that and more! Chris has some of the best customer service I've ever had. The bathrooms, which I count in my reviews, was immaculate, and everyone at the table was beyond pleased with their food. We had chicken schwarma and the beef combo. The beef was better than the chicken, and I'll be ordering that the next time we go. $30 for 3 people isn't too bad either!!!!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/74GM3mM0sD6MionY6tIiGg/348s.jpg", "caption": "Chicken schwarma"}]}}, {"review": {"des": "Alright, this review is way overdue as I've probably put someone's kid through college with all the food I order from this place.  Truth is I can't say enough good things about this establishment.<br><br>First of all, the food.  If you want, super fresh, delicious Mediterranean food, you've found your spot.  I love the Chicken Combo plate here.  The chicken is succulent with a bit of char, the salad is tangy and delicious, the hummus is fresh and light.  And if that's not enough to get you in the door, TRY THE DAMN PIZZA!  Seriously, in a city of amazing pizzas, Pi-Hi makes theirs unique enough to stand out on its own.  It's light and fresh, cooked in a wood oven and the flavor profile is unlike most of your standard pizzas out here.  The pita and spice give it a middle eastern flair that have me ordering from this place again and again.<br><br>And if that wasn't enough, the owner is one of the nicest guys around town.  Customer service is fantastic here.  These are the kind of people who get to know you by name and always appreciate your business.  These guys take pride in their establishment and it shows from the high quality of the food they make to the phenomenal customer experience they provide.<br><br>It's always a pleasure ordering from here.  Keep up the good work guys!", "pics": null}}, {"review": {"des": "Sorry but I don't really think they know how to make a falafel sandwich.. or if they've ever had one. The cucumber salad was just dry leaf lettuce with 2 slices of cucumber with a dab of hummus. <br><br>We ordered online and picked it up. Everything was dry. My friends had paninis which weren't impressive at all. We asked for cheese fries with the cheese on the side but they put it on the fries anyway.<br><br>Everyone agreed everything was just ok. Especially for the price, not ordering from here again.", "pics": null}}, {"review": {"des": "Our first time here, we got the chicken shawarma plate and a veggie pi. I can't express the yumminess of this meal. <br><br>The chicken shawarma was so fresh and tender. The falafel on the side was legit! I try falafel everywhere I can, and most places are dry and gross. Falafel here is perfect, crispy on the outside and soft and flavorful on the inside. The one I tried was so good that I had to order some to go! <br><br>The pizza.... Oh the pizza... I will be having dreams about this pi with perfectly crisp crust from their wood burning oven. <br><br>The only thing that pisses me off is that I didn't come here sooner. I guarantee this will become a regular spot for me.", "pics": null}}, {"review": {"des": "This is the kind of place that takes pride in every serving. Super friendly staff and always delicious food. Great value and fast. A neighborhood favorite.", "pics": null}}, {"review": {"des": "I was completely taken aback at how well they treat customers. You can tell they really care about their food. You even get greeted by the chef walking in (even on busy days when youre surrounded by lane tech high school students!). Its a diner atmosphere, but its worth going to if you feel like youre craving something but dont know what. Because they have everything. My favorite so far is the grilled eggpland and chicken kebab plate.<br>If you want to be impressed by some good service, look no further. Even writing this review im craving them.", "pics": null}}, {"review": {"des": "PI hi catered my daughter's first birthday party. I chose them because the owner's children attended the same preschool as my son and I wanted to give my business to a local owned small business. Ferris and his crew totally delivered. We ordered full trays of chicken and beef shawarma, hummus, salad, rice, pita bread and a few pizzas for the kiddos. All of our guests loved the food! We had a lot leftover, but that was fine with us since we enjoy eating it. I would definitely recommend this place for an evening meal for family or for a large group.", "pics": null}}, {"review": {"des": "Omg omg omg<br><br>It is worth the speeding ticket you will inevitably get whilst on Western to get these folks' wood fired pizza. They say they only have personal pizzas, but it's really like a small. We ordered three for two toddlers and four adults and had some left over. <br><br>My kids are major olive aficionados, so their house-made pickled green olives were a huge hit.", "pics": null}}, {"review": {"des": "Awesome chicken shawarma! My fiancé and I order from here very often! Usually it's a super quick delivery and great service! Great find! We love it!", "pics": null}}, {"review": {"des": "There is a reason this place is so highly rated; it is great! Went to try the pizza based on its ranking in Chicago magazine. The pizza did not disappoint, and their sauce and seasoning blend is delicious! The owner was very welcoming and friendly, taking the time to talk to us when we picked up our order. <br><br>When we opened our order at home, I realized the two falafels I ordered where missing but dismissed it because it only cost $1 and we were already enjoying the pizza. I was so surprised when the owner called me to apologize for missing that in the order, and offered to have his delivery driver drop it off!! A special delivery for two falafels?! Very impressive! Not to mention when the driver came a few minutes later, they included a piece of baklava as an apology. Seriously impressed with the food and customer service of this place. Will definitely be back!", "pics": null}}, {"review": {"des": "Give yourself a high five ladies!  You're number 100!!!  An undiscovered gem per the yelp data wizards (with help from darwin the dog).<br><a href=\"http://officialblog.yelp.com/2015/01/yelps-top-100-places-to-eat-in-the-us-for-2015.html\">officialblog.yelp.com/20…</a><br><a href=\"/redir?url=https%3A%2F%2Fwww.google.com%2Fsearch%3Fq%3Dyelp%2Bdarwin%2Bdog%2Bphotos%26es_sm%3D93%26biw%3D1600%26bih%3D799%26tbm%3Disch%26imgil%3DZfvF-9lTcewJvM%25253A%25253BWyKGI5JGFUVbAM%25253Bhttp%2525253A%2525252F%2525252Fflickrhivemind.net%2525252FTags%2525252Fdarwin%2525252Cyelp%2525252FInteresting%26source%3Diu%26pf%3Dm%26fir%3DZfvF-9lTcewJvM%25253A%25252CWyKGI5JGFUVbAM%25252C_%26usg%3D__lX5Gucq-kivWyUrZrUU9ipK2aIw%253D%26ved%3D0CDUQyjc%26ei%3D5MnSVIu-NYnrUrPcg6gE%23imgdii%3D_%26imgrc%3DZfvF-9lTcewJvM%25253A%253BWyKGI5JGFUVbAM%253Bhttp%25253A%25252F%25252Ffarm1.static.flickr.com%25252F71%25252F177248148_05eb37436e_m.jpg%253Bhttp%25253A%25252F%25252Fflickrhivemind.net%25252FTags%25252Fdarwin%25252Cyelp%25252FInteresting%253B500%253B375&s=4f627c5aa70d22034b42fd4e2a6f411c8e4d1ff4a9aee9de8224ff70f97a425b\" target=\"_blank\" rel=\"nofollow\">google.com/search?q=yelp…</a><br><br>Which is why I rode my bike out to this dump, proudly nestled in an ugly strip mall on Western and Addison next to a failing Hair Cuttery outlet.  Now I'll admit I was skeptical about 'top 100' status going in.  So there was a bad attitude from the start.  But in my defense, looking at their yelp pictures etc, it looked like just another of a  zillion low end/casual dining Mediterranean places that all have the exact same menu.  I couldn't understand how this place could possibly be one of the top 100 restaurants in the country.<br><br>I ordered the chicken schwarma plate.  As a bonus, apparently, you get free nonstop ass kissing while you're ordering.  Pandering to the nth degree.   The dude would have literally kissed my ass if I asked him to, I think.  Made me a bit uncomfortable.  Like when a dog is humping your leg.  You're all...\"Haha...I guess he likes me..Ugh\".  <br><br>I grabbed a seat at the counter next to the window.  I had my elbows up like a little kid at the grown ups table.  Waaay too high.  Looking around the dining area, I could see the handywork of maybe one of the owners who can sort of build some things..but not exactly.  Overall it's passable but there are some screw ups.   <br><br>Dude brought over my plate.   Had a falafel as part of it.  Excellent.  Really, very good.  And I've been to a zillion falafel places.  Hot, crispy on the outside, good flavor.  A+.  The schwarma was decent.  I think all medi places get their schwarma from the same supplier...on these huge rotisseries.  So hard to do much about that.<br><br>At one point, while I was scarfing down the food, the head ass kisser was like \"hey I've got an announcement everybody, we've only been around for a year and  we're number 100 on yelp (bashful look).  unbelievable and thank u etc\".   Yes this happened.  Which I think is an honest response.  Overwhelmed and unable to comprehend random luck gifted by nerds at yelp and one dog.<br><br>If this place wasn't a 'top 100' winner, I'd probably given it 5 stars.  That award is ridiculous.   So, I deducted one star for being ridiculous.   But hey, they're really nice.  Too nice now that they won the yelp lotto, but they'll get their bearings back in time.   And their food is excellent for a crappy medi place.   I've been to alot of these joints and I definitely agree they do a superior job.  Like 10-20% better than average.", "pics": null}}, {"review": {"des": "Absolutely amazing! Friendly service, tasty food and a great experience. It was so refreshing to see so much pride and effort put into everything.", "pics": null}}, {"review": {"des": "Excellent place!!  The people who work here are very friendly.  They gave us a couple of samples of one of their juices while we waited for our food- the strawberry lemonade, which is sooo yummy and would be perfect on a hot summer day.<br><br>The falafel here is moist and perfectly seasoned.  We had two plates, the chicken shawarma and beef shawarma plates.  Each came with hummus, rice, pita, and salad.  Very flavorful, tender, with plenty of food.  They make their own pita chips which are really tasty as well.<br><br>Great addition to the neighborhood, we will come here often!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/EO5TmGwu6BCN_O45bmfJ1Q/348s.jpg", "caption": "Chicken shawarma plate on the left, beef shawarma plate on the right."}]}}, {"review": {"des": "If I could give 6 stars for service, I would. <br><br>Food: 5 stars.<br><br>The Mediterranian pizza will blow your mind. A wood-oven from Napoli heats to 800 degrees and creates a heavenly soft yet crunchy dough base. Topped with in house tomato sauce, shwarma, basil, and other fresh spices, it was probably the third best pizza I've had in my life. It was such a flavorful, masterful combination of tender, juicy shwarma and sweet sauce and fresh, tongue-livening spices that I was surprised the restaurant had only been around a year.<br><br>4: The chicken chipotle shwarma was by no means a slouch, it was delicious and had extremely fresh salad. But it was overshadowed by the perfect pizza. <br><br>6 stars for the service. Fares was an absolutely gracious and warm host, and we felt as if we were dining in his home. We talked about life, our experience in the Middle East, our love for food, amongst others. He threw in free dolmas which were so fresh and grape-leafy, and went well with the tzatziki yogurt sauce. He also gave us free baclavas which were just as good if not better than that found in the Middle East. I was blown away.<br><br>Go go go go go there now.", "pics": null}}, {"review": {"des": "I have always recommended this restaurant as a diamond in the rough:  hard to find, but oh so good when you get there.  Unfortunately, my experience last night has diminished that somewhat.  I ordered the Veggie Platter, and the Dolma was missing completely.  I also ordered the Chicken Shwarma plate, and the chicken was so salty I couldn't eat and had to toss.<br><br>The shining star though was the Red Pepper panini which was very yummy.  Maybe just an off night, but too many great restaurants in this area for this to happen on a consistent basis.<br><br>Updated 5/12:<br><br>Back to being all great!  Thanks for restoring my faith!", "pics": null}}, {"review": {"des": "The service here is truly some of the best I've ever had. In addition, the food is super tasty and cheap. It is a blessing and curse to live near here, because I have to limit my visits. <br><br>One of my favorite spots in Chicago.", "pics": null}}, {"review": {"des": "I have yet to try anything bad here. From their Wood Fire cooked pizza, to the hummus, to the Avocado Panini, everything is fresh and so good. Even the olives are tastier than the average olive! <br><br>As for beverages, they have a great selection of tea for colder days, delicious Metropolis coffee when you need a pick me up, and my absolute favorite is the Strawberry Lemonade. <br><br>Along with a super friendly staff, this joint is a true neighborhood gem.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/4gqGUz7JgF3-IkQcXmNwYg/348s.jpg", "caption": "My favorite Baklava!"}]}}, {"review": {"des": "My husband and I love this place. The food is tasty, and we habitually refer to the owner as \"the nicest man in the world\". Seriously, we say that to everyone we recommend this place to. It's a steady stand-by when we're craving Mediterranean but don't have time to do a sit down place.", "pics": null}}, {"review": {"des": "I always pass this plaza and now I finally have a reason to come back and back again! Beginning... The server explained the restaurants concept and was very polite and concise. The food is all fresh and prepared to order!<br><br>I ordered the Mediterranean ZA and the curry chicken plate. Both were amazing, but I did enjoy the plate of food better. The three sauces were all unique and complimented the meal greatly. All in all we had enough pizza leftovers for dinner. The meal for two people without drinks was only $24!", "pics": null}}, {"review": {"des": "So this place is right over there.  We saw the reviews on yelp and wanted to give it a go.  We walked in and were greeted by Super Friendly guy.  He explained our options enthusiastically to be sure.  I was in the mood for chicken skewers, baba gannoush, and dolma (like always).  It came with fried pita chips (if you choose).  That's right, fried pita chips.  It was a total yum.  (Although I added additional lemon at home). Super friendly guy even gave us a sample of all their tahinis to add to our dishes.  Very reasonable , too.<br><br>Great option for healthy, quick food.<br><br>I can't wait to try the pizza and paninis.  You must go to there.  :)", "pics": null}}, {"review": {"des": "Unbelievable service. These guys are the real deal! You have to eat here. We randomly stopped in because we were getting our phone fixed down the block and were so happy we did. <br><br>We're def coming back. Thank you so much for explaining how you do things in the restaurant !", "pics": null}}, {"review": {"des": "Even if the food wasn't good (but trust me, it was), I would give this place 5 stars because of the service. I walked in alone to order dinner, and the man taking my order was just so nice. No better way to put it. I assume he was an owner or manager, but at the end of my meal he even personally thanked me for coming in and made sure I had enjoyed everything. Super sweet.<br><br>I ordered the veggie plate (they let me sub the baba ghanoush for rice) and it was a good amount for the price and delicious. The falafel and pita were really good. Make sure to ask for tzatziki on the side!", "pics": null}}, {"review": {"des": "YES YES A MILLION TIMES YES! Seriously this place is ridiculously good. From the hand made falafel to the wood oven baked pizzas, you can't go wrong here. Not to mention the service is AMAZING. We ordered a half dozen falafel. The co owner came out with a plate with complimentary hummus and pita which was so nice. The falafels were light and fluffy -- easily best I've ever had. The pizzas crust was soooo good and buttered. Pizzas are hand made. The cheese was gooey and the fresh veggies and housemade hot sauce makes these pies delicious. And the prices are SO fair!!!!! Hell yes! I cannot wait to be back here!!!! (Probably tomorrow)", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/JE0eMhDWkjoZMXo7ZcC1sA/348s.jpg", "caption": "Pepper jack white pizza: gooey cheese, buttered/garlic crust cooked to perfection in a wood burning oven!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/t83PayARubjbe1xwFj4Rsg/168s.jpg", "caption": "Delicious falafels with hummus and pita. Best falafel I've had in the states!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/VECHddAxYQdImAY71svrJw/168s.jpg", "caption": "Wood burning pizza oven"}]}}, {"review": {"des": "I love the food at Pi-Hi. From salad to chicken sharwma on plate. you won't be disappointed at all.", "pics": null}}, {"review": {"des": "Chicken schawerma plate was amazing. The hot sauce (side condiment) was an awesome addition. Owner is super nice and cheerful. Small cozy little place.  Happy to have another good local option.", "pics": null}}, {"review": {"des": "Just moved into the area and am always looking for new local favs. The food is good but the service from the owner and chef is sensational!! I went with my sister and her army... We order 3 pizzas (they're 10\" pizzas thin crust) and a few sandwiches. The flavors were great and the food was fresh but what made the experience was the owner and chef brining us free samples of grape leaves, baklava and spiced olives.... Yumm!<br><br>Best thing we ate was hands down the falafel!!! Even if you don't like it, you gotta try it as they were perfectly cooked and came with some very creamy humus. Don't be afraid to ask for sauce for your sandwiches. They've got some good stuff but you gotta ask for it.<br><br>Try it, you won't regret it.", "pics": null}}, {"review": {"des": "Chicken was very flavorful and well seasoned. Falafel was very good as well. Perfectly crisp and very good flavors. The pita chips were great and the humus was pretty standard. I wish the rice was more flavorful.<br><br>However for prices (which are a bit higher then posted online) the portions and food was very good.<br><br>Would order again", "pics": null}}, {"review": {"des": "We love this place!! The food is soo tasty and affordable. And every time we walk in the customer service is impeccable. Super friendly staff, awesome food, close to our house. BIG WIN!", "pics": null}}, {"review": {"des": "We have eaten here twice now it was Oh So GOOD! The wood fire grilled metterainan pizza was stellar and beyond belief, we added extra garlic to it, we heard from someone there were vampires in the area. The Dolmas were heaven wrapped in a grape leaf. Baklava was amazing as well not too sweet, just right.<br><br>Would go back again in a heart beat, service was excellent as well!", "pics": null}}, {"review": {"des": "Yep, so this place is one of only two IL businesses on Yelp's Top 100 in USA, 2015.  The previous reviews pretty much sum up the place - great food quality, no frills, small space, great value, and a genuinely friendly owner.  I agree on it all and it is indeed a nice Chicago neighborhood stop (across the street from Lane Tech) for very good and economically priced Mediterranean.  The food is all fresh, made to order, and piping hot when delivered.  They use a wood burning oven here.  The wife and I tried a chicken combo plate ($8.95) and a baklava dessert.  Ferris, the indeed friendly Palestinian owner, also treated us to a sampling of their dolmas, or rice stuffed grape leaves, and they made for a nice tart starter.  He prides himself on home-made freshness, and it shows.  He's been at it here for 14 months at this point.  Will try to make it back when in the area and in the mood for Medi.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/XZfh1D6rlpis4qjHa7SjzQ/348s.jpg", "caption": "Three sauces available - tahini, cucumber, and a hotter red sauce.  Wood pile for oven in background also."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/HUbHtjov9DrWgIcEoPOExg/168s.jpg", "caption": "Wood burning oven at work"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/1PmgwWocwuuU5PTfB4IPrQ/168s.jpg", "caption": "Menu board, circa March 2015"}]}}, {"review": {"des": "My daughters cannot get enough of this place! Great service, fresh Ingredients and the best smoothies in town! The pizzas are so good and fresh! The owner cares about the taste of the food and the appearance of his place.", "pics": null}}, {"review": {"des": "YELP ap says you can get Deep Dish Chicago-style pizza here. You cannot. We went out of our way to try it and left disappointed w/o having ordered anything.", "pics": null}}, {"review": {"des": "Great service and great food!! The food is already so great but the employees and owners add another deserved star to make it 6 stars on this establishment if possible :) recommend any plates or the pizzas! They are small but really good. (Pizza is small but chicken or beef plates are very largely portioned!)Best to split the Pizza Pi for 2 people. Won't regret trying this place!", "pics": null}}, {"review": {"des": "The beef combo is always a killer. Also recommend the chicken panini. Very good place overall.", "pics": null}}, {"review": {"des": "Ok, Let's start out by setting your expectations....<br><br>Yelp's data wizards named this restaurant one of \"Yelp's Top 100 Places to Eat in the U.S. for 2015\". Which is an amazing honor, to say the least. Yelp drives businesses to succeed or fail, all based on a crowd-sourced reviews. These crowds are not restaurant critics or professional reviewers; they are (mostly) people like you and me trying to get the word out for our fellow man. This can certainly skew the score...<br><br>But this is where expectations can be dangerous; especially when you might imagine what the 100 best restaurants in America could be. Visions of Michelin Stars start dancing in our heads, and avant garde places like Alinea, Grace, and The French Laundry are expected. <br><br>This.Is.Not.That.<br><br>This is instead an outstanding little Mediterranean restaurant serving up fast heaps of schwarma and falafal bedded in fresh hummus and baba-ganoush. <br>They knock out solid wood-oven pizzas, great panninis, and really amazing smoothies. <br><br>They pride themselves on making everything to order. No baskets of cooked falafel balls getting cold over the fryer waiting for you to order, nor spits of meat baking for days on end making a dry chewy schwarma. <br><br>This also isn't a fancy Mediterranean restaurant to take the family for approachable ethnic food when they visit you from endless corn fields of Ohio; but instead a place to order delivery from, or to stop in as a small group for a casual lunch. <br><br>What truly sets this place above the rest though isn't just the quality of their food; but instead the friendliness of the staff and owner. This is a true mom-and-pop joint, succeeding or failing by every customer who comes through the door. They could not be kinder or more generous; often even including little extras in your order when they recognize your face.<br><br>Which brings us back to their place on Yelp's top 100 list....<br><br>Is it what you might expect from one of the \"Top 100 Restaurants in America\"? Probably not. But say hello to the owner, have a little conversation with him, and I guarantee you will walk out understanding why Pi-Hi get's reviewed the way it does, and truly deserves it's place on that list. <br><br>Also, if you are a return customer, do your neighborhood restaurants (not just Pi-Hi) a favor and skip using grub-hub or a delivery portal. These services are amazing, and I would often be left starving if not for GrubHub, but they often charge 10-20% of the bill for the service to the restaurant, which can easily overwhelm a family run restaurant. Pick up the phone, call the restaurant to order for pickup or delivery, and feel good in supporting your neighbors instead of some silicon valley dot-com company.", "pics": null}}, {"review": {"des": "They got it all here and it's all great. Amazing food and great service. The staff is awesome & very friendly. <br><br>Pizza - AMAZING<br>Shawara- AMAZING<br>Falafel-AMAZING<br>Fries-AMAZING<br>Parfaits- :-) A BLESSING<br><br>I definitely recommend this place.", "pics": null}}, {"review": {"des": "Chicken Shawerma and kabob plates are delicious! Owner is super friendly and all around good service. Definitely will be ordering delivery during the glorious winter months of Chicago", "pics": null}}, {"review": {"des": "The smoothies there are absolutely ridiculous. All fruit smoothies, can't go wrong...panini's are also legendary. Simple yet delicious, paired with cheese fries and your mind will be blown...<br><br>Honestly passed this place 200 times never tried it cause how it looks from the outside. But once you step in you'll see that it's  a quaint well put together lil shop. Clean, new, fresh, and friendly. Dude behind the counter is a boss.<br><br>Don't be fooled by the location or appearance...it's actually great. Try the mango madness or the strawberry express smoothies...they're a must...", "pics": null}}, {"review": {"des": "Fans of Mediterranean cuisine and hard to find good take out places that execute well (flavorful food, good portion size, freshness, price point) but this place hit all the right notes (and very friendly as an added bonus).  Their garlic tahini sauce hit the spot with the extra falafels we ordered (because who doesn't NEED a side of a dozen falafels?!). The only thing I didn't love was the hummus, but perhaps we will try the garlic one next time because, of course, we will be ordering from here again :)", "pics": null}}, {"review": {"des": "Awesome food and incredible service. Moved away about two months ago and haven't found anything nearly as good in Glenview. I can't recommend this highly enough. If you're reading this review to figure out if you should go there or not, go there! I love the chicken shawarma plate and my kids love the pizza.", "pics": null}}, {"review": {"des": "If you love Pita Inn, but live near Roscoe Village in Chicago and don't feel like hiking up to Glenview or Skokie to satisfy your Mediterranean cravings... well Pi-Hi Cafe is the place for you!<br><br>Everything is delicious, from the chicken shwarma to the 3-cheese panini! The hummus is super creamy, falafels are crispy on the outside, light and airy inside and pita is fresh and soft. Strawberry lemonade is made fresh and there are free refills. They even have brick oven specialty pizzas! Portions are generous and prices are reasonable.  <br><br>Ferris and Mert (owners) are two of the most awesome people you will ever meet, they will give you samples if you want to try any of the food items. The rest of the staff are super friendly as well. LOVE THIS PLACE!!!", "pics": null}}, {"review": {"des": "The food here is delicious.  Granted I've only had the pizza and the Mediterranean Plate but, the service is great, and it's clean and tidy, and this food is great. <br><br>The place is a bit small, and it's across from Lane Tech so it'd probably hard to get a seat when school's out, other than that it's all great. We'll be back.", "pics": null}}, {"review": {"des": "I live around the corner and love this place! Fit, fresh and fast. Love the chipotle chicken shawarma, and everything is always fresh to order. Salad and lentil soup are great too. Great staff, super friendly. It can a little crowded at lunch time, but call ahead and they always have my food ready for me.", "pics": null}}, {"review": {"des": "Love this spot! Tried this restaurant to get some good Mediterranean food. Took some friends from Florida that were here visiting and we all loved this place. The chicken and beef were amazingly seasoned. Plenty of food at reasonable prices. The owner Farris even brought out fresh pizza that he had just made for us to sample along with some baklava. I highly recommend this spot.", "pics": null}}, {"review": {"des": "This is a horrible place to have lunch. The seating area is far too small to be anywhere near comfortable. The food is terrible; It is bland, and overpriced. I would never recommend this place to anyone. The workers are rude to regular customers as well, so I will certainly not be giving them anymore of my money.", "pics": null}}, {"review": {"des": "Pi-Hi is located in a very small strip mall. The workers are super friendly and one of them took the time to explain the menu. When asked which sauce I wanted, I was indecisive so the worker gave me all of them to try. The falafel and chicken schwarma are both good. The sweet potato fries have some spice sprinkled on them, but the extra flavor was a plus. The prices are also reasonable.", "pics": null}}, {"review": {"des": "My go to in the city. I get the chipotle chicken shawerma every time and I try to stop in as often as possible.", "pics": null}}, {"review": {"des": "Affordable, tasty food and friendly staff.  Everything looked clean and we were made to feel welcomed.  We had a panini and beef schwarma. We saw someone else with a falafel plate and that looked excellent. Pizza looked good also. We will be back to try some different dishes.", "pics": null}}]}