{"name": "piccolo-sogno-chicago", "reviews": [{"review": {"des": "Came here recently for dinner on business and I was totally blown away.  The place was very classy, perfect for any occasions.  There were a mix of groups of customers ranging from families, friends and business people.   I hear the patio is amazing so definitely will need to plan a summer trip to Chicago to try this place again.  By around 8pm, this place was completely packed even on a Monday night.  Be sure to make reservations.<br><br>The service was exceptional.  More importantly the food was outstanding.  To start, we had the charcuterie board which had cheese, prosciutto and roasted vegetables.  It wasn't on the menu that night but my business acquaintance who had this dish here before was able to order this for us to share...this dish was amazing.  Keep in mind that the portions both appetizers and mains are very generous so we probably didn't need to order the fried calamari appetizer for the 4 of us.  The mains were all perfectly plated and everyone enjoyed their dish.  I got the fish stew filled with really fresh clams, mussels, fish and shrimps that was hearty and delicious!<br><br>Highly recommend", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/CNyjc9AZIXe6eu77aQub2A/348s.jpg", "caption": "Fish stew"}]}}, {"review": {"des": "I came here a few weeks ago when I had family in town and sadly we were all pretty disappointed in the food. I split the gnocchi and the boscaiola pizza.The gnocchi was alright, the pizza was terrible. Like worse than freezer pizza. Everyone else in the group said their food was either \"fine\" or \"okay\". The only thing I really enjoyed was the cavolo nero salad and the wine - we had a really nice cabernet franc.<br><br>I found the restaurant decor and atmosphere to be stuffy and weirdly outdated, like it was 2005 or something. Also thought the service was a bit stiff, if not exactly rude.<br><br>Overall this was obviously a huge miss, which makes me sad because I had wanted to like it. Oh well - much better Italian restaurants in Chicago!", "pics": null}}, {"review": {"des": "Overall had a great meal with a variety of anti pasti dishes and pasta. We had a variety of cut meats and cheeses and everything was good and also good to share. The calamari was also very good. For the entree I had the ravioli and overall the sauce and pasta was good. Could have been less rich though for a health conscious person. <br><br>Atmosphere: upscale fee with white tablecloths <br><br>Service: great service and friendly as well<br><br>Food: overall very good antipasti and pasta choices!", "pics": null}}, {"review": {"des": "I have been wanting to try Piccolo Sogno for a while now and finally had the chance to when my friends were in town. For appetizers, we ordered the Prosciutto di Parma, Fritto Misto, and the Burrata con Culatello. The prosciutto wasn't overly salty and it was nice to eat with the melon. There was a nice assortment of seafood in the Fritto Misto and the Burratta was nice and creamy. For the main dishes, we ordered the Spaghetti Neri, Paglia e Fieno, Cappellacci Di Zucca, and Margherita Pizza. The Cappellacci was much too sweet and tasted like liquefied cookies. The pizza was nothing memorable and the Paglia was a bit overcooked (the noodles were a little flimsy). The Spaghetti Neri was the best pasta dish, but the noodles in this dish also felt a little overcooked.<br><br>The appetizers were much better than the pasta and pizza dishes we ordered. For being a more expensive restaurant, I was a bit disappointment in the quality of the pastas. I probably will not be returning here in the future.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/JlGtRq8-MWm6w_ritOxMRg/348s.jpg", "caption": "Margherita Pizza"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/03ZiE1zXOlhWYr7WXkPDzg/168s.jpg", "caption": "Cappellacci Di Zucca"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/L91jqEjhypFWEOwbA16mvA/168s.jpg", "caption": "Spaghetti Neri"}]}}, {"review": {"des": "After a summer of high heat and humidity, Chicago has finally been blessed with a week of mild temperatures and cool breezes. And what do Chicagoans do in such beautiful weather? Like everyone else, we eat outside!<br><br>My very favorite place for an al fresco meal is the patio at Piccolo Sogno, an Italian restaurant a few blocks from my condo. It's located in the back of the restaurant, surrounded by a wall, so you don't hear street noise or smell car fumes. Filled with lush foilage and flowers, and bright colored yellow shades overhead to block the sun. Couldn't be a more perfect setting to enjoy a meal. <br><br>My friend and I came for lunch, and there's usually not a wait then. She's model thin and eats whatever she wants (I love her anyway). And I'm always torn between what I want and how tight my jeans are. <br><br>So I started with the fresh fava bean salad, followed by the perfectly seasoned Griglia Mista (caper and lemon infused grilled calamari, shrimp and octopus).  And she consumed the entire basket of bread and breadsticks dipped in olive oil, followed by my favorite Ravioli Piccolo Gogno. As always, the service was attentive. Everything was yummy,  and the service was very attentive.<br><br>Piccolo Sonio is a beautiful restaurant with wonderful Italian food. But I think the patio is the feature not to be missed. They take reservations, including the patio. But patio reservations can become \"first come first served\" later in the evening.<br><br>Parking is free at lunch and $10 at dinner (cheap for Chicago). It's a short Uber ride from downtown. And just a few blocks from the trendy Fulton Market/Randolph Street action.", "pics": null}}, {"review": {"des": "When a city, like Chicago, is so well known for it's Michelin Star food scene, it inevitably raises the bar for food quality of all other restaurants and businesses found in it's area. I really didn't give this idea a thought until we visited Piccolo Sogno on recommendation of a local Yelp friend.<br><br>We were booking for the Sunday and didn't know how busy they'd be so we put ourselves down for two at around 7:30pm and without knowing much about the space took the recco to make sure we were on the patio. Upon arrival we gave our names and were immediately taken to our table. You can tell the restaurant is super cozy in the winter months, but once we walked out into their private garden patio we knew that this was a summer time al-fresco restaurant.<br><br>The outdoor garden patio was massive! Potentially double the size of the restaurant itself, with hundreds of diners sitting out under the branches of one main tree. It was like being in the movies Ferngully or Avatar with the tree of life being the central figure. The surrounding gardens were equally beautiful and accented by the string lights, this was a truly romantic dinner spot, we were thrilled.<br><br>The one drawback in having a huge popular patio to seat everyone is that it gets, and was, a little tight for walking and seating. You were very close to all of your surround neighbours which on one hand added to the ambiance, but on the other may be too busy for some.<br><br>They have an impressive wine list (many very expensive options) but we decided on #251 Chianti Felsina Berarde ($50) as a bottle we could have a glass before dinner and then continue easily with out meal. It was quite nice - but then again I love Chianti so that's a moot point.<br><br>We both started with the Pesche Salad - Arugula with peaches (not fish). This was a perfect outdoor dining starter. Light, fresh, not overly dressed with the nutty arugula matching the lightly sweet peaches perfectly.<br><br>My wife, who usually is a strict Butternut Squash Ravioli person, surprised us both by opting for the  Pasta Special with shaved Truffles. None of this dish survived.<br><br>I have a real problem turning down fresh Pappardelle when I see it on a menu. Worse still, when I see Pappardelle with a braised pork product with it, I pretty much have no defences. So the Pappardelle Con Cinghale happened and it was epic. No regrets, I loved every pork suckling minute of it.<br><br>Now, I have not had sugar in 7 weeks so with a bottle of wine, pasta and peaches all creating sugar surges in my bloodstream I was absolutely defenceless so when my server offered us dessert, I caved quickly. The Mille Folglie was amazing, omg. Light, flakey, buttery and creamy all in one. Wow.<br><br>So you can see after reading this that there really wasn't a bad thing about our visit her, It's a highly recommended spot on my Chicago to do list and I want to go back to Chicago just to eat here again (even with an 8 hour drive)<br><br>Eatcrest Out", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/4Zf_dJsCXKFZvmpL-BKarA/348s.jpg", "caption": "Mille foglie"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Qe9zNggux-Aof8RSg0or6A/168s.jpg", "caption": "Pasta special with shaved truffle"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Pc3O7NvosTf_CXZJKjHvBw/168s.jpg", "caption": "Pappardelle Con Cinghiale"}]}}, {"review": {"des": "I've been wanting to try this classic Chicago spot for a while now. My parents love Italian food, so naturally this famous iconic restaurant was the place to go for their anniversary dinner. The patio was great on this sunny day, and the service was prompt.<br><br>We had a bottle of red and some appetizers to start. The bread was sweet and soft, and the octopus was my favorite app. It was very thick, chewy, and tasty. The brussel sprouts salad was light and delicious, and the burrata was also a nice appetizer to share.<br><br>For my entree, I got the halibut, and this was flavorful and light. I also liked the seafood stew that my grandma got, but my favorite dish was my mom's branzino. This was excellently cooked and of great portion. The pastas were all tasty too.<br><br>You really can't go wrong with a dish here- the Italian food and ambiance were excellent.", "pics": null}}, {"review": {"des": "I made reservations per some coworkers' recommendations for my birthday dinner months ago. When we were walking to our table, we were so excited for the outside seating which was beautiful. However, our server brought us back inside in a dark corner so that was quite a disappointment.<br><br>We ordered the calamari and burrata to share, both were pretty good. Then a couple of us ordered the special which was the risotto with jumbo scallops and roasted leeks. Nothing about it \"wowed\" us as it was not very flavorful as I needed to add salt, pepper, and more Parmesan cheese and the scallops could have used a better sear on them. Overall, for the $26 price tag I was a bit disappointed. My friends ordered the Ravioli, tagliatelle with boar, and black ink spaghetti with seafood. Everyone was content with their dishes but we were kind of on the same page that we would not rush to come back.<br><br>There was also a little difficulty with my friends trying to get my birthday dessert as they kept asking the whole table about whether we wanted dessert but they had already told the server on the side to do something secretly. The result was the stale biscottis that were complimentary at least.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/3_zVxix_rOSXpjMZAsZMUg/168s.jpg", "caption": "Burrata"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/gRBsxDMslCsBBvPkrcHIWw/168s.jpg", "caption": "Fritto mare"}]}}, {"review": {"des": "I really wanted to like Piccolo Sogno, as it was recommended to me by a coworker, but I was truly underwhelmed. <br><br>The outdoor seating area itself is absolutely gorgeous and has a lovely ambiance but the food is really nothing special--especially the burrata. It's literally slices of prosciutto with a small scoop of cheese--totally underwhelming. I had the ravioli for dinner per the recommendation of the server and regretted it, since it was bland and oily. The only good thing was dessert, which was a lemon panna cotta. I visited with my boyfriend for our anniversary, and the dessert hat a cute \"happy anniversary\" message written on the plate. Expect to wait a while because they are always running behind on their reservations. <br><br>I'm glad I had a chance to try it out but I know I won't be back. I just didn't \"wow\" me and I feel like there are lots of other places in the city that will.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/HrksEpxyPBhxnUoIgDRutw/348s.jpg", "caption": "Lemon panicotta"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ud02arSEk66-dtVo-cjZeg/168s.jpg", "caption": "Bellini"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Sa2B7tM-KsbJTxqmCqk2LQ/168s.jpg", "caption": "Salmone"}]}}, {"review": {"des": "I was in town for a team meeting. As a team we decide to end our trip with a nice team dinner. We made reservations a Piccolo Sogno at 5:00 on a Wednesday. Due to traffic we were 20 minutes late. We were greeted at the front door by a friendly host. They directed us to the patio. May I say the ambiance was mystical. I felt like I was Alice in Wonderland.  <br><br>At 5:30 we were probably the 3rd table to be seated on the patio. By 6:00 the patio was filled with multiple parties. <br><br>The service was amazing. They were very attentive and helpful with recommendations. I ordered the specialty fish. They brought out the fish to showcase before cooking. What a great experience to have if ever in Chicago.", "pics": null}}, {"review": {"des": "Go on a nice day for the beautiful patio.  Without it, this place is probably pretty similar to many other excellent Italian places in town. But the beautiful patio sets it far apart from the competition, and is our place to go for a wonderful Italian meal on a nice summer evening.", "pics": null}}, {"review": {"des": "We had a reservation at 9:30pm for 6 and were made to wait about. 20 minutes for a table by the bar. Some of us got drinks at the bar area but I ordered a glass  of  sparkling rose when we were seated and out Server got a bottle and served everyone at the table . (Odd)The ambience sort of transports you out of the city when you are sitting under the gigantic tree and beautiful lights but the space is kind of tight. The restrooms are not checked on constantly because the ladies didn't have toilet paper, geez!!. These are basics when you call yourself an upscale dining place.<br><br>The beet salad was good, peach salad ok, the truffle pizza was amazing Brussels sprouts Were too<br> charred.... entrees the halibut  was good, Cornish hen was a disaster way too salty.<br><br>Will I go back ?  Maybe!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ZF0tXCfQ9VlrMYIa9ycMcQ/168s.jpg", "caption": "Cornish hens......bad!!"}]}}, {"review": {"des": "This place significantly exceeded my expectations. The atmosphere was soooo romantic with a beautiful back patio complete with heat lamps and string lights. Don't get me started on the food. The caprese was fresh and delightful. The mozzarella was creamy and salty. The balsamic was viscous and sweet. A perfect combo. The fried fish platter was to die for with sea bass, calamari, etc. and my spaghetti was loaded with seafood. The CHOCOLATE HAZELNUT CAKE was spectacular -- rich and chocolatey. I cannot wait to return for another great dinner soon.", "pics": null}}, {"review": {"des": "Recently came here for a weekday lunch and was able to sit on their lovely patio, yay! I had the pasta special and ate every bite of it. We had a few bottles of rose which were very nice on the warm day. The service was great, especially since we ended up staying well after they closed for lunch. The entire staff was hospitable and friendly. I tried my first Aperol Spritz, and it's perfect for summer. Looking forward to coming back at night and having more tasty food and wine. <br><br>Note: be sure to make reservations weeks in advance for nighttime especially!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ISsU0ZGJFv1TRugBVpNTZw/348s.jpg", "caption": "Aperol spritz"}]}}, {"review": {"des": "A friend recommended Piccolo Sogno for dinner in Chicago. I was able to easily make a same day reservation online for a late fall Saturday night. They've got a really nice valet area and what I think is pretty affordable parking for the area ($10). They also have complimentary coat check, which was really nice given how tightly packed the restaurant seating was. We got seated in the back area. I believe it was a covered patio area. It was very comfortable--not too hot or cold. Our waiter was very kind to explain the menu and specials to us. He gave us plenty of time to decide our order. You do need to order all at once with the way the kitchen works. We started with the caprese. They were kind of divided it up into two portions in the kitchen. Then we split the tagliolini, which was pasta with rabbit--also divided up into two plates for us. It was really nice not to have to divide it up ourselves. Finally, we split a ricotta cheesecake. We were really pleased with out meal overall. The flavors were very nice and the servings were just right for us to share and have 3 courses.", "pics": null}}, {"review": {"des": "This meal was perfection, from start to finish. This place came highly recommended by locals, and after eating here I can see why. The wine was delicious. The burrata was tasty. My ravioli was so good I ate every single bite, and I almost never finish my dinner. My boyfriend's steak was amazing as well. The atmosphere is romantic, with low lighting and crisp white tablecloths. <br><br>It was slightly pricey but well worth the money for a nice night out. <br><br>Also, our waiter had the dreamiest accent I've ever heard. I would listen to him read be phone book. <br><br>Definitely check it out!", "pics": null}}, {"review": {"des": "Amazing patio for lunch! Food was delicious and atmosphere outside on a beautiful day was perfect. Had reservations for anniversary, walked in at 12:30pm and no one was inside because it was beautiful outside, so the patio was about 2/3 full.<br><br>Split artichoke appetizer which was a little lemony for me and artichoke ricotta ravioli appetizer which was one of the best dishes that I have ever eaten. Our waiter recommended wine that was spot on then I had salmon and my husband had shredded duck - who knew duck could be that good!? Salmon was delicious too. We ate every last bite and then ordered dessert. See pics! Will definitely be back and definitely recommend!", "pics": null}}, {"review": {"des": "Piccolo Sogno is my favorite restaurant in Chicago for three strong reasons:<br><br>1. The food overall (yes, all around it's phenomenal)<br><br>2. The Patio in the summer <br><br>3. What really goes into Piccolo Sogno. <br><br>Starting with the food, well, it's amazing. The Branzino is the best I've had outside of Italy. The burrata...f*** I love the burrata. When I asked Chef Tony about the burrata he told me he went to Italy himself to pick out the dairy farm and specifically chose the fattest cows as they have the richest flavor. If burrata is a drug then I'm glad I'm addicted to it. <br><br>The Patio reminds me of \"The Secret Garden\".  Green and colorful foliage surrounds you everywhere along with good vibes and bottles on bottles of wine. Venetian lights hanging all around creating a fine dining yet social atmosphere. <br><br>What goes into Piccolo Sogno...quality and knowledge. The owner, Ciro, hails from Naples, Italy and brings the knowledge of Italian cuisine and restaurants. The Chef, Tony, brings years of experience and has proven to the Chicago restaurant scene that he is on top of the Italian game. <br><br>Pro Tip - do not try to pinch pennies here as the more dishes you try the better. Though the restaurant isn't too pricy, every dish brings something new to the culinary experience. Either come with a large group, or be ready to order a lot and have leftovers.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/RnQx49KhNmoQJWmdeggCtA/348s.jpg", "caption": "Holy branzino"}]}}, {"review": {"des": "This restaurant was fabulous! If you can, try to eat outdoors. The trees in the middle, hanging string lights, and fence around create the atmosphere of a great backyard party. It's hard to believe you're in the middle of the city when eating there! Such a nice escape. <br><br>The food is fresh and innovative. There are a wide variety of pastas, pizzas, and meat dishes. The salads are unique (Brussels sprout, peach and goat cheese, etc) and out of this world. <br><br>Most importantly, the staff is extremely attentive without being overbearing. A member of our group had severe dining restrictions and the chef created a custom dish to meet his needs.", "pics": null}}, {"review": {"des": "Service was great as well as dinner! Highly recommended if your looking for some different Italian dishes.", "pics": null}}, {"review": {"des": "A gem right under my nose for years and I finally made it for a birthday celebration under the string lights in the outdoor patio area.<br><br>I had the CARCIOFINI  Lemon marinated baby artichokes, lemon oi l,<br>shaved parmesan to start and it was light and lemony.  Perfect for a summer in the city.  I also tried the POLPO CON CECINA  Grilled octopus, chick pea and olive oil puree, lemon, tomatoes, frisee.  I was a bit underwhelmed with the dish.  It struck me as ornidary.  The entree was a hit though.  I had the TONNO  Pepper encrusted Ahi tuna seared rare, eggplant puree, peperonata, olive tapenade.  The tuna was seared perfectly and the puree was so great it was almost the star of the dish.  <br><br>Overall this place is a oldie but a goodie and a perfect date night, girls night, birthday, shower or any other celebration you see fit.  I don't think living in the city is complete until you have visiting the beauty of a place in the midst of the concrete jungle we call Chicago.", "pics": null}}, {"review": {"des": "What a disappointing dinner... I don't know if this restaurant was overhyped or i had really high expectations, but I was really disappointed eating here.<br><br>We came for dinner on Thursday. We opted to sit inside since it was over 90 degrees outside. There were only 3 other parties sitting inside since everyone was sitting outside on the patio. We actually asked to sit next to the window, but our server told us that the table was already booked when it actually wasn't. There were 2 empty tables next to the window the entire time we were there and we were there for at least 2 hours...<br><br>The complimentary house focaccia bread was amazing! Make sure you add the balsamic vinegar to the olive oil to enhance your experience. The other breads in the basket were mediocre. Don't waste your time eating anything else but the focaccia. We loved the bread so much that we asked for more and were very disappointed when we received a completely burnt piece of bread, which was uneatable. I was kind of appalled that such a nice place would even serve burnt bread to their guests. I even saw someone else get served the same burnt bread. It should not have even been served...<br><br>I love Italian wine! Piccolo Sogno has a large collection of bottled Italian wine. The best part is that there's a good amount that's affordable - $30-45. Although I'm not a sommelier, we love Italian wine! We asked for recommendations and were snootily given recommendations which were over $100 per bottle. Of course we opted for a more affordable bottle, but our snobby service set a foul atmosphere for dinner. <br><br>We ordered the Burrata con Culatello (Prosciutto), Ravioli \"Piccolo Sogno\", Spaghetti Neri, and the trufle ravioli. The Burrata was the star dish of the night. Although the portion of the burrata was on the small side, it was super moist and creamy. The touch of prosciutto was delectable. <br><br>The Ravioli \"Piccolo Sogno\" was made well. The ravioli was thin and was stuffed with the perfect amount of cheese. The portion size was surprisingly large. I usually never like to order ravioli because I'd usually only receive a few pieces and leave hungry. You'll leave satisfied if you order this dish. <br><br>My friend ordered the Spaghetti Neri. The noodles were thick yet very soft. They also give you a lot of squid and just a few mussels and clams. The marinara sauce was very enjoyable. My friend loved this dish so much, she even claimed that it was better than Eataly's tagletteli squid ink pasta. <br><br>DO NOT order the truffle ravioli. I love truffle. I'm a sucker for anything with truffle - truffle cheese, truffle fries, truffle popcorn. And I got suckered into ordering the truffle ravioli. Upon first glance, you get these half-moon shaped ravioli's with a generous portion of truffle shavings. Sadly, this ravioli is thick, hard, and chewy. The filling has no taste, but that may be because the entire dish is soaked in a tub of butter, which is so overwhelming that you can't taste anything else. The flavor of the truffle doesn't even shine through because there's so much butter. As one of the most expensive pasta dishes, one would think that you would get an amazing pasta dish. This dish is entirely disappointing...<br><br>I definitely will not be returning to Piccolo Sogno. From the service to the food, this $$$ restaurant is not worth it. However, if you're still interested in going, set your expectations low and expect to cough up a lot of $.", "pics": null}}, {"review": {"des": "Oh, Piccolo, how I love you so.<br><br>I have heard about the greatness that is Piccolo Sogno for quite some time. It seems to be on everyone's \"favorite restaurant\" list. I finally had the opportunity to give it a try on a Saturday evening. <br><br>I booked a reservation a few days in advance, and did not have a problem getting a table for two at the time I wanted. We did not drive, but it seems the valet service is quite good. The restaurant is two rooms, and opens up into a larger, courtyard patio. On the evening we went, it was a bit too cold for us to sit outside, but the doors were open to the patio which gave the larger dining room a nice, fresh atmosphere.<br><br>The wine selection is impeccable. I asked for someone from the bar to help me choose a wine, and he did not lead me astray. Fresh bread is served with olive oil and house balsamic. My favorite aspect of this restaurant as the willingness of the chef to substitute gluten-free pasta for almost every pasta dish (except the ravioli). As a non-gluten eating pasta lover, this was very much appreciated. I ordered the Tagliolini, and loved every bite. My friend ordered the Papardelle con Cinghiale and enjoyed it as well.<br><br>I am looking forward to many more great meals at Piccolo!", "pics": null}}, {"review": {"des": "My husband and I went here for my birthday dinner and we were highly impressed by the service as well as the food.<br><br>My husband made a reservation in advance and we were seated promptly upon our arrival. We sat outside which was beautiful!<br><br>Our server was attentive and welcoming. We always had full water glasses. My husband loved their focaccia bread that was on the table so the server even brought out extra.<br><br>We had the burrata/prosciutto appetizer to start and it was wonderful. We both drank Piccolo Sognos (spritzes).<br><br>I ordered the ravioli Piccolo Sogno which were phenomenal and my husband had the sundries total/asparagus gnocchi. Both were delicious. <br><br>Their house balsamic glaze is also not to be missed!! <br><br>Overall, a wonderful experience. We will be back!", "pics": null}}, {"review": {"des": "Absolutely delicious Italian food with great service! The setting was pleasantly lively on a weekday. There is a small bar area, a nice indoor dining area and a covered patio area with a semi romantic cozy ambiance. Everything on the menu looked so good. As appetizers we ordered main dishes! <br>Note: they get their sauces so right here. Flavorful and clean, not so salty that you can barely taste the tomatoes or mushrooms, etc. <br><br>We also bought a few of those little bottles of balsamic vinegar reduction they give you to mix with the olive oil after dipping through two bread baskets. Just tell the waiter you want to buy some, $20 each and well worth it as just a few drops in your favorite olive oil transforms your bread dipping experience. It's so good. Makes a great gift too. <br><br>What we ordered:<br>Margherita pizza: hot fresh, chewy dough with a good crisp, the sauce was wonderful. <br><br>Mozzarella do buffalo: fresh perfect imported Italian mozzarella<br><br>Four cheese ravioli \"piccolo sogno\": the pine nuts and butter Marsala glaze was a great mild yet fragrant compliment to the fresh cheeses inside the pasta. The ravioli was perfectly al dente. <br><br>Truffle Ravioli (evening special) in a light mushroom cream sauce topped, or shall I say, buried under truffle shavings. So light yet hearty. The cream sauce was savory, comforting, yet light unlike your mainstream Americanized fettuccini Alfredo type sauces. <br><br>Short rib special: it was slow cooked and the meat fell off the bone. <br><br>Desserts: chocolate tortino and biscotti cookies. <br><br>Drinks: Negroni, Lemon Drop, Merlot <br><br>You can't go wrong here.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/_f9eK3hZVRL-1C1VlYimkQ/348s.jpg", "caption": "One of their specials for the night: truffle ravioli. Delicious...look at all that truffle!"}]}}, {"review": {"des": "Okay neighborhood go to,  you tell<br>Us 35 minutes for the Cornish hen do we<br>Opt for pasta and seared tuna!!!!   We inquire about our food and the manager comes and says it's only been 20 minutes!!!! We say that's why we didn't order the Hen!!!! Really he says I have 600 people outside!  Like I care!  I order pasta !!! Not cool!  It's Tuesday for gods sake", "pics": null}}, {"review": {"des": "Fabulous old-school Italian resto where you feel coddled without being gushed over.  My sister and I were visiting Chicago in May and had our second meal--lunch--in the lovely garden courtyard.<br>Food was superb; classics tweaked for modern palates done with care, respect and flair, but above all flavour!  No flashy presentation, no need.  Ditto service; attentive without being in your face.<br>Delightful, delicious experience every bit as good as any savoured in Italia.", "pics": null}}, {"review": {"des": "The food was excellent. Try the Cornish hen or halibut.  However, the service was bad. We had made reservations on Monday for Tuesday at 4:30 pm. The host had apparently given us the wrong time because dinner does not start until 5:30 pm on week days. When we explained to the host what happened, they looked at us like we were crazy or trying to make a scene. The whole evening it appeared that the wait staff were 'uncomfortable' with us. Hmmm. We encourage you to ensure you are paying attention to customers when they make reservations. <br><br>Also, there were gnats flying around all night. Clearly, they need to pour ammonia or bleach in all drains to combat this mess. Please control the gnats. We may try again.....", "pics": null}}, {"review": {"des": "After months of listening to other people rave about this place, I unfortunately can't join in on the expressions of love.  Began by being seated in a small room that was pretty loud with people very close by.  I understand when you have popularity, you want to cram in as many as possible but it does affect the experience.  The server came by and our table of 5 couldn't understand what he was saying regarding the specials and he had to walk around to both sides of the table for us to hear and even then, I couldn't understand everything he was saying.  <br><br>They have a substantial wine list so had a bottle of wine and before that, a Belvedere Martini (and yes, they have Blue Cheese olives like every decent place should).  It was restaurant week, so we went with their 3 course menu for $33.  (Basically, this is all just selected items on their regular menu as opposed to special dishes made for restaurant week.)<br><br>Started with the Caprese Salad.  I wanted the mixed greens (whatever creative name it was called) but it had Goat Cheese and for some reason, I was cut off when I asked for a different cheese.  Really?  I get the whole \"no substitutions\" rule on most items but cheese on a salad?  Not impressed with their inflexibility.<br><br>Main Course.  I had the Wild Boar and Pappardelle Ragu and the Short Ribs (2 of us split these).  I wish I just had the Wild Boar because the Short Ribs were really dry.  <br><br>Dessert. <br>MOUSSE DI CIOCCOLATO or Chocolate Mousse with Raspberry.  Decent but nothing out of the ordinary.  Those who had the Panna Cotta weren't as happy.  <br><br>The portions are small, and that's fine, but with the premium prices, would expect more in terms of quality.  And the server was really bland and seemed overwhelmed with the number of tables he had.  Sometimes, you get someone with a great personality that makes you forget mediocrity.  This was not one of those times.", "pics": null}}, {"review": {"des": "The server was great - the Asparagus with egg and parmesan was amazing. Then we had the shredded duck salad followed by the Pasta Niri - seafood squid ink pasta. They split our plates for us and the patio was beautiful.  The only downside was an untrained employee who came over and cleared my plate when I wasn't done nor was my dining partner. The server was very good.  Overall lovely Chicago experience.", "pics": null}}, {"review": {"des": "Sunday early evening we set out for dining at Piccolo Sogno.<br><br>Inside or outside was make available at 5 pm reservation. We parked on Grand and walked to Halsted.<br><br>The policing the curb on Grand would be a welcome sight.<br><br>We were seated through the main dining room to spacious outside space that would seat more than 150. <br><br>The outside patio was a pleasure surprise with evergreens, plants, live trees creating a canopy with buffered the street traffic noise. The patio is surrounded by 7-8 ft", "pics": null}}, {"review": {"des": "My husband surprised me with reservations on Valentine's Day. We were excited as he has been wanting to try this restaurant for years. <br><br>Being Valentine's Day, the restaurant was filled with tables of two and man, do they have you crammed in! We were so close to the people next to us we could hear their whole conversations and it was so hard to talk to my husband or even hear the server. The conversation between the couple next to us was not something I wanted to hear over my valentines dinner, I will just say that! It just seemed they were trying to optimize their covers over giving people a nice atmosphere to have dinner in. We also tried to order our appetizer before we ordered our entrees and our server made us order all at once because \"it helped the kitchen space the meal out\" which really made them turn tables faster than let people enjoy their Valentine's dinner. <br><br>The food though, was delicious! We started with the calamari which was really great but lacked marinara sauce (I know, Americans over here). I had the ravioli stuffed with crab meat which was a special and that was amazing. My husband had black spaghetti with sea food which was also very good! We felt it was perfect portion sizes. We were full but didn't have left overs. We had the thousand layer dessert which was not what I was expecting but still good. <br><br>Overall, the food is very good but I would suggest going on a less busy night to really be able to enjoy the meal.", "pics": null}}, {"review": {"des": "PURE DELICIOUSNESS, FROM THE VERY BEGINNING. Our appetizer, dinner and dessert were all made to perfection. We started with an antipasti plate which consisted of perfectly grilled vegetables , smooth cheese, olives and prosciutto. I had the risotto with black truffles and I've never had a more delicious plate of \"rice\"  in my entire life. I highly recommend their delicious dessert as well. Pictured is their ricotta and berries cheesecake.", "pics": null}}, {"review": {"des": "We went here over the weekend to celebrate us moving to Miami next month, and it was just amazing from start to finish. We sat outside, which was a very elegant space. Our waiter was attentive, but left us to do our own thing for the most part (which I love! The markings of great staff). <br><br>I had cheese ravioli with vodka sauce, and the sauce was simply divine. My boyfriend had the wild boar ragu, which I tasted, and it was delectable. Paired with our wine selection, the entire night was amazing. I'm very glad we were able to try Piccolo Sogno before we moved!", "pics": null}}, {"review": {"des": "My husband and I went here for our anniversary dinner. The patio seating is AMAZING! One of the best outdoor seating options out there! Of course, we got seated at probably the worst table outside, but I don't hold that against them...someone's gotta get the crappy table, right? <br><br>I wish the food was just as good as the ambience. But unfortunately that was not my experience. You can tell everything is thoughtfully made and made with care, but I just didn't think the flavors came through at all. I wasn't a big fan of the calamari starter, although perhaps I'm the odd one out because it looked like every table was ordering them. I had one of the pasta dishes (I added shrimp to it as well). The pasta sauce was just ok. But I loved the different textures and thought the shrimp were well cooked. My husband had the short rib with polenta. I tried the polenta and just didn't like it at all. He liked the short rib (I can't comment because I'm vegetarian). We ended our meal with ricotta cheesecake which was good. They had a really large wine selection, so if that's your thing, you might like the place!<br><br>I had a nice time with my husband, but I don't think we would come back. I wasn't impressed by the food. It's a shame because the outdoor seating is so amazing!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/LnDMWxIFMEdIW4A4bBcZAw/168s.jpg", "caption": "Outside seating (picture doesn't do it justice)"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/4j2ZznqWSOQQj7Kfe9egQw/168s.jpg", "caption": "Calamari"}]}}, {"review": {"des": "I was actually super excited to check out this place, but am a bit disappointed. Our reservations were for 9:00pm; however, 20 minutes later I approached the guy who was checking people in and asked when we would get our table. His response to me was: we are just seating our 8:30 reservation. Yet, there were 3 tables opened right in front me.. so I was a bit confused. He also failed to apologize to us for our longer wait time nor did he offer us a seat at the bar. As far as the food, it's okay. I've honestly had better Italian food. I ordered some mushroom special with black truffle they had that day. Probably won't be back again.", "pics": null}}, {"review": {"des": "Piccolo Sogno is incredible -- a big group of us got together there for dinner a couple weeks ago, and sat outside. Their patio feels like a little oasis in the heart of the city! <br><br>We opted to share dishes so we could all taste everything! Their daily pasta was an orecchiette with spicy sausage and broccolini -- I'm still thinking about it to this day. We also ordered a couple of pizzas, the tuna, burrata, and the whole fish. <br><br>The entire group left raving about the food and the service!", "pics": null}}, {"review": {"des": "We had a work event here so the menu was Set already. First off the bread is good but the olive oil and balsamic vinaigrette is out of this world. They have a very good wine selection and the staff waiting on you are really top notch. I thought the food was good and I have no complaints I would like to eat from a full menu and make my own choices at some point in time so I can only go on what was on menu.", "pics": null}}, {"review": {"des": "Got a reservation here for a Monday evening with a friend from out of town who was in the mood for Italian.  Piccolo Sogno did not disappoint!<br><br>Our waiter was knowledgeable about every menu item and wine on the menu, describing it in ways that just got me excited to eat!  <br><br>We ordered the grilled seafood appetizer the triangle pasta special and the pappardelle boar ragu.<br><br>The seafood was cooked perfectly with all the shrimp and squid being super tender.  The pappardelle was a perfect texture and the boar delicious. <br><br>I've only been here once before and it was a few years ago.  I'm so glad I thought to come here on an otherwise dreary weather Monday evening.  It will definitely be sooner rather than later this time around!", "pics": null}}, {"review": {"des": "I was so excited to come here after seeing that the head chef was on beat Bobby Flay. The food was great don't get me wrong but not any better than a family owned Italian restaurant in Chicago. Everyone at my table ordered something different and it tasted good at the time but we all felt a little sick to our stomachs afterward.", "pics": null}}, {"review": {"des": "Everything always tastes better when you're on vacation. I was visiting Chicago for the marathon and boyfriend made a reservation here for our celebratory post-race meal after it was highly recommended by his professor. She said it could not be missed and insisted we request to sit on the patio--I have to say she was right on both accounts.<br><br>We visited on a Sunday evening and boyfriend thoughtfully made a 7p reservation in advance, which is definitely recommended because while the restaurant wasn't full inside, the outdoor patio was fully seated. We were promptly seated upon arrival and started perusing their autumn dinner menu.<br><br>For the wine connoisseurs, the wine list they've curated here is extensive and surveys Italy's 20 wine regions quite well. It can be a little overwhelming if you didn't get a chance to look it over before dinner but the wait staff is more than happy to offer recommendations. I didn't think to ask for the sommelier but from the looks of the menu it's very likely one might be available to answer questions. <br><br>The autumn menu highlights a lot of in-season produce so I settled on the Cappellacci Di Zucca (local squash, amaretto cookie stuffed pasta, brown butter, sage, walnuts) and boyfriend ordered the Tagliolini Di Castagna (chestnut flour pasta, wild mushrooms, garlic, shaved parmesan). The Cappellacci was AMAZING and honestly it was likely because this is the BEST version of brown butter that I've ever had. It was perfect. The Tagliolini was also very good; the wild mushrooms added a lot of depth of flavor. We also each ordered a glass of wine  by recommendation to pair with our dishes but I can't for the life of me remember what they were! Per the reviews on Yelp, we passed on dessert.<br><br>Our experience at Piccolo was warm and romantic from start to finish. I would definitely recommend this as one of the best restaurants in Chicago.", "pics": null}}, {"review": {"des": "This is a very nice restaurant that I visited while on vacation. It was a pleasant evening so we agreed to be seated in the back, outdoors. It was a great decision! The ambiance was beautiful and elevated the meal itself. If the weather is nice and you are able to get a reservation, definitely outdoor seating is recommended.<br><br>I thought the ambiance, service, and wine list was great. They have plenty of staff and helpers to get your orders, refill your waters, and attend to any needs you have. It's a great place to relax, have some wine, and enjoy with friends and family.<br><br>The food itself is good, but not great. For an Italian restaurant they do have a good menu with a variety of pasta and meat options. However we weren't taken aback with the flavor profiles of the meals. The pasta itself is fresh and cooked thoughtfully, but I just felt the flavors didn't jump out at you. Considering the prices, that raises the bar even higher for them to meet.<br><br>overall you are paying for the ambiance and the atmosphere. The food alone is not necessarily worth the cost, but it isn't bad. Combined with the outdoor seating, staff, and wine list, it is still a very worthy place to go for a nice Italian dinner", "pics": null}}, {"review": {"des": "Was in need of a big bowl of pasta to warm me up on a cold rainy night and this place totally delivered... <br><br>Came in and was quickly seated with a basket of bread (the focaccia was my favorite) while perusing the menu..  Had the paglia which was ribbon pasta with veal ragu and it totally hit the spot.  Friends had the spaghetti nero and we all were part of the clean plate club despite the large portions... <br><br>Desserts were a hit and miss, hit was the chocolate cake- standard lava cake but well executed and how do you go wrong with warm cake? The ricotta cheesecake was a miss, cold with a hard almost dense cake like consistency.  The berries it came with were good though... <br><br>Overall most of the food was satisfying and the service was great too, would definitely drop by again", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/n9VmOJABbjtGvF2HVQNe6w/348s.jpg", "caption": "Ricotta cheesecake"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ucu3PjVmFG4pD2BfKnldhw/168s.jpg", "caption": "Chocolate cake"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/YpFSEflI1EECVpNWJar0lw/168s.jpg", "caption": "Paglia E Fieno Con Vitello"}]}}, {"review": {"des": "Decided on celebrating our 3 year anniversary here a few weeks back and it was such a wonderful experience from start to finish. <br><br>First of all, they have the most adorable, romantic outdoor patio. Very spacious with cute string lights.The inside is equally as beautiful with chandeliers and dim lighting. <br><br> Our server was extremely knowledgeable and professional, describing and suggesting food items. We decided on sharing  a grilled calamari as a starter and I had the Sapore di mare as an entree. Let's just say I probably crave these two a few times a month ( thank God I just had calamari last night and ate  seafood every day of my San Francisco vacation last week!)Seriously mouth watering food here! <br><br>Overall the experience was top notch  and we both look forward to another night on their gorgeous patio  hopefully before this wonderful weather is gone.", "pics": null}}, {"review": {"des": "I'd like to start off by staying that Piccolo has one of the BEST, most beautiful patios in Chicago. It also has one of the best wine list varieties, and an absolutely delicious branzino, which is difficult to perfect. This place actually makes me feel drawn to the West loop area in its entirety, except for the staff. The last few times I have called or dined here, the staff have been less than favorable. I consider myself to be a reliable source since I currently work in hospitality and have for the last 15 years. Most of the flaws, but not all, are centered around the host staff. They are rude, condescending, and incompetent.<br>Regardless of how good your food and ambiance is, I can take my business elsewhere and find just the same, if not better strictly because I will not spend my money where the staff and waitstaff are not equally as good. I highly suggest investing more in your associates and making sure they treat each guest with respect, even if it is your busiest time of year.", "pics": null}}, {"review": {"des": "Oh man. What can I say about Picoolo... Well first of all, the absolute best service you could ask for! Our waiters were perfect. To a T! Great suggestions when it came to the food, and wine. My parents were in town visiting my fiance and myself and my dad being an Italian american always likes some good Italian food. The food was delicious! I don't really remember my first time eating here, as I was enjoying their martinis a bit too much. But this time the food was exceptional, and just had the best experience. I would definitely suggest this to anyone looking for a nice date night, or if you have family in town. Also try to sit out on the back patio if you can!", "pics": null}}, {"review": {"des": "What a nice hidden River North gem! Piccolo has been around for years even amidst the turnover rate of a few restaurants in the area. <br>Upon entering, the restaurant is a lot larger than you would expect and the lighting is perfect! The patio looks amazing and I have heard that it's a great place to hangout during the summer months.<br>We were celebrating a friends birthday with a total of 14 people and Piccolo was gracious enough not to make us choose from a pre selected menu, they did not add gratuity to the bill, and they also allowed us to bring our own cake without charging us a fee! We called several places during the planning phase and some of their fees and demands were just ridiculous. <br>The staff was amazing! With such a large party, PS made sure we had a couple of waiters at our disposal. We never felt rushed..even when a few members of our party arrived 30 minutes late. They even obliged us with many photos to include allowing us to take photos on the patio despite the 25 degree temp.<br>For starters, we had the griglia mista which was superb! We also had the frittura di calamari and it too was very good. A few of us had the caprese and cavolo nero salads, again very tasty.<br>For our main courses, we went with a few selections from their seasonal menu as well as the gnocchi from the regular menu. All of the pasta was fantastic and none of us left feeling stuffed which is the way it should be if you are consuming fresh made pasta. <br>We really had a wonderful time and I am looking forward to summer days on the patio.", "pics": null}}, {"review": {"des": "Definitely a solid dining experience. My family's table wasn't the greatest, but we weren't too disappointed--we were squeezed in without a reservation when the place was packed. The service was great, and we received nothing but friendliness and hospitality from the staff. The outdoor seating area was truly beautiful (despite our own table being in the corner), and the indoor ambiance seemed equally fantastic. The food itself was quite good; the Frito Misto was a solid appetizer and the ravioli was well-made (albeit a bit too savory for everyone's taste). The star of the show was definitely the Margherita Pizza--it was truly a great pie and was pleasantly traditional. To be honest, the vibe of the place is decently charming, as it occupies a space between traditional and cutting-edge, but it veers into pretentious territory somewhat to a fault in my opinion. <br><br>I'd most likely come back again, and I'd actually recommend being a bit more adventurous with the menu. The place has black spaghetti--you can certainly step out of your comfort zone if you'd like. However, there's nothing wrong with sticking to a good old slice of Italian-style pizza, and that's probably the way it should be, regardless of the rest.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/o2Uz1LODoCnePOxLDm0oRw/348s.jpg", "caption": "Frito Misto (poor photo)"}]}}, {"review": {"des": "PRO: Good ambiance and service, albeit a bit loud and tables squished together quite closely. Excellent fish - seafood is clearly where this place shines. Gluten free options are clearly marked on the menu.<br><br>CON: Pasta was overcooked and soggy, and the veal ragu was completely tasteless. Chef uses too much tenderizer which renders a soft consistency but depletes the meat of any flavor. The resulting sauce was incredibly bland and disappointing. I'd steer clear of meat dishes here generally.<br><br>Also, I called ahead to ask about dairy-free options and was told that a smaller dairy free menu would be provided to me on site upon request, but upon arrival the waiter told us no such menu exists. Management should get everyone's information aligned on this, as I would not have asked if I wasn't explicitly told this would be made available to me, so this was a disappointment. Frankly, it would be helpful if dairy free options were either marked on the menu or if such a menu were available.<br><br>Overall, it was a fun night out, and we had a good time, which was the most important thing to us, but the quality of the food was inconsistent and overpriced given the low quality and taste of certain items. The place has a 4 star atmosphere, but 2-3 star food.", "pics": null}}, {"review": {"des": "Four of us dined at Piccolo Sogno for lunch a couple of days ago to celebrate Lora's birthday. We sat in the patio, which is a lovely and lush oasis. The restaurant itself was quite beautiful as well. It began to rain after a while, but there was plenty of room to relocate under a large umbrella. <br><br>The server was professional, although dressed a bit casually for such an upscale place (i.e. a golf shirt), I thought. To his credit, however, this man's eyes were on his customers constantly. All I had to do is look in his direction, no matter where he was, and find him scanning the area constantly. He would notice me within seconds and come over to see what I needed. So many servers seemed to avoid looking to see if customers need attention. Not this fellow. I really appreciated the attention. Moreover, he wasn't pushy and was accommodating in every way.<br><br>We shared a couple bottles of very nice Pinot Grigio, several appetizers and a main course each. The grilled octopus appetizer was especially memorable. I ordered the Battuta di Pollo, which is a grilled, flattened chicken with a salad. In retrospect, I wish I had ordered something truly Italian, like C did (gnocchi), but my dish was very tasty; especially the Capriole Farm goat cheese, which I could eat from a bowl like ice cream, given the chance. Everyone was very pleased with the cuisine.<br><br>The ambiance is peaceful on the patio, which is surrounded by lush vegetation, with makes for very civilized and relaxed dining. <br><br>Food: 5 stars<br>Service: 5 stars<br>Ambiance: 5 stars<br><br>Bonus: Free parking at lunch.", "pics": null}}, {"review": {"des": "I've passed by this place many times and have heard good things about it. And recently i was taken here on a date :P<br><br>My boyfriend and I came on Valentines day this year. Reservation was a little hard to get, for how late we came (8:30 PM), it was still extremely busy.<br><br>We waited about 15 mins on top of having a reservation, and were seated in a not so glamorous spot, aka next to the bathroom. <br><br>But everything was forgiven once the food came in. I got the lobster risotto to start, which I know was quite unconventional for a starter dish, but I had to. I love Italian food and I love risotto!! It was so rich in flavors and extremely delicious. My boyfriend's minestrone was great too! <br><br>For entree I went with the classic Italian ragu, and it was once again mind blowing. So rich in flavors, and loved loved loved the texture of the noodles. My boyfriend's seafood spaghetti was also extremely delicious.<br><br>Service was great! We kept getting fancy bottled waters refilled :P Loved the attentiveness and friendliness of the staff. <br><br>Also just an extra cute thing, they gave all the ladies red roses since it was valentines day.<br><br>The total came out to be $170, which was expensive, but for the quality of the food, it was worth  it. Will definitely come back again :P", "pics": null}}, {"review": {"des": "Very good pasta, but the real draw of this place is the patio area out back. Unfortunately even early it was booked up so we sat inside where the vibe is more of a standard Italian restaurant.", "pics": null}}, {"review": {"des": "Amazing everything! Waitstaff was great they worked together effortlessly. The food was great, we all shared and every dish we tried was top notch. The back patio is amazing, makes you feel like you're eating in a garden.", "pics": null}}, {"review": {"des": "Last night was a special night for my family, i made a reservation  at the restaurant, not open table at least 2 wks ago for 4ppl 630p, patio! the only reason we were going for the patio! Three of us got there at 6pm, they had us sit at the bar and drink, the  fourth member of my family got their at 615pm, they said ok and we sat at the bar. Meanwhile there were tons of customers getting seated it was getting crowded and they were not sitting us a minute before 630pm. Finally we go outside and the put us in the corner under a covering facing 2 walls, the worst table on their patio. The service was just ok , cause we were sitting in the corner he was busy and we were easy to forget. He asked us to order everything at once or we would be there 1 1/2 hours. Which is fine with me for a nice dinner. The food was eh, i have had better, the atmosphere for us was terrible, my  husband literally had to stare at a wall with  plates on it. This was my first experience and my last,  and obviously i had no connections to get a nice table. I am in sales at ABC -TV, this is not some place I will use again for my family or any customer of mine.<br>Thanks for a not so great special night.<br>Robin", "pics": null}}, {"review": {"des": "Made a reservation for Valentine's Day after a wine specialist from Italy at a liquor store near our apartment claimed it was his favorite Italian restaurant in the city. We were not disappointed! This is a restaurant that gives each table a basket with assorted breads...my kind of place. <br>We started with the Griglia Mista (grilled calamari, octopus & shrimp) - this was my favorite part of the meal. Fire grilled to perfection. Also had the caprese. My boyfriend does not like cheese and he even liked the mozzarella! <br>I had the special pasta - heart shaped ravioli stuffed with seafood. My boyfriend ordered the Coniglio Alla Cacciatora (rabbit). They did not disappoint! The portions are on the small side so I was thankful I did not order the appetizer sized pasta.<br>The tables are extremely close to each other which is a downside if you are looking for a more private setting. It was also very dark so it was difficult to take photos but provided an intimate feel.<br>I definitely want to come back when it's warmer to check out the outdoor patio.", "pics": null}}, {"review": {"des": "My girlfriend and I went here for Valentines day and it was an amazing experience. All of the dishes were extremely fresh, full of flavor and the portions were generous. She had the pasta and I had the quail, both were traditional and worth the trip. <br><br>The ambience was classy, and very romantic. You are almost teleported to a small village in Italy when entering the restaurant. Piccolo Sogno should be on the top of your date night list, perfect for any occasion that may strike you.<br><br>The prices were fair, you definitely get what you pay for, it was a great romantic dinner. I was very happy with everything. They even offer valet parking on their small lot, just remember to bring cash as they don't take credit cards.", "pics": null}}, {"review": {"des": "Met here for a client meeting and there were several good options that we ordered but I took the Diavolo pizza which was thin and enough for lunch. Great focaccia bread to start and a double espresso to close out lunch. I'd definitely come back.", "pics": null}}, {"review": {"des": "Phenomenal food. I got the black pasta with seafood and really enjoyed it.  That being said, it felt a bit heavy on squid tentacles over the other types of sea food.  Would definitely come back.", "pics": null}}, {"review": {"des": "I had heard great things about this place and was very excited to try it.  The outdoor patio is gorgeous, romantic, and perfect for a date night or a night out with your friends.  The vine/greenery is very charming back there.  It was a very pleasant ambience. The service was great on all fronts as well.  The host was kind and our server/bussers were very kind and helpful.  The manager also seemed very nice and friendly.  I know some of the other reviewers mentioned how there were snobby vibes here but I guess I didn't really pick up on it being snobbier here than at other nice places in the West Loop area.  Some people were dressed up and I was happy for them, why not?<br><br>The bread and olive oil/balsamic that they bring out in the beginning is delightful.  I love balsamic so much and it's so nice that it is part of the meal.  They also have an excellent wine menu!  They have bottles of wine for $30 so it is actually affordable to have a bottle of wine here if more than one person is going to drink wine.  We split a bottle of rose, which was absolutely perfect for a warm summer night in September.  And it was nicely chilled right by us.<br><br>The menu options are not really vegetarian friendly and are kind of pescatarian friendly but lots of dishes that seem pescatarian have bacon or pancetta.  The menu online is not the same menu that they had when we went there Friday night so we had less options than expected.    We started off with the Caprese salad and it was light and refreshing.  The buffalo mozzarella had a strong, intense flavor that went so well with the light olive oil and basil on it.  The tomato was slightly roasted and it tasted a bit smoky with the mozzarella.  It was a perfect way to start the meal.  For our entrees we got the Ravioli Piccolo Sogno and the Salmon.  The ravioli was my favorite.  The ravioli was a four cheese ravioli in a butter sauce with pine nuts and parmesan on top.  The sauce was heavenly and the marsala was subtle and went really well with the more savory flavors of the butter and pine nuts.  The pine nuts added a nice crunchy texture to the al dente ravioli. <br><br> The salmon was a little underwhelming though.  Like I said before, we didn't have too many options as pescatarians because the other fish dishes had pancetta in it.  The salmon was really well made but it was kind of on the bland side and not very flavorful.  There was a light, subtle garlic sauce with carrots and corn served with the salmon.  It tasted good but it needed to be more exciting since the salmon was kind of boring.  <br><br>We concluded our meal with an amazing dessert though.  It was this layered flaky pastry with a chocolate chip cream sauce in between each layer and a vanilla bean whipped cream served on the side.  The vanilla bean whipped cream was fluffy and light.  I absolutely loved it.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/yNDvF_C25vYQXDyzNfh8CA/348s.jpg", "caption": "Amazing pastry with vanilla bean."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/4t3gruRmMSUWsLFaEACjvA/168s.jpg", "caption": "Ravioli Piccolo Sogno"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/uPf1DCmgENNTCKbla5lDLg/168s.jpg", "caption": "Salmon"}]}}, {"review": {"des": "This is some of the best Italian in Chicago! In summer, cause of their beautiful patio, they are definitely #1. It feels like you're in a Renoir painting. I've gone with friends multiple times and have tried almost everything on the menu in terms of food and wine. It's basically impossible to go wrong.", "pics": null}}, {"review": {"des": "The pasta special and the signature branzino were excellent, the place enchanting and the service attentive.  A lovely dinner venue for spending a beautiful evening with friends.", "pics": null}}, {"review": {"des": "Piccolo Sogno is the epitome of a great restaurant. The atmosphere, food, drinks, and wait staff are all top-notch. I've been here many times and have never had less than a stellar experience.", "pics": null}}, {"review": {"des": "One of my favorite Italian restaurants in the city of Chicago.<br><br>Incredible al-fresco dining during nice weather.", "pics": null}}, {"review": {"des": "I'm probably biased because I LOVE Italian food but this place is amazing. The space impressed me right away, the service was fantastic and the food was incredible. I shared the polpo con cecina, spaghetti neri and rosticciana and every dish was better then the last. This place is definitely worth a visit.", "pics": null}}, {"review": {"des": "Came here with my wife for the restaurant week. They offer a smaller menu and you can pick your appetizer , main course and dessert. The options to pick from were great , and food was awesome! The only reason I didn't give this place .... 5 stars , the service was ok. For my opinion lil bit too slow. <br>I would go there again and hopefully this time service will be bit faster.", "pics": null}}, {"review": {"des": "My husband and I chose to go here for our anniversary on a Saturday night. The temperature was still nice and we were able to sit outside, which is very cute. Feels like your not in the city which is nice, and they had warmers which was very nice when it got later. It was very crowded on the patio, they put tables very close together your basically eating with the people on your sides. We started with the barrata. It was fair, and the serving size was very small for what it was. Also, the bread they serve is not fresh and not good, was definitely expecting something better. My husband had the papparadelle with boar ragu, which was very good. I had the special with asparagus and sage, and it was so bland i had to ask for salt. It made it better, but still it was not very good. We ended with their chocolate cake with hazelnut ice cream, that was delicious. Overall, definitely not the best pasta I've had and we won't return.", "pics": null}}, {"review": {"des": "Super service in an inviting environment makes for a great experience and a really good dinner. We had the grilled octopus, calamari and shrimp appetizer which was really tasty. Followed by the fresh pasta with wild mushrooms which was delicious. All of this accompanied by a couple of glasses of Primitivo which was so good! The waiters are awesome and really attentive. Will definitely be back to try more here.", "pics": null}}, {"review": {"des": "This place continues to amaze me. Both the service and the food are incredible.  I've been eating here for years.  I've brought my friends, clients, my now husband, we've even had a work party here, as well as my rehearsal dinner!  Tony and Ciro are just so special.  I've known them for years and they continue to take care of us each and every time we are in.  The food is best. The quality and freshness, the flavor, all of it! The outside patio is beautiful! You always feel like you're at home when you're at Piccolo Sogno.", "pics": null}}, {"review": {"des": "The food was fine. But that's not why I'm giving them a 1 Star review, if I could give 0 I would. The employees/owners have absolutely disgusted my friends and I during dinner. We saw the men who worked there touching a hostess in an inappropriate way and heard men calling her \"baby\" and \"little devil\" and she was clearly uncomfortable. I seriously cannot believe that's how you allow employees to be treated, we will not be coming back.", "pics": null}}, {"review": {"des": "I thought that I had definitely had rated Piccolo but guess this is my first review. After dining 3-4 times on Piccolo's ever popular outdoor patio, I am obviously a fan! Located at the intersection of Grand/Halsted/Milwaukee Piccolo pops out on the corner of this intersection and welcomes you into its Italian eatery. There is always a wait for the outdoor patio in the summertime because well it is a getaway within the city! Walking into Piccolo you would never expect such a city getaway, but you feel like you are traveling through Tuscany surrounded by trees and the city's  blue sky. It is truly a joy and even if you are not a big fan of Italian food, I recommend waiting 20-30 minutes and enjoying drinks or appetizers on this patio. Even though you are sitting very close to the other diners, it is an experience seeing how busy the restaurant is and the flow of dishes and drinks that they so easily deliver.<br><br>Now let's get to the important part of this review the food and service. I mentioned the service in my previous paragraph, it is impeccable! The Italian Eats, well starting with the bread basket are all very good! I've enjoyed the salads, the Frito Misto (grilled seafood topped with arugula) and even Pizza for appetizers. A lot of people start with the Pizza for an appetizer because it is light and gets the meal started perfectly. I have enjoyed all the pasta dishes too: black ink spaghetti, Papardelle Boar ragú and last night I ordered the orchietti. The only thing I questioned from my pasta last night is that it was served with a white wine sauce. I asked for their Marinara which was provided instantly, however, it was more of a Vodka sauce.. the Halibut last night was definitely a great dish too. <br><br>See you next summer, Piccolo!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/DXq3HwtXzW80_ztJaDS6Sg/348s.jpg", "caption": "Beautiful family on the outdoor patio"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/OfPbTZhL9nqRC-XcTyQtLQ/168s.jpg", "caption": "Beautiful outdoor patio #2"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/OSRs_zB5rBFZyagPBuR9Cw/168s.jpg", "caption": "Beautiful outdoor patio #1"}]}}, {"review": {"des": "Piccolo Sogno: The personification of amazing Italian food found in America. <br>Don't be turned away by the bustling business of this establishment, yes it is a lot of seating and when we were there (a Saturday night) it was bound to busy, still we had no problem getting a last minute reservation. Granted, our authentic Italiano last name MAY have had an impact on our getting such an ideal reservation and perfect table location but what can I say, we Italians know what we are doing. <br>I knew it was bound to be a great experience when our waiter came and had a thick Italian accent, that's how it should be since we are at an Italian restaurant! Appetizers didn't disappoint, and neither did the entrees. <br>Overall this was an amazing authentic Italian restaurant experience and I highly recommend it for the food, service and atmosphere.", "pics": null}}, {"review": {"des": "Piccolo Sogno is one of my favorite restaurants in Chicago--and it has the best garden/patio dining bar none.<br><br>-You feel like you're in a swanky Italian hotspot the whole time--the interior is sleek and modern, the garden is lush and elegant--especially when the lights come on at night.<br>-Extensive wine list with many unusual Italian varietals.<br>-Bread with good olive oil and thick balsamic vinegar is always served.<br>-Homemade pastas are delicious--and they often have great specials--my favorite is when they have one with freshly shaved black truffles.<br>-In my opinion, the best thing on the menu is roasted whole branzino--that is first brought out to display to the table, then deboned--served with roasted fennel, capers and grapefruit--simple, clean, healthy and perfect!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/HmiACFWW1aHB9LRShUilTQ/168s.jpg", "caption": "Whole branzino"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/TW97wGUlKDFJ48oVbiibnA/168s.jpg", "caption": "Ravioli with black truffle"}]}}, {"review": {"des": "Our party of 4 sat outside .. the service was rushed and highly inattentive..the waiter stated after we ordered the appetizers that \" we should order our dinners right away because we are very busy tonite.\" They forgot to bring the \" birthday dessert \"<br>And brought it after the dessert was ordered and eaten.. a bit\"late ..<br><br>The place is disorganized and we found that the <br>\" high profile big money tables\" got the service ..<br><br>We definitely will not return !!! We would have gotten better service at the \"Olive garden.\"", "pics": null}}, {"review": {"des": "For the back patio alone this place deserves at least 4 of the 5 stars. I honestly didn't know about its existence and was really pleasantly surprised when our hostess walked us to the back of the restaurant and out into the open. What a place...<br><br>The rest of the experience was equally good - the service was attentive, the branzino was perfectly prepared and presented and the desert melted in my mouth.<br><br>Will surely be back.", "pics": null}}, {"review": {"des": "Run don't walk to Piccolo Sogno to order their special, Mezzaluna. It's buffalo ricotta filled pasta with black truffles in some delicious sauce. I have always loved this restaurant but that dish blew me away last night.", "pics": null}}, {"review": {"des": "Great food. Pricey but quality stuff. Intimate setting and good atmosphere. Vegetarian friendly. Staff is attentive but not \"too\" attentive if that makes sense. Need to go back!", "pics": null}}, {"review": {"des": "Awesome service and great food! Service stood out the most. Ambiance on the patio was great as well. We'll definitely be back.", "pics": null}}, {"review": {"des": "Not sure why the rating isn't a 5.... I'm serious. It's a bit pricey, but you don't go to picollo without a special occasion.<br><br>Picollo do segno is honestly the best Italian restaurant in Chicago. I had the spaghetti de popo. It was flavorful, the popo was perfectly cooked and the sauce was amazing. The staff is friendly and attentive. I never had my wine glass empty for more then a minute. <br><br>There desserts are okay. Nothing extraordinary. I would mainly go for a main dish. <br><br>All in all would definetly go again (and have many times)", "pics": null}}, {"review": {"des": "I can't think of a more beautiful outdoor dining space in the downtown Chicago area.  Diners on the outdoor patio are surrounded by and dine amongst the illuminated trees, bushes and flowers providing a beaucolic backdrop for a delightful al fresco dining experience.  The buzz from the energetic patio diners is felt but does not distract from enjoying a wonderful meal, conversation and experience with friends. <br><br>After being welcomed by stylish hosts and a quick meander past the bar area,  the patio garden quickly captures you and alerts you that this experience will be special. <br><br>The menu consists of fresh, seasonal rustic Italian dishes with clean, simple and fresh ingredients and a large dose of Italian hospitality.  Prices are reasonable and they have a nice,  adequate wine selection. <br><br>Pietro, our server could not have been more delightful. <br><br>The patio can get crowded and I believe is on a first come basis so call and check with the restaurant on the best times and way to ensure patio seating.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/GOlkE4HmMALd806f8bjt4A/348s.jpg", "caption": "Mushroom, truffle pasta special."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/X2KnEKF5hNnvtcaOOw0axQ/168s.jpg", "caption": "Halibut"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/2XlZVvfd3OvghIq0u2MViw/168s.jpg", "caption": "Lovely outdoor patio"}]}}, {"review": {"des": "This could have been a solid 4-5 star review, but then Piccolo Sogno had to go and nickel-and-dime the customers....<br><br>Off the bat, this has been on our \"must go\" list for a few years. Our friends and us were all really excited to finally visit this place. <br><br>Everything was great. The place looks nice, it is dimly lit, and there was great ambiance. Our waiter was this authentic Italian grandpa who made a few jokes and snubbed us a few times when he was busy with other tables and we were unsure of what to order and had questions. No problem... part of the charm. <br><br>The appetizers were great (calamari and a pizza) and we were pretty hungry so we really enjoyed them. The entrees were also very good, though the portions were quite different if you ordered a pasta dish (on the smaller side) or an entree dish (1/2 a duck or a whole Cornish hen).<br><br>The desserts were delicious, especially the 1000 layer cake.<br><br>When we got our bill, that's when the rating stars started dropping. Apparently this place charges for every soft drink refill. No, they are not using the fancy glass bottles like the other \"old school\" racket places, no no the Diet Cola here comes in a glass with ice.  It is not about the $2.50(!) per glass that they charged, it is about the principle. Why not TELL us \"hey folks, just so you know we did not offer free refills on soft drinks\". That would have eliminated some of our frustration and probably added a rating star back. <br><br>I took one star off for nickel-and-diming us with their archaic practice of charging for refills, and another star off for soiling their own reputation and in small part negatively affecting our otherwise great night!  Shame on you! You can do better than that.", "pics": null}}, {"review": {"des": "One of the only good things about this place is the patio in warmer months. I went for dinner and sat inside and it was not a great experience. It's so crowded with so many tables, which does not provide an intimate atmosphere. The service was good. The pasta was just not good at all. The gnocchi dish had tough shredded chicken breast and very basic vegetables in it. Very low quality and did not taste good. The server thankfully took it off the bill when we said we didn't like it. The ravioli was also not very good. <br><br>Overall, for a place with $19-$24 pasta dishes, I was expecting better food.", "pics": null}}, {"review": {"des": "Piccolo Sogno is a really great, authentic Italian restaurant that fits any occasion - business dinner, GNO, date night, etc. I came here for the first time for dinner with my agent per his recommendation.<br><br>I was craving pasta so I had their Ravioli \"Piccolo Sogno\", which is their signature, as my appetizer (you can request a smaller-size dish as an app) on top of their pasta special, which was a truffle pasta, with huge truffle shavings. Both were so delicious! Their frittura di calamari was also tasty. <br><br>The service was attentive and the overall restaurant is quite warm and cozy.", "pics": null}}, {"review": {"des": "Woooowza's this place is the real deal when it comes to Italian!<br><br>I've been wanting to come here for years and finally made a reservation for me and my wife to go. We sat outside and both absolutely loved it!<br><br>The atmosphere is awesome here, such a great spot in the summer time to sit outside for a nice dinner. The staff is very nice and professional and the food was some of the best Italian I've ever had.<br><br>Recommendations:<br><br>Insalata<br>Barbabietole - Mixed beets, shaved fennel, imported buffalo ricotta, greens, citrus infused oil<br><br>Paste<br>Ravioli \"Piccolo Sogno\" - Four cheese ravioli, pine nuts, butter, Marsala glaze, parmesan curis<br><br>Both of these were so amazing that I actually wanted to order a second round of each but was stuffed and realized what a bad idea that would have been. Instead I decided that we will come back again, and again and again!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Q76kVm7Bi-_XZ9Xe3GZGnA/168s.jpg", "caption": "Ravioli \"Piccolo Sogno\""}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/40dWFaZIV7NHK4UzQYiygw/168s.jpg", "caption": "Barbabietole"}]}}, {"review": {"des": "Really high quality Italian food at a decent price. We ordered the 4 cheese ravioli, seafood neri and the pork tagliatelle(?)<br><br>The space is very romantic and a lot bigger than what I thought r was going to be! We had a reservation for 4 at 5:30 pm on a Friday but didn't really need it. It was pretty empty because it had just opened. I'd recommend dining in the back outside if it's a beautiful day out. They have a rly cute set up in the back!!! We loved sitting out there.", "pics": null}}, {"review": {"des": "Yes Please!!!!<br><br>Really great Italian for such a reasonable price considering the portions. Could be good for a date night, after work dinner (smaller group), girls night - fits all occasions. <br><br>The martini was phenomenal. They use larger glasses as well (not mad at that). <br>We ordered 3 different types of pasta for the table, all were amazing although I don't recall which they were but all were great!", "pics": null}}, {"review": {"des": "A terrific night out for my dad's 89th Birthday. Impeccable service thanks to Franco along with delicious food. My party of 6 with varying tastes all raved about their dishes and the wine recommendation was excellent. A perfect 1st impression, and hope to visit again soon.", "pics": null}}, {"review": {"des": "OMG.  Saw this place on Check please.  Where do I start. Burrata.  Maybe this is on purpose but it's<br>Not traditional burrata.  Why mess with something that's pure? Halibut has no flavor.  None.  Short ribs?  How do you mess up short ribs? Braise them in wine with carrots, tomatoes, garlic, and plenty of herbs.  Tasted like dried pot roast. Beyond ridiculous. Probably should have stuck with a simple pasta dish.  Extremely disappointing.", "pics": null}}, {"review": {"des": "Visited Piccolo Sogno on my birthday with my family. The evening started great with wine and very good appetizers (octopus and asparagus).<br><br>However, the night went downhill due to very poor wait staff.<br><br>I ordered a steak cooked medium rare. when it arrived, it was well done. I send the steak back and it was confirmed by another waiter that it was cooked well done. Our main waiter came back with steak in hand and forced me to cut it in front of him... in front of my family and other guests of the restaurant. Needless to say, it was embarrassing. They brought back a 2nd steak that was completely raw. It must have been a middle finger from the kitchen to me. I decided not to send it back and just get out of there. I was fully charged for the experience.<br><br>I told a manager about the incident, who half heartedly apologized and the waiter gave a half hearted apology as well.<br><br>If you want to be treated like a 2nd class citizen and like a child with guests watching please go to this joke of a restaurant.", "pics": null}}, {"review": {"des": "I had dinner there last week and loved every aspect of this place. They have valet which is a plus, especially since parking can be kind of a pain around that area. The restaurant was nicely dim lit and a great homely atmosphere. I ordered the gnocchi and it was so delicious. The risotto special was even better! The wine and beer menu is really good as well. They definitely have a choice for everyone. I would totally recommend this place to anyone looking for a good Italian restaurant that doesn't break the bank!", "pics": null}}, {"review": {"des": "I had an excellent meal here. The service was extremely polite and attentive. I loved that they called me \"Signore\" - much more elegant than \"Mr.\".<br><br>I must recommend the flattened grilled cornish hen. It was very crispy and delicious. For $21 it's a steal. They have an excellent wine list with the majority of the bottles prices under $75.<br><br>Panna cotta dessert was laden with the freshest fruit I've had in Chicago. Sweet blackberries and juicy blueberries the size of a marble!<br><br>Coming back!", "pics": null}}, {"review": {"des": "My boyfriend took me here for a surprise Valentine's Day dinner, and I thoroughly enjoyed our experience from the ambiance, service, to the food. <br>We were promptly seated, given a bread basket, and menus. Our waiter gave us excellent recommendations for wine (and thankfully didn't question or make fun of my lack of knowledge of wine) and was very attentive to our every need.<br>We ordered the spaghetti neri and funghi pizza, and the staff graciously split everything onto two plates so we didn't have to do the divide on our own. The pizza was wonderful: thin, crunchy crust with flavorful and pungent cheese and truffle. At first I thought the truffle was a little overwhelming, but I found the more I ate, the more I got into and enjoyed it. The star of the show was the spaghetti neri. I've never had black squid spaghetti, but it was amazing!! The seafood paired with it was excellent, and our plates were both quickly empty.<br>I would highly recommend Piccolo Sogno for your next fancy dinner date, with your S/O, friends, or family.", "pics": null}}, {"review": {"des": "We were really disappointed with our experience here.  I made a reservation well in advance for our anniversary, and we still had to wait over 30 mins for a table.  Once our table was ready, they sat us at a terrible table outside in the corner right where the kitchen is- no view of the garden and clearly in the way of the servers.  We got to our table at 8:45 and didn't leave the restaurant until 10:45 (no dessert).  It took 2 hours for us just to eat our dinner because that's how slow it was to get our food.  The food was fine, but I've had much better at some of the other Italian restaurants in the city.  We were really looking forward to something special for our anniversary and instead we were very disappointed.", "pics": null}}, {"review": {"des": "High end downtown restaurant/bar. Great ambience, great service, valet parking, and an outdoor dining area with charm. I had the 'Branzino'. A Sea Bass that was great and lentil soup flavored with duck, terrific. So why not 5 stars? The no gun sign in the window. I should have my right to protect myself, especially in the city of Chicago. Other than that, this place is a home run.", "pics": null}}, {"review": {"des": "I had been dying to go to this cute little patio and experience the rustic Italian dining everyone raved about! My husband and I found  it to be disappointing: the atmosphere was very noisy and more crowded than we imagined it would be, the wait staff were OVERLY attentive and the food was just ok. At those prices, and with so many fabulous reviews, I expected it to be GREAT! I also didn't appreciate one of our 5 different wait staff (I mean honestly, they just kept coming! They would stand around chatting in clumps and then appear at our table every 6 minutes) making fun of the way my husband chose to order his dessert with another waiter when he thought I wasn't looking. I also didn't like being chastised like a 5 year old when I took a photo in the corner of the restaurant on my DSLR (did not use flash or point at anyone directly). I have no problem being told not to take a photo (which is strange considering I've seen MANY of the same photo of the patio taken on social media), however I did not like the way I was spoken down to. I am certain there are better Italian spots to enjoy that are worth the time and money. The 2 Stars is for the dessert and patio atmosphere. Pretty much the only saving grace.", "pics": null}}, {"review": {"des": "Fresh food with seasonal options. Service was superb and wonderful ambiance. In the summer the patio is great", "pics": null}}, {"review": {"des": "Went there twice before. Maybe four years ago. It was outstanding. Subsequently, went with a group for a birthday party it was good. Went again with friends in the city tonight. Last time for me. Nothing was memorable. The service was great. The pasta with truffles was tasteless the halibut was tough the broccolini was uneventful. A lot of cute young hip people there but not the scene I'm looking for.", "pics": null}}, {"review": {"des": "Best Italian restaurant in Chicago!!!! My husband and I came here for his birthday and our wedding anniversary. The food is fresh and delicious! I recommend having their pasta special with truffles!! Our waiter \"D\" took care of us both times and took care of my food allergies. The outside patio area is romantic and peaceful. This was a lovely dining experience.", "pics": null}}, {"review": {"des": "Really good food and super attentive service. Ther back patio is huge and amazing, a total respit as you are instantly transported out of the city. The menu is expansive and everything I've had is good.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ZP22mtXBfLBqyz11-e77GQ/348s.jpg", "caption": "Back patio"}]}}, {"review": {"des": "Beautiful restaurant with a fabulous atmosphere! Ask to sit outside! The food and service from the staff was absolutely phenomenal! <br>Tip: If you plan to drink order your wine after your food and ask the waiter to help you pair the wine to your food to enhance all flavor profiles", "pics": null}}, {"review": {"des": "MOTHER'S DAY May 13, 2018<br><br>NOT a good day at Picolo !<br>TONY (the owner) taking day off.<br><br>B-Team on duty:<br>Service slow, pork rib special dry and over-cooked.  Sent back.<br><br>Substitute dish was salmon primavera.<br>Regrettably, salmon also dry and over-cooked.<br><br>Second time on a holiday, we were disappointed by PS. Last time was V-Day 2018.<br><br>While we enjoy the restaurant in general, going forward we will NOT dine there on any major holidays.", "pics": null}}]}