{"name": "piece-brewery-and-pizzeria-chicago", "reviews": [{"review": {"des": "Chicago knows how to pizza and Piece is hands down the best thin crust in the city. It doesn't stop there though, you have unlimited amount of options to build your own pizza. They start you at red or white sauce and you build from there. They also have specialty pizzas like the famous Hot Doug's and Honey Butter Fried Chicken pizzas which are both highly recommended. I ordered a medium red sauce pepperoni and jalapeños pizza and it fed 4 of us just fine. We then followed it up with a small honey butter fried chicken and had left overs. <br><br>They also have a great selection of apps. I've tried their goat cheese and their Caesar salads both are great for sharing. <br><br>And most importantly, they have a full bar and brew their own beer for the perfect pairing for your delicious pizza. A few of their beers have won awards, so I would recommend starting with a flight to have a taste and going from there. My favorite brew would be the Golden Arm.", "pics": null}}, {"review": {"des": "I absolutely love Piece. Both their beer and pizza are fantastic - there's a reason it's always crowded. <br><br>My favorite beer is the Roadhouse beer - it's an IPA but it's not extremely hoppy. All of their beers are good and a flight is definitely worth trying. <br><br>I always do the build your own pizza and it's been fantastic every time. I like the red sauce with veggies and meat. Their pizzas are very big, so a small can easily feed two people to the max. <br><br>The seating is kind of cramped, especially for smaller groups, but it's worth it. This is one of the spots we try to take out of town guests because we love it so much!", "pics": null}}, {"review": {"des": "Really just OK.  I had the famous Mashed Potato and Bacon pizza which sounds amazing on paper, but it was pretty bland. <br><br>I will say this is a cool place to have a beer and hangout, but not to have a cheat day pizza feast", "pics": null}}, {"review": {"des": "I've been to piece before and thought the pizza was really good, so I decided to order delivery from Grubhub. I was extremely disappointed with not only the fact that it took over two hours to arrive, but also that our pizza was extremely burnt to a crisp. I'm surprised that they would think it's acceptable to send out a pizza like this. Especially when their prices are considerably high. I might consider eating in again, but definitely no delivery .", "pics": null}}, {"review": {"des": "I couldn't even give this place 3 stars, thats how bad their pizza is. I cannot figure out how the hell this place has such a high star rating nor can I figure out why their pizza won so many \"rewards\". I'm sure Anthony Bourdain has had better thin crust around the city. The pizza is so boring and plain, frozen pizza taste better the pizza here. The crust tasted like cardboard. The cheese tasted like cheap kraft cheese out of a bag and the sauce wasn't flavorful at all. I needed to add a ton of pepper and parmesan cheese to make it tolerable. <br><br>Not only did pizza suck but so did the beer. The beer taste like Miller Lite or miller genuine draft for the blonde ales. Again, I'm not sure how they won their awards but it all sucks. Gosh, I hate being that person but this place is NOT worth any wait or even a visit without a wait. <br><br>Take yourself elsewhere for pizza, you'll thank me later.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/nN-5432IOZaENrgzYrsdDQ/348s.jpg", "caption": "Red Pizza with Spinach"}]}}, {"review": {"des": "For thin slice in Chicago the pizza was pretty good. The sauce was sweet, the cheese was fine but could have been a little more salty. The crust wasn't special and besides overloaded with flour was otherwise unremarkable. I liked it completely plain but my girlfriend had to doctor hers up with pepper, parmigiana and basil. The most annoying thing was the slice size; I'm convinced they pay whoever cuts the pizzas in beer because they were the most uneven cuts I've ever seen. Literally one slice you needed two hands for and the other Stewart Little could wield with one mouse paw.  <br><br>We also got The spinach dip. The dip itself was good but the chips didn't fit it and detracted from the dish.", "pics": null}}, {"review": {"des": "It's loud..I can see why it'd be popular. <br><br>The pizza is good but I prefer the crust from Knead for thin crust pizza. I don't really have much to say. It's good but not enough to go back again unless I'm meeting friends or something.", "pics": null}}, {"review": {"des": "**Vegetarian Friendly**<br><br>This place is always packed! We waited one hour to be seated on a Saturday late afternoon, and it was incredibly busy! Great atmosphere with a bar, and definitely understand why it's always busy. <br><br>I only had the cheese pizza, and was it worth my wait! Ooey, gooey with the right cheese to sauce proportion. They can't do a half-half pizza but it's okay because pizza is still delicious! <br><br>Sadly can't make reservations ahead of time, but they will text you when you're table is ready. However, don't stray too far because you only have a 5 minute window to get back!", "pics": null}}, {"review": {"des": "This is one of those places I'd heard so much about and was dying to get here! Like most people, I love a good pizza..even when it's bad, it's still pretty good LOL I had super high hopes for this place and I'm happy to say they didn't disappoint. We got the Hot Doug's collab, Atomic Sausage and the Honey Butter Fried Chicken. Loved both but liked the Atomic sausage more, especially when reheated in the toaster oven at home! This pizza reheats well as long as you reheat it properly....sign of a good pizza to me. Great cocktail and beer selections. I had a hazy beer that was A bit on the wheat side and I loved it. Can't recall the name of it tho. I gave 4 stars because the pizza could have been a bit more done. Maybe that is the New Haven style way but I'll def ask for a little more well done next time.", "pics": null}}, {"review": {"des": "My friend took me here for dinner, I have walked by Piece soo many times and have never stepped in because there was always such a huge crowd inside.  We went on a Thursday night around 9pm and still had to wait about 20 min for a table.  <br><br>We ordered the goat cheese & marinara sauce appetizer, and the Hot Doug's Atomic Sasuage Pizza size small to share.  The appetizer came out in about 10 minutes and was a pretty huge portion.  It had at least 10 pieces of soft bread, and a very large bowl of hot marinara sauce and melty goat cheese.    This was a pretty unique appetizer for me, as I have never had this kind of combination before.  I ate so much of the bread I didn't have that much room for pizza. <br><br>The sausage pizza was delicious and I really loved the bits of spicy sausage on top.  Each bite was very satisfying and full of flavor, even though it was thin crust, I was satisfied by how good the pizza was. Next time I will order one of their mushroom based pizzas.", "pics": null}}, {"review": {"des": "THIS. PIZZA. IS. AMAZING. <br><br>Not kidding. Just get some. You know you want to. You really should just stop reading this and just freaking order it already. <br><br>We ordered delivery after a friend who used to live in the area more or less demanded that we don't leave unless we try it. The ordering process was simple easy and to the point. We got a medium pizza which was perfect for two people who were very hungry. We also got a Caesar salad and I am always impressed when any restaurant goes authentic and offers this salad with anchovies. Hats off to that!  <br><br>The best and sweetest part was the delivery guy. He was so quick showed up very polite. I love tipping well and I had left a $5 tip on the card via the website when we ordered but I was just so grateful for his speed that I gave him an extra $5 cash when he showed up. He stood on the doorstep and tried to give it back saying I had already tipped him. Im sorry but this pizza place isn't just good pizza but really good people too. Thank you delivery guy whoever you were. You make me happy to know there are still honest good kind thoughtful people out there!  You earned the extra tip!", "pics": null}}, {"review": {"des": "Loud, entertaining atmosphere with good eats! Came in time before the place got overcrowded... after 730pm, you will need reservations or you'll have to wait. Get in  before 630, and you'll likely be seated. <br><br>Green Piece Salad- 5 (I loved it!)<br>Pizza-<br>Red Base with spinach, red onion, and jalapeño: 4.5<br>White Base with mashed potatoes on top: 4 (I love potato pizza, and while this was good, there's greater in Chicago). <br><br>Service: 5<br>Ambiance: 5", "pics": null}}, {"review": {"des": "10/10 so good.  <br><br>Highly recommend, great place for a chill hangout<br><br>The best part is you can get creative with your pizza. <br><br>White sauce, mashed potatoes, and clams combined taste so good....", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/kq_6EiXeA8sZfQwdMHq7Mw/168s.jpg", "caption": "The atomic"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/FDmyJZhizxFB2Y_OtIsjew/168s.jpg", "caption": "White sauce, mashed potatoes, and clams"}]}}, {"review": {"des": "We were visiting the Chicago area for just a few days. A local friend suggested we meet at Piece Brewery & Pizza for dinner. It is important to note that this is NOT Chicago pizza, it is Connecticut pizza. If authentic Chicago pizza is what you are looking for it is not here. That being said the pizza was tasty nonetheless. We ordered 2 pizzas, BBQ Chicken & pepperoni/sausage one and a pear/walnut salad. (Photos posted) The pizzas were a thin crust and were flavorful. The salad was delicious. We shared this between 4 adults and there were a few slices leftover.  The place is big, but the noise level was not too bad. We were able to be seated right away, eat, chat and enjoy the dinner. This was a decent dinner in a fun town!<br><br>Follow me on IG: Tabaldos.Treats", "pics": null}}, {"review": {"des": "If you want thin NY style-ish pizza this is the place to go! Growing up eating and loving NY style pizza it was a struggle to find good thin crust pizza in Chicago. We randomly found this place and decided to try it out.<br><br>We did a classic cheese pizza which was right on point. The pizza is very thin so you'll eat more slices than what you'd normally eat so order a size up. My only complaint would be that it was a little oily. I think it's because the dough is so thin so the oils from the cheese just pool onto. I had no problem dabbing it with a napkin to remove the excess oil.", "pics": null}}, {"review": {"des": "Came here for pizza with some friends that were visiting the city. The toppings we got were grilled mushrooms, ricotta, and roasted red peppers. I will preface my review with I just don't really like thinner crust pizza to begin with. The atmosphere is certainly really bar-like, it was way too loud and you had to yell to communicate to the person next to you. We also had some gripes with the ricotta cheese the fact that it was baked through and crumbly, usually at other places that do ricotta the ricotta is still ricotta like in texture and it works much better with the pizza. <br><br>I can imagine people who like thinner crust pizza to like this place, but I personally thought there wasn't enough sauce and the crust was too hard for my tastes. Everyone else at my table liked the pizza a lot though! But in Chicago I think deep dish for me still reigns supreme.", "pics": null}}, {"review": {"des": "I finally got to piece and found peace.<br><br>Piece pizza is one of the best pizzas I've had. I'm not quite sure how to classify their pizza, though. It's definitely thin crust, but not New York or even Chicago Tavern thin. Kind of had more of a coal-fired crust taste, though it wasn't as charred or puffed up as that. So yeah... I guess it's some kind of thin crust.<br><br>What stood out for me was that the pizza sauce was strong and BOOM! Impactful. It has a great tangy taste to it. It was my first time here and so I've only tried the traditional red pizza style - they do also have a white pizza and a bespoke tomato style.<br><br>The place as you'd expect was packed at 8pm on a Saturday. We got pretty lucky and walked into bar seating as soon as we got there. We ordered some salad and artichoke dip while we were up there. The Cesar salad didn't quite have the tang, which you'd expect with Cesar dressing. The dip was pretty much a cheese sauce and you'd be hard pressed to find or taste artichoke in it. Not to say it didn't taste good - what's not to like about a cheesy gooey dip. But just know what to expect, actually, what not to. Then we didn't order the pizza until we got the table.<br><br>Oh, in one strange thing... The pizza tray is HUGE and our table was tiny, so even with one of those elevated tray racks in place, it was kind of awkward space once the pizza arrived. Imagine the entire table top and beyond we're covered by a big metal tray 1.5\" feet above the table you're sitting at. So our plates, silverware, etc are like under the tray and you kind of have to reach under there to eat. Hehe... Not sure if that description makes sense, but it was not ideal. That's something they should reconsider for small tables; maybe place the pizza next to your table on one of those temp stands, or something like that.<br><br>Just the pizza itself was awesome and I need to figure out if they deliver down to the West Loop. Or hey, they should probably open up a location down there, because pretty much anyone that's anyone is there, right?", "pics": null}}, {"review": {"des": "New Haven Style pizza in Chicago!! A one of a kind pizzeria around this region. Thin crust pizza is  the name of the game here cooked to perfection with three different style sauces...red, white &  Tomato Pie.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/tbExqmMIPyydW5p0XhgLow/348s.jpg", "caption": "Pepperoni,mushroom,sausage in white sauce"}]}}, {"review": {"des": "Chicago is known for deep dish, however local Chicagoans know a spot that could change travelers thoughts on Chicago style pizza.  <br><br>Piece knows how to make delicious thin crust pizza.  I love how the pizzas are free formed on a large sheet pan, showing you that these pizzas are made in house.  They have amazing flavors that you wouldn't typically find anywhere and speciality pizza which is collaborated with other local Chicago spots.  i.e. Hot Dougs, Honey Butter Chicken, etc. <br> For those who are less adventurous and like classic toppings, you can build your own pizza.<br><br>This past visit, I went with a large group of friends which allowed me to try EVERYTHING!  We ordered the Hot Doug's Atomic Sausage, Honey Butter Fried Chicken, and a White Pizza with Clam.  Don't knock it til you try it.  That white pizza with clam tasted exactly like a linguini with clam sauce! <br><br>For all you beer lovers, Piece brew their own beer!  I usually lean towards their hefe or kolsch beer.  They also have other options if you don't like my preferences.  Prices for beer is super reasonable!  Belly up to the bar for a drink and the bartenders can help you narrow down your beverage options.<br><br>The restaurant is very casual, and the staff is super friendly!", "pics": null}}, {"review": {"des": "I've had Piece before with friends and had good experiences with it in the past. Tonight was the night I was to have my sons try it with me. I'm saddened to say it was totally disappointing. The crust was so burnt you couldn't chew it and there was barely any cheese on the pizza. The sauce and cheese seemed to be off as well. Nothing about it was a positive experience. For spending $50 on two pizzas, we felt the quality control and flavor just wasn't there for us.<br><br>UPDATE:<br>I was immediately contacted by Piece and I appreciate the correspondence and positive customer service experience. I will be giving them another chance sometime in the future.", "pics": null}}, {"review": {"des": "Though chicken and beer is probably my favorite heavy food combination of all time, pizza and beer comes pretty close. Piece does an excellent job at bringing this combo together with in house brews and any pizza combination you can imagine. <br><br>I would have really liked to top the pizza with more toppings, but with the price being kinda hefty per topping, we kept it pretty minimum. We ordered a red medium pizza with basil, italian sausage, and jalapenos for just two people. A small would have been fine but leftovers!! The beers were great with this pizza. I would like to try the white pizza next time, but we had to stick with a classic this first time around. <br><br>Service was attentive and quick too. Overall, the ambiance here is fun and lively- perfect for all sorts of groups to come and grub out.", "pics": null}}, {"review": {"des": "BEST PIZZA I HAVE EVER HAD IN MY WHOLE ENTIRE LIFE. This place is absolutely amazing. I'm obsessed with the crispy crust and the fresh ingredients. When you come here, you can choose whether you want res or white sauce, white being garlic parmesan sauce. My go to pizza is a red sauce pizza with pepperoni and garlic. Absolutely to die for and so worth the long waits on weekends. Their pizzas are huge and come on long grey pans unless you get a small pizza! A medium pizza is more than enough to feed three people, but I've easily eaten a small pizza with one other person before and have still felt hungry, so if you're on a date night with both of you starving, get a medium and bring some home =)<br><br>However, the reason I give this amazing place with amazing food only 4 stars is because they need to control the crowds better on weekends. No one wants to wait 2 hours for food, and then get elbowed in the side while the host seats you next to the bar with a million people crowding around you... how appetizing? I understand that many people are attracted to the food here, but there is seriously a fire hazard in here. They accept way too many people to be at their restaurant at one time, and I get that it's a bar too and bars get busy, but I cant even hear someone I'm sitting next to for dinner because it gets so damn loud in here from all of the people.<br><br>I normally have great service here, there was just one time where I had awful service. It was so busy, and it felt like our waiter went to every single table except ours. I suggest if you want an actual nice and relaxing experience, come during lunchtime! I just came here yesterday for lunch, and I had a wonderful experience cuz barely anyone was in there.<br><br>They also have their own beer! I suggest getting a flight during your first trip cuz it's only $10 for four beers, and this way you can figure out what you want. I enjoy the Top Heavy Hefeweizen and the Golden Arm. Both lighter beers with great flavor.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/_DOzM43c5es9HGGxK6LxfQ/348s.jpg", "caption": "White sauce pepperoni pizza is to die for!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/WesmXmsgOqgEMIylSR6oKg/168s.jpg", "caption": "Top Heavy Hefeweizen"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/2aKeHtQj4HhJI08mHVhlAw/168s.jpg", "caption": "Pepperoni and garlic with red sauce"}]}}, {"review": {"des": "Loved this place! It was packed on Saturday night, but we were able to get 2 seats at the bar.  The Octoberfest was delicious!  Staff was extremely friendly and nice!  Would love to come back to try the pizza!", "pics": null}}, {"review": {"des": "As always, this place does not disappoint. Delicious and busy, fun, and full of noise. Do not come here for a private, quiet night. Be ready to hear many odd conversations and hilarity.<br><br>The pizza is perfect. The taste is one-of-a-kind and the best you'll have for miles. The sauce is well made, not sweet. The toppings are fresh cut and good to the last drop. <br><br>The drinks are good, but service is slow on them. The juice selection is small, and really the beers are what you should be coming here for.<br><br>The desserts are...practically perfect, albeit a small selection. I ordered some carrot cake to-go and by the time I got home it was still perfect. <br><br>Definitely worth the visit. Ask my why they aren't 5-stars...? Bc the registration desk/host stand doesn't care whether you stay or go.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/javnm3tx8OROFGdUT_SZQg/348s.jpg", "caption": "Deliciousness"}]}}, {"review": {"des": "Beer snobs want to try Piece because of the number of awards this brewery has racked up over the years.  You'll also want to make room for some 'za, as I was most impressed by Piece's pizza lunch special: a 1-topping individual pie is $8.75, AND it's available until 5 PM.  Two words: yes, please!", "pics": null}}, {"review": {"des": "My favorite thing crust pizza in Chicago. I show this spot to all my family and friends. The delivery wait can be long but it's definitely worth it!", "pics": null}}, {"review": {"des": "We went on a Saturday evening, around 6pm. We got seated right away. The inside is nothing fancy-tables upon tables smashed together. Our waiter greeted us right away and took our drink order. <br><br>We ordered two medium pizzas for three people - the specialty chicken and honey pizza as well as the spicy sausage specialty pizza. The pizzas made it to our table quickly and hot. We also ordered several rounds of beers which all paired well with the pizzas. <br><br>The pros:<br>Original pizzas<br>Flavorful <br>Huge slices<br><br>The cons:<br>Tables are on top of each other<br>Draft beer selection is small<br>Thin crust<br><br>We probably took home the equivalent of one whole pizza. The pizzas are huge. We could have gotten away with ordering one medium or two smalls. Each of us had between 4-5 pieces of pizza. I usually don't eat more than two pieces of pizza but since the crust was so thin, I ate more. <br><br>I heated up the leftovers on a pizza stone a couple of days later. I was surprised at how well the pizza maintained its flavor.<br><br>We will definitely go back. Thin crust pizza isn't my favorite but Piece Pizza makes up for that by using what seems to be quality, fresh ingredients. Though it won't replace my favorite hand tossed pizza from The Stop Along, I will admit it's a better eat-in vibe. <br><br>I recommend both of the specialty pizzas, and going for an earlier dinner since it completely filled up while we were there.", "pics": null}}, {"review": {"des": "We stopped in yesterday afternoon at the tail end of the Bears game and this place was packed! Fortunately we found two seats at the bar. We ordered beers - I had the double IPA and he had the pale ale. DELICIOUS! I love me some local breweries and this is one of my new favorites. <br><br>We ordered a pizza with the Hot Doug's atomic sausage, spinach and roasted red peppers and the wait was normal for such a busy day. The pizza came out screaming hot and it was so so good. That sausage is awesome - spicy but not too bad and it goes great with the delicious beer at Piece. The staff was very busy so we had to wait some time between drinks but everyone was friendly and we really enjoyed ourselves. <br><br>We'll be back - thanks!", "pics": null}}, {"review": {"des": "Got the special of the month: honey crisp apple, bacon & gorgonzola za. I enjoyed the pizza but wouldn't go out of my way to go back. They do have a decently wide selection of beers on tap and lots of tvs if you're looking for a place to watch sports. If you're looking to have a conversation, it's way too loud.", "pics": null}}, {"review": {"des": "Solid pizza place with good music. <br><br>Came in for lunch on a Saturday and got a pizza and one of their house made brews. Pizza was solid and the flavor was on point. The beer was good and they have a nice rotating selection so things never get old. <br><br>Staff was friendly enough, not overbearing, but there if you needed something. <br><br>Good atmosphere and I plan to check it out in the evening as ove heard it's much better and more lively.", "pics": null}}, {"review": {"des": "Great New Haven style pizza.  Have come here a couple times over the last 2 weeks.  The pizza style is thin, but the crust has a nice chew and crunch to it.  <br><br>Loved the cheese pizza and loved the white pizza.  Had the white pizza with clams once and the second time had mashed potatoes and bacon as the toppings.  <br><br>One of the best pizza places in Chicago!", "pics": null}}, {"review": {"des": "Beware: this place is POPPIN on the weekend and they don't take reservations. As a result, you could end up waiting outside in the cold for a good chunk of time. That being said, they do a good job of letting in a good crowd to wait inside and order drinks at the bar until their name is called!<br><br>As far as pizza goes, I tried their honey butter fried chicken special, and it was fantastic! The crust is thin, but not crunchy, the cheese was flavorful as opposed to just bland mozzarella, and the crispy bites of honey butter fried chicken added both crunch and a dash of sweetness.<br><br>Overall, cool vibes and great food and drink!", "pics": null}}, {"review": {"des": "Amazing pizza and awesome craft beer. This combination lands them as my number one brewery on Chicago's North side. Several award winning brews.  I sneak in here any time I get a chance.  During prime time, there may be a bit of a wait but that's the price you pay for perfection.  I'd recommend getting a flight, take your time and enjoy it.", "pics": null}}, {"review": {"des": "Cool place with a cool vibe and GREAT pizza.   We watched the Bears kinda blow it while we were there, but the fan energy in that place was fun to be a part of.   The white pizza is to die for, great flavor, not greasy, well at least not with chicken on it, anyhow.   We also had a red sauce pizza with Pepperoni, Atomic Sausage, and Mushrooms, also outstanding.   The crust has great flavor, crisp, but a tad on the firm side, which I love but can give your jaw a workout for sure.   The staff was super friendly and attentive.  We will definitely be back.", "pics": null}}, {"review": {"des": "Ive been to piece a dozen times and it always hits the spot.  Its a fun, casual spot to hang out with friends and watch the game.  Its thin crust pizza is absolutely amazing- the sauce, the crust, the cheese, and the toppings.  My favorite is doing the red pizza with mash potatoes, jalapeños and sautéed mushrooms.", "pics": null}}, {"review": {"des": "I've been to Piece over a dozen times, and it's always that one place that will never, ever disappoint you. If you have friends in town: Piece! If you want a fun ambiance: Piece! If you want awesome beer and tasty pizza: Piece! (Do you see where I'm going with this? When in doubt, Piece!) <br><br>Great on-site brewery. Such fun pizza creations at your fingertips. You can pick between White or Red pizza and start loading on your toppings. (Mashed potatoes are a head scratcher, but trust me, it's a good choice.) They also collaborate with local restaurants/chefs and create a pizza of a month concoction. It's always delicious! There isn't a bad thing about this joint.<br><br>Wait there is... but I'm not going to knock a star because everything else more than makes up for it. The seating is somewhat hit or miss depending where you're seated. If you're sitting against the wall, the tables are so insanely narrow that you're practically on top of your neighbors. If you're sitting in the middle at the high-top tables, you're only comfortable for so long. But you know what, order some more beer and you won't even notice.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/PmHRCbmg-W9piOwNcq_eqA/168s.jpg", "caption": "Hot Doug's Atomic Pizza"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/1LR9iCdvdCo-635DDSp1fw/168s.jpg", "caption": "White pizza w/ spinach, basil, italian sausage and ricotta."}]}}, {"review": {"des": "The pizza was fine. I'd eat it again. But I won't go back for the lack of sound absorption. It was so LOUD in there ... I was ready to murder someone by the time we left. I like going out to eat with friends and family so I can talk and visit with them ... not to yell at them and struggle to even hear them.<br><br>Maybe I'm getting to be a curmudgeonly old lady ... but I'm guessing I'm not alone ;)", "pics": null}}, {"review": {"des": "The best sausage and artichoke pizza with a buttery crust. Large selection of beer and a great ambiance. I love this place", "pics": null}}, {"review": {"des": "Everyone says this is the best place for pizza, but I found it to be super mediocre. Having eaten pizza all over the world, this doesnt' compare to pizza in Little Italy, NYC, or from Neopolitan pizzas in Italy (Rome, Pisa, or otherwise). It's decent, but definitely not the best in town.", "pics": null}}, {"review": {"des": "I was surprised how big this place was.  Pizza was great and they have an amazing selection of beer.  Service was good and the pizza came out pretty quick.  I got a small pizza and could only eat about half of it.", "pics": null}}, {"review": {"des": "The pizzas were good but the hostess did not make us feel welcome at all.  We came Sunday afternoon hoping to avoid peak hours and the restaurant was busy but not completely full.  Our group of 10+ was willing to be separated and a table opened up for 10.  However, they said we couldn't take it since it didn't fit more than 10 people and that it would be over an hour wait.  Then we insisted that we'll take it for just 10 and the rest of the party can sit elsewhere.  In the end, we got 2 different tables, which was fine.<br><br>Pizzas come in 3 different styles and 3 different sizes.  Styles: red sauce, white sauce, or New Haven (red sauce no mozzarella).  Sizes: small for $13.99, medium for $16.99 and large for $19.99.  Toppings are $2-$3 each. For a group of 6, we ordered 1 small and 1 large and still had leftovers.  I'm not a big white sauce fan, but ended up liking the white sauce chicken and spinach pizza better than the red sauce pepperoni and green pepper one.  The crust is thin and delicious.<br><br>Their $9 warm spinach and tomato dip was pretty tasty.<br><br>....| \\      _  , , , - - , ,  _  ,      <br>.../  , ` . - ' ` '             . _   \\ -  ;  ;  ;  , _    <br>..| ,  a  -   )   ) _         . ; .  (   ` - ` -  ' - '   <br>'  - - - ' ' ( _ / . _ ) - ' ( _ \\ _ )", "pics": null}}, {"review": {"des": "Good vibe, excellent pizza and scrumptious beers! It's like the food trifecta! Woot woot!<br><br>I went last week with some friends for a chill night. I was immediately met by a really cool, trendy vibe. Despite being packed and not a super small place, it still had a locals/everyone knows everyone vibe. We grabbed a few beers from the bar and had a super short wait before being sat. I had \"The Weight,\" Which was a perfect pale ale. Throughout the night, our table also had a few of \"Roadhouse\" and \"You've Got Mail.\" Happy campers all around!<br><br>We got a large red pizza with pepperoni, sautéed mushrooms and black olives. The pepperoni had a bit of a kick, which I loved. You could also taste that the mushrooms had been seasoned and sautéed prior to baking on the pizza. This makes a huge difference in the flavor and I loved it! And the size of this thing! Huge! <br><br>Service was also great. What a great meal!", "pics": null}}, {"review": {"des": "Thanks for the response from Piece on Yelp but the long wait and pizza was really not worth my time or money.<br><br>I really wanted to like this place, but again it was below average. I didn't even want to take my leftovers home. We got an oversized pizza that looks cool on a table but it really sucked in taste. It was soggy and nasty.<br><br>I'm glad to see all the positive reviews and Anthony Bourdain's recomendation - according to the business (I have followed Bourdain for ten years) but I found nothing that made the food here anything worth coming back and trying.<br><br>When visiting Chicago again I'll be back for deep dish pizza.", "pics": null}}, {"review": {"des": "We went on Sunday of Labor Day about 6pm and had a great dinner. 4 of us shared a large pizza and it was the perfect size. We had to wait about 30 minutes for a table but since they text you when your table is ready, we were able to go to the bar next door while we waited. Definitely a great spot for some thin crust or make your own pizza.", "pics": null}}, {"review": {"des": "Overall: While not mind-blowing by any means, Piece is definitely a step above some of the others and delivers crisp, flavorful pizzas and is sure to please.<br><br>The good: The pizza as a whole is above-average and definitely recommended. The crust was crunchy but not burnt, and the sauce/cheese/topping ratio was really good. Out of the red and white pizza that we got, the white was actually much more flavorful. Both were great though. The service was friendly and quick to get us our beers, and the pizza came out surprisingly fast (wasn't a full house). Lots of seating and TVs, this is definitely a sports stop.<br><br>The not-so-good: For the most part, you have to make your own, which is fine but sometimes I like a place that has their own special creations. A little expensive for pizza, given that there's no unique toppings or combinations. No reservations for smaller parties.<br><br>Atmosphere: 8.5/10<br>Service: 8.5/10<br>Food: 8/10", "pics": null}}, {"review": {"des": "Damn the food in Chicago is seriously life changing. <br><br>This place was no different! The space is HUGE with tons and seating so although it was crowded, we were able to snag a table for two fairly quickly. <br><br>I had their pizza special, honey buffalo fried chicken. IT WAS AHMAZING. My boyfriend doesn't like buffalo so I had the whole thing to myself! *heaven*<br><br>We also shared the burrata app - mozz cheese sitting a bowl of tasty tomato sauce. It was piping hot but so good!<br><br>The only bad thing was that the service wasn't great, but luckily their food made up for it.", "pics": null}}, {"review": {"des": "The beer selection is interesting and the pizza we had (the famous honey fried chicken) was tasty- it just wasn't the best I've ever had. <br><br>It was really loud when we went. My friend and I couldn't hear each other over the noise.", "pics": null}}, {"review": {"des": "I kid you not, Piece was one of the main reasons I was able to complete the Chicago Marathon. Given my obsession with Piece (for nearly ten years... cannot believe I'm just writing this review) my family and friends knew what carrot to dangle to get me over the finish line - Piece.  From the delicious and addicting New Haven style pizza to the award winning beers (my fav: swinging' single (regardless of my relationship status)), to the passionate, friendly staff (many who have worked there five+ years), and the hands-on and hard-working owner - I couldn't love this place more.  <br><br>I've always loved that you can customize the pizza's sauce and high-quality toppings and over the past few years have loved that the restaurant pairs with a local restaurant to come up with seasonal pizzas - my new go-to: Honey Butter Fried Chicken pizza.  Thank you, thank you Piece for making it a permanent menu item. Do not knock it until you try it! <br><br>The only issue is that I can only go with nonjudgmental family/friends to Piece given that all self-control once that piping' hot pie is placed in front of me is lost :( / :).  <br><br>The world needs more Piece!", "pics": null}}, {"review": {"des": "I'm from Chicago born and raised and love everything about the city, but no matter what I still prefer thin crust pizza and Piece kills it. Their crust is crisp and a little charred which is just flavor and has a great chew to it. The sauce is good and the toppings are always fresh and have plenty on the pie, but the real surprise is the white pizza! The white pizza is very basic, olive oil, garlic, and mozzarella, and there's got to be something they're not saying because it's too good to be that simple. I've tried several of the different styles of pizza they offer and it's always impressive. Another seemingly unimportant fact that I love is the way they cut their pizza. It's always cut into slices, but not one of the slices is the same size and that allows me to have an extra smaller one even I should've stopped eating. One of the best, non deep dish, pizzas around no doubt.", "pics": null}}, {"review": {"des": "Casual space, apathetic service, good dough.<br><br>Popular local place to get pizza/beer and watch a game. Good for takeout as well. Always busy. Be prepared for 1+ hour wait times during peak times. Fan of the doughy thin crust texture. Hot Doug's Atomic Sausage, New Haven style with clams, and many other combos have all been great.", "pics": null}}, {"review": {"des": "I think this is some of the best pizza in Chicago. It's technically New Haven style pizza (thin, dark on the bottom, huge slices) but Chicago does a great job making it! If you come on a Friday, Saturday or Sunday, the place is packed!!! Come during the week during an off hour, or if you come on the weekend, be prepared to wait. The beer is also really good! They also take party reservations if you have over 25 people.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/PQYc8CXS8ORA_nd6-2rzlw/348s.jpg", "caption": "Delicious pizza! And huge!!!"}]}}, {"review": {"des": "When you're in a city known for its deep dish pizza Piece Brewery and Pizzeria can be a breath of fresh air. My friends and I decided to check this place out because of their New Haven style pizza and it definitely did not disappoint! <br><br>If you come here on a weekend you'll most likely be in for a long wait, as the restaurant is filled with both adults and children. It's a pretty busy/loud environment but the servers seem like they're accustomed to the chaos. Ordering is as straightforward as one would expect and the pizzas we got were all delicious. Although the beer list wasn't super huge, whatever was on tap was sufficient for our taste. I'm personally fond of pale ales and the ones offered here hit the spot. <br><br>With the plethora of deep dish chains in Chicago like Giordano's or Lou Malnati's, Piece can satisfy your needs for a simple, straightforward, New Haven style of pizza that won't stuff you after one slice. If you have a big enough group, be sure to try out the white pizza here!", "pics": null}}, {"review": {"des": "Wonderfully surprised by the very tasty pizza here.  We decided to start off our Girls Only Weekend Trip and had lunch here and Piece Pizza did not disappoint.  <br><br>I loved how the crust tasted.  It was nice and crisp but still doughy and flaky enough to chew and enjoy.  We just got the traditional red sauce pizza with pepperoni, sausage, and mushrooms.  Perfection.<br><br>We also started of our meal with 2 appetizer dishes: goat cheese dip and spinach dip.  I'm not usually a fan of goat cheese as it leaves a funny aftertaste, but the dip was mixed with some type of marinara sauce which canceled out the aftertaste.  Both dips were served with sourdough bread slices and bagel chips.  Our server was kind enough to bring us more chips and bread when we ran out.<br><br>This also has a nice selection of brewed beer on tap and bottled.  All originally brewed.<br><br>Will definitely come here again!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/XcPdyv8lQDUu4klU71AJeg/168s.jpg", "caption": "Large pizza"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/UUrF1A8BtdNC9iWj5m5RJw/168s.jpg", "caption": "Goat cheese dip w/ sourdough bread"}]}}, {"review": {"des": "Amazing pizza! They have many TVs for sports watching and lots of seating! The pizza crust is one of the best I've had. Lots of beers and drinks and they are also perfect for brunch!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/JdJlWYSFW-bP3Xhwfb9Fcw/168s.jpg", "caption": "Blood"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/qasW7eG2zmpDj3LuAIC7jw/168s.jpg", "caption": "White pizza on left w chicken and mushrooms. Red pizza on the right w pepperoni and mushrooms"}]}}, {"review": {"des": "This place is underrated.  It's in the heart of Wicker Park. <br><br>Every time I see posts on social media asking for recommendations for places to eat in Chicago, I ALWAYS throw this place on that list.  <br><br>This was the first pizza restaurant that I tried when I moved to Chicago for a year.  You can customize your pizza.  It's extraordinarily fresh, comes out quickly, and goes great with their self-brewed beer.<br><br>Although I advocate for deep dish as well, do not overlook the experience that this place has to offer!", "pics": null}}, {"review": {"des": "New haven style is an acquired taste In that the crust is thin and chewy/crunchy. It's really hard to describe. <br><br>We had the red with mushrooms. The mushrooms were excellent. For me the crust was too dry and chewy but for me way better than the deep dish style. <br><br>The cheese had good texture and flavor. <br>Overall for me New York style still is supreme.", "pics": null}}, {"review": {"des": "Had lunch here the other day... the meatball sandwich was delicious and the perfect size- it came with some plain chips.   We  also had pizza that was pretty good. I had to ask for refills on the drinks a few times.  <br>The restroom was spotless ;-) <br>The place is good overall but a little pricey. <br>My hubby liked to go here to hang out and have drinks in the evenings.....", "pics": null}}, {"review": {"des": "Piece is exactly what I needed to warm me up on the cold rainy day in Wicker Park. Pizza and beer are a match made in heaven!<br><br>The vibe is super chill and the smell of fresh pizza dough fills the air. The service was prompt and friendly. I ordered a flight of four beers for $10. I had the kolsch, belgian ale, hefeweizen, and stout. The belgian ale was my personal favorite however all of them were solid brews which would be sure to please the beer purists. The pizza was thin crust red sauce style and we topped it with meatball, green pepper, red pepper, onion, and garlic. Delicious! I was bummed that it wasn't Chicago deep dish however I'm a thin crust addict so I shouldn't complain.<br><br>Overall I loved Piece and I hope to return here next time I travel to Chicago.", "pics": null}}, {"review": {"des": "Pizza and Beer are great here! This is our favorite Wicker Park pizza place. If you are going during peak dinning hours be prepared to wait. If you are lucky enough you might be able to find a place at their bar and order some of their award winning brews. <br><br>The serve white and red sauce pizza. I just am not a white sauce person so I have no idea how it is...but their red sauced pizza are great. When we first started going here we just built our own. Then we learned about the Hot Doug's Atomic Pizza. OMG, jackpot!!!  My tastebuds couldn't be more satisfied. I can't order any other pizza since our discovery. It's a red sauce pizza with spicy sausage from Doug Sohn and cartelized onions covered with pepper jack cheese. SO GOOD!!<br><br>They have a full bar but when you are in a brewery, you should get beer. Which is what I did. My staple is the top heavy hefeweizen or Golden Arm but I was feeling adventurous so I ordered the Dark n Curvy. It didn't disappoint.<br><br>PRO-TIP: They have a Sunday take out special. You can get a growler of beer and a pizza for $25!", "pics": null}}, {"review": {"des": "So sad about this one. I wanted to like this so badly <br><br>Myself and three friends went in here after work for some drinks, when we were approached by the server, she asked if we were going to be just drinking or eating food. We responded \"we are here for some of your craft beer and drinks\". She proceeded to tell us not to take up a servers table and told us to go order at the bar. <br><br>She gave off the vibe that someone had wronged her in only the way that a militant-feminist who hates men, could. <br><br>End of story - we walked out. Won't be back.", "pics": null}}, {"review": {"des": "If you want good pizza and have a decent amount of time to kill, this is a great spot to come. They have a wide variety of beers to choose from and tons of toppings to pick for your pizza. It did take a while to get our pizza but I didn't mind because it came out nice and hot and our beers were kept full while we waited. <br><br>The prices are a bit steep, however, so that was the main reason for giving four stars instead of five.", "pics": null}}, {"review": {"des": "Went on a recent trip to Chicago on a Sunday night and got in without a wait, but it was pretty busy otherwise. There are ample TVs if you're looking for a sports game.<br><br>I was surprised by the menu in that they only have one signature pizza, but it is otherwise a make your own structure. They offer white, red, and a tomato base (no mozzarella, for the lactose intolerant).<br><br>My buddy and I ordered a medium (feeds 2-3 people, but actually more like 4, unless you are a large Norwegian midwestern type). The pizza was great, good crust with a nice garlic finish. <br><br>The servers were extremely kind and accommodating as our party size changed frequently throughout the meal. Overall, a good spot to watch a sports game and enjoy a few beer.", "pics": null}}, {"review": {"des": "This is probably one of the best pizzas I have had ! The crust is thin and very crisp which was delicious! My group ordered hot Doug atomic pizza and white sauce with clams, spinach, and red onions. The white sauce pizza was the best because it came with lemons so that added an unique twist which was delicious. I high recommend getting the white sauce with clams and another topping! The hot doug wasn't as good as the white sauce but still tasted very good! The one bad thing was that for the white sauce pizza the clams were unevenly distributed so some slices had a lot more than other slices!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/oA0FyE9VGaILB39qwNSUdw/168s.jpg", "caption": "White sauce with clams spinach and onions"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/PX8IxWiJN2Me1Z93KgOYDw/168s.jpg", "caption": "Hot doug atomic pizza"}]}}, {"review": {"des": "I've been here three times and each time the food and beer gets better and better. My most recent experience was to try their special Lobster Pizza, which took place only on Tuesday's in August (please make this collab a permanent piece of the menu). <br><br>My coworkers and me waited 10 minutes for a table, but we were able to grab a quick beer while waiting. When the time came, we ordered a medium lobster pizza and the large Honey Butter collab pizza. I couldn't tell you which one was better because they were both to die for. The lobster pie was well balanced, having a piece of lobster in almost every bite. The honey butter pizza was fantastic and everyone should order it. A red sauce pie, drizzled with signature Honey Butter Fried Chicken's honey and chicken, red peppers and banana peppers. The honey smooths the sharpness of banana peppers and the chicken's crispiness matched the texture of the pizza's crust. Pair this pizza with The Weight (classic APA) beer and you will have one of the best meals ever. <br><br>This is some of the best pizza in Chicago and is truly in a league of its own. Beers, Pizzas, and great service. Can't wait to come back! Thanks Piece!", "pics": null}}, {"review": {"des": "For me...this is a Chicago staple.  The sausage broccoli white pizza is some of the best I've ever had.  They are extremely consistent and you'll find that the crust is always cooked perfectly even for to go orders.   The pizzas can get expensive but they are quite large, I don't mind paying extra for the quality.  This is definitely one of the top spots for pizza in Chicago located in the heart of Wicker.", "pics": null}}, {"review": {"des": "Went on the pizza tour and we had a special honey chicken pizza. It was delicious. Would go back for more after the tour. It was a regular thin pizza with enough grease and great taste.", "pics": null}}, {"review": {"des": "It's a 6:15pm on a thirsty thursday.. with an hour to go before our reservations down the road, we think.. oh no brainer, lets go crush some beers at Piece before. As our group proceeds to sit at 1 of the 5 open tables.. the blonde hostess walks over and abruptly demands that we move to the bar. <br><br>No problems with that whatsoever, but maybe a little respect and maybe a \"oh hey guys, is cool if your not ordering food if you can sit at the bar?\" Not too hard of an ask to a group that easily would've spent over $100 with the group we had in under an hour. <br><br>Appalled at this behavior. How she works at place with an amazing reputation, blows my mind.<br><br>What did we do you might ask? Walked right out!", "pics": null}}, {"review": {"des": "Been here a couple times this place is large on the inside they have big tables and community seating. They have their own beers and a large variety of other beer as well. The pizza is great I've has their bbq chicken pizza and it was excellent. So this time it was 4 of us and we ordered a large pizza. Now before you order you should have a plan it's they have so many toppings and it can get expensive and overwhelming. We ordered a tomato pie style pizza. The crust and is tomato sauce, garlic, and fresh parmesan that they shread. We went a little topping crazy with Garlic, onions, peppers,meatballs, spinach and giardinera on the side. The bar is huge which is plus if you have a group. I'll definetly be back with a plan, or just order one of their regular pizzas.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/7_JGaGR8M31u2Xe4n_7acw/348s.jpg", "caption": "Tomato style pie, with garlic, onions, spinach, peppers meatballs and giardinera on the side"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/5wHp8bvbS0rHgKA-rZgcGA/168s.jpg", "caption": "Heavy bag Porter 6%"}]}}, {"review": {"des": "Such a fun place to go on a weekend! The ambiance is very lively and fun but crowded so expect a wait. We got some beers at the bar and hung out while waiting so it went by fast. The pizzas are delicious. I loved the flavors and the unique toppings - my favorite was white sauce with clams, broccoli and potatoes! However, I thought the crust was pretty tough and too chewy for my tastes. <br><br>Seeing the giant pizza pans come out is definitely a treat in itself too :)", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/0Bvy_92bQC51ReOXmoWwkQ/168s.jpg", "caption": "Golden arm and the heavy weight"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/MfXRSTDBa3PV21Q_rk00Iw/168s.jpg", "caption": "Delicious pizzas"}]}}, {"review": {"des": "I spent the past 20+ years living just outside of New Haven where I frequented Pepe's, Modern, Sally's, and Zuppardi's. After moving to the west coast and being disappointed with every pizza there, and even the Chicago deep dish, I had to try the taste of home this place claimed to have. Boy am I glad I did! This was as New Haven as a pizza can be. You can never perfectly replicate a Pepe's or Modern without building their oven and having their recipe, but this is the closest you will get. It is undoubtedly New Haven pizza, if it was in New Haven it would be one of the literal handful of restaurants known as New Haven style. Not only is the pizza spot on but so is everything about the establishment; i.e. so small that there will be a line you don't want to wait in, but gladly will for what you get, the rectangular baking trays and wire racks the pizza is served on, the poor quality napkins, not having paper towels in the bathroom to properly clean the pizza grease off your hands, and staff that is friendly but doesn't have time to BS and chit chat. It the authentic New Haven experience. <br><br>As a side note this pizza is best, and only should be, eaten on the spot right out of the oven. Don't do take out, it looses quality like every New Haven style pie does. Wait in line and eat it there on the metal trays and cut off the first few bites while it's still hot. You will not be disappointed.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/KvI2EhOScHGsU7AX0HBMWg/348s.jpg", "caption": "Small cheese"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/t68YtHJW9iItacexSx7oKw/168s.jpg", "caption": "Outside"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/C0QcVCF8sKqG6RtQQanhuA/168s.jpg", "caption": "Front of menu"}]}}, {"review": {"des": "Come for the atmosphere if you're hanging out and watching a game. The pizza is good but pretty average overall when it comes to Chicago thin crust pizzas. The pizza alone is not worth a long wait or price.", "pics": null}}, {"review": {"des": "I was actually looking forward to eating at Piece based off of all the reviews, but our experience was quite a letdown. It was a Friday night around 9 p.m. so we expected a wait. We hung out by the bar, got some drinks, and it took over an hour an a half for all of us to get seated. There were plenty of open tables but the staff didn't really seem to care to seat our group. I personally went over and asked if we could sit down at one of the tables since it was open and was straight up just told no. Even though 15 minutes later, they ended up putting us there anyways...?<br><br>By the time we sat down, we were all starving. We ordered 3 large pizzas for 9 people (6 guys and 3 girls), which was certainly more than enough. They aren't messing around when they say large, the pizzas came out on huge industrial size baking trays. As for the taste, it was fine, not anything special. Kind of reminded me of Domino's, tbh. However, my main complaint would be the way that it was cut seemed very careless. Some pieces were so thinly sliced while others were way too big to fit onto the plate.<br><br>Service was lacking. Our waitress came over and asked how everything was, before anyone could even respond she just turned around and walked away. Seemed like she was just asking for the hell of it not that she really cared. <br><br>Not worth the wait. There are plenty of better pizza joints out there.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/N-5wCAHa66cZn5fFzmVYLA/348s.jpg", "caption": "Pepperoni, Italian sausage, and onions"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/m0CflGrAgz9HNz7rdvGrcA/168s.jpg", "caption": "Pepperoni, Italian sausage, green peppers, and jalapeños"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/2aH1tBlJ0vVztiEMSSS9yA/168s.jpg", "caption": "White sauce pizza w/ bacon, chicken, onions, jalapeños, and banana peppers"}]}}, {"review": {"des": "Their thin crust pizza pars perfectly with their wide selection of home brewed beers.  I really like their spinach pizza and their porter beer, but after trying a tasting flight of their beer everything seems pretty good.  Very accommodating for big groups, cool place to meet up in the heart of Wicker Park.", "pics": null}}, {"review": {"des": "Awesome! I've been wanting to try Piece for years and finally made it. They have a great selection of beers on draft but also drink options like Moscow mules. The pizza is a nice change from typical heavy deep dish. <br><br>Our server was super attentive and when we asked if we could order one pizza for now and one to go, she was on it! We ordered two build your owns- one red with all the meats and one white with veggies. When we were about to leave, our waitress realized that the kitchen had made one too many pizzas and told us we could have the extra one for FREE. How awesome!!!! Thanks, Piece! We will for sure be back.", "pics": null}}, {"review": {"des": "Go with more than two people or they put you in the miserable row of terribly small tables all spaced about 6 inches apart. The look on everyone's face when seated here is the same but the wait staff is seemingly oblivious to how crappy this arrangement is.<br><br>The nice thing is you can hear all about your neighbors shitty, boring marriage or the stories about their cat doing average cat things.<br><br>Who in their right mind thought that arrangement would be desired by anyone? 2 star experience because the food is good.", "pics": null}}, {"review": {"des": "I had heard that this was some of the best non-deep dish pizza in Chicago, so I came in with high expectations and was disappointed to find that they weren't met. <br><br>The food wasn't bad but it was very typical bar food. We started with the spinach dip - it was just ok and was served with bagel chips that you would buy at the store. We also got a white pizza with a few toppings. Again, it was just ok. <br><br>Since there are so many options in this part of Wicker Park, I definitely don't plan on coming back soon.", "pics": null}}, {"review": {"des": "Piece brewery and pizza has amazing reviews, but it doesn't live up to the hype at all. It took over an hour to be seated there. I realize we had a large group, but there were plenty of open tables and ways the staff could have made it work--they just didn't. <br><br>The service was meh. <br><br>The pizza was greasy, salty, and soggy. The crust was just overwhelmed by the grease and not cooked enough for its size. <br><br>The beer was fine, but it wasn't astounding. Certainly didn't live up to the amount it was hypes. <br><br>If you're looking for large pizza to shovel into your mouth while watching sports, then sure this place will do the trick. But if you want anything more, there are plenty of better options.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/uj-EvgId1FOEkMLKChYLnw/348s.jpg", "caption": "One of the large pizzas"}]}}, {"review": {"des": "My dad had heard great things about this place so he took me here to try it out. It was really good! The pizza was crispy and delicious. Not too heavy, either. We came hungry and shamelessly finished two pizzas by ourselves. Really yummy. I've been meaning to come back but just haven't been in the area!!", "pics": null}}, {"review": {"des": "My husband and I must go to Piece every time we come to Chicago. It is definitely the best pizza in Chicago. The crust is somewhere between New York and St. Louis style pizzas and just crispy and chewy enough to be satisfying. The red sauce is amazing! I love a sauce with a good tomato taste and a little zing, both if which are found in Piece's red. The pepperoni is on their premium toppings list but that's OK because it's super tasty, a tad spicy, and sliced to just the right thickness. I'm not a beer drinker but my husband enjoys their beers and almost always orders a Piece beer instead of a guest draft. The atmosphere is cool although a tad loud because of the high ceilings and large open space. The service has always been good. Everyone comes to Chicago for deep dish but we say skip the pizza casserole and eat at Piece instead. Hey, Anthony Bourdain agrees with our opinion.", "pics": null}}, {"review": {"des": "I've been wanting to try this place for a while now. Occasionally I'll see it crowded and it has great reviews so last night I decided to see what the hype was all about. <br><br>While the service and beer were good (nothing above great), the pizza was absolutely not. I felt rather let down for the $50 price tag of our medium three topping pizza (plus two beers). <br><br>I really don't understand the hype of this place. <br>The pizza was lacking sauce so much that I had to ask for a side of dipping sauce. <br>The crust was really thin, almost to the point of it being a cardboard. <br>It had this weird taste to it that I couldn't pinpoint so I don't know if it was the bread, sauce, or toppings.<br>It came on this huge pan that blocked my entire table so it was uncomfortable to eat.<br>Nothing about this pizza said WOW!<br><br>Maybe I just had a one time bad pizza but I don't think I'll return to find out.", "pics": null}}, {"review": {"des": "Really tasty pizza. I got a large sausage, mushroom, and feta. The feta was a nice touch. Although almost everyone was drinking beer, they do serve wine. The Cabernet I had was pretty bland. I did not like the bagel chip appetizer with dip.", "pics": null}}, {"review": {"des": "Pizza. Beer. Sports. A good time. <br><br>Looking for a combination of any of those things? Piece is the place to go!<br><br>Wait can be long if you go on a weekend night, but I say it's worth it. There's a fun energy and generally good vibes in this place. Yeah, it's not really a quiet restaurant but the noise has never been overwhelming when I visited.<br><br>The food and the beer are both on point. You can order a huge, customizable pizza with your buddies and can split it in half if y'all want different toppings. I'm a fan of the red sauce/chicken/onion/goat cheese/spinach combo. As for the beer, everything I've tried has been great so you really can't go wrong here.", "pics": null}}, {"review": {"des": "I got a small plain pizza, minus parmesan, and added mushrooms, spinach, and onions. The crust was pretty good and tasted quite healthy, which is what I was going for. It hit the spot. Hope I get another opportunity to eat here!", "pics": null}}, {"review": {"des": "When these guys do it right, they crush it, but... how about some quality control! <br><br>From time to time they scorch the crust and this time it was also soggy.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/rXUUaSmLw6qSb0UT7oC6Vw/348s.jpg", "caption": "Burnt and wet..."}]}}, {"review": {"des": "My friends and I came here at 6 pm on a Friday and seated in about 10 minutes for a table for 5. However, they told us our wait would be 30-45 minutes. We were seated with only 3 people. <br><br>We shared a large garlic, fresh basil, and sausage pizza with red sauce. Overall, it was a delicious pizza but nothing life changing.  The red sauce had a lot of flavor. I could also taste the garlic which wasn't overpowering. I may have had too high of expectations with this place because of all the hype though. <br><br>Our table had 4 girls and 1 guy. For us, the large was the perfect size. However, if you have more males or people that can eat a lot in your party, you may want to size up. Keep in mind that we didn't order any apps just beer. <br><br>The restaurant was noticeably busier as we were leaving around 8 pm. Good pizza but I probably won't go out of my way to come back.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/IURzFPsGkDgtTvCP6XQB_A/168s.jpg", "caption": "Duck at the bar"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/EZaf45koHnbEmpD6RqE6Dw/168s.jpg", "caption": "Large fresh basil, sausage, garlic pizza"}]}}, {"review": {"des": "I would give this 4.2 stars if I could. It has great variety of pizza, breaks up the regularity of Chicago style pizza with a new haven style, and offers an extensive beer menu. I would give the high arching ceilings, seating, bar setting, and TVs a 5, and give the pizza a 3.8. I think the vibe is great, offering a cabin like feel and feeling of warmth in an otherwise crowded part of wicker park, making it a good place to find a safe haven in that area to stay. I will post the speciality pizza (Jamaican jerk) and the white pizza with bacon and peppers. They were good. Not exceptional. Definitely good. <br><br>If you like thinner than Chicago style  pizza, I think piece has some good things to offer. Homeslice, happy camper, and coalfire would be 3 spots I would go before I go here for the food, but again I would definitely come back.", "pics": null}}, {"review": {"des": "I've been here twice and it's great every time! Check IDs at the door so you don't have to bother once inside. Booths are deep and long, tables are shared community style. Great place for wicker park to have! Pizza is unique, Served on cooking sheets. Menu is simple, great beer selection.<br><br>Any way to get cheesy garlic bread added to the menu?", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/aEa-0WcQrvov0ra5YiN6DQ/348s.jpg", "caption": "Great place to catch up with friends!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/-s-npFtE3_V9Ly3gyPxhqQ/168s.jpg", "caption": "Pizza!!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/yFGYdPiy_UI_E0S7okks3Q/168s.jpg", "caption": "Waitress said the coffee was bad, I loved it after she made a fresh batch. Thanks!"}]}}, {"review": {"des": "Yummmmm.<br><br>We came on a freezing cold Friday night and the place was still hoppin. I knew we found a good place.<br><br>We started with the goat cheese app. Yum! The flavors were on point and the bread that served as a vehicle for the goat cheese was perfectly toasted. Ordered the white pizza base with chicken and spinach. Kept it simple and nutritious, lol! It was so good! The chicken could've been a bit more moist but that is hard to achieve on pizza. The white sauce base is yummy and the crust on this pizza was fabulous! So crispyyyyy. My fave. <br><br>Also had the blonde ale, it was easy to drink and smooth! <br><br>Service was great. No complaints. This is a legit pizza, guys!", "pics": null}}, {"review": {"des": "~Piece was poppin' on a Thursday night~<br><br>I was invited to come here by a girl on our second date and she described it as her favorite pizza place in Chicago. If that doesn't intrigue you for a dinner idk what will. We enjoyed some craft beer to start off and I think at least one of ours was brewed at Piece. T'was decent. It's been awhile since I've had a beer I didn't like. We went for the thin crust with traditional red sauce and I'll admit it was about as good as you could make a thin crust pizza. I was glad to find a combination of parmesan, crushed red pepper and oregano shakers already on the table. The pizza was cut into pie slices and this is important because the girl I was with thought it was weird when I bent the pizza as I bit into it. You gotta bust out that technique whenever the pizza crust has a length greater than 4\" and extends at a linear acute angle greater than 60 degrees.<br><br>Had some extra leftovers that were just as good the next day when I heated them up on a frying pan. Don't tell anybody this, but I'm more of a deep dish guy when it comes to \"Chicago's Best Pizza.\"<br><br>Sorry to burst your bubble Maria<br><br>I had a really nice time though :)", "pics": null}}, {"review": {"des": "I love this place! always busy, packed with hipsters having a great time, enjoying some awesome beer and some of the best pizza in Chicago. Not much of a selection of tequila but the bartender found a bottle of 1800 reposado that hit the spot. Service was excellent. We ended up talking to the folks that sat next to us the entire evening and made some new friends and a few more rounds of tequila than we had planned. Large sausage, pepperoni and garlic. I don't know how they continue to pump quality pizza time after time and year over year.", "pics": null}}, {"review": {"des": "I can't count how many times I've been here it's my go to spot for a casual night out with friends. Great beer and amazing pizza!!! 100% recommend.", "pics": null}}, {"review": {"des": "The best pizza in Chicago. I'm upset it took me 6 years of living in Chicago to find out about this place.", "pics": null}}, {"review": {"des": "Greasy pizza. Delicious pizza. Solid beer. Bunch of TV's. Poppin. Amazingly friendly staff/servers.", "pics": null}}, {"review": {"des": "So this has been my first time ever here. The service and the food were really good although they don't believe in spatulas. So you kind of have to be careful the minute you get the Pizza, which tasted really really good, you have to actually maneuver the plate underneath the piece you want otherwise everything just slides off. So we had 2 Ryan's that helped us, one was our server and he was a pretty nice guy and very informative, and and was very social when I was asking some questions about the place.. I know they have different karaoke venues and I wish this one had more it was overall a fun time.", "pics": null}}, {"review": {"des": "I'm a big fan of this pizza. It's thin crust. No deep dish here. <br><br>The sauce on their pizzas is delicious. Plus, you can mix and match any toppings you want. Everything from bacon-basil to pineapple-mashed potatoes. Don't knock it til you try it. <br><br>My only con about Piece is the wait time on weekends is usually pretty long and there isn't a great place to stand and chill before your table is ready. Will that stop me from going and getting my pizza on? Nah. It's worth the wait.", "pics": null}}, {"review": {"des": "Chicago was bitterly cold and windy outside that night, but when we stepped into Piece Brewery and Pizzeria it was like a warm hug. They were playing the best music play list filled with Green Day, Match Box 20, Eve 6, Nirvana, etc. The beers and food were equally with the trip. I would suggest the Roadhouse Double IPA and the goat cheese appetizer. Sadly we didn't go in planning on having dinner so we didn't order the pizza on this trip, but each pizza that passed by us looked and smelled great. Gives us more reason to have to visit again in the future.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/61AFGFbE_bliZbD4r5Zbzg/348s.jpg", "caption": "Roadhouse Double IPA is solid IPA"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/bH7d1TXWvSH_BIQ7ycv6RA/168s.jpg", "caption": "Goat Cheese appetizer is a cant miss"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/6psqaJKKihlzLDpkPwOwxg/168s.jpg", "caption": "Piece beer sampler"}]}}, {"review": {"des": "Yummy pizza! We arrived after 5pm, so I couldn't order an individual sized pizza. I got the small pizza and wow -- so fresh! They didn't slack on the toppings and it even tasted just as good when I reheated my leftover slices the next day. It's not cheap (especially if you love your multiple toppings) but it's definitely worth it.", "pics": null}}, {"review": {"des": "Thoroughly enjoyed our pizza trip here. The crust was amazing on top of the very flavorful toppings. We had half Italian sausage and half pepperoni. It was great. We were a little sad that they did not have pineapple as a topping. It was a little noisy, but it's also a brewery so that's to be expected. Great tv views all around to watch football on. All in all a great experience. Highly recommend.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/UXFeC-saVfI0gaLqfzIUOA/168s.jpg", "caption": "Seating area"}]}}, {"review": {"des": "Come for the pizza, stay for the beer!<br><br>This is a great chicago spot for some New England style, thin crust pizza! We had the red sauce and kept it simple with pepperoni and black olives.<br><br>The crust is great, thin, not too crispy not too crunch. The sauce is very flavorful and was exactly what I was looking for. The cheese and toppings bring it all together. The perfect amount of cheese and there wasn't a bite I took that didn't have a pepperoni or olive on it. This pizza is what you are looking for in a thin crust in the city.<br><br>The beer was the real unsung hero of the night! Shame on me for not expecting more but these man sodas really hit the mark. I had the weight and a brown ale and both were spot on.<br><br>Pizza and beer, what can go wrong!<br><br>Enjoy!", "pics": null}}, {"review": {"des": "So right off the bat, this is not Chicago style pizza - not Chicago deep dish, not Chicago thin crust. Nor is it New York style. It's New Haven style which really doesn't matter as long as you keep in mind one thing: clam pizza. It's a Connecticut thing, and makes for the best pizza here. Sure, it sounds weird, but anyone I've fed Piece's white pizza with clam and broccoli to immediately becomes a convert.<br><br>I also recommend getting a red pizza with ricotta here - for some weird reason I'm a fan of creamy textures on pizza and ricotta definitely delivers.<br><br>Can't forget the other part of Piece's subtitle, which is their brews. Of all their beer varieties, I recommend the flight. I can't recall any beers in particular, but I've always had a good time trying each of their offerings.<br><br>As far as the venue goes, it usually gets packed here, and with good reason. The food and drinks are good, and they often have events like live band karaoke which I highly recommend. It might get too loud to have a conversation with your friends, but the entertainment trade-off is worth it. I've also had luck planning a group gathering here, though it worked out well that it was a late afternoon thing rather than later on in the night. It surprisingly didn't cost too much for some large pizzas and beers, and there was no reservation fee. Note that they don't take reservations otherwise.<br><br>If you're cool with a boisterous environment and want some unique pizzas you won't find elsewhere in Chicago, give Piece a visit. Just make sure you're ready for the inevitable wait.", "pics": null}}]}