{"name": "pierrot-gourmet-chicago", "reviews": [{"review": {"des": "Had Breakfast here with my hubby after a morning massage at the Peninsula! I highly recommend the Shrimp and Grits. It's Amazing!!!<br>Husband had the flatbread...which didn't disappoint.<br><br>The Grits here are to die for...not sure what they put in them. You have to order the grits!!", "pics": null}}, {"review": {"des": "I came in the other day for...wait for it...... a chocolate chip cookie! Because who doesn't need a cookie in the afternoon while walking around downtown. Cookies are an integral part of a healthy thriving diet if you ask me. I wish I could review the overall experience, but I will stick with what I know for now, which is the cookie. <br><br>They had a good selection of three choices: snickerdoodle, chocolate chip, and double chocolate. The staff member was patient with me as I decided - it's an important decision that takes time, investigating each option and asking questions, lol. I was very happy with the chocolate chip cookie although I do wish it had a bit more crunch. I like a good balance of crispy and and soft. <br><br>Anyways, that's about all I got for now. The atmosphere was delightful, and I will look forward to going back for lunch one day as many people looked happy eating their meals in the crowded community setting (outdoor patio looks lovely too!).", "pics": null}}, {"review": {"des": "I came here for brunch loved the outdoor seating.<br><br>The chicken pot pie was PERFECT. Literally from crust top to bottom. The chicken, truffle, sauce mmmmmmm and veggies LOVED it.<br><br>Vanilla iced latte was fine.<br><br>Will come back", "pics": null}}, {"review": {"des": "My Mom and I had brunch here yesterday and everything about this cozy little spot at The Peninsula Hotel is perfection. The space is small but so warm and inviting. The hostess was able to seat us quickly and our server was so on top of it as well. We shared the Belgian waffle with berries and cream to start and it was absolutely divine. We each had the bacon, egg, cheddar and tomato croissant sandwich and it was honestly one of the best breakfast sandwiches I have ever had. The eggs were cooked perfectly, the bacon was thick and juicy and the croissant was flakey and toasted to perfection. I absolutely cannot wait to come back to this little gem!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Tzrwnvn7is7esAIK1kRlCQ/348s.jpg", "caption": "Waffle with berries and fresh cream"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/j2WqLflBvh2vb0eQqs-84g/168s.jpg", "caption": "Soy latte"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/FP5HKValg06qio-hDwPLBw/168s.jpg", "caption": "Bacon, egg, cheddar, tomato croissant sandwich"}]}}, {"review": {"des": "What a lovely spot in the middle of Chicago! We had gone to the air and water show over the weekend but were peckish for something. We found this spot, it has been on my to try list for a while and it did not disappoint. We sat outside to enjoy the sun and the passing planes. <br><br>We ordered the cheese plate, the pretzel and the hummus which was perfect. The hand made sodas are a must try - I had the blackberry cucubmer and want to stop in just to get it to go when I'm in the area. So good! I did not get a chance to try dessert so I will be in shortly to do so.", "pics": null}}, {"review": {"des": "This gem is connected to the peninsula hotel. <br>-indoor and outdoor seating<br>-amazing choice of French pastries <br>-coffee <br>-attentive staff and amazing service <br><br>This is one of my favorite places to grab coffee and a pastry while walking around the city .", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/41NBk75I_dn_kRh4YOVEqQ/348s.jpg", "caption": "Desserts and more desserts !!"}]}}, {"review": {"des": "This place has some really delicious dishes and then some not so good dishes that didn't agree with our stomachs. The yogurt parfait is delicious! I would definitely go there again for that parfait. But their mix and egg scramble really wasn't good. My husband loves lox but man he was not a fan of those. His stomach did not agree either. The bagels were just okay, as well. I'd come back if I was hankering for a parfait but otherwise I'd go somewhere else.", "pics": null}}, {"review": {"des": "I don't mind coming everyday for the( PG breakfast flatbread) very delicious. Loved the berry granola and make some room for desserts they have some good choices displayed inside, the cheesecake is my favorite. Yeah and their black coffee is great too", "pics": null}}, {"review": {"des": "Love everything about this place! My fiancé and I had visited a friend at NW hospital and although we made plans for after the visit, our plans didn't work out. Instead, my fiancé suggested we get tea and I remembered that Pierrot gourmet was really close to NW hospital- in fact less than three blocks away!! I was soooo happy because this is a place I had bookmarked to go visit so when the opportunity presented itself- I was soooo excited! Anyways, located on the corner of Rush and Superior, this very low key hidden gem is an absolute delight! I can't recall if there's street parking because we walked from NW hospital but I'm sure with Hotspot you can easily find parking anywhere!! <br><br>We were automatically greeted by the kindest waiter and seated. Since it was rather late, I got a cappuccino and my fiancé got a tea. We also ordered their chocolate obsession (fortunate enough that we got the last one for the evening) and right away we learned why they call it a chocolate obsession. It is so incredibly chocolatey, creme and the perfect serving size. They don't serve small sizes of the dessert which I personally really appreciate it. So by no doubt, you're getting your money's worth! I would highly recommend checking out everything on the dessert menu because it all looks delicious! This is a perfect place to come to with your girlfriends for girl talk or your significant other to discuss important topics. Very chill and calming atmosphere.", "pics": null}}, {"review": {"des": "One of the most underrated restaurants and bakeries downtown!<br><br>I'm not a brunch fan but I love coming here for their breakfast or lunch flatbreads!  They also have a dessert case filled with all types of french desserts. <br><br>Likes:<br>- Great for a non-traditional brunches<br>- Amazing breakfast or lunch flatbreads and pulled rotisserie chicken salad<br>- Phenomenal standard as well as innovative french desserts with a twist: macarons, giant macarons, eclairs, mille feuille etc. I just had their jasmine mango giant macaron and loved it.  Mango is not in season so of course it wasn't very ripe but regardless it satisfied my sweet tooth.  We almost got the yuzu green tea cake but didn't have room.  Their raspberry rose giant macaron is to die for if you like rose flavored things like me!  Their raspberry rose eclair is not a standard dessert but definitely get it if you see it!<br><br>Dislikes:<br>- They are a little pricey (next to/part of the Peninsula hotel) but still worth it! <br>- Don't take reservations and the space is small so the wait can be long especially during brunch time<br>- Service is a hit or miss. I had my card in hand and waved it around for awhile and still couldn't get the waiter's attention. He neglected our table even though it wasn't busy.<br><br>TIP: At the end of the night, they have a bogo special for their goodies on top of the display case.  We didn't get any but I believe there are cookies, croissants, etc.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/3iiYgkdJPkjMfh6d8BjU6w/348s.jpg", "caption": "giant raspberry rose macaron"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/gFNUd_wrnj75Vwtv6P4CXg/168s.jpg", "caption": "Huge macaron with fresh mango and jasmine cream"}]}}, {"review": {"des": "We stopped in for lunch and were blown away. This was one of the better meals I've ever eaten. We shared a bowl of French onion soup and the shrimp and grits. I didn't want it to end. The soup was so rich and slightly sweet which paired so well with the sharpness of the cheese on top. The shrimp and grits was phenomenal. Such great flavor and the textures of the grits and cabbage and shrimp all blended together perfectly. And then every other bite or so you'd get some andouille and the smoky/spicy sausage just sets it off another notch. <br><br>This was such an unexpectedly wonderful experience.", "pics": null}}, {"review": {"des": "Great cup of coffee and amazing selection of delicious desserts plus extended hours on weekends. I am sold. <br>We stopped here after a huge steak dinner just few blocks away, sat down near a window at a cozy table for two. Stuffed from dinner we were not able to enjoy the beautiful deserts they had on display, we will be back to try one of those. We ordered two cups of Americano coffee which was very good and the service was excellent.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/-995muySwquNFXKnEiHBBg/348s.jpg", "caption": "Coffee Americano"}]}}, {"review": {"des": "Best place in Chicago! <br>Love their lunch and peninsula breakfast. If you only stop once, make sure to get their coffee!", "pics": null}}, {"review": {"des": "Stopped in for brunch on a Saturday morning, staff was very attentive as I got there earlier than my friend (lots of snow outside! You know how Chicago gets with delays!) They asked me if I wanted any drinks and was very attentive when I ordered a hot chocolate with non-dairy milk -- asking me if it was an allergy which I was pleasantly surprised with. <br><br>I was eating at a 12 pm-ish time and they gave the option of getting breakfast or lunch which was nice to have all the options. I got the popover with chicken and sweet potato hash - the dish was a bit heavy and hearty which was surprising to me. I liked it for the most part the hash was a bit lighter than usual with the sweet potato twist and felt a little more healthy (which is a note for the place over all - I feel like it has a lot of healthier options with their salads being very hearty and varied without being too boring) The popover itself was a bit hard though which was disappointing -- I wish it were fluffier like some other popovers I've had! (This was my only complaint, and it's rather minor so I still give it five stars) <br><br>The best part arguably of Pierrot Gourmet though is the desserts! I got the Green Tea Yuzu cake which wasn't too sweet and very flavorful and still refreshing with the yuzu taste! And the matcha seemed fairly good quality as well. Everything looks gorgeous from the desserts and would definitely come here JUST to eat dessert. Will definitely try the Creme Brulee next time and the Tarte Citron Yuzu!", "pics": null}}, {"review": {"des": "Wow...again-what an amazing display of holiday pastries...it was challenging just to choose which one that I wanted.<br><br>I decided upon the vanilla Buche de Noel or in English the \"Yule Log\" which is a French Tradition in my household from my childhood!  I was delighted with the moist interior of the cake with the pudding-like consistancy rolled up in the cake layers.  All of the cute decorations on the top were made of chocolate which was fun...there were gingerbread men and gingerbread houses, white candy canes, and bows of holly.<br><br>My only complaint is that they were understaffed on Christmas Eve and it took a VERY LONG TIME for service and the people in line behind me were openly complaining.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/w0TLm5iG6rCCySsjaf1RqA/348s.jpg", "caption": "Buche de Noel or \"Yule Log\" Cake with edible chocolates decoration on top."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ox4LcVZmSCXV7hn97QwfZQ/168s.jpg", "caption": "Buche de Noel or \"Yule Log\" Cake with edible chocolates decoration on top."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/oZsuMutDSTmfVyQGAEvduA/168s.jpg", "caption": "Christmas Pastries in the Case"}]}}, {"review": {"des": "I love this spot! I came here the other day for happy hour and was able to sit outside. The service is always great and the drinks are amazing. I had the strawberry soda drink with a splash of Vodka. I also tried the deviled eggs and hummus platter. I can't wait to come back!", "pics": null}}, {"review": {"des": "The cashier and waiter are racist l. My friend and I had the worst experience at this location. We r long term customers who always ordered dessert delivery from Pierrot gourmet. <br><br>However this time we were passing by and decided to get 1 Eclair to go after shopping at Barneys. First of all no one came to the register when we were about to buy it. We tried to get their attention but it took 7-10 min. There were only 4-5 customers at the tables. We also didn't want to spend so much time sitting down and waiting for a waitress to come around, share 1 Eclair and spend more time waiting for the cheque. <br><br>It was freezing outside and we just wanted to share that eclair at the waiting area /lobby outside the restaurant. <br><br>The security came and told us we were not allowed to eat there. We paid and tipped at Pierrot gourmet there's no reason to chase us out. We explained we just bought it inside. Imagine it only takes less than 2 min for 2 adults to finish 1 Eclair. <br><br>The guy said we weren't allowed to eat there and that he's going to make hotel security to pay a visit. <br><br>We didn't want to make a scene and started standing up. We are paying customers and there's no reason for them to give us this kind of treatment. We didn't make a scene and it's more than reasonable to want to simply finish 1 Eclair not seated at a dinner table. <br><br>We are never coming back again and never recommending this location to anyone else.", "pics": null}}, {"review": {"des": "Came here for two things: the macaroons and the coffee. I arrived just before closing and much to my happiness there were still macaroons in the case. In addition to macaroons there were a variety of eclairs and a few loaves of sweet breads. I ordered a macchiato.  The macchiato was amazing. The chocolate macaroon need more chocolate ( I am a chocoholic so it actually might be okay, but I always want more.) I also tried the passion fruit and chocolate (again more chocolate but still delicious). The pineapple coconut was \"okay\" according to my husband. Translation: it tastes good. The pistachio and salted caramel were the highlights. I'll be back for the macchiato and to try and eclair or two. Pricey? YES! So when you need to treat yo' self, come on over.", "pics": null}}, {"review": {"des": "I've been here a couple times for dinner and dessert (or both at the same time) and haven't left disappointed once! It's a very cozy restaurant fully equipped with its own bakery and serves French comfort food.<br><br>The soup is delicious here! I've tried their shrimp & corn chowder and their French onion soup, and they are both amazing starters to your meal. I usually don't order soups at restaurants because it adds to my bill but I make an exception for Pierro Gourmet. They come in either cup or bowl size and you get a few complementary slices of bread to go with it.<br><br>Dessert here is also an awesome experience on its own--they have a wide selection in a variety of different taste palettes. From gigantic macarons (Jasmine Yuzu macaron is my current fave) and tarts to mini seasonal pies and cheesecakes, there's so many different sweets to try. Their desserts are usually on the lighter side so never too sweet. They also have a decently sized coffee menu as well. <br><br>They sell their baked pastries at the end of the day for half price so you can get gigantic croissants/cinnamon rolls for $2.00! Super worth and super delicious.<br><br>This one of a few places in Chicago that I would come anytime and anyday for.", "pics": null}}, {"review": {"des": "If you want to feel like a Parisienne without leaving town, pop in here for a cappuccino and an eclair. My sister and I were being adults and checking off serious adult tasks in the area and decided to treat ourselves. Despite the fact that we were both beyond casually dressed, the hostess warmly greeted us and we were quickly ushered to a lovely table outside. We split some fancy scrambled eggs with a side salad and settled in with the perfectly executed cappuccinos. Having caught a glimpse of the pastry case when we entered, we capped off the visit with a pistachio and raspberry eclair. So good! A lovely way to relax, do a little people watching, and enjoy some really tasty treats.", "pics": null}}, {"review": {"des": "Always get the green tea yuzu or rose macaron when I walk around the area. The honey latte tastes good too, just not sure if worth $6 a cup.", "pics": null}}, {"review": {"des": "I was in Chicago last weekend and had a wonderful dinner with my friends in Chicago here at Pierrot Gourmet. I was impressed by the family-style seating and warm ambiance when I walked in. Great live music, but slightly too loud for conversation.<br><br>It seems this restaurant is highly rated for breakfast and brunch, but I find the dinner menu here is superb. We had an extended menu from both the regular menu and the October special menu. Four of us ordered very different entrees: rotisserie chicken, chicken pot pie, steak, and rainbow trout. All of us were satisfied with our entree choices, which demonstrated the consistency of the kitchen to handle different dishes with high quality.<br><br>For me, I had a lentil soup with German sausage as my appetizer and the oven baked rainbow trout (from the October menu)for the entree. The lentil soup was smooth, flavorful, and slightly too salty, with half of a sausage as protein add-on. Tender and fresh, my trout was perfected seasoned and baked. The sauce came with the trout was too salty for me, so I just used a little bit on my fish. The roasted root vegetables provided the earthiness to balance the dish. Overall, I enjoyed my dinner here.<br><br>This restaurant is reasonably priced and surprisingly without long wait time. Great place! Until next time!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/UvnJYN3ABMJ8pbGIy109Tw/168s.jpg", "caption": "Oven baked rainbow trout"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/H3dUdz1bGsTZdF7PlJxCXg/168s.jpg", "caption": "Lentil soup with German sausage"}]}}, {"review": {"des": "Came in for a quick dessert after dinner. I've always wanted to try to giant macaroons and this was nearby. We had the raspberry and mango macaroon. For some reason, there was a fake chemically aftertaste to it. I'm not sure if I'll ever come back to have macaroons but they were very cute and \"instagramable\".", "pics": null}}, {"review": {"des": "Pasta bolognese was outstanding. Their Hot Chocolate is among the best I've ever had. Similar to Le Meson du Chocolat in New York City.", "pics": null}}, {"review": {"des": "This is my first yelp review, I'm so mad!<br>I bought the Halloween special jasmine yuzu macaron for my little one's monthly birthday, it has a cute pumpkin on it and that is what I liked about it. The guy was packing one of them for me but I asked him if I can get the other one next to it instead, because I like this pumpkin's face better( they have different faces), he looked unhappy but he did so, but I couldn't see what he did while he was packing because he packed it on the back bench and I didn't pay attention. I didn't open it and carried it carefully until I opened it when I got home. The little pumpkin is missing! Not in the box! <br>I think it was totally reasonable for me to ask for a switch, even if you were not happy about it just tell me! Don't do this! <br>I was very excited and happy that I got such a cute treat for my little one, now I'm so angry and disappointed! I even asked the birthday cake menu and planning to order a birthday here next time.", "pics": null}}, {"review": {"des": "Perfect place to eat, enjoy coffee and have dessert. Good location, nice atmosphere, lovely coffee/ dessert and nice staff. Merrilie, Ali and Justin very lovely people working here. Highly recommend to visit this place.", "pics": null}}, {"review": {"des": "I'm only rating based off of the desserts. I stopped in to get some specialty desserts while I was in town (although I wish I had eaten here because their food looked awesome). I was taken care of quickly and the dessert options looked great. I ended up ordering the raspberry tart, chocolate eclair, and the cheesecake. They were all good, but the raspberry tart was on point. It was so good! I would definitely go back just to have another one of those. And, it  as beautiful to look at.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/hIGT-KPmZYt1hW9g7CxC5Q/348s.jpg", "caption": "Raspberry tart - amazing"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/kP1yrwgc-IpKkb-OP1cVsg/168s.jpg", "caption": "Dessert counter"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/OIaLiUmrB2NMK-0go8rjoA/168s.jpg", "caption": "Chocolate eclair, raspberry tart, and cheesecake"}]}}, {"review": {"des": "One of my favorite places in the city! I thought it was very upscale (based on the menu), but people dress casually and it really feels like a nice cafe in France. I think they also have an outside patio during warmer seasons.<br><br>I came here with my fiance for brunch and dessert. For this area of the city, the amount of food that you get is pretty great for the price. I actually could not finish my meal (which is very rare for me XD). My fiance ordered the chicken pot pie and I got the duck cassoulet. Both were delicious. The pot pie was full of a variety of mushrooms, and came in a tiny cast iron (so cute)! The duck cassoulet was also delicious, however, as I mentioned previously, I could not finish the dish - partly because it was a lot of food, but also partly because the dish was 60% white beans LOL. If I had one suggestion, it would be to supplement this dish with a side salad or something refreshing because eating lots of beans is very filling.<br><br>For dessert, we each got macarons. I got the large mango jasmine one and my fiance got vanilla, lychee, and passionfruit. All of them were delicious and the perfect ending to a fun brunch.", "pics": null}}, {"review": {"des": "It was a quick lunch . great place and service was good . i recommend all to try it out . the quiche i ordered was perfect and the portion large , comes with salad . I will be going back again .", "pics": null}}, {"review": {"des": "I have been coming here for 8 years. I have a dietary restriction of NO DAIRY for my infant whom I breastfeed. I asked twice if what I ordered was dairy free, they even asked the chef. I ate half & decided to talk to another employee & they confirmed it wasn't. This is a HUGE issue. I will most likely not be returning. If you have a dietary restriction, you know this is a nightmare. I am not sure how this happened.", "pics": null}}, {"review": {"des": "Excellent service and very delicious food. Me and my friend enjoyed the patio. Red sangria was the best I've ever tried. We definitely will come back and recommend our family and friends.", "pics": null}}, {"review": {"des": "Pierrot Gourmet is a casual(ish) spot for a bite inside the Peninsula Hotel. (By that I mean it is as casual as you'd expect for a restaurant inside the Peninsula on the Magnificient Mile, where it seems like half the customers just stepped out from a catalog photo shoot.) By the way, \"Inside the Peninsula\" is a relative term, since I think you need to exit the hotel and walk a few steps to the right to reach the restaurant.<br><br>Pierrot Gourmet is small and cozy.  Seating is quite limited (in part due to the oddly large tables they have in the small place) so you might plan on waiting if you come for breakfast. Also, because of those large tables, you might need to share a table with others. If you arrive for breakfast, you may enjoy the latest issues of major national newspapers offered on every table. (So, why is it considered acceptable to read a newspaper at the dining table but many consider it gauche to stare at your phone? Just asking.) <br><br>The restaurant offers one breakfast menu and one \"all-day\" menu. We visited for breakfast, which was very good. In particular, the PG Breakfast Flatbread was delicious and enough for two people to share. The Scottish Smoked Salmon was also excellent. <br><br>The place is a bit expensive and a little pretentious, but that is exactly what one expects when dining at a small French country cafe in the Peninsula Hotel.", "pics": null}}, {"review": {"des": "Decided to come here for dessert having brunch a few blocks away. We almost opted to sit inside because it was chilly. Little did we know, they had heater above the seating area outside! BIG PLUS!<br><br>AMBIANCE: Very cute, classy, and cozy! Most, if not all, of their desserts are displayed right when you walk into the cafe, which triggers your sweet tooth on the spot! This place is a good spot for breakfast, lunch, brunch, and dinner! It's not too nosy, so you could do some work here too!<br><br>SERVICE: We came around 4:30 on a Saturday, so there was a short wait for an outside table.  The service was very friendly, and out waitress didn't mind us asking about the items on the menu! Wonderful service!<br><br>FOOD: We were wondering if we should go with the Jasmine Mango or the Raspberry Rose Macaron. We ultimately picked the latter because it looked prettier. It was a bit on the sweeter side, but nonetheless still very tasty! Good thing we paired it with something less sweet, the blueberry cheesecake! Rich, creamy, and just the right amount of tanginess to a cheesecake. Both were as decadent as any dessert out there and definitely did not disappoint! Next time we will definitely try the mango! We also go two lattes with some cute prints on them: a Crème Brûlée and a Salted Caramel. Both were quite delicious! The Crème Brûlée latte was basically a crème brûlée in liquid form! So good! <br><br>Definitley will come back and try more off their menu!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Jcuo6_GcT9WfS0WfOL_img/348s.jpg", "caption": "Raspberry Rose Macaron -taken from Instagram: @lindahhlam14"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ERsyKNGLMLhtfYxnV9tqhg/168s.jpg", "caption": "Blueberry Cheesecake - taken from Instagram: @lindahhlam14"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/FEQqd5JOExbn4HC2cvA_QQ/168s.jpg", "caption": "LATTE TIME"}]}}, {"review": {"des": "Elegant and cute French cafe next door to The Peninsula Hotel in downtown Chicago. They offer meals and also a smaller coffee/desserts menu. We tried the Yuzu Green Tea cake and I had the Strawberry Matcha Latte. Both were excellent. The wait staff was extremely courteous and the decor was perfect. Would love to come back again and try more items on their menu! Hopefully even snag a seat on the patio which was completely full on the fine autumn day that I stopped by.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/HwEmUeF6w5BT07Resb3qVg/168s.jpg", "caption": "Yuzu Cake"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/jOXKWmCE6psMJrtC93IrMQ/168s.jpg", "caption": "Strawberry Matcha Green Tea with Soy"}]}}, {"review": {"des": "For dine in, please be seated.  To go, slow paced queue by the door. Be mindful of time and day for better experience.<br><br>Impressive, imaginative DESSERTS with determination to execute and delight the senses.  Themed Desserts are amusing, not 1 but multiples.  Reasonable affordable prices that is a better value due to layered dessert prep and ingredients.  POT OF GOLD was a delight that is 100% edible, serves 2... a bigger and better version of Ferrero Rocher.<br><br>Small FRENCH ONION soup was perfect.  Slightly sweet. Balanced. Nice chopped onions.  Just right sticky cheese.  COMPLEMENTARY BREAD BASKET was a nice accompaniment and highly addictive.<br><br>TOASTED ALMOND in MOCHA LATTE was sweet but balanced with house made mocha.<br><br>Gracious VANESSA is charming as ever that is expected of a 5-star establishment (it's the Peninsula you know). \"Would you like a paper?\"<br><br>The TABLE SETTER forgot that the placemats have some logos and they are inverted.  Sacré Blue. *wink*<br><br>1-star less as no one came up to me for dine in table seating.  I thought it was a counter Service.  Chilax.  Small venue easily gets filled with no rush for turnover.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/SMGCMViIHNiLgmTu1mbn8A/168s.jpg", "caption": "One of Seattle's first roasters. @$18 per bag, Peninsula uses the richest, smoothest Dark roast.  UPTOWN is a special blend."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/OxyEs8yDJG3e6gEVWFuxtw/168s.jpg", "caption": "St Patrick's Theme"}]}}, {"review": {"des": "Good soups, salads and sandwiches for lunch.  Great service and excellent location.  Delicious cakes, tiramisu and desserts.  Pricey but convenient for the area.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/2WmXC4llVoKNo16J8U97KA/168s.jpg", "caption": "Beet salad"}]}}, {"review": {"des": "We are going back tomorrow, the breakfast did not disappoint!!! We walked in and it smelled so good already, and the food was delicious!!!", "pics": null}}, {"review": {"des": "Came here for dessert and was impressed overall. The ambience was very cozy and cute. The service was also top notch.<br><br>I got the Strawberry Matcha Iced Latte (~$6.5) and Fresh Fruit Tart ($7). I loved the strawberry matcha latte- it was very unique and had a subtle strawberry flavor that went very well with greentea. I would want to come back here to try its almond latte too. The fresh fruit tart was also good, but it wasn't exceptional. I think other cafes would also sell fruit tarts as good as this one. However, Pierrot Gourmet had a wide range of desserts that I wanted to try eventually. Definitely will come back for more desserts & try its food!!<br><br>Pro:<br>- Good dessert  & wide range of dessert menus<br>- Strawberry matcha latte was better than expected<br>- Cute ambience<br><br>Con:<br>-Little pricey", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/i5e4NRGFxdCzuldqRrOhWA/168s.jpg", "caption": "Fruit tart"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/YAenVB-aFz9tJlU4HXuJzA/168s.jpg", "caption": "Strawberry matcha latte- YES"}]}}, {"review": {"des": "Stopped by here for a quick bite and had my dog with me. We sat on the patio, which was heated perfectly, as it was a little chilly that day after the rain. I had the Strawberry Matcha Latte (which was sooooo good!!) and the Quiche Lorraine. The quiche was so fluffy and delicious with bacon and onions. The atmosphere was relaxing and the staff were all very nice and attentive. I'll definitely be back next time I'm in the area, and especially if I have my pooch with me!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/s28IhcdNzS01aqCE8UIP4g/168s.jpg", "caption": "@themunchiemunch (Instagram and Twitter)"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/-3V75YhHmcR0Q9m20c8d4g/168s.jpg", "caption": "Strawberry Matcha Latte"}]}}, {"review": {"des": "PROS <br>-great service <br>-delicious food <br>-unique decor <br>-mini ketchup and Tabasco sauce :) <br>-fresh orange juice <br>-great ambiance <br>-outside seating <br>-no reservations needed", "pics": null}}, {"review": {"des": "Ooh La La I am in love when it comes to this lovely French cafe that is hotel located at The Peninsula. The back to back dates I have visited Pierrot Gourmet have been met with excellent service accompanied by delicious food. I have had two visits to this lovely bistro one on July 14th for Lunch and one on the July 16th.<br>On my Friday visit they were celebrating Bastille Day or in French la Fête nationale which includes a special menu for lunch and dinner. I started my lunch with a cup of their French Onion Soup and a St. Germain Fizz. The St. Germain Fizz was refreshing but with a hint sweetness. The French Onion soup let me tell you is the best one I have had to date. French Onion soup is my favorite type of soup to a point that if it is on a menu - I am ordering it. Pierrot Gourmet's French Onion soup is one of the books and the top of my list. It is balanced and it is like a warm hug.<br>For my main entrée I decided with the rotisserie chicken and hands down it is the best chicken I have had. The rotisserie chicken is accompanied by rotisserie potatoes, arugula, parmesan, chicken jus.<br><br>Then yesterday I tried their Banana Foster Waffle which accompanied by buttermilk waffle, whipped cream, caramelized banana syrup.  This is the ideal breakfast when you're hungry in the morning - these waffles are the image in your head you are thinking of that leaves you mouthwatering over the thought of them.<br><br>The coolest part is the coffee - I got a large latte while my friend got a cappuccino and it took awhile for them to come out. But when they set the coffee cups down it was easy to see why...they did the coolest latte art I have ever received. Mine said Coffee Queen and was accompanied by a crown fit for royalty. While my friends had a I heart Coffee on her cup with a drawing of a coffee cup. We felt guilty drinking our coffees because they were so beautiful.<br><br>We ordered dessert as well to top it all off - my friend ordered the cinnamon bun while I opted for Raspberry Rose Macaron.<br><br>The Raspberry Rose Macaron is accompanied with vanilla rose cream, raspberry gelee, fresh raspberries. The burst of sweetness in this treat is refreshing as the you get the taste of vanilla rose cream combined with the fresh raspberries. I also love that the top of the macaron has tiny flakes of gold on top.<br><br>The host at Pierrot Gourmet is always friendly and has a smile on his face.The service here is really good despite it being busy both times I came in. The nice thing about this location is that you have the choice of indoor or outdoor seating. The indoor seating is alright it is cozy when you are seated inside. The outdoor seating on the patio is my absolute favorite because I love to people watch and it allows you to enjoy the outdoor summer weather. <br><br>Pierrot Gourmet has exceeded my expectations and I cannot wait to come back again soon!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/0OZD-mDZq9bL5U3D5Kv62g/168s.jpg", "caption": "Sunday Breakfast with a good friend, good conversation and good food to accompany it all."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ysyyoUQ-KVAuFe66sQLWSA/168s.jpg", "caption": "Their Special menu to celebrate Bastille Day"}]}}, {"review": {"des": "Grabbed dinner with co-workers while at a conference. Everyone loved it. Great place, casual, leans toward French preparations. I had the rotisserie half chicken with rotisserie fingerling potatoes, arugula, and Parmesan with chicken jus (which was actually a beautiful chicken gravy).  At $19 it was a steal! Others ordered ahi tuna Nicoise, shrimp and grits, and truffle chicken pot pie. Their macrons and eclairs are also fabulous. My eclair was lemon/pistachio/raspberry. Service was excellent. This place is now on my go-to list when in Chicago.", "pics": null}}, {"review": {"des": "Loved this cafe/coffee shop. Ordered green tea/Macha cake with green tea... it was fabulous place to take a small rest in the afternoon during shopping/City walking", "pics": null}}, {"review": {"des": "I really enjoyed this spot! I came here for breakfast and got the vegan hash with coffee. It was very tasty and filling. It is a quaint little place on Rush. If you are in the area I would check it out!", "pics": null}}, {"review": {"des": "My hotel concierge from the Peninsula Hotel recommended the Pierro Gourmet, (attached to the hotel on Rush Street) for breakfast after I inquired about finding a place to eat outside of the hotel. It's officially attached to the hotel but not inside the actual premises. <br><br>First impressions; quaint, warm and so very inviting. You walk in and immediately smell the aroma of coffee and pastries. I asked for a table outside in the patio that runs parallel to Rush street; there are approximately 8-10 tables available on the patio. They have done a great job of the patio with the decor, kind of forget that you are on a Main Street if it were not for the traffic & pedestrians. <br><br>I ordered scrambled egg whites with veges and a granola bowl; both of these dishes were outstanding. The coffee I will mention was also superb, one of the best cups of coffee I have had in a long time. <br><br>My server Dorota was exceptional , very sweet and attentive. I returned the next day for coffee and a muffin and was served by Vanessa who was also equally amazing. <br><br>Defiantly a 'go to' but be prepared to pull out your wallet as it's not cheap, but what isn't in Chicago?? Loved it.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/W3DdzBrt65IplRZgfoJzVA/348s.jpg", "caption": "Superb coffee"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Vmw0svRNkf0jGM7ulL3MYQ/168s.jpg", "caption": "A view from table looking across Rush Street."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/x9kuPRVukycET_W_JC0Pxg/168s.jpg", "caption": "Excellent coffee."}]}}, {"review": {"des": "My friend and I met a super nice local woman who recommended this cafe to us for breakfast on a recent trip to Chicago.  It was so nice- and I will start by saying I had a superb cafe latte.  Nice and thick and rich and strong....  YUM. <br>We arrived at around 9 am and there was plenty of room for us, we chose to sit inside, where we had a nice view outside as well.  The tables were nice, with really pretty napkins and cups- it was so French looking.  Very pleasing way to spend our breakfast.<br>I had a breakfast flatbread that had scrambled eggs, tomatoes, gruyere and chives- it has bacon but I am a vegetarian and opted out of that.  My friend had the same thing but said the bacon was delicious!<br>If we would have been by later we would have tried out some of their fancy bakery items and/or some wine, but alas we did not.  Another trip!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/tBPpUSR_qPHeluHNGPUKmA/348s.jpg", "caption": "Breakfast flatbread with eggs, gruyere, tomato and chives."}]}}, {"review": {"des": "This place is just amazing.  A great French bakery /restaurant attached to the peninsula hotel. Not too busy. The portions just right and the food prepared to perfection.  The service is also great.", "pics": null}}, {"review": {"des": "Excellent place! Food is delicious, fresh and organic! I have been there a several time and today I decided to make my decision and give my feedback!  That place takes 5 stars of 5, and I could give 6 stars for service, atmosphere and concept", "pics": null}}, {"review": {"des": "Was in the mood for a late-night dessert and stumbled upon Pierrot Gourmet. Definitely upscale atmosphere, candles on every table, dim mood lighting and very fancy desserts!<br><br>They have an entire section of the menu devoted to hot chocolates and I went with their signature drink. Probably not really worth the $7/mug, but we were in the mood for something we couldn't get back home, so it was alright. The cocoa did pair well with my chocolate banana cream dessert. My friend really enjoyed their freshly caramelized creme brulee! <br><br>If you're feeling like a bit of a splurge, this is the perfect place for a night out!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/5BEMuSfmWLseWy_ivaZL9w/348s.jpg", "caption": "Delicious Desserts!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/B_Ei01V9ibq4YLDuMIzkCg/168s.jpg", "caption": "Signature hot cocoa"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/w9zOnq3QQ9dsL6KjDX7fXQ/168s.jpg", "caption": "Freshly caramelized creme brulee!"}]}}, {"review": {"des": "So far, I've only tried the coffee here, although the pastries look exquisite.  One day soon, I'm sure I'll be treating myself to one (or more) of them.  I tried their salted caramel mocha latte yesterday, and it was absolutely heavenly.  Perhaps the smoothest espresso I've had in a long time.  Not to mention, the first few sips, you get a few salt granules, which enhance the flavor even more.  The temperature of the latte was also absolutely perfect - it was ready to drink on the first sip, and you didn't have to wait for it to cool down before tasting it.  The only downside is the price.  My one latte was around $7, which is a bit outrageous if you are only thinking of it from a monetary standpoint, but from a quality standpoint, I say, treat yourself.", "pics": null}}, {"review": {"des": "This French restaurant is excellent for brunch. We had a large table and tried several items. The French Onion soup has an extremely flavorful broth! Everyone really enjoyed their freshly prepared dishes. The downside is that they don't take reservations even for large parties, so waiting for a table is often quite long. When we were seated, they didn't have enough servers and warned us. I think with their fine cooking if they'd improve overall operations, they could be a 5-star place.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/dhruYMg8uDN_tBcUyInGaQ/348s.jpg", "caption": "Front entrance floral"}]}}, {"review": {"des": "This is my to go to place for breakfast.<br>Best service and the food is fantastic.<br>We were just in last week for the air show and we ate here 3 out of the 5 days.<br>The coffee and tea is always hot and fresh.<br>I had the Puff pastry with roasted chicken and sweet potatoes each time.<br>I spilt it one day with my wife and the chef cut it in half and the waitress accommodated us with another plate.<br>My wife had a bran muffin, bowl of fruit (enough for 2) and 2 perfectly cook poached eggs one morning.<br>Another morning  she had an omelette and small salad. Very tasty.<br><br>They also have one of the best pecan roll in town. <br><br>We don't stay at the Peninsula but we do enjoy their restuarant.<br><br>This was not our first time here. We have been coming for years. There. Dinner is good to and the prices for either breakfast, lunch or dinner are not bad for the quality of food, portions and service.", "pics": null}}, {"review": {"des": "This is my first time writing a Yelp review so shortly after having a meal.. I was just so pleased I had to get it out of my system.<br><br>I ordered the Truffled Chicken Pot Pie, Rotisserie Potato, and Sauteed Spinach for lunch and got it delivered. For how fresh it all was, I was shocked at the short time it took to get it delivered! Def. praiseworthy!<br><br>On another note, what a handsome and sweet delivery man that was! Hope he comes every time! haha :) <br><br>Thank you for a great lunch Pierrot Gourmet!", "pics": null}}, {"review": {"des": "They had decent selection of dessert and pastries. Maybe it was because I came in during a really cold weekend, but I wasn't too impressed with what they had on display. <br><br>The macarons were ordinary flavors, nothing that stood out, and the cakes looked and tasted pretty normal. Got a cappuccino and it was way too foamy for a cappuccino. I love foams and all, but not when 2/3 of the cup is foam!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/cyJxT_yjh3k2_tZ5aPg_kA/348s.jpg", "caption": "Selection of pastries and macarons"}]}}, {"review": {"des": "This place is a gem! The food was tasty and the service was excellent. The waitress even offered a refill of my coffee to go. Picked up some macarons from their huge dessert display to enjoy later.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/J4Dl7xNhtIwfEVqlwytCRg/348s.jpg", "caption": "Tuna Melt Tartine"}]}}, {"review": {"des": "We tried this place on our first day visiting Chicago! I must say it was heavenly!! The pastries alone were amazing but add the great service and cute location and you got yourself a place that you want to go back to over and over. I am super foodie and normally dont like to eat at the same place twice when vacationing \"BUT\" this was exception to the rule ;) we went back the night before we left Chicago... the server was sooo nice. Had a nice chat with us and when he brought the bill he had a to go package to surprise us! So sweet. This place is great", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/VhAI3vxfQPqfJ3KkJd1mkQ/348s.jpg", "caption": "Def bomb.com"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/VH4MpDuph0Xa5Urdh5TOIA/168s.jpg", "caption": "Yummmmm"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/N7izZPqJOTF37NpW9Wi6VA/168s.jpg", "caption": "Amazing!"}]}}, {"review": {"des": "I was skeptical about their strawberry basil macaroon - after all, how can you pack that much flavor into one small pastry? However, the good bakers of Pierrot Gourment did not disappoint and I was excited at the taste of strawberry with the prevalent hint of basil. The one star deduction would probably be for the high price, but that is anticipated given the french patisserie cuisine.", "pics": null}}, {"review": {"des": "Awesome desserts.  Finally tried the raspberry ruby big macaroon and it was delicious!  However, the chocolate cake edged out for me.  The chocolate is super thin, dark and literally melts in your mouth.  The only reason it's not 5 stars is the price...a bit on the expensive side but worth having.  Definite splurge every so often.", "pics": null}}, {"review": {"des": "This cafe is next door to the Peninsula Hotel. Super cute and cozy ambiance, and great service as well! I got a chai latte and biscuits with sausage gravy. The biscuits and gravy came with bacon, eggs, and a side salad. The bf got an egg white skillet, it had sun dried tomatoes, spinach, and feta cheese. Also came with a side of toast, he LOVED the toast Bc it was just really good bread. He also loved the skillet, fantastic flavors! My biscuits with gravy were also delicious. Chai latte was really good too. Service was just lovely and I grabbed a Christmas cookie and strawberry meringues to go. If you're staying at the Peninsula, I highly recommend stopping by this cafe. We're definitely coming back next time!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Q-8M5pUezhf7dVrjanPgqw/168s.jpg", "caption": "Biscuit & Sausage Gravy, comes with 2 eggs, bacon, and petit salad"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/i04k-etrQTd-0uO90lROkw/168s.jpg", "caption": "Chai tea Latte"}]}}, {"review": {"des": "Best choc cake ever :) Service is warm and super friendly. Good place to have some coffee and to catch with friends. One of the very few places in Chicago I keep going back :) Totally bowled over !", "pics": null}}, {"review": {"des": "For a first time visitor, Pierrot Gourmet was the perfect experience. We started our meal with the housemade ricotta starter - a must! The honeycomb and fresh fruit was to die for. Our table of 4 ordered the shrimp salad, the truffled chicken pot pie, the french salad, and the soup and sandwich. The meal was both filling and delicious. Be wary of portion size, as it is more than plenty to eat. The atmosphere of the restaurant took us out of the rainy Chicago street and into the dining room of Paris. We shall return soon. Oui oui.", "pics": null}}, {"review": {"des": "PROS: Amazing, delicate macaroons!<br>CONS: Pricey (Like $2.75 a pop for the macaroons.)<br><br>At Pierrot Gourmet is where you'll find the best macaroons! The crispness of the outer shell, to the lightness of the meringue interior, everything about the macaroon was perfect. We tried most of the flavors, and my personal favorites are the coffee and the hazelnut macaroons.<br><br>They also carry various aesthetically-pleasing pastries and desserts, but the macaroons are by far the winner. No photos of the macaroons, since we wolfed them down too quickly...", "pics": null}}, {"review": {"des": "This review is just for the desserts from the dessert case and the drinks. <br><br>I tried the chocolate coconut macaron-probably the best macaron I have ever had! Perfect harder outside and soft, moist inside, and delicious! The passion fruit eclair was so yummy-I don't usually buy eclairs because they are so big, but this one was smaller and skinny so I had to try it. It tasted like tropical heaven! Finally I bought the pistachio white hot chocolate made with almond milk. It had had whipped cream and real pistachios on top! I'd never had anything like it before-super unique! I stole a bite of my sister's chocolate cake, and it was yummy too-not too rich and the perfect amount of sweeetness. <br><br>The service was great, and the barista asked me what kind of milk I wanted and whether I wanted to add whipped cream or not. It was a little pricey though ($6 for the small hot chocolate).", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/-oTYtGLZbqMJJPSZrrYDsg/348s.jpg", "caption": "passion fruit eclair"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/XUOrTtuB0hnE01W9yqhEPA/168s.jpg", "caption": "coconut chocolate macaron"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/tz3CuHIG8VsCbbFrZ5ghsQ/168s.jpg", "caption": "chocolate cake"}]}}, {"review": {"des": "I stopped in here for a quick snack Sunday afternoon of the Marathon.  We saw outside on the patio.  Inside and outside this is a gorgeous space. The outdoor seating had heaters which made it a great temperature. All of the pastries looked fantastic, I wish I had ordered one. <br><br>I had a pop and an appetizer.  They were expensive, but I think everything in the area is.  The Hummus was just fine nothing special. I tried the homemade Ricotta and it was quite good.  The Cherry lime soda was great, I would definitely get this again.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/nWn4Ri3K8Zea3iGUP3ExIQ/168s.jpg", "caption": "Hummus plate. Fine, nice size."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/LSkk_8640NoFn2SbcRTPRg/168s.jpg", "caption": "Cherry lime soda. Delicious!"}]}}, {"review": {"des": "Outstanding food and impeccable service in an elegant, relaxed atmosphere. The cocktails are delicious - I had the St. Germain Fizz on my most recent visit. Their French onion soup is perfection and the warm ham and gruyere sandwich is sublime. The salad that comes with the sandwich has a light dressing and perfect cornichons. Their flatbreads, the Alsatian in particular, are also standouts. Their brunch is superb. Desserts are not to be missed - especially their fresh fruit tart. One of the consistently best casual dining experiences in Chicago.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/01us6utsGZxFPRym3U3sLg/348s.jpg", "caption": "Wonderful personal touch to my dessert in honor of my birthday!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/-3uj5l5bs5F6SGsGW3xuQw/168s.jpg", "caption": "St. Germain Fizz"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/RRd-hq49J86xqNRAssCBNA/168s.jpg", "caption": "Exquisitely perfect ham and gruyere"}]}}, {"review": {"des": "I came here for brunch with my parents when they came to visit from out of town. It was fabulous, and all of us enjoyed our entrees thoroughly. A tip: they don't accept reservations and the restaurant space is small (especially when the outdoor seating is closed), so be prepared to wait.<br>To start, we ordered several baked goods: the pecan roll, the cinnamon roll, the pain au chocolat, and almond croissant. Everything was fantastic, but I especially liked the pain au chocolate--it was super flaky and the chocolate was smooth and rich. What a fantastic start!<br>I also ordered a vanilla latte, which was yummy. Just the right amount of foam, perfect temperature, and great flavor.<br>I had the alsatian scrambled eggs as my entree: eggs mixed with asparagus, potato, ham, onion, and brie cheese. You could tell the eggs were slow-cooked, because they had that velvety, custard-like texture. All of the mix-ins tasted great together. The scrambled eggs also came with a petit salad, which was mixed greens with carrots, cherry tomatoes, and a very light vinaigrette. Delightful!<br>My parents ordered the breakfast flatbread and the chicken and sweet potato popover, and I tried a little of both their entrees. The flatbread was topped with bacon, sundried tomatoes, and cheese. While the flatbread was very crispy and the toppings were tasty, it was somewhat too greasy. The chicken and sweet potato hash was wonderful and so was the poached egg on top, but the popover itself was too chewy and I didn't like the mustard sauce.<br>The biggest downside was the service. Our initial waitress was very friendly and hospitable, but halfway through our meal, she informed us she would be taking her break and a different waitress would take care of us for the remainder of our stay. Unfortunately, this new waitress was nowhere to be found. 20 minutes later, when we finally flagged her down to ask for the check and a box for leftovers, she acted like she had been there the whole time-- no apology, nothing.<br>Still, we left happy with our experience and hope to return soon!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ytDbmeYzQxIKR4ot6nloUw/348s.jpg", "caption": "Cinnamon roll, pecan roll, almond croissant, chocolate croissant"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/woX7mdLjGer-MdA2DScYiw/168s.jpg", "caption": "Breakfast flatbread"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/X870hgRDkg-aF29In1KGuA/168s.jpg", "caption": "Alsatian scrambled eggs"}]}}, {"review": {"des": "A charming little French bistro and bakery adjacent to the Peninsula in Chicago. It's very casual with an all-day menu,<br>We loved the Tarte Flambee. A light and savory French type flatbread.<br>The salads are all very good. Save room for the Wonderful desserts.", "pics": null}}, {"review": {"des": "Pierrot gourmet is usually a place I frequent solely for macaroons. Today I decided to try the food & it fell short of my expectations. I felt like it had mere truffle essence or truffle oil which always has little to no actual truffle in the ingredient list. The top portion of the dish however was extremely flaky & the bottom crust was extremely buttery but in a good way. Proceed with caution while eating because it's served in a cast iron skillet & will remain piping hot for quite some time.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/87Y_HmsOVXVoCZ9DaL7Wzg/348s.jpg", "caption": "Truffled chicken pot pie with some forgettable greens"}]}}, {"review": {"des": "I used to live in chicago until five years ago and I was visiting the city for a work trip on 4/7.  Place like this makes me miss this city.<br><br>Upon walking into the restaurant I was greeted and taken to my table promptly by the manager who was extremely welcoming and courteous.  Then the waitress, Vanessa, was attentive and genuine.  She was by far the most professional waitress i have interacted in my recent memory.  Her service alone made the experience special and wish i could go back to chicago to dine at this place.<br><br>I had a Moscow mule and two of their desserts: the raspberry tart (and Eclair to go).  Both were spectacularly delightful.  The desserts were great but it was the people that made the place unforgettable.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/imooPfSmlaoKtJNrW3fujw/168s.jpg", "caption": "Rasberry tart"}]}}, {"review": {"des": "Wonderful French restaurant. Food was incredible and service was amazing and super friendly. Skip the long lines accross the street  and come get some incredible food. Try the Irish coffee and macaroons !!", "pics": null}}, {"review": {"des": "Pierrot LOVEmet<br><br>What a cute little French bistro! I was so excited that I finally got around to trying out Pierrot Gourmet. I had been walking past this quaint French eatery for months when I was managing the Banana Republic a few streets over. During the summer, the patio is always filled with stylish diners and the food always looked so good. <br><br>Location: Right off of Michigan Avenue conjoined with the Peninsula Hotel. Subject to waits because of this. Definitely touristy, but because its a lesser known name, its not as bad as one would think.<br><br>Decor: Reminiscent of a French country cafe, diners truly feel as though they've transported across the pond and ended up at some romantic cafe off the beaten path frequented by the producers of a Nicholas Sparks film. <br><br>Service: QUALITY! Sirs/Maams, Mr. Jackson, etc. Very refreshing. Attentive, and courteous. No other words.<br><br>Food: I ordered the quiche lorraine which came with a petite salad, and the vanille mille feuille dessert. The quiche lorraine was orgasmic. I finished the salad first so I could really take my time with the quiche. I loved the dressing of the salad. It was very thick, but tasted amazing. The vegetables tasted very fresh. The quiche...okay quite frankly it was the best quiche I've ever had in my life. Even better than the ones I had whilst visiting Strasbourg and Paris a few years ago. The leeks were so tender, the bacon was SO chewy and salty which complimented the creamy gruyere perfectly. The CRUST. WAS. PER. FECT!<br><br>Now, the only part of this experience that was meh for me, was the dessert - which I seriously thought was going to be the star of the show. For $7, I was not impressed with the vanille mille feuille. It was just okay. The portion was quite small so I would hope the only reason why it is priced this way is because quality ingredients??<br><br>I will return in the summer for sure. I want to try the flambee and another dessert!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ERvItM7LdfPGSydeNgshcA/168s.jpg", "caption": "Super quaint interior"}]}}, {"review": {"des": "This is the best brunch I've ever had!!! The signature dishes are soooo good! I like their dessert as well. Will definitely visit again!", "pics": null}}, {"review": {"des": "I came for desserts on an empty stomach, and instead decided to order a truffle chicken pot pie and espresso. The complimentary bread and butter came with the coldest spread. I felt like it was a personal insult that my butter wasn't at room temperature. Service, however, was very warm. The chicken pot pie was jam-packed with flavor, but the espresso tasted too acidic.", "pics": null}}, {"review": {"des": "Super cute place! Food is simple and comforting. Desserts are delicious and beautiful!", "pics": null}}, {"review": {"des": "Nice view, great food, and excellent customer service. Thanks to our server, Juan. He always come back and double check on our table and go out of his way to complete our experiences at the restaurant with friendly service. We ordered the chocolate croissants, rashberry muffin, and the mix plate of sausage and cheese. My friends also order cappuccino and for me, i got mimosa. The croissants were super soft and moist inside. We also ordered some macaroons from the bakery. The macaroons have different and unique flavor for each one. All of them are in the right texture, moist, and soft cream inside. We love it and definitely will come back for next visit", "pics": null}}, {"review": {"des": "This is a perfect spot for breakfast, especially if you enjoy a European style French café.  The food is excellent - fresh, hot and delicious.  My friend and I split the egg white frittata with spinach, roasted tomatoes and feta, which was plenty enough for the both of us.  We also shared an almond croissant - delicious!  Warm and buttery with slivered almonds on top.  Their pastries and baked goods make nice carry-out items.  Great prices, too!", "pics": null}}, {"review": {"des": "Shrimp and Grits - ok at best.   Not enough kick to it.   Kinda blend and deviated too much from what it should be.  Plain shrimp and blend tasting sausage.   Not recommend it <br><br>Drop coffee - I'm from Seattle but this was a supercharged black coffee.   Pls make sure to add some cream and sugar.   <br><br>Price - not bad for a hotel joint.    Not bad.   <br><br>Service - good.", "pics": null}}, {"review": {"des": "Omg. This place. I wish I could give more than five stars. The brunch is good. But the pastries OMG OMG. Try the rose macaron for sure. And the coffee. One of my favourites. Their dinner menus is great too. But the French style pastries have my heart. As does the cosy interior", "pics": null}}, {"review": {"des": "It is a perfect place to have a long nice catch up or meet up with family and girl friends after dinner since it opens until 10pm. Good desserts, pleasing service along with cozy environment, there's nothing you will want to crave for more! Highly recommend this place!", "pics": null}}, {"review": {"des": "When you are a visitor to Chicago and it is impossible to get into Giordano's on a Saturday night, you may opt to try Pierrot Gourmet across the street. Do avoid the boeuf bourguignon. While a generously sized, hearty dish with what proved to be a variety of very nicely prepared vegetables, the chunks of beef were so tough as to be nearly impossible to cut with the knife provided in the standard flatware each of the tables are set with. The beef was also so terribly fatty that it served only to make the dish's sauce extremely greasy. Regrettable dining experience.", "pics": null}}, {"review": {"des": "Celebrated my birthday here on a Friday. Loved the Peninsula breakfast and had to try the french toast for desert! Very cute place, nice servers and good atmosphere. The Happy Birthday touch on my latte was adorable. Can't wait to try the pastries next time!", "pics": null}}, {"review": {"des": "I love this place. It's my go to lunch spot whenever I have an appointment in the city! They have a cute outdoor sidewalk area when it's nice out.  It's a small place- not too many tables and 2 of them are communal. The menu is healthy (mostly) and French and they have specials each time I'm there. Some of my favorites:<br><br>All the salads are amaze- my favorite is the Nicoise (hold the sardines)<br>The tuna melt sandwich<br>The french onion soup<br>The quiche-sometimes a bit salty but not too much in my opinion<br>macaroons<br><br>I've always had good, attentive service here. Solid quaint spot.", "pics": null}}, {"review": {"des": "I never write reviews, but after stopping at this place to order a quick coffee to go, I will never go back again. I inquired to sit for a few minutes on the outside terrace since it was closed anyway for the season. The hostess didn't see a problem with it and directed us to the barista to order our coffee. After receiving our orders, I asked the barista again if we could sit on the outside terrace for a few minutes (my boyfriend was on crutches). She then proceeded to rudely lecture us that if we were dining in whether inside or outside we would need a server and that's \"how they make their money\". She then asked us rudely if we wanted to dine in after we had already received our coffee. So basically we have to pay a server just to sit at a table that's already been closed for the season? I was just simply inquiring, not trying to sit at a table without tipping a server.", "pics": null}}, {"review": {"des": "Walking around Chicago looking for a delicious latte and we found this place.  A yummy overpriced latte worth every penny.  Looked at the menu and it looked fantastic so we decided to try lunch there later that day.  We put our name in.   We wanted outdoor seating. Hostess said 15-20 mins.  We saw several empty tables that just had to be cleaned.   Other parties were seated that came in after us.  I complained several times and she said it was almost our turn.  Almost left but wanted to try the truffle pot pie so badly.  40 mins later we were seated outside.  Took another 15-20 to get a waitress over.  Once we finally did order we agreed it was worth the aggravation. The pot pie was out of this world.  The burrata dish was melt in your mouth good.  The popover thing was delicious.  Shrimp and grits amazing. Service would be a 2 at best.  Had to ask for water refills. Had to ask for check.  And it was busy but not that busy.  I felt forgotten. But the food was 5 stars all the way.  I just felt compelled to take away 1 star for the service. Train your employees to work!!!!", "pics": null}}, {"review": {"des": "My boyfriend and I came for breakfast on a Thursday morning. It was a beautiful day, so we sat on the patio. Food was great. I had a waffle that came with fruit and a dollop of whipped cream. He had the peninsula breakfast which consists of a salad, sausage, bacon and eggs. Bacon was crispy. Orange juice was excellent. Service was nice. Our waitress was attentive. The host came to check on us also.<br><br>My only issue was the amount my credit card was initially charged. My total was $40.89 for our breakfast and I tipped $8, so $48.89. But when I checked my account, I was charged $49.10. It was pending, so I just decided to keep my eye on it. When the charge went through, I was charged the correct amount of $48.89. I was curious as to why I was charged $49.10, but after reading some other reviews, I think the restaurant initially charges the total amount with a 20% tip. I don't know why this practice exists since my party consisted of two people and we didn't spend an unreasonable amount of money.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/bQ4Gm6m_1FwEM6d6FdH_xQ/348s.jpg", "caption": "Belgian waffle"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/6Hbj7zFr1EfnhjnkWl3vbQ/168s.jpg", "caption": "Peninsula breakfast"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/NEJdWOCOX5zDevbPYSnfHw/168s.jpg", "caption": "Peninsula breakfast and Belgian waffle"}]}}, {"review": {"des": "We stopped at Pierrot Gourmet during our layover in Chicago and probably looked like huge scrubs cause we had all our things with us, but the wait staff and everyone was very kind. Just a word of warning, this is a classy and upscale place so be prepared for the prices and the atmosphere. Nevertheless, the waitress took our drink order, which was a wine flight for my wife and I, and we also ordered a cheese plate to pair with the wine. <br><br>I am certainly no connoisseur of wine but the flight was appropriate with the drier to wet wine combo and the wines tasted great. The cheese plate was a big success with some great different kinds! I love cheese so that's probably why I liked it. We finished off with a desert which was expertly crafted and delicious! If you have the money and are looking for a classy place off of Michigan Ave then this is your place!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/YsxIn5jOtr-SPfBtyXLIEQ/348s.jpg", "caption": "Get the \"Buy 2 Wine Flights\" deal and get this free cheese plate! It's awesome!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/XEvkfiX7_KbDAeoioodosw/168s.jpg", "caption": "Our wine flight with descriptions of what you're drinking. Get the 'buy 2 wine flights' deal and enjoy your free cheese plate!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/X2rvl36ebaUT5VHJeKjPmQ/168s.jpg", "caption": "One of their delicious deserts, everything is well crafted and of course, edible!"}]}}, {"review": {"des": "I made a quick stop by this dessert place after shopping and the dessert hit the spot. I ordered a raspberry rose macaron and my boyfriend had the chocolate brownie. We both have a sweet tooth and could not stop eating the pastry until it was all gone", "pics": null}}, {"review": {"des": "This restaurant is affiliated with the peninsula hotel. I recently went here twice, once for desserts and the second for lunch. You can choose to sit outside or inside. The place and decor is really nice with a wine cabinet displaying good wine. When you walk in right on your right you can see the desserts display. The desserts and food were good. The only problem I had was the service was a little bit slow. They didn't ask my friend and I what kind of water we wanted and another couple who came afterwards got asked first. Given the fact that they had enough waitstaff they should of been more quicker. If the waitstaff was busy the host could of serve us water.", "pics": null}}, {"review": {"des": "We arrived on a Sunday morning and got seated right away but no one came to serve us. Even after 15 mins no one asked if we wanted coffee so we left.", "pics": null}}, {"review": {"des": "I absolutely live the ambiance--very classy, comfy, and inviting. They have incredible quiche and I love the orange hot chocolate.  I am not the biggest fan of macaroons in general but they have a nice selection here. Can't wait to visit during the holiday season!", "pics": null}}, {"review": {"des": "Cute small restaurant with excellent food. From latte to Oktoberfest Weizen all super. Loved Spätzle!", "pics": null}}, {"review": {"des": "Beautiful place! The dessert is a little too sweet but I was told that the mango macaroons are not as sweet as the rose ones. But the rose cream is special and everything looks perfect. And I like it that it opens early.", "pics": null}}, {"review": {"des": "We decided to dine at Pierrot Gourmet before we went to theater and informed the waiter as soon as we arrived.  Fortunately, there were only three other parties in the dining room so we placed our orders as soon as we made our decision which did not take long.<br><br>Food - One of our friends ordered the trout which looked very dry.  I noticed she did not even finished it.  My husband ordered the chicken pie and there were literally two pieces of chicken in it.  I had the Boeuf Bourguignon that was lukewarm so I asked that it be returned and heated properly.  Unfortunately, even though it was not quite busy yet the chef took 10 minutes to reheat my order.  When it arrived back it was hot but I found the meat to be greasy and very fatty.  It was disgusting so I ate the vegtables which were good.  <br><br>Service - Our waiter was very nice but was responsible for servicing the bakery and our table so it was difficult to get his attention.  We finally had to resort to asking another waiter to assist us because we were trying to manage our time.  Our friend requested more butter and never got it.  When we wanted to check out our waiter was waiting on a customer in the bakery and had to box up some cookies.  By the time he finally came back we needed our check quickly so we could leave.  It was hardly a relaxing meal.  I would hate to be there when it's busy!<br><br>Overall, the food and service were very disappointing.  I was surprised because we have heard from friends that they thought the food was very good.", "pics": null}}, {"review": {"des": "I vowed not to write this review until I've actually dined here, but, I tell you...that will never happen. 1.) too many other food destinations and 2.) the service is hit or miss. I wouldn't chance it for a meal but when I come for dessert and coffee or champagne, I'm a bit more forgiving. <br><br>Five stars because the sweets are simply that divine.  Found out that the pastry case selections are made fresh. Daily. Nothing you see in case is old. Not even day old. You can absolutely taste it. Not only that, all desserts are are a flat $7.00. Big points for value and simplicity. <br><br>Favorites: <br>White Chocolate Blueberry Cheesecake<br>Raspberry Rose Macaron<br>Tart Chocolate Caramel<br>(Preferred over the)<br>Coffee Caramel<br>(More points too proper to-go packaging!) shown below<br><br>The dining area is country French kitchen style and the patio gets people-watching points. I do give the staff credit for being friendly and courteous if not always fast or anticipatory of your needs. And that buttery voice piped in and singing en Français makes me want to start stringing together foreign syllables even if I'm a horrible American butchering the language of love (and butter.) <br><br>Thank you to The Peninsula; I love your Pierrot Gourmet. <br><br>PS- I've taken a look and that dinner menu, and it offers beef bourguignon, salads and quiches as expected, but also... A lobster roll!? I can tolerate a even a stomp on the foot for a lobster roll. Oh, oui!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/E5lfNaLrdc_0ejxyD-WM9Q/348s.jpg", "caption": "Perfect!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Bm5OJQmiBw-0VAEPc86HYg/168s.jpg", "caption": "Proper packaging points! For a rose raspberry macaron"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/CJxjZ0qjyKo28xE8aceSrA/168s.jpg", "caption": "Coffee caramel - not too sweet. Lightly coffee flavored. Smooth"}]}}, {"review": {"des": "Pierrot Gourmet is phenomenal! We always go there for lunch or breakfast. The potpie is out of this world, their flat breads are scrumptious, their soups are steamy and delicious, staff is always nice. We love their healthy breakfasts. And all of this while sitting outside and enjoying their terrace!!! I would go there any time of the day and even if not hungry would just enjoy a cup of coffee or a glass of wine!", "pics": null}}, {"review": {"des": "I absolutely fancied dining al fresco at the Pierrot Gourmet. The waitresses and staff are very friendly and accommodating. At the time we arrived, there were only communal tables open. I was hoping to sit out in the patio, and the waitress was able to fit us in 5 minutes after being seated in the communal. Pierrot Gourmet is a small cherry wood patisserie with a wide selection of sandwiches, baguettes, French soaps and tartines. I am a huge fan of the colorful side salad served with their main sandwiches. Their baguette jamon and blueberry cheesecake were delicious!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/siv0NMpVh6tK7qCpVqs9qg/348s.jpg", "caption": "Baguette jamon."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/LRC_EM4B_Rb0LFBCUT86ew/168s.jpg", "caption": "1/2 baguette jamon with Brie cheese, small side salad and sweet honey mustard."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/CJoVT4bpsfFxcNBPNlGDfg/168s.jpg", "caption": "The blueberry cheesecake was scrumptious!"}]}}, {"review": {"des": "This was a poor choice for breakfast.  First of all the service was very slow.  We started off with chocolate croissant. It was super flaky which normally would be good but it was overdone.  And the chocolate was minuscule.  My wife got a spinach and leek and cheese frittata. There was nothing frittata about it.  It had a minute amount of cheese and leeks.  The mushrooms were mostly rubbery stems.  It was very dry and tasteless.  They could use a lesson on how to make a frittata from Bakin & Eggs on Lincoln Ave. in Chicago.  The bacon that they forgot to bring and when they did it was large plateful of overdone bacon which must have been microwaved.  Definitely not fresh cooked bacon. I got the PG scramble.  It was tasty but it was watery.  It had a little puddle of water at the bottom of the plate. Not very appetizing. For these reasons.. we're out.", "pics": null}}, {"review": {"des": "excellent service from the waiters and awesome french toast and orange juice with real pulp!! just perfect!", "pics": null}}, {"review": {"des": "Walked by this restaurant so many times and finally stepped in for lunch on a Saturday. There were tables available and we were promptly seated. If you want breakfast options, they do offer selections from that menu even if you come during lunch. <br>We ordered the French onion soup, a croissant, and the truffle chicken pot pie.<br>The french onion bowl was a good size, enough for 2 people to share. Flavor is very concentrated and a bit on the salty side but overall the taste was on point. Croissant was quite good as well, flaky on the outside and doughy on the inside - perfect. The highlight of the meal was the chicken pot pie which came with a side of greens. My husband was over the moon about this pie. The ingredients are fresh and the filling has large pieces of mushroom, vegetables and chicken breast. The truffle flavor was subtle and not overpowering. Crust is flaky and delicious. I took a few bites and had to stop myself before I finished the rest haha. <br>The ambiance of this restaurant is great, with a lot of french countryside character. We are looking forward to trying more menu items in the future.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/gwueJx87_Hxe4iqbvAP75g/348s.jpg", "caption": "Breakfast flatbread"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/3FMqW3tMpY5X_JL5Gqtg-w/168s.jpg", "caption": "French onion soup and a croissant"}]}}, {"review": {"des": "Overhyped and overpriced. <br><br>When we arrived, the hostess was nowhere to be seen. We waited and waited. Eventually we went to the take-out counter and asked if we could seat ourselves. The lady told us to go back to the hostess station and wait.  By then other folks had arrived, and we ended up in the back of the line. <br><br>When the hostess finally found herself at the hostess station, naturally we got seated last. When we arrived at our table, we were under an extremely bright spotlight. I told the hostess that we needed to move, and there were plenty of open tables...nevertheless, she said the only table we could sit at was the large, crowded communal table. So we stayed under the spotlight. By this point, I was so disgusted that I couldn't really care about the food.<br><br>When we were finally served, by what seemed like a reluctantly friendly waitress, the food was totally disappointing. My ham and cheese sandwich was plain and boring, for $15 it was truly a rip-off. <br><br>I won't be back. Yuck.", "pics": null}}]}