{"name": "pierogi-heaven-chicago", "reviews": [{"review": {"des": "This is the only place in downtown Chicago where you can get good pierogis. I always get the cheddar potatoes ones with a side of sour cream. The Pierogi itself is cooked perfectly. It's not mushy or soggy. They are firm enough to hold its shape but soft enough to cut in half with a fork. The filling tastes exactly like what cheddar and potato should taste like. It doesn't have any fillers or added ingredients. <br><br>The Pierogi are reasonably priced and far better for you than any of the fast foods in the area. They taste homemade and fresh. Definitely recommend stopping in to try them at least once, you'll fall in love instantly.", "pics": null}}, {"review": {"des": "Great little hole in the wall for some good pierogi. It's a small, counter service restaurant with a number of different pierogi options and a couple of non pierogi options. But of course, I was there for the pierogi. <br><br>I ordered nine pierogi, three mushroom and sauerkraut, three potato and three meat and spinach. The mushroom and sauerkraut were my favorite (also my favorite kind of pierogi in general) but all of them were great. I wasn't super hungry at the time so nine was plenty, but if you're hungry you might want to go for more.", "pics": null}}, {"review": {"des": "Good spot to carb load inexpensively! They have multiple pierogi combos where you can pick various sets of 3 flavors, starting with 2 sets for around $6. I got mushroom and meat/spinach. I also added a side of Polish sausage for around $3. <br><br>I was surprised, but I ended up liking the mushroom pierogies more than the meat and spinach ones. That's because the meat looked and tasted a bit mysterious, and that was slightly off-putting. The flavors are subtle, but the pierogies tasted fresh and came with sour cream, sautéed onions, and crispy bacon bits. I think I made a good call with the grilled Polish sausage, whose salinity balanced out the pierogies. <br><br>While there is seating, it's a pretty small/very casual takeout kind of place, and there are no customer restrooms. I probably wouldn't make a special trip here again, but it's not a bad option if you're craving Polish snacks and happen to be nearby!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/yHfXX_PAXi0nWRMC1cZaRA/348s.jpg", "caption": "Pierogies and Kielbasa"}]}}, {"review": {"des": "The name for this restaurant is perfectly fitting. If you like Pierogies this is your place! It is a small storefront, so lookout carefully or you might walk/drive by. The inside is nothing fancy, a few small tables, but perfectly clean. Staff is friendly. I tried the potato/cheddar and saurkraut/mushroom pierogies. They were for sure the best I have ever had. They are small, so room to order plenty for sampling. I recommend you go ahead with the bacon and onions on top, along with sour cream on the side. I also tried the stuffed cabbage, which was fine, but I am used to more of the polish style of stuffed cabbage, which this was not. The side of potatoes was good, but I didnt like the addition of dill. For my opinion id stick to just the pierogies here.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/oQlBMBpEPTYtYf8WkD0YNg/348s.jpg", "caption": "Stuffed cabbage"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/LNO5b3X1XMxZXqeyMGlncQ/168s.jpg", "caption": "Inside"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/WqKvpKj8MwV8wrPg_gfF4Q/168s.jpg", "caption": "3 Potato/cheddar and 3 sauerkraut/mushroom"}]}}, {"review": {"des": "This place is pretty legit. They have around 12 flavors of pierogis. I tried the mushroom, kraut, meat, cheese (orange), cheddar (white), and spinach ones. The best were the mushroom and the kraut, but they were all delicious. For SURE get them loaded with bacon, onions, and sour cream (no extra fee). The kraut was so good that if I ever go back, I plan to get a sausage and Kristen plate. The restaurant is pretty small (maybe 8 tables) and hard to find, but worth it. Decent price and pretty filling.", "pics": null}}, {"review": {"des": "I'm really jealous that Chicago locals get to eat these delicious pierogi's all the time! <br><br>This was one of my favorite meals while in Chicago. They have so many different types of pierogi's to choose from. You can mix-and-match in increments of 3. We got twelve pierogi's-- meat & spinach, potato & cheddar, mushroom & kraut, and sweet cheese. They top them with onions and bacon. We also got a polish sausage-- perfectly charred on the outside! <br><br>This is a no-frills place with some delicious Polish food!", "pics": null}}, {"review": {"des": "Yum City! Taste just like the pierogi I grew up eating in my polish friends' households. Love that they offer free toppings on all pierogi of bacon or onions and a side of sour cream. Good price for a carb-loaded delicious lunch. I've also bought large orders for a team lunch and they were a hit, though I admittedly may have eaten more than everyone else combined!", "pics": null}}, {"review": {"des": "It has become my stop on the way out to grab plain Pierogi to eat on the drive home. Not super extravagant, but a lot better than greasy fast food items to grab during road trips.", "pics": null}}, {"review": {"des": "This is the best place to get your Polish comfort food fix! The Pierogis are delicious and the perfect consistency. Make sure to order a polish sausage (or two), crispy outside and juicy center. Don't forgot about the borscht soup with the dumplings! Perfect meal before or after the Christkindlmarket!", "pics": null}}, {"review": {"des": "The stuffed cabbage rolls were great- exactly what I had hoped. The sauce, seasonings, and mashed potatoes were all good. The bacon: delicious, fresh, crispy bacon bits. The polish sausage was good- your typical sausage. The vegetarian pierogis were all good, as well as the spinach meat. <br><br>The bad: the meat in the pierogis was cheap and total mush. It tasted like ground chicken, but I was expecting beef. It had an odd texture, but it was a bit better with spinach mixed into it. I'd steer clear of the plain meat pierogis though. <br><br>I like that you can order a la carte and three of each pierogi. It was nice to get a good variety without getting too much food. There were five of us who shared, and $40 bought us more than enough food and a little bit of everything. <br><br>It's not the best polish place, and I wouldn't necessarily go out of my way to get there. But it was a good choice for a quick lunch near the trains.", "pics": null}}, {"review": {"des": "FINALLY, after months of reading and re-reading the Pierogi Heaven reviews and upon my friend's insistence that I wait to try Pierogi Heaven with him, I have been graced with the delicious pierogis of this wonderful food haven.<br><br>This may seem extreme, but I promise you, the 600+ Yelp Reviews and almost 5 stars should not be scoffed at - Pierogi Heaven is serious about their pierogis. We visited at 11am on a Saturday right at opening. Because we visited at opening, we knew the pierogis would be super fresh. However, it seems like they continue making fresh pierogis all day, so I don't think you can have a bad 'rogi here. I personally ordered the potato and cheddar pierogis and the sweet cheese. An order of nine was more than enough - I couldn't finish the entire plate. I also got to sample a mushroom pierogi from my friend - it was quite decadent, but very good. These are quality pierogis, my friends - nothing frozen or fake in this restaurant. <br><br>I don't work or live close enough to Pierogi Heaven to make this a regular spot on my list (which is probably good for my overall nutrition), but I am counting down the days until I can visit again for some quality, delicious pierogis.", "pics": null}}, {"review": {"des": "Cheap AF and delicious. Does it get any better? This was my first time having pierogis outside of some frozen food shit. I got the meat and spinach and the potato and cheese. I suggest affecting onions, bacon and dipping in sour cream. I wasn't as keen on dipping in the mushroom sauce <br><br>You order in multiples of 3 and they allow you to mix flavors, but only in multiples of three. <br><br>If you want a quick and good lunch come here. The dining is small, but they can give it to you in a to go obviously.", "pics": null}}, {"review": {"des": "I'm from bayarea visiting Chicago for weekend. I tried bunch of Chicago foods like Italian beef, hotdog, deep dish pizza. I like Pierogi the far best.<br>Especially this place provide pretty affordable, quick and delicious Pierogi.<br>Thw location is good as close to the river. Many ppl made it as take out and ate by the river side walk. Looked pretty nice in sunny and summer days.<br>I ordered 3x4. Combi of savory and sweet. I liked savory a lot. Not a fan of sweet. Meet and spinach was my favorite.", "pics": null}}, {"review": {"des": "Fantastic food delivered. Made with love. The sausage with onions and sauerkraut is phenomenal.", "pics": null}}, {"review": {"des": "This is just ok.  We thought we would be getting pierogis full of flavors and something unique.  It was a decent pierogi.  It doesn't have a standout flavor or experience. If you want a plain, fast pierogi, this is your spot.", "pics": null}}, {"review": {"des": "Take me where there is a large Eastern European population and I'm going to immediately Yelp \"pierogies\".  I am part Polish and grew up eating pierogies.  No, not the frozen kind that's found in grocery stores but the real deal pierogies.  <br><br>We made our way to Pierogi Heaven on a weekday around 4pm to grab a bite to eat.  We ordered 3 of the meat ones, and 3 potato and cheese ones. I asked for the side of sour cream, and onions and bacon on top - go big or go home, right?  <br><br>Pierogi Heaven was so good that it reminded me of my childhood at my grandparents' house.  Which if you can find a food that does that to you, you know how important that is.", "pics": null}}, {"review": {"des": "Really good. I got the mushroom and sauerkraut and meat and spinach pierogies... They were really delicious, and come with onions and bacon and sour cream. I also got a Polish sausage which was delicious! Except, I was at Torres tires and was desperately looking for somewhere I could use the restroom as I just got off an hour long train ride, and they wouldn't let me use the restroom, which I kind of think is illegal? If it's not, it really sucked and I would've stayed there longer and had a better time if they would've just let me use the restroom. But, the food was good.", "pics": null}}, {"review": {"des": "I've been trying to find the best pierogis in Chicago and this place I would put high up on the list! <br><br>The potato and cheddar pierogis were my favorite. They had enough flavor but it wasn't over kill. The meat pierogis are made with shredded beef and pork, it was very flavorful! <br><br>This is a smaller restaurant, but there is plenty of seating. They also have a TV playing the news if you need some entertainment. <br><br>All menu items are very affordable!  You can easily get a meal for under $10. <br><br>The staff was very friendly and helpful!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/xLyGT_4BTeF5HWPn00pPOA/348s.jpg", "caption": "Potato and cheese, potato and cheddar, and meat pierogis ~$10 for 9"}]}}, {"review": {"des": "There are not a lot of Ukrainian restaurants in CA, so when I came across this place I was so excited. The pierogi selection was great, they offer about 7-10 different flavors, from plain stuffed potatoes to sweet cherry ones. They tasted like my great grandma would make.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/W3xvviOL4LTpQXTByVV1IQ/168s.jpg", "caption": "Pierogis"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/S7IzQtGwvZRieVzPnpicVA/168s.jpg", "caption": "Menu"}]}}, {"review": {"des": "Friendliest service in Chicago. I forgot to get receipts for my expense reports and Sam dug them up for me. Haven't had many do that for me in the past. <br>Food was great as well. I was through 6 of the pierogis before i knew it. Went in for round 2. Only regret was my stomach couldn't take in another round.", "pics": null}}, {"review": {"des": "I would give the Pierogi Heaven a 5* for the food as the stuffed cabbage and the two different types of Pierogis were top notch. The food was steaming hot and very tasty. The reason for the 3* is there is no public restroom. We were sent down the street to go to Subway to use their restroom. If there is no restroom in this establishment, where are they washing their hands after using subways restroom!!!!", "pics": null}}, {"review": {"des": "I ordered the cheese/onion and the mushroom/onion. Really didn't enjoy the cheese too much but the mushroom were pretty good! I think I've maybe eaten too many pierogies that are pan fried for me to enjoy ones that are just boiled. <br><br>They definitely tasted fresh, just couldn't get over the texture to truly enjoy these. Those that normally eat pirogies that aren't pan fried are sure to enjoy these! <br><br>Note on portion - I ordered the cheese and mushroom (6 piece each) because I thought I'd need that much...I was very wrong. These are so filling despite the low price. Just the 6 mushroom pieces would've filled me up.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/0wtokz4hmp1eVrMTezRZnw/348s.jpg", "caption": "Insides of a mushroom and onion pierogi"}]}}, {"review": {"des": "Excellent pierogis, minimal crowd, great location in the central loop, and great pricing!<br><br>I bet this pierogis hit the spot in the winter! <br><br>I got the 3 for $9 pierogi deal, and that was an adequate lunch for me. It also came with a great sauerkraut that I recommend as well. I'm glad I tried this place for something a little different. <br><br>The pierogi selection is pretty varied- there's spinach, meat, potato and cheese... I believe there are 12 pierogi varieties. True pierogi heaven!!<br><br>One of the most attractive features of this place is that it is small, and it's not super crowded. It's hard to find a place if you want to catch up with a buddy or two at lunch in the heart of the loop. So, keep it intimate and don't bring your group of 8!<br><br>Yayyyy Pierogis!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/7vBGkSursuXVyFm_F_nD9g/348s.jpg", "caption": "Friday lunch - medium crowd"}]}}, {"review": {"des": "The mushroom and potato/cheddar were outtta this world. Pierogie Heaven is a teeny little shop, but Yelp helped me find it anyway. I grabbed 6 (they come in multiples of 3) topped with onion, sour cream, and bacon and sat down to enjoy my goodies. So yummy! Each bite of the potato was creamy and delicious, and the mushrooms were almost meaty - they were so rich! These guys just felt homemade. I wish I had gone earlier in my Chicago trip.", "pics": null}}, {"review": {"des": "This is some authentic polish cooking! There are 11 different types of pierogis as well as other polish foods such as red borscht, stuffed cabbage, and polish sausage. The service is quick. A small restaurant. I would highly recommend for a quick meal. 5 stars!", "pics": null}}, {"review": {"des": "I am very Polish so I feel like I can definitely write a review about this place. Not quite as good as my mom makes them but definitely still quality pierogi. I had 3 mushroom & 3 spinach pierogis which were very good. The place looks very sad inside though and was playing some random tv show from the 80s. The staff was kind of weird and you had to ask the counter if you even wanted water. The borscht is probably my favorite polish food in general, and I was surprised that my cup wasn't filled with the small mushroom pierogi like it traditionally should be, like for Wigilia every year. The food itself was good but the place itself looked kind of run down and the atmosphere was very bleak and depressing. Maybe take the food to-go? The food is heaven but the place--eh, not so much.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ZD4Qpj3L__cQVm3xndrNoQ/348s.jpg", "caption": "3 potato & cheddar, 3 spinach. delicious!"}]}}, {"review": {"des": "I visited Chicago for a work trip and immediately started googling restaurants near my hotel. I was over the moon thrilled when I saw something called \"Pierogi Heaven\" existed! My grandparents owned a restaurant and made their own pierogi, so it has a long history in my family. I even have the word \"pierogi\" tattooed on my lip (ohh the decisions I made in my youth...)<br><br>I really wish I could have eaten here more than once during my visit, but I had a really great experience so it's lovely to be left with fond memories! I got a plate of 9 pierogi: 3 cheese, 3 mushroom and kraut, and 3 of the fruit filled. Opting for bacon and sour cream was definitely the right call and my favorite way to eat pierogi (although protip: greek yogurt is a healthier substitute at home!). The classic cheddar were by far the best and really similar to the ones I'm used to eating. The dough is a little thicker than I like but still were tasty. I got the mushroom and kraut just to try something new. I'm wasn't a huge fan, but it was fun to try a new flavor. The fruit pierogi needed a bit more flavor and less dough, but overall I was happy I got them.<br><br>Next time I'm in Chicago I will be making a return visit!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/EtWK6rgffC_vmtljEm5aiQ/168s.jpg", "caption": "mushroom & sauerkraut, potato & cheddar, and fruit"}]}}, {"review": {"des": "The people ordering in Polish cemented for us the authenticity of this small, order at the counter dive under the El. We had kraut-mushroom, potato, meat-spinach pierogi, and fruit pierogi for dessert. We also tried a cup of borscht. Everything was delicious and well seasoned. We especially loved the kraut-mushroom ones. The bacon -onion topping was perfect with all the savory pierogi, and we added sour cream to the borscht and fruit pierogi. As one former Pittsburgher and another of Polish descent, this really hit the spot. It's been years since either of us had good pierogi. Thanks Pierogi Heaven!!", "pics": null}}, {"review": {"des": "Wow, Pierogi Heaven was fantastic. It is exactly what you're looking for in a pierogi place. We ordered an assortment of pierogis and were pleased with each and every one. Also, it is definitely a friendly meal for your wallet. You can see on the menu photos (pictured) that their prices are v reasonable. We will definitely come back here for another meal in the future.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/IG7gPYe-WVw5pzOzOVd3LA/168s.jpg", "caption": "Menu"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/3Rekl72LDDBqkVvKJhpj7Q/168s.jpg", "caption": "Menus"}]}}, {"review": {"des": "We stopped by here for an afternoon snack and wanted to sample pierogis, something new to us visiting SC residents. The interior was pretty basic, with tables and stools up front. The staff was ok, greeted and took our order. We just ordered 3 different pierogis: potato & cheese, mushrooms, and a meat filled one. The beige plateful was topped with some bacon bits and a side of sour cream. <br>Our opinion, well they were pretty average. Very soft texture, definitely needed a dash of salt, and the sour cream. Sorry, just not something we would try again. We tried it, but we didn't like it. Next stop, let me Yelp it.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Rl80rRG8qts5abkpf9XhBw/348s.jpg", "caption": "A plateful of beigeness...salt please."}]}}, {"review": {"des": "Discovered this gem in the loop and just picked up lunch from there! They have a variety of pierogis in a no frill environment. You can order pierogi's in groups of three. I went with potato/cheese, spinach/meat and mushroom. After seeing the other reviews, I opted to order the mushroom (not my typical order) and it was delicious and hearty. 9 was a substantial lunch. Definitely enjoyed this and it was a nice change of pace from my standard potbelly order. :)", "pics": null}}, {"review": {"des": "Omg I would come here all the time if I lived here!  Homemade dumplings with a chewy dough and variety of fillings = heaven!  I ordered the meat and spinach (finely shredded meat), potato and cheese, kraut & mushroom, and sweet cheese (lightly sweetened ricotta).  The kraut and mushroom was the best because, well, kraut is delicious.  I'm now curious to try the kraut only pierogi as well.  The sweet cheese was surprisingly good and was my second favorite.  The meat was actually my least favorite, maybe because of the texture, but hell, if they were out of everything else I'd still happily eat it.  The onions, bacon, and sour cream toppings really made the dish, especially the sour cream even though I generally dislike sour cream.  I also ordered a bowl of borscht.  I haven't had borscht many times in my life so I can't comment about how good it was, but all I can say is it felt perfect on a cold spring day in Chicago.  And when they say it comes with meat, they mean it contains about 12 adorable mini meat pierogies... There's no such thing as too many pierogies at Pierogi Heaven!", "pics": null}}, {"review": {"des": "If you're in the city, make sure you dont miss this hole in the wall. Amazing food, very flavorful. The store is more suited to carryout than dining in. Having said that, you come here for the great food and not the decor or interiors", "pics": null}}, {"review": {"des": "I have wrote about this place before and we have ate Polish food all over and the Pierogi here is absolutely amazing.  We always look forward to eating here when we visit Chicago.", "pics": null}}, {"review": {"des": "Great selection and the fillings were amazing. Tried the mushroom, the spinach and meat, and potato and cheddar. Would recommend to go with three different types when you order and get it with everything, plus hot sauce. At over $1 per pierogi, not the most cheap ones you can find, but definitely worth it.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/vVDMMW1O4RGQ23N4Fby7Ig/348s.jpg", "caption": "Mushroom, spinach and meat, and potato and cheddar"}]}}, {"review": {"des": "Looking for a quick place to grab lunch while touring through downtown Chicago we came across this hidden little gem. I'm a sucker for good Polish food and this place has some fantastic pierogi's! Much to my surprise they also offer stuffed cabbage rolls with a tomato sauce or a mushroom gravy. We decided to try the stuffed cabbage rolls and get one with each sauce and a variety of pierogi's. The pierogi's we ordered were sauerkraut and mushroom, potato and cheddar, and spinach and meat. The Pierogi's came dressed with sautéed onions and chopped up bacon on the top which was fantastic along with a side of sour cream. The restaurant is small but has plenty of tables to sit and eat your meal. They're reasonably priced. Definitely give them a try if you enjoy a good pierogi and cabbage rolls!!!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/k5iROaeHdUeiTG-JG_kkGw/168s.jpg", "caption": "The stuffed cabbage rolls with meat. One with the tomato sauce and one with mushroom gravy and mashed potatoes."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/zeVV1bJ7z88Iz4Y9eHikHQ/168s.jpg", "caption": "3 different kinds of pierogi's!"}]}}, {"review": {"des": "This place really appeals to my eastern European heritage.<br><br>Menu is pretty basic with the emphasis on pierogis.  They have a lot of choices and they let you try different ones as long as you get at least 3 of a filling.<br><br>Tried the meat, potato and cheddar, and sauerkraut and mushroom.  All of them were very good.  They give you bacon and sour cream to go with it which is exactly what should come with pierogis.<br><br>This is definitely a great place to stop for lunch as long as you don't mind having a bit of a heavy lunch.", "pics": null}}, {"review": {"des": "I took haven in the Pierogi Heaven during a big rain storm. I had half potato and cheese and half potato and cheddar pierogis (the cheddar and potato were my favorite of the two). I wish the onions were cooked longer, but that's just how I'm use to eating pierogis. The price could not have been better, the two servers behind the counter were friendly and kind and let me wait the storm. Definitely a cute stop if you're looking for a cheap lunch or a nice break.", "pics": null}}, {"review": {"des": "GO HERE!<br><br>Literally stop what you're doing, get off your phone, stop trolling Yelp, and get. to. this. restaurant.<br><br>Because when you cross the threshold you're not just getting dinner, you're leaving Chicago and entering Poland. I've eaten pierogis in/from Poland a handful of times, and these are the first pierogis since returning to the States that are the real deal. <br><br>The owner is friendly and even let me break out some of my rusty Polish during our visit. 6 pierogis is probably plenty for one person, but I didn't die after eating 9. Personal favorites are the meat and spinach, but they're all good. Get it with the bacon, onion and sour cream - that's the traditional way. Oh, and they take to-go orders, too! <br><br>Why are you still reading?? <br><br>GO HERE!!!", "pics": null}}, {"review": {"des": "Some folks from my job had a taste for Polish food, and I had never tried it (I know... Shocking haha), so we went directly to Yelp and came across Pierogi Heaven! For a place to have nearly 600 reviews and still maintain 4.5 stara ia really impressive, and I was not let down! <br><br>I called ahead to place a pick up order and they told me that it would only take 20 minutes! I was definitely already liking this place, and I hadn't even tried the food. So we make the trek to the place and luckily find parking space directly in front of the restaurant! We walk into a super crowded restaurant(another good sign), and make our way to the front of the line to get the food. Of course on my way up there I looked at everyone's plate and everything looked delicious! <br><br>Paying was painless and they had all of the orders separated and labeled! Just because of how good everything looked, we ended up ordering extra food! So we get back to work to find all of the orders are correct and labeled exactly how we had originally ordered them! I had the Cheddar and Potato Pierogi and Meat and Spinach Pierogis in addition to the Original Polish meal (comes with sauerkraut and mashed potatoes) <br><br>Everything was great! The pierogis weren't too heavy and had just the right amount of filling! The filling had a smooth texture that I enjoyed, and the sour cream added a nice touch! The Polish sausage had a nice crisp and went together perfectly with the sauerkraut. The mashed potatoes were also pretty good! Nothing to go crazy over, but they we're good haha. Overall I had a really positive experience, and would go back if I'm in the area!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/GFePQqP3hCST81ELPwe8rQ/168s.jpg", "caption": "Original Polish meal. (Sorry I started eating before I remembered to take the picture haha)"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ER80q_7ByPQMYPm1Y-GV7g/168s.jpg", "caption": "Cheddar & Potato and Meat and Spinach Pierogis"}]}}, {"review": {"des": "Does what it says on the tin. Pierogi. Heaven. Meat+spinach, kraut, potato+cheddar all meet or exceed expectations re filling flavor, filling and dumpling texture, and size. Will return.", "pics": null}}, {"review": {"des": "Pierogi heaven. The name really says it all. Growing up pierogis were a staple in my family. Every holiday, picnic, funeral and any other event had some sort of pierogi dish. Since relocating to the south I've missed them. On a recent trip to Chicago I stumbled upon this place and was well, in heaven.<br><br>The location is small so I see why they offer to go orders. They only had three or four tables, but fortunately we were able to grab a seat when I was there. I wanted to enjoy my meal immediately.<br><br>The menu board had so much on it that I honestly wanted to order everything: stuffed cabbage with me served with mashed potatoes with a mushroom or tomato sauce, polish sausage, and more.<br><br>The main event. The reason why I was there. The pierogi.<br><br>Flavors:<br>meat<br>meat and spinach<br>kraut<br>kraut and mushroom<br>mushrooms<br>potato<br>potato and cheddar<br>potato and cheese<br>sweet cheese<br>spinach<br>and more<br><br>You can add bacon, onion or sour cream (or all three if you're me) for a small amount extra each.<br><br>I ordered a 9 piece with polish sausage (which is kielbasa) I had the potato and cheese, kraut and mushroom and potato. Each were so good. These small, soft noodles each filled with the tasty filling. My favorite will always be potato and cheese, but the others were just as good.<br><br>Pierogi heaven will be a place I go to every time I'm in Chicago. It really is heaven on Earth.", "pics": null}}, {"review": {"des": "I'm a lover of Polish food, but I live in Louisiana. I was very excited to eat here and the food did not disappoint. I had three meat and three potato and cheese and kielbasa. All of which was excellent! It's good and cheap!", "pics": null}}, {"review": {"des": "I decided to come by for a quick lunch. It was very good. I got to try cheese and potatoes, mushroom and meat pierogi. They are very good and filling! My friend and I also shared a stuffed cabbage. I was in a food coma very soon. <br>The staff is very nice and friendly. The space is small but not too tight. It's a perfect spot for a quick bite and enjoy some comfort food. I would love to try their sausage next time.", "pics": null}}, {"review": {"des": "Truly this is heaven (for a fatass like me at least). <br><br>I grew up with a lot of Polish food traditions and was just in Krakow this year so a well made pierogi is near and dear to my heart. This tiny cafe reminded me of a real Polish \"milk bar\". It's dirt cheap, lightning fast, delicious and filling. <br><br>Pierogies can be ordered in lots of 3 and all of the traditional flavors (sweet and savory) are available. I split and order of 12 with the Mister - 6 each of meat and 6 cheese/potato. They're goddamn delicious - not gummy at all, and topped with super crispy bacon and butter braised onions. The meat version was my favorite - really well seasoned and exactly like the ones I had in Krakow. Potato & cheese is a comforting carb explosion. We added on a Polish sausage ($3) - it's the smoked version vs. the kielbasa variety I'm used to (it's a CHI thing, I think). Good all the same. <br><br>If we didn't have Duck Duck Goat reservations for later, I would have definitely sat there and ate pierogies until I exploded. But I would have gone out happy, you know?<br><br>There will be a next time, Pierogi Heaven.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ZOGExXORlUzj7Xpc3Qpgag/348s.jpg", "caption": "Heaven for real"}]}}, {"review": {"des": "Depending on the flavor, some are better than others. Mushroom is phenomenal. Meat was a bit dry. Spinach was good. <br><br>Sausages are great.<br><br>Not sure if this place is worth the various 5-star reviews but it's not bad.", "pics": null}}, {"review": {"des": "I traveled all the way from Las Vegas to Chicago just so I could chow down to a mess of cheese, spinach and potato pierogi. I was not disappointed. I ate a half dozen pierogi, a plate of grilled Polish sausage, sauerkraut and mashed potatoes. I was in HEAVEN! Pierogi Heaven is a small mom and pop restaurant, but aren't those the best?", "pics": null}}, {"review": {"des": "The name says it all !  The Pierogi game here is serious.  VERY GOOD FOOD at a very good price.  I've been back many times, not once disappointed.", "pics": null}}, {"review": {"des": "Definitely worth stopping in.Ended up coming here on accident but glad I found them.Was on a Sunday and had originally intended to go to the Indian place next door and it was CLOSED.I like Pierogis so I decided to give them a try.Wasnt disappointed in the least.Tried about 5 different types of Pierogies including plum and blueberry.The ones I most enjoyed were definitely the MUSHROOM.OMG!!!!! They were sooo gooooood!!!! They were all good but DEFINITELY ordering extra mushroom ones next time I visit FOR SURE.Place is kind of small so probably not good for big groups.Im sure alot of the people that work near there frequent this place alot.I know a buddy of mine saw my post and recognized the spot RIGHT AWAY and had nothing but positive things to say about them.I second that.Definitely worth a try!!!! THUMBS UP!!!", "pics": null}}, {"review": {"des": "This place is right by my work and is perfect for a quick, delicious meal! Ordered 6 pierogies for later (mushroom+cheese, potato+cheddar) and a Polish sausage meal. So delicious and a ton of food for a good price! I strongly recommend this local, authentic spot.", "pics": null}}, {"review": {"des": "Delicious! Hits the spot  the potato and mushroom pierogis were my favorite! This is the place to go for homemade, scrumptious pierogis ! Definitely a spot I'd recommend", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/5KaDtmIxjOxAEs3r_vOxyQ/348s.jpg", "caption": "Delicious! If you're looking for good pierogis, this is the place to find them. A great variety of options and combos!"}]}}, {"review": {"des": "Good value, quick and friendly service, plenty of options. Every variety of pierogi I've had has been excellent, but the mushroom is a my favorite. Their polish sausage is also quite good. <br><br>Highly recommended", "pics": null}}, {"review": {"des": "Another solid hole-in-the-wall close to my work and apartment! I'm an extremely happy camper right now.<br><br>Upon entering, the decor is nothing to write home about, so don't expect anything fancy. What you can expect is cheap and delicious food with great service. It does get busy around lunch hour during the weekdays, but you should be fine if you arrive before noon or after 1pm. You also have the option to do carry-out or order through the Ritual app.<br><br>I love that the service is quick. The pierogies are fresh but can be served very quickly. The ones I always order are meat & spinach combo. To be full off pierogies only, I would recommend getting 9. I've also eaten their polish sausage, which is served with mashed potatoes, sauerkraut, and fried onions. Soooo good. The polish sausage dish is a completely separate meal, so don't think you can finish that AND 9 pierogies. If you can, you're a beast and I want to know your secret.<br><br>I definitely recommend this place!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/fAH4R4hj9-48dQzl-Nxaxw/168s.jpg", "caption": "Polish sausage (left) and meat & spinach pierogies (right)"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Mf_XFR4HM3Gxtat-aaVQAA/168s.jpg", "caption": "Polish sausage (top), meat pierogies (top), fruit pierogies (bottom)"}]}}, {"review": {"des": "Hits the spot.<br><br>I tried the Potato and Cheddar, Meat and Spinach, and Meat pierogies, which were quite flavorful. I also had the borscht, which had very tasty broth, but it was completely devoid of cabbage/onions inside, which came as a surprise to me.<br><br>The staff was extremely friendly and helpful, and prices were reasonable. I'll definitely be coming back.", "pics": null}}, {"review": {"des": "Found this place on Yelp when looking for somewhere to eat before going to a play. The staff was friendly, and the food was amazing. The fruit pierogi were sweet and the cheddar and potato pierogi were filling and delicious. The restaurant is a little  small but it's a nice change of pace from other downtown establishments. Will definitely be coming back the next time we are in the city.", "pics": null}}, {"review": {"des": "This is my fifth time here, and it truly is hole-in-the-wall heaven. It's usually not busy at all, the prices are so affordable, and the pierogis are amazing. I usually get kraut and mushroom, beef and spinach, and cheese and today I also got a polish sausage. The sausage was so juicy and I think broiled (I'm guessing, I know nothing) and salty savory. The pierogis were freshly boiled, the skin being thin and doughy. I get them with all the fixings- bacon, onions, sour cream- and it really amps up the salty savoriness. My friend got the borscht which was really yummy and flavorful. I'll be back in a month when my parents come to town and I treat them to a meal (I'm so broke don't judge me).", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/MmmU9Bt1TLThttv5GkffJA/348s.jpg", "caption": "Mushroom, spinach and meat, cheese pierogis with polish sausage"}]}}, {"review": {"des": "The reviews for this place don't lie. Pierogi Heaven was awesome. We got 12 pierogis in an assortment of flavors (meat and spinach, sauerkraut and mushrooms, sweet cheese, and potato and cheddar) and the sausage special. All the food was awesome but the potato cheddar pierogis were our favorite. I'll definitely be back the next time I'm in Chicago.", "pics": null}}, {"review": {"des": "Great value and delicious. People are nice too. I highly recommend.", "pics": null}}, {"review": {"des": "I give this 3 stars because I asked them to fry the pierogies and they didn't. I know they would have tasted better if they were fried. We were the only ones in there for dinner. Not much business at night  I guess. The kielbasa it was alright, not the best though. I am Polish so I am a pierogi snob lol. I've definitely had better though. It wasn't bad, but not the best I've had though.", "pics": null}}, {"review": {"des": "These were my first ever pierogis so I can't speak to their authenticity or anything. But I can say I appreciate how warm and friendly the staff was; they seemed to be genuinely enjoying themselves. My favorite pierogis were the potato cheddar and meat spinach. I wished I had put hot sauce on them, they needed a bit of a kick.", "pics": null}}, {"review": {"des": "Nice place to grab a quick lunch in the loop.  Ordered take out thru eat24.  Food was ready when I arrived and was well packaged & hot.  Went with the Spinach and meat Pierogi & a kielbasa (get it!) Pierogi were very good, but wish you could get pan fried.", "pics": null}}, {"review": {"des": "We came here on a late afternoon on Sunday because pretty much everything else was closed in the loop and this place had great reviews. We got the 3+3 Perogi deal which allowed us to pick 2 different perogis. We ordered the meat & spinach and the potato & cheddar perogi. They top it with fried onions and bacon, as well as give sour cream on he side, which add to the flavor. I would also recommend dipping in hot sauce for an extra kick. I've never had perogi before so nothing to compare to but both of these were good, soft, tasted fresh. My main complaint is that they were SOOOO greasy. Well there go all the calories I burnt working out earlier...we also got the sausage which was average and also greasy. We didn't want a heavy meal, just something quick so we were able to split 6 perogis and a sausage between 2 people. For a full meal I would get more than that. Prices here are very reasonable and service is good.", "pics": null}}, {"review": {"des": "So happy places like these still exist in the city since huge chain restaurants are taken over..when you first walk in it's a really simple spot I can tell it's family owned. The menu is written in chalk and there's about 2 employees so super small. The food is served in paper plates and you get plastic silverware to eat with but who cares when the place is absolutely incredible and so authentic they really do kill it in the kitchen def coming back can't give it anything less than 5 stars!", "pics": null}}, {"review": {"des": "I love dumplings - big dumplings, small dumplings, colored dumplings. But never have I ever had a polish dumpling, so I came in to make sure I could say I have. I was very pleased. We tried every savory dumpling on the menu from cheese to meat and they were delish! My favorite was potato and cheese.<br><br>Make sure to get the tomato sauce with mashed potatoes and a side of polish sausages to complete your time in heaven before you go back into the cold cold world.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/zqzI56fga45BrKDuJKm26Q/348s.jpg", "caption": "Dumplings and sausages for lunch."}]}}, {"review": {"des": "Wow! Go here now. Run! <br><br>If you've been looking for an easy polish diner with amazing homemade skills this is it. It's in a busy part of town but it's right next to a parking garage. Park and walk out in Wells and boom it's right there. <br><br>Nothing special about the atmosphere but I came for pierogis and kraut not decor. I ordered two meals to spilt. One was 9 pierogis (3 potato and cheddar, 3 potato and farmer cheese, and 3 kraut) and I ordered a polish sausage, kraut, and mashed potatoes.<br><br>They ask if you want the onions on top of everything you order and you gotta do it. And get the bacon on top the pierogis. Don't forget sour cream. <br><br>Can't wait to come back. It felt like my grandmas cooking again. The young guy who make my to go containers was a cutie and super helpful. <br><br>PepsiCo products. No Coke.<br><br>And that's all I have to say about that. <br>Jackée", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/z7Zi8onIf3AHn9c5R-pKaA/168s.jpg", "caption": "Mashed potatoes, onions, sauerkraut and polish sausage."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/bxkPMhPy44ZkFjhmYFOzQA/168s.jpg", "caption": "Assortment of pierogis with onions and bacon on top."}]}}, {"review": {"des": "Liked the quality of the pierogis. Has good options for vegetarians as well.", "pics": null}}, {"review": {"des": "This is the only pierogi place that I know of, and I've had it once. I'm already obsessed!<br><br>I got the six pieces potato and cheese pierogi ($7) topped with bacon bits and fried onions. It was heavenly carbful and I wanna go back soon already. Certainly not healthy, but it's food worthy for the soul.", "pics": null}}, {"review": {"des": "What a cute little place with great food. We had an assortment of pierogies and a sausage platter. It was a lot of food. Next time we will just add a sausage and sauerkraut to a pierogi platter. Best flavor was the sweet cheese followed by the potato and cheese.", "pics": null}}, {"review": {"des": "Best pierogi, ever.  Many savory varieties, and some sweet.  Also good borscht and sausage.", "pics": null}}, {"review": {"des": "Pierogies were legit!  However maybe take to-go if you don't like the dank smell of kraut.", "pics": null}}, {"review": {"des": "Hands down the best pierogis I've ever had!! We were here visiting from Michigan and came here twice during our stay for the weekend! Sooooo yummy!! Must try! Their sweet cheese is really good.", "pics": null}}, {"review": {"des": "I grew up in Western PA and grew up always eating Pirogi's. This place seriously put PA to shame. They were beyond delicious. The kraut ones were the best, but you can't go wrong with the cheese and potatoes. However, the meat ones were different. I felt more like I needed soy sauce because I related more to them as steamed dumplings.<br><br>Also, It was quick and easy to get in and out. I ordered, eat, and left in 10 min.", "pics": null}}, {"review": {"des": "Exactly as others described!  Small place with great Polish Pierogis!  Can't go wrong with the quality and price!  Give them a shot!", "pics": null}}, {"review": {"des": "Heaven is an understatement. My wife and I stumbled upon this place since it was right by our hotel and man did it not disappoint. These are legitimately probably the best pierogi I've ever had and wish they shipped! Will definitely be making a stop next time I am in the Windy City!", "pics": null}}, {"review": {"des": "This is a place you go for the food, not the atmosphere. I recommend to take the food to go. Most of the reduction of the \"star\" is due to the ambiance. <br><br>I went in right before closing and order my pierogi's to go. Both people helping were helpful and pleasant<br><br>I ordered meat & spinach, potato & cheese (recommended by the cook) and mushroom. It came with 3 of each flavor. They were all very good my favorite was the meat & spinach and mushroom. I probably wouldn't order the potato and cheese again. <br><br>They topped off the pierogis with bacon and sautéed onion. Sour cream is also an option but it didn't sound good to me. <br><br>The meal was filling. <br><br>I would also like to try the soup. I will be back and recommend it.", "pics": null}}, {"review": {"des": "Ordered borsch, pierogis, and mashed potatoes for delivery. Borsch was good but not the real borsch - it was only a broth with small pierogis inside. Pierogis with meat were very dry inside. Seemed like they were put in a microwave before delivery. Mashed potatoes bowl was OK.", "pics": null}}, {"review": {"des": "I grew up on pierogies made by little old Ukrainian and Polish ladies in a church basement and my grandmother. I know good pierogies and have never found anything that has come close to those ones... until now.    This is a special place as they obviously know the secret to a great pierogi.  The dough is perfect, melt in your mouth and the insides flavourful.  And of course, they offer the genuine accompaniment of fried bacon and onions.  The perfect way to serve pierogies.  Don't miss this place if you are in Chicago.", "pics": null}}, {"review": {"des": "Was disappointed with this place! I love pierogies and when I found this while walking to one of my classes I was super excited. Went there at around 12:45 on a weekday, and got some really soggy pierogies and sad looking pierogies, tried the potato cheese, spinach and the fruits. I added onions on top too but nothing could salvage the taste. I've had market bought frozen ones that tasted better.<br>I was expecting a lot more given their awesome ratings on yelp.", "pics": null}}, {"review": {"des": "So stinking good! As two Polish girls, my sister and I were thrilled to see a Pierogi place on yelp while visiting Chicago... We weren't disappointed!!!", "pics": null}}, {"review": {"des": "Pretty good. I liked the variety and my favorite was mushroom and sauerkraut. I would prefer being able to choose from the entire selection rather that only picking 2 variety's for 6 tray or 3 varieties for 9 tray. It was disappointing we couldn't try more. Due to this they lost a star.", "pics": null}}, {"review": {"des": "Normally I would give this place a 5 star as this is one of me favorite lunch place. However two days ago, I decided to try a different non traditional Pierogi. The spinach and meat one, normally I always order the meat and the sour kraught, the classic ones. Then after that I immediately had food poisoning and it's been two days now and I am still sick. I didn't even have dinner as I lost appetite. Whatever the process of making the food, please ensure cleanliness. My guess is there are so non traditional Pierogi that are not often ordered by customers and are sitting out for too long. But who know? All I know is I've been sick for 2 days with diarrhea", "pics": null}}, {"review": {"des": "Being Polish and growing up eating my grandparent's homemade pierogis I am a bit spoiled but I'm always down to try other pierogis.  Thankfully Pierogi Heaven delivered a good product.  It's a bare bones operation but they have a variety of good choices.  I got the sauerkraut and meat options and was not disappointed.", "pics": null}}, {"review": {"des": "Simple and delicious! Many flavors of pierogi to choose from, but the menu is delightfully small and simple otherwise!<br><br>We stopped in on a quiet Sunday morning when not much else was open in this part of the loop. You won't regret it.", "pics": null}}, {"review": {"des": "I had a busy day planned in Chicago so I decided to grab a quick lunch here since I never really had proper pierogi's before. This place had all the pierogi made so when you ordered they just gave you the ones in the warmer. This to me is good since that means less wait time. The place itself is small with only a couple of tables and I lucked out with my friend and was able to grab a table. I ended up going with some pierogis with a side of bacon and sour cream. There are a variety of pierogis to try but I decided to try the 3 meat, 3 meat and spinach and 3 cheddar and potato. They were very hearty and filling and worth a try if you have never had it before.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/iTqH5V9ulX3ybYUh04pPkg/348s.jpg", "caption": "Pierogi with 3 meat, 3 spinach and meat and 3 potato and cheddar with all the fixings"}]}}, {"review": {"des": "Pretty pretty pretttttyyyyy good. The mushroom ones are absolutely fenomenal. Others good as well. As a Pole--approved.", "pics": null}}, {"review": {"des": "I love Polish cabbage rolls and Pierogi Heaven the closest spot to the loop to get it.  I was craving something very warming and filling, the cabbage rolls here is the perfect comfort food on a cold day.  Highly recommend!", "pics": null}}, {"review": {"des": "I love pierogis. Love them. I crave them all the time. My maternal grandfather is Polish so maybe that's why but either way, I felt like I discovered manna from heaven when I walked in here. Not kidding. <br><br>I ordered a 6 count (I could have eaten double this but had to restrain myself) of spinach and pork pierogis with onion and bacon (no sour cream). Amazing. So, so amazing. Perfectly seasoned. The dough was superb. Oh my gosh, my mouth is watering typing this. Sadly, I live in Tulsa and would drive to Chicago again just for these beauties. <br><br>Go here. Eat all the pierogis. Rejoice and pat your happy tum tum.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/UCeDlrdFfTluEM0MSUfDzA/168s.jpg", "caption": "My version of heaven includes pierogis indeed."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/EsPI3tDUHA_k9RPSe-wwgQ/168s.jpg", "caption": "Spinach pierogis!"}]}}, {"review": {"des": "Man, I hate going into the 2/3 star zone but I cant help but feel like I was maybe a little mislead? Positives are that the pierogis were inexpensive and filling and the people behind the counter were great, but the negatives are that the filling was dense and lacking in flavor. I appreciated learning a bit about the food, but if you bite into it thinking you're getting a ravioli-like texture, and instead get something closer to an over processed piece of dry sausage (best I can do on the description), I think it just caught me by surprise. I would go back only to see if this was an off day, but it will have to wait.", "pics": null}}, {"review": {"des": "I came here on Memorial Day (yay for being open)! Conveniently located, I came after doing a walking tour of the Loop. Order first then sit down with your food. I got 9 pierogis and tried 3 flavors. I got meat and spinach, potato and cheese, and kraut and mushroom (listed in the order of my preference from least preferred to favorite). The first time I ever had pierogi was in Poland, so my standards might be a bit high. The skin here was a bit thick, and it was really oily. Also, they offer onions, bacon, and sour cream on the side, and I just took the onion because I don't like the latter two. Anyway, flavors were okay, quantity was alright. The price is pretty high, coming out to be $9.85 post-tax (more than $1 per pierogi!). I heard there's a big Polish population in Chicago, so maybe check out another place.", "pics": null}}, {"review": {"des": "So glad I finally tried Pierogi Heaven! This was an unexpectedly delightful (and cheap) lunch.<br><br>It's a no frills kind of place, but from the reviews I knew I'd be getting some good home cooked Polish food. I stopped in at about 12:15 pm on a Wednesday. There were like four people in line ahead of me but the line went fast. It's a small restaurant. If I could guess, I'd say it seats about 25 people.<br><br>The menu is simple and includes pierogis in 11 different flavors (you can order 6, 9, or 12 pieces) that come with fried onions, bacon, and sour cream. They also serve red borscht soup, Polish sausage, stuffed cabbage, and mashed potatoes.<br><br>I went with an order of 6 pierogis -- three meat and three potato and farmers cheese. The fried onions and bacon came on top and the sour cream was served in a cup on the side. They have a fridge of beverages so I snagged a bottle of water as well. Total cost of lunch? Drum roll please... less than $8! Sweet!<br><br>Their pierogis are amazing, so calling this place Pierogi Heaven is totally on target. I really enjoyed both the meat pierogis and the potato and cheese. At first I thought the the potato and cheese would be too bland, but the bacon and onion are the perfect addition to spice things up a bit. Six pieces were just the right about to fill me up mid day.<br><br>Definitely adding Pierogi Heaven into my weekly lunch rotation. Fast + delicious + cheap = a win in my book!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/R7LxPD0MJcjED8yZMnPC2g/348s.jpg", "caption": "Six piece - 3 meat, 3 potato and cheese with bacon, onion and sour cream"}]}}, {"review": {"des": "I have had better Pierogis out of a box!<br>The sausage my husband had looked and tasted as if it was made yesterday. I'm not Polish but I married one. I have cooked much tastier Polish food than this place!", "pics": null}}, {"review": {"des": "An authentic taste of Chicago at a great price, you can literally fill yourself up on tasty pierogis and spend less than $20. With so many flavors to try, it is impossible to taste the full range of wonderful flavors in one visit. While there may be some bonafide pierogi connoisseurs who may rightly disagree with my assessment on the dumplings, you'll be hard pressed to find a better bowl of borscht downtown. It's the sort of tonic that will bring you back to life and put a heathy glow in your cheeks on a crisp Chicago day.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/7EFqyuxntIJ7QN_KUpZffA/168s.jpg", "caption": "Try all the flavors!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/VQ2FU4AOMwqsu2jvZU5vKA/168s.jpg", "caption": "3 x 3 combo: spinach and meat, mushroom, and potato and cheese with a cup of borscht on the side."}]}}, {"review": {"des": "I was fortunate in that this place delivers (Eat24). I ordered the stuffed cabbage, meat and spinach pierogi and a small Polish sausage. Everything was so delicious! The portions were generous and each bite was extremely flavorful.", "pics": null}}, {"review": {"des": "Cafeteria quality.  <br><br>We were excited to have Chicago Pierogis and ordered both their cheddar and farmers cheese filled version. <br><br>After one or two bites, we left the food mostly uneaten and moved on.", "pics": null}}, {"review": {"des": "I had the cheese and potato Pierogi and it was everything I wanted and more. I needed some comfort, filling food and am not super familiar with Chicago but I do know the food scene is insane and this was no disappointment. They made it so quickly and even the bacon and onion add ons were little treats that made the whole experience phenomenal.", "pics": null}}, {"review": {"des": "The name says it all. We walked over 30 minutes to get here and I would have Wales double that for this food. AMAZINGLY DELICIOUS! I wish I was more hungry! We had the mushroom pierogi and the potato and cheddar. Get the bacon, onions, and sour cream if it appeals to you. Man, this is super delicious. I might need to go get more...", "pics": null}}, {"review": {"des": "Let's call this: the lunch of broken dreams. I had very high hopes coming in, but was disappointed.<br><br>A PIECE OF BONE IN A PIEROGI. Now, that's unacceptable. I almost broke my tooth! Now, I've found worse things in pierogis before, such a nail, but I want to eat these things without having to worry about every bite.<br><br>MEAT PIEROGI WERE MY FAVORITE. I wasn't a fan of the cabbage potato and cheese ones. They were way too sour for my taste. <br><br>NOT TOO BUSY. I was surprised, even during peak lunch hours on a week day, they were not even at half capacity.<br><br>So sum it up, unless you already scheduled a dentist appointment right after lunch, you probably don't want to come here.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/1j27skoHyDnbkDgaLZ8GbQ/348s.jpg", "caption": "Assorted Pierogi"}]}}, {"review": {"des": "We had the kraut and sausage, borscht, kraut and mushroom, cheese and potato, and sweet cheese pierogis and they were delicious! Hit the spot! Coming back for sure !", "pics": null}}, {"review": {"des": "It's a small joint for lunch or early dinner, they don't stay open too late. The place is basic and simple, the service is fast and efficient and the food is good. Tried the Pierogi \"sampler\", 3 of each cheese, meat and potatoes, loved them all! Tried the sausages also and the cabbage rolls, all really good! Must try if in the area", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/gk4Zo84b6AXfIe5NolUG6Q/348s.jpg", "caption": "Pirogies and Polish sausages"}]}}, {"review": {"des": "I love me a good hand man pierogi!  Place is small, but the pierogis make for some quick eating to fill your belly up then move along with your day.  We order 4 different kinds and told the waitress to give us the top 4 kinds.  We tried the cabbage, meat, potato, and cheese.  They all were tasty but I enjoyed the potato and cheese the best - it was nice a creamy and was the prefect meal for this cold spring day in April.  I noticed a lot of people coming to pick up food they preordered, more than people coming inside to have a sit down meal.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/acwFNZrFWxmqE-l3MUTa7A/348s.jpg", "caption": "Mix"}]}}]}