{"name": "pleasant-house-pub-chicago-3", "reviews": [{"review": {"des": "My husband and I brought a couple friend of ours and we all loved it! We all had the kale and mushroom pie - thick pie crust but soft enough to go well with the filling and not go soggy. Filling was nice and creamy and really good blend of the ingredients. We also added mashed potatoes and peas as sides to go with our pies and made it even more amazing. I love their curry fries even more! Just enough crunch on the outside and very soft inside. Good seasoned fries and curry was a nice touch. <br><br>I also don't typically like ginger beer but their ginger drink was nice and refreshing. Not your typical strong flavor but you can still taste the ginger. <br><br>The place itself was nice - not too crowded when we were there. Our waitress was personable and attentive. Very quaint feel with the lights and outdoor feel where we were. Bathrooms were top notch! One was almost all gold lol. <br><br>A place to return to for sure.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/_NFKvCEkRV9Vh4iFTlqBoA/348s.jpg", "caption": "Menu"}]}}, {"review": {"des": "Perhaps because I was subjected to frozen Swanson chicken pot pies as a wee lad, but meat pies were never something I ever thought could be notable.<br><br>But then I visited Pleasant House.  And my life was forever changed.<br><br>The meat pies here are savory and spectacular.  The steak and ale pie has a depth of flavor so vast you'll find it staring back at you.  Unbelievable.  The mushroom and kale pie is so rich and earthy you'll swear it must be filled with flesh.<br><br>You can also get them frozen to go, and they travel and reheat oh so well.  You'll have a delicious pub evening at home!<br><br>There is a well curated selection of Continental beers and Domestic crafts from which you may choose, and the cocktails are solid.  My noble bourbon boozers will do well to order a Black Manhattan, should the Averna still be in stock.<br><br>Locals are lucky; for others the Pub is worth the trip.", "pics": null}}, {"review": {"des": "Being somewhat close to home, this is an easy Friday night dinner for us that generally won't disappoint.   We've tried a few different things here and some plates are better than others:  the fish fry is for sure our favorite in the city.  We came once at 8pm though and they were out!? Very disappointing.  I had to settle for bangers and mash which was good but didn't live up to being the best I've had like the fish.  We've also had the burger a couple times which we have mixed feelings about.  It's good but again not a stand out- the last time we were there it was served with some pretty hard buns like they were stale? And they make their own bread so that was a little off.   We have also had the infamous pot pies which are comforting and won't disappoint.  <br><br>I love coming here everytime and sit in the main dining room (not the patio) because I just love the decor and vibe.  Generally they are never too busy to seat us right away.  So overall a great and easy spot for a night out with your spouse or with a small group.", "pics": null}}, {"review": {"des": "Delicious curry of the day! Staff was really friendly and the ambiance was lovely. I was happy that there were a couple vegetarian options for being a pub. Will definitely return.", "pics": null}}, {"review": {"des": "Everything about this place is great. The food is good and tasty, simple yet sophisticated. I had the cold pork pie with pickles and it brought be home at the first bite.<br><br>Staff is nice and friendly. The place has a lot of personality, the decoration is nice. They also have the most beautiful bathroom I have ever seen in my life! Go check it, it's worth it.", "pics": null}}, {"review": {"des": "I'm torn on my rating of Pleasant House Pub. Overall, it was a good experience, but I don't think it's worthy of the 4.5 star rating on Yelp. The only reason being is the recommended pie (curry chicken) lacked flavor. Not only was it not bold, but it really did taste like nothing. Despite that, here's other reasons why you should go:<br><br>- Neighborhood: It's just south of East Pilsen on a strip of several other restaurants and businesses. <br><br>- Atmosphere: It's a beautiful space. There's an outdoor patio and an inside dining area with a bar on one side and beautiful marble tables and window seating on the other.<br><br>- Drinks: Their drink menu is excellent and their draft sangria comes in a giant glass goblet and is among the best sangria I've ever had.<br><br>If you like beautiful environments and sangria, go here. If you want flavorful food, walk a few blocks to Ca Phe Da.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/v3R-G13aYl5mHQ8LD3Qbew/348s.jpg", "caption": "Window seating."}]}}, {"review": {"des": "This place is so chill and the food is fantastic. Came here for brunch, they got a simple menu and the food is modern with a British pub style twist. We got eggs Benedict, the cure and poutine. Everything was made with high quality ingredients and full of flavor. The poutine was so incredible we wish we had room for another plate. <br>Got a mimosa and bloody marry with my food, both tastes great, not big on garnish but it works with their minimalist style. <br>The location is not in a busy neighborhood, lots of street parking. <br>Can't wait to come back here for dinner!!!", "pics": null}}, {"review": {"des": "I've tried the Steak & Ale royal pie and thought it was very tasty. The crust was buttery and melted in your mouth. The pie filling was also very good. The other items on the menu don't taste as good. For example, the curry chips and bubble cake are a bit too oily. On their own, the pies deserve five stars. <br><br>The service and ambience are also great. We had dinner there fairly close to closing time. When we were about to head out, the server gave us 4 free pies because the kitchen had some left over. That's great service.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/qHcz8oWDEgBwMmfU7CNuNw/348s.jpg", "caption": "A crowned Royal Pie!"}]}}, {"review": {"des": "Visit Pleasant House Pub at East Pilsen to get some authentic British food! <br>Their wide array of breakfast options, pies, sides and dessert along with late night pub snacks and drinks makes this place a great option for any time of the day. <br>We highly recommend trying their pies (Chicken Balti Pie and Steak and Ale pie are amazing! ), chips with gravy, scotch eggs, side of peas  <br>Definitely going back to try other things off their menu.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/UqVFHlyO-KNdEur8kbdnsQ/348s.jpg", "caption": "buttery peas"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/OK3JyBJa8C-lfRa78U0AYA/168s.jpg", "caption": "curry chips"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/TVKgMnKZ41F0CertL6wNHw/168s.jpg", "caption": "chicken balti pie"}]}}, {"review": {"des": "Do you feel like a jerk when your review goes against the Yelp grain? I usually don't, but this time I do. In part because the service and bartenders are all so friendly. Pleasant House clearly uses high quality ingredients too. So why only 3 stars? I just don't think the flavors meld well in the pies I've tried. They're all pretty and sound nice in theory, but could each be executed better. I've been three or four times and never had anything bad enough to send back, just not impressed.<br><br>I've never been to England, so maybe I just don't get the vibe. I remember when this location housed Nightwood. The decor is similar only in them keeping the dining area dimly lit. Those chef's closed shop and now run Giant in Logan Square. I was a huge fan. I swear that hasn't skewed my review, lol. PHB isn't bad by any means. I just can't say that I'd go outta my way to return. I'd rather stop here for a drink until Del Toro texts to say my table is ready.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ULeuTUpqnkWV2pvyoYjAeA/348s.jpg", "caption": "Cider & Rye - hot local cider with Rumi mulling spices and Rittenhouse Rye"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/I4qrXCKgOB-rD2zDrmTXqA/168s.jpg", "caption": "Cider & Rye - hot local cider with Rumi mulling spices and Rittenhouse Rye"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/IqhUt5QZZ4u1gIutZSolrQ/168s.jpg", "caption": "Cider & Rye - hot local cider with Rumi mulling spices and Rittenhouse Rye"}]}}, {"review": {"des": "I'm a big fan of this place!  I had been to their old location in Bridgeport, so I was excited when I found out they relocated here.  The pot pies are delicious, and they also have a great drink/beer list.  Service has been kind when I've come, and the decor is adorable.  Definitely recommend!", "pics": null}}, {"review": {"des": "My friend is obsessed with anything and everything that has to do with the English and their culture, which is a winning reason why a group and I came here on a Friday evening.<br><br>Upon arriving, the hostesses asked which room was preferred: either the room that looked like a proper pub but with a more rustic barn look or the dimly lit garden with string lights. Ding! Ding! Ding! The garden was the winner! <br><br>Tip: During winter, grab a table with a blanket! You'll thank me later. <br><br>I got the kale and mushroom pie which was filling and savory. I thought it was a bit too salty though inside the pie, but the crust was the right amount of buttery and flaky. One pie was a meal itself. Also got their moscow mule which was okay. I tasted my friend's gin & tonic which was better than what I got. The  moscow mule was too sweet for my liking and I think it's the Royal Ginger Fizz that they use.<br><br>If you're in the area, definitely give their pies a go!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/vFugxjwM-1T6z39rWmQTOw/348s.jpg", "caption": "Look at that pie though"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/cavUMZV7mjghNxKtgRWKZw/168s.jpg", "caption": "Mushroom and Kale Pie"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/fCBbhFp7l66rqoZNKrmtxw/168s.jpg", "caption": "Garden area"}]}}, {"review": {"des": "Came here mostly because it was near the Pilsen Art Walk and was on a list of recommended places to eat.<br><br>Honestly I was a little bit apprehensive about trying this place because English food is stereotypically bland and uninteresting. But I heard some really good things about their pies and \"chips\" (also my friend is obsessed with all things British).<br><br>I was ~pleasantly~ surprised by my experience at Pleasant House Pub! I got the Steak and Ale pie and the curry fries and neither disappointed! Both were bursting with flavor. The chips were beautifully crispy and generously coated wth curry sauce. The pie crust was buttery, flaky, and warm and the steak and Ale filling was tender and a perfect balance of sweet and salty. <br><br>There's plenty of seating around the place. They've got English style benches and tables to make this more of an authentic English experience (I've never actually been to the U.K. So I'm just imagining this is what pubs are like over there).<br><br>Service was a little slow since they were slowly becoming busier as the night went on, but overall it was good. I'd be down to come back to try another pie!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Ab506vhzaz97AqYbYwLnAA/348s.jpg", "caption": "Curry Chips"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/DVVKD_HUBe1tp8wszm0VOQ/168s.jpg", "caption": "Steak and Ale Pie"}]}}, {"review": {"des": "Food and drinks were great! I had the pub burger which was full of flavor. I also had the draft sangria which was delicious... My only downfall was that this place was listed as kid friendly however there isn't a kid's menu ... The service was great and the waitress did try to accommodate my son with his order. I would totally go back without my little guy...", "pics": null}}, {"review": {"des": "Love the new space they moved to!   What a fabulous lunch today!!!   My husband had the steak pie and I had the Pub Burger.   Delicious!   I don't know the name of it, but I had the rum drink on their cocktail menu and it was really good.   Look forward to returning!  <br><br>Back again .   In addition to the Pub Burger, has the Bubble Cake which is out of this world delicious!!!!!    Also tried the Mac & Cheese which was good also.   <br><br>Finally had the fish and chips!    So good!   Had the delicious bubble cake as a starter.  They updated their cocktail menu.", "pics": null}}, {"review": {"des": "I've been waiting on Friday every since Monday just so I could go to Pleasant House to get my Fish and Chips fix.  I know many RAVE about the fish and chips at this other joint owned by a short man and tall man but they haven't ventured to Cermak and Halsted for this beauty!<br><br>The first time I tried the fish and chips here, the fish never made it home because I killed it in the car and had an attitude an hour later when I had to eat my perfectly fried chips on their own with the curry sauce.  Lesson learned!  Order an extra piece next time and place the bag on the back seat behind you so you CANT eat it in the way home!  Now let's get to the food!<br><br>Fish fried perfectly and the chips were crisp with just the right amount of salt!   God bless the cook who fried it all!!  <br><br>If you want phenomenal fish and chips, you don't have to trek up north, just head to south Halsted, grab a beer, and wait for fish and chips nirvana to come out the kitchen'.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/UkMItWPMkmb70wfZu_qCCg/348s.jpg", "caption": "Didn't slip up today, ordered an extra piece of fish!!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/dhz76n3AulVH-szJwiAAuw/168s.jpg", "caption": "Fish and Chips"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/dnPYq1BOnbZBKx5plkZ3-g/168s.jpg", "caption": "Mmmmm, potatoes!!!"}]}}, {"review": {"des": "So this place moved to a larger, much nicer location on Halsted just off of 22nd St. The two stars is for the 'pleasant' decor.<br>The food I would give one star. It was not 'pleasant'. I ordered one of their pies with some chips. The Chicken Balti Pie, and the Curry Chips. <br>Let me say the pie might have been dryer than dust. It was awful. And it was small, basically a little smaller than a muffin. The curry chips were just OK. The tab came back to a little under twenty dollars, without tip or anything to drink (I drank almost a entire carafe of water, because there was zero moisture in the pie). So with tip, twenty four bucks.<br>Nah..... They need a kitchen intervention, seriously", "pics": null}}, {"review": {"des": "I try to be as constructive and fair when I do a review. I'm a Brit and knew this was British inspired so did not expect the food to be *exactly* like in the UK. I was torn between giving 3 and 4 stars (I would give 3.5) but judge it firstly on what it is most for, the pies.<br><br>The good: The decor has been really nicely done, excellent service, food came out quickly, great beer selection (including some British imports). The pastry crust on the pies was very good, they have nailed that. The sticky toffee pudding was delicious (would be nice with custard but you can't have it all!).<br><br>The let down was the pie fillings. I had the Cornish pasty and it was very bland, completely lacked the pepper punch it is known for. My wife had the steak and ale pie and also found it to be bland, lacking that tasty tangy ale flavored gravy. <br><br>I might try the place again with other things off the menu. It ticked so many boxes but was let down by the 'main event' of the pies.", "pics": null}}, {"review": {"des": "I recently returned for a visit to the new Pilsen location. I absolutely love the new location vibe. The food was still amazingly delicious. Chicken balti pie and curry fries really hit the spot. We went in around 3pm on Friday and the service was a bit slow but the food definitely outweighed this.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/gX8k--q0zwkMVFjvW4xBqQ/348s.jpg", "caption": "Sangria"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/gIlEbwdcOixUCzXtvuf0wQ/168s.jpg", "caption": "Curry Chips"}]}}, {"review": {"des": "I originally put Pleasant House Pub on my food itinerary based on a craving I had for fish and chips, but ended up going a different route. I ended up with the Steak & Ale Royal Pie and a Bubble Cake to share. Since it was Tuesday, their Burger & Beer day, my fiance opted for that and really liked their Pub Burger. It is, however, a lot of food, and he couldn't even finish it. I enjoyed my pie, and we thought the Bubble Cake was delish. <br><br>I don't recall what my fiance ended up for beer, but I actually got two drinks - Royal Ginger Fizz and Lavender Lemonade because I love ginger ale and also love lavender-infused drinks. Both were excellent, and I recommend getting either of those if you're not into alcohol or get stuck being the DD.<br><br>I wasn't sure what to expect when I got here, but the server was super nice. The restaurant was empty, except for us. I guess we got here a little early for dinner. Either way, if we're ever in the area again, I would definitely stop by again.<br><br>Overall: 4/5<br>Food: 4/5<br>Service: 5/5<br>Atmosphere: 4/5", "pics": null}}, {"review": {"des": "This place is awesome! I've been here twice for brunch and wonder why I haven't eaten here at least once a week...it's that good! First time I was here I had the eggs benny, which was delicious. The last time my girlfriend and I split the scotch egg, curry and deluxe gravy chips. Right there was enough to leave satisfied but then we each had one of their Royal Pies. I had the steak and ale pie which was perfect. The pie was flaky and cooked just right. I will definitely be coming back to this fantastic pub!", "pics": null}}, {"review": {"des": "This place kills me. So amazing. Amazing food drink and staff. Just came back after 6 months away and I'm committed to becoming a regular again. Just the best.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/d-JSK3VDnOYLBi-Hg4B4gQ/348s.jpg", "caption": "Extra Royal potatoes made with a wink."}]}}, {"review": {"des": "Loved this place when it was a tiny walk in spot next to Maria's, and I still love it. Always happy when a neighborhood spot finds success!<br><br>First off, the decor and feel is amazing. Very warm feeling, and almost rustic, though I hate to use that word. Servers were friendly and ready with opinions on drinks and food. We were given space, yet still felt tended to. It was a weeknight, and it was pretty empty, so we could've been smothered, but we weren't.<br><br>Decent beer list, but the house made cocktail list was impressive. I had an old fashioned to start and it was very well made. <br><br>For starters we had some sour dough bread that was covered in melted beer cheese. If heaven had a taste, it was this. I could've ordered two, but we also had a Scottish Egg, which I recommend cause I assure you you have never had anything like it. Think, pork wrapped hardboiled egg, and fried. Take your blood pressure meds, and blood thinners. Then we had some house pickled veggies, which worked nicely to off set the salt of everything.<br><br>Dinner was exceptional. I got the classic steak and carrot meat pie, crowned with a royal heap of mashed potatoes and gravy. It looks small, but it is decadent and rich. Fills you up, and makes you feel like you;re wrapped in a blanket of carbs and calories. The crust is flaky and buttery, and if you had to eat enough of something that could kill you quickly, you'd be hard pressed to find something better. <br><br>Overall, the place is a great neighborhood staple. Enjoy Pilsen! Great food and drinks! Good people! I cant wait to try it in the summer, and see what the open air feel brings to it. Highly recommended!", "pics": null}}, {"review": {"des": "I still love the pies here, but the price increases has made them lose a star for me. A year ago it was $8.50 for a pie plus $2.50 to crown it with a scoop of mash potato and gravy. Then at some point it went us to $9.50 for the pie and $3 to crown it. Today we went for brunch and it was $9.50 for the pie still but $4.75 for a single scoop of mash and gravy?! within a year to go from $11 to over $15 seems stiff (+ the added increase in tax and tip that comes with increase). Getting 2 pies with mash and drinks means you're now paying $50+ incl tax and tip for a casual bite.<br><br>It doesn't seem to be hurting business as all the hipsters are willing to pay for it, and it is good quality food but for us it'll mean it's now not going to be as often as it used to be. <br><br>I'll still be coming for the delicious pies (as an aussie I have to get my meat pie fix somewhere!) but I'm sad they have changed so much from the little bridgeport pleasant house bakery we loved. But more power to them if they can make more $$!", "pics": null}}, {"review": {"des": "A pleasant morning at Pleasant House Pub.........<br><br>I've had their pasties when they were in Bridgeport.  I'm a carnivore by nature but a eating machine by heredity.  But the mushroom - kale is nirvana esp when piled up with their mashed and peas.<br><br>Now upwards and onto  for brunch --<br><br>Good Bloody Mary   - with pickled cantaloupe.  Great cask conditioned ale on tap and even better house cured bacon!!  This was some of the best bacon I ever did eat.  3 orders. Sitting at the bar I spied the dishes coming out of the kitchen and for the prices on the menu the food looked spectacular.  The next time I stop in I will have a more traditional meal.  I hear the burgers are heaven.<br><br>I took a couple pastries home.  One was a version of a klunker -- thick dough and lots of icing and a crunchy texture on the outside and a smooth interior.  BUT if you go and they have the brown butter crowns - you better buy some.  It's the closest thing to having creme brulee' but in a version you can hold. Damn THEY WERE the bomb................  Best leave some for me....", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/UvHzxXBFPfCsThVPKfaD-A/348s.jpg", "caption": "mo mo mo bacon!!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/NolSzL_xc5SxGgp0PgnwkA/168s.jpg", "caption": "more bacon"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/1KfUQFl47rnRmYwOgr1vHQ/168s.jpg", "caption": "BACON"}]}}, {"review": {"des": "Fish fry is amazing!!! But the pies are what they're known for. I love savory pies and this place caters to the craving everytime!! I love their steak and chicken pies the most. Don't forget the coriander chutney for the pie. Also try the chocolate laced oatmeal cookie for dessert!!!!!", "pics": null}}, {"review": {"des": "I discovered this place a couple months ago when I was looking for food near work. My first meal was a specialty pie for St Patricks day, came back to try their beef and chips. Great homemade individual pies, and had their lavender lemonade. <br>Kinda pricey, but worth it for the freshness and very delicious!", "pics": null}}, {"review": {"des": "This place has been on my to-visit list, and I'm finally glad to make it happen. We came on a Sunday evening around 6:30pm, and all the tables were full. However, there were two open seats at the bar for us. It was a bit awkward in that all the beer dispensers were located in front of us and were a huge barrier between us and our server/bartender. He literally had to reach over the dispensers to give us waters and talk through the spaces between the dispensers to take our order.<br><br>The inside of the restaurant is like a cafe when you first enter. There's a separate main dining area to the right. The bar is located between the dining area and kitchen, which is where we sat. The ambiance might be more romantic at night, but not as much during the day when the bright sunlight was illuminating the restaurant.<br><br>The service was pretty slow at first. It took some time to get acknowledgment and our orders taken. That's what happens when you're working a dual role I suppose.<br><br>We decided to order the following items:<br><br>- Steak & Ale Pie: Though it wasn't bad, it didn't impress us either. We felt that the steak was too dry. On the other hand, I liked the crust.<br>- Premium Steak Pasty: This was our second favorite dish. It was pretty savory and pleasant. The steak was more tender and moist than what was inside the Steak & Ale Pie.<br>- Deluxe Gravy Chips: This was the best dish out of all three, though it was a side and not entree. It's a decent portion to be shared. The beef on top was tender and juicy while the potatoes were nice and crisp. Everything just worked well together.<br><br>Though the portions look small, these three dishes were enough to make us both full. I think it's because they're all heavy dishes.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/GtNwt9xgOHuRukmnP5kdjg/348s.jpg", "caption": "Premium steak pasty (left), steak & ale pie (bottom), deluxe gravy chips (right)"}]}}, {"review": {"des": "Cheers love- this is one place on Halsted that is excellent for a chill night out!<br><br>I've passed by Pleasant House Pub many times usually on my way to Chinatown from the University Village area. Finally I decided to have a small birthday get-together here since I am into low key spots with good food and drinks, and this place was British!<br><br>My friends and I met up in the evening and it was a grand ol' time. We had great service that kept checking in on us even though we weren't sitting in the main dining area. The outdoor patio is perfect in the summer with great people watching opportunities.<br><br>While I wasn't hungry, I did try their Scotch Egg which was divine- a fried egg wrapped in pork sausage and coated in breadcrumbs. For libations, I stuck with their Bourbon Drink all the night and it got me sufficiently buzzed.<br><br>Only major gripe is that there is a lot of construction happening next door beyond their control. If you're sitting in the patio, be weary that you may be competing with some unwanted noise during your time dining at this pub.<br><br>Aside from that, Pleasant House was great and I would definitely come back in the future.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/QDybczswyKBIy063z5bRmA/168s.jpg", "caption": "Scotch Egg"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/6qsgLwnKYrPjn2r5Waas9A/168s.jpg", "caption": "Bourbon Drink"}]}}, {"review": {"des": "To quote Professor Layton, British cooking may not utilize the flashiest of ingredients or spices, but a perfect exploration of simple, comforting flavors can stand against the cuisine of any other country's. That's what I got at Pleasant House Pub. <br><br>It had been a tough day of apartment hunting, and it turned out that Welsh Rarebit, a Green Salad, Steak and Ale Pie with Mashed Potatoes, and an order of Lemony Peas, topped off by a Boozy Strawberry Trifle and a Pimm's Cup was just what was needed to set my mind at ease. The decor and atmosphere manages to feel rustic and homey without leaning into inauthenticity. It was, in a word... pleasant!", "pics": null}}, {"review": {"des": "I have come to the new location a couple of times now. The space is wonderful - roomy and cute and good for any occasion. In my recent visit, my friend and I dined in early Thursday evening. It was just a tad busy at that time. We walked towards the bar and a delightful gentleman, who ended up being our server, told us to seat ourselves. We opted for a seat by the window. However, there ended up being a few ants there, so we relocated ourselves. We had great service throughout. He was very patient with us, especially since we took our time there and ended up staying for about two hours. Ambiance was great. There were a few other customers in the front room with us and we all conversed with each other (we weren't even next to each other), admiring the food. Great vibes.<br><br>We both got the mushroom and kale pies, crowned and enjoyed a Beligan Pale Ale on draft. They have a fantastic drink list...many local breweries and solid cocktails. Our orders came out very quickly. The pie was so tasty and proportionately perfect. While creamy, I didn't think the sauce was too much so nor too heavy. The mushrooms and kale were definitely noticeable. The mashed potatoes and gravy were classic although the gravy was a bit too salty for me. <br><br>Overall, you can't go wrong with any of their food items. I've tried all their pies now and I've heard great things about their burger from various people. I can only imagine how good their fish & chips are (Fridays only). Happy to see the upgrade from the old BPort location.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/F9G_WxIcLCf1wfp3yTeEMw/348s.jpg", "caption": "Mushroom and kale crowned"}]}}, {"review": {"des": "YUM. What can I say. I spent the weekend in Chicago and this was probably my favorite meal. The deluxe gravy chips were amazing. The chips were super crispy (they triple fry them) the beef and gravy was very rich and tender and the cheese was tangy and gooey. The scotch egg was wonderful and the whole grain mustard was vinegary and the perfect compliment to the egg and sausage. For my main dish I have the steak and ale pie and I must say I now believe that steak and ale belongs no other place but inside a pie crust! The crust was soft and flaky and so buttery and the steak was tender and the sauce and carrots were salty and rich and so delicious. I wish I lived here because this would be my new place! Oh and I almost forgot that I also had the Bloody Mary and it was fantastic also. It had great flavors, more than just spicy tomato and I really liked that it was made with gin and not vodka. Anyway if you live in Chicago you should go and if you are just visiting it's absolutely worth the stop!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/2bivR_C5OPfxTXzgXG068g/348s.jpg", "caption": "Scotch egg"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/0pum__EvPWIattodq1QE0w/168s.jpg", "caption": "Deluxe gravy chips"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/eZoMdU3eQhdQdeY7T5tF-A/168s.jpg", "caption": "Blueberry donut"}]}}, {"review": {"des": "I love savory pies, I love gastropubs, so I knew we had to make a stop here while visiting Chicago.<br><br>Pleasant House was a bakery, now a beautiful pub. English-inspired down to the William Morris (ish or actual) print wallpaper in the loos.<br><br>I was thrilled to see that they had a pork pie on offer, served with house mustard and Branston pickles, which definitely brought out all the savory flavors of the pie.<br><br>Hubs got a Welsh bitter. What's occurring? It was fine. I tried a Pounce! by Whiner Beer Co. Kolsh something something apples aged in bourbon barrels from 45th parallel. Interesting! Went really well with the food.<br><br>Triple-friend curry chips had a lovely texture. The curry was fragrant with nigella seeds and fresh coriander/cilantro.<br><br>Really enjoyable lunch. Wish we could have tried all the pies!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/d9_oxEC6sv74qH7PnYhM3A/348s.jpg", "caption": "Pork pie, curry chips, beers!"}]}}, {"review": {"des": "i loved the ambiance, the drink list, variety of appetizers.. was all splendid. the Old Fashioned was made really great. good selection of other brews. scotch eggs were Awesome.", "pics": null}}, {"review": {"des": "I'm sort of biased because my fiance first told me he loved me here, but even without that little detail this place is great!<br><br>I've been here for brunch and dinner and have loved both! I had a meat pie for dinner and was not disappointed. The flavor of all of the food here is on point. It's all so tasty from the donut and the potatoes to the scotch egg and the lavender lemonade. We've had a couple of times when the order was either not right or not what we were looking for and they have responded really well. That's good service!<br><br>The food is definitely on the heavier side, so for my friends with gluten issues, look elsewhere. I have a super sensitive stomach, but I definitely think this place is worth the cheat meal.<br><br>The ambiance is super chill and would be good for a night out friends, family, or a date. Can't wait to go back for the Friday Fish Fry!", "pics": null}}, {"review": {"des": "Bruh, this place is not your typical pub. Its a really hipster driven place actually that boast fancy cocktails, contemporary beats driven soulful music and a menu that screams old British food but taste super modern. <br><br>The staff were young, diverse, and friendly. The space has some semi outdoor sitting with park style benches and a more traditional indoor dining room. Mixed drinks start at $10.", "pics": null}}, {"review": {"des": "I was very disappointed! Given the Yelp rating we decided to give this place a try. We got: the Steak & Ale Pie w/ a side of Mash and the Breakfast Chips. All of which sounded good on the menu description. The food looked sooo tasty! But then we dug in. Everything was very very bland. Everything. I will say the service was great and the decor and ambience was cute and chill. I'm not sure if I'll be going back especially knowing how much I paid for tasteless food.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/gm1bZSAaMk5xYUopd8sT1w/348s.jpg", "caption": "Steak & Ale Pie"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/2a2i0IwjrX7EAryt4-soDQ/168s.jpg", "caption": "Breakfast Chips"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/HwXP69lBm2PX--n_0_BqCg/168s.jpg", "caption": "Menu as of 7/29/18"}]}}, {"review": {"des": "Great pub food, though crowning the pies with mashed potatoes is an additional $5 which can add up quickly. Worth it", "pics": null}}, {"review": {"des": "Food was too expensive for what you got. Drinks were great a little small. Loved the atmosphere, we sat outside in there open air area.", "pics": null}}, {"review": {"des": "We're suckers for house baked goods. Especially when those baked goods are stuffed with savory fillings that make us consider shipping a box across the country to hoard in our freezer for the rest of the winter. Just saying. Pleasant House Pub did just this with their excellent Royal Pies and unique, sunny space. Hearty pork curry inside a buttery, flaky crust helped fortified us as we prepared for a cold winter's day.<br><br>The salad was generous and croutons delicious but after sampling the pies we're not sure why you would want anything else.<br><br>Staff was accommodating and attentive.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/lOIIBvolpI-3gV0fKA5yWw/168s.jpg", "caption": "Curry Pork Royal Pie https://www.instagram.com/gents_whodine/"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/u-0f0okm1yM-b4VyxwLtVg/168s.jpg", "caption": "Pleasant Farms Green Salad https://www.instagram.com/gents_whodine/"}]}}, {"review": {"des": "This place should be on everyone's go-to list for satisfying any pie cravings. But they do a lot more than just pies. I didn't try their salads but they looked really appetizing. The atmosphere feels very rustic and casual- you go in and seat yourself. There's plenty of space and lots of natural lighting on a sunny day. <br><br>The Steak & Ale and Chicken Balti Royal Pies were both delicious, each portioned exactly for one person. The pie crust was baked to crispy golden brown perfection and very flaky when you slice through it. I found them both to be well seasoned with the right amount of salt. If you like a traditional beef stew filling in your pie, go with the Steak & Ale. If you're feeling like having some Indian curry flare in your pie, go with the Chicken Balti. <br><br>I've never had Scotch egg before coming here, but now I'm wondering why more places don't serve this genius idea of wrapping sausage around a soft boiled egg and dunking the whole thing in the deep fryer. The result is a magical combination of crunchy, creamy, and savory all in one bite. <br><br>I had to try their toast because I simply love bread. It was served with softened butter and the best house-made strawberry and basil jam I've ever tasted. Seriously, order the toast just to get a taste of their strawberry and basil jam.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/nlztixWVQhzsvsB1SLOWXw/348s.jpg", "caption": "Fig vanilla latte"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/sk7hLtTunyx4xaZvBL_7Ow/168s.jpg", "caption": "Scotch egg"}]}}, {"review": {"des": "WOW!!! My girlfriend and I were suggested to come here through the Thrillist website. When we walked in we were in awe of the venue. The patio area had picnic benches with open windows that allow for natural lighting! Inside is great too with unique chairs/tables. We chose to sit on the patio because the weather was phenomenal. <br><br>We ordered their specialty pot pies (Chicken spice) it had a curry flavor. The pastry they used had the perfect texture and the flavoring on the chicken wasn't over powering. We enjoyed this dish so much we didn't leave any crumbs. <br><br>The staff there was great. Our server was very descriptive with all the entrees which helped ALOT with our decision making.", "pics": null}}, {"review": {"des": "Brit American reviewing.<br>It looks really nice from the street. Parking was ok ..a block or two away..fine in the daytime.<br>I liked the open faced bar. I am not a fan of net curtains...net curtains in a pub even less so. It doesn't work <br> The wait staff were nice but stiff as cardboard.<br>I had the steak pasty with mash and gravy. The pasty was ok. The mash and gravy were too small to justify the $4.50 charge, a scoop of mash and small jug of gravy. Price gouging.<br>None of it was bad. It just was a bit mean and lacking in generosity.<br>The trifle was bad. First I was told it was blackberry...ok...it was cherry...three cherries had not been de-stoned..  piped cream on cherries and sponge. No custard. It's not a trifle.<br>I won't be returning. It is just not good enough to make me want to. The pies are ok..just not okay enough.", "pics": null}}, {"review": {"des": "I wrote a review awhile back, but I have no idea why it is not showing up anymore. <br><br>I really enjoyed having Sunday brunch here at the pleasant house! very aesthetic and the food was delicious! my friend recommended coming here for sunday brunch and we actually ordered a lot! we ordered the royal breakfast butty, vanilla bread pudding french toast, chicken balti pie, scotch eggs, coffee, and the milk tea (hot) Yes, a lot for two people to eat, but worth the buck! <br><br>the french toast was sweet, but the strawberry on top counter balanced the sweetness, the burger was rich and the meat was cooked medium rare, the scotch egg was crunchy and yolk was still pouring out even waiting after 10 minutes to cut into it, and the balti pie? it was perfect. Perfect crunch too and the PHP is more known for their pies and they range for $10. Even though it was a small portion, its definitely packed with flavors. the milk tea was the perfect mixture of tea in the morning for me.<br><br>overall, i would definitely recommend this place to anyone and I would love to come back soon! good for IG photos ;)", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/VJmau5c8NbI0iiktNaVEtA/348s.jpg", "caption": "* vanilla bread pudding French toast"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/nWRGWLnJPsq7JabgRGWhGA/168s.jpg", "caption": "Chicken balti pie"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/k35v07C5QXGx6PmxaaU0kw/168s.jpg", "caption": "royal breakfast butty burger"}]}}, {"review": {"des": "If your in the mood for AMAZING pot pies, you've found the place! These are delicious, we have tried the chicken, steak, and vegetarian option, all so good. Their \"chips\" with meat are soooo good too. The place is super cute, the price is a little high but worth it!", "pics": null}}, {"review": {"des": "This place is so cute with fun decor inside. We came for brunch and opted to sit outside on their patio area since it was such a nice day.  For start to finish we had great service which we were appreciative of.<br><br>We came after 12 noon on a Saturday and it wasn't too busy. Our server told us it was really busy prior to 12 noon so we came at a great time.  Unfortunately that meant they were all out of the breakfast menu and only pub menu items left.  From the pub menu we ordered the mushroom and kale pie and a scotch egg. Both were delicious! We ate it up! I also accompanied my meal with a mint tea which was yummy too!<br><br>Parking in the area was a bit tough because of construction. Hopefully by now the construction has finished. I'd definitely come back to enjoy more of the food, service and ambiance.", "pics": null}}, {"review": {"des": "First stop on a Pilsen brew pub tour with my crew and it far exceeded my expectations. Incredibly delicious food and a charming, relaxed atmosphere. We were a slightly rambunctious group but the staff went with it. Their scotch egg changed my life and I can't stop thinking about the mushroom and kale pie. Don't miss the dipping sauces for the fries!<br><br>The food was outstanding but I have to ding one star for a disappointing doughnut. It looked incredible but was surprisingly bland. My pals loved the beer but I kept myself in check and had iced tea which was tasty.", "pics": null}}, {"review": {"des": "Great service, great atmosphere, great decor but mediocre food.<br><br>I had the chicken Balti pie and my British girlfriend had the steak and ale pie with curry chips on the side. Mine was very dry that I had to order a side of curry sauce. Hers was good. Was it worth the price? I think it could be a little cheaper considering the portion. Their chips are overly fried and burned a little, makes it really bitter to eat.<br><br>But props to them for having one of the best coffees. They source it from a local roaster 4LW, definitely good to try if you have never had the coffee before.<br><br>I will come back again for early drink if I'm ever in the area, but might think twice for the food.", "pics": null}}, {"review": {"des": "Must try!!! So delicious. I liked the veg one better than chicken surprisingly. Great portion and just perfection. Def sharable with sides if you're not starving since the crust and filling are pretty heavy. Reminded me of london :) The patio is also really cute and was covered with glass windows all around when we went. Adorable spot.", "pics": null}}, {"review": {"des": "I enjoy Pleasant House Pub. The ambience is that of a British pub, with a very limited selection of edibles, a large variety of beers on draft, excellent coffee and teas.<br>The Royal Pies are not to be missed. My favorite is the Mushroom Kale pie. Second favorite is the Chicken Balti with a side of chutney. I also get a side salad (off menu) because it completes the meal so deliciously.<br>The husband enjoys the after 5 PM Friday Special of fish and chips. Sometimes he treats me by sharing the crispier chips with me (yummy)!<br>I love the Oatmeal Lace cookies sandwiched with deep dark chocolate ganache.<br>Usually service is good. Our favorite waiter is Juneau, who is very knowledgeable, professional and friendly. His recommendations usually jive with ours.<br>Street parking along Halsted or on Cermak near the Skylark.<br>I highly recommend Pleasant House Pub.", "pics": null}}, {"review": {"des": "Ordered the pub burger for takeout. Golly it was terrific and so we're the potato wedges. Will definitely order again and will need to come in and check this place out. Food is a bit salty, but America.", "pics": null}}, {"review": {"des": "This place is aaaaaawesoooome. Possibly my new favorite spot to show out-of-towners. I LOVE the food, the atmosphere, the fact that it's out of the way in Pilsen, and our server this particular time was awesome. Her name was Emma? She had a pixie haircut. My only complaint: our scotch egg came out over done, and the peas had none of the flavors described in the menu. I also expected the peas to come out mushy, but I think that was just me making assumptions, so I can't hold that against them. I will definitely be back, and I can't wait. I loved all of the pies, but my absolute favorite was probably the chicken curry pie. I seriously can't wait to go back.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/V91Ydr9OMHODEh0TUvNJHg/348s.jpg", "caption": "Pims cup!!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/8ubRNsez1CtwdA5cG02tIQ/168s.jpg", "caption": "Mac and cheese is to die for at this place!"}]}}, {"review": {"des": "This place used to be really great but...<br><br>The menu doesn't change a lot, but when it does, it's never for the better. They had a really great salad that everyone I know loved, and it suddenly disappeared off the menu. <br><br>Their staff seems to have suddenly changed - also, not for the better. <br><br>They used to have a large selection of baked goods - that is basically completely gone. <br><br>If you are going here for the first time you will probably have a good experience, but if you've been going here awhile I think you'll agree it is definitely going downhill. <br><br>The big reason for the low rating: I once found a piece of something in my pie that wasn't edible - like plastic or something. At the time, I was a huge fan.  I told the server about it, but also told her I didn't want to make a big deal about it.  She was extremely apologetic and my meal was free - including the replacement food.   That only happened once - I'm sure it was a fluke, but with the abrupt staff changes and menu changes, I am really starting to question what is going on behind the scenes here and I probably won't be going back.", "pics": null}}, {"review": {"des": "A cozy place in the neighborhood to get a good beer and a tasty meal. The service was attentive and friendly. The portions were generous and fairly well priced (just a tiny bit expensive). We came for the homemade pasties & pies but don't miss the burger! The \"chips\" or potatoes were crispy and delightful. The music suited my taste for the most part (old soul and funk).<br><br>In a nutshell: A nice spot for a fancy beer and a tasty bite.", "pics": null}}, {"review": {"des": "Love the meaty pies - very tasty! Great craft beer selection. Cool decor and atmosphere.", "pics": null}}, {"review": {"des": "You know how hipster places often suck because the staff is either trying too hard or is taking itself too seriously? That is definitely not the case at the pleasant Pleasant House Pub. It's the same general setting as a \"hipster\" establishment (rustic, chic, and brunch) but there was no plaid clothing, facial hair, or eyewear anywhere! And, staff was genuinely nice and engaging, which is also contrary to hipsters!<br><br>I'm glad we happened to dine in on a Tuesday, because they offer burger and beer pairings--which also come with a generous side of potatoes--for twenty dollars. I don't know if I'm just a sucker who has been conditioned to enjoy food-and-beverage pairings when they're presented to me by \"experts\", but I got the sense they have an appreciation for the craft. The beer offering complemented the brioche bun very well, and the portions were very generous.<br><br>The overall presentation--from the food selections to the setting--has a very sophisticated feel to it. Strategy is methodical here without trying too hard. If I lived near here, I'd be a regular. Unfortunately, I live about 500 miles away from it. Although if I left now as I write this (about 10:00 pm), I could easily make it in time for breakfast...", "pics": null}}, {"review": {"des": "Pleasant House Pub is one of my favorite places.   It's beautifully decorated with great ambiance and a relaxed vibe. I love that the menu sticks close to the English Pub vibe.<br><br>I don't know many restaurants that specialize in pot pies (which I am not a huge fan of) but these pies are different with more of a flaky croissant consistency. The steak and ale pie has the most flavor.   And my favorite menu item is the Scotch Egg. I Wanted to try the weirdest things on the menu and ended up loving it.  It's a hard oiled egg rolled in sausage and fried in bread crumbs served with whole grain mustard and it's DELICIOUS!  Brunch is great as well.<br><br>In a perfect world they would also<br>Offer brunch on Saturday. I understand having seasonal menus or focusing on specific entrees but the menu is a little too limited.  And there aren't that many \"light\" options. <br><br>But I keep going back .....", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/A2YHlvFxZmWGAqxsRF3Ycg/348s.jpg", "caption": "The Scotch Egg is pretty filling."}]}}, {"review": {"des": "Excellent Pub that brings a taste of home to Chicago. I visited the old location around a year ago and it was fantastic. This new location in Pilsen is even better. <br><br>We ordered:<br>- Chicken Balti (with mash and gravy) <br>- Mushroom and Kale ((with mash and gravy)<br>- Cappacino <br><br>The pies were a delight to feast on. The Chicken Balti pie was had richer flavours than the Veg option though. Cappuccino was sub-standard but it's a pub not coffee shop. <br><br>Overall experience was pleasant. I will be coming back frequently!", "pics": null}}, {"review": {"des": "Four Letter Coffee Espresso<br>Review: Fruity and it packs a lot of flavors, got to try it guys!<br><br>Fish & Chips<br>Review: Nicely batter and the fish is flaky, it's great!<br><br>Pub Burger<br>Review: Something simple and good, nothing special but good.<br><br>Overall<br>A nice place for lunch and a drink with your friends, lots of spaces to park nearby and the interior is awesome.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/mwJAFfmS5i9XeVD4xl_EIQ/348s.jpg", "caption": "Open Face Sandwich, yum!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/rwt_j1VoNBneKpGSWMB4OQ/168s.jpg", "caption": "So many options!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/nR-BXvPyIRWLtdQAE2ZEQQ/168s.jpg", "caption": "Pub Burger!"}]}}, {"review": {"des": "I don't usually order vegetarian but the Mushroom and Kale pot pie is the best thing on the menu. Super flavorful and flaky.  Add a scoop of mashed potatoes and gravy on top for extra flavor! Favorite pot pie in Chicago!", "pics": null}}, {"review": {"des": "Came for the Sunday brunch and the food and experience were excellent. We went specifically for the Royal pies as we were watching a British baking show that got us really curious about these savory pastries. <br>The pies were awesome. We order a steak and ale pie and a premium steak pastry. Both were delicious. The filling of the seal and ale pie were similar to a stew (a very good one) and the steak pastry was of a different texture. The mashed potato and gravy were great too, and the amount of gravy was just right and did not flood the whole dish. <br>The House toast was great too, very nice thick cut of toast with butter, house-made jam and marmalade. We've never tried marmalade before, so we follow our waitress' recommendation to just put a tiny amount of it on tops of the toast and butter, which tasted good. I don't see myself eating it regularly but definitely worth trying. <br>The place is beautiful too, which is always a plus. Would definitely come back some time soon for dinner or another brunch.", "pics": null}}, {"review": {"des": "We had been big fans of the old location, and we are even bigger fans of the new one! Lots of seating, beautiful space, same delicious food.<br><br>We came for weekend brunch. I had the breakfast pie with sausage egg and cheese and it was everything I wanted it to be. I also got a scotch egg - delicious; a latte - beautiful; and breakfast potatoes - crispy with a unique sauce on top.<br><br>We also shared a croissant, which was beautiful.<br><br>Lastly - large, unique, ornate, individual bathrooms for anyone.<br><br>Well done, Pleasant!", "pics": null}}, {"review": {"des": "Yum! Pleasant House hit the spot for a lazy Saturday lunch. Super cute, homey and welcoming. All the servers were really friendly, too. We ordered the chicken curry pie, the veggie pie, the mac and cheese and the loaded chips. Everything was great, especially the mac - we couldn't stop stealing bites from our 2 year old's plate! I'd love to come back sometime at night, maybe for the Friday fish n chips.", "pics": null}}, {"review": {"des": "We ordered takeout... beef ale and chicken bati pies, a salad, and an order of chips.  All the elements were just perfect!!  The crisp and lemony salad was very fresh and a perfect complement to the rich and flavorful pies.  Don't forget to order a little side of gravy and chutney... the extra sauce made it perfect.  I couldn't stop eating those little crunchy potato morsels... the fries of my dreams!!!", "pics": null}}, {"review": {"des": "This place is beautiful and charming. The service was really nice and friendly. The beer selection is great and their cold brew is super super yummy! <br>We already ate in Chinatown so I didn't get to try the food here but I really liked the set up of the place and the ambiance so look forward to come back and give a try to the food too (it certainly looked delicious!!).", "pics": null}}, {"review": {"des": "I got a to go order of the Chicken Balti pie with the \"Crown Your Pie\" option (add mashed potatoes and gravy). It was delicious. I loved the depth of flavors and look forward to trying other dishes here. <br><br>The restaurant's decor was awesome. Somehow it seemed to be a great place for dinner, happy hour, and grabbing a coffee all in one. <br><br>The only negative thing about the experience was that I wanted to take a long nap after eating, but had to go back to work. :) I look forward to going back and dining in!", "pics": null}}, {"review": {"des": "I have been coming here since it was a small hole in the wall on 31st street and they delivered to Maria's next door. <br>Their savory pies are awesome and I don't tend to like meat in a pie form. Their curry chips are thick cut fries, crispy and soft in the middle and that sauce is amazing. Well made drinks. <br>My friend also had her wedding reception here and there was more than enough food. I also accidentally left my debit card (open tab and left early) and they not only called me but let me come and pick it up on their closed day. <br>They have great food and truly care about their customers. It's like going to a friend's home and hanging out. Don't miss out!", "pics": null}}, {"review": {"des": "Decent.  <br><br>We liked our server (Jeannot) very much, he made the experience warm and inviting. <br><br>If you enjoy english tea, they have a nice royal milk tea on the menu. <br><br>The meat pies are the attraction here. He had the steak pie and I had the chicken curry pie. Nice crust and pleasant sauce. <br><br>You can order extra sauce ($0.50) on the side. <br><br>We finished with a donut with house made apple filling. Good.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/NueYyUmp2T0jDOzMB60y8Q/348s.jpg", "caption": "Steak"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/kVxzkg-4raAL-PXK4KyKiw/168s.jpg", "caption": "Chicken"}]}}, {"review": {"des": "First of all, anyone saying this is the best British food they have had needs to re-evaluate all their life choices leading up to that statement. British food is not even by definition supposed to be good. <br><br>Even by that standard, the pie here was trying too hard. It wanted to do too much and be too much. It didn't stay true to its roots.<br><br>So in short, we have at Pleasant House a pie that is neither good by Chicago food standards, nor good by British standards. Messy.", "pics": null}}, {"review": {"des": "Great little pub and restaurant! We stopped in after the arts District second Fridays and had a great experience. After 10 o'clock, they go to a limited menu, but have some delicious treats. The atmosphere is warm and inviting and great for groups. We will definitely be back when in Pilsen.", "pics": null}}, {"review": {"des": "This may be America, but once in a while it's good to have the kind of British food that doesn't suck.  Enter Pleasant House Pub.  Have never had a bad food experience here.  Great place to shovel abundant meat pies into the pie hole!", "pics": null}}, {"review": {"des": "Let me start off my saying I LOVE MEAT PIES! Ok, now that I got that off my chest. <br>Great atmosphere... Cool, new spot.. Very clean, great bathrooms with tons of gold trimming .. Cute little bar.. Awesome open kitchen area... And well...... decent food. <br><br>My boyfriend and I were pretty excited about trying this spot.. Fairly close by, tons of parking and plenty of space .. Came in on a Sunday evening (seat yourself).. We started off with the Gin Punch for two... A bit tangy and super sour. Wasn't my favorite .. Small pitcher for $22.. Meh, wasn't good enough for me to complain about or order again.. <br><br>Food: I ordered the Premium Steak Pasty with a side of chips.. (BIG MISTAKE) my boyfriend ordered the Chicken Balti pie..[ugh, delicious] needless to say, my \"premium\" steak was super dry, the pasty was soft but bland and I literally had to smother my pasty in gravy to give it flavor and keep me from choking on the dry steak and dough..   My boyfriends pie was freakin yum! The sides of gravy, curry and pesto were a plus.. <br><br>The service was ok, our server only came over once to check on us.... Overall a decent experience, but not a place I will be returning to any time soon..", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/-GTaBf_YmnkehrtVnbsyyA/168s.jpg", "caption": "\"Premium steak pasty with a side of chips\""}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/P8VI1wTAqMYYHn_-ig98Yw/168s.jpg", "caption": "Punch for two.. Meats pies and plates.. Let's see what's good!"}]}}, {"review": {"des": "Right... I would give this place four stars but I feel slighted.  I've been coming here for a few months and each Friday I get the Fish and chips.  This week instead of 2 small but meaty pieces of fish, I was met with a rather flat thin portion.  Essentially half to a quarter of what I was used to. The Fish and Chips here are awesome so this new change to portion size is seriously playing with my emotions. I ate mostly batter/ crisps and chips. Not to mention the server pled the 5th and that was all management or otherwise had to say about it. They tried to right the wrong, but I am now home and still hungry. So you know.. buyer beware and maybe order the Burger or an actual dinner instead.  I  may have to find a new Fish and chips pub that can keep things consistent. <br><br>I hate to post this, but Pleasant House and the staff therein did it to themselves.", "pics": null}}, {"review": {"des": "Great place. Great food.  Great beer. Almost everything would make this a 5  yet the service really, REALLY hold it back. <br>S L O W and im not talking like \"hey were busy\" I'm talking systems don't seem to be in place to handle orders efficiently or correctly. <br>I've had this happen on a few occasions, which is a bummer because I love this place yet I have to give honest feedback on what's happening.  <br><br>Train staff, get them an espresso or something and get things moving and this will be fantastic.", "pics": null}}, {"review": {"des": "My favorite pie house! Ever since they opened in Bridgeport it has been one of my favorite places to go to. I recommend  the steak & ale pie!", "pics": null}}, {"review": {"des": "*** Vegetarian Review****<br><br> I really want to be able to give this place 5 stars. I love the vibe, I love the location, but it's pretty difficult to hobble together a feel good meal here if you don't order the mushroom kale pie. Don't get me wrong the sides are good, but they are pretty heavy and gluttonous. <br><br>Pleasant house is unique in general, however the mushroom kale pie is pretty lame. Vegetarians are bombarded with mushroom food options. It's a token veggie option on every restaurant menu. Like anything in life, too much of anything is not good. I would LOVE LOVE LOVE pleasant house to consider a new veggie pie.", "pics": null}}, {"review": {"des": "Sooooooo salty! A friend and I ordered the vegetarian pasty/pot pie filled with parmesan, mushroom, and kale. The pastry part was delicious -- flaky and buttery. The filling was soooooo salty. Like salty enough that I still feel dehydrated after downing half the water carafe at the table, which they didn't refill. My friend ate around hers, just enjoying the pastry portion. We also ordered the mac & cheese side...and sent it back. We each had a fork full, but it had a weird after taste, slightly sour. And the dessert; ok so we ordered the sticky toffee pudding...and it came out looking less than savory -- picture a brown cake, lumpy brown sauce and some powdered sugar on top. It was decent, but I think we were both thrown off by the presentation. They were kind enough to take the mac off of the bill, and the highlight was definitely the drinks -- I had the royal tea latte with almond milk and my friend had lavender lemonade.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/NZg5cvlXMHxSqESFJs062g/348s.jpg", "caption": "Sooooo salty..."}]}}, {"review": {"des": "Best British food I have had.  Came for brunch.  The chicken pie had an awesome crust and the chicken filling had a tasty, but mild curry sauce.  Also tried the English breakfast, french toast, and side of peas.<br><br>I definitely will be back and would recommend Pleasant House Pub for a visit.", "pics": null}}, {"review": {"des": "OMG Pleasant House!<br><br>Words cannot describe how much I love PHB pies. My bestie introduced me to Pleasant House years ago and I've been addicted since.<br><br>The new location is fantastic. PH has been long deserving of a larger space and I'm glad they finally have it. The interior is intimate with plenty of seating. I love how it feels like a proper English pub!<br><br>I've tried their steak and ale, and the mushroom and kale pies, but my absolute favorite pie is the Chicken Balti which you must have with the coriander chutney. It's the perfect combination of flavors and texture, the way the pie bread flakes....gahhhhhh just thinking about it...foodgasm!!!<br><br>Anyway, this last visit I decided to switch it up and try their special pie, which was a pork and ginger pie, that came with a slaw on top. It was very tasty! Oh, then we tried the mac n' cheese...fiyah!!!<br><br>While I miss having Maria's right next door, I'm so happy they have a full bar with not only craft beers, but they make craft cocktails! I tried the Pimm's Cup and it was really good and refreshing. The shandy they have was also very well made!<br><br>The only reason I'm not giving PHP 5 stars is the customer service. So far I've visited this new location twice, and both times, the servers have just been so...flat affect. They're not rude, and we didn't have any issues with the service itself...it just kinda seems like they'd rather be elsewhere or just bored.<br><br>All in all, same great quality food and drinks, just in a beautiful new space! Can't wait to visit again!<br><br>PS- Bathrooms are fancy!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/flsTc3xXxl2cFve1PkmTxg/168s.jpg", "caption": "Mac n' cheese. Crowned pie."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/B9_4gvkFnA75hEU4nMhcLg/168s.jpg", "caption": "Pork and ginger pie with their slaw"}]}}, {"review": {"des": "Pleasant(ly) surprised by the Pleasant House Pub. We stumbled across the restaurant while looking for a place to eat near the Renegade Craft Fair.<br><br>The food here is great. Portions are large and the quality is top notch. Staff is extremely friendly and we're all dressed (very fashion forward to match the British theme which is done so well). Plenty of seating. Very clean and aesthetically pleasing and the bathrooms are BEAUTIFUL. <br><br>We unfortunately didn't try any of the pies but we did get both of the salads and they were fantastic!", "pics": null}}, {"review": {"des": "It pains me to write this review because I have been to PHP several times -- tea & croissants in the morning, pie for lunch or dinner all of which have been consistent and good.  5 stars<br><br>Well I went to brunch for the first time this past Sunday and it was pretty awful. The cinnamon roll was good.  The breakfast dishes we ordered were  mediocre.  Maybe they should stick to the pies. They need to rework that French toast recipe too heavy, too sweet, the jam on top with syrup poured all over, the only flavor you get is sugar.  The beans and toast arrived cold.  But the service not only was our waiter MIA because the place was so busy, but asking for pepper from another wait staff member only to be handed an empty pepper mill --really?  Okay then trying to flag someone else down for pepper proved to be challenging as well so my husband literally walked over to a service stand and fished out another pepper mill himself.  That's just one instance of bad service.  So we waited and waited for the bill only for me to get up and hunt for the waiter to ask for the check.  <br>Disappointing. 1 star", "pics": null}}, {"review": {"des": "The new location is definitely an upgrade from their previous location. More spacious and inviting. Came here on a Saturday with some friends for an early dinner and the room was already pretty much full. <br><br>We ordered every other thing on the menu after about 30 minutes of contemplation. We just couldn't decide. Everything looked good! We ended up with some pies, mussels, scotch eggs, bangers and mash, pickles, and some cocktails to go around. We mopped up everything on our plates and happy to do so. <br><br>My only complaint is the service was a bit on the slow side. Maybe it adds to the chill atmosphere and we were certainly not in a hurry so I didn't mind it too much. <br><br>We really enjoyed the food, drinks and the atmosphere. Definitely coming back for more.", "pics": null}}, {"review": {"des": "After seeing a post in Hello South Loop FaceBook Group we decided to get out of the neighborhood and give it a try. We were not disappointed. It was absolutely delicious. My husband and sister-in-law had two different types of steak pies and I had the burger. We all agreed it was an awesome meal!", "pics": null}}, {"review": {"des": "Friday was a fish fry lunch for me. I've been a big fan of this for a while. It was a Lake Superior whitefish I believe. Get yours next week before they sell out.", "pics": null}}, {"review": {"des": "I absolutely LOVE Pleasant House Bakery. I have recommended it to many friends, and I will continue to do so. This is my favorite British fare in the city; I can't stop raving about the royal pies! I'm very thankful, as someone who does not eat meat, that there is a kale and mushroom royal pie. The crust is SO crispy and flaky. Seriously. It is absolute perfection and if you haven't tried one of these babies, then you're seriously losing out!<br><br>I also highly recommend getting the chips (basically fries) as a side, as well as the mouthwatering housemade ginger soda. I am NOT a soda-drinker whatsoever because those types of drinks are typically much, much too sweet for me. However, the ginger soda here is not overly sweet at all (yet still perfectly appeasing to my taste buds, I promise). You can tell that it's really fresh and they use real ginger. <br><br>Other info: You come in, you order and pay at the counter, you take a seat at the small yet respectable dining section, they bring you your food, you enjoy. It gets drafty in the winter, so you may want to wear long sleeves (or your coat) inside when it's cold out there. <br><br>Writing this review has me itching to go back!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/xe8FA0DbIzCJTrkiuWFb0w/168s.jpg", "caption": "Ginger soda and kale/mushroom royal pie"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/y7thoSaJU2DlQKNbSS6mkg/168s.jpg", "caption": "Ginger soda and kale/mushroom royal pie"}]}}, {"review": {"des": "Premium Steak Pasty was phenomenal, especially with the crown! Deluxe chips and gravy were equally delicious, as well as the beverage selection. Great service!", "pics": null}}, {"review": {"des": "They had a lovely fish and chips for the special of the day when I visited. The fish batter could use some work and made even lighter. Overall, it was extremely filling and the chips were super dangerous because it was just so good that I didn't get a chance to take some home to eat later.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/bSZ81R9qJFapFnzaqNBgKw/348s.jpg", "caption": "Fish and chips"}]}}, {"review": {"des": "All my friends, family, and even my enemies like Pleasant House so I feel bad for not digging it as much. It's a nice, unassumingly little place in my beloved Bridgeport and I appreciate the business owners who are trying to make the neighborhood better!<br><br>I got a couple of things:<br>1. Scotch egg - Definitely a highlight, perfectly cooked, delightfully tasty.<br>2. Kale and mushroom pie - I liked this out of the two I tried. Nice and creamy.<br>3. Steak and ale pie - I thought it was good. Flavors didn't really excite me, but it was good.<br>3. Chips (home fries) - Pretty standard, good and crispy.<br><br>There a few reasons I wasn't blown away. I wished the crust were more flaky--it was a bit dense and hard to get my knife through. The fillings were good, but it just wasn't anything too special. And lastly, for the price I thought I didn't get much food.<br><br>BUT! Again, all my friends, family, and enemies really like the place so give it a try for yourself! I support all restaurants that try to nuture Bridgeport. Thanks Pleasant House!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/QlBiLHBbvpcwcnVpwl2w4Q/348s.jpg", "caption": "Mushroom and kale pie, nice and creamy."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/asc64taMoZv-c1WWJnnpzQ/168s.jpg", "caption": "Chips/home fries. Nice and standard."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/KTtOk0bTV_Ecp93TV8WZgA/168s.jpg", "caption": "Steak and ale pie, pretty good."}]}}, {"review": {"des": "A word of caution: stick to the tried and true pies. The specials are substantially worse.  <br> <br>After ordering several specials over the years and regretting it every time, I finally learned my lesson today. $15 for 3 inedibly bad components. How do you mess up rice?", "pics": null}}, {"review": {"des": "Pleasant House Bakery thank you for being there, making and serving great food for so many years and best of luck in your new home in Pilsen.  I know I can't wait to go.  My girlfriend and I split the chicken curry and mushroom tomato, both so delicious. (I feel it's necessary here to add these were eaten pre-4/20 and my memories still not fully recovered: the pies could have had totally different ingredients.)  We both agreed the chicken curry was the most amazing but the mushroom tomato was badass.  Damn.  <br><br>The ginger and jamaica fizzes were refreshing and sophisticated.  Days later, I was left thinking about the sweet pies sitting out on the counter.  I asked myself, did I get to eat one.  I couldn't remember but my girlfriend says I did.  The reason I believe her is that I DO remember the service was on point, and I was thinking that at the time.  That corroborates her story.  I wouldn't mind having more of those sweet pies.<br><br>Pleasant House Bakery will be missed from it's small home but all in all seems ready to take it to the next level.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/SCJTzjp0Pzv2HfNP6fgpJQ/348s.jpg", "caption": "chicken curry"}]}}, {"review": {"des": "By far the best service I had in awhile. I wish I would've remembered his name. Honestly great service. My husband and I felt comfortable throughout the whole meal. The beer selection is great. So far I've only tried there latte, it was delicious. I wouldn't hesitate on coming back. <br><br>Pies are delicious.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/TjCTDGb3RlE6L0UUrPqqQg/168s.jpg", "caption": "Yogurt with granola and fresh fruit and Lost Abbey Serpent Stout."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/l4XeC94xPJFLW3niOYq1SQ/168s.jpg", "caption": "Chips, latte, pie, oh my!"}]}}, {"review": {"des": "If it's -5 degrees out, Pleasant House Bakery has the perfect pies to warm you up. Let's be real even if it's 85 degrees out, Pleasant House has bomb@$$ pies. Located right next to the infamous bottle shop & beer bar Maria's, Pleasant House is a tiny spot with some tables if you want to dine in but they're happy to let you take food to go. Or deliver your food while you're throwing 'em back next door. If you prefer eating there but are hankering for a brew, good news ~ they are BYOB! It's a really chill & laid back environment so I can see the appeal of dining in.<br><br>On my latest visit, I had their Mushroom & Kale royal pie for $7.95. The crust was flaky yet smooth, I'm sure slathered in butter to give its delectable taste in every bite. My pie was filled with mushrooms, kale, scallions, herbs, parmesan and white wine. These aren't the huge full size dessert pies you are familiar with but rather are more like personal sized pies - perfect for a meal for one. It was just the right size for my dinner and I gobbled up every bit I could because it was so darn heavenly.<br><br>My only regret - not trying their scotch egg. I didn't think it would travel well home with me...but I'm really wishing I just gave it a go anyways. I do believe I may need to Postmates some of their cuisine in the very near future.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/5kvNG9FB5pFQHneuhTbZ-w/168s.jpg", "caption": "Mushroom & Kale royal pie"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Vxvj9JkTP6Z87ZpGyKzcIQ/168s.jpg", "caption": "Mushroom & Kale royal pie"}]}}, {"review": {"des": "Great food and really fun vibe. The inside of this place is amazingly designed. The fish and chips are out of this world! Pims cup is also amazing! Please check this place out!", "pics": null}}, {"review": {"des": "The chicken balti pie can't be beat. And with a side of peas, mashed potatoes, and a latte? Oh man. Oooooh man.", "pics": null}}, {"review": {"des": "Excellent service, very cute Pinterest friendly ambiance (marble stools! Mini dominos! Floral wallpaper!)<br><br>I've been in a very English mood (binging episodes of the Great British Bake Off will do it to ya!) so when a friend suggested dinner I voted we come here. We were treated to a lovely and very filling meal. <br>We shared the mussels (a delight in a rich sauce with a split baguette to sop up the flavors), mashed potatoes with gravy, and the pub burger (a simple cheese burger) which comes with fries too - a starch heavy meal indeed! To drink I had the very boozy run punch. It was a little too rich for my blood but because of the heavy meal I thankfully didn't have a hangover. All in all a great dinner. Will certainly be back!", "pics": null}}, {"review": {"des": "This place was delicious! I liked the setting. It's very clean and brightly lit... Just a very inviting environment. My friend and I shared the steak and ale pie and vanilla bread pudding. The pie was a rock star for sure!! I would get this again. It was so flavorful and the crust was just perfect. The bread pudding French toast was delicious as well and had the perfect amount of spices. It maybe needed nuts to make the overall experience yummy. That added texture would really make the bread pudding even more amazing. It was creamy and the apples were delicious on top. I loved the staff and the service was great. I'd come here again!", "pics": null}}, {"review": {"des": "Created a yelp account just to review this place!<br><br>While I never thought I would enjoy a meat pie, our meals of steak & ale pie, the Fish and chips (Friday special), and ciders were amazing.<br><br>I highly recommend this spot to anyone in the area. I'll definitely be returning soon.", "pics": null}}, {"review": {"des": "oh pie...<br><br>well i can't say i have anything to compare it to but they serve up a damn good kale and shroom pie. the rest of my table agreed as we all ordered the same thing haha.  i'd come here for all my pie needs and wants :)<br>great atmosphere - not able to drink for a couple more months so didn't get to enjoy an adult beverage on my visit but i felt like i was in the middle of some sort of good will hunting type movie set. i'd like to come back to have a few and maybe snack on some chips.", "pics": null}}, {"review": {"des": "Always passed by this place but finally went inside today and so happy I did!<br><br>Ordered the Chicken Balti Pie, Premium Steak Pasty, and the Ginger Fizz Tea! Everything was very delicious! <br><br>The Chicken Balti Pie had a very delicious, buttery, and flaky crust! As I was cutting into the pie, the filling was oozing out and I could smell the deliciousness that awaited me. The filling had some great spices to it that made me want to eat more. The chicken pieces were plentiful and tender! Such a great pie!<br><br>The Premium Steal Pasty had a flaky crust as well but the filling was more dry with some dry spice rub. The steak pieces were also plentiful and tender! <br><br>The Ginger Tea Fizz was perfectly sweetened to balance the ginger flavor. Very refreshing to offset the savory pies.<br><br>Will for sure be back to try the other items on the menu and the baked goods in the display!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/6R9MvfEWs4o1iD7hEDpmJw/348s.jpg", "caption": "Inside the Chicken Balti-amazing"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/a3anO7l0a34Vir7gYn7bOQ/168s.jpg", "caption": "Top: Chicken Balti, Bottom: Premium Steak"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/KV_XqtlqsewqQX3XF2HLAQ/168s.jpg", "caption": "Ginger Tea Fizz-sweet and refreshing"}]}}, {"review": {"des": "Beautiful restaurant with option of cozy indoor seating or open breezy patio space. Full service...what?!?!? Chicken balti pie with coriander chutney was AMAZING!!! Ginger beer was fizzy, crisp, and refreshing. Great location and wonderful spot to relax the day away. Minus one star for underwhelming mash and gravy...skip it.", "pics": null}}]}