{"name": "pollo-express-chicago-2", "reviews": [{"review": {"des": "Well here we go again, another review, and the lucky business this time?  Pollo Express on 18th and Loomis.  I've eaten at this place PLENTY of times and their Tuesday and Thursday special nearly causes mini riots and traffic jams.  <br><br>Although their menu is simple and straight to the point (chicken, rice, and beans) I thought I would venture off to the WILD SIDE and order their Chic-ken Booooowl!!  Ah, yes even Pollo Express had to give in to the new restaurant trend and just put everything in a damn bowl, but Yelpers you will be glad they did!!!<br><br>The fabulous grilled chicken is deboned, chopped, and placed atop a nice serving of their tender flavorful rice, your choice of beans (charro or refried) and lettuce.  Cheese, finely chopped jalapeño peppers, tomato, onion, and slices of avocado accompany the chicken on top of the rice & beans.  You can also get sour cream but opted out.  I finally go in on my beautiful bowl and, Ahhhhhh!!  The only thing that could have kicked this bowl up to the next level would have been some roasted corn!  Guess I'll hit the Elotes Man up on the corner next time to accompany my fabulous meal.<br><br>Verdict: I feel the Itis coming on and I'm not even one-fourth of the way in!  <br><br>Next time you're there, get that bowl!  Trust me, you won't regret it!!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/zpLOYVYR7Yun0umUyDDIlw/348s.jpg", "caption": "Mmmm, Chicken Bowl!!"}]}}, {"review": {"des": "Solid. I've been wanting to try this place for a while. The food was really good and was a great value. Also the restaurant has a great decor and was spotless. <br><br>My only complaint was with one of the employees. I assume he was a manager but the dude was on break and proceeded to grab food from behind the counter and go sit at the table in the restaurant, find a movie on YouTube, and then turn up the tv extremely loud. My girlfriend didn't even notice but I found it to be pretty rude for others in the restaurant.", "pics": null}}, {"review": {"des": "I've been to this place about 2 times, and the food here is a little underwhelming. At first, I was excited to try it out, but now, it's just a meal to fill my belly. <br><br>I usually order the 1/2 chicken, and once I get past eating the wing and drum stick, it's all down hill from there. The rest of the chicken is completely dried out. <br><br>The rice is good when it's mixed with the beans. Also, they give you some tortilla shells, and they are not the best shells I've ever eaten. Then there are pickled red onions and salsa on the side. I usually throw away almost everything except the chicken, rice, and beans. <br><br>It's a cool spot to try out, but it's not the best food in the city. You can definitely find better chicken and rice some place else.", "pics": null}}, {"review": {"des": "Very tasty. That are three choices, whole chicken, half chicken or the new bowl. Ofcourse I went for the bowl to try a bit of everything. I enjoyed everything in the bowl. The chicken was Smokey and flavorful. Don't miss the salsa either. And did I mention it was like $7.50, couldn't even finish.", "pics": null}}, {"review": {"des": "Fantastic chicken, awesome sides, even better prices. We shared a whole chicken, rice, charro beans, and a side of guacamole - everything was fantastic and we came no where near eating it all. All of that food was less than $25 (cash only). Everyone was very nice! We'll be back!", "pics": null}}, {"review": {"des": "Great hole in the wall chicken spot.  The chicken is grilled over charcoal.  Chicken was moist and had good seasoning.  There's no sauce here and only salsa. <br><br>This is a cash only spot.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/bUeCfbUYgtq6VB3m76OilA/168s.jpg", "caption": "Menu"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/iS5w46zHjUFJl-31suZXmA/168s.jpg", "caption": "Whole chicken."}]}}, {"review": {"des": "The best chicken in Chicago, I CONFESS<br>Is at a little place that's hard to ACCESS<br>It's so damn good you'll make a MESS<br>So be careful not to get sauce on your DRESS<br>At least not the chicken sauce, but I DIGRESS<br>It's not the kinda place to sit and play CHESS<br>Or take a hot date to kiss and CARESS<br>It's not a sweet spot to relax and DE-STRESS<br>And the TV never plays Bruno Mars' FINESSE<br>But the food is an unapologetic SUCCESS<br>And you will love it too, I believe, UNLESS<br>You're a vegetarian, to which I say \"YES!\"<br>But maybe you can try it when you're on RECESS<br>Anyway, I DM'd you my ADDRESS<br>And now I have to go do another Bench PRESS<br>But if you're free later, and you have BREASTS<br>And you're looking for a place to go and UNDRESS<br>You can come over to mine and we'll CONVALESCE<br>And next day for lunch, I'll take you to POLLO EXPRESS<br><br>WHAT<br><br>What to get: Rotisserie Chicken<br>What not to get: Routers for your internet that have sh**ty speeds<br>What else not to get: Rotting food out of a dumpster<br>But what if I'm starving: Just go to a grocery store and ask for some food they're throwing  away - or a Pret A Manger if you have one near you - or ask a Yelper for help - those b****es have money.<br><br>I wanted a quick game of a Bougey Sport. Should have gone to \"Polo Express.\" And I needed something comfy to lay my head on. Should have gone to \"Pillow Express.\" I wanted some flavoured South Asian rice. Should have gone to \"Pilau Express.\" I wanted a much smaller portion. Should have gone to \"Paltry Express.\" I wanted to be on a weird diet. Should have gone to \"Paleo Express.\" I wanted a cute, vacant woman to run for the vice presidency. Should have gone to \"Palin Express.\" I wanted a dictator to rig US elections, murder his rivals, and attempt to emulate Stalin. Should have gone to \"Putin Express.\" I wanted to tell your boyfriend to have his way with me. Should have gone to \"Putitin Express.\"<br><br>OK, enough.<br><br>On my recent food tour of Chicago after participating in a soccer game, I came along to Pollo Express to give the most highly-rated and affordable Mexican Rotisserie Chicken in the area a try. Did you know that Mexicans famously make rotisserie chicken? They do, and they do it very very well. Right here, they have some of the best I've ever tried, along with wonderful rice and green beans. Mexican Chicken honestly rivals Colombian or Puerto Rican style for deliciousness. Come and give it a try and see for yourself.<br><br>And even though it's not the most comfortable place to sit and eat, it's still a great place to come for dinner. Chicago Cops come and eat here, so that says a lot because you know those guys are much more into eating than protecting the community LOL just kidding not really kidding kind of kidding nevermind.<br><br>Parking can be a real pain, and it's pretty expensive per hour, if you can even find a spot in this up-and-coming cool neighbourhood, and it's even more expensive to get a ticket, so be careful. There's a huge cute mural on the side of the building in the alleyway which is where I park when I pick up my take-out orders - but don't tell anybody that because it's really against the law. Not that I would ever generally break any law ever. Ahem.<br><br>Definitely one of my top 20 places to eat in Chicago, and some of the best rotisserie chicken I've had in my life - and if you take Peruvian chicken out of the equation I would say this is top 5 rotisserie chicken in the entire country, alongside Niagara Cafe up in Buffalo, and a few others here and there.<br><br>Oh and by the way.<br><br>A Mexican chicken just popped up and did this on my keyboard:<br>XXXXXXXXXXXXXXXXXXXXXXXXXXX<br><br>Now that's what I call a Pollo X-Press.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/FGpOnv6_1fzwnplhgSjTiw/348s.jpg", "caption": "I feel like I've beans here before"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/A0LV_bQNztA4YfXnk-6mzQ/168s.jpg", "caption": "Go ahead and have a bite unless you're chicken"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/cr2RyN9HIaN5GAYFKy7zPA/168s.jpg", "caption": "Don't eat this in one bite. Taco your time"}]}}, {"review": {"des": "This is a GEM! for three people, one whole chicken was more than enough food, and there is also complimentary salsa, chips, warm corn tortillas, beans, pickled onions and rice. We ordered guacamole on the side which was also very delicious. Everything was fresh and flavorful, and on a certain day of the week they offer a buy one chicken get half free. Our total was literally under $30 including tip!", "pics": null}}, {"review": {"des": "pretty good grilled chicken! the moment you walk in, you can smell it, so strong and so nice. On Tuesdays and Thursdays, they even have specials of ordering a whole chicken and get a half chicken for free, pretty good deal considering its already really reasonably priced regularly.<br><br>the chicken taste a bit dry but very flavourful, the skin is good too. also really liked the side dishes, the rice and beans are both great!<br><br>horchata is so so", "pics": null}}, {"review": {"des": "They give you SO much food and the salsa is bomb. I love that they give you little raw onion slices too. But one thing I wish they had was salt and pepper shakers because I thought my Chicken Bowl could use a bit more salt.", "pics": null}}, {"review": {"des": "CASH ONLY<br><br>Yum! My only regret is not coming here on a Tuesday or Thursday for their dine out deal where they give you 1/2 a chicken for free when you order a whole chicken.<br><br>Came here with 2 friends, we split a whole chicken with 2 sides (rice and beans) + free chips/salsa, which made us comfortably full, although in retrospect it would've been better to order 1.5 chickens. Total came out to $22, which is amazing! The chicken is delicious, the roast on it was perfect! Nothing special about the rice or beans. The poblano pepper that comes with is HOT HOT HOT! The place is nice and cozy with ample seating and service is quick.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/TQEnigcmj2WVHiEIZYZGkw/348s.jpg", "caption": "While chicken"}]}}, {"review": {"des": "Chicken get yo chicken, here! <br><br>This place is insanely delicious. They do chicken right, rice right, beans right, salsas right and I highly suggest you do yourself right and get yo chicken here. <br><br>I was totally shocked at the amount of food I got for a mere 15 bucks! <br><br>- a whole juicy flavorful chicken <br>- fluffy flavorful rice <br>- flavorful refried beans <br>- a dozen warm tortillas to help lick up the salsas<br><br>I have renamed this little gem, CIAD: which stands for <br><br>Currently. I. Am. Drooling.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/VZpBV6UmJSyQF-hsGE0N6w/168s.jpg", "caption": "Storefront"}]}}, {"review": {"des": "This is my neighborhood go to.  It's cheap, good, and pure delicious protein.  The best time to go is during lunch or dinner when the birds are coming right off the grill.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/oRy2wXHl_-FQQ8SuMKXjBg/168s.jpg", "caption": "Whole chicken"}]}}, {"review": {"des": "My co-worker let me taste some of his chicken dinner and I was blown away, it was seasoned so good and the beans, rice and salsa was the best I've ever tasted in a long time, I will be going by there soon to grab a couple of dinner plates!!!", "pics": null}}, {"review": {"des": "My go to chicken spot!  Carbon grilled chicken is all they do & they do it really well!  Super delicious chicken & always friendly service at this family run establushment.  Awesome special on Tue & Th, buy a whole chicken dinner & they throw in 1/2 a bird, expect long waits though if you walk in.  It's best to call ahead.", "pics": null}}, {"review": {"des": "The smells permeating from the grill near the entrance are enough to captivate you. The interior is average size with plenty of tables to accommodate you should you choose to dine in. The cleanliness will have you assuming that they do it thoroughly & often or at least they'd just done it when I picked up my food. To call this the best chicken I've ever had is a stretch in my humble opinion however take that with a grain of salt as I can't name a similar type of establishments with better chicken. An entire chicken with all the accoutrements & two sides for just at $20 is a deal to say to the least. The chicken is juicy & tender but all the wondrous flavor resides in the skin. The rice was cooked perfectly but the tortilla are served cold. They DO NOT take credit cards & after realizing I didn't have enough cash to pay for my meal the cashier let me take my food albeit being a few dollars short which I'm sure won't happen anywhere else in this greedy city. I'll definitely return.", "pics": null}}, {"review": {"des": "Quick and easy and delish! CASH only! <br><br>Pilsen gem! Whole grilled chicken with rice and beans plus tortillas and salsa for under $20! Yes! Cheap and sooo good! Chicken is always juicy and sides are always hot!<br><br>If ordering to go, make sure you call an hour before closing cause they usually stop taking to go orders early on during the week!", "pics": null}}, {"review": {"des": "I swear this place would be a regular for me... BUT the rice and beans kill me! If they only added alittle more love to that, I would come here for the full package... every Tuesday of course. <br><br>The chicken IS the STAR. The adoba chicken is juicy and Full of flavor. No doubt about that.  The rice and beans are just added mush to it all.  <br><br>I just prefer a full meal with some yummy rice and beans to put it all together... the 4 stars for the chicken and for the deal! I appreciate it.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/xeyRibdS8w6OkxBUB_sD7A/348s.jpg", "caption": "Soooo the prices increased! Dec 2017."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/yQNWt82UjbNeQneuw91K-g/168s.jpg", "caption": "a $23 meal... from the comfort at home"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/_pv1d8UuYl95MFmCDshbxg/168s.jpg", "caption": "Waited for this Tuesday for a while now"}]}}, {"review": {"des": "Ever heard of El Pollo Loco? Same idea at this place, but WAAAAAY better. This place is an amazing bargain, and the food is fresh and delicious. Best deal is the Tuesday/Thursday delivery/takeout offer for a whole chicken, and they throw in a half chicken for free. <br><br>I've only dined in, and the chips and salsas and pickled onions are great. The guacamole is good, but not as good as the salsa. Real star is the chicken, of course. Flavorfully seasoned and perfectly cooked. You're given more than enough tortillas, which makes leftover-lunches easy! I could eat here every other week, and not get bored of it. <br><br>Bonus: flan is delicious. If you have room!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/m-ZCBAxVaKSl9-78XBL4ew/168s.jpg", "caption": "Mexican coke + chips/salsa + guac"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Oyvfb217f_h30tMsSG4-Tw/168s.jpg", "caption": "Whole chicken (minus a couple of pieces)"}]}}, {"review": {"des": "The chicken adobo was very good, and finger licking worth. The pickled onion and their salsa have a great flavor, I will definitely be coming back. The seasoning was spot on and the ambiance is very comfortable. It's a clean and friendly place. If you're looking for tasty and well done chicken, then this is the place to go to.", "pics": null}}, {"review": {"des": "On a typical day Pollo Express is really good. When we use to live in Chicago I would make my hubby drive from the loop to pick up a whole chicken which include beans, rice, tortilla skins, pickled red onions, salsa, and 1 roasted chili pepper. It was inexpensive and you would have enough for leftovers the next day. <br><br>When we moved back to Southern California I was fairly certain I would find chicken like this out there but I was wrong! So this visit we made a point of eating here. <br><br>We arrived around 6:30pm on a Friday before Memorial Day weekend and the restaurant was empty except for 1 table of 4 dining in and the chickens were on the grill but were all fully cooked. We also noticed the inside looked remodeled. <br><br>We decided to eat in since our toddler was cranky and we found free parking! The chicken arrived and I was ready to eat! However the chicken was dry. Flavors still great but it was sadly dry. Prices have also increased slightly. <br><br>We definitely came on a bad day. Regardless they still earned 4 stars from me because I haven't found another restaurant that serves chicken like this. The closest is el pollo loco so there really isn't a comparable.", "pics": null}}, {"review": {"des": "Short version: Order the Chicken(spicy),the side of rice was kinda mushy/overcooked. The tortillas were average. The star is the chicken,you won't be disappointed.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/oQfBX7g6keoXvssnxmptfQ/168s.jpg", "caption": "Yummy!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/QPAbyZY2dHnsYzv_ERaztw/168s.jpg", "caption": "Whole chicken"}]}}, {"review": {"des": "Best tasting fire grilled chicken in Chicago!! Hands down the best. Located in the heart of chicago in beautiful pilsen this Gem is more than just chicken. Its an experience, from the moment you walk in and are greeted by the smell of the flame on the chicken and spices! Plenty of space to eat in, clean location and everything is fresh and cooked to order! Like the menu says \"many will try to replicate us but they all fail\"! King of Flame Grilled Chicken is Pollo express!", "pics": null}}, {"review": {"des": "<a href=\"/redir?url=http%3A%2F%2FGo.here&s=01adc8d98b08b9f8d7b2d9dc5b20d9b55a6d8a3fa48dca6cb4a31cf1b8f4034c\" target=\"_blank\" rel=\"nofollow\">Go.here</a>.now. We had two hibiscus juices, two horchatas, half a chicken with rice, beans, a stack of tortillas, and chips and salsa all for only $15. Everything was incredibly delicious! If they bottled and sold their green salsa, I would buy it! The chicken was moist and flavorful. I cannot wait to go back. Best deal in the city!", "pics": null}}, {"review": {"des": "Incredible. I'm hesitant to leave an amazing review coz the place is so tiny I'm afraid it'll be mobbed once the secret is out. <br><br>First time I had it, it was reheated leftovers of my parents' lunch. Chicken was dry but the smoky charcoal flavor was addictive.<br><br>We finally returned last night and were pleasantly surprised by the bright and clean interior, quite a contrast from the unassuming exterior. They have excellent ventilation so all of the delicious smoke gets vented out to the streets, beckoning you to enter. The lady at the counter was efficient and friendly. We ordered guacamole, rice & charro beans, grilled onions and a whole chicken. It took a while for our chicken to get ready and I didn't know it was cash only until i walked in but all that food was less than $30 (which fortunately I had in my wallet)! <br><br>We walked the few blocks home, tortured the whole way by the intoxicating smell coming from the bags. Once home, we tore into the food. Sooooo good, soooo juicy. The guacamole had the right amount of spicy kick, so did the salsas. Only letdown was the tortilla, which were dry and hard. But the rice and beans were delicious. The three of us devoured everything and succumbed to food coma for the rest of the evening. Tues/thurs u get half chicken free with whole chicken purchase. See ya there!", "pics": null}}, {"review": {"des": "Not rated right, in my opinion. The service was nice,but the food was not that great. It disappoints me when I go to a highly rated place and it is average or less. This is such the case. <br><br>The ingredients were fresh. The Charro beans sound better than they taste. I had the Chicken bowl and it did not really have much flavor despite the fresh ingredients. <br><br>Not impressed.", "pics": null}}, {"review": {"des": "The place smells delicious. Ordered the chicken bowl with everything for takeout. Large bowl with lots of ingredients. Chicken was pretty good.", "pics": null}}, {"review": {"des": "So good!!! It is a little confusing what to do when you enter...sit at a table? order at the counter? stand around and wait with all the other people standing around waiting? Adobado chicken was amazing, loved the beans. Very affordable for a family. Not crazy about styrofoam containers though. We will be back!!!", "pics": null}}, {"review": {"des": "I wish I had discovered this place earlier! You get the whole dinner for a very reasonable price. The chicken is delicious and the frijoles charros are on fire!", "pics": null}}, {"review": {"des": "We didn't realize that the Tuesday/Thursday deal was dine in only, but the chicken looked so damn good we decided to dine in despite not receiving our 1/2 free chicken. We ordered the chicken with two sides for the two of us to split and it was way more than enough food. We got the delicious rice (seasoned to perfection IMO) and charro, which was tasty but salty. The chicken was moist, juicy, and seasoned well. The meal came with pickled onions, salsa, tortillas, and chips! We had leftovers and with tax, tip, and drinks, came to $24 total. Awesome deal and will be back", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Jq_GdgfF42NLbSg8nmO40g/348s.jpg", "caption": "Thursday special"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/1oiRv-GGv4WOdbfJxbempA/168s.jpg", "caption": "All this for $14 plus tax?? Worth the wait."}]}}, {"review": {"des": "This was the best experience I've had in a long time. Located in Pilsen, the parking can get kind of crazy but I promise it's worth it. We sat in the restaurant and were surprised that it was a sit down style ordering. Great service, the woman was super nice! The food was amazing. It's hard to make grilled chicken this good. You have to try to cebollitas on the side. Portions were INSANE. We split a whole chicken with 2 sides and had plenty left. The prices were the best part. Spectacular value. This is the type of restaurant that gives me faith in small business in the big city. I'll be back many times. Cash only.", "pics": null}}, {"review": {"des": "We have frequented this place for the past 3 years. It's good, simple, and cheap. The quality has never wavered for us. We also love their homemade guacamole. They have bowls now too! Hope this place stays here forever!", "pics": null}}, {"review": {"des": "I love this place. The chicken is amazing!  It is so juicy and lightly seasoned. Their charro beans are delicious and I'm typically not a bean connoisseur because Asians rarely use beans in our cuisine. Now these beans I can eat all day. Service is friendly. They also load you up with free tortilla chips and two different salsas, and warm tortillas with your entree. Please note they accept CASH only.  We also enjoy the lime or grapefruit Jarrito's sodas.", "pics": null}}, {"review": {"des": "As a chicken lover, this place is amazing! Good prices. Good food.", "pics": null}}, {"review": {"des": "So finger lickin delish... Reminds me of el pollo loco out in LA. grilled chicken perfected. The grilled jalepeno punishes, cuidado!", "pics": null}}, {"review": {"des": "The best tasting chicken around!!!! They give you a bunch of delicious sides and tortillas and salsas. Service is good inside also.", "pics": null}}, {"review": {"des": "I first heard about this place when I worked in Lincoln Park 4-5 years ago. One of my regular customers was the owner of Chicago Bagel Authority. I mean, this guy would go to pollo express literally every single weekend it seemed like if not more. I knew I had to make it a part of my life's mission to try.<br><br>We arrived with a party of 4. We sat down to eat to which there weren't very many tables left. One table I initially had my eye on was still not cleaned from the previous party. So I we had to squeeze our way in to a table that was right by the cashier in a tight corner. Not comfortable. Not to mention It was pretty cold inside and most of us kept our jackets on while eating. <br><br>Everyone at the table stuck with water but they only had bottled water you obviously had to pay for. Service wasn't the best. Overall, id recommend to go. It was a busy day for them so service was beyond slow. We were finally brought a menu and the menu is pretty simple. You have the option between half an order of chicken or a whole order. Whole chicken dinner was enough for two even half an order would be too depending on your appetite.<br><br>Meals come with tortillas. You can get extra sides like beans and rice. We asked for jalapeños and they came out much much later. We only received two big jalapeños for the 4 people I was with including myself. Didn't make a stink out of it as only I and my brother wanted the extra kick so it worked out.<br><br>Chicken is seasoned well. Overly impressed? Nah. While juicy, tasty, tender and succulent it wasn't anything I haven't tried before. Rice was bland and wetter than usual and the beans were okay. For a whole order of chicken, rice, beans, 2 waters came out to 21.00. Not too expensive but still relatively pricey. <br><br>As we were leaving, we stood around awkwardly waiting to be waited on by the cashier to check us out. We never got a heads up to wait a moment and were pretty ignored. Our waitress eventually rang us up but would have appreciated some type of \"one moment\" rather than standing around in complete awkwardness.<br><br>Good? Yes. Great? Meh. Take it to go. Oh yes, and of course-cash only.", "pics": null}}, {"review": {"des": "I moved across the country and this chicken haunts my dreams. I miss you, my friend. Until we meet again.<br><br>Make sure to call ahead, but if you don't - it's worth the wait.", "pics": null}}, {"review": {"des": "U gotta call ahead of time to order because the line is always long but it's worth the wait", "pics": null}}, {"review": {"des": "The best chicken and rice in chicago! Can't beat price and taste. Very tasty. I would say best chicken in town. The rice is very moist and super good tasty", "pics": null}}, {"review": {"des": "CASH ONLY! They do have an ATM in there though which saved us since there is only a small sign on the cash register. Service was friendly (and I got by not speaking Spanish) and the charcoal grill makes the whole place smell amazing.<br><br>Simple menu and food was overall pretty good. The charro beans are delicioso. Boyfriend chicken was decent, not excellent. Guacamole was made fresh and was great! My biggest issue was how salty the rice was...hopefully just a mistaken heavy hand that day? I was thirsty for hours.", "pics": null}}, {"review": {"des": "So delicious! The whole chicken was just enough for my husband, myself, and our 4 year old. The molcajete was so yummy! Bring cash as it's cash only. Great place for a quick and delicious meal!", "pics": null}}, {"review": {"des": "This place is really great.  The marinated chicken comes straight off the grill, gets hacked up, and then served to you in a styrofoam container hot and tasty.  The only reason why it doesn't get five stars is that it is a madhouse on Tuesdays and Thursdays where the restaurant offers a free 1/2 chicken when you order a meal.  Still, Pollo Express delivers big time on both flavor and value.<br><br>Don't forget, cash only.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/tUfqm4twKBq4Xa1DNOTliQ/348s.jpg", "caption": "Menu from October 2015"}]}}, {"review": {"des": "This place never fails! I've been coming here for about two years and every order is correct and delicious. In September I finally placed a catering order, the girl taking the order was very friendly and helped with how much I should order. The delivery man was so helpful & insisted on carrying everything up my three floors of stairs. What an angel! <br><br>Highly suggest, cash only, give yourself time to find parking. They deliver if you're close. Definitely, a must try in Chicago! The sit in area is small but they're very attentive.", "pics": null}}, {"review": {"des": "Complimentary chips and salsa. Great grilled chicken, guacamole and arroz!<br><br>P.s. Name of restaurant isn't exactly on point. It ain't express.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/6fD1ELsPEs4EMtYiXjXJmQ/348s.jpg", "caption": "Guac!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/eZnNr2po2mG2LuTCtbZp-A/168s.jpg", "caption": "Guacamole!"}]}}, {"review": {"des": "Wow. The chicken was so juicy and good. Like I've never had such great chicken. The services was fast. Came here on a Thursday and had the full chicken and got a half chicken for free. I regret it. It was entirely to much food for one person but at a great price of only $15. Next time I go I'll bring someone to share the food. The rice was great too but I didn't care much for the soupy beans (forgot what it is called).", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/M_88vrFhie5prhxF1T1jYQ/168s.jpg", "caption": "Rice and beans"}]}}, {"review": {"des": "The grilled chicken is so delicious! The house sauces also helps. The place is compacted for dinning in, but the food and staff are great!", "pics": null}}, {"review": {"des": "Los Pollos Hermanos...oops I mean Pollo Express is a Mexican restaurant in the heart of Pilsen that manages to stand out because they do one thing very well: cooking chickens, al carbon style. Ya'll should be lucky Mark Geezy is alive to ask very important questions like: did Al Capone eat Al Carbon?<br><br>They also give you a good deal on said chickens, giving you half of one free when you buy one, on Tuesdays and Thursday's. Not to mention it comes with rice, beans, tortillas and salsa. I'm surprised I don't take my broke ass to Gus Frings' drug front restaurant more often. <br><br>So if you happen to be on 18th St and smell chicken, whether you're a degenerate alcoholic Mexican drinking Bud Light in front of a liquor store, or a white hipster who can't even, don't resist the urge to check this place out.", "pics": null}}, {"review": {"des": "Love this place. I recently catered for a family party and everyone loved the food. Quality is top notch, their portions are very generous. Their prices are unbeatable, I come from the north side bc other chicken places can't match this one. Also their service is amazing, very respectful and attentive staff who pour their heart into their business.", "pics": null}}, {"review": {"des": "Wow!  The food is good!<br><br>Ok...so a place called Pollo Express...wouldnt think it was that special, but it is.   The restaurant does it well.  You only come here for the chicken.  They always have chicken on the wood fired grill.   Makes for a quick easy meal to go.  <br><br>We dropped on by for a takeaway dinner and it was very quick in and out.  <br><br>We were very pleased with the food.  Didn't happen to be around for their much routed specials on Tuesdays and Thursdays for the additional half chicken, but we got what we came for.   <br><br>Each chicken came with a couple of roasted poblanos, salsa, and a package of corn tortillas.   Eat it hot! <br><br>The seasoning was perfect.  My kids are it up like they haven't had a decent meal for a while. We were very satisfied.  Love this place, we'll be back for sure!", "pics": null}}, {"review": {"des": "This is the real deal folks! Cheap and delicious chicken at a fraction of the cost!<br><br>Now, why three stars?! When I walked into Pollo Express, the cashier at the front unfortunately did not speak English, but we had a funny time trying to communicate with each other. I was not offended at all because she was extremely friendly and tried her best to get my order down. The other cashier who took my order however was incredibly rude. When I was ordering my food, a native Mexican lady standing behind me starting saying something to this cashier and she took down her order before me. I was standing there not knowing what was going on but after I realized that this hostess by-passed me I felt incredibly insulted.<br><br>Nevertheless, the place is very tasty and cheap. I ordered a half chicken which came with free chips and salsa. I am not usually in Pilsen, and I really enjoy coming to ethnic areas and experiencing different cultures. This place however really disrespected me and I don't plan on coming here again anytime soon.", "pics": null}}, {"review": {"des": "This is by far one of my best chicken restaurant. The chicken is so so good. Nice flavor and it's cooked just right. I recommend everyone to come and try this place out, I'm sure you will love it. Keep up the good work Pollo Express", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/9Z0wLDM8TdLYrqZ-o_CW7w/348s.jpg", "caption": "Only one way to describe this... Delicious!!!"}]}}, {"review": {"des": "So very sorry I don't have any pictures of my dinner<br>My family took over soon as I walked in the door.<br><br>As I entered the doors of this place the food cooking smell so very good.<br>To my surprise fresh chicken cooking on the grills was a winner for me.<br>Less then a 10 minutes I was back in the car on my way home.<br><br>My family enjoyed everything. The chicken was good and plenty of flavor<br>We enjoyed the rice and refried beans<br>And the grilled onions was really nice with a Lil hint of sweet.<br>Overall great place to grab so amazing dinner<br><br>This place is a winner", "pics": null}}, {"review": {"des": "Super flavorful chicken with a great char kick. Sides of rice and beans go perfect with the full or half chicken. Easy seating, clean restaurant. I recommend trying the cebollitas, you will not be disappointed!", "pics": null}}, {"review": {"des": "The menu here is pretty small, but they definitely do a good job with what's on it.  I've walked by a few times, and the aroma of the grilled chicken has tempted me to go in every time.  I finally made it in last week and regret not coming in sooner.<br><br>Tuesdays and Thursdays are buy one whole chicken combo (w/ 2 side orders) get a half chicken free (ends up being I think about $18).  Cash only, but there's an ATM on site as I was limited in cash, I ordered a half chicken with two sides which costed about $11 after tax.  It comes with tortillas, a big portion of rice, a big portion of beans (I got the charro beans), salsa, and onions.  You can definitely feed two people even with the half order, it was a pretty hefty bag of food I got.<br><br>The chicken is so delicious, hot, juicy, and flavorful, the charro beans were delicious, the rice was also very good.  I can't believe it took me so long to get here!<br><br>They are very efficient but there was still a little bit of a wait for them to cook the chicken, and the waiting area was a little crowded.  The dining area is also not very large.  I'll definitely be back again though, but maybe order ahead, and definitely be sure to bring enough cash for the Tuesday/Thursday special.", "pics": null}}, {"review": {"des": "A wonderful meal for a little bit of money. If you walk down 18th Street at the right time, you will get a whiff of the chicken grilling and see the smoke in the air. It draws you to a simple place, doing a simple meal... perfectly. Time and Time again. Forget Popeye's KFC,and the rest. This is the place to get your meal to go.", "pics": null}}, {"review": {"des": "All they do is charbroiled chicken with sides and they do It well. Tasty, highly seasoned and cooked to perfection. Pricing is great for a meal for an average size family or catering, and I have purchased both. Service is quick and customer service very accommodating!", "pics": null}}, {"review": {"des": "The amount of food you get for the price is unbeatable. They only accept cash which is the only downfall I can see about this place.", "pics": null}}, {"review": {"des": "Every time I come here I think why don't I come more often? You gotta do Tuesday or Thursday when you get a half chicken free with the purchase of a full chicken. It also comes with corn tortillas, beans, rice, slaws and salsas all for around $17. This gives me many meals (though before the boyfriend moved in, I would get more meals out of it). It smells so good. They do sell out, so all you have to do is call ahead and come get it 30 (or so - depending on the time of day you order) minutes later and walk out ready to devour your food!", "pics": null}}, {"review": {"des": "I love restaurants like this. They do 1 thing and they do it well: super yummy, flavorful, moist chicken at an incredibly reasonable price. We had a dinner for 3 (with leftovers) for about $25. I'll definitely be hitting this place up regularly.", "pics": null}}, {"review": {"des": "Sooo tasty place yummm..the cook with charcol :D. the chicken Pollo remaindered me to El Pollo feliz yeahh. The salsa was amazing but the other salsa (the pollo geliz common one) was not good. Cool they have mexican sodas. Sopa de arroz and beans nice. They give you chips and salsa cool. Reason of 4 stars is due to the service, i know is a family business but it can be improved. Additionally,  the place is cash only \"/.", "pics": null}}, {"review": {"des": "Definitely the best chicken in Chicago. Maybe even in the whole Midwest.  Rice and beans are equally delicious.  You can get a whole chicken with rice, beans, salsa, and tortillas for about $20 after tax.", "pics": null}}, {"review": {"des": "Enter into Pollo Express, and you'll feel like you're entering into any random chicken place. The brightly colored walls, the sneezeguard, and the small television mounted on the back wall broadcasting a telenovela were all familiar to me, so I prepared myself for standard fare. Fortunately, this Pollo Express is above average. For me, the only thing lacking was flavor in the chips and salsa, but hey that was free.<br><br>My group of three ordered a full chicken with the choice of two sides. The menu only offers three sides, and two of them are beans, so we chose rice and charro beans. The body of the chicken was quartered plus the wings and legs. The rice and beans came out in small containers, and the tortillas were delivered in a covered dish. This meal was more than enough for us and very good. The rice was warm, soft, and not too chewy. The charro beans were just okay, but the chicken was juicy and flavorful. The char on the chicken skin was great. The tortillas were thin and stuck to each other, but somehow still delicious. The menu is by no means extensive, but they do what they do well at this Pollo Express. Great food for an excellent price!", "pics": null}}, {"review": {"des": "Great chicken!! The chicken was very flavorful and not dry. Came with chips and two different salsas and onions and tortillas. Was only $11 for half chicken and two sides! Recommend for everyone who likes cheap fast and good food!", "pics": null}}, {"review": {"des": "It's a simple menu, fuckhead.  Do you like chicken or not?  Perfect for the indecisive.  But you gotta pick your beans.  You like 'em whole, or you like 'em mashed?  That's it, lunkhead.  That's all the thinking you gotta do.  So what the fuck's your excuse?", "pics": null}}, {"review": {"des": "This is the place to go for bomb chicken. Literally the bomb dot com chicken in Chicago. It's a family-owned hole-in-the-wall that accepts cash only so go prepared with enough money to order a whole chicken (you can choose your spice level) - be sure to order it with rice and beans.", "pics": null}}, {"review": {"des": "Like their name, they only sell char broiled chicken. I would say they're good at what they do. <br>I have ordered a half chicken without ant extra add on. As a lunch the meal was extremely satisfying. The chicken was charred to perfection not a single burned bitter bit. The skin was crispy and the chicken was marinated well, though I felt that chicken was slightly under seasoned. Like any other grilling the whole bird scenario, it has drawbacks. The thigh and the drumsticks were cooked to perfection and on the other hand the breast was dry. The tortillas were warm and soft. The staff were pretty friendly and helpful. Oh make sure you have cash on you as they only accepts cash. There us an ATM, but you gotta pay extra 2.50 dollar.<br><br>If you are around Pilson, check em out. Highly recommended!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/T_KwYWSE1M21FuwHnAdmYA/348s.jpg", "caption": "Half Chicken. It comes with warm tortillas and tortilla chips"}]}}, {"review": {"des": "When I first moved to the neighborhood I thought this was like a fast food fried chicken type of place and didn't go in for the longest time. <br><br>Now I want to go every week. Especially on Tuesday and Thursday. <br><br>You get a lot of food for a great price and the chicken is SO DELICIOUS. <br><br>Also the staff is super friendly. They're usually slammed but they always take the time to smile and be kind. <br><br>Cash only. I recommend calling in your order in advance and taking it to go. There is seating there, but they package it up nicely and you're probably going to have leftovers anyway.", "pics": null}}, {"review": {"des": "Grilled char chicken, one of my favorite things to eat and I love coming to Pollo Express - I tend to get the whole adobe spiced chicken combo to go which comes with a cup of re-fried beans and tomato rice and a pack of flour tortilla. <br><br>Tip: Every Tuesday and Thursday, if you order a whole chicken combo, you get and extra half chicken.", "pics": null}}, {"review": {"des": "Good chicken! <br>Very simple grilled whole chicken, but moist and flavorful and reasonably priced.<br><br>My friend lives nearby and immediately raved about her recent dining experience here, so we went to give it a try. It's honestly probably nothing I would go out of my way for if I weren't passing by the area, and I don't think it's so unique that I would seek out pollo express because I craved roast chicken or something. But it definitely was solid food and worth a try.<br><br>The tues/thurs take out deal is awesome! A heavy box of 1.5 chickens, a big mound of rice and beans, and a generous serving of fixings for BYO tacos. I asked for charro beans but I think I still got refried, and beans are not very good. 2 sides of rice is an option, and the rice is very much seasoned and flavored, and go well with the chicken. The tortillas were alright. We warmed them right on the burner of our stove top for just a couple of seconds. <br><br>Best part is... since they're constantly grilling and cutting chickens to order, it's like 5 minutes from ordering, paying, and getting the food.<br><br>Would come again if hungry and craving chicken in the area, for sure.", "pics": null}}, {"review": {"des": "I loooveee this place! It's my go-to spot for takeout (I've never dined in) on Tuesdays during weeks when I don't feel like cooking. I like to get the chicken special with charro beans, rice,  grilled onion and jalapeños and guac -- all of which tastes amazing stuffed inside of a tortilla.  Great food at a great price that usually lasts me a few days because of the massive amount of food they give. My only gripe is that it's cash only and the wait (call ahead!!!) on Tuesdays is about an hour to an hour and a half, but it's worth it!", "pics": null}}, {"review": {"des": "We had been using Nuevo Leon as our default Pilsen spot until we happenstanced upon Pollo Express, an absolute gem of a hole in the wall and a bit closer to South Loop on 18th, to boot. Walk in and get a waft of the adobo chicken grilling, and don't tell me your mouth didn't just exude a little drool.<br><br>Seriously, a whole chicken from Pollo Express is one of the best values around. It includes salsa, but I strongly recommend adding two sides and an order of guacamole. The latter is made fresh to order and is just a ridiculously big pile of green goodness. As for the sides, I love their Mexican rice, and though the charro beans gets a lot of love on Yelp, their regular refried is also tasty.<br><br>Calling your order ahead is preferable, though if you ordered guac, they won't make it until you get there anyway. If you order there, there is a small wait, particularly during peak times when they're throwing chickens into to-go's like nobody's business.", "pics": null}}, {"review": {"des": "Yummmm tues/thurs buy one whole chicken combo get another half free. Delicious salsa, retried beans and Mexican rice was on point!!!!! Can't wait to get more next week! There was a single grilled jalapeño on top of the chicken... I took one small bite and tears ran down my face the rest of the meal! I love spicy food but this jalapeño was probably the hottest one I've ever had!!! So be careful! :)", "pics": null}}, {"review": {"des": "One of the best chicken places I've been to, every time I am in area I make sure to order and take home, some times we drive more than have an hour to get their food.<br><br>The chicken is 5 stars, guacamole however is around 4.", "pics": null}}, {"review": {"des": "I love this place so much. My boyfriend picked up the whole chicken and a half and brought it home for us. I just think it's such a great easy meal. Probably some of the best chicken I've ever had. The beans and rice were also fantastic, but it's the fresh corn tortilla that really makes it. Soooo good! Tear a piece of chicken off, give it a good smear of the beans, wrap it in the tortilla and dunk into the salsa. Yum.", "pics": null}}, {"review": {"des": "CASH ONLY- Atm inside.<br><br>I cant help but to eat here once a week. <br><br>Tues & Thursday is their Special Deal- whole chicken with rice & beans and you get another half chicken. <br>Call ahead! Tue & Thu you will be waiting for a long time if you dont. <br><br> Its totally the best deal but you have to get it for take out.<br><br>I always get Guacamole, Cebollitas & the special deal. About $25<br>It always more than enough for 2 people, We make 2 meals out of it,<br>We always take the leftover chicken and shred it to make other things.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/NTRghw-5v305i0ob_rGl2g/348s.jpg", "caption": "$17 on a Tuesday. Chicken special"}]}}, {"review": {"des": "This place is the king of all chicken goodness. I've been here a couple of times, and there's a reason I keep coming back. If you come on a Tuesday or Thursday, they have a deal where you get 1 and a half chickens, rice, beans, and tortillas for $15. $15! The chicken is deliciously seasoned and thoroughly juicy. I'm never a big fan of white meat on chicken since dark meat is so much more juicy, but I enjoyed every bite of the white meat from my bird feast. The bean were tasty, and is it wrong to say that the rice was my favorite part of the meal? Oh so good.", "pics": null}}, {"review": {"des": "The food and prices are great!!! I gave it only 4 stars because I pre-ordered my food a whole hour in advance and I still had to wait about 15 minutes at the restaurant when I went to pick it up. The place was definitely crowded so there was no doubt that the food was going to be good.", "pics": null}}, {"review": {"des": "First timer?<br>You'll be confused.<br>It is server service and you just seat yourself.<br>No signs and you will be ignored.<br>To go? Order at register- no signs<br>No guest checks either- go to the register <br>and tell them what you had.<br>Cash only<br>No alcohol <br>Tips get pooled for everyone.<br><br>Guacamole and rice were exceptional.<br>My wife loved the refried beans.<br>The chicken had good flavor but was overcooked and dry.<br><br>Definitely not express.", "pics": null}}, {"review": {"des": "If you give anything less than 5 stars for Pollo Express, you're dead to me.  Dead!  <br><br>Pollo Express excels at pollo, and that's basically all you're going to get here.  On Tuesdays and Thursdays you can get a 1/2 order of chicken for free with a whole order.  FOR FREE!  I feel like I'm stealing from them.  For $15 and some change you get 1.5 chickens, rice, beans (your choice of refried or charro) and a pack of Atotonilco tortillas.  AN ENTIRE PACK.  They also throw in their two salsas and some pickled red onions, at least I think they're pickled.  I'm not sure, but they're delicious and despite my best efforts to hog the container, I begrudgingly share.  <br><br>I don't know where you're going to find better chicken than this, especially in this area.  I'm not saying other businesses don't know how to make delicious chicken, but Pollo Express has set a very high bar.  Cash only place and seating is limited.  Most times there's a wait, so I suggest calling ahead when possible.", "pics": null}}, {"review": {"des": "I gave this restaurant 5 stars for many reasons.<br><br>First, the seasoning on the chicken was outstanding! You could really taste all of the flavors at once. Next, the staff were SUPER friendly. Even when my brother left his $400 iPad in the place, they ran to us and brought it to us! I also love this place because when you get tortilla chips and condiments, they give you three things! <br><br>We had the chicken.<br>We also had guac and beans.<br>The pepper on top was a great touch!<br><br>I am for sure coming here again!", "pics": null}}, {"review": {"des": "I've eaten here several times over the past few years and apparently forgot to write a review.  Anyway, it's been consistently great.  The abodabo grilled chicken is fantastic on its own.  Thrown beans, rice, salsa, tortillas, etc, and the chicken is sublime.  Fast, inexpensive, and simply perfect.  Without question you should eat here.", "pics": null}}, {"review": {"des": "The delicious smoky grilled chicken smell that wafts down 18th St from Pollo Express is one of my favorite things about that block when I pass through. Tuesdays and Thursdays you get a free 1/2 chicken when you order a whole chicken combo. If it's for free, it's for me, so take advantage of the deal days! The combo comes with rice, beans, tortillas, and salsa, as well, for under $20! My fiance and I got at least three meals out of this; the leftover chicken is great for shredding up and adding to all kinds of things. CASH ONLY, with an ATM available inside. Neighborhood gem.", "pics": null}}, {"review": {"des": "I get the chicken special  here once a week. I love the smell and even got a wood spark shower last week waiting in line. So yeah real Pollo al Carbon. I live for this stuff.", "pics": null}}, {"review": {"des": "It was dark and rainy night and we had no idea it would be the day that changed our lives forever. We wandered in because of the smells. We sat down and they only had one thing on the menu, chicken. Americas Most Wanted was casually playing in the background. Did we order or did they understand our souls? Either way, we got the food. Salsa and chips, amazing. Rice amazing. Beans mildly amazing. Chicken extra moist and crazy amazing. We sat there for three hours eating chicken and watching Americas most wanted. It was one the best days of our lives. Later that night we weren't quite sure if we actually had tasted chicken that good or if it was a dream. We went back later that week and confirmed everything was truth: salsa, chips, rice, beans, and the CHICKEN of your dreams. The truth. People, I almost didn't want to write this review and let more people know Pilsen's hidden gem. <br><br>If you are fancy, this place is not for you. If you only eat vegetables, this place is not for you. If you put ketchup on your chicken, this place ain't for you. If you want to be bathed in chicken smoke and have a transcendental chicken eating experience, this place is perfect for you. <br><br>Negatives: None...well you need cash, they don't have a lot of tables but I've never had trouble getting seated, and they do run out of chicken by the end of the day so get there early so you too can have this life changing chicken experience.  <br><br>Enjoy ;) <br><br>Pollo Express: Where you can have your chicken and eat it too.", "pics": null}}, {"review": {"des": "I am writing this review from a dark place. Pollo Express has been closed for remodeling since the first of the year and lunch time has simply lost its sparkle.  No insanely juicy, perfectly charred, deeply flavored grilled chicken to look forward to; no amazing roasted salsa that we always finish before the chicken even gets to the table, none of that.  I am sorry to say that if this goes on much longer, I may consider getting rid of my mouth.  I miss Pollo Express so much, I actually called them 7 times today to see if I could get through to find out when they will reopen. <br><br>However, I know that I am not alone in my despair.  The forlorn look on my coworkers' faces has become the new norm for once enthusiastic, lunch-loving chicken eaters who now have to resort to okay chinese food or some mushy leftovers.  We've tried other pollo asado places, but nothing stacks up to Pollo Express.  But as the days go by with no addicting chicken, I know that at least we are in this together...and we will get through this together. One day, Pollo Express will reopen, we'll spend all of twenty bucks and we'll have an amazing feast of amazing salsa and out of this world chicken, and we'll get that sparkle back in our lives.", "pics": null}}, {"review": {"des": "This is a hidden gem in Chicago.  Took me a while to find it.  IT is so good.  Like finger licking good.  It is also healthy and in my opinion tastes better than KFC and Popeyes chicken.<br><br>Bring cash they have an atm but be ready to be charged to take out cash.", "pics": null}}, {"review": {"des": "One night we were running late on our way to a concert at Thalia Hall and needed food stat. We found this place here on Yelp and boy are we happy we did. We went in and devoured a chicken between the two of us (SO was no carbs at that time). I love beans and both the refried and charro beans are delicious. I typically am not a fan of rice but theirs is delicious! The salsa is also great. Guacamole good. The only drawback is the corn tortillas which tend to be dry, but we use them later for chilaquiles! We have gotten take out four or five times now, always brings happiness to the household.", "pics": null}}, {"review": {"des": "After having the place bookmarked forever, I finally had a chance to try it out. It's in Pilsen and thankfully we went on a day with ample nearby street parking. It was a busy, cash-only place with friendly staff. I was so excited for the chicken, but there was a long wait (call ahead) and the chicken was a bit on the dry side when eating the white meat portions. Some degree of being dry is ok, but this was a bit much for my liking. Glad I tried it, but there are too many chicken places in the city now.", "pics": null}}, {"review": {"des": "Pollo Express is greasy, delicious, goodness.   My husband and I went for a quick n dirty dinner before seeing a show at Thalia Hall.  We ordered some guacamole, a half chicken, and beans.  The meal is served with tortillas, salsas, chips, and cabbage (I think).  You pile everything together and create the most delicious chicken tortilla wrap thing ever.  The chicken itself was totally amazing--perfect spices, grilled and charry, moist and delicious.<br><br>YUM.", "pics": null}}, {"review": {"des": "I just. Ugh. I just can't tell you how tasty this chicken was. But I will try. <br><br>We were not that hungry when we came in. It was more a perfunctory act of \"we really should feed ourselves before we go on another adventure because god only knows when we will have time to eat.\" But the second my eyes met the giant indoor grill covered in crisping, marinated chicken parts, I knew my stomach was doomed to a stuffing it has not seen since the winter of '13. <br><br>Having experience with many other grilled chicken joints, I knew a whole chicken was not for us. So a half adobada chicken we got. So moist, so flavorful, and I even ate part of the skin (I don't normally love skin but this stuff was irresistible). My vegetarian friend got a side of guac, whole beans, and rice. By the by, not the best place for a strict vegetarian. My buddy was a bad ass and just dug out the pork bits of the beans and passed it onto us without complaint. And I'm pretty sure the rice (judging by its insane tastiness) was cooked in lard or some other unhealthful, meat-infused equivalent. Doesn't matter. We all CHOWED DOWN like it was our quinceanera and we all still had the metabolisms of fearless and lusty 15 year olds. <br><br>Our waiter was super kind and attentive. The food was nice and affordable. The restaurant was clean and simple. How I wish there was something like this in walking distance from my house. /sigh", "pics": null}}, {"review": {"des": "Yeah as soon as I hopped out of my car and took a whiff I knew this was going to be some amazing chicken... And it is. The entire street was full of the amazing aroma of meat grilled over an open flame. I couldn't live close by because I would always be hungry. This is the kind of chicken you will get some major cravings for once you've had it and you will go out of your way to come back for a  taste. <br><br>Fantastic flavor and cheap. Call your order in ahead if you can. Don't miss the grilled onions either.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/NvSfwZK5A9mQZGD_BYAuhA/348s.jpg", "caption": "This is what I like to see"}]}}, {"review": {"des": "Absolutely delicious.  A whole chicken with refried beans, rice, corn tortillas, and various salsa comes out to about $15.  This can easily feed 3 people (or if you're a big eater like my husband, maybe just 2).  Chicken was moist, flavorful, and had that wonderful smokey flavor that can only happen when grilled.  It's like El Pollo Loco on crack - same concept but waaaaaaay better tasting!<br><br>FYI, cash only!", "pics": null}}, {"review": {"des": "Excellent food. Perfectly seasoned and cooked grilled chicken, along with roast onions and beans. Lots of food at a reasonable price. We split a flan to finish our meal and it was creamy, sweet, and delicious.<br><br>I recommend this unassuming restaurant in Pilsen.", "pics": null}}, {"review": {"des": "This place is amazing I love the way the style and the sides can't ever go wrong on Tuesday and Thursday !!", "pics": null}}, {"review": {"des": "Can't say enough good things about this place... First off, you HAVE to go on Tuesday or Thursday for the special. My roommate and I ordered the special (one whole & one half chicken + rice & beans + corn tortillas + picked onions + salsa) as well as the chips and guac which came out to be around $22. We were stuffed and had plenty of leftovers for the next day.<br><br>Now for the chicken - I don't know if it's how they char it but it's AMAZING. Packed with flavor & not dry at ALL. It was great how we could assemble little tacos for ourselves or eat it on its own. The guac is super fresh too. Anyway, if you're in a rut to decide on a place to eat, definitely give this place a try! You won't regret it!", "pics": null}}, {"review": {"des": "Boy oh boy - Simple...grilled chicken, tortillas, rice and CHARRO BEANS.  The beans go good on the tender Mexican style rice.  Even the breast was juicy and tender a couple of days later (I'm on a diet).  Make sure you get charro beans and extra marinated onions.  They only take cash no debit.  You will be in and out within minutes with some of the tastiest chicken around.  BTW - when they are grilling the smell fills 18th Street and surrounding areas.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/FJsBTlKJTcIOh5uww7t5mQ/348s.jpg", "caption": "MMM...grilled chicken!!!  Juicy and tender - and the smokey taste!"}]}}, {"review": {"des": "Great grilled chicken. The grilled onions are a must. Beans are so-so. Very nice people. Come for the chicken, no ambiance.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/NNxZciGNeLkKK7BcHf9Y4A/168s.jpg", "caption": "Grilled onion"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/TQgF7dJyvFgkkZ-XTxoYgw/168s.jpg", "caption": "They do one thing well."}]}}, {"review": {"des": "This is our go-to-spot for lunch. Its convenient ( right across the street). When we go on our random diets we gravitate to \"Pollo Express \" for the . The chicken is juicy ,tasty and healthy :). Keep up the good work! don't change a thing!", "pics": null}}, {"review": {"des": "Just stopped in for a quick bite. I was with my wife. And to my surprise the food was excellent. We ordered a half chicken adobo grilled to perfection. It came with rice and a choice of beans. We chose the charro frijoles. The homemade salsa was great!  Will most definitely be back.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/yXBqqvR8T6D44YVoa3_IEA/348s.jpg", "caption": "Adobo chicken, rice & beans & corn tortillas!"}]}}]}