{"name": "prime-and-provisions-chicago-4", "reviews": [{"review": {"des": "I liked three things about this place. <br>1. Customer service - started from reception area, coat service, our server with so much information<br>2. Food quality <br>3. Coat and backpack service, not many restaurant offers it<br><br>It was great experience to dine at this place with some of my coworkers. I had NewYork strip steak, simply amazing and melted in my mouth.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/1ZceeaiGaY1zKnSBLtpWgw/348s.jpg", "caption": "Not the best quality photo because i was so much in to eating this delicious food"}]}}, {"review": {"des": "We've been here three times, the most recent time was for Thanksgiving dinner/buffet. I have to say I was a bit disappointed after so much anticipation having come a few months earlier for my husband's birthday, that Thanksgiving evening was good but less than excellent. The first time we went for their buffet the area was spacious, service was very attentive and food was so so good. The seafood was done perfectly, not too salty. <br><br>This time, the seating area was very crowded (understandably due to the holiday) but it was not very comfortable being seated so close to other tables. First, entering the restaurant with a child in a stroller, there was no door to enter. The door was blocked off and it took several minutes of knocking to get an answer. The guests inside were blocking the door and nobody wanted to open it because it was roped off. How do handicapped people get in?? Second, the high chair that we were given was broken, one strap was missing so I was unable to buckle my daughter in securely. <br><br>The food did appear to be more mass produced - the crab legs were so super salty and the fried chicken (was not as good as before). Also my favorite part was the sweet potato mash and the pies. They never disappoint with the pies so that was basically the highlight of the evening. I will come back because no place compares to their pecan pie but generally, the quality of their buffet has declined - which is sad because we were very excited about this replacing our usuals.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/8NuqHQpycl1jlQy-O4uyHQ/348s.jpg", "caption": "Dessert station"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/d75IZjCqWcr6PRiwI08syw/168s.jpg", "caption": "Seafood station"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Z3F1ZCIeWMYRo5PA5sDgMw/168s.jpg", "caption": "Brunch salads - beets and chopped are good!"}]}}, {"review": {"des": "Review on brunch: <br><br>Came here on a Sunday morning for a birthday brunch for a friend. Needless to say, I was not impressed. The brunch spread was not much of a variety as I thought it was... They had one section blocked off to have the brunch spread lay out. There was crab legs and oyster but they were a hit or miss. Some of it was good and some of it was bad (more of the bad than good). Some of it tasted like you got is fresh out of the sea and sewer like taste, it just left a bad taste in my mouth. For $60, I really expected to be blown away but that wasn't the case. <br><br>The sad part was, what I enjoyed the most at brunch was the mashed potatoes... The dessert wasn't anything outside the ordinary. It felt like the dessert you got from a wholesale store. Nothing wrong with that but I really was expecting more. The service was phenomenal. They always made sure we had water when needed as well. <br><br>Don't think I would be coming back anytime soon... I left really unfilled of my moneys worth.", "pics": null}}, {"review": {"des": "I found nothing outstanding nor terrible during my visit to prime & provisions. The cocktails were a nice balance of flavors but sort of lacked a punch. The food was also nothing to get excited about. What I disliked about the house potatoe chips/nachos was the fact that the chips had a soggy texture to them. The cheese was a nice touch as it was a cross between a béchamel & blue cheese. The sliders had a nice flavor but the cheese resembled imitation & for some odd reason the pickle was on top of the bun making what should've been a finger food a slimy mess. Lastly the the lobster roll could use some t.l.c. It felt like more filler than anything. The staff were accommodating & albeit it being happy hour the restaurant had plenty of seating. There's an alleged wagyu steak on the menu but I doubt that I'd indulge or plan a return here...", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/_jvsQDfuzx_PK5ogFPnmqw/348s.jpg", "caption": "Petite dry aged cheeseburgers"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/KWFMaagYpROu1igNF_mKJw/168s.jpg", "caption": "Lobster roll"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/SATsMPdTMTRquG1ogn9wWQ/168s.jpg", "caption": "House potato chips"}]}}, {"review": {"des": "Quality steakhouse in chicago. Right in downtown and very accessible by the chicago river. The atmosphere is great with a steakhouse feel. Bar area is a bit small but the dining area is great. Big booths and tables. The service was impeccable. Our waitress explained everything and the specials. We had questions on the different cuts and it was explained thoroughly. <br><br>My go to would be the bone in ribeye. One of the best i've ever had. Ribeye is hit or miss with me either too fatty or too sinewy. This one was great. Not sinewy and just the right amount of marbeling. A good salt and pepper crust and it was cooked medium. The oyster appetizer we had was also great. A fresh selection of west coast and east coast.<br><br>Come here for the steak though.", "pics": null}}, {"review": {"des": "One of my faves places for steak and bacons! <br><br>They just launched the sunday brunch services with king crab legs, oysters, dry aged prime ribs, and of course, their bacons! Put me down for some! <br><br>Totally didn't expect this...but that bloody mary bar and dessert table!!! Thank god i have another stomach for dessert! The chocolate mousse and the lemon meringue cups are not to be missed! I don't usually like lemon dessert, but this one at P&P...not too sweet, not too tart! <br><br>Apparently, chef Nem runs the show and he stopped by our table...totally star stuck as I followed him on instagram...no wonder the super yummy dessert spread.", "pics": null}}, {"review": {"des": "I went here with my work team for an outing as it had been recommended to me by several people in the area. Great service & food! We got the fried chicken for the table & oysters as appetizers. Some people in the group got soups. I got the provisional fish (halibut) for dinner, while the rest of the group got steak. We had several sides to share including the sweet potatoes, broccoli, Brussels sprouts, and corn. Also, we got a bottle of red wine to share. <br><br>The corn and sweet potatoes were really great! I would recommend getting those. I really enjoyed the fish as well.  Everyone in the group enjoyed the restaurant. <br><br>We also got the Peanut butter pie for dessert which was really delicious! If you like PB, I would definitely try this out.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/HEiNc2PdqEKfYB5K6wm4NA/168s.jpg", "caption": "Provisional Fish - halibut!"}]}}, {"review": {"des": "Came here for dinner meeting with my team. Good to come here with a group rather than by yourself so you can order the big steaks and try bunch of appetizers and dessert.<br>So what did we order:<br>Mountain Cuvee<br>Old Fashion<br>Lobster with Avocado appetizer<br>Caesar salad<br>Porterhouse<br>Brussel Sprouts<br>Wild Glaced Mushrooms<br>Bottle of LUCA Malbec<br>Smores<br>Everything was divine and delish! Julia took care of us and so did the somelier! <br>Best tasting porterhouse I have ever had.<br>Will definitely be back again with the team.<br>Trust!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/lK5no-IXh4wFLTf2Sg89GA/348s.jpg", "caption": "Charred Brussels Sprouts"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/dxgXvePQcoKO4_J9wh0R0Q/168s.jpg", "caption": "Lobster & Avocado"}]}}, {"review": {"des": "P&P is awesome for two reasons:  B&B<br><br>That means Bacon and Brandee.   My buddy and I came here for a steak dinner while in Chicago and this place didn't disappoint.  Brandee was our server and she was the best.  She is able to read a table and then tailor her service to the people sitting there.<br><br>After we ordered cocktails, she recommended the fried chicken and bacon starters.  How could we say no?  The fried chicken was delicious and fried a perfect golden brown.  So good and juicy.  But the bacon was the showstopper.  Wow, was that good!   <br><br>I was so full I could barely eat my ginormous rib eye, which was also delicious.  But it was way too much for me.   I couldn't finish my brussels sprouts but I did make room for all the delicious mashed potatoes.  Everything was so good.<br><br>Brandee saw that she had broken us and we had no more room for dessert so she gave us a big honkin' piece of chocolate cake to go, which was perfect to split for breakfast the next morning.<br><br>When I'm back in Chicago, I'm coming here and I'm asking for Brandee.  You should too.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ZdjB0QwKJ-fsDErfshpyAw/348s.jpg", "caption": "Whipped potatoes.  Yeah, whip those bad, bad potatoes"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/xKHfN-dXU0SJaJ6LUAcnyA/168s.jpg", "caption": "NY Strip. Because I'm from New York"}]}}, {"review": {"des": "Let me start by saying, great service, first class, we were a group of 5, and were taken care of by the staff. I thought the prices were ridiculous high, if you're on an expense account, who cares, if you're paying for it out of your hard earned work, you can do better elsewhere.<br><br>I had the ribeye steak, it was good enough, but maybe worth 35 bucks not 70... plus, for these prices, sides should be included, they are not. <br><br>One of the people at our table asked the waiter to recommend a glass of wine with his steak...he did all right, a 35 dollar glass of wine , we found out about the price when we got the bill, for 5 of us ..we spent 600 bucks.<br><br>As we left around 8:30 on a Saturday night, most of the tables were 30 something couples, decked out to be checked out (the women)<br><br>Never ever, going here again.", "pics": null}}, {"review": {"des": "Meh... we went there only because we wanted to see The Art on TheMart from a convenient location that didn't require us to freeze our butts off. And we were also celebrating the last weekend as an unmarried couple so it was a dinner and a show kind of Saturday. We did get the table with the best view of the mart so 1 star for that. I got the burger and my husband got the steak. Both dishes were unmemorable. The only two cabernets on the wine list that you could buy by the glass were underwhelming, I didn't enjoy either one of those. My water glass had someone else's lipstick on it which is super gross and spoiled the rest of the meal considering that I have already took a couple of sips before I noticed it. They did serve us complimentary dessert so one more star for that as well. I will not be back.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/tFf0IY6pvjA_BV780t90Ig/168s.jpg", "caption": "Complimentary dessert"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/AykHVvG9nt1oOXzhlbUbrQ/168s.jpg", "caption": "Someone's lipstick on my water glass"}]}}, {"review": {"des": "You can't give 1/2 stars so I had to round down. I had lunch there and selected a NY Strip. It was $58. If you can't get the temperature right at that price point, I'm warranted to be critical.<br><br>I really think this place is as spectacular as the strong ratings suggest. The sides I had were nothing short than terrific. The properly whipped potatoes, with a horseradish parmesan crust was the real deal. Mushrooms were great, too.<br><br>The flavor of the steak gave me confidence that a second visit that this issue of being served a well-done steak when I ordered medium wouldn't happen again.<br><br>To the Manager, Patrick O'Donoghue's credit when he saw this, he offered to redo it. I didn't have time to take him up on that offer. However; I was pleasantly surprised that he took it off the check.<br><br>Glad he stood behind the quality of their food. I will be back and I'm sure this 3.5 will be morning less than 4 stars and better yet; 5.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/MOtzoonwlCaomnu7zqLhfA/348s.jpg", "caption": "NY Strip + mashed potatoes + mushrooms"}]}}, {"review": {"des": "Had a wonderful dry-aged, center-cut Porterhouse (tenderloin AND strip) in medium-rare here. A solid 9 on 10, at least. It's served in a 600 degrees(f) plate, which allows you to cook the meat more (if you'd like); as you chomp down on the soft, gooey meet provided by Creekstone farms. Absolutely ace. 10/10 would recommend! Also tried the sliders, the fries, the French onion soup and a simple tenderloin and creamed spinach along with it. Great place, great atmosphere, and an amazing selection of the finest wines. Will be back soon.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Ifa5ia2fc5LS7df3ekGlrw/348s.jpg", "caption": "Center-cut Porterhouse #tenderloin #strip"}]}}, {"review": {"des": "This place was a very quality meal. The restaurant is very clean and crisp when you walk in. It's located right by the river in the heart of downtown. We came on a whim and were seated at a high top in the front room. Our waitress was patient while explaining the menu, but had a bit of an attitude if we had questions, substitutions, etc. It's nice because everything is 100% all natural with no hormones or additives. They import their beef from a farm in Kansas. I ended up ordering the sea bass, and It was some of the best fish I had ever had. It melted in my mouth and came with a risotto that was cooked perfectly and was so creamy and full of flavor. I would definitely come back and order the steak. Their veggies also looked delicious.", "pics": null}}, {"review": {"des": "Fantastic steakhouse in downtown Chicago. Our server Michael Dempsey was excellent!! The food was served quickly and was absolutely wonderful! Steaks were tender and flavorful. Sides were quite plentiful and delicious. Overall a fantastic dining experience with a wonderful environment!", "pics": null}}, {"review": {"des": "Join the ILLUMINATI today and be liberated, enlightened and illuminated hence start a new era of your life with endless riches, fame and powers bestow unto you from beyond reply for initiation <a href=\"mailto:dukevasco@elitemail.org\">dukevasco@elitemail.org</a>", "pics": null}}, {"review": {"des": "We went there for group outing. There were 12 of us, and we ordered a lot of food and various drinks. For the price we were paying, I definitely have been to much better places in the city.<br><br>Pros:<br>I loved all our starters, among them the fatty bacon and oyster were especially tasty. <br>Most of the side dishes were good. I recommend mashed potatoes.<br><br>Cons:<br>Several of us ordered French Onion Soup and all agreed it tasted very salty and weird.<br>Steak was just so-so. I wouldn't say it is bad, but for $72 per steak, you can get much better.<br>Service is below industry-average. The restaurant is in dark light, we had problem locating our table, and the front desk girl REFUSED to take us there after I politely asked her twice...quite shocking...", "pics": null}}, {"review": {"des": "We really wanted to love this place so far it has not lived up to our expectations. <br><br>First time we were here we tried the filet, prime rib, Mac n cheese and mashed potato. The filet was tender but lacked flavor. The prime rib was way to fatty for my liking. The sides were basic. Nothing notable about them.<br><br>Next time we came we sat at the bar. We had the filet, petite burgers and fries. The filet was just as underwhelming as the first time. On the other hand, the petite burgers were really good. The meat was cooked perfectly and well seasoned. It was juicy but not overly watery where the bun got soggy. The fries were also really good. They were crispy on the outside and soft on the inside.<br><br>Overall we've been here twice and the second time better than the first. We live right next door so we'll probably try it at least once more.", "pics": null}}, {"review": {"des": "LOVE, LOVE, LOVE!!!<br><br>2nd time here, but 1st review.<br><br>Dry-aged Bone-In Ribeye prepared a perfect medium. Sooooooo flavorful and soooooo juicy. Just melt in your mouth goodness!<br><br>The Baked Potato is gi-normous and was DE-LISH served hot and fresh. <br><br>I love both sauteed and creamed spinach, but I decided to go with the creamed spinach. Sooooo glad I did! It was absolutely scrumptious! <br><br>I am a whiskey girl and their selection here is AMAZING! Macallan is my all time fave. They even have Macallan M. Too rich for me, but a girl can dream, right?! Plus they have a patio where you can smoke cigars. Yessssss!!!<br><br>Had a glass of the Malbec, which was a perfect accompaniment to my steak. Full bodied with a nice long velvety finish!<br><br>It's hard to describe the atmosphere. It's swanky and trendy yet it has an old school vibe. 5 stars all the way, including service, but comfortable and unpretentious. <br><br>One of my favorite steakhouses in Chicago!!!", "pics": null}}, {"review": {"des": "Best takeout in the loop for when you want to bring some fine dining back to the office during your lunch break. <br><br>Porterhouse is fantastic, bacon is incredibly rich though not quite my style, fried chicken is delightful and manages to come close to what you'd find at Roister. An incredibly pleasant surprise to find at a steakhouse.<br><br>I do have issues with their prime rib and oysters at Sunday brunch. You're obviously not going to get the best oysters around with a buffet, but at that price point I did expect a little more. Certain cuts of prime rib at times can be incredibly salty and far too savoury. It can be frustrating to be have that experience with what is supposed to be the centerpiece of the brunch.", "pics": null}}, {"review": {"des": "Okay... moment of transparency. I am a big steak and potatoes girl. My favorite steakhouse is STK. Like I stan for it. There isn't one in my city so every time I travel, I'm looking for an STK. STK Chicago was actually my very first STK experience. Sadly they were closed for a private event the weekend I was in town. So I sought out to find a replacement. I came across Prime & Provisions and hoped for the best. When I tell you it was GOOD. It was good! Firstly they accommodated us even though we were late for our reservation (too many drinks in the hotel lobby). The atmosphere was very lively and loud which is the way I like my restaurants.<br><br>We started out with the warm crab salad. This is an absolute must try if you ever visit this restaurant. It comes to your table as lump crab on a bed of lettuce then your waitress proceeds to chop and toss it. The crisp lettuce against the warm crab was amazing. For our meals we had classic steak house picks: filet mignon, loaded baked potatoes and broccoli. Everything met my standards. If we didn't have tickets for a concert we probably would have ordered more food!", "pics": null}}, {"review": {"des": "We loved our meal at Prime and Provisions. We were also lucky to get a reservation on a Saturday night before the Chicago Marathon (thank you to the hotel concierge for making it happen!). Prime and Provisions has  very modern and trendy decor. We were greeted by a hostess as we arrived and shown to our table. We had a huge semi-circular booth with a table we had to push out to get to our bench. We have a great vantage point of the entire dining room and every other table was taken. <br>Service: our server was great and the team of staff was constantly bussing the tables and running around. At times it felt a bit too rushed and too obvious with all the earpieces and people running around like they were in the CIA to communicate about open and cleared tables. <br>Food: outstanding salad with avocado and tasty dressing. We had a pork chop for one entree and then I had the scallops. The pork chop was a bit tough to eat. My scallops were perfect. The side of french fries with rosemary were the BEST. You have to get those to share. <br>Wine: nice selection of wine and prices are in line with city prices. <br>Dessert: we had the homemade ice cream and it was divine. <br>We had a very enjoyable meal even though it was a loud Saturday night. The food was excellent and next time I hope to try the steak.", "pics": null}}, {"review": {"des": "We had a pleasant time at the bar at Prime & Provisions. We ordered oyster which were on point, fresh, briny and well shucked, which believe it or not it's hard to get, and we also got the burger. Excellent choices for the bar area. The drinks were equally good, well crafted martinis and cocktails. The restaurant has a masculine vibe in its decor, it's classy and the staff is very professional. I noticed several members of the staff focusing more on the male experience than the female, at least at the bar. I might be wrong but that's the vibe I got. Definitely recommend this place if you are an oyster's lover and like to take advantage of the happy hour.", "pics": null}}, {"review": {"des": "Came here last night for a dinner with ten of my coworkers. Have passed the place a million times and never went in. It was jam packed for a Tuesday. The only complaint I have is that we were seated very closely to other tables so it was hard to maneuver to get in and out. Had the best experience. Had the fried chicken and bacon which was delicious enough to be the meal. Great wine. My water was refilled every time I took a sip. Best part was server-Jessica. You could tell she was busy but man was she on point. She turned our leftover steak into a sandwich to go. I mentioned I wasn't a chocolate person and got this amazing vanilla Leche cake. Will be back with my wife and will ask for Jessica.", "pics": null}}, {"review": {"des": "My friend and I went here for their brunch special. They had so many different options for brunch that we were both able to get what we wanted. They had a carving station of the prime rib and it was delicious. My favorite part was the bread pudding for dessert. Stephan was our waiter and he was awesome. He was super personable and attentive. I would definitely go back and have Stephan as our waiter again.", "pics": null}}, {"review": {"des": "Had the best meal here for a small birthday lunch celebration. We had a reservation for a Friday during the summer which looked necessary unless you were ok sitting at the bar<br><br>A couple people got steaks that they said were good. A couple people had the cheesesteak sandwich which was DELICIOUS! The fries were very tasty too. The meat and cheese and bread ratio were perfect and slightly crispy. The broiled salmon was perfectly crispy and the flavors of the garnishes were just enough and very bright. Everyone also had a taste of the crab and cucumber gazpacho which got the thumbs up. For sides we got the whipped potatoes which we practically licked clean. Somehow we still had room and the chocolate caramel cake and peach cobbler did not disappoint. They too were kicked clean!<br><br>Service was great! He was friendly and detailed and made sure we had a wonderful time. It's a somewhat loud dining room but not too bad where you're shouting across the table. My dad is still talking about the meal weeks later and wondering when we can go back!", "pics": null}}, {"review": {"des": "When my CEO asks me to recommend a restaurant I hope to get it right. <br><br>Being a former career waiter in Chicago I pay attention.  <br><br>Bartender : \"you need to move\"! Just trying to stand there and order a drink.  Wasn't sitting   Smug bartender in a what I could tell not a full restaurant so please say thank you and hope you enjoy your dinner. Not hand me a $122 tab for 3 drinks and act like I ordered Miller liter<br><br>Don't deal out plates servers.  Especially when we are paying 90 a steak and one is sent back. <br><br>Had 1000 restaurants to pick from.   Service is B team. I was industry for 10 years  , I know what level those servers are supposed to deliver and they are way far from there. <br><br>It was our anniversary and we were going to see Tootsie around the corner this past Saturday night. It wasn't for business but they had invited me back. <br>Michael was our server and recommended an amazing steak and wine.  We had a beautiful dinner.  Thank you for the invitation back.  Class act follow up and execution. I have to say, even with my last visit, their steaks stand apart from all the rest of the chop houses in Chicago.  <br>Thank you so much for caring about your patrons.", "pics": null}}, {"review": {"des": "Wow!  What an experience.  I have walked past Prime & Provisions a hundred times and FINALLY made it in for Sunday brunch yesterday (10/21/2018).  I cannot say enough good things about this restaurant.  <br><br>Firstly, the staff was wonderful.  Our server was the perfect mix of attentive but not over the top, the manager (Jennifer) stopped by our table multiple times to check in on our dining experience and see how everything was tasting and in general everyone was just really friendly.  <br><br>THE SPREAD WAS AMAZING!!! The prime rib was out of this world, the seafood bar was overflowing with fresh and delicious shrimp, crab legs and oysters and the dessert bar... drool.  They have this really impressive Ferris Wheel that offered up different varieties of pies as it turned! There was something for everyone here<br><br>Living in Chicago there are endless options for great food and dining experiences that won't disappoint, Prime & Provisions delivered in every aspect.  Highly recommend!!!", "pics": null}}, {"review": {"des": "Mixed feelings about this place initially, but the service and food made up for any doubts I had. We requested a booth in our reservation and they delivered without an issue. We had to wait a little bit, but not a huge deal. They provided a free coat check which was nice. The place is loud so having a curved booth to sit in was great as I could actually talk to my wife!<br><br>This place is expensive, but in this case you get what you pay for! I ordered a drink and it was pretty weak, asked the waiter to make the next one stronger and he did just that. And recommended their old fashion for my next, which I agreed with and it did not disappoint. He also didn't charge me for the weak first drink.<br><br>The steak I ordered, the dry aged strip was seriously the best damn piece of steak I've ever eaten in my life. The whole thing was edible with only a small fork sized price of fat. It costed a pretty penny but woah was it good.<br><br>Desert... Please make sure you save room. The peanut butter pie was ridiculously good and capped off the night perfectly. <br><br>Do yourself a favor and make a reservation here next time you are in the city. You won't regret it. And for the veggie eaters... The salads are fantastic as well.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/DfXXmPIUJYZV-SktItm1lA/348s.jpg", "caption": "It's dim in here... But the dry aged strip was the best."}]}}, {"review": {"des": "Took my family for brunch to Prime and Provisions during a family holiday trip to Chicago. Excellent service from Jen and Stefan. For a family of critical eaters, it hit on all points. The food was amazing and service was top notch. <br>Stefan had attention to every detail and gave my family a holiday brunch experience they will always remember. Hi-five to Stefan, which is is like Steve, slightly more ethic. ask for him...if you want the best dining experience here.", "pics": null}}, {"review": {"des": "Decided to celebrate a milestone birthday at Prime & Provisions and it was the right move! We had reservations at 7pm and were seated in a cozy booth. Our waiter was very enthusiastic, thorough, and attentive. I ordered the daiquiri and it was fresh and yummy! (A little weak though). <br><br>We ordered three filets (6oz, 6oz, 10oz) with lobster tail on top and a prime rib. The prime rib was A BIG piece of meat and cooked to perfection. Everyone enjoyed their filets, however I must've gotten a different/lesser grade cut because I snagged a piece of my dining partner's filet (we both got a 6oz) and hers was easily 10x more tender and buttery. She was raving how it was the best cut of meat, however I definitely got a different slice. <br><br>We also ordered a side of the smashed potatoes and those were the star of the show. The waiter convinced us to order only one of them, and I wish we pushed back and got two (there was 4 of us). I could've eaten a whole bucket of those myself! Best potato side we've had, ever. <br><br>They also gave us a s'mores dessert on the House with a candle. It was a really special touch. We ordered a creme brûlée and a banana cream pie as those were more up our alley and we didn't leave a bite! It was certainly one of the best dinners we've had and the restaurant made it very special!", "pics": null}}, {"review": {"des": "I was in Chicago for work and my team had dinner here.  Our office is in the same building so it was an easy choice.  We were able to get a table for a large group pretty easily even though the place was busy.  <br><br>We had a variety of items and we all really enjoyed our meals.  Our waitress was a bit slow at times but overall was good.  I am supposed to each dairy free and she made sure my dishes (other than the sides) were made without dairy.<br><br>I started with the Wedge Salad: Baby Iceberg Lettuce, Charred Red Endive, Thick Cut Bacon, Cucumber, Purple Onion, Tomato. I went with ranch dressing and no cheese to make it dairy free.  It was still really tasty and I loved the bacon on it.<br><br>For my entree, I had the 6oz petite-cut Filet Mignon.  The steak had good flavor and was cooked medium rare like I wanted it.  A bit pink inside but not too pink.  <br><br>We had a variety of sides and they were all good.<br><br>Decadent Macaroni & Cheese  - yum!<br>Purple Cauliflower Au Gratin - this was so good.  Loved the cheese in it.  Yes, I know that is dairy but I had to try it. <br>Charred Brussels Sprouts, Elephant Garlic, Crispy Bacon - super tasty and crisp. <br>Sauteed Wild Mushrooms - they made this dairy free for me.  Loved the flavor.  Lots of variety.<br>Onion Rings - crisy and tasty.<br><br>Overall I great meal and location.  If I am in Chicago again, it will definitely be a dinner option.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/4wa8tBXD9sGJePrxizzHrw/168s.jpg", "caption": "Filet Mignon"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/qKW7GZSjZRwLJwDXTmfZog/168s.jpg", "caption": "Wedge salad made dairy free"}]}}, {"review": {"des": "The hype is real. I finally made it here after putting it on my To Do List. We had a big group go for work and usually from my experience, this makes it harder to get everyone's steaks cooked the way they ordered. Despite our giganto group, My Filet Mignon was perfectly medium rare. The potatoes were to die for, and I actually liked their Brussels sprouts, which normally I'm not a huge fan. I loved their wedge salad, the thick cut bacon was sinfully good. Service was great. Can't wait to come back!", "pics": null}}, {"review": {"des": "Just had an amazing brunch buffet at Prime and Provisions! We celebrated a girlfriends birthday and we're so happy with the food and service, our waiter Luis was a doll, so kind and brought her a delicious strawberry cheesecake with a candle and happy birthday. My fav dishes were the pan seared salmon with mustard glaze and their waffle station is pretty much like heaven on earth, their bacon is by far the best buffet bacon I have ever had! Love love this place can't wait to try their dinner menu!", "pics": null}}, {"review": {"des": "I have been wanting to try this steak house for a long time. It did not disappoint. Our waiter, Andras, was very knowledgeable about the menu. He was friendly and helpful. He gave suggestions based on what we preferred and not on his own likes/dislikes. Our table of 4, ordered bone in ribeyes and Kansas City strips. I sampled both; they were both flavorful and delicious! For sides we had sautéed spinach, mac and cheese, properly whipped potatoes, and the \"special\" mushrooms. Everything was fantastic. My husband tried the \"off the menu\" old fashioned. He thought it was exceptional, just as Andras had suggested it would be! Our dessert was caramel creme brûlée- a light, flavorful dessert. <br>I would definitely return to this steak house!", "pics": null}}, {"review": {"des": "The food, the ambiance and the service was impeccable. We had such a great experience from the beginning to the end! Our server was Michael Dempsey and he was absolutely fantastic. He treated us like we were the only diners he had and he gave us great recommendations for both wine and food...and was right on the money with everything. If you are looking for great food, I highly recommend it...and it's perfect for a date night or a celebration (which is what we were there for!). We can't speak highly enough of this place!", "pics": null}}, {"review": {"des": "This is officially one of my favorite steakhouses in Chicago! Service was incredible and the food..wow! The filet mignon was everything it was supposed to be. The properly whipped potatoes was one of the best mashed potoates I've had in a long time. I got it without the horseradish crust. This was my second time coming and I will definitely be back for more!", "pics": null}}, {"review": {"des": "I had the pleasure of being invited back to Prime and Provisions given my first not-so-great experience and I AM SO GLAD I DID! This place is worth the money and every single thing we had was some of the best tasting things we've ever had. Our waiter, Nathaniel, was so knowledgeable (he knew the three different countries the three types of vanilla beans in our banana cream pie were-I didn't even know there were 3 kinds?!?)<br><br>Now let's get onto the food...<br><br>Prime75 cocktail: sweet but with a punch. $14 I believe which is pretty standard for Chicago so if you are willing to pay that, then get this drink!<br><br>Complimentary bread-some of the best bread we've had (I don't think I got this last time?). Super soft and warm. <br><br>Lump crab salad-oh my goodness, this was heaven. It's basically a Caesar salad with lump crab. The croutons were tasty and they weren't skimpy on the crab at all. I would definitely recommend you start with this!<br><br>Bone in ribeye (per my husband's review)- HUGE (which should be the case since you're paying like $65 for it) and flavorful. It comes with a side of roasted garlic which is really good, but unnecessary considering how flavorful the steak is.<br><br>King crab legs: sweet and the drawn butter is caramely and oh so good. They tasted a bit on the fishery side but I'd order again. Of course, they came split and ready to go. <br><br>Banana cream pie: WOW. Even if you aren't a huge fan of BCP, you have to try this one. Its fresh, and well, not much more I can say except try it!<br><br>Overall, this was my husbands first time coming here and he absolutely loved it. Which says a lot I think because he's kind of a snob (sorry, husband!). The service was really impeccable and the food was just as good. This place is expensive, so it blows my mind how packed it was with young and old! Then again, it was restaurant week. But even last time I was here, it was packed. And everyone looked so happy. I'm glad I had the opportunity to come back and really see why this place gets the reviews it does. Next time we are in the mood for a steak or crab legs, we will be coming here.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/4RovwTFE6ZW6YNkJthdMdg/348s.jpg", "caption": "French onion soup"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/jlDgdnQpffF1vHwyEd3RLQ/168s.jpg", "caption": "Crab and lobster cake"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/cOt6CB8IPUbsvbL2IDkS0g/168s.jpg", "caption": "Porterhouse for 2"}]}}, {"review": {"des": "This is a traditional style steakhouse. Nothing disappointed but nothing excelled. We started with oysters which were the best part of our meal. Small in size but big in flavor. There was no need to use the dips. <br>The gazpacho was green, which surprised me, because it had a cucumber base. Good, but not great. The wedge salad was made in the traditional way and good. The filet was as expected and cook perfect for medium rare. My wife had the crab which also had a lot of lobster mixed in. Tasty. We had a side of sautéed spinach and it was fine. <br>For the price of dinner I would have like a little more uniqueness. It was good but nothing really stood out.", "pics": null}}, {"review": {"des": "This is a restaurant week review! Easily made an open table res for 3 on a Tuesday @ 7p two weeks prior. <br><br>Food: $44 for 3 course dinner. Great steakhouse deal because the filet is already $44!<br><br>- Clam Chowder: 5/5. Coming from the northeast, I'm obsessed with clam chowder and man was this good. The bacon sprinkles on top? Yummmmm. It was also a hefty portion! <br>- Wild Broiled Salmon: 4/5. Cooked perfectly with a side of greens and complimenting cream sauce. My only qualm was the crust on the fish. Didn't sit well in my palate. <br>- 6 oz Petit Filet: 3.5/5. Expected more. <br>- Chocolate Caramel Cake: 3.5/5. Nothing special. <br>- Banana Cream Pie: 4.5/5 I normally don't like banana flavored desserts, but this was tasty. <br>- Brussel Sprouts: 4/5. Good healthy side. <br>- Cocktails: Both my dinnermates raved about the Moscow Mules! Waitress said the secret was their ginger beer. Bees Knees 5/5; not to strong but not too sweet. <br><br>Service: Our waitress was very personable and attentive. Food came out quickly. <br><br>I would only come here for restaurant week or for post work dranks.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/0SRI4lT56NzU_Rn6PMhVSw/168s.jpg", "caption": "Broiled Wild Salmon"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/MamMIOTwGPaDNG8GTGiDrA/168s.jpg", "caption": "Clam chowdah"}]}}, {"review": {"des": "I couldn't wait to try this restaurant especially since it was on my go to list. Upon entering I was pleasantly surprised. The ambiance was very nice as was the decor.<br><br>Staff: <br>Our waiter Elliot Connor was very knowledgeable about the menu. He gave us some suggestions and we were well pleased. The restaurant was ran like a well oiled machine.<br><br>The Meal:<br>Fried chicken- it was good but the breading didn't stick. But the chili bourbon maple drizzle made up for it. It's was really good paired with the chicken.<br><br>Oysters- we ordered the east and west coast. You can tell the difference between the two because one is sweeter than the other. Nothing special just ok.<br><br>Thick cut bacon- this was delicious. It's was smoky and fatty and full of flavor. I didn't taste much of the black pepper but that may be because of the Michigan maple syrup they serve with it.... definitely a \"must\"pour over the bacon to take it up a notch. I don't like chocolate so I got the drizzle on the side.<br><br>Crab and lobster cake- I was expecting for my taste buds to be blown away. There were nice chunks of lobster but it wasn't very flavorful....wouldn't order again.<br><br>Lobster bisque- I have definitely had better. It need something more. The garlic crostini on the side had a nice flavor.<br><br>Bone in ribeye- they brought it out over cooked. Needless to say it still tasted good. It was even better cooked to medium just like I like it. I love the fatty parts and the marbleization throughout. They also bring out a tasty seasoning that you can put in to add flavor. <br><br>Chilean sea bass- the sea bass was cooked perfectly but it was lacking a sauce or glaze of some sort. It's was bland its on. Needed salt and pepper.<br><br>Sweet potato- this was good especially with the cinnamon butt added.<br><br>Spinach- your typical steakhouse spinach. <br><br>Brussel sprouts- they were ok! I like mine crisper. But we did add bacon which gave them more flavor.<br><br>The customer service is phenomenal!! They really take care of their customers.....Because they didn't cook my steak properly they gave us a lot of free things and took items off the menu as well.<br><br>Overall I can't wait to return to try new things on the menu. I would recommend this place", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/9PEQhOAikCAPblr_Bid43Q/348s.jpg", "caption": "Sweet Potato"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Q4D_sHNnZlOaQTNSLXDBtA/168s.jpg", "caption": "Brussel Sprouts"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/mhrar1NyhP2DV3ysKITj1w/168s.jpg", "caption": "Ribeye with Parm cheese"}]}}, {"review": {"des": "It's hard to standout as a brunch buffet in Chicago, but P&P does so in spectacular fashion. Unlike some restaurant buffets who try to be all things to all diners and succeed at none of it, P&P's brunch concentrates on top-notch seafood, superlative carving station offerings, and staples of any high-end brunch in Chicago, and executes better than most. Omelet and waffle stations (with freshly fried chicken carved into waffle-friendly portions) are expertly staffed. The raw bar alone is worth the price (and that's saying something.) You could eat an entire seafood tower's worth of oysters, perfectly poached and chilled shrimp and crab legs AS AN OPENING COURSE. There's also a dessert Ferris wheel that's more than just a gimmick; the tiny bites of small pastries and confections are crave-worthy, though by the time you're through with the savory sides, you may wonder if you have room for anything else. <br><br>And then a small, buttery, crispy popover catches your eye and you decide \"well, one more trip can't hurt.\"<br><br>I'm not much of an all-you-can-eater. I'd rather have a few small, tasty, well-executed courses than a smorgasbord of mediocre carbs and grease.<br><br>Eight plates and one much needed walk later, I can tell you - if you're going to go all out on a brunch buffet in Chicago - a list of contenders for best in the city has to include Prime and Provisions. <br><br>*let's be clear: $58/diner is more than a little spendy for just chow at brunch. And that's before the very tasty Bloody Marys or mimosas. But is it all worth it? Very, very much so. Yelpers: treat yourselves.<br><br>I'm gonna go take a nap now.", "pics": null}}, {"review": {"des": "The Prime Example<br><br>Reservations for 5 were made on a snowy Monday night in December. Specific instructions were left in the notes section of my OpenTable reservation, and were fulfilled. My initial thought? Prime & Provisions aim to please. <br><br>I purposefully requested the best seat in the dining room (corner back booth) so as to easily observe the flow of the wait staff and notate the type of clientele of which Prime & Provisions is comprised. <br><br>Considering the location, it was no surprise that 90% of diners were clad in suits or dresses and certainly over the age of 30. Perhaps the price point of most of almost all of the items on the menu fare outside the normal budget per the likes of the every day millennial. <br><br>Once acclimated to the space, I noticed the details of the decor. I found it very clever how the designers managed to fuse both the traditional characteristics of the American Steakhouse aesthetic (leather booths in rich, dark earth tones and wood paneling along the walls) with new exciting decorative choices (modern light fixtures, oversized windows with views, exotic floral arrangements, etc).<br><br>Although the decor was a juxtaposition of old and new, the appearance and styling of the waist staff was certainly catered to standard expectations: Crisp, white shirts and vests, and some men donning blazers. The spot on customer service was a refreshing experience  (truly, I would take 4 sips of water and a refill would be presented within seconds).<br><br>The attention to detail was evident from the reservation to the decor, by the waitstaff, and - most importantly - through the cuisine.<br><br>I had prepared my other four dining companions to prepare for a feast. And \"feast\" we did. We ordered 11 different menu items, all of which were paced perfectly. <br><br>#1 Bread Service: Lazy, dry, and totally unnecessary. The bread was the sole, greatest disappointment throughout the night. I do not think this selection of bread was the right fit. A Parker House roll would be a much better option. <br><br>#2 Oysters: Extremely tasty, fresh, and briny.<br><br>#3 Asparagus: Simple, yet tasty. Also fresh and sauteed at the correct texture (slight crunch, not at all soggy).<br><br>#4 Bruleed Sweet Potato: Absolutely incredible. The candied brulee topping mixed with the cinnamon butter stop the soft flesh of the potato? Killer.<br><br>#5 Brussels Sprouts: Insanity. Acidic, savory, sweet, bitter, smoky, fresh, with large chunks of thick cut bacon included. <br><br>#6 French Fries: Very good and a huge portion. <br><br>#7 Mashed Potatoes: Out of this world. Creamy, smooth, buttery, and cheesy.<br><br>#8 30 Day Dry Aged Bone In Ribeye: HUGE portion prepared exactly correct. Incredible flavor, didn't need a spec of additional seasoning or a drop of any sauce. One of the best steaks in Chicago (better than Gibson's).<br><br>#9 Banana Cream Pie: Impeccable. A sweet toothed foodie's dream. Light, creamy, slightly tangy, with a buttery, flaky crust. The chunks of banana was just flawless.<br><br>#10 Caramel Creme Brulee: Pretty good. Will be a favorite for those who prefer a light dessert option to support a heavy dinner. <br><br>#11 Pecan Pie: One of the best desserts I've ever had in my life. My favorite pie prepared in an utterly orgasmic fashion. Gooey, sweet, buttery, maplely, and crunchy. A+mazing.<br><br>My dining experience would have been a true, 5stars if it weren't for that unfortunate selection of bread. In all seriousness, that should be swapped with a softer yeast roll.<br><br>Prime & Provisions is not to be missed. In a city inundated with restaurants and steakhouses, this is the Prime example.<br><br>View more at <a href=\"/redir?url=http%3A%2F%2Finstagram.com%2Fjacksonsdecree&s=e03f9ca8f05a84d9881b020c0f517850e248beda4789166cc93adf8db0259af5\" target=\"_blank\" rel=\"nofollow\">instagram.com/jacksonsde…</a> or <a href=\"/redir?url=http%3A%2F%2Fwww.darianjackson.com%2Fjacksonsreactions&s=bbda9e76075094c6cad283d46798933622bb15e29a08371a5c0455c29f7924e1\" target=\"_blank\" rel=\"nofollow\">darianjackson.com/jackso…</a>", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/kAAWKjRs669gUs7SCcl-6Q/348s.jpg", "caption": "Brussels sprouts"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/35xhlOcI4-GrglsLF_whRw/168s.jpg", "caption": "fries"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/rdC_y6HmUeaE86Klk5Wp_Q/168s.jpg", "caption": "Mashed Potatoes"}]}}, {"review": {"des": "I was just here for the Sunday Brunch with bottomless mimosas and it was amazing! Our waiter Steven (but like a little more ethnic) was beyond great. He knew what we needed before we did and was just spectacular! Thank you, we will definitely be back!", "pics": null}}, {"review": {"des": "Wonderful Chicago steakhouse. Old school vibe, classic dishes, and knowledgeable perfect service. <br><br>We were a large group of about 18 and we all ordered à la carte. The steaks came with roasted garlic which was a nice touch. Typical sides, just enough to taste. The roasted sweet potato was a standout. <br><br>So close to a five star, but the steak didn't blow me away, it was good. The cap of the ribeye/deckle was tiny and dry. Maybe it rested too long as the runners were preparing to serve the entire table?  They also sat us in a provisional area outside the restaurant on the second floor foyer area. It was private and unique, but it didn't feel like we were actually in the restaurant with white sheets clipped to the walls. <br><br>Again, really appreciated the enthusiasm of our servers and their knowledge of the menu. And even though you are full, you will have to order deserts to share. The table side s'mores are legit!", "pics": null}}, {"review": {"des": "I wanted to start out by saying we came here for my husbands bday and I was looking forward for a month <br>There was a small hiccup as I wrote my review the next day nothing bad food was great as service was and I had just mentioned it , within a day I got a message from the manager APOLOGIZING TO ME! I really couldn't believe it Bc thats never happened to me on here so I jist wanted to Thankyou  P&P for the amazing customer service<br>The seafood tower was amazing the steaks were melt in your mouth wonderful as well as chicken and the deserts were decedent <br>It was everything I waited for .<br>Really wonderful place<br>Can't wait to go back", "pics": null}}, {"review": {"des": "Jessica and team showed great care for us from the time we sat down. This was our first visit to Prime and Provisions and we especially loved Jessica's recommendations. The bone in Filet, sweet corn and cilantro side, horseradish crusted whipped potatoes were delicious. The thick cut bacon with chocolate first course really set the tasty stage for our anniversary dinner. And the complimentary chocolate caramel cake completed a perfect celebratory evening!", "pics": null}}, {"review": {"des": "Unbelievable food.  Best steakhouse in Chicago.<br><br>Ask for Michael Dempsey.  A+ service!", "pics": null}}, {"review": {"des": "Prime and Provisions - you aim to please!  We had a wonderful experience tonight.<br><br>We were seated in a great booth in the main dining room.  The booth was in the middle of the room and the room was full.  Even though the restaurant was hoppin', it was surprisingly easy to speak and hear across the table.  No noise issues (like other steakhouses) - great acoustics.<br><br>We started with the french onion soup.  WOW.  Get this and get it now.  I promise you will thank me.<br><br>For our main course we had the filet, new york strip, whipped potatoes, macaroni and cheese and onion rings.  EVERYTHING was cooked absolutely perfect.  My filet literally melted in my mouth.  The potatoes, mac and cheese and onion rings all held there own next to the steak.  All very, very tasty.<br><br>For dessert we shared the s'mores dessert and the caramel creme brûlée.  I don't know how they manage to pull of the s'mores dessert, but it's pretty freaking cool and tastes just as epic.  The caramel creme brûlée was fabulous.<br><br>For drinks we had the pinot noir (great!), malbec (excellent!) and the bees knees (SO good - would order it again).<br><br>Lastly, the service was the best of the best.  If I had to rate the service 1 - 10, I would rate it a 20.  Our server was Mike Dempsey.  Mike took care of us like we were the only table in the room.  Mike is the kind of server that makes you want to return to a restaurant.  A classy guy at a classy restaurant.  <br><br>I started working at a law firm in the 222 N. LaSalle building a couple of months ago.  Dinner tonight was a treat to my parents.  Prime and Provisions could not have made the night more perfect!  THANK YOU!!", "pics": null}}, {"review": {"des": "The best Old Fashioned I have had in a Chicago thus far. Smooth and tasty.<br><br>The bacon appetizer is delicious and may be the best thick cut bacon I had at this point. This coming from someone who had Peter Lugers and Au Cheval. Whipped potatoes are buttery awesomeness. <br><br>The steak was solid although personally, I like to cook my own. After coming here, I think I have confirmed what I always thought...I'm not into high end steaks. I know the meat quality and preparation is better. I just can't taste it. I guess I'm more of a marinaded steak guy.<br><br>Prime and Provisions has great food and will find a way to give you a new favorite on its menu. I will be back to try the fried chicken and burger.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Qv0ZN-NPZ6b8MqM8U5OS8g/348s.jpg", "caption": "Mmmm House - Flared Thick - Cut Bacon"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/5_YfClHwhxqPABfs8MmG_w/168s.jpg", "caption": "Here's an actual picture of the Old Fashioned"}]}}, {"review": {"des": "Was very excited to try out Prime & Provisions. Been to many of the steakhouses in Chicago and had varying experiences. Ordered two NY Strips and one came out quite overdone (ordered it medium rare) and one gone from char to burnt. I shouldn't be overwhelmed by carbon flavor. They graciously took it back and redid the steaks, to their credit. Also, the fried chicken was far over-battered with a Cap-n-Crunch-style hardness to the batter.", "pics": null}}, {"review": {"des": "We had the most amazing experience last night. Our server Michael was an absolute delight. The dinner itself was fantastic but the service was out of this world.  The Kansas City cut could have been the best steak I've ever had. The wine steward (whose name is escaping me, sorry) found a bottle of wine that complimented our meal perfectly.  <br><br>Also, the old fashion is a must!", "pics": null}}, {"review": {"des": "Steaks are Halal! Deliciously prepared steaks and sides! Salads are awesome....<br><br>Service top notch. Ambiance perfect. Great location. Couldn't ask for more! Great place to treat yourself or a loved one for dinner.", "pics": null}}, {"review": {"des": "I came here for a business dinner on a Monday night and we had a great time with out table of nine.  The waitress knew her stuff not only on the food but the wine recommendations, and had a lot of friendly back and forth with each of us.  The food was amazing - the filet practically melts in your mouth and has an excellent flavor, and our selection of sides really complimented the steak.  For an appetizer, you have to try the thick cut slice of bacon!  All in all, this is one of the best steaks I have had and I'd like to come back here the next time I am in Chicago.", "pics": null}}, {"review": {"des": "Great food, I have had several business lunches here.  Will not do any more.  The music is too loud to have a conversation, we asked to have the music turned down twice and I actually think they turned it up.  Combine the music with the bad acoustics - lots of conversations, our lunch meeting was ineffective.  As I said, great food, great service, just not a good place to meet if you need to discuss anything substantive. <br>Also, we were rushed to order, food came out super fast, our reservation was at 11:45, you could tell they wanted to get two turns on our table.", "pics": null}}, {"review": {"des": "Competent waitstaff, comfortable table, quiet enough to have a conversation, all good. The food was only good. The steaks were not prime and the sides were generally bland, (although the sweet potato was excellent). The prices were exorbitant for what you get. A meager 5 oz piece of haddock, nicely prepared, was $42, a $20 bottle of Bordeaux was $85. <br>If you go to this steakhouse be prepared to pay at least $100 for a $40 meal.", "pics": null}}, {"review": {"des": "We went for Valentine's Day this year. I had been quite ill a few weeks prior after traveling, but we were still trying to figure things out and if gluten could be a possible issue soon after the illness had started to subside. The staff was very kind and helpful when asking for this new special request of gluten free that we were not accustomed to living with. <br><br>My husband ordered a wedge salad and steak as usual and loved it, I ordered the purple cauliflower, fennel, arugula salad & the fish special which were also delicious. We also added the brussels sprouts and mushrooms that they kindly modified to be gluten free for us. Our waitress was awesome. Turned out we used to live in the same building as us, so it made for some good conversation as well.<br><br>Our bottle of wine was excellent, and I asked if we could take it to go which they kindly packaged for us. Sadly, my husband got a bit too tipsy and broke the bottle while waiting for me to use the restroom. Staff kindly helped him quickly clean it up. Sadly, I missed the rest of my bottle, but thankfully nobody got hurt!<br><br>Great food, great service! We'll definitely be back sometime!", "pics": null}}, {"review": {"des": "Let me start off that the managers were so welcoming Patrick was one of them, then our waiter Nathaniel was awesome, attentive and friendly he helped us choose between what kind of appetizer we should get, he suggested the tuna tartare, AMAZING, the chocolate bacon & tuna tartare combo were perfect. For our main course we got the king crab legs and aged T bone steak, the salt they serve you to add on the steak was so damn perfect. If you don't like loud places than this is not the place for you because it does get very busy. I don't know why people complain that it's so loud? People speak loudly, that's what you do, converse during lunch/dinner.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/tYTdyjzSa98lhxCzTGxvUQ/168s.jpg", "caption": "Forgot the name but it was a \"s'mores\" dessert."}]}}, {"review": {"des": "I visited P&P on September 27th 2018 with a group of 12 work friends/colleagues. Quite possibly the best steak I've ever had.  We tried several sides, several apps, several drinks, several different entrees chosen....grand slam on all of the above. <br>Ask to be seated in Michael Dempsey's section. The guy knows what's up, he knows the restaurant, he's fun, & batted a thousand with his recommendations.", "pics": null}}, {"review": {"des": "If you haven't been to Sunday brunch at Prime & Provisions, stop reading this review and GO RIGHT NOW. Seriously the best brunch that Chicago has to offer (and I've been to a lot of brunches). <br><br>I went with a friend and we could not get over the selection of food. A few of the highlights were the make you own omelette bar (they have goat cheese as an option!!), a Belgian waffle station with insane toppings (i.e. the best friend chicken graham crackers, sprinkles, marshmallows, fruit), amazing raw bar, bagel and lox table & to-die-for thick cut bacon. And be sure to save room for dessert!! The cinnamon rolls and carrot cake were unreal.<br><br>Such a special and amazing brunch! I can't wait to go back!!!", "pics": null}}, {"review": {"des": "A quality Chicago steakhouse! <br><br>Food: I ordered a petite filet. It was just the right size for me (6 oz), was cooked perfectly to order, and came alongside a head of roasted garlic and a small bowl of steak seasoning. The head of roasted garlic really was an elegant touch. It was perfectly soft and added great flavor to the steak. The only problem was the steak was room temp...<br><br>For sides, I got the brûléed sweet potato, which had a nice crunchy top and smooth center. The Brussels sprouts were definitely a highlight--crispy with a sweet flavor and awesome chunks of well done bacon!!<br><br>To finish off, we got the s'mores dessert. This was quite impressive--a hollow sphere of chocolate was melted with hot ganache poured over it to reveal a baked Alaska-type marshmallow covering lava cake with a graham cracker crust. I loved how you could taste a smokey flavor as if you were by a real campfire!<br><br>Ambience: one step down from \"ritzy steakhouse.\" Both booth and table seating is available as well as a more casual bar with TVs.<br><br>Service: The waiter was friendly, food was delivered in a timely fashion, our water glasses were promptly refilled, and they used that cute little scraper to remove crumbs from the table!", "pics": null}}, {"review": {"des": "My friends and I were extremely disappointed by the lack of organization displayed by the hosting staff. It seemed that they were collectively unable to manage Saturday night foot traffic. Despite our reservation, we were seated 45 minutes later when there appeared to be several seating options available in the bar area and main dining room. The young ladies clearly did not appear to know what they were doing and seemed to be confused about table numbers. Their ineffectiveness soured what was actually a pleasant overall dining experience. Please fix this issue Prime & Provisions, because other customers also appeared to be upset by the delays and their incompetence as well.", "pics": null}}, {"review": {"des": "I came here the other night after work with some colleagues and had a great time.  We all had Old Fashioneds and they were pretty good.  I hope to come back for the food in the near future.", "pics": null}}, {"review": {"des": "Wow! The food here is awesome! I attended a special event here and everything was top notch. The appetizers (bites of fried chicken as well as big chunks of BACON!) were amazing and the staff was always available.<br><br>They had a cold bar with HUGE shrimp and crablegs as well as oysters. They had warm carved beef tenderloin and salmon as well as grilled veggies.<br><br>I talked to the manager who was mingling and he made me feel welcome - like I was invited to his house for a dinner party.<br><br>I can't wait to have dinner here. Check it out!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/YSXQQW4dQ7jN5gqxOmWf8g/348s.jpg", "caption": "Yum!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/TuYZKj2LHWiY_Nut_aowvw/168s.jpg", "caption": "Even more cake!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/-oSds6mXNYy6X1rAYLeFYQ/168s.jpg", "caption": "More cake!"}]}}, {"review": {"des": "Stopped in for wine and $1 oysters at the bar around 10pm. The bartenders were great and gave some great selections. Good wine list but very pricey. We also ordered the crab cake and it was amazing - lots of fresh crab in it. The sliders were ok and the bread pudding was pretty good.", "pics": null}}, {"review": {"des": "Poor  service. We got the fried chicken, bacon, and lobster avocado salads. Costed us over $600 . Food is and drink is overpriced. Drink was too diluted. We had to ask for water three times. They got the tip  and did not care. Will not come back.", "pics": null}}, {"review": {"des": "Good waiters react to your needs and requests in a timely fashion. Great waiters are a step ahead and know how to anticipate what you might need in advance. Michael Dempsey is a great waiter, and the difference between a pro and an amateur waiter is unmistakable. Great service really enhances the dining experience. <br><br>Obviously, the kitchen knows what they're doing. The thick cut bacon appetizer and the lamb chops entree are both out-of-this-world good. The quality of the food here was never in doubt. It's the pro-active, yet relaxed service that took this experience from a pleasant evening to a fantastic one. I don't give reviews often, but in this case, I don't think I could forgive myself if I left without leaving a good review. I only gave five stars because six wasn't an option.", "pics": null}}, {"review": {"des": "My boyfriend and I went here last Tuesday for my birthday dinner. We had a reservation for 6:30pm, and we were promptly seated upon arrival. Our server was Mike (Mike Dempsey in case there's two Mikes!), and he was terrific. He provided amazing service from start to finish with an obvious knowledge of steaks and passion for them. <br><br>We skipped drinks this time around to make more room for food, and I'm glad we did! We started off with the complementary bread service and the Caesar salad. For $19, I thought \"boy this better be good,\" and IT WAS. I know it's hard to mess up a Caesar salad, but the mixture of romaine, kale, and lump crab made for an absolutely terrific salad. Don't be afraid to splurge!<br><br>Next up, I ordered the New York strip cooked medium rare. My boyfriend got the burger and for sides we got the Brussels sprouts, mac and cheese, and the fries that came with the burger. My steak was outstanding. My boyfriend was raving that this was one of (if not the best) steak he's ever had. The mac and cheese was also awesome. I didn't love the Brussels sprouts, but compared to everything else that was awesome, I can't complain. <br><br>Despite celebrating a birthday, we were so stuffed by the end of the meal that we decided to forego dessert. We never mentioned to Mike that we were there for a birthday, but he heard us eyeing the Banana Cream Pie and gave it to us on the house! Talk about service. <br><br>The bussers and food runners were also really great - really polite and funny! Steven, one of the managers, stopped by at the end to ask how everything was. All in all, a great evening! Highly recommend!", "pics": null}}, {"review": {"des": "The sweet pork belly appetizer was simply unreal.  I couldn't believe what I was eating.  I sacrificed a steak in the name of having a burger because I wanted to experience a burger from a steakhouse. Zero regrets. The dry-aged burger had the most delicious nutty flavor to it.  When i sliced the burger in half, the plate just filled with juices, that ran into the lightest crispiest fries I've had in a long time.  The Wisconsin American cheese made<br>Everything even better.<br>To finish, the bread pudding is so good you might have to stop for a moment and compose yourself.  Seriously.  <br>Ps, they serve cigars to enjoy after dinner.  Baller", "pics": null}}, {"review": {"des": "I visited here over the weekend and I love it! All I have to say is the bacon, the bacon, the bacon!!!  BEST I'VE HAD EVERRRR!!! I ordered the burger and fries and it was amazing!!! The scenery is very nice and upscale and the perfect spot for plenty of photo ops! Customer service was spectacular and the service was also quick. I would definitely recommend this place to anyone for a birthday or special event! I will certainly be back!", "pics": null}}, {"review": {"des": "We had the Sunday brunch and highly recommend it.  The food was amazing.  Prime rib, fresh seafood, Mac and cheese to die for as well as traditional breakfast fare and dessert bar.  Definitely will go back.", "pics": null}}, {"review": {"des": "It makes me sad to give this place less than 5 stars because the first time I came I had a truly stellar experience. This most recent time, just ok.<br><br>I brought my family from out of town for a nice dinner. We had a great booth and a really nice server, but service seemed to take foooooreeeeverrrrrr. And it wasn't full! It was half empty on a Thursday night. <br><br>For starters, we don't drink, so when our super nice server started explaining the wine list, we said - oh, no alcohol for us, thanks, and that was that. Maybe I should have spoken up and specified just because I don't want a glass of wine, I may want something other than water, but it didn't really come up and then it felt weird to bring it up. We had to ask for our water to be refilled at least 3 times which I do not expect to have to do at any restaurant, especially a nice one. But yup - 3 separate times I had to flag someone and ask for more. Not great.<br><br>The food was very good, as usual, although they mixed up my steak and my husband's steak - I didn't notice until we were already eating but he'd odered medium well and I went with \"medium plus\" which apparently isn't a thing, so sorry and I won't do it again (haha). But halfway through our steaks I realized his was much less \"done\" than mine, and thus they had swapped ours, but oh well. We ate them anyway.<br><br>We had several appetizers and several sides- the corn is the real standout. Our server also recommended onion rings which were quite good. The gratin purple cauliflower wasn't great. It was pretty underdone, and I don't know anyone who likes crunchy cauliflower. My dad got a baked potato which when brought to the table looked ok, but when he opened it up, it clearly had a bad spot - he cut that part off and ate the rest. When our server came back (a while later), my mom said - I think this part of the potato was bad - our server said something like \"let me talk to the chef about it.\" Um, what is there to talk about? We were done eating, it's not like we wanted another one (which probably would have taken another 40 minutes to come out). I think I said \"no that's ok, but I mean, you can see right here it has a bad spot.\" So he said he'd take it off the bill, and I thanked him. I feel like he should have led with that IMMEDIATELY, not tried to come up with some answer. <br><br>When we were seated and asked if we were celebrating anything, my mom said \"a reunion of sorts\" and I laughed and said \"and my birthday too, it was just last week!\" I kind of thought when I said that they'd throw a candle on my dessert or something, but nope. <br><br>All in all I think the food was good, but honestly I just didn't feel like it was a 5 star experience which was disappointing because I had brought my mom, dad, and sister from out of town. I might go back, but I'm not in as much of a hurry as I would have been had we had a better time.", "pics": null}}, {"review": {"des": "The food was fine, but service not so much, which makes the overall experience not really worth the cost. <br><br>We had a reservation at 8pm on a Saturday night, and they were slammed, which is kinda to be expected. We had to wait to be seated, and although the water person and the waitress stopped by fairly quickly, we didn't get even to the drink order for a good 45 minutes. Once we got started there were a roll of inattentive details: they offered bread and then didn't bring it, we ordered a bottle of wine and it took more than half an hour to bring it out, someone wanted an additional appetizer (a tossed avocado lobster salad) but when it was brought out it was not tossed.<br><br>It was fine. But not really the \"we'll take care of you this is an expensive steak house\" experience that's advertised, so I'll ding it", "pics": null}}, {"review": {"des": "It was my first time here and Stephen made it memorable! The food was delicious and the service was absolutely amazing. I am a big critic on customer service, but he definitely meet it. If you visit on a Sunday, ask for Stephen's section.", "pics": null}}, {"review": {"des": "I don't typically go to steakhouses but everyone raves about this spot and I wanted to check it out for restaurant week with my friend. My favorites were the clam chowder and the bacon apps!<br><br>--The AMBIENCE<br><br>Love the decoration and the overall mood. The TVs above the bar were a pretty big eye sore as they were right near our tables and very distracting. Get rid of the TV's please. Also I did not make a reservation and as they mentioned they had walk in tables - we went with that option and were surprised that there was a bit of space and they even gave us a booth which was awesome! It's also not super loud so you can easily talk with friends without having to shout over each other.<br><br>--The FOOD<br>New England Clam Chowder <br>This was fantastic! I loved the mouth feel on this with the creamy soup coupled with the bacon pieces on top. Great presentation and paired well with the bread that came on the side. Overall delicious and we ate that up!<br><br>House-Flared Thick-Cut Bacon<br>Loved the cook on this and the sweetness. I think the presentation could have been better - seemed a little weird the way it was plated on it's own and I think a pinch of salt could have helped balance that flavor of the sweetness. Overall really well prepped!<br><br>6oz Petit Filet<br>I didn't think there was anything special with this cut but overall was ok. Granted I prefer T-Bone cut more than anything. This was very delicate and the side of salt really helps.<br><br>Dry-Aged New York Strip<br>The cook that I requested was spot on just the meat was a little rough or maybe our steak knives just not very well sharpened. The salt on the side helped a lot to season to our choice.<br><br>Side - Mashed potatoes<br>I am sure these were unhealthy because we loved them lol. Coupled with the steak - it was a great pairing! These were one of the highlights!<br><br>Banana Cream Pie<br>Honestly not worth the calories or coming back to. The caramel on the plate as decoration was in no way needed. This dish was already overly sweet. Not a huge banana dessert guy. It looked pretty (wish it had been smaller) but that's it.<br><br>Chocolate Caramel Cake<br>The mouse on the side that had coffee grounds was the most impressive thing on this plate. I would have used those coffee grounds on the rest of that chocolate, added some fruit to make it pop a little and maybe hit it with a spray of brandy or something. Wish there was more finesse that went into these desserts.<br><br>--ChaChing<br>First off this is in Loop area so it is on the higher price scale. I think based on what we got - the price was not outrageous. Overall I think it was a good value - especially for restaurant week. <br><br>--The SERVICE<br>This is where they shined! Upon arrival - we did not wait - we were seated almost immediately and without a reservation were given a booth which was fantastic of them to do. At no point did we feel like they were pushing us out of the restaurant or forcing us to order drinks to accommodate for the restaurant week pricing they were being held to. At the same the manager came out and did a little favor for us and our waitress was very attentive. The table was cleaned in between services and things were paced appropriately - again not rushing us out as others did to us. <br><br>I feel that sometimes with restaurant week some restaurants may cover their costs by insisting or pushing alcohol and increasing their table turn over rate but again - this was not the case here and I appreciated it!<br><br>I was on the fence and was hoping I could do a 3.5 rating but their service and ambience won the push for 4 stars :)", "pics": null}}, {"review": {"des": "My new favorite Chicago steak house. The food is first rate, the cocktails incredible (best Old Fashioned I've found to date), and the service...let's pause here to talk about the service.<br>Friendly and professional, and worked to get us in with no reservation on a reasonably busy evening.  And this needs to be said: if you have the good fortune to have Andrea as your server, you are in for a fantastic meal. She knows the menu inside-out, makes great food and cocktail recommendations, and parenthetically is the most DELIGHTFUL individual in the entire Midwest.<br>I'm looking forward to getting back to Chicago to explore more of their menu. And if you have the chance, you should too.", "pics": null}}, {"review": {"des": "The food is PHENOMENAL but let me just rave about our server Brandee for a moment. She went above and beyond for us giving the most amazing experience we have had! If you reserved a table call and request her. She is just the bees knees! Just all around fun, friendly, and loves her job. Gave the best recommendations and always smiling!", "pics": null}}, {"review": {"des": "Had their burger - great except to get that 5 stars they should consider carmeling the onions - it was missing something and that would help. Bread pudding dessert was 5 stars. Overall, for this price range I expected them not to be so stingy with the free bread.<br><br>Extra points for not making a fuss over my tennis shoes despite their dress code.", "pics": null}}, {"review": {"des": "One of the better porterhouses I've had in a little while. Cooked perfectly and juicy throughout! That said, the highlight was certainly the thick cut bacon. Absolutely amazing. Started with the great seafood platter and everyone really seemed to enjoy it. Others I was with had a range of different cuts--from the filet to the strip and everyone was raving about how nice everything turned out. Will definitely be back again!", "pics": null}}, {"review": {"des": "Best prime rib sandwich in town!   But today we were there celebrating my parents 50th Anniversary with a nice brunch.   Learned that brunch is a newer thing here at Prime & Provisions....and they are off to a great start.  Food was fantastic!  Sure it's a little pricey but between the variety of food, atmosphere and the service, you get your money's worth.   Our server, Stephan, was amazing!! Always attentive, polite, and very friendly.  Even made the kids feel special.  He was happy to accommodate a few small special requests we had.  <br>Overall, it was the wonderful brunch my family was hoping for to celebrate a special day.   Highly recommended!!!", "pics": null}}, {"review": {"des": "This place has an absolutely great decor. Ideal for nice team dinners, date nights, or a treatyoself. We had them coordinate a baby shower for us so they gave us the \"Atrium space\" which was simple but elegant. I have to give a shoutout to the staff because they were the absolute sweetest and very attentive to your needs. <br><br>In terms of food i'll review the things we had: <br>APPETIZERS: I absolutely loved their apps. TBH I could've just had an entire meal based on those and been so happy. <br>Fried Chicken for the Table: anyone who was on a diet couldn't resist it because first off it looked beautiful and tasted even better<br>Oysters: Surprisingly not my favorite oysters in the world but not my least favorite either. <br>Thick-Cut Bacon: This was personally my favorite app. There was so much flavor to it! <br>Lump Blue Crab & Lobster Cake: It was the perfect texture, very fresh tasting, and a great choice. <br><br>MAINS: <br>Dry-Aged Bone-In Kansas City Strip: If you order this you better be super hungry because it is gigantic (or share). However I didn't eat it but I heard claims like 'damn this is some of the best steak I have ever had'. And thats coming from people who have steak all the time from nice places<br>Alaskan King Crab Legs: Dont underestimate how much 1/2 a lb of crab is equivalent to, especially if you have had a good number of apps. Make sure they give you both sauces, particularly the butter. But this was a solid choice and you dont feel super heavy afterwards. <br><br>SIDES: so I wasn't as excited about the sides unfortunately<br>Macaroni: meh, but I also have an obsession with mac so have gone on extensive searches to find the best one<br>Purple Cauliflower: probably the most unhealthy version of a vegetable I have ever had so set your expectations for a very creamy dish!", "pics": null}}, {"review": {"des": "My wife took me here on 10/25 to celebrate my 30th. I could not be more pleased with my experience. The ambiance of the resturant was superb. Our server, Michael D, did a great job of walking us through the food and wine menus without being overhwelming. The food was exceptional. The lump crab ceasar salad was outstanding. My steak was cooked perfectly as ordered to a medium rare. We will definitely be back!", "pics": null}}, {"review": {"des": "Came here with friends for brunch .. it was amazing !! Just perfect menu for brunch buffet not over flowing with food .. but perfect choices !!! Everything was delicious ! The waffle is to die for !! Melts  in your mouth ! Ahhh super fun place excellent service !! Worth it ! Totally !!", "pics": null}}, {"review": {"des": "Great service! Food was decent! Nothing spectacular as we expect from the reviews! I can make way better lamb and bread pudding at home! <br>They tried! Way too expensive for what it is!! Many others steakhouse around with a lot more to offer! NOT WORTH IT!!", "pics": null}}, {"review": {"des": "I wish I could give 4.5 stars. I've eaten here twice and the first time was definitely a 5 star meal and experience. The second trip was more of a 4 star but only because the first waiter was so amazing. <br><br>We had the same food both trips and it was delicious. The seafood tower seemed smaller the second time but that could be due to market prices. <br><br>Service was a bit off from the first trip. Not sure if our waitress was as experienced as the one we had before, because she wasn't as engaging or attentive.  I do not recommend setting in the bar area if you are wanting an intimate dining experience", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/HTDs1wcr8j2zf8JlfKYkpA/348s.jpg", "caption": "Prawn almost the size of the plate"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/o_IKM9TDKSrWCmNy6xkkew/168s.jpg", "caption": "Seafood tower"}]}}, {"review": {"des": "I'm from California and wanted to try this place out as it was listed on Trip Advisor & Yelp. This place is the best! Beautifully decorated fancy 2 story complex. My bf at the time made a 2 week advance reservation and requested the best seat in the house, so we sat in the back corner booth with views of the entire restaurant. For a Friday it was pretty dead but my guess is people had dinner at 7, while we came at 9:45-10 because of our flights the day of. We ordered the aged porter house steak, Mac n cheese, creamed spinach, mash potatoes, & a variety of drinks. Only thing I regret is not ordering seafood since I'm reading such rave reviews about it. Honestly Chicago is foodie heaven and I can't wait to come back!", "pics": null}}, {"review": {"des": "What a great place!  I love the vibe this place gives, young modern but not trying to hard.  It has impeccable staff and delicious food with a great atmosphere.  I had the King crab legs and they are out if this world delicious, so fresh and cooked to perfection!  10/10 would come here again and bring my friends and family.   It was a<br>great steakhouse without being stuffy, also had a great view of \"Art on the Mart\".  Go, even if it is just for a drink at the bar, you will not be disappointed!!! <br><br>PS. i am local to Chicago and eat out quit a bit!", "pics": null}}, {"review": {"des": "Brought some clients here last night for dinner. Customer service was great however, the food was just ok.  We got the bacon and tuna tartare for apps. I would order the bacon again but not the tuna tartare. I've had better .<br><br>I got the bone in ribeye for my entree and for $72 dollars, it was not good. Not a juicy steak at all. <br><br>Also the side dishes are very small portions. We ordered 6 sides for the table thinking that it was too much but it really wasn't . <br><br>I don't think I would come back here. Way overpriced for what you actually get. I would go to Chicago cut or rpm steak before this place .", "pics": null}}, {"review": {"des": "By far the best lunch I have ever had.  The table shared the Thick Cut Bacon and Chocolate appetizer, which was amazing. I ordered the Prime Rib Dip Sandwich.  I ate half and was full. It was soft as butter, rich, and perfectly prepared.  I will be back the next time I am in Chicago. So yummy.", "pics": null}}, {"review": {"des": "Best damn brunch I've had in awhile. Worth the $60 per person price for an AMAZING SATURDAY OR SUNDAY brunch. The seafood was incredibly fresh! The options were endless and all scrumptious. A must try with your brunch is the Bloody Mary build- your-own option. Easily a top spot for me to stop in for brunch every time in Chicago.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/VOMkssgmDiaRPgAWsB0mzw/168s.jpg", "caption": "Fried chicken & Prime rib"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/PqBuCP-zEw7FHcgopsPvzQ/168s.jpg", "caption": "Bloody Mary build your own station"}]}}, {"review": {"des": "Had brunch before the Bears game. Absolutely amazing food and ambiance. Service was great. <br><br>Seafood bar, omelette station, carving station, chicken and waffles plus an amazing dessert station. Huge fan!!", "pics": null}}, {"review": {"des": "I went here for lunch with work colleagues on Monday.  This is a fast lunch for a nice restaurant.  It is expensive for the portion size.  For three people (no alcohol) we paid approximately $130 including tip.  I recommend getting a side or appetizer.  <br><br>I had the New England clam chowder followed by the Norwegian cod special.  Both were good.  The clam chowder had pieces of bacon on top that added a nice crunch.  The cod was properly cooked and flaky like cod should be.<br><br>My colleagues report that the salmon and lobster sandwich were good.  The person who ordered the salmon found the accompanying greens unacceptable.<br><br>Service was excellent.  The dining room is noisy and it was a little hard to hear my colleagues at times.  I will continue going here for work related lunches.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/iSUNpWdQ09TPFvFP8YB0Rg/348s.jpg", "caption": "Onion rings"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/yxdHfNDB-fLXhMEhb6oedw/168s.jpg", "caption": "Whipped potatoes"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/5aVS2ZUa6HhahCOFWqS3bQ/168s.jpg", "caption": "Chicken club"}]}}, {"review": {"des": "All around excellent experience. The food was penomenal. Fresh oysters, excellent beet salad, one of the best steak I've ever had - served with baked garlic (I'm going to need to serve this at home). <br><br>The wait staff was outstanding. Ask for Michael Dempsey - 10/10 customer experience. <br><br>Drinks were on point.<br><br>Highly recommend!", "pics": null}}, {"review": {"des": "I had a group of 3 on a Friday night. It was after an event at the planetarium. We got here at 8:30 and was able to get a high top table. <br>We ordered a South American wine after reviewing the many wine bottle selections. It was nice and dry. The service was great. He had great suggestions for all courses. The architecture is amazing and tied the whole ambiance together. <br>The bacon appetizer is a must. I ordered the steak which was great but the others 2 people had the lamb which was amazing. <br>Would definitely come back again.", "pics": null}}, {"review": {"des": "Prime & Provisions has been a great client / business lunch spot since it opened in 2015. Located close to the border of the Loop and River North, the interior is spacious, classic, and a nice getaway from the standard day. <br><br>I cannot comment on dinner options but for the lunch hour, my \"go-to\" has been the Prime Rib Dip (a really good, creamy horseradish, crispy onion straws, and the prime rib is juicy and delicious) with seasoned fries. My drink of choice at lunch is an iced tea or Arnold Palmer during the summer. <br><br>Reservations are recommended as I have noticed parties wait around lunch time without a prior reservation, and if possible, nab a back of the room booth for seating. <br><br>Great overall lunch option and looking forward to my next excuse to have a Prime Rib Dip.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/_zoKU86__AR9nt7E46QsHg/348s.jpg", "caption": "Prime Rib Dip"}]}}, {"review": {"des": "Terrific atmosphere, this is a very classy place. After a wonder steak I can enjoy a cigar in Prime Provisions patio area. My waitress Jessica was phenomenal, she made my Birthday experience spectacular.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/A7AciQYyFBpYnCHPQ5xDsA/168s.jpg", "caption": "How can you go wrong with grilled asparagus and mash potatoes, accompanied by a juicy rib eye steak???? You can't!!!!"}]}}, {"review": {"des": "Can i just say the service here was absolutely amazing! Our sever Nathaniel was so personable and made sure we were happy with our experience. Yes this place is pricey, but definitely worth it. Our meals were cooked to perfection and we had absolutely amazing dishes. It was a birthday/anniversary dinner so they came back with an amazing lava cake and creme brulee on the house! I would recommend coming here and having their steak because its cooked to perfection. We will definitely be back here again!", "pics": null}}, {"review": {"des": "We came here Saturday after seeing Hamilton. The food was fantastic - the bacon is an absolute must! And the S'more, OMG, the S'more! <br><br>We had the best service ever!  Our waiter was David. He was very attentive, helpful and sweet. Forever grateful for the recommendation of the S'mores. <br><br>5 stars was an easy choice. If you're looking for a special night, with awesome food and fantastic service choose Prime and Provisions. You won't be sorry. <br><br>PS - ...S'mores!  And David!", "pics": null}}, {"review": {"des": "Our first time here was a strong, memorable meal. We started with the Maple Bacon Chocolate appetizer, which was really more of a pork belly dish. Delicious, but quite a lot for one. Lobster Bisque was lick-the-bowl flavorful, and crabmeat Ceaser salad was strong as well. Entrees: 10 oz filet was a lovely piece of meat, and the season salt on the side was a new and appreciated touch. My medium rare order came out closer to medium, but not a big deal. Brûlée sweet potato was a perfect side, and the cinnamon butter was the perfect compliment to it. Yellowfin tuna was also a hit. Our server Michael Dempsey gave the meal a welcome sense of professionalism, and relaxing pace that never felt slow.<br><br>The dining room was comfortable, with the booth seating a massive upgrade over the tables. Only down point was the cigar bar patio entrance. A nice idea, but could use some additional ventilation or airflow to keep the odor away from the dining room doorway. <br><br>Oh, and the old fashioneds were great- kept us warm throughout the meal", "pics": null}}, {"review": {"des": "One of the best brunches yet! Our server Stephan was equally amazing!  The rest of the crew & Jen made our brunch a memorable one.  Definitely taste the prime rib & bacon  delish! We'll definitely be coming back when we visit Chicago!", "pics": null}}]}