{"name": "prosecco-chicago", "reviews": [{"review": {"des": "I wish there was a way for me to tell more people just how amazing this place is. <br><br>This is the second time my fiancé and I have been here for a special event and I couldn't wait to come back. This time we celebrated our anniversary and it was perfect. We had the same server as last time (Christian H.) and he is wonderful! So funny and quirky and always willing to talk to you about menu items. Of course we were given a complimentary glass of Prosecco and even offered a special menu that said \"happy anniversary\" on the top of it. So sweet.<br><br>We started with the antipasto of prosciutto, cured tomatoes and burrata. Definitely one of the best appetizers we've ever had. The burrata literally melts in your mouth. I entertained the idea of getting something different this time but had to go with the Tartufate - it's notorious here and it's amazing! My fiancé went with the Norcina. They were both to die for. You HAVE to come here for their pasta. Sooooo much better than many other hyped up Italian restaurants in Chicago. Even the bread they give you before your meal is incredible, it comes with grated Parmesan, olive oil and some kind of yummy compote of tomatoes and I believe golden raisins. Seriously. So. Good.<br><br>Romantic atmosphere, great service & phenomenal pasta. You just can't go wrong here.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/06wUwGQafqMfvQFZWhVMbw/348s.jpg", "caption": "complimentary bread with olive oil, grated parmesan & a yummy spread."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Cv2NJgt6N2EUjw8l80BUEg/168s.jpg", "caption": "Tartufate pasta"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/P57n3uw-yzvuipWzA6ec1A/168s.jpg", "caption": "Norcina pasta"}]}}, {"review": {"des": "I don't know why I don't hear about this place more often as a go to spot in River North. It is AWESOME and the homemade pastas are perfect. Great ambiance. Our waitress was as professional and great as they come. <br><br>The Tartufati pasta was amazing. It's hard to find homemade orrechiette in the city and this was fabulous. The Frutti di Marre was even better! Perfect homemade squid ink spaghetti and generous portions. I would eat this every night. <br><br>The whitefish was incredible as well. Big piece of fish, perfectly cooked and seasoned.<br><br>Overall, I'd take this place over so many of the more hyped italian restaurants in river north. Very underrated and delicious!", "pics": null}}, {"review": {"des": "What a delightful Italian treat! We've had several wonderful dinner experiences here and always look anxiously forward to our visits.  The food is ALWAYS fresh, handmade, and exquisitely prepared and presented. The service is ALWAYS impeccably attentive and charming without being intrusive. Their recent makeover is beautiful, but then it's prior incarnation was lovely, just different. Chef Mark Sparacino always comes by to chat with us which, of course, makes us feel special and we greatly appreciated that.<br><br>Conveniently located near museums and the best shopping Chicago has to offer, and surrounded by a sea of other dining options, you would be doing yourself a gross disservice if you miss out of having the \"Prosecco\" experience.", "pics": null}}, {"review": {"des": "Celebrated my bro's bday here last night in the cutest little private room which was perfect for our family! My dad likes a quiet dinner, and it was nice we could all hear each other. The atmosphere was obviously very intimate, and we loved the redesign! The old decor was old fashioned luxury, and the new decor is very hip, sleek and fun. Be sure to check out the wallpaper in the bathrooms! <br><br>As for the food, we started off with some apps, and my absolutely fave dish was the burrata and peaches. Holy smokes was the burrata fresh! It was a delicious starter. We also started with complimentary prosecco (how fitting!) and ended up getting a bottle for the table. <br><br>For our mains, everyone chose differently. Some people did pasta, some people (aka me) did fish. The whitefish was huge and perfectly cooked; it was my first time having fish here (I usually go with pasta). The fish was buttery and did not disappoint. All in all, this is a fabulous spot for a celebration!", "pics": null}}, {"review": {"des": "My husband and I did a last minute reservation here for Valentines Day. We had reservations for 6:15 but we were running a few minutes late. We called to let them know and they were very accommodating and said they're be able to figure it out as long as we're not too late. We got there around 6:25 and were quickly seated. The server brought over 2 glasses of champagne and water. <br><br>We weren't that hungry so we were going to skip an appetizer and ordered our entrees.  After we told the server we weren't so hungry he suggested we order half portions of the pasta and an appitizer which was very nice of him to tell us. We started with burrata. It came out fairly quickly and was exactly what we expected it to be. The burrata was fresh and basil pesto went really well with it. For dinner we ordered Tartufate  and Norcina. Both dishes were fantastic. The Tartufate was a lighter on the heavier side so I'm glad I only got half a portion. <br><br>Overall we had a really good experience here. We will def we back to check out some other dishes.", "pics": null}}, {"review": {"des": "Absolutely the best food I've had in Chicago.<br>Great location and amazing atmosphere.  They have a great selection of fine wine and cocktails served by an engaging staff.<br>The menu is varied, but not overwhelming.<br>If you want to impress someone without overpaying for your evening, this is the place for you.<br>(Frequent traveler from out of town).", "pics": null}}, {"review": {"des": "I've wanted to like Prosecco for years, and I had hoped with the remodel this past Spring that I would like it more.  Unfortunately, I still find the food very bland.  <br><br>Some other couples and us were fortunate to eat outside the other week on their lovely patio.  It's lovely to sit outside in Chicago during the summer.  We shared a few bottles of wine - a Il Poggione Rose and the Maso Poli Pinot Noir.  All of us loved both bottles of wine and would recommend those to anyone.<br><br>For food - I had the Risotto Manzo w/ beef tenderloin, caramelized onions, and red peppers.  It was a large portion, but unfortunately, it lacked flavor.  I tried adding more salt and pepper, but it just didn't help.  Sadly, this is the trend I've had at Prosecco over the years.  My husband had the Norcini - italian sausage and pancetta.  He thought his dish was okay, but nothing great.<br><br>So - sadly - even though they are around the block from me, I'll only go back for drinks.", "pics": null}}, {"review": {"des": "Solid pasta dishes and risotto! Loved being able to sit outside on their patio. We started with a delicious burrata with peaches, and we were blown away by the frutti di mare and risotto manzo! Already looking forward to returning. Some of the best risotto outside Italy! <br>Service was a bit slow with long wait times in between drinks, courses and getting the check.", "pics": null}}, {"review": {"des": "Few doors down from the Boarding House around the near north side. The new slick and modern interior is nice. The atmosphere is cosy yet loud. <br><br>We were greeted with a sip of Prosecco at the table which was nice. We enjoyed a flavorful carpaccio and peach burrata to start followed with the Risotto di Manzo and the Cozze e Vongola con Zafferano. Lastly, we had the tiramisu for desert, which was excellent! Overall, great service received.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ouOFiJ0xRmAhxoWsVRbf-Q/348s.jpg", "caption": "Tiramisu"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/R8FSUUKA5LiLy-_Xx-wEVA/168s.jpg", "caption": "Risotto di manzo"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/klc7EHolCOKy-PuVst3Pyg/168s.jpg", "caption": "Mussels"}]}}, {"review": {"des": "This restaurant really sets the standards for a 5-star review. Great neighborhood spot that goes above and beyond in every aspect. We were welcomed with a complimentary toast of prosecco (appropriate) and were met with stellar service throughout the meal. Our waiter and the manager both were very patient, attentive and knew their menu and wine list very well - helped everyone choose their dinner.  I ordered the orecchiette tartufate, one of their most popular dishes and it exceeded expectations - a delicious pasta unlike any other, creative and yet authentic, and a great vegetarian option. The restaurant is beautiful and accommodated our large group.", "pics": null}}, {"review": {"des": "Great neighborhood Italian!<br><br>Fantastic local spot, great for couples for a romantic evening.  Excellent ambiance and service.  One waiter noticed an issue with our food order as it was coming out to our table and made it right before we even noticed it or asked.  We'll be back.", "pics": null}}, {"review": {"des": "Had business dinner here. Great seasonal seafood. So big variety of seafood in one dish. So attractive and yummy. Good environment.", "pics": null}}, {"review": {"des": "Wow wow wow, DELICIOUS!!!<br><br>Came here for dinner this past Friday and what a wonderful dining experience. As soon as we sat down our waiter came by and poured us a glass of Prosecco and told us it's an Italian tradition to start off every meal with a sip of Prosecco ( love it). <br><br>Food:<br>Burrata e Prosciutto ( really good but I would only say that the burrata was way too firm more of a mozzarella) <br>Spaghetti ai frutta di mare ( great selection of seafood I believe there were muscles, shrimp, calamari, fish and scallops)<br>My friend also ordered a shrimp pasta and it was delish but I cant remember the name of it<br>Tiramisu- yumm<br>Chocolate gelato- AMAZING<br><br>All the food was spectacular. The gelato was on point and we devoured it right away. <br><br>Everything from the wine, to the food, to the service to the ambiance was really lovely.", "pics": null}}, {"review": {"des": "Food was ok.  Service by the servers was pretty much bleh.  The folks bussing the tables were fantastic which is the only reason stars isn't 1-2.  Whatever you do don't get the double pork chop, flavor was bland and it was literally a piece of bland meat with bland sauce and wet potatoes.", "pics": null}}, {"review": {"des": "Alex was our server and she was fantastic! She was very friendly, personable, and she has the menu memorized. She made our dinner very enjoyable. The chef even came out to make sure everything was up to our liking and ended our dinner with the perfect touch of limoncello. We will be back very soon and don't forget to ask for Alex.", "pics": null}}, {"review": {"des": "Love, Love, Love! The restaurant is beautiful and the entire staff is great! Each guest is given a welcome pour of Prosecco when seated. The wine menu is extensive and the cocktail menu is very nice. The food is AMAZING! I've been here to dine several times and haven't had a bad experience. There's also a private room on the lower level for private events and it is absolutely stunning. Can't go wrong with Prosecco.", "pics": null}}, {"review": {"des": "Fabulous menu, staff is on point and love the redesign. Prosecco is everything you want for everyday and every special occasion.", "pics": null}}, {"review": {"des": "Second time at Prosecco.  Love the atmosphere, the food and the service.  Would highly recommend Bobbie as your server.  She remembered us from the first time we were there and even remembered our orders!  Great service and the food is spot on.", "pics": null}}, {"review": {"des": "A River North gem! <br><br>We love coming here for drinks and nibbles, as well as for dinner -- especially when it's nice enough to sit outside. The service is so warm and friendly, and the food is fantastic. Seafood dishes are fresh and cooked perfectly, and they have a number of really good pasta dishes, Tartufate being a personal fave.<br><br>Would highly recommend this place for dinner or just a glass of Prosecco.", "pics": null}}, {"review": {"des": "Incredible restaurant with food that takes you back to Italy. The menu melts in your mouth as everything is so well put together.  The one list has over 200<br>Wines and most being from Italy. Most of the staff is very intelligent about the wines and where they come from.  The food melts in your mouth and the atmosphere is classy. Great date spot. Would go back in a heart beat.", "pics": null}}, {"review": {"des": "My husband and friends took me here for my birthday dinner, and let me tell you; you won't be disappointed! The romantic and beautiful atmosphere of the old building, paired with the incredible service and food, will leave you wishing to never leave.<br>Every dish we ordered was perfectly prepared, and more delicious then you can imagine. The wine menu, (book) is beyond any selection I've seen in a restaurant. Not only was the the service friendly and inviting, the Chef made a point to come visit our table and asked to take a shot of their delicious house-made Limoncello! Which just made the night that much better! <br>If your in Chicago, don't pass on the opportunity to eat here!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/z5_FrwWLSE4IdOIpJsQQSw/348s.jpg", "caption": "Their wine selection is amazing!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/L06UbTYhCcLG_y0KAxMWYA/168s.jpg", "caption": "Best pasta dish I've ever eaten!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/F3xMRLsPySiFdf68rjipQQ/168s.jpg", "caption": "This dish is delicious"}]}}, {"review": {"des": "This place blew me away. First of all, the Service is amazing. Everyone is extremely friendly and accommodating. So polite and attentive. Staff were really on top of making sure we had everything we needed...and not in that annoying way some places do it. I had gone to the bathroom and when I got back this waiter actually took out my seat to help me seat which I was thought was so classy. The food was great. I had the Orriechette tartufate and it was literally orgasmic. I haven't had vegetarian pasta that good ever. So creamy and flavorful. The the avocado salad was very refreshing. Wine selections was huge and they give a small amount complementary champagne in the beginning which was a nice touch. I will def be be back.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/U2Wg5CMVKLzeGuLp3bUJ2A/168s.jpg", "caption": "Orcchiettr tartufate- best pasta I have ever had"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/gqlXAfVQ2WfGlYKbxdgi3A/168s.jpg", "caption": "Risotto"}]}}, {"review": {"des": "Neighborhood favorite. Awesome front bar and casual but also upscale dining room. All of the dishes have been great, but the chicken was particularly amazing. Great friendly service.", "pics": null}}, {"review": {"des": "Came here with a friend to have a great dinner as well as a great time. The feel was very classic and contemporary. We had a reservation and was seated immediately without wait. Service was great as our waiter gave us great recommendations as far as our selection of seafood entrees as well as a perfect wine pairing for the food. I had the scallops as my friend chose the wild salmon. Both were amazingly delicious with great flavor. The same goes for the appetizer that we had which was a grilled calamari salad which was simply bursting with flavor with every bite. Great feel with the atmosphere and ambiance. The head chef came to our table as well to make sure everything was perfect. Great restaurant indeed!", "pics": null}}, {"review": {"des": "What a GREAT dining experience.  Came here with my son while my wife attended a post-holiday party with her company nearby.  Prices looked to be about AVERAGE for that part of town, however portion size was much SMALLER than expected.  QUALITY (both food & service) compensated for portion size, so we were both quite pleased.  Only one appetizer plus one entree (plus dessert) is not enough, so maybe next time (and there will be a next time) we'll try the multi-course menu (as our waiter originally had suggested).<br><br>We both enjoyed our appetizers.  I had the Grilled Octopus and Calamari, while my son had their \"Avocado.\"  For entrees, I had Veal Saltimbocca.  It was the best I had in several decades, and a dish I often order (though usually to my disappointment) whenever I see it listed on a menu.  My son ordered a seafood soup (\"Zuppa di Pesce\"), which he said was even more enjoyable than the Bouillabaisse we order regularly from Parker's in Downers Grove (which we consider excellent).<br><br>Again, the portion sizes were small.  My three veal medallions were no bigger than a silver dollar (though stretched oval), while my son was able to completely finish his soup, and still look forward to dessert (at Parker's, we bring 60% of the Bouillabaisse home, and there's enough for all 3 to share the next day, and when we do order dessert, it's usually \"to go\").<br><br>Now to the funny part (dessert).  Expecting something similar in size to the \"Chocolate Tower\" he gets at Parker's, the \"C'mon Man\" look he had on his face when they brought his a-little-bigger-than-an-Oreo flourless chocolate cake was a most precious (missed) photo-op. But he did enjoy it immensely, as I did my Tiramisu.<br><br>Bread was great, though I said \"no\" to a second basket when offered (before the entrees were brought out).  The complimentary procecco  (just enough for a toast) was very nice, so I ordered 2 more glasses during my meal.  The cappuccino was also perfect.<br><br>All-in-all, a great place to which we will return soon (just won't have to worry about over-ordering).  We were half-tempted to stop for sushi a half-block south, though it was a long evening and mom was ready for us to pick her up and go home.", "pics": null}}, {"review": {"des": "The escargot is definitely my favorite item on the menu. The lamb was cooked perfectly rare. Everything else was amazing as well. The staff was very friendly and helpful. Definitely my favorite place to go to for high end Italian food.", "pics": null}}, {"review": {"des": "Food 5<br>Atmosphere 2<br>Service 2<br><br>So that's why 3 stars. The food was excellent. Pasta perfectly cooked and high quality. I usually don't like getting pasta at a restaurant because I eat it at home so much but this meal was worth it. <br>Service was lacking and there was no atmosphere. Sat us by the door on a cold night when the whole restaurant was open, not very attentive staff. <br>Probably won't be back to dine in but potentially take out because the pasta really was that good.", "pics": null}}, {"review": {"des": "This past weekend we where back in Chicago visiting friends and of course wanted to visit one of our favorite Chicago restaurants. Unfortunately the experience was not what we expected. As we walked in the door on a busy Saturday evening we where greeted by the manager (we presume) yelling at  one of the two hostesses.  The other hostess asked our name and was pulling out menus to seat us but she was trapped in the corner by the manager. The yelling went on for a good 30-40 seconds which seemed like an eternity at the time. Finally he stopped and we where seated at our table.   The manager never acknowledged our presence. We ordered two shared appetizers, and Spaghetti Carbonara to share. Each of the four of us then ordered an entry. We could hardly wait!  The burrata's were super, two different versions as appetizers. Then We waited and waited some more but no Carbonara or waitress for that matter - a good half hour. Runners then brought out our four entries. Needless to say a bit perturbed missing our shared pasta. We asked wait staff to find our waitress and send her over.  While apologetic she insisted that she bring the pasta, we insisted that it was too late as we couldn't really eat a shared item and our entry at the same time.  We eventually gave in to getting it to go - comped ie no charge and a couple of free after dinner drinks.  The free drinks never arrived and getting the bill was like pulling teeth. All and all not the experience we hoped for.", "pics": null}}, {"review": {"des": "Exceptional....which is Excellent++ on par with my personal benchmark which is Il Mulino in New York......best of breed in a cutting-edge Northern Italian. We hit all of the critical \"checkboxes\".- Outstanding Beef Carpaccio, Amazing Risotto, Outstanding Chianti Reserva, and top-notch sorbets....grand slam! <br><br>Tables spread far enough apart from a business conversation, very attentive staff, and a bill that was HALF of what I had expected.", "pics": null}}, {"review": {"des": "Delicious! Great atmosphere and service.  Had a beautiful risotto and burrata. Short on waitstaff but comped our dessert. Will return!", "pics": null}}, {"review": {"des": "Dined with friends on their outdoor patio and can't wait to visit this spot again. The food was incredible and the service was equally on par. I ordered the meatball salad and I also tried the pesto pasta. Both delicious. The complimentary glass of Prosecco was a nice touch.", "pics": null}}, {"review": {"des": "Father's Day. We had great service and really enjoyed the food. Wine was nice, Peroni available. Enjoyed two special items - Burrata antipasti and then a pasta. Husband got the Saltimbuca and we also enjoyed dessert.", "pics": null}}, {"review": {"des": "First time at Prosecco, it was so totally wonderful that 5 stars isn't enough!  The ambiance is spot on for a very relaxing eve in a great venue and the chairs are so comfortable.  Staff is exceptional.  And then the food, it's really the star attraction.  I had the risotto and it was the best and creamiest I've ever had.  Tiramisu was also the best. Don't remember what the rest of the family had but all were very, very pleased.  Can't wait to go back!", "pics": null}}, {"review": {"des": "We just had a small bday party in the alcove. <br><br>Could not of been better. Jennifer was wonderful to work with and food, staff, servers and everybody else could not of helped more to crest a great night. <br><br>Thank you Prosecco and team!", "pics": null}}, {"review": {"des": "I just created my Yelp account and thought I should start using it! I went here for the first time maybe 6 years ago and thought Prosecco is a lovely restaurant inside and the atmosphere is so warm, buuuuuuuuuuuuuuut not sure what I Think now. <br>My bf and I wanted to go for dinner last night and I thought \"hey, why not Prosecco? Very cute place and food was so good last time I was there (6 years ago)\". I called at 7:30 pm on a Saturday and asked if they could squeeze a party of 2 at 8:30 pm. The hostess was very nice and right away said that will be fine. Yay. <br><br>We walked in at 8:30. The hostess took out coats and the second hostess said she will show us our table which is close to a larger party and if we don't really like it, we can look for another table. Once we got to the table, it was more than fine. From the get go everything seemed very organized and welcoming. Then a waiter comes up to us with a great and fun attitude and pours us a taste of Prosecco. Then after a few minutes another gentlemen comes to our table (I think a manager) and asks us if we would like drinks. He offers me a chanti and I take it and I love it. So we think that he will be helping us out tonight, but no. Another waiter comes by and just simply asks if we decided. <br><br>We ordered for appetizers:<br>1. Grilled calamari and octopus ($18) I love grilled octopus and calamari and I pretty much try it everywhere if on the menu. It was good, but after a few bites I realized there was no lemon juice on it and lemon wedges to use. We had to ask not the waiter (because he was never to be found) but the Super helpful bus boy. <br><br>2. Meats and cheeses ($18) Oh my gosh. Very plain. I would never order this again  For sure not worth the price tag to it. I think I've done a better plate at home with better presentation. Do you know those trays of 4 meats you can buy at a grocery store? That's what it was. One type of uninteresting cheese and few olives. Usually at a good restaurant, the meats and cheeses are explained, they come with mustard, and crispy toast or bread. Plus, it tasted like they came from a packaging that has been aired and opened for a few good days. It had a nice so tasty after taste. <br><br>Then he asks us \"what about main entree?\" and we reply that we are still looking and he just walks away. I saw there was a specials menu as well. Nothing too exciting. For example, regular menu has bolognese pasta with boar and mushroom ragu and the specials menu had fettuccine bolognese. Not sure what was the difference, because it sounds kind of similar. Anyway, the waiter just was not too helpful, abrupt, and didn't make the experience too great from the beginning. He did the minimal work and the bus boys did all the work; he only came by 2 to see if we need more wine and if the entrees are ok. We also had empty dishes in front of us sitting there for a while in front of us and my bf said the waiter passed by smiling but not noticing what's going on the table. <br><br>The first waiter whom poured us Prosecco was helping out the large party next to us and man was I jealous that he didn't get to help us. He was so fun, personable, and he also brought us some sauce for the cheese whereas our help was just blah. <br><br>As far as entrees, we ordered two pastas: boar and mushroom bolognese and the truffle pasta. The bolognese was great although it needed a little bit more sauce as it was rather dry. The truffle pasta, I was told this is the best seller, but to me it was anything that I am dying to have again. <br><br>So I think it would have been a better experience if we had someone helping us who was more into what he was doing. <br><br>Overall, it was aight.", "pics": null}}, {"review": {"des": "I love this place, great vibe, great food, excellent service. The owner and staff always make you feel welcome. Great place to relax", "pics": null}}, {"review": {"des": "Went the day after Christmas and had a wonderful meal.   We were seated early which was a plus.  The food was great and very nicely presented.  The espresso should have been served in the proper cup but that is the only thing that was amiss.  The waiter even made sure our car was waiting as it was very cold.  Definitely a place to put on the list.", "pics": null}}, {"review": {"des": "Food is loaded with salt and unimaginative. Service is slow and inattentive. Wait staff had no knowledge of the wine list. <br><br>\"Chef asks us to order appetizers and entrees at the same time on nights like these (but half the tables are empty).\"  Translation: you guys are my last table and I can't leave until you're done so I'm going to push you to get out of here. <br><br>This place sucks. I only give it 4 stars so my review doesn't get buried in the \"not recommended\" reviews section (scroll all the way down to the bottom of your app/browser. Those are the truthful reviews)", "pics": null}}, {"review": {"des": "Great food, excellent service (they're the best) and ambiance - favorite Italian restaurant in Chicago - Mark (Executive Chef) and Sam (GM), and Anna (waitress) are awesome <br>Favorite dishes: avocado salad, gnocchi is amazing (spinach dumplings), salmon with lentils is really good too, loved the skate fish special & chocolate cake is delicious <br>Favorite wine: Primitivo, the same grape as with Zinfandels and awesome grapa", "pics": null}}, {"review": {"des": "Walked in on a Saturday night and sat at the long bar. A party was assembling and they were making so much noise it was impacting my ability to hear my partner. Now I may be overly judgmental, but a restaurant of this reputation and caliber is not a pickup bar. Management should have seated this group or asked them to respect the venue. It reflected badly and I will not be back. Horrible experience. Too bad because the menu, though pricey, looked worthy.", "pics": null}}, {"review": {"des": "This lovely place is a staple of restaurants I love. I've been going there for the last 10 years and Mark (chef/owner) never disappoints me. The service is always great and the staff are extremely helpful.", "pics": null}}, {"review": {"des": "Grilled avocado stuffed with lobster and shrimp is an amazing way to start the meal. Calamari and squid appetizer was beautiful, but not my favorite - too chewy. Osso bucco risotto portion was hearty - enough to split! Delicious! The Italian wine specialist, Sam, was a delight! So fun and knowledgeable! Ana was a fantastic server! Highly recommend.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/1drXh5JvwSMG51sRZrXOXQ/348s.jpg", "caption": "Octopus and calamari appetizer"}]}}, {"review": {"des": "My husband decided to take me for a dinner. We came to celebrate Valentine's Day, and unfortunately it was the worst dinner ever!!! Let's start from the beginning, we came on time and everything was ok, we got a table and decided to order drinks, I ordered wine and my husband ordered beer. Our server didn't know how to pour beer correctly so it was all over the table. Then we ordered an appetizers, I let me server know that I'm pescetarian and I don't eat meat. I asked him if the clams appetizer has any meat, he said \"no\", so I ordered it. After we got our appetizers and I started eating it, I realized that something there looks like pieces of sausages, I asked my server again if it's meat, he said: \"absolutely not! It's clams or fish\" I was like okay, thanks. And I gave it to try to my husband, he said that it is meat!!!! So I told my server once again, he said: \"ok, I'm sorry about that, it's gonna be on a house\". Are you guys serious? First of all, what if had an allergy? I could die because your server doesn't know what ingredients are in every dish!? Secondly, not eating meat, is my lifestyle, my choice and it's very important to me! First time in 3 years since I became pescetarian, Prosecco restaurant (\"high level restaurant \") forced me to eat that meat! Your apologies are nothing. I was about to start crying. <br>It was a couple seated near us, and they got there pasta with pieces of chicken, but on the menu it was only salmon. They were vegetarian too, so they  weren't  happy as well. <br>But anyway we ordered 2 pastas, one vegetarian for me, another one with shrimps for my husband. <br>Another server (turned out that she was a co-owner  of the restaurant) brought us 2 pastas, and one was  with meat, instead of the one with ordered with shrimps!!!!! So we explained it to her again, she said that she is sorry and she touched me by the shoulder at least 5 times like I'm her friend or something. Lady, don't touch people in any way! I'm not your friend and I don't like it! That's my intimate personal space! Do you know what's that!?! So in the end, she brought us one more pasta with shrimps and told us that the third pasta is on a house... The rule of the Valentine's Day was 75$ minimum charge per person, which is a lot!! You can't spend 75$, seriously for real it's a lot to spend, their prices are not so high, you could die of the food coma! And especially if you are not drinking, so that stupid. You guys are saying that you are high level restaurant, and you are asking for minimum charge? Lol. If your costumers will like what you do they will spend even more.... <br>hold on, it's not the end of the story. We got our check, and they took my clams appetizer out of the bill, but in the end of the check they added it again!!!! Can you imagine??? I was sooooo mad, so I was asking our server to come to our table again, I was like what's wrong with you guys??? And it was 22% tip included!! Do you really think that's normal!?!? 22% tips are for really high level of service, your service worth 0%, in any fast food they serve you better then at your \"restaurant \". And then..... their fancy chief (second co-owner) came to our table and started screaming on us, tore a check from my hand and started his loud show: \"I'm so tired of you, relax, everything is on a house! We are very busy today. And  you ruined everyone's Valentine's Day and bla bla bla\".  excuse me sir, don't you think you ruined our dinner????? And do you really think that I care if you are busy or not? It's none of my business! It's so unprofessional to explain why you messed up, I don't want to hear your excuses, because I DO NOT CARE!!!!! I came to relax, to pay 150$ plus tax and plus 22% tips and not to solve your problems! In the end their manager came to our table, and he was the only one polite and professional there. I will never come again, I will post my review on every social media! I DONT recommend this restaurant to anyone! Please be aware!!!", "pics": null}}, {"review": {"des": "Absolutely loved this place. We were seated right away and waiter took no time to make it to our table. They were very friendly and attentive. They started us off with complimentary champagne. Very nice selection of wine and liquor. We had the avocado salad to share, was very delicious.  Then I had the Risotto, which was amazing. The portions are well worth the $. Can't say anything bad about this place the food, service it's all how every restaurant should be. Great romantic place for a date night. Highly recommend it.", "pics": null}}, {"review": {"des": "Prosecco is one of those places where you don't just go for dinner. You go here for a great evening.<br><br>The service is top-notch. They didn't rush us to order, and were happy to explain everything on the menu. With our complete lack of knowledge on wine, They had a wine expert on staff to help us navigate their very long wine list.<br><br>The food, from appetizers to dessert, was fantastic. You can't go wrong here.<br><br>The ambiance is great; perfect for date nights. And the best part is they don't play any cliche Frank Sinatra music like most Italian restaurants. We will definitely be returning!", "pics": null}}, {"review": {"des": "Prosecco is a charming, elegant space great for dates and big groups (semi-private areas with big tables can be reserved). When you sit down, you are greeted with a small taste of prosecco, which I really appreciated. The food itself was tasty but in my opinion, overpriced ($23 for my pasta course). <br><br>Although the flavors and presentation were nice, I was slightly upset by the service. I made the reservation for our wedding anniversary, which I mentioned upon booking the reservation. Although I shouldn't have expected anything, I did think maybe the restaurant would congratulate us or offer a dessert treat, although nothing about the anniversary was mentioned. <br><br>Overall, good food and wine, nice atmosphere, maybe not the best for anniversaries/birthdays if you want special treatment.", "pics": null}}, {"review": {"des": "I dined at Prosecco during Restaurant Week with three other friends. Overall, it was average. I wouldn't dread going back, but there are just way too many better Italian restaurants out there....  <br><br>LOCATION/DECOR. It's cute, clean & has a decent amount of parking nearby.  <br><br>SERVICE.  I'm conflicted. The service wasn't bad. The waiters were all quite friendly to some degree.  They were all just... really clumsy. One waiter dropped a wine glass by my friend, another waiter was shaky as he was pouring water into my glass, and another waiter spilled my friend's glass of Prosecco on her (they did give her another glass though).  Now, if the restaurant was packed and they were all really busy...perhaps this would have made a little more sense.  However, we arrived at 5:30pm and there was literally one other occupied table.  <br><br>FOOD. We were all served a glass of Prosecco.  The eggplant spread for the bread was good.  The butternut squash soup of the day and Granchio e Riso (Risotto crab cakes) were the best parts of the entire dinner.  However, the entrees were just too salty. The risotto di Manzo, Saltimbocca di Vitello, & Rigatoni alla Norcina were all too salty.  Especially the veal.  A forkful of my friend's veal entree made me chug half a glass of water.  Their tiramisu and their gelato (my friend chose a flavor that was similar to Nutella) were decent.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/mcTqqIadKda32p-SsC-CxQ/168s.jpg", "caption": "Risotto al manzo"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/V5Y8BV_B_2K9oWJO98LBtg/168s.jpg", "caption": "Risotto crab cakes"}]}}, {"review": {"des": "Best Italian food I've ever had short of being in Italy. Which I've never been so this is basically that. Went with grandparents and girlfriend, you should definitely try as many things as you can. It's all amazing.", "pics": null}}, {"review": {"des": "Greeted immediately with smiles as my boyfriend and I came in the restaurant. My boyfriend arranged to have dinner here to celebrate Valentine's Day (Feb 13 instead bc of the snowstorm on the 14th) The ambience is quite romantic. Candlelit dinner with a red rose placed on each table. <br><br>The service I have no complaints! The staff made my boyfriend and I feel comfortable and welcomed! <br><br>As soon as we were seated we received a complimentary prosecco <br><br>We ordered the crab cakes first and I loved it! My boyfriend felt it needed a bit more flavor though but I enjoyed it. <br><br>For dinner:<br>My boyfriend ordered Spaghetti alla diavola which he could not stop talking about even when we arrived home. <br><br>I ordered the Rigatoni Norcina. Sadly the first plate the rigatoni was a bit on the hard side. I couldn't force myself to eat it (I don't like sending dishes back to the kitchen) so I ended up sending it back. Our waiter was apologetic and said my meal will come just like I wanted it. He was right! The rigatoni was cooked and the sauce tasted even better! <br><br>I will love to come here again. It's very romantic. <br><br>The only downside is that the tables are too close to one another. A bit more space so I can't overhear the next party conversation.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/L2YfBofnbpy9OrnfKGNY3Q/348s.jpg", "caption": "Rigatoni Norcina"}]}}, {"review": {"des": "ALL GLITZ<br><br>I want to start out and say the service is great. Our waiter Gaetano was really good. I loved that he was born in Italy and spoke fluent Italian. He was able to speak to our non-English speaking guest, which was impressive. The staff was really on top of it. I would give 5 stars for what they did. The bus boy was very attentive and kept the whole table in order. <br><br>So you're probably wondering about the two stars. I was completely unimpressed with my dinner entree. I ordered the SPAGHETTI FRUTTI di MARE  which was $24.  The dish consisted of Spaghetti, bottleneck clams, mussels, shrimp, mahi mahi, calamari, a scallop, white wine, garlic, extra virgin olive oil & chili flake. I asked Gaetano if my dish was spicy. He said, \"No!\" He was probably thinking I didn't like spice. I told him to make it extra spicy. He told me not to worry that the chef was Mexican. I then told him to tell the chef to hurt me with heat. <br><br>Fast forward to my dish arriving. It was not even close to being spicy. The Pasta was completely tasteless and not served hot. I understand we had 11 entrees hitting the table and they all can't be hot but mine surely was sitting a while at the pass. The white wine, garlic & olive oil sauce was completely void. I actually had to attempt to fix it at the table myself. There was a bowl of red pepper chili flake at the table which I used to add to my pasta and a bottle of Olive oil that I generously poured over my pasta. It tasted better but I had to fix it myself and I shouldn't have to do that for a plate of pasta that costs $24. Also the mahi mahi was so over cooked it was icky and the clams had some sand particles which is a huge pet peeve of mine. The mussels and shrimp were amazing. Oh and the calamari consisted of one single tiny ring of squid. It was like Where's Waldo with squid. <br><br>If I could go back in time, I wish I could have ordered anything else off the menu except what I ordered. I have no idea how I could have selected the worse possible dish on such an impressive menu. I was really letdown. <br><br>I'm not sure how everyone else's dishes tasted. I was able to taste my wives pepper crusted ahi and it was good. After tasting her dish I really knew I had the bad dish on the table. My little one had the risotto and I could tell she wasn't that impressed. When we make it at home she can't stop eating it. Her only comment was that it was too salty. In fact, when I told her we were going to wrap it up, she didn't even want to take it home. And my little one loves good food. She did tell me that if she could write a review she would go 2 stars. I'm going to have to agree with her. <br><br>Now there were a few bright spots. The pistachio ice creme was delicious and it is the only reason I would come back here. Pistachio is one of my favorite flavors and I can usually only find it in Italy, so I was excited to see it on the menu here. Also the Lemoncello was very good too. I hear that it was house made. I would order that again. I really didn't like the chocolate cake. It had a deep taste of real chocolate which I do not like. <br><br>The room is fancy. There are some great little rooms for intimate private dinning. The bar is beautiful. The whole area is very elegant. I can not say a bad thing about the space. <br><br>Would I come back to eat here? Probably not. Based off of my dish this place is over priced for what you get. I would have expected the most amazing pasta dish for $24 but instead I was given a dish that was tasteless, bland & uninspired. I had such high hopes walking in here and I walked out completely dissatisfied. This place puts on a good show but the food is not part of it.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/T-x0V9ms9RnXSz30jHhkjg/348s.jpg", "caption": "Storefront"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/MWarC9iOsyOfG9DYnLSeFA/168s.jpg", "caption": "Grilled shrimps on the side"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ykFCOv8uRryKz99eeC-qCA/168s.jpg", "caption": "I highly recommend the pistachio gelato with salted pistachio on top."}]}}, {"review": {"des": "This is a great place for special occasions. The ambiance is really nice coupled with great Hearty Italian meals that gives you the satisfaction like no other food! I am giving this place 1 less start because their lobster bisque was bad. You can tell the difference when you eat here between home made pasta goodness vs the usual Italian you get other places. Except the soup all other food was great.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/JmamYyr5WF63cswITzZS2A/348s.jpg", "caption": "Dinning hall"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/2Rr3CAhhf3Vynr2gA73_0w/168s.jpg", "caption": "Appetizer"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/vl2HTNum_ld__hNchGMs4g/168s.jpg", "caption": "Lobster Bisque- below Average. Not recommended."}]}}, {"review": {"des": "My only hesitation in writing this review is that I don't want to ever find it difficult to get a reservation here - this is THE BEST Italian in the city (and I've tried them all).  A perfect combination of great food, ambiance and service all at a very fair price.<br><br>The flavors are best described as a fantastic blend between \"old school\" and \"creatively new\".", "pics": null}}, {"review": {"des": "i liked it. very much. Yelp says i need to add more words, but whatever. It's good. Food good. Wine good. dress pretty. fire bad. monkey funny.", "pics": null}}, {"review": {"des": "One of the best restaurants in the city.  Great Italian food in a warm, friendly romantic environment.  It's always our go to restaurant for special occasions.  When it's on the menu (as a special), you must try the Veal Chop.  It's my all time favorite meal ever.  Quality is top notch as is the service.  You'll likely be visited by owner/chef Mark.  He's always there making sure everything is perfect.  Run, don't walk.  I also know they are closing soon for a renovation.", "pics": null}}, {"review": {"des": "Complimentary champagne? Can I get a hell yeah! The Avocado salad was amazing with pieces of soft ripe avocado and seafood over a spread of green and sweet sauces. The veal was rolled flat with a piece of cheese. Spinach was a bit salty, and mashed potatoes on the side was standard.", "pics": null}}, {"review": {"des": "Very nice ambience, very good service.  It was the wife's birthday dinner out, Cubs World Series was on, so they put us on the other side of the restaurant away from the bar where it was quieter (although I had line of sight to the scoreboard ;)<br><br>Very nice tomato basil soup, truffle pasta, and my ribeye was cooked to perfection.  Will definitely be back!", "pics": null}}, {"review": {"des": "The atmosphere at Prosecco is romantic and trendy - it's lively enough without being loud. Basically, it's wonderful! The food we ordered: salmon, chicken, spinach, fingerling potatoes, broccoli. The food was all delish - no complaints whatsoever. The HUGE downside to our experience was our waiter. He tried to push us to buy more (\"you should get cocktails before your wine\"...x's 3. The worst part was when we didn't want any of the appetizers..none were quite up our alley for the moment...he repeatedly tried to get us to order one anyways- after I kept saying no, he then asked my date if he would get an appetizer and told us both that \"it's pretty busy here tonight\" as in don't waste our table space if you're not going to order more.) It was inconceivably rude. I totally understand he has a job to do and should try to \"sell\" more food and drinks but to be so overtly rude about it after we said no multiple times was really uncomfortable for us and disappointing. And in fact, it was not busy, they had reservations open all night and, consequently, many open tables). Again, food and environment is great but watch out for the waiter who gets angry at you for not ordering everything on the menu.", "pics": null}}, {"review": {"des": "So. Very. Good. Favorite Italian restaurant in Chicago. The service, food, ambience, drinks are all perfect. Wish I could replicate it to every other major city.", "pics": null}}, {"review": {"des": "I absolutely loved everything about this restaurant. Perfect combination of upscale and classy without being pretentious or stuffy. Beautiful decor (was recently remodeled). Our server (I don't recall his name) was friendly, personable, and attentive without being over-bearing. And the food was excellent. We were greeted with a Prosecco toast, and it was the best Prosecco I have ever had--light and perfum-y. My husband and I both ordered pasta dishes. Wow, what a difference it is to taste fresh, homemade pasta! Perfect balance between noodles and sauce (unlike other Italian restaurants that bury sub-par noodles under an ocean of bland, generic red sauce). Flavorful but not over-powering. Well worth the price. Ended with a delicious combination of flourless chocolate cake and caramel gelato. HIGHLY recommended for a special occasion or any time you are looking to indulge in an exquisite meal in a beautiful atmosphere.", "pics": null}}, {"review": {"des": "I have nothing but open-mouthed admiration for this place. I've been here before for the best Italian I've ever had in the city and so thought it would be the perfect place for a leather and lace themed birthday celebration, given the lavish décor.<br><br>I plan early, and so called in to reserve a table for 18 girls. The restaurant isn't huge so I wanted to make sure they'd have room. Without any judgment, Jennifer Shoop helped me through the reservation process. I got to pick a limited menu to help out the kitchen for such a large party- I felt like I was planning a wedding menu. With help from my friends and yelp, I chose what I thought was a perfect selection of appetizers, entrees, and desserts for a three course menu. I even got to name the menu so I called it the Italian translation for leather and lace.<br><br>I was concerned about where we would be seated, thinking it might have to be two tables, and not wanting my friends to be too far apart. Jennifer assured me it would be fabulous and she was right. We were brought down to the wine cellar, a room I had no idea even existed. It was the most beautiful room I have ever seen. Elaborate carpet and wallpaper, velvet swag hanging from the ceiling, and cushioned seating both around the candlelit table and the lounge chairs around for some mingling before dinner. If I ever have an engagement party or another fancy birthday, I will not hesitate to book this room again. <br><br>I don't think I even have to discuss the quality of the food, because that is a given. The lobster and avocado salad was amazing, the salmon was perfectly cooked and delicious, and each of our three desserts melted in my mouth- tiramisu, ricotta cheesecake, and chocolate cake. Service was wonderful and everything went smoothly. My friends were also thoroughly impressed and we all had a great time. I couldn't be happier.", "pics": null}}, {"review": {"des": "From the atmosphere to dinner, Prosecco was great! At the beginning of the meal, our server greeted us and gave everyone a taste of prosecco to make a toast with. We actually ended up buying a bottle of the prosecco given which was the Prosecco di Veneto Doc. A good neutral prosecco that was neither too sweet or too dry. <br><br>The pictures are of my meal which was the burrata e prosciutto con pomodori secchi as an appetizer and the salmone con lenticchie e spinaci as a main entree. The burrata e prosciutto con pomodori secchi was absolutely delicious. The mozzarella was VERY creamy and thick. Paired with the acidity from the balsamic reduction and cured tomatoes and the saltiness from the prosciutto, the dish was very balanced and I will dream about it until I come back to Chicago for more. The salmone con lenticchie e spinaci was cooked perfect to medium as I requested. Very buttery and scrumptious. The lentils were a nice texture compliment to the buttery fish. Not overly seasoned. My only critique is the lack of baby spinach in the dish. I was expecting a normal vegetable side portion and it ended up being around 4 pieces of cooked spinach. <br>I also had the house-made gelato (not pictured)which tasted like a bowl of cinnamon toast crunch cereal with whole milk.<br><br>The items that my friends had:<br>-Affettati Misti: typical meat and cheese platter except the quality of the cheese was phenomenal.<br>-Gnocchi al Gorgonzola: If you love gnocchi, get this for sure. The gnocchi was perfectly cooked, with a beautiful harmony of buttery, cheesy goodness and toasted walnuts that give you the crunch component that your mouth will be looking for.<br>-Zuppa Di Pesce: probably my least favorite thing out of everything we ordered. Seafood was slightly overcooked and higher salt level.<br>-Melanzane Griglia e Forno: I personally did not try this dish, but my friend who did ate it all VERY quickly. Safe to say she loved it.<br>- Tiramisu: **note: we ordered torta di cioccolato but were given the tiramisu. After failed attempts to get our server, we just ate the tiramisu. In the end it worked out because we loved it. Far better than the gelato I ordered. <br><br>Service: Service wasn't terrible but it wasn't the greatest service I had. The individual who was refilling waters was more attentive than our actual server. I rarely ever tip under 20% but we did tip our server less for these reasons. <br>-If you order a bottle, they keep it at the bar for you instead of your table which is fine. But the lack of checking in on our table left glasses empty for a while and some glasses being filled while ignoring other's low level glasses. <br>-The server's attitude wasn't the nicest. As if being in a group of younger adults made it seem like we couldn't afford to eat there. <br>-Lastly, she couldn't split the check. She said the system didn't allow splitting individual items as in 1/2 to one and 1/2 another which is absolutely fine. We didn't need to split items, just the dinner menu. Instead of understanding us, she gave us the check with a pen to calculate amounts ourselves. I wouldn't have really cared if she was more understanding about it instead of coming off as being extremely rude.<br><br>That aside, the food was very good and worth a try!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/jgCKODikJtL0vSAE-UjZ2Q/168s.jpg", "caption": "salmone con lenticchie e spinaci"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/yWO0F-ZY0P8KL-gxZol7fA/168s.jpg", "caption": "burrata e prosciutto con pomodori secchi"}]}}, {"review": {"des": "Came here around 9pm Saturday for a friend's bachelorette party dinner as a group of 10 ladies. We were seated promptly and the place was quite nice and elegant. It was only a quarter occupied when we went.<br><br>It took awhile before we all had our complimentary glass of Prosecco, which worried me as this was one of the main reasons I suggested the place. We did receive it and made a nice toast to the bride to be.<br><br>They were well staffed in numbers, as we saw many staff people walk around, but I guess quality is so-so. We all read the menus to death and our waiter comes over and lets us know that we must order as their kitchen will be closing soon. Well, we let him know that we've been ready, but was never asked in this rather long period of time. Some of the girls ordered drinks first and were still waiting on them, while some others got theirs, so it was all inconsistent. I was just put off that they made it seem like we were just taking our time when they were the ones not executing proper service. Our waiter was nice enough, just clearly not outstanding.<br><br>All of our food did come out an appropriate time. I get the special risotto that had prosciutto in it. It was yummy and was pleased to see decent satisfying portions for a more upscale place. Friend's lamb chops were good as well. While food was all quite good, it did not knock my socks off.<br><br>Waters were never refilled and I had to ask about it towards the end. We were able to pay with multiple cards and they executed that well so that was relieving...this should be the case for any place, but it's sad that I almost want to give them a plus because of it.<br><br>Overall, place was good, but was expecting more from this high-end Italian place. There are definitely better experiences to be had. The complimentary Prosecco is a nice touch though.", "pics": null}}, {"review": {"des": "Went this past Friday for a quick after-work dinner and was able to get an early reservation for 2 pretty easily.  The greeting was warm and very gracious and the restaurant overall is beautiful with low lighting and long cozy bar.  I can easily see meeting up for a glass of wine in the future if not in the mood for a full dining experience. <br>Once seated, we ordered a bottle of chianti, had the meatball to start with Orecchiette Tartufute and a wonderful Wild Boar Pappardelle for mains....all were very tasty.  Interestingly, we were very excited about the Orecchiette Tartufute based on the reviews but it was the Wild Boar Pappadelle that was the favorite - mouth watering!!   I would absolutely order any three in the future.  Great service overall - we had \"V\" (short for something my American English can't pronounce) and he was entertaining and engaging.  All runners, bussers, etc were on top it; keeping things clean and nice.  Overall, we were very well taken care of and it was a very relaxing way to end a long work week.  <br>Just two quick notes, the greeting of presecco is a fun gesture but it's seriously like a shot.  I wonder if they should do it at all if it feels so \"meh/shug\".  Second is a personal plea to Chef.....please, please, please step up your bread game.  We really were expecting some amazing crusty warm soft bread (we'd been talking about wine and bread all day!)....it really was a couple of very average skinny slices of bread similar to what you would get in a cafeteria.  Sorry - no offense really...but for such a beautiful restaurant serving such delicious pasta we were surprised by what was in the bread basket.  To end on a positive note, if you've not been and really want an honest to god delectable Italian pasta you need to visit.  I know I'll be back!", "pics": null}}, {"review": {"des": "A phenomenal dining experience! Great service and great food! I had the caprese salad and the Orecchiette Tartufate accompanied with a few glasses of the house Prosecco and a Limoncello shot. Can't wait to go back again.", "pics": null}}, {"review": {"des": "A toss up between a 3 and a 4 but overall a good Italian restaurant with good service and tasty food. <br><br>Interior is romantic with a skylight towards the backroom for natural lighting. They also had some private spaces that looked very elegant and intimate though we weren't sitting there. <br><br>Food was pretty tasty and we liked all the dishes that we got (see accompanying pictures). <br><br>Dessert - they didn't have an affogatto on the menu (ice cream/gelato w a shot of espresso) but kindly made one for us when we requested one.<br><br>Service - for some reason it felt like it took awhile for them to get us anything drink related. Our wine came out at almost the same time as the food. And we waited awhile for the affogatto but other than no major complaints!<br><br>They have outdoor seating and the restaurant is close to the bustling streets of River north but not in the midst. So if you want something a little off the crazy busy paths of river north, this is a nice pick.", "pics": null}}, {"review": {"des": "Amazing food, and the staff are very knowledgeable about their menu and wines. Never had anything less than an exceptional meal here.", "pics": null}}, {"review": {"des": "mazing dinner! Service was outstanding from the minute we walked into the restaurant to the moment we left. I do wish we had a place like this in Houston!! Don't get me wrong, Houston has amazing food! We felt like royalty the moment we arrived!!! This is a must for those living/visiting Chicago.", "pics": null}}, {"review": {"des": "Prosecco italian restaurant is a small warm intimate venue, very private; you can eat here without being disturbed by noise, a jet setting crowd, or intrusive staff members; however the service and food are not very good and leave you with a feeling of disappointment.  <br><br>As for our experience, we (my husband and I) like to enjoy long, slow lunches over a nice bottle of wine.  We arrived off our international flight hungry and we began an Internet search for a good Italian restaurant open for lunch in Chicago.  Presecco's menu and wine list sounded good and we liked the images of the dining room (elegant and intimate).<br><br>We were one of only two tables at the time of our lunch on November 18, 2015. Yet, we were offered a small table with two chairs away from the window.  It was not a good table and it was too small for the lunch we planned to eat and the wine my husband intended to order.  The choice of table for us was a bit perplexing.  Our table was changed on my husband's request to the window table with four chairs but he should not have had to ask them to do that given the entire restaurant (with the exception of one table) was empty, and it was 2:30 pm in the afternoon at the end of their lunch service.<br><br>Despite the rather cold and flat reception that we received upon our arrival to the restaurant we were happy with our new table and hungry.  My husband proceeded to order an expensive bottle of wine which took an inordinate and unreasonable amount of time to reach our table, our waiter then proceeded to delay taking our order; served our food in a painfully slow manner; neglected to keep our wine glasses filled and left us sitting for most of our lunch waiting for more wine and fighting stabbing hunger pains.  At the same time he hovered and doted shamelessly and continuously over the table next to us (the only other diners in the restaurant), who from a quick assessment did not appear to warrant the imbalanced attention.  <br><br>When our food finally arrived, it was grossly underwhelming; our cavatelli pasta with sausage and rapini had one piece of rapini and 1/2 a sausage link in the entire dish; and the eggplant parmesan tasted like pure salt with burned cheese covering mushy eggplant; while the grilled octopus was smothered and drowning in balsamic vinegar.  If it was not for my handsome and fun husband and the delicious bottle of Ornellia that we shared, it would have been a rather dismal lunch.", "pics": null}}, {"review": {"des": "I was pleasantly surprised with my meal here, having entered with misconceptions that this would be decent but ordinary Italian fare. We went on a very cold evening, as it was steps away from home and we were with my bf's Mom, who isn't great with the sub-20 temperatures. We were able to get reservations for 3 on a Friday night a few days in advance.  <br><br>Immediately, I felt welcomed by the friendly hostess and coat-check attendant, and whisked into the comfortable and warm back room of the restaurant. We were treated to a complimentary glass of the restaurant's namesake sparkling beverage, and we learned about the specials for that evening, of which there were many.  <br><br>We split a caprese salad (special) that was nothing special, but perfectly done in its simplicity.  My bf got a steak (special) that he raved about, and his Mom had a sautéed fish (also on special, but I think it might have been tilapia)? They prepared it without salt according to her wishes, but it was still wonderfully seared to a nice crust and had great flavor.  I had a couple of tastes and it was my favorite item of the evening (and I am typically underwhelmed by white fish).  <br><br>I asked the waitress for pasta recommendations, and opted for the special over the frutti de mare on the menu. I honestly can't recall what I had (!!), but recall finding it pretty tasty, if (apparently) unmemorable. <br><br>Prices were not out of the ordinary given the portion size, ingredient quality, and restaurant location, but I'd say this is more of a semi-special occasion place than a random spot to stop on a Tuesday night.  That said, I do look forward to going back, perhaps in the summer.", "pics": null}}, {"review": {"des": "My sister and I had the worst service ever here. We showed up close to closing time but no one was there to greet us or let us know so we just sat down at the bar. The server at the bar was cool about it and served us a glass of Proseco which was fine. Then the manger came over and told us off for coming in. We apologized and paid and quickly left. She made it seem like we snuck in, like some hooligans, off the street. We legit didn't know. Plus there were ppl there drinking at the bar and they weren't told to get the hell out. So shitty. <br><br>If you're a snob and like snobby service then you'll love this place.", "pics": null}}, {"review": {"des": "Last visit during December. And on a weekend was very poor. The food<br>Was not impressive, and most of all the waiter Christian poured a cocktail<br>With an expernsive tequila  which was $64.00..... I was with 2 VIP guests<br>So I did not say anything...this experience was opposite of last visit and<br><br>We will not be returning. We were also asked to leave the table because <br>Another ostentatious party requested the table at the window!!!! The manager/owner and hostess were very rude...the place is not that great<br>And there are far more superior restaurants in the area. We will not be returning and I will be telling my associates not yo house either!!!! The waiter did offer us a dessert to take home......", "pics": null}}, {"review": {"des": "Beautiful intimate atmosphere with the most attentive and down to earth staff. The food is exquisite and melts in your mouth. Hands down one of my favorites in Chicago.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/AHFylZIq4WVR4B0MZlL6pQ/348s.jpg", "caption": "ORECCHIETTE TARTUFATE -  wild mushroom, asparagus, sun-dried tomato, black truffle cream, shaved Grana Padano, white truffle oil"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/UNgxZAjaOC1Ha8bTiJPpSA/168s.jpg", "caption": "Papperdelle with wild boar and mushrooms in a tomato sauce"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/S2Iplh1L7Vf9hCrNqhyGpw/168s.jpg", "caption": "GRANCHIO e RISO - Risotto crab cakes, roasted red pepper aioli"}]}}, {"review": {"des": "Have you ever walked out of a restaurant so disappointed you were actually mad? One star is pretty harsh, but for a $120+ dinner where most of the food was inedible, it seems to fit. <br><br>I picked this place because of the overwhelmingly positive reviews on Yelp, but either they've had some major changes here (new chef?) recently or a seriously off night. <br><br>We were sat in an almost empty room which filled to about half full while we were there. Our server introduced himself as \"Ricardo\" but the name on the check was \"Jose\". He wasn't actually around for most of the meal anyway. There was a nice student from El Salvador who actually brought and cleared all our food, but unfortunately he wasn't able to answer any questions or actually resolve any issues. <br><br>We wanted to share multiple items so ordered four in total: a salad, a special appetizer with burrata and nectarines, a gnocchi dish and a risotto dish. The salad came first and was OK--some interesting ingredients (strips of beet, shaved fennel), but nothing exceptional. The burrata wasn't as creamy as I was expecting--more like regular mozzarella and about 1/3 of the nectarines served with it were overripe to the point of being rotten (should never have put on the plate). The dish was also missing an entire component--the sauce. <br><br>The pasta dishes however, made us really regret our choice. The risotto was Kraft mac & cheese yellow and had the consistency of Elmer's glue. It was overly salted, yet lacking in any other flavor, and the accompanying shrimp were cooked to a rubbery toughness. The gnocchi was completely inedible. They actually bore no resemblance to any gnocchi I've ever seen before--small, brown glutinous plugs of dough spread over a plate with an overly rich and one-note gorgonzola sauce. I took one bite and couldn't bring myself to take another. We sent the gnocchi back because it was so blatantly inedible and only ate about 1/4 of the risotto each. Both dishes seemed like they had been sitting for a good amount of time before they were delivered. <br><br>No manager or chef came over to talk to us and the absentee server only showed up again to try and sell us dessert. We passed. <br><br>So, we walked out of there $120 poorer (which included a bottle of their least expensive, house Prosecco at around $40) and with the least satisfying \"fine dining\" Italian meal I've ever had sitting heavily in our stomachs.", "pics": null}}, {"review": {"des": "Although I had heard of Prosecco, it never really caught my eye based on what I had seen online. But I was definitely proven wrong! I was here for my birthday and had a wonderful time. We had a reservation, and were seated right away. Our server was very knowledgeable in regards to the wine selection. He suggested the perfect wine after finding out what we preferred in a drink,which was great. I ordered the Spaghetti ai Frutti di Mare, which was a variety of fresh seafood on a bed of pasta. Although I'm picky when it comes to the quality of seafood, it was divine. And the portion size was perfect.<br><br>The noise level is average, but still nice to have a conversation with the person you're dining with. The restaurant definitely has a romantic air to it,so I recommend it for a special occasion,(especially if you're looking for an affordable place). The only thing I didn't enjoy was a a nosy old man who was seated next to me,as he kept looking over at our table every 10 seconds! Lol. <br><br>I will definitely be coming back.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/sW-ILZIPYM-7SY2qu-ga5g/348s.jpg", "caption": "Birthday Dinner."}]}}, {"review": {"des": "This is really 3.5 but rounding up cause I thought the service was very solid.  I thought the decor was very inviting and old school.  The wine list is all Italian wines so if you're not great with Italian I would suggest asking for advice.  Our server was very attentive.  The bread came out warm, which I  love.  All of their pasta can be ordered in a half order as well.  <br><br>There were four of us and we were trying to do some sharing so we started with the burrata.  I absolutely love burrata and this one did not disappoint.  It was served with some lovely tomatoes and basil like a Caprese salad.  We had the papperdelle, which was very tasty although the level of boar was lacking.  The ratio of pasta to boar should have been lower but very tasty.  We also got a special risotto which was solid.  It was beef tenderloin.  They had a special fish which was a Corvina, which I had never had before.  I thought this was wonderful.  Overall the food was above average but didn't blow me away but the ambiance and service was 5 stars.", "pics": null}}, {"review": {"des": "I appreciate the gratis shot sized sample of Prosecco. It's a nice touch and different from other establishments. However...the friend I was treating for her Birthday doesn't drink alcoholic beverages whatsoever. Not a swig, not a sip, nada. From that moment forward, my friend was self conscious by our waiters initial over exuberant interest in serving us (alcohol), to his noticeably stoic distaste and not-too subtle annoyance with us for not ordering beverages. OMG, it's Friday around 6 p.m. and plainly obvious that our waiter has checked out emotionally from our table and can't wait for us to exit. Not cool! Furthermore, it's terribly unnerving to spend over 100 bucks for 2, when service is rushed and subpar. <br><br>I'm completely sympathetic to a waitperson's zest for a substantial tip and I appreciate hard work and sheer motivation until that person allows greed to overpower American and European etiquette. I'd have difficulty giving 1 star If it were not for the delicious meal we enjoyed. A Burrata antipasti, gnocchi gorgonzola, scallops w/ spinach and vanilla reduction (outstanding, except a tiny serving of 4/$25.00); double pork chop w/ red pepper sauce and onion mashed potatoes - very tasty and enough for 3 hungry diners at 24.00. The flourless choc cake and tiramisu was a nice ending to the meal. <br><br>All in all, the gauche overzealousness of our waiter was a complete turnoff towards Ristorante Prosecco. Buyer beware. Although I tipped him 22% and didn't skimp on  ordering 6 of their more pricey food items, I can't get over rudeness. Lord knows that not everyone drinks alcohol and there are those that definitely shouldn't. Considering this and other restaurants are clueless to diners medical, religious, designated driver decisions, etc., it's totally ignorant to assume everyone who dines there is at least 21 and wants to drink while dining at Prosecco. <br><br>It's absurd that a waiter can spoil a meal, but that's precisely what ours did. That, my dears, is tacky!", "pics": null}}, {"review": {"des": "I've been remiss. For years. Please forgive me. Prosecco is a magical place that whisks you away into a place that mimics and feels like you are in Italy. From the candlelit ambiance, to the gorgeous mirrored decor, Prosecco will take you to a place that you yearn for after a long day. The menu is varied and will fulfill every need - whether it is wanting pasta from old work Italy, to the freshest of prepared coastal fish, Prosecco delivers on all cylinders. Be sure to meet Brian behind the bar, he is not only attentive to your needs, but he's vast in his knowledge with what pairs well with your meals - all with a smile. If you haven't been folks, it's time.", "pics": null}}, {"review": {"des": "This is an almost perfect Italian place. It has mouth watering food, the great Italian service, great wine selection-recommendation. The server recommends well. They have spicy italian (didnt know italian could be spicy) food which is very suited to our palette.  <br><br>Eventhough we like the place we are one star away from loving it - one reason is our server forgot to pass one of our food order and he seemed ok about it, saying good you seem to be full anyway . Another reason is we are still to find any memorable dish, a dish which has blown us away.<br><br>May be next time the rating will be 5 but for now its 4.", "pics": null}}, {"review": {"des": "Four gals enjoyed a nice lunch during the first day of restaurant week. We had the first reservation at 11:30 AM and of course no one else was there when we arrived. The decor does remind one of the European dining establishment. It has soothing looks and high ceilings but it still did not seem loud even as we were leaving and there was more of a crowd.<br><br>They serve about a shot's worth of Prosecco when you first arrive to wet your whistle and tease you. It's a nice touch we were not expecting. The warm bread offered gratis was good enough however it needed a little salt or a little more crunch - it was lacking a certain something. The small diced vegetable medley that was served with it was nice and was probably a caponata although it lacked eggplant flavor and we cannot be sure exactly what it was since no one described it to us.<br><br>The offerings for restaurant week are about five dollar value versus purchasing off of the à la carte menu.  The crab and risotto cakes were moist insside with a little crispness and quite small - if I had paid $10 for them I would not have been happy.<br><br>The $10 lobster and avocado salad was served in the avocado shell and had a very tasty avocado oil dressing and was a good value for the portion size.<br><br>The Pollo Valdostana was good but also needed something, maybe a little salt or little more sweetness or a little better quality prosciutto. It was however a very nice size portion which we were expecting to be cut down in size for restaurant week.<br><br>The mashed potatoes served with the chicken were very light and fluffy although once again I have to say it was lacking a little bit of flavor. <br><br>One of us in the group ordered the truffle orrechietti and they were definitely laden with truffle flavor. Avoid that dish if you're on the fence about truffles. you get hit over the head with that flavor!<br><br>The dessert portions were also quite generous. The tiramisu was easily 4 x 5\" or larger. The gelato was a banana fudge version and it was disappointing that we could not choose from other gelato options that they had available especially because the restaurant week menu just said gelato and did not specify a particular flavor.<br><br>The espresso and cappuccino's are a little strangely priced. A single shot of espresso is three dollars and a large cappuccino is four.  The espresso I requested was a ristretto and although it had very good flavor the cup was not warm and therefore the coffee was not hot enough.<br><br>Because of all of these minor details and the missing flavor elements I could not give it four stars but I would give it a solid 3 1/2 if I could. We may return and try other options a la carte.", "pics": null}}, {"review": {"des": "Can you guess my favorite drink? It's prosecco. So coming here was just all too fitting. Stopped in last night what was only supposed to be one glass with a friend but after seeing everyone's plates, I had to try dinner! Let me tell you, I did not regret a single bite. I ordered the scallops which were perfectly made. A few glasses of their different prosecco and had the company of an amazing bartender. He was attentive, funny and helpful. I ordered dinner a little late and instead of saying no the kitchen is closed, he went back to ask the chef if he'd make an exception. He did not need to do that, but I'm happy he did! The place is intimate and feels very Italian, which it is. Finally, we were leaving with happy tastebuds and the chef caught us on our way out to ask how my scallops were, and introduced himself. That is service you don't see very often in Chicago lately. Absolutely loved everything, I'll be back soon!", "pics": null}}, {"review": {"des": "Summary: NOT WORTH IT!!! <br>*Read further for more info, or just keep looking for another restaurant! <br><br>I can only think of three positives to my experience here. <br>1- Our server was great! Five stars to him! <br>2- The avocado \"salad\" was bursting with flavor! $12 or 14 for half an avocado filled with yumminess. Pricey, but worth the flavor. <br>3- Apple dessert. <br><br>The rest of my not so good experience...<br>Pricing- $150 ish for two people. If the food was amazing, ok, but it wasn't! <br><br>It took 2.5 hours to be finished with dinner and dessert! We waited for our avocado salad forever! Then we waited for dinner! <br><br>I ordered the tuna. About 30 minutes in, we were told the chef decided to stop making it for the night because it wasn't up to par. What!? You didn't know this 30 minutes ago!!!?  Not waiting. <br><br>The salmon, which I included a picture of, was horribly bland and not filling! A huge fail! <br><br>The pork chop, which they recommended butterfly cut or it would have taken 30 minutes longer, was just ok. The sauce was flavorful, but nothing about it made me say wow. It was basically drowned in the sauce. So the meat and potatoes were just a soggy mess when served. Plating/Presentation=horrible <br><br>The flour less chocolate cake was mediocre. There was an apple something dessert that was actually very flavorful. It had some orange zest and flavors that added some punch.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/5JBjG-4ACH4g5ntkEK4TtA/348s.jpg", "caption": "Avocado \"salad\". Pricey, but LOADED with flavor. Best part of the meal!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/DPsHEkPipG_mVNhE5SA-KA/168s.jpg", "caption": "Butterflied Pork Chop- Bland except for the sauce. Unremarkable"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/sH5N9qx2YTuxg_S7yq0SAg/168s.jpg", "caption": "Salmon-the most tasteless, bland & boring salmon ever! DO NOT order it! We had to ask for lemon & salt to make it edible."}]}}, {"review": {"des": "We promised to return here to have dinner after having an unexpectedly great experience on New Year's Eve when we stopped in for just a drink.  This is one of our new favorites in Chicago.  Here's why:<br><br>We were greeted with a glass of Prosecco when we were seated.  The menu is one of those that you can't narrow down a choice and need to come back. I had the buratta,  pappardelle with wild boar, and the veal, all of which were fantastic.<br><br>The service was spot on - knowing exactly when to reappear to take a drink order, fill water, check in with us without being obstrusive.  The restaurant is well-staffed and every server we interacted with was great.<br><br>The dining room is set up to feel like you are in a tuscan residential (albeit oversized) kitchen with an open window to the actual kitchen, and a countertop with cabinets along one wall.  Clever.<br><br>Be sure to get a glass of the house made limoncello.  Delicious!", "pics": null}}, {"review": {"des": "My 2 MOHs chose to host my bridal shower at Prosecco. I am so glad they did!!! Spectacular is the only word that can describe the whole experience!! Ambiance, service, food, accommodation to our needs, valet, every single aspect... The owner Stefania herself oversaw the whole process. We had close to 50 women at the shower. With a big family there have been many showers in the past, but no one talked about it for weeks after the event. It was definitely the best bridal shower I've ever been to, but more importantly we heard from so many people later how much they loved the food, drinks and how beautiful the venue was. The photographer we used who's been in business for over 20 years said it was the most beautiful shower he has ever been to.", "pics": null}}, {"review": {"des": "This should really be 3.5...<br><br>I had heard about this place from several friends and decided to give it a try with a friend who was visiting from out of town.  It was a great experience, but it missed the mark in getting 5 stars and from becoming one of my favorite Italian places in the city.<br><br>First, the bad...we had made reservations on Thursday night for Saturday night.  We arrived on Saturday and someone had made a mistake in entering the reservation, as it had been placed in their system for Friday night.  The hostess was quite rude about accommodating us on Saturday, but was still able to do so within a few minutes.  We expressed our gratitude at the time and again at the end of our meal on the way out.  The hostess could not have handled the situation more inappropriately.  She said that it messed up everything for the whole night because they made accommodations for us.  She also made the most awful face at us.  So incredibly rude and unprofessional!  She is the reason I cannot give this place a 5.  The hostess is the face of the restaurant and she was a poor representation of the establishment.<br><br>Now, the good...the food was AMAZING!  The pour of prosecco when you're first seated is a nice touch.  The servers were incredibly attentive and personable.  There were two gentlemen (Sam was great!) who offered us recommendations and explained menu items.  The portions were decent and were well seasoned.  We started with the Carpaccio di Manzo.  Delicious!  I then had the shrimp risotto.  My friend ordered the Rigatoni Norcina.  It was cooked perfectly al dente.  We finished with limoncello.  Perfect finish!  <br><br>The atmosphere is perfect for a date night or for a night out with friends and family.  I'd recommend it.", "pics": null}}, {"review": {"des": "Went here as a late decision on a Friday night, got reservations on Open Table and sat outside on a beautiful day. The food was fantastic between the burrata, the tomato/truffle soup and all three pasta dishes we tried, the food was worth the visit alone. However, I wanted to write a review about our experience taking my 3 year old daughter and the 10 week old daughter of one of my friends. Not only was Ana our waitress accommodating, she interacted with my daughter, talked with her, and made her feel so special.  It didn't stop there, the sommelier, Sam, was very informative, giving us a brief review of Italian white wine and choosing a beautiful bottle to go with our meals. He also, recommended the orange juice for my daughter and even offered his phone for her to play with if she was getting bored of sitting there with her parents. Taking children to nice restaurants isn't always easy but Prosecco stepped up and showed their amazing hospitality to all of us. Thank you!", "pics": null}}, {"review": {"des": "This is the best Italian food in the downtown Chicago area. The service is exceptional and the restaurant ambiance is very delicate. They will cater to any occasion and make sure every meal is special. I have never been disappointed with the food I have ordered here and I will continue to go back as well as recommend to any friend or family member that stops by in the city.", "pics": null}}, {"review": {"des": "Had an excellent meal here for dinner last week. We actually went on a Tuesday night where they do half price wine. Our waiter knew everything about wine and recommended the perfect bottle. Food was delicious and service was fantastic. <br><br>Will definitely be going back to this spot soon!", "pics": null}}, {"review": {"des": "This may be my new favorite restaurant, the European ambiance, the service, the food, the free glass of Prosecco to start your evening with a toast....what more could you ask for? I went with a party of three and we started with the burrata and prosciutto dish and crab cakes. For our main dishes we had the zuppa di pesce, the scallops, and the orecchiette tartufate...all were delicious. We had a tough time choosing because so many dishes looked interesting and delish, I have no doubt they are and will be back to try them! The ambiance, again, was so warm and inviting, good crowd, not to crowded but a good fun vibe going on. I think it would be great for a big group & at the same time could be a great romantic date night destination as well. We finished with the tiramisu which was good but I was so full I only had one bite. Most def check this place out!!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/TqOzd2z6xr_i-XPHedBodw/348s.jpg", "caption": "Scallops...delish!!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/fSDxdhKggYrhhXRlVcnkVQ/168s.jpg", "caption": "My Aunt loved this place you can kind of get an idea of the warm lighting. The place is beautiful."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/O-fnzcVMVFz1dmWFcFfgGQ/168s.jpg", "caption": "Orecchiette Tartufate"}]}}, {"review": {"des": "My boyfriend and I ate here last week to try it -- it wasn't worth the crazy prices on the food. <br><br>I felt like I paid $80 to eat average Italian food. The restaurant very much mimics an American Italian, faux luxury restaurant. It has curtains, paintings, nice tables and the works, but the food quality is seriously lacking, which is really unfortunate.<br><br>We will not be going back there, and I wouldn't recommend it.", "pics": null}}, {"review": {"des": "Went here for a birthday dinner expecting to be a cute Italian date spot and it was surprisingly fancier and romantic and I loved it! The part that was really a surprise is that for how fancy and nice it was, it was definitely reasonably priced.<br><br>First they greet you with a complimentary half glass of champagne. We ordered the charcuterie plate (Affettati Misti) and some cocktails to start and it was delicious.  We ordered the truffle pasta (Orecchiette Tartufate) and the rack of lamb (Costoletta D' Agnello) for the meal. Now here is the only reason I docked this place one star. I am a huge meat person and can definitely tell when the meat has been under seasoned. The lamb was recommended as one of their dishes they are known for so I had some high expectations and unfortunately seemed just short a sprinkle of salt and was not crusted as well. But to be fair, literally just a slight shake of the salt on it made all the difference...still delicious. The truffle pasta = AMAZING!! This is also another dish they are known for and I would order this again all day everyday. I found it to be more lovable than the chops (same as my boyfriend who also loves his meat). For desserts, we orders the pistachio gelato and the tiramisu...can't go wrong with either. We had noted on the reservation that it was a birthday dinner and they brought out a candle on the dessert...simple touch but was nice they actually paid attention to it.<br><br>Overall it was definitely a worth it experience. Next time I go I may give the lamb another chance on that maybe it was just a one time thing. I may mention that it came slightly underseasoned and not well crusted last time I was here, but I may not.  Either way, should give this place a shot!!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/G_nhG-br7SYSfIc06DFJPg/348s.jpg", "caption": "Rack of lamb"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/WoPnkgOvDOhEDDfrdvq3vg/168s.jpg", "caption": "Truffle pasta"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/7HN6gKZRilTgFDinS0Zung/168s.jpg", "caption": "Charcuterie plate"}]}}, {"review": {"des": "Really great service, nice ambiance, good food and drinks!<br><br>I had the orecchiette pasta in truffle oil and enjoyed it. Their tiramisu was really good too!", "pics": null}}, {"review": {"des": "Went here for a work related dinner and wow - did it impress!  Not only were the others in my party impressed, but I was as well.  From the ambiance to the food - all was really a wonderful treat.<br><br>They start everyone off with a complementary \"Toast of Prosecco\" which was a nice treat and set a really elegant tone for the rest of the evening.  <br><br>We started off trying some of the unique cocktails from their cocktail menu in an effort to get away from what we all usually get.  I went for the \"Vespa (see pic #29) which is made of Absolute Citron Vodka, Rangpur Gin, Lillet Blanc and Chamomile Honey. Its server super chilled so there's almost a thin layer of ice on the top when served.  Yummy.  If my memory servers me right, I had 2 of these (but who knows...lol)<br><br>Next was a struggle to select just ONE of the many fantastic sounding appetizers.  Again, trying to go with something unique I went with the Lumache alla Romano.  What's that, you ask?  Well check out picture #30 but I'll tell you - it's jumbo snails (maybe not so 'jumbo' but definitely good sized!), prosciutto di parma, vecchia ramagna brandy and a garlic cream reduction.  Everything was balanced really well - nothing over powering and so delicious.<br><br>When it came time to select a single entree because again, too many that sounded wonderful to have to only choose just one, the waiter kindly suggested getting an extra entree to share as a separate course between the appetizer and mains.  Well yea! Now we're talkin'!  <br><br>So for our mid-course, we all went with one of their signature dishes which is the Orecchiette Tartufate (pic #31).  This consists of orecchiette with wild mushrooms, asparagus, sun-dried tomatoes, black truffle cream (kill me now...), shaved grana padano and of course, drizzled with white truffle oil.  Again, expertly balanced so no one item overpowered the rest of the dish.  Really REALLY good!<br><br>Finally, after much discussion and deep, DEEP, contemplation, I settled on my main dish which was the Capesante fon Prosecco e Vaniglia (pic #32).  At this point, I'm going with anything that has the word \"Prosecco\" in it because not only do I enjoy Prosecco, it's gotta be special and so far everything has been fantastic so doubtful this would be a bad choice. I was 100% correct - this dish was 4 large, diver-caught scallops, spinach, shitake mushroom, diced Roma tomatoes and severed with a vanilla & Prosecco reduction.  The vanilla gave the sauce a slight sweet taste to it that actually worked well.  The scallops were perfectly seared. Oh my god I've made myself hungry again...lol<br><br>After all of that, we did peek at the dessert menu which if you are into desserts (which usually I'm not) did look like a nice selection and from the few I saw passing by to other tables, looked delicious as well.  However, after the meal - and maybe a few cocktails - I was completely satisfied and opted out of the dessert.<br><br>Even with all the drinks and the mid-course entree, the bill was surprisingly reasonable for  4 people.  And most importantly, worth every penny.  When you get excellent service (which was appropriate in terms of checking, but not intrusive in any way), beautiful venue and high quality food that was well prepared, you don't mind paying for it because it's worth it.<br><br>I'm not one to normally give out 5 stars, but I really couldn't find anything wrong with this place or even slightly \"off\" so I'm going with 5 and I believe it's well deserved.  A great place to go for any reason from a business function to a romantic 1:1 evening.  You will not be disappointed!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/D4s0E57WV9ZGu4hXv76gKg/348s.jpg", "caption": "Main area"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Fnc5L6QEhjjbyIqrY19Q3w/168s.jpg", "caption": "Capesante con Prosecco e Vaniglia (Diver scallops, spinach, shitake mush, diced Roma tomatoes, vanilla & Prosecco reduction)"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/zKpPaM4B4S8nO9iRxrQPsw/168s.jpg", "caption": "Orecchiette Tartufate (With wild mush, asparagus, sun-dried tomatoes, blck truffle cream, shaved grana padano, truffle oil)"}]}}, {"review": {"des": "Anyone who knows me can say I am not biggest fan of Italian food but when I do taste good food I get excited.<br><br>One thing I had here that was really delicious was the avocado appetizer. We  all ordered it and it did not disappoint. I make something similar at home all the time (but just using salt and balsamic vinegar). The one here is def fancier.<br><br>They also give a glass of Prosecco to toast. <br>For a meal I had the Orecchiette Tartufate which appeared to be a crowd favorite. I enjoyed that as well. <br>My drink was Vespa. I am pretty lightweight with drinks but this def put me under after a few sips.<br><br>I would recommend and like to try again when I return to Chicago.", "pics": null}}, {"review": {"des": "I was excited to try this place from all the raving reviews.  My cousin and I came here for an early dinner.  Our server seemed very attentive, and our water glasses were never empty.  The toasted bread slices came with this chunky tomato salsa-type of spread, which was a bit too sweet.  We started out with their Polpetti e Calamari Grigliati - it was a small dish of grilled baby octopus, calamari, fingerling potatoes (that were extremely small), string beans (more on the raw side), chunks of tomato, all in a balsamic and sweet pepper sauce.    The dish itself was okay, but I wasn't a fan as it was way too sweet and more tomato-based. My cousin had the Orechheitte Tartufate, the restaurant's signature dish, and I had their Gnochhi ai Gorgonzola.  The Tartufate was a disc-shaped pasta, 3 halved mushrooms, asparagus, 'sun-dried tomato,' black truffle cream, two shaved Grana Padano, and a drizzle of white truffle oil.  You can definitely tell that they didn't skimp out on the truffle, but it was quite overwhelming!  It wasn't as rich as I thought it was going to be, and the taste of it seemed somewhat off.  The gnocchi, on the other hand, was okay, and it was rich in taste.  For dessert, we had the flourless chocolate cake that was more dark chocolate-based and on the dry side.   The apple pastry tart was okay as well, which came with their 'homemade' ice cream that was a little too sweet (vanilla).  I'm glad I was able to check this place out!<br><br>+free parking off of Wells", "pics": null}}, {"review": {"des": "The restaurant is elegantly decorated without being over the top.  The employees were all super friendly and not stuffy or arrogant.  We first sat at the bar while we waited for the rest of our party.  They offer an excellent selection of beers which we enjoyed.  Our bartender, Bryan, was super friendly and efficient.  Our meal was superb.  As an appetizer we ordered grilled squid and octopus which was very fresh and outstanding taste. As my entree I had salmon with lentils which was delicious.  For dessert I recommend the Chocolate cake.  This restaurant serves high end Italian cuisine at its best.  I will definitely return here. Loved Prosecco!!", "pics": null}}, {"review": {"des": "Went here for wifes 36th... The table was ready when we got, there beautiful place. Fancy Italian place . Service was ok , wife found something floating in her wine glass, waitress tried passing it off as piece of cork and that its ok NOOO it's not OK . Wine was replaced  . We had the Antipasto cheese and meat this was awesome so good . Wife had the Rigatoni she loved it and I had the spaghetti it was ehhhh for dessert the tiramisu was to die for. Special occasion kinda place", "pics": null}}, {"review": {"des": "From the instant we arrived, we were treated like family ( in a good way)! It starts with  a glass or (what else) Proseco, then a waiter/Smellier, Christian, who's knowledge of Italian wines is encyclopedic. We're not big eaters and after admitting that was advised to just show what we were interested in and he would take care of the portions.  He delivered in spades. What came was the most extraordinary Italian dinner we've had to date. The ambiance is lively without being crushing.  Several glasses of paired wines, amazing food and service that is beyond description. We will definitely come back whenever we're in the Chicago area. Thank you everyone at Proseco!!", "pics": null}}, {"review": {"des": "I'm shocked that there could be any negative reviews about Prosecco. I've been to Prosecco four or five times over the last few years and every time we go, it's absolutely spectacular. It is, hands down, my favorite restaurant in Chicago. <br><br>The food is INCREDIBLE. I literally lick the plates. Some of the best dishes I've had are the burattas (YUM), the duck carpaccio (amazing), the orecchiette (omg), the salmon, the flourless cake... I've never had a single bad item. <br><br>I've also never had a bad waiter/waitress. In fact, I've had absolutely amazing service every time I go. The waitstaff is so attentive and kind there. The meal starts with a glass of prosecco, too! <br><br>I truly can't say enough good things about this restaurant. I've been for every one of my birthdays and anniversaries and I tell everyone I know about it. We just went and we're thinking about going back for Valentine's day (again).", "pics": null}}, {"review": {"des": "Extremely authentic Italian fare. Cozy setting, inviting ambiance with very classy decor, but not stuffy or stiff. The service is friendly, relaxed yet attentive and professional. Had the avocado salad (5/5), grilled octopus (3/5), orecchiette(4/5) and ricotta dumplings(5/5) (yes I was hungry). The pasta was all homemade of course and very well prepared. Best thing about the pasta- it was not oversalted like the majority of Italian restaurant fare in the US, where too much salt is added to the sauce completely overwhelming the taste and texture of the pasta. This was seasoned just right! I would have loved dessert but I couldn't eat anymore after the main course. Definitely next time I'm in Chicago I'd like to return and try a different dish. Good job!", "pics": null}}, {"review": {"des": "Food was delicious. Went on a Thursday evening. Service was fantastic - he knew everything about the menu and was able to make some great recommendations for the table. Highly recommend.", "pics": null}}]}