{"name": "publican-quality-meats-chicago", "reviews": [{"review": {"des": "Shout out to the young hostess with curly hair who served us last Sunday. We had a party of five and she recommended that we wait for the party of two to depart since they were finishing their meal so that we could be seated more comfortably than simply adding a chair to a table of four. The couple ended up taking much longer than expected and the hostess checked in on us regularly to make sure we were okay. She had a great sense of humor and we really appreciated her attentiveness. Thank you!<br><br>If you like peanuts, the peanut cookie is for you. It's soft, chewy, crumbly, and very flavorful. The farmer's breakfast was everything a man wants, and I really enjoyed the pozole soup and grilled eggplant sandwich. Perfect brunch spot.", "pics": null}}, {"review": {"des": "I heard about PQM from Anthony Bourdin's show and I'm really glad I checked these guys out! Super friendly wait staff, great variety of meats and cheese. On a recent trip to Chicago, I stopped by for lunch and had a charcuterie board with 3 types of meat and cheese (I asked them to surprise me so I don't know what I had), but it was good! Their brioche is our of this world!<br><br>Cute ambiance, casual and friendly, good natural light and not a very cramped restaurant. They also are a butcher. <br><br>A bit pricy, as charcuterie is, but worth it for a special treat to yourself!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/5OmNp2XE1VHOpnt6X07ZZw/348s.jpg", "caption": "Charcuterie board - three meats and one cheese with brioche bread"}]}}, {"review": {"des": "Honest review: didnt think food was flavorful. How this places works is like its a restaurant/ grocery store so you could buy meat/ cold cuts condiments stock bread a lot of things. When you eat here you can order at the counter or sit down there is a patio.  Service: didnt like it all the employees do is mess around wasnt attentive didnt describe things forgot things just ur typical bar service buser was really nice though<br>Food: i think everything is high quality but feel they dont try like the cheese and meat board are so basic like something u can get at a restaurant chain. Then like every sandwhich needed more of the sauce and a lot of the dishes needed seasoning badly n u can only get the porchetta after 1pm i wouldnt come back to eat here but id buy some bread or meat though wish they had a better dessert selection<br><br>Bloody marry: it was ok just like it tasted more like a tomato juice then like a bloody marry was expecting like a spicy horseradishy boosy drink n got tomato juice with beer on the side :/ a bloody marry needs vodka<br><br>charcuterie board $16 (u cant pick what u want) : this was probably the worst meat board i ever had just i was expecting things i cant eat at my house like pâtés head cheese or bacon something different then salami. Then ur just given mustard n 3 pickles. The only thing that was good was the rilletes with strawberry jam perfect combo of sweet n salty<br><br>Cheese board $15: this was just sad. Its just 1 soft cheese with 2 hard cheeses n pumpkin seeds. No preserved nothing sweet or no nuts was disappointed. <br><br>Colonel jerrys fried chicken $12:( seeded fried chicken thigh, roasted cabbage, green tahina, and poppy seeds on a griller bun): didnt like it. The chicken wasn't flavorful it needed salt was just a plain chicken sandwhich with grilled onions with mayo wasn't anything special <br><br>THE BGS- crispy falafel, red curry soubise, urfa yogurt, fennel, pickled cauliflower, gem lettuce on a potato bun - $13: this was the worst sanwhich the falafel was bland n really dry n dense the cauliflower needed to be pickled more wish the sauce was more flavorful <br><br>TOM'S SILVER MEDAL - spicy capicola, lonza cotto, ham, provolone, pickled peppers, piperade, aioli on a hoagie roll - $11: this was the only sandwhich worth getting is was really flavorful like the best Italian sub ever<br><br>FRENCH '79 - 1979 bread, honey ricotta, orange-maple syrup, and seasonal fruit  - $12: ( its french toast): the only thing i liked was the honey ricotta that was amazing wish they put more reminded me of cannoli filling the bread was really dry and dense <br>Like it wasnt soaked into the custard long enough the maple syrup was good just wish it was heated up hot maple syrup is the best", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/KTfGFmo0yUl3XRO3-L-m-g/348s.jpg", "caption": "Bill"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Mn0_gqS4NsL7eJHE9-NbtA/168s.jpg", "caption": "French 79 $12"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/HUeI8lY1R4JWZly1pO0oHg/168s.jpg", "caption": "THE BGS- crispy falafel, red curry soubise, urfa yogurt, fennel, pickled cauliflower, gem lettuce on a potato bun - $13"}]}}, {"review": {"des": "Eric the butcher was extremely knowledgeable and helpful. Great customer service promotes repeat business, not to mention the outstanding pastrami. If only it were served warm and offered as a sandwich. It's easily the best pastrami I've had.<br><br>The charcuterie board is a great way to sample Publicans Quality Meats (see what I just did? B-)<br><br>Enough writing. ..Go check them out.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/95b8ORkWTfEVN1e6JghKuQ/168s.jpg", "caption": "Lemon Sugar Cookie"}]}}, {"review": {"des": "When I came here with my husband three weeks ago, I wasnt sure what I would get as a vegan. I have previously been to PQM as an omnivore and loved it. I worried I would feel that I was missing out. Vegans and vegetarians, you should know that they do something super cool here: they make a veggie plate that is a mix of all the really great veggies they have that night in season. it's ever changing. and it's HUGE for just $20!!! I was blown away.  Of course, you should try their breads too, but the veggie plate is super filling so that can work on its own. For example, my plate had some little gem salad, roasted yams, lightly fried cauliflower, Indian-spiced veggies.", "pics": null}}, {"review": {"des": "Exactly why haven't I been here before?<br><br>Just ordered like 3 sandwiches because I couldn't decide. Anyone who is Italian or married to one needs to come here. <br><br>Courteous service, lots of meat protein and retail options. <br><br>Def a must try in the market.", "pics": null}}, {"review": {"des": "I make it a point to come here every time I'm in Chicago. Great food, prices and service, and constantly-changing menu. Ordered the PST club, side of kale salad, and ice tea. Everything was excellent, a little spice/kick in the sandwich and salad, just the way I like it. Only negative today was that nice tea a bit too watered down. I like it a little bolder. But again this is my go-to Chicago joint and it rarely disappoints.", "pics": null}}, {"review": {"des": "FINALLY, got to try PQM and was not disappointed! Came on a Saturday around 10:30am and was seated inside on the bar seats (outdoor was all taken). We ordered the PST and the Parm #2. They both came out fast.<br><br>PST (5/5): Oooh that shaved smoked turkey and everything in that sammich came together. Simple but PQM leveled it up.<br>Parm #2 (4/5): Tastyyy, however the breaded chicken could've been thicker. Tomato sauce on point.<br><br>We will be back for the Porchetta (only served after 12pm). Took a peek at other customer's food and I just wanted to eat everything.", "pics": null}}, {"review": {"des": "We always love PQM. The food comes out quickly and it is always so delicious. They have a great variety of lunch items on the menu. Today we tried the charcuterie plate and the pimento cheese spread. It was just perfect!!!! And the bread! I would come just for the bread! They do have outdoor seating which is perfect for a quick al fresco lunch!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ga8VJNC4CVSyRqoFPxcOKA/168s.jpg", "caption": "Green Green Garlic Soup"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/S8k9K9RP4zQrHmFLALC-pw/168s.jpg", "caption": "1 Selection Butchers Cold Charcuterie Plate and Pimento Cheese"}]}}, {"review": {"des": "Quick lunch with a friend. <br><br>A little confusion on seating when we first walked in but once we were sat down it was smooth sailing. <br><br>The smoked turkey BLT with Avocado is the way to go. Sandwiches are a decent size and the bread is super fresh. You can also buy loaves of bread there. Yum....like a true deli. <br><br>This a great place to swing by on a weekend for brunch or lunch.", "pics": null}}, {"review": {"des": "I've always passed by this place but never went because it's so small and always packed with people. Today, I finally got to try this place for lunch! I was excited to eat here because of Anthony Bourdain and Andrew Zimmern (Travel Channel). The Fulton Market area is also historically known as the meat packing district so I was super excited to try the meats that this place had to offer.<br><br>I went here with my dad on a Wednesday at 1:00PM and surprisingly it was not as crowded as I expected. I walked inside the shop where there's a cafe and butcher shop with meats on display for sale. I unfortunately didn't get to check out the bakery or the meats they had on sale. We were seated right away outside since the weather is finally nice! The service was great. Our waitress was attentive and friendly. The busboy was always making sure our water glasses were full and table was clean. <br><br>I asked the waitress which were the most popular items on the menu and she said the Parm #2 is a favorite and Tom's Silver Medal is popular this month. I guess they change the menu every once in a while because on the website, the menu is current as of April 2018. My dad and I ordered these sandwiches in addition to a charcuterie board with 3 cuts of meat and a cheese. The charcuterie and cheese board was the highlight of my meal. I chose the cold charcuterie with 3 meats (3 selections for $15) and 1 cheese ($6). The 3 meats were pulled pork with raspberry sauce, prosciutto, and salami. I didn't get the name of the cheese but it was off white color, crumbly, and salty in a good way! There were also cauliflower, pickles, and pickled onions to add acidity and complement the saltiness of the meat and cheeses. The crostini was a bit hard to bite into and too crunchy for me though. However, the charcuterie board was my favorite part of the meal and it met my expectations. As for the sandwiches, my dad ordered the Parm #2 ($10) which had breaded chicken with mozzarella and basil tomato sauce on a sesame roll with fries ($3). I ordered Tom's Silver Medal ($11) which had spicy capicola, lonza cotto, ham, and provolone in a hoagie roll. I enjoyed that the cheese was melted and that the bread was warm and nicely toasted. The meats on the sandwiches were good and not dry. However, the price is too steep for these sandwiches. I thought it was like an overpriced version of Jimmy John's? I love sandwiches but the price was just too much for lunch. I do recommend the cheese and charcuterie board, which I thought was worth my money!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/7RT4st4MU0U0MUXmDVMCyA/348s.jpg", "caption": "Parm #2"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/tBujejjThwqLPJo3Gt7E0w/168s.jpg", "caption": "Tom's Silver Medal"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/L26aoPK5w-HPSKmwdaRtPA/168s.jpg", "caption": "Charcuterie & Cheese Board"}]}}, {"review": {"des": "We stopped in on a Sunday morning after eating at their restaurant the night before, and we both were extremely impressed with this smallish, but wonderful butcher.  The staff was extremely knowledgeable, friendly and were willing to cut anything you'd like.  We ended up leaving with a massive amount of dry aged steaks and pork porterhouses!  <br><br>We had planned on another restaurant for lunch, but the small deli menu and meats looked so good that we ended up staying for lunch.  I had a spicy Italian sandwich, fries, and a bloody Mary.  My wife had a chili cheese brat, fries and a bloody Mary.  Everything was extremely good, but the bloody Mary's were only okay.<br><br>We plan on making a few trips to Chicago to just come here and stock up on their amazing steaks and sausage.", "pics": null}}, {"review": {"des": "PQM has quality food and quality service (as stated in the name.)  The food is definitely what you would expect being the fast casual version of one of Chicago's best restaurants.  My main concern is that the price is a bit high.  I feel like after spending the amount that I did I should have just gone to the Publican itself.  (But my bull probably would have been a lot higher.)", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/GwaZ1dcvdGiRtXVFjQeoNw/168s.jpg", "caption": "Avocado  Salad with smoked salmon.  There is a whole (beautiful) avocado underneath all of that!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Rc8B0dNO_Ij_Mt3oXO3jmQ/168s.jpg", "caption": "And now with the egg!  The dressing they put on this is out of this world!"}]}}, {"review": {"des": "Publican Quality Meats was the perfect rehearsal dinner location. We had a group of 28 with several guests having dietary restrictions. Publican Quality Meats accommodated for each restriction and created an amazing spread of appetizers, entrees, and sides. Don't let the name fool you-their vegetarian options were phenomenal! We did not select specific liquor and wine for our event, but instead just gave them a price point and they picked delicious wines and spirits that paired well with the food that was served. It was great to have the whole restaurant to ourselves, so we could spread out and mingle before food was served. The staff was also very efficient and friendly. We would highly recommend Publican Quality Meats for a private dining event! It truly was a unique space.", "pics": null}}, {"review": {"des": "stopped in for lunch today and \"WOW\" - loved this place.  service is fantastic, atmosphere is inviting and friendly and the store is very clean.  Are service was great...lots of attention by her and others.<br>I had the P.S.T (smoked turkey, bacon, ranch dressing, munster cheese, avocado, giardiniera on sourdough.  OMG...loved it.<br><br>you sit at community tables in the store...which is nice, with individual tables outside.  And for entertainment, they carried in three whole pigs while we were eating....that was awesome!!!   I will definitely return and next time will buy meats to go.   great store!!", "pics": null}}, {"review": {"des": "Saw the documentary \"Sustainable\" and knew I just had to try their sourdough bread made with ancient grains specially grown for them.  I have to say, it's honestly the best sourdough I think I've ever had (and I've had my fair share!).  It's perfectly chewy, soft in the middle with beautiful craters, and the taste is out of this world.  Can't say anything about the cafe or meat bc I just went in for the bread, but will definitely be checking them out soon for lunch!!", "pics": null}}, {"review": {"des": "Of the many restaurants and food places we visited in Chicago, Publican Quality Meats is the one that stood out in our visit.  Not a high-end restaurant, more of a well-stocked deli with excellent options.  Apparently a feeder location for their restaurant (across the street), PQM is a much lower key, relaxed environment to kick back and get a nice lunch.<br><br>My \"Tom's Silver Medal\" was a tasty combination of meats and certainly made for a filling meal.  We also did the \"bread and spread\" but both agreed that the rillettes were more of a star than the pimento.<br><br>Solid service, nice attitudes, very fair pricing - next time we're in Chicago we'll come back.", "pics": null}}, {"review": {"des": "Great spot for a higher-end lunch feel! Wouldn't say this is necessarily a place to go back to over and over but worth a try to spice up lunch in Fulton Market!", "pics": null}}, {"review": {"des": "We met our son on his lunch hour so we arrived early to secure a table.  It was 11:20 am and we were the 2nd party to be seated.  Immediately, we were interrogated as to our intentions about how long we would need to complete our party.  While I understand the why's and wherefore of it, it still puts me off every time.  However, once we ordered a drink and appetizer, he warmed up and was quite friendly.  <br><br>So we sat down and ordered a couple beers and the pimento cheese plate which was delicious  it was very fresh and tasty served with crostini and their AMAZING bread and butter pickles.  <br><br>The sandwiches aren't your generic cold cuts, they are works of art. We had the Gentlemen, Attempt #9  and the Tom Sawyer. All were plentiful, freshly made and delicious.  The french fried were  hot and crispy-who could ask for more?<br><br>We had a delicious beer on tap and a very reasonably priced glass of red wine.  Everyone was friendly and efficient.  There is a sign on the door that states this is a safe place for everyone no matter who you are and I LOVED THAT!!!", "pics": null}}, {"review": {"des": "So I don't always give 5 star reviews but this place merits a 5 star for sure. We came here on a quick lunch on a Friday afternoon around noonish and it was already super packed. We wanted to take advantage of al fresco dining so we got seated outside. I ordered the cajun sausage sandwich with the shrimp and my hubby got the roast beef sandwich. I much preferred mine even though I'm more of a hot dog over sausage kind of gal, but this was the best sausage I ever had. It didn't need those shrimp on top but they were really tasty by themselves. And the roll was warm which really went well with the sausage. The pickles we got were very crisp and delicious. I didn't love the cole slaw and wish I got the french fries instead but I will know for next time. My hubby got the chips which were also very tasty and unique as they were a mauii sweet onion so definitely different than we are used to.<br><br>Now, I thought it couldn't get better but it did. I managed to get one of their dark chocolate brown butter cookies to go and for $3 that's not cheap for one cookie, but it was amazing, one of the best versions of chocolate chip I ever had. I'm mad at myself for also not trying the rice krispie treat. I will absolutely come back here and only wish I lived closer to enjoy this amazingness another time. Publican quality, you truly have good quality stuff here. Can you make another location for the suburban people?? That would be great!!", "pics": null}}, {"review": {"des": "Awesome funky butcher shop and restaurant!<br><br>-Meats are prepared on the premises including fantastic homemade sausages.<br>-The restaurant is trendy, but welcoming.  <br>-Club sandwich is phenomenal.<br>-Weekend brunch is a great option in the area--featuring delicious egg dishes with their signature meats.  Also, they do a nice Bloody Mary!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/RlcHwC7K4EdfnUSeIvKECg/348s.jpg", "caption": "Butcher case"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/cAs4dLqcqRjUVIu0oJuFmA/168s.jpg", "caption": "Outside"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/MmUBgujmbmQVZ_05earvvw/168s.jpg", "caption": "Outside"}]}}, {"review": {"des": "There is communal seating towards the back of the meat market and they serve a limited menu of items (at least at breakfast when we were there).     My husband did not like the communal seating but the food was very good.   I had the breakfast burrito - eggs were light and fluffy, pork belly was full of flavor and the tortilla was amazing.   My husband also really enjoyed his Butcher Breakfast.  <br><br>Be sure to check out the meat locker downstairs.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/YORNFxFhUkVN-bQl_Z4PmA/168s.jpg", "caption": "Breakfast burrito"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/UqbPNxSyicBcGlRoXf5Tpw/168s.jpg", "caption": "Butcher's Breakfast"}]}}, {"review": {"des": "We had some pretty perfect sandwiches here on a casual Sunday. Totally hit the spot and we loved the space. We topped off our meal with a cinnamon roll and left so satisfied. Can't wait to make this a regular destination.", "pics": null}}, {"review": {"des": "I've been here two separate times for lunch and both times have been A+ food and service.<br><br>The first time I got the Gyro Strikes Back and that that it was as good as it could get. I was wrong. The second time was even better with the anti-parm sandwich! I'm getting hungry just thinking about it! <br><br>I would recommend this place if you want a high quality, quicker/low key lunch in the West Loop.", "pics": null}}, {"review": {"des": "This place is superb.  Everything on the menu is great.  Great beer list as well.  Highly recommend will come every time I'm in Chicago.  Service was excellent as well.  If you have a chance to...do this place.<br><br>Pictured here what we had, cheese plate, chili, gyro, etc", "pics": null}}, {"review": {"des": "Simply Awesome.  I visited the Publican restaurant first and I will admit I was not impressed.  The Deli was absolutely superb.  I ordered the PST with a side of Kale Salad.  The PST was delicious, I loved the giardiniera, the shaved turkey was delicious.  I cannot rave enough about how delicious and simple yet complex the Turkey Sandwich was.  However, I felt the true star was the Kale Salad.  I'm pretty sure Kale Salad is one of my top favorite foods in this world.  I was so impressed, perhaps even moved to tears by the attention given to the kale salad.  It was dressed just right with a balanced acidic (lemon or Vinegar) dressing with a healthy handful of parmesan cheese.  Wow.. The sandwich was EXCELLENT but the kale salad was DIVINE.  I will be back for Kale Salad and more sandwiches.  <br><br>The 4th Star is for the superstar service.  I get that this is a deli, but the staff was super attentive and helpful.  They awarded me with a rhubarb tart after the slightest of sandwich mix-ups.  They were truly top notch and the pastry was exquisite (I didn't know I liked Rhubarb).", "pics": null}}, {"review": {"des": "Best part of our trip to Chicago. Good service with insights on the menus items. Food was amazing. We had charcuterie and cheese and the beet salad. Lots of<br>Good drink options. Would go again. Highly recommended.", "pics": null}}, {"review": {"des": "This is one of those menus that will have you saying, \"I'll have one of everything please.\"  Since you can't have one of everything, this is what I would suggest:<br><br>(01) Matcha Rice Krispie Brick--er--Treat<br>(02) Charcuterie Plate (Ya gotta sample what's in the deli case!)<br>(03) Any baked good i.e. zucchini muffin w/ blueberries and ricotta<br>(04) Pork Belly Gyro<br><br>Believe me when I say it: you can't go wrong here.", "pics": null}}, {"review": {"des": "Ordered a sandwich from here recently and was pretty impressed.  Only complaint was that the delivery took a while so the toasted sandwich wasn't warm at all.  I really would like to dine in and get the full, fresh experience!", "pics": null}}, {"review": {"des": "I ordered the Lox Plate (not sure the specific name) and I was very impressed with what I got. They took a very classic meal and added simple changes that took the dish above and beyond what it normally is. The salmon tasted fresh and the meal was perfect for a summer afternoon. The shop is on a fairly quiet corner, so dining outside is a very enjoyable experience. If you opt to sit inside, there looks to be limited seating.", "pics": null}}, {"review": {"des": "This is probably a good place for a breakfast. Good quality meets and fish. Everything is fresh and delicious! Also you can buy a lot of stuff to your homes' fridge, like cheeses, meets and much more. Our server Brianna was an amazing one  Friendly, knowledgeable and happy", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/2hoQUVaap3GzPGCMafJNPw/168s.jpg", "caption": "Sticky bun!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/HeyEC9ArKAIMicGFS-Ko5Q/168s.jpg", "caption": "French deep dish !"}]}}, {"review": {"des": "Can you just say AMAZING!!! So I am not the biggest sandwich gal but you would never guess it by how much I love this place. They change up the sandwiches from time to time but my two favorites would definitely be the turkey (P.S.T Club) and the chicken parm sandwich I believe it was called (parm #2 possibly). We usually come in and get at least a few sandwiches and split them. The other must have whenever I come here is the marinated kale....just yum!!! We have come before and they had this mac and cheese, they have taken it off the menu but if for some luck you go there and its on the menu....its a MUST order. We also love the potatoes with the orange sauce they put on it, whatever that sauce is its amazing!!! By far my favorite sandwich place, so if you are in the area you should definitely check it out, I guarantee you will leave full and HAPPY!! :)", "pics": null}}, {"review": {"des": "Last time we came here the food was amazing, so was the coffee, so fresh and perfectly made (corrado, espresso, and cappuccino). I don't remember the food we got last time apart from the charcuterie plate which was amazing, and whatever fish sandwich they had back then - I also have a great memory of that<br>Today however the service ruined everything. First of all, the coffees we ordered came at the same time as our food, just slightly warm. Even the froth on the cappuccino has started disappearing and receding from how long the drinks seemed to be waiting to be delivered to us. We had to wait a solid 5 min before getting waters, another 5-10 min for us to order. <br>Ok now the food was good, I got the avocado salad with smoked salmon added. That was really good except the dressing was a little too much, but that'saybe a personal preference I usually ask for dressing on the side - so that's my bad. And we also got the smoked turkey sandwich. That was good, but a little too much turkey in comparison to the spread and the rest of the additions on the sandwich, it needed a little bit more harmony", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/6XPXGYFvNBtXH-69_1bUig/348s.jpg", "caption": "Avocado salad"}]}}, {"review": {"des": "Service: exceptional (especially Mo who helped me pick a sandwich!)<br><br>Food: no idea what all the hype is about. Flavorless bread, chicken part was extremely thin and dry, none of the flavored cut through. Mac and cheese tasted like kraft, which I love, but not for that price.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/u_1U9wl6BaMygvyqFNxvzg/168s.jpg", "caption": "Mac and cheese"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/azDG_vgDuqdXm6zJ3oaUYQ/168s.jpg", "caption": "Chicken parm"}]}}, {"review": {"des": "I've long lamented the poor quality of deli culture in Chicago compared to NYC which is why PQM is both equal parts delicious and important in that it seemingly represents a dying breed of Chicago restaurants making sandwiches, meat, pastries, etc. from scratch.<br><br>(Steps down off soapbox).<br><br>I appreciate that PQM seems to be equally concerned with bread as they are with what goes between it (a novel concept, I know). But that same level of concern extends to everything they serve/sell.<br><br>I swear I wasn't paid to write this. The porchetta was just that good.", "pics": null}}, {"review": {"des": "The pinnacle of swine dining. And the pimento cheese... This place never disappoints. Local. Hipster. Yummy. Need I say more?", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/0cRD8zro4A4XllIvnki6Iw/348s.jpg", "caption": "The very best in Swine Dining!"}]}}, {"review": {"des": "OMG, this was maybe the best meal I've had this year. I came here for an event/honey summit (for work) and they had arranged a private meal.<br><br>We started with a charcuterie board, and beer and wine, and went on to an avocado salad, sea bass filet, country ribs, and peach and nectarine cobbler. Each course was divine. I even tried the sea bass although I generally don't eat fish, and that was good too.<br><br>The country ribs and the tempura cauliflower with honey were by far my favorite. The cauliflower tasted like candy and I could NOT stop eating it. The ribs were so tender and also very delicious.<br><br>I'd like to come back here when next in Chicago just to browse the store too, they seemed to have a good selection of meats and cheeses.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/hS71bVZfuN2wMFr3gVLSWQ/348s.jpg", "caption": "Private dinner, 9.21.16"}]}}, {"review": {"des": "I had lunch here recently.  Food is delicious.  Service is good.  If you are a small Group or one person expect to sit at a table next to others.   I love it that this place practices sustainable food values and sources food locally.  It pays off to help the environment but the end result it delicious food!  Worth ordering some of the yummy bread from the bakery as well.", "pics": null}}, {"review": {"des": "This review is mainly for publican bread. Greg Wade is Grain God himself. <br>If you have been an atheist to bread -  it's probably because your parents stuffed your throat with (the completely offensive and unnecessary) Wonder Bread - which lacks any godliness. <br><br>So get ready for your first born again Brad Experience. Your taste buds will thank you for being released from wonder bread hell. <br><br>As for the rest of the restaurant - It's Paul Kahan - need I really say more??? Though, I will say how completely unfair it is that there are two gods that reside in the same building - this is the equivalent of a taste bud monopoly - but in monopoly that we all should want and need. <br><br>Thanks guys.", "pics": null}}, {"review": {"des": "Went around 3p- no line, no wait.  Everyone at my table ordered the Apple Salad w smoked turkey.  Was amazing, a little pricey but I think worth it!", "pics": null}}, {"review": {"des": "Wonderful complement to the Publican next door. Coolest thing about this place is probably the bathroom setup: down the stairs, and kind of near a huge kitchen. Neat.<br><br>Stopped here for brunch with my family. Lots of cool variations on brunch items with some interesting sandwiches and salads thrown in for good measure. I had a wagyu brisket sandwich, but the slice of blueberry/blackberry pie was heaven. That puff pastry tho ... Wonderful place to eat outside and enjoy a Chicago summer. Pro tip: park on Lake!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/fMn3XGpROAs_eqUOalgfRQ/348s.jpg", "caption": "Pie of the day!"}]}}, {"review": {"des": "Fulton Market District is one of Chicago's hottest dining neighborhoods. This area was previously known as a meatpacking and warehouse district, but has recently been transformed into a neighborhood full of some of Chicago's best eateries. Two of those being The Publican and its counterpart, Publican Quality Meats.<br><br>Deciding between The Publican and Publican Quality Meats is a matter of preference. Location is not an issue as both are located across the street from one another. The prior is just a restaurant, while the latter functions as a butcher, sandwich and specialty foods shop that also offers brunch on the weekends.<br><br>If you are looking for a more low key dining experience, I would recommend Publican Quality Meats. The X factor of dining here is that there is an al fresco dining area which is great on a warm and sunny day.<br><br>Last month, I visited this spot to enjoy brunch on my birthday. Got a spot at one of the outside tables. The brunch menu changes every weekend, but there are many items that seem to be regular items on it. You can find this menu on the restaurant's website.<br><br>Ordered one of the special weekend brunch items, the pork dirty rice ($12) and bottomless Intelligentsia coffee ($2.50). The pork dirty rice seem interesting as it isn't something that you would find typically on a Seattle brunch menu. Don't even know what kind of cuisine this is though it seemed Latin American or Cajun/Creole to me.<br><br>Whatever cuisine it was, I really like the dish. Primarily because of the pork shoulder which was tender and reminiscent of baked ham. The dirty rice was lukewarm, but the flavor was there. Maybe that is just how it is intended to be served. As for the coffee, it was as expected good since it is Intelligentsia. The service was great as they refilled my cup a couple times during my meal.<br><br>If you enjoy meat products and sandwiches, I would recommend checking out this spot. Brunch here is good on the weekends too, particularly if you can score an outside table.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/4Na4S8y71dQGvhUW2mNefQ/348s.jpg", "caption": "Pork Dirty Rice ($12)"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/p0w_r9VEFz-FoDlZIrc2FA/168s.jpg", "caption": "Pork Dirty Rice Close-up"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/vfkbyetOm7YBn7XI7Jzi6A/168s.jpg", "caption": "Bottomless Intelligentsia Coffee ($2.50)"}]}}, {"review": {"des": "NEVER come to this place. I live one block down the street and wanted so badly to have a sandwich place nearby. I have never been treated SO rudely in my life. Not to mention that the sandwiches were HORRIBLE.<br><br>Both times I went in the hostess with the missing teeth (maybe his name is Mo?) was outrageously rude and disrespectful.<br><br>Who lets this guy work here!?? Seriously..fire this guy immediately.<br><br>He talks down to all of the customers and does this fake laugh and FAKE voice and rolls his eyes at you as if you were asking something crazy of him.  <br><br>Not only is he rude, but he and the people he work with are extremely slow. Are they high?? I've never seen someone try LESS hard to let their customers food....Why do you work at a restaurant????<br><br>Oh..and then the food that I finally WAS able to order....actually disgusting.  My boyfriends sandwich was burnt and he said that the chicken was most definitey not chicken and some fishy substance.   My sandwich was soggy as if it had been microwaved.  I asked for a new one...which Mo had a field day with.  He was like \"OH so now you want the one you were ORIGINALLY thinking of ordering!\" and then to the food runner..\"don't burn hers OR make it soggy...LOLOL.\" <br><br>At the end of a long back and forth I said to him \"You guys are so welcoming here!\" - Fake of course to match the fakeness with which he was talking to me.  He said \"I'm glad you like it!\" in an even more fake tone.   <br><br>Mind you..this guy is at least 40 and overweight with missing teeth.  Someone must have bullied him in his life because now he is the bully of Publican Quality Meats.   <br><br>Go in to this place and trust me..you will experience exactly what I'm talking about.", "pics": null}}, {"review": {"des": "Got an order each of charcuterie and cheese to go. Out of the 3 meats I got, only the blood sausage looking cut was good. The other 2 were cold mushy pulled pork-ish meat, and a really tube of red-colored lard tasting thing. I'm wondering if they picked the meat based on convenience instead of a good pairing choice. The 3 cheeses were okay, but again, nothing special. 2 of them were very similar. It makes me wonder again if they picked them for convenience. The rye-looking bread and crispy flat bread that came with the orders were stale. <br><br>The only item I liked from there was the pickles. They were super good! I would totally buy a jar of it!", "pics": null}}, {"review": {"des": "Just had a great midday work lunch at Publican. Even though it was in the 90s outside, the patio seating was too tempting to pass up. Their take on a BLT was the ideal sandwich--perfectly toasted and buttery sourdough bread (not too thick to take away from the rest of the sandwich); juicy, just-ripe heirloom tomato slices, mashed avocado, some kind of delicious sauce, and the most melt-in-your-mouth bacon I've ever had. Just delicious! Would definitely recommend and return in the future. Also the price was pretty which I appreciate for a lunch especially.", "pics": null}}, {"review": {"des": "5 stars for possible the best cookie I've ever had in my life.<br><br>We stopped in while waiting for our Au Cheval reservation and couldn't pass up the opportunity to try some of the baked goods.<br><br>We ordered the brown sugar dark chocolate chip cookie and the banana bread. The banana bread was just alright and honestly didn't taste like it was made with much banana -- which perhaps lent itself to being slightly dry.<br><br>The cookie on the other hand was heavenly. The perfect crisp on the outside and chew on the inside. The dark chocolate chunks were the perfect size and some of which were just perfectly melted, too. All in all I would come back just to buy a few dozen of these cookies", "pics": null}}, {"review": {"des": "I have eaten here several times and have always been impressed with the food. The Parm #2 for lunch and the Butcher's Breakfast off their weekend menu are delicious!<br><br>My main purpose for writing this review is to highlight Publican Quality Meat as a venue space. I reached out to Publican Quality Meats to host our rehearsal dinner. While the Publican is only open during the day/afternoon, it turns into a private event space at night. We booked the main floor for 27 guests. Though there was another chef's table event happening in the kitchen, it truly felt like we had the space to ourselves. From the time I reached out, communication was quick, friendly, and effective. Kirsten did a wonderful job taking care of us. The servers, including our main server Emma, were friendly, flexible, and efficient.<br><br>Everything from our menu (we were able to select all items) was delicious, from the burrata first course, to the pork belly, finishing up with a trifle. We had a wonderful time and I would highly recommend.", "pics": null}}, {"review": {"des": "I've only been here 3 times but PQM has never let me down.  From their chx parm to the hot dog, to the fresh eggs and meat to the $10 juice; I'm hooked.  (PRO TIP: ORDER THE HOT DOG. Wtf is that bun PQM it's perfection!) I only wish I found myself in their area more often around lunchtime.", "pics": null}}, {"review": {"des": "This review is for a private rehearsal dinner that I held at Publican Quality Meats for my wedding.<br><br>The Planning<br><br>My wife and I have eaten at Publican Quality Meats numerous times over the 7-8 years we've lived in Chicago and have always enjoyed their food. When it came time to pick a rehearsal dinner spot I had contacted numerous places, but Publican was the only one that offered the level of service and customer support that I was looking for. From the very beginning I laid out a budget that I wanted to keep the meal at and Kirsten did a tremendous job of tailoring their menu options to fit our needs. <br><br>She put together a proposal that estimated all of our costs for a family style dinner allowing us to pick the options for each course. They allow you to pick from their wine selection, or they offer the help of their wine specialist to tailor it to your menu choices. Even though the menu comes pre-prepared, she allowed us to swap out certain parts of it to fit the tastes and needs of our guests, and even offered some expert advice about what dishes would be best suited for our party. To help keep with our budget, they even allowed me to put together a limited cocktail and beer list for guests to order from at the bar during dinner (without skimping on quality or options). The planning process could not have been simpler, and I could not be happier with how helpful Kirsten was.<br><br>The Service<br><br>On the night of the rehearsal, we arrived to Publican Quality Meats and were greeted by their staff for cocktails before being seated for dinner. Their staff did a terrific job of getting orders through quickly so that people could mingle and have a seat for dinner. Special menus for our cocktail and beer list had been printed and displayed so that our guests could easily decide what they wanted. Once the cocktail hour was over the staff quickly transitioned from bar tending to wait staff and moved fluidly throughout the evening providing each course and ensuring that everyone's glass was full. The best part was how well they allowed us to have people up giving speeches, and talking, without disrupting at any point. Their timing and attention to the guests was impeccable. I can honestly say that none of our guests wanted for drink or food the entire night. I could not have improved on a single thing with their service, each of their waiters were warm and welcoming from the beginning of the evening to the end.<br><br>The Food<br><br>What can be said about the food at this place that hasn't already been said in other reviews? The food was amazing. I was skeptical at first knowing that it was going to be family style, I assumed that I would need to limit my expectations a bit. I was wrong. The food was hot, well prepared, and perfectly portioned so that when they set it on the table everyone had it within reach. All of the recommendations that Kirsten made for our menu that night were spot on, and even with a wide range of food tastes at the table, everyone there had something to eat that night that they loved. <br><br>When you are thinking about hosting a private gathering, a deli may not be your first thought or even an option that you would explore. I have to say, Publican Quality Meats does private dining the way it should be done. Excellent customer service for the planning (Kirsten was amazingly helpful), fantastic options to pick from for any type of group, phenomenal wait staff, and delicious food/drink. They were the perfect kickoff to our wedding weekend, and I cannot thank them enough. It was a truly special evening for all involved.", "pics": null}}, {"review": {"des": "Great butcher shop, knowledgeable staff. They have a rotating sandwich menu, makes for a fun dining experience. In my opinion, PQM has the best bloody Mary in the city.<br><br>Recently started to purchase meats and cheeses from their shop. Worth the extra $$$ knowing you are buying from sustainable, local farms. Looking forward to another Slagel farm turkey this Thanksgiving.", "pics": null}}, {"review": {"des": "Today I'm greatly disappointed in their service. We were sat down and no one came to greet us. We had to flag down someone and he took or order. Because we were in a rush, we asked for our check first. As soon as we see it, 2 items that we had requested weren't on the receipt (our entrees)! I've been here before and it was great, but today no one apologized for their poor service and length of time it took to get a waiter over, and the fact that they got our order incorrect!", "pics": null}}, {"review": {"des": "So, yeah. We went here for the Tuesday burger show down between revolution and half acre. What in the name of all that is good,  happened here?  Two burger powerhouses created superburgers that weren't nearly as good as their respective burgers. This seems like a phenomenon similar to the \"supergroup\" phenom, i.e. The traveling wilburys.  While I would agree that their music was adequate, it wasn't nearly as good as their music independently. I know, someone is going to disagree, but, hey, they're wrong. Anyway, I plan to skip the burger showdown and just go to Revolution or Half Acre directly, for the delicious vittles .  Denise U out.", "pics": null}}, {"review": {"des": "I work across the street from here, but it took me so long to eat here. If the weather is nice, the patio seating is perfect for lunch. I ordered the Piri Piri Pavo and mac & cheese. Both dishes were delicious! It's a bit on the pricier side for a sandwich, but they don't skimp on the meat and the quality is fresh. I'll definitely be back to try other sandwiches on the menu.", "pics": null}}, {"review": {"des": "Excellent portion, quality and food preparation with a decent price.<br><br>HOT CHARCUTERIE OR SAUSAGE PLATE ($18) -- I'm not a sausage person, but the 3 different selections compliment each other.  Addictive.  Perfection to dijonnaise drizzle.  Taste great when freshly served, it still taste the same when reheated.  Serves 2+.<br><br>APPLE PIE ($5) -- the best apple pie in Chicago.  The crunch on top is addictive.  $5 is hefty but worth it.<br><br>CHAI LATTE ($4) -- housemade Chai.  Woo hoo!  Balanced spice with milk.<br><br>SERVICE -- Jessica was knowledgeable with a just right timing on follow-up.  You go to the baristas and they will be glad to tell you the magnificence of what they do.<br><br>VENUE -- communal tables.  Plenty of employed guys eat here.  LOL", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/DYMgJW9rEbyQUwDgEcFPAg/168s.jpg", "caption": "Apple Pie with Chai Latte"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/0t69m5qHi5mQnw64fg-dYw/168s.jpg", "caption": "Sausage Plate"}]}}, {"review": {"des": "I've been here a few times in the past for their butcher shop, bakery, and even sundries when it was well stocked.  They have different sausages than nearly every other butcher in town with their boudoin along with high quality standard cuts of meat.  We also like their matcha crisped rice treats, chocolate crinkle cookie, and pecan sticky buns, along with their buttery biscuit.  Their coffee is from Sparrow with a custom blend for them.  We recently sat down for a few sandwiches and brunch.  My wife had the bagel with smoked salmon plate.  The salmon was not thinly sliced but kind of chunky.  The everything bagel was well toasted and the the cream cheese was not plain but we could not pick out the flavor.  The capers topped the cream cheese and were also part of the salmon.  The pickled onions were tangy and the bread and butter pickles were also a great addition.  She had the hash brown which was a patty that was deep fried.  It was nicely browned and crispy on the outside while the inside shreds were hot and flavorful.  The porchetta runs out about an hour after noon so I had the Reckless Abandon which was a take on the Cuban - pork belly, pimento cheese, mustard, b&b pickles on a bolillo bun.  It was pressed but not too flat.  I had the side of kale which has been on their menu forever.  The lemon cut through the parmesan cheese but was not something I could finish in one sitting based on taste.  Overall, a place I would return to try more things!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/8-GhnjnVAkDDKLpsCmRdfQ/348s.jpg", "caption": "Look inside the aged meat when you go down to the bathroom"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/H-xPFLFUeWBKMAK2hrB_4g/168s.jpg", "caption": "Deep fried hash brown, marinated kale"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/PAx-a4cnheovyRHOCMmlLQ/168s.jpg", "caption": "Reckless Abandon"}]}}, {"review": {"des": "2 stars for decency.. nothing too special here for this overrated meat shop. Back when Paul first opened PQM and used to actually show his face here, the place had better energy but still never stocked. Now it's staffed by douchebag pompous hipster wannabe chefs who look at you like you owe them your life to order a sandwich. F*** this place and their attitude. Yuppies enjoy", "pics": null}}, {"review": {"des": "Great sandwich shop in the West Loop / Fulton Market area.<br><br>Came in on a Saturday afternoon and there was a 20 minute wait. There's a little waiting area by the counter where they sell different meats and cheeses, and lots of interesting condiments / sauces line the shelves by the window. While we were waiting the meat guys offered us some pieces, and we had beers -- not a bad start. The interior feels more like a specialty meats / cheese shop rather than a deli or restaurant, but most people here come for lunch or \"a whole meal of food\".<br><br>The seating here is communal, so if you're not down for hearing little snippets from the table next to you, this place might be a no go.<br><br>We shared the biscuit -- which was a biscuit so it was awesome -- the beet salad (also very good) and the parm. The parm was really gooey with cheese and super flavorful. Both times I've been here I've had it -- what can I say, I know what I like.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/CUBjCOfcWLKB7VlwRorTvA/168s.jpg", "caption": "Beet salad"}]}}, {"review": {"des": "I continue to stop by for excellent bakery goods.   The cookies and bread are top rate -- highly recommended!   When you use the restrooms in the basement you can see the scratch cooking operation.  They work very hard here and their food is excellent -- I continue to recommend PQM!", "pics": null}}, {"review": {"des": "I'm a lifelong vegetarian, so why am I writing about a butcher? Well, the name seems to be a bit of a stretch, and as well as being a butcher/deli, it is also a cafe with plenty of vegetarian options. <br><br>We ended up sitting outside, which was pleasant, with table service quick and efficient. We both went for breakfast options, which were very good. I enjoyed my eggs and toast, and my companion enjoyed some kind of duck thing. <br><br>But the real reason to come here for breakfast is the hash brown. I don't know how they do it, but it is potato perfection. A brick of potato, perfectly golden and crispy on the outside, and creamy soft on the inside. glorious. <br><br>I haven't been back for lunch but noticed they have some good looking veggie sandwiches, so next time I'm in town, I am definitely going.", "pics": null}}, {"review": {"des": "I had one of my greatest meals here while in Chicago. This restaurant wasn't on the planned list of places we wanted to try, but sometimes the greatest meals aren't always somewhere you plan. <br><br>My friends and I ordered the Butcher's Cold Charcuterie Plate with 5 different meats. It was absolutely delicious and how great that it comes from a butcher shop. I ordered the spinach and potato soup because it was raining the day we came here. The soup was good, but came in a small bowl. If you come here, you MUST order the \"Return of the Gyro.\" I had never tasted anything like it. The sauce with the pork belly was something I still dream about even a year later. If I happen to ever be in Chicago again, I will be sure to stop by here.", "pics": null}}, {"review": {"des": "I wanted to like it. My BF and I stopped for a quick takeout lunch. The pickle was pretty good, it had a nice mellow bit of heat.The sandwich listed on the board that I wanted was discontinued but not taken off or at least covered up so I just made a quick choice and got the avocado one. The kale was kind of slimy and the toasted bread was burned and soaked in oil. The guy with the greasy hair never put in the order for the brat. I chose to pay and then wait for it but wished I hadn't. The chili had an odd sweet flavor and the whole thing was lukewarm. Considering how long I waited, it really should have been hot so I am not sure when or if it was cooked. The brioche sticky bun was dried out and kind of hard. I'm hoping it was just leftover from yesterday or something. I make my own brioche and understand it dries out if left out but this really was past its prime. I tried the grapefruit cookie and my first bite had a giant hair that had been baked into it. We brought it back and the guy asked if we wanted another one. Nah, I'm out. <br><br>I tried to like it but it's all getting chucked as soon as I get home. I also got a loaf of rye bread but I don't know if I really want to bother with it. It's a damn shame, I hate wasting food. I didn't bother asking for a refund, they can keep it. It was an expensive lesson but I learned it well.<br><br>Edit: the rye bread is overcooked and tough. I don't have the slightest clue what the little black seeds are but they aren't caraway and they definitely don't help with the burned flavor.", "pics": null}}, {"review": {"des": "This review is strictly for the bread; I didn't have anything else. I had journeyed here on a miserable 90-degree day after having heard that the baker here was award-winning and whatnot. I ordered a dark rye. The bread was certainly tasty: despite not being a sourdough, there was still a nice deeply yeasty flavor, and the texture was just right. The crust wasn't as crunchy as it looked, but that might have been due to the weather.<br><br>On the whole, though, the bread wasn't deeply exceptional compared to many other bakeries around Chicago. For a dark rye in particular, Bruno's on the South Side makes just as tasty a loaf (bit denser and less crusty, but deeper rye flavor) for about half the price, which makes it hard to really glorify Publican bread as at all unique.", "pics": null}}, {"review": {"des": "This review is just for their cookies which are AMAZING. I can only imagine that their meats and bread are just as spectacular. Also have a super well curated selection of condiments and dried goods for sale.", "pics": null}}, {"review": {"des": "OMG get the Avec Dates. Yes, you can find the recipe online and make them yourself. Who really wants to stand around and shove sausage into dates? Ain't nobody got time for that. Let Maurice and Daniel hook you up at the meat counter.", "pics": null}}, {"review": {"des": "As the manager of Xoco, I live with a dark secret: my addiction for PQM chicken parm!  Take it from someone who eats at least one awesome torta a day: the PQM chicken parm is a must have sandwich. As in, I must have one just writing this. I need one a week, at least.<br><br>I love that it comes with Deep River chips. They're made in Connecticut (where I'm from) and I can't stop eating them. The pickle is also top notch.  Get the chicken parm.  Everything else is amazing too, it's just...  Chicken Parm Is The Thing You Cannot Not Get.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/PJPL8duIMvaYm4wtWoFiTg/348s.jpg", "caption": "Chicken Parm"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/MA9aQFmJ2ZNPAwSiATDe4g/168s.jpg", "caption": "Mm mm... pqm bratwurst..."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/TDXfKtfHX6irkeTEKJ8DjQ/168s.jpg", "caption": "Delivery is an excellent option!"}]}}, {"review": {"des": "Service: 5 stars<br>Food quality: 5 stars<br>Cleanliness: 5 stars<br>Price: 4 stars<br>Ambiance: 5 stars<br><br>This place is billed as advertised. I was worried it would be a tourist trap but it was a laid back neighborhood type spot. The parm#2 is their specialty and it didn't not disappoint; however, the star of the show was the \"No Way\". If you don't eat meat, this sandwich is for you. It has a perfect marriage of flavors. <br><br>Lastly, end your email with the rice krispy treat!", "pics": null}}, {"review": {"des": "I was staying nearby next to the Publican, but didn't have the time to enjoy a sit down meal there. Enter Publican Quality Meats. When you enter the front door, you'll see a deli with a variety of specialty smoked or cured meats, and on the left, you'll see a small cafe with some communal tables and chairs. It's a fairly interesting offering they have, from soups, breakfast plates, to day-old cookies that they sell at a discount ($1).<br><br>The two times I visited on my trip were mainly for sausages and takeout sandwiches. I tried their \"Da Grinder\", which was a medley of salamis and cheese, on a French baguette. The meats were salty, toned down by the mildness of the cheese, all accented by the crustiness of the bread. Not too shabby. The sandwich came with a bag of Deep River chips and a pickle spear. <br><br>I also recommend getting the duck prosciutto and the green chile sausage. I wasn't exactly sure how to prepare them, but the cashier/host gave some good recommendations, and it turned out great. One thing I will have to say is that you should avoid the chicken salad. The chicken was a a bit on the dry side, and while they do use quality ingredients (radishes, homemade buttermilk dressing, and black chickpeas), the portion is also pretty small for $15. <br><br>Overall, the place is great for some specialty meats, or a high quality sandwich. I'll definitely be back to try some of the charcuterie or other toasted sandwiches they have to offer.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/sqBEud9P_ci-ERpG7xI3Iw/348s.jpg", "caption": "Pâté and prosciuttos"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/s2KGVELc20GpY0nr61EtRQ/168s.jpg", "caption": "sausages and pork products"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/7501ywJwD8CAPbpRSkahMA/168s.jpg", "caption": "Da Grinder"}]}}, {"review": {"des": "The meat here is so good! My group was waiting for the rest of our group and we couldn't be seated until everyone in our party showed up, so we were trying their free samples. I wish I knew what they were to recommend, but their meat on their sandwiches are pretty good. We all also got the iced black tea with unlimited refills as we were waiting. Once our friends arrived, my table got a variety of sandwiches, a breakfast plate, and a salad. My friend and I each split a salad and sandwich. I think the atmosphere is really nice and the service is really good (and the meat was really good on its own), but I couldn't feel too enthusiastic about the food. I tried a bite of everyone's and it just tasted like a regular sandwich (but maybe I'm not a sandwich expert). All the meals come with chips but you have to pay an extra dollar for mediocre fries. Would still recommend it because it's near Publican and if you're a noob tourist (like me and my friends) who didn't know you really needed a reservation there, this is a cute place across the street that'll serve you almost immediately.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/lHevI4rc43hHHWRCv12rhg/348s.jpg", "caption": "THIS FREE SAMPLE WAS SO GOOD"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/SbKulncTRthKHG8nRXoj9Q/168s.jpg", "caption": "split salad and gyro sandwich wrap thing"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/LTjvMJlswJT5kU4k98c8kA/168s.jpg", "caption": "basic breakfast platter"}]}}, {"review": {"des": "I may have found my favorite place in the world. I wish I lived in Chicago now just so I can eat here every day and get insanely fat. <br><br>Cute little meat and cheese deli with a restaurant in the back. Really brightly lit, and the staff are all very lively and friendly. They have meats in display like a usual butcher/deli, and sell them in bulk. Near the back is a fridge with refrigerated goods (frozen raw meat cuts, cold broth in soup takeout containers, and ice cream/yogurt/cold dairy products.<br><br>Little restaurant in the back is adorable - it looks like it came out of someone's pinterest. The menu is mouthwatering delicious and made me sad I couldn't eat everything. I ended up getting the 3 piece charcuterie set, which comes with three heaping portions of preselected meats, as well as pickles, picked red bell pepper, whole grain mustard, and olive oil coated bread slices. One complaint is that there wasn't really enough bread, but there is never enough bread so I guess I can't fault them for that.<br><br>I was too busy already eating to pay attention to when the server was describing the meats (shame on me). What I got though was a mild, thick sliced saucisson of some type, pork rillettes with fig jam, and some kind of spicy pate pressed with dried apricots, all in heaping portions. The sausage and rillettes were absolutely amazing. If I had to rank them the pate would probably come last, but that didn't stop me from eating it all and scraping the last bit off the board.<br><br>Would absolutely recommend.", "pics": null}}, {"review": {"des": "Staff is brilliant.  Kind, personable,  and knowledgeable. Went in for their renowned jerky. Was not disappointed even down to the packaging. Love the deli as well as the restaurant.", "pics": null}}, {"review": {"des": "After having a great lunch at Au Cheval, the bf and I wanted to try charcuterie plate at Publican Quality Meats. Since we were stuffed, we want to just have a quick snack. The shop is super adorable, with a huge selection of deli meats in the front, small shop with specialty goods, and a small sit down area in the back.<br><br>The Bf and I ordered the 3 item charcuterie plate, chef's choice. I believe he gave us a shredded duck piece with cranberry jam, head cheese, and another item i cant remember. The meats are served with a grainy mustard, sweet pickle, and a few pieces of toasted baguette.<br><br>I would definitely recommended this place for a quick bite or lunch. I saw some awesome sandwiches that other patrons ordered. A very chill place, nothing fancy smancy, great meat shop with lots of other specialty items to purchase. The staff are all very friendly. a 3 meat plate was around $20.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/HL9VXSWhtVzmbYhxMHUBiA/168s.jpg", "caption": "3 items cold charcuterie plate. Nom. The last one was head cheese."}]}}, {"review": {"des": "My boyfriend and I love coming here for brunch/lunch on the weekends. Everything we have had on the menu is delicious. Personal faves are the breakfast biscuit sandwich (add avocado), the shredder and the sticky bun (best in the city I think). The menu changes so frequently that you could go and never get the same thing twice. Everything is decently priced and no complaints about service - easy, no frills and great food. <br><br>Plus, the butcher shop is a nice compliment. Cheeses are reasonably priced with a good selection. We bought bacon-wrapped, chorizo-stuffed dates (the ones served at Avec) to make at home, and they were super easy to make and delicious!", "pics": null}}, {"review": {"des": "Paul Kahan, purveyor of such fine establishments like Big Star, Avec, and The Publican, can do no wrong in my book. Thus, I was already destined to enjoy Publican Quality Meats (PQM, for short), Kahan's salumi-slash-sandwich shop and Publican spin-off.<br><br>The closest proxy to PQM is Cochon Butcher in New Orleans, an ungodly good salumi-slash-sandwich shop that specializes in all things cured between two delicious slices of carb. Cochon Butcher is better than PQM, but I can't hardly think of another place I've liked better than the Butcher. In other words, putting PQM in a second-tier isn't an indictment.<br><br>My one issue with PQM is what appears to be a lack of communication between the two halves. PQM's sandwiches don't seem to take full advantage of the delightful charcuterie available to them. In fact, PQM's most well-known sandwich, the \"Return of the Gyro,\" stuffs its pita with braised pork belly, something more associated with Publican proper rather than PQM. Again, I'm not hating. This wrap is damn good, ranking amongst the best \"sandwiches\" I've had in Chicago.<br><br>The remainder of its menu is highly rotational, and maybe I just keep coming at the wrong times, but I'd love to see a muffaletta, a pastrami on rye, an Italian grinder, anything that's just simple meat, cheese, bread, and a couple condiments. Sure, a chicken parm sounds darn good, but that's not why I'm drooling puddles staring at your meat case, PQM.<br><br>OK, mini-rant over. Everything else about PQM is fantastic. It's a little jarring first walking in, inundated with meat cases with hefty price tags. Here's the tips. If you're getting a sandwich or prepared foods to go, go to the middle cashier directly. If you're picking out sliced meats, head left. If you plan to sit and dine, head right (or to the far end, depending on the door you've entered). Once that moment of zen has passed, you'll feel more relaxed.<br><br>For salumi orderers, there's plenty to choose from, but try to pick the stuff (labeled with PQM) smoked in-house. PQM has variants of just about everything under the sun, and I've never been disappointed by anything I've taken home. For restaurant-goers, somebody should get the Return of the Gyro, but from there I leave it to you. Like I said, my preference would be to get something with meat available at the butcher, but that's just me. Whatever you get, it will not suck.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/uMQNaZBMbwkZTz5gFRESqA/348s.jpg", "caption": "RETURN OF THE GYRO - braised pork belly, raita, escalivada, pea shoots and calabrian chili vinaigrette on griddled flatbread"}]}}, {"review": {"des": "Being a fan of the Publican, I came here for a Sunday brunch to start my business trip week ... and what a great way.  I saw this place last time I was in Chicago and thought it was quaint when I walked by it to the Publican.  Little did I realize that it has some of the best brunch and baked goods I've had in a long time.  Couple this with friendly and personable service and non stop refills on great coffee... oh my god, why didn't I do this the last time in Chicago!<br><br>We arrived fairly early on Sunday brunch so we had our pick of the tables but I do see the patio filling very quickly to enjoy the sun.  There is a bunch of inside communal tables and when we left, it was getting quite full.  The restaurant shares the charcuterie/deli and their storefronto so it can be a bit lively with a lot of people moving in and out but oddly enough, it never felt too loud or too congested like many of the other West Loop places.<br><br>Service is sooooo friendly here.  LOVE IT.  None of this pretentious eye rolling service that I've seen plagued several good places.  They're so knowledgeable about all the dishes and ready to recommend someone based on my interest and steer us in the right way.  They also share an infectious enthusiasm for their baked good which made me buy a few  that I didnt plan and WOW, i'm so glad. <br><br>We got the salmon club, broc wallbanger, biscuit sandwich, kale side, matcha rice crispy, and their version of the chocolate chip cookie.  Oh plus two bottomless intelligentsia coffee.  EVERYTHING IS GOOD.  Honestly.  The salmon was not overcooked and had a great smokeiness to it which was just enhanced by the bacon vinaigrette,  ... the bread ... oh the bread.  Forget what you think of spongey tasteless white bread... this multigrain bread was so flavourful.  A bit of natural sweetness with a touch of nuttiness on the crust... I can only imagine it from the whole grains and being baked till it had a nice thick dark crust to it.  Honestly... just come here for the bread.  Broc wallbanger was awesome for our veg who inhaled it, the biscuit sandwich was said to be the perfect breakfast sandwich anyone can think of... bacon, perfectly cooked fried egg on top of a soft and tasty biscuit!  Kale side was really good cause of the nice balance of citrus on it.  <br><br>Before you leave this place after getting some amazing food... stop by the baked good area and pick up at least 2 things.  You owe yourself to be amazed at their spin on some traditional childhood treats.  These are a little upscale but damn... it will make you reminiscence of the good old days while thinking \"I've been scammed my entire childhood not eating this.\"  My matcha rice crispy was ridiculously huge.  It was so good... the green tea gave a hint of bitterness, strong wonderful flavour of green tea but the marshmallow and vanilla (?) really balanced it out with a perfect sweetness to still make you smile.  It was that perfect gooey, chewy, and yet crispy texture that you want every time out of the oven.  Sooo goood.  As for the chocolate chip cookie... I didnt get to taste it cause the person said they would bit anyone's finger who attempts to take it from them.  They said it was so buttery and yet nutty (the whole grain flours I'm assuming) while the chocolate bits were large irregular and had a true dark chocolate flavour... none of the waxy fake chocolate chips that is in most bakeries. <br><br>So simply said,  truly one of the best brunch places I've been to and definitely would return... even if it's just for the baked goods!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/d7MMWVCpyB1auvRcWrAdLw/348s.jpg", "caption": "Broccoli salad ... It had a funny name on the menu but just get it.  Very good !"}]}}, {"review": {"des": "This place is a little gem: I love the butcher shop and all the food items they sell. Great, well thought out beer, wine, olive oil selection. <br><br>The 3 star review is primarily for the restaurant aspect of this place.<br>If I reviewed this a few years ago, it might have been a 4-5 star review.<br><br>Overall, to keep this short and simple: The food is phenomenal, seriosuly some of the best lunch dishes in the city of Chicago. BUT, ( I am not a huge stickler about cost) the prices are way too steap for the portion size. The sandwiches are extremely small and I never feel full. I understand that I do have an insatiable hunger in general, but the one thing I need out of a lunch is to feel like I had food to keep me going throughout the day. I either have to pay like 30-40 dollars and eat 2-3 dishes or I just leave super hungry. <br><br>If you eat like a little birdy, you would absolutely love this place because the food is honestly so good just way too small.", "pics": null}}, {"review": {"des": "Stopped by PQM for a quick lunch. Their soup was delicious and the sandwich was yummy too. Not too many options for vegetarians- but what they have are solid.", "pics": null}}, {"review": {"des": "Great selection of very high quality meats and jarred items. Oh yeah, great bread too!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/QdnF1Woca0up-nBLNq5s5Q/348s.jpg", "caption": "Boy vs baguette. He won!"}]}}, {"review": {"des": "Call me crazy but if I'm paying $28+/lb on some sliced meats & cheeses maybe I don't want the guy behind the counter to be super annoyed & bothered he's here. So disappointed and a terrible way to lead into my day. Thanks dude w/a beard (I think his name was kyle) for being awful & putting me in a bad mood. Maybe look for job where you don't have to help people. <br><br>3 stars for the yummy but too expensive meats/cheeses & the other people my husband befriended while we waited FOREVER for our sandwiches.", "pics": null}}, {"review": {"des": "I wish we had a place like this in MN!! It might be time for me to move...this place was that good!<br><br>The little restaurant is super cute, with a modern homey feel. There's community style seating which I loath. Half the time the people I'm next to are talking so loud it starts to sound like pigs squealing it's that annoying. However, I won't let that take away from the whole experience, it was that good. <br><br>My boyfriend and I decided to split Gerry's Adobo Sausage, and the Cold Charcuterie plate. I will never forgot how f'ing delicious my first bites were of everything we ordered. <br><br>The adobo sausage came on a lobster bun, some pickled cauliflower on the side. The sausage wasn't overpowering, it was a perfect balance with the bun and toppings. Intense flavors, but none were competing. <br><br>Of the charcuterie, all 5 were phenomenal, but the lamb roulette, and pate were to die for. I could have eaten it all without a bread vehicle, just meat all in my mouth. <br><br>I wish I remembered what our servers name was because she was amazing. She was friendly, quick, and helpful with the menu. Our waters were always topped off by the busboys. Everyone working there seemed to really enjoy it, that's always great to see. <br><br>I also have to mention the bathrooms were in the basement, that usually creeps me out. These were not at all creepy. Bright, modern, and clean. Bonus, you see the kitchen at work downstairs, super cool.<br><br>Whenever I make a trip to Chicago again I will always make a stop here.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/jTMapkYN8_59bUpjXnstdQ/168s.jpg", "caption": "Gerry's Adobo Sausage."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/eKrQ9-O4N7N1JrWsgnAcdQ/168s.jpg", "caption": "Charcuterie!"}]}}, {"review": {"des": "So I checked this place out because my foodie buddy told me to. I got the Big Dipper sandwitch and it a ginger beer. They Sammy was very flavorful and I liked the bread they used. I liked the ginger beer it was a brand I had never tried but it is one I would order again. The only downside was the sandwitch was a little small. The environment was really cool liked the deli/ open style seating. The staff is very friendly while still be professional.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/USO3RWUPcX6DeBQ_3V3GuA/348s.jpg", "caption": "The Big Dipper"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/G32CBk6Ey0w51b_jShUvSg/168s.jpg", "caption": "Ginger beer"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/XjJfuZTSdncFTUOnl3iSig/168s.jpg", "caption": "Proof"}]}}, {"review": {"des": "Visited here a couple times now, first late Sunday afternoon and then a little before noon on Sunday. First time missed the porchetta sandwich only available on Saturdays and Sundays after noon but happily ordered The Big Dipper (sweet and spicy braised wagyu brisket, green garlic aioli, radish, jalapeno and snow pea slaw on ciabatta bread). It was very satisfying. The meat was well cooked with a savory combo. We also had the Turkey Slam, fairly basic but enjoyable as well. The pasta salad and kale sides were also refreshing and plentiful. The second time we saw the porchetta come out steaming and we ordered two sandwiches. The first bite was what I anticipated and expected. Nice fattiness and savory and juicy. Pairs nicely with the ciabatta. Delicious delicious sandwich. A must get if you're lucky enough to get before it runs out. The atmosphere and staff is also really relaxing and enjoyable. Great music. Attentive bus boys/girls and the kitchen staff holds the same integrity of their service as they do with the product. The coffee brewed is also Intelligentsia. They make a proper cappuccino/latte. Really looking forward to try the chicken parm sandwich next!<br><br>-Order up with a smile", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/5FiTwK9kQcxsOqahZTYjDw/348s.jpg", "caption": "Porchetta Sandwich - A must get on a Sunday"}]}}, {"review": {"des": "Came here for lunch today and had a cocktail the charcuterie board and a beer. I was presented with the bill as soon as I ordered my beer I found this odd. Later that afternoon I experienced furious gastrointestinal upset accompanied by heavy-duty diarrhea. I'd like to come back but I think I have PTSD.", "pics": null}}, {"review": {"des": "Food delicious <br>I had the chicken salad with the buttermilk dressing on the side. The lettuce was delicious but I had to do a lot of cutting and work.<br><br>The cheese plate was also quite good and the pickled cherries they serve with are as my friend said \"so good I would eat a million of them if I could\"<br><br>Chicken parm sandwich was also amazing.  <br><br>Our waiter, Mitch seemingly wanted nothing to do with us after I innocuously asked for a carafe of water for our table. He said he couldn't do that, okay. Then did it and we drank the whole thing. Brought the check without ever checking on us, I did want another drink but ok, message received. -1 and really probably -2 for service but I'll round up.", "pics": null}}, {"review": {"des": "This place has the service of a Wendy's in Terre Haute. They sat us outside on their patio and took our orders for drinks and food. They didn't notice we had our small dog under the table on a leash and after offering him water they came back and demanded he be tied to a tree on the sidewalk. So now I am wishing I wouldn't have sat down and ordered and because my experience is ruined. I don't need to bring my dog everywhere I didn't even want to really but we had him, they sat us and took our orders. Then they kicked our dog out and ensured this is the last time we come here.", "pics": null}}, {"review": {"des": "The pumpkin spice Rice Krispie treat is amazing and itself worthy of 5 stars. The flavor profile is unconventional but works very well and the treat itself melts in your mouth. One of the best things I've tried recently! Definitely get it if you like pumpkin spice flavors.", "pics": null}}, {"review": {"des": "I really want to love PQM, but I just can't get to a far star rating. I love everything about what PQM is trying to be - the butchery, the sandwiches, the groceries, etc.<br><br>Unfortunately, I do not love the pricing for the quality of the products. There is a huge mark-up on all of the groceries sold there. For example, a Michigan peanut butter was being sold for $10.99 - I bought the exact same one a few weeks earlier for $4 at Meijer. Next, their sandwiches, while they taste ok, they are pricey. For example, for $15 (with tax) I got a turkey sandwich that looked very sloppy, and was nothing more than a small amount of turkey, cheese, mayo, and some veggies on toast.<br><br>Overall it's a really great concept with OK products, but too high of pricing to make it perfect.", "pics": null}}, {"review": {"des": "Leave it to me to come to a place with Quality Meats in the name to fall in love with a veggie sandwich. Well I did and I know it sounds weird, but in my opinion The BEET L.A.T. is better than anything here made with beef, chicken, or fish. And that's coming from a meat-a-tarian. <br><br>It's the purple stuff, bibb lettuce, avocado, pickled green tomatoes, aioli, sprouts <br>and smoked cheddar on multigrain toast. Paired with an amazing marinated kale salad and it could be one of the best vegetarian lunches in town. Of course living up to it's name anything made with meat is pretty quality here too. <br><br>The ordering process is full table service which is kinda different for a small little sandwich spot, but I guess at over eleven bucks a pop it's worth sitting down and enjoying with one of the several beers they have to pair with.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/cVE6O8dz60fm-QM09XHbKg/348s.jpg", "caption": "Beet sandwich"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/BrfaRcSwOROnXOYrjrhobg/168s.jpg", "caption": "The shop"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/0LzI6vilyo2kJ_3F1-y5zQ/168s.jpg", "caption": "The cooler"}]}}, {"review": {"des": "I ordered 15 sandwiches for a work event and accidentally got the Piri Piri turkey. This was the best accident of my life. Everything is so fresh and delicious.", "pics": null}}, {"review": {"des": "Love this place!<br><br>Get a nice lunch before and early Hawks game of a cheese plate and a Charcuterie board.  Bring along a cooler to take home some excellent sausages or steaks.<br><br>I've had cheeses from there you can't find most other places, same with the deli meats.<br><br>Any person that would crave the butcher shop of the \"old days\" needs to have a visit here just to remember how much people used to care about this dying art.<br><br>Outside there are several tables and its a great neighborhood to chill out.<br><br>Inside there are great mustards, pickles, awesome breads to choose from.<br><br>All of the help that have served me the times I have been there, have been very friendly. :)", "pics": null}}, {"review": {"des": "What a cool spot.  You can get coffee, sandwiches, little gifts, gourmet food, local yocal stuff, etc.  I liked it.<br><br>Rec from a friend for his fav sandwich ever.  MMMmmm, pretty damn good.  This sandwiches in general are a little upscale.  I really enjoyed everything we got.  However I have to say, some sandwich people are interested in fro-fro sandwiches.  Its like sending someone that loves Walmart to Bloomingdales...they will not love it...maybe like it.  <br>I loved it.  My husband liked it.  My husband loves Bari...", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/eEqGGsgX73bFKPag0cixVg/168s.jpg", "caption": "Almost famous"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/uPn8xpSvwshaSTvpkK_5nA/168s.jpg", "caption": "Beatrix!!!!"}]}}, {"review": {"des": "First stop in Chicago, and I was immediately impressed! I originally wanted to go to The Publican, but accidentally ended up at this location without knowing until I had sat down. Since I was already looking at the menu, I decided to stay here and see what Publican Quality Meats had to offer!! <br><br>Because it is a meat shop, we decided to order the three types of charcuterie for an appetizer. We got the coppa di testa, duck rilette, and pate, and the dish came with different types of mustards, pickles, peppers, and bread. The rilette was surprisingly fantastic, and the bread was toasted and drizzled with olive oil. Preparation and care into their food is obviously seen, and this was the perfect start to our meal.<br><br>For my entree, I got the Butcher's breakfast which includes sausage, bacon, bread, two sunny side up eggs, and chorizo? hash. Everything was a little on the greasy side which is expected as it is bacon and a bunch of meats, but it was amazing. The sausage was so flavorful, and the chorizo hash had soft potatoes and crunchy bits with a hint of meat in the taste. So good. The plate was overall very well structured, and I surprisingly finished everything on there. I also tried my friend's chickpea soup which was good, but nothing extraordinary.<br><br>This location really does serve quality meats, and it surpassed my expectations! They had a ton of options to buy meat and spices at the front, and if I was a Chicago local, I would totally buy their meats to take home. If I do end up coming back to Chicago, Publican is next!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/bDiKkLgbFfaSrl4fCUk8RQ/348s.jpg", "caption": "Chick pea soup"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/nvWoWiOSRABiiHJ-3yO7tQ/168s.jpg", "caption": "Birds eye"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/iMoSx8hEcJtO-mHsjYqtog/168s.jpg", "caption": "Red lentil stepchild- falafel"}]}}, {"review": {"des": "I could probably eat here everyday and be satisfied. Unfortunately, it is only open till 6PM - so I am usually rushing home from work to pick up dinner.  <br><br>I am a frequent diner here on the weekends. They change the menu frequently and everything I have tried is delicious. Get a table outside during the summer and order a Bloody Mary.<br><br>Don't forget about the butcher shop on the way out. They sell the choirzo, bacon wrapped dates from Ave. ALSO, grab a pint of the Hello My Name Is Ice Cream from the freezer - you won't be mad.", "pics": null}}, {"review": {"des": "Let me just say first off, that the food was very good and the atmosphere was enjoyable. I am glad I gave this place a try!<br><br>I am a bit confused as a first time customer, however. When I came in with my children (who eat nearly everything), we looked at the deli meats and knew that we wanted roast beef sandwiches, mine without bread. When we talked to the girl at the counter, she seemed a bit confused and mentioned that we could sit in the dining area and order.<br><br>When we ordered in the dining area, I asked for roast beef only with horseradish sauce. She didn't seem very sure about it but then said she could bring a plate of it, no problem. When my daughter ordered a roast beef sandwich that was not on the menu, it seemed to cause some confusion. My daughter, the ever loving negotiator, simply asked that if she went to the deli and ordered a roast beef sandwich, if they could make it and asked why they wouldn't be able to make it for the dining area. Ugh. Eventually all was figured out and she had a plate of roast beef, cheddar wheeze, lettuce, salami, and sourdough bread for a DIY sandwich plate, but it was strange to not be able to order simple things that were clearly in the deli, in the dining area.<br><br>At this point, my son decided he wasn't going to eat...<br><br>All of that aside, I would definitely go back for the deli meats and some of the goodies in the refrigerator. Maybe we'll take it home. ;)", "pics": null}}, {"review": {"des": "Great place to grab a sandwich or shop for gourmet ingredients. Definitely recommend this for lunch.<br><br>FOOD<br>Vinny's Turkey (5 stars): Soft and juicy meat. Loved the tomatoes on it! <br><br>Kale salad on the side (4 stars): garlicky, good dressing. <br><br>Spicy pickle (4 stars): Yum.<br><br>Cowboy Cookie (3 stars): Couldn't taste all the yummy ingredients listed in it like pretzels and potato chips. The cookie was still good though but it needed to be softer. <br><br>SERVICE <br>All of the workers here were extremely nice! We had to catch a flight soon so they asked what we wanted to order before we sat down and by the time our seats opened up our food was ready! They really care about your experience here. <br><br>ATMOSPHERE:<br>If I lived here I'd probably buy all the meats, cheeses, pastas, and sauces here. It all looked and smelled so good! They have large long tables and basically sit everyone together. Surprisingly it wasn't weird at all to sit next to people you didn't know. You're too happy with your food to even pay attention to others, haha.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/R8W4J8hihy1BkLRP94o_nQ/348s.jpg", "caption": "Turkey with side of kale salad"}]}}, {"review": {"des": "Girlfriend took me here for Saturday brunch to show me her workplace for the summer :) We sat outside in the small patio area along the side of the shop, it was a beautiful day to soak up some sun. We ordered a couple dishes to share: the porchetta sandwich, a hot charceuterie plate, and also a side of fried eggs cause we really wanted eggs :P I had a Kyle's go juice to go with my meal (coffee drink). The go juice is made with coffee, espresso, honey, and angostura bitters. <br><br>The porchetta sandwich was absolutely phenomenal; it's served only on Saturdays after 12. We saw the butcher bring out the entire roast on a large cutting board. The meat is juicy, succulent, and tender. The sandwich is served red onion, pickles, aioli, mustard on a ciabatta bun. The porchetta portion was huge! We had difficulty keeping the sandwich together while eating it. The onions and pickles gave it some acidity to help balance out the fatty delicious meat. Comes served with a side of chips. The charceuterie plate was comprised of 3 types of house-made sausages served on a bed of red peas, pickled cabbage and mustard. They were all delicious; but my favorite was probably the cajun blanc sausage followed closely by the cajun boudin. I forgot what the other one we had was called :/ It all ate quite well with the peas and pickled cabbage and our fried eggs :)<br><br>I would absolutely recommend PQM to anyone looking for a casual, delicious meal. Their meat and cheese selection from their shop is excellent and they also sell baked goods as well. They have a small grocery section that sells some nice preserved goods and even select wines and beers. Would love to come back and try more of their delectable offerings.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/FOMgXXKmEOUrvLkaJJuOmQ/348s.jpg", "caption": "Hot Charceuterie Plate with Side of Fried Eggs and Kyle's Go Juice"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Mx_yrKrbJSl-njleqwT3cw/168s.jpg", "caption": "Hot Charceuterie Plate"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/PctDAs4L57zUEqLzKzq3_w/168s.jpg", "caption": "Porchetta Sandwich"}]}}, {"review": {"des": "Amazing burger night is what we had last Weds when we went to dine at this fabulous restaurant. We did a walk in put in our names and got a table within 15-20 minutes wait. The staff was super friendly and nice we tried their traditional pub burger which came with fries, yay! I loved their caramelized onions in the burger with this special sauce they do that tasted a little mustardy and sweet. I loved it I think they make an amazing burger. It was a very tasty burger. I would recommend everyone to check this place out for a great burger night!", "pics": null}}, {"review": {"des": "I was quite impressed with this place and very glad my wife and I made a stop here while visiting Chicago. <br><br>The place is basically a deli with some tables and waiter service. We came here for a super early lunch -- I'm talking 10AM --  almost a late 2nd breakfast. There was hardly anyone here and we got seated right away. That's a good thing, because I hear this place gets pretty packed around noon.<br><br>We shared the pork belly gyro and the Cocido (mixed meat pot) for two. Both of these were very flavorful and unique from anything we ever had. The bread which they serve with the Cocido is so damn fresh and seems like they baked it in house, though I'm not sure about that part.<br><br>The atmosphere was really casual and, best of all, not pretentious at all. The waitress was very friendly and efficient. The food was delicious and had a \"home cooked\" feel to it.<br><br>If you come here, be sure to check out the downstairs kitchen. You can see the chefs grinding up meat and preparing sausages from scratch. They're extremely friendly and willing to explain what they're doing. So awesome!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/gxJlszWuHSnNzzUl-iBwEw/348s.jpg", "caption": "you can see the chefs hand-making the sausages in the downstairs kitchen!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/4WegzwmFvJcC7w5ghTJefQ/168s.jpg", "caption": "dry aged ribeyes"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ov7SGpRXJdqRauUCphRueg/168s.jpg", "caption": "A delectable assortment of house made sausages"}]}}, {"review": {"des": "Few days before coming to the Publican quality meats, my uber driver told me that he used to work here. C.O.O.L. He told me how wonderful this place is and how he loved grabbing a Parm#2 or a big dipper before he got off work. <br><br>I definitely believed him as I spotted the \"Humboldt Fog\" and the \"Midnight Moon\" by Cypress Grove Chèvre (CA) displaying in the cheese fridge. Both are one of the finest cheese I've ever tasted.<br><br>So I ordered<br>THE BIG DIPPER: sweet and spicy braised wagyu brisket, green garlic aioli, radish, jalapeno and snow pea slaw on ciabatta bread (4/5):<br>The flavor of my sandwich was undeniably rich. The side kale salad it came with was amazing as well. I have only one complaint: the brisket and the bread were both of the hard side. Painful to chew for someone with a disjointed jaw (like me).<br><br>note: I normally would not order a sandwich anywhere I go, but since the Publican Quality Meats is famous for its sandwiches, oh well. Gotta sacrifice.<br><br>Service was fascinating. The people working here are so friendly~ They come around and fill up your glass of water v often. Hurray.", "pics": null}}, {"review": {"des": "Cute brunch place. Seating wasn't difficult to find on Saturday morning. The hostess and waiter were both very friendly and accommodating. Charcuterie was tasty with chef's choice of meats. Quiche was some of the fluffiest I've ever had in my life. Definitely would order that next time. Super awesome hash browns - so crisp on the outside, so creamy on the inside.", "pics": null}}, {"review": {"des": "This was quite the fun stop on the way out of the neighborhood, after having breakfast at the publican across the street.<br><br>Upon entering you are greeted by some very knowledgeable folks behind the counter, and some cases filled with absolute delicacies as far as me to go. They had a lot of porcine options, including a ton of different ways to serve sausage. The guys really knew their stuff, and it was fun to listen to the different types of sausage and how each one was made.<br><br>The cuts of beef looked excellent and there were also some lamb options.<br><br>The back wall contained tons of cooking supplies, spices, books, and plenty of other kitchen pleasantries that would make for great stocking stuffers. Absolutely worth checking out if you're in the area.", "pics": null}}]}