{"name": "qing-xiang-yuan-dumplings-chicago-3", "reviews": [{"review": {"des": "Probably one of the greatest dumpling spots in Chicago! The staff here are both knowledgeable and patient as they will go over all dumpling options and give you an honest opinion and recommendations on what to order based on your tastes. Dumplings were great quality and got me and my friends definitely interested in returning more frequently! If you are looking for a dumpling a great dumpling spot in Chicago, look no further!<br><br>You know there's quality in Chinatown when you have to wait 30-45 minutes for a seat and there are still people behind you. This restaurant is definitely worth the hype. The restaurant has a great ambience with the decor, iPad menus, and mobile payment methods.", "pics": null}}, {"review": {"des": "Best dumplings in town. Suburtb they have the king, Katy dumpling house which is same or higher bar to this place.<br><br>I went this place more than 10 times with friends had dumplings before and never had dumplings before.<br>The recent two times, I thought I could take a try to intruduce dumplings to some of my friends. All my friends admitted that the food is fantastic there but the services really bad.<br><br>One of the items we ordered had never been given to us until we asked for check about 1.5 hours later. In between, we asked them twice about the missing item. They said it was coming. They brought the check and a the same time, brought us the item. Excuse me?<br><br>They handled the situation badly. I have never seen a restaurant handled their mistake like this. We liked their food. And I introduced dumplings to my friends as they never tried that before. It's embarrassing for me also. If there is other place offer the good dumplings, I won't go this place any more and will tell people I know, please skip this place.<br><br>For the ladies, you would be fine and they treated ladies always good. E.g., my friend and I went there, they gave us the only two available seats just in middle of groups of people. They gave the 4-seat table to the two grils just behind us. <br><br>Normally I select resturants after making sure their food is good and left them 4 or 5 stars. For this time, 1 star is only for the food, services mgiht be sub zero.", "pics": null}}, {"review": {"des": "Finally a great dumpling spot in Chicago. The place is pretty high tech with iPad menus, Square payments, and electronic QR seating lists. I thought it was pretty cool. The decor is pretty simple and bright. I didn't think the seating was too comfortable because the chairs were clunky and the table was like too low. <br><br>We got four plates of 12 dumplings for four people and thought it was enough. If you are pretty hungry I would aim for 18-24 dumplings per person. We went with the pork and cabbage, beef and coriander and shrimp dumplings. They all tasty really fresh and hot. Work on your chopstick skills so that you don't puncture a hole and lose all the soup! There are four ways you can have them: boiled, steamed, fried and frozen. I thought the boiled, steamed and fried were all good. Make sure you use vinegar. It totally enhances the flavor. My favorite is the steamed. <br><br>I would definitely recommend this restaurant! There are all Asians in the kitchen so you know it's good!!  The dumplings are really good plus they are about $10 for 12 which I thought was pretty reasonable. In addition they came out super fast and you can just down them! The place is BYOB So he prepared because we weren't. I didn't do my hw before dining. Oops", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/h83zXvU0ojamO0Tfo0FOWw/348s.jpg", "caption": "Boiled Pork and cabbage"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/l9S__HoenHQP5O0ioGX5tQ/168s.jpg", "caption": "Steamed beef and coriander"}]}}, {"review": {"des": "So far this is the best Dumplings place I tried in town: you have a huge list of dumplings garnishment from pork to lamb and the choice to get them boiled, steamed, fried ... the menu is displayed on iPads. <br><br>If you want to get juicy pork and cabbage dumplings, go for the boiled one. I recommend to get the chicken wings in apps, as well as the cucumber salad: these wings are marinated so well, you just want to keep eating them all ! The salad is also good ! <br><br>The spot is very cute, you don't have too many seats but it feels cozy inside. You can also watch the crew making the dumplings ! The service was great too, our waiters gave us good advices, I'll go back for sure", "pics": null}}, {"review": {"des": "The interior and the ordering process is very modern, but also very simple. The menus are on iPads and are easy to coordinate through. The Interior is brightly lit and very simple and clean.<br><br>Because I came with a group of 4 on a Monday afternoon around 3 the wait was not bad, but generally when I pass the resturant it seems very crowded. <br><br>The dumpling we had several different types from fried to steamed. I can honestly say the soup flavor inside for these were amazing. Cautious cause they were a little hot at first when biting into them. I can say the fried dumplings had an interesting texture where only one side was fried, but the other side was still steamed like. <br><br>The lamb skewers had a slight spice taste, but we're super chewy bursting with flavor. Would recommend.<br><br>Overall I was very pleased and would come back to try again.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/KjFGeYUa4KP0n8fOQ9r1pQ/348s.jpg", "caption": "Steamed"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/BjUzzwfqXHc-UcZDdKBnWQ/168s.jpg", "caption": "Steamed lamb"}]}}, {"review": {"des": "If you love dumplings, this place is a must! We had a party of four arrive on a Sunday afternoon with a 30 minute wait. For an asian restaurant, this place is very modern and chic. Even their napkins are made from cloth with the restaurant's name embroidered --very fancy. Despite that, QXY is a hole in a wall spot with yummy dumplings.<br><br>The menu consists of a variety of meat and veggie combinations for the dumpling. To be honest, it was really overwhelming. There must've been well over 50 types of dumplings with your choice between pork, beef, chicken, lamb, shrimp, fish, and veggies paired with an even larger selection of veggies. Thankfully, my local friends did the ordering, but most of the types of fillings tasted similar to me. The one thing that makes a difference is the way the dumplings are being made. You can choose from fried, steamed, and boiled and from an order of 12 or 18 in a range of $9-13 per plate. Even though I'm usually a fan of fried dumplings, the boiled ones were my favorites. All of the dumplings were so juicy, so be very careful when trying to pull them apart. Because of this, the boiled ones were also easier to split than the fried ones.<br><br>We also added the Hot and Spicy Bowl ($11.99) just to try since the skewers didn't seem quite worth it. This dish is essentially a bowl of meats and veggies soaked in mala sauce, which is a popular oily, spicy, and numbing Chinese sauce which consists of Sichuanese peppercorn, chili pepper and various spices simmered with oil. The dish was something interesting to try, but don't think I'd get it again though.<br><br>There's no surprise that the dumplings are amazing here as a restaurant that specializes in one item on the menu. They have perfected the art of the dumplings in the simplest way. For about $15 per person, it was a pretty good meal. In addition, I liked that they easily split our checks which made paying super easy.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/fgb-52c_4KxsJNe28c_aAA/348s.jpg", "caption": "Fried Dumplings."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/D2IFcqM34QB39ZgHoUJ_ZA/168s.jpg", "caption": "Hot and Spicy."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/rq2xfK7MQB0VbzEMizYBSA/168s.jpg", "caption": "Fried and Boiled Dumplings."}]}}, {"review": {"des": "By far the best dumplings I've had in the midwest!<br>After spending a few months in Asia, I couldnt find anything close in the area taste wise. However, QXY made me feel like I was back there. The dumplings are fantastic, and paired with the perfect tea if you ask your server for recommendations. <br><br>We went around 2pm, and waited about 5min (max) before getting a table which was completely fine. <br>Service is very smooth, with multiple servers making sure you are enjoying the experience. <br><br>I would recommend this place to anyone who loves dumplings!", "pics": null}}, {"review": {"des": "There's a reason there's always a super long line to get a table at this place...<br><br>I actually heard about this place from a friend on a whim, and decided to check it out. Honestly, I didn't even know what type of food was served here, but once I set foot in the restaurant, I was hooked. In what is actually a fairly small dining area, Qing Xiang Yuan has an incredibly clean and neat layout of tables that transport you to a dumpling KINGDOM. Here, you can order all sorts of different types of dumplings. Chicken, beef, pork, lamb, the list goes on and on. To add a further twist on things, you can mix and match the types of how the dumplings are made. Fried, boiled, or steamed? All are great in their own way. My favorite is the steamed style dumplings, because they're really reminiscent of xiao long bao and have a strong brothy component to them once you bite in. The actual dumplings are fairly small, but overall are priced well. <br><br>I've already eaten at Qing Xiang Yuan several times, but am looking forward to my next adventure here!", "pics": null}}, {"review": {"des": "These are probably the best soup dumplings I've ever had. I came with a friend, and we ordered beef and onion (our favorite), beef and coriander (second favorite), and green pepper and egg dumplings. We got the beef and onion dumplings fried and the others steamed. Both ways of cooking were absolutely delicious, and I really enjoyed the beef dumplings. Honestly, I found the pepper and egg dumplings to be bland. <br><br>One thing I love about this restaurant is the fact that they have soup dumplings that do not have pork broth. They even have some vegetarian dumplings, which is rare.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/6wCMivx9Ctm9QDYxrKbhlw/348s.jpg", "caption": "Steamed dumplings"}]}}, {"review": {"des": "These are some of the best dumplings I've ever had! The restaurant is tucked away on the outside of the new part of Chinatown. From the service to the cleanliness of the restaurant to the quality of the dumplings, the experience was awesome. <br><br>We ordered 3 types of dumplings to try all of the preparation styles: boiled, fried, and steamed.  <br><br>1. chive, shrimp, and pork had these boiled <br>2. beef & onions: had these steamed <br>3. lamb and coriander : had these fried and they were so light and fluffy. <br><br>The broth inside all the dumplings were so flavorful and complex. I did wish we had spoons to catch all the broth, as a lot of it ended up on my plate. We also tried the hot and spicy pot. This consisted of a bunch of veggies and tofu in a spicy (non-drinkable) broth. If you aren't a fan of spicy food, DO NOT ORDER THIS. But for those of you who are like me and enjoy the heat, give this a go. \"Normal\" spicy level means very hot. We loved it but it isn't for everyone. <br><br>The service was phenomenal! Our food came within 10 minutes of ordering. Everything was extremely fresh and pipping hot. <br><br>This is a must try if you like soup dumplings!!<br><br>****Side note: The iPad as a menu is overthinking the whole ordering experience. I could see if you were actually ordering through the iPad, but I couldn't get past the super dirty screen. The idea of interacting with technology just to view the contents of the menu isn't necessary.", "pics": null}}, {"review": {"des": "I had read about this place in a travel magazine, checked out the website (which is very nice, by the way), and decided to go. My husband and I went there this past Friday evening and got there around 5pm. It wasn't crowded yet, but the place isn't big so I'm guessing it gets crowded a bit later. We took the red line and got off at the Cermak-Chinatown stop. It was about a three block walk. The restaurant is in a mall-type place.<br><br>The servers bring tablets to you to view the menu and this is also what they use to place your order. I noticed that the restaurant was very clean. My husband and I didn't like the chairs or tables, though. The chairs are deep and so I had to sit in the middle to reach the table as the chair can't be pushed under the table. My husband had difficulty getting his legs situated. The tables are small. This is something I really have experienced at other restaurants. They do have pillows to sit on the wooden chairs but being that the way the chair and table was designed, it wasn't much help.<br><br>We each ordered 12 dumplings. Me: mushroom and zucchini, my husband: shrimp, leek and egg. The dumplings were hot and the broth inside was so tasty. You can order the dumplings fried, steamed or uncooked. We ordered ours fried. I would suggest if you are very hungry to get the 18-piece dumplings or any appetizer with the 12-piece dumplings. There is a huge selection of flavors that one can choose for the dumplings.<br><br>They had a nice selection of teas so if I'm there again, I'll probably check them out. The dumplings with tax and tip ended up being around $35.<br><br>The cool thing was, you can actually see the dumplings being prepared through a window at the back.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/GQrN6b0yp-98bzdRuk-BIw/348s.jpg", "caption": "mushroom & zucchini and shrimp, leek & egg dumplings"}]}}, {"review": {"des": "Delicious dumplings! <br><br>This quick, casual stop has a menu full of various dumpling options. From classics (pork & cabbage, chicken, etc) to more unique options (lobster, sea cucumber, lamb) the menu truly seems endless.<br><br>We were happy with all of our orders and definitely want to come back to try more options a try. <br><br>It is BYOB, but call me traditional... I do prefer tea with  my dumplings.", "pics": null}}, {"review": {"des": "This is the holy grail of dumplings. <br><br>Welcome to my new favorite Chinese restaurant in Chicago. At an extremely affordable price of $13 for 18 dumplings pieces, you will have a life changing experience of delicious dumplings and a possibly burnt tongue that is totally worth the injury (careful, the dumpling juice inside the dumplings are extremely hot if they're steamed!!!!!) <br><br>I've tried just about half of the dumplings the offer here, and I can recommend that the steamed and boiled dumplings are the best (it's the traditional Chinese way). For the steamed versions, I recommend the beef or lamb with coriander/dill (coriander is my personal favorite). For boiled, I would go with any of the pork or beef dumplings. <br>If you really insist on fried, I would go with the chicken or pork.<br><br>If you want to make a delicious dipping sauce for your dumplings, I would recommend mixing a bit of Chinese chili oil with the soy sauce - at least that's how I do it :) <br><br>Service is friendly, the food comes very fast, the restaurant is high tech with iPad menus and a nest thermostat, and you can watch the staff make dumplings through the kitchen window. Definitely make a visit here - you won't regret eating authentic, Chinese dumplings", "pics": null}}, {"review": {"des": "We came here for a second brunch because there's too many good restaurants in Chinatown to just go to one.<br><br>QXY specializes in dumplings, and they use a thinner dumpling wrapper than most places. We recently noticed that they've been expanding their menu to include some small plates and skewers as well. In short, we've been back to this place a lot. <br><br>Overall, QXY has some of the best dumplings out of the dozens of dumpling houses I've been to. Be warned that there is often a long wait! I highly recommend exploring the menu! <br><br>This time, we ordered the following: <br>1. Steamed lamb and cilantro dumplings: AWESOME. The texture was perfect and the dumpling itself is super juicy, almost like a soup dumpling. Be careful how you bit down or you might dribble juices onto your plate. We've been to a lot of dumpling places around the country and this is the only place where we've found the lamb/cilantro combination. It's definitely a favorite! <br>2. Boiled shrimp, pork, and leek: PRETTY GOOD. I'm not a huge fan of the shrimp texture in this form but the folks that dined with me enjoyed this one a lot. It's not as juicy as the lamb, and I probably won't order it again.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Gg4eRLlP1KwuKOJ9Fl3BLw/168s.jpg", "caption": "Lamb and coriander - the best!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/E7Amms1yddu1eYqa_pXljQ/168s.jpg", "caption": "Shrimp pork and leek"}]}}, {"review": {"des": "This is probably my favorite dumplings place in Chinatown and I have been to several. The restaurant opens at 11:30, we reached at 11:20 and there were 12 people in line already, so that should tell you how popular this place is. <br><br>We got the Chicken and coriander(steamed), beef and onion(fried) dumplings and they were amazing. Chicken coriander one was so flavorful and it felt healthy to eat those. I got fried beef and onion and ate them with copious amounts of chili oil and they were fabulous. The smallest portion gives you 12 dumplings which is a lot, but this is the place you go to with 3,4 of your friends and share your dish like all other Asian food. My friend also got Sweet Pear juice, which was yum. <br><br>I liked the service too, they were courteous and nice. In spite of the rush, our order came in less than 8 minutes for the steamed and 10 minutes maybe for the fried ones. <br><br>I highly recommend checking this small place out if you like dumplings.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/XtFOlHNQX8qQLjcyVzuZDQ/168s.jpg", "caption": "Chicken and coriander"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/q64w0ivAxc1_lGMZ3DsP1g/168s.jpg", "caption": "Chicken and coriander dumplings with chili oil"}]}}, {"review": {"des": "I came here for the first time a couple of weeks ago. Every time I have passed by this place, it's always packed with a line out the door. I decided to that I had to check it out. Of course, there was a wait when I checked in at the front desk. Fortunately, I was a single diner, and so did not have to wait too long. I was done and pretty much on my way when the group of five (I believe) who was already waiting before I got there got seated to eat.<br><br>The menu is pretty basic... dumplings! You can get a variety of them and get them steamed, boiled or fried. I got an order of boiled pork and leek dumplings. One can also get sides or small plates of other items. But don't expect a full-on Chinatown restaurant menu. Speaking of menus, they provide you with a tablet with the menu loaded along with pictures. I would say the pictures are pretty accurate of the food items (unlike say, Burger King :-P)<br><br>The service is pretty quick. Food comes out about 10-15 minutes after ordering. Since there was a wait, I did not feel comfortable ordering additional items. You may want to consider ordering as much food as you think you can consume at once. I wanted to try some other types of dumplings, but opted to do so next time around.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/NQxrN5WJ8DAuvro08mp0DQ/168s.jpg", "caption": "Boiled dumplings"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/t1Tge_2qSM7dHtyeb-h9EA/168s.jpg", "caption": "Braised beef with brown sauce"}]}}, {"review": {"des": "The dumplings here were good and very tasty. However, in my opinion, I felt like they were a bit overpriced. <br>This place does offer a variety of different dumpling flavors (pork, shrimp, leek, lamb and coriander, and beef and oinion). We ordered the pork, shrimp and leek. Overall this place was very clean, people were friendly, and wait was customer friendly. This place is easily accessible off from the water taxi.", "pics": null}}, {"review": {"des": "BLUF: Delicious Chinese dumplings in the heart of Chicago's chic Chinatown. <br><br>You just can't go wrong with dumplings. This dumpling restaurant in Chicago's chinatown makes for a great experience for not just food, but overall exploration in this area. I highly recommend taking the water taxi from downtown Chicago for a scenic view/tour on the river! There always seems to be a wait so I recommend getting here early to get your name on the waitlist and explore Chinatown during the wait. It seemed a little rushed when we came in with the host trying to find seating for us, and during our dining experience it was difficult to get a hold of a waiter or waitress. <br><br>For dumplings, we ordered three kinds: pork, shrimp, and leek, lamb and coriander, and beef and onion. Each dumpling had delicious juice in each bite, almost similar to a soup dumpling, but not quite as delicate with the wrapped exterior. The dumpling wrapping was a little thick and doughy for my taste, but overall still tasty! <br><br>The only downside of our experience was putting our name on the waitlist and being forgotten to be called as people with the same number party after us got seated before us. Overall, this place was a great stop for a meal that offers a lot of bang for your buck. I was quite pleased with the overall taste of the dumplings.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/-BS43Z1YuJDMg8CMD2e3Wg/348s.jpg", "caption": "Pork, shrimp, and leek dumplings"}]}}, {"review": {"des": "Came Sunday during brunch time, super lucky to scoop up a table without waiting. Normally the wait would be substantial. <br><br>The reason that the wait is substantial is because the dumplings here are unique and good. Now I really think that this was obvious and you probably don't need another review to tell you how good these dumplings are. Regardless though, that is what you're getting.<br><br>The first tray of dumplings came surprisingly fast after we ordered. The pork and shrimp dumplings were damn good. I don't mean to betray my family (sorry mom!), but these were much tastier than what I've had at home. It was too heavy with either pork or seafood flavor. I was able to taste both elements pretty throughly. I think usually with these kinds of dumplings it's a lot of one or the other. Good balance is rare.<br><br>Our second tray of dumplings was the lamb and Coriander. This one is a game changer. It gets you from so many angles. First off, the combination of lamb, coriander, and cilantro in a dumpling is refreshingly delicious. I'm disappointed more people don't make this kind of dumpling. These dumplings are juicy. They aren't supposed to be full soup dumplings, but there is enough luscious liquid inside to give you the impression they are. Next let's talk about the skin. It was really thin and light. It was just firm enough to hold all the contents inside. It more like a dumpling/wonton skin hybrid. <br><br>I could eat these dumplings till I vomit. But Id just clean myself up and keep eating.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/hq0kQHYjlTp-6AuDaGUfTg/168s.jpg", "caption": "Lamb and Coriander dumplings"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/UZYbbM9QBWG6otC18RwhGA/168s.jpg", "caption": "Pork and shrimp dumplings"}]}}, {"review": {"des": "Obviously QXY specializes in dumplings, one bite and you will see why. We had 6 orders of dumplings ranging from boiled, fried and steamed. The fried dumplings are similar to pot stickers, fried on the bottom, steamed on the top. They will inform you of the best method to cook the flavor you want. <br>For dumplings, we had the beef and cilantro, chicken and mushrooms, pork and scallop, beef and onion, pork and cabbage, and pork and clam. My personal favorite was the beef and cilantro. Between the three of us, we all preferred a different style. I prefer steamed. <br>They also have some fantastic BBQ skewers, my favorite was the lamb. I did not care for the shrimp skewers, I thought they were over cooked and were not at all seasoned. <br>They serve soft drinks and if you want wine or beer, you can bring your own. <br>I loved this place and highly recommend it.", "pics": null}}, {"review": {"des": "I love this place! Been here 4-5 times and it's reasonably priced and filling. But not hit the bed filling, which is good. <br><br>I always get the lamb and coriander steamed dumplings. These never disappoint. Just make sure to not eat it so quickly since it's freshly made and you'll burn yourself! I would say one 12pc order of dumplings is a good serving size. I usually go with another person and split two orders. I also recommend the beef and onion fried dumplings. It mixes things up between textures of steamed and fried. <br><br>The tables sit a little low. You can't cross your legs underneath them and the pillows are made out of silk? So it slides under your bottom easily. Otherwise, the decor of this place is super cute", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/uuIZj_BR_hzUmlrwIr-JEg/348s.jpg", "caption": "Lamb coriander steamed dumplings"}]}}, {"review": {"des": "Felt so recluse for such a star restaurant in Chinatown Square! Amidst the up and coming restaurants and the familiar is this wonderful dumpling shop worth every wait. They'll give you a number and will text you if you walk in; otherwise, you can make reservations on their website. <br><br>Each style of filling has a choice of preparation: boil, steam, pan fry, and even frozen. They'll come in sizes of 12 or 18, and a group of four would definitely order 4-5 dozens if everyone is hungry. The fillings are so fresh and juicy with each bite. It's going to be my goal to try all of them. <br><br>A tip to new dumpling eaters: combine that soy sauce and vinegar together, and let your food cool down. Nobody wants to squirt hot filling juice onto their friends when they bite into a dumpling. <br><br>Bite a small piece of the dumpling wrapping so that the steam inside can escape. And if you're really great with chopsticks then hold and sip prior to your bite.", "pics": null}}, {"review": {"des": "Bottom line: mid priced dumplings with a clean, modern decor and impressive customer service. <br><br>I was so impressed with the ambiance and quality of food! Usually for Chinese restaurants (that I've personally frequented), there's a trade off between authenticity/taste and decor. I thought the dumplings tasted pretty authentic, and there are all types of protein available -- chicken, beef, vegetable, seafood, lamb, pork. <br><br>I really liked the incorporation of technology as well - the menu and the payment methods were all through iPads. <br><br>One note: wouldn't order the lamb and dill dumplings again, as it tasted pretty strange (almost like Mediterranean fusion).", "pics": null}}, {"review": {"des": "I came here with my family for lunch and most of the tables were available. <br><br>We ordered lamb and dill, shrimp/pork and leek, pork and pickled cabbage, beef and coriander, and a plate of fish dumplings (each 18 pieces) among the seven of us. The fish dumplings and shrimp/pork and leek dumplings were clearly preferred over the other ones. The lamb dumplings were probably everyone's least favorite as there was a strange aftertaste. <br><br>Service was pretty good. The workers were very nice and struck up a long conversation with my family.", "pics": null}}, {"review": {"des": "The lamb and coriander dumplings are little bites of pure joy, and the Red Oil Pig Ears -- 红油猪耳 -- cannot be beaten. (Don't gross out. Just try them.)<br><br>Clean, well lighted space.<br><br>Yuan is hard working and VERY friendly, and his staff is equally sweet and helpful.<br><br>No trip to Chicagoland is complete without our requisite trip to Qing Xiang, one of Chicago's best \"hole in the wall\" Chinese restaurants.", "pics": null}}, {"review": {"des": "Best dumplings in the history of the world, seriously they're amazing!!", "pics": null}}, {"review": {"des": "Omg... Baltimore needs a dumpling shop like this!<br><br>The decor in here is very modern, bright, and welcoming. We came on a Sunday afternoon and there was a little bit of a wait. I like that they will text you so that you can walk around for a bit while you wait. <br><br>They have a variety of different proteins and cooking styles to choose from. You can get the dumplings boiled, steamed, or fried. The staff also does a good job at recommending what cooking style suits what type of dumpling. The best part... all the dumplings are made to order! They are so fresh and delicious. We order steamed lamb and coriander dumplings and boiled pork, shrimp, and leek dumplings. They were barely on the table ten minutes before they were all gone!", "pics": null}}, {"review": {"des": "TL;DR- Some of the best dumplings you'lll have in Chicago. <br><br>Get the shrimp dumplings. They're delicious. But honestly, you can't really go wrong with any of the dumplings they have here. The filling is always a good texture and never dry. The skins are goldilock's standards; not too thick and not too thin.<br><br>Price is decent. Not cheap, but not too expensive.", "pics": null}}, {"review": {"des": "This place has the best dumplings in the city - you can trust me, because I've employed the scientific method to make sure. I've eaten so many dumplings to confirm, and yes, my gluttony has resulted in indisputable law. QXY is the move.", "pics": null}}, {"review": {"des": "This is such a cute and cozy spot for dumplings! We ordered four 18-pc plates of pork and cabbage; lamb and coriander; pork, shrimp, and leek; and beef and onion. As someone who makes different types of dumplings at home, I thought these weren't amazing like other reviews say they are. The meats were too dry and grainy. The skins weren't very good (I like a more thick and chewy consistency for dumpling skins.) There was a high skin to filling ratio (aka there wasn't enough filling and a lot of skin.) Also, almost all the dumplings tasted the same, except for the lamb and coriander due to the coriander. The appeal of this spot for me and my boyfriend was the hominess, without the work of making and cooking the dumplings ourselves. <br><br>Also this spot is almost exclusively for dumplings, except for a couple small sides. I wanted to order a plate of veggies (gai lan, choy sum, etc) to accompany the dumplings but this wasn't offered. Be prepared to eat a lot of dumplings!", "pics": null}}, {"review": {"des": "I can't believe I didn't discover this place sooner! My friend suggested we go to this restaurant and I was skeptical at first. I usually don't go out to eat if I want dumplings because I can make them at home or simply buy them frozen. But I was so glad that I decided to try this place out. <br><br>The service was super quick- I think we only waited about 5-10 min before our dumplings came out, hot and ready to be devoured. I love the variety of stuffing you can get here and the method of cooking. I got the pork and cabbage option, boiled, 12 pieces. The filling was juicy and well seasoned. My friend got the 12 piece tomato and egg, steamed. Both were so delicious! Would definitely recommend both of these options. If you get the steamed option, I would eat them quickly! We took our time and after a while, the dumpling skin got a little dry and hard. <br><br>My only complaint is about their tables- I'm 5'4 and I couldn't even cross my legs under the table. I can't imagine being someone taller and trying to put your legs under there. <br><br>Nevertheless, I'd disregard the discomfort simply for the delicious food. Can't wait to be back and try the other options!", "pics": null}}, {"review": {"des": "A small restaurant tucked in a corner of Chinatown but a gem. The dumpling selections are wide and all of them taste authentic and delicious! There are also a wide variety of skewers, ranging from cumin lamb, beef tendons to chicken giblets and hearts! <br><br>The restaurant is quite small and the chairs are probably larger than they should be, making maneuvering difficult around the restaurant, both both the clients and the staff. <br><br>Other than this, the service are friendly and efficient. <br><br>Another great restaurant in Chinatown brings a small experience of Asian food to Chicago!", "pics": null}}, {"review": {"des": "The dumpling were delicious and the service was great. Our group ordered the lamb dumpling, the lamb skewers and pigs ear. Everything was lite and very tasty. Not very often would you see lamb dumpling on the menu but they definitely hit the mark. Would definitely come back!", "pics": null}}, {"review": {"des": "A couple weeks ago, a few friends asked if I had tried this place and I didn't, so I made sure that I visited here as soon as I could! Some say that this is the best dumpling spot in Chicago. I came with a friend and her parents. We ordered the pork and shrimp dumplings, shrimp pork and leek dumplings, pork and cabbage dumplings, shredded kelp in sauce, and cucumber salad. <br><br>Being from SoCal and having homemade dumplings, it's hard for anything else to compare. However, I will say that these are the best dumplings I've had in Chicago so far. The ones that we ordered were authentic in taste and had great texture. They had a lot of flavor already, so the soy sauce wasn't even that much needed. On each table they have soy sauce and vinegar. Both of the sides were delicious and I'd definitely order both again if I returned. <br><br>Some things that bothered me during my visit was that the seating wasn't very comfortable. By the end of the meal my back had a slight ache to it. Also, it felt as if the servers were rushing us. Our party had ssat down for less than 5 minutes and they came 3 separate times to ask if we were ready to order yet. Lastly, while I love the idea of being eco-friendly and having the menu on ipads, I'm also someone who is very traditional and I actually wasn't a fan of the digital menu and wish I had a menu where I could actually flip the pages.", "pics": null}}, {"review": {"des": "Stupendous! Lots of vegetarian and pescatarian options. Get them cooked how the server recommends. Flavorful and juicy. Run, don't walk to get these dumplings!", "pics": null}}, {"review": {"des": "When I searched 'dumplings' this was one of the top rated spots said to check out - so I did! <br><br>I was able to make a reservation online for a Monday evening. When you make a reservation online, you have to put in your cc info, and if you miss or show up late for your reservation, you get charged $30.. interesting. With this type of reservation system, I figured it must be because they are always busy (as stated in reviews), but on a Monday evening, I arrived and the restaurant was completely empty. <br><br>Anyways, on to the food. The menu is sectioned by the type of meat, then with the veggie options and cooked options (fried, steamed, etc).<br>Between the three of us, we ordered the lamb and dill, pork and cabbage, then the pork, shrimp and leek. With each order being 12 each, we were pretty full after! My favorite was the pork and cabbage - but each dumpling was super flavorful with a little soup inside. The dumplings were fresh and hot! Can't wait to come back and try even more dumplings.", "pics": null}}, {"review": {"des": "Sorry, but I prefer Din Tai Fung better.  These are good dumplings,  but the skin is thicker and more rustic than Din. Also,  the filing doesn't quite \"pop,\" like the delectable flavors of the potstickers at Din. Also love the finely sliced ginger at Din, which they don't have here. <br><br>Ok, this isn't a review for Din. So, if you haven't been to Din, you'll probably love these.  These might be an Acura. But,  if you've driven a Rolls or Lamborghini, it's hard to drive an Acura, no matter how great it is. <br><br>This would have been a 4 star review, but the \"special, \" crab roe dumplings were $28/order of 9. Wt?!  Didn't catch that. They were not any better than the $8/9 dumplings, but almost 4 times as much.  Crazy!! Didn't think they were that special... <br><br>Overall,  service was great. They use these iPads to order.  Didn't get our water, but no biggie.  Good dumplings ... <br><br>$5 cucumber salad is a nice balance to the starchy dumplings.", "pics": null}}, {"review": {"des": "Food is delicious. Freshly made and each style of dumpling is true of their flavorings. We really like lamb with coriander (fried) and pork with clam and scallops (their special). I care a lot about the skin of dumplings and this place definitely gets it right - thin with enough chew. Amazing texture and consistency. 5 stars for food! <br><br>The setting is quaint. Great for groups, couples, and also singles. Love the explanatory videos of their teas and handmade dinnerware. The quality of ceramic dishes is top-notch. Can't stop touching them. 5 stars for interior decoration. <br><br>Parking could be a little hard to find but shouldn't be too bad. There's a large parking lot right across the street as well as street parking right in front. If you don't mind walking there is sometimes free parking way north on Wentworth. <br><br>Now...down to why I gave it a low star rating...it's for service. It took 20 minutes for someone to come over to take our order, though I can see pass that given how busy it was. The real stickler is when they asked if we were waiting for anymore food and gave us our check, hinting that we should leave. When I paid $13 for a pot of tea, I want to enjoy it after my food, not feel the pressure to give up our table. That was quite disappointing. <br><br>I'll still give it a try given how good the food was. Hope you'll have a good experience!", "pics": null}}, {"review": {"des": "This place was okay, but the main reason why I'm only giving it two stars is because the waiter got our order wrong (we ordered dumplings steamed instead of boiled), and when I pointed it out, a different server questioned us, and asked, \"Are you sure?\" And after I told him I was positive, he said, \"Well, the boiled tastes better anyways!\" and walked off. If the restaurant were busy, I would've understood, but we were 1/5 couples in the restaurant.<br><br>In terms of the food, it was good, but nothing mind-blowing. I wasn't a huge fan of the shrimp and pork dumplings, but both fried beef dumplings were pretty good. I don't think I would come back though - I feel like the dumplings I buy from H-mart are just as good, and I can make sure they're boiled/steamed/fried.", "pics": null}}, {"review": {"des": "Dumplings were good but I wasn't terribly impressed. We got the lamb and coriander with the beef and onion.. both steamed. The beef was my favorite but neither option blew me away. Probably won't return. Can't complain about the service. Very attentive.", "pics": null}}, {"review": {"des": "Decent (but overpriced) dumplings, mysteriously patchy & aggressive service.<br><br>Pros: lots of dumpling variety. Bright lighting means everything will look beautiful and gleaming on Instagram. The waiters tell you there'll be a 25-minute wait on food, but it takes much less time.<br><br>Cons: this place was so overhyped that disappointment is likely inevitable. The menu, which comes on an iPad, is outdated (though we weren't warned of this when we sat down) and features many more options than are actually available, so don't fall in love with your first picks. The dumplings themselves are good (maybe even as good as homemade ones), but the boiled ones are mysteriously watery, and they're about 1.5x the cost of almost-equally-good versions down the street. When we were almost done with our food (but definitely still eating), we were interrupted mid-conversation with a waiter shoving our bill (also on iPad) in our faces for us to settle up.", "pics": null}}, {"review": {"des": "Qing Xiang Yuan (QXY) has some of the best dumplings in the city. We visited QXY on the weekend of Lunar New Year. We anticipated a large crowd that weekend, so we made a reservation.  When we arrived by 6pm it was a full house. With a line practically out the door, not one seat was left unoccupied, a testament to this restaurant's growing popularity.<br><br>This was our first visit to QXY and we ordered 2 sets of 18 count dumplings from their bestseller menu. It was enough for the both of us leaving plenty leftover. Our server suggested we have our beef and onion dumplings steamed and the shrimp, pork and leek fried. Both fillings were tender and flavorful. If we were forced to choose between the two, we favored the steamed beef and onion. <br><br>Make use of the side condiments on the table. Scoop a spoonful of chili oil and pour a little bit of soy sauce and vinegar.  They go perfect with your dumplings.<br><br>As I had mentioned in my tip, if you're ordering the steamed or boiled dumplings, just be prepared to get \"baptized\" by the dumpling juice! All it takes is one single bite and you're blessed with amazing juicy flavors coming from these delicious dumplings.<br><br>They were out of their popular lamb skewers on our most recent visit but we opted to order the fish tofu instead. The fish tofu was an unanticipated hit. Ben loved the flavor and textures and we left happy choosing this appetizer. <br><br>If you have a reservation, they do their best to get you seated quickly but once you've ordered, don't expect your server to come around your table often. We came on a busy evening and it took a while to get our servers attention; even more so to have asks returned in a timely fashion. <br><br>Parking and seats are easier to get mid-day on a weekday. If you must go on a weekend, make a reservation. QXY will validate your ticket if you parked in the Chinatown lots.  Just remember to get validation before you leave the restaurant.  Happy eating!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Z82orLWuG1WiONQE_SHUWw/348s.jpg", "caption": "Exterior."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/HKExAm0tBCU5jjA4SWCBHg/168s.jpg", "caption": "The packed scene during the weekend of Chinese Lunar New Year."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/U8M5XSNs894WcE9jpEdVRg/168s.jpg", "caption": "The scene, complementary condiments, and place setting."}]}}, {"review": {"des": "Dumpling lover here! <br><br>I was vacationing in Chicago for a few days and was wandering through Chinatown to see what this city had to offer. After an hour of not settling on a place to eat, I searched through Yelp and found QXY Dumplings. A place dedicated to dumplings?! Northern Chinese styled dumplings?! I'm so down. <br><br>Service was smooth, helpful, and fast. If you have any questions, don't hesitate to ask about their menu. They're so kind and knowledgeable. Everything inside this establishment was modern, clean, bright, and efficient. <br><br>FOOD: Beef and coriander dumplings (steamed): This was recommended by the waiter and did not disappoint. I've never had beef dumplings before but this was delicious! Extremely flavorful, filling, and nourishing; also having it steamed completes the experience. <br><br>Shrimp, pork, leeks (boiled): this is made popular by the locals! Had to try and extremely glad I did. Did not disappoint but I would wait for it to cool a little, and pop the whole thing in your mouth because it can get a little messy! Tasted how you'd imagine a shrimp and pork dumpling would taste. <br><br>The dumplings are relatively small. 18 dumplings will definitely fill you up. We ordered 2 plates (18/each, 36 total) and left us stuffed after our experience!<br><br>I have yet to find a similar establishment in the California. I also haven't found a similar spot in NYC (the few times I've visited). With that said, QXY Dumplings is truly a hidden gem and I'm so glad I got the chance to try it while I was in town. <br><br>If you're visiting, this needs to be on your food itinerary!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/2GrFLVPeJ3DhBCvMPL3FLQ/168s.jpg", "caption": "Shrimp, pork, and leek -boiled"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/T-Yf0Y9iyodSBUqS22koHw/168s.jpg", "caption": "Beef and coriander - steamed"}]}}, {"review": {"des": "I came here with girlfriends for a lunch date.  We were interested in trying soup dumplings.  Quick info....you can make reservations however walk-ins are welcome.  <br><br>We went with the suggestions that our server provided seeing that we were newbies.  She shared that the dumplings come boiled, steamed, and pan fried (one side only). We opted for the a variety of all three.  We placed three orders to share amongst the three of us.<br><br>The steamed specialty dumpling of the month was our favorite.  Ask for a spoon to aid in catching all of the escaping soup once the dumpling is pierced...by you chopstick or your teeth!!<br><br>Side note, there was some major street construction and we opted to park in the lot directly east of the location.  They validate parking so make sure you get a ticket before you leave.  Makes the difference between $10 and $2 extra special.<br><br>Bike parking on street.", "pics": null}}, {"review": {"des": "What fun to watch the dumplings being made in the back and to eat them in the front. I don't think it could get any fresher than this. Another pleasant surprise was that you can bring your own wine or beer to this restaurant and they will allow you to open it yourself. If your motto is do one thing but do it very well, I think that has been achieved here.", "pics": null}}, {"review": {"des": "I wanted to be Qing for a day in Chinatown, so I came to one of the most popular spots. I decided to Xiang out here for awhile. But I think Yuan your friends should skip this place and go to Xi'an nearby instead.<br><br>I'm usually not one to downgrade for service, but I didn't really like the attitude here, and the fact that they don't take phone orders, and the fact that once I could get here through the awful traffic, getting a to-go order took about 40 minutes.<br><br>Well no, they told me it would take 40 minutes, and then they were ready after 25 minutes, so it's lucky that I stopped by earlier than they said otherwise my dumplings would have been even colder than they already were.<br><br>The most popular dumplings in Chinatown are pretty good but that is all I can say about them. I should try pan fried if I come back, but that's not the most popular here, by any means. Should have got it anyway. I got the lamb and coriander because they recommend it and because I love lamb and I love coriander which is also known as cilantro to some of you Mexicans and Americans. While taste was good, they cost $11 after tax, and when you factor in that they have incredibly long wait times and they do not take phone orders - which is ridiculous because it cost me about 15 minutes of time - it's not great. They keep telling you, hey you should order online and then the online doesn't work on my phone... and I have a brand new Galaxy that works for everything. So considering the price and the wait time and the weird fascist ordering preferences I expected significantly more.<br><br>Compared to my faves, the dumplings themselves were nothing special at all. And service has a lot of issues. I don't get the crazy busy-ness at all.<br><br>I would say it's four-star standard but lowered to three star because of all the other issues.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/wBwxQ74dfB4AIrJIJj0zlQ/348s.jpg", "caption": "I'm dumpling my gf for these dumpings."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ri_NrIHfVEWrbrvRzPGx0Q/168s.jpg", "caption": "Wow I can't believe they charge for their menu"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/HR6OsoPldbv_Tdi27v4HMQ/168s.jpg", "caption": "Will you date me if I promise to wear this over my head?"}]}}, {"review": {"des": "I have been craving for my mom's homemade dumplings for a while (noted: not the potstickers served at americanized Chinese restaurants or gyoza in Japanese restaurants, I was talking about the super authentic Northern Chinese Shuijiao (dumplings), I'm glad I finally found one in Chicago that serves them. <br>Food: we ordered lamb kabob (it took a while for them to serve them tho, even longer than dumplings). they tastes great, exactly like the ones served by street vendors in China. Dill pork dumplings are great. We ordered the boiled ones (how we usually cook dumplings in China), however, I heard people like the pan fried or steamed ones too. will try them next time. We also had the braised beef and seaweed for appetizers, they are a bit spicy for me tho. order with caution ;)<br><br>Service: nice and attentive. great service. <br><br>atmosphere: love their plates and table arrangement, super cute!<br><br>will be back again fosho.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/npA-Vdng7yQfeVNSACvR1A/168s.jpg", "caption": "Dumplings"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/bNqs_6yzv_Jmqd08ZOStxg/168s.jpg", "caption": "Lamb kabob 羊肉串儿"}]}}, {"review": {"des": "I had lunch there on my birthday. It was crowded and just like Chinese restaurant's environment. Food are all delicious. The decorations and tablewares are so beautiful. They are all traditional Chinese aesthetic stuff. I definitely will come back!!", "pics": null}}, {"review": {"des": "Food: 4<br>Service: 4<br>Cleanliness: 5<br><br>Came here on a Sunday 6:00pm and there was a wait for about 1hr to seat two. We decided to wait it out and go to a different restaurant and get a 'snack' there haha. Returned almost by 7:00 pm and we were seated within minutes. <br><br>Our server kindly guided us as she took our order recommending whether boiled, steamed, or pan-fried was best for your choosing. We opted for two Pork dumplings (which we regretted as they tasted the exact same, oh wells). We didn't wait too long for the dumplings to come out, as it should be only 10mins max.<br><br>Broiled Pork and Leek (12ct) $8.99: We wanted to try this to see how it taste compared to our favorite frozen pork and leek dumplings we get at the Asian market. It was good, but not out of this world. I love the sauce tray on the table to mix your soy sauce, vinegar, and hot chili oil... I wish they had slices of ginger.<br><br>Broiled Pork and Cabbage (12ct) $8.99: Honestly the same as above. Tasted the same. We chose this one because it was under the 'chef recommendation'.<br><br>Would I come back? Maybe for a deal, I would like to try the other dumplings they had, especially with coriander.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/zGbQgpCBdAMydkrIp8-nFg/168s.jpg", "caption": "Pork & Leek 12ct: $8.99"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/aYWSg4xEWnvN8ljj8l45Ww/168s.jpg", "caption": "Lovely table setting."}]}}, {"review": {"des": "Certainly the best dumplings ive ever had...Melt in your mouth delicious and unfortunately I now compare every dumpling I eat elsewhere to these dumplings aka this place has ruined me...Nothing like homemade dumplings made fresh/steamed and brought right to your table...My only complaint about this spot is the use of  computer tablets as menus...Im sure using paper menu's is just as germy and nasty as using tablet but i always feel the need to wipe down screen before touching it...lol...Dumplings are so good i refuse to take away a star for this.", "pics": null}}, {"review": {"des": "This was the last meal before we headed back home, looking for it was a bit tricky because they are located on the side of the building.  The decor is very odd, the furniture is the traditional Chinese furniture made of Bamboo....why am I even talking about the furniture?? Because them things are not Asian friendly...that stupid cushion don't help and my knee kept smacking the table so the sitting for me is uncomfortable.<br><br>But you not here to read how it hurt me so on with the review.<br><br>The menu on the iPad is stupid because it's a photo gallery of pictures, not very functional at all and I was looking at the menu trying to order then realized that it was pictures only.  <br>1st picture was their special Crab Roe dumpling for $28, ok because they said it was good and I love crab....why not...so I got one.<br><br>Got the Beef pan-fry ones and the Pork with pickle vegetables plus the Pig ears of cause.  <br>Food came out pretty quick, the Crab Roe dumplings are good but not $28 good...it tastes like crab soup dumplings so it wasn't Wow! Good and not worth the $$<br>The other dumplings are ok....nothing to write home about.  This last meal set me back about $70 so this was on the high side because I ordered their special carb roe.  I should had gone to Mongolian Little Sheep instead :-(<br><br>Will I recommend this? Yes only for take-out if you want dumplings tho<br><br>Will I go there again?  No way....that furniture is just a torture for me to sit at and I had better.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/7LI4g81xceCTOnVb-_I4gA/348s.jpg", "caption": "Crab Roe dumplings, not worth the $$"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/pT6Y9OcWPHZsem1K-_w3uw/168s.jpg", "caption": "Inside the Crab Roe dumpling"}]}}, {"review": {"des": "Probably the best dumplings in Chicago. Went here with a friend and got 18 boiled pork and cabbage dumplings and 18 chicken and mushroom dumplings. We were decently hungry and 18 each was the perfect amount. Plus getting 18 isn't significantly more expensive than 12 (the other option). The chilli oil is amazing - highly recommend throwing it on if you're a spicy fan. Warning: taking a bite out of the boiled dumplings may result in water squirting out; I ended up just eating them whole to reduce the chance of soiling my clothes.<br><br>All the staff was super friendly - some of the best service I've experienced in Chinatown. I also loved the atmosphere, decor, and table setting. Very tastefully done. Can't wait to come back here!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/pHDp4uKucBWY5nYudnT8OA/168s.jpg", "caption": "18 chicken and mushroom pan fried"}]}}, {"review": {"des": "Came here for lunch on a Thursday, plenty of open tables and service was quick. The decor in here is very modern but also the furniture was very traditional Chinese looking, unlike most other restaurants in Chinatown, something I appreciated! <br><br>For our party of 3, we ordered 2 plates of the 18ct, Pork and Mushroom and also Pork and Cabbage. To our dismay, they do not offer half steamed-half fried plates (which would end up being the same price if think about it, but oh well). It costs about $1 more for the fried option compared to steamed/boiled, but no big deal, we just ordered one fried and one steamed. The menu warned that it may take up to 30 mins for your dumplings to come out (longer for fried), but our dishes probably only took 20 mins tops, so that was appreciated. <br><br>As for the dumplings themselves, they provide soy sauce/chili oil/ vinegar for your dipping preferences. The steamed dumplings were very juicy and I wish they had provided us soup spoons to eat them more efficiently as soup dumplings. The fried dumplings came out soon after, however, we all agreed they could have used a bit more time on the pan. Flavors for the both of them were good though. <br><br>Overall, I definitely think if you're out and about already in the area not wanting to cook but looking for dumplings this would be a good place to come for a meal. However, I might just stick with my store-bought dumplings if I were ever to get a craving, as these were not really out-of-the-world for me. Flavors were good but a little bland.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Wjhq05CxYvwU6ChaTSUiEg/168s.jpg", "caption": "Steamed pork and cabbage dumplings - 18 count ($10.99)"}]}}, {"review": {"des": "Great spot. Affordable. Convenient. Delicious !", "pics": null}}, {"review": {"des": "Sooooooo good!!! The lamb skewers and beef skewers are super super tasty! They taste as good or even better than the ones in China. The fresh hand made dumplings are just something everyone should experience. They are so much better than the store bought frozen one. The decorations, plates and silverwares remind me southeast China. Feel like home! Love this place so much!", "pics": null}}, {"review": {"des": "Taking my first steps outside with snow pattering off my boots. I walk in to the cozy smell of dumpling that is complimented with a clean interior of light mahogany wood. <br><br>Our group ordered a variety of dumplings all which exceeded my expectations. Hand made in the back for your viewing through a window, chefs are working hard to craft your food. <br><br>This place is a must if you are in Chinatown here in Chicago.", "pics": null}}, {"review": {"des": "The dumplings here are legit and amazing. They even had flavours that is found only in my friend's hometown. The server would recommend how the dumplings is done best if you ask them. Beware that the spice level here isn't the typical levels for the Midwest. A mild here would be medium heat in most other restaurants here.<br><br>My biggest dislike was the seats. These were really hard to get in and out of due to the very narrow and tight space. The armrest are nice but they leave you with barely enough space to maneuver. They need to be changed!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/e1pE40tqeabEfl3bK6d9uw/168s.jpg", "caption": "The hot and spicy soup wasn't what I expected it to be( the Szechuan style). Wasn't numbing at all."}]}}, {"review": {"des": "The price was too high and it was not worth it <br>$20 for only 6 or 7 dumplings . And slow service", "pics": null}}, {"review": {"des": "This is a really nice dumpling place.  The decoration and ambiance is very serene and nice.  It does feel like a very upscale place, but the prices are not upscale, which are great.  The dumplings are great, the pork and shrimp are the best ones.  The dumplings come out pretty quick and service is great! I highly recommend!", "pics": null}}, {"review": {"des": "Simply put, best dumplings EVER!!!  Great atmosphere and service and an awesome extensive menu!  This is one of our favorite restaurants in the city. Highly recommend!", "pics": null}}, {"review": {"des": "Tried this place for the first time and was not dissapointed! Always saw a line whenever we passed this place, thought it must be good. Ate here for lunch on a Friday afternoon, and had to wait for 20 mins. The place is small but clean and organized. Once seated, the service was quick and friendly. The dumplings were great but werent as flavourful/impactful as expected. We also ordered the lamb skewers and the fish tofu, both were surprisingly delicious. A little pricey for the small portions given. Will come back though to try the pan fried dumplings next time!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/MJMbTPyUFqzkl92jZ1SM2A/348s.jpg", "caption": "Fish tofu"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/6jSipAdL2gAA6lFXxjGTWA/168s.jpg", "caption": "Pork, shrimp and leek dumplings"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/3nZ7Mu_ARF8Bn1Bc225NlA/168s.jpg", "caption": "Lamb skewers"}]}}, {"review": {"des": "Best dumplings in Chinatown hands down. My favorite is the pork and mushroom, boiled. Every dumpling could be called a xiao long bao, they are THAT juicy. I honestly don't know what kind of sorcery they use to get that flavor and juice in every bite. The ONE gripe I have is that you mix your own dipping sauce with black vinegar and soy sauce, but I'd prefer if they would give a more substantive dipping sauce (with garlic, green onion, maybe sesame oil). Came with a group of 4 for weekday lunch and waited 10 min to be seated. Quick service, helpful staff (they were knowledgeable and recommended different types of dumpling be steamed, fried, or boiled). Almost every single type we ordered was perfect. We were a hungry bunch, so 18 dumplings per person was a good amount. Will be back with friends, family, and an empty stomach :)", "pics": null}}, {"review": {"des": "Dumplings are some of my favorite comfort foods, and I was excited to visit a restaurant that specialized in dumplings. Walking in, I was pleasantly surprised by the bright and modern layout. One thing that I did not love, as others have also mentioned, were the awkward low tables and benches. I'm not even that tall, and I could hardly cross my legs under the table without bumping into the table. For food, we ordered the fried chicken and mushroom, steamed lamb and coriander, and boiled shrimp, pork, and leek dumplings. We also got a side of the cucumber salad. I enjoyed everything except the chicken and mushroom dumplings which lacked seasoning. For three people, 48 dumplings were more than enough, despite what our waiter suggested. Overall, I would come back for the food but maybe consider getting takeout so that I can eat in the comfort of my regular people-sized home.", "pics": null}}, {"review": {"des": "This place for dumpling is great but I must say you have to make a reservation online with your credit card to get a table because it's usually packed. They said if you don't show up they will charge you a fee so make sure you show up.  My friends and I had 72 dumplings in total and my favorite is the lamb and coriander one. I also like the other dumplings filled with beef and onion and pork and leeks. The dumplings are very flavorful. We also had chicken skewer but my friends though it was to spicy but I loved it because it has a kick to it. The only thing about this place is ordering tea is expensive so I would advise against it. I would go back to this place in a heartbeat which I did not long after and my other friends love it.", "pics": null}}, {"review": {"des": "My friend and I went to this place at around 8PM on a Monday night. It's conveniently located close to the train stop. We had to wait about 10-15 minutes, as the place was pretty small and it was packed. <br><br>We got the pork/shrimp/leek and pork/cabbage boiled dumplings to share between the two of us. The dumplings were good, but there wasn't anything too special about them. A bit pricey and we were a bit less then full from it. <br><br>The place was very clean and aesthetic. They had a window in the back where you could see the workers making the dumplings.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/sD-cVIVYjpCLU7G35_JnwQ/348s.jpg", "caption": "Pork/shrimp/leek dumpling & pork/cabbage dumpling"}]}}, {"review": {"des": "Dumplings are delicious but the price is too high. I went there yesterday but I might not go there again", "pics": null}}, {"review": {"des": "Best dumplings ever!   We ordered 3 types and all were amazing.  Pork and cabbage, beef & onion, pork shrimp & leek all savory goodness.  The tender wontons, plentiful filling and deliciously different flavors.  Loved being able to make our own dipping sauces at the table with the spicy oil, vinegar & soy sauce.  Soooo good.  Cute, clean place in Chinatown area.  Plenty of parking nearby too.", "pics": null}}, {"review": {"des": "This is probably some of the best dumplings I've had in Chicago. They don't serve any xiao long baos though, but still tasty. My family of five adults ordered a total of 4 dishes: pork and leek (18 count), beef and onion (18 ct), lamb and dill (12ct), and beef and coriander (18 ct). The server recommended the dumplings to be boiled but we prefer steamed, and we decided to try the lamb fried just to see how a fried dumpling would be. <br><br>All of the dumplings were delicious, although  the beef ones were definitely the best. That was surprising since I figured the traditional pork and leek would be the star. They're all freshly made to order and you can watch the workers make your dumplings through the glass wall.  Best of all, all the dumplings were super juicy and flavorful. <br><br>I've never seen a beef or lamb dumpling offered anywhere else before, so they're pretty unique in that aspect. Prices are a bit high as our total was over $50 without tip (66 dumplings). I would recommend something like 12+ dumplings per person to really make it a meal. My pregnant self could easily eat 18 without any issue. My husband thoroughly enjoyed the food but says the ones in Beijing are still the best. But for Chicago, this is pretty darn amazing. <br><br>Atmosphere is modern and clean. Tables and chairs are cool looking but realistically aren't very comfortable. Either way, it's a nice change of pace from your typical Chinatown restaurant and the dumplings are super tasty. They also validate for the nearby parking lot, so make sure to get your parking discount!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/YB7LtxBXS4BI9tPmRvsAFw/348s.jpg", "caption": "Pan-fried Lamb and Coriander (12 ct)"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/vxCSugwDMsI0cjaTo4y6Sw/168s.jpg", "caption": "Steamed Pork and Leek (18ct)"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/R-iRmOvq9OaHWVRYTTaD0Q/168s.jpg", "caption": "Steamed Beef and Onion (18ct), highly recommend!"}]}}, {"review": {"des": "I took my girlfriend here for dumplings and we both had a great time. The dumplings were delicious and were super affordable! <br><br>We got the pork and cabbage dumplings, which our server recommended and offered us some pointers on. The service was awesome and the food was great.<br><br>However, the restaurant is BYOB - so have that in mind. I was a little disappointed to not be able to enjoy a drink with my dinner. Come prepared!", "pics": null}}, {"review": {"des": "Looking for dumplings? This is the spot! Lots of filling options. Absolutely delicious both fried and steamed.<br>We tried beef and onion, shrimp, pork and leeks and fried lamb with leek.<br>Great selection of hot tea as well!", "pics": null}}, {"review": {"des": "Very northern Chinese flavors in steamed or fried dumplings. I wouldn't say that it's very memorable or different. I was disappointed that the scallop dumplings used tiny scallops and not pieces of a large scallop. <br><br>I didn't like the chairs- a bit uncomfortable to sit. We went when there wasn't much of a wait. I would not go and wait in line for this type of food.", "pics": null}}, {"review": {"des": "The seating and tables inside QXY were cute: we were sat in large chairs with cushions and at a interesting desk-like table with a drawer of napkins underneath. However, because the chairs were so large, we were sitting back to back with the chair of the person behind us (you couldn't move your chair forward or back) and the drawer underneath the table made it such that you couldn't fit your legs underneath the table. So while it looked nice, it was pretty uncomfortable to sit in.<br><br>Furthermore, instead of having physical menus, they used iPads which I thought was cool at first but quickly became annoying. It's kind of like trying to use a tablet to replace physical textbooks--it just isn't the same reading from an electronic screen.<br><br>As for the dumplings, they were also a huge disappointment. We ordered 18 dumplings of each type: fried, steamed, and boiled. The fried ones were the slightly above average, the steamed ones were OK, and the boiled ones were downright disgusting. The meat used inside the dumplings were so ground that it was like meat sand-- the pieces of pork simply didn't stick together at all. In my opinion, the frozen dumplings you can buy at H-Mart tasted orders of magnitude better at a fraction of the cost.<br><br>All of this combined with the extremely long wait (1 hour to get the table + 30 minutes to get dumplings after ordering them) leaves me overall unsatisfied and disappointed with QXY.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/W6zyEth-OXhnWFuzRtV7XQ/348s.jpg", "caption": "The cute but dysfunctional seating of QXY. The tables were so low you couldn't fit your legs underneath."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/07jDWJ2PMp3sDcJJmB1grg/168s.jpg", "caption": "Steamed pork dumplings: steamed dumplings tasted better than boiled, but worse than fried"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/iuqHHFwIbKI-jtvcuwLGuw/168s.jpg", "caption": "Boiled pork dumplings: absolutely disgusting, do not order their boiled dumplings"}]}}, {"review": {"des": "I absolutely LOVE dumplings so naturally, I had to visit! At first glance, I thought the place was very cute - traditional Chinese decor with the wooden furniture and red pillows. After we were seated, we were handed an iPad with the menu loaded onto it - what a modern twist! <br><br>Despite only serving dumplings, there are a lot of different options to choose from! They come in every meat you can possibly imagine! You can also have it cooked according to your preference (i.e. boiled, steamed, fried, etc.). We ended up ordering the potato salad, fried beef and coriander dumplings, and steamed pork and cabbage dumplings. The food itself was very yummy! My personal favorite was the steamed pork & cabbage dumplings (tastes very similar to a Xiao Long Bao, if any of you have ever had them before). <br><br>There was a disclaimer that dumplings may take up to 30 minutes to make. We went on a Thursday afternoon and it was half full. We got our food relatively quickly - probably took only 10 minutes! <br><br>The only reason I'm docking this place a star is because of its prices. Beware if you want to order anything other than dumplings! Our plate of potato salad cost us $5 and it definitely was not worth anywhere near that. As for the dumplings, they're definitely not cheap but worth it if you love dumplings (and if you have a smaller appetite). If you're someone with a larger appetite, be ready to shell out at least $20 for this meal!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/efgIK2v3gpYxEv4ddn3t2w/348s.jpg", "caption": "Potato salad"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/VPTEB1MoqpsFsEXAzbVr1A/168s.jpg", "caption": "Steamed Pork & Cabbage Dumplings"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/axssWNODMYo4-9hTy1YcGw/168s.jpg", "caption": "Fried Beef & Coriander Dumplings"}]}}, {"review": {"des": "Very nice place with homemade dumplings but the brand makes it overpriced- as a local Cantonese speaker, I was expecting Shanghainese soup dumplings. To my disappointment, there was none (but you can find delicious ones at HingKee in the strip). The place is very aesthetic and comfortable, but again, the brand makes pricing too expensive. I can't dare to pay 1$ per dumpling in college when I can buy them at the Chinatown supermarket 5$ for 30 lol.", "pics": null}}, {"review": {"des": "Everyone I know who has been to QXY absolutely could not shut up about it. I tried to come here for Chinese New Year and of course it was fully booked. Perhaps the expectation was too hyped up, I was pretty disappointed overall. <br><br>We got the shrimp, pork, and leek dumplings, boiled. The first few were delicious, but out of this world and worth 75 cents each? I don't think so. This does not gross me out but just so you are aware - they use tiny fishes in the filling to enhance the seafood flavors (the concept of xian 鲜 in Chinese cuisine culture). The steamed beef and coriander dumplings came in a traditional bamboo steamer, but without the lid. So they got very dry after 10 minutes. Worse, they all got stuck together and to the steamer. Every attempt at taking only one dumpling would rip the nearby dumplings apart, resulting in devastating juice loss. The dumplings were of decent size. Two orders of 18-pc were a little aggressive for two people, especially considering you are eating A LOT of the same things.<br><br>A quick word on reservations: <br>I made a reservation. Was informed that a) if cancelled within two hours, I would be charged $30 and b) our table would only be held for 10 mins. Got a reminder email a day before and a text two hours before reservation time. Although they make such a big deal about their reservations (rightfully so for a popular restaurant), upon arrival, the host was shocked to hear I had a reservation. We got seated as soon as a table freed up so NBD, but I thought that was so odd. <br><br>Bottom line - I would still recommend QXY if you are really into dumplings and want something fresh and tasty. Boiled over steamed, though.", "pics": null}}, {"review": {"des": "This place has delicious fresh handmade (you can see them working away behind the glass panel) dumplings.  The atmosphere and the food is fantastic.  My tip is always to order the 18 dumplings instead of 12 because it's so good you'll eat it anyways and the pricing ends up being more fair that way.  I recommend the classic, shrimp pork and leek dumplings steamed.  But honestly it tastes delicious pan fried or boiled as well.  The decor, chair, table, napkins, plates and everything else you can think of, even the carry out bags, are branded and high quality.  The carry out bag is the quality of a high end clothing store bag with rope handles!  <br><br>I had to take a star off because the service is a hit or miss.  I have had the host ignore me or just roll their eyes when I asked to see the iPad menu while waiting in line.  While that didn't happen all the time it was strange when someone else goes and asks the same question the host just happily handed them the iPad.   Not sure what was going on.  But also I strongly dislike the iPad menu.  They don't wipe it down and it's so oily and covered with finger print.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/2N_bf1ZAvOPghdlixHEruA/168s.jpg", "caption": "Lamb skewers"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/naHnGNesX8IoJEIdSf6B8w/168s.jpg", "caption": "Steamed dumplings (18) I recommend the shrimp pork leek dumplings!"}]}}, {"review": {"des": "At $.75-.85 cents a piece (depending on whether you buy 18 or 12/fried option), I'm not sure if these dumplings are a good price or not. While they're certainly yummy, I'd say'd have to eat 18+ to get full.<br><br>I suggest ordering an appetizer along with the dumpings because they do get to be boring just by itself. I'm disappointed there's no broth/noodle option to accompany the dumplings.<br><br>My friend and I ordered 2 orders of 12 with a side of cucumber salad ($5). The cucumber salad felt like something that would have been complimentary at a korean restaurant so I was disappointed to have paid $5 for it.<br><br>All in all, I'm glad to have tried this but I don't think I'll be returning. Nothing wowed me and after ~$18 for tax and tip, I wasn't even full.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/7ZaG_VcytH8XDs6pVs6aMA/348s.jpg", "caption": "Pan Fried $10.99 for 12"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/FPDn2dBlisjSE_qyCkNn2g/168s.jpg", "caption": "18 Steamed dumplings"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/eIwwgY-0hWccARit8z11TA/168s.jpg", "caption": "Cucumber Salad $5 and spicy sauce $1.99"}]}}, {"review": {"des": "Only had takeout from here but these dumplings are so soooo good! I would recommend the vegetarian dumpling. The beef and onion is pretty good too. They have different recommendations for various flavors whether they should be steamed or pan fried. Personally I liked it pan fried but you know... it's not as healthy as steaming. <br><br>Pig ears were also very good! Well seasoned. <br><br>I will be coming back soon for the in house experience!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/IgrQYvAJshElZnrGcOa-kg/168s.jpg", "caption": "Veggie dumplings"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/8XiBscXD3D68Rxg3FUYIZQ/168s.jpg", "caption": "Pig ears a little spicy but so good!!"}]}}, {"review": {"des": "Really good for when you are craving dumplings. It is exactly what it sounds like. I had the beef and onion dumplings as well as the pork and cabbage. I liked the beef but the pork not as much. I will agree with other reviews that the skin is thinner than most dumplings I had tried, but definitely did not take away from the flavor. I would recommend when you really want comfort food. The boxes that the take out came in were really cute and clever.", "pics": null}}, {"review": {"des": "A few friends and I came here on a Saturday for brunch. We had to wait a little bit to be seated, as our party wasn't all there.<br><br>Once we sat, the chairs are too tall and too big for the tables. So if you like to be close to the table when you eat with your back against the chair, like me, you're outta luck. <br><br>Service is pretty quick! Not overly friendly, but friendly enough.<br><br>The dumplings are made in house, and worth every single penny. It's truly the best deal for dumplings I've seen in a long time. 12 fresh / handmade dumplings for less than $10. Can't beat that!", "pics": null}}, {"review": {"des": "My friend was craving dumplings, so we came across this spot in Chinatown. As with many Chinese restaurants, I was a little upset that there weren't good fresh vegetable options on the menu. However, their dumpling options were vast, and we decided on the egg and green onion dumplings.<br><br>It took forever to come out, but the dumplings were nice and steamy when they came out. They also paired well with the sauce that was on the table. The sauce was oily with a tad bit of spice. We had gotten 12 steamed dumplings, which left the two of us still hungry afterwards, but we didn't want to wait another hour for more. <br><br>In conclusion, I make these kind of dumplings at home so I wasn't impressed at all. Everything was kind of average, definitely not worth going back with the wait :/.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/CpMBXV_W0o8hESAWeBf1Gg/348s.jpg", "caption": "Steamed egg and green onion dumplings"}]}}, {"review": {"des": "Not as advertised. The dumplings are generic where the beef and pork meat taste  somewhat similar. Filling had a slightly bouncy consistency. Expected the wrappers to be better since it looked like they were hand made fresh in house. But for some reason, wrappers had a strange texture that was somewhat grainy. Bit of a disappointment.<br><br>Tea is overpriced. Our pot of chrysanthemum tea was $10 with just one flower for a pot of water. <br><br>Food is OK. Don't agree with the 5star ratings, especially as everything was overpriced.", "pics": null}}, {"review": {"des": "Finally I tried this place! I heard a lot of good comments from my friends about the dumplings here. I ordered the lamb cilantro dumplings, pork dumplings and other side dishes. ALL of them were delicious!!! My friends and I were all satisfied after the dinner. I also love the decorations. The plates and other utensils were so beautiful. Good for large groups so you can order more flavors of he dumplings!", "pics": null}}, {"review": {"des": "Delicious dumplings, good flavor choices. Great service.<br><br>But are you kidding me with the $10 pot of tea?", "pics": null}}, {"review": {"des": "I came here for a quick dinner of dumplings before leaving for O'Hare. It's right across the CTA red line, so getting to O'Hare was very quick and easy.<br><br>Location aside, the interior is very pleasant. Not at all what you'd expect of the typical Chinese restaurant. The dishes, utensils, and tables are all very clean. I got the recommended pork and cabbage dumplings (18 for 10.99). It was a bit too much for me, especially since the dumplings are pretty normal sized and not tiny like the server said. The batch was VERY variable. Some of them had a good bite to the outside with some soup inside. Otherwise had holes and were completely floppy. Fortunately, the good outweighs the bad, so this place gets 4 stars!<br><br>In addition, there's a Kung Fu Tea right around the corner for after dumpling bubble tea!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Un2vEmA6UBE_8S87MJOKGA/348s.jpg", "caption": "I'm so ready for this"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Ywv8FvwTJYgwiFvCOtQ7cg/168s.jpg", "caption": "Can you see that soup hiding down in there! Delicious pork and cabbage filling"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/oHk63iaJsTqPF2UPLpnQtQ/168s.jpg", "caption": "Dumplings!"}]}}, {"review": {"des": "Nice traditional Chinese-style dumplings. All the other reviews described the dumplings well - just pick what you usually like. As mentioned, the flavors are pretty traditional, I liked the pork with pickled cabbage. <br><br>I loved the pickled cucumbers here, a nice cool and watery balance to the dumplings.<br><br>The lamb and beef kebabs are okay. It's a little light on spices compared to what other places in Chinatown offer.<br><br>Enough of repeating what's been said. Get a load of the HD TVs when you come eat here. They're playing borderline cheesy \"joy of cooking videos\"... you know, the shiny, bright videos with slabs of meat, dumplings falling everywhere, filling being put into the skins, food flying left and right. It was amusing I guess. It does kind of liven up the place, and it's better than playing sports or some news channel.<br><br>I also have to shout out the chairs which all have pillows for your back. They're kind of unusably wide - I'm baffled at why they picked these chairs for a small location, but they do look really nice when you're just looking at them. And once you manage to sit in them, I suppose.<br><br>\"Dumplings rule, if you want to eat dumplings, come here!\" - unofficial slogan of QXY", "pics": null}}, {"review": {"des": "Funnily enough I came to this place right before I went to Beijing for the first time the following week, so can confirm that the beef skewers I had at QXY are authentic. I liked the spice blend, it was smokey and especially the cumin taste is really the star. <br><br>I actually don't really like eating dumplings out, but was really craving it the day of. And I'd say these are what you'd buy and eat anywhere in Asia. The skin of the dumplings weren't too thick and the filling was nice as well. We had the pork parsley dumplings fried and it was delicious. <br><br>The only thing I wish they also had was more condiments. I know Chinese people always eat dumplings with black vinegar, but I am devoted to my white vinegar, soy sauce mix! Also that the English translation of \"xiang cai\" into parsley had me laughing because that was definitely not what I thought of when I saw parsley.", "pics": null}}, {"review": {"des": "I'm struggling between a 3 or 4 star review for this place...but I'm going with 4 because I would most likely come back. <br><br>This is one of the cutest looking, most clean feeling places you'll go to! The inside is decorated perfectly - I really can't do it justice with my words so you'll have to see for yourself. I mean, even the chopsticks and sauce bottles are adorable! Warning: the height of the table is awkward and if you're tall, your legs won't fit underneath (I'm ultra petite and there wasn't room for me to cross my legs). <br><br>For the food: I highly recommend the steamed lamb  and coriander dumplings - very flavorful, juicy, and not too strong like your typical lamb. The boiled pork and cabbage dumplings are also decent. The lamb skewers, however, are OVERRATED (way too much seasoning in my opinion). <br><br>What was off putting was the fact that they charged us $10 for jasmine tea (which was too floral in flavor, by the way) and didn't make that clear upfront, as we were sure it was $5 based off the online menu. We tried to explain our confusion to the waiter but he dismissed us quickly. <br><br>All in all, a super cute place with decent dumplings! Glad I finally got to try it!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ZS8mro8yhye_-8WKl_TG1Q/348s.jpg", "caption": "Steamed lamb and coriander dumplings. Yes, these do live up to the hype!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/VVzo9FOuvPB2rhRK58gp-w/168s.jpg", "caption": "Boiled pork and cabbage dumplings"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/GDjEjaM1rAHaXnIN6JXE6g/168s.jpg", "caption": "Lamb skewers"}]}}, {"review": {"des": "Yum! <br>Been here several times and I have to say, I will keep coming back. Their dumplings are delicious and the meat to wrapping ratio is just right!<br>This place is all about the flavor of the food and not so much the presentation.", "pics": null}}, {"review": {"des": "Who doesn't love dumplings?! I was in Chicago this past weekend and we have this place a try on Friday night. We had 6 people total in our party and had about a 30ish minute wait to be seated. The place is pretty loud and casual. <br>We then ordered 4 orders of 18 dumplings for the gang. I basically let our server pick our orders based on the most popular. We had a mix of some steamed vs. pan fried. I think I prefer them fried and a little crispy! They were all excellent, but the lamb was my favorite! <br>Great place for a fun dinner. It's also BYOB!", "pics": null}}, {"review": {"des": "This is one of my favorite places to come for dumplings. I was a huge fan of this place when they started from the bottom (in the basement) and now they here. Honestly, I felt it was just a bit better when they were in the basement, but this is still very good. My favorite dumplings are beef and onion, beef and coriander, and pork and mushrooms. I especially like how they recommend how you should get it prepared--steamed, boiled, or fried for each type of dumplings. I normally go with what they recommend and they have yet to let me down. You can also order frozen to cook yourself at home if you like to do that as well. The \"bread\" is also a must get. It looks like basic garlic bread, but I promise you it is way better. The hot and spicy soup is loaded with stuff and it also have noodles as well. This was one of my favorite things to get here too, but be warn as it is pretty spicy.", "pics": null}}, {"review": {"des": "I absolutely love everything about Qing Xiang Yuan:  1) Interior is well-organized, brightly lit, and very clean 2) Menus are iPads 3) They have pillows on their chairs 4) Dumplings taste amazing and are handmade (you can watch them making them in the back)! <br><br>During our first visit here, my boyfriend and I ordered two types of dumplings (lamb & coriander - steamed, pork & cabbage - fried) as well as an order of lamb kabobs (we really like lamb, lol). The lamb dumplings were heavenly - ridiculously flavorful and juicy. The pork dumplings were pretty good too, but the lamb ones definitely stole the show. The lamb kabobs were very well-seasoned and delicious (if you get them, definitely eat them while they're hot)! We came back about a week later for more lamb dumplings + kabobs, and this time we also tried the fried pork & shrimp dumplings - also good, unsurprisingly. <br><br>Qing Xiang Yuan offers a ton of dumplings, ranging from vegetarian (zucchini & mushroom, tomato & egg) to seafood (clam & pork, mackerel & leek), so I doubt anyone can get tired of the dumplings here. For dumplings, you also have the option of ordering 12 ($9.99) or 18 pieces ($12.99). Lamb kabobs are 6 for $9. <br><br>Definitely give this place a try if you're around Chinatown, I promise you won't be disappointed!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/lyPxxMrmDzG1C4YduFmWZA/168s.jpg", "caption": "lamb kabobs!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/X_oA0ZLIxsGK55n_I3WRSA/168s.jpg", "caption": "lamb & coriander dumplings, steamed"}]}}, {"review": {"des": "Good dumplings but super overpriced. I loved how you can customize the dumplings (ingredients and how they are cooked) but I feel like there was too much msg and sodium. The special crab dumpling was probably my favorite so far. Was thirsty and bloated for hours after the meal. Despite that I'll probably still be back at least until I find better dumpling places or find time to make my own.", "pics": null}}, {"review": {"des": "This place is amazing the dumplings are freshly made after you order I will definitely recommend this for all my friends . The taste of the lamb and coriander is delightful. I'm drooling thinking about them . Definitely a must try .", "pics": null}}, {"review": {"des": "I read the good review from Yelp... but the dumpling place DISAPPOINTED me... <br>First, I like the decoration of the restaurant. It's really nice, clean, simple and soothing feeling. <br>The waiter Is nice. <br>My critics are really about the taste of the dumplings. As a specialized dumpling restaurant, the taste should be on the top. We order chef recommended pork, shrimp dumplings. The taste is ok, NOT SPECIAL. You can get these kind of dumpling in any other place.<br>The WORST thing is about Green pepper and Egg dumpling which is one of the popular dish on the menu. It's SALTY!!! TASTELESS!!!! <br>Seaweed salad is good.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/h1Nrk6aw_-BhcYtAkqaPDw/168s.jpg", "caption": "Chef recommended pork, shrimp dumpling"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/GFLuvxPBls33RcIQ7fGXsA/168s.jpg", "caption": "Green pepper and egg dumpling... too salty!!!!"}]}}, {"review": {"des": "The problem with catching on to the hype too late, when it's real, you miss out on some major OG perks. Yet again, I am refusing to complain because these were some of the best dumplings I have had to date!<br><br>I was worried I couldn't find the infamous gem based on past reviews. Sure enough, those reviews were from a few years ago as we found it right away. The location is right across from the red line on the very kiddie corner facing the John Hancock. Pay to park all along side of Wentworth. It was an easy find that I could appreciate.<br><br>I could tell right away this was a remodeled location. It was very nice inside seemingly refurbished. While we waited for 2 on a Saturday night with a 10-15 minute wait, I couldn't help but stare at the TV that showed how they make and eat their delicious perfect dumplings. Smart on their end for anybody who even dare question leaving due to a long wait. A family of 4 walked in after us and dude was straight up letting them know it would be over a 40 min wait. This place is poppin, that's zero question. <br><br>We got seated fairly quickly. The chairs were ultra comfortable and the setting of the table was very cute and quaint. Their menu is a fucking IPAD on the table okay. Call me old fashion but I was like okay, this is when you know it's serious. We were seated right in front of the see thru kitchen where I watched in amazement how these ladies went in on hand rolling every roll. I was enchanted and intrigued as if I was watching an art exhibit. It was art. Beautiful, delectable and intricate I couldn't help but gaze how they perfectly folded and pocketed each dumpling. Reality hit and I felt really bad, that's a lot of fucking dumplings to roll every minute of every day and they probably never want to look at another fucking dumpling ever again. Still delightful and magical from a third party perspective ::heart emoji eyes:: <br><br>We couldn't decide how many we wanted because we feared if we got too much it would be well, too much. I was so excited hearing about how cheap the dumplings were for how much you get, that I forgot to even read the prices on the fancy IPAD menu. I was more focused on what type of dumpling we wanted because they have a HUGE wide array of options/selections. Let's face it, it wouldn't have stopped us, but still the bill was surprising.<br><br>So we requested the beef sticks as an appetizer. The bad news was they ran out of beef. The good news? They offered lamb instead. Say no more! The lamb sticks came out and they seemed over seasoned at first and for some, it might be. It tasted like a hint of overkill of Adobo and we all know with seasoning, less is more. Somehow, this worked for me and I thought they were succulent and delicious. Sometimes overkill is needed. <br><br>We decided to start with 2 orders of 12 rolls. We thought, okay, that'll FOR SURE be enough. We had to request the infamous lamb and coriander rolls. We couldn't decide if we wanted steamed or fried. So we also requested to shrimp, cucumber and egg dumplings. We decided for the meat we would request fried and for the veggie, steamed.<br><br>Holy fuck. Not disappointed. Each dumpling was worth the wait.  Delicious, tender, perfectly chewy, soft, fluffy, perfectly doughy, I couldn't get enough. It was your quintessential dumpling. Simply divine and perfect. <br><br>We decided it wasn't enough and requested one last order of beef and green pepper dumplings fried. They were good but def would stick with your \"non-basic\" dumpling such as anything with coriander. <br><br>Service was good and attentive. Food was excellent. Price? It hurt a little but for what we got and the quality of it, I can't complain. If you're reading reviews that say 6-8 dollars a dumpling, it's no longer the truth. It's no secret this place has caught on to their own hype with their fancy dumpling view television in the waiting area and have more than likely amped their prices to date. <br><br>Can I blame them? <br><br>Nah, because in this case you are getting what you pay for in every perfectly fluffy crevasse of each deliciously rolled dumpling.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/64nMB9ZBEbk-9ynRSpkkPA/348s.jpg", "caption": "Fried lamb and coriander dumplings"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/-ZUJ03nVn6n4GR_r9zo78A/168s.jpg", "caption": "Steamed shrimp dumplings"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ZSruizng9nIKdQ6NVUKWhw/168s.jpg", "caption": "Steamed shrimp, cucumber and egg dumplings"}]}}, {"review": {"des": "I remember the days of Prosperity Dumpling in NYC's Chinatown with their 5 for $1 delicious handmade dumplings until they unfortunately shut down due to the horrific discovery that their dumpling ladies were making them in the dirty alley outside the building, with the rats...trash...and polluted city air. I'll admit this really wouldn't have deterred me from visiting again for delicious, cheap dumplings. I'm disgusting, I know. It's the same reason I keep going back to Sun Wah despite their many, many shutdowns by the health department. Their Peking duck is just such a good deal.<br><br>QXY offers quality dumplings at a higher price (12 for $9) in a much cleaner, family-friendly environment. The elegant Asian decor (beautiful chairs but clunky), handpainted porcelain tableware, fluorescent lights that reveal any imperfection, the diverse crowd, and the iPad menu (which is nice in theory but you know those aren't wiped down as much as they should be) all contribute to some reassurance that you're eating in an establishment where you can simply enjoy your food. There are so many options for dumpling fillings here, proteins include shrimp, pork, beef, lamb, or chicken. Pair your protein with a vegetable/herb like Napa cabbage, zucchini, mushroom, leek, dill, or coriander, just to name a few. I enjoy the beef and coriander, or classic pork and cabbage, boiled over steamed. It keeps the homemade dumpling skin al dente. The potato salad appetizer is also really tasty, shredded, crunchy, vinegared, and spiced, get it!<br><br>Oh and they offer dumpling making classes! Not sure how much it costs though. But you can register on their website. Dumplings are near and dear to my heart. It reminds me of family gatherings around the dinner table folding hundreds of dumplings together and then boiling and devouring them. I also love that every culture seems to have their own version of a dumpling... samosa, momo, mandoo, empanada, pierogi, ravioli...I love them all!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/dTLr9DCE7Kdh2nw4PFzgQw/168s.jpg", "caption": "Fish and peanuts, Potato salad"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/nSiN2agItp34o8T20zR3mw/168s.jpg", "caption": "Boiled dumplings"}]}}, {"review": {"des": "We ordered the pig ears, the Hot and Spicy and the 12 boiled Pork and Shrimp dumplings and also the Chrysanthemums tea. <br><br>The pig ears are ok. I'd give it a 3/5<br>The hot and spicy is great! The dumplings are amazing m. I ate the dumplings with the soup in the hot and spicy and it was great! <br><br>Highly don't recommend the overpriced tea. Tea is normal free at Chinese resto but this was $10 for a small pot of hot tea. NOT worth it. <br><br>I'll be back for the dumplings though.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/doH0mCC84EqwRfntP4IblQ/348s.jpg", "caption": "The Hot and Spicy. This is more like a soup with lots of things in it. Very little noddles."}]}}, {"review": {"des": "Best dumplings in Chicago.<br>Quite expensive and the portion is not generous, but make sense cuz they hand-made all dumplings right at your order. You can see them rolling fresh dough, making dumpling stuffings through the kitchen glasses. Also, probably the best decoration among Chinatown restaurants. <br><br>Always need to wait, but only for about 10-30mins. Worth a visit.", "pics": null}}, {"review": {"des": "This is how good this place is. Have you ever been somewhere that is so good, so unique, so utterly decadent, that you risk bodily injury?<br><br>This is that place for me.<br><br>The dumplings are so good, with their blends of meats and herbs. Beef and onion, pork and leek, and chicken and coriander are always my go-tos when I stop in, but a hot mouthful of any of those, or a rub in the chili sauce available at any table makes this a treat for your taste buds.<br><br>But here's where injury comes in.<br><br>They remodeled a while ago. New wall coverings, tables and chairs. <br><br>I am 6 foot 6. And I can't put my legs under the table anymore.<br><br>My girl is 5 foot 3. She can't either. <br><br>So we sit, legs positioned in such a way that causes my legs to cramp and my girl's hips to tighten, as we eat more and more delicious dumplings. <br><br>Is it worth it?<br><br>Yes.", "pics": null}}]}