{"name": "ramen-san-chicago", "reviews": [{"review": {"des": "Ramen is my husband's favorite food, and we seek it out on every trip around the country (1-2x monthly.) Ramen-San in the River North neighborhood of Chicago is consistently on our favorites list. While I wish their vegetarian ramen could be a bit more innovative, the traditional mushroom broth ramen is well executed. Moreover, the innovation comes in for me with the mushroom bun, a traditionally pork or meat dish. I was thrilled with the bun and could have happily had a few as a meal. <br><br>We look forward to our next Chicago trip which will undoubtedly include Ramen San! No wait Sunday at noon.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/iI18lZB2FmKGD9vbynqKcw/348s.jpg", "caption": "Spicy Miso Ramen + Egg + Corn"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/YD4KhSt3vYWnsEFvI-HeDA/168s.jpg", "caption": "Mushroom Broth + Egg + Corn + Bok Choy"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Omul3QHPOlz7E09mRNuM9g/168s.jpg", "caption": "Mushroom Bun"}]}}, {"review": {"des": "I once fell in love with a braised beef noodle bowl while visiting my sister in Bolder Colorado.  Then my sister moved and I haven't found love like that since...until I visited Ramen-San.  During my first visit I ordered the special, the Short Rib Pho.  The noodles were perfect, the short rib was perfect....it was like love at first sight.  I couldn't stop thinking about it and knew I only had one more day in Chicago before I had to leave for home so I went out of my way to go back to Ramen-San the next day.  This time I tried the spicy Szechuan wings AND another Short Rib Pho bowl...because we are in love. <br><br>After telling our waiter how much I loved the pho and that I came back again just so I could eat it again before leaving he gave our table a free dessert (hot donuts).      <br><br>Also, they play a sweet mix of 90's rap music....MARRY ME!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/m-gYmSzDquw2cgM0JFAeOw/348s.jpg", "caption": "Short Rib Pho. Daily special was awesome!!!!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Qgf-lx-HUSo2lSYokgUD_Q/168s.jpg", "caption": "Sumo bowl...it's huge!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/02LVnXxENPMqYrCqwCjpgw/168s.jpg", "caption": "Spicy wings"}]}}, {"review": {"des": "Oh wow, what first time fun!  Busy lunch hour crowd, only had couple tables open.....a great sign!  Super service, easy to understand menu and the actual food? Scrumptious!  We started with fried Brussels sprouts - wow!  Getting good now!<br><br>Wife had kimchi and chicken ramen. Had spicy indicator which you just have to try to see what works. For the record, I am a wuss regarding spicy stuff.  This dish was very flavorful, just a little too hot for me. She really enjoyed it!  I had the Tonkotsu with bok choy and corn, ah just right!<br><br>On the lunch list for frequent visits!  Thanks and Merry Christmas!", "pics": null}}, {"review": {"des": "Went back today for a pho broth ramen...oh boy...it was delicious!!! However, for the price, that's quite a bit for a ramen.<br><br>In any case, still worth it and what I like is the way the beef is cooked and the touch of spicyness in it!!!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/n7rQnNXdzK0MHOennRR5bA/348s.jpg", "caption": "Feature ramen with pho broth!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/bfoI2tqY3FWyc0e39txYMg/168s.jpg", "caption": "Cilantro-lime Margarita"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/TitRQrUkO3APKyfY4HhFlw/168s.jpg", "caption": "Spicy Miso Ramen with Molten Egg"}]}}, {"review": {"des": "I'm going to be up front and say while the food was delicious, this 5-star score is all about their delivery service. But you don't care about what, so let's discuss the food.<br><br>I ordered too much food stuff for reasons: chicken bun, shiitake ramen, and thai wings.<br><br>The thai wings were okay, but I wonder if it's partially because they were delivered. I had to add the thai sauce to it (I appreciate this), but I'm sure they're a lot better coming piping hot to the table. In this case, the flavor was there, but it wasn't infused into the meat the way I wanted it to be.<br><br>The chicken bun was really good. I'd never had it before and hadn't had it since, so I literally have nothing to compare it to. But still, the bun was soft and the chicken was crispy. Gold star!<br><br>The shiitake ramen, y'all--wooooowee! I love shiitake mushrooms because they're so flavorful, but having several other ingredients in the ramen muted them a bit. They were still the star of the show, but the green onion, seaweed, noodles, etc. really complimented them well.  The broth was delicious: bold and smooth.<br><br>Ok so all the food was good blah blah. Their delivery service was on point. It's highly possible I'm easily impressed with delivery services since I live in a Tennessee city where mediocrity is the city motto. Chicago is an actual lively place, so I'm glad they have their service down to a science.<br><br>My food came rather quickly--probably about 10-15 minutes after I'd ordered it, which was a surprise. The only way that could have happened is if the delivery man rode a bike or something. <br><br>What was really impressive was how everything was packaged. As I mentioned before, the sauce for the wings came in a separate container so it wasn't spilled all over the place. The broth for the ramen was separate from all the other ingredients, so I had the pleasure of heating it up and putting it all together myself. <br><br>Everything was packed tightly and organized nicely, and there were instructions on each item. Instructions! This is what excellence looks like, folks.<br><br>I don't live in Chicago so I'll probably never go back, but if I'm in the area again, I'd loooove to return and have another wonderful dining experience in the privacy of my hotel room :)", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/qpUPXumwdrANbUG2uco5kQ/348s.jpg", "caption": "Delicious meal!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/HQ42YQk8X_oNZxeVvQCkQA/168s.jpg", "caption": "Shiitake mushroom ramen with fried garlic $14"}]}}, {"review": {"des": "During our visit to Chicago, my group of friends I traveled with wanted to grab a bowl of ramen. After doing our research, we wanted to try Ramen-San! With a short walk from the Magnificent Mile on a Sunday afternoon for a late lunch, we were greeted by friendly hostesses, knowing that we love ramen and that this was our first time at this place. With a less than 20 minute wait, we were promptly seated in a booth.<br><br>What's cool about this place was the express lunch, where you can get half a bowl of rice with miso salmon, shiitake mushroom, or chicken Katsu and a half bowl of tonkatsu or shio ramen. Obviously the best of both worlds here was ordered for me with the chicken katsu and tonkatsu ramen. A side salad was also served. The katsu over rice was tasty and the ramen was flavorful, not too thick and not too salty just the way I like it. My only complaint was that it could be a little more warm.<br><br>Overall I will definitely come back to this place on a visit back to Chicago. I won't forget the friendly people we met that served us during our time here.", "pics": null}}, {"review": {"des": "Nothing says @#$% you winter like a big bowl of ramen when it's below freezing outside.<br><br>Had the opportunity to pop into lunch here and managed to get a table without too much of a wait (it's not a huge place).  There are tables, booths, counter and some long counter height tables for seating.  If you're looking for a big group - it gets a little tricky.  <br><br>We tried a few of the lunch bento type specials (the express lunch) and here's the rundown:<br>Shio ramen - very light broth that is good but don't expect to be bowled over by flavor. Added some fried chicken - was hoping for something more like a karaage but it was just semi-warm chunks of fried chicken (sadness).<br>Tonkotsu - this one has a richer flavor and has a couple of big chunks of chasu that are really good. Added some buttered corn which is always good.<br>Both of the ramens had a molten egg - which is really just a 6 minute egg and not really an ajitama<br><br>Miso salmon - this was good - and lucky not over saturated with miso glaze like some places (i.e. way to salty).  Perfectly cooked and not dry.  <br>Skirt steak - well-seasoned with that smokey grill flavor and cooked medium (perfect).  Really went well with the rice.<br><br>The bento also came with some pickled cucumbers which were good but I would have loved a bit more vinegar and spice.  Small salad-san on the side with ginger dressing was great.<br><br>We also tossed down a few drinks:<br>Japanese ol' fashioned - nice big whiskey flavor<br>Penicillin #2 - liked this drink - nice balance of flavors with a candied ginger to polish it off", "pics": null}}, {"review": {"des": "Noodle, do the noooodle dance.<br><br>This is my new favorite ramen place in Chicago! (Sorry, Wasabi!) Besides the crammed seating, I love the brick walls and lively, upbeat atmosphere. 90s pop was playing. <br><br>BAO BUNS!!!!! Ordered under \"Mantou Buns\", these are delicious and addictive appetizers. $5 each. We tried the Fried Chicken and the Pork Belly. The Fried Chicken was good and a safe bet for most people, but the Pork Belly Mantou Bun was outrageously delectable. Crispy, firm, flavorful pork bits slathered with spicy mayo and kimchi cucumber. Indulge your tastebuds! <br><br>We all ordered different ramens, and I had a taste of all the broths. All ramens here are rich and heaping with portion. You can't go wrong with ordering the broth you like best here. It's up to your preference. For me, I love miso ramen. It's creamy and vibrant with a smoother taste. So, naturally, I ordered the Spicy Miso Ramen ($14, ground pork, napa cabbage, chilies-- a favorite of most and now a favorite of mine)! If you eat spicy food on the regular, this broth has moderate spice level. Make sure to ask for the Special of the Day Ramen. LARGE BOWLS!!!<br><br>DRINKS! Compliment your ramen with a drink here. I ordered a sweeter drink since I knew I was ordering spicy food. The Penicillin #2 ($12, Iwai whiskey, lemon, ginger, hakushu rinse- refreshing, lighter tasting, ice cold, not as sweet as I imagined, real ginger cube) is a crowd pleaser and I can see why! Great for upset stomachs!<br><br>The only downsides of this restaurant (which I can easily overlook) are the two one stall bathrooms for both women and men, aaaand the fact that we walked right past this place due to a smaller sign. Other than that,  Ramen-san has won my heart and stomach over!!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ENULQplfNgxUThl7nQmJYw/348s.jpg", "caption": "Spicy Miso Ramen"}]}}, {"review": {"des": "What's my favorite type of men? Ramen!!! I love me some good ramen and this place surely delivers! I love broth, for me the broth is ridiculously important. They do a great job with the broth. <br><br>Before I get into the ramen, let's talk about the pork belly mantou bun. Served with some sweet pickled cucumber, this pork bun is a good appetizer to start with. This bun is nice and crispy, with a little sweetness. Also, what I like is that the bun isn't super dense, so it's not so filling. <br><br>Now ramen time!! The kimchi and fried chicken ramen is a hallelujah moment waiting to happen. Served with fried garlic and buttered corn, this ramen doesn't disappoint! I also highly suggest adding Chashu! Those bad boys are so good! Now the broth definitely has a nice kick due to the kimchi and it's also has an overall nice flavor, and the noodles are delicious! <br><br>Let's talk drinks! The penicillin #2 is this delicious honey ginger cocktail that really does cures what ails you! Highly recommend this cocktail. <br><br>As for service, it wasn't anything out of this world, but it was good. Good attentiveness and the food came out at a reasonable time. <br><br>This place is great for lunch or dinner. They also offer bento boxes for lunch that include a half portion ramen. <br><br>This is another spot I will be going back to on my next visit.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/MtDy_9H-XAij9lGKhL8H8Q/348s.jpg", "caption": "Margarita"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/EQQg7iu0foO6ayTcJDi8hg/168s.jpg", "caption": "Penicillin #2"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/mvLFDlbJvZuksh9-FaDRlA/168s.jpg", "caption": "Pork Belly Mantou Bun"}]}}, {"review": {"des": "Is it terrible that I feel like I cold sit here for hours jamming to their super chill music.  Granted the high top seating is not conducive to my short legs...grooving to the beats makes it A-OK!<br>Great service and consistent food.  I do love they are open late. Nice place for groups or on a date. They have lots of fun tasting cocktails and a lot of different Japanese whiskeys.<br>I'm a fan of the tonkatsu ramen, the broth has a nice full flavor.  Also the kimchi and fried chicken are tasty...because it's rare that fried chicken is not tasty....add it into soup...and mind blown! I always add an extra egg, because I love eggs!!!!  <br>I've also had take out from here and everything was packaged nicely so noodles and broth were all intact by the time I got it home.", "pics": null}}, {"review": {"des": "Decided to stop in on a cold October day because what's better than a steaming bowl of ramen on a windy chilly day? At around 1, we were told there was a 20-25 minute wait, but we only waited about 15. (You leave your number and they'll text you when your table is ready and you'll have 10 minutes to make it back). I love their seating! Their booths are wooden and they also have high top tables and seating. <br><br>My boyfriend and I both decided to get the express lunch ($15) with tonkatsu ramen and miso salmon; It also came with a small salad and seasoned cucumbers. The noodles were a good chewy texture, but the broth could have used more flavor. Everything inside of the broth was great too, although it was a tad bit too much green onions for me. I'm also not a huge fan of cooked fish, but the miso salmon was cooked really well - super tender and easy to eat. A dinky bit too salty for me, but it worked out with the amount of rice it came with. The express lunch also comes with some seasoned cucumbers which were very crispy and tasty! Would love to return and try crispy chicken and kimchi ramen. Didn't end up ordering it since it wasn't on the express lunch menu, which is more limited.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/xhdc8aB5JAFIUqr3ckJFZw/348s.jpg", "caption": "Express lunch - Miso Salmon and Tonkatsu ramen"}]}}, {"review": {"des": "Came to Ramen-San after doing the Chicago Architecture River Tour (definitely recommend doing this!). It was a cold afternoon - low 50s so us California natives needed to warm up. <br><br>We got seated right away. We were pretty hungry so we ordered a bowl of ramen each, plus some dumplings and wings. <br><br>+ Spicy Szechuan Chicken Wings- 8.5/10 - these were really crispy which I loved! They were covered in red peppers which we had to dust off a bit. If you love crispy, spicy wings, I would def try this!<br><br>+ Crispy Chicken and Kimchi Ramen - 10/10 - I loved this. I added an egg which was the perfect touch. The chicken was nice and crispy. The broth had the perfect amount of spice to it. I really enjoyed it. <br><br>+ XOXO Shrimp and Pork Wontons - 9/10 - these were really good. You can definitely taste the pork in there. <br><br>My brother and boyfriend got their ramen special that day which was a brisket ramen and both really enjoyed it. Overall it was the perfect lunch and definitely helped warm us up after a cold day. It was a little pricey though.", "pics": null}}, {"review": {"des": "This is a hard to find spot, you have too look carefully. It's a small door that could easily missed even you're across the street from them.<br>I got there on a cold Sunday night and it was packed. The wait was about an hour, but fortunately, I got a seat at the bar within 20 mins. <br>I got a special ramen that was recommended by the waitress. It was not on the menu, but it has tonkosu broth and katsu pork.<br>It was pretty good and I was happy with it. Perfect fix for a cold windy day.<br>The customer service was very good. I complained that my eggs had no York and they gave me another egg.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/QVKNKcTWfvda3rCWoAg0Lw/348s.jpg", "caption": "Unique sink design"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/svCV-0dEQsiLAK5bFtc8yw/168s.jpg", "caption": "Special Ramen. I'd give it  3.5/5"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/YjQTdfR1G1qi7cnu3ybEvg/168s.jpg", "caption": "Egg replacement"}]}}, {"review": {"des": "Taste: A-/B+<br>Atmosphere: A<br>Service: A-<br><br>Solid ramen, but nowhere near the top of my list. <br><br>Had the fried chicken & kimchi ramen, and the fried chicken was great (freshly fried/put in right before serving), just wish there was a bit more of it.  <br><br>Fun vibe with hip hop music and dimly lit. Could see it being more fun for dinner than lunch (when we went). <br><br>Would recommend!", "pics": null}}, {"review": {"des": "Winter is here, so naturally it's time for me to shift my appetite towards more soup based, and comfy style meals. Ramen falls perfectly into this realm of optimal late fall/winter meals for its warm herb filled broth, noodles and veggie toppings to compliment the bowl. <br><br>Ramen San is one of many Japanese restaurants in Chicago that caters to the Eastern influenced cuisine mashed with American 90s hip hop culture; a peculiar mix but somehow it all works out just fine. There's tables for group, although the overall space is pretty tight, and bar service as well. I ordered myself one of my favorite ramen bowls, the tonkotsu ramen, and the waitress was very helpful and friendly to all she was waiting on. My food came very quickly and the quality of the ramen was spot on. Not too salty of a meal and extremely filling as the pork belly was cooked just right. Dessert is also offered here as well. <br><br>Loved my experience at Ramen San. Definitely one spot to check out in the River North area that won't break the bank.", "pics": null}}, {"review": {"des": "This is a really great ramen spot in Chicago. For some reason, I had low expectations but I'm glad I was proven wrong. Since it is in downtown, I was not surprised it was busy during the weekday lunch rush. Fortunately there was bar seating available, so I sat down right away.<br><br>Tonkotsu ramen was delicious. Great amount of flavor and the chasu had the perfect amount of fat to meat ratio. Fried chicken mantou bun was great too. Japanese mustard isn't overpowering. Chicken isn't too oily and fired nicely.", "pics": null}}, {"review": {"des": "I let my husband pick out the restaurant when I dragged him to a show at Chicago Theater, and this is what he chose. I'm like, really, we're going out for ramen?!  K. <br><br>Wow, I was so impressed! First of all, it's a really cool place with an open feel, long wooden tables, and awesome music that just makes you happy to be there. We both tried the waygu gyoza first - beautiful little dumplings filled with the most tender and tasty beef. The dipping sauce that came with them was a perfect complement as well. For the main course, we both chose the tonkatsu. My husband added sesame chili to his but I got mine without anything extra and added in a little chili oil at the table. The ramen was incredibly flavorful and absolutely perfect after walking 25 minutes from the train in cold rain. <br><br>Seems weird to be excited about ramen but I already can't wait to go back and try more things! Top notch place in every way.", "pics": null}}, {"review": {"des": "Best ramen ever!  We stopped by early on a Friday evening, and got right in. Music was banging overhead, and our waiter was decent. They only offer beer and sake-based drinks, so I went with a watermelon beer which was cold and refreshing.<br><br>We started with an appetizer of ahi tuna, and it was a delicious, interesting combo of tuna, guacamole spread, and cracker.  The tuna tasted very fresh, and the guacamole was very creamy.<br><br>Ramen came out shortly afterwards, and it was fabulous. The broth was flavorful without being salty, and chock full of the various mixers that makes or breaks a good noodle bowl. It was also a little spicy, which took me by surprise. The pork was lean, and sized to easily consume without making a mess. I added extra bok choy, which was obviously a good decision on my part. Every bite I was exclaiming at how tasty it was.<br><br>We only had a limited number of meals to eat in Chicago, but we still tried to plan a repeat visit here, because it was just that good.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/GABySaw2Hp2sQs2oxROkrg/348s.jpg", "caption": "Hell or high watermelon to drink."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Xwa155x9b6izSnVKj12Fag/168s.jpg", "caption": "Raw tuna appetizer."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/XR593kKavhznpRZi0m1D_A/168s.jpg", "caption": "Perfect tonkotsu ramen with added bok choy."}]}}, {"review": {"des": "Very. Good. Ramen.<br><br>Ended the day of Chicago Open House with my mom at Ramen-San in River North. This was her first experience with ramen and this place appeared to be the real deal close to where we were. It was.<br><br>The inside of the place is fairly dark. It's a little tight inside but it adds to the ambiance. Light colored wood furniture, all the tables at bar height and the dark stone/brick walls made for an amazing space. It was also pretty busy.<br><br>We sat at the bar. Started with a margarita and can of cold saki. The margherita was really good, my mom liked it a lot. My can of saki was okay, I thought it to be pricey for $11 though.<br><br>I had the tonkotsu and she had a special duck curry ramen. Mine was fantastic, perhaps the best ramen I've had yet. Very rich broth but not overly salty (all ramen is a little salty to me). Ingredients tasted fresh and the chunk of pork meat was amazingly tender. Noodles were perfect texture. <br><br>Mom liked her ramen a lot, I thought duck curry was a bold first choice for a ramen bowl, but she really really liked it and I have to admit after trying it was better than I thought it would be. Super flavorful and rich.<br><br>Service was good. We didn't need much and although the bartender was busy, she was also attentive to us.<br><br>Bowls were not cheap, about $16 each and the drinks $11 each. Everything was really good though. Super authentic spot for amazing ramen.", "pics": null}}, {"review": {"des": "Really good Ramen, in fact one of the best ones in Chicago. I like to add extra pork belly to all my bowls. <br>I wish the seating was more organized. I've been getting them for delivery lately. Still everything arrives hot & steaming. Thank you.", "pics": null}}, {"review": {"des": "Ramen-san is #6 in my list of ramen places in Chicago.<br><br>The richness of the broth and the noodle texture were excellent in each of the 3 bowls we got: tonkatsu, sumo, and the special ramen bowl (I don't know what they called it...something with braised pork shoulder).<br><br>The tonkatsu was straight forward. It was delicious, but doesn't beat Wasabi.<br><br>The sumo was just insane...it had wonton and some crushed eggs (I didn't even know that that was a thing). It was massive, a big boy's meal for sure. The broth was rich, it was excellent. This bowl is for the hungry for sure.<br><br>The ramen special for that day was good. It had a kick, the broth was amazing and the noodle was perfectly made. However, jury is still out if I liked braised pork shoulder oppose to the chashu (pork belly). The purist in me is weirded out that it wasn't a pork belly in the ramen. I guess, it was like the kimchi and fried chicken that they have, which I thought was delicious. But, it's a totally different protein, whereas the other one is within the same animal. I'm still confused by it.<br><br>Anyway, it's still delicious regardless. I do recommend this place if you happen to be in the neighborhood. The ambiance is amazing, too. The servers are nice and knowledgeable.", "pics": null}}, {"review": {"des": "I had a hankering for either ramen or pho this past Wednesday, and my boyfriend said he knew of the perfect place to go in River North. We hopped in a car from Lincoln Park and I was surprised when we were dropped off in front of a building I'd walked past quite a few times but barely gave a second look. Intriguing.<br><br>The inside of Ramen-San is enticing but subtle: brick walls all around, a ton of gold Maneki-neko cats behind the bar area, quite a few private tables, and one larger community table near the front. There are also outdoor tables as well. We were seated immediately when we arrived around 8pm on a Wednesday, and there were still plenty of open tables. They were playing '90s hip hop. My boyfriend was very pleased with all the Biggie, and sang every song. <br><br>Their menu features nigiri, buns, and ramen, just to name a few items. The menu offers quite a few pre-made bowl creations, with the option of adding other ingredients, like Brussels sprouts or kimchi. After careful deliberation, I ordered the Tonkotsu bowl (broth, chashu, molten egg) because pork in a ramen bowl is always a good idea. I also ordered a glass of Asahi cold draft beer, because why not? My boyfriend ordered a glass of Japanese whiskey and a sumo bowl (chashu, xo wontons, and spicy crushed egg).<br><br>Our ramen bowls were brought out on upscale black and red cafeteria trays with mini ladles and chopsticks. It was adorable! Of course, the bowls were gigantic, because that's what real ramen is all about, baby! My bowl was so fabulous: the chashu fell apart in my mouth and the broth was so delicious. I know the ladle was to scoop and slurp the broth, but it helped as an additional tool to wrap my noodles around my chopsticks when I was having trouble (I'm the worst quarter-Asian human ever). <br><br>There are all-gender restrooms, a bar to sit at to have drinks, and patio seating, along with a fabulous menu. I recommend this place for a unique dining experience in River North, or if you're just looking for ramen!", "pics": null}}, {"review": {"des": "I didn't think I would find a great ramen place in Chicago but LO AND BEHOLD I found this place on my last night here on vacation. We had a party of 7 so we took up one of the back booths by the kitchen. The restaurant was dim but you can tell the decor there is the new hipster ramen bar next door. Also please check out the bathrooms - I'd like to note that the sink was pretty cool. <br><br>The server was prompt and did a good job describing the menu and drinks. I ordered the duck ramen special and she warned me that it would be spicy so I asked for it to be mild. <br><br>When the food came out, we were starving so we started eating right away. At first I didn't mind how spicy it was but then it got to the point where I was not enjoying my food like everyone else. The server came around and I mentioned how spicy my dish was. She was fantastic and insisted on bringing me another one - definitely mild this time. <br><br>The prices are fairly typical here so don't hesitate to come in to warm your soul up with some delicious broth - just don't ask for too spicy.", "pics": null}}, {"review": {"des": "Came here for lunch (12:15) on Friday. Let me start by saying that the estimated time they give you is completely, utterly, totally wrong. They estimated our wait time to be 20 minutes, but we were well into 40 minutes before I had to ask the gentleman how much longer it would be -- to which he said 20 minutes...? This, of course, wouldn't be as long if they hired more bus boys to help the singular individual cleaning tables. Multiple tables would be left unclean for 10 minutes with a long line waiting. Like, is it that hard to hire one or two sets of hands to help? I'm sure you can afford to with how many people dine here.<br><br>If you want to be seated right away, there are community tables and open bar seating. Information that would have been nice to know when we put our name down.<br><br>Anyway, we finally got the memo that we could sit at a community table and so we took a seat. Service was slow.<br><br>I had the tonkotsu ramen, which was ok. The ramen itself was fairly good. Rich broth and well cooked noodles. Toward the end though, my tongue was oversaturated with sodium.<br><br>TL;DR -- Expect a long wait and unreliable service and staff. Food itself is ok. With that said, if you want to try this place, go to the one in WEST LOOP's Fulton Market Dining District. Friendlier staff, organized, fast, & same food.", "pics": null}}, {"review": {"des": "Highly recommended to make a reservation for dinner as it gets quite packed during that time. Service was great as they gave us a complimentary dish because we had to wait in line for quite a bit though we've made reservations. Had the Tonkotsu ramen and it was a little bit more watery than I'd like it to be though had the perfect amount of meat to bring out the flavor.", "pics": null}}, {"review": {"des": "Pretty hipster ramen place. Cool vibes. <br><br>We came on a Sunday at lunch time. It was pretty darn pack but we got sat right away. My other half got a green tea drink and the lunch special, which consists of a mini ramen bowl, rice bowl, apps and a side salad. Such a great deal! Definitely recommend. I got their ramen special of the day, which had smoke pork. I really liked my ramen but I have had better, especially coming from California & gone to Japan. It was really good, I just didn't like the smoke pork. It didn't fit my taste buds & I felt it didn't go well with the ramen. Overall, I had a pleasant experience & fulfilled my craving for ramen i had on our trip.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/bdjRH17jzEhCJU_loxVz8Q/168s.jpg", "caption": "Our Lunch! Lunch special & daily ramen special w/ smoke pork."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/zbBTzlB5Ye0dPB4ILOdIrQ/168s.jpg", "caption": "Green tea."}]}}, {"review": {"des": "Decided to come here late tonight.  They have some very delicious ramen!   They have probably some of the best that I've had outside of Japan and NYC.  The prices aren't too shabby either.  We had the tonkatsu ramen which was very robust in flavor and had generous portions of meat.  The dumplings were also very tasty as well, they were not the best that I've had though.  If you have a sweet craving, you should get their Yuzu lemonade.  It's super sweet and tasty to boot!  <br><br>You can probably get your dinner here for about 50 bucks for 2 people.  It is pricier than your normal meal, but that is pretty standard for a ramen place.  One thing I wasn't sure I liked was that it had this sports bar theme.  I came here hoping for a more Japanese theme and once we sat down we noticed tons of sports games playing.  I wasn't really feeling it.  Other than the vibe, the place is pretty darn good!", "pics": null}}, {"review": {"des": "One of the main reasons for visiting Chicago was to try Ramen and after doing some research, I went with Ramen-San being that it was close to where I was going to be.<br><br>I got there little after 12pm and the host greeted me and when I said one person, they directed me to the bar.  I sat down the gentleman behind the counter brought me the menu and after reviewing it, I decided to do with the lunch combo and one bun.<br><br>For the lunch combo - I went with Skirt Steak and Tonkotsu ramen, I added fried garlic, buttered corn and kimchi.<br><br>Before ordering the Mantou Bun, I asked the server what was the most popular, he told the pork belly, but his favorite was the fried chicken.  So based upon his recommendation, I went with the fried chicken.<br><br>Manto Bun - Fried Chicken.  The chicken was fried perfectly, but it wasn't seasoned at all (maybe lightly), but I definitely could not taste the seasoning.  I was hoping the the mustard would have enhance the flavor, but unfortunately it did not.  It just felt like eating fried chicken on a bun :-(<br><br>Lunch Combo - what I got on the plate:  Miso Salmon, Tokotus ramen, kimchi, salad and couple slices of what looked like to be cucumber kimchi.<br><br>- Miso Salman, the salmon was excellent, went very well with the miso, the tomato and shishito pepper were more for plating decoration.  If they had this on their regular menu I would definitely order this.  Now, there's something wrong with this picture... when I ordered the combo, I asked for Skirt Steak and the server double confirmed this when entering the order, but they gave me the miso salmon.  Yes, I could have said something, but I'm all about the first impression and if after confirming the order (in this case 2x) and they still get the order wrong, then that needs to be addressed.<br><br>- Tonkotsu Ramen - broth was good, but to be honest I had better.  Overall, not bad... I think it would been a lot better had I not added the fried garlic... the garlic overpowered the whole dish - so skip this.  <br><br>Kimchi - ok, not worth the $4.<br><br>Service - mediocre at best... the staff were very focused on two large group, which meant the smaller groups or folks at the bar suffered.  <br><br>Overall, I like how they have the lunch combo option, it enables you to try two dishes in one sitting.  If it wasn't too busy, I would have ordered two sets of the lunch combo, so I could try other items on the menu.", "pics": null}}, {"review": {"des": "1524k and counting reviews. Does mine even matter? <br>Los Angeles native here on a work trip. Asked a local for a ramen spot and he eagerly sent us here. <br>Busy little spot, but we were sat fairly quickly. Friendly waitstaff, quick serving up of the food and the atmosphere was great!<br>The ramen was really good. I love LA, but would love to have a Ramen-san here too. <br><br>Try it...Love it...Yelp it...", "pics": null}}, {"review": {"des": "Quick review: vibe is good and trendy, great selection of Japanese whiskey, food taste below average, food is very salty <br><br>I've been here three times and every time I regret it. The best tasting thing in my shrimp/pork dumpling was the green onions. Dumplings were very salty. My cilantro margarita was okay a little too salty, maybe having it with the dumplings made it taste saltier. To me, the ramens has always been below average tasting.<br><br>Also, I tried a taste of their kimchi before I ordered a dish with it and I'm glad I did. I'm Korean and that kimchi doesn't have much flavor. I don't think Ramen San makes it. I think they buy it.", "pics": null}}, {"review": {"des": "Let me start off with the positives:<br>The atmosphere is pretty nice, which definitely set my expectations high. In addition, the servers were great and there were no issues with service, and the dessert menu has got to be the cutest thing I've seen in a long while. The end.<br><br>You will notice that I've not said one good thing about the food. At best, it was underwhelming, and at worst it was like ordering cha siu fan and getting a head of iceberg lettuce, except with the lettuce, you can at least make something else out of it, so somehow it's even worse than that.<br><br>The first sign of something wrong was the use of obviously Chinese takeout chopsticks and cheap plastic Chinese plates. Seeing this raised a few eyebrows, but I decided to give the benefit of the doubt as the food is what decides it at the end of the day, not the cutlery.<br><br>My table ordered the wagyu gyoza, and I ordered the tonkatsu ramen while my friends ordered the sumo ramen; I'd say I got the better deal only because I paid less for disappointment than they did. The gyoza came out first and was fried together in a way that made all five of them connected by burnt dumpling skin, of which the non-burnt parts were far too mushy, and the meat was tasteless and textureless, resembling beef only in that it was solid. The noodles then came out and were somehow worse. The broth was passable, but everything inside of it was not. The noodles broke too easily when bitten, indicating that the noodles were frozen or made too dry in the first place. The chashu's meat was somehow dry but the fat completely fell apart in the mouth, not in the satisfying slow-cooked way but in the sense that meat was multiple days old and soaked in broth for another number of days. The XO wonton in my friends' ramen was about as bad as the wagyu dumplings, having a flavourless filling and bearing little relation to any kind of wonton I've ever had, Japanese or otherwise. Nothing was particularly wrong with the seaweed or bamboo shoots, but I feel like if there was something wrong with those plates might have been used instead of bowls and I would have gotten chicken alfredo pasta. It was so bad in fact that my friends did not finish their bowls, and one of them eats like a horse.<br><br>I only spent two nights in Chicago, but in the four meals I had while there, I did not have a bad meal outside of this one, and it was extraordinarily bad. The next time I visit I'm going to make it a personal mission to go find a ramen place that isn't this offensively awful. Please go elsewhere because ramen deserves to be made well, and this was a travesty.", "pics": null}}, {"review": {"des": "The fried chicken and pork belly mantou buns are delicious and makes you want more at the end of <br>each bite. Ordered the kimchi fried chicken ramen - spicy enough for one to enjoy heat and flavor at the same time. Service team are so attentive and on the ball. The only reason I am rating this at 3 stars is because the portion size  of the ramen is small.  For $16 bucks you better be up to the brim but this portion size is insufficient and not your usual (true) big bowls of hot ramen soup.", "pics": null}}, {"review": {"des": "Came with some friends as we were craving ramen and this was one of the closest spots with a good rating. Two of us ordered the tonkotsu ramen (most popular) and added in the sesame chilli for one and thai chilies for the other. Mine had the chiles added, but the  stilspice was not even there, which was disappointing. We both agreed that everything about the dish was just a little too salty, from the broth to the chashu pork and granted, we do get that ramen is salty but this felt a little too much.<br><br>My other two friends ordered the spicy miso and added the molten egg and think they were on the same page in that it's decent, but nothing special to come back for. I know they have several other dishes such as okonomiyaki and buns, but not sure I would come back since the ramen was so-so.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/gB7SlJg2tQNkbAcuk_Zd3A/348s.jpg", "caption": "Tonkotsu Ramen"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/A1t0T-_Af1reuHIdyUouZQ/168s.jpg", "caption": "Spicy Miso Ramen"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/c5XDBBX5BE58XI3CCxgmIQ/168s.jpg", "caption": "Kimchi on side"}]}}, {"review": {"des": "Came here on a Sunday night, right after Lollapalooza. This place did not disappoint. Luckily we got seated right away before the huge crowd. Coming from LA, I already loved this place, the first thing I notice on my ramen was the generous amount of meat in it. I must of had 4/5 slices of meat VS. the one big piece I get in LA.<br>The broth was good, noodles were good...the place was nice, great ambiance, good music. This is my fav Chicago Ramen spot!...til next time.", "pics": null}}, {"review": {"des": "I enjoyed the good service during my late lunch here. The fried chicken and pork belly baos were both delicious for starters. I tried the kimchi fried chicken ramen - glad the server offered to have the spiced oil on the side as the soup itself was quite hot already.  <br>The donuts were a bit underwhelming. They were moist and soft but I guess not my preference in flavor.", "pics": null}}, {"review": {"des": "3.5 Star. Late post: day 2: raining in Chicago: got lazy going out to eat after a long jog so I ordered take out. This place is ok. The review is only for togo. I do love their togo food set up. Their ramen noodle is ok nothing wow. The noodles isn't firm and chewy. The tonkotsu broth needs more flavor. A bit bland. Their spicy kimchi soup is soooo goood! The buns are ok. I think they need to work on the sauce and pickle veggies that comes with the fried chicken and pork belly bao. Their matcha is also nothing wow. Beard papa is better but it is cool that it's huge. Oh and I do love their XO wonton. Overall I enjoyed it. I will definitely come back but this time not togo.", "pics": null}}, {"review": {"des": "Consistently, legit ramen spot in River North. Usually hit up Ramen-san after work during the week, and the place is usually busy but tables turnover quickly.<br><br>The vibe is chill and always has a good playlist of hip-hop or rap going on throughout the night. Most of the seating is high top style; grab a table outside if you can for excellent people-watching with your meal!<br><br>I usually go with the Tonkotsu ramen but have tried the Kimchi & Fried Chicken ramen as well. The Kimchi & Fried Chicken just doesn't have the same savory, comforting broth of the Tonkotsu. Plus, the fried chicken gets soggy if you don't eat it asap. The Tonkotsu is delish! Broth is rich and savory; ramen comes with half egg and some hearty pieces of chashu (pork belly). Noodles have a nice bite to them; you can get a noodle refill for $3 too. <br><br>Definitely check out Ramen-san if you're looking for a good meal that's also quick!", "pics": null}}, {"review": {"des": "Decided to give this place a try due to all the reviews. <br><br>Well... This place was very mediocre, food wise. The music was great  <br><br>I got the smoked salmon nigiri. It was wrapped in cucumber and honestly all I could taste was the mayo. Like regular mayo that you would put on your ham and cheese sandwich (Starbuck's Ham and cheese croissant is really good btw) but back to my ramen. <br>The bamboo shoots was good and the broth was seasoned perfectly. Although my chasu meat was burnt (charcoal) I had to eat around the burnt part. <br>The Kim chi fried rice ramen was ok, not my fav. The chicken gets soggy pretty fast if you don't eat it right away. Overall it was a-okay.", "pics": null}}, {"review": {"des": "Fabulous Ramen. Great service. Great atmosphere. Came here with a few friends for lunch. Arrived around prime lunch hour, waited about 30 minutes  as told and was seated and greeted by our server instantly. I will be coming back for sure.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/f3LZ6bDmivTNNjfnNYtqiA/348s.jpg", "caption": "Delicious.  Best ramen I've ever had."}]}}, {"review": {"des": "This ramen was okay. I ordered the tonkotsu and The broth just seemed to be missing something for me. I added a few sauces which is pretty rare for me to do, but it still didn't quite hit the spot. It also didn't help that our server was pretty rude and when she gave us the check, she basically threw it at us. I live in NYC, but if I didn't, it would be unlikely I'd come back for seconds.", "pics": null}}, {"review": {"des": "Came here with a friend of mine to grab some lunch, and it was a delicious ramen spot! We both got the shiitake ramen along with spicy kimchi on the side! If you want some more spice definitely recommend getting the sesame chili on the side, and can't forget the molten egg! Great ambience and I loved the vibe of this location as well, much more upbeat then typical ramen spots. Enjoyed this a ton and can't wait to come back to get the Fried Chicken Ramen I've heard about! <br><br>Also, saw their lunch special it looked like a great deal that is definitely worth it. I was just feeling more ramen then anything else so I didn't get it!", "pics": null}}, {"review": {"des": "Ah, Ramen-san. To me, this place is synonymous with comfort. I lived in Chicago for a 3 month rotation and during that time I must have frequented the place at least 5 times. It was my go - to place on a sad day but I also found myself there on happy and celebratory days. I always ordered the same thing and left feeling satisfied each and every time. <br><br>As a vegetarian, I ordered the Shiitake Ramen + egg + sesame oil + garlic and it is, hands down, the best veggie ramen I've ever had! The noodles are perfectly al-dente, the broth is just salty enough, the garlic adds the right touch and the spice level is customizable. <br><br>Also helps that the bar is so well stocked - you can find anything you like here - especially craft beers and whiskeys. <br><br>**TIP: Sit at the counter facing the street in the summertime for some prime people watching. And then for dessert, head across the street to Firecakes to cool down w/ a donut ice cream sandwich. **", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/DZgb2H4Z9Nt9XX52iiBYTw/348s.jpg", "caption": "shiitake ramen w/ egg and garlic."}]}}, {"review": {"des": "Wow. Wow. Wow! Couldn't have been happier with my late night restaurant selection while visiting Chicago. This restaurant is in the middle of what seems like a chaotic party street...bars, clubs and people looking to party everywhere. That can either be a positive or negative depending on what you're looking for but it didn't effect my opinion of the place either way.<br><br>When you walk in, you're greeted by some old school hip-hop. You're seated in and informal cafeteria setting and given a paper menu. It's exactly the kind of vibe I was looking for.<br><br>Time to eat. It took a little while for the waiter to come over to our table but it was really busy so it wasn't an issue. We ordered their spicy pork ramen dish and their chicken fried rice. AMAZING! The ramen was very spicy...just the way I like it...and they didn't skimp out on the amount of meat which always leave me happy. <br><br>I have nothing bad to say about this place. Eat here. Order the ramen. Be happy.", "pics": null}}, {"review": {"des": "Ramen-san offers a pretty decent bowl of noodles! Stopped by here relatively early on Saturday night (around 5:30 pm) and we didn't need a reservation to grab a corner booth for 4.<br>My friends and I started with the pork belly bao sliders ($5 each, the 4 of us split 2)-- they're little finger sandwiches filled with a thick slab of pork belly, a homemade pickle, and some type of aioli sauce. The pork was nice and tender (although, c'mon, it's bacon, kinda hard to mess up bacon), and I love when bread is substituted with soft, fluffy bao. We also shared an order of the spicy szechuan wings, which came out hot and crispy from the fryer. They weren't really spicy, so I would recommend them even if you're somewhat afraid of heat like I am.<br>For my entree, I had the tonkotsu ramen. There was a big portion of noodles for the price ($15) and it came topped with a molten egg, chashu pork, seaweed, and bamboo shoots. The broth was flavorful and creamy, plus I added something available at the table called \"ramen pepper,\" for extra flavor.<br>We ended the night with an order of the hot donuts ($5). They were soft, sugar covered donut holes that came with a creamy vanilla dipping sauce. I'd recommend them as a fun way to end your meal.<br>Service was great. We had Pablo and Anna as our servers, and both were very warm, entertaining, and welcoming.", "pics": null}}, {"review": {"des": "Had lunch on a weekday with two friends. Plenty of tables available so reservations weren't necessary. I came in with lower(er) expectations because 1. rating and 2. river north. I gotta say I was pleasantly surprised! <br><br>We all got the express lunch - one rice plate (with a protein of your choice), one main dish, one cucumber, and one side salad for $15. You really can't beat that price in this neighborhood. The tonkotsu ramen was better than expected. The broth was rich and the pork tender. For my rice plate, I got the panko-crusted chicken and thought it was ok. The rice was cooked very nicely though. <br><br>In a nutshell, I would stick with ramen takeya for ramen in Chicago, but this is a good spot for a value sit-down lunch.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/B6cbBRULdSgHX9XRVp2sCg/348s.jpg", "caption": "express lunch ($15) - choice of tonkotsu ramen, choice of panko-crusted chicken, side of salad and cucumbers"}]}}, {"review": {"des": "My first ramen experience in Chicago was a good one. To be honest, I've never really had restaurant japanese ramen- only korean ramen. Our waiter was awesome at giving suggestions and making sure I had a good first have at it. <br><br>I got the kimchi and fried chicken ramen, which was heavy spicy and super flavorful. My next ramen I would definitely go for something lighter but enjoyed the spice level. The margarita I had went with it nicely.<br><br>Overall, I enjoyed the atmosphere, food, drinks, and service. I'm curious to see how this compares with other ramen spots!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/v5gzmPesO0h8ryUrpRc0UA/348s.jpg", "caption": "Kimchi and Fried Chicken Ramen"}]}}, {"review": {"des": "Got a takeout order last night from this place only because my other favorite ramen place was closed for renovations. My food was ready on time, packaged well so I had really high hopes. The fried chicken bun was extremely dry. I mean so dry that I had to take a sip of water with every bite to push that thing down. Spicy miso ramen wasn't spicy and had an absolute bare minimum of toppings. There was a lot of noodles but it barely had any meat. I get it that you are trying to keep the cost down but that ramen was an absolute joke of a meal. What a disappointment. I will not be back and won't recommend this place to anyone.", "pics": null}}, {"review": {"des": "I ate here with a group of four on a busy Thursday night around 6:30. It was packed and we even showed up early but we were still seated relatively quickly. Service was fast and food came within 10 minutes, even during dinner rush.<br><br>I ordered the Shio ramen. The chicken broth was tasty, but I added a little spice to make it closer to my tasting. Also, the egg was perfectly cooked (the little things do make a difference). I will definitely come back next time I am in town. Us four are still talking about Ramen-san a week later, so good impressions all around.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Z_mOycPok45GT7Pu4fOJjQ/348s.jpg", "caption": "Shio Ramen"}]}}, {"review": {"des": "( + ) <br>Gets two stars for nice ambiance and excellent, attentive service. <br><br>( - ) <br>The ramen itself was pretty bad. No one at our table could get through half their bowl because they were all so bland even though we all tried different varieties. The broth fell severely short of what I was expecting based on what I've had in NY and Houston but the egg was even more disappointing. It wasn't even close to a ramen egg (not custardy, not seasoned). Pretty unhappy I paid Chicago prices for this.", "pics": null}}, {"review": {"des": "Best ramen in the city. There will never be a day or time that I do not want to go to Ramen-San. I'll go for dinner even if I just had it for lunch. The kimchi fried chicken ramen is the most unique and best ramen I've ever had. It's extremely spicy but the broth is so flavorful and the chicken is expertly cooked so that it's not too dry but not soggy from the broth. I'm craving it just writing this review. Also, service is always quick, as long as you have a reservation. See ya soon, Ramen-San!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/BuNeJ6jflkVxEDlXMJlnWQ/348s.jpg", "caption": "Kimchi and Fried Chicken Ramen"}]}}, {"review": {"des": "Perfect for a cold winter day! Perfect amount of spice to clear my sinuses as well. Ramen-san is my new favorite ramen place in the city!", "pics": null}}, {"review": {"des": "I've never been the biggest fan of ramen but I thought this place was great! The pork belly in this was divine. Go here for sure", "pics": null}}, {"review": {"des": "Mama-san couldn't be of service for my cravings, so of course, I had to go chase after the next best thing: ramen-san. <br><br>My friends and I were really hungry on a Sunday night and this was one of the only places open at 10 PM. They had been here before and were quite excited about coming here. The first thing I noticed about this place is that it is really hip--but of course, it is located in a pretty up-and-coming part of town. If I wasn't such a wuss about spicy foods, I'd get the kimchi & fried chicken ramen, which sounded gooooood. The price-point of the ramen was on the higher side, even for Chicago (although I am not very familiar with average ramen pricing here), but I expected a huge, generous bowl of noodles that wouldn't disappoint. <br><br>I got the tonkotsu ramen and I believe I was just too hungry to put my focus on taste, but I will say that there is some spice to the point where I had to stop a few times to cool my tongue. There were definitely a lot of ingredients and toppings in there--probably so much that they overpowered one another. The chashu was so tender and bbq'd perfectly, the $14 price tag did justify the generous portions. Since we were the night owls that came after 10 PM, we were able to get their late-night fried rice which is available after 10 PM; it had bacon and a bunch of other stuff that made it so delicious! <br><br>We also got the black sesame and green tea ice cream cones ($3 each) and while the presentation was cute, the scoops were tiny and the flavors weren't as strong as I'd hoped. Maybe it's because it's catered more to the non-Asian crowd who aren't used to tasting bitter Matcha or smokey black sesame, but it was a letdown. There are probably better ramen joints in Chicago that are more traditional and less trendy, but if you've never had ramen and you're a guilo, you'll probably like this place.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/7jkJKXtdV-LWqBazyeuw_w/348s.jpg", "caption": "Green Tea and Black Sesame Cones ($3 each)"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/pyAGIt7y03-UsFbb7O7vyw/168s.jpg", "caption": "Shio Ramen"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/T8BqWErBgFpHCgPMLdlLuQ/168s.jpg", "caption": "Fried Rice"}]}}, {"review": {"des": "This place is awesome! The vibe is really cool and casual and they play some great music. We didn't have to wait when we arrived because we sat against the counter on the wall. The one thing I really like about their menu is they explain what names of the ingredients are in the ramen. This answered so many questions I had so I was able to decide a lot faster. <br><br>Our waitress told us they were understaffed last night but it was fine because we were really just enjoying sitting there in the cool atmosphere. I guess we were waiting a while because our xoxo pork/ shrimp dumplings we ordered were on them which was super nice to do. They were delicious by the way. The pork and shrimp were so tender and the amount of flavor inside and in the sauce was just a joy in your mouth! <br><br>Now to the ramen.. I got the Fried Chicken and Kimchi bowl and my boyfriend got the Sumo bowl. I decided on the chicken because well it was unusual and not the traditional ramen you usually find on menus. This was packed with flavor. I was worried the fried chicken was going to be soggy breading but was I wrong. It was perfect! So tender and also had a little crunch on the breading.  I'm still drooling over it. I added an egg to make the dish even better. Warning this is super spicy already because of the kimchi so I got the sesame chili oil on the side. Which I totally recommend since you can always add as much as you wish. Now for the sumo bowl that I also tasted... first off we had no idea how large it was. I guess that's why it's called a sumo bowl LOL! The pork in it ... just WOW! The rub that is on that skin and it just melts in your mouth. <br><br>Overall the experience was awesome! We may just have to stop back once more before we leave.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/JwKSKkwRzg1sa0gjb9gzFA/348s.jpg", "caption": "Kimchi and Fried Chicken Ramen with egg"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/JdJK2LVnZDdGLpyQOlHWrQ/168s.jpg", "caption": "Kimchi and Fried Chicken Ramen with egg"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/scVrB1DOQUgbrdxVeo1LEw/168s.jpg", "caption": "Sumo Bowl Ramen with bok Choy"}]}}, {"review": {"des": "Disappointing honestly. Wait time of 30-45 min and we ended up waiting over 1hr 15 min because they \"got some reservations confused\". Was told by the manager that she would bring us a free appetizer to make up for the wait.... the appetizer never came lol. Tonkotsu was bland, molten egg had no flavor at all, allover just lacked in flavor. Maybe I just ordered the wrong ramen but Tonkotsu is always my go to at any ramen place, not to mention the most popular.  Waitress barely checked in on us since there was a birthday across from us and all the waitresses were catering to them. Not worth the wait or the money. Americanized ramen is just not good lol, go to an authentic place instead!", "pics": null}}, {"review": {"des": "We did a family style night to get a taste of everything.<br><br>We came after 10 I believe which meant there was a special on fried rice, which was pretty amazing. The rice had moisture in it.<br><br>We had the Sumo Ramen and added corn. Soup was rich, but not overly rich. Ordered extra noodles as well. If you order more noodles, you'll probably end up needing more broth. <br><br>Ordered wings as well. Different and interesting. I enjoyed it.<br><br>Last but not least, dessert. Cinnamon Toast Ice Cream. Apparently a newer addition to the menu unless I heard wrong. We got it in a bowl. The ice cream was so fluffy and light. I could honestly come back for another. <br><br>Definitely a good spot! Great throwback songs too!", "pics": null}}, {"review": {"des": "Supposedly, this is one of the best spots in Chicago for ramen...and this place gets packed, especially for lunch! I would recommend booking a table in advance...we didn't and ended up waiting about 20 minutes outside in the cold. The restaurant is small and tightly packed with tables so there isn't much standing room in the front.<br><br>Once seated, we ordered the pork belly and fried chicken buns to start. They were good, nothing to rave about though. $5 per bun is a bit steep for me.<br><br>I ordered the double tonkatsu special, which came with carnitas instead of chashu. My boyfriend ordered the spicy miso ramen. Both were extremely flavorful. The broths were spot on, not bland at all, which is a common problem with many ramen broths. The carnitas was an interesting deviation but the mexican-japanese fusion worked really well! The portions were pretty big - I wasn't able to finish my ramen so my boyfriend cleaned the bowl for me.<br><br>Each ramen was near ~$15 which is also a bit steep. But considering the location and ambience, I can understand and justify the upcharge. The service was really fast and our server took his time explaining the ramen specials to us!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/pHbtz7Vf0rlQlOoK_57cJQ/348s.jpg", "caption": "Double tonkatsu ramen"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/FALKppqaUssxlID2eWc39Q/168s.jpg", "caption": "Dessert menu disguised as anime!"}]}}, {"review": {"des": "This place was around the corner from our hotel, and since the family was treating me to a weekend in the Windy City, I wanted to take them somewhere to try delicious ramen.  It was a match made in heaven.<br><br>We had an appetizer of gyoza, which was very good.  I ordered the tonkotsu ramen with added sesame oil, my wife also ordered the tonkotsu ramen, and my daughter had the shio ramen.  The tonkotsu ramen is a traditional ramen broth made from a pork bone, and served with chashu (pork belly).  The shio is a chicken-broth base with tofu.<br><br>I have traveled in Japan for my job, so I know authentic ramen when I try it.  This was damn good.  Not the best I've had in North America, but a very close second.  I can highly recommend, and would visit again if I were in the area.  My wife also gave special kudos to their cilantro-lime margarita, she said it was great.<br><br>For dessert, my wife and I split an order of their hot donuts, which were awesome, and my daughter has an ice cream cone with matcha ice cream and caramel.  She loved it.<br><br>All in all, it was a great night!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/a11aDVuerXCzwcz5v2H54A/348s.jpg", "caption": "Tonkatsu ramen"}]}}, {"review": {"des": "Wow, the spicy miso ramen really delivered. I've never had Napa cabbage or ground pork in ramen broth before, and it was so good! The spice wasn't overpowering - it had just the right amount of kick. My fiancé got the tonkotsu ramen, and the first thing I thought when I sampled his was...damn, this has so much umami! It's extremely satisfying. His had larger chunks of pork that fall apart when you bite into them, along with an egg. We will definitely be back next time we are craving ramen. I think is my new favorite Lettuce Entertain You restaurant. The location on Hubbard is lively, and the outdoor seating seems nice although I really enjoyed sitting inside. You probably get better service inside too. We struggled getting our check at the end as our waiter abandoned us, but that is really the only critique.", "pics": null}}, {"review": {"des": "I enjoy a good bowl of ramen, and the Kimchi and Fried Chicken bowl I had here was a bit unique and tasty.<br><br>The star of the show, though, was the Okonomiyaki I started with. Described by my server as a Japanese pancake, it was more like a savory pile of great ingredients, including 18 hour beef brisket, tender braised octopus, a fried egg, and green onions, plus just the right amount of chili sauce. It was delicious. Sadly, it is only available on weekends, and before 3pm.<br><br>I rarely drink yellow beer, but I do like Asahi Super Dry, and it's on tap here, and served in a frozen mug. A great accompaniment to the food.<br><br>Service was friendly and helpful, as I've experienced at all Lettuce Entertain You restaurants, and the ambiance is decent, with mostly rap music, but at a reasonable volume. If you're by yourself, the bar is a great place to sit for full service.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/5g1S_tMskQ_yxlhLSk2cpw/348s.jpg", "caption": "Kimchi and fried chicken ramen"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/OfKkAm265Pjd0hEZG7c17w/168s.jpg", "caption": "Beef brisket with octopus"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/BqsF95p1G_cnokZqmFQZOA/168s.jpg", "caption": "Whiskey"}]}}, {"review": {"des": "I'm a fan, as 4 stars on yelp suggests haha <br><br>It's definitely one of the better ramen places I've tried so far around this area and a little more north. both of the ramen pictured are the tonkotsu, one with bok choy. the noodles are fresh and GOOD ramen noodles- not mushy or too thick and has a solid texture.<br><br>the broth was also tasty- not too salty like most places I've been to- you COULD drink it and not feel as bad. the portions were also decent. we also got a pineapple soft serve ice cream for dessert for $3, which was really refreshing and actually tasted like delicious pineapples. such a fan.<br><br>I'm taking off a star because it's really expensive for ramen haha it was $15 for one bowl and $17 with bok choy....no ramen anywhere should be this expensive. it's noodles with soup with a small portion of toppings thrown on top. <br><br>all in all though, minus the price, it's a solid choice for ramen and I would go back once in awhile (but will still look for equally good tasting ramen places for cheaper).", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/zcJdqTsxYXxXWASHk3DSTw/348s.jpg", "caption": "pineapple soft serve ice cream"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/GdTd-xh8Q2ImxxN3jSG5KA/168s.jpg", "caption": "tonkotsu with bok choy"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/T8LuwJxEuhL3as_gno7dTg/168s.jpg", "caption": "both tonkotsu (bottom one is with bok choy)"}]}}, {"review": {"des": "My friend and I made reservations for two on a Wednesday night. I arrived early and was able to get seated no problem (we probably didn't really even need a reservation as there was plenty of open seating). <br><br>We both got the Tonkatsu bowls (I always get this as it's a standard at any ramen place, an easy way to gauge quality, and also my favorite type of ramen anyway! The standard Tonkatsu will cost you $14 a bowl before any extras. I personally thought that the portion sizes were quite small for the price, and I had to end up getting the extra serving of noodles for $3. While I didn't mind having to do that, I will say that it took extra long for me to get a server that would help me out. Our original server was barside and helping a lot of other customers so I felt like maybe a better distribution of tables would have worked more. I flagged down a separate server to place my order for more noodles because I didn't want the broth to get cold (there'd really be no point in ordering extra noodles if it did). <br><br>The ramen itself flavor wise was decent, it had a great deal of richness but the chashu was a little too fatty imo. Broth was tasty but not really out of the world for me. Noodles were bouncy and cooked well! <br><br>Overall Oiistar up in wicker park is still my favorite ramen place in the city (bigger portions, flavorful broth, quicker service), but I would say if I was REALLY in the mood for ramen and stuck in River North, Ramen San would do the trick too.", "pics": null}}, {"review": {"des": "My best friend loves this place so as soon as we came to Chicago - she took me here! The ramen was amazing - probably my 2nd or 3rd time eating ramen ever, and I am a fan now for sure!! The ambiance of the shop was casual but stylish with dim lights - the music choices were on point! We were actually jamming hard while eating (probably because we were in the back by the speaker)! I got the kimchi with friend chicken, corn and garlic - it was spicy but really good! I know I will be back next time and I want to try the matcha donuts! Go visit - you won't regret it! <br><br>The only downside was the wait for us since we did go on a Friday night - 35 minute wait! Make a reservation before you head out!", "pics": null}}, {"review": {"des": "tldr; delicious ramen and lively atmosphere<br><br>My friends and I decided to meet at this restaurant on a Thursday night for dinner, and the restaurant was absolutely packed! The service was a bit slow, but that's to be expected for a restaurant that was as busy as it was.<br><br>I ordered the tonkotsu ramen ($14), and the portion sizes were super generous for the price. <br>- Broth was extremely flavorful, but lacked depth and was slightly oily as opposed to rich<br>- Loved the texture of the thin, chewy, slightly curly noodles<br>- Chasu was melty, fatty, delicious, and falling apart under my chopsticks<br>- Soft boiled egg was nice, but slightly under-salted<br><br>The 5 of us also split a giant matcha cream puff ($6) for dessert. We were hella stuffed, so splitting the cream puff 5 ways was the perfect way to end on a sweet note while not over-stuffing ourselves.<br><br>Overall, I had a pleasant experience at Ramen-san! Not including the broth, I thought everything else about the ramen is top-notch and delicious!", "pics": null}}, {"review": {"des": "Awesome vibe, great seating and fun group setting. The menu has a lot of different options, really good for vegetarians too. I honestly wanted to try multiple appetizers but we stuck with the tuna and rice cakes. The presentation was really cool, set up as a tower of three and the tuna was really fresh with some yummy avocado. Drizzle some sesame oil on there and you're set. An appetizer to share and Rajman each is good for two people. There wasn't that much broth in my ramen, I wish there could've been more, but it was definitely delicious. My sister and I are not pork eaters, so I got the chicken Ramen and she got the mushroom vegan Ramen. Both were extremely flavorful and delicious. A little overpriced, in my opinion, but our waiter Charles was such a sweetheart and served us well. Would definitely recommend to people.", "pics": null}}, {"review": {"des": "This place has raving reviews so decided to give it a try since the day I visited Chicago just happened to be freezing. While the appearance of the store is up to date and clean, the ramen wasn't close to being anywhere at the top of my list and something about it didn't feel authentic. But what do I know, I may be totally wrong. <br><br>Ramen-san gives you a lot of noodles, but in the end, the noodles were on the harder side and it felt like it was thrown into the bowl in a clump, as the noodles were all stuck together and I could taste the noodle flour taste rather than the soaked up broth. Also, the noodles overburdened all the other ingredients. Personally, I'd rather get more other ingredients than just carbs and white noodles. <br><br>If you decide to partake a spicy bowl of ramen, beware that the ramen here is decently spicy. <br><br>Overall, would come again if I were craving ramen and in the area, but was it memorable? No. And would I come here specifically to come to this shop? No.", "pics": null}}, {"review": {"des": "We walked and and we're promptly seated at their full service bar.  Their beer was ice cold and perfect for the hot day.  <br><br>We started with two mantou.  I liked the pork belly mantou.  It was full of flavor and melted in your mouth and the cucumber gave it a perfect crunch.  We tried the fried chicken but we felt that it was under seasoned and just okay.  <br><br>Next was the ramen.  Tonkotsu ramen broth was pretty good flavor wise but it was a tad too salty.  The chashu, again, melted in your mouth and the noodles were perfectly cooked.  My husband got the spicy Miso, pulled pork, Tonkotsu ramen which was the special of the day.  We weren't really a fan of the smokiness of the pulled pork on ramen.  <br><br>There's a full set of condiments on the table and the wait staff was attentive and sweet.  Bit pricy but good food overall.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/RAvnGOJnH2JNx7kniDYDZw/168s.jpg", "caption": "Tonkotsu - good"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/QE65Nc6P4B3EBvUmSc9wmQ/168s.jpg", "caption": "Tonkotsu Spicy Miso special - OK"}]}}, {"review": {"des": "I really like the ramen at this place! Whenever I go, I order the tonkatsu ramen with an extra egg. The broth is very tasty and has a garlicky flavor to it. I started with the Brussels sprouts and they were also good. <br>What makes this place cool is the atmosphere and good music. If you happen to be in the area, check it out- you won't be disappointed.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/L8sRQItktvw9ltzRjZ5Dfg/348s.jpg", "caption": "Bar area"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/XogAeP1UNyfxUKxG7T_dmg/168s.jpg", "caption": "Fried Brussels"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/MpQDfGAmv75bikzHBSCkWA/168s.jpg", "caption": "Tonkatsu ramen"}]}}, {"review": {"des": "I've tried various ramen places including Kizuki in Wicker Park, and this is my new favorite ramen joint in Chicago. I didn't expect much but everything we tried was more than satisfactory. The beer was served ice cold in chilled mugs, the pork belly buns were spot on, and the Sumo Bowl was almost flawless. I especially appreciate the generous portion especially in light of the infuriating portion at Furious Spoon (don't go there). Definitely recommend!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/2EubK3-RXpl6Z_baXfCw1g/168s.jpg", "caption": "Sumo bowl with wontons replaced by extra chashu"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/2y65yQS9NdrG2RfSvWLl7g/168s.jpg", "caption": "Pork belly buns"}]}}, {"review": {"des": "This place was pretty good. The taste and flavour of the broth and noodles were so good! I ordered the ramen special of the day. The environment can be loud since there's music playing in the background. Overall really cool place to relax and chill.", "pics": null}}, {"review": {"des": "No wait, full bar service!!!! Lunch special is like a wonderful bento! Your choice of ramen and a side, great deal, amazing food!", "pics": null}}, {"review": {"des": "My lunch date brought me here, so who am I to say no...it is his time.  My only experience with ramen was the cup of noodle version so I was not thrilled to come.  He recommended the Sumo Bowl Ramen cuz he said I needed more meat on me...lol.  With the fried chicken.  I'm all being polite, wishing I could have had the fried garlic too...lol.  <br>Well, this is not a cup o noodle ramen.  This was sooo good, so filling but not like I feel like a pig filling.  I have a new fave place to hit when I'm over on this side of town.", "pics": null}}, {"review": {"des": "This is perfect ramen! Love the vibe in this place because they have old school hip hop playing. <br><br>I ordered the spicy miso while my wife ordered the kimchi and fried chicken. Both were delicious and a nice spice level that wasn't overbearing. It was plenty of food where I was stuffed.<br><br>Very rare to find good ramen but they got it right.", "pics": null}}, {"review": {"des": "So glad to have found this amazing Ramen place right in the middle of the party street.<br><br>The staff is really sweet and offer great service. My friend and me arrived little late on a monday night and by the time we could finish eating, it was their closing time. But, no one rushed us at all. That shows hospitality!<br><br>Needless to say, the Ramen and finger food is excellent! The fried chicken Ramen and buns are a must try. It can get little spicy if you're not used to it. But, my advise would be to go for it and then order urself the nutty, sesame seeds flavored ice cream .", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/7646-TvRNS4bwOaJ3H1exQ/348s.jpg", "caption": "Fried chicken buns ($5/e)"}]}}, {"review": {"des": "The BEST ramen place I have been to when it comes to flavor! It's a very open restaurant that was pretty crowded when we went in, however there was no wait. Lighting was dark and there were high tables and normal tables packed together. Most everything you needed to enjoy the meal was already on the table--napkins, chopsticks, chili powder, and more. Our server was nice and knowledgeable about the menu. <br><br>Food:<br>-We got an order of Szechuan wings as an appetizer before the ramen. They came covered in red chili peppers, sesame oil?, and scallions with side of yummy lime sauce that resembled tzatziki sauce. The wings weren't hot at first but the heat sneaks up on you and has my nose running, but wasn't that bad. Whatever flavor the wings were lacking, the sauce made up for! <br>-The ramen came out in big bowls with LADLES instead of spoons. Got me so excited, I got the tonkotsu ramen with a side of chili oil, but the oil didn't have that much heat so I added chili pepper. It was DELICIOUS! The best tonkotsu I've had. It came topped with big pieces of charshu, bamboo shoot, garlic and peanuts?, spinach, and a molten egg. The flavor of the broth was so fatty and flavorful, I couldn't stop drinking it. There were pieces of garlic throughout every bite that exploded with flavor, so yummy. However, the charshu itself was pretty tough and dry. The pieces with fat were good altogether but the pieces of just meat were hard to get through. The spinach and bamboo root were good. The molten egg added a nice, creamy richness.<br>-My friend got a specialty ramen they had at the time with beef brisket broth and 18-hour smoked brisket. It tasted like a July 4th barbecue in a bowl! It was yummy, but a little sweet. <br><br>Although the food was really good, we were struggling to finish the ramen bowls because of the richness. There was a lot to go through and it got a little tiring. But if you're really hungry and want a food bowl of ramen, you have to try this place!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Z8zOtpanD3jT3LoJAa3DCA/348s.jpg", "caption": "Smoked Brisket Ramen"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/wCRjScUhTDVVIOrXDaftOg/168s.jpg", "caption": "Smoked Brisket Ramen"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/NsDtKTmVUU17Rv5SA9iBmA/168s.jpg", "caption": "Tonkotsu Ramen"}]}}, {"review": {"des": "Very mediocre. <br><br>The shrimp and pork dumpling has a very weird taste. We ordered two ramen, both with pork broth, one spicy and another one non-spicy. Definitely below average of other ramens in Chicago. <br><br>Good thing about the restaurant is that it sits in a prime location, plus the service is great. Not a bad place to hang out after work.", "pics": null}}, {"review": {"des": "Hit the spot! I tasked my cousin with hunting and gathering and this little gem was what he was able to shake from the tree. The temp outside was on frozone so ya boy had to slurp some Tankatsu ramen and sip some warm sake! 90s hip-hop set the mood and the staff were mad friendly and attentive to the details. Highly recommend it.", "pics": null}}, {"review": {"des": "Yet another ramen place.<br><br>The Interior = Nice and hip<br>The Service = Good <br>The Food = Tasty<br><br>Ramen San is a hip hop playin ramen slingin bao bun makin joint located downtown Chicago. I enjoy this place because it's live! It's a bit larger than other ramen places but fills up fast. <br><br>This trip we got the pork belly bao buns which were quite tasty and the sumo bowl ramen. I left satiated.", "pics": null}}, {"review": {"des": "I really enjoyed my ramen at Ramen-San. Not only is the menu pretty great, but the wait time and service are outstanding! I have not had to wait too long to grab a seat here, considering how busy the place is. The serving staff is always pretty friendly, and I liked that they give you their true opinions when you ask them for recommendations and don't seem to be bothered by it. I had the the shitake mushroom ramen and added some spicy with some spicy kimchi and garlic, along with some corn. SO GOOD! I like that they have vegetarian options here as well. If you are in Chicago, definitely try Ramen-san!", "pics": null}}, {"review": {"des": "Walked in and immediately felt like we made the right choice in a ramen restaurant. Romantic lighting, hip music, and a fairly packed room - meaning this place is well liked! We were immediately seated and had an amazing server who helped us make the right choice to order and had our ramen in no time. So tasty and perfect for the rainy night we went and will come back again if in town.", "pics": null}}, {"review": {"des": "My wife and I are huge Ramen fans. When I noticed this restaurant near our hotel we added it to our \"must try\" list. I had the Kimchi-fried chicken Ramen it was delicious perfect amount of spice for me and the corn was a nice touch! My wife had the spicy miso and she really enjoyed it as well! I would recommend trying this place the atmosphere is modern and swanky I enjoyed the vibe and the restaurant goers were all enjoying there Saturday night Vibe. The brick wall with the projectors reflecting was a nice touch!", "pics": null}}, {"review": {"des": "Vibe: Very chill and personal. The NYU sic was nice and the service was great!<br><br>Food: we ordered the kimchi ramen and replaced the fried chicken with chashu meat. The soup was great, not as hot as I like it. But personally, I just like hot hot soups. We had sake bombs, really fruity ones and those went so well with the ramen! <br><br>They gave me sugared donuts because it was my birthday and they were the perfect icing on top of the meal", "pics": null}}, {"review": {"des": "Loved this place! Pork belly bun was probably one of the best I've had anywhere. Tonkatsu ramen was very good but I was jealous of the sumo bowl my husband got and I would 100% order that next time.  They use sun noodles which we LOVE. Ice cold asahi on draft too. Great spot on a cold day.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/YRG4d9MoANiZBHVNisy9qw/348s.jpg", "caption": "Sumo Bowl Ramen add molten egg"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/emlid74wzsXK5Ira9R2IVw/168s.jpg", "caption": "Tonkotsu Ramen add bok choy and fried garlic"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Xvtsq85WO1_NVfTKObmZ8Q/168s.jpg", "caption": "Pork Belly Mantou Bun and the Fried Chicken Mantou Bun"}]}}, {"review": {"des": "I've eaten here twice now.  The food is excellent and the service was good despite being very crowded.  The cocktails were good but a little pricey.  I'll definitely return again.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/uji5LrlhQyB9g2i19mShGw/348s.jpg", "caption": "Kimchi"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/DdQ_dtKIp_OJAIDrPM5i6w/168s.jpg", "caption": "Wagu beef carpaccio special"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/_i7TGCgX4xVM46PtmHdXPw/168s.jpg", "caption": "Green curry duck ramen special"}]}}, {"review": {"des": "Not bad but........ If you're looking for hype this place will do it. Service isn't bad either.. If you're looking for GOOD RAMEN go to Slurping Turtle.. they have great service and better food. Trust me as an Asian from NY.. I've learned yelp reviews for Asian places never seem to really match up to the actual quality", "pics": null}}, {"review": {"des": "Being a regular at Sushi-san, I had to try Ramen-san. Let me say I am so glad I did. As a single diner at lunch I was treated well and had a wonderful server named Jack. I told him it was my first time here, I am picky and asked him what I should order. I ordered the Ramen of the day Tokashima Ramen.<br><br>Let me just start by saying the Menma bamboo shoots were amazing. I could have eaten a bowl of broth and Menma and left happy. The manager told me they procure those fresh from a place in China Town... great call. The dish had ramen, raw egg yolk, green onion, Menma bamboo shoots, Japanese candied  bacon and a pork belly broth.<br><br>The broth was deliciously delicate, some reviews have said that the salt level is to high, but being very sensitive to sodium, it was a  perfect level and not overpowering. I licked the bowl clean to get to the last bit of broth. Having the egg disappear into the broth as I stirred it in gave it an extra level of richness.<br><br>The Japanese bacon was good but not necessary as it was a little tough and water logged but the flavor was great. You have already read my review on the Menma and the little bit of Shichimi Pepper (Togarashi) gave it the perfect level of heat. The only thing that was not knock me off my seat good was the ramen noodles. They were not bad but also not special. That being said, as a texture and depth of flavor person, the texture was amazing and the depth of flavor was spot on for such a simple delicate dish.<br><br>I paired the dish with the Hot 97 cocktail. It is Vodka, Grapefruit and Serrano. I asked for extra heat and I got it. The heat between the cocktail and the Ramen were a perfect pair.<br><br>Although I was in the front and occasionally people waiting crowded me a few times, I had a good time. I asked detailed questions about the food and business and Jack was able to answer all of them for me, even getting me signed up for the Luttuce Eats app. I also had two different managers stop by clearly desiring for me to have an amazing experience, I did, Ill be back.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/EBhuDHivsvdkY_My8HQDVQ/168s.jpg", "caption": "Hot 97 with extra  Serrano."}]}}, {"review": {"des": "I had brunch for the first time here. Other times it was just lunch. It wasn't that busy here as it is during lunch normally. I had a reservation and was seated immediately.<br><br>I got the spicy jabenero pepper drink. It was good and not too spicy. They ice cube is one big block which takes up a lot of room so there is not much liquid in the drink. <br><br>We got the Berkshire ham and pork belly okonomiyaki. The okonomiyaki was disappointing. There was absolutely no cabbage in either one and cabbage is supposed to be the main ingredient. It was pretty much batter, the meat, and then an egg on top. I would not order this again. If you have had okonomiyaki in Japan, do not order this one.<br><br>We got the fried chicken and Kimchi ramen and the sumo bowl to share. The fried chicken and Kimchi one is def spicy so be prepared. The sumo bowl was fine...average. <br><br>Service was good throughout brunch...just at the very end it took forever to get our check", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/UMgnCEU5rUt97wVee72-UQ/348s.jpg", "caption": "Express lunch with tonkotsu ramen and salmon rice"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/LV0Ab9DPaMMF-FF5vnCrbw/168s.jpg", "caption": "Fried chicken ramen and sumo bowl"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/QYmutFHZscKD8a1lv3Q_uQ/168s.jpg", "caption": "Okonomiyaki- Berkshire ham and pork belly"}]}}, {"review": {"des": "We'd been walking all Sunday in Chicago.  After a long visit to the Art Institute, we walked to Ramen-san for a cold draught beer and some pork belly and noodles.  Our waiter was funny and the broth was on the mark in terms<br>If flavor.  We sat at comfortable high tops made from reclaimed? wood and industrial piping, and we did some people watching while we ate this delicious comfy food.   Try the shrimp gyoza.  I'll bet it's a hipper place st night- and it would be great after drinks.   Groups or couples fine- and a few singles date near the outside view - great neighborhood happenings to view from there.", "pics": null}}, {"review": {"des": "One of the best meals that I had in Chicago. I absolutely loved everything. I got 2 chicken buns and the spicy miso ramen. I totally recommend both of those! It's so good and flavorful. Really filling but whatever! I can't wait to come again when I'm back in Chicago.", "pics": null}}, {"review": {"des": "This is where I go if I want ramen and don't want to travel far from my apartment I always get the kimchi and fried chicken ramen. It's very spicy and filling. The combination of fried chicken with ramen seems off but you'll be proven wrong as soon as you take the first bite. The fried chicken doesn't get soggy or mushy in the broth. I don't know how they do that but it stays pretty crispy. The buttered corn helped with the spicy. If you can try and get a bite with the corn, chicken and kimchi. It's 3 very different flavors but when combined together make this unique new flavor that make you want more.", "pics": null}}, {"review": {"des": "Loved this place <br>Service is amazing<br>Can't go wrong with anything you choose <br>The donuts are amazing", "pics": null}}, {"review": {"des": "Great experience. Had a blast taking my family out to this restaurant. Clean, upbeat, modern location in River-north. You will definitely be seeing me here from now on. I'm hooked", "pics": null}}, {"review": {"des": "This is a cool spot. Laid back vibe with classic hip-hop music (Beastie Boys, Rakim, De La Soul, Fugees, Tupac, Kanye West and Luda) playing over the speakers and dim lighting. <br><br>I failed to give this restaurant 5 stars because the Spicy Szechaun Wings were too greasy. Caution: If you can't handle spice you might want to reconsider ordering. As far as ramen...I ordered the Shio Ramen (chicken broth, molten egg, tofu and nori (seaweed) served with Tokyo savvy noodles. It was like a warm hug on a cold and windy Chicago night. It was exactly what I needed in my life after a long work day. <br><br>When I'm back in Chicago again on business I would definitely come back if I'm in the area. If you're a local I definitely recommend checking out this spot.", "pics": null}}, {"review": {"des": "Cool ramen place with high top picnic tables, soft lighting and windows that open to the outside. Ramen is both traditional and modern takes on ramen. Had the ramen with fried chicken, bamboo, corn and very spicy.  Also table had chicken buns plus gyoza.  Gyoza was crispy and really tasty.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/gGWiP-PY-jRxlq8Hzht6QQ/168s.jpg", "caption": "Chicken, bamboo and corn ramen. Spicy!"}]}}, {"review": {"des": "I've recently learned the glory that is ramen. Party of four showed up on a Saturday afternoon and were seated almost immediately. We each had a bowl of ramen. Amazing! We all finished our bowls. Highly suggest this place and I'm already planning a return trip.", "pics": null}}, {"review": {"des": "First stop in Chi after checking in and spotted this on Yelp. Right by our hotel garage and short walk. This was a stop for our family of five and varying tastes.<br><br>We started with a seafood gyoza that was special for the day. Everyone ate it up...especially the picky 9 year old. We all ordered ramens and one of the fried chicken buns. All delicious! <br><br>We were seated toward the back in a nice booth. One of the bathrooms was out of order. Quick and friendly service.", "pics": null}}, {"review": {"des": "I didn't actually go visit in person so can't say much about parking or the interior but my sister and I got it delivered to our hotel room the first night. We both got the kimchi fried chicken ramen and it was pretty good! Everything came relatively quickly and the soup and ingredients were separate so that the noodles and chicken weren't soggy and the soup was still hot-ish. Definitely would go back again to try the ramen and matcha cream puff in person", "pics": null}}, {"review": {"des": "Ramen San was the first ramen restaurant I've been ever been to. So with nothing to compare it to, I thought everything about it was fantastic. The atmosphere, the food and the drinks. Since then, I've been to Ramen San for both lunch and dinner!<br><br>The express lunch is the perfect amount of food. It comes with salad, a rice bowl of your choosing and a main dish of your choosing. I always go for the skirt steak rice place and the tonkotzu for my main dish. The Tonkotsu is a ramen bowl with pork broth, chashu pork and a molten egg. It's rich and salty - everything you're looking for in a bowl of ramen. I think the best part about ramen san is the noodles. Wavy style noodles made their their specs over at Sun Noodle consisting of flour, water and kansui.<br><br>Dinner is a whole other game. I go straight to the buns. When I take friends from out of town, it's my power-move to order all three buns on the menu before they get the chance to glance at the menu. Their quick and seriously amazing, setting the tone for the dining experience. The fried chicken bun is my favorite - basically an Asian style chicken sandwich. After that, ramen. It honestly doesn't matter which ramen you order as long as it's got something you like! If not, throw on some add-ons. You're guaranteed to be full after your bowl - be sure to wear your hear up, and short sleeves. Because it gets pretty warm once the ramen sweats start up.<br><br>Give the drinks and desserts a try if you'd like! All of them are noteworthy and I haven't had a bad experience with them yet. When I go, I'm there for the buns and ramen, so I forgo the sides and drinks. All reasonably priced - a great date night spot, business lunch spot, and perfect for visitors coming from a not-so-ramen-fluent city.", "pics": null}}, {"review": {"des": "In my judgmental snobbery for authentic ramen, I have qualms when:<br>1) it feels like a club with hip-hop or rap blasting in the background<br>2) it feels like very fusionized with a trendy full bar in plain sight<br>3) it feels like it's catered to n00dle n00bs with explanations of ramen ingredients on the menu<br><br>Unfortunately Ramen-san hit all 3 of my red flags, but fortunately Ramen-san turned out to serve delicious and (fairly) authentic ramen. The menu features a range of millennials' favorite Asian food, including several types of ramen ranging from vegetarian shiitake to the epic Sumo Bowl with wontons, as well as a handful of baos. The dessert of hot donuts with creme anglaise is popular too and looks uniquely beignet-style. They even have okonomiyaki for weekend brunch and late night fried rice for the drunchies.<br><br>The boo got the Tonkotsu, which contained all the essentials (in terms of eating as well as photographing) of chashu pork, half molten egg, scallion, and seaweed. For $14 it's on the pricier side though within the range I'm used to for more upscale ramen. <br>- The portions are also rather impressive, starring 3 generous slabs of melt-in-your-mouth spice-rubbed pork belly<br>- While the molten egg had the right consistency, I would have liked it steeped in sauce like traditional ajitama<br>- Noodles are the wavy egg-based type and had a decently springy texture<br>- Tonkotsu broth was well done, with prominent pork flavors but not too salty or thick<br><br>I was enticed by the Special of the night, which our server described as carnitas style pork with scallions in tonkotsu broth. The mystery price tag turned out to be $15, which was quite reasonable. Although the concept of combining carnitas with ramen is interesting, the pork wasn't the soft guilty-pleasure pulled pork that I was expecting but rather a dried jerky-like take. I appreciate the novelty, but in my opinion it was less than practical since it was very chewy and the dried pork wasn't ideal for soaking up broth. <br><br>Despite my initial disapproval of the fusion-like elements, I did enjoy the hip ambiance which made the place feel very alive. The dim lighting is cool (though possibly not the best for food pictures), and the tall communal wooden tables add street food vibes as a nod to the origins of ramen.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/okAwk05cyMHwe9CBi1BhpA/348s.jpg", "caption": "The tonkotsu, $14"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/HZbhjPs0jJ2lRl4vNDuOpA/168s.jpg", "caption": "Ramen!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/eIDzIWL_XZhvcKqg91JeSQ/168s.jpg", "caption": "The spread P:"}]}}, {"review": {"des": "Stepped into Ramen-san over a chilly weekend for brunch. We ordered the tonkotsu ramen with additional chili peppers and the beef brisket octopus okonomiyaki. The ramen broth was solid. I just wish the bowl came with more ingredients rather than being charged for customization. The okonomiyaki was a pretty good deal for $6. The bonito flakes and octopus were a bit fishy for my liking, but open to have it again the future.", "pics": null}}]}