{"name": "ramen-wasabi-chicago", "reviews": [{"review": {"des": "Ramen Wasabi has officially taken the number one spot on my list of best ramen places in Chicago. The wait, notorious for being a long one if you're not first in line when they open, is 100% worth it. <br><br>I had come here about a year ago and I believe I ordered a Tonkotsu of sorts, but I don't remember being as impressed as I was this time around. The space itself is small, dim-lit, and intimate. There is not much waiting space inside, so we were subjected to waiting by the bathrooms. The wait was about an hour long, but once seated the flavorous journey began. <br><br>We started off with edamame, two different types of buns, and drinks. My husband said his old fashioned was really good. I had a Moscow mule myself which was crisp and refreshing. It's probably really hard to mess up a mule, though. The buns were delicious! The chicken one has crispy chicken and the pork one had savory pork- both meats inside a a light, fluffy. Yummy! <br><br>THE RAMEN: I ordered the Tokyo Classic Shoyu which proved to be my favorite bowl of ramen I've had to date. The chicken based broth had perfect flavor alone and adding spice to it took it to a whole new level. I also got some buttered corn on the side which I added in. I loved everything about this bowl- the broth, the noddles, the veggies, the corn, the spice. My mouth is watering just thinking about it!<br><br>I need to return ASAP.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/_D5LOnE20b8_lKAhZNp3_g/168s.jpg", "caption": "Moscow Mule"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/MSNh6_-StmbNcYIrE4curw/168s.jpg", "caption": "Tokyo Classic Shoyu- perfect for those chilly winter days!"}]}}, {"review": {"des": "This place is hip??<br>Food was good but not great <br>Service was poor, first he's nice but after took the order he just disappeared.. maybe we were a group of 6 and he can charge 20% for tip so he didn't return to our table to check up on us or anything. :(", "pics": null}}, {"review": {"des": "Wasabi expanded, and this is my first time going for lunch. It's well lit (as opposed to before- dark but atmospheric). I can see my food for once, hah!<br><br>We ordered the usual - pork belly buns, tonkatsu ramen, and shoyu ramen.<br><br>Pork belly buns- man, these are expensive. $8 for two buns. However the pork is really tender, combined with mayo vegetables and scallion, tastes great! The sauce is light but just right in terms of sweet and savory balance. Still not sure if I would pay $8 for these unless I'm showing a friend these.<br><br>Original tonkotsu ramen-- presentation is great. Egg looks like it is cooked just right (it was, confirmed when bit into). I judge tonkotsu ramen sometimes base on whether you cause a wrinkle on the broth's surface, and there was definitely wrinkling when I broke the layer of fat (like the congealed later from fish broth). So their ramen does have this congealed layer, which is great! Flavor is just right, not too salty or oily and very smooth. (My husband said the broth is not as dark as some we have tried, which sometimes is s good thing!) Noodles were clumped together, may have been sitting in the back for a bit so it clumped together, but texture is just right (actual ramen noodle, instead of instant ramen). Pork is the same as the pork belly buns, very tender, and the sweet and savory balance is on point. Other toppings are great complements - mushroom and bamboo shoots and of course scallion. The overall experience does get a bit overwhelming with the grease, so I asked for spicy sauce, and discovered spicy umami paste. <br><br>Spicy umami paste-- might have a sting at first, but actually sweet and flavorful, not overwhelming. It was served to me cold so it was a great complement to the warm pork belly. Highly recommend this combination! (Compared to furious spoon's spicy sauce, this is thicker and less spicy.)<br><br>Classic Tokyo Shoyu ramen-- my husband wanted a lighter flavor. It is not overly sweet, which is great because some shoyu ones I've had were too sweet. He said he'd prefer if they gave more meat in his. (Mine tonkatsu one had three decent pieces, so I was happy). He ordered extra noodles on the side, but it did end up being too much noodles! So portion size wise it's great!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/3ODONqggdAcRtWRHMFfgFA/348s.jpg", "caption": "Original Tonkotsu Ramen"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/wvv8kuWgUakYtH0NKeK3aw/168s.jpg", "caption": "Tokyo Classic Shoyu Ramen"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/5Q3s7JqJtEpwBq2AEgVazg/168s.jpg", "caption": "Pork belly with Spicy Umami"}]}}, {"review": {"des": "I really wanted to be as hyped up about Ramen Wasabi as many others, but it was ultimately an ordinary and average experience. I arrived on a Saturday around 5:05 P.M. It had only been five minutes since they opened, and half of the tables were filled. I was astounded, excited, and thinking, \"That must say a lot about the food here!\" However, both the food and service fell short that day.<br><br>I ordered the Fried Chicken Buns and the Original Tonkotsu Ramen with Chicken instead of Pork Belly. The server accidentally delivered the next table's orders to us on two separate occasions, but we politely just told him about it and he apologized. When our food was finally delivered, it was delivered hot. The Fried Chicken buns were crispy but the flavor was nothing memorable. I expected a lot from the Original Tonkotsu because the server said that's the most popular ramen they have. However, when I got this dish, it lacked the richness and depth of flavors in a good ramen broth. It tasted quite bland, as if there was too much water and not enough pork bone in the cooking process.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/JjmUbkhK6mMCTGtZ1MW3yg/348s.jpg", "caption": "Original Tonkotsu: Berkshire pork belly, soft boiled egg, marinated bamboo shoot, scallion, sesame, black wood ear mushroom, garlic oil"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/e1ydm9JeHBR0OThIiWeu-g/168s.jpg", "caption": "Sapporo Miso: egg noodle, rich pork broth, berkshire pork belly, soft boiled egg, marinated bamboo shoot, bean sprouts, sesame, scallion"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/6eYg15mF5ye_E_YCZ6nWPw/168s.jpg", "caption": "Spicy Roasted Garlic Miso: egg noodle, pork broth, pork belly, egg, bamboo shoot, bean sprouts, sesame, scallion, garlic, chili threads"}]}}, {"review": {"des": "My friends and I were visiting Chicago and searched on Yelp to find a place reasonably close by to where we were staying at to satisfy our Ramen fix on a cold fall day. <br><br>We arrived ~15 minutes before the place opened due to our past experiences with good ramen spots. However, we were the first to arrive. No line whatsoever, which got us worried.<br><br>As we walked in, we noticed that the decorations were... hipster...? Another unusual sign... still gorgeous nonetheless<br><br>However, when the orders finally came out, we were mind blown. <br><br>Ramen Wasabi is by no means your traditional Ramen Restaurant. However, the Spicy Garlic Miso Ramen itself easily ranks amongst my Top 5 favorites of all time (and this includes ramen from Japan Town Los Angeles and Japan Town San Francisco). <br><br>Although there was no line, the place quickly filled up. <br><br>In summary, this place is your non-traditional ramen restaurant that serves superb ramen that will give some of the best ramen shops in the nation a run for their money. The food came out very quick; no massive lines. My only complaint was that we were seated at the booths, which did not have seat cushions. Watch out if your have joint pain. <br><br>Otherwise, spectacular restaurant.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/fBRglIV-BuwXBVPjZTpZHg/348s.jpg", "caption": "Spicy Roasted Garlic Miso Ramen"}]}}, {"review": {"des": "Wait : none for Saturday noon time. <br>Ambience : nice and roomy <br>Service : okay. Well she kept coming to us saying is everything okay for 4 times while our bowls are still half full. I wish I was left alone to enjoy the food. <br>Food : I had spicy pork belly ramen. The broth is thick, creamy and full of flavor. Noodle is well cook, not too soft or hard. I enjoy the food <br>Overall: don't mind coming back but I hope to get a better service", "pics": null}}, {"review": {"des": "Came here to get some ramen by myself and it was actually really nice enjoying my own company. It was a chilly day and some hot ramen really hit the spot. I ordered the spicy roasted garlic miso ramen because I'm a huge fan of spicy ramen and I really enjoyed this one! The pork broth was really tasty and it wasn't too spicy and quite enjoyable. This ramen place was a cute little spot and it was pretty good so if you're ever in the area and are craving some ramen, stop by here!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/pS2h8VZ_ic0OTtlP_JxG-A/348s.jpg", "caption": "Spicy roasted garlic miso ramen"}]}}, {"review": {"des": "First of all, let me say that The Heiress Apparent is no more.  She turned 21 and assumed the title of Queen of the Universe (QofU), with me stepping down as The Queen Mother.<br><br>To celebrate this occasion, we had our first Sunday Funday with adult beverages at Ramen Wasabi.  Since the new Queen has been gracious enough to introduce me to the world of ramen, we have decided to expand our horizons beyond Strings on Belmont (love!).<br><br>Not only are we fans of ramen, we loooooove buns!  We chose Ramen Wasabi because they not only have ramen, but buns and man was it a great choice.<br><br>The place itself is a little bigger than Strings, but has more windows.  We got there at 11 am as they were opening and there were already people outside waiting to get in.  There is a small waiting area inside and when I say small, I am talking maybe 2-3 people can sit there and wait.  There is bench seating in the windows and multiple two and four top tables.  There was also a six seater table near the back.  <br><br>They also have a full bar, but didn't check to see if there was seating there. Yes Virginia, they do have bubbles on the menu, so that is winning for me.  I got a glass of bubbles and QofU got a Shiso Perfect (Hanks Local Vodka, Shiso Mint Syrup, Fresh Lime Juice, Shiso Leaf).  Had a sip and it was actually pretty refreshing.<br><br>Next we ordered buns and dumplings. The Hanetsuki Pork Dumpling consisted of Berkshire pork, cabbage, and scallion with a soy vinegar dipping sauce.  The dumplings were interesting as I have never had them prepared the way they were.  They were lined up side by side and then it looked as it they have been covered in a thin Japanese crepe.  Interesting presentation, but it was very good.<br><br>We started off with an order of Pork Belly Buns (braised berkshire pork belly, organic romaine, sesame mayo, scallions) and the Fried Chicken Buns (cage free chicken karaage, sriracha mayo, organic romaine, scallions).  The chicken buns were good, but the pork buns were amazing!  Those buns were steamed perfectly and that pork just melted in our mouths.  Pork definitely wins over the chicken...not that the chicken wasn't good, but the pork was divine.  We ended up getting a second order to split.<br><br>For our entrees, QofU got the \"Original Tonkotsu\" (Berkshire pork belly, soft boiled egg, bamboo shoots, scallions, sesame, mushrooms, and this broth that was creamy, smoky and almost grill-like flavor all in one sip.  Our server, Tyler (hope that is how you spell it) told us that it was a pork bone broth: made with Heritage Berkshire Pork bones and takes up to 45 hours to make.  Worth every hour....that broth was a nectar from the Goddess.<br><br>I wanted to try something different and got the Tokyo Classic Shoyu (egg noodle, berkshire pork and cage free chicken light broth, berkshire pork belly, soft boiled egg, marinated bamboo shoot, naruto, scallion).  It was different from what I have had of late, much lighter but full of flavor and also delicious.  On an overcast day, I could use this as a substitute for chicken noodle soup.<br><br>QofU and I both got extra pork for our ramen....I so recommend it as it is to die for.  Lovely combination of meat and fat and it just melts in your mouth.  We didn't do dessert as we were too stuffed.  Our server, Tyler, was great.  Very friendly.  Asked if it was our first time at the restaurant and proceeded to explain some of the options to us.  He was attentive and took good care of us.<br><br>Not sure about the wait, but based on the fact that there isn't much room to wait around in, we will be coming here when they open. The restaurant filled up very quickly.  Nice thing about the location is that there was plenty of street parking nearby.   We will definitely be back here if for no reason for the buns :-)", "pics": null}}, {"review": {"des": "Disclaimer; I have never eaten here. <br>I have heard this place is really actually very good. It was snowing the other night and my boyfriend and I were going to to go there for ramen but decided we would rather stay in and be cozy. We figured out our order after about 30 minutes because everything looked so good we couldn't decide and then called the restaurant and asked to place an order for pickup. We were told the restaurant doesn't allow that. We found this confusing and asked again. Again we were told no. One more time we tried and said we were asking to pick it up, not have it delivered and still a flat no. Ok so we didn't order from there. So they lost our business for that night and many nights to come. Unfortunate because the place we ended up ordering from was bland...but they even delivered.", "pics": null}}, {"review": {"des": "Best ramen I ever had. We had an hour and a half wait but it was worth it. I ordered the spicy garlic ramen, it was delicious. The noodles were perfectly cooked and the broth was full of flavor. It's a perfect meal for a cold day. I can't wait to come back.", "pics": null}}, {"review": {"des": "Ramen in Chi-Town?! Wha?! Who'd have thought?!<br><br>I did not expect to partake in consuming Ramen in Cho-Town. I figured my short trip would be all sorts of popular Chicago food...deep -Dish Pizza, Hot Dogs, Doughnut Burgers etc. <br><br>One of my buddies found Ramen Wasabi through sheer accidental convenience...<br><br>We had a Riot Fest Late Night concert at the Concord Music Hall down the street and wanted something to eat. Our other option was a pizza place close by, but we ended up choosing Ramen instead.<br><br>As soon as you walk in, the ambiance this place exudes is classy. RW is definitely not cheap, but it's no hole in the wall and decor is very modern as well. We weren't all that hungry so we figured this would hit the spot perfectly. <br> <br>To start we ordered an appetizer: <br>- Crispy Brussels Sprouts - 5/5<br>This was amazing! Very unique! Charred. Crispy. TONS of flavor! Gonna say the best Brussels Sprouts I had...ever. Highly recommend it.<br><br>- Spicy Roasted Garlic Miso - 4.5/5<br>Excellent! This was my dish. Just about a perfect bowl of Ramen. My only criticism; wasn't spicy enough. I was expecting Spicy, but this was more of a Pepper kick. <br><br>- Hakata Classic - 4.5/5 <br>Delicious from the limited sips I got to try<br><br>- Sapporo Miso - 4.5/5<br>Also delicious! This is a Miso broth Ramen style from the Sapporo region.<br><br>I will definitely return and try the rest of the items on the menu!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/AcpBKOCzLg1y8dPqqj-vbA/348s.jpg", "caption": "Hakata Classic - 4.5/5"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/g8Mbe_muLn730d7-yk2c4g/168s.jpg", "caption": "Sapporo Miso - 4.5/5"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/TQLF0t6kb9paeDrrL4U3SQ/168s.jpg", "caption": "Crispy Brussels Sprouts - 5/5"}]}}, {"review": {"des": "Spicy Roasted Garlic Miso: I was and still am a huge fan of their noodles. Its such a nice stringy bite to the noodle. Its durable enough, but still able to soak up the broth. The aroma of the broth is garlicky, that's a given. Its rich in flavor but also not so heavy. Its spicy, but not so overpowering that it takes over your whole palette. The pork belly is tender and falls apart to the bite. It's well marinated and flavorful on its own, but combined with the noodles and the rest of soup its an excellent bite. <br><br>By far, still my favorite ramen spot in the city", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/HpUHn8nxIsclF_euTjb3PA/348s.jpg", "caption": "Spicy roasted garlic miso"}]}}, {"review": {"des": "There is a very long wait here and they don't take your phone number, which is fairly annoying. They told us it'd be an hour wait so we went down the street to a taproom (which is so convenient) and came back within an hour. Unfortunately we still had to wait for about 30 minutes, it would have been nice to have them call us when the table was ready so we weren't waiting around in the busy front of the restaurant. <br><br>The steamed pork belly buns came with sesame mayo, scallions, and romaine. Very tasty! The pork buns come on plates served with 2, but they were so nice to give us 5 and not make us buy 6 since there were 5 of us. <br><br>The ramen was soooo good and the perfect amount of spice! I love everything spicy and it was definitely spicy and the right amount. The Hakata red was great and they did it without mushrooms for me. <br><br>I had the wind rises as my cocktail and it tasted just like a spicy margarita! Totally recommend this.", "pics": null}}, {"review": {"des": "We came in on a Saturday night at 7:45 pm and put our names on the waitlist. The estimated wait time was 45 minutes but we were seated at a 2 person table in 20-25 minutes, it was super busy the whole time but service was super quick and they were seating people the entire time. They also have a community table. <br><br>I had the original ramen. I'm not a big fan of pork belly but this pork belly wasn't super chewy/fatty, it was delicious! The meat fell apart perfectly and had a nice flavor. I really enjoyed the flavor of the broth and the noddles. I also added corn to my ramen. They can substitute chicken for the pork as an option to. <br><br>My husband ordered the pork and rice bowl. It had a nice flavor to it. Its a good option if you aren't a ramen person. <br><br>I have to say I think Wasabi is my top ramen place now in Chicago!<br><br>For dessert we had the strawberry and cookies and cream ice cream. We really liked the strawberry! <br><br>Service was fast and friendly! We enjoyed the ambience of the restaurant.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/P6TmtfQsTj0Rj3DFlUfWuQ/348s.jpg", "caption": "Original Tonkotsu Ramen"}]}}, {"review": {"des": "Ok, so I hear this is a sister restaurant of Ramen Takeya, which I love. This place was great. Love the ambience, which is much better than takeya. U can grab drinks at the bar while u wait. Staff was friendly. I got the garlic spicy ramen which was really really good. Maybe a touch too spicy for me...esp because I wanted to add the chili oil since I love that flavor. My noodles were a bit thicker than my husbands that ordered the original. I really like broth of the original and plus I could have added in as much chili oil as I needed to spice it up to my liking. Def get extra pork. The side of bok choy not as good here because not a buttery or well spiced. <br><br>Update- went back and I still stand by the review. Best ramen I have had in Chicago, the original is the way to go and to add the chili garlic oil. And they def do have garlic chips that you can get added on the side!", "pics": null}}, {"review": {"des": "One of the best ramen places i've been to.  Service was friendly and fast. <br> The place is very lively with loud music playing.  We were outside waiting for it to open.  Once it opened, this place filled up within the first 15 minutes with customers.  <br><br>The broth was so rich and flavorful.  I wish there was more meat in the ramen.  The noodles were thick and chewy, just they way i like it.  The bamboo shoot was fresh and crunchy. <br><br>Love this place.  Wish there were ramen spots like this close to where i live at.  Will be back whenever i'm back in town.  Delicious!", "pics": null}}, {"review": {"des": "The reviews and photos of the food here left me excited to give ramen another try - I've tried it at several other places but it wasn't at all what I expected. we came in on a Friday night and this place was totally packed with a 1.5 hour wait. We had a drink while we waited. There's not much room to stand, we hung out in a hallway-like area by the bathrooms. Once we were seated, service was quick. We ordered the pork boa and the pork& kimchi spring roll. Both were delicious. Finally, our ramen arrived. I ordered the spicy garlic one and it did not disappoint. The broth was incredible: rich, spicy, and full of flavor. I ended up eating the whole thing because it was so good. Without a doubt this was the best ramen I've ever had. It's awesome on a chilly night. Expect to wait, but it's worth it!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/LfDWKWSdoPGxB7rT-2B5CQ/348s.jpg", "caption": "Kimchi and pork spring roll"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/f4AbWBXfd8ywPjIvKnmtXg/168s.jpg", "caption": "Chicken boa"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/qYlNPUnwCkYuN-KVlxUsoA/168s.jpg", "caption": "Spicy garlic ramen"}]}}, {"review": {"des": "The second visit was better - upgraded to 4 stars. Still, food is delicious but service could be improved. <br><br>Earlier Review:<br>5 for food. 1 for service. 3 for average. <br><br>The food was really delicious - everything we got was great. The service on the other hand was really poor. It seemed like instead of focusing on service quality the focus was on \"diversity\" and \"coolness\". We asked for wine to be cooled while we waited - it wasn't. We asked for food recommendation and the response was dismissive - like \"eat whatever you want - I don't care\". We were never asked how our food was and always had to the attention of the waiter ourselves to get things.", "pics": null}}, {"review": {"des": "Birthday dinner for a college bestie (Happy birthday, Sarj!)  who had been expounding on the Chicago ramen scene. <br><br>Kale and tofu salad was overdressed, but delicious, and the bao, while a touch too sweet, was Berkshire pork.<br><br>Enjoyed the original tonkotsu ramen (with extra garlic oil) on scene, and then because of my gluttonous appetizer ordering, the remainder of said ramen for breakfast before heading to O'Hare.", "pics": null}}, {"review": {"des": "This place was awesome! Great pork buns and amazing Ramen. The waits do get pretty long so just be prepared... There's also a gorgeous mural on the building about 2 blocks across the front door. Fun to take pictures while you wait.", "pics": null}}, {"review": {"des": "Ordered the spicy ramen without the egg, so much flavor! Loved this place. Definitely coming back. Good customer service", "pics": null}}, {"review": {"des": "Came here before a concert on Tuesday night. Ordered a TON of food between two people. Got the chicken karaage, chicken katsu slider, pork belly buns and got a original Tonkatsu ramen and friend had a big eye tuna poke bowl. <br><br>Everything was pretty good, the chicken karaage was my favorite part, it was juicy and crispy (like airy crispy) and the sauce was good too (probably just togurashi with Japanese mayo). Surprisingly not a huge fan of the ramen, the noodles were undercooked, the egg was solid and charsiu ok -- average, but the broth wasn't as thick as tonkatsu broth should be and I'd say the black garlic taste was more prominent than the tonkatsu taste. <br><br>I also liked the pork belly buns a lot, the meat was really flavorful and well done, the chicken katsu slider had a really interesting katsu sauce on it, more tarte than the usual probably more Worcestershire sauce. The tuna poke bowl was good as well, very heavy in sesame oil flavor my friend said she didn't like it as much since she was expecting poke sauce than all the mayo. I liked it though. <br><br>Maybe this is out of the ordinary but we also had some spotty service. All these people that were seated next to us had gotten their food before us -- in terms of main meal. They may have done this to \"pace out\" our meal but we were really in a hurry because of the concert and they really took quite a while [flagging down waiters to take our order, long time frames between getting next dishes] (might've also been why the noodles were undercooked because I had asked \"so.... is our food still coming?\"). If they had wanted to pace out the meal I wish they would've asked us if we wanted it all at once or not because usually they'll do that if they're going to pace it out so much. <br><br>Would come back though, probably try a rice based dish!!", "pics": null}}, {"review": {"des": "Hubs and I went in to have dindin.<br><br>Good ambience. Not uber trendy or old. Just right and on the casual side. I liked the music. Maybe it was jazzy R&B? I can't recall.<br><br>The original tonkotsu ramen is pretty good. The noodles were el dente. The broth is very rich, almost creamy. Good bamboo shoots, mushrooms, etc. All good in that bowl. <br><br>The beef bowl, gyudon. Don't ever order it. It isn't awful but most definitely not worth the $10. I've paid more for less portion with no regrets when it's good. This bowl is not worth that. Very overly sweet. Not really a kyudon bowl. Almost tastes like bulgogi but not even the good bulgogi with complex flavors. Tastes like cheap food court bulgogi that tastes like sugar.<br><br>On the whole, would come back. Very easy walk from our place. We'll stick to sharing a ramen with some extra noodles for $2.50.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/rG8Zd-HfoUHpv_w5zikwvQ/348s.jpg", "caption": "The Original Tonkotsu Ramen. Good stuff. Not the best I've had but pretty darn good."}]}}, {"review": {"des": "We were looking for ramen near Logan Square and found Ramen Wasabi nearby. It had good reviews and was mostly empty after just opening at 5pm.<br><br>The inside has an interesting corner shape to it, but it almost feels upscale. Dimmer than average (for a ramen place) lighting, new-looking tables and chairs, plus a bar area.<br><br>We kept it super simple and ordered 2 glasses of plum wine, the Sapporo Miso ramen and the Tokyo Classic Shoyu Ramen.<br><br>The wine was surprisingly tasty. I was expecting it to be a red wine, since ya-know plums are dark in color, but nope it was a white and it was absolutely fantastic. Sweet, but not unbearable, it was easy to drink and we both agreed despite it being the first time we had it, it would not be the last by any means!<br><br>The ramen itself came out quick. It was piping hot, a very good sized portion and both ramens tasted fantastic. It's clear based on the deep, rich flavor of the broth and the tender pork that this was a quality bowl of ramen. I am not a ramen expert but only eat it once in a while as I have had excessively salty bowls before, and it didn't seem to bad here.<br><br>The service was good. We didn't need our server much but he checked up on us and was pretty nice.<br><br>A very good experience at Ramen Wasabi. Quality ramen, albeit at a quality price ($13/bowl) and unique plum wine made for an excellent dinner on Milwaukee Ave.", "pics": null}}, {"review": {"des": "This place was surprisingly very good.  The food here was all great.  The service was great as well.<br><br>What to order? We ordered 3 specific items.<br><br>The pork belly buns (it came with 2), the flavor of the pork belly was sooooo awesome.  The flavors just meshed well together. I've had great pork belly baos, and I've had terrible pork belly baos, this was definitely a great way to start the meal!<br><br>My gf's beef bowl came out next, specifically it's a Wagyu Beef Bowl (aka gyu don).  Wow, I've had beef bowl, but never like this!  The meat was so delicious and the sauce with rice, I just couldn't stop.<br><br>I got a bowl of Tokyo Classic Shoyu ramen, the broth was delicious. I've always been a fan of shoyu broth ramen, and this worked well for me.", "pics": null}}, {"review": {"des": "Nice atmosphere.  Highly demanded & delicious.  Cocktails were ok, but all in all everything was pretty good.", "pics": null}}, {"review": {"des": "Quite literally the best ramen I've had in my entire life. <br><br>A friend recommended that I venture out of the city and check this place out and I am SO glad I did. Cute little interior, nice wrap around bar and some nice minimal decorations. I got a glass of the Sauv Blanc and ordered some edamame while I looked over the menu. <br><br>Of note the restuarant next door is NOT the same. While owned by the same people, they are BYOB and only really serve sushi. The bartender described it as a great place to go drink a bottle of wine and sushi while waiting for a table. <br><br>I enjoyed the edamame - SO HOT and had nice large sea salt chunks on top. I chose to go with the Tonkatsu ramen even though I really do NOT like pork belly. It just is gelatinous and gross. NOT HERE! This tasted like BACON in the soup. Everything from the creamy and rich broth to the bacon belly and the perfectly chewy noodles was a slam dunk. I sat and savored every single bite - it was seriously killer. <br><br>I will be dreaming of this ramen for many moons.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/_fczZzJf2KF-gPK41Zqt3Q/348s.jpg", "caption": "Exterior"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/SW0tdhDUbmNDr-m6oDXHfA/168s.jpg", "caption": "Tonkatsu ramen with umami booster"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/hI5jt5HcBPA1TzwhjF7PSg/168s.jpg", "caption": "Edamame small plate"}]}}, {"review": {"des": "As someone who actually thinks ramen is pretty overrated, I actually really enjoyed the Hakata Classic Ramen (the one with the tonkotsu and the Berkshire pork belly). It's flavorful, the meat is generous, the noodles are just the right amount of chewy, and hey, the black sesame oil made the whole thing even better without overpowering. Would only come here for the ramen - a little on the pricier side at $14 per bowl (plus more if you want anything extra added), but for if you had to stop me in the street and ask me whats the best ramen in Chicago, I'd say: the Spicy Garlic Ramen at Umai and the Hakata Classic Ramen at Ramen Wasabi.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/gp34H4HKK5vGoxo9-JNGgQ/168s.jpg", "caption": "That meat though (classic ramen )"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/FY7UAw2aVy2YO_I-PziKtA/168s.jpg", "caption": "Their classic ramen = $14"}]}}, {"review": {"des": "Overall: 4.6/5<br><br>Taste: 4.5/5. Likely the best ramen place I've had in Chicago so far (and I've tried like 7 places so far) The broth is really good, the pork belly is AMAZING, and the noodles are a good texture. <br><br>Value: 4/5 Ramen in Chicago ain't cheap at $14 per bowl but hey it's really good<br><br>Ambience: 5/5 Really cool, chill place with big windows and nice décor. Comfortable and quiet place to chat. Good music selection as well.<br><br>Service: 4.7/5 Ramen came out really fast (like 5 minutes) and there was no wait at Friday around noon.", "pics": null}}, {"review": {"des": "This is my first time eating at this place and I 100% RECOMMEND eating at this ramen place. The Original Tonkotsu + Kanuki broth was like the BEST. When I first tasted the broth, I was like \"DAMN\" I can really taste the Berkshire belly and it was just full of taste. The wagyu don was alright, the gyoza was also alright, the takoyaki was amazing. Overall, the ramen was spontaneous", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/nCSQoQ-EesXrWmg3TnSlig/348s.jpg", "caption": "Takoyaki Small Plate"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/-pKFrs7e7jDkp2H5leKcrg/168s.jpg", "caption": "Wagyu Beef Bowl RIce"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/uZsCCrnUaMP2ybNkfmXlBQ/168s.jpg", "caption": "Hanetsuki Pork Gyoza Small Plate"}]}}, {"review": {"des": "Wow! I think this might be my new favorite ramen spot in the city! It was a little confusing at first because there were two Wasabi restaurants next to each other. When you walk up to the smaller one, you get redirected next door for the ramen bar. The smaller one is BYOB and apparently only serves sushi and the bigger one is not BYOB and serves ramen. <br><br>Upon arriving, we got greeted immediately and we got sat at the bar. The bar had quite an impressive display of various liquors from Japan and it was neat to see Japanese books on whisky on the shelf. It was also really neat to see that the names on the cocktails had Studio Ghibli references. <br><br>The menu options were extensive so we didn't know where to start. Fortunately, we came prepared and my friend recommended som great items. We got the pork belly buns, which were the softest, fluffiest buns ever with really saucy pork belly meat in the middle. An order comes with 2 so my friend and I shared. Then we got the Uni + Toro bowl to share and it was amazing! It was a rice bowl topped with fatty tuna and uni (sea urchin). It was served with dried seaweed (nori) and soy sauce. We mixed it up in the bowl and scooped it up and into the dried seaweed. Then we drizzled it with some soy and little bit of wasabi. The wasabi, btw, was on point. You can tell it's real wasabi that was grated. This was definitely another highlight to the experience here! <br><br>Now the ramen, we got the Spicy Garlic Ramen with just a little of the spice. The broth was thick and rich in flavor. The noodles had a good bite to it and I honestly wouldn't be surprised if they make them in the back. As you get through the bowl, you encounter the roasted garlic pieces and it's always a pleasant surprise when you get them.  It had bamboo shoots, a soft boiled egg and a very tender and flavorful Berkshire pork belly. I finished my entire bowl and left completely satisfied! <br><br>Overall, this was an amazing experience and I'm so glad I came in to finally try it! Definitely coming back to try the other dishes. I saw they had a wagyu Gyudon on the menu that's calling my name!", "pics": null}}, {"review": {"des": "Only got to try the ramen - the original and the spicy garlic miso. Both were creamy and delicious. The noodles were cooked perfectly and brought me back to Japan for a moment. It's a bit far from my hood but it's a good place to bring friends from out of town. The area is a bit sketchy as well.", "pics": null}}, {"review": {"des": "Tuesday night ～logan square～<br>we three went here to try noodles. We finished in half an hour. After eating, I don't feel so cold (the air conditioner did freeze my body except mouth， so lucky-- still can eat lol）The noodle testes so good. The potage is very yummy but a little bit greasy.(if you don't eat too much meat）<br>Tips: you can add additional pieces of pork & eggs into your bowl.", "pics": null}}, {"review": {"des": "I went with a friend to Ramen Wasabi right when they opened at 1100 on Sunday. <br><br>Service was great. No issues there.<br><br>I ordered a seaweed salad and a spicy roasted garlic miso. So what are my thoughts? <br><br>Seaweed salad was very uneventful. I've had better from AYCE places and that's something to be said. Portion size was really sad. What is this? Seaweed salad for ants?<br><br>The ramen was better a lot better than I expected, but I felt it was hyped up by my friends and didn't deliver. The broth was flavorful, but lacked in body. The toppings were delicious. That pork belly was fatty, but soooooo flavorful. <br><br>Overall, I thought it was a decent meal. Not sure if I would go again because it's out of the way for me, but I would go if someone else wanted to go.", "pics": null}}, {"review": {"des": "Low lit restaurant with nice little seating. We took an Uber here, because it's a little far from the city center and didn't seem to be much around. I wouldn't make a special trip here though, kinda regret spending $$ and wasting time to specifically come here for dinner. <br><br>Brussel Sprouts ($7)- 3/5 The top portion of the brussel sprouts seemed to be missing salt, but they had this spice on the table that paired nicely with it. However, on the bottom is a sweet soy sauce mixed with vinegar I believe. It was decent, but not the best I've had. <br><br>Spicy Roasted Garlic Miso ($15)-3/5 Pretty big portion and it is definitely spicy, but something I'm able to handle with some water. I think it had too much bean sprout with mixed with the noodles so I didn't really like that. It's just alright, nothing exciting, the broth is pretty good but the noodles are meh.", "pics": null}}, {"review": {"des": "Service has gotten worse. Waited 15 minutes just to get the check. Food quality is worse. Would not recommend.", "pics": null}}, {"review": {"des": "I am in an official relationship with the Spicy Roasted Garlic Miso at Wasabi. RAMEN love with it. I've tried a handful of ramen shops in Chicago, and this place comes out on top. (Please shoot me a message with your favorite Ramen Shop because I am dying to find other ramen spots.) <br><br>This place is a trend setter. It's hip, trendy, indie, polished, zen... whatever you want to call it; it's great. A large amount of detail went into the business model, and it shows. I wouldn't mind spending a summer night here (done and done) or a cold winter morning (looking forward to it). A lot of birthday parties, dates, and dinner parties go down here. Every time I go here, I try to order something different because it's an attractive menu. However, I find myself gravitating towards the Spicy Roasted Garlic Miso. It's milky, savory, spicy, and has that rich pork broth I cannot live without. If you want less milky, try the Original Tonkotsu or the Hakata Red. I also always order the pork belly bao buns as an appetizer. If you haven't had a bao bun, this is a great place to start. Fast service despite the long wait for a table. <br><br>Lastly, <br>forever and ever, Ramen.", "pics": null}}, {"review": {"des": "It was a trek for my friends and me to get here because there wasn't a good way to take the public transportation from where we were (Evanston), as we're sad car-less college students. But we were very determined to try Wasabi out because we heard so many good things about it. And I was not disappointed: it was THE RAMEN OF MY LIFE. We had to wait for about 40 minutes to get seated but it was all worth it. As soon as I drank that broth, all my problems went away. When I was done with my ramen, there wasn't a single thing left in my bowl, not even a drop of broth.", "pics": null}}, {"review": {"des": "I've had a lot of ramen in my day and Ramen Wasabi definitely compares to the authenticity of the ramen in Japan. The flavor was so powerful from the thick pork broth, and I love how they plate with so much noodles!! The pork belly buns are also a must when coming here. The pork in both the ramen and buns were so tender and flavorful. If you love ramen and are in Chicago this place is a MUST!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/_fH5ic2ygjBI9oVklkDfrw/348s.jpg", "caption": "Tokyo Spicy Wings Small Plate"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/yKfQNRiC6FJ5K3B3qzG9Nw/168s.jpg", "caption": "Spicy Roasted Garlic Miso Ramen, ordered it extra spicy"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/k_C9ROJcFgKfe5UBWffeew/168s.jpg", "caption": "Pork belly buns"}]}}, {"review": {"des": "Top notch ramen. Had the spicy garlic and it did not disappoint. Pork buns were also great but could have been a little spicier.<br>Only complaint with the ramen was that it bunched a lot at the bottom together.<br>Would definitely order again when I'm back in Chicago.", "pics": null}}, {"review": {"des": "Days later and Im still reminiscing on this amazing ramen.<br><br>Yall better come in your stretchy pants because half way through my ramen the button of my pants came undone. Not kidding. Im also still debating the name of my food baby. <br><br>I got the spicy hakata ramen bowl and it was incredible. The meat was filled with flavor, like it was marinated over night. It fell apart in my mouth. I was so sad when it was over. There is no need for an appetizer and i couldnt even imagine fitting dessert.<br><br>I wont let this effect the review but be prepared for a wait. We waited almost an hour for a table of 3 but tables of 2 have a shorter wait. Id recommend expanding the space of the business but its absolutely worth the wait!! I also wish they had ramen to go options.", "pics": null}}, {"review": {"des": "Best ramen. I had the Original Tonkotsu with chicken instead of pork belly (still served in pork broth FYI) and it was so so good. The broth is perfectly seasoned and in the depth of flavors you can tell it was cooked for 40+ hours. My friend had the Vegan Ramen and that was also delicious. Sometimes restaurant vegan options lack a lot of flavor and this did not at all. I also liked the topping options (kimchi is a great addition).", "pics": null}}, {"review": {"des": "Wasabi had been hyped up a lot by my friends before I went the other week. I thought it was very good, but I think the hype job didn't allow for me to love it the same way I otherwise might have.<br><br>I got the Red Hakata as I asked the server for their spiciest ramen and he was very helpful in talking through the menu. The pork belly was especially fatty (I actually had to cut some of the fat off and put it aside) but the actual meat was excellent. The broth was very tasty though I have to say for being their spiciest ramen, I would've though it'd be spicier. I ate nearly all the broth.<br><br>Next time I go, I would like to get a couple of the appetizers. They all sounded really interesting and the one our friends got looked awesome. <br><br>Advice: go early, line gets super long", "pics": null}}, {"review": {"des": "I should have known by the name. (What does wasabi have to do with ramen? Do they serve soba, too?) I should have known by the strong waft of cheap soy sauce instead of broth as I approached. I should have known when I saw the bar was for making drinks, leaving the ramen to be surreptitiously cooked in the back. I should have know that this place is just not good.<br><br>I ordered the tonkotsu ramen on a cool Saturday evening, as I was freezing and there are few things better at warming you up than a rich tonkotsu broth. Right away, there were issues. The noodles were stiff throughout and hardly warm, still resembling refrigerated store-bought ramen noodles more than a hand-made product. The bamboo shoots proved to be the source of the off-putting Kikkoman's smell (calling the maranade shoyu is generous; it lacked any subtlety). Worst of all was the pork itself, which clearly chopped from a precooked and refrigerated pork loin and chucked into the broth still cold, remaining so for most of the time it took me to consume the dish.<br><br>And the broth...the broth. Tonkotsu broth can get but so bad--the worst case is still pretty delightful. But this was pretty close to that worst case. I'm not entirely sure how it was created, but I'm pretty certain it wasn't through the necessary boiling of pork bones. It mostly reminded me of high-end tonkotsu instant ramen broth from powder; it lacked the cloudy swirl, presenting only a uniform milkiness. Any fast-food ramen from Japan would blow it out of the water, let alone a bowl that cost a similar amount.<br><br>Making good ramen in North America is hard. Some ingredients (like negi) are hard to find, and may require substitutes. Some ingredients (like pork) are unavoidably different due to farming practices. But I've had some great bowls made by chefs who embraced the challenge of making a dish far from its home. This was not one of those bowls.", "pics": null}}, {"review": {"des": "Hands down my favorite ramen spot in Chicago.<br><br>The long Chicago winter last year (well, every year) had me craving something soupy all season long. Thank goodness I found Wasabi during that time because it was a true lifesaver. I'm a huge fan of the original tonkotsu because the broth is so savory and I like the thicker noodles (angel hair for ramen is just ehh in my opinion). I also love the pork belly buns. I actually thought about buying some Berkshire pork belly and making them myself, but gave it up as a bad job, since I probably couldn't make that magic sauce they have at Wasabi.<br><br>It gets pretty crowded during the winter months, and the wait can be up to 30 minutes long if you come during peak times. Thankfully, there's plenty of parking available on Milwaukee.", "pics": null}}, {"review": {"des": "As I was eating my $15 Spicy Roasted Garlic Miso ramen at Wasabi, I couldn't help but ask myself, \"I now treat ramen in a totally different light then ten years ago when ramen was a quick fix meal that i would try to jazz up with an egg or green onions.\" :) <br><br>I have eaten at its sister restaurant Ramen Takeya in Fulton Market/West  and have always enjoyed its chicken broth ramen. I had the same hopes that Ramen Wasabi would deliver a flavorful broth and perfectly cooked noodles and they did not disappoint. I enjoyed my spicy ramen and my wife ordered the original tonkotsu. Overall really good ramen and worth eating again!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/IMAMQ87j3_LIN3jDRbZXMg/348s.jpg", "caption": "Spicy garlic ramen."}]}}, {"review": {"des": "Let's keep it simple, to me, it's always gonna be the ramen. the rest of the food on the menu is good but when you have the word \"ramen\" in the restaurant name, the ramen better be great. :)<br><br>1st time here, I tried the Original Tonkotsu - velvety pork-based broth with the regular toppings you get. The ramen is cooked just right and I am happy with what I get here. After all, this is supposed to be comfort food and the true test is when the food takes you back to the moment when you can say to yourself, \"serenity now!\"... and \"ohmmmmmm...\" :)<br><br>On that count, the ramen here delivers and so I am back for another ramen on the menu. Will keep you posted on this visit when I am done. For the time being, feast on the pics of the ramen with the Fire Bean Sprout (it is spicy indeed!)... weak minded fools need not try this. LOL", "pics": null}}, {"review": {"des": "Decent spot for ramen but a really small venue and its hard to get a decent table. If you want to be able to just get in the door and semi seated, come on a weekday night. As far as the food I enjoyed my leftovers more so the next day then having it served fresh. I guess the flavor takes a while to settle in but pretty good.", "pics": null}}, {"review": {"des": "Best ramen I've had in Logan/Bucktown/Wicker.  Prices were in line with comparable ramen joints in the area and costumers were filing in and out rapidly on a Friday night.  Incredibly rich and flavorful broth served in a hip yet relaxed setting.  The service was fantastic as well and I can't wait to go back.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/P18DZATTFXUDR_zRHUTo-A/168s.jpg", "caption": "Spicy Roasted Garlic Miso - Definitely packs a kick, not for the spice wussy but delicious if you can handle the heat"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ke-opdq-dX7w4C7fm0bvOw/168s.jpg", "caption": "Hakata Classic - incredibly rich broth and fantastic blend of flavors"}]}}, {"review": {"des": "My mind is officially blown. I had been craving ramen for quite some time I am SO glad I chose correctly to break my craving.<br><br>I LOVE that they have late hours 11:30 on a Saturday night. It was slim to none pickings past 9:00 for other ramen locations I had bookmarked. Came in around 9:30 and were seated right away. It was packed! Luckily, we had the option of sitting at the bar or an empty shared table. Chose the latter.<br><br>Luckily, no one sat next to us for the rest of the night. Otherwise, the shared table experience may be a tad uncomfortable for some, including myself. Literally elbow to elbow. It was a swank ass place! Ambiance is trendy with dim lighting and the crowd was pretty mixed and chill AF. <br><br>We ordered the pork belly buns as an appetizer. DO IT! It was so soft and the meat was so tender and juicy. My new favorite taco! Delicious and delectable AF. I ordered the spicy ginger ramen and my other got the supporo miso soup. I asked for mine super spicy. It was pretty good. Really great broth and LOTs of noodles. There is nothing I hate more than being skimped on noodles. The noodle/meat to broth ratio is imperative, people!<br><br>My only complaint is they charge extra for chili oil. COME ON! Seriously taxing out in these skreets. Way to not say anything and slyly pass us the bill. I am going to let it go-<br><br>Pretty average/standard pricing for the quality you're getting. If you're craving some late night ramen-I highly recommend!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/pPf-VenBSwqRffJV-YfbNQ/168s.jpg", "caption": "Extremely delicious and delectable pork belly buns"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/NDIx2BarH87qt_oqiI4pnw/168s.jpg", "caption": "Spicy ginger ramen"}]}}, {"review": {"des": "Pretty solid ramen joint. The interior is really spacious but when I came at Sunday for a late brunch (2:00pm) the place was still packed and there was a decent wait. The place cleared out about 15 minutes before they closed, so it could be a good shot for a small group to come in without a wait. They have bar seating as well. Coming as a group of 2 is probably the easiest way to get a table quickly - larger groups might require a longer wait given how busy the place was.<br><br>Service is prompt and attentive. The food comes out very quickly. They leave a carafe of water at your table per party.<br><br>Review for the hakata ramen - I personally found the portions a little small, especially with a little less broth than I would have expected. The broth was extremely thick and creamy, and very meaty and fatty in flavor. The pork belly is good but extremely fatty - definitely melt in your mouth kind of texture, but mainly because of how fatty the meat was. The marinated soft boiled egg was very delicious and a nice ending for the bowls. I thought the noodles were alright - they are the round, straight eggy yellow variety. I also got the umami spicey \"boost\" - did not like this at all. It was a red flavorless paste - adding it to my ramen didn't seem to do much other than make it a little creamier and redder. <br><br>Overall, Ramen Wasabi is a really solid joint.", "pics": null}}, {"review": {"des": "I love their tonkotsu ramen - best in Chicagoland. The broth is flavorful, the pork is delicious, the noodles are spot on. While ramen is the specialty, I have also enjoyed the takoyaki, pork belly buns, and sushi as well. Be sure to arrive when the place first opens if you're going on Friday or Saturday night or be prepared to wait in line.", "pics": null}}, {"review": {"des": "I really enjoyed this place for my ramen fix! I think probably one of the better places in Chicago for an authentic bowl of ramen. Their broths are more tonkotsu thicker based as they only had one shoyu from what I remember. It's really convenient to get the spot by the L and Wicker Park is just a short ride away via bus. Be wary of the times you come in to dine because they close in the middle of the day then open up again. We made it just in time for lunch hour, but I would definitely check before making the journey there. Overall, I liked the ramen was a little on the saltier end for broth in my opinion. Worth a try! Especially because there not a ramen chain.", "pics": null}}, {"review": {"des": "Truly great ramen. I love that you can substitute chicken for the pork belly. I had the Hakata Red. Warning it's SO SPICY but also really flavorful and delicious. My friends had the spicy garlic miso which was spicy but way less than the hakata. The service was prompt and we only had to wait ten minutes for a table. We also had the spicy wings. Everything was very savory and enjoyable. Definitely would recommend.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/1pdkemEAWulyq68hJkaAzQ/168s.jpg", "caption": "Tokyo Spicy Wings Small Plate"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/EhnRf4Qk6Z5JlDqPwpG9jg/168s.jpg", "caption": "Hakata Red Ramen"}]}}, {"review": {"des": "This is without a doubt one of my favorite ramen spots in Chicago. Just ate here for the first time and got the Spicy Roasted Garlic Miso and it was amazing. Rich, spicy broth. Al dente noodles. Soft boiled egg. Perfection. I also highly recommend the Crispy Brussels Sprouts.<br><br>Update: just ate here for my second time and fell in love for a second time. I got the Hakata Red, which is also amazing, though I'll probably ask them to hold the pickled ginger next time; it's not much, but I'm just not a ginger person.<br><br>Like many hot ramen places these days, you'll find contemporary decor and R&B/hip hop on the speakers. You can also expect a wait. The 3 of us came at 2 (when the kitchen closes at 2:30) and waited 20-25 minutes. They don't take reservations either. We were offered seats at the communal table and bar without a wait though.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/H7g2o3wtcCLwUv4worNEjw/348s.jpg", "caption": "Tokyo Classic Shoyu"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/756sLyBHtmjcAxgMdG0f-w/168s.jpg", "caption": "Hakata Red"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/EDieP_5AvBWrcsW-ZCJHqg/168s.jpg", "caption": "Crispy Brussels Sprouts"}]}}, {"review": {"des": "The bitter cold winter...  The darkness...  In town for a engagement and don't know anyone in town that's free, not sick, or not on a date... Let's get some ramen!<br><br>So lots of reviews and not sure what to make of Chicago ramen.  The wait wasn't long since it was just me so I got a bar seat.  Ordered a cocktail, an Alaskan cod slider, and the original tonkotsu ramen.<br><br>The cocktail was really nice with roasted rice sprinkled on top and if you follow my reviews, I love texture, and this brought it!   The cod slider was recommended by the bartender and it was possibly the best part of the meal.  Tender cod, a little tartar sauce, perfect appetizer.  The ramen had a great broth and the noodles were excellent.  Tender pork.  Egg was solid.  Basically everything hit the right spot.<br><br>Highly recommended.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/qG2HJPWRTWjESh52k0DCgw/168s.jpg", "caption": "Tonkotsu"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/vWwmyeniGajTuWNjHOPhOg/168s.jpg", "caption": "Alaskan Cod Slider. Greatness"}]}}, {"review": {"des": "Best takoyaki ever and the tuna poke was awesome! Great service, can't wait to try their cocktails!", "pics": null}}, {"review": {"des": "Hakata! Spicy and delicious. The food was really good and the atmosphere was vibrant. I've had Ramen in a couple of places, but this one really caught me. Hakata classic was spicy and flavorful. Normally you can only get spice or flavor, this has both. I would drive again from Indiana just for the ramen.", "pics": null}}, {"review": {"des": "I was really excited to try this place but sadly really disappointed. They have a large selection of ramen but most are pork broth based. I don't eat pork so I asked if the pork broth could be switched out to the seaweed or chicken broth in the Spicy Miso Ramen. The server went to ask and they said they could do it. When my ramen arrived it was not what I ordered. By the ingredients I figured it to be the classic with chicken broth (I knew it was chicken broth because the server who brought it said ramen with chicken broth). Our sever never came back to ask how our food was so I never got a chance to tell her. I just ate what I had. What I received wasn't bad but also not great. I thought the noodles taste like spaghetti not ramen. My friend had the vegan ramen that she said was good.", "pics": null}}, {"review": {"des": "The best ramen I've had in Chicago so far! Lines form quickly, so try getting there before the dinner rush (I got there around 5:35 on a Friday night and was able to get seated right away). <br><br>I started with the pork belly buns ($8) - a complete must have! It's like biting into the softest cloud-like bun filled with yummy, braised berkshire pork belly topped with a tangy sesame mayo. They're so good, you might want to pass on having to share these flavor pillows. <br><br>For the ramen, I ordered the Spicy Roasted Garlic Miso ($14), which was honestly everything I had hoped for. It came out surprisingly quick too! The rich broth was super flavorful and the spice level was just right. The egg noodles were really chewy and had that good, slightly tougher texture I look for in ramen. The perfectly-cooked pork was also very savory and enjoyable; I had to stop myself from eating it all at once. The soft-boiled egg was expectedly good and the roasted garlic floaters were a nice addition. <br><br>Currently making plans to eat here again!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/i0kKGBBd2otExVJ5YwWFkw/168s.jpg", "caption": "Pork Belly Buns Small Plate"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/MJg0c66r38P7tvDsPANxUw/168s.jpg", "caption": "Spicy Roasted Garlic Miso Ramen - so good!"}]}}, {"review": {"des": "Came here on a Wednesday night around 5:30pm and was seated immediately by the window! Our table was pretty small, but it was totally fine! <br><br>We started with the takoyaki and the fries Brussels sprouts! Best takoyaki and fried Brussels sprouts I've ever had! The takoyaki was crisp on the outside and warm and gooey on the inside. The chunks of octopus was the best part of it! <br><br>The Brussels sprouts were crispy, salty (but just the right amount) and sweet from the glaze! I could literally eat a bowl of that every single day for the rest of my life! <br><br>Ordered the spicy miso ramen. So so so good, and actually spicy, but not overly spicy! The pork in the ramen was also V tasty! <br><br>I would be here once a week if this was on the north side!", "pics": null}}, {"review": {"des": "Decent enough food, I wasn't impressed with the service during Friday lunch though. My friend arrived first and told me when she was seated they unceremoniously put the menus on the table. There was no, \"here you go.\" Or, \"I'll be back to take your order shortly.\" In fact, it seemed like we were too much trouble. They give you a carafe of water, which is great, but i still had to stop someone to ask for a refill. It's a small space so it's hard to be forgotten, but our dirty plates and empty edamame shells from appetizers sat in front of us until the bill came. I could meow a little longer about how aloof the service was, but I rather try another place and make new ramen memories.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/cq5-hAQoOxJJTDhYXCWHdQ/168s.jpg", "caption": "Spicy garlic not so spicy"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/qlcLiJOYRdIZaojqgCQfwA/168s.jpg", "caption": "Potstickers"}]}}, {"review": {"des": "Today was a bright, beautiful and sunny day. We were seated near the window so we could see the blue sky above. Before \"Ramen Wasabi\" came into being, it was just \"Wasabi\" which was in a darker location, which I believe now is where they serve their sushi. This new location for their ramen restaurant is must more bright and inviting, with a modern interior. <br><br>When I had their ramen the first time, I thought -- \"Yes, this is good ramen.\" I was content and satisfied after traveling many miles away​ from Iowa City, which is in dire need of a good ramen place. Their soft boiled half egg and Berkshire Pork Belly are amazing. <br><br>But today-- I had what is probably the most delicious morsel that I've tasted in a while now, their Pork Belly Buns. Yes, $8 is pricey for two small buns that will take you only a few bites to eat, but they are absolutely worth it. They're like two light and savory clouds, bursting with juice and delicious pork taste. I swear the pork and its fatty goodness just melts in your mouth. Eat them while they're still steaming warm! That's when they're at their best. Thank you, Wasabi for such a treasure.", "pics": null}}, {"review": {"des": "Favorite spot for Ramen! <br><br>The Tokyo Wings were phenomenal<br><br>Spicy Roasted Garlic Miso was delicious <br><br>Awesome service. We had a great experience overall.", "pics": null}}, {"review": {"des": "I had the ramen of my life here. It was super packed, so plan to wait. (I waited 45-ish minutes with my friends.) <br><br>Honestly, probably the best ramen I've had at a restaurant. However, they didn't have very many options if you're avoiding pork. Most of their items are in pork broth. Only one option wasn't pork-based, and it was their vegan ramen (which I ordered and it was great). I wanted to add in a boiled egg as my protein, but the egg is also marinated in pork broth. That's my only complaint-- but the ramen was definitely worth the hype imo.", "pics": null}}, {"review": {"des": "This was one of the two ramen places I wanted to try while I was in Chicago. Came here around 6ish with two of my friends on a Wednesday and it was pretty pack. I guess that is a good sign that the food here was good. We were pretty lucky to get there before the rush. The hostess was nice and told us it will be about 25 min. wait so it wasn't that bad. There were about 3 groups ahead of us. The decor of the place is polish and would be cute place for a nice dinner date. Once we were seated, the waiter came by to gave us menu and water for the table. <br><br>I love spicy food so I ordered the Spicy Roasted Garlic Miso ramen. It was AMAZING. The broth was super flavorful and the spice level was not too overpowering. Sometime when I go to other ramen restaurants, the pork belly are not seasoned well but here the pork belly were seasoned well. I really enjoy that bowl of ramen. Finished the whole thing!<br><br>My friend got the Original Tonkotsu and the other one got the Hakata Classic. The broth for both bowls were really delicious. I like the original Tonkotsu broth a bit more because it was more creamy. But you won't regret ordering either of two.<br><br>We also ordered a bottle of hot sake which my friend like since it taste like hot wine to them.<br><br>I would totally recommend coming here if you want a yummy bowl of ramen.", "pics": null}}, {"review": {"des": "Ehhh so upsetting with the new location. Food is good but the new space is just so uncomfortable. Couldn't enjoy our dinner, definitely not worth it. Seemed like such a waste to pay for dinner when the tables are pushed so tight together, people bumping into each other, servers spilling and dropping things. Just too much going on all around. Ate quickly and packed up. So sad when your really looking forward to enjoying the evening.", "pics": null}}, {"review": {"des": "Nothing better than hot ramen on a cold chicago fall day! The broth of the tonkatsu ramen has so much flavor, you don't even need noodles. But for you noodle lovers, the cook them just aldente enough so it's not too soggy and slightly firm. Other favorite menu items are the chicken nuggets and takoyaki. Something about fancy Japanese chicken nuggets is absolutely perfect. Squeeze some lemon over it and dip it in the aioli and it's the perfect snack. Such a crispy breading to it and very flavorful. The takoyaki is octopus that is breaded in the shape of balls, doused in a sweet teriyaki sauce and sprinkled with bonito flakes. It makes for a great Instagram video because the bonito flakes moves!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ft3Ui5O3_7v--oCuT7fYiA/348s.jpg", "caption": "Takoyaki Small Plate"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/hXUKlY-raflCaqz7wN0MjQ/168s.jpg", "caption": "Original Tonkotsu Ramen"}]}}, {"review": {"des": "Some of the best ramen in the city, IMO. Noodles are nice and chewy, broth isn't too salty. Fried Chicken buns were TASTY. A little messy, but worth it. Pretty bleak wine selection - but some nice sake choices and japanese whisky served with \"craft ice\"...<br><br>Hostess was OK. The entrance/waiting area with host stand is small and awkward and there is no way to leave your number to go wait elsewhere. It's 2018...no need to make everyone stand packed like a can of sardines waiting 40 minutes for a table. The table next to us had a couple of small mess-ups with their order, but luckily we were spared of any issues.<br><br>All in all, I'd say it's worth the wait and great place for a first date or a night out with friends.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/_opDdJDTLZ_A3DIEPIBbrw/348s.jpg", "caption": "Fried Chicken Buns $8 for two"}]}}, {"review": {"des": "I finally found a restaurant with close to authentic tasting Japanese ramen!!! My husband and I both got the Tonkotsu ramen and it was delicious!!!!<br>The kakuni (pork belly) was a little disappointing, but the ramen broth was so great that it made up for what the kakuni was lacking!<br>I will definitely come back to this restaurant for ramen when I visit Chicago the next time!!!<br>Keep up the great work Wasabi!!!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/LYpkqU7M4x9xI_j22JGLcQ/168s.jpg", "caption": "Original Tonkotsu with Karashi takana"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/w6l8sK4yWyxjHi0wOTVsGg/168s.jpg", "caption": "Kakuni Bun."}]}}, {"review": {"des": "When it's 40 degrees out nothing is better than a solid bowl of ramen. However, be sure not to come hangry like we did because there will most likely be a wait on the weekends. Even if you arrive 30 minutes after they open.<br><br>It was about a 45 minute wait for the two of us and we were seated at the bar. We started off with two appetizers, the sashimi carpaccio and takoyaki. Both were delicious! But we really came for the ramen. Both of us got the spicy roasted garlic miso and it hit the spot. The noodles were a good texture and the broth was flavorful but didn't find it to be at all spicy. Wasabi is definitely one of the better ramen joints out there. But I'm not surprised since it's sister restaurant is ramen takeya, which is also one of my favorite spots.<br><br>Another note, I guess they don't combine their ramen and sushi anymore. Instead they have two store fronts now but they're right next to each other.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/beRS-Mi9PrQwbEPsgxspxQ/348s.jpg", "caption": "Spicy roasted garlic miso"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/MDIYvUJqanS0yUZWRTHRdg/168s.jpg", "caption": "Takoyaki"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/wMCU7bxBPIFv5Iu4oTka5Q/168s.jpg", "caption": "Sashimi carpaccio"}]}}, {"review": {"des": "This was my favorite Ramen restaurant for Tonkotsu ramen. Things change. On my first visit the soup was very white and the black burnt garlic yu was prominently floating on the soup. This time everything was a little muddled and I would have missed the sauce if I wasn't looking for it. Soup should have been hotter. You should have to blow on it to get it down to eating temps. Still gets a 4 because soup flavor and pork belly was tender. My favorite ramen has moved on to the clearer chicken soups. <br><br>Service was quick.<br><br>Maybe the lunch chef was just not careful with my ramen. The bowl was different. I have posted pictures from FB Ramenreview I took in 2014. See which one looks better.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/fLPS8gRulr6_Ja-Y0Ax1Aw/348s.jpg", "caption": "2014 bowl. The black garlic yu was a prominent part of the bowl."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/pLQ7wEl4WjwFCzsb6YOVRw/168s.jpg", "caption": "This just looks muddled up. Compare this to the 2014 picture I added."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Jikbyv2RmS7srfqbL9Dzog/168s.jpg", "caption": "Nearing the end"}]}}, {"review": {"des": "I've been hearing about Ramen Wasabi since I've moved to Chicago 4 years ago. I wouldn't say I'm a ramen fanatic but who doesn't love a warm bowl of ramen on a chilly day in Chicago? <br><br>I must say that if you're coming from the city, this restaurant is quite a hike. That's why it took us 4 years to come here. Luckily, there's plenty of parking nearby and you can always take the blue line train here. <br><br>Come early! This restaurant opens at 5 PM and is first come first serve. My husband and I came around 6PM on a Friday and it was already packed. Luckily, our wait time was only 15 minutes and we were seated near the window. The waiting area is tiny so if you come late on a chilly day, you might have to wait in the back by the bathroom. Also, they only seat complete parties. <br><br>We only came here for one thing only - ramen. We ordered the original tonkotsu and the hakata classic. The depth of flavor of the original tonkotsu was delicious - rich and creamy. The broth of the hakata classic was a lot lighter than the tonkotsu but still flavorful. One of the best parts of this ramen was the marinated Berkshire pork belly char siu. It's not your average chashu pork. They also give you a lot of toppings! I honestly did not care of the pickled ginger in the hakata classic though. <br><br>Service was spot on at Ramen Wasabi. We were greeted immediately with water. And like another reviewer mentioned, our ramen came out faster than Jimmy John delivers! It's pretty awesome! We were both pleasantly surprised.<br><br>If you're in the area, you should definitely give Ramen Wasabi a try!<br><br>FYI, Wasabi's ramen joint is NOT BYOB, but their sushi joint is definitely BYOB.", "pics": null}}, {"review": {"des": "Fantastic ramen! There's also tons of street parking if you drive. I went pretty early on a Sunday and didn't have to wait at all. Great service and great food! I've only had the ramen, but I've loved every bowl I've ever ordered.", "pics": null}}, {"review": {"des": "After waiting over an hour starting at 8pm, I was sadly met with disappointment. Our party of 5 squeezed into a table for 4 since seating options are scarce in this quaint spot. They have very hip decor from their furniture to their napkins, which I loved. There is a small waiting area that got uncomfortably crowded and the bar area was also full. There appeared to be plenty of street parking around the restaurant.<br><br>Since it was my first time there and my friend had been raving about their ramen, I decided to try the Hakata classic ramen. Overall it was just ok. The egg was cooked perfectly. However, the broth was way too salty and the bamboo shoots were marinated to an overpowering level. There just wasn't any balance to the bowl. <br><br>I also tried a bite of my friend's fried chicken bao which was delicious. If I come back, I would try their menu outside of ramen.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/hb2tLSp2qOBH50IyK_yVrA/348s.jpg", "caption": "Hakata Classic Ramen"}]}}, {"review": {"des": "My husband and I have been to Strings for some ramen, and we both agreed that they're pretty comparable. The service was very nice. They need some curtains for their windows though. During our warmer-than-usual 50 degree November visit, we sat right next to the windows, which got to be a bit hot. I felt like an ant under a microscope!! I can't imagine what it'd be like during the summer.<br><br>We started off with some of the pork belly buns. They were yummy, but the meat was a little thick. Made it a bit hard to bite into. Probably not the best appetizer for your first date night.<br><br>My husband had an original tonkotsu, which was pretty standard for Japanese ramen.<br><br>I had the Spicy roasted garlic miso, which was also good. I almost thought that I would be melting eating that and being under the microscope, but I fared alright. The garlic flavor didn't seem to be there though. It wasn't as spicy as I thought either. If you can't take much spice, I don't recommend it.<br><br>Overall thoughts: Pretty tasty, standard prices (for Japanese ramen). In need of some design reconsideration.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/8AR3NACf8DRLu8gWsGhGqg/348s.jpg", "caption": "Original tonkotsu"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/PI2pZqp3G3EiIaUJZRgcpw/168s.jpg", "caption": "Spicy roasted garlic miso"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/oBnU1Qcv8taxO_0eZ3Uvmw/168s.jpg", "caption": "Pork buns!"}]}}, {"review": {"des": "Ramen Wasabi is quite yummy...I must admit. I like ramen and have gone to a couple of places around the city such as Furious Spoon and Ramen San, and I must say Wasabi is my fave. <br><br>A few friends and I decided to go here before a show and it was a great decision. We got there right when they opened and people quickly filled in. So get here right when they open or you'll wait an hour for a table. <br><br>Wasabi is a lively little space. Great music, nice decor, and jamming! I like how they keep the sushi restaurant separate but I don't think it would hurt if they knocked down the wall between the 2 to create more space. <br><br>Our waitress was great. It took her a while to come, we figured they forgot about us since we were in the back of the restaurant, but she care eventually. She was very helpful with menu suggestions and explaining the tastes you would have with the ramen we were deciding between. <br><br>Now on to the good stuff...THE FOOD! It was delicious. All four of us loved what we ordered. We started with the edamame and pork belly and kimchee spring roll. We were going to get the slider, but our waitress advised not too. She said it's only 1 slider per order so it wouldn't have been worth it for the 4 of us to order. So we passed on that and went for the spring rolls, which she said were good. Both were great and the spring roll was really yummy. I ordered the Original Tonkutsu with the spice umami flavor booster. The flavor booster was a nice add in. The broth was sooo good. It was a thicker broth as opposed to the Tokyo Classic which is really light, but enjoyed it I loved the pork belly and everything in my ramen. My friends ordered the Spicy Roasted Garlic Miso and the Tokyo Classic Shoyu. They loved their ramen as well. <br><br>The drinks. I was boring and got a regular glass of Cab. My friends ordered the Ryukyu Old Fashioned and the Shiso Perfect. All loved their cocktails. <br><br>Wasabi is a definite return to. Loved this place. I would like to try their sushi next.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/9ugdpa4Vo1J5x7kkrs3gDw/348s.jpg", "caption": "Classic Tokyo"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ng9bRfi9mwnGm_qaFk2qHA/168s.jpg", "caption": "Shiso perfect"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/juCHWTfxZS37EZog5ujs5A/168s.jpg", "caption": "Spicy roasted garlic miso"}]}}, {"review": {"des": "My initial reaction to Wasabi was worrisome because we were the only Asians in an Asian restaurant; none of the workers nor customers at the time were Asian which usually isn't a good sign haha!  Alas, I trusted my fellow Yelpers' positive reviews and they did not leave me astray!  Wasabi blew us away, they really know how to make a fantastic bowl of ramen!<br><br>My teenagers are ramen fanatics and they are pretty critical about their ramen. They LOVED their bowls of the Original Tonkotsu ($13).  It included delicious Berkshire pork belly, soft boiled egg, black mushrooms and scallions.  The broth was awesome; it was creamy & rich and the noodles were firm and chewy. Now in comparison to the other ramen houses, my teenagers think Hokkaido Ramen Santouka's (Mitsuwa) tonkotsu broth still rules and the noodles at Strings Ramen are the best.  However, Wasabi is definitely tops on their ramen house list now!<br><br>I got the Hakata Classic ramen ($13) which had similar toppings of the Original Tonkotsu but it had pickled ginger which gave it a nice flavor!  I also added the Spice Umami flavor booster for an additional $2; my bowl of ramen was so good!    <br><br>My 10 yr old got the \"Chicken Nuggets\" which she loved.  The takoyaki appetizer was delicious and seaweed salad was yummy!<br><br>We arrived at Wasabi when they first opened on a Saturday night, so there wasn't a wait. The decor is cute and clean.  The servers were very attentive and friendly.  Wasabi is a definite must if you are in the Logan Square area!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/lyXJPZcNHPa6mu6VaBcWsw/348s.jpg", "caption": "Hakata Classic ramen"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/32o43wW-1SEp0KYRFvfqAA/168s.jpg", "caption": "Tonkotsu ramen"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/yWhrahpJKlDepiD8bwa1ug/168s.jpg", "caption": "\"Fried chicken nuggets\""}]}}, {"review": {"des": "I have been searching for a Ramen place in Chicago that had GOOD RAMEN. From broth to noddle to a little spice and finally I found it.<br><br>First thing first, if you come here please expect to wait. We were there when they opened at 5 pm on a Saturday and before you could SnapChat the sign the place was packed! It is about an hour wait, but we made our way in faster somehow!<br><br>The menu is packed full of goodness. One thing I wasn't a fan of is the menu noted \"Sliders\" but you only get a slider, just a bit misleading. Out table had drinks, from the Old Fashioned to the Shiso Perfect. Both good drinks, the shisho perfect had flavors of a mojito but still interesting.<br><br>For an appetizer, we picked the Pork belly Kimchee Spring Roll with the micro greens and house tartar sauce. It was perfect. The tartar sauce didn't overpower the natural flavors and allowed the pork belly and kimchee to shine through.<br><br>On to the RAMEN!<br><br>I ordered the Spicy Roasted Garlic Miso with the added Park Belly Char Siu (it is pork belly marinated in like a sweet and sour sauce).  It was perfect. The broth had great flavors in it, delectable taste and a perfect balance of vegetables, noodles, and broth. The pork was so tender you wanted to eat more. The one criticism is that the pork had too much fat on it. You could literally be chewing a big piece of fat, not good.<br><br>Also ordered at our table was the Original Tonkotsu and the Tokyo Classic Shoyu. The Original and Spicy Roasted Garlic both have this bit of a creamy broth while the Tokyo Classic was more of a lighter base, however all GREAT options", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/0zwNOZGqZOe5AqER1_xSsQ/348s.jpg", "caption": "Ryukyu Old Fashioned: Maker’s Mark, Okinawa Brown Sugar, Weatherby’s Orange Saffron Bitters, Orange Peel, Maraschino cherry"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/JheFBy0akdx2CVyDZ9wLjw/168s.jpg", "caption": "Original Tonkotsu: Berkshire pork belly, soft boiled egg, marinated bamboo shoot, scallion, sesame, black wood ear mushroom, garlic oil"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/f4oY6ZoZrb7FgxxIIBpTXw/168s.jpg", "caption": "Tokyo Classic Shoyu: egg noodle, berkshire pork and cage free chicken light broth, berkshire pork belly, soft boiled egg, marinated bamboo"}]}}, {"review": {"des": "Warm soupy goodness.<br><br>Ramen Wasabi's standard bowl of pork is a pretty solid pick. I quite enjoy both the noodles and broth, wish they give you both sides of the egg.<br><br>I remember in the past, I also really liked the pork baos, but this time they just kinda fell apart as you hold them up and the taste was just ok. Spicy wings are super spicy and a bit too crunchy (slight burnt). I'll stick with ramen", "pics": null}}, {"review": {"des": "This was so underwhelming after all the hype from all my friends. Honestly, I prefer Oiistar or High-Five Ramen. The only thing that was actually super good was the pork inside the Tonkotsu Ramen and the Chicken Karage we ordered. The chicken was SO juicy, but obviously a pretty small portion for the price. <br><br>Good thing is, there was no wait when I came at around 5:30/6:00 pm on a Friday night. I LOVE NOT WAITING FOR FOOD! <br><br>Overall, overrated. Maybe I ordered the wrong thing?", "pics": null}}, {"review": {"des": "I have been here twice and loved every moment of it. I drive past this place all the time and it's ALWAYS busy, so naturally my stomach told me to stop ignoring my urge to stop and JUST DO IT. Both times I decided to stop,<br><br> I was seated at the bar because I like to eat alone.I don't recall the ramen I ordered but it was the spicy one with extra corn. The ramen came out faster than Jimmy John's gets to your house. It was very VERY good! I typically never finish eating my ramen but this place really delivered and I ate everything. All the spices and flavors were very well balanced. There is honestly not much of a review that you can do on RAMEN. It was yummy and you guys need to check it out!<br><br>All the bartenders were super friendly and very attentive. The crowed is very mixed! It's a bit noisy in there because of the small space but also very comfortable. I like to complain but with this ramen shop, I have NO COMPLINTS. Well done guys!", "pics": null}}, {"review": {"des": "Visited last night for dinner and we were pleasantly surprised.  The interior is modern with low lights very contemporary.  While we didn't enjoy our 45min wait, we got cozy at the bar over several rounds of cocktails (Shisho Perfect and Wisper of the heart) that bartender put a lot of effort into making. <br><br>Seating against the window gets a bit cold due to draft, I recommend getting one of the interior tables.  Our server was a bit slow but once you catch her attention she was friendly.  <br><br>We ordered crispy brussel sprouts, chicken buns, vegan tan tan men, and wagyu beef bowl. All of the dishes we delicious and arranged to perfection.  I think I have found my new favorite restaurant in Logan Square.  This area has been on my radar for a while now, I'll be back to try their new Sushi restaurant next door.  <br><br>FYI- most online review suggests wasabi is BYOB, it's a full bar restaurant so not a BYOB.  Although their next door sushi establishment is new and still a BYOB.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/6jjSB7NzpAOFiEX4bkWKMw/168s.jpg", "caption": "Shisho Perfect and Wisper of the heart!  We loved it!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/9_HV_Pf69Qy9Xr7OddkS-g/168s.jpg", "caption": "So crispy and delicious!"}]}}, {"review": {"des": "We were going to go to Kizuki Ramen & Izakaya for some ramen but they weren't open. After stopping by a few places closer to Kizuki Ramen & Izakaya and finding they were also not open. We ended up with Wasabi. We got there a few minutes before they opened. Waited a few minutes and was seated. The staff was friendly and attentive. I ordered the Tokyo Shoyu and my lunch companion ordered the original tonkatsu. Both broths were saltier than I would prefer but I think that's normal for ramen. Both of the dishes had a healthy portion of pork and half of an egg. Each of our bowls was about $14. <br><br>I don't think there was a parking lot... so we parked on the street and paid the meter. We were in an out in about 45 mins.<br><br>I enjoyed my experience and would come back to try one of the other dishes.", "pics": null}}, {"review": {"des": "I don't want to be rude but I so much care about the taste of food. The quality is good but not much umami in their food. Take their ramen, i got more satisfaction in santouka ramen. The ambience is great but don't care much more than taste. I want to be generous but my palate cannot be pretentious so in conclusion, if you are a social eater they may deliver.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/C-09M_56GC3F03Oke8h_RA/348s.jpg", "caption": "Bamboorito by the entrance"}]}}, {"review": {"des": "Best Ramen EVER!<br><br>The only reason I cannot give it 5 stars is because it's in Chicago and not Tennessee (where I reside).<br><br>A table for 6 on a Sunday afternoon with no wait. Beware - all parties must be in attendance before they can seat you. <br><br>The menu was absolutely mouthwatering. Everything from appetizers to entrees, were described perfectly and encouraged my curiosity. We ordered several appetizers to share and had of course ramen. The flavors did not disappoint. The items were delayed coming out but because everything is made as you order. And totally worth the wait. <br><br>If you're ever in Chicago, I highly recommend this place!!! You will not be disappointed.**FYI its on the outskirts of downtown Chicago, so catch an Uber/Lyft. <br><br>Items ordered:<br>Fried Chicken Nuggets - juicy, fresh, tender inside, and perfectly crisp outside. P.S the sauce is yummy!<br>Pork Belly Buns <br>Pork Belly and Kimchee spring roll - large portion, AMAZING sauce!<br>Crispy Brussels Sprouts - generous portion and yummy.<br>Original Tonkotsu <br>Spicy Roasted Garlic Miso - SUPERB! I loved EVERYTHING about this dish. It is an ABSOLUTE MUST!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/x7rS22jDtJEp0DnG1dOdwA/168s.jpg", "caption": "Spicy Roasted Garlic Miso: this is a MUST!"}]}}, {"review": {"des": "Fantastic ramen. Below average service. <br><br>Ramen wasabi has been on my list for awhile, so I definitely had high expectations. We came on a Sunday night at 9pm, one hour before they close, and they still had a 15-25 minute wait for a table for two. The bar/communal seats are up for grab as they open up however. <br><br>Service <br>I wish the hostess would point out the communal/bar seating to the 10 something people waiting. I saw 5-6 of them open but wasn't sure if I can just walk right up and sit. I asked first before doing so, but I'm sure some people were just plain sitting there and waiting for them. Once we were seated, a good 10 min passed before water was brought out, they apologized, but eh still. Otherwise, food came out with decent timing and we were checked in with plenty.<br><br>Food<br>Seaweed salad - nothing too special, ponzu dressing w/ sesame seed. <br><br>Crispy Brussels sprouts - Fried and tossed with lemon juice and secret sauce. I couldn't taste much past the burnt (in my opinion) brussels sprouts, the whole bowl looked almost all black/brown. I tasted maybe a hint of lemon every other bite, but no secret sauce. I'm not sure if it was supposed to be that way, but I definitely didn't like it, it was also very oily. <br><br>Vegan Tan Tan Men - the saving grace. Worth coming back for. We opted for the egg noodle, with a egg and mustard green added. For a seaweed mushroom based broth, it was so savory and rich and had a slight heat from the chili oil. The seitan added texture to each bite and the ragu, I believe, contributed to the flavor of the broth. Mustard green was a nice addition. The egg was cooked perfectly, but its own flavor was masked by the rich broth, also I only got half of it??", "pics": null}}, {"review": {"des": "After a long day of travel from Miami, we finally made it into the city. We decided on Ramen Wasabi. The decor here is so cute! Wait time wasn't too bad for us, only 30 minuets considering the restaurant was pretty crowded when we arrived. <br><br>Food: if you eat pork, I STRONGLY recommend the pork belly buns as a starter. I also had the Edamame. It was a bit too salty for my taste so I think next time I'll ask them for a lighter portion. <br><br>Service: Great. Leo was our server and was very attentive. Will definitely be back for more ramen and to try other things on the menu.", "pics": null}}, {"review": {"des": "I'm a fairly picky Ramen lover and very few places satisfy my cravings.  However,  Ramen Wasabi's Hakata Classic exceeded my expectations.  The 45-hr cooked bone broth was savory.  The thin noodles were perfectly done, and the each bowl came with two slices of melt-in-your-mouth pork belly.  The guy who ate next to us at the bar literally made \"mmm\" noises and slurped down every bit of broth.  I would definitely come here again and again.", "pics": null}}, {"review": {"des": "A bit dissatisfied with the overall experience at Ramen Wasabi. It wasn't terrible, just eh. My order for one spicy roasted garlic miso came out faster than McDonald's, no joke it arrived in under 3 minutes.<br><br> Once I waited, waited, and waited some more (my waiter could not step away from gossiping with his co-workers) I finally was acknowledged and asked if he could bring utensils/napkin. Now I can eat my lukewarm miso! <br><br> Average taste, not very spicy, too much scallion, and the rich pork broth was far from rich. I asked for something to add a bit of spice and was informed that they only had siracha or a chilli oil. I opted for the oil and was pretty disappointed.<br> So yeah, not terrible food, just so-so.", "pics": null}}, {"review": {"des": "After a long wait on a Thursday night, although with a lovely Sapporo in hand, we were seated among the masses. We ordered pork buns to start. Two come per order, so if there are four of you, like we were, get two orders. They're comfortably sized for four big bites of pork and green onion. They were okay. Good, but not great. Is it bad that when it comes to pork buns I crave BBQ pork Wow Bao?<br><br>We then ordered our ramen and the three newbies, myself included, ordered the original tonkatsu while our hostess ordered the spicy garlic miso. Maybe I was already full from my beer and my bun, but I was not as into it as I would have hoped. It was good and although salty, the saltiness was expected, so that did not bother me, but there was something lacking. Maybe I needed a dash of heat and that was my fault. But I also craved more vegetables or something extra. Or maybe my noodles felt too thin or insubstantial. I found myself looking for things to grab in my broth bowl and not that I did not have enough food, but it seemed to be hard to locate. After a while, I gave up and gave my leftovers to a friend. Perhaps ramen is not my thing, but I did not feel that way at Slurping Turtle.<br><br>Yes, I might come off as pedestrian in my palate, mentioning Wow Bao and Slurping Turtle, and perhaps that is my folly, but my reviews are geared to those with simple tastes like mine.", "pics": null}}, {"review": {"des": "Wasabi offers one of the best broth in town. Yes, they've split the restaurant into two (their sister restaurant is Wasabi Sushi and Robota next door), and yes.. we may have awkwardly brought in our own wine and beer by accident (didn't get the memo about BYOB being cancelled) .. but overall, the decision to do so has cut down on waiting times (remember the old days with 1+ hour waits for two?) and was likely the smarter business choice, so that they may charge for alcohol.<br><br>We had the Spicy Tokyo Wings and Pork Belly Buns. Spicy Tokyo Wings definitely have a kick. They were well cooked, and the flavor had a darker flavor that reminded me a little of gochujang (Korean red chili paste). The pork belly in the Pork Belly Buns was cooked well. The buns were a fusion twist of the traditional gua bao (Taiwanese pork belly buns), and had the usual cilantro and pickled flavors replaced with blander flavors like lettuce and mayo. The garnish could have been better distributed with the meat, to help add more variety and flavors with each bite. Both sides were prepared well, but left something to be desired. If I were to order again, I would skip the Spicy Tokyo Wings.<br><br>My ramen, the Original Tonkotsu, was delicious. I am always a fan of their noodles, which have just the right level of chew and texture. The broth is the best in city so far for me- it is flavorful with pork and roasty, with a creamy finish (though, not as creamy as other locations). I had a sip of the Tokyo Classic Shoyu broth which was surprisingly light and packed with flavor, a great alternative for those looking for a less oily and heavy dish.<br><br>There are some things I do miss about the previous location. It's nice that we are no longer elbow to elbow and talking loudly over the room, and it has a brighter, more modern atmosphere compared to the previous feel of the restaurant, which felt more hole in the wall and grudgy with its dimmed lighting. The one thing I miss though is seeing the old Asian man stirring the gigantic pot of broth. That was a sight, and for some reason, made me feel like the broth you were getting was really legit.<br><br>We had an automatic 20% gratuity added for our party of five. Our waitress was attentive and thorough with going through the menu. For some odd reason, there was always a long line for the bathroom.<br><br>Overall, I love returning to Wasabi and its wonderful ramen. The BYOB and elements of the past atmosphere are missed.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/MdIyCaO4p9xblqMv4FGR0Q/348s.jpg", "caption": "Tokyo Spicy Wings"}]}}, {"review": {"des": "Will not be back mainly cause of the service. Went there wanting to just eat ramen cause it's what my girlfriend and I had a taste for and we were told that they were out of chicken (girlfriend and I don't eat pork) since they were out of what we were there for we decided to leave and maybe try it another time but the way the server acted especially towards my girlfriend cause we decided to leave (and I understand that there are several items on the menu that don't include pork but they were not what we were there for) the condescending tone and bad attitude ensured that we will not return.", "pics": null}}, {"review": {"des": "In my quest to find the best ramen in Chicago I had to stop by the fan favorite. Great environment for a fun night out with friends. It was pretty loud, but that added to the ambiance. I sat at a community table and was able to have a private conversation with a friend without a problem. <br><br>I ordered the original tonkotsu and was very happy with my meal. The portion felt just right and the flavor was GREAT. Was it the best ramen of my life? No. Will I go back? For sure.", "pics": null}}, {"review": {"des": "The most amazing food I've ever had!!! I do not like ramen and I'm a picky eater.... I tried their pork ramen and pork belly buns and THEY CHANGED MY LIFE!!!! It's the most amazing dish and I will continue to come back here for how fantastic their food is. I've now been here over ten times and can't wait until my next visit!", "pics": null}}, {"review": {"des": "Love, love, love this place!  I can genuinely say they have the best Ramen in the city.  Usually a long wait but so worth it.<br><br>If you come after 7:00 p.m on any night (especially one with cold weather) you will likely have to wait.  Easy street parking on Milwaukee Ave.<br><br>My favorite items on the menu are the Brussel sprouts small plate.  Perfectly pout inducing (not sure if it's lemon or vinegar, but it's delicious!).  I love the spicy, garlic ramen.  The broth is so good and its clear that the chefs/cooks use high-quality food items to get the real deal taste.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/BoXXCmHY6iT49QbJ838LXw/348s.jpg", "caption": "Spicy, garlicky, perfect broth!"}]}}, {"review": {"des": "Best ramen ever! The wait can be a long time but it's definitely worth it! The staff is also very friendly.", "pics": null}}, {"review": {"des": "We went to ramen wasabi solely to try the pork bao. We didn't know what to expect but I think baos are now on my top favorite food. From the tonkotsu ramen to the bao, the pork belly is SO flavorful and just melt in your mouth. Tonkotsu broth was also so good I ate the whole bowl, something I don't even think I've ever done. My only gripe is that the bao is 2 for $8 otherwise, this is definitely a favorite of ours.", "pics": null}}, {"review": {"des": "Oh my gosh, I think I have found my new go to restaurant! I love ramen and I've been frustrated because it seemed like all the good ramen was at least a 30 minute train ride away. <br><br>I had been meaning to come here for ages but finally the stars aligned and I came here for dinner on a Friday night with two friends. It opens at 5 and we arrived shortly after 5:30 and were immediately seated. By 6:15, the restaurant was crowded and there was a long wait to get seated. So if you get here before 6:00 you should be good. <br><br>We ordered hot sake for the table and crispy Brussels sprouts for the appetizer. The sake was good (I've never had it) but the Brussels sprouts were the star. They were so crispy and generously doused in vinegar. So much flavor! We devoured the bowl. <br><br>I ordered the Spicy Roasted Garlic Miso ramen and I was definitely happy with my choice. The pork broth was so flavorful and had just enough heat. I have a high spice tolerance so I'm always ordering the hot stuff on the menu. I wouldn't say it has an insane amount of heat. But there is some heat that just adds to the flavor for me. If you're super sensitive I probably would try this one. But if you can handle a moderate amount of heat, you should be golden. And if you're like me and douse everything in hot peppers and hot sauce, you won't find it really hot but it the heat is still nice and tasty. <br><br>The pork in the ramen was incredible - it just melts in your mouth. I'm not usually huge on pork but I was totally on board with this pork and wish there had been more in the bowl. Also the egg was amazing - like OH MY GOSH amazing. I wish they gave you the full egg because I NEEDED more.<br><br>One of my friends ordered the Vegan Ramen (she's vegetarian). We were nervous because sometimes vegan options for ramen end up being very bland. But the vegan ramen was so flavorful and perfect. I definitely would consider ordering that next time I came. With an egg on the side of course!<br><br>Overall, I definitely enjoyed my experience. The food was delicious and it was a great way to warm up on a cold winter night!", "pics": null}}, {"review": {"des": "I hadn't been to Wasabi since they expanded over a year ago, but some friends and I finally went this past Friday night. The pork belly buns were the highlight, although the original ramen and the mochi ice cream were also big hits. I was surprised that the expansion didn't seem to get them much extra space, though! We had a party of 5, and there was really only two tables in the whole restaurant for groups larger than 4, so the wait time was over an hour. There was nowhere to wait where we weren't in the staff's way, so we went down the street to pass the time at Navigator Taproom. Once we went back and were seated, the table was kind of an awkward triangle shape (seemingly to allow it to sit two separate parties at once), so we sat two on one side of the triangle and three on the other and found ourselves having to sort of yell from one side of the triangle to the other. I'd definitely go back, but I'd also definitely go with a group of 4 or fewer and not on a Friday night!", "pics": null}}]}