{"name": "ras-dashen-ethiopian-restaurant-chicago", "reviews": [{"review": {"des": "Great food, fresh and full of flavor. There is something totally addictive and yet deeply satisfying about the unique bread, called Injera, served up with savory Ethiopian cuisine. My food was delivered and the bread was so enticingly soft, tangy and the perfect texture for scooping up my spicy beef stew (swag wat) and Salata. I like to order ayib, a soft cheese, with spicy dishes and scoop it all up together for the perfect combo of heat, tang and creamy deliciousness! <br><br>Good food, inspires me to go on a complete tour of Chicago's African cuisines, starting right here in the seeming epicenter, Uptown!", "pics": null}}, {"review": {"des": "I love this place.  There are a lot of Ethiopian places around Rogers Park, and over the years I think I've been to three (Ras Dashen, Ethiopian Diamond, and Tesfa).  Honestly, I think they are all equally delicious.  It's not a cuisine you have everyday, and I hadn't ever seen so many Ethiopian restaurants before moving to Rogers Park, but it's such a great, interesting food to have and I love bringing people here because it's such a cool experience.  <br>A big plus of this restaurant compared to the other Ethiopian restaurants is that they have traditional seating.  It's basically like wicker chairs with cushions and a the table top is like a wide basket that's a little lower and smaller than a usual table.  I wish I had taken a picture, but you should google it.  It feels a little strange, but it's part of the experience.  <br>They have plenty of meat, vegetarian, and vegan options so there's something for everyone. My friend and I shared the lamb stew (which comes with a veggie side) and a veggie sampler ($14.95) (so we got 6 vegetable sides in total).  It comes on one big injera and you get extra to use to eat.  You don't get forks, spoons, or knives, but who needs them when you have a giant, savory sourdough like crepe to eat with?  <br>We asked for suggestions and I believe we got the Yebeg Wat ($24.95).  It was so delicious and I'd recommend it if you've never had Ethiopian food, because it's with Berbere (a common Ethiopian spice).  We also got Yegaysur Salata (beet salad), Qosta (spinach), Kik Alicha (yellow split peas), Diblik Atkilt (green beans, carrots, zucchini, tomatoes, and potatoes), Tikil Gomen Alicha (cooked cabbage), and Misser Wat (red lentils).  These were all so delicious.  The Misser Wat, Qosta, and Kik Alicia were my friend's favorites, but I honestly can't decide.  They're all delicious and go really well together.  <br>If you're a really picky eater, this probably isn't the place for you.  I'll definitely be coming here again, and I'd recommend it to anyone that likes trying new and delicious food.  It's so good, the service is great, and it's overall a great place to come.", "pics": null}}, {"review": {"des": "We decided to spend an evening out & celebrate our anniversary. We wanted to try something different. We are so happy we stepped out of our comfort zone. Ras Dashen was an excellent choice with several vegan selections. <br>The restaurant was warm & inviting, the staff could be described that way as well.<br>We had the vegetarian sampler & the vegan fish balls (suggested by our server). Each item had its own unique flavor profile. This meal was awesome to say the least. They also gave us a complimentary dessert to celebrate our anniversary. <br><br>Do yourself a favor and try Ras Dashen. Thank me later!!!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/1EvyS4JFkDp5b0Rei74iQw/348s.jpg", "caption": "Samosas"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/p9nCuokgzSS8BJpkgLsQGA/168s.jpg", "caption": "Vegetarian sampler"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/xyO10VQp0FEVrBmcbjAEkg/168s.jpg", "caption": "Bread pudding"}]}}, {"review": {"des": "They have exceptional Ethiopian food and their customer service is outstanding. I usually get the veggie sampler and no matter what combination I order, it's so delicious! They also serve Ethiopian beer. I also highly recommend their injera (the bread you eat the food with). It has the perfect texture and sourdough flavor (for lack of a better term).<br>I've been to Demerra, which is good, but it doesn't hold a candle to Ras Dashen. I also like the ambience. It is very cozy. It is also affordable.", "pics": null}}, {"review": {"des": "I wonder why I never checked this place out before. It's conveniently located on Broadway with really good street parking around. The food was A1 amazing. I took my parents to this place to try Ethiopian food for the very first time and they were a huge fan of the food. My dad is a difficult person to please but he enjoyed the food a lot which is impressive. They have good options for both vegetarian and not vegetarians. Their menu is much more flexible than other ethiopian places without naming names. <br>My only gripe about the place would be that the service is slow. So don't go there hungry.", "pics": null}}, {"review": {"des": "I wasn't into the cuisine, but it was a nice restaurant with a friendly staff.  You have to try different things, and...this was different.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/gpPZhPJmCp-SbyJ3iCQwFQ/348s.jpg", "caption": "I have no idea what any of this was.  All I remember is it cost a lot of money."}]}}, {"review": {"des": "Incredible food! Basically like Indian food without the spice. Came here with my fiancée, his sister, and her husband. There was more than enough food to go around. We started with the veggie sampler and the meat samosas. Every single dish was INCREDIBLE. My fiancée isn't big on vegetarian dishes and he was blown away. The food is filled with FLAVOR. We also got both chicken dishes and a mushroom dish. We didn't realize each main dish comes with another side. So we were pretty full and couldn't finish. Like I said, we probably didn't need the vegetable sampler appetizer. <br><br>I will definitely be back here.<br>This is an excellent spot when you want to try something different.", "pics": null}}, {"review": {"des": "I've had Ethiopian a few times in Chicago and DC, but never here at Ras Dashen. My date loves this place, so I was eager to try it. Our server was warm and welcoming. We chose a couple of orders of sega wat (spicy beef), and one order each of misser wat (lentils) and komodoro salata (cucumber, tomato, onion and jalapeno salad). <br><br>The injera bread was tasty, and held together nicely for scooping up the food. The sega wat was absolutely brilliant, really bringing a nice level of spice which both of us appreciated. The komodoro salata's fresh ingredients provided a nice counterpoint to the meat, and the lentils had a delicious flavor profile of their own. It was a fantastic meal.<br><br>It's not a fancy place, but the food had all the flavor you could ever want. Highly recommended.", "pics": null}}, {"review": {"des": "Having travelled to Ethiopia and living there for a few months, I'd like to think that I know what authentic Ethiopian food tastes like. Ras Dashen is the best that I have had in Chicago by far. I love the restaurant's atmosphere and cultural decor. They have wonderful service and are always helpful with suggestions. <br>I reccomend trying the veggie sampler if you are new to Ethiopian cuisine. It is very well priced and substantial to share between two people. Also, if you are a beer lover St. George is a must!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/mb3tqVvAqC0oNJxh-5xwAw/348s.jpg", "caption": "Misser wat, Diblik atkilt, Yeqaysur salata, Tikil gomen alicha, Gomen."}]}}, {"review": {"des": "My friend The Wannabe Vegan and I enjoyed a tremendous vegan dinner at Ras Daschen on a recent balmy Saturday night. Tables on the sidewalk were available, but we chose to enjoy the air conditioning indoors instead of swallowing bus fumes and enduring heat and humidity outdoors.<br><br>The staff at Ras Daschen are friendly and welcoming. The restaurant was a little smaller than I expected, but not so small as to be crowded or uncomfortable. Most of the tables are set up western-style, and some are Ethiopian-style. The Ethiopian style is two chairs flanking a traditional table that allows for easy sharing. We chose the latter, because it is easier to share the injera and dive into your entrée when you're already at close quarters.<br><br>Ras Daschen offers a modern craft cocktail list. The Wannabe and I each had a mixed drink called a Warfa, which was described as an Ethiopian-style Old Fashioned. I'm not sure exactly what that means. I can tell you that Warfa is delicious and oh so strong. We discussed having a second drink, because it tasted so good. We decided against it, though, because it was powerful. Had we been sitting at home, without needing to drive anywhere, we would have done.<br><br>Ras Daschen does offer meat dishes, but hey, who wants any of that stuff? Vegan items on the menu are marked with a bold \"V\". We ordered two entrees, a mushroom wat and the vegetarian sampler. Of course, we skipped the vegetarian items that included dairy and went straight for vegan. OMG -- SO GOOD! Had our mothers been present, they would have scolded us for eating so quickly. We just couldn't get that deliciousness in our mouths fast enough. And boy, were we full afterwards.<br><br>This was a satisfying, tasty, fulfilling and filling dining experience. The Wannabe and I would go back to Ras Daschen in a heartbeat.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/31pDRFierXxsUOV9M6bS1g/348s.jpg", "caption": "Warfa, advertised as an Ethiopian old-fashioned. Delicious and strong!"}]}}, {"review": {"des": "Good Ethiopian and authentic fun Ethiopian tables.  However, in general we found most items to be greasier or extra oily.  So we probably won't be back.", "pics": null}}, {"review": {"des": "Very tasty! <br><br>I hadn't had Ethiopian cuisine in years and I'm glad I had it again and chose to come to Ras Dashen! We had reservations for a Saturday evening and were promptly seated. The atmosphere is warm and inviting and there were parties coming in that were clearly regulars and greeting the owner etc...we chose to sit at a traditional table and although we were right by the kitchen, it didn't bother me at all during our meal and did not feel at all intrusive. <br><br>Each main course comes with a side; my husband and I also shared an appetizer and although delicious, couldn't finish all the food...so the portions are definitely large! We loved the spinach sambusas; they were perfectly seasoned and the sauce that came with them was fantastic.<br><br>We shared the Dupa Wat (pumpkin stew), Doro Alicha (chicken/sauce), Yeqaysur Salata (beet salad), Qosta (fresh spinach/garlic/spices). While we enjoyed everything, the doro alicha was a true stand-out. The spices paired so well, it was well-seasoned, but not overwhelming on the taste buds. <br><br>I enjoyed how much of the food was vegan; while I am not vegan/vegetarian, I try to not eat a lot of cow's milk products which is typically difficult to avoid when dining out. My stomach thanked me for not subjecting it to any cow's milk products the entire evening!<br><br>Looking forward to returning and trying more entrees/sides!", "pics": null}}, {"review": {"des": "Lovely Ethiopian decor and artwork on the walls, choice of a traditional table or normal table, and yummy Ethiopian food. My favorite (and probably my favorite Ethiopian dish) was the Doro Wat, topped with a berbere sauce with a kick. The lentil sambusas and accompanying sauce were also nice (think thin Indian samosas). Finally, I have to mention the lemony injera bread that I love so much. Have to dock a star because the service was slower than I'd like.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/TGrAWaOIhrVQRcrIRlqpEQ/348s.jpg", "caption": "Gomen, Doro Wat, Misser Wat, Asa Tibs (clockwise from top)"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/W2BLyYLRqJYLLhoI7yqtqg/168s.jpg", "caption": "Lentil sambusa"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/OzK7FdfGcibDEfPOg9i73A/168s.jpg", "caption": "Traditional table"}]}}, {"review": {"des": "Food was amazing, if your a foodie like me who embraces different cultures, flavors, spices and trying new things. We ordered a combination of 5 appetizers, all vegetarian, spinach, cucumber romaine salad, chick peas, then 2 meat main courses a mild chicken, and a spicy lamb dish. Everything was served on a big platter, to share with guests, you grab the pancake type bread, and scoop up the food with your hands. No utensils, so wash them well and dig in! Bon appetit! Great service, cool hipster vibe. Loved it!", "pics": null}}, {"review": {"des": "I love Ethiopian food so when I heard about this place, I was excited to try. The only other place I've been for Ethiopian food in the city is Demera. Ras Dashen is definitely pricier than Demera. If you're looking to try many different options on the injera bread, I'd suggest elsewhere as the entrees only come with one meat/seafood/or veggies (not like other places where you get to choose a couple options as part of an entree).<br><br>As others have mentioned, 1-2 entrees and some appetizers is PLENTY of food for 2-3 people. We got the veggie sampler so we could try a bunch of foods. Our favorite was the yellow split pea option!<br><br>For apps, we had chickpea sambusas, which came with a tasty sauce. We also had the yellow beet salad, which I loved! Very sweet with the accompanying fruit. Comes with avocado which weirdly worked with the dish.<br><br>I'll say the downfall of this place was the service, which was PAINFULLY slow. And they were not accommodating with making substitutes. Nonetheless, the food was delicious and dining here was a fun culinary experience.", "pics": null}}, {"review": {"des": "Chicago is a very lucky city when it comes to Ethiopian food.  Just drive down Broadway and you'll run into 3 great options in less then 10 minutes.<br><br>But for me Ras Dashen takes the cake.  My partner and I have been here over 40 times and it feels like home.  The real difference for me is that the food is cooked to perfection and not overly spiced.  A few nearby Ethiopian places have lost a sense of the quality since becoming popular but Das Dashen has stayed consistent delicious.  The owner's wife and the old lady behind the recipes are delightful people and make you feel truly at home.", "pics": null}}, {"review": {"des": "Very nice atmosphere. The food was good and the family loved it! I definitely recommend y pu give this place a try.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/JLJcdZAEKZrqYxYm2ZseeQ/348s.jpg", "caption": "Everything is delicious!!!!!! A definite must try! Friendly staff, nice atmosphere."}]}}, {"review": {"des": "Yes, I'm a fan.  Ras Dashen was my initial experience with Ethiopian food and how it's eaten, so I have a soft spot in my heart.  However, that said, and having experienced almost every other Ethiopian restaurant in the City, it remains my very favorite.  The vegetables are prepared and spiced perfectly, the fish (either method) is absolutely melt-in-your-mouth fabulous, the lamb tender as can be and so very tasty!  The injera at Ras Dashen still tastes best to me, sweet and just the right consistency for injera.  You won't be disappointed.  I'm so grateful for the introduction to this place my dear friend made years ago.  I'm definitely \"a fan.\"", "pics": null}}, {"review": {"des": "I liked the ethopian concept but the food was sour for me. I usually dn't like tangy taste and every other dish which was served was sour and tangy. Maybe its the culture and the preparation.  Many may like or may not like.  But the presentation was really nice. Ordering food was little confusing but was fun.", "pics": null}}, {"review": {"des": "Absolutely always amazing! The staff is always friendly and quick. The food is always so wonderful. It's worth the 90 minute drive in to the city. Even when it's crazy busy, it's always a chill environment. Do yourself a favor and order everything on the menu at least once. You will not be disappointed by all of the wonderful spices and flavors and how well all of the dishes go with each other. Just grab a piece of the injera and pick up a little bit of at least two of the foods at a time and experiment. My favorite is mixing the doro wat and any of the lentils.", "pics": null}}, {"review": {"des": "As a gluten-free vegetarian, I had a lot of options at Ras Dashen.<br><br>Upon entering, we were given a choice to sit at a normal table, or a traditional table.  They also hand washing station in the main dining room as eating with your hands is traditional.<br><br>Here are the gluten-free vegetarian items I had:<br>Dupa Wat entrée (pumpkin stew) - OUTSTANDING 5/5<br>Diblik Atkilt side dish (potatoes, green beans) - Excellent, reminded me of good Indian curry 4.5/5<br>Shimbera Asa Wat entrée (mini chickpea dumplings) - Excellent, flavorful 4/5<br>Kik Alicha side dish (yellow split peas) Very similar to Indian yellow dal dishes 3.5/5<br>Gomen side dish (kale) - flavorful but served lukewarm, I wouldn't order again 3/5<br>Gluten-free injera bread ($3 upcharge each) - good, I appreciate they offer this, but we were too full to finish it... next time I would order one instead of two 4/5<br><br>Summary:  Delicious well-seasoned food, nice atmosphere, and helpful/attentive staff.", "pics": null}}, {"review": {"des": "I love this place.  This restaurant is part of my Ethiopian restaurant circuit.  I alternate between this restaurant and other Ethiopian restaurants in Chicago.  The vegetarian sampler platter is the way to go.  You can choose a wide variety of dishes.  There is a full bar in the back as well, which serves up some very delicious and traditional honey wine as well as Ethiopian coffee (very strong stuff).  Their kik alicha is awesome.  Misser wat and Tibs are great.  They can be spicy sometimes.  The injera is good and plentiful and the service is good.  Caution - this place can fill up really quickly.  Friday and Saturday nights are especially busy.  Carryout and delivery is available; however, Ethiopian food is best enjoyed with friends and family in a restaurant environment.", "pics": null}}, {"review": {"des": "I was so excited after reading others' reviews, but I have to say my experience was way less than magical. Service was painfully slow, we had to remind our waiter twice that we were still waiting on just drinks...and more of the same for the remainder of our evening.<br>After sampling the veg platter, everything was lacking in seasoning, spice, and was very disappointing.<br>It was also a very cold night, and we had to keep our winter coats on during the entire meal because it was so freezing cold inside the restaurant!<br>So sad...I was craving a hot and spicy Ethiopian dinner to warm me up on a chilly January night, but I left colder than I was when I arrived.won't be back", "pics": null}}, {"review": {"des": "Soo, I went a little Groupon-crazy, and as a result, my friend Debra B. and I dined at Ras Dashen twice.  Heh.<br><br>FYI, if you get a Groupon, you are limited on your entrée choices.  The dinners include two entrées and three sides.  <br><br>On our first visit, we had the meat entrée:   <br><br>Meat (chicken/beef):<br>#18: Doro Wat (chicken)<br>#30: Zilzil Alicha (beef)<br><br>Sides:<br>#3: Yeqaysur Salata<br>#7: Qosta<br>#8: Dublin Atkilt<br><br>The meat was by far my favorite, with the beef really being the highlight.  It had some heat at first, but we quickly got used to it. The chicken entree was tasty, but difficult to eat since it had bones in it.  Soft injera bread + fingers + trying not to be a savage and dig with your fingers/finger nails?  Meh.  <br><br>The sides were good, but the beets (#3) were my least favorite.<br><br>Service on our first visit was attentive but unobtrusive.  Our waters were refilled.  I also ordered a ginger ale, and Debra had a ginger beer...which was of the Jamaican variety.<br><br>On our second visit, we had the veggie dinner:<br><br>Veggie:<br>- Dupa Wat (pumpkin)<br>#15: Misserana Bowmia (okra and lentils)<br><br>Sides:<br>#2: Ethiopian Salata<br>#11: Kik Alicha<br>#12: Yequay Tiki gomen<br><br>While I'm a veggie fan, it was much less filling in the end. Both entrées were good, with the pumpkin being my fave. The pea and lentil sides were good, though the salad (#2) was very much like an American salad (with jalapeños).  It was also difficult to eat, interestingly enough. I would skip it.<br><br>I had a hot tea this time around, and Debra had the ginger ale! <br><br>Service the second time around was pretty absent, which is odd because we were the ONLY ONES dining in!  The server never came to check on us or ask how our meal was.  He only came by to deliver the check! My friend's water glass went totally empty, and then she had to ask for her water to be refilled. <br><br>Overall, the food is good and totally worth a try if you've never had Ethopian and are willing to try (or have had it and enjoy it!).  The decor is interesting, beautiful, and colorful.  You can sit at a traditional table (like we did!).  The restrooms are also clean - AND they have the paper seat covers. :)  Little details can be icing on the cake.<br><br>I would absolutely go back -- for a meat dinner!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/-ZeLLVSdvlvTq1wummW6tQ/348s.jpg", "caption": "Veggie entrée.   Clockwise: #15/Misserana, Dupa Wat, #11, #2, #12"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/j5Z6VnlSVzE3T_7NQ4xnFw/168s.jpg", "caption": "Decór"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/hY2MvuLFgTzRIv_5FgP5Tw/168s.jpg", "caption": "Traditional table/seating and artwork"}]}}, {"review": {"des": "Most unwelcoming restaurant EVER. I decided to try this restaurant since my usual Ethiopian restaurant no longer exists. I was joined by three friends and was excited to introduce them to this cuisine. The food was good though I wasn't a fan of the (a bit too sour) injera. <br><br>A restaurant can make up for shortcomings by providing either superior service, outstanding food or cheap prices. This restaurant failed on all fronts and left my guests vowing that this will be their first and last Ethiopian experience.", "pics": null}}, {"review": {"des": "This is our go to place for Ethiopian. Hands down best Ethiopian food in Chicago. Their chicken entree (doro wat) is delicious with a kick of spice. I have also tried their lamb entree and it didn't disappoint. All of their sides are great except one of the cheese sides which was a little on the mushy side. I had never tried Ethiopian food before moving to Chicago and all I can say is that I am addicted!", "pics": null}}, {"review": {"des": "Always my go to for Ethipoian cuisine. Call ahead for teff injera (gluten free) and make sure to sit at a traditional table ! The staff is very friendly and the food is always delicious!", "pics": null}}, {"review": {"des": "The wife and I have been here a million times with a hiatus.  So it had been a couple of years and we decided to take a client here for dinner.  She loved it and we had a good meal.  The service was flawless.<br><br>We ordered four entrees and I don't know the names of each.  Basically it was mushroom, lamb, lentils and chick peas.  All were good.  We had 2 gluten intolerant people so called ahead to request gluten free injera.  We were somewhat apprehensive because we have tried gluten free injera from other restaurants and have not loved it. This injera is so good that I liked it and would happily eat it in place of the Americanized injera. <br><br>The one lame thing that occurred is that I wasn't permitted to use the Yelp 10% off coupon on a weekend. I did not see a disclaimer on the coupon, which is a cheap move, but we will be back to use the coupon during the week.", "pics": null}}, {"review": {"des": "First time eating Ethiopian and I loved it! Ordered a lamb dish plus the vegetarian platter so we had 6 sides total. The spongy sour bread to use as your utensil is super delicious. <br><br>The ladies that served us were very open to telling us about what's popular and guided us through the menu. Tusker beer was very yummy, so much that we drank 3!<br><br>The portions looks small but you get full quickly with the spongy bread. Left overs for tomorrow!will definitely return", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/r3lhwe4yorZksiN1NzRdjA/348s.jpg", "caption": "The Tusker beer was the better of the two"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/lBDmUr630vY7shLmNU6DAg/168s.jpg", "caption": "Lentil variety"}]}}, {"review": {"des": "Ras Dashen is some delicious Ethiopian food! It's much bigger than you'd think from the outside with a back room full of more tables. The night we went they were even having a concert with an Ethiopian superstar that evening. With Ras Dashen being so big, it got super busy as the night went on. With that our service started dragging. Overall, service was very friendly but I think they became overwhelmed when no one checked on us for about an hour and they mixed our check up with another tables.<br><br>Despite any service kinks, the food was really quite tasty. They were out of honey wine though! That was a sad moment for me because I feel like I need some of that strong stuff when dining Ethiopian! You really can't go wrong with anything you order food-wise. When I went we ordered a variety of veggies items and then a main entree. <br><br>What happens at an Ethiopian restaurant is you get a big piece of injera which serves as a 'plate' for all your side dishes. Every side you pick is served around the injera with your main entree plopped down in the middle! Some items are spicy but are noted when they will be. Your also served a bowl of injera to use as your fork. There is no silverware at Ethiopian spots so wash your hands and dig in!!<br><br>Overall Ras Dashen is a good option for healthy meat and veggie dishes! I have a feeling if you didn't know quite how to navigate Ethiopian food, the lovely staff here would help you out!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/V2DqKO7lH5UmfjwjUkc4-Q/348s.jpg", "caption": "Delicious cheese, spinach, chick peas and veggie mix"}]}}, {"review": {"des": "My boyfriend and I came here on a Saturday afternoon so I could have my first Ethiopian cuisine adventure. We ordered the Grilled Lamb Chops and the Lebleb Tibs with Qosta and Diblik Atkilt as our sides. We loved the lamb chops, they were cooked perfectly and were juicy and flavourful. The beef for us was just okay in comparison. I really enjoyed the sides as well, they were a great accompaniment to our meats. The portions are pretty big. We had more than enough food for the both of us to be full with leftovers. If we are ever in the area again I hope that we can come here and try some other dishes.", "pics": null}}, {"review": {"des": "We went on a Saturday rainy night with my kid and the service was terrible. It took over over a hour to remind our server about getting our drinks and over 2 hours to get all our orders in our plate. We couldn't find our server around for the most part in the restaurant as he was busy helping in the kitchen and the other two waitresses didn't bother to come around our table to assist. We try making it to this place every time we are in Chicago and this by far has been the worst experience ever. I was very disappointed and would seriously reconsider going back.", "pics": null}}, {"review": {"des": "I've been wanting to try Ethiopian food for the longest time! Finally had a chance, and decided to try this one out. For those that are uninitiated, my disclaimer is that you shouldn't look at me to initiate you, as I never had Ethiopian food before. <br><br>From my initial experience, this is what I noticed. You eat with your hands, hence there is a nice and useful sign near the back that says \"Washing Station\", for those peeps who likes to handle their food with germ-free hands, as there is no silverware involved.<br><br>And, as a person who is familiar with Indian food (NOT that I am saying it justifies comparison, so put away your pitchforks and flaming bags of poo..... for now) there are some similarities -- instead of naan, Ethiopian food involves a, as one of my friends called it, a sham-wow looking carb, called Injera. The dishes are generally pureed and sauteed (sure, there are exceptions), and with some sauce involved; perfect to soak and pick up with the Injera. <br><br>We got the following:<br>7) Qosta -- some pureed/sauteed spinach with Ethiopian spices<br>8) Diblik Atkilt -- Green beans, potatoes, zucchini, and carrots, and mixed up and delicious!<br>9) Ayib -- cheese<br>11) Kik Alicha -- pureed split peas<br>19) Doro Alica -- chicken with a boiled egg, in a pretty tasty sauce<br><br>All of the above were delicious!! My only \"gripe\" is that it's hard to eat all that withOUT Injera, so if you're carb-conscious, you might need to figure out a crafty way of eating said dishes. But overall, VERY tasty and the staff was super nice and friendly.<br><br>BATHROOM REVIEW: As mentioned, they have a separate, stand-alone, out in the public, faucet with soap and paper towels so you can wash your hands, before, during, or after the deal (finger-licking good!). They also have a bathroom for all your urination needs. Inside, there is a stall and urinal, which were super clean. I was very impressed. It was very modern as well. Sit or squat? Sit!!! But definitely wash your hands after ;-)", "pics": null}}, {"review": {"des": "The food and service here is phenomenal. This is my favorite Ethiopian restaurant in Chicago. <br><br>You can choose from more traditional seating to a standard table for service. The waiter and bartenders are always courteous and anticipate your needs. The fig old fashioned is a unique spin on a classic cocktail; I highly recommend it!<br><br>The food is served family-style on delicious tangy, spongy bread with extra on the side and at your request. I could live off the vegetarian options here alone but usually we order the vegetarian sampler to get 5 different sides and then one meat entree which comes with 1 more side. Everything is so flavorful and plentiful but my favorites are<br><br>-ANY of the meats marinated in the bebere sauce<br><br>-Kik Alicha; pureed yellow split peas cooked with onions, garlic, ginger and green peppers<br><br>-Yeqaysur Salat; beet salad served chilled, topped with a tangy dressing<br><br>-Tikil Gomen Alich; mildly spiced cabbage, potato and carrot stew<br><br>They offer an assortment of traditional and modern coffee drinks as well as desserts; we were stuffed but look forward to trying the coconut cream brulee next visit!<br><br>Great spot for a date or just a memorable meal.", "pics": null}}, {"review": {"des": "Ras Dashen was the restaurant that introduced me and my regular dining group of friends to the wonders of Ethiopian food, and for this I'll always be grateful to the folks who run this place!<br><br>An ever-expanding list of things I love about this place:<br>- you have the option of sitting at both tables or mesobs (sp?) (wicker chairs and stools). The former is better if you're in a group but the latter makes for a more intimate experience because you have to lean into the food<br>- you get to eat with your hands! I'm Indian, and I've grown up eating with my hands almost exclusively. I find cutlery cumbersome and so I especially love cuisines that forgo it.<br>- for fellow spice-lovers, this place BRINGS it. Order anything with the berbere sauce, and you'll be blessed with gentle drops of spice sweat<br>- the prices! you get to try out multiple dishes and starters for under $25<br>- the Ethiopian tea here is the best I've had at an Ethiopian restaurant. Just don't drink it while you're eating because the hot tea does not play well off of the spicy food.<br><br>My go-to dishes here are the asa-wat (tilapia in the AMAZEBALLS berbere sauce) and doro-wat (spicy chicken stew with boiled eggs) and the shiro-wat (ts chickpea counterpart). All of the side dishes are commendable, especially the gomen and mesir wat (spicy pureed lentils). The sambusa (especially the spinach filled ones) are a must try!<br><br>The service is just about okay. They're not very chatty but offer good recommendations, and service can be a bit slow because the place is often packed and the food takes time to be ready.<br><br>What I love most about this place is that Ethiopian food is very inclusive. There are options galore for my vegan and vegetarian friends, and for people like me who don't eat pork or beef due to personal preferences.<br><br>One last thing; INJERA IS LIFE!", "pics": null}}, {"review": {"des": "Love Ethiopian food!! It is a celiac friendly restaurant. All entrees are gluten free, without any cross contamination. Their bread known as injera can be made gluten free on a separate griddle. They confidently host a lot of celiacs. Being a celiac I have eaten several times there and have also tested food with my Nima sensor. I've always received a smile and never got sick. And the food is just super delicious. I'll come here everyday if I could.", "pics": null}}, {"review": {"des": "I wanted to avoid the dinner crowd so I went on a Monday  at 4:15. Good idea. The interior is warm, inviting, and sparkling clean. The waiter was very pleasant and accommodating. I got the vegetarian plate with the spinach (yum) the spicy lentils (one of my favorites) the cabbage and potatoes, the string bean stew(fresh and nice and al dente) and their cheese. I also ordered the spinach sambusa. The filo dough is paper thin and stuffed to the gills with spinach that is seasoned differently than the spinach on my entree. My only complaint is that the sambusa came in the middle of my meal instead of before. I was starving and there was plenty left over for lunch tomorrow. There were some foreign tourists there who were thrilled and taking pictures. The food is fresh, the combination of spices absolute perfection and they are very baby and family friendly. Evidently gentle Spirits love the injera. They are not alone. Great menu-- great food--GO!!", "pics": null}}, {"review": {"des": "Chicago has great food and I've had a lot of it but this might be my favorite restaurant of all time. It is consistently amazing and authentic. Ive been coming for over 10 years and every time I'm just as satisfied as I was the first time. I also recently went vegan and they have SO many vegan options which is great. If you haven't already step out of your comfort zone and try some ethiopian food!!!", "pics": null}}, {"review": {"des": "It had been awhile since I've had Ethiopian food, so decided to try Ras Dashen last night. Located on a main street, with pay parking spots directly outside, complete with Zagat stickers (which always makes me smile a little) on the door, we walked in and were given the option of a regular table, or to eat traditionally Ethiopian style, from a communal bowl.  Colorfully decorated seats and inviting. (homey) My friend decided on the vegetarian sampler.  I ordered the yebeg alicha (lamb stew).  I tried the honey wine to start, but in my opinion I think maybe it perhaps it would have been a better dessert wine option.<br><br>Dishes are served on a platter laid with a giant round of injera.  Injera resembles a large spongy pancake (made of teff flour and a sourdough starter, which results in a slightly tangy taste and production of air pockets ).  Injera is used in place of utensils, in which you envelope the food with your hands.  (There is a wash station in the back to clean your filthy paws before and after). <br><br>\"Ib\" is a soft cheese made from buttermilk.  Tasty and mild, and I actually enjoyed it more as an accompaniment with both my lamb dish and the spinach \"qosta\".  Of course, I'm the kind of person that puts cheese on my cheese. \"Misser wat\" is a puree of red lentils in a berbere sauce (chili peppers, garlic, ginger, basil spice).  It was delicious, and gone rather quickly. \"Yeqay tikil gomen\" is a sweet and sour red cabbage. My main dish was the \"Yebeg Alicha\".  It is a lamb stew compiled inside another piece of the injera and quite flavorful and soft including two of the bones, and many chunks of the lamb.  The pieces off the bone were tender from being cooked in the alicha sauce (turmeric flavor).  <br><br>We left feeling full, but not overly \"unbutton your pants\" full, and I think we ordered just enough.  I would certainly come back.  The service was also good, greeted on the way in and thanked on the way out.  Attentive staff.", "pics": null}}, {"review": {"des": "Ras Dashen is my favorite Ethiopian restaurant in the US, and I've tried Ethiopian in a few different cities now. I'm a huge fan of everything Ras Dashen prepares in their berbere sauce, but you can't go wrong with any food on their menu. Their lamb dishes are fantastic and their beet salad appetizer is a really nice surprise. Ras Dashen is family run and they really make you feel at home here. I treat my family to Ras Dashen several times a year and we love it every time.", "pics": null}}, {"review": {"des": "Yummy vegetarian options. Their Tikil Gomen Alicha is so good. I order two, and will probably get three, next time I get the vegetarian platter.", "pics": null}}, {"review": {"des": "This was my first time eating Ethiopian. You walk in and can sit at a \"traditional\" or \"regular\" table. I'd suggest traditional because everything not this place is authentic. Music. Staff. Atmosphere. <br>Food is quite amazing and though the portions look small you are leaving feeling full due to the bread you're given to eat your food with. <br>Dishes are all spicy but not as spicy as the spicy dishes, so keep asking for water, even the though the tea is lovely. Share portions with a friend or a few even if they love or hate meat, dairy, or veggies!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/onuVMAWSCE7unNFD7h5bPg/348s.jpg", "caption": "Veggie platter"}]}}, {"review": {"des": "Best Ethiopian food I've had hands down. Absolutely amazing dishes , tasty, very friendly and accommodating, even with our little baby. Will definitely be planning a trip back from the burbs soon to scratch my next Ethiopian itch.", "pics": null}}, {"review": {"des": "We had a fully vegetarian meal, delicious drinks and dessert! Overall an awesome place and am excited to know it's so close by! Also the service was awesome! :)", "pics": null}}, {"review": {"des": "The male server with glasses was amazing! So attentive and kind, and knew when to come and go. I came with a friend here at noon on a Saturday and we were one of three tables there. They have a small outdoor seating area that is quite nice for summertime weather. We used up our Groupon, which was a beef and chicken combo platter with three vegetable sides. You can choose either a spicy or non spicy chicken, and a spicy or non spicy beef and any three of the vegetable options. We love spicy so we had the spicy chicken (doro wat) and the spicy berbere sauce beef option. For our veggie sides, we had the beet salad, mixed potato/green bean/zucchini, and the split red lentils in spicy sauce. Everything was absolutely amazing and the spice levels were actually authentically spicy, not toned down to an American palate, which is always a nice surprise! The portions were huge and the bill was $3.50 after the Groupon (because of tax). Please tip your servers on the full (non-Groupon) price! Will definitely return.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/EZOm-raKh2Z2HHLjP0aXjQ/348s.jpg", "caption": "Chicken and beef combo (Groupon), both spicy options, with spicy red lentils, beet salad, and mixed carrots/green beans/potatoes!"}]}}, {"review": {"des": "Ras Dashen has been our favorite restaurant in Chicago for many years.  The food is all outstanding.  The family that runs it is so kind and friendly.   We go there often for an early kid-friendly family meal or later in the evening for a date night.  We love this place so much and feel so lucky to live close by!", "pics": null}}, {"review": {"des": "Second time here, won't be the last. Love it. Brought friend here who also just gave this place a great review. You gotta like ethnic and not be fussy about being messy.", "pics": null}}, {"review": {"des": "In terms of pure flavor, this restaurant is one of my favorite Ethiopian restaurants in Chicago. However, in terms of value, it is one of my least. The items are ludicrously overpriced for what you are getting. <br>For example, the Doro Watt, for $17, includes a small side, and 2, yes, just 2 medium sized chicken wings and some sauce. That's it. Not acceptable in my book. But if you are willing to accept the high cost, it is worth checking out.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ZFA8OMsQf9l0DV31CjGtgQ/348s.jpg", "caption": "The value for the money is not there, two dark meat chicken wings and some sauce (aka doro tibs): $17"}]}}, {"review": {"des": "We had a really delicious meal here, and the service was attentive and friendly.  They have a good selections and of both meat and meatless options too, which is nice.", "pics": null}}, {"review": {"des": "Best Ethiopian restaurant in the US! Incredible food, warm hospitable service. A MUST when in Chicago. We've eaten at other Ethiopian restaurants across the country and although always good, we always say- they're no Ras Dashen! Thanks for being continually the best.", "pics": null}}, {"review": {"des": "This is my favorite place for Ethiopian food, they really do a great job here.<br><br>-Has a good selection with flexibility in putting your entree choices together.<br>-Has a good amount of space inside with traditional seating as well.<br>-Veggie dishes are on point.<br>-The spicy chicken wot is the main reason for them being my favorite, it's the best and has such amazing flavor.<br>-Beef and lamb follow the same flavorful trend too.<br><br>For rookies or experienced, this is a great stop for Ethiopian food.", "pics": null}}, {"review": {"des": "If you haven't tried Ethiopian cuisine yet, then Ras dashen is the perfect place for your first time. If you're already a fan, then here's your new favorite place to get it. Your taste buds will never get bored. Get your hands ready to dig into the vegetarian platter piled high with lentils, greens, cabbage and fluffy injera bread, wash down all that flavor goodness with their spectacular house made honey wine (Tej). Cozy, intimate, warm, and relaxing ambiance. Anyone wanting to have the \"full experience\", the little rattan tables are a very nice touch.", "pics": null}}, {"review": {"des": "Best Ethiopian food I've had. Literally everything on their menu is amazing and their service is impeccable. Great prices as well", "pics": null}}, {"review": {"des": "this used to be a good place, until recently. They  started charging for things that were not mentioned as chargeable on the menu . When I asked the owner , she started shouting at me ! I am not going back here , especially if the owner does not respect anyone !", "pics": null}}, {"review": {"des": "I have been to other Ethiopian restaurants on Broadway and I think their options are better. The food was very good and we enjoyed having the Injera again. Will come back but give more options for fish platter.", "pics": null}}, {"review": {"des": "This is THE best Ethiopian food in the city. Period. No exaggeration. Demera who?<br><br>I have been coming to Ras Dashen for 10 years, and it has not failed me  once. It is the first place that pops into my head when people ask, \"Do you know a good Ethiopian...?\"<br><br>\"RAS DASHEN! And, if it's not a date, please let me come with you!\"<br><br>The second you walk through the door, the warm aroma of berbere enwraps you and makes you feel at home. Come hungry, but have patience. Greatness takes some time to prepare.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/aFqDmS9UoKuCV0Ks5ZN2Jg/348s.jpg", "caption": "This is what your plate will look like, every time."}]}}, {"review": {"des": "This was the first time any of us had Ethiopian. Honestly, everything we tried was great. My only advice would be try anything, but be wary of spice level. Be prepared to use your hands! Don't be afraid to order \"too much\" because you'll want to try it all, especially if it's a larger group.", "pics": null}}, {"review": {"des": "I decided to go here because there was a groupon and I have always been curious about Ethiopian food. It didn't take long for us to be seated but it took awhile for us to get our glass of water filled and for them to take our order.<br><br>We got one spicy chicken dish, a spicy beef dish, cabbage, salad, and cheese. The food is served on a large spongy flatbread. You get a basket of the flatbread and you eat the food by pinching it into the flatbread.<br><br>It was interesting because I have never done that in a restaurant before. It was fun. The food was a little too salt for my taste and I started getting tired of the flatbread so I jut asked for a spoon to shove the food in my mouth.<br><br>We ten decided to get Ethio bread pudding. We figured that we will probably not have another chance to go to an Ethiopian restaurant so we might as well. The bread pudding was really good, served a la mode. It is definitely worth trying.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/PFutp3rzQFDH1LNzzi-tFw/348s.jpg", "caption": "Ethio bread pudding"}]}}, {"review": {"des": "Chicago has a nice selection of Ethiopian restaurants. Ras Dashen is one of them that warrants return visits. Because a fellow colleague wanted to sample some Ethiopian food for the first time, this was the restaurant I recommended and a mutual friend accommodated us.<br><br>We ordered one chicken, one lamb, one seafood, and a round of vegetarian menu items. The chicken was doro wat, which was dark meat chicken and boiled egg in a spicy berbere sauce. The lamb dish was yebeg de berbere, succulent lamb stew bursting with bold spices. The seafood dish was asa wat, fillet tilapia in a dark berbere sauce that had been prepared from roasted, ground flaxseed. As to the vegetarian offerings, we had telba shimbera misser wat -- puréed chickpeas, split peas, and flaxseed in a dark berbere sauce. There was kik alicha, which were puréed yellow split peas cooked with onions, garlic, ginger, and green peppers. We even had tikil gomen alicha -- spiced cabbage, potato, and carrot stew. And a final vegetarian item we ordered was ethio salata, which came as romaine lettuce, green onions, cucumbers, tomatoes, and jalapeños. There wasn't one item that we did not enjoy thoroughly, evident from the empty platter when we were done.<br><br>I'm not a stickler for the interior, as long as it's clean, or the washroom since that's never my purpose for going. What I will say is that the service was fantastic and the meal was addictive.", "pics": null}}, {"review": {"des": "Nice ambiance, delicious food, friendly servers. There was also live music was I was there (on a Saturday night). Highly recommended.", "pics": null}}, {"review": {"des": "I can't praise this place enough. Best Ethiopian I've ever had in Chicago (or ever had, period). I've tried many of the best-loved places in the city, like Ethiopian Diamond and Demera, but this place truly takes the cake.<br><br>The food is fantastic, with a massive vegetarian menu (great for us vegetarians/vegans!), friendly staff, good service, and prices extremely reasonable. <br><br>My personal faves: the pumpkin stew and spicy chickpea-\"fish\" stew on the specialties menu, red lentils (of course), collard greens, beet salad, and especially the red cabbage stew. <br><br>It looks like an unassuming, entirely ordinary restaurant. But don't be fooled.", "pics": null}}, {"review": {"des": "Fantastic all around customer experience here. The wait staff has always been incredibly helpful and friendly. The food is also amazing. For meat, I prefer the fish and chicken (!!!). For veg, the mushroom is my favorite. Each entree also comes with a side, which are all great. Can't recommend this place enough!", "pics": null}}, {"review": {"des": "Best Ethiopian in the city in my opinion. Food is so high quality - if you are not eating meat you are in luck as the veggie options are incredible. All of the Wats are incredible, and of course the Injera is fresh every time. Make sure to start with sambusa and try and talk to the owner - she is so kind and has a wonderful story. Great for large groups just make sure to make a reservation. Give your business here you wont be disappointed", "pics": null}}, {"review": {"des": "Rad Dashen is hands down the best Ethiopian restaurant in the Chicago area. They have great service and amazing food. We have been here many times before, but never during the week. The place is crowded on the weekends, but during the week the atmosphere was much more relaxed. We got Doro wot, Asa wot, Okra, and for our sides we got the cabbage and misir wot. Everything was excellent. The chicken just fell of the bones. Would definitely recommend the place!", "pics": null}}, {"review": {"des": "Oh how mighty have fallen.  Formerly good, though not the best, Ras Dashen is now the worst.  I can cook better than this, but probably anyone could.  Tasteless, greasy, and a sloppy texture.  What the hell happened guys?  <br><br>And fyi they have highchairs but no changing tables.<br><br>Go to Ethiopian Diamond or Demera instead.  Much better food there.", "pics": null}}, {"review": {"des": "My friend got a Groupon for meat and one for veggie entrees, and we decided to try the different choices on a girls night or day out. She drove from the western burbs to get me from a near west burn and off we went. The first experience was much better. We used the meat Groupin first. We sat at a heritage rather than American table. That was fun. I got ginger beer and we ordered. Got the chicken Wat and beef as the major entrees and beet salad, potato/peas, and spinach as the three sides. All were really tasty. Nothing was too hot or too bland. The server was really attentive. Second time was today for the vegetarian entrees. We arrived after one. One other table was there. They finished and left while we were there so we were the only table. Service was not great. After he took out order and delivered it, we didn't see him again until we were ready to leave. I had nothing left to drink and considered pouring my own water. When I had originally ordered I had said that I would like tea after I finished my ginger ale. Never got it because he never checked on us. The food was not as tast, but the best entree was the pumpkin and the best side was the red cabbage. The test was nearly bland. The salad we had was small for two. If I go back, it will be at night and for meat. Those entrees were worth the traffic.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/LtTJN54u12xbr3TWE6g7hA/348s.jpg", "caption": "And afterwards."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/AfT4bTao8ZtmpNezCBqfGg/168s.jpg", "caption": "Meat selection: before we dug in."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/zF4vYVXN0sYt_2IAMnGdZg/168s.jpg", "caption": "After: vegetarian"}]}}, {"review": {"des": "This is hands-down my favorite restaurant in Chicago!<br><br>The food is unbelievably good and many dishes are vegan. I usually get the vegetarian sampler because it's hard to choose just one option for an entree, and I have never been let down. The maraq soup is DELICIOUS, as are the lentil, chickpea, and spinach sambusas.<br><br>The atmosphere is lovely and the service is exceptional! A must-visit every time I come to Chicago.", "pics": null}}, {"review": {"des": "Great food. Never had Ethiopian but it's similar to middle eastern with the exception of how it's served. That was cool. The waitress was very nice as well. Definitely will go back.", "pics": null}}, {"review": {"des": "Ras Dashen is my family's go to Ethiopian Restaurant in Chicago. The first thing I have to note is the consistency of this food. They've always got the same chef in the kitchen so you know exactly what you're getting. The owners are the nicest people you'll meet and they're always warm and welcoming. I do miss the live music on the weekends but the atmosphere and music choice (traditional and Ethio jazz) is truly an experience. There is nothing on the menu that I do not recommend.", "pics": null}}, {"review": {"des": "I live in Berkeley so we have lots of great Ethiopian options close to home. This place could certainly hold itms own there although it's not quite as good (to my palate at least) as Cafe Colluci in Berkeley.<br><br>A friend we were visiting suggested this place for a NYE dinner. I went with her, my wife, and my infant son. Overall we were all very pleased with the vegetarian options...had not tried ib (it's like paneer or cottage cheese) so i enjoyed that. The fish tibs were great too, juicy and flaky white fish with just perfect seasoning.  He rest of the options (cabbage, lentils, beets, etc) were nicely done and tasted great with the injera bread.<br><br>A nice place to experience the flavors of Ethiopia.", "pics": null}}, {"review": {"des": "Best Ethiopian food I've had in Chicago!<br><br>A group of friends and I were looking for a place to eat on Valentine's day. We were in the mood for Ethopian food and got a few suggestions to check this place out. Glad we did! It was a miserable -25 with windchill so we really appreciated how close this place was from the Thorndale stop on the Red Line. Literally less than 2 minutes. <br><br>When we walked in, the place was packed. We were worried we wouldn't be able to get a table because of how busy it was and how crazy we were trying to find anywhere to eat on Valentine's night without reservations. The staff was very accommodating and we sat at a traditional table which I thought was really cool. <br><br>Our group had a few vegetarians so we mostly ordered vegetarian-friendly (which luckily with Ethiopian food is a lot of the menu) dishes and one beef dish. Our waitress was also incredibly helpful in suggesting items. When the food came, it was all AMAZING and the portions were huge. I thought this place was a great value for the amount of food we got. With amazing staff and amazing food, I would definitely eat here again!", "pics": null}}, {"review": {"des": "One of the better, more authentic Ethiopian places in Chicago. <br><br>The staff is great and the owner is the sweetest. One of my faves.", "pics": null}}, {"review": {"des": "Wow!  This food is amazing and the restaurant is very cozy and family friendly.  The staff is great.  Good selection of South African wines to select from. A real eclectic crowd of people from all walks of life. Do not miss an opportunity to try this delicious cuisine!!!", "pics": null}}, {"review": {"des": "Food is terrific. However terrible service.  I swore beforw that i would only ever order carry out from this place. We got the same fuzzy headed indian/pakistani waiter that put a damper on our meal previously. Last time he wrapped vegetarian meals with meat meals to go... (in same container) Tonight we asked for gluten free injera, and recieved wheat injera salad entree on top of teff injera. I asked for a beer every time i saw him over 10-15 minute intervals. After 35-40 minutes a manager comrs by to tell me. They dont have that beer which is cold. He could have easily just told me the beer wasnt available. Did he forget?  Or just decide he would let it refrigerate while i wait for a drink. These were actually just a couple of the list of shitty service that this restaurant literally always has. Its a shame because the food really is special. Just that service is always a disaster.", "pics": null}}, {"review": {"des": "Been there three times and every time after I eat there I felt sick afterwards but the last time I went was by far the worst experience we've had.<br><br>My wife and I and a few friends went and the overall the experience was awful.  First we sat down looked at the menu and after 30 minutes the waiter never came by.  So I got up and found a server and he took our order.  20 minutes later I asked the same waiter where our drinks where.  He said, \"we are working on them.\"  We ordered there homemade wine and water.  Unless they were making the wine from scratch and going to the lake to get the water it should not take that long.  Plus they were not even that busy.  It was half empty with plenty of waiters working.  It was just terrible service!  They finally brought our food and it was pretty good tasting.  Then another 30 minutes went by after so I got up and found our waiter again to bring us the check.<br><br>The next day; my wife and I both had upset stomachs.   It wasn't good, never again!<br><br>Overall the food tastes okay, the service was terrible, the prices were okay and I will not return.  Next time I'll try the Mexican restaurant next door.  If the service was better I'd return.  Until then plenty of other restaurants in Chicago to try<br><br>The only reason why they get 2 stars instead of one is because the first two times I went there the food was good.", "pics": null}}, {"review": {"des": "Returned to Ras Dashen tonight. This has been our \"go to\" Ethiopian place for a while, even though there are at least three in the neighborhood to choose from. This experience was disappointing. First time ordering an appetizer (sambusa) which was fairly flavorless. Ordered three entrees and 4 sides, all of which were just OK. The potatoes in one of the dishes were a bit under done. The lamb dish was very liquidy, and was poured right on top of our spinach side, making for an overly soggy injera base and a ruined side.<br><br>The service was perhaps the most disappointing. Our server brought out the injera platter with our 4 sides and set it on the table. A minute later he brought one entree out. It was a full 10 minutes before he brought out the other two. Our basket of injera was empty at that point so we asked for some more. We waited another 5 minutes before he returned with it. He was not very apologetic about any of the delays.<br><br>This is Labor Day, so perhaps they had a skeleton crew, or the B team, but if so, why bother being open? It didn't seem like there was a manager there and it was just the servers running the show.  This might explain why no one made any attempt to come over when it was clear we were displeased and why there was nothing taken off our bill either.  Speaking of the bill, this restaurant has definitely increased its prices to the point that it has become very expensive for what it is.<br><br>I haven't read the reviews for this restaurant in a long while since we are semi-regulars and have always enjoyed it in the past. But judging from the more recent posts, it does appear that they are struggling a bit, especially on the service end of things.<br><br>We'll be back, if only to give them another shot, but not before we walk down the block and try the dishes and service from one of the other Ethiopian options in the neighborhood. Perhaps we'll find a new \"go to\" spot.", "pics": null}}, {"review": {"des": "I have been coming here for years! Always consistently good. Weekdays are best for a quiet meal. It gets insanely busy on the weekends.  Great value.  I recommend the Asr Wat w/Veggie sampler or the doro wat.  Delicious stuff! We come here almost weekly. Ask for Khaleel to be your server.  Great guy who never screws up your order.", "pics": null}}, {"review": {"des": "Walking in to a dimly lit but soothing room, we were promptly asked to pick our seats . We had a groupon and honestly didn't really have high expectations because my first time with Ethiopian food was far from being the finest. The server informed us to choose between two chicken dishes (one spicy and one not) and two beef dishes (same one spicy and one not). Chicken Doro Wat and Beef Zil Zil Alicha with a choice of three sides. We ordered the beets, split peas, and spinach and everything was so tasty! <br><br>All foods were served on a spongy bread and soaked up all the flavors at the end. No forks... Just hands. Such an amazing experiences. Enjoyed our meal Little handmade tables, maybe not handmade, but impressed regardless. Michelin guide recommended 2015 and is now in top 10 for Chicago! Must try! <br><br>Oh yeah. Ethiopian beers. Yum!", "pics": null}}, {"review": {"des": "I was craving for Ethiopian cuisine so my friend suggested that we come to this Ethiopian restaurant for a group dinner. The restaurant was good for groups as the long interior encompassed a full bar, three rows of tables, and cultural artifacts arranged along the walls. Despite their undisputed reputation, the atmosphere was slow for this particular evening. We were the only customers in the restaurant for a good portion of the night.<br><br>My friends weren't looking for communal dining, so I ordered their award-winning Yebeg Tibs ($24.95) that came with one side, Misser Wat, and Gomen ($3.00). The Yebeg Tibs came recommended by the server and the dish exceeded my expectations. The lamb arrived in small cubes that were lightly cooked with onions, green peppers, and Ethiopian seasonings. The lamb could appear in larger pieces, but the combination was nicely cooked down to bring out all the sharp spices and flavors from the lamb. It was spicy, tender, and lots of moisture. Ironically, my friends who were not keen on communal dining loved it too.<br><br>The Misser Wat came with pureed red lentil in a spicy berbere sauce. The buttery taste was heavier than the ones I had at other Ethiopian restaurants, so it is not something I would recommend. In contrast, the Gomen was very good as the slowed cooked chopped greens were nicely seasoned and complemented well with the lamb. Their injera was not too sour and it came with an abundant of soft spongy texture. Too bad I couldn't bring them back to Iowa but they do sell them for $1 per pound. Gluten-free injera is also available with advanced notice.<br><br>The only serious complaint I had was their service. The servers were kind, down to earth, and gracious. However, the food took a long long time to arrive at our table, leaving us scrambling to grab a cab to catch our show. Even though the wait time for food to arrive tends to be longer at Ethiopian restaurants, but this was quite unusual especially since we were the only ones there for the good part of the evening. I would definitely be interested in coming back after having a chance to try a good number of other Ethiopian restaurants in Chicago. 3.5 stars for the experience.", "pics": null}}, {"review": {"des": "John was my waiter and he was great! Very knowledgeable of the menu and very nice. I come here every month and the food and atmosphere are always so nice and comforting. The veggie sides are all delicious and the homemade honey wine is amazing with an unexpected, pleasant smoky flavor. Love this place and hopefully John will be there next time as well", "pics": null}}, {"review": {"des": "Came here with a Groupon of two on a quiet Tuesday afternoon. The place was nearly empty except for my mom and I. <br><br>There is both regular sitting as well as 5-6 traditional Ethiopian dining which was comfortable and cute! <br><br>The groupon ($26) lets you chose from any 3 sides and 2 entrees which is totally worth your money because usually you'd be paying about $40 (not including tax or tip) for all of those options but I left paying 26+ $3 tax+ tip. So a savings of about $10! <br><br>Food came in under 15 mins, hot and delicious! <br><br>I'll come here again.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/75eWhf9MKhfIFPnC78BSpw/168s.jpg", "caption": "So cute!"}]}}, {"review": {"des": "Before this place, I had tried Ethiopian food once somewhere else and was not a fan. When I was dragged here with my friends, I was not too excited. After, eating here, It really grew  on me. I have been here total of 5 times in the last year or so. It is a great place for vegetarians! Everything has so much flavor. The groupon deal is amazing. You get 3 sides and 2 main entree for the vege groupon for 2. This is more than enough for 2 people. Our favorites here are the following. <br><br>Main entree- Misserana Bowmia - Okra  (we get 2 orders of these)<br>Sides- misser wat (lentil),  yeqay tikil gomen(sweet/sour cabbage), and Diblik Atkilt-(green beans/potato/ mixed vegetables) <br><br>Drinks: Ethio Chai <br><br>The food is five stars. I took one star away for service. They are not too attentive to refill drinks or ask for more bread (injera)", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/lMltozJTbp_Bh-vjujZ4pw/168s.jpg", "caption": "Enjira"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/QgO2wCT1cMIwhFkP0fpLPw/168s.jpg", "caption": "Misor wat, Okra, cabbage, green beans and potatoes"}]}}, {"review": {"des": "I been coming here for years. It is one of my favorite places in the city. A hidden gem.  This was the first Ethiopian place I went to and I feel so lucky to have found it. I have been to others Ethiopian places and nothing compares. <br><br>The flavors have so much depth. Their stews are heavenly spiced  and they prepare some of my favorite vegetarian dishes.  Some of my go to are the misser wat , sega wat, qosta,and the ib. Their hot tea so delicious too.  Also it  is hard to pass up the coconut creame brûlée. <br><br>Plus you get to eat with your hands", "pics": null}}, {"review": {"des": "I ordered Doro Wat. It was very spicy but delicious. I felt the food was a little overpriced, but I think it is still good that we can try some cool Ethiopian food here in Chicago.", "pics": null}}, {"review": {"des": "Excellent quality, healthy, mostly vegetarian food.  <br><br>The best way to check it out if you haven't tried Ethiopian yet, is the large TEFF pancake with many different flavors to try.   <br><br>Parking is good.  Public transportation, also.", "pics": null}}, {"review": {"des": "I have enjoyed the following:<br><br> -  Diblik Atkiltv: green beans, potatoes, zucchini <br>and carrots stewed with tomatoes<br>- Qostav spinach cooked with onions, garlic and <br>spices<br>- Doro Wat: chicken and egg cooked in a spicy berbere sauce, also the national dish of Ethiopia<br>- Awaze Tibs: lamb with sautéed, caramelized onions in a <br>spicy awaze sauce . <br>- Asa Tibs: marinated, boneless tilapia fillet pan-seared in <br>ginger and black pepper and served with fresh-cut <br>sauteed vegetables<br>- Sambusa: beef wrapped in <br>pastry and lightly fried<br><br>We've eaten in-house and have done carry-out. In-house service is very hands off, and you won't get the bill unless you ask for it. That's how it's done, don't complain.  Carry-out was fine, no issues. I picked up when they said it would be ready and it was there waiting for me. No complaints.", "pics": null}}, {"review": {"des": "Ras Dashen was a great choice for dinner before attending Jackalope Theater across the street. The service was fast and attentive, and the food was flavorful, fragrant, and beautifully presented. The vegetarian sampler is a good value and I especially enjoyed the sweet/sour cabbage (Yeqay Tikil Gomen) and spicy Berbere lentils (Misser Wat). The Warka cocktail is as good as other reviewers claim and my partner was impressed by the beer selection. I wish we lived closer so we could eat here more often.", "pics": null}}, {"review": {"des": "Absolute CRAP! Took so long to initially come by our table that we left before even ordering! Not only was there horrible customer service, but the menu was bare AND super over-priced. I mean what sort of Ethopian place doesn't even have a meat sampler option?!? I've been to so many Ethopian places and that was a first for me. Definitely a lot more effective options even with a half mile radius. DO NOT visit this place!", "pics": null}}, {"review": {"des": "We don't really know what counts as good Ethiopian food, but this place is pretty decent. Each entree comes with a side. We ordered two meat and one vegetarian entrees for three people, and it was just the right amount of food. <br><br>When they say chicken and egg, they mean literally half a boiled egg. The chicken was good though. Fell off the bone easily and was easy to rip into little shareable pieces. Read the menu carefully if you like your meat cooked. A lot of the beef is only slightly cooked and comes out looking basically raw. Also I would not recommend the cheese side, but the cabbage one is pretty good.<br><br>Service is pretty slow, even when it was pretty empty. Only one waiter was working, but granted, it was a Monday night. The table next to us ordered maybe 5 minutes after us but were still waiting for their food when we left. <br><br>A little pricey, but Ethiopian food tends to be in general, so no complaints there. There's a nice little hand washing station in the back which is convenient. We noticed a lot of people with printout deals, maybe groupons, so if you want to check this place out I would check if they have any promotions running at the time to make it more affordable. We probably won't be back because it is kind of far for us and wasn't amazing enough to warrant a return visit.", "pics": null}}, {"review": {"des": "Delicious food served traditionally.  So no forks!  We had the vegan appetizer platter which I felt would have been enough.  I like how the menu shows which dishes are spicy, and believe it because they are.  <br>I tried the homemade fig wine and I recommend it.  Goes perfectly with the cuisine.  Be prepared to spend a long time there.  Patience is a virtue.", "pics": null}}, {"review": {"des": "A wonderful Ethiopian restaurant with grace style and a varied menu, and the most attentive and courteous waiters ever made.", "pics": null}}, {"review": {"des": "First time eating Ethiopian food and it was delicious. <br><br>The staff is very friendly and helped us through the menu giving great (side to entree) pairing advice.<br><br>You can sit in a traditional table- small concave table where the good  platter is placed. Or you can sit in a regular table. <br><br>We tried the the Doro wat chicken (#18) and Dereq tibs lamb (#22). The chicken was so moist. The lamb was seasoned well. We had the sautéed spinach and the greens beans with tomato as our sides. <br><br>There are no utensils so be aware that you'll eat with your hands via the Ethiopian bread. <br><br>Overall a great place to visit if you are a first timer to Ethiopian food.", "pics": null}}, {"review": {"des": "Excellent experience. You eat with your hands and this injera bread. Very unique taste. I love the spicy beef. I'm a \"spice guy\" and this had more then enough flavor. We bought a Groupon for $27 and that handled (2) thick people. Lol.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/15RxX2XFw_pAVILmCTqmVQ/348s.jpg", "caption": "There are plenty of tables and also some of these for a unique experience. Good for a date?!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/91j1DTot6ruZe-IqOKXE1g/168s.jpg", "caption": "Use like a tortilla: rip it up, scoop up your food and eat this bread as well."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Ah9l9BDvnyg1cA-Y7gqgfQ/168s.jpg", "caption": "Injera bread to eat with"}]}}, {"review": {"des": "The food was good but slightly overpriced, especially given the portions. Standard fare like Doro Wot and Lamb Wot as far as food is concerned. Range of Ethiopian beverages was impressive - Honey wine was good but on the expensive side - $30 per bottle. The arabic-style coffee was very hot, very dark and very flavor ful - best I've had in a while. Traditional Ethiopian-style eating was available but the servers were all south asia, and they were very understaffed.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/TNvTPQGdcMInG84A4V2tig/348s.jpg", "caption": "Coffee"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/uodx3HsiM5XamDuIwzCpZg/168s.jpg", "caption": "Coffee"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/EYCz4oyYJjd3MTcOAK6D6A/168s.jpg", "caption": "Doro Wot and Lamb item on Injera."}]}}, {"review": {"des": "Bad bad service. Been waiting for our food for 45 minutes!!! No one knows what's happening and where the order is. God help them if this is how they operate.<br><br>They won't see me here ever with this wonderful service", "pics": null}}, {"review": {"des": "Our favorite Ethiopian place in Chicago! We had the veggie sampler, our favorites include the tikil alicha and gomen, and the Doro Wat (a spicy chicken dish cooked in bebere sauce and a hard boiled egg) served on spongy injera. We also had the spicy Ethio Chai and the homemade Tej, Ethiopian honey wine.", "pics": null}}, {"review": {"des": "I love this place .. They have the best vegetarian food ..this injera bread and so good and u use it to pick up your food.. No forks or knives traditional food", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/33YmN4jRhvs4-ESu-lub_w/348s.jpg", "caption": "This place is so cozy .. And the vegetarian food here is so mouth watering"}]}}, {"review": {"des": "I liked this place a lot!<br><br>First, shout out to our server. Cool guy and he made the experience really great. We had so many questions. I've had Ethiopian before but we wanted to try new things. He gave amazing recommendations.<br><br>We had some Ethiopian coffee too (delicious). So we did a vegetarian sample and we chose one protein dish. For the vegetarian sample were got, the ib (soft cheese), misser wat (lentils--delicious!), komodoro salata (diced cucumber), diblik atkilt (green beans, potatoes), yeqay tikil gomen (sweet and sour cabbage - liked this!), and I'm pretty sure we also got gomen (chopped greens). We got 6 things lol even though it's 5.<br><br>As for our entree, we got lamb. We got the awaze tibs with lamb in a spicy awaze sauce. <br><br>Using the injera to pick the food up, and the combination of lamb and veggie dishes, we had such a filling meal. Definitely a lot (maybe TOO MUCH) for two people. Such a great mix of flavors. The ib also tones down the spiciness of the food. Try this place!", "pics": null}}, {"review": {"des": "This is probably one of my favorite Ethiopian restaurants in Chicago.  I've been here and Demera and thought this place was slightly better.<br><br>I can't tell you what to order since I can never remember with the Ethiopian names.<br><br>I usually will get the 3 meat platter with 3 veggie platter and special order the soggy bread to be gluten free.<br><br>It's a bit pricey but then so is most Ethiopian food except for the buffet in Milwaukee.", "pics": null}}, {"review": {"des": "This is admittedly the only Ethiopian restaurant I've been to in Chicago, but I really liked it. Cozy spaces, spicy and not spicy delicious menu items, huge portions, fun food and friendly service. I felt at home here, I loved the dishes and I will definitely be back. There's nothing else to say - give it a shot!", "pics": null}}]}