{"name": "revolution-brewing-chicago", "reviews": [{"review": {"des": "Without question the best veggie burger in Chicago. It's a beet patty, and the combination of the bum, argue and gouda they throw on top is lip smacking. They give a side of garlic cream cheese mashed potatoes and I could eat a bucket of that stuff if they offered it by that portion size.<br><br>The servers are always friendly and helpful. They have a good insight into the beer menu and make good recommendations.<br><br>The other food at the establishment is pretty good too. I've ordered the cheese curds and the hummus among other things.<br><br>As a brewery revolution is excellent. They have a wide array of beers that are always rotating. Anti Hero and Fist City are classics obviously, but their seasonal beers are great. Rosa in the summer time is a must try.", "pics": null}}, {"review": {"des": "A lot of my favorite craft beer is made by Revolution. So it only made sense that I check out their brewery. <br>There's nothing super attention grabbing about the inside... it's got the pretty straight forward brewery look. <br>Since I love so many of their beers I had to get a flight. I never met a flight I didn't like and this one was no different. I think flights are such a smart thing to offer because it really let's people try various beers they wouldn't normally order in a full size. <br>For starters I ordered the bacon fat popcorn which sounded mouth watering. It was okay. It may have been the time, day, or server I had but it was brought to my table kind of cold and forgettable. But I'd get it again to see if any of those factors took away from how delicious so many other people say it is.<br>The fish and chips though.... ugh. Yum! The batter was so crispy and had a great taste from the beer. Which is usually where fish and chips fall short, from bland batter. You also get 3 meaty pieces of fish. It came with a ton of fries as well. I've seen a couple negative reviews about the size of the coleslaw... which is in a small condiment size bowl. I love a good coleslaw, and their's is really tasty... Who gets fish and chips and complains about the coleslaw!? It was the perfect amount for me. The remoulade was also amazing! Great balance of spice and acidity that complimented the fish so well. I left Revolution full and a little tipsy, so I'd say it was a great experience.", "pics": null}}, {"review": {"des": "A goal of mine was to go to Revolution Brewing as they are my favorite Chicago brewery.  I'm a big fan of IPAs and got hooked when I tried their League of Heroes sampler pack (4 different kinds of IPAs).  I wished I could have gone to their tap room, but they're not open on Tuesdays, so I went to their restaurant location. <br><br>I was immediately excited seeing the taps of different colored fists, I was a kid in a candy store wanting to try them all! In most cases I would get a flight of beers, but for some reason they don't do that here.  You can get three bigger samples of beer for $2 each.  To me that's basically a flight...but whatever.  Besides the IPAs that I never had, I also tried out their sours as well.  Kudos to all their beers. Hoping to see them more often up around the Green Bay area.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/7qY0mk0ZlDV_4e3qUk_M3Q/348s.jpg", "caption": "Beers!"}]}}, {"review": {"des": "So I wanted to bring my friends to a brewery in Chicago and we were already in Logan Square so we decided to go to this one since I had it bookmarked! One of my friends isn't a fan of beer but she finally found her type of beer she likes at this brewery! She really likes sour beers which I'm actually not a fan of but I'm just glad she found a beer she really likes! I'm a fan of IPAs and I don't remember the exact beer I got from here but I just remember really enjoying it. We just stopped by here for a quick beer and we had to go since my friends had a flight to catch. But this brewery was pretty nice and I would recommend coming here if you are ever in the area!", "pics": null}}, {"review": {"des": "The $14 Beer Mussels here are so good!  The mussels are small but very tasty in the sauce, which I can almost guzzle if not for the fear of sodium overload.  Perhaps it would be offset by the crispy slivers of green apples that were on top.  The $13 Ancho Chile Shrimp comes with chorizo, shallot, garlic, sweet pepper, tomato, scallion, cilantro and giant shrimps.  It was not spicy and was even better over rice as left overs the next day.<br><br>The bar is located in the middle of the restaurant and has big screen TV's above.  The taps are lined with different colored fists.  My go to here is the Anti-Hero beer.<br><br>Paid street parking nearby was easy to find on a week night.  It was convenient to walk over from Emporium.<br><br>....| \\      _  , , , - - , ,  _  ,      <br>.../  , ` . - ' ` '             . _   \\ -  ;  ;  ;  , _    <br>..| ,  a  -   )   ) _         . ; .  (   ` - ` -  ' - '   <br>'  - - - ' ' ( _ / . _ ) - ' ( _ \\ _ )   2018", "pics": null}}, {"review": {"des": "Gooood beer and pretty good food. I had the golden ale. The bartender Dannielle was very kind and offered a lot of help throughout the night. The highlight of my experience was the veggie burger .... wow. One of the best veggie burgers I have had and it was a house made patty. Not to mention the mashed potatoes...willl be back again...literally been daydreaming about this burger today", "pics": null}}, {"review": {"des": "Revolution Brewing is a great brunch spot that I'm hoping to return to soon. It's kind of off the beaten path for me since it's far from the red line, but they have unique menu items and of course lots of good beer. They also have a knowledgeable waitstaff that can help guide you in deciding what beer/beers to order. I ended up ordering a flight of 3 beers and a chorizo omelette. My friend only chose one beer, how crazy! Overall, everything was outstanding and the atmosphere is great.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/b03OaRkN5ilS8j5fBxw-ZQ/348s.jpg", "caption": "Chorizo Omelette"}]}}, {"review": {"des": "I'm in and out of Chicago for a day and just had to make a quick trip here for a couple beers. <br><br>I'm sure glad it did as it was worth the stop.  They offer some great food and awesome beers. <br><br>I'll be back in a Chicago in a couple months and will definitely make it a point to stop here for dinner and drinks again", "pics": null}}, {"review": {"des": "What do you do when you visit a brewery, you ask? Order a martini of corse :) <br>Came here to meet my friends on a random weekday when they had decided to day drink. It's a continent spot to go to. Next to a variety of restaurants and bars you can go to if you're trying to hop around. I've been to revolution multiple times and the experience is always alright. This time I ordered fish and chips. The fish was hot and crispy. I got three pieces of fish over golden fries and sides of coleslaw and tartar sauce: the coleslaw was tasteless, I could almost hear it whisper 'season me'. The fish made up for it though, as mentioned, it came in a generous portion and was perfectly crispy. It wasn't quite beer batter but it was uniquely tasty. Martini was on point.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/buuqjmGD36-n9yXBJV9M7w/168s.jpg", "caption": "Tito's martini"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/F4n3pDx2WzNpuzlC7sQ_jw/168s.jpg", "caption": "Fish & chips"}]}}, {"review": {"des": "This one has kind of been on the downfall for me. When I first visited back in 2012 or 2013 on a weekend brunch, I was on a high... Great beers and awesome food! More recent visits in the last year or so have left me underwhelmed. Not much change in the draft selection (mostly just offer their core set of signature beers) and the menu items seem to be much more limited and have lost their \"wow\" factor for me.<br><br>On a more recent visit, my wife had ordered the half chicken and had to send it back twice due to it being under cooked both times. *sad face* While service has never been an issue here, in terms of beers and food they seem to be losing their edge. Hard to say I'll be back soon.<br><br>'Til next time, cheers!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/_RqX7fNUkAwpGbA2v4YtdA/348s.jpg", "caption": "bionic commando & eugene porter"}]}}, {"review": {"des": "This place was convenient to stop in as I waited for our air bnb to open up. They didn't mind that we had luggage with us as we sat at the bar on a slow Thursday afternoon. <br><br>Big, open space with kick ass music playing. I don't particularly enjoy their branding as it's just... too much. But their beers were solid. We didn't try any food.", "pics": null}}, {"review": {"des": "This place is always brewing with energy and tasty food. It gets pretty crowded during dinner time, but it's usually just the amount of time it tastes to down of few beers.<br><br>Skip the Bacon Fat Popcorn. Really good Brussel Sprouts. The Fish and Chips is yummy. I would also order the Pierogis again. Great food. Better beer, if you like hoppy beer. The Anti-Hero and the Citra are popular. <br><br>Great place to meet friends. I've seen some families with kids here during dinner. Would love to try the Brunch here. Cheers.", "pics": null}}, {"review": {"des": "Fantastic beer selection, great food, and quick service. What more can you ask for?<br><br>Despite the fact that you'll most likely have to wait for no less than an hour during peak dining times (you can add yourself to the waitlist on yelp without being physically present in the restaurant which is a huge help!), you will not be disappointed here. <br><br>While you're waiting they have a great selection of their own beer on tap, some of which is not bottled and is unique just to the restaurant itself, as well as plenty of other bottles options to occupy you and your party. The waiting space is tight, but I promise it's worth it. There is parking available, and they are pretty efficient with moving parties in and out. <br><br>The food was also amazing. We started with the bacon fat popcorn, and all got one of their burgers as well. Incredibly well cooked, hearty portions, and great toppings with powerful flavor. The one small push is that the garlic mashed potatoes weren't super warm, but still tasted good none the less. I will definitely be back!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/xO1-lpeyJh3XLWSEGYrw5A/168s.jpg", "caption": "Workingmans burger"}]}}, {"review": {"des": "We have been to Revolution in the past (about 2 years ago), and had a great experience.  This visit was slightly disappointing.  <br><br>We arrived shortly after they opened at 10AM for brunch, and were seated promptly with no wait (which was nice for a slightly larger group).  Our server was patient as we had a few drinks while waiting on one person to join.  The beer selection was so-so; some brews we hadn't tried before which were pleasant enough, but nothing fantastic.  People spoke well of the beermosa with Cross of Gold and Bloody Mary's.  <br><br>The slightly disappointing part was the food.  The brunch menu was a fairly limited selection.  The house doughnut of the day (a waffle with hibiscus glaze and horchata whip) was alright, although it was definitely more of a doughnut-shaped waffle.  I ordered a breakfast burger and fries, which were good.  The onion jam and bacon combined with the sunny side up egg on the burger really hit the spot.  The fries were soft but salted nicely.  However, several people ordered the biscuits and gravy - too salty, too much gravy, and a lack of other components (mostly biscuits - one biscuit broken in half, a small portion of eggs and a lot of salty gravy in the middle).  I was bummed to notice most meals went unfinished.<br><br>We had been there for dinner previously so I would try again for that, but the brunch was definitely underwhelming, and I ultimately regretted suggesting we go.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/a5-6clex6w6f-eZQK0pPLw/168s.jpg", "caption": "Breakfastman Burger"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/_-jRaSu06IJYv89HFdpkHw/168s.jpg", "caption": "Underhero"}]}}, {"review": {"des": "Came here for drinks and a snack with friends on a Saturday night. Checked in with Yelp (waitlist) and didn't have to wait long at all. I just had the Smash the Windows nitro milk stout. Not too heavy but still flavorful. Ordered a side of fries with the garlic aioli...just stick with ketchup. The fries are great; salty so you want to keep drinking beer. Be advised, it's a loud atmosphere, but fitting for a Saturday night. We'll be back!", "pics": null}}, {"review": {"des": "Pleasantly surprised with the great food at this brewery. My group of friends happened to visit for dinner on cinco de mayo and they even had a special menu to celebrate. I was feeling festive and ordered a margarita, along with the duck tacos. <br>The duck tacos were a good deal and very tasty! The dish came with 3 tacos, plus rice and beans. The duck was tender and juicy and just basically everything you want in a taco. <br>On the other hand, the margarita was a little diluted, but I can't complain too much because it's kinda awesome they even offer cocktails in addition to their beer selection. <br>It's also a cool space with good vibes and good service. I love that if you have to wait to be seated, there's a separate area where you can chill and have a drink. I would visit again for dinner or lunch, with friends, family, or even a date. It's definitely a versatile place!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/zYUI2t_bzGrTh96hFwcgYA/168s.jpg", "caption": "Duck tacos were on special menu for cinco de mayo but I would eat them any day"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/eeAgdKpUdtkMKHXD-dePhw/168s.jpg", "caption": "View of the inside from our table"}]}}, {"review": {"des": "Oh, this rollicking haven for beer lovers definitely lives up to the hype.  Driving in from the 'burbs around 6:30 PM on a gorgeous Saturday, we braced for a challenge with street parking and a long wait for a table ... and encountered neither.  We found a parking spot just 3 doors down and were seated promptly (it does get busy later on).<br><br>Brew-wise, I'm particularly fond of their Hero series but hadn't yet tasted Tropic-Hero.  Ahhh, refreshingly fruity with just the right amount of hoppiness.  The Missus and I both ordered the Workingman Burger.  Onion jam and thick-cut bacon elevate this humbly-named sandwich to a savory delight, and we had no problem devouring the accompanying fresh-cut fries.<br><br>Nowadays I rarely chase so decadent a meal with a decadent dessert.  But I'm an incurable chocoholic, and upon reading the description of the S'mores Pie I caved in.  The meringue-topped chocolate mousse was rich and indulgent, its underlying chocolate graham cracker crust crunchy like a cookie.  I polished off every crumb.<br><br>Such exceptional pub food is a great companion to Revolution's competition-caliber beers.  The only negative here is the extreme noise level, which challenges conversation.", "pics": null}}, {"review": {"des": "Yummy nummy. Came for to Revolution with friends for the first time recently, and am pleased. In between scarfing down curds and quaffing draughts, we all had a good time.<br><br>I can recommend the place for vegetarians: My beet-based veggie burger was unique- very crispy on the outside and soft inside. The salads were unexpectedly mmm. Not your typical brewpub house salad.<br><br>And of course- drink some beer!!", "pics": null}}, {"review": {"des": "Since I moved here and found this place I keep coming back. Great selection of rotating beers on draft, but don't overlook the good cocktails they have as well. <br><br>For the food, try to find something that's not good, you won't. My favorite though is the wings, they are huge and full of flavor. <br><br>The place can get busy on the weekends so try your luck at the bar or put your place in line right here on Yelp", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/bTOLl1tltb6JRCN7p8nenA/168s.jpg", "caption": "Chicken sandwich with pimento cheese"}]}}, {"review": {"des": "Hands down best biscuits and gravy in Illinois.  Possibly best brunch in Chicago but definitely the best beer selection", "pics": null}}, {"review": {"des": "The atmosphere here was awesome! if you're looking for good beers you definitely need to check out this brewery. I've had my first revolution anti-hero ipa downtown chicago and then finally was able to go to the brewery in Logan Square. They also have a good porter as well called the Eugene Porter and would be perfect for the winter months settling in.", "pics": null}}, {"review": {"des": "What a great place. We had the beer muscles and a salad. The popcorn was a treat. Portions more than generous. Staff attentive. The wine list was more than satisfactory for a brewpub. Can hardly wait to come back!", "pics": null}}, {"review": {"des": "Revolution - what happened?!!!  I used to love coming here, and on a recent trip, was so disappointed!<br><br>My friends and I spent a pretty penny here for dinner + drinks. I ordered the chicken (I think it came with spatzel, as well). On first cut, the chicken was bright pink. The waitress saw that too and was shocked and quickly brought it back. On the second round, the waitress quickly apologized and said that the entree would \"of course be on the house,\" and put the same chicken back in front of me. At this point, my dining companions had finished eating, and I indeed cut into the chicken again. The breast part was cooked, but when I cut into the drumstick/thigh portion, I cut into a blood vessel and it started bleeding. I asked the waitress (begrudgingly - I mean. I didn't exactly come to Revolution with the intent to not eat alongside my dining companions) if she didn't mind taking a look at my plate, to which she said, \"yeeks. still not cooked through...?\" and apologized profusely. <br><br>She returned about a minute later, and said the chef/cooks blamed the \"look\" on the brining process and that's why blood was squirting everywhere. Now I've brined meat before and never had a bleeding chicken...so I just wasn't game to go for round three. I asked her instead to bring me two appetizers that added up to the cost of my chicken. Though Revolution DID take off a $6 (or so) beer, I'm a little confused also at what happened to their \"of course [the entree would] be on the house.\"  I didn't get my appetizers til my friends had finished their entrees.<br><br>Just all around disappointed.", "pics": null}}, {"review": {"des": "I can't give a true review about the food here since all I ordered was beer and the s'mores pie! Lol  But as for the beer, they do not disappoint! Lots of options that are sure to please every palate. For me, I'm a hop sucker! I ordered a sample of all the pale ales and IPAs they had on tap at the moment. My fave was a citrusy IPA, can't recall the name but it might have been Tasty Destinations. I'd def come back again, they are always putting out new brews! And the food menu looked great but I had just come from eating dinner before I arrived. <br><br>Check them out or buy a sixer at your local store, also, grab a 5pack of stickers for $3 on your way out!", "pics": null}}, {"review": {"des": "My friend and I came to Revolution Brewing on a Saturday for some mid-afternoon beers. There was a good amount of people there, but it was definitely not crowded.<br><br>I tried the Please Clarify (Kristallweizen), Rosa Hibiscus Ale, Bottom Up Wit, and the O'Hare Oatmeal Stout. My favorite was the Please Clarify - it's a fantastic summer wheat beer.<br><br>I also ordered the Hushpuppies (served with vanilla honey and maple butter). They were probably the best hushpuppies I've ever had. I had eaten a savory/salty brunch a few hours before, so the sweetness of the hushpuppies was a perfect balance. <br><br>The space was bright and open, the beer was good, and the hushpuppies were amazing!", "pics": null}}, {"review": {"des": "Fabulous beer, great ambience. Service was fine, not super friendly. But then we pointed out they undercharged us in the bill and our bartender says, \"Those beers are on me,\" so all is forgiven. Very impressed with beer list. Distinct flavors, well described on brew list. Looking forward to coming back!", "pics": null}}, {"review": {"des": "This place is the BOMB DOT COM Michelle was our server. The food was delicious we had the wings, fish and chips and popcorn which were all to die for!! The music was on point and so was the service! We got here late maybe 11p or midnight and it was packed. Michelle gave us a lot of beers to sample and recommended what foods to order. I fell in love with this place and I will def be back!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/WsijHzvTv5yW1Egje302fA/348s.jpg", "caption": "Iron Fist Fish And Chips"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/oi1WXBqIG6VhfaNT9VNpNg/168s.jpg", "caption": "Wangz"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/wnRjLrdU9pqlNOJN8BFOEw/168s.jpg", "caption": "Menu"}]}}, {"review": {"des": "Just a few blocks away from our Airbnb, and recommended by our host, my friend and I decided to check this place out. <br>This place was happenin on that Saturday night. We had to wait a bit, but we were also able to hang out at the bar. I tried one of the local brewery's dry ciders which was good.<br>The wait wasn't too long (about 20 mins around 8PM). <br>We were promptly seated and took our order. My friend and I ordered the basil chicken sandwich with the house salad. <br>The sandwich was delicious and really flavorful. However, the salad tasted a bit like grass (or what I think grass would taste like), but they probably just didn't add enough of the balsamic dressing.<br>Love the very lively atmosphere here. It was really loud, so if you're looking for somewhere quiet, look elsewhere. Very cool spot nonetheless.", "pics": null}}, {"review": {"des": "If you like craft beer, with great food, a great atmosphere, and great service then you should enjoy this place. Staff is very knowledgeable about each beer and are very friendly. This is a great spot especially if you are an IPA fan. I had the wings which were amazing. The beer was top notch and the atmosphere made it even better. If I were a local I would come to this spot at least three times a week. If you are staying in downtown you should not hesitate to use any means to make your way out to this spot.", "pics": null}}, {"review": {"des": "Beer was great but no so much of fan on food. It's just plain bar finds... nothing extraordinary. If your just around in the area...stop by for cold beer. <br>We had the pizza and burger.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ISrgU4JAFe7zgxtaLvKQ0g/168s.jpg", "caption": "Meaty pizza"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/R_MCbkd487or-MGsFVvyCg/168s.jpg", "caption": "Hummus dip...thought it was warm dish since it was in skillet but it was cold dip."}]}}, {"review": {"des": "The staff were wery welcoming. This place is kid friendly and our server was well versed in communicating with kids. <br>This place IS a pub so if your looking for something a bit nicer, I'd look elsewhere. But that doesn't say anything about the food because I was completely satisfied with my meal. We ordered the cheese curds and wiped them out almost immediately. Then came our 2 burgers, the hombre and the tropic. We split both of them and it was the best choice. Probably 2 of the better burgers I've ever had honestly. <br><br>The only reason I'm not giving 5 stars is that the food did take a bit extra time for some reason. Our server was very accommodating and attentive but you can only do so much for so long. <br><br>To sum it up, go here, eat the food, enjoy your life.", "pics": null}}, {"review": {"des": "Family friendly?  You bet.  Long story short, we alighted here after finding no tables at Chicago Diner around 12:30 on a Saturday.  I was worried that this was a questionable place for a toddler, but I was wrong.  First, they set us up with a high chair, coloring mat, and crayons (no cheapies--Crayola brand); also, the menu featured a kids meal option of two items from the breakfast sides list for only six dollars.  Plus the server was so great with our daughter.  Big thumbs up.<br><br>We all shared the huge soft pretzel with tasty cheese fondue (dipping fun for all ages).  My sandwich featured rather bland pulled pork, but the slaw and the earthy, interesting sauce made it plenty flavorful.  Solid fries, decent side salad (though underdressed).<br><br>City outings like this are rare for us (we were actually just passing through) but it's nice to know that Revolution is still reliable for good food and beer.", "pics": null}}, {"review": {"des": "Revolution Brewery. This place has been around for a while and a lot of people I know have told me to come here so I have, multiple times now. As a brewery I feel that do a pretty good job. Beers can range from basic classic style beers that barely differ from grocery store lagers to wow that's great small batch wonders.<br><br>The food, this is where they lose me fast.  My first impression of the food was \"this is good but then this plate is ok while the following plate is bad.\" I'm not one to post negative reviews with out giving it multiple tries. So I have again and again. Even the same dishes that where once good, were not consistent as good. They ended up being part of the bad category. I don't ask for much, I just want a good plate that is still on the menu advertised the same to have some consistency. <br><br>I will be back for the beer, but I'll make sure I eat elsewhere.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ePU8KyHMW87lNOZA0UkgFQ/168s.jpg", "caption": "Amarillo Burger"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/2Tzj0thuDfyG0HN9-4naIw/168s.jpg", "caption": "Pulled Pork"}]}}, {"review": {"des": "First time here. We found a parking spot on the road pretty easy. The bar is very nice and there is a lot of seating. We were seated right away on the balcony level in a booth. Great seat. Our waitress was attentive, I wouldn't say friendly but attentive, yes. We ordered 5 samples of different beer and the Bavarian pretzel. It came with beer cheese and a mustard. It was very good. We enjoyed the cheese the best. The beer was good. My favorite was the Freedom of Speach. It is a sour. My husband ordered four more samples and we ordered the pork sandwich to share. It was very good. We got the garlic cream cheese mashed potatoes and really enjoyed them. To wrap it up we shared the donut of the day which had marscapone whipped cream and cherries. It was very good. We enjoyed the menu of beers and the food. We will be back for sure.", "pics": null}}, {"review": {"des": "I've been a fan of Revolution beers for years now but just had the chance to finally make it over to their restaurant/bar. It was a little underwhelming. My friend and I sat at the bar. The bartender wasn't very attentive. We had to ask for food menus and water since he didn't bother to take the initiative. The bar area started to slow down later on in the night while we were still there. I ordered the fish and chips. My friend had the pretzel and popcorn. Fish and chips were pretty good but small amount of fish for the price. The coleslaw that comes with it comes in a small condiment cup. There were more fries than anything else. Pretzel was tasty but the popcorn was forgettable. We had finished our drinks but the two bartenders who kept walking by (actually looking at our empty glasses) didn't bother to ask us if we wanted any more drinks or to take our plates/glasses away. Revolution I thought you were better than this!!!", "pics": null}}, {"review": {"des": "Stopped in to grab a bite before my flight back to DFW. I love the atmosphere here and would probably come back to grab a couple of drinks. Food wise I wasn't the biggest fan; we got the bacon fat popcorn maybe it was just me but the popcorn itself tasted pretty stale and didn't have that normal popcorn crunch. <br>I got the grilled pesto chicken sandwich and the chicken was awfully draw I had to chase it down with my water. After eating half of it I just completely gave up. The flavors itself was totally there at least.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/shGsoRWrGDge4tRW7M6sNQ/348s.jpg", "caption": "Applewood Smoked Wings"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/8uf3FgCa8CQIMm5mwxeqEg/168s.jpg", "caption": "Grilled Chicken sandwich"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/uz_hTsICxb6qracbw4yBcA/168s.jpg", "caption": "La Pryor Farms Pork Chop"}]}}, {"review": {"des": "We stopped by Revolution Brewing on a Saturday afternoon for a taste of their beer and left happy. This review does not reflect their food.<br><br>The atmosphere was laid back and rocking with some old school punk music blasting. One of my favorite aspects was the custom set of tap handles. They are uniquely painted fists that remind me of Biff's cane (Back to the Future reference for all you uncultured bastards!) The service was attentive and polite. The beer menu is big with something that will delight anyone. My wife had the O'Hare oatmeal stout and I had the Coup D'etat saison. The stout was creamy and delicious for a cold rainy day. The saison was bright and floral with a surprisingly dry finish reminiscent of a champagne.<br><br>Overall I would absolutely recommend a trip to Revolution for any beer enthusiast willing to jump on the Blue Line.", "pics": null}}, {"review": {"des": "Bar charged me for a beverage without serving me a beverage. When asked about said beverage, server indicated credit card was changed but drink was never served. Then, server asked what drinks the table wanted only to deny us drinks stating<br> we were \"overserved\" despite 3 out of 6 drinking water. I'm a great judge of drunkness, don't need anyone telling me I'm too drunk to purchase food or drink. Never happened to me before. Went down the street and had such a great night!", "pics": null}}, {"review": {"des": "Be prepared for long waits (definitely get the waitlist before you get there) for a table and for food esp. on Friday nights. We were there at 8, got seated by 8:40-ish, and our mains didn't show up till around 9:25pm. About the food: ginormous portions, but maybe a 3.5 star on the tasty spectrum. Steak was positively drowning in an overly sweet glaze and the fries were incredibly greasy. Coulda been because I picked the wrong thing off the menu though. Anyway....you can't go wrong if you stick to their burgers. Moral of the story: come here for the beers and simple eats. Avoid the fancier stuff.", "pics": null}}, {"review": {"des": "My favorite brewery in Chicago. Its a must if you are visiting from out of town or want to stop in and have a great quality beer w/ some great snacks. The beer variety is fantastic and they dont just focus on IPA domination. While nice, I love that they pay attention to the Kolsch's and Pilsners which make me so happy!! (I almost said so hoppy there, but realized I couldn't live with myself after that pun) <br><br>The food there is SO good! We stopped in to check out the new releases and had the best appetizers. You MUST have the duck fat popcorn. Its so addictive and a perfect beer drinking snack. In fact, it was probably the reason I had more beers than expected... Sure I'll blame it on the popcorn. That's it... <br><br>Plenty of seating, but it gets very busy so if you are going get there early or off hours to pop in for a beer. On your way out check out their great swag. They have some great tshirts and glasses.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/5cMJoEjzDPUPoTbpJ41Kww/168s.jpg", "caption": "Duck fat popcorn!!"}]}}, {"review": {"des": "Revolution is an extremely popular neighborhood spot with delicious beers and great food. They have a lot of space and a great atmosphere, the crowd is generally younger professionals since it's kinda in-between Logan Square and Bucktown. The food is pretty good, definitely try the bacon fat popcorn and you won't be disappointed.", "pics": null}}, {"review": {"des": "Might never return ( for the burgers at least).<br><br> My bf & I went to Rev last Sunday and boy what a disappointment. We go once or twice a month and have been going for many years now. I ordered the fish & chips (per usual) and he ordered the working man on this day and he was very disappointed w what he received. The  working man burger is usually a nice sized juicy burger but on this day it was more of a thick cut piece of cardboard. It was dense, chewy and kinda greyish. <br>At $13 a burger he thought he could have gotten something much better.<br><br>My fish & chips were ok at best. I've had better from them. My portion of fries was also a bit small. <br><br>** Besides that Rev is actually a really great place to grab a drink and people watch. Great service and awesome beer.", "pics": null}}, {"review": {"des": "Well, I've been all 'round this great big world and I've had all kinds of fish 'n chips, but I wish they all could be THESE fish 'n chips! ...sorry, that wasn't even a good reference, but seriously. one of my favorite things to do is share an order of fish and chips and a salad with someone so I've done it a LOT and these fish and chips were transformative. I actually shared a burger instead of a salad this time and the burger was great but not nearly as life-changing. The side salad is spinach-based, though, which I thoight was awesome but you might not be into it. Anyway, I'm super anti-social and this place was a bit much with how busy it was, but the fish and chips were worth it so.", "pics": null}}, {"review": {"des": "Great brewery in this neighborhood. Not that I really know the area. <br><br>Whilst visiting partaking in local fancy, we were ripping it up having drinks and having a grand ol' time. Food was superb, staff were pleasant, and beers were ice cold and delicious. This place was down the street from a friends place. Would love to visit again.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/5asvmFkjRYvchWlY_i9Zgg/348s.jpg", "caption": "Look at these crazy guys!"}]}}, {"review": {"des": "This is a fun place to eat and drink with friends or a date! Obviously the beer is good, but the food is also great. I like their pizzas. Good service and prices.", "pics": null}}, {"review": {"des": "This is such a fun, chill brewpub. I love the layout - particularly sitting in a booth at the upper-level and looking down on the bar below. Super cool. People brought kids and babies and they totally fit right in. There's a LOT of bike parking right out front.<br><br>I also love the friendliness of the staff. I paid $25 for a membership which gives me (among other perks) the use of a large beer mug for my in-house drinks. An example of the cool friendliness is that the server gave Baramee C a special big mug too because she was with me. The server also helped me select the food I ordered and a growler.<br><br>Unfortunately, I did not really care for my food (fish and chips). I wouldn't order it again. I'll be back to try more menu items; however, I'd sooner go to the taproom on Kedzie.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/EYPU3cVA54-6CyEOAM3alA/348s.jpg", "caption": "Fish and Chips"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/hUkuNgdnnNfp4zxPBEZa8g/168s.jpg", "caption": "Fish and Chips"}]}}, {"review": {"des": "Full disclosure- I didn't actually order anything to eat which was a big mistake because everyone's food looked amazing. The cocktails were solid, if you're a gin drinker who likes drinks on the less sweet side like me, the Grapefruit Collins is for you. And if you're not a beer drinker- Call Me Ishmael is an innnnteresting one, hardly tastes like beer. One of the ingredients is aged in gin barrels- and I'm all about that. There was a gin on the menu I wasn't fond of though- Deaths Door. If you're more of a Hendricks drinker I'd stick to what ya know's good.", "pics": null}}, {"review": {"des": "SERVICE: The service from the bartender upstairs was a little steely, but he certainly got the job done no problem. I may be a little bit biased having come directly from Goose, where the atmosphere was a little more bright. <br><br>DRINKS: Obviously the drinks are awesome, if you like beer. There's a huge selection of the entire Revolution portfolio, and the bartender is willing to let you taste before you order. <br><br>You can mix and match the tasters which is nice instead of having a pre-determined flight.", "pics": null}}, {"review": {"des": "There was a line out the door when we got here! The place was super crowded and their were kids everywhere. Babies to toddlers to young children - I've never seen so many children in a brewery.<br><br>I can't tell if they offer flights or not, as everyone seemed to have full glass servings of beer. They have a shuffle board and give free tours which is nice. Our group each had a beer and then we headed on out.<br><br>It was pretty hectic on our first visit here, so I'd prefer to come back on a slower/quieter/less-kid-packed day.", "pics": null}}, {"review": {"des": "My husband had the workingmans burger and it was amazing.  I had the rib tips and eh it was so so. They were hard and salty.", "pics": null}}, {"review": {"des": "Cool taproom for one of the biggest breweries in Chicago, if not the biggest. Weekend nights can get packed so be sure to get a reservation, or just sit at the bar. All the classic beers they have on tap, plus some that I hadn't seen before. They also have a full liquor bar. Full food menu, a bit pricey I thought, but I got the grilled brussell sprouts appetizer and they were so good, and a full meal in of themselves. Good service, good decor, hope to be back at some point.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/wzbGnd_1Z4eVY1T6rzvo7A/348s.jpg", "caption": "Grilled Brussel sprouts"}]}}, {"review": {"des": "I was in a party of 6. We ordered a few appetizers, drinks and entrees. The fried cheese curds were quite good. Someone accidentally dropped the bacon popcorn and broke a plate. The waitress, Kaytee, immediately offered to give us another helping of it even though most of it was eaten already. The customer service was great from start to finish. <br><br>Myself and another person at the table ordered an Uncle John's cider that turned out of be out of stock. Then myself and that same person ordered the rib eye steak and we were informed that they only had one rib eye left, so the other person at my table went with the NY strip. Both our steaks were cooked right, but very underwhelming. They were covered in a tasteless gravy. Mine had a lot of gristle. I was pretty disappointed that the hotel steak I had the night before was so much better. Two people at the table ordered blackened pork chops and they stated it was delicious. The pork chops and the good service from Kaytee are the only reasons I'm giving 3 stars instead of 2.", "pics": null}}, {"review": {"des": "I really wanted to LOVE this place- as I am a huge advocate for breweries expanding into the restaurant side- However, I found that the menu was really missing a wow factor.<br><br>If this review was based solely on the beer- they would get 5 stars. The beer selection is great. Several different styles to pick from, and the servers are really knowledgeable about what pairs well. <br><br>When it's busy, it can get pretty packed and your wait can exceed an hour if you just walk in. <br>Would definitely come back for the beer and sit at the bar.", "pics": null}}, {"review": {"des": "Revolution Brewing is an awesome spot in Logan Square. My friends and I stopped in on a Saturday afternoon, and I was surprised that we had to wait 30 minutes for a table. They have a nice waiting \"lounge\" area where you can order beer from a server, so we had a beer while we waited. <br><br>The beer and food were both very good - food was exceptionally good for a brewery. We tried the wings (good & spicy with fantastic potato salad as a side), zucchini cakes, and perogis. <br><br>You can order a pint or a taster and even better a growler to take home. Revolution Brewing is a great place and I will definitely be back.", "pics": null}}, {"review": {"des": "Loved it! Everything was great. Good bar food. Great fried cheese curds. Fish & chips is delicious as well. Highly recommend.", "pics": null}}, {"review": {"des": "The beers and food at Rev Brew are delicious, so if you're looking for a spot to get some grub and drinks, look no further.<br><br>I wanted to write a review for their special events staff however - earlier this year, we had our wedding ceremony and reception at the upstairs lounge and IT. WAS. SO. AMAZING! They really know how to throw a kickass party. Our guests all raved about how good the food and beers were! Steph was our event coordinator, and she made the whole planning process a breeze! Did I mention we were planning the wedding from out of state, 2 time zones away? Yep, and it was still super seamless. Below are some reasons why you should go here for your next special event:<br><br>1. Steph is super nice, well organized, and very responsive to emails. She has answers to ALL of your questions. Meghan was our day-of party captain, and she was equally professional and well organized! As an example of their niceness, we planned to bag up our gift bags when we dropped off our decorations the day before because we had bought merchandise from them to include in our gift bags.  They said not to worry about it; they would take care of these gift bags. That was so kind of them to do it; they didn't have to! So instead, we enjoyed a couple beers downstairs since we were done with our errands before the big day, which they then comped. Seriously, Steph? You're the best. Around.<br><br>2. They have a list of vendors available. Pick from that list if you don't have favorites already. We used 3 vendors off of their list and couldn't be happier with the services.<br><br>3. The 2nd floor is gorgeous. Beautiful wood paneling, intimate tea lights. You don't need a lot of decorations to make the place look nice. Less is more definitely worked for us.<br><br>4. The food and drinks are SO GOOD! They offer a variety of menus and upgrade options, plus kiddie meal options. You can also add more desserts and late night snacks if you want. They also have a 2 layer cake available that they make in house. The cake (chocolate cake with vanilla frosting) was my favorite dessert that night... I wish I could get the recipe... could I?<br><br>5. The waitstaff and bartenders that night were on point. They were so accommodating, especially toward the little kids in attendance. Milk and juice from the bar! We smelled a minor mishap with a tea light on a guests's table during our first dance, and the staff were all over it. We had so many desserts leftover that they boxed them up so our guests could take some home. At the end of the night, they even packed up our decorations and brought the boxes downstairs. Service is about all the little details, and they nailed it.<br><br>6. We loved that we were able to have the ceremony and reception at the same place. They do a fabulous job of rearranging the room for the reception - they offer a brewery tour for your guests during this time. Unfortunately we missed out on this tour since this was also portrait time, but we loved having that as an option for the guests.<br><br>7. Pricing worked within our budget, especially for a ceremony/reception combo. Everyone had a blast, and everything was so well done! The whole evening transitioned seamlessly. They are truly professionals! <br><br>Thanks Rev Brew for helping us celebrate a wonderful moment in our lives.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/58VBSbkH4STFwbp5s4Muug/348s.jpg", "caption": "slices of the best wedding cake & the rest of the delicious desserts! ANGELA RENÉE PHOTOGRAPHY https://www.facebook.com/AngelaReneePhoto"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/u8wbszqIZgmb9Ymm8CJoDw/168s.jpg", "caption": "falafel ANGELA RENÉE PHOTOGRAPHY https://www.facebook.com/AngelaReneePhoto"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/QNexOva3nvDvBTunBiVIWQ/168s.jpg", "caption": "bruschetta ANGELA RENÉE PHOTOGRAPHY https://www.facebook.com/AngelaReneePhoto"}]}}, {"review": {"des": "Revolution might not be my favorite Chicago brewery but having this spot in the neighborhood is fine by me. Decent burgers, decent craft beer, and a 5 min walk away. Can't complain!", "pics": null}}, {"review": {"des": "Revolution has a beer selection with a wide variety of styles, so something for everyone. Their IPAs and PAs and other lighter brews are better tasting than their stouts. Love that you can mix and match any number of tasters or choose a larger size for drinking.<br><br>What makes this brewery stand out amongst other local ones is their food. They go beyond typical pub grub, like pizza and fried cheese curds,which they do really well! They also have Brussels sprout and cauliflower with fried yam chips dish that has a magnetic pull on your fork as you can't stop taking more bites. Lively ambiance, and still possible to have a conversation with small group of friends.", "pics": null}}, {"review": {"des": "I love Revolution Brewing. They are usually packed but have a lot of space. I've been twice, both times for special events. One was a Planned Parenthood event, and Revolution was super professional and supportive through the whole event, even taking a bit of a hit on their reviews here. Their event space is awesome and large. I went to a wedding reception here, and it was wonderful! The food is pretty good, but the beer is my favorite. Additionally, they are conveniently located near the L.", "pics": null}}, {"review": {"des": "This is a brew pub done right. Great vibe and good, friendly staff. Excellent assortment of freshly tapped beers and bar food with a kick. What more do you want on the outskirts of Chicago. Besides  downtown location!", "pics": null}}, {"review": {"des": "Nice atmosphere in a popular area of town. Food selection is specifically focused on pub fare with a few unique exceptions one of which is their version of a Pasty in the appetizers section, which I did not try this time but is on my list. The Brew selection is good, providing a wide variety, however for the uninitiated it is difficult to determine what some are w/o asking the server. Cute descriptions are fine once I know what we are talking about. All in all this is a fun place to hangout, have a burger/fries & a pint.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/a_XkNGAPbH_lzHmpljoeUQ/168s.jpg", "caption": "Burger & fries"}]}}, {"review": {"des": "I went recently on a busy night and had a seat at the bar. Good service from the bartender, who was able to share a lot of insight in the beer options.", "pics": null}}, {"review": {"des": "Coming from Beer City USA (Grand Rapids), my Chicago friends wanted to bring me to this local brewery. I was pleasantly surprised by the beer selections & food. Service was outstanding and beer was great. The Apiator was a perfect summer beer!", "pics": null}}, {"review": {"des": "I loved everything about this place from the atmosphere to the selection of appetizers and drink menu. They have the best in-house cider which I can't remember the name of at the moment. Although I do remember that it had a yellow pear on the label. Along with the Seiter I had some really good cheese curds with some jalapeño dip. The dip was just spicy enough to keep things interesting but not so much that I had to chug some water with every bite. This was somewhat of a family gathering. All in all it was a great time and I look forward to my next visit. I love that the waitress participated in our credit card roulette where we had them blindly select one of our credit cards to cover the entire bill. That was without a doubt the highlight of the night.", "pics": null}}, {"review": {"des": "We here the other night and everything was delicious! Hamburger, roasted Brussels sprouts, salad and fries.  Great beer! Back for brunch. Started off with bacon fat popcorn. Can't wait for the breakfast to come out.", "pics": null}}, {"review": {"des": "One of the three biggest breweries in Chicago is Revolution Brewing and this is the one that you need to visit. We went to what is called The BrewPub now but it was their original brewery. They still brew the beer there that is served on premises. They also have a more extensive food menu with true top notch quality ingredients. The bacon fat popcorn was a huge hit with us. As our bartender said, it is bacon fat, it is popcorn, need I say more. And he was right he didn't need to say more, it was delicious. We enjoyed all the beers we tried. I settled on a pint of Fistmas, a great winter seasonal.  We were very happy with our time at Revolution BrewPub, great food, great beer, and great people.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Tl5e9tfU5p2hJwFz_ygScQ/168s.jpg", "caption": "Bacon Fat Popcorn"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/EPV0DigOhjWrWPc1mYq_pg/168s.jpg", "caption": "Revolution BrewPub"}]}}, {"review": {"des": "Good atmosphere, always a lively environment. Impressive selection of drinks, beers and appetizers. There's always a crowd which tells you something about a venue. The brisket melted in my mouth! Literally to die for. Impromptu date Monday! Thanks!", "pics": null}}, {"review": {"des": "I've had some people tell me that this one of the best, if not the best brewery in Chicago. Since I had a couple days to visit, I figured I'd find out for myself. Being from Atlanta and having a lot a good beer accessible to me back home, I have to say I was very impressed with Revolution.<br><br>I really liked their venue and it was bright and open, giving it a more upbeat atmosphere. The service was pretty good and fast, and we got our flights pretty quickly. Since it was our first time here, we really wanted to try everything. All of the beers are very good, but the star of this brewery are the IPAs. The IPAs are ridiculously good and I'm not that partial to IPAs. Check out the Galaxy Hero, Jukebox Hero, Anti Hero, and Thee Destroyer. <br><br>If you haven't been here yet and you love good beer, do yourself a favor and check it out for yourself. You won't be disappointed.", "pics": null}}, {"review": {"des": "Went to the \"Oktoberfest\" that this brewery hosted last weekend, and it was incredibly disappointing. This fest had nothing to do with the traditional Oktoberfest, it was just a regular street fest. They probably just use the name \"Oktoberfest\" to attract more people. It was a bad joke. Loud rock music and beer does not equal Oktoberfest. The beer was decent but would definitely have preferred the original beer from Germany. Definitely not going again!", "pics": null}}, {"review": {"des": "Soooo due to miscommunication with my friends, I ended up here instead of the Revolution Brewery on a Saturday. Though we had planned to do a brewery tour and tasting at the actual brewery, we stayed since they had a booth large enough for our group of 5 and we just wanted to day drink anyway. <br><br>The beers here are affordable and delicious and I loved that you could order small tastes. Maybe I missed it on the menu, but I would have loved to do a flight or sampler of a few different beers. <br><br>One word of caution, I was taken in by the sound of bacon fat popcorn but was pretty disappointed. For $6 we got a small bowl of popcorn covered in cheese and bacon. Ya sure that sounds amazing, but it was nothing compared to the huge doughy pretzel with cheese sauce my friends ordered. So get the pretzel and don't be deceived by the promise of bacon (full disclosure: I still ate all the popcorn and just ordered my own pretzel because I have zero self control).", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/mI2WzFxeHoTOlYMT_CwbWQ/348s.jpg", "caption": "Bacon popcorn and pretzel."}]}}, {"review": {"des": "I wanted to change my rating from 4 to 5 stars with my last experience. The staff was awesome, came in before they were getting ready to close. Bartender gave us a few beers on the house. Great staff, great beer, great food.", "pics": null}}, {"review": {"des": "Wow.....for a brewery, this place has some banging food!! My fiancee has been coming here for the past 10 years and he is always going on and on about the wings and potato salad. So finally, I decided to give it try and OMFG...I am so in love with this place!<br>While they do not take reservations, prior to your arrival I strongly suggest you add your name to the waitlist via Yelp. Not only can you add your name to the waitlist, but you can also check the current wait time. I added our party and by the time we arrived on a Saturday around 7:10, our wait was only 30 minutes. They have an area upstairs as well, but the menu is limited, so depending upon what you would like to eat, make sure you check out both menus and compare.<br>We wanted to dine downstairs, so while we waited we had drinks upstairs where seating is first come first serve. I had the raspberry cosmonaught and the gin collins and while both were fab, the gin collins was the hit in our group!<br>Right at 30 minutes, I received a text message stating our table was ready and as soon as we were seated, we ordered the following:<br><br>Apple smoked wings<br>Cheese curds<br>Fish and chips<br>Beer mussels<br>Pan fried brussels sprouts<br>House pretzel<br>Cauliflower gratin<br><br>Everything was so the <a href=\"/redir?url=http%3A%2F%2Fbomb.com&s=bb4f996415a9c2f21137e27cfb68f439a48cec2652b53e9b50dd7e766dbe177e\" target=\"_blank\" rel=\"nofollow\">bomb.com</a>!!! That damn potato salad was the best I have ever had and that speaks volumes as I have always sworn by my mothers. <br>I am not the biggest wing person, but these knocked my socks off! I so wanted to order a house pretzel to go, but after much will power, I was able to resist. While my diet kicked in the next day, I am counting down to my first cheat day so that I can go back!", "pics": null}}, {"review": {"des": "I've been here many times and it's become a favorite place to grab a draft beer and relax in a comfy atmosphere. It helps that it's within walking distance but even if it weren't, I'd probably still find my way here. Yeah, the beer is really good. We've always had great service and attentive bartenders. And I could drink their Anti Hero IPA all day long. Well, not literally but you get the point. I like it. As a craft brewery I give them a solid 5 stars. <br><br>The food usually leaves me wanting though. Sure the menu is impressive with great sounding burgers, pizza, apps, pretzel and the bacon fat popcorn which is killer!! The pizza is good as well. I tend to gravitate toward the burgers and maybe that's where I've made my mistake. The Workingman burger with beer onions, cheddar cheese and bacon is one I've ordered multiple times. Yep, it tastes really good. But I always end up with an upset stomach an hour afterwards. Maybe that's not their fault but it's what happens. In fact, I won't order that burger any more. But that beer? Oh yes. One more please.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/YALtCQsw3oYWh9sBsljd-w/348s.jpg", "caption": "Tap handles"}]}}, {"review": {"des": "So, I'm visiting from Cbus with this brewery on my short list.  Keep in mind, Wolf's Ridge is the benchmark.  With that in mind, Revolution is on point food wise with my Apple Smoked Wings and Potato Salad. The rest of my group was thrilled with their burger and mussels. Love the atmosphere and the service was exactly as I would expect - fun and on point.  Most def will be back!!  My beer of choice will always be their Anti - Hero. I love the description- an American hop assault for all the ambivalent warriors who get the girl in the end... I married her 18 years ago.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/y8Kzg6vE4bvHGUIsSg6Osg/348s.jpg", "caption": "Top RT to LT... Eugene, Straight Jacket & Working Mom.  Bottom LF to RT... Cross of Gold, Rev Pils and Fist City."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/j-4VQ10Hnk06xoHaMVMyvw/168s.jpg", "caption": "Top RT to LT... Eugene, Straight Jacket & Working Mom.  Bottom LF to RT... Cross of Gold, Rev Pils and Fist City."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/GR-fVW2YCovdF8bGrmLUFA/168s.jpg", "caption": "Revolution Brewery Fists!!"}]}}, {"review": {"des": "I make sure I stop by this brewery everytime I'm in Chicago. Great pours, friendly staff, quick kitchen service. What more can you ask? Tee's are reasonable too at $15 to $20. I know Half Acre is the more acclaimed brewery in Chicago but having dranked at both multiple times, Revolution is my hands down fave", "pics": null}}, {"review": {"des": "Always good food, beer, and energy. Can't resist the arugula pizza and a pint of Bottom Up Wit or Cross of Gold.", "pics": null}}, {"review": {"des": "I loved this whole neighborhood and the chill vibe.  The beers were definitely distinct and had great flavor.  We love visiting local breweries (big and small) when we're in a new city, and this was one of the best we tried in Chicago.  Oh, and it's right around the corner from the \"Greetings from Chicago\" mural, so make sure you stop there for a photo op!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/e8e9b4j8ZL4eej0rBYBmeQ/168s.jpg", "caption": "Flight at Revolution Brewing in Chicago"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/35CukxEXX11fSoBMVMeUtQ/168s.jpg", "caption": "Revolution Brewing in Logan Square, Chicago"}]}}, {"review": {"des": "Great beer, casual atmosphere and the food was excellent. I had the BBQ platter and my wife had the a Hawaiian burger. It was really good because they made it with a fried pineapple cream cheese. I think thats what was in it. It was sooo good. The E. Norma Gene and Triple fist were two of my favorite beers ever. So darn good. I had to have 2 of the E.Norma Gene's.", "pics": null}}, {"review": {"des": "I went back today ... bartender was decent !!! As soon as I sat my stalker sent some white dude that ordered a coffee manipulating the bartender and some white chick with that flea market outfit sitting by the window manipulating everybody ... they both decided what time my food was gonna come out... and the Mexican host he walked outside pretending he was doing his job... running his mouth about me with some ppl that were ready waiting for me outside to come out .!!! This is what this former athlete does everywhere ... since his ex wife divorced him for being a cheater he got no life.... the only life  he got is go around and run his mouth about me just cause I don't wanna be with him ... he just stalking me at every single restaurant bar club all over US", "pics": null}}, {"review": {"des": "First off, I love Revolution's beers so I had to visit the taproom when I was visiting a friend in Logan Square. The location is great and the taproom was cool on the inside, but I was a bit disappointed with the service. We did visit on a Friday night, so it was a bit busy, but multiple bartenders walked past us multiple times before we even got our first drink. On the plus side, the fries were super cheap if you need a late night snack.", "pics": null}}, {"review": {"des": "I didn't eat the food so can't rate that. I ordered a flight since I was visiting Chicago and wanted to see what there draft was about. Chicago Fire was the best. I never had a beer that tasted so smoky.", "pics": null}}, {"review": {"des": "Came here on a Saturday afternoon and so many people were here already! Had heard good things and saw so many good reviews on yelp that I had to stop by. I ordered the Cross of Gold and the Egg in a Hole. Egg in a Hole was wonderful and very satisfying and filling, but nothing impressive. The middle of the toast is cut out and the egg is fried in its place. I replaced my breakfast potatoes with fries and decided on the sausage to be my side. I enjoyed the beer a lot more than I thought I would. It was a light beer that had some really small hops at the end that didn't linger TOO long. I also tried some of my friend's Ace Pear Cider and it was absolutely delicious, reminding me of a jolly rancher! I would definitely come back to try more of their beers!<br><br>The service was really eh. After dropping off our drinks and food, the waiter only came later to bring the check while also asking us if we wanted another drink. She never even came to ask if we wanted more water. However, my friend left her phone by the window and one of the waiters actually ran out yo catch us and hand it to her!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/BKOPV7AVPEmTtOb24uzBUg/168s.jpg", "caption": "Applewood smoked wings"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/jKkGgbqxM7UVnaPk39Wi_A/168s.jpg", "caption": "Egg in a Hole"}]}}, {"review": {"des": "Yes! This place had great vegan options! Was very happy to find it. We had the cauliflower, potato chips  and a beet burger!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/-M6gK8-8LyNFZ45WX0pl8A/348s.jpg", "caption": "That beet burger!"}]}}, {"review": {"des": "Good crowd, not too loud for conversation. The beers here are insane. Some unique menu items, some average bar food items too. I have been a fan of Revolution and buy their beer for a while, and their brewpub did not disappoint. The only disappointing thing was the bacon fat popcorn. It lacked a lot of flavor or moisture, kind of tasted stale. Burger and fish&chips were delicious. There is a brunch menu available as well for those with an earlier start to their day.", "pics": null}}, {"review": {"des": "its taken me forever to finally get up here. For a monday the place was pretty darn packed. Good sign right? right! Im a huge fan of Rev brews so I was kind of in heaven you know, i'm sure heaven has a brewery and there definitely has to be some revolution on tap. Kid in a candy store type of vibe, I tried probably 3 or 4 beers during the course of the meal. Oh and my meal, the monday bbq special even came with a beer. And that was $15, so winner winner ...<br><br>Everybody seemed to enjoy their meals. The menu is simple but truly hits all the marks. Something for everybody, now i have to make my way back up here again and try more.", "pics": null}}, {"review": {"des": "Definitely a fan of the Revolution beers and have been wanting to check out this spot in Logan's Square! I went with a group of friends for brunch. For a beer to go with brunch, I chose the District North Line. Very good IPA that went well with a protein-filled meal. Usually I go for the Anti-Hero, which has always been a favorite of mine. <br><br>I had the fried egg and pork belly sandwich that came with a side of fried breakfast potatoes. Great flavor and very filling! The prices were very reasonable and the portions were big.<br><br>Overall, a great brunch spot! They also serve lunch and dinner. Will have to return to do a brewery tour!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/lqZ2pJJ4_tz83ZpslIpzXw/168s.jpg", "caption": "Fried egg and pork belly sandwich with breakfast potatoes. The beer was District North Line."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/QObhyZaUENrxpEpTUKR9MA/168s.jpg", "caption": "List of Revolution brews!"}]}}, {"review": {"des": "Revolution Brewery is a terrific brewpub and production brewery in Logan Square, with delicious food, ample selections of beer, and lots of Communist puns. I've eaten here about a half dozen times and always enjoy the visit. They even offer a weekend brunch, which is incredible.<br><br>Anit-Hero IPA is very good, but I especially like the Eugene Porter. It is a full bodies beer with heavy malt flavor, but nice dry finish. I could enjoy a session of multiple porters served alongside the mussels. I'll go again every chance I get.", "pics": null}}, {"review": {"des": "My expectations for Chicago breweries were heightened after my visit to Lagunitas, but even if I hadn't been there first, I would have been just as disappointed by my experience at Revolution Brewing. The hardcore and IDGAF vibe didn't sit well with me from the moment I walked in. The staff members really didn't seem to care about providing friendly and professional service, but maybe that's their culture. REVOLUTION!!!!<br><br>There was a pretty good selection of beer, though it took forever to get any of our drinks, because the place was so huge and understaffed. Or everyone is just slow. Same went for our food. My boyfriend and I ordered a few items, including french fries, calamari, and burnt ends. By the time they reached out table, I forgot I even ordered them. The fries and calamari were not my favorite, but I actually really liked the burned ends, which consists of twice-smoked brisket and BBQ baked beans on top of Texas toast. Amazing.<br><br>In the end, I would have been better off ordering Revolution beer from a halfway-decent restaurant or purchasing bottles from the store for at-home consumption. After several interactions with our waiter and other staff members, I couldn't wait to get home. No one seemed like they enjoyed working there -- why would anyone want to be served by people like that? Great beer but poor experience at the actual brewery. Boo!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/p64xHBnz43YXkqmUJkKdMg/168s.jpg", "caption": "Burnt Ends"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/oQuaVLjtqP4Erd-Ck6OQRg/168s.jpg", "caption": "Calamari and Fries"}]}}, {"review": {"des": "This brewpub is a fairly established mainstay in Chicago but has a modern design and atmosphere. Even this far out, many runners have the same idea and the wait is a bit longer than normal. At least it gives us time to sample a few of the extensive list of beers they have on tap, brewed here. I particularly enjoy the Oktoberfest brew since it is the season after all, as well as an American Pale Ale, the style I always find tastes best after a long run. It must be the electrolytes in the hops or something. Science! We hang out for a long time at the brewpub, enjoying some incredible fries that the boys mostly steal from me, and massive burgers that I can barely finish. The beer, however, I do finish.", "pics": null}}, {"review": {"des": "Revolution Brewing is always packed, and after visiting a couple of times, I see why.  This pub deserves the praise that it gets for both their beers, and their food.  Since they don't accept reservations, prepare to wait, or come at a very off time of the day.  Considering the fact that one of their most popular appetizers is bacon fat popcorn, this is not the place to come if you are dieting.  Almost every food dish is decadent.  <br><br>Most of the beers are available to purchase in sample sizes to try  This is ideal for someone that would rather try small amounts of different types of beers and not get stuck with one they hate.  <br><br>I like the fact that this restaurant puts their own spin their menu items. The only appetizer I've had here was the bacon fat popcorn, and it was just as delicious as it sounds. I've had both the hombre burger, and the roasted tomato pizza here.  The burger was good, but I liked the roasted tomato pizza even better.  The ingredients on this pizza went well together, and I had enough for left overs. The service is okay here, but the waiters have not been that attentive. I'm assuming this is because of how busy this restaurant is.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/qKv4XP4BFGcvVpIzyd6ZNw/168s.jpg", "caption": "Roasted Tomato pizza"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/3Yi1T0-H1q9FOFpotJUuKA/168s.jpg", "caption": "Hombre burger"}]}}, {"review": {"des": "Revolution brewing on milwaukee (not to be confused with the taphouse on Kedzie which does not serve food) is an awesome hot spot in Logan Square! The best part is the beer!! Their beers are amazing and my favorite, Rosa, is unfortunately seasonal but thankfully I can always get an anti-hero!! What makes this place stand out and worth the wait (usually an hour long wait) is that the food is really good!! Thankfully u can always squeeze up to the bar or go upstairs to the bar (not always open tho) to get a great beer while waiting. We always get the pretzel appetizer and have tried the pulled pork, burgers and fish and chips and they don't disappoint!! Service is always great, attentive and not pushy as u can keep drinking at ur table after dinner!! This is a favorite place for celebrations and out of town visitor!!", "pics": null}}, {"review": {"des": "We had Perogies and Fish and chips. My lunch was fantastic. The fish was the right amount of crispy and flavorful. The coleslaw was my favorite, nice and spicy. It went perfectly with the fish. The Perogies were also delicious with Brussels sprouts, cabbage, cream and apple sauce. Our server was attentive but not overwhelming. Worth the drive in.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/3b0wqWy3s_zKplAqipJ_DQ/168s.jpg", "caption": "We had Pierogies and Fish and chips."}]}}, {"review": {"des": "Fun place to grab dinner and drinks.  Obviously the beer list is great, but also the food is generally quite good too.  Last time I was there I had a pierogi dish that was amazing.  Sadly, our dessert was a little bit of a let down but overall I was quite pleased with the experience.  I have run into longer wait times on the weekends but it seems coming on a week night there usually is no waiting.", "pics": null}}, {"review": {"des": "I've come here for brunch, lunch, and just beers.  Pretty happy with every experience.<br><br>I've found that, generally, the staff is friendly and attentive.  On one visit, the bartender spent a long time talking to a regular while I was waiting to order.  There are ways to extricate oneself from such conversations while keeping the regular happy.  I think the bartender just needed some pointers on that front.<br><br>The last time I was there, I had the chicken salad sandwich.  It wasn't really a sandwich because it was too much to pick up and eat.  I also found it had too much vinegar for my taste.    Others may disagree.<br><br>All in all, I really like this place and plan to visit it as often as I can.", "pics": null}}, {"review": {"des": "I really wanted to love this spot, but I found it to be a strange experience. First and foremost, the neighborhood of this restaurant was booming with college-age folks on a Friday night. We walked in here around 9:30 pm and it was moderately busy, but we were able to get seated right away. The identity of this place was just completely lacking. I love the theme of the brewery itself, with their superhero arm beer taps and superhero names, and logo, and shirts, etc. However, the bar itself wasn't superhero themed at all or really themed in anyway that made sense. The music was incredibly loud, making it impossible to talk, but there was also no one dancing, so I'm unsure why it needed to be that loud in the first place. I tried a few beers- Fist City (pale ale- enjoyed this one), Family Man (a sour brown ale- do not recommend, the flavors did not compliment each other, making this quite strange), Galaxy-Hero (IPA- decent, but lacking the fruitiness that the description implied), and Chicago Smoke (Rauchbier- very smokey and overall pretty good, when paired correctly). I went with the pesto chicken sandwich and fries to eat. The chicken sandwich was ok, but nothing to write home about. The pesto was very good. The fries were tasty as well. Service here was just ok, not really friendly and they visited our table sparingly. Overall, our experience wasn't terrible, but I don't think I would visit again if I was in Chicago and I really wouldn't recommend if you don't have a ton of time to visit the city.", "pics": null}}, {"review": {"des": "Of the several breweries and brewpubs I visited in Chicago, Revolution was my favorite from a beer standpoint. <br><br>The bar was set up like a traditional pub with a ton of seating almost all the way around. We had to sit by the fists, just cause.<br><br>We only samples 8 (2 flights) but everything excellent. The Hero series (Crystal, Citra and Mosaic) were excellent IPAs. Cross of Gold, Loganberry and Rosa Hibiscus were also great. I can see why this brewery has won so many awards. I didn't love the Rise at first trying it after some IPAs, but as my palette cleansed, my rating on Untapped went up.<br><br>If you had to pick just one Chicago taproom for beer purposes alone, Revolution is the one to go with.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Be0XVZVpux0iN3_fFeKqdg/348s.jpg", "caption": "Joining in"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/grXN47NjRxbe7nxSEp3Qag/168s.jpg", "caption": "Great taps"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/feeIQbVeUzH6hrXPNJIZqg/168s.jpg", "caption": "Flight 2"}]}}, {"review": {"des": "Stopped by to meet a friend for drinks. It a nice space, quite roomy, lots of seating available. It's a rather large bar, which is nice... AND it's a full bar in case you don't like beer. And since it's a brewpub, other beers are also available.<br><br>I didn't have any food. I just took part in drinking some delicious beer. I had their saison and 1Z Enuff (which was really good, had nice balance - preferred it to Civil Unrest, though that was pretty good too). <br><br>Sitting at the bar was great (it's nice and big). The service was good. Servers were super helpful. Next time, I'm actually going to try the food.<br><br>TLDR: Get yourself there.", "pics": null}}, {"review": {"des": "This spot is one of my favorites in Chicago, badass food, amazing staff and most off you can't forget the tasty beers they brew! <br><br>Anytime I don't know where to go or feel overwhelmed with all the spots in Chicago to eat and have a beer. <br> I always find myself here and I am never disappointed. <br><br>Cheers!", "pics": null}}, {"review": {"des": "A group of us went here and had lunch. Once they sat us down we were able to order our meals. The food was pretty good I really enjoyed the Lemon Shandy beer. Price was not too bad.", "pics": null}}, {"review": {"des": "Delicious beer and a very cute location. Seats were very cozy and the place was clean. Waitress was very friendly and knowledgeable. My husband and I didn't really eat much when we were there we just had beer and some french fries. The fries were great! Next time I would make my husband get his own though because I don't want to share. <br>We will definitely be back! It looks like they have a fantastic menu. They also had drinks other than beer so if you have someone in your group that does not like beer there are other things to choose from!", "pics": null}}]}