{"name": "river-roast-chicago-3", "reviews": [{"review": {"des": "Situated on the river with gorgeous views throughout, this is a good place to enjoy some food and drinks while taking in the beautiful sights of the city.<br><br>Known for their family style roasts, you can get fish, roast beef, a whole chicken, or a rack of pork. We had a party of 6 and went with the whole chicken and the 24 ounce rack of pork.<br><br>For starters, a dozen oysters is a great choice. We went with 6 east coast and 6 west coast. Normally, I'd always say that the west coast is the best coast, but on this particular occasion, I preferred the east coast oysters. While they were smaller, I liked that they had more of a buttery flavor to them and didn't taste like the ocean.<br><br>We also shared the burrata and the shrimp and crab toast. The burrata comes with slices of candied quince on top, pomegranate seeds, pepitas and a small side of arugula. It was light and refreshing with a touch of sweetness from the quince. The shrimp and crab toast was a crab salad with a dollop of mashed avocado on top of a slice of crispy brioche.<br><br>The roasted chicken was easily the standout dish. It was semi carved tableside for us (they removed the wings, thighs and cut some of the breast before placing on it on the table). The chicken was incredibly moist, juicy and seasoned well. Every cut of meat had great flavor and moistness. The skin was golden brown, light, crispy and not oily.<br><br>The rack of pork was a bit of a letdown. It's a Berkshire pork and some of the pieces were really dry. The best was the belly, but there weren't many pieces to go around. The belly was flavorful, crispy and extra fatty. Every other cut was pretty dry and needed a liberal application of the sauce (amazing) to make them palatable.<br><br>The sides we got were a bit of a disappointment as well. I didn't like that the cauliflower had a curry sauce on the bottom of it. The cauliflower was a bit soggy and the curry was not a good combination. The brussels sprouts were also on the soggier side. It would've been better if they had leafed all the sprouts and then roasted them to make them crispy.<br><br>Service was excellent. Our server was energetic, informative and extremely helpful. We informed him we were celebrating 2 birthdays and an engagement, and he provided us with complementary ice cream and a giant slice of one of the most decadent and rich chocolate cakes I've ever had. He even took multiple pictures for us to commemorate the meal.", "pics": null}}, {"review": {"des": "Visiting from out of town- made a reservation, was able to sit outside on this beautiful afternoon. Service was... not great. We ordered appetizer and meals at the same time. The fried chicken bites(forget name) were amazing! And a good portion. They came out quickly, however, we waited 1.5 hours for the 2 salads and mushroom toast. The arugula salad also did not come out with all of the listed ingredients. Tables around us that came later were finished eating before we got our food, the waiter said he forgot to put in our meal, and then he said the kitchen was extra backed up. We then got our check and he said he would prefer to just split the bill 3 even ways rather than giving us our own separate checks for what we each ordered ....................  <br>would come back for the food and the view.<br>But for me in this case, service makes the review.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/b5MmAQ1BUhnb_bELhvGxQA/348s.jpg", "caption": "View"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/BImfY4wEe5xpbsgAAeTH9w/168s.jpg", "caption": "Arugula salad"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/qyok_EJNCg4R6FsrAL1lRg/168s.jpg", "caption": "Mushroom toast"}]}}, {"review": {"des": "I don't think there's a person in the world that enjoys writing bad reviews. Writing a bad review means you've had a poor experience unless you're the kind of menacing bastard that takes enjoyment from putting people down. Sometimes it doesn't matter how badly you want to enjoy something and be positive - it's simply that bad. <br><br>My friend, sister and I were looking for a place in River North to have lunch that had a nice view of the river itself. After a quick Yelp search we stumbled upon River Roast, which seemed to boast everything we needed and was only a few blocks from where we were standing. We walked into the restaurant entrance to find that we had to go down some stairs to actually get to the dining room. This place is HUGE. It would be a great place for large groups and special occasions. We weren't able to sit outside but we did score a table right next to the window so we could enjoy the view and air conditioning.<br><br>Their menu had a lot of different options that sounded good but nothing jumped out at me. My friend ordered the mushroom toast with brussels sprouts, my sister had the burger with the potatoes, and I did the sandwich of the day (Italian beef with lemon aioli) and a side of creamed spinach. All their burger also come with a side of house-made BBQ kettle chips.<br><br>My friend thoroughly enjoyed her food. They did charge her $3 to add goat cheese to her toast which I thought was a major rip-off. I wasn't a big fan of her sprouts either, but she liked them so to each their own. My sister ate her burger but she mentioned she was famished. She said it wasn't the worst burger she's had and it tasted just fine. Her potatoes were bomb though. She became full because she loved the chips and I finished off her potatoes. My food, however, was extremely disappointing. Chicago is known for Italian beef and I was intrigued by the idea of getting an upscale version. It was probably one of the driest sandwiches I've ever had. There was no flavor to the beef, and the giardiniera that topped it was working extra hard to save something that couldn't be saved. It took forever to flag down my server for extra lemon aioli, but even dunking the sandwich in the aioli couldn't resuscitate the thing. I ended up leaving 3/4 of it on the plate. The creamed spinach ultimately ended up being my meal because I wasn't impressed by chips either. You can only eat so much creamed spinach before tiring of the texture, but I ate enough of it to be sad-full.<br><br>We had a server but she was very hard to find. She took 10 minutes just to greet us, and once we had our food she was nowhere to be found until we were ready for our checks. I'm usually pretty forgiving if one part of my meal is sub par. If our server had been around more often to ask how my meal was, I probably could have squashed my concerns right then and there. Unfortunately I was never asked how my meal was and I was never checked on to see if everything's okay. I begrudgingly forked over $80 for two meals, one of which I barely touched.<br><br>I always try to at least give places 3 stars and find the positive in things. I try to be fair because I know people don't (usually) purposely screw up things. But sometimes, there's just no positives to report. This was one of those times.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/YV8HpXn0VZMkJiuYV-AELQ/348s.jpg", "caption": "Sandwich of the day, kettle chips, Coleslaw and creamed spinach"}]}}, {"review": {"des": "Had a lovely event at the River Roast tonight. All food was tasty. Mostly hit appetizers- flat bread pizzas a tons of different flavors. Tomato soup with grilled cheese. Mini stuffed baked potatoes. The service staff was great and bartender was wonderful. Nice venue to hold a party or wed dining. I didn't try the main restaurant. However - I will.", "pics": null}}, {"review": {"des": "Imagine this: mimosas, crispy potatoes, chocolate cake and a view of the Chicago River. <br> <br>That's what you'll get at River Roast (if you order well.)<br><br>River roast is perfectly situated on the river to give you not only a fabulous view, but a fun environment for food and drinks with friends. <br><br>My family met at River Roast for lunch to celebrate my dads birthday. As soon as we got there, the staff seemed excited to serve us. The server heard me mention mimosas and within minutes I had one in hand. For the meal, we split dishes because we weren't sure what to get. First, we had the chilaquiles....and wow. They were absolutely incredible. We were fighting over the last bite. Then, we split the special omelette. The omelette itself was just good, but the potatoes that came on the side were worthy of all the hype. They were perfectly crisped and seasoned. Finally, we split the hash. The meat in the hash was so flavorful, but this dish was not my favorite. It was pretty hard to rival the chilaquiles, if I'm being honest. <br><br>For dessert, we split the MASSIVE chocolate cake. We were shocked by how big it was when it made its arrival to our table. There were audible gasps from tables nearby. Alas, we cleaned the plate. Good chocolate cake is hard to resist. <br><br>We loved our experience at River Roast. And I am already hoping to be back on the patio for a fun and delicious brunch.", "pics": null}}, {"review": {"des": "We live across the street and we had yet to check this place out. We went last night around 630. We checked for reservations but nothing was available so we figured we'd stop in to see how long the wait was and/or if they had bar seating. As soon as we entered a nice the gentlemen at the front desk quick greeted us. We asked if by chance they could accommodate 2 for dinner without reservations and he said of course we can.<br><br>Our servers name was Oscar and OMG he was fantastic. He was quick and attentive but not annoying. I ordered Chardonnay and my husband got some gin drink which he said was good.<br><br>For dinner ordered the 16oz prime rib and sweet corn. The server asked about an appetizer but all I wanted was bread and butter which wasn't on the menu. He went above and beyond and brought us four slices of slightly toasted bread and butter. It was a very in's gesture. <br><br>The prime rib is served table side from a large portable buffet like station. It's medium rare (server told us this before we ordered it) but that's how we prefer it. The prime rib itself was tasty and more then enough for two of us to share. It was soft but a little hard to cut only because the knives needed sharpening for sure. I hate fat and it did come with a lot of fat but I was easily able to cut it off. Only negative comment I had about the prime rib was that it could have been warmer. It wasn't cold but it also wasn't hot either, it was luke warm as best. We told the server after we ate it and he was horrified that he didn't tell him before. We told him it wasn't a huge deal especially because we still ate all of it. We did recommend they should consider serving it on hot plate. <br><br>The sweet corn was the winner of the whole meal. It's Mexican stupid corn and oh so good. It's sweet, spicy and creamy. It comes out extremely hot so if helped with the warm up the prime rib.<br><br>They also accidentally brought us the whipped sweet potato. They gave it to us free of charge. They were a little more runny than what I'd prefer but other than that good. They had a very creamy and sweet flavor profile. <br><br>We ended the night with a chocolate cake because it was our anniversary. It was HUGE. Overall it was good but the cake could have had a little more moisture.<br><br>Overall a great experience will def be returning!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/6swaGTAkbqnaddthF7WKsQ/348s.jpg", "caption": "Sweet Corn"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/DjFpf21l_dHAQ4wYqtf-rg/168s.jpg", "caption": "Sweet Potato"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/wm9_os-mqVmiVyKW6nRHUw/168s.jpg", "caption": "Prime Rib"}]}}, {"review": {"des": "It is hard for me to spend a lot of money on a roasted chicken, but River Roast manages to be a popular destination for a unique family style roasted meat option in downtown Chicago. They are located on LaSalle and the River. Valet parking is available, but walking is much nicer. <br><br>The menu is best for sharing family style. You can choose two or three roasted meats, several sides, and drinks to share. They offer several punch bowls for large groups which is fun. The food is smaller than expected so definitely order more than you think you can eat. <br><br>We had a large group of 8 and destroyed a prime rib, whole chicken, whole fish, and some pork roast. The fish was the best served with fresh pork rinds. Unfortunately the chicken and beef were just average, and the pork was a bit too fatty for my taste. <br><br>The sides were really good. The creamed spinach was very good and popular. The fresh corn was served elote style and was also tasty. We had some fresh baked bread with a fried onion butter which was a nice touch. Some of the meats come with sides too, but not enough for everyone. <br><br>Service was spotty, but the staff managed to help out with elderly guests and a birthday cake slice. The restaurant is located below street level requiring lots of stairs or a long walk for an elevator. This can be a plus since you can eat at river level. <br><br>Overall, I get the popularity of River Roast. It's a fun concept in a great location, but is really expensive and not really a good value.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/d_x4ZQOXm9PLQl1sX4Dg-Q/348s.jpg", "caption": "Restaurant Entrance"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/xhSe4mUSuTR3sKQOtyUw0Q/168s.jpg", "caption": "River Front Dining Area"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/lV1Di8UK2UCUc3IawEw0uQ/168s.jpg", "caption": "Fish and Prime Rib"}]}}, {"review": {"des": "We only had time for appetizers, we got fried olives, which were good.  The pork meatballs, were just ok, the Boatload of vegetables was NOT a boatload, for 22.00 we expected a little more of it.  The chicken goblet (I can't remember the exact name) was just ok, they could have been from Costco.  <br><br>The Scotch Egg was different you get 1<br><br>I would recommend trying someplace else first, but maybe give this one a try when not out with out of town guests.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/w9xd5403w4lY_roTcRbo9A/348s.jpg", "caption": "Boatload of Veggies NOT"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/XrXSwGdJ8D_QmcprgrdtNw/168s.jpg", "caption": "Egg"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/hHCOqyIUvpqoaFwyvJPRnw/168s.jpg", "caption": "Pork Pork Meatballs"}]}}, {"review": {"des": "Friendly staff, quick service, food came out fast, but it didn't have a \"wow\" factor to it. <br>The drinks were ok, not very strong. <br><br>Might go back to try the dinner menu.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/GU4buryrviV9pczDSZ4y7Q/168s.jpg", "caption": "Summer in milan.. had to send it back. Not good."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/trVfI3_ik9XijrFl31zmTQ/168s.jpg", "caption": "Brunch Blues Burger"}]}}, {"review": {"des": "Came here for a friends grad dinner. Group of 8 who decided they wanted to order by couple. Not my call, and this is not the place for this (however there were some pescatarians in the group, which ultimately drove the decision). <br><br>The meats are large format all in the $40-50 range. I could see it being fun if you were with a bunch of meat eaters and ordered a few items, but to split between two people it was just overkill. We ended up going with apps. Nothing was that memorable, pretty mediocre food, but also nothing offensive. Corn on the cob was the highlight, and I would skip the meatballs. <br><br>My main issue is that it is egregiously overpriced for what you get ($130 for two, two drinks each). Speaking of price, this brings me to the wine list. Coming from SF, one of the most overpriced places to eat in the country, they are charging $16 for a glass of Copain Rose. A rose I am very familiar with, and standardly in a San Francisco restaurant is about $13 or $14 a glass. <br><br>From what I can tell the dining scene downtown Chicago is pretty poor and very tourist driven. I wouldn't come again, but could see it being fun if you were with a big group and looking to get your midwestern meat sweats on.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/jYP7c0dSH1C2xXp5I7OuAA/348s.jpg", "caption": "Corn and meatballs"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/lhPFTctuYVpeT7h-u5IIlQ/168s.jpg", "caption": "Shrimp & Crab Toast"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/GihmA0P59sfwlQzbJ_23HA/168s.jpg", "caption": "Lamb Pastrami, I would skip."}]}}, {"review": {"des": "Stopped here on a Monday for a late Lunch.  IMO, River Roast has a lot going for it.  It's right on the Chicago River with a great view of the bridges, boats going by and buildings and Riverwalk on the other side of the water.  River Roast has 2 floors with both restaurant and bar spaces, but also some HUGE private event and reception areas, and a nice (though not terribly large) outdoor deck overlooking the river.<br><br>That said, this restaurant doesn't live up to the amazing potential it has.  For starters, it was nearly empty the entire time we were here, which is a shame as it really is a nice venue.  We arrived for lunch and were told they only offered a very limited happy hour menu that late in the afternoon, with only a few food and drink options listed.  While being escorted to our seats, we asked when the full lunch menu ended, and were told 2:30.  I looked at my watch and it was 2:31.  The hostess explained the kitchen quickly switches over to happy hour menu mode promptly at 2:30.<br><br>We waited quite a long time for our server to arrive, and to be honest, nearly got up and left just as she was appearing, as we were a bit disappointed in the limited menu and after being neglected for so long.   We both ended up ordering the burger with blue cheese and caramelized onions and one of the drinks from the happy hour menu.<br><br>The drinks were quite good and were generous pours, especially considering the happy hour price, and the burgers were also good when we first started eating them, but after the first several bites I ended up scraping off the remainder of the blue cheese, as it became too overpowering.   We did have 1 hiccup, as the server told us the burgers came with chips.  When they were brought to us, the chips weren't there, and the food runner explained that those were an extra side, available separately on the happy hour menu. When we reminded our server that we specifically asked if chips were included with the burger and were told they were, she quickly recovered by explaining she'd made a mistake and brought us an order on the house.<br><br>Our meal here was good, service improved after we were initially forgotten about, but it's a pity their full lunch menu doesn't run later in the afternoon.  It's also a shame that this place is so large, yet was nearly empty during our time here.  As mentioned above, it's got lots of potential especially with the amount of tourists, residents, hotels and businesses in the area.  It'd be nice to see River Roast make some strides to improve the overall operation a bit.", "pics": null}}, {"review": {"des": "RR exceeded my expectations. Amra is a charming and accommodating server and the food was spectacular. For 10 big young men and one big gal, we got one of each roast, (the large pork and large beef) and two chickens, plus the green beans, roasted cauliflower, and AMAZING sweet corn dish, and it was exactly the right amount of food. Everything came with perfect sauces and sides like fantastic roasted potatoes with the chicken. She kept our beverages full and was efficient without being rushed. Everyone got out to the airport in perfect time, full and happy. Highly recommend for a group like this! We had the little back room and it had a window on the river, very comfy. Will be back.", "pics": null}}, {"review": {"des": "We just stopped in for drinks - so my review can only cover that! Four of us sat on the patio on a warm end of summer afternoon and there are lots of tables, but we did ask to move to the shaded area. Great views of the river and good drinks and service.<br><br>We stayed for a couple of hours and enjoyed average to reasonably priced drinks and conversation at our table and with our neighboring table. Beer and wine that we ordered were good prices, and the cocktails were in line with what you'd expect in Chicago. Server checked back regularly and refilled water to keep us hydrated.", "pics": null}}, {"review": {"des": "Personally, I had a decent experience here. Unfortunately, we were not able to sit on the patio as it was all filled up..we still got to sit next to the windows and the view is amazing. I had the mushroom toast and Brussels sprouts for my meal. Pro tip: add goat cheese to the mushroom toast!!!! It added a whole new level. The Brussels sprouts were good and cooked in a honey sauce. Did not go well with my rosé but that was my own fault. <br><br>My friend got the sandwich of the day which was a roast beef sandwich with lemon aioli. She said the meat was very dry and could not finish it though she loved the creamed spinach she got as a side. The sides are very big and shareable which is nice. <br><br>Our server wasn't around much we were left wanting more water at times. All in all I do think i would return.", "pics": null}}, {"review": {"des": "So very impressed with River Roast! The staff was incredibly friendly. Our server who was also the bartender at the time was sooooo knowledgeable about every facet of our meal, including drink suggestions and menu additions. I enjoyed the Boatload of Veggies. We all enjoyed our meals and the beers (and cocktails) suggested to us by the waiter. I would absolutely recommend coming to River Roast!", "pics": null}}, {"review": {"des": "Set in a beautiful location right along the Chicago River, across from the booming river walk area, River Roast is a great spot. <br><br>They're known for their table side options but they're definitely meant for sharing. Choose a large serving of protein to share and pick a few sides to round it out. If you'd prefer to not share their are a few salad and sandwich options that my group also enjoyed. <br><br>The disappointments were our table side carved chicken wasn't actually craved. They cut off the wings but left all the actual carving of the breast meat to the table which was awkward since the bird was propped up. There also was a severe lack of decent veggie options. You'd need to piece meal some things together to come up with something resembling a decent vegetarian meal. <br><br>Overall it's a nice spot with great service, a beautiful location, and good food.", "pics": null}}, {"review": {"des": "I think this spot is great if you're looking to get a group or family together for dinner. Portions are huge and the food is pretty great. My family and I ordered the Roast of the Month (whole fried chicken), the street corn, sautéed mushrooms, and  the roast came with fried potatoes. <br><br>The three of us left very full and a to go baggie. But if you have a little space left for desert try the s'mores ice cream sandwich!<br><br>But I gave them 4/5 stars because it took a minute for the waiters to figure out who was assigned our table.", "pics": null}}, {"review": {"des": "Fantastic spot to hit up for a bite with beautiful downtown riverfront views. The service was excellent and attentive. The wine list was great. The oysters were succulent and fresh. The charcuterie board was so diverse- there was salty, sweet, vinegar, fatty, crunchy, smooth and everything in between. Highly recommend for an appetizers-for-dinner kind of night.", "pics": null}}, {"review": {"des": "Got invited to a wedding 3 months back. This rustic chic River North tavern was used as a wedding venue and reception overlooking the Mag mile. For that touristy downtown view, i already know this place is upscale/pricey and I expected a higher standard. Because of these reasons, my companion and I purposely arrived early to take pictures. <br><br>The natural light coming through the windows and plenty of candles made the perfect ambience to the place! At the riverside patio, i was swept away by the excellent view of the river, bridge, and skyscrapers! <br><br>The main food concepts are roasted protein meats and I ordered the beef dish, which was juicy and tender. One of the guests who was in my table ordered a fish filet was a good sport that the fish portion was small and was eating off her husband's beef portion. She even joked that the kids meal had bigger portion and appeared more appetizing than her fish.<br><br>My dinner companion and I ordered drinks, which the bartenders didn't know how to make it. So we told him to surprise us! The drinks were fruity and on point.", "pics": null}}, {"review": {"des": "I had my wedding reception at River Roast this past weekend, and it was fabulous! I spent months planning the event with Hilary Sauer and she was so helpful, responsive and easy to work with. It makes a difference when you can communicate clearly with the coordinator for the venue. Everything went smoothly. My guests loved the location and the food. I ate my entire filet mignon and sides - generous portion & so delicious! The guests ate the entire wedding cake because it was that good....The space is so beautiful at night that it doesn't need much decorations. We had candles and centerpiece flowers for the tables which was enough. I loved our wedding and highly recommend River Roast!", "pics": null}}, {"review": {"des": "Tried the lamb leg roast with a friend when I was in town for work and it was delicious! I love the concept of the restaurant with the roast being the main star. I can't wait to come back on a Sunday to try their rib roast.<br><br>I also remember their wedge salad as one of the stars and it ignited a love for wedge salads I didn't know I had.", "pics": null}}, {"review": {"des": "My first check-in and not my first time here. This is s family Favorite and I always recommend this spot! Everything I've tried is good...kitchen snacks, bites & boards, roasts (all of them esp. the featured roast) and sides. I love getting a table near the river and gazing...so relaxing! But the FOOD MAN!!!! They bring out the roasts and carve, carve, carve! It's so wonderful! As I wait on my friend, my mouth it watering! I can't wait! We get to share!!!!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/wYwRrEkgQBhZfxLALdzwwg/168s.jpg", "caption": "Come hungry and be filled! So much good stuff on the menu!"}]}}, {"review": {"des": "I had a pretty simple order- the rr chopped salad, no cheese, dressing on the side. The kitchen messed this up three times in a row! Finally got it and wasn't too satisfied with the salad, but oh well the view was nice. Though the patio wasn't even open on this beautiful day because of construction.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/SoFlSTj0qpLqzb_OSQZ2jg/348s.jpg", "caption": "RR Chopped Salad"}]}}, {"review": {"des": "Hostesses were great! Very friendly!! We walked in off the bridge side so entered through the ground level and that hostess radioed the river level host to alert her our party of two was coming down. She was very pleasant and sat us outside on this beautiful Indian summer sunny day in Chicago to enjoy lunch next to the river. <br><br>Our server was good, nothing notable. <br><br>Food was very tasty. My friend got the pork hangover soup - mmmm! I just got a salad because we had a big dinner planned. The salad was fantastic and perfectly filling for what I needed. <br><br>I unfortunately can't speak upon the meat dishes or entrees; yet!", "pics": null}}, {"review": {"des": "Who at River Roast woke up on the first warm day since Summer where all of Chicago is outside and decided \"What a beautiful day! Better close the patio for painting and not tell anyone today!\"<br> <br>My friend was in town visiting on Tuesday and I was so excited to take her to sit on the river at River Roast. I made a reservation and show up, only to be told that the entire outdoor seating area is closed for painting. Seriously? Did it cross anyone's mind to call the people who had reservations to let them know that? Not only did we waste our time going all the way over there, I had to scramble to find a place to take my visiting friend last minute.  I understand that \"renovations\" need to happen, but the fact that no one was even informed (or even really sorry - I'm looking at you, bored hostess) is absurd. Instead, we went across to The Kitchen and racked up a tab there instead. I'll be taking everyone there from now on.", "pics": null}}, {"review": {"des": "Best experience at the River Roast!! The assistant manager Josh and waiter were sooo nice and helpful. It was my Mom's first time and they helped us figure out the best options. I highly recommend the key lime pie. Thanks River Roast for an amazing time!", "pics": null}}, {"review": {"des": "Dining on their balcony along the river is quintessential Chicago. Live music plays during brunch, boats drift by screaming & blasting music and great views of the skyscrapers.<br><br>So the hostesses here are pretty terrible. They let a line of 10 people form while someone in the front looked over a menu to possibly order take out. Um, what? There are two of you, ask them to step to the side and help everyone else. This went on for about five minutes, everyone in line was getting frustrated and I finally went up to say I'm just looking for my friends, can I go find them? Really pretty terrible at handling situations and also they didn't say bye or thanks to anyone in my group when we left. Totally my pet peeve with restaurant hosts.<br><br>Our server was much better in terms of attentiveness & knowing her stuff, but I felt like I was being sold a used car, kept trying to add things in and a bit too much pressure in the ordering. So service here, could use a little work.<br><br>The bloody mary ($15)  is insane at River Roast! You get a skewer full of meats, cheeses and peppers in their spicy concoction. <br><br>The scotch egg ($8) was pretty darn good. I think the best part of the entire meal actually. Well, we also got a side of Nueske Bacon ($5) and I mean, you can't go wrong with Nueske. Thick, delicious and done well.<br><br>The golden gobbets ($10) were deep fried chicken bits and came with a little glass jar of honey. The chicken was mostly deep fried pieces and not much meat. The chicken was seasoned, but honestly not enough so. This dish sounded so great in theory but fell short for us.<br><br>With a name like RIver Roast, we were required to try something roasted, of course! We had the roast beef cooked medium rare and were happy with it. It wasn't mind blowing but just good enough. It came with potato croquettes which were also good, but not amazing.<br><br>River Roast is a great place for alfresco brunch on a beautiful day, but honestly you need go in knowing you'll spend some dough for just okay food & service. It's not bad by any means, but it could be oh~so~much~more!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/VxpUCjeJECzq9Z8PThmNng/168s.jpg", "caption": "Scotch egg"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/wIaf6ByRYQBJNg1OIhqDUg/168s.jpg", "caption": "Roast beef and potato croquettes"}]}}, {"review": {"des": "River Roast is an interesting restaurant. Huge indoor dining room, many areas for private parties and a small-ish outdoor river front patio. It also has a somewhat limited menu with the most amazing choices. The dichotomy is what makes this place so inviting.  <br><br>We had a great salad, delicious scallop appetizer and the beef. I wasn't sure what to expect but as it arrived on a butcher board with 2 fried mashed potato balls I was hooked. The chef knows what he is doing in that kitchen!<br>We did not order, but saw the fried chicken...next time!<br><br>Service was easy and helpful. I left feeling satisfied and cared for!", "pics": null}}, {"review": {"des": "I came for lunch on Memorial Day so unfortunately we didn't get a table outside. We just didn't want to wait. But the inside is just as beautiful! I'll just have to come again to sit outside and take in the gorgeous river views in the summer.<br><br>I had the fish sandwich and it was delicious. It came with bbq chips and coleslaw. My husband ordered the Cuban sandwich with the same sides and he said it was very good. They do not have a kids menu but will make grilled cheese or a plain burger. It's nice that they will accommodate you. For our son we ordered the chicken bites off the small plates menu and it came with honey. So delicious! My son ate it all :) Our food came out piping hot so you know they make it fresh to order.<br><br>The space is huge! This would be a great wedding, birthday, work event space for sure! I went to the bathroom and was astounded at how much room there was to host more people. And it's so warm and cozy with the decor they chose, dim lighting and dark browns. I also liked that you can see into the kitchen, it's not closed off into some secret room. So, yes I recommend and I will be back to enjoy a cocktail on the patio :)", "pics": null}}, {"review": {"des": "I came here with a couple of my friends for dinner and I must say that I wasn't blown away by the food. To start, we ordered the Toasts to share and the Golden Gobbets. All three flavors of the Toast were pretty good, but I think my favorite was the Gobbets. The chicken was perfectly fried and the interior was juicy. The honey added a nice touch.<br><br>For the main course, we ordered the Rack of Pork along with the Supper Club Mushrooms, Asparagus, and Curried Cauliflower as sides. The pork was way overcooked. It was dry and had a sour taste that made it very difficult to eat. The sides were all decent, but they were nothing spectacular.<br><br>If it wasn't for the discount that we received, this dinner would definitely not be worth it at all. Even with the discount, I still don't think it was worth the price. The main course, the pork, was just so lackluster that it will probably deter me from coming here again in the future. The best part of the meal was for sure the appetizers.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/pKNqoELbnsxrRaDTggtYqA/348s.jpg", "caption": "Rack of Pork-overcooked and sour"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/37DPxb5QXlsZEwxbpXSt0A/168s.jpg", "caption": "Asparagus"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/BD8Wj-tz7Qb8KGHc4ZpZtw/168s.jpg", "caption": "Curried Cauliflower-a little too charred for my taste"}]}}, {"review": {"des": "Great scenery right on the riverfront. Attended for brunch  food was really good, we got the whole chicken. Drinks were ok, the service was spectacular, I would only suggest a wider rang of sauces for dipping options", "pics": null}}, {"review": {"des": "I came here for brunch. It's in a nice location along the river with great views. The decor is very chic and comfy yet spacious. Our server was friendly and attentive.<br><br>For lunch I had the biscuits and gravy with eggs over hard. The biscuits were hard and dry. I prefer biscuits that are soft, soaked in gravy. Overall the dish was meh.<br><br>For dessert we split a piece of carrot cake which is big enough for two people ($12). There was lots of frosting layers on it. Overall the cake wasn't that good. It was too dry with too much frosting.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/u6gMI52DLwAAgO673SZzXg/348s.jpg", "caption": "Biscuits and gravy - meh"}]}}, {"review": {"des": "The food is great and River Roast works for both casual lunches as well as a more formal spot for a business lunch or event space. <br><br>I've been a couple times and if you're with a group, the large roasts are ideal - a whole chicken/fish/rack of pork. <br><br>Most recently I've had the cuban which was really good but very oily. As tasty as it was, I had to hold up the sandwich to allow all the oil to drip off the sandwich. I don't know if the oil came from the cheese or the pork or what, but as tasty as the sandwich was, next time I'll start by letting the oil drip off. But I would definitely get the Cuban again - the horseradish sauce and chorizo added an amazing twist on a classic.<br><br>Also had the golden gobbets which were superb - a great way to start any meal with some really high quality chicken.<br>Tried the fish sandwich recently as well but found it just ok; not bad by any means just nothing special. Beer battered cod was tasty but overall there are better options.<br><br>Views along the river also make for an incredible venue.", "pics": null}}, {"review": {"des": "I ate here with a friend from Chicago for its proximity to our tourism, expecting a commercial type spot. River Roast is nothing of the sort. The cocktails were deliciously strong; I'd come back for just drinks. The apps included shrimp and crab toast, a fantastic watermelon and prosciutto salad, burrata, and some outstanding oysters. We shared the table side whole chicken for our meal and left considerably full and pleased. Our server was helpful and patient with our indecisiveness. We shared a few laughs. The view speaks for itself and so should the experience of the diner. I would return in a heartbeat.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/NKDoeEr-IJnFIh7lUrgkPg/168s.jpg", "caption": "Beautiful view of the river"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/VfQ2K2k3a6EXZpXFTdeRHg/168s.jpg", "caption": "Great cocktail selection"}]}}, {"review": {"des": "Seriously enjoyed myself .. I believe Terrance, our server, was a big part of that - he was fantastic and then some! We had a variety of haps, and I marked my favorites.<br><br>So for starters:<br>Shishito Peppers - My favorite!<br>House Pickles - okay<br>Fried Olives - couldn't try because they were stuffed with chorizo, but heard they were great.<br>House Chips - least favorite on the menu<br><br>Main Roasts<br>Roasted Fish (mediterranean sea bass) - DELISH! <br>Roasted Chicken - MOSTLY DELISH.. <br>Low Boil - didn't have it because it had sausage, but my companions said it was quite tasty!<br><br>Sides<br>Carrots & Dirt - interesting name but tasty. The goat cheese and balsamic really made this dish stand out<br>Asparagus & Green Beans - nothing to write home about<br><br>Dessert<br>Peanut butter goodness - nice mix of sweet and salty<br>Carrot Cake - a bit too sweet for me<br><br>The ambiance was cool - collection of house cocktails has variety, and if you get lucky you can sit outside..we couldn't would have been 1 hour wait. And don't go to this place in a hurry.. the cool thing is they bring out your roasts and sides and carve it up to make it easy to grab and pass. When they carved the chicken it was so juicy.. The roasted potatoes at the bottom were a nice touch!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/hKW9D-jiROmxuleVg6_NHg/348s.jpg", "caption": "Peanut butter something lol"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/WEbYHPkC4Ba7WV1Xbx1FmA/168s.jpg", "caption": "Carrot cake"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/3F3UUhZUw3twioCjvFYM0Q/168s.jpg", "caption": "Roasted chicken"}]}}, {"review": {"des": "River Roast is a fine, fun place to bring a group of hungry business associates. Everything is big and built for family-style sharing. There are a very few healthful dishes, but mostly this is a place for overeating meat and potatoes and desserts. <br><br>The roast chicken is more show than substance. I think people love it so much because it's surrounded by decadent deep fried potatoes. <br><br>The grilled branzino (big fish) is excellent but expensive. <br><br>The roast pork is nicely brined and will serve a lot of people. <br><br>The desserts are notable only for their obscene size. We ordered one cobbler and one slice of cake for seven adults to share. We did not finish either of them. Neither was memorable.", "pics": null}}, {"review": {"des": "A unique restaurant perched along the Chicago river serving roasted meats in a family-style setting and carved tableside.<br><br>I made a reservation at this spot for our weekend in Chicago and came in with lofty expectations for a memorable one-of-a-kind meal but our experience left me wanting.<br><br>Pros:<br>-great location on the river with a number of tables outside (first come first serve, no reservations for outside as is the custom at most places)<br>-food-enjoyed the flavor of the beef and the \"dirty\" carrots<br><br>Opportunities: (based on our experience)<br>-service (even excusing the fact that our server was somewhat new) left me wanting-sat for an awfully long time staring at dirty dishes and empty water glasses<br>-food-manager came by after we sat down and hyped the pork-so we ordered it along with the beef-pork was very fatty, bland and a lot of waste<br>-left hungry despite spending $250 on dinner for our table of 4-VERY poor value for the money ($66 was a bottle of wine that was also lower quality)<br>-food the meats come with virtually nothing -beef , 3 small croquettes, pork 1 very dry corn bread muffin so you will need 2-3 sides to get enough food<br>-we were at essentially a bar table-half way between a regular table and a high top with small bucket seats that were very shallow forcing you to lean forward the whole meal.<br><br>Bottom line given the prices and lack luster service during our visit I can't recommend.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/VrXD6eTcrUcFVmW1Z27GKA/348s.jpg", "caption": "Great spot along the river"}]}}, {"review": {"des": "We went for Thanksgiving and it wasn't bad, overall, but the turkey was terrible. The only turkey available was white and very, very dry. When we asked if they had dark meat, or anything more moist, they said it would be another 25 minutes. We kept checking back for the next 30 minutes but moist turkey never arrived, so we moved on to dessert and left. We were really disappointed to not have decent turkey on Thanksgiving, especially when paying $60 a person. And surprising for a place specializing in roasts. Otherwise, the service, drinks, and some side dishes were good.", "pics": null}}, {"review": {"des": "We absolutely loved dining here! As we waited for a table out on the river, we sat at the bar and had a couple cocktails  (Old Fashioned and Happy Pappy)  and an appetizer. We are olive lovers so we ordered the fried olives and were not disappointed.  <br><br>Once we moved outside to our table we ordered for dinner: roast beef 8oz, pork 12 oz and corn side dish.  The corn was their version of elotes and was delicious.  We wanted to try the two meats and were thrilled they offered smaller portions so we could do it. Both meats cooked perfectly and the side reductions were paired well.  Each meat also came with a small side serving and was just enough to compliment the larger side of corn we ordered.<br><br>Since it was my birthday the restaurant delivered a dessert:  lemon berry cheesecake. Cheesecake with candied lemon zest atop a bed of reduced berries. We aren't much of cheescake eaters, but this cheesecake we could not get enough of! It totally won us over that we would definitely order it again.<br><br>Our server was really sweet and the service was smooth.  Beautiful night, fabulous view and delicious food and cocktails from start to finish.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/o03ci-ZK1CrLuj5BcCNe3g/168s.jpg", "caption": "Side dish: corn with cilantro, chili, cheese and fresh lime"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/nh0cKLuEMtKmHM6HiawiNQ/168s.jpg", "caption": "Lemon berry cheesecake"}]}}, {"review": {"des": "We randomly popped in here for dinner and it was probably one of my best decisions I have made in a while. Before we jump into the actual food, lets talk about venue and service. <br>Venue: The place was perfect for casual get together with great food. You can show up in jeans and a casual top and not feel out of place at all. It is also right by the river so assuming you get seated close to them then you also have a stellar view. I would guess that during the summers you could also get patio seating which would just be a whole different experience. Lighting it not awkwardly dim where you cant see the person in front of you but instead just right. <br><br>Service: At least from what I experienced they are good about checking in on your regularly enough to get your orders in but not too often where you're like dudeee. Also, personable and fun. <br><br>Real Talk - the food: <br>Golden Goblets: Definitely get these - they were a table hit! <br>Oysters: We got a hybrid of east and west coast and you can definitely taste the difference, but I would go for both again in a heartbeat. Their sauces aren't your standard oyster sauces, but weirdly you dont miss them<br>Lamb: No questions asked, get it. Also I would definitely say helpings for this and really all the roasts feeds about 2-3. <br>Chicken: This is half about the experience because its cool that they'll slice it in front of you but the taste is also great. If I had to choose between the two though i'd say lamb. <br><br>Great beer and wine menu!", "pics": null}}, {"review": {"des": "The bread and \"butter\" are the best you will have anywhere. The arugula salad was simple and delightful. The duck rillette (sp) was meh as was the s'mores desert. The main course of chicken I will not comment on because I am not a fan of meat and the subtly of cooking it.  <br>I will return for the bread and salad.", "pics": null}}, {"review": {"des": "After the Cubs game on 7/4, we decided to walk to River Roast from Union Station- I don't recommend doing that as I'm almost 7 mths pregnant but I digress.  <br><br>We were sat quickly and were quite pleased w/ this restaurant and it's offerings.  My husband ordered 2 beers- Rubrique $7.00 and Tyranena Rocky's Revenge $9.00- he really liked them.<br><br>I ordered the Country Boil $48.00 and we both shared it- great for 2 ppl.  He ordered the 12 oz pork $22.00- I had a piece and it was good!<br><br>We were happy w/ our decision to check this place out!", "pics": null}}, {"review": {"des": "(4) ~ very good overall food & service <br><br>DRINKS:<br>** Mexican Firing Squad(cocktail) = (4.25) Very good<br>** Coffee = (4) very good & fresh<br>* Puffing Belly Brown Ale = (3.75) Good<br>* Water(tap) = (3.25) pretty good<br><br>FOOD:<br>** Roast Beef(medium rare) = (4.25) Very good & my Favorite;)<br>** S'mores Ice Cream Sandwich = (4) very good<br>** Key Lime Pie = (4) very good<br>* Country Fried Rabbit = (3.75) Good<br>* Rack of Pork = (3.75) Good<br>* Corn on the Cob = (3.75) Good", "pics": null}}, {"review": {"des": "My experience here was incredible. The food was beyond delicious and even though we had a large party with us, we were taken very good care of. The view is beautiful, the food is beyond delicious, and the staff was so kind. Amanda was such a sweetheart and outstanding server. Josh and Brian went above and beyond as well. Must recommend the shrimp and crab toast as a starter as well. Can't wait to return, cheers!", "pics": null}}, {"review": {"des": "I was in town for business, so one of my colleagues scheduled a lunch at this place. It was an amazingly beautiful late September day, so we opted to sit outside along the river. Being a huge fan of outdoor dining and the city of Chicago, the setting alone would drive me to give this place 5 stars! it actually ended up being a little too hot, but we didn't care!<br><br>The food was darn good too! I had the lobster burger which was delicious. My colleague had the roasted chicken salad and said it was excellent.<br><br>To top off the meal, when they brought our check, they brought us a wishbone (fake) to share. He didn't explain the reason very well, but we still thought it was cute!  And, yes...I won the bigger half of the wishbone!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/5Qtcw5rh0EljqbwMkUz5Hg/348s.jpg", "caption": "Awesome lobster burger...amazing setting!"}]}}, {"review": {"des": "Came here for a nice dinner and it was just that! Good service, fantastic food. Of course I got the whole chicken... And it was as good as advertised. Even had room for desert smores, picture below. Some advice, ask for a window seat, the views of the river are amazing...Come hungry and leave happy.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/dO2B6TwCXQBIksln2VV7Dg/348s.jpg", "caption": "Smores... Nom nom"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/nNdrRgOfc9SyJ-jT3Hb87A/168s.jpg", "caption": "Window view"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/KEaX1wXRVCHFTW-WXYbyxg/168s.jpg", "caption": "The menu"}]}}, {"review": {"des": "I was visiting Chicago for a work trip recently, and we decided to take the team out for dinner at river roast. We tried several appetizers such as the mushroom toast, pork meatballs, and the honey chicken bites. Each was delicious. One of our favorite cocktails was the widow's peak whiskey. For our main course, we ate family style with fish, chicken, pork, and prime rib. The prime rib was by far the team's favorite, and we cleaned the serving platter in no time. The meat was tender and had an amazing seasoning rub on it! We also added carrots in dirt (yum!), both types of potatoes, and mixed vegetables for sides. For dessert, we had the cheesecake and s'mores desserts that were big hits. Overall, great meal, but it wasn't cheap. You'll pay a lot, but you won't be sorry!", "pics": null}}, {"review": {"des": "So dang tasty! My date and i split an 8 oz order of the prime rib (perfectly cooked and seasoned), had the Brussels sprouts side (as good as they say), and had the pork meatballs (which comes with really tasty marinara). This was plenty of food for two. A delightful dining experience all around. Great service too.", "pics": null}}, {"review": {"des": "This place was amazing. My first trip to Chicago, and we came across this perfect gem for a late breakfast. The service was incredible, and the good was unforgettable!", "pics": null}}, {"review": {"des": "The food was mouthwatering and the river scenery made everything perfect. Our waitress was very friendly and knowledgeable.", "pics": null}}, {"review": {"des": "Really enjoyed he event space and the chicken was incredibly juicy and well paired with fingerling potatoes and carrots of various colors. The spot is worth a visit, especially with a look over the river.", "pics": null}}, {"review": {"des": "Removing a couple of stars because of Father's Day. I feel totally bamboozled. <br>I made a reservation about a month before to take my dad here because I thought he'd enjoy the views and the blues. He reviewed their brunch menu online and knew ahead of time what he was going to order. <br>When we got there we weren't given menus. The woman instructed us to go check out the buffet which, BTW, I hate buffets...<br>It was the only option that day and she acted like this was common. The website made no indication that it was a buffet only Father's Day AND that it was $55/person. OUCH! This was a rough day for me. Also I had to ask for the cocktail menu and didn't see any brunch style drinks on it. Were there no bloody marrys or mimosas?! The website failed me. <br>It also says that brunch starts at 11 but the music doesn't start until noon. I was expecting to see my friend's daughter perform, per the web site, but she wasn't there. <br>The food is very good but not $55 good. Especially not for this unemployed vegetarian. <br>My tip is if you're expecting something special best to call the a day or two before. For some reason the service isn't like what you get at Spiaggia.", "pics": null}}, {"review": {"des": "I was here for a birthday. You have an option to sit inside or outside. Since the restaurant is right on the river, sitting outside is definitely a must! The view of the river and the surrounding buildings is remarkable. We ordered Rack of Pork, Roast beef, and Golden Gobbets. The pork in the Rack of Pork was so delicious. It had that rich umami flavor. I could careless about the cornbread; it was dull and dry. The roast beef was tender. The potato croquette was good, crunchy, and flavorful. Golden Gobbets was amazing. Dripping it with the side honey gave it a sweet flavor profile. It was glorified chicken nuggets. So yummy!<br><br>I also got a drink, which was recommended by our server. I could definitely have opted out of that. I think it was called Happy something.. It was too strong. All I tasted was the alcohol. I should have ordered something else. <br><br>I really wanted to give this place a higher review since I expected more of the place. Maybe I'll check out their happy hour next time.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/WPgc4IZp-LNTDObMo4VUiQ/348s.jpg", "caption": "Soup of the day with pork shoulder"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/NDQh26izzyXTZSEOTlJSUA/168s.jpg", "caption": "Golden Gobbets"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/BjnjPMy6NghtA1w_A3DJLw/168s.jpg", "caption": "Roast beef"}]}}, {"review": {"des": "Had the Restaurant Week lunch special there - three courses for $22. Had the pate, the soup and the Cubana. All three were excellent. Service was also good, as was the view from the windows.<br><br>Really glad that I discovered this place.", "pics": null}}, {"review": {"des": "My girlfriend and I are beginning to look at spots for our wedding in 2019. We found River Roast online, and liked the location, so decided to do a tour of their events space.<br><br>Every other space we've seen in the city offers complimentary valet parking while touring the events space.<br><br>Upon arriving at River Roast, we mentioned to the valet that we'd be in the space for 20 minutes seeing the wedding space. He took our keys, and said \"okay\". Upon returning to the valet, he charged us the full amount. RR said there was nothing they could do about this. <br><br>What a joke.<br><br>When you're considering spending tens of thousands of dollars on a space, food, bar, etc, it is pretty shitty being nickel and dimed like this.<br><br>We'll be avoiding this place in the future, and I recommend you do the same.", "pics": null}}, {"review": {"des": "Great place for drinks and food by the river. Wonderful staff and service, lovely atmosphere and food looked great. We just had a snack but saw lots of the entrees come out and look delicious. Will be back for dinner next time we are in town. Go for the view and stay for the food.", "pics": null}}, {"review": {"des": "I went to River Roast on a Sunday afternoon and was happy to find out they have blues players on the weekends throughout June! The band (Billy Flynn Band, I believe) were awesome! I would definitely like to come back when they are playing. The restaurant is located right on the river. Outdoor seating is first come first serve (it was about an hour wait when we arrived around 3pm). You can make reservations for indoors in Opentable. The menu is small, but out food was great! I had the fried chicken sandwich with homemade pickels. The \"roasted potatoes\" replace french fries on the side, and they are so much better! The potato chunks are fried with a great crunch. My husband had the bagels and lox which was delicious and is served so you can make your bagel however you want. He also had the chef hash, which was just ok, mainly just a mushy texture. I only gave 4 stars because the hash and my bloodmary were just ok (the bloodymary was watery, but the skewer with meats and cheese they put in it was delicious. Next time I'll just get the chaucuterie.) Service was good, fast and polite. We will definitely be returning for more blues on the weekend and for the great food.", "pics": null}}, {"review": {"des": "Brunch Review (3.5 Stars):<br><br>My friend and I stopped by here for a Saturday afternoon brunch.  After I walked in the restaurant, I immediately noticed how well preserved the vintage interior was.  The overall feel of the restaurant was very cool and this place would be ideal to host a large group of people.  I was stuck between the biscuits and gravy and lamb pastrami, but my waiter steered me towards the lamb pastrami.  The lamb pastrami is house cured and has a great flavor  I liked that the meat in this dish was mixed with marinated shreds of Brussels sprouts.  I tried a piece of my friends biscuits and gravy and I did not like how hard the biscuit was.  We shared a piece of the carrot cake (huge BTW), and I would rate it a 6/10.  Both the cake and frosting were a little bit too dense.  The highlights of my meal were the atmosphere, service, and lamb pastrami.  I would potentially come back to try their dinner menu in the future.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/KsNIZLzojDlPM3qR2brH3g/348s.jpg", "caption": "Lamb pastrami"}]}}, {"review": {"des": "Gave it a 3star for location and ambience. Service isn't good. We got a table outside, on 9/15/18, and they don't have all the tables under shade. I guess that's why it's called 'River Roast'. We moved in after some time. Waited for an hour fifteen mins for food. Oysters, burger and fried chicken (happy hour menu) were good.", "pics": null}}, {"review": {"des": "Very average food, nothing special. Came here for lunch with a friend. The decor and vibe was nice but the food left much to be desired. I had a crispy chicken sandwich which was average. Chicken was nice and crispy but very bland. It came with potatoes that were super hard and not edible. <br><br>Maybe I'll come back and try the roasts. Not a must try place for me though.", "pics": null}}, {"review": {"des": "The location of this restaurant is beautiful. Unfortunately there was a wait time during lunch to sit on the patio, so my group of 5 sat inside. The waitress and service were both great! The menu was a bit confusing and without us even asking, she started to explain it with our permission which was great. <br><br>I got the roast beef sandwich which came with coleslaw and BBQ chips on the side. The other people who ordered the same felt as if there was more chips to fill us up than the sandwich but surprised to say that I didn't feel hungry the rest of the day if that says anything. Regardless of the portion size, the food was still awesome! I think I would go there again to try out their appetizers or their family style meals they're know for.", "pics": null}}, {"review": {"des": "Great roast beef!  Sat outside on patio on a beautiful summer evening.   Definitely a meal to share.  Great service from our waitress.  Every dish is l'carte so be prepared to spend more.", "pics": null}}, {"review": {"des": "We ate at River Roast for our anniversary dinner on the patio. We had to wait awhile for our table and had a drink at the bar upstairs. The bartender was creative and made sure the drinks were exactly what we wanted. Our waitress Jana, was super sweet and knowledgable! She helped us make a tough decision and explain how the menu works (everything looked amazing)! Scotch eggs and pickles to start and the whole roasted chicken for dinner. Everything was perfect, simple but done well. We're still talking about the potatoes!", "pics": null}}, {"review": {"des": "We didn't have the highest of expectations for this place bc we weren't sure if it was just a tourist trap. Beautiful patio overlooking the river. It was a chilly day and there were heaters on the patio which was why we chose to go. Food was good, but not great. We ordered the hash and the shrimp & crab toast.  Hash was good.. different flavors but they worked. The toast didn't taste much better than chicken of the sea tuna salad. You got hints of crab, but other than that not much going on there. However, it was a nice spare of the moment lunch spot for some tourists.", "pics": null}}, {"review": {"des": "3.8 stars<br><br>Service was great and view is amazing (of course). <br><br>I recommend the rack of ribs, roast pork, and mushrooms. The chicken was a little too salty on the outside and dry/lack of taste on the inside, and the brusek sprouts were over-powered with sauce for my taste. <br><br>Want to try the fish next time!!", "pics": null}}, {"review": {"des": "definitely a fan of this place! all around solid selection of roasted foods. <br><br>some friends were visiting from out of town, so we decided to come here on a beautiful late summer's day in chicago for lunch. we sat outside on the river front patio where we were able to fully enjoy the blue skies and warm sun. in fact, i never went inside the restaurant so could not tell you a thing about what the inside looks like.<br><br>yes, they are famous for their roasted whole chicken, which comes served sitting upright on the plate! can kind of catch you off-guard if you're not expecting it. but despite this being what river roast is known for, the roast beef is actually what stole my heart (and stomach). so tender and perfectly medium rare. not too overseasoned (or underseasoned for that matter) and basically tasted like perfection. <br><br>too bad you can't get just half a roast chicken, because then we would've definitely traded up and gotten a larger portion of the roast beef.<br><br>here's what our group of 5 got in total to share:<br>- shishito peppers<br>- corn on the cob<br>- supper club mushrooms<br>- whole chicken<br>- 16 oz roast beef<br>- 12 oz rack of pork<br><br>we did manage to finish almost all of it, but it was a real struggle in the end with the sheer amount of food that this is.<br><br>standouts in my mind were the roast beef, rack of pork and supper club mushrooms. the others were fine, but nothing to write home about. again, highly recommend that roast beef over whole chicken if you like red meat!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Sr0hvrh1sDgY2aQkwhfqBw/168s.jpg", "caption": "supper club mushrooms, roasted rack of pork, and roast beef"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/9LeSUcF8jC-mU18KvqVCOA/168s.jpg", "caption": "roasted whole chicken (after it's been carved up tableside) and corn on the cob"}]}}, {"review": {"des": "I have been meaning to check out this restaurant since they first opened. Love that it's right along the river and during the summertime there's out patio seating.<br><br>We were here for a little St. Patty Day partying and there were about 12 of us. They had us in a little room right off of the main restaurant. Our waiter was awesome and did a good job checking on us, giving recommendations, and explaining what everything was.<br><br>I'm not a huge fan of fried chicken, but we got that as an appetizer and with the honey it wasn't too bad. Also I had a fantastic soup with a delicious roast. So sorry I don't remember the name. Cocktails are AMAZING here! I had the season winter soldier, Illegally smuggling ginger, and an old fashion (it was St. Patty's Day don't judge me). Each one was different and refreshing.<br><br>For lunch I went with the Rueben and had him exchange the chips for a side of potatoes. So good and they weren't stingy with the meat. I live and work close by and will definitely be back. Mad I hadn't been sooner.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/HUztQN3PzK6yQHwpDPRf7g/168s.jpg", "caption": "Rueben and Potatoes"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/h_v9m3FACC8WczUvBpDk5A/168s.jpg", "caption": "The Winter soldier and Old Fashion Cocktails"}]}}, {"review": {"des": "I agree with the positive comments by other \"yelpers\".  This is a cool fun place...<br><br>#1 Our family of 4 \"hearty\" eaters would only need one roast....one salad...then a couple veggie sides.<br>If u order roast after roast to try them like a normal entree please take our advise-u are ordering a lot of food and the roasts are expensive as they can feed 3-4 easily per roast.<br><br>We made that mistake...<br><br>#2 We are going to track the \"roast of the month\" to try to enjoy some of the different varieties.<br><br># 3 I was disappointed that the prime rib roast I was craving was offered on Saturday evening only.  So do your homework on menu changes before u make reservations so u can get what u want.<br><br>#4 If u are vegan u can just veg out on all the sides and salads....I would split a salad as an entree with someone/plus split a couple of veggie sides easily done.<br><br>If u are only ordering salad.....one will give u 3-4 little plates full which I can easily chow down on all by myself if I am craving salad.<br><br>Beer was $9 a piece (no colors light) ....cocktails $15 a piece.   Normal cost for downtown.", "pics": null}}, {"review": {"des": "My friends were talking about River Roast and on a whim we decided to come here. We had absolutely no reservations but we were hoping this restaurant took walk-ins. Thankfully for us they did!!  We wanted to do the patio seating but there was a 45 minute wait for that so instead we opted to sit at the high tables in the bar area.  We were seated immediately.<br><br>Service was prompt and friendly and spot on. Our server came to our table immediately to take our drinks. It took us a while to figure out what we wanted but between the four of us we decided on the fried chicken that came with the river roast potatoes, one corn bread and a small bottle of hot sauce.  We also ordered a side of green beans.  Our server had said the fried chicken could be shared among 2-3 people but we were able to share it amongst the four of us with left overs.  <br><br>Everything was delicious. That fried chicken had a great crispy batter on the outside and the meat on the inside was nice and juicy. My friend who had tried to roasted chicken said he liked the fried chicken more.<br><br>I highly recommend this place and can't wait to come back.", "pics": null}}, {"review": {"des": "I came here because I loved the food before. The food was great but the server was in a horrible mood. I hate to sit and finish my food because of him.<br>I wish my son told me his cursing word (which I did not hear) before we left.<br>I had a horrible experience but it would not mean some others would.<br>Again nice place good food but horrible service by J.<br><br>This is the first time I wrote a comment like this and I hope it will be the last.", "pics": null}}, {"review": {"des": "I took clients to River Roast for dinner at their suggestion. It's in a lovely spot on the river where you enter the main dining room by descending a beautiful staircase into a very large, but somehow cozy dining room. The entire staff from the host to the bussers were unbelievably professional while exuding that wonderful warm Midwestern hospitality. But enough about them, let's get to the food. This is a place to go with a group because you want to try and share everything. We started out with the potato croquettes (divine) and the chorizo stuffed fried olives with a cheese fondue (out of this world). For our mains we shared the succulent 8 oz. roast beef and the rack of Berkshire pork, cider brined and applewood smoked, and served with melt-in-your-mouth cakelike cornbread. But the star of the evening was their \"Carrots and Dirt\" side dish. I'm pretty sure I've never had carrots or almost anything as good as these. They're grilled and topped with pumpernickel crumbs, goat cheese and balsamic vinegar. And to top it off we fought over a strawberry rhubarb cobbler served a la mode that made me moan. And I don't even like dessert. Take me to heaven now!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/R6LfHcBB-cCVRBunPBK5eA/348s.jpg", "caption": "\"Carrots and Dirt\" possibly one of the best side dishes I've ever had. Grilled and topped with pumpernickel crumbs, goat cheese and balsamic"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Rf700NOjVBTMMvaQiV77Sg/168s.jpg", "caption": "Their potato croquettes. Someone made off with one before I could take a picture!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/cFgIg8RX9BN_6rpE12Ls2w/168s.jpg", "caption": "River Roast menu for May 2018"}]}}, {"review": {"des": "My pictures don't do this place justice...<br><br>I had the pleasure of dining here with a large group during a work conference and had such an amazing experience. The private room we occupied had gorgeous views of the river and newly updated river walk. But that view was only for starters, because once the servers came in and immediately asked who was dining with allergies (that's me), I just knew my experience was about to get even better. <br><br>These guys were on it! I am a no soy no garlic gal. We had a select menu for our team, and I was immediately told what I could eat, what I should stay away from, and what they would prepare just for me. I started out trying these giant wafer crackers. I'm honestly not sure what I was eating, but they were delicious! Light and crunchy goodness. The roasted carrots were oh-so-yummy and memorable. So fresh and cooked just enough that they melted in my mouth with every bite. The crispy seasoned potatoes served in a skillet were my most favorite side, and in truth I could have enjoyed those for my dinner alone. However, once that roasted chicken hit the table, I knew I'd be getting stuffed real soon. It was tender, juicy, and beautiful in presentation. Next time I'd love to try the beef, because I bet it's out of this world. <br><br>I highly recommend this stop, but be prepared to wear your stretchy pants ;-)", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/2-_ixd1pO5zjv1PqWtpALQ/348s.jpg", "caption": "Roast chicken"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/BJo-qkJNh-Yh1Yyw-oVEAA/168s.jpg", "caption": "Chicken, potatoes, carrots"}]}}, {"review": {"des": "Get the chicken! I must say if I had one dish that I really remembered from my trip to Chicago it was the chicken from this restaurant. The skin was mice and crispy! The presentation was great! The potatoes that came with the chicken were awesome as well! Crispy with a soft center. Not over cooked and held up perfect with the chicken. A nice hearty dish.<br><br>We also ordered small beef roast which was cooked to my liking and came with fried potato balls. The beef was okay, normal seasoning burnt slightly on the outside and a tad grisly for me. Creamy horseradish was available upon request which made the beef much better for me.", "pics": null}}, {"review": {"des": "This review is for a group dinner only. Way over priced for what you get. For appetizers we had shrimp cocktail, crab cakes, and fried chicken sliders. Shrimp and crab cakes were mediocre. The fried chicken sliders were pretty tasty.  We had the option for salmon, pork loin, or ribeye for dinner. I had the ribeye and it had an overbearing smoke flavor to it and was a lot closer to medium well than the medium rare I ordered. The pork loin and salmon both got average reviews from our party. For dessert it was either carrot cake or apple struddel. The carrot cake was decent, but the apple struddel was terrible. Overall it was just a terrible value for what we got. If you're looking for a group dinner in Chicago you can't go wrong with Joe's or Capitol grille.", "pics": null}}, {"review": {"des": "Whole30? Allergies? Gluten Free? Come one, come all, to River Roast. <br><br>Really, though, when I plan a team dinner I have to do a fair amount of digging as my team's food preferences and needs can be, well, challenging. River Roast was fab from start to finish and I know I'll be back for more. <br><br>The location and interior are wonderful - beautiful dark wood, dimly lit and positioned right on the river. This, no doubt, is perfection in the warmer months! The staff is just as great, patient, helpful and kind. They took excellent care of our group and made sure to accommodate many of their dishes for the various allergies, etc. This is beyond appreciated. <br><br>Now on to the food, their bird is the WORD, y'all. It's juicy, delicious and flavorful. My only request is that they had some sort of dipping sauce/chimichurri, etc. to accompany said chicken. The sides shone just as bright as the mains. The potatoes were magnificent, and I would have happily eaten them with my eggs in the morning, too. The carrots & dirt were amazing, and I never knew I loved carrots so much. Well, not surprising, because they are drizzled with goat cheese and balsamic. Duh. <br><br>With a gorgeous space, lovely drink menu, great food, and cool staff, River Roast is a staple in the River North area. I'm a big fan.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/wmoE5Jenjn5eF1momP11og/348s.jpg", "caption": "Chicken!!"}]}}, {"review": {"des": "This place was great! Our work group went to River Roast and everyone thanked me for picking it for dinner. We had to wait for our table because the people that were sitting there were not thoughtful and chose to have a 3.5 hour dinner. River Roast comped us some appetizers because they felt bad and it wasn't that big of a deal because we were enjoying the cocktails at their new little bar upstairs while we waited but it was appreciated.<br><br>We ordered a ton of food since most of it is served family style.  We started with appetizers and enjoyed the Mushroom and Seafood toasts, the Fried Rabbit was really good (my favorite) but one of the smaller portions, the Burrata was really good, and we also got the Charcuterie board (which I liked but wasn't the favorite, you need to like pate and similar snacks) which I do.<br><br>For the main course we got the whole fish and the monthly special, the Pork Shank with these great spices, both were really good but I loved the pork shank. We also got potatoes, asparagus, peas (a big hit), and mushrooms (big hit).<br><br>You won't believe we got dessert as well, the Cobbler and Key Lime Pie was to die for!<br><br>We are definitely going back when we come back to Chicago!!! Thanks River Roast for a very tasty meal!!!", "pics": null}}, {"review": {"des": "My team at work selected this restaurant to host a huge national summit dinner two years in a row; which I guess should tell you something right off the bat. Each time, we reserved the private room downstairs; which is just enormous. The room itself is very spacious and lovely. We were able to have two buffets, two bars, and a dessert table all within the space without it feeling cramped in addition to 10 round tables and a hundred people.<br><br>The service was outstanding. We were greeted by a slew of servers offering wine upon entry. The passed appetizers were my favorite part! Everything was so good that I wished I had filled up on those. The food on the buffet was good. I wished that I had been involved in the ordering for the meal because I just wasn't impressed with the selection. It was chicken, salmon and pasta with a vegetable medley for the side and chocolate covered fruit for dessert. Nothing wasn't tasty, I just thought as a company the size of ours with the amount of hoyty toyty executives we had, wished we would have stepped it up a notch. <br><br>That being said, the drinks were served fast and furious. Servers were constantly coming around, clearing plates and replenishing the buffet and the absolute best part of it all was sitting outside on the patio watching the river. Let's be honest, that was the star of the show. I'm excited to return on my own and choose my own meal from the menu because I am positive the food is outstanding when it's something you select, right?!", "pics": null}}, {"review": {"des": "I got the chopped salad and added salmon. Salmon here is smoked salmon not grilled salmon. I wasn't expecting that. The space is kind of neat but it was very cold in there. It must be hard to keep it warm in there cuz the space is big. Eating outside would have been nice if the weather was nice.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/r_Em2bolMx4DnGxyKDRRdw/348s.jpg", "caption": "smoked salmon on chopped salad"}]}}, {"review": {"des": "Good spot to grab lunch on the Chicago River especially during the summer months as you can sit outside and take in the views.<br><br>I usually come here with my clients whom are actually friends of mine. We have sat inside and outside of RR. Good environment and staff is always on point. I had tried the following sandwiches here:<br><br>Fried Chicken Sandwich (includes sriracha pickle, lettuce and spicy remoulade on a brioche bun) pretty good!<br><br>Roast Beef Sandwich (includes roasted pepper relish, giardiniera, roasted garlic aioli on ciabatta bread) my favorite...very damn good!<br><br>Lamb Pastrami (includes pickles and mustard on pumpernickel) its ok...I think they may need to take this sandwich off of the pumpernickel as it becomes too heavy and sandwich and the flavor doesn't go that well together. <br><br>Good wine and good beer list here in addition to the good food.", "pics": null}}, {"review": {"des": "Simple food, all very well-executed.<br><br>If you want a perfectly roasted chicken, then look no further than River Roast. While chicken may not seem like the most exciting thing to order, when this flawless, it goes from \"ho-hum\" to downright craveworthy. <br><br>The whole bird, carved tableside, is extremely juicy and flavorful, with shatteringly crispy skin. It's served with potatoes roasted alongside the bird, so they soak up the pan juices. It's heavenly.<br><br>I've also tried the pork, which is also very good, and I hope to one day try the beef as well as the whole-roasted fish. But man, it's so damn hard not to get the chicken. The key is to go with a lot of people and order a bunch of stuff so you can try a little of everything. The first time I went with a client, and unless you're both down to order a whole chicken (he wasn't), it can be awkward ordering an entire chicken for yourself. I did it anyway!<br><br>Even vegetables are not mere afterthoughts; my last visit we had roasted carrots with toasted rye crumble and goat cheese. I almost would have been happy just eating a plate of those carrots.<br><br>Cocktails are all fine, but best of all, they have chocolate pudding for dessert, which is a holdover from Keefer's (the chef/owner used to also own Keefer's). It's pretty much the most velvety, and wonderful pudding that's ever crossed my lips.<br><br>A meal at RR hits all the high notes: comforting, satisfying, and ample portion sizes. For first-timers, I recommend the chicken. Seriously, it has palliative properties.<br><br>Open for lunch and dinner, and weekend brunch. Live music on Thursdays and during brunch.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/LJA9MZ6_cX-vWAXsoPwhGg/348s.jpg", "caption": "They give you a recipe card in the doggie bag for your leftover chicken."}]}}, {"review": {"des": "Not impressed at all. Service was shoddy and waitress was unprofessional. Food was fine. It was very loud.  Food was not worth the price.  In a city like Chicago with tons of food choices I will not be back.", "pics": null}}, {"review": {"des": "Overpriced food with an up-selling (slow) staff that is more concerned with a big bill than providing ordering guidelines. Oh, the views are pretty, though.<br><br>We (group of eight adults) were here on a Monday evening at 6 p.m. Our server explained a roast feeds 1.5-2 people. We ordered starters (buratta that was more beet than cheese), plus a number of sides, and drinks. We were told we should order the charcuterie board - the most expensive starter on the menu. We explained there are a number of vegetarians at the table, so it was dropped. But I think our bread order was, too. We asked three times for bread, which finally arrived halfway through our meal.<br><br>For eight, we ordered: chicken, two boatloads of veggies, fish, pork and prime rib. While ordering, we were told we should order the 64 oz (!!!!) prime rib for the table. We again had to decline the upsell, and move on. The prime rib showed up medium instead of medium rare and our server said it could be cooked more (???) or less (???????) The server said the order was placed as medium rare and that was that. No more explanations or offers. Ok....<br><br>Our server should have also informed us that we over-ordered. Too many sides and the boatload of veggies = way too much food. He was slow to refill our drinks and our water glasses went dry. Many times between drink orders, it took 10+ minutes to get a drink, to which he said the bar was backed up. It wasn't even busy! Probably less than half-full inside and out. You know what else was dry besides our glasses? That infamous chicken. And the pork looked like chalk.<br><br>The beans and carrots were good, and the boatload of veg was tasty. But you're paying for the river view at this joint and for what we got, I don't think any of it was worth it.", "pics": null}}, {"review": {"des": "Not that the place cares--We were a party of 8 last night--mostly guests from LA.<br>We were seated almost in the kitchen--but it was interesting to watch the knife skills of the salad prep woman chef.  One person (from LA-unfamiliar with the place) did the ordering for the group.  The waiter gave no advice about  totally over ordering and we had food for at least 15 people--this is really irresponsible and deceptive.  ON TOP OF THAT, the service was completely shitty.  We had tons of dirty dishes everywhere;there was so much food that it was all over the place--the $64 roast was uneaten--it could not even be moved to my end of the table--of course, the waiter was not there to help serve the food--he was too busy counting his $200 automatically included tip.  In fairness, the food was excellent", "pics": null}}, {"review": {"des": "I was here for a work sponsored event,  so the food and drinks were complimentary. The food was top notch and the drinks were flowing. It was a beautiful warm night in September, so we spent a lot of time outdoors on the patio area. It was great watching the boats go by,  enjoying the beautiful evening. This would be a great date location for the lovebirds.  That's all I seam to remember.", "pics": null}}, {"review": {"des": "Stopped by for a co-workers going away lunch. I split the 8oz roast beef which comes with potato croquettes, and gravy as well as the roasted chicken salad - julienne root vegetables, cabbage, Asian herbs, peanuts, and vinaigrette. The beef was carved table side and was a perfect medium-rare/medium. The potato croquettes were equally delicious. The salad was light and flavorful and when combined with the roast beef make a substantial lunch for two. Lunch service was extremely quick and attentive and we were in/out within an hour.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Zm9g141-giXOwBZuYRDwdg/168s.jpg", "caption": "Roasted chicken salad"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ctXOgpsm8D1C7xhSNtKT1Q/168s.jpg", "caption": "Roast beef"}]}}, {"review": {"des": "First time here and sad to say, I was terribly disappointed. It was my girlfriends bday so I had called in ahead to reserve and let them know about the special day and have a little surprise dessert ready. I even confirmed 3x with them so I assumed everything was set. <br><br>Our table had quite a few bugs flying around. It was really hard to flag down a waiter/waitress to get napkins. At the end of dinner, I was expecting the surprise dessert which didn't happen so I ended up having to flag our waiter down and tell him which ruined the element of surprise.<br><br>We didn't finish our meal so I asked for a to go bag with fork knife and napkins but none were put in.<br><br>At least the roast chicken was amazing! Overall it's the small things that ruined the experience and the surprise being ruined.", "pics": null}}, {"review": {"des": "Sometimes when you choose a restaurant on the river you decide ahead of time you may be foregoing a really good food experience because \"it's for the tourists\" but not at River Roast! Here you get ambiance, service, and a view. Everything is family style so bring people you can do that with. Drinks are crazy expensive but strong so it's worth it. Also don't go with just 2 of you! 3 is better, 4 best. Our party order a fried chicken roast, shishito peppers, house pickles, creamed spinach, elotes, and a cauliflower. We enjoyed everything! The fried chicken was good, better with the sauce they serve with it. I would say the white meat portion was a bit dry for my taste. Want to go back to try the roasted chicken. The potatoes the chicken was served on top of were crispy and perfect. The sides needed salt. I hate asking for salt at a restaurant that doesn't already have it on the table, but we did because the spinach and cauliflower were under seasoned. The shishitos were my favorite. They're my favorite everywhere I go, but the harissa rubbed version here is very special.", "pics": null}}, {"review": {"des": "River Roast was an outstanding venue for our daughter's wedding.  The use of the River walk, the terrace, the upper and lower rooms with the bar areas was the perfect place for her wedding vision.  An abundance and variety of delectable food, cake and snacks were served by delightful, helpful servers throughout the wedding.  The only complaint was after the ceremony and without prior knowledge, there was another event booked in her ceremony area soon after.  We were rushed with picture taking and were unable to complete all the family photos in the room.  Their event planner, Allyssa, was enthusiastic and professional.  Recommentation of a 4.6.", "pics": null}}, {"review": {"des": "For me, fine but didn't live up to the hype. I asked in my reservation for a table outside for our birthdays, which they understandably didn't give us because it started raining. The hostess then said she'd give us a nice window seat, but we were seated against a wall instead. Not that big of a deal but sort of set a tone of disappointment. <br><br>The charcuterie was interesting, but not very satisfying to me. The roasted pork and asparagus, as well as our cocktails, were all decent.<br><br>I definitely wouldn't go back on a Saturday night as it was full of loud obnoxious tourists. Maybe brunch would be more satisfying - I will give it a try sometime.", "pics": null}}, {"review": {"des": "The Place<br>River Roast is located on the Chicago River off of LaSalle street.  The views of the river are nice and there is both inside and outside seating available.  The facility has many large, medium and smaller sized rooms for social and business gatherings.  Best to call for reservations.  There are several parking garages in relatively close proximity to the restaurant.  Interestingly decorated and a unique dining experience...  <br><br>The Food/Menu<br>The menu for dinner was very limited but quite interesting.  Several healthy roasted items to chose as well as some very good but not so healthy offerings...  We began our experience an appetizer of deep fried olives.  We ordered a Big Fish Fire Roasted, Mediterranean Chips, Whole Chicken Wood Smoked & Juicy, RR Potatoes, Asparagus, Roasted Carrots and a Beet plate.  Our food overall was very good.  Many flavorful seasonings.  Our fish was a little disappointing from a flavor and presentation perspective.<br><br>The Value/Experience/Service<br>Best always to have reservations.  The host/hostess were pleasant yet unsure of themselves.  Our server was friendly and helpful but there were long droughts when we didn't she her for 15 or 20 minutes.  Service can make or break any restaurant... add help!  Overall it was a fun and enjoyable meal.  Rated a 3 mainly for service.", "pics": null}}, {"review": {"des": "I have been here a couple times. You must sit on the balcony in order for you to enjoy the full experience. It is a bit pricey, but the atmosphere outside makes up for it. Even if there is a wait, wait to sit outside.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/CXazaR10_X-FaFksYwassA/348s.jpg", "caption": "Charcuterie"}]}}, {"review": {"des": "dined on 10-19 appetizers were great shrimp toast and meatballs. got the fish it was very good, however a little to thin. also does not really come with anything a bit pricey.  took home the roast beef which was done just right. our server amanda was a delight very upbeat and joyful.<br>drinks though were very expensive 16.00 is a bit much<br><br>will come back in the summer and just have a sandwich. great view.", "pics": null}}, {"review": {"des": "I like this place.  The prices were good and the service was excellent.  Its a place where you can get homemade and hearty meal it was simple but it was delicious I would definitely come back.", "pics": null}}, {"review": {"des": "Delicious! I had the fried chicken sandwich, which came with chips that were deliciously seasoned. My waiter, Brian, was great as well.", "pics": null}}, {"review": {"des": "My first visit. Wish I came here sooner. Had the fried olives to start which were amazing! The osso bucco for main was out of control awesome. I'd recommend this but it's a special for January. Hope the special In February is just as good. Excellent service and atmosphere", "pics": null}}, {"review": {"des": "Came there for lunch to meet up with a colleague. It's very close to Merchandise Mart where I work. We were able to get seated right away on a nice sunny day at the outside patio.  The waiter greeted us right away as well and gave us glasses of water.  The patio overlooks the river and there was the Chicago Sightseeing boat tour that came by with a bunch of very energetic kids waving and screaming \"hello\".  It was different but nice to be outside :)  The lunch selection was good.  I ordered the asian chicken salad.  I didn't have time to order the roast chicken which is their specialty.  The roast is expensive but I'll definitely try it the next time I come. The salad was good but nothing out of the ordinary compared to other restaurants where I've had this type of salad.  I like the fact we were able to get outside patio seating right away, get served in a fast and friendly manner, and eat good food for a decent price.  It was a good experience.", "pics": null}}, {"review": {"des": "Had brunch here today with my fiancé. It was a very interesting experience overall but with some opportunity to improve.<br><br>We split a chopped salad, which was excellent and ordered the rack of pork. The rack was a bit of a mixed bag. Everything was cooked well but the meat was a little dry in some places. While I don't think the emphasis here should be on sauces more than the actual roast, I also think a few extra choices of sauces would be good. Our rack only came with an apple cider sauce of some type which was thick but bland. In addition, there was a slice of cornbread that needed at least a small dab of honey to really bring out its savory flavor.<br><br>I'll definitely come again because the atmosphere is fun but I think the concept needs a little tweak.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/KVRY6xD0h2yOKLA35EQRXQ/348s.jpg", "caption": "This is 1/2 of the chopped salad. Excellent!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Za7t9iDUNmYa_aORA8u8HQ/168s.jpg", "caption": "How the rack looks when brought out. It's more than enough for 2 people!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/AcNmLwE98go8FkeHjDDt0w/168s.jpg", "caption": "Rack of pork all sliced and ready to go!"}]}}, {"review": {"des": "We had a great dinner at River Roast. First, I loved the riverfront view and the southern style decor. Very comfortable ambience. The food really was great. We had the golden gobbets for an appetizer, which were good just could have used some salt. The chopped salad was great too. The entrees really were 5 stars though. Extremely good. We had the whole fish which literally melted in your mouth, and the roast beef which with the sauce they give you is top notch. I would go back just to eat those two things again! The key lime pie for dinner was ok, but I saw some carrot cakes go by that looked pretty good. Overall, I would recommend this place for a nice dinner on the river.", "pics": null}}, {"review": {"des": "Skip this place until there's new management<br><br>We live in Chicago & this is our 3rd visit to River Roast, although we haven't been here in over 2 years.  Things have taken a drastic turn for the worst.  First it took over  1/2 hour before the cocktails were brought to the table.  This only happened after telling 2 servers and the manager than something was wrong.  Upon arrival of the drinks, the entrees followed 3 minutes later.  The manager was certainly apologetic & did \"comp\" the drinks.  The food was tasty, but arrived cold.  They took the potatoes back to be reheated and they were returned 10 minutes later.  When we finally got the check, they charged us for an extra order of potatoes.  They saw their error & removed the charge from our bill. How do you spell disaster?<br>Something here is definitely wrong and I'd suggest that you skip this place.  Our city has many great restaurants that know the importance of good management.", "pics": null}}, {"review": {"des": "I went there last weekend for a quick bite with friends before the Beyonce concert.  We only ordered appetizers the shrimp cocktail, shrimp toast and the chicken and honey were awesome!!!! I will definitely be back!", "pics": null}}]}