{"name": "rj-grunts-chicago-6", "reviews": [{"review": {"des": "The OG of LEYE! Being huge fans of LEYE, we knew we had to come try their first original restaurant! When you walk in, it seems like it is not a big space but it is actually huge! The hostess was very friendly and got us seated right away. We came on a Sunday during lunch time and they were offering a brunch buffet as well. Although nothing fancy, just a couple of breakfast items and a salad/soup bar, everything looked fresh and was continuously getting refilled. Also, our server told us that the brunch was $16.95 which is a great deal! <br><br>The restaurant is literally right next to the zoo which definitely attracts a bunch of tourists, families, and good vibes. We started off with the chili and the hot wings. The chili lived up to its name! It was meaty, hearty, and warming. Beware of the super hot buffalo wings, RJ Grunts is NOT playing around!! They are super hot and definitely not for amateurs. They are nicely dressed and perfectly portioned just make sure you can handle the heat!! <br><br>For our entrees, we ordered the yowza burger, the California wrap, and the burger of the month. The yowza burger included peppercorn patty, spicy ketchup, pepper jack cheese, and smoked bacon. Yum! It was like a flavor party in my mouth! It definitely satisfied my burger craving. The French fries were thin and crispy. The California wrap was also a great choice for something a bit lighter than a traditional burger. It was full of avocado and crispy chicken. I just wish there was a bit more bacon in it! I ordered it with cottage fries which I absolutely loved! The burger of the month was called \"thanksgiving in a bun\" which had hand carved turkey, stuffing, and cranberry sauce with a side of gravy on a ciabatta roll. It was honestly AMAZING. It was moist, flavorful, and perfect for this time of year. It definitely got me super excited for the holidays. <br><br>We cannot wait to come back!!", "pics": null}}, {"review": {"des": "I basically grew up in a Bonanza Steakhouse. When the restaurant permanently closed, the magic of the all-you-can-eat salad bar died with it. I never thought I would meet another salad bar that I admired. Enter into my life: RJ Grunts.<br><br>For roughly $16, it's all-you-can-eat mini waffles, scrambled eggs (plain, mushroom, peppers and onions), breakfast potatoes, bread pudding french toast, bacon, granola, soup, and a salad bar (noodle salad, beans, fruit, cottage cheese, salad fixings, etc). The sections were always filled. Everything tasted good- comfort food that hit the spot. My favorite on the salad bar was the double loaded potato soup. It was rich, creamy, and SO ADDICTING that my husband made a point to get seconds, even after he was full. <br><br>On the weekends, the endless salad bar goes until 2:00pm. I will definitely return for great service, good food, and a lively atmosphere. I wish there was a location in Wicker Park; it would be a hit!!", "pics": null}}, {"review": {"des": "Made a reservation ! Great seating! Best burgers in town! 70's music is being played! <br>Burgers made to order! <br>Kettle chips homemade! They also have a soup salad bar buffet ! I try to come once or twice a year! Frequented weekly in the 70's ! Live in WI now so don't get here as often as I would like! Kudos keep Grunting", "pics": null}}, {"review": {"des": "One of my favorite burger places in Chicago. I love the quirky ambience and constant classic rock music. I always get the Yowza Burger because it is a little spicy and very delicious. It's strange how fries cost extra, but the cottage fries are pretty good, too. The restaurant takes reservations on Open Table, which is convenient and a time saver. The service is also friendly. My only criticism is that it takes a while to get drink refills and especially to get the bill. You would think they would want to turn over the table to get the next people seated; however, I definitely recommend this place and I will be coming back.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/1u5-CkRZvXPxOSDlBYDhxw/348s.jpg", "caption": "Yowza Burger"}]}}, {"review": {"des": "I am so so glad I found RJ Grunts! I had no idea it's the original Lettuce Entertain You restaurant. This place is an absolutely must!! They have an all you can eat salad bar and it's absolutely divine. The selection is aplenty and bountiful. The items are always fresh and stocked. The soups are ever changing and always hot and delicious. The chicken pot pie soup is one of my faves. You seriously can't go wrong here. The Works burger is also another favorite. It has the works on it i.e. lettuce, tomato, mayo, etc. it comes with cottage fries and a pickle. And those fries are to die for. Honestly if you're ever in Lincoln Park do yourself a favor and stop in at RJ Grunts.", "pics": null}}, {"review": {"des": "This is my second time ordering through Grubhub and will most likely be my last.  <br><br>I was looking forward to the Turkey Club Sandwich and BBQ Chicken Wings.  Both were incredibly disappointing.  <br><br>The Turkey Club was not held together with tooth picks and fell apart making it impossible to eat. No pickle spear or french fries either-bummer!<br><br>The BBQ wings were breaded and the breading was hard as a rock (who breads chicken wings?)...in addition they had a \"do it yourself\" sauce the wings-I ordered out because \"I did not want to do it myself.\"  Furthermore, the blue cheese dressing tasted plainly processed-no chunks of blue cheese or tanginess.<br><br>The whole meal went right in the garbage.  <br>Really, really disappointed...waste of money.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/b3yDfiQpf2p3uP0n7Bt0vA/348s.jpg", "caption": "Hard as a rock breaded wings"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/fczPHyvV5adIBBspE4R9Lg/168s.jpg", "caption": "Sauce for wings and blue cheese sauce and celery"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/6Gy87ITsZ7jpG8tgcuUk9Q/168s.jpg", "caption": "Breaded wings with do it yourself sauce-disappointing"}]}}, {"review": {"des": "You know the feeling when you see the name of a restaurant and you just gotta check it out. I instantly knew that I am going to like this place, and oh, I so did!<br><br>The salad bar, burgers, fries and milkshakes..they are all worth trying. I had the veggie burger with a honey oats bun and Cottage fries, which are the house fries. They tasted really good, almost like kettle chips. Sweet potato fries are perfectly cut out and crisp.<br><br>I was very impressed by the staff and service. They are very friendly and will make sure you get all that you need. The ambience and music is well suited for all occasions.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/-vgUAfpnJ69inF6_kvqPkw/348s.jpg", "caption": "Veggie Burger with the House fries aka Cottage fries"}]}}, {"review": {"des": "Lil' helpful tip I learned here: If you have or download the Lettuce Entertain you app before paying your bill, you can earn points to save money on your next trip here or at other Lettuce Entertain you restaurants -- but our waitress was so sweet that she told us that before making us pay. OKAY, NOW ON TO MY REVIEW!<br><br>If you're ever at Lincoln Park Zoo and are looking for somewhere to eat nearby, this will always be my no. 1 suggestion, whether it's just you and a friend or your whole family. I live in the area now, but this is a fantastic spot for visitors as well, because the menu is vast, there's alcohol, the ambience is warm and vibrant, and it's in a fantastic location. It's also fairly large inside, which is lovely because it usually means shorter wait times (at least the few times I've visited during peak hours!). And if there ~is~ a wait time, they're on the OpenTable app and also take phone reservations.<br><br>I went here with my boyfriend this past weekend because I had a hankering for American-style food and hadn't been here in quite awhile. I ordered the Yowza burger, which had not only ketchup, but SPICY ketchup, along with that good pepperjack cheese, smoked bacon, tomato, and lettuce. I wanted the classic American evening dining out on the town, but got an EXPERIENCE. <br><br>I also had a glass of wine. Obviously we know all wine is good, but my waitress *knew how to pour*, because that baby was filled pretty close to the brim. That's what I'm talking about! She was also informative and not overbearing, which is always lovely, because I get weirdly jittery if my table is visited too often and I haven't made progress on my meal! That's just me, one day I'll learn to relax. Maybe not. <br><br>TL;DR: RJ Grunts is placed in the \"American\" genre of food here on Yelp, but a meal here is anything but ordinary. It's always a joy coming here, especially because there are so many items on the menu I've yet to try! Rock on, Grunts.", "pics": null}}, {"review": {"des": "I mean, if you like reaaaaally greasy American food this place is okay. <br><br>I normally love Lettuce Entertain You restaurants, but after two visits to RJ Grunts, I'm just not a big fan. The first time I came here was with a big group. It was chaotic, and a lot of the food was incorrect. But the vibe was cool, and when a friend and I were looking for a place to grab dinner on the 4th of July, it seemed like the perfect, all-American spot! Greasy burgers, alcohol-infused milkshakes, what more could you want? But the menu is so big, it's almost overwhelming. My grilled cheese was so soaked with grease it was dripping, literally. And despite two types of cheese, tomatoes, and some really really fried bread, there wasn't very much flavor. And same with the enormous amount of chips that were served underneath.<br><br>The highlight of the dinner was DEFINITELY the milkshakes. Although smaller than I'd remembered, when we asked about the \"big kid\" shakes, they said they can do pretty much any alcohol in any flavor. Again, slightly overwhelming -- where to even begin?! But coconut and baileys was a good combo, and I (almost) regretted splitting it with my fiancé. <br><br>Overall, I've definitely had better, and most certainly, the Lettuce brand is known for better. But if you're by the zoo, it's not an awful option. Just know what you're getting yourself into!", "pics": null}}, {"review": {"des": "Love this burger place.  My mom introduced me to this place she has been coming since it opened in 1971.  It had a neighborhood feel and great burgers and chips.  This was also the first salad bar in Chicago.  It looked really good!  I will try it next time i come.  It has portraits all over the walls that my mom said was staff and customers.  I thought that was a pretty nice touch.  The waitress we had was very attentive and friendly with a great sense of humor.  We got a seat by the window which was nice on a busy Friday evening to people watch inside and out.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/XndUAFwgDYcrUYP6fT6giw/348s.jpg", "caption": "Peanut butter shake"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/QpXlZi8kpJ8Rb-hDWYanpg/168s.jpg", "caption": "Bacon cheeseburger"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/9K9C2wC-KquedzfYnxfGhg/168s.jpg", "caption": "Works burger"}]}}, {"review": {"des": "Had the peppercorn burger with sweet potato fries.<br>I would recommend do Not order the sweet potato fries. They were cold and soggy, but even if hot...they are shoestring cut and kind of hard to eat. <br><br>Peppercorn burger was phenomenal. And..... the chocolate peanut butter shake was one of the absolute best I've ever had. <br><br>I'll definitely be back for a burger & shake.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Snb54RLygGNXowVLI4kjow/168s.jpg", "caption": "Chocolate peanut butter shake. One of the absolute best I've ever encountered. A++"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Q9Zejk4pEpoICr7I7LIZBQ/168s.jpg", "caption": "Peppercorn burger was A++. But the sweet potato fries were horrible... cold and flimsy."}]}}, {"review": {"des": "We were there on a Sunday, so for like $1 more or something, you can get some hot food with the salad bar (aside from just the hot soup that it typically comes with).  My son and I were all over that.  I especially liked the pecan french toast and the fact that the salad bar had so many options on it.  The tight quarters made getting to the salad bar difficult at times, but we made it work.  I spent more than I was planning to for lunch this day, but at least it was worth it.", "pics": null}}, {"review": {"des": "Uninspired food with an overcrowded ambiance.  All you can do is grunt.  The water decanters are pretty stylish and the location is ideal.", "pics": null}}, {"review": {"des": "Went here as a party of 7 - originally we were supposed to go to Oven Grinders but didn't want to wait 2 hours, so this place was around the corner. Had to wait about 20 mins or so for our table - luckily plenty of room at the bar. <br><br>I should say I haven't been here in probably 25 years or so - and I'm a lifelong Chicagoan. My past forays to this place were because I was working in the industry, at the time, and my coworkers knew some folks who worked here, so we would get super cheap drinks. It hasn't changed a bit, for better or worse. Even the food is exactly the same - it's hard to find something reasonably healthy here. <br><br>I get why they don't update the interior or bathrooms because they want it to stay exactly the same, but they crammed 7 of us in a booth in the back and the tables are super close together - seems like a nightmare for servers.<br><br>I had a patty melt and it was just meh. No one else was super impressed with their food, either. The wine was good, and reasonably priced, too. Many other options in this neighborhood, go elsewhere, you're not missing anything.", "pics": null}}, {"review": {"des": "This is a place to get a burger and/or a salad.<br><br>There is a salad bar with a lot of good options.<br><br>It's been around forever.", "pics": null}}, {"review": {"des": "This was my first time ever coming here. Came here from spending a day at the zoo with my boyfriend. I looked up restaurants near Lincoln Park Zoo and this was the first one that came up. I saw its reviews on yelp and it looked fairly good to me my bf and I decided to try it.<br>We were very pleased with the restaurant! Good service, food came out quickly and tasted great, relaxed and dark atmosphere, and totally reasonable prices.<br>Food was great and would definitely come again!!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/YuP3m2A5-v9oyuRNrbPoMw/348s.jpg", "caption": "Farthest: buffalo wrap with fries Closest: santa fe wrap with no cheese and their  cottage fries"}]}}, {"review": {"des": "I am a huge fan of Lettuce Entertain you restaurants and RJ Grunts is no expectation. Our server was delightful and the food delicious. <br><br>I was disappointed to find the gin fizz had been removed from the menu since my last visit and would LOVE to see changing table in men's bathroom!", "pics": null}}, {"review": {"des": "Loved the feel of this retro feeling restaurant!  Walls were covered in photos of woman and a few men that Had worked in the restaurant over the years. It was a fun retrospective look at the restaurant. They both to be the first salad bar in Chicago. Although not huge it offered a wide variety of options.  Near the zoo it was a great stop for lunch before heading out.", "pics": null}}, {"review": {"des": "Great place stopped in during a lakefront bike ride. Loved the salad bar, the milkshakes, and the turkey burger. Our server seemed very busy but was attentive. Would certainly stop by again.", "pics": null}}, {"review": {"des": "Good joint for comfort food in huge portions, way more then I could eat. Very popular, but we were seated right away. Very friendly staff. Opened in 1971 and there are picture of all the staff since on the walls. There is also a disco ball, funky chandelier and Greek goddess statues. Worth stopping in.", "pics": null}}, {"review": {"des": "I came here for my sister in law's birthday original lettuce us entertain you restaurant which had a bit of charm and was all round fun<br><br>Ambiance The tables are close to each other but when you consider the history and the feel of nostalgia with the pictures of all the old waitresses on the wall you understand. This restaurant is a monument to a by gone era which should be celebrated for what it is and the fact they have been serving good quality food for a long time.<br><br>Staff The staff were very attentive always walking around and willing to answer any questions. It was refreshing not having to look for your waitress for an extended amount of time<br><br>Food I know most people come for the salad bar but I love meat so I went with the burgers. The portion sizes are huge and the sweet potato fries were excellent.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/XFZDkaAqD9YPQvruyxsnyQ/348s.jpg", "caption": "Have to Love the disco ball and the music"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ItSYNV6y9uMETATxb3n8EA/168s.jpg", "caption": "Yowza burger with sweet potato fries . Huge portion size"}]}}, {"review": {"des": "I figured it's about time I reviewed RJ Grunts since I have been going here since the 1970's.  Of course, I am a little biased because this is one of my \"family restaurants\" where we go for special occasions and such.  <br><br>The burgers here are great.  The green chili burger and the mushroom swiss are the best.  The works is a great simple basic burger too.  I love the French onion soup with the cheese on top.  <br><br>But nothing, absolutely nothing beats the salad bar.  Years ago the salad bar was free with a meal but times change and I am not going to complain.  The salad bar is absolutely fresh, cold and crisp with so many choices for toppings.  <br><br>Plus it comes with soup.  Sometimes I just go by myself for a salad.  RJ Grunts is awesome.", "pics": null}}, {"review": {"des": "My first time at RJ Grunts was great. I got the grilled cheese and a chocolate milkshake. The grilled cheese came with chips that were still warm. The chocolate shake came in a diner glass topped with whipped cream and the metal cup it was blended in on the side (with a few other glasses worth of milkshake). Everything tasted great.<br><br>The ambiance was bustling and cozy. The lighting where I sat was dim. The walls throughout the restaurant were covered in portraits and artwork. Upon entering, I noticed the acclaimed salad bar. Walking through the restaurant and getting settled in at my table, I got the sense that many years of diners had felt the same warmth and comfort that I did. <br><br>RJ Grunts is the original from restaurant group Lettuce Entertain You. I will surely explore more restaurants from this group in the future.", "pics": null}}, {"review": {"des": "We came at an off-time during the day, 2 PM and since it is such a small establishment, it was still busy. We wait about 20 minutes for a table, which isn't bad at all. <br>We ordered and waited almost 45 minutes for our food!!! Everyone around us got our food before us, even though they say after us. We had our 6-year-old with us, who kept asking why we didn't have our food yet. <br>By the time our food did come, our drinks were empty, but no refills came.<br>The saving grace, and reason the rating is so high, is the food. <br>It was one of the best cheeseburgers I have ever had. When I asked for pickles on it, I expected a couple thrown on, but they loaded it up just like I love it! The kids meal was adorable, and my husband's wrap was perfect for him.<br><br>So overall, service is subpar, but food is phenomenal!", "pics": null}}, {"review": {"des": "Great French Onion soup. Always a great atmosphere. The burgers are pretty good too but not phenomenal. I think they could offer a brioche bun or a pretzel bun. The salad bar looks amazing but have yet to try it. Been here a few times, I always get well done burgers. One time I ordered the lamb burger and it was raw. It's a great place though. Legendary!", "pics": null}}, {"review": {"des": "Impressive salad bar, good soup, decent brunch buffet and superb service from the staffs. Very kids friendly too. Will definitely be in my favorite restaurants list.", "pics": null}}, {"review": {"des": "Wow! What a meal! I ordered a cheeseburger with French fries and was extremely impressed with both quality and quantity of food. My roommate got the works burger with cottage fries and also was very impressed with her meal. To top it off, we ordered a chocolate malt. You get a lot of food for what you pay, and you get to enjoy a quirky and fun atmosphere while eating. Staff was friendly and service was quick. This has been one of my favorite places I've eaten at since moving to Chicago, and I will definitely be returning soon!", "pics": null}}, {"review": {"des": "I've been here before, years ago. It's still the same. Really great salad bar, good soups. Our waitress was amazing. She was super attentive. They leave you water on the table. It's reasonable pricing-- think it was $50 for 3 people. I had the salad bar, my aunt had the fish and chips plus the salad bar, & my mom had the burger, which came with enough fries for like 5 people. Overall great place.", "pics": null}}, {"review": {"des": "I had not been here in a long time, but today after a visit to the Chicago History Museum this was the perfect way to top off a day. After a wine-glass mishap, which the waitress gladly replaced, I hit the salad bar and asked for grilled chicken to be added. It's a good mix of ingredients, and it included soup, a good touch on a cold day. I was not thrilled with the un-wrapped multigrain crackers so I steered clear of them. I seem to remember bread or rolls, which I would have appreciated but fine whatever. My party enjoyed their food too, especially the ice cream brownie, but not so much the mac n cheese, he was not happy with it.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/hG_Ph4XFAyoEqNFmctz49A/348s.jpg", "caption": "RJ Grunt picture"}]}}, {"review": {"des": "RJ Grunt was so good and so family friendly. My kids loved the grilled cheese. And the mood was so fun.", "pics": null}}, {"review": {"des": "RJ is basically across the street from Lincoln park zoo, it's kid friendly, friendly and efficient service, and the burgers taste better than what is offered at the cafes/restaurants/food stands in the zoo. But if it wasn't for its location I would not eat here. I've been to another RJ location and the food also failed to impress. <br><br>For this particular visit my hubby ordered a burger, I ordered the tuna sandwich and a grilled cheese for my toddler. <br><br>My hubby liked his burger, my tuna fish was edible but not my favorite. The house made chips that came w the burger and sandwich tasted old and soggy. My daughters grill cheese was sad and her fries cold. <br><br>Overall I thought this was a comfortable place to stop by for a quick lunch before heading back to the zoo. While we were there it was mainly tourist dining amongst us and a couple day drinkers at the bar.", "pics": null}}, {"review": {"des": "The ambience is a little weird but the food is delicious. I felt like I stepped back in time to a restaurant in the mid-80s, complete with plastic table clothes and a salad bar. I can see why this is a classic Lincoln Park staple.<br><br>The crowd was mixed - there were a lot of families and elderly people here in the early evening. Menu is a little overwhelming but the comics are amusing.  Service was good.<br><br>I got the deluxe grilled cheese with fries and was not disappointed - we were in the mood for good American food. Boo got the French Dip with fries and said it was delish. The soup was mediocre but cheap.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/AxaZ7muAwE37O6t6X5bJhA/348s.jpg", "caption": "Deluxe Grilled Cheese w/Fries"}]}}, {"review": {"des": "I ordered the buffalo chicken sandwich and fries on uber eats - so good! The sandwich was pretty significant and the fries held up well through the delivery process. It came with a side of bleu cheese and I also got ranch dressing. Both were really good (not like Hidden Valley ranch if ya know what I mean). All in all really good and would order again!!", "pics": null}}, {"review": {"des": "Yummy yummy yummy. Not a lot to choose from when you're in the area going to the zoo, but RJ Grunts doesn't feel like your last resort. Service was friendly, helpful in choosing an entree, and fast. Food was delicious- I had the mr beef chicken sandwich and would highly recommend it. The chips though! Homemade chips are bomb. Stop in, relax, eat. You won't regret it.", "pics": null}}, {"review": {"des": "Awesome time. Good menu, something for everyone. Great food. You will not leave hungry or disappointed. Awesome service. Kristen was our server and she was always attentive and pleasant despite a full Saturday night crowd even taking a moment to talk to us. Kristen's recommendations made for a wonderful experience. We asked Kristen again for her recommendation for which shake to split and again her advise was on point. Would highly recommend. Definitely going back to check out some more menu items. If you are looking for a new place to try this is it!", "pics": null}}, {"review": {"des": "It has been quite awhile since I have dined in the original Lettuce Entertain you Restaurant and I was quite please with our evening.  We quickly opted to go here after another nearby location would not take walk ins.  We were told it would be a 25 min wait for a table but was found only 10 min.  Although the salad bar is the crown jewel of this restaurant we did not partake in it.  They do claim to be the founders of this concept.  A carafe of margaritas was shared by myself and my mother and a great start to our meal.  My 4 year old ordered as soon as the waitress arrives and so the hungry kid was quickly fed.  My French dip was all I ever wanted it to be: plenty of jus, lots of horseradish sauce and the bread while soft still had a from and flaky crust.  My mother's fish and chips took care of her craving and my husband devoured his grunts burger.  Major props though to our waitress who very eagerly gave my daughter a bowl full of cantaloupe from the salad bar when asked!  Thank you!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/FjHBVSt7BAkNAqNwm282Xw/348s.jpg", "caption": "Kids hot dog"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/aNqD5R3HazHo3dKwj4OmwQ/168s.jpg", "caption": "Margarita, milk and a happy 4 year old"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/8RFU91bIGr3CjF3QvrX41A/168s.jpg", "caption": "Fish and chips"}]}}, {"review": {"des": "It gets the job done when you need a burger fix but it is pricey. Apps and the salad bar cost too much, sandwiches are normal price. I love the salad bar but its hard to justify $15-$16. Who can eat that much salad??? Boozy milkshakes are great, they have basically any flavor you want.", "pics": null}}, {"review": {"des": "I had a grilled chicken sandwich with cheese and it was nothing special.  Service was OK.  They are known for their salad bar and burgers.  It was kind of busy for lunch but no waiting for a table.<br><br>They have many pictures of females on the wall.  I asked about them and supposedly every waitress that has worked there has her picture on the wall.<br><br>It is overpriced and near the Lincoln Park Zoo.", "pics": null}}, {"review": {"des": "RJ Grunts is my home away from home! Their wings are the best in town. They're more heavily breaded if you like that style.<br><br>They have great burgers, sandwiches, milkshakes, you name it. It's a classic spot. The staff is friendly and the music is fun. I highly recommend if you're looking for a quick bite to eat in Lincoln Park.", "pics": null}}, {"review": {"des": "We went for the Sunday Brunch based on recommendations from others and it did not disappoint. We were greeted and seated immediately, our server, Norma was knowledgeable and very attentive.  The brunch buffet was good and everything was well stocked and fresh.  We will definitely be back.", "pics": null}}, {"review": {"des": "Really enjoyed RJ Grunts.  Our server was very friendly and she recommended the<br>Brunch buffet, so we gave it a try.  Much higher quality than any other brunch buffet I've seen and there were many fresh topping choices for the salad.", "pics": null}}, {"review": {"des": "The burgers are delicious, though the amount of meat was a bit too much for me (I'm more of a quarter pounder girl). The cheddar cheese on the green chile poblano burger I ordered would have been better melted, but it added a nice flavor to the overall burger. I really loved the potato chips that came with the burger, being chewy in the center like they had been freshly sliced from potatoes.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/fTtG2Vi1p0v_7S3_ln6X8w/348s.jpg", "caption": "Green Chile Cheeseburger"}]}}, {"review": {"des": "We came here for a work outing for lunch. It's a cute place, extremely tight. It is apparently an institution since they had the first salad bar. I was told that so don't hold it against me if I am wrong! <br><br>It was a decent selection for the salad bar with 2 soup choices. It was $15 for a meal and $8 (I think) as an add on. Too pricey for veggies for me. <br><br>Burgers were okay. They didn't fit the bun and if I place is supposedly known for their burgers I expected at least that. One vegetarian said that was the best veggie burger he ever had so that was good. His patty fit the bun, just sayin'. <br><br>The potatoes were better than the upcharge skinny fry option. The sweet potatoes fires come thin as well if yo go that route. They were like butterfly fries but a little thicker which I really liked. <br><br>Another good thing about this place was the proximity to the zoo. Quick walk and you are there if you are planning an outing. Just make sure to go during an off hour so you will not have to wait as long.", "pics": null}}, {"review": {"des": "This place is GREAT on so many levels.<br><br>1) Service <br>- One of those places where the waitress gives you the perfect amount of attention (there when you needed them and not annoying or hovering)<br><br>2) Environment <br>- Prime location in Lincoln Park <br>- Such a cute interior.  Vintage, disco funk vibe. Very cool<br><br>3) Food<br>- Order anything, you can't go wrong<br>- Recommend the wings, burgers, nachos, or wrap. I've had them all and they were so so good.  <br><br>This place is perfect if you want really good American food.  I am so happy with my experience at RJ Grunts!  Be back soon!!!", "pics": null}}, {"review": {"des": "Yum! This is both a delicious and fun place to dine. Fab salad bar. Fab beer list. Great wings (meaty, spicy, and covered in sauce). Great burgers. Friendly and attentive service.", "pics": null}}, {"review": {"des": "I have had better experiences since the disaster at RJ Grunts.", "pics": null}}, {"review": {"des": "No strollers allowed = no business from me.<br>I came in solo with my 5-month-old daughter who was in a light, collapsible stroller. \"We don't allow strollers inside... I can get her a booster seat or a highchair?\" She is too small for either.<br>Across from the zoo and you don't allow strollers? <br>Support the zoo and their staff; eat inside it at one of the cafes.", "pics": null}}, {"review": {"des": "Good consistent spot for take out. Can't go wrong with any of their sandwiches/burgers. Best part is that they are quick with their take out. Favorite thing about RJ Grunts is their milkshake. I've yet to have a bad combination there. Favorite has been peanut butter and Oreo! Give it a try, you won't regret it", "pics": null}}, {"review": {"des": "Rj Grunts is a solid three stars.<br><br>Their food is okay when I'm hungry and want something quickly. I live down the street from it, so it works in a pinch. <br><br>Their fries aren't very good, but I think of Doc B's sweet potato fries when I eat them. 2/5<br><br>Burgers - they're okay. I usually get the works with chipotle mayo. They're not very juicy, but not too dry. 3/5<br><br>Oreo shake- I love this shake! It's pretty pricey, though. 4/5<br><br>Hot wings - I get the hottest kind with ranch instead of blue cheese. I really like these, and usually get 16 at a time. 4/5<br><br>I think they took away happy hour, which is sad. A few days ago I went there, and the sign was down. If so, I'll eat there less than I already do.<br><br>Their waiters are soooo ehhh. Especially when you go there for just happy hour. They act like they don't care about you bc they think you won't tip. <br><br>If you're at the zoo and want something to eat, this place beats the restaurants in the zoo..so that's something.", "pics": null}}, {"review": {"des": "Price and food are fair for the area! Fast service, and cool place. The buffalo nachos were very different and delicious!!! The only con was the ladies washroom, very small, and wasn't in service for the only stall being available.. but still enjoyed my visit!", "pics": null}}, {"review": {"des": "The first lettuce entertain you restaurant and still one of the best. I try to go anytime I'm in the area. Such a cozy and warm atmosphere and vibe. With dark wood textures and hundreds of photos of old staff members from the 70's throughout the walls. They opened in the 1970's and and they noticeably only play music from that era. The staff is always friendly and warm. <br>As far as the food goes it's too notch. The salad bar is awesome and they cut no corners with home made dressings and incredible soups. You can get it as an entree or discounted when you add it to another entree! It's definitely a great deal. The pricing here is definitely fair. The burgers here are also phenomenal! I'm a big fan of the sweet potato fries and the chicken sandwich as well. This is definitely a must visit restaurant in Chicago!", "pics": null}}, {"review": {"des": "Milkshakes have always been great but in the last two weeks it's gone from milkshakes to flavored milk. Are they trying to cut costs? It's a shame.", "pics": null}}, {"review": {"des": "Be wary of places that say World's Best Burgers. Good service, average burger. Salad Bar was very good! Great location...", "pics": null}}, {"review": {"des": "The service was fine and the bus svc late.  The hamburger was tasty but that French fries and cottage fries I would not serve to me dog. The salad bar was a bit dirty and needed wiping.   I truly love lettuce and this was his first. The location needs a facelift. Yes memories of goin here 30 plus years but a place can be old ;that is fine. Just provide fresh potato's.  Seems that the oil hasn't been changed in a while.  Disappointing quality.  I'm only doing this review because open table keeps on sending me reminders to review.", "pics": null}}, {"review": {"des": "Great burger place in Lincoln park.  It's an easy go to when you are in the area.  The salad bar is a fun add on, but pretty old school.  It's almost like a trip into the past here, but it's a good one!", "pics": null}}, {"review": {"des": "Burgers were very good as was the salmon special. Great place to go after the zoo. Would recommend! It's a little loud.", "pics": null}}, {"review": {"des": "Let me start off by saying the food at RJ Grunts is a solid 3/5. However, there are so many choices nearby on Clark street, and because the price is high for the quality they only get two stars from me. The location is pretty convenient next to the Lincoln park zoo on the corner of Dickens and N Lincoln Park W. I live about a 1 minute walk from the restaurant, so I used to come here often for a quick meal after a long day. The interior is a \"groovy\" theme with a bunch of wacky photos and different props. If you ever order food togo you actually pay at the bar, just a heads up.<br><br>Ok now onto the food:<br><br>Super Hot Buffalo Wings 3/5: Okay so this is your pretty standard hot Buffalo wings. It has a crunchy bite and the super hot wings come with fresh jalapeno slices and some crispy onion strings. They have 16 wings for $15.95, so not cheap but not breaking the bank. The girlfriend and I used to come during happy hour (3-6 pm M-F, however I do not know if they still do this) and the wings were half off. So that was a pretty decent deal, however you had to dine in, which wasn't a deal-breaker, but I would of rather take my greasy wings up the block to my place and watch Netflix. Overall decent app if you're just looking for standard hot wings. A note: the Super hot wings actually are a little hot, so if you don't really like heat I would get the milder versions.<br><br>The burgers here are definitely a mouthful and I would say they are a notch above your other fast food burger places. The meat is more on the well done side usually and the ingredients aren't the best, but if you're just looking for an okay burger near LPZoo I would recommend coming here instead of somewhere inside the zoo (flashbacks to a pretty disgusting experience at cafe Brauer). You have to pay an extra dollar for fries, so your burger will cost you around $14-15 dollars. I personally think that's high considering you can get a wayyyyy better burger for the same price pretty much anywhere decent.<br><br>Green Chile Cheeseburger 2.5/5: This was my first burger I tried at the place and it wasnt too bad. A big meaty burger with several unique toppings and chipotle mayo (god I love chipotle mayo). I would ask for pepperjack cheese instead, which I think suited the burger better , but to each their own. The poblano chile and veggies gave the burger a nice fresh bite which I always enjoy in my food (even my greasy burgers). Overall a decent burger.<br><br>Yowza Burger 3/5: This was my new favorite burger after I tried it once. It has bacon which is always a plus when eating a burger. I would also ask for a side of chiptole mayo to put on this because...ya know. Overall I enjoyed this burger more than the green chile cheeseburger, but they aren't that much different and this one does cost a dollar more.<br><br>Fries 1.5/5: These fries are pretty much just semi-stale fries. I never really enjoyed them (maybe they just became stale suuuuuper quickly) but I need fries when eating a burger. I think if you like fries just try it and see if they are good enough for you, but remember you're adding a dollar when you choose fries with your burger.<br><br>Oreo Cookie Shake 3/5: My girlfriend love these, however I think for 6 dollars they were pretty average. Definitely not bad, but I wouldn't come here specifically for the shakes.<br><br>I think if you're nearby and want something quick you might be better off walking a couple blocks up Clark to somewhere else for a better meal. However this place gets the job done if you're hungry. The location is probably a reason for the inflated prices, however they either need better ingredients or I'll always buy a burger somewhere else now.", "pics": null}}, {"review": {"des": "The service was good, and the people are friendly. The food is definitely not as good as it used to be. The California wrap was good, but that was about it. The cheeseburger was okay. The wings tasted old. The French and cottage fries were stale. The tenders didn't have any flavor. The hot dog bun was hard. Even the lemonade didn't have any flavor. With being such a popular restaurant in Lincoln Park for many years, it has lost its touch. The menu needs an update desperately, especially with all of the new unique flavorful restaurants coming into the city.", "pics": null}}, {"review": {"des": "The \"significant pile\" of chicken tenders is actually just 5 shriveled, cut-in-half, \"tenders.\" Huge disappointment. Was still hungry after eating these. <br><br>After ordering these on Uber Eats, I called the restaurant to confirm that my order wasn't messed up. They unapologetically confirmed that, yes, there are only 5 tenders in the order, which they also confirmed aren't even full tenders. The tenders were the size of my pinky finger. <br><br>Never again.", "pics": null}}, {"review": {"des": "Classic and timeless decor from the 1960's and 1970's are all over the walls in this quaint place. They even have original tickets from the Woodstock concert framed on the wall. I also like all the pics of the waitresses that have worked there that are framed and also on the walls. Basically the walls are packed with pics and vintage decor. I really like the salad bar and every food item I have tried. <br>The only slight issue is that when it gets crowded the aisles get crammed and there is not much room to walk, move your chair or maneuver about. Perhaps the owners of this very cool place should have considered expanding the space a bit. Maybe they could have bought the space that is now a Starbucks.  <br>I am overall very fond of this place that is located across from my favorite zoo.", "pics": null}}, {"review": {"des": "When we went it was super busy,but they still found room to seat our party of 7. Our waitress was super friendly and sweet,talked to our kids a ton and made us feel comfortable with all of our kids and the space we required. Service was fast,we had the chili,which was very good and I probably liked it better than the burger I ordered,which was also good,but I didn't think it was anything to write home about l. I was expecting more from the burger since they claim it's \"the best in Chicago.\" Not bad,just not amazing. Kids enjoyed it and it had a fun atmosphere. Valet parking was definitely worth the extra money,there is ZERO parking anywhere. We must have circled the block 3 times trying to find street parking and no dice.", "pics": null}}, {"review": {"des": "I love RJ Grunts. Everything on the menu is sooo good. The salad bar and soups are also delicious. The menu is filled with bar food however, the quality of the food is much higher than at a bar. Portions are wonderful and the ambiance is very bar like. <br><br>Lettuce entertain you resturants are the best!", "pics": null}}, {"review": {"des": "My boyfriend brought me here as an alternative to a busy restaurant we had originally planned to go to. This place has amazing food ! I ordered the Engima sandwich . This is Italian beef with horseradish as a sauce and beef stock to dip the sandwich into. I think this has to be one of the best Italian beef sandwiches I have had . If you think about visiting this place make sure to try their chili appetizer . It was delicious !Overall place looks clean and staff is friendly.", "pics": null}}, {"review": {"des": "Surprisingly we got a table for 7 at lunchtime on a sat! The food was all good. The kids chicken fingers  were the beer battered kind and not frozen! $5 bloody Mary's for the brunch specials were delish! The burgers were huge and delish as well. The homemade chips were great too.", "pics": null}}, {"review": {"des": "Excellent bar and grill. Had the salad bar. Very good. A little pricey. Staff was very friendly. Nice find near the zoo", "pics": null}}, {"review": {"des": "This place isn't here to knock your Socks off. It's here because there is something on the menu for everyone. So it's great for families and get togethers. I've never had a bad meal or boring conversations with friends.<br><br>So go and do try the  bar!!", "pics": null}}, {"review": {"des": "Great music, location, atmosphere. Mostly IPA's on tap. Got a bottle of Leffe Blond which was delicious. Greasy, American bar food. Had the buffalo nachos. They were spicy. Not much cheese. Iceberg lettuce and tomatoes. Nothing else. Do not recommend. I will not come back here but it's cool that's it's the first restaurant in Lincoln Park.", "pics": null}}, {"review": {"des": "No Grunts for RJ's.. this place was superb! Totally packed for lunch but got seated fast near window & salad bar.. which was surprisingly awesome! Tons of items .. all very good! Chips salsa guac was great. Chili crock was huge and tasty. Fruit was fresh. We left full & happy and prices were on point!", "pics": null}}, {"review": {"des": "Did you know this was the first lettuce entertain you restaurant?! <br>I've always enjoyed this spot, with the retro- old school decor and great tunes, you also find yourself with  great food items to choose from. If you're a vegetarian like myself, I highly recommend the veggie burger. It was phenomenally veggie! Also treat yourself and go with the upgrade to sweet potato fries as your side, totally worth it.", "pics": null}}, {"review": {"des": "Come here for the burger and it's solid.  Good fries, service and bloody mary's.  The deliciousness factor of the burger isn't quite a 5, but the burgers are tasty.", "pics": null}}, {"review": {"des": "I popped in to pick up some milkshakes one afternoon. This grungy little place was cute. The hostess directed me to the bar area, and I was helped immediately. She quickly made my milkshakes and I was on my way. <br><br>The milkshakes were outstanding, and if you dine in, you even have the option to add booze to your shake. And who doesn't like that! My only complaint, however, is the price. $6 for a very averaged-sized shake, albeit a very delicious average-sized shake, and that's a little pricey for me for a cup of blended ice cream and milk.", "pics": null}}, {"review": {"des": "Amazing ambience. Their shakes are AMAZING. Veggie burger (with whole wheat bun) and home fries were delicious! Loved the place!", "pics": null}}, {"review": {"des": "Great service and excellent stop before touristing in Lincoln Park. Food was delicious. Wait was 0 (although I entered at 11:15 on a Sunday). Tons of families with young kids and amazing wait staff. My minus star is simply the price point. A bit more than I like to spend but honestly the food quality and service made it a bit less painful.", "pics": null}}, {"review": {"des": "Visited from out of town while attending the Okd Town Art Fair. We were sat immediately despite it being very busy, our food was delivered hot, fast, and correctly by our friendly waitress, and her recommendation of the Mr. Chicken sandwich was perfect! Go for the onion rings! They're delicious!", "pics": null}}, {"review": {"des": "This place has great burgers! The Works- melted cheddar cheese, lettuce, tomato, onion, pickle and a perfectly cooked medium burger patty. I wasn't a fan of the cottage chips so down 1 star on that. I tried the regular French fries which were great they just needed a bit more salt. Overall a great burger!", "pics": null}}, {"review": {"des": "Unique interior, friendly staff, and close to the zoo but otherwise, just pretty standard, not-too-spectacular burger and fries place. I had the green chile cheeseburger -- it was cooked pretty well and the flavors were good, but nothing too exciting. Their cottage fries (aka thinly-sliced potato chips) were ...okay. Half of them were soggy and chewy. The boyfriend and I got the $5 margarita (because why not)- and it was also just okay. PS. The sweet potato fries are not worth the $2 upcharge -- they were mediocre at best.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/g4O__Sre7EGSuaCqLP7AbQ/168s.jpg", "caption": "Green chili burger with cottage fries!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/9Gs_R_GoaYxZdaaE7oeKng/168s.jpg", "caption": "Funky interior!"}]}}, {"review": {"des": "Eh- average - small crowded- no parking- expensive.  Don't bother. Salad bar is in the worst possible spot.", "pics": null}}, {"review": {"des": "Disappointing evening.  Our Waiter did the best he could considering our drinks took  long time, our friends fish on his fish and chips were raw, the house chips were soggy and french fries were limp. The French dip was ok and burgers were good but nothing special.", "pics": null}}, {"review": {"des": "As promised, the salad bar was awesome. Ours included brunch, and the bacon was great. Fruit was seasonal and delicious. Friendly wait staff.", "pics": null}}, {"review": {"des": "Burgers are great! Split the burger of the month which was a  jalapeño cream cheese along with  the peppercorn burger. <br>Waitress was super sweet and we only waited 15 minutes to get seated on a Friday night. <br>Place is a little cramped but we managed to get a booth so that was a plus. <br>Would come back. Good location right by the zoo. <br>Pleasant atmosphere.", "pics": null}}, {"review": {"des": "Perfectly cooked Patty melt. Chocolate malt shake was delicious. My son enjoyed the chicken fingers and fries. Great local draft beer selection. There are changing tables in woman's bathroom. Great spot for after the zoo. There is a play ground right across the street.", "pics": null}}, {"review": {"des": "I have been  eating at this place since I was in high school. I have had everything on the menu and several things they stop serving. Always a great meal. My favorite is the chicken fingers with the Best Ever salad bar in my 60 years of existence. RJGrunts is a generational restaurant for my family. My parents took me here, I have taken my kids and soon my grandchildren. This place can't be beat in terms of atmosphere and food quality. Parking is a pain so the tip is to valet park for a couple of bucks.", "pics": null}}, {"review": {"des": "Lettuce Entertain You generally sets the bar high, and so I was excited to try out their original restaurant, RJ Grunts.  However, my boyfriend and I left feeling unimpressed.  We had an 8:00 reservation, but when we arrived, we still had to wait about five minutes in their crowded entrance area, though they were quoting 10-15 minute waits to walk-ins.  We were then seated at a table that was extremely close to several other parties, to the point where I felt like I needed to be cognizant of not bumping into the man behind me while eating and drinking.  We were also right next to the salad bar, which led to a lot of traffic from people using the dressings on the edge of the bar.<br><br>The food was decent; I had a burger and the chips, which were good but nothing amazing.  My boyfriend did love the wings he ordered, though, and Merkt's cheddar is an excellent complement to fries!  Unfortunately, the service was also lackluster, and our drinks sat empty for about ten minutes while we tried to flag down the waitress for another round to enjoy while finishing our meals.  The ambiance is fun; very 1970s but still well done.<br><br>TL;DR: I've seen much better from Lettuce Entertain You.  Slow service, decent food, nothing special.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/C63EGQ3PuhQNWGSiOg48Vw/168s.jpg", "caption": "1970s ambiance."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/chL3tJJkx_hbIhmkcKE0Vw/168s.jpg", "caption": "Burger and chips!"}]}}, {"review": {"des": "It was my first time here since I was really really little. They say the thing there is the salad bar and the burgers. Salad bars gross me out so I passed. I had a buffalo chicken sandwich and some fries. The service was average. The food was good. Nothing bad. But nothing great either. The space is pretty small and the parking sucks which isnt suprising for somewhere in Lincoln Park. If you're close stop by but don't go out of your way. There's better burgers and better buffalo chicken sandwiches.", "pics": null}}, {"review": {"des": "Today was first time having lunch at RJ Grunts and it was a very pleasant experience! Our waitress was Liz who was very friendly, glad to see us and had patience with our many questions about the menu.  I ordered a veggie burger that was not only huge but delicious!  Also ordered cole slaw which was rather flat.  Atmosphere very comfortable....not noisy so we could converse without yelling at each other.  Nice touch having former wait staff photos on the walls.  They certainly are an important part of a good restaurant second only to the quality of the food!<br>I look forward to returning soon and trying the very interesting looking salad bar.", "pics": null}}, {"review": {"des": "This is the original LEY restaurant, as far as I know. My hubby and I live pretty close so we like to come here a few times a year. It's nothing fancy but it's fun and delicious. They are kind of known for their salad bar, and my hubby typically gets this when we come. I have attitude about salad bars and buffets (other people sneeze and do God only knows what over the food) so I tend to skip that. But he's always excited for the salad bar here. The burgers are terrific. Seriously perfection. they are big and juicy and full of flavor. They also give you enough fries for about 12 people. I've also gotten a milkshake here and they are so indulgent and rich.... yummy. I love the atmosphere- it's dark and cozy and the walls are just covered in cool photos you can check out as you wait for your food. Again- this isn't a fancy restaurant. It's just straight up good cookin with something for everyone and a super friend staff. I highly recommend RJ's!", "pics": null}}, {"review": {"des": "This is a strange place. I don't get the grunge. All the tables are packed insanely close to each other and the 'must have' salad bar is WAAAAAAY over priced for the selection. $17.00!! And the pictures all over of people who aren't famous? Good onion rings with an average chicken sandwich. Boring food. So mad when we got the bill.", "pics": null}}, {"review": {"des": "So my husband and I decided to check this place out in a saturday evening after spending time in the city... I ordered the works burger medium well and it was pretty good. My husband ordered the chicken tenders and ended up receiving the equivalent of one chicken breast cut in small rather greasy tenders. They service was fast and rather pleasant but the resturant it's self was rather small and very crowded like elbows being knocked when you pass someone  I suggest a different spot", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/j09bJo0iTDLyf6EKXa1qeg/348s.jpg", "caption": "The works burger"}]}}, {"review": {"des": "Still the best salad bar in town is at Lettuce Entertain You's first restaurant. The remainder of the food, if you choose not just to fill up on the salad bar which is very doable, is very tasty and comes quickly from the kitchen. <br><br>The bar needs a second bartender at lunch badly - one bartender cannot take care of the bar, takeout orders, milkshakes, and drinks for the restaurant. Although the bartender was friendly and capable service lacked because she was so busy. Another major issue, is do not come here if you have any form of claustrophobia. From getting caught in the revolving door because it literally inches from the host desk, to squeezing by to get to the salad bar, to bar stools that touch each other, even for non-claustrophobic it  is uncomfortable. That said, if you could handle the tightness a great place to come. <br><br>Also beware because of its size and popularity weights are frequent, although they do take reservations, which I would highly recommend.", "pics": null}}, {"review": {"des": "I WAS SO SAD ABOUT OUR EXPERIENCE! Thankfully this doesn't fall back on the bar or waitstaff. However after working in a Lettuce Entertain You Restaurant and being trained over and over and wanting to come to RJ Grunts for 6 years. Disappointed. Coming back to Vegas I was sad. We arrived at 10pm only to find out there was a late night menu. Meanings all the wraps and etc off the menu. I am not a burger person so i went with the wings. Bad idea. They were way over cooked and had a burnt sweet flavor not enough buffalo taste. Not even mild. Husbands burger had no flavor. Meat was not seasoned. I guess I just set my expectations too high. Pina coloda was good but thats all. I would try it again if i lived closer but considering i am 2,000 miles away probably not.", "pics": null}}, {"review": {"des": "I've been coming here on/off over the years and this most recent time I just left disappointed. The burger, ordered medium, was overdone and the prices are just so high for what you get.  Probably not on my repeat list which is a shame because I remember when it was good and the salad bar wasn't an insane add on!", "pics": null}}, {"review": {"des": "I'm not sure why this place has so many stars. It's just not that good.<br><br>I've heard about RJ Grunts many times and had failed to try. a few weekends back I stopped in for Saturday lunch. At lunchtime we had the option to eat the brunch salad bar or the regular menu - we decided to eat off of the regular menu.<br><br>Ordered bloody mary's as they were only $5 - worst bloody Mary's I've ever had. Neither of us could drink even half of it.<br><br>Additionally, each of us had a craving for a club sandwich so ordered that. I think everyone has a vision of what a club sandwich looks like, three layers and cut in fours. This sandwich was simply two slices of bread with a huge hunk of iceberg lettuce, slimy turkey, tomato and bacon. Not only did it look sad but it didn't take taste good either. Ordered sweet potato fries and they were cold.<br><br>I love Lettuce Entertain You restaurants but the original has some serious work to do.", "pics": null}}, {"review": {"des": "So I must start by saying that actually my meal was decent when we went to RJ Grunts, but I was the only person in our group of four who left happy.<br><br>The main complaint from everyone else was the extreme hype, combined with mediocre results. For example the \"Better Bacon Cheeseburger\" entry in the menu explains everything that is boring about most bacon cheeseburgers, the sad part is that when it comes you realize that it is a slightly above average bacon cheeseburger... exactly what it said it wasn't.<br><br>The salad bar probably was really impressive when the place first opened, but now it's pretty par for the course. The decor also feels like it's trying SO HARD to be unique or quirky, but it does feel a little forced.<br><br>Our server was very pleasant, quick, and friendly, so I have no complaints there, but he didn't do anything special beyond what would be expected. Honestly, the only reason I would come here again is if I was in the area and just didn't want to deal with the wait for Chicago Pizza and Oven Grinder.", "pics": null}}, {"review": {"des": "They have a great veggie patty; it's housemade and tastes like a giant breadcrumb (in a good way). I love the Gruntburger with a veggie patty.", "pics": null}}, {"review": {"des": "There is a new man in my life who I love and his name is Mr. Chicken!!  My husband and I met another couple for dinner on Friday night at RJ Grunts before seeing a show.  The service was friendly and speedy.  The food was outstanding and I love the decor! I was especially happy with my dinner choice, the Mr. Chicken sandwich.  I can't wait to go back!!", "pics": null}}, {"review": {"des": "How can a place that prides itself on their burgers, not have a burger on their children's menu? Well that is what I discovered when I ate at RJ Grunts a couple of weeks ago. My niece did not want anything but a plain hamburger with just ketchup, which ended up costing way more than it should have. I had the Buffalo Wrap, which lacked any and all heat with it, and was only average. The blue cheese did not pack any sort of punch, and it was on the lower side of average, but still edible. My fiancee had the veggie burger, which was a major disappointment. The burger patty just fell apart, and it was extremely bland. With the advancements made in vegetarian burger options, it makes no sense that they thing it is okay to serve something like this. <br><br>On top of how weak the food is here, you would think that it would make up for it in atmosphere. Well if you thought that, then you would be wrong. The tables are so close together, that you can barely move around. In some cases, the tables are only an inch or two away from the next table, which does not make for a good dining experience at all. One of the employees bumped into a table, spilling a bucket of ice over somebody (not any of us thankfully). Take away a few tables, and it would make things a lot less congested in the dining area. <br><br>The service was not good either. I cannot remember our server's name, because it was so loud that I could not hear it. It also took quite some time for her to bring us our drinks, food, everything. I can understand that, but when we made it clear that we wanted to get out of there, because we had a temperamental 5 year-old with us, it took her another 15 minutes just to get us the check.<br><br>Do yourself a favor, if you are hungry after a day of walking around the zoo, just avoid RJ Grunts. It is nothing but overpriced mediocrity. There are better, less expensive options a few blocks away on Clark.", "pics": null}}, {"review": {"des": "The veggie burger was delicious with a kick. The cottage fries are homemade potato chips ans these were the highlight of my experience they were amazing I don't knoq how they get em crispy and soft like that. There's a squeeze bottle on the table that contains an amazing vinegary/baslamic type of dressing and when we asked what it was, hoping for something unique, turns out it was spicy brown mustard lol so good. I love the decor, they have framed portraits of hundreds of women. When we asked for who they were, they said they were women who used to work there. All black and white photos. How unique. There's also a huge painting of a banana hanging sorta like a swing. Turns out there's no clever story behind it either. Just bizarre. Would've been cool if it solved a riddle but nope, it just is what it is. Lastly the menus. They're lame. They tried so hard to be funny but it was borderline irritating. They'd say stuff like \"mushroom swiss burger, or is it a swissroom mush burger?\" Wth? Or like they'd end each description with \"or is it?\"  STOP. Lol. Decent place. Has it's quirks but no real meaning or thought went into them sadly.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/O0sm6BOLGR5vZgdvc8DqHA/168s.jpg", "caption": "Women of waitressing past"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/nmcIr3DVG34eJfgRPAbERA/168s.jpg", "caption": "Banana swing. No story or explanation behind it apprently. It just is."}]}}, {"review": {"des": "The atmosphere is so fun. Celebrity pictures on the walls. The menu is unconventional with cartoons and interesting food descriptions. The music is all from the 70s. <br><br>Okay, I know you want to know about the food. We both had burgers, mine was mushroom Swiss, my husband's burger was The Grunt. They were both great, cooked perfectly. I loved the whole experience and will definitely come back.", "pics": null}}, {"review": {"des": "My favorite wings in the city !  Amazingly crisp and full of flavor.  Also they are the real deal size wise .  Can't go wrong with any of their burgers and cottage fries .", "pics": null}}, {"review": {"des": "This is a nostalgic yet funky place to dine. I'd choose this place again if near the Lincoln Park area. WIDE variety on the menu and vegetation friendly to the max. Deliciously fresh food with friendly staff. 10/10 would recommend.", "pics": null}}]}