{"name": "rl-restaurant-chicago", "reviews": [{"review": {"des": "Amazing place ! Just delicious. Old school America that we all miss! Great food -good quality. Well crafted drink and amazing vine list. Need to visit Chicago mote often ! <br><br>Oh yea ! The bartenders are super sweet!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/90MjQWw5H8hJ8GVa6ZVTNw/348s.jpg", "caption": "Bar"}]}}, {"review": {"des": "This restaurant has ambience. It has great service. It has fantastic food. It is probably my favorite restaurant in Chicago.<br><br>Russell the bartender is as good as it gets for the profession and the sommelier whose name escapes me was incredible last night. He had real passion and enthusiasm for his wines and his craft. <br><br>Just love RL.", "pics": null}}, {"review": {"des": "I do not normally post reviews on Yelp unless my experience was ravingly fantastic or memorably bad, and unfortunately, in this case, it was the latter.<br>I booked reservations weeks ago for dinner at RL for my birthday for 8 people: my parents, sister/brother-in-law, their baby, and some friends all arrived for the reservation at 6PM (yes 6PM because of the baby).<br>Though we were on time, 45 minutes passed after our reservation time and they still had not seated us because the prior birthday reservation seated at our table evidently wouldn't get up.  This, unfortunately, should not have been our problem. <br>I felt there was no sense of urgency to fix the issue, and none of the *three* hostesses seemed to even be aware or interested in finding a solution. I don't think I am special, I am sure they have 100 birthdays a night, but put an ounce of care into it please, so I feel like a customer and not a nuisance. <br>They made us hang out in the waiting room where the two small tables were not in close enough proximity to talk much less enough room for all of us to sit, so I perched myself on the arm of the chair so others in my family could be more comfortable. Soon after, a waiter approached to tell me the chairs had \"just been reupholstered\" and asked me to not sit on the arm of the chair. It was humiliating. I am 34 years old. I was already frustrated, and that unneeded confrontation did not help. <br>At this point, I am angry, feeling the pressure of the baby (borrowed time as anyone with a baby knows), and waiting more than 45 minutes past our reservation for no reason. I said something to the manager. <br>She, in turn, apologized profusely and offered a free round of drinks, which was a nice gesture, but then, perhaps because their hands were tied, resorted to seating us at a less-desirable table off to the side of the restaurant that was two four-person tables stuck together- as opposed to the large round table we were supposed to be seated. I couldn't even talk to my parents because they were so far away. <br>You would think the service would have improved after that hiccup, but honestly, I was surprised to see it continued to be sub-par. It was as if no one communicated to the server we had a rocky start, or a nudge to \"see if you can turn this around.\" She waited on us fairly lackadaisically, that sort of \"get to you when I can\" mindset, and it just wasn't a special experience at all, especially compared to my past experiences at RL. To top things off, they forgot one of the entrees, so my brother-in-law had to eat after we all had been served. <br>At the end of the meal, they sent out a free slice of cake (which was delicious, actually), but it was a little too late at that point. It felt like they just kept trying to Band-aid a faulty, underwhelming meal that had soured much earlier.. when all we wanted was to be seated at our reservation time, have a nice meal of the caliber one would expect of RL, and celebrate a birthday meal together uninterrupted by foibles.  The manager was really nice and apologetic, and I appreciate the effort to tape together a satisfactory experience, but it felt like a boyfriend who just keeps screwing up and offers concessions to keep the relationship going. It just didn't work out this time, and I might want to break up.\" <br>I wanted to communicate this experience to anyone who may be thinking about a Friday night birthday dinner at RL, anyone with a child, or anyone with generally higher-expectations from a 'meal at the mansion.' Don't get your hopes up. <br>When one visits RL for dinner, I think he/she plans for a superior experience to match the reputation of the Ralph Lauren brand, well- as one should expect. But that's just not what happened here. <br>I've had better service at OHOP for breakfast. <br>Sorry guys, but get it together. It's a 2 star from me this time.", "pics": null}}, {"review": {"des": "The RL Restaurant exudes class and attracts the wealthy crowd. The dining room is quite dark but always bustling at prime dinner time. Their complimentary lavash--a crispy Armenian inspired leavened bread--is to die for! Their dishes are on the pricier side, and definitely a great venue for a dinner date with your loved ones. Just make sure to make reservations in advanced!", "pics": null}}, {"review": {"des": "My review for RL is definitely long overdue. Located in a the most ideal spot in Chicago. This place is truly for the locals and customers who respect and enjoy the classic vibe of the place. <br><br>Simple menu: The food is always consistent and you can't go wrong with trying each dish on the menu. If you like fish and wonder if it's going to be good here...yes,  it's yum. Of course, you can't go wrong with the steak. If you get a chance, make sure to try one of their desserts too. To me, everything is made with care.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/POH7g8eGMqWfNJV7C7vAdA/348s.jpg", "caption": "Sea bass"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ldcxUlZVDutY86jvQUHW1Q/168s.jpg", "caption": "Bone - In Ribeye"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/S5kO5ry-aVtjv2Etqk8zsw/168s.jpg", "caption": "Cobb Salad"}]}}, {"review": {"des": "Came here on a Monday night and they were slammed! So happy I made reservations! The atmosphere was authentic and traditional. I love the art on walls and design of restaurant. It was a class act! Our server was Jafar, and he was amazing! We could not of gotten a better server! He was outstanding! The entire staff was accommodating and checking up on us. The food was wonderful! I had scallops for entree and the drinks were delicious!! Can't wait to try out RL's other places in other cities!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/GEVrOHTqPk9YrBqpBdMErw/348s.jpg", "caption": "Loved all the little touches!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/k8B_rYEKConaLTVto8-rzQ/168s.jpg", "caption": "Amazing French gimlet"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/e-zU1fHUdUtHiu4ygmrPMg/168s.jpg", "caption": "Wonderful cocktails"}]}}, {"review": {"des": "Had reservations at 1:15 for lunch and were seated on time. It was the day of the parade, so it was packed. We were happy to get a table in the bar at 12:15, an hour before our reservations, to sit and rest our feet while enjoying a glass of wine. We were so happy to get the table in the dining room and have lunch. My daughter had the chicken club. I had the lobster bisque and the beet salad. The service was excellent! We enjoyed the bread and butter. There was a flat bread with sesame seeds that was yummy. Portions were ample. We had a cup of coffee before heading out for more shopping.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/FGHysa4Obp10TRsXRTcc7g/348s.jpg", "caption": "Interior of restaurant"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/IX6BqkM_On4fbjlWJMvf_w/168s.jpg", "caption": "My daughter Angela"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/_vWc3Q7drej_0JLObn72mQ/168s.jpg", "caption": "Red roses on tables"}]}}, {"review": {"des": "Really bad service, as if I'm begging to be there. My friend took me there for lunch for the first time and when we walked in, we were greeted by a basic brunette girl dressed in preppy outfit. She said hi, but with an attitude like she only did it because she had to. She sat us down and forgot to give us a drink menu, but remembered to give everyone else one. <br>The menu was simple, everything on it looked good. The waiter was much nicer, but not every attentive. We finally had to ask the waiter for a drink menu, it took 30min to get 2 mimosas on the table.  <br>The food was pretty good, but honestly not worth sitting through the bad service. Rather go to some overpriced restaurant with equally good food and great service than dealing with a bunch of snobby people who thinks they are too good to be a waitress/waiter but obviously not because they work there and look miserable.", "pics": null}}, {"review": {"des": "First time here & the food was great!! Everything was delicious.  I would definitely return.  I wish I had known about it sooner.  They had an amazing scent in the bathroom which happens to be from their Ralph Lauren candle selection.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/qHRjRlTrRhWKRNr2UMSD8A/348s.jpg", "caption": "First time here and it was great!! Definitely recommend"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/6UvRmTdxEXKJolI5CnoWIg/168s.jpg", "caption": "Calamari!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/xTTJHTm89WUmaAYxh-oZsg/168s.jpg", "caption": "Caesar Salad!"}]}}, {"review": {"des": "On my 400th review and a perfect time to celebrate using my new 2018 Elite Yelp Status by eating at my favorite restaurant in the entire world.<br><br>I wish Yelp had a Sixth Star for the ultimate dining experience but since its only Five Stars then so be it.<br><br>We came here for my mom's birthday and everything was beyond awesome.  We made the reservation with Anna who right away was extremely friendly from the start.<br><br>Upon coming into RL's we were greeted with a smile and sat right away. Lucas was our waiter and like Anna he was beyond awesome. The service is impeccable here as your drinks are refilled, bread refilled, and everyone checks in on you to see how the dining experience is.<br><br>Everything from the caesar salad, to the filet, and the dover sole was cooked and prepared to perfection. <br><br>I wouldn't of picked a better place to celebrate my mom's birthday as RL does not disappoint.<br><br>Five Stars for awesome ambience, awesome service, and awesome food!!!<br><br>When in Chicago this place is an absolute must!", "pics": null}}, {"review": {"des": "Solid Americana. Reliable from every aspect.<br>Lovely burgers, good lobster roll, funky liver, etc.<br>Nice bread bites.<br>Good dessert and coffee.<br>Dependable service.<br>A bit over priced for what it is...but given the location, and the name cannot really complain.<br>I have been there many times in the last 11 years we have lived in Chicago. <br>Nice for rainy days in downtown. Lovely for sunny days, eating in their \"patio\" on the street.", "pics": null}}, {"review": {"des": "Went there for dinner the other night. Very nice and kinda upscale atmosphere. Hostess was pleasant, she took our coats and showed the table. Our server was very knowledgeable and personal, which is great. We even end up having a conversation about movies.<br>We started with avocado and crab appetizer with was amazing! I highly recommend. <br>For main course I had Dover sole which I never even heard of. It was nice but not worse the price ($52) in my opinion. Side dish sautéed garlic spinach complimented my fish. <br>My date had 22oz bone-in rib eye and he was very happy with it. <br>For drinks I started with classic Moscow mule and after tried Gold Coast Royale which had a great taste. <br>This time there was no room for desert, but I definitely will put it on my list next time. <br>Hope to come back soon. Great experience!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/WCQkf-XtsH-gKEMWV9Gh0Q/168s.jpg", "caption": "Dover sole with sautéed garlic spinach"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/GEVDtLXuYQFeVIQew9zjWw/168s.jpg", "caption": "Avocado and crab appetizer"}]}}, {"review": {"des": "Went here for a business dinner. <br><br>Overall a nice restaurant...environment was a little uppity for my taste though. <br><br>They are well known for their Cod dish, but were trying to push a 44oz rib eye the night we were there. These are apparently \"limited edition\" steaks from Ralph Lauren's personal ranch in Colorado. Sounds gimmicky and we didn't go for it. <br><br>The cod on the other hand was excellent. A very simply prepared fish that was absolutely perfect. The side dishes were also good. Nothing to die for though. <br><br>As you can imagine everything was RL branded and they even serve the cocktails with mini Polo mallets as a stirring stick. Neat touch. <br><br>Desert was reasonable. We tried the pumpkin pie, ice cream, chocolate cake, and the brownie. Each was good, but nothing better than what you'd find at most restaurants. <br><br>Overall, the night was excellent, more so because of the company we were with than the food or restaurant itself.", "pics": null}}, {"review": {"des": "Consistent quality of both food and service! I had the veggie burger and chocolate brownie which were both like they always are 5/5 and the service was great!", "pics": null}}, {"review": {"des": "Everyone should visit this restaurant at least once in their life. <br><br>I am happy to say I've been to all three Ralph Lauren restaurants. Chicago NY and Paris. <br><br>To be completely honest, chicago is the best RL Restaurant out of them all. <br>The coffee here is awesome, and just plain black it is delish. <br>I love the soups and the crab and avocado salad <br>The burger is always tasty and juicy and perfectly cooked <br><br>The staff is A1 always and they always take such good care of you. <br>Also, Flavia is a wonderful host!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/5Xjp1oCHYvA-g9-IjQBn_Q/348s.jpg", "caption": "Escargots"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/hQIcTG-ylyTSI8IEumKMgA/168s.jpg", "caption": "Amazing dessert sundae omgoshhh"}]}}, {"review": {"des": "Simply FABULOUS. RL Restaurant may be a rather upscale establishment, but don't let that intimidate you: the staff is incredibly engaging and friendly, and the prices are very fair given the type of restaurant this is. Whether you go for brunch, lunch, dinner, or dessert, you're in for a treat! Ultimately, I would truly recommend going at any time of the day. I'm yet to order anything less than wonderful here, and I will continue coming back as a very happy and satisfied patron. Even the free bread is out of this world!<br><br>Additionally, if you're a fan of Ralph Lauren merchandise, you'll love being right next to the three-story megastore. Win!", "pics": null}}, {"review": {"des": "As usual RL was so enjoyable - the food, service and drinks were fabulous! Anytime I visit this restaurant (with my friends who go there once per week), I am delighted by the flavors of the variety of food and am amazed at how extremely packed the restaurant is.", "pics": null}}, {"review": {"des": "I came here last week for the first time for lunch and had a really nice time.  I tried to lobster bisque soup based on all the reviews.  Super tasty but very rich- could almost be a small meal on it's own!  I paired it with a salad with steak and it was delicious.  The ambiance is super cool with lots of paintings on the wall- very Ralph Lauren style.  I'll definitely be back at some point!", "pics": null}}, {"review": {"des": "I came here yesterday with my mom for my bday lunch and What an experience!!!  Everything was just amazing. <br><br>Food 5/5<br>Interior and decor 5/5<br>Service 6/5<br><br>Cocktails-<br>I ordered a Moscow mile and my mom got the Gold Coast royal. I officially dub thee, the best Moscow mule in the city. <br><br>Food:<br>Escargot- yum!!<br>Watermelon and feta salad- perfect summer salad<br>RL burger- delicious super fresh <br><br>Our server was so nice, super friendly and attentive ( RL if you're reading this please check my reservation and give our waiter a compliment because he was amazing) <br><br>I seriously enjoyed everything. We finished our lunch with a delicious chocolate cake that our waiter brought out with a candle and had Happy Birthday Andrea written in chocolate. How thoughtful and delicious. <br><br>It was my first time here and it was just beyond lovely. I can't wait to come back.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/czAmANy0m21TdZw-6jwX6A/168s.jpg", "caption": "RL burger"}]}}, {"review": {"des": "What a great lunch experience today. We sat on the patio, during a beautiful Chicago afternoon. Get the Ruben, it's insanely delicious. We got lucky when Jermey (patio) was our server. Great attitude and awesome conversation, true asset to RL. We're definitely going back and requesting him. Thanks Jermey! You're the best.", "pics": null}}, {"review": {"des": "The food here was good and the service was great. They don't have anything overly unique on their menu, but the food all tastes really great. Lots of sandwiches and basis main courses. Their latte was made very well. The restaurant was a little cramped though. Tons of tables squished into a small area!", "pics": null}}, {"review": {"des": "My absolute favorite restaurant in Chicago. So favorite that we dined her 2 time during our very short visit to Chicago.<br><br>Atmosphere is classic. Service is excellent. Cocktail and food are always perfect. Carpaccio, Lobster Bisque, Soft Shell Crabs and Lobster Roll, all  5 STARS (as good as it gets)", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/rpmBa-C0ngxFc4S-4dwBTA/348s.jpg", "caption": "Lunch: Lobster Roll"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/UDQsyirW-8Qi2Bg7Wfmmew/168s.jpg", "caption": "Dinner: Soft Shell Crabs"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Xj_kVSz6jlFJuO7iJn75qw/168s.jpg", "caption": "Lunch Cocktail"}]}}, {"review": {"des": "Whenever I visit Chicago, this is always my first stop. Breakfast, lunch or dinner - you can't go wrong. First, the ambiance is classy, and the servers are amazing! Good service is hard to come by, but the service here is on another level. <br><br>There are so many delicious items on the menu, and it's hard to choose just one entree. Many of their dishes are simple, but they do them so well. The chicken club, lobster roll and burger are just a few of my favs. The truffle fries are out of this world. As far as apps ago, the Rockefeller mussels are amazing! They aren't on the menu, but if they have the product - they will make it for you. <br><br>The drinks are really good here too. Probably one of the best Bloody Mary's that I've ever had. <br><br>RL is definitely one of my favorite restaurants. Trust me, you won't be disappointed.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/IPn8dm8buew0cvaZ4yQdTQ/348s.jpg", "caption": "Polo Club"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/RtCQFa1ASTb5cCSwMIzqZg/168s.jpg", "caption": "Lobster club"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/yHAy9aKLxuRyxoFMFnLxRw/168s.jpg", "caption": "Chicken club"}]}}, {"review": {"des": "Love this place... food and cocktails are always good.  I was surprised this time to see orange juice on the bill for a diabetic member of our party who was in need of some juice.  Rather gaudy if you ask me.", "pics": null}}, {"review": {"des": "We loved RL Restaurant for brunch! Loved how classy it is and everything is very Ralph Lauren from the monogrammed menus to the dishware. I love the navy blue and brown vibes too. We opted to sit outside on a nice summer's day. The food was excellent too.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/yXov6tdaPguFb5dFN4rrmw/168s.jpg", "caption": "Crab cakes Benedict!"}]}}, {"review": {"des": "Superb service, beautiful space and delicious food - RL Restaurant has everything you want in a restaurant. From the gorgeous interior decorated in Ralph Lauren Home to the outdoor patio for those warm summer days in Chicago, wherever you dine you will surely enjoy the experience. I visited RL Restaurant to try out the new brunch menu and was so impressed. I ordered the Gold Coast Benedict which was a salmon Benedict served on a potato cake. The dish was full of flavor and a great take on a benedict. My other guests had the turkey burger and the veggie burger and they also both loved their dishes. Highly recommend RL Restaurant for brunch, special occasion meal or a family get-together.", "pics": null}}, {"review": {"des": "Babes' best buddy from New York was in town, and for some reason, she wanted to go to RL, which is right off Michigan Ave and next to the, obviously, Ralph Lauren store. I have walked by this place a hundred times and never had the urge to dine there, seems like dining inside a Neimens or something. There are so many choices close by. But Babes and Buddy wanted RL, and babes wanted the lobster roll. I can tell you that it was a great lunch. <br><br>I we started with oysters, had some soups and all different dishes, and Babes lobster roll was outstanding. It is not a modestly priced place, but it is no more than dining at lets say, Ditkas. <br>We sat outside in a small sidewalk patio, which was nice, and inside the place, the ambiance is old school, clubby. I would stick to lunch myself, still too many other places to venture to which you are on the Miracle Mile.", "pics": null}}, {"review": {"des": "Came here with my husband and had a nice time. All of the food was amazing (even the bread basket)! <br> We had the clams oreganata, calarmari, rl burger and steak. Everything was cooked to perfection and ur wired kyle was beyond helpful and attentive. <br><br>Best burger and clams we have ever had! We will be back.", "pics": null}}, {"review": {"des": "100% recommend going to RL for lunch or dinner. The fillet mignon is absolutely amazing and it comes À la carte. I recommend ordering it medium or medium rare. The béarnaise sauce and garlic butter shallot sauce are absolutely phenomenal to pair with the filet mignon. I would also recommend the crabcake as an appetizer, it falls apart like butter. I also would recommend ordering the RL burger. The fries are also a delight. Don't forget to order cocktails, you must try the round hill!  It was absolutely excellent. The servers at RL were so kind and funny. If you looking for a great lunch or dinner spot, RL is the place!", "pics": null}}, {"review": {"des": "D first heard of RL Restaurant from a couple friends who \"checked in\" there.   He wanted to try it out and we got the chance to do so when we both had a day off on an unusually warm Friday in February.   We went just a bit after 3pm so the restaurant was not as busy.<br><br>First impressions of RL.   It felt fancy and a bit cramped actually.   There were plenty of photos and decorations to divert your eyes while waiting for your order.    We both were dressed a bit casual and I felt a little out of place.   But the hostess and wait staff were more than friendly and inviting so that feeling quickly went away.<br><br>We started out with an order of calamari & shrimp which we both enjoyed.   For our main course D ordered their Grilled Steak sandwich and I chose their Lobster Club.   D wanted his steak medium well but it wound up being medium rare instead.   Also the sandwich fell apart when he tried eating it due to the meat being chewy and not easily coming apart.   I found my Lobster Club to be soggy on the bottom and I couldn't really taste the avocado aoli sauce that was included.   Overall while we enjoyed the atmosphere and service we were underwhelmed with our meals especially given the higher price points.   Nonetheless I was glad we had a chance to try RL at least.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/oxKzYSTNEhJOTFdCllrAxQ/348s.jpg", "caption": "Lobster club sandwich"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/5P1kMmvxjeXyCGOf2jYg_w/168s.jpg", "caption": "Calamari & Shrimp appetizer"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/dDzr2655O-4mBcRypmR4XQ/168s.jpg", "caption": "What's behind those doors?"}]}}, {"review": {"des": "The restaurant was packed. I left my number and they called after 40 minutes. The service was ok, I had a lobster bisque but it wasn't hot enough. The tables are very close to one another, it is noisy.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/gLFjwTdsfIyBihb6JOyrjA/348s.jpg", "caption": "Caesar salad"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/t9_FHcdrK7hQu7LRrvNAdA/168s.jpg", "caption": "Lobster bisque"}]}}, {"review": {"des": "Excellent food and service.  My husband had the streak, my two kids had the RL burgers and I had the grill salmon which came with tomatoes on the side. All delicious and the waitress was very friendly and professional.", "pics": null}}, {"review": {"des": "This is my absolute favorite restaurant in Chicago! Great food and service! The decor gives the feel of classic Chicago with its many wall hangings and wooden decór. Captain, Christopher Yum, went above and beyond to make our evening memorable. Looking forward to our next trip out to the Windy City!", "pics": null}}, {"review": {"des": "Been back many times since our 5 star review 2 years ago, and it never lets us down.  Just pure high end classic food done as well as it can be and served with sheer professionalism.  It's our \"kids\" now all grown up, choice for any special occasion as it has so many good memories for us all now.  Keep it up ... shame about the table side stuff being restricted, had the steak Diane and banana foster that way and both were amazing", "pics": null}}, {"review": {"des": "Food was tasty but service was poor. Had to ask for a glass of water 4 times before server finally brought it. This is the kind of restaurant where you shouldn't have to be begging for water. I was very disappointed with the service I received.", "pics": null}}, {"review": {"des": "Recently went there for our wedding anniversary and we loved it!!  Our waiter Kyle was so friendly and helpful.  His suggestions were right on point!! The manager Molly introduced herself to us and was so sweet wishing us a happy anniversary! We ordered the lamb chops and the ribeye.  It was SO good!! The strawberry rhubarb dessert was amazing as well!!<br><br>Staff  5 stars!<br>Food  5 stars!", "pics": null}}, {"review": {"des": "The food was delicious and the atmosphere was very enjoyable. <br><br>It's a small setting which created a nice buzz even on a Thursday night. The staff was great from the bartender (try the old fashion) to the waiter. <br><br>The NY strip was superb and I would definitely recommend the cheesecake for a finale. <br><br> <br>We had a reservation but waited for an additional 40 minutes which was the one down fall of the evening. The staff was very apologetic and did what they could to make it right.", "pics": null}}, {"review": {"des": "Came last minute on my Birthday, which during this time of year, is a challenge.  The Hostess was extremely understanding and told me we wouldn't be able to be seated until an hour.  She could text me when we were up, so as to us being able to continue shopping on Michigan Avenue.  We were paged in 30 minutes whereas, I called in to let them know we were on our way.  Our Waiter was Jeff who mentioned if his service was great to use his name. otherwise his name was Hector (LOL).  Started out with appetizers consisting of:  Oysters, Triple Cheese Bake, Calamari & Shrimp, and Lobster Bisque.  No wine this time, since we were going to a play afterwards and would sustain ourselves at that venue with libations.  Our main course consisted of The Famous RL Burgers served in the following: Bleu Cheese, Cheddar & Bacon, Original and a Turkey Burger that in no way disappointed. definitely full, but we all made room for dessert, since it was my Birthday.  Two Brownies ala RL, Ice Cream Sundae and a 'shared' Key Lime Pie that is always consistant.  Jeff you knocked it our of the ballpark once again (We will use your correct name). Never a bad experience, for all the years we keep coming back.  Cheers!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/9Vn04y9F_eKRt5vRjK2m2w/348s.jpg", "caption": "RL Key Lime Pie..Utter heaven!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/BhZofmgaSn1XtrILm5xebw/168s.jpg", "caption": "RL Turkey Burger with Cheese!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Tj8iTFHUtD9-5NYmi4olqg/168s.jpg", "caption": "RL Gourmet Hamburger with no Cheese??? But still delicious!"}]}}, {"review": {"des": "Wow!! What a gem. My husband and I stopped for brunch. We had cappuccino (yum), mini hot dogs (which were just okay) cheese burger with fries (tasty) and great french toast! The ambiance is beautiful. We will def be back.", "pics": null}}, {"review": {"des": "I have to say that for years, this restaurant has been one of our favorites in Chicago.  Last night, it just reminded us why it is.<br><br>We had a party of 5 and sat just adjacent to the bar in a little table and booth.  Kurt picked it out for us and it was super.  The food was outstanding and predictable.  Many of us started with the lobster bisque.  Then, some of the plates that dropped on our table was the Dover Sole, a favorite all the time, seared scallops over succotash, grilled swordfish, and a couple of other entrees I can't remember--probably a result of the martinis!<br><br>A little chocolate cake, gelato and we were good to go.<br><br>As we departed, a handshake and hug from Kurt sent us in our way.<br><br>All in all--the BEST of Chicago in an intimate setting steeped in traditional look and feel--with tremendous food and people assembled to insure your experience is nothing short of fantastic.  Ours, always, is just that again and again.  Good luck to Russell on his healing back.  All the best to him.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/51zEXjzf8QIg8lwa6Uq8Rg/348s.jpg", "caption": "The Dover Sole"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/3griUQLbcnfCH7K8TaaxKA/168s.jpg", "caption": "Of course a martini"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/zyDRByfqC_FCxb3-7SlrBg/168s.jpg", "caption": "Lobster bisque--super"}]}}, {"review": {"des": "Words cannot express how impressed I was with the level of service at this restaurant. From the moment we walked thru the door we were acknowledged and given I feel one of the best tables in the house, a corner booth. Every single person who touched our table did so with such grace and attention to detail. Christina and Lucas went above and beyond expectations to make my experience one I will never forget. Lucas is a polished server who made the best recommendations and took the best care of us!! Well Done!!!", "pics": null}}, {"review": {"des": "Russell is a true gem of the mag mile.  Talk about experience, my fiancé and I stopped in for a drink and stayed for 4.  Russell made us feel like Chicago royalty.  He customized drinks, made relatable conversation, and kept us engaged!  This is the neighborhood Cheers, and I want everyone to know my name.<br><br>I will bring friends, family and colleagues back. Thank you Russell for marking the X on the map in our Chicago neighborhood.", "pics": null}}, {"review": {"des": "A really pleasant surprise and in classic Ralph Lauren style. Crystal and silver, monogrammed plates ware.<br>The Incredible paintings and scones- just so impressive.<br>The food and menu were equally impressive too.<br>Had the veal chop (awesome), Vermont mashed potatoes and Shrimp Cocktail. Large portions and impeccable service!", "pics": null}}, {"review": {"des": "Great ambiance and great service but food was not impressive. We shared the pigs in a blanket made with wagyu beef and I got the crab cake while my partner got the burger. Crab cake was a nice large serving and tasted good. Burger was also large but underwhelming in taste.", "pics": null}}, {"review": {"des": "Nothing spectacular. I went to RL as I was on Michigan Ave. I just met with my bank to purchase a home. I decided I wanted to have a glass of rosé and lunch outside to celebrate. I felt like trying RL. I asked for patio seat. My waiter came over and was so not into serving me. He kept looking around everywhere else but my table. I felt rushed. Two ladies sat next to me and they immediately got their drink right after they ordered it. I had to wait some time. My waiter brought me my wine, took my order (again, looking everywhere but at me). My order came so quickly and all at one. He said sorry as he kept on walking by my table and kind of out of the side of his mouth. He was extra nice to the big tables. Calling everyone darling, my darlings etc....I had to ask for his attention. It was weird. He could care less if I was there. Awful, experience. I expected more from RL. I ordered the watermelon salad with jalapeño and feta. I also had the turkey burger and fries. Food was delicious however, the experience left a bad taste in my mouth and I will not be going back.", "pics": null}}, {"review": {"des": "I was very excited to learn that my husband made reservations  for our special day at RL....it was packed to the max when we arrived at 8.45pm. Very quickly seated because of our reservation, the hostess was gracious to get me a black napkin so lint doesn't catch on my black dress.(which was perfect,because I am a messy eater  anyways :) )<br><br>We started off with a glass pinot for me and hubby got the whiskey cider of which he ended up having 3 that evening!! Oysters and beet salad for appetizer, main course whole chicken and Crab cake(my all-time favorite) and we shared the peach crisp with vanilla which was delish.  When we got the cheque, we were informed the dessert was on the house which was very sweet. oh, did I mention the parmesan crisps? cant stop eating them..... By the end of the meal we were stuffed  and decided to walk home. Perfect evening because of all the fond memories!!<br><br>RL is always crowded so please make a reservation, don't expect fancy interior, its nice and upscale but like dining in someone's  Victorian home, service is excellent!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/m53aR8Fx36Gm725a94GJoA/348s.jpg", "caption": "Pear  crumble with ice cream"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/SjW-lYvRBZ32GDF3aDgmMQ/168s.jpg", "caption": "The best crabcake ever!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/8QPLCPyclB4CYFvUaH-uxQ/168s.jpg", "caption": "Beet salad with goat cheese"}]}}, {"review": {"des": "Awesome, simply awesome.  Ordered the clams to share and they were so damn good!  Amazing freshness and bursting with flavor, I've been thinking about my next sampling since the moment I walked out of the restaurant.  The true highlight though was the key lime pie we split for dessert.  It was remarkable, one of the best ones I've ever eaten in my life (and I've had A LOT).  Explosive lime flavor, but delicate enough to not overpower the other components of the dish.  A MUST order if it's on the menu when you stop by.", "pics": null}}, {"review": {"des": "This has to be my favorite stop in Chicago. Grab a seat outside (weather permitting) with a glass of wine and a good book. Service and food is wonderful!", "pics": null}}, {"review": {"des": "I have heard from a number of colleagues and friends that RL has great food and service and thought it was about time to give it a try. The service was impeccable, attentive but not overbearing. Nicole did an excellent job be there and providing us with suggestions. I had the house salad to start followed by their famous RL burger and what a treat it was. The burger reminded me a little of the Gibson's burger but more flavorful and just melted away. I followed up with the brownie dessert which was also perfect, not too heavy but quite the delight. I would highly recommend RL and especially their burger, which I can safely say was the best I've ever had", "pics": null}}, {"review": {"des": "Really, RL...you never deviate from stellar expectations!<br><br>Arrived for two family members' birthday celebrations, and we closed this place. 4 hours sitting here, and we still wanted to linger longer. <br><br>We started with drinks and appetizers-<br><br>2 martinis (vodka base) for the birthday ladies: 5 <br>(Flavorful, not sweet, strong, and a bit sour; perfect.)<br><br> Cabernet: 5 <br>(We each had a couple glasses; very good!)<br><br>Starters-<br>Calamari/octopus/shrimp: 5<br><br>Entrées and sides-<br>Sword Fish + heirloom tomatoes  (choice of the day): 5<br>Dover Sole: 5 <br>Filet mignon: 5<br>RL jalapeño burger (choice of the day): 5<br><br>Sides-<br>Brussel sprouts: 5<br>Sautéed spinach:5<br>Fries: 5<br><br>Dessert-<br>Chocolate decadence cake: 5!<br>Lattes: 5<br>Coffee: 5<br><br>Service: 5+<br>Ambiance: 5+<br><br>RL- never change!", "pics": null}}, {"review": {"des": "All around one of the best meals of my life! The service, the ambience and the food were all spectacular. Just terrific!", "pics": null}}, {"review": {"des": "This place is consistently impeccable. The service is spot on. This is the standard by which all other restaurants should be measured. The food is delicious, the staff is attentive and charming. I recommend RL without hesitation, you will have a terrific dining experience.", "pics": null}}, {"review": {"des": "Usually I'd give this 5 stars, but last night the staff was so rude to me and my friend that I have to warn people. Food is good, staff is charming, and good wine list. At the end of our night they rushed us to leave and it was not even that late. Then when we asked if we could finish our drinks at the bar they told us that 'we've had enough' and to finish our drinks at the table. For the amount we were paying it was incredibly rude and disrespectful. It pains me to write this but honestly beware of this place. I won't go back again.", "pics": null}}, {"review": {"des": "Shravi Ambati, Chicago<br>Ralph Lauren Restaurant , classiest brunch ever.Loved the atmosphere,service & authentic old fashioned cocktails !!<br>Much Respect to Mr Lauren from starting a fashion line to making entree into restaurant business.", "pics": null}}, {"review": {"des": "I have to knock two stars from my last review. I'm not one to care about the size of a drink, unless it's extremely big or small. For some reason, the glasses of wine here are SO TINY! They use precise measurements, and I swear, there must be like three oz. per glass. A martini is regular-sized, but who wants to drink that during a ladies' lunch?? RL, please fix this!", "pics": null}}, {"review": {"des": "I've come for dinner on two occasions, once with a friend on a Saturday night, and another time with my guy on a Sunday. Both experiences were great. Both nights it was really packed, and yet service remained fast and attentive. I had the shrimp cocktail (awesome! huge shrimp,) crab cake (SOOO good still thinking about it,) and both the Caesar and house salads. I loved the parmesan toasted croutons on the kale Caesar salad. Light and flavorful. The House Salad just tasted super healthy. Maybe too healthy but chocolate cake for dessert made up for that. The cake was very rich, but not necessarily sweet (it was dark chocolate.) The whip cream it was served with was the best part. I cannot wait to come back! I will definitely be ordering the crab cake. Oh, and multiple French 76s.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/hTG2n2rwZgEhUUXmXbHV3g/348s.jpg", "caption": "Crab cake was awesomeness itself"}]}}, {"review": {"des": "A very fancy-pants dining establishment, that's also not that fancy? Yes - maybe that is a bit confusing. <br><br>But what I mean is - you are instantly transformed into a low-lit, library type environment when you enter. It's cute, intimate and cozy. You feel like you are in your own living room - if you lived in a large, ornately-decorated home. <br><br>We were sat promptly upon arrival (of which we made reservations.) I had a Basil Hayden Old Fashion as my drink of choice for the evening. The cocktails had adorable little polo mallet's as the stirrers. A+ for attention to detail and aesthetics! <br><br>First, the bread basket is a great freebie! The cheesy, cracker type option is divine. <br><br>For dinner I had the salmon. The pesto, cheesy glaze was a perfect accompaniment. <br>For dessert, I split the chocolate cake with my boyfriend and it was more than enough. <br><br>In a city like Chicago it's hard to pick and choose restaurants. For a good American fare with a cozy atmosphere, RL is a good route! (Also, rumor has it that once Justin Bieber sat at the window table with Oprah.)", "pics": null}}, {"review": {"des": "Me and a friend popped in for a morning cocktail and cannot wait to come back! What a GREAT place to people watch! As expected, the decor is fabulous!!!!<br><br>The service is excellent, too.<br><br>We only had a mimosa and a bloody mary (they were GREAT) but watched many dishes be served to the guests around us. We definitely had food envy and WILL be back to eat. (We had just eaten somewhere else and weren't hungry.)<br><br>Highly recommend the bloody mary. <br><br>Lobster roll looked insane! Cannot wait. <br><br>Eggs Benedict...same. <br><br>I will be back for this.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Q_plFQnV1bZDDGf7XRXLCw/168s.jpg", "caption": "Impressive flower arrangement!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/c7OOKqoyQOU_K_mV79ZCdg/168s.jpg", "caption": "Mimosa and awesome bloody mary!"}]}}, {"review": {"des": "Hey- I'm am writing this review from a vegetarian perspective.  Why, oh why, is there not a vegetarian entree on the menu?  Based on society today, there are plenty of vegetarians and vegans.  I have been to too many restaurants and they say \"tell us what you want, we can make you pasta\".  I don't want to tell you what to make, I want an entree that sounds delicious and is delicious.  So I tell the waiter to please make me a vegetarian entree where the vegetables are the focus.  He ask if I want pasta?  No, I don't want pasta I want a vegetarian entree with vegetables.<br><br>How would you like to go into a restaurant and there is no menu and the server says, what do you want to eat, we can make it?  Aren't they suppose to plan the menu?  Isn't that why we dine out, to have someone be creative and make us something special?  Anyway....<br><br>They bring me this vegetable stew with tomato water.  So incredibly bland, no seasoning and completely unacceptable.  Did anyone taste this?  Throw a bunch of cooked vegetables together and cover with tomato juice.  Just because we're vegetarian doesn't mean we want bland food.  I have eaten at quite a few restaurants that offer a vegetarian menu and vegetarian entrees based on the chefs fresh selection.  So refreshing and creative.<br><br>Come on RL.  This is Chicago, please catch up to the 21st Century and hire a chef with vegan and vegetarian experience.  This is my second experience with RL and vegetarian selection.  Both were very very disappointing.", "pics": null}}, {"review": {"des": "Love this place...it's a bit on the pricey side but well worth it. From the moment you set foot in the restaurant, you feel special.<br><br>First, it's well decorated in all of Ralph Lauren's glory.<br><br>Second, the service is impeccable.  Everyone who served us knew it was a birthday dinner because of the note on the reservation.  Our server even handed swapped my white linen napkin for a black one because he noticed I was wearing a black dress.  <br><br>Third. The food...so delicious.  I ALWAYS get the baked brie with the pears and maple syrup sauce to start.  I am surprised I am even willing to share with my BF because it's sooo good.  My go-to entree is the scallops which comes with a tomato-cucumber relish and white balsamic cream.  My only disappointment this last time I ordered was that our server accidentally pressed SCALLOP LUNCH SIZE instead of dinner size so I got one less scallop and a little bit less of the tomato-cucumber-cream side.<br><br>My BF is more adventurous.  We've been to the restaurant twice together (both times for his birthday).  The first time he ordered the salmon, this time he ordered the short rib. Both were delicious.<br><br>Desserts could use a little work.  They used to prepare the bananas foster table side but stopped doing that because of space limitations.  Tip: Go to RL restaurant for lunch or dinner then walk down Michigan Avenue to Dylan's Candy Bar for dessert. This way you are getting the \"Lauren\" experience as Dylan is Ralph Lauren's daughter.  They have ice cream and can make a you a frozen hot chocolate!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/7JC6coDhaUWU6d4cnHbK3w/348s.jpg", "caption": "Bread basket"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/GSA3cP97f9VewrrhS903SQ/168s.jpg", "caption": "Libations"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/xNAEYlNiUjN7YrPOojUUiQ/168s.jpg", "caption": "Baked brie- MUST GET!!"}]}}, {"review": {"des": "This place is BUSY! <br>Luckily we had a lunch reservations and were able to get right in. I had some sort of club sandwich and a side of brussels sprouts and they were both very tasty. I definitely recommend making a reservation instead of simply walking in.", "pics": null}}, {"review": {"des": "Had a very poor experience when I came to eat dinner at the bar.  I ordered Calf's Liver and the order didn't come.  I waited for about 45 min before a server noticed my main course hadn't arrived.  I left without eating the main course, hungry and disappointed.  At least the Caesar's salad and the glass of Cabernet were good.  Given the excellent gourmet choices in Chicago, I shan't ever have any second thoughts about writings off this restaurant from my list.", "pics": null}}, {"review": {"des": "Upon arriving for my lunch reservation, I overheard a manger speak with a hostess, \"we are so understaffed in the dining room and kitchen we'll be lucky to get through this day.\"<br>I told this to my relatives when they arrived a few minutes later.  Their reply was that they weren't in a rush, patience will make the day.<br>It didn't.  We expected the managers to be assisting in the kitchen or dining room.  We observed no effort.<br>The first distressful note we noticed was water and bread coming almost ten minutes after we are seated.  Had to ask for butter not once or twice, but three times.<br>Special burger ordered medium rare came out solid well-done.  Fries were warm, not hot and tasted not freshly made.  Like they had been sitting.<br>Halibut was good; however, the sauce didn't make it special.  Especially at the cost/portion ratio $'s from the menu.<br>Coffee tasted burnt as in it sitting in the pot too long.<br>One of the out-of-town visiting relatives said the waiter wasn't happy because we didn't order alcohol.<br>I was told that the Gibson partners managed RL.  If this is true, these guys should pay closer attention to the people who represent that name.", "pics": null}}, {"review": {"des": "This place is old school \"fancy\" and exactly what you'd expect from Ralph Lauren. Gold rails, navy walls, deep wood panelled ceilings, and a bizarre mash up of art. But we had excellent service, a great bottle of wine, and a seriously amazing rib eye with butter as the \"sauce.\" Others at the table loved the burger. Brussel sprouts and fries were OK. I'd get a different side next time.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/KnRxLS7PeU5saHbg24YXkg/168s.jpg", "caption": "Peanut butter pie (dessert special) was delicious"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/df5e4eiOpNDJw2eg9tUkRg/168s.jpg", "caption": "My husband and I split the rib eye. They plated it separately for us and it was still cooked perfectly. And butter as the side sauce...."}]}}, {"review": {"des": "This place is everything you'd expect it to be. Came here for brunch and had the French toast the presentation was everything!!! The decor was amazing,ambiance,service was top notch", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/HKnAiDirQbBs55YuBRpwGw/168s.jpg", "caption": "French toast"}]}}, {"review": {"des": "Food is good, nothing to pay higher prices for. If you have children, beware...the host has given us attitude at least 4 Times when we went there with our baby, and made it clear it was an inconvenience to leave her sleeping in her small fold up stroller that can sneak under a table. Also made a reservation for 3 people one time, including my husband myself and our daughter, and a \"high chair\" is not considered a seat and it was a big deal. I thought I was being polite by including her as a seat at the table but apparently that gets you an eye roll and delayed seating time.", "pics": null}}, {"review": {"des": "I asked about this restaurant from my hotel, when i check the yelp the rating was perfect! Unfortunately, I did not have a great experience at this restaurant from the beginning till the end! <br>We made a reservation for 3:00 pm for 9 people when we got there we were waiting till 3:25 pm then they show us a small round table for 9 people! Then we askd the lady which was soo grumpy if we can change our place this is too small for our family , she was keep arguing with us that no we will fit 9 people here and she was kind of rude and unprofessional!!Also, most of the chairs was empty!!! <br>Since the beginning we were not welcome by non of the people who works there, not even an smile! <br>About the food! We were there for lunch so i cant not say it was a perfect lunch! The only good point about this restaurant was the decoration! <br>At the end, it was my surprised birthday that day and when we make a reservation we put a note that this is for a birthday, they totally forgot so we needed to remind them again, and they even didn't sing me a birthday song! They just put the cake infront of me. <br>Thanks to them, ai did not  enjoy my birthday and the whole time i felt soo annoyed by their service!", "pics": null}}, {"review": {"des": "I Always love my meal here. I more often come for lunch but decided to dine here for an early dinner before heading off to Lookingglass Theatre. Mom and I ordered the steak salad and we both loved it.<br><br>The flavor was reminiscent of steak tartar... The vinegarette dressing had a bright acidity with layers of flavor like capers and dijon. Steak was cooked perfectly. Portion was just right.<br><br>French martini was perfect - foamy and not too fruity. Service was top notch. Decor was impeccable. <br><br>Looking forward to my next visit.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/GuTqKuwZug0B3vJj1v5oEg/348s.jpg", "caption": "French martini was perfect"}]}}, {"review": {"des": "We love to eat at RL always awesome food and all the employees are great Camille the hostess goes above and beyond she elevates the experience at RL making it a favorite for many to eat here Every employee is great and they should know that the best is being done every day Camille is a great asset to RL", "pics": null}}, {"review": {"des": "My aunt has forever been raving about lunch at RL and I've always been somewhat of a skeptic. Well, I'm a skeptic no more. I think I was expecting the restaurant to look more contemporary, like the NY RL is, but I was definitely in for a pleasant surprise. The decor was beautiful, the food was perfect, our drinks were absolutely amazing, and the wait staff were very nice and professional. I want to come back next month when I'm home again.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/9gQb1zPUk9tKQ3KLQ40bfQ/348s.jpg", "caption": "Loved this inside the restaurant"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/bopglaIhkgWpijjoDvykoQ/168s.jpg", "caption": "My aunts turkey burger"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/9jypVaL3zV-N6ERs06ZjDQ/168s.jpg", "caption": "They tasted just like ritz crackers"}]}}, {"review": {"des": "Beautiful restaurant!! The food is a bit pricey but quite good - I tried the soft shell crab and the house salad. It can feel a little cramped inside, but this is by far the best place to eat when you need a break from shopping on the mag mile!", "pics": null}}, {"review": {"des": "Can get crowded at lunch, but is worth the wait! I find the ambiance to be amazing and the menu is all classic lunch staples done to perfectly. Seating is a bit tight but everything else about this place makes it so worth it!", "pics": null}}, {"review": {"des": "I cannot tell you the love I have for this place. There is not one bad thing I could say about it. The staff is amazing, the service is top notch, the food is fabulous.. when I'm in Chicago, my wife and I will stop in every day for lunch. From steaks to oysters to burgers or lobster rolls, they can accommodate  all your cravings. The decor is awesome, blue walls with art work hanging everywhere. They understand all the details of dinning and what the customer wants. I love the little elevator you take downstairs to the restrooms, which are very well kept I might add. Keep up the great work you guys, it is so appreciated! I am your number one fan, even more so than Oprah!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Xo4-PX6dowcaf_VlJo9EXg/348s.jpg", "caption": "The corned beef was to die for, so perfect I wish I had it now!!!!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/djsHBvFyCsGsvga-R7Bgew/168s.jpg", "caption": "Look at this club sandwich, it's the Epitome of club sandwiches"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/PbxraTsDaR2stK_xJxRlIA/168s.jpg", "caption": "Beef carpaccio is to die for"}]}}, {"review": {"des": "Good food and service, but I can't justify the price. I had the crab avocado salad and the burger.", "pics": null}}, {"review": {"des": "Thank you for helping us celebrate our anniversary. We had only one night in Chicago and we chose RL with confidence. This was not my first time dining at RL. For me it is a must when I am in town. The food is always perfect. The service is warm and comforting. The management is present and personable. The dining room and bar are so beautiful and the ambiance is dreamy. <br><br>A special thank you to Anna and Jeff for your warm and kind service.", "pics": null}}, {"review": {"des": "Amazing.  One of my very favorite Chicago treasures.  We dined outside and had a fabulous meal.  The extraordinary attention to detail makes the experience memorable.  The lobster roll is my favorite and the mac and cheese is the ultimate comfort food.<br><br>The consistency and RL branding throughout is impressive.  From the RL monogram perfectly placed at the top of your plate for every course, to the wait staff that is attentive and professional.  The dining room and bar areas are tight seating but fabulous people watching!", "pics": null}}, {"review": {"des": "Nice classy atmosphere, very good food, and delicious desserts! I had the crab cake benedict and was pleasantly surprised at the medium-large portion. My grandmother had the grilled cheese and soup which was so delicious and buttery! Everything that I saw come out of the kitchen looked delicious! Highly recommend if visiting town!", "pics": null}}, {"review": {"des": "I do love this place.. the decor,  it's RL so what's not to love? Love the patio in the summer.  It's a tiny intimate space both inside and out. Food  &  Drinks have always been on the better side. Service is always attentive.", "pics": null}}, {"review": {"des": "Nothing special to rave about.  It seems like the socialites come here to mingle in their fur coats.  Felt a bit out of place.  Food was meh, I can find better options.", "pics": null}}, {"review": {"des": "The menu is very good. This place is so welcoming especially during the cold season. There is an outside seating for sunnier days. Always a favorite!", "pics": null}}, {"review": {"des": "I seem to be in the minority judging by the other reviews, but I had a really poor/average experience. I suppose had it been a cheap dinner I would have given 3 stars, but when you're paying this much I really expected more. We were a group of 8 people, and perhaps this was part of the problem - maybe they can only cope with 2 or 4 people at a time. First of all they set us up on 3 tables pushed together with the end table being round and the other two being square. So the two people at the end of the table were so far removed from the rest of the group that they essentially had a separate table for two. It was loud so we couldn't really shout over to them either. As for the food, I ordered the salmon which was dry and over-cooked, and frankly for $39 it was a bit of an insult. My wife ordered one of the burgers, which was tough and chewy - we both probably made ordering mistakes because people who ordered steaks enjoyed their meals. But someone else complained about the soup being too salty, and considering all the great restaurants in Chicago we really felt we had made a huge mistake coming here. I don't think I'll be making that mistake again.", "pics": null}}, {"review": {"des": "I have been here many times. <br>The service is outstanding and the employees are so kind.<br>We had a table of 10 for lunch on Sunday, the gentlemen in the bar were welcoming and made the best cocktails for us. Rodrigo and James.  In the Dining room a table of 10 i the middle of the restaurant was perfect! Taylor and Juan were our servers and they were so attentive. Thank you for a special day. Everyone was so impressed with the service.", "pics": null}}, {"review": {"des": "RL has been in my life for a long time. Restaurant is at least as great as their clothing :) <br>I love the atmosphere and everything on the menu.", "pics": null}}, {"review": {"des": "Impeccable service, this is a staff that enjoys what they are doing and will go the extra mile to give you a fantastic dining experience. Anthony the manager is the consummate gentleman and a wonderful host. The food is both aesthetically pleasing and delicious. The bar area makes you feel like you are in a private country club. The people watching is to die for, everything from suits and ties to shorts and flip flops. I love this place, every meal is better than the one before.<br>I think it is probably my favorite spot in the city to have lunch!", "pics": null}}, {"review": {"des": "A group of us went to RL on a recommendation from a friend.  I loved the entire experience!  Aramis, our server was fantastic!  He was very helpful, accommodating, and especially patient with all of the picture taking!<br><br>RL is a beautiful restaurant with an American steakhouse vibe.  The artwork is fantastic, and I loved the coffered ceiling.  Order the escargot, it's amazing!", "pics": null}}, {"review": {"des": "Service is amazing and food was really good.  Would definitely come back.  Restaurant decor is true to typical Ralph Lauren style.", "pics": null}}, {"review": {"des": "This restaurant is really nice and classy. This is a great place for a special occasion or date night. I had a birthday gathering for a party of 15 they were able to accommodate me. They have a waiting areas in the front room where you can get drinks while you wait for your table. We were seated pretty close to the reservation time. The server was attentive and kind. The food was delicious. I had the calamari as an appetizer. They gave the table several different kinds of breads. For the main course I had the crab cake. I did not order dessert and had sprinkles delivered. They accepted the outside parties treats and presented them in a nice manner. I was very pleased. The restrooms are located on the basement or first floor and they have an elevator that takes you there. I wish they had more stalls for the women's restroom, but I can say it was very clean. The entire staff made it a group effort to ensure that everyone was happy and accommodated for. They work well as a team here and it shows in the product or end result. I recommend this place.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/CduyPWRlAVuLq-ih4ySu8Q/348s.jpg", "caption": "Drinks"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/MKq3iK-cLBp9Qu8b-oeHrw/168s.jpg", "caption": "Spinach and mash potato sides"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ATA6RiyOwaAIEmkjXkOLMg/168s.jpg", "caption": "Steak"}]}}, {"review": {"des": "Enjoyed dinner again last night. The Lobster Roll was fabulous.<br>As always, service was perfect. This place is consistently good.", "pics": null}}, {"review": {"des": "I love this place. The service, food and drinks are outstanding. The Dover Sole is one of the best I've ever had.", "pics": null}}, {"review": {"des": "Still haven't been back there. Still haven't worn the scarf that was given to me. I don't foresee me going back ever again. Oh I got a call from a manager 3 months later because they hadn't seen my (Caucasian) hubby. I told him service recovery in 24-48 hours you're 3 month late... his reply \" I didn't have your phone number\" .  Mind you I've made multiple reservations under my name/phone number. So how did you get it? I got it from your husband?  After I finished deconstructing his piss poor apology he offered to have me and my friends come in for an evening at one of the other Gibson group locations.", "pics": null}}, {"review": {"des": "Loved the dining experience due to the friendly staff. The lobster bisque was absolutely delicious!", "pics": null}}, {"review": {"des": "We went for my birthday 1/27/2018. The shrimp appetizer was good, the arugula salad had over-salted dressing and there was a shell remnant in my crab cake, but the chocolate cake was super. There was a table full of Spanish speakers who were shouting very loudly and filling the restaurant with way too much noise but no one would say anything to them. My partner had great food but it wasn't a great experience for me. I would say three things, our waiter should have handled our complaints swiftly. We were there for a special occasion. It's not McDonalds. 1) Oh ha ha! Yes those people are ruining everyone's dinner isn't that funny is not an appropriate response. 2) When I say please tell the chef this needs to be tasted, not for me but for the next person - don't come immediately back out of the kitchen. Then, when I question how you could have done what I asked tell me you aren't going to question the chef. Boy, you aren't but I most certainly will question a chef who charges ME 18 dollars for a salad that is inedible. 3) What in the world are you lot doing sending crab cakes out without checking the meat for shells and bones? For god's sake no that is a highly dangerous prospect and needs to be addressed immediately.", "pics": null}}, {"review": {"des": "Location. Drinks. Food. Service. Books. Polished wood. Open doors letting in fresh air. Intimate feel. Everything done right.", "pics": null}}, {"review": {"des": "RL is what a restaurant should be - exquisite quality, professional wait staff and a beautiful atmosphere. <br>Make a reservation so you're sure to experience this must dine at spot. Bring money.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/AnptUJbJVTA8RZzU66P2ag/168s.jpg", "caption": "An amazing cocktail at RL"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/8SQyXLi7hPNLHdvmmTTvzg/168s.jpg", "caption": "The delicious, tender, mammoth shrimp cocktail."}]}}, {"review": {"des": "Wow! I consider this my favorite restaurant in Chicago...so you can only imagine my disappointment this past Saturday, June 2, 2018. After waiting almost an hour after our reservation time, 7:45...and hearing other patrons walk up to the desk and declare that they had been waiting for over an hour...we decided to move on. A great little Italian spot in our Gold Coast neighborhood.What happened, RL? Was it a kitchen problem? Over booking problem? At any rate...a big disappointment. Next time?", "pics": null}}, {"review": {"des": "Definitely some of the best service and people-watching in the city. Even during the colder months when sidewalk seating is undesirable, the people-watching is A+. Tourists in jeans and sneakers fit right in with the well-heeled patrons wearing outfits that cost more than your neighbor's car. <br><br>Our server was amazing. I'm actually mad at myself for not remembering his name because I would love to shout him out here. He was perfectly attentive, and on the off chance that he wasn't around there was always a busboy nearby to give me more napkins or to refill my drink. <br><br>The tables against the wall seem close together, but the atmosphere is quiet, sophisticated, and intimate. Everyone seems like they're having very important conversations. Maybe they were talking about me, since the day I was there I had a bandaid on my face like Nelly. Either way, the food was excellent. The lobster bisque, burger, and steak sandwich were all great. The mac and cheese could have used some salt. The mac came in a huge portion; we split it between three people and it was still a lot.<br><br>This is a popular Chicago staple that needs to be visited by tourists and Chicago natives alike. Make sure to look around at the decor; the pictures on the wall are pretty cool.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/8UeMC_tdAUDudLgV-RY3gA/348s.jpg", "caption": "Baked mac & cheese. I think they forgot the salt."}]}}, {"review": {"des": "My favorite restaurant in Chicago. Wonderful bartenders for a fun drink (or 3) at the bar, amazing food and a trendy, fashionable crowd. I love the steak salad on a warm day on the patio. The fish is beautiful for dinner as well as the steak.", "pics": null}}, {"review": {"des": "We walked into the restaurant on Friday at around 8:45pm, and It was packed. There was a 20-30 minute wait for a table of 5 with no reservation, which wasn't bad so we waited at the bar. The bar is a small area, but it was a comfortable wait. The dining area has a very nice ambiance and looks like a library. I ended up ordering the burger, and it was one of the best burgers I have ever had. They actually cooked it medium rare, and the bun was nice and crispy. People probably don't usually come to RL for the burger, but definitely try it. After dinner we ordered the bananas foster, and you can watch them cook it in the corner, which was neat. Overall it was a great Friday night dinner spot.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/AhCsSpav2a2h2qnD4B05lg/348s.jpg", "caption": "Burger with Brussels sprouts"}]}}, {"review": {"des": "We walked-in with no reservation, wonderful french-american twist, it kinda reminded me of an iconic Restaurant in NYC that i love... lobster bisque, crab and avocado salad and the RL Burger.... cant go wrong...", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/uI-4irOEiZMDmif9zoa_jQ/168s.jpg", "caption": "Lobster bisque : Outstanding!!!"}]}}, {"review": {"des": "Overall a pretty great experience. Stopped in for late lunch while in Chicago for business a couple months back. Lobster Bisque, plated table-side, was delicious.  Steak Sandwich was excellent and big (gotta love those Midwestern portions). Service and decor were both great. Only minor, minor complaint is the bathroom is located in the basement and the only way down is a slow elevator. <br><br>Will gladly dine here again, gotta try out that Dover Sole!", "pics": null}}]}