{"name": "roka-akor-chicago-chicago", "reviews": [{"review": {"des": "With so many fabulous restaurants, it is hard to choose where to dine when visiting for just a few days. A local friend recommended Roka Akor and we had a fantastic dinner there. <br><br>The menu boasts a wide variety of options ranging from grilled meats to sashimi and sushi, hot and cold plate options, or you can go for waygu kobe beef if you want to splurge.<br><br>Our group of four decided to mix and match from the menu so we each ordered two dishes, and had a glorious time trying all the great variety. The standouts for me were the octopus and the prime beef tataki. However I very much enjoyed every single dish. I look forward to a follow up visit to continue to chip away at the large menu and excellent variety of options.<br><br>Ambiance was nice and service was great. All around 5 star experience.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/US9OINgPhxcdxls45iri9g/168s.jpg", "caption": "Prime beef tataki"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Y-o9hdrFBm_89vFOOs_bgA/168s.jpg", "caption": "Octopus"}]}}, {"review": {"des": "Honestly I would have had a good experience here if the wait staff wasn't extremely homophobic and unprofessional.<br><br> They had called me \"maricón\" right in front my face thinking I wouldn't understand what that meant. Which directly translates to \"f*ggot\" in English. I hope the rest of the LGBT community in Chicago boycotts this place because I will never return and I will make sure the rest of my friends who visit Chicago will know what happened. <br><br>I don't know what kind of business you're running, but wait staff spewing homophobic slurs in different languages thinking no one would understand is extremely unprofessional and unacceptable. Regardless of the language, it should be unacceptable for the wait staff to even say anything of that manner. <br><br>This reflects poorly on the management and their values as well.", "pics": null}}, {"review": {"des": "As someone from the West Coast, I'm extremely spoiled by the quality and abundance of japanese food and fresh fish. After a few days of only eating pizza in Chicago I came to Roka Akor with hopes that my homesickness would be cured. <br><br>I came at lunch and ordered a combination of hot and cold dishes. We got their lamb chops, escolar, and the sushi lunch which came with some gyozas and a roll. The best part of the meal was the escolar since they dressed it up with a good mix of tart, sweet, and butteriness from the fish. I thought everything else from the rolls to the lamb was pretty \"meh\". The lamb was overcooked and the rolls were good but they lacked the finesse I was expecting. <br><br>The service was nice and attentive and the restaurant is beautiful but unfortunately the food did not remedy my japanese food wants. It's a nice place for a business lunch, but the food in my opinion is nothing out of the ordinary.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/1vdfE0F9aEnADyYSm7cMXQ/168s.jpg", "caption": "Lamb"}]}}, {"review": {"des": "This place was on my list for a while, so I was excited to finally go in for lunch. The decor is beautiful, the vibe is good and the service is attentive. <br><br>As for the food, the skirt steak was phenomenal (I got the bento box) - perfectly cooked, well portioned and presented. But the sushi was just ok. Of the appetizers that came with the lunch box, the real memorable one was the wagyu dumplings - the rest were fine but not memorable.  Finally, the dessert menu was lacking.<br><br>Overall pretty decent experience.", "pics": null}}, {"review": {"des": "One thing to note about Roka Akor is that it's very consistent. The menu hasn't varied much since I first visited years ago, but every time I go the food is exactly as I would expect. The lychee martinis are now off the menu, but definitely order one to kick off your meal. If you're vegetarian, be sure to mention it to the server when you're seated so they can serve a special amuse-bouche. This time, I tried the heirloom tomato salad with black garlic dressing (so good I wanted another order), veggie sushi, and split the mushroom rice hot pot (essentially a Japanese-style risotto). We capped off the meal with the sorbet dessert, which was equally refreshing and beautiful (photo attached).", "pics": null}}, {"review": {"des": "This is what fine dining should be.  We arrived around 630pm and the thing that struck me first was the beautiful lighting.  Shirking the trend of dark, inky restaurants with starch white table tops, Roka Akor was open and inviting.  The light streaming in from the north and east facing windows made the polished hardwood tabletops seem to glow.<br><br>Service:  Immaculate from beginning to end.  The staff was amazing from the our waiter on up the managers who moved throughout greeting patrons making sure everyone was having their best experience.  Our waiter's knowledge of the food and ingredients was perfect.  (I won't be replicating it as well below, sorry)<br><br>Drinks:  We both ordered the Roka Old Fashioned.  It was a perfect balance of ingredients and very smooth.  I also appreciated that they skipped the cherry and unlike many places weren't insane with the bitters.  Top shelf. <br><br>Food:  We ordered the Omakase Signature.  For the uninitiated this is one of their Chef's tasting menus for two.  Everything was divine and the cornucopia of flavors that hit your tongue is truly unforgettable.  Honestly there were so many delightful dishes that i'm going to struggle to remember them all and I certainly can't describe them, but here's my attempt to list them (pictures coming soon)<br><br>They started us with a White Ceviche on a thin crispy cracker of sorts.  I've actually been on a ceviche kick lately so I was pleasantly surprised.  This was quite frankly some of the best ceviche I've ever had and that includes time in central and South America.  I was left trying to figure out if it would be appropriate to ask for more...<br><br>Next they served the Escolar Tataki.  The thin layer of white fish seared on the outside wrapped around a piece of white asparagus.  I don't love asparagus but I loved this.  <br><br>Up next was the Grill Heirloom and Tomato Salad.  Splendid and the black vinegar dressing was perfection.  Not too tart or acidic.  <br><br>Shrimp and lobster dumplings...Does this really require explanation?  Well done. <br><br>Sashimi Platter- here's where I go a little vague on you (see the picture) and admit I'm not a huge sashimi person.  I did however try everything (except the oysters) and I found myself pleasantly surprised.  I may have to begin making a better effort to broaden my pallet in this regard.  I liked it so i suspect others would have loved it. Make sense?<br><br>Full yet?  We're not done.<br><br>Madagascan Jumbo Tiger Prawn-say that three times fast and I'll be done devouring it...wow wow wow.  Perfection...but not as good as the...<br><br>Yuzu Miso Marinated Black Cod--I don't know that I've had fish this good before.  I sat there struggling to think if there's anything I cook as well as whoever cooked this fish...I'm not sure I do anything as well as the person that prepared this dish.  I could have gone home after this...but I didn't.<br><br>So despite their clearly amazing fish, this place is also a steakhouse...So for our final course (i'm losing track and three dishes came out here) out comes <br><br>Crispy Brussel Sprouts with bonito flakes...I don't know what bonito flakes are.  What I do know is that they moved and waved around on top of the brussel sprouts for a solid 10 minutes.  I admittedly waived my no social media rule at dinner and turned it into a boomerang.  It was also delicious.<br><br>Japanese Mushroom Hot Pot-I don't love mushrooms, but once again I loved this.  I take that back I love the flavor of mushroom but not always the consistency of the shroom itself.  That was not at issue here.  What a divine little dish. <br><br>New York 10 oz Strip Steak--Prepared medium rare.  This was my first foray into medium rare.  I grew up with less than foodies as my guide and so meat was cooked well.  Over the last decade I've worked myself down to medium.  Now I get it.  <br><br>Finally despite being able to shove no more food into my body (hardly dented the three dishes prior save for the steak) we received a dessert platter.  This included the Warm Chocolate Cake (yass lord) Green Tea Sorbet, Pear Sorbet, and some form of purple custard that I can't identify but was perhaps the second best thing on the platter after the Warm Chocolate Cake. <br><br>In summary, the price tag makes it something you probably won't do every weekend, but if you have a special occasion or are like me and like to treat yourself every now and then, I recommend coming here.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/fIIPdU2TsT0HvbQfEug9EA/348s.jpg", "caption": "Dessert platter"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/cPtOqQwV2q52UH03VOB8wA/168s.jpg", "caption": "New York Strip Steak"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Yr_p6xFPTppQ_Ncfp6TS7Q/168s.jpg", "caption": "Crispy Brussel Sprouts"}]}}, {"review": {"des": "Had been here twice! The first time is with my classmates in Chicago restaurant week. The other is with my boss when we do closing for a real estate. <br>I like the style of dishes of Japanese food!<br>I like the sweets here too!", "pics": null}}, {"review": {"des": "Bang for your buck! One of my new favorite Japanese steakhouses in Chicago's River North area that truly understands the essence of food and proper portion sizes. Great for all occasions from catching up with friends to a special birthday celebration. <br><br>Service - Guy was our waiter, and he was friendly and professional. Made for a pleasant evening. <br><br>Salmon Avocado Maki - All ingredients were fresh and professionally prepared. They truly deserve their \"Top 10 Sushi Spots in the US\" by Bon Appetit. <br><br>Korean Spiced Lamb Cutlets - Four juicy, melt-in-your-mouth tender, and perfectly seared lamb cutlets with a spicy Korean dipping sauce on the side. Paired with smoked eggplant and cucumber. <br><br>Yuzu Miso Black Cod - Excellent pairing. The chef offset the natural richness/butteriness of black cod with a yuzu miso marinade, and elevated the texture of the sauce with a sprinkle of black sesame seeds. Enjoyed the pickled red onions as well to cleanse the palette.  <br><br>Bone Marrow - Roasted with a sweet garlic soy marinade. Bone marrow is often served with something on the side because it can get too rich and oily to eat on its own. This bone marrow was served solo and was perfect on its own. Beautiful execution. <br><br>Pear Sorbet - House-made seasonal flavors. Light and refreshing way to end the night. <br><br>A gem in River North.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/7uXOn_F5o-KtDsbgcOQ13g/348s.jpg", "caption": "Yuzu Miso Black Cod"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/i-AjX91daBTMqpS5mmL0SA/168s.jpg", "caption": "Korean Spiced Lamb Cutlets"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/prx2grBmCScdi6E5lokCwQ/168s.jpg", "caption": "Bone Marrow & Korean Spiced Lamb Cutlets"}]}}, {"review": {"des": "We spent our first anniversary at Roka Akor, and it could not have been a better experience. We had the Omakase Decadent chef's tasting menu, and absolutely everything was on point. Amazingly consistent, delectable food is the minimum with fine dining, but service makes the meal. David C did just that for us. He described each course with knowledgeable passion and gave us the history behind the flavor and technique. He also did an excellent job pairing drinks with each course and was superbly attentive. Everything was perfect -- from the champagne toast to welcome us for our special evening to the happy anniversary wishes written in chocolate on our dessert plate. Thanks, Roka and David!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/W0rZFKDCCEZ6H4rsCtlVbQ/348s.jpg", "caption": "Scallops.. EFFING YUM"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Axm_b1dg4vDg7a4oWst_7Q/168s.jpg", "caption": "Everything on this plate was so delish!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/aGUCJ3vPw4YHJ1A3telorA/168s.jpg", "caption": "Fish so fresh that it melts in your mouth. It was worth  every $$ spent"}]}}, {"review": {"des": "#Omakase and #friendreunion. We had high expectations since the reviews on Yelp was really good. It was a little disappointing though.<br><br>The menu includes a wide variety of options from sashimi/sushi to grilled salmon. Unlike many other omakase, Roka Akor actually offers enough amount of food. The sad part is almost none of the dishes tastes special. The only one I can think of is the grilled salmon. It was fresh and tender.<br><br>Service wasn't great. There were 4 different waiters took turn serving us dishes. They took away plates that we were still working on. Weirdly, we are not allowed to order Happy Hour plates unless we sit at the bar......", "pics": null}}, {"review": {"des": "Super laid-back, fun environment. They have a good space and source quality ingredients, including fresh fish each day from Japan. I was impressed by some standout pieces such as sweet clam, three different types of tuna (ankimo, chutoro, and o-toro). Their gunkan style bites are also tasty, although they have a penchant to slop in the spicy sauces, which believes their non-Japanese origins.<br><br>I had a mini-omakase at the bar, which meant I gave some general direction but let them surprise me. I had some excellent cuts of sashimi as well as nigiri. Their nigiri rice is tasty, and has some vinegary-bite. It is a medium consistency and is not too sweet.<br><br>The service was very pleasant. They have a coordinator type person that directs a lot of the plating and traffic, and two main sushi chefs. One chef prepares a lot of the fish (I saw him breaking down large ones earlier in the day), and the other is more responsible for plating, artistry, and forming the nigiri.<br><br>They have a good wine list but a better sake list, as you might expect. There is a very good Roka in Scottsdale, and I learned to ask for some off-the-menu items, which they always have, and are a real treat.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ryWa2WCAQOTq4Z8-GLr4hg/168s.jpg", "caption": "Sashimi deluxe has an aquarium feel!"}]}}, {"review": {"des": "Great place! Sat at the bar area just the 2 of us for appetizers and drinks. Super chill place, great service, and very open inside. Had a nice seat by the window, so can look outside while enjoying our food.<br><br>The food is great and fresh...everything we ordered we loved! The menu has a little bit of everything, wish we could've tried so much more! The wagyu beef and kimchi dumplings are amazing! Also loved the robata grilled pork belly. I absolutely LOVED the broccolini! SO good! We did get a couple of rolls also, which were both good and fresh! <br><br>Love to come back here and try more!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/TFXKln8cS806CkSsm08NjA/348s.jpg", "caption": "Robata Grilled Pork Belly"}]}}, {"review": {"des": "TL;DR- Come here for the happy hour. <br><br>Seriously. Great deals for happy hour.<br><br>And if you can afford the dinner, stay for the dinner too haha.", "pics": null}}, {"review": {"des": "My boyfriend and I came here on a whim for dinner because we were in the area and ended up ordering the decadent omakase. <br><br>We figured that we typically can be heavy-handed when ordering anyways, and why not treat ourselves simply because we can? <br><br>It was absolutely worth it. And for the quality and amount of food we got, the price felt completely justified. We spent about 2.5-3 hours there. We took our time to indulge in the food and it was brought out according to our pace. Despite how much food we had and even leaving with some leftovers, the food left us feeling very light in comparison to eating a greasy, hefty meal.<br><br>Omakase is equivalent to a chef's choice meal. We had 3-4 plates each of appetizers, hot and cold entrees and dessert- essentially it was an opportunity to try all the flavor profiles of the restaurant which may or may not be on the traditional menu.<br><br>I can't recall all the dishes but some of the highlights included the nigiri and sashimi- the fatty salmon was incredibly buttery smooth. There was a tuna tartar that was so delicious. There was a dish that was like a Japanese risotto that was incredibly aromatic with truffle.  The dessert had a really light yet flavorful peach sorbet.<br><br>I would highly recommend this place. Do the omakase if you can. The sushi grade is extraordinary and the food tastes so luxurious. Perfect for any occasion. I saw families there, couples, and even business professionals. The prices are higher than your every-day go-to-sushi but reasonable. Go whether or not you have a reason to celebrate, your palate will thank you.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/BZlI6Nsm_m2muBQlri-r8g/348s.jpg", "caption": "Decadent Omakase: beef with truffle shavings"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/y-OMECrIDsbIeYc20UO-kw/168s.jpg", "caption": "Decadent Omakase: Tuna tartare"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/7xcam5Kl6Ok_eAMHPyvJEw/168s.jpg", "caption": "Decadent Omakase: Salmon"}]}}, {"review": {"des": "Hands down to the best dessert I've ever had. Definiely try the Matcha Custard! I never thought that matcha would pair so perfectly with banana. <br><br>We tried the Chef's selection sashimi and it was indeed very fresh and delicious. Definitely worth the price I'd say.<br><br>Service was very good. They were all so nice and so helpful in giving info about the menus.<br><br>10/10 would come again for the sashimi & matcha custard!!!", "pics": null}}, {"review": {"des": "So I came before for lunch set and loved it. Came back for full dinner and it was mediocre experience. I had the deluxe sashimi for 5 people which MP came out to be $250. Waaaay overpriced for what we got. Not only was it not filling, it did not feel like high quality sushi. Granted I lived in Japan for a bit so might be biased. We also got a couple of rolls that were tasty but nothing mind blowing. We also had the dumplings which were delicious but also a bit pricey for dumplings. Overall would not recommend for price. If you want to try it do the lunch set!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ItCDIZe_PaacyY3jt9e0pA/348s.jpg", "caption": "Deluxe sashimi set"}]}}, {"review": {"des": "Wow wow wow. Fantastic. SIT INFRONT OF THE KITCHEN IF YOU CAN! That was my favorite part!<br><br>This was a splurge night, so let my divulge into all of the things we ordered. (There is a huge menu!)<br><br>We had the shishieto peppers, the encora (a white fish appetizer the server recommended, AMAZING), the crunchy tuna and the salmon roll and to top it off we got the Alaskan crab. <br><br>I recommend the white fish appetizer, the salmon roll and the crab (a tad overpriced but seasoned and sauced perfectly.) <br><br>The atmosphere, the food, the staff- great job guys.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/1bIki4yXxM553DiQon3gog/168s.jpg", "caption": "Sit near the kitchen! So fun!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/aq0EpzStemun4XCBu_P_iQ/168s.jpg", "caption": "Alaskan King Crab ($48!!) very delicious but not sure its worth the price."}]}}, {"review": {"des": "I've been to Roka Akor many many times over the past 5 years for business and personal. It feels like I've tried almost everything on their menu.<br><br>Likes<br>- Great quality of food including lunch bento boxes<br>- Happy hour specials<br>- They can cater company events in a tiny private room as well as non-secluded parties near the bar to the left of the hostess area<br><br>Dislikes<br>- Can be pricey/overpriced", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/E_sQUYpxmDTB6Qe-dL4VEA/348s.jpg", "caption": "$24 Sushi Set Bento box"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/oHUFQkbrPl3Wxs_PSFgCtg/168s.jpg", "caption": "$24 sushi set bento lunch (with Flame Seared Salmon Nigiri, Hamachi Sashimi, Spicy Tuna Roll) now shown: Miso Soup, Crispy Butterfish Maki"}]}}, {"review": {"des": "Come here on a Sunday night during 2018 restaurant week. It happens to be the Super Bow night. Everyone in the restaurant is watching the game while eating. Even the waiters would stop from time to time to have a quick glance lol. <br><br>For the starters, we are served with Yellowtail Tataki and Unagi Maguro Maki. The Yellowtail is fresh and has tons of flavors. The Ponzu sauce is sweet and tangy, and goes perfectly well with the fish. The maki is a little disappointing though. The flavor of unagi is entirely overwhelmed by maguro on top. I wish there were more unagi or less maguro to keep the balance. <br><br>We have Wagyu Sirloin and black cod for entree. The steak is just simply seasoned and is perfectly cooked to medium rare. It literally melts in my mouth. A fantastic way to present the Wagyu beef! The mushroom has a slightly lemony taste. It balances out the richness as well. I would recommend skipping the mayonnaise on the side though. The steak is already rich enough, adding the mayo may feel a bit greasy. <br><br>The cod is as amazing as the steak. The fish is really delicate and cooked to perfection. You can taste a lot of flavors in the fish. It's sweet and tangy from yuzu, and savory from miso. Once again, the sauce is a bit unnecessary to my taste. The fish itself is flavorful enough. <br><br>The dessert items are a bit let down. We have the Ube Pot De Crème and chocolate cake. The presentation of the two dishes are amazing -- beautiful as pictures. The chocolate cake is a great combination. Warm chocolate lava cake together with a tiny scoop of coffee ice cream. When having the first bite, I was blown away. I thought I finally found a chocolate cake that was not overly sweet. But the more bites I have, the sweeter it gets. And it finally gets intolerably sweet about half way into the cake. As for the Ube Pot De Crème, it's super sweet the first bite, and entirely throws off the balance. Wish the restaurant can tune down a sweetness a bit.<br><br>Overall, 4 stars for the entrees. I may come again in the future, but will skip the appetizers and go straight to the entrees.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/zt6NjgVKJVpude4nKDz_tg/348s.jpg", "caption": "Unagi Maguro Maki with Yamagobo and Chives"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/n-rwRJK0NroUmxJFGV2Zjw/168s.jpg", "caption": "Ube Pot De Crème with Bubu Tuile and Fresh Berries"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/7ZJeU7FAaeEvZdZldCde9Q/168s.jpg", "caption": "Snake River Farms Wagyu Sirloin with Soy Butter Mushrooms"}]}}, {"review": {"des": "Their sashimi is so fresh and their sushi rolls are tasty too! The atmosphere is lounge like, so it's perfect to get a meal before partying next door. Their wasn't a dish we didn't like, though everything is a little pricey. It's good for once in a while though. <br><br>And you never know who you'll meet. You may find yourself a guy with owns a boat.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Htw5wo2PGYOZZowegsL2MQ/348s.jpg", "caption": "Lobster Tempura"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/-LXAHpY6clys0CvQDuBrxg/168s.jpg", "caption": "Ube Pudding"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/v8IWLxBP57cdA_SwbKpurA/168s.jpg", "caption": "Bone Marrow"}]}}, {"review": {"des": "Been here a few times with my husband. We've had a variety of food off the menu and nothing has ever disapopinted. It's pretty pricey but it's comparable to other places in the area. My favorites are the beef and kimchi dumplings and the hamcahi serrano roll. The dumplings are soft and juicy. As soon as you bite into them the juicy and some oil comes out but the meat is tender and the dumpling itself it cooked to the perfect texture. The hamachi serrano roll is very simple but full of flavor. The fish is always fresh and the serrano gives it a nice kick.", "pics": null}}, {"review": {"des": "This place does a lot well, and there's a few things that need some work - 4 Stars is very honestly generous they're much more of a 3.5 at best.<br><br>Squid tempura is just rings....WHERE'S THE LEGS!? Those are the best part and whenever they're missing it screams frozen bags of battered unfreshness. I wouldn't order these again they were flavorless and served with a mayo sauce.<br><br>Sushi was very good - overpriced but tasty and we were ultimately happy with our choices. <br><br>Brussel Sprouts needed seasoning and we ended up asking for ponzu sauce. Mushrooms were good roasted with garlic. <br><br>I was so excited to try the bone marrow....until it came to the table with nothing to spread it on - WTH?? We sent that back..<br><br>Overall decent meal.", "pics": null}}, {"review": {"des": "We came for my husband's birthday and were ready to splurge. We ordered the Omakase (~$130/person) with the Waygu beef add-on (~$40/person). The Omakase is definitely portioned out to be a full meal (served in a variety of pre-selected small plates) and left both of us stuffed with leftovers to take home.<br><br>Favorites:<br> - Yuzu Miso Marinated Black Cod was the MOST delicious dish. So buttery and savory and flaky!!!<br> - Waygu is so tender and decadent. It's served in a smaller potion but it's a meat to be savored! <br> - Amberjack nigiri and the sashimi platter. Great variety and very fresh fish! <br> - Japanese whisky selection is quite expansive. The Yamazaki 18 year (~$50 per pour) is so smooth that even I liked it! <br><br>Next favorites/runner-ups:<br> - Scallops with gooseberries and butter sauce. This dish had great variety of textures and some different flavors with the gooseberries<br> - Brussels Sprouts. I always love Brussels sprouts and this was no exception<br> - Ribeye with Wafu sauce... while ribeye is definitely not my favorite cut of meat, the Wafu dressing is drinkable!!! <br> - Delicious birthday dessert with tons of variety and a nice/attentive move! <br><br>Downsides:<br> - The Omakase meal seemed low on sushi/sashimi/nigiri/steak dishes with too many veggies... Definitely could have done without the Roasted Best Salad, Asparagus and the LARGE rice dish that we both did not enjoy. <br> - Getting charged for edamame at the start<br> - There were things I LOVED and then there were things that were ok, but I expect to LOVE everything when dropping over $200 per person<br><br>I would come again and pick the dishes that we loved rather than going the Omakase route again. For Omakase in Chicago, I'll continue to head over to Kai Zan!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/VkgsVWXIB1l9mWpp6__C8A/348s.jpg", "caption": "Yuzu Miso Marinated Black Cod with Pickled Red Onions.. Best dishes of the night!!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Aoc7LtTU2ZyYvdUtqTQiGw/168s.jpg", "caption": "Asparagus"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/qlxjH7dAqzeCxHwIHkqECQ/168s.jpg", "caption": "Yamazaki 18 year Japanese whisky"}]}}, {"review": {"des": "Fine sushi dining at its best!  The food, the ambiance and service are great. You can easily drop $100 for food per person here but it would all be worth it.  The food is so good I eat until I almost burst when I come here. <br><br>The dishes here are not merely food, but beautiful art creations.  They are not just a sushi restaurant as they also offer prime steaks, seafood and vegetable dishes.  <br><br>It's an open kitchen design where you can see the chefs.  Everything I tried was amazing and either melted in my mouth like delicious liquid velvet or exploded with flavors leaving no taste buds untouched.<br><br>Some of the things I tried:<br>Beef Tataki with shaved black truffle and truffle jus $22 - This is my favorite dish here<br>Wagyu gyoza $11<br>Vegetable tempura $9<br>Butterfish Tataki with White Asparagus and Yuzu $13<br>Salmon Nigiri $9<br>Hamachi Nigiri $9<br>Chu Toro $16<br>Soft Shell Maki $14<br>Brussel Sprout $7<br>Chocolate cake $12<br>Green tea custard $10<br>Old Fashioned drink $13<br><br>There are paid street parking, which may be difficult to find.<br><br>....| \\      _  , , , - - , ,  _  ,      <br>.../  , ` . - ' ` '             . _   \\ -  ;  ;  ;  , _    <br>..| ,  a  -   )   ) _         . ; .  (   ` - ` -  ' - '   <br>'  - - - ' ' ( _ / . _ ) - ' ( _ \\ _ )", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/EyMXE9-5jSM8qwaqGKoCIg/168s.jpg", "caption": "Green tea custard"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ctlcOa4RKU8I_lNs3wr12Q/168s.jpg", "caption": "Chocolate cake"}]}}, {"review": {"des": "Best and favorite restaurant in Chicago. Sushi is innovative but at the same time traditional. Have options of wagyu beef, at A5. Phenomenal. The dining area is dark and great for a date. Many options and good pricing.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Yj0THprbwApEhXGYLIJRcA/348s.jpg", "caption": "Grilled Diver Sea Scallops**"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/BsbYakuM5rxQebTEyRewtg/168s.jpg", "caption": "Korean Spiced Lamb Cutlets* **"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/0qV3qBU43ejQi549EEF8nQ/168s.jpg", "caption": "Crispy Prawn and Chirashi"}]}}, {"review": {"des": "Well, I'm incredibly disappointed. How disheartening it is to make a reservation for a birthday at a carefully selected restaurant on a business trip to Chicago only to be flat-out denied by the chef the $98 signature omakase with $35 drink pairing (asked our waitress if there was a pairing, though not on the menu. There was, but in the end, couldn't have it anyway...) Moving on from that, the 5 cold & hot plates I ended up ordering were underwhelming and left a lot to be desired. <br><br>I must say the service was truly accommodating after the admittedly significant let down. Bill certainly went out of his way to make up for the chef's decision (after all it is his decision whether I am worth it, after respectfully entrusting in him to choose what to feed me. I guess I must respectfully accept his decision not to...). <br><br>Let me clarify - since my non-foodie friend was not also indulging in the signature omakase, I couldn't have it. Something about \"timing\" and \"integrity\" since my friend's food, if she ordered steak (she was going to order sushi), may have gotten cold while waiting for me. The omakase was 2-2.5 hours they said. And didn't want my friend waiting or the food to be improperly timed. Strange. I've had omakase at a Michelin star restaurant with this same friend ordering just a couple rolls for herself with no issue. I've seen omakase restrictions at other restaurants, but they are openly and clearly stated on the website and I avoid them when with company who is not comfortable partaking in it. I would've done the same with Roka Akor if I had known. <br><br>After first asking the waitress if they could make an exception, who asked the manager, who then asked the chef, who looked over at our table then back to the manager, shaking his head, I must admit I had a bitter taste in my mouth. I'm still unsure why he had to look at our table to determine whether he'd serve the omakase.<br><br>Anyway, instead of leaving, I ended up ordering a bunch of plates and my friend sat there after finishing her maki rolls (first to come out) ... She ate slowly for me because she's that great of a friend. She only came for my birthday because she knows how much I like exploring food and she picked at only a few of my dishes that she felt comfortable trying.<br><br>However, the complimentary champagne, chef's complementary amouse bouche, and complementary $10 tataki tasting (one for each of us) was incredibly appreciated. We would have left had they not brought over birthday champagne and apps so quickly, or if they had not been so accommodating and apologetic- so kudos to Bill. Thank you. <br><br>I hope they will indicate it somewhere on the menu, website, or opentable confirmation that they require a minimum of 2 for the omakase (they said they would...). Other diners beware- do not bring your non foodie friend here and expect to get omakase for yourself. Can't fault the manager or our helpful server, Iryna. <br><br>I ordered some Sauvignon Blanc, Sakura Leaf Cured Ora King Salmon, Escolar Tataki (it seems they used to call it Butterfish Tataki), Forest Mushroom Karaage, Wagyu Tartare, and Robata Grilled Pork Belly. My friend ordered the Dynamite Scallop roll and salmon avocado roll. <br><br>The food came out quickly at first, then slowly as the restaurant began filling up, then several dishes came with seconds in between. At one point a beet salad was dropped off at our table which neither of us had ordered and was later removed after first being asked if we had touched it... er...<br><br>I felt underwhelmed and disappointed by the food. The Wagyu tartare was chewy (pomegranate gel was delicious though). Forest mushroom tempura was a bit bland... the waitress sold me when she said not to be turned off by tempura because theirs was very light. I found it lacked flavor, left a greasy aftertaste, and didn't allow me to enjoy the mushrooms themselves. <br><br>The Sakura Leaf Cured Ora King Salmon with Grapefruit Ponzu and Red Sorrel was served with gold flakes in the ponzu... so bizarre to me and not necessary at all. Showy things like this make me wonder perhaps I was better off without the omakase. <br><br>The Robata Grilled Pork Belly was good but nothing incredible. I regret not getting the Robata Grilled Shishito Peppers.<br><br>Overall, I tried not to let being refused omakase skew my opinion. I left underwhelmed, wondering if I had just not ordered the right dishes at this place, and enjoying little more than the compassionate service and my friend's company.", "pics": null}}, {"review": {"des": "T H E    S T O R Y<br>I came here with a large group for a corporate dinner. <br><br>T H E    G O O D<br>- Great place for a large party and shared plates. <br>- Wagyu Gunkan- Wagyu and Caviar<br>- Crispy Brussel Sprouts<br>- Toro Tartare<br>- Tuna Tataki<br>- Possibly a great place for celebrity sightings. I saw Rain Wilson (Dwight from The Office) dining there. :)<br><br>T H E    B A D<br>- Expensive $$$<br><br>T H E    S T A R S<br>This place gets 5 stars from me because:<br>- Food was great<br>- Staff was friendly <br>- I would return to eat in restaurant.", "pics": null}}, {"review": {"des": "We had a goal to avoid chain restaurants during our trip however Roka Akor is too good to pass up. If you want a special dinner with a Japanese twist them look no further.<br><br>It's River North location made it ideal walking distance from our hotel. The atmosphere is upscale modern and the service is prompt, friendly, and quite informative of the menu. If you want a unique dining 5 course dining experience then I would suggest the Chef's choice option and prepare for the adventure. It costs anywhere from $98-$120 per person.<br><br>I chose a Wagyu beef with bone marrow and a side of asparagus in wafu sauce. There food was so artistically prepared that I hesitated to dig in. They were outstanding! My wife had 2 Maki rolls which were the house specialty: the Dynamite Scallop and the Seared Serrano rolls. They were perfectly balanced and absolutely delicious.<br><br>For dessert I had the Green Tea Custard. It has caramelized bananas and a whiskey sauce that was so good I almost cried when it was done. The custard was light and airy but I couldn't help but notice it's resemblance to baby poop. Damn kids, ruining everything! My wife had the Tea Cheesecake which was also a home run. The cake was light and the sauce was bright and fruity. <br><br>Overall I can't say enough positive things about the food. Our whole meal ended up costing $120 and I would do it again if I had the chance!", "pics": null}}, {"review": {"des": "This restaurant is good... but did not live up to the hype.  The exorbitant prices for small portions were disappointing... the quality of the fish and lamb were good, but the flavors were lacking.  My friend got the prime new york strip loin ($48) which was described as \"basic\".  Got a tea cheesecake for dessert, which was on the dry side and did not really mesh well with the fruity sorbet on top.  The wagyu beef and kimchi dumplings were pretty good and def the best part of the meal.  Had a reservation for 4 for a few weeks, but seating was really not ideal - restaurant not full at all and all people in the restaurant squeezed shoulder to shoulder in one section of the restaurant (near the window to be seen by people walking by) - I could hear every word of every conversation at nearby tables.  A very unremarkable experience.", "pics": null}}, {"review": {"des": "Came for happy hour with a group of friends Friday at 5pm and was seated immediately in the beautiful and modern lounge. A server came by to take our drink orders right away. I got the specialty cocktail ($5) which was a grapefruit/tequila drink for that day. They definitely don't skimp on the alcohol :) <br><br>For food, we got a bunch of plates to share. I really enjoyed the fried calamari ($5) - deliciously crispy and flavorful. It was so good we got 2 orders! The signature tataki trio ($6) was definitely my favorite. The fish was super fresh and perfectly paired. Nothing else on the menu really stood out. If I come back, it'll just be for those two dishes + drinks.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/xZP8D5-UBB1s2AnwSkTOYw/348s.jpg", "caption": "Trio"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/SiaKwVLkadqmEe0La7-lPg/168s.jpg", "caption": "Happy hour menu"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/KyTlchVNzVCm7NyuyNVz9Q/168s.jpg", "caption": "The lounge"}]}}, {"review": {"des": "By far I have been to Roka three times and their happy hour was definitely a huge bang for your buck!<br><br>$1 oysters and $5 apps and sushi rolls! We were stuffed and extremely happy for just about $40 per person eating such premium ingredients! We ordered so many that they ran out way quickly than usual. The managers seemed super friendly and nice and very attentive. Our server was extremely friendly as well (same girl that served us last time)<br><br>The oysters were fresh and the sauce they paired it with was absolutely delicious! Also loved their gyoza and crispy squid! Would totally come back again and again and again!", "pics": null}}, {"review": {"des": "Still a fantastic dining experience.  We went there last night with a party of 5 and we had an exceptional dinner.  This place is on par with sushi restaurants in San Francisco, LA, and New York.  I promise you will not be disappointed.  We fully enjoyed the cold saki menu, the toro and the premium wagu beef.  The mushroom truffle hot pot is not to be missed.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/_AaZ8o40IIwc3Owa2U1ggQ/348s.jpg", "caption": "Amazing Wagyu Beef"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/rypO9-wOFB_aTCoplhz0hQ/168s.jpg", "caption": "Roasted corn- sounds simple but it was delicious"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/qANvVCFJbf_RDNT2YW9k3w/168s.jpg", "caption": "Truffled mushroom hot pot"}]}}, {"review": {"des": "Roka Akor should get 4 stars.  The food is excellent.  The service -- is laughable.<br>As my husband was participating in a medical conference I had called to make a reservation in advance giving them plenty of notice to seat us in the Restaurant rather than the Bar. But a window table in the Bar is where we were seated and even though the Bar was quieter than the restaurant apparently, the wait staff is tasked with turning the tables over as quickly as possible.  The food is served by 2 members of the staff and cleared by 4!  It was actually comical to protect our plates from being  grabbed by the aggressive team hell-bent to move us along and out.  They got us out .....we're not going back.<br>.", "pics": null}}, {"review": {"des": "This review is solely for the Korean Spiced Lamb Cutlets because God they were delicious and outshine anything else. I visited Roka Akor about a month ago. It was the best lamb I've ever tasted and is absolutely unforgettable. <br><br>The restaurant was nice, though slightly overpriced, as are most in that area. Service was good. I went on a weekday with reservations and was seated immediately. I would also recommend the Wagyu Beef and Kimchi Dumplings 4/5. Sweet corn was good too.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/l7iWI8PbObN424hQqbeFfQ/348s.jpg", "caption": "Hello lamb cutlets"}]}}, {"review": {"des": "Excellent restaurant if you cant decide between steaks or sushi We had the Japanese Kobe steak. Expensive but melt in your mouth. Our waitress was super helpful and friendly. A little loud but everything we ordered was just perfect Miso cod. And skirt steak. Perfect", "pics": null}}, {"review": {"des": "After returning from Las Vegas where we had amazing dining experiences at Nobu and Morimoto, we really struggled to find something comparable in Chicago. There is supposedly a Nobu opening up next year along with its own hotel, but I'll believe it when I see it. In any case, we saw the reviews and A5 on the menu at Roka Akor in Chicago and had to try it for our anniversary.<br><br>We requested and was sat at a booth near the wine cellar, so that was fine. We did have one snafu with the busser when we arrived - when asking if we wanted bottled or tap, we asked what was on bottle. He told us Acqua Panna (my favorite bottled water) so we agreed. But instead he brought out San Benedetto which I didn't like. And at $8 per bottle, seemed very mediocre. I don't recommend this water.<br><br>Anyway, onto the food! Our server was very nice and made note to take into consideration some of our food restrictions. We ordered off the menu and did not do an Omakase or tasting menu because we are a bit picky with what we like/don't like. The meal came with a tofu amuse bouche that was good. Our favorite starters were the Beef Tataki, Escolar Tataki, Yellowtail, and Toro Tatare. AMAZING. We did not care for the Madai Crudo or the Wagyu Gunkan.<br><br>The main entrees we had were the skirt steak with truffle aioli and add on bone marrow and the A5 ribeye. These dishes were soooooo good. I cannot even describe how good they are!! I've never had a more tender skirt. And the A5 was just melt in your mouth. We were extremely happy with how everything turned out!<br><br>Our waiter was also really great and acknowledged our anniversary with a purple potato pot de creme dessert that was surprisingly delicious! We will be back for sure!!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ImYnplZcaCi81CHLmvahKw/348s.jpg", "caption": "Seasonal daily special - Beet salad. I didn't like the greens but the beets and whipped tofu were delicious."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Hh3DDmAWeePXpZJ3GVNtaQ/168s.jpg", "caption": "Amuse bouche from the chef - fried tofu. Good!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/IbTqML4D9yvfRkMs9lzxvQ/168s.jpg", "caption": "Yellowtail appetizer. One our favorites, but could have used a thin slice of jalapeño on top."}]}}, {"review": {"des": "The food here is phenomenal!!!! Flavor, flare, and fun!<br><br>I was expecting it to be a sushi restaurant but was pleasantly surprised roka is more of a Japanese grill.  Don't get me wrong they have some great sushi rolls but their entrees and sides are even better.<br><br>I pretty much loved everything I ate.  Some of my favorites were Salmon teriyaki which fell apart because it was cooked so perfectly, scallop appetizer, jalapeño roll, shrimp roll, and my most favorite of the night was the black truffle rice.  Someone will come to your table to mix up the rice and put some truffle shavings in.  Needless to say I was stuffed when I left because I ate so much. Luckily I had a few friends to help.<br><br>The service was also top notch and our waiter was great at dividing the check evenly.  Will definitely recommend this place to friends!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/SyZ569EOg9DdjQ3KrDcDtg/168s.jpg", "caption": "Scallop appetizer that was delish"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ZB0EsvqcustbLokY0NZUfQ/168s.jpg", "caption": "Sushi!! Really good rolls"}]}}, {"review": {"des": "This is great River North Japanese. Good fish. Expensive- it's River North. Good service though. Both the sushi and robata are great. I've been here on dates and for friends' birthday dinners.", "pics": null}}, {"review": {"des": "If someone asks me where I had best service, it's Roka. I'm writing 5 stars review for the waitress who was working on 5/12 around 9-11pm who provided yum brûlée when my friend mentioned it was her 23 rd birthday when she asked our ages (somehow led to that conversation while talking about alcohol tolerance level). Not only because of that unexpected service, she had great spirits and funny! Me and 2 of my friends went for sashimi set and a bottle of sake. Food and the sake tasted good of course. <br><br>I don't know what your name is but hopefully Roka recognizes this!", "pics": null}}, {"review": {"des": "We had the Decadent tasting menu and it was phenomenal!! We consider ourselves foodies and have eaten at many places. The food here ranks in the top. Our server David was so helpful without being intrusive. He made a point to come by our table and explain each dish. The servers who brought them out did the same, but he slowed it down so we could really understand the dishes. Great job!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ZiKlF1hbrXUI29zFIvbHVQ/348s.jpg", "caption": "Toro Tuna Tartare"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/eUKXz4dkaC90pdlVLXgeLg/168s.jpg", "caption": "Lobster Tempura"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/hUQJgc7wLv3mAm1A9gvyNA/168s.jpg", "caption": "Sashimi Platter"}]}}, {"review": {"des": "We went to Roka Akor last night for my husbands birthday and it was an amazing experience. The food was great and the service was outstanding. We took our waiters recommendation of ordering all of our good (food & appetizers) at one time and shared them family style. They brought the food out at a great pace and we were able to enjoy our food without ever feeling too stuffed or too hungry while waiting for the next thing. All of the food was outstanding. After each dish we all said \"ok that's my favorite\". We will definitely be back and recommend it to others.", "pics": null}}, {"review": {"des": "This is our new favorite spot in Chicago!!!!<br>Soooooool amazing!!!!<br>Delicious unique food, wonderful service, amazing atmosphere!!!<br>We enjoyed every single second being there!!! Would definitely come here many more times, luckily we live only 2 minutes away, and i would recommend this place to everyone I know!!! <br>Thank you Roka Akor for an awesome night, see you soon! <br><br>Ps. Check out my pics of this jaw dropping food!!! This is how food paradise looks like!!!", "pics": null}}, {"review": {"des": "This is a super late post since we ate here before celebrating New Year's at the Drake Hotel. <br><br>The restaurant had a New Year's omakase dinner special.  It was nice since we didn't have to choose anything out of their huge menu.  The hostess and waiter explained everything that came out and gave us a very personable experience though I can't remember everything writing this 7 months later. <br><br>Everything that came out was amazing! <br>They had this red miso soup with chunks of lobster,  a tuna tartare with quail egg,  fresh sashimi platter with freshly grated wasabi root, wagyu beef with truffle butter, king crab in chili lime sauce, a seared fish, beef appetizers,  and molten chocolate cake with green tea icecream... can't remember every detail but my taste buds were happily dancing.  I was spoiled with an amazing experience.  Highly recommend!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/TCCctytgoNPE9P6fsndiiA/348s.jpg", "caption": "Wagyu beef with truffle butter"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/VZVoOwUAGATtUPKsVsSkbg/168s.jpg", "caption": "king crab legs in chili lime sauce"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/mzKTWLil8aBtfNoTuUxnvQ/168s.jpg", "caption": "Omakase -Tuna tartare, red miso,  chocolate cake with green tea icecream, sashimi platter..."}]}}, {"review": {"des": "Roka Akur has great sushi but not so great service. I have been here twice and thought maybe the first time was just bad lick but unfortunately I was proven wrong. The first time we were rushed the whole entire dinner and barely had anytime to finish our dinner beef the waiter was pushing us out. As well as the waiter refused to remake our drinks as we didn't like them. We ordered lychee martinis which re suppose to be sweet and surgery but we tasted lime and he claimed there was no lime but the bartender said there was lime in it when we asked on our way out. Come on just give us a new drink! The second time was no better as we were rushed the entire dinner and the waiter spilled soy sauce on my brand new expensive dress which well ruined my dress which ended up in the trash.", "pics": null}}, {"review": {"des": "My last meal in Chicago, I didn't feel like stuffing myself with something heavy before a long flight. I found this upscale Japanese restaurant within walking distance and gave it a try.<br><br>The restaurant at the time had a special menu, \"Celebrate Chicago Chefs\" which included a three course lunch for $22 per person.<br><br>- Course One: Robata Grilled Japanese Shishito Peppers with Ponzu & Bonito Flakes<br>- Course Two: Wagyu Beef and Kimchi Dumplings AND Spicy Duo Tuna Maki<br>- Course Three: Chirashi - Assorted Sashimi over Rice<br><br>I ordered one of the special menu and one of the Roka Bento Style Lunch - Sushi Set $22. The bento lunch included Miso Soup, Crispy Butterfish Maki, Wagyu Dumplings in addition to the Flame Seared Salmon Nigiri, Hamachi Sashimi and Spicy Tuna Roll.<br><br>The Shishito Peppers could have used another minute on the grill but I still enjoyed the snapping crunch with the ponzu sauce. The combination of wagyu beef and kimchi was explosive. This dumpling was no joke. It had great flavor and didn't need the dipping sauce.<br><br>The fresh fish was nothing outstanding and some of the maki cuts were inconsistent. The Chirashi was more for presentation and sampling rather than a full meal. I'm not a big fan of diced fish on my Chirashi but rather sashimi slices. Again, it's more of a decoration at best and smaller than a musubi.<br><br>The interior was contemporary and sleek. I especially loved the color and style with the natural flow of the restaurant. Starting from the entrance, the service was impeccable throughout the meal. The staff was extremely attentive and always keep my hot water pot full.<br><br>If you're looking for a power lunch or just to hang out, Roka Akor is a good alternative. I love the idea of bento sets for lunch as it gives you a little bit of everything.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/BiXjMDRL6bgdGoMfD-3H4Q/348s.jpg", "caption": "Robata Grilled Japanese Shishito Peppers (part of lunch set)"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/EBOTpsr4yWzrC7n_0hObEQ/168s.jpg", "caption": "Interior"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/_fR7xvnHk8dww0vCiZQG3Q/168s.jpg", "caption": "Chirashi (part of lunch set)"}]}}, {"review": {"des": "Really good sushi! I got the salmon avocado and the sweet shrimp. Upon sitting at the bar I was greeted with friendly service, but was not thrilled that the bartender pointed to a menu item and said he was going to put in an order for a specific roll for me because it was delicious, when I didn't even want to order it. Pretty sure it was just an expensive menu item. Besides that one element, had a nice experience. One of the other bartenders was super sweet and checked in with me a couple of times. Definitely would have loved to had company for this place...maybe the next time I'm in Chi-town!", "pics": null}}, {"review": {"des": "It was our first time visiting this restaurant. We had a fantastic time. Fun place to hang out at. Great food. Big menus selection. My favorite was the rice mushroom with truffles. So so good. Will definitely come back when we are in town.", "pics": null}}, {"review": {"des": "Originally I gave this restaurant a lower score, as they mischarged me for a virgin mojito. But after posting to Yelp, one of their staff reached out to me immediately to resolve the issue. I'm very impressed they were listening to Yelp reviews, as well as how fast they were. Very impressive service to a somewhat small grip I had.<br><br>As said in the original post, the Sushi at this restaurant was EXCELLENT. The food was super fresh and high quality - which is so important for a sushi restaurant. They presented the food in a really neat experience, with interesting designs like a dish that came out on top of ice that was on top of a blue/white light along with extravagant garnish. <br><br>And I really appreciated the chefs selection options, for someone who had a hard time deciding what to order at a new restaurant.<br><br>I would HIGHLY recommend this to anyone visiting the Chicago area. And hope to go back soon! :)", "pics": null}}, {"review": {"des": "Only negative: Made a reservation for 7:00 but didn't get seated until 7:35. Didn't mind too much but still would have liked to be seated a bit earlier.<br><br>Ordered the salmon avocado and crispy tuna to share. Both were great!<br><br>Had the bone marrow and wagyu sirloin with a side of broccolini. Definitely recommend the sirloin! However, the broccolini was only okay -- I would probably try a different side next time.<br><br>Overall, a good experience.", "pics": null}}, {"review": {"des": "A year and a half ago my wife and I visited here for our 25th anniversary and had the \"decadent\" Chefs choice meal. It was one of the best meals I had that year. When we arrived for our reservation, they brought us Champagne and oyster shooters on the house to get our experience started. The meal consisted of five courses chosen by the chef of all of their high end products from Toro to A5 grade Waygu Beef. Every course was an amazing work of art that was worthy of a front cover of Food and Wine magazine. Not knowing what the courses were going to be,  we asked the sommelier to match every course. The wine and food pairings were amzing and three hours later we left with a very memorable  experience and extremely  happy palettes.<br>      I have  a habit of not letting experiences like that be ruined by going back. Historically I am always dissapointed with my next trip so I never went back.... till tonight.<br>       First of all, as a single diner, I was treated just as well as an eight top. My server Nick was very knowledgeable of the menu and pleasant to be with. The management was also very friendly, knowledgeable and professional. <br>        Let's talk food. I had the Premium Sashimi platter which was amazing. The highlight was the Blue Fin Tuna \"flight\" that included  Akami, Chu-Toro, and OToro. Then, to my surpise, they added Nigiri on the side (I missed that after I read premium Sashimi  They they were too beautiful to eat (for about five seconds). They were so good I asked Nick to get me two more and surprise me. He brought Toro Tar Tar and a Spot Prawn with Uni. I could have eaten a whole plate of just those and left happy. To make everything even better I orders a glass of Kubota Neldju Cold Sake which paired amazingly well.<br>       I have no more fear that the first visit was a fluke. $140 later I knew I would come back, but next time with my wife.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/r9Wzf0TJgxRd8MtE9001PA/348s.jpg", "caption": "Toro TarTar"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/yyLpZNfrg2HsZhXeu3uXzw/168s.jpg", "caption": "Premium Sashimi platter."}]}}, {"review": {"des": "Everything was delicious! Price isn't ridiculously high for such high quality food! Must try the purple potato dessert, it wasn't on the menu but it was available! Also, the restaurant has a great vibe to it and location is awesome.", "pics": null}}, {"review": {"des": "+ recently tried the lamb cutlets and enjoyed them, although I wish they weren't so well done/on the dry side<br><br>- my favorite dish, the Chilean sea bass, was recently changed in terms of its accompanying broth--it used to be a simple, soy-based (?) broth that was light and elegant, but now it's been replaced with carrot miso or something along those lines and I feel like they ruined a good thing. Many of my friends whom I've recommended Roka to (along with specific dishes to order) have all loved the sea bass dish. I'm sad they changed it and that it's no longer available--I asked for it and the waiter said it couldn't be done since the broth is pre made <br><br>Anyway, Roka's current highlights imo are the nigiri and robata grill items", "pics": null}}, {"review": {"des": "This is one of my top three restaurants ever. I've had almost everything on the menu and never had anything I wouldn't get a second time. My favorite thing ever though is that this is the best omakase that I've ever had. It is actually filling unlike other omasake menus. It usually comes with a sashimi platter, an app, a roll, a few entrees and dessert. So amazingly mouthwatering! You'll regret it if you don't go here!", "pics": null}}, {"review": {"des": "Mediocre and overpriced Japanese steakhouse/sushi/fusion spot north of the river. The food is not memorable, except in the sense that I remember paying for a meal I didn't particularly enjoy. The service is also poor, we barely saw our server, he was short with us and wasn't interested in making the experience a good one.<br><br>We started with some apps - crispy squid, escolar tataki, and wagyu/kimchi dumplings. Crispy squid was my favorite, but it wasn't amazing by any means. The dumplings were dumplings, and the tataki was fine but none of us were crazy about it.<br><br>I ordered the modern nigiri plate for dinner. The fish did not have much flavor and the accoutrements made that little flavor it did have disappear. I had a side of the mushroom rice, which was my favorite dish of the night (basically a mushroom risotto). Also tried the skirt steak and sides of sweet potatoes and mushroom skewers which were ok as well.<br><br>Overall, it's not a bad meal, but when the meal is 60-70 a person I have certain expectations of quality of ingredients, execution, and service and roka misses the mark.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/MqV76q0YSuybdXeKz6f2Uw/348s.jpg", "caption": "Modern nigiri - just ok"}]}}, {"review": {"des": "This place has the most amazing ambience. The food is incredible. The drinks are delicious. The wait staff is incredibly nice. Ben the manager truly makes this place welcoming. And the other manager Billy is super friendly and accommodating too. He always checks up on the table and is so friendly. This is our favorite River North spot to dine!", "pics": null}}, {"review": {"des": "wowowowowowowowowowowowow. Came here while on a business trip with a big group of coworkers and I was amazed by the food. Definitely a great spot for a large group, because there is a TON to try! The staff was extremely friendly and very accommodating to our large group that grew by a few people as the night went on. We basically told our waiter general foods we were interested in and he lead us through things to order and we got all of it! The Wagyu beef was a huge highlight for me, all the sushi dishes were melt in your mouth delicious, the lobster tempura was so good we had to order a second dish of it because we ate it so quickly! I cant even remember everything that we got because there was so much, but literally everything was delicious. Its definitely an expensive spot but worth it for the friendly staff, delicious food, and overall atmosphere of the spot. This was the kind of restaurant experience is the kind that end up using as the 5-star comparison for other spots. Next time I am in Chicago I hope to be back!", "pics": null}}, {"review": {"des": "Absolutely love this place! High quality everything starting when you walk in the door. I highly recommend this place. The tasting menu is amazing. The Wagyu gunkan is a must try to be honest though no dish disappointed!! Top Notch!", "pics": null}}, {"review": {"des": "Roka Akor was a fabulous pick for my birthday dinner. I had made an 8:45 reservation for which my whole party arrived on time. We waited near the bar and ordered some drinks in the mean time. I asked for a custom lychee martini and it was incredible! We were probably waiting upwards to a half hour for our table to clear when a gentleman walked us back to their private room area which we would be seated at instead for the inconvenience.<br><br>Everyone in my party really enjoyed the food and ordered for the table. My best friend and I who are vegetarian found the vegetarian items to be delicious. There was a mixup in some of my friends orders and so they provided an appetizer on the house. Sarah our waitress was very kind and accommodating! <br><br>We had a great time. There was no rush at all and the staff was very patient with my small but rowdy party. A fabulous cake was provided as well. <br><br>Will most definitely be back. Roka would make a great place for a date!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/FgT1eQBFp3bNhJREjo3d2g/348s.jpg", "caption": "Spicy Fried Tofu"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/gOLNZnqpLuh4DtpJ5Je_hA/168s.jpg", "caption": "Miso White Miso Soup"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/FBcdhYIFC6hDsEgnzdzpkA/168s.jpg", "caption": "Tempura Tempura Vegetable Roll"}]}}, {"review": {"des": "Been here twice and had an amazing experience both times. Service is so amazing, probably the best service I've seen (so far). Even bus persons have so much etiquette and manners. <br><br>Food quality is really up there. But not a place to have a full meal. A place to experience good, high quality sushi and Japanese cuisine. <br><br>It's in the city, surrounded by a lot of amazing restaurants, and this is one of the best sushi places I've been to so far.", "pics": null}}, {"review": {"des": "What a cool ambiance and vibe to this place.<br>Tasty heirloom tomatoes, King crab Cali rolls. Wagyu beef with kimchi was tasty to all that ate and tried it. I was beyond impressed by Aaron, he was our waiter, very attentive and even replaced the white napkin for my friend, who was wearing a black cloth dress to avoid getting lint on her dress, that was really impressive to me, love the attention to detail.", "pics": null}}, {"review": {"des": "After close to two years living in Chicago, I can finally say I have a favorite restaurant.<br><br>Y'all. I can't believe it took me this long to actually try Roka Akor. I never ever cook, and as many of the restaurants Ive been to in Chicago, I can confidently proclaim that Roka Akor has stolen my heart and the #1 spot on my favorites list to dine in the city.<br><br>Location: Roka Akor sits right in the heart of River North on the corner. Its very close to a plethora of hotels, bars, other restaurants, salons, etc. Consequently, you'd think that it would be a tourist trap and/or busy at all times. It is not. Which is a definite shame.<br><br>Decor: Very modern. Very sleek. Very chic. My favorite part about the decor in Roka Akor is the dining room near the grill where you have \"lit lighting\" my definition for when you have the perfect lighting for selfies and/or fancy food photography. In addition to great lighting, the views of the street are spectacular thanks to the floor to ceiling windows.<br><br>Service: Impeccable. From the second you walk through the door, to the second you exit, A+mazing customer service all around. HUGE shout out and thanks to my server Seung. He was very informative and extremely pleasant and attentive, but not to the point that it seemed as if he was hovering. Just great.<br><br>Food: I will dream of this food. I will dream of the displays. I will come back time and time again. I ordered a few items and each and every dish was spectacular.<br><br>Wagyu Beef and Kimchi Dumplings: These are not your average potstickers. The quality of the wagyu mixed with the acidity of the kimchi, wrapped in a homemade dumpling, and crisped to the heavens, I downed all of these bad boys. Thank the gods I decided to dine alone. I would have been sad had I been coerced into sharing. They were tender, juicy (overflowing with juice), and succulent. Please order these.<br><br>Chef's 3 Sashimi Platter: The freshest fish I've had thus far in Chicago! Truly. This was my first time ever trying sashimi. I have been on a mission to truly expand my palette to things ordinary folks might not enjoy: raw fish is one of those things. I was absolutely blown away by the beautiful display on which they were served, but I was even more infatuated by how different each fish tasted. My favorite was the tuna, then the salmon, then the yellowtail. But all were good.<br><br>The Brussels Sprouts: Fan. tas. tic. I inhaled these babies. The sauce that they were tossed in provided the ultimate kick and zing to the earthy essence of the sprouts. And because they were crisped, the crunch was such a treat to the moist chewy consistency of the fish and the dumplings. Get them. Thank me later.<br><br>The Prime Ribeye: HEAVENLY! DIVINE! No other words. I am a steak snob. I get seriously angry when a steak isnt prepared well. Definitely not the case at RA. Each and every single bite, the cow melted in my mouth. Bursting with flavor and spices, each bite had me terrified I was about to finish the plate. When I did, I almost cried. But then I realized I still had dessert coming.<br><br>The Warm Chocolate Cake: Decadent. High quality chocolate. If you have room for dessert, do yourself a favor and end your meal on a high note. This did not disappoint. <br><br>5 stars. In each and every way. I am thankful for restaurants like Roka Akor.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/qIFsWw5KCLlRK8rjzes2OQ/348s.jpg", "caption": "Warm chocolate cake"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Hh5E-GJ9wOWV2diITv4xow/168s.jpg", "caption": "Crispy Brussels sprout"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/TYQrXJnYHiPDWaD2NCTBtA/168s.jpg", "caption": "Prime ribeye steak"}]}}, {"review": {"des": "Came here to eat with my friend. We ordered everything but sushi. The food here is pretty creative compared to other Asian fusion restaurants. But the fish is a little bit overcooked.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/aU-xr8Tx_EagTgf6Jno6Pg/348s.jpg", "caption": "lobster dumpling"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/egR4fJGDEOQteKkH5ELVuQ/168s.jpg", "caption": "shrimp tempera"}]}}, {"review": {"des": "Loved everything about this restaurant. It is beautiful inside with comfortable seating. Tried two sushi rolls and the pot stickers. The wagyu potstickers are essential literally melt in your mouth delish. I loved the hamachi Serrano chili roll would definitely order again. The seared salmon roll was good but wouldn't order again. Also the steak served with bone marrow and truffle aioli was to die for. The chocolate cake for dessert was also amazing. Had two cocktails here which were definitely strong! I can't wait to return here and try some more options on the menu.", "pics": null}}, {"review": {"des": "Loved the miso cod (5/5)!  Beautiful presentation but even better flavor, texture, and complementary nature of the sauce.  The lamb chops were also good (4/5) and the grilled scallops were quite big and tasty (4/5).  A friend tried the domestic sirloin wagyu and he said it was a little chewy, but otherwise a great overall experience.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/lZuOh7ZWAqBjQwDli8Akzg/348s.jpg", "caption": "Miso cod 5/5"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/uwKtj7i0DlEWajLLSw7YUA/168s.jpg", "caption": "Cheesecake"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/sNAjSuz5dY0Z8c8c73Wymw/168s.jpg", "caption": "Lamb chops 4/5"}]}}, {"review": {"des": "My girlfriend and I had our three year anny here tonight. Our waitress Cici did an amazing job!! Seriously though she is amazing. Thanks for the dessert and intro course :)<br><br>The food is spectacular. Sushi and sashimi are must haves. If you get ribeye, order the bone marrow side as well and combine", "pics": null}}, {"review": {"des": "This was a great first pick for restaurant week. Just by looking at the menu, I was drooling. My friend and I got excited and even opted to do the wine pairing with the three courses. We also had similar tastes so decided to each pick different items for the courses so we could have a taste of everything:<br><br>First course- the sashimi was delightful. Nice thick cuts and good quality. The seared salmon maki was also delicious! Great start to the meal.<br><br>Second course- we ordered the cod and the steak. The cod was super tender- amazing! The brussel sprouts that came with the second course was probably my favorite though. These crispy brussel sprouts were probably the best I've had. Super flavorful. The steak was decent too.<br><br>Dessert time! The purple potato pudding was actually really tasty. I love this potato (a Japanese sweet potato) normally by itself so it was interesting how they made it into a dessert. The chocolate cake was also heavenly. <br><br>All the wine pairings were perfect and tasty. My only complaint is that the service was soooo rushed! They were definitely in a hurry to get us out of there, which I didn't appreciate much. Other than this though it was an exceptional meal at roka!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/hKflFsZdEBUdQk36IARu2Q/348s.jpg", "caption": "Cod"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/rQyYLFrBiI76WJChUmzNfg/168s.jpg", "caption": "Sashimi"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/51jQ9I10ky64OTvEOaq5BQ/168s.jpg", "caption": "Salmon maki"}]}}, {"review": {"des": "The omakase is actually a tasting menu with very large and very okay courses. And the wines are only okay, with one that was basically just a pricier yellowtail. Can't recommend the omakase. That being said, if you can get the wagyu course a la carte, I can strongly recommend that.", "pics": null}}, {"review": {"des": "Love this spot in Chi-town! Pretty much everything is delicious but the standouts are the Wagyu dumplings, scallop roll, and skirt steak.  Cool and trendy, I would highly recommend for any occasion!  Enjoy!", "pics": null}}, {"review": {"des": "Best restaurant I have ever been to and that is coming from someone that has traveled the globe. I love everything about the place especially the Kobe beef. The fresh tuna is amazing as well. I would recommend this restaurant to anyone, it is amazing.", "pics": null}}, {"review": {"des": "Best steak I've had. Rib eye was to die for. Must order. <br>One chicken dish and rib eye were halal too.", "pics": null}}, {"review": {"des": "My boyfriend took me here for date night last night after having gone a couple times with some friends and loving it. The place was really crowded and had great energy! To start, I got the blood orange margarita, which was a nice twist on a traditional marg. For appetizers, we got the crispy squid, which was really tasty! Definitely share it with a friend--the bowl is large! Next up we got the skirt steak. WOW, this was good! We got it medium rare, and it was super juicy and flavorful. For maki, we got the crispy tuna and soft shell crab. My go-to is usually spicy tuna. This was a little too spicy for my boyfriend, and the soft shell crab maki was okay. Service was great! All in all, I would definitely come back again and try other items on the menu.", "pics": null}}, {"review": {"des": "Our first night in town and so happy to have stumbled onto this wonderful sushi steakhouse restaurant!  We didn't have reservations so they sat us at the sushi bar and we loved watching the chef cutting the steaks and all the food coming off the grill.  We ordered Brussels sprouts and a beet salad as appetizer and then a salmon avocado roll and a scallop roll.  The food was fantastic and the restaurant had a very nice vibe.  If you want to try something new , this is the place for you !", "pics": null}}, {"review": {"des": "The Sashimi chefs selection is just awesome!<br>Also tried the cuedo hefeweizen style beer<br>A great experience!", "pics": null}}, {"review": {"des": "Valentine's Day dinner at Roka Akor and I'm STARVING!! It's been 30 minutes or more since the appetizer (scallop dynamite roll and tataki) came out and we are still waiting for the sashimi order. Does it really take that long to slice into some fish?? <br><br>The quality of the food is excellent - the wagyu beef is tender, well cooked and super flavorful with the salts. The dynamite scallop roll was dynamite as evidenced by previous reviews. The miso cod was ok, not Nobu level but tasty. <br><br>In terms of service is summed up in one word CONFUSED. From the lukewarm/borderline cold hostess (maybe she was mad about having to work on Valentine's Day?) to the weird seating arrangement (communal table next to another couple who looked like they were fighting...just not appropriate for Valentine's Day) to the slow service where the sashimi never came (and when we asked to remove it from the bill it came 30 minutes AFTER the hot main courses)... they just seemed ill equipped to handle the flow of people and food. Many tables were open in the restaurant but there were crowds of people waiting by the host area. Every few minutes someone went up to ask why they were waiting so long. We ended up at the Sushi bar because it was just too weird sitting that close to another couple on V day....but it's kind of a waste of a pretty dress and heels!<br>It would have been nice to actually face my hubby and talk!<br><br>Good food overall but this place just seemed overwhelmed and unable to handle the traffic of Valentine's Day diners on a Wednesday night. I can't imagine what it might be like on a busy weekend evening.<br><br>Footnote...we felt so unsatisfied afterwards we ended up going to get a burger after...which is a tad sad after a $300+ meal!", "pics": null}}, {"review": {"des": "Down the street from my building on Clark and have been a bunch of times now. So, time to write a review after taking the girls out last night. ALWAYS GREAT. Steak and seafood prepared on mesquite grills and done perfectly. Man does this place smell great. Tempura seafood and veggies, and my particular fav the Asian mesquite grilled ribs-wow!! Service is always right there with the next glass of wine or bottle of sake. I guess this chain started out in Frisco, and now has several locations in Chi-town, but have only been to the Clark street location. Great bar scene too. Always crowded for a reason, but have never had trouble getting a table pretty quickly. Have taken a lot of clients here who loved it. I would definitely pass on the BBQ place across the street (another story) and try this place. Go here.", "pics": null}}, {"review": {"des": "Hats off to the people at Roka Akor!!!!<br><br>The food was awesome.  We had the $128/person decadent omakase.<br><br>My dad, sister and I had a good experience.  The fish was fresh, oysters were fresh, the lobster tempura was crunchy and tasty.  <br><br>The only qualm were the Brussels sprouts and the mushroom-truffle-rice dish. Although both were tasty, I found these two dishes to be a plain addition to the omakase menu.  By plain, I mean they weren't anything special compared to the other dishes on the menu.<br><br>Food is very good although it may be pricey to some.<br><br>Another issue was a piece of hair we found in one of our cloth napkins before dining.  Also, our waitress didn't know about what kind of beef was on the omakase menu, which I think should be a must.<br><br>Will be back!", "pics": null}}, {"review": {"des": "We were in town for the Chicago Marathon this weekend and had a really excellent dinner at Roka Akor. A friend joined me and my wife, so we ordered a bit more than usual:<br><br>Appetizers:<br>Waygu Beef & Kimchi Dumplings: 5/5 - really excellent<br>Robata Grilled Scallops - also delicious!<br><br>Mains:<br>The chef's selection Nigiri rolls were incredible - this alone was worth the trip - very fresh fish, although the sushi rice could have used a touch more vinegar, but that's not a huge drawback with excellent fish<br><br>Maki rolls: Tuna Four Ways and Crispy Prawn/Chirashi - both tasty, but not as good as the nigiri rolls - overall very nice<br><br>Salmon Teriyaki - perfectly cooked, seasoned just right - a must have if you aren't in the mood for sushi.<br><br>Sides- the brussels sprouts were delicious and the sweet potatoes lasted all of 10 seconds they were so good!<br><br>The service at Roka Akor is also excellent - and while this is on the expensive end of restaurants in the area, it's worth it if you enjoy really excellent, fresh fish.", "pics": null}}, {"review": {"des": "OMG. 10/10 recommend. BEST dinner I've had in a long af time. Me and 2 friends came for restaurant week and we got the set lunch menu. Straight up, everything was SO* GOOD* Our set included Miso Soup with Mushrooms, Yellowtail, Tuna Maki and then I got the Codfish Skewers and my friends got the Skirt Steak. Honestly, I preferred the Skirt Steak. I don't know if it's because I was already feeling FISHY after the yellowtail and the tuna maki. The codfish was still REALLY good and was super flavorful and well worth it. I just thought the pairing with the salad and the rice was kinda off. If I could, I probably wouldn't get it again. <br><br>Ok ok ok, now the skirt steak. Holy s***, the garlic/ponzu(?) sauce was TO DIE FOR. Like I straight up died and went to heaven. I couldn't stop eating off my friend's plate. The steak was juicy and the sauce was so perfectly paired and perfectly sweet. There was literally nothing wrong with it. I would literally come here and eat this everyday if I were rich enough. L O V E.", "pics": null}}, {"review": {"des": "Great food, great service. Wagyu in the tasting menu was ok, it has chewy pieces in the middle which other restaurants in the same price range in nyc would not serve to their customers. The rest of the menu is great though, so is the service.", "pics": null}}, {"review": {"des": "Slid in here late one night after having the chance to see Hamilton.  Glad they were open until midnight.  We were impressed with the service even though we were in late and it was getting close to closing time.  Staff was very friendly and helpful even though you know they probably wanted to break things down and get home.<br><br>We ordered quickly - red miso soup, robata grilled scallops, some tempura, marinated black cod, and a bunch of nigiri.  Personally, I love it when sushi places have a Tsukiji menu or a menu of stuff not typically found on the standard menu (sorry - tuna, salmon and shrimp get boring and I'm generally not a fan of most over sauced maki), but it didn't look like Roka Akor had something like that.  That being said - I would say that this place was pretty solid and is definitely a great place to go for a sushi fix.", "pics": null}}, {"review": {"des": "Fishy fish.   Very disappointing...I was expecting more!  240.00 for Kobe steak?  LOL anyway they are trying hard to be like nobu ....save your money and check out a local Japanese sushi bar", "pics": null}}, {"review": {"des": "This place was amazing! We went here recently on a date night and we ordered sushi, yakitori, some veggies and Kobe beef. Especially tuna sashimi was incredibly delicious, but also everything else. It was totally worth every penny. Would absolutely go back.", "pics": null}}, {"review": {"des": "Came here for a special occasion with my spouse and two toddlers on a Friday night. We were outliers having brought our kids, but the host and our waiter were kind, attentive, and humorous which put us at ease. <br><br>Let me say that for those looking for halal, the restaurant informed us that the beef tatataki in the cold plate section of the menu, the fillet, rib eye and the NY strip were all halal certified from Omaha.<br><br>Really wonderful dinning experience. Would come back again.", "pics": null}}, {"review": {"des": "Parking: street parking is hard but look around neighboring blocks<br><br>Ambience: The place is beautiful, you're greeted with the purple lighted bar. The restaurant's vibe is trendy and cool. <br><br>Service: we had a table of 9 and it was a friend's birthday so service was excellent! We had complimentary glass of champagne and complimentary appetizer (cracker with some crab meat?) thanks to the chef. The waiter was patient as we looked over the menu for food and drinks. I appreciated that he gave us good recommendations as I liked some of the food that he recommended. <br><br>Food: If you want authentic Japanese food, this is not the place to go. I felt that the food was very expensive for the quality of food. After trying the food, I felt like they served the food because it's \"trendy,\" not for its authenticity. Each sushi roll came with 8 pieces and the prices ranged between $13-$22. Since we were a large group, we ate the sushi rolls family style and ordered double orders of the Hamachi Serrano Chili ($13), Salmon and Avocado ($12), Soft Shell Crab ($14), Crispy Unagi & Avocado ($18), Dynamite Scallop ($18), Seared Salmon Maki ($22), California ($13), and Spicy Tuna ($12). Of all of these rolls, the ones that stood out were the Hamachi Serrano Chili, Crispy Unagi & Avocado, and the Dynamite Scallop being my highlight of the meal. The rest of the sushi was okay in terms of flavor and quality of sushi. The serving sizes were small and I don't think my party was full even after ordering all those rolls. <br><br>As for the dessert, I ordered the Green Tea Custard ($10), which had a foam/whipped cream on top of the green tea custard with caramelized bananas. I liked the whipped cream thing but once I got to the bottom of the jar, there was way too much green tea in the custard which didn't taste very pleasant. The mushy bananas did not help with the taste or texture, which threw me off. I appreciated that they gave my friend a free dessert for his birthday. He got some taro-flavored custard with fresh fruits on top, which was way better than my dessert.<br><br>Drinks: They had a ton of choices for alcoholic beverages like sake, cocktails, beer, wine, etc. I decided to get the Better Together cocktail, which had rum and ginger beer in it. It looked yummy and like a Mai Tai but I didn't like the taste. The ginger beer was overpowering and there wasn't as much rum as I'd liked. I switched with my friend who ordered some drink with Japanese whisky which was sweeter than I thought but it was yummy.<br><br>Verdict: I don't think I'll be coming back here for dinner. There's a ton of AYCE sushi buffets in the city that serve higher quality sushi for a lower price. However, I'm still willing to come back to try their happy hour during the week for cheap $5 appetizers and drinks. That is such a good deal compared to our expensive dinner which totaled to $40 per person so $300-$400 split among 9 people.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/X3Om_Pz7Hk9q9ygA5zF2Iw/348s.jpg", "caption": "Mochi Cake"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/i-bH4ZQIsAbxHJnjI3pxFg/168s.jpg", "caption": "Green Tea Custard"}]}}, {"review": {"des": "I went to the Chicago location for the first time the other day with some friends visiting town. They were staying downtown so we checked out the Chicago Roka despite some of my own bad experiences at the Skokie Old orchard location for which I wasn't impressed at all. I was hesistant at first to come back to Roka, but the incredible food and the outstanding service by our server Yura, has fully restored my opinion of Roka. Her suggestions were on point and she even catered to my picky vegetarian friend! Thanks so much Yura, I would gladly come back to the chicago location again for sure. We had an amazing time! They have my vote!", "pics": null}}, {"review": {"des": "Roka Akor truly cares about ensuring that their diners have a great experience. The manager and regional manager (Ben and Steve, respectively) wanted to make sure that I also had a wonderful experience. They put together a menu of their favorite items and as a result, I had the opportunity to try some new dishes.<br><br>My favorite dish of the night would probably have to be the nigiri flight. It was beautifully presented and the fish was fresh. I would have to say that the Prime Filet tasted much better than the Prime Rib Eye I had the first time I came here. It was much more tender and closer to that \"medium rare\" texture that I had expected. I noticed that several of the side dishes--the Shishito Peppers and Brussels Sprouts in particular--left a rather sour aftertaste that I was not fond of so I will most likely refrain from ordering them again in the future. I will also say that although I am not much of an oyster person, the oysters we were served were exceptionally fresh and briny, a flavor which I appreciated greatly.<br><br>Ben and Steve made my second experience at Roka Akor much more enjoyable. Thanks again for a great night!", "pics": null}}, {"review": {"des": "Very overpriced food, do not come into this restaurant expecting a cheap meal, or feeling like you got a good deal. With that aside, my dining experience at Roka Akor was fantastic. The service from our waiter was awesome, they never let your glass of water sit below the rim. He was very good with explaining the different popular dishes. We went with the king salmon appetizer, a sushi roll, the a5 wagyu with bone marrow, mushrooms, and for dessert, banana matcha custard and the jasmine cheesecake. Everything was good, but the wagyu steak was absolutely next level. It was the best steak i've ever had, melt in your mouth tenderness. Next time we dine in, we might just order 3 of the steaks to share between the two of us!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/aotkI7H5AgFT4F2tCG0IIw/348s.jpg", "caption": "Green Tea Custard and jasmine cheesecake"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/2qcL_3d8WBVUDNpU720sow/168s.jpg", "caption": "Snake River Farms American Wagyu Sirloin* (6 Oz.) with Cremini Mushrooms"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/lqja47kaifoTnoGUJIWrGA/168s.jpg", "caption": "Unagi Maguro roll"}]}}, {"review": {"des": "I've been to Roka twice and thoroughly enjoyed it both times. The menu is intimidating but it's hard to go wrong. Most of the items are designed to be shared and the whole concept works well. Not to write off the steak, seafood, sushi, sashimi, or other dishes, but you're missing out if you don't order the Korean Spiced Lamb. <br><br>When you make a reservation, specify that you want to sit in the main dining room. The bar seating arrangements (for three, at least) are too casual and the tables too small to enjoy a serious meal.", "pics": null}}, {"review": {"des": "Roka Akor, aka my favorite restaurant in Chicago! I have been here twice, both during restaurant week. The restaurant week deal is off the charts! Everything that we tried on the menu was top notch. Also, not a huge sashimi guy but this place was the best I have ever had. It is a must try, and I know it is a bit pricey so wait until restaurant week if you would like an give it a try.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Lq5HCCIALNRDIhUmuiy5Mw/348s.jpg", "caption": "Sweet Potato desert for restaurant week. So dank"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ohWK3jBtgy3BroAniiDr9A/168s.jpg", "caption": "Prime Skirt Steak"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/SDXTT23_P5cpmpr91aVNkg/168s.jpg", "caption": "Restaurant week sashimi appetizer (my favorite)"}]}}, {"review": {"des": "Pretty authentic Japanese cuisine. We went there for lunch without reservation. We were seated immediately. The food was served pretty quick and they are delicious. The quality of fish are very good. Highly recommend.", "pics": null}}, {"review": {"des": "Booked a Reservation for my boyfriends birthday. Neither of us had ever been here. Great vibe and decor in the restaurant. We had a great waitress and we found the food to be so delicious! It is very pricey, but some items are definitely worth it!<br><br>What we ordered and highlights- <br>Butterfish Tataki- one of the most delicious things I've ever had. It's a must!<br>Beef and Kimchi dumplings- Delicious<br>Steak Tartare- Good, but I've had better<br>We ordered the chef's selection of 5 sashimi pieces- The fish was melt in your mouth good! Next time we think we will just order salmon/tuna as those were our favorites.<br>We ordered 2 sushi rolls, spicy tuna and dynamite scallop.<br>The spicy tuna could be skipped however the dynamite scallop- i've never tasted anything like it. It was unbelievably good!!<br><br>We also ordered the lamb cutlets which were good but I would probably skip next time, however my boyfriend really enjoyed them.<br><br>We had a great waitress but felt that the meal was a bit rushed. We would've liked to have had a slower experience. We will hopefully be back soon though! Thank you!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/1F7MgP7rnL-PhhnO-zi71w/348s.jpg", "caption": "Dumplings and butterfush tataki"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/LeJRV9T3FV5DkmO5S6A9vw/168s.jpg", "caption": "Steak tartare"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/wjCjHTJS1ORkYc_yD0unOg/168s.jpg", "caption": "Dynamite scallop and spicy tuna"}]}}, {"review": {"des": "I've been here twice and it definitely exceeded my expectations both times. I shared multiple small plates with friends and literally every single one was delicious. Even the edamame, once or the simplest dishes, was better than anywhere else I've been. We had a nice variety of sushi, seafood and beef dishes and vegetables and they were all amazing. The ambience is super nice as well.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/4eqwSr2DxxiAAWYyodrsyw/168s.jpg", "caption": "Delicious scallops"}]}}, {"review": {"des": "Just okay. Ambience: 5/5 - Beautiful space and unique/modern design. Service: 5/5 - I had a reservation and we were seated right away. There was a coat service for those interested. Our waitress was friendly and helpful. She was even able to split the bill by what everyone ordered which was helpful and we didn't even have to ask. Drinks: 4/5 - I ordered a lychee martini and a glass of Riesling. Both really good, but the price point was steep. Food: 2/5. The food was really subpar and overpriced. Though the other elements I described were good, obviously the food is the most important one. I tried the lobster and shrimp dumplings. They were tasty, but so so oily. And definitely not worth almost $20. I tried the fried squid which was good, but heavy (I guess that's the point). I tried the salmon nigiri which was disgusting. The salmon was so fatty and literally had white chunks of fat on the side. I get some people would like that, but not me. I'm stunned that they wouldn't cut off the fat and furthermore charge $8 for that. Lastly I tried the dynamite scallop roll which was probably the best thing I ate during this meal, but definitely not worth $20. Skip this one and go to Sunda across the street instead.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/zRg0Bh8Rv9ej8FQ4m7NYAg/348s.jpg", "caption": "Shrimp/lobster dumplings"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/bEakopEB20ti2pKtiMwEig/168s.jpg", "caption": "Lychee martini"}]}}, {"review": {"des": "One of my favorite places at the moment. I am a standard issue Irishman so bring me a fork and a bunch of grilled meat. I really enjoy their ribeye and skirt steak, make sure to get whatever the skirt steak sauce is with whatever steak you get, it's their best sauce. Kimchi dumplings are awesome, my guests really enjoy the sushi and seafood dishes. This place a hidden gem at lunch, get a bento box in a hurry and on the cheaper side for a high quality lunch in the city.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/uJv_uo-8QV5aX0_AsCPBLA/168s.jpg", "caption": "Ribeye all day"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/E4uTzZ5961HRT2e0X1P9fg/168s.jpg", "caption": "Mule to get started"}]}}, {"review": {"des": "The food, service, and ambiance are all on point. We sat in the lounge area by the front of the restaurant, which had adequate seating on a Saturday night around 8:00pm. I didn't get to go to the back of the restaurant, but it seemed to be a pretty spacious restaurant.<br><br>There's outdoor seating, a lounge area to the left of the entrance, and main dining area in the back. I love how the bar has a wrap-around shelf with drinks inside as well as the wooden decor. It definitely gives off a trendy, modern vibe. You know those restaurants or lounges where the music is so loud that you have to shout at each other until your throat hurts? Not here! You can have a normal conversation yet can still hear the music if you focus on it.<br><br>We ordered the following off the menu:<br>- Toro tartare: Served cold with ossetra caviar, quail egg, and taro crisp. I'm always skeptical about anything raw, but this was delicious and definitely tasted fresh. You're supposed to spoon a bit of the toro tartare onto the taro crisp and eat the whole thing. The taro crisp wasn't overly salty by any means so it didn't overpower the flavor of the toro tartare.<br>- Crispy squid: This was my favorite dish. It has chili flavoring, and you squeeze the lime over the squid. It was served with a sauce on the side. All the flavors just worked well with each other. Yum!<br>- Shrimp and lobster dumplings: This definitely had a unique flavor, in a positive way. I can't quite put my finger on what it is, but this was pretty tasty.<br>We also sampled some of Rich's (the GM) creations, which were fantastic.<br><br>If you come here starving, it will be quite an expensive meal. If my friend wasn't there, I would most certainly eat everything we had in a heartbeat and then some. However, I demonstrated self control and avoided looking like I hadn't eaten for days.<br><br>Service was impeccable. Rich made sure we were taken care of and was awesome blossom. Our server was friendly and attentive as well.<br><br>I definitely recommend checking this restaurant out when you're in the mood for a fancy place. I'll definitely come back to try the sushi or happy hour next time.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/gIdrGXyW2MdltY2RnzETZQ/348s.jpg", "caption": "Champagne"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/FnLa0geVehl2vpBFM_c-bQ/168s.jpg", "caption": "Shrimp ceviche"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/zeSiOTbWYXDd56d7idByMg/168s.jpg", "caption": "Toro tartare"}]}}, {"review": {"des": "Great oyster special with signature oyster dressing.<br><br>OYSTERS: I ordered the bluepoints (with shallot dressing), which were on special. And I ordered a half dozen of the chino oysters from VA (with garlic ponzu). <br><br>The Chino oysters were very good. The garlic ponzu dressing must have made these babies, because I think I'll be dreaming of them for a while. A chewy oyster with a crisp finish. <br><br>The Blue points were bland as an oyster, but the shallot dressing certainly elevated their creaminess.   Weird, because I never find bluepoints to be creamy at all. The dressing was a little vinegar And maybe a little bit too salty. But I enjoy living life on the edge with high blood pressure. So it worked for me. <br><br>I like places that can put their own spin on oyster condiments, so this place moved to the top of my list as an oyster special place. Also the oysters were well shucked, and the oyster yield included the connective tissue, which I love. So yay! <br><br>DRINK: I ordered the Kobayashi Issa, which tasted like a lighter, crisper version of an old fashion. Certainly some citrusy undertones in the drink. And the base flavors very characteristic of Japanese whiskey, full but lacking smoke. The drink had what appeared to be a hand-chipped ice cube. Great for not watering down the drink. <br><br>Certainly a boozy drink. I started to feel it 2/3 of the way through. That, I appreciate.<br><br>SERVICE: They accidentally dropped off a singular oyster in front of me that was for another person. I thought it was a tester, for me to order some of those In addition to the oysters I had ordered. I did enjoy it, so I ordered a half dozen. <br><br>As an apology for delivering the wrong order, they comped me an order of wagyu beef potstickers, which were delicious with a great kick. I like when establishments can admit a fumble and make up for it. That, to me, speaks to a dedication to customer service<br><br>The bartender was absolutely adorable. Very high energy and great timing in terms of knowing when to check in and when not to bother because I'm scrolling through Instagram.<br><br>In CONCLUSION: Great oyster happy hour. Between here, Union sushi, and Tortoise club, I think I found my oyster trinity.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Vs6aWdjsAQNrl1o0iyj-8A/348s.jpg", "caption": "Kobayashi Issa. Citrus undertones. A lighter old fashion"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/HyuXcar0I4e6oknnxgFTuQ/168s.jpg", "caption": "Wagyu beef potstickers"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/fWG-zxQNj-sv86E-kuGlHw/168s.jpg", "caption": "The whole brigade. Sorry I ate one before photograph."}]}}, {"review": {"des": "I've been to Roka Akor more times than I've checked-in but since most of the times I visit with clients, I forget to check-in on Yelp. While most of my experiences should be rated three stras this time around it was a solid four to 4 1/2 star experience.  <br><br>My amazing experience started with our waitress but regrettably I didn't get her name. Besides being attentive, she was very knowledgeable of the menu and was able to direct us accordingly. I delegated the ordering to my business partner so I can't describe all the rolls we ordered.  I do however, remember two dishes in particular that stood-out: wagyu beef rolls and New Zealand salmon sashimi. This was the absolutely the best salmon sashimi that I've ever had--and I've had a lot. <br><br>Our numerous rolls and sashimi left no room for dessert but we're most certainly going to return.", "pics": null}}, {"review": {"des": "I came here for my birthday dinner with my boyfriend on Saturday night. I've been dying to try this place so I'm really glad we went. We started with different cocktails - I got a mule and he got The Usual Suspects. We ordered a variety of dishes - started with edamame, Wagyu Beef and Kimchi Dumplings, and some white fish dish that I don't remember but our waiter had recommended. We then ordered the ribeye & the teryiaki salmon which was honestly one of the best I've ever had. We took our time and definitely could have ordered more dishes but were pretty satisfied after my birthday dessert came (some special Japanese purple dessert) which was fantastic as well. Great meal, great atmosphere & will be back!", "pics": null}}, {"review": {"des": "Excellent omakase experience with some friends. Manager Ben Meyer stopped by the table a few times to check in on us, and recommended a very nice and special bottle of wine for the second half of the meal.", "pics": null}}, {"review": {"des": "Great for family or anniversary meal. Quiet, nice server, the portion seems to perfectly feed everyone", "pics": null}}]}