{"name": "rpm-italian-chicago", "reviews": [{"review": {"des": "Came here for my girlfriend's birthday dinner!  We made reservations last minute for a 9:45pm time slot.  When we walked in we were seated within minutes.  The place was super lively and had a fun vibe!  (It was a Saturday night in April).<br><br>The food was delicious !! I definitely recommend the squid ink pasta and the fried artichokes for an appetizer! I had the lobster pasta for dinner and it was enough for two people to share!  <br><br>Definitely will go back here when I'm back in Chicago and make reservations ahead of time.", "pics": null}}, {"review": {"des": "Food is always delicious. I wanted to call attention to the Lobster Fra Diavolo dish. Sooo good and the presentation is fantastic. <br><br>The chocolate torte was very delicious, except the crust was very tough to cut through! Didn't affect the taste, but I found myself scooping out the cake and avoiding the crust. <br><br>Service was a bit slow delivering drinks and food to the table, which is my only criticism and reason for my 4 star rating. But it certainly won't stop me from returning!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/flDbtYEjqkefHI900DQX6g/168s.jpg", "caption": "Chocolate torta"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/sTPlBfoM_SSvCjp5DjYd6A/168s.jpg", "caption": "Lobster fra diavolo"}]}}, {"review": {"des": "Delicious food, great ambience, great service. Keep in mind the servings are small and designed for sharing, so the price will add up if you're super hungry. Also recommend making a reservation beforehand as it is a popular place. Perfect option to celebrate a date night, anniversary... etc. <br><br>I would also recommend dressing up nice for this - at least, don't come in jeans, because my friend and I definitely felt a bit dressed down in our outfits (we were wearing clothes convenient for travelling) <br><br>We ordered:<br>- Truffled Garlic Bread<br>- Carbonara<br>- Short Rib Bolognese<br>- RPM Cheesecake<br><br>What was especially memorable was the waiter mixing the carbonara for us (perfect for Instagram Boomerang), and the super-tender meat in the bolognese - literally melts in your mouth!", "pics": null}}, {"review": {"des": "I've now been to RPM Steak and Italian. I was much more pleased with Steak. Italian was pretty average... for the price and reputation I expected a lot more. You'll have much better Italian food at quaint Italian restaurants in Lakeview or Lincoln Park and they won't break your bank. <br><br>My sister, boyfriend and I went here last night. See our order and ratings below:<br><br>Fried Olives (10/10): the cheapest and most delicious thing on the menu! I could have ordered 3 more servings. <br><br>Garlic Bread (5/10): our waiter told us this garlic bread was life changing and my life was certainly not changed. Texas Toast was better than this. <br><br>Caesar Salad (6/10): my sister ordered and said it was ok. The croutons are odd and spongy. <br><br>Spincy Squid Ink Pasta (7/10): pretty good dish but the pasta was more rubbery. Not the best seafood pasta we've had. <br><br>Tortelloni with rosemary and cheese (10/10): best dish of the night by far! The pasta sauce was spectacular and the cheese-filled noodles will leave you craving more. <br><br>Eggplant Parm (7/10): it was alright. Not the best I've had. You can find a much better eggplant parm up in Southport at the Argentinian steakhouse. <br><br>Chicken Parm (7/10): my boyfriend is a huge lover of chicken Parm. When I asked how it was he simply responded \"eh, I've had better\". <br><br>That seemed to the theme of the night: \"eh, I've had better\". <br><br>Outside of food, the waitstaff was great, ambiance was nice and relaxing, and cocktails were delicious. Most likely won't be returning but it was worth a shot.", "pics": null}}, {"review": {"des": "Ok so when RPM Italian first opened in 2012 I was like yawn, I don't need a celebrity-backed, mediocre, overpriced pasta place to people watch in River North. The first time I ate there I thought the food was just so-so. I've been back several times since then (because LEYE points) and have recently just been really impressed. The pastas are solid, the red wine is a-flowing, and the service is excellent. It's still expensive but it's River North so I've come to terms with that. At least you can earn those LEYE points.<br><br>My go-tos are always the truffle garlic bread, some sort of salad (either the shredded Brussels sprouts or Tuscan kale & spinach, both delish, and never overdressed), any of the pastas (recommend the bucatini or butternut squash agnolotti). It's also white truffle season right now so GET SOME. I've also tried on the steak side, the RPM Steak Grigliata which is a hangar and recommended cooked medium rare. Now I love me a medium rare but that night it was definitely more on the rare side so be careful. The bone-in ribeye (medium rare of course) is solid and they slice it up for you. We recently also tried the grilled giant prawns. They are for sure giant, pretty much mini lobsters and are worth it. You get two split in two so really four.<br><br>Of the few times I've actually had any room for dessert, I remember loving the lemon cake, it's light and refreshing and delicious, especially when you're full of pasta and red wine.<br><br>Reservations highly recommended. Even on weekdays. I've been on a Monday and #onaTuesday and it's always packed. The Rancics and Melmans are doing pretty good for themselves.<br><br>I'm sorry the only picture I took was of the red wine, but a delicious bottle of Barolo it was.", "pics": null}}, {"review": {"des": "We've been wanting to try this place, and it did not disappoint! Starting out with the focaccia and meatballs was a MUST! So much fresh basil  <br><br>We also went with the Carbonara and Bolognese pasta dishes. Both of which were fantastic! For the Carbonara, they will mix the egg yolk in front of you at your table - which was pretty cool to see! <br><br>The weren't fans of the desserts (we tried the pistachio gelato, cannolis, and a chocolate layered cake) because all of them had candied oranges on top. I don't like candied oranges, so it took away the taste for me. But other than that, it was good! <br><br>Great atmosphere and awesome service as well!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/1JpGRKnLlpEA0HIJfUKnxw/168s.jpg", "caption": "Meatballs"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/EYQ2ro3gwXpB5fPNU43QOA/168s.jpg", "caption": "Focaccia bread"}]}}, {"review": {"des": "The food was pretty good, the ambience was wonderful and the drinks were delicious. We didn't have a reservation but ended up sitting in the bar area with hightops and the service was still exceptional. Our waiter's name was Dre I believe, he was the highlight of our dinner.", "pics": null}}, {"review": {"des": "Came here last night with my boyfriend. The place is beautiful, the lights are dim and it gives a nice romantic setting. We didn't set a reservation in time so we sat at the bar tables which were first come first serve. The server in that area was EXTREMELY helpful in getting us a table and was very attentive. My boyfriend loved his thick noodled spaghetti and meatball. <br>I had the lobster ravioli. The ravioli itself was pretty good. My only dislike was that it was cold when it was served to me. Possibly because it was a busy night? (My boyfriends food was steamy hot though) <br><br>We tried the huckleberry cheesecake and it was delicious. <br><br>So, other than my food being cold, I had a lovely evening with my boyfriend overall at RPM Italian.", "pics": null}}, {"review": {"des": "Came here tonight for a team dinner.  I heard that this restaurant is owned by a celebrity who competed on a reality tv show-- which honestly I couldn't have cared less about.   What I did care about was the food and service. <br><br>-Italian salad.  Loved it.  Super good. <br>-crab bruschetta.  Also very good and pretty original.<br>-filet mignon. Just so so.  It was cooked well but just wasn't as tasty as I might have hoped. A few coworkers who also ordered this had theirs slightly overdone. <br>-pastas. We tried three and all were excellent.  I especially like the beef ragu and ravioli.  <br>-brussels sprouts- very good. My favorite side dish<br>-mashed potatoes- not bad.  Very smooth and creamy. <br>-hazelnut ice cream ball- Liked it. <br>-cheese cake.  Was average. <br><br>Service was friendly but sometimes slow.  We had to wait long periods of time to ask for things like extra silverware.  One server also spilled wine on me while pouring. <br><br>Overall I liked the food especially the pastas.", "pics": null}}, {"review": {"des": "Service/ambiance was excellent and food was well presented and prepared - overall would recommend to try!<br><br>We loved the Lobster Ravioli and Crispy Brussel Sprouts (side dish) the most! Recommend both. Spicy King Crab may be a preference thing if you like a sweeter tangy sauce. I liked it, but my partner did not. <br><br>Black Truffle Beef Tartare was good, but tartare lacked some flavor and its a pretty small portion. RPM Steak Grigliata was cooked well, but we were a fan of the cut of the steak (like a chewier skirt steak?) and we  thought needed some sort of sauce or steak dip because it dried pretty quickly and lacked that juiciness. <br><br>For dessert we got the big chocolate ball which was good but too sweet for us. Loved the comp gelato mini cones as well- super cute!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Pk9KDnvxQrYSoVxygrhzwQ/348s.jpg", "caption": "Complimentary mini gelatos!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/YIct-xpKjEWtFDjncIds1A/168s.jpg", "caption": "Maine Lobster Ravioli"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/5C6pq8YB29yadhXkb0O92Q/168s.jpg", "caption": "Crispy Brussel Sprouts"}]}}, {"review": {"des": "Had a reservation on a Tuesday night at 7:30, didn't get seated until 7:55. Whats the point of making a reservation when you still have to wait 20+ minutes for your table? Very frustrating and we realized that there were a ton of parties still waiting around for awhile.<br><br>Fortunately enough, the food was delicious. My boyfriend and I ordered the lobster caprese (incredible), shredded brussel sprouts salad (wasn't our favorite), the Swordfish, the Short Rib Bolognese and the Chanterelle Risotto. The two pastas and the swordfish were delicious and highly recommend. I think next time it would be more fun to come with a group of people since the portions are smaller and I'd like to be able to try a lot more of the dishes (pizzas, cheese boards, etc.)", "pics": null}}, {"review": {"des": "RPM doesn't need another 5 star review but I'm going to give it one anyways. It's a Chicago staple. Great vibe, cocktails, service and spectacular food that never disappoints no matter what you order. Don't miss the meatballs, the carbonara or the old fashioned. This is a great place for a date night or a girls night!", "pics": null}}, {"review": {"des": "My yelp buddies recommended this place quite highly. Some raved about the food, some loved the atmosphere and others claimed the service was top notch. Yeah.....this place was awesome. <br><br>I hosted a business dinner during the big packaging show and it could not have gone better. My guests loved everything we ordered from the fried olives, big eye tuna bruschetta, roasted octopus, bone in ribeye, risotto with truffles, meatballs, broccolini, eggplant Parmesan and lobster ravioli. Each dish had some uniqueness to it but not so much so that it subtracted from the dish. Just delicious.<br><br>Service was good enough to not disturb our leisurely meal but we never felt forgotten, nor rushed. Great ambiance (except for the edm music), clean restrooms, efficient coat check, wonderful wine list, huge whiskey list and no room for dessert.", "pics": null}}, {"review": {"des": "**Vegetarian Friendly**<br><br>Pleasantly surprised with the number of vegetarian dishes on their menu. My favorite, and the house favorite, is the Mama DePandi's Bucatini. The gnocchi is equally tasty, but the fresh made pasta stole first place in my books. <br><br>The pizzas are fairly tiny, but the entree portions are made appropriately sized for one-person. They have seasonal specials, and the vegetarian selection in these can vary. <br><br>Overall service was slower than I expected, but could have been a busier night that predicted. <br><br>PRO TIP: Make a reservation ahead of time, otherwise easily a one hour wait.", "pics": null}}, {"review": {"des": "LOVED THIS PLACE! See caviot at bottom of review...<br>It gets packed every night.<br>Ambiance - Very chic and upscale inside where everyone is dressed up. <br>Bar service - Great, fast even thought they were packed. <br>Food - I absolutely loved it. <br>Burrata ($17) - Fresh and creamy. <br>I just had a basic pasta, Carbonara ($15) - Spaghetti w black pepper pancetta and egg yolk. So simple, yet so delicious! Once served at the table, the waiter mixes the egg yolk with the hot pasta creating a wonderful creamy dish with the salty crunch from the pancetta. <br>- Lobster Fra Diavolo ($42), was presented beautifully, angel hair pasta with a litte spice from spicy pepperoncini, alla the Diavolo. <br>- Truffled Garlic Bread ($8), was killer! Sliced in half, thick on one side and thin on the other. Just perfect. <br><br>CAVIOT - I must give credit to the management for a mistake that was made. Before I could complain, they noticed the issue (our food was served to another table so we waited a very long time for our food), came over to our table, apologized and took some of the entrees off of the bill. They were all over the mistake. I wasn't expecting this at all and was VERY impressed. The waiter was also awesome. Think his name was Mike? Outside of the fact we save a few bucks, it tells me that the ownership has hired high quality personnel that realy care about customer service which is rare these days. THANK YOU RPM. <br><br>We will most certainly be back to enjoy the grerat food and hospitality. The price point on the food is also terrific.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/XHd-Sn6XWAwPeHmazbjYfw/348s.jpg", "caption": "Truffled Garlic Bread"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/HTbZZ5Wt8W6ORB9o4F5-ww/168s.jpg", "caption": "Truffled Garlic Bread! Killer!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/_PXtOAGvyD5sM3-fC20Upw/168s.jpg", "caption": "Carbonara - Simple yet delicious! One of the best things I ate in Chicago."}]}}, {"review": {"des": "This place was incredible! I was here on a business trip so waited for a seat at the bar with no res (first come first serve). Got the Burrata, octopus, and lobster ravioli (per yelp recommendation). My favorites were the Burrata and octopus, still dreaming about them now!", "pics": null}}, {"review": {"des": "We needed to be in and out, but enjoy a delicious dinner and this place was awesome! We sat in the bar area because we had to go, but the bar was NICE and so was the dining area. <br><br>We ordered the lobster ravioli and the crab pasta (which was spicy!) and both dishes were phenomenal. If you're hungry and you have to pick between the two though, go with the crab pasta. <br><br>Service was great and they always made sure our water glasses were filled. They also knew we had to go and brought our food out promptly and gave us the check immediately when we asked for it. If I had more time, I would definitely make an OpenTable reservation for the sit down area. Great place if you want to impress your s/o, your s/o's parents, your parents, or if you just want to treat yo'self to a solid dinner.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/TRZ1KiIHlMu6Ko5wPBl-CA/348s.jpg", "caption": "Inside bar area"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/6nxXjvDHNfcJDWYPoc2WIA/168s.jpg", "caption": "Spicy king crab with squid ink pasta"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/6wpX9A4ELqAmcNFK9ykgdg/168s.jpg", "caption": "Maine Lobster Ravioli"}]}}, {"review": {"des": "An absolute MUST in Chicago! Whether you're visiting or a local, RPM is one of the most chic and noteworthy spots in town. The food, ambiance, drinks, service... all 5 stars. A trendy restaurant with good ol fashion authentic Italian eats! <br><br>Ps: don't forget the meatballs- to die for!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/01D1MLlwcx102RhG_MBmdQ/348s.jpg", "caption": "Big Eye Tuna Bruschetta"}]}}, {"review": {"des": "First off, Amanda was great, she took such great care of us, we had an early dinner, it was relatively quiet and she had the perfect balance of attentiveness and patience, letting us enjoy our time but making sure we were happy.<br><br>Food was solid, the King Crab Bruschetta was very good.  I had the bolognese, the pasta was great, the gravy was pretty good but lacked a little flavor.  My wife had the roasted pork and it was out of this world.  If you get a side, plan on splitting it.  <br><br>Fun place, nice setting, dining area far enough away from the bar to keep it separate.  When we arrived, we were one of two guests and were seated far apart, but they did then seat a large party right next to my wife and I while the dining room was not crowded, not a problem but did make it feel more crowded when it was very wide open.<br><br>Oh and did I say Amanda was awesome?  She really was!", "pics": null}}, {"review": {"des": "I hate to leave a less than stellar review on such a highly recommended restaurant, but my experience here just did not live up to the expectations I had in mind. RPM Italian was hyped up by several friends who visited Chicago, my Uber driver who picked me up from the airport, and hundreds of Yelpers. After reading through dozens of reviews, we made reservations during our Memorial Day weekend visit. The bar was set high. <br><br>Walking in, the ambiance is chic and trendy. I was a fan of the decor. If you don't have a reservation, there is first come, first serve seating in the bar area. The service was friendly and attentive - no complaints there. We ordered the Wagyu beef carpaccio, grilled octopus, truffled garlic bread and prime beef meatballs to start with. For the main dishes, we shared the carbonara and squid ink pasta with crab. I liked these the most. The server mixed egg into our carbonara at the table which was a nice touch. Nothing was BAD, but nothing impressed us either. Everything we tried tasted okay, just not great. I was especially disappointed in the truffled garlic bread and meatballs since they were raved about so much in reviews, but sadly this wouldn't be the first time that Yelpers have led me astray. We finished our meal and left feeling underwhelmed. <br><br>I don't understand what the hype is. I am wondering if I just came on an off night.", "pics": null}}, {"review": {"des": "I had dinner here last week with my co workers. Overall, the dinner was great! We ordered an amazing bottle of wine per a recommendations from the sommelier. The food is excellent, we ordered a couple appetizers, my lobster ravioli was delish, and the sides of brussels sprouts was a hit with us all! <br><br>They sat us in a very weird spot where two of our chairs kept getting hit by traffic and staff. Not a big deal. Also, the table next to us knocked over and broke a white wine glass while the waitress was refilling the glass. It spilled all over my boss, she was fine and didn't care too much. The waitress profusely apologized and said a manager was coming over. Again my boss was ok but the manager never stopped by. Thought that was a little odd.", "pics": null}}, {"review": {"des": "I have been here four times, and I have been disappointed each time. Don't waste your time, go to Gibson's Italia!<br><br>First I had the milk fed veal, and it was a great piece of meat that was over cooked. I have never came across this issue in the past in other restaurants. <br><br>The second time I had the lobster ravioli, and there was no flavor. <br><br>Third time I had the spaghetti and \"meatball\". I thought to myself this would be a dish that could not be ruined. However the meat ball had an extremely tough texture, with a terrible taste. I was unable to finish the dish. <br><br>The final attempt for finding hope in this restaurant was with the chicken parm. It was actually very good, except wasn't served fresh since the cheese was already somewhat hard.", "pics": null}}, {"review": {"des": "One of the best Italian restaurants in the country.  I was in Chicago last week and ended eating here 3 nights in a row!  I've been to Italy 11 times and am very passionate about Italian food.  This one is truly a rare find.  It rivals Babbo in NYC.<br>Shout out to steak tartare with truffle, big eye tuna, squid ink spaghetti with spicy king crab, absolutely sensational.  <br>Fabulous ambience, good looking people, excellent service.  <br>Dress up, make reservation and go!!!", "pics": null}}, {"review": {"des": "Anyone who doesn't think this is five star dining is nuts. It's wonderful. The food is extremely flavorful and cooked to Perfection. On top of that, the ambiance is beautiful, and the service is top notch. I would recommend RPM Italian to anyone who visits Chicago. We had the ricotta pomodoro, carbonara, risotto, steak grigliata, cannoli, and chocolate hazelnut gelato.", "pics": null}}, {"review": {"des": "Summary: a very good meal with some standouts but with some room for improvement still. <br><br>We went on a Saturday night with a reservation for 2 at prime time.  Upon walking in, the vibe is super minimalist and cool.  We loved it.  However, the first hiccup soon appeared.  Although we had a reservation, we had to wait an additional 15-20min past the reservation time to be seated.  Not a huge deal, but it was a little strange for a restaurant of this caliber.  When we were walking to be seated I also noticed a couple empty tables that could've accommodated a party of our size.  We also didn't really get much of an acknowledgement of the long wait from the hostess or waiter.  I will say though our waiter was SUPER friendly. <br><br>Now onto the food and drink!  We had the stuffed peppers, caesar salad and meatballs to start.  The caesar salad was incredibly tasty, and the meatballs and peppers were decent but nothing memorable.  Next time, I'm going to try the truffle garlic bread.  <br><br>For mains, we ordered the carbonara and swordfish to share.  Both were mindblowingly good, I can't recommend either dish enough.  You can taste the pasta is so fresh and the flavor profile of the swordfish was insane.  A++ for our mains. <br><br>For drinks, we got malbec and the bourbon berry cocktail.  We enjoyed the wine but the cocktail was pretty bad.  The cocktail was spirit forward in a way that didn't blend well with the berries...I'd probably recommend you get an Old Fashioned instead if looking for that type of drink.  We left most of our cocktail unfinished. <br><br>Now for dessert, we got the italian donuts with nutella and cream even though we were full - and ate the entire plate right away.  It was that good.  Order the donuts, you won't regret it. <br><br>All in all, a very good meal with some small areas for improvement!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/I-CNGfe6SkrO3v3zOqU1_A/168s.jpg", "caption": "Carbonara, swordfish, and meatballs!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/tiveS7SqAIBKJB7P9kaX8Q/168s.jpg", "caption": "The donuts! Get them!"}]}}, {"review": {"des": "Came here in early August for a private corporate event...I was invited to attend. Service & the Staff were impeccable, Hydration was top shelf, Appetizers were delicious and a plenty. Attention to detail was evident with all the courses provided.  Cannot go wrong with RPM Italian.  View my photo's...pictures can express more words than I ever can. Must be a stop over for any foodie out there.  Mangia & Cheers!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/qwyhrMIgCJqbG5AH0rFh_Q/348s.jpg", "caption": "Lamb...You cannot go wrong with Lamb!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/_0LsX_W0d2Aa0HI7J5jZkQ/168s.jpg", "caption": "Petite Filet...Medium Rare."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/LwSTME_DSJ-KepiaEfAKpQ/168s.jpg", "caption": "New York Strip...Medium Rare."}]}}, {"review": {"des": "Food tasted great but our waitress really emphasized how small the portions were and when we got them they weren't all that small and we had a ton of food. Felt mislead into ordering more than we needed too simply to run up the bill. You could tell she was just trying to upsell the whole time, not too focused on our actual experience. Very disappointing and would not return. <br>On top of that I ordered their chocolate cake for dessert and they brought me a slice of carrot cake, which wasn't even on the menu. I found this extremely odd but was so unsatisfied with my visit that we left the cake and left the restaurant.", "pics": null}}, {"review": {"des": "This place was recommended by a coworker of mine whose from Chicago. Had expectations since when I tried to make a reservation a month in advance for this Sat night, the earliest availability was 9pm. <br><br>Came early waited for table - sat in waiting area and its chaotic and loud the moment you enter. But its a social restaurant so its understandable. <br><br>Why I did not have a great time:<br><br>1) even though I made reservation a month in advance, the table we were sat at was RIGHT DIAGONAL from the stairs. If there had been an emergency and people had to evacuate, we would have been in everyone's way and probably would have been trampled. It was not right in front of the stairs but still the seating area made me feel uncomfortable and unsafe since we are partially blocking the stairs. <br><br>2) the Host - gentleman I do not know the name of - in glasses poured water all over our table the moment we were sat - and on my dress. Thank goodness it was just water but still not a good impression. Didn't come back with a towel to wipe my wet dress off - had to ask for it - gives me their towels I don't know what they wipe that with - seemed like towels they used for wiping table off - I just wanted some paper towels. Just RIDICULOUS. <br><br>3) the manager came and gave me her business card to call if I need to pay for dry cleaning but unfortunately I am from LA and was flying out the next day so.... I am not sure how that arrangement would have worked. Wish she could have seemed to care a bit more for upsetting their first time customer who came all the way from LA and made an effort by reserving a table a month in advance in hopes that we receive at least a decent level of service. <br><br>The food wasn't that great. And we actually ordered like five dishes - including two kinds of pasta. I felt the pasta was a bit uncooked and it just wasn't to my like. Probably because I was upset too but still. LA has so many more restaurants that has phenomenal service with much better food. Osteria Mama, Osteria Mozza, Bestia, you name it. The price is decent - its like going to Cheesecake Factory but Cheesecake factory sucks and I would rather pay a bit more for better service/food is there was an option. <br><br>Overall, I felt that we weren't really taken care of and our server was so busy that he didn't have much time to even really provide service - he was asking if we were all good as he was walking away. Obviously in a hurry to serve all the other people. <br><br>The food did not meet my expectations. And the service FOR SURE did NOT meet my expectations. Will not return and will not recommend. Overrated.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/m_iCGQuGQdHqXYw9sFIShg/348s.jpg", "caption": "Black Truffle Beef Tartare"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Bcna5W5rmLw7Paq6sH-DPw/168s.jpg", "caption": "Wagyu Beef Carpaccio"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/5s_kjfHQ_5jz5771dB-7HA/168s.jpg", "caption": "Spicy King Crab"}]}}, {"review": {"des": "Mouthwatering, delicious, savory, appetizing, heavenly...just a few words to describe my experience. <br><br>I tried the Ricotta toast, Fritto Misto, King Crab, and Scallops. Everything I ate and the wine I drank is described above. BUT what made me want to move to Chicago (I'm from Sacramento) was the tantalizing scallops! I've never had anything like these scallops. I always order them at various restaurants in hopes I find the perfect scallops, and I finally found them at RPM Italian.<br><br>Oh! And I have to give a shoutout to Andre T, as this perfect dinner experience would have not been 100% if it wasn't for the amazing service provided by him. Thank you for the amazing experience.", "pics": null}}, {"review": {"des": "This certainly seems like the hot place to be in Chicago on a Saturday night.  The place was jam packed! Took us nearly two hours to get a table by the bar (manager was doing his best to accommodate us). Great menu filled with Italian classics like chicken parm, lobster ravioli,  and carbonara- all taken to a higher level.  I had the short rib bolgnese over fresh pappardelle. It was very good, not a huge portion which is refreshing. I would likely try something else should I come back.  The cocktails were delicious and the bartending staff are clearly experts at their craft. Would certainly recommend this place if you are looking for elegant Italian food with a trendy crowd.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/3fE1cz3lBZSEOIVvWQSJzg/348s.jpg", "caption": "Dinner after a long work day."}]}}, {"review": {"des": "Best Italian food I have ever had. Absolutely fantastic. Service was wonderful, everything was gorgeous and clean. I will absolutely be back and will bring anyone I can!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Vo6CrIAIiI-1QDl8EDDEGQ/168s.jpg", "caption": "Fried olives"}]}}, {"review": {"des": "OMG! I honestly didn't think my meal was going to be good based on what others said on this place compared to RPM Steak. My friends and I sat in the bar area as they offer high table seating which is just as comfortable. <br><br>Atmosphere was extremely loud Saturday night. They have two bars so crowding for drinks is impossible. This place is great for getting together with friends not so much a date because of the noise level but if you and your date enjoy lively dates this and STK is the place to be. <br><br>Overall I had the King Crab $16 without the chili sauce ... AMAZING! I would recommend that and the wine I had the chance to taste believe it was Pinot Noir $14. <br><br>FYI - Military/Police/Fireman discount is 50% OFF!!!!! Bill for 3 was $100 came out to $50 and we had appetizers. Please go try it out!", "pics": null}}, {"review": {"des": "Contrary to popular belief, RPM isn't as expensive as people make it out to be. To do RPM on a budget, head there for happy hour between 4-6pm and sit at the bar. If you're lucky, Kelly will be your bartender, and she'll take great care of you. Happy hour specials are $8 select cocktails, $7 select glasses of wine, and $5 select appetizers.<br><br>For two people, we ordered one Spritz & Giggles, three glasses of Barbara d'Alba, provolone stuffed peppers, and prosciutto involtini from the happy hour menu. For entrees we ordered the short rib bolognese and the Maine lobster ravioli, priced at $17 and $18 respectively. <br><br>The apps were good but were on the lighter side. Entree portions were realistic sizes that filled our bellies without making us feel stuffed, unlike several other Italian restaurants I've been to in the city. The Spritz & Giggles was delicious, and I recommend it to people of all genders as a refreshing summer cocktail. As for the red wine, it was a bit astringent. <br><br>All in all we left with an $80 bill for two people. Still on the pricier side, I know. Could we have done without four drinks and two apps? Probably. Would we have wanted to? Probably not.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Ukawh23c4rCcVYSWs7J6PQ/348s.jpg", "caption": "Short rib bolognese"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/sEmSmlvG562lkD5G7-L5sQ/168s.jpg", "caption": "Maine lobster ravioli"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/xBx_YK1sHg7N75hXf4PO0w/168s.jpg", "caption": "Spritz & Giggles"}]}}, {"review": {"des": "RPM is a fun place to try out for a date night but be sure to put in a reservation. Most of my stars are for the Bellini (PHENOMENAL!) and the dessert, which was absolutely amazing. I highly recommend their gelato as a nice light dessert after heavier Italian fare. I visited the restaurant with my boyfriend and had a pleasant experience. The only awkward menu item was the fritto misto because it was shrimp and calamari in tempura. Tempura just doesn't seem to jive well for me at an Italian restaurant. I would much rather have had those items grilled to fit the theme of the restaurant a little better. My eggplant was delectable and the sauce was not incredibly acidic as sauces at other restaurants often tend to be. <br><br>My boyfriend enjoyed his spaghetti and meatball dinner, although the dessert he received afterwards was pretty disproportionate to his entree. He received a strawberry cheesecake, which is a heavier dessert. You would think that you would get a smaller portion of this, but that was not the case. Despite the fact that the server insisted that desserts aren't very shareable, I disagree--gelato is great if you want to have something different, but I'd recommend splitting anything else. <br><br>As a heads up, the valet is $15 here which is reasonable for the area and less stressful than finding parking elsewhere.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/DLIZwHZ6eXuXFjwSc8NDTA/348s.jpg", "caption": "RPM Cheesecake and pistachio gelato"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/h91pP9GpGwNW8jpaLjOSfw/168s.jpg", "caption": "Pistachio gelato"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/BI_KbRy3Wk-oGlQiuQUEmQ/168s.jpg", "caption": "Spaghetti and Meatball"}]}}, {"review": {"des": "Ordered the 140 something dollar porterhouse. Menu stated it feeds 2-4 people. Well maybe if your the size of a twig. Came with 5 other people and everyone almost everyone left wanting more food. The taste of the food was good but it does not impress me. I'd much rather spend 50 dollars at wildfire on their porterhouse and leave feeling full and satisfied. To each their own but this cup of soup is just not for me. Won't be coming back here anytime soon. Cheers<br><br>Edit after complaining about the portion sizes they brought out table out 6 Barbie size ice cream cones.  <br><br>2.25 stars for effort.", "pics": null}}, {"review": {"des": "To be honest, I don't get the hype. I made a reservation several weeks in advance because I heard how difficult it is to get a good time slot. <br><br>Let me break it down:<br><br>Service: 2/5 waitress was nice but wow did it take forever to take our order, get our food, get the check, then get the check back. <br><br>Food: 3.5/5 for the prices I expect a lot more. The chicken parm was dry. The lobster ravioli was pretty good but nothing to call home to mom about. The red sauce they use for the pasta is pretty flavorful. <br><br>Ambience: 3/5 the bar area looked really nice and welcoming but I found the dining room area so odd. Felt sterile and cramped.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/yUUkV7IhRE7rfWCuyedhrA/168s.jpg", "caption": "Maine Lobster Ravioli"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/s4qAxBMO4_GslxDWkhBxfg/168s.jpg", "caption": "Chicken Chicken Parmesan"}]}}, {"review": {"des": "I'm always a little skeptical of restaurants owned by celebrities but this place was actually really good!<br>Truffle garlic bread: hands down the best garlic bread I've ever had!<br>Giuliana's Italian salad: was okay--it's sorta a italian sub without the bread<br>Tuscan kale & spinach salad: this was good<br>Crispy Brussels sprouts: decent <br>Caramelized cauliflower: my least favorite <br>RPM steak: best choice ever! I was debating on the steak of gnocchi and I'm glad I went with the steak.<br><br>For dessert the three of us shared: Bill's chocolate budino, brioche donuts and pistachio gelato.", "pics": null}}, {"review": {"des": "RPM Italian presents ambitious cuisine that is modern in approach, Italian in spirit and  dished up plates that are meant to be shared. The chic dining room has a real glamour to it...it's sophisticated & stylish and radiates a certain star quality. The polished, bustling staff, adorned in stark white blazers, are seasoned and well trained. An alluring, open bar area is where guests can delight in a signature, hand crafted cocktail or swirl & sip a glass of vino from their impressive Wine list. This chef-driven kitchen features a variety of cold and hot antipasti, more than a dozen artisan prepared in-house pastas, fresh cicchetti, prime steaks, hand cut chops and slow-roasted meats. We indulged in Aged 600 day Prosciutto, Mama DePandi's Bucatini Pomodoro, vibrant Squid Ink Spaghetti with Spicy King Crab and the seasonal favorite Tagliolini with Vacche Rosse Parmigiano & White Truffles from Alba. For a sweet finish, opt for any of the elevated, classic desserts from the supremely light cannoli to the gooey pine-nut cake to the tartufo, a giant ball of hazelnut ice cream coated in chocolate-hazelnut crunch. To end our evening on an even sweeter note, we ran into Chicago's very own, co-owner of RPM, Bill Rancic. MANGIA.", "pics": null}}, {"review": {"des": "Our service was great and the food was even better!!! <br><br>I shared the lobster caprese and mushroom pizza, and had the spicy king crab pasta for dinner! Everything was sooooo delicious. The portions are on the smaller side but that just gave me a reason to order more! ‍<br><br>I had the Tiramisu gelato for dessert and it was a 10/10!", "pics": null}}, {"review": {"des": "I Doordashed this, so I can't speak to the ambiance of the restaurant. Ordered the spicy king crab squid ink pasta and the prosciutto. Delicious. The pasta was perfectly cooked and the spice level was just a light spiciness-enough where I can feel the spice but it's not overpowering the flavor of the crab. The prosciutto is a decent amount with a nice saltiness. If I'm every in Chicago again, I'd come back.", "pics": null}}, {"review": {"des": "Atmosphere: romantic and fun <br><br>Service: we had a reservation and were seated promptly, and our waitress was attentive, friendly, and very likeable. She offered to have our chicken parm sliced to make it easier to share, and even brought out a small birthday dessert since we told her we were celebrating my husband's birthday early. <br><br>Food: FANTASTIC! My husband and I started with the shredded Brussels sprout salad, shared the chicken Parmesan, and shared the gnocchi and short rib Bolognese. The Brussels sprouts salad was simple and tasty, the chicken Parmesan was tasty and prepared well, the gnocchi was pretty good too, but the short rib bolognese was the winner! I'm still dreaming of it! <br><br>All in all I highly recommend going to RPM italian!", "pics": null}}, {"review": {"des": "What a great way to end our Restaurant Week for 2018.  I had bookmarked this place based on the review of the meatballs by Shelby E. and decided to make this one of the places to hit this year.  I am so glad we did.<br><br>First of all, the decor is lovely, very elegant and chic.  Love the overhead lighting with the Edison light bulbs.  We were seated at a booth, which turned out to be a very good thing based on what we ordered (we needed the room).<br><br>Our server, Wilson, was very professional and personable.  I have to say that he as well as the other gentlemen and ladies looked very sharp in their white jackets.  Even the bus boys looked great in all black and have to give a shout out to them as they were just as professional and nice as the wait staff.   I am guessing the overall staffing is a well oiled and run machine as they all had ear pieces in place for communication.  Interesting story about Wilson's name.  He is from Guatemala and said that during the time he was born, it was popular to name your kids using American last names :-) <br><br>On to dinner.  This was our first time at RPM and since it was Restaurant Week, of course we wanted to see that menu.  However, the main menu had a few items that looked tempting.  Dr. M and I ended up doing both menus:  I did the Restaurant Week menu and we both got items off the main menu.<br><br>First course was Rosemary Focaccia with Lardo, the 600-Day Prosciutto and the charred Pepperoni Pizza.  First of all, kudos to the chef on the bold choice of using lard (you heard me right) instead of butter with the focaccia in this day and age of cutting carbs and fat.  It was seasoned with rosemary and just melted on the bread.  Very lovely and took me bad to the days living in the South watching my grams make great biscuits and pie crusts with lard.<br><br>The 600-Day Prosciutto was so tender it almost melted in my mouth,  Great pairing with the bread.  It came with three lovely red peppers stuffed with  provolone cheese.  Slightly spicy in olive oil and a very nice pairing with the meat.  The charred Pepperoni Pizza had a nice crust.  I like to check the underside to see the coloring of the crust; it had a nice even brown color, which for me is the sign of a great oven with nice heat distribution.  Dr. M got the pizza, and while not a fan of pepperoni, the pizza was pretty good.  Loved the sauce and I could see myself ordering that as an appetizer.<br><br>Second course were the Prime Beef Meatballs for me and Italian Salad for Dr. M.  Those meatballs were soft and delicious, with lots of red sauce for dipping the bread into it.  I could see getting those as a side to a pasta dish that doesn't come with meatballs.  Had a taste of Dr. M's salad and it was very flavorful, with the veggies having a very fresh flavor to them.<br><br>Third course was Veal Parmesan for me and Spaghetti and Meatball for Dr. M.  That veal was nice and crispy on the outside, but oh so tender on the inside.  It came with a side of spaghetti....didn't even put salt on it as it was perfect.  In case you are wondering if I forgot to add the s on Dr. M's Spaghetti and Meatball, I did not.  It was one meatball, but it was the size of a cat's head, no lie.  Just a big delicious meatball in the middle of great pasta.<br><br>Fourth course consisted of made to order Pistachio gelato with wild strawberries and Bomboloni (Italian Brioche Donuts covered in sugar and served with Nutella).  The gelato was very good, but I gave that to Dr. M so I could focus on the donuts.  Not sure why this are called donuts as they reminded me of the Beignets from Nawleans.  They were fluffy pillows of sugary dough goodness and went very well with the coffee (excellent by the way).  Next visit the donuts would win over the gelato, not because it wasn't good, but I am not really a dessert person and if I am going to get something, it would be those donuts as a can take it or leave it when it comes to ice cream/gelato dessert person.   Rest assured, Dr. M finished off the gelato.<br><br>Ended up taking home goodies.  Don't be fooled by the bread...between that, the pizza and the proscuitto, I was full.  No worries, I am going to extend my RPM dining experience with take out of sorts :-)  This place will definitely be on our radar for dining out.", "pics": null}}, {"review": {"des": "Very tasty. Some colleagues and I came here tonight because it was recommended and near our hotel. <br><br>The one negative: no free bread. Ranges from $5-10 I believe. Also, be prepared to sit in the bar area unless you have a reservation... on a Monday night they quoted us a 2.5-3 hour wait time. We sat at a bar hightop though and it was fine.<br><br>I got the Brussels sprouts ($10, drizzled with cheese and balsamic, and delicious) as well as a pasta dish with beef, pork, and almost gnocchi-thickness noodles ($15). The pastas are only 4 ounces each but between that and the sprouts I couldn't finish my food (too much). My dining companions got the carbonara, which they mixed AT the table, and the eggplant Parmesan and an Italian salad, and everyone enjoyed their meals.<br><br>I'd definitely come here again but would probably have to be on a work expense account (like I was tonight) to go. Pastas range from $15-20 and they also have a few larger pastas plus steak and seafood.", "pics": null}}, {"review": {"des": "Came in last night with my mom and boyfriend for the first time. For appetizers, we shared the caesar wedge, meatballs, and crispy artichokes. Entrees: Mama Depandi's Pomodoro, Lobser ravioli, Rpm steak grigliata, garlic mashed potatoes, and roasted Brussels sprouts. For dessert we shared the mini ice cream cones and donuts. <br><br>Let me tell you, this was one of the best meals we've ever had. Everything was amazing and I'm definitely coming back for the artichokes and mama depandi's pasta. <br>Jaclyn waited on us and she was wonderful!! When I do come back, I'll definitely ask to be seated with her. Can't wait to come back", "pics": null}}, {"review": {"des": "I went to RPM Italian for the first time today (Sunday at 12:30PM) to celebrate my birthday. They greeted us, wished me a happy birthday, and asked if we had visited before. This set the tone for the meal!<br><br>The Atmosphere: is chic - a lot of black and white and well lit (perfect for food pictures!). You can definitely bring larger groups here, but you will need a reservation.<br><br>The Service: our server was Ryan S and I found him to be nothing but professional. He was very helpful in explaining the menu (since it was our first time), and let us know ahead of time that he would bring our order out in 2 courses. We were debating as to whether to order more food or not in the beginning, as they advise you to share. With that information, Ryan told us that if at any point we wanted to add anything to please let him know. <br><br>Between courses, they changed out our plates and I noticed that they meticulously wiped any spots of food that had been left on the table. I appreciated the time and care that they took in ensuring that we had a good experience. It's the little things like that that set restaurants above the rest.<br><br>The Food: I LOVED the Prime Beef Meatballs ($12)! They melted in your mouth and there was plenty of red sauce for me to spoon over the top of them. They were seasoned perfectly and I appreciated the fresh herbs on top. <br><br>We paired the meatballs with the Truffled Garlic Bread ($8). I liked how crispy the bread was and the truffle added an extra layer to the dish. I ate both the meatball and the bread together - using the bread to wipe up the leftover meatball sauce. The combination of flavors and textures was delicious! I was more full than I had anticipated after the first two dishes.<br><br>Our second round was the lobster ravioli and the Spicy King Crab pasta. The Lobster Ravioli ($18) was a smaller dish (6 raviolis) but packed a punch. The pasta was al dente, the lobster was fresh, and the sauce was buttery and had a great flavor to it. We inhaled this!<br><br>The Spicy King Crab pasta ($17) had delicious, fresh pieces of crab in the dish. I loved the flavor of the pasta! My boyfriend wasn't as fond of the texture, as he said it stuck to his teeth. It was a fun dish to try since I've never had squid ink pasta.<br><br>At the end, they brought out two mini gelato ice creams with a candle and a happy birthday sign. The mini gelato cones were so cute!! <br><br>As a first time customer I was blown away by both the service and the food. I will be back :)", "pics": null}}, {"review": {"des": "Simply amazing.  Dishes are small, expensive, and to be shared.  Everything we had was amazing.  Italian salad, meatballs, 600-day prosciutto, steak tartare, pasta carbonara.  Every dish was perfect.  Each pasta was made daily from scratch.  Service was exceptional and fast (especially for a party of 21 at 3 tables).", "pics": null}}, {"review": {"des": "It has been a year since we last visited RPM Italian. A very challenging popular restaurant to get reservations, so, we were fortunate to get in for an earlier dinner. We were also fortunate to be able to find a seat at the bar. A very nice vibe and our server was excellent. Great wine selection of Italian and Calif and the Somalia ( Cory) helped us with a very nice selection. Did I mention the food.? Special appetizer was awesome, buccatini to die for and those meatballs are excellent. All in all , if you are looking for a cool vibe Italian restaurant with fantastic food and service , then you must go to RPM Italian. I know we will not wait a year to again visit..........", "pics": null}}, {"review": {"des": "Great food.  Nice set up.  Friendly staff.  Interesting menu.<br><br>As expected from a higher end Lettuce Entertain you restaurant.<br><br>Would definitely go back.  I really enjoyed the beef carpaccio and the crab bruschetta.  Both pastas we got were great.  The scallops were tasty but didn't standout the way several other dishes did.<br><br>Would be nice to see a few more by the glass wine options.  Same goes for after dinner drinks.  <br><br>All and all a great meal.  Decent value for the experience.  We will be back.", "pics": null}}, {"review": {"des": "The food comes out quick and service is super attentive. I came here for dinner and ordered:<br><br>- 600 day old prosciutto ($15): I'm such a prosciutto fan, this was delicious<br>- truffled garlic bread ($8): I'm not typically a garlic bread person, but was blown away by this one. Savory and sweet - the best garlic bread I've ever had<br>- main lobster ravioli ($18): a few pieces, not enough for an entree<br><br>The prices were fair, but the ravioli portion size was a little too small, but the prosciutto and garlic bread portion sizes were good / fair.", "pics": null}}, {"review": {"des": "What can I say- a wonderful place! Love the ambience, food, witty waiters and feeling of Italy. <br>I had visited the restaurant a couple times and every time I was satisfied with everything. Also, you always can meet nice and sophisticated crowd here. <br>The pasta and salads are delicious! And always try to take a dessert- the best! <br>This time, I had ravioli and chop salads and Panna cotta. <br>If you are in town, have this place on the list to try!", "pics": null}}, {"review": {"des": "I can't believe I've never reviewed RPM in all the times I've been here! This place is happening at all hours and all days of the week--so I would definitely suggest making reservations. For solo diners, the bar is first come first serve, and full menu is available.<br><br>Everything here is excellent. The cocktails are delicious. During the last visit, I had the spritz and giggles (I forget what it consists of but it is a sparkling cocktail). Food-wise, I could eat anything off the menu. We usually start off with a burrata while deciding on dinner. I especially love the squid ink pasta and the roasted pork, and these are my standbys if I can't find anything else I would like to try. The pasta carbonara was excellent as well, and it's quite a show as the server finishes it off table side (should have taken a video). The roasted chicken was delectable. Portions are decent but I would recommend a salad or pasta as an appetizer (or any other appetizer) and a main entree. Save room for dessert!<br><br>Overall RPM always delivers a nice experience!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Aj05l8EKNsJfM9oxknMw5Q/348s.jpg", "caption": "Pasta Carbonara"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/o-znO_X-TNwv2PJIcA6kkg/168s.jpg", "caption": "Crispy Roasted Chicken"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/l0bRAUFt4PozOuujZ_dCgg/168s.jpg", "caption": "Spritz & Giggles"}]}}, {"review": {"des": "The restaurant on a weekend night is PACKED. We didn't make a reservation because we didn't realize how busy it would be. The bar area is first come first serve but there were so many people waiting we decided to eat somewhere else but came back for desert and drinks later that evening when it had died down. We had the pudding and a couple drinks and it was well worth the price. This place has a fantastic atmosphere and we cannot wait to come back when we are back in Chicago.", "pics": null}}, {"review": {"des": "Where do I begin? This place is incredibly classy. I meet up with a buddy who was in town for the day. The bartender whipped an excellent mixed drink for myself while my buddy had a beer.<br><br>The food was Phenomenal! You have try the meatballs and the prawns! The staff is incredibly friendly and knowledgeable. Leave room for dessert!", "pics": null}}, {"review": {"des": "The food is delicious! Definitely a little pricier than your average Italian restaurant, but the food is worth it. The meatballs are great and so are the steaks and chicken. <br><br>The seasonal drinks are good!", "pics": null}}, {"review": {"des": "PHENOMENAL Italian cuisine!!!!!  EVERYTHING that was on our menu was delicious from the appetizers to the entrees, SPECTACULAR!!!!!!  I recommend EVERYTHING no lie...", "pics": null}}, {"review": {"des": "Absolutely amazing!! A must-try for anyone that's visiting Chicago! <br><br>What's great about RPM is that it's a nice restaurant but also has very affordable options. I got the Mama DePandi's Bucatini which has a simple tomato sauce. OMG. Best. Pasta. Ever. The pasta is homemade, dense, and perfectly al dente. I've never had pasta as good as theirs. The sauce is simple but really yummy! The portion is good enough for one person, possible 1.5 people but trust me, it's so good you're not gonna wanna share!<br><br>My friends got:<br>-Ravioli with poached egg - I can't remember the exact name but it came with one big piece of ravioli with vegetables and an egg on top - tried this and it was very good! Friends loved it<br>-Potato Gnocchi with pesto - Friend liked this as well<br>-Mushroom pizzette - good but nothing to write home about<br><br>Of course, for dessert, you have to get the giant forrero rocher! :) We had a friends birthday that day and they brought out mini ice cream cones - one for each person at the table which was nice. <br><br>Overall, RPM is an absolute must - Chicago native or not! It's been about 6 months since my trip to Chicago and I STILL crave that pasta!", "pics": null}}, {"review": {"des": "I planned a weekend get away with my husband, and RPM Italian was highly recommended to me by a friend. We made reservations for a Thursday night, and this restaurant was popping! Very busy! But after trying the place, I understand why. The service is great - our waitress was very attentive to us. The ambience is chic and trendy; intimate with dim lighting. The appetitzers (RPM salad and truffles garlic bread) and dessert (pistachio gelato) we ordered were amazing!! The pastas we ordered were alright - I ordered the Carbonara and my husband had the bolognese: my pasta tasted like it still needed cooking. Otherwise, I would still recommend this gem to anyone and I'm very happy we tried it!", "pics": null}}, {"review": {"des": "The handmade cavatili is unexpected great. Main lobster is ok. And \"black noodles\" is taste seafood. The cabbages is is is ok. It absolutely is not famous for seafood.<br><br>The service is all right. But waiting and hunting for bar seats is quite weird", "pics": null}}, {"review": {"des": "That place was good.<br>The RPM signature ice cubs -it's something what took all my attention)))<br>Food was good,but not crazy good,if you know what I'm talking about. Well staff wasn't to friendly...I came all by myself and they just told me to choose any place at the bar...:/ But everything else was ok,I'll come back anyway)", "pics": null}}, {"review": {"des": "I have such mixed feelings about RPM Italian after 3 visits. While I think the food here is delicious, the portions are wayyyyy too small for me to justify RPM being my go-to Italian restaurant in Chicago! All of my friends agree with me too. Next time we come, we may split one of the steak options so we aren't hungry a few hours later.<br><br>I've ordered the Spicy King Crab Pasta every time I come because it's such a unique blend of flavors! Squid ink spaghetti with a decent potion of king crab sauteed in Thai chilis. It's such a delicious flavor combination, but I can easily kill the entree in under 5 minutes sadly. <br><br>With the waiter's recommendation, I ordered the Crispy Brussels Sprouts, which were delicious! Maple balsamic glazed brussels with some Parmesan yum. However, not all of the pieces were crispy and actually kinda soggy. This wasn't a very large portion either for $10.<br><br>After finishing my pasta and the brussels, I was still hungry....Sad because my bill was about $35 after tax and tip. Maybe RPM intentionally gives us the appropriate serving size for pasta which I should be eating LOL.....<br><br>I've always been able to make reservations here a couple days in advance which is nice! Taste is a solid 4 stars here, but those portions are disappointing. But service here has always been outstanding and fast, so I'll give RPM 4 stars.", "pics": null}}, {"review": {"des": "Went to celebrate and birthday and a promotion, couldn't have been more blown away. Beautiful space, amazing food, delicious cocktails, and satisfying desserts. I'd go back just for the desserts. You have to get the Italian donut with Nutella omg.", "pics": null}}, {"review": {"des": "There are so many better dining options,  skip this one. Your time means nothing to them, even if you make a reservation a month in advance. We were directed to the bar where the bartender didn't utter one word to us. No kidding. We ordered 4 drinks and the whole interaction he was mute and acted as if we were interrupting him (by his body language since he didn't even say hello).<br><br>We were seated 30 minutes late (this is obviously a trend with Rpm so the hostesses need training) and then we were directed to a cramped table when 2 booths were open.  When I asked if we could sit at the booth,  instead of simply saying \"yes,  of course\" they made us wait while she \"checked\".... bad customer service. <br><br>The food was just okay. I really don't get the hype. We skipped lunch to indulge in the pasta and it was fine but nothing special. I had high hopes, but unfortunately rpm did not deliver.", "pics": null}}, {"review": {"des": "Awesome Italian date night! We had to make reservations a few weeks in advance, but it was so worth it! We sat at a comfy big circular booth table, and we started with some cocktails. I got the spritz and giggles, and he got the Vespa. The spritz and giggles was really good and not too sweet, which was refreshing. The Vespa was strong for me, but I'm not a huge gin person :) we started with the grilled octopus and OMG YOU HAVE TO GET IT. I have never been a huge fan but this was one of the best things I've eaten ever. We also had the truffle garlic bread (delicious). I had the potato gnocchi and it was like a play on cacio e pepe. He had the pork and beef ragu and it was delicious. The actual pasta was so good. We had both the budino and the donuts. I would skip the budino and order double donuts. It was tasty, but those donuts might be my favorite also of all time. They're piping hot and literally melt in your mouth. We will definitely be back!!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/_ZFNFEcSrvq47tYU2IYUtA/348s.jpg", "caption": "Bomboloni"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/yzfmNYJRmB_oTtNKgPsmlg/168s.jpg", "caption": "Potato Gnocchi"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/97GvrUhzIxyIJHzuZcaVxg/168s.jpg", "caption": "Bill 's Chocolate Budino"}]}}, {"review": {"des": "Oh my goodness. This place is the real deal...I am a snob when it comes to Italian food and RPM is better than any Italian restaurant I've been to in NYC or Boston's north end.<br><br>The bucatini pomodoro is unreal...sauce is more like an arrabbiata and has a bit of a kick...one of the best sauces I've had...so g that rivals RAOs.<br><br>Bolognese was also phenomenal. Service was top notch. This should be a stop on your list if you're craving delicious Italian.<br><br>UPDATING MY REVIEW; I last came here when I was apartment hunting while still living in Boston. I moved in to my place in Chicago today and after a really long day of unpacking and building furniture we stopped in for dinner...and ran into Giuliana Rancic as she popped in to check on her restaurant. She was so incredibly nice, despite the fact that I looked  super disheveled after hours of moving furniture. I also just came back from a trip to Rome and the bucatini at RPM rivals anything I had in Italy!!", "pics": null}}, {"review": {"des": "Our first visit here and it was exquisite! Delisioso and perfectly plated. Great ambiance and the most delicious dessert. Now on our regular list of places to eat! Bellissimo!", "pics": null}}, {"review": {"des": "We were lucky enough to get a late reservation on a Saturday for this awesome Italian place! The ambiance is dim lighting with very comfy booths and tables. The service is 100% top notch, the sever did not leave my glass half empty - it was almost always full! I got the Caesar wedge salad (amazing with a unique design), fried artichoke (amazing..tasted like chips) and the mushroom pasta (amazing, as well)! I overheard people complain the potions were small BUT they were just right for my friends and I! Great place, great people and great experience! I'll be back with more people soon!", "pics": null}}, {"review": {"des": "Not my kind of a spot from a scene perspective. However, the food overall was very solid, especially the pastas. The steak was a bit over cooked on the outside, but nice in the inside.  I'd come back with a bigger group on someone else's dime.", "pics": null}}, {"review": {"des": "The service here was unbelievably amazing. I was warned ahead of time that they chronically run 15 minutes late and so I made our reservation for 15 minutes earlier than I wanted to eat and this in fact was true- they sat us 15 minutes later than the reservation time! I was greeted, however, instantly by someone offering to check my coat, which was a very nice touch. Once seated, the service was fast and great and the waitress provided tons of suggestions and gave us our time to look at the menu. <br><br>Given the hype I heard about this place being the most amazing Italian food ever, I was a little disappointed. Although the food was good, it was just average Italian food and there wasn't much uniqueness to it, which I was expecting. <br><br>The warm bread is an absolute MUST to start off with. We had the fresh homemade ricotta which was so flavorful and they brought us plenty of extra bread so we could keep eating the ricotta. <br><br>The Roman-Style Artichoke with garlic and lemon aioli is one of the most unique ways I have had artichoke ever. I don't usually enjoy artichoke that much due to flavor and texture, but this is also a must have dish when you come here! <br><br>The pasta's were all fairly basic. There was no big uniqueness to them and I felt like they were pasta's I could make at home and enjoy just as much. <br><br>The dessert was PHENOMENAL. If you like ferrero roche then you must get the hazelnut tartufo. It tastes exactly like a ferrero roche and looks like one too. A little cold on your teeth, but completely worth it. <br><br>I would definitely come back here if someone wanted to come and I think I would try more of the non-pasta dishes as I absolutely loved those!", "pics": null}}, {"review": {"des": "Had a great experience at RPM. I went on a weeknight with my boyfriend for our anniversary and it was awesome. Everything was delicious. We had the carbonara, 600 day prosciutto, the risotto special of the day, the pizza, and for dessert.... the DONUTS and... THE RICE PUDDING. <br><br>But, aside from how great the food was, our server deserves his own recognition. For an upscale place, you sometimes get snotty upscale service, but this was refreshingly the opposite. Bob was on POINT. Hands down best server in the game. His beard is on point just as much as his service. Keep doin you, Bob. If you have the option, request to be seated in his section. He murders the game.", "pics": null}}, {"review": {"des": "Carbs in a romantic setting are always a good thing! We started off with the Wagyu Beef Carpaccio & Ricotta Stuffed Squash Blossoms (they came out cold and were lacking flavor I wouldn't recommend) thankfully the entrees redeemed our dining experience the Australian Truffle Risotto (truffles shaved table-side) and Spicy King Crab & Squid Ink Spaghetti were both excellent! The ambiance was swanky and romantic but the service left something to be desired.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/q6HM37UNLRLawNGtyr43mg/348s.jpg", "caption": "Squash Blossoms"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/TIHhN_rbC-OXwxSz7ONNXw/168s.jpg", "caption": "Wagyu Beef Carpaccio"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Jh_3FYV8TxvaGzVNOMmZLA/168s.jpg", "caption": "Spicy King Crab & Squid Ink Spaghetti"}]}}, {"review": {"des": "Came to RPM Italian for Christmas Eve price fix dinner. Had a very late 9:15 reservation.<br><br>We got a great table, and the waitress was excellent. Very knowledgeable of the menu and very professional.<br><br>The price fix was $85 per person,  and honest well worth it. It was the feast of 7 fishes. To start was 3 different shellfish tastings. Then was a tuna tartar crostini. Then I had the king crab pasta, and for dinner a fully shelled lobster with a side of amazing hand made pasta. The lobster was served with an elegant sauce you pour over it. <br><br>This restaurant is obviously fine dinning, and of all of the restaurants I visited in my time in Chicago easily the best in relation to service, food quality, and overall experience. <br><br>If you are looking to go to a serious restaurant for a special occasion you won't find a better place than this.", "pics": null}}, {"review": {"des": "I waited over an hour for my reservation. I came from out of town and my reservation was for 8 PM. I arrived at around 7:45, but was not seated until 9:15. I was really going to try to give the food a fair chance still, but some of it was cold and all of it was underwhelming. Was it decent Italian food? Yea. Was it worth the waiting and stress? Absolutely not.", "pics": null}}, {"review": {"des": "I can admit it, I'm in love with RPM Italian and I see nothing wrong with it. Having heard of the RPM chain for years, I was psyched to make it here during my trip to Chicago. <br><br>I did my homework, and I knew they had a weekday happy hour from 4-6 and I came in at 4:55 to take advantage of the discounted prices. <br><br>I started with the Spritz and Giggles, which was delicious. For an app, I ordered the Prosciutto Involtini, which was small but tasty and I'm not complaining for the price. My next drink was a Bellini made to absolute perfection (also on the happy hour menu).<br><br>After much deliberation over my meal selection, I went with the bucatini and added a meatball. There are no words for how good this meal was. I might just talk about it for the next 10 years or the next time I make it back to Chicago. <br><br>I made friends with my neighbor at the bar and I also was able to tasty the truffle garlic bread and the 600 day prosciutto, which were both divine.  <br><br>To top off the meal, I went with what I thought was a simple bread pudding, but once again RPM outdid itself and it was the most delicious bread pudding I've ever had. It was a delicious twist between bread pudding and creme brûlée, and that's winning in my book. <br><br>My goodness, I'm not sure I've ever had a better dining experience. Bravo, this place is just plain fantastic.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/hRQwq-KRtaCACwiqjJydXw/348s.jpg", "caption": "Sorry, mom! This dish was better than yours!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/j0IpSdZ7uSEN83HyyHhAWg/168s.jpg", "caption": "Cheers!"}]}}, {"review": {"des": "Fabulous time had at RPM. I was there on a Friday evening, party of 3.... my girlfriends and I had a reservation. We were promptly seated and got a fabulous corner round booth. I was very impressed with the beef carpaccio and loved the angus steak. All the food was fresh and delicious, I didn't really enjoy the ice cream turtufo which wasn't like me because I love chocolate and I love ice cream. <br><br>The ambiance was great, lighting was perfect. We saw everyone from families with babies to couples on there awkward first dates. <br><br>I highly recommend RPM", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/339O3of7-wUPQIO982X1rw/348s.jpg", "caption": "Pudding for desert"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/XvW4KCxz_b2_ygpDtf27HA/168s.jpg", "caption": "Turtufo"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/lBmMdHVbiKaybqX7_3rQ1Q/168s.jpg", "caption": "Steak medium rare"}]}}, {"review": {"des": "I love this place, just which it was easier to get a reservation (and cheaper).<br><br>I have been here a number of times with family and friends, and each time the food is just as fantastic. It is by far, one of my most favourite Italian restaurants in Chicago. As a vegetarian, I don't get alot but whatever I get is really good. <br><br>To start, I always get the provolone stuffed peppers. Simple and highly addictive. (5/5)<br>The cremini mushroom pizzette is also highly addictive. Thin, crispy and perfectly mushroomy with a hint of truffle. I always end up ordering 2. (5/5)<br><br>For mains,<br>My favourite (as is most people's) is the pomodoro bucatini. It has a slight kick to it, but I always ask for it extra spicy. The bucatini tastes so fresh and the sauce is well balanced with the sweetness of the tomatoes and kick from the spice. (5/)<br>Another dish I always order is the wild mushroom agnolotti, simply for a balance. Every time I order it, I realize i can't take more than 3-4 bites because it was too creamy. But whomever I am with, always loves it and ends up finishing it. So maybe just its me? (4/5)<br><br>For desserts,<br>The bombolonis are a must. Because who doesn't love donuts? (5/5)<br>I also tried the budino, which I found pretty disappointing. It was too rich for my liking. (2/5)<br><br>The food at this place is obviously spectacular. I just wish I could frequent it more often. Make sure you book well in advance, even if you're just going as a party of 2 or 3.", "pics": null}}, {"review": {"des": "My mouth is just drooling thinking about mama de pandi's pasta dish! It was so good and tasted homemade! Def. must get! <br><br>My bf and I made a late minute decision on a weeknight to try this place out - showed up without reservations and only had to wait minutes to be seated. <br><br>RPM is great for sharing - perfect spot for date night! Or with girlfriends!", "pics": null}}, {"review": {"des": "This place is a wonderful option for high quality late night dining.  The service I received after having entered shortly before 11 pm on a Thursday evening was simply perfect. The service was speedy, efficient, friendly, attentive ( but not overly) and the food came quickly and were all delicious.  I had a starter of burrata and pesto ....superb!! The steak was perfectly seasoned and cooked and the bomboloni for the dessert were simply the best!  I'll be back!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/3Wsli1QnUT58R82r2hOgtw/348s.jpg", "caption": "Great bombolini"}]}}, {"review": {"des": "Great place!!  Definitely, $$$ per person, but the level of service is phenomenal.  The food is excellent!  I've been here for the opening and they served up some delicious appetizers.  It's very clean and fancy, but modestly dressed is fine.<br><br>Beautiful place right in river north.  Enjoy!", "pics": null}}, {"review": {"des": "Excellent food and well-trained servers. Food is family style with small portions. We very much enjoyed our beef Bolognese, garlic truffle bread, classic spaghetti and meatballs, and crispy brussels sprouts. Very nice wine selection.<br><br>It is a little pricey for what you get, but I would be happy to return. Highly recommend for a date night out.", "pics": null}}, {"review": {"des": "We had an Opentable reservation weeks in advance. We did end up waiting about 10-15 mins. past the 5:45 pm time. Once seated, our special requests were met! We wanted a quieter table. Yay. Generally speaking we had a very good experience at RPM. I had the Classic spaghetti and meatball ($21.00). We all had the seasonal heirloom tomato, arugula salads ($12.00) with a red vinaigrette base dressing which was so pleasantly refreshing. We ordered a bottle of a nice red wine from Italy (many wines - expensive). We had the Bombolino (Italian donuts?), i.e. New Orleans beignets really. It came with Nutella and fresh Chantilly cream. We also had the Lemon cake. We did order an espresso and two regular gourmet coffees (not bad). Expect excellent and delicious meals with a very professional staff that doesn't hover over you nor lack at paying attention to you either. Expect to leave here with a $250.00 bill for <br>3, not including a gratuity.", "pics": null}}, {"review": {"des": "Delicious and great service.  We went here to celebrate our 1-year anniversary and was treated to a complimentary glass of champagne.  Our waiter warned us of the small portion sizes, so we ordered enough food to ensure we weren't starving when we left the restaurant.<br><br>Spaghetti and meatball: yum!  Great balance of flavor, but nothing out of this world.<br><br>Eggplant Parmesan: tasty and better than average<br><br>Mushroom pasta dish: the Star.  Each bite was a celebration<br><br>Garlic truffle bread: It was alright.  Not something I would order again.", "pics": null}}, {"review": {"des": "During my last trip to Chicago, I had the chance to grab a bite at RPM Italian.<br><br>RPM ITALIAN CHICAGO<br><br>Located in Chicago's River North neighborhood, RPM Italian is modern in approach and Italian in spirit and features a contemporary, chef-driven menu with dishes meant to be shared. The sister restaurant to RPM Steak, RPM Italian marks the first collaboration between partners RJ, Jerrod and Molly Melman, celebrity couple Bill & Giuliana Rancic and acclaimed chef Doug Psaltis. Menu highlights include more than a dozen fresh pastas made in-house daily, slow-roasted meats, wild fish and seafood, and celebrated Italian classics with an elevated twist. Signature RPM cocktails or any wine from the extensive list, top off the dining experience. RPM Italian's chic space is set in tones of black, whites and grays and boasts rich woods and leathers, making it the perfect spot to enjoy a great meal, night out or simply a late night bite.<br><br>THE STORY<br><br>The 4 of us were deciding where to meet in Downtown Chicago, and we picked RPM ITALIAN. Luckily we knew \"a guy,\" otherwise there would be NO WAY to get a table; the place is THAT busy and hard to get in.<br><br>Once we were all there, the hostess sat us at a nice table in the corner, overlooking Downtown Chicago. We all ordered cocktails and got them tout suite.<br><br>We decided to get a bunch of appetizers and shared them family style. We tried the brussel sprouts and the octopus. Both were EXCELLENT! My friend, Roxanna, ordered a few more, including the Alaskan halibut and filet steak, but I was full by then, plus I wanted to try the bomboloni, Italian brioche donuts, which we DELICIOUS!<br><br>This RPM has a bunch of flat screens, so we were able to watch the game and stay awhile, whilst people watching and sipping on cocktails. I'm a champagne fan, and loved their by-the-glass Michel Arnould Brut.<br><br>SERVICE EXPERIENCE<br><br>The service was impeccable. All of our needs were met and even anticipated. Even the manager stopped by to say hello. <br><br>CONCLUSION <br><br>I absolutely love RPM ITALIAN CHICAGO! I can't wait to go back!<br><br>5/5 RECOMMEND<br><br>OF NOTE<br><br>*Valet Parking<br><br>*For more information: <a href=\"/redir?url=http%3A%2F%2Frpmrestaurants.com&s=c063530319af18a5602dbc9d344e90c338effd4d63acbd5810ec42a3f83e5808\" target=\"_blank\" rel=\"nofollow\">rpmrestaurants.com</a>", "pics": null}}, {"review": {"des": "I'm at rpm about once a month - don't judge me I love pasta! And about half those times, I have reservations- and normally am seated within ten min of arrival.<br><br>Last night, my in laws flew in from California and I was so excited to take them to one of my favorite restaurants and rpm left me...embarrassed. We showed up about ten minutes early for our reservation and didn't get seated until almost an hour later. What was the point of a reservation? My guests were older and had been traveling all day and we would have happily gone elsewhere except for the fact that the hostess kept telling us \"just a few minutes,\" and that they were running \"20 min behind.\" Well, we showed up around 820. By their logic, we should have been seated for our 830 reso at 840. 840 turned into 930. Not cool, rpm...", "pics": null}}, {"review": {"des": "Where do I start?! The ambiance is absolutely stunning, low lit and romantic restaurant with modern styles. The menu is meant to order multiple items of each. As a table we shared the carbonara, short rib bolognese, chicken Parmesan, and bucatini pasta. The waiter suggested a perfect red wine to accompany, and we also shared two desserts. Everything was spectacular! It's always on my list when I'm in Chicago to visit!", "pics": null}}, {"review": {"des": "Some of the best Italian food I've ever had. <br><br>Roman artichokes (4.5/5) - as authentic as it gets<br><br>Crab crostini (4/5) - very tasty bite<br><br>Tortellini (4.5/5) - lots of flavor packed in small bites<br><br>Negroni (5/5) - excellent execution<br><br>The vibe is classy but happening. This place is a little less Italian American and more modern Italian.", "pics": null}}, {"review": {"des": "The rare 5 stars from a star cheapskate! <br>After theater dinner. We missed our reservations, but we got a lovely little high top table in the bar and settled in. Success all around too. <br><br>We had Martinis <br>We shared plates.<br>Italian salad was really a little bowl of antipasti and chopped salad. Perfect. <br>Babes had a crab and ink pasta, she ate it all. <br>I have maybe the best pasta Carbonara in Chicago, finishes table side as it should be. <br>We split a hanger steak, which came petite, and perfectly cooked and seasoned. <br>I had a second Martini. <br><br>All in all, just a best in City class meal, served by Alex M, a best in City class wait staff. <br><br>I would never turn down a return t RPM Italian.", "pics": null}}, {"review": {"des": "My husband and I ate here for a special date night recently. We had 7 pm reservations, but they were running behind so we ended up not sitting down until about 7:25. Not the greatest first impression, but they did let us know when we arrived they were running behind. The restaurant is very modern and has an upscale feel, but you will see people in casual clothes. <br><br>The food was pretty good, although some of it was pretty salty. We split an order of the truffled garlic bread and Giuliana's Italian salad for appetizers. I loved the garlic bread and the salad was pretty good too. I ordered the risotto and my husband had the potato gnocchi. Both dishes were good, but they definitely are on the smaller side so we were glad we had ordered appetizers and a side dish.<br><br>Our service was good once we sat down. Our waitresses was attentive without being overbearing. The price was pretty good for what we got as well. Came to $100 for two cocktails, two appetizers, two pasta dishes, and a side. We would come back again!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/lCoi7jtuPuexwMguNKnh3Q/348s.jpg", "caption": "Potato Gnocchi"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Ko3yvPWAeVwGa5_lv5fjMw/168s.jpg", "caption": "Parmesan Risotto"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/-GgNTd-MSj2KIOQOt_r-6g/168s.jpg", "caption": "Giuliana 's Italian Salad"}]}}, {"review": {"des": "Four stars for the fact alone that the restaurant has so many gluten free options, it's sure to be a delight for people who abstain from wheat. Service is a miss, as this appears to be a place where people come to be \"seen.\" Our server was a little cold and so efficiently bussed our table that she kept taking plates from which people were still eating. Overall, pricey, but worth it for good, fresh pasta in a rather touristy area.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/DsV2abqfLAo-EBldzRODxw/348s.jpg", "caption": "Gnocchi"}]}}, {"review": {"des": "After hearing so many great reviews about RPM Italian, I could not wait to try out this classy and chic restaurant. A group of friends and I came here two nights ago for a birthday dinner and we could not have been more pleased with the food, drinks, service and ambiance. <br><br>The drinks: we tried the spritz and giggles, Tuscan cobbler and the old fashioned.<br>The Spritz & Giggles and the Tuscan Cobbler were strong and delicious. The old fashioned was nothing spectacular and I have had better.<br><br>Food: <br>For apps we had the New Zealand oysters (half a dozen), meatballs and truffled garlic bread. The oysters were not my favorite and had a sweet and subtle flavor. The meatballs, on the other hand, are a must. Our server recommended we try the truffle garlic bread to eat with the meatballs and to help enjoy the sauce. I'm glad she made this recommendation because the two paired wonderfully together. <br><br>For the main course we had the special of the day which was a risotto with freshly shaved truffle on top. We finished our plates in a matter of minutes, it was so delicious. <br><br>For dessert we had the RPM cheesecake, hazelnut tartufo, and the lemon cake all to share. I have heard the hazelnut tartufo described as a giant ice cream version of the ferrero rocher  chocolate and this is exactly what it tasted like.  The cheese cake is rich but not too dense and the berry compote pairs well with the creaminess of the cheese cake. The lemon cake was fine but not a must have like the tartufo or the cheesecake.<br><br>The ambiance was sleek and modern. The service was perfect, friendly and not overly attentive. <br><br>RPM Italian is perfect for a night out with friends, date night or any special occasion. I cannot wait to come back!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/XeVjBy7DO9Ds28tNnVIZqg/168s.jpg", "caption": "RPM Cheesecake"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/n4xV_3SOFO_MCNoBO48R4A/168s.jpg", "caption": "Hazelnut Tartufo"}]}}, {"review": {"des": "I've been wanting to come to RPM for so long now.  I have 4 eholiday gift cards and for sure my husband and I planned to visit during our short visit in Chicago.<br><br>My husband and I got a bottle of Pinot Noir, truffle garlic bread, prime beef meatballs and Mama DePandi's Bucatini.<br><br>Everything was delicious.  The servings are small, and make sure not to compare the portions to Maggiano's or Buca de Pepo.<br><br>The ambiance is fantastic, and romantic. I was very pleased and happy that we made it.  Our reservations were at 11pm, pretty late but we were able to find parking in the streets and it wasn't as crazy.  We will for sure visit again.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/qX0WW48Hwgg0Sn3OQZFkYQ/348s.jpg", "caption": "Mama DePandi 's Bucatini"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/xTxQfqMQp0UE1y7dXx6lSg/168s.jpg", "caption": "Prime Prime Beef Meatballs"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/epHYKTM2LFxlwQTKj5pQwA/168s.jpg", "caption": "Truffle Garlic Bread"}]}}, {"review": {"des": "After 2300+ reviews, it's hard to dispute the facts! <br><br>Fact - service at RPM is excellent without being over bearing<br>Fact - their pastas are hand made daily and fish flown in fresh<br>Fact - you can score a hi top table at the bar if you don't have reservations. Lots of seating at the bar area.<br>Fact - this may not be the best Italian food you've eaten but it's pretty darn good! <br><br>In addition to a couple of Old Fashion cocktails and the Pinot Noir, I also got the Octopus, the Brussel Sprout salad, Chili Squid Ink Pasta with Crab. The Octopus was standout with a smoky bacon like flavor  even though there isn't any. It was cooked tender and not chewy. The pasta was good but a little on the spicy for my taste. The salad was A-Ok.<br><br>I wouldn't hesitate to get back to get the Octopus again coupled with some of their other specialties, that I was unable to get this time.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/YhDYaPFIoVjSimW1r4GzmQ/348s.jpg", "caption": "Squid ink pasta with crab"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ZNSvgaI9uQn19EHiw8aLXw/168s.jpg", "caption": "Brussel Sprouts"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/BURPpFvC5L3Ujm81Q3kwKA/168s.jpg", "caption": "Octopus"}]}}, {"review": {"des": "The buzz lives up to the hype for this gem. I've been here twice with my boyfriend and we've loved it both times. The atmosphere is elegant with a hip downtown vibe but the prices definitely match a popular downtown restaurant. The portions on the food are small but most of the dishes are fairly rich that it makes up for it in flavor. Both pastas I've ordered here (both vegetarian) were delicious even though I usually don't prefer al dente pasta. We've also had the scallops which were melt-in-your-mouth delicious. The desert pictured was amazing (I can't remember the name) -it was filled with ice cream and had a thin crispy chocolate shell. Definitely recommend for a downtown date night", "pics": null}}, {"review": {"des": "Overhyped, but trendy atmosphere. <br><br>I've heard a lot about this place since Giuliana Rancic and her husband own this place. Excited to try. Went there and the place was very nicely decorated and a perfect place for a fun night out.<br><br>My husband and I ordered the truffle garlic bread, fritto misto, short rib bolognese, and RPM steak grigliata. My overall impression of all was that most of overly salty. <br><br>The truffle bread tasted like bread you could at PIzza Hut. Nothing to fancy and I couldn't taste the truffle oil. The texture of fritto misto was exactly like vegetable tempura that I could get from any Japanese restaurant. With the bolognese, the texture and the flavors were there, but like I said too salty. My mouth built up a lot of salt after a few bites. The steak was again too salty. I left the rest for my husband to finish. <br><br>For the price I expected better food. I wasn't expecting necessarily authentic, but I was expecting good. Not impressed. Probably won't come back. There was nothing that was out-of-this world to me that I would come back for.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ORkMqqIPeErkJL23L7A4XQ/348s.jpg", "caption": "Pappardelle bolognese"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/LsZCp4Ao7wkkmIMAHOpxWw/168s.jpg", "caption": "Fritto misto"}]}}, {"review": {"des": "We followed the suggestions from our very awesome waiter James, and had the most fantastic Italian food I've ever put in my mouth. Crowded and a bit loud, but they created a wonderful dinner experience.", "pics": null}}, {"review": {"des": "My review is biased by the overall lovely evening that I had at this restaurant celebrating my birthday a couple of years ago. The restaurant does have a great ambience for a swanky celebration -- upscale vibes with low lights and free flowing wine. I highly recommend the spaghetti carbonara which came with the yolk yet to be broken and the perfect amount of pepper.", "pics": null}}, {"review": {"des": "Halibut 10<br>Appetizers 10 <br>Sides 9.5<br>Service 10<br>Price 7<br>Overall 9.5 <br><br>Halibut was brilliantly done, outstanding flavor. The table had over 6 appetizers, all were perfect, favorite was the small pizza.", "pics": null}}, {"review": {"des": "Stopped in for an early dinner around 4:15. A word to the wise, make a reservation. By 5, it was pretty packed. <br><br>We had the house made ricotta -- delicious, and a generous portion for two. The ricotta was creamy and light, and the tomato sauce is a great pairing. The bread was fresh and grilled to perfection. We also had the pepperoni pizette, which was a cute little personal pizza. Lastly, we had the prosciutto tortelloni-- not bad, though a bit salty for my taste. <br><br>The service was excellent, and the space is beautiful-- very upscale. Absolutely recommend stopping in!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/5zrZOeFjlsxjkz9KSCTV6A/348s.jpg", "caption": "Ricotta and bread"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/2rX9oJvklUHeQKelzjtONg/168s.jpg", "caption": "Prosciutto Tortelloni"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/D6rG-YggvkLm05bDRa_TGw/168s.jpg", "caption": "Pepperoni Pizette"}]}}, {"review": {"des": "Before making my way to Chicago, I heard many rave reviews about RPM Italian. \"It's the best Italian you'll ever have,\" they said, \"you won't regret it!\" they praised. After visiting RPM Italian, I know there are some bandwagons that aren't worth jumping on.<br><br>I can't say it was all bad. As soon as you walk in the restaurant is beautiful and bustling with life. The round sofa tables were gorgeous and made for a cozy dining experience. Once you get to the real reason you're there - the food, disappointment ensues. <br><br>We started off our night with an order of meatballs and truffled garlic bread. The meatballs were tender and the sauce it was in had the right balance of savory with a hint of sweet. By far these two items were the winner of the night. We followed up the appetizers with the Proscuitto Tortelloni and Handmade Cavatelli....Now. Anyone who cooks knows you don't always get it right. The chef that night got it completely wrong. The beautiful presentation belied the taste. These two dishes were so brackish I had to down gulps of water after each bite. In the Proscuitto Tortelloni, the rosemary and salt were fighting a losing battle for top flavor as the dish was overloaded with both. To make matters worse, the pasta was not cooked. The Handmade Cavatelli was not any better. We couldn't get past the salt.<br><br>We thought the night could be redeemed with dessert. We ordered the RPM Cheesecake which was topped with blueberries. This was OK. Overall, I did not have the experience I was hoping for.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/oS30J5ydcseHG6NdH9gb5g/348s.jpg", "caption": "Meatballs and Truffle Garlic Bread - delicious!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/mD6albN9uESRe3RaPH9jEQ/168s.jpg", "caption": "Proscuitto Tortelloni"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ttsH163ZUyz8qzBkFJVLCA/168s.jpg", "caption": "Handmade Cavatappi"}]}}, {"review": {"des": "Great choice for dinner, you can't go wrong with RPM. We placed a to go order which consisted of  Giuliana's Italian salad, truffled garlic bread and Mama depandi's bucatini with a meatball.  All very solid choices. The pasta is fresh and sooooo delicious! Highly recommend if you are in the area.", "pics": null}}, {"review": {"des": "Went with business colleagues/friends who were in town. Awesome experience.  Service; wine suggestions; presentation and food were all top notch.  As four self-professed foodies who are picky about service and surroundings....we were delighted!  Well worth the money. Great scene too", "pics": null}}]}