{"name": "rpm-steak-chicago-2", "reviews": [{"review": {"des": "Had the pleasure of experiencing what the hype was all about as this was the venue for our holiday party.  Although we had a pre-picked menu, the owner of our company always goes rogue and picks a whole bunch of items from the real menu.<br><br>The minute you walk into the restaurant it definitely has that date worthy atmosphere of class, sass, and romance.  So guys, take your ladies here if you want to truly impress her!<br><br>Everything that I had here was great.  I loved the seafood tower that had a mix of jumbo shrimp, lobster, and oysters.  The wagyu beef was absolutely delicious.  It was melt in your mouth steak, cooked to perfection.  I also had the 16 oz NY steak, and that was good as well.   But my mistake was that I had it after the wagyu beef and everything after that wagyu was 2nd best.<br><br>Okay actually I take that back.  After looking thru my pics, i forgot to mention the side of bacon that i had.  Omg best bacon ever.  It seemed like it waa porkbelly and bacon flavors all in one.  Baked to a slight crisp and seasoned deliciously.  You must try it!  The avocado lobster salad was also yummy.  An odd combo but great flavors combined.<br><br>The service was outstanding.  Our waiters were always around, ready to get us our next drink, or two!  They were friendly and attentive.<br><br>RPM steakhouse lives up to the hype in my book!  Every once in a while I catch myself dreaming about that wagyu beef...so I must come for it again.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/tjc-zJiChVlJlU4WiZkmPg/348s.jpg", "caption": "Raspberry cheesecake"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/7uJM_HdyHb0WcND070Sziw/168s.jpg", "caption": "NY steak  16 oz"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/tZSDzgeezbaCuas5iVsl_w/168s.jpg", "caption": "Wedge salad"}]}}, {"review": {"des": "I've been to Chicago for a few times now, but never been to RPM Steak. We are frequent visitor or Gibson, but thought will try something different and decided to make a last minute reservation at RPM yesterday, didn't manage to get one, decided to do a walk in as I was told the bar seating area is on a first come first serve basis, so we came by around 6.30 p.m. and surprisingly, the bar seating area is quieter and we got a seat right away.<br><br>We were greeted by our Server Tim and he brought us water, etc. Explained the entire menu and gave us some time to look and think about it!<br><br>His service was awesome and to start off the night we ordered a glass of wine and the RPM Sidecar recommended by Tim. I truly enjoyed the drink and when we ordered the steak, decided to go with cowboy steak - thank you to all the elite reviewers out there for recommending this! We decided to share since it was 24 Oz (bone in though). But for 2 people, this is actually just the right portion.<br><br>My friend wanted it medium well and since I like my steak medium rare, Tim was smart in recommending for us to get it medium - which was just right. We love the steak. It was cooked just right, the right portion for us and we finished our meal with creme brulee as recommended!<br><br>I will definitely come back to this place when I next visit.<br><br>Thank you for making my first visit memorable!!!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/8CtKdYkTjRVPyfgFot4a0A/348s.jpg", "caption": "24 Oz Prime Dry-Aged 28 Day cowboy steak"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/X5JZCxUQeTTrjc7W50eyww/168s.jpg", "caption": "RPM Sidecar"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/JikjfYkzhNn1ohIui932Bw/168s.jpg", "caption": "Sicilian Pistachio Creme Brulee"}]}}, {"review": {"des": "As good as it gets. Wow! I waited for years to make it here, and I'm so happy I finally did, and I can't stop telling people how good it was. After trying RPM Italian last time I was in Chicago, I knew I would love RPM steak just as much. <br><br>Since it was just me going out for dinner, I didn't make a reservation and thought I would easily find a seat at the bar on a cold Tuesday evening. I wasn't that lucky right away but was able to snag a seat after just a few minutes and right before the bar got even busier. <br><br>I think it goes without saying that this place is pricey (average meal is about $50 - $90), but that being said, it is DELICIOUS, and the food is high quality. For me, this would be a special occasion restaurant where I would enjoy going to celebrate an anniversary or birthday.<br><br>Not wanting to break the bank, I went with the Steak Frites with a Black Truffle Bearnaise for $43. It comes with fries, but after reading about Mr. Price's Whipped Potatoes with caramelized onions and horseradish, I asked to substitute those for the fries, which the bartender happy did for me. <br><br>Now I know I didn't select the best cut of meat, but this was the BEST I have ever had. It was so tender  that if I didn't know better, I could have easily mistaken it for filet. And the sauce, it was out of this world and it paired perfectly with every bite. The whipped potatoes are the way to go with this meal, and they are honestly outstanding. <br><br>My bartender was friendly and took care of many special requests throughout the evening. Like I mentioned above, they were very, very busy and I could tell people were waiting for my seat, so I didn't stay too long after my meal. <br><br>It's been two weeks since my visit, and I'm still thinking about my meal. I would return soon if I didn't live 1,000 miles away!", "pics": null}}, {"review": {"des": "What can I say ?!? Amazing and top<br>Notch service from the start .<br><br>We organized a work event here for 12 people and had amazing help every step of the way . Weeks out , we had help choosing wine , appetizers as well as a pre-set menu that included our logo . <br><br>Upon arrival our guests were directed to the bar for a cocktail and once everyone arrived ,we headed to our table where Chelsea had arranged everything beautifully for us .<br><br>The table setting was beautiful , the menus perfectly laid out, service was impeccable and the food was out of this world . <br><br>The seafood tower took everyone's breath away and was well loved by all , the sides (make sure to get the risotto ) were mouth watering and the main courses were delicious ! They even made this vegetarian girl a vegetarian risotto entree .<br><br>You will not be disappointed! Thank you RPM for making our dinner so special !- Angel and the Netblaze team", "pics": null}}, {"review": {"des": "Had an incredible meal at RPM steak this past weekend.  I went in with reasonable expectations but realizing most traditional steak houses tend to be very similar.  However, RPM is definitely a cut above the rest.  The ambience is excellent and the Wait staff is knowledgeable and attentive.  I absolutely recommend this place if one finds themselves visiting the Windy City.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/sqF2CT1NSdIkCouFMVDLJA/168s.jpg", "caption": "Bacon"}]}}, {"review": {"des": "The service here was good (we came for lunch) and the food was extremely pricey; but good. I don't think $150/person good, but still a fun experience to go try once. I had a really hard time making reservations online so I ended up calling and got in just fine. Dessert was incredible. Salads were also good. A good spot for your once in a lifetime events or super special occasions.", "pics": null}}, {"review": {"des": "One of the best meals I have had from start to finish all year.  I brought my Japanese customers here who were so impressed that they dined there again the next night.<br><br>We started with cheese fondue, coal fired crab and hamachi crudo.  All excellent though I would have liked more crab . We decided to sample steak so we ordered \"the duke\", a cowboy steak and the special ribeye.  All awesome though I would vote for the ribeye.  I sampled them all but am watching the red meat so ordered a black bass as well.  It was good not great, but it's a steakhouse.  Hello.  For sides, the millionaire potato is a must have and the mushrooms paired well with the duke.  Save room for dessert because the 14K chocolate cake is to die for.  The vanilla sugar donuts as well as the Smore's dessert were very good, just not 14K.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/lSixPnBKH9rRBDWzb3m4sw/348s.jpg", "caption": "The mushrooms"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/znyDG965ySlWLSILlVx2JA/168s.jpg", "caption": "14K Chocolate Cake"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/L6gg_ObKQBTWwHvKlw-JGA/168s.jpg", "caption": "Fontina Fondue"}]}}, {"review": {"des": "Wow!  What can I say?  Do you want to have one of the best steaks in the country and also have one that is incredibly rare?  Then you need to come here!  They have a massive selection of delicious foods that not only include a robust amount of steaks, but seafood too!  They have an extremely rare selection of Japanese beef.  They are one of 10 restaurants in the entire country that can serve Kobe beef.  Now before you say anything, many restaurants claims they have Kobe, but it's a different Wagyu steak.  Kobe beef has a specific criteria that must be met to be legitimate Kobe.<br><br>Full disclosure...you are going to be paying a rather large amount of money to come here.  This is definitely a very rare date night or business meeting style restaurant.  Because my wife and I went all out on their most expensive steaks, we ended up having a bill that ran almost $350.  Think about that, we literally ate an iPad.  So if you want to have an amazing meal and go all out, then come here.  <br><br>Edit:  I'm a little more upset than I thought after reading more information about this restaurant.  We decided to go all out and ended up spending around $350.  We were really wanting some yummy dessert to top off the night, but our server just gave us the check and didn't offer any.  We had assumed that they just didn't have any here.  Then I later checked the online menu and realized they do actually have dessert!  On top of that, there was some yummy cotton candy being given out to people. You would think with what we spent, they would have offered us some.  This was really disappointing.  Instead of having their delicious looking chocolate cake, we ended up just getting donuts from a nearby shop.", "pics": null}}, {"review": {"des": "Update.  So I just was 3way called  to discuss this review by a Jason D .. The company should just clean house. I was accused of trying to steal wine glasses that I allegedly put in my purse. This purse (pic attached)  a bottle of wine was purchased  to take with... when the wine was bought to me I put the additional wine glasses on the table in the takeout bag also . On my departure I was stopped abruptly at the front desk of the establishment and was asked to return the glassware. I did. Then I asked if I can purchase them, they said no. We left. <br><br>Today they told my client that paid for dinner I tried to steal and I was a thief. I have never been so embarrassed. I suggest you take your chances here my people because if this ain't profiling idk what is.<br><br>Mastro's have better steak and service.  If you are of African American race, They will treat you like second class citizen.  The evening began badly with a server who seamed annoyed he even had to take our table(party of 2). I started to request another server but I figured I was overreacting. But I wasn't again this uninterested server screwed up the temperature of my meat(undercooked), my guest couldn't even eat her meat (overcooked). As someone who has 10+ yrs in the hospitality industry(New York) I watched this man who I believe to be the Maitre D or Manager check on every table but ours, which I found quite interesting. Over all I did not feel welcomed and I'll only be visiting the Rpm in DC if I ever go again.", "pics": null}}, {"review": {"des": "Very cool restaurant with just OK food, for the price. <br><br>The bar area is awesome, and the inside of the restaurant is very cool. It's a great atmosphere and fun place to have some cocktails. <br><br>The food is decent, but not great. First of all, they make you pay for bread and butter. I've never been to a high end steakhouse that makes you pay for bread before a meal, that was absurd. Second, the steak was pretty good, not great. I ordered the center-cut ribeye on the bone, which did not have too much flavor and was a pretty tough chew, especially for how expensive the steak was. Also, we ordered the Mac n cheese, and out came a plate that looked like mush with sauce. I show it to our server and he tells me that they forgot to put the Mac in the dish! Lol! I mean how can any restaurant, let alone a high end steakhouse, forget to put the Mac in Mac n Cheese...Instead we got the cheese lol. It was actually pretty comical. <br><br>I won't be back, unless it's for drinks at the bar.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/41E-73VJ2r9-cMSgxjbOyw/348s.jpg", "caption": "Center cup ribeye. It looks way better than it tasted."}]}}, {"review": {"des": "Ohhhh where do I begin!!!! Cameron....oh Cameron!!!! He is the best! <br><br>The food was amazing! I had the chanterelle mushrooms and kale salad and my friend had a ribeye steak. <br><br>But let me tell you! I came here for this hazelnut ball which is actually found at RPM italia not steak.  I thought I was out of luck....HOWEVER...Cameron got them to deliver the desert from italia to steak (or he went and got it...I don't know but I'm blown away). He deserves all the praise in the world for absolutely excellent customer service! Bravo!!!! Thank you so much for making my first time there so special!", "pics": null}}, {"review": {"des": "RPM!!! Holy crap where have you been all my life! Incredible mouth watering meal! If you go to Gibson's in Chicago your missing out cause RPM blows them out of the water! <br>Our table had a serious food experience! <br>The coal baked Alaskan king crab starter is out of this world crazy! So amazing! <br>We had the seafood platter which is a meal all by its self. The table shared the tomahawk steak. The flavor was amazing and cooked perfect! But now let's get serious Japanese waygu Snow Beef!!!!! Truly one of the top 2 needs in the world! Can't even express how truly beautiful and delicious this meat is. Melts like butter in your mouth! Dammit!!! Lol....<br>We ended the night with about every dessert they had! RPM you are freaking my favorite steak in America for sure!!!!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/O0fQfaV_VfU6BfQPAU4hjg/348s.jpg", "caption": "Delicious 42 oz. Mishima Tomahawk steak! Amazing"}]}}, {"review": {"des": "So my experience was less than awesome. Typically this is one of my favs. But to start the service just wasn't that good. Our waitress wasn't personable and when I made a simple request to have all dark meat with my chicken, they refused to accommodate me until the manager got involved, who was actually really nice. Our chicken was bland and when my boyfriend opened his to go container, they put his eaten bones in the container as well. GROSS. common sense tells you that no one wants to reheat chicken bones. I was really disappointed at my experience, as I was taking my boyfriend here for a special occasion and just knew RPM wouldn't disappoint.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/PDqGZ_0DFUqzq4I6BvOtPA/348s.jpg", "caption": "Togo box, they packed the eaten chicken bones. GROSS"}]}}, {"review": {"des": "I was in Chicago for business and convinced my cousins to meet me out on a Sunday night for late dinner, and this was one of the few restaurants open. Everyone enjoyed their food, I had the burger and fries. The beef in the burger was cooked to perfection. We ended our meal with a couple desserts, and our favorite was the doughnuts.", "pics": null}}, {"review": {"des": "We haven't been back to RPM in a few months but decided to grab dinner there tonight. We sat at the bar. The bartender, John, was super friendly and kept checking on us. He was also very helpful with recommendation. When it got a little busier he had someone else there to help him who took care of us. We decided to try something different this time than our usual steak and potatoes meal.<br><br>We started with the Last Call drink. It's a was a tequila and mezcal based drink with a hint of a grapefruit flavor. The drink itself was good, it was well balanced, not overly sweet or tarts. I thought it could have had a little more grapefruit flavor but my husband didn't seem to mind the subtle flavor. The problem was with the ice. It was crushed ice so it was so hard to drink. The ice would get in the way of the liquid and when you had about half the drink left it was next impossible to get it without getting a mouthful of ice. <br><br>Next we had a half dozen oysters. These were the star of the meal. My husband never eats oysters but he enjoyed these. The oysters were not overly fishy or sandy. The crunchy jalapeno mixture they put on top made the natural slime of the oyster barely noticeable. <br><br>In the past we always get the bread Fontina fondue. We decided to get it again. This was a huge let down. First of all it's not served the same as before. Before it use to be served in a hot skillet of melted cheese with the bread sitting on top. By the time you'd get the dish the bread would be soaked in the cheese it was heavenly. Now they serve the bread and cheese separately so it's like dipping bread in melted cheese. Not the same. Next the cheese sauce is also different. It use to be thinner and gooey but even when it got cold it would be creamy. Now it's much thicker and when it gets cold it's clumpy and difficult to eat. And finally they changed the bread. The bread use to be thicker and more dense now the bread is lighter and very crispy. It's a little too crispy for the thicker cheese. The bread crumbled when I tried to break it. We use to carve this dish but this new take on it is not good. We still ate it because it's still bread and cheese (who doesn't like that) but it's nowhere what it use to be like. We probably won't be ordering this again.<br><br>For a meal we shared the Broiled Black Cod and blue cheese whipped potatoes. The black cod was really good. It's a fairly small portion but it's also much cheaper than the steaks. The miso gave it a very subtle but noticeable flavor. Overall I'd give it a 4/5, it lost a star because it could have been broiled slightly longer to give it a little more color and toasting on top. I saw pictures of what others had posted and ours didn't have nearly as much of a broil as those. We didn't get a picture because we devoured it within seconds. I was pretty disappointed in the blue cheese whipped potatoes. I've had these half a dozen times before and they were fantastic but this time not so much. I don't think it had enough blue cheese or salt. I don't eat much salt so if I was able to notice the missing salt they must have been really under seasoned. They didn't taste like much. <br><br>We finished our meal with the Baklava sundae. The ice cream and caramelized phyllo were perfect. You get 3-4 scoops of ice cream. The caramelized phyllo was thin and crispy and covered in a seasoning but I could t really tell exactly what it was. The honey walnut sauce was beyond awful. Given the name I expected it to be sweet but this was like eating a spoon of sugar syrup. It tasted fake and very syrupy. It also had a terrible after taste. The walnuts were mushy so they didn't help the sauce either. We couldn't eat any of the sauce. I've had baklava before and this did not have any resemblence to it. <br><br>Overall I was pretty disappointed in my meal. The oyster and fish were pretty good but it didn't make up for the bread fondue, potatoes and dessert. I want to say we'll go back and just get what we use to get but they seem to have changed 2 (fondue and potatoes) of the 3 items we usually get. We didn't try the steak this time but if they also changed that then I not sure what we'd get.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/37G8BPEeGsT_5ku6hNFFGg/348s.jpg", "caption": "Chilled Oysters"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/K62o4PIE-w80nmOaehE2hg/168s.jpg", "caption": "The Last Call"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/M9xBx2HiaCTVxsXf2cLShA/168s.jpg", "caption": "Newer version of Fontina Fondue"}]}}, {"review": {"des": "JFC! I'm not quite equipped with the words to describe the experience. <br>Took a client here and from the Old Fashioned to Pax sirah then an Angel's Envy bourbon the drinks were off the charts. <br>The steak on special cooked med-rare killed me. <br>Brussels sprouts were broken out by the leaf which I've never had prepared that way. <br>Mashed potatoes with horseradish was smooth. <br>Blueberry tart and Chocolate gold leaf cake destroyed.<br>Service was off the charts!", "pics": null}}, {"review": {"des": "So far this restaurant has been my favorite experience since moving to Chicago!! I loved the atmosphere and layout. Nice big open bar. <br><br>To start, I had the old fashioned which was one of the best I had! Highly recommend to any whiskey lovers. For an appetizer we got the crab. Not to exaggerate but I still drool just thinking about this. It has a sweet, caramelized glaze on top and the crab fell out of the shell. This is a MUST for appetizers. I could've left happy after those two items. <br><br>The steak was very good. I had a filet cooked medium rare. My friend had his medium and we agreed medium rare was the way to go. We accompanied our steaks with Brussels sprouts and the rich mans potatoes. Both of which were great! <br><br>To end the meal, they serve you cotton candy. Not a fan myself so we left this untouched. However after seeing a show, we ordered the Baked Alaska cake. A caramel cake that is flambéed table-side. The rum and chocolate poured on top was delicious! If you enjoy the flavors of burnt marshmallows, you'll want this! <br><br>Amazing experience overall and this will definitely be a place to return!", "pics": null}}, {"review": {"des": "We love this place but Hadji is the best person out there. Really went above and beyond for us.", "pics": null}}, {"review": {"des": "This was such a great part of our trip! Our server (I believe his name was Dritan?) was very knowledgeable and courteous and never let our glasses get below half empty. I got The Duke and it was delicious. The side items are medium size portions that you share with the table, I highly recommend the Japanese sweet potatoes! We finished our meal with the Baked Alaska and the 14k gold cake- AMAZING.", "pics": null}}, {"review": {"des": "My favorite steakhouse in Chicago! <br><br>We walked into a hopping restaurant with a full dining room and packed bar. The lively vibe made our 10:15 reservation totally worth it! If making reservations I wouldn't go earlier than 9 of you are looking for fun crowd. <br><br>We started with some seafood apps which were delicious and then dived straight into steak. My husband and I got a 60 day dry aged long bone ribeye. WOW. It was amazing! Couldn't have asked for a more perfect steak. It was cooked perfectly to medium rare and had a delicious grizzle on it. <br><br>For a group of four we ended up spending over $500 but it was totally worth it for spot on service, perfectly poured cocktails, and fabulous food!<br><br>Also a side note.. you may spot a celebrity or two. That night we saw Floyd Mayweather and Taraji P Henson.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/kPVIRZ7KiTel5WdUpneRDg/168s.jpg", "caption": "Coal-Roasted King Crab"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/z8bolmX0GwVUVe3tUayeCA/168s.jpg", "caption": "Cotton Candy"}]}}, {"review": {"des": "I still think they have one of the best truffle burgers in Chicago, though it's not a cheap one.  <br><br>Likes<br>-Great service<br>-Juicy truffle burger with perfectly seasoned fries that are crispy on the outside, moist on the inside<br><br>Dislikes<br>-Amazing but pricey truffle burger<br>-My boss ordered it too but requested medium but hers was medium rare like mine. <br>-The ketchup comes in a cute little glass container.  Idk why they don't box it up with my leftover fries.", "pics": null}}, {"review": {"des": "Honest review: service was really good really attentive went above and behind just wish they would have described dishes an issue with service was that the host told us that there were no available seats n when we got there it was empty n it took a while for her to seat us when it was empty like no one inside ? There is coat check and valet<br>Review just for burger need to try more food. dont forget about reward program if u did email them <br><br>3/5 Dry aged burger $18: it was a good burger. The quality of the meat was really good n moist. Loved the bun it was really flavorful however the bub to meat ratio was off theres more bun then meat. The issue I think the burger was to plain. Like put some truffles or foie or something like it was good but nothing special though ya know like wish it was unique. Didnt taste any horseradish at all<br><br>Foie Gras torchon $23 (perfect combination of sweet and salty) the foie was really good really decadent just the sauce was just a very tiny portion same with the pear if they put more of both would be the best dish ever n wish they buttered the bread jus it was toasted that was disappointing <br><br>Truffle fries $32 the fries were really crispy   but I love a lot of truffle flavor I know some people just like a little but I like when a dish is supper decadent from truffles. N felt like their fries in general need seasoning besides parsley. The mournay sauce was good though jus wish there was more n hot it was lukewarm. My recommendation is if there offering a truffle special unless it's white truffles don't really see it worth the value <br><br>Pomegranate martini $14 my friend likes to drink n said it was ok it was mostly jus syrup not a good balance of liquor n pomegranate", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/YCUOdUcyOsNVGlMo539p3w/348s.jpg", "caption": "Pomegranate martini"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/SCmaCFYrXpwrAX3zzACvPw/168s.jpg", "caption": "Inside"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/sUw6GsYV7-qervePEud0AA/168s.jpg", "caption": "Inside"}]}}, {"review": {"des": "RPM Steak is fine but lacks that wow factor a meal that costs $100+ should have.<br><br>Three of us dined for one's birthday and our $416 bill included drinks, a few apps, one big steak to share, sides, and a dessert. <br><br>Drinks were superb, especially the GTP Gin & Tonic selection with St. Germain.<br><br>The oysters were fine, nothing special. The recommended bacon dish was pretty good but nothing stellar.<br><br>I really wanted to \"go off the reservation\" and get the black miso cod as on my first visit to RPM years ago a fish dish (sea bass?) was superlative. But birthday boy wished for the $180 36oz part wagyu/part Black Angus steak special our pretty good server told us about. I think we ordered it medium but it came out closer to rare or medium rare with a cool, barely cooked center. While tender, the meat was sort of bland and temperature was lukewarm. Better steaks I've had are both cooked to order, even rare, yet really hot served to you. Would've preferred that.<br><br>Creamed spinach side was delish, not too rich. Brussels sprouts disappointed me as they were mostly just over-baked thin wispy skins.<br><br>A lot of people were getting the flamed up tableside baked Alaska so we got that too. It was rich and decadent and big. Spooning flaming blue alcohol on something seems a recipe for disaster but so far no \"Greek fires\" have befallen RPM Steak.<br><br>There are sexy people here, among whom there are certainly some seekingarrangement model-looking lanky gals with rich execs their dads' ages. But it's nowhere near as sexy or as festive and fun and glitzy as Maple & Ash.", "pics": null}}, {"review": {"des": "It's very rare for a restaurant to make me reconsider what I've been missing my whole life. I absolutely loved every bite that I took. I spent way more money than I wanted to just because I kept wanting to taste more even when I was full. <br><br>The king crab had a great powerful flavor but was smaller than I was hoping. I know I'm not the target here as I was hungry and wanted a bigger appetizer. This is more of a \"fine dining\" type appetizer. <br><br>Steak was perfectly cooked and basically melted in my mouth. Such amazing texture and flavor on every bite. The crust was crispy but not overdone, very good. I went medium rare, highly recommend. <br><br>Dessert was this cookies and cream ice cream with tons of cookie and chocolate shell covering it all. Very very good. <br><br>Only negative is the bathroom wasn't kept clean and there were no towels to dry hands. <br><br>Overall it was off the charts. Walked out of there full and stoked on my life.", "pics": null}}, {"review": {"des": "Had a great experience here. Service was attentive. <br><br>Seafood Platter $78: Ordered this with half portion and I was surprised at how fresh the seafood was. It came with oysters, shrimp, Alaskan King Crab legs and lobster. Don't skip this. <br><br>Hokkaido Snow Beef $150: Literally just melts in your mouth. Rich and fatty. <br> <br>Allen Brother 90 Day Dry aged $165: Bf's favorite. Seasoned and cooked well. <br><br>Millionaires Potato With Truffle: Is it weird to say this was my favorite dish of the night? I'd want to just come back for this. It was so creamy and smooth and I could not stop eating it. <br><br>14k Chocolate Cake: Decadent and moist with rich chocolate. Perfect way to end the meal. <br><br>We came here to celebrate our birthdays and received 2 extra desserts. One was Cookies and Cream Sundae and one was cotton candy. Both were delicious as well.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/WaL4zXbPp69Iu2XGGtIBJg/348s.jpg", "caption": "Cotton Candy"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/NoMxSdaNKqS2wzE3MalVSg/168s.jpg", "caption": "Cookies & Cream Sundae"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/_DwsjOOsYwPX9XwBIOG13A/168s.jpg", "caption": "14k Chocolate Cake"}]}}, {"review": {"des": "The service was fabulous. The best Wagyu beef I ever had. The dessert was wonderful also. I did not like the popovers.", "pics": null}}, {"review": {"des": "I almost never give 5 stars but there is no way I couldn't give RPM 5 stars. Service, ambience, food was beyond  beyond words. Ate at RPM  2 nights in a row. Brought 12 friends with me the 2nd night. Saw Federer, Bjorn Borg, McEnroe and several other high profile celebs. This place is the real deal! I'll be back.....soon.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/TfNn9B9ObqtVdKgZI_daaw/348s.jpg", "caption": "Imperial Waygu. WOW!!!!!!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/BfiNO0g-kH34v3MBHGX3-w/168s.jpg", "caption": "Rare Japanaese steak (not Waygu). $155.00 for plate in picture. Silly price but amazing."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/q0QpfWXsrHRT7dWQrq0_sg/168s.jpg", "caption": "12 ounce filet. INCREDIBLE!"}]}}, {"review": {"des": "Yes I loved this steakhouse. Formal dining at its best. Love to see women dressed up and men in jackets. Service was impeccable. Tables dressed in linens and all the beautiful correct silverware and glassware. Steaks cooked to perfection and the sides were different and well done. Next time we are in town we will dine here again and also try their sister Italian restaurant.", "pics": null}}, {"review": {"des": "I loved the food and the ambiance.  The service was excellent. This restaurant is very elegant so you can come here and enjoy an intimate date.  The soft lights  make it very romantic.  I ordered the hamburger and the truffle fries they were out of this world.  The foie gras was very exquisite.  The coffee was very good specially since I was freezing.  Our server Gabe's is top service although RPM started to get crowed on St. Patrick's day weekend.  Next time I come I will order my stake.  <br>Good food, excellent service and good ambiance.", "pics": null}}, {"review": {"des": "So we had a reservation at 7pm, but the hostess didn't seat us until 7:30. They were running way behind because a grub hub delivery guy was waiting forever for someone's meal. <br><br>We were finally seated and it took less than a minute to get a nice crisp menu. I was looking at the menu to see what we were going to order when a waiter came by to get our drink orders.  My husband got some kind of whisky and I got a water. <br><br>We ordered the seafood tower which was my meal, but of course I shared with my husband because that tower was huge! My husband got some kind of filet. We had the spinach parmesan and the Mac and cheese. <br><br>Seafood Tower was good. The lobster was a bit on the rubbery side, but I enjoyed the oysters, the huge shrimp, and the crab! <br><br>My husband said the filet was quite delicious and flavorful. He said it was one of his top 5 and he is definitely a carnivore. <br><br>I didn't like how the spinach made my teeth feel. Not sure if spinach does that naturally since I only consume it through smoothies. But it was delicious.<br><br>The Mac and cheese!! Omg! My favorite dish of the night!!<br><br>We also ordered this baked Alaska! It's some kind of ice cream cake that they light on fire. It's the first time I've ever heard of it and I was hoping the waiter had told us that he was pouring alcohol since my first bite was drenched in alcohol. I thought it was chocolate sauce. <br><br>I'm not from Chicago, but if I was ever going to come back, I would like to try the RPM Italian since this place was delicious!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/l_CvF_n_nDPvLvtAElBmbQ/348s.jpg", "caption": "Huge!!"}]}}, {"review": {"des": "Was in Chicago for a business trip. First time at RPM.<br>Party of 5. We had:<br><br>Popovers - good<br>Wedge salad - sufficient, under dressed<br>Wagu  steak - tender<br>Branzino - kinda bland<br>Cowboy ribeye - very good and flavorful <br>Filet - tender<br>Million dollar potato- overrated  - just a twice baked potato with truffles<br>Button mushrooms- very good<br>Roasted cauliflower with yogurt sauce - very good texture and sauce was tasty<br>Brussels sprouts - soggy <br>Whipped potatoes - average <br>Chocolate 14 karat gold cake - rich and very deep chocolate flavor <br>Baked Alaska - flambé table side. Amazing presentation and very good dessert!<br><br>The restaurant was very pretty and high end. Slightly stuffy. Service was good but a little slow. We waited a lot. Also there was no salt and pepper on the table which means they are a little full of themselves. Take it and like it. Bill with tip $700. There are a ton of other options equal if not better in Chicago. I don't think we'll be back.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/vZCG3uBave8tPS8sR9hQ6Q/348s.jpg", "caption": "Popovers"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/aNbMGxiLiMDetLRtHLJ_vw/168s.jpg", "caption": "Chocolate 14K Chocolate Cake"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/1XI0wXHTJgNdc72kY8IKjA/168s.jpg", "caption": "Wedge salad"}]}}, {"review": {"des": "The food is amazing, but it gets knocked down a couple of stars for making us wait for a table with reservations. We sat at the bar and ordered some drinks and appetizers while waiting. When we finished our drinks and appetizers, we talked to the hostess about our table and they thought we were already at our table. Had to wait a couple more minutes to get our table ready. When we sat down 40 minutes after our set reservation, we were ready to order and eat. The waiter was also good and made sure out drinks were always filled.<br><br>Appetizers: We ordered the Thick Cut Bacon and the Cheddar Popovers. These were amazing and I wish we could've had more. Thick Cut Bacon speaks for itself; it was nice and savory, salty, and sweet. I could eat Cheddar Popovers everyday for breakfast if I knew the recipe. They were very fluffy and airy with lots of flavor.<br><br>Steak: We ordered the Bone in Ribeye with a side of black truffle butter. This was cooked perfectly medium-rare. The ribeye was melt in your mouth tender and paired perfectly with the truffle butter. <br><br>Sides: Bacon Wrapped Buttons and the Crispy Hasselback were both amazing. The mushrooms were juicy and went well with the salty bacon. The Hasselback potatoes were perfectly crispy with a hint of softness in the middle. We didn't finish these appetizers and had them boxed. They accidentally threw them out, so they made us new sides to take home.<br><br>Dessert: The Warm Sugar Donuts were some of the best donuts I've ever  tasted. They were a mix between a sugar donut and a beignet. They had a nice airiness to them with the thickness of a donut. The Boston cream was not too sweet and a perfect combination with the donuts.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/HplxyHJpxcHw9YXoE1ra4Q/348s.jpg", "caption": "Bacon wrapped buttons"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/XjTrpBkuh6tAQtijIHFkCQ/168s.jpg", "caption": "Ribeye"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/hdkwiiURokDXJJsXqQPEyQ/168s.jpg", "caption": "Crispy Hasselback"}]}}, {"review": {"des": "This is my first experience at any RPM restaurant and I was absolutely blown away. 4.5/5 stars. I went with a girlfriend for a birthday celebration and made a reservation on OpenTable at 7p on  Monday. The restaurant wasn't too crowded but seemed full of life. The ambiance was incredible with low lighting and warm tones throughout the establishment. There are two main dining areas with one full of traditional table tops and the other full of cozy booths. In the booth area there is an expansive and sleek bar with comfortable looking square stools. The entire vibe is very romantic and the waiters are all dressed in white sport coats. My girlfriend and I were seated immediately in a cozy booth and we were both instantly impressed. Our waiter took our drink order (gin martini with blue cheese olives & Last Call tequila based drink). He then took time explaining the menu and the differences between cuts of meat. I ordered the 20oz Ribeye ($62) and my friend got the NY Strip ($52). We also ordered the Mac & Cheese, Garlic Whipped Potatoes and Onion Rings. The food and presentation was absolutely phenomenal. The one complaint I had on the night was oddly enough the food was not STEAMING hot; the potatoes were lukewarm along with the steaks. Everything tasted delicious - my medium Ribeye may have been the best steak I've ever had. I then switched to wine ($26 Chardonnay). <br><br>Overall RPM Steak is a fantastic \"special evening\" night. I cannot imagine paying so much money for a regular occurrence but it was definitely worthwhile for my friend's birthday. Our total bill came to ~$260.", "pics": null}}, {"review": {"des": "I've meant to update my review for some time now. RPM Steak has now become me and my husband's go to for celebrations. We are there probably three times a year, and the staff must have a file on our open table reservation, because our waiter has consistently known our preferences, welcomed us back without prompting, the whole shebang.<br><br>Good rotating variety of \"specials,\" always pristine service, and great ambience.<br><br>I've written quite a bit in previous reviews so will refer you there.", "pics": null}}, {"review": {"des": "RPM Steak is exactly what you are expecting: A seductive atmosphere, delectable food, and perfect service.  <br><br>Everything I've had at RPM Steak has been good but my favorites are the steakburger and the seafood platter.  I don't think you can go wrong with any of the sides or potato options either, the crispy hasselback potato is probably my favorite choice though.  The wine list has some very good options at, in my opinion, reasonable prices.  Of course, if you're looking for a cocktail the bartenders will not disappoint.  The 14K chocolate cake didn't wow me, it was a little too heavy on the ganache.  <br><br>The decor is dark and intimate in both the bar and the dining room.  I'd say more on the date night side than a business dinner, but still good for a business dinner.<br><br>There are lots of steak houses in Chicago, and lots of them within walking distance of each other.  I'd put RPM Steak towards the very top of the list.  I don't think you can go wrong with a meal or drinks here.", "pics": null}}, {"review": {"des": "We celebrated our wedding back in August in one of the private rooms.<br>The experience was in 1 word Fantastic!<br><br>Not only all guests were impressed, we were as well!<br><br>Night of our lives and we would recommend it to anyone!", "pics": null}}, {"review": {"des": "I LOVE THIS PLACE!!! We came here for a girlfriends birthday dinner and everything was AMAZING!!!! The wagyu LITERALLY MELTS IN YOUR MOUTH!!! What kind of magic is this? And per our server's suggestion, we got the Spicy Miso Lobster for the table to share, and omg I could literally have that sauce on anything!!! The sides were plentiful and delicious! Everyone was super helpful and nice, from the front door to the dining room! And when it came time for dessert, they sent out some fun cotton candy and there was a candle in our friends cake!!!! So much fun!!! Definitely recommend for celebrating or impressing!!!! Cheers!", "pics": null}}, {"review": {"des": "Second time at RPM, my first experience was great.. unfortunately, that's where it ends. I was ecstatic to visit this trendy restaurant for the second time only to be disappointed. Our waiter was less than personable and honestly seemed annoyed to be waiting on our table..ordered one ribeye steak, and one cowboy (both were cold when they arrived). Food is ok for the price, but it seems like the staff is only interested in providing superior service to their Caucasian patrons. Will not be returning here ever again, as there are far better restaurants in Chicago - maple and ash, smith and wollensky, prime and provisions, maybe even the cashier at portillos will be more amicable than the staff at RPM :)", "pics": null}}, {"review": {"des": "Made rsvp for 7:45pm for a surprised dinner for my friend! Waited a bit because the hostess had a little confusion on our RSVP but fixed us a table right away. ***COAT CHECK AVAILABLE***<br><br>Chelsea our server greeted us right away! Super friendly and asked if it was our first time, gave us the menu and suggested some cocktails/wine! She sold me on the #P drink and the spritz & giggle which was amazing ! <br><br>For app; we order the king crab ***MUST ORDER*** only one per order ! Could of easily eaten 10 by myself ! And the fresh oyster (of the day) was BOMB'n so freaking fresh! I want lol 2 dozen of those ! Also got fondue and foie Gras torchon which was alright!  <br><br>On to the entree - we got 3 filet mignon with (1- garlic & rosemary butter and 2-truffle butters and lamb chop which was amazing ! <br><br>Sides- we got risotto with table side shaved black truffles which was HEAVENLY ! Much try! So serious & got the Brussel sprouts is bomb AF! And sautéed spinach which was alright and Mac & cheese which we wasn't too fond of. But the Brussel and risotto made it better! <br><br>Dessert - got the sugared donuts which was to die for ! comes with pasty cream and chocolate && also the cotton candy - tasted like grapes soo freaking good ! <br><br>Overall, excellent experience definitely worth it! I rsvp On opentable 2 months in advance! Gotta rsvp few months in advance !!! Crowded and great vibes type of Friday - Saturday night spot & great for date night!", "pics": null}}, {"review": {"des": "We came here to celebrate my boyfriend's birthday. I made a reservation about a month in advance. It was within walking distance from the Westin River North we were staying at. When we arrived it was packed and had we not made a reservation we would have had to eat at the bar. <br><br>Our table was not quite ready so we went to the bar for drinks. We ordered the Spritz and Giggles and the M gin and tonic. Annie was our bartender and she was friendly and sweet. She made two gorgeous and tasty cocktails for us. Not long after our table was ready. <br><br>Dritan was our server. He walked us through the menu and made recommendations for us. We started with the House Parker rolls which were pillowy soft and tasty. We also ordered the oysters and coal roasted king crab. They were so good and had wonderful flavors and were not filling to the point that we were stuffed by the time our dinner came. <br><br>For our main course we shared the cod and the bone in Kansas City strip, and for our side dishes we had the crispy Brussels sprouts and the millionaires potato. The cod and steak both melted in our mouths. The steak was served with a seasoning salt mix that complemented it very well and added extra flavor. The crispy Brussels sprouts were tasty and spicy. The millionaires potato was served piping hot and had fresh shaved black truffles on top. <br><br>For dessert we ordered the 14k gold cake and they brought out a big bowl of cotton candy for my boyfriend's birthday. The cake was decorated with flakes of edible 14k gold. It was cool and rich and a great ending to our meal. <br><br>RPM Steak has been on my list of places to try in Chicago. I am so glad that we tried it and our expectations were exceeded by the great service and phenomenal food. Can't wait to return or try other RPM restaurants.", "pics": null}}, {"review": {"des": "Came here for Restaurant Week 2018 and was expecting a 5 star experience, but was utterly disappointed...in the service not the food. We had reservations for lunch for a party of two on a Wednesday. We checked in a few minutes early, but didn't get seated for another 20 minutes. We were seated in a booth in the bar area. There was dark wooden decor and intimate lighting all around. <br><br>It took a while for our polite server to come to our table after giving us the menus and we were ready to order as soon as he finally came back. We started with blue fin tuna tartar and the pear & walnut salad. Great presentation and great taste. I could've used a few more pieces of bread for the tartar though.  The bus boys cleared our tables quick and we expected our main entrees to follow shortly. As we waited, we watched our server and other gentlemen in suits keep busy with some restocking activities. It seemed like they were setting up for dinner while the place was still full with the lunch crowd. <br><br>Our wood grilled steaks were cooked perfectly and tasted great. We finished up rather quickly and again our table was cleared, but our desserts did not come out as quickly as expected. In looking around, others were waiting for service as well and you can see the frustration on several faces as they looked at their watches. In many higher end restaurants we've dined at, a host or manager would come and ask how things are doing. To our surprise, not one person came to talk to us even while they knew we were sitting there with no food on the table. We waited quite a while again for our dessert and we actually had to flag down our server to ask for our check so we wouldn't have to wait too long again. Our apple pie sundaes were delish, but the ice cream was already melted by the time we got them.<br><br>The entire experience took nearly 2 hours, which isn't truly ideal since we were on our lunch break from work. The food is delicious, but the slow paced service can drastically impact the experience of many patrons.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/i98aa88lTGyG07cKHW7Ljw/348s.jpg", "caption": "Blue fin tuna tartar"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/p4cogs_B3C2uQz2jHUCCMw/168s.jpg", "caption": "Pear walnut salad"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/yxJUZzrN61ZW5mpON7p9GQ/168s.jpg", "caption": "Apple pie sundae"}]}}, {"review": {"des": "Loved the food, the ambiance, service and experience! I celebrated my birthday one week early here with my family and it was the best start to turning 40! We had the Mediterranean octopus, coal roasted king crab, Imperial Wagyu reserve, cowboy steak, spicy miso Maine lobster, Risotto with a decadent shaved white truffle, spicy broccolini, Japanese sweet potato, 14k chocolate cake and the baked Alaska all paired with a nice bottle of Cabernet Sauvignon. I can't say one bad thing about any of these dishes because everything was phenomenal. Raymond explained the menu perfectly! Thank you to the executive chef for the amazing food and for a one of a kind service.", "pics": null}}, {"review": {"des": "I went to RPM steak for my birthday last night. FRIDAY april 13 !<br>I had made a reservation in advance for 9:15pm. <br>I arrive at 9:10 PM and was asked to wait until exactly 9:15 PM.<br>Shortly after 9:10 my husband and I were seated.<br>We got the best seat in the house. Center booth at the back.<br><br>I was wearing really thin heeled sandals and I was very worried I was going to slip walking into the restaurant I found the floors extremely stiperly, they are tiled I believe. So I walked slow which made me feel silly.<br><br>Most of the seating in the restaurant is tables/chairs. The embeyonce is beautiful. The lighting is perfect. The bathrooms are also beautiful calcite tiled <br><br>We were served immediately.<br>Our waitress was unbelievable 5 star +++ server. We give her crazy props super friendly and just so knowledgeable..didnt rush us at all.<br><br>Being that this was the first time coming to RPM the menu was simple but at the same time confusing. We had no idea what steak to chose.<br>We were then told that it is more if a sharing concept. <br>We decided on a bacon appetizer which really flavorful 2 strips of thick bacon.<br>A imperial 12oz american wagyu beef steak.<br>A ceaser salad <br>And a truffle potato<br>(Bread has to be purchased they do not bring you a bread basket-we didn't try it)<br><br>The salad came out first  it was perfectly prepared. It came with a half egg on each plate with a piece of anchovy on the egg (because we split the salad between us they brought it our on two plates which was very nice of them)<br><br>The steak was very different ..it was prepared perfectly ! Actually what was so cool is they prepared my half medium rare and my husbands half medium well ! They could do that!!. I am not sure I love the wagyu beef I think I may stick to a regular steak like filet, ribeye or striploin next time  <br><br>All of the steaks are 12oz or higher (bone in steak,  bone is included in the weight so if it 24 oz bone in..dont expect 24oz of meat)<br><br>Their are about 4 Japanese steaks that are 3oz they range from about 100 dollars to 215 <br>I believe RPM is one of 6 restaurant in al of the USA that serves some of these cuts.<br><br>The truffle potato was great. It was basically a potato carved out mashed restuffed and had melted  cheese truffles on top.<br>Luckily I got to eat all the truffles because my husband doesnt like mushrooms hehe (18 dollars for the large potato to share)<br><br>We also got the cookies and cream ice cream/cookie dessert it was delicious (sharing $10)<br>The restaurant gave us a big bowl of cotton candy complimentary for my birthday.<br><br>The drinks we had were great. We tried a few off the menu and they each have 2oz of alcohol in them.<br><br>Our bill came around 250 with 20% tip. For one steak one salad one side one potato and 4 drinks. <br><br>The wine list is amazing wine prices can range anywhere from 30 dollars a bottle to $19000 a bottle no joke !<br><br>Overall it was a nice experience.<br><br>The restaurant does have valet parking at a cost. It is near bars if you decide to go out after. It does accommodate larger parties.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/aYZ7Vk9lPvgNa9Efmik1cQ/348s.jpg", "caption": "Front entrance walls"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/k19m-B3VlrfctB2La3zfjQ/168s.jpg", "caption": "Complimentary cotton candy for my bday"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/RKvxe4wforjswtVkoy7Nuw/168s.jpg", "caption": "Cookies and cream dessert with a candle for my bday"}]}}, {"review": {"des": "So let's start with the service. Our server was Tim who was exceedingly knowledgeable with his menu and specials. He answered all of or stupid questions about Kobe beef without making us embarrassed for not knowing, which is an awesome skill. He also had an exceedingly knowledge of the specials for the day, down to the ingredients used. This made an easy sale for my mom who was a bit overwhelmed by the menu. He was also very nice when we asked about where else to go in Chicago. It's not everyday you find an awesome server like that! <br>Now to the food: we had the seafood platter, a special of the day appetizer, raw fish, 2 types of wagyu beef: olive beef and Kobe beef. For sides we had the brussel sprouts and peppers. For dessert we had the baked Alaska( all pictures below). Was it worth it? Yes! Everything!!!!<br>It is not everyday you have Kobe beef but when it's done right where it literally melts it is so worth every cent. Seriously felt like I tasted the marbles in the beef. I preferred the olive beef more than the Kobe. <br>What makes RPM different from the other steakhouse in New York is the variety of wagyu beef they offer. So if you have some I love myself money then I'd say go for it. If you are not sure on what to order I'm sure Tim can help you decide.", "pics": null}}, {"review": {"des": "I ordered the the thanksgiving meal delivered.  For $32 the turkey involved 2 petrified, deep fried turkey thighs that I Honestly could not bite into and 4 small slices of turkey in tasteless gravy.  My dog refused to eat it.  The $12 stuffing was dry and tasteless.  Thank god I ordered a weightless salad.  For $70 on Thanksgiving, it was pathetic.  RPM didn't even try.  They should be ashamed.", "pics": null}}, {"review": {"des": "Wow, one of the best steakhouse I've been to in a really long time. Everything from the food, service and ambiance was great. We came here for a friends birthday. I got the iceberg wedge salad as a starter, which was flavored very well and fresh. My friend and I got the cowboy steak to share as our meal. The steak was flavored so well and cooked to perfection. Possibly one of the best seasoned steak I've had to date. We also ordered the corn as a side, which was also really good. Overall I'm so glad I picked this place for a birthday dinner. It did not disappoint and we will definitely be back.", "pics": null}}, {"review": {"des": "Went here with family last week on a Friday evening.  Great service from the waitstaff and the portions were good.  Prices were high but normal for a solid steakhouse that serves prime beef.  The clientele must be on expense accounts otherwise I can't see who would pay some of the prices they had.<br><br>All in all a good meal was had by all.  <br><br>The only negative was the location of the washrooms which were such a long and winding walk I wonder if it's in the same time zone.", "pics": null}}, {"review": {"des": "I have so many wonderful things to say about this experience! My husband I had the best service of any restaurant we've ever been to at RPM Steak. Even though we aren't frequent fine diners we like a really nice place every once in a while, especially while on vacation. This is the most impeccable service we've ever had. Our server took his time and made us feel like his only table. He knew the menu very well and gave great recommendations. They operate like a well oiled machine here with other staff assisting servers to make sure your water is filled and plates are cleared quickly.<br><br>Oh the food! We had the king crab leg appetizer and it is a must! It is super rich and delicious. As others have stated we just split one, but could have eaten a few each. My husband had the dry aged strip and the Caesar salad (real deal Caesar- with scratch made dressing I suspect and anchovies on the deviled egg) I had a few bites of the strip and it was phenomenal. I had the lamb chops cooked medium well. They were fantastic! Cooked perfectly, bit of crust on the outside and still juicy on the inside as well as seasoned perfectly. I also had the spicy broccolini. Broccolini is my favorite vegetable and I make it to my perfect liking at home. That being said I liked theirs a lot. It isn't too spicy, so those that don't like super spicy would still enjoy. <br><br>At the end of the meal they bring cotton candy and I just couldn't help myself from eating some. It was whimsical and fun. Our cocktails were also delicious- I had a perfect dirty martini. The decor is also very classy, yet comfortable. <br><br>The price tag is obviously substantial here, but worth every penny for the service, food, and overall experience.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Lj-PzUHKRsmmDqx9LSrRqg/348s.jpg", "caption": "Lamb chops medium well. #phenomenal"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/l1aE_-kLvjKIRcGTYmsmOQ/168s.jpg", "caption": "Spicy Broccolini"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/o-bqrlroqNdSVfKtFdHIWQ/168s.jpg", "caption": "Dirty martini"}]}}, {"review": {"des": "I went to RPM Steak today for lunch with colleagues. It's Restaurant Week and we make it a tradition to go to RPM Steak every year (3 course meal for $22). We made a reservation a few days ago for 7 people without issue, and even moved back our reservation time today when a meeting interrupted our plans. The staff at RPM Steak were very accommodating about our change and had our table waiting when we walked in at 1pm.<br><br>The waiter immediately provided menus, poured glasses of water, and asked if we wanted anything else to drink. We placed our drinks order and perused the Restaurant Week menu and saw the following options:<br><br>Starters: Pear & Walnut Salad, Butternut Squash Veloute, and Blue Fin Tuna Tartar<br><br>Mains: Grilled Mediterranean Chicken, Striped Bass Oreganata, and Wood Grilled Bavette Steak<br><br>Dessert: Apple Pie Sundae and Winter Citrus Granita<br><br>I opted for the Butternut Squash Veloute, the Mediterranean Chicken, and the Apple Pie Sundae. The Butternut Squash Veloute arrived in a bowl with curry yogurt and crispy bacon garnished with an apple chip and then the waiter poured the butternut squash soup over the top. It was cool to watch and tasted even better! The butternut squash was flavorful and the bacon and curry yogurt were a great change of texture and flavor. I love bacon and could have used a little more. As for the apple chip, I didn't quite like it. It was a really thinly sliced apple piece with the skin. Overall this was a good starter and perfect for such a cold day.<br><br>My main course arrived and it looked great. It was grilled chicken on a skewer laying on a bed of orzo with tomato and onions with a garlic sauce on the side. The chicken was nothing special. It was succulent and tender but didn't have much flavor. The orzo was definitely the best part and I could have eaten five servings of it. It was perfectly cooked and the veggies were a nice touch. Paired with the chicken it was pretty good. As for the garlic dipping sauce, it was very fragrant. I had no idea how fragrant it was on the first bite and it definitely made me cough. But in moderation it was good with chicken. <br><br>Dessert arrived and it looked good. The ice cream appeared to be vanilla ice cream however it definitely had a cinnamon kick to it. Lots of cinnamon. Four hours later I can still taste cinnamon. The salted pecan streusel was a good touch and added a bit of crunch to the ice cream however the apple was lost on me. Not bad, just not what I was expecting. In fact, if it wasn't for the tiny apple topping this wouldn't be an Apple Pie Sundae at all and rather a bowl of ice cream with pecan streusel on top. It was still good. <br><br>Overall the service was excellent. No complaints about that. Definitely 5 stars! The food was good too and for $22 the Restaurant Week menu was definitely worth it. The chicken could have been a little better as it was nothing special but I can't knock it otherwise. I'd give the food 4 stars. RPM Steak does steak and seafood really well. If I came here on a Friday night for a steak it would be excellent along with the service. That said, I'm giving this place 5 stars. Restaurant Week or not, you're going to get good food and great service.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/83o2ADScdG2_I55QB9xfcQ/348s.jpg", "caption": "Restaurant Week 2018: Apple Pie Sundae with Salted Pecan Streusel and Warm Caramel Sauce"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/3UY6HN2OrBUzZXP4JnEtzA/168s.jpg", "caption": "Restaurant Week 2018: Grilled Mediterranean Chicken with Orzo and Tomatoes"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/szyROFnfDMlWqfApLVuw5w/168s.jpg", "caption": "Restaurant Week 2018: Blue Fin Tuna Tartar"}]}}, {"review": {"des": "While the prices are not for the faint of heart, the quality of the food, the taste, the flavor really delivers. I had the steak frites; perfectly cooked, tender, perfectly seasoned. The fries were a nice twist - flat shoestrings. Millionaire potatoes, crispy baked outside, creamy whipped inside. Baked Alaska to top it off, classic. Side note about the ambience: dim but not dark, good vibe without being too loud, fantastic experience overall.", "pics": null}}, {"review": {"des": "I really love this place. BEST STEAK I EVER HAD. I Amazing service. I wish I lived in Chicago !", "pics": null}}, {"review": {"des": "This place is awesome! I tried the cowboy and the rpm steak frites. The rpm steak frites steak was super marbled and tender. The cowboy was also tender and included the bone. I thought the mushroom Mac and cheese was super gooey and chewy. Very nice complement to the steak. We ordered the octopus and the foie gras as appetizer and I thought both were amazing. The toasted bread under the foie gras was super delicious and it had some sort of orange condiment on top which made it flavorful. My favorite dessert was the chocolate ganache cake and that was super amazing and rich! I can't get enough of it but pretty sure I would be -3000 calories in debt to the gym l.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/mvuuepQVcyVj_yTgItMqdQ/168s.jpg", "caption": "Foie gras"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/7v5CDdp_YVXTrc6mV-aTXg/168s.jpg", "caption": "Grilled octopus appetizer"}]}}, {"review": {"des": "After my experience at RPM Italian, I was very excited to try RPM Steak. The reservations work the same way and if you don't have a reservation in advance there's no way you're going to be able to get a table, so I sat at the bar.<br><br>I ordered the New York strip steak and the tableside prepared risotto with freshly shaved truffles. My steak was cooked to perfection, had great flavor and a great sear, is one of the best steaks I've had in my life. Before RPM my favorite steak was at Saint Elmo's in Indianapolis, but this definitely makes a great rivalry between the two. Not only was my steak delicious but the risotto was a great accompaniment and the truffles were delicious.", "pics": null}}, {"review": {"des": "For one of the most talked about steak restaurants in Chicago, I have to say that I wasn't as wooed as I had expected to be. RPM Steak is a huge space and right away I expected to be forgotten along with my company. The service was decent, from walking in the door and checking my coat, to the food making it to the table in a timely manner. The only thing I noticed was the fact that drink orders took longer than expected.<br><br>We dined on Mediterranean octopus, truffle risotto (the featured side for the evening), Crispy Brussels sprouts, \"The Duke\" pre-cut ribeye filet, and Grilled lamb chops (a House Specialty). Starting with the octopus, I enjoyed the grilled flavors. I did feel like it was a little soft, and I wished there was more crispiness on the outside. I understand it can be hard to properly grill octopus. Grill it too much and it becomes like rubber. I think I would have been happier had it been overcooked a little.<br><br>\"The Duke\" came out and it was a little lean for what I have come to expect out of a ribeye. Still tasty, I would have preferred more seasonings. The rest of everything we ate easily overpowered the flavor of \"The Duke.\" For those who eat one item at a time off of their plate, eating this separate might have been a good idea. Only then would anyone be able to appreciate the subtle delicious flavors this tiny order of meat delivered.<br><br>A huge production was made for serving the risotto. Our waiter had our entire order. Then there was one guy who carefully set down a plate of risotto, then in his other hand, a tray of truffles sat, along with a small utensil for shaving slivers of truffle onto the top of the risotto. Watching this man distribute the shavings seemed like overkill. A nice gesture, and I may have missed the point, but I think a light sauteing of the truffles would have brought out more of the flavors of the fungi, pairing closer to the pungent cheesiness of the risotto. Otherwise I really couldn't taste anything but the cheese. <br><br>The Crispy Brussels Sprouts were absolutely fabulous, generously buttered, crispy, and thoughtfully seasoned. I didn't ask, but I could have sworn there were little bits of berries and bacon. Divine! I would definitely make this one of my go-to sides for every visit.<br><br>The older I get, the less I want a side of beef, and I opt for the unique flavor profile of lamb. I've noticed very few places will mess up lamb chops, where you can go to any steak restaurant and the beef can be overcooked or not seasoned well. I have to say, the lamb chops are a must when you eat here. All of the portions seemed small, but I got 4 perfectly-sized lamb chops and it took everything I had to not pick up that bone and chew the rest of the meat off of it! Just enough bone and fat flavored the meat and kept it juicy. I was in heaven!<br><br>Perhaps there is some kind of method to the smaller-portion madness of meats which you can encounter with RPM. At the end of our meal, I had enough room for dessert (I shared my lamb chops), and I went for the baked Alaska. I thought the risotto was a production. Again with two people, the items were brought out to serve, and basically the dessert is covered with some kind of booze, set on fire, and extinguished with chocolate syrup. My male companion is not into desserts, but both of us relished in this charred delicacy of salted caramel, vanilla ice cream, and warm chocolate sauce.  <br><br>I would consider coming here again, but it wouldn't be on the top of my list. Everyone here is friendly, and I did not feel uncomfortable for how I was dressed. I had to rush straight from work (business casual) and managed to throw on eye makeup in the Uber on the way down. To my surprise, I saw people dressed formally and casually, but not sloppy. This is a great spot for tourists, but I think I would pass for a spot more low key and with affordable parking.", "pics": null}}, {"review": {"des": "I've been to RPM steak now 3 times and went last night. This is my least favorite steak place and I'll probably never be back. Reason being- it's not a romantic date/steak house where the price should = the quality of food you'd expect to get. I got the cowboy steak $83. The Center cut filet for $22 at Trader Joe's is better. Not great food- ambiance or service in my opinion. The Waiter had my girlfriend and I get two salads that could serve 4 people for a starter. It would have been nice to say ya you can split one easily vs fill up on a kale and wedge salad that could have been your main meal. The best thing out of our starter- dinner and 3 sides was the Millionaire's potato. Everything else is not good. Not worth a $360 dinner for 2.", "pics": null}}, {"review": {"des": "I have been to RPM steak a few times but this year's restaurant week trip brought a smile on my face as the service still remains top notch and the restaurant week value is one of the best in town.<br><br>I had the blue fin tuna tartar, sea bass and the winter citrus granita which was delicious. My friend the Mediterranean chicken and the apple pie sundae that were equally tasty.", "pics": null}}, {"review": {"des": "Had my birthday dinner at RPM steak last night and had the best steak!<br><br>We ordered king crab and octopus for appetizer. King crab was only 4 oz but the flavor was fantastic - warm with some buttery taste. Octopus has interesting flavor, and the texture was perfect.<br><br>For entree, we ordered Hokkaido Snow Beef and the 120-day aged ribeye. The ribeye was an off menu item of the day since they don't have it all the time. All tasted amazing! Personally I prefer the snow beef as it literally melts in your mouth, but my Fiancé prefers the aged ribeye as it's more flavorful. <br><br>There are so many interesting dessert we wanted to try, but went with the donut. Cotton candy was the complimentary dessert for bday celebration. Overall, dinner was really good and will go back and try different dishes.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/PEpGi7zzv0bnPrJK-E50hQ/348s.jpg", "caption": "Hokkaido snow beef"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/2gCCA5IAA1kemmPyOCXSWA/168s.jpg", "caption": "120 day aged ribeye"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/K0YOcChx4hFYQsORZ-BgaQ/168s.jpg", "caption": "king crab"}]}}, {"review": {"des": "My second experience here was awesome! Everything we ordered was fresh, flavorful, and super rich! <br><br>We started with the crab appetizer which was DELICIOUS! It was the best crab I've had- so flavorful and great quality! We ordered the Cowboy steak and the scallops- both were fabulous! We requested the steak to be cut which was a good decision! <br><br>The millionaire potato was maybe the BEST part of the meal! It's amazing and a must try! <br><br>Also the G&Ts are definitely the best drinks on the menu. My BF had the R G&T and it was amazing!! <br><br>Overall the service, atmosphere and especially the food is all wonderful! Highly recommend coming here.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/4CgI6BWRp06s3MEAXdpXRg/348s.jpg", "caption": "\"R\" G&T- amazing"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/F3Bf67PVx1bkSlnUmxyaDA/168s.jpg", "caption": "Millionaires potato- a must have!!!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/z2OlkOY3vaIcNuwWpasEOw/168s.jpg", "caption": "Scallops YUM! Very filling and rich."}]}}, {"review": {"des": "RPM Steak is unquestionably a 5-star experience. The restaurant is an impressive operation, with truly incredible service. Everything from their house-made breads and specialties were memorable. I could live for 3-weeks on their Cheddar Popovers alone; perfect with their nice beer selection. Their incredible steak selection, salads and famous \"Millionaire's Potato\" are also too much of a good thing. This place is reason enough to visit Chicago. I can't wait to return.", "pics": null}}, {"review": {"des": "Another placeholder so my pictures link. I'll update with details later, but the 3 star rating holds true.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/bxbhjiVwQI4DuYzPk-D0eQ/348s.jpg", "caption": "Coal-Roasted King Crab -- lime & coriander"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/yyx97EAlScFfqnvrDmsp0g/168s.jpg", "caption": "Manhattan -- High West 'RPM', Carpano Antica, Angostura"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/0gvqLZXsoDg_uqdJqNRuVg/168s.jpg", "caption": "Nutella Bread Pudding -- banana ice cream"}]}}, {"review": {"des": "love this place! I had the bison filet and it changed my world. I'm all about that natural grass fed beef now! service was amazing so it made the experience enjoyable!", "pics": null}}, {"review": {"des": "I had very high hopes for this visit to RPM Steak! I have heard such great things and read all the great reviews from other folks, but (this may be an unpopular opinion however) I expected more from my dinner. It wasn't 5 star worthy at all. <br><br>My husband and I went on Sunday night for Restaurant Week. I noticed that none of the items on the RS menu were on their regular menu. I would have hoped to try items on the normal menu. But I get that it's seasonal. <br><br>For the first course, my husband ordered the bone marrow and I ordered the squid. Both were okay. For our main course, we both ordered the Bavette. The steak tasted good but again, I expected more. It wasn't the best steak I have ever tried. And for our last course we ordered one of each of the available desserts, an apple pie sundae and a citrus icee dish. <br><br>The serving sizes were very small and the main course had no sides. Glad our server mentioned this last minute so we ordered the cheddar biscuits and the onion rings. I found the cheddar business to be a bit dry and almost burnt. The onion rings were very good! <br><br>My husband ordered a couple cocktails; the first, sixty-six parallel, looked beautiful but my husband was thrown off with the floating bits of dried strawberry in there. The 2nd cocktail was a standard manhattan. <br><br>Again, I really had high hopes but I feel like each dish missed the mark.", "pics": null}}, {"review": {"des": "This is up on the list of best meals I have ever had!<br><br>On a recent trip this was on the list of \"must haves\" from my Chicago born and raised friend. So, we made it a must do. Having a friend that knew people he got us on a list and had us sat at a great table. We ordered drinks from the bar but also immediately ordered a bottle of wine. As for the food we ordered what seemed like the entire menu, grabbing a few appetizers and different entrees that we all shared family style- in the interest of wanting a bite of everything. I can say with confidence I did not put a piece of food in my mouth that I did not love. The salad was amazing, the steak was delicious... everything was delightful. <br><br>Make this a must do on your list!", "pics": null}}, {"review": {"des": "Amazing as always the food is incredible the staff is beyond phenomenal and the food is 10 stars. <br>Can't wait to come back again and again. <br>great job guys!", "pics": null}}, {"review": {"des": "I'm a Giuliana and Bill fan so wanted to try their steak restaurant. Wasn't sure how it'd fare compared to others in this steak town. Steaks were the highlight and delicious food all around. 4.5 stars <br><br>Food: 4.5, Service: 4, Atmosphere: 4.5<br>Cost to worth it rating: 3 (apps ~$14-$20, $43-$200 steaks)<br>Return worthiness: yes<br>Kids menu: no<br>OpenTableable: yes<br>Eve award: American wagyu preparation <br><br>Highlights:<br>- American wagyu: got convinced to try this offering being sold on it being a cross between a filet and rib eye. Accurate representation as it was super tender inside with the firmness and peppery seasoning of a rib eye as the outside layer. Came sliced for a nice presentation and easy eating. 4.75 stars <br>- Cowboy ribeye: great cut of meet with great flavor. Solid choice for the hub. 4.5 stars <br>- Truffle risotto: off-menu item we tried a half portion of to share and it was decadently delicious. Tableside shaved truffle on top of a cheesy pile of risotto. We just had the truffle pasta at Spiaggia the night before so weren't expecting much but it held its own. 4.75 stars<br>- Heirloom tomato burrata: lovely red and yellow tomatoes with large dollops of burrata on top of pistachio pesto finished off with tiny basil leaves. Quality ingredients and refreshing combo. 4.5 stars <br>- Bacon: more like chunks of pork belly with a maple glaze topped with a small slice of a hot pepper. Rich, meaty, and a bit fatty but 4 small pieces so manageable. ;-) 4 stars<br>- Atmosphere: hip and not overly fancy. Not an old school Chicago establishment with a dark dining room. They played fun hit music in the background.<br>- Brussels sprouts: just the crispy outsides with a little spice afterkick. 4 stars.<br>- Welcoming to families: we bring our 7 year old to many restaurants that say \"not good for kids\" on Yelp as he's well-behaved and used to being out. As long as there's an item on the menu he can eat, we're fine. Not one with a kids menu or anything but wasn't sure how uppity this place would be, so was glad to see lots of other families there for special occasions. <br>- Burger: hefty meat patty. We got it plain for the lil dude and asked if they happened to have a plain roll instead of onion and the waiter didn't bat an eye. 4 stars <br>- Parker house rolls: my son loved this warm circular loaf you could tear off individual rolls from. I liked the coarse salt finish on top. He's a bread boy so we had to cut him off to make room for his dinner. ;-) 4 stars <br>- Wine list: extensive from inside and outside of the country. Could find a variety of options for I'd say $75 and up which isn't bad for a steakhouse. <br><br>Midlights:<br>- Fries: we were of mixed opinions on this. Meaty potato In N Out style and I enjoyed the rosemary but my husband was looking for more crispy. 3 stars <br>- Baked Alaska: fun to have the mini cake flambed at the table but tasted like nothing special. 3 stars<br>- Waiter: his salesman style was a bit much for me. Knowledgeable and enthusiastic about the menu with good recommendations was appreciated. However he was over the top name dropping fine dining restaurants across the country and touting some of their menu items as the best in the world, coming off as condescending.<br><br>All in all enjoyed our meal here and we'd even say it was our favorite of the trip. I'd recommend it and come back. Congrats on another winner for you, Giuliana and Bill. 8-)", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/bbhkQrZX4LrWwYpd28mxhg/348s.jpg", "caption": "Truffle risotto delicious 4.75 stars"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/vmsJK-PHNbNW7NEyRdBTjQ/168s.jpg", "caption": "Baked Alaska. Fun with fire but not that tasty 3 stars"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/e09Tv4HC9AyAEsnSO5I5rA/168s.jpg", "caption": "American wagyu: tastes between filet and rib eye. Yum!4.75 stars"}]}}, {"review": {"des": "K so used to have a favorite steakhouse in NYC till I wondered into this place....DAMNIT!  K so errrything I had was stupidly outrageously delectable starting wit cheddar popovers, tiger prawn(shrimp cocktail on steroids) Bernie Miller Chop(bone-in ribeye) chocolate cake...no I mean DECADENT, RICH Think waterfall RICH! Stop reading this and go right freaking now!!!!! Mr Scott O'Brien was my server..extraordinarily knowledgeable in all things cuisine and 1 Hell of a gentleman.  Top tier American Steakhouse!!!!", "pics": null}}, {"review": {"des": "My boyfriend & I tried this restaurant last night for my birthday dinner. And he loved it right after taking a bite of the steak our server recommended. He thinks it's worth coming back and want to be our go to restaurant for special occasions. As for me, it was a yummy steak but worth going elsewhere. Specially since I didn't know they put a lot of cheese on the salad and side vegetables without asking. But no worry, I just made my bf ate it all. However, RPM steak---you got me at dessert. The baked alaskan was cool to watch & after taking a bite...I must agree with my bf that it can be our restaurant for special occasions. Totally worth coming back!", "pics": null}}, {"review": {"des": "I was visiting Chicago from NYC. One friend suggested RPM Italian, originally, however I opted for RPM Steak. It was a low key, quiet upscale place. They have ample seating at the marble top bar. They have tables for groups as well as more intimate tables for two. We sat upstairs which I appreciated. The service was excellent and the server was well informed at what the restaurant had to offer. During desert, complementary cotton candy (not your average) and cookies n cream ice cream were served along with what we originally ordered. I couldn't be more pleased with the experience. <br><br>Ps. Spend the extra bucks for the butter", "pics": null}}, {"review": {"des": "This is one of my favorite steak houses in Chicago. If you are going to splurge this would be a good place to do it. The atmosphere is great. It's a great place to come and work during the day and have a bite to eat as well as a great place to have a date night.  <br><br>The food is delicious. My favorites are the thick cut bacon, coal roasted king crab, hamachi and avocado sashimi, broiled black cod,the duke, cowboy steak, onion rings, Japanese sweet potatoes with bacon, and Brussel sprouts with bacon of course.<br><br>There are many more items I can't wait to try but this is a must try restaurant.", "pics": null}}, {"review": {"des": "Service: Best that I've ever had at a steakhouse.  our server was knowledgeable, made great recommendations and had impeccable timing for delivery of the food.  She was great!  Wish I could remember her name.<br><br>Ambiance: Music was a little bit too loud for my liking, but this is more of a \"hangout and eat fancy steak\" rather than a \"eat fancy steak and hang out\" type of place.<br><br>Prices: Moderate to high for what you get<br><br>What we got:<br><br>- Hokkaido Snow Beef (rarest wagyu)- not my dish, but again, I was not a fan of this wagyu.<br><br>- Miyazaki A5 wagyu- OK.  Definitely not the best wagyu that I have ever had, but I do appreciate that they only put salt and pepper.  <br>This was not a tender melt-in-your-mouth cut of wagyu.<br><br>- Millionaire's baked potato w/ shaved black truffle.  Oh, truffle.  The smell of luxurious eating.  While tasty, I'd pass on it in the future.  The amount of truffle was just overwhelming.  It seemed like it was \"there just for the sake of being there.\"<br><br>- Mushroom mac and cheese- I hate mushrooms and this was the star of the show for me.  PLEASE get this.  This is a not-to-miss dish!  I loved this.  Not to mention the delicacy of the cheese, perfectly cooked pasta, and the crispy mushrooms on top.<br><br>- Hamachi and avocado sashimi- I've been spoiled with sashimi/nigiri by Nobu, so I cannot fairly judge this.  It was pretty good <br><br>- Parker house rolls- I'd pass next time.  Good, but not worth $6.<br><br>- Spritz and giggles cocktail (sub Belvedere for Grey Goose).  Amazing cocktail with hints of mint, lemon and raspberry.  Delicious!<br><br>Overall: I'd return, but not for the wagyu.  Booth seats are very comfy and provide a great view of the restaurant!  Plus, you can't beat cotton candy at the end.  Makes you feel like a kid again :)<br><br>What you can't go without:<br>- MUSHROOM MAC AND CHEESE!", "pics": null}}, {"review": {"des": "Uhm well it's a sexy restaurant and very popular because of the celebrity owners. The actual restaurant is very gorgeous but no different than any other new steakhouse in Chicago.<br><br>Service is always top notch and the food is good. I'm definitely not wow'd by their menu because i think their steaks are missing flavor. I'm a Kansas Strip girl and i just wasn't impressed by their cut. <br><br>Their seafood tower is gorgeous and the shrimp is as big as your head. I must say that they drinks are amazing and very well balanced.<br><br>If you're single in the city and want to meet a hot woman/man you can also come hang out here and your mission will be accomplished. (Just being honest )", "pics": null}}, {"review": {"des": "The Miyazaki wagyu steak and brussel sprouts were both INEDIBLY SALTY. The 28 day dry aged cowboy steak was not much better. I generally love salty things but this was too much. The steaks also came out cold (I know steaks should rest after they're cooked but this was also too much). Even without the salt issue neither steak were life-changing. <br><br>The manager kindly comped us about $70 off of our meal. Overall I was incredibly disappointed though, especially for the price. <br><br>I drank an old-fashioned that was great. The onion rings were great. For some reason they brought us cotton candy as a complimentary dessert. Who wants cotton candy? At a steakhouse?", "pics": null}}, {"review": {"des": "Cool place, and definitely recommended for 20s-30s-early40s classy/modern bar/restaurant experience. Decor and people just made it feel like an \"we're it\" type place.<br><br>We sat at a booth & ordered cocktails & wine. Both were outstanding, & again the service was just awesome.<br><br>Also ordered Alaskan king crab, sashimi, halibut, and the billionaire potato. When I come back, I think the only thing I'd reorder is the potato (I'd wanna try more of the menu). Everything was very good.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/rd4Ipr8FKnsI87DLeN7Vaw/348s.jpg", "caption": "Baked Alaska. OMG order this."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/AyYawXT0qfVBxKcFD0HoJg/168s.jpg", "caption": "Beet salad"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/TCFM6RcYIRFvTBrgXOTtEg/168s.jpg", "caption": "King crab on salt. There was a bunch of sauce on the crab meat. Was good, but probably wouldn't order again"}]}}, {"review": {"des": "I decided to treat myself to a pre-birthday lunch and chose RPM Steak.  As it turns out, they have an executive lunch option, that is, three courses for $26, which was great.<br><br>I started with a kale-based mocktail (I can't remember its actual name).  I wasn't feeling it upon first sip, but it grew on me.  The flavors were definitely interesting.  My first course was the chilled green gazpacho, and it looked beautiful, as did all the food.  Presentation is certainly a strong suit.  I thought the gazpacho tasted good, not my favorite item, but still good.<br><br>My main course was the steak frites.  The steak was cooked nicely, but could have used some salt.  That caught me a little off guard given that steak is literally in the restaurant's name.  That's not to say it wasn't good, just a touch a under seasoned. <br><br>But the dessert was absolutely amazing.  I chose the peach cobbler sundae and I had to restrain myself from licking the bowl.  It was a wonderful way to end a good meal.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/WlkEwUvg-ybkQp_xIiVMIA/348s.jpg", "caption": "Peach cobbler sundae"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Ec6tu6gFvDA2RSqGcDj56g/168s.jpg", "caption": "Steak frites"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/gCPu-0dFjK46XonUTFWvVA/168s.jpg", "caption": "Chilled green gazpacho"}]}}, {"review": {"des": "WOW. I had the Imperial Wagyu and it was amazing,  I have no words. I had it with the black truffle butter but it honestly didn't need it, it melted in your mouth. For appetizers we had the oysters (New Zealand) and they were so good we ordered another dozen, the thick cut bacon was savory and a little bit of spice (it was perfect). Octopus is a must!!! As well as the kale salad, which was tasty as well. Completely blown away by this place.", "pics": null}}, {"review": {"des": "I took my fiancee here for his surprise 40th birthday. And we loved it!<br><br>First, we love bread and we are very particular about our carbs. So, when they brought out the Parker Rolls, it was amazing! It was warm and soft inside. It was perfect to spread the butter on it. I wanted to take a whole one home.<br><br>Then, we bought had the steak because it is obvious to order the steak. It was good but it wasn't the best steak I've had. The one he had was a little tough for a medium cook. I had the Filet Mignon and so it was pretty good. For its price, it wasn't spectacular. Although, I do appreciate the free cotton candy because we also love our sweets.<br><br>We are pretty easy to please with the little things but the steak wasn't the best. Overall, it was a fun date place to go to. <br><br>Would I go again? Maybe.", "pics": null}}, {"review": {"des": "My go-to steak house in Chicago!   Love everything about this place but especially the atmosphere and friendly service.   You can't beat the quality of good at RPM and their wine list is to die for.   Make this place the top of your list when in Chitown", "pics": null}}, {"review": {"des": "Maybe I had my expectations high as we went here with a group of 8. The steak (bone in filet) was of good quality and cooked very well to order. The staff didn't seem very interested in explaining the meal preps when asked in detail. I'm used to very knowledgeable and eager servers when I go dine at this tier steakhouse.", "pics": null}}, {"review": {"des": "RPM is amazing!! We were in a nice booth, that I would recommend! <br>I can't wait for the new one to open up on the river walk!!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/oVsphbxTqxhcHoOXwSvfow/348s.jpg", "caption": "Great birthday dessert!"}]}}, {"review": {"des": "Amazing!!! Everything about this place was just that! I came for my birthday with my family of 5 and it was perfection! Hands down one of the best dinners ever! Our Server Anthony made it even more special, one of the best servers I've ever met. He was so nice and so attentive, all his recommendations were so good! Visiting from California and coming here to RPM Steak is definitely going to have me coming back for more. Yes it's pricey but worth it and took many pictures to remember all of this. <br>RPM Steak come to LA !!!!", "pics": null}}, {"review": {"des": "Hands down the best steak house experience!!!<br><br>Initially I was stand-offish bc the name RPM is associated with boushy - with the lambos parked outside, older men with buttons open and and plenty of suburban mommy posse with their range rovers cougaring it up. People are trying to be seen and noticed. <br><br>But then you realize this place has every reason to be bc it is the best of the best in food, and despite being very pricey, it is well worth it. Lol I would say the food is more boushy over the top!!!!<br><br>Seafood tower is a must - get ready to have colossal shrimp the size of your hand. Amazing king crab, lobster, and perfectly prepared oysters <br><br>You must get their signature wagyu - it is melt in your mouth perfection. Also their 90 day dry aged signature reserve steak.<br><br>Service was excellent, and we had such a blast.<br><br>I will come back again and again, and highly recommend it to all.", "pics": null}}, {"review": {"des": "Came here with co-workers and had a really nice lunch.  This is a solid high-end place with lots of space and great service.  The food was delicious and spot-on, and the wine selection was wonderful.  My co-workers loved their old fashioned's, and I had a lovely crisp French Chablis.<br><br>I had the lunch pre-fix menu which included an app, entree and dessert.  Their watermelon salad was a delicious, inventive take on a traditional watermelon/feta/mint salad, and paired perfectly with the Chablis.  I had the wood-grilled striped bass which was flaky and cooked to perfection, and then the peach cobbler dessert was really the perfect ending to a nice meal.  Overall a good place to come for a special occasion or nice work meal!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/yr0lUt5UODvfi-qRDM8LxQ/348s.jpg", "caption": "Watermelon salad - crisp, refreshing and very tasty"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ZVMSKfKmeAl5zNxUPE3tjw/168s.jpg", "caption": "The burger"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/hPdEbd98shdv-u9CDNzDnA/168s.jpg", "caption": "Wood-grilled striped bass. Perfection!"}]}}, {"review": {"des": "We enjoyed dinner here in March. The atmosphere of this place is top notch. It's a jeans and nice shirt or sports coat type of place. It's a trendy place with great service. We sat at the bar before dinner to have a drink and the bartender was friendly. The servers really know their stuff here and can give good suggestions. Our appetizer was the king crab leg which was buttery, tender, and delicious. I had the New York Strip Steak with a Manhattan and it was fantastic.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/DYDU5Y3HTS6KLZkj-pWK2Q/348s.jpg", "caption": "Restaurant interior"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/N8BEo0c3bCeRa5f-cgQ_XQ/168s.jpg", "caption": "Perfectly cooked medium Strip"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/rQDDpNp0-dyVxAtzZHqJwg/168s.jpg", "caption": "New York Strip"}]}}, {"review": {"des": "Stop by for dinner after an event and got the crab, Cobb salad, lamb chops, mushrooms and carrot cake for dessert.  The food wasn't that bad, actually most of it is 2 stars.  I hate sending food back but we had to send back our mushrooms because every bite tasted like you were biting into a salt rock.  The service was pretty slow and it took forever even to get a glass of wine refilled.  Basically had to order one half way thru the previous glass.  Disappointing because I really wanted to love this place but everything was just okay.  The quality seemed okay so giving it 3 stars instead of 2.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/jYIdoHiIMycb_flZ76142g/348s.jpg", "caption": "Platinum Carrot Cake"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/LUBi-EQea7uTuvRin-hflw/168s.jpg", "caption": "Hedgehog & Asparagus"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Ka7HtmWTCb-6AUSlmJhTAA/168s.jpg", "caption": "Grilled Lamb Chops"}]}}, {"review": {"des": "We just got back from our anniversary dinner here. We had to wait about 20 minutes for a table even with reservations. However, we got awesome booth seats. Upon seating, we were given two glasses of champagne on the house to celebrate our anniversary. We were really hungry, so we ordered a lot of food. We ordered the Alaskan king crab leg, oysters, and grilled octopus for appetizers. For the main, we ordered A5 wagyu, bone-in ribeye, and the miso black cod. For sides, we ordered shishito peppers and rosemary sea salt fries. For dessert we ordered the baked Alaska. Everything was delicious. The portions are decent. We finished everything except the fries. We were also given complimentary cotton candy with \"Happy Anniversary\" on it. <br><br>The prices are on par with similar restaurants at this caliber in Chicago. My husband is a Capital Grille fan for steaks, but even he said the ribeye was better here. Bill and Giuliana Rancic also sat at the next table. That was pretty cool. I've been to all of the RPM restaurants many times, and this is the first time I've seen them. The only thing that kept me from giving it a five stars is our server (Alexa). She was friendly, but kept disappearing for long stretches. We had to wait very long to order dessert, and also to get the bill. I also had to ask another server to add my LEY points to my account because I couldn't find her. Overall, the experience was very good. I'll be back for sure.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/cHFQ3fnK8sxqhB-27gdmug/348s.jpg", "caption": "Alaskan King Crab Leg"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/E2vJlF-qxV3ZaTmIZ_b9oQ/168s.jpg", "caption": "Miso Black Cod"}]}}, {"review": {"des": "Great place to visit if you're out of town and on an expense account :)<br><br>Great location at Kenzie and Clark, it is a big room for sure.  I like that the dining room is a couple of steps below the bar area, which is also expansive and with tables as well as the bar.  Sitting at the bar, you can see the dining area, but not the patrons.  <br><br>Booths provide privacy and intimacy, and the lighting is not too bright, so it is good for dates too - with special ones because this place ain't cheap.<br><br>I was not too hungry, so I had the coal crab appetizer and the Ceasar Salad.  The appetizer was amazing.  The crab is served in its open shell with what I think is a light bechamelle based sauce and warm.  Very very nice.<br><br>The Ceasar was excellent, with real anchovies, half a deviled egg, and of course real parmesan cheese.<br><br>The vodka martinis were superb.", "pics": null}}, {"review": {"des": "So as everyone saw, Admir of RPM Steak followed up with me.  I emailed him.  No reply.  I re-sent the email.  He replied inviting me back and desiring to know my address to send me a gift card or something for my retry.  That was months ago.<br><br>Update 10-03-2018:<br><br>Admir missed my original emailed reply, apologized, and then sent me gift cards inviting me back to RPM.  I'll graciously accept and report back once I am able to get over there.", "pics": null}}, {"review": {"des": "The steak is served with a sweet and good taste. The meat is also very tender which was surprising. The serving amount is good considering the price. Please bring your favorite drink as the Iced tea is a little blunt and too expensive for its price and taste What makes RPM different from the other steakhouse in New York is the variety of wagyu beef they offer. So if you have some I love myself money then I'd say go for it. Good food, excellent service and good ambiance.", "pics": null}}, {"review": {"des": "Three of us dined here while in town for a girl's trip, and two out of three of our reactions to the food was, \"meh\". It wasn't great but it wasn't terrible...somewhere in between. <br><br>We had reservations and due to Chicago's traffic and inclement weather, we were running late. We notified the restaurant and they were very accommodating. They also honored our request for a booth, which was appreciated. Our server was attentive enough and pleasant, although we had to ask for the specials. <br><br>The drinks were good. I had a sidecar and my friends had two other mixed drinks which tasted fine. I was hoping to have a glass of Cabernet, but the wine by the glass selection was limited and did not have a cab on it that I enjoyed. <br><br>The food was below my expectations for a five star steakhouse. In all we ordered two hand-cut filets (medium), a seared king crab dish (not on the menu), spicy broccolini, brussels sprouts, and mac and cheese. The filets were cooked well, but very bland. They even brought out extra seasoning without being asked, which should tell you something. The \"spicy\" broccolini was not spicy at all but was still decent. The Brussels sprouts were delicious, but the way they're prepared (separated and leafy instead of halved) is annoying, to say the least. The leafy sprouts were difficult to pick up and eat. I did not try the mac and cheese, but my friends commented that it tasted good but had unnecessary dried mushrooms on top that added nothing to the dish. Now, the crab...the crab was to die for! It was the best part of the meal and I was disappointed that I hadn't ordered it. The server said the restaurant took it off the menu because they sold out of it so often, and I honestly see why. <br><br>What bothered me most about the dinner was the dull steak knives. They were so dull that you had to tear through the steak and could barely cut through the broccolini. This type of attention, or lack thereof, to detail is what separates five star steakhouses from the others. Also, the servers apparently wear white suit jackets while the runners and other staff wear vests or black jackets. The white suit jackets are terrible to be honest. They're unlined and many of them are far too tight. This may seem like a minuscule detail, but I'm surprised that management has not changed this. <br><br>In all, out of all of the great steakhouses in the city, RPM did not cut the cake. It's trendy and a place to see and be seen, but that's about it to me.", "pics": null}}, {"review": {"des": "The ricotta cheese in this place are amazing the desserts are wow<br>And the steak are pretty good", "pics": null}}, {"review": {"des": "Phenomenal steakhouse, great service and atmosphere! Faves include coal roasted king crab, steak tartare, the Duke, millionaire's potato w shaved black truffles, hasselback potato, and Brussel sprouts! 14k chocolate cake is decadent!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/lnHu8BsfY9rWSdUpK3ZlLA/168s.jpg", "caption": "14K Chocolate Cake"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/4ASO315JIAbdhm0RoWezIA/168s.jpg", "caption": "RPM Old Fashioned"}]}}, {"review": {"des": "The 40oz Mishima Tomahawk Wagyu plus a couple of sides made it a perfect meal for a group of four! <br><br>Some of the vegetables we ordered include:<br>- Mushroom Mac & Cheese<br>- Coal-Roasted Cauliflower <br>- Mr. Price's Whipped Potatoes <br><br>Honestly could not complain about any of their dishes! <br><br>Our server was very charismatic with amazing service. Our meal also came with a complimentary cute cotton candy dessert at the end.", "pics": null}}, {"review": {"des": "Came at 12:30pm on a Friday. I had made a reservation on open table and was promptly seated. Tried the executive lunch (3 courses for $26). What a great deal! For the appetizer, I had the tuna tartar.  For the entree, I had the steak and frites. (not the best steak ever or anything, but def worth it for the value). for dessert, i had the doughnuts. left feeling very stuffed!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/MeAF5t5-I1XEPbNfj2bepg/348s.jpg", "caption": "Steak and frites"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/bNQaZhxd8A2mm1onGSa7-Q/168s.jpg", "caption": "Doughnuts"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/vCSB5jKySgI3EURUJ-rhIg/168s.jpg", "caption": "Tuna tartar"}]}}, {"review": {"des": "I come for the King Coal Crab!!! It's GOOOOOD. OK bye.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/_s1ciiyBQspamhett3PQmg/348s.jpg", "caption": "Lobster ♡"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/psm5r_zFA_fZyqFTdRpWpg/168s.jpg", "caption": "vanilla sugar donuts ♡"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Z-bGTxEqTLSMMzx6Wo8xTw/168s.jpg", "caption": "king coal crab ♡"}]}}, {"review": {"des": "Second visit! Came here with my boyfriend and had the full appetizer, entree, dessert experience.  Service is always great here; servers are very knowledgeable of the menu. Always ask for their recommendations! They will not disappoint.<br><br>Appetizers:<br>Parker House Rolls - Friends, these buttered rolls melt in your mouth, and the rosemary butter that comes on the side is so good! (4.5/5)<br><br>Iceberg Wedge Salad - Also good. Comes with a couple pieces of well-cooked, thick bacon (yum!). You have to rip off the lettuce as you eat it since it's in wedge form.  I think after eating this, I prefer all my salads not in wedge form because I'm lazy. (4/5)<br><br>Entree:<br>\"The Duke\" (10 oz Ribeye Filet) - This steak restaurant knows how to cook steak! Very tasty. I'm a huge fan of the steak salt.  It comes with the salt on it but they also give it to you on the side.  The steak by itself though is extremely delicious. (5/5)<br><br>New York Strip (16 oz 28 day prime dry-aged) w/ rosemary/garlic butter - My boyfriend describes it as \"wowza in [his] mouth.\" He was so glad he got the butter on top, per the server's recommendation. (6/5)<br><br>Side:<br>Crispy Hasselback - tasty! Kind of like chips but 100x better. Crispy on the outside, soft on the inside. Just like how I like my cookies! (4.5/5)<br><br>Dessert:<br>Doughnuts - I got this during my first visit and it melted in your mouth (yes, a lot of the menu items melt in your mouth).  However, this time around it wasn't as tasty as I remembered but still good. Wished we got the Baked Alaska instead. (4/5)<br><br>Wine:<br>Cabernet \"Heritage\" - Solid wine. Complimented the steak well. (4/5)", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/3C2zB_4S4PcsRqMlVnNnlA/348s.jpg", "caption": "The Duke"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ujRg4Fonz_ixAUQs__8sfg/168s.jpg", "caption": "Doughnuts"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/9pSapOJZ06a4nuIlrob8WA/168s.jpg", "caption": "New York Strip with rosemary/garlic butter"}]}}, {"review": {"des": "Food and service are always outstanding! Tonight Josh was our server. He went above and beyond to ensure our visit was nothing short of amazing. He had excellent recommendations. Will be requesting him on our next visit.", "pics": null}}, {"review": {"des": "Pretty darn good! <br><br>I love the decor and overall upscale atmosphere. It's a very big restaurant and they have seating upstairs as well.<br><br>I like that the staff is very personable and they are not uptight at all. A few of us split our steaks and they didn't seem annoyed. They also let us do split checks and didn't seem pissed about it. Our waiter was very knowledgeable about the menu and ingredients.<br><br>I split a $40 filet minion but it was so good that I wish I splurged and didn't split it. They cut it in half for us and served it on two different plated which was nice of them.<br><br>Some of the more expensive steaks are huge and could more easily be split but if you get the filet just get it for yourself. <br><br>The side dishes easily serve 2-3 people. The millionaires potato is a must!!! Mouth watering good! Twice baked potatoes are hard to cook so this definitely isn't something you could just easily make yourself. It's big but I would just split with one other person because of how tasty it is.<br><br>We had the popovers before dinner. They come in 3's but are very big and airy inside. The butter served with it is delicious. Our popovers were a little over cooked so they could have been better.<br><br>After dinner our waiter brought us cotton candy. Who could not go for some light fluffy cotton candy after dinner? <br><br>Great experience, I will be back!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/WR9WeNDYmJri4YXjfS_Ccg/168s.jpg", "caption": "Cheddar pop overs - huge but airy a little over cooked"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/rIelqtYvYz8prU7Y50EBFA/168s.jpg", "caption": "Millionaire's potatoes- so good"}]}}, {"review": {"des": "RPM is the perfect restaurant for my 400th review on Yelp.  Just like RPM Italian, getting a desirable reservation can sometimes be tough at RPM Steak.  It would be wise to secure a reservation weeks ahead of time if you want to come for dinner here.  Overall, I believe that RPM Steak provides excellent food, service, and a luxurious ambiance.  <br><br>RPM Caesar Salad (7/10)<br>I rarely order Caesar salads at restaurants, but the description on the menu made it sound more interesting than your average Caesar salad.  The amount of dressing on the salad was perfect, and did not make the lettuce too damp.  Having anchovies as one of the listed ingredients is one of the main reasons I ordered the salad.  There were hardly any anchovies on the salad, so it didn't really make the salad that interesting.  <br><br>Cheddar Popovers (9/10)<br>These popovers were much larger than I expected.  5 of us shared 2 orders of the rolls (each order comes with three), and we barely finished them.  Luckily, the popovers aren't too dense.  The prosciutto butter that came with the popovers was really good and unique.  The popovers are worth trying.  <br><br>Millionaire's Potatoes (10/10)<br>YOU MUST ORDER THE MILLIONAIRE'S POTATOES! I actually never imagined myself ever paying almost $20 for a baked potato, but this isn't your average baked potato.  The cooking process and ingredients all make it a worthwhile treat to go with your steak or meal.  The size is the perfect amount to share between 2-3 people as a side.  <br><br>Cowboy Steak (8/10)<br>I'm familiar with most of the different cuts of steak, but the cowboy steak was a new one for me until my visit to RPM.  Our waiter gave the members of my table and I very informative descriptions of many of the different steaks on the menu.  The Cowboy steak is a very good steak option in the under $100 price point.  Even though I've had steaks from other places that I've liked better, I would definitely try another type of steak from RPM again.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/IC45h_HWV3VsWGE5BsdVoQ/348s.jpg", "caption": "24 oz cowboy steak"}]}}, {"review": {"des": "This was the dinner we were all waiting for on the bachelor party. We had a group of 14, and although they couldn't sit us at the same table, we had two tables of 7 next to one another on the floor. Our table ordered drinks to start which consisted of martinis and old fashions. It was one of the best martinis I've ever had. So perfect. We then ordered a bottle of wine for the table.<br><br>Starters:<br>We ordered a dozen oysters for the table, cheddar popovers that come with prosciutto butter, Parker house rolls and the special burrata of the night. My god were all these good. I'm such a sucker for the bread, and it was perfect. Fresh oysters, prosciutto butter, I mean I could've be done from that. Finished it with their creamy burrata, boom.<br><br>Entree:<br>I ordered the bone-in KC cut. It cut like butter, and was probably the best piece of meat I've ever had. I tried to get a truffle butter on top, but he said I didn't even need it. I can't say he was wrong. It was amazeballs.<br><br>Dessert:<br>We were given the vanilla sugar doughnuts on the house which melt in your mouth. I'm not much of a dessert guy, but I couldn't stop eating. And of course, we got the 14k chocolate cake. Words can't explain how decadent and chocolatey it was. Best chocolate dessert I've had.<br><br>Between the food and the excellent service, it will go down as one of the best restaurants I've ever been to. I'm looking forward to returning and getting the same thing all over again.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/yCNQzrK741jvVmT3-Xy39w/348s.jpg", "caption": "14k"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/diLzHK8bO0enRs45GNupGQ/168s.jpg", "caption": "KC strip"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/MpgA_MiN5S5TmLu-GOgSRA/168s.jpg", "caption": "Burrata"}]}}, {"review": {"des": "Delicious. Wagyu... A+. Everything was great. Probably ruined steak for the rest of my life haha", "pics": null}}]}