{"name": "safehouse-chicago-chicago", "reviews": [{"review": {"des": "This was my second time here and my first time bringing my little brother. He loved every moment of it! I would like to shoutout Agent Enigma. All of his magic tricks blew away my brother. We were in the area for the lights festival but my brother said that the highlight of his night was watching Agent Enigma perform magic tricks. Also a huge shoutout to Agent Tinie, our awesome server! He was very attentive and very friendly.<br><br>The food and service were really top notch. I would not hesitate returning in the near future.", "pics": null}}, {"review": {"des": "What a fun place this is! Yes, even as a 20-something year old. <br><br>My friends and I came here as an activity/lunch get together. We went into the testing area not knowing what was going to happen. We did a mission to get cleared and when we made it into the restaurant, the hosts were clapping and calling us agents. I made a reservation but it wasn't too full yet. It did get full later on though. <br><br>I love how in theme everyone is! And how excited the kids get looking for clues and checking missions off the list. The space is bigger than I thought and has some cool spy gear, but it is more exciting for kids who still have their imagination to make it an adventure. <br><br>The food was better than I expected. For the table we ordered the fried cheese curds and poutine and the Bang & Burn shareable cocktail. The curds were my favorite, the poutine was good, and the cocktail was refreshing. <br>I ordered the Provocateur burger. The menu had me at 'spreadable Brie and bacon jam.' I'd give it a 4/5<br>My friends enjoyed the Mission Impossible Burger and Licensed to kill Mac and cheese as well. The dishes are huge! One is enough to split between two (if you're into that kind of thing, haha). <br><br>My favorite parts were the spy-themed lingo and the exit. It was kind of bogus you have to pay $1 to use the elevator, but where you exit and the looks you get make it worth it.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/8snHlzjPMbxRLIrM6pVmvA/168s.jpg", "caption": "Poutine and Cheese curds"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Z-SzfL-xDlAfGUH_8eDD5g/168s.jpg", "caption": "Bar area"}]}}, {"review": {"des": "This was an uneventful dining experience.  If you decide to go here, you're either gonna love it or really hate it.<br><br>We really hated it. *<br><br>I went with my two kids and husband on a Saturday night.  SafeHouse is not that hard to find. But don't expect to come up to a big sign.  We opened a red door and found a guy sitting at a desk in a small room.  You need a password to go further into the establishment, and if you don't know it, you'll have to do some crazy things.  (BTW, the password is not Kanye). <br><br>After we got pass the first step, we were taken into the main dining area.  SafeHouse looks like a haunted house, except with spy stuff scattered all over the place.  We sat in a dark corner and were told to choose spy names for the rest of the night.  The kids loved this but my husband and I were like WTH?  The menu is fixed, meaning you get a drink, app, and a sandwich or burger for $30.   I was having second thoughts about not going to the shake place for a burger down the street...I can tell you that the food was NOT worth $30.  Do the math for 4 people.  OVERPRICED.  <br><br>The best part of SafeHouse was leaving.  I don't want to spoil it for others so I'll just leave it at that.<br><br>I give the food one star and the ambiance two stars.  We will not return.  It's not worth the price.<br><br>*Kids love it, though.", "pics": null}}, {"review": {"des": "I'm a fan of SafeHouse, whether here or in Milwaukee.  I think it's an interesting concept that is memorable for guests.  Normally, we have a 5 star experience, but the last time we went it was a bit chaotic.  Let's get that out of the way first.  <br><br>We visited on a Saturday night and had 9:30 pm reservations (the earliest we could get for a group of 8).  We weren't seated until 10pm ... even with the reservation.  There didn't seem to be a good reason, either. <br> However, our server was great and we got the super cool umbrella table!  It was pretty toasty in there, but the cool table was fun.  <br><br>Normally, we really enjoy their food and gravitate toward the cheese curds, mac and cheese, and burgers.  I think everything we've ever ordered has been tasty since it's a scratch kitchen. <br><br>Also, the drinks are gooood.  If you order one with the glass, you get to take the glass home with you (a clean one packaged up nicely for you) and you'll enjoy a discount on your 2nd glass and all after that (as long as it's the same cocktail).  <br><br>It's a great place to take kids or adults with a good sense of humor and an open mind.  Be sure to make a reservation, especially for weekend nights...hopefully you'll get in when your time is slotted. :)<br><br>Ladies, be sure to check out Daniel Craig's leaf in the ladies bathroom!", "pics": null}}, {"review": {"des": "Scissorhands the barber is super relentless. Works very harder than a lot of you waiters. Meh<br>I'll be eating here forever because of him. Last place he worked at...Friday's was the best having him as a waiter. He knows all the ways to eat drink and for less!", "pics": null}}, {"review": {"des": "Went here for a private event at and it was really fun!  We did not know the password, so we had to perform a well known dance in order to gain entry, evidently, we did pretty well judging from all the compliments we received.<br><br>This was the first time we visited SafeHouse and the combination of great drinks, great food,and great music made it a spectacular evening!<br><br>My favorite drink was the Spy's Demise and favorite food was the Black Ops Sliders.  Everything from the moment you entered to when you exited was an exercise in spy culture.<br><br>I recommend that you take your time and explore every inch of the location.  Discover all of the secret options in this place. There are even spies in the bathroom!<br><br>I found this to be a fun place to visit with friends for a special occasion, dinner or just for drinks.<br><br>My only criticism is that when we first entered, the music was way too loud, it was impossible to hear or speak to anyone.", "pics": null}}, {"review": {"des": "This place is amazing for date night ! The Safe House theme involves an engaging experience from the time you walk in the door. Not to mention the food options are absolutely yummy. The staff are great food. They make the experience extra fun.<br><br>Their burgers are amazing, and I highly recommend the Mac and cheese. All meal portions are more than enough.", "pics": null}}, {"review": {"des": "My wife and I had so much fun at this place during our trip to Chicago.  It is an experience, more than just a meal.  Everything from the entrance to the way the staff acts/talks makes for a really different and fun meal.<br><br>We went for dinner on a Saturday night.  I would definitely recommend getting reservations.  Upon arrival we had to do a dance to a shampoo commercial song to gain entrance.  Everyone in the restaurant can see the tasks people have to complete which is entertaining once inside.<br><br>For an appetizer we ordered the soft pretzels.  They were delicious, however they were more suitable for a group of 4-8.  For my meal I went with the MOAB Burger, which came with their delicious secret sauce.  It was a little overcooked, but still very juicy.  It surpassed my expectations and was one of the better burgers I have had in a long time.<br><br>If you are looking to do something different while in Chicago, be sure to check this place out.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/0-nCdFKF7pFYh1lP7aPojw/168s.jpg", "caption": "MOAB Burger"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/fW8AHkwUtiQis7it6htMgQ/168s.jpg", "caption": "Soft pretzel app"}]}}, {"review": {"des": "Interesting concept: Spy SafeHouse.<br><br>I won't be a spoiler alert on here, but will say it's a fun experience.  I went to an event where I had the opportunity to sample some foods and we found all of them: salad, burgers and nachos all quite tasty! The burgers were our favorite.  We tried a couple different cocktails as well and due to them being flavorful and mixed well.. you didn't realize the punch they packed.<br>There's a DJ so the music really gets pumpin' after 10p.  Small dance floor for those who dare.  <br><br>I would recommend this place for an experience at a theme bar.  Not a place I would go to regularly, but one I would arrange a group outing to go and have a goofy good time. Good drinks, good music and good food earned it four stars.", "pics": null}}, {"review": {"des": "Here for a yelp event and it was great. Had a sample of the cobb salad which was good (even though it had blue cheese which I'm not a huge Fan of) still liked it, and beef and chicken sliders. Chicken sliders were soooo satisfying. We got samples of their cocktails as well which, Honestly, were all good. The chicken nachos were satisfying to my husband who doesn't even like nachos<br><br>Atmosphere is fun and different. A lot to spy themed decor that I as enjoying as well as a magician who was serving drinks during the event. Good music and decent dance floor. Staff was friendly as well and all into the theme!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/riMmSemPw4YtMpgwiL7OfA/348s.jpg", "caption": "Progressive af - love it"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/wFikieHX7bcQlifa5wNaXw/168s.jpg", "caption": "Fun decor behind the bar!"}]}}, {"review": {"des": "My wife like it's. That's always a good sign. It's not dark. Lots of nooks and crannies to hang out and check out. Such as the Drone Destination Mission, The Periscope where you can check out the bar or you can  launch an ICBM missile. <br><br>There is 007 paraphernalia all over the place. My wife especially likes the almost nude pic of Daniel Craig in the women's bathroom. I believe I saw a picture of P_ _ _ Y Galore in the men's bathroom. She's a real character in James Bond so stop snickering <br><br>The bar staff was amazing. They were ridiculously fast with the drinks. I wish the dance floor was a tad bigger. I did actually enjoy the routines you need to do to enter this place at the gate keeper.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Vl2vWbI7s_WSA4gAvu-z0A/348s.jpg", "caption": "Pic is Pano Tap it"}]}}, {"review": {"des": "ENTERING THE SAFEHOUSE:<br><br>If you don't know the password - do the dance they request of you.  It's fun...unless you are boring and don't like fun.  Too kitschy for you?  Here's my opinion:  if you don't like themed restaurants, don't go to one and expect it NOT to be a themed restaurant.  Go to Denny's.<br><br>Our task was to do our \"best dance moves.\"  I thought, crap...we're rhythmically challenged.  For some strange reason, I decided to do a horrible \"Carlton\" dance impression (if you've seen Fresh Prince, you know this one).  It sufficed, and we were granted entry.<br><br>The stairs descending into the SafeHouse had a feel of entering a secret mission impossible lair.  Hubs was grinning from ear to ear, so we were off to a great start!  <br><br>SERVICE:<br><br>\"Agent Nestle Without The Crunch\" was our awesome server for the evening.  He was attentive and friendly and gave us ideas where to search for the passphrase words.  He also told me to go into the Ladies' Room and touch the green leaf.  (Do it.  It'll be the highlight of your evening).  Our food came out so quick that we didn't get a chance to walk around until after we ate. <br><br>FOOD:<br><br>I already knew ahead of time that the cheese curds was a must have.  They didn't disappoint.  My husband's chicken sandwich with extra bacon was good.  They forgot the extra bacon, but Agent Nestle quickly remedied that.  My fish & chips were juicy and tender with a tasty tartar sauce.  Fries were meh.<br><br>Order the Agent Chi cocktail (But don't forget to squirt the contents of the plastic syringe into your drink!  It contains the frambois.  Otherwise, you just paid $14 for  1/2 of a drink!).  I believe they have happy hour specials from 4-7:00 p.m., but don't quote me on that.<br><br>ATMOSPHERE:<br><br>Loud noises, whistles, bangs, screaming children, laughter and loud talking filled the place while we were there.  It was hard to make conversation, but that's not why you come here!<br><br>It was a little odd to see so many small children running around an adult, spy-themed bar/restaurant.  As a mom, I felt a little uncomfortable seeing 12 year old girls in the ladies room, giggling because they \"touched the green leaf\" (you'll see what I mean).<br>The lighting is fairly dim, but also full of colorful lights and Mission Impossible/James Bond type of decor.  Take your time to walk around and check everything out.<br><br>My husband and I figured out the password in 2 different ways.  So we're all set for next time!  The \"Carlton\" won't be making another debut.  And no, I'm not telling you.<br><br>I've read that people had to pay $1.00 to leave via the fun, secret exit.  Maybe that was the old way of doing it?  Our waiter just pointed us to the door.  It's a great ending to a fun evening and the kids will love!<br><br>Go with a fun group, play along, and you'll have a great time.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/7S955F6KLdutjxHPnHjrYQ/348s.jpg", "caption": "Chicken sandwich"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/XP90m7r2qiecEeoz7RcJvg/168s.jpg", "caption": "Exit"}]}}, {"review": {"des": "Pretty sweet spot. We were visiting from out of town and walked up on this spot and after a few yelp reviews I was sold. <br>The entire theme of this place is funny and very unique with its spy theme hide out. <br>We went on a Friday evening around the lunch rush which had table waits of about 45-60 min wait. Luckily we found a spot at the bar and drank and had an appetizer. <br>Service was a bit slow but I don't blame 2 bartenders responsible for making drinks for the entire venue. Yes that included us at the bar plus the 3 huge parties going on as well. <br>Bathrooms are also very clean and themed out as well. Highly recommend going to have a different kind of night out.", "pics": null}}, {"review": {"des": "Experience=5, Food=3. This place was a combo of all my favorite Austin Powers, James Bond and Jason Bourne moments put together! From the unassuming \"office\" you first walk into, to the hidden walls and videos, to the cool gadgets everywhere inside. I especially loved the fake bathroom and the unisex bathroom with the magic glass. (Having said that, it appears I have a thing for bathrooms. Who knew?)<br><br>Food and food service were meh. Everyone else enjoyed their meals, but my prime rib sandwich was perhaps the most dry thing I've ever had, and the ciabatta didn't help, I had to remove it. I had it topped with mushroom and onion, as well. <br><br>Another had a salad that was piled high and she enjoyed it. The ribs smelled great, too; maybe I just picked the wrong thing.<br><br>The magician was good and the kids (okay, me too) liked his card tricks.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Ycl6J7bL8uzNuyBAIqil7Q/348s.jpg", "caption": "Prime rib sandwich"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/R-TzVAg7IHFBQEG_koAlGA/168s.jpg", "caption": "Kids burger"}]}}, {"review": {"des": "This is a fun restaurant, especially if you have children.  There are a number of interactive exhibits once you enter.  Be prepared when you arrive.  You enter into a typical office lobby and will have to perform tasks to prove you are not a double agent if you do not know the password (we had to be be fashion models and perform three poses).  The food is also really good, especially compared to others theme restaurants.  You must order the cheese curds.   I also ordered a burger and the \"FB\" for dessert (fans of Austin Powers should know the longer name).  There was a magician the night we dined and he was a lot of fun and kept the kids entertained.  Be sure to save a dollar bill for your exit, unless you know the secret passcode.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/gbhSzByZ_jZa7RRz0b-amg/168s.jpg", "caption": "The Provocateur Burger (Burger with Bacon Jam) and Onion Rings."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/gM7NdStMLGQ4eLYzd6dyRA/168s.jpg", "caption": "The \"FB\" (humongous brownie sundae)."}]}}, {"review": {"des": "I have been to the SafeHouse Milwaukee before, and enjoyed the experience. This spy themed restaurant is a fun experience for all ages. I went with a few friends to catch up and had fun. Great for dates, birthdays, and bachelor/ette parties.<br><br>The entrance is decorated like a detective's office. You have to whisper the password into the staff member's ear for entry. Don't know the password? That's the fun part! The location is filled with false doors, buttons that sound fun alarms, lights, secret passages, and clues for a scavenger hunt. Get all the clues and your name will be entered in a drawing for a discount. I saw a lot of families, dates, and a lot of birthday parties. We went at 6:00PM on a Sunday, and were seating right away.<br><br>Our server set the mood and introduced himself as an Agent, and asked if we needed more time diffusing the menu. When we were ready to order, he said, \"What is your culinary target mission, Agent Mandy?\" For appetizers, we ordered the Fried C4 Cheese Curds (good portion split between three people. I used to live in Wisconsin so unfortunately these fall short of my cheese curd expectations, smaller, not as light and fluffy-- our friend said they were delicious!) and the Blacklisted Chicken Tenders (Blackened with house made Cajun orange marmalade, which was delicious. A lot of seasoning. Would order these again!) I'm glad we ordered appetizers because our main courses took longer than expected-- approx. 45 minutes from being seated. We ordered the Furtive Fish Fry (my friend devoured it, so I'd say it was good), Prime Rib Timed Drop (tender, shaved prime rib on a ciabatta bun with a side of au jus-- I had a bite of this and it was filling and definitely a popular menu item), and the Wai Lin's Ahi Salad (seared pepper crusted ahi tuna with romaine, snap peas, toasted almonds, and a sweet and sour dressing-- TWO STARS. The ahi tuna was bland, the romaine was old, the snap peas tasted sour, the salad was suppose to come with napa cabbage, toasted ramen noodles, and green onions, but were scarce.) I think the safe bets on the food menu are the burgers, the fish fry, the fish tacos, and the NACHOS! The drinks are delicious!<br><br>Expect to spend around two-three hours here, if you want to participate in the scavenger hunt or just walk around looking at things. It is a great interactive restaurant with fun activities to do while you wait for your drinks and food. Hint: one of the passwords for the secret exit door is in the women's restroom!", "pics": null}}, {"review": {"des": "What a party. Loved everything about it. The service was kind of slow and they burnt my daughters burger but the service was so great they made it right with us, and even better. This is such an experience and the whole family loved it. Bonus the food is awesome! We tried fried cheese curd- hello wish there was more. Got 3 different kind of burgers. Mine was the MOAB (mother of all burgers) and it was awesome! Tried the guacamole burger- yum and I can't remember the other but all of them were amazing! Kid the kids mac and cheese and it was Home style and creamy! <br><br>Then since it was my birthday we topped it off with the fat bastard and my family of 4 barely touched it because it is HUGE! Yet so yummy really dense thick huge pieces of chocolate cake with tons of ice cream topped with whipped cream. They surprised me and it came out with a huge firework in it. Awesome night would definitely tell people to go. <br><br>Kids favorite part was going through laser breaks to get out.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/se_txSCUkQcLn_mHzWfb8w/348s.jpg", "caption": "Kids Mac and cheese"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/qYqJQexGqMFl6QiZDwfQ6g/168s.jpg", "caption": "Bacon burger"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/5qd3C6vf57Qf0f5YlahOaA/168s.jpg", "caption": "MOAB burger"}]}}, {"review": {"des": "I came here with a Yelp Elite event and I truly appreciate the opportunity to visit SafeHouse Chicago. I was able to experience a full range of the food, drinks, and activities that Safe House has to offer :) <br><br>Food- Caesar salad (standard), Veggie burger (underwhelming), Nachos (delicious cheese!), cheese curds (can't go wrong!), and marshmallow fluff dessert (suhh-weet, never had anything like it before). <br><br>Drinks- generally, delicious and STRONG! A personal favorite of the night was Spy's Demise, which was sweet and pineapply but not super sugary. I did not love the mixed drink that incorporated red wine, but other people at my table liked it, so that was a matter of personal taste. <br><br>Activities- this bar is truly interactive, there is a lot of fun to be had whether you are a group of adults looking for a night on the town, or a family looking to bring your kids somewhere fun to eat. The magician was very friendly and social. I did a trick with him and I was mystified! There is so much to explore, touch, listen to, and generally engage with. The entrance procedure is truly memorable! <br><br>Have fun :)", "pics": null}}, {"review": {"des": "I love themed restaurants like this. A few years ago Mars 2112 existed and it was great! Anyone remember it? Any who.... my friend and I went to SafeHouse for the first time last Friday and getting in to the restaurant was super fun. When you walk in they make you do a series of silly things that are recorded and displayed on big screens throughout the restaurant. The tone was set and we were excited. When we actually got inside we were a little disappointed at the lack of decor, but not a big deal. Although we had reservations it still took a quite some time to be seated. <br>    For dinner we were told our only option is this weird $30 package that included 1 app each, unlimited fountain drinks, and a main. Although we didn't want two apps nor did we plan to have fountain drinks we were told that was the only option. I found it strange but it was $30 so no biggie. I ordered cheese curds as my app and a Cuban sandwich and my friend ordered nachos and a burger. The food took forever and we got our mains first AND they were ice cold. The waitress apologized that we never got our apps. She brought them out warm BUT it was the wrong order. The manager then came over to offer an explanation and eventually we got our appetizers that were more like dessert at this point. When we got the bill we were charged full price and had to awkwardly bring up the fact that our food sucked. <br>  The gimmick is fun and I'd be inclined to go again even if the food was mediocre, but the food was not mediocre it was really really really bad! How disappointing. I don't think I'll go back again.", "pics": null}}, {"review": {"des": "A staple of Milwaukee, SafeHouse has arrived to Chicago! When you go to this place, don't mistake it for the Escape Game that is right down Ontario street. I understand the confusion since the theme is similar and the door to the SafeHouse is guarded by a password and the word \"agents\".. knowing the password, I won't say it but there are other ways of getting inside without the password! <br><br>Inside, the atmosphere is sooo UNIQUE and is a great addition to the Chicago nightlife. It features a large space and higher up scale food menu. It is almost a dance bar with space to the side with plenty of seats. Therefore, there are different options to have a  good, fun night here. SafeHouse offers fishbowls- who doesn't love the place that sells fishbowls??? But, I was invited here for a yelp event. I was given an Agent name of Drop Dead. A super sleek name, I had my fair share of sampling all the sliders and desserts complimentary to the cocktails and beer. Sounds like a headache already right? Well that was experienced the following morning after a GREAT, BUT SECRETIVE night at the SafeHouse!<br><br>8/10", "pics": null}}, {"review": {"des": "A while back agent Black Jack saved my Life....I can't say anymore.<br><br>He really has some tricks up his sleeve, if you know what I mean.<br>He made our trip well worth the efforts to get to the safe house.<br>The food was great as well, chicken was mighty tasty, and the libations to wash them down were excellent.", "pics": null}}, {"review": {"des": "I really enjoyed my time at the SafeHouse!<br><br>Imagine stepping into the campiest James Bond movie and you've got the idea. From the beginning with the punny building directory and the spy vetting process before being admitted in, to the exit with a cool laser maze,  the entire experience is fun and cheesy in the best way! <br><br>The spy theme is all-pervading and I got a real kick out of it. The interior is setup to resemble a secret base with very cool lighting and multiple interactive displays. There is a Recon Mission (aka scavenger hunt) which is a great way to see every corner of the pretty sizable space. All cocktails and food items have spying related names. The staff did a great job of following the spy theme, referring to the customers as agents and being generally helpful.<br><br>I thought the food was pretty good. I tried the \"Friendly Agent\" cocktail and found it to be a tad too sweet. <br><br>I would definitely recommend visiting the SafeHouse for an entertaining evening.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/SA3UiP7VQT41YRSPjBnhUw/348s.jpg", "caption": "The spy theme is everywhere!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/dBhufVtXfI5-EhiRskw7WQ/168s.jpg", "caption": "The main bar with a cool background to keep you entertained while your drinks are prepared."}]}}, {"review": {"des": "A spy themed bar and restaurant?! I'm totally here for this.<br><br>We ended up here after dinner for some drinks. If you don't know the password, you'll have to prove yourself in a clearance test to prove you're not a double agent. Whatever it is, do it. Have fun with it, that's what it's all about. <br><br>If you don't like a good theme restaurant, then this place is not for you. We loved it. Make sure to take the time to explore and check everything out (there's a reason it named the most Instagrammable restaurant in Chicago).<br><br>And remember spies: once you know it, NEVER reveal the password to anyone!", "pics": null}}, {"review": {"des": "I came here for a Yelp Elite event and by the time I got there most of the food was gone.  They had great, attentive service.  The people at the front who ask you for your password were great with their poker faces.  The cocktails were decent as well and they had a good wine selection.  They didn't really have any real veggie options for entrees.  The Caesar salad could have been a bit more flavorful and it was a bit watery.  <br>The smores dessert was great though - melted marshmallow with chocolate drizzled on top.  It's a good place for guilty pleasures. The spy theme/decor is unique and I would go there for drinks rather than dinner.", "pics": null}}, {"review": {"des": "Such a very cool place with an awesome spy theme!<br>I have been here twice for Yelp Events during dinner and Saturday brunch and both experiences were very cool. We got to hear about the history of Safehouse as well as try some delicious food. A friend of mine recently decided he was gonna have his bday lunch here...I was like hell yeah!!!<br><br>When you walk inside, you are greeted by a secret agent that wants to know a password...3 times of being here I have never known it lol! If you do not know the password he has you do a dance of his choosing before he sends you downstairs to go on your mission. What you dont know is that people can see you on most of the screens downstairs so make sure you put some effort into your moves as you are being watched...LOL! Once you make it downstairs it is a very cool experience with the whole spy theme and stuff for kids and big kids (adults). Once seated you have a list of missions to complete and you get name tags to write down your secret agent name...be clever please.<br><br>I was in the mood for tequila so I went with the Espionage...very fruity and refreshing and had 2 of them. I thought about the burger, but I've tried it an an event before so I decided to go with the Cuban Missile Crisis which is basically a cubano. I gotta say this was one of the best cuban sandwiches I've ever had...it actually rivals the ones I've eaten in Miami. Sandwiches come with a side and I was given the choice of onion rings. Those onion rings was bangin and didn't even need ketchup...highly recommend the onion rings as they were a big hit with our party of 8. Food was great but service was a bit distant as our server would disappear for big periods of time and the birthday boy's nachos weren't very warm and looked a little dry. They compensated us with some very good vanilla ice cream. <br><br>Once its time to leave, there are a couple of exits. We went through the dark, light beam exit in which you end up going past all of the agent name tags wall of fame. Good place to take your kids, celebrate a birthday or have a fun date...I def recommend Safehouse!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/bczqaYxbu0PiuSplNjXb-A/348s.jpg", "caption": "Cuban Missile Crisis"}]}}, {"review": {"des": "Agent Foxy Danger here with the debrief on my mission at SafeHouse<br><br>What a interesting concept this place has!!!! I really enjoyed my time at SafeHouse Chicago. I was there last Friday night for an Elite event and I'm really taken by the whole layout, theme, and decor. There are secret doors, surprise doors, secret pathways, cameras, lasers, and all other types of secret agent specticals. If you go just to have a drink I guarantee it'll be served with laughs as you head into the agent zone. Don't want to give too much away but prefer to laugh at yourself and others! <br><br>The food was tasty and kid friendly, burgers, salads, nachos and s'mores dessert! Nothing exceptional but simple and done well.<br><br>The drinks were great as well spins on some classics and some creative. My favorite was definitely the spy's demise! Tropical but not overly sweet!<br><br>Above all else, the service was excellent, so many smiles!!!<br><br>Foxy Danger Out", "pics": null}}, {"review": {"des": "We were really looking forward to this, but unfortunately we had the worst experience. Our server failed to give us the menu while we were waiting on our drinks. Once he literally gave us our menus, he asked us if we had any questions on it. We told me you just handed us the menu and it's our first time here. He said oh sorry I mistaken you for another two top I had. <br><br>When we ordered, we specifically asked how much the salad was since there are no prices. He said $12. After we ordered, we walked around. The place is really cool though! The magician was ok. He was very distracted by everyone else in the restaurant and not so attentive to the people watching him. <br><br>The food was decent, but we had to stop and wave down our server for refills. We eventually stopped and cancelled our dessert because we wanted to leave. We got the check and he charged us $19 for my salad. I quickly told him there must be a mistake because he told us it was $12. He told us we were right and that someone must have changed the prices on him. He quickly went to his manager, but came back and said well they changed the prices but you can talk to the manager if you want. We were so upset that we just paid and left. We will not be coming back.", "pics": null}}, {"review": {"des": "I don't typically like themed restaurants but SafeHouse delivered in a way that was not over the top or cheesy. Most of the food and drinks are named to follow the spy theme and the staff refer to all patrons as spy or agent. The decor is definitely the main attraction and it's nice that you can walk around the restaurant to explore without feeling like you are invading other people's space or getting too close to their tables. <br><br>There is a SafeHouse app you can download to complete a \"mission\" and locate different things around the restaurant. I like that it can be interactive but the app just takes up space on your phone when you aren't at the restaurant. <br><br>Since I was at SafeHouse for an event, we had some light food appetizers--including cups of salad, nachos, and sliders--rather than a sit-down meal. Nothing too fancy but I liked everything I tried.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/BibayE5M471mAzN9aT_tgQ/348s.jpg", "caption": "Decor in the back bar area"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Jszk0IWCzrL2aOepMD-3kA/168s.jpg", "caption": "Drink menu"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/zTZx-R3MClpgPPqQo_VZrQ/168s.jpg", "caption": "Secret entrance"}]}}, {"review": {"des": "I dropped by for their Wall of Fame event and missed some of the earlier talks, etc. <br><br>B96 was there raffling 10 or 20 pairs of free tickets to their summer bash concert and I won a pair that I gave away since I couldn't attend.<br><br>They have summer shandy. I also sampled a few cocktails spy's demise, agent chi, and vesper lynd. Spy's demise was my favorite.", "pics": null}}, {"review": {"des": "The place inside was really cool looking and the way you enter through a \"secret\" door and go down a hidden staircase was fun but after that there was absolutely nothing special to the experience. The waiter didn't do anything special except for calling us agents and didn't tell us anything about the place. <br><br>The food ok but was nothing special at all for the prices they charge. Bland fries. None of the staff seemed to want to be there or seemed embarrassed to play ago with the theme.", "pics": null}}, {"review": {"des": "We stumbled upon this place when we were looking for a pizza place and when we ordered our pizza (at another place), they told us to come back in 45 minutes so we went back to the Safehouse to have a drink while we waited. We were so confused when we walked in the front door as it appears to be an office with a guy working in there. He got us good cause we thought we had entered the wrong door and had to go out and look at the sign again to make sure we were in the right place.<br>We were in the right place and we were then told that there was only one way to get in if we didn't know the \"password\" and we had to strike model poses and do a goofy dance. We were laughing hard cause it was a neat idea for a bar, but then we went downstairs and realized the whole bar could see us and they clapped for us as we entered. <br><br>Then we ordered the Spies Demise drinks which were very good but by then we had to leave to get our pizza. If we hadn't already ordered it at another place we would have eaten here cause they had a great looking menu. We liked it so much that we decided to return later after dinner and search for the password, which we found but cannot say where or how........cause it's a Safehouse secret :-) Fun place to visit!", "pics": null}}, {"review": {"des": "We came here for a birthday celebration last month and had a blast!  As other reviews indicate, the restaurant is spy-themed.  From the menu and the cocktail selection to the decor and waitstaff, everything was in sync with the theme, which made the experience even more fun.  You need a password to get into the restaurant, but if you don't have it, it's okay... You'll get in one way or another... :)<br><br>We had a large group, and they accommodated us well.  Once you've ordered, they send you on a mission throughout the restaurant!  I can't share any more details because that would spoil the fun, but once your food is ready, they find you to bring you back to the table to eat.<br><br>First, let's talk about cocktails.  All of the cocktails we tried were creative and tasty.  I ordered the Agent CHI - their whiskey-based specialty cocktail - and for some reason, it comes with a syringe as a garnish...<br><br>For starters, we ordered a few appetizers for the table, including the fried cheese curds and fried pickles.  From reading the reviews, it seems like the fried cheese curds are their staple - and they were fantastic!  We ended up ordering a second serving for the table because they were so delicious!<br><br>Then, I ordered the \"Station Chief's Salmon,\" which entails a pan-seared, Korean BBQ glazed salmon and broccoli and house mashed potatoes on the side.  My husband ordered the \"Mission Impossible\" burger, which had 2 mouthwatering Angus beef patties with smoked bacon and both cheddar and pepper jack cheeses then topped with onion rings and chipotle ranch.  Because I tasted it all, I can tell you everything was amazing!<br><br>Of course, at the very end of our meal, because it was a birthday celebration, we had an enormous dessert ice cream sundae with a flaming firework on top.  It was great!<br><br>Overall, I would HIGHLY recommend this restaurant.  It was a wonderfully fun experience, and I would love to come back.", "pics": null}}, {"review": {"des": "This is Agent Atomic Blue thanking Agent Mighty Mouse for helping me complete my night's mission successfully. <br><br>Also thanks to the magician! He was packed up to leave and I asked him if he would mind doing one more trick for my father who also practiced magic. He was more than happy to preform several tricks for us and made our night ‍<br><br>And I'm only 21 but The Blue Steel is the best drink I have ever ordered", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/cycW_760pYob1ZOdaBaSww/168s.jpg", "caption": "The magician has great energy!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/2viTQwUuNknK0POzas6wpA/168s.jpg", "caption": "The bar and The Blue Steel"}]}}, {"review": {"des": "Had a blast here!  The spy theme is super fun and just love that the staff go all out with it.  Food was good bar food.  I got the nachos and the wings.  Drinks were good as well but could have had a bit more liquor in them for my tastes.  Service was good!  The atmosphere is fun with all the spy theme memorabilia and just everywhere you look there is something spy.  Also watching people get into the place is so funny!<br>I really enjoyed SafeHouse and will definitely return.  This would be a fun place for a group to come to!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/xqlIBeadd9Y3IoMt9GGSEw/168s.jpg", "caption": "Yummy wings!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/HE3Rx9JK16yTZrlCYzPJLg/168s.jpg", "caption": "All the nachos!"}]}}, {"review": {"des": "Came here bcuz we were looking for different, found it. Love the grand entrance, nothing like making a fool of yourself, lol. Everyone is too serious these days. Love the layout, the theme, the named menu items, and the concept. However, I guess in the early hours this place is for KIDS, didn't know that. There were about 3 toddler parties- kids running wild & cussing out adults.  Not my scene, didn't sign up for that. The menu is very basic, didn't want a burger, but I had to settle (glad it was good). This is NOT the place to buy a drink, they need to work on fixing the pricing in that area. And if you're NOT playing games, which we didn't, I recommend Safehouse channel the TVs for patrons to watch episodes, etc.  I see they started what 'should' be a great mission, but they need to work on completing it and incorporating staff to have a clean and well-managed appearance.", "pics": null}}, {"review": {"des": "BLUF: An interesting \"speakeasy\" bar with an entertaining spy theme tucked away to make you feel like a secret agent. <br><br>This bar/restaurant was one of the most cool/interesting places I've been to! It's pretty easy to miss if you're not actively looking for it as the entrance is a simple red door. As advertised on the website, you'll have to pass a \"background check\" to make sure you're not a double agent. Much involve some fingerprints, X-rays, truth serum, who knows? Only those who have gone will truly know! <br><br>After clearing your check, you'll be able to enter this secret bar and restaurant. And once you enter you'll be in for an immediate surprise alongside with some good laughs (you'll find out why!) We opted for just a simple happy hour with their Code Beer, the Great Spytini, and their version of the Moscow mule. We also ordered a side of buffalo wings, which tasted pretty delicious! You have an option of classic buffalo, korean style glaze, or Texas dry rub for the wings. Some other HH options included onion rings, nachos, and these fried cheese curds that looked mouthwatering. <br><br>I'll definitely come back here again when I'm in town in Chicago! It made for a fun experience that will be worth it again. Who knows, maybe I'll be able to use the code word to get in next time...", "pics": null}}, {"review": {"des": "Definitely a different bar from those that I have encountered in the past.   From the moment you walk in,  prepare to be the best spy that you can be!<br><br>The whole spy bar theme is pretty awesome. They have spy gadgets everywhere and cool hands on stuff to keep yourself entertained while waiting on your drinks/food.  <br><br>The music was pretty good when we came here on a Friday night.   I guess this place is technically a restaurant first,  then turns into a bar with a DJ spinning some beats after 11pm.<br><br>We just came from dinner so we weren't hungry enough to try the food that was served here but will definitely come back to dine.  We only had a couple drinks left in us for the night before going back to our hotel but it was enough of a good experience to come back on another day.", "pics": null}}, {"review": {"des": "Let me start by I'm super biased...I love the Safe House in Milwaukee. This felt so corporate to me. I've been here twice and the first time I remember the service was extremely quick and the food was good. Nothing off the charts stellar though. We came here last night for a few drinks and I think it took 15 minutes for someone to get our drink order while we stood waiting at the bar. Then they were out of a main ingredient for one of the feature drinks on the menu. Then they charged us for the souvenir glass we didn't order. <br><br>One member of the staff told us at 10 they get a DJ and it turns into a club. We felt like they just turned up the music and then it was hard to have a conversation. <br><br>The best part about the experience was the magician they had in a back corner. He was fantastic.", "pics": null}}, {"review": {"des": "Was looking for some excitement with dinner so went in for a late meal (10 pm resy) with a group of friends (good sports required for this spot)... experienced the entry hijinks since we didn't have the password and descended into the spy den.  The spot is fully committed to the theme which was fun when it came to the decor, just wish the service wasn't so covert, waiting for the host/table and tracking down our waiter throughout the night were missions in themselves...<br><br>Had the cheese curds (yum- fried cheese is always a good thing) and the spy burger which was fine, meat could have used a little seasoning.  The drinks were overly sweet which the waiter to his credit did immediately switch out... <br><br>There were gogo dancers, some fun music and a photobooth to wrap out the experience, all of which made for an entertaining evening.<br><br>Its safe to say the box has been checked and while a repeat is not necessary, does provide a little entertainment with a side of cheese ;) if that's what you're looking for...", "pics": null}}, {"review": {"des": "I really like the theme of this spot. It's extremely creative and fun all around. The food was pretty good too however we had such a long wait, almost one hour for burgers, fries and lukewarm wings. We also noticed there was only one waiter serving several tables including our own so service was extremely slow, especially for a Saturday night. I am willing to give SafeHouse another try later on in the future but for now 3 stars.", "pics": null}}, {"review": {"des": "I'm giving 4 stars for the novelty of this place. I love the spy theme and the \"missions\" you are given during your dinner and the service is good, but the food wasn't anything to remember. I would definitely come back to experience it with friends that haven't before, but I wouldn't come back for just the food. That being said, here's what we ordered:<br><br>Nachos - huge portion which was great, but they were very dry (not much cheese sauce) and extremely salty on some chips. By salty, I mean glistening and no sight of the chip but through the salt. I unfortunately got several of these while eating. It felt like playing Russian roulette with nachos. I'm not sure what happened.<br><br>Spy burger - average, nothing notable <br><br>Coleslaw side - almost soupy from the mayo<br><br>The other items might be better as others looked pleased with their meals.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/V_2dDc3_REuKYyXg8qoG7A/348s.jpg", "caption": "Your mission, if you choose to except it"}]}}, {"review": {"des": "Good evening, my name is Agent Liz Lemon and I am here to instruct about your potential future mission at Safehouse...IF you choose to accept. <br><br>It is imperative you follow the instructions for this mission and leave behind any expectations as this will jeopardize your future!<br><br>Okay...all corny joking aside, this place is fun. Many thanks to our Agent K-Boom for being so enthusiastic and fun! I asked him for a specific type of drink and he was able to make it happen!! <br><br>Drinks are strong. Food is average. The concept is great. I won't ruin the fun but it's worth at least a visit or two. I didn't like the cover charge just because there was a DJ and GOGo dancers that Saturday night ($5 per person). Nobody was really dancing on the dance floor but the music was great. <br><br>All in all, a great experience. Leave your expectations at home!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/FDiucXxpT1bWkWNckisPhw/348s.jpg", "caption": "The eyes move on that"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/gxSNuyj9JjLJfak2WdMNCA/168s.jpg", "caption": "The decor"}]}}, {"review": {"des": "Came to Safehouse with my friend for dinner the other night. I had been to the Safehouse in Milwaukee 15 years ago but it was the same as I remembered! It's a cool concept with \"missions\" and the whole spy theme is cool. However they lacked in the food category as I was unimpressed. It took quite some time to get our food, and it was just OK. I had the BLT which was average, however the fries were gross. They were cold and had zero flavor. If you come to the Safehouse be prepared not to eat the best meal of your life but to enjoy the atmosphere. It'd definitely be a great spot for kids or families!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/He5rGs_eKEYvWIdHXKMSSw/348s.jpg", "caption": "BLT with fries"}]}}, {"review": {"des": "This place is Amazing...brought the kids here and the absolutely loved it.  They had a great time discovering hidden clues.  Agent Tinie is the best.  He made our experience entertaining..Great burgers too.", "pics": null}}, {"review": {"des": "This was my first time going to a restaurant that required a password. When you first walk in you are greeted by an \"office clerk\" in what looks like an office. He will ask you for a password and if you don't have it then he will ask you to complete \"security measures\". You enter through a back door that takes you downstairs to a secret lair. The waiters are agents using fake names and you play along by creating a fake name as well. We ordered a sharable drink that cost $40 and the MOAB Chicago Burger which was delicious. I had fun here solving puzzles and \"breaking into the bank fault\". I can't wait to come back!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/jDt8jhilr37XX7Wvs5Mb2Q/348s.jpg", "caption": "Cheesecake"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/e5ZYpQettJsYxsY9ee2odQ/168s.jpg", "caption": "MOAB Chicago Burger"}]}}, {"review": {"des": "I'm a huge fan of Lonely Planet guidebooks.  They show you the best unique locations that a city has to offer - the sort of place where you'll have a totally wild experience that you can't replicate anywhere else.  I didn't buy the Lonely Planet for Chicago before coming to town, but SafeHouse needs to be in it if it isn't already.<br><br>One of our friends (a native Chicagoan and apparently also a spy) was walking us down the road one night while we were out exploring the city. <br> We'd only been to one bar so far that night.  Our friend Andrew took off ahead of us at one point and entered a travel agency.<br><br>Travel Agent: Can I help you?<br>Andrew: *grinning ear to ear*<br>Us: Well, we were looking for a bar, but Andrew didn't tell us the name of it... I think we must be lost. (thinking: man, Andrew really didn't seem that drunk before bringing us in here)<br>Andrew: *keeps silent and grins*<br>Travel Agent: I really can't help you unless you tell me what you're looking for.<br>Random couple likely picking out a honeymoon spot: *stares at us*<br>Us: Errrr.... sorry... we'll get our friend out of here and take off...<br><br>Can't believe this bar exists.  From the actors/waiters to our grand entrance to the challenges around the bar to our escape through the basement at the end of the night, SafeHouse was absolutely stellar in every way possible.  This is an escape room in a bar.  Also, the cookie dessert is to die for.<br><br>Go on a weekday night if you want a quiet time when you can explore everything SafeHouse has to offer.  Also, if a magician comes over, go along with it.  I think he's a real wizard.", "pics": null}}, {"review": {"des": "Although the concept is different and fun, I have to say the food is just average. However, I still give it 4 stars because it is so unique and for the pub style food, better than most bars or restaurants. However, the beer selection isn't that great and I picked out 2 beers which, they didn't have at the moment before settling on a beer.<br><br>I won't spoil the surprises but the restaurant is a spy themed bar and definitely worth checking out. Especially if you like geeking out and having fun with those in the group. We all made funny spy names and took advantage of the photo booth there. The staff also stays in character to have fun with the theme. I definitely think kids would really enjoy his place, but it's fun for adults as well.<br><br>We tried the fried pickles and cheese curds for appetizers and the cheese curds were delicious! For dinner I went for the vegan burger with the El Macho \"cover\" or style of toppings. It was a giant burger but was missing some saucy flavor to make it unique. The special sauce they have is more on the Worcestershire sauce side than a spicy mayo that I'd like. <br><br>I've heard their regular burgers are amazing so I would be  wanting to come back and try that. Overall, worth coming for fun work events or with friends to kill some time.", "pics": null}}, {"review": {"des": "This place is hilarious we open the door and it was like an office, there was a gentleman who asked us some funny questions and wanted to make sure we weren't FBI agents, so he made us do 3 flexing positions well we did it. He asked if we had reservations we said no and said there was a 30 min wait, which was fine. We walk down to the restaurant and realized people had watched what we just did lol we didn't mind it at all it was hilarious. <br><br>There were two girls there and I told her we didn't have a reservation but it's four of us and she said there was an hour wait, and we said we would wait by the bar. Both girls had a stank face never smiled when I said we would wait I told her, okay my name is Daisy?? It seems she wasn't even trying to get my name so I was confused! We sat by the bar and I was starving!! So I just told my friends if we could just eat at the bar and they agree.the food was great the killer mac & cheese so worth the try, the nachos were good as well I didn't really like they're wings, I didn't eat burgers but my friends said they were good. Their drinks are strong !!! And that's a good thing. <br><br>I got up to wash my hands as I walked towards the bathroom I notice there was a lot of empty tables  so I don't know why we had to wait an hour when there were so many empty tables!", "pics": null}}, {"review": {"des": "First and foremost, I had no idea what I was getting myself into going here. I was just going here to help my sister celebrate her birthday. <br><br>Warning *SPOILERS* If you want to enjoy the suspense of this place, Please don't read any of the reviews until after your trip. As I did! Just know this is a cool place to go with friends or family members.<br><br>*SPOILERS*<br><br>I walked into SafeHouse Chicago and was a bit confused, I thought I walked into the correct place but when I saw the young lady sitting at the desk I was very confused.  It looked like her personal office and I was interrupting her. Man was I confused! <br><br>I told her I was looking for the restaurant, she told me I was at the right place, then she preceded to tell me stuff I needed to do to gain access to the SafeHouse and to ensure I wasn't a double agent. HA!<br><br>As I giggled at what was happening, I did what the young lady told me to do and was granted access. I was happy to be done posing! I don't like being put on the spot like that, how dare that make me do stuff! <br><br>She allowed me to enter the SafeHouse and I went down some stairs and was given a new challenge. Figuring out how to get into the SafeHouse door. It actually wasn't that hard, but it took me a few seconds,more that 10 to be exact. <br><br>As I walked into the restaurant I heard clapping, Come to find out I was being watched, ain't that some ish! <br><br>Can you believe that had camera's watching me? <br><br>Anyway, the restaurant is pretty cool. I love the design and I can honestly say I have never been to a place like this, it was refreshing to go somewhere \"Different\" for a change! <br><br>The time put into this design is appreciated. There is so much to look at and do to keep you busy.<br><br>The food and drinks seemed to take a long time for some reason but everything else was perfect. All of the staff was super nice,I would definitely return here with friends. <br><br>Definitely come here and have a blast!", "pics": null}}, {"review": {"des": "Wooomp. When I walked into this place I was honestly so happy and when I walked out I was just so disappointed !<br><br>I came here with a few of my colleagues on Monday night, our first night in from NY. We walked through the door and Anthony was the most funniest and awesome person ever. We had to do the sprinkler to get into the restaurant. Ha ha it was just too funny. Finally, we got into the restaurant and - although we made a reservation, we had to wait 15 mins to get seated because our reservation apparently wasn't there. Hmm . After we finally sat down, we were so hungry because we already had a 30 min delay because of the dance to get into the restaurant and the delay to get seated. We ordered right away, hoping to get our food quickly ! We waited over an hour to get our food , when I finally had to go over to the hostess and I had to ask her where our food was ... at this moment , I already knew that the food has been sitting in the kitchen and she forgot to get it. As soon as I told her, she went in the back, and the food was ready.. the food came out looking absolutely delish! But it was COLD. My salad was missing the chicken tenders that were supposed to come with it so I asked the waitress and she took it back and they brought it back with grilled chicken (not chicken tenders like the menu said it would include). At that point, we were just frustrated that our food came out cold so we asked to speak to the manager. I explained to him what happened to our food and how cold my friends foods were , he said that he would pay for our meal right away. We just left and were so hungry at that point. The only reason I left 2 stars and not 1 is because we got the food for free and the manager was kind enough to offer to pay for the cold food that was served ! Customer service is reallly important and serving cold food is a turn off especially if we were just starved and waited about 1.5 hours just for seating and food. Just a disappointment. The pictures that I'll attach look so good, but it was super cold", "pics": null}}, {"review": {"des": "I'm more of the daylight fan and it's a bit claustrophobic down here without any windows, but this place is so much fun to visit if you simply want a change and do something else than a regular restaurant or a bar. <br><br>I would definitely recommend this place to any beer fan (like me) or a cocktails fan because both selections are great and I believe everyone can find their thing and preference. They also have fun huge size of cocktails for a big group. We tried Mission impossible and it was very tasty! But I'm glad I wasn't in it on my own and had some friends to help, otherwise I don't think I would be able to write this review and remember anything of this night... :-D<br><br>As for food, I have only tried their famous cheese curds appetizer and then tuna salad but both were great. Then I focused more on the drinking part. <br><br>Anyway, this place is lots of fun and the customer service is great. Definitely worth the visit!", "pics": null}}, {"review": {"des": "Not a fan. I found it to be kitschy and touristy. Lots of kids running around, even at around 10 pm. Not sure why I was surprised by this, but it does seem to be a fun restaurant for little ones. The other thing that threw me was the service. After our group of 4 walked in, the hostess asked if we had a reservation (we did not), hemmed and hawed, then informed us she could only offer us a table in the bar area. Bewildered, I looked around at all the empty tables. The other people scattered throughout the restaurant weren't together, so it couldn't have been a private party. What in the world?! I'm still scratching my head. <br>So we sit at a high top in the bar area and open the menu. $14 cocktails? Yikes. We almost left at this point, given the opening from the bartender who took a long time to get to us and btw never came back after we finished our round. This safehouse was definitely a bust.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/WHhwR-nwpHYwycWh5k37bQ/168s.jpg", "caption": "Two bar"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/PqlL30IG_DFBhBbHD3fEGA/168s.jpg", "caption": "One bar"}]}}, {"review": {"des": "I found this secret underground place when I visited Chicago back in November. While I was chilling at my hotel, I opened the handy Yelp app and started searching for restaurants nearby and the pictures online caught my eye.<br><br>I walked over but passed it a few times because there wasn't really a sign outside, just a street address. Knocked on a glass door covered in red film and a lady opened the door. There were several people already inside which look like an 80's inspired office. She asked what are we looking for and we said the \"Safe House\" or \"looking for food\". After several questions and trivias, she finally opened a secret door that lead to an underground passageway.<br><br>I've been to many themed restaurants but this place was over the top. There were surveillance cameras, floor to ceiling screens, maps, airplane cabin dining area and even the menu items were \"covert\" or \"spy\" inspired. For drinks, I tried the \"Live & Let Rye\" made w/ Knob Creek Rye whiskey, Campari, peach and the \"Agent Chi\" made w/ Koval Whiskey, Framboise, Sierra Mist plus a bonus syringe w/ more alcohol. Yes!  For grub, I got the Moab Burger topped w/ American, bacon, over easy egg and secret sauce plus a side of onion rings. The burger was meaty and juicy and the onion rings were big and perfectly crisp. I was pretty impressed by the presentation and quality.<br><br>SafeHouse may seem like a tourist trap but I have to be honest, the quality and service here were good. There's a lot of parents and kids running around but remember, this is a themed restaurant so it's not meant to be chill or romantic but the awesome spy themed décor and secret doors are enough reasons to check this place out.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/odrp2kvAk7AT3hN0Yu6zoQ/348s.jpg", "caption": "My delicious meal"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/fyGvkQcHNAqqGd7NZWzbKg/168s.jpg", "caption": "Perfectly crisp big onion rings"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/vgk0Yt3MQ27pezUNezokSQ/168s.jpg", "caption": "My delicious Moab Burger"}]}}, {"review": {"des": "Staff and bartender friendly and engaging, awesome! Atmosphere fun, visually appealing, and upscale casual. Nice selection of beers and creative cocktails. Had lunch. Food mediocre. Fries and onion rings with sandwiches warm not hot. Rueben sandwich small, bread and corned beef dry. Prime rib sandwich \"okay \". FYI- Weekend late nights, turns to DJ and dance club atmosphere.", "pics": null}}, {"review": {"des": "My second time in Chicago's SafeHouse was for a Yelp Elite event. #Control has expanded their menu and upped the clandestined establishment's food game, by quite a bit. One of my original criticisms of the Milwaukee and Chicago locations was that the food appeared to be a bit of an afterthought, when compared to the energy put into the theme, decor, ambiance and drinks. This is less the case now. The food has improved, and Saturday/Sunday brunch is now a thing, from 11am till 2pm.<br><br>The emphasis on the spy theme remains intact. Read my first review for the down and dirty regarding hidden entrances, secret passwords and covert cameras. The only concession over which I am not a fan, is that management has elected to put a 6 foot street level sign in the window, which clearly identifies the formerly surreptitious entrance to the public. I get it, people gotta be able to find the place before we worry about how cool it is, but give us some credit!<br><br>Anyway, next time you're on the run from an op gone sideways or  burned by your handlers, stop in for a bloody mary and the Las Espias Chilaquiles... just hope your location isn't #compromised by the big red sign in the window.", "pics": null}}, {"review": {"des": "I'll take this over Rainforest Cafe or any other kid friendly restaurants. SafeHouse was probably the most enjoyable family meal we've had in a long time. The kids were entertained from the second we walked in and were asked for the password to get into the restaurant. From there we were shown our table and greeted by Agent Tiny who gave my junior spies a list of missions to complete while we waited for our food. The kids immediately got to work and while I thought some of the missions were a bit difficult for 7 and 5 year olds (and even those of us in our 30s ha) they had completed about half of them by the time the food came out.<br><br>All the kids meals come in a box with puzzles and a cup that changes color, which they thought was super cool. They were also quite pleased with the kids mac & cheese (the white creamy kind), chicken tenders & fries (have to admit they were pretty good0. And us adults were satisfied with our burgers and wine.<br><br>After dinner they completed their missions and even my 2 year old was having a blast tagging along...sensory overload!! We watched them bring out the most amazing looking (and ginormous) ice cream sundae to someone celebrating their bday and all of my children made me promise I would take them back to SafeHouse for their bdays....6 months from now. Noted.<br><br>As other yelpers suggested we chose to pay a $1 to exit thru the secret backdoor, although Agent Tiny was sweet enough to ring us thru so we didn't even have to pay. However, it would have been well worth the $1 because my kids talked about our exit all night and the very next day.<br><br>It was such a fun family dinner! I saw a lot of people here without kids and wondered what they were doing here, but then again I think the same of all the adults who choose to do disney without kids.  Any I guess being a spy (or visiting Mickey Mouse) can be fun at any age!", "pics": null}}, {"review": {"des": "My friends brought me here for a little post birthday celebration. This was my second time and the experience was so much better and enjoyable. Nothing bad to say about the first time but this time we had more people, a more engaged server, we participated in the activities, tried the photo booth, got a personal table visit from the magician and just overall had a blast. We had Agent T-Funk and his trainee.<br><br>The drinks are a little pricey but it is downtown Chicago so it's expected. For food I tried the fried pickles, cheese curds, bean burger, fries and the brownie ice cream sundae. Fat I know...smh.  All of the food was good and served hot. We had a little mix up with the orders but the agent apologetically had no problem fixing our orders asap and comped us a little something something off the bill for the inconvenience. <br><br>Overall, we had a really good time and this was the perfect spot to come to with a small group.", "pics": null}}, {"review": {"des": "Let's just get this disclosure out of the way: SafeHouse Chicago is pretty great at what they do, I just don't like what they do.  I had no idea what I was getting myself into when I went there and I will never go back willingly.  That being said; You're going to love what they do!!<br><br>Ok, on to the reason we're all here....SafeHouse is a spy themed restaurant and bar.  When I say \"themed\" I mean \"over-the-top-kitschy-prepare-yourself-people-are-in-character\".  If you're looking for a fun place to entertain some kids for a while near the Magnificent Mile SafeHouse would be a great option (if your kids like spy stuff I guess).  They've gone above and beyond with making this interactive experience everything you could want in a spy restaurant, starting with the secret entrance all the way thru to the exit escape route.   <br><br>The food?   It's your typical fried bar fare (which we all know is absolutely delicious!).  I had the Classified Breakfast.  I, an independent adult who makes good money, had a funnel cake, eggs, and bacon for brunch.  And it was absolutely fantastic.  Oh, bottomless mimosas?  Yes please.  <br><br>The service was good.  All the staff really seemed to be enjoying themselves and were friendly and helpful.  (I know what you're thinking, \"Kate likes anyone who gives her endless amounts of champagne!\" but seriously, the service was really good).<br><br>SafeHouse would probably be a great spot for a kids birthday party.  As themed restaurants go in Chicago, they are one of the best I've been to.", "pics": null}}, {"review": {"des": "This is a hidden gem in Chicago, I must say(literally)! You will be standing out the door and you won't realize it is the entrance. Like other restaurants, you will expect a big fancy entrance but it is a small door which does not even say the name, so follow google maps and take your chances. We went here for a friend's birthday and we hit happy hour which was till 7 during week days. <br><br>When we entered we had to do a small task which was so funny. Without finishing the task you can't enter in the spy zone . <br><br>Right from the entrance, the ambiance, food and people over there, it was all fantastic and they have there personal magician who comes on your table which was awesome. Overall I loved the place, might go again soon. <br><br>And there any many surprises, which I'm not going to open it up here. Else, whats the fun!", "pics": null}}, {"review": {"des": "I have been to the SafeHouse once for lunch and did not have the best experience.  Based on a Yelp event I attended yesterday, I am revising my review for them.<br><br>I was there as part of a Yelp event to preview the SafeHouse's new brunch menu.  The staff and the owner outdid themselves in allowing us to preview their brunch menu.  <br><br>The GM was great and very enthusiastic about the place and the brunch.  It was interesting to hear about the history of the place, which is rooted in Milwaukee and had hosted some of Jazz's greats (Count Basie, Duke Ellington, etc.).  Then we went into an explanation of the items we would be sampling.  You could tell that he was very passionate about it.  Gotta say that it was very cool to be a part of the Yelp squad reviewing this new concept for the SafeHouse.<br><br>So let's run down the food.  Everything was delicious.  The menu is small, but mighty, which I prefer.  This is something I could do on a Saturday when they open along with a bottomless mimosa:<br><br>Las Espías ChilaQuiles:  fried tortillas tossed in a tomatillo salsa, Cheddar Jack cheese and topped with fried eggs all atop breakfast potatoes.  This was by far my favorite dish, which is surprising as there was not a single piece of meat in it.  The salsa was amazing and have a lovely twang to it.<br><br>Classified Breakfast:  combination of scrambled eggs layered on a funnel cake, served with pepper smoked bacon and breakfast potatoes.<br><br>FUBAR Griddle:  a breakfast burger in a donut bun. A hand pattied burger topped with bacon, ham, cheese and a fried egg.  That was amazing!  Never thought I would eat something that looked so country but tasted so good!  On the surface, it sounds like something Elvis would have eaten, but gotta say I am joining the club.<br><br>SafeHouse Skillet:  combination of pepper smoked bacon, honey baked ham, Cheddar Jack cheese and fried eggs served on top of breakfast potatoes.  Solid dish.<br><br>The B-1 Bomber:  homemade funnel cake made with fruit loop batter and buttermilk fried chicken.  Very different but good.  If you order this, you will be put down for the day as it is huge.<br><br>Duquesne Burger: Black Angus and chorizo burger topped with Pepper Jack cheese, a fried egg, avocado, cilantro lime vinaigrette and chipotle mayo, all on a brioche bun.  Two words:  Awe-some!<br><br>Overall this new brunch menu would get me back into the folds of SafeHouse.  I am still not a fan of the concept, but for me, good food and service overrides all else.  Here's hoping that the new brunch menu works out.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Rre9mikiQjHMhiRgaq8ycA/348s.jpg", "caption": "Duquesne Burger: Black Angus and chorizo burger, pepper jack cheese, fried egg, avocado, cilantro lime vinaigrette and chipotle mayo"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ap39zB_UvSTj6R4ytMHIuA/168s.jpg", "caption": "The B-1 Bomber: funnel cake and buttermilk fried chicken"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/SvQbRA4XiPnVf9_wP4UA9g/168s.jpg", "caption": "Las Espías ChilaQuiles: fried tortillas tossed in a tomatillo salsa, Cheddar Jack cheese and topped with fried eggs served over potatoes"}]}}, {"review": {"des": "Such a fun restaurant!  Visited this establishment recently and must say that it's not quite like any other restaurant I've been to in Chicago before.  I have a lot of restaurants yet to visit, but this one so far is the most interesting and original.  I want to note that this is a great place for families as well as date nights.  On this occasion I visited on a date with the boyfriend, we went to the James Bond brunch.  The brunch is a newer option that they have available, it was the 2nd weekend they were introducing it.   We arrived at 11am on a Saturday, their opening hour.  Although we had reservations it wasn't necessary as there was no wait.  <br><br>At first glance there is not much to see from the outside, but when entering you will be asked for a password and unless you have been given this from someone who knows it you will be asked to perform some sort of challenge given to you by the host.  For us, it was 3 ninja moves - and so that everyone can see your smooth moves, there is a camera in the room that lets everyone in the restaurant see. Ha!  <br><br>You depart through a secret door and down the stairs to the restaurant.  The décor is very cool, an underground operation/agent headquarters theme with no windows, lite-up walls of globes and maps, and James Bond themed decorations. There is a Memorial War that is cool as well.  Have a glance at the bathrooms while you are there, I won't give out the details but they are pretty humorous.<br><br>We feasted from the brunch menu but the regular menu is also available.  As an appetizer we had to try the cheese curds as we had heard they were some of the best around.  I recommend that you try these as they lived up to our expectations!  Be forewarned, food portions are large and you will get full!  We ordered the Classified Breakfast and the B-1 Bomber from the Bond Brunch menu and both were good.  My only recommendation is that the funnel cakes need to be a little more tender, they were slightly tough to eat.  Our waiver, Agent Zero, was exceptional and very welcoming.  The manager also came around and gave us some of the history of the SafeHouse and it's start in Milwaukee.  As a super cool bonus they honor veterans, service personnel and active military on a regular basis, not just Veterans Day - with a 25% discount. <br><br>Upon leaving you have the option to exit through the elevator by the entrance or pay an additional $1 to leave the fun way.  The fun way takes you through a series of rooms and then has you dodge through room lasers, at the end you come to a stairway full of \"agent\" stickers where you can leave yours behind.", "pics": null}}, {"review": {"des": "So, the owner of Safe House comments on my original review and gives me an email to follow up with someone named Peggy Smith. I followed up. They didn't. Thanks for the insult. Great way to run a business.", "pics": null}}, {"review": {"des": "The idea of SafeHouse and the execution are definitely 2 different things. Your experience is Hit or MISS! We waited 15 minutes past our reservation because there was a party of 64 ahead of us. We, party of 3, received no badges and little information. Luckily,  in our time to wait the bar staff gave us menus to look at so we knew what we wanted to eat. Our waitress was flustered most of the time. Food is mediocre and brought out lukewarm. Of course part of the order was incorrect and had to go back to the kitchen. This was supposed to be a Sweet 16 birthday event but turned out to be a bad memory.", "pics": null}}, {"review": {"des": "Went with a friend, while in town for business. Had a great time! Fun atmosphere. The food is delicious with large portions and the drinks are innovative. Great concept. Bring the kids too!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/E2n2kKysgG_gxWUEQmCM8A/168s.jpg", "caption": "The all seeing eyeball"}]}}, {"review": {"des": "Stopped in on a whim last night and I wasn't disappointed at all. I love the whole spy theme and that all the workers seem happy to play along. My son was feeling a bit under the weather and they took his meal back since he didn't eat it and the manager even came over to our table to make sure everything was okay. She even gave us a free drink. I definitely would like to return with friends so I can enjoy the experience. I was very pleased with my visit I can't wait to come back!", "pics": null}}, {"review": {"des": "This was a great find!  We just got done playing in the escape room next door and we found this place on yelp.  When you first walk in, it was so strange not seeing a restaurant but a small room decorated like a library with a small desk.  There was a lady asking for a secret password and none of us knew it.  Since we didn't know the password she made us do two silly but fun things.  One was wear a small costume and sing the YMCA and the other was to dance the sprinkler.  Then she opened the door to let us through and we had to go downstairs to the actual restaurant.  The waitress seated the 6 of us  right away.  Then we found out everyone is able to watch the shenanigans upstairs in big screen :). The whole restaurant was themed with spy ware like some James Bond memorabilia and paintings.  The menu carried the spy theme with everything named appropriately with a spy theme.  I got the Moab Chicago #1 burger and we got the cheese curds as appetizers.  Both were really good.  I love fried egg on a burger and it was so tasty!  The waitress was very attentive and kept filling giving us water and drinks.  The prices weren't bad and the experience and dining was well worth it.  Then you get to leave through a hall of lazers having to avoid them which was a nice final touch.  I will definitely bring others back.  We figured out the password but we won't tell.  The experience is half the fun!", "pics": null}}, {"review": {"des": "I had previously heard of Safehouse in Milwaukee and have always wanted to go. I was at skeptical of how positive the reviews seemed but was genuinely impressed by my experience at Safehouse- Chicago.<br><br>First and foremost- in order to ensure a good experience here, make sure that: <br>- You are with good company<br>- You are not in a rush<br>- You come with an open mind/wanting to have a good time<br><br>When we arrived at the entrance, we were told that we had only a slight chance of getting seated at the bar since we did not have a reservation, however we insisted that we were willing to go regardless. It was Saturday night- in the prime of dinner time- when we went. I'm sure that some days are actually quite busy, but in this case, I think they question you at the door as a ruse for the secret agent theme. My advice: Go for it! Keep persisting that you want to go to prove that you are worthy! After we were able to make it past our agent evaluations AKA the YMCA, my boyfriend and I were easily immediately seated. <br><br>I could probably go into great detail about the whole experience but I'll try to keep it as concise as possible, since all the other reviews do this place just as much justice:<br><br>Staff:<br>- Such a thrilling entrance to be greeted by applause from the staff<br>- Our waiter, Agent T-Funk was awesome. He gave probably a 10 minute long spiel about the Safehouse background, menu breakdown, food recommendations, password hunt, and more without missing a beat or breaking character. Give the man a water and an Oscar!<br>- Everyone stayed in character and everyone was incredibly friendly even though we walked around and were extremely nosey<br><br>Ambience:<br>- The execution of the spy theme is perfect- from entrance and exit to the staff, to the live monitors, to all of the cool gadgets and décor. There is great attention to detail even in the bathrooms. Apparently the toilet in the men's bathroom says \"Your package is secure\" after flushing!<br>- The music is refreshing! I absolutely loved that they had 90's music rather than the top 40's or something cheesy. <br>- This is definitely an Adult's playground- actually it's a kid's playground too! They allow kids/minors until a certain time<br>- You are encouraged to explore, push big red buttons, open things, and have a good time! <br>- We were informed that Safehouse is also a place for nightlife and serves a small menu approximately until ~1AM or so. The colored floors become a dance floor and on Thursdays there is even burlesque!<br><br>Food/Drinks:<br>- I admit that the wait was a little long, but I was no means upset by it since there was so much to do in the meantime as we explored the restaurant.<br>- Your waiter will find you and notify you when your drinks/food arrive- our waiter brought us our drinks as we were in our Photobooth shoot!<br>- The burgers are delicious. The best in Chicago? Debatable. But, a solid burger? Definitely. I had the MOAB and was impressed by how balanced all the components were in terms of texture and taste.<br>- Drinks: I shared the Espionage and Sterling Archer. They tasted unique but were on par with any other well-crafted cocktail. I think the prices are also on par with any other Chicago bar.<br><br>Overall:<br>If I were to isolate the food itself and the experience, I would still give both 5 stars. This place serves very solid American food and the prices are actually quite reasonable. I don't often revisit restaurants unless they wow me, but I would love to come back here with a new round of agents and recommend the experience to them. I hope that Safehouse keeps up their awesome service and can prove to provide a consistent experience in the future.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/OSBhZ7QWDWCUE5fKDZkQ-Q/348s.jpg", "caption": "Agent wall"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/iv5ie0Gvlxl79d7W7toRZA/168s.jpg", "caption": "Bar"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/CWLhlqIh840NjPGA9pQXTQ/168s.jpg", "caption": "Bathroom"}]}}, {"review": {"des": "I really thought that SafeHouse would be cheesy and gimmicky, and I was right. But it was also a ton of fun.<br><br>Being from Wisconsin, I've heard about SafeHouse's Milwaukee location so finally decided to check it out in Chicago and I was not let down. <br><br>I went with my fifteen year old brother who also really enjoyed it so it's fun for all ages, but it also seems like it could be a good time to get drinks for happy hour to break up the monotony of the standard River North fare. The food was also surprisingly good! I had the Provacteur burger if you want to try something different. <br><br>I don't want to spoil any of the surprises or give any clues away, but just go with the flow of the staff and it'll be a good time. It's themed without being completely obnoxious and gimmicky without making you want to roll your eyes.", "pics": null}}, {"review": {"des": "Occasion: Friends<br>Tip: Just be ready to be seen.<br>Experience: It was a lot of fun to be able to go somewhere figure out how to get there. The inside of this place was amazing and a lot of fun. The drinks were good and the people were sweet. The only thing I wish the tables were not as sticky, but that happens on a busy night. The staff made it an enjoyable upbeat meeting, and the drinks could make you feel or think that you can dance. I would bring my friends back here again.", "pics": null}}, {"review": {"des": "Convinced the rest of the family to come here instead of the Rain Forest Cafe...To say the least it was a good choice...We didn't have reservations, so the women told us it would be about a 45 min. wait which wasn't a problem.. We did what was required to get through the secret door...Lol...<br>Now for the food and service...we started out with the deep covered pickles,nothing special there,though I really liked the sauce. Then we had the Code beer which was good...we ordered as a meal \"Mission Impossible Burger, The Provocateur Burger and the Mata Hari's Meatloaf with mashed potatoes...Everything was very good... I truly enjoyed the Provocateur..For desert we had a type of cake/ pie that tasted like cream cheese...<br>The waiter was very good didn't come around to much,which I liked, the food came out quickly and was correct (VERY IMPORTANT!!)<br><br>I have been to the one in Wisconsin and I will say this one was just as good...", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/g_0X_7SSFr8SmnDhPFYgIg/348s.jpg", "caption": "The Provocateur burger..."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/0Ww8VekPglxeUx9x7Gc5LA/168s.jpg", "caption": "Mata Hari's Meatloaf..."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/oOH2HQNJB4c3bKijDPiLVw/168s.jpg", "caption": "Code Beer"}]}}, {"review": {"des": "I've gone to the Safehouse multiple times.   When I went last night I was very disappointed.   When I sat down with my friend, the person who sat me didn't give us a food menu.  We didn't know when they sat us we were sitting in a section where we had to order this $30 pre set menu and the only place to order just an entree or just an appetizer was at the bar.  I was very disappointed because they forced us to purchase something we didn't want and the only way to not purchase that was to sit in the bar.   I use to recommend this place but I will not be doing that anymore.", "pics": null}}, {"review": {"des": "If you have kids this is a really fun place to have dinner!  This spy-themed restaurant is just off the el and easy to find - just look for the red door. ;) Upon arrival, agents in training are put through a series of top secret spy tests to make sure you are not double agents.  Once you are cleared, you will be allowed to descend into the spy world underground.<br><br>I won't give you spoilers, but there are fun missions to go on while you wait for your food.  Speaking of the food...it was really good.  The cheese curd appetizer was amazing!!  The kids had the Mac and cheese kids meal and the junior spy burger, while the adults in the group had the spy burger (inside agent) and the Moab burger.  Both were incredible.  The inside agent adds cheese, fried pickles, and a special sauce to the regular spy burger.  I definitely recommend making this upgrade.  <br><br>The only reason I couldn't give them 5 stars was the service.  Our waitress was nice but not friendly and definitely not attentive.  At the end of the meal, she quickly told me to exit through the wall \"over there\", which took us to a \"pay to exit\" area.  Apparently there is a free way out that was never mentioned.  The pay way wasn't worth paying for.", "pics": null}}, {"review": {"des": "Honestly, if there was a way I could relive my first experience coming to SafeHouse every time I come back to SafeHouse, I would. Without going into so many details that could give you any sense of what to expect when you come here, I will say - don't prepare yourself. Come with an open mind. Be ready to have fun and let loose and immerse yourself in Cold War-era spy culture bar that you won't find anywhere else in Chicago.<br><br>Though I have yet to try the American cuisine offered at SafeHouse, the drinks are kitschy and fun - a little sweet for my taste, but they ultimately add to the theme of the bar. The bartenders and hosts all adhere to the theme, which is just the cherry on the cake of the whole experience. Again - have fun. Let loose. Play along. It's an experience you won't have anywhere else!!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Ap1yE1GjuGjVkv_WFqmKwA/348s.jpg", "caption": "The Agent Chi ($14.00). The Fraboise is contained in the syringe for you to add yourself!"}]}}, {"review": {"des": "I came here for a Yelp event. The waitstaff were courteous and quick with service. I really loved the finger food, the black bean burgers were especially tasty! I love the spy theme of the place and its all kinds of interactive pieces to play with. I felt like I was in a Bond movie!  I would come back again.", "pics": null}}, {"review": {"des": "This place is just insane. Thanks to the amazing Agent TBD and his excellent hospitality skills, we were able to get in to Chicago's elusive spybar. You would never guess that it was there. Disregard any text on the outside, or the spy silhouettes, or the advertisements....okay, if you're paying attention, you'll know where to find it. This bar is super cool though, everything you've loved about every spy movie wrapped into a super neat bar. Gadgets galore. A great selection and things to keep you occupied at every moment.  I have ventured to say that it is my favorite bar to exist. Can't wait to come back in town for my next stop - thanks Agent TBD!!!", "pics": null}}, {"review": {"des": "If you're a curious person who likes to solve things and find clues...SafeHouse is the perfect place for YOU! There aren't many places where you can have a great time, walk around PLUS eat scrumptious​ food. Well, at SafeHouse you can there are many options to choose from. The burgers are to die for. Great place to take family or friends.", "pics": null}}, {"review": {"des": "This is a bar that is worth going to at least once for the experience.  The food is typical bar food and it is very much not amazing.  The drinks were not particularly exciting. However, if you go with an open mind, everything from the game you play to enter the restaurant to the photo booth to the decor of the place itself is pretty interesting.  There is also a scavenger hunt that you can choose to do or not to do.  You don't really get a prize or anything if you complete the scavenger hunt.  It's just there for you to have fun with if you want.<br><br>There are several ways to figure out the password - I figured out the password three different ways myself.  In fact, you might even figure out the password without realizing it.  Ask a waiter if you need help.", "pics": null}}, {"review": {"des": "Unfortunately, I cannot review the food or the menu. We had a reservation for 8:00PM. Unfortunately at 9:00 PM we still did not have a table. People waiting, that also had reservations before us.. had been waiting 1 AND 2 hours. <br>The hostess, had no information as to why they were backed up.. or when we would get a table.  We finally left as did other parties, because not only had we waited an hour , but they could not tell us when we would get a table. The frustrating part was no communication AND the fact that we had a reservation. Maybe this was a bad night?!?!?<br>It looked like a lot of fun, and the entry way and first \" secret agent\" was great. DISAPPOINTED!", "pics": null}}, {"review": {"des": "Came in one evening and had a blast!<br>Came in the door and had to pass a test, to make sure I was worthy of course. <br><br>Once inside it was an adult playhouse. So many cool things to do and see, with a great group of friends. Tip: look everywhere you go as there are probably a bunch of cool tasks, facts, and so on to entertain you. <br><br>The drinks were great and the service was just as good. Food was good and their sliders are a must try. <br><br>Highly recommend coming here or to the location in Wisconsin if you are in the area. The door is a bit hard to find, so dont overthink it, you are in the right place!", "pics": null}}, {"review": {"des": "Stopped by for a friends birthday after a pub crawl.  It's quite an interesting place, first your greeted by a man who calls himself a secret service agent who's job is to interview your group and make you do weird acts around the room.  After paying $5 entry your allowed downstairs which is the restaurant and bar area.  It's another adventure downstairs, they can actually see you doing all those weirdly things upstairs.  There is an interrogation chair which totally grills you if you dare to hop on. <br><br>We missed the dinner portion but the dessert looked amazing!!  I'd come back to experience their menu.<br><br>Over all restaurant is decorated with Halloween themed but I'd imagine it's changed thru the year.  There is a fun photo booth which allows you to take selfies around the world, super fun!!  I went to Tokyo and Moscow on the same night! How cool! <br><br>Must checkout if your looking for fun lively place for good times!!!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/cB8bvE90s30n2du76BLi0w/348s.jpg", "caption": "Sweet tooth anyone????"}]}}, {"review": {"des": "Tiny made our night! This place was awesome. Great atmosphere, great drinks, and partying all night!", "pics": null}}, {"review": {"des": "Super fun for the kids-cheesy for adults though. Food is not great by edible. You come here for the experience which is awesome. Feels like you're in a play area with spy equipment snd secret areas to go into. The bathrooms are awesome. <br>Pay the extra $1 and exit through the back door-you won't regret it!", "pics": null}}, {"review": {"des": "Family did the gold rush escape and loved the game. Our host really helped with hints. We want to try another game tomorrow. <br><br>This Place is clean and well structured compared to other escape room establishments I have been too.", "pics": null}}, {"review": {"des": "I was very excited to visit SafeHouse! I went on a Friday and had been looking forward to it all week. First impression especially upon entering was really cool. The hostess on the first floor was really fun and engaging. <br><br>That's pretty much the extent of the positives. <br><br>Food was way overrated, overpriced and didn't resemble any of the pictures on Yelp. Every person in our table of 4 got a burger and we were very underwhelmed. No flavor! <br><br>I was REALLY looking forward to the cheese curds. They came out all clumpy and attached together. <br><br>Drinks were very basic. I'd rather spend my $14 per cocktail elsewhere. <br><br>I think the worst part was the waitress. She literally dropped everything she picked up from the table, from the massive silverware that the place has to a stack of menus. <br><br>Summary: food is meh, drinks and meh, place is overpriced for what they have to offer.", "pics": null}}, {"review": {"des": "From start to finish, it was an adventure.  Even finding the restaurant was a task.  Won't ruin the experience for others by spoiling but let's say becoming a good spy is not as easy as it seems! Well, maybe it is... as long as you can dance!<br><br>The waitress referred to me and my boyfriend as agents. Always wanted to be one - dream come true! While we waited for the food, we had to solve some puzzles, which made the time pass my quickly.  They also had creative names for everything. For example, they call the check \"damage report\" which I thought was very clever.<br><br>OK on to the food!<br><br>I had the Mac and cheese and it was delicious!! <br><br>My boyfriend had the MOAB (mother of all burgers) - apparently Chicago's #1 burger. I personally wouldn't say #1 but it's up there for sure!<br><br>Only downside to this place is that it is pretty pricey. Don't think I would come too often but it's good for a first visit!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/QGI9MHyacl60zVPBrS4IBw/348s.jpg", "caption": "licensed to kill mac and cheese"}]}}, {"review": {"des": "While on a business trip to Chicago, I was staying on Magnificent Mile and went to Yelp to find some place fun to eat and enjoy for dinner by myself. SafeHouse came up as being close by and had decent ratings. It was a tad tricky to find as there was no light up sign outside of it, as every other restaurant nearby did. There was an arrow with wording about SafeHouse on the wall next to the entrance. I walked in and approached what seemed like a receptionist for an office, confused, I asked for clarification if this was SafeHouse --the restaurant/bar. She confirmed it was. After doing a hula hoop trick, I was allowed in. Little did I know, there was a camera in there and everyone at SafeHouse could see me. <br><br>After entering, I chose a high top near the bar. The whole bar is spy themed and you are treated as a spy. I thought it was kind of cheesy, but everyone who works there is totally into it and in character. There's a scavenger hunt type of deal that you can participate in throughout your dining experience, I opted to skip this. <br><br>I ordered the Colombian Salad. It had shredded lettuce, black bean corn salsa, shredded cheddar jack, pico de gallo, avocado crema, and seasoned tortilla chips. I chose it with house-smoked chicken and it was tossed with chipotle ranch dressing. I chose the Goose Island 312 to sip on. <br><br>Overall, the experience was definitely different than an average sitdown meal at a normal restaurant, which made for a fun time. I spent about $40 on dinner (tip included) and was content with the choice. If I'm ever in town again and with a few friends, I may want to check this place out again, but not sure if I'd go rushing back by myself again.", "pics": null}}, {"review": {"des": "This place is great...to get the most out of it just play along!! If you're open to a good time, you'll have a good time.<br>Food & Drinks: Agent Chi to drink -strong and sweet-pretty good. More fun for the photo! Also got the Cuban Missile Crisis and onion rings. The sandwich was amazing-definitely would get this again. Onion rings were okay...crispy-but not the most flavorful-definitely ask for their spicy ketchup!", "pics": null}}, {"review": {"des": "Hahaahaaha i wont spoil this for you. But i have one sentence for you  U WILL NEVER EVER FORGET THIS EXPERIENCE. Food is unbelievable. Coolest ppl ever<br>I would go back in a heart beat. Loveeeeeee it.", "pics": null}}, {"review": {"des": "Secret agent/ spy themed speakeasy. It would be a great place for kids to enjoy for sure. The servers are very energetic and into character. The vibe and decor of the entire restaurant was designed for this particular theme, with lasers, shuttle buttons, etc. I did not personally enjoy this place a whole lot, although the idea is extremely cool. It definitely felt like a tourist attraction, so if this is what you're looking for, you're in luck! We got the fish and chips which were good. This place just wasn't for me. But it is amusing.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/oov881b9C0OgIz3-BFXurA/348s.jpg", "caption": "Furtive Fish Fry"}]}}, {"review": {"des": "SafeHouse is a really cool, kitschy bar/attraction that we somewhat stumbled upon in downtown Chicago. We saw it on Yelp but didn't know quite what to expect and had no concept of just how immersive of an experience it would be.<br><br>I won't spoil it too much, but there's a lot of cool stuff to see and do here, so have an open mind and leave yourself some time after your food/drinks to mosey around and find some of the hidden secrets. We weren't super hungry, so we just got an appetizer (the cheese curds) and a dessert (brownie cheesecake). The cheese curds were good but not great--I would try something else if I ever visit again. The cheesecake was pretty good as well. The best thing about was our server, Agent Candy, who went all in with the theming to give us the best possible experience. This is Agent Julep, signing off.", "pics": null}}, {"review": {"des": "Cool place to have drinks with friends after work but also really dark and loud. <br>If you want some Funtime with friends make sure SafeHouse is on your list of places to stop. <br><br>* cool space<br>* great location <br>* great staff<br>* a secret place not everyone knows about <br><br>Thanks SafeHouse. Good times.", "pics": null}}, {"review": {"des": "I was so confused when we arrived. We entered escape room and then the entrance to SafeHouse. The two greeters made us walk around flapping our arms like birds. Then they made us chirp like birds, it was fun. <br>Once we got in the restaurant, it definitely looked different. There was a mellow atmosphere and the service was good. <br>I got the Mac and cheese and my best friend got the burger. The burger was better tasting than the Mac and cheese. The Mac and cheese was too salty so I ended up just sharing the burger. <br>Final word, I'll try something else on the menu if we come back. Three stars for the service and good tasting burger.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/1HOBoILhHRs5hBnZ6_EAxw/348s.jpg", "caption": "Mac and cheese"}]}}, {"review": {"des": "Well where to start.  We went to celebrate our 7 year olds birthday, and I must admit the spy theme ambiance was well executed, and there are a lot of things to keep kids amused while you wait for your food, however our particular experience in regard to the wait was extreme to say the least.  We had 6:15 reservations and were seated quickly, our server seemed nice enough but was far from attentive to say the least.  We placed our orders and at this point, you are encouraged to complete the scavenger hunt to pass the time. Our server said she'd let us know when our appetizers arrived, and to feel free to leave the table.  This is where the the night went off the rails.  <br><br>An hour passed and we had roamed the restaurant to its full extent, but our waitress was not to be found.  After an hour had passed, we were finally informed the wrong table received our appetizers, so we'd have ours comped, fair enough as mistakes do happen.  Unfortunately, some sort of mix up must have happened again.<br>We had not seen our server for quite some time, and 2 tables that were seated after us had been served their food, and left, before we had even received our entrees.  At this point, it was 2 hours since we were seated and we knew something was up, so I asked a manager if he could please check on our order.  <br><br>After that, we did promptly receive our food (finally), but our child was tired, and we had to rush through the birthday dessert they provided.  The food was ok, but I must admit I had somewhat lost my appetite as well as my patience.  After we had left, it had been almost 3 hours in total, and to rub salt in the wound, we had parked in garage down the street, and any parking over 2 hours is 49 dollars, a comped appetizer far from made up for our poor experience.  Unless you have all the time in the world, I suggest you go elsewhere.", "pics": null}}, {"review": {"des": "Theme is fun. Everything else was a total fiasco. From water pouring out from under the bar, to our full order being delivered to our table twice. Our server was working his butt off but it was a god awful experience. Food was bad. Ruben was bad. Tacos were bad. Kids meals were bad. It even sucked just trying to leave. Night out with the family on vacation totally wasted.", "pics": null}}, {"review": {"des": "Terrible experience.   The wait was well past our reservation time.  The place was dirty and loud.    When our food came it tasted like it came straight from a microwave.   Parts were hot and scorched and other places still cold.    On top of that it wasn't cheap.", "pics": null}}, {"review": {"des": "I was so excited to finally check out SafeHouse. I wont give out all the secrets but everything was super fun. My friend and I had a 7:45 reservations and we made it to the host stand just before 7:50. She said since we arrived early we would have to wait a bit (umm okay). When we were seated our Agent ( waitress) came by and we placed our drink orders I forgot what it was called but it was a essentially a Moscow mule ( good). We also placed an appetizer order of onion rings because we were STARVING! Drinks came, and we waited, waited and waited for the appetizer. It literally took forever. By the time they came out we had no plates, no silverware nothing and by the time the waitress brought them out we had annihilated the onion rings. <br><br>For our entrees my friend and I got a burger to split. I think it was delicious? Why the question mark? Because it come out around 9:15 and WE WERE STARVING! By that point we were ready to head out.  On our way out we tried to take the regular way out but someone came up to us and said \" nonono take the fun way out\" we were put in a room and it took us a hot minute to figure it out and then realized we needed to put in a dollar. REALLY!!!?? We were not having it at that point and this was not making it any better. <br><br>I would for sure give this place a 2 star rating because it could have gone wrong last night it did. But it was a fun experience ( or it was supposed to be) it's great for tourists, groups of friends, and super kid friendly. But this was for sure a one and done kind of visit.", "pics": null}}, {"review": {"des": "I really, really, really wanted to like this place. But wow, this was quite a disappointment. I've read about SafeHouse for a few months and finally got the chance to go last Friday. I was excited for all the cool secret things to explore and the awesome burgers. After coming in, my friend and I had to perform bodybuilding moves to get in since we didn't know the password. The guy at the front pressed a button and a secret door opened. Unfortunately, that was probably the peak of this experience.<br><br>After being seated, it took about five minutes for our waiter to serve us. He introduced himself as Agent Happy. Uh oh. I had just read a negative review about how he took forever. We immediately ordered (two MOAB burgers). After fifteen minutes of wait, he came back and said it would be out shortly. For the next fifteen minutes, I saw literally every waiter hustle in and out of the kitchen except for him. It took thirty minutes to finally get our food. <br><br>The burgers are a decent size and they come with a large helping of fries. I could barely taste the bacon and the egg was very messy. The horseradish in the secret sauce was also too strong. I wouldn't consider this the #1 burger in Chicago. Agent Happy came by again and asked if it were worth the wait, as a joke, and all I could give him was a sarcastic \"ha ha\". <br><br>After the dinner, my friend and I explored the restaurant trying to find cool things. There weren't that many. Even my waiter had to ponder about the interesting things to play around with. We went to go leave through the \"secret exit\", and it turns out you literally have to pay $1 just to dodge a few lasers. Super cool. Maybe I was just jaded by the extremely slow service, but I wasn't a fan of the food or the ambiance.", "pics": null}}, {"review": {"des": "Super fun experience, delicious food and service, and amazing cocktail drinks. I liked all the excitement it brought, pretending to be agents and the agent talk, every time he would come to collect our plates he would get into character and say\" here let me remove the evidence\"! Sooooo we never figured out the safe house secret pass but i really enjoyed everything else.", "pics": null}}, {"review": {"des": "I initially attended a Yelp event here and liked it so much that I brought back my whole family just a few days later. Being a true spy hangout,  it of course requires you to provide a password  in order to enter the restaurant. In case you don't know it, you have to dance your way in. By the way, in the restaurant they have closed circuit TV's where patrons can watch people doing the entrance dancing. The decor is fabulous. There are portraits of infamous historical espionage figures such as Lenin and Mata Hari, as well as a display of spy tools. The food is simple and delicious.  I really liked fried curds and Wai Lin Ahi Tuna salad. A fun themed spy restaurant that is geared to everyone's taste from ages 5 to 95.", "pics": null}}, {"review": {"des": "I came here to celebrate my birthday with some friends. We showed up ten minutes early for our reservation and was told we had to wait, which want a problem. But we went back up to the front desk at the time of our reservation to see if our take was ready and was told we had to wait another 20 mins. They told us everyone made a reservation for the same time. What's the point in having people make reservations if you can't accommodate? <br>When w finally got it table, it took forever for our order to get taken, and it took even longer for the food to come out. When it entrees came out, my friend noticed a piece of metal in her pile of fries, and obviously all our or fries were fried together, so we had to complain and got her meal taken off the bill. They brought her new fries, but it was almost double the portion she originally got, which was even more than the portion I received!<br>We planned on getting the f.b. for dessert to celebrate my birthday, but we didn't want to wait another 30 mins for it to come out so we just decided to leave at that point. There were other things could have been better, but at some point been just stopped caring. <br>I will say the nachos and cheese curds were    good....unsure if it was because they were actually delicious or we were just starving from waiting so long for the food.<br><br>The manager offered me a gift certificate for the subpar experience I had, so if I ever receive it, I'll update my review.", "pics": null}}]}