{"name": "sapori-trattoria-chicago", "reviews": [{"review": {"des": "Came here for a treat with my friends! This is the second time I have been to Sapori Trattoria and it was even better than what I remember. <br>The ambiance is dimly lit with the feel of a cozy, small restaurant. I had a reservation but arrived earlier than expected and even then was seated promptly. <br><br>I had the vegetable lasagna and was it DELICIOUS! The portions are generous, all of us took home left overs and they were just as good to reheat and have for lunch or dinner the next day. My friend told the waiter what she had a taste for and even though it wasn't on the menu, he quickly accommodated her request and created a pasta she was craving that evening. Well done Sapori, I will definitely be back sooner than later.", "pics": null}}, {"review": {"des": "SAPORI TRATTORIA. Known to regulars as ~Sapori~ is always an all around good experience. Dates, birthdays, fat nights with your girlfriends (how I most frequently dine there), the service is top notch, the wine is not expensive (always get by the bottle), and get prepared to eat THE BIGGEST PASTA EVER. <br><br>Don't come here if you want grilled chickennnn or salmonnnn. Come here if you want creamy gnocchi, big meatballs on your spaghetti, etc. Hene, wear your leggings or be prepared to unzip your jeans. <br><br>The warm bread is refilled throughout the meal. Start with the Brussels sprout Salad, so darn good. I usually get the butternut pasta so toasty and warm. <br><br>I also love the Owner here. My table took a while a few weeks ago after we made a reservation on Yelp, and he got my group and I drinks on the house. <br><br>They also clearly care about good customer service, they ask you to hand write a review every time you get your check, and just by doing so, you can start to receive LEGIT coupons in the mail from them for discounts - real discounts like $13 off your meal. They also wish you a happy half and happy real birthday. Gosh I love them.", "pics": null}}, {"review": {"des": "We enjoyed our dinner. Entree portions are large - we shared a Bolognese and asked the kitchen to split. Our dishes were both plentiful for a half order each. Our server was quirky and attentive. <br><br>We did the Burrata and the Grilled Calamari to start. I really liked the Burrata, but wasn't entirely sold on the Grilled Calamari. The sauce on it is what maybe threw me off.<br><br>Was in for an early bday dinner and was surprised by a candled bday tiramisu brought out at the end by our server. We also got complimentary espresso with a Yelp check-in. Will probably be back to try other dishes since it's nearby ! <br><br>Also did not realize there's a second floor. We were seated up there in a cozy corner.", "pics": null}}, {"review": {"des": "I appreciate the service and the ambiance here.  But I will not be coming back here.  This restaurant is a huge expense compared to the meager portion I received.    The wine here was good, but not worth $50.  <br><br>The Chilean sea bass was $32 and consisted of maybe 8 ounces of fish and a few small slices of potato.  The entree is billed as \"pan seared,\" but is not even close to pan seared. It appeared to be baked, but it certainly wasn't seared.  I would change the description to say \"adequately cooked and undersized.\" The wife ordered mushroom risotto for $23 and there was a lot of rice. Nothing special.<br><br>What was okay here were the mussels with red sauce.  I would call them adequate.  <br><br>We bought a voucher. Yelp advertises a $20 voucher for $11. We paid for that and were told by the server that we could not use that voucher and Ali get the free cappuccino we are supposed to get from checking in on Yelp.  Nothing on the Yelp page says that you cannot do both.  Further, the voucher itself says that the business may impose no additional requirements.  The server gave us a \"break\" by \"letting\" us use both. <br><br>The cappuccino ended up not being cappuccino anyway; it is black coffee with foam. Putting foam on coffee does not make a cappuccino. <br><br>Then we asked for a dessert menu because it was a special occasion (no one asked), but instead the server delivered the bill.  So we left.  No big loss.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Kokw0BT3WyQMWeGaKFWWsQ/348s.jpg", "caption": "\"Cappuccino\" that is really black coffee with foam"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/cXgvjLLOM1Mm30tJ26lwqw/168s.jpg", "caption": "Chilean sea bass"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/08fjraUmFDyswGBB7RnxYQ/168s.jpg", "caption": "Mushroom risotto"}]}}, {"review": {"des": "This is the place to go to for GREAT Italian food! Everything we had was delicious. The service was good, and the location offers free parking next door at the home depot lot. Usually you end up paying a ton for parking so this was a nice perk. I got the lamb chops because i was in the mood for some meat and it was tasty and flavorful. For desert we got the chocolate rasberry cake... which was very rich.<br><br>This is a very small restaurant and it can get loud when it's full. I would not come here without a reservation. The seating wasn't very comfortable, but not much can be done there. Overall i was happy with our date night and my wife enjoyed it as well. =)", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/11998Hm_XcMHrJMgI4n7sg/168s.jpg", "caption": "Outside of the parking garage, next to restaurant."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/o767jLnLRvRN2NXd0n8yYQ/168s.jpg", "caption": "Chocolate Rasberry Cake"}]}}, {"review": {"des": "I've been here a few too many times and haven't done a review until now.<br><br>The food here is always delicious! And from what I'm told it's very authentic Italian food (came from a picky native Italian man, so it must be true). <br><br>The most recent dish I've tried is the honey and milk baby back ribs. Sounds like a strange combo, but it was very unique and flavorful. The ribs were so tender, the meat literally fell off the bones! In other previous visits, I've also tried the sea bass (very delicious and light, yet filling) and the other more traditional pasta dishes. None of the dishes have disappointed yet. <br><br>Also, if you sign up for their mailing list, you get periodic gift certificates ($16-$20 off a meal), which is another incentive to come back (in addition to delicious food and great service).", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/zqxdsnHkOGA4MiYhJWvRBg/348s.jpg", "caption": "Milk & Honey Baby Back Ribs"}]}}, {"review": {"des": "WOW! This place is so incredibly good! I came here specifically to try out their fall pumpkin menu. My bf and I wanted to do a pumpkin night so we searched all over for a place with a good menu. After some searching we finally came across Sapori Trattoria and decided to give it a try. <br><br>Maybe it was just me but I I walked past this place about 3 times wondering where it was before finally locating it haha. When I walked into the restaurant it looked really small but to our surprise it opened up into a much larger space in the back. The restaurant has a very cozy and homey feel to it.<br><br>We decided to get of course their 2 pumpkin dishes, namely the stuffed mini pumpkin ($11.99) and cappellacci di zucca ($22.99). Omg both of these were so incredibly good!! They're like nothing I've ever had before! The stuffed mini pumpkin has sausage and bacon and comes with walnuts and cinnamon. The flavors of this dish blend together really nicely. The cappellacci di zucca is essentially ravioli stuffed with pumpkin and topped with butternut squash. I was fully expecting the ravioli to be in some kind of pasta sauce however it's actually completely dry. This is also incredibly delicious and worth the slightly expensive price. <br><br>Overall highly recommend Sapori Trattoria! If you're looking for a fun fall pumpkin menu this is the place for you! Our waiter was also very pleasant and professional. Street parking is $2/hr and not difficult to find here. I will definitely be back to try their other items!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/81g_zNGsHle3WSqzLwcBIg/168s.jpg", "caption": "Cappellacci di Zucca (the picture does not do it justice!!)"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/adCKLuD3qOl9f7wlEjzvgg/168s.jpg", "caption": "Stuffed mini pumpkin"}]}}, {"review": {"des": "This place is awesome. I've been here a handful of times now and I think it's still my favorite Italian restaurant in Chicago. I always make a reservation before coming here and we're always seated right away. The service is very polite and quick. It is very evident they care about their customers. I even took my girlfriend here for her birthday and they had a happy birthday message to her written on their menu! (They print out new menus every day because some specials/ seasonal items change frequently).<br><br>The food itself is the best Italian for the price. As advertised, my go to is always the lasagna. They've won several awards with it and it always lives up to the hype. I've had other items a time or two and those were delicious as well, but I always end up going back to the lasagna.<br><br>Also, if you sign up for their mailing list they will send you gift card coupons frequently! I highly recommend this place for almost any occasion, though it's perfect for a date night or special occasion.", "pics": null}}, {"review": {"des": "Went for the first time for dinner.  We were taken upstairs to be seated.  A waitress who was not paying attention stepped on my toes, what a welcome!<br><br>Food was good but a little pricey and seating is crowded so you do bang into people.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/p8W5_94xpYRMXzF9278Ldg/348s.jpg", "caption": "Menu"}]}}, {"review": {"des": "I went on a double date here and was NOT disappointed. I forgot to write a review back when I originally went. It was probably the last weekend of 'patio season' and we wanted to make the most of it. <br><br>We were promptly seated on the patio. I remember ordering a few drinks and I could tell the bartender knew what they were doing. <br><br>The food though... to die for. My husband ordered the lasagna and thoroughly enjoyed it. I ordered a seasonal ravioli and I can still remember how happy I was when I took the first bite. <br><br>This is a great place to go to! I also just received a letter in the mail from the restaurant thanking us for our visit. All around, a great business and restaurant!", "pics": null}}, {"review": {"des": "Where's the 10 star option?!?!?! If you are in Chicagoland and have not had the experience of dining here, do it now! From our wonderful server, Marco, to the extensive wine list, warm ambience, amazing food.... what more can I say? This place is top notch and a little slice of Italy in Lincoln Park. We started with the baratta and me oh my. Served with dried/marinated tomatoes, and a lovely side of prosciutto. We fell in love instantly. I had a seasonal pumpkin stuffed noodle in burnt brown butter with squash, sage and pine nuts. Best meal I've had since our trip to Boston earlier this year. My husband had a classic: the lasagna. It. Was. Amazing. Perfect amounts of noodles, meat, and cheese. Be warned: it's about a 6x6 piece. Amazing. The menu is printed/changed daily - everything is the freshest it could be. We loved this gem and will be returning. Enjoy!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/w_jJ4wsukr0WNR7X9p_70A/348s.jpg", "caption": "Seasonal pumpkin stuffed!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/i1AJx6L43VS0W3G38to69A/168s.jpg", "caption": "Buratta"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/byL7_qJmXUx23K6uzeV4Ug/168s.jpg", "caption": "Lasagna"}]}}, {"review": {"des": "Great Italian date night! We've been wanting to make the visit out and are glad we did! We started with the burrata and oh my gosh! It was some of the best we've had. The combo of the toasted bread and tomatoes was just delicious. I had the gnocchi and he had the lobster ravioli and we planned to share :) thank goodness we did because I loved his just as much as I loved mine! The gnocchi was super soft and the sun dried tomatoes gave it good saltiness. The lobster was amazing. Normally neither of us like super rich, but this had a great balance so it wasn't too much. We ended with tiramisu and it was also great! I honestly would come back and potentially order the same things because they were just that good!!!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/lER2C6hJHVT9BkNQ9RtJgw/348s.jpg", "caption": "Tiramisu"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/0FW7OUjv2UsaoT3TljoBQA/168s.jpg", "caption": "Lobster Ravioli"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/BeXKpdjkzEC4X671LXpdXw/168s.jpg", "caption": "Gnocchi"}]}}, {"review": {"des": "I'm sad I didn't discover this place sooner. This might be my favorite Italian restaurant in Chicago now!<br><br>Everything was excellent - service, food, atmosphere. The bread they serve here is addicting! It's simple yet so good - crunchy edges and soft on the inside. They serve it fresh from the oven as well. <br><br>I had the pesto gnocchi and OMG hands down best gnocchi I've had in the states. I've been searching for a gnocchi similar to what I had in Rome, and this is equally amazing! My boyfriend had the lobster ravioli and that was great as well. I don't think you can go wrong with the pastas here. <br><br>We topped off dinner with the hazelnut panna cotta - which was the perfect ending to a great meal. Not too sweet or heavy, very satisfying. <br><br>I can't wait to come back here again. Highly recommend this restaurant!", "pics": null}}, {"review": {"des": "Came here for dinner Friday night to use a gift certificate that was mailed to me for my birthday. It was a little strange that the gift certificate expired the day before my birthday, so I had to use it early. Service is friendly, food came quickly, and it was all delicious. This place is quite small and is filled wall to wall with people, which makes talking across the table a challenge at times. Everyone is yelling to be heard, which just makes it worse. If you're looking for a quieter place, I would suggest elsewhere. Otherwise, this place serves very good food.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/M2rLLaZJsOe0ShImesfEKw/348s.jpg", "caption": "Spaghetti Barese"}]}}, {"review": {"des": "We were so excited for this place but the food was just OK. And the food came out suuuuper slow so we got full from complimentary bread and calamari appetizer xD The service was great though!<br><br>Calamari and spaghetti and meatballs were very good but they were not extraordinary. (I definitely hyped myself a bit too much before i went though. Hence the disappointment)<br><br>Milk and honey baby back ribs - SO SALTY. It was unique and had really good crispy sweet potatoes on the bottom that i really liked but overall, the sauce was insanely salty. <br><br>Don't get too hyped up like I did because you will get disappointed!", "pics": null}}, {"review": {"des": "Came here for a birthday dinner, and was pleasantly surprised!  First of all, the place was packed.  I highly suggest you call in advance to make a reservation.  There's a down stairs and upstairs area (also an outdoor patio area I believe).  It's definitely a tight spot, lots of tables, guests and servers, but a very friendly and nice environment.  <br><br>After our party was sat, we were reading the menus and noticed that there was a \"Happy Birthday Janet\" on the top.  This was a nice touch made the birthday girl extra happy.  Our server was very nice, super attentive and willing to make suggestions.  <br><br>The food was absolutely fantastic!  If you've read my reviews, you know I am partial to Sabatinos in Old Irving Park, but Sapori Trattoria really does a nice job.<br><br>The prosciutto bruschetta is a delicious and inexpensive appetizer.  I got the Gnocchi which was delicious and decadent.  It had a delicious buttery pesto sauce.  My friend got the meat lasagna, which was also great!  Huge portion too, everyone was giving it a try, and there was still a whole lot left on her plate.  The standout pasta dish though was the carbonara that another friend got.  Soft long noodles covered in a creamy sauce with a delicious strong taste of bacon.  It was so good, that we plan on returning just to get that dish!<br><br>We finished it off by all sharing a dessert platter.  We got bread pudding, tiramisu, and the panna cotta (a type of creamy pudding).  Once again, all the desserts were delicious.  <br><br>I would highly suggest coming here!  Neat 2 floor restaurant and delicious food!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/URgrP98Fkzl7627O3u3XKA/348s.jpg", "caption": "Bucatini Carbonara"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/JKoG1xZbDJrWpa8M0Acfaw/168s.jpg", "caption": "Bread Pudding, Panna Cotta, and Tiramisu."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/UfDYxucDAWzyJPIr9SR8ug/168s.jpg", "caption": "Gnocchi al Brivido"}]}}, {"review": {"des": "Very good<br>Very good<br>Very good<br>Zuppa di peace right on point <br>Gnocchi is awesome <br>Great friendly service <br>Cant wait to come back", "pics": null}}, {"review": {"des": "This restaurant is by far my favorite Italian restaurant. From the look and feel, to the staff, to the food. I ordered the penne with tomato cream sauce while my date ordered the original lasagna. The portion sizes are big enough for two people which is great if you are looking to split a meal or even enjoy leftovers later.", "pics": null}}, {"review": {"des": "I have taken a few dates to this place over the years, and while the staff changes, the service doesn't. It is a very nice place I would suggest you go. The food was good and the tiramisu is great.", "pics": null}}, {"review": {"des": "Had really good food and service was great. Id recommend for a nice date night dinner", "pics": null}}, {"review": {"des": "Wow. I was so pleasantly surprised at Sapori! We made reservations via OpenTable (always love when a restaurant has OT) and actually had to edit our reso time and did so easily and quickly!<br><br>The server was very nice. We ordered a bottle of wine, the brussel sprout salad, the burrata, the pesto gnocchi, and the veal dish for 3 people. We were stuffed and took the pasta home. The total bill was $90 which we thought was great for a nice Italian restaurant in the city, and including wine!<br><br>Great place to go if you love nice Italian food and dining alfresco in the summer.", "pics": null}}, {"review": {"des": "One of the best Italian restaurants we'd ever dined at! Very clean and had very good ambiance! There was a changing table at the bathroom which I appreciated since we had an infant with us. The food was AWESOME! I highly recommend the honey and milk ribs. Food design and decoration were terrific, too! The staff were super nice. I had made a reservation for us to celebrate my husband's birthday and they made the experience memorable and offered a complimentary, super yummy panacotta as his birthday cake! So glad for choosing Sapori for our little family's celebration and will definitely come back!", "pics": null}}, {"review": {"des": "My experience at Sapori Trattoria was fine.  Nothing great, nothing wrong.  I probably wouldn't return. <br><br>Price point: pretty standard for Italian.  Entrees were about $25 each.<br><br>Service: was fine, but not top notch.  When I wanted to order something, it was always about 10 minutes before the server would appear.  <br><br>Drinks: Ordered the French 75 as my cocktail.  This was my favorite part of the meal; a quality drink, using Chicago products.<br><br>Food: Nothing was particularly flavorful.  <br> -- bread on the table: tasted fine.  Not warm though<br> -- bruschetta: very garlicky, so...delicious.<br> -- meat lasagna: fairly underwhelming.<br> -- a seasonal specialty, stuffed shells with sausage/bacon: this was pretty decent.  It was my favorite part of the meal<br><br>Dessert: ordered the chocolate rasperry cake.  It was a flourless cake and quite rich, but also fairly dry.  <br><br>Again, nothing was wrong.  We ate all our food and had a fine meal, but it was not special.", "pics": null}}, {"review": {"des": "Delicious food with a great menu! Made a Friday night reservation and we were seated right away. The restaurant is much bigger than it looks from the outside and has an upstairs dining area as well. They have a variety of tasty apps including an avocado bruschetta, which was delicious! Good pour on the wine (always a good thing!) I had the sea bass entree which was amazing! So goooood and very fresh ingredients.! Our waitress was great as well! Overall, it was a wonderful experience and I will definitely be back next time I am looking for some tasty Italian!", "pics": null}}, {"review": {"des": "Maybe the best Osso Bucco I've ever eaten. Pasta all al dente, all delicious. Homemade meatballs, outstanding tiramisu and warm bread pudding. And so much more on this menu -- it was tough to pass up the rigatoni caprese for the veal but somebody had to do it.... service impeccable and super helpful.<br>Absolutely 100% endorse, I plan to return when I get back to Lincoln Park!", "pics": null}}, {"review": {"des": "Let's set a couple things straight before we dive into this review. If you want to dine here but you're not into leftovers, 1) you're a weirdo, 2) you should probably split an entree with someone. The portion sizes at Sapori Trattoria are HUGE. You could practically feed a family of four with one dish. No, really - I got just about four meals out of it. It more than mitigates the cost (don't expect to get a single pasta dish for less than $20).  <br><br>I honestly can't say a single bad thing about Sapori Trattoria. Plate size aside, I think the food here is good enough to justify a $22 bowl of spaghetti even if it weren't the size of Italy itself. I highly recommend the Pennette Cardinale.<br><br>I've also enjoyed great service at Sapori. The wait staff are quick to provide endless bread, a much appreciated solve for the pre-dinner hangry. Gia is like my favorite waitress ever. Such a doll and so, so helpful and knowledgeable of the menu.<br><br>When you do decide to stop by, definitely make a reservation. I came on a Friday night, and by 7:00 it was a full house.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/AXCJi2Rd8ezZgr5rxstOww/168s.jpg", "caption": "Pasta Contadino"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/-uQFX0EVzHZnMXLa0VLh6A/168s.jpg", "caption": "Pennette Cardinale"}]}}, {"review": {"des": "This place is hands-down the best Italian restaurant. I went for my 21st birthday. The entire staff was so sweet- celebrating it with drinks and my name on the menu. I really felt special being there. <br><br>We started with the calamari- which was cooked to perfection. For my entree, I got the Bucatini Carbonara-- MAGNIFICENT. The carbonara... one of the best I have ever had.  The restaurant is authentic, has a beautiful atmosphere, a great wait staff, and is overall great food.", "pics": null}}, {"review": {"des": "I went here with a large group (~10) friends and the service was wonderful. They were quick, friendly, and helpful. The prices were appropriate. <br><br>We all enjoyed our food, each got an appetizer, main meal, and dessert. We all enjoyed what we got. I had a seasonal butternut squash dish, which was absolutely delicious. The dessert was average, and the appetizer was great. <br><br>I give it four stars because though it was great, it was not the Italian meal I was looking for. If you're looking for an Italian-American fusion, this is the place to go. If you want authentic Italian, keep looking.", "pics": null}}, {"review": {"des": "Huge portions, reasonable prices, and romantic ambiance...everything a good Italian restaurant should be!  Really enjoyed the lasagna dish.", "pics": null}}, {"review": {"des": "WORTH EVERY PENNE<br><br>Going the extra mile makes all the difference at this delightful Italian restaurant in Lincoln Park.<br><br>My lovely girlfriend brought me here for a very special birthday dinner on 1/19/18.  Sapori Trattoria -- although very popular in Chicago -- was never once on my foodie radar, so it was an especially nice surprise.<br><br>Things began promisingly with the menus, personalized for our special occasion.  Emblazoned across the top was a custom greeting \"Sapori Wishes Eric A Happy Birthday!\"  Apparently this is something they've been known to do; it was a delightful yet unexpected touch that had me beaming from the start.<br><br>We put in orders for food after deciding on a suitable bottle of red (a Malbec).  Table bread with parmesan cheese & olive oil kept us satiated until the appetizers arrived.  The cesare salad ($8) was a humongous portion and adequately dressed with croutons, though fairly standard.<br><br>Both of us agreed that the burrata pugliese ($10) was outstanding.  Made with soft mozzarella, oven dried tomatoes and prosciutto de Parma, it was a brilliant choice of antipasto.  It wasn't long before our entreés arrived, a credit to their speedy kitchen.<br><br>I went with the pennette cardinale ($21), a penne pasta dish loaded with chicken, artichokes and sundried tomatoes in a tomato cream reduction sauce.  It was a big enough serving and tasted fine, but overall it didn't really \"wow\" us.<br><br>But the lasagna.......oh. My. LORD.  $23 was a small price to pay for what was easily the best lasagna either of us had ever tried: it was made with beef bolognese, provolone & ricotta cheese and was out-of-this-world.  It was so delicious, I even abandoned my entreé to finish the rest of it and ensured that there were no leftovers.<br><br>Bread = 5<br>Circuses = 4.5<br><br>A pair of terrific desserts basically locked in my 5* opinion of Sapori.  We got a chocolate-hazelnut panna cotta ($7) which was very smooth and plated nicely.  The bread pudding (also $7) came in a vanilla brandy sauce with fresh raspberries, and it too was fantastic.<br><br>Oh yeah.....and they comped us not just one, but BOTH desserts as a way of saying \"thank you for choosing to dine with us on your special day.\"  Unbelievably cool.<br><br>Our server took pretty solid care of us throughout dinner.  There were a few times when he was gone for a while, but our needs weren't urgent (waters refilled, pay the check) so it was no big deal.  He was kind enough to accept both of our Yelp check-in offers, as most places have a 1 per table limit.  Thanks dude!<br><br>* TL;DR *<br><br>Sapori Trattoria's homemade lasagna is worth making the trip for alone.  I'm not using hyperbole when I say it's the best goddamn lasagna Eric S & Nichole C have ever tried.  I'm confident that a handful of other dishes are equally impressive, but that particular item is a standout.<br><br>Though the upstairs area can get a bit noisy, the atmosphere is perfect for bringing a date or celebrating a birthday/anniversary.  The front-of-house staff are VERY considerate and will make every discernible effort to accommodate your special request.<br><br>With all those glowing things to say, a free cappuccino with Yelp check-in is just the cherry on top of this royally iced cake.  I'll happily recommend this restaurant to friends, coworkers, and out-of-town visitors.<br><br>As one of the best Italian restaurants in Chicago, Sapori is worth every penny!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/uPWW2YWGEO-_gRigDb_hMw/348s.jpg", "caption": "Ladies & gentlemen, the BEST lasgana in the world ($23), no BS. Made with beef bolognese sauce, provolone and ricotta cheese. Extraordinary."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/h8uu0gsrDgNdAmRNe7VUcg/168s.jpg", "caption": "Their panna cotta ($7) was of the chocolate-hazelnut variety, with very smooth texture. Cappucino was free with a Yelp check-in :) :)"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/FnboNV-UBKoIi-giEb3dbQ/168s.jpg", "caption": "My pennette cardinale ($21) came with plenty of chicken, artichokes and sundried tomatoes in a tomato cream reduction sauce."}]}}, {"review": {"des": "I'm a sucker for dim lighting and white table cloths. Have no fear, Sapori Trattoria is alllll you need for legit Italian food!<br><br>Was visiting Chicago on a work trip when we came across this place. We had a fantastic waiter who truly took care of us, and maybe even helped us close the place down. <br><br>We started with the bruschetta and a bottle of Chianti- the freshest bruschetta and beautiful presentation. It was obvious the rest of the food to follow would be fantastic.<br><br>All their pastas are made in house (woo!). I had the bolognese, which was a huge portion with perfect seasoning and taste! <br><br>All in all, such a fantastic experience. Top the night off with limoncello and you're in for a great ride!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/K7d2crn1HJZtl_L9mdXXaQ/348s.jpg", "caption": "Bolognese Pasta, huge portions- so good"}]}}, {"review": {"des": "I absolutely LOVED this place. I made a reservation a few days prior to celebrate my boyfriend, Eric S.'s birthday. I mentioned it was a special occasion through Open Table, having read online that they usually print out personalized menus. We parked in the garage next door and arrived right on time for our 8:30pm reservation. <br><br>The restaurant feels warm and homey. It has a family style vibe as tables sit pretty close together. We were greeted quickly and taken to our table on the second floor. We were handed our menus which read \"Sapori Trattoria wishes Eric a Happy Birthday\". It was such a sweet detail! <br><br>We started off with a bottle of wine and the burrata pugliese ($10). The Prosciutto was delicious, the mozzarella creamy, and the marinated tomatoes savory. Eric S. ordered a ceasar salad ($8) which was enough for the both of us. For our entrees, I decided on the Lasagna Di Antonio ($23). It was huge but it was so good I managed to finish all of it. It is absolutely the BEST lasagna I have ever had, ever! It had the perfect balance between cheese, sauce, and meat. Oh my goodness! I know Eric S. was rethinking his entree decision after trying it. He ordered the Pennette Cardinale ($21) which consisted of penne pasta with artichokes, chicken, shallots, and sun-dried tomatoes. I tried it and honestly wasn't too excited about it.<br><br>For dessert we went with the bread pudding ($7) and panna cotta ($7). The bread pudding was warm and sweet with a vanilla brandy sauce and raspberry puree topping. The panna cotta was decadent and creamy. We also used our check-in offer and had a free espresso and cappuccino. <br><br>All in all, it was a very nice dining experience with great service and amazing food. 100% recommended!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/JwdJIZifXqFqcKzDMBrn6Q/348s.jpg", "caption": "A creamy and decadent Panna Cotta"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/jCyTq5m-S3SU0mpguDDKYw/168s.jpg", "caption": "A free espresso with your Yelp check in."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/lui13Epcu-bhllZZySd43A/168s.jpg", "caption": "Warm bread pudding with raspberry sauce. Delicious!"}]}}, {"review": {"des": "The service and food was exquisite, I don't even have words. My bf and I went about a month ago. We ordered the rack of lamb and seafood risotto that we were going to share. Once the food came out, they split the meals into 2 plates for us!! No place has ever done that for us and we always tell them we are sharing! It was so awesome they did that for us! Everything was excellent, I met the owner at my bank a few months ago, he told me to come try it since I love risotto, did not disappoint!! Can't wait to go back!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ubBo1CxqD8FtCqKj07SlHg/348s.jpg", "caption": "Bread pudding"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/OLfL85AEUtMWi5JFFH00_g/168s.jpg", "caption": "Seafood risotto"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/cAIMgkCI8vPb8uQtEE1hUA/168s.jpg", "caption": "Rack of lamb"}]}}, {"review": {"des": "Really great food and fantastic service!  We had a group of more than 20 in the restaurant for a business dinner.  I had the beef shank (osso bucco?) and it was delicious.  The calamari was also very good - cooked perfectly - hard to do!<br><br>I don;t know what everyone had but all the comments were very positive and the restaurant had 5 or 6 guys constantly serving us, clearing plates, pouring wine.<br><br>When they can handle a table of 25 - I am sure they do a fine job with service no matter the group size.<br><br>Bellisimmo!", "pics": null}}, {"review": {"des": "It was just great. The waitress was wicked friendly and the food was full of amazing carbs and seasonings. Will absolutely go and visit again !", "pics": null}}, {"review": {"des": "Surprisingly good food compared to the decor and menus etc. Definitely worth checking out", "pics": null}}, {"review": {"des": "I can't believe I forgot to review this gems few months ago. Today I got a thank you note from the chef and immediately remembered just how much I loved this spot!<br><br>If you're reading this, you've seen the pictures and can tell the foods hands down amazing. What you can't tell from the photos, though, is the outstanding service. <br><br>I mean, seriously, a hand written thank you note? I'll be back soon!", "pics": null}}, {"review": {"des": "Lives up to the Yelp 5-star hype. Get a reservation for earlier on during meal times because it gets crowded. My friends and I came here for Chicago Restaurant Week and it was such a great deal for the amount of food and great service we received. Their risotto, mussels in the red sauce appetizer, bolognese, and chef-inspired drink were our favorites. <br><br>Appetizers<br><br>Calamari Fritti (Fried Calamari)<br>You could tell the squid was fresh, very light breading, most of the flavor comes from the red sauce. A pretty filling appetizer.<br><br>Cozze Scoppiate (Mussels in a Red Sauce)<br>One of the BEST seafood appetizers I have ever had. Who knew baby mussels were a thing. And the thin red sauce was like a soup that you could use the mussel shell to sip on. <br><br>Entrees<br><br>Bolognese <br>Rigatoni pasta in a meaty beef tomato sauce. The pasta was soft and al dente, and there was a lot of meat in the sauce. <br><br>Risotto Pescatore (Seafood Risotto)<br>Amazing, so flavorful with a clam sauce base, and so much seafood packed into this dish! Mussels, clams, calamari, shrimp, and scallops, $26.99 for this is such a steal considering their large portions and seafood portions.<br><br>Cappellacci all'Aragosta (Lobster Ravioli)<br>This might be great for someone who loves heavy, creamy, rich pasta and a lobster/shrimp taste, but this just wasn't for me. Too heavy and rich for my taste, would prefer a lighter sauce.<br><br>Dessert<br>Panna Cotta<br>Rich, creamy, consistent throughout, with a touch of hazelnut. Excellent.", "pics": null}}, {"review": {"des": "I finally made it here and I am so glad that I did. Wow. I am so impressed. We made a reservation through Yelp (thank you Yelp!) at 7pm on a Friday night. We were seated within a couple of minutes. I didn't realize how large the restaurant is. I like that there are a variety of different rooms. Our waitress was Carol and she was so friendly and helpful. I ordered a glass of rosé to start and my dining companion ordered a Moscow mule and we were both happy with our drink choices.<br><br>The bread tastes so fresh and it was warm when it came out. Also, there was grated parmesan on the table when we got there and that was a huge plus for me because I love parmesan with my extra virgin olive oil and on anything really. I could have eaten the bread all night but of course there were more delicious things to come. <br><br>We started our meal with the bruschetta after reading a lot of great things about it on Yelp. The tomatoes were very fresh and each bite was flavorful and satisfying. Next to come out was the caesar salad. It was one of the best caesar salads I have ever had, honestly. It had just the right amount of garlic, the croutons were clearly homemade. Each lettuce leaf had the right amount of dressing on it. The more I think about it the more I know that this is the best caesar salad I have ever had. <br><br>We shared the mushroom risotto for our appetizer. What I love is that the salad and risotto were both split for us in the kitchen, which I find to be very classy. The risotto was so flavorful. Each bite was bursting with flavor and I didn't want it to end. It wasn't too heavy and every bite was delicious. For dessert I got the lemon sorbetto and my dining partner got the bread pudding. Bread pudding isn't a dessert that I would usually order, but when I tried it I realized just how good it can be. It was creamy and  flavorful. The lemon sorbetto was refreshing! It was served in a frozen lemon, which I have never had before. The presentation was beautiful and the taste was just so good. I cannot wait for my next visit.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/OWQ_IKgKBj_LA54PUtMJnA/348s.jpg", "caption": "Fresh bread, parmesan and extra virgin olive oil on the table"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ZaSR8AIkOx_JFtgW1DxRfg/168s.jpg", "caption": "Moscow mule and rosé"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/32sSq1nbpit5AUX260Rd9Q/168s.jpg", "caption": "Bruschetta"}]}}, {"review": {"des": "After seeing this place for years and years, my boyfriend and I tried it last Saturday.<br><br>We walked into large room, loud-house with many customers yelling at the top of their lungs in order to hear each other.  There was absolutely no music and no ambiance.<br><br>Most of the servers seemed stressed, unhappy and were running around like madmen.  When we were greeted, I asked if there were more intimate, less-noisy seating options.  We were then taken to a tiny room in the back that had about 5 tables and was DEAD silent.  What a contrast.  No ambiance or music there either.  Fake candles on the tables.  Our server seemed disgruntled and mostly treated us like we were just another set of warm bodies coming to eat that she \"had\" to deal with.  <br><br>It took a very, very long time for them to bring us our bottle of wine.<br><br>We ordered the grilled calamari and it was disgusting.  There were skimpy pieces and it came drowning in this runny brown sauce that looked like mud.  How can the chef let something looking like this leave the kitchen?! Yuck!  It was super salty and just an unsavory dish over all.  We split a pasta option and that was large enough for 2 people and was good.  <br><br>This restaurant did absolutely nothing to make us feel special or at the very basic level, show us that they appreciate out business.  Though the pasta dish was good, the lack of ambiance and the blah attitude of the server made it so I wouldn't even come back for a carryout choice.<br><br>There are waaayyyy too may Italian restaurants in this city that will treat you like a valued customer.  This is not one of them.", "pics": null}}, {"review": {"des": "Perfect experience from service to food.<br>First they let me in right before they closed and the service was impeccable.<br><br>The food, just damn delicious:<br>Lobster ravioli will surprise you on how delicious it is. Please if anything order that.<br><br>The lasagna (half order) was just freaking delicious", "pics": null}}, {"review": {"des": "My first time to Sapori Trattoria on a double date and it definitely did the trick. The busy yet intimate atmosphere lent our outing particular excitement - not to mention the food was awesome. I had the pesto gnocchi - which was satiating and bursting with flavor. Portions are huge and you absolutely pay for it, but I was happy to take a doggie bag home and snack later. All in all a great experience, I will be back!", "pics": null}}, {"review": {"des": "If you crave hearty comfort food, this is the place for huge plates of delicious pasta and risotto! I found the dishes to be pretty Americanized, so don't expect them to be super authentically Italian. I highly recommend the Risotto Pescatore, which is sautéed with a generous portion of mussels, clams, calamari, shrimp, and scallops. The seafood was very fresh and the arborio rice soaks up the seafood essence really nicely. The Pennette Cardinale, which is penne pasta with artichokes and chicken in a tomato cream sauce, is also a popular crowd-pleaser. We topped off the meal with a large slab of tiramisu, which has more mascarpone cheese than I would have liked, but was delicious nonetheless. <br><br>The restaurant has two floors, and was pretty packed on the Sunday night over MLK weekend. The atmosphere is pretty casual, and could get a little loud at times.", "pics": null}}, {"review": {"des": "My friend and I had dinner at Sapori Trattoria in Lincoln Park last night and liked it! Service was excellent and everything was very tasty. <br><br>We started off with the Burrata Pugliese for $10 which they served with toasted Italian bread, marinated oven dried tomatoes and Prosciutto di Parma. The prosicutto was a huge portion and a nice surprise! The burrata itself wasn't a huge portion but the price wasn't too much and the size actually fit accordingly. <br><br>For my main I had the Risotto ai Fungi for $24. This was the hugest risotto I've seen in my life! I'm going to have rice for days! It was full of Italian porcini mushrooms, fresh mushrooms, a good amount of onions & garlic plus herbs & Parmesan. Loved this dish. But honestly, loved my friend's Bucatini Carbonara ($23) even more! I kept swooping in and stealing his noodles because I couldn't get enough of it. The bucatini had pancetta , egg yolk, cream, onion, parsley, cheese and smoked bacon in it. Highly recommended dish!<br><br>Dinner was a bit pricey but we both left satisfied, stuffed and with leftovers. Entrees took awhile to come out but I'd like to think that's because they were being prepared super-duper-freshly! I wouldn't hesitate to come back to Sapori Trattori again...mainly for their bomb bucatini carbonara!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/cl7SVu-k8cl7Q2EEgdehXg/348s.jpg", "caption": "Burrata"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/QSlMRVHuN46NN5tqvBXkFA/168s.jpg", "caption": "Mushroom risotto"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ihG0Rz3IAzOW2PgN3qfolA/168s.jpg", "caption": "Burrata"}]}}, {"review": {"des": "TIP: Bring your date here for a special occasion meal and woo him/her when they put his/her name on the menu! <br><br>I am only 23 but I have never been to a restaurant for a special occasion for either myself or someone else and seen a mention on the menu! Obviously they are able to do this since they do a print out menu, but wow does it make them stand out as a restaurant that CARES about their customers. Made me feel special on my birthday and the waitress made sure to make me feel special as well.<br><br>ORDER:<br>-Calamari: Tangy/delicious sauce, cooked perfectly not too fried.<br>-Caesar salad: fresh, light, tasty.<br>-Lobster ravioli: incredible sauce. Every bite better than the last.<br><br>Complimentary tiramisu for my birthday and NO SINGING thank God. Loved this place and the ambience.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/dGoaJ8wJ57g8RrDWYNpR2Q/348s.jpg", "caption": "I only turned 23 but I've NEVER been to a restaurant that does this for me or anyone. Great call on their part to show how much they care."}]}}, {"review": {"des": "Awesome meal last evening. We had an amazing server who was on point with his suggestions. I had the ribs which were like  none other than i ever had. They weren't BBQ'd but were fall off the bone delicious. My hubs had the pasta carbonara which was outstanding. Complimentary tiramisu. We will be back!!!", "pics": null}}, {"review": {"des": "Their food is delicious. Service is very good. Menu has lots of choices. The owner is very very interested in making his customers happy which is apparent from the very high level of concern that you thoroughly enjoy your experience. They WANT to go the extra mile to make you love this place. They practically beg you to tell them.<br><br>Highly recommended. Never had a bad meal there. Don't be afraid to ask lots of questions if you're unfamiliar with some part of the menu or have special requests.", "pics": null}}, {"review": {"des": "I don't remember the last time I did not have a good time at an Italian restaurant, and Sapori Trattoria is no exception. Make a reservation before you come. This is a wonderful spot to consider for a dinner date.<br><br>Of all the dishes, the most memorable were the avocado crostini and the nutella panna cotta. Both dishes were made so well you have to taste it and see for yourself.<br><br>For my main course, I had the spaghetti allo scoglio, which is one of their signature dishes. It's loaded with a crushed tomato sauce and topped with a generous helping of seafood (shrimp, mussel, clams and scallops). They provide enough homemade spaghetti for at least 2 servings. I wasn't a huge fan of the spaghetti- I felt like mine were a little overcooked. <br><br>Service was great. They keep the bread baskets refilled and are constantly checking on you and providing necessary updates.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/1wVzG2cyuZh7CSvX5npnlA/168s.jpg", "caption": "Tiramisu"}]}}, {"review": {"des": "Really, good place to get the food that you are craving. If you are looking for a good experience, and good dine in food I'd recommend coming here to do so.", "pics": null}}, {"review": {"des": "Pizza is incredible and I love the atmosphere. You really need to make a reservation as it is on the smaller size and very popular.", "pics": null}}, {"review": {"des": "I do not understand the many 5 star reviews for Sapori.  When they first opened many years ago, it was great.  In the past few years, I have been consistently underwhelmed.  Tonight I tried an off-menu caprese salad.  Made with cherry tomatoes and same size balls of mozzarella, with little to no basil.  OK, but was expecting more with real tomatoes given it is summer.  For my entree, I had the Spaghetti allo Scoglio (spaghetti with seafood (mussels, scallops, shrimp, and clams)).  There was about a pound of spaghetti with very little seafood, and the mussels and clams were the smallest I have ever seen - about a quarter to half inch size of mussel/clam meat.  Nothing like paying $26 for a pound of spaghetti with very little seafood.<br><br>The prices here are extremely over-inflated.  We sat upstairs and the noise level was really bad.<br><br>I can deal with noise, but paying top dollar for subpar food is not worth it (even though this place is the king of promotions, $16 off coupons, etc.).  Focus on the food - not the marketing.  Used to see the owner there - not sure if he is phoning it in now or what.", "pics": null}}, {"review": {"des": "We ordered the famous lobster ravioli and a pasta dish with alfredo sauce.  Both were decent but not impressive.  The ravioli tasted no different than any others we've had, and whether lobster was in it or if it's just a lobster sauce is debatable.  My wife and I differ in taste buds and neither of us thought this place came anywhere close to the hype.  It is also overpriced, so I am glad we had a Groupon when we went.  The service was okay.", "pics": null}}, {"review": {"des": "Great service, great atmosphere, and the food was excellent. I had the Vitello Ossobuco, and it was fantastic.", "pics": null}}, {"review": {"des": "Over hyped restaurant, the service was okay, the food was okay that's the only reason why I gave it two stars.<br>I asked for two boxes to take home the rest of my meal, but when I got home I got less then half of what was on my plate!!!! I paid for my meal which was 30 bucks! For lamb chops! LAMB CHOPS!!!!", "pics": null}}, {"review": {"des": "Top Italian place in the city and possibly the Midwest. <br><br>The place is always packed so remember to make a reservation. It's also BYOB with a corkage fee so if you have a solid wine collection this is the place to bring your wines. <br><br>We arrived on time for our reservation at 6:45pm and was seated promptly on the second floor. If you are not seated on the second floor you should ask to be. It's nicer up there. <br><br>The servers are very friendly and knowledgeable and the decor of the place is very Italian. We had a wonderful experience with the service we got. <br><br>The top items to order are fried calamari appetizer, whichever pasta items you prefer (they are all very very good), and the tiramisu. Don't be stingy with your money, you should splurge and get the top items here. <br><br>The sauce on our pasta plates are extremely good and authentic. I felt like I was in multiple places at once: Florence, Milan, Rome, Napoli, etc. It literally felt like I was having a legit dinner in an Italian town. I love it. The tiramisu is so good it'll make you forget every dessert you had in your life. <br><br>Expectations were high for this Italian restaurant in the heart of Lincoln Park, and it completely lived up to the hype. A must visit for any Chicagoan. Like I said, it is the top Italian restaurant in Chicago as well as the entire Midwest.", "pics": null}}, {"review": {"des": "Dinner was good. The food was very good even, but not amazing. I had the seafood risotto and my husband had the shrimp and broccoli fettuccine. Again, both were good. The grilled calamari was solid too. My favorite dish was probably the burrata, which came with grilled bread, roasted red peppers, and prosciutto. The tiramisu was yummy too, but tiramisu at Italian restaurants all tend to be similarly delicious. So while all our food tasted good, nothing really stood out as being particularly unique or creative.<br><br>What diminished the dining experience for us, and why I can't give Sapori more than three stars, is that the dining room upstairs was so incredibly loud. I could barely hear my husband across the table. Tables are fairly close together so it's just tiring to strain to hear your dining partner while blocking out other nearby conversations. Maybe dining downstairs would be quieter/more relaxing.", "pics": null}}, {"review": {"des": "Super authentic Italian - and you really can't go wrong. We went here the night before the marathon last year and it was perfect. The staff is welcoming and the menu has loads of fresh options. Everything we had was wonderful, and the chef now sends us hand written coupons in the mail! Great neighborhood spot.", "pics": null}}, {"review": {"des": "The only reason i give it a 3 is because the chef and staff are wonderful. I just wasnt impressed with the price or the food. I ordered sea bass whicj was way to salty. They replaced it for me which i was thankful for and they brought out some ravioli squash ravioli  that was way too greasy. Im kinda a foodie so this was not the place for me. But if you like wine gi there for wine great selection and like i said the staff is soooo WONDERFUL", "pics": null}}, {"review": {"des": "I'm a sucker for good Italian food and this place did not disappoint! Our waiter Marco was super friendly and gave us some recommendations (my friend and I couldn't decide so we ended getting 3 dishes). We got the rigatoni caprese, the risotto funghi, and the bucatini carbonara. SO GOOD. The bucatini was our favorite for sure. Bacony and delicious. Marco was also nice enough to give us a tasting of some apple brandy which might be my new favorite. Definitely will be back next time I'm in Chicago!", "pics": null}}, {"review": {"des": "I really enjoy this restaurant. We have come here multiple times over the past two years and have not been disappointed on any occasion. The Pumpkin Ravioli is outstanding. The pastas have always been perfectly cooked with very good flavors. <br><br>Save room for the Hazelnut Panna Cotta for desert. You might want two! <br><br>I absolutely recommend Sapori Trattoria.", "pics": null}}, {"review": {"des": "The clam linguine was very good I couldn't stop eating this delicious pasta. We ordered also, lobster ravioli is it super delicious. Also, we ordered lasagna and it was meaty and so good!<br><br>We like that they have a kids meal that the kids choose there pasta and sauce in a kids portion. <br><br>We got for dessert penna cotta and lemon sorbet. All was very good.<br><br>The service was extraordinary and we used Yelp coupon to save about $9. Also, after check in you could get free cappuccino.", "pics": null}}, {"review": {"des": "When I think of classic, traditional Italian restaurants, Sapori Trattoria comes to mind.  It's a cute, intimate environment with an old-time Italian restaurant feel.  Prices are reasonable for Lincoln Park and you get hearty, generous portions.  It was completely unpretentious and comfortable.  It was perfect for a romantic date or a friend date!  Nice, dim lighting but not too dark where you can't see the person you're talking to.  The service was great on all fronts between the hosts and the server.  They had an extensive wine list, which I appreciated immensely.  If you want a nice assortment of wine, go here!<br><br>They serve you scrumptious, crusty, warm Italian bread with extra virgin olive oil.  The bread had such a delicious crust and it was hard not to fill up on this!  They had a decent amount of vegetarian and pescatarian options.  My friend and I started with an order of the mussels simmered in a white wine sauce.  The mussels were served with a nice crusty bread that was perfect for dipping in the garlicky white wine sauce.  The white wine sauce was flavorful and well-seasoned and a perfect light complement to the mussels.  <br><br>For our entrees, we got the lobster and seafood pasta and the mushroom risotto.  The lobster and seafood pasta was delicious!  The pasta is made in-house and tasted very fresh.  I loved the texture.  It was a perfect al-dente texture.  The lobster/seafood filling was really tasty and added more of an intense flavor to the more mild sauce.  The sauce was a tomato-cream sauce that looked pink but it didn't taste like tomato.  I couldn't identify what that flavor was but there was a sweet aftertaste to the sauce.  I like my savory flavors so the sweet aftertaste took me by surprise but it was still very good.  <br><br>The mushroom risotto was great too and had a very potent mushroom taste that was earthy and fresh.  I love mushrooms so I was a fan of this but if you don't like mushrooms, it might be too intense for you.  I liked that it wasn't super creamy and more focused on the vegetable flavors.  <br><br>I wanted to try dessert, the tiramisu looked great, but it was a Thursday night so I wasn't feeling super indulgent.  When I want my traditional Italian fix I will definitely return!  I would give this place 4.5 stars but it's not an option.  Everything was very tasty and it had a lovely ambience.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/d-akeOVXmRZI4DikG0hkBQ/348s.jpg", "caption": "Mushroom risotto"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/baH9cTjNfoEUs8mIS9Vc2Q/168s.jpg", "caption": "Lobster and seafood pasta"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/eICz_aZv_3HRGQY-bi5yFg/168s.jpg", "caption": "Mussels simmered in white wine"}]}}, {"review": {"des": "A quaint little spot near my apartment- we were looking for a quiet Italian restaurant before a show. Sappori Trattoria was perfect! A good cocktail and wine list, hearty portions, and excellent service. With the second floor, there was more seating than expected, although we didn't need it, as we came a little earlier than most (6pm on a Friday). Another word on the portions- my girlfriend and I split a salad and pasta entree and struggled to finish them. Come hungry!", "pics": null}}, {"review": {"des": "Great food, but after getting a note that says no coupons with BYOB , I doubt I will come back. My friend and I ordered appetizers, drinks, dinner and Dessert, plus a cork fee and tipped well. When you are in the biz and have open wine it so so nice to enjoy places who get it so I was very surprised by this. Love the ambiance and location, great chef etc.", "pics": null}}, {"review": {"des": "On a cold rainy day we were made to feel like family. Light and tasty salad, superb bread, rigatoni caprese. Vince could not have been more accommodating . My compliments to the chef on both quality and presentation!", "pics": null}}, {"review": {"des": "I was searching for the best Italian place in Chicago, and unfortunately didn't find it. They certainly have great portion sizes when it comes to the entree, but the flavor just didn't cut it from me. Flavor wasn't developed in my entree and there was a lack of seafood. Sad. But the lasagna is worth mentioning about (sadly I didn't order that but was fortunate enough to grab a bite of it). It's a bit out of the way for downtown Chicago dining (we were staying in The Loop), and ambiance didn't make up for it either. <br><br>Still searching for that WOW factor....maybe next time.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/lkSOL2aYT_qsEOYB7qChLg/348s.jpg", "caption": "Burrata and prosciutto"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/CjUvzNGqVPygYrH5QJKZHA/168s.jpg", "caption": "Lasagna"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/OVc9OLqf9rF8Eibu9TkYBQ/168s.jpg", "caption": "Spaghetti scoglio"}]}}, {"review": {"des": "This place is incredible. My favorite Italian restaurant in Chicago. <br><br>The ambience is wonderful. Warm and cozy, yet lively and vibrant. The customer service is great, they are constantly making sure your cup is full of water. <br><br>They're by far my favorite Italian because of the food! <br><br>I've had the Gnocchi al Brivido which is gnocchi with chicken, sun dried tomatoes, Parmesan cheese, and pine nuts sautéed in a basil pine nut pesto sauce. Yum! <br><br>My 2nd fav dish is their house-made Cappellacci all' Aragosta which is handmade pasta stuffed with lobster and sea food in a creamy pink sauce- this was so unique and delicious! <br><br>My favorite dish is their Bolognese with an assortment of meat in a beef meet sauce (orange/pink sauce). I'd recommend the grilled or fried calamari for appetizers.<br><br>On top of that, I've been receiving 1/2 birthday and birthday coupons since the first time I went and filled out a survey 2 years ago. $16 coupons- yes please ‍", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/PSjbML4soRUbPch_B-aWqA/168s.jpg", "caption": "Cappellacci all' Aragosta (bottom dish) and Bolognese (top dish)"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/-T61hCnbtH67ZPX_rSnCpg/168s.jpg", "caption": "Fried Calamari"}]}}, {"review": {"des": "Delicious food and amazing service, what else could you want? Every time I have been here the staff has been super nice, making it an overall enjoyable experience. They always offer some kind of discount, look for offers on yelp or Groupon or sign up for offers through the restaurant. They will send great discounts like a $20 gift certificate. Will definitely be coming back a lot.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/vXP6-8WxBprZzapoCCVC6A/348s.jpg", "caption": "Inside"}]}}, {"review": {"des": "Came back with my kids - they had the Gambaroni shrimp and broccoli pasta and the Arogosta  lobster pasta and I had the Zuppe De Pesche again. The Zuppe de Pesche is superb as usual. The Gambaroni is Highly recommended the white sauce was not overpowering the shrimp were humongous. My sons lobster was just Ok. the bread was warm and gooey it was perfect. The prices are fair and the portions are large. My only reservation is it's a little on the loud side.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/t3h41TVm30NolFyktlqd5w/168s.jpg", "caption": "This is half the dish"}]}}, {"review": {"des": "Way too loud. But lots of places are way too loud these days.  <br><br>They have $10 valet which is nice<br><br>The wine list is well chosen and not crazy expensive.  However the food is unimpressive especially at the price point. There are significantly better Itslian places in Chicago at the same and lower price of you look. <br><br>Skip", "pics": null}}, {"review": {"des": "I visited Sapori Trattoria with three of my friends for a catch-up dinner. The drinks were great, the service was excellent, and every dish we tried was delicious. Between all of us, we ordered a variety of dishes. The pasta was scrumptious, as was every bit of pasta I tried.<br><br>Our waiter was very patient with us, and we were one of the few parties left in the restaurant at close! The place looks tiny from the outside, but it goes deep into the building and there are a few dining rooms. The atmosphere is romantic and cute. Highly recommend!", "pics": null}}, {"review": {"des": "First, I'd like to be upfront: I'm not an Italian food lover. Now that I've gotten that out of the way I can say I've had good Italian food- even been to Italy, my sister married into an Italian family and cooks Iike an Italian grandmom.  It's not that I don't like the taste- it's the full, fat after feeling and that I'm hungry again an hour after eating Italian that I don't like.<br><br>So with that, this food was just bland. It had a weird garlic aftertaste but otherwise was flavorless (of importance: this woman LOVES fresh garlic. LOVES).  I got the risotto pescatore.  Fish was meh, the risotto had zero flavor. <br><br>I'm sort of bummed I ate here. You know how you always feel like a bloated piece of crap after eating pasta, but then you think back to the deliciousness of the meal and say to yourself, \"but it was so worth it.\"  Yeah, not this place. I mean you still get the bloated feeling, just not the fond memory of why you're feeling like a stuffed sausage. <br><br>I don't understand the reviews here.  But I will say this place was packed.  Not an empty seat upstairs. That being said, service was extremely slow.  We did have a group of 8 so we knew it was going to be slow going in, but yikes.<br><br>This was my first time here, however many of my dinner mates have eaten here on other occasions and experienced similar flavorless profiles on various dishes.<br><br>I really wanted to like this place.  I love supporting Mom and pop places and feel downright sad not being able to give this place 3 or 4 or 5 stars.<br><br>Oooo just remembered the 2013 Supertuscan red wine was awesomesauce!!", "pics": null}}, {"review": {"des": "Wow! Phenomenal Italian spot in Lincoln Park. My boyfriend and I came here the night before the marathon and it was packed! We booked reservations over a week in advance and we are so glad we did! This was the perfect place to carbo-load. :)<br><br>First  - impeccable service. Our waitress was attentive, friendly and fun. We just loved her! The place was a lot larger than expected but it was completely full.  <br><br>The food was incredible and the portions were ginormous. We started with the bruschetta ($8.99) which was fresh and not soggy. For my main, I went with the Pennette Cardinale (20.99) which was a pasta with chicken, artichokes and sun-dried tomatoes in a velvety cream sauce. It was HUGE  - practically three normal portions. My boyfriend had the Cappellacci all'Aragosta (lobster ravioli $22.99) which was divine. We were too full to try dessert but the tiramisu looked awesome. Even their table bread and EVOO hit the spot. <br><br>Great ambiance - authentic quality Italian - excellent service. Just fantastic overall!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/_dIGkaavb9EPORQ9buZ7Dg/168s.jpg", "caption": "Chicken ziti with artichokes, sun dried tomatoes and a tomato cream sauce"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/PEnBZHC3jVGQJMDfIRFimw/168s.jpg", "caption": "Lobster ravioli"}]}}, {"review": {"des": "Hands down my favorite Italian restaurant in the city!<br><br>Discovered this place on Groupon and has been in love with it ever since. Been here for a total of 4 times and each time we all left with full and happy stomach.<br><br>Most recent time I decided to celebrate my birthday here, at 9pm for a party of 9. They set up the table for us very quickly, and as my guests gradually arrive they all quickly accommodated everyone.<br><br>We ordered calamari as starter and I got my usual favorite which was seafood risotto. The calamari was tender, crispy, and the marinara sauce was perfect to go with the dish. It was so flavorful and full of seafood! My favorite was the scallops in there, and the rice just absorbed all the flavors of the seafood. <br><br>For $23 everything came in big portions, hearty, delicious, and extremely great service!<br><br>In the end they offered us complimentary tiramisu and apple pie. Delicious!<br><br>Thank you once again for such an amazing experience, can't wait to be back!", "pics": null}}, {"review": {"des": "Food was crazy overpriced and was only ok. Nothing exceptional to warrant those prices. The atmosphere was nice but the place was very over crowded.", "pics": null}}, {"review": {"des": "Been here a handful of times over the years and this is one of the best little Italian places in the city. It's definitely a date night type atmosphere with dim lights and white table cloths, and you can't go wrong with any of the pasta options on their menu. Be sure to sign up on their birthday list and you'll get a kinda creepy looking (but in a funny way) hand written card by the chef on your half birthday with a coupon inside. Portion sizes are generally large so you'll almost certainly have leftovers to enjoy the next day. I think they allow you to bring your own wine in for small corkage fee, not 100% sure if they still do that though as it's been a while since I've been.", "pics": null}}, {"review": {"des": "***NOTE: Sign up for their free club to receive $16 off coupons in the mail or get the Yelp deal of $11 for $20 worth of food.***<br><br>Ever since I ate here 3-4 years ago, I've been receiving $16 off coupons twice a year (around my birthday and halfway to my birthday). This time, I used the half birthday coupon.<br><br>When I dined here last time, it was on the first floor. I was under the impression that it was a small one-story Italian restaurant. Little did I know, there is a much bigger second floor! We were seated on the second floor this time, which is bad timing because my calves were hurting from running a few days prior. I literally had to walk down a long flight of stairs one step at a time like an old lady.<br><br>Like most Italian restaurants, we were served bread before the meal. Of course like most times, I dominated the loaf of bread thus leaving me unable to finish my entrée. We both ordered the Linguini alle Vongole for $24.99 each, which is homemade pasta, clams, garlic, onion, and white wine olive oil sauce. This was an absolutely delicious and savory dish and was a massive portion. You can definitely tell the pasta was freshly made. This entrée is great for two people if you don't want leftovers. My friend ordered a tiramisu, which was good but had too much white cream at the top.<br><br>We were served by a Robb Stark look-alike from Game of Thrones, and that was all I could think about every time he came by our table. Speaking of, I'm looking forward to this Sunday's episode. Anyway, the service was great. We had our orders filled and delivered and water cups refilled in a timely manner.<br><br>$24.99 may seem pricey for pasta, but it's a good deal given the portion size and coupon. I recommend checking out this restaurant!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/lPsuuJXi6-znLI8mMtAnmA/348s.jpg", "caption": "Linguini alle Vongole"}]}}, {"review": {"des": "Food was okay at best. My wife had the lasagna and it was maybe 70-75 percent pasta. Like a pasta cake. I really don't see what the appeal is here. Wait staff was friendly and helpful, though.", "pics": null}}, {"review": {"des": "Such a great little Italian restaurant! We sat outside yesterday, the outdoor seating is on the side walk. I thought it was going to be annoying with people and cars passing by, but it was actually very enjoyable. Like most Italian restaurants, they have a big wine list, but there are few recommended choices on the back of the food menu. We got the avocado bruschetta as appetizer and two different pasta dishes the waiter recommended. Everything was amazing and full of flavor. We finished the meal with lemon and coconut sorbetto. I loved the coconut, it was very creamy in texture. The lemon one is like summer in your mouth. The waiter we had had been there for a long time, very knowledgeable and friendly. Definitely our go to for Italian.", "pics": null}}, {"review": {"des": "I came here for a date night and it wasn't the best nor the worst place to visit. <br><br>First, the parking is a bit limited so be sure to arrive early to give yourself time to find street parking. Then, the front part of the restaurant is very tiny so it's a bit of a challenge to squeeze inside if there are people waiting around, so keep that in mind as well. They basically don't have a waiting area. However, if you make a reservation, you may not have to wait. <br><br>Upon walking inside, everyone was very kind and the seating was great. The atmosphere is very romantic with soft lighting, flowers, and magnificent paintings. The place also has Gluten Free options, so if that's important to you, they have it. They don't have A LOT of options, so keep that in mind. <br><br>The food itself wasn't really that amazing, I had a gluten free pasta with meatsauce and it was kind of bland. Even the salt didn't really help it. <br><br>I may return but I don't know, I love Italian food so I can be pretty picky sometimes and this didn't really leave me wanting to return but it wasn't awful if your in the neighborhood.<br><br>I did have a great waiter! He was really kind and attentive to our table so that was great!", "pics": null}}, {"review": {"des": "What can be further added to the 1000+ reviews for Sapori. Its a wonderful place with absolutely delicious Italian food. You cannot go wrong with Sapori - the service is fab and you leave the place happy and full. <br>We took our out of town guests here for dinner on the weekend. Everything was perfect - service, food, atmosphere. Its great for family get togethers as well as for date nights. You can never go wrong with the food here. Cannot recommend this place enough.", "pics": null}}, {"review": {"des": "Simply Amazing!<br><br>Everything here is effortless! The service, the food, the atmosphere.....phenomenal!<br><br>It opens at 4:30pm and I'm happy my friend and I showed up then because it felt like we had the place to ourselves and it was delightful. The restaurant itself is small and cozy and we sat next to the window letting in an amber glow of sunlight, where we talked for 2 1/2 hours and shared appetizers.<br><br>We were served by the bartender and he  anticipated our needs and made detailed suggestions that insured a great meal was ahead of us. <br><br>First up were the Mussels in White Wine Sauce: the Pinot Grigio broth was light and flavorful, the spices perfectly balanced and not at all salty. The crostini were firm and crisp, soaking up the broth quite nicely and not falling apart. The mussels were small, but there were a lot of them in the serving, so the numbers made up for the size.<br><br>Next, we shared the creamy Burrata Pugliese with crostini, oven roasted tomatoes, and prosciutto. All the ingredients were tasty on their own, but I couldn't help combing them into a scrumptious open-faced sandwich. Yum.....<br><br>We ended our meal with the delicate and delectable Panna Cotta. I personally have never tried panna cotta before and found this to be super creamy and smooth--perfectly executed and rich enough to share. <br><br>Yelp check-ins get a free cappuccino (which my friend enjoyed immensely) and we left full and ready to come back again.<br><br>I'm very happy we are within walking distance to this place!", "pics": null}}, {"review": {"des": "I absolutely LOVE this place. Everything on the menu is delicious. We came here for restaurant week and it was not only an amazing deal, but the signature restaurant week drink was a delightful surprise :). <br><br>I've been here before and every time I come, the service is great, the waiters and waitresses are attentive and are always very helpful in finding a meal that meets your desires. <br><br>I'd highly recommend if you're looking for some delicious, authentic,tastes of Italy!", "pics": null}}, {"review": {"des": "After months of wanting to try this place, we finally came for their amazing Restaurant Week special! I was able to get a reservation the day before at 6:15-- by the time we left around 7:30, they were super busy. <br><br>There's a lot to praise here but I'll try not to ramble on too long. First and foremost, all the food was excellent. My two favorites from the three course menu we ordered off of were both seafood! The fried calamari was all rings (no tentacles) and very simple in presentation but super delicious and perfectly cooked. The salmon was also perfect and served with an amazing bernaise style sauce. We had two desserts: tiramisu and vanilla bread pudding with raspberry sauce. The latter was definitely the winner!<br><br>The drinks were also standouts-- we got a 'chefs cocktail' as part of Restaurant Week which had blood orange and some other components. Sorry I can't remember but both of us liked it a lot and we are polar opposites when it comes to drink preferences. I thought it was very generous of them to include a drink on their pre-fix menu! I also had a cantaloupe martini that was without a doubt one of the most delicious cocktails I've ever had. If you are a fan of vodka drinks,  I can't recommend this enough. <br><br>Lastly, the service was great! I'm sure dealing with the Restaurant Week crowds can be quite daunting but he was super patient, funny and helped my extremely indecisive self out. It was a very good value for 3 drinks and 3 courses each. I would definitely return as a regular diner!", "pics": null}}, {"review": {"des": "This was an awesome experience. We had a large party of 10 people and they were so accommodating. The atmosphere is very comfy with a nice dim lighting but not so dim that we couldn't see. We started off with the Calamari and it was so tender it was probably the best I have had in a long time. I ordered the lobster ravioli and was expecting the portions to be small. I was wrong! They definitely make sure you leave with a full stomach. The ravioli was tender and the lobster was flavorful. You can request your dish spicy upon request which of course is what I did. I recommend getting your dish spicy! <br><br>They will make a special note on their menu if there is a special occasion. In my case their menus wished me a \"Happy Birthday\". This is a place that I will be recommending to all my Chicago friends, out of town friends, and family.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/wKhKT2JpaBq9zMUgr0OdGA/168s.jpg", "caption": "Spicy Cappelacci all'Aragosta. Spicy upon request"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/OXBbqtCiHnv-O1_ZdyeMcw/168s.jpg", "caption": "Fried calamari was tender and not chewy definitely recommend"}]}}, {"review": {"des": "An absolute gem in terms of service, and most importantly, food! I bring folks here often and it's always a hit!", "pics": null}}, {"review": {"des": "I loved this restaurant! I had planned to book a private room with a large group of people, so I emailed the restaurant using the email provided on their website. I sent many emails and questions regarding the menu, prices, and parking. It took a little longer for Vince and Chef Anthony to reply but it worked out in the end because all of my questions were answered. My plans broke down, and after a few emails I decided to have a dinner for two instead of a group. Vince was very understanding, and he took care of my reservation. Once I got to the restaurant, I chose to do the valet parking ($10). It was hard to get in front of the restaurant because of how crowded it was, but after two minutes of waiting, I went into the restaurant. I checked in and it turned out Vince was still able to seat me in a private room for my 18th birthday! I was very very happy. The service was extremely patient and polite. I ordered one \"Spaghetti allo Scoglio\", and the staff was nice enough to split the portion into two for me and my boyfriend. I enjoyed the pasta, especially the texture of the spaghetti.  Overall it was not that expensive maybe about $50 dollars including tip and valet parking. Looking forward to going back!", "pics": null}}, {"review": {"des": "It's a pretty casual Italian joint. Had the living social deal and I was really looking forward to the place on account of the reviews and ratings. Had 9pm reservations and the place was pretty much empty when we came.. Service was good and we ordered most of what our server recommended but we were all slightly disappointed. Wish he had mentioned that we could do half orders of the pasta because we ended up only ordering one and was not impressed.<br><br>- Burrata Pugliese:  simple but refined. Love the sweet, creaminess of the cheese, the saltiness of the prosciutto. crunch from the toast, and the tartness from the tomatoes.<br>- Calamari: This breading layer was thin and crunchy, but was just too salty. And the calamari was overcooked and rubbery. The marinara sauce was really good though.<br>- Pasta Contadino: This pasta dish was bland and ordinary. Nothing really stood out about it.. <br>- Lamb chops: Came with 6 chops, probably the best part of our meal.. The tangy tomato sauce paired really well with the lamb and some wine. And the lamb was cooked perfectly to a medium rare.<br><br>Service was good but food was lacking.. Honestly, we should have stuck with the house specialties instead of the recommendations.. Oh well.. maybe next time?", "pics": null}}, {"review": {"des": "This has easily become my favorite Italian restaurant in the city. I've had the lobster ravioli, the meat lasagna, and most recently the gnocchi. The gnocchi is my all time favorite dish. The pasta is amazingly soft and delicious and the pesto is amazing. The fresh bread with Parmesan and olive oil kicks off the meal and don't be afraid to pair it with some wine. Each dish that comes out can truly end up being two meals - so while it's on the pricey side, if you make it two meals it's not as bad. At the end of our meal our waiter brought us a round of tequila shots on the House. Great service and great food!", "pics": null}}, {"review": {"des": "I had a shrimp in cream sauce and I shared a broccoli salad with my partner ... food is fresher, lighter, feels more contemporary ... very nicely done Italian.  However, I ding it a little for the prices -- pasta entrees are mid to high 20s.  Service very attentive.", "pics": null}}, {"review": {"des": "Really good pasta in a cool space. This place already has a ton of reviews, so I doubt I can add much that hasn't already been stated here, but I'll give my two cents. <br><br>My wife and I came here for a date night on a Saturday night. It was surprisingly easy to get a reservation mid-week, and I think you can even get one for a decent time day of on yelp.  To start we got the mussels and a bottle of red wine. The wine list has a huge range of prices, some of which are pretty cheap, so that's a definite plus. The muscles were good, but nothing amazing.  I actually expected a little better, but I think it's because I'm used to a more French version with a cream sauce. For the entree my wife got the lobster ravioli and I got the spaghetti with red sauce and assorted seafood. My pasta was very good, but I got it spicy, and it was a little too spicy for Italian food. It was still good, but I wished I had gotten normal. My wife's ravioli was flat out amazing. The waiter said it was one of the most popular items on the menu, and it's obvious why. <br><br>All in all it was a really good experience. It probably wasn't the best Italian food I've ever had, but it was pretty great. Added bonus, our server was awesome, and took really good care of us all night. In fact, across the board the service was great.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/0XWTOxDJcaE-1cPKj-3ipw/168s.jpg", "caption": "Spaghetti allo Scoglio"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Njv-uvRoE2k62vp954swLQ/168s.jpg", "caption": "Muscles with white wine sauce"}]}}, {"review": {"des": "Sapori is awesome! Anthony and his team helped our ministry host an event for many of our college students. The staff was extremely welcoming, helpful, and accommodating to our group and helped make the night extremely successful, welcoming, and enjoyable. And of course, the food was amazing! Authentic Italian!", "pics": null}}, {"review": {"des": "Casual upscale Italian is a good description. We were a bit worried we were underdressed but just fine in a summer dress and flats. Went on a Wednesday evening, no wait. There was even live music for a portion of the night. Hodges's kind enough to ask if we prefer to sit near or away from the music. <br><br>The restaurant is quite long; there are three dining rooms and a patio. <br><br>Pasta dishes are very large, recommend family style and share. Bonus: you get to try a bunch of things. The Brussels sprouts salad was delicious!! The pumpkin pasta dish was very different but in a good way :) very tasty <br><br>ALSO there is a Groupon right now! $20 for $40, must use Monday-Thursday", "pics": null}}, {"review": {"des": "Had an amazing experience here! Great food and service. We had burrata and grilled calamari for appetizer. The calamari was full squid cut in half which I had never experienced and the balsamic vinaigrette went perfectly with it. The burrata was so fresh, as were the smoked meat, bread and tomatoes. For entrees, I got the gnocchi, which was one of the best I have ever had, with amazing texture. I have never had it with chicken or pesto before and I thought it would be random, but it was such a good combination, especially when eating it in the same bite. My parents got the stuffed lobster ravioli with pink sauce, and Spaghetti with seafood, which also did not disappoint. <br>Additionally, our waitress, Cassidy was fantastic. Ambiance was great-casual dress but high quality service and food. Very comfortable and we will definitely be back!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/BkBArgjxt2wiIwGQ4zGKZQ/168s.jpg", "caption": "Gnocchi"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/zrKybjoxFCpm34vnCw0jIA/168s.jpg", "caption": "Delicious tiramisu"}]}}, {"review": {"des": "The restaurant is fairly small but the dim lighting gives a great vibe. You smell fresh food as soon as you walk in which got me even more excited to be here. Their bruschetta is amazing- I couldn't stop eating it. I went with a group and we ordered some large shareable dishes. The dinner menu is small but everything on it looks, smells, and sounds delicious.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/MXsTQ6ebS68mRhBvf7e1Ug/348s.jpg", "caption": "Penne with spinach and cheese, chicken, potatoes"}]}}, {"review": {"des": "My wife, daughter and I ate here October 7, 2018.  The food was great but we sat upstairs and it was painfully noisy.  This seemed to be in part due to the acoustics of the room and the fact that for some reason the diners seemed to be all talking loudly.  The service was fine.<br><br>As far as the food went, we thought it was great and worthy of a 5 star review.  My wife had the lasagna.  The portion was huge.  It was meaty and flavorful.  It was supposed to be a bolognaise but really tasted more like a classical lasagna.  My daughter had  the shrimp with pasta dish (gamberoni e broccoli).  The shrimp seemed overcooked but the pasta was great.  I had the veal paesana. This had artichokes and tomatoes but was not a typical marinara sauce or typical of veal parmesan. This was fantastic!  The sauce was unique and I loved it.   <br><br>Not sure if we will return on our next trip.  If we do we will be sure to avoid the weekend.", "pics": null}}, {"review": {"des": "I've eaten at Sapori several times for dates or meetings, and have always enjoyed it.  But a few weeks ago we hosted a recruiting event for 60 people in the upstairs space at Sapori, and the entire evening was fantastic.  This was the second year in a row we've done this event there, and both years it has been a total hit.  Anthony and his staff are courteous, welcoming, helpful, and do a great job serving and hosting large groups.  The environment is intimate and inviting.  The space worked really well for a medium sized recruiting event.  And the food!  Wow!  Sapori is the best Italian in Chicago.  We had the bruschetta with guacamole, salad, several pasta dishes, and a chicken entree that were all delicious.  The portions are huge, and the flavor is robust.  I cannot say enough how great Sapori is.  It gets my highest review, and I would highly recommend it for a small dinner, a date, or a large gathering.", "pics": null}}, {"review": {"des": "Yesterday's dining experience was disappointing. The waiter was missing throughout dinner and it took so long for the appetizer and entree to come. We flagged down the host and other waiter several time just to order, get water and ask for the bill. The food was cold and salty. At the end we just had to go up to the counter to pay because our waiter was slow and disappeared consistently. The food was not good as usual. Even the tiramisu was too sweet and small.  The service was terrible. I recommended this place to many friends but after the recent experience, we will not be back.", "pics": null}}, {"review": {"des": "For me this a good place to have a lunch with your family or friends. <br>If you want to teleport to Italy Sapori Trattoria is a perfect restaurant in terms of food and service. I advise all of you to visit Sapori Trattoria.", "pics": null}}, {"review": {"des": "I love this place. I've come here several times. The food is amazing...really amazing Italian food.  The service is impeccable and attentive. Each of the staff go above and beyond to make sure you enjoy your food and the total experience. The atmosphere is just right for great food and great conversation. <br><br>Too many to name, but some of the best entrees are the Pumpkin Ravioli and the Milk and Honey Ribs. Loved the Calamari appetizer...just enough warm, salted crunch on the outside with an amazing finishing dip in the sauce! The Brussel Sprout salad was fresh, full, and oh so satisfying...definitely worth trying it when you go.", "pics": null}}]}