{"name": "saucy-porka-chicago", "reviews": [{"review": {"des": "Affordable and tasty? What more can you really ask for<br><br>The owner of the restaurant is incredibly friendly and approachable, and her recommendations is definitely worth ordering! Came here with a few friends and we were able to get a spread going - tried a few Bao Buns, the ramen noodles, and the asian paella (with a fried egg on top!)<br><br>Everything was so flavorful and the price point is super fair. The food reminds me of something homemade and that's enough of a reason for a repeat visit.<br><br>The only slightly down side is the hours of operation - I can see that this would make it harder for people to come by if they don't work in the area. Other than that, it's a 5/5 for me!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ZXzWKU94SuWf_4kjjdRF8Q/348s.jpg", "caption": "Bao Buns!"}]}}, {"review": {"des": "My bookmark got visited on this trip. They has a good line of people during lunch waiting to order. Other Bao, the has Asian bowl selection. The restaurant is located on S. Financial Place. The apple map show wrong location. The yelp page has right location. <br><br>I got the beef barbacoa, thai chicken, and shrimp Sofrito. This Bao is good for lunch. They are well garnish. The price they charge for each Bao is reasonable. Three Bao are enough for my quick lunch. My wait for the order is good. Enough time to return to work.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/XwZfdIxLVfLDZYCpVGiUZg/348s.jpg", "caption": "Thai chicken, beef Barbacoa, Shrimp Sofrito Bao"}]}}, {"review": {"des": "Woah, I feel like Saucy Porka took a slice out of my mother's recipe book and made a bowl that reminded me of what I used to eat growing up. That is one compliment I am happy to give this small hub of flavors here in the South Loop.<br><br>My coworker and I came here for lunch one day after seeing that we had tried a majority of the other Asian restaurants in our area. This spot stood out in my search with its Asian-Latin fusion, so I decided it was wort ha shot. During lunch time, this small restaurant is packed! There is a small dining area with tables for 2-4 people max and a counter where you order from their chalkboard menu above.<br><br>What was on the menu? Banh mi creations, tacos, bowls, you name it. I was impressed with its variety and the blend of typical comfort food you would find from families under both backgrounds.<br><br>I decided to try their Asian Style Paella ($12) because it blended together Chinese sausage I grew up eating with carnitas over a bed of rice. While it's certainly not in the traditional sense of a paella, the sheer combination of these ingredients drew me to the bowl. The verdict?- The bowl reminded me of what my Mom used to make me when I was a kid and this pure nostalgia really helped me bring out those tastes. The bowl was a perfect blend of meat and rice and I absolutely loved my meal.<br><br>Would definitely recommend trying this spot out for anyone interested in fusion cuisine. I am looking forward to returning to test out their tacos in the future.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/kzRxPMbVVsCJf_YxGa_txA/348s.jpg", "caption": "Asian Style Paella"}]}}, {"review": {"des": "Came here first thing in the morning to score some bacos, something that no one has mentioned (or maybe there's just no one coming in here at like 9 am in the morning) is that the bacos aren't served until 10 am. In the morning they have 3 breakfast sandwich type things, but we came here for BACOS. So we waited. <br><br>I got the tofu baco, curry chicken baco and pork baco. My favorite of the bacos was the curry chicken baco. It has just the tiniest bit of kick and definitely is more Thai curry (like green curry with slight spices, tastes something like bayleaf but probably is not). I expected to like the tofu baco because of all the raving reviews, but it was just ok to me. The tofu would've been (in my opinion) better a little bit crispier, but it was soggy with something similar to Thai sweet and sour sauce. Not a bad thing, but not my tastes. (It's like Princess Tofu if you've had that). <br><br>We also got one other thing which was the shrimp tempura taco (not baco), which my friend and I both really liked. The tempura was just what I was expecting (it's like double fried-ish texture instead of real tempura flakey texture), but it was good and the chipotle aioli on it was really complimentary and good as well. Definitely a good place to pop in for some food -- the lady at the counter was extremely attentive and even came around multiple times to get our opinion of which we liked best and was the one to suggest the tempura shrimp tacos.", "pics": null}}, {"review": {"des": "I had the Asian Paella and I liked it. There were 8 of us and everyone liked their food too. Some got the Asian tacos which is practically steamed bao buns sandwiches. Some had banh mi sandwiches. The only drawback was the eating room size. We got lucky four tables next to each other (2 chairs each) opened up while waiting for our food. Service was fast and friendly. So, you order, wait few minutes, eat and give up your seats for the next diners. We will definitely go back. But be ready to order food to go if your group is large.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/-qezN2pTX56VgBhucap5Kw/348s.jpg", "caption": "Nice to know this was Guy Fieri approved."}]}}, {"review": {"des": "Ultra very super unique place. I love locations like these that combine two different cultures for an explosion of flavors. They had very reasonable prices for interesting food. This was as much needed brunch after a night of drinking with my friends. <br>The staff here was really helpful when it came to understanding what they had to offer and i really appreciateed that. Keep up the good work!", "pics": null}}, {"review": {"des": "I am a little late in writing this review. I went about two weeks ago to Saucy Porka. <br>This was a suggestion from a work colleague. I really enjoyed the chorizo egg rolls. They were perfection. The service was fast. <br>My only issue was that I felt super crowded while dining in the restaurant. Admittedly - I went at lunch time on a week day and this is definitely a popular spot. I also had the Saucy Porka sandwich which was delicious. <br>I went with three other colleagues who had similar items and were thrilled with the portion sizes and the quality of the food. <br>I would caution anyone to be careful about going at noon - but if you go at 11 or 11:30 you should be okay on a weekday. <br>I will definitely be going to this location again.", "pics": null}}, {"review": {"des": "Thank you Yelpers! This place was AMAZING!! It's a walk up counter with 9 high bar tables. Shout out to Natalie for helping us Californians order a sampling of the best on their menu. We had pork, curry chicken, beef, tofu Bacos (aka Bao taco), cubano banh mi, chorizo egg rolls, crispy shrimp taco, beignets. <br><br>Our fav<br>- crispy shrimp (Friday special)<br>- Thai chicken curry, Asian inspired flavors<br>- Cubano, juicy and meaty<br><br>Service was fast & Natalie really made our experience memorable! Ask for Natalie", "pics": null}}, {"review": {"des": "Yes, great lunch spot. Tried the different eggrolls, just ok. Veggie beats chorizo if forced. The different rice bowls were all good. Would definitely reorder. Only hick up was with delivery, normally this would be a plus but for a work lunch arriving early was no bueno. Make sure to schedule time of delivery through the app.", "pics": null}}, {"review": {"des": "Excellent lunch spot in the Loop. Saucy is a classic hidden gem that is just simple, solid lunch fare. <br><br>Came in last week for lunch and got two bacos, one with chicken and one with shrimp. Both were excellent! Also got a side of the fried plantains with pineapple salsa, which was excellent!!  The quality, the flavors, the zest, everything was great! <br><br>The staff were super friendly and everyone inside seemed to be having a good time. The mood and atmosphere was fun and light, which always makes people's experience better. <br><br>Pro tip- the mojito lemonade (which is non-alcholic) is amazing!!<br><br>Highly recommend this place and I just wish they were open at the end of the day, as I would definitely stop by on the way home.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ds-rN7mdyGuTsPSu5eSPiQ/348s.jpg", "caption": "Chicken and shrimp bacos with plantain chips and pineapple salsa"}]}}, {"review": {"des": "This place was so great. The bacos (bao bun tacos) are such a fun idea. Our group tried them all and liked the chicken curry and shrimp the best. Don't miss out on the Tostones. The curry sauce is not to be missed. Their new location in Hyde Park is great. We visited on the third day they were open and received 5 star service. If you like the idea of Latin and Asian fusion this is an awesome lunch spot. The rice dishes sound like a good heartier dinner option.", "pics": null}}, {"review": {"des": "Overall: 3.9/5 Very satisfying quick eat. Came in ~1pm on Tuesday and there was no wait at all.<br><br>Taste: 4/5. Love the bao instead of a taco. It's fluffy and tasty. Good pickled veggies and meat ratios. <br><br>Value: 4/5. Very decently priced tacos. They come out at about $3 each. I ordered 3 and was very satisfied. <br><br>Ambience: 3.8/5 Very chill lunch spot, grab a number after ordering and they will bring the food to you. Very casual place that is quiet enough to talk but has a nice background bustle to it. <br><br>Service: 3.9/5. Food came out pretty quickly ~5-10 minutes. Ordering process was very straightforward. Definitely is more of a bus yourself kind of place though.", "pics": null}}, {"review": {"des": "I was sadly underwhelmed by the breakfast sandwich I ordered to-go.  It wasn't good flavor, the bread was too chewy, and way too much of it relative to the amount of meat and filling inside.  Given reviews, maybe breakfast sandwiches are not what you should order here.  Keep that in mind and maybe just avoid them altogether and stich with the tacos or baos!", "pics": null}}, {"review": {"des": "I stopped by here for lunch.  I ordered an appetizer, Chorizo eggroll (queso fresco cheese, sweet potato, red cabbage, onions, with avocado aioli) and the Saucy Porka (pork carnitas served on French baguette topped with kimchi, mayo) for my main course.  Both were really good!  It's pretty pricey for the portion size you receive, especially if you add the extra $3 for chips and a drink.  The cost is relative to how pricey it can be going out to lunch everyday in the financial district.<br><br>The owner also owns the Spotted Monkey which has a similar influence in latin-asian and located just down the street.  Give the Porka a try and you will be pleasantly surprised.  They close at 3pm M-F and closed on the weekends.  The only parking available is the parking garages nearby or street parking around the corner.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/DTfq_vBp0_faceKudZDWog/348s.jpg", "caption": "Saucy The Saucy Porka Sandwich and Chorizo Egg Roll"}]}}, {"review": {"des": "Very tasty and fresh !!  Favorite was the shrimp followed by the BBQ.  Least favorite was the pork.  Each Baco is quite small though and and the price adds up quickly!  Service is excellent and very attentive  We were there on a Thursday the lunch rush seems to start around noon as it wasn't too busy until then", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/0IKb58IfeJtqnYEBZoU1Xw/168s.jpg", "caption": "Two shrimp Bacos the Diet Coke cap is for scale"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/rvQFvV1VMJBCWhAywQ8rjg/168s.jpg", "caption": "Menu as of 9/20/2018"}]}}, {"review": {"des": "This place exceeded my expectations! <br><br>We were browsing on Yelp for food places and decided to come here since it was near were we were. The shop was tiny and reminded us of those corner stores at first glance. My friend and I each ordered the miso short rib, pork carnitas, and the Thai chicken curry bao. We also got the sweet potato fries to share. When the food came, our eyes immediately lit up since from a foodie's first impression, the food looked delicious. They always said we eat with our eyes first. Taste-wise it was just as delicious. I think the miso short rib was my favorite. This is a decent place to try out!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/-6jCRXnV49G19jfJoxR3qw/168s.jpg", "caption": "Shredded pork Bao, barbacoa bao, and sweet potato fries"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/DKFY7uvfoCQjVtGGF7v8jQ/168s.jpg", "caption": "Shredded pork, curry chicken, and Barbacoa Bao!"}]}}, {"review": {"des": "Ordered take out from the yelp app. They had it ready in under 10min which made everything easier. The place was empty but it was barely 11:10, so can't judge how full it gets during peak hours. I got the curry sweet potato fries and the shrimp bacos. The curry sweet potato fries were SO GOOD they got passed around my office with everyone raving about how good they were. The only let down is they were not at all crunchy, more like a tad soggy because of the cheese, but I'm guessing if I'd eaten there it'd be a different story. The bacos were really good - the shrimp tasted fresh. I got 2 bacos and the fries and that was plenty for lunch.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/fUpcmJfgxLvSfhurvcrT0g/168s.jpg", "caption": "Sofrito Marinated Shrimp bacos"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/BgiTiYIzq11RS9zsFU3wOQ/168s.jpg", "caption": "Curry sweet potato Curry Sweet Potato Fries"}]}}, {"review": {"des": "Really unique lunch spot in the loop that features a Latin and Asian fusion. Seriously everything on the menu I have tried has been tasty! However, most things on the menu are quite heavy and not the most suitable for a workday lunch. Must tries: chorizo egg rolls with an amazing avocado aioli, and the beef or carnitas baco (Asian bao bun, taco style with a more traditional taco filling). The Asian paella is also good but very salty - if you are looking for a meal full of savory rice and a lot of meat (Chinese sausage, spicy sausage and carnitas) this is the dish for you! Not very conducive for large groups to sit around since it's in a smaller place and gets really crowded at lunch time. The wait time can get long which is the reason for 4 stars.", "pics": null}}, {"review": {"des": "Mehhh, they get 2 stars for adorableness (mini tacos made with bao wraps?? Too cute.), but little else impressed me. I got 1 beef and 1 shrimp Bao Taco, and the fillings just didn't have enough flavor for me. And I live only 1 block away, but by the time I walked home, the Marinated Shrimp Baco had soaked completely through and fallen apart. Service also was mediocre. I went after the lunch rush, when there was literally no other customers in there, but they gave me monosyllabic answers to my questions about the menu, barely paying me any attention. I may give them another try some day, but with all the other food options on that block, it probably won't be any time soon.", "pics": null}}, {"review": {"des": "Ever since traveling to Taipei once a year for the last three years, I've been in love with Taiwanese bao so I was excited when my colleague picked Saucy Porka for our lunch escape from our windowless office.  I ordered the small pozole and pork carnita bao.  <br><br>Pozole: 4/5 I enjoyed it and wish I had ordered a full serving<br><br>Pork carnita bao: 0/5 Thoroughly disappointed by the bao.  The bao itself was hard and dry. It was either under cooked or just old. The pork was tasteless and the portion was quite small. <br><br>If you want baos in Chicago, head over to Piko Street Kitchen's food truck and get their baos.", "pics": null}}, {"review": {"des": "Given the unusual and often uninspiring bao fusion combinations I've seen recently -- I was a bit skeptical when I went to saucy porka and saw combinations that could easily be unappetizing if not done correctly. However, I was pleasantly surprised when I tried my first bao tacos here -- since the colors, flavors, and textures were all executed well.<br><br>The best thing about all the bao is that the ingredients were all fresh and of high quality. Given that these are fairly pricey ($3-$4 after tax) I was glad to know that I was getting my money's worth. The 2nd best thing is that the bao was nice and fluffy -- and fresh enough where you could move ingredients around, grab it, take big bites, and have it maintain its elasticity (think about how a dry tortilla easily flakes and breaks when folded). Of the items I tried, I like the shrimp sofrito the best -- with a generous amount of shrimp and nice strong mix of herbs. The carnitas and the thai chicken curry were almost a tie for me, although I have to give the edge to the chicken for the nice heat that the mixture generated.<br><br>Overall, worth a visit if you're into bao and want to try something a bit different from normal. Also worth it if you're into tacos and want to try something just a little different.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/6mGvK939nvbA2sLZstilkQ/348s.jpg", "caption": "Sign"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/zzUhwemS1SXEx62ERf6X8w/168s.jpg", "caption": "Menu"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/kU9cjG7tPdE4QRpy-3l-sQ/168s.jpg", "caption": "Pork Carnitas, Thai Chicken Curry, Sofrito Shrimp Bao"}]}}, {"review": {"des": "Awesome find in the loop area! I love the idea of latin/asian fusion and the dishes were all unique and delicious. The paella was well seasoned and the portion was generous. For the baos, the tofu one was probably my favorite. <br><br>The staff were super friendly but the place is kinda small, so you might have to wait or get take out if its a busy time.", "pics": null}}, {"review": {"des": "So it's, like, tacos except instead of a tortilla it's, like, bao. U know, like the buns? Bacos! Get it???<br><br>Tbh, this is way easier to hate before you try it. Yes, it's a funny gimmick, but they justify it because the taste of the filling is quintessentially \"asian fusion\", it's not lazy. And honestly, the quality of the meat is a much bigger selling point than the trendy gimmick. I got the chicken, pork, and steak \"bacos\" (lol) and I was not underwhelmed by any of them. Also cheap. It's like bao, except a much bigger emphasis on the fillings and the bun isn't all crusty and papery. Good stuff!", "pics": null}}, {"review": {"des": "Amy the owner sent me a message and apologized for the order issue. Great customer service. As I mentioned in my review, this is one of my favorite places for lunch in the loop. I have turned my friends on to what I call a hidden gem and will continue to do so. The corizo egg rolls are my favorite!", "pics": null}}, {"review": {"des": "The service is great and for a busy lunch hour, you could still get your food and be done in less than 30 minutes. Only thing is I didn't really enjoy the flavors. I got a chicken, beef, and pork bao taco to try. The pork and beef tasted similar with some pineapple atop it ( or maybe I accidentally got served two of the same...?). Anyway, I wouldn't get the Bacos again. They were not memorable.", "pics": null}}, {"review": {"des": "I still have lots of love for Saucy Porka and will continue to use it in my lunch rotation.<br><br>This place get kudos for cleanliness.  My friend and I got there around 1:15pm and a bunch of tables were clearing out.  As soon as people left, servers came to wipe off both the table and the bottles of sriracha. Thank you!  I'm happy to see that they are keeping it all sanitary. <br><br>I always order the chorizo egg rolls because they are delicious, and they were delicious yesterday.  I decided to get the miso short rib rice bowl which I had never had before.  The portion was very healthy and I took almost half of it home for dinner.  But I was a little let down by the flavors: it's described as containing coconut rice but it tasted like plain rice to me and the short rib was actually under-seasoned.  I saw from other reviews that people described it as too salty, but I think they've gone a little too far in the opposite direction.  Still good, and I ate all of it, but could've been better.<br><br>My friend had the cubana banh mi (with chorizo egg rolls, of course) and loved it.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/hPzFm2YxsJQ4Jmz_1V7kMw/168s.jpg", "caption": "Cubana banh mi with egg rolls"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/zzVjysn-rjwLSdp5wQXZfw/168s.jpg", "caption": "Miso short rib rice bowl with chorizo egg rolls"}]}}, {"review": {"des": "UGH...it's so disappointing when you look forward to a nice bao all morning and then you open your to-go lunch order bag and see no bao.  No bao! One of 2 items missing.  I tried to enjoy the paella but utter sadness had taken away my appetite.  Followed by a pork canita bao, I bet the paella would have been the bomb, but I'll never know.  The restaurant wasn't that busy when I came around 1p.  There was only one other person placing their order ahead of me.  I ordered 2 items totaling about $16, how hard was it to get that right?  I guess it's a good reminder to check my bag before I leave.<br><br>....| \\      _  , , , - - , ,  _  ,      <br>.../  , ` . - ' ` '             . _   \\ -  ;  ;  ;  , _    <br>..| ,  a  -   )   ) _         . ; .  (   ` - ` -  ' - '   <br>'  - - - ' ' ( _ / . _ ) - ' ( _ \\ _ )", "pics": null}}, {"review": {"des": "First time eating here it's a good place but all depends on your appetite some people like it some people don't ask for me the food does not agree with me but it was good", "pics": null}}, {"review": {"des": "Went to this place for lunch and immediately fell in love with the vibe. It's a tiny spot and might be a bit hard to locate but if you let your nose lead the way, the destination will be only a sniff away! <br>They have this fun concept of bao+tacos called bacos which is an open bun filled with meat and garnishing. Each of them is around $3-4 and about three comprise a meal! I got the pork carnitas, Friday special shrimps and Thai chicken ones. I loved all of them! Each one has a zest and different seasoning to go with. Except the lime fresh cabbage, nothing was common among them. <br>The staff was super friendly and was extremely patient answering all my questions when I couldn't decide what to order - yes, everything on the menu sounds great! <br><br>Overall, had a fun time and definitely coming back to Saucy Porka for round 2!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/AfONGRqrwzNMZvgGqp2-Ag/348s.jpg", "caption": "Bacos!!!"}]}}, {"review": {"des": "Tucked away on a street just off the busy street is this hidden gem. <br><br>Ordered the Soy Ginger Tofu taco and Yammy Yammy sandwich (it was yummy yummy). Ordering the sandwich also came with chips.<br><br>The flavor of both had just enough Asian zing to appreciate the cuisine but also tasted like really good food. <br><br>I wish I had done more of the tacos because it was so flavorful. My slight complaint with the Yammy Yammy sandwich was it definitely could've been packed with more veggies. <br><br>All in all this place was a great find and very tasty.", "pics": null}}, {"review": {"des": "I think this is a sister restaurant to Spotted Monkey, but I like SM better. <br><br>This location didn't seem as clean or as put together as the other place. <br><br>The food lacked something. It wasn't bad, just not great.", "pics": null}}, {"review": {"des": "Maybe my standards were higher than normal because I was really hungry, but I was unfortunately disappointed with the beet salad I ordered. It looked really good but was just okay. The beets were tasty and went well with the dressing. I don't know what the dressing was, but it had a tangy sweet slightly vinegar taste to it; at first I was confused because it was clear, but then realized it was the dressing. The sweet potato portion was teeny tiny and wasn't what I expected. <br><br>The saving grace of this review, well, the two things were the service and the carnitas baco (bao taco). The person who took my order was super friendly and efficient. The food was out very quickly even though there were many people waiting in the little restaurant. <br><br>I would come back for the baco - that rich pork and the flavorful sauce slightly dripping into the perfectly steamed bun (that they probably don't make in house, but it was still tasty). It was topped with little chunks of pineapple. If I weren't eating less meat, I would've just ordered two of those bacos and maybe this review would have been a 4. <br><br>Still, I'd say this is a decent place to check out! Quick service, good pork bao, and reasonably priced.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/v6LtVLAh-tuZdW8j_f3X2A/348s.jpg", "caption": "Beet salad (mediocre) and pork baco (delicious!)"}]}}, {"review": {"des": "Saucy Porka, more like good food more-a! The service was excellent and the food was even better. The shrimp tacos on Fridays are the reason to skip work on fridays and go here for lunch instead. Although we were visiting Chicago, we'd definitely feel comfortable recommending this place to locals. What a delicious meal and what friendly people. Go cubs!", "pics": null}}, {"review": {"des": "We were looking for some breakfast. But not just any breakfast, something different. <br><br>We found this place according to the \"breakfast and brunch\" filter via Yelp; which I don't feel is correct but I am grateful for the mistake. But I would say it's more of a lunch spot.<br><br>We literally walked right in before lunch hour while it was empty. But as the hour passed the tables quickly filled and the cue got longer. <br><br>It's an Asian fusion, with Latin, Vietnamese and Japanese, Chinese  and Spanish influences. <br><br>They have Bao Tacos, or Bacos; the miso short rib  bacos were bomb. I ordered the pork ramen which was more like a Vietnamese pho soup version I feel rather but it was still pretty good. They also have weird and different menu items like curry flavored sweet potato fries which were pretty good too. <br><br>Everything we ordered was good! <br><br>The service was quick, good, Fairly priced and the food as well was good! And the locals seem to like it.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/0PUhn8CGlpjp7QlF3lIk5g/168s.jpg", "caption": "Wall art"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/_477W6q8D7jOsWt18PNQTA/168s.jpg", "caption": "Menu"}]}}, {"review": {"des": "As my mother makes the traditional SE Asian style bao buns with pork, Chinese sweet sausage and eggs, I thought these buns were ok. While I understand that it's the modern fusion version of Asian food, the flavors didn't really stand out to me. I think it's missing a bit of sweet tangy flavors from the meat marinade.<br><br>I ordered the pork, chicken, and beef bacos. The pork was the best (enjoyed the pineapple salsa on top). The chicken was really tender! I would try other options here. Service was friendly!", "pics": null}}, {"review": {"des": "Will keep this short... The chorizo egg rolls are awesoommeee. An order comes with an avocado dipping sauce that compliments the roll oh so well. <br><br>I've never turned down an opportunity to come here for lunch. And the staff is as friendly as can be!", "pics": null}}, {"review": {"des": "This is my third time here and it was phenomenal. We ordered the beef, shrimp, and pork \"bacos\" which is their version of bao + taco combo. They serve their meats on top of a bao bun, thus a \"baco.\" In order, I would rate beef 5/5, shrimp 5/5, and pork 4/5, although the cashier recommended the beef and pork as their top sells. My boyfriend said he liked the pork the best and it was a tie between beef and shrimp. He ordered the shrimp po'boy which was also 5/5. Their service is great, and they really add to a fun, positive experience with their bubbly personalities. The only downfall was that the sweet potato fries were served cold, although in my prior experiences, they were served fresh. It's a small place and they're only open until 3pm so it's exclusively a lunch spot. I am definitely coming back and would recommend this to a friend.", "pics": null}}, {"review": {"des": "I loveeee the concept of this place's food and was so hyped after reading Yelp reviews but I don't know... there's something about the execution that just leaves me feeling like something's missing.<br><br>Bacos - I got the carnitas and barbacoa (new) bacos. One of them was realllllly spicy but the sweetness of the pineapple made it okay. The meat was a bit dry so this would've been better with a sauce or something.<br><br>Tostones - The shell is really crispy and kind of resembles a samosa, which I liked. The meat inside was pretty dry and had a crumbly-like texture. The flavor was good but it also could've used some sort of sauce inside to tie it all together. Came with a green sauce on the side that was realllllllllly good.<br><br>Curry Sweet Potato Fries - Good (CRINKLE) fries!came with a sauce that had a really strong ginger flavor (and not really of curry) but it tasted really good when I dipped it in the sauce of the tostones. I think this would've been perfect with some chipotle mayo. <br><br>Asian Paella - I was the most excited about this dish but was disappointed. The rice could've been more flavored, like in a paella, and the portion could've been more for the price. It also needed a lil more than just sausage.<br><br>I think I just might be being overly critical because I overhyped the place for myself. The service is reallllly nice and the food is still tasty (just not what I expected). Give it a try, as long as you make you come during its weird hours!!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/-M4QkJHzBZopM4RwPaG0Ew/348s.jpg", "caption": "Tostones, Pork Carnitas baco, barbacoa baco, Curry Sweet Potato Fries, and Asian Style Paella"}]}}, {"review": {"des": "A cool little restaurant! I went there early in the morning for breakfast. They sold an asian fusion style restaurant! It is so good. You order at the counter. Their service is fast, probably because it is early in the morning. However, their foods are not complete in the morning. That is obvious.<br><br>I went here a little while back I forgot what I ordered, but I have the picture posted! I will come back to this place when I visit Chicago!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/NSfzPcqNe7hoy9MRpKbA3Q/348s.jpg", "caption": "Dont know what is the name but it is so good"}]}}, {"review": {"des": "Visiting Chicago and were told this was a must visit! We ordered the Thai Chicken Curry and Beef Barbados Bao and a Cubano Sandwich. Layers and layers of flavor. A line formed immediately after we got there but they are prepared for the group. They have 2 locations and this one isn't open on the weekends. Fabulous!", "pics": null}}, {"review": {"des": "Saucy Porka is a great lunch spot. It gets crowded, but the line moves fast enough. I had the Arroz con Chicken Churry, along with 2 bao tacos (Beef Barbacoa and Pork Carnitas). These were recommended by the cashier, so I went with it. The meat was very flavorful, but I could not get used to the sweetness of the pineapple on what would be a savory bun on its own. Also, the rice bowl had a lot of rice, but very little chicken. If you arrive hungry, you may need to order more than just one rice bowl to fill you up!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/fwmZT3odqO7OOnQ5GnRT9g/348s.jpg", "caption": "Curry Chicken Bowl"}]}}, {"review": {"des": "This has to be the most interesting food I've had in a VERY long time, if not ever. After viewing the menu, I made it a point to order as much food as I thought I could carry through the freezing-cold streets of Chicago--a disclaimer I voiced before placing my order, to the amusement of the staff (who were all freaking awesome people).<br><br>First of all, my wife was born and raised in Panama, so I've tried my fair share of takes on Hispanic dishes. That said, the tostones were absolutely wonderful: perfect in texture, delicately crispy, and topped with some of the most interesting flavors I can ever recall eating. I also ordered the chorizo egg rolls served with what I believe was a green onion aioli, though I might be incorrect.<br><br>I made it a point to also try the chicken curry baco and curry sweet potato fries, both of which you would do yourself a great injustice to miss--rich in flavors without being overbearing or confusing. A man can only eat so much at once, however, so I saved the shrimp bacos and arroz con edamame with pork and shrimp for dinner.<br><br>In a nutshell, literally everything I have ordered and tried so far took me for quite a ride, and I'd be more than willing to stop here every time I visit downtown Chicago. Thank you for the wonderful experience.", "pics": null}}, {"review": {"des": "I came across this restaurant through Yelp, so I decided to give it a try. After walking 15 minutes, I was not impressed. I was suggested to try the Asian Style Paella and their signature margarita lemonade. The Paella was not to my liking although it is a favorite. The temperature of the food was warm like it was sitting out and the spices did not WOW me-they did not compliment each other. I did enjoy the lemonade though ;). I will give it another try with the Baco Tacos", "pics": null}}, {"review": {"des": "Staff was amazing, very helpful and attentive. Love them. I got the pozole, pork baco with pineapple salsa, tostones, and egg roll. Take a pass on the tostones and egg roll, was fairly standard. BUT go get the pozole. Like,  now. And the bacos are so bite size and good, how can you not. The pozole is so well seasoned, it will keep you going back.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/3wUOQgO_AQqKL3pvRdJbaw/168s.jpg", "caption": "Pozole and pork baco, get this. You won't regret it."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/3xVXsi5bYCY_qV3j88TfAw/168s.jpg", "caption": "I'd pass on these, tostones and egg rolls. Tasty, but pretty standard."}]}}, {"review": {"des": "THREE STARS!! Food was fantastic - I started with the chicken taco and finished with the cubano. Would be 5-stars if only graded on food. HOWEVA - not a great location (plus it was RAINING!). Bread, a little tough. Cost was a tough over where it should be priced so the value:portion ratio is sub-par. But if you need a snack, this food is fantastic.", "pics": null}}, {"review": {"des": "Really delicious!  The flavor of the carnitas might be the best I've ever had. Also, it would be dangerous if I lived nearby because I'd ALWAYS be ordering the chorizo egg rolls...they and the aioli or wherever it was they came with were so good. <br><br>The Asian paella was really good, but it seemed a little more like a fried rice dish than a paella in the traditional sense.<br><br>Would definitely go here again!", "pics": null}}, {"review": {"des": "Ordered delivery recently and it was great!  I had the chicken salad got two baos on the side which went really well with the salad.  I'd definitely order from here again.", "pics": null}}, {"review": {"des": "Saucy Porka is an incredibly unique little spot with tasty food!<br><br>I came here with a friend after reading some raving reviews about this place. I don't come to this part of the loop too often, so I decided to sample some of the more popular items on the menu. I got the chorizo egg rolls and three \"bacos\": the pork carnitas, thai chicken curry, and miso braised short beef rib. The \"bacos\" were all pretty good, but the short rib was by far the best, with an excellent flavor profile of the meat, coupled with the refreshing pineapple salsa. Of the three, I thought the thai chicken curry was probably the worst (relatively). The chorizo egg rolls were also amazing, and it tasted even better when paired with the avocado aioli (which was surprisingly chunky in a good way). I was pretty hungry when I got here, and I left fairly full.<br><br>The restaurant is very well lit, with lots of window light. It's a pretty small place, but the tables here feel very clean, and the waiters/waitresses do a good job of cleaning off the tables very quickly after people leave. The service is very friendly as well, and I saw several workers checking up on the customers to ask how their food tasted. I was here from around 1-2PM, and while the restaurant was fairly full, it never felt too crowded, and service was quick.<br><br>I'm looking forward to visiting Saucy Porka again. I definitely plan on trying their ramen bowls and banh mi sandwiches some other time!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/UDn8vXw9aaPRh3OVkRpwng/348s.jpg", "caption": "(From left to right) Pork carnitas baco, Thai chicken curry baco, beef short rib baco, chorizo egg rolls. Yum!"}]}}, {"review": {"des": "How is this dumpling-as-a-tortilla thing not more popular??? Holy smokes this stuff is good! I'm only taking a star off because the pork was on the dry side, but I'm sure if I got a different meat that my opinion would be changed. I would kill to go back to this place and try out their other selections, but sadly our trip to Chicago came to an end too quickly. Also, if you can handle it, the habanero sauce they have on the side is out of sight.<br>Lastly, if you're doing the touristy thing, Willis Tower is pretty close by. Stop and grab food before heading to the top of the tower for the views.", "pics": null}}, {"review": {"des": "Over the span of a few months, I've visited several times and even converted my parents. If baffles me that I still don't have a review for Saucy Porka. <br><br>What have I tried? Curry sweet potato fries, chorizo egg roll, saucy pork sandwich, Ho Chi Minh sandwich, and short rib bao. I am not a big fan of the baos, but I almost always repeat the sweet potato fries, chorizo egg roll, and saucy pork sandwich. <br><br>The sweet potato fries' crispiness is done in perfection. Every time I take a bite, I wonder to myself, \"How did they get it to this texture without burning it?!\" The spice and curry aioli sauce is also exceptional. The egg roll is packed with queso fresco cheese, sweet potato, red cabbage, onions, and chorizo. To its side is the avocado aioli for dipping. In no way to degrade this egg roll, it fondly reminds me of the chop suey egg rolls that I use to have in my childhood years. The execution and wrap is similar but the ingredients are the major difference. This chorizo egg roll and its queso fresco cheese has me hooked. Last but not least, the namesake saucy pork sandwich has tasty, tender pork carnitas topped with kimchi. Ever since having it, I haven't touched the other sandwiches at Saucy Porka again.", "pics": null}}, {"review": {"des": "Delicious! My friend was visiting from NYC and wanted to meet up here and we both fell in love with it. I'm usually too busy at work to eat anywhere but my desk but I've done a trip here a couple of times already in the past two weeks. It's worth it! And the staff is super friendly too!", "pics": null}}, {"review": {"des": "Why have I not been here before??<br><br>Fantastic lunch...just the right amount.  Not a lot of space to sit, but worth the walk over.<br><br>I had the Saucy Porka and it was fantastic!  Perfect pork with Kimchee..outstanding.  My son had three of the Bacos (one each pork, chicken and beef) and loved each one.<br><br>Looks like I have a new place for lunch!!", "pics": null}}, {"review": {"des": "I was really looking forward to trying this place and it didn't quite live up to my expectations. The miso braised pork bao was too salty and had a barbeque-esque flavor. The asian style paella was pretty good. It had pork, sausage, and chinese sausage. I thought the chinese sausage added a nice flavor to the dish. Not something I would have thought to add but it worked great in this dish! The chorizo egg rolls were decent but it wasn't as flavorful as it sounded. The best dish in my opinion was the curry sweet potato fries. But honestly, it'd be pretty difficult to screw those up!<br><br>Service was great though! We had a party of 6, and the place is pretty tiny. Right away, they tried to find a table that would fit us and our server was super attentive and informative.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/5ScrUVSSfTs8JvYzVmvx8g/348s.jpg", "caption": "Miso braised beef short rib bao"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/2pEjLwIVwz-bxZa00fPUCA/168s.jpg", "caption": "Asian style paella"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/4G5oDsxqTpDHkOqpsP-40w/168s.jpg", "caption": "Chorizo egg roll & curry sweet potato fries"}]}}, {"review": {"des": "I went for the Asian Style Paella and I was not disappointed. The food came out pretty fast after I ordered. Every bite was full of flavor and the three types of pork included. <br>My only complaint was some of the rice was a little burnt but some people like that just not me really. I like my food spicy so it was convenient that they have hot sauces readily available.<br> I can't speak for the other dishes on the menu but for someone speaking a convenient fast casual spot this place was great for it.<br>I will definitely be back to try different dishes and hopefully they are as good as the rice bowl I had.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/bRbVZXpaC7ID3XbxUgvW1Q/348s.jpg", "caption": "The Asian Style Paella with an egg on top."}]}}, {"review": {"des": "Came here for lunch on a weekday and had a great experience. <br><br>FOOD: 4 stars<br>I had the PORK CARNITAS BAO and MISO SHORT RIB BAO. Both baos had great flavor, but both the carnitas and short rib were a little dry. Also, the size of the bao was smaller than I expected. They do load it up with meat, but the overall bao looked a little sad on a plate half full. Imagine an authentic Mexican taco, loaded up with meat. ~$3 is the upper end of what I'd be willing to pay for that. It's unlikely that two baos would fill a person up. The CHORIZO EGG ROLLS were delicious. Crisp and well deep-fried and full of chorizo flavor. The chorizo wasn't as oily and fatty as I'm used to, which was a pleasant surprise. <br><br>Next time I go, I'll try the pork carnitas banh mi, which someone at the neighboring table ordered and it looked good. <br><br>SERVICE: 4 stars<br>Nothing fancy here; order at the counter. They had a good system and an efficient ordering system. They had plastic cups by the fountain for water, which is always a gracious move that I appreciate. Not too many tables, but they were quick to clean up empty plates and empty tables. <br><br>AMBIANCE: 3.5 stars<br>While overall a nice place, the back looked a little dingy. But it was clean and the tables and chairs were clean and orderly. I wouldn't say this place has much personality, nor would I say it lacked it. <br><br>All in all, good flavors for a tasty meal and I'd go again.", "pics": null}}, {"review": {"des": "The staff especially Natalie was extremely helpful since it was our first time there. The food was fantastic. The fusion of American, Latin and Asian cuisine was excellent! I'd recommend you come hungry so you can try a bit of everything.", "pics": null}}, {"review": {"des": "Alright I've finally had my first encounter with Mexican/Asian fusion cuisine now, excellent! Where to begin, oh I know! This a great destination for the chicago loop workforce looking for an affordable yet flavorful and exciting lunch. Although some of the prices for some of the food items was not as exciting. The baco I ordered,the barbacoa one, was a bit overpriced to be honest, it half the size and volume of a regular Mexican taco. However, I love the idea of using a boa as a tortilla, talk about genius! I love how soft and moist it was, definitely a change of pace to the corn tortillas that I've grown accustomed to. Definitely a tight fit for a joint that is so well known. Their staff is definitely on the friendly side, which is excellent. The chives and pineapple add something special to the mix with the marinated barboca, it helps it become even more flavoral and tender than it already is. For my main course, I went with the popular Saucy Porka, which is ironic because it's the establishment's namesake. Let's just say Xoco can't hold a handle a candle to this carnitas torta, or better yet Bahi Mi which is the correct term. Definitely some of the best carnitas in the Chicago loop area. The inclusion of a subtle mayonnaise mixture is perfect. It works in the the carnitas favor to create one of the most delicious and distinctive lunch time sandwiches available! Not to mention the bread roll that holds all the contents together, I sure hope its baked fresh daily! Because if it's not, wow they have some skill, because it would have flew under the radar.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ZX3x6MyQkgj5mur2Hyh3SQ/168s.jpg", "caption": "Barbacoa baco"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/d-tZ42SCbyz3Tp9XuAhn0w/168s.jpg", "caption": "The Saucy Porka Sandwich"}]}}, {"review": {"des": "Looked great on YELP, so I decided to check it out. <br><br>It's a latin and Asian fusion place. <br>Just had 3 baos just to test out the flavors. Not very good value. They're pretty pricy for such small baos. I mean they try and stuff as much stuff in there, but it's so small that it fits as much as a taco. <br><br>Took the subway there, so I didn't have to deal with parking. The seating area is small, but can handle groups; it's more of like a fast food place so you don't feel the need to stay very long. <br><br>Ordered: <br>Pork Carnitas topped with pineapple salsa and served on a steamed bao bun $2.75<br>(nothing special than a carnita taco in Dallas.)<br>Thai Chicken Curry topped with pickled Asian slaw served on a steamed bao bun $2.75<br>(very dry and not strong curry flavor)<br><br>Miso Braised Beef Short Rib topped with pineapple salsa served on a steamed bao bun  $3.50<br>(My favorite one)<br><br>My husband and I tried this with some fries from the Frite shop 2 stores down.", "pics": null}}, {"review": {"des": "Overpriced and difficult to find parking ($6.50/hour around this area). The baos were small and I would need at least three to be full. I orderd two baos and the large sweet potato fries and the total came close to $12. <br><br>The pork carnitas was bomb but the thai chicken tasted off to my taste buds. Fries were decent, meh, I've had better. But the thing that stood out was the sauce that it came with. That made things much more flavorful.<br><br>One thing I didn't like about this store was one of the name of the sandwiches, dubbed \"Ho Chi Minh\". I don't want to make things political but it irks me since Ho Chi Minh was the leader of the communist party in North Vietnam and I don't support the store naming one of the sandwiches after him.<br><br>Service was fast and friendly. If you get a sandwich or just two baos, they bring it out on this food basket and it makes things look very empty. It's probably not a big deal but if you're one of those social media people, just a heads up, it won't be Instagram worthy..", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Q573YAi3rFACeZ6KjlT_PA/168s.jpg", "caption": "Sweet potato fries with 2 baos"}]}}, {"review": {"des": "1. Beet salad - good flavor, but portion size was pretty small. There were only a few pieces of diced sweet potato, which tasted like cinnamon.<br><br>2. Pork Ramen - the pork tasted good, but this was definitely looked more pho than ramen. But it didn't taste as good as pho. The soup had a distinct cinnamon taste. Not sure how this would be considered Asian Latin fusion. <br><br>3. Curry chicken baco, ginger tofu baco - flavors were pretty good<br><br>4. Miso braised short rib rice rice bowl - the beef was ok, nothing special. The rice was supposed to be coconut rice, but it didn't taste like coconut. Again not sure what the Latin part of the fusion was here.<br><br>Verdict: stick with the bacos (bao tacos)", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ZuPqx-0QKQPD7mq3u-EWbg/348s.jpg", "caption": "Soy ginger tofu and Thai chicken curry bao taco"}]}}, {"review": {"des": "An interesting find.  Like the mix of cuisine but wish they offered more variety.  Heard this place made the Diners, Drive-in's, and Dives show (not sure if true), but not seeing the wow in the dishes.  Staff were friendly.  No restrooms in the joint was a bummer too.  I tried a few tacos.  My favorite part of my meal however was the Tostones.", "pics": null}}, {"review": {"des": "You would think a place that had saucy in the name would have more sauce in the items.  They were tasty, just dry. meh", "pics": null}}, {"review": {"des": "Saucy Porka is serving up some phenomenal Latin and Asian fusion food and I am so happy to have stumbled upon this gem on my way to Willis/Sears Tower. My boyfriend and I ordered a small sweet potato fries, one Thai chicken curry baco, one miso short rib baco, two sofrito shrimp bacos, and the Saucy Porka banh mi. <br><br>Everything was SO good! Super well seasoned and flavored. The meat was incredibly juicy and tender. I don't normally like sweet potato fries, but I freaking loved these! They were so crispy and the mayo dipping sauce was delicious. Highly recommend the fries and just about everything else. I would eat basically everything Saucy Porka serves on their menu.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/V_x2u6JffvKvZxZcsPW8IA/168s.jpg", "caption": "Safrito shrimp bao taco ($3.50/each)"}]}}, {"review": {"des": "What I ate: shrimp bao taco, short rib bao taco, curry chicken bao taco and veggie egg rolls <br><br>The bao buns were all delicious. Perfectly fluffy and soft. The fillings were all good too but nothing memorable. The veggie egg rolls were similarly tasty but nothing I would crave. My favorite bao tacos are oiistar and little bad wolf and these just didn't measure up for me.  They are only open for the day time lunch type meal and are a good pick for that, I would definitely pass on this as a dinner option. <br> <br>TL;DR: Nice quick lunch spot for bao tacos and fusion but much better options available in the city", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/2zKpZNG6f_yDQbYFnhByxA/348s.jpg", "caption": "Veggie egg roll. Shrimp, short rib and curry chicken bao tacos"}]}}, {"review": {"des": "Saucy Porka is hands down my favorite lunch spot in the loop. The shrimp and fried tofu bacos are my go-to's. The bao are fluffy and sweet, and the fillings are savory and flavorful. <br><br>The veggie eggrolls are filling and quite satisfying. I prefer the avocado aioli because it's creamier than the mojo sauce and doesn't taste as overwhelmingly of garlic. <br><br>The rice bowls are also extremely tasty and will fill you up. The staff are friendly, and the line moves quickly. The tables fill up quickly at lunchtime, so you may want to take your food to go!", "pics": null}}, {"review": {"des": "Great fusion flavors but for a price! If you are in the area and just really craving Latin and Asian flavors then definitely stop by here. They have a great selection of Bao tacos (Bacos), banh mi sandwiches, noodles, and Latin and Asian influenced appetizers and well as desserts and beverages. The prices are a bit high, but it is in the downtown business area. This concept of fusion can be tried elsewhere in Chicago for cheaper though. <br><br>I ordered the Arroz Con Edamame, Curry Sweet Potato Fries, and the Thai Curry Chicken Baco. Everything was really delicious! For $9 the Arroz con Edamame was a bit pricey for the size, but they do give a fair amount of the braised pork. The flavoring in the rice and meat was very good. The Fries were perfectly seasoned as well and the aioli that accompanied it was so delicious! I couldn't help but use all of it. The Baco was just okay. Maybe I was just incredibly hungry and basically inhaled it so I could not really taste much of the curry flavor, but the bun was soft and the chicken itself was tender. <br><br>Nonetheless, the experience was nice and the food is worth a try!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/MW-NlugyD_KBjIIBNBD7KA/168s.jpg", "caption": "Bacos, Curry Sweet Potato Fried and Arroz con Edamame"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/eDHuyrqHRhlCsX4vIMOsjQ/168s.jpg", "caption": "Arroz con Edamame-$9 but delicious"}]}}, {"review": {"des": "Y'all need to try this spot. Got the Asian Paella, Chorizo Egg Rolls and softrito shrimp bao tacos... the sauce for the rolls was sooooo good. Everything was amazing and they had awesome service. <br>This will be my new spot to take people that visit from out of town.", "pics": null}}, {"review": {"des": "Seems a bit overhyped, I'm afraid.<br>I was so looking forward to some quality fusion in the financial district.<br><br>Unfortunately, upon ordering the miso braised beef short rib bowl, I was met by a saucy, salty entity trying quite hard to masquerarde as \"miso.\" Dry, salty, with not much texture differentiation. I would say, this entree was \"miso-inspired\" at best. My friends and I managed to beat a truly insane lunch rush line, but I wouldn't say the quality of the miso bowl was worth it. Granted, my portion was far larger than my friends who ordered the other \" baco\" items or appetizers. Did I mention the bowl was $11? This is not for those trying to scrimp on a budget.<br><br>On top of all of this disappointment, patrons kept eyeing one of the seats at our table. One of my friends was 2-3 minutes late, and we were trying to keep the seat until she arrived. Even while she was ordering, people kept trying to move the seat. It's a dog eat dog world out there, I'm telling you. Especially, it seems, when it comes to Saucy Porka.<br><br>I'll give this place another shot on a less busy day, but until then, there are plenty of other options to try.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/9sTnQkNwE-pEqn3JydmrxA/348s.jpg", "caption": "Looks quite nice, but a bit disappointing."}]}}, {"review": {"des": "Yowza! This bao is so delectable, it might be my new favorite bao place in the city. <br><br>Went here for lunch around 130, got in just after the lunch rush. When I went to order I literally heard someone say \"wow that was so good.\" So I had high expectations and..<br><br>It was awesome! I wanted to try the backs and ordered the Thai chicken curry, short rib, and the pork carnitas but really wanted to try the tofu as well. But I just kept it to the three. <br><br>Lo and behold, Amy, (a worker possibly the owner?) brings me my bacos but also brings out the tofu baco complimentary. Definitely didn't have to do tgat but I think she knew I would be hooked! The tofu had a nice crispy edge and was bouncing with flavor.<br><br>Forget the corporate bao place across the street and come to saucy porka, for some fluffy mouthwatering bao that'll leave your taste buds wanting more.", "pics": null}}, {"review": {"des": "Tried this for the first time today since they were quick to return as a popup at work. I haven't even finished eating the meal but I wanted to stop and tell you all how tasty this food is. At first, the bacos appear small and will give the impression that you'll be left hungry, but after eating a little of each, I know I'll be comfortably full. I bought a pork carnitas and a chicken baco (which was substituted w/ kimchi). One sweet, one savory, and both with a medium heat. I also bought a chorizo egg roll with a green dipping sauce. I am not disappointed with anything I have, and will definitely go back the next time they're in the building. Might have to visit the restaurant if they don't return quickly. Very good and reasonably priced.", "pics": null}}, {"review": {"des": "Wasn't great. Had the Ho Chi Minh Banh Mi with tofu, wouldn't recommend. Mistakenly, I expected the cavassa chips to be made in house but they were in a bag. <br><br>Not impressed, though I may come back to try the \"bacos\"", "pics": null}}, {"review": {"des": "I have been going here for close to five years and not left a review because there were so many already.  After going there again for about the 100th time, I realized that's not fair - because this place is awesome.  Slow cooked meats with Latin and Asian inspired flavors deserve all the kudos in the world.  Everything at this place is delicious, but I particularly love the chorizo eggrolls, pork ramen and carnitas bahn mi (aptly named for the restaurant, as the Saucy Porka).  Top it off with the fact that they offer real cane sugar (Mexican) bottled Coke - what more could you ask for?  Five stars all the way!", "pics": null}}, {"review": {"des": "I've been soo hesitant to try this place and typically just opt for Wow Bao across the street.  My coworkers dragged me here, and I am soo happy they did!  The food was delicious and flavorful!  I ordered the tofu bao, chicken curry bao, and pork bao.  The tofu bao was okay; the tofu was fried which isn't my preference.  It had flavor and is a good alternative for vegetarians.  The chicken bao was my favorite.  The meat was juicy and full of flavorful; it really wasn't spicy for being curry.  The pork bao had a lot of flavorful and it was really good.  The only complaint I had was the meat being a little overcooked (like what other yelpers said).  Despite it being tough, it was still delicious.  The three baos totaled $10 after tips and was a little bit pricey for the amount of food you get.  The portion was alright, but not huge.  The service was great.  While sitting at the table, there was always someone walking around refilling water or removing trash.  I would definitely come back again.", "pics": null}}, {"review": {"des": "This is one of my favorite lunch spots in the Loop! Definitely a hidden gem. The chorizo egg rolls and the mojito lemonade keep me coming back again and again. The staff is very friendly, and always willing to help walk you through the menu. The only downside is that the location is pretty small so if you plan to dine in it may be a challenge to find a table.", "pics": null}}, {"review": {"des": "From San Antonio looking for breakfast Tacos, but they didn't look good, I figured I'd try Bacos instead. Had the Barbacoa, Chicken and Carnita Bacos and Chorizo Egg Rolls. It's not what I was lookin for but I'm pleasantly surprised that everything was so damn delicious! This place is for real! Carnitas game on point.", "pics": null}}, {"review": {"des": "I got two of their \"bacos\" (chinese bun (bao) shaped like a taco shell, filled like a taco). In particular, I got the pork and the short ribs. Even though they were about the same size as Wow Baos from across the street, they contained twice as much real meat (as opposed to small pieces of meat drenched in sauce from Wow Bao), which was nice. Furthermore, the bacos were sprinkled with sweet pinapple for color and a little sweetness. <br><br>However the pork was a bit dry, and the pineapple was harder to taste that I thought it would be (not sure why). Unique look, but otherwise same as a chinese bun once it has entered your mouth. A little pricy, with a meal being between $9.60 - 12.80. <br><br>I would get 3-4 for a hungry 22-year-old male.", "pics": null}}, {"review": {"des": "Asian/Latin fusion!? Definitely my thing! The place was packed with people on a Friday afternoon! I guess it was lunch time, it was packed with both tourists and business people. For those not familiar, you order at the counter and then find yourself a seat. Their people will bring out your food by calling your name or asking for your number card. <br><br>We ordered the asian pork paella and 4 different buns (pork, beef, shrimp, and curry chicken.) The presentation was great - made it look even more delicious. The paella dish was amazing. Definitely tasted the fusion flavors. I loved every bite! The rice was nice and crunchy and the pork sausage made it taste so much better! They also have sriracha sauce if you want to add some kick to your food. As for the buns, I was a fan of the shrimp (with a green sauce) and the beef one. The pork one was way too dry - we had to drench it with sriracha. The curry chicken tasted weird. The curry wasn't like any other curry that I've ever tasted - it was weird. <br><br>Although not a sit in restaurant, their employees would still come around and ask if we're enjoying our food. The portions aren't too big though. I should open my own Asian/Latin fusion place in NY, maybe it'll be just as successful!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/h-aXxd--dqNcDBOs1Px3Zw/168s.jpg", "caption": "Buns on buns on buns!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/SqXZ8VnCUK6NjYyeKn6Vjw/168s.jpg", "caption": "Asian paella"}]}}, {"review": {"des": "Stopped by today for lunch. I had a noodle soup with pork but substituted the pork for beef and it was delicious.  The service is fast and polite. The place is clean and I enjoyed my visit. Can't wait to try the rest of their menu.", "pics": null}}, {"review": {"des": "Grabbed a late lunch at this fantasist Latin-Asian fusion quick spot. Me and my dining companion split an order of tostones which were perfectly prepared, crispy and a little moist inside and paired with a yummy garnish and sauce. We got one of every \"baco\" to split and our favorites were the shrimp and the carnitas. There was a nice heat in everything and the bao was perfect, not too chewy and perfectly fluffy. All in all it was great and inexpensive. We were in and out in under 30 minutes but never felt rushed. We will both be back, we only wonder why it took so long to go", "pics": null}}, {"review": {"des": "I work in the Loop so I decided to check out Saucy Porka.<br><br>I got the ramen pork soup. It was not that good. It had a sweet flavor to it, which I did not like for ramen soup. The meat tasted like it was BBQ pork just thrown in ramen. The flavors did not mix well.<br><br>The place does not smell that great either. Probably will not go back.", "pics": null}}, {"review": {"des": "I'm not into the sticky buns but the pork inside was great. Also the chorizo  egg roll was amazing with that green dipping sauce. Service was fast and friendly.", "pics": null}}, {"review": {"des": "The baos were good but the highlight of the visit was the chorizo egg rolls.  <br><br>My friend was fascinated with how crunchy the kimchi swt potatoes were. (Which were also ahhmazing). <br><br>Great hospitality as well. I was offered a refill on my vietnamese coffee even though i was about to walk out. Although the offer was late, the effort was appreciated.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/nxLHdSFyjvjJI87awXs0eQ/348s.jpg", "caption": "Chorizo egg rolls"}]}}, {"review": {"des": "This is a nice little lunch spot with good food. Ive only had the namesake bahn mi, which was really good. It does get very crowded here at lunchtime, but definitely worth checking out", "pics": null}}, {"review": {"des": "After visiting the Willis Tower (yes, I'm a tourist and I'm not ashamed to admit it! And yes, I did take some selfies out on the ledge), my boyfriend and I needed a place for a quick lunch. A Yelp search came up with Saucy Porka and everything on the menu sounded pretty good. It was an Asian/Latin fusion, so it seemed pretty interesting.<br><br>You order at the counter, find a table (if you can - the place is really small), and they bring your food to you.<br><br>I went with the Saucy Porka (pork carnitas served on French baguette topped with kimchi). I guess I've been eating really good banh mi sammies back in NYC, because I was expecting this one to be on par with the ones I'm used to. Unfortunately, it was nowhere near there. The pork was a tad try, and it was missing the pickled carrots and daikon, which are two of my favorite components!<br><br>My boyfriend went with the Asian Style Paella (served with Chinese Lop Churng pork sausage, spicy sausage, pork carnitas, edamame, bean sprouts, scallions). He really like it but I thought this was just alright. It had the same pork carnitas from the sandwich that I wasn't a huge fan of. <br><br>The portions here aren't that big. We weren't still hungry when we left, but we weren't really full either. Maybe we just didn't order the right dishes.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/FK1lL5oFFbpvaMSrgPnWYw/168s.jpg", "caption": "Saucy porka"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/nAyqzAcPhDk0JasXKYZXsQ/168s.jpg", "caption": "Asian style paella"}]}}, {"review": {"des": "Meh. Buns were a little hard from sitting out. Small portions. Looks like they're generous with the filling, but in reality, they just barely open the buns/baos. I did like that they had siracha available", "pics": null}}, {"review": {"des": "Decided to venture out to a new area of town for a quick lunch bite, Saucy Porka didn't disappoint! I opted for the pork carnitas and Thai chicken curry bao tacos (bacos) and they were delicious. The shells were delightfully fluffy and the flavors were off the charts. The bacos paired nicely with the curry sweet potato fries. Highly recommend Saucy Porka!<br><br>Side note: seating is limited.", "pics": null}}, {"review": {"des": "Great little place in the city to stop by for lunch. I tried the saucy porka sandwich and also ordered the chicken curry baos. I was with two other people and they tried some baos and other sandwiches too. We also all shared the chorizo egg rolls. <br>   The flavors of the food were great and the portions definitely fill you up! I didn't really like the cassava chips that came with the sandwich, though. The sweet potato fries were also a bit undercooked which was kinda disappointing. But the sandwiches, baos, and the egg rolls were fantastic! <br>   The restaurant itself is a bit small, but clean. Service was great. I appreciated them allowing my mother to sample some kimchi, as she had never really eaten it before and was afraid of the spice. Glad she tried it too, as it was too much spice for her. If I was ever in the area again I would totally stop by this little spot again.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Hd7DKEqLtz5eGWqxhIZusA/168s.jpg", "caption": "Sweet potato fries (large order) and chorizo egg rolls."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/N3Hx5Qmb96AdizQuJiEvzA/168s.jpg", "caption": "The saucy porka."}]}}, {"review": {"des": "Mmmm, I love places that are one $ sign on Yelp. Saucy Porka is very yummy and super close to the Willis Tower (aka Sears Tower aka Skydeck). <br><br>My friend and I came here before walking over to the Skydeck. Their curry sweet potato fries were BOMB and they're so well priced. I also got the Miso Short Rib bowl which was delicious, though a little bit too salty. I ended up running out of rice and having leftover meat because the meat was just so salty. I love that this place does not skimp on portions though, and it's so worth it for the price. My friend got three Bao Tacos aka Bacos. She got one Pork Carnita and two Miso Short Rib. She said the Miso Short Rib was better, but both were delicious.<br><br>Overall, come here because it's so good and cheap. Just make sure you drink some water! Always get the sweet potato fries!", "pics": null}}, {"review": {"des": "Fantastic lunch spot! The bao tacos are fun and the flavors are all quite tasty.", "pics": null}}, {"review": {"des": "a coworker suggested I try this place in the future for lunch, I instantly understood after I glanced and the menu and photos. Two hours later, I was at Saucy Porka. <br><br>Walking in, the restaurant is very small but has the ability to seat a lot of people at the inside tables. After studying the menu, I had a tough time choosing between the baos and the ramen. Thankfully, the ramen came in a half size so I could get both! (Honestly, I was probably going to get both of them even if it came in a regular size...but thankfully didn't have to) anyways, I ordered the Thai chicken curry, the miso braised short rib and the sofrito marinated shrimp, and of course, the 1/2 order of ramen. <br><br>The Thai chicken curry bao is life changing. It was like biting in to a cloud and then that cloud explodes with flavors of curry and happiness all bouncing around your tongue. On a side note, I wish I could take a nap on one of those baos. They are so soft and addicting. Anyways back to the bao tacos. Next to try was the miso braised short rib. The sauce drizzled on the beef was thick and very sweet. While I liked this, I didn't love it nearly as much as the chicken curry. Finally the sofrito marinated shrimp. To me this had absolutely no flavor. I couldn't put my finger on what they were going for here, but either way I had one bite and was done. Not worth finishing it. <br><br>Finally the ramen. It was both light and perfectly satisfying. Chucks of jalapeño may terrify you but the seeds create a delicate balance to the salty flavors and really balance the entire soup. The short rib melts in your mouth with each bite and makes you want to cry each time you have to swallow and end the amazing experience. <br><br>Overall I would give the chicken curry a 10 (it honestly deserves a standing ovation from everyone inside the restaurant at the time with me), miso braised short rib a 6 and the shrimp a 3. The Ramen gets a solid 8.5 with a high snap of approval. <br><br>Next time I would be interested in trying more of the baos or even a rice bowl. All looked great as I passed by others and stared down their food. <br><br>:)", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Fn3A9QQ1ks7hE1osRZnM1A/348s.jpg", "caption": "In order from left to right: chicken curry bao, braised short rib and shrimp bao"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/bkqkk433_t8rmOQJ-hIYrA/168s.jpg", "caption": "In order from left to right: chicken curry bao, braised short rib and shrimp bao"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/GQIjSR2T_t7ma99GUl5nbA/168s.jpg", "caption": "Ramen"}]}}, {"review": {"des": "Maybe I'm spoiled being married to a Korean whose mom lives in LA's Koreatown.  But Saucy Porka was a disappointment.  All three of us sampled the miso short ribs in baco and nacho forms.  It was unanimous that the saucy slow cooking ruined the meat.  And when saucy is in the 4.5 star name, we expected a lot better than \"yuck!\"  We also sampled the carnitas bacos.  We agreed we'd eat them again but they weren't enough to make us want to return to Saucy Porka.", "pics": null}}, {"review": {"des": "Stopped by for lunch one day and loved the experience, perhaps even a little more than sister restaurant Spotted Monkey. I got the miso braised short rib rice bowl, which had an extremely generous serving of short ribs and rice. The miso flavors were subtle--more subtle than that of Spotted Monkey-- but all the more delicious because of that, and the ribs were extremely tender. My one (very slight) issue would be the cook of the rice--I didn't taste the coconut flavors as stated on the menu, and the rice was a little overcooked to the point of being a large white blob. <br><br>Despite this, I loved the meal and would definitely be back again, especially to try the adzuki beignets.  Being sister restaurants, Saucy Porka and Spotted Monkey have rather similar menus, and overall I'd prefer the rice bowls at Saucy Porka and the bacos at Spotted Monkey.", "pics": null}}, {"review": {"des": "The Saucy Porka Banh Mi sandwich was amazing! Pork was tender and flavorful on its own. The kimchi was not spicy but added even more flavor. The bread was fresh. <br><br>The mojito lemonade was delicious and refreshing, didn't even need alcohol!", "pics": null}}, {"review": {"des": "Lunch Review: Looking for a different yet tasty lunch experience. Definitely check out Saucy Porka.<br><br>The good: Amazing food, especially for lunch options. The rib was cooked very tenderly and sauced just right. Lots of different and fun options to choose from. The prices are average for lunch in downtown. Service was fast and friendly.<br><br>The bad: Not a whole lot of seating to choose from. If you blink, you might walk right past the restaurant, it's sort of hidden. No bigger tables. <br><br>Atmosphere: 8/10<br>Service: 9/10<br>Food: 9/10", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/hU7mfbkcfNXSFmaNdoGymQ/348s.jpg", "caption": "Miso pork rib rice bowl"}]}}, {"review": {"des": "The chorizo egg rolls are so. freaking. good. here! I legitimately did a happy dance when I saw that I got 2 for $3.50. Granted, it's probably not the healthiest option, but it was super tasty.<br><br>I also got the short rib bao taco--this was good but you'll need to get 3ish to feel like you had a full lunch.<br><br>Definitely try to order ahead and pick up-there's not a ton of waiting area inside.", "pics": null}}, {"review": {"des": "Visited on a recommendation and I was not disappointed. The staff was friendly and eager to offered suggestions for the first timer at this off the beaten path diner. I had the bao tacos-pork carnitas and Thai chicken curry -  both were outstanding.  Will definitely come back and would recommend to anyone looking for quality food with great taste.", "pics": null}}, {"review": {"des": "Absolutely delicious. Gets really busy around lunch time - the line's almost out the door! But that's how you know this place is good. Most people get takeout but I stayed to eat at their high-top tables. Service was good, food even better. Quick and easy spot that I'll definitely go back to again!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/pvOqrp-Z9UCjXlWo40Wwvw/348s.jpg", "caption": "The Saucy Porka with a side of Sweet Potato Fries"}]}}, {"review": {"des": "Great place to spot for lunch. They have different savory Asian fusion options that range from Western inspired bahn mi sandwiches, kimchi fries, and savory meats served in white soft Asian baos. <br><br>The Cubano was very well put together with a juicy, well marinated pork filling. My favorite part was picked onions that came with it: sweet and tangy without any of the normal spicy punch you get from eating raw onion. Instead you'll be crying tears of joy from this delicious combinations of flavors in your mouth. <br><br>The Spicy Porka was also delicious with kimchi and juicy pork. It's not very spicy at all so make sure to add lots of siracha if you like it hot! The kimchi was also very done, all leafy tender parts and none of the super thick base of the cabbage that it hard to eat. <br><br>Last thing to note, the staff here is super friendly and nice! I was exploring the city and doing the normal touristy walking things. Due to poor foresight, I was wearing new sandals and was starting to get blisters on my feet. The staff was kind", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/8gNhzq9GGO69d-Jp8St5lg/348s.jpg", "caption": "Spicy Porka and Cubano. Both delicious. Absolutely loved the picked onions that came with the Cubano!"}]}}, {"review": {"des": "I love this place, and hit it up once a week.  Asian paella with a fried egg is excellent.  Bacos are good too, but once you get a rice bowl you'll be hooked", "pics": null}}, {"review": {"des": "This is one of those places that makes you jealous of the people who work downtown and can actually go here for lunch.  My biggest gripe about this place is that it is closed for dinner and on weekends.  <br><br>This place has a great take on Asian fusion.  I love the bacos here - I've tried the pork, beef, shrimp and tofu.  I particularly like the pineapple salsa that they put on the pork and beef baco - the pork one is my favorite (and it's cheaper than the beef one).  The banh mi sandwiches are pretty decent too.  The surprising star of this restaurant is the chorizo egg roll, which is packed with flavor and goes very well with the avocado aioli.", "pics": null}}]}