{"name": "sawada-coffee-chicago", "reviews": [{"review": {"des": "All the times I've visited Green St Smoked Meats, I was never really in the mood for coffee, so I largely ignored Sawada for a while. I honestly didn't pay that part of the building that much attention because I walk in with brisket in mind. Then, all of a sudden, their military lattes were all over my IG feed. Maybe it's the latte art that draws the influencers/foodies or the fact that the matcha craze is still going strong... either way, it piqued my interest, so I eventually caved in. <br><br>I had the chance to try both the military latte and the black camo latte and actually preferred the latter. Not sure if it was the hype, but I found the military latte a bit underwhelming. Perhaps it was too delicate for my taste buds at the time..? The black camo on the other hand was bolder, nutty and a bit.. smoky? I prefer dark roast coffee so I liked this a lot more. Both drinks had the perfect amount of sweetness and expertly crafted. <br><br>If you come here to do work, it could take a while for spots to open up because there isn't much seating to begin with, but fret not, just bring your drinks down to GSSM and sit at any of the picnic tables (if it's not too busy).", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ufUQIFtMoPsEN6TMExAo5w/348s.jpg", "caption": "double camo latte (top)  military latte"}]}}, {"review": {"des": "Entrance is super hard to find, but it's worth the struggle! Use the black door to the left of the store windows. If you can make awkward eye contact with people sitting inside sipping their coffee, you've gone too far to the right.<br><br>Good coffee, beautiful latte art, creative flavors. Ambiance was also nice, with high ceilings and many lights. Very hipster feel to the cafe.<br><br>We came here one morning for pastries and coffee. We'd heard that Sawada had good coffees, but what blew me away was the INCREDIBLE latte art! I got the Military Latte (matcha latte with espresso) and my friend got the Black Camo Latte, which was pretty similar (espresso drink with burnt matcha). Hers tasted more like espresso, and mine had more matcha taste, but was still pretty bitter.<br><br>We also tried their croissant and their specialty Military doughnut (matcha, caramel, and espresso) which was very cakey and delicious.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/OgKvMH8qqGJ6vJ8-YBcVZQ/348s.jpg", "caption": "Interior"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/YbksJdJBQestqVeEdFPprQ/168s.jpg", "caption": "Military latte"}]}}, {"review": {"des": "Great location but the main entrance was super hard to find for us (first timers) and street parking is super limited. Super friendly baristas took their time to explain how each one of the signature lattes we ordered was made. We came here for breakfast. Got two lattes and a doughnut. All items were super tasty. The doughnut we got had pistachio icing (delicious). <br>Overall rating<br>Service 10/10<br>Coffee 9/10 <br>Coffee presentation 10/10<br>Food 10/10<br>Location 8/10", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/vmmZPOajpkeUXCvSXqQaLg/348s.jpg", "caption": "Military latte and black camo latte with pistachio donut."}]}}, {"review": {"des": "Such a cool and unique vibe. Honestly cannot say I've been to a coffee shop that comes close to matching the ambience of Sawada. It's got sort of a factory-skateboarder aesthetic going on.<br><br>The menu is very simple, but everything is delicious. I personally love the military latte. In general, the prices are a little high but very similar to the prices of coffee in the area (that's West Loop for ya).<br><br>Green Street Smoked Meats is just down the stairs and if you go even further down another set of stairs, you're in a ramen shop (I have yet to try either of these places though).<br><br>If you're trying to study, Sawada may not be the best place since there's limited seating and it can get pretty loud depending on the time you go (Green Street can get packed for lunch, so the volume level tends to increase around that time). That being said, I don't have a problem with tuning noise out and have studied here a few times.", "pics": null}}, {"review": {"des": "This place is sort of hard to find the first time, but definitely worth the circling around! Whenever I'm back in Chicago I have to make a stop here. The interior has like a run down factory look, high ceilings, exposed piping, and chipping paint, but that's been turned into a hipster coffee shop. I always get the military latte, which is matcha, milk, and coffee. I find that not a lot of coffee places are good at making matcha drinks, but this one is really well balanced with all the flavors coming through but not overpowering each other. It might be a bit sweet for someone who's not typically a sweet drink person, but for me it's perfect! <br><br>The ambiance of the cafe is really great for doing work or just hanging out. There's a place that sells bbq (I think?) inside so there's lots of long tables for people to eat, drink, or work.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/VbYoK6H-hgaMOIlsDMeYAg/348s.jpg", "caption": "Inside"}]}}, {"review": {"des": "I came here on a Friday afternoon on the recommendation of an Airbnb host who lived in the area. There was quite a bit of construction in the area at the time, and the coffeehouse looked pretty inconspicuous from the outside, especially with its graffiti door. However, I loved the atmosphere inside. All those fairy lights were so pretty! I didn't have that much time to spend before I had to catch a ride to the airport, but I decided to get my drink to stay anyway just so I could have it under those lights.<br><br>It wasn't too busy when I arrived, since it was the middle of the day on a weekday. There was plenty of seating available and no queue at the register. The employee manning the cash register was friendly and answered my questions about the various items on the menu. I ultimately went for the iced matcha latte as it was a pretty hot day. My latte came out pretty quickly and was really delicious. I do think it was sweetened, which is probably why it tasted as good as it did, but something to keep in mind if you don't like your drinks sweetened.<br><br>My drink was a bit expensive for what it was, but nothing out of the ordinary for a big city. Even though I had my drink to stay, they still served it in a plastic cup; I'm not sure if they have glassware for cold drinks ordered to stay. I would definitely come back if I'm ever in the area again; I'd love to try the pastries.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Ni5QB9gxA3a-Ugx53RglVQ/168s.jpg", "caption": "Inside"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/tfmwcOnuvZCbWHlbO3JkoA/168s.jpg", "caption": "Iced matcha latte"}]}}, {"review": {"des": "I lOVEEEE the ambiance of Sawada Coffee!! They share joint space with the bar in the middle, the smoky foods in the back... the \"secret\" ramen shop downstairs..<br><br>Pros:<br>-delicious beautiful pretty coffees<br>-large sizes<br>-secret menu of boozy coffees<br>-share joint space with a smoke shop and bar and ramen shop<br>-free WiFi <br><br>Cons:<br>-none!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/9uu9tUxLS-2S4jC3OJMtuQ/168s.jpg", "caption": "Black camo latte"}]}}, {"review": {"des": "Hipster coffee joint in the west loop. Not for studying but definitely worth it for the people watching ... hidden gem of a BBQ in the back", "pics": null}}, {"review": {"des": "Please come to Boston! <br><br>I visited Sawada over the summer and fell in love with it. The atmosphere, the friendly staff, and of course, the instagram worthy lattes. I got the military latte which was exactly what I'd hoped it would be. Definitely earthy (I mean it is matcha) with a nice caffeine boost. Beautiful presentation, these guys are truly artists.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/3mjxzzsw8o5IJ_as40wpYQ/348s.jpg", "caption": "Military latte"}]}}, {"review": {"des": "How do you feel about the concept of purchasing a highly caffeinated beverage that consists mostly of milk with a strong taste of the finest imported Japanese seaweed, and a double-shot of espresso swirled in the mix? For $6 - $8 dollars you can have yours, right here, in West Loop, Chicago.<br><br>What I described above is called the Military Latte. Trendy drink names, colors and combinations is what got me in the doors initially, but the \"hole in the wall,\" graffiti in the streets of Japan store front is what intrigued me most and really drew me into this unique cafe. As you enter the building through the black door there's a graffiti staircase and the coffee shop to the right. They have a small coffee shop like setting right by the order counter and a massive group space to the left where the building opens up into this vastly light warehouse space. <br><br>Line is generally long but it moves fast and there's so much to look at in the meantime. They sell matcha drinks, coffee drinks, donuts (from Donut Vault) and pastries at the initial cafe counter. I'm not sure what food and beverage they offer at the bar in the larger space to the left. They do sell their matcha powder and in house espressos they use there, from what I understand. They also have stickers for free at the ordering counter! <br><br>I definitely understand the hype of this place because of it's distinct decor choices, brand name features, creative lighting, and one-of-a-kind drink choices. However, it's simply not up my alley. I'd rather spend a little less for something less hypey and more quality. From a cultural aspect too, it really didn't hit home with me, but for many it may so I definitely suggest checking it out if experience and unique culture is what you're after! There is wifi and some plug in options it looked like, however I have no idea about parking as I walked there and saw no lot close by. Great for instagram pics, and the donuts looked super yummy!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/sXVCjNdH_AkAojohvJAllA/348s.jpg", "caption": "Back of house seating"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/byHwU3txl2u1TPs90Jsdqw/168s.jpg", "caption": "Espresso deck"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/CPhWHMwXs6SA8DVbV6DEGg/168s.jpg", "caption": "Matcha"}]}}, {"review": {"des": "A cute spot with great coffee! And doughnuts! I love the vibe at this place and how spacious it is. I went in with the intention of grabbing some coffee and getting a lot of work done. The atmosphere allowed me to do just that! There's outdoor seating as well which is great for the warm months.", "pics": null}}, {"review": {"des": "GREAT chai tea lattes! <br>It appears that this place can get very busy and will get loud with music playing. Not a place for studying or intimate conversation but very cool decor and delicious drink options!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/esHFmW6-WLjrZKw_-1A_Tw/348s.jpg", "caption": "Chai tea latte"}]}}, {"review": {"des": "part of the au cheval group of restaurants in west loop of chicago.  Cool spot for coffee and delicious it is.  while waiting for our table for au cheval, we walked a few blocks over to sawada coffee.  got a military latte, which is matcha latte with shot of espresso.  it is delicious and smooth with that extra caffeine kick.  ambiance is nice and perfect to sit all day in. <br>great pastries and doughnuts on display.", "pics": null}}, {"review": {"des": "Love the atmosphere at Sawada Coffee, it is small but the line does move fairly quickly. Being inside the same building as green street meats gives it plenty of seating, especially if you come early in the morning! The high five mocha was delicious! Can't wait to come back!", "pics": null}}, {"review": {"des": "Military coffee is good. The pastries are fresh.  Like the donut.<br><br>The regular coffee is fairly ordinary.  The place get busy mid morning", "pics": null}}, {"review": {"des": "You know you're in for an experience when you walk into a building covered with graphics and graffiti! This noteworthy neighbor to Green Street Meats gives off a scrappy, edgy, yet laid-back vibe. Only at Sawada Coffee can you sit on bleachers, surrounded by walls of peeling paint, and under a canopy of incandescent stars. They are known for their, \"Military Latte\" which makes you feel like you are drinking liquid art. Now, I'm not a matcha super fan, but as my lips touched the intricate, steamed milk leaf, the subtle, yet earthy matcha flavor graced and satisfied my tastebuds.<br><br>The experience this truly unique coffee shop offers, is one you will not soon regret nor forget!", "pics": null}}, {"review": {"des": "Roasted: I've been here before and had to make a return visit. Love this coffee shop in the west loop area. It shares a space with a bar which allows it to have a ton of seating. The bench seating in the bar area is ample and comfortable and feels kind of like a German bar. The barista was friendly and answered the questions I asked. They offered our lattes for here which is always a nice touch. Lattes had beautiful latte art and tasted great. My favorite part here is the ambiance - lots of open seating, lively music, great lighting and overall comfortable vibe. Check this place out for sure if you want a great latte and good service. <br><br>Unroasted:  love the industrial look of the coffee shop.   This place feels cozy even with all the brick and metal.   The barista was really fri badly and answers our questions.    I must note this place is also a restaurant and bar.  The smell of bbq in the back is amazing!    The coffee was so beautiful and tasted great coming from the bad coffee in Iceland.      Sugar added to my latte", "pics": null}}, {"review": {"des": "Pretty cool coffee shop in the West Loop area! There are a lot of people that walk in for their coffee and just walk out. I actually worked from there for a few hours so I got my coffee to enjoy there along with a chocolate old fashioned donut (from Doughnut Vault). Their popular drink is the \"military latte\" which is a latte with matcha and chocolate syrup.... its pretty tasty if you like matcha otherwise steer away from it. The place is huge since they share it with a BBQ joint next door so you can actually have lunch there or a drink while you work from there :D<br><br>Oh and their cold brew jasmine tea is phenomenal as well!! So refreshing!", "pics": null}}, {"review": {"des": "LOVE THIS PLACE! (I originally went to the other location--thinking I was coming to this one). <br>Love the lattes here and it was a very cool vibe. Love that this place has so much space (actually the Green Street Smoked Meats section). <br><br>The donuts and pastries are yummy! They have donuts from Donut Vault! <br><br>The internet speed was surprisingly fast for a public place!", "pics": null}}, {"review": {"des": "Love the vibe and the drinks were great too. I love that they make all of their nut milks and have some very unique ones as well. Deliciously crafted coffees and teas.  Fantastic service. Great neighborhood and vibe. Can't go wrong with Sawada!", "pics": null}}, {"review": {"des": "Honestly my favorite coffee spot in Chicago. I love it too, because after coffee or reading a book, or working on my laptop, there's the yummiest smoked meats from Green Street Smoked Meats which shares the space (I believe it is the same biz owner actually). <br><br>Great place to come alone, on a date, with friends, or even a small biz meeting.", "pics": null}}, {"review": {"des": "Two years later and I'm finally, finally, finally writing a review for my beloved Sawada Coffee. Especially now that they've opened a second sister location, Sawada Matcha. On the most recent of my visits, I arrived shortly after they opened at 8 a.m., stored my belongings at a window seat overlooking Green Street, and ordered a military latte and a matcha, espresso, caramel old-fashioned doughnut from another favorite, Doughnut Vault. <br><br>Sawada Coffee can be difficult to find on your first visit: A black door covered in graffiti next to a Divvy bike station on Green Street is what you're looking for. Otherwise, if Green Street Meats is open, enter through this sister business and walk up to the coffee bar. <br><br>On lazy Sunday mornings, one can find a spot to sit and sip your coffee drink, but usually, Sawada is bustling with people and activity. I'd compare it to an indoor coffee cart at this point. Get in line, wait for your name to be called and head to your next destination. The latte art in your to-go cup is just as exceptional as it is when you sit in. <br><br>As for the doughnuts, if you're short on time or don't want to brave the lines near Merchandise Mart, Sawada sells a variety of Doughnut Vault donuts, including the matcha, espresso, caramel doughnut. Sweeter than I prefer due to the caramel, but if you like caramel, then this donut is for you. The matcha and espresso seem to offer more color than flavor. <br><br>The lattes range from the military latte, in all of its matcha-espresso shot goodness, to the black camo, which can be sickly sweet if ordered. Reminds me of black sesame oatmeal on a sugar-high. <br><br>Overall, Sawada remains on my list of recommendations for friends in Seattle visiting Chicago. You simply cannot go wrong. Especially if you live in Seattle and don't like coffee. Sawada may change that. The Starbucks baristas already know we've been ordering matcha lattes with espresso shots for a good reason. ;)", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/SR47L5WTYH27zhjAjiJdsw/348s.jpg", "caption": "Perfect pairing: Military latte and matcha espresso caramel old-fashioned donut"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/MK8-KxAnwI-vTuf4c1BWnw/168s.jpg", "caption": "Military latte"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/tfxgiteLuhwtqaQMNoG7FA/168s.jpg", "caption": "Let's talk about Matcha Espresso Caramel OF donuts."}]}}, {"review": {"des": "Service: 5/5<br>Drink : 4/5<br>Ambience: 5/5<br>Price point: 4/5<br><br>Black camo latte - roasted matcha with two shots of espresso, has a nutty, chocolatey, earthy profile<br>Military latte - traditional matcha powder with two shots of espresso <br><br>Tried them both iced, black camo tasted better than its counterpart.<br><br>Tried the high five mocha, hot - zesty orange notes with light chocolate flavor. Don't get it if you are looking for rich chocolate flavor.<br><br>Unique ambience, definitely dig the vibe - warm yellow light that leaks from the green street meats area while it's set next to dark wood high roof windows. Definitely a great place to be on a rainy day. Unfortunately not much seating space or space for that matter, you'll probably feel some butts graze on your back if you sit by the window.", "pics": null}}, {"review": {"des": "Beautiful interior and not nearly as crowded as expected! The military latte is a must-try. I think it would taste better iced, but the latte art is just too pretty to pass up.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/RsYiODkbJtM-o7jFpO7bHA/348s.jpg", "caption": "Military latte"}]}}, {"review": {"des": "Yay! I finally made it here after having it bookmarked for months. The place wasn't that hard to find using Google Maps. More people should look into it. <br><br>Ambiance: The place was pretty with the string lights and community benches. It was a big place but I thought it was bigger. Nonetheless there was a lot of seating. They had coffee and tea options, pastries, and the lower floor had sandwiches amongst other things. <br><br>Service: The guy at the counter was helpful in explaining the military latte. He was also patient with my mom about the touch screen payment thing. The barista also pointed out the latte art is settled in and won't move when I walk, haha. Minimal service and yet still better than some restaurants! <br><br>Drinks: We ordered the Military Latte, Cold Brew Jasmine Tea, and Strong Drip. My brothers liked their drinks. I had the Military Latte. $6 is a bit steep but the matcha flavor was rich and creamy. The espresso wasn't too strong. I loved it! The latte art was also pretty. The barista made it look so easy! <br><br>Would come back for another latte and a donut front the Vault.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/2yF00ydkdqMj4XqrTA5Ltw/168s.jpg", "caption": "Military Latte - look how the colors blend!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Zx8MnrQ2_28SRODoF79MIA/168s.jpg", "caption": "mmmmm"}]}}, {"review": {"des": "love their coffee! especially their military latte. it is so bomb. you can definitely taste the matcha, and it doesn't taste artificial whatsoever.  location is super nice, and its crowded, but there is a ton of seating. i would highly recommend getting their drinks.<br><br>doughnuts, not so sure. its good! but dense and not the fluffy type. more of a muffin texture.<br><br>again, highly recommend their drinks!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/NEPFXBYWDF1e2t8n9HKnUw/168s.jpg", "caption": "matcha doughnut and military latte"}]}}, {"review": {"des": "I got the chai latte. It's delicious and the latte art is nicely done. The cute barista with the hair bun is a plus.", "pics": null}}, {"review": {"des": "This was my first time here and my experience did not disappoint. The man working at the counter was super nice and I told him to surprise me and order me something I should try since I was a first timer. He ordered me a matcha latte. When I asked what it would taste like he said along the lines of vanilla ice cream... and he was not wrong! This drink was delicious and visually appealing. The atmosphere here was really unique and you can be sure I will be back!", "pics": null}}, {"review": {"des": "Hmmm nearly 400 reviews. What can I possibly say that hasn't been said before? <br><br>Great place. Great coffee. Great donuts. Seriously I know they only bring them in from donut vault but man they're so good. It's cool how they display them on repurposed skateboards. The baristas are really friendly too. They take a real interest in your life and don't see it as a chore to have a conversation with you. <br>The wifi is pretty fast but this isn't a great working spot. The sense of hustle and bustle and being combined with a restaurant meant that the atmosphere is all wrong to type out your next essay. However it is great to just hangout at! The lights are beautiful and if they're ever full you can always go sit at the other restuarant seating area.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Pb8UpcIWHBFoOFC3qvsWmQ/348s.jpg", "caption": "Boozy chai steamer and latte"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Fj2pkL5P_Vut3DLyoRgDOA/168s.jpg", "caption": "Donut and latte"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/tLRIdt5wXfU3M4dxzbRrfQ/168s.jpg", "caption": "Beautiful interior"}]}}, {"review": {"des": "Followed this place on instagram for a while anticipating a visit when I finally got to Chicago (from Ontario). Small little place, not too much seating but wow. Seriously worth the wait. The service was so great, drinks were made quickly, pricing was okay and it was hands down the best and most smooth matcha latte I've ever had. Definitely recommend taking a trip to this little place.", "pics": null}}, {"review": {"des": "Came here this morning and had a pleasant experience. I love matcha and this place had a great assortment of matcha drinks. <br><br>The ambience is super great and there is tons of seating! The donuts also looked really great but I didn't get one, sadly. <br><br>I would definitely recommend this place if you're in the area!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/5gV9IqkI5v7n34DCoj70Lg/348s.jpg", "caption": "Plentiful seating"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/LUc8F_Ye98dqmuYENhTg1Q/168s.jpg", "caption": "Menu"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Eq5mkEy1y2KykX5wooevIw/168s.jpg", "caption": "Yummy assortment of donuts"}]}}, {"review": {"des": "This place is combined with a bar and other restaurants. <br><br>What I ordered: Iced Matcha Latte<br><br>Taste: Latte was pretty good. Its the same flavor as their other shop which is more focused on matcha | called Matcha Sawada | <br><br>Ambiance: lots of string lights, but it can get dark in there. Really cool vibe!", "pics": null}}, {"review": {"des": "*** Workspace ***<br>Not recommended. The cafe area itself is small and often crowded, so I don't go here for reliable work or study spot on the weekends.<br><br>*** Coffee ***<br>Delicious and such elegant execution on green tea lattes. Def a unique addition to any coffee snob's drink list.<br><br>*** Rant ***<br>Not your average watered down green tea latte. The matcha flavor is bold and complemented well with notes from the milk, spices and espresso. I love the creative variations on green tea latte and the donut vault guest stars. My only qualm is the high-5 mocha which was interesting but not in a delicious way. Just be careful of the strong kick on the first sip. Might just be a preference thing though.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/rfsYQnvzvsYuqP02ikdQIQ/348s.jpg", "caption": "Military Green Latte and High-Five Mocha. Perfect to sip while people watching through the bay window."}]}}, {"review": {"des": "I'm not much of a coffee drinker, but my husband is and he wanted to check this place out. This location has a very unique interior. There were string lights all across the ceiling and large picnic style benches.<br><br>I ordered a regular latte, which I really enjoyed. When I visit Chicago again I will definitely stop by here and try the Military Latte.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/DlbV3m1ixUl0qdqdsB4KPg/348s.jpg", "caption": "Latte!"}]}}, {"review": {"des": "I decided to check out this place during my vacation after getting a recommendation from a friend. I expected a regular coffee shop, but it's a great spot that's shared with (if I remember correctly) a ramen spot and a BBQ joint.<br><br>My friend told me to get the military latte - matcha + espresso + milk. At first, I was definitely skeptical. The fact that it was literally the most expensive cup of coffee I've ever paid for set high expectations though.<br><br>After my first sip, my taste buds were a little confused, but I was craving more in no time. The military latte is so addicting!! I ended up coming back later in the day for another cup - yes, it's THAT good!!", "pics": null}}, {"review": {"des": "The Best coffee I've had in Chicago, made by the Master Ryan. Watching this man pour with calm and focus is samurai like. He's a great guy and friend also!<br><br>I believe I had the Military Latte smooth and packed with nice flavor till the end. Soo Beautifully decorated that I didn't want to drink it.<br><br>The atmosphere is loud because it's connected to the BBQ and Ramen restaurants. Despite that you can still enjoy your cup and donuts.<br><br>Now go in and have a cup made by Ryan and say Marcos sent ya!", "pics": null}}, {"review": {"des": "Luckily I've seen this place all over Instagram or I would have had NO idea what to order. The menu doesn't give much explanation and hearing the baristas call out the made drinks I heard things that I didn't even know I could order. <br><br>I opted for the military latte which seemed to be one of the most talked about drinks and I liked it but I wouldn't rush back for it. It was good for matcha, but not necessarily what I'm looking for when I'm spending 7 dollars on a coffee drink. <br><br>Great spot to spend time working, or when you're looking for somewhere to hang out for a little. Doughnut vault donuts are a plus!", "pics": null}}, {"review": {"des": "Sawada is super cool. It shares space with Green Street Smoked Meats and High Five Ramen. You can get a Military Latte and some noms from Green Street and sit at a communal picnic table and do your thing. The atmosphere is lively and crowded which works for folks who like to pound-out work/school projects on their laptops like that.<br><br>I've gotten a lovely chocolate croissant from Sawada (nice and flakey), a matcha latte, a military latte and jasmine cold brew. They were all really delicious. I surprisingly still get cravings for the smooth intensity of the jasmine cold brew!<br><br>My biggest complaint about Sawada is that they don't have milk substitutions. If you don't like or can't have cows' milk then that sucks for you. You have to pass on their lattes.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/JZaCl-3oLwDAvhPKojigNA/168s.jpg", "caption": "Military Latte to go with macadamia nut milk and a Cold Brew Jasmine Tea"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/RZhwaDGfERkr1KpE62qL2Q/168s.jpg", "caption": "Chocolate Croissant and Green Tea (matcha) Latte and Cold Brew Jasmine Tea"}]}}, {"review": {"des": "I think I found my new favorite matcha latte in the city! I went in around 2pm and it was semi-busy. There were seats at the big table with the outlets which was nice since my phone needed a charge. <br><br>The whole time I was there someone was always in line and people were coming in and out. I had went in through the Green Street Meats side and after I saw people coming in through another door, I realized the entrance to the coffee shop was on another side. It was heavily graffitied so I would have missed it if I was walking that way. I could still see the name of the coffee shop, but from a far I would assume it was a graffiti wall.<br><br>I think it's cool to have so many businesses in one place. There's Sawada Coffee on a sort of high-rised part on the side and Green Street Meats sharing the space. You don't get in trouble if you sit down by the Green Street Meats side, too which is nice because the coffee part doesn't have the biggest seating area. You could get a cup of coffee and enjoy some bbq (which smells very good). Then if you were feeling ramen, there's a door to the basement where High Five Ramen is. You can basically get coffee and a donut for breakfast then go to Green Street Meats for lunch and then wait until High Five Ramen opened and get dinner there.<br><br>If you like a coffee shop with some hustle and bustle with some rustic decor then you should come here. OR if you are a matcha fan definitely go here. I'd come back just for the matcha. In fact, I wish I had bought one to go.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/SD9BdIbsjOKbEsniFGnkzg/348s.jpg", "caption": "Boozy steamers"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/75Mue3zi1lm94HaG1Sf95g/168s.jpg", "caption": "WiFi password"}]}}, {"review": {"des": "This is a nice small coffee shop tucked into Green Street Smoked Meats. My wife has been wanting to bring me here for the longest, but their hours are 8a-5p, which aren't friendly with my work schedule as I work similar hours. Anyways, I finally got to try it and I went with the Iced Matcha Latte and my wife went with the Hot Military Latte. The Iced Matcha Latte is not too sweet, which is perfect for me. Pretty standard compared to some of the better ones I have tried. The Military Latte was actually my favorite. It is Matcha Latte with a shot of expresso to really bring out that coffee flavor. It wasn't too busy when I went, but I will see myself coming back here if I am around the area.", "pics": null}}, {"review": {"des": "Loved loved loved Sawada Coffee! You walk in through a graffiti ridden door and the whole space is very industrial chic with a super chill vibe. I would love to come back here to get some work done during the day. Plus it shares space with Green Street Meats so you can have your coffee, work all morning, then grab lunch ~ making it an ideal all day working joint.<br><br>I met some friends up to catch up over drinks and had a lovely time. Drinks were made quickly and tasted fantastic. I had the local favorite Military Latte ($5.75) which not only impresses with adorable coffee art designs but is also great tasting. The only negative is they only have 2% milk! I also tried my friend's straight green tea latte and it was also delicious.<br><br>I didn't go until Noon so they were out of the elusive matching camouflage donut. I did snag the last matcha brownie though ($4). The brownie was huge, a bit dense, definite matcha flavor to it with chocolate chips to boot. I liked it but didn't love the flavor in it.<br><br>I will absolutely be back to try more drinks from Sawada. They carry Donut Vault donuts on the regular so you're sure to get some sugary carb goodness while there, as well! Loved the vibe and the music, making it an ideal spot for me to remotely work.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/e_Pgzvp-WV142_XR5jptiw/348s.jpg", "caption": "Military latte"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/bOuIfsplo_mynNVeqcKRMw/168s.jpg", "caption": "Military latte"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/6TjV-cgeEXor4heGBl7RUg/168s.jpg", "caption": "Military latte and matcha brownie"}]}}, {"review": {"des": "While Sawada Coffee has a stellar rep, it is hard to miss physically if you are not looking for it. The entrance is slightly obscure and tucked into the walls outside. However, once you step inside, you are transported into a rustic, if not slightly hipster, coffee shop. The large interior space is shared with Green Street Meats. It is decorated with lights strung all over the ceiling and large wooden benches, giving off a cool vibe. <br><br>I had heard good things about the green tea latte from a friend, but decided to go for the military latte as it is a unique option not offered anywhere else I've been to. Upon receiving my latte, I was extremely pleased with how my latte looked. It was a beautiful shade of green with a nice latte design that had some brown embellishments from the espresso and cocoa powder. Hiroshi Sawada definitely lives up to the title of world latte art champ! Not only did my latte look amazing, but it tasted great as well. I was delighted to taste the strong, earthy matcha flavor that paired well with slightly bitter espresso. I was also able to get a taste of my friend's green tea latte and was astounded by the flavor as well. It was slightly sweet, but carried the soothing earthy matcha flavor. Definitely one of the best green tea lattes I've ever had!<br><br>As a whole, Sawada Coffee is an awesome place to grab a coffee and hang with friends. It is loud and there are few outlets. So, if you want to study here, I would recommend charging all of your electronics and bringing a good pair of noise cancelling headphones!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/PCX7Froa8Z5uaNEdSriogQ/168s.jpg", "caption": "Top to bottom: Military Latte and green tea latte"}]}}, {"review": {"des": "I have been in this neighborhood umpteenth times and I can't believe this was my first visit to Sawada! It's tucked inside Green Street Smoked Meats, so it was interesting drinking coffee/matcha in a place that smelled so meaty & smoky. <br><br>I am a huge matcha fan but also love espresso. One of my favorite drinks is a dirty matcha latte (or what I'm calling a dirty matcha - basically matcha with espresso shots). Sawada takes the coffee & tea combination to the next level! <br><br>*Matcha Latte: I know I went for the boring choice even though I was tempted by the Military Latte (matcha, espresso, cocoa powder and white chocolate). But, wow - this matcha was another level. It was so creamy and smooth it was like Matcha ice cream. <br>*High Five Mocha: it's a mocha with some kind of peppercorn! The peppercorn was a beautiful yellow-y hue against the rich chocolate. So unique, but still tasty and clearly very inspired <br><br>I can't wait to come back and try the rest! <br><br>168/365", "pics": null}}, {"review": {"des": "Sawada is probably not a coffee shop you will notice from the street. I discovered this gem after dining at Green Street Meats and Hi Five Ramen, as they were all in the same building. <br><br>In general, their drinks are tastefully sweetened, I was able to enjoy my drink ordered at their normal level of sweetness. Their espresso drinks cost around $5, expensive but in reality it's typical pricing nowadays. <br><br>Hi Five Mocha - the name doesn't tell you, but it's actually an orange chocolate mocha. I was able to taste the orange distinctly. <br><br>Military latte - a little afraid it was all Instagram gimmicks, I was pleasantly surprised how much I liked it. The earthiness of the matcha really shines through, very tastefully blended drink.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/9zHcRb81qHj37cXXKZQatQ/168s.jpg", "caption": "Hi Five Mocha"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/-G8EAgSPFFYzUvn6eSB_OQ/168s.jpg", "caption": "Military latte"}]}}, {"review": {"des": "This is my favorite coffee shop in Chicago.<br><br>Two words: boozy steamers.<br><br>Today, I got the spicy bourbon hot cider. It was delicious! They don't skimp out on the booze either, very strong. But, that cider...oh man, sooo good. The alchy in me is giving this place a standing ovation.<br><br>My friend got the black camo latte, which is a roasted matcha latte. Now, I hate matcha, with a passion. Okay, we'll take it down a notch, not with a passion, but I fairly hate it. Not something I would get ever, maybe if there's no drink left on Earth, then I'll drink that. So, in that context, I loved this black camo latte. It was amazing. It was sweet (without being overly sweet) and no bitterness (which is the part of the matcha I don't like).<br><br>Plus, this place is awesome, it shares a space with the Green Street Smoked Meats. The coffee shop is the top front end of the space that faces Green Street. The back is GSSM down some steps. Then, the basement is High Five Ramen (which is my second favorite ramen place).<br><br>Great ambiance! They have string lights with vintage Edison bulbs indoors. Love love love!", "pics": null}}, {"review": {"des": "This place left me speechless. It was love at first sight. As I entered in, I was in awe with the ambiance and the vintage vibe it gave me. The space is shared with Green Street Smoked Meats so there is a lot of seating and without the awesome lights, this place would have been dull. I ordered the military coffee which had the most beautiful design that I have ever seen.  The military coffee has the Japanese matcha green tea with vanilla syrup, espresso, and cocoa powder. It was definitely velvety and smooth but for me personally, it was a little bitter since it is an acquired taste. The coffee section is limited but they also have a selection of \"boozy steamers\" which are coffee spiked with liqueur. Will definitely have to try that next time along with one of the donuts from the doughnut vault. <br><br>Sawada is definitely one of the hidden gems of Chicago- highly recommend to check it out!!", "pics": null}}, {"review": {"des": "I stopped by this coffeehouse to get some work done before my next appointment. <br>THIS PLACE IS SUPER COOL<br>The vibe is super cozy and welcoming. Its trendy. Has ping pong table (but was being used as a workstation), pinball machine, and a punching bag. <br><br>I tried the military matcha latte with macadamia milk substituted as I am lactose intolerant. This drink is matcha with 2 shots espresso, vanilla, and some topping on top. Very tasty and great caffeine kick!", "pics": null}}, {"review": {"des": "The military latte and black camo latte are both fantastic if you like matcha and latte.  Unique drinks to Sawada and great hot or iced.  <br><br>They will do the lattes decaf if you ask for the espresso component, but keep in mind the green matcha or roasted matcha used in the speciality drinks also have caffeine in them.<br><br>Can get crowded, but the line moves fast.", "pics": null}}, {"review": {"des": "One of my favorite coffee shops in the city! Amazing lattes. Their military latte (espresso, cocoa and matcha) and their black camo latte (expresso and green tea) are to die for! They also serve \"boozy steamers\" which as the name implies, hot alcoholic drinks. <br><br>Food ranges from croissants, matcha brownies, and the famous old fashioned donuts from DonutVault. Baristas are very friendly and the decor/vibe is super hipster-y with wooden benches, unpainted columns and string lights.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/alq5eO40wdRTCIaxzgiH2A/168s.jpg", "caption": "Black camo latte ($6)"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Vqpx4kcbQAW6HNKypAja3w/168s.jpg", "caption": "Military latte ($6) and matcha brownie ($4)"}]}}, {"review": {"des": "Mmmmm. Military latte is tasty. Will definitely return. The west loop is filled with gems. Sometimes you just need to feel fancy. They even have a pinball machine. Nobody is using it at the moment. Probably not the first thing you think to do while having coffee, but still very cool. Also, there's pretty loud music. Not a quiet place. But why not. I ain't here to study. I'm here on my day off yelping.", "pics": null}}, {"review": {"des": "I've seen people Instagram-ing the military latte from this place and I knew I needed to come here. <br>My overall first time experience was really great. While there was a line, it went by rather quickly. The two guys behind the coffee bar were really nice which made for an even better experience. I had the military latte and a donut and both met expectations.<br><br>The space itself is large and really cool if you wanna grab some coffee and do some work. I think there's a bar that serves alcohol in the center of the space which is pretty cool. <br><br>I'd definitely recommend this place for trendy coffee and atmosphere.", "pics": null}}, {"review": {"des": "I'm still thinking about my Black camo matcha espresso from this place.  Definitely one of the best I've had. This will be hard to beat. <br><br>Have not had anything like it before and it was a perfect mix of my two favorite pick me ups.<br><br>A friend brought me here while on a trip to Chicago.  Otherwise, I may have missed the entrance to this coffee joint.  The line was long, but service was quick.  <br><br>There's a BBQ joint connected to the coffee place with plenty of seating to hangout.<br><br>BTW..The BBQ is a must too!", "pics": null}}, {"review": {"des": "Great coffee, great vibe, great staff!<br><br>I arrived to a long line, but learned quickly not to fret.  The line moved super fast.  Employees were both polite and efficient.  No complaints!<br><br>My cold brew was delicious - very strong and very bold.  I loved it.  <br><br>Perfect walking distance from strong restaurants like Au Cheval, Little Goat, and Girl & the Goat.  I was trying to get to Au Cheval at opening and got there way too early, so this was a convenient place to drop by and get coffee before walking over to my nearby destination.<br><br>A definite recommend!", "pics": null}}, {"review": {"des": "Almost missed this location because the exterior is painted super black but once we found it, we appreciated how cool it looked. The inside is kind of like a warehouse, has a sitting staircase and cafeteria-like tables for people to sit in groups or pull out their laptops and study. Plus free WiFi and what looked like a pretty cool pinball machine.<br><br>Great service, friendly guy at counter was helpful in talking to us with recommendations since it was our first time here. The prices of their drinks are STEEP but you're really paying for the cool coffee shop vibes. Their black camo coffee got just the right amount of bitterness to make it drinkable all throughout, and their green tea latte is better than Starbucks. Didn't try their donuts but they looked really pretty. <br><br>Would return next time I'm in Chicago. =)", "pics": null}}, {"review": {"des": "I love hipster cafes and Sawada Coffee is high up on my list of great coffee shops. This place is hidden inside the Green Street Meats building so don't miss it the next time you're out for some BBQ.<br><br>You cannot visit Sawada without getting the military latte. This is a matcha espresso latte that is to-die-for. Sawada blends these 2 flavors perfectly. It's the best of both worlds in tea and coffee. I wish I lived closer to Sawada Coffee so I could get this every morning. It warms my soul.<br><br>Sawada Coffee also keeps a stock of Doughnut Vault donuts as well! (A local Chicago donut shop in river north area)", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/dOu20aHiDtOSoDj--uqilw/168s.jpg", "caption": "2 Military lattes and a old fashioned donut"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/pANJiwECyxLz4xk6owFAbg/168s.jpg", "caption": "Old fashioned with green tea glaze"}]}}, {"review": {"des": "Military latte and the donuts are amazing!!!!!! The ambiance is wonderful, and the baristas are so nice and knowledgeable! I believe this place has a partnership with Doughnut Vault - and gets donuts from them. Doughnut Vault is closed on Sundays but Sawada is not so get your fix here!! Great place to get your latte free-pour art and some relaxing in! I'll be back - great hidden gem in the West Loop!", "pics": null}}, {"review": {"des": "I got problems. Biiiiiig problems. Like not enough stars in the sky for Sawada! <br><br>Put a pinball machine in a graffitied-industrial-looking specialty coffee place, (sharing space with smoked meat paradise, did I mention?) then mix in some matcha for that military latte and watch me go. <br><br>Add the day or so after Cubs game seven (those days were actually one looong and beautiful day) last November and it takes me a year and many more visits to write the review since I'm quite-headily-buzzed from that good Sawada energy.  Wooo! Calm the hell down. <br><br>The high-windowed space by the counter fills up quickly with both people at laptops, as well as friends visiting but the overflow is handled alright by the Green Street Smoked Meats space. I was here the day Prince died and on that day, I sat out back, alone at a big patio picnic table, feeling all Purple Rain. Even sad memories are savored here, that's Sawada to me. <br><br>Tips: -street parking tricky - not a late-night coffee spot unfortunately, - pastries/donuts sold here, - boozy options available.", "pics": null}}, {"review": {"des": "I'm a fan of Sawada Coffee. From the atmosphere to the drinks, everything is on point. Upon entering the coffee shop, I was amazed at the decor and ambiance. The coffee shop had cute lights strung up and lots of benches to sit at (the benches are shared with another restaurant/bar in the building). The set up gave off a very hipster vibe. <br><br>I ordered the military latte which consisted of matcha and expresso. The military latte was unique and different from all the lattes I had ever had before. It had an expresso kick that woke me up and a soothing matcha flavor. I'd highly recommend this drink! <br><br>Swada is a great, casual place to meet up with friends or to do work at.", "pics": null}}, {"review": {"des": "Sawada is my favorite place to get coffee in Chicago. Seriously the best dirty chai I've had in the city (maybe ever). Bummed they were out of donuts today, but they're so good it's amazing they ever have any at all. They brew some seriously strong coffee and the atmosphere and environment is awesome! Plus the food they offer in the lower level is seriously good, especially the bbq.", "pics": null}}, {"review": {"des": "I went there because my friend recommended it to me. The environment is really good, but the entrance of the place is hard to find though.", "pics": null}}, {"review": {"des": "Loving the ambiance. I came here with one thing in mind: military latte! <br><br>Price is kind of steep but I like that the menu is simple enough.<br><br>The coffee flavor in the military latte wasn't super strong, which makes me think if their coffee is strong enough. Regardless, I liked the matcha flavor!<br><br>Pro-tip: lots of outlets for you to come and get work done.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/UNLRrPJ9HGOPv2YFxaXNJA/168s.jpg", "caption": "Military latte"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/FctPGtoARUimbM1k_1rAkw/168s.jpg", "caption": "Menu"}]}}, {"review": {"des": "I like the concept! Go in there to get a Matcha Latte and do some work. When you start getting hungry, go grab a Pastrami Sandwich (or something) from Green Streets. A few hours later, put your name down for High Five Ramen's two-hour wait while you continue to grind away (because odds are you're a workaholic) and then go get some ramen with your friends for dinner. Now that's a Saturday!<br><br>It gets a bit loud and not thattt spacious, but overall a great pace to work", "pics": null}}, {"review": {"des": "Visited this location for the monthly meeting of The Coffee Hour. It shares space with a BBQ joint and was very funky and fun. They had coffee, full service bar and some delicious smelling BBQ. I didn't try the food but if the smell is any indicator of the food then I suggest you give it a try. <br><br>I ordered a drink off the menu and it was wonderfully made. My one gripe is that the music was very loud but if you sat at an outside table it was better. <br><br>Overall a solid experience. Be warned though, it's in West loop and parking was horrible! If I could find parking, I'd go back and would recommend me you give it a try too.", "pics": null}}, {"review": {"des": "I came here a couple weeks ago while back in Chicago to grab some coffee and find a place to work for a few hours. The experience was a little strange because I just ordered a drip coffee. I realized I'd be staying so after the barista had placed my coffee in a paper cup, I asked for a mug, and was told there's usually a price difference. I offered to pay whatever it was but she said it was fine. But really?!?! Why would you charge for a ceramic cup? Just seemed strange to me. <br><br>Anyway the seating area is cozy and great for people watching. I managed to get some work done and enjoy my Doughnut Vault donut and coffee! A little pretentious but enjoyable still.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/MRaSyT2SRO__bRSL0vStaQ/348s.jpg", "caption": "Doughnut Vault donuts!!!"}]}}, {"review": {"des": "Was this worth coming once? yeah<br><br>Would I come back to pay $6.63 for another military latte. nah.<br><br>The latte itself was strong and not sweet. But there's simple syrup and sugar packets in the back which was good and needed. <br><br>Worth checking out for the instagram pics but I wouldn't really study/do work here since it's a little too hustle and bustle for me.", "pics": null}}, {"review": {"des": "You will probably pass this location up. It's a hidden gem. Great coffee. Great donuts. Great location. Plenty of seating. Great service. What more can you ask for ? I'm a sucker for donuts and they offer a great selection. Come early for a good selection.", "pics": null}}, {"review": {"des": "Looking for a hip trendy coffee shop perfect for studying, working, or hanging out? Head on over to Sawada! There is plenty of seating and space. <br><br>The Military Latte is OuT oF THiS WoRLd!!! I always love a good matcha latte. Sawada's Military latte is a beautiful harmony of matcha + espresso. It is creamy, roasty and not super sweet, which I appreciate. The matcha flavor shines through, with the espresso taking on a more subtle taste. Not sure how much caffeine is in this, but it was the perfect afternoon pick-me-up after a busy morning exploring the city. An extra bonus is that they serve donuts from Doughnut Vault - meaning I was able to hit two food items in one location on my weekend trip! The buttermilk donut compliments the latte well and is moist&dense. Sawada is divine!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/QN4hAVZHnGVQdUqWkdGi8g/348s.jpg", "caption": "Military Latte + Buttermilk Donut"}]}}, {"review": {"des": "Ok, what makes a good coffee place? Good coffee, comfortable seating, and WiFi, bonus if there are nearby outlets. <br><br>Well, this place struck out on all three (and the bonus). <br><br>The WiFi was down (I was told by others this happens frequently). The staff tried to reset it twice with no luck. At this time I had already ordered a coffee so I had that to finish that before I could leave to find somewhere else to work. <br><br>The coffee was meh, I couldn't tell the difference between a mocha and caramel latte. It must have come from a VERY dark roast as it was tough to drink, way too bold of a flavor. <br><br>The environment is a mix of a bar, coffee, and smokehouse. It's connected to Green Street Meats, so if you don't mind smelling like BBQ while drinking coffee and (semi) working, come here. <br><br>There are donuts here from Donut Vault but not the good kind. They only had lemon poppyseed and chocolate available, neither looked good. <br><br>While working on a picnic bench you realize there no outlets near you. Not very conducive to working. <br><br>Come lunchtime this place gets REALLY crowded due to Green St. Meats. <br><br>Overall this is a great place for lunch, NOT working", "pics": null}}, {"review": {"des": "I live a short walk away from Sawada so I probably go there about once a week. However, even before I lived in the neighborhood I frequented the coffee shop whenever I was in the area. The coffee is delicious, I usually get the green tea latte. They also have alcoholic coffee drinks-- perfect for snowy Chicago days. <br><br>Like just about any other coffee shop in the country, there are a ton of people working on their laptops. I have tried to work and study there but the noise and commotion is too much for me-- but there is plenty of space to work if you like that work atmosphere.", "pics": null}}, {"review": {"des": "Really interesting, and surprisingly good drinks! I've tried their signature Military Latte (matcha/espresso blend) and their Black Camo (roasted matcha/espresso blend); I have to admit I was pretty skeptical about this mixture at first but after trying both, I can't believe this place isn't more popular!<br><br>Their menu is limited to ten or so drink items--Military Latte, Chai Latte, Green Tea Latte...etc and the pricing is pretty hefty for their specialty drinks (~$6.50 after tax for Military Latte). I personally prefer Black Camo over Military Latte because the matcha in Black Camo tastes stronger/richer than the espresso (vice versa for Military Latte). Their latte art is really pretty and portions are reasonable. They also have a small selection of baked goods available to go with your coffee as well. <br><br>Would've given 5 stars just for the taste, but I didn't like a few things about the atmosphere. Sawada Coffee is linked to Green Street Meats so it does get really loud--it kind of loses the quiet, coffee shop feel, which I would've preferred personally. There's very limited seating as well so it's more favorable to get Sawada to go almost always.", "pics": null}}, {"review": {"des": "Among my friends I am \"the coffee person\" while the rest of them drink varying amounts of a drop of coffee with a gallon of milk. I have brought them to MANY coffee shops. But the Monday after I brought them to Sawada for the first time they stated \"I am never going back to a Keurig after having such great coffee\" or \"That was the most expensive coffee I've ever had, but worth it\". <br><br>I am a huge fan of Sawada and its atmosphere, the atmosphere is kind of a cross between a bar and a coffee shop (probably because it has both), dimly lit, wooden interior with nice not exactly coffee shop vibe calming music. I personally love the military latte, matcha and espresso -- the coming together of two of my favorite things! They have many non-dairy options as well, although I recommend if you can drink whole milk to get it with whole milk so you can get beautiful latte art... it's difficult to do latte art otherwise because the foam is too thin so it turns into modern art instead of a leaf. <br><br>The matcha is fairly good quality and the flavor is deep and thick with a bit of sweetness from the milk! Most of all I am glad Sawada has transformed my friends into coffee drinkers that care about their coffee, your matcha must have magical powers.", "pics": null}}, {"review": {"des": "Sawada. This is a name you should remember and try if you're ever in the meat packing district in search of a phenomenal latte. The customer service was the first thing we remarked on. Being that it was our first time here, we had several questions to ask. The two gentlemen (Jeff and Mark) behind the counter were so kind. Jeff explained everything to us and answered all of our questions. He took his time without rushing, despite the customer behind us. With that being said, the service was still quick and efficient. We especially loved the high quality of the ingredients and the latte art (obviously). The atmosphere was wonderful as well, with plenty of warm string lights and soothing music to chat to. <br><br>We ordered the camo latte, military latte and a matcha brownie. All three items were amazing.", "pics": null}}, {"review": {"des": "Not your typical coffee bar. Industrial, hipster, good music, busy, but not crowded, small menu, but not simple, one-of-a- kind selections. <br>A destination.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/vVmpAK8wzAsOLk7XRCCcxw/348s.jpg", "caption": "Iced Military Latte in my Yeti will keep me going all day. This place is legit!"}]}}, {"review": {"des": "After hearing such great things about this place, we decided to stop in and tried the chai latte, military latte, and black camo latte. The chai latte was good, but the matcha drinks are what really makes this place unique.<br><br>Our favorite was the black camo latte -- basically a military latte, except they use roasted matcha. It has a much deeper flavor compared to the military, which makes the taste that much stronger. Amazing.<br><br>The space is small so it's not a great area to work, but they do have stair seating that connects with Green Street Meats, which adds a curious twist.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/uvTvemBIamAPb8xG2NfxqQ/348s.jpg", "caption": "Black Camo Latte"}]}}, {"review": {"des": "Stopped by Sawada briefly with some friends while we were waiting for brunch at a nearby restaurant. From the moment you arrive at the door, you know that you're at an extremely hipster restaurant. You might not notice that there's even a coffee shop here if you weren't actively looking for it, and the entrance really fits more of a \"grunge\" vibe. <br><br>Once you're inside, though, you'll see be greeted by warm lighting from the string lights all along the ceiling, as well as a rustic interior and overall chill environment. There's a large table in the main part of the coffee shop where you'll find people working and hanging out. It seems like the shop is fairly popular and there's usually a not-insignificant line to order and get your coffee. The baristas are super friendly and helpful if it's your first time. <br><br>Unfortunately, just as our coffees/teas were ready we were called to head back to the brunch place as we were next in line. When we asked to have our drinks poured into to-go cups, the barista offered to just remake the drinks, which was definitely not necessary and we didn't take him up on, but it was a nice gesture nonetheless. <br><br>Even though my experience with Sawada was shorter than I'd like, it's definitely somewhere I'll visit again when I'm back in Chicago.", "pics": null}}, {"review": {"des": "First off, the door to the shop is small and covered in graffiti/stickers and I passed by it twice before I realized that was the entrance. <br><br>Stepping inside, you see strings of Edison bulbs strung out across the rafters. It really transports you to a magical place. Sawada coffee shares its space with Green Street Smoked Meats and boy the smells are TO DIE FOR. The hustle and bustle of this warehouse is not the perfect place for study/work but it definitely is a nice change of pace. Plenty of seats in mess hall style tables and benches but a rather lack of outlets (unless able to snag a seat in the smaller coffee shop area). I was able to study on my computer though for ~4 hr without needing to recharge before I left. <br><br>I ordered the military latte...literal heaven in a mug. Matcha latte topped with a shot of cocoa + espresso. Hands down one of my favorite lattes ever. It was the perfect blend of earthy, creamy, frothy without any bitterness. I want to move into Sawada coffee just so I can have a military latte everyday. The donuts from Donut Vault looked sooo good, but the military latte put me out ~$7 alone, I couldn't fork over more $$ to get a donut too but I will be back to try it all. <br><br>10/10 recommend. <br>10/10 will return.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/F9ikd-Olg21j3slDqycRsg/168s.jpg", "caption": "Military latte"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/19oxbrHCHsRqpiIHxzAnPQ/168s.jpg", "caption": "Military latte was so freaking good 10/10"}]}}, {"review": {"des": "Coffee here is really good and I love the whole concept of sharing the space with Green Street Smoked Meats! There aren't that many seating areas by the coffee bar but a lot of people moved to the eating area with their laptops and coffee and no one seemed to kick them out so I guess that's ok!<br><br>Also I get good vibes from this place because I forgot my wallet when I got here and was extremely flustered (I was also suffering from a headache at this point because I was caffeine deprived) and this really nice person next to me got me a cup after realizing I didn't have my wallet!! Such a kind stranger- I guess this cafe attracts nice customers as well", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ejg9HtAlVxBl_TR7k9XqyA/348s.jpg", "caption": "Military coffee"}]}}, {"review": {"des": "My favorite coffee shop around! I love the vibe in here, but it can get a little loud. It's connect to a BBQ joint which is convenient if you are feeling hungry. Plugs are only near the coffee bar at the communal table or side bar, so I try to come with my laptop charged since it'll fit up fast. This place is always movin, so if you need peace and tranquility you might want to get your coffee to go. <br><br>Their espresso is so smooth and not bitter at all. I love their iced lattes. I wish they had a few more snack options, but I let it slide because they nail the coffee.  Baristas are generally pleasant and can get orders out even during a rush.", "pics": null}}, {"review": {"des": "I had no idea there was a coffee shop tucked in the corner of my favorite ramen and BBQ place!l (which by the way, my mouth was watering just being in my favorite place having coffee instead!). <br><br>I came here early on a Saturday morning and wanted to try the matcha military latte, which is their most popular drink. <br><br>I loved how this place is laid back and how fast and friendly the service was. <br><br>The latte is beautifully done! I liked the taste of it, it was not too sweet and had a good tang to it. However, for some strange reason, my cup smelled fishy. Not sure if it was the drink or the cup. I still drank my latte, as it was quite good but it just was not my favorite. <br><br>I think next time, I'll go for a different drink and just enjoy my time being in this cool coffee shop and awesome neighborhood!", "pics": null}}, {"review": {"des": "I've been wanting to try this place r for a while and was expected to finally be in the area yesterday. <br><br>The atmosphere is great. The lights make for such a warm and cozy environment. It's very hip and conducive to either meeting friends or working (lots of outlets!). <br><br>I ordered the military latte and really enjoyed it. <br><br>I'm giving 4 stars because (1) it is attached to a smoked meat shop and the meat smell really bothered me, and (2) while I really enjoyed the latte, I feel like I could find a similar matcha drink other places too.", "pics": null}}, {"review": {"des": "I really loved this place - it's cozy, quick, and has good quality coffee. I came here based off of a friend's recommendation. Matcha is one off my favorite flavors so I was really excited to try the military latte. It did not disappoint! For a little over $7 you get a fair portion and my drink was made in a matter of minutes. The baristas there are really great; the drink has a perfect balance and isn't too sweet. I was really impressed with how well they made the design on top as well. This place is already my favorite coffee shop I've been to so far in Chicago!<br><br>The atmosphere in here is nice. Tables are all community tables and it isn't too loud in here. I was surprised to see a BBQ place in the back. Maybe next time I'll eat lunch there and have a coffee after for dessert. When I return, I want to try the Black Camo Latte as I heard good things about that one as well. Treat yourself and give it a try!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/d_EhVgioRUqPSMKXnAbBvQ/348s.jpg", "caption": "Military Latte again (friend's first time here - he loved it!)"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/RCS1mhVK6WCqvuox_x2TQQ/168s.jpg", "caption": "Sawada Interior"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/pXn_laedajheLf8c0gVn-Q/168s.jpg", "caption": "Sawada Menu"}]}}, {"review": {"des": "Soooooo good. I was visiting Chicago for 2 days and managed to drink 3 of these. Iced Black Camo all the way, although I didn't try the military. If you have no idea what this means, it's their blended matcha + espresso lattes and they're better than any of the ones I've tried in NYC. Service and the donuts are also wonderful. The inside is connected to a huge bbq place that's super delicious and so conveniently next door. PLUS they played the entire Lana album, which made my day. First time I've been super gung-go about a coffee shop in a while (since I went to Japan!) so you have to try this if you're in the area. <br><br>Please come to New York because I'm deprived now.", "pics": null}}, {"review": {"des": "Cool place to get coffee and tea.  It's connected to a BBQ place, so you can get food, too.  Very industrial vibe with rock music blaring overhead.<br><br>The matcha lattes looked so good, but we were waiting to get food at Au Cheval, so I opted for a Sakura Honoka tea instead.  Light and refreshing, it is a Japanese loose leaf tea that was served hot in a large mug.  (Only one size.)  I felt really healthy while drinking my tea.  :)<br><br>I really wanted to try a Doughnut Vault doughnut, since I've heard great things about them but have never gotten the opportunity to try one yet.  But I held off to save calories today.<br><br>Really hope to come back here again someday so I can get cool latte art and eat a Doughnut Vault Doughnut.  Next time!!", "pics": null}}, {"review": {"des": "I visited Sawada while visiting Chicago. This was literally a hole in the wall cafe. The entrance is marked by a small unnoticeable door filled with graffiti and stickers. I would have definately missed it if it weren't for my friends from Chicago. <br><br>Its outdoor appearance definately does not prepare you for what you are about to experience inside. The coffee shop inside was absolutely beautiful! String lights, wooden tables and chairs, coffee shop music and aromatic coffee help set the mood to the coffee shop. The coffee shop does however, share space with Green Street and has a door to High Five Ramen so it was fairly crowded. Although a lot people were on their laptops/tablets working, I personally would not recommend long study sessions here. The vibe was a bit too lively and crowded to be able to snag a good study spot in the middle of the day. <br><br>The lattes/coffee itself was amazing. A bit on the pricey side but definately worth it. I got a matcha latte and tried my friend's military latte which were both amazing. I was pleasantly pleased at the quality of the matcha used in both. The employees definately seem to put in their heart and soul in to their coffee/lattes which was evident in their beautiful latte art as well as their superb customer service at the line. <br><br>ATTN Foodies and bloggers: Everything about this coffee shop is  INSTAGRAM WORTHY!", "pics": null}}, {"review": {"des": "Saw this place all over social media and have heard great things. I actually stumbled upon it by accident and was excited to finally try it. I would rate the Ambiance 5 stars. I loved the layout and decorations of this place. Very cute! I would 100% come back here to do some work, just because I loved the atmosphere! Plenty of table space, electrical outlets, giant windows with sunlight, and space to socialize. However, I would rate Food/Drink 3 stars. First and foremost, it is very pricey. I don't mind an uncharge for outstanding atmosphere + food, but the coffee and food was nothing more than average. That said, I could maybe justify the prices if I was sitting here doing work all day and not just swinging by.", "pics": null}}, {"review": {"des": "I was so lost when I first tried to come to this place and was hesitant because it looked like a warehouse. I'm so glad I pushed myself to still go in and check it out. This place is truly a gem. There's something positive about the vibes. The baristas are truly passionate about coffee and take their time making the drinks. I was lucky to come here on a rainy morning so that I could sit in front of the window and watch the rain as a sipped on my latte. One of the thing I really look for in a coffee shop is just having a place where I can just reflect and reconnect to thoughts that often get lost in life's busyness. This place definitely had that and more. I'll be back!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/nycreIhIpV3W-M1Tf6Zojg/348s.jpg", "caption": "Watching the rain while I sip on my latte"}]}}, {"review": {"des": "Do. It. For. The. Gram. Or snapchat, whatever the millennials are up to these days. <br><br>Ordered two beautiful matcha lattes and they looked just as good as they tasted. Came here on a Sunday afternoon and it was pretty crowded, but we managed to cop seats by the window. Perfect for a rainy afternoon study session! Definitely will come back and continue to put industries out of business with my millennial purchases.", "pics": null}}, {"review": {"des": "came here several times and ordered the military latte with soy. I think its a fairly good green tea latte but I have had better.<br><br>what really sets this place apart is the decor and atmosphere. it shares a space with a bbq place which im definitely coming back for. there are plenty of benches to sit, although sometimes it can get fairly busy. There are usually a good amount of people in there. huge fan of the string lights and the unique feel this place brings<br><br>andddd<br>the latte art here is certainly lovely.<br><br>this is definitely a good place to catch up with a friend here.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/awLfinfSDh2FFGpA2NxCLA/168s.jpg", "caption": "military latte with soy"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/rxvlZqJzW7OtlvMrrrByaw/168s.jpg", "caption": "military lattes with soy and without"}]}}, {"review": {"des": "We popped in for a quick coffee. Seriously good quality coffee, friendly chatty staff and a relaxed vibrant atmosphere . The coffee shop shares a space with a bar and a smoked meat bbq eatery which looked incredible . Off the beaten path type place , definitely worth it!!!", "pics": null}}, {"review": {"des": "Absolutely stunning place, and after going there myself, i understand the long lines and the great review!<br><br>Located in Fulton Market, this cafe has a very hipster, industrial vibe. We came at 11am on a Saturday and was greeted by an extremely long line (approx 15 min-20min wait until we were able to order). <br><br>Because we were sort of in a hurry, we quickly ordered their iced signature drink, military latte, which had the best combination between espresso and matcha. <br><br>Normally when i go to coffee shops i ask for light sugar for my drinks, but this cup was perfect and so divine! Next time I would definitely sit down and enjoy their beautiful latte art and environment. Would definitely come back again soon!", "pics": null}}, {"review": {"des": "Long line but great coffee.<br><br>We came here for a quick to go coffee. The interior is super hip and would be a great place to sit down and work on a computer for a few hours. The line of as unfortunately very long as this is a popular place in the neighborhood.<br><br>The coffee itself is great. I ordered the military latte. Which is a blend of macha coffee and milk. The presentation was unique and very aesthetic. The coffee itself was good, and had a unique flavor to it that I haven't tasted before.<br><br>All in all would come again. 4.5 stars", "pics": null}}, {"review": {"des": "One of my favorite finds recently - during the morning, you can get a coffee and work in the restaurant area (only until it gets BUSY for lunch). Good coffee, great service and cool ambiance! What a true coffee shop should be IMHO.", "pics": null}}, {"review": {"des": "This place is so underground and cool that you can become \"hip\" just by looking at it. I mean, honestly. I walked in the doors and was instantly cooler for that. Sawada is really neat, with tons of working space and a unique appeal to it. Like I said, it's pretty rustic and underground, with a lot of exposed brick and low lighting. The gentleman working the counter was super friendly, especially considering that they were lively on this Saturday morning (as I'm sure it often is). <br><br>Who am I if I come here and don't get the famous military latte? I'm really happy that I did, because it was deliciously energizing. Recently espresso does not sit well with me, but I decided to chance this matcha/espresso blend. The espresso is so smooth (and subtle) in this drink that I felt perfectly fine after consuming it. For my taste I got it with soy milk and without the vanilla syrup and it was still very tasty! Earthy, but delish. I only got to go to this one coffee shop in Chicago sadly, but I'm very pleased with my choice. Here's to Sawada!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/rEOmPij0Sv2_zeonaKVjpA/168s.jpg", "caption": "I had to try the infamous \"Military latte\" with soy milk. It was great!!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/bG5CT-yuBKDEtUJaj3UEYw/168s.jpg", "caption": "A busy place on this Saturday morning"}]}}, {"review": {"des": "Great coffee and Donut Vault donuts. What more could you ask for? The buttermilk donut is where it's at! Nice staff, quick service.", "pics": null}}, {"review": {"des": "Amazing coffee! We got the military latte and the black camo latte- both were delicious but I actually preferred the black camo latte over the typical military latte that everyone gets here. I appreciated that they put the effort to make the latte art on the to-go orders as well, it shows their dedication to their art! My only complaint is that there were not many places to sit and it's quite loud so this is more of a place to chill and socialize than a place to do work.", "pics": null}}, {"review": {"des": "The only thing I don't love about it is the slightly high price, but hey West Loop is a premium area right? Anyways Sawada Coffee also serves doughnuts from the Doughnut Vault and some strong iced coffee. You can do work at the large communal table, complete with convenient power strips and stringed lights in the background!", "pics": null}}, {"review": {"des": "I came here on a Saturday and it was pure pandemonium because this place was crazy packed with so many people. <br><br>Ambiance I liked how it was relaxed communal style tables are a nice touch. Whoever added the Supreme punching bag deserves some credit it just adds to the relaxed aesthetic in addition to the video games too. <br><br>Staff my interaction with the staff was limited & uneventful  since I was here for the Military latte and promptly sat down. <br><br>Food they have a good selection of doughnuts from Doughnut Vault but I personally prefer going to the source and getting them there more personal preference. A friend I was with ordered the old fashioned and it was good.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/7ryu2Iqg6cMCy7wfO6JMFw/348s.jpg", "caption": "Millitary Latte it was so refreshing great Matcha flavor and I will be back for more"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/c_EA6GMQbr2uO3H2cT0-4g/168s.jpg", "caption": "Selection of pastries from Doughnut Vault"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/8v0hWav2c9AUMOp3rk6PGg/168s.jpg", "caption": "Love the punching bag"}]}}, {"review": {"des": "One of the coolest coffee shops I have ever been to! It's a huge space, with rows and rows of large communal tables. There are gorgeous twinkling lights and quirky touches like a Bullwinkle pinball machines and punching bags. <br><br>And damn fine strong drip coffee and matcha tea lattes. I can't wait to come back to Sawada and just spend the whole day here chilling and working.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/le_WFhFNuS2JRE3DnwM6uQ/168s.jpg", "caption": "Matcha"}]}}, {"review": {"des": "This is by far the most awesome coffee house that I have been to in a very very very long time.  I am thrilled that this was not around while going to school because I don't know even know how one would get work done because you would just be jamming and bopping to the music while sippin' on your latte.  Ample seating, not necessarily at a table but seating nonetheless.   You would never know you were even standing in front of the coffee house, which makes it even more fun and mysterious!!  Can't wait to come back.", "pics": null}}, {"review": {"des": "Of course I had to try the military latte.  I am not a coffee drinker but do like green tea, so I was intrigued.  I read online that it has espresso, matcha, cocoa powder, and white chocolate.  I have to say it was a perfect blend because I couldn't single out a particular flavor that was overpowering the others!  It was the size of a soup bowl and super rich, though, so I could not finish.  It's also FOR the rich because after tax it was over $7.  I would gladly repurchase if they come up with a smaller size.  They also serve Doughnut Vault doughnuts.<br><br>Also, the space is ginormous.  The front area looks like mostly study-ers, but then in the lower section there's a plethora of heavy wooden picnic tables - a dining area with a bar that's shared with Green Street Smoked Meats.  Those with back problems would not be comfortable!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/VVc4RsgSSiijQUyZmJRiKA/348s.jpg", "caption": "Communal seating area"}]}}]}