{"name": "schwa-chicago", "reviews": [{"review": {"des": "This was definitely a unique experience! It is a very tiny restaurant, which makes it feel very exclusive while you are there. The service was amazing and everybody was so friendly towards us! Unfortunately the chef wasn't there that night as I would have loved to meet him. <br><br>All of the dishes were very unique. There were a couple that weren't as tasty as others, but most of the dishes were so amazing that it doesn't even matter! The first dish includes a bloody mary, which is really the perfect start to the dinner! And the truffles quail egg, omg! You must go just for these two dishes!<br><br>I would definitely go back here once the menu changes to try more of their tasty dishes!", "pics": null}}, {"review": {"des": "I was really excited to try Schwa, but I have to say that the food was the worst of any Michelin star restaurant I've ever tried. Having said that, the staff was very nice and the service excellent so I'm giving it a second star to be fair.<br><br>The meal started with a great looking board of dips for a waffle to be eaten with- this was one of the few good parts of the meal. It was served with a 'clarified bloody Mary' that pretty much tasted like pickle juice, which I guess was interesting.<br><br>Some of the other dishes I have to comment on included the Foie Gras. My boyfriend really liked it. I don't eat Foie Gras and they were nice to substitute it.... except what I got was an extremely salty mushroom. This mushroom stayed with me for two more dishes and made me lose my appetite completely. The second step of this course was to mix a spoon of ice cream with the remains of the dish... so I got gross salty ice cream. Then a very over-flavored broth was poured on top of everything and a gelatinous ball melted inside. I felt like the broth was both too salty and too rich - really couldn't have more than a spoonful and didn't eat the rest.<br><br>At some point we got a mashed banana covered in shredded parmesan. These flavors do not go together. I really really love cheese. This was first time in my life I disliked parmesan. I couldn't eat more than a bite, it was so gross.<br><br>The three course salty mushroom disaster was followed by a fish roe dish (I love fish roe) on an overpowering nutty sunflower gelatin/spread. Could barely appreciate the roe with that flavor... also didn't eat this. <br><br>Of the whole tasting, there were two good/edible dishes.. a creative corn one and an ok fish mackerel dish. For most of the meal, I thought everything was over salted. Was there a salt-crazy trainee let loose? I really can't imagine this is normal for one of the best restaurants in Chicago.<br><br>Coming to the end of the meal, the dessert was pretty inedible as well. It had ice cream, berries, small chocolate cakes and something like hoisin (?!) sauce that ruined it. The combination was very weird and the sauce would go better with duck than dessert. Maybe an untrained apprentice mixed the sauce containers and this was all a terrible mistake? I don't know... we both couldn't eat the dish.<br><br>If the salty mushroom that was the only issue with the meal, I would accept it as my own mistake to get a substitution. But overall the entire experience was extremely disappointing and the food subpar if not terrible. I've eaten at many non-Michelin restaurants that blew my mind and I would urge you to go to any other top restaurant instead of Schwa.", "pics": null}}, {"review": {"des": "Ah, so happy to have dined here ... finally. After so many years of trying to call (when I remembered), we took advantage of their offering reservations via Tock. First impression, was wow, not what I excepted even after reading about the restaurant. So cool! So unpretentious, unlike so many other stared restaurants in the area. I felt a little intimidated, like I wasn't cool enough, but still, I'll take blaring rap and a little raw atmosphere over the too luxurious feel. My husband loved that they were playing Ghetto Boys! Towards the end of the night, the room got a little warm and the music creeped a little louder making it difficult to hear. I almost felt like I was back in college at our local house hangout. After reading our reservation notes and discussing our dietary restrictions (which was nice!), we felt welcomed by the chef and other staff. I am pregnant, and loved the jovial offer of a shot while I passed through the kitchen to the bathroom. I felt welcomed and a little like I was part of the crowd. <br><br>But back to dining. Everything was amazing, except for something I've noticed people write in a few other reviews, the BYOB issues. I brought in my own soda while my husband had three pretty nice beers. They offered to keep them cool in the back. By the end of the night he had made it through two of them. Out of a nice gesture the last beer was brought to our table, but only after we had finished all the courses. He didn't need the beer at that time and he hadn't asked for it. He was a little upset because it was a nicer higher gravity beer that he essentially had to waste. There was no point in sitting there drinking it -- while I watched him. <br><br>Other than that, the food was really fun and the flavors quiet interesting for a few of the dishes. Some dishes were a little overly salty for me, but still interesting and well presented. I know the menu can change frequently so I wont go into a long spiel about each course. Just that Raviolo man-o-man! I did manage to take it all in one bite!", "pics": null}}, {"review": {"des": "I've been to Schwa twice, including last weekend for the new menu.  I will never go back again.<br><br>My first visit was particularly memorable for the awful wine service.  I brought 4 bottles for the two of us, not knowing what we'd want to open.  They proceeded to open a Champagne that we didn't need, without asking and then served it to us after the course that they wanted to pair it with had already been consumed.  And then when I left at the end of the night, they kept a special desert wine that I had brought along.  Not good.<br><br>I put past memories aside when a friend asked if I wanted to dine with him and his wife.  Surely what I experienced was an aberration, right?<br><br>Nope.  Our meal at Schwa was terrible.  <br><br>FOOD: It seems as the kitchen was more concerned with being clever than it was making food taste good.  To start, we were served a long board that resembled morse code, a glass of a a clear beverage that smelled like pickle juice and a waffle.  The idea was to run the waffle through the dots and dashes on the board, and to drink with the beverage.  It was certainly unique, but it was overly salty and the waffle was served cold and on its own lacked flavor.<br><br>Other dishes followed a similar pattern, with more emphasis put on being unique than tasty.  Why was shredded parmesan served with banana?  Yes, interesting and better than it sounds, but neither component of the dish elevated the other.  The foie gras was a definite clunker, simultaneously too sweet and rich.  We were served spoons that we were supposed to mix in the dish -- the first spoon was to scoop up the foie remnants (meh), while the second held a globe that dissolved when an unbalanced ginger infused broth was poured into the foie dish.  <br><br>One dish with fish roe tasted particularly odd, as if they used peanut butter.  My friend opined that they used rancid oil, and I'm inclined to believe that he was right.<br><br>Highlights were the mackerel with kimchee, served with hijiki seaweed, and apple and the lamb accented by coconut, green curry, root beer.  In fact, these were the only two dished of the night that worked for me.<br><br>SERVICE: The various chefs take turn serving.  The person who waited on us most frequently had a nice personality, but most of the service consisted of chefs quickly rattling off ingredients, with no explanation of how the dish was composed or the cooking techniques.<br><br>Also, in light of my past experience, we asked to keep our wines at the table, but they insisted on bringing the wines into the back.  The Champagne we brought this time was poured and it looked like we weren't poured a full bottle's worth.  I wouldn't mind if they sampled, but asking first is appropriate.  They eventually brought our wine back to the table when my friend complained.<br><br>AMBIENCE: The restaurant is small, with spray painted walls and music playing at an uncomfortable level.  Last weekend Eminem was heavy on the playlist.  The vibe is closer to a bar/club than a restaurant.  <br><br>OVERALL:  The worst Michelin starred restaurant I have ever been to by a wide margin.  It was so bad that my friend who picked the restaurant and got us reservations texted me the following day to apologize.  <br><br>Not recommended.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Bz7m0iwyd3noqnykzllTwQ/168s.jpg", "caption": "The first spoon is eaten with remnants of foie gras (meh).  The second spoon gets dissolved in broth after the foie (meh-, though pretty)."}]}}, {"review": {"des": "Easily ranks in the top 5 best meals I've had... truly a combination of creativity and deliciousness in a non stuffy environment.  I enjoyed every course (which rarely happens) and while I won't ruin the surprise of the progression, a couple of my favorites were:<br><br>- quail truffle raviolo- rich, perfectly seasoned, very large bite of amazingness<br>- langoustine with orange blossom and citrus lace- still have no idea what citrus lace is but the dish was awesome and a little interactive<br><br>Price is very reasonable for the quality and ingenuity, definitely on my repeat list...", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ibEoaOvpvytk2kVtDAo6ig/168s.jpg", "caption": "Raviolo"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/6or6VS-l_sK1oDopzQg1Xw/168s.jpg", "caption": "Little teaser of the langoustine dish (there are additional parts...)"}]}}, {"review": {"des": "Honest review: (come in at the hour ur assigned dont come early u will wait food comes out 10 minutes after ur seated youll be there for 2 hours its byob $5 corkage fee $5 dollar water fee $28 dollar tax for two so its like $159 per person.  website menu is not current. This has the vibe of el ideas so have fun and turn up its not like a cute date spot or business deal or bring ur parents type of place. Ambiance (only 10 seats no walk ins make reservations) theres cool graffiti on the walls but besides that very minimalist like el ideas. Very tiny bathroom its all the way in the back right of the kitchen. Service: it was good at times but theres only 1 server they need more employees badly. They described things gave new plates were really cool.  N when there actually not busy they were supper fun n nice. My only complaint is we didnt like the wine we brought so we were like were done n will take it to go n never saw it again but u could see through the kitchen employees chugging bottles so was like ok then rip wine so hopefully they get a manager who will supervise the staff n make sure they are not drinking ur alcohol . Food: food was delish some things were really salty but overall food was great best things: waffle/ roe/ mackerel/ foie/ lamb/ parmesan/ raspberry /cant wait to come back <br><br>Waffle (first course-bloody marry, summer squash, garlic): this was really unique i dont know how to describe the spreads because there was a lot going on n idk what was in it all i can tell u is that all together makes the perfect bite. The bloody marry was amazing like the best i ever had wish there was vodka in it n a lil spicer. The sauces were really tasty just wish there was more of it. The waffle was good but not great was a lil dry just was expecting more on the bread part but this was one of the most unique things i ever ate so id come back just for this<br><br>Raviolo second course: (quail egg, truffle, ricotta): theres so much truffle like its so decadent! First truffle dish that has so much truffle in it my only complaint it was salty like one of the saltiest things i ever ate now ik why so many people complain why the foods salty here. wish there was texture. <br><br>Pappardelle third course: (english peas, ramp, uni-kohi): i didnt like this. The pappardelle was cooked perfectly actually aldente. The only thing i liked was the uni foam it was so flavorful. I didnt like the pea sauce or the other components because there wasnt enough richness to counteract the freshness.<br><br>Roe 4th course (strawberry sun flower coriander) : this was one if the best bites of the nites it was so unique flavor wise. Its a pudding idk how to describe it since theres so much flavors going on theres saltiness sweetness then acidity was perfect. Jus wish it was a bigger portion.<br><br>Mackerel 5th course: (kimchi, hijiki seaweed, apple)<br>This was phenomenal n i hare mackerel. The apples added sweetness n acidity the puree added richness then theres these little crunchy things that add so much texture. My only complaint fish was overcooked.<br><br>Foiegras 6th course (persimmon hazelnut cacao nib) amazing i wish more people would make foie gras with chocolates perfect combo of sweet n salty n theres a lot of texture going on. My only complaint wish it had more sweetness n its a lil salty n the foie was overcooked. For this dish ur gonna save the bowl for the next course <br><br>Langoustine  7th course (orange blossom, gewurztraminer, citrus lace): worst dish of the nite. The icecream that u mix with the foie gras greeze was amazing theres no denying that. But the langoustine soup was so sweet it was inedible cool idea though<br><br>Lamb 8th course (coconut green curry rootbeer): {do not touch the bowl its beyond hot } phenomenal one of the best curry dishes i ever ate. Lamb was cooked perfectly. Theres a sweet coconut sauce n a really flavorful curry sauce then bread crumbs for crunch n a lot of herbs n veggiest for freshness<br><br>Parmesan 9th course (banana, nori brittle, makuna honey) phenomenal perfect combo of sweet n salty. The parmesan adds a great salty flavor along with the seaweed then the banana n honey adds sweetness my only complaint wish they turned the parmesan into a crisp for texture n there was more banana mousse <br><br>Palate cleanser( / abalone/): it was ok I had better palate cleansers I wish there was more abalone it's like they cut it with a blade n gave u like  smaller then a nails worth. Wish there was more flavor n that it was more acidic or refreshing <br><br>Raspberry 10th course (shiso, celery root, sorrel): phenomenal i hate acidic desserts but it was the perfect balance like was one of the best desserts i ever had just wish there was more cake.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/M1LKZ-TgX3t5BYF4tsVvTA/348s.jpg", "caption": "Waffle (first course-bloody marry, summer squash, garlic)"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/cC2YzURm-e1WIKTyai5_yA/168s.jpg", "caption": "Waffle (first course-bloody marry, summer squash, garlic)"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/RUlsSSN-azPMbERd21R5VQ/168s.jpg", "caption": "Waffle (first course-bloody marry, summer squash, garlic)"}]}}, {"review": {"des": "Great music, good service, and food on the salty side for my taste.   The chef ‍ is very creative doing very attractive dishes.  The restaurant is very tiny make sure you show up on time if You get there early they will not sit you until the time of your reservation.   The lighting of the lamps were making me feel very hot.  The climate in the room was very hot.  I had such an awesome time listening to the music and savoring the foods that were severed to us. You can bring your own  wine.  This restaurant is good for a group of friends and a nice date. The food was phenomenal was like a better version of el ideas can't wait to come back", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/idDQfZ-TjvvqP0YRTI6cJA/168s.jpg", "caption": "Paroadelle"}]}}, {"review": {"des": "LOVELY as always. <br><br>Amazing dinner last night.<br><br>I feel lucky that I have managed to get in Schwa many times in the last dozen years, and that I have witnessed their progress/maturity in their cooking and presentation. <br><br>What has certainly not changed the charm of the location, the staff's pride and friendly professionalism, the funkiness of the place/music, that they take food seriously but not themselves (or you).<br><br>Keep up the good work y'all.", "pics": null}}, {"review": {"des": "I want to start by saying that the staff were wonderful, food presentation was on  point and I really did enjoy maybe four out of the 9 courses.<br><br>This was my first molecular experience so I'm not sure what I was to expect but to me the delicious waffle at the first course was served with a clarified Bloody Mary that tasted like pickle juice. Unfortunately the drink foretold a flavor theme of the night. Way too many things tasted like pickle juice to me including the dessert. I do like pickles but this was not expected and the vinegar like pickle taste to many of the dishes made my meal not enjoyable. A few hours later I still taste pickle.", "pics": null}}, {"review": {"des": "Schwa was beyond disappointing for the following reasons:<br><br>Service - our waiter was dripping with attitude, and not in a good way.  He was condescending, and not really friendly at all.  He also acted like he had no desire to serve our table.<br><br>Food - The food was really unimpressive. It was way too salty, the flavors at times reminded me of cleaning detergents, and the portions were itty bitty.  I left the restaurant this evening and walked to a pizza place to get a slice.  Yes, I can eat a lot, but after spending $160 a head I shouldn't walk out of a restaurant still being hungry.<br><br>Ambiance -  Its noisy as hell in the tiny restaurant.  You can barely hear the person next to you the music is so loud.  At one point a table nearby started singing one of the songs out loud, so the staff turned up the music even more, to the point where we were yelling at each other across the small table to be heard.<br><br>After tonights experience I can say I will never come back.  Chicago is a foodie town and is filled with lots of good options.  Schwa is no longer one of those options.  Go spend your hard earned money elsewhere.", "pics": null}}, {"review": {"des": "Great experience. Really enjoyable and refreshing to have incredible food void of any pretentious vibe. Everything was comfortable and relaxed except the food which was tight. Each course had a unique plating and presentation. The smooth clarified Bloody Mary was perfect, raviolo lived up to the hype, the foie gras was incredible and the ice cream at the end took it to another level when I didn't think that was possible, and the fragrance of the lamb presentation reminded me of how much that sense influences the taste. Be prepared to talk loudly to be heard over the music. While it was a treat for us it felt welcoming in every way including the price for what was delivered.", "pics": null}}, {"review": {"des": "Yesterday I was excited all day, in anticipation for my Schwa experience. I took to Yelp to check out what others thought of this place and was shocked at the reviews. I've only heard amazing things, but some yelpers were not happy. I didn't want those reviews to taint my experience so I went in with an open mind and that mind was blown!<br><br>First Impression: We ended up being a little late due to awful traffic. Based on some of these reviews, we thought, \"oh gosh are they going to hate us or reject us?\" When we showed up, we apologized and they were super cool. They let us know these things happen and it wasn't a thing at all. Our server (also a chef) collected our wines and our gifts for the chef (nice bottle of rum and a large format beer). There were 4 people in our party, one preggo so we ended up bringing a sparkling rosé, 2 regular sized lighter reds and a large format big cab. He clearly read his notes because he knew we were celebrating a birthday and that birthday girl happened to be pregnant.<br><br>Environment: The space is small and dark. Think of a black box with the kitchen in the very back. No decorations, no artwork, just a small number of tables with white linens. There was rap music playing, which got us pumped for our meal. We could still have a conversation, so for those that thought their eardrums burst, let's be real- it wasn't THAT loud. The smell was intoxicating, smokey notes filled the room. Not like a cigar, but almost like cedar. Come to find out, it might have been the hay they incorporated into a dish.<br><br>Food: I won't go through all of the dishes we had because I can't remember all of them (wine didn't help). The one dish I will never forget is their signature quail egg ravioli. It's a one slurper and it was the best slurp of my life. The truffle, the rich creamy texture, it was simply spectacular. The flavors the chef thought of, the experiential aspects... all of it was genius. I didn't find the food to be \"too salty\", I really thought they were thoughtful about every dish and executed them perfectly. <br><br>Staff: The staff was so fun and nice. There was not an ounce of pretentiousness. We spoke with many of the chefs about how long they've worked there, about different dishes they are thinking of rolling out and they were honestly very interested in our feedback on the dishes. The restroom is off of the kitchen, so you have to walk through the kitchen to get there and they encourage you to speak with the chefs and watch them prep meals. Everyone was super approachable, we even ended up taking a photo with some of the chefs.<br><br>Overall, I'd give this place more than 5 stars if I could. Chef Norman (wonder if that's his real name) was our favorite, he was funny and we appreciated how he creepily watched us try certain dishes, interested in our feedback. We can't wait to return!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/4kql9nR37a6KYZF0dH9pzA/348s.jpg", "caption": "Schwa staff is awesome"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/f2cc7ZNgpFo2tX2jfPSneg/168s.jpg", "caption": "This plating though..."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/uFhuGOSztYbPCLRtV6DGzQ/168s.jpg", "caption": "Looks like little foot prints"}]}}, {"review": {"des": "My wife and I have been to Schwa twice in the past year. The restaurant is a wonderful gem in Wicker Park and we are very grateful it is in our neighborhood. <br><br>We loved both of our adventures to Schwa because we treated them like performance art. Both times we went, we brought one of our favorite couples, and spent 3 hours getting full and drunk. Such wonderful experiences. The waiters / chefs were amazing both times. Just great guys cooking great food. <br><br>We had 10 or 11 courses each time. 3 courses were unbelievably delicious. 4 were very very very good. The rest were ok. <br><br>This is a great spot to visit once per year. Cannot wait for the chance to go back. <br><br>Thank you Schwa!", "pics": null}}, {"review": {"des": "Absolutely amazing experience! Everything about Schwa was so memorable, even the lack of decor makes this place memorable. I called about a month in advanced and was able to get a reservation for my preferred day and time. I called before dinner service begins thinking it would be easier to get someone on the phone during prep time. I also got a call to confirm a day or two before my actual reservation.<br><br>Just insanely creative, delicious food with the chefs stepping outside the kitchen to serve and interact with you. I came in thinking these plates would be all about looking cool and the taste would be meh, but I was so wrong! The taste matches every bit of each plate's stellar appearance. All the dishes were great, but the quail egg ravioli with truffle is the best bite I've ever had. <br><br>Music was great that night; mainly old school rap with some rock songs added to the mix. BYOB is a nice perk to Schwa. We brought a bottle of red and white for 2 people. The chefs would tell us what would pair best with each course so that was great! Also, brought a bottle of whiskey for the kitchen.<br><br>Everyone that we interacted with was so cool. We even got to take a picture in the kitchen with everyone (just ask!). Such a wonderful meal and experience, but I can see how it's not for everyone. When we walked into the door and took a step, we were literally in the middle of the dining room then. Someone from the kitchen popped out, and promptly seated us. If you're open to the experience of gourmet dishes in a different setting, then it's definitely worth the price to come to Schwa.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/HA-E2owJ7J4szyNMd_OFvg/348s.jpg", "caption": "A lemony potion of sorts to clean out our mouths"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/I8U833wKjy7adsAv03W2TQ/168s.jpg", "caption": "The cheesecake - savory"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/NyoSmCPoWBzLgOiThtMSJA/168s.jpg", "caption": "Lamb dish"}]}}, {"review": {"des": "We had a truly wonderful time at Schwa last week. The food was great, the people were great, we have exactly zero complaints. I am here to address some of the things people wrote on here that gave me pause going in, but which ended up being so off base that I feel the need to reassure others reading these reviews!<br><br>1) The food is definitely NOT too salty. I am very sensitive to salt and I wholeheartedly disagree with this theme that seems to appear on peoples' posts. There were so many varied flavors and textures and the food was simply wonderful, inventive, flavorful, filling without being too much food, etc. Someone also mentions too much pickle which is also surprising to me as there were just so many flavors, but I did not sense overuse of vinegar. <br><br>2) They absolutely do not steal your wine. They take it back to the kitchen so they can serve you the most appropriate bottle in the order they think best. We brought 3 bottles and they only served us 2 of them and returned us our third, unopened, at the end of the meal for us to take home. Also they do not pool the alcohol, we were served the exact bottles we brought with us. You should bring them some sort of alcoholic gift to thank them for their excellent work though. <br><br>3) The servers (who are also the chefs and the kitchen staff and the hosts, etc) are not grumpy or condescending or pretentious at all. They are super chill, friendly guys. Definitely not the buttoned up penguins you'd expect to see at a white tablecloth restaurant if that's what you're expecting. They are all relaxed and happy to answer any questions or chat with you in between running dishes in and out, though as you will see, their time is limited... because they are doing everything.<br><br>Go to Schwa, it's a wonderful experience!", "pics": null}}, {"review": {"des": "Schwa is located in Wicker Park and is all about a community of chefs collaborating with one another.  They only offer a 9-course menu that is updated seasonally, and the ingredients that are used range from locally-grown produce to harder-to-procure delicacies.<br><br>My friend had made dinner reservations, and it was a great setting to play catch-up!  We started off with: Bourbon (considered an olfactory journey); Octopus (with carrots and peas); Parparadelle (flavors of summer); Flavors of Forest (pine, snail, moss, and mushroom); Fish Fry (with walleye, morels, malt vinegar, fava, and blackberry); Oyster (7 up); Foie Gras (with mulled wine, oats, maple, and pickled cranberries); Pheasant (with pechuga, plum, pineapple, and corn); Cheesecake (with humboldt fog, fermented apricot, and nasturtium); Unagi (with watermelon and togarashi); and, Ants on a Log (with peanut butter, celery, raisins, and rum; I especially enjoyed this dessert as it reminded me of my childhood!).<br><br>I liked the fact that each dish was creative and interesting, and that the lack of description on the menu makes it more of a surprise when you receive your plate.  The restaurant itself is also super laid back, intimate (about 26 seats), and an open space where you can watch the chefs do their magic.<br><br>Reservations are required and can be difficult to obtain!<br><br>+seasonal 9-course menus<br>+reservations required<br>+collaboration of chefs", "pics": null}}, {"review": {"des": "I had a real hard time writing this review. I left Schwa feeling rather ambivalent and that I missed why it was so well rated. While there were some dishes that really shined through as pure excellence, I felt like getting the few excellent dishes was the exception, not the rule. Comparing Schwa to other prix fixe dinners, I left feeling like this was a middle of the road food experience. <br><br>The atmosphere, decor, and service were fine. Simple, casual, and urban. We provided the chefs with a fifth of Jameson as we hear this is the standard. We brought only a white wine and the staff were courteous to provide a red for the complimenting dishes.<br><br>The food? Smaller portions, and, while interesting flavors, not overly impressive when comparing restaurants that Schwa should easily stand as an equal or better to. There was some creativity present. I noticed a dish or two could've used texture or flavor balances as well. For example, the garam masala blend on the seared branzino (perfectly seared in all fairness) seemed to lack balance, overpowered by coriander and cinnamon. The highlight of the evening was a ravioli topped with quail egg, shaved truffle, and parmesan. <br><br>I am not disappointed that I came here, but, there are other places in the city that have impressed me more during a coursed meal.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/cryXKLwtTo7ouxot7snC2w/348s.jpg", "caption": "Pretzel bread and Schwa's take on pork and beans"}]}}, {"review": {"des": "its a very cozy intimate place, the vibe and service are good, and the best thing is it's BYOB, the reason I took one star out is that just almost from the very first course it's taste kinda salty and heavy, and this last for the whole meal till dessert. But overall it's worth trying.", "pics": null}}, {"review": {"des": "Holy cow! This place is so amazing! The rumors are true, it was hard to get a reservation. The first time I called and left a message and was just going to 'see what happens'. But then I called back two more times to finally get in. I mean the game was half the fun, I will catch them!<br><br>We brought 3 bottles of wine and a 6 pack for the kitchen team. 3 bottles is too much... and I drink a lot of wine. 2 is perfect for 2 people. Since we didn't know the courses, we brought a bubbly, a white and a red. The kitchen staff took our bottles and then served our wine to us with the appropriate dish. Whew, cause I didn't know how I was going to choose. <br><br>I can't even decide what my favorite dish is! Each one is so complex with flavors that you hit a sweet note then salty then a crunch. It's a 9 course meal that I didn't want to end. The playfulness of the food is so fun as a diner. We had a dish with banana purée and Parmesan cheese! Who knew these two things would be such a great pairing. <br><br>It was $140/person for the 9 courses. I don't know where else you can go and have a meal like this for that price. We have been to El Ideas and this had a similar feel but seriously almost half the price. Run don't walk to Schwa!", "pics": null}}, {"review": {"des": "What a fun dinner! The ambiance (or lack thereof) puts a unique focus on the food, it's preparation and it's presentation. The chefs (who also serve the food) are edgy and fun. The blaring rap music made us feel relaxed, like no one was taking themselves or the meal too seriously. It made for a really fun night.<br><br>The food itself was interesting and creative. Five star presentation. There were a couple of dishes (their take on truffle ravioli was quite possibly the best thing I have ever tasted) that were great. But, overall, a lot of the food was a little too much for me. Maybe my palette isn't refined enough, but I found a lot of the flavors to be too rich, bold and salty. So, although I loved my Schwa experience, I don't think I'd go back for the food itself. But the menu is always changing so if you haven't been, definitely give it a try.", "pics": null}}, {"review": {"des": "Love, love, love!  <br>Not an easy res - but well worth it if you nab one on the few seats each night.<br><br>If you love innovative, thoughtful, provocative food and ...If you can ignore the death metal and rap music coming from the kitchen (I don't judge your muse), and like minimalist decor, than you may have found one of your new favorites!<br><br>Schwa is all about the food!  I have been to Schwa 3 times and I continue to talk about an amazing, stand out disk from each experience.  I doubt I will ever forget the white chocolate egg shell that was the vehicle for an amazing dish with tiny eatable flowers.  (As an aside, I can't tell you what I had for breakfast yesterday!) <br><br>Every course amazingly well though out with every detail perfected!", "pics": null}}, {"review": {"des": "Incredible, Edible, Art! Our dinner here last night was truly wonderful. The chef's passion to bring out the flavor of ingredients through techniques and the science of foods creates flavor-full combinations that are reflected in every course (I lost count after 9 courses). Wine pairings are expert. Ambiance is inviting and relaxing. I appreciated the experience even more as the chef's described the courses at our table and invited us to their approach to the plating's tableside. Thank you Norman, Caleb, Nick and Luke for your enthusiasm, passion, creativity, and kitchen tour :)<br>pamela (you know who)", "pics": null}}, {"review": {"des": "Schwa is excellent.<br><br>The space is concise, and the decor is minimal.  You don't come here for frills - the focus is on food.<br><br>You will be served by the chefs, who engage in humorous banter that is refreshingly candid and free of pretense.  <br><br>Bring a few bottles of wine - some red some white.  They pair and pour it for you.  This is an opportunity to pick some wine you know you love, and avoid paying the typical restaurant price.  It is also customary to bring a bottle of soda mething for the kitchen - we brought bourbon.<br><br>The food is superb.  The truffled egg ravioli was a highlight.  One course had a smokey broth that impressed, leaving me to expect the (WHAT WAS THIS) would be a contrast of flavor. Nope.  Biting into the pasta unveiled more layers of incredible smokey flavor.  The dish was unexpected and wonderful.  You'll have that experience throughout your meal. <br><br>You should try it out.  Seriously.", "pics": null}}, {"review": {"des": "So I want to start this review with that I really wanted to live this place, despite all of the negativity surrounding the reservation process, and some bad experiences I read about it. We had reservations booked for about 2 months, and had no issues. Once arriving, I thought the staff was excellent. Obviously not as proper as other fine dining experiences, but knowledgeable and very friendly. The reason for the 3 stars was solely because of the cuisine. It was a 9 course tasting menu, and my opinion were 1 was amazing, 3 were very good, 3 were average and edible, and I didn't finish 2. My favorites were the soup, a bit sweet and soy flavor. The ravioli was amazing, could really taste the truffle. The second pasta dish was delightful, it was almost a rigatoni noodle, but perfectly cooked in tasty sauce. The star of the night was the foie gras. So tender and tasty, cooked to perfection. So yummy. There were a couple that I just ate for the experience and was like warm on. Ie the grape cracker starter, and the crab with the sweet cake middle. (Although the crab was good, mixing it with a sweet cake was very odd). I flat out didn't eat the cheese/fruit dish. Was just not for me. And I'm not a fan of dessert typically, but I really did not enjoy the ice cream with sauces. Overall I thought it was a cool experience. Loved the space and mood. But food missed it for me.", "pics": null}}, {"review": {"des": "Not so into writing these reviews lately but a recent experience here made me feel I had to tell the world.  <br><br>I'd come to this place a couple years ago with some coworkers and concluded that the hype was a bit overblown. They told me all the standard stories about the owner's drug problems & how hard it was to get a table there, how cool it was that they blew off their customers and gave zero fucks & just sometimes closed the restaurant for no reason, or that they once kicked everybody out so that Lady Gaga and her boyfriend could have the place to themselves.  Whatever - that stuff doesn't sound so impressive to me (I work in TV; I encounter plenty of difficult, entitled assholes without having to seek them out in restaurants), & anyway half those stories are probably fake.  I figured it for a velvet rope type strategy: you know, you make people wait in the cold for long enough & eventually they'll be so in love with the place just cause you let them inside. I feel like people feel so special & keyed up once they're actually sitting in this (dumpy) room getting intimidated by the macho (all-male) staff that they can't bear to admit the food might actually be not so well-thought-out. <br><br>Many of the dishes we tried had cool & playful concepts but there wasn't a sense of balance or cohesion from plate to plate and probably 7 out of 10 dishes were just crazily salty (even the famous quail egg raviolo). I figured whoever was in the kitchen okaying all this stuff to be sent out was either moonlighting from his shift at an old folks' home or had just come off a 3-day cocaine & Jameson bender.  I'm not just saying that because all the dudes we interacted with were obviously flying high. I'm just saying, I think whatever these guys are taking to get through the night might be having some effect on the palate. (I used to cook for my grandpa & would watch him pour salt all over everything, taste a bite, then add more salt, repeating throughout the meal. I've also, er, met people who liked to, uh, hit the slopes pretty hard, and I've seen what kinds of foods they're attracted to when they're trying to ride their high. The kind of guys at the party who can't stop talking at you while they load up a single water cracker with 2 heaping tablespoons of caviar.)  <br><br>Anyway, my impression based on that visit was not too favorable. A couple months ago, however, an old coworker invited me back for a group dinner, telling me things had changed & that the owner was off drugs, the culture of the restaurant had changed and blah blah blah.  He owed me a favor so I grudgingly accepted. I made sure I was fairly buzzed by the time I met them there, hoping it would help me have an open mind & not be too critical about the food or atmosphere.  <br><br>Well, I don't wanna drag this out forever but the food seems to have gotten more interesting. Or maybe they just have their good nights & bad nights like anyone else. To my surprise only 4 of the dishes I tried were aggressively, nastily salt-fucked, and one, some kind of pasta dish with cardamom foam, really blew me away with its relative subtlety and depth.  <br><br>I can further report that the 'culture' of this place does not seem to have changed one bit. The blaring music was exactly the same as I remembered. I think it was the same \"Shitty Early-00s Hip-hop\" mix I had heard on my previous visit.  They definitely closed out the night with the same Girl Talk album (which I had not listened to since high school, & there is a reason for that). The staff was still gacked to the gills & not hiding it one bit. My buddy brought them a couple 6-packs of some shitty local Pennsylvania beer he brought from his hometown & they seemed blown away. The kitchen sent us numerous free shots & several extra BOTTLES of wine, & by the end of the meal no one was feeling any pain, or, I might add, tasting anything critically or accurately.  <br><br>The real party came after they closed, when a few of the kitchen guys joined us for what amounted to a bizarre neighborhood bar crawl. I don't wanna be too specific but we ended up getting dragged to some weird gallery across the street that appeared to be open all night. A spazzed-out woman in a silver coat kept feeding us more booze, weed, and sweets, and threatening to give us a tour of her \"hospital,\" which, I gathered, was some kind of back room where god knows what went on. <br><br>After a while the Schwa guys left but then we ran into them again later at this crazy Mexican dance club down the street. I have no idea how or if my friend knew they'd be there, but they appeared to know everyone there, down to the last, uh, working girl, and I suspect they may be getting some of the ideas for their flavor profiles after enjoying a bit of what this club has to offer. Anyway, I've gone on long enough. I guess my point is, food issues aside, if you come to Schwa with the right spirit, maybe including a large dose of aggressive masculine stupidity & craziness, amazing things can happen.", "pics": null}}, {"review": {"des": "The food here was fucking phenomenal. What stood out from Schwa's nine course tasting menu was their lamb belly and their single quail egg ravioli. I literally cried when I put the ravioli in my mouth and the juices exploded - it was that good and I was so touched by the combination of flavors.<br><br>I was very impressed with Schwa's small but personable team. I believe there were only 4 team members working when we dined there and they managed to do the whole sha-bang (serve, pour drinks, clean) and cook up an unbelievable meal. We even got to go in the kitchen and meet the executive chef, Michael Carlson. The dinner was also very intimate as the restaurant only seats 26. <br><br>A Michelin star well-deserved (and I wouldn't be surprised if they added another!).", "pics": null}}, {"review": {"des": "I have been holding off on writing a review for Schwa because I have mixed emotions and I finally feel ready. I truly believe that restaurants like Schwa is what makes the Chicago dining scene so excellent.  The dining scene is defined as leading in inventiveness and revolutionary thought.  For that to be successful, the diners must be forgiving and appreciate the risks that the chefs are willing to take.  Here, the chefs have really made this their own. From the rock music, to the friendly banter, to the unique unsuspecting decor outside, to the reservation system... It is a fun experience.<br><br>When it comes to value, I don't think it is fair for any diners to be complaining. It is phenomenal. It takes tremendous time and effort to constantly develop unique new ideas and on top of that, you get about 12 to 13 courses which is way more than than is promised.  To top it off, there was a pairing to complement each and every dish.  We brought our own red wine but we got so much more than we bargained for.  <br><br>With each course, we were transported to Germany, India, a chemistry lab, Italy, and more.  I was so excited for each course and the unique ingredients that were in the dishes. We had so much fun trying to guess what ingredients were in the dishes that it was part of the fun. Pickle mustard seeds? Lentils that were fried to the point of exploding but frozen in that state? Foam made from tea?  Jameson shots with the chef?<br><br>This was such an incredible culinary adventure. The only reason I hesitated so long to write this is because I have to agree with a couple other reviewers that the pork and lamb dishes were incredibly salty.  Would it stop me from coming back? Absolutely not. Even after we left the restaurant, we were marveling at how a quail egg was put in the ravioli and cook just perfectly so that the yoke would just be slightly runny.  That was by far the best dish.<br><br>All in all I will return with a big bottle of Jameson for the chefs, because they deserve it.  I did not do that on my first experience, but I have a newfound appreciation for what the chefs to here that I absolutely will next time.<br><br>In order to enjoy, you must come with an open, curious mind ready for the unexpected dining experience and appreciate the creativity that is put in front of you.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/FjCTLt3R8FmfPQawovLNAw/348s.jpg", "caption": "Cuttlefish dish"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/iO-i43-T9AxUOsMJFoKSFg/168s.jpg", "caption": "Quail egg ravioli.. favorite item"}]}}, {"review": {"des": "Schwa is the most unique culinary experience I have had the privilege to partake in anywhere. The space is very sparse and 'Heroin Chic' - the food is truly the star of the space. Reservations are made over the phone and are a bit nebulous- but well worth it. The multi course tasting menu was AMAZING- beautifully balanced from appetizers to dessert- unequivocally the most umami menu I've experienced. The menu contained a balance of vegetables, fish, pork, Beef, and Dessert. This is a BYOB Restaurant - the staff recommends one bottle of wine per person. <br>The staff was fun, no nonsense and a bit Rocker Dude with a Hipster edge. Most importantly they are all extremely knowledgeable of the complex dishes you are enjoying. The music is loud but appropriate. We will be back  - with Whiskey for the Chef's - an apparent tradition. We Loved Schwa!!!", "pics": null}}, {"review": {"des": "Went there the evening of Sept 11 with 3 friends.  We had just the best time.  Space is small and intimate, the staff was very engaging and welcoming, and the meal was fantastic.  Two of us are not \"adventurous\" eaters and went outside our comfort zone, but enjoyed the preparations so much very little was left behind.  One of our group does not eat red meat and the staff accommodated her needs and she was also wowed with the substitution.  We could not have had a better experience.  Thanks to Chef Carlson and his fantastic team.", "pics": null}}, {"review": {"des": "Yes the music is loud, the ambiance might be somewhat lacking, and no they are not going to take the time to give you a written menu ....and  you are paying $140 for dinner .... if those things  bother you, STAY HOME!  <br><br>My group loved it and cannot wait to come back.  The Schwa team was great at paring all of our wines with the meal and were super accommodating when we asked to have a different wine with one of the courses.   They were fun with some attitude but gave great service!<br><br>For the first time I left a tasting menu not stuffed and not hungry either.   I could go on and on about the courses but the menu changes frequently here.  <br>Everyone in my group was completely blown away by each course.   I loved that the food was extremely innovative and most courses tasted like nothing I had eaten before.  When I asked our server how I could get another, his response was \"Pay another $140!!!\"   Love!   <br><br>Schwa more than lived up to all of our expectations.  <br>We will be back soon!!!", "pics": null}}, {"review": {"des": "Schwa is one of the top three best dining experiences I have ever had. I highly recommend this restaurant.<br><br>Atmosphere: the place is in a strange neighborhood for a Michelin-star restaurant. The space is a cubic room that seats roughly 20-25 people at a time. There is no host stand or entryway - just a square room with tables. The drop ceiling is tinfoil-looking tiles, but the tablecloths, chairs, and dishes are all very nice.<br><br>Drinks: Schwa is BYOB, and they recommend a bottle of wine per person. They will keep and pour it for a $5 corkage fee. One of our courses was a delicious cocktail accompanied by a snack, and another was accompanied by a house-selected beer.<br><br>Experience: Many of the courses (we had 12) were brought out of the kitchen by chefs, who took the time to explain each dish. Overall, it took about two hours, but the time flew by. Every chef was very personable and provided great service, asking after our enjoyment of each dish, seeming genuinely interested.<br><br>Food: Each and every course was incredible. I was truly amazed by the quality of the food here. I've provided a list of our courses (to the best of my memory) below.<br><br>Last word cocktail with a twist: extra ingredients and fermented lime, accompanied by a mushroom twig with thyme, parsley, and Meyer lemon<br>Citrus-marinated cuttlefish with raisins, shaved fennel, walnut, spice clouds, apricot<br>Quail egg ricotta ravioli with shaved truffle and parmesan cream - their classic course<br>Pasta with braised veal heart, strawberries hydrated in rose, cardamom foam, opal basil - my favorite course<br>Bone marrow creme brulee with caviar, grapefruit<br>Mulligatawny: pompano, carrot sprout, fennel, compressed watermelon with coconut, watermelon spice<br>Crabapple - pickled apple covered in crab covered in candy on a stick rolled in old bay caramel, cashews, and cilantro<br>Pig face fried and coated in chicharrones with bacon dressing, gooseberries, dried and not cherry tomatoes, accompanied by a pretzel with bacon butter and a spotted cow beer<br>Lamb and lamb belly with a nicoise with olive chips, feta, and olive puree<br>Laundry soap: blue pea flower lemonade with citric acid - really cool molecular gastronomy course<br>Lemon rosemary sorbet<br>Corn ricotta pawpaw...", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/8obCv5m-Nt9pd7mLVP9jrw/348s.jpg", "caption": "Lemon rosemary sorbet"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/gi8C23amD47C-AfKY-tIgw/168s.jpg", "caption": "Laundry soap: blue pea flower lemonade with citric acid - really cool molecular gastronomy course"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/PfhpOjHBuwI-27iQ5DJbsQ/168s.jpg", "caption": "Humboldt Fog cheesecake"}]}}, {"review": {"des": "This is my most favorite gourmet place ever. My wife loves it for the delicious food and top notch presentation, I love it for the cool music and laid back feel. There are no waiters, the chefs serve the courses themselves. And oh the courses! The quail egg ravioli might be the single most amazing course I've ever had, better than any single item at the French Laundry, Alinea, Tru, etc.  The best part is it's byob, so the tab is extremely modest considering the quality and talents of the chefs in the kitchen. Tip: bring a six pack or other offering for the fellas in the kitchen, it is well received and probably tastes damn good to them after the last guests leave. I've been to many Michelin restaurants and this is the only one I go back to whenever I can.<br><br>If you have any doubt, google the story of Charlie Trotter bringing the greatest chefs in the world here a few years back!", "pics": null}}, {"review": {"des": "I gave them only 2 stars on a recent review--and feel a little guilty. I was feeling dyspeptic (and puffy with all the salt they fed me) Should have been at least 3 stars. Not that my opinion is so important--but I feel that if I'm going to write these things I may as well be as fair as I can be.", "pics": null}}, {"review": {"des": "What an experience. Were in Chicago for a friend's birthday and had reserved a table for 6 here. It's funny because hearing that it was a michelin-rated restaurant, I expected that we needed to dress up. But I was so wrong. This is the most unassuming restaurant with a fun and exciting menu. <br><br>There are probably only like 5-6 people who work there. Total. There wasn't a host. There wasn't a designated server. They really seemed that they pitched in and did everything together. To descrive the inside, this place only sits like 20 people. The walls are dark for a calm ambiance and they had simple light bulbs hanging from the ceiling with the bottom of the bulbs painted black as to not be blinding and sent the brightness more up to the light-colored ceiling. One of the chef/server guys was wearing a NIN shirt and I think another was wearing a similar shirt of another band. The place is so small that there is only one bathroom...and it's in the kitchen. That made for an interesting experience to walk back there and see what plates they're prepping. <br><br>As for the food, it was truly like a story of different, unique dishes coming out. Some bizarre. Some cool. Some even beautiful. The most memorable was definitely their signature truffle quail egg ravioli that seriously BLEW. MY. MIND. Loved everything about this place. How down to earth they were. Took advantage of the BYOB. And to make it even more unforgettable for my friend's birthday, her and I took shots with the chefs in the back to celebrate. Good times!", "pics": null}}, {"review": {"des": "My friend and I entered and were getting situated. This is a very small restaurant. They didn't take our coats so I was putting it around my chair and the waited runs into me. I now feel like it was on purpose. Instead of saying excuse me or explaining it was a tight space he decided to make a point by nailing me in the back. Then through out the service a different server hit me on the head multiple times through different courses when putting silverware down. The guys who are cooking the dishes are also playing and clearing the tables. Word of advice. Hire someone to do this so you guys don't have to rush around and hit people left and right. The food was ok. Nothing blew my mind and a lot of it was on the salty side.", "pics": null}}, {"review": {"des": "Love love love this place! The music is hip and food is always good I love coming here, each time always brings a smile to my face :) favorite restaurant of many I've been too", "pics": null}}, {"review": {"des": "I am having a difficult time writing this review because I really wanted to love Schwa as I have waited years to try this place.<br>The decor is minimal but I came for the food.<br>The food was beautiful but the taste.... so so. I personally love salt and even I found the food overly salty. The service was okay.... but not great. We felt like our dining there was somehow a bother to them. It's worth a try but I personally will not be back.", "pics": null}}, {"review": {"des": "The presentation is beautiful but that's pretty much the only good thing about this place the food was way too salty and does not live up to other high end restaurants in Chicago. It's BYOB and the staff is really cool but the food was not tasty at all.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/JVTFwnXO1PNFpfxHByAM3A/168s.jpg", "caption": "Pretty presentation but does not taste that good and the food is way too salty"}]}}, {"review": {"des": "Our experience at Schwa was overall just okay.  Very underwhelming.  Not worth the money and I probably wouldn't recommend it to friends.  Foodwise, everything was pretty unremarkable.  Nothing was even close to being the best thing ever or even that good.  It doesn't compare to tasting menus we've had at Alinea or Grace.  I think my favorite thing was actually the waffle and bloody mary.  It was unique and the waffle was cooked perfectly.  For everything else, presentation was beautiful and unique, but again, it was all just okay tasting. We did think the music/ambiance was great!  This was probably the best part about it.  Service was meh.  Chefs were clearly working hard in the front of house and back of house, but really seemed like they could have cared less about us.  They weren't very nice.  I know being rude is kind of their thing but if that's the case, why are we bringing you booze as gifts?  All in including tip, we spent $395 for two people.  At that price with the experience we had, it was NOT worth it.", "pics": null}}, {"review": {"des": "Knowing the history of snagging a table, I thought I'd see what happened one evening and try my chances over the phone. After a couple rings, Norman answered the phone and booked me for a table last night, Wednesday after basically letting me know they had plenty of times available for Tuesdays and Wednesdays... so, maybe it's a tad easier to grab a table?<br><br>You don't go to Schwa for beautiful decor, fancy chandeliers, muzak, etc. you go because the food is incredible and made with passion by some killer chefs.  The food is THE star here... why they choose to keep your surroundings simple.<br><br>Yes. There's moderate volume music (it's not overly loud where you can't hear each other, but more lively)... Punk, hip hop, whatever they're feeling at the time.<br><br>Drinks: Bring a bottle of wine per person (we shared our second bottle), and something for the kitchen... we brought a 12 pack of Modelo, and it was a hit! Trust me, bring something for them... you won't regret it! Our first course started with a little cocktail as well, and a few other surprises along the way...<br><br>Food: I'm mostly pescatarian, and they accommodated EASILY. The food was remarkable... simple but so complex, a range of dishes, flavors - I won't ruin it for you, but the quail/truffle ravioli was ridiculous, the Humboldt Fog cheesecake, the sweet potato or ham tortellini, the belgian asparagus/hollandaise/roe - sorry Schwa if I screwed that one up - all the way to the dessert. Exquisite.<br><br>Go here.  Have fun here, don't wear your LBD, support the kitchen, have an awesome time.<br><br>Thank you Schwa!!", "pics": null}}, {"review": {"des": "Great value for a top notch BYOB food place with a super low corkage fee.  All the dishes were great, especially the truffle ravioli, doesn't get much better.  Spaghetti with veal hearts was spectacular as well.  It's an unusual and laid back ambiance, what type of restaurant plays nirvana and gangster rap?  Fun experience would definitely go back on the next menu change<br><br>we did bring the chefs a bottle of bonded bourbon, we did shots with it later, all around a good time", "pics": null}}, {"review": {"des": "They offer a variety of inventive dishes and flavors. Pretty delicious. Service was fun and staff was informative, but not pretentious.", "pics": null}}, {"review": {"des": "Tbh, 3 stars for the food and 5 stars for the experience so I settled for 4/5. It's a really cool dining experience, unlike anything you have probably had before. No waiters, the chefs serve dinner, choose your wine, and explain everything. We brought 4 bottles of wine for 3 people and the chefs made sure we finished every drop. Safe to say they want you to have the best time. As for the food, most of the courses were seafood centered which I didn't mind. However, I felt that the fish flavor took over and many of the dishes ended up one-noted. All the food is incredibly imaginative and artistic. There were some courses that were out of this world and unlike anything I've ever had i.e. the foie gras and the famous raviolo. If you're against spending $150+ somewhere you're not going to be blown away by every course, this isn't for you. If you're looking for a unique experience you'll tell all your friends about--make that reservation.", "pics": null}}, {"review": {"des": "Where to begin? This experience was simply the best. We were seated right away (place was pretty empty at 6 but full by the time we left around 10) and although they laughed a bit at us and our copious amount of alcohol (including a bottle for them) , they were so friendly all night. Pro tip: Bring good enough alcohol that you aren't embarrassed by (aka no two buck chuck) but skip the nice bottle you've been saving from your wedding-- they serve the booze in a free for all so we were drinking wine that was definitely not what we brought, and saw ours being poured elsewhere. <br><br>When reading the reviews, I didn't understand how it said vegetarians go crazy for this place- but they were extremely accommodating for food restrictions (no pork/shellfish). I wish I could go through everything we ate but I was so enthralled by the experience and amazing presentation, and there were so many courses with so many intricies, that I can't even begin to do them justice. <br><br>Although it's not the cheapest dinner in the book ($130/person pre tip, cash only) , every penny is worth it - plus the fact that its BYOB totally helps. Now just to secure another reservation...", "pics": null}}, {"review": {"des": "Second time to come to Schwa, and I had very different yet still amazing experiences. <br><br>The first time (about nine months ago), I'm quite sure Michael was our waiter. He was very quiet, not super interested in engaging in much discussion on our food, kept our glasses full with the beer we brought. The music was intense and loud, which made the experience all the more interesting. Every course was delectable, and although explained by the various team members, I'm not refined enough to actually know what I was eating. It was all amazing, and upon leaving, we knew we wanted to become as regular as we could afford.<br><br>Second experience: took my husband there earlier this week for his birthday. Had no issue getting a reservation with about a month notice. Michael was not there, and the service was noticeably different. I enjoyed his quiet edge last time; this second time was more jovial and interactive. Joshua poured us A LOT of booze, even stuff we didn't bring. That was super fun because we had a variety of unique beer and wine to try. The music was also different...it sort of seemed to progress with my mood. Started off with 90s rap, then progressed to pop type music (I may have danced a bit in my seat), and by the end they were playing Tool and my husband was in Heaven. What didn't change was the food: everything we ate was amazing and thoughtfully crafted. <br><br>Take home points:<br><br>- This is the most unique restaurant you will ever try<br><br>- Michael Carlson and his team have a true passion for food and it is displayed in Schwa<br><br>- If you take yourself too seriously, don't go to Schwa. You have to know how to have fun and just roll with it<br><br>-If you're picky, leave that at the door and eat whatever the hell they put in front of you. It will be the best combination of ingredients you ever have<br><br>- Bring boozey treats for the team<br><br>- You'll notice my review has no photos. This is the one restaurant I respect enough to not take photos. I cannot say enough about Schwa...it's a wild ride that is beyond enjoyable", "pics": null}}, {"review": {"des": "My friend and I had a memorable experience at Schwa. Every dish is a Beauty  and discovering flavors on each plate is surprisingly fun and amazing. Every server made an effort to make us understand what you were eating but also to make your experience even better. We were visitors in Chicago from Venezuela and got to This place by luck so the funny one was that when we got out of the uber And stepped into the rest never thought we could have such an incredible experience. The look is so small, simple and basic that is hard to imagine what you are going to experience. Also let me tell you, the music. I'm not fan of the music they played. To loud and funky for me but ... once you start your first dish, your first server  your first drink, you kind of get into it and enjoy it as part of your sensations. And last but not least the picture at the kitchen. Best dish for me the truffles ravioli and the smoked hay meat. Expensive but the experience is worth it if you can pay for it.", "pics": null}}, {"review": {"des": "This place rocks. It is so unique and unlike anything I have ever experienced. GO!", "pics": null}}, {"review": {"des": "The reservation was worth the blood, sweat and tears it took to snag a spot. This was definitely the biggest, longest, memorable foodgasm of all. I wish I could recount the taste, name or appearance of the nine courses, but that would be too much like right. What I can tell you is everything I put in my mouth was incredible. These guys are sooooo talented and genuinely enjoy what they do. <br><br>How do you get in on the fun!?? Well, call the number like you are trying to win four tickets to hear One Direction, Prince or Sade (or your fav artist). The voicemail will be full so keep trying. When the phone is answered, don't get confused if they answer saying Domino's or Burger King. They are playful and unorthodox, but it is worth it. <br><br>It's BYOB so bring whatever floats your boat. There are no ice buckets brought to the table to white wine or rose. Prepare to have them chill it for you. Plan on spending about 3 hours feasting. <br><br>The price is a lot cheaper than most restaurants of its caliber, so you should bring a bottle of Jameson for the chefs. .... As a side note, while we licked the bowl and squealed about each course, the cooks were chomping down on pizza that was delivered. Gotta love it! There's no place like Schwa.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/bzRGYPIn5-o4I3HNnHb9lw/348s.jpg", "caption": "A type of ravioli."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/oX4Wzm7WM6qw7TqVqOWtiw/168s.jpg", "caption": "The winner of the night. (Even with more lighting, the photo could not do it justice)."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/WVjna3Cvc-JMfiEq7E_i-Q/168s.jpg", "caption": "You cannot use your flash in the restaurant"}]}}, {"review": {"des": "We had so much fun at Schwa.  My husband and I went for our birthday dinner and did not leave disappointed.   He has been calling for a while to get a reservation, but don't give up, it's worth it.<br><br>I personally feel when you get a certain caliber of food, many times the ambience can be stuffy or uptight.  It was refreshing to be able to relax and enjoy without the stuffiness.  <br><br>The space is small, no frills. Maybe 25 seats. The chefs serve your food (no servers) and keep it lighthearted.  My husband and I were enjoying figuring everything out and appreciated the creativity.<br><br>I will be dreaming about the one bite truffle ravioli and the crab apple lollipop.  There was really no course that I could have gone without -- all were well done.<br><br>It is BYOB, so we brought a red, a white, and a large beer (also bring a little something for the kitchen!).  I was pleasantly surprised that they will pair it for you with each dish.<br><br>I would love to go back again and see what they come up with next.", "pics": null}}, {"review": {"des": "Schwa was great. <br><br>The 9 courses were full of flavour and beautifully presented - one of the best meals I've had. The chefs/cooks explained each dish to us in detail. When I asked one to repeat one of the ingredients he told me to listen more carefully. He was honestly kind of a dick but was funny at other times - I still can't decide if I liked him or not. Overall, the service was top notch. <br><br>My boyfriend and I had a couple of drinks before going (he was also fighting a cold and on Sudafed) so we basically crawled out of there. We brought 3 bottles of wine and Bulleit for the kitchen and were given our bottle of white back. They gave us other booze to try during our meal. <br><br>Schwa certainly isn't your typical dining experience but that's what I loved about it. We were the last ones in the restaurant and they were blaring hip hop. Hip hop happens to be our favourite kind of music so it was all good, but I expect that some might be a little put off by it. <br><br>I hope to go back, and will show up dead sober next time. I think it would've made the experience even better. Would 100% recommend.", "pics": null}}, {"review": {"des": "Here is an honest review of what happened when I dealt with Wilson and another co manager at Schwa today: I made reservations over the weekend and was told I was giving my CC number to hold my reservation and there was a 48hr cancellation policy. I was called the day prior to reservations by Schwa and confirmed the reservation. We then tried to change reservation on the day of to accommodate others but that could not be done which was understandable as last minute notice but then I was then told that cancelling would result in a 100$ fee. I explained to the co manager had I known that i would not have tried to change reservations or asked others to join. I explained that on the day I made the reservation by phone I was not told of a fee if I failed to cancel prior to 48hrs nor what the fee amount would be in terms of $50 per person. This also wasn't listed on the website. The phone call ended with an agreement to not charge the fee and we would visit again in the near future. <br><br>However 15mins later i was notified by text that I had been charged $100.  I called back to inquire about the charge thinking we had an agreement and Wilson the head manager said it is policy to charge the $50 per head fee but would not comment on where this policy is stated or why his reservationists did not mention this fee on the two prior occasions (when i made reservation and when they confirmed it the next day). They should be up front about this on the reservation call otherwise it is a con.", "pics": null}}, {"review": {"des": "I wrote a comprehensive review the last time I was at Schwa so check that out for lengthy details. I'm going to keep this one short & succinct. <br><br>+Food is amazing. 9 courses that taste unearthly and are presented to blow your mind.<br>+Brother Ali, Atmosphere, and Talib Kweli are some of the artists playing over their sound system. They blare what I like to call White Boy High music, so if that isn't your thing, might want to bring ear plugs. It's my thing so I was loving it.<br>+Service is always amazing yet stays cool & casual.<br>+It's a 3 hour affair. Both times I've gone it's been a little over 3 hours of a dining experience so be ready. <br>+BYOB. Remember you're going to be there for 3 hours so bring enough liqs accordingly. Don't be a douche and give the chefs your leftover boos (like a table of drunk idiots in suits/fancy dresses did last night)...bring them something intentionally. <br>+Our bill came to $353 for two with tax & tip. It's pricey. Real pricey. But remember, you're not spending anything on drinks, you're getting a life changing meal prepared by a master of cuisine, and just generally you're going to have an awesome time. Worth every penny.<br><br>Most casual fine dining you'll ever have. Come as you are. Chill out, relax with friends, eat, drink and be merry. Schwa is a must do and Chef Michael Carlson is a culinary genius.", "pics": null}}, {"review": {"des": "With a power vibe the Schwa Crew endeavor to reclaim our palate with courses to blow your mind. Your tongue is challenged to discern the flavors influenced by a mix of Japanese and French styles that in then end were Schwa'nique! You'll not be disappointed to experience this venue of sublime tastes hidden in the outskirts of Chicago.", "pics": null}}, {"review": {"des": "This place is crazy.  My wife and I went for date night recently and it was just as good as ever.  We had been once about 8 years ago when we first started dating.  Then it was new, weird, cool, and a really fun way to experience fine dining in an atmosphere that was anything but.  <br>Back then reservations were not as big of an issue.  And honestly this time we called, got someone, set a reservation for a Wednesday night and went and everything was as smooth as ever.  <br>Everything was cooked and seasoned perfectly.  OBVIOUSLY the raviolo was the best thing, you just can't go wrong with truffle and buffalo ricotta.  Also the taglietelle with veal heart-bananas!<br>I wouldn't go here if you really need to make sure you are going to get in, or if you get a reservation have a solid place for a back up.  Some other enviornments that are interesting like this are Elizabeth or El Ideas, both completely different but still that sort of casual feeling with fine dining approach.  <br>This place is one of those places that makes Chicago the food City it is.  Schwa is a pioneer and so many good chefs have come from this restaurant, 42 grams, Oriole...", "pics": null}}, {"review": {"des": "Absolutely incredible.<br><br>I was visiting Chicago for one night only (Red eye in Friday night, late flight out Sunday evening). Saturday night was my only real shot at a good dinner out in Chicago. I set my eyes on Schwa. Getting a reservation wasn't as hard as people made it out to be - yes, I called a few times, but they actually returned my voicemail and I got a table for 2 at 8 pm on the Saturday when I was in town. Perfect.<br><br>We walked in and felt at home with the hip hop playing and lively atmosphere of the intimate 26 seat restaurant. I brought two bottles of wine with me, gifted one to the kitchen (apparently this is the thing). And I settled in to enjoy an amazing evening! <br><br>Schwa offers creative molecular gastronomy in a laid back, comfortable setting. It makes the food pure fun, not at all stuffy or snobby. It was totally and completely delicious, from the first sniff of the Manhattan air freshener to the last bite of rocky road ice cream. We had so much fun, giggled while drinking laundry detergent and oysters with poprocks, and licked the bottoms of many plates. <br><br>Well worth the hype, and a pretty great deal for an incredible 3 hour dining experience not to be forgotten.", "pics": null}}, {"review": {"des": "Difficult Reservation - Somewhat Worth The Effort <br><br>Atmosphere: Love it. Rap/Hip Hop - Into It (Wiz Khalifa was on repeat). Laid back. Relaxed. Not pretentious. <br><br>Food: The meal was overall inventive and well-executed. With that being said, some things meshed well, others not so much. The food was solid, but I wasn't overly impressed with any particular dish. My expectations were extremely high which was probably why the meal in its entirety left me underwhelmed.<br><br>Service: Standard. Nothing special which lends credence to their philosophy of being all about the food.<br><br>Would I come here again? Eh. I'm glad I did, but moreso so I could cross it off my culinary bucket list. Also, dining for 4.5 hours is not my thing.<br><br>Recommended? Mostly for those who truly appreciate culinary creativity and don't mind dining for hours on hours to experience it", "pics": null}}, {"review": {"des": "This spot has been on my \"to do\" list for several years, and wow.....it did live up to the hype!  Yes, it is dark inside.  Yep, there is LOUD music (pretty cool stuff).  Yeah....it is way cool that the chefs are the servers.  They were friendly, attentive, and informative on our visit last night.  Woohoo, the food is FANTASTIC, creative, fun, and delicious.  I am not sure which course was my favorite, as they were all so unique and delightful.  The ravioli was stunning.  Pastrami and celery soda was mind blowing.  Loved the fish fry.  The cheesecake was devine.  Plus, everything in-between was AMAZING.  <br><br>What an experience....", "pics": null}}, {"review": {"des": "I can't believe how highly rated this place was.  Of course I wanted in.  <br><br>The reservation system drives me bananas, call 2 months in advance they tell me call back the following month.  A month ahead, they tell me their reservations haven't opened up for April, yadda, yadda.  I basically called about 40 times to check on availability, to make sure my name was on the waitlist and to confirm my reservation.  The reservationist was very lackadaisical, which made me uneasy, to add to it, there was no e-confirmation.  <br><br>I should have known after the reservation experience, but I couldn't stay away.<br><br>It's BYOB, which is not the easiest task when you're from out of town, we had the cab driver wait for us at the Binny's parking lot and then hauled the stuff.  We bought 4 bottles, one Jameson for the kitchen, we wanted to start off with good karma.<br><br>There were some hits and a lot of misses.  Many items were interesting to look at but too salty or sweet.<br><br>The bathroom is through the kitchen and the walk there, while short, is a little greasy, so ladies, make sure to plant your feet when stepping.  The loo is super small and the friendly kitchen would offer us Jameson shots after we did out biz.  Very cool.  <br><br>Timing on the courses were off, it took almost four hours for our meal, I think it was supposed to be 9 courses, kitchen threw in extras, but still, it was a bit drawn out.  We actually ran out of wine and the kitchen brought us a new bottle of red from the back, so nice of them.  <br><br>No photos, but I saw other patrons snapping away, with a flash, so I drew out my phone.  The staff were very chill, almost to a fault, they seemed overly wired and a bit unpolished for my taste.  <br><br>Highly disappointing experience.  Cool concept and vibe, but flavors were not balanced enough for me and not memorable.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/-UKtUk-_K_uP_DdT_8VhoQ/348s.jpg", "caption": "Honeycomb toffee and sorbet"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/JMaBStx54aFcHNH3-5iJOQ/168s.jpg", "caption": "Horchata and rice krispie"}]}}, {"review": {"des": "I took my boyfriend here for his graduation dinner. I read some previous reviews and people stated how it was really difficult to get a reservation. Luckily, they called me back 2 days after I  left a message for when I wanted a reservation, to confirm my dinner for when I wanted it. They were extremely accommodating with me being vegetarian. They made a vegetarian equivalent for every dish that was given to my boyfriend. I love that this place is BYOB (there is a corkage fee); definitely helps cut costs.  What I loved most about this place is the environment. It's a high-end restaurant in terms of food and presentation, however extremely laid back with the actual décor and music. There was loud, old-school music blaring during dinner (which I enjoyed and gave me a nostalgic feeling throughout the experience). It didn't feel stuffy or snobby, and I wasn't worried about how I am supposed to hold my wine glass or use my silverware correctly. <br><br>We ended up bringing two bottles of wine (one for us and one for them - this was based on previous reviews). We ended up finishing our bottle and wanted more, so we asked for a drink menu. Our waiter decided to bring us each a complimentary drink and even shared a glass of wine from the bottle we brought them, which I thought was very sweet of them. <br><br>The food itself was good. The presentation of each dish was amazing! I cant remember the names of all the dishes, but I appreciated how they went through each dish in detail to describe what we were being fed. I wouldn't say the food was phenomenal, however many of the ingredients and flavors were very new to me, so it was something very unknown to my palate. I really enjoyed my experience at Schwa and it was definitely a very unique and memorable experience! I would definitely recommend it, especially as there is no other comparable place like it in Chicago!", "pics": null}}, {"review": {"des": "We came here last weekend for my Fiance's 30th birthday and I can honestly say that this was one of the best dining experiences I have ever had in my life. The ambiance, service, and staff was great. To say the food was \"amazing\" is an understatement. Each course was unique and adventurous and beautifully put together and absolutely delicious. I cannot rave enough about our experience - highly, highly recommended. We will definitely be back!", "pics": null}}, {"review": {"des": "Wow.  Wow.  Wow.  Not that Schwa needs yet another 5 star rating, but I'm adding it anyway.  Hands down, one of the best meals I've had in Chicago and THE best combination of mind-blowing food with a relaxed and fun atmosphere.  The total package.  Chicago has no shortage of fine dining, \"molecular gastronomy\", top quality chefs (Next, Goosefoot, Alinea, and on and on).  But Schwa is the one place where you can go and experience one of these meals without the stiff atmosphere.  You don't have to be on your best behavior.  You don't have to dress up in an uncomfortable outfit.  You go as you are, you get to act normal, and you will have a fun interaction with the chefs while having your taste buds dance the entire night long.<br><br>Because the items are so unique and creative, I'm not posting pictures or describing individual dishes.  Half the fun of a place like this is knowing that whatever you are served will be phenomenal and going in with no expectations so each item can be a surprise.  Also, the pictures just don't do the meal justice.  If you have food restrictions or allergies, let them know when you come in and they will accommodate you.  But don't limit yourself if there are foods you just don't like.  Be open to as much as you can.  The one thing I like about Schwa that is different from other restaurants in this class (like Next), is that they don't use so many ingredients that you've never heard of or that you did not know were edible just to show you what they can do.  They use more familiar items and ingredients to make the best possible and most unique version of something you may have had.  For example, their version of a fish fry?  Something I could not even comprehend - there were combinations of complex flavors that I've never had and were amazing...and also a familiar taste that took me back to my childhood days of eating at Captain D's.  How is that possible?  By pure genius.  This underlying feeling of comfort with each dish just enhances the overall relaxed atmosphere that Schwa provides.  <br><br>So here's the deal for Schwa - yes it's very hard to get a reservation.  But my husband got one with only 3 attempts.  The key is to be flexible - have a date in mind but be open to other days near that date.  Be prepared that the date may get cancelled on you.  Yes, they're fickle like that, but it's part of their boyish charm.  Sometimes if you call, they may say \"Do you want to come in tonight?\"  He asked for something near our anniversary (11/16) and we got 11/17.  Which was perfect.  So be prepared to make a flexible plan.  It's worth it.  A lot of people have theories on the best time of day to call.  He had the best luck with a 2pm weekday call.  <br><br>The restaurant is BYOB and although they will tell you not to worry about it, be sure to bring something for the chefs.  They're not picky and they're appreciative of everything.  But bring something just for them.  Don't be that person who brings a 6 pack and gives a bottle to one chef.  We took a bottle of wine for ourselves and a bottle of bourbon for the chefs and that seemed sufficient.<br><br>The cost is pretty good as compared to other restaurants in this class.  The price varies depending on the particular meal of that day.  The total for 2 before tip was $305, including tax, a $5 corkage fee and $15 for still water (wasn't paying attention when he said there was a tap water option).  That said, once you're in this caliber of dining experience, I'm not sure that $50 here or there really matters.  If you're willing to splurge on this type of meal, just go for it.<br><br>Have fun with it.  Don't take yourself too seriously because despite the ridiculously high class culinary creations that these geniuses are making, they also don't take themselves too seriously.  There's no pompous arrogance here.  Don't be afraid to get a little tipsy.  The chefs like to share, so don't be surprised if they come out with an additional drink or two that they think might pair better with that item than whatever you brought.  By the end of the night, my husband broke his glass.  Don't worry about it.  They didn't.  And the table next to us of 5 senior citizens (who had been to Schwa many times) came prepared and brought a case of unbreakable wine glasses.  Veterans.  My husband and I also did a shot of Jamieson in the kitchen with the guys to celebrate our anniversary (thanks Joshua!).  That's the type of place this is.  And that is what makes it unique and a clear stand-out over any other dining experience in Chicago and possibly the US.  The food alone would keep Schwa ranked high in a very short list across the country...but the atmosphere and fun experience is what puts it at the top of that list and in a category all on its own.", "pics": null}}, {"review": {"des": "Definitely one of my most memorable dining experiences ever.  Never have I been treated so casually at what was supposed to be a \"fine dining\" restaurant and I totally loved it. It felt like I had known these guys for years. The chefs were all personable and fun to be around and clearly have similar music tastes as I do. <br><br>I truly did not enjoy 7 out of my 9 courses, but I am totally alright with that! While the flavors didn't line up with my personal palette - I was impressed by the level of creativity exemplified in each dish and I would GLADLY return to see what else they're going to come up with next!<br><br>If you don't like the food, that doesn't mean the restaurant isn't good...it just means this particular menu, this time around, wasn't for you! It's very obvious these people can whip up innovate dishes, so you gotta be willing to try new (slightly bizarre) things. <br>I'm down with this spot - last Saturday was my first time coming and I'll absolutely be back.", "pics": null}}, {"review": {"des": "I'm so unhappy with my experience at this so-called restaurant that I don't know where to begin. <br><br>First, this place should be renamed \"Hype\" because that's all it is.  The rumors about the impossible reservation and stellar food are all HYPE.  I called on a Tuesday morning and they rattled off possible days and times, so there is a lot of availability. I called once, it rang 3 times, done. When I made the reservation, the punk [he was so rude and blasé, I can call him a punk] on the phone told me to bring my own booze. <br><br>I had a friend who had been to Schwa and he told me it is customary to also bring a bottle for the staff. Basically, you have to spend $300 for food, $100 for booze, and then some more for the staff? Ok... I just went with it.  <br><br>Let's review the courses.  While on their website it may display that they offer 9 courses, that wasn't what they were doing... it was 7... Again, I went with it. <br>First course: A hairball, a combo that was on the floor of the a movie theatre<br>Second Course: a HUGE piece of ravioli that you have to eat in one bite while the waiter stands there and watches like a freak.<br>Third Course: You know what would be a great idea, let's drop this old piece of lobster overcook it, then drop it in Dawn Lavender Dish Soap and call it a foam<br>Fourth Course: pieces of gooseberry...with no meat<br>Fifth Course: Who cares?<br>Sixth Course: I want my money back!<br>Seventh Course: Chocolate and grounds of coffee you have to lick off a plate<br><br>Each plate was as if they asked a child to decorate and then forgot to place the protein on the plate! The service was so absurd, I'm convinced you have to be a line cook at Ed Debevik's before transferring to Schwa. They ended our meal with giving a little insult while placing the check down...it is laughable that this is considered fine dining.  Save your money and go to L20 or Next.  No need to go to HYPE.<br><br>The best part of the whole night was the Pinot Noir I brought! <br><br>Also, you can walk in and just sit at a table so long as you bring bottle of Crown Royale. I saw it happen twice while I was there.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/lr_7O9ojhsZDLhw6vXPtSw/348s.jpg", "caption": "Course 4 or a kindergarten art project?"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Y0lET3DbmNBIEqLGe79mjA/168s.jpg", "caption": "Gooseberries and grapes worth $110"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/hjXERxRdxN1o00tkW3L1OA/168s.jpg", "caption": "Lobster with soap"}]}}, {"review": {"des": "I can only speak to my personal experience, but eating at Schwa was wonderful! Regardless of its online reputation, I definitely recommend giving this place a chance. It was well worth it! <br><br>I called on Wednesday around 1 and had no issue getting through and scheduling a reservation for the following week. I had a funny feeling they'd cancel on me, and I was right. They called me to reschedule and were very nice and accommodating even though their reason for canceling definitely seemed like a lie. Oh well whatever, I rescheduled for the following night. <br><br>I let them know upon making the reservation that I am a vegetarian. They were happy to accommodate and my food was delicious and just as beautiful as my meat eating boyfriends' meal. I will say the courses take some time to get going but by the end of the experience you will not leave disappointed! Some of the dishes probably won't blow your mind, but flavor-wise they will not disappoint. Most dishes were like nothing I had ever eaten before (my first molecular gastronomy dining experience). <br><br>The chefs/servers were very nice. We did not bring them any booze as some people here have suggested. It did not seem to matter either way. The music was at an appropriate level and the atmosphere was chill. I actually appreciated the casual environment. It was a good way for a person like me (25 year old, casual foodie) to experience fine dining without feeling out of place. <br><br>The bill for two with tax and tip was over $300, so just be aware of this before going in.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/P-AOxvqesjlfqJ-xUUfDGQ/348s.jpg", "caption": "Veg version of the scallop dish. Excellent!"}]}}, {"review": {"des": "I really didn't know what to expect, as all I knew was that the food was great and the place would be freakin hard to get reservations for.  The main focus here is the food and it was all delicious.  I thought the reservation process wasn't that bad, especially since I wasn't the one making reservations.  All I know is that it a few calls and they were cool with having to change the date later on.<br><br>The place is pretty easy to find.  Just look for the black awning with the words Schwa, right across the street from the neon lights of the rim shop.  So the restaurant is bare bones, with a basically open kitchen right next to the dining room.  Only 26 seats and the place is small; its small enough that you have to use the bathroom in the kitchen area. They have painted floors and tin ceilings, with lightbulbs hanging above each table, and the chefs were listening to West Coast hip hop.  They're BYOB, so I picked up craft beers for us and the kitchen.  They were pretty cool and hooked us up with some red wine, when we ran out of beer.  The dinner was very casual and lots of fun, with different chefs bringing out the 9 courses.<br><br>They menu was very vague, with just the main ingredients for each course, but that's the fun of it.  You never know exactly what you're going to get.  Some of my favorites were the pizza cotton candy, quail egg ravioli and truffles, tagliette rabbit pasta with foie gras, and the various ice creams like the uni and sweet pea.  The funniest ingredient of the meal was the Elk, apparently shot from a helicopter by a sniper.<br><br>I really enjoyed the meal and would love to come back again soon.  Their menu completely changes quite often, so they'll always have something new to try.", "pics": null}}, {"review": {"des": "I agree almost entirely with David's review.<br><br>I have heard of Schwa through research, and thought it would be a must try Michelin Star restaurant when the time was right. After several call attempts, we had our reservation. First impression was 'okay this is interesting & very different from all the other ambiences we have experienced on this list.' But I was open-minded...after all if the food is good I rather have it in this ambience than a uptight one (Tru).<br><br>Given the price for the meal I thought is would have been fair if I had even enjoyed half of the 9 courses.<br>The restroom was also unisex which for the price tag and expectations we had for Schwa is was unexpected.<br>And Pellegrino for $20...<br> <br>As for the food, my rating on each course runs the entire spectrum (like David' review). There were a few dishes that were good but nothing I thought that that were absolutely fantastic. Then there were a few dishes that I will give credit for being unique and involving very skillful preparation like the 7up gelatin encased oyster... but for taste did not live up to the creativity. Then there were some courses that were so ruined by being over-salted or so sweet for my palate that honestly just ruined my experience here. All three of their sweet courses I had tasted but left the rest on my plate because the flavors was quite inedible for me. I was very confused of the goal of most of the desserts and the flavor profile they were trying to achieve. <br><br>While I am glad I had the experience, I wish we had the $350 (price for two incl. gratuity) spent on numerous other of the amazing restaurants in Chicago", "pics": null}}, {"review": {"des": "If you're heading to Schwa by some odd chance you actually got a reservation, I would advise you to stop Yelping your little heart out as I did and go in with no expectations, although if you've gotten this far I'm sure you know plenty. I will tell you that you're going to have a really really cool experience at a fraction of the cost of other tasting menu restaurants in the city that you will tell your friends about for months and to bring the kitchen a 6 pack of beer in hopes of making your experience even better. <br><br>And if you haven't gotten that reservation, I suggest you keep calling as this is one not to miss.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/fCmxHPytv1DvvgIJ1lg12g/348s.jpg", "caption": "Teeny tiny little schwa"}]}}, {"review": {"des": "I became determined to go to Schwa after I heard that they serve antelope raised on a Texan farm and shot from a helicopter by a Navy SEAL sniper. This sounded so absurdly extravagant that I had to go.<br><br>The perception that getting a reservation at Schwa is impossible seems to be mostly hype. Of course they don't pick up the phone during most of the day, but I called around 5pm on a weeknight, and someone picked up. I made a 9pm reservation for myself and a friend.<br><br>About a week later, on the night of June 4th, we went to Schwa. As is custom, we brought a bottle of Jameson for the house, and a bottle of Red vin de Bourgogne for ourselves. We observed that the restaurant was tiny, but the interior decor was, in its subtle way, really original and cool. The speakers blared hard rap, West-Coast Hip Hop, and occasionally metal. Whoever composed the playlist had great taste: the atmosphere was awesome; it managed to be both intimate and aggressively in-your-face. The place really had personality and attitude. The staff was also super-cool: everyone was really friendly, chill, and informal. After the meal, we took shots and group photos with the chefs. (Though unfortunately Michael Carlson was not present tonight.) Schwa definitely has the best atmosphere/environment of any restaurant I've been to.<br><br>Now to the food itself. First, I need to mention that I came to the restaurant with a slightly burnt tongue (I had an overly hot beverage in the morning) and on a mostly empty stomach, which I would not recommend. The small portions can be overwhelmingly flavorful, and combining those with plenty of alcohol and an empty stomach can be too much. Eat some bread before you go.<br><br>We were served twelve courses. The plates were, as expected, very small, but extremely interesting. Parmesan ice cream? Butterscotch powder? Pickled blueberries? Flamed cheese with fermented huckleberries? At Schwa, you will be presented food probably quite unlike you've ever had before. Their takes on particular items and reinterpretations of traditional meals are, indeed, very creative and impressive from an artistic point of view. <br><br>We thus got the impression that Schwa is probably where good chefs come to eat: to be inspired, to relish in the cleverness and unusual brilliance behind some of the dishes. A true connoisseur of food is likely to have a blast at Schwa.<br>Perhaps Schwa is to food what Captain Beefheart is to rock music.<br><br>But my tastes are perhaps not yet so advanced. I just couldn't really get into the food. A one-sentence summary to justify the 3/5 rating I am giving Schwa is that most of the dishes were interesting, but did not leave me wanting more. One dish specifically I disliked: the marinated cuttlefish with frozen bits of apple in a chilled cucumber/lemon sauce. The lobster was also surprisingly chewy.<br><br>Perhaps Schwa just strikes an unlucky chord with me: many of the dishes on the menu involved citrus flavors in some fashion: lemon foam was quite common, which is something that I personally simply don't like (same with cilantro). Though I'm sure the cooking was fine and most people would rate the food rather highly, this personal preference just ruined some of the dishes for me, which is unfortunate. <br><br>The famous quail egg raviolo was all right. It was pretty tasty, but it was not the divine experience that some other reviewers recount. The antelope was fine, though I have had better meat at other restaurants.<br><br>Perhaps the food was generally a little too experimental for me. While I can get behind the notion of foams and creams constituting the majority of the meals, I just couldn't dig the citrus-theme that seemed to pervade the foams, and some of the flavor-themes that generally defined the dishes.<br><br>So, in conclusion: Schwa has the coolest atmosphere in Chicago, you should go just to experience the attitude. The food, though super-interesting, was not quite my cup of tea, but that may be due to personal preferences and coming a little ill-prepared. You might get much more out of it than I did.", "pics": null}}, {"review": {"des": "I'm not going to review the price because I didn't pay for it. <br><br>I had a pretty cool meal and it lasted more than 3 hours with drinking involved. At dessert, the staff and remaining tables were all family. <br>Fulfilling and... \"earthy\". I don't even know what earthy really means. Dishes taste gritty, as if dug from the ground. Clean, tho. Earthy. The opposite of hearty. <br><br>If there was a main course demi-heure, it involved chicken and lots of cruds (raw fish). Those were nice. I wouldn't eat their frozen ants in peanut butter with celery sauce again. Probably not ever.", "pics": null}}, {"review": {"des": "First, thank the heavens I didn't have to make a reservation because I wouldn't have cared that much, especially when there's other restaurants out there that have better food and a better atmosphere. <br><br>FOOD: 4 stars. I liked the food, just didn't think it stood out among other restaurants in its same caliber. There was the quail egg which everyone dished about, but for me, it was overly creamy and overly salty which made the flavor unoriginal. The venison we received was tough and my least favorite dish. And, the story that came with the venison dish was that the deer are not stressed when they're killed which means that it tastes better. How is there no stress involved in the killing? Oh yeah, there's a sniper in a helicopter that shoots it so that they aren't herded and terrified. I'm sure that the sound of the helicopter and the seeing of other deer being shot will terrify another deer. Anyway, had to share my thoughts on that story (you are reading my review)...<br><br>SERVICE: 4 stars. Good. Sporadic, but still attentive. There's no buckets for your wine or beer so they'll take it back to the fridge for you. Someone does explain what each dish is, not that it matters because you can't hear (I'll get to that next)...<br><br>ATMOSPHERE: 2 stars. I'm sure people love the hype (as some other reviewer put it) on it being cool and rockerish. And, sure that's fine when I'm somewhere I'm not spending $160 for a meal. In the beginning, the music was at a great level, and I loved it. I could still hold a conversation. I could still hear what dish I was eating. I could still enjoy the atmosphere. However, half way through our meal, the music got so loud that I refused to talk, because my throat was starting to hurt from screaming (and, that was just to the person across from me; forget trying to talk to person 2 away from me). <br><br>I say, sure, try it once. See if you like it. I didn't feel I wasted my money. However, in relation to other restaurants I've been to like this, I didn't feel that it was the best by any means.", "pics": null}}, {"review": {"des": "I became aware of Schwa through the grapevine as a must-do experience, IF you can get the reservation. After several call attempts, we had our reservation with another couple. The place is small so being seated is entirely dependent on one particular table, which in this case caused us to wait until 10:30pm to be seated for our 9:30pm reservation. <br><br>Given the price for the prix fixe menu, being able to BYOB is nice, except when you see them pouring one of your expensive bottles of wine to another table, and when you don't really have a choice in what you drink when - they just take all your booze to the back and bring out what they feel like at a particular time. <br><br>As for the food, my rating on each course runs the entire spectrum. There were a few dishes such as the quail egg ravioli and chocolate pasta that were absolutely fantastic. Then there were a few dishes that, while quite foreign to me, I will give credit for being unique and involving very skillful preparation like the 7up gelatin encased oyster. Then there were some courses that were so ruined by being over-salted that they were almost inedible. Just not good, at all. <br><br>While I am glad I had the experience, I wish I had my $275 (price for two incl. gratuity) and bottles of wine back and had spent it on numerous other of the amazing restaurants in Chicago.", "pics": null}}, {"review": {"des": "Food was astounding, service was ok.  But considering it was the Chefs doing the serving, I am 100% ok with that.   Honestly, just a surprising, fun, delicious, interesting evening.  Food I would never try in a million years (deer heart for example) I actually enjoyed.  Bone Marrow brulee with caviar?  Amazing.  Super loud music, yep... and although I was a little irritated with it when I walked in, by the end of the evening it was an important part of the experience.  And that is what eating here is like. Experiential, sensory challenging, deliciousness.  Truly not humblebragging, but having dined at both Alinea and Grace, Schwa stands shoulder to shoulder with both, but with a rock and roll attitude.  What a great night and I am already looking forward to trying to score my next reservation!  P.S.  Bring a bottle of wine for the staff... they earn it!", "pics": null}}, {"review": {"des": "Now that I actually ate here I can give a proper review.  This place is unique, a lot of molecular gastronomy or as I like to call it gastrophysics.  Talented chefs, doing what they want to do.  Ok, I get that.  The food just didn't WOW me.  Everything was like an amuse bouche. Cotton Candy that tasted like pizza, popcorn flavored soda - a little of that goes along way (for me).  The egg ravioli with truffles was good (a tad too much salt) - everything is ONE bite.  My favorite was the helicopter sniper shot elk (favorite for the description).  The pork belly was soo small.  <br><br>This is the hardest reservation because they don't make it easy.  They don't answer their phone.  It's not like it's hard to get in, it's hard to get a hold of the restaurant in general.  What I found amusing was that they asked for a CC to hold my reservation.  HOW could I cancel if I had to if they don't answer their phone?  Then they call to confirm and on their message they ask you to call them back.  Even they have to see the humor in that.  <br><br>I was actually a bit happy that they cancelled on me a few years back for my husbands 50th - it would not have been his cup of tea.....", "pics": null}}, {"review": {"des": "Just awesome. While I'll admit that you're a little thrown off by the appearance when you first walk in, I quickly realized you can't compare Schwa to another other Michelin/dining experience. The creativity was as good as any restaurant I've been to, and every dish was a hit. BYOB is a huge plus as well (I recommend a bottle of wine per person at a minimum). Go here with people you can have fun with, and expect to be drinking with the chefs and/or rest of the restaurant before you leave.", "pics": null}}, {"review": {"des": "I have heard so much about this place and after a few times calling (since December) we finally got in.<br>Atmosphere is quaint and blah with very loud . It was 9 courses and my boyfriend and I go to a lot of tasting menus and I thought this was just ok.  I was surprised how expensive it was without any pairings. In fact, they charged us $20.00 for a bottle of Pellegrino.  I wouldn't go back here especially since Chicago has so many amazing places to eat and where you can find creative foods with wine pairings for a similar price.  Sorry Schwa but maybe you had an off night, however, with the difficulty getting a rez, mediocre food and gauging of prices, I wouldn't come back.", "pics": null}}, {"review": {"des": "Finally got to enjoy our Valentine's Day date almost a month late.  Tough reservations + coordinating a babysitter will do that.<br><br>Note: If you are visiting from out of town or can't risk having your reservation cancelled last minute you may want to go elsewhere.  We had our original reservation cancelled a few hours before we were suppose to sit down.  Apparently, that happens on a somewhat frequent basis here.  Additionally, if you in any way want ambiance or a fine dining experience you will be severally disappointed with Schwa.  It is a totally casual situation in every way except the presentation and quality of the food.<br><br>Now to that food.  Everything was excellent.  It was well presented and cooked perfectly.  There were some great flavors going on and in no way did it fell pretentious or unnecessarily complex  just for the sake of it.  My favorites were a pasta dish, the 'cheese' course and the amuse.  Additional note, the menu posted on line is not for the most part what we ended up eating.  <br><br>From a BYOB perspective, you may want to bring a red and a white and nothing that has too much of its own flavor profile.  We went with an Oregon Pinot & an easy drinking white and they were perfect.  A good Rose would probably work too.<br><br>All and all I'm glad we went but I'm not sure I would be back anytime soon.  Food quality is definitely 5 stars.  The rest, including service, is more along the 3 star line or less with the reservation situation being 1 or 2 stars.  I understand they philosophy of it being all about the food but at some level, once you reach their price point, you got to have the other elements to round out the experience.<br><br>$30+ dollars for Sparkling Water is a joke as well.  On that basis alone I wouldn't go back.", "pics": null}}, {"review": {"des": "I loved it!   Best meal I've had in Chicago.<br>The whole experience is very private and intense-- be ready.<br>I cannot comment on the reservation process since my date took care of that, and I just showed up :) .  We brought spirits for the chefs and they did us real good :)<br><br>They were playing heavy metal the night I went.<br><br>I'd go back in a heartbeat!", "pics": null}}, {"review": {"des": "Awesome experience! We had so much fun and the food was amazing! The chef was so involved and enthusiastic with the dishes and explanations. Def a  place to check out!", "pics": null}}, {"review": {"des": "Go here if you are: Cool, Open Minded, Chill, Fun, Laid Back, Alcoholic. <br>Do NOT go here if you are: Picky, Prissy, Snobby, Old, Boring, Not Hungry.<br><br>I was traveling to Chi-Town for 1 NIGHT and eating here with my cousin was my only goal for 2013.  If you've ever tried calling their phone number, you know how impossible of a mission this is.  I had 2 months, so I programmed their number in my phone and called EVERY DAY ALL DAY with no luck. Finally, the day before my flight left, the owner answered. I almost died. Proceeded with a bit of back and forth and eventually secured a 9:30pm ressy. I was also advised to bring \"at least a bottle per person\" with me. AMAZING. <br><br>To say the night was an adventure is an understatement. We literally put all eating preferences and opinions aside and told our awesome waiters that we were up for everything. This place is unlike anything you will ever experience in the foodie world. I've been to French Laundry and can honestly say I had a better time at Schwa! After hours and hours of eating...possibly 14 total courses and 2 bottles of wine later, we were the happiest kitties ever.  The chefs were very generous with their Jameson shots, so a lot of the later courses are hard to remember.  Our night ended at 12:30am standing in front of Schwa in the FREEZING cold, while Josh (one of the waiter/chef's) hailed us a cab. <br><br>Lets see, the highlights were the Quail Egg Ravioli, fish course, and all the desserts. I was blown away with how good sweetbreads and bone marrow ended up being, too. Literally everything is beautifully presented and absolutely delicious. Truly an experience and worth every unanswered phone call and effort it takes to secure a spot in this special little place. <br><br>ps- Gweneth Paltrow loves it, too.", "pics": null}}, {"review": {"des": "I have been here 4 times... First time was unbelievable...beyond creative and perfectly prepared. Every time after that Michael was not there and the food quality was very poor. It's a shame because his food is magical.  But, when prepared by other people in his absence his creations get misinterpreted. The Michelin rating is a bit curious as there is no consistency. The price is very fair but the beauty of his ideas need to be executed by him or somebody who he can rely on. Almost a rip off when he's not there.", "pics": null}}, {"review": {"des": "Dinner at Schwa is like approaching an ultra-high-maintenance girl at a bar. She's been spoiled with free drinks 1000x times by the disingenuous and now her radar's all whacked out. (ladies, use the \"like a drunk d-bag that expected me to put out\" analogy).<br><br>She is Schwa--the praise went to their heads. Now they expect tribute as norm and installed a bipolar set of tests to determine if you're worthy of dining. The rite of passage:<br>--------<br>find  ++++ to skip the hints/getting a seat advice..<br>--------<br><br>1) Calling<br>\"Is it the right time? Hope I don't get that burger king bit.\" 12-4pm on open days is best by most reports.<br><br>2) Reaching a human:<br>If it rings repeatedly, nobody's home. Straight to voicemail means slam them with calls; they're on the line. Called Wednesday, 2pm, immediate voicemail. *Redial* *Redial* Got a person.<br><br>3) The phone convo + res: <br>Have a cc ready. You're reserving at least two $110 seats. They'll want a number in case you don't show because there's a 1% chance of that. Swallow your pride and forget the 50/50 chance that they'll cancel. Remember that Schwa plays harder ball than Susan's parents in Seinfeld when they trick George into showing them his non-existent house in the Hamptons. <br><br>And don't be a turd: \"I'm available 24/7\" or \"I'll be your best friend\" will both probably get you canceled. They'll ask for a res date. I gave them two weekend evenings one month in advance. They offered multiple times both days and asked for allergies. We confirmed. \"Goodbye\"<br><br>Breathe a sigh of relief.<br><br>4) The waiting game<br>So now you have a month to wonder \"When's that dreaded call coming?\" While waiting, plan a backup that'll accommodate--not Pequods, that'll be packed--or setup a later res you can cancel if Schwa doesn't break your heart last minute. <br><br>5) The second call<br>48 hours before my res and I missed it. Was it a cancellation? My fingers fumbled. Voicemail: \"Vinny from Schwa, calling to confirm. Call me back.\" Played it cool and waited 8 minutes. <br><br>\"Schwa, this is Vinny.\"<br>\"Hey Vinny, you just called. I'm confirming my res..\"<br>\"Ok man, we got you.\"<br>\"Great Vinny. I'm bringing you guys some beer from B----. What styles do you like?\"<br>\"Ah man, you don't have to.\"<br>\"Yeah but I want to, hear you guys appreciate good stuff.\"<br>\"Uh, We'll drink anything. IPAs..\"<br>\"Sours?\"<br>\"We love sours\"<br>\"Awesome. I'll bring a few you guys have never tried.\"<br>\"Thanks man. See you.\"<br><br>6) The last 48<br>2 days to go. Keep sweating. From what I've read, they will cancel up until one hour before. With a 6pm res looming, we started celebrating at 5:10, downed a fourth cocktail, and cabbed crosstown mid rush-hour. The cabbie drove like the devil. No Hendrix' Crosstown Traffic on the radio.<br><br>7) 6:00pm, Friday, 11/15/2014. No note, door opens. We enter...<br><br>++++<br><br>Glowing but dingy from the hanging bulbs and paint combo, seedy looking red kitchen through the small window and open doorway. That's where the six cooks are. Vinny comes out, greets, and gives us choice of 2-top. We choose the heater seats by the door. <br><br>Music is not too loud. Once at capacity (7:30 on Friday), Schwa has a good buzz, like crowded (not packed) bar. If this is too loud for you, don't think of going to Aviary.<br><br>Service.. it's already been noted: not ISIS but definitely a mixed bag. Servers quoted different ingredients to different tables. Their conversation skills could use some sharpening, too unenthusiastic to explain even techniques.<br><br>Bring alcohol for them but don't sweat. My hard-to-find gifts were met with the same enthusiasm as another table's crown-royal: a monotone \"You guys are awesome.\" Again, after 1000x free drinks, it's the act of tribute they expect. Don't shower them with sought-after gifts (their job since you're paying them $100+pp)<br><br>Savory//Sweet Scorecard (out of 10):<br>8-6-9-6-4-3-5-7-8 // 9-8-10<br><br>Savory dishes varied wildly. Consistently SWEET, NOT salt. Confusing combinations:<br>- a perfectly cooked scallop smothered in allspice and white chocolate<br>- roe totally masked by gooey plantain and banana<br>- black cod and beer foam?!<br><br>Combinations ranging from questionable to bizarre, the small proteins overshadowed. Positive savory memories include <br>1) the quail egg ravioli<br>2) sweetbread mustard bites with daisy cutter IPA.<br><br>And then Schwa shifted again.. the desserts were stellar. <br>1) The chimay creme brulee is easily the best cheese course to grace my lips. Tangy and rich, fermented huckleberry supplies the acid. <br>2) The pickled watermelon and rind with unagi ice cream was one bite, a delicious marriage, bright and refreshing while sweet. <br>3) Finally came the build-your-own parsnip rootbeer float. 3D, time-sensitive, playful, and above all, tasty.<br><br>Having seen other diner's reviews/pics, I'd risk Schwa again. Current menu is weak on savory; past menus seem stronger. Desserts seem consistently great across reviews, so Schwa is 4-5* after savory improvement. Then book a res so it's at capacity (after 7:30) with hopes of the legendary shots/partying.", "pics": null}}, {"review": {"des": "We went last night and weren't impressed. First thing you notice is the vibe. Black walls with nothing on them. One little cheap-ass Home Depot light over each table. Music blasting like it was a club. I know, I know, rock-n-roll chefs, blah blah blah. Still, if you're going to do an artistic plating, people should be able to see it.<br><br>The food ran the gamut from very good to very salty. The cocktail was a Last Word and was excellent. Next was the cuddle fish. It was okay. Ravioli was good but almost anything with truffle is. Bone marrow creme brûlée was fine although there was no hint of marrow flavor. Thai popsicle I liked but my wife thought it was average. Strawberries and cream pasta was interesting. I'm not saying good or bad, just interesting. Mulligatawny was awesome and a totally original take on that soup. The pork course was so so so salty it made me wonder if anyone in the kitchen was tasting the dishes. The same for the lamb course, salty. Also with the lamb there were some flavors the didn't seem to go with the dish. Dessert had some interesting elements but even those seemed like they were out of place. Almost like they would have been interesting components on a savory dish. There were a few more courses but nothing I can remember.<br><br>The services was okay enough but the timing was off. There were long periods between dishes. <br><br>If I could sum this place in one phrase it would be \"slam you over your head experience\". No subtlety or finest here folks. I love experimental food but this place was more about cute and less about flavor. Don't believe the hype.", "pics": null}}, {"review": {"des": "Out of this world! I cannot describe how amazing the food was. ORGASMIC creations! Thank you Chefs de cuisine!", "pics": null}}, {"review": {"des": "This is fine dining at its best and least pretentious. Yes, music is loud but really, the food is what matters (so don't ask them to turn it down; they're not going to). I gotta admit, I love food and I appreciate art, but I don't have the kind of money to spend on creative avant-garde fare. It was a generous gift for my husband and I's 12th year anniversary, and what an amazing gift it was!!! From the olfactory journey -- an experiment to trick our senses with scented felt into thinking the our Bourbon is laced with almond -- to every tasty plate that looked like an abstract minimalist 3D painting (go check out the website for the featured menu) --  it was like culinary alchemy! (Oh my, even the wordy \"tasty\" seems so banal for Schwa's food. \"Ambrosial\" perhaps? Now, I'm being pretentious.) It's BYOB; just don't be a lush (note to self). Definitely will return (tax refund permitting) ;-)!!!!!", "pics": null}}, {"review": {"des": "This was my first Michelin star dinning experience, yet definitely the worst dinning experience I've ever had. The music was too loud, the service was so-so, but I will say the food was great. I read reviews before attending, and knew what to expect (for the most part) but what happened after dinner is not something I wish on anyone. <br><br>After dinner, I accidentally left my iPhone on the table. Of course I realized this after I already hopped in a cab with my husband, so we instantly called my number when our waiter answered my phone. He said, \"yes, it's here. We have it. We will keep it here for you until you get back.\" So the cab spun right around and less than 5 minutes later we were there. When we walked in, we asked about my phone, but no one seemed to know what I was talking about. I then asked our waiter who said, \"it was right here! It must have gotten lost!\" Mind you he seemed like he was under the influence of drugs the entire time he was serving us. So my husband and I searched the entire restaurant top to bottom, including the back kitchen. My phone was never to be found. Needless to say, I was devastated and will never return to this restaurant or recommend it to anyone.", "pics": null}}, {"review": {"des": "So, it wasn't horrible.... <br><br>Solid 2 stars since Meh. I've experienced better\" pretty much sums it up. Service was actually pretty good and loud rock music is to be expected, so this review is just about the food.<br><br>Quick summary - every dish was dominated by a single one-note flavor that was either too salty, sweet, or sour. Flavors did not work well together and there was always something that was overpowering and not in a good way. The balance of flavors and components was off on each dish, and this just shouldn't happen when you're paying this sort of $$$. <br><br>Not sure why Schwa has such a high rating. Maybe it was amazing back when Charlie Trotter and Alinea were the only fine dining options and Schwa provided a fancy tasting menu at a better price and in a much more relaxed atmosphere. Unfortunately, its hey day is over. Too many other amazing places of all price ranges - and definitely not up to par with other tasting menus.<br><br>More detail -<br>- Caviar shouldn't be paired with super sweet mashed plantains<br>- Foie gras doesn't go with super sweet marshmallow fluff<br>- Black cod is delicious, but when it's in a sour vinegar broth, it gets lost<br>- Lamb would be much tastier if it weren't chewy<br>- Powder in a dish might be cool the first time, but when it's in several dishes it becomes old hat really fast (if it's not old hat already)<br>- The truffle ravioli was the only tasty bite of the meal, though some might say the pasta was too al dente<br>- One of the desserts was supposedly a truffle of white chocolate and tallegio cheese. It tasted like stale cardboard and of course had to be the 1 dish that wasn't sweet", "pics": null}}, {"review": {"des": "Really wanted to love our meal as we had been ready to splurge and treat ourselves. Unfortunately, there were just too many disappointments which I can summarize into 4 categories:<br><br>1. Salt, Salt, Salt - Everything tasted the same<br><br>Explain to me how a lychee aperitif and a white chocolate bowl salad can taste salty?! Perhaps it was the overuse of floral flavours (too much rosewater?) or the flower petals on the dishes, but every bite was SO salty. I thought my blood pressure increased by 20 pts. <br><br>I don't know what the spices were but the natural flavours of the foods were non-existent. Be prepared to drink lots of water (which by the way there is a charge of $10 for). <br><br>2. No continuity between courses<br><br>I typically expect a progression of foods from lighter fare to more complex, with a climax and into dessert. This did not happen. The opening aperitif and salads were the only progressions that made sense. For example, I'm not sure how a 'breakfast themed' plate fit in - sweet french toast and an english muffin - and how a random \"fried sweet breads at the ballpark\" came into the mix. It was confusing and lacked careful, delicate thought of a person's flavour palette. <br><br>3.  Lack of Protein <br><br>We left starving. You would think after 9 courses, you would be stuffed but my belly only contained a bottle of wine.  When the dishes had protein, they were incredibly tiny and did not taste good. My oyster tasted sour and rotten. When asked about the lamb, the server was very defensive to assure us it was cooked all the way through. <br><br>4. Grotesque service - <br><br>They are not interested in chatting or describing the plates. Just want you to swallow the dish and if there is anything left over, you will get a dirty look. We had no idea how far into the meal we were (some course cards would be helpful) and the bill was slopped onto the table without a \"Thank-You / enjoy your evening.\"<br><br>From the other reviews, now I know why we had such a hard time when we asked for our extra bottle of wine back. And how we had to ask AGAIN for our wine bag.<br><br>Overall, we left Schwa feeling hungry, disappointed and a waste of money/time. It as not a good experience, because there was too much focus on presentation, and Schwa missed the mark on flavours and service.", "pics": null}}, {"review": {"des": "So much for the hype (Michelin, hard to get reservation) the experience was extremely disappointing. The only highlight was the gin amuse at the beginning of the meal and pompano fish dish (creative!). Although the beginning of the evening started with delicate and relatively safe dishes, everything else was either too salty or underwhelming and not good at all. The courses were brought out ill paced and just when we thought we cleansed our pallets with sweets, an odd corn based savory dish arrived. Glad we didn't bring that bottle of booze many reviewers recommended to bring for the chefs. We're paying for the course and tip! We shouldn't have to do that. We've been to many restaurants of similar caliber (Alinea, El Ideas) that serve greater quality and creative food without!", "pics": null}}, {"review": {"des": "I joined yelp just to say how bad my experience was. Staff is grungy and stoner looking. They don't care at all about you enjoying your meal.  Rap music was pumping so loud I couldn't talk to the person right next to me.<br><br>Hendricks jello/bubble tea. Extremely sweet. too thick to suck through the star they give you. They don't give utensils unless they deem necessary.<br><br>Rose sorbet. Ok<br><br>buttered ravioli, hard pasta and butter, im sure there was a filing but I couldn't taste it. to big to take down in one bite but you are expected to because no silverware<br><br>White chocolate salad bowl. Extremely sweet without even touching bowl. Couldn't decipher any flavor except raspberry. Every dish had tons of components but can't decipher any of them. <br><br>sweetbreads. mustard, mustard seeds, mustard tuille, mustard frills. Guess what, it tastes like mustard. and nothing else. sweet breads were undiscernsble under the heavy breading.<br><br>smoked fish. les than an ounce of meat. three times as much canned hearts of palm and two over bearing sauces.<br><br>lamb. 2 oz of meat<br><br>cheese course. Bruleed to the point of so bitter I couldn't eat it<br><br>rootbeer over powering sasafrass, gave us in two parts but didn't explain not to eat the first part yet<br><br>I was going to wall out in the middle but my friend convinced me not to.<br><br>watermelon dessert, raw watermelon, not even ripe, no silverware<br><br>DON'T GO HERE!!!!!!", "pics": null}}, {"review": {"des": "Ok, there is no bones about it....this restaurant has officially made me reconsider Kate Moss's quote...\"Nothing tastes as good as skinny feels.\"<br><br>I got lucky and was able to get through and make a reservation for a Tuesday night.  We got there and its very similar set up to Bonsoiree....there is no where to go if the table is not ready.  So we went to a bar down the street and they called us when they were ready.  They were very apologetic about running late and totally made it up to us in food, etc.  <br><br>The pics that are posted on here capture every morsel of food.  PHENOMENAL!!!!  The thing is....if you are pretentious, this probably isnt the place for you.  They are real guys that are phenomenal cooks and have their own style...PERIOD!   LOVED IT!!!!!  I cant wait to go back.  Plus, the BYOB option makes it totally reasonable in price.", "pics": null}}, {"review": {"des": "I had such an excellent dining experience coming to Schwa. I came here to celebrate my boyfriends birthday. He has no dietary restrictions however I am a vegetarian, Schwa was incredibly accommodating and the alterations made to my food did not impede the divinity of what I ate. I appreciate the ambiance & environment brought by the restaurant and chefs. I ate some things and combinations of things that I have never tasted before, but many dishes shined. I would happily return again.", "pics": null}}, {"review": {"des": "Schwa is the most polarizing restaurant in the city, but its one you have to try.<br><br>Let's get this out of the way.  Book several different reservations because you will get canceled on. It happened to me, I cursed them and didn't come back for almost 3 years.  Boy was I dumb.  Schwa canceling is just part of the experience, whether its a week before or as your walk in the door if they haven't done it to you, you haven't arrived. Have back up reservations in hand if coming here for a special occasion.<br><br>The food is outstanding, but I'd say it borders on junk food gastro fair. Nothing is healthy but it tastes great.  For example you might start with butter soda pop and nachos.  The service is comical as the chefs serve you, banter with you, make fun of you and drink your alcohol.  Every dish is playful, tasty and for the price its the best deal of a tasting menu in town. <br><br>Stop giving this place a 1 star for canceling, you knows its going to happen, so either don't come here or plan accordingly.", "pics": null}}, {"review": {"des": "Forget the 70+ calls to get the reservation experience.  You walk in, the chef and his crew will take care of you.  Nicest, most unpretentious staff I've ever encountered.  Food was beautifully presented and frankly, I felt like I took advantage of the restaurant when they serve us a gazillion courses of amazing food for $110pp.  Most memorable dishes were the Thai curry soup pudding in a petri dish and the salmon and grapefruit strewn all over my plate with all the condiments.  Would definitely go back anytime.<br><br>Try to get some nice beers ahead of time for the staff as the only liquor store we found there was a Hispanic grocery store.  Not good choices.", "pics": null}}, {"review": {"des": "As much as I eat at Chicago restaurants, I should be writing more reviews. After visiting Schwa last night I am compelled to write a review. Having read both positives and negative about this place, I frankly had no expectation. All I knew was that one way or the other, this would an interesting experience. And it surely was.. and some. The front of the restaurant is non-descript, dark. Almost as if it is a shutterred place. But once in you are transported to a different world.. Funky, gritty, groovy.. U pick your adjective. The focus is the food and it was delectable. Each course was well thought out, inventive, clever and ultimately delicious. That grape jelly dish mid course is still lingering on my taste buds. This was a Michelin star experience without the fuss and if I may say pretension. A special word about the servers because I had read mixed things about this aspect. One word to describe my experience with them: delightful. It was one of the most memorable and interactive dining experiences I have had in a while. Each one of them had different personalities but they were all welcoming, funny, warm, playful. And as long as you had a good attitude they obliged. And if you wanted to be left alone that was fine too. So a big shout out to the team at Schwa. You are all fantastic! I did not get the names of most of them but one-Josh: Rock on brother!. <br>We are lucky to have a restaurant of this caliber in Chicago. I wish them all the best. And I cannot wait to return.", "pics": null}}, {"review": {"des": "Dining at Schwa feels like you're in with the band.  I flew to Chicago for 24 hours simply to dine here. It was the most memorable dinner I have yet to experience.  Dinner at Schwa isn't simply just a meal, it's entertainment.  The tasting menu is so engaging and the kitchen staff so confidently cool.  Will fly back again just to eat here- worth the effort!", "pics": null}}, {"review": {"des": "Came here for the first time after hearing about it from a friend. It was pretty much what I expected and, for the most part, worth the splurge. Food was amazing (it better be for the $160+ a pop!) and I was very impressed with the quality and creativity of every course. If you're interested in molecular gastronomy but don't want to spring for Alinea, it's definitely a good place to go.<br><br>Really liked the laid-back ambience - I hate feeling like my money is going towards weird art on the walls. I wouldn't have minded if it was a little less casual though. I mean, if I'm dishing out $330 for a single meal, I'm not going to show up in jeans and a tshirt (which most of the other diners did). But I guess you can't fault the establishment for how other diners are dressed.<br><br>My only complaint was the price. I mean, yes, I knew it was going to be pricey. But their (not up-to-date) menu online currently says $110 per person plus a $2.50 corkage fee. When we got the bill, it was $240 for two - no explanation as to where the extra $15 came from. This including tax came to $275 before tip. I mean, I'm not about to nitpick over $15 when I just dropped $300+ on a meal, but I'd have liked some advance notice if they'd upped the price. If not...well then I guess we got ripped off? My advice would be to confirm the price ahead of time because I definitely walked away feeling a little uneasy about the unexpected surcharge.", "pics": null}}, {"review": {"des": "Had a reservation, I arrived to see a scribbled note taped on the front door saying that they were not open for business that particular night.  No heads up no anything.   My one star review is not a review of anything other than their flakey business practices.   They could have easily called, they would be upset with me if I flaked on them.", "pics": null}}, {"review": {"des": "The food was beyond perfection. The quail egg ravioli was my personal favorite. All of the chefs were friendly, personable, and professional. Joshua took great care of us! Would absolutely recommend!", "pics": null}}, {"review": {"des": "This review has been a long time coming. Maybe because it's taken this long to get over the hangover of Schwa. The dinner was back in December and it was the most memorable meal I have had in a very long time.<br><br>First and foremost, you know what you're getting yourself into when you try to snag a table at Schwa and when you're dining there. Presumably, you've done research (Yelp, food blogs, internet), you've read and heard the stories of Chef Michael Carlson, and you know they do things on their own terms. So why all the 1-2 star reviews whining about reservations cancelled several hours before the scheduled time, about why it's so difficult to get a person on the phone to get a reservation, about why the music is so loud while you're dining? To those I say, you should have done your homework before even booking at Schwa. Your results are your own fault.<br><br>Now back to your regularly scheduled review. From the outside it looks like a deserted building. No welcoming lights illuminating. Graffiti on the building. Windows shuttered. You almost question yourself before peeling back the black outer door to reveal another door leading to the restaurant. Upon entering, music is blaring and Seth immediately comes and asks if we have reservations. I say we do and hand him a 6 pack of beer for the kitchen crew. We also brought along a bottle of  red wine to drink along with our meal. Now onto the courses:<br><br>Amuse: Cherry covered chocolate sitting in a Red Hook cocktail<br><br>1st Course: Peekytoe crab, guava, asparagus, pink peppercorns<br><br>2nd Course: Baked potato soup, potato skins, bacon, cheddar, sour cream<br><br>Additional Course: Chef Carlson's signature quail egg yolk raviolo, brown butter-truffle oil sauce, parmigiano reggiano shaving<br><br>3rd Course: Tortelloni, crab apple, celery, shaved black truffle<br><br>4th Course: Steelhead roe, passionfruit, violet<br><br>5th Course: Salmon, grapefruit, pink lemonade<br><br>Additional Course: Turmeric root ice cream w/ mustard caramel<br><br>Additional Course: Seared scallop, cocoa nibs, brioche, curry, apricot<br><br>6th Course: Rabbit, strawberry, bread pudding, honey<br><br>7th Course: Lamb, blueberry, cashew, mushroom<br><br>Cheese Course: Pretzel gougere filled with Chimay cheese, Chimay beer foam, mustard \"skin\"<br><br>Additional Course: Gooseberry covered in white chocolate nestled in lavender foam<br><br>Dessert Course: \"Dr. Pepper and whiskey on a plate\", Dr. Pepper gummy, whiskey ice cream, vanilla bubbles, paired with a glass of Dr. Pepper<br><br>As you can see the $110 9-course meal can easily turn into more with the kitchen's generosity. There also were free glasses of Malbec given to us just because. Every course was original, amazing, playful, whimsical, and all fun. You have to be open-minded when dining at Schwa. When dining at Schwa you don't feel like you're in a restaurant but you're invited into Chef Carlson's home where he and his crew are cooking AND serving the food. Everyone is having a good time and enjoying the atmosphere. That's how it was and it was the most unique and laid back dining experiences I've ever had. If I will be lucky enough to snag a reservation again, I will definitely be back.", "pics": null}}, {"review": {"des": "I don't remember anything about the food (except that it was delicious). I'm not a very heavy drinker so just brought a single bomber to split: the friendly staff found this totally unacceptable, so brought me and my companion booze from their own stash to drink with every course. I drank far too much but it was such a fun night. We weren't charged for the copious amount of booze they provided us, but we did tip very generously. I want very badly to go back someday.", "pics": null}}]}