{"name": "scofflaw-chicago", "reviews": [{"review": {"des": "This is such a great place to get brunch on weekends! The atmosphere is great and they have plenty of board games on hand if that's your thing. Definitely try the Bloody Mary fries-- the term \"fries\" may be misleading because they're actually breakfast potatoes, but they are incredible.", "pics": null}}, {"review": {"des": "This place was my favorite cocktail bar 3 years ago when I lived in Chicago. They had really strong, boozy, flavorful drinks and an outrageously cheap price. I think the cost of drinks went up like $5( if i recall correctly). The place has a bar, tables and a comfy sofa section. <br>This time around I got the Alton benes which was a rum based cocktail with gochujang(spicy korean red pepper paste). It was very good with a kick.<br>The guys got the other limits which had gin, vermouth, amaro... they said it tasted too cough syrupy. My cousin got the old fashioned 75 and enjoyed it. They rotate the cocktail menu every 3 months. They have fantastic fries btw and this is coming from a person who never orders fries.", "pics": null}}, {"review": {"des": "i order a cider<br>burguer and fries<br>service was on point<br>burguer was saltythey also had house made hot sauce was delicious<br>see you soon<br>i will try a salad", "pics": null}}, {"review": {"des": "Dcofflaw is the second generation of the \"specialized\" craft cocktail craze, where they focused on one liquor. From day 1, their emphasis was gin drinks. Although this may not be your flavor, don't shy away, since they have a nice selection of beers, wine, and spirits. <br>These kids have now been around the block, but definitely a new place for those that didn't realize  that the city went west of Damen ave. <br>Whatever your mood, pop in here", "pics": null}}, {"review": {"des": "Stopped by Scofflaw for a nightcap Saturday night and the place did not disappoint.  It's very warm and inviting inside the bar with cozy fire places and vintage Victorian style furnitures situated around the room. It was a perfect atmosphere to be able to relax and have nice conversation without having to scream over loud music.<br>Since I'm pregnant, I asked the bartender whip me up a mocktail. It was light and refreshing just the way I like it. Our group also ordered First Flower,  In Burma and Elmside Circle which they enjoyed.  Will be coming back when I'm able to enjoy a cocktail or two again.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/qiFz_Qd3a5KIdpRruNpxOQ/348s.jpg", "caption": "No name mocktail they made for me"}]}}, {"review": {"des": "While Scofflaw is known for their creative cocktails and night scene -- my experience was during the day for one of the loveliest brunches I've had in the city. <br><br>The brunch here appears to be truly underrated -- there were only a couple of other people in the restaurant on an early Saturday afternoon. The food was inexpensive and delicious -- salmon toast and pepper jack hash browns for $15 (though I'll admit it was a weird combination of plates that I ordered). <br><br>Fleet Foxes and chill vibes abounded. It is truly a lovely place.", "pics": null}}, {"review": {"des": "My only regret during my visit to Scofflaw is that I did not bring my phone with me to the ladies room. Honestly, it is the most beautiful, fragrant public restroom I have ever visited! <br><br>Bathroom love and missed photo opportunity aside, I spent 45 minutes at the bar enjoying a cocktail and appetizer during our wait for a table at another popular area eatery and the experience was quite memorable. <br><br>The gin bar has something for everyone, including this self proclaimed featherweight who prefers sweet, low alcoholic content beverages (if at all). If I were not sitting at the bar, I doubt I would have ordered a drink, but I am really glad that I did. First, the mixologists are perfectionist and super friendly in a hipster sort of way. Watching the drink preparation was a treat in and of itself. Then, the drink looked JUST LIKE its picture! But, it was in no way as sweet as it looked. One was without a doubt my limit. <br><br>The fries were not my idea but a great decision. I needed something on my stomach before finishing my cute cocktail that packed much punch. And they were very good. <br><br>Gin based cocktails in a dark, hip and chill corner bar. This is what you will find along with a guy asking for picture identification at the door. If in the area, I would definitely return. Definitely worth visiting.", "pics": null}}, {"review": {"des": "A very cook Logan Square cocktail bar. This is definitely more of a sit-down place, and apparently the burgers are great here. The drinks were honestly frightening with the amount of unknown ingredients, but I guess that is what craft cocktails are made of. I went with a simple tequila soda, and enjoyed the company and dim romantic ambiance. Very cute bathroom too!", "pics": null}}, {"review": {"des": "Quiet little pub, located right at the corner of Armitage and Kedzie, good beer and cocktail list, don't believe there's any food, no TVs, the lighting is dim, so if you're looking for a quiet peaceful spot for a drink this would be for you. The inside decor is also cool, going more for an old timey speak easy feel (at least I think that's what it is I could be way off lol)", "pics": null}}, {"review": {"des": "I enjoy the occasional gin cocktail, and Scofflaw provides that as well is down the street from me which is a bonus I suppose. I think the decor is a bit much, the bar service and cocktails to be \"meh,\" and every time I've been there it is close to impossible to find a seat unless I come during an odd hour which is generally my game plan. I mean, there are so many cocktail bars in Logan Square that is seems moronic to ever stand outside in a line to get a cocktail. The cocktails are good, no complaints other than I wise I knew what half the ingredients were but that sounds more so like a 'me' problem, lol. <br><br>I miiiight be biased though because I LOVED Streetside cafe, which was the establishment that was in this location prior to Scofflaw. <br><br>It is what it is, a fancy, pricey cocktail bar.", "pics": null}}, {"review": {"des": "I left feeling confused about this place. If you go around the bar there is a small lounge room with couches, small tables and a fireplace. Bar area seemed to be very crowded, I was glad that we found a seat on one of those couches. <br><br>Cons: The burger that I ordered looked very appetizing but the meat patty was completely burned. Our fries looked like they were seating out for a couple of hours before they were served to us. The first drink that I ordered had so much ice on it that there were barely any liquor in that glass (Air Swizzle). The waitresses kept checking on us every 3 minutes (I kid you not), this was super annoying. <br><br>Pros: This is a great place for a first date or a date in general. It is very romantic: dimmed lights, fireplace, not too loud so you can have a conversation where you don't have to shout at each other. I absolutely loved the second drink that I got (Hot Buttered Rum), it was a perfect drink for the cold weather outside that fit perfectly with the rest of the ambience. I might come back just for this drink. <br><br>All in all this is a nice place for some cocktails and people watching but definitely not for the food.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/fVD_mHnZbOtryH51Q1BTQA/168s.jpg", "caption": "Hot Buttered Rum (Yum!!!)"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/t6BlCKE7bUlRzW5gSHCu2Q/168s.jpg", "caption": "Burger and Air Swizzle #23"}]}}, {"review": {"des": "Swung by here on the way home after ramen in the frigid Chicago visit.  Wanted something hot and they had hot toddies and hot buttered rum on the menu.  This place was originally known for their gin selection and cocktails, but has opened up to all spirits and types of cocktails.<br><br>Hot buttered rum was money.  Very busy on a Saturday night but service was still good.  Good for date night", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/F9Syznu_x_zmh558SD-eFg/348s.jpg", "caption": "Hot buttered rum!"}]}}, {"review": {"des": "Good brunch. Really good cocktails. The evening crowd tends to pack the place out fast, so I've settled for early brunch setting instead. While there is nothing fancy about the brunch menu, the items on it are definitely worth trying out. I sat at the bar and got a chance to chat with the bartenders who actually explained what was in the cocktails that I ordered. Oh, I ordered \"off menu,\" so it was helpful to get details about what was in the drinks.<br><br>Those who are interior fanatics may love the old feel of the restaurant, given it's also cozy. As for me, the food and beverage are enough to keep me coming back. My attention is always on my plate and glass anyway. Scofflaw is on my recommended list, for true.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/0F9RAPtEOCTBIZUVvjeYfw/348s.jpg", "caption": "Rum Toddy"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/6okrtQipxSAznA8psbqz7Q/168s.jpg", "caption": "Wassail"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/SintvAGxTQDhub_tO_Eh1g/168s.jpg", "caption": "Simple Breakfast"}]}}, {"review": {"des": "These cocktails were my ideal - not to sweet and with an ingredient you can't quite put your finger on. Pictured: Gin Toddy (a little on the sweeter side but perfect for a cold evening) and a special seasonal menu drink I can't quite remember the name of (Charlatan or Cartagena something). The latter had an extremely Smokey flavor and was HUGE compared to the other tinier cocktail offerings. This is the place to be on a cool fall or winter evening to snuggle up with friends or date!", "pics": null}}, {"review": {"des": "We stopped in to buy a sought after bottle of their house-made gin, and ended up staying longer than expected, trying local beers and destroying a whole Charcuterie Plate. Cozy intimate setting on a really grey Sunday evening", "pics": null}}, {"review": {"des": "We came by for drinks after dinner across the street. It was packed on a Saturday night. Make sure to walk past the main bar to the back and you will find a more spacious area on the right. We luckily were able to snag some seats as another group left after hanging around for 5-10 minutes. They have dainty, yet comfy couches to lounge in that are set around coffee tables. I had the first flower, anything with egg white immediately attracts me. It was light and frothy, just how I like it. Everyone else enjoyed their cocktails and they are also willing to whip up special mocktails, if needed. The place is dim and the noise level is not obnoxiously loud. Scofflaw's atmosphere would be perfect for a date night or just to simply get a well-made drink and enjoy your evening.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Yp-xS8VHZMC-4iEJ_mP3LA/348s.jpg", "caption": "first flower"}]}}, {"review": {"des": "After reading about the infamous hot buttered rum drink via Tasting Table, I could not wait to get my hands on one as I am a HUGE Harry Potter fan and absolutely love my butter beer at Universal Studios. Scofflaws menu looked so good, but unfortunately, we had already dined and were just there for drinks. We arrived to a packed house on a Saturday around 9:00pm. Every single seat was taken, but just as we followed the roaring fire around the corner, we spotted a table paying their tab and after a discreet inquiry, we were seated within 10 minutes! <br><br>The only special drinks in our group was the hot buttered rum and their daily punch. I can not say enough amazing things about the hot buttered rum accept if not for the calories I was envisioning, I would have had 3. Ditto for the daily punch, I shared 2 with my fiancee and we loved it. I have always been a huge ice cream sandwich fan and couldn't resist ordering one. I have to say that it was not my favorite as the cookie was burnt and that's the worst next to burnt popcorn. For those of you that don't know, at midnight, they offer free baked chocolate chip cookies and if you are a cookie monster like me, I hope they are warm, tasty, and not burnt.<br>The waitstaff was great and so was the atmosphere. I am definitely looking forward to coming back for dinner and brunch.", "pics": null}}, {"review": {"des": "Even though I'm not a huge gin fan, the drinks were delicious and the interior was cute. Even on a summer Friday night you could talk to your friends. Only ate the French fries but I highly recommend!", "pics": null}}, {"review": {"des": "Scofflaw has an amazing gin selection, but I didn't notice until after I ordered a glass of wine, as the gin menu is the last of 4 pages. My Sangiovese was only ok. Husband got the Summer Collins which was refreshing but not very ginny.<br><br>We ordered hashbrowns with jack pepper cheese to share, thinking it would be an interesting gastropub dish. It was just hashbrowns, and sadly not cooked or seasoned evenly... decided not to order more food.<br><br>After finding the page of gins, decently priced, we shared a slightly dirty martini with barrel-aged Bluecoat gin. This was nice, and came with 3 olives, as a good dirty martini should.<br><br>Scofflaw is a Pokemon Go gym, in case that's a perk for some of you. We took it over while waiting for the first round. Cheers, Team Instinct! ;)", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/E9o5gPKjmS-MTKNAcBrsyw/348s.jpg", "caption": "Hashbrowns with pepper jack"}]}}, {"review": {"des": "Five doinkies. <br><br>This place is just around the corner and I walk by it all the time but rarely hang out because I'm an alcoholic with multiple kids from different marriages. Bring some friends to the bar if you want a fancy gin cocktail from their expansive rotating menu, which includes a helpful glossary for mixology plebeians (pro tip: if you're feeling stumped, they have a sub-glossary for their glossary, but don't be surprised if you're SCOFFed at ((lmao)) by the individuals with more sophisticated palates). <br><br>Out on the town with a special someone? Head to the other side after requesting the Romantic Evening, as it will surely aid you in wooing. In order to be accommodated, you will have to whisper \"Victorian furniture\" sweetly into the ear of the bearded bouncer upon entry but ONLY while he is pretending to read his book. I highly recommend asking for Hadley if you want to experience the fullest expression of Scofflaw sensuality *cartoon dog voice* woof woof <br><br>They have mäłört on tap and true Chicagoans love that stuff so if you want to impress everyone and be cool you have to drink it even though it's literally garbage water. Also, the apartment above is tight as hell honestly who lives there may I come peep??? I demand that management acquires it and makes it into a speakeasy naming it \"Logan Square Conservatory\"<br><br>I've now hit the character count required for yelp to consider my review \"epic\" so I will be signing off. Please subscribe to my page for more quality content and tips on the best local spots. God bless you", "pics": null}}, {"review": {"des": "I love the name of the place, I love the ambiance, and I really love its focus on gin in a world where whiskies seem to be the common trend. It's definitely a bit refreshing when compared with the other small, intimate, trendy, cocktail bars.<br><br>I got the \"Red Snapper\" which is their version of a gin bloody and it was flavorful, spicy, and went down quite nicely.  I also tried their bloody which was just as smooth and delicious.  And, honestly, from a drink perspective this place is great!<br><br>The food, however, was a little lackluster.  During my visit I got the fried pickles, and they were decent but nothing particularly amazing and the portion was rather small.  I also got the Chef's Board of five cheeses and five meats.  But, it wasn't really a \"Chef's Board\" so much as \"everything on the menu.\"  This naming convention isn't a huge deal but the name definitely invoked an idea of getting a chef's choice, not just all the items they have listed.  Beyond that though, the cheeses weren't particularly notable and the meats were kind of meh. I definitely would have loved a more adventurous board to go along with the interesting drinks.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/aovrSlszCrk_JcOgHHmwQw/168s.jpg", "caption": "Chef's board."}]}}, {"review": {"des": "Came to the bar for a birthday celebration of a dear friend of mine, and I must say I was disappointed overall. From the service of the joint to the drink selection itself. I also wasn't fond of the music or the seating arrangement either. Being there for a little over 30mins seemed to be too much due to the standing and constantly being pushed from side to side back and forth between the the bar and door way. Anyway this was a dive bar that doesn't have any room to be a lounge atmosphere.", "pics": null}}, {"review": {"des": "Let me start by saying that this place is very small. I really like the ambience it's a cool chill vibe. I ordered a kale salad which was delicious. I also ordered fries, I absolutely love fries and Scofflaw did a great job with their fries and the aioli dipping sauce.  The dressing used was great! I also ordered a cocktail called the standby. It was very refreshing with a mint flavor.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/gwVQ2c9G2TxtoTV4wf91hg/168s.jpg", "caption": "French fries w/ aioli"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/e0NPRJ2zvQfgNDwaVK5QAg/168s.jpg", "caption": "Kale Salad"}]}}, {"review": {"des": "Unfortunately Scofflaw was a huge disappointment on the cocktail front. However, I really liked the cute Victorian-style atmosphere with attentive servers.. so I guess it's not a complete fail.<br><br>First of Four 3/5 - nothing too special, quite refreshing, one of the better ones of the night<br>Utopian Coast 3/5 - my date liked this one.. I'll refrain from commenting because I'm impartial to rye<br>Sundial 0/5 - this might've been the worst cocktail I have ever had. It tasted like cough medicine. I couldn't taste any of the individual flavors/ingredients. Who made this? Did they screw it up this one time? We basically took this as a shot.<br><br>As other reviewers have mentioned, they come around at midnight with freshly baked cookies. The cookies are clearly not made by someone who knows how to bake... but I shouldn't complain cause they were still soft and most importantly, free.<br><br>I really love gin cocktails but somehow Scofflaw managed to disappoint me with every single concoction.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/x94re34AtlwdHDxxbAomiQ/168s.jpg", "caption": "Cocktail menu"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/dHEcBrtme_ViOcS136wvQQ/168s.jpg", "caption": "Super soft cookies they bring out at midnight!"}]}}, {"review": {"des": "Quaint place. Wasn't overly loud and could actually enjoy a conversation with friends. Good drink selection. <br>The best part about this place is the FREE Chocolate Chip cookie.", "pics": null}}, {"review": {"des": "Scofflaw, yes, we all know you as a tasty, trendy cocktail bar, but who would have thought that you have an awesome brunch burger that I would absolutely rush back for?!? Not me! <br><br>Seriously, this burger was on point. Buttery bun - check! Good meat to bun ratio - check! Egg and bacon - check, check! This burger was everything I hope, dream and wish for in a burger! <br><br>I really enjoyed our brunch experience! It was bright, sunny and not nearly as crowded as it is in the evening. They have patio seating, but it's nice to lounge on the couches indoor. <br><br>An under the radar brunch location, that I will now recommend!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Xjqr5_MShinVbDTc0gFaJQ/168s.jpg", "caption": "Burger with egg AND bacon"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/1MK2EhHqxt7_pW3hHwWrcg/168s.jpg", "caption": "Inside during the day. They're open for brunch!"}]}}, {"review": {"des": "I'm giving four stars for now because I have only sat at the bar and I only ordered two things. First of all, this place is tiny, but awesome. It's dark, it's trendy, it's a great place to catch up with friends. <br><br>The cocktails are an amazing price, considering you are in the city. I ordered one cocktail and shared a basket of fries with my friends. The fries and aioli were delicious! My cocktail was crafted wonderfully, and yes, the drinks are strong. Service was just fine, especially since it was so busy on the weekend. <br><br>We were able to grab the last couple seats at the bar. I will definitely come here to try some more food, and will sit at a table (if there is any room) next time.", "pics": null}}, {"review": {"des": "This place gets PACKED! The decor is gorgeous and the drinks are fantastic. But, let's be real, the true reason for coming here is for those mouth watering chocolate chip cookies that they pass out at midnight. Who is with me??", "pics": null}}, {"review": {"des": "Charming place with great cocktails. Talented bartenders make the inventive drinks and are helpful when needing a bit of guidance. Went post brunch for a drink and we tried almost everything on the menu. <br><br>Definitely worth going for great craft cocktails. The food looked tasty so I will for sure be back!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/3FBcgSQfPlE3E4RRWOrK9w/348s.jpg", "caption": "Kind of like a hurricane...but fancier"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/KcahkLgoC_dG0R-c-9fq-A/168s.jpg", "caption": "Tasty!!"}]}}, {"review": {"des": "It has taken me too long to post this!  What a lovely spot to dine and drink.  I went on a Friday evening around 6:30 pm and snagged a table.  The waiters were very friendly and attentive.  <br><br>Food: we ordered two charcuterie plates, Kale Salad, the Burger, Fries and Aioli,  and Bologna Sandwich.  I cannot rave enough about this food.  The Burger is probably second best only to Au Cheval...  I don't necessarily think it can compare.  I was delightfully surprised by the flavors (caramelized onions, special sauce).  It was a delicious burger in its own right. The kale salad was delicious as well and the charcuterie plates were amazing. I'm at a loss for words the food was simply spectacular.  <br><br>Drinks: we ordered the Air swizzle #23, Jacuzzi Frost and Whitehall Garden.  I liked the Air swizzle #23, the gin and bitters were lovely, but I found the lemon dominated the drink.  The Jacuzzi Frost had a wonderful smokey and complex flavor from the sesame oil.  I would've loved that one if I hadn't read the ingredients first.  The Whitehall Garden was delicious as well, I think this was my undisputed favorite since it took me far away from Chicago winters. Excellent tropical notes, I just wish it had Gin in it because I love my Gin.", "pics": null}}, {"review": {"des": "If you live in Logan Square, you've probably been here or have thought about going here. This place always has people even during the day. With that said, after passing by this place a million times, I finally gave this place a go at night. <br><br>The interior is dimly lit, which creates a nice ambiance. There is obviously a bar, closely spaced tables and a sort of sofa area. The waitress is very nice and will take the time to describe the drinks for you. <br><br>Sincerely, after a few drinks, I don't remember the names of the drinks, but they were all good. However, I did expect more out of them considering how busy they always are; I've had better drinks elsewhere. FYI..they give out cookies and they're damn good!", "pics": null}}, {"review": {"des": "I love Scofflaw. Always satisfied whenever we go here. Their drink menu is always changing and always delicious. Out of all the time I have come here, I have never disliked my cocktail.<br>You cannot go wrong with the atmosphere either. The mismatched chairs, couches, and tables with the dim mood lighting give it a antiqued and classy feel. You have to wait to snag a table when someone else leaves, but I have always been able to get a table while I stand and enjoy my first cocktail, even with a larger group.<br>The food is also great. I love their burger and you can order a special sandwich, which isn't on the menu called the guapo (not sure of spelling since its not on the menu) but it has basically all of the menu items piled on to one sandwich. It is a must try! Also some outdoor seating in the summer!", "pics": null}}, {"review": {"des": "After attending a very cool underground art fair nearby, we were famished, Yelp mobile to the rescue (again!). Enter Scofflaw, nearby, accessible and just oozing atmosphere. As soon as you walk in you're like \"Oh, Yes!\" The bar area is a magnificent greeting upon entrance and the friendliness of the staff was notable. <br>We found a cozy little spot near one of the fire places and settled in to order. Our space consisted of a love seat and an easy chair with a ornate table between us. Feeling the room, I opted to share the love seat with my love and it was wonderful. The folks nearby were close enough for comfort but not too close to be crowded, so as Goldilocks would say 'just right.'<br>The drink menu had many tempting options but upon noting Malort on tap, I knew this was my moment. I have heard and read much about the ominous Malort and knew my time to experience this rite of passage had arrived. <br>The Malort shot was $3 and came in the cutest little sipper glass. Yes I did say sip. I resisted the urge to throw the shot back like many do and cringe. No my friends, this was a time to relish; and relish I did. I nursed that shot the entire time we were there. Of course having a nice bottle of water available at your table also helped ;) It is definitely bitter and leans towards the grapefruit side. The upside of Malort, if you are on a budget, you can save money on your bar bill because there is no way you are drinking this beverage fast unless your aim is to throw them back intentionally. <br>Apparently that was the girl at the table next to us. She was wasted on Malort. Annoyingly so, a bit garish given the room and she also almost took out their entire table when she got up to leave. Ultimately she ended up horizontal on half her group until they managed to shuffle themselves outside. So perhaps Malort on tap can also be considered a red flag?<br>The rest of the room was as you would expect, lovely people gathering to chat, discuss, spend time together and have a lovely time, this was more the norm. <br>My wife opted for a cider that was so fine, it almost passed for a lovely dry wine. <br>The food menu is on the lean side but does a good job of catering to different tastes in short form. The most tempting item on there is the charcuterie chef's choice at $38, a savings considering if you ordered the same amount it would be $50. <br>After some waffling, we opted for the half chicken platter. When it comes out, it is literally on a platter and the presentation is conducive the overall vibe of the room. The chicken itself was good. I prefer my fries crispy, so I found theirs to be more on the meaty/fat side. <br>All the fires were active, all the spaces were conducive, the service was very friendly, and the room was decorated for the holidays. <br>When in the area again, I would definitely stop in again, even if only to spend some time to soak up the vibe with a choice beverage. <br>This venue choice is best to impress, whether it be a date, friends or family. I can also see it being a wonderful venue to host your event. <br>Scofflaw is what we all wish our parlors, receiving rooms, or basement bars were like at home.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/5ewsq7WnkaQGkzFU6JqB7A/348s.jpg", "caption": "Gorgeous bar area"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/fWc6AOLL2JzWAOyuXi06AQ/168s.jpg", "caption": "1/2 chicken dinner"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/vZ8lXG8b09ScmXPlf97yPw/168s.jpg", "caption": "Come for the atmosphere, stay for the atmosphere"}]}}, {"review": {"des": "This is my kinda bar - a sit down spot, cute furniture/ambiance, good music, inventive cocktails, and free cookies at midnight. It helps that it's a block from my apartment. The cocktails aren't the best I've ever had but try enough of them and you'll find a showstopper. I appreciate that they completely overhaul the menu with the seasons so you certainly don't have to get the same thing every time.", "pics": null}}, {"review": {"des": "Wandered in here one evening in search of delicious French fries, and Scofflaw lived up to its reputation. The aioli that came with the fries was magical, and I will definitely be ordering it again. I am a huge fan of the Malort on tap as well as the absence of TVs. The bartenders were a little surly; the aloof hipster thing really does get old. Would recommend this place to anyone visiting Logan Square.", "pics": null}}, {"review": {"des": "This place has been on my list to try for awhile, and it did not disappoint!! Their drinks are super tasty, creative, and strong. So, apparently their burgers are super good-when I hear about scofflaw people normally talk about their awesome drinks. I was wrong- besides their amazing drinks, their food is outstanding, especially their cheeseburger, it's def one of my top 5 favorite burgers!! Check this place out! If you make it til midnight, they serve a tray of freshly baked cookies", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Kbq5uijSBycxtjia1lC4HA/168s.jpg", "caption": "Yummyyy"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/EpGsnXOIB3nWYrAjSFXOTg/168s.jpg", "caption": "Best burger ever!! It won't disappoint"}]}}, {"review": {"des": "Scofflaw is a phenomenal cocktail lounge with a penchant for gin. The ambience is a great mix of neighborhood local hang out and high-end speakeasy. The bartenders are super kind, knowledgeable and consistently go out of their way to make your experience great. I'll be right up front about why I didn't give this amazing place five stars - not a deep enough cocktail list. While the cocktails are inventive and very delicious, for a place that focused on gin there weren't enough gin heavy cocktails where it was the real star of the drink.<br><br>Both my drinks were executed with stellar precision and unique peculiarity. I ordered a side of fries which were freaking delicious. My bartender was particularly amazing. He even poured me a taster of a liquor I had never had before so I could pick it out more clearly in the cocktail. Well done! <br><br>If you are in for a local treat and some really awesome drinks with a unique twist, get down here!!!!", "pics": null}}, {"review": {"des": "Scofflaw, you move to the front of the list for one of my favorite cocktail bars in Chicago.<br><br>Several craft cocktails on the menu. There is something for every type drinker on there. I prefer gin and/or vodka infused drinks, just my preference. It was summer time Chicago, super breezy in there, perfect for some light bites and cocktails. We had the Chicken Pate served with Cornichons, jam and bread. We also ordered this fresh summer Bucatini that came with edamame and fresh veggies (which BTW was the highlight of our meal). The sauce was light and fresh and wasn't overpowering. The simple fresh flavors of the bucatini dish complemented each other well. I am guessing they get creative with their menu because my friend, a repeat customer, was hoping to get a pot roast dish that was no longer being served. These are light bites so lets not go in here expecting a heaping handful of food. The prices are congruent with the lighter fare deal. <br><br>The drinks were artfully crafted and I had a nice weekday buzz going. The service was great but I wish they were a bit more attentive to what I needed since i basically had to flag the girl down for everything i needed. The prices arent bad at all and its very easy to get to via public transport and parking is plentiful on the street.", "pics": null}}, {"review": {"des": "There are a lot of good things going for this place. And I've had some very good experiences here. That being said, bad staff can ruin a place. To put things mildly, there isn't much worse than a bartender insulting you to your face while he thinks that you aren't smart enough to realize that he is crapping all over you. <br><br>Some basic things that can use fixing<br><br>1) if it's 5:30 and there are 4 people in the place and I ask if I can order some food it's not cool to say \"wait a second\", then go to cut lemons, then go bs with the waitress who has no tables, and then come back 7 minutes to take my order.<br><br>2) if you screw up the order and I don't make a big deal about it don't tell me that I screwed up. I ordered cheese. You forgot to place the order. Don't tell me I never ordered something that I clearly did and then correct my pronunciation when you are not pronouncing your own product correctly.<br><br>3) don't call me guy, pal or bro. Lots of people would slap the taste out of your mouth if you talk to them like that. Don't talk to me like that. <br><br>Bottom line, I don't go places to be mocked by bartenders and sh*t on be hipsters wearing ren and stumpy t shirts.<br><br>Honestly, GFY scofflaw.", "pics": null}}, {"review": {"des": "LOVE LOVE LOVE. Been here a few times but my visit the other evening just reconfirmed how much I really do love this place. <br><br>The service is bar none. We got a great and accomdating waiter who was there when we needed something and didn't linger or bother us when we seemed to be fine... that is always greatly appreciated. Another thing I like about this place is that you can seat yourself... depending on what is available it's up to you. We chose a really nice loveseat sofa with a small coffee table that was completely sufficient for us to have 3 large plates and our drinks. If you go and if the chicken is available.... you must get it. It is moist, so well cooked and the skin is crispy. Quality chicken, I would go back just for that. We also got the ham and cheese sandwich... LIKE WTF. Amazing bread with some amazingly thin sliced ham and cheese and a gorgeous whole grain mustard... pickles and finally... some chips on the sandwich to give that crunch factor. We also got the pear kale salad with green goddess dressing... I'm not normally a huge fan of green goddess dressing or kale for that matter but they pulled this off. We finished the meal with the cookie ice cream sandwich. Amazing cookies and an amazing way to end the meal. All cocktails are great. <br><br>Ambiance is also intimate and romantic... especially if you can sit on a couch.", "pics": null}}, {"review": {"des": "On a freezing Saturday in 2018 hubby and I ventured out to a few places in Logan Square, and were super pleased to land at Scofflaw for food and drinks. Scofflaw is like a cozy restaurant out of an old book- warm woods and cozy nooks, and rich food and drink- our type of place!<br><br>The server was on top of it, and recommended that we start with some charcuterie. We loved the pork rillette and the capicola and paired it with a couple of cheeses. We shared the pork ribs uh.mazing and added fries and aioli.<br><br>I'm an Old Fashioned type of gal, and unfortunately, Scofflaw's program is all about Gin. They have a nice seasonal cocktail menu, so I tried the Polar Bear Club with whiskey, cinnamon, coconut and sherry, and it warmed me right up! Hubby liked the scotch Trailblazer, but I wasn't a fan of Fernet in the drink. We loved this place!", "pics": null}}, {"review": {"des": "I love this spot, as gin is my new winter (and probably Summer) spirit of choice. I never really liked gin, but seeing as I've just started working in \"the industry\", I've made many faux pas (Yelp reviewing, included). <br><br>Onto the review- this place is great. I believe Davis was my bartender and he was super knowledgeable and even let my uncultured-self try some gin. Scofflaw's own gin won me over. <br><br>Also midnight cookies! Let me just tell you, I'm that b*tch that will always be huddled at the snack table at social gatherings. I'm also that b*tch that loves snacks and will ask if there will also be food. I'm that b*tch that will slyly Be first in line for staff meal, so when midnight chocolate chip cookies come around, I'm also that b*tch that will ask if I can have one more, and they definitely will give you one, maybe, if you're polite.<br><br>Pairing-wise, I def enjoyed the polar bear club with the cookie, brought out the spice and sweetness in the beverage, without being overwhelming.<br><br>The servers are also very sweet and helpful. <br><br>10/10 would and will be back.", "pics": null}}, {"review": {"des": "I've only ever been here for drinks but I'm always trying to get back for food because I've heard it's wonderful. Went here on a date and was really impressed by the decor and cocktails. Also, they serve cookies at midnight! Expensive but worth it and great service", "pics": null}}, {"review": {"des": "If gin is your poison of choice Scofflaw is a must. My BF and I came here for date night and it was a great time. The staff here is amazing and will make you an amazing cocktail that is not on the menu. <br><br>Tips- Great time to check out and truly enjoy is on week night. Sitting at the bar is the best service.<br><br>If you plan on coming on the weekend have patience and it's gets very busy.  <br><br>The location is fairly decent size however if coming with a large group early arrival is recommended. <br><br>The drink menu is phenomenal however the bartenders are talented they can always make you something different off the menu.<br><br>The drink are pricey because they are craft cocktails. If you are looking for $5 drafts this is probably not your spot.", "pics": null}}, {"review": {"des": "For a cocktail bar with very unique and such refreshing cocktails, inventive plates whether it's grilled chicken with an enticing, yummy vermouth glaze or a hearty Chef's board featuring 5 savory meats & decadent cheeses, or a cornucopia of so fresh veggies in the broccoli Caesar or their delightful asparagus - I could go on, and on; the overall experience is always quite delightful. Scofflaw is cozy, comfy, perfect for date night, or just as lovely for friends casually hanging out. Other than heading there solo, anything and everything goes well there; even when packed wall to wall with energetic and sometimes loud bar patrons. It's a fun place to be, be seen, see, or hide away comfortably, if that's your game. Whatever it is you're expecting from Scofflaw, it's easy to find or ask, and they'll comply. Staff is so friendly and helpful and willing to please. The chef is very accommodating and the result is rather cocktail bar type perfection, especially for the cool vibe and very reasonable price.", "pics": null}}, {"review": {"des": "Yummy. Scallions pancake was small but delicious and worth the money. Good gin drinks", "pics": null}}, {"review": {"des": "Yowza! This \"mouth watering-hole\" is a fantastic place that everyone and their mama should enjoy at least once!<br><br>This was my first trip to Chicago and because of Scofflaw, it won't be my last. Located on a small cozy corner spot is where to find some of the best cocktails and snacks in Chicago. My buddy and I sat outside on the patio and enjoyed the amazing fall weather and a few libations. I went with a seasonal cocktail called the Patio Geist - Averna, Jamaican Rum, Fernet, Lemon, and  Raspberry. Normally, I'm not usually a Rum drinker because of all the sugar, but this cocktail was the perfect mix of sweet and bitter and paired well with the cheese board we ordered. <br><br>The cheese board came with two kinds of cheese, a goat cheese and a white cheddar that had a little spice to it, along with a raspberry jam. Mix these all together schmear it on a bread cracker and enjoy.  We also ordered a duck liver pate, which I have to admit that I'm not a huge fan of, but Scofflaw won me over with their version. Smooth, not overly salty and just the right amount of fat. <br><br>The service was stellar, and the crowd that hangs is here is young and not the elitest type. They just enjoy a good drink and great conversation.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/cK-dKkbfId40B1wqbCn6RA/348s.jpg", "caption": "The Patio-Giest."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/6RujCLr6fZ_N6ef2KG9sKw/168s.jpg", "caption": "Cheese board!"}]}}, {"review": {"des": "Dimly lit, cozy ambiance with mismatched old furniture. The music is not loud or intrusive and the selection has some nice old school flavor. Service was attentive. We ordered some wonderfully crisp fries with garlic aioli with our cocktails. We liked the Body Double over the sweeter Brazen Wolf cocktail despite the cool duel color action. <br><br>Great place to lay back and enjoy the conversation.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ZtGOll1F4b59RuLMCpOhyA/348s.jpg", "caption": "Menu"}]}}, {"review": {"des": "Superior gin bar with good ambiance. Can't go wrong with a gin and tonic here, and they make their own tonic water. It's some kind of like elderberry eidelweiss elderscroll concoction, and you can ask for a sample of it. It's like drinking liquid youth, so when combined with the gin, you're drinking gin-seasoned liquid youth. And who wouldn't want that. <br><br>Had malort here as well. A taste of peak vileness. In contrast to the life-giving g&t, it aged me about 7 years. But I mean, I asked for it, and youth isn't all that it's cracked up to be.", "pics": null}}, {"review": {"des": "I love any bar that feels like a speakeasy. My boyfriend and I were waiting to meet up for dinner with some friends, so we decided to hang out at Scofflaw for some drinks and appetizers. There's an instant speakeasy feel to this place, but it's way more chill than your typical underground speakeasy bar... well maybe that's because we were there during the day.<br><br>The waitress was very friendly and attentive. I asked for a cocktail recommendation, telling her that I generally like scotch but was in the mood for something fruity and refreshing. She recommended the Close Talker cocktail, which met both criteria! The cocktail had gin, cynar, chareau, lime, and cucumber. Quite tasty and strong. Would recommend.<br><br>Meanwhile, my boyfriend snacked on their house fries with aioli which were also delicious. The fries were perfectly seasoned, and I liked their aioli. Though our experience here was brief, and I didn't get to walk around much, I would definitely come here again the next time I visit Logan Square!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ga5KJafEeClb8tCsVG3d1g/348s.jpg", "caption": "Cocktail Menu"}]}}, {"review": {"des": "Very intimate and beautiful interior. You feel like you've stumbled into a sophia copolla movie set. Our server and the bartenders were very polite and helpful and the place is dripping with atmosphere. It's comfy, eclectic, and the menu is substantial. <br><br>We were quickly sat at a candlelit loveseat and given the cocktail and food menus. I like how the cocktails are illustrated and that there are many gin offerings. I wish I remembered the names of our cocktails but they were reasonably priced, delicately presented, and boozy as hell. A+<br><br>We ordered two snacks as well, the fried pickles which were breaded lightly and served with a standard buttermilk sauce, and the chicken liver pate which came with plenty of crostini's which our server refilled without us needing to ask.  <br><br>I'd come back here for a drink and lunch in a heartbeat; maybe sit outdoors next time.", "pics": null}}, {"review": {"des": "Weird menu, weird service, weird overall experience. Nothing outwardly wrong, you just leave kinda feeling a strange vibe.", "pics": null}}, {"review": {"des": "I wish I could give this place like, 90 stars. Here are some stories.<br><br>1) When I was depressed and living in Humboldt Park and lonely I would come here and drink my fill of gin and order tons of vegetables and things because Scofflaw has the best damn menu a bar can have. It's amazing. If they didn't serve cocktails, I'd still come for the food. You can order practically anything off the menu and you'll be satisfied. If you're three drinks in, you'll probably just eat more food. That's how they get you. But it's OK. If I were like, a venture capitalist (am I using that word right?), I'd give this place $500,000.<br><br>2) One time I went here to meet a guy who wanted to dance with me lying down for money and I ended up not doing it because he was yucky and he was super into telling me what ivy league school he was from, but he ordered fries for the both of us and I ate most of them. Scofflaw is the best.<br><br>3) One time I took my boyfriend here (he's not my boyfriend anymore, but a honey can dream) and we ordered the burgers and he got sick afterward and he thinks it was because of the burger and I agreed with him but I really don't think it was the burger. Because I didn't get sick. Anyway, case in point, go buy the burger. It's great. It's simple and beautiful and there isn't too much crap on it. You can taste every ingredient.<br><br>This place gets crowded and it makes you feel like someone, but not in that lame LA way, but in that punk Chicago way. (I'm from LA so I know this.)<br><br>I hope Scofflaw wins a Nobel Prize.", "pics": null}}, {"review": {"des": "A friend and I stumbled in here on a Friday evening for a drink and some food. You seat yourself, and they have lots of unique and Victorian seats to choose from. We chose a little table near the fireplace and ordered some beers. (We considered getting malort on tap instead, but then we remembered we're not disgusting. We ordered fried pickles, the salmon toast, and the chicken sandwich. The food came out pretty quickly, and everything was delicious.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/8sDdD0o6eFFqcbAjeTndTw/348s.jpg", "caption": "Salmon toast"}]}}, {"review": {"des": "I'm a gin lover, and I appreciate that they have everything from my favorite affordable gin, to my favorite splurge-worthy gin. The cocktails are great, and the free cookies at midnight are warm and delicious! The menu changes regularly and I've enjoyed a light dinner here as well. <br><br>There's a few spots near the fireplace for a cozy winter night, and further back there's old couches that make it easy to last until midnight for those fresh baked cookies!", "pics": null}}, {"review": {"des": "My son and I recently went to Chicago for our annual outing there. We stayed at a cool airbnb in Logan Square. We found this bar and grill close by. What a treat. The craft cocktails were wonderful, and the loony bartenders were fun to watch. The cheeseburgers we ordered at the bar were really great, as were the fries. Definitely recommend!", "pics": null}}, {"review": {"des": "Gin. Gin everywhere. That's what you need to know about this place. They have every kind of gin you can think of and they make their own (yessssss). <br><br>Their waitstaff is awesome - I love dirty martinis and requested one with their house gin and the waitress actually came back with suggestion that it's not really a gin for a dirty martini and suggested a different cocktail with it. It's awesome when they know what does and does not work. Their gin is very floral - light on juniper and very sweet (by itself).  <br><br>I was honestly upset that we had eaten dinner beforehand because the food coming out of that kitchen looked delicious. And we made it in time for midnight cookie time (what is this witchcraft?!). A person literally walks around the bar offering freshly baked cookies to everyone - and if there are some left , walks around again (and possibly again just for me). I'd stay up past my bedtime just for this. <br><br>Ambiance is dimly lit with Victorian chairs that are set into little groups with candles on the table . We were there on a Tuesday and there was about half full. Definitely a cute date night spot!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/PcYSGip_S0Zs3Wv5aYi23w/348s.jpg", "caption": "The Standby"}]}}, {"review": {"des": "I've been to Scofflaw quite a bit and still enjoy going - good cocktails, chill patio, those warm chocolate chip cookies at midnight! Yes! However, it's lost some of the head over heels love I once had for it. <br><br>All food dishes used to be $8 at Scofflaw. That was kind of their shtick along with the cocktails being $8. Last night I had a Burrata cheese dish for $15. It was interesting and unique sitting atop a dill sauce with tiny apple chunks plated around the edge and a pretty salted design in the center (a little too salty) but it was double what their dishes used to be. There are still a few cocktails for $8 but most now run $9 or $10.<br><br>They truly do have solid drinks though. Last night I tried the The High/Low (with Malort Mmmmm), Patio Geist and Six Demon Bag - loved them all. I also tried my friends Mixed Blessings, Top Dollar, Swizzle #16 and Surf's Up...so practically the whole menu! Their menu is great by the way as they have pictures of what each drink looks like, explain what's in each in detail and then go on to even include a glossary to further get into what each ingredient actually is. The Six Demon Bag is filled with tons of tiny ice pieces so keep that in mind when ordering it's going to be kind of slushy-like. The High/Low is badass because it has a tall ice \"spear\" flavored to match the drink<br><br>I'm happy to say the cool ambiance on the patio, the warm feeling you get sitting inside of Scofflaw and their tasty drinks all have stayed up to par. The food isn't quite as fabulous as it once was but it's still a good solid meal to pair with their drinks. Service was just fine but wasn't as great as it once was either. I was with friends yesterday and one said it was one guy's birthday, she just looked at us blankly. <br><br>Ah, Scofflaw! I wish for you to be what you once were and will remember you fondly. I'll continue going as it's usually a bit less busy than other Logan Square spots since it's a bit off the beaten path but not at the level of frequency I once did.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/s_xNwIpnZ1e5kc2UqomTaA/348s.jpg", "caption": "Surf's Up in the back & Patio Geist in the front"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/l8T_bC9Gf3u2ywW_nOt_MA/168s.jpg", "caption": "Six Demon Bag"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/R2hnZmYm7B_h29i1lq2SyA/168s.jpg", "caption": "Dill Burrata"}]}}, {"review": {"des": "Good spot for pre-game and after-party when having meal at next door Giant. Lovely vibe and decor inside. Good collection of cocktails, and I like the way they put the drinks onto the menu -- drawing them out!", "pics": null}}, {"review": {"des": "I have to go back to try the food, but the drinks were inventive and well crafted. We had our choice of sitting at the bar, a booth or snagging a couple vintage chairs. We opted for the cozy vintage seats. After checking out the drink menu, we ordered a few cocktails. Each drink was complex and interesting in a good way. Our server was attentive and gave thorough descriptions of her recommendations. Next time I'll order food and try to stay late enough for the midnight cookies.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/yfzYRAofKhnCEc-mK7BiPw/348s.jpg", "caption": "Bacon Cheeseburger with Grilled Onion"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/9gX15s03m-D8c1VrIXPc2A/168s.jpg", "caption": "Fries with aioli"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/sarmdq4jhPsEqre55DmeHg/168s.jpg", "caption": "Midnight Snack. ..when you're plugged you can get before midnight."}]}}, {"review": {"des": "Staff was super friendly and the drinks were great! The atmosphere was cool; a bit of a local/rustic vibe.", "pics": null}}, {"review": {"des": "One of my favorite bars in the city. Fantastic gin drinks, but they work wonders with other base liquors as well. The menu changes up frequently and I've never had a dud. A great place to go if you're not super familiar with mixology as their menu includes a glossary to help you pick what's right for your palate. <br><br>I always get great, attentive service. In the winter, I wouldn't recommend sitting near the fire, it gets crazy hot there. Other than that, the interior vibes are great, with a variety of seating for couples or groups that are a touch larger. Furnishings are all antique and give the whole place a classy throwback vibe.", "pics": null}}, {"review": {"des": "This place is hipster central! But their food and cocktails are great and decently priced.<br><br>I stopped in this weekend with a few friends because we were close by and wanted some good cocktails and some snacks. My friend had recommended I check Scofflaw out and I'm glad we decided to go because I wasn't disappointed. We started out with a round of cocktails - I tried the Sutters Mill which was delicious and very well balanced. I also really liked the Deco Step which is what my friend ordered. Later I had an Old Fashioned which was perfectly made, they also nailed the Aviation and Boulivardier we ordered. The staff was really nice and knowledgeable of spirits they offered - we ended with a great dry amaro but I forgot the name. <br><br>For snacks we shared the Fries, French Egg, Gnudi, and Belly. Nothing stood out as amazing but the pork belly was good enough we almost ordered a second one. <br><br>I was surprised and impressed how reasonably priced everything was, especially for the area of town it's in. Our bill came out to 50$ each without tip which was low consider how many drinks we all ordered. I can see why it's so popular and will be back for sure. I also heard they are opening up something across the street and am excited to check it out!", "pics": null}}, {"review": {"des": "Lived by this place for years and always meant to try it out. I was expecting elevated small plates...something akin to Longman & Eagle (maybe that was my mistake because it is a bit cheaper)...the flavors just weren't there. The negronis we got were good, but the deviled eggs and charcuterie were definitely not. They were actually bad...i make better at home. We wanted more drinks but didn't want to chance being disappointed by more bad food so we left and walked down to Best Intentions. The food and cocktails there were honestly superior and they had a way cuter patio. Sorry Scoflaw :/", "pics": null}}, {"review": {"des": "Came here in a nice Sunday in February for lunch. Every seat in the house was taken, but it wasn't crowded. Drinks and food are really good; Holy smokes - the burger! <br><br>Only thing that I wasn't a fan of is that most of the seating in the place is family room furniture, coffee tables, dinning room tables, love seats l, etc. which can be tough to eat on l, but perfect for drinks. I guess it makes sense if you're there to booze", "pics": null}}, {"review": {"des": "I LOVE this place! The drinks are amazing. You have to try a few on the seasonal menu. I just went for the 5 year anniversary celebration and got the burger with egg on top and it was SOO good. Def get fries to share with the aioli. It's such a romantic/cool atmosphere.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/flg5GCoc-eh3mYVYWMAGSQ/348s.jpg", "caption": "Burger with egg!"}]}}, {"review": {"des": "Let me start this review by saying I will be coming back at midnight for the cookies! I have heard excellent things about the burger, too. A group of friends and I came here to kill time waiting for Parsons. The bar area is really cool, but we took a seat in the \"living room\" on one of the couches. <br><br>The cocktails were excellent and not overpriced like many trendy cocktail bars in Chicago. They had a pretty decent beer list, too. Our service was great, and we were in and out of there in an hour. Will be coming back to try the food!", "pics": null}}, {"review": {"des": "This upscale lounge sports very comfy Victorian frame and carpet fabric chairs. Dimly lit for romance. The secrecy of one's conversation can be maintained by being drowned out in the loud ambience. The music can be quite loud at times. <br><br>The Violet Hour of Logan Square/West Town.", "pics": null}}, {"review": {"des": "After a short wait inside on a rainy Friday night, we scored a table for 4. The decor, music, low hum of conversation, fireplace, efficient service & great drinks will have us back. Really nice evening.", "pics": null}}, {"review": {"des": "Fantastic vibe.   Tons of gins.    Arthur is a most excellent bar tender.  Very knowledgeable.   They make their own  tonic.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/iqgguD-bH3sahbYd9VBIQw/168s.jpg", "caption": "Gin tasting"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Saaz3dNOwcqxYC00utrsDA/168s.jpg", "caption": "Bloody Mary"}]}}, {"review": {"des": "What a cool spot! The low key ambience joined with a variety of unique cocktails definitely makes this a great hang out place. Will definitely be coming back with friends!", "pics": null}}, {"review": {"des": "Let's just say I wasn't as impressed as I was hoping.<br><br>I've heard so many great things about this place and unfortunately my time here was just Ok. The decor is beautiful and hip, lots of vintage finds which I love. The cocktail menu also seemed on point--they had illustrations on the menu of each which helped you visualize even better. I must say though I was pretty disappointed with the brunch menu. All of the stand-out items I had read about on Yelp were gone! And I don't just mean 1 or 2...my friends(who are also expert Yelpers) did our homework and came prepared with multiple things in mind only to hear that not a single one available! Ah, kind of a bummer but the ambiance was great so I'd be willing to give it another try...", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/zcxwquX5fjXRof2Ha0TyuA/168s.jpg", "caption": "Swizzle"}]}}, {"review": {"des": "After reading so many accolades for Scofflaw over the past couple years I was really excited to finally try it for the first time this weekend. My friends and I got there around 9:30 pm Friday and had to wait about 5 minutes outside before there was room for us. Dimly lit, exposed brick, and an eclectic mix of furniture definitely gives you that Logan Square vibe.<br><br>Their cocktails were outstanding. I had the Longwood (mezcal based) and the Gin & It (vodka based...just kidding...gin). The former was nice and smokey flavored and the later was very refreshing, both as expected. All of the bartenders did a great job working together and getting the drinks out in a timely manner despite the crowd.<br><br>To end the night, we had a round of Old Style (which they have on tap) and some chocolate chip cookies (which they always hand out at midnight). What more could you ask for?", "pics": null}}, {"review": {"des": "Had a delicious cocktail here yesterday, and really liked the vibe. It's like an old Chicago style bar with some quirky art and decor. Will be back!", "pics": null}}, {"review": {"des": "I went back and tried the food and it was decent. They had less gin based drinks and a better mix of options. Probably due to the season. I had some soft rendition of old fashioned. It had a marshmallow charred swimming in my drink. Deceptively delicious. Maybe ole Chava getting soft but I really enjoyed it.", "pics": null}}, {"review": {"des": "We were staying with friends in Logan Square and they introduced us to Scofflaw... and some of the best cocktails I've had in my life. They have a huge selection of spirits and mixers, which allow you to order basically anything your heart desires. I would highly suggest, however, ordering one of their signature cocktails off of their rotating menu. <br><br>A highlight to the evening was around midnight (I'm not sure what the exact time was) when they went around and served everyone there fresh baked cookies. For real. This right here already earns Scofflaw a 5 star review. <br><br>In addition to the amazing cocktails and the late night cookies (seriously best idea ever), the service was great, and the ambience was super chill. The kitchen was open until 1am, which was also a perk. It was the perfect place to enjoy the evening and catch up with friends.", "pics": null}}, {"review": {"des": "Phenomenal service start to finish. Great recommendations. Not sure initially about cauliflower sandwich....it is fabulous!  Fries with lots of garlic are worth the calorie splurge. Beautiful cheese board. We had beers, but the cocktail list looked awesome.  Full page gin list if you are so inclined. Finished up with the coffee/almond dirt dessert. Now officially a big almond dirt fan. Who knew?  Scofflaw definition is a cad who doesn't pay fines or follow rules. Ok, just keep up what you are doing, Scofflaw.", "pics": null}}, {"review": {"des": "One of my new favorite cocktail bars! <br><br>On a cold winter evening, they have the fireplace up and running, lots of extremely comfortable, cushioned chairs, and reasonably priced drinks. It was such a treat to head here after work. <br><br>Their menu changes seasonally, so they truly go with the flavors that matter now. Pumpkin spice in the fall? You got it! Buttered rum (warm, mind you!!) in the winter? Totally! <br><br>The bar tenders were knowledgeable and took their time to get you a drink you would actually like. Feel free to mention your preferences: dry, sweet, gin, vodka, whatever! They'll happily guide you through their menu. <br><br>And don't skip the fries! They're fresh cut, a tad bit greasy, and paired with delicious aioli. <br><br>I'm already excited to head black there soon!", "pics": null}}, {"review": {"des": "Great gin bar with yummy and refreshing cocktails! Fun, vintage atmosphere with cozy furniture.", "pics": null}}, {"review": {"des": "Great ambiance inside the restaurant. Feels like a large rustic living room with a fireplace. Reasonable place to bring a date. The burgers were delicious and the owner+staff were well attentive. Looking forward to returning for sure.", "pics": null}}, {"review": {"des": "I really love Scofflaw. I can't say that about a lot of bars. I've been here a few times and each time is great. <br><br>Scofflaw is consistent. Great food (I've never had a bad dish), FANTASTIC cocktails, and honestly, good prices compared to most cocktail bars. Cocktails run from $8-$10. <br><br>Unfortunately for me, their cocktails are so easy to drink, I end up drinking too many, but great times are had.<br><br>Last time I had a date night with my bestie and we had funnel cake for dessert. It was the best funnel cake we've ever had!!! <br><br>Cookies at midnight are fun. Service is generally good, and the decor is super cute and cozy!<br><br>Parking is a pain, but frankly, it's best not to drive anyway considering their cocktails. But you should definitely find a way here!", "pics": null}}, {"review": {"des": "Great service friendly and helpful. My burger was delectable. Cozy and intimate setting clandestine almost. My drink was exotic and delicious. Spicy, sweet.", "pics": null}}, {"review": {"des": "Ordered: Hot Buttered Rum, Caledonia, Mac and Cheese (I don't see this on the menu anymore)<br><br>ATMOSPHERE: Great, cozy atmosphere with creative seating arrangements. You may be seated at the same central table as another group of guests, but this only adds to the communal feeling of the establishment. <br><br>FOOD: Mac and Cheese was awesome, extremely creamy, well flavored and topped with some sort of breading that complimented the dish well.<br><br>DRINKS: Caledonia was very boozy and well thought out in terms of flavor profile. The Demerara really came through. and Hot Buttered Rum was really unexpected, in the best way. Again, well thought out with the flavor profiles really working hard to make a very buttery, smooth drinks <br><br>BOTTOM LINE: Would recommend, would return.", "pics": null}}, {"review": {"des": "Great chill experience of the Chitown nightlife! <br><br>Great selection of beverage and finger foods. I ordered the hard apple cider ($6), which went perfect with the savory churro ($6). It was one of the MOST DELICIOUS things I've had. <br><br>The place has plenty of seating but was already crowded by 8pm on a Saturday. This just shows how popular it is. <br><br>Lovely service and I like the ambiance of this place. People dressed up for a fancy dates, or were in casual clothing to catch up with friends. <br><br>The only downside is if you are coming by public transportation, it's a bit of a walk. But the neighborhood is safe so you are safe.", "pics": null}}, {"review": {"des": "After being told we had a two hour wait at Parsons, a few blocks east, it was heaven to learn that there wasn't a wait here. Don't geme wrong, it wasnt empty, we decided to drink and eat at the bar as there wasnt room for 3 outside and we could sit across a corner there. The cocktails were excellent and the food was pretty good. Two of us split a cheeseburger and a cauliflower sandwich. I loved the latter, but was surprised they didnt care about the prep of the beef. We were told it was 2 thin patties cooked one way, reminding me of my ex husband. The fries were good and the carrots were too spicey for me but one if us, with a metal clad tongue liked them and polished them off. What an amazing gin menu! The bartender was friendly, knowledgeable and impressively hard working. He measured, shook and stirred the whole time we were there. Overall a fun place.", "pics": null}}, {"review": {"des": "Best gin cocktail bar in the city, and best cocktail bar in Logan Square hands down. <br><br>They do not take reservations, and if you are going on a weekday or weekend night after 8pm, good luck! <br><br>It's a charming place with one room that is more casual. By this I mean couches, chairs, and coffee table. The bar area has a few tables and booths (if you can grab them), that are nice. Full menu through the entire restaurant, and their food is great too.", "pics": null}}, {"review": {"des": "The scrumptious, melt-in-your-moth (... AND FREE) chocolate chip cookies boot this up from 3.5 (add that half star already) to 4 stars. Stay until midnight and you too shall reap the benefits. <br><br>Scofflaw was one of the pioneering lounges in Chicago's craft cocktailing movement, specializing in gin drinks when they opened. Nowadays, they've shifted toward more of a balanced menu that showcases all spirits. While the olden days of $7 or $8 cocktails at Scofflaw is well behind us, you still get bang for your buck while enjoying some delicious concoctions. <br><br>The place is way too busy all the time and it's near impossible to find seating at core hours. This is still surprising considering how many other awesome cocktail bars there are in this neighborhood. Tips: The staff moves very slowly, so be prepared to wait. It's much better to sit in the sleek, dimly lit indoor area than the overly lit, too close to the busy street outdoor area. Also, stick to some variation of the basics here; they get a little too adventurous with some of their cocktails to the point where I've had to send them back because they don't taste like the server described. Still, the menu is amazing and there's always something for everyone.", "pics": null}}, {"review": {"des": "Great place! Very cozy! I liked the hot buttered rum which was very good but watch out! It has A LOT of butter in it! <br>The server could be more attentive though.", "pics": null}}, {"review": {"des": "Great place to grab a drink. Love the interior design, great for Instagram posts. The drinks are refreshing and well put together. The food menu is limited but the food I have had there was wonderful.", "pics": null}}, {"review": {"des": "We almost left the first time we went here. Showed up for dinner in the summer and stood at the entrance for awhile- they were busy. Seemed like some people were waiting for tables, no open ones when we initially walked in. Tried to get a drink at the bar- not easy. Tried to figure out how to get our name in and stood awkwardly for about 5-7 minutes making eye contact with waitresses who ignored us til I went up to one putting in orders at her computer who let us know it's first come first serve.  <br><br>Once we knew we grabbed a table outside. Food was good- cocktails are great. I'd pass on the chicken liver next time- way better elsewhere in the city. I think we'll stick to cocktails here :)", "pics": null}}, {"review": {"des": "This place is truly a gem. Found it randomly while in this part of the town and wow, what a surprise. Strong, great cocktails, friendly service and a cozy atmosphere. Will definitely come back!", "pics": null}}, {"review": {"des": "Their burger is my fav burger in Logan maybe even in Chicago next to small cheval I wish they had more gf options bc I don't eat the bun and am usually hungry after. This leaves a lot of empty space in my stomach. Their cocktails are amazing but they don't fill me up. Buzzed, hungry reaches for snacks!", "pics": null}}, {"review": {"des": "My new favorite bar!  Finally made it after being nearby for years. Great quality drinks, fun vibe, cool bartenders and really yummy food. Have had some apps, burger (melt in your mouth goodness) and fries. All good and perfect after having several drinks there. <br><br>Favorite drink so far is the Patio Geist but I believe they've started to change the menu since the last couple of times the hubby and I were there. Fall menu on the way. Either way, you can't go wrong. <br><br>Have sat at the bar with the hubby, in the lounge area (dimly lit, victorian decor) and in the outdoor patio with friends. All good times. <br>Highly recommend it!<br><br>Oh, and if you're there at midnight they bring out freshly baked complimentary cookies for everyone. Perfect.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/F_BsMzAU9UdgB9EMuvDzdg/348s.jpg", "caption": "Patio Geist!  My fave!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/z0AB_C4dPxItZKa4YkR-Lw/168s.jpg", "caption": "Mixed Blessing. My experimenting drink. Unique."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/k1T9alZWio5nFLDG6vfSVw/168s.jpg", "caption": "Surf's up. Light and refreshing."}]}}, {"review": {"des": "I've been to Scofflaw about 4-5 times, and I have loved every single experience I've had their. Most recently, I set up a get together for about 9 people after my friend proposed to his girlfriend. <br><br>I called as soon as they opened and asked about accommodating the group. I knew in advance that they didn't take reservations, but the gentleman I spoke with was very understanding and excited about the proposal, so he asked us to give him a heads up before we came in, and we was able to move a few things around so our group could sit together. It was PERFECT! <br><br>We also had an incredible waiter who separated checks for us, checked in on us frequently, and was able to keep all of our orders straight from the jump. <br><br>We had the burger and it was FANTASTIC. The best burger in Chicago, in my opinion. Their fries were also great, in addition to their cocktails. I've had their food every time, and have sampled enough of the menu to know that you wont be disappointed regardless of your choice. <br><br>Scofflaw is a MUST GO!", "pics": null}}, {"review": {"des": "Great Gin Bar concept on the corner of Armitage & Kedzie with a great vintage feel and also Gin varieties that you won't see anywhere else/ great food to boot! They concentrate on great cocktails and these do not disappoint! Great local beers on draft to boot makes for a great bar/ really liked the marble bar top as well as the stools here...don't lean back baby. I thought the food was really good here.. we tried the Chiliquiles & Fried Chicken Sandwich and both were very well executed! This chicken sand rivals Parson's and may even be better here. They also have a patio & they do brunch on the weekends which for some reason is relatively quiet? Service was excellent here.. it's a place where they do everything right...Cap it off at Best Intentions with a Salty Dog!  PS- Cold Malort on TAP!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/VgPOmx8dBK4LnGO6R2upHA/348s.jpg", "caption": "On Tap!"}]}}, {"review": {"des": "We absolutely love coming here at any time of any day. The cocktails are always top notch as well as the service. The food is phenomenal and the aioli for the fries is the best part. Fun tip: At midnight they give out cookies!", "pics": null}}, {"review": {"des": "Cocktails are amazing, be sure to look at the back of the menu for full gin list! <br><br>Food is amazing double cheeseburger makes your mouth water and ice cream sandwich is amazing <br><br>Only tip is to heat up cookies for the ice cream sandwich in a separate pan (:", "pics": null}}, {"review": {"des": "I came here for the midnight cookie, the midnight cookie! the midnight COOKIE!!!<br><br>How have I not written about Scofflaw? Great cocktails, tasty food menu, classy seating, with the sidewalk patio, they make their own gin, and most items are under $10 a piece. <br><br>I've always enjoyed a refreshing beverage here and I also wanted to keep things simple with the old G&T is nice. It's a great local establishment, located a little further away from the main part of Logan Square, which means you get with a cool ambiance at affordable pricing.", "pics": null}}, {"review": {"des": "Great gin bar.  the cocktails are well worth the visit and you should try as many as you can since they have a revolving menu", "pics": null}}, {"review": {"des": "Really liked this place! The ambience is extremely cozy and quaint, the food was delicious and the coffee/juice superb.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/aSbQOWJjAVHJAbVg4C1jHw/348s.jpg", "caption": "Just enough. The pepperjack hashbrowns with an egg."}]}}]}