{"name": "scooters-frozen-custard-chicago", "reviews": [{"review": {"des": "Scooter's is by far my favorite dessert place in Chicago. My friends and I stumbled upon this place a few years ago when we were in the area a few years ago, and since then I've been here on a number of occasions. Scooter's is located right off the Brown line Paulina stop in Roscoe Village. It has a pretty small, very well lit interior. They have a ton of options on their menu, but I highly recommend trying any of their concretes, or their flavor of the month special. <br><br>The CFNBC concrete is probably a safe bet- very thick, flavorful custard, with brownie bits, caramel and other stuff like that. The most recent time I went, I got the flavor of the month which was the Pecan Pie concrete. It was amazing! I'm a huge fan of Pecan Pie, and this item is soooo good! Perfectly thick custard that really will satisfy your sweet cravings. <br><br>My one complaint is that it costs about $5-6 for their smaller size. I'd recommend just buying their larger size which is about $7-8, and sharing it between two people. Or just eat it as a meal! I've definitely been tempted to do this a few times :)", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Py50o8_k_yWzwJQhM3QVhQ/348s.jpg", "caption": "Pumpkin Pie Concrete (limited time), small size."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/hAg4c_4xcUY5GgNRvz8BGw/168s.jpg", "caption": "Pecan Pie Concrete (limited time flavor I believe), small size. Very thick and delicious!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Rt8ruXxQMsWtd0ZAn1QA-w/168s.jpg", "caption": "The \"CFNBC\"! soooo amazing. Thick flavorful custard, I've been craving this ever at least once a week since my first visit."}]}}, {"review": {"des": "Oh boy - it's been years since I reviewed Scooters! I still think it's on the pricey side but now that I've discovered the Chocolate Yum Yum, I feel like they could charge me $20 and I'd pay it. It's chocolate custard blended with a brownie... and then the pour a shot of hot fudge in the middle. Yes. It's magical.<br>Also - now that I have a baby, I notice all the stuff I never paid attention to before, like which places have high chairs and changing tables. Scooters has both - and they offer \"toddler cones\" which are tiny little cones they'll fill with a little bit of custard. My toddler devoured his and then ate half my chocolate yum yum, but I can't even be mad because a) he's my perfect baby and b) that chocolate yum yum is the shit.<br>So - def recommend Scooters if you're nearby! And if you're not - I have easily found parking right out front most times I've stopped in. (word to the wise - there's a step up to get into the front door so if you have a stroller it can be a little awkward).", "pics": null}}, {"review": {"des": "I already miss this place. Summer where are you?! Scooters is one of my favorite places in the city to get ice cream, they have an awesome menu plus they have daily specials. They are super dog friendly and also have a little window you can order from outside if you don't want to cram yourself inside the small place.", "pics": null}}, {"review": {"des": "I'm not really a fan of custard, as I feel it melts way too fast. I like hard scooped ice cream instead. Though I did like all the mix in options at Scooters. I got the Elvis, which was blended with bananas and reeces. This was pretty tasty, though I finished it way too fast to avoid it melting and had a nice stomach ache shortly after. I wish there were more ice cream flavors offered here rather than the plain vanilla, chocolate, and mint.", "pics": null}}, {"review": {"des": "Scooter's is so adorable and triggers nostalgia when you walk in. Scooter's makes feel like I'm a child again trying to decide what to order! I went with a Cookies and cream Concrete and it did not disappoint. It was perfect. The menu was a tad hard to read on the wall because it was all printed on yellow paper with black ink and my eyes were drawn all over trying to navigate it, which made deciding on all of their amazing choices even harder. Be sure to grab a pint of custard to go!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/cbJVdh5acz69tTb7QiXnzQ/348s.jpg", "caption": "Cookies and cream Concrete"}]}}, {"review": {"des": "Price: About $6 for a small cup of ice cream, only enough for one of course. They charge for each additional topping as well.<br><br>Food:<br>Chocolate Yum Yum with Almonds - fixed my chocolate craving, but super sweet.<br><br>Service: Ok.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/9Ji8PSy7nw4yEf2st0YGrA/348s.jpg", "caption": "Chocolate yum yum w almonds $7.60"}]}}, {"review": {"des": "I see that I did the smart thing and came by close to closing with a friend and her daughter as I have seen from reviews that there are lines outside the door during daylight peak hours. <br><br>Very friendly group working here with a smile as they take your order and hand you the goodies. I got the very popular peanut butter and jelly concrete and it was very good! I can really taste the pb & j in there! My friend got the caramel fudge nut brownie chip concrete and it was very good as well. Just like me, some of you are wondering what the hell in a concrete. Its basically a load of frozen custard with your choice of a mix-in (pb & J in my case).<br><br>Everyone that walks inside of this place seems very happy and leaves out smiling. Most places should be like this!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/-eRA4lRgmH8edu1ombmrLA/348s.jpg", "caption": "Peanut Butter & Jelly Concrete"}]}}, {"review": {"des": "Mixed feelings about Scooters. Don't get me wrong it's really good custard but it's definitely overpriced, which is why I struggle to give it more than 3 stars. We got one of their specialty milkshakes and it was over $8.", "pics": null}}, {"review": {"des": "Love Scooter's! The quality of their custard is super impressive, super low air, very creamy, thick and flavorful, just like a good custard should be :)<br><br>I like that they have a flavor of the day and a concrete of the month, but their staples like the Elvis and the CFNBC are delicious. Personally, I like to get into the cooler and look at flavors they've got in pints and quarts (big discount when you buy a quart) for some extra variety.<br><br>Mondays are my least favorite day of the week, not because I have to go back to work, but because Scooters is closed on Mondays after Labor Day. Yay Scooter's!", "pics": null}}, {"review": {"des": "First timer at Scooter's. Had a hard time deciding with the endless possibilities of flavors. Eventually got the peanut butter and jelly...it sounded like a weird ice cream combo but it tasted AMAZING! I'm a sucker for ice cream. Couldn't help myself so stole a bite or two from the family and friends. All their custards are good!", "pics": null}}, {"review": {"des": "Best custard in all of Chicagoland !! Must try! The cutest little neighborhood gem. They have custard, cones, blizzards and more. They even have a walk up window to order from. Parking can be a little tricky but it's worth the hassle. Right on the corner of Paulina and Belmont it's a must if your in the roscoe village area. Enjoy !!!", "pics": null}}, {"review": {"des": "Definitely one of my favorite place to get Frozen Custard! I got a small pb&j and wish I got a regular. It was delicious. ~", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/nEDX2tWviW-ndgeBTSWEPQ/168s.jpg", "caption": "Left: regular Elvis  Up: regular strawberry"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/jjQl6TP30IaorA4mjtAosg/168s.jpg", "caption": "Small Pb&J- so yummy"}]}}, {"review": {"des": "I live right by Scooter's and every time I stop by, there's a line. Parents taking their kids for a treat or just adults wanting some custard. It's always impressive to see the amount of people enjoying their custard outside on the bench.<br><br>The boyfriend and I got a small smore custard to share. While it was good, the pricing was way too much for me to come back on a regular. At $6.50 for the custard, I don't think I'd want to frequent this place often. <br><br>Things to note:<br>You can order inside the shop and from the window outside (probably just good for regulars who know what they want)!<br>They take card!", "pics": null}}, {"review": {"des": "Got the Blackhawk concrete (strawberries and oreos in vanilla) which was AMAZING! However, I have to say its pretty pricey. I paid $6 for a small and I guess I'm comparing prices from when I went to school in Des Moines and the amazing custard in the shady parts of Des Moines cost ~$2.00. <br><br>Would potentially go again if I was around the area. Otherwise, it's kind of out of my way and too pricey to make it a regular part of my stops.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/urheR90abKt9EYYyh4Fmrg/348s.jpg", "caption": "Blackhawk concrete"}]}}, {"review": {"des": "I've been to Scooter's a few times, and I've generally liked what I've gotten. During my most recent visit, I tried the coconut cream pie concrete and was pretty satisfied with this. There was plenty of coconut flakes, and ingredients to make it taste similar to coconut cream pie.  I also tried a bite of the special of the month, which was a cherry pie concrete.  This concrete was something I really liked, even though I'm not a huge fan of cherries. <br><br>My only issue with Scooter's, is that I feel that the prices are a tad overpriced. I come here very infrequently, so it's not a huge deal, but $5-$7 with tax for a small concrete makes it more of a splurge.", "pics": null}}, {"review": {"des": "I used to live close by to this wonderful establishment, but it's probably a good thing I don't anymore because I was spending too much here  I love frozen custard, some people don't like if because the consistency is so much thicker than ice cream but i can't get enough of it! I've tried many of their concretes, and they have new ones weekly, but my favorite is the strawberry concrete which is their signature mix and Elvis, which is vanilla, Reese's peanut butter cup, and bananas  (their top seller) The lines can be long during the evenings in the summer but it goes by pretty quickly!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/yYQZgRXY5N9eS2TL4ZB0VA/348s.jpg", "caption": "Yummy concrete, made my own"}]}}, {"review": {"des": "I am extremely disappointed to my first time experience here tonight.  I sent my 12 year old niece visiting from Colorado into Scooters while I waited outside the door with my dog.  When she came out, she handed me three single dollar bills and change after buying a junior milkshake.  I said \"the shake was 6 dollars and change?\" She replied,\"no, it was $5.51\".  I walked inside with the three singles and told the girl ringing up that we didn't get the right change.  She smirked and pulled one dollar out of the tip jar and handed it to me.  Intentionally taking advantage of a little girl who assumed the singles wrapped up were the correct change.  I'm shocked that people purposely do this.  My niece didn't even see a tip jar.  Shame on your staff. In my opinion that was stealing from a little girl.", "pics": null}}, {"review": {"des": "I love this place even though it makes me sick (I'm lactose intolerant). I enjoy every bite :)<br><br>My fave is the banana splice. The saddest time is when they are closed in the Winter lol.", "pics": null}}, {"review": {"des": "I've only been once but can't wait to go back!  I had a concrete type deal with Reese's cup, Oreo, and cookie dough.  It was so yummy!  I really don't think you can go wrong with frozen custard :-)", "pics": null}}, {"review": {"des": "I have been coming to Scooter's forever. Best frozen custard in town! Even the vanilla is amazing and I am a chocolate girl! When there is a line it always goes super fast. You never have to wait for very long, unlike other places in Chicago. Great place to grab desert with your dog, family, or friends.", "pics": null}}, {"review": {"des": "I came here with my fiance this past weekend. We tried the coconut cream pie custard here. It wasn't bad, but is was wayyyyyyyy too sweet. My favorite types of custards are those that have balance, where you can taste all of the dessert flavors. You could sort of taste the flavors of the coconut cream pie but the resounding flavor was sweet. it was kind of like eating a piece of candy in a custard form. I like my custards to be a little bit more complex and flavorful.", "pics": null}}, {"review": {"des": "This is the best custard place I've ever been to, and one of my favorite dessert places in Chicago. I've been here twice (came back almost immediately after the first time), had two different concretes, and loved both of them. The sizes and prices are good, the flavors are great, and the service is fast and friendly. A large can be shared easily between two people, or eaten by one very hungry person. Absolutely stop by if you're in the area and looking for dessert.", "pics": null}}, {"review": {"des": "Part of our itinerary during Chicago trip was to visit as many custard ice cream shops as possible. I was very disappointed that this was our last shop to visit. Had this been the first, I would have visited more!<br><br>Compared to the other custard shops we tried, Scooter's had a great blend on their concrete. I had the coconut cream pie. <br><br>It wasn't too sweet and the flavors were great. It actually tasted like a coconut cream pie with every bite!  <br><br>They are also family friendly with a changing station in their restroom. They also give toddlers complementary cones. <br><br>We will definitely make this a stop on our next visit to Chicago. Until then, keep up the great work and stay busy!", "pics": null}}, {"review": {"des": "I don't know why it has taken me so long to write this review, but this is my favorite ice cream or custard place ever!  I have been going consistently for over 10 years and it has always maintained its small independent charm with a staff of the owner and a bunch of nice high school kids. Yummy creative concretes, shakes, splits, and other cool flavors. My favorites are the Triple T, Blueberry Pie, Elvis, and Java Lava. <br>Only downside is you either go small and spend a lot or go BIG and spend just a bit more; so I usually go big...which is not so good for the tummy. Ha.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/qwA_FEZhJ2lCS-ll7grFjg/348s.jpg", "caption": "Triple T concrete"}]}}, {"review": {"des": "The best of the best. Strawberry on vanilla custard is the best. Try with Nutella. Great small business, family-owned. Gem.", "pics": null}}, {"review": {"des": "simply YUMMY strawberry concrete is what I always order. Thank goodness that for my pocket it's pricey and it keeps me from going often.  Otherwise, I'd be packing on frozen custard calories daily.", "pics": null}}, {"review": {"des": "Scooters is quite close to my house. I love their chocolate custard so much. Get it in a waffle cone and oh so tasty! I love how smooth it is, unlike your regular ice cream! They have a huge menu which is slightly tricky to navigate when it's ultra packed. I'm updating my review, the kids there have been much friendlier the last couple of visits!", "pics": null}}, {"review": {"des": "Stopped by here after our dinner before a show at the Athenaeum on a whim. I was so happy that we did so. The custard was so silky smooth and delicious. I loved that I could get a smaller sized sprinkle dipped cone. The best thing was that at the bottom there was a chocolate surprise! They had all sorts of different ice cream concoctions which we will have to return to try.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Nm09uwpZUxNelvGfz7rqbw/348s.jpg", "caption": "Vanilla custard with chocolate sprinkle dipped cone"}]}}, {"review": {"des": "I just want a scoop of ice cream cone then that girl said I have to mix it<br>Shame on you scoter", "pics": null}}, {"review": {"des": "Decent place! They have lots of really fun combinations and the prices are on par with most of your specialty ice cream shops. Everyone working there seemed really frazzled and kind of bitchy-- it was like a random April day? I can't imagine how they must feel in the middle of summer. The custard itself doesn't hold a candle to my beloved Lickity Split. I'm glad I gave them a try and if I lived in the neighborhood I would definitely go back again for a treat but I won't go out of my way to come back again.", "pics": null}}, {"review": {"des": "amazing. get their boston cream shake with chocolate. thank me later. <br><br>I also like their Elvis shake. Will try their PBJ shake next.", "pics": null}}, {"review": {"des": "What a cute place! I can't have a lot of sweets, so the smallest size is perfect for me. There are plenty of workers and you get your ice cream before you can even finish your ice cream dance.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/IQceBynmqrnvD-Q6f4UrpA/168s.jpg", "caption": "Turtle sundae"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/mM5ZZl6c_JqUdDBR02AbXA/168s.jpg", "caption": "Mini cone"}]}}, {"review": {"des": "Decent. But, all flavoring is from candy you can buy in a store or nuts or something else mixed into custard that appears to have been purchased from a manufacturing plant. Disappointing.", "pics": null}}, {"review": {"des": "Frozen desserts are my weakness, but I have a confession: I've always hated peanut butter & jelly. Thank you, 13 years of awful public school lunch. <br><br>But I've come to conclude that maybe--just maybe--it was a combo of the stale, crusty, cold bread and the watery peanut butter all along that ruined my appetite for PB&J, because I absolutely enjoyed every bit of my PB&J concrete. It made me forget about the cheap, awful stuff I had in school and for the first time in my life, I'm actually able to enjoy something peanut butter & jelly flavored. I think both the peanut butter and jelly flavors balanced out and neither overpowered one another, but you can definitely taste the delicious grape jelly flavor and the peanut butter flavors, respectively. I haven't had much concretes in my life (other than Shake Shack), so I can't really compared, but it was thick enough for me and the serving size was reasonable for about $4 a cup. They have a lot of drool-worthy flavors, and I had my eye on the strawberry concrete in particular, but couldn't resist the sound of PB&J concrete. Worth the travel if you're not a local. <br><br>For now, all I can say is...It's Peanut Butter Jelly Time!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/waHFG4K7YKTIQ0JK3WSCUA/348s.jpg", "caption": "Peanut Butter & Jelly"}]}}, {"review": {"des": "Scooter's is a Lakeview staple. I've been here several times and their custard is amazing. It's always busy but the friendly staff manage the crowds well so the line moves quickly.", "pics": null}}, {"review": {"des": "Been coming to scooters for years now and it's simply the best. There aren't many places in Chicago where one can find custard, not to mention a place where you can find custard and Chicago dogs. <br><br>The concretes are awesome, big fan of the Elvis. Not to mention the scooter dog option, which is a Chicago style hot dog with scooters signature red pepper relish.", "pics": null}}, {"review": {"des": "Best frozen custard in the city. Love the mix ins and freedom to make every treat your own!  I'm happy I live far enough away so I'm not there everyday!!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/MK5BuB3jQbx-2umNzDU4vw/168s.jpg", "caption": "Pie crust and Reese's"}]}}, {"review": {"des": "Love this place! Always make a point of bringing friends who are visiting from out of town, when they're open for the year :)  I'm already looking forward to spring!", "pics": null}}, {"review": {"des": "Omg! So amazing! The line moves so quickly and the custard is definitely worth it! As being a human with taste buds goes, cookie dough is my obsession. When paired with amazing custard, you have the dynamic duo! Me eating it? Then we have hit the trifecta. I loved my experience there. The employees are beyond friendly and efficient, even with the summer rush of custard eaters! Highly recommend this place! It has my seal of approval.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/j8BInTfvsLbPI3HKfQj3tA/348s.jpg", "caption": "I miss it already. Cookie dough and vanilla custard. Amazing."}]}}, {"review": {"des": "If Yelp had more stars, I'd give it more. This custard is absolutely life changing. I had it for the first time last night and am still thinking about every delicious bite. The custard is homemade in house so it's fresh and prepared perfectly. The staff is energetic, friendly, and good at giving recommendations. The owner even chatted with us for a while and it was cool to see how passionate she is about this place. <br><br>It's on the border of Roscoe Village and Lakeview and has a bunch of parking around so there's no excuse not to try it out! Can't wait to go back :)", "pics": null}}, {"review": {"des": "Highly overrated. The custard really is bland. The ingredients added are so cheap that I got sick from their signature strawberry concrete. The prices are so outrageous I see how they can close half the year!", "pics": null}}, {"review": {"des": "Custard is delicious, but a \"One Scoop\" waffle cone for the past 31 years has been about 2.5 scoops of custard. At Scooter's it is one scoop. And since their prices are high, this is not worth it.", "pics": null}}, {"review": {"des": "I heard they carried a good fresh frozen custard so came in here on my way home and decided to try the pecan pie concrete. <br><br>What a disappointment! There were not bits of pie at all, but just powdered graham crackers with dry pecans. I would have expected some sugar glazed pecans or something to sweeten up the concrete if it is going to be called a pie concrete. <br><br>It was the concrete of the day, too, so I expected a lot more from this place and also disappointed in the price point. The small concrete was over priced for the size of the cup they serve, too!", "pics": null}}, {"review": {"des": "The perfect neighborhood ice cream spot. Scooters is a great community restaurant where you're sure find a wide variety of folks. Plenty of children after sports games, young couples walking their dogs, and even older couples on their way home from dinner. The one thing they all have in common is their love for Scooters frozen custard. Man is it good! Scooters also has Chicago dogs(if you know me at all you know I die for a good Chicago dog) as well as their special Scooters dog which is basically a Chicago dog but they add spicy red relish...Delish!!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/HE3VlARZaRKO0q00be392w/348s.jpg", "caption": "Menu wall"}]}}, {"review": {"des": "I found this place on Yelp, in preparation for my trip to Chicago. I was trying to find a good dessert spot to ease my sweet tooth while exploring this new city. First off, if you are a tourist, this is about 15-20 minutes give or take from the Magnificent Mile. It is in a residential neighborhood, which makes it more appealing as independently owned making it seem like a good contenter, right?? I ordered the Elvis concrete via recommendation Maybe it was our mistake trying to rush back to our hotel downtown, as it melted slowly but the ice cream itself was not impressive. Not bad per-say, but not worth going out of my way to get it. The ice cream was creamy but not the custardy feel I was expecting. Unless you happen to be near Wrigley Field or this neighborhood area, I wouldn't go out of downtown just to try.", "pics": null}}, {"review": {"des": "I love how this place is small and has just a handful of flavors each day.  That tells me that 1) They make them fresh daily and 2) they clean out the machines daily.  <br><br>My kids had vanilla custard with sprinkles...a lot of sprinkles.  The serving size was plenty for the kids and they loved all of the sprinkles. <br><br>They have seating in the back as well as bathrooms and an area for kids to color. <br><br>If you do not want to deal with that, you can go up to their walk up window and order custard.  The line went quickly for us and the place got busy fast, but I never felt rushed or stressed.  There is parking nearby on the street.", "pics": null}}, {"review": {"des": "The custard is delicious. I love that they have vanilla, chocolate, and one daily flavor. It makes for a non-overwhelming ice cream experience. I also love the toddler cones! For a dollar, you get a tiny cone that's just enough to enjoy a little.", "pics": null}}, {"review": {"des": "The custard was good. But this place is waaaaaay too over crowded with their vanilla lakeview customers. The menu was confusing and hard to read behind all these people waiting. And you feel rushed to order so you end up getting something vanilla.  Go to Lickety Split instead if you're not part of this neighborhood.", "pics": null}}, {"review": {"des": "I've been an avid fan of Andy's in Evanston for the past four years, so that was my point of comparison when I visited Scooter's. I hesitated buying custard (I had just come from Kuma's corner and Black Dog Gelato), but figured I should leave Chicago with a bang. <br><br>I ordered a small Java Lava (vanilla custard with coffee syrup, crushed oreos, and fudge) for $4.99. I can't say that it was particularly different from Andy's, although I will say that the consistency of the custard was slightly thinner and runnier (Andy's is very dense and sticky). <br><br>I personally prefer the denser texture profile so minus one star for that, but besides that a very solid place for custard!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/rSOoMFHjk_QN8l6zF0xpJg/168s.jpg", "caption": "Small java lava"}]}}, {"review": {"des": "I've discovered this place last year when a friend of mine wanted to \"take me out for ice cream\". i have been coming back ever since. I am very anal when it comes to ice cream and i kind of stick to what i know and like. Their Vanilla ice cream is soooooooooooooooooooooooooo tasty YUMMY. I try  to go to Scooters at least 3-4 times a week in the summer time to get my ice cream fix. <br><br>The only down side is the FREAKING TRAFFIC getting there. It doesn't really matter where you are coming from; the traffic on Belmont is pathetic!<br><br>I give these guys a 5 star every day of the week!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/hncA20K1BHwZO5IPCADueA/348s.jpg", "caption": "Plain but gooooooodddddd"}]}}, {"review": {"des": "Holy crap this place is amazing!  I've been wanting to try scooters for quite some time but it's so far north that were rarely in the neighborhood. After dinner at low country we trekked over to scooters and I finally got my fix. How do they make it so velvety smooth??? I got the key lime, which happened to be the flavor of the day. It could have been a bit more tangier but nevertheless it left me satisfied. <br>Also as a side note, they give free dog ice cream for dogs with a purchase!  I wish I had my dog with me so he could have a frozen treat too!", "pics": null}}, {"review": {"des": "This place holds a very special place in my heart.  Used to go here a lot in hs during the summer when it was always busy! My favorite is strawberry concrete- the frozen custard is perfectly creamy and dense and the strawberries are sweet and kind of syrupy.. The best combo, really.  I also tried their Elvis, and it is good when I crave extra sweet things. I do wish I lived closer to this place but I know I can always come and count on their frozen custard!!", "pics": null}}, {"review": {"des": "Super friendly service.<br>Free water from their self-serve cooler.  Because you get hot walking from the park or thirsty after some cold treats.<br>Clean bathrooms for customers (including a low sink so the kids can wash their own hands without you having to hoist them up to a standard height sink)<br>Walk up window.<br>Benches and flowerbed seating outside.<br>A nice hop, skip and a jump from one of our favorite parks--Fellger Park.<br><br>Oh yeah and frozen custard.  Let's not forget the cool and cream frozen custard. <br>Plain, concretes, shakes...there's so many choices to soothe your cool treat craving.<br>Chocolate with sprinkles for the kid.  A small strawberry concrete for me.  Tasty, fresh and just wonderful. <br><br>5 cool stars!", "pics": null}}, {"review": {"des": "Super delish, priced a litter higher than Cold Stone, very basic little space. LOADS of little kids, as one might expect on a summer evening, and some were super noisy, but most were outside. Dogs, too! Scooters will give paying customers a free toddler cone or doggie cone (they cost one cent if you don't buy anything else) if you show up with a toddler or dog. (No dogs indoors, but there are benches on the sidewalk outside.)", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/uqFfvEE12_YpFPbBRw3hSw/348s.jpg", "caption": "Caramel fudge nut brownie chip concrete, size regular"}]}}, {"review": {"des": "We got a few things but the only thing that really impressed me was the Java Lava. You could say that \"I lava-ed it.\"", "pics": null}}, {"review": {"des": "I was pretty tipsy when I stumbled upon this place. Holy yummy frozen custard!!! I ordered chocolate because I didn't see they had a coconut cream pie option!!! Darn! A little pricey, but oh soooo delicious. They have some solid menu creations there. Definitely worth the visit!!!", "pics": null}}, {"review": {"des": "I got their cherry concrete of the month. Absolutely delicious. Loved the graham crackers with it and cool whip on the top.", "pics": null}}, {"review": {"des": "Best frozen Custer in chicago. <br>I like the fact that there is something different on the menu but my wife's favorite is the cfnbc.<br>Mine is the elvis but I always switch it up and try something different.  A must try really you won't be disappointed.", "pics": null}}, {"review": {"des": "Oh Scooters, it's good to have you again. The concrete of the month is/was Banana Cream Pie, redolent with the flavors of fresh banana and vanilla. I upped the ante with the addition of hot fudge and toasted pecans. Yummmmm.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/8ctMI3UskdEHMtf817IWeg/348s.jpg", "caption": "Banana Cream Pie concrete of the month + hot fudge + toasted pecans."}]}}, {"review": {"des": "After hearing so much about Scooter's, I finally got a chance to try it today and I'm so glad I did! <br><br>Every time I drive by, there is always a line. After having brunch nearby, I decided to drop by just to see how long the line was, and to my surprise - there was none! I was already stuffed from a big brunch, but could I really pass up the chance to get this famous frozen custard I had heard so much about, and with no wait? After calculating the risk/reward ratio between a super yummy dessert and a deep food coma on a Friday, I willingly took the plunge (or, as the poet Drake would put it, I said 'YOLO' and decided to go for it). <br><br>I ordered the PB&J concrete which was so so good! The custard was just the right texture - not too light and not too dense (shout out to Goldilocks - you'd love it girl). I like my PB&J's more J than PB, and the PB&J concrete is just that - a good amount of jelly and just a hint of peanut butter.<br><br>I am definitely going back to try all the other items on the menu. I can only imagine how great this place would be on a hot summer day. Scooter's is actually on my way home from the gym, which is really bad news for my summer goals...oh well!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/7zyITzf1J7D_AEoewyI-MA/348s.jpg", "caption": "PB&J concrete - so good!"}]}}, {"review": {"des": "Tasty but pricey. The wife and kids love it, they have great ice cream/custard. Lower the price for five stars.", "pics": null}}, {"review": {"des": "5 stars doesn't do Scooters justice!!<br><br>This is such an awesome little neighborhood place to get some frozen custard. I've made the rounds in the Chicago ice cream/custard/gelato world and Scooters is easily one of the best!<br><br>They have an outdoor ordering window which is great if you have a stroller, dog or army of small children. They always have a new flavor of the day to go with the standard vanilla and chocolate. You really can't go wrong with anything you order. I almost always get a concrete because I can't resist reese cups mixed with whatever delicious flavor the came up with for the day. The kids working are always really friendly and you get a good amount of frozen custard without breaking the bank.<br><br>Stop in early and often all summer at Scooters! It's definitely a great place to cool off and get a tasty treat!", "pics": null}}, {"review": {"des": "Woohoo!  It feels happy and breezy today with temperatures in the high 40s.  So let's all go to Scooter's!  Yeah!!! <br><br>Chocolate, vanilla, and the flavor of the day was peanut butter swirl!  Concretes, shakes, sundaes, cones, lots of selections for cones and toppings.  <br><br>We tried the peanut butter chocolate shake and the strawberry pineapple concrete.  Tastes like summer.  <br><br>Efficient staff, indoor seating is limited.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/h9gvVUWhHXelyqcWc4Zh9A/348s.jpg", "caption": "Small strawberry pineapple concrete and chocolate shake with peanut butter."}]}}, {"review": {"des": "This place is adorable. From the little doggy cones for our four legged friends to the itty bitty cones for the toddlers stumbling into the store. <br><br>Boy and I came here with a friend on Saturday after lunch at Cho Sun Ok. It wasn't busy at all, but the menu wall was kind of overwhelming from an aesthetics point of view. Perhaps it's time to invest in an actual menu board? Even a chalkboard would work! But everything started to blend together. <br><br>I ordered a strawberry oreo waffle cone and it was tasty. I like that they have new daily custard and italian ice flavors. The pineapple tropical mix that the boy got was alright. Tasted like it was made from canned pineapples.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/384jaeNo0iX6NQgaZNCd4g/348s.jpg", "caption": "Part of the menu."}]}}, {"review": {"des": "I had the blueberry pie concrete - custard, pie topping, Graham crackers and a dash of cool whip on top.  <br><br>My four stars is the disclaimer that it molded into a spoonful of sweet sugar and lost all of the individual flavors.  Couldn't taste the creamy vanilla custard at all, indistinguishable.  Next time, I'll opt for a sundae where the flavors are layered to allow for some variety in the bite.", "pics": null}}, {"review": {"des": "I came here on a Sunday around lunchtime. I heard good things about this place so in I went. They had 3 flavors- chocolate, vanilla, and their burnt sugar. I went with the burnt sugar small-sized concrete with cookie dough as the mix-in. The total came to $5something, a bit pricy for the amount. The burnt sugar flavor was good, but nothing spectacular. The texture of the custard was soft and melty, like soft serve pretty much. I'm more a fan of premium ice creams with little air churned in, loaded with plentiful mix-ins (hello Ben & Jerry's Oatmeal Cookie Chunk!) so this place & their product was just good for me. I did like that each spoonful of ice cream had a cookie dough ball though :)<br><br>EDIT May 2013 - I'm downgrading this to 3 stars because I had amazing, life-altering cookie dough ice cream from Ohio's 2nd Street Creamery - chocolate chip cookie dough balls, chocolate cookie dough balls, and a cookie dough swirl at $3.20something for a pint.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/LSSAT8rxXcH5oW3oK_eM9w/348s.jpg", "caption": "Burnt sugar with cookie dough mix-in. Small size came to $5something"}]}}, {"review": {"des": "Was expecting a Wow for my taste buds. And they delivered.  Thank you, Thank you very much....", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/b8wIJ3BTG3MbJwQVJE1TuA/348s.jpg", "caption": "The Elvis & coconut cream pie"}]}}, {"review": {"des": "Oh wow! This place is AMAZING!!  I had the peanut butter & pretzel concrete, which  was so good and so creamy. Loved the big chucks of chocolate covered pretzel mixed in. I'll have to come here more often.", "pics": null}}, {"review": {"des": "I don't even like ice cream that much but this place is awesome!  Their plain vanilla in a waffle cone is my go to.  The ice cream is always smooth and creamy, and the portion is huge! They also have tiny baby ice creams for dogs and puppies, and mine LOVES them.  Also, very convenient is that they have a window on the side of the building were they take orders.  On a nice day, there's always a ton of adults, kids, and pets getting ice cream and enjoying it outside!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/3ztDngzkawj_7RDLnyB0Kw/348s.jpg", "caption": "Vanilla and tiramisu"}]}}, {"review": {"des": "Scooter's is the best frozen custard I've ever had. Ever! I worked in a hometown ice cream shoppe all through high school, and Scooter's is even more delicious than that! They usually have high school kids working in there, so sometimes the service isn't spectacular, but the owner is usually there, too, and she's great! Chocolate custard with chocolate syrup, brownies, and chocolate chip cookies is my go-to. Yum! I can't wait for spring to be here so they will reopen!", "pics": null}}, {"review": {"des": "I love frozen custard and Scooters is the best in the city. I wish there were more frozen custard in the city. So smooth and creamy!! On a hot day we would sit outside Scooters on their bench and enjoy a cone. It gets pretty crowded.", "pics": null}}, {"review": {"des": "This is my favorite ice cream place in Chicago! Try the Elvis with chocolate ice cream... the key is to order from the side window on busy days.", "pics": null}}, {"review": {"des": "I went with a small flavor of the month which happened to be blueberry pie. It was delicious! The boy went with a large CFNBC which stands for caramel, brownie, fudge custard I think. His was pretty dang tasty too. I would absolutely stop back again!!!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/xETbkDzzWimKnyVjbByEuw/168s.jpg", "caption": "Cfnbc"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/KLjeCb5v_OtMxXIDTS1VGA/168s.jpg", "caption": "Blueberry pie flavor of the month"}]}}, {"review": {"des": "It's a summertime favorite so I decided to check this place out one more time before it goes into winter hibernation mode.<br><br>Ice cream can be bought as concrete mixes where they candy/cookie/fudge it up on the spot. I prefer just ice cream, so I got a tub from the freezer and from there contains other flavors than the standard vanilla, chocolate and specialty flavor. I was on a berry kick, so I got the black raspberry. Perfectly sweet, nice fruit flavor, but the ice cream melts pretty quick for being a custard.", "pics": null}}, {"review": {"des": "Great custard!! I got a waffle cone with Drumstick flavored custard. That's waffle cone pieces, chocolate chunks, vanilla custard and peanuts...soooo good! Not a long line. Not a long wait for our order. They offer a Scooter Dog, a Chicago style hot dog with sweet red pepper relish. Delicious! Will definitely be back.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Y86HexEn4WlzeVvaCVXl9Q/168s.jpg", "caption": "They have Awesome cream soda!!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/_7t0BIBrA-I5n5EX-Ck-pw/168s.jpg", "caption": "Nice space. Small but clean and comfy."}]}}, {"review": {"des": "So I picked up a couple pints of ice cream right before they closed, having previously been there once.  I got Whiskey Caramel and Raspberry Truffle.  I would have given them five stars, but the Raspberry Truffle was incredibly lackluster.  I really just got a pint of vanilla custard with a meager swirl of raspberry jammy stuff.  There were a few chocolatey bits swirled in there, but that's just what they were...chocolatey bits with none of the texture of truffles (yes, I understand it's frozen, however, if they're truffles they should have at least some give).   I was honestly expecting something a bit more luxurious and was terribly disappointed with my scantily clad vanilla fare.  Maybe I got what they scraped off the bottom of the barrel, but either way...no bueno.<br><br>However, the Whiskey Caramel was to die for.  The caramel was boozed up nicely, as to retain a gooey texture even in frozen state and had a delectable buttery, sugary, whiskey-ey flavor.  There was also plenty of it whirled into the mix, giving every bite a special and unique flavor.  This was also sweet, but not overly sweet.   <br><br>Perhaps I'll revisit in the spring time with a higher rating once I've sampled some more items.", "pics": null}}, {"review": {"des": "Very very good ice cream.  Nice staff.   I would highly recommend this place.  Three stars based solely on the high price and small servings.", "pics": null}}, {"review": {"des": "I love scooters. Love it. They have so many options and the flavor of the month is always fun to try. They have a walk up counter outside and also a counter inside. There are places to sit both outdoors and indoors. They even have free doggie cones if you bring your dog. It's very family friendly too. I highly recommend it. I haven't brought a friend here that hasn't liked it!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/X9YUfdImvyBieqlR2vZ6KQ/348s.jpg", "caption": "Chocolate with Oreos"}]}}, {"review": {"des": "Scooters is one of the top two ice cream places in Chicago. The concrete of the month is usually the way to go, banana cream pie and pecan pie are a must! The workers are friendly and the line moves fast. Can be a little pricey, but worth it! The mix-ins are always fresh and the ice cream, delicious!", "pics": null}}, {"review": {"des": "Chances are, if you're driving past Scooters you'll see a huge line full of men, women, children, grandparents, dogs - everyone and anyone in the neighborhood. And that's for a VERY good reason.<br><br>This sweet delicious shop is out of this world!! I used to live dangerously close to Scooters, which of course was a blessing and a curse. My husband and I would frequently turn to each other after dinner and with a simple look knew what we both were thinking....let's walk over to Scooter's. <br><br>The beauty of it was that we convinced ourselves that not only would this allow us to get a delicious evening treat, but also we were getting in an exercise in by walking over there pluuuuuus we could get the dog's walk out of the way by bringing her along. Really, it was a win-win-win. Oh and everyone knows frozen custard calories don' t count.<br><br>Their concrete concoctions are scrum-diddly-umptious. My favorite concrete of all time is the chocoloreo. If you love chocolate, cookies and perfection in a cup - give this a whirl! Scooters has a ton of sweet options. All different flavors of frozen custard - in a cup, a con, a smoothie a Sunday; the options are endless. <br><br>Everyone who works here genuinely loves what they do. How can they not?! They are surrounded by dessert great-ness and they spend their days putting smiles on people's faces - just fabulous!<br><br>Pro tip: Bring your pooch along! You get a free doggy cone with any purchase", "pics": null}}, {"review": {"des": "I thought I would not find frozen custard like I used to be able to get as an undergrad.  I was wrong and now i'm upset I haven't visited here before!<br><br>We lucked out and didn't have to wait at all.  It was my first visit, so I went small with vanilla custard and strawberries.  So delicious!  Creamy, perfectly sweet and the strawberries were fresh and really tasty.  <br><br>Service was friendly and the only thing I found difficult was deciding what to order!<br><br>I've seen this spot in warm weather and on weekends - always a line!  Definitely worth it, though!", "pics": null}}, {"review": {"des": "3.5 stars, really. Scooter's has well-priced custard that is clearly beloved. My friend has the banana cream pie custard and was very pleased. I had the CNFBC concrete and was a little disappointed - all the (very tasty) brownie was at the top and the caramel was painfully sweet and wound up overwhelming everything else. I would go back and try something else, given their reputation, but with options like Bobtail nearby I'm not sure I will...", "pics": null}}, {"review": {"des": "You can keep your 10,000 froyo places...just give me a Scooter's and I'm living in frozen custard heaven!<br><br>They always have chocolate and vanilla, and there's a new specialty flavor each day.  If the day's specially flavor is Coffee Toffee, RUN, DON'T WALK!!!<br><br>Should've gotten the large...", "pics": null}}, {"review": {"des": "Good frozen custard but FAR over priced in my personal opinion.  It would also be nice if they had a 'kids size' cone or cup.  If you want 3 small ice creams and a small concrete plan to spend close to $30.", "pics": null}}, {"review": {"des": "How have I not reviewed Scooter's!? This is basically my favorite go-to dessert place!! <br><br>Amazingly creamy custard treats, love love love the chocolate! Scooters has most any ice cream topping you can think of too. The concrete combinations are unique and delightful. I have yet to try one that wasn't good. My all time fave: the Java Lava. Ask for extra fudge if you're feeling particularly decadent!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/5Cq2p20UlOM5KV01gj1BcA/168s.jpg", "caption": "Java Lava, yumm!"}]}}, {"review": {"des": "Scooter's is my favorite place in the city to grab a treat on a hot summer day.  Their prices are reasonable, and even if there is a long line, it moves quickly so you can get to enjoying your custard very soon.<br><br>Their concretes are thick and have a ton of different options for mixing in with your custard.  They have a few standard offerings (banana split, etc.) and a daily custard flavor that repeats every few weeks or so. They also have a freezer with some pints of custard for those in a hurry.<br><br>I've had a few different kinds of concretes and a malt, and my favorite is the concrete.  You can tell that the pieces of candy bar that get mixed in are actual candy bars that they chop up and not pieces from a bag.  It really makes a difference in the taste.  If you do decide to go for a large, make sure that you are hungry, because they are really big.", "pics": null}}, {"review": {"des": "Ughhhhhhhhh why is frozen custard so good? <br><br>Came here on a busy summer night and Scooter's was packed with people/puppies of all ages, spooning buttery frozen custard into their mouths. <br><br>I had a simple chocolate fudge/strawberry kids sundae and it was da bomb. Also, my favorite part about Scooter's is their free baby size mini cones. How can you say no to a side of ice cream with your ice cream?", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/2ZuhtMI-S1ck3jwg4U63mA/348s.jpg", "caption": "Kids fudge/strawberry sundae with baby vanilla almond cone"}]}}, {"review": {"des": "A+ custard. Good work.<br><br>Ordered a regular vanilla/chocolate mix with peanut butter and bananas. It was so delicious and plenty enough for two.<br><br>Fast service as well. My order came out in under a minute. A little expensive, but I'd definitely return.<br><br>So yummy!!!", "pics": null}}, {"review": {"des": "Best place ever. My go to is a strawberry and banana concrete. My kids love the worm sundaes. The pies are outstanding and the perfect party dessert. Yes, it's not cheap but the custard is outstanding.", "pics": null}}, {"review": {"des": "I love frozen custard. I usually will drive all the way to Evanston and get Andy's custard. I'm glad I found Scooter's. <br>I have been here few times now and every time this place has a looong line and customers are always so rude. Either cutting in front of you or bumping into you or have an attitude at the workers here. They're working as fast as they can. Be patient. Geez<br><br>Anyways, I always get the vanilla small cup or custard and my bf always gets the special of the day. He tried the strawberry oreo today and I actually had some. I thought it will be strawberry custard mix with oreos but it was actually vanilla custard mix oreo with strawberry syrup on top. It was so delicious and smooth and it wasn't that sweet at all which I like. <br><br>The last time my bf had chocolate peanut butter.  It was delicious as well.  Chocolate custard mix with melted peanut butter. Omg. <br><br>If you're in the neighborhood and wanted some dessert. Please stop by Scooter's.", "pics": null}}, {"review": {"des": "The custard here is amazing!<br><br>Stopped in for a cone and service was quick but the register lady had an attitude and wasn't the nicest to deal with.<br><br>Got the classic small vanilla cone and was happily met with two big scoops of the creamiest, richest vanilla custard ever. I was fully but continued to consume the entire thing.<br><br>Props for the quick service, but hopefully next time the service will be a 'lil better.", "pics": null}}, {"review": {"des": "I love frozen custard and this place did not disappoint.<br><br>I had a chocolate custard with Snickers bits and chocolate sauce mixed in - it was rich and creamy and perfect.", "pics": null}}, {"review": {"des": "What a waste of money. I went here with my friend and both of our custards were disgusting. The main problem was that they were both sickly sweet. It was basically a mouthful of sugar. I got the take on cookies and cream while my friend got some kind of apple pie custard. I LOVE custards, ice cream, and ice cream shakes and this place takes the crown for the most disgusting frozen dessert I have even eaten. <br><br>Listen I'm really confused because I read all the raving reviews about this place. Maybe we got a really really really bad batch? An intern accidentally dumped a few bags of sugar into the custard? I don't know but I'm scared to try this place again. I was scarred for life. So disappointed because custard/ice cream/shakes are why I workout like a maniac.", "pics": null}}, {"review": {"des": "The custard is top notch, easily 5 stars every time we go.  We gladly make the trip from Hyde park whenever we want ice cream.<br><br>BUT, the more times I go, the more annoyed I get with the process of going to scooters.  The shop is HORRIBLY laid out, leading to mass confusion which continues to get worse as more people and excited children pour in.  There is NO place for a clear line to form, NO place for an organized pickup to happen, NO place to sit indoors where someone won't be 3 inches from you in the line or looking at the menu (unless you move to the seating in the back near the bathrooms).  We have noticed inconsistent cone sizes each time we go, and last night I couldn't figure out why my concrete was dripping all over (despite the fact it was insanely over filled), later to find out in the car my cup was cracked along the bottom.  Thankfully I happened to have an extra empty cup in my car to double up with, but overall I was overwhelmingly annoyed now that custard had trickled all down my clothes and in my car.  This all sounds petty, I get that.  But I am a small business owner as well, and we put a lot of thought into the layout of our shop so that the customers' experiences are pleasant in every way.  Even though I'll be a lifelong scooters customer (as long as they don't change their recipe), I hope at some point the ownership fixes these issues, as well as the sewage smell that sometimes lurks in the air.", "pics": null}}, {"review": {"des": "It's just an okay place to grab frozen yogurt for dessert. I've tried a better one in Champaign, IL. It's called Jarling's.", "pics": null}}, {"review": {"des": "This place is overrated. It wasnt even worth snapchatting. You pay around $5-6 for a small serving of frozen custard. Go to Margie's if you want a cold treat. The cost to serving size ratio is better there and is just as tasty.", "pics": null}}, {"review": {"des": "YUM! Wish I lived closer.  The concretes at Scooter's are so good and the custard is delicious.  I love the combinations that they make and the flavors. They are patient with your ordering as you try to decide between the many tempting options written on the wall. Go when it's warm, they close in winter!", "pics": null}}, {"review": {"des": "I used to drive to Wisconsin just to get soft serve frozen custard a Adrian's, which was definitely worth the drive. Now I can go to frozen-custard-soft-serve-heaven anytime the craving hits.", "pics": null}}, {"review": {"des": "Serviceable in a pinch but badly pales compared to a real frozen custard place like Kopps in WI.  Turtle sundae was OK, custard did not have much flavor and pricing made me expect something much more than what I got.", "pics": null}}, {"review": {"des": "great ice cream, cool little place . Prices a bit too high! Fun to hang out here. Great outdoor seating during the warm months. Place not open during winter months. Amazing flavors that they come up with also and have a flavor of the day selection as well.", "pics": null}}]}