{"name": "seoul-taco-chicago-2", "reviews": [{"review": {"des": "Litetally just searching around Yelp for a good place to eat and plus points if it's budget friendly. <br><br>When we got here, they told me if this place was any good since we were the ONLY people there. I told them, \"well, we can try one dish and if we don't feel it then we go\" which sounded like a good plan every time  and guess what.. the dish we tried (Gogi & Waffles with Bulgogi Steak) was freaking amazing!!!!! <br><br>So we ended up ordering more food... like the tacos (spicy pork, chicken and bulgogi steak), quesadillas, burrito and another batch of gogi & waffles. <br><br>The servings were filling and the sauces were superb! And yes, Sriracha in anything is . They have 4 types of meat for your toppings (spicy pork, chicken, bulgogi steak and tofu) and I think I like the bulgogi steak the best. Flavorful and tender. I suggest to try everything (you can bec. it's cheap) but if you must try at least one, I HIGHLY recommend the Gogi & Waffles.  <br><br>Btw, people started filling the place up before we left. So, I guess they just gave me a moment to take good pictures of the place.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/o8gQiXyGHk3AUC6FcymQ9w/348s.jpg", "caption": "3 tacos for $8."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/cpoasqYr71KzZ5e6uNZ-WA/168s.jpg", "caption": "Quesadilla. So so but I still like it"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/_08G-F3kIwT3iRb6tn01-w/168s.jpg", "caption": "Gogi & Waffles. Sweet potato waffle fries, Cheese, Bulgogi steak, Kimchi, Green onions, roasted sesame and sauce."}]}}, {"review": {"des": "I've been here once before and it was during the end of my college career in Champaign, IL. Upon returning, it was nice. I walked in and was greeted immediately. The guy took my order quickly and walked me through the menu. I paid about $9 for the meal and it was pretty decent in portion size for one person. I wish there was a better spicy sauce to meal ratio because it was kinda thrown to the side. There was a lot of lettuce/ greens in the bowl but I don't mind my veggies. <br>Overall this meal was worth it and it's more so for those who are trying to eat a quick bit before class or for their 30 minute lunch at work. It doesn't weigh you down. <br>The atmosphere and scenery inside is also pretty dope. If I had more time, I would've sat down inside and enjoyed myself a bit. I definitely will be returning.", "pics": null}}, {"review": {"des": "I just simply did not care for the food here but the staff here was AWESOME!!!! Like some of the best staff I've ever encountered at a counter service restaurant. Everyone was ON TOP OF IT. Also, I went up to buy some dessert and the cashier remembered my name... FLOORED.<br><br>Anyway, I just didn't care for the food here. Besides the aforementioned dessert which was good though not incredible there's something about the execution of flavors that doesn't work for me. I had a burrito and it just needed something else. <br><br>That being said I do wish this place well as cool concepts like this definitely deserve to be checked out. So I would recommend, but I wouldn't go back.", "pics": null}}, {"review": {"des": "Gone are the days when you'll have to choose between Korean or Mexican, Seoul Taco has got you covered!<br><br>Honestly, I thought this was such a weird food concept when somebody recommended this place but I'm so glad I tried it out. I had the Tofu Gogi bowl, which was fantastic! I'd definitely recommend subbing in brown rice for a richer flavor. They too serve it with this fire kimchi sauce that is to-die for. Also, the Tacos are amazing and you won't go wrong with either choice. <br><br>The decor is very unique with this moody, retro vibe going on. They have variously colored stereos displayed on the wall. The interior is just as quirky as the menu and it's a beautiful balance. This is more of a fast-food/quick lunch spot rather than a dine in experience. It's perfect for a fast lunch when you can't decide between Mexican or Asian.<br><br>Go hit this place up if you're around or even if you have to travel to get here (it's definitely worth it).", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Fc6r-bMJWm9SW9gYjWNXpQ/348s.jpg", "caption": "Tofu gogi bowl x beef tacos"}]}}, {"review": {"des": "I got the bowl without the rice. It was pretty much a salad with protein, egg, and sauce. Overall I thought it was really good and decent sized for the price. I tried the chicken but I heard the steak was really good as well. <br><br>It is very similar to a chipotle. I would recommend trying it out!", "pics": null}}, {"review": {"des": "The beef is really Korean style! <br>Very very Authentic!<br>very <br>very <br>very <br>yummy!<br>Tips: you can also choose Tofu and pork or chicken .", "pics": null}}, {"review": {"des": "I was unimpressed initially about a year ago, but I am not sure what I was thinking.<br><br>The beef and chicken are both DELICIOUS. They are well marinated and bursting with flavor and tenderness. You can't go wrong with either! My friend liked the tofu, too, so I might have to try that next. These proteins, in turn, go very well with the thinly sliced vegetables and addictive sauces.<br><br>Any preparation - bowl, tacos, burrito - seems delicious. Customer service is friendly!", "pics": null}}, {"review": {"des": "Sick of getting the same exact boring burrito, bowl, salad or tacos at Chipotle? Looking for an interesting mix of Korean Bbq and Tex-Mex fast casual food? Look no further than Seoul Taco in River North. The bolgogi bowl or burrito is a MUST try, mixing flavorful kimchi fried rice, an egg your way, and juicy Korean inspired bolgogi steak into a perfectly portioned burrito or bowl for under $10 in the heart of downtown will not leave you disappointed! Fast and friendly staff, hip-hop casual vibe, and cool wall art surrounding the cozy restaurant is definitely worth the visit, or feel free to order straight from your couch. Absolutely love this place (holds a special spot in my heart as it originated in my hometown of STL) and highly recommended to anyone looking for a different twist on a classic staple!", "pics": null}}, {"review": {"des": "Tasty, affordable tacos, burritos and bowls. You can substitute for corn tortillas and also BYOB!", "pics": null}}, {"review": {"des": "I went back for the bulgogi burrito and sweet potato waffle fries. They were both amazing as were the other items that I ordered in the past. I'll be back for more of everything with bulgogi since it's so hard for me to pick my favorite item haha<br><br>The only downside is the long wait during lunch. Get there early if you can...", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/kGCi6wHl9HxOY3_tsmrLEg/348s.jpg", "caption": "Beef sweet potato waffle fries"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/BZ-FY_G785HkyMbkwNG9SQ/168s.jpg", "caption": "Beef nachos"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/qfhUF8TnxbrRiPWCjttI4A/168s.jpg", "caption": "Bulgogi beef nachos and sweet potato waffle fries"}]}}, {"review": {"des": "Omg!<br>Wish we had this in San Diego. I found this place through Yelp what sold me was the pictures of the food. <br>The best fusion tacos. Ever!<br>We were very happy with the portions & the service. Kesha(sp?) was super friendly and very funny. <br>We loved the way it's decorated and the choice of music they have playing. <br>My husband and I both got tacos. He got all the meats while I only had chicken. The sauce was super spicy and I love spicy! Keep that in mind if you can't handle spicy. <br>We will come back before we go home to our sad, \"regular\" San Diego tacos.", "pics": null}}, {"review": {"des": "I ordered the bulgogi tacos and the waffle fries with chicken. The bulgogi tacos were decent. The veggies that were chosen to go with the tacos did not bring out its flavor; However, I was truly impressed by the waffle fries. It was bursting with flavor. I was surprised by the fact that it was was sweet potato but it's actually not too bad.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/pkgtjRd0c8Si4T498RAs-Q/348s.jpg", "caption": "Waffle fries"}]}}, {"review": {"des": "I love anything in a taco. So I was super excited to try this place. It's overall good, but has some misses. <br>I would say if you come here, get the tacos, kimchi, and queso. Everything is else is not super flavorful, especially the kimchi rice. It's completely flavorless and I would avoid it. <br><br>My brother also tried the Gogi bowel. The vinaigrette was off so I don't recommend that either.", "pics": null}}, {"review": {"des": "My FAV burrito place in the city!!! I'm sitting here now as I write this post! It is great delivery or dine in but I mostly do delivery. Chicken/pork burrito are my favorites but my boy friend loves their steak! Everything else here (nachos, bowls, quest, etc.) are so good to but the burritos are the VERY best! They are pretty big too, and make great leftovers. You must try this place out!!", "pics": null}}, {"review": {"des": "I got a bowl and thought it was very bland.  There are so many fast casual options around that I have no reason to stop back.  If you are looking for bibimbop go a little farther north to Crisp for the best in the city!", "pics": null}}, {"review": {"des": "Love this place the flavors of the tacos are amazing. I could eat them every day. This place mixes my 2 favorite foods, tacos and Korean bbq. The sauce is amazing and the meat is seasoned well. Every time I come here the consistency of flavor and quality is perfection. I would definitely recommend coming here.", "pics": null}}, {"review": {"des": "This is my last review of Chicago eats for now and this Korean / Mexican joint is worth checking out. This is also within walking distance from Hotel Felix. It's not a big place but there's plenty of seating for singles and groups. FYI, I love the interior design and decor especially the colorful radio and headphone ensembles.<br><br>Ordering was simple. Go up to the counter, then select your taco, burrito, Gogi bowl, quesadilla or nachos and wait for your name to be called. I got tacos as usual w/ the bulgogi and spicy pork. They were pretty good. The meat was warm and chewy w/ a little kick and the shells were soft and didn't fall apart. The only thing about the meal was I didn't really taste anything different from one from another and they all looked the same. At least they were affordable. Only $2.50 each. Plus the food came out fast.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/b4vO61eMB_EWo4Hx7ByzMA/348s.jpg", "caption": "High top seating area"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Mq5tX1z8H3CM6ueSX6aThg/168s.jpg", "caption": "Bulgogi Taco"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/G6El85KHX-i6Ffn6BgCptQ/168s.jpg", "caption": "Spicy Pork Taco"}]}}, {"review": {"des": "You really should eat here! The decor is cool and interesting. Keisha at the counter was so accommodating and nice too. I had the Gogi bowl and my son had the beef tacos. Both were delicious and fresh and full of flavor. Definitely want to come back here! Loved it all!", "pics": null}}, {"review": {"des": "I love the food here for a quick/casual and unique dinner, whether a weeknight or weekend. The Asian fusion is tasty with good variety - kimchi yum. The staff has been great - Kesha went out of her way to remedy a mistaken order - what a rockstar!", "pics": null}}, {"review": {"des": "I've been dying to try their tofu tacos and kimchi fries . Met a girlfriend for lunch around noon, which was perfect timing . We beat the rush , ordered and was served quickly .<br><br>*order at counter /grab your number and your meal is brought out to you <br>*cashier wasn't too knowledgeable on the veggie options but thanks to my other Yelp friends .. I knew how to order what I wanted <br>* this is a no frills restaurant but the food makes up for that <br><br>He kimchi is just heavenly !! You can even buy some to take home", "pics": null}}]}