{"name": "serai-chicago", "reviews": [{"review": {"des": "Yum, I love this place. I'm from Singapore and the food is as closest to I have found to Singaporean/Malaysian cuisine away from home, with enough vegetarian option.<br><br>For starters, I love the roti prata. The vegetarian curry is divine. They definitely don't give it enough roti prata to finish the curry so I've gotten used to just drinking it on it's own too. Its a bit on the pricier side but the curry is so worth it.<br><br>For mains, the vegetarian laksa really hits the spot in the Chicago winter. Just ask them and they can make it vegetarian. The laksa may not be the most authentic but it is close enough to be tasty, spicy, coconutty and everything you want from a laksa. Similarly, the mee goreng is sticky, sweet, spicy and full of sambal. Close enough to the real thing.<br><br>Can't wait to try other dishes but I can't help but keep coming back for these ones! Love it and highly recommend it to anyone that hasn't tried this food either.", "pics": null}}, {"review": {"des": "Ordered carry out. Very impressed. The inside looks cute too so definitely want to go back and dine in. <br><br>Lamb Skewers Appetizer: great flavor and very tender. Not overpowering. Comes with three skewers per order. Nice start to the meal. <br><br>Mango Chicken: pleasant surprise. I opened it and got immediately disappointed because the sauce was watery, not a thick gravy like I was expecting and the chicken looked bland BUT oh my gosh, it was delicious! Because it's a thin sauce though, you'll want to make sure you dunk each piece of chicken in it right before putting it in your mouth; sauce doesn't stick to the chicken too well. The combination of the savory sauce and the tangy, sweet mango is fantastic! My only complaint which I recognize is a personal preference is that the pieces of chicken are huge. Wish they were more bite sized. <br><br>Mee Goreng: Yum. Just yum! I love all the Indian spices in this dish. The egg adds nice texture too. I really loved this. Everything was delish but this was my favorite. <br><br>I can't wait to dine in and try more of their dishes.", "pics": null}}, {"review": {"des": "We were in town for thanksgiving so I chose this place based on number of good reviews. There were 4 of us there and we ordered a bunch of dishes(they also have gluten free menu) but many of our items happen to be gluten free for one person in our party. <br>1)roti paratha with beef appetizer(the beef was good but they literally give u one small paratha)<br>2)Singapore noodles with pork- it was fine but was not fan of pork<br>3)beef rendang- beef tender (I am not fan but nothing wrong )<br>4)stir fried veggie (water chestnut or I forget name) smoky and good <br>5)shrimp fried rice - my favorite out of all entrees<br>6)coconut pudding - not impressed but maybe it's not that special <br>7)appetizer with sprouts and peanut sauce- ok<br>8)service- our server forgot water for one person in our party and we had to ask twice for it... otherwise fine <br>the three people I was with enjoyed the food. I thought it was just ok...I don't know if I am not a fan of Malaysian food or didnt like Serai but I thought Malaysian food in LA was good", "pics": null}}, {"review": {"des": "We visited Serai a few months ago and I really haven't thought about it since. The food was okay, the service was okay, and the atmosphere was okay.  <br><br>Nothing about my experience was memorable. I'd only recommend Serai if you want to order a dish that is specifically Malaysian or if you're looking for a nice dine-in restaurant. However, if you're going to order orange chicken to go, this place isn't any better or worse than other takeout places in the area.", "pics": null}}, {"review": {"des": "Came here on a weeknight with a reservation and were seated immediately. A server was with us fairly quickly to get drunk orders, but then curiously we had a different server wait on us 5 minutes later and ask us for drink orders. Throughout the meal they were both checking on us so I'm not sure if they were fighting over us or that's just how they do it here.<br><br>Anyway, we skipped the apps and went straight to our entrees. Generally, the menu is layer out such that the top 3-4 items in each section are the most traditional Malaysian dishes. I got the top dish in the noodle section, though I don't remember what it was called. I wasn't sure if I'd like Malaysian food but it was really tasty! I ate the whole thing, but then unfortunately I had some stomach issues afterwards. I'm not sure what caused this.<br><br>Overall, I enjoyed my visit and the prices are very affordable here. I might go back, though the discomfort I felt later may not be worth it again :/", "pics": null}}, {"review": {"des": "Came here for dinner on a Saturday night expecting some Malaysian cuisine, but a lot of the items on the menu seemed to be just a fusion of Chinese food. The waiter indicated that the top 3 items in each page of the menu were more traditional Malaysian dishes, and anything below were more Asian fusion. <br><br>The service was decent as the waiter doesn't come by much to check if everything is okay (you are giving a pitcher of water between two people so water refills weren't an issue. Also the water isn't soapy as other reviewed stated. Maybe it has changed). You'll just have to flag them down yourself if you would like to order more drinks and such. <br><br>Parking is rough around the area since everything  is zoned. You'll need to find paid for parking spots (even those are sparse in the area on a Saturday night, so plan accordingly). <br><br>We made a reservation, but there were many open tables (we had a 7:45 reservation so it's later than most dinners).", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/pk4ex9bL0R04Y9KxKILByQ/348s.jpg", "caption": "Pork Wonton Soup"}]}}, {"review": {"des": "Why, oh why, do the owners of Serai not check in on Yelp?! If they had, they would have seen the chorus of people chanting over and over to add a piece of roti prata to that set, or at least offer it as an option! We made sure right ask about it there too, maybe the feedback will someday reach the right ears.<br><br>Hailing from Singapore, and being Singapore-food-deprived, Serai was delicious to my tastebuds. <br><br>We had the roti prata which was good. Not as good as the ones in Singapore and 6x the price, but I'd still pay to have it here, half a world away. <br><br>The char kuay teow (done Malaysian not Singaporean style, of course) was simple looking as a dish, but delivered on punchy flavor. It was also unexpectedly moist, not dry a<br>s it looked - I was sold. The flavor does make up for the lack not ingredients such as chiney sausage. As I type this I'm thinking of swinging by for it tomorrow.<br><br>Partner had the nasi lemak with the rendang, which he said was delish too. That rendang was spicy and true to what it should be.<br><br>For the Malaysians and Singaporeans out there, it's worth your while to come by if you're craving anything local!", "pics": null}}, {"review": {"des": "So glad we came to try Malaysian cuisine with my Asian foodie friends. It's hard to find a decent south East Asian restaurant that you'll want to enjoy with friends. We certainly had a good time. My husband had their special rice noodle dish and it tasted so flavorful. He finished it within 5 mins. We tried the steamed potstickers and they came yummy and freshly made. Everyone enjoyed their food so much. <br>The service was good. It was a good crowd too and there are young people, families and groups hanging out. It has parking close by as well. I'll certainly come back and check out more dishes in the future.", "pics": null}}, {"review": {"des": "I had high hopes for this place, but it ended up tasting like spicy, overpriced Chinese food.  Maybe I just don't like Malaysian food?    Most of the fried noodle dishes don't seem to be spicy according to the menu descriptions, but my wife's noodle dish was intolerably spicy to her.  She sent the dish back and it came out totally bland.  Our theory is that they took her dish, washed it under the sink, and brought it back out to us.<br><br>I had the seafood clay pot noodle which was not spicy but had a weird flavor to it - maybe Chinese fivespice?", "pics": null}}, {"review": {"des": "I was not expecting to love this place as much as I did.  The flavor was unprecedented to my taste buds.  I got the Hainanese chicken and it was so tender and flavorful.  Also, the price is unmatched for Chicago.  We got two entrees, 3 drinks and it came out to around $50.  This is definitely a new staple!", "pics": null}}, {"review": {"des": "Can't beat this place in the area.<br><br>The number of times I have craved the Szechuan Chili Fish is shameful. It's kind of an odd place. If you can get past the 3 different look-and-feel sitting areas (bar area, restaurant area, and patio), and get past the water that always tastes the slightest bit soapy, and the very nice but sometimes odd-behaving staff, then Serai is an easy go-to spot.<br><br>Try everything knowing that this is more of a Malaysian/Singaporean restaurant than Thai. And maybe skip the water.", "pics": null}}, {"review": {"des": "1st time eating here and it was delivery<br><br>Sesame chicken was good there were a few pieces of brocolli in the mix<br><br>Mongolian beef was okay. I put no opinions because my husband doesnt eat onions but it just ended up being beef in a sweet sauce. No spices or anything.<br><br>Shrimp fried rice was great rhe shrimp were very large and the portion was big<br><br>Calamari - it was tasty but it wasnt crispy i think it may be because it was takeout. Id love to try this inhouse next time<br><br>The meat dishes came with side white ric<br><br>A little bit pricey but everything came faster than expected with friendly service. The food arrived warm and tasted good!", "pics": null}}, {"review": {"des": "Great place for Malaysian food in Chicago!<br><br>We ordered the roti pratha for an appetizer. We loved the bread, however, we could not order more on it's own without ordering the curry dipping sauce that comes with it. That was disappointing since we just wanted more bread. We also had the Hainanese chicken, which was very delicious.<br><br>Service was a bit slow, despite the restaurant not being too busy when we arrived. Our biggest wish is that they add the roti as a separate menu item so we can order more :)", "pics": null}}, {"review": {"des": "Our server was great and fun. The three chili chicken was really good & hot and everyone loved it.", "pics": null}}, {"review": {"des": "I had this restaurant bookmarked for awhile and finally had the chance to try. It did not disappoint. It was flavorful and delicious. I am not familiar with Malaysian cuisine so I excited to try something new. <br>My friends that I went with chose the dishes. I can say that I would like to go back and try more. The flavors are unique and it's another different Asian flare.", "pics": null}}, {"review": {"des": "Was watching Anthony Bourdain eat laksa in Indonesia on Netflix the other day. I realized I've never had that dish! So since we can't fly to Indonesia we went to Logan square to try out laksa and other Malaysian dishes!<br><br>The place looks like a hole in the wall on the outside but inside it's pretty spacious and clean. The atmosphere is still more strip mall than fancy but not bad. Our server was really nice and had great suggestions. The food is the star here! Great flavors and something different from our usual!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/hYURlC1NaKA1r-UnPFH77Q/348s.jpg", "caption": "the Roti was our favorite dish of our visit!! SO GOOD!"}]}}, {"review": {"des": "I would say this place is really 2.5 stars. Really enjoyed Malaysian food when I lived in NYC. Used to go to Nyonya all the time out in NYC, that's how I got introduced to Malaysian food. I bookmarked Serai for a while now to check out and saw they were available on OpenTable for 3 on a Friday night. Was pretty excited to try this place. <br><br>When we walked in, had a really good atmosphere. Interior design was really modern, thought it was going to be a good time. As soon as I got in, the host greeted us not so warmly and just immediately wanted to put us at a table. However I wanted my points on Open Table so I commented to the host to make sure you get my reservation on Open Table and he basically gave me a \"rolling his eyes look\" (that I do to so often to people lol) and walked away. WOW OK! When I first entered the restaurant I thought I would be greeted and the waiters would be first generation Asians but it was definitely not the case. It was very hipster, younger workers. I was still hoping the authenticity of the food would still be on point.<br><br>For food, we got Roti Pratha. It was delicious. The naan was very warm and soft. The curry portion was delicious as well. Ok not bad. For entrees, we decided to go with the Char Koay Teow, Beef Rendang, and Three Chili Chicken. The Char Koay Teow reminded me of a chow fun dish, Beef rendang was ok except some pieces of meat being really rough/hard and cold (yikes), the three chili chicken was delicious. Now here's where things went south. The noodle dish came out first. Fine cool. The beef rendang dish came out 2nd about 10 minutes after the noodle dish came out. Then the three chili chicken came out about 25 minutes after the noodle dish came out. Funny how when we mentioned to the waiter we were still waiting on the three chili chicken dish, it miraculously came out in like 2 minutes. HMMMMMM.<br><br>I like Malaysian food. I would like to give this place a second chance. But the service was brutal. Not saying the waiters were mean or anything far from it, but the host rubbed me the wrong way, and I'm not sure why they delivered our food out like that. Got some cocktails too, asked the waitress this time what was the special and it was a dirty martini. No idea why I decided to get that. It was gross. Just because I wanted to save a couple of bucks on a cocktail. Noob decision on me. At the end of the day what I always realize is that service at a restaurant can always make or break your time. Unfortunately in this case, it broke it for me. <br><br>Summary:<br>Host: 1 out of 5 stars<br>Waiters: 3 out of 5 stars (docking two because either our food was forgotten or it came out pretty poorly<br>Roti Pratha: 5 out of 5 stars. Delicious, but warning it's small for 3 people. <br>Char Koay Teow: 3 out of 5 stars. Nothing spectacular. <br>Beef Rendang: 2 out of 5 stars. Some hard rough pieces of meat. Some were cold as well <br>Three Chili Chicken: 5 out of 5. Delicious!", "pics": null}}, {"review": {"des": "Southeast Asian cuisine, particularly Singaporean and Malaysian, is thin on the ground in Seattle. There were times my craving for authentic laksa went unfulfilled. Prior to my Chicago trip, I had done a bit digging and found Serai that eventually filled that void. <br><br>Some reviews suggested advanced reservation so I did it through Yelp. It later turned out that the place was empty when I came during lunchtime, perhaps because it was Christmas Eve.<br><br>We had: <br><br>*Laksa<br>YES!! It's been a while since I had good laksa. The broth was savory and silky and the shrimps were fresh! The noodle was slightly overcooked but it wasn't a big deal. By the end of the meal, there was no single drop of broth left. No, I'm not joking!<br><br>*Hainanese Chicken Rice<br>A classic Singaporean-style dish that never fails to comfort my soul. The chopped chicken was served with soy sauce + chili on the side.  Paired with the fragrant and fluffy hainanese rice, this dish is hard to resist!<br><br>*Fried Calamari<br>I'm very picky when it comes to seafood but this calamari blew me away! It was crispy, flavorful, and had this addicting smoky aftertaste. I approve! <br><br>*Coconut Pudding<br>Two of my favorite things being presented in front of me *insert happy tears emoji here.* What I did was scraping all of the coconut meat off first before eating it with the silky pudding. Hmmm you just have to try it! My description won't do the justice to its heavenly taste! <br><br>*Teh Tarik<br>I've had many different variations of teh tarik but this one stood out. They infused ginger to their teh tarik which was something new but started to grow on me. The staff will ask when you order whether you have any preference on what goes inside it. If you despise ginger, do let them know beforehand. <br><br>Friendly staffs and amazing food! I'll definitely visit again if I'm in town!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/WaH70ewC8cSdsCX_wdND-g/348s.jpg", "caption": "Coconut Pudding"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/cmICHJi4qg_uKEUygdTv2g/168s.jpg", "caption": "Hainanese Chicken"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/gW6zLWRiaC_JD8TOiiAp6Q/168s.jpg", "caption": "Laksa"}]}}, {"review": {"des": "Literally drove 300 miles here to end cravings. There's a tendency for cravings to make any food taste good, regardless of how good the food actually is. Serai is absolutely the best and most authentic restaurant in the city if you're looking for Indonesian, Singaporean, or Malaysian cuisine. If I didn't have to pay college rent, I'd have gotten 6 months worth of takeaway. Front of house crew is super fun as well, love this spot!", "pics": null}}, {"review": {"des": "Ordered the drunken noodles for delivery via Caviar and they did not disappoint. Perfect spice level and great noodles, will certainly order again.", "pics": null}}, {"review": {"des": "Unfortunately had a great experience but found BUGS in my food. The waitress was gracious and kind and the meal was comped but literally there were so many that we thought we were crazy. When we brought it up to the server the chef came out and tried to tell it was anise seeds so we kept eating it but on further inspection it was definitely some sort of infestation.", "pics": null}}, {"review": {"des": "I came back to Serai with some friends a few weeks ago. I called ahead to confirm that they were still BYOB, and they assured me they were. When we arrived with bottles of wine, we were very disappointed to hear that since they now have a liquor license and a full bar, their BYOB corkage fee is now 20$ per person. I was pretty disappointed that they didn't mention this on the phone, so my friends and I decided to just save our wine for after dinner.<br>The food was still tasty, but the service was very slow. With lots of new restaurants opening in Logan Square, I will probably skip Serai and try somewhere else next time I'm in the neighborhood.", "pics": null}}, {"review": {"des": "AMBIANCE: 4/5<br>A nice, spacious dining room with wooden tables. It's clean and well-decorated, but nothing puts it over the top.<br><br>FOOD: 4.5/5<br>We were here for lunch, so we shared 3 appetizers and an entree - pork wontons, crab rangoon, lamb skewers, and the mango chicken. The wontons were tasty and tender but lukewarm, the crab rangoons were perfectly crispy and had a great filling to dough ratio, and the lamb skewers had excellent flavor but were a little tough. The mango chicken was delicious with strips of mango and chicken in a mango-based sauce. Also, I loved the presentation in an actual mango. Next time, I'd like to try the more traditional Malaysian dishes. The Malaysian Iced Tea was also an A+ - I love that the restaurant derives influence from multiple Asian cuisines.<br><br>SERVICE: 5/5<br>Our waitress was very attentive and polite  and another waitress came by to make sure our food tasted good. I think the staff did a great job of bringing out food quickly and checking on us when appropriate.<br><br>MONEY'S WORTH: 5/5<br>You will get a great amount of food for your money. Large portions and great for sharing - the more people you go with, the more you'll get to try, and it won't break the bank.<br><br>IG @afoodiegoescleanish", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/dKSd-8N1JDwmwHQz5kCqfA/348s.jpg", "caption": "Mango chicken"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/8v2p7erzE7h7jYeXGc-qdg/168s.jpg", "caption": "Lamb skewers"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/1nTWL6CaDFW54Mr5qs5ZCg/168s.jpg", "caption": "Yummy wontons"}]}}, {"review": {"des": "Randomly walked past this place late last night. My friend and I sat in the back patio. Service was a little slow but the food was delicious! We had the steamed \"pork stickers\", green curry chicken and the mee goreng. It's 10:50am on Sunday and I already want to come back!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/PmoxP0N0gAYFHprMeAn6nw/168s.jpg", "caption": "Green Curry Chicken"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/tU_sjevzktH-T5iHhHOl7A/168s.jpg", "caption": "Mee Goreng"}]}}, {"review": {"des": "amazing food. had the curry dip with the bread and then the green chicken curry. bread seemed really fresh and was flavorful. green curry was very flavorful. amazing", "pics": null}}, {"review": {"des": "Went here with a few friends. Sat in the back patio. I tried their chicken curry appetizer, which I think would have also been good for the full meal. Kind of a coconut/peanut curry sort of thing. Nice Roti to go along with it but not my most enjoyed one. I think Chicago needs more curry of every type and culture. Big pieces of chicken. A friend had breaded fish with jalapenos and pepper, which was a nice flavor! Not too sweet. I love a good breaded/fried fish nugget meal.<br><br>The mango chicken stirfry and stir fry pad something noodles I would just pass on.<br><br>They were playing something that sounded like My Bloody Valentine... I don't know why, but I guess it was okay. Sitting outside is weird.  Usually there's too much sun or insects or whatever. But this time it was fine! Come in early july at dusk, I guess.", "pics": null}}, {"review": {"des": "Serai has been on my list for a while, and I left with mixed thoughts. Being our first time we decided to get various recommended dishes starting with the roti pratha. The roti was nice and fluffy and the chicken curry savory with generous chunks of flavorful chicken and soft potato but I was a little disappointed with the size. You only get one small roti which if you're sharing with more than two people is a little awkward. Purely based on taste, it was fantastic and a great start to the meal.<br><br>Next, we ordered the char koay teow which is similar to pad thai but a Malaysian version and had Chinese sausage which was amazing. Nice balance of flavors and spice, the noodles were soft and chewy. We followed that with the Coconut rice sampler plate (can't remember exactly) but it included a platter of coconut rice, fried egg, some type of chips, and pickled vegetables with anchovies with a small bowl of rendang beef. Honestly, next time I'd probably just go with the full portion of rendang beef. The rice did not really taste all that different from the regular white rice served with the other dishes. The rendang beef had a nice curry sauce and texture. The kang kung belacan is one of my favorite vegetables of all time and it did not disappoint here. The Hainanese chicken was probably my least favorite, the chicken itself was small, there wasn't much meat on the bones and the overall flavor was lacking, there was a little too much sesame oil in the sauce which made it taste greasy. It felt overpriced for what it was. <br><br>Also, I read some other reviews about the water tasting funny and can definitely confirm the same. I think that's just the taste of room temperature tap water, but it's not pleasant. Overall, I enjoyed Serai and I'd come back again but next time I'll stick with the Malaysian dishes.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/cT4l5hWSdzqco1zD8iRgeg/348s.jpg", "caption": "Hainanese chicken rice"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/jwgiUhBzi6NUUEbJ7F85WQ/168s.jpg", "caption": "Rendang Beef with coconut rice plate"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/iaisGGiVg3x0R145XUjDtQ/168s.jpg", "caption": "Kang Kung Belacan - water spinach, kong xin cai in Chinese"}]}}, {"review": {"des": "It has been a while since we encountered a deserving restaurant worthy of 5-star! Love this place, better than we expected. Food was delicious and full of flavors. We ordered crab claw and soto madura (soup dish) as appetizers. They mistakenly gave us roti paratha as one of the appetizers instead, but let us keep it with no charge, and still gave us what we originally ordered. For entrees, we ordered Char Kwe Tiau and Nasi Lemak with Rendang Lamb, and they were soooo yummy! The balance of spices and savoriness was a true essence of Indonesian cuisine. This really satisfied my craving for Indonesian cuisine. The service was friendly and attentive (although a little slow), ambiance was relax and modern. Would definitely come back and cant wait to try out the other dishes!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/fSi0vFfehcKhWEsqr-Yv2g/168s.jpg", "caption": "Nasi Lemak with Rendang Lamb"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/qQhvKDUfU1CcmIRVPh_c-w/168s.jpg", "caption": "Char Kue Tiau"}]}}, {"review": {"des": "This is more like 3.5 stars. I recommend making a reservation here, which you can do through OpenTable, Yelp, or calling the restaurant. I don't know if it's common for them, but they were overbooked on a Saturday evening (which they had no problem reminding and mentioning multiple times throughout the time we were there).<br><br>The environment feels pretty casual, and I wouldn't recommend this as a first date spot. I came with four other friends, and they sat us at a round table in the back corner. There's a bar with seating along the left side.<br><br>APPETIZERS<br>- Cumin Lamb Skewers: Comes with three skewers. I didn't eat this, but my friends enjoyed it.<br>- Pan Fried Pork Stickers: Comes with three pork pot stickers. It tastes like they were made in-house, especially with the wrapping. The wrapping slightly overpowered the filling though. My friend had to double check the menu because she thought I was saying pot stickers incorrectly. :p<br><br>ENTRÉES<br>- Three Chili Chicken: This was pretty tasty with the right amount of seasoning. It's fried chicken pieces with chili but isn't too spicy.<br>- Three Pepper Fish Fillet: This was a good dish also and similar to the Three Chili Chicken but with fish fillets.<br>- Belacan String Beans: This is stir-fried string beans seasoned with spicy shrimp paste. I enjoyed this dish. It's a bit on the salty side because of the shrimp paste, but the dish is very flavorful overall.<br>- Kang Kung Belacan: This is the same as the Belacan String Beans but with water spinach.<br>- Nasi Lemak: This came with an egg on top of a mound of fried rice. It is what you'd expect fried rice to taste like, so nothing too unique. It complements the rest of the meal well.<br>- Hainanese Chicken (1/2 Chicken): The chicken is served somewhat cold and reminds me of the ginger and scallion sauce served with cold chicken. The sauce for this dish is salty and helps add flavor to the chicken, but I think I prefer a ginger and scallion combo.<br><br>We had tap water, which tasted really off. It almost had a rusty taste...not that I know what rust tastes like or anything... My friends confirmed the same thing. When I looked over at the large party next to us, every one of them had bottled water in front of them.......is there something we should know about this water?? I couldn't drink water for the rest of the meal, and that was a struggle given the spiciness and saltiness of our meal.<br><br>The server was very friendly, and the bus staff came and took away our plates when necessary. We definitely felt rushed the whole time that we were there from the moment we walked in the door. The overbooking made me feel like I was at the airport, except airlines offer some type of compensation for it.<br><br>Prices were very reasonable given the portion sizes. We actually ordered one too many dishes. The price was about $31 per person, and that includes tax, tip, and three alcoholic drinks!<br><br>Overall, it's not worth the trip for me to come back unfortunately.", "pics": null}}, {"review": {"des": "Exceptionally good Malaysian South East Asian restaurant. They serve halal. Just ask them for halal and no alcohol in the food. Warm and welcoming atmosphere, very laid back and down to earth. I had roti with chicken curry. Excellent! The rendang lamb was so perfect. The curries were so good. I asked for mild. The meat was melt in your moth soft. For dessert I had coconut pudding, which was served in a giant baby coconut. Yummy! Nick and Anne were awesome, and really made my visit most enjoyable. I met Khoon, the chef. He was great, so humble. Everything was perfect, and I highly recommend you visit this place.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/4ACsFAGM9VF8Kgj9-37s1A/348s.jpg", "caption": "Coconut pudding"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/TT0s_WqB9xOnKcFC5-6T_A/168s.jpg", "caption": "Coconut pudding"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/kZV454cvQdwm9X5VdnXygQ/168s.jpg", "caption": "Coconut pudding"}]}}, {"review": {"des": "I think my expectations were high for this place so I'm sad my expectations weren't met. I had read some reviews about the parking situation in this area and that some yelpers had mentioned about a parking lot in the back of the restaurant.  Turns out you CANNOT park in the lot in the back anymore. Thankfully I came early enough to find some street parking.<br><br>I arrived 10 mins early waiting for my friends. Although I was seated at our table, no one came to serve me. I was not asked if I wanted to order a drink or an appetizer while I waited.  It was hard to get someone's attention too or wave them down.<br><br>When my friends finally arrived we ordered the roti dish but for $6 the roti was extremely small. We asked to order another roti but we were told we had to order the entire dish. We could not just order another roti.  That was disappointing.  We also ordered the curry laksa. I felt it lacked flavor and I would not order it again. My friend ordered a flat noodle dish that I think was the Drunken Noodles. It was delicious but the portion was small. My other friend ordered the Hainanese Chicken. It is like broiled chicken that I've had at many Cantonese restaurants. Its bland and not something I'd order.<br><br>We ordered dessert which was equivalent to coconut jello inside an actual coconut. It was good but overpriced.<br><br>This location is far from where I live. Based on this experience and the price point for the food I don't think I'll be back.", "pics": null}}, {"review": {"des": "Heard a lot of good things/read a lot of good reviews for this place so was super excited to finally try it out! I haven't had much experience with Malaysian food but I liked what I got! <br>- Roti Pratha: yummy but such a tiny portion! Only one piece of Roti :( <br>- Hainanese chicken: a little bland, but the chicken was moist and tender<br>- Nasi Lemak with curry chicken: rice with a bunch of side dishes and curry on the side. Everything was well made and tasted great. <br>- Char Koay Teow: Probably my fav entree - well seasoned with lots of toppings, super delicious <br>- Coconut pudding: soooo good. get this!! Tasted so fresh and was served in a coconut with fresh coconut meat still on the sides. Amazing. <br><br>Additionally, the staff was super friendly and the owner even stopped by to say hi. Definitely a place I would recommend.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/J2lMf62s0tz2fHQSOzKsDQ/348s.jpg", "caption": "Non-meat menu"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/WNJmzkbJMTcvNgR6NaxB2g/168s.jpg", "caption": "Coconut pudding"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/wwJS6M8vVdAeu2rNEN_wdw/168s.jpg", "caption": "Vegetable curry"}]}}, {"review": {"des": "Serai is a hidden gem! My boyfriend and I were looking for a place to eat lunch after the gym and Serai caught our eye since we were craving asian food. We were so pleasantly surprised by Serai, the food tastes great!<br><br>Seafood Claypot Noodles - The noodles are deep fried here so they're initially crunchy, but then mixed with the seafood sauce turns into like a saucy noodle dish loaded with seafood. Highly recommend this dish if you like pan-fried noodles.<br><br>Serai Curry Laksa - A traditional noodle soup dish. Highly recommend this dish as well. Great taste.<br><br>The next time we're craving a more Malaysian style cuisine we will definitely be returning to Serai.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/M1uYDgOn_GMeKq6YLVm_hQ/168s.jpg", "caption": "Seafood Claypot Noodles ($15.95)"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/tAw6wkRkam1Hou2HmXrCuQ/168s.jpg", "caption": "Laksa"}]}}, {"review": {"des": "Ive been here a few times. Food is tasty, especially rendang anything. Portions are ok for the main dishes but the appetizers are way too small. Example, the roti pratha is a bowl of curry with one small pancake. When we asked if we could order additional pancake (we were willing to pay) the manager said they cant sell just the pancake and you'd have to order another additional appetizer. Seriously? Its bread. Either include more for your $6 or give the option to order it by itself. Also the curry puff, $6 for two small pieces. Stay away from the appetizers and you should be ok. Service here is ok, but no one seems really happy to work or be there.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/2xOgcCcbhdP7szbp_liZ8A/348s.jpg", "caption": "Main dishes are a decent portion and beef rendang is gooood."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/rOd6Z6ArkdKQuOTueG3BFA/168s.jpg", "caption": "These puffs are alot smaller than the picture might indicate."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/V8dW5Z7qVTqNMho-kFUFmA/168s.jpg", "caption": "One small pancake for your $6. Appetizer for 1."}]}}, {"review": {"des": "This place is AMAZING! <br><br>We started with the roti pratha. Holy cow this was delicious! The pancake was the softest thing I've ever had. Imagine a naan but much softer on the inside! It came with a side of chicken/potato curry, which was also to-die for and tasted great on its own and with the roti. <br><br>Then we got the Char Koay Teow. OOOH man this was the star of our meal. It's a mix of savory flat noodles cooked with a lot of texture and flavors. It is literally a party in your mouth. We also ordered Serai's version of Hainan Chicken Rice. We're big fans of this and Serai did not disappoint.<br><br>You have to check out Serai!", "pics": null}}, {"review": {"des": "Inexpensive, delicious, attentive, Malaysian cuisine.  <br>Totally recommend it.  Share plates for tastes.", "pics": null}}, {"review": {"des": "I think this is a solid 3.5 place. The hostess was super nice and accommodating. The server was nice but completely unfamiliar with the menu. To make matters worse, she insisted she was right and we were wrong even though I used to live in Singapore and know my Malay food well. Yelp reviews had highlighted to us that they have good options for vegetarians but our server convinced us they couldn't make anything but rice for us. So when 4 people in our party of 6 were led to disappointment, we had to push really hard for her to confirm her facts with the chef. Not sure whether she communicated the right items, given the names of the dishes really confused her. Food was great and I'd want to come back for sure, but really hope we get assigned a different server this time. The roti canai, egg rolls and curries were the highlights.", "pics": null}}, {"review": {"des": "So authentic, so delicious! My family is from Malaysia so we were so excited to try Serai for the first time. My only complaint is the portion sizes. The Roti Pratha came with a lot of curry but only one (delicious) roti (bread) which was not enough for the amount of curry and we couldn't order more. The chicken satay was so authentic and good but only came with a few of skinny skewers. The service was fantastic. We will definitely go back or order delivery!", "pics": null}}, {"review": {"des": "Food was decent. Bacalan was delicious but pretty overpriced. Kung Pao was delicious I really recommend it. Overall the food was good, but a little overpriced.", "pics": null}}, {"review": {"des": "Loved the food here!  I haven't had laksa for a long time and was very happy to find authentic and delicious laksa noodles here.  Also shared satay chicken, cumin lamb skewers and the coconut pudding dessert with friends.  The entire experience was satisfying and I can't wait to come back again and try other things on their menu.  Highly recommend.<br><br>They also deliver through Caviar (<a href=\"/redir?url=https%3A%2F%2Fbnc.lt%2FW9Qc%2F5HKGixLjFL&s=7a2fc8ff1bb019330413c83e397c14994bc6e51e571fefd720541d83beb7bda3\" target=\"_blank\" rel=\"nofollow\">bnc.lt/W9Qc/5HKGixLjFL</a>)!  I just know this will be one of my top places to order food when I have to work late nights!", "pics": null}}, {"review": {"des": "Just make a booking already for Serai already! You need to come here! <br><br>I'd say this is a places that I say you need to go to.   The flavors are fantastic. The exterior is somewhat blah, it was actually difficult for me to imagine this kind of Restaurant from the outside as the awning was faded with another restaurant name. The \"Serai\" was kind of small on the windows.  It's located at the corner of Milwaukee and Talman.<br><br>I think I saw a steady stream of grub hubbers come and pick up food.  <br><br>I think it's ideal to come with sharing in mind as you have to try several dishes.  The inside decor is surprisingly large, updated and modern.  They do have a patio area in back with picnic style tables which is perfect for a summer dining experience.  <br><br>We came in with a family originally from Malaysia as they have been searching for a good Malay restaurant for some time.  Our venture here came about due to a craving for Curry Laksa ( a fish cake, seafood, coconut curry based noodle soup). <br><br>So of course we ordered Laska.  Hainan chicken, beef rengdan (like a flagrant stewed beef curry), what Chinese folk would call \"tong choy\" made with shrimp paste (kang gong), and char kuay teow (stir fried rice noodles with Chinese sausage).  Basically every dish we had was originally supposed to be spicy, but our kids could only survive on Cheerios and mum mums so long that we had to give in and make the noodles non spicy.  <br><br>I can't even begin to explain the flavors that we had that evening.  It was simply fulfilling.  <br><br>Hainanese Chicken was service with the typical chicken flavored rice (which the kids gobbled up before I had a chance to taste myself).  Mighty good with the dipping sauce. <br><br>Laksa - my only complaint was that I had to share the dish.  I could eat this dish every night.  Fish cake, coconut curry broth, a soy egg, char siu, shrimp.  Yeah- basically all my favorites along with the ramen.  A good spice as well. <br><br>Kang Gong - yeah so i have not had shrimp paste much before.  Just didn't grow up on it, but I need this ingredient in my kitchen.  The vegetable added a nice crunch and the pungent flavors really complemented the other dishes we had.  <br><br>Beef rengden -. Looks like beef stew right? To call it simply curry beef is understatement.  The flavors just go into over drive with layering of flavor after flavor.  I had the honor of cleaning off this dish, as I wiped the dish clean.  Thanks for the banana leaf, it made it much easier and less embarrassing as licking the plate clean.  <br><br>Char kuay teow - the noodle dish that the kids just kept asking more.  I could eat this dish every night as well.  <br><br>So, if you are unfamiliar with Malay food as I am.  Order the above, it'll be a good experience.  Our Malay friends said we'd need to come back every month - my taste buds would agree! <br><br>Parking available either on Milwaukee or the neighborhood.", "pics": null}}, {"review": {"des": "\"Serai\" which is Malaysian  Lemongrass is one of my favorite flavors. The bold curry flavor is the main reason why i love Thai and south east asian food.  Couple of years ago I went to Thailand and fell in love with a dish called beef rendang, I have been trying to find something close to that here. <br>    Ordered delivery from this place couple times, because its close to work. Ordering the right thing here is pretty key. Some dishes are full of flavor and some are pretty bland. I would stick to the curries, and authentic dishes. Almost everything is pretty oily but the bold flavors will offset that I guess? The beef rendang was my favorite dish here, a little strong on the lemongrass, but still good. Would love to dine in here one of these days, but overall pretty good.", "pics": null}}, {"review": {"des": "I love this place and have gone back multiple times since my initial visit and I plan on continuing to return several times in the future. <br><br>The food is delicious. So damn good that I wish i could order some right now while I write this review. The three chili chicken and cumin lamb are excellent. You absolutely have to order these when you go. I also had the szechuan chicken and szechuan beef which were good. We also ordered the rendang beef. Its chunks of beef in a sauce rich in spices. My friends didnt like the rendang as much but I enjoyed everything we ordered and usually im the picky eater in the crew. <br><br>The service is fast and the serving staff are very friendly and check up on you frequently. The interior is clean, comfortable, and decorated decently. <br><br>The only reason I gave this place 4 stars instead of 5 is because of the water. I dont know if its the mason jars they serve it in or the actual water itself, but this lukewarm water smells straight up like sewer water. Its nauseating. This wasn't a one time thing. Its EVERY TIME. None of the other dishes or utensils smell. They're perfectly clean. So its probably not a faulty dishwasher or the mason jars. It must be the water. But its disgusting. It smells horrible and tastes weird as hell. I just order a coke instead. Problem solved.", "pics": null}}, {"review": {"des": "Hummm...how do I say this? I've given Serai a try a few times now, always delivery. And ....the food is kinda boring. Either the spice level is right but protein texture off or the protein is tender but where's the sauce?? <br>I'm baffled by the strong reviews..Blank stare)", "pics": null}}, {"review": {"des": "Serai is one of my favorite restaurants so far this year. I'm a fan of bold, interesting flavors and the food here brought that and then some. <br><br>The weather last Saturday night was beautiful, so we sat outside in the back. I started with a mimosa, and that was actually my only regret of the night.  Not that it was bad -- it was a perfectly fine mimosa, it just clashed with the rest of my meal.  <br><br>Food-wise, I started with the roti pratha, which is described as a fried flour pancake with chicken curry.  It was wonderful!  My entree, the rendang lamb, was equally delicious.  My friend got the rendang chicken, which surprisingly was nothing at all like the rendang lamb.  The chicken was good, but the lamb was better.  The restaurant is also relatively affordable which essentially guarantees a return trip for me.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/l5Y5w7EAj368duJ2jtU4fw/348s.jpg", "caption": "Rendang lamb"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/G-q6j0X92WMp1FBJJdJGKQ/168s.jpg", "caption": "Rendang chicken"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/P-bFTYwjtWKpqAjZikMnrA/168s.jpg", "caption": "Roti pratha"}]}}, {"review": {"des": "The most authentic Malaysian Food I've had in Chicago. Definitely my go-to from now on!<br><br>Food - Wide variety of food choices, there's something for everybody. For appetizers we ordered Roti Pratha and Chicken Satay. Roti Pratha (flatbread with curry) was delicious curry was full of flavor and the fried flatbread was crispy and chewy. I always feel guilty ordering chicken satay because its so basic and simple I mean how good can a chicken satay really get right? Chicken Satay here is the BOMB I don't know how they make their satay sauce but I put that stuff on my rice and finished it. <br><br>Entrees we got the Hainanese Chicken, Naasi Lemak with Redang Curry, and Three Chilli Chicken. Hainanese Chicken was basic but very flavorful. The Nassi Lemak with Redang Curry was a roller coaster ride, you got sweet, spicy, and savory all in one dish. Three Chilli Chicken was definitely the highlight I was looking for some spicy kick and I got it. Jalapeno, Black Pepper, and Red Chilli pepper in one dish, FIRE. <br><br>Definitely wanted to try some other dishes but the stomach wouldn't allow any more food. Next time, next time. <br><br>Ambiance/Decor - Restaurant is very spaced out, minimalist decor. We dined in the outdoor patio in the summer night and it was very well lit and comfortable.  <br><br>Service - Very efficient restaurant, greeted and seated right away. Assigned server was very friendly and sparked up conversations all around. Bus boy and food runners were very quick with everything. <br><br>Pricing - Reasonable pricing for the Wicker/Logan area. Entrees ran about $10-$15 per, Appetizers around $4-$8 per. Portions are generous, definitely got what I paid for. <br><br>Parking - Plenty of meter parking accessible in the area. <br><br>Overall, great experience above average service, food, and ambiance. Highly recommended, will be back again.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/hx_oOusCdSakdIzOUtle_w/348s.jpg", "caption": "Roti Partha"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/FJopS5R522BHPmvQ9HSgOA/168s.jpg", "caption": "Appetizers - Roti Pratha / Chicken Satay"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/1znZZ7AJ7M2Zy5uv_lm2Vg/168s.jpg", "caption": "Three chili chicken"}]}}, {"review": {"des": "Food here was amazing! We had the Hainanese chicken and it was very delicious. The coconut pudding was also tasty. The location is not very good but they have plenty of parking spaces. I will definitely come back and try the other things on the menu. It is one of my favorite restaurants in Chicago! Definitely recommend to anyone who wants to try some Southeastern Asian cuisines!", "pics": null}}, {"review": {"des": "Not impressed. Was expecting more Indian style, but instead it was effectively Thai. Nothing really stood out - just regular Thai-ish food. After reading all the positive reviews here I was definitely disappointed.", "pics": null}}, {"review": {"des": "When I was younger I grew up eating at Panang in Chinatown which was the go-to asian fusion restaurant that had all your malaysian/chinese/hainanese/thai fusions. I thank god that Serai has opened.<br><br>Although my family and I have been coming here essentially since they opened, surprisingly I never got to write a review. Well here it is: SERAI IS AMAZING.<br><br>Let's start with the Hainanese Chicken. Fantastic. It's exactly like how I remember it as a kid. If you're getting this definitely order extra flavored rice! You're going to definitely want it and is only a bit extra.<br><br>My second favorite here has to be the Rendang Lamb. Good lord I could literally inhale it. It comes with these insanely flavorful, deep, and rich sauce that goes great with rice. Give it a go!<br><br>Beyond these two there's always other favorites: the lamb shank, curry laksa, their veggies.<br><br>If you're looking for a go-to asian fusion restaurant that is relatively inexpensive and respects the balance in traditional flavors, Serai is the place to go. You won't regret it!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/3XyHJNxniBfS2iw0-hky9g/348s.jpg", "caption": "Rendang Lamb... possibly my favorite"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/cSCFyzjtF6N89yzcV8JqaA/168s.jpg", "caption": "The curry laksa"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/KMkUyvQfWTcG9bPHVQqmXA/168s.jpg", "caption": "Get extra flavored rice with the hainanese chicken!"}]}}, {"review": {"des": "Food here was not bad. Char Kuay Teow was a little bit disappointing and the Roti Paratha was a bit too small, but was overall really good and the servers were nice enough to give us dessert on the house!", "pics": null}}, {"review": {"des": "Doing several random searches for good reviews and good food, I came across Serai, and we and another couple were able to try it last weekend for dinner.<br><br>We got the following for the table:<br>Crab Rangoon - 3 large pieces that were quite good.<br><br>Roti Pratha - Indian bread served with a curry chicken and potatoes dipping sauce.  The bread/pancake was small and flimsy.  However, the curry chicken/potato sauce was really good.  They graciously brought out a side of rice that we could use to finish the sauce.<br><br>Spicy Wonton - these were my least favorite of the meal.  They were slippery little pot stickers that tasted rubbery.<br><br>Char Koay Tewo - this was a signature dish of flat noodles with different seafoods.  This was a favorite of the table.<br><br>Szechuan Spicy Beef - this was my favorite dish.  It was crunchy and spicy, and I enjoyed it.  Some of the others at the table wish there was a sauce for this.<br><br>Panang Chicken Curry - wonderful chicken curry over rice.<br><br>Rendang Lamb - lamb chunks cooked in coconut gravy.  This was wonderful over rice.<br><br>This was more than enough food for the table - and I brought home leftovers for two more sittings.  With the exception of the  Spicy Wonton, the entire table really enjoyed the food and wine.  We will be back to try other dishes!", "pics": null}}, {"review": {"des": "A casual, family friendly spot in the Logan Square area. We met some friends there for dinner on a Saturday evening and enjoyed hanging out in their outdoor patio area. The food overall was so so, a little too timidly spiced for our taste, but standouts were the roti pratha and beef rendang. Service was fine, and our food arrived very promptly (much appreciated when you've got a parking meter and toddler to deal with). They seem to do a lot of things, maybe too many things to do them all well. With so many great food options in Chicago, not sure I'd recommend this place unless you happen to be in the area and want to enjoy kid-friendly outdoor space. By the way, we drove our rental car there and were able to find street parking about a block away.", "pics": null}}, {"review": {"des": "Somehow they ran out of both their hokkien and mee goreng noodles by 7:30pm on Saturday.  How disappointing....so we had to get their char koay teow which reminded me of pad see eiw with a kick of spice.  <br><br>We started off with the roti paratha which my friends killed.  Their beef rendeng is amazing! Definitely a must order.  The meat was super tender and the sauce was very flavorful! We also got their penang curry, which was great!<br><br>I think the place is BYOB.<br><br>We'll be back for sure but please make sure you stock up on the most popular noodles especially on the weekend!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/avqj2L_QpNTg1cW7J2lCNw/348s.jpg", "caption": "Nyonya curry chicken"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/SmWnYSqItf69cKlYX8UAqQ/168s.jpg", "caption": "Nasi lemak"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/7zFdQKivZvEyGNxUf1rbHQ/168s.jpg", "caption": "Lamb shank"}]}}, {"review": {"des": "I am so glad I finally tried Serai! Don't let the unassuming exterior deter you (still with old Blue Sprout awning). We went on a Sunday at 7:00 and made reservations and it was fairly packed.<br><br>Let me start off with how amazing the food is. It has the usual southeast Asian meals on the menu (pad Thai, basil fried rice) and some more unique items. For appetizers we had the roti with veggie curry. This was one of the most flavorful dishes we had had anywhere. Sadly there was only one roti to soak up all the delicious curry with. We both drank the leftover curry out of the bowl. We also had spring rolls which were very good. We are both vegetarians and the server told us we could make almost everything on the menu vegetarian. For entrees we shared the mango fried rice and Char Koay Teow (where instead of meat they put tofu and veggies). Both were amazing!! <br><br>Additionally, the service was phenomenal. Our server was so nice and helped with all of our questions and gave recommendations. <br><br>We can't wait to go back!", "pics": null}}, {"review": {"des": "This is a tough one for me.....here's why.<br><br>My wife is Malaysian, and I have spent a considerable amount of time there over the last 15 years.  There is a ton of charm to Malaysia and even the people of Malaysia.<br><br>While some dishes here are good, I believe it's lacking something.  Some of the dishes were missing some flavor.<br><br>There is another Malaysian restaurant chain called Penang, which is in Arlington Heights.  Yeah, it's a bit far from the city, but overall it's the best Malaysian food around.  If I had to choose, I would go there and I've given them 5 stars.<br><br>Most of their staff is from Penang Malaysia or parts of Indonesia.  At Serai, I wasn't sure if anyone was from Malaysia....and they really didn't seem to understand the intricacies of the food or culture.<br><br>When I go to any ethnic restaurant, I want to see or feel more of their culture.  I didn't really get that here.<br><br>It's still good, so I'm giving 3 stars.", "pics": null}}, {"review": {"des": "Food was good but service lacked. Being one of the few Indonesian restaurants in town,  There was nothing extrodinary  in taste that I can't get in 2 other Indo restaurants in town. <br>Servers attention was in your initial order but not follow up on drinks or any other food wanted. It was a Sunday and they were not busy either. This spot was a lot more attentive to customer s in the past. If service stood out, it would make the difference.", "pics": null}}, {"review": {"des": "I haven't even eaten at the restaurant - only delivery NUMEROUS times - and it blows my mind. I grew up in the DC area and have pretty high standards for Thai food (I know this Is a Malaysian restaurant). The food comes hot and steamy, via delivery?! This has never happened  to me before and it excites me every time! <br><br>The three chili chicken is a favorite. It is tender and the jalapeños are the perfect spice. <br><br>Another one we really enjoy is the rendang. I've tried this with lamb, chicken and tofu - each are awesome! I'd describe rendang curry as a cross between Penang and something Indian. Whatever it is, I love it. <br><br>The drunken noodles are on point. The best 'thai' style noodles I've had in Chicago and my expectations are high from the spoiled marked in DC!<br><br>Love this place. Can't wait to actually try it at the restaurant - I hope to try the steamed sea bass when I go in!", "pics": null}}, {"review": {"des": "(warning: following review in Singlish, mutually intelligible with Manglish)<br><br>wah, Chicago got roti paratha ah? Must try. Everything also must try.<br><br>roti paratha - why so small? Otherwise not bad. Curry also ok. Is it that Prima stuff?<br>beef rendang - ok lah, a lot of serai, enough for 3 people family style.<br>laksa - ok, use the same mee as the wonton mee. why no sambal on the side? Also no daun laksa. Why Lidat? Vietnamese market Argyle st also can buy wat.<br>dry wonton mee - tak boleh tahan. So much salt. Whoever made this has never tasted the real thing.<br>curry vegetable - I was hoping this would be Sayur Lodeh. It is not  but is still good, more like an Indian curry you get with banana leaf thali.<br>belacan dishes -  belacan go where? I know lah, must adjust for local taste. Adjust until gone.<br><br>still must not hantam too much, Chicago only got 1 restaurant serving these dishes.", "pics": null}}, {"review": {"des": "I came for the Hainan chicken but was very impressed overall! Everything is pretty good. It's nice to have a good southeastern Asia restaurant. They serve fresh coconut with a straw and it's the most refreshing thing you can get on a hot summer day. <br><br>Started with the roti and curry. The roti is crispy and the curry has big pieces of chicken and some potatoes. So nice and warm that we wished more was given so we got another order. <br><br>The dishes are nice and I think it's better if you share so you can try more! The Hainan chicken comes with a side of chicken rice. Staple :) the chicken is soft, warm, and a taste of sesame oil and spicy chili sauce. <br>The lamb shank was probably my favorite. Get it if you like lamb. Really fall off the bone meat with a hint of sweet. Comes big pieces of mushrooms and broccoli. <br>I love mango and was excited for the mango shrimp but I'm such a wimp because it was too spicy to eat. The shrimp has a nice bottom of the wok taste and it's served inside two half mango shells. It's like a rendition of sweet and sour sauce. <br>The sizzling chicken was probably the least special except it's served sizzling hot. I'm used to the black bean sauce. <br>The Singaporean noodles was hogged by my sister but the pieces of beef I stole were pretty tasty. Salty and oily but really tasty. <br><br>We came on Mother's Day and they were nice enough to give us a coconut pudding for the moms at the table. So refreshing and made with fresh coconut water. <br><br>The only thing is it felt like the food took a while to come out. But overall the atmosphere and service is awesome. Would recommend :)", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/DuQO0AcZ9UyhYIAc7t7KCw/348s.jpg", "caption": "I came for this! Hainan chicken"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/M4gJcrrABxE7GJTZasG5ag/168s.jpg", "caption": "Mango shrimp. Kinda spicy"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/RrzYxMCSULHrqD9cU4W5Og/168s.jpg", "caption": "The coconut"}]}}, {"review": {"des": "This review is solely based off of delivery, I have not dined in at Serai.  We have ordered delivery from here about 5 times now.  Delivery has been earlier than the estimate given each time.   There are a lot of other good Asian food places you can order delivery from in the area but Serai has become our go to.  Our favorites so far have been the 3 chili chicken and orange chicken so far.  I would definitely recommend and will be continuing to order from here.", "pics": null}}, {"review": {"des": "Curry Laksa!! Just how it is in Malaysia!! Takes me back to when I used to live in Malaysia!! This one is hands down my favorite on the menu!! Nasi lemak is great as well!! And the Pad Thai was really good as well! Great ambience, great music and great bar!! Hidden gem in Logan square!", "pics": null}}, {"review": {"des": "Delicious Malaysian food!! Hole in the wall exterior with a nice interior. Had our Thai friend order, whose family is from close to the border with Malaysia and he also confirmed the food was very authentic. We had two noodle dishes, roti and wontons for appetizers, a lamb dish and the chicken and mango dish. All amazing! Will definitely be coming back.", "pics": null}}, {"review": {"des": "We made a reservation to Serai while visiting Chicago with some friends. It was easy to get a reservation for 8 people unlike some of the other places we tried. The menu had a plethora of options, we ordered a variety of dishes to share. My favorite items were probably the hainanese chicken and the three chili chicken! The noodles we ordered were also delicious. We ended the meal with coconut pudding and black rice congee, would highly recommend both if you're into asian desserts!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Mj-p60sSX95Yvz7Q9jBovA/168s.jpg", "caption": "Coconut pudding"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/4AKVueilEUSIsIL1vQuijQ/168s.jpg", "caption": "Dessert congee"}]}}, {"review": {"des": "Delicious little Malaysian restaurant in Logan Square. It's a unique addition to neighborhood. We will definitely be back. I had the lamb rendang with coconut rice. It was a little spicy but delicious! My husband had the chicken rendang which was more mild.", "pics": null}}, {"review": {"des": "Good food, Dad got the lamb shank which had a nice sauce and I made good choice too with the szechuan chili fishAsk for condensed milk if you're ordering the Iced Milo", "pics": null}}, {"review": {"des": "My cousin was craving Malaysian food and we found this pretty good place near by us. We also ordered way too much! Lol. <br><br>We started off with Roti Pratha. Very yum! The bread is very thin so you can grab the chicken and potatoes in the dipping sauce. The sauce itself is very tasty as well. I could slather that on my rice any day. <br><br>Next off we ordered the lamb shank! It was very delicious! In the pic it may not look awesome but that's cause it was covered in this lovely sauce and when you cut into it, the meat falls right off the bone like in a snap. I'm drooling thinking about it again. The meat was melt in the mouthgasam. Definitely recommend this dish. I grudgingly shared it with my cousins. Lol! <br><br>Cousin got the Panang Chicken Curry. This was a pretty tasty dish. The curry was brown in color. I enjoyed the one spoonful I got lol. <br><br>We also got the Beef Rendang Nasi Lemak. Now this was also another melt in the mouth dish. Coming out it literally looks like a glob of meat on the dish but when you taste it, bam. The taste hits you and the meat melts in your mouth. Very good! I enjoyed this dish very much! This dish also comes with coconut rice and some little sides of veggies, pickles, and shrimp cracker. Very tasty! <br><br>Another dish we shared was the Hainanese Chicken. This one was kinda disappointing. The chicken itself was like normal boiled chicken sitting in soy sauce with a small bowl of chili sauce on the side. It came with a tasty bowl of rice that was cooked in the chickens broth so it's got a very fragrant flavor. But the chicken itself was not impressive. Maybe this was due to the other dishes having big impact and flavor so this chicken dish got knocked down in the taste buds department. <br><br>My other cousin got the Seafood Tom Yam Ramen. This bowl of noodles was also a bit of a let down. The broth itself was very light. The taste of Tom yam did not really come out nor was it apparent. <br><br>Over all this place was tasty, I would definitely recommend it and also come back again for some more of the melt in the mouthgasam food. It's also very close by so even better and there is also free street parking so another brownie point. Can't wait to come back and try their other dishes!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/bfV7mPqMLtfsVMnAF-hs8A/348s.jpg", "caption": "Panang chicken curry"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/jwsQRhoczXHCHVynXaWYgA/168s.jpg", "caption": "Beef rendang"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/VXh5Hlfg9b3af0Hh04nThA/168s.jpg", "caption": "Lamb Shank"}]}}, {"review": {"des": "I love Serai. Been here a couple times and loved everything I've had. Guess that's what makes it a 5 star review!! I have mixed feelings about them now having a full bar cause I preferred the BYOB option. But this works if you didn't plan your alcohol consumption ahead of time. Impulse drinking is not to be dismissed!! But the food? Oh yeah. It is really good.<br><br>I initially tried the three chili chicken, extra spicy. Turns out they take extra spicy literally and I love that!! So good. Last visit I had the sizzling chicken and it came to the table emitting clouds of steam and a fabulous sizzling noise. The chicken was a little tougher than I would have liked but tasty nonetheless. The appetizers of chicken satay (highly recommended) and calamari (above average) were a great start. My wife's noodle dishes (she always opts for noodle dishes) met her approval. Servings sizes were large and we both took leftovers home. Prices are incredibly reasonable as well. Check their menu, you'll be amazed. <br><br>Unlike most Thai restaurants, Serai does not offer pork as a protein option. Maybe that's why it's a Malaysian restaurant? But you won't miss it. <br><br>Go. Check it out. It's so good.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/9rZ6i4ZWl0F3uaFP9vJeNw/348s.jpg", "caption": "Part of the menu."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/bMTfjFDgfLPJ6fHcCPMQVQ/168s.jpg", "caption": "Sizzling chicken. Yep, that's steam coming off there!!"}]}}, {"review": {"des": "I was surprised to find a Malaysian restaurant close to us and excited to take my in-laws and family there this past weekend. It's located on a quiet part of Logan Square so street parking was easier to find. The store front and space is no frills. We were greeted warmly and seated promptly for our 6pm reservation.<br><br>We started with two orders each of the Roti Pratha (1 piece per order) and Curry Puffs (2 piece per order) for our table of 4 plus a toddler. The curry with the Roti was delicious and easily the favorite meal of everyone. I was disappointed at the size of the bread. The curry puff was ok but the crust could have been cooked longer since it wasn't a golden brown or as crispy as I've had for a similar dish.<br><br>For the main courses we shared an order of the Hainanese Chicken (1/2 chicken) which was my second favorite dish, Nasi Lamak Lamb Rendang, Mango Shrimp, Char Koay Teow noodles, and the Kang Kung veggies. Now I know where to go when I crave Hainanese Chicken! It was pretty good but only came with one small bowl of the chicken rice that everyone was fighting for. Usually I don't like lamb but the Nasi Lamak dish had really tender pieces of lamb that went with the accompanying coconut rice and fried egg. Texture heaven! The last three dishes were average. I would have liked the Kang Kung if it wasn't so overtly salty on top of the shrimp paste.<br><br>Food came out really quickly and overall the portions for the main dishes were big enough where we had leftovers to take home. Appetizer sizes could be adjusted as those are the smallest pratha pieces I've ever seen. At least we know where we can get our Malaysian fix next time.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/451PH4YcR7YIhOEehZBA_A/348s.jpg", "caption": "Clockwise from the top: Roti Pratha, Hainanese Chicken, Mango Shrimp, Nasi Lamak Lamb Rendang, and Char Koay Teow noodles"}]}}, {"review": {"des": "Came for a late dinner with SO. Caught the last available table and was seated quickly. Ordered a calamari, vegetable curry, serai curry laksa.<br><br>To start, I gave 3/5 instead of 5/5 because every dish just seemed overly salty - so if you like salty this is perfect. I will keep mentioning salt because I ended up drinking three full glasses of water. I want to give at least a 4 but man did I drink water.<br><br>The calamari seemed pan fried instead of deep fried - it had some burnt/browning areas. The batter was thin and crispy, not super common in deep fried versions but was very flavorful (albeit SALTY). The spicy sauce was a great addition for the flavor.<br><br>The vegetables curry was good. My SO thought it was a bit thick but the vegetables held a good amount of flavor because of it. The curry spice flavor was stronger in this one than in the laksa but both dishes' spices were kind of muted by the level of salt as in you couldn't taste much of a difference since they were both just as salty.<br><br>The laksa was not at all spicy. You could see the chili oil but there was zero hotness. I wish there would be an option to add chili. I was expecting something more like the Singaporean spicy laksa.<br><br>The dishes looked small but we took leftovers with us. I don't know if it's because we both drank so much water, but we were both very full.<br><br>Service: 5<br>Ambiance: 5<br>Freshness: 5<br>Flavor: 3<br>Salt: 9000", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ngrHhqvYGQpUR0Sck0RccA/168s.jpg", "caption": "Vegetable curry and serai curry laksa"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/5gbjJXxl-Fb4bxVhfu5uGw/168s.jpg", "caption": "Fried calamari. Love the sauce!"}]}}, {"review": {"des": "I would recommend a reservation for the weekends. I luckily got one at the bar but it was pretty packed on Saturday night. I went with 1 friend and we ordered the Roti Pratha and Shrimp Rendang. The entree ended up taking awhile, again they were really busy. We did ask about when the entree would be coming up and they apologized and said it would be out shortly. The bar tender topped off our wine glasses and they gave us free dessert for keeping us waiting. The food was great and service was very friendly and nice. I would definitely go back!", "pics": null}}, {"review": {"des": "Dude my manager at work @robert b suggested this to me and at first I was hesitant because he's not an ethnic person like @me but <br><br>B<br><br>It was really good I had the char kaoy teow I think it's called with not one but two ethnic other people and they also said it was SO good and then we ordered it for lunch together the next week so <br><br>All u ethnic homies out there take a stroll and also service is wack lol they all look like they like to practice for improv together which is very cool and not me insulting anyone but definitely need to PRACTICE their waiting skills<br><br>-----<br>edit: rob b claims he is ethnic", "pics": null}}, {"review": {"des": "One of the best restaurant in Chicago! Creative, delicious and fresh menu. Don't skip on the deserts cause any dish you'll order would be dancing in your mouth. The service is great and there is plenty of street parking. If you have guests from out town then that's a good place to take them.", "pics": null}}, {"review": {"des": "Love the place very relaxing comfortable at the same time good vibe enjoyable for dates or family gatherings food is for 10+", "pics": null}}, {"review": {"des": "Great food and great prices.  Service was a little slow, but it was very friendly and helpful.  Ill take friendly and helpful anyday!  Tried some new things i never tried and it was awesome.  We will return.", "pics": null}}, {"review": {"des": "This place is the best Hainanese chicken I have had in the US so far--even better than a place specializes hainanese chicken in Rowland Heights, CA (an Asian predominant community outside of Los Angeles). And hands down the most refreshing coconut pudding! I currently live in Iowa City, and first visited because of the recommendation from a college buddy who now lives in Chicago. I was blown away by the quality and flavor of dishes that were \"hidden\" in this not very fancy looking restaurant (from the outside it is rather hard to spot if you are just casually passing by). The chicken juicy and tender, the curry chicken rotti appetizer packed with flavor. We also ordered the lamb shank on our second visit, and the meat fall right off the bone. Now whenever I visit Chicago, if at all possible I will make a detour to this restaurant, and after a delicious meal take home some coconut pudding all the way back to Iowa City. Despite having a 4 hour drive ahead, this place is 1 hour detour worthy to me :)", "pics": null}}, {"review": {"des": "I have been wanting to come here for a while since I have heard good things about the authenticity of the food, but after stopping by here for dinner, I have to say that I was not impressed; the food tasted like slightly above average Asian food.<br><br>My friends and I ordered the Roti Pratha and Satay Chicken for starters. I will say I like the flakiness of the roti and I thought the skewers were juicy and flavorful. The peanut sauce on the side was a nice accompaniment too and it wasn't overly sweet. For the main dishes, we split the Mee Goreng, Nasi Lemak with Ayam Merah, and Kang Kung Belacan. I like the texture of the noodles in the Mee Goreng, but I thought overall it tasted pretty much like any other stir-fried noodle dish. The Kang Kung Belacan (stir fried water spinach) was tender but I thought it was a tad too salty. Finally, I thought that the Ayam Merah was extremely tender and was actually quite tasty but the dish as a whole was just okay.<br><br>I'm glad I finally had the chance to try Serai, but considering how out of the way it is and how the food was nothing spectacular, I probably won't visit here again anytime soon.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/lZMjW3h3K75odwPhKTuDEA/348s.jpg", "caption": "Nasi Lemak with Ayam Merah"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/XBvI8QORhbNgS-vhshZPxw/168s.jpg", "caption": "Kang Kung Belacan"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Isg4henPfturTqTihfpOxg/168s.jpg", "caption": "Mee Goreng"}]}}, {"review": {"des": "My cousins and I were craving South East Asian food and checking yelp this seemed like the best place in Chicago to satisfy it.<br><br>Unfortunately it was a hit or miss when it came to the menu items . The Coconut water was very refreshing. Calamari was much too salty and the pad Thai wasn't that flavourful. Maybe I'm just too used to amazing South East Asian food in Toronto. Coconut pudding was given complimentary and it was very good, would not miss out on that. Food was 2/5 overall<br><br>Our server was amazing!!! She always checked up on us and was very friendly! 5/5 for sure and the reason that my review was 3/5. I would go back just for the service!", "pics": null}}, {"review": {"des": "I've eaten here a handful of times now, typically in group outings in which we order a bunch of dishes and eat family style.  So at this point, I've pretty much tried every dish they serve.  And I have to honestly say that there hasn't been any one dish here that I didn't think was delicious.  Everything is on point.<br><br>If Serai is emblematic of Malaysian cusine, I'm convinced that Malaysian food would be much more popular than any of the other Asian cuisines.", "pics": null}}, {"review": {"des": "Woooow. This place is amazing.<br><br>We came on a Thursday night around 8:30ish and they had no wait. We decided to sit by the bar. I was seriously excited because I haven't had good Malaysian food since 2014.<br><br>Obviously we got the roti canai and they can make it vegetarian here which is so hard to find. If you just get one appetizer, you have to get this. This is probably the biggest staple in my opinion of Malaysian food. I could probably eat roti canai all day if I had the chance.<br><br>I was conflicted on what to get for dinner so the servers helped me make a decision, they all had excellent recommendations because one of them was a vegetarian as well. <br><br>I got the Drunken Noodles vegetarian - with tofu instead of meat. This was also so good and authentic, it seriously felt like I was abroad again. The tofu and the noodles were cooked perfectly. I couldn't finish all of it so they packed up the rest for me. <br><br>We started chatting with the servers and they were all so nice. One of them surprised us with the coconut pudding and I was really skeptical at first because it looked like jelly but fo sure it was the best thing we had here. Once you get over the consistency, it tastes amazing-like actual fresh coconut. It was so light and refreshing for a dessert. <br><br>We had such an awesome experience here, everyone should check this place out if you like southeast asian food.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/xUuIC69HqddxBWurPVKL7g/348s.jpg", "caption": "Vegetarian Drunken Noodles"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ckt0INa7qyHR-YdcrYtkWA/168s.jpg", "caption": "Roti Pratha"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/gX642XRwHpNvRQDj8r67_Q/168s.jpg", "caption": "coconut pudding"}]}}, {"review": {"des": "This is a gem of a place.  Definitely a local feel with great eats!<br><br>We went when they were still doing BYOB.  I'm under the impression that they were trying to obtain their liquor license.  The food is authentic and the service is great!  They did a great job explaining dishes that we didn't understand and the food definitely delivered on flavor.<br><br>We had the singapore noodles as a classic dish as well as the sambal.  The sambal carried a heat with depth that was well appreciated by our table.  Another staple dish that we tried was the Hainanese Chicken.  None of these traditional dishes disappointed.<br><br>We also had the Rendang shrimp in a coconut curry, chicken satay and the Sze Chuan Dry Spicy Chicken.  All of which were amazing.  The heat with the spicy chicken was just right for me but they definitely can up the level if you ask.  We cleaned our plates with roti paratha!<br><br>Despite not having any room we had dessert!!  I was in such a food coma at this point I can't remember what I had.  Overall, there isn't a thing on the menu not worth trying.  We had a great time catching up with friends and chowing down!", "pics": null}}, {"review": {"des": "Great service, great authentic food!!!!<br>Love it!!<br>Lamb is so tender and amazing. Coconut pudding is absolutely delicious.", "pics": null}}, {"review": {"des": "Food was decent, personally prefer Rickshaw Republic better - both location, ambiance, and taste.<br><br>SERVICE IS TERRIBLE<br><br>we literally grabbed the menu ourselves from the bar because we waited 15 min and nobody gave us anything <br><br>the tall waitress girl looked at me twice and ignored me as I tried to wave her over to take the order, another 15 mins wasted<br><br>after we ate our food, they took 20 mins to bring the check and another 15 to bring the card back and takeout boxes<br><br>never coming back thanks", "pics": null}}, {"review": {"des": "Can't wait to come back here. We sat in an adorable outside patio area and the service was great. Ordered roti pratha w chicken curry, beef rendang, green curry chicken and the sambal eggplant. The roti was great - perfect texture. We loved the beef (it fell apart easily with our forks) and the chicken curry (which also had baby corn and eggplants). The samb eggplant wasn't our favorite but still glad to have tried it.<br><br>Ordered chicken and coconut rice to go with our food instead of white rice and they were SO good. Finished off with a coconut pudding which was served inside an actual coconut and tasted super refreshing! Definitely want to come back and try be Nasi Lemak and laksa!", "pics": null}}, {"review": {"des": "5 stars for being the BEST & most SATISFYING Malaysian restaurant in Chicago! Now there isn't much competition in this cuisine so being the best is not hard, but Serai is also dee~~lii~~cious! Hence it's the best and most satisfying! Finally, a restaurant to take in what Malaysia cuisine has to offer!!! <br><br>Whatever we ordered today hit the mark:<br><br>- Lamb rendang. A beautiful thick curry with aromatic spice that is absolutely authentic and explodes with flavors. The lamb was also cooked wonderfully; matched with rendang these two rich flavored items complements divinely. This is my clear favorite tonight! <br>- Hainanese Chicken rice. Pity they only gave us one bowl of chicken rice because it was gone in an instant! The chicken was poached well, being juicy and succulent, the stock them cooked the rice to give it it's full flavors, a favorite dish in Malaysia and Singapore, and Serai nailed it!<br>- Kang Kung Balacan. Malaysian spicy water spinach stir fry flavored with chilies and shrimp paste. There's something homey about this dish, it's inexpensive vege and not difficult to cook, but it brings me home!<br>- Laksa. Noodles in spicy curry soup. It's heavy, it's flavorsome, it's thick and it's YUM. A personal favorite dish of mine, and though Serai made a flagrant broth, the noodles were not the usual thicker egg noodles (Hokkien noodle) and/or vermicelli. This is a tad disappointing, but I can live with a different noodle. I'll still order it next time! :p<br>- Char Kway Teow. Stir fried flat rice noodles. There are many variations of this noodle but the mark of a good kway Teow is the \"Char\" (charred taste from the stir fry of the noodles in soy sauce). Serai has a hint of this taste. A decent and enjoyable dish.<br><br>Verdict. Visit at least once a month!! :D", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/QD7QQXGaDI4pyPD3qsKtrA/168s.jpg", "caption": "Laksa"}]}}, {"review": {"des": "We've eaten 3 times here so far and this place is really growing on me.  Food's always tasty and the staff super friendly, it's never super crowded and feel like it's a gem that not a lot of people frequent maybe because it's on the part of Milwaukee where there isn't much activity, but I have no qualms about that.  I always end up getting some noodle dish, of course their Singapore noodles are great along with the drunken noodles which is my favorite.  Also their curry dishes are always on point.  Last time we ordered the hot and sour soup which was quite tasty.  Only complaint I have is that my last visit was on my way home from the gym, went in to order take out and 30 min in the girl who took my order tells me she forgot the place the order so in total I waited about 45-50 min for a take out order when they weren't busy and I was pretty angry about it.  They didn't offer me a discount or throw in anything extra which most places do, so that left a sour taste in my mouth.  I know slip ups happen so willing to overlook that one incident.", "pics": null}}, {"review": {"des": "Had a very full and filling meal here and enjoyed a smattering of many of my husband's favorite Malaysian dishes.  There are three different areas of the restaurant so you can kind of pick which ambiance you like - restaurant style white vs. hipster bar vs. outdoor patio.  Service was excellent, the food satisfying, and the price was right.  Of all the things we tried, my favorites were SATAY CHICKEN (chicken was so flavorful, sauce amazing couldn't stop eating) and the BELACAN STRING BEAN (very different, never had this combo before of shrimp paste + green bean, definitely try!).  Also don't pass on the FRESH COCONUT because it totally hit the spot and complemented this excellent meal.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/e0RmIPZZFHeWdNyxaChG5Q/348s.jpg", "caption": "Malaysian feast"}]}}, {"review": {"des": "Went here for a hot date!  <br><br>Loved the indoor and outdoor seating. Got the lamb shank. Got the Malaysian style noodles called char koay teow. Both great! Think this is a newly frequented spot, and very good price to quality ratio going. High quality, moderate to low price. Boom!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ixsY4ey9EhvTOVW-OuxKcA/168s.jpg", "caption": "Char Koay Teow"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Eavn1hNQs0lQ247nNt4Bbw/168s.jpg", "caption": "Lamb shank"}]}}, {"review": {"des": "It's restaurants like this that make me love living in Chicago. With the exception of the tap water tasting funky, everything we had here was fantastic. Generally, the top three items listed in each section of the menu are the most popular and traditional dishes. The one outlier is the Roti Pratha appetizer - you must get this. Unfortunately, it only comes with one piece of bread, and you can't order more separately; the Indian bread in this dish was unlike anything I've had before - it was still very doughy, which was fantastic. Other great orders we had were the panang curry chicken (this was some of the best curry I've ever had, and the eggplant was fantastic), chicken satay, and iced Malaysian coffee (similar to Vietnamese coffee / uses condensed milk which is my favorite). We also had the beef rendang which was good and came highly recommended, however I would've preferred there be a liquid component to this dish. My friend and I split all of the dishes but couldn't finish as the entree servings were pretty large. We will definitely be back!!", "pics": null}}, {"review": {"des": "I'm an Australian living in Chicago and I had resigned myself to the fact that I would never find an authentic Chinese/Malayasian laksa in the US (there's an \"OK\" one in Santa Monica, but it's nothing great). <br><br>Then, on Saturday night my wife and I went to Serai and found the second-best laksa we've ever had. They also have real sambal puree (made from scratch!).<br><br>The only thing that (might) improve this laksa might be the option of rice vermicelli instead of egg noodles - \"Google\" Hunter St laksa in Sydney. But yours is a solid 9 as it is.<br><br>Thank you Serai, this was the happiest meal we've had since coming to Chicago! We will be back...and back....and back...", "pics": null}}, {"review": {"des": "Hopped on the blue line (California stop) and met up with my friend at Serai. It's easy to miss this place because the name is not really visible from the outside. I almost walked past it! <br><br>The restaurant was pretty empty when we were there, but it was also Tuesday night. The menu is pretty extensive so I had a hard time deciding because I wanted to try everything. In the end, I got the Char Kway Teow while my friend ordered the Rendang Lamb. We also split the black rice with coconut milk dessert. Everything tasted bomb!! I really enjoyed the char kway teow - generous portions and very flavourful. <br><br>Can't wait to come back and try everything else on the menu - especially the hainanese chicken rice! My mum is Malaysian, so I'll be taking her here when she comes visit me next time in Chi.", "pics": null}}, {"review": {"des": "First time with Malaysian food. Good. Similar to Indonesian food? I liked my choice of beef rendang. My toddler loved the coconut rice that came with. Will visit again. There were staff that were smoking in the back patio that told us to come around to the front to enter even though we parked in the back. We left thru the back patio without issue. I don't understand.", "pics": null}}, {"review": {"des": "Best thai food we've had in Chicago so far, hands down. The Rendang Chicken is my go-to, I promise it will delight the fk out of you. I've also had a couple of the noodle and soup dishes and it's all been delicious. The portions are generous and the price is right.<br><br>The absolute worst thing about having recently moved is that now I'm 2 miles farther from Serai. The regret hangs heavy in my soul.", "pics": null}}, {"review": {"des": "This place is amazing, the first time we came we got the rendang lamb, the crab Puffs and chicken satay. All were made so well and flavorful. Service was a bit slow considering it wasn't busy, but overall good experience.<br><br>Second time we came was yesterday, walked in at 650 without a reservation were told we probably wouldn't get a table till <br>845, so we opted to sit at the bar. Service was great, and when we asked the bar tender to just remind us what was halal on the menu he went and grabbed someone who knew more. The guy, who I'm assuming is the owner, said chicken, and lamb are definitely halal and he has certificates but the company he gets meat from couldn't provide a beef certificate, so he didn't want to tell people that it was. I thought this was incredibly honest and comendable!<br><br>This time we ordered the crab Puffs again, three chili chicken and Hokkien Char Mee. Everything was exceptionally good! Chicken came out hot and crispy despite the sauce on top and noodles were perfect.<br><br>Will definitely be back here!", "pics": null}}, {"review": {"des": "Everything we sampled at Sarai was delicious (and spicy!) -- agreed with others that the roti appetizer is a weirdly small size (it's one roti, and a lot of chicken curry).  Everything else is scaled abundantly. I will say that this spot didn't feel like a Malay restaurant- the interior felt cobbled together and haphazardly decorated- and the service was a bit spotty. But the food is good enough that I'd go back.", "pics": null}}, {"review": {"des": "Serai is a weekly staple in our office and collectively we've tried just about everything on the menu - the food is really just that good! The diversity is impressive since Malay food is a melting pot of Thai, Chinese, Indian and other Southeast Asian cuisines. Overall, the lamb and noodle dishes really shine here.<br><br>Lamb shank (10/10): The braised lamb just falls off the bone into a delicious savory brown curry. Phenomenal and a must get.<br><br>Char Koay Teow (10/10): Super tasty, there's a great smokiness from stir-frying in a wok and using two types of soy sauce. They don't skimp on the shrimp or sausage either.<br><br>Singapore Noodles and Drunken Noodles (9/10): I don't know how they do it but Serai simply blows it out of the water. These dishes are full of great flavors and are really crave-able. <br><br>Cumin lamb (9/10): Slices of spicy and garlicky stir-fried lamb with bell peppers. The heat isn't overbearing and it has a nice subtle sweetness too.<br><br>Chicken Skewers (9/10): Beautifully charred and grilled pieces of chicken finished off with a sweet and spicy peanut sauce.<br><br>Roti Paratha (8/10): The deep fried paratha is delicious - it's light, flaky and buttery just like puff pastry, but with an added hint of coconut. I wish the curry that went along with it were a little thicker and could be sopped up more easily.<br><br>Rendang lamb (8/10): Love the flavor of the coconut curry but some pieces of lamb were overcooked.<br><br>Panang Chicken Curry (8/10): Sweet, savory and creamy curry with perfectly cooked chicken and veggies. Really well executed but lacks a \"wow\" factor, but I'm being picky.<br><br>Potstickers / Dumplings (8/10): Wrappers are a bit thick but works with the fattier blend of pork used in the filling. These are actually quite large and will fill you up quickly.<br><br>Rendang Shrimp (8/10): Surprisingly it tastes really similar to the panang chicken curry. Good solid dish.<br><br>Vegetables - kang kung, green beans, eggplant (7/10): Fresh and simply sauteed, nothing terribly special here. I like adding in the belacan spicy shrimp paste, which might not be for everyone as the flavor is pretty strong.<br><br>Rendang beef (6/10): Same great curry but the beef is too dry for me to recommend getting this.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/IrEbN6SlSaIvSleJRCMvyw/348s.jpg", "caption": "Redang lamb"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/oy27xrWn8N2gz0OBB_ad1A/168s.jpg", "caption": "Char koay teow"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ieu3SLfMjfhuGxq4f4wVoA/168s.jpg", "caption": "Lamb shank"}]}}, {"review": {"des": "This place is my go-to for Asian cuisine. The appetizers are delicious and a great value if you just want a tapas style dinner. The 3 Chili Chicken is hands-down the best entree. I've not yet tried their traditional Malay plates, but their Thai entrees beat any traditional Thai restaurant in the city.", "pics": null}}, {"review": {"des": "4 stars for the food, 3 stars for chaotic service<br><br>The food is quite good and one of the very few Malaysian places in Chicago.  Roti Pratha - tasty but not enough roti.  Nasi lemak beef rendang, very good flavors and presentation.  Char koay teow, a good amount of squid and shrimp - comes with chinese sausage though not in the description.<br><br>Water on the other hand had a weird taste to it and the service was chaotic.   The layout of the restaurant seems built for chaos since the two sides of the restaurant are separated by a narrow neck through which the servers have to bring the food - got mowed down a few times waiting for a table.   Service was quite slow through all stages - e.g. asked for fresh plates at one point and by the time they came was pretty much finished with dinner, etc.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ElKxdq4I1QQwk23IDN-7Zg/348s.jpg", "caption": "Nasi Lemak"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/HScanhwqjPnHqDjZpQ_yvg/168s.jpg", "caption": "Char Koay Teow"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Zqat4qx022_TJJWWb7Kutg/168s.jpg", "caption": "Beef Rendang (Nasi Lemak)"}]}}, {"review": {"des": "Really enjoyed the food here and the authenticity of everything! The staff are very friendly and the menu has something for everyone!<br><br>We ordered the Roti Pratha, Hainanese Chicken, and the Curry Vegetables. <br><br>Ordering the Roti Pratha was definitely a good choice to get our appetites even more ready for the entrees to come. The Roti was warm and crispy, perfect for dipping into the red colored curry. This dipping curry was more soup like, and had potatoes and different tender meat chunks in it. The curry had a slight kick to it and just made it all the more irresistible. We really enjoyed this!<br><br>The Hainanese Chicken was juicy, tender, smooth, and just soooo delicious we could have eaten another half! The skin to the meat was nicely salted and the meat was sweetened by the dark sweet soy sauce it was resting on top of. The sweet and slightly spicy mango chutney sauce was amazing! The combination of all of the flavors and textures just made the chicken so incredible! The Chicken rice this came with was subtly flavored and very good as well!<br><br>The Curry Vegetables that supposedly the chef's signature dish paired perfectly with the chicken! The tofu puffs mixed in with the vegetables absorbed all of the delicious curry and each puff was a bite into heaven! The vegetables, which included Asian lettuce/cabbage, eggplant, tomatoes, and etc. were all tender and paired so well with the rice. We really could've ordered another bowl of rice just to finish the curry!<br><br>All in all, we will definitely be back to try the other menu items!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/pESVgjXBULWNMMWIm83jYQ/168s.jpg", "caption": "Roti Pratha-delicious!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/XznxkVOq-mkhAX-TqSZJ0w/168s.jpg", "caption": "Hainanese Chicken-amazing"}]}}, {"review": {"des": "Food was yummy, but there was no service. It took 15-20 minutes for a server to come to our table for the first time and take our order. No one ever checked on us throughout the meal and we had to flag someone down to get the check. The restaurant was not packed either. Odd experience.", "pics": null}}, {"review": {"des": "Overall, 5/5 food and atmosphere! <br><br>I first went into this place with a few other friends and ordered the roti pratha as an app, Curry laksa and Green Curry Chicken. Everything was just absolutely delicious.<br><br>My primary issue with the roti pratha is that they wouldn't let me buy another roti to go with it! The sauce was just so flavorful, and we were all taking the smallest bites out of the roti to make it last longer. But it just wasn't enough! They definitely need to provide an option that serves at LEAST two roti for this dish because it is so tasty! <br><br>The laksa is full of flavor and great if you're craving something soupy. Like a spicy noodle soup of sorts with more curry/coconut elements to it. It's something you must try to get a feel of the food they serve here!<br><br>I personally enjoyed the green curry chicken a lot, but that's because I Love sweet/savory foods! For some people in my group, the sweetness was a bit much, but I really enjoyed it.<br><br>Since coming here, I've ordered takeout three times, and each time they've been able to have it ready in 10 minutes! I've gotten the mee goreng, the char koay teow, and the pad thai. <br><br>Char koay teow tops all the rest in terms of their pan-fried noodles. It has so many different types of meats, and every bite is something new!<br><br>The mee goreng was good for sure, but didn't compare well to char koay teow or laksa. Still really great if that's what you're looking for, I just didn't find too many varieties of flavor in the dish.<br><br>Pad Thai was really tasty, but I feel like I want to keep searching for a place with even better pad thai. I got it with the BBQ meat this time, and i'll probably try it with chicken or shrimp next time. I'd definitely order it again since I crave pad thai frequently, and so far this place has the best quality to price! <br><br>The prices of everything are reasonable to me since the portions are actually really filling and super tasty! It's perfect for take-out, but eating at the restaurant was nice, especially since they have outdoor seating for the warmer seasons!", "pics": null}}]}