{"name": "shaws-crab-house-chicago", "reviews": [{"review": {"des": "Weekend Brunch Buffet! <br><br>I've been here a handful of times for dinner, but I'll say that I'm most impressed by their Sunday Brunch Buffet which I finally had the chance to try. As of 12/2/18, price for the brunch buffet is $65 and goes down on Saturday and Sundays from 10am-2pm. While steep in price, I think it's justifiable due to quality selection of items. Between the Chef's table featuring fresh carved beef tenderloin,  steamed king crab legs, seafood gumbo, and lobster bisque soup and the cold seafood bar with unlimited oyster on the half shell, you'll easily hit your money's worth. In addition, there's also a build your own omelet bar and plenty of brunch favorites from eggs benedicts to lobster mac and cheese to french toast to waffles to fried chicken. Just about something for everyone.  <br><br>I'll go ahead and say it, easily one of the best quality brunches you'll find in downtown Chicago. Adult beverages will run ya at $10 a pop (mimosas, bloodys, etc.). Their buffet price also includes fresh squeezed juices and coffee at no additional cost. And if you have a sweet tooth at the end of it, their dessert bar doesn't disappoint. The creme brule and chocolate covered strawberries I tried were excellent!<br><br>This one is Lettuce Entertain You affiliated so have those cards ready to rack or redeem those points. 'Til next time, cheers!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/G-1ywzYDWcamhk8Ctqr53w/348s.jpg", "caption": "Always room for dessert. Creme brulee and chocolate covered strawberries"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/YGizGvPSUQnF06w0QEyGtg/168s.jpg", "caption": "Round ?? Of buffet"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/dC12_38Yq8Ht_AKLJVuylQ/168s.jpg", "caption": "Chilled seafood bar"}]}}, {"review": {"des": "Shaw's is the place to come if you are looking for an upscale seafood restaurant. The staff is super helpful, the place is huge, and they will help you plan any type of event you have in mind.<br><br>The crab legs are super fresh and large, they are a must order. They offer a few different oysters and the staff are happy to describe the salinity and taste. I'd definitely try the calamari, generous serving and fried to perfection. <br><br>Make sure to leave room for dessert, as the key lime pie and raspberry pie are not to be missed. Any key lime pie fan would go nuts over theirs!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/lkJngK6Yh_5y5QnRAiH6Nw/348s.jpg", "caption": "Calamari"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/YuR0kZkIn1HH0Wj4oW_g1w/168s.jpg", "caption": "Shrimp"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/6gopSbQ-oUEqNHjuDyanpw/168s.jpg", "caption": "Crab"}]}}, {"review": {"des": "Can't say enough about Shaw's! WOW. The fish is fresh, the oysters<br>In season are fresh. Love the service, sitting at the bar was fantastic, checking out the shuckers. The lobster tacos appetizer is scrumptious.<br>What more is, the sides are good. Loving Chi-Town.", "pics": null}}, {"review": {"des": "I admit it--I'm a super #basicbitch. I don't know what it is about brunch but I. Have. Got. To. Have. It!!! And Shaw's definitely has it. <br><br>I've visited both their Schaumburg and Chicago locations and while the Schaumburg location has parking as endless as the sea of seafood they carry, I've only had brunch at the Chicago location since it has more variety (I believe this has recently changed, however, as I saw something that said Schaumburg has started serving Alaskan king crab legs and beef tenderloin again).<br><br>The beginning of the buffet is where you'll find desserts like chocolate dipped strawberries, biscotti, coffee cakes, cheesecake...I could go on and on WHAT THERE'S COTTON CANDY?! It's kind of embarrassing when Auntie Vanni is fighting with her niece and nephew over who gets the last cotton candy. Pro tip: they replenish them so no need to fear.<br><br>In addition to desserts, you can find eggs benedict, crab cakes, au gratin potatoes, breakfast sausage, bacon, fried chicken, etc. <br><br>Behind the wall is where the magic happens: acquaint yourself with the person standing in front of the station with lobster bisque, KING CRAB LEGS, and beef tenderloin. <br><br>Don't forget the oysters on the half shell, shrimp, ceviche, and other cold seafood items. There are also salads here, but #realtalk: did you come to Shaw's brunch buffet for salad? I think not.<br><br>Finally, there's also a waffle and omelette station. My niece and nephew love the waffles. I'm too busy making the Gatekeeper (of crab/tenderloin) my new bff so I can't really speak about the quality of anything with carbs there. <br><br>Except for the cotton candy. Strands and strands of delicate sugar spun around a paper cone. The concept is so simple yet it manages to evoke an Ego ratatouille-esque moment out of me. *Sigh*<br><br>All in all, definitely the best seafood buffet I've ever been to in Chicago (if you know of better ones, PLEASE DM me). Service ranges from 8-10/10 with the last visit being a 10. Our servers would hear us talking about how we wished there was this condiment or that drink and it would magically appear in front of us. What more can you ask for?<br><br>Shaw's, oh sweet, Shaw's. Its bountiful platters of seafood are prancing around in my head right now. I can't wait to revisit and make more seafood dreams come true. <br><br>P.S. SIGN UP FOR THEIR MEMBER CLUB, YOU WONT REGRET IT!  Discounts, specials, and a complimentary birthday brunch?! O.o<br><br>P.P.S. Some of the hot items were cold and/or almost empty so they didn't look too appetizing to me and I didn't bother to check if they were replenished later. I feel items like au gratin and crab cakes should be served in smaller chafers so that it would always be fresh. I won't write home about the rest of the desserts as I prefer items with fresh fruit as opposed to confections with little to no nutrient content (because I like me cotton candy and need to draw the line somewhere).", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/2xgLYhtwcifQk2XJc_E6HA/348s.jpg", "caption": "The pièce de résistance! Like a magical unicorn, you're (I'm) captivated by this tower of cotton candy in all its splendor."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/9eKrkzP8D60CozPwV7lSsA/168s.jpg", "caption": "More desserts"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/lYfSosOMiF966vRsFs1ZMQ/168s.jpg", "caption": "Dessert table"}]}}, {"review": {"des": "So worth it! The service was amazing, our server accommodated our complicated order and was very kind. Shaw's gave my friend a free dessert on the house for her birthday and I thought that was so nice of them! <br><br>Let me just start off with the complementary table bread they offer is bomb. <br><br>We ordered the 14oz New York strip: amazing! Cooked to a perfect medium rare and very flavorful with the sauce provided<br><br>Scallops with bacon: omg actually the best scallops I've ever had in my life! A must try if you love scallops too.<br><br>1.5 lb boiled lobster: of course had to get lobster if you're coming here. It was soo good with butter<br><br>Brussels sprouts, fried calamari, grilled calamari, lobster tacos, and mashed potatoes: great sides to share with a large group. <br><br>Raspberry Sorbet, pumpkin pie, and creme brûlée: Sorbet too sour for me, but pumpkin pie was amazing and so was the creme brulee <br><br>Overall great experience and choice for a birthday or for a large party. 5 stars all around.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/F6dZUq6zKlOKZhdShnYoPg/168s.jpg", "caption": "Grilled Calamari"}]}}, {"review": {"des": "Very high priced Brunch per person $65.00 but its seafood included so i understand. Stage food was delicious and i would definitely return.", "pics": null}}, {"review": {"des": "There is not much more that I can say about one of the great restaurants in the city of Chicago, Shaw's Crab House!  The live jazz music is enough to bring you to this little gem just off the Magnificent Mile!  Now, I still prefer the New England Clam Chowder soup, but the seafood gumbo was excellent!  I always love the bountiful sourdough bread, and the raw oysters!  I had the lobster fettuccine which was a new choice for me here, and I was not disappointed!  Lastly, the dessert sampler with a little apple pie, key lime  and cherry pie leaves me longing for a return to th Second City, and Shaw's Crab House!  I see a trip to the United Center and a return to Shaw's Crab House in my future!", "pics": null}}, {"review": {"des": "Whenever friends or family come to Chicago to visit, this is a tried and true place I've brought them to for years. Yes, touristy. But so what? Good food, great service/staff. While they're principally known for their crab dishes and oysters, they have a damn good filet and other seafood selections as well. There is a fantastic brunch buffet on weekends - food is constantly refreshed and several stations are manned. I love the lobster bisque (cup or bowl) and highly recommend it. If you have room, I highly recommend the desserts. I'm a sucker year round for their key lime pie. During the holiday season, they serve up one HELL of a fantastic pumpkin pie and pecan pie!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/eg8m8QZfiaHji7v_5bc_xw/348s.jpg", "caption": "Guess who came to dinner? Little Red Law Convention Man and Groot from Guardians of the Galaxy..."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/KWzaY75IaJjKWTikajV8gA/168s.jpg", "caption": "Sunday Brunch is wonderful!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/iMasTekGmWIZnTyIMLtBHQ/168s.jpg", "caption": "Tuna Tartar"}]}}, {"review": {"des": "We went here tonight for a joint birthday dinner- had been looking forward for awhile! The place is very large, comfortable, wooden, and we were seated right away. Waiters and servers all professional and had great timing with service. <br><br>The bread as people mention is really fantastic. We ordered some wine (all great) and apps. The tuna tartar was decent, the grilled calamari was excellent. Shrimp gumbo was also decent, and the lobster bisque was tasty and a well portioned bowl of soup. <br><br>I went for the $80 crab legs (hey, it's my birthday) and I REALLY hate to say this but I was disappointed. There was a large amount of crab, but parts were not fresh and tasted fishy. I was looking forward to this for awhile- i likely got a bad batch, but for the price it was extra disappointing. Wouldn't order the crab again. <br><br>The lobster linguine, tuna, and scallops on the other hand were really fantastic. I would recommend any of these over the crabs and spent my meal wishing I had ordered differently!<br><br>We had chocolate cake and keylime pie which were each special and traditional. <br><br>So, disappointed in the crab at a crab house, but they did other things very well.o", "pics": null}}, {"review": {"des": "Fresh seafood and an old world Chicago atmosphere. Totally dig this place. <br><br>Our group of six ventured here for dinner on a Friday night. Rule number 1: make sure to check in on your Yelp app! During our visit, they had an offer for 50% off 1 Appetizer-Your Choice. We opted for the chilled blue crab fingers. It came recommended by our server as a good app to share with a group. I couldn't stop eating them. My order: a bowl of lobster bisque ($10) and the oyster sampler (full dozen, $36). I loved that the bisque had zucchini and carrots in it. I was also a fan of the champagne mignonette that came with the oysters. <br><br>A couple people ordered the cold appetizer combination- oysters, jumbo shrimp cocktail, lobster tail, Alaskan red king crab bite, and blue crab fingers ($25 per person). They also offer a grand shellfish platter (hot or cold) that serves 4-5 people, $85-$90. <br><br>Service was great. The extra dirty martinis were on point. I'd definitely hit this place up again.", "pics": null}}, {"review": {"des": "Shaw's is our go-to spot when we're in River North! The happy hour specials are great - buffalo shrimp appetizer is AMAZING and usually on the happy hour menu! The sushi is always fresh and really good quality, and the crab cakes are fantastic. One of my favorite items on their menu is the dessert sampler. It's only $10 for 4 mini desserts! And they are all super good! The pumpkin pie at Shaw's is THE BEST I've ever had!! We always make a point to visit Shaw's in November, specifically for the pie! The only item I'm impressed with has been their French fries - but hey, they aren't known for fries! Haha <br><br>Atmosphere is great, especially in the oyster bar! Make sure to download the Lettuce Entertain You app to earn rewards when you visit Shaw's!", "pics": null}}, {"review": {"des": "Came here on Sunday for the brunch buffet for my Dad's belated birthday. The restaurant was moderately crowded, and the buffet stations were spread out across different rooms, making some stations a bit far from where we were sitting. The layout is a bit chaotic, and it would often get congested walking back to our table with our heavy plates.<br><br>The food however, was amazing! There was so much variety in the buffet that I wasn't able to try everything before getting too full. My favorite by far is their king crab legs, which is probably the best crab legs I've ever had. The meat was incredibly fresh, tender and sweet. Some of my other favorites were the oysters, lobster bisque, Cinnamon roll French toast, and au gratin potatoes. There was also an amazing dessert spread with my favorites being the chocolate mousse cake and chocolate covered strawberries.<br><br>The service was also impeccable. Our water/coffee was always full and dirty plates were replaced quickly. Since it was my dads birthday, they brought out a complementary chocolate cake with more chocolate strawberries. Our waiter was also offering to bring us more desserts from the dessert table so we didn't have to trek over to the other room.", "pics": null}}, {"review": {"des": "We did the Sunday all you can eat brunch here. They have a huge selection of items including all you can eat crab legs and oysters. I don't eat a lot but I tried to try a little of everything. Only suggestions would be to change up the mac n cheese recipe. I feel like it can be creamier, it was a little clumpy both times I went back to get it. <br><br>I don't think this will be our regular brunch place because it's pretty expensive but it's definitely the spot to go for special occasions! I recommend trying it our at least once or if you're visiting come here, you won't regret it!", "pics": null}}, {"review": {"des": "Been coming here for years Best Seafood buffet always fresh and delicious , lobster bisque soup, crab legs , oysters, ceviche <br>Maryland crab cakes to start , no need to overfill your plate we practice small portions and return for more , fine dining at its best highly recommend to those who love seafood", "pics": null}}, {"review": {"des": "While the brunch is amazing, I was disappointed in the time it took the rest of my party to receive their food. It was four of us dining in and two of us doing the buffet, we had already eaten and was on our back with our second plate and they still hadn't receive their order. It should never take over 30 minutes from time of seating to get food, especially a lobster roll. As I mentioned the buffet was amazing, but if I'm going to be paying $65 dollars for a brunch buffet I am going to need the staff to do routine bathroom checks because there is no reason for patrons to have to do a scavenger hunt for toilet paper.", "pics": null}}, {"review": {"des": "The perfect Sunday brunch! I think we each ate about 50 different items, and the staff was extremely friendly too. I avoided the pancakes and sausage and eggs, a mere sideshow to the excellence of all the fish products that the staff had clearly been up all night preparing. <br>It is a charming place, a real old school mob feel to it, the bar is cool too and less formal. <br>They really to a good job in keeping things fresh and tasty, and I can't think of something that needs to be added to their display, they've already thought of it all. What a gem!", "pics": null}}, {"review": {"des": "This was a lovely experience. The atmosphere is nice and they seated us right at the time of our reservation. Now my issue is I don't like seafood BUT since I was with a group and didn't want to make a fuss, I researched the menu. Believe me - there is plenty on the menu for you if you are like me. <br><br>The bread they serve is delicious, for starters. This night, I had already known I ordered a lot of meat dishes previously this week, so I nixxed getting a chicken or steak plate. I got the brocollini and Mac + cheese sides for dinner and WOW. Delicious and plenty of food just as sides to fill you up. <br><br>Other people in my party got assorted dishes and I was told the salmon, the calamari and lobster was good, from their POV. <br><br>For dessert, I got the raspberry pie and it was insanely good. It's rather tart (I like it like that), so pay up for the vanilla bean ice cream on the side as a palate cleanser of sorts. <br><br>We will definitely be back next time we are in town!", "pics": null}}, {"review": {"des": "We got here late on a Sunday, but the food was worth it. Honestly, some of the best clam chowder I've had. The rainbow roll was good--it had all the fish you'd want on a sushi roll. The shrimp cocktail was $5.25 for one shrimp, which I don't think is the best bang for your buck. The tuna tartare was amazing! It had the perfect balance of citrus juice, avocado and tuna. Definitely a must-get. We sat on the oyster bar side, and it was so cute. The live music was nice, too.", "pics": null}}, {"review": {"des": "Overrated. Highly overrated. Now I must admit, I didn't have the crab which is supposedly their specialty. However, the salmon, for 40 something dollars, was subpar at best. It was overcooked, requiring a knife to cut, and dry. Sadly, the pesto sauce it came with didn't help, as it was also dry and lacking in flavor. <br><br>All in, the food was overly expensive and lackluster. I am honestly surprised by the high level of reviews, but maybe this passes for good seafood up north (it certainly wouldn't down south!) <br><br>I will not be coming back.", "pics": null}}, {"review": {"des": "Old school restaurant that doesn't do anything particularly well or badly. Sushi was surprisingly good for an American restaurant.<br><br>We had the seafood tower and a couple appetizers here. I think Shaw's is the type of restaurant that isn't particularly interesting, but I'm not the prime demographic for it. <br><br>My retiree age guests were happy with the casual atmosphere, simply prepared foods, and defined flavours. <br><br>I did not enjoy my meal, but at the end of the day I'm not judging my own preferences, and I had no complaints about anything I was served.", "pics": null}}, {"review": {"des": "Shaw's is our go-to spot for birthday brunch! Sign up for their emails and your birthday brunch is free - which is an excellent deal considering it's $65 per person otherwise! The brunch buffet includes king crab, fried shrimp, breakfast waffles, bacon, sushi, oysters, all kinds of delicious treats!", "pics": null}}, {"review": {"des": "Excellent option in downtown Chicago for an upscale evening.  Choices include sushi, seafood, and steaks, and our party didn't have anything we didn't like.  I had the Maryland crab cake platter that comes with fries and cole slaw, but most options are a la carte.  The wine menu was also top notch.  Stop by when you're in the area and you won't be disappointed!", "pics": null}}, {"review": {"des": "Came in for my birthday and was pleasantly surprised. The cold seafood & crab legs were the highlights. The crab cakes in the cooked section were good, but fish was woefully over cooked. I couldn't try any of the breakfast items since I was so full. Made to order omelette was a nice touch. Mini Belgian waffles smelled to artificial for me, maybe tone down on the vanilla extract? Creme brûlée was excellent. Servers were efficient.", "pics": null}}, {"review": {"des": "I've dined at Shaw's on a  previous occasion & found them to be much too overpriced for the actual food & while today is somewhat of an exception I'd still struggle to call this my staple choice for seafood. The special lobster menu ends today unfortunately but I'm glad I got a chance to experience the lobster tacos. While it wasn't a life altering dish I have to admit that they were still some good tacos. Admittedly the lobster didn't taste the freshest & they were still a good option for lunch. The place definitely has an old school aspect to the the restaurant's decorations & it also translates into the dishes from the kitchen. Nonetheless you could do a whole lot worse than Shaw's but if classic seafood cuisine is your forte than I'd feel comfortable recommending coming here.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/lEgKRKId_Qum648SIqYx9A/168s.jpg", "caption": "Lobster Lobster Tacos"}]}}, {"review": {"des": "AMBIANCE: 4/5<br>The main dining room looks very classic. There is wood paneling with red accents as well as memorabilia hanging on the walls. The people dining there are a nice mix of River North elite in sport coats and flashy dresses as well as tourists. The clientele is definitely closer to middle-older aged than a young crowd. The waiting area is nicely located next to their fully stocked bar, which you'll likely utilize if you come on a weekend. Definitely make a reservation because the place was packed, and even with a reservation, we had to wait 15 minutes to be seated. The tables themselves in our section were quite close together, which makes it difficult to have a conversation without feeling like your neighbors are listening. <br><br>FOOD: 4.5/5<br>There's a reason Shaw's has been around as long as it has and continues to be full of customers to the brim. It's the food!<br><br>Appetizer: lobster tacos and hot appetizer sampler for 1 (comes with a small lobster tail, tiny piece of crab leg, mini crab cake, 2 poached butter oysters, calamari). The lobster tacos were light and refreshing thanks to the greens and avocado, plus they had a decent amount of lobster on them. Everything on the appetizer sampler was delicious but very small portions for the price. I guess I was spoiled by Boston's seafood scene.<br><br>Main: we ordered the ora king salmon with sides of mac and cheese and sauteed spinach. The salmon was seriously out of this world, perfect crisp on top and tender on the inside with great flavors. The sides were also perfectly prepared.<br><br>Dessert: Raspberry pie with vanilla ice cream. Highly recommend. It has actual raspberry pulp that's tart and delicious, keeping the dessert from being too sweet.<br><br>SERVICE: 4/5<br>Our waiter was pleasant and checked on us every so often. Water was always filled and utensils changed when appropriate. It was a little difficult to flag him down when we needed something, but maybe that's because of the busy nature of the restaurant.<br><br>MONEY'S WORTH:<br>I had $125 to Lettuce Entertain You, so we used it here. Our bill for everything listed above plus 2 cocktails was $152 before tip. Let me give you an example of prices: half a dozen oysters are $18, 2 lobster tails are nearly $80, which is insane. Seafood can be pricier but it doesn't need to be this expensive. The upcharge for being in River North makes it incredibly expensive, but if I didn't have the gift card, I wouldn't have gone.<br><br>IG @afoodiegoescleanish", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/fyZ1vtxufLel3ocbD7vUnQ/348s.jpg", "caption": "Ora King Salmon"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/siJ3oFwims5aKRxai4wn_Q/168s.jpg", "caption": "Bread service"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/V3em4j9JPCHLIOVFMZGmgg/168s.jpg", "caption": "Lobster tacos"}]}}, {"review": {"des": "I had king crab bites, a lobster pasta and a crab cake. the lobster pasta was absolutely my favorite. it was very creamy, enjoyed the chunks of lobster. so delicious. the crab bites are cold. idk if it mentioned that in the description, but just wanted visitors to be aware of that. the crab cake was really flavorful.", "pics": null}}, {"review": {"des": "We came with a big group. Service was leisurely bordering on the downright slow. This was not the place to come for a quick bite. <br><br>That said, the food was generously portioned and there's enough on the menu for everyone. I really enjoyed the seafood gumbo. Not quite New Orleans but a worthy substitute. The tuna that was recommended was fairly ordinary though. A few days later and it hardy makes an impact. <br><br>But the thing is, my dining companions who have a simpler palate than me really loved this place. And that's what works here: it's an old school place that can satisfy a generational family. Decor is old school with rich deep colors and not a window in sight. <br><br>You are here for the seafood. Come stay awhile.", "pics": null}}, {"review": {"des": "Child please!!!! What the hell can I say bad about Shaw's? <br>NOTHIN!!!! SHIT if you find something let me know cuz I've never AINT never and prolly never will have a bad time at this place. The drinks are strong the oysters are fresh and the people are friendly", "pics": null}}, {"review": {"des": "We love Shaws and have been here so many times. I wish I can give them 5 stars but I can't.<br><br>The brunch buffet is superb! The main reason we go here is for the seafood since it's a seafood place. <br><br>I have a thing for oyster, my kids have a thing for shrimp and my husband's fave is the crab leg. So the seafood buffet is definitely the reason we go here almost every sunday.<br><br>The price is reasonable and kids under 4 eat free. <br><br>The reason for 4 stars only is because of the service. Since we only go here on Sundays for the brunch, the waitresses looks like they don't care. It took them quite sometime to actually grab our drink orders. One time, they forgot about my husband order and we just didn't bother to ask twice.<br><br>Overall, we will definitely go back here again.", "pics": null}}, {"review": {"des": "This place consistently delivers good stuff. We went to the Oyster Bar  for a dozen of the chef's choice raw oysters. Perfect and so very fresh. There's always one variety that is the favorite but this time we had three diners and three different oysters declared \"best\". The Cosmo is always perfect. One diner order the tuna sashimi and it was consumed too quick to taste. The calamari was tasty and fresh as well. The clam chowder is definitely one of the best I've ever tasted: oh so creamy!", "pics": null}}, {"review": {"des": "While in Chicago visiting family, we decided to dine somewhere new on a Saturday night. Shaw's was not my original choice. However, I was in the mood to try something different. Long story short, the place had great service, the prices were pricey (Lol) and the food was okay. I'm still scratching my head trying to figure out why this place was less impressive than my original choice because they offer the same type of food. Hmmmm. Anyhoo, we started off with lobster tacos. Three mini tacos filled with lobster, guacamole and slaw. Just okay. A small cup of gumbo. Just okay. Needed more flare.  Parmesan crusted haddock. Decent. Combo platter which included three butterflied shrimp, three scallops and a crab cake. The crab cake was delicious! Again, everything was okay. I'm jusno rush to go back.", "pics": null}}, {"review": {"des": "How have I never reviewed Shaw's before? <br><br>This is our go-to celebration spot. Birthdays and anniversaries are always celebrated at Shaw's for brunch for us.<br><br>Their brunch is AMAZING. <br><br>My favorites: <br><br>God's bacon - seriously mana from heaven. Thick, caramelized, amazing.<br><br>The new banana bread French toast is more like a decadent bread pudding.<br><br>Bananas foster crepes are delicious, despite the fact that the crepes are pre-made.<br><br>Parmesan crusted cod - amazingly flaky, yet crunchy crisp and perfectly seasoned <br><br>Crab legs and drawn butter - a staple. I love that they're pre-cut and rather easy to access the meat, I just wish they would give me a bigger pile each trip<br><br>Lobster bisque - rich and satisfying<br><br>Beef tenderloin - a mouth watering, melt in your mouth, rare indulgence<br><br>Creme brulee - I could eat ten of these decadent delights <br><br>So many more choices! Too many to list!<br><br>The selection is huge, food is beyond delicious and satisfying, and the service is very friendly.<br><br>We absolutely love coming here for brunch! And you will too!", "pics": null}}, {"review": {"des": "Yum! Yum! Yum!....Pretty much sums up my experience. The Lobster Bisque was on point and the Lobster Roll took my breath away. This place can get expensive really quick but the quality of the meal and portion sizes make up more than enough to justify the cost. <br><br>I couldn't help but notice the crowd was heavily ethnocentric and my family stood out like a speck of pepper on a mound of salt. After this brief but all too real realization the rest of the experience was really entertaining. I sat and watched people and overheard boisterous conversations and it was all to the backdrop of jazz music. It's seriously one of the most entertaining places I've been in Chicago.<br><br>Not so humbly submitted,<br>Michael C.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/rLaiPtcRaovOEJB7FoQcsA/348s.jpg", "caption": "New England Lobster Roll"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/kxzyt-Q9bUCuhwyJri2TmA/168s.jpg", "caption": "Oysters Rockefeller"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/85FgeueYTqeoWcll1sRa2g/168s.jpg", "caption": "Lobster bisque."}]}}, {"review": {"des": "I was out in Chicago on a business trip and both my brother and sister met me in this great city.  We are all originally from Los Angeles, so finding decent seafood isn't a problem.<br><br>We had Sunday brunch at Shaw's and left satisfied.  The selection of seafood and breakfast items was more than adequate.   Each item of seafood we sampled including the oysters and warm crab legs were fresh and above average to excellent quality.<br><br>I love the location of the restaurant which is just off the the Miracle Mile and in the River North district.<br><br>Each time I find myself in Chicago, it's a sure bet I'll have a meal here.", "pics": null}}, {"review": {"des": "Well. Actually I had a hard time with this. We went for their Saturday Brunch. So I have a tough time rating buffets. However I will start with this. The staff is incredible. All cutlery is constantly replaced when used. Plates cleaned off. Refills etc. service is amazing.  So this leads strongly towards 5 stars. <br><br>Food. Lobster bisque was by far my favorite!  Oh yes!  A must. Gumbo was ok. The crab was my second favorite. Cooked perfectly. Such a sumptuous flavor. Did not seem like a straight boil and serve. Seemed so much more. Great stuff. <br><br>They offer traditional breakfast (eggs, bacon, sausage, eggs Benedict etc) . offer lunch such as crap cakes, huge breaded and fried prawns. Huge and fabulous. Almond crusted cod etc. omelet and waffle station. Cold offerings the best. Ate a lot of delicious (although small) fresh oysters, a wonderful spicy ceviche. Smoked salmon. Plus salads etc. <br><br>A very nice desert selection. Over indulged on all accounts. A great stop!  $59.", "pics": null}}, {"review": {"des": "$59 brunch buffet. <br><br>They have several stations with lots of options. <br> <br>Chilled Seafood & Salad Station: oysters, sushi<br><br>Hot Buffet featuring traditional breakfast items and signatures - Fried Shrimp, Crab Cakes, and Parmesan Crusted Cod, etc. <br><br>Build your own omelet & waffle bars.<br><br>The carving station with Roasted Beef Tenderloin, Lobster Bisque, Seafood Gumbo, and Steamed Alaskan King Crab Legs.<br><br>Dessert station. <br><br>Overall, everything is decent.", "pics": null}}, {"review": {"des": "We had to come to Shaw's for a dinner in our latest trip to Chicago just to pig out on fresh oysters! And the oysters were, as always, awesome with plenty of types to choose from.  We went with a dozen of various east coast types, and if we hadn't decided to try to sushi and eat a full blown dinner, we could have polished off a dozen more.  The yellow fin tuna sashimi and tuna sushi we tried next were very fresh, and very tasty.  We were both impressed with the sushi menu and are planning on trying more the next time we are in.<br><br>For our entrees I had the yellow fin tuna, and my wife had the Nantucket scallops.  The tuna was prepared wonderfully, with a nicely asian/soy style sauce.  My wife's Nantucket scallops were something special - wonderful bites of sweet, tender goodness.  When in season, I will go out of my way to find these scallops.  Our \"green\" side dish was steamed broccoli with a brie and cheddar cheese sauce.<br><br>The staff was friendly and courteous, and we both loved the decor (think old school Chicago).  We will be back, but we both really want to try the oyster bar side of the restaurant which had a fun vibe to it.", "pics": null}}, {"review": {"des": "Ugly Sweater Brunch was over the top. OMG it was so crowded there was barely anywhere to stand! Although we were on time for our reservation, it took at least 30 additional minutes to be seated.<br><br>Once seated we ordered our drinks and then it was every man for himself. So many choices that you find yourself getting dizzy from all the options. We love seafood so we got plenty of oysters and crab legs. The lobster Mac and Cheese was just okay but the scalloped potatoes were rich and delicious. My son said those were the best scrambled eggs he'd ever had in his life! He was humming as he ate them. <br><br>My only complaint was that the butter for the crab legs was freezing cold so it made them not so enjoyable. I asked the server for hot butter and she basically told me in so many words that she didn't have time for that. I'll return again but definitely with just the hubby and not my three greedy kids lol!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/JCCD0RbH_OrMWMkaoCp_5g/348s.jpg", "caption": "Ugly Sweater Brunch @Shaw's Crab House with the family!"}]}}, {"review": {"des": "The happy hour was an awesome find! If we weren't eating dinner at Shaw's we'd stop for their happy hour to get their $1 Oysters!! Sitting at the bar and watching them shuck the oysters is almost like dinner and a show. <br><br>The service has always been great and the food has always been wonderful!", "pics": null}}, {"review": {"des": "This review is based solely on their weekend brunch, I have yet to try their regular menu yet. <br><br>The weekend buffet at Shaw's is definitely worth trying! At $59, it is worth the price. There are crab legs, oysters, jumbo shrimp cocktail, and so much more! Even the hot seafood items such as the fried shrimp and crab cakes are worth the money! The fried shrimp is huge and there are little to no fillers in the crab cakes. <br><br>However, you don't have to be a seafood lover to enjoy this brunch, there are plenty of other options as well! There is also beef tenderloin and honey ham which are both delicious. The beef is served rare to medium rare which may not be suitable for everyone's taste.  I didn't get to try the soups but they do also offer gumbo and lobster bisque. <br><br>Honestly, my absolute favorite thing to eat is the fresh made Belgium waffles, it is so freaking good! Don't overlook some of the \"basic\" items as these in my opinion are as equally delicious if you have enough room in your tummy. Another delicious non-seafood item is the candied bacon, it really hits the spot with the sweet and salty combo.  <br><br>To really top things off, they have donut holes from do-rite! <br><br>There is plenty of seating so we have never had a hard time trying to get a reservation for brunch which is always a plus because we've been able to enjoy it on a whim and not have to preplan. The only thing is that because the place is so big, there is a chance to get seated quite far from all the food. <br><br>Service has always been excellent! Even when it was super packed and busy, our server was always around to clear plates and make sure our drinks were filled. <br><br>Just go try it!!", "pics": null}}, {"review": {"des": "Shaw's is a staple of Chicago, and I now understand the draw of this well-loved restaurant. <br><br>Shaw's has beautifully maintained the ornate interior of the main dining room, which is where I dined for lunch on a cold, rainy Friday afternoon. It seems that during the workweek, the oyster bar is the main draw, but there were a few diners sitting with us in the dining room for lunch. We were immediately brought bread and drinks to start our meal. Our waitress was both attentive and kind, allowing us to take our time to read the menu and decide on our orders.<br><br>As it was lunch, I went with a lighter meal of the Tuna Sushi and Asian Salad combo. The tuna was fresh, and the rolls were made with a good balance of rice and tuna. The table also ordered the parmesan crusted haddock, the grilled tuna, and crab cakes. Everyone seemed to enjoy their lunch. <br><br>The best part of the afternoon was dessert on the house. As it was our first time dining with Shaw's, we were served a slice of the key lime pie to split as a welcome. This small gesture felt quite special and rounded out our visit to Shaw's.", "pics": null}}, {"review": {"des": "One of the best Sunday brunch buffets around. The price is worth it as you will have gourmet food that is very well prepared. The selection is overwhelming as this isn't your average place, you are gonna find some awesome food here at every turn. I felt I got my money worth as we tallied our food up and prices it out at other places where we had similar offerings. Everything was delicious and I would go back again.<br><br>This is a must try for those who want a large brunch that has high quality food at every station.", "pics": null}}, {"review": {"des": "This brunch is absolutely, positively, out of this world ridiculous. Very few places in Chicago where you can get sushi and french toast in the same place, but this is one of them.<br><br>Highly recommended the bacon because, well, it's some of the best bacon in the city, a perfect combination of sweet and salty. There really is no bad option for brunch here, but given the price, I'd recommend sticking to, well, not scrambled eggs and hash browns. I'm sure they're wonderful but there are so many high end options. Multiple types of salmon -- including a pastrami salmon that was absolutely fabulous -- Maryland crabcakes, beef tenderloin at varying temperatures, the aforementioned sushi, crab legs...and all of it is incredibly delicious. Three plates here was enough to keep me satisfied for the entire day.<br><br>This place, as you might expect, has a well trained staff that is attentive without being overbearing. Whatever these folks are paid, they deserve a raise. Highly recommend brunch at Shaw's.", "pics": null}}, {"review": {"des": "Even though it was a free dinner and close to where I was staying. Who goes to Chicago and eats seafood? Serves me right to even try. It was way to expense for fresh but mediocre seafood. The chowda was good but also nothing to write about. Not worth a return trip.", "pics": null}}, {"review": {"des": "This is our first time eating at Shaw's and we loved it.<br>We're no stranger to fish houses but Shaw's food (the ones we tried) are among the best we've tasted.<br><br>Here are reviews for each item:<br><br>NE clam chowder - 8/10 Better than many other places but not the best. $9 (bowl)<br><br>Grilled calamari - 10/10<br>This is an awesome appetizer. We usually get fried calamari and don't like grilled but, we took a chance on this and it paid off. Grilled calamari mixes very well with the light olive oil and sweet bell peppers.  $16<br><br>Hot combo plate (garlic shrimp, grilled scallops, and crab cake) - 9.5/10<br>Typically combo plates don't stand out but this one does. Every item shine on their own. Scallops are perfect, crab cake has a ton of crab (unlike most crab cakes), and the garlic shrimps (prawn size) are amazing. My wife doesn't care for shrimps but she loves these shrimps. $22<br><br>Parmesan-crusted Haddock - 10/10<br>I've had parmesan-crusted sandab before and it's one of my favs. Haddock is even better. The meat breaks into nice, layered chunks, and has a slightly sweet, flavorful taste. It tastes a bit like cod and seabass. This flavorful protein is presented on a bed of grilled spinach, lemon capers, and a bit of lemon chunks. It all add up to an amazing entree. $22 is a great price for this dish.<br><br>We wanted to try more but were already full. We came here for king crab but were distracted by the other stuff. Needless to say, we'll be back for more. <br><br>Shaw's need to open a branch in California. Chicago is too far for us to be regulars.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/GbvYw4ZFTH2o_zXSfJxoxw/348s.jpg", "caption": "Grilled calamari - $16"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/H7aFPmm6OOkpSAEp3sdX4Q/168s.jpg", "caption": "Parmesan-crusted Haddock - $22"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/3mmlucNcFPZaSwqjG0h8Tw/168s.jpg", "caption": "Awesome seafood combo"}]}}, {"review": {"des": "Crab on them haters by going to Shaw's!! Came here for appetizers before heading to dinner. Rumor had it that Shaws has an amazing happy hour- couldn't resist but to check it out. We got there around 5:00 pm and waited for about 12 minutes before being seated. It was packed but no surprise for a Friday night. We had half a dozen oysters and we split the hot seafood combo. We also ordered soup- lobster bisque and seafood gumbo soup. The lobster bisque was really tasty- my fiancé loved it. It was his first time trying it and he had absolutely no expectations but he said it was very flavorful and exactly what he needed after a cold brutal Chicago day. I had the seafood gumbo. I thought it was the best soup I've ever had! Although I wasn't crazy about the rice in it, I definitely thought the rice complimented the spiciness of the gumbo. Also, you really felt the richness of the different types of fish- they did not short you seafood- that's for sure! I've never tasted anything like the seafood gumbo so I would highly recommend trying it out! It was my fiancée first time trying oysters- we got a set of the raw ones and we also tried the cooked oysters. The cooked oysters soaked in the butter sauce was mind blowing good- I mean it catches you off guard how delicious it is. Safe to say, we liked the cook oysters more. All of the seafood was absolutely delicious- small serving size for what you're paying but keep in mind that this you're eating quality seafood. You're really paying for the quality not quantity. <br><br>Also, be aware that their Schaumburg location happy hour is not the same as their Hubbard street location. I called Hubbard street location to confirm that the happy hour menus were the same and they said yes but once we actually went there, surprise, they're not! The happy hour menu in Schaumburg offers more happy hour appetizers- the Hubbard street happy hour appetizer is only on the oysters. So if you see the happy hour menu- make sure you distinguish between the two locations.", "pics": null}}, {"review": {"des": "*Disclaimer: this review is based on their bar side of the restaurant*<br><br>Pros:<br>(1) PLENTY OF SEATING in the bar area;<br>(2)  It's where the kitchen is and it's where you get to see the action; <br>(3) employees are friendly;<br>(4) oysters on the half shell at amazing prices during happy hour; and <br>(5) the seafood OMG!<br><br>There are regular tables in the bar area as well but I suggest sitting at the bar (there are short stools at the bar - one notch about a chair but not so tall that short people have a hard time getting seated).<br><br>And there are live bands that play here but it's later in the night.<br><br>I would definitely be back the next time I visit Chicago.  Or I can just move to Chicago and come here all the time.  Then I would be broke and homeless because I spent all my money here.<br><br>Yelp Challenge: #49/100.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/oDWiPjDmwEBuxqV2mBAXsQ/168s.jpg", "caption": "Maryland style crab cake"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/9QZ7EBkcVwl6euKo7fQsPA/168s.jpg", "caption": "Bowl of clam chowder"}]}}, {"review": {"des": "The best brunch buffet I've ever had.<br>* incredible service <br>* carving station<br>* all you can eat crab legs<br>* lobster bisque<br>* all you can eat sushi<br>* oyster bar<br>* Bloody Mary bar<br>* eggs Benedicts<br>* candied bacon<br>* omelettes to order<br>* waffle grills<br>* pastrami'd salmon<br>* full bar<br>* dinner items (I hadn't the time nor room to try any of them)<br>* giant dessert cart<br><br>I just itemized everything, cuz holy jabolies this place has it all, and it's all FANTASTIC!!! It's pricey and posh, but if you have the cheddar, you have to try the best brunch around!!! <br>It's a little hard to find, cuz the streets get really confusing around that area, but you'll figure it out.", "pics": null}}, {"review": {"des": "This review is based solely on their weekend brunch! <br><br>The service and ambiance in the restaurant is very nice. I enjoyed many items, specifically the bananas foster french toast, crab cakes, fried shrimp, oysters, crab legs and lobster bisque! I didn't care for most of their other breakfast items or their sushi. Overall, I thought it was decent but it wasn't my best meal in Chicago. I've also been to buffets I've enjoyed more (some holiday buffets in Scottsdale and the Wynn and Wicked Spoon in Vegas). <br><br>Good, but not great. The seafood was really high quality. Just don't head to this buffet expecting to be mind blown and I think you will really enjoy!", "pics": null}}, {"review": {"des": "This is without a doubt my favorite restaurant in the city of Chicago. I've eaten here several time now and have been surprised with its consistent awesome service and food every time. <br><br>Decor-doesn't look like much from the outside, but boy is it nice inside. Large bar right when you enter and very large dining room. Tables are always looking great and accompanied with comfy seats. <br><br>Service-Outstanding! All your needs are met here, waiters know the menu inside and out. They give great recommendations and make sure you don't have to ask for refills on drinks. <br><br>Food-AMAZING! Oysters are the freshest I've ever ate. Jumbolya was great, had the perfect blend of seafood and non seafood. Bread with butter was even top notch. Bloody Mary drinks was the best ever, they're served with large shrimp. Filet minion and crab legs were to die for. Steak cooked to perfection with amazing flavor. Crab legs were moist, flavorful, and lots of meat. Dessert was just good, but I'm not a big dessert guy either. <br><br>Tip-large tab, but worth every penny!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/VRZ7JT1jVWb-TKYqWWUSOA/348s.jpg", "caption": "Cappuccino-perfect!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/0sv-NaOoLZtZk3l-ZOs52g/168s.jpg", "caption": "Mashed Potatoes-rich and creamy."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/KnhVfQgQ3BqnvAYU_ashhg/168s.jpg", "caption": "Filet Mignon and crab legs-AMAZING! Worth every penny and then some."}]}}, {"review": {"des": "This place served the best king crab legs. I'll be honest this is fun experience, they give you the bibs if you want and the service was good. It was busy which was surprising.  They oysters are the best I tried their oyster fest and it was great I. I also indulged in some sushi and sashimi which was good. Very filling and yummy. Would recommend this place to all my freinds and family who love seafoods. This would be a great place to satisfying your cravings though. Well worth it!", "pics": null}}, {"review": {"des": "Always love to come here for their weekend breakfast. It's a buffet setting. Their food are delicious and a lot of choices to chose from. The price of the meal I would say it can be a little less but for the amount of seafood and unlimited drink you can expect that. I personal think it can be a little lower. Would recommend people to at least come and try it out for the first time.", "pics": null}}, {"review": {"des": "We booked Shaw's for a company dinner.  Overall, we were happy with the food, drinks and service.  No complaints at all.  We'll be back.", "pics": null}}, {"review": {"des": "It was my daughter's birthday.   Shaw's wasn't our first choice.  She wanted to celebrate it at a buffet.   Yelp took us to a place on the Lakeshore, on the south side of Chicago.  I called, no one answered.  We drove there, and no one helped us.  So we drove back to the hotel where the concierge suggested that we go to Shaw's Crab House.  Reservations were made.  A short taxi ride got us there quickly.  <br><br>There are two sides of this restaurant.  The more classy side with more formal dining, and the oyster bar side, which was more casual.  Our reservations were for the \"classy\" side.  But, when we got there, we decided that Oyster Bar was the side we needed to be on.  The menu on either side were about the same, both food and pricewise.  The food was good.  Their calamari was cooked and seasoned perfectly.  The clam chowder was flavorful and full of clams.  The lounge combination, though pricey had garlic shrimp, sea scallops and crab cakes.  Delicious!  The Lake Superior Whitefish was also pricey, but, good.  <br><br>Service was good.  They took care of us and made sure our cups were always filled.  The table was cleared when we finished eating.  We weren't stuffed silly like when we normally eat at a buffet.  But, we had a good experience here.", "pics": null}}, {"review": {"des": "A great restaurant to go with family or friends, or even your loved one. Great ambient, great service and great food. The first time I went to the restaurant, it was mid-March so I had red wine instead of beer to pair with the seafood, but I think this time around Summer is perfect for beer-seafood pairing.<br><br>The oyster bar offers an amazing setting for any visitor, either Chicago locals or tourists. <br><br>My favorite plates: <br>The New England Clam Chowder<br>Tuna Tartare<br>Yucatan Fish Tacos<br><br>I recommend to pair these dishes with red wine or a cold Corona. Definitely a must in Chicago.", "pics": null}}, {"review": {"des": "My husband and I love seafood. We had been to Shaw's once before so we decided to try it again for his birthday since we were already downtown. They did not disappoint. This restaurant is a well oiled machine. The dining room is huge. Not sure how many they seat but we didn't have one flaw with the service. Our water glasses never got less than half full.  Our waiter was spot on and had items to recommend to us and left us never needing a thing. <br>Let's talk about the food. I had the scallops. Some of the best I've ever tasted. We had key lime pie for dessert. It was excellent and that comes from 2 people who have tried the key lime pie at just about every restaurant we've been to that serves it.<br>They only tip I have for Shaw's is make a reservation. You'll be happy you did.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/2kCsl-IPS_SsZx2PWQ1SdQ/168s.jpg", "caption": "Scallops"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/sAu2TGjhT5ogDVyCdQOQrw/168s.jpg", "caption": "Crab finger appetizer"}]}}, {"review": {"des": "In town for work yet again. This place was recommended for oysters.   So laid back in a good way, live band, waiters & waitresses take the job seriously. A great selection of oysters per region.  Sushi is also on the menu! Craft beer is good, vino is solid, and atmosphere is one that I did.  Try it out.", "pics": null}}, {"review": {"des": "FEAST! That's what my friends and I did when we dined at Shaw's Crab House for brunch. The cost of $59 was well worth it because the buffet was amazing (except for the omelet and crepes). This is a great place to come with a group of friends or to celebrate Easter or Mother's Day. I definitely plan on coming back to Shaw's to enjoy this buffet.<br><br>The highlights of the buffet for me were the:<br>- Fried Shrimp: I could have eaten them all day long. 5 stars<br>- Lobster Mac & Cheese: Has the right mix of lobster and cheese. 5 stars<br>- Caramelized Smoked Bacon: Enough said! 5 stars<br>- Crab Cakes: While mini sized they were delicious. 5 stars", "pics": null}}, {"review": {"des": "The brunch is worth the price. There are four different stations to sample several options. From Crab legs to freshly made omelettes and bacon. Ceviche, deserts, gumbo, fried shrimp, cold shrimp, salmon, potatoes, etc........... will be going back soon.", "pics": null}}, {"review": {"des": "Food, service and atmosphere = A1 experience.  In the heart of the city this place is a solid and I can't wait to go back.  Food is amazing.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/1TZ9ItIq9UZi3w3gmH6pfA/168s.jpg", "caption": "Amazing food!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/7_xn9SKLKisoFBm_RngedA/168s.jpg", "caption": "Best Clam Chowder I've ever had."}]}}, {"review": {"des": "Probably the best seafood restaurant in Chicago period five star service through and through this place was packed on a Tuesday night my daughter got a very thick cut of salmon that was cooked to perfection my wife got the Dover sole that you said was the best you ever ate. The creamed spinach was out of this world this place is not cheap but you definitely get your money's worth I actually appreciated that there were three managers walk in the room making sure everything was perfect I can tell this place takes Pride and serving the best food possible and giving the customer the best experience possible I", "pics": null}}, {"review": {"des": "We came here for our 10th anniversary in 2010 and this trip (2017) we did not think we could find the place again since everything was a blur and we drank a lot. But we found it!<br><br>This place is just great! Great food, service, and ambience. Love it.<br><br>I started with sashimi ($29) and the wife had sushi ($29). We also got half a dozen oysters that were excellent ($18). We tried the lobster tacos and they were the best I have ever had ($16). <br><br>Throw in a few drinks, some good conversation with people sitting next to you, and you have an entertaining evening.<br><br>We will return for sure, and now we know we can find it again.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Kh1ZOn1nOqFwwQ6Ckkr4Ag/348s.jpg", "caption": "Sushi"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/AIBHN5p3ZVbmtf06BL3niA/168s.jpg", "caption": "Oysters"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/eOtDLisZcWExxgSwiKCW2A/168s.jpg", "caption": "Sushi"}]}}, {"review": {"des": "Shaw's has become an 'elder statesman' among Chicago's top seafood restaurants. Through the years since 1984, the Missus and I have enjoyed occasional dinners here (also at Shaw's in Schaumburg) and attended special events.  Alas, Shaw's annual Smelt Trip to Wisconsin is history, but their Weekend Brunch Buffet continues to score among our all-time favorite dining out experiences.<br><br>The variety and quality of food is extraordinary.  King crab legs and (rare) roasted beef tenderloin are the main attractions for us, but other highlights of our recent visit included the pastrami smoked salmon, lobster bisque, lobster mac & cheese, fried shrimp, crab cakes, and banana French toast.  The dessert portions, thankfully, are bite-size so we saved room to indulge in a few.<br><br>As always, we enjoyed wonderful, attentive service.  The cost of the brunch is actually lower than their à la carte dinner menu price for king crab legs.  It's a great value.  About the only hitch is the human traffic jam of diners carrying full plates back and forth between the main dining room and the oyster bar ... but there's no 'road rage' here because everyone is having fun!", "pics": null}}, {"review": {"des": "Redemption is sweet!<br><br>After dining at another Shaw's location to much dissatisfaction, the River North location proved to be an excellent experience.<br><br>The server made perfect recommendations and expressed a thorough knowledge of the menu.  Keep in mind, I've been to this location several times but love to get recommendations from each server.<br><br>The sautéed spinach was outstanding, along with the scalloped potatoes.  <br><br>The whole deep fried snapper was wonderful!<br><br>Usually, I don't eat desert.  The apple pie, however, was great!  I'm glad she recommended it!<br><br>I ate enough to last me through dinner the next day.  I'd come back any day and recommend this location any day!<br><br>Thank you!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/TJrlCMSb1AV-n6euwdSJOA/348s.jpg", "caption": "Whole snapper...scored, dredged in flower, and deep fried.  Extremely filling!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/aJENb1tupxx3y98sFLqyjw/168s.jpg", "caption": "Apple pie and vanilla ice cream really good!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/nB-hYbcsCuqtj_GLvC13Pw/168s.jpg", "caption": "Crab cake appetizer.  Good lump crab."}]}}, {"review": {"des": "I attended brunch at Shaw's a week ago. Usually Shaw's has amazing service, but this time around we were rushed and under serviced. Our server hardly came up our table and we waited around 45 minutes just to receive our food. The food was cold and the fries were just thrown on a plate. I expect better service and presentation for the price point.", "pics": null}}, {"review": {"des": "Yet another stop for Restaurant Week 2018. <br>We were enticed by the value of the RW menu - offering a surf and turf entree with a 4 oz lobster tail and 6 oz filet and an upgrade to 1 1/4 lb Alaskan crab legs for an additional $21. With the normal surf and turf (8 oz lobster and 6 oz filet) being 60$+ and the Alaskan crab legs $70+, we thought it was a great value. <br><br>We were seated immediately after all members of our party were present. However, we were strangely not given the Restaurant Week menu. Odd..  The service can best be described as \"meh\". Pretty sure they glared at us for not ordering drinks. Nice. <br><br>We ordered:<br>CLAM CHOWDER: A small, rich cup of chowder. While flavorful, it was pretty no-frills and pretty no-clams as well. <br>COMBINATION PLATTER: The garlic shrimp were pretty delectable. I only wished there was more! The scallops were cooked decently but not spectacular. The crab cake seemed a touch underdone was a bit more wet than I would have liked. The mustard dressing was a nice compliment. <br>CRAB LEGS: My mom is a huge crab leg lover and can pack it away. The crab legs here were extremely fresh and absolutely packed full of meat. I never would have expected my mom to tap out over a 1 1/4 lb plate of crab legs! This was the winner of the night. <br>KEY LIME PIE: As someone who has tried every single key lime pie shop in Key West, and someone who bakes this frequently... it was disgusting. It was somehow grainy and tasted like flour. Nothing like a true key lime pie. So disappointed by this. <br>CHOCOLATE CAKE: Rarely will I choose chocolate cake over key lime pie, and here I would. The cake is palatable at least, though dry and nothing particularly special. Better cake at Costco. <br><br>Overall, I probably would not be back non-RW. If you're looking for some super fresh crab leg this place is worth a shot for our next Restaurant weeks election. Give the dessert a pass though.", "pics": null}}, {"review": {"des": "Reaaaaally great New England clam chowder and desserts. Definitely leave room for the dessert sampler, which came with mini versions of their famous key lime pie, pecan pie, and creme brulee.<br><br>I also really enjoyed our Mahi Mahi, which was prepared with a tasty soy sauce glaze. <br><br>We also got the Nantucket scallops, which were less impressive and a bit overcooked. Also didn't really enjoy the fried calamari appetizer, thought it had too much fried batter.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ukUqCNLmTse_PfFtONGUuA/348s.jpg", "caption": "Dessert sampler"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/z_UMQydlfPMlmeVOUOnXSg/168s.jpg", "caption": "Spicy tuna and yellowtail"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/hj2j8B5dp8FZIM2WBKNDRQ/168s.jpg", "caption": "Nantucket scallops"}]}}, {"review": {"des": "Pros:<br>- BEST oysters in Chicago. So fresh. HUGE selection. They ship in daily, a method the founder pioneered in Illinois.<br>- BEST mignonette. It's champagne mignonette. Can't get enough.<br>- BEST stone crab claws. Better than Joe's.<br>- Good clam chowder.<br>- GREAT service in the bar. Great atmosphere there, too. I've experienced better service in the bar (they have full staff of waiters there), than in the dining room. I've had nice waiters in the normal dining area, too, but I've also had ones that work part-time for the Lyric and definitely don't want to be here but have bills, lol.<br>- Packed, but they can always fit you in. 7/10 times, I end up here on some holiday, because we didn't make reservations ahead of time. I spent Thanksgiving, Easter, etc here.<br><br>-----<br>Pro-tip: <br>(1) come here between 4-6pm any day of the week for 50% off oysters. They give 1 west coast and 1 east coast selection. Unlike some other places, the discount oysters are just as fresh as the non-discount oysters, and they are very flavorful.<br>(2) sit in the bar. it's livelier, and everyone's friendly and fellow patrons talk to each other, + TVs. but if you avert your eyes, they will leave you to alone, too. so, whatever you want. <br><br>I eat oysters all over Chicago, and this is definitely my favorite spot. These oysters are the freshest and filled with oyster juice.<br><br>Skip: the lobster and lobster roll (not bad at all, but Hugo's lobster and lobster roll are better). Lobster roll mix is pre-made, so it cannot be served other ways. It is always served with mayo (I prefer mine served warm with drawn butter).", "pics": null}}, {"review": {"des": "We enjoyed a very good Christmas Eve family dinner here about 10 years ago so we decided to book Shaw's for an 80th birthday celebration dinner for 15.  The service was friendly, professional and attentive, and the food was spot on. Everything was seasoned and cooked perfectly. Lots of people ordered combo dinners of sea food and steak and everything  was delicious. We also ordered the grand cold shellfish platter - the presentation is spectacular - sumptuous and tasty. I pre-ordered a birthday cake with strawberry whipped cream filling/frosting to cap off the evening and it was wonderful. They also brought out yummy dessert samplers for the table, on the house, to thank us for our business. All in all, it was a festive evening of delicious food and great wine.  Would definitely go back.", "pics": null}}, {"review": {"des": "3 stars for the food. 1 star for the bar manager and bartender. Food was all fresh. Crab bites fresh but a bit boring. Excellent lump crab cake. They could have done better with the side salad. Old fashioneds were good. Bar manager knows his stuff. He was able to find the whisky i was looking for which made the visit much more memorable. Thanks!", "pics": null}}, {"review": {"des": "My wife and I went here for a Christmas dinner with out the kids and the appetizers were good but when we received our serf and serf they were both way over cooked and rubbery and also very small potions for 80$ each. I will never go back and very disappointed driving an hour to the city for that meal. I very rarely use yelp but was so disappointed so I wanted people to see this.", "pics": null}}, {"review": {"des": "I heard great things about the Sunday brunch buffet here, and decided to try it out while we were here.  If you like seafood- this is definitely a place for you.  They had everything from steamed king crab legs (REALLY GOOD!! but also really salty...), beef tenderloin (although the first piece i had was really rare, I asked them for a more well done piece next time and it was not an issue), oysters, some dressed salads, smoked salmon, pastrami smoked salmon, chocolate covered strawberries, traditional breakfast items like eggs, french toast, waffles, omelettes, crab cakes, lobster mac and cheese, fried shrimp... lots to choose from.  <br><br>Service was great! They kept our drinks full and emptied out the dish for crab shells often. I did find it a little on the expensive side at $59/person, and it was a little salty for my taste.  It was pretty crowded when we went, so may be best to make a reservation, although I'm sure it wouldn't be too much of a wait if you didn't have one.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/dJEOag4bLs4pf6Xa3vpTFQ/348s.jpg", "caption": "Brunch buffet first plate"}]}}, {"review": {"des": "I booked Shaw's for our arrival dinner into Chicago for 4th of July weekend.  It took lots of willpower not to book Joe's Seafood (one of our favorites from multiple trips in their LV location), but we wanted to try something more local.  Besides, my late grandfather was also named Shaw so it would be cool to try out the restaurant.<br><br>Shaw's is a massive restaurant with classy, old-school vibes.  It has a large bar area, casual Oyster bar, and a full dining room with red leather couches.  The menu is truly massive with every-type of seafood and preparation imaginable.  Service from Anthony was excellent.  Overall the food was excellent too, so 4 stars!<br><br>We ordered a crustacean-centric dinner of course:<br><br>Apps: We shared a 1-lb entree of chilled, jumbo stone crab claws from Santa Barbara.  We're used to the Florida ones, but apparently they were out of season.  Three large claws with super-sweet meat just like we remembered from Joe's.  The spicy mustard dip enhances the flavor for sure.  (5 stars)<br><br>Soups: Gumbo was classic New-Orleans style but they added some fish meat. Smokey and thick. (4 stars). Lobster Bisque was rich and creamy (4 stars).<br><br>Entrees:  A tale of two crabs?  My wife ordered the 1.25-lb plate of Alaskan King Crab legs.  Plenty of meat, most of it sweet, but the texture and cook seemed a bit uneven.  She had a few pieces that seemed overcooked and on the dry side.  Other pieces were moist and perfect.  Strange.  (3 stars). She regretted a little by not getting more Stone Crabs instead.   I opted for the Signature dish of king crab and 6-oz filet, and both of my items were perfect.  My crab included claws and shorter sections of legs but everything was moist and sweet! I even shared a bunch with the wife.  The cook on the filet was medium rare like I like it.  Nice cheesy, horse-radish crust. (5 stars).<br><br>Dessert: We shared a slice of their key lime pie.  Thick, light, and very tart with a nice cookie-crumble crust for sweetness (4 stars).<br><br>As I mentioned earlier, Shaw's is great and a welcome introduction dinner to Chicago.  The king crab leg quality seems a bit uneven, while the stone crab and Signature crab and filet rocked.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/alOJnB46DA-AwB19DiQ5NA/348s.jpg", "caption": "Key Lime Pie (4 stars)"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/9jYHiNSOSGugNU-OaHjk3w/168s.jpg", "caption": "The Signature - 6oz filet with side of King Crab claws and legs.  My crab was sweet and juicy (5 stars)"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/jHXV94YRjmkvMuAb0wVXHA/168s.jpg", "caption": "1.25 lb King Crab Legs - sweet but texture and juiciness not even (3 stars)"}]}}, {"review": {"des": "First and foremost, I want to say our server Danielle was absolutely the best.  Very welcoming, and helpful. She took the time to go over the entire menu and explained everything in detail.  Thank you, Danielle!  You rock!<br><br>Shaw's is amazing from start to finish. A great selection that apparently changes at least every day. We started with some scallops and oysters.  These scallops were the Nantucket variety, very small but sweet, in a lemon butter sauce. Perfectly cooked and amazing taste.  This was my first time trying oysters, and I really liked them. Obviously fresh and I'd certainly try them again. <br><br>Main courses were blackened snapper with etouffee sauce.  Spiced and prepared just right with a perfect flavor.  Girlfriend had grilled Atlantic yellowfin tuna...  the only way I can say it is, flippin' amazing!  Cooked medium rare, wonderful taste, the ginger sauce was perfect with it.  Honestly one of the best pieces of seafood I've ever eaten, and I only had a couple of bites.  She thought it was pretty amazing too. <br><br>The key lime pie for dessert was excellent as well.  <br><br>If you want good seafood in downtown Chicago, make a reservation and eat at Shaw's.", "pics": null}}, {"review": {"des": "Omg! It was heavenly delicious! Sooo recommended! We tried lobster pasta and a set of different seafood and oysters were amazing!", "pics": null}}, {"review": {"des": "From the very first second you step into the restaurant you're taken the ambience of the place. You're instantly transported back into the 1940s. Darkwood comfortably upholstered booths and lighting and terrific music round out the great dining experience. Had the oysters, and they were terrific. Wife ordered the signature seafood salad and it was Sublime. I was torn between the halibut and the king crab legs and chose the crab.<br><br>Mickey, our server, was very knowledgeable and gave great recommendations.<br><br>Is Seafood is your desire and your are in downtown Chicago make this a must-stop place.", "pics": null}}, {"review": {"des": "I heard about Shaw's brunch from a friend and I had to experience it for myself.  I was so impressed after my first visit, I took my significant other to Shaw's as an early Father's day celebration.  We arrived late, but were quickly seated thanks to Jordan.  Our server Chelsea, was also amazing. She and Jordan both made sure we were well taken care of and made us feel special.  They are the best. <br><br>The food selection for brunch is unbelievable. There was fresh fruit, king crab legs (all you can eat), fried shrimp, lobster mac and cheese, steamed veggies, beacon, sausage, crab cakes, omelets made to order w/crab meat and a dessert table to sum it up.  It's by far the best brunch in town. If you love really good food, Shaw's Crab House is the place to go.", "pics": null}}, {"review": {"des": "Great service and great food. Sat at the bar and the bartender was beyond helpful with the menu and was very attentive to anything we needed. The lobster bisque was very good, only wish the veggies were a bit smaller in it. The bowl was a very generous size. The stone crab claw had big pieces of meat and was very tasty. I was just a bit taken back with it being cold, but that is how it is supposed to come. The sushi rolls were also good. No complaints, will definitely be visiting again.", "pics": null}}, {"review": {"des": "Exceptional service<br>Coffee stout is off the charts !<br>Dessert station spectacular <br>Will be back!", "pics": null}}, {"review": {"des": "The atmosphere of this place is nice. I enjoyed it very much. Since I was craving seafood and had no one to go with here, I went alone. It also has a casual dinner for Two and or a large dinner party vibe . The menu has lots of options it was hard to choose as many of the options looked and sounded very tasty. My drink preference was a Spicy Mezcal Margarita.  I started with a New England clam chowder. Thats was great. But I was disappointed with my main course. I ordered the \"Lounge Combination\"  and it wasn't my favorite and in my opinion OVER PRICED. It came with Garlic Buttered Shrimp which was over cooked, butterflied and still in the shell. I didn't noticed it was till I took a small bite and was like \"oh damn shell on\". The sear sealed the shrimp to the skin which made it hard to take apart just to eat. I would have preferred the shrimp to at least already been de-shelled for the serving size. The Scallops were very small, plated on a tiny bed of spinach and unevenly seared. I guess I was under the impression the scallops would have been slightly thicker and dining size versus appetizing sizes. The crab cake was very filling and moist but I mainly tasted the dressing of the mayo. So all 3 in my<br>opinion could have been better. BUT, I am going to come back later this week to try something different as this place is very popular for their seafood. Hoping of being blown away. Every place deserves a second chance.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/k8JuKPUmCmdaP5vsd7j1ag/348s.jpg", "caption": "The Lounge Combination"}]}}, {"review": {"des": "Shaw's Crab House was pretty good. I'm going to go with 4.5-5 stars on this one. For those that don't know, Shaw's is two restaurants in one. They have a casual, lively oyster bar to the right as you walk in, and a fancy, upscale seafood restaurant to the left. This review is for the seafood restaurant on a Saturday night (6/10/17) around 530-545PM.<br><br>Shaw's is conveniently located right by the Chicago River in Downtown. We had a boat tour scheduled at 7:30, so we headed here to catch a meal before our departure. This place (obviously) specializes in crab and seafood, but they do have steak and one pasta dish (lobster fettuccini). Their seafood is seasonal and fresh, and often comes from fishing families that the restaurant knows personally.<br><br>I thought the restaurant area was very nice. The decor was sophisticated and classic. Seemingly high end. The atmosphere was in line with your typical fine dining establishment. Lighting was a bit dim. Most people come dressed up, so I'd recommend wearing something nice. The menu was decently sized with a lot of great options. Prices weren't too outrageous, with most entrees ranging in the $30-40 range.<br><br>Our party of 5 ordered the grand cold shellfish platter to start. This came with maine lobster tails, oysters on the half shell, shrimp, maryland blue crab fingers, and alaskan red king crab bites. Everything was very fresh and delicious. The lobster tails, shrimp, and oysters tasted particularly good. The oysters tasted among the freshest I've had.<br><br>After the appetizer, I decided to order a bowl of clam chowder, priced at $9. For my main course, I ordered the grilled antlantic yellowfin tuna, priced at $37. The clam chowder was good, but didn't blow me away. It was very heavy and filling. It was definitely above average, just not the best I've had. The yellowfin tuna was superb. Cooked medium rare, this sashimi-grade fish came with a raw center just how I wanted it. The ginger-soy vinaigrette complemented the fish well. It was to die for. Obviously fresh and definitely a quality piece of fish.<br><br>All in all, Shaw's was able to meet my somewhat high expectations. I was impressed by most everything I tried. I forgot to mention that I also got to eat some soft shell crab, which was pretty cool. I had never had it before, and found it interesting yet tasty. It was pretty good. Everything else was great. Service, ambiance, decor - no complaints. Go ahead and check this place out! Reservations on a Saturday night around 530 weren't necessary, but it did start to get crowded towards the end of our meal.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/aZ2tQFhmDI2PZqTDBQifQg/348s.jpg", "caption": "Pretty cool"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ONtC36Nx60GZuMOo1r41sw/168s.jpg", "caption": "Tuna was bomb!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/pLsHcFK1iAurCXkj-FsF7w/168s.jpg", "caption": "Grilled Atlantic Yellowfin Tuna"}]}}, {"review": {"des": "We hadn't eaten at Shaw's in years and returned for their Easter brunch. We enjoyed ourselves completely!  <br><br>Service was attentive and friendly. Plus I love a restaurant where the maitre 'd walks the floor and  makes sure his house is operating as it should be!  <br><br>There were five stations and I never saw an empty platter at any of them. We all are partial to seafood and enjoyed all the fresh oysters, crab legs, and shrimp we cared to eat!  We also enjoyed the fried shrimp, the lobster mac & cheese, and salads. <br><br>There were a ton of the more 'usual' brunch items too such as waffles, omelets, prime rib, eggs Benedict, and more. <br><br>Loads of desserts and even colorful cotton candy for the kids!  <br><br>Very well done and one of the better brunches we've done.", "pics": null}}, {"review": {"des": "While this restaurant has been around for over 30 years, we just came across this gem on a recent visit to the Windy City. It wasn't an inexpensive dinner, but definitely worth the stop. <br><br>One caution: If you use a Yelp check-in coupon, make sure they remember to put it on the bill. Our waiter did not.", "pics": null}}, {"review": {"des": "The best seafood ever! It's expensive but it worth it.<br>I ordered clam chowder, fried calamari and Lobster Mac and cheese and I strongly recommend these dishes.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/bOOzjDkcaNlZo_4C2Hh-eA/348s.jpg", "caption": "Lobster Mac and cheese! Yummy"}]}}, {"review": {"des": "OMG I don't know but what a disappointment.....I was really waiting for this experience <br>but my tuna was way too old to be served.", "pics": null}}, {"review": {"des": "Shaw's never fails to deliver a great meal with great service. In the last 25 years of going here I never had a disappointing meal. The menu supplies a wide range of entrees and appetizers. The wine list is also large. The live music rounds out the night. Great atmosphere.", "pics": null}}, {"review": {"des": "Top notch seasonal menu. It was seriously delicious and expertly curated. I definitely enjoyed my own dish (the lump crab cakes) and bites of my mother in laws scallops and my grandmother in laws haddock. <br><br>My bf got chicken was less than average but I'm not that surprised given this is a seafood restaurant. <br><br>My brother in law lacks in table manners (he eats w his hands, but how else would you eat king crab legs, honestly) and our server Kirk, was actually rather rude to me and my extended family because of it. I was caught off guard when he agreed to take a photo for us and then walked away! Or when we asked for a wine pairing and he gave a vague answer and an expectant stare. <br><br>The food was cooked PERFECTLY but Kirk rly dampened my first meal here.", "pics": null}}, {"review": {"des": "Food & service were good but not what we expected for the prices they charge. <br>Probably try someplace different next time we are in Chicago.", "pics": null}}, {"review": {"des": "I liked the food and service there!<br>Went on three different occasions and each time the waiter was very friendly and helped us to choose right food and drinks, even suggested out of menu items.<br>Definitely will go there next time in Chicago!", "pics": null}}, {"review": {"des": "Having lived in Streeterville for 4 years I've walked past this place many times and wanted to try and I'm so glad I finally did. It was a little pricey- but we knew that going in and intentionally went for nice drinks and appetizer. Despite the prices the ambience is rather casual and very friendly. Our service was great very attentive with multiple people coming by multiple times just to make sure we were all set. I've had some bad service lately so this really stuck out to me. <br><br>Now for the food: we ordered the Alaskan king crab bites for an appetizer and they were great very tasty and great quality crab! I ordered the Caesar salad and crab cake combo which was good although the crab cake was a little small and dry. My boyfriend ordered the fish tacos which he said tasted great just not very big for the price. The people we were with ordered the lobster roll which they said was amazing! <br><br>Overall a pretty great experience a little pricey but we knew that going in- definitely going to come back to try the lobster roll!", "pics": null}}, {"review": {"des": "This is our go to place when coming to Chicago. The atmosphere is always nice. Staff is quick and friendly. We love the brunch and won't miss it when we visit. The variety is unbelievable. The food is alway fresh and tastes amazing. We also come for oyster fest if we can. They are also alway fresh", "pics": null}}, {"review": {"des": "Tried out Shaw's last minute.  I was hesitant because my 3.5 was with us and it was a much later dinner than he is used to.  We were seated right away.  Our waitress wasn't as personable as most usually are.  We started with a crab cake, shrimp cocktail and the burrata. The crab cake was the smallest crab cake I've ever ordered and for $16 I was fairly shocked.  Now the crab cake was small but soooo delicious!! I don't know that I would get it again just due to size.  The shrimp cocktail was how it should be, I wasn't crazy about the presentation but the shrimp were huge and the cocktail sauce was good.  On to the burrata, creamy and delicious and the presto tomato and bread all went together perfectly.  I love lobster bisque, for me this was the absolute worst lobster bisque I have ever had. It was not hot, flavor was off and  um where the heck was the lobster?! Not one piece.  For my meal I had the crab legs and filet.  The crab for me was not all that, I wish I would have done the lobster tail instead. The filet was cooked exactly to what I requested and was a nice piece of meat but could have used more salt. My husband ordered the same and shared the same sentiments.  We got the broccoli and augratin potatoes... I wouldn't order either again.  <br>Now for my favorite part of the meal..Dessert!! The mini dessert platter was to die for.  I would have never ordered the raspberry pie and that was my most favorite item!!!  All in all decent meal but I'd probably check out another steakhouse vs going back. Well I'd go back for dessert haha", "pics": null}}, {"review": {"des": "I brought my parents here for the Mother's Day brunch buffet and it was great! I specifically chose this place because it was one of the few restaurants that included king crab legs in the brunch buffet.<br><br>I'm used to the over-crowded, mediocre holiday buffets and Shaw's was a refreshing experience! I was surprised by the large variety and quality of food and how well stocked they kept the food stations. There were never more than 1 or 2 people in front of me. My favorite items were the never ending towers of freshly shucked oysters, jumbo shrimp cocktail, tasty maki rolls, roasted beef at the carving station, mini Belgian waffles, and cotton candy! They also had steamed king crab legs, but, unfortunately, they were a little over-cooked.<br><br>Service was good and they made sure to keep our table clear of old plates and over-flowing oyster and crab leg shells. Everyone enjoyed the brunch buffet and they even sent all mothers home with a gift certificate to a complimentary weekend brunch! Despite the hefty $$$ mark-up for the holiday brunch buffet, I thought it was well worth it.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/kgORS5OEGPE_ZaZYhFk5_g/348s.jpg", "caption": "Mother's Day brunch buffet options"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/bIXZp5fdh_0joDo-V-IeJA/168s.jpg", "caption": "Mother's Day brunch buffet options"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/wvZ8o1dxZR5FzePDiOqZJA/168s.jpg", "caption": "Mother's Day brunch buffet options"}]}}, {"review": {"des": "Having lunch here was a birthday treat from my good friend. She nailed it by picking this restaurant!<br><br>All I can say is that the service was spot on. We got to the restaurant at 11 AM and they accommodated us by serving drinks of our choice at the bar even if they do not open until 11:30. Restaurant has an old style feel to it. The original section was a paper factory prior to the conversion. They had jazz music playing that fit the mood. Pretty cool. We were immediately seated right at 11:30. Wait staff were attentive. Here's what we ordered: tuna tartare for the appetizer and Parmesan Crusted George Bank's Haddock & Shaw's Signature Seafood Salad as our main entrees. Very pleased with every bite we took. To top this off, we were surprised by our waiter with their Key Lime Pie. Delicious!! <br><br>All together, a very pleasant experience. It's a must try if you want to get away from the typical Chicago eats.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Z9tEqF8vhxkHllJ1KhXTTA/348s.jpg", "caption": "Shaw's Signatura Seafood Salad. Delicious!!"}]}}, {"review": {"des": "The seafood salad is to die for and exactly what I have been in search of. I really wish we had time to enjoy a second time. I definitely recommend this place.", "pics": null}}, {"review": {"des": "Shaw's is my favorite restaurant in Chicago, it never disappoints!  Try to sit in the middle of the main dining room, where all the action is.   Love the finger crab app,  main of crab of course or swordfish is excellent, finish with key lime pie!   Looking forward to our next trip to Chicago and Shaw's!", "pics": null}}, {"review": {"des": "This was my first time doing brunch here and we were celebrating our 12 year olds bday. We arrived at the tail end of the brunch slot but greeted very pleasantly and informed that we have 1 hour to eat(which is a ton of time for poor buffet eaters).<br>Menu was extensive, interesting and delicious. My favorite was the mini crab cakes and the crème brulee was pretty good as well. Don't miss out the omelette stations ! Shaws was so wonderful they waived the b'day boys buffet lunch!! with all this for 2 adults and 2 kids including the bday child it was close $200 with tip and all. Certainly a special occasion place and the service is excellent, why 1 less star? the plates were a tad bit dirty and was taken care of as soon I brought it to the servers attention.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/XpuwkHfYr78mDWX8uWMp7w/168s.jpg", "caption": "More seafood galore"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/vSagZANZVlSzQJEARiGiyQ/168s.jpg", "caption": "Brunch buffet"}]}}, {"review": {"des": "I would visit Chicago again JUST to eat here. It was the best buffet I have been to in recent memory, even better than those big glamorous Vegas buffets. What great service by the waitstaff, what great seating for our big party of 12 people. <br><br>AND THE FOOD - OH TO DIE FOR. So many choices, you can nibble on everything and end up stuffed. The dessert bar will make kids' eyes pop out (and those who are kids at heart too). The fresh seafood. The waffle bar. The savory and sweet. Everything made my mouth water. <br><br>And the decor inside was just classy, like old Chicago classy. Love it and will be back.", "pics": null}}, {"review": {"des": "I always heard about how great & fresh the seafood was. I had to experience it for myself. <br><br>Ambiance: The decor isn't as modern as I would like but it is very traditional. Walking in most of the crowd skewed older but it wasn't dated. <br><br>Staff was very accommodating and willing to come up with options for a member of our group with dietary restrictions. They answered all of our questions, didn't rush us and were polite. Great service.<br><br>Food was as good as I imagined. The sea food platter was a thing of beauty great for a group of 6. I loved the Surf and turf because the lobster tail was cooked perfectly with the fillet mignon was juicy. The food was incredible.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/UlvCT-mR4T7w5_3OUan8pg/348s.jpg", "caption": "That Seafood platter was so big and comfortably fed 6 people"}]}}, {"review": {"des": "This is probably one of my favorite seafood restaurants. The lobster and crab were so fresh. They butterflied the crab legs so it was a lot easier to eat.", "pics": null}}]}