{"name": "shedd-aquarium-chicago", "reviews": [{"review": {"des": "My mom told me I've been to the Shedd Aquarium before.  Well, that was ages ago, and my most recent visit felt like it was my first! <br><br>Going by myself, I thought I would breeze through the whole thing.  I was here three hours because there's so much cool stuff to look at!  There are exhibits about the underwater creatures from different parts of the world. I was kind of surprised one was of fish from the Great Lakes...boring!  Of course, being from the Midwest, I've seen plenty of walleye lol. You can also pet the sting rays, and see a fun show at the Oceanarium. <br><br>If you're hungry, they do have a cafeteria where you can get burgers and sandwiches.  I got a barbecue chicken flatbread, which was really good, but of course it was a little overpriced for what you're getting.", "pics": null}}, {"review": {"des": "My feeling after leaving was meh.  <br><br>Now I should state we went without kids.  So again, if it's with kids it may be much better.   It was busy which wasn't an issue but walking but tiny pools of water where fish live was sad.  Felt like the area where these animals live was too small.  <br><br>4D shark video was cool but extremely short.  Belugas and Dolphins were the best part.", "pics": null}}, {"review": {"des": "One of the best experiences ever! <br>A must see and must visit! <br><br>Wild reef and a dolphin show were just amazing!", "pics": null}}, {"review": {"des": "My wife and I had a really amazing time here. There is just so much to do that it's very easy to lose track of time.  We ended up cling around 4130 or so.  This didn't leave us a lot of time at all. It was very disappointing that they don't reduce the price near closing and that local residents get in for free.  The entire aquarium is beyond well maintained and it is quite stunning. You find tons and tons of tanks with all kinds of fish and creatures inside.  We spent a lot of time here and really enjoyed it.  One of the 2 reasons they lost a star was because in one of the rooms they sell you pics they took of you.  The entire time they kept yelling things like \"PHOTOS GET YOUR PHOTOS!\"  It was driving us nuts and we got tired of that room really quick. <br><br>The best part of the whole area is the large tanks area.  They have Baluga whales!  This was amazing because they had quite a few.  I had never seen one that close before!   They also have ottors, dolphins, and rays you can pet.  The only other issue I had was they for some odd reason they chose to clean the whale tanks about 24 minutes before closing.  This bummed us out. We wanted to see then up in the big tanks.", "pics": null}}, {"review": {"des": "Whoa. Definitely a place for kids and we weren't feeling it. Thankfully we had the City Pass Chicago and this was included. <br><br>Lots of stuff for the little ones to enjoy we spent maybe an hour here before moving onto the next part of our tourist adventure. Probably a regular spot for field trips so if that's your thing, this is the place for you.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Q4LuMzZNFqdSkI8MJ2jISw/348s.jpg", "caption": "Beluga whales - pretty cool actually."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/cfMeUdkTxTCPz_DZFALC2g/168s.jpg", "caption": "Penguins in Chicago"}]}}, {"review": {"des": "Aside from Monteray Bay, This is absolutely one of my favorite Aquariums ever!!!!!!!! I spent a good 2-3 hours here. well worth the visit and revisit. It is a very interactive Aquarium. We were able to watch and touch dolphins and the white whale. There is two touch tanks which is nice. The fishes range in different areas of the world.  It is great for family, kids, and individuals. Arrange your day early so that you can schedule in the shows with the lake/ocean view. and the short films that they offer.", "pics": null}}, {"review": {"des": "The best thing about this place is the location and the beautiful building.  <br><br>Prices are high for admission, the entire place is WAY to crowded, and it's quite small considering what you are paying for.  <br><br>This place is located right on the water - so walking there is a really fun, beautiful walk.  And the building as you approach is very impressive.  The lobby with it's beautifully detailed ceiling and light fixtures really is a sight to be seen.  <br><br>We came here on a Sunday - so maybe that's why it was overcrowded?  But the line we waited in outside was not expected and took at least 20 minutes to get through.  We were here on a particularly cold day in May - and it's difficult to wait outside in the cold and rain with kids - so maybe that set the tone for our entire day?<br><br>For me, my experience became more underwhelming from that point forward.  I did enjoy watching the Oceanarium where you can see beluga whales.  The beluga's and the penguins were the highlight for me.  Aside from that, I left this place feeling a tad bit disappointed.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/rIqxZxGn2E_1GmZfW4hl7g/348s.jpg", "caption": "Beautiful lobby"}]}}, {"review": {"des": "A true Chicago gem.  The staff are delightful and of course the exhibits are beautiful and engaging. From the smallest fish to the beluga whales, there's definitely something for everyone to enjoy . Dolphins show very entertaining and kids loved is a place for the entire family", "pics": null}}, {"review": {"des": "Too many people!! It needs more touch and feel play type of things for kids around age 5. <br>It was great to see all kinds of people from all over the world but it was just too crowded. <br>If you ask my 5 year old the best part of Aquarium, it was when she had a hello kitty ice cream bar on her way out.", "pics": null}}, {"review": {"des": "I'm just going to start out this review by stating: I don't have kids and I am not a fan of crowds where people have kids.<br><br>I, however, LOVE this Aquarium! A native Seattle-itte, I have been coming to Shedd on the regular since I moved to Chicago 5 years ago. I adore the volunteers, the customer service, the focus on sustainability, the focus on animal husbandry and rehabilitation, as well as the community outreach.<br><br>I highly encourage other adults who are CF or empty nesters to become Members. There are lots of after hours events to attend, volunteer opportunities of you are so inclined, and many perks (like seeing new exhibits early). Shedd also does a great job about having Illinois resident free days.  Also, a wonderful - even awe inspiring - view of Lake Michigan during the dolphin/beluga whale show. <br><br>I can't speak to the food service, but the facilities are always clean.<br><br>Even though I wish the penguin enclosure was bigger, Shedd staff does an amazing job of making sure that there are enough engagements for the animals.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/9qM_YSKpN9FtwPNOKj-kWg/168s.jpg", "caption": "Rizzo (which we learned more about at a Science Friday event)."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Bh-NCIDVrZCq_Ig_tBK8BQ/168s.jpg", "caption": "Art from Garbage - an effort in sustainability"}]}}, {"review": {"des": "The aquarium was one of the attractions in Chicago that I was most excited about, and it was part of my CityPass booklet which was especially convenient (though the expedited entry wasn't very much help or anything... I still waited in line for quite a while, comparatively, and on a Thursday morning no less). <br><br>Anyway... the building, and the location of everything by the water, is quite something. I arrived fairly early on a Thursday morning in early May and spent a bit of time outside checking out the various \"garbage sculptures\" - i.e. garbage from the ocean had been used to create sculptures of various marine animals. Really well done pieces and accompanying explanations. <br><br>Perhaps the only thing I didn't plan for? A large number of elementary school kids (multiple classes, I assume) arriving at just about the same time. Yikes! It meant having to be much more strategic about time spent in certain areas, as I was just one person trying to maneuver around a number of different groups of kids (some being rather loud, others being fairly well behaved). <br><br>The display tanks and such in the various branches of the aquarium were well designed and allowed a real sense of the habitat for each fish or other aquatic animal. <br><br>For me though, perhaps the most enjoyable space in Shedd was heading into the \"Polar Play Zone\" where they have the otters, dolphins, belugas, sea lions, and penguins. I have no shame in admitting my focus was on checking out the belugas - I LOVE belugas. Watching them swim around with their little blankets (towels?) and play in the water was a delight. I could have watched them all day. <br><br>TL;DR  Timing is everything, because otherwise you're going to probably be surrounded by kids running around and some pounding on the exhibits. The CityPass doesn't really allow for much of an expedited entry either. Things to be aware of. None the less, a very enjoyable space. Also? BELUGAS! ;)", "pics": null}}, {"review": {"des": "Kids loved the aquarium.  Beluga whales are our favorite!! Only complaint is they ran out of tickets for the beluga show. It's always going to be crowded so expect that going in. <br>Staff is pretty friendly. Many times it was hard to find someone to ask questions to though. love the layout and all the different exhibits. There is something for everyone.", "pics": null}}, {"review": {"des": "We came here on a Friday around 12:30pm<br><br>The good: My fiance got a military discount so he got in for free so therefore paying $40 for just one of us didn't seem as bad <br><br>The penguin, Amazon, shark and belugas exhibit were cool. We also  got to touch some fish.<br><br>The bad:<br>Local residents were in for free that day so it was super packed and it took so us 30 minutes just to get to tickets!  Suggestion to venue: Have more cashiers if you know you're expecting more people than usual.<br><br>Also, there were sooo many strollers it was like being in traffic during rush hour.<br><br>Advise to parents: If your kid is young enough to be in a stroller he/she ain't going to remember their visit...just save your money.<br><br>When you go in, they have a small sign with the events for the day. We planned to see the beluga whale show at 2pm. The sign or the employees do not do a good job at letting you know that you must scan your tickets downstairs to reserve sitting.  We went by the sitting area many times and employees just told us to come back at 2, they never once said you need to scan your tickets to get seats for the show. <br><br>So by the time we found out, the 2pm show was sold out.<br><br>This happened to other people as well and it ruined the whole experience.<br><br>Advise to venue: Put the kiosks next to the sign at the entrance or have people at the register inform visitors they must scan their tickets at the kiosks.<br><br>So please, scan your tickets downstairs if you're planning to watch a show.<br><br>Final Verdict: This is overpriced, unorganized and filled with strollers. Not coming back.", "pics": null}}, {"review": {"des": "You definitely shouldn't miss this National Historic Landmark. Located on the shores of Lake Michigan, Shedd Aquarium is placed on the Museum Campus Chicago, which it shares with the Adler Planetarium and the Field Museum of Natural History. The Aquarium brings you eye-to-eye with so many aquatic animals - from whales to snails, tarantulas to turtles, angelfish to zebra sharks! Such a great time with every visit. Their exhibits and shows are truly wonderful.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/-xLHdjStyhGsTI79JvJt0A/348s.jpg", "caption": "Underwater Beauty Exhibit."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/EOi4rPCrxaycoe8VbU1BNA/168s.jpg", "caption": "Underwater Beauty Exhibit."}]}}, {"review": {"des": "Pretty cool aquarium. We only had about an hour to spend here and I wish we had longer, so I'll be back next time I'm in town. <br><br>We used our Citypass to get in, otherwise it would have been $40 for an adult ticket and I believe an extra price for the 4D movie which was included in our Citypass. It was only a 15 minute movie but was fun - we got sprayed with water and the seats shook.<br><br>Next time I'd do that (free, I think) dolphin show too but we were able to see them as well as the penguins and the sea otters, which were super cute. Your ticket is good all day too so you can leave and come back if you like. <br><br>Great aquarium and nicer/bigger than the ones we have in Michigan, too.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/wCVjATFmMbxxR6b-wfD3EA/348s.jpg", "caption": "Starfish that you can pet"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/jaRJemAn18RkX3a0hlMFOw/168s.jpg", "caption": "Dolphins"}]}}, {"review": {"des": "The Shedd is conveniently located next to the Adler Planetarium and the Field Museum. The coolest part of the experience is the Dolphin Show, where a seal and penguins also make an appearance. We saw a scuba diver in the main fish tank during feeding time. The 4D movie was pretty cool. Lower rating because the electronic information boxes at each exhibition were unable to work due to technical difficulties. I loved knowing that the Shedd is home to rehabilitated mammals, reptiles, fish, and amphibians.<br><br>FUN FACT: There are 913 solar panels on the Shedd making the facility eco friendly. Also, #sheddthestraws sculptures were fun to take pictures of and become aware of the affect plastic has on our world.", "pics": null}}, {"review": {"des": "I love aquariums and always try to stop if there's one in the city I'm visiting.  The Shedd aquarium was definitely on my list for Chicago and was lucky enough to be included in the CityPass.  <br><br>As you walk in you are greeted by a huge coral reef display that was really beautiful.  From there you can wander in various directions to see different exhibits around the aquarium.  It was particularly interesting for me to see the cold water exhibits like the narwhals, as being from Florida we're mostly used to tropical fish.  They also had some really cool freshwater habitats around the main entrance area coming off like spokes on a wheel.  <br><br>The Shedd Aquarium is definitely worth a stop in and a great way to spend an afternoon.", "pics": null}}, {"review": {"des": "Be warned: very busy on Saturdays and smelled fishy (I know- lots of fish are present at an aquarium- nature of the beast right? Wrong. I've been to aquariums and they don't have that nauseating fish smell.) Both those items reduced the amount of enjoyment. <br><br>Overall we toured the whole aquarium in about 2.5 hours (didn't buy tickets to shows or movies), but I LOVE aquariums and my friends weren't so keen.... I could have stayed longer. <br><br>100% buy tickets online in advance to avoid standing in a really long line. As I said, kinda crowded, so I would probably not recommend going on a free day because that could be outrageous. <br><br>I probably wouldn't go again unless the volumes of people are decreased. Maybe Tuesday would be a better day", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/WZuTqpuuHXb1B0X0mw21zQ/168s.jpg", "caption": "Huge shark tank"}]}}, {"review": {"des": "I cannot believe the average is 3.5 stars! I grew up going to this museum. Still, I don't have rose-colored glasses. The $39 fee for an out-of-Chicago visitor is...intense. Apparently, the lines are crazy, though I haven't encountered those when I've gone.<br><br>The sheer amount of fascinating info you will here makes it worth it to attend! The displays are informative, if sometimes skewed to children (but that's not the worst...it's great to see children learning here!). There is a variety of fish - obviously - and it's really fun to see how many different types there are. <br><br>What's even more fun? The dolphin show! It's fascinating and fun, definitely good for all ages. The host is an excellent public speaker, no matter who it is. Watch out for the sea lion walking in front of the tank! :)", "pics": null}}, {"review": {"des": "Large facility with a ton to see! You could easily spend all day in here if you wanted. <br><br>Highlights for me were the dolphins and beluga whales. <br><br>The two downsides were the price ($40+ per adult if I remember correctly), and the lines. Get there right when it opens to get the best experience. Go straight to the free dolphin show area to get tickets. If you don't you'll get tickets for a show super late in the day (we got our tickets at 10am and the only available show was 2 or 3pm). <br><br>Active duty military get in free!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/OBZhjpTbFhIsBwjZjVeWZw/348s.jpg", "caption": "Crazy suckers"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/PRXFCSIkWKBi7d4qfgcrBQ/168s.jpg", "caption": "Just chillin"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/2pTBWDpGzTXZNo_Soh2fqg/168s.jpg", "caption": "This guys job is awesome"}]}}, {"review": {"des": "This is a very nice aquarium. There a good number of exhibits and you could spend a decent chunk of time here. I came here because I was a tourist and this is a tourist attraction around the area.<br><br>Lots of fun attractions, cool displays. There is a show that runs in the showroom with the dolphins throughout the day, it is super fun! If you come here you should plan to come to one.<br><br>They have a cafeteria here as well in case you get hungry. It has a decent selection. There is definitely something for kids however. <br><br>There can be a lot of kids running around the aquarium too. I think it is just dependent on what day you come. On the day I was here there was a field trip happening so there were a decent number of kids around. This doesn't take away from the aquarium though!<br><br>Worth coming here at least once whether you live in the city or are just visiting!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/lJplJkSR9GMoe6r0L_tw0w/348s.jpg", "caption": "More penguins"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/6cEmzgueiw3EOjC_8ajaKg/168s.jpg", "caption": "Turtle"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/kgYJv1L-HUKHjrIACDi-DQ/168s.jpg", "caption": "Penguins"}]}}, {"review": {"des": "Buy tickets ahead of time! The line is long! But you can purchase online while waiting in line, like I did. Shedd Aquarium has been in Chicago like forever, but it's well maintained and they add new attractions now and then, so it's always a fun visit. After visiting the whales and dolphins and all the usual fish displays, we had lunch in the restaurant. Windows overlooking Lake Michigan and delicious, but pricey, sandwiches. <br><br>A fun day. Highly recommend this for Chicago visitors and locals, too.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ockiHyVlwb6EzXPEV3Np1A/348s.jpg", "caption": "love the belugas at the Shedd Aquarium"}]}}, {"review": {"des": "I took my girlfriend here for her first time while on vacation to Illinois. We had bought the city pass and this was a must for us. My girlfriend said this was by far her most favorite part of the trip. The variety of animals is incredible. We loved the dolphins and the beluga whales.<br><br>Unfortunately there were a few things we didn't get to see or do because of renovations or because of the off season (like stingray bay). Besides that, everything else was great. Most of the employees are really friendly and always willing to share their knowledge of the animals and exhibits. I always love coming here, and I'll be making sure that this time isn't the last.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/jIofEXe46L_1OiowzsSpBw/348s.jpg", "caption": "Sea nightmare"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/B7jRM8uQm1_EFYoxMF-bbg/168s.jpg", "caption": "What're you lookin at?"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/wB2ZBhaJsXELkGgPV4dWTA/168s.jpg", "caption": "PENGWING!!"}]}}, {"review": {"des": "On our way in from a nearby parking lot in a light drizzle, we experienced why they call it the Windy City as we mistakenly decided to walk on the side of the street nearest the water. DO NOT WALK ON THE SIDE OF THE STREET NEAREST THE WATER. We made it two steps and our umbrella was abruptly yanked up to the heavens and ripped in half. So we power walked to the Shedd Aquarium entrance. And then we found a line that was longer than the tents set up to protect guests from the elements.<br><br>What I found out in this line is you can avoid the line madness if you have a membership (that's good at multiple places) OR if you buy tickets online beforehand. I didn't mind the thirtyish minute wait once we were under the cover of the tents, but I wouldn't want to wait without the tents or in the heat.<br><br>I've been to the Ripley's Aquarium in Tennessee and  the aquarium at Mall of America, among others, but SA is by far my favorite. It has a very interesting flow and breakup, almost in a star pattern. Sections are divided by habitats and I love that there are both individual exhibits and group exhibits.<br><br>On the lower level we found the sea otters, beluga whales, dolphins, and sea lion... and I'm almost positive the shark tank was also on the lower level. The beluga whales, dolphins, and sea lion all had a show, but only the dolphin show was limited to one viewing (you have to go get a ticket from a kiosk). The dolphin show was pretty good and you get an amazing view on to the water outside as they perform. The sea lion did his tricks and moved on, but he also came out during the dolphin show which was fun. I do wish his exhibit was bigger though and that he had a friend, but that would just have to happen over time.<br><br>While we were on the lower lower level we also found a little food court and on the lower level there is a gift shop so you have some ways to spend some money. We ended up grabbing a bite and it wasn't anything special just you're normal concession stand eats, but I didn't come for the eating experience so that didn't weigh on me too much... it'll tie you over til you find somewhere to eat afterwards.<br><br>I thought the price was reasonable especially for locals and I thought about how much fun my nieces and nephews would have here too. For two adults it was a very entertaining and informative outing, complete with literature on every exhibit... but for a kid they'd probably just be blown away by all of the different types of fish and shows they get to see.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/L5br0Z05IpAVUBb7zjwvxQ/348s.jpg", "caption": "Ooh barracuda"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/_S8ULvNfxUbe0tMAcv3ZDw/168s.jpg", "caption": "Tangled jelly"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/BF3XORy_6ckaiHEU_oz9Gw/168s.jpg", "caption": "Sea lion shows too"}]}}, {"review": {"des": "This is by far the best aquarium I have been to in the United States. I have been to enough aquariums to have seen it pretty much all, but I still saw some new things here that I have not seen anywhere. Like their Beluga Whales. I was amazed. I spent a considerable amount of time just watching them swim around and play. So many cool and colorful species. I can go on forever! <br><br>One thing I didn't like was the fact that you have to reserve way in advance to see the dolphins  above water. You can go downstairs and see the lower part of the tank, but if you want to see them jumping out<br> of the water, you have to make a reservation for the  aquatic experience and those tickets go fast. When we were there, they were gone for the day. To take full advantage, your visit has to be planned well in advance. Overall an amazing place!", "pics": null}}, {"review": {"des": "Terrific variety and lots of informatiom.  Adults enjoy it as much as kids.  Price seems a little steep, but I like that they give a price break to residents.  So many amazing things to see.", "pics": null}}, {"review": {"des": "The shed is amazing in a beautiful lake front location. <br>The variety of fish, reptiles and mammals is fantastic<br>The show tank is not to be missed. <br>Pet a sting ray<br>Touch a starfish <br>My favorite were the whales <br> Very crowded. Very expensive <br><br>$39.95 an adult. <br><br>Disappointing 4-D movies. $4.95 a person for a movie that's been on TV for years. And it's a short 10 minutes. <br><br>Like all places your trapped in, food is second rate and expensive. <br><br>But that being said, it was great", "pics": null}}, {"review": {"des": "I like fish. I like reptiles. I like animals.<br>I don't like rude-ass people. I don't like obnoxious, unattended children. You WILL deal with those here.<br>I like museums. I hate the Field Museum. I'm ok with this joint. I'd ALWAYS rather go to the Chicago Art Institute. This time, we went here. I make the best of it. <br>There's a ton of neato fish to see, and many opportunities to learn. The dolphins and whales area is the most fun, but it's all pretty interesting, as far as zoos go. <br>The 4D was much better a few years ago. They don't spray water anymore, just compressed air. Plus, the movie was CRAZY SHORT! Kind of an \"all that for nothing\" kind of experience. <br>Kind of.<br>The ocean-junk sculptures are really cool, and make you feel absolutely awful in that \"spurred to action\" kinda way.<br>Kinda.", "pics": null}}, {"review": {"des": "Wonderful day. Dolphin show top notch. Seen many in California and this is every bit as good. We were lucky enough to happen on to the beluga whale training next door to the dolphins. We spent almost 45 minutes there. The exhibits would take days to do properly but a great overview can be accomplished in a day. I will definitely go back again.", "pics": null}}, {"review": {"des": "I feel fortunate to have visited some of the most renowned aquaria in the country: New England Aquarium in Boston, Monterey Bay Aquarium in Monterey, CA, and now Shedd Aquarium in Chicago. Its expansive three levels feature a wide array of salt and freshwater creatures and plants from different regions of the world as well as those unique to the Great Lakes, such as the sturgeon. Speaking of which, one of the Shedd's main highlights is the Sturgeon Touch Pool experience. Never before had I been able to actually \"pet\" a swimming fish! <br><br>Don't forget to check out the Beluga whale tank or enjoy a 60-minute penguin encounter, where you can hold and pet these adorable animals.  The Shedd is undoubtedly one of Chicago's best attractions!", "pics": null}}, {"review": {"des": "This is by far one of better aquarium I've ever been to.<br><br>It is huge, with multiple beautiful exhibits, that have many multiple animals that I have not seen elsewhere. All of the animals appear healthy and well cared for. <br><br>The building itself is magnificent. It is from the 1930's. With many beautiful and original fixtures. Be sure to look up at the wonderful light fixtures, clocks and ceilings.<br><br>The aquarium is HUGE, so plan for an entire day and bring walking shoes.", "pics": null}}, {"review": {"des": "One of the best aquariums I've been to. Very spacious and good variety. <br><br>Highlights:<br>- Beluga whales! I've never seen them before and they were pretty amazing with their smooth white bodies.<br>- Weird creatures: some I've never seen before <br>- Big shark tank: my son loves sharks<br>- Roomy: lots of wide areas so it's not overly crowded <br>- Divided by region which was interesting<br>- Area downstairs where they showed fish by color and patterns which was artsy<br><br>Midlights:<br>- Some areas like the whales, penguins, and coral exhibits were hidden on different levels below so check the map so you don't miss anything. <br><br>Lowlights:<br>- If you don't get tickets ahead of time and print them out, you're in for a very long line. First time we tried a few years ago, we had to abort the 2 hour line and do something else. <br><br>Definitely would recommend a trip here if you're planning to be in town.", "pics": null}}, {"review": {"des": "This is still one of my favorite attractions in Chicago. I've been here twice before but it never gets old so I always make sure to include this in my itinerary whenever I visit Chicago. I just think it's a very calming place to spend the day exploring and watching all kinds of water creatures floating around. This enormous facility has hundreds if not thousands of live species on display and each aquarium has its own description of every creature. In addition to the aquariums, this attraction also has rare amphibians, adorable penguins, cute otters, and mesmerizing beluga whales and dolphins plus an immersive 4D Theater.<br><br>I prefer exploring on my own without the guided tour but they do offer amazing \"behind the scenes\" or \"interactive\" packages for extra $$. They also provide a complimentary map to help plan your visit but I strongly suggest to come early to make sure you have enough time to see everything. I had a City Pass so admission was included plus a bonus pass to one of the 4D shows.<br><br>I normally start at the Caribbean Reef which is a 360-degree display of an underwater reef community. It's fascinating and relaxing at the same time to watch all kinds of fishes, sting rays and even sharks circling around. I can sit here for hours just staring at this gigantic aquarium. The other must see exhibit is the Polar Play Zone where guests can watch the Beluga whales and dolphins swim from the bottom of the tank. This section also has the adorable penguins' display which the kids love. You can also see the Belugas and dolphins at the top including several sea lions by visiting the Abbott Oceanarium which also features the live Aquatic Show. Just make sure to reserve your spot early especially if you came with a group.<br><br>There's definitely a lot to see at this attraction and it's well maintained. The staff and security are also very helpful and professional. Highly recommend for first time visitors.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/-y8VvbmtWd6mhLwCZ7vwbg/348s.jpg", "caption": "More fishies"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/HnC7XEX-NvtcRbLhMa10zA/168s.jpg", "caption": "Fishy staring at me"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/7-F9bWSk3pt8WpctJGtjOg/168s.jpg", "caption": "View under the tank"}]}}, {"review": {"des": "Warning to the parents or anyone who prefer not to wait in super long lines, PLEASE, for the love of humanity purchase/get your tickets online before arriving. Have the tickets with you, don't choose the Will Call ticket pickup option. Full transparency that this review is from a Free day visit in mid June but I have never seen so many people in line to enter the Shedd. As we walked closer to the entrance, my wife said \"Oh, that's probably just people hanging out.\" \"No, honey I think that's the line\" I said as I clenched my printed tickets, rushing the stroller to the second set of doors that had NOBODY line. My prayers were answered once I got to the door that this was the line for guests who had tickets on hand. It was the same joy I had when I got TSA Pre-check for flying, cutting through a large group of people who oftentimes looked said, angry or miserable. <br><br>If you start with the above, your mood, your significant others mood (if applicable), your child(s) mood (if applicable), will be better as start your journey. For the museum itself, it's a nice place to visit once or with out of town guests but the exhibits and layout aren't as expansive as other aquariums like Monterrey Bay. Children will love it so if you need to take the kids somewhere for an activity the Shedd is a good place to fill that need. Lots to see but for the high price point, you don't fully get what you pay for. I'm still trying to get the free day crowd out of my mind. Maybe a cold shower will help. :)", "pics": null}}, {"review": {"des": "I avoided the Shedd for years because as a kid it terrified me. I saw Jaws 3 way too young and also paged through a Time/Life book about deep sea creatures at an inappropriately early age. While I enjoy looking at the ocean from a beach, the creatures within are more nightmarish than entertaining to me. In my childhood memory, the first thing you saw when you walked into the Shedd was a huge water tank of terrors waiting to break and wash over you with its killer contents. Last year I decided to face my fears of the dark, spooky place I remembered and was pleasantly surprised by my day. <br><br>First, the towering tank was really only in the neighborhood of eight or ten feet tall from ground level. It also wasn't sitting in the dark as I thought it was. In fact, the entire aquarium is actually pretty brightly lit. <br><br>There's a pretty diverse array of exhibits, but it was unclear what was included in our ticket (we went for the most basic option) and what wasn't. The Wild Reef was one of the cooler areas, despite being the closest to my Jaws 3-related nightmares, but my favorite bit was probably the Oceanarium. I think we may have wandered into the show area when it wasn't technically open, but there wasn't a gate or sign and no one asked us to leave. We were the only people in there on a pretty busy day, though, and we stood alone on the rail watching the dolphins do their thing in the pool. <br><br>I was excited for the polar area, but the crowds were crazy - it's a kids play zone so I think a lot of families congregate there. We couldn't get anywhere near the penguins, so I decided I didn't get an eff and waited in line with the toddlers to touch a starfish. It's still cool when you're an adult, stop giving me the side-eye, soccer mom. <br><br>Exploring the Shedd does come at a pretty high price point; for a family of four it's $150. I had a good time, but I can't see spending another $40 to visit until I have kiddos of my own that are old enough to remember and appreciate it.", "pics": null}}, {"review": {"des": "I really enjoy visiting SHEDD. There is a lot to see, and it's all not too bunched together. There are a few interactive things- touch a stingray, touch a sturgeon. They have beluga whales, sea lions, sea otters and dolphins, and do a dolphin show. They take in a lot of rescue animals as well as doing research. We enjoyed exploring and I would certainly go again!", "pics": null}}, {"review": {"des": "A little smelly but a great place to go! Lots of variety of sea life! Good presentations too!", "pics": null}}, {"review": {"des": "A nice reprieve from the cold winter that makes you feel like you're an ocean explorer. The exhibits are beautiful; great oceanic color schemes, and designed in a circular fashion so that you end up at the entrance after you've finished viewing all the exhibits. Not super large though; can't quite compare to my favorite Monterey Bay Aquarium in CA.<br><br>Free Illinois Resident Day<br>Can't complain about Illinois Free Resident Day either; if you can provide proof of residency (if you don't have an Illinois ID, a school ID or apartment lease works), entrance is free! Note of caution, if you come later in the afternoon, the museum might reach capacity, and you may have to wait 20-30 minutes for people to leave the museum before you can enter. No problem in the summer, but in the winter after arriving at 2pm, we had to stand outside for 25 minutes before we could go inside. There was probably a line of 50 people out the door.<br><br>Museum<br>When you walk up the main steps, you'll enter the main lobby. From there, you can explore Amazon rising, Oceans, Local Waters, Islands and Lakes, and Rivers. My favorite exhibit was the Pritzker Caribbean Reef, because of the 360 degree viewing of the main tank. The other exhibits are much smaller tanks with a rectangular viewing screen.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/_iQ4htKuaHwZ4buPsRrZ8A/348s.jpg", "caption": "Outside of Shedd."}]}}, {"review": {"des": "I came here while I was on bachlorette trip with my cousins and friends. The location was beautiful, it's located right by the waters. The aquarium itself is pretty big in size, did a lot of walking that day. We got to watch a show, I think they were seals/otters? Soooo cute, watching them do tricks and such. Shedd has such a wide variety of marine animals, definitely worth it.<br><br>However, the facility is quite dirty (I've been to very clean ones such as Ripley's in Toronto and Sumida in Tokyo). It's also very loud in here. There were a lot of people so we had to constantly move to ensure other people get a chance to see everything too. We came in a huge group and we just kept losing each other because there were just too many people inside at once!!! Traffic should really be regulated inside here haha.. way too many unattended children running around and screaming.<br><br>I'd love to come visit again just to gain a better experience. I want to be able to take my time and actually read the descriptions and observe the animals without crying babies and a million people pushing and shoving for photos.", "pics": null}}, {"review": {"des": "One of the most amazing sites to see in Chicago! Prepare for at least $25 to park or valet. The membership fee is relatively cheap considering you get quicker access and discounts for the attractions, you can also add other family members, like the grandparents if they want to take the kids on their own. We saw the 10:30am Land & Water show and were super impressed how they integrated a massive video screen behind the exhibit to help with some of the educational parts of the show. My 3yo was loving the 20ft dolphin jumps and a surprise up close walk through of a sea lion. The shedd also has a play zone downstairs for kids that consumed at least 10 mins of attention span! We have a full membership now and plan to return often. Once the weather gets nicer we will probably take the redline to Roosevelt and take the 20 min walk over to the aquarium.", "pics": null}}, {"review": {"des": "Smaller, but fun, aquarium to visit. We managed to catch most of the major shows/exhibits in a good amount of time including the dolphin/whale show, the reef feeding and a diver in the shark tank.<br><br>Solid array of aquatic animals from every part of the globe with a solid emphasis on African, Amazon and Marine reef-dwellers. <br><br>Besides the aforementioned mammals they also had sea lions and otters which are always fun to see as the cavort in their homes. <br><br>Admission is a bit high and if we had known we could bundle this with our trips to the other museums we would have done this to make it more economical.", "pics": null}}, {"review": {"des": "THIS AQUARIUM RULES!!!!<br><br>Hands down one of the best aquariums I've ever been to. They have BELUGA WHALES & SEAHORSES & GIANT CRABS! Seriously, it's the best. It's a little pricey but for the BEST aquarium, it's totally worth it. <br><br>They have shows all day and you can literally spend HOURS in this place. It was hard to see everything in just two hours. There weren't too many people there on a Friday morning (moderately busy) but I can see this place being NUTS on a weekend. <br><br>If you're in Chicago and you love sea life, definitely make this a stop on your trip. It's also right by the lake so it's the perfect spot for photos!", "pics": null}}, {"review": {"des": "I went to the Shedd Aquarium with my family this last Labor Day Weekend (not as crazy busy as I anticipated) as a quick family vacation to Chicago. My family loves the ocean and we love aquariums and this one is in a beautiful spot right on Lake Michigan.<br><br>Price point alone might scare some people away. It can be spendy especially if you are out of state and have a large family. I would suggest looking into getting a city pass for Chicago to help mitigate the cost. You can easily spend the whole day her though so you can definitely get your money's worth here. <br><br>There is a lot to see and do here. I especially like the Amazon River exhibit and the Beluga Whale and Dolphin Exhibit. The Amazon River exhibit is home to some very large river fish, it is amazing when you stand right next to them to see how large these fish can get. And people swim in that river all the time! <br><br>The Beluga Whale and Dolphin exhibit is very unique because you can go tank-side and see the whales swim by while sitting at a cafe booth. It is really neat to get some popcorn or something and just watch the whales swim by.<br><br>There is quite the diversity of species at this aquarium from all over the world. I have seen some things here that I have never or rarely see at other aquariums ( I especially like to watch the giant king crabs). <br><br>The style of the aquarium is also very unique. Neolithic with its beautiful rotunda, columns, and brass fixtures give way to a more modern backside with state of the art exhibits. Finally, on nice days there is a large stingray petting tank out back that overlooks the lake.<br><br>*Nice tip for photo enthusiasts. Go out onto the outside deck by the cafeteria area. There is a great photo opportunity of the whole city overlooking the lake from that vantage point.", "pics": null}}, {"review": {"des": "Really the only reason I am giving it 5 stars is because of the dolphin, beluga whales and the building itself are absolutely wonderful. Architecturally (like everything else in Chicago...) it is one of the more impressive buildings that House a museum. The aquatic show theater (where the pacific dolphins are located) opens up to a beautiful shot of the Chicago skyline after the show is over. <br><br>Now the negative - literally if you don't show up by 9am, you will wait in line. Even on a Monday. Even if you purchased advanced tickets. I suggest you go with someone who is a member or a Chicago resident and have them buy your tickets, they are 50% off of you are a resident but you must show a photo ID. Be prepared to spend around $42/per person (non-resident) with taxes included which includes the shows BUT it is insanely crowded in the summer and when I say insanely crowded, I don't mean there are a lot of people. Like as in the entire city of Chicago likes to go all summer long and they get \"free days\" too which means the entire city gets in free on specific days during the summer, so be prepared for what I mean - insanity! <br><br>Is it worth it to say you came and check it out? Yes..<br><br>Is it $90 worth it for 2 people? I would say ehhh, that depends on how much you love animals. <br><br>I probably wouldn't spend $90 for 2 people to come back but I am happy I experienced it. <br><br>Overall - I was just super disappointed with the size of the crowds, even though we went on a Monday at opening time. I guess a better way to describe it is being underwhelming. Maybe it was just too hyped up for me!", "pics": null}}, {"review": {"des": "By far one of the coolest places around. Whenever I come to Chicago, I *always* make time for a trip here regardless of how long I'm in town.  This was literally my first place I went to after getting into town.  <br><br>For starters, the line to get into the Aquarium is tremendous regardless of when you go.  I strongly recommend getting a citypass, as the line for that is like literally 5 minutes. If you stand in line to purchase them, your going to wait at least 45 minutes or more. No joke.<br><br>After you get through the ticketing, you get to see all sorts of things.  Fish, sharks and tons of cool displays.  The Beluga whale exhibit is cool, and I got to snag a picture of one that came up to me.  Also, I got a free movie for using citypass, which was nice. If your purchasing it at the counter, I would say save your money for something else.<br><br>Definately a must see for anyone coming into town. Worth it all the way!", "pics": null}}, {"review": {"des": "Wow, this place is amazing. It's gorgeous and very well kept. I love checking out local aquariums when visiting new cities (esp bc I have children) and this place did not disappoint. I do recommend getting the city pass though, as it gives you additional perks (like shows), and price is reasonable if you add all items it includes together.", "pics": null}}, {"review": {"des": "We love visiting the Shedd, it's a beautiful aquarium with so many exhibits. Jazzin at the Shedd on Wednesday nights is a good time.", "pics": null}}, {"review": {"des": "The otters and whales were cool to see, but the other exhibits were nothing special. Unfortunately there was also a lot of very loud kids/field trips when we went. It's a decent aquarium, but nothing compared to Seattle or Toronto aquariums. Very geared towards keeping kids entertained-movies, stingray petting, etc. <br><br>Wish we hadn't made this stop a priority on our day trip of Chicago, but it was ok.<br><br>We were able to skip what looked like a 3 hour line (it was free admission for IL residents) because we had our city pass.", "pics": null}}, {"review": {"des": "FIRST aquarium i ever been to that had Dolphins & whales!! This aquarium was different than the ones im use to in the Bay Area.. they had more exotic sea creatures! I LOVE Sharks & they had a HammerHead!! They also had a 3D shark film you can watch. It was pretty cool, the seats vibrated & water sprayed out at you.. its a pretty big aquarium! Definitely will go back if im ever in Chicago again..", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/gkSiUtV-BwQhehmSBREGRQ/168s.jpg", "caption": "Huge crab!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/H0KllRGd28C_MLBbNO4krQ/168s.jpg", "caption": "Extra butter please!"}]}}, {"review": {"des": "This is my favorite of the Chicago museums. It always has been, and I have no idea why. Pro-tip: if you use EBT/WIC admission is FREE any day of the week. <br><br>The main floor is moderately interesting. It's full of creatures from the Amazon (including a bunch of frogs and a massive 14 foot anaconda), a giant circular tank with a whole colorful fish plus sharks and stringrays, and a bunch of specimens from the United States and the Great Lakes. I found the invasive species exhibit particularly interesting, and I know now that lampreys are the stuff that nightmares are made of. <br><br>The bottom level is where it gets more fun. This is where penguins, beluga whales, otters, dolphins, and a special exhibit of frogs live. There's dolphin shows every few hours, and there's a few playgrounds and fun things for kids to do too. The volunteers/workers in the frog exhibit (shout out to my girl Nancy!) are super well educated about all the species, and are happy to lead you around the exhibit and talk to you about the different animals. <br><br>I was also happy to see that my alma mater worked on part of the exhibit. Good job Salukis!<br><br>I am always happy to spend a day here. It's a great place for kids, and if you're from Chicago it's just as fun in adulthood as you remember. <br><br>The only real downside is that it looks a bit outdated in some places. There's chipped glass and paint that's peeling off. It could use a face lift.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/C-JrhfWBqxp_RWDrfzfwLQ/348s.jpg", "caption": "Front"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/GuhKgcYBZEgUUF7NU7uT0g/168s.jpg", "caption": "Amazon"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/GuREDXypk3tC7FM6gZLHtg/168s.jpg", "caption": "Belugas"}]}}, {"review": {"des": "Worth every penny. It is a little pricey, but so is upkeeping rare animals at a sweet a$$ aquarium. Anyways, Go early and stay late, there is so much to see. The front will tell you it takes about 2.5 hours to go through it all, but I would eat an early lunch and then spend the rest of the day here! This is a great family area full of museums. It is called museum campus for a reason people! So much art, wonder, and info is such close proximity. If you are wanting to experience multiple of these locations get the Chicago City Pass online, it gets you in at a discounted rate to all the big spots. <br><br>Really clean and high quality. This is one of my favorite aquariums to date! I even pet a really long weird looking fish.", "pics": null}}, {"review": {"des": "This aquarium is so cool! I have never seen a blue lobster before and it's so beautiful along with the other beautiful sea creatures.<br><br>If you are visiting Chicago for the first time and for a couple days, I definitely recommend getting a City Pass. This pass definitely saves us extra money and time so we can explore all the tourist attractions. Definitely don't have to wait in a long line either.<br><br>Spent over 2 hours exploring and learning and seeing all kinds of exhibit for all the species. It can get a bit crowded over the weekend, so it is best to go early and give time to venture out.<br><br>Definitely will come back when I get a chance to visit Chicago again.", "pics": null}}, {"review": {"des": "What an absolutely amazing facility! Words falls short for me to express what a magical aquarium this is, if every child was brought here and experienced the magic of our oceans we would not have the pollution problems that face our marine environments. I love that everywhere you go there is an educational component to the exhibits. <br><br>I was beyond awestricken by the \"Wild Reef\" exhibit. I wanted to lay on the floor and just be enveloped by the aquariums around me. I don't live in Chicago but if I did, I would lobby for the Aquarium to do yoga sessions in the reef room. So magical!!!!", "pics": null}}, {"review": {"des": "The Shedd is poorly equipped to handle amusement park-level crowds, with cramped corridors and exhibit areas, expensive ticketing options, and a questionable overall value.  If you've been to the Lincoln Park Zoo, it's the same crowds.  Wayward kids bouncing all over the place, tired parents trying to reign in their children, screaming babies, and confused people actually trying to see something through smallish exhibit windows in the fish area or the labyrinth of the rest of the place.  Corridors and the exhibit areas back by the Oceanarium & underwater viewing areas are poorly ventilated and claustrophobic from all the people crammed together.  The stairs leading to the Regenstein Sea Otter Trail are borderline dangerous since there are massive crowds negotiating the stairs.  There's no easy way to get from that area to the anemone, penguins, and underwater viewing without going back up the stairs and walking around the Oceanarium.  OK...you get it--crazy crowds and strangely planned.  I gave up and left after an hour.<br><br>Don't bitch about the prices being super high.  Judging from the 400 feet of people waiting to get, they aren't hurting for admissions, so whining about it isn't worth it and neither is visiting this place on weekends.", "pics": null}}, {"review": {"des": "$40/pp adult is pretty expensive to visit for a family. If you are a resident you pay $20. <br><br>We went when it opens at 9am. Purchased the tickets online to skip the wait. Well worth it. There is a special stroller line that is significantly shorter that is around the corner.<br><br>The aquarium is very stroller friendly. There's only about three floors. But gets super crowded around noon. Everything gets harder to see. when u get in reserve your spot for the dolphin show. It's gets harder to get tickets later. It's first come first serve for seats so don't show up late. Takes about 3-4 hours to see everything pending how your kid is.<br><br>Great aquarium, but if it wasn't so crowded and expensive.", "pics": null}}, {"review": {"des": "I LOVED this place. It was great. The staff is super friendly and they take the best photos! They had a very wide range of sea animals here as well as different floors and activities. If I was in Chicago again I would love to visit again.", "pics": null}}, {"review": {"des": "One of my favorite Chicago attractions! Since moving to Wisconsin it had been a solid 8+ years since I've been to the Shedd, and I have to admit I was impressed with how they are maintaining/improving their facilities and exhibits. The most noticeable being the dolphin show. We ended up purchasing a family membership as it was cheaper than paying for everyone individually. We started out at the Caribbean reef to of course see the beloved sea turtle Nickel who was found injured, hit by a boat with a Nickel in its stomach. We had timed it to see the diver swim inside the tank to feed the fish and listen to an informative talk on the reef. The rest of our day consisted of the dolphin show, petting star fish, seeing sharks & shark eggs (super cool), the Amazon, and so much more. The kids loved it and couldn't wait to share stories in the car on the way home.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ejarcTj2ZU_Z5GCVV5z7og/348s.jpg", "caption": "Shark selfie"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/aE87WEksK1MS_cAmMVvSXQ/168s.jpg", "caption": "Shark Eggs!"}]}}, {"review": {"des": "You have to go at least once right?  And if you do go, you might as well go when they are open to IL residents for free.  So, I did just that.<br><br>This place was packed with crazed kids and parents who were just happy to not have to deal with them for a couple of hours.  Great for them, irritating as all hell for me.  It was free though.  The animals are pretty neat and the Shedd does a great job with spacing them out in really interesting and informative themes.  My highlight was the otters, cute little buggers.<br><br>They have an area where you can get food, good handicap access, and restrooms are plentiful.", "pics": null}}, {"review": {"des": "Very disappointing that Jazz'n at the Shedd is No longer a 21+ and older event<br> With all the alcohol flowing throughout the museum it should remain for adults only. Kid's and strollers were everywhere. The origzation that put this event together need to reconsider having it as a family friendly environment. They have all day to attend the museum and exhibit's kid's should not be in a after hour event with alcohol", "pics": null}}, {"review": {"des": "So I will say this experience reminded me of why it's SO hard to  live in a big city like Chicago... first things first: <br><br>Parking: so it was freezing cold and the parking garage was $25 for 4 hours, and valet was $26 - common sense: get valet because what's $1!?!?! However, we went on at Saturday around 1pm and valet was completely full... so we park at the lot which is about a mile walk to the aquarium... <br><br>Stroller: Here in Indiana most museums have a place where you can rent strollers, not so here! We left our stroller in Indy, completely our fault but it was good to know that ya can't rent one here :(<br><br>Price: if you live outside of the city it's $40/person!!!! My goodness - thanks GOD our little one is under 3 so she got in for free, otherwise another $25... blah! <br><br>Lockers: I was thankful for the $1 locker that can hold coats and other items! <br><br>Kids Play: so as we were going thru the museum we saw that there was kids play area! It was SO awesome!! There was SO much for kids to do - this is where we spent the most time... including where we ate lunch (right next to the Dolphin aquarium)<br><br>Food: so my chilli cheese hot dog was $5.75 - eek! But it was actually good! We got the little one PB&J and fruit - $7 bucks! And we brought our own water!<br><br>So I must admit - it was worth the price we spent! Next time, we will plan a lot better! Will we go back? Yup!", "pics": null}}, {"review": {"des": "A great selection of marine mammals and creatures.  Plenty of shows for families of all ages.  But most of all, this is the go to place for beluga whales!  As an aquarium \"enthusiast\", I've been to most of the aquariums in the states and Asia.  I can assure you that this is definitely one of the top five in the country.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/zyunAGVLZ78LjvzzjZdOFg/348s.jpg", "caption": "Poison dart frog"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/kL_jx9oqs093DXf3Gi71ng/168s.jpg", "caption": "Tiger salamander"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/UL7p5j_dJhU0w9grZkRaTA/168s.jpg", "caption": "Toad"}]}}, {"review": {"des": "This aquarium is amazing!  We had so much fun exploring the exhibits and learning more about our favorite underwater creatures.", "pics": null}}, {"review": {"des": "My rule of thumb is that you can't go into an aquarium comparing it to another one. (As a lover of the Baltimore aquarium, this is extremely hard to do).<br><br>One its own, the Shedd aquarium is pretty freaking amazing. I recommend getting the CityPass as the tickets and add-ons can get expensive but the pass is all inclusive. I got here right when it opened (actually, right before and I just walked around and took in the amazing scenery surrounding it.) after reading reviews that wait times here can be insane.<br><br>The aquarium is divided by habitats and there are extensive exhibits within each of them. My absolute favorite is the coral reef as well as the penguins and beluga whales. There is lots to see and you can easily spend about 2 hours here if you really take your time to look at everything.<br><br>The otters and the belugas can be seen above ground and you can also go down where the penguins are and see them swimming around below surface level. Very cool.<br><br>Not the biggest aquarium out there but there are still many exhibits and lots to read up on if you want to be well educated by the time you leave.", "pics": null}}, {"review": {"des": "Very nice place, a lot to see and plenty of places to go, nice cafe with food and coffee and tea. Very disappointed on the price to park.. 25.00 plus 40.00 a person to get in. Be prepared to walk in the weather to get into the door.", "pics": null}}, {"review": {"des": "Your trip to the Shedd is best enjoyed if you become a member (tax deduction!) or visit on one of the many Illinois resident free days (especially if the kids are in school).<br><br>The Shedd is smaller than other aquariums that I've been to, but that doesn't dampen the experience. I appreciate not being completely overwhelmed, and being able to tackle most of what the aquarium has to offer.<br><br>There are 4-D shows that are approximately 15 minutes long, and a fun time for kids and adults alike. The aquatic shows are an enjoyable showcase of the dolphins, penguins, and whatever other animals they're showcasing for the season. It's nice that they are engaging the audience with an interactive game show before the official start of the show.<br><br>If you get hungry, be sure to bring your food outside the cafe as there is beautiful scenery of the city, plus thats where Jazzin' at the Shedd is held.<br><br>I appreciate that everything seems well maintained by the staff and volunteers (no small feat!) and I especially love spending my time with the saltwater exhibits. So many colorful and beautiful corals and fish to gaze at.<br><br>Visiting the Shedd is all about planning and avoiding the lines. I was a member, and it was well worth it. You skip the lines, get access to Jazzin' at the Shedd, money goes to maintenance of the aquarium, and it's a tax write off. Many more reasons, but those are some of the top ones!<br><br>The Shedd is located right off the lake, so there are some great photo ops abound inside and out.", "pics": null}}, {"review": {"des": "Haven't been to the Aquarium in a really long time so while visiting Chicago on a rainy day I decided to go. I love that they offer lockers so you don't have to carry around all your stuff and they were only $1. Overall the aquarium was pretty cool however $40 pp is pretty high for a few attractions.", "pics": null}}, {"review": {"des": "This aquarium is one of my favorites beside the Baltimore Aquarium. The architecture of the Shedd is beautiful, the location is right on the water, the museum is easy to get to by car, cab, bus, and the South Shore line (there's a stop just a quick 2-minute walk away). <br><br>The security people were unfriendly and humorless; I had my full suitcase because I visited right before going to the airport, so it wasn't the most positive experience but luckily it was a brief and terse interaction.<br><br>The line to purchase tickets was long and windy but well organized and moved fast with competent yet highly scripted employees. There's a separate area off to the side for membership purchases. <br><br>There are lockers large enough to fill a small carry-on suitcase. I was very impressed! And it cost only a $1 rental fee for the whole day (no in/out privileges, though).<br><br>No one checked or scanned my ticket, but I was waved in by an employee loosely monitoring the entrance. <br><br>The museum itself is full of beautiful exhibits, with logical transitions and excellent hands-on displays to entertain one's sense of touch, sight, and sound. <br><br>There are a million kids even during non-spring break days. I went on a Tuesday. You just have to deal with wild screaming, inattentive parenting, and a tough time getting the closest views at certain exhibits. Luckily, the kids' attention spans are so finite, you're eventually able to get a good view of the exhibits.<br><br>There are plenty of cafes and shops to get the standard fare, but some of the food options I was impressed by--such as Mediterranean flatbreads! The views from the dining area are phenomenal. Great for people-watching outside. <br><br>Overall, an excellent aquarium! You are allowed to return if you want to exit, so in/out privileges are given for admission. I would definitely come back and spend much more time than I did.", "pics": null}}, {"review": {"des": "I recently purchased a membership here so I can take my nieces and nephews whenever they want.  It's a beautiful place to visit for both adults and children.  The penguin play area is a hit for younger children, and the oceanarium is our favorite spot.  They also have a petting area for starfish as well as sting rays.  (Stingrays seasonal)  Didn't have time to check out any shows last time, there was too much to do and see!  <br>-Tip:  weekends get pretty busy and crowded so I prefer to go during the weekdays after 2 p.m.- it tends to be much less congested.  <br>- I never have problems finding metered parking out front on weekdays, (weekends a bit tough, but still possible if you drive in circles a few times).", "pics": null}}, {"review": {"des": "One of the nicest aquariums I've ever visited! However, I had to take a star off for a few reasons. First, it's unbelievably expensive just to get in, here. $40 a person is steep, in my opinion. If you park at the aquarium you're out $26, too. Second, while some food options were relatively fair, paying $24 for a frozen pizza is robbery in my opinion. Lastly, the two people I visited the aquarium with both ate meat products for lunch (pulled pork and hamburger) and were both having digestive issues for 24 hours after. I'm a vegetarian and ordered veggie nachos and did not experience any digestive issues. So, be warned!<br><br>The building itself is truly incredible. Take a moment to enjoy the architecture. Lots of little things here and there if you look up and around. <br><br>The displays are all nicely organized with lots of information. I loved the touch screen pads by each tank so you can scroll thru to find out more about each fish. A few of my favorite areas included the Amazon section. It had impressive displays! I also adored the beluga whale area. They are stunning creatures. Lastly I really enjoyed the amphibian section. They have very interesting specimens I've never seen. A staff member, Claudia was very friendly and full of information. Very engaging and really added to the enjoyment. <br><br>If you can get past the sticker shock it is definitely a wonderful way to spend a few hours!<br><br>Pro tip- Chicago residents receive a discount and only pay $20 to get in! You must show ID, so any out of staters- don't be sneaky! ;)", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/SoPeVXuF70N7pjBMpHxYzQ/348s.jpg", "caption": "View outside the aquarium"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/jqieuYMDsq11ilvh-tEoFw/168s.jpg", "caption": "View outside the aquarium"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/KZ8CWlVCZAzOlTgLbsYfAw/168s.jpg", "caption": "Shedd Aquarium"}]}}, {"review": {"des": "I was in Chicago for lollapalooza this weekend, and decided to spend a few hours yesterday checking out the aquarium before going to the music festival. I loved the location of this aquarium, it was conveniently located in downtown, was next to Grant Park, and had very nice views of the Lake. The reef exhibits were absolutely beautiful!! I also really enjoyed the Pacific Northwest portion that had the belugas, penguins, intertidal species and otters. I had lunch at the restaurant in this area and it was decently priced and very good. The admission was a bit pricey, but I think worth it. Also, their gift shop was BEAUTIFUL. Definitely worth visiting", "pics": null}}, {"review": {"des": "If you want to eat pizza and watch beluga whales at the same time - this is the perfect place for you. The Shedd nowadays feels like a giant food court. Everywhere you turn, there are food carts, kiosks, cafes - and gift shops galore.<br><br>I guess that's America for you - you can't have an enriching experience with out stuffing your face with fatty/sugary processed food, or buying stuff that's largely disposable. How can we preserve marine habitats and life if we are only committed to selling disposable plastic toys everywhere you turn in an aquarium?<br><br>You could probably have a similar experience just going to a restaurant with a fish tank or a Rainforest Cafe and save the price of admission - which is $39.99 for each adult who doesn't live in Chicago.<br><br>All of these changes to the aquarium are probably designed with families in mind, and there is still some stuff to enjoy for families. But with the prices, I wouldn't recommend to most families of four who are visiting that they shell out so much for admissions given what its become.", "pics": null}}, {"review": {"des": "Have you ever spent several continuous minutes contemplating the blowhole of a Beluga Whale? The blowhole is padded and valve-like and very possibly pink and it made me deeply uncomfortable and fascinated. I recommend the experience.<br><br>I also enjoyed meeting the lookdown fish in the main tank, who look lost and confused and fabulous in their shiny holographic skins. They flitted around in pairs or groups of three but seemed to have no idea where they were going. The stingrays were another unparalleled joy to behold. One eagerly showed me its belly-mouth-bottom side as I stood over it. I, a 3D human, contemplated what it must be like to have only two sides. There was also a lone sea lion, with its face turned shamefully away from visitors. A sign described his guilty exploits- eating endangered fish off some West Coast beach. I'm glad they've detained this dangerous criminal to Shedd.<br><br>None of the fish ate each other while I was there, nor did any die. They are suspended in peaceful coexistence, for some reason. I wonder what they put in the water.", "pics": null}}, {"review": {"des": "Had not been to the John G. Shedd aquarium in many, many years and was very impressed with the current set up, exhibits and overall content.<br><br>It was a bit pricey at $39.95 for an adult but if you get one of those City Cards if you happen to be going to numerous museums you'll save about 25 to 30%.<br><br>The entrance lines were very long and slow. When we got inside, we had kids with us so we went into the accessible entrance on the south west side of the building, there were only three people at the desk when there were six computer screens/registers. They really need to man this place a little more fully, especially in the summer.<br><br>Our favorite exhibits were the Wild Reef, Polar Play Zone and underwater viewing, Amazon Rising, Amphibians and the Otter Zone.<br><br>We were too late to do the Stingray Touch or the 4-D Experiences. <br><br>It was nice that they were open until 6 PM on Sunday. We would highly recommend getting here by noon or one at the latest if you want to see most of the exhibits.<br><br>The one really strange thing they need to work on is that although the dolphin show is included, you have to get separate tickets at a little stand over by the café. They say it is to control the number of people seating in the amphitheater. They ought to just ask you if you want to go to the dolphin show when you are coming in and then just print out a ticket for you. It makes no sense what they do now because half the people don't know they need tickets, get to the front entrance of the show and are turned away because they don't have the tickets they didn't know they needed!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Ewf5hWlQ7tXFGo34IQTXqA/348s.jpg", "caption": "Map of the exhibits. They were out of paper maps!"}]}}, {"review": {"des": "I asked my youngest where she wanted to go in Chicago and she chose here. And Walgreen's employees get in free with their check stub! Score! It was still over $60.00 for my hubby and daughter though. It is less extremely crowded in the summer months with a lot of daycare and school groups and sometimes hard to get up to the exhibits. They have Beluga whales that are really neat to watch. They think they are getting treats so they kept making noises and poking their head out the water at the observation area. They also have a free show but we weren't able to stay to watch. There are sea lions and dolphins too. There are many exhibits where you can touch the sea life but again they were jammed packed with kids. They do have a cafeteria but it's on the pricey end. Outside there is a hotdog stand where you can get hotdogs for under $5.00. I still like this place and hands down if you have younger kids, they will love it!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/lwxSPV9ut64HSLAwvCY5ZQ/348s.jpg", "caption": "Made out of recycled materials"}]}}, {"review": {"des": "I would give it a 3.5 if I could. Place is pretty nice inside. It's a little small. We finished in about 30 mins. Wish there was more to see. They did have fishes that I've never seen before which made it interesting for me. Overall, it wasn't too bad. It's not worth $40 though. It cost $40 for non residents and $20 for residents.", "pics": null}}, {"review": {"des": "Went here with our CityPASS. Our 2 year old daughter quite enjoyed the different types of \"Nemos\" everywhere. With the CityPASS you get a free 4D show and we opted for the kids show as our daughter was with us. She really enjoyed it and never really enjoys tv or movies at home. We also watched the dolphin show which was pretty neat! <br><br>I will say though that it's a pretty underwhelming aquarium and we only stayed for a couple of hours.<br><br>However the gift shop was one of our favorites from all of the museums we visited.", "pics": null}}, {"review": {"des": "Sure, the Shedd Aquarium can be full of rugrats and annoying Suburban families on the weekends, but it's still one of my fav \"museums\" in Chicago. First of all, it's humid, so it's especially nice to visit in the Winter. Check out the sea horses and sea cukes, then head into the Amazon!<br><br>Downstairs are some cutecute otters and penguins, and also the Beluga and dolphin shows (a must). Parking around here can be difficult to impossible, so grab an Uber/Lyft or enjoy a stroll there along the Lakefront.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/s17yAT2-nQu1d2DLaUe3xQ/348s.jpg", "caption": "feeding time"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Sq4n-o3ojtB2UiDxiDDNdg/168s.jpg", "caption": "Sea Horses"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/mKUuD5e81TbIZTcHdB-KxQ/168s.jpg", "caption": "buy tickets ahead of time and avoid this line"}]}}, {"review": {"des": "Coming from California i thought this place was so worth it! This place is huge compared to Long Beach... I definitely loved this place, not only my sister and I enjoyed my son loved it  great place to visit if you're not from Chicago!", "pics": null}}, {"review": {"des": "I had a really fun time visiting the aquarium this summer with my family, hence the 4 stars. However, keeping in mind the cost of maintaining the place, I really do think its easily overpriced by at least $10. They don't offer enough of a student discount or even a family package. And you pay an additional fee for the 4-D experience, which we did, and thoroughly enjoyed, but it really should be included in the cost of the regular ticket since the films are played on a loop every 20 minutes and don't offer any other kind of service. Not sure I would come back but it was fun for what it was. Would recommend for a one-time experience.", "pics": null}}, {"review": {"des": "What an amazing place. This is one of the nicest aquariums I've been in. Everything is well laid out and I saw so many species I've never seen or even heard of. The land & sea show was full of cuteness, sea lions, penguins and whales. I tired out this place is so large. If you come in winter Bring quarters for lockers so you do not have to carry large jackets!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ljnCg9GLpzbxqHkJToOmIg/348s.jpg", "caption": "Getting ready for a Dolphin Show"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/WX624uEhg779wwOtjPkwCA/168s.jpg", "caption": "Charlie"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/T4xsyOarJe1P9JQwOd4ktQ/168s.jpg", "caption": "Shedd Aquarium..busy today :)"}]}}, {"review": {"des": "I had a great time and so loved my visit at the aquarium! It's the perfect place for anyone and there is so much to see! A must do when in the city of Chicago!", "pics": null}}, {"review": {"des": "The Shedd is a Chicago institution - and for good reason. I've come here so many times over the years with family, out of town visitors, or for gala events (dining with the fish by candlelight is amazing!). You must come early to skip the lines and crowded scene of the afternoon. We always come first thing, get in with no waiting, and then leave in the afternoon when there are crowds. The dolphin show is a delight for kids and adults. They make it educational yet fun and it never fails to impress. There are fun hands on experiences to touch starfish, etc. another highlight is the main tank off the entry. So fun to watch the fish swim by and to try to identify them, and the feeding time is super fun to watch. Love the Shedd!", "pics": null}}, {"review": {"des": "If you're into aquariums, Shedd is a great place to go. Not the best aquarium I've been to... sometimes the iPads they had in front of exhibits/habitats weren't working... but overall a large variety of exhibits, good space provided for the habitats.  You will enjoy yourself, lots to see.", "pics": null}}, {"review": {"des": "As most other reviews have stated, the aquarium is over-priced especially for out of towners. But I am ok with paying a high ticket price in knowing that some of the funds will go back into caring for the animals.<br><br>Just a piece of advice for management and in training your staff to provide a better customer experience- never let your employees simply say, \"I don't know\" to a guest. Take a page out of Disney's book if you want to improve your guest experience. (And quite frankly, every other touristy place I've ever worked). If your employees don't know the answer- find out. That's why you have walky-talkies. There was an employee standing around in one of the exhibits doing nothing so I assume he was there to help answer questions or make sure guests are behaving. When I asked him a question, his response was \"I really don't know\" and that was it. So...get on your walky talky and ask someone? <br><br>In the gift shop, I overheard someone asking about whether or not the Sting ray touch was open. The shop attendee responded with, \"I don't know, maybe.\" And that was it. Really? I expected so much more out of an institution like Shedd. Perhaps it's time to revisit your training/orientation program and go back to the basics on how to enhance guest experiences.", "pics": null}}, {"review": {"des": "Super long line before entering! We were going to wait but it was crazy hot so we bought the CityPass and we got to go to the shorter line. It was still a long wait but a lot shorter than waiting to buy tickets. CityPass was really worth it especially if you go on a weekend. We went on a Thursday and it was crazy packed! <br><br>There are so many things to see here! It's one of the biggest aquarium we've been to. My bf loves fishes so he really enjoyed this place. Part of the CityPass included a free show that was 15-20 minutes. We watched Sea Monsters and it was a nice show about an extinct fish. There was also a place where you can touch a specific fish (totally forgot the name) but it was my bf's first time touching it and he was really happy about it. <br><br>Overall, this place is beautiful! Too crowded at times but it's a nice place. WIsh we stayed a little longer. I definitely recommend coming here!", "pics": null}}, {"review": {"des": "We had a great time at Shedd Aquarium! Took our 2 year old and 6 month old. There is is much to see, they have a wonderful play areas through out for the small children. We loved the beluga whales, the dolphins and the penguins. They have a wonderful small seashell petting area. All the tanks have so many different types of fish it is like playing wheres Waldo searching for a specific type. The tanks are super clean and well maintained. They have a very cool reptiles exhibit that our little ones loved. We had a wonder experience and when we are visiting Chicago we will definitely be back!!", "pics": null}}, {"review": {"des": "The Shedd Aquarium is a Chicago Landmark and a must see. Just the Exterior Architecture is fascinating!  The big Tip is to buy your tickets online and enter to the right that way you avoid the long line. The Abbott Oceanarium house the Begula Whales and Sea Lions. This is my favorite part of Shedd. Then heading down to Lower Level 2 has the Penguins and the underwater view area for the Begulas. So Cool!!  The other exhibits are show casing different aquatic areas around the world and the Amazon Exhibit was great. Overall I give Shedd 4 Stars just because of the expensive price tag of $39.95 per Adult. Thanks Shedd you did not disappoint!!", "pics": null}}, {"review": {"des": "FANTASTIC place for a day out! The fish, the shows, the atmosphere..it's all so beautiful and perfect! We got the CityGo pass, so were able to skip some long lines. <br>Also, you get a great skyline view of Chicago when you exit (to your right).", "pics": null}}, {"review": {"des": "I loved seeing the shark exhibit and how Shedd in working on preservation and conservation. Tropical fish and sting ray touch experience was great!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Kv7GH7YCJL2tAMN08HjrKg/348s.jpg", "caption": "Close encounter!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/L-6c96psY9Usd9DfarpPXQ/168s.jpg", "caption": "Unreal!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/JiPSxA46z3Mp-AwfwAHEmQ/168s.jpg", "caption": "Fantastic opportunity!"}]}}, {"review": {"des": "I visited the aquarium with my 20-month-old toddler this past November during our visit to Chicago. Friends had recommended I purchase tickets online in advance to avoid the lines so that's what we did. One thing I didn't like about the online ticketing process was that I had to choose a specific date for our visit. Any parent with a toddler knows that things are always unpredictable with our schedules so I was a little nervous about this. Luckily, things worked out and we were able to attend on the day we purchased our tickets for. <br><br>We got to the museum a little after it opened at 10am and there was no line at all. We walked straight in, through the bag check, and to the exhibits. I was delighted to see that the aquarium had quite a few exhibits and more animals than just aquatic ones. We saw snakes in the Amazon exhibit and even a porcupine! Our favorite exhibits were the ones with sea otters, penguins, and beluga whales as there are quite a bit of interactive things to do there. The best part of our experience was the aquatic presentation! The auditorium is incredible with the lake in the background. The show was very entertaining and featured dolphins, owls, and seals. My toddler loved the show! There is a café and a cafeteria with quite a few food options. There are several gift shops too. The staff were all very friendly and helpful. We would definitely come back if we were in town again in the future!", "pics": null}}, {"review": {"des": "We came to SHEDD Aquarium as it was one of the destinations we wanted to explore as part of our City Pass. A great deal as City Pass was $106 for five attractions, making admission $21.20 per attraction which includes fast passes for each attraction which would be an additional cost. Regular admission to SHEDD was $40 and the City Pass included admission to an aquatic show as well as a 4-D movie. We only had about an hour to explore as we were meeting up with other people and had a jam packed agenda. When you first enter, there is a large circular aquarium playing Caribbean music with sting rays, sea turtles and other fish. There was another room filled with aquariums where we saw sea horses etc. They had several interactive exhibits where you could pet starfish and sea urchins. They had several 4-D movies to choose from, sharks, a cartoon, and sea predators. It featured wind, vibrating chairs, and water sprayed on you to immerse you in the experience. The theatre is directly across from the gift shop which had adorable plush dolphins and penguins, as well as t-shirts, key chains and other souvenirs. We also saw penguins and my favorite part, the adorable playful sea otters which were fun to watch. SHEDD definitely draws in a lot of families and children. There were also several shows such as a dolphin and shark show to choose from which may be at an additional cost. We didn't have time for a show unfortunately. SHEDD offers all day admission so you can leave and come back which is nice. Lots to explore here and would love to return when I have more time to linger.", "pics": null}}, {"review": {"des": "I visit aquariums in every city I see (to my boyfriend's frustration at times) and I had a great time at Shedd. I definitely suggest taking the time to walk through and read all of the info in the rainforest section. Also, don't wait on the long line outside. Buy your ticket online on your phone as you walk up and skip that whole giant line. I am not sure why they didn't just do the same. After, take some time to walk around the park and get some great pictures of the city from the lake.", "pics": null}}, {"review": {"des": "This aquarium is HUGE! Four solid stars because the exhibits are extensive, the fish well cared for, and you can see beluga whales! How cool is that? It was packed and we still had fun. It's easy to spend several hours here so plan for at least two hours of aquarium fun. 4 out of 5 stars simply because I thought it was a little pricey. Yes it's great but it's so expensive that I won't be back for a long time. You feel like you need to see everything to get your money's worth. If it was closer to $20 I would probably make this more of a usual stop when in Chicago .", "pics": null}}, {"review": {"des": "Buy your tickets online and come early so it's not as crowded! Fantastic experience that entertained us for 3 hours! Highlights include an Amazon exhibit with giant turtles and fish, a polar exhibit with penguins and beluga whales, and a dolphin show. There are exhibits where you can reach your hand in to touch sturgeons, sting rays, and star fish! You have to wash your hands like a surgeon (up to the elbows!), to touch the sturgeon!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/4-9ouTT3iaA-McKrJ5Mhqw/348s.jpg", "caption": "Beluga whales at Shedd Aquarium"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/uPOhPN53sT2n2AODbiStuQ/168s.jpg", "caption": "Dolphins at Shedd Aquarium"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/8ZrTlihoIG5eHUfQ98hdCQ/168s.jpg", "caption": "Penguins at Shedd Aquarium"}]}}, {"review": {"des": "My wife and I were looking to pass a couple of hours on Sunday afternoon as we waited for our evening flight out of O'Hare.  Having grown up in Chicago, I had the privilege of visiting the aquarium on many childhood occasions.  I'm sad to state that the this visit didn't do much for me to reprise the past glory.<br><br>First, the admission and parking prices were extraordinary for \"walk-up\" out of town visitors.....well over $100 for two ---and that was with my $3 retired military discount, the sum of which I might opine is incidental, at best; otherwise, a bit insulting.<br><br>As you exit the ticket sales area, there is a pronounced and pervasive odor to contend with.  Stagnant water?  Maybe, but I have not noted same in other visited aquariums.  Lots of emphasis on interactive shows and displays --- the younger kids in attendance well-enjoyed, but the security staff was a bit heavy-handing in trying to limit where people stood/sat/entered and exited.  We also noted a fairly large number of \"empty\" exhibits.....water in a tank, but with no fish to be found.  Such the instance, some descriptive signage might have been better helpful.<br><br>And, not that your visitors likely attend for the Aquarium's cuisine, but presently, your food service options are very limited, both in terms of space and offering.  On a brighter note, your food service staff were cheerful and fully focused on attempting to provide a pleasant customer service experience.  Thank you.<br><br>In sum, I'm hopeful that others find the value in the Aquarium's offerings.  I was disappointed but am glad that I can accurately report my impressions to prospective attendees.", "pics": null}}, {"review": {"des": "The aquarium itself is great they have a lot of exhibits and animals. The beluga whales and the penguins are very cute. The problem I have is the staff. The security and staff member really irritated me and my group when they kept insisting we back away from the exhibits when we were a very reasonable distance away. The security folks need to realize they are there to keep people and animals safe, not harass the people who pay a lot of money to see the exhibits", "pics": null}}, {"review": {"des": "The Shedd is an amazing place to view all sorts of creatures you didn't know even existed. I thoroughly enjoyed my time here especially watching the beluga whales. Would highly recommend stopping here if you're looking for something cool to do and see in Chicago. The gift shop is sweet!", "pics": null}}, {"review": {"des": "This was a nightmare!! The place is poorly kept, full of mold, dust and bad smell! I am a Doctor and I can tell you that is a life hazard in there!<br>We arrived ar 3:30 pm and all the shows were done for the day! <br>Also the food court was closed! <br>15 minutes into our bad experience, we politely asked for our money back and of course we were refused and very badly treated by the manager! <br>We are world travelers and this never happened to us! I told the Aquarium administrator that I will place my comments in all the social media venues, so this predatory business will stop! I am amazed how the health department and department of state does not look into this place!<br>The place really needs to be shut off , remodeled and reopened!<br>Shame on you AQUARIUM!", "pics": null}}, {"review": {"des": "I thought the Shed Aquarium was nice. Expensive for just seeing fish,fish& more fish. <br>I really did think it was interesting how the  fish and octopus  we fed! <br>I loved hearing the stories of the animals in the center tank. <br>We seen this once won't be going back.", "pics": null}}, {"review": {"des": "I wasn't too impressed with this aquarium compared to ones that I've been to in the past (Georgia Aquarium and Dallas World Aquarium come to mind). It seemed more expensive than I would have expected for the number of exhibits that were available. <br><br>My spouse and I decided not to see any of the shows, since we know we've been spoiled seeing lots of great shows at Sea World (we both grew up in Orlando and visited often). <br><br>I liked the different sections upstairs and how they organized it in themes. There was a decent variety of species for such a small place. A highlight for me was seeing the otters; they are suuuuper cute! <br><br>I wouldn't go again now that I've experienced it, but it was nice to see what Chicago's aquarium offered, since St. Louis doesn't have one yet (not until 2019).", "pics": null}}]}